{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 18,
    "data": [
      {
        "id": 21924,
        "hadith_number": "2844",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Memelihara Anjing Kecuali Untuk Keperluan Tertentu",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA:",
        "english_text": "Narrated Abu Hurairah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم as saying: If anyone gets a dog, except a sheeping or hunting or a farm dog, a qirat of his reward will be deducted daily.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah RA: Nabi ﷺ bersabda: Sesiapa yang memelihara anjing, kecuali anjing gembala, anjing pemburu, atau anjing penjaga ladang, pahalanya akan dikurangkan sebanyak satu qirat setiap hari.",
        "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَخْبَرَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنْ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنِ اتَّخَذَ كَلْبًا إِلَّا كَلْبَ مَاشِيَةٍ أَوْ صَيْدٍ أَوْ زَرْعٍ انْتَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطٌ ."
      },
      {
        "id": 21925,
        "hadith_number": "2845",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Membunuh Anjing Kecuali yang Hitam Legam",
        "perawi_melayu": "Abdullah ibn Mughaffal",
        "english_text": "Narrated Abdullah ibn Mughaffal: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Were dogs not a species of creature I should command that they all be killed; but kill every pure black one.",
        "malay_translation": "Diriwayatkan daripada Abdullah ibn Mughaffal: Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Kalaulah anjing bukan sebahagian daripada makhluk hidup, nescaya aku perintahkan supaya semuanya dibunuh; tetapi bunuhlah setiap yang hitam legam.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ، ‏‏‏‏‏‏حَدَّثَنَا يُونُسُ، ‏‏‏‏‏‏عَنْ الْحَسَنِ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَوْلَا أَنَّ الْكِلَابَ أُمَّةٌ مِنَ الأُمَمِ لَأَمَرْتُ بِقَتْلِهَا فَاقْتُلُوا مِنْهَا الأَسْوَدَ الْبَهِيمَ ."
      },
      {
        "id": 21926,
        "hadith_number": "2846",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Arahan Membunuh Anjing dan Kemudian Larangan Membunuhnya",
        "perawi_melayu": "Jabir ibn Abdullah",
        "english_text": "Narrated Jabir ibn Abdullah: The Prophet of Allah صلی ‌اللہ ‌علیہ ‌وسلم ordered to kill dogs, and we were even killing a dog which a woman brought with her from the desert. Afterwards he forbade to kill them, saying: Confine yourselves to the type which is black.",
        "malay_translation": "Diriwayatkan daripada Jabir ibn Abdullah: Nabi Allah صلی ‌اللہ ‌علیہ ‌وسلم memerintahkan untuk membunuh anjing, dan kami bahkan membunuh anjing yang dibawa oleh seorang wanita dari padang pasir. Kemudian baginda melarang membunuh anjing, dan bersabda: Tumpukan perhatian kamu kepada jenis yang hitam.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو عَاصِمٍ، ‏‏‏‏‏‏عَنْ ابْنِ جُرَيْجٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي أَبُو الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ جَابِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَمَرَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَتْلِ الْكِلَابِ حَتَّى إِنْ كَانَتِ الْمَرْأَةُ تَقْدَمُ مِنَ الْبَادِيَةِ يَعْنِي بِالْكَلْبِ فَنَقْتُلُهُ، ‏‏‏‏‏‏ثُمَّ نَهَانَا عَنْ قَتْلِهَا، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ عَلَيْكُمْ بِالْأَسْوَدِ ."
      },
      {
        "id": 21927,
        "hadith_number": "2847",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukum Memburu dengan Anjing Terlatih dan Anak Panah Tanpa Bulu",
        "perawi_melayu": "Diriwayatkan daripada Adi bin Hatim RA",
        "english_text": "Narrated Adi bin Hatim: I asked the Prophet صلی ‌اللہ ‌علیہ ‌وسلم, and said: I set off my trained dogs, and they catch (something) for me: may I eat (it)? He said: When you set off trained dogs and mention Allah's name, eat what they catch for you. I said: Even if they killed (the game)? He said: Even if they killed (the game) as long as another dog does not join it. I said: I shoot with a featherless arrow, and it strikes the target, may I eat (it) ? He said: If you shoot with a featherless arrow and mention Allah's name, and it strikes the aim, and pierce it, eat it ; and if it strikes with its middle, do not eat (it).",
        "malay_translation": "Adi bin Hatim RA meriwayatkan: Saya bertanya kepada Nabi صلی ‌اللہ ‌علیہ ‌وسلم, dan berkata: Saya melepaskan anjing-anjing saya yang terlatih, dan mereka menangkap (sesuatu) untuk saya: bolehkah saya memakannya? Baginda bersabda: Apabila kamu melepaskan anjing-anjing terlatih dan menyebut nama Allah, makanlah apa yang mereka tangkap untukmu. Saya berkata: Walaupun mereka membunuh (binatang buruan)? Baginda bersabda: Walaupun mereka membunuh (binatang buruan) selagi anjing lain tidak menyertainya. Saya berkata: Saya memanah dengan anak panah tanpa bulu, dan ia mengenai sasaran, bolehkah saya memakannya? Baginda bersabda: Jika kamu memanah dengan anak panah tanpa bulu dan menyebut nama Allah, dan ia mengenai sasaran, dan menembusinya, makanlah ia; dan jika ia mengenai dengan bahagian tengahnya, jangan memakannya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، ‏‏‏‏‏‏حَدَّثَنَا جَرِيرٌ، ‏‏‏‏‏‏عَنْ مَنْصُورٍ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ هَمَّامٍ، ‏‏‏‏‏‏عَنْ عَدِيِّ بْنِ حَاتِمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ إِنِّي أُرْسِلُ الْكِلَابَ الْمُعَلَّمَةَ فَتُمْسِكُ عَلَيَّ أَفَآكُلُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِذَا أَرْسَلْتَ الْكِلَابَ الْمُعَلَّمَةَ وَذَكَرْتَ اسْمَ اللَّهِ فَكُلْ مِمَّا أَمْسَكْنَ عَلَيْكَ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ وَإِنْ قَتَلْنَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَإِنْ قَتَلْنَ مَا لَمْ يَشْرَكْهَا كَلْبٌ لَيْسَ مِنْهَا، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ أَرْمِي بِالْمِعْرَاضِ فَأُصِيبُ أَفَآكُلُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِذَا رَمَيْتَ بِالْمِعْرَاضِ، ‏‏‏‏‏‏وَذَكَرْتَ اسْمَ اللَّهِ فَأَصَابَ فَخَرَقَ فَكُلْ وَإِنْ أَصَابَ بِعَرْضِهِ فَلَا تَأْكُلْ ."
      },
      {
        "id": 21928,
        "hadith_number": "2848",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukum Berburu dengan Anjing yang Terlatih",
        "perawi_melayu": "Adi bin Hatim",
        "english_text": "Narrated Adi bin Hatim: I asked the Messenger of Allah. I said: We hunt with these dogs. He replied: When you set off your dog and mention Allah's name over it, eat what it catches for you, even if it kills it, except that the dog has eaten (any of it); if the dog has eaten (any of it), do not eat, for Im afraid it has caught it only for itself.",
        "malay_translation": "Diriwayatkan dari Adi bin Hatim: Aku bertanya kepada Rasulullah SAW. Aku berkata: Kami berburu dengan anjing-anjing ini. Baginda menjawab: Apabila engkau melepaskan anjingmu dan menyebut nama Allah ke atasnya, maka makanlah apa yang ditangkapnya untukmu, walaupun ia membunuhnya, kecuali jika anjing itu telah memakan (sebahagian daripadanya); jika anjing itu telah memakan (sebahagian daripadanya), janganlah engkau makan, kerana aku khuatir ia menangkapnya hanya untuk dirinya sendiri.",
        "arabic_text": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ فُضَيْلٍ، ‏‏‏‏‏‏عَنْ بَيَانٍ، ‏‏‏‏‏‏عَنْ عَامِرٍ، ‏‏‏‏‏‏عَنْ عَدِيِّ بْنِ حَاتِمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ إِنَّا نَصِيدُ بِهَذِهِ الْكِلَابِ، ‏‏‏‏‏‏فَقَالَ لِي:‏‏‏‏ إِذَا أَرْسَلْتَ كِلَابَكَ الْمُعَلَّمَةَ وَذَكَرْتَ اسْمَ اللَّهِ عَلَيْهَا فَكُلْ مِمَّا أَمْسَكْنَ عَلَيْكَ، ‏‏‏‏‏‏وَإِنْ قَتَلَ إِلَّا أَنْ يَأْكُلَ الْكَلْبُ فَإِنْ أَكَلَ الْكَلْبُ فَلَا تَأْكُلْ فَإِنِّي أَخَافُ أَنْ يَكُونَ إِنَّمَا أَمْسَكَهُ عَلَى نَفْسِهِ ."
      },
      {
        "id": 21929,
        "hadith_number": "2849",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukum Memburu dengan Anak Panah dan Anjing",
        "perawi_melayu": "Adi bin Hatim",
        "english_text": "Narrated Adi bin Hatim: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم as saying: When you shoot your arrow and mention Allah's name, and you find it (the game) after a day, and you do not find it in water, and you find in it only the mark of you arrow, eat (it). But if another dog joins your dogs, do not eat it, for you do not know maybe the one which was not yours has killed it.",
        "malay_translation": "Diriwayatkan daripada Adi bin Hatim: Nabi ﷺ bersabda: Apabila kamu memanah dan menyebut nama Allah, dan kamu menemuinya (buruan) selepas sehari, dan kamu tidak menemuinya di dalam air, dan kamu hanya menemui kesan anak panah kamu padanya, maka makanlah (ia). Tetapi jika anjing lain menyertai anjing-anjing kamu, jangan memakannya, kerana kamu tidak tahu mungkin yang membunuhnya adalah anjing yang bukan milik kamu.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيل، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادٌ، ‏‏‏‏‏‏عَنْ عَاصِمٍ الأَحْوَلِ، ‏‏‏‏‏‏عَنْ الشَّعْبِيِّ، ‏‏‏‏‏‏عَنْ عَدِيِّ بْنِ حَاتِمٍ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِذَا رَمَيْتَ بِسَهْمِكَ وَذَكَرْتَ اسْمَ اللَّهِ فَوَجَدْتَهُ مِنَ الْغَدِ، ‏‏‏‏‏‏وَلَمْ تَجِدْهُ فِي مَاءٍ وَلَا فِيهِ أَثَرٌ غَيْرَ سَهْمِكَ فَكُلْ، ‏‏‏‏‏‏وَإِذَا اخْتَلَطَ بِكِلَابِكَ كَلْبٌ مِنْ غَيْرِهَا فَلَا تَأْكُلْ لَا تَدْرِي لَعَلَّهُ قَتَلَهُ الَّذِي لَيْسَ مِنْهَا ."
      },
      {
        "id": 21930,
        "hadith_number": "2850",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Memakan Haiwan Buruan yang Mati Lemas dalam Air",
        "perawi_melayu": "Adi bin Hatim meriwayatkan bahawa",
        "english_text": "Narrated Adi bin Hatim: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم as saying: When the animal at which you shot falls in water, is drowned, and dies, do not eat.",
        "malay_translation": "Adi bin Hatim meriwayatkan: Nabi ﷺ bersabda: Apabila haiwan yang kamu panah jatuh ke dalam air, lalu lemas dan mati, maka janganlah kamu memakannya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ، ‏‏‏‏‏‏حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ، ‏‏‏‏‏‏أَخْبَرَنِي عَاصِمٌ الأَحْوَلُ، ‏‏‏‏‏‏عَنْ الشَّعْبِيِّ، ‏‏‏‏‏‏عَنْ عَدِيِّ بْنِ حَاتِمٍ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِذَا وَقَعَتْ رَمِيَّتُكَ فِي مَاءٍ فَغَرِقَ فَمَاتَ فَلَا تَأْكُلْ ."
      },
      {
        "id": 21931,
        "hadith_number": "2851",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukum Memakan Hasil Buruan Anjing Pemburu atau Burung Helang yang Terlatih",
        "perawi_melayu": "Diriwayatkan daripada Adi ibn Hatim",
        "english_text": "Narrated Adi ibn Hatim: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Eat what ever is caught for you by a dog or a hawk you have trained and set off when you have mentioned Allah's name. I said: (Does this apply) if it killed (the animal)? He said: When it kills it without eating any of it, for it caught it only for you. Abu Dawud said: If a hawk eats any of it, there is no harm (in eating it). If a dog eats it, it is disapproved (to eat the meat). If it drinks blood, there is no harm (in eating it).",
        "malay_translation": "Diriwayatkan daripada Adi ibn Hatim: Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Makanlah apa sahaja yang ditangkap untukmu oleh anjing atau burung helang yang telah kamu latih dan lepaskan apabila kamu telah menyebut nama Allah. Aku bertanya: (Adakah ini terpakai) jika ia membunuh (haiwan itu)? Baginda bersabda: Apabila ia membunuhnya tanpa memakan sedikit pun daripadanya, kerana ia menangkapnya hanya untukmu. Abu Dawud berkata: Jika burung helang memakan sebahagian daripadanya, tidak mengapa (memakannya). Jika anjing memakannya, adalah tidak disukai (untuk memakan dagingnya). Jika ia meminum darah, tidak mengapa (memakannya).",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، ‏‏‏‏‏‏حَدَّثَنَا مُجَالِدٌ، ‏‏‏‏‏‏عَنْ الشَّعْبِيِّ، ‏‏‏‏‏‏عَنْ عَدِيِّ بْنِ حَاتِمٍ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَا عَلَّمْتَ مِنْ كَلْبٍ أَوْ بَازٍ ثُمَّ أَرْسَلْتَهُ وَذَكَرْتَ اسْمَ اللَّهِ فَكُلْ مِمَّا أَمْسَكَ عَلَيْكَ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ وَإِنْ قَتَلَ قَالَ:‏‏‏‏ إِذَا قَتَلَهُ وَلَمْ يَأْكُلْ مِنْهُ شَيْئًا فَإِنَّمَا أَمْسَكَهُ عَلَيْكَ ، ‏‏‏‏‏‏قَالَ أَبُو دَاوُد الْبَازُ:‏‏‏‏ إِذَا أَكَلَ فَلَا بَأْسَ بِهِ وَالْكَلْبُ إِذَا أَكَلَ كُرِهَ، ‏‏‏‏‏‏وَإِنْ شَرِبَ الدَّمَ فَلَا بَأْسَ بِهِ."
      },
      {
        "id": 21932,
        "hadith_number": "2852",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukum Berburu dengan Anjing Pemburu",
        "perawi_melayu": "Diriwayatkan daripada Abu Thalabah al-Khushani",
        "english_text": "Narrated Abu Thalabah al-Khushani: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said about the game hunted by a dog: If you set off your dog and have mentioned Allah's name, eat (it), even if it eats any of it; and eat what your hands return you.",
        "malay_translation": "Diriwayatkan daripada Abu Thalabah al-Khushani: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda mengenai buruan yang ditangkap oleh anjing: Jika kamu melepaskan anjingmu dan telah menyebut nama Allah, maka makanlah (buruan itu), walaupun anjing itu memakan sebahagian daripadanya; dan makanlah apa yang dikembalikan oleh tanganmu.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، ‏‏‏‏‏‏حَدَّثَنَا هُشَيْمٌ، ‏‏‏‏‏‏حَدَّثَنَا دَاوُدُ بْنُ عَمْرٍو، ‏‏‏‏‏‏عَنْ بُسْرِ بْنِ عُبَيْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ، ‏‏‏‏‏‏عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَيْدِ الْكَلْبِ:‏‏‏‏ إِذَا أَرْسَلْتَ كَلْبَكَ وَذَكَرْتَ اسْمَ اللَّهِ فَكُلْ وَإِنْ أَكَلَ مِنْهُ وَكُلْ مَا رَدَّتْ عَلَيْكَ يَدَاكَ ."
      },
      {
        "id": 21933,
        "hadith_number": "2853",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukum Memakan Hasil Buruan yang Ditemui Setelah Beberapa Hari",
        "perawi_melayu": "Diriwayatkan daripada Adi ibn Hatim",
        "english_text": "Narrated Adi ibn Hatim: Messenger of Allah, one of us shoots at the game, and follows its mark for two or three days, and then finds it dead, and there is his arrow (pierced) in it, may he eat it? He said: Yes, if he wishes, or he said: he may eat if he wishes.",
        "malay_translation": "Diriwayatkan daripada Adi ibn Hatim: Rasulullah SAW, salah seorang daripada kami menembak buruan, dan mengikut jejaknya selama dua atau tiga hari, kemudian mendapatinya mati, dan terdapat anak panahnya (tertusuk) padanya, bolehkah dia memakannya? Baginda bersabda: Ya, jika dia mahu, atau baginda bersabda: dia boleh makan jika dia mahu.",
        "arabic_text": "حَدَّثَنَا الْحُسَيْنُ بْنُ مُعَاذِ بْنِ خُلَيْفٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الأَعْلَى، ‏‏‏‏‏‏حَدَّثَنَا دَاوُدُ، ‏‏‏‏‏‏عَنْ عَامِرٍ، ‏‏‏‏‏‏عَنْ عَدِيِّ بْنِ حَاتِمٍ، ‏‏‏‏‏‏أَنَّهُ قَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ أَحَدُنَا يَرْمِي الصَّيْدَ فَيَقْتَفِي أَثَرَهُ الْيَوْمَيْنِ وَالثَّلَاثَةَ، ‏‏‏‏‏‏ثُمَّ يَجِدُهُ مَيِّتًا وَفِيهِ سَهْمُهُ أَيَأْكُلُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ نَعَمْ إِنْ شَاءَ، ‏‏‏‏‏‏أَوْ قَالَ:‏‏‏‏ يَأْكُلُ إِنْ شَاءَ ."
      },
      {
        "id": 21934,
        "hadith_number": "2854",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukum Memburu dengan Panah dan Anjing Pemburu",
        "perawi_melayu": "Adi bin Hatim",
        "english_text": "Narrated Adi bin Hatim: I asked Prophet صلی ‌اللہ ‌علیہ ‌وسلم about featherless arrow. He said: If it strikes with its end, eat, and if it strikes with the middle part of it, do not eat, for it died by a violent blow. I said: I set off my dog? He replies: If you mention Allah's name, eat, otherwise do not eat. If it eats any of it, do not eat, for it caught for itself. He asked: I set off my dog, and I find with it another dog ? He replied: Do not eat, because you mentioned Allah's name on your dog.",
        "malay_translation": "Diriwayatkan daripada Adi bin Hatim: Aku bertanya kepada Nabi صلی ‌اللہ ‌علیہ ‌وسلم tentang anak panah yang tidak berbulu. Baginda bersabda: Jika ia mengenai dengan hujungnya, makanlah, dan jika ia mengenai dengan bahagian tengahnya, jangan makan, kerana ia mati disebabkan pukulan yang kuat. Aku bertanya: Aku melepaskan anjingku? Baginda menjawab: Jika kamu menyebut nama Allah, makanlah, jika tidak, jangan makan. Jika ia makan sebahagian daripadanya, jangan makan, kerana ia menangkap untuk dirinya sendiri. Dia bertanya: Aku melepaskan anjingku, dan aku mendapati bersamanya anjing lain? Baginda menjawab: Jangan makan, kerana kamu hanya menyebut nama Allah ke atas anjingmu.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، ‏‏‏‏‏‏حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ أَبِي السَّفَرِ، ‏‏‏‏‏‏عَنْ الشَّعْبِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ عَدِيُّ بْنُ حَاتِمٍ:‏‏‏‏ سَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْمِعْرَاضِ فَقَالَ:‏‏‏‏ إِذَا أَصَابَ بِحَدِّهِ فَكُلْ وَإِذَا أَصَابَ بِعَرْضِهِ فَلَا تَأْكُلْ فَإِنَّهُ وَقِيذٌ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ أُرْسِلُ كَلْبِي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِذَا سَمَّيْتَ فَكُلْ وَإِلَّا فَلَا تَأْكُلْ، ‏‏‏‏‏‏وَإِنْ أَكَلَ مِنْهُ فَلَا تَأْكُلْ فَإِنَّمَا أَمْسَكَ لِنَفْسِهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أُرْسِلُ كَلْبِي فَأَجِدُ عَلَيْهِ كَلْبًا آخَرَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ لَا تَأْكُلْ لِأَنَّكَ إِنَّمَا سَمَّيْتَ عَلَى كَلْبِكَ ."
      },
      {
        "id": 21935,
        "hadith_number": "2855",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukum Berburu dengan Anjing Terlatih dan Tidak Terlatih",
        "perawi_melayu": "Diriwayatkan daripada Abu Taa'labat bin al-Khushani",
        "english_text": "Narrated Abu Taa'labat bin al-Khushani: I said: Messenger of Allah, I hunt with my trained dog, and with my untrained dog? He said: 'What you hunt with your trained dog, mention Allah's names (on it) and eat; and what you hunt with your untrained dog, and you find in a position that you slaughter it, then eat.",
        "malay_translation": "Diriwayatkan daripada Abu Taa'labat bin al-Khushani: Aku berkata: Wahai Rasulullah, aku berburu dengan anjingku yang terlatih, dan dengan anjingku yang tidak terlatih? Baginda bersabda: 'Apa yang kamu buru dengan anjingmu yang terlatih, sebutlah nama Allah (ke atasnya) dan makanlah; dan apa yang kamu buru dengan anjingmu yang tidak terlatih, dan kamu mendapatinya dalam keadaan yang kamu boleh menyembelihnya, maka makanlah.'",
        "arabic_text": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، ‏‏‏‏‏‏عَنْ ابْنِ الْمُبَارَكِ، ‏‏‏‏‏‏عَنْ حَيْوَةَ بْنِ شُرَيْحٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ رَبِيعَةَ بْنَ يَزِيدَ الدِّمَشْقِيَّ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ أَخْبَرَنِي أَبُو إِدْرِيسَ الْخَوْلَانِيُّ عَائِذُ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ أَبَا ثَعْلَبَةَ الْخُشَنِيَّ يَقُولُ:‏‏‏‏ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أَصِيدُ بِكَلْبِي الْمُعَلَّمِ وَبِكَلْبِي الَّذِي لَيْسَ بِمُعَلَّمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَا صِدْتَ بِكَلْبِكَ الْمُعَلَّمِ فَاذْكُرِ اسْمَ اللَّهِ، ‏‏‏‏‏‏وَكُلْ وَمَا أَصَّدْتَ بِكَلْبِكَ الَّذِي لَيْسَ بِمُعَلَّمٍ فَأَدْرَكْتَ ذَكَاتَهُ فَكُلْ ."
      },
      {
        "id": 21936,
        "hadith_number": "2856",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Makanan yang Diperoleh dari Busur, Anjing Pemburu, dan Tangan",
        "perawi_melayu": "Diriwayatkan daripada Abu Thalabah al-Khushani:",
        "english_text": "Narrated Abu Thalabah al-Khushani: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said to me: Abu Thalabah, eat what returns to you by your bow and your dog. Ibn Harb's version adds: The trained (dog), and your hand, then eat, whether it has been slaughtered or not slaughtered .",
        "malay_translation": "Diriwayatkan daripada Abu Thalabah al-Khushani: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda kepadaku: Wahai Abu Thalabah, makanlah apa yang dikembalikan kepadamu oleh busurmu dan anjingmu. Versi Ibn Harb menambah: Anjing yang terlatih, dan tanganmu, maka makanlah, sama ada ia telah disembelih atau tidak disembelih.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ. ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى، ‏‏‏‏‏‏حَدَّثَنَا بَقِيَّةُ، ‏‏‏‏‏‏عَنْ الزُّبَيْدِيِّ، ‏‏‏‏‏‏حَدَّثَنَايُونُسُ بْنُ سَيْفٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو إِدْرِيسَ الْخَوْلَانِيُّ، ‏‏‏‏‏‏حَدَّثَنِي أَبُو ثَعْلَبَةَ الْخُشَنِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَا أَبَا ثَعْلَبَةَ كُلْ مَا رَدَّتْ عَلَيْكَ قَوْسُكَ وَكَلْبُكَ زَادَ عَنْ ابْنِ حَرْبٍ الْمُعَلَّمُ وَيَدُكَ فَكُلْ ذَكِيًّا وَغَيْرَ ذَكِيٍّ ."
      },
      {
        "id": 21937,
        "hadith_number": "2857",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukum Buruan Anjing Pemburu, Panah dan Penggunaan Bekas Orang Majusi",
        "perawi_melayu": "Diriwayatkan oleh Abdullah ibn Amr ibn al-As:",
        "english_text": "Narrated Abdullah ibn Amr ibn al-As: There was a bedouin called Abu Thalabah. He said: Messenger of Allah, I have trained dogs, so tell me your opinion about (eating) the animal they hunt. The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: If you have trained dogs, then eat what they catch for you. He asked: Whether it is slaughtered or not? He replied: Yes. He asked: Does it apply even if it eats any of it? He replied: Even if it eats any of it. He again asked: Messenger of Allah, tell me your opinion about my bow (i. e. the game hunted by arrow). He said: Eat what your bow returns to you, whether it is slaughtered or not. He asked: If it goes out of my sight? He replied: Even if it goes out of your sight, provided it has no stench, or you find a mark on it other than the mark of your arrow. He asked: Tell me about the use of the vessels of the Magians when we are forced to use them. He replied: Wash them and eat in them.",
        "malay_translation": "Diriwayatkan oleh Abdullah ibn Amr ibn al-As: Ada seorang Badwi bernama Abu Thalabah. Dia berkata: Wahai Rasulullah, saya mempunyai anjing-anjing yang terlatih, jadi beritahulah saya pendapatmu tentang (memakan) binatang buruan mereka. Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Jika kamu mempunyai anjing-anjing yang terlatih, maka makanlah apa yang mereka tangkap untukmu. Dia bertanya: Sama ada ia disembelih atau tidak? Baginda menjawab: Ya. Dia bertanya: Adakah ia terpakai walaupun ia memakan sebahagian daripadanya? Baginda menjawab: Walaupun ia memakan sebahagian daripadanya. Dia bertanya lagi: Wahai Rasulullah, beritahulah saya pendapatmu tentang busur panah saya (iaitu binatang buruan yang diburu dengan anak panah). Baginda bersabda: Makanlah apa yang dikembalikan oleh busur panahmu kepadamu, sama ada ia disembelih atau tidak. Dia bertanya: Jika ia hilang dari pandangan saya? Baginda menjawab: Walaupun ia hilang dari pandanganmu, asalkan ia tidak berbau busuk, atau kamu menjumpai kesan padanya selain daripada kesan anak panahmu. Dia bertanya: Beritahulah saya tentang penggunaan bekas-bekas orang Majusi apabila kita terpaksa menggunakannya. Baginda menjawab: Basuhlah mereka dan makanlah di dalamnya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمِنْهَالِ الضَّرِيرُ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، ‏‏‏‏‏‏حَدَّثَنَا حَبِيبٌ الْمُعَلِّمُ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏أَنَّ أَعْرَابِيًّا يُقَالُ لَهُ أَبُو ثَعْلَبَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ إِنَّ لِي كِلَابًا مُكَلَّبَةً فَأَفْتِنِي فِي صَيْدِهَا، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنْ كَانَ لَكَ كِلَابٌ مُكَلَّبَةٌ فَكُلْ مِمَّا أَمْسَكْنَ عَلَيْكَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ذَكِيًّا أَوْ غَيْرَ ذَكِيٍّ قَالَ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَإِنْ أَكَلَ مِنْهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَإِنْ أَكَلَ مِنْهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ أَفْتِنِي فِي قَوْسِي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُلْ مَا رَدَّتْ عَلَيْكَ قَوْسُكَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ذَكِيًّا أَوْ غَيْرَ ذَكِيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَإِنْ تَغَيَّبَ عَنِّي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَإِنْ تَغَيَّبَ عَنْكَ مَا لَمْ يَصِلَّ أَوْ تَجِدَ فِيهِ أَثَرًا غَيْرَ سَهْمِكَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَفْتِنِي فِي آنِيَةِ الْمَجُوسِ إِنِ اضْطُرِرْنَا إِلَيْهَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ اغْسِلْهَا وَكُلْ فِيهَا ."
      },
      {
        "id": 21938,
        "hadith_number": "2858",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukum Potongan Anggota Haiwan Semasa Hidup",
        "perawi_melayu": "Diriwayatkan daripada Abu Waqid:",
        "english_text": "Narrated Abu Waqid: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Whatever is cut off of an animal when it is alive is dead.",
        "malay_translation": "Diriwayatkan daripada Abu Waqid: Nabi ﷺ bersabda: Apa sahaja yang dipotong daripada haiwan ketika ia masih hidup, maka ia adalah bangkai.",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ دِينَارٍ، ‏‏‏‏‏‏عَنْ زَيْدِ بْنِ أَسْلَمَ، ‏‏‏‏‏‏عَنْ عَطَاءِ بْنِ يَسَارٍ،‏‏‏‏عَنْ أَبِي وَاقِدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَا قُطِعَ مِنَ الْبَهِيمَةِ وَهِيَ حَيَّةٌ فَهِيَ مَيْتَةٌ ."
      },
      {
        "id": 21939,
        "hadith_number": "2859",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Akibat Tinggal di Padang Pasir, Memburu, dan Mendekati Pemerintah",
        "perawi_melayu": "Abdullah ibn Abbas meriwayatkan bahawa Nabi ﷺ bersabda: (Perawi Sufyan berkata: Saya tidak tahu melainkan ia [riwayat] telah diriwayatkan daripada Nabi ﷺ: Sesiapa yang tinggal di padang pasir akan menjadi kasar; sesiapa yang mengejar buruan akan menjadi lalai, dan sesiapa yang mengunjungi raja akan terpesona.",
        "english_text": "Narrated Abdullah ibn Abbas: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: (the narrator Sufyan said: I do not know but that it [the tradition] has been transmitted from the Prophet صلی ‌اللہ ‌علیہ ‌وسلم: He who lives in the desert will become rude; he who pursues the game will be negligent, and he who visits a king will be perverted.",
        "malay_translation": "Abdullah ibn Abbas meriwayatkan: Nabi ﷺ bersabda: (Perawi Sufyan berkata: Saya tidak pasti tetapi [riwayat ini] telah disampaikan daripada Nabi ﷺ: Sesiapa yang tinggal di padang pasir akan menjadi kasar; sesiapa yang mengejar buruan akan menjadi lalai, dan sesiapa yang mengunjungi pemerintah akan terpesona.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏حَدَّثَنِي أَبُو مُوسَى، ‏‏‏‏‏‏عَنْ وَهْبِ بْنِ مُنَبِّهٍ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَقَالَ مَرَّةً سُفْيَانُ، ‏‏‏‏‏‏وَلَا أَعْلَمُهُ إِلَّا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ سَكَنَ الْبَادِيَةَ جَفَا، ‏‏‏‏‏‏وَمَنِ اتَّبَعَ الصَّيْدَ غَفَلَ، ‏‏‏‏‏‏وَمَنْ أَتَى السُّلْطَانَ افْتُتِنَ ."
      },
      {
        "id": 21940,
        "hadith_number": "2860",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Bahaya Mendekati Penguasa (Sultan)",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Narrated Abu Hurairah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: He said: He who sticks to a king is perverted. This version adds: The nearer a servant (of Allah) goes to a king, the farther he keeps away from Allah.",
        "malay_translation": "Diriwayatkan dari Abu Hurairah: Nabi ﷺ bersabda: Baginda bersabda: Sesiapa yang terlalu mendekati seorang raja (penguasa), dia akan terfitnah (sesat). Dalam riwayat ini ditambahkan: Semakin seorang hamba (Allah) mendekati seorang raja, semakin jauh dia dari Allah.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، ‏‏‏‏‏‏حَدَّثَنَا الْحَسَنُ بْنُ الْحَكَمِ النَّخَعِيُّ، ‏‏‏‏‏‏عَنْ عَدِيِّ بْنِ ثَابِتٍ، ‏‏‏‏‏‏عَنْ شَيْخٍ مِنَ الأَنْصَارِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى مُسَدَّدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَمَنْ لَزِمَ السُّلْطَانَ افْتُتِنَ زَادَ، ‏‏‏‏‏‏وَمَا ازْدَادَ عَبْدٌ مِنَ السُّلْطَانِ دُنُوًّا إِلَّا ازْدَادَ مِنَ اللَّهِ بُعْدًا ."
      },
      {
        "id": 21941,
        "hadith_number": "2861",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukum Memakan Haiwan Buruan yang Ditemui Selepas Tiga Hari",
        "perawi_melayu": "Diriwayatkan daripada Abu Thalabah al-Khushani",
        "english_text": "Narrated Abu Thalabah al-Khushani: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: When you shoot your arrow (and the animal goes out of your sight) and you come three days later on it, and in it there is your arrow, then eat provided it has not stench.",
        "malay_translation": "Diriwayatkan daripada Abu Thalabah al-Khushani: Nabi ﷺ bersabda: Apabila kamu memanah buruan (dan haiwan itu hilang dari pandangan kamu) dan kamu menemuinya tiga hari kemudian, dan terdapat anak panah kamu padanya, maka makanlah ia selagi mana ia tidak berbau busuk.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ الْخَيَّاطُ، ‏‏‏‏‏‏عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِذَا رَمَيْتَ الصَّيْدَ فَأَدْرَكْتَهُ بَعْدَ ثَلَاثِ لَيَالٍ وَسَهْمُكَ فِيهِ فَكُلْهُ مَا لَمْ يُنْتِنْ ."
      }
    ]
  }
}