{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 55,
    "data": [
      {
        "id": 23239,
        "hadith_number": "4159",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Menyisir Rambut Kecuali Selang Sehari",
        "perawi_melayu": "Abdullah ibn Mughaffal",
        "english_text": "Narrated Abdullah ibn Mughaffal: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم forbade combing the hair except every second day.",
        "malay_translation": "Diriwayatkan daripada Abdullah ibn Mughaffal: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم melarang menyisir rambut kecuali selang sehari.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ حَسَّانَ، ‏‏‏‏‏‏عَنِ الْحَسَنِ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ التَّرَجُّلِ إِلَّا غِبًّا ."
      },
      {
        "id": 23240,
        "hadith_number": "4160",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Bermewah-mewahan dan Sunnah Berjalan Tanpa Kasut",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Abdullah ibn Buraydah said: A man from the companions of the Prophet صلی ‌اللہ ‌علیہ ‌وسلم travelled to Fudalah ibn Ubayd when he was in Egypt. He came to him and said: I have not come to you to visit you. But you and I heard a tradition from the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم. I hope you may have some knowledge of it. He asked: What is it? He replied: So and so. He said: Why do I see you dishevelled when you are the ruler of this land? He said: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم has forbidden us to indulge much in luxury. He said: Why do I see you unshod? He replied: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم used to command us to go barefoot at times.",
        "malay_translation": "Abdullah ibn Buraydah meriwayatkan: Seorang lelaki daripada kalangan sahabat Nabi Muhammad SAW telah bermusafir menemui Fudalah ibn Ubayd ketika beliau berada di Mesir. Lelaki itu datang kepadanya dan berkata: \"Sesungguhnya, saya datang bukan untuk menziarahi kamu. Tetapi, saya dan kamu pernah mendengar sebuah hadis daripada Rasulullah SAW. Saya berharap kamu mempunyai pengetahuan tentangnya.\" Fudalah bertanya: \"Hadis apa itu?\" Lelaki itu menjawab: \"Begini dan begini.\" Kemudian lelaki itu berkata: \"Mengapa saya melihat kamu berkeadaan tidak terurus sedangkan kamu adalah pemerintah di negeri ini?\" Fudalah menjawab: \"Sesungguhnya Rasulullah SAW melarang kami daripada terlalu bermewah-mewahan.\" Lelaki itu bertanya lagi: \"Mengapa saya melihat kamu tidak memakai kasut?\" Fudalah menjawab: \"Nabi SAW pernah memerintahkan kami untuk berjalan tanpa kasut pada sesetengah waktu.\"",
        "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، ‏‏‏‏‏‏أَخْبَرَنَا الْجُرَيْرِيُّ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ أَنَّ رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَحَلَ إِلَى فَضَالَةَ بْنِ عُبَيْدٍ وَهُوَ بِمِصْرَ، ‏‏‏‏‏‏فَقَدِمَ عَلَيْهِ فَقَالَ:‏‏‏‏ أَمَا إِنِّي لَمْ آتِكَ زَائِرًا وَلَكِنِّي سَمِعْتُ أَنَا وَأَنْتَ حَدِيثًا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجَوْتُ أَنْ يَكُونَ عِنْدَكَ مِنْهُ عِلْمٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَمَا هُوَ ؟ قَالَ:‏‏‏‏ كَذَا وَكَذَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَمَا لِي أَرَاكَ شَعِثًا وَأَنْتَ أَمِيرُ الْأَرْضِ ؟ قَالَ:‏‏‏‏ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَنْهَانَا عَنْ كَثِيرٍ مِنَ الْإِرْفَاهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَمَا لِي لَا أَرَى عَلَيْكَ حِذَاءً ؟ قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُنَا أَنْ نَحْتَفِيَ أَحْيَانًا ."
      },
      {
        "id": 23241,
        "hadith_number": "4161",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Keutamaan Berpakaian Sederhana",
        "perawi_melayu": "Abu Umamah Ilyas ibn Thalabah",
        "english_text": "Narrated Abu Umamah Ilyas ibn Thalabah: The Companions of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم mentioned this word before him. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said: Listen, listen! Wearing old clothes is a part of faith, wearing old clothes is a part of faith. Abu Dawud said: He is Abu Umamah bin Thalabat al-Ansari",
        "malay_translation": "Diriwayatkan daripada Abu Umamah Ilyas ibn Thalabah: Para Sahabat Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم menyebut tentang perkara ini di hadapan baginda. Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: \"Dengarlah, dengarlah! Sesungguhnya memakai pakaian yang sederhana adalah sebahagian daripada iman, memakai pakaian yang sederhana adalah sebahagian daripada iman.\" Abu Dawud berkata: Beliau adalah Abu Umamah bin Thalabat al-Ansari.",
        "arabic_text": "حَدَّثَنَا النُّفَيْلِيُّ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ إِسْحَاق، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أُمَامَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ، ‏‏‏‏‏‏عَنْ أَبِي أُمَامَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ذَكَرَ أَصْحَابُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا عِنْدَهُ الدُّنْيَا، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَلَا تَسْمَعُونَ أَلَا تَسْمَعُونَ إِنَّ الْبَذَاذَةَ مِنَ الْإِيمَانِ، ‏‏‏‏‏‏إِنَّ الْبَذَاذَةَ مِنَ الْإِيمَانِ يَعْنِي التَّقَحُّلَ ، ‏‏‏‏‏‏قَالَ أَبُو دَاوُد:‏‏‏‏ هُوَ أَبُو أُمَامَةَ بْنُ ثَعْلَبَةَ الْأَنْصَارِيُّ."
      },
      {
        "id": 23242,
        "hadith_number": "4162",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Nabi Menggunakan Sikkah untuk Berwangian",
        "perawi_melayu": "Anas ibn Malik",
        "english_text": "Narrated Anas ibn Malik: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم had sikkah with which he perfumed himself.",
        "malay_translation": "Diriwayatkan daripada Anas ibn Malik: Nabi صلی ‌اللہ ‌علیہ ‌وسلم mempunyai sikkah yang digunakan untuk berwangian.",
        "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو أَحْمَدَ، ‏‏‏‏‏‏عَنْ شَيْبَانَ بْنِ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ الْمُخْتَارِ، ‏‏‏‏‏‏عَنْ مُوسَى بْنِ أَنَسٍ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَتْ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُكَّةٌ يَتَطَيَّبُ مِنْهَا ."
      },
      {
        "id": 23243,
        "hadith_number": "4163",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Anjuran Memuliakan Rambut",
        "perawi_melayu": "Abu Hurairah R.A.",
        "english_text": "Narrated Abu Hurairah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: He who has hair should honour it.",
        "malay_translation": "Diriwayatkan dari Abu Hurairah R.A.: Nabi Muhammad SAW bersabda: Sesiapa yang mempunyai rambut, hendaklah dia memuliakannya.",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ، ‏‏‏‏‏‏أَخْبَرَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏حَدَّثَنِي ابْنُ أَبِي الزِّنَادِ، ‏‏‏‏‏‏عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ كَانَ لَهُ شَعْرٌ، ‏‏‏‏‏‏فَلْيُكْرِمْهُ ."
      },
      {
        "id": 23244,
        "hadith_number": "4164",
        "status": "sahih",
        "nama_buku": "Sunan Abu Daud",
        "penulis_buku": "Imam Abu Dawud Sulaiman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukum Inai dan Bau yang Tidak Disukai Rasulullah SAW",
        "perawi_melayu": "Karimah binti Hammam",
        "english_text": "Narrated Aishah, Ummul Muminin: Karimah, daughter of Hammam, told that a woman came to Aishah (Allah be pleased with her) and asked her about dyeing with henna. She replied: There is no harm, but I do not like it. My beloved, the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم, disliked its odour. Abu Dawud said: She meant the colour of hair of the head.",
        "malay_translation": "Diriwayatkan daripada Aisyah, Ummul Muminin: Karimah binti Hammam, menceritakan bahawa seorang wanita datang kepada Aisyah (semoga Allah meredhainya) dan bertanya kepadanya tentang mewarna dengan inai. Beliau menjawab: Tidak mengapa, tetapi saya tidak menyukainya. Kekasihku, Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم, tidak menyukai baunya. Abu Daud berkata: Beliau maksudkan warna rambut kepala.",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ‏‏‏‏‏‏عَنْ عَلِيِّ بْنِ الْمُبَارَكِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَتْنِي كَرِيمَةُ بِنْتُ هَمَّامٍ، ‏‏‏‏‏‏ أَنَّ امْرَأَةً أَتَتْ عَائِشَةَ رضِيَ اللَّهُ عَنْ خِضَابِ الْحِنَّاءِ، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ لَا بَأْسَ بِهِ وَلَكِنْ أَكْرَهُهُ، ‏‏‏‏‏‏كَانَ حَبِيبِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَكْرَهُ رِيحَهُ ، ‏‏‏‏‏‏قَالَ أَبُو دَاوُد:‏‏‏‏ تَعْنِي خِضَابَ شَعْرِ الرَّأْسِ."
      },
      {
        "id": 23245,
        "hadith_number": "4165",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Bai'ah Hind dan Tapak Tangan Seperti Kaki Binatang Buas",
        "perawi_melayu": "Aishah, Ummul Muminin",
        "english_text": "Narrated Aishah, Ummul Muminin: When Hind, daughter of Utbah, said: Prophet of Allah, accept my allegiance, he replied; I shall not accept your allegiance till you make a difference to the palms of your hands; for they look like the paws of a beast of prey.",
        "malay_translation": "Diriwayatkan daripada Aishah, Ummul Muminin: Ketika Hind, puteri Utbah, berkata: Wahai Nabi Allah, terimalah bai'ahku, baginda menjawab; Aku tidak akan menerima bai'ahmu sehingga kamu mengubah tapak tanganmu; kerana ia kelihatan seperti kaki binatang buas.",
        "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏حَدَّثَتْنِي غِبْطَةُ بِنْتُ عَمْرٍو الْمُجَاشِعِيَّةُ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ حَدَّثَتْنِي عَمَّتِي أُمُّ الْحَسَنِ، ‏‏‏‏‏‏عَنْ جَدَّتِهَا، ‏‏‏‏‏‏عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، ‏‏‏‏‏‏أَنَّ هَنْدَ بِنْتَ عُتْبَةَ قَالَتْ:‏‏‏‏ يَا نَبِيَّ اللَّهِ بَايِعْنِي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا أُبَايِعُكِ حَتَّى تُغَيِّرِي كَفَّيْكِ كَأَنَّهُمَا كَفَّا سَبُعٍ ."
      },
      {
        "id": 23246,
        "hadith_number": "4166",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Wanita Disuruh Membezakan Tangan dengan Inai",
        "perawi_melayu": "Diriwayatkan dari Aisyah R.A., Ummul Muminin:",
        "english_text": "Narrated Aishah, Ummul Muminin: A woman made a sign from behind a curtain to indicate that she had a letter for the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم. The Prophet صلی ‌اللہ ‌علیہ ‌وسلم closed his hand, saying: I do not know this is a man's or a woman's hand. She said: No, a woman. He said: If you were a woman, you would make a difference to your nails, meaning with henna.",
        "malay_translation": "Diriwayatkan dari Aisyah R.A., Ummul Muminin: Seorang wanita memberi isyarat dari belakang tabir untuk menunjukkan bahawa dia mempunyai surat untuk Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم. Nabi صلی ‌اللہ ‌علیہ ‌وسلم menggenggam tangannya, seraya bersabda: Aku tidak tahu ini tangan lelaki atau tangan wanita. Wanita itu berkata: Bukan, wanita. Baginda bersabda: Sekiranya kamu seorang wanita, kamu pasti akan membuat perubahan pada kuku kamu, maksudnya dengan inai.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُحَمَّدٍ الصُّورِيُّ، ‏‏‏‏‏‏حَدَّثَنَا خَالِدُ بْنُ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏حَدَّثَنَا مُطِيعُ بْنُ مَيْمُونٍ، ‏‏‏‏‏‏عَنْ صَفِيَّةَ بِنْتِ عِصْمَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ أَوْمَتِ امْرَأَةٌ مِنْ وَرَاءِ سِتْرٍ بِيَدِهَا كِتَابٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَبَضَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا أَدْرِي أَيَدُ رَجُلٍ أَمْ يَدُ امْرَأَةٍ ؟ قَالَتْ:‏‏‏‏ بَلِ امْرَأَةٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَوْ كُنْتِ امْرَأَةً لَغَيَّرْتِ أَظْفَارَكِ يَعْنِي بِالْحِنَّاءِ ."
      },
      {
        "id": 23247,
        "hadith_number": "4167",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Terhadap Amalan yang Membinasakan Bani Israil",
        "perawi_melayu": "Humaid bin Abd al-Rahman",
        "english_text": "Narrated Humaid bin Adb al-Rahman: That he heard Muawiyah bin Abi Sufyan say during the Hajj when he was on the pulpit and took a lock of hair which was in the hand of the guard, saying: O people of Madina, where are your scholars ? I heard the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم forbidding such a think as this and said: The children of Isra'il perished when their women practised it.",
        "malay_translation": "Diriwayatkan daripada Humaid bin Abd al-Rahman: Bahawa beliau mendengar Muawiyah bin Abi Sufyan berkata semasa Haji ketika beliau berada di atas mimbar dan mengambil sepotong rambut yang berada di tangan pengawal, sambil berkata: Wahai penduduk Madinah, di manakah ulama kamu? Aku mendengar Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم melarang perkara seperti ini dan bersabda: Sesungguhnya binasa Bani Israil apabila wanita mereka mengamalkan perkara ini.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنِ ابْنِ شِهَابٍ، ‏‏‏‏‏‏عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ عَامَ حَجَّ، ‏‏‏‏‏‏وَهُوَ عَلَى الْمِنْبَرِ وَتَنَاوَلَ قُصَّةً مِنْ شَعْرٍ كَانَتْ فِي يَدِ حَرَسِيٍّ يَقُولُ:‏‏‏‏ يَا أَهْلَ الْمَدِينَةِ أَيْنَ عُلَمَاؤُكُمْ ؟ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْ مِثْلِ هَذِهِ وَيَقُولُ:‏‏‏‏ إِنَّمَا هَلَكَتْ بَنُو إِسْرَائِيلَ حِينَ اتَّخَذَ هَذِهِ نِسَاؤُهُمْ ."
      },
      {
        "id": 23248,
        "hadith_number": "4168",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Menambah Rambut Palsu dan Bertatu",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Abdullah said: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم cursed the woman who adds some false hair and the woman who asks for it, the woman who tattoos and the woman who asks for it.",
        "malay_translation": "Abdullah berkata: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم melaknat wanita yang menambah rambut palsu dan wanita yang meminta untuk ditambahkan rambut palsu, wanita yang membuat tatu dan wanita yang meminta untuk dibuatkan tatu.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، ‏‏‏‏‏‏وَمُسَدَّدٌ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي نَافِعٌ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ وَالْوَاشِمَةَ وَالْمُسْتَوْشِمَةَ ."
      },
      {
        "id": 23249,
        "hadith_number": "4169",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Mentatu, Menyambung Rambut, Mencabut Bulu Muka dan Merenggangkan Gigi untuk Kecantikan",
        "perawi_melayu": "Abdullah bin Mas'ud",
        "english_text": "Abdullah (b. Mas'us) said: Allah has cursed the woman who tattoo and the women who have themselves tattooed, the women who add false hair (according to the version of Muhammad bin Isa) and the women who pluck hairs from their faces (according to the version on Uthman). The agreed version then goes: The women who spaces between their teeth for beauty, changing what Allah has created. When a woman of Banu Asad called Umm Ya'qub, who read the Quran (according to the version of Uthman) heard it, she came to him (according to the agreed version) and said: I have heard that you have cursed the women who tattoo, those have themselves tattooed, those who add false hair (according to the version of Muhammad), those pluck hairs from their faces, and those who make spaces between their teeth (according to the agreed version), for changing what Allah has created (according to the version of Uthman). He said: Why should I not curse those whom the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم had cursed and those who were mentioned in Allah's Book ? She said: I have read it from cover to cover and have not found in it. He said: I swear by Allah, if you read it, you would have found it. He then read: What the Messenger has brought you accept, and what he has forbidden refrain from it. She said: I find some of these thing in you wife. He said: Enter (the house) and see. She said: I then entered (the house) and came out. He asked: What did you see ? She said: I did not see (anything). He said: Had it been so, she would have not have been with us. This is according to the version of Uthman.",
        "malay_translation": "Abdullah bin Mas'ud berkata: Allah melaknat wanita yang mentatu dan wanita yang meminta untuk ditatu, wanita yang menambah rambut palsu (menurut riwayat Muhammad bin Isa) dan wanita yang mencabut bulu dari wajah mereka (menurut riwayat Uthman). Riwayat yang disepakati kemudian berlanjut: Wanita yang merenggangkan gigi mereka untuk kecantikan, mengubah ciptaan Allah. Ketika seorang wanita dari Bani Asad bernama Umm Ya'qub, yang membaca Al-Quran (menurut riwayat Uthman) mendengarnya, dia datang kepadanya (menurut riwayat yang disepakati) dan berkata: Saya telah mendengar bahawa anda telah melaknat wanita yang mentatu, mereka yang meminta untuk ditatu, mereka yang menambah rambut palsu (menurut riwayat Muhammad), mereka yang mencabut bulu dari wajah mereka, dan mereka yang membuat renggangan antara gigi mereka (menurut riwayat yang disepakati), kerana mengubah ciptaan Allah (menurut riwayat Uthman). Dia berkata: Mengapa saya tidak melaknat orang-orang yang telah dilaknat oleh Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم dan mereka yang disebutkan dalam Kitab Allah? Wanita itu berkata: Saya telah membacanya dari awal hingga akhir dan tidak menemukannya di dalamnya. Dia berkata: Saya bersumpah demi Allah, jika kamu membacanya, kamu pasti akan menemukannya. Kemudian dia membaca: Apa yang Rasulullah bawa kepada kamu maka terimalah, dan apa yang dilarang-Nya maka tinggalkanlah. Wanita itu berkata: Saya melihat beberapa perkara ini pada isteri anda. Dia berkata: Masuklah (ke rumah) dan lihatlah. Wanita itu berkata: Kemudian saya masuk (ke rumah) dan keluar. Dia bertanya: Apa yang kamu lihat? Wanita itu berkata: Saya tidak melihat (apa-apa). Dia berkata: Jika ada perkara itu, dia tidak akan bersama kita. Ini adalah menurut riwayat Uthman.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، ‏‏‏‏‏‏وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ الْمَعْنَى، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا جَرِيرٌ، ‏‏‏‏‏‏عَنْ مَنْصُورٍ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ عَلْقَمَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَعَنَ اللَّهُ الْوَاشِمَاتِ، ‏‏‏‏‏‏قَالَ مُحَمَّدٌ:‏‏‏‏ وَالْوَاصِلَاتِ، ‏‏‏‏‏‏وَقَالَ عُثْمَانُ:‏‏‏‏ وَالْمُتَنَمِّصَاتِ، ‏‏‏‏‏‏ثُمَّ اتَّفَقَا:‏‏‏‏ وَالْمُتَفَلِّجَاتِ لِلْحُسْنِ الْمُغَيِّرَاتِ خَلْقَ اللَّهِ عَزَّ وَجَلَّ، ‏‏‏‏‏‏فَبَلَغَ ذَلِكَ امْرَأَةً مِنْ بَنِي أَسَدٍ يُقَالُ لَهَا:‏‏‏‏ أُمُّ يَعْقُوبَ زَادَ عُثْمَانُ كَانَتْ تَقْرَأُ الْقُرْآنَ ثُمَّ اتَّفَقَا، ‏‏‏‏‏‏فَأَتَتْهُ فَقَالَتْ:‏‏‏‏ بَلَغَنِي عَنْكَ أَنَّكَ لَعَنْتَ الْوَاشِمَاتِ وَالْمُسْتَوْشِمَاتِ، ‏‏‏‏‏‏قَالَ مُحَمَّدٌ:‏‏‏‏ وَالْوَاصِلَاتِ، ‏‏‏‏‏‏وَقَالَ عُثْمَانُ:‏‏‏‏ وَالْمُتَنَمِّصَاتِ، ‏‏‏‏‏‏ثُمَّ اتَّفَقَا:‏‏‏‏ وَالْمُتَفَلِّجَاتِ، ‏‏‏‏‏‏قَالَ عُثْمَانُ:‏‏‏‏ لِلْحُسْنِ الْمُغَيِّرَاتِ خَلْقَ اللَّهِ تَعَالَى، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ وَمَا لِي لَا أَلْعَنُ مَنْ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي كِتَابِ اللَّهِ تَعَالَى، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ لَقَدْ قَرَأْتُ مَا بَيْنَ لَوْحَيِ الْمُصْحَفِ فَمَا وَجَدْتُهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ وَاللَّهِ لَئِنْ كُنْتِ قَرَأْتِيهِ لَقَدْ وَجَدْتِيهِ ثُمَّ قَرَأَ:‏‏‏‏ وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانْتَهُوا سورة الحشر آية 7، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ إِنِّي أَرَى بَعْضَ هَذَا عَلَى امْرَأَتِكَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَادْخُلِي فَانْظُرِي، ‏‏‏‏‏‏فَدَخَلَتْ ثُمَّ خَرَجَتْ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا رَأَيْتِ ؟ وَقَالَ عُثْمَانُ:‏‏‏‏ فَقَالَتْ:‏‏‏‏ مَا رَأَيْتُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ لَوْ كَانَ ذَلِكَ مَا كَانَتْ مَعَنَا ."
      },
      {
        "id": 23250,
        "hadith_number": "4170",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Amalan Rambut Palsu, Mencabut Bulu, dan Tatu bagi Wanita",
        "perawi_melayu": "Ibnu Abbas",
        "english_text": "Narrated Ibn Abbas: The woman who supplies fake hair and the one who asks for it, the woman who pulls out hair for other people and the woman who depilates herself, the woman who tattoos and the one who has it done when there is no disease to justify it have been cursed. Abu Dawud said: Wasilah means the woman who adds false hair to the hair of women. Mustawsilah means the one who asks for adding the hair to her hair. namisah means a woman who plucks hair from the brow until she makes it thin; mutanammisah means the woman who depilates herself ; washimah is a woman who tattoos in the face with antimony or ink ; mustawshimah is a woman with whom it is done.",
        "malay_translation": "Diriwayatkan dari Ibnu Abbas: Wanita yang menyambung rambut (rambut palsu) dan wanita yang meminta disambungkan rambutnya, wanita yang mencabut bulu untuk orang lain dan wanita yang mencabut bulu untuk dirinya sendiri, wanita yang membuat tatu dan wanita yang meminta dibuatkan tatu apabila tidak ada penyakit yang membenarkannya, mereka telah dilaknat. Abu Dawood berkata: 'Wasilah' bermaksud wanita yang menyambung rambut dengan rambut wanita lain. 'Mustawsilah' bermaksud wanita yang meminta untuk disambungkan rambutnya. 'Namisah' bermaksud wanita yang mencabut bulu kening sehingga menjadikannya nipis; 'mutanammisah' bermaksud wanita yang mencabut bulu untuk dirinya sendiri; 'washimah' adalah wanita yang membuat tatu di wajahnya dengan celak atau dakwat; 'mustawshimah' adalah wanita yang meminta dibuatkan tatu pada dirinya.",
        "arabic_text": "حَدَّثَنَا ابْنُ السَّرْحِ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏عَنْ أُسَامَةَ، ‏‏‏‏‏‏عَنْ أَبَانَ بْنِ صَالِحٍ، ‏‏‏‏‏‏عَنْ مُجَاهِدِ بْنِ جَبْرٍ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لُعِنَتِ الْوَاصِلَةُ وَالْمُسْتَوْصِلَةُ وَالنَّامِصَةُ وَالْمُتَنَمِّصَةُ وَالْوَاشِمَةُ وَالْمُسْتَوْشِمَةُ مِنْ غَيْرِ دَاءٍ ، ‏‏‏‏‏‏قَالَ أَبُو دَاوُد:‏‏‏‏ وَتَفْسِيرُ الْوَاصِلَةِ الَّتِي تَصِلُ الشَّعْرَ بِشَعْرِ النِّسَاءِ وَالْمُسْتَوْصِلَةُ الْمَعْمُولُ بِهَا، ‏‏‏‏‏‏وَالنَّامِصَةُ الَّتِي تَنْقُشُ الْحَاجِبَ حَتَّى تُرِقَّهُ وَالْمُتَنَمِّصَةُ الْمَعْمُولُ بِهَا، ‏‏‏‏‏‏وَالْوَاشِمَةُ الَّتِي تَجْعَلُ الْخِيلَانَ فِي وَجْهِهَا بِكُحْلٍ أَوْ مِدَادٍ وَالْمُسْتَوْشِمَةُ الْمَعْمُولُ بِهَا."
      },
      {
        "id": 23251,
        "hadith_number": "4171",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawood Sulaiman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Tidak Mengapa Mengikat Rambut dengan Sutera atau Bulu Biri-biri",
        "perawi_melayu": "Said bin Jubair",
        "english_text": "Saeed bin Jubair said: There is no harm in fastening the hair with silk or woollen threads. Abu Dawud said: It appears that he held the view that what is prohibited is the adding of the hair of women. Abu Dawud said: Ahmad (b. hanbal) used to say: There is no harm in tying the hair with silk or woollen threads.",
        "malay_translation": "Said bin Jubair berkata: Tidak mengapa mengikat rambut dengan benang sutera atau benang bulu biri-biri. Abu Dawood berkata: Nampaknya beliau berpandangan bahawa yang dilarang adalah menyambung rambut wanita. Abu Dawood berkata: Ahmad (b. Hanbal) biasa berkata: Tidak mengapa mengikat rambut dengan benang sutera atau benang bulu biri-biri.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرِ بْنِ زِيَادٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شَرِيَكٌ، ‏‏‏‏‏‏عَنْ سَالِمٍ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ جُبَيْرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا بَأْسَ بِالْقَرَامِلِ ، ‏‏‏‏‏‏قَالَ أَبُو دَاوُد:‏‏‏‏ كَأَنَّهُ يَذْهَبُ إِلَى أَنَّ الْمَنْهِيَّ عَنْهُ شُعُورُ النِّسَاءِ، ‏‏‏‏‏‏قَالَ أَبُو دَاوُد:‏‏‏‏ كَانَ أَحْمَدُ يَقُولُ الْقَرَامِلُ لَيْسَ بِهِ بَأْسٌ."
      },
      {
        "id": 23252,
        "hadith_number": "4172",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Jangan Menolak Pemberian Minyak Wangi",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah reported the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم as saying: If anyone is presented some perfume, he should not return it, for it is a thing of good fragrance and light to bear.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah ﷺ bersabda: Sekiranya seseorang dihulurkan minyak wangi, dia tidak seharusnya menolaknya, kerana ia adalah sesuatu yang harum baunya dan ringan untuk dibawa.",
        "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏وَهَارُونُ بْنُ عَبْدِ اللَّهِ الْمَعْنَى، ‏‏‏‏‏‏أَنَّ أَبَا عَبْدِ الرَّحْمَنِ الْمُقْرِئَ حَدَّثَهُمْ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ أَبِي أَيُّوبَ، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ، ‏‏‏‏‏‏عَنِ الْأَعْرَجِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ عُرِضَ عَلَيْهِ طِيبٌ فَلَا يَرُدَّهُ فَإِنَّهُ طَيِّبُ الرِّيحِ خَفِيفُ الْمَحْمَلِ ."
      },
      {
        "id": 23253,
        "hadith_number": "4173",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Daud Sulaiman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Wanita Memakai Wangian Ketika Melalui Orang Ramai",
        "perawi_melayu": "Abu Musa",
        "english_text": "Narrated Abu Musa: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: If a woman uses perfume and passes the people so that they may get its odour, she is so-and-so, meaning severe remarks.",
        "malay_translation": "Diriwayatkan daripada Abu Musa: Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Jika seorang wanita memakai minyak wangi dan melalui orang ramai sehingga mereka dapat mencium baunya, maka dia adalah seperti itu dan ini, yang bermaksud ucapan yang keras.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏أَخْبَرَنَا ثَابِتُ بْنُ عُمَارَةَ، ‏‏‏‏‏‏حَدَّثَنِي غُنَيْمُ بْنُ قَيْسٍ، ‏‏‏‏‏‏عَنْ أَبِي مُوسَى، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِذَا اسْتَعْطَرَتِ الْمَرْأَةُ فَمَرَّتْ عَلَى الْقَوْمِ لِيَجِدُوا رِيحَهَا فَهِيَ كَذَا وَكَذَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَوْلًا شَدِيدًا ."
      },
      {
        "id": 23254,
        "hadith_number": "4174",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Daud",
        "penulis_buku": "Imam Abu Daud Sulaiman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Memakai Wangian Bagi Wanita yang Pergi ke Masjid",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Narrated Abu Hurairah: A woman met him and he found the odour of perfume in her. Her clothes were fluttering in the air. He said: O maid-servant of the Almighty, are you coming from the mosque? She replied: Yes. He said: For it did you use perfume? She replied: Yes. He said: I heard my beloved Abul Qasim صلی ‌اللہ ‌علیہ ‌وسلم say: The prayer of a woman who uses perfume for this mosque is not accepted until she returns and takes a bath like that of sexual defilement (perfectly). Abu Dawud said: Al-i'sar means dust.",
        "malay_translation": "Diriwayatkan oleh Abu Hurairah: Seorang wanita bertemu dengan beliau dan beliau mendapati bau harum semerbak daripadanya. Pakaiannya berkibar di udara. Beliau bertanya: Wahai hamba Allah Yang Maha Perkasa, adakah kamu baru datang dari masjid? Wanita itu menjawab: Ya. Beliau bertanya lagi: Adakah kamu memakai wangian untuk tujuan itu (pergi ke masjid)? Wanita itu menjawab: Ya. Beliau berkata: Aku mendengar kekasihku, Abul Qasim صلی ‌اللہ ‌علیہ ‌وسلم, bersabda: Solat seorang wanita yang memakai wangian untuk pergi ke masjid ini tidak akan diterima sehingga dia pulang dan mandi wajib seperti mandi janabah (dengan sempurna). Abu Dawud berkata: Al-i'sar bermaksud debu.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ عُبَيْدٍ مَوْلَى أَبِي رُهْمٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَقِيَتْهُ امْرَأَةٌ وَجَدَ مِنْهَا رِيحَ الطِّيبِ يَنْفَحُ وَلِذَيْلِهَا إِعْصَارٌ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا أَمَةَ الْجَبَّارِ جِئْتِ مِنَ الْمَسْجِدِ ؟ قَالَتْ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَلَهُ تَطَيَّبْتِ ؟ قَالَتْ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنِّي سَمِعْتُ حِبِّي أَبَا الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ لَا تُقْبَلُ صَلَاةٌ لِامْرَأَةٍ تَطَيَّبَتْ لِهَذَا الْمَسْجِدِ حَتَّى تَرْجِعَ فَتَغْتَسِلَ غُسْلَهَا مِنَ الْجَنَابَةِ ، ‏‏‏‏‏‏قَالَ أَبُو دَاوُدَ:‏‏‏‏ الْإِعْصَارُ غُبَارٌ."
      },
      {
        "id": 23255,
        "hadith_number": "4175",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Wanita Berwangian ke Masjid untuk Solat Isyak",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah",
        "english_text": "Narrated Abu Hurairah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: If a woman fumigates herself with perfume, she must not attend the night prayer with us. Ibn Nufayl said: Isha' means night prayer.",
        "malay_translation": "Diriwayatkan oleh Abu Hurairah: Nabi Muhammad صلی ‌اللہ ‌علیہ ‌وسلم bersabda: \"Jika seorang wanita memakai wangian dan keluar rumah, dia tidak boleh menghadiri solat Isyak berjemaah bersama kami.\" Ibn Nufayl berkata: \"Isha' bermaksud solat Isyak.\"",
        "arabic_text": "حَدَّثَنَا النُّفَيْلِيُّ، ‏‏‏‏‏‏وَسَعِيدُ بْنُ مَنْصُورٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ أَبُو عَلْقَمَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي يَزِيدُ بْنُ خُصَيْفَةَ، ‏‏‏‏‏‏عَنْبُسْرِ بْنِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَيُّمَا امْرَأَةٍ أَصَابَتْ بَخُورًا فَلَا تَشْهَدَنَّ مَعَنَا الْعِشَاءَ ، ‏‏‏‏‏‏قَالَ ابْنُ نُفَيْلٍ:‏‏‏‏ عِشَاءَ الْآخِرَةِ."
      },
      {
        "id": 23256,
        "hadith_number": "4176",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Malaikat Tidak Menghadiri Jenazah Kafir dan Larangan Saffron serta Keadaan Junub, Kebenaran Berwuduk bagi Junub",
        "perawi_melayu": "Ammar ibn Yasir",
        "english_text": "Narrated Ammar ibn Yasir: I came to my family at night (after a journey) with my hands chapped and they perfumed me with saffron. In the morning I went to the Prophet صلی ‌اللہ ‌علیہ ‌وسلم and gave him a greeting, but he did not respond to me nor did he welcome me. He said: Go away and wash this off yourself. I then went away and washed it off me. I came to him but there remained a spot of it on me. I give him a greeting, but he did not respond to me nor did he welcome me. He said: Go away and wash it off yourself. I then went away and washed it off me. I then came and gave him a greeting. He responded to me and welcomed me, saying: The angels do not attend the funeral of an unbeliever bringing good to it, nor a man who smears himself with saffron, nor a man who is sexually defiled. He said: He permitted the man who was sexually defiled to perform ablution when he slept, ate or drank.",
        "malay_translation": "Diriwayatkan dari Ammar ibn Yasir: Aku pulang ke keluargaku pada waktu malam (setelah perjalanan) dengan tanganku merekah dan mereka mewangikan aku dengan za'faran. Pada pagi hari aku pergi kepada Nabi صلی ‌اللہ ‌علیہ ‌وسلم dan memberi salam kepadanya, tetapi baginda tidak menjawab salamku dan tidak menyambutku. Baginda bersabda: Pergi dan cucilah ini dari dirimu. Kemudian aku pergi dan mencucinya dari diriku. Aku datang kepadanya tetapi masih ada sedikit kesan za'faran padaku. Aku memberi salam kepadanya, tetapi baginda tidak menjawab salamku dan tidak menyambutku. Baginda bersabda: Pergi dan cucilah ini dari dirimu. Kemudian aku pergi dan mencucinya dari diriku. Kemudian aku datang dan memberi salam kepadanya. Baginda menjawab salamku dan menyambutku, seraya bersabda: Sesungguhnya malaikat tidak menghadiri jenazah orang kafir yang membawa kebaikan kepadanya, tidak juga lelaki yang berlumuran dengan za'faran, dan tidak juga lelaki yang junub. Baginda bersabda: Baginda memberi keringanan bagi orang yang junub untuk berwuduk ketika dia tidur, makan atau minum.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيل، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادٌ، ‏‏‏‏‏‏أَخْبَرَنَا عَطَاءٌ الْخُرَاسَانِيُّ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ يَعْمَرَ، ‏‏‏‏‏‏عَنْ عَمَّارِ بْنِ يَاسِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَدِمْتُ عَلَى أَهْلِي لَيْلًا وَقَدْ تَشَقَّقَتْ يَدَايَ، ‏‏‏‏‏‏فَخَلَّقُونِي بِزَعْفَرَانٍ، ‏‏‏‏‏‏فَغَدَوْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَسَلَّمْتُ عَلَيْهِ فَلَمْ يَرُدَّ عَلَيَّ، ‏‏‏‏‏‏وَلَمْ يُرَحِّبْ بِي، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ اذْهَبْ فَاغْسِلْ هَذَا عَنْكَ، ‏‏‏‏‏‏فَذَهَبْتُ فَغَسَلْتُهُ ثُمَّ جِئْتُ وَقَدْ بَقِيَ عَلَيَّ مِنْهُ رَدْعٌ فَسَلَّمْتُ فَلَمْ يَرُدَّ عَلَيَّ وَلَمْ يُرَحِّبْ بِي، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ اذْهَبْ فَاغْسِلْ هَذَا عَنْكَ، ‏‏‏‏‏‏فَذَهَبْتُ فَغَسَلْتُهُ ثُمَّ جِئْتُ فَسَلَّمْتُ عَلَيْهِ فَرَدَّ عَلَيَّ وَرَحَّبَ بِي، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ إِنَّ الْمَلَائِكَةَ لَا تَحْضُرُ جَنَازَةَ الْكَافِرِ بِخَيْرٍ وَلَا الْمُتَضَمِّخَ بِالزَّعْفَرَانِ وَلَا الْجُنُبَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَرَخَّصَ لِلْجُنُبِ إِذَا نَامَ أَوْ أَكَلَ أَوْ شَرِبَ أَنْ يَتَوَضَّأَ ."
      },
      {
        "id": 23257,
        "hadith_number": "4177",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hadis tentang Khaluq dengan Perawi yang Berbeza",
        "perawi_melayu": "Diriwayatkan oleh: Ammar ibn Yasir",
        "english_text": "The tradition mentioned above (No. 4164) has also been transmitted by Ammar ibn Yasir through a different chain of narrators. This version has: Ammar said: I used khaluq. The first version is more perfect; it mentioned taking a bath . Ibn Jurayj said: I said to Umar (a transmitter): They might be wearing ihram (robe of pilgrim)? He replied: No, they were residents.",
        "malay_translation": "Hadis yang disebutkan di atas (No. 4164) juga telah diriwayatkan oleh Ammar ibn Yasir melalui rangkaian perawi yang berbeza. Versi ini ada: Ammar berkata: Saya menggunakan khaluq. Versi pertama lebih lengkap; ia menyebutkan mandi. Ibn Jurayj berkata: Saya berkata kepada Umar (seorang perawi): Adakah mereka memakai ihram (pakaian haji)? Beliau menjawab: Tidak, mereka adalah penduduk tempatan.",
        "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، ‏‏‏‏‏‏أَخْبَرَنَا ابْنُ جُرَيْجٍ، ‏‏‏‏‏‏أَخْبَرَنِي عُمَرُ بْنُ عَطَاءِ ابْنِ أَبِي الْخُوَارِ، ‏‏‏‏‏‏أَنَّه سَمِعُيَحْيَى بْنَ يَعْمَرَ يُخْبِرُ، ‏‏‏‏‏‏عَنْ رَجُلٍ أَخْبَرَهُ، ‏‏‏‏‏‏عَنْ عَمَّارِ بْنِ يَاسِرٍ، ‏‏‏‏‏‏زَعَمَ عُمَرُ:‏‏‏‏ أَنَّ يَحْيَى سَمَّى ذَلِكَ الرَّجُلَ، ‏‏‏‏‏‏فَنَسِيَ عُمَرُ اسْمَهُ أَنَّ عَمَّارًا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ تَخَلَّقْتُ بِهَذِهِ الْقِصَّةِ وَالْأَوَّلُ أَتَمُّ بِكَثِيرٍ فِيهِ ذِكْرُ الْغُسْلِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ لِعُمَرَ:‏‏‏‏ وَهُمْ حُرُمٌ ؟ قَالَ:‏‏‏‏ لَا، ‏‏‏‏‏‏الْقَوْمُ مُقِيمُونَ."
      },
      {
        "id": 23258,
        "hadith_number": "4178",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Tidak Diterima Jika Memakai Khaluq (Wangi-wangian Saffron)",
        "perawi_melayu": "Al-Rabi bin Anas dan datuk-datuknya",
        "english_text": "Al-Rabi bin Anas, quoting his two grandfathers, said: We heard Abu Musa say: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said: Allah does not accept the prayer of a man who has any khaluq (perfume composed of saffron) on his body. Abu Dawud said: His grandfathers were Zaid and Ziyad.",
        "malay_translation": "Al-Rabi bin Anas, meriwayatkan daripada dua datuknya, berkata: Kami mendengar Abu Musa berkata: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Allah tidak menerima solat seorang lelaki yang mempunyai sedikit khaluq (wangian yang diperbuat daripada zafran) pada badannya. Abu Dawood berkata: Datuk-datuknya ialah Zaid dan Ziyad.",
        "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ الْأَسَدِيُّ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ حَرْبٍ الْأَسَدِيُّ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو جَعْفَرٍ الرَّازِيُّ، ‏‏‏‏‏‏عَنِ الرَّبِيعِ بْنِ أَنَسٍ، ‏‏‏‏‏‏عَنْ جَدَّيْهِ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ سَمِعْنَا أَبَا مُوسَى، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا يَقْبَلُ اللَّهُ تَعَالَى صَلَاةَ رَجُلٍ فِي جَسَدِهِ شَيْءٌ مِنْ خَلُوقٍ ، ‏‏‏‏‏‏قَالَ أَبُو دَاوُد:‏‏‏‏ جَدَّاهُ زَيْدٌ، ‏‏‏‏‏‏وَزِيَادٌ."
      },
      {
        "id": 23259,
        "hadith_number": "4179",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Penggunaan Za'faran untuk Lelaki",
        "perawi_melayu": "Anas",
        "english_text": "Anas said: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم forbade men to use saffron. Ismail version has: (forbade) man to use saffron.",
        "malay_translation": "Anas berkata: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم melarang lelaki menggunakan za'faran. Versi Ismail meriwayatkan: (melarang) seorang lelaki menggunakan za'faran.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏أَنَّ حَمَّادَ بْنَ زَيْدٍ، ‏‏‏‏‏‏وَإِسْمَاعِيل بْنَ إِبْرَاهِيمَ حَدَّثَاهُمْ، ‏‏‏‏‏‏عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ التَّزَعْفُرِ لِلرِّجَالِ ، ‏‏‏‏‏‏وَقَالَ عَنْ إِسْمَاعِيل، ‏‏‏‏‏‏أَنْ يَتَزَعْفَرَ الرَّجُلُ."
      },
      {
        "id": 23260,
        "hadith_number": "4180",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Daud",
        "penulis_buku": "Imam Abu Dawud Sulaiman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Malaikat Tidak Mendekati Tiga Golongan",
        "perawi_melayu": "Ammar ibn Yasir",
        "english_text": "Narrated Ammar ibn Yasir: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: The angels do not come near three: the dead body of the unbeliever, one who smears himself with khaluq, and the one who is sexually defiled except that he performs ablution.",
        "malay_translation": "Diriwayatkan dari Ammar ibn Yasir: Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Malaikat tidak mendekati tiga golongan: bangkai orang kafir, orang yang berlumuran dengan khaluq, dan orang yang junub kecuali setelah dia berwuduk.",
        "arabic_text": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ الْأُوَيْسِيُّ، ‏‏‏‏‏‏حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ، ‏‏‏‏‏‏عَنْ ثَوْرِ بْنِ زَيْدٍ، ‏‏‏‏‏‏عَنِ الْحَسَنِ بْنِ أَبِي الْحَسَنِ، ‏‏‏‏‏‏عَنْ عَمَّارِ بْنِ يَاسِرٍ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ ثَلَاثَةٌ لَا تَقْرَبُهُمُ الْمَلَائِكَةُ:‏‏‏‏ جِيفَةُ الْكَافِرِ، ‏‏‏‏‏‏وَالْمُتَضَمِّخُ بِالْخَلُوقِ، ‏‏‏‏‏‏وَالْجُنُبُ إِلَّا أَنْ يَتَوَضَّأَ ."
      },
      {
        "id": 23261,
        "hadith_number": "4181",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Nabi Muhammad SAW Mendoakan Keberkatan untuk Anak-Anak di Makkah",
        "perawi_melayu": "Al-Walid ibn Uqbah",
        "english_text": "Narrated Al-Walid ibn Uqbah: When the Prophet of Allah صلی ‌اللہ ‌علیہ ‌وسلم conquered Makkah. The people of Makkah began to bring their boys and he would invoke a blessing on them and rub their heads. I was brought, but as I had been perfumed with khaluq, he did not touch me because of the khaluq.",
        "malay_translation": "Diriwayatkan oleh Al-Walid ibn Uqbah: Ketika Nabi Allah صلی ‌اللہ ‌علیہ ‌وسلم menakluki Makkah. Orang-orang Makkah mula membawa anak-anak lelaki mereka dan baginda akan mendoakan keberkatan bagi mereka dan mengusap kepala mereka. Saya dibawa, tetapi kerana saya telah diwangikan dengan khaluq, baginda tidak menyentuh saya kerana khaluq itu.",
        "arabic_text": "حَدَّثَنَا أَيُّوبُ بْنُ مُحَمَّدٍ الرَّقِّيُّ، ‏‏‏‏‏‏حَدَّثَنَا عُمَرُ بْنُ أَيُّوبَ، ‏‏‏‏‏‏عَنْ جَعْفَرِ بْنِ بُرْقَانَ، ‏‏‏‏‏‏عَنْ ثَابِتِ بْنِ الْحَجَّاجِ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ الْهَمْدَانِيِّ، ‏‏‏‏‏‏عَنِ الْوَلِيدِ بْنِ عُقْبَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَمَّا فَتَحَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ جَعَلَ أَهْلُ مَكَّةَ يَأْتُونَهُ بِصِبْيَانِهِمْ، ‏‏‏‏‏‏فَيَدْعُو لَهُمْ بِالْبَرَكَةِ وَيَمْسَحُ رُءُوسَهُمْ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَجِيءَ بِي إِلَيْهِ وَأَنَا مُخَلَّقٌ فَلَمْ يَمَسَّنِي مِنْ أَجْلِ الْخَلُوقِ ."
      },
      {
        "id": 23262,
        "hadith_number": "4182",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Anjuran Menghilangkan Kesan Kuning (Za'faran) pada Lelaki",
        "perawi_melayu": "Anas ibn Malik",
        "english_text": "Narrated Anas ibn Malik: A man came to the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم and he had the mark of yellowness (of saffron). The Prophet (peace be upon him rarely mentioned a thing which he disliked before a man. When he went away, he said: Would that you tell this man that he should wash this off him.",
        "malay_translation": "Diriwayatkan dari Anas ibn Malik: Seorang lelaki datang kepada Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم dan dia mempunyai kesan kekuningan (za'faran). Nabi (peace be upon him) jarang menyebut perkara yang baginda tidak suka di hadapan seseorang. Apabila lelaki itu pergi, baginda bersabda: Alangkah baiknya jika kamu memberitahu lelaki ini supaya dia mencuci kesan ini daripadanya.",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، ‏‏‏‏‏‏حَدَّثَنَا سَلْمٌ الْعَلَوِيُّ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏ أَنَّ رَجُلًا دَخَلَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ أَثَرُ صُفْرَةٍ وَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَلَّمَا يُوَاجِهُ رَجُلًا فِي وَجْهِهِ بِشَيْءٍ يَكْرَهُهُ فَلَمَّا خَرَجَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَوْ أَمَرْتُمْ هَذَا أَنْ يَغْسِلَ هَذَا عَنْهُ ."
      },
      {
        "id": 23263,
        "hadith_number": "4183",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Keindahan Rasulullah SAW dan Panjang Rambut Baginda",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Narrated Al-Bara: I did not see any man with locks hanging down to shoulders in red robe more beautiful than the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم. Muhammad bin Sulaiman added: He had hair which touched his shoulders. Abu Dawud said: Isra'il also transmitted it in a similar way from Abu Ishaq saying: (his hair) touched his shoulders . Shubah added: (His hair) reached the lobes of his ears.",
        "malay_translation": "Diriwayatkan daripada Al-Bara: Aku tidak pernah melihat seorang lelaki dengan rambut yang mencecah bahu dalam jubah merah yang lebih cantik daripada Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم. Muhammad bin Sulaiman menambah: Baginda mempunyai rambut yang menyentuh bahunya. Abu Dawud berkata: Isra'il juga meriwayatkannya dengan cara yang serupa daripada Abu Ishaq yang mengatakan: (rambutnya) menyentuh bahunya. Shubah menambah: (Rambut Baginda) mencapai cuping telinganya.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، ‏‏‏‏‏‏وَمُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنِالْبَرَاءِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَا رَأَيْتُ مِنْ ذِي لِمَّةٍ أَحْسَنَ فِي حُلَّةٍ حَمْرَاءَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، ‏‏‏‏‏‏زَادَ مُحَمَّدُ بْنُ سُلَيْمَانَ لَهُ شَعْرٌ يَضْرِبُ مَنْكِبَيْهِ، ‏‏‏‏‏‏قَالَ أَبُو دَاوُد:‏‏‏‏ كَذَا رَوَاهُ إِسْرَائِيلُ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏قَالَ:‏‏‏‏ يَضْرِبُ مَنْكِبَيْهِ، ‏‏‏‏‏‏وَقَالَ شُعْبَةُ:‏‏‏‏ يَبْلُغُ شَحْمَةَ أُذُنَيْهِ."
      },
      {
        "id": 23264,
        "hadith_number": "4184",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Panjang Rambut Rasulullah SAW",
        "perawi_melayu": "Al-Bara",
        "english_text": "Narrated Al-Bara: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم had hair which reached the lobes of his ears.",
        "malay_translation": "Diriwayatkan dari Al-Bara: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم memiliki rambut yang panjangnya mencapai cuping telinga.",
        "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، ‏‏‏‏‏‏حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنِ الْبَرَاءِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَهُ شَعْرٌ يَبْلُغُ شَحْمَةَ أُذُنَيْهِ ."
      },
      {
        "id": 23265,
        "hadith_number": "4185",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Panjang Rambut Rasulullah SAW",
        "perawi_melayu": "Anas ibn Malik",
        "english_text": "Narrated Anas ibn Malik: The hair of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم were up to the lobes of his ears.",
        "malay_translation": "Diriwayatkan dari Anas ibn Malik: Rambut Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم adalah sehingga cuping telinga baginda.",
        "arabic_text": "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَخْبَرَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنْ ثَابِتٍ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ شَعْرُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى شَحْمَةِ أُذُنَيْهِ ."
      },
      {
        "id": 23266,
        "hadith_number": "4186",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Panjang Rambut Rasulullah SAW",
        "perawi_melayu": "Anas bin Malik RA",
        "english_text": "Narrated Anas bin Malik: The hair of Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم were halfway down his ears.",
        "malay_translation": "Diriwayatkan daripada Anas bin Malik RA: Rambut Rasulullah SAW adalah separuh jalan ke bawah telinganya.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا إِسْمَاعِيل، ‏‏‏‏‏‏أَخْبَرَنَا حُمَيْدٌ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ شَعْرُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى أَنْصَافِ أُذُنَيْهِ ."
      },
      {
        "id": 23267,
        "hadith_number": "4187",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Sifat Rambut Rasulullah SAW",
        "perawi_melayu": "Aisyah, Ummul Mukminin",
        "english_text": "Narrated Aishah, Ummul Muminin: The hair of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم were above wafrah and below jummah.",
        "malay_translation": "Diriwayatkan daripada Aisyah, Ummul Mukminin: Rambut Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم berada di atas wafrah dan di bawah jummah.",
        "arabic_text": "حَدَّثَنَا ابْنُ نُفَيْلٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الزِّنَادِ، ‏‏‏‏‏‏عَنِ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَ شَعْرُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوْقَ الْوَفْرَةِ وَدُونَ الْجُمَّةِ ."
      },
      {
        "id": 23268,
        "hadith_number": "4188",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Cara Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم Menyesuaikan Gaya Rambutnya",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Narrated Ibn Abbas: The people of the Book used to let their hair hand down, and the polytheists used to part their hair. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم like to confirm with the People of the Book in the matters about which he had received no command. Hence he Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم let his forelock hang down but afterwards he parted it.",
        "malay_translation": "Diriwayatkan oleh Ibn Abbas: Ahli Kitab biasanya membiarkan rambut mereka berjurai, dan orang-orang musyrik biasanya membelah rambut mereka. Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم suka bersetuju dengan Ahli Kitab dalam perkara-perkara yang mana baginda tidak menerima perintah. Oleh itu, Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم membiarkan jambulnya berjurai tetapi kemudian baginda membelahnya.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيل، ‏‏‏‏‏‏حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، ‏‏‏‏‏‏أَخْبَرَنِي ابْنُ شِهَابٍ، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ أَهْلُ الْكِتَابِ يَعْنِي يَسْدِلُونَ أَشْعَارَهُمْ وَكَانَ الْمُشْرِكُونَ يَفْرُقُونَ رُءُوسَهُمْ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُعْجِبُهُ مُوَافَقَةُ أَهْلِ الْكِتَابِ فِيمَا لَمْ يُؤْمَرْ بِهِ فَسَدَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَاصِيَتَهُ ثُمَّ فَرَقَ بَعْدُ ."
      },
      {
        "id": 23269,
        "hadith_number": "4189",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Cara Aisyah RA Membelah Rambut Rasulullah SAW",
        "perawi_melayu": "Aisyah Ummul Mu'minin R.A.",
        "english_text": "Narrated Aishah, Ummul Muminin: When I parted the hair of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم I made a parting from the crow of his head and let his forelock hang between his eyes.",
        "malay_translation": "Diriwayatkan dari Aisyah, Ummul Mu'minin: Apabila saya membelah rambut Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم, saya membuat belahan dari ubun-ubun kepala baginda dan membiarkan jambulnya tergantung di antara kedua mata baginda.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْأَعْلَى، ‏‏‏‏‏‏عَنْ مُحَمَّدٍ يَعْنِي ابْنَ إِسْحَاق، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرِ بْنِ الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كُنْتُ إِذَا أَرَدْتُ أَنْ أَفْرُقَ رَأْسَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَدَعْتُ الْفَرْقَ مِنْ يَافُوخِهِ وَأُرْسِلُ نَاصِيَتَهُ بَيْنَ عَيْنَيْهِ ."
      },
      {
        "id": 23270,
        "hadith_number": "4190",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Nasihat Nabi صلی ‌اللہ ‌علیہ ‌وسلم tentang Rambut Panjang",
        "perawi_melayu": "Wail ibn Hujr",
        "english_text": "Narrated Wail ibn Hujr: I came to the Prophet صلی ‌اللہ ‌علیہ ‌وسلم and I had long hair. When the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم saw me, he said: Evil, evil! He said: I then returned and cut them off. I then came to him in the morning. He said (to me): I did not intend to do evil to you. This is much better.",
        "malay_translation": "Diriwayatkan dari Wail ibn Hujr: Saya datang kepada Nabi صلی ‌اللہ ‌علیہ ‌وسلم dan saya mempunyai rambut yang panjang. Apabila Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم melihat saya, baginda bersabda: Buruk, buruk! Beliau berkata: Kemudian saya pulang dan memotong rambut tersebut. Kemudian saya datang kepada baginda pada waktu pagi. Baginda bersabda (kepada saya): Saya tidak bermaksud untuk melakukan keburukan kepada kamu. Ini jauh lebih baik.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ، ‏‏‏‏‏‏حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، ‏‏‏‏‏‏وَسُفْيَانُ بْنُ عُقْبَةَ السُّوَائِيُّ هُوَ أَخُو قَبِيصَةَ، ‏‏‏‏‏‏وَحُمَيْدُ بْنُ خُوَارٍ، ‏‏‏‏‏‏عَنْسُفْيَانَ الثَّوْرِيِّ،‏‏‏‏عَنْ عَاصِمِ بْنِ كُلَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ وَائِلِ بْنِ حُجْرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلِي شَعْرٌ طَوِيلٌ فَلَمَّا رَآنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ ذُبَابٌ ذُبَابٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَرَجَعْتُ فَجَزَزْتُهُ ثُمَّ أَتَيْتُهُ مِنَ الْغَدِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنِّي لَمْ أَعْنِكَ وَهَذَا أَحْسَنُ ."
      },
      {
        "id": 23271,
        "hadith_number": "4191",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Nabi Tiba di Makkah dengan Empat Tocang Rambut",
        "perawi_melayu": "Ummu Hani",
        "english_text": "Narrated Umm Hani: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم came to Makkah and he had four plaits of hair.",
        "malay_translation": "Diriwayatkan dari Ummu Hani: Nabi صلی ‌اللہ ‌علیہ ‌وسلم tiba di Makkah dan baginda mempunyai empat tocang rambut.",
        "arabic_text": "حَدَّثَنَا النُّفَيْلِيُّ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنِ ابْنِ أَبِي نَجِيحٍ، ‏‏‏‏‏‏عَنْ مُجَاهِدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَتْ أُمُّ هَانِئٍ قَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى مَكَّةَ وَلَهُ أَرْبَعُ غَدَائِرَ تَعْنِي عَقَائِصَ ."
      },
      {
        "id": 23272,
        "hadith_number": "4192",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Nabi ﷺ Menziarahi Anak-Anak Jaafar dan Mencukur Kepala Mereka",
        "perawi_melayu": "Abdullah ibn Jafar",
        "english_text": "Narrated Abdullah ibn Jafar: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم gave the children of Jafar three day' time to visit them. He then came to visit them, and said: Do not weep over my brother after this day. He said: Call to me the children of my brother. We were brought to him as if we were chicken. He said: Call a barber to me. He then ordered and our heads were shaved.",
        "malay_translation": "Diriwayatkan oleh Abdullah ibn Jafar: Nabi ﷺ memberi tempoh tiga hari kepada anak-anak Jaafar untuk menziarahi mereka. Kemudian baginda datang menziarahi mereka, dan bersabda: Janganlah kamu menangisi saudaraku selepas hari ini. Baginda bersabda: Panggilkan anak-anak saudaraku kepadaku. Kami dibawa kepada baginda seolah-olah kami anak ayam. Baginda bersabda: Panggilkan tukang gunting rambut kepadaku. Kemudian baginda memerintahkan dan kepala kami dicukur.",
        "arabic_text": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ، ‏‏‏‏‏‏وَابْنُ الْمُثَنَّى، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبِي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ مُحَمَّدَ بْنَ أَبِي يَعْقُوبَيُحَدِّثُ، ‏‏‏‏‏‏عَنِ الْحَسَنِ بْنِ سَعْدٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَمْهَلَ آلَ جَعْفَرٍ ثَلَاثًا أَنْ يَأْتِيَهُمْ ثُمَّ أَتَاهُمْ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ لَا تَبْكُوا عَلَى أَخِي بَعْدَ الْيَوْمِ، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ ادْعُوا لِي بَنِي أَخِي فَجِيءَ بِنَا كَأَنَّا أَفْرُخٌ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ ادْعُوا لِي الْحَلَّاقَ، ‏‏‏‏‏‏فَأَمَرَهُ فَحَلَقَ رُءُوسَنَا ."
      },
      {
        "id": 23273,
        "hadith_number": "4193",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Qaza' (Mencukur Sebahagian Kepala Kanak-kanak dan Meninggalkan Sebahagian Lain)",
        "perawi_melayu": "Ibnu Umar",
        "english_text": "Narrated Ibn Umar: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم forbade qaza'. Qaza' means having part of a boy's head shaved and leaving part unshaven.",
        "malay_translation": "Diriwayatkan dari Ibnu Umar: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم melarang qaza'. Qaza' bermaksud mencukur sebahagian kepala seorang budak lelaki dan meninggalkan sebahagian yang lain tidak dicukur.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، ‏‏‏‏‏‏حَدَّثَنَا عُثْمَانُ بْنُ عُثْمَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَحْمَدُ كَانَ رَجُلًا صَالِحًا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنَا عُمَرُ بْنُ نَافِعٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْقَزَعِ وَالْقَزَعُ أَنْ يُحْلَقَ رَأْسُ الصَّبِيِّ فَيُتْرَكَ بَعْضُ شَعْرِهِ ."
      },
      {
        "id": 23274,
        "hadith_number": "4194",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Terhadap Qaza'",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Narrated Abdullah ibn Umar: the Prophet صلی ‌اللہ ‌علیہ ‌وسلم forbade qaza' which means that the head of a boy is shaved and a lock is left.",
        "malay_translation": "Diriwayatkan daripada Abdullah ibn Umar: Nabi صلی ‌اللہ ‌علیہ ‌وسلم melarang qaza' yang bermaksud kepala seorang budak lelaki dicukur dan meninggalkan sebahagian rambut.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيل، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادٌ، ‏‏‏‏‏‏حَدَّثَنَا أَيُّوبُ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ نَهَى عَنِ الْقَزَعِ، ‏‏‏‏‏‏وَهُوَ أَنْ يُحْلَقَ رَأْسُ الصَّبِيِّ فَتُتْرَكَ لَهُ ذُؤَابَةٌ ."
      },
      {
        "id": 23275,
        "hadith_number": "4195",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Mencukur Sebahagian Kepala dan Meninggalkan Sebahagian Lain",
        "perawi_melayu": "Abdullah ibn Umar",
        "english_text": "Narrated Abdullah ibn Umar: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم saw a boy with part of his head shaved and part left unshaven. He forbade them to do that, saying: Shave it all or leave it all.",
        "malay_translation": "Diriwayatkan daripada Abdullah ibn Umar: Nabi صلی ‌اللہ ‌علیہ ‌وسلم melihat seorang budak lelaki dengan sebahagian kepalanya dicukur dan sebahagian lagi tidak dicukur. Baginda melarang mereka daripada melakukan demikian, dan bersabda: Cukur semuanya atau biarkan semuanya.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏حَدَّثَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنْ أَيُّوبَ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏ أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى صَبِيًّا قَدْ حُلِقَ بَعْضُ شَعْرِهِ وَتُرِكَ بَعْضُهُ فَنَهَاهُمْ عَنْ ذَلِكَ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ احْلِقُوهُ كُلَّهُ أَوِ اتْرُكُوهُ كُلَّهُ ."
      },
      {
        "id": 23276,
        "hadith_number": "4196",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Anas bin Malik dan Rambutnya yang Tidak Dipotong Kerana Sunnah Rasulullah SAW",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "Narrated Anas ibn Malik: I had a hanging lock of hair. My mother said to me: I shall not cut it, for the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم used to stretch it our and hold it.",
        "malay_translation": "Diriwayatkan daripada Anas bin Malik: Aku mempunyai jambul rambut yang tergantung. Ibu saya berkata kepada saya: Saya tidak akan memotongnya, kerana Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم pernah memanjangkannya dan memegangnya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ، ‏‏‏‏‏‏حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، ‏‏‏‏‏‏عَنْ مَيْمُونِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ ثَابِتٍ الْبُنَانِيِّ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَتْ لِي ذُؤَابَةٌ، ‏‏‏‏‏‏فَقَالَتْ لِي أُمِّي:‏‏‏‏ لَا أَجُزُّهَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمُدُّهَا وَيَأْخُذُ بِهَا ."
      },
      {
        "id": 23277,
        "hadith_number": "4197",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Menyerupai Fesyen Yahudi dalam Berpakaian (Rambut)",
        "perawi_melayu": "Hajjaj bin Hassan",
        "english_text": "Narrated Anas ibn Malik: Al-Hajjaj ibn Hassan said: We entered upon Anas ibn Malik. My sister al-Mughirah said: You were a boy in those days and you had two locks of hair. He (Anas) rubbed your head and invoked blessing on you. He said: Shave them (i. e. the locks) or clip them, for this is the fashion of the Jews.",
        "malay_translation": "Diriwayatkan dari Anas bin Malik: Al-Hajjaj bin Hassan berkata: Kami masuk menemui Anas bin Malik. Kakakku al-Mughirah berkata: Kamu masih budak pada masa itu dan kamu mempunyai dua tocang rambut. Beliau (Anas) mengusap kepalamu dan mendoakan keberkatan untukmu. Beliau berkata: Cukur kedua-duanya (iaitu tocang) atau pendekkan, kerana ini adalah fesyen orang Yahudi.",
        "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، ‏‏‏‏‏‏حَدَّثَنَا الْحَجَّاجُ بْنُ حَسَّانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ دَخَلْنَا عَلَى أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏فَحَدَّثَتْنِي أُخْتِي الْمُغِيرَةُ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ وَأَنْتَ يَوْمَئِذٍ غُلَامٌ وَلَكَ قَرْنَانِ أَوْ قُصَّتَانِ، ‏‏‏‏‏‏فَمَسَحَ رَأْسَكَ وَبَرَّكَ عَلَيْكَ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ احْلِقُوا هَذَيْنِ أَوْ قُصُّوهُمَا فَإِنَّ هَذَا زِيُّ الْيَهُودِ ."
      },
      {
        "id": 23278,
        "hadith_number": "4198",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Lima Fitrah Semula Jadi Manusia",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Narrated Abu Hurairah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم as saying: The inborn characteristics of man are five. Another version says: Five things are of the inborn characteristics of man: circumcision, shaving the pubes, plucking out hair under the armpit, paring the nails and clipping the moustaches.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah: Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Fitrah manusia ada lima. Versi lain menyebutkan: Lima perkara termasuk fitrah manusia: berkhatan, mencukur bulu kemaluan, mencabut bulu ketiak, memotong kuku, dan memendekkan misai.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ سَعِيدٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْفِطْرَةُ خَمْسٌ أَوْ خَمْسٌ مِنَ الْفِطْرَةِ:‏‏‏‏ الْخِتَانُ وَالِاسْتِحْدَادُ وَنَتْفُ الْإِبِطِ وَتَقْلِيمُ الْأَظْفَارِ وَقَصُّ الشَّارِبِ ."
      },
      {
        "id": 23279,
        "hadith_number": "4199",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Perintah Memotong Misai dan Memelihara Janggut",
        "perawi_melayu": "Abdullah bin Umar",
        "english_text": "Narrated Abdullah bin Umar: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم commanded to clip the moustaches and grow the beard long.",
        "malay_translation": "Diriwayatkan daripada Abdullah bin Umar: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم memerintahkan untuk memotong misai dan membiarkan janggut panjang.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ أَبِي بَكْرِ بْنِ نَافِعٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، ‏‏‏‏‏‏ أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِإِحْفَاءِ الشَّوَارِبِ وَإِعْفَاءِ اللِّحَى ."
      },
      {
        "id": 23280,
        "hadith_number": "4200",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawood Sulaiman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Batasan Waktu untuk Kebersihan Diri",
        "perawi_melayu": "Anas bin Malik Radiyallahu Anhu",
        "english_text": "Narrated Anas bin Malik: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم fixed forty days to shave the pubes, paring the nails, clipping the moustaches, and plucking the hair under the armpit. Abu Dawud said: Jafar bin Sulaiman transmitted it from Abu Imran on the authority of Anas. In this version he did not mention the Prophet صلی ‌اللہ ‌علیہ ‌وسلم. He said: Forty days were fixed for us. This is a more correct version.",
        "malay_translation": "Diriwayatkan dari Anas bin Malik Radiyallahu Anhu: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم menetapkan empat puluh hari sebagai batasan waktu untuk mencukur bulu kemaluan, memotong kuku, memendekkan misai, dan mencabut bulu ketiak. Abu Dawud berkata: Jafar bin Sulaiman meriwayatkannya dari Abu Imran dari Anas. Dalam versi ini, beliau tidak menyebut Nabi صلی ‌اللہ ‌علیہ ‌وسلم. Beliau berkata: Empat puluh hari ditetapkan untuk kami. Ini adalah versi yang lebih tepat.",
        "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏حَدَّثَنَا صَدُقَةُ الدَّقِيقِيُّ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَقَّتَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَلْقَ الْعَانَةِ وَتَقْلِيمَ الْأَظْفَارِ وَقَصَّ الشَّارِبِ وَنَتْفَ الْإِبِطِ أَرْبَعِينَ يَوْمًا مَرَّةً ، ‏‏‏‏‏‏قَالَ أَبُو دَاوُد:‏‏‏‏ رَوَاهُ جَعْفَرُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏عَنْ أَبِي عِمْرَانَ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏لَمْ يَذْكُرِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وُقِّتَ لَنَا وَهَذَا أَصَحُّ."
      },
      {
        "id": 23281,
        "hadith_number": "4201",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Panjang Janggut Kecuali Semasa Haji atau Umrah dan Maksud Istihdad",
        "perawi_melayu": "Jabir",
        "english_text": "Narrated Jabir: We used to grow beard long except during the Hajj or Umrah. Abu Dawud said: Istihdad means to shave the pubes.",
        "malay_translation": "Diriwayatkan daripada Jabir: Kami biasa membiarkan janggut kami panjang kecuali semasa Haji atau Umrah. Abu Dawud berkata: Istihdad bermaksud mencukur bulu kemaluan.",
        "arabic_text": "حَدَّثَنَا ابْنُ نُفَيْلٍ، ‏‏‏‏‏‏حَدَّثَنَا زُهَيْرٌ، ‏‏‏‏‏‏قَرَأْتُ عَلَى عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ، ‏‏‏‏‏‏وَقَرَأَهُ عَبْدُ الْمَلِكِ عَلَى أَبِي الزُّبَيْرِ، ‏‏‏‏‏‏وَرَوَاهُ أَبُو الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ جَابِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنَّا نُعْفِي السِّبَالَ إِلَّا فِي حَجٍّ أَوْ عُمْرَةٍ ، ‏‏‏‏‏‏قَالَ أَبُو دَاوُد:‏‏‏‏ الِاسْتِحْدَادُ حَلْقُ الْعَانَةِ."
      },
      {
        "id": 23282,
        "hadith_number": "4202",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Mencabut Uban dan Keutamaannya dalam Islam",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Amr bin Shuaib, on his father's authority, told that his grandfather reported the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said: Do not pluck out grey hair. If any believer grows a grey hair in Islam, he will have light on the Day of Resurrection. (This is Sufyan's version). Yahya's version says: Allah will record on his behalf a good deed for it, and will blot out a sin for it.",
        "malay_translation": "Amr bin Shuaib, daripada ayahnya, menceritakan bahawa datuknya melaporkan Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Jangan mencabut uban. Jika seorang mukmin beruban dalam Islam, dia akan mendapat cahaya pada Hari Kiamat. (Ini adalah versi Sufyan). Versi Yahya mengatakan: Allah akan mencatat baginya satu kebaikan untuknya, dan menghapus satu dosa darinya.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى. ح وَحَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ الْمَعْنَى، ‏‏‏‏‏‏عَنِ ابْنِ عَجْلَانَ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تَنْتِفُوا الشَّيْبَ مَا مِنْ مُسْلِمٍ يَشِيبُ شَيْبَةً فِي الْإِسْلَامِ، ‏‏‏‏‏‏قَالَ عَنْ سُفْيَانَ:‏‏‏‏ إِلَّا كَانَتْ لَهُ نُورًا يَوْمَ الْقِيَامَةِ، ‏‏‏‏‏‏وَقَالَ فِي حَدِيثِ يَحْيَى:‏‏‏‏ إِلَّا كَتَبَ اللَّهُ لَهُ بِهَا حَسَنَةً وَحَطَّ عَنْهُ بِهَا خَطِيئَةً ."
      },
      {
        "id": 23283,
        "hadith_number": "4203",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Perintah untuk Berbeza dengan Yahudi dan Nasrani dalam Mewarnai Janggut",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Narrated Abu Hurairah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم as saying: Jews and Christians do not dye (their beards), so act differently from them.",
        "malay_translation": "Diriwayatkan dari Abu Hurairah: Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Orang Yahudi dan Nasrani tidak mewarnai (janggut mereka), maka berbezalah dengan mereka.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏وَسُلَيْمَانَ بْنِ يَسَارٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِنَّ الْيَهُودَ، ‏‏‏‏‏‏وَالنَّصَارَى لَا يَصْبُغُونَ فَخَالِفُوهُمْ ."
      },
      {
        "id": 23284,
        "hadith_number": "4204",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Mengubah Warna Uban Kecuali Hitam",
        "perawi_melayu": "Jabir bin Abdullah",
        "english_text": "Narrated Jabir bin Abdullah: Abu Quhafah was brought on the day of the conquest of Makkah with head and beard while like hyssop. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said: Change this something, but avoid black.",
        "malay_translation": "Diriwayatkan daripada Jabir bin Abdullah: Abu Quhafah dibawa pada hari pembukaan Makkah dengan kepala dan janggutnya putih seperti hyssop. Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Ubahlah ini dengan sesuatu, tetapi jauhi warna hitam.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، ‏‏‏‏‏‏وَأَحْمَدُ بْنُ سَعِيدٍ الْهَمْدَانِيُّ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ جُرَيْجٍ، ‏‏‏‏‏‏عَنْ أَبِي الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أُتِيَ بِأَبِي قُحَافَةَ يَوْمَ فَتْحِ مَكَّةَ وَرَأْسُهُ وَلِحْيَتُهُ كَالثَّغَامَةِ بَيَاضًا، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ غَيِّرُوا هَذَا بِشَيْءٍ وَاجْتَنِبُوا السَّوَادَ ."
      },
      {
        "id": 23285,
        "hadith_number": "4205",
        "status": "sahih",
        "nama_buku": "Sunan Abu Daud",
        "penulis_buku": "Imam Abu Daud Sulaiman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Inai dan Katam: Sebaik-baik Bahan untuk Mengubah Uban",
        "perawi_melayu": "Abu Dharr RA",
        "english_text": "Narrated Abu Dharr: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: The best things with which grey hair are changed are henna and katam.",
        "malay_translation": "Diriwayatkan daripada Abu Dharr RA: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Sebaik-baik perkara yang digunakan untuk mengubah uban adalah inai dan katam.",
        "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏حَدَّثَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنْ سَعِيدٍ الْجُرَيْرِيِّ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، ‏‏‏‏‏‏عَنْ أَبِي الْأَسْوَدِ الدِّيلِيِّ، ‏‏‏‏‏‏عَنْ أَبِي ذَرٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ أَحْسَنَ مَا غُيِّرَ بِهِ هَذَا الشَّيْبُ الْحِنَّاءُ وَالْكَتَمُ ."
      },
      {
        "id": 23286,
        "hadith_number": "4206",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Gambaran tentang Penampilan Nabi SAW",
        "perawi_melayu": "Abu Rimthah",
        "english_text": "Narrated Abu Rimthah: I went with my father to the Prophet صلی ‌اللہ ‌علیہ ‌وسلم. He had locks hanging down as far as the lobes of the ears stained with henna, and he was wearing two green garments.",
        "malay_translation": "Diriwayatkan oleh Abu Rimthah: Saya pergi bersama ayah saya kepada Nabi صلی ‌اللہ ‌علیہ ‌وسلم. Baginda memiliki rambut yang jatuh hingga cuping telinga yang diwarnai dengan inai, dan Baginda memakai dua pakaian hijau.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، ‏‏‏‏‏‏حَدَّثَنَا عُبَيْدُ اللَّهِ يَعْنِي ابْنَ إِيَادٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا إِيَادٌ، ‏‏‏‏‏‏عَنْ أَبِي رِمْثَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ انْطَلَقْتُ مَعَ أَبِي نَحْوَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا هُوَ ذُو وَفْرَةٍ بِهَا رَدْعُ حِنَّاءٍ وَعَلَيْهِ بُرْدَانِ أَخْضَرَانِ ."
      },
      {
        "id": 23287,
        "hadith_number": "4207",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Nabi Menjelaskan tentang Penyembuh Sejati",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "This version adds (to the previous hadith No 4194): My father said to him (the Prophet): Show me what is on your back, for I am a physician. He (the Prophet) said: You are only a soother. Its physician is He Who has credit it.",
        "malay_translation": "Versi ini menambah (kepada hadis sebelumnya No 4194): Bapa saya berkata kepada baginda (Nabi): Tunjukkan saya apa yang ada di belakangmu, kerana saya seorang doktor. Baginda (Nabi) bersabda: Kamu hanyalah seorang penghibur. Doktornya adalah Dia yang menciptakannya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ إِدْرِيسَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ ابْنَ أَبْجَرَ، ‏‏‏‏‏‏عَنْ إِيَادِ بْنِ لَقِيطٍ، ‏‏‏‏‏‏عَنْ أَبِي رِمْثَةَ فِي هَذَا الْخَبَرِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَقَالَ لَهُ أَبِي:‏‏‏‏ أَرِنِي هَذَا الَّذِي بِظَهْرِكَ فَإِنِّي رَجُلٌ طَبِيبٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ اللَّهُ الطَّبِيبُ بَلْ أَنْتَ رَجُلٌ رَفِيقٌ طَبِيبُهَا الَّذِي خَلَقَهَا."
      },
      {
        "id": 23288,
        "hadith_number": "4208",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Melakukan Jenayah Terhadap Anak",
        "perawi_melayu": "Abu Rimthah",
        "english_text": "Narrated Abu Rimthah: I and my father came to the Prophet صلی ‌اللہ ‌علیہ ‌وسلم. He said to a man or to my father: Who is this? He replied: He is my son. He said: Do not commit a crime on him. He had stained his beard with henna.",
        "malay_translation": "Diriwayatkan oleh Abu Rimthah: Saya dan ayah saya datang kepada Nabi Muhammad صلی ‌اللہ ‌علیہ ‌وسلم. Baginda bersabda kepada seorang lelaki atau kepada ayah saya: Siapa ini? Beliau menjawab: Ini anak lelaki saya. Baginda bersabda: Jangan lakukan jenayah terhadapnya. Beliau telah mewarnakan janggutnya dengan inai.",
        "arabic_text": "حَدَّثَنَا ابْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّحْمَنِ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ إِيَادِ بْنِ لَقِيطٍ، ‏‏‏‏‏‏عَنْ أَبِي رِمْثَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا وَأَبِي فَقَالَ لِرَجُلٍ أَوْ لِأَبِيهِ:‏‏‏‏ مَنْ هَذَا ؟ قَالَ:‏‏‏‏ ابْنِي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا تَجْنِي عَلَيْهِ وَكَانَ قَدْ لَطَّخَ لِحْيَتَهُ بِالْحِنَّاءِ ."
      },
      {
        "id": 23289,
        "hadith_number": "4209",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Nabi Muhammad SAW Tidak Mencelup Rambut, Tetapi Abu Bakr dan Umar Melakukannya",
        "perawi_melayu": "Thabit dan Anas",
        "english_text": "Thabit said that Anas was asked about the hair-dye of the Prophet صلی ‌اللہ ‌علیہ ‌وسلم. He replied: He did not dye his hair, but Abu Bakr and Umar dyed their hair.",
        "malay_translation": "Thabit berkata bahawa Anas ditanya tentang celupan rambut Nabi صلی ‌اللہ ‌علیہ ‌وسلم. Beliau menjawab: Baginda tidak mencelup rambutnya, tetapi Abu Bakr dan Umar mencelup rambut mereka.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادٌ، ‏‏‏‏‏‏عَنْ ثَابِتٍ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏ أَنَّهُ سُئِلَ عَنْ خِضَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَذَكَرَ أَنَّهُ لَمْ يَخْضِبْ وَلَكِنْ قَدْ خَضَبَ أَبُو بَكْرٍ، ‏‏‏‏‏‏وَعُمَرُ رَضِيَ اللَّهُ عَنْهُمَا ."
      },
      {
        "id": 23290,
        "hadith_number": "4210",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Amalan Nabi Memakai Sandal Kulit dan Mewarnakan Janggut",
        "perawi_melayu": "Abdullah ibn Umar",
        "english_text": "Narrated Abdullah ibn Umar: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم used to wear tanned leather sandals and dye his beard yellow with wars and saffron, and Ibn Umar used to do that too.",
        "malay_translation": "Diriwayatkan oleh Abdullah ibn Umar: Nabi Muhammad ﷺ biasa memakai sandal kulit samak dan mewarnakan janggutnya kuning dengan wars dan za'faran, dan Ibn Umar juga melakukan hal yang sama.",
        "arabic_text": "حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ مُطَرِّفٍ أَبُو سُفْيَانَ، ‏‏‏‏‏‏حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ أَبِي رَوَّادٍ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ كَانَ يَلْبَسُ النِّعَالَ السِّبْتِيَّةَ وَيُصَفِّرُ لِحْيَتَهُ بِالْوَرْسِ وَالزَّعْفَرَانِ وَكَانَ ابْنُ عُمَرَ يَفْعَلُ ذَلِكَ ."
      },
      {
        "id": 23291,
        "hadith_number": "4211",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Daud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Pujian Nabi Terhadap Warna Celupan",
        "perawi_melayu": "Diriwayatkan oleh Abdullah ibn Abbas",
        "english_text": "Narrated Abdullah ibn Abbas: When a man who had dyed himself with henna passed by the Prophet صلی ‌اللہ ‌علیہ ‌وسلم, he said: How fine this is! When another man who had dyed himself with henna and katam passed by, he said: This is better than that. Then another man who had dyed himself with yellow dye, passed by, he said: This is better than all that.",
        "malay_translation": "Diriwayatkan dari Abdullah ibn Abbas: Ketika seorang lelaki yang mewarnai dirinya dengan inai berlalu di hadapan Nabi Muhammad صلی ‌اللہ ‌علیہ ‌وسلم, baginda bersabda: 'Alangkah baiknya ini!' Ketika lelaki lain yang mewarnai dirinya dengan inai dan katam berlalu, baginda bersabda: 'Ini lebih baik daripada itu.' Kemudian seorang lelaki lain yang mewarnai dirinya dengan pewarna kuning berlalu, baginda bersabda: 'Ini lebih baik daripada semua itu.'",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا إِسْحَاق بْنُ مَنْصُورٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ طَلْحَةَ، ‏‏‏‏‏‏عَنْ حُمَيْدِ بْنِ وَهْبٍ، ‏‏‏‏‏‏عَنِ ابْنِ طَاوُسٍ، ‏‏‏‏‏‏عَنْ طَاوُسٍ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَرَّ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ قَدْ خَضَّبَ بِالْحِنَّاءِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا أَحْسَنَ هَذَا ؟ قَالَ:‏‏‏‏ فَمَرَّ آخَرُ قَدْ خَضَّبَ بِالْحِنَّاءِ وَالْكَتَمِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ هَذَا أَحْسَنُ مِنْ هَذَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَمَرَّ آخَرُ قَدْ خَضَّبَ بِالصُّفْرَةِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ هَذَا أَحْسَنُ مِنْ هَذَا كُلِّهِ ."
      },
      {
        "id": 23292,
        "hadith_number": "4212",
        "status": "sahih",
        "nama_buku": "Sunan Abu Daud",
        "penulis_buku": "Imam Abu Daud Sulaiman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Mewarna Rambut Hitam dan Ancaman Tidak Mencium Bau Syurga",
        "perawi_melayu": "Diriwayatkan daripada Abdullah ibn Abbas RA",
        "english_text": "Narrated Abdullah ibn Abbas: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: At the end of time there will be people who will use this black dye like the crops of doves who will not experience the fragrance of Paradise.",
        "malay_translation": "Diriwayatkan daripada Abdullah ibn Abbas RA: Nabi Muhammad صلی ‌اللہ ‌علیہ ‌وسلم bersabda: \"Pada akhir zaman, akan ada kaum yang menggunakan pewarna hitam seperti tembolok merpati; mereka tidak akan mencium bau syurga.\"",
        "arabic_text": "حَدَّثَنَا أَبُو تَوْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا عُبَيْدُ اللَّهِ، ‏‏‏‏‏‏عَنْ عَبْدِ الْكَرِيمِ الْجَزَرِيِّ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ جُبَيْرٍ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَكُونُ قَوْمٌ يَخْضِبُونَ فِي آخِرِ الزَّمَانِ بِالسَّوَادِ كَحَوَاصِلِ الْحَمَامِ لَا يَرِيحُونَ رَائِحَةَ الْجَنَّةِ ."
      },
      {
        "id": 23293,
        "hadith_number": "4213",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Keutamaan Keluarga Rasulullah dan Zuhud Duniawi",
        "perawi_melayu": "Thawban",
        "english_text": "Narrated Thawban: When the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم went on a journey, the last member of his family he saw was Fatimah, and the first he visited on his return was Fatimah. Once when he returned from an expedition she had hung up a hair-cloth, or a curtain, at her door, and adorned al-Hasan and al-Husayn with silver bracelets. So when he arrived, he did not enter. Thinking that he had been prevented from entering by what he had seen, she tore down the curtain, unfastened the bracelets from the boys and cut them off. They went weeping to the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم, and when he had taken them from them, he said: Take this to so and so's family. Thawban. In Madina, these are my family, and I did not like them to enjoy their good things in the present life. Buy Fatimah a necklace or asb, Thawban, and two ivory bracelets.",
        "malay_translation": "Diriwayatkan oleh Thawban: Apabila Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم pergi dalam perjalanan, ahli keluarga terakhir yang baginda temui adalah Fatimah, dan orang pertama yang baginda ziarahi sekembalinya adalah Fatimah. Pernah ketika baginda kembali dari suatu ekspedisi, Fatimah telah menggantung kain bulu atau tirai di pintunya, dan menghiasi al-Hasan dan al-Husayn dengan gelang perak. Maka ketika baginda tiba, baginda tidak masuk. Fatimah menyangka bahawa yang menghalang baginda daripada masuk adalah apa yang dilihatnya itu, lalu dia merobek tirai itu, melepaskan gelang dari kedua-dua anak lelaki itu dan memotongnya. Mereka berdua pergi menangis kepada Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم, dan ketika baginda mengambil gelang itu daripada mereka, baginda bersabda: Bawa ini kepada keluarga si fulan. Thawban. Di Madinah, mereka ini adalah keluarga saya, dan saya tidak suka mereka menikmati perkara-perkara baik mereka dalam kehidupan dunia ini. Belikan Fatimah seutas kalung atau 'asb, Thawban, dan dua gelang gading.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ جُحَادَةَ، ‏‏‏‏‏‏عَنْ حُمَيْدٍ الشَّامِيِّ، ‏‏‏‏‏‏عَنْ سُلَيْمَانَ الْمُنَبِّهِيِّ، ‏‏‏‏‏‏عَنْثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَافَرَ كَانَ آخِرُ عَهْدِهِ بِإِنْسَانٍ مِنْ أَهْلِهِ فَاطِمَةَ، ‏‏‏‏‏‏وَأَوَّلُ مَنْ يَدْخُلُ عَلَيْهَا إِذَا قَدِمَ فَاطِمَةَ، ‏‏‏‏‏‏فَقَدِمَ مِنْ غَزَاةٍ لَهُ وَقَدْ عَلَّقَتْ مِسْحًا أَوْ سِتْرًا عَلَى بَابِهَا وَحَلَّتِ الْحَسَنَ، ‏‏‏‏‏‏وَالْحُسَيْنَ قُلْبَيْنِ مِنْ فِضَّةٍ فَقَدِمَ فَلَمْ يَدْخُلْ فَظَنَّتْ أَنَّ مَا مَنَعَهُ أَنْ يَدْخُلَ مَا رَأَى، ‏‏‏‏‏‏فَهَتَكَتِ السِّتْرَ وَفَكَّكَتِ الْقُلْبَيْنِ عَنِ الصَّبِيَّيْنِ وَقَطَّعَتْهُ بَيْنَهُمَا، ‏‏‏‏‏‏فَانْطَلَقَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُمَا يَبْكِيَانِ، ‏‏‏‏‏‏فَأَخَذَهُ مِنْهُمَا، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ يَا ثَوْبَانُ اذْهَبْ بِهَذَا إِلَى آلِ فُلَانٍ أَهْلِ بَيْتٍ بِالْمَدِينَةِ إِنَّ هَؤُلَاءِ أَهْلُ بَيْتِي أَكْرَهُ أَنْ يَأْكُلُوا طَيِّبَاتِهِمْ فِي حَيَاتِهِمُ الدُّنْيَا يَا ثَوْبَانُ اشْتَرِ لِفَاطِمَةَ قِلَادَةً مِنْ عَصَبٍ وَسِوَارَيْنِ مِنْ عَاجٍ ."
      }
    ]
  }
}