{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 121,
    "data": [
      {
        "id": 20330,
        "hadith_number": "1250",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Rumah di Syurga bagi Solat Sunat Dua Belas Rakaat",
        "perawi_melayu": "Umm Habibah",
        "english_text": "Narrated Umm Habibah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم as saying: If anyone prays in a day and a night twelve rak'ahs voluntarily (supererogatory prayer), a house will be built from him in Paradise on account of these (rak'ahs).",
        "malay_translation": "Dikisahkan oleh Umm Habibah bahawa Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda:  Sesiapa yang menunaikan solat sunat sebanyak dua belas rakaat dalam sehari semalam, maka akan dibina sebuah rumah baginya di Syurga atas dasar solat tersebut.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ عُلَيَّةَ، ‏‏‏‏‏‏حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ، ‏‏‏‏‏‏حَدَّثَنِي النُّعْمَانُ بْنُ سَالِمٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ أَوْسٍ، ‏‏‏‏‏‏عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ، ‏‏‏‏‏‏عَنْ أُمِّ حَبِيبَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ صَلَّى فِي يَوْمٍ ثِنْتَيْ عَشْرَةَ رَكْعَةً تَطَوُّعًا بُنِيَ لَهُ بِهِنَّ بَيْتٌ فِي الْجَنَّةِ ."
      },
      {
        "id": 20331,
        "hadith_number": "1251",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Sunnah Rasulullah SAW dalam Solat Sunat dan Solat Wajib",
        "perawi_melayu": "Abdullah bin Shaqiq",
        "english_text": "Narrated Abdullah bin Shaqiq: I asked Aishah about the voluntary prayers offered by the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم. She replied: Before the noon prayer he would pray four rak'ahs in my house, then go out and lead the people in prayer, then return to my house and pray two rak'ahs. He would lead the people in the sunset prayer, then return to my house and pray two rak'ahs. Then he would lead the people in the night prayer, and enter my house and pray two rak'ahs. He would pray nine rak'ahs during the night, including witr (prayer). At night he would pray for a long time standing and for a long time sitting. When he recited the Quran while standing, he would bow and prostrate himself from the standing position, and when he recited while sitting, he would bow and prostrate himself from the sitting position, and when dawn came he prayed two rak'ahs, then he would come out and lead the people in the dawn prayer.",
        "malay_translation": "Diceritakan oleh Abdullah bin Shaqiq: Aku bertanya kepada Aisyah tentang solat sunat yang diamalkan oleh Rasulullah SAW. Jawabnya: Sebelum solat Zuhur, baginda akan menunaikan solat sunat empat rakaat di rumahku, kemudian keluar dan memimpin umat dalam solat, kemudian kembali ke rumahku dan menunaikan dua rakaat solat sunat. Baginda akan memimpin umat dalam solat Asar, kemudian kembali ke rumahku dan menunaikan dua rakaat solat sunat. Kemudian baginda akan memimpin umat dalam solat Isyak, dan masuk ke rumahku serta menunaikan dua rakaat solat sunat. Baginda akan menunaikan sembilan rakaat solat sunat di malam hari, termasuk solat witir. Di malam hari baginda akan berlama-lama dalam solat sunat sambil berdiri dan duduk. Ketika baginda membaca Al-Quran sambil berdiri, baginda akan rukuk dan sujud dari posisi berdiri, dan ketika membaca sambil duduk, baginda akan rukuk dan sujud dari posisi duduk. Dan apabila masuk waktu Subuh, baginda akan menunaikan solat sunat dua rakaat, kemudian keluar dan memimpin umat dalam solat Subuh.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، ‏‏‏‏‏‏حَدَّثَنَا هُشَيْمٌ، ‏‏‏‏‏‏أَخْبَرَنَا خَالِدٌ. ح حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، ‏‏‏‏‏‏حَدَّثَنَا خَالِدٌ، ‏‏‏‏‏‏الْمَعْنَي عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَأَلْتُ عَائِشَةَ عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنَ التَّطَوُّعِ، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ كَانَ يُصَلِّي قَبْلَ الظُّهْرِ أَرْبَعًا فِي بَيْتِي، ‏‏‏‏‏‏ثُمَّ يَخْرُجُ فَيُصَلِّي بِالنَّاسِ، ‏‏‏‏‏‏ثُمَّ يَرْجِعُ إِلَى بَيْتِي فَيُصَلِّي رَكْعَتَيْنِ، ‏‏‏‏‏‏وَكَانَ يُصَلِّي بِالنَّاسِ الْمَغْرِبَ، ‏‏‏‏‏‏ثُمَّ يَرْجِعُ إِلَى بَيْتِي فَيُصَلِّي رَكْعَتَيْنِ، ‏‏‏‏‏‏وَكَانَ يُصَلِّي بِهِمُ الْعِشَاءَ، ‏‏‏‏‏‏ثُمَّ يَدْخُلُ بَيْتِي فَيُصَلِّي رَكْعَتَيْنِ، ‏‏‏‏‏‏وَكَانَ يُصَلِّي مِنَ اللَّيْلِ تِسْعَ رَكَعَاتٍ فِيهِنَّ الْوِتْرُ، ‏‏‏‏‏‏وَكَانَ يُصَلِّي لَيْلًا طَوِيلًا قَائِمًا وَلَيْلًا طَوِيلًا جَالِسًا، ‏‏‏‏‏‏فَإِذَا قَرَأَ وَهُوَ قَائِمٌ رَكَعَ وَسَجَدَ وَهُوَ قَائِمٌ، ‏‏‏‏‏‏وَإِذَا قَرَأَ وَهُوَ قَاعِدٌ رَكَعَ وَسَجَدَ وَهُوَ قَاعِدٌ، ‏‏‏‏‏‏وَكَانَ إِذَا طَلَعَ الْفَجْرُ صَلَّى رَكْعَتَيْنِ، ‏‏‏‏‏‏ثُمَّ يَخْرُجُ فَيُصَلِّي بِالنَّاسِ صَلَاةَ الْفَجْرِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ."
      },
      {
        "id": 20332,
        "hadith_number": "1252",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Sunnah Rasulullah SAW dalam Solat Sunat Sebelum dan Selepas Solat Waktu",
        "perawi_melayu": "Abdullah bin Umar",
        "english_text": "Narrated Abdullah bin Umar: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم would pray two rak'ahs before and two after the noon prayer, two after the sunset prayer in his house, and two after the night prayer. He would not pray after the Friday prayer till he departed. He would then pray two rak'ahs.",
        "malay_translation": "Diceritakan oleh Abdullah bin Umar: Rasulullah SAW akan menunaikan solat sunat dua rakaat sebelum dan dua rakaat selepas solat Zuhur, dua rakaat selepas solat Maghrib di rumahnya, dan dua rakaat selepas solat Isyak. Baginda tidak akan menunaikan solat sunat selepas solat Jumaat sehingga Baginda keluar. Kemudian Baginda akan menunaikan dua rakaat solat sunat.",
        "arabic_text": "حَدَّثَنَا الْقَعْنَبِيُّ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي قَبْلَ الظُّهْرِ رَكْعَتَيْنِ وَبَعْدَهَا رَكْعَتَيْنِ، ‏‏‏‏‏‏وَبَعْدَ الْمَغْرِبِ رَكْعَتَيْنِ فِي بَيْتِهِ، ‏‏‏‏‏‏وَبَعْدَ صَلَاةِ الْعِشَاءِ رَكْعَتَيْنِ، ‏‏‏‏‏‏وَكَانَ لَا يُصَلِّي بَعْدَ الْجُمُعَةِ حَتَّى يَنْصَرِفَ فَيُصَلِّيَ رَكْعَتَيْنِ ."
      },
      {
        "id": 20333,
        "hadith_number": "1253",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Nabi SAW Tidak Pernah Meninggalkan Solat Sunat Rawatib",
        "perawi_melayu": "Aishah (رَضِيَ ٱللَّٰهُ عَنْهَا)",
        "english_text": "Narrated Aishah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم never omitted four rak'ahs before the noon prayer, and two rak'ahs before the dawn prayer.",
        "malay_translation": "Diriwayatkan daripada Aishah (رَضِيَ ٱللَّٰهُ عَنْهَا) bahawa Nabi SAW tidak pernah meninggalkan empat rakaat sebelum solat Zohor, dan dua rakaat sebelum solat Subuh.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏عَنْ شُعْبَةَ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَدَعُ أَرْبَعًا قَبْلَ الظُّهْرَ، ‏‏‏‏‏‏وَرَكْعَتَيْنِ قَبْلَ صَلَاةِ الْغَدَاةِ ."
      },
      {
        "id": 20334,
        "hadith_number": "1254",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Kelebihan Solat Sunat Dua Rakaat Sebelum Subuh",
        "perawi_melayu": "Aishah رضي الله عنها",
        "english_text": "Narrated Aishah: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم was more particular about observing the supererogatory rak'ahs before the dawn prayer than about observing any of the other supererogatory prayers.",
        "malay_translation": "Diriwayatkan oleh Aishah: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم lebih tekun menjaga solat sunat dua rakaat sebelum solat Subuh berbanding solat sunat yang lain.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏عَنْ ابْنِ جُرَيْجٍ، ‏‏‏‏‏‏حَدَّثَنِي عَطَاءٌ، ‏‏‏‏‏‏عَنْ عُبَيْدِ بْنِ عُمَيْرٍ، ‏‏‏‏‏‏عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَكُنْ عَلَى شَيْءٍ مِنَ النَّوَافِلِ أَشَدَّ مُعَاهَدَةً مِنْهُ عَلَى الرَّكْعَتَيْنِ قَبْلَ الصُّبْحِ ."
      },
      {
        "id": 20335,
        "hadith_number": "1255",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Sunat Dua Rakaat Sebelum Subuh",
        "perawi_melayu": "Aishah (radiallahu'anha)",
        "english_text": "Narrated Aishah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم would pray two rak'ahs before the dawn prayer lightly so much so that I would say: Did he recite Surah al-Fatihah in them.",
        "malay_translation": "Diriwayatkan daripada Aishah (radiallahu'anha): Nabi صلی ‌اللہ ‌علیہ ‌وسلم selalu menunaikan solat sunat dua rakaat sebelum solat Subuh dengan ringan, sehinggakan aku berkata: Adakah baginda membaca Surah al-Fatihah di dalam solat tersebut?",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ الْحَرَّانِيُّ، ‏‏‏‏‏‏حَدَّثَنَا زُهَيْرُ بْنُ مُعَاوِيَةَ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ عَمْرَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُخَفِّفُ الرَّكْعَتَيْنِ قَبْلَ صَلَاةِ الْفَجْرِ حَتَّى إِنِّي لَأَقُولُ:‏‏‏‏ هَلْ قَرَأَ فِيهِمَا بِأُمِّ الْقُرْآنِ ؟ ."
      },
      {
        "id": 20336,
        "hadith_number": "1256",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Menghafal Ayat-ayat Al-Quran dalam Solat Subuh",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Narrated Abu Hurairah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم would recite in both rak'ahs of the dawn prayer: Say, O unbelievers and Say: He is Allah, the one",
        "malay_translation": "Dikisahkan oleh Abu Hurairah: Rasulullah SAW akan membaca ayat-ayat Al-Quran, \"Katakanlah (wahai Muhammad): Wahai orang-orang kafir!\" dan \"Katakanlah (wahai Muhammad): Sesungguhnya Allah itu Maha Esa\" dalam kedua rakaat solat Subuh.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ، ‏‏‏‏‏‏حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ كَيْسَانَ، ‏‏‏‏‏‏عَنْ أَبِي حَازِمٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ فِي رَكْعَتَيِ الْفَجْرِ قُلْ يَا أَيُّهَا الْكَافِرُونَ وَ قُلْ هُوَ اللَّهُ أَحَدٌ ."
      },
      {
        "id": 20337,
        "hadith_number": "1257",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Ketetapan Solat Subuh dan Kesabaran Nabi SAW",
        "perawi_melayu": "Bilal",
        "english_text": "Narrated Bilal: Ziyadah al-Kindi reported on the authority of Bilal that he (Bilal) came to the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم to inform him about the dawn prayer. Aishah kept Bilal engaged in a matter which she asked him till the day was bright and it became fairly light. Bilal then stood up and called him to prayer and called him repeatedly. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم did not yet come out. When he came out, he led the people in prayer and he (Bilal) informed him that Aishah had kept him engaged in a matter which she asked him till it became fairly light; hence he became late in reaching him (in time). He (Bilal) said: Messenger of Allah, the dawn became fairly bright. He said: If the dawn became brighter than it is now, I would pray them (the two rak'ahs of the sunnah prayer), offer them well and in a more beautiful manner.",
        "malay_translation": "Dikisahkan oleh Bilal: Ziyadah al-Kindi meriwayatkan daripada Bilal bahawa beliau (Bilal) datang kepada Rasulullah SAW untuk memberitahu tentang solat subuh. Aisyah menahan Bilal dalam suatu urusan yang ditanyakannya sehingga matahari terang dan waktu subuh hampir tiba. Bilal kemudiannya berdiri dan menyeru baginda untuk solat, dan terus mengulangi seruan. Rasulullah SAW belum keluar lagi. Apabila baginda keluar, baginda memimpin solat umat dan Bilal memberitahu baginda bahawa Aisyah telah menahannya dalam suatu perkara yang dia bertanya sehingga waktu subuh hampir tiba; oleh itu, dia terlambat sampai kepada baginda (pada waktunya). Bilal berkata: Ya Rasulullah, subuh sudah hampir terang. Baginda menjawab: Sekiranya subuh lebih terang daripada sekarang, nescaya aku akan mengerjakan solat sunat dua rakaat itu dengan sempurna dan lebih indah.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو الْمُغِيرَةِ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْعَلَاءِ، ‏‏‏‏‏‏حَدَّثَنِي أَبُو زِيَادَةَ عُبَيْدُ اللَّهِ بْنُ زِيَادَةَ الْكِنْدِيُّ، ‏‏‏‏‏‏عَنْ بِلَالٍ، ‏‏‏‏‏‏أَنَّهُ حَدَّثَهُ، ‏‏‏‏‏‏أَنَّهُ أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيُؤْذِنَهُ بِصَلَاةِ الْغَدَاةِ، ‏‏‏‏‏‏فَشَغَلَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا بِلَالًا بِأَمْرٍ سَأَلَتْهُ عَنْهُ حَتَّى فَضَحَهُ الصُّبْحُ فَأَصْبَحَ جِدًّا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَقَامَ بِلَالٌ فَآذَنَهُ بِالصَّلَاةِ وَتَابَعَ أَذَانَهُ، ‏‏‏‏‏‏فَلَمْ يَخْرُجْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَلَمَّا خَرَجَ صَلَّى بِالنَّاسِ، ‏‏‏‏‏‏وَأَخْبَرَهُ أَنَّ عَائِشَةَ شَغَلَتْهُ بِأَمْرٍ سَأَلَتْهُ عَنْهُ حَتَّى أَصْبَحَ جِدًّا، ‏‏‏‏‏‏وَأَنَّهُ أَبْطَأَ عَلَيْهِ بِالْخُرُوجِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنِّي كُنْتُ رَكَعْتُ رَكْعَتَيِ الْفَجْرِ ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِنَّكَ أَصْبَحْتَ جِدًّا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَوْ أَصْبَحْتُ أَكْثَرَ مِمَّا أَصْبَحْتُ لَرَكَعْتُهُمَا وَأَحْسَنْتُهُمَا وَأَجْمَلْتُهُمَا ."
      },
      {
        "id": 20338,
        "hadith_number": "1258",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Jangan Lupakan Dua Rakaat Solat Subuh Walaupun Terdesak",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Narrated Abu Hurairah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Do not omit them (the two rak'ahs before the dawn prayer) even if you are driven away by the horses.",
        "malay_translation": "Dikisahkan oleh Abu Hurairah: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Janganlah tinggalkan dua rakaat solat subuh itu walaupun anda terpaksa melarikan diri dihalang oleh kuda.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا خَالِدٌ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّحْمَنِ يَعْنِي ابْنَ إِسْحَاقَ الْمَدَنِيَّ، ‏‏‏‏‏‏عَنْ ابْنِ زَيْدٍ، ‏‏‏‏‏‏عَنْ ابْنِ سَيْلَانَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تَدَعُوهُمَا وَإِنْ طَرَدَتْكُمُ الْخَيْلُ ."
      },
      {
        "id": 20339,
        "hadith_number": "1259",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman bin al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Mengimbau Ayat-ayat I'tiqad dalam Solat Subuh",
        "perawi_melayu": "Abdullah bin Abbas",
        "english_text": "Narrated Abdullah bin Abbas: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم used to recite in both rak'ahs of the dawn prayer: Say: We believe in Allah and in the revelation given to us (3: 84). This is in the first rak'ah and in the second rak'ah (he recited): We believe in Allah and bear witness that we submit ourself (to Him). (3: 52).",
        "malay_translation": "Dikisahkan oleh Abdullah bin Abbas: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم  biasa membaca dalam kedua-dua rakaat solat Subuh: \"Katakanlah: Kami beriman kepada Allah dan kepada apa yang diturunkan kepada kami...\" (3: 84). Ini di dalam rakaat pertama, dan di rakaat kedua (baginda membaca): \"Kami beriman kepada Allah dan menjadi saksi bahawa kami menyerahkan diri kami kepada-Nya...\" (3: 52).",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، ‏‏‏‏‏‏حَدَّثَنَا زُهَيْرٌ، ‏‏‏‏‏‏حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ، ‏‏‏‏‏‏أَخْبَرَنِي سَعِيدُ بْنُ يَسَارٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، ‏‏‏‏‏‏ أَنَّ كَثِيرًا مِمَّا كَانَ يَقْرَأُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَكْعَتَيِ الْفَجْرِ بِ آمَنَّا بِاللَّهِ وَمَا أُنْزِلَ إِلَيْنَا سورة البقرة آية 136 هَذِهِ الْآيَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذِهِ فِي الرَّكْعَةِ الْأُولَى، ‏‏‏‏‏‏وَفِي الرَّكْعَةِ الْآخِرَةِ بِ آمَنَّا بِاللَّهِ وَاشْهَدْ بِأَنَّا مُسْلِمُونَ سورة آل عمران آية 52 ."
      },
      {
        "id": 20340,
        "hadith_number": "1260",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Doa dan Ayat-ayat Al-Quran dalam Solat Subuh",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Narrated Abu Hurairah: That he heard the Prophet صلی ‌اللہ ‌علیہ ‌وسلم recite in both rak'ahs of the dawn: Say: We believe in Allah, and in the revelation given to us (3: 84). This is in the first rak'ah. In the second rak'ah he recited this verse: Our Lord, we have believed in what You have sent down, and we follow the Messenger, so write us down among those who bear witness. or he recited: Surely, we have sent you with the truth as a bringer of glad tidings, and a warner. And you will not be asked about the inhabitants of the Blazing Fire (2: 119). Al-Darawardi doubted (which of the verse he recited).",
        "malay_translation": "Diceritakan oleh Abu Hurairah bahawa beliau mendengar Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم membaca dalam kedua-dua rakaat solat subuh: \"Katakanlah: Kami beriman kepada Allah dan kepada wahyu yang diturunkan kepada kami (3:84).\" Ini dalam rakaat pertama. Dalam rakaat kedua, baginda membaca ayat ini: \"Wahai Tuhan kami, kami telah beriman kepada apa yang Engkau turunkan, dan kami mengikuti Rasul, maka catatkanlah kami di antara orang-orang yang memberi syahadah.\" atau baginda membaca: \"Sesungguhnya Kami telah mengutuskan engkau (wahai Muhammad) dengan kebenaran sebagai pembawa berita gembira dan pemberi amaran. Dan engkau tidak akan ditanya tentang penduduk Neraka yang bergejolak\" (2: 119). Al-Darawardi ragu-ragu (tentang ayat yang mana yang dibaca baginda).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ بْنِ سُفْيَانَ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏عَنْ عُثْمَانَ بْنِ عُمَرَ يَعْنِي ابْنَ مُوسَى، ‏‏‏‏‏‏عَنْ أَبِي الْغَيْثِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي رَكْعَتَيِ الْفَجْرِ قُلْ آمَنَّا بِاللَّهِ وَمَا أُنْزِلَ عَلَيْنَا سورة آل عمران آية 84 فِي الرَّكْعَةِ الْأُولَى، ‏‏‏‏‏‏وَفِي الرَّكْعَةِ الْأُخْرَى بِهَذِهِ الْآيَةِ رَبَّنَا آمَنَّا بِمَا أَنْزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ سورة آل عمران آية 53 أَوْ إِنَّا أَرْسَلْنَاكَ بِالْحَقِّ بَشِيرًا وَنَذِيرًا وَلا تُسْأَلُ عَنْ أَصْحَابِ الْجَحِيمِ سورة البقرة آية 119 . شَكَّ الدَّارَوَرْدِيُّ."
      },
      {
        "id": 20341,
        "hadith_number": "1261",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Kelebihan Solat Dua Rakaat Sebelum Subuh dan Hadis Abu Hurairah",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Narrated Abu Hurairah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: If any of you prays two rak'ahs before the dawn prayer, he should lie at his right side. Marwan ibn al-Hakam said to him: Is it not enough that one of us walks to the mosque until he lies at his right side? According to the version of Ubaydullah, he (Abu Hurairah) replied: No. This statement (of Abu Hurairah) reached Ibn Umar. He said: Abu Hurairah exceed limits on himself. He was asked: Do you look askance at what he says? He replied: No, but he dared and we showed cowardice. This (criticism of Ibn Umar) reached Abu Hurairah. He said: What is my sin if I remembered and they forgot?",
        "malay_translation": "Dikisahkan oleh Abu Hurairah: Rasulullah صلى الله عليه وسلم bersabda, \"Jika ada di antara kamu yang menunaikan solat dua rakaat sebelum solat Subuh, maka hendaklah dia berbaring di sebelah kanannya.\" Marwan ibn al-Hakam bertanya kepadanya, \"Bukankah cukup sekadar salah seorang dari kita berjalan ke masjid sehingga dia berbaring di sebelah kanannya?\"  Menurut riwayat Ubaydullah, Abu Hurairah menjawab, \"Tidak.\" Pernyataan Abu Hurairah ini sampai ke telinga Ibn Umar. Beliau berkata, \"Abu Hurairah melampaui batas dalam hal ini.\" Beliau ditanya, \"Apakah engkau memandang rendah apa yang dia katakan?\" Beliau menjawab, \"Tidak, tetapi beliau berani dan kami menunjukkan keraguan.\" Perkara ini (kritikan Ibn Umar) sampai kepada Abu Hurairah. Beliau berkata, \"Apakah dosaku jika aku mengingati dan mereka melupakan?\" ",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏وَأَبُو كَامِلٍ وَعُبَيْدُ بْنُ عُمَرَ بْنِ مَيْسَرَةَ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ حَدَّثَنَا عَبْدُ الْوَاحِدِ، ‏‏‏‏‏‏حَدَّثَنَا الْأَعْمَشُ، ‏‏‏‏‏‏عَنْ أَبِي صَالِحٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا صَلَّى أَحَدُكُمُ الرَّكْعَتَيْنِ قَبْلَ الصُّبْحِ فَلْيَضْطَجِعْ عَلَى يَمِينِهِ ، ‏‏‏‏‏‏فَقَالَ لَهُ مَرْوَانُ بْنُ الْحَكَمِ:‏‏‏‏ أَمَا يُجْزِئُ أَحَدَنَا مَمْشَاهُ إِلَى الْمَسْجِدِ حَتَّى يَضْطَجِعَ عَلَى يَمِينِهِ ؟ قَالَ عُبَيْدُ اللَّهِ فِي حَدِيثِهِ:‏‏‏‏ قَالَ:‏‏‏‏ لَا ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَبَلَغَ ذَلِكَ ابْنَ عُمَرَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَكْثَرَ أَبُو هُرَيْرَةَ عَلَى نَفْسِهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَقِيلَ لِابْنِ عُمَرَ:‏‏‏‏ هَلْ تُنْكِرُ شَيْئًا مِمَّا يَقُولُ ؟ قَالَ:‏‏‏‏ لَا، ‏‏‏‏‏‏وَلَكِنَّهُ اجْتَرَأَ وَجَبُنَّا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَبَلَغَ ذَلِكَ أَبَا هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَمَا ذَنْبِي إِنْ كُنْتُ حَفِظْتُ وَنَسَوْا ؟."
      },
      {
        "id": 20342,
        "hadith_number": "1262",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Amalan Rasulullah SAW Selepas Solat Malam",
        "perawi_melayu": "Aishah",
        "english_text": "Narrated Aishah: When the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم finished his prayer late in the night, he would see. If I was awake, he would talk to me. If I was sleeping, he would awaken me, and pray two rak'ahs, then he would lie down as long as the muadhdhin came to him and call him for the dawn prayer. Then he would pray two rak'ahs lightly and come out for prayer.",
        "malay_translation": "Diriwayatkan daripada Aishah: Apabila Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم selesai menunaikan solatnya pada lewat malam, baginda akan melihat (keadaanku). Jika aku terjaga, baginda akan bercakap denganku. Jika aku sedang tidur, baginda akan mengejutkanku dan menunaikan solat dua rakaat, kemudian baginda berbaring sehingga muazzin datang memanggilnya untuk solat Subuh. Kemudian, baginda menunaikan solat dua rakaat ringan dan keluar untuk solat.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ، ‏‏‏‏‏‏حَدَّثَنَا بِشْرُ بْنُ عُمَرَ، ‏‏‏‏‏‏حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، ‏‏‏‏‏‏عَنْ سَالِمٍ أَبِي النَّضْرِ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَضَى صَلَاتَهُ مِنْ آخِرِ اللَّيْلِ نَظَرَ، ‏‏‏‏‏‏فَإِنْ كُنْتُ مُسْتَيْقِظَةً حَدَّثَنِي، ‏‏‏‏‏‏وَإِنْ كُنْتُ نَائِمَةً أَيْقَظَنِي، ‏‏‏‏‏‏وَصَلَّى الرَّكْعَتَيْنِ، ‏‏‏‏‏‏ثُمَّ اضْطَجَعَ حَتَّى يَأْتِيَهُ الْمُؤَذِّنُ فَيُؤْذِنَهُ بِصَلَاةِ الصُّبْحِ فَيُصَلِّي رَكْعَتَيْنِ خَفِيفَتَيْنِ، ‏‏‏‏‏‏ثُمَّ يَخْرُجُ إِلَى الصَّلَاةِ ."
      },
      {
        "id": 20343,
        "hadith_number": "1263",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Nabi SAW Berbual dengan Aishah RA Selepas Solat Fajar",
        "perawi_melayu": "Aishah, Ummul Muminin (Ibu Orang-orang Beriman)",
        "english_text": "Narrated Aishah, Ummul Muminin: When the Prophet صلی ‌اللہ ‌علیہ ‌وسلم prayed the two rak'ahs of the dawn prayer, he would lie down if I was asleep; in case I was awake, he would talk to me.",
        "malay_translation": "Diriwayatkan daripada Aishah, Ummul Muminin (Ibu Orang-orang Beriman): Apabila Nabi صلی ‌اللہ ‌علیہ ‌وسلم selesai menunaikan solat sunat dua rakaat fajar, baginda akan berbaring jika saya sedang tidur; sekiranya saya terjaga, baginda akan berbual dengan saya.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ زِيَادِ بْنِ سَعْدٍ، ‏‏‏‏‏‏عَمَّنْ حَدَّثَه ابْنُ أَبِي عَتَّابٍ أَو، ‏‏‏‏‏‏غَيْرُهُ، ‏‏‏‏‏‏عَن أَبِي سَلَمَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَتْعَائِشَةُ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى رَكْعَتَيِ الْفَجْرِ، ‏‏‏‏‏‏فَإِنْ كُنْتُ نَائِمَةً اضْطَجَعَ وَإِنْ كُنْتُ مُسْتَيْقِظَةً حَدَّثَنِي ."
      },
      {
        "id": 20344,
        "hadith_number": "1264",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Membangunkan Orang Tidur untuk Solat Subuh",
        "perawi_melayu": "Abu Bakrah رضي الله عنه",
        "english_text": "Narrated Abu Bakrah: I came out with the Prophet صلی ‌اللہ ‌علیہ ‌وسلم to offer the dawn prayer. When he passed by a sleeping man he called him for prayer or moved him with his foot. The narrator Ziyad said: This tradition has been reported to us by AbulFadl.",
        "malay_translation": "Diriwayatkan daripada Abu Bakrah: Aku keluar bersama Nabi صلی ‌اللہ ‌علیہ ‌وسلم untuk menunaikan solat Subuh. Apabila baginda melalui seorang lelaki yang sedang tidur, baginda memanggilnya untuk solat atau menggerakkannya dengan kaki baginda. Perawi Ziyad berkata: Hadis ini telah diriwayatkan kepada kami oleh AbulFadl.",
        "arabic_text": "حَدَّثَنَا عَبَّاسٌ الْعَنْبَرِيُّ، ‏‏‏‏‏‏وَزِيَادُ بْنُ يَحْيَى، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا سَهْلُ بْنُ حَمَّادٍ، ‏‏‏‏‏‏عَنْ أَبِي مَكِينٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو الْفُضَيْلِ رَجُلٌ مِنْ الْأَنْصَارِ، ‏‏‏‏‏‏عَنْ مُسْلِمِ بْنِ أَبِي بَكْرَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ خَرَجْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِصَلَاةِ الصُّبْحِ فَكَانَ لَا يَمُرُّ بِرَجُلٍ إِلَّا نَادَاهُ بِالصَّلَاةِ أَوْ حَرَّكَهُ بِرِجْلِهِ . قَالَ زِيَادٌ: قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو الْفُضَيْلِ."
      },
      {
        "id": 20345,
        "hadith_number": "1265",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Soalan Nabi ﷺ tentang Solat Seorang Lelaki",
        "perawi_melayu": "Abdullah bin Sarjas (Semoga Allah merahmatinya)",
        "english_text": "Narrated Abdullah bin Sarjas: A man came while the Prophet صلی ‌اللہ ‌علیہ ‌وسلم was leading the people in the dawn prayer. He prayed the two rak'ahs and then joined the congregational prayer led by the Prophet صلی ‌اللہ ‌علیہ ‌وسلم. When he finished the prayer, the Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: So-and-so, which was your real prayer, the one you prayed alone or the one offered with us ?",
        "malay_translation": "Diriwayatkan daripada Abdullah bin Sarjas: Seorang lelaki datang ketika Nabi صلی ‌اللہ ‌علیہ ‌وسلم sedang mengimami solat Subuh. Lelaki itu mengerjakan dua rakaat, kemudian menyertai solat berjemaah yang diimami oleh Nabi صلی ‌اللہ ‌علیہ ‌وسلم. Apabila selesai solat, Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda: \"Wahai si fulan, solat manakah yang sebenarnya (dianggap solatmu), solat yang kamu kerjakan secara bersendirian atau solat yang kamu kerjakan bersama kami?\"",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، ‏‏‏‏‏‏عَنْ عَاصِمٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ سَرْجِسَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ جَاءَ رَجُلٌ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الصُّبْحَ، ‏‏‏‏‏‏فَصَلَّى الرَّكْعَتَيْنِ، ‏‏‏‏‏‏ثُمَّ دَخَلَ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الصَّلَاةِ، ‏‏‏‏‏‏فَلَمَّا انْصَرَفَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ يَا فُلَانُ، ‏‏‏‏‏‏أَيَّتُهُمَا صَلَاتُكَ الَّتِي صَلَّيْتَ وَحْدَكَ، ‏‏‏‏‏‏أَوِ الَّتِي صَلَّيْتَ مَعَنَا ؟ ."
      },
      {
        "id": 20346,
        "hadith_number": "1266",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Wajib Tidak Sah Jika Iqamah Tidak Dikeluarkan",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "Narrated Abu Hurairah: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلمas saying: When the iqamah is pronounced for prayer, no prayer is valid except the obligatory prayer.",
        "malay_translation": "Daripada Abu Hurairah رضي الله عنه: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda, \"Apabila iqamah dikumandangkan untuk solat, tiada solat yang sah melainkan solat fardu.\" ",
        "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ. ح وحَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ وَرْقَاءَ. ح حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو عَاصِمٍ، ‏‏‏‏‏‏عَنْ ابْنِ جُرَيْجٍ. ح حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، ‏‏‏‏‏‏عَنْ حَمَّادِ بْنِ زَيْدٍ، ‏‏‏‏‏‏عَنْ أَيُّوبَ. ح حَدَّثَنَا مُحَمَّدُ بْنُ الْمُتَوَكِّلِ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَخْبَرَنَا زَكَرِيَّا بْنُ إِسْحَاقَكُلُّهُمْ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ دِينَارٍ، ‏‏‏‏‏‏عَنْ عَطَاءِ بْنِ يَسَارٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا أُقِيمَتِ الصَّلَاةُ فَلَا صَلَاةَ إِلَّا الْمَكْتُوبَةَ ."
      },
      {
        "id": 20347,
        "hadith_number": "1267",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Sunat Fajar Selepas Solat Subuh",
        "perawi_melayu": "Qays ibn Amr",
        "english_text": "Narrated Qays ibn Amr: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم saw a person praying after the congregational prayer at dawn was over. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said: There are two rak'ahs of the dawn prayer (i. e. the prescribed rak'ahs). The man replied: I did not pray the two rak'ahs before the dawn prayer. Hence I offered them now. The Messenger of Allah kept silent.",
        "malay_translation": "Diriwayatkan daripada Qays ibn Amr: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم melihat seorang lelaki bersolat selepas solat berjemaah Subuh selesai. Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Solat Subuh itu dua rakaat (iaitu rakaat yang disyariatkan). Lelaki itu menjawab: Saya tidak bersolat dua rakaat sebelum solat Subuh. Oleh itu, saya menunaikannya sekarang. Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم berdiam diri.",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ نُمَيْرٍ، ‏‏‏‏‏‏عَنْ سَعْدِ بْنِ سَعِيدٍ، ‏‏‏‏‏‏حَدَّثَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ قَيْسِ بْنِ عَمْرٍو، ‏‏‏‏‏‏قَالَ:‏‏‏‏ رَأَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا يُصَلِّي بَعْدَ صَلَاةِ الصُّبْحِ رَكْعَتَيْنِ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ صَلَاةُ الصُّبْحِ رَكْعَتَانِ ، ‏‏‏‏‏‏فَقَالَ الرَّجُلُ:‏‏‏‏ إِنِّي لَمْ أَكُنْ صَلَّيْتُ الرَّكْعَتَيْنِ اللَّتَيْنِ قَبْلَهُمَا فَصَلَّيْتُهُمَا الْآنَ، ‏‏‏‏‏‏ فَسَكَتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ."
      },
      {
        "id": 20348,
        "hadith_number": "1268",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Riwayat Hadith daripada Ata bin Abi Rabah dan Saad bin Saeed",
        "perawi_melayu": "Ata bin Abi Rabah melalui Saad bin Saeed",
        "english_text": "This tradition has also been transmitted by Ata bin Abi Rabah on the authority of Saad bin Saeed through a different chain of narrators. Abu Dawud said: Abd Rabbihi and Yahya bin Saeed also narrated this tradition from the Prophet صلی ‌اللہ ‌علیہ ‌وسلم omitting the name of the Companion (mursal). Their grandfather Zaid prayed along with the Prophet صلی ‌اللہ ‌علیہ ‌وسلم.",
        "malay_translation": "Riwayat ini juga telah diriwayatkan oleh Ata bin Abi Rabah daripada Saad bin Saeed melalui rantaian perawi yang berbeza. Abu Dawud berkata: Abd Rabbihi dan Yahya bin Saeed juga meriwayatkan hadith ini daripada Nabi ﷺ dengan menghilangkan nama Sahabat (mursal). Datuk mereka Zaid solat bersama Nabi ﷺ.",
        "arabic_text": "حَدَّثَنَا حَامِدُ بْنُ يَحْيَى الْبَلْخِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ سُفْيَانُ:‏‏‏‏ كَانَ عَطَاءُ بْنُ أَبِي رَبَاحٍ يُحَدِّثُ بِهَذَا الْحَدِيثِ عَنْ سَعْدِ بْنِ سَعِيدٍ. قَالَ أَبُو دَاوُد:‏‏‏‏ وَرَوَى عَبْدُ رَبِّهِ، ‏‏‏‏‏‏وَيَحْيَى ابْنَا سَعِيدٍ هَذَا الْحَدِيثَ مُرْسَلًا، ‏‏‏‏‏‏أَنَّ جَدَّهُمْ صَلَّى مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذِهِ الْقِصَّةِ."
      },
      {
        "id": 20349,
        "hadith_number": "1269",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Keutamaan Solat Sunat Sebelum dan Selepas Zohor",
        "perawi_melayu": "Umm Habibah",
        "english_text": "Narrated Umm Habibah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: If anyone keeps on praying regularly four rak'ahs before and four after the noon prayer, he will not enter the Hell-fire. Abu Dawud said: Al-'Ala bin Al-Harith and Sulaiman bin Musa reported it from Makhul with his chain, similarly.",
        "malay_translation": "Diriwayatkan daripada Umm Habibah: Nabi ﷺ bersabda: \"Sesiapa yang sentiasa mengerjakan solat sunat empat rakaat sebelum dan empat rakaat selepas solat Zohor, dia tidak akan masuk ke dalam neraka.\" Abu Dawud berkata: Al-'Ala bin Al-Harith dan Sulaiman bin Musa meriwayatkannya daripada Makhul dengan sanadnya yang serupa.",
        "arabic_text": "حَدَّثَنَا مُؤَمَّلُ بْنُ الْفَضْلِ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ النُّعْمَانِ، ‏‏‏‏‏‏عَنْ مَكْحُولٍ، ‏‏‏‏‏‏عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَتْ أُمُّ حَبِيبَةَ زَوْجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ حَافَظَ عَلَى أَرْبَعِ رَكَعَاتٍ قَبْلَ الظُّهْرِ وَأَرْبَعٍ بَعْدَهَا حَرُمَ عَلَى النَّارِ . قَالَ أَبُو دَاوُد:‏‏‏‏ رَوَاهُ الْعَلَاءُ بْنُ الْحَارِثِ، ‏‏‏‏‏‏وَسُلَيْمَانُ بْنُ مُوسَى، ‏‏‏‏‏‏عَنْ مَكْحُولٍ بِإِسْنَادِهِ مِثْلَهُ."
      },
      {
        "id": 20350,
        "hadith_number": "1270",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Waktu Terbuka Pintu Syurga Sewaktu Solat Zuhur",
        "perawi_melayu": "Abu Ayyub",
        "english_text": "Narrated Abu Ayyub: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: The gates of heaven are opened for four rak'ahs containing no taslim (salutation) before the noon prayer. Abu Dawud said: Yahya bin Saeed al-Qattan said: If I were to narrate any tradition from Ubaidah, I would narrate this tradition. Abu Dawud said: Ubaidah is weak. Abu Dawud said: The name of the narrator Ibn Minjab is Sahm.",
        "malay_translation": "Dikisahkan oleh Abu Ayyub: Rasulullah SAW bersabda, \"Pintu-pintu syurga terbuka untuk empat rakaat solat Zuhur yang tidak disertai dengan salam (taslim).\" Abu Dawud berkata: Yahya bin Saeed al-Qattan berkata: Sekiranya aku hendak meriwayatkan hadis dari Ubaidah, aku akan meriwayatkan hadis ini. Abu Dawud berkata: Ubaidah adalah dhaif (lemah). Abu Dawud berkata: Nama perawi Ibn Minjab ialah Sahm.",
        "arabic_text": "حَدَّثَنَا ابْنُ الْمُثَنَّى، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ عُبَيْدَةَ يُحَدِّثُ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ ابْنِ مِنْجَابَ، ‏‏‏‏‏‏عَنْ قَرْثَعٍ، ‏‏‏‏‏‏عَنْ أَبِي أَيُّوبَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَرْبَعٌ قَبْلَ الظُّهْرِ لَيْسَ فِيهِنَّ تَسْلِيمٌ تُفْتَحُ لَهُنَّ أَبْوَابُ السَّمَاءِ . قَالَ أَبُو دَاوُد:‏‏‏‏ بَلَغَنِي عَنْ يَحْيَى بْنِ سَعِيدٍ الْقَطَّانِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَوْ حَدَّثْتُ عَنْ عُبَيْدَةَ بِشَيْءٍ لَحَدَّثْتُ عَنْهُ بِهَذَا الْحَدِيثِ. قَالَ أَبُو دَاوُد:‏‏‏‏ عُبَيْدَةُ ضَعِيفٌ. قَالَ أَبُو دَاوُد:‏‏‏‏ ابْنُ مِنْجَابٍ هُوَ سَهْمٌ."
      },
      {
        "id": 20351,
        "hadith_number": "1271",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Keikhlasan Dalam Solat Sunat Sebelum Solat Zuhur",
        "perawi_melayu": "Abdullah ibn Umar",
        "english_text": "Narrated Abdullah ibn Umar: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: May Allah show mercy to a man who prays four rak'ahs before the afternoon prayer.",
        "malay_translation": "Riwayat daripada Abdullah ibn Umar: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Semoga Allah merahmati lelaki yang mendirikan solat sunat empat rakaat sebelum solat Zuhur.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو دَاوُدَ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ الْقُرَشِيُّ، ‏‏‏‏‏‏حَدَّثَنِي جَدِّي أَبُو الْمُثَنَّى، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ رَحِمَ اللَّهُ امْرَأً صَلَّى قَبْلَ الْعَصْرِ أَرْبَعًا ."
      },
      {
        "id": 20352,
        "hadith_number": "1272",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Sunat Dua Rakaat Sebelum Asar",
        "perawi_melayu": "Ali رضي الله عنه",
        "english_text": "Narrated Ali: That the Prophet صلی ‌اللہ ‌علیہ ‌وسلم used to pray two rak'ahs before the Asr prayer.",
        "malay_translation": "Diriwayatkan daripada Ali رضي الله عنه: Bahawa Nabi صلی ‌اللہ ‌علیہ ‌وسلم biasa menunaikan solat sunat dua rakaat sebelum solat Asar.",
        "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، ‏‏‏‏‏‏حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنْ عَاصِمِ بْنِ ضَمْرَةَ، ‏‏‏‏‏‏عَنْ عَلِيٍّ عَلَيْهِ السَّلَام، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي قَبْلَ الْعَصْرِ رَكْعَتَيْنِ ."
      },
      {
        "id": 20353,
        "hadith_number": "1273",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukum Dua Rakaat Selepas Solat Asar dan Keterangan Nabi SAW",
        "perawi_melayu": "Kuraib, pelanggan Ibn Abbas",
        "english_text": "Narrated Kuraib, the client of Ibn Abbas: That Abdullah bin Abbas, Abdur-Rahman bin Azhar and al-Miswar bin Makhramah sent him to Aishah, wife of the Prophet صلی ‌اللہ ‌علیہ ‌وسلم. They said: Convey our regards to her from all of us and ask her about the two rak'ahs after the Asr prayer, and tell her that we have been informed that she prays them, and we are told that the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم prohibited them. I entered upon her and told her that for which they had sent me to her. She said: Ask Umm Salamah. I returned to them (Ibn Abbas and others) and informed them about her opinion. They sent me back to Umm Salamah with the same mission for which they had sent me to Aishah. Umm Salamah said: I heard the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم prohibiting them, but later on I saw him praying them. When he prayed them, he had offered the Asr prayer. He then came to me while a number of women from Banu Haram from the Ansar were sitting with me. He prayed these two rak'ahs. I sent a slave girl to him and I told her: Stand beside him and tell him that Umm Salamah has asked: Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم, I heard you prohibiting these two rak'ahs (after the afternoon prayer) but I see you praying them yourself. If he makes a sign with his hand, step backward from him. The slave girl did so. When he finished prayer, he said: O daughter of Abu Umayyah, you asked about the praying of two rak'ahs after the Asr prayer, in fact, some people of Abd al-Qais has come to me with the news that their people had embraced Islam. They hindered me from praying the two rak'ahs after Zuhr prayer. It is those two rak'ahs (which I offered after the Asr prayer)",
        "malay_translation": "Dikisahkan oleh Kuraib, pelanggan Ibn Abbas: Bahwa Abdullah bin Abbas, Abdur-Rahman bin Azhar dan al-Miswar bin Makhramah mengutusnya kepada Aisyah, isteri Nabi صلی ‌اللہ ‌علیہ ‌وسلم. Mereka berkata: Sampaikan salam kami kepadanya dari kami semua dan tanyakan kepadanya tentang dua rakaat selepas solat Asar, dan beritahu dia bahawa kami telah diberitahu bahawa dia mengerjakannya, dan kami diberitahu bahawa Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم melarangnya. Aku masuk kepadanya dan menyampaikan apa yang mereka utuskan kepadanya. Dia berkata: Tanya Umm Salamah. Aku kembali kepada mereka (Ibn Abbas dan lain-lain) dan memberitahu mereka pendapatnya. Mereka menghantar aku kembali kepada Umm Salamah dengan tugas yang sama seperti yang mereka utuskan aku kepada Aisyah. Umm Salamah berkata: Aku mendengar Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم melarangnya, tetapi kemudian aku melihatnya mengerjakannya. Apabila dia mengerjakannya, dia telah menunaikan solat Asar. Kemudian dia datang kepadaku ketika beberapa wanita dari Bani Haram dari kalangan Ansar sedang duduk bersamaku. Beliau mengerjakan dua rakaat ini. Aku menghantar seorang hamba perempuan kepadanya dan aku berkata kepadanya: Berdiri di sisinya dan katakan kepadanya bahawa Umm Salamah telah bertanya: Wahai Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم, aku mendengar engkau melarang dua rakaat ini (selepas solat Zuhur) tetapi aku melihat engkau mengerjakannya sendiri. Jika dia memberi isyarat dengan tangannya, undur diri daripadanya. Hamba perempuan itu berbuat demikian. Apabila dia selesai solat, dia berkata: Wahai anak perempuan Abu Umayyah, engkau bertanya tentang solat dua rakaat selepas solat Asar, sebenarnya, beberapa orang daripada Abd al-Qais datang kepadaku dengan berita bahawa kaum mereka telah memeluk Islam. Mereka menghalang aku daripada mengerjakan dua rakaat selepas solat Zuhur. Itupunlah dua rakaat yang aku kerjakan selepas solat Asar.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، ‏‏‏‏‏‏أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، ‏‏‏‏‏‏عَنْ بُكَيْرِ بْنِ الْأَشَجِّ، ‏‏‏‏‏‏عَنْ كُرَيْبٍمَوْلَى ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، ‏‏‏‏‏‏وَعَبْدَ الرَّحْمَنِ بْنَ أَزْهَرَ، ‏‏‏‏‏‏وَالْمِسْوَرَ بْنَ مَخْرَمَةَ، ‏‏‏‏‏‏أَرْسَلُوهُ إِلَى عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالُوا:‏‏‏‏ اقْرَأْ عَلَيْهَا السَّلَامَ مِنَّا جَمِيعًا وَسَلْهَا عَنِ الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ، ‏‏‏‏‏‏وَقُلْ:‏‏‏‏ إِنَّا أُخْبِرْنَا أَنَّكِ تُصَلِّينَهُمَا، ‏‏‏‏‏‏وَقَدْ بَلَغَنَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهُمَا ، ‏‏‏‏‏‏فَدَخَلْتُ عَلَيْهَا فَبَلَّغْتُهَا مَا أَرْسَلُونِي بِهِ، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ سَلْ أُمَّ سَلَمَةَ، ‏‏‏‏‏‏فَخَرَجْتُ إِلَيْهِمْ فَأَخْبَرْتُهُمْ بِقَوْلِهَا، ‏‏‏‏‏‏فَرَدُّونِي إِلَى أُمِّ سَلَمَةَ بِمِثْلِ مَا أَرْسَلُونِي بِهِ إِلَى عَائِشَةَ، ‏‏‏‏‏‏فَقَالَتْأُمُّ سَلَمَةَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْهُمَا ثُمَّ رَأَيْتُهُ يُصَلِّيهِمَا، ‏‏‏‏‏‏أَمَّا حِينَ صَلَّاهُمَا فَإِنَّهُ صَلَّى الْعَصْرَ، ‏‏‏‏‏‏ثُمَّ دَخَلَ وَعِنْدِي نِسْوَةٌ مِنْ بَنِي حَرَامٍ مِنْ الْأَنْصَارِ فَصَلَّاهُمَا، ‏‏‏‏‏‏فَأَرْسَلْتُ إِلَيْهِ الْجَارِيَةَ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ قُومِي بِجَنْبِهِ، ‏‏‏‏‏‏فَقُولِي لَهُ:‏‏‏‏ تَقُولُ أُمُّ سَلَمَةَ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏أَسْمَعُكَ تَنْهَى عَنْ هَاتَيْنِ الرَّكْعَتَيْنِ وَأَرَاكَ تُصَلِّيهِمَا، ‏‏‏‏‏‏فَإِنْ أَشَارَ بِيَدِهِ فَاسْتَأْخِرِي عَنْهُ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ فَفَعَلَتِ الْجَارِيَةُ، ‏‏‏‏‏‏فَأَشَارَ بِيَدِهِ، ‏‏‏‏‏‏فَاسْتَأْخَرَتْ عَنْهُ، ‏‏‏‏‏‏فَلَمَّا انْصَرَفَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ يَا بِنْتَ أَبِي أُمَيَّةَ، ‏‏‏‏‏‏سَأَلْتِ عَنِ الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ، ‏‏‏‏‏‏إِنَّهُ أَتَانِي نَاسٌ مِنْ عَبْدِ الْقَيْسِ بِالْإِسْلَامِ مِنْ قَوْمِهِمْ فَشَغَلُونِي عَنِ الرَّكْعَتَيْنِ اللَّتَيْنِ بَعْدَ الظُّهْرِ فَهُمَا هَاتَانِ ."
      },
      {
        "id": 20354,
        "hadith_number": "1274",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Solat Selepas Solat Asar Kecuali Ketika Matahari Meninggi",
        "perawi_melayu": "Ali ibn Abu Talib",
        "english_text": "Narrated Ali ibn Abu Talib: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم prohibited to offer prayer after the afternoon prayer except at the time when the sun is high up in the sky.",
        "malay_translation": "Diriwayatkan daripada Ali ibn Abu Talib: Nabi صلی ‌اللہ ‌علیہ ‌وسلم melarang untuk menunaikan solat selepas solat Asar kecuali pada waktu matahari meninggi di langit.",
        "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ مَنْصُورٍ، ‏‏‏‏‏‏عَنْ هِلَالِ بْنِ يَسَافٍ، ‏‏‏‏‏‏عَنْ وَهْبِ بْنِ الْأَجْدَعِ، ‏‏‏‏‏‏عَنْ علِيٍّ، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الصَّلَاةِ بَعْدَ الْعَصْرِ إِلَّا وَالشَّمْسُ مُرْتَفِعَةٌ ."
      },
      {
        "id": 20355,
        "hadith_number": "1275",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Sunat Selepas Solat Fardhu (Kecuali Subuh dan Asar)",
        "perawi_melayu": "Ali ibn Abu Talib (رَضِيَ ٱللَّٰهُ عَنْهُ)",
        "english_text": "Narrated Ali ibn Abu Talib: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم would offer two rak'ahs after every obligatory prayer except the dawn and the Asr prayer.",
        "malay_translation": "Diriwayatkan daripada Ali ibn Abu Talib (رَضِيَ ٱللَّٰهُ عَنْهُ): Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم melakukan solat sunat dua rakaat selepas setiap solat fardhu kecuali solat Subuh dan solat Asar.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، ‏‏‏‏‏‏أَخْبَرَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاقَ، ‏‏‏‏‏‏عَنْ عَاصِمِ بْنِ ضَمْرَةَ، ‏‏‏‏‏‏عَنْ عَلِيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي إِثْرِ كُلِّ صَلَاةٍ مَكْتُوبَةٍ رَكْعَتَيْنِ إِلَّا الْفَجْرَ وَالْعَصْرَ ."
      },
      {
        "id": 20356,
        "hadith_number": "1276",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Ketiadaan Solat Selepas Subuh dan Asar Sehingga Terbit dan Terbenam Matahari",
        "perawi_melayu": "Abdullah ibn Abbas",
        "english_text": "Narrated Abdullah ibn Abbas: Some reliable people testified before me, and among them was Umar ibn al-Khattab, and most reliable in my eyes was Umar: The Prophet of Allah صلی ‌اللہ ‌علیہ ‌وسلم said: There is no prayer after the dawn prayer until the sun rises; and there is no prayer after the Asr prayer until the sun sets.",
        "malay_translation": "Dikisahkan oleh Abdullah ibn Abbas: Beberapa orang yang dipercayai memberi keterangan di hadapan saya, dan di antara mereka adalah Umar ibn al-Khattab, dan paling dipercayai dalam pandangan saya adalah Umar: Nabi Allah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Tidak ada solat selepas solat subuh sehingga matahari terbit; dan tidak ada solat selepas solat Asar sehingga matahari terbenam.",
        "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏حَدَّثَنَا أَبَانُ، ‏‏‏‏‏‏حَدَّثَنَا قَتَادَةُ، ‏‏‏‏‏‏عَنْ أَبِي الْعَالِيَةِ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ شَهِدَ عِنْدِي رِجَالٌ مَرْضِيُّونَ فِيهِمْ عُمَرُ بْنُ الْخَطَّابِ، ‏‏‏‏‏‏وَأَرْضَاهُمْ عِنْدِي عُمَرُ، ‏‏‏‏‏‏أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا صَلَاةَ بَعْدَ صَلَاةِ الصُّبْحِ حَتَّى تَطْلُعَ الشَّمْسُ، ‏‏‏‏‏‏وَلَا صَلَاةَ بَعْدَ صَلَاةِ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ ."
      },
      {
        "id": 20357,
        "hadith_number": "1277",
        "status": "sahih",
        "nama_buku": "Sunan Abu Daud",
        "penulis_buku": "Imam Abu Dawud Sulaiman bin al-Ash'ath al-Sijistani",
        "tajuk_hadith": "Waktu Doa Paling Mustajab di Malam dan Siang Hari",
        "perawi_melayu": "Amr ibn Anbasah al-Sulami",
        "english_text": "Narrated Amr ibn Anbasah as-Sulami: I asked: Messenger of Allah, in which part of night the supplication is more likely to be accepted? He replied: In the last part: Pray as much as you like, for the prayer is attended by the angels and it is recorded till you offer the dawn prayer; then stop praying when the sun is rising till it has reached the height of one or two lances, for it rises between the two horns of the Devil, and the infidels offer prayer for it (at that time). Then pray as much as you like, because the prayer is witnessed and recorded till the shadow of a lance be- comes equal to it. Then cease prayer, for at that time the Hell-fire is heated up and doors of Hell are opened. When the sun declines, pray as much as you like, for the prayer is witnessed till you pray the afternoon prayer; then cease prayer till the sun sets, for it sets between the horns of the Devil, and (at that time) the infidels offer prayer for it. He narrated a lengthy tradition. Abbas said: Abu Salam narrated this tradition in a similar manner from Abu Umamah. If I have made a mistake unintentionally, I beg pardon of Allah and repent to Him.",
        "malay_translation": "Dikisahkan oleh Amr ibn Anbasah al-Sulami: Aku bertanya, \"Wahai Rasulullah, pada bahagian malam manakah doa lebih mudah diterima?\" Baginda menjawab: Pada bahagian akhir malam: Berdoa semampunya, kerana doa itu diiringi malaikat dan dicatat sehingga kamu menunaikan solat Subuh; kemudian berhenti berdoa ketika matahari terbit sehingga mencapai tinggi satu atau dua tombak, kerana matahari terbit di antara dua tanduk syaitan, dan orang kafir berdoa untuknya (pada masa itu). Kemudian berdoa semampunya, kerana doa itu disaksikan dan dicatat sehingga bayangan tombak sama panjang dengannya. Kemudian berhenti berdoa, kerana pada waktu itu neraka dipanaskan dan pintu neraka dibuka. Apabila matahari condong, berdoa semampunya, kerana doa itu disaksikan sehingga kamu menunaikan solat Zuhur; kemudian berhenti berdoa sehingga matahari terbenam, kerana matahari terbenam di antara dua tanduk syaitan, dan (pada waktu itu) orang kafir berdoa untuknya. Beliau meriwayatkan hadis yang panjang. Abbas berkata: Abu Salam meriwayatkan hadis ini dengan cara yang serupa daripada Abu Umamah. Jika aku melakukan kesalahan tanpa sengaja, aku memohon keampunan Allah dan bertaubat kepada-Nya.",
        "arabic_text": "حَدَّثَنَا الرَّبِيعُ بْنُ نَافِعٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ الْمُهَاجِرِ، ‏‏‏‏‏‏عَنْ الْعَبَّاسِ بْنِ سَالِمٍ، ‏‏‏‏‏‏عَنْ أَبِي سَلَّامٍ، ‏‏‏‏‏‏عَنْ أَبِي أُمَامَةَ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ عَبَسَةَ السُّلَمِيِّ، ‏‏‏‏‏‏أَنَّهُ قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏أَيُّ اللَّيْلِ أَسْمَعُ ؟ قَالَ:‏‏‏‏ جَوْفُ اللَّيْلِ الْآخِرُ فَصَلِّ مَا شِئْتَ فَإِنَّ الصَّلَاةَ مَشْهُودَةٌ مَكْتُوبَةٌ حَتَّى تُصَلِّيَ الصُّبْحَ، ‏‏‏‏‏‏ثُمَّ أَقْصِرْ حَتَّى تَطْلُعَ الشَّمْسُ فَتَرْتَفِعَ قِيسَ رُمْحٍ أَوْ رُمْحَيْنِ فَإِنَّهَا تَطْلُعُ بَيْنَ قَرْنَيْ شَيْطَانٍ وَتُصَلِّي لَهَا الْكُفَّارُ، ‏‏‏‏‏‏ثُمَّ صَلِّ مَا شِئْتَ فَإِنَّ الصَّلَاةَ مَشْهُودَةٌ مَكْتُوبَةٌ حَتَّى يَعْدِلَ الرُّمْحُ ظِلَّهُ، ‏‏‏‏‏‏ثُمَّ أَقْصِرْ فَإِنَّ جَهَنَّمَ تُسْجَرُ وَتُفْتَحُ أَبْوَابُهَا، ‏‏‏‏‏‏فَإِذَا زَاغَتِ الشَّمْسُ فَصَلِّ مَا شِئْتَ فَإِنَّ الصَّلَاةَ مَشْهُودَةٌ حَتَّى تُصَلِّيَ الْعَصْرَ، ‏‏‏‏‏‏ثُمَّ أَقْصِرْ حَتَّى تَغْرُبَ الشَّمْسُ فَإِنَّهَا تَغْرُبُ بَيْنَ قَرْنَيْ شَيْطَانٍ وَيُصَلِّي لَهَا الْكُفَّارُ . وَقَصَّ حَدِيثًا طَوِيلًا، ‏‏‏‏‏‏قَالَ الْعَبَّاسُ:‏‏‏‏ هَكَذَا حَدَّثَنِي أَبُو سَلَّامٍ، ‏‏‏‏‏‏عَنْ أَبِي أُمَامَةَ، ‏‏‏‏‏‏إِلَّا أَنْ أُخْطِئَ شَيْئًا لَا أُرِيدُهُ، ‏‏‏‏‏‏فَأَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ."
      },
      {
        "id": 20358,
        "hadith_number": "1278",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Kehendak Solat Selepas Subuh dan Pemberitahuan Orang Tidak Hadir",
        "perawi_melayu": "Abdullah ibn Umar",
        "english_text": "Narrated Abdullah ibn Umar: Yasar, the client of Ibn Umar, said: Ibn Umar saw me praying after the break of dawn. He said: O Yasar, the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم came to us while we were offering this prayer. He (the Prophet) said: Those who are present should inform those who are absent: Do not offer any prayer after (the break of) dawn except two rak'ahs.",
        "malay_translation": "Diceritakan oleh Abdullah ibn Umar: Yasar, bekas hamba Ibn Umar, berkata: Ibn Umar melihat aku sedang menunaikan solat selepas subuh. Beliau berkata: Wahai Yasar, Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم datang kepada kami ketika kami sedang menunaikan solat ini. Baginda bersabda: Orang yang hadir perlu memberitahu orang yang tidak hadir: Jangan solat selepas waktu subuh kecuali dua rakaat.",
        "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏حَدَّثَنَا وُهَيْبٌ، ‏‏‏‏‏‏حَدَّثَنَا قُدَامَةُ بْنُ مُوسَى، ‏‏‏‏‏‏عَنْ أَيُّوبَ بْنِ حُصَيْنٍ، ‏‏‏‏‏‏عَنْ أَبِي عَلْقَمَةَ، ‏‏‏‏‏‏عَنْيَسَارٍ مَوْلَى ابْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ رَآنِي ابْنُ عُمَرَ وَأَنَا أُصَلِّي بَعْدَ طُلُوعِ الْفَجْرِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا يَسَارُ، ‏‏‏‏‏‏إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ عَلَيْنَا وَنَحْنُ نُصَلِّي هَذِهِ الصَّلَاةَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ لِيُبَلِّغْ شَاهِدُكُمْ غَائِبَكُمْ لَا تُصَلُّوا بَعْدَ الْفَجْرِ إِلَّا سَجْدَتَيْنِ ."
      },
      {
        "id": 20359,
        "hadith_number": "1279",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Dua Rakaat Selepas Solat Asar",
        "perawi_melayu": null,
        "english_text": "Al-Aswad and Masruq said: We bear witness that Aishah said: Not a day passed but the Prophet صلی ‌اللہ ‌علیہ ‌وسلم prayed two rak'ahs after the Asr prayer",
        "malay_translation": "Al-Aswad dan Masruq berkata: Kami menyaksikan bahawa Aishah berkata: Tiada satu hari pun berlalu melainkan Nabi صلی ‌اللہ ‌علیہ ‌وسلم menunaikan solat dua rakaat selepas solat Asar.",
        "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، ‏‏‏‏‏‏حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاقَ، ‏‏‏‏‏‏عَنْ الْأَسْوَدِ، ‏‏‏‏‏‏وَمَسْرُوقٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ نَشْهَدُ عَلَى عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، ‏‏‏‏‏‏أَنَّهَا قَالَتْ:‏‏‏‏ مَا مِنْ يَوْمٍ يَأْتِي عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا صَلَّى بَعْدَ الْعَصْرِ رَكْعَتَيْنِ ."
      },
      {
        "id": 20360,
        "hadith_number": "1280",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Rasulullah SAW Berdoa Selepas Solat Asar dan Menahan Diri daripada Berpuasa",
        "perawi_melayu": "Aishah رضي الله عنها",
        "english_text": "Narrated Aishah, Ummul Muminin: Dhakwan, the client of Aishah, reported on the authority of Aishah: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم used to pray after the afternoon prayer but prohibited others from it; and he would fast continuously but forbid others to do so.",
        "malay_translation": "Dikisahkan oleh Aishah, Ummul Mukminin: Dhakwan, orang yang menjadi klien Aishah, meriwayatkan dengan sanad daripada Aishah: Rasulullah SAW biasa berdoa setelah solat Asar tetapi melarang orang lain melakukannya; dan baginda selalu berpuasa secara berterusan tetapi melarang orang lain berbuat demikian.",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدٍ، ‏‏‏‏‏‏حَدَّثَنَا عَمِّي، ‏‏‏‏‏‏حَدَّثَنَا أَبِي، ‏‏‏‏‏‏عَنْ ابْنِ إِسْحَاقَ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، ‏‏‏‏‏‏عَنْ ذَكْوَانَمَوْلَى عَائِشَةَ، ‏‏‏‏‏‏أَنَّهَا حَدَّثَتْهُ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي بَعْدَ الْعَصْرِ، ‏‏‏‏‏‏وَيَنْهَى عَنْهَا، ‏‏‏‏‏‏وَيُوَاصِلُ وَيَنْهَى عَنِ الْوِصَالِ ."
      },
      {
        "id": 20361,
        "hadith_number": "1281",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Sunat Dua Rakaat Sebelum Maghrib",
        "perawi_melayu": "Abdullah al-Muzani (Semoga Allah meredhainya)",
        "english_text": "Narrated Abdullah al-Muzani: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said: Pray two rak'ahs before the Maghrib prayer. He then said (again): Pray two rak'ahs before the Maghrib prayer, it applies to those who wish to do so. That was because he feared that the people might treat it as sunnah.",
        "malay_translation": "Diriwayatkan daripada Abdullah al-Muzani: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: \"Solatlah dua rakaat sebelum solat Maghrib.\" Kemudian baginda bersabda (lagi): \"Solatlah dua rakaat sebelum solat Maghrib, bagi sesiapa yang mahu melakukannya.\" Hal itu kerana baginda khuatir orang ramai akan menganggapnya sebagai sunnah (yang wajib).",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، ‏‏‏‏‏‏عَنْ الْحُسَيْنِ الْمُعَلِّمِ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ الْمُزَنِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ صَلُّوا قَبْلَ الْمَغْرِبِ رَكْعَتَيْنِ ، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ صَلُّوا قَبْلَ الْمَغْرِبِ رَكْعَتَيْنِ لِمَنْ شَاءَ خَشْيَةَ أَنْ يَتَّخِذَهَا النَّاسُ سُنَّةً."
      },
      {
        "id": 20362,
        "hadith_number": "1282",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Sunat Sebelum Solat Maghrib yang Dilaksanakan oleh Rasulullah SAW",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "Narrated Anas bin Malik: I offered two rak'ahs of prayer before the Maghrib prayer (i. e. obligatory) during the time of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم. I (narrator al-Mukhtar bin Fulful) asked Anas: Did the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم se you ? He replied: Yes, but he neither commanded us nor forbade us (to do so).",
        "malay_translation": "Dikisahkan oleh Anas bin Malik: Aku menunaikan dua rakaat solat sunat sebelum solat Maghrib (solat fardu) ketika zaman Rasulullah SAW.  Aku (perawi al-Mukhtar bin Fulful) bertanya kepada Anas, \"Adakah Rasulullah SAW melihatmu?\" Jawabnya, \"Ya, tetapi baginda tidak menyuruh dan tidak pula melarang kami (melakukannya).\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ الْبَزَّازُ، ‏‏‏‏‏‏أَخْبَرَنَا سَعِيدُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏حَدَّثَنَا مَنْصُورُ بْنُ أَبِي الْأَسْوَدِ، ‏‏‏‏‏‏عَنْ الْمُخْتَارِ بْنِ فُلْفُلٍ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ صَلَّيْتُ الرَّكْعَتَيْنِ قَبْلَ الْمَغْرِبِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ لِأَنَسٍ:‏‏‏‏ أَرَآكُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ؟ قَالَ:‏‏‏‏ نَعَمْ رَآنَا فَلَمْ يَأْمُرْنَا وَلَمْ يَنْهَنَا ."
      },
      {
        "id": 20363,
        "hadith_number": "1283",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Antara Dua Azan",
        "perawi_melayu": "Abdullah bin Mughaffal رضي الله عنه",
        "english_text": "Narrated Abdullah bin Mughaffal: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم as saying: Between the two adhans there is a prayer, between the two adhans there is prayer for one who desires (to offer).",
        "malay_translation": "Diriwayatkan daripada Abdullah bin Mughaffal: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Antara dua azan itu ada solat, antara dua azan itu ada solat bagi sesiapa yang berkeinginan (untuk menunaikannya).",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ عُلَيَّةَ، ‏‏‏‏‏‏عَنْ الْجُرَيْرِيِّ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ بَيْنَ كُلِّ أَذَانَيْنِ صَلَاةٌ، ‏‏‏‏‏‏بَيْنَ كُلِّ أَذَانَيْنِ صَلَاةٌ لِمَنْ شَاءَ ."
      },
      {
        "id": 20364,
        "hadith_number": "1284",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Kebenaran Dua Rakaat Solat sebelum Maghrib dan Solat selepas Asar",
        "perawi_melayu": "Tawus",
        "english_text": "Narrated Tawus: Ibn Umar was asked about praying two rak'ahs before the Maghrib prayer. He replied: I did not see anyone praying them during the time of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم. He (Ibn Umar) permitted to pray two rak'ahs after the Asr prayer. Abu Dawud said: I heard Yahya bin Main say: The correct name of the narrator Abu Shuaib is the Shuaib. Shubah made a mistake in narrating his name.",
        "malay_translation": "Dikisahkan oleh Tawus: Ibn Umar ditanya tentang solat dua rakaat sebelum solat Maghrib. Beliau menjawab: Aku tidak melihat sesiapa yang mengerjakannya pada zaman Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم. Beliau (Ibn Umar) membenarkan solat dua rakaat selepas solat Asar. Abu Dawud berkata: Aku mendengar Yahya bin Main berkata: Nama perawi yang sebenar bagi Abu Shuaib ialah Shuaib. Shubah melakukan kesilapan dalam meriwayatkan namanya.",
        "arabic_text": "حَدَّثَنَا ابْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ أَبِي شُعَيْبٍ، ‏‏‏‏‏‏عَنْ طَاوُسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سُئِلَ ابْنُ عُمَرَ عَنِ الرَّكْعَتَيْنِ قَبْلَ الْمَغْرِبِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا رَأَيْتُ أَحَدًا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّيهِمَا، ‏‏‏‏‏‏وَرَخَّصَ فِي الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ. قَالَ أَبُو دَاوُد:‏‏‏‏ سَمِعْت يَحْيَى بْنَ مَعِينٍ يَقُولُ هُوَ شُعَيْبٌ يَعْنِي وَهِمَ شُعْبَةُ فِي اسْمِهِ."
      },
      {
        "id": 20365,
        "hadith_number": "1285",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Sedekah untuk Setiap Anggota Tubuh dan Hubungan Suami Isteri",
        "perawi_melayu": "Abu Dzar",
        "english_text": "Narrated Abu Dharr: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم as saying: In the morning alms are due for every bone in man's body. His salutation to everyone he meets is alms, his enjoining good is alms, his forbidding what is evil is alms, the removal of harmful thing from the way is alms, to have sexual intercourse with one's wife if alms, and two rak'ahs which one prays in the Duha serve instead of that. Abu Dawud said: The tradition narrated by 'Abbad is more perfect (than the version narrated by Musaddad). Musaddad did not mention in his version the command (of good) and the prohibition (of evil) . Instead, he added in his version saying: Such and such. Ibn Ma'na added in his version: They (the people) said: Messenger of Allah, how is that one of us fulfills his desire and still there are alms for him (i. e. is rewarded)? He replied: What do you think if you had unlawful sexual intercourse, would he not have been a sinner ?",
        "malay_translation": "Riwayat daripada Abu Dzar: Rasulullah SAW bersabda:  Pada pagi hari, setiap tulang dalam tubuh manusia berhak menerima sedekah. Salamnya kepada setiap orang yang ditemuinya adalah sedekah, menyuruh kebaikan adalah sedekah, mencegah kemungkaran adalah sedekah, menyingkirkan sesuatu yang berbahaya daripada jalan adalah sedekah, melakukan hubungan intim dengan isteri adalah sedekah, dan dua rakaat solat Dhuha menggantikannya. Abu Dawud berkata: Hadis yang diriwayatkan oleh 'Abbad lebih sempurna (daripada riwayat Musaddad). Musaddad tidak menyebut perintah (kebaikan) dan larangan (kemungkaran) dalam riwayatnya. Sebaliknya, dia menambahkan dalam riwayatnya: Begitu dan begitu. Ibn Ma'na menambahkan dalam riwayatnya: Mereka (orang ramai) berkata: Wahai Rasulullah, bagaimana seseorang di antara kami dapat memenuhi keinginannya dan masih menerima ganjaran (sedekah)? Baginda menjawab: Apakah pendapat kamu jika seseorang melakukan hubungan seks haram, bukankah dia akan berdosa?",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، ‏‏‏‏‏‏عَنْ عَبَّادِ بْنِ عَبَّادٍ. ح حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ الْمَعْنَى، ‏‏‏‏‏‏عَنْ وَاصِلٍ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ عُقَيْلٍ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ يَعْمَرَ، ‏‏‏‏‏‏عَنْ أَبِي ذَرٍّ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ يُصْبِحُ عَلَى كُلِّ سُلَامَى مِنَ ابْنِ آدَمَ صَدَقَةٌ تَسْلِيمُهُ عَلَى مَنْ لَقِيَ صَدَقَةٌ، ‏‏‏‏‏‏وَأَمْرُهُ بِالْمَعْرُوفِ صَدَقَةٌ، ‏‏‏‏‏‏وَنَهْيُهُ عَنِ الْمُنْكَرِ صَدَقَةٌ، ‏‏‏‏‏‏وَإِمَاطَتُهُ الْأَذَى عَنِ الطَّرِيقِ صَدَقَةٌ، ‏‏‏‏‏‏وَبُضْعَةُ أَهْلِهِ صَدَقَةٌ، ‏‏‏‏‏‏وَيُجْزِئُ مِنْ ذَلِكَ كُلِّهِ رَكْعَتَانِ مِنَ الضُّحَى . قَالَ أَبُو دَاوُد:‏‏‏‏ وَحَدِيثُ عَبَّادٍ أَتَمُّ، ‏‏‏‏‏‏وَلَمْ يَذْكُرْ مُسَدَّدٌ الْأَمْرَ وَالنَّهْيَ، ‏‏‏‏‏‏زَادَ فِي حَدِيثِهِ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ كَذَا وَكَذَا، ‏‏‏‏‏‏وَزَادَ ابْنُ مَنِيعٍ فِي حَدِيثِهِ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏أَحَدُنَا يَقْضِي شَهْوَتَهُ وَتَكُونُ لَهُ صَدَقَةٌ ؟ قَالَ:‏‏‏‏ أَرَأَيْتَ لَوْ وَضَعَهَا فِي غَيْرِ حِلِّهَا أَلَمْ يَكُنْ يَأْثَمُ ؟ ."
      },
      {
        "id": 20366,
        "hadith_number": "1286",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Sedekah Melalui Amalan Harian",
        "perawi_melayu": "Abu al-Aswad al-Dailani",
        "english_text": "Abu al-Aswad al-Dailani said: While we were present with Abu Dharr, he said: In the morning, alms are due for him, ever fast is alms, every pilgrimage is alms, every utterance of Glory to be Allah is alms, every utterance of Allah is most great is alms, every utterance of Praise be to Allah is alms. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم recounted all such good works. He then said: Two rak'ahs which one prays in the Duha serve instead of that.",
        "malay_translation": "Abu al-Aswad al-Dailani berkata: Semasa kami bersama Abu Dharr, beliau berkata: Pada waktu pagi, sedekah wajib ke atas setiap anggota badan. Setiap puasa adalah sedekah, setiap haji adalah sedekah, setiap ucapan 'Subhanallah' adalah sedekah, setiap ucapan 'Allahu Akbar' adalah sedekah, setiap ucapan 'Alhamdulillah' adalah sedekah. Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم mengira semua amalan baik seperti itu. Kemudian Baginda bersabda: Dua rakaat solat Dhuha sudah memadai untuk menggantikan semua itu.",
        "arabic_text": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ، ‏‏‏‏‏‏أَخْبَرَنَا خَالِدٌ، ‏‏‏‏‏‏عَنْ وَاصِلٍ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ عُقَيْلٍ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ يَعْمَرَ، ‏‏‏‏‏‏عَنْ أَبِي الْأَسْوَدِ الدُّؤَلِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ بَيْنَمَا نَحْنُ عِنْدَ أَبِي ذَرٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ يُصْبِحُ عَلَى كُلِّ سُلَامَى مِنْ أَحَدِكُمْ فِي كُلِّ يَوْمٍ صَدَقَةٌ، ‏‏‏‏‏‏فَلَهُ بِكُلِّ صَلَاةٍ صَدَقَةٌ، ‏‏‏‏‏‏وَصِيَامٍ صَدَقَةٌ، ‏‏‏‏‏‏وَحَجٍّ صَدَقَةٌ، ‏‏‏‏‏‏وَتَسْبِيحٍ صَدَقَةٌ، ‏‏‏‏‏‏وَتَكْبِيرٍ صَدَقَةٌ، ‏‏‏‏‏‏وَتَحْمِيدٍ صَدَقَةٌ، ‏‏‏‏‏‏فَعَدَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ هَذِهِ الْأَعْمَالِ الصَّالِحَةِ، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ يُجْزِئُ أَحَدَكُمْ مِنْ ذَلِكَ رَكْعَتَا الضُّحَى ."
      },
      {
        "id": 20367,
        "hadith_number": "1287",
        "status": "sahih",
        "nama_buku": "Sunan Abu Daud",
        "penulis_buku": "Imam Abu Daud Sulaiman bin al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Pengampunan Dosa Bagi Mereka Yang Berdiam Diri dengan Baik Selepas Solat Subuh",
        "perawi_melayu": "Muadh bin Anas al-Juhani",
        "english_text": "Narrated Muadh ibn Anas al-Juhani: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: If anyone sits in his place of prayer when he finishes the dawn prayer till he prays the two rak'ahs of the forenoon, saying nothing but what is good, his sins will be forgiven even if they are more than the foam of the sea.",
        "malay_translation": "Dikisahkan oleh Muadh bin Anas al-Juhani: Rasulullah SAW bersabda, “Jika seseorang duduk di tempat solatnya setelah selesai solat Subuh sehingga dia menunaikan dua rakaat solat Dhuha, dan tidak berkata kecuali perkataan yang baik, maka dosanya akan diampunkan, walaupun dosanya lebih banyak daripada buih lautan.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ أَيُّوبَ، ‏‏‏‏‏‏عَنْ زَبَّانَ بْنِ فَائِدٍ، ‏‏‏‏‏‏عَنْ سَهْلِ بْنِ مُعَاذِ بْنِ أَنَسٍ الْجُهَنِيِّ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَنْ قَعَدَ فِي مُصَلَّاهُ حِينَ يَنْصَرِفُ مِنْ صَلَاةِ الصُّبْحِ حَتَّى يُسَبِّحَ رَكْعَتَيِ الضُّحَى لَا يَقُولُ إِلَّا خَيْرًا، ‏‏‏‏‏‏غُفِرَ لَهُ خَطَايَاهُ وَإِنْ كَانَتْ أَكْثَرَ مِنْ زَبَدِ الْبَحْرِ ."
      },
      {
        "id": 20368,
        "hadith_number": "1288",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Ganjaran Solat Berterusan Tanpa Percakapan Sia-sia",
        "perawi_melayu": "Abu Umamah",
        "english_text": "Narrated Abu Umamah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Prayer followed by a prayer with no idle talk between the two is recorded in Illiyyun.",
        "malay_translation": "Diriwayatkan daripada Abu Umamah: Nabi ﷺ bersabda: Solat yang diiringi dengan solat lain tanpa percakapan yang sia-sia di antara keduanya, dicatat di dalam 'Illiyyun.",
        "arabic_text": "حَدَّثَنَا أَبُو تَوْبَةَ الرَّبِيعُ بْنُ نَافِعٍ، ‏‏‏‏‏‏حَدَّثَنَا الْهَيْثَمُ بْنُ حُمَيْدٍ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ الْحَارِثِ، ‏‏‏‏‏‏عَنْ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ أَبِي أُمَامَةَ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ صَلَاةٌ فِي إِثْرِ صَلَاةٍ لَا لَغْوَ بَيْنَهُمَا كِتَابٌ فِي عِلِّيِّينَ ."
      },
      {
        "id": 20369,
        "hadith_number": "1289",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulaiman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Keutamaan Solat Empat Rakaat Di Awal Hari",
        "perawi_melayu": "Nuaym ibn Hammar",
        "english_text": "Narrated Nuaym ibn Hammar: I heard the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم say: Allah, the Exalted, says: Son of Adam, do not be helpless in performing four rak'ahs for Me at the beginning of the day: I will supply what you need till the end of it.",
        "malay_translation": "Dikisahkan oleh Nuaym ibn Hammar: Aku mendengar Rasulullah SAW bersabda: Allah SWT berfirman: Wahai anak Adam, janganlah engkau lalai dalam menunaikan solat empat rakaat di awal hari. Pasti Aku akan mencukupkan keperluannya hingga akhir hari.",
        "arabic_text": "حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ، ‏‏‏‏‏‏حَدَّثَنَا الْوَلِيدُ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ عَبْدِ الْعَزِيزِ، ‏‏‏‏‏‏عَنْ مَكْحُولٍ، ‏‏‏‏‏‏عَنْ كَثِيرِ بْنِ مُرَّةَ أَبِي شَجَرَةَ، ‏‏‏‏‏‏عَنْنُعَيْمِ بْنِ هَمَّارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ يَقُولُ اللَّهُ عَزَّ وَجَلَّ:‏‏‏‏ يَا ابْنَ آدَمَ، ‏‏‏‏‏‏لَا تُعْجِزْنِي مِنْ أَرْبَعِ رَكَعَاتٍ فِي أَوَّلِ نَهَارِكَ أَكْفِكَ آخِرَهُ ."
      },
      {
        "id": 20370,
        "hadith_number": "1290",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Sunnah Rasulullah SAW Dalam Solat Penaklukan Makkah",
        "perawi_melayu": "Umm Hani binti Abu Talib",
        "english_text": "Narrated Umm Hani ibn Abu Talib: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم prayed on the day of the Conquest (of Makkah) eight rak'ahs saluting after every two rak'ahs. Abu Dawud said: Ahmad bin Salih said that the Messenger of Allah offered prayer in the forenoon on the day of the Conquest of Makkah, and he narrated something similar. Ibn al-Sarh reported that Umm Hani said: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم entered upon me. This version does not mention the prayer in the forenoon.",
        "malay_translation": "Dikisahkan oleh Umm Hani binti Abu Talib: Rasulullah SAW menunaikan solat pada hari Penaklukan Makkah sebanyak lapan rakaat, dengan salam selepas setiap dua rakaat. Abu Dawud meriwayatkan, Ahmad bin Salih berkata bahawa Rasulullah SAW menunaikan solat pada waktu pagi hari Penaklukan Makkah, dan beliau meriwayatkan sesuatu yang serupa. Ibn al-Sarh melaporkan Umm Hani berkata: Rasulullah SAW melawatku.  Versi ini tidak menyebut tentang solat pada waktu pagi.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، ‏‏‏‏‏‏وَأَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏حَدَّثَنِي عَيَّاضُ بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْمَخْرَمَةَ بْنِ سُلَيْمَانَ،‏‏‏‏عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏عَنْ أُمِّ هَانِئٍ بِنْتِ أَبِي طَالِبٍ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْفَتْحِ صَلَّى سُبْحَةَ الضُّحَى ثَمَانِيَ رَكَعَاتٍ يُسَلِّمُ مِنْ كُلِّ رَكْعَتَيْنِ . قَالَ أَبُو دَاوُدُ:‏‏‏‏ قَالَ أَحْمَدُ بْنُ صَالِحٍ:‏‏‏‏ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى يَوْمَ الْفَتْحِ سُبْحَةَ الضُّحَى فَذَكَرَ مِثْلَهُ. قَالَ ابْنُ السَّرْحِ:‏‏‏‏ إِنَّ أُمَّ هَانِئٍ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ دَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَذْكُرْ سُبْحَةَ الضُّحَى بِمَعْنَاهُ ."
      },
      {
        "id": 20371,
        "hadith_number": "1291",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulaiman bin al-Ash'ath al-Sijistani",
        "tajuk_hadith": "Sunnah Solat Dhuha Nabi SAW dan Mandi di Rumah Umm Hani",
        "perawi_melayu": "Ibn Abi Laila",
        "english_text": "Narrated Ibn Abi Laila: No one told us that the Prophet صلی ‌اللہ ‌علیہ ‌وسلم had offered Duha prayer except Umm Hani. She said that the Prophet صلی ‌اللہ ‌علیہ ‌وسلم had taken bath in her house on the day of the Conquest of Makkah and prayed eight rak'ahs. But no one saw him afterwards praying these rak'ahs.",
        "malay_translation": "Dikisahkan oleh Ibn Abi Laila: Tiada seorang pun memberitahu kami bahawa Nabi صلی ‌اللہ ‌علیہ ‌وسلم menunaikan solat Dhuha kecuali Umm Hani. Beliau berkata bahawa Nabi صلی ‌اللہ ‌علیہ ‌وسلم telah mandi di rumahnya pada hari Fathul Makkah dan menunaikan solat sebanyak lapan rakaat. Namun, tiada seorang pun melihat baginda menunaikan solat tersebut selepas itu.",
        "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، ‏‏‏‏‏‏حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ مُرَّةَ، ‏‏‏‏‏‏عَنْ ابْنِ أَبِي لَيْلَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَا أَخْبَرَنَا أَحَدٌ أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الضُّحَى غَيْرُ أُمِّ هَانِئٍ، ‏‏‏‏‏‏فَإِنَّهَا ذَكَرَتْ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ فَتْحِ مَكَّةَ اغْتَسَلَ فِي بَيْتِهَا وَصَلَّى ثَمَانِيَ رَكَعَاتٍ فَلَمْ يَرَهُ أَحَدٌ صَلَّاهُنَّ بَعْدُ ."
      },
      {
        "id": 20372,
        "hadith_number": "1292",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Dhuha dan Menggabungkan Surah-surah dalam Al-Quran",
        "perawi_melayu": "Abdullah bin Shaqiq",
        "english_text": "Narrated Abdullah bin Shaqiq: I asked Aishah: Did the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم pray in the Duha? She replied: No, except when he returned from his journey. I then asked: Did the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم recite the surahs combining each other? She said: He would do so in the mufassal surahs.",
        "malay_translation": "Dikisahkan oleh Abdullah bin Shaqiq: Aku bertanya kepada Aisyah, 'Adakah Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم menunaikan solat Dhuha?'. Jawabnya, 'Tidak, kecuali ketika baginda pulang dari perjalanan.' Kemudian aku bertanya lagi, 'Adakah Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم membaca surah-surah dengan menggabungkannya?'. Jawabnya, 'Baginda melakukannya dalam surah-surah yang panjang (mufassal).'",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، ‏‏‏‏‏‏حَدَّثَنَا الْجُرَيْرِيُّ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَأَلْتُ عَائِشَةَ هَلْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الضُّحَى ؟ فَقَالَتْ:‏‏‏‏ لَا، ‏‏‏‏‏‏إِلَّا أَنْ يَجِيءَ مِنْ مَغِيبِهِ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ هَلْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرِنُ بَيْنَ السُّورَتَيْنِ ؟ قَالَتْ:‏‏‏‏ مِنَ الْمُفَصَّلِ ."
      },
      {
        "id": 20373,
        "hadith_number": "1293",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Nabi SAW Tidak Mengerjakan Solat Dhuha Secara Teratur, Tetapi Isterinya Mengerjakannya",
        "perawi_melayu": "Aishah, isteri Nabi Muhammad SAW",
        "english_text": "Narrated Aishah, wife of Prophet صلی ‌اللہ ‌علیہ ‌وسلم: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم never offered prayer in the forenoon, but I offer it. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم would give up an action, though he liked it to do, lest the people should continue it and it is prescribed for them.",
        "malay_translation": "Diriwayatkan daripada Aishah, isteri Nabi Muhammad SAW: Rasulullah SAW tidak pernah mengerjakan solat sunat Dhuha, tetapi aku mengerjakannya. Rasulullah SAW pernah meninggalkan sesuatu perbuatan yang baginda suka untuk melakukannya, kerana khuatir jika orang ramai terus meneruskannya dan diwajibkan ke atas mereka.",
        "arabic_text": "حَدَّثَنَا الْقَعْنَبِيُّ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ ابْنِ شِهَابٍ، ‏‏‏‏‏‏عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏أَنَّهَا قَالَتْ:‏‏‏‏ مَا سَبَّحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُبْحَةَ الضُّحَى قَطُّ وَإِنِّي لَأُسَبِّحُهَا، ‏‏‏‏‏‏وَإِنْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيَدَعُ الْعَمَلَ وَهُوَ يُحِبُّ أَنْ يَعْمَلَ بِهِ خَشْيَةَ أَنْ يَعْمَلَ بِهِ النَّاسُ فَيُفْرَضَ عَلَيْهِمْ ."
      },
      {
        "id": 20374,
        "hadith_number": "1294",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulaiman bin al-Ash'ath al-Sijistani",
        "tajuk_hadith": "Keteguhan Rasulullah SAW dalam Solat Subuh dan Solat Dhuha",
        "perawi_melayu": "Simak",
        "english_text": "Narrated Simak: I asked Jabir bin Samurah: Did you sit in the company of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم ? He replied: Yes, very often. He would not stand from the place he prayed the dawn prayer till the sunrise. When the sun rose, he would stand (to pray Duha).",
        "malay_translation": "Dikisahkan oleh Simak: Aku bertanya kepada Jabir bin Samurah, \"Adakah engkau pernah berada di sisi Rasulullah SAW?\"  Dia menjawab, \"Ya, sangat kerap. Baginda tidak akan bangun dari tempat solat Subuh sehingga matahari terbit.  Apabila matahari terbit, Baginda akan berdiri untuk solat Dhuha.\"",
        "arabic_text": "حَدَّثَنَا ابْنُ نُفَيْلٍ، ‏‏‏‏‏‏وَأَحْمَدُ بْنُ يُونُسَ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا زُهَيْرٌ، ‏‏‏‏‏‏حَدَّثَنَا سِمَاكٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ لِجَابِرِ بْنِ سَمُرَةَ:‏‏‏‏ أَكُنْتَ تُجَالِسُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ؟ قَالَ:‏‏‏‏ نَعَمْ كَثِيرًا فَكَانَ لَا يَقُومُ مِنْ مُصَلَّاهُ الَّذِي صَلَّى فِيهِ الْغَدَاةَ حَتَّى تَطْلُعَ الشَّمْسُ، ‏‏‏‏‏‏فَإِذَا طَلَعَتْ قَامَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ."
      },
      {
        "id": 20375,
        "hadith_number": "1295",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulaiman bin al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Berpasangan di Siang dan Malam",
        "perawi_melayu": "Abdullah bin Umar",
        "english_text": "Narrated Abdullah ibn Umar: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Prayer by night and day should consist of pairs of rak'ahs.",
        "malay_translation": "Dikisahkan oleh Abdullah bin Umar: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Solat di waktu malam dan siang hendaklah terdiri daripada dua rakaat sekali gus.",
        "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ، ‏‏‏‏‏‏أَخْبَرَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ يَعْلَى بْنِ عَطَاءٍ، ‏‏‏‏‏‏عَنْ عَلِيِّ بْنِ عَبْدِ اللَّهِ الْبَارِقِيِّ، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ صَلَاةُ اللَّيْلِ وَالنَّهَارِ مَثْنَى مَثْنَى ."
      },
      {
        "id": 20376,
        "hadith_number": "1296",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Cara Solat yang Sempurna dan Solat Malam",
        "perawi_melayu": "Muttalib (رضي الله عنه)",
        "english_text": "Narrated Muttalib: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Prayer is to be offered in two rak'ahs; and you should recite the tashahhud at the end of two rak'ahs, and express your distress and humility and raise your hands and say praying: O Allah, O Allah. He who does not do so does not offer a perfect prayer. Abu Dawud was asked about offering prayer at night in two rak'ahs. He said: They may be two if you like and four if you like.",
        "malay_translation": "Diriwayatkan daripada Muttalib: Nabi ﷺ bersabda: \"Solat hendaklah dilakukan dalam dua rakaat; dan hendaklah kamu membaca tahiyyat pada akhir dua rakaat, dan menyatakan kesusahan dan kerendahan diri kamu serta mengangkat tangan dan berdoa: 'Ya Allah, Ya Allah'. Sesiapa yang tidak melakukannya, maka solatnya tidak sempurna. Abu Dawud ditanya tentang solat malam dalam dua rakaat. Beliau berkata: 'Boleh dua jika kamu mahu, dan boleh empat jika kamu mahu'.",
        "arabic_text": "حَدَّثَنَا ابْنُ الْمُثَنَّى، ‏‏‏‏‏‏حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ، ‏‏‏‏‏‏حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏حَدَّثَنِي عَبْدُ رَبِّهِ بْنُ سَعِيدٍ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ أَبِي أَنَسٍ، ‏‏‏‏‏‏عَنْعَبْدِ اللَّهِ بْنِ نَافِعٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، ‏‏‏‏‏‏عَنِ الْمُطَّلِبِ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ الصَّلَاةُ مَثْنَى مَثْنَى أَنْ تَشَهَّدَ فِي كُلِّ رَكْعَتَيْنِ، ‏‏‏‏‏‏وَأَنْ تَبَاءَسَ وَتَمَسْكَنَ وَتُقْنِعَ بِيَدَيْكَ، ‏‏‏‏‏‏وَتَقُولَ:‏‏‏‏ اللَّهُمَّ اللَّهُمَّ، ‏‏‏‏‏‏فَمَنْ لَمْ يَفْعَلْ ذَلِكَ فَهِيَ خِدَاجٌ . سُئِلَ أَبُو دَاوُدَ عَنْ صَلَاةِ اللَّيْلِ مَثْنَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنْ شِئْتَ مَثْنَى وَإِنْ شِئْتَ أَرْبَعًا."
      },
      {
        "id": 20377,
        "hadith_number": "1297",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulaiman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Keutamaan Solat Empat Rakaat dan Tasbih dalam Sunnah Nabi",
        "perawi_melayu": "Abdullah Ibn Abbas",
        "english_text": "Narrated Abdullah Ibn Abbas: The Messenger of Allah ﷺ said to al-Abbas ibn Abdul Muttalib: Abbas, my uncle, shall I not give you, shall I not present to you, shall I not donate to you, shall I not produce for you ten things? If you act upon them, Allah will forgive you your sins, first and last, old and new, involuntary and voluntary, small and great, secret and open. These are the ten things: you should pray four rak'ahs, reciting in each one Fatihat al-Kitab and a surah. When you finish the recitation of the first rak'ah you should say fifteen times while standing: \"Glory be to Allah\", \"Praise be to Allah\", \"There is no god but Allah\", \"Allah is most great\". Then you should bow and say it ten times while bowing. Then you should raise your head after bowing and say it ten times. Then you should kneel down in prostration and say it ten times while prostrating yourself. Then you should raise your head after prostration and say it ten times. Then you should prostrate yourself and say it ten times. Then you should raise your head after prostrating and say it ten times in every rak'ah. You should do that in four rak'ahs. If you can observe it once daily, do so; if not, then once weekly; if not, then once a month; if not, then once a year; if not, then once in your lifetime.",
        "malay_translation": "Dikisahkan oleh Abdullah Ibn Abbas: Rasulullah SAW bersabda kepada al-Abbas ibn Abdul Muttalib: Wahai Abbas, saudaraku, adakah aku tidak akan memberikan, tidakkah aku akan menghadirkan, tidakkah aku akan mendermakan, tidakkah aku akan menghasilkan sepuluh perkara untukmu? Jika engkau mengamalkannya, Allah akan mengampunkan dosa-dosamu, yang pertama dan yang terakhir, yang lama dan yang baru, yang tidak sengaja dan yang sengaja, yang kecil dan yang besar, yang tersembunyi dan yang nyata. Sepuluh perkara itu ialah: engkau hendaklah mengerjakan solat empat rakaat, membaca Surah Al-Fatihah dan satu surah dalam setiap rakaat. Apabila engkau selesai membaca bacaan dalam rakaat pertama, engkau hendaklah membaca tasbih sebanyak lima belas kali sambil berdiri: \"Maha Suci Allah\", \"Segala puji bagi Allah\", \"Tiada Tuhan melainkan Allah\", \"Allah Maha Besar\". Kemudian, engkau hendaklah ruku' dan membaca tasbih sebanyak sepuluh kali ketika ruku'. Kemudian, engkau hendaklah mengangkat kepala selepas ruku' dan membaca tasbih sebanyak sepuluh kali. Kemudian, engkau hendaklah sujud dan membaca tasbih sebanyak sepuluh kali ketika sujud. Kemudian, engkau hendaklah mengangkat kepala selepas sujud dan membaca tasbih sebanyak sepuluh kali. Kemudian, engkau hendaklah sujud dan membaca tasbih sebanyak sepuluh kali. Kemudian, engkau hendaklah mengangkat kepala selepas sujud dan membaca tasbih sebanyak sepuluh kali dalam setiap rakaat. Engkau hendaklah melakukan demikian dalam empat rakaat. Jika engkau dapat melakukannya sekali sehari, lakukanlah. Jika tidak, sekali seminggu; jika tidak, sekali sebulan; jika tidak, sekali setahun; jika tidak, sekali seumur hidup.",
        "arabic_text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ بِشْرِ بْنِ الْحَكَمِ النَّيْسَابُورِيُّ، ‏‏‏‏‏‏حَدَّثَنَا مُوسَى بْنُ عَبْدِ الْعَزِيزِ، ‏‏‏‏‏‏حَدَّثَنَا الْحَكَمُ بْنُ أَبَانَ، ‏‏‏‏‏‏عَنْعِكْرِمَةَ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ لِلْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ:‏‏‏‏ يَا عَبَّاسُ، ‏‏‏‏‏‏يَا عَمَّاهُ، ‏‏‏‏‏‏أَلَا أُعْطِيكَ، ‏‏‏‏‏‏أَلَا أَمْنَحُكَ، ‏‏‏‏‏‏أَلَا أَحْبُوكَ، ‏‏‏‏‏‏أَلَا أَفْعَلُ بِكَ عَشْرَ خِصَالٍ إِذَا أَنْتَ فَعَلْتَ ذَلِكَ غَفَرَ اللَّهُ لَكَ ذَنْبَكَ أَوَّلَهُ وَآخِرَهُ، ‏‏‏‏‏‏قَدِيمَهُ وَحَدِيثَهُ، ‏‏‏‏‏‏خَطَأَهُ وَعَمْدَهُ، ‏‏‏‏‏‏صَغِيرَهُ وَكَبِيرَهُ، ‏‏‏‏‏‏سِرَّهُ وَعَلَانِيَتَهُ، ‏‏‏‏‏‏عَشْرَ خِصَالٍ أَنْ تُصَلِّيَ أَرْبَعَ رَكَعَاتٍ تَقْرَأُ فِي كُلِّ رَكْعَةٍ فَاتِحَةَ الْكِتَابِ وَسُورَةً، ‏‏‏‏‏‏فَإِذَا فَرَغْتَ مِنَ الْقِرَاءَةِ فِي أَوَّلِ رَكْعَةٍ وَأَنْتَ قَائِمٌ، ‏‏‏‏‏‏قُلْتَ:‏‏‏‏ سُبْحَانَ اللَّهِ، ‏‏‏‏‏‏وَالْحَمْدُ لِلَّهِ، ‏‏‏‏‏‏وَلَا إِلَهَ إِلَّا اللَّهُ، ‏‏‏‏‏‏وَاللَّهُ أَكْبَرُ خَمْسَ عَشْرَةَ مَرَّةً، ‏‏‏‏‏‏ثُمَّ تَرْكَعُ، ‏‏‏‏‏‏فَتَقُولُهَا وَأَنْتَ رَاكِعٌ عَشْرًا، ‏‏‏‏‏‏ثُمَّ تَرْفَعُ رَأْسَكَ مِنَ الرُّكُوعِ فَتَقُولُهَا عَشْرًا، ‏‏‏‏‏‏ثُمَّ تَهْوِي سَاجِدًا فَتَقُولُهَا وَأَنْتَ سَاجِدٌ عَشْرًا، ‏‏‏‏‏‏ثُمَّ تَرْفَعُ رَأْسَكَ مِنَ السُّجُودِ فَتَقُولُهَا عَشْرًا، ‏‏‏‏‏‏ثُمَّ تَسْجُدُ فَتَقُولُهَا عَشْرًا، ‏‏‏‏‏‏ثُمَّ تَرْفَعُ رَأْسَكَ فَتَقُولُهَا عَشْرًا، ‏‏‏‏‏‏فَذَلِكَ خَمْسٌ وَسَبْعُونَ فِي كُلِّ رَكْعَةٍ، ‏‏‏‏‏‏تَفْعَلُ ذَلِكَ فِي أَرْبَعِ رَكَعَاتٍ إِنِ اسْتَطَعْتَ أَنْ تُصَلِّيَهَا فِي كُلِّ يَوْمٍ مَرَّةً فَافْعَلْ، ‏‏‏‏‏‏فَإِنْ لَمْ تَفْعَلْ فَفِي كُلِّ جُمُعَةٍ مَرَّةً، ‏‏‏‏‏‏فَإِنْ لَمْ تَفْعَلْ فَفِي كُلِّ شَهْرٍ مَرَّةً، ‏‏‏‏‏‏فَإِنْ لَمْ تَفْعَلْ فَفِي كُلِّ سَنَةٍ مَرَّةً، ‏‏‏‏‏‏فَإِنْ لَمْ تَفْعَلْ فَفِي عُمُرِكَ مَرَّةً ."
      },
      {
        "id": 20378,
        "hadith_number": "1298",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Petunjuk Solat Istimewa dan Ampunan Allah SWT",
        "perawi_melayu": "Abdullah ibn Amr",
        "english_text": "Narrated Abdullah ibn Amr: AbulJawza' said: A man who attended the company of the Prophet صلی ‌اللہ ‌علیہ ‌وسلم narrated to me (it is thought that he was Abdullah ibn Amr): The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said to me: Come to me tomorrow; I shall give you something, I shall give you something, I shall reward you something, I shall donate something to you. I thought that he would give me some present. He said (to me when I came to him): When the day declines, stand up and pray four rak'ahs. He then narrated something similar. This version adds: Do not stand until you glorify Allah ten times, and praise Him ten times, and exalt Him ten times, and say, There is no god but Allah ten times. Then you should do that in four rak'ahs. If you are the greatest sinner on earth, you will be forgiven (by Allah) on account of this (prayer). I asked: If I cannot pray this the appointed hour, (what should I do)? He replied: Pray that by night or by day (at any time). Abu Dawud said: Habban bin Hilal is the maternal uncle of Hilal al-Ra'i. Abu Dawud said: This tradition has been narrated by al-MustAmir bin al-Riyyan from Ibn al-Jawza' from Abdullah bin Amr without referring to the Prophet صلی ‌اللہ ‌علیہ ‌وسلم, - narrated as a statement of Abdullah bin Amr himself (mauquf). This has also been narrated by Rawh bin al-Musayyab, and Jafar bin Sulaiman from Amr bin Malik al-Nakri from Abu al-Jauza' from Ibn Abbas as his own statement (and not the statement of the Prophet). But the version of Rawh has the words: The tradition of the Prophet صلی ‌اللہ ‌علیہ ‌وسلم.",
        "malay_translation": "Diceritakan oleh Abdullah ibn Amr: Abul Jawza' berkata: Seorang lelaki yang pernah bersama Nabi صلی ‌اللہ ‌علیہ ‌وسلم menceritakan kepadaku (didapati dia ialah Abdullah ibn Amr): Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda kepadaku: Datanglah kepada aku esok; aku akan memberikan sesuatu kepadamu, aku akan memberikan sesuatu kepadamu, aku akan memberi ganjaran kepadamu, aku akan mendermakan sesuatu kepadamu. Aku menyangka baginya akan memberikan hadiah. Beliau bersabda (kepadaku ketika aku datang): Apabila matahari terbenam, berdirilah dan solat empat rakaat. Kemudiannya beliau menceritakan sesuatu yang serupa. Versi ini menambah: Janganlah berdiri sehingga engkau memuji Allah sebanyak sepuluh kali, dan memujiNya sebanyak sepuluh kali, dan mengagungkanNya sebanyak sepuluh kali, dan mengucapkan, \"Tidak ada Tuhan melainkan Allah\" sebanyak sepuluh kali. Kemudian lakukan itu dalam empat rakaat. Sekiranya engkau adalah orang yang paling berdosa di muka bumi, engkau akan diampuni (oleh Allah) disebabkan amalan (solat) ini. Aku bertanya: Jika aku tidak dapat menunaikan solat ini pada waktu yang ditentukan, (apa yang harus aku lakukan)? Jawabnya: Solatlah pada malam atau siang (pada bila-bila masa). Abu Dawud berkata: Habban bin Hilal adalah pakcik saudara kandung perempuan Hilal al-Ra'i. Abu Dawud berkata: Hadis ini diriwayatkan oleh al-MustAmir bin al-Riyyan daripada Ibn al-Jawza' daripada Abdullah bin Amr tanpa merujuk kepada Nabi صلی ‌اللہ ‌علیہ ‌وسلم, - diriwayatkan sebagai perkataan Abdullah bin Amr sendiri (mauquf). Ini juga diriwayatkan oleh Rawh bin al-Musayyab, dan Jafar bin Sulaiman daripada Amr bin Malik al-Nakri daripada Abu al-Jauza' daripada Ibn Abbas sebagai perkataan beliau sendiri (dan bukan perkataan Nabi). Tetapi versi Rawh mempunyai perkataan: Hadis Nabi صلی ‌اللہ ‌علیہ ‌وسلم.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سُفْيَانَ الْأُبُلِّيُّ، ‏‏‏‏‏‏حَدَّثَنَا حَبَّانُ بْنُ هِلَالٍ أَبُو حَبِيبٍ، ‏‏‏‏‏‏حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ، ‏‏‏‏‏‏حَدَّثَنَا عَمْرُو بْنُ مَالِكٍ، ‏‏‏‏‏‏عَنْ أَبِي الْجَوْزَاءِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي رَجُلٌ كَانَتْ لَهُ صُحْبَةٌ يَرَوْنَ أَنَّهُ عَبْدُ اللَّهِ بْنُ عَمْرٍو، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ لِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ ائْتِنِي غَدًا أَحْبُوكَ وَأُثِيبُكَ وَأُعْطِيكَ حَتَّى ظَنَنْتُ أَنَّهُ يُعْطِينِي عَطِيَّةً، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِذَا زَالَ النَّهَارُ، ‏‏‏‏‏‏فَقُمْ فَصَلِّ أَرْبَعَ رَكَعَاتٍ ، ‏‏‏‏‏‏فَذَكَرَ نَحْوَهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ثُمَّ تَرْفَعُ رَأْسَكَ، ‏‏‏‏‏‏يَعْنِي مِنَ السَّجْدَةِ الثَّانِيَةِ، ‏‏‏‏‏‏فَاسْتَوِ جَالِسًا وَلَا تَقُمْ حَتَّى تُسَبِّحَ عَشْرًا، ‏‏‏‏‏‏وَتَحْمَدَ عَشْرًا، ‏‏‏‏‏‏وَتُكَبِّرَ عَشْرًا، ‏‏‏‏‏‏وَتُهَلِّلَ عَشْرًا، ‏‏‏‏‏‏ثُمَّ تَصْنَعَ ذَلِكَ فِي الْأَرْبَعِ رَكَعَاتِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَإِنَّكَ لَوْ كُنْتَ أَعْظَمَ أَهْلِ الْأَرْضِ ذَنْبًا غُفِرَ لَكَ بِذَلِكَ قُلْتُ:‏‏‏‏ فَإِنْ لَمْ أَسْتَطِعْ أَنْ أُصَلِّيَهَا تِلْكَ السَّاعَةَ ؟ قَالَ:‏‏‏‏ صَلِّهَا مِنَ اللَّيْلِ وَالنَّهَارِ . قَالَ أَبُو دَاوُد:‏‏‏‏ حَبَّانُ بْنُ هِلَالٍ خَالُ هِلَالٍ الرَّأْيِ. قَالَ أَبُو دَاوُد:‏‏‏‏ رَوَاهُ الْمُسْتَمِرُّ بْنُ الرَّيَّانِ، ‏‏‏‏‏‏عَنْ أَبِي الْجَوْزَاءِ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو مَوْقُوفًا، ‏‏‏‏‏‏وَرَوَاهُ رَوْحُ بْنُ الْمُسَيَّبِ،‏‏‏‏وَجَعْفَرُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ مَالِكٍ النُّكْرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي الْجَوْزَاءِ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ قَوْلُهُ، ‏‏‏‏‏‏وَقَالَ فِي حَدِيثِ رَوْحٍ:‏‏‏‏ فَقَالَ:‏‏‏‏ حَدِيثُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 20379,
        "hadith_number": "1299",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hadis Mengenai Solat dan Peristiwa yang Berkaitan",
        "perawi_melayu": "Urwah bin Ruwaim",
        "english_text": "Narrated Urwah bin Ruwaim: That an al-Ansari narrated to him: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said to Jafar. He then narrated the tradition in like manner. This version has the words: In the second prostration of the first rak'ah in addition to the words transmitted by Mahdi bin Maimun (in the previous tradition).",
        "malay_translation": "Dikisahkan oleh Urwah bin Ruwaim: bahawa seorang lelaki al-Ansari menceritakan kepadanya: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم pernah bersabda kepada Jaafar. Kemudian beliau menyampaikan hadis ini dengan cara yang sama. Versi ini mempunyai tambahan perkataan: \"Dalam sujud kedua rakaat pertama\" selain perkataan yang disampaikan oleh Mahdi bin Maimun (dalam hadis terdahulu).",
        "arabic_text": "حَدَّثَنَا أَبُو تَوْبَةَ الرَّبِيعُ بْنُ نَافِعٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ مُهَاجِرٍ، ‏‏‏‏‏‏عَنْ عُرْوَةَ بْنِ رُوَيْمٍ، ‏‏‏‏‏‏حَدَّثَنِي الْأَنْصَارِيُّ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ لِجَعْفَرٍ:‏‏‏‏ بِهَذَا الْحَدِيثِ، ‏‏‏‏‏‏فَذَكَرَ نَحْوَهُمْ، ‏‏‏‏‏‏قَالَ فِي السَّجْدَةِ الثَّانِيَةِ مِنَ الرَّكْعَةِ الْأُولَى كَمَا قَالَ فِي حَدِيثِ مَهْدِيِّ بْنِ مَيْمُونٍ."
      },
      {
        "id": 20380,
        "hadith_number": "1300",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Sunat di Rumah Selepas Solat Maghrib",
        "perawi_melayu": "Kab ibn Ujrah",
        "english_text": "Narrated Kab ibn Ujrah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم came to the mosque of Banu AbdulAshhal. He prayed the sunset prayer there. When they finished the prayer, he saw them praying the supererogatory prayer after it. He said: This is the prayer to be offered in the houses.",
        "malay_translation": "Diriwayatkan oleh Kab ibn Ujrah: Nabi صلی ‌اللہ ‌علیہ ‌وسلم datang ke masjid Bani AbdulAshhal. Baginda menunaikan solat Maghrib di sana. Setelah selesai solat, Baginda melihat mereka menunaikan solat sunat selepasnya. Baginda bersabda: “Inilah solat yang sebaiknya dilakukan di rumah.”",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي الْأَسْوَدِ، ‏‏‏‏‏‏حَدَّثَنِي أَبُو مُطَرِّفٍ مُحَمَّدُ بْنُ أَبِي الْوَزِيرِ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى الْفِطْرِيُّ، ‏‏‏‏‏‏عَنْ سَعْدِ بْنِ إِسْحَاقَ بْنِ كَعْبِ بْنِ عُجْرَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى مَسْجِدَ بَنِي عَبْدِ الْأَشْهَلِ، ‏‏‏‏‏‏فَصَلَّى فِيهِ الْمَغْرِبَ، ‏‏‏‏‏‏فَلَمَّا قَضَوْا صَلَاتَهُمْ رَآهُمْ يُسَبِّحُونَ بَعْدَهَا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ هَذِهِ صَلَاةُ الْبُيُوتِ ."
      },
      {
        "id": 20381,
        "hadith_number": "1301",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Melembutkan Bacaan Al-Quran Selepas Solat Maghrib",
        "perawi_melayu": "Abdullah ibn Abbas",
        "english_text": "Narrated Abdullah ibn Abbas: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم used to prolong the recitation of the Quran in the two rak'ahs after the sunset prayer until the people praying in the mosque dispersed. Abu Dawud said: This has been reported by Nasr al-Mujaddir from Ya'qub al-Qummi with the same chain of narrators. Abu Dawud said: Muhammad bin 'Isa bin al-tabba' transmitted from Nasr al-Mujaddir from Ya'qub in like manner.",
        "malay_translation": "Dikisahkan oleh Abdullah ibn Abbas: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم  biasa memanjangkan bacaan Al-Quran dalam dua rakaat solat Maghrib sehingga orang-orang yang sedang bersembahyang di masjid itu beredar. Abu Dawud berkata: Hadis ini telah diriwayatkan oleh Nasr al-Mujaddir daripada Ya'qub al-Qummi dengan sanad yang sama. Abu Dawud juga berkata: Muhammad bin 'Isa bin al-tabba' meriwayatkan daripada Nasr al-Mujaddir daripada Ya'qub dengan cara yang sama.",
        "arabic_text": "حَدَّثَنَا حُسَيْنُ بْنُ عَبْدِ الرَّحْمَنِ الْجَرْجَرَائِيُّ، ‏‏‏‏‏‏حَدَّثَنَا طَلْقُ بْنُ غَنَّامٍ، ‏‏‏‏‏‏حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ جَعْفَرِ بْنِ أَبِي الْمُغِيرَةِ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ جُبَيْرٍ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُطِيلُ الْقِرَاءَةَ فِي الرَّكْعَتَيْنِ بَعْدَ الْمَغْرِبِ حَتَّى يَتَفَرَّقَ أَهْلُ الْمَسْجِدِ . قَالَ أَبُو دَاوُد:‏‏‏‏ رَوَاهُ نَصْرٌ الْمُجَدَّرُ، ‏‏‏‏‏‏عَنْ يَعْقُوبَ الْقُمِّيِّ وَأَسْنَدَهُ مِثْلَهُ. قَالَ أَبُو دَاوُد:‏‏‏‏ حَدَّثَنَاه مُحَمَّدُ بْنُ عِيسَى بْنِ الطَّبَّاعِ، ‏‏‏‏‏‏حَدَّثَنَا نَصْرٌ الْمُجَدَّرُ، ‏‏‏‏‏‏عَنْ يَعْقُوبَ مِثْلَهُ."
      },
      {
        "id": 20382,
        "hadith_number": "1302",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Riwayat Hadis Mursal oleh Saeed bin Jubair",
        "perawi_melayu": "Saeed bin Jubair (secara mursal)",
        "english_text": "Narrated Saeed bin Jubair: This tradition from the Prophet صلی ‌اللہ ‌علیہ ‌وسلم without mentioning the name of the Companion in the chain (in the mursal form). Abu dawud said: I heard Muhammad bin Humaid say: I heard Ya'qub say: Anything I narrated to you from Jafar on the authority of Saeed bin Jubair from the Prophet صلی ‌اللہ ‌علیہ ‌وسلم is directly coming from Ibn Abbas from the Prophet صلی ‌اللہ ‌علیہ ‌وسلم.",
        "malay_translation": "Diriwayatkan daripada Saeed bin Jubair: Hadis ini daripada Nabi صلی ‌اللہ ‌علیہ ‌وسلم tanpa menyebut nama Sahabat dalam rantaian (dalam bentuk mursal). Abu Dawud berkata: Aku mendengar Muhammad bin Humaid berkata: Aku mendengar Ya'qub berkata: Apa sahaja yang aku riwayatkan kepadamu daripada Ja'far daripada Saeed bin Jubair daripada Nabi صلی ‌اللہ ‌علیہ ‌وسلم adalah datang secara langsung daripada Ibn Abbas daripada Nabi صلی ‌اللہ ‌علیہ ‌وسلم.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، ‏‏‏‏‏‏وَسُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا يَعْقُوبُ، ‏‏‏‏‏‏عَنْ جَعْفَرٍ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ جُبَيْرٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ بِمَعْنَاهُ مُرْسَلًا. قَالَ أَبُو دَاوُد:‏‏‏‏ سَمِعْت مُحَمَّدَ بْنَ حُمَيْدٍ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ سَمِعْتُ يَعْقُوبَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ كُلُّ شَيْءٍ حَدَّثْتُكُمْ عَنْ جَعْفَرِ بْنِ الْمُغِيرَةِ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ جُبَيْرٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَهُوَ مُسْنَدٌ عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 20383,
        "hadith_number": "1303",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Malam Nabi Muhammad SAW dan Peristiwa Hujan",
        "perawi_melayu": "Aishah, Ummul Muminin, Shurayh ibn Hani",
        "english_text": "Narrated Aishah, Ummul Muminin: Shurayh ibn Hani said: I asked Aishah about the prayer of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم. She said: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم never offered the night prayer and thereafter came to me but he offered four or six rak'ahs of prayer. One night the rain fell, so we spread a piece of leather (for his prayer), and now I see as if there is a hole in it from which the water is flowing. I never saw him protecting his clothes from the earth (as he did on that occasion).",
        "malay_translation": "Diriwayatkan daripada Aishah, Ummul Muminin: Shurayh ibn Hani berkata: Aku bertanya kepada Aishah tentang solat Rasulullah ﷺ. Beliau berkata: Rasulullah ﷺ tidak pernah menunaikan solat Isyak dan kemudian datang kepadaku melainkan baginda menunaikan empat atau enam rakaat solat. Pada suatu malam, hujan turun, lalu kami menghamparkan sekeping kulit (untuk solat baginda), dan sekarang aku seolah-olah melihat ada lubang padanya yang mengeluarkan air. Aku tidak pernah melihat baginda melindungi pakaiannya daripada tanah (seperti yang baginda lakukan pada ketika itu).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، ‏‏‏‏‏‏حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ الْعُكْلِيُّ، ‏‏‏‏‏‏حَدَّثَنِي مَالِكُ بْنُ مِغْوَلٍ، ‏‏‏‏‏‏حَدَّثَنِي مُقَاتِلُ بْنُ بَشِيرٍ الْعِجْلِيُّ، ‏‏‏‏‏‏عَنْشُرَيْحِ بْنِ هَانِئٍ،‏‏‏‏عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَأَلْتُهَا عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ مَا صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعِشَاءَ قَطُّ فَدَخَلَ عَلَيَّ إِلَّا صَلَّى أَرْبَعَ رَكَعَاتٍ أَوْ سِتَّ رَكَعَاتٍ، ‏‏‏‏‏‏وَلَقَدْ مُطِرْنَا مَرَّةً بِاللَّيْلِ فَطَرَحْنَا لَهُ نِطَعًا فَكَأَنِّي أَنْظُرُ إِلَى ثُقْبٍ فِيهِ يَنْبُعُ الْمَاءُ مِنْهُ، ‏‏‏‏‏‏وَمَا رَأَيْتُهُ مُتَّقِيًا الْأَرْضَ بِشَيْءٍ مِنْ ثِيَابِهِ قَطُّ ."
      },
      {
        "id": 20384,
        "hadith_number": "1304",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Penjelasan dan Keutamaan Solat Tahajjud",
        "perawi_melayu": "Abdullah Ibn Abbas",
        "english_text": "Narrated Abdullah Ibn Abbas: In Surat al-Muzzammil (73), the verse: Keep vigil at night but a little, a half thereof (2-3) has been abrogated by the following verse: He knoweth that ye count it not, and turneth unto you in mercy. Recite then of the Quran that which is easy for you (v. 20). The phrase the vigil of the night (nashi'at al-layl) means the early hours of the night. They (the companions) would pray (the tahajjud prayer) in the early hours of the night. He (Ibn Abbas) says: It is advisable to offer the prayer at night (tahajjud), prescribed by Allah for you (in the early hours of the night). This is because when a person sleeps, he does not know when he will awake. The words speech more certain (aqwamu qilan) means that this time is more suitable for the understanding of the Quran. He says: The verse: Lo, thou hast by day a chain of business (v. 7) means engagement for long periods (in the day's work).",
        "malay_translation": "Diceritakan oleh Abdullah Ibn Abbas: Dalam Surah al-Muzzammil (73), ayat yang bermaksud: Berjaga di malam hari tetapi sedikit, separuh daripadanya (2-3) telah diansur keluar oleh ayat berikutnya: Dia mengetahui bahawa kamu tidak dapat menghitungnya, dan Dia mengaruniakan rahmat-Nya kepada kamu. Bacalah dari Al-Quran apa yang mudah bagi kamu (ayat 20). Ungkapan 'jaga malam' (nashi'at al-layl) bermaksud waktu-waktu awal malam. Para sahabat akan mendirikan solat tahajjud pada waktu-waktu awal malam. Beliau (Ibn Abbas) berkata: Dianjurkan untuk mendirikan solat malam (tahajjud), yang telah ditetapkan oleh Allah bagi kamu (pada waktu-waktu awal malam). Ini kerana apabila seseorang tidur, dia tidak tahu bila dia akan terjaga. Ungkapan 'ucapan lebih yakin' (aqwamu qilan) bermaksud bahawa masa ini lebih sesuai untuk memahami Al-Quran. Beliau berkata: Ayat \"Sesungguhnya engkau mempunyai pekerjaan di siang hari (ayat 7)\" bermaksud penglibatan yang panjang (dalam kerja seharian). ",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ الْمَرْوَزِيُّ ابْنِ شَبُّوَيْهِ، ‏‏‏‏‏‏حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ يَزِيدَ النَّحْوِيِّ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنْابْنِ عَبَّاسٍ،‏‏‏‏قَالَ فِي الْمُزَّمِّلِ:‏‏‏‏ قُمِ اللَّيْلَ إِلا قَلِيلا ‏‏‏‏ 2 ‏‏‏‏ نِصْفَهُ سورة المزمل آية 1-2 نَسَخَتْهَا الْآيَةُ الَّتِي فِيهَا عَلِمَ أَنْ لَنْ تُحْصُوهُ فَتَابَ عَلَيْكُمْ فَاقْرَءُوا مَا تَيَسَّرَ مِنَ الْقُرْءَانِ سورة المزمل آية 20 وَنَاشِئَةُ اللَّيْلِ:‏‏‏‏ أَوَّلُهُ، ‏‏‏‏‏‏وَكَانَتْ صَلَاتُهُمْ لِأَوَّلِ اللَّيْلِ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ هُوَ أَجْدَرُ أَنْ تُحْصُوا مَا فَرَضَ اللَّهُ عَلَيْكُمْ مِنْ قِيَامِ اللَّيْلِ، ‏‏‏‏‏‏وَذَلِكَ أَنَّ الْإِنْسَانَ إِذَا نَامَ لَمْ يَدْرِ مَتَى يَسْتَيْقِظُ، ‏‏‏‏‏‏وَقَوْلُهُ:‏‏‏‏ وَأَقْوَمُ قِيلا سورة المزمل آية 6 هُوَ أَجْدَرُ أَنْ يَفْقَهَ فِي الْقُرْآنِ، ‏‏‏‏‏‏وَقَوْلُهُ:‏‏‏‏ إِنَّ لَكَ فِي النَّهَارِ سَبْحًا طَوِيلا سورة المزمل آية 7، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ فَرَاغًا طَوِيلًا."
      },
      {
        "id": 20385,
        "hadith_number": "1305",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Tempoh Antara Wahyu Surah Al-Muzzammil",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "Narrated Ibn Abbas: When the opening verses of Surah Al-muzammil was revealed, the Companions would pray as long as they would pray during Ramadan until its last verses were revealed. The period between the revelation of its opening and the last verses was one year.",
        "malay_translation": "Diriwayatkan oleh Ibn Abbas: Apabila ayat-ayat awal Surah Al-Muzzammil diturunkan, para Sahabat akan solat selama mereka solat semasa bulan Ramadan sehingga ayat-ayat terakhirnya diturunkan. Tempoh antara penurunan ayat-ayat awalnya dan ayat-ayat terakhirnya adalah satu tahun.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ يَعْنِي الْمَرْوَزِيَّ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنْ مِسْعَرٍ، ‏‏‏‏‏‏عَنْ سِمَاكٍ الْحَنَفِيِّ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَمَّا نَزَلَتْ أَوَّلُ الْمُزَّمِّلِ كَانُوا يَقُومُونَ نَحْوًا مِنْ قِيَامِهِمْ فِي شَهْرِ رَمَضَانَ حَتَّى نَزَلَ آخِرُهَا، ‏‏‏‏‏‏وَكَانَ بَيْنَ أَوَّلِهَا وَآخِرِهَا سَنَةٌ."
      },
      {
        "id": 20386,
        "hadith_number": "1306",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Kesan Buruk Syaitan pada Waktu Tidur dan Cara Mengatasinya",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Narrated Abu Hurairah: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم as saying: When one you sleeps, the devil ties three knots at the back of his neck, sealing every knot with, You have a long night, so sleep. So if one awakes and mentions Allah, a knot will be loosened; if he performs ablution another knot will be loosened; and if he prays, the third knot will be loosened; and in the morning he will be active and in good spirits; otherwise he will be in bad spirits and sluggish.",
        "malay_translation": "Perawi Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda: Apabila seseorang itu tidur, syaitan mengikat tiga simpul di belakang lehernya, dan setiap simpul disempurnakan dengan kata-kata, \"Kamu mempunyai malam yang panjang, jadi tidurlah.\" Jika seseorang itu bangun dan menyebut nama Allah, satu simpul akan longgar; jika dia berwضو', satu simpul lagi akan longgar; dan jika dia solat, simpul ketiga akan longgar; dan pada waktu pagi dia akan bertenaga dan bersemangat; sebaliknya, dia akan berasa lemah dan lesu.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ أَبِي الزِّنَادِ، ‏‏‏‏‏‏عَنْ الْأَعْرَجِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ يَعْقِدُ الشَّيْطَانُ عَلَى قَافِيَةِ رَأْسِ أَحَدِكُمْ إِذَا هُوَ نَامَ ثَلَاثَ، ‏‏‏‏‏‏عُقَدٍ يَضْرِبُ مَكَانَ كُلِّ عُقْدَةٍ عَلَيْكَ لَيْلٌ طَوِيلٌ فَارْقُدْ، ‏‏‏‏‏‏فَإِنِ اسْتَيْقَظَ فَذَكَرَ اللَّهَ انْحَلَّتْ عُقْدَةٌ، ‏‏‏‏‏‏فَإِنْ تَوَضَّأَ انْحَلَّتْ عُقْدَةٌ، ‏‏‏‏‏‏فَإِنْ صَلَّى انْحَلَّتْ عُقْدَةٌ، ‏‏‏‏‏‏فَأَصْبَحَ نَشِيطًا طَيِّبَ النَّفْسِ، ‏‏‏‏‏‏وَإِلَّا أَصْبَحَ خَبِيثَ النَّفْسِ كَسْلَانَ ."
      },
      {
        "id": 20387,
        "hadith_number": "1307",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Keutamaan Solat Malam dan Kesabaran Rasulullah SAW Dalam Keadaan Sakit",
        "perawi_melayu": "Aishah, Ummul Mukminin",
        "english_text": "Narrated Aishah, Ummul Muminin: Do not give up prayer at night, for the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم would not leave it. Whenever he fell ill or lethargic, he would offer it sitting.",
        "malay_translation": "Diriwayatkan oleh Aishah, Ummul Mukminin: Jangan tinggalkan solat malam, kerana Rasulullah SAW tidak pernah meninggalkannya.  Apabila Baginda sakit atau lemah, Baginda tetap menunaikan solat sambil duduk.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو دَاوُدَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ يَزِيدَ بْنِ خُمَيْرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي قَيْسٍ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ قَالَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا:‏‏‏‏ لَا تَدَعْ قِيَامَ اللَّيْلِ، ‏‏‏‏‏‏فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَدَعُهُ، ‏‏‏‏‏‏وَكَانَ إِذَا مَرِضَ أَوْ كَسِلَ صَلَّى قَاعِدًا ."
      },
      {
        "id": 20388,
        "hadith_number": "1308",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Keutamaan Berjaga Malam dan Mengajak Isteri/Suami Solat",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Narrated Abu Hurairah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: May Allah have mercy on a man who gets up at night and prays, and awakens his wife; if she refuses, he should sprinkle water on her face. May Allah have mercy on a woman who gets up at night and prays, and awakens her husband; if he refuses, she would sprinkle water on his face.",
        "malay_translation": "Dikisahkan oleh Abu Hurairah: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Semoga Allah merahmati lelaki yang bangun malam dan solat, dan membangunkan isterinya; jika dia enggan, maka dia hendaklah menyiram air ke wajahnya. Semoga Allah merahmati wanita yang bangun malam dan solat, dan membangunkan suaminya; jika dia enggan, maka dia hendaklah menyiram air ke wajahnya.",
        "arabic_text": "حَدَّثَنَا ابْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ عَجْلَانَ، ‏‏‏‏‏‏عَنْ الْقَعْقَاعِ، ‏‏‏‏‏‏عَنْ أَبِي صَالِحٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ رَحِمَ اللَّهُ رَجُلًا قَامَ مِنَ اللَّيْلِ فَصَلَّى وَأَيْقَظَ امْرَأَتَهُ، ‏‏‏‏‏‏فَإِنْ أَبَتْ نَضَحَ فِي وَجْهِهَا الْمَاءَ، ‏‏‏‏‏‏رَحِمَ اللَّهُ امْرَأَةً قَامَتْ مِنَ اللَّيْلِ فَصَلَّتْ وَأَيْقَظَتْ زَوْجَهَا، ‏‏‏‏‏‏فَإِنْ أَبَى نَضَحَتْ فِي وَجْهِهِ الْمَاءَ ."
      },
      {
        "id": 20389,
        "hadith_number": "1309",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Keutamaan Solat Berdua di Malam Hari",
        "perawi_melayu": "Abu Sa'id dan Abu Hurairah",
        "english_text": "Narrated Abu Saeed and Abu Hurairah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: If a man awakens his wife at night, and then both pray or both offer two rak'ahs together, the (name of the )man will be recorded among those who mention the name of Allah, and the (name of the) woman will be recorded among those who mention the name of Allah. Ibn Kathir did not narrate this tradition as a statement of the Prophet صلی ‌اللہ ‌علیہ ‌وسلم, but he reported it as a statement of Abu Saeed. Abu Dawud said: This tradition has been narrated by Ibn Mahdi from Sufyan and I think he mentioned the name of Sufyan. He also said: The tradition transmitted by Sufyan is a statement of the Companion (and not that of the Prophet).",
        "malay_translation": "Dikisahkan oleh Abu Sa'id dan Abu Hurairah: Rasulullah SAW bersabda, \"Jika seorang suami membangunkan isterinya di malam hari, dan kemudian mereka berdua solat atau melakukan dua rakaat bersama-sama, maka namanya akan dicatat di kalangan orang yang menyebut nama Allah, dan nama isterinya akan dicatat di kalangan orang yang menyebut nama Allah.\" Ibn Kathir tidak meriwayatkan hadis ini sebagai sabda Nabi SAW, tetapi beliau meriwayatkannya sebagai perkataan Abu Sa'id. Abu Dawud berkata, \"Hadis ini diriwayatkan oleh Ibn Mahdi daripada Sufyan, dan aku fikir beliau menyebut nama Sufyan. Beliau juga berkata, Hadis yang disampaikan oleh Sufyan adalah perkataan sahabat (bukan perkataan Nabi).\" ",
        "arabic_text": "حَدَّثَنَا ابْنُ كَثِيرٍ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ مِسْعَرٍ، ‏‏‏‏‏‏عَنْ عَلِيِّ بْنِ الْأَقْمَرِ. ح وحَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ بَزِيعٍ، ‏‏‏‏‏‏حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، ‏‏‏‏‏‏عَنْ شَيْبَانَ، ‏‏‏‏‏‏عَنْ الْأَعْمَشِ، ‏‏‏‏‏‏عَنْ عَلِيِّ بْنِ الْأَقْمَرِ الْمَعْنَى، ‏‏‏‏‏‏عَنْ الْأَغَرِّ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ، ‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا أَيْقَظَ الرَّجُلُ أَهْلَهُ مِنَ اللَّيْلِ فَصَلَّيَا أَوْ صَلَّى رَكْعَتَيْنِ جَمِيعًا كُتِبَا فِي الذَّاكِرِينَ وَالذَّاكِرَاتِ وَلَمْ يَرْفَعْهُ ابْنُ كَثِيرٍ، ‏‏‏‏‏‏وَلَا ذَكَرَ أَبَا هُرَيْرَةَ، ‏‏‏‏‏‏جَعَلَهُ كَلَامَ أَبِي سَعِيدٍ. قَالَ أَبُو دَاوُد:‏‏‏‏ رَوَاهُ ابْنُ مَهْدِيٍّ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَأُرَاهُ ذَكَرَ أَبَا هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ أَبُو دَاوُد:‏‏‏‏ وَحَدِيثُ سُفْيَانَ مَوْقُوفٌ."
      },
      {
        "id": 20390,
        "hadith_number": "1310",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Ketika Mengantuk",
        "perawi_melayu": "Aishah, isteri Nabi صلی ‌اللہ ‌علیہ ‌وسلم",
        "english_text": "Narrated Aishah, wife of Prophet صلی ‌اللہ ‌علیہ ‌وسلم: When one of you dozes in prayer he should sleep till his sleep is gone, for when one of you prays while he is dozing, perhaps he might curse himself if he begs pardon of Allah.",
        "malay_translation": "Diriwayatkan daripada Aishah, isteri Nabi صلی ‌اللہ ‌علیہ ‌وسلم: Apabila seseorang daripada kamu mengantuk dalam solat, maka hendaklah dia tidur sehingga hilang rasa kantuknya. Sesungguhnya, jika seseorang daripada kamu solat dalam keadaan mengantuk, kemungkinan dia akan memohon keampunan daripada Allah tetapi tersalah menyebut perkataan yang mencela dirinya sendiri.",
        "arabic_text": "حَدَّثَنَا الْقَعْنَبِيُّ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِذَا نَعَسَ أَحَدُكُمْ فِي الصَّلَاةِ فَلْيَرْقُدْ حَتَّى يَذْهَبَ عَنْهُ النَّوْمُ، ‏‏‏‏‏‏فَإِنَّ أَحَدَكُمْ إِذَا صَلَّى وَهُوَ نَاعِسٌ لَعَلَّهُ يَذْهَبُ يَسْتَغْفِرُ فَيَسُبَّ نَفْسَهُ ."
      },
      {
        "id": 20391,
        "hadith_number": "1311",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Seseorang yang Tergagap Membaca Al-Quran di Waktu Malam",
        "perawi_melayu": "Abu Hurairah (رَضِيَ اللَّهُ عَنْهُ)",
        "english_text": "Narrated Abu Hurairah: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم as saying: When one of you gets up by night (to pray), and falters in reciting the Quran (due to sleep), and he does not understand what he utters, he should sleep.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah (رَضِيَ اللَّهُ عَنْهُ) bahawa Rasulullah ﷺ bersabda: “Apabila salah seorang daripada kamu bangun di waktu malam (untuk solat), dan tergagap dalam membaca Al-Quran (kerana mengantuk), dan dia tidak memahami apa yang diucapkannya, maka hendaklah dia tidur.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَخْبَرَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا قَامَ أَحَدُكُمْ مِنَ اللَّيْلِ فَاسْتَعْجَمَ الْقُرْآنُ عَلَى لِسَانِهِ فَلَمْ يَدْرِ مَا يَقُولُ فَلْيَضْطَجِعْ ."
      },
      {
        "id": 20392,
        "hadith_number": "1312",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukum Solat dan Beristirehat Ketika Penat",
        "perawi_melayu": "Anas (RA)",
        "english_text": "Narrated Anas: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم entered the mosque (and saw that) a rope tied between two pillars. He asked: What is this rope (for) ? The people told him: This is (for) Hamnah bin Jahsh who prays (here). When she is tired, she reclines on it. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said: She should pray as much as she has strength. When she is tired, she should sit down. This version of Ziyad has: He said: What is this ? The people told him: This is for Zainab who prays. When she becomes lazy, or is tired, she holds it. He said: Undo it. One of you should pray in good spirits. When he is lazy or tired, he should sit down.",
        "malay_translation": "Diriwayatkan daripada Anas: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم masuk ke dalam masjid (dan melihat) seutas tali diikat di antara dua tiang. Baginda bertanya: “Apakah tali ini (untuk)?” Orang ramai memberitahu baginda: “Ini (untuk) Hamnah binti Jahsh yang solat (di sini). Apabila dia penat, dia bersandar padanya.” Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: “Hendaklah dia solat seberapa mampu. Apabila dia penat, hendaklah dia duduk.” Versi Ziyad ini ada: Baginda bersabda: “Apakah ini?” Orang ramai memberitahu baginda: “Ini untuk Zainab yang solat. Apabila dia malas, atau penat, dia memegangnya.” Baginda bersabda: “Lepaskan ia. Seseorang daripada kamu hendaklah solat dalam semangat yang baik. Apabila dia malas atau penat, hendaklah dia duduk.",
        "arabic_text": "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ، ‏‏‏‏‏‏وَهَارُونُ بْنُ عَبَّادٍ الْأَزْدِيُّ، ‏‏‏‏‏‏أَنَّ إِسْمَاعِيلَ بْنَ إِبْرَاهِيمَ حَدَّثَهُمْ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْعَزِيزِ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَسْجِدَ وَحَبْلٌ مَمْدُودٌ بَيْنَ سَارِيَتَيْنِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا هَذَا الْحَبْلُ ؟ فَقِيلَ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏هَذِهِ حَمْنَةُ بِنْتُ جَحْشٍ تُصَلِّي، ‏‏‏‏‏‏فَإِذَا أَعْيَتْ تَعَلَّقَتْ بِهِ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لِتُصَلِّ مَا أَطَاقَتْ، ‏‏‏‏‏‏فَإِذَا أَعْيَتْ فَلْتَجْلِسْ . قَالَ زِيَادٌ:‏‏‏‏ فَقَالَ:‏‏‏‏ مَا هَذَا ؟ فَقَالُوا:‏‏‏‏ لِزَيْنَبَ تُصَلِّي، ‏‏‏‏‏‏فَإِذَا كَسِلَتْ أَوْ فَتَرَتْ أَمْسَكَتْ بِهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ حُلُّوهُ فَقَالَ:‏‏‏‏ لِيُصَلِّ أَحَدُكُمْ نَشَاطَهُ، ‏‏‏‏‏‏فَإِذَا كَسِلَ أَوْ فَتَرَ فَلْيَقْعُدْ ."
      },
      {
        "id": 20393,
        "hadith_number": "1313",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman bin al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Menggantikan Tilawah Harian yang Terlepas Semasa Tidur",
        "perawi_melayu": "Umar bin al-Khattab",
        "english_text": "Narrated Umar bin Al-Khattab: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم as saying: He who misses him daily round of recital or part of it due to sleep and he recites it between the dawn and the noon prayers, will be reckoned as if he recited it at night.",
        "malay_translation": "Dikisahkan oleh Umar bin al-Khattab: Rasulullah SAW bersabda, \"Barangsiapa yang terlepas daripada membaca bacaan hariannya atau sebahagian darinya disebabkan tidur dan dia membacanya di antara waktu Subuh dan Zuhur, maka ia dikira seperti membacanya pada waktu malam.\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو صَفْوَانَ عَبْدُ اللَّهِ بْنُ سَعِيدِ بْنِ عَبْدِ الْمَلِكِ بْنِ مَرْوَانَ. ح وحَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ، ‏‏‏‏‏‏وَمُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا ابْنُ وَهْبٍ الْمَعْنَى، ‏‏‏‏‏‏عَنْ يُونُسَ، ‏‏‏‏‏‏عَنْ ابْنِ شِهَابٍ، ‏‏‏‏‏‏أَنَّ السَّائِبَ بْنَ يَزِيدَ، ‏‏‏‏‏‏وَعُبَيْدَ اللَّهِ أَخْبَرَاهُ، ‏‏‏‏‏‏أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَبْدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ عَنْ ابْنِ وَهْبِ بْنِ عَبْدٍ الْقَارِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ نَامَ عَنْ حِزْبِهِ أَوْ عَنْ شَيْءٍ مِنْهُ فَقَرَأَهُ مَا بَيْنَ صَلَاةِ الْفَجْرِ وَصَلَاةِ الظُّهْرِ كُتِبَ لَهُ كَأَنَّمَا قَرَأَهُ مِنَ اللَّيْلِ ."
      },
      {
        "id": 20394,
        "hadith_number": "1314",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Ganjaran Solat Malam Walaupun Tertidur",
        "perawi_melayu": "Aishah, Ummul Muminin",
        "english_text": "Narrated Aishah, Ummul Muminin: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Any person who offers prayer at night regularly but (on a certain night) he is dominated by sleep will be given the reward of praying. His sleep will be almsgiving.",
        "malay_translation": "Diriwayatkan daripada Aishah, Ummul Muminin: Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Sesiapa yang mendirikan solat malam secara tetap, tetapi (pada suatu malam) dia dikuasai oleh tidur, maka dia akan diberi ganjaran seperti sedang bersolat. Tidurnya itu dikira sebagai sedekah.",
        "arabic_text": "حَدَّثَنَا الْقَعْنَبِيُّ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ جُبَيْرٍ، ‏‏‏‏‏‏عَنْ رَجُلٍ عِنْدَهُ رَضِيٍّ، ‏‏‏‏‏‏أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَتْهُ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَا مِنَ امْرِئٍ تَكُونُ لَهُ صَلَاةٌ بِلَيْلٍ يَغْلِبُهُ عَلَيْهَا نَوْمٌ إِلَّا كُتِبَ لَهُ أَجْرُ صَلَاتِهِ، ‏‏‏‏‏‏وَكَانَ نَوْمُهُ عَلَيْهِ صَدَقَةً ."
      },
      {
        "id": 20395,
        "hadith_number": "1315",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Turunnya Allah SWT pada Sepertiga Malam Akhir",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Narrated Abu Hurairah: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم as saying: Our Lord who is blessed and exalted descends every night to the lowest heaven when the last one-third of the night remains, and says: Who supplicated Me so that I may answer him ? Who asks of Me so that I may give to him ? Who asks My forgiveness so that I may forgive him ?",
        "malay_translation": "Dikisahkan oleh Abu Hurairah bahawa Rasulullah SAW bersabda: Tuhan kita yang Maha Terpuji dan Maha Tinggi turun setiap malam ke langit yang paling rendah apabila tinggal sepertiga malam yang terakhir, dan Dia berfirman: Siapakah yang berdoa kepada-Ku agar Aku mengabulkannya? Siapakah yang meminta kepada-Ku agar Aku memberinya? Siapakah yang memohon ampunan-Ku agar Aku mengampuninya?",
        "arabic_text": "حَدَّثَنَا الْقَعْنَبِيُّ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ ابْنِ شِهَابٍ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏وَعَنْ أَبِي عَبْدِ اللَّهِ الْأَغَرِّ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ يَنْزِلُ رَبُّنَا تَبَارَكَ وَتَعَالَى كُلَّ لَيْلَةٍ إِلَى سَمَاءِ الدُّنْيَا حِينَ يَبْقَى ثُلُثُ اللَّيْلِ الْآخِرُ، ‏‏‏‏‏‏فَيَقُولُ:‏‏‏‏ مَنْ يَدْعُونِي فَأَسْتَجِيبَ لَهُ، ‏‏‏‏‏‏مَنْ يَسْأَلُنِي فَأُعْطِيَهُ، ‏‏‏‏‏‏مَنْ يَسْتَغْفِرُنِي فَأَغْفِرَ لَهُ ."
      },
      {
        "id": 20396,
        "hadith_number": "1316",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Rasulullah ﷺ Membangunkan Diri untuk Beribadah di Waktu Malam",
        "perawi_melayu": "Aishah (رضي الله عنها)",
        "english_text": "Narrated Aishah: Allah, the Exalted, would awaken the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم at night. When the dawn came, he would his finish daily round of recital.",
        "malay_translation": "Diriwayatkan daripada Aishah (رضي الله عنها): Allah, Yang Maha Tinggi, membangunkan Rasulullah ﷺ pada waktu malam. Apabila tiba waktu fajar, Baginda ﷺ akan menyelesaikan bacaan wirid harian Baginda.",
        "arabic_text": "حَدَّثَنَا حُسَيْنُ بْنُ يَزِيدَ الْكُوفِيُّ، ‏‏‏‏‏‏حَدَّثَنَا حَفْصٌ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ إِنْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيُوقِظُهُ اللَّهُ عَزَّ وَجَلَّ بِاللَّيْلِ فَمَا يَجِيءُ السَّحَرُ حَتَّى يَفْرُغَ مِنْ حِزْبِهِ ."
      },
      {
        "id": 20397,
        "hadith_number": "1317",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Waktu Solat Malam Rasulullah ﷺ",
        "perawi_melayu": "Masruq",
        "english_text": "Masruq said: I asked Aishah about the prayer of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم, and I said to her: At what time he prayed at night ? She said: When he heard the cock crow, he got up and prayed.",
        "malay_translation": "Masruq berkata: Saya bertanya kepada Aisyah tentang solat Rasulullah ﷺ, dan saya berkata kepadanya: Pada waktu bilakah baginda solat pada waktu malam? Aisyah berkata: Apabila baginda mendengar ayam berkokok, baginda bangun dan solat.",
        "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، ‏‏‏‏‏‏حَدَّثَنَا أَبُو الْأَحْوَصِ. ح وحَدَّثَنَا هَنَّادٌ، ‏‏‏‏‏‏عَنْ أَبِي الْأَحْوَصِ وَهَذَا حَدِيثُ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْأَشْعَثَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ مَسْرُوقٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَأَلْتُ عَائِشَةَ رَضِيَ اللَّهُ عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقُلْتُ لَهَا:‏‏‏‏ أَيَّ حِينٍ كَانَ يُصَلِّي ؟ قَالَتْ:‏‏‏‏ كَانَ إِذَا سَمِعَ الصُّرَاخَ قَامَ فَصَلَّى ."
      },
      {
        "id": 20398,
        "hadith_number": "1318",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Nabi ﷺ Tidur di Waktu Subuh Bersama Aisyah رضي الله عنها",
        "perawi_melayu": "Aisyah رضي الله عنها",
        "english_text": "Narrated Aishah: When he was with me he would sleep at dawn. By this she referred to the Prophet صلی ‌اللہ ‌علیہ ‌وسلم.",
        "malay_translation": "Diriwayatkan daripada Aisyah رضي الله عنها: Apabila baginda (Nabi Muhammad ﷺ) bersama ku, baginda akan tidur di waktu subuh. Dengan ini beliau merujuk kepada Nabi صلی ‌اللہ ‌علیہ ‌وسلم.",
        "arabic_text": "حَدَّثَنَا أَبُو تَوْبَةَ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ مَا أَلْفَاهُ السَّحَرُ عِنْدِي إِلَّا نَائِمًا، ‏‏‏‏‏‏تَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ."
      },
      {
        "id": 20399,
        "hadith_number": "1319",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Doa Nabi SAW Ketika Dalam Kesulitan",
        "perawi_melayu": "Hudhaifah (رَضِيَ ٱللَّٰهُ عَنْهُ)",
        "english_text": "Hudhaifah said: When anything distressed the Prophet صلی ‌اللہ ‌علیہ ‌وسلم, he prayed.",
        "malay_translation": "Hudzaifah berkata: Apabila sesuatu perkara menyusahkan Nabi صلی ‌اللہ ‌علیہ ‌وسلم, baginda akan menunaikan solat.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ الدُّؤَلِيِّ، ‏‏‏‏‏‏عَنْ عَبْدِ الْعَزِيزِ ابْنِ أَخِي حُذَيْفَةَ، ‏‏‏‏‏‏عَنْ حُذَيْفَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا حَزَبَهُ أَمْرٌ صَلَّى ."
      },
      {
        "id": 20400,
        "hadith_number": "1320",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Perkongsian Syurga dan Keutamaan Solat Sujud",
        "perawi_melayu": "Rabiah bin Kab al-Aslami",
        "english_text": "Narrated Rabiah bin Kab al-Aslami: I used to live with the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم at night. I would bring water for his ablution and his need. He asked: Ask me. I said: Your company in Paradise. He said: Is there anything other than that ? I said: It is only that. He said: Help yourself for Allah's sake by making prostrations abundantly.",
        "malay_translation": "Dikisahkan oleh Rabiah bin Kab al-Aslami: Aku sering tinggal bersama Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم pada waktu malam. Aku akan membawa air untuk wudhunya dan keperluan baginda. Baginda bertanya: \"Mintalah apa yang engkau mahu.\", aku berkata: \"Perkongsian syurga bersama Engkau.\" Baginda bertanya lagi: \"Adakah selain daripada itu?\" Aku menjawab: \"Tidak ada selain itu.\" Baginda bersabda: \"Mohonlah pertolongan daripada Allah dengan mengerjakan solat sujud dengan banyak.",
        "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا الْهِقْلُ بْنُ زِيَادٍ السَّكْسَكِيُّ، ‏‏‏‏‏‏حَدَّثَنَا الْأَوْزَاعِيُّ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ رَبِيعَةَ بْنَ كَعْبٍ الْأَسْلَمِيَّ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ كُنْتُ أَبِيتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ آتِيهِ بِوَضُوئِهِ وَبِحَاجَتِهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ سَلْنِي فَقُلْتُ:‏‏‏‏ مُرَافَقَتَكَ فِي الْجَنَّةِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَوَ غَيْرَ ذَلِكَ ؟ قُلْتُ:‏‏‏‏ هُوَ ذَاكَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَأَعِنِّي عَلَى نَفْسِكَ بِكَثْرَةِ السُّجُودِ ."
      },
      {
        "id": 20401,
        "hadith_number": "1321",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Amalan Berjaga dan Solat di Antara Maghrib dan Isyak",
        "perawi_melayu": "Anas bin Malik berkata",
        "english_text": "Anas bin Malik said (explaining the meaning of the Quranic verse Who forsake their beds to cry unto their Lord in fear and hope, and spend of what We have bestowed on them (32: 16). The people used to remain awake between the sunset and the night prayers and would pray. Al-Hasan used to say: (This verse means) the prayer and vigil at night.",
        "malay_translation": "Anas bin Malik berkata (menjelaskan maksud ayat al-Quran yang bermaksud: \"Lambung mereka jauh dari tempat tidur, sedang mereka berdoa kepada Tuhan mereka dengan rasa takut dan harap, dan mereka menafkahkan sebahagian dari rezki yang Kami berikan kepada mereka.\" (Surah As-Sajdah: 16). Orang ramai dahulu kala berjaga di antara solat Maghrib dan Isyak serta bersolat. Al-Hasan berkata: (Ayat ini bermaksud) solat dan qiamullail di waktu malam.",
        "arabic_text": "حَدَّثَنَا أَبُو كَامِلٍ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، ‏‏‏‏‏‏حَدَّثَنَا سَعِيدٌ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏فِي هَذِهِ الْآيَةِ:‏‏‏‏ تَتَجَافَى جُنُوبُهُمْ عَنِ الْمَضَاجِعِ يَدْعُونَ رَبَّهُمْ خَوْفًا وَطَمَعًا وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ سورة السجدة آية 16، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانُوا يَتَيَقَّظُونَ مَا بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ يُصَلُّونَ، ‏‏‏‏‏‏وَكَانَ الْحَسَنُ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ قِيَامُ اللَّيْلِ."
      },
      {
        "id": 20402,
        "hadith_number": "1322",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Sunat Antara Maghrib dan Isyak",
        "perawi_melayu": "Anas (RA)",
        "english_text": "Anas said (explaining the meaning) of the following Quranic verse They used to sleep but little of the night (51: 17): They (the people) used to pray between the Maghrib and 'Isha. The version of Yahya adds: The verse tatajafa junubuhum also means so.",
        "malay_translation": "Anas berkata (menjelaskan makna) ayat Al-Quran berikut: \"Mereka sedikit sekali tidur di waktu malam\" (51:17): Mereka (orang ramai) biasa bersolat antara Maghrib dan Isyak. Riwayat Yahya menambah: Ayat 'tatajafa junubuhum' juga bermakna demikian.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ‏‏‏‏‏‏وَابْنُ أَبِي عَدِيٍّ، ‏‏‏‏‏‏عَنْ سَعِيدٍ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏فِي قَوْلِهِ عَزَّ وَجَلَّ:‏‏‏‏ كَانُوا قَلِيلا مِنَ اللَّيْلِ مَا يَهْجَعُونَ سورة الذاريات آية 17، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانُوا يُصَلُّونَ فِيمَا بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ، ‏‏‏‏‏‏زَادَ فِي حَدِيثِ يَحْيَى:‏‏‏‏ وَكَذَلِكَ تَتَجَافَى جُنُوبُهُمْ سورة السجدة آية 16."
      },
      {
        "id": 20403,
        "hadith_number": "1323",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Malam: Mulakan dengan Dua Rakaat Ringan",
        "perawi_melayu": "Abu Hurairah (Semoga Allah meredhainya)",
        "english_text": "Narrated Abu Hurairah: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم as saying: When one of you gets up at night, he should begin the prayer with two short rak'ahs.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah (Semoga Allah meredhainya): Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: \"Apabila seseorang daripada kamu bangun pada waktu malam, hendaklah dia memulakan solat dengan dua rakaat yang ringan.\"",
        "arabic_text": "حَدَّثَنَا الرَّبِيعُ بْنُ نَافِعٍ أَبُو تَوْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا سُلَيْمَانُ بْنُ حَيَّانَ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ حَسَّانَ، ‏‏‏‏‏‏عَنْ ابْنِ سِيرِينَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا قَامَ أَحَدُكُمْ مِنَ اللَّيْلِ فَلْيُصَلِّ رَكْعَتَيْنِ خَفِيفَتَيْنِ ."
      },
      {
        "id": 20404,
        "hadith_number": "1324",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hadith Abu Hurairah Berkaitan Solat Sunat",
        "perawi_melayu": "Abu Hurairah (Semoga Allah merahmatinya)",
        "english_text": "This tradition has also been transmitted by Abu Hurairah through a different chain of narrators to the same effect. This version adds: He should then prolong it afterwards as much as he likes. Abu Dawud said: This tradition has been transmitted by Hammad bin Salamah, Zuhair bin Muawiyah and a group of narrators from Hisham. They transmitted it as a statement of Abu Hurairah himself (mauquf). This tradition has also been transmitted by Ibn 'Awn from Muhammad (b. Sirin). This version has the wordings: These two rak'ahs were short.",
        "malay_translation": "Hadith ini juga diriwayatkan oleh Abu Hurairah melalui rantai perawi yang berbeza dengan makna yang sama. Versi ini menambah: Kemudian dia hendaklah memanjangkannya selepas itu seberapa yang dia suka. Abu Dawud berkata: Hadith ini telah diriwayatkan oleh Hammad bin Salamah, Zuhair bin Muawiyah dan sekumpulan perawi daripada Hisham. Mereka meriwayatkannya sebagai ucapan Abu Hurairah sendiri (mauquf). Hadith ini juga telah diriwayatkan oleh Ibn 'Awn daripada Muhammad (b. Sirin). Versi ini mempunyai lafaz: Dua rakaat ini adalah pendek.",
        "arabic_text": "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ، ‏‏‏‏‏‏حَدَّثَنَا إِبْرَاهِيمُ يَعْنِي ابْنَ خَالِدٍ، ‏‏‏‏‏‏عَنْ رَبَاحِ بْنِ زَيْدٍ، ‏‏‏‏‏‏عَنْ مَعْمَرٍ، ‏‏‏‏‏‏عَنْ أَيُّوبَ، ‏‏‏‏‏‏عَنْ ابْنِ سِيرِينَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِذَا بِمَعْنَاهُ زَادَ، ‏‏‏‏‏‏ثُمَّ لِيُطَوِّلْ بَعْدُ مَا شَاءَ. قَالَ أَبُو دَاوُد:‏‏‏‏ رَوَى هَذَا الْحَدِيثَ حَمَّادُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏وَزُهَيْرُ بْنُ مُعَاوِيَةَ، ‏‏‏‏‏‏وَجَمَاعَة، ‏‏‏‏‏‏عَنْ هِشَامٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدٍ، ‏‏‏‏‏‏أَوْقَفُوهُ عَلَى أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَكَذَلِكَ رَوَاهُ أَيُّوبُ، ‏‏‏‏‏‏وَابْنُ عَوْنٍ أَوْقَفُوهُ عَلَى أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَرَوَاهُ ابْنُ عَوْنٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فِيهِمَا تَجَوُّزٌ."
      },
      {
        "id": 20405,
        "hadith_number": "1325",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Amalan Terbaik: Solat yang Lama",
        "perawi_melayu": "Abdullah ibn Habashi al-Khath'ami (رضي الله عنه)",
        "english_text": "Narrated Abdullah ibn Habashi al-Khath'ami: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم was asked: which is the best action? He replied: To stand in prayer for a long time.",
        "malay_translation": "Diriwayatkan daripada Abdullah ibn Habashi al-Khath'ami: Nabi صلى ‌اللہ ‌علیہ ‌وسلم ditanya: Apakah amalan yang terbaik? Baginda menjawab: Berdiri dalam solat untuk waktu yang lama.",
        "arabic_text": "حَدَّثَنَا ابْنُ حَنْبَلٍ يَعْنِي أَحْمَدَ، ‏‏‏‏‏‏حَدَّثَنَا حَجَّاجٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ ابْنُ جُرَيْجٍ، ‏‏‏‏‏‏أَخْبَرَنِي عُثْمَانُ بْنُ أَبِي سُلَيْمَانَ، ‏‏‏‏‏‏عَنْ عَلِيٍّ الْأَزْدِيِّ، ‏‏‏‏‏‏عَنْ عُبَيْدِ بْنِ عُمَيْرٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ حُبْشِيٍّ الْخَثْعَمِيِّ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ أَيُّ الْأَعْمَالِ أَفْضَلُ ؟ قَالَ:‏‏‏‏ طُولُ الْقِيَامِ ."
      },
      {
        "id": 20406,
        "hadith_number": "1326",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Malam: Solat Genap dan Witir",
        "perawi_melayu": "Abdullah bin Umar رضي الله عنه",
        "english_text": "Narrated Abdullah bin Umar: A man asked the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم about the prayer at night. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said: Prayer during the night should consist of pairs of rak'ahs, but if one of you fears the morning is near he should pray one rak'ah which will make his prayer an odd number for him.",
        "malay_translation": "Diriwayatkan daripada Abdullah bin Umar رضي الله عنه: Seorang lelaki bertanya kepada Rasulullah ﷺ tentang solat pada waktu malam. Rasulullah ﷺ bersabda: Solat pada waktu malam hendaklah dilakukan secara dua rakaat, dua rakaat. Jika salah seorang daripada kamu khuatir waktu Subuh akan tiba, hendaklah dia solat satu rakaat (witir) yang akan menjadikan solatnya bilangan ganjil.",
        "arabic_text": "حَدَّثَنَا الْقَعْنَبِيُّ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏وَعَبْدِ اللَّهِ بْنِ دِينَارٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، ‏‏‏‏‏‏أَنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَلَاةِ اللَّيْلِ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ صَلَاةُ اللَّيْلِ مَثْنَى مَثْنَى، ‏‏‏‏‏‏فَإِذَا خَشِيَ أَحَدُكُمُ الصُّبْحَ صَلَّى رَكْعَةً وَاحِدَةً تُوتِرُ لَهُ مَا قَدْ صَلَّى ."
      },
      {
        "id": 20407,
        "hadith_number": "1327",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Kadar Bacaan Nabi ﷺ",
        "perawi_melayu": "Abdullah ibn Abbas (رَضِيَ ٱللَّٰهُ عَنْهُ)",
        "english_text": "Narrated Abdullah ibn Abbas: The Prophet's صلی ‌اللہ ‌علیہ ‌وسلم recitation was loud enough for one who was in the inner chamber to hear it when he was in the house.",
        "malay_translation": "Diriwayatkan daripada Abdullah ibn Abbas (رَضِيَ ٱللَّٰهُ عَنْهُ): Bacaan Nabi ﷺ adalah cukup kuat untuk didengar oleh sesiapa yang berada di dalam bilik dalaman ketika baginda berada di rumah.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ الْوَرَكَانِيُّ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو مَوْلَى الْمُطَّلِبِ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنْابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَتْ قِرَاءَةُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى قَدْرِ مَا يَسْمَعُهُ مَنْ فِي الْحُجْرَةِ وَهُوَ فِي الْبَيْتِ ."
      },
      {
        "id": 20408,
        "hadith_number": "1328",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Cara Bacaan Rasulullah ﷺ di Waktu Malam",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "Narrated Abu Hurairah: The Prophet's صلی ‌اللہ ‌علیہ ‌وسلم recitation at night was partly in a loud voice and partly in a low voice. Abu Dawud said: The name of Abu Khalid al-Walibi is Hurmuz.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah: Bacaan Rasulullah ﷺ pada waktu malam adalah sebahagiannya dengan suara yang kuat dan sebahagiannya dengan suara yang perlahan. Abu Dawud berkata: Nama Abu Khalid al-Walibi ialah Hurmuz.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارِ بْنِ الرَّيَّانِ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، ‏‏‏‏‏‏عَنْ عِمْرَانَ بْنِ زَائِدَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أَبِي خَالِدٍ الْوَالِبِيِّ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنَّهُ قَالَ:‏‏‏‏ كَانَتْ قِرَاءَةُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِاللَّيْلِ يَرْفَعُ طَوْرًا وَيَخْفِضُ طَوْرًا . قَالَ أَبُو دَاوُد:‏‏‏‏ أَبُو خَالِدٍ الْوَالِبِيُّ اسْمُهُ هُرْمُزُ."
      },
      {
        "id": 20409,
        "hadith_number": "1329",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Ketetapan Doa dan Tahapan Sembahyang Nabi SAW",
        "perawi_melayu": "Abu Qatadah",
        "english_text": "Narrated Abu Qatadah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم went out at night and found Abu Bakr praying in a low voice, and he passed Umar ibn al-Khattab who was raising his voice while praying. When they both met the Prophet صلی ‌اللہ ‌علیہ ‌وسلم together, the Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: I passed by you, Abu Bakr, when you were praying in a low voice. He replied: I made Him hear with Whom I was holding intimate converse, Messenger of Allah. He (the Prophet) said to Umar: I passed by you when you were praying in a loud voice. He replied: Messenger of Allah, I was awakening the drowsy and driving away the Devil. Al-Hasan added in his version: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Raise your voice a little, Abu Bakr, and he said to Umar: Lower your voice a little.",
        "malay_translation": "Diceritakan oleh Abu Qatadah: Nabi صلی ‌اللہ ‌علیہ ‌وسلم keluar pada waktu malam dan mendapati Abu Bakar sedang bersembahyang dengan suara perlahan, dan beliau melewati Umar ibn al-Khattab yang sedang meninggikan suaranya ketika bersembahyang.  Ketika mereka berdua bertemu dengan Nabi صلی ‌اللہ ‌علیہ ‌وسلم, Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda: \"Aku melewati kamu, wahai Abu Bakar, ketika kamu bersembahyang dengan suara perlahan.\" Dia menjawab: \"Aku hanya ingin Allah SWT mendengar doaku, Rasulullah.\"  Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda kepada Umar: \"Aku melewati kamu ketika kamu bersembahyang dengan suara nyaring.\" Dia menjawab: \"Wahai Rasulullah, aku berusaha membangunkan yang mengantuk dan mengusir syaitan.\"  Al-Hasan menambahkan dalam riwayatnya: Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda: \"Tinggikan sedikit suaramu, wahai Abu Bakar,\" dan beliau bersabda kepada Umar: \"Rendahkan sedikit suaramu.\" ",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادٌ، ‏‏‏‏‏‏عَنْ ثَابِتٍ الْبُنَانِيِّ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. ح وحَدَّثَنَا الْحَسَنُ بْنُ الصَّبَّاحِ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ، ‏‏‏‏‏‏أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏عَنْ ثَابِتٍ الْبُنَانِيِّ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ، ‏‏‏‏‏‏عَنْ أَبِي قَتَادَةَ، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ لَيْلَةً فَإِذَا هُوَ بِأَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ يُصَلِّي يَخْفِضُ مِنْ صَوْتِهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَمَرَّ بِعُمَرَ بْنِ الْخَطَّابِ وَهُوَ يُصَلِّي رَافِعًا صَوْتَهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَلَمَّا اجْتَمَعَا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ يَا أَبَا بَكْرٍ مَرَرْتُ بِكَ وَأَنْتَ تُصَلِّي تَخْفِضُ صَوْتَكَ قَالَ:‏‏‏‏ قَدْ أَسْمَعْتُ مَنْ نَاجَيْتُ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَقَالَ لِعُمَرَ:‏‏‏‏ مَرَرْتُ بِكَ وَأَنْتَ تُصَلِّي رَافِعًا صَوْتَكَ قَالَ:‏‏‏‏ فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏أُوقِظُ الْوَسْنَانَ، ‏‏‏‏‏‏وَأَطْرُدُ الشَّيْطَانَ. زَادَ الْحَسَنُ فِي حَدِيثِهِ:‏‏‏‏ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَا أَبَا بَكْرٍ ارْفَعْ مِنْ صَوْتِكَ شَيْئًا ، ‏‏‏‏‏‏وَقَالَ لِعُمَرَ:‏‏‏‏ اخْفِضْ مِنْ صَوْتِكَ شَيْئًا ."
      },
      {
        "id": 20410,
        "hadith_number": "1330",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Ucapan Bilal Semasa Membaca Al-Quran",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "This tradition has also been transmitted by Abu Hurairah through a different chain of narrators. This version dies not mention that the Prophet صلی ‌اللہ ‌علیہ ‌وسلم said to Abu Bakr: Raise your voice a litte ; or he said to Umar: Lower your voice a little. But this version adds: (The Prophet said: ) I heard you, Bilal, (reciting) ; you were reciting partly from this surah and partly from that surah. He said: This is all good speech ; Allah has combined one part with the other; The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: All of you were correct.",
        "malay_translation": "Hadith ini juga telah diriwayatkan oleh Abu Hurairah melalui rangkaian perawi yang berbeza. Riwayat ini tidak menyebut bahawa Nabi ﷺ berkata kepada Abu Bakar: 'Tinggikan sedikit suara kamu'; atau baginda berkata kepada Umar: 'Rendahkan sedikit suara kamu'. Tetapi riwayat ini menambah: (Nabi bersabda:) 'Aku telah mendengar kamu, Bilal, (membaca); kamu membaca sebahagian daripada surah ini dan sebahagian daripada surah itu.' Baginda bersabda: 'Ini adalah ucapan yang baik; Allah telah menggabungkan sebahagiannya dengan sebahagian yang lain; Nabi ﷺ bersabda: Kamu semua adalah betul.",
        "arabic_text": "حَدَّثَنَا أَبُو حُصَيْنِ بْنُ يَحْيَى الرَّازِيُّ، ‏‏‏‏‏‏حَدَّثَنَا أَسْبَاطُ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ عَمْرٍو، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏بِهَذِهِ الْقِصَّةِ، ‏‏‏‏‏‏لَمْ يَذْكُرْ:‏‏‏‏ فَقَالَ لِأَبِي بَكْرٍ:‏‏‏‏ ارْفَعْ مِنْ صَوْتِكَ شَيْئًا، ‏‏‏‏‏‏وَلِعُمَرَ:‏‏‏‏ اخْفِضْ شَيْئًا، ‏‏‏‏‏‏زَادَ:‏‏‏‏ وَقَدْ سَمِعْتُكَ يَا بِلَالُ وَأَنْتَ تَقْرَأُ مِنْ هَذِهِ السُّورَةِ، ‏‏‏‏‏‏وَمِنْ هَذِهِ السُّورَةِ قَالَ:‏‏‏‏ كَلَامٌ طَيِّبٌ يَجْمَعُ اللَّهُ تَعَالَى بَعْضَهُ إِلَى بَعْضٍ، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ كُلُّكُمْ قَدْ أَصَابَ ."
      },
      {
        "id": 20411,
        "hadith_number": "1331",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hadis Mengenai Mengingatkan Ayat-ayat Al-Quran yang Dilupa",
        "perawi_melayu": "Aishah",
        "english_text": "Narrated Aishah: A man got up at night and recited the Quran in a loud voice. When the dawn came, the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said: May Allah have mercy on so-and-so who reminded me many verses that I had nearly forgotten. Abu Dawud said: Harun al-Nahwi transmitted from Hammad bin Salamah the Quranic verse of Surah Al-Imran: How many of the prophet fought (in Allah's way) (3: 146)",
        "malay_translation": "Diceritakan oleh Aishah: Seorang lelaki bangun pada waktu malam dan membacakan Al-Quran dengan suara lantang. Ketika fajar tiba, Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Semoga Allah merahmati orang itu yang telah mengingatkan aku banyak ayat yang hampir aku lupakan. Abu Dawud berkata: Harun al-Nahwi meriwayatkan dari Hammad bin Salamah ayat suci Al-Quran dari Surah Al-Imran: Berapa banyak dari para Nabi yang telah berperang di jalan Allah (3: 146).",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادٌ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، ‏‏‏‏‏‏أَنَّ رَجُلًا قَامَ مِنَ اللَّيْلِ فَقَرَأَ فَرَفَعَ صَوْتَهُ بِالْقُرْآنِ، ‏‏‏‏‏‏فَلَمَّا أَصْبَحَ، ‏‏‏‏‏‏قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَرْحَمُ اللَّهُ فُلَانًا، ‏‏‏‏‏‏كَأَيِّنْ مِنْ آيَةٍ أَذْكَرَنِيهَا اللَّيْلَةَ كُنْتُ قَدْ أَسْقَطْتُهَا . قَالَ أَبُو دَاوُد:‏‏‏‏ رَوَاهُ هَارُونُ النَّحْوِيُّ، ‏‏‏‏‏‏عَنْ حَمَّادِ بْنِ سَلَمَةَ فِي سُورَةِ آلِ عِمْرَانَ فِي الْحُرُوفِ وَكَأَيِّنْ مِنْ نَبِيٍّ سورة آل عمران آية 146."
      },
      {
        "id": 20412,
        "hadith_number": "1332",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Menghormati dan Menjaga Kesunyian dalam Ibadah",
        "perawi_melayu": "Abu Sa'id al-Khudri",
        "english_text": "Narrated Abu Saeed al-Khudri: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم retired to the mosque. He heard them (the people) reciting the Quran in a loud voice. He removed the curtain and said: Lo! every one of you is calling his Lord quietly. One should not trouble the other and one should not raise the voice in recitation or in prayer over the voice of the other.",
        "malay_translation": "Dikisahkan oleh Abu Sa'id al-Khudri: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersara ke masjid. Baginda mendengar mereka (orang ramai) membaca Al-Quran dengan suara yang lantang. Baginda menanggalkan tirai dan bersabda: Sesungguhnya setiap kamu sedang bermunajat kepada Tuhannya dengan suara perlahan. Janganlah mengganggu satu sama lain dan janganlah meninggikan suara ketika membaca Al-Quran atau bersembahyang melebihi suara orang lain.",
        "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَخْبَرَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ اعْتَكَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ فَسَمِعَهُمْ يَجْهَرُونَ بِالْقِرَاءَةِ فَكَشَفَ السِّتْرَ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ أَلَا إِنَّ كُلَّكُمْ مُنَاجٍ رَبَّهُ فَلَا يُؤْذِيَنَّ بَعْضُكُمْ بَعْضًا، ‏‏‏‏‏‏وَلَا يَرْفَعْ بَعْضُكُمْ عَلَى بَعْضٍ فِي الْقِرَاءَةِ، ‏‏‏‏‏‏أَوْ قَالَ:‏‏‏‏ فِي الصَّلَاةِ ."
      },
      {
        "id": 20413,
        "hadith_number": "1333",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Membaca Al-Quran dengan Nyaring dan Senyap",
        "perawi_melayu": "Uqbah ibn Amir al-Juhani",
        "english_text": "Narrated Uqbah ibn Amir al-Juhani: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: One who recites the Quran in a loud voice is like one who gives alms openly; and one who recites the Quran quietly is one who gives alms secretly.",
        "malay_translation": "Diceritakan oleh Uqbah ibn Amir al-Juhani: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda, \"Sesiapa yang membaca Al-Quran dengan suara yang lantang, maka ia seperti orang yang memberi sedekah secara terang-terangan; dan sesiapa yang membaca Al-Quran dengan perlahan, maka ia seperti orang yang memberi sedekah secara rahsia.\"",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، ‏‏‏‏‏‏عَنْ بَحِيرِ بْنِ سَعْدٍ، ‏‏‏‏‏‏عَنْ خَالِدِ بْنِ مَعْدَانَ، ‏‏‏‏‏‏عَنْ كَثِيرِ بْنِ مُرَّةَ الْحَضْرَمِيِّ، ‏‏‏‏‏‏عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْجَاهِرُ بِالْقُرْآنِ كَالْجَاهِرِ بِالصَّدَقَةِ، ‏‏‏‏‏‏وَالْمُسِرُّ بِالْقُرْآنِ كَالْمُسِرِّ بِالصَّدَقَةِ ."
      },
      {
        "id": 20414,
        "hadith_number": "1334",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Malam Rasulullah SAW dan Solat Witir",
        "perawi_melayu": "Aishah (رَضِيَ اللَّهُ عَنْهَا)",
        "english_text": "Narrated Aishah: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم used to pray ten rak'ahs during the night, and would observe the witr with one rak'ah, he then prayed two rak'ahs of the dawn prayer. Thus he prayed thirteen rak'ahs in all.",
        "malay_translation": "Diriwayatkan daripada Aishah (رَضِيَ اللَّهُ عَنْهَا): Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersolat sepuluh rakaat pada waktu malam, dan baginda melakukan solat witir dengan satu rakaat, kemudian baginda bersolat dua rakaat solat fajar. Maka, jumlah keseluruhan solat baginda adalah tiga belas rakaat.",
        "arabic_text": "حَدَّثَنَا ابْنُ الْمُثَنَّى، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، ‏‏‏‏‏‏عَنْ حَنْظَلَةَ، ‏‏‏‏‏‏عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مِنَ اللَّيْلِ عَشْرَ رَكَعَاتٍ، ‏‏‏‏‏‏وَيُوتِرُ بِسَجْدَةٍ، ‏‏‏‏‏‏وَيَسْجُدُ سَجْدَتَيِ الْفَجْرِ، ‏‏‏‏‏‏فَذَلِكَ ثَلَاثَ عَشْرَةَ رَكْعَةً ."
      },
      {
        "id": 20415,
        "hadith_number": "1335",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Malam Nabi SAW dan Witr",
        "perawi_melayu": "Aishah, isteri Nabi صلی ‌اللہ ‌علیہ ‌وسلم",
        "english_text": "Narrated Aishah, wife of Prophet صلی ‌اللہ ‌علیہ ‌وسلم: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم used to pray eleven rak'ahs (at night, observing the witr with one rak'ahs). When he finished it (the prayer), he would lie down on his right side.",
        "malay_translation": "Diriwayatkan daripada Aishah, isteri Nabi صلی ‌اللہ ‌علیہ ‌وسلم: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم biasa solat sebelas rakaat (pada waktu malam, melakukan witr dengan satu rakaat). Apabila baginda selesai (solat), baginda berbaring mengiring ke sebelah kanan.",
        "arabic_text": "حَدَّثَنَا الْقَعْنَبِيُّ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ ابْنِ شِهَابٍ، ‏‏‏‏‏‏عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي مِنَ اللَّيْلِ إِحْدَى عَشْرَةَ رَكْعَةً يُوتِرُ مِنْهَا بِوَاحِدَةٍ، ‏‏‏‏‏‏فَإِذَا فَرَغَ مِنْهَا اضْطَجَعَ عَلَى شِقِّهِ الْأَيْمَنِ ."
      },
      {
        "id": 20416,
        "hadith_number": "1336",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Malam Rasulullah ﷺ dan Tidur Selepas Solat Fajar",
        "perawi_melayu": "Aishah رضي الله عنها",
        "english_text": "Narrated Aishah: Between the time when the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم finished the night prayer till the dawn broke, he used to pray eleven rak'ahs, uttering the salutation at the end of every two and observing the witr with a single one, and during that he would make a prostration about as long a one of you would take to recite fifty verses before raising his head. When the muadhdhin finished making the call for the dawn prayer, he stood up and prayed two short rak'ahs, then he lay down on his right side till the muadhdhin came to him",
        "malay_translation": "Diriwayatkan daripada Aishah رضي الله عنها: Antara waktu Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم selesai solat malam hingga terbit fajar, Baginda biasa mengerjakan solat sebelas rakaat, memberi salam pada setiap dua rakaat dan solat witir satu rakaat. Dalam solat tersebut, sujud Baginda memakan masa hampir sama dengan seseorang yang membaca lima puluh ayat sebelum mengangkat kepalanya. Apabila muadzin selesai melaungkan azan solat fajar, Baginda bangun dan menunaikan solat sunat dua rakaat yang ringan, kemudian Baginda berbaring mengiring di sebelah kanan sehingga muadzin datang kepada Baginda.",
        "arabic_text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏وَنَصْرُ بْنُ عَاصِمٍ، ‏‏‏‏‏‏وَهَذَا لَفْظُهُ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا الْوَلِيدُ، ‏‏‏‏‏‏حَدَّثَنَا الْأَوْزَاعِيُّ، ‏‏‏‏‏‏وَقَالَ نَصْرٌ، ‏‏‏‏‏‏عَنْ ابْنِ أَبِي ذِئْبٍ، ‏‏‏‏‏‏وَالْأَوْزَاعِيُّ، ‏‏‏‏‏‏عَنْ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِيمَا بَيْنَ أَنْ يَفْرُغَ مِنْ صَلَاةِ الْعِشَاءِ إِلَى أَنْ يَنْصَدِعَ الْفَجْرُ إِحْدَى عَشْرَةَ رَكْعَةً يُسَلِّمُ مِنْ كُلِّ ثِنْتَيْنِ وَيُوتِرُ بِوَاحِدَةٍ وَيَمْكُثُ فِي سُجُودِهِ قَدْرَ مَا يَقْرَأُ أَحَدُكُمْ خَمْسِينَ آيَةً قَبْلَ أَنْ يَرْفَعَ رَأْسَهُ، ‏‏‏‏‏‏فَإِذَا سَكَتَ الْمُؤَذِّنُ بِالْأُولَى مِنْ صَلَاةِ الْفَجْرِ قَامَ فَرَكَعَ رَكْعَتَيْنِ خَفِيفَتَيْنِ، ‏‏‏‏‏‏ثُمَّ اضْطَجَعَ عَلَى شِقِّهِ الْأَيْمَنِ حَتَّى يَأْتِيَهُ الْمُؤَذِّنُ ."
      },
      {
        "id": 20417,
        "hadith_number": "1337",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Witir dengan Satu Rakaat dan Sujud Panjang",
        "perawi_melayu": "Ibnu Shihab (melalui rantaian perawi yang berbeza)",
        "english_text": "This tradition has been transmitted by Ibn Shihab through a different chain of narrators to the same effect. This version adds: He would observe witr with a single rak'ah and make a prostration as long as you would take to recite fifty verses before raising his head. When the muadhdhin finished his call for the dawn prayer and the dawn became clear to him. . . . Then the narrator transmitted the rest of the tradition to the same effect. Some narrators added something more in their version.",
        "malay_translation": "Hadis ini telah diriwayatkan oleh Ibnu Shihab melalui satu rantaian perawi yang berbeza dengan maksud yang sama. Versi ini menambah: Baginda akan menunaikan solat witir dengan satu rakaat dan melakukan sujud selama mana seseorang itu mengambil masa untuk membaca lima puluh ayat sebelum mengangkat kepalanya. Apabila muadzin selesai melaungkan azan Subuh dan fajar menjadi jelas baginya. . . . Kemudian perawi meriwayatkan baki hadis dengan maksud yang sama. Sesetengah perawi menambah sesuatu dalam versi mereka.",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏أَخْبَرَنِي ابْنُ أَبِي ذِئْبٍ، ‏‏‏‏‏‏وَعَمْرُو بْنُ الْحَارِثِ، ‏‏‏‏‏‏وَيُونُسُ بْنُ يَزِيدَ، ‏‏‏‏‏‏أَنَّ ابْنَ شِهَابٍ أَخْبَرَهُمْ بِإِسْنَادِهِ وَمَعْنَاهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَيُوتِرُ بِوَاحِدَةٍ وَيَسْجُدُ سَجْدَةً قَدْرَ مَا يَقْرَأُ أَحَدُكُمْ خَمْسِينَ آيَةً قَبْلَ أَنْ يَرْفَعَ رَأْسَهُ فَإِذَا سَكَتَ الْمُؤَذِّنُ مِنْ صَلَاةِ الْفَجْرِ وَتَبَيَّنَ لَهُ الْفَجْرُ، ‏‏‏‏‏‏وَسَاقَ مَعْنَاهُ قَالَ:‏‏‏‏ وَبَعْضُهُمْ يَزِيدُ عَلَى بَعْضٍ."
      },
      {
        "id": 20418,
        "hadith_number": "1338",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Malam Rasulullah SAW: 13 Rakaat dengan Witir 5",
        "perawi_melayu": "Aisyah RA",
        "english_text": "Narrated Aishah: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم used to pray thirteen rak'ahs during the night, observing a witr out of that with five, he did not sit during the five except the last and then gave the salutation. Abu Dawud said: Ibn Numair reported it from Hisham recently.",
        "malay_translation": "Diriwayatkan daripada Aisyah RA: Rasulullah SAW biasa menunaikan solat malam sebanyak tiga belas rakaat, dengan witir daripada jumlah itu sebanyak lima rakaat. Baginda tidak duduk (untuk tasyahud) dalam lima rakaat tersebut kecuali pada rakaat terakhir, kemudian memberi salam. Abu Dawud berkata: Ibn Numair meriwayatkan daripada Hisham seperti itu.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، ‏‏‏‏‏‏حَدَّثَنَا وُهَيْبٌ، ‏‏‏‏‏‏حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مِنَ اللَّيْلِ ثَلَاثَ عَشْرَةَ رَكْعَةً يُوتِرُ مِنْهَا بِخَمْسٍ لَا يَجْلِسُ فِي شَيْءٍ مِنَ الْخَمْسِ حَتَّى يَجْلِسَ فِي الْآخِرَةِ فَيُسَلِّمُ . قَالَ أَبُو دَاوُد:‏‏‏‏ رَوَاهُ ابْنُ نُمَيْرٍ، عَنْ هِشَامٍ نَحْوَهُ."
      },
      {
        "id": 20419,
        "hadith_number": "1339",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Malam Rasulullah ﷺ dan Dua Rakaat Fajar",
        "perawi_melayu": "Aishah (radiallahu 'anha)",
        "english_text": "Narrated Aishah: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم used to pray thirteen rak'ahs during the night ; he then offered two light rak'ahs of prayer when he heard the call to the dawn prayer.",
        "malay_translation": "Diriwayatkan daripada Aishah: Rasulullah ﷺ biasa solat tiga belas rakaat pada waktu malam; kemudian baginda menunaikan dua rakaat solat yang ringan apabila mendengar azan subuh.",
        "arabic_text": "حَدَّثَنَا الْقَعْنَبِيُّ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِاللَّيْلِ ثَلَاثَ عَشْرَةَ رَكْعَةً، ‏‏‏‏‏‏ثُمَّ يُصَلِّي إِذَا سَمِعَ النِّدَاءَ بِالصُّبْحِ رَكْعَتَيْنِ خَفِيفَتَيْنِ ."
      },
      {
        "id": 20420,
        "hadith_number": "1340",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Bilangan Rakaat Solat Malam Nabi ﷺ",
        "perawi_melayu": "Aishah (رَضِيَ اللَّهُ عَنْهَا)",
        "english_text": "Narrated Aishah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم used to pray thirteen rak'ahs during the night. He would offer eight rak'ahs observing the witr with one rak'ah. Then he prayed (the narrator Muslim said) two rak'ahs after witr prayer in sitting position. When he wished to bow, he stood up and bowed. He used to pray two rak'ahs between the call to the dawn prayer and the iqamah.",
        "malay_translation": "Daripada Aishah (رَضِيَ اللَّهُ عَنْهَا) berkata: Nabi ﷺ biasa solat sebanyak tiga belas rakaat pada waktu malam. Baginda mengerjakan solat lapan rakaat dan berwitir dengan satu rakaat. Kemudian baginda solat (perawi Muslim berkata) dua rakaat selepas solat witir dalam keadaan duduk. Apabila baginda ingin rukuk, baginda berdiri dan rukuk. Baginda juga biasa solat dua rakaat di antara azan Subuh dan iqamah.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، ‏‏‏‏‏‏وَمُسْلِمُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا أَبَانُ، ‏‏‏‏‏‏عَنْ يَحْيَى، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي مِنَ اللَّيْلِ ثَلَاثَ عَشْرَةَ رَكْعَةً كَانَ يُصَلِّي ثَمَانِيَ رَكَعَاتٍ وَيُوتِرُ بِرَكْعَةٍ، ‏‏‏‏‏‏ثُمَّ يُصَلِّي، ‏‏‏‏‏‏قَالَ مُسْلِمٌ:‏‏‏‏ بَعْدَ الْوِتْرِ، ‏‏‏‏‏‏ثُمَّ اتَّفَقَا رَكْعَتَيْنِ وَهُوَ قَاعِدٌ، ‏‏‏‏‏‏فَإِذَا أَرَادَ أَنْ يَرْكَعَ قَامَ فَرَكَعَ، ‏‏‏‏‏‏وَيُصَلِّي بَيْنَ أَذَانِ الْفَجْرِ وَالْإِقَامَةِ رَكْعَتَيْنِ ."
      },
      {
        "id": 20421,
        "hadith_number": "1341",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Rasulullah SAW di Bulan Ramadhan",
        "perawi_melayu": "Abu Salamah bin Abdur-Rahman",
        "english_text": "Abu Salamah bin Abdur-Rahman asked Aishah, the wife of the Prophet صلی ‌اللہ ‌علیہ ‌وسلم: How did the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم pray during Ramadhan ? She said: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم did not pray more than eleven rak'ahs during Ramadhan and other than Ramadhan. He would pray four rak'ahs. Do not ask about their elegance and length. He then would pray for rak'ahs. Do not ask about their alegance and length. Then he would pray three rak'ahs. Aishah said: I asked: Messenger of Allah, do you sleep before observing witr ? He replied: Aishah, my eyes sleep, but my heart does not sleep.",
        "malay_translation": "Abu Salamah bin Abdur-Rahman bertanya kepada Aishah, isteri Nabi صلی ‌اللہ ‌علیہ ‌وسلم: \"Bagaimanakah solat Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم di bulan Ramadhan?\" Aishah menjawab: \"Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم tidak pernah solat lebih daripada sebelas rakaat sama ada di bulan Ramadhan atau di bulan lain. Baginda solat empat rakaat. Janganlah bertanya tentang keindahan dan kepanjangan solatnya itu. Kemudian baginda solat empat rakaat lagi. Janganlah bertanya tentang keindahan dan kepanjangan solatnya itu. Kemudian baginda solat tiga rakaat.\" Aishah berkata: \"Saya bertanya: 'Wahai Rasulullah, adakah anda tidur sebelum solat witir?' Baginda menjawab: 'Wahai Aishah, mataku tidur, tetapi hatiku tidak tidur.'",
        "arabic_text": "حَدَّثَنَا الْقَعْنَبِيُّ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏أَنَّهُ أَخْبَرَهُ، ‏‏‏‏‏‏أَنَّهُ سَأَلَعَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ كَيْفَ كَانَتْ صَلَاةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَمَضَانَ ؟ فَقَالَتْ:‏‏‏‏ مَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَزِيدُ فِي رَمَضَانَ وَلَا فِي غَيْرِهِ عَلَى إِحْدَى عَشْرَةَ رَكْعَةً يُصَلِّي أَرْبَعًا فَلَا تَسْأَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ، ‏‏‏‏‏‏ثُمَّ يُصَلِّي أَرْبَعًا فَلَا تَسْأَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ، ‏‏‏‏‏‏ثُمَّ يُصَلِّي ثَلَاثًا . قَالَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا:‏‏‏‏ فَقُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏أَتَنَامُ قَبْلَ أَنْ تُوتِرَ ؟ قَالَ:‏‏‏‏ يَا عَائِشَةُ إِنَّ عَيْنَيَّ تَنَامَانِ وَلَا يَنَامُ قَلْبِي ."
      },
      {
        "id": 20422,
        "hadith_number": "1342",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulaiman bin al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Cara Solat Witir Nabi SAW dan Sunah-sunah Lain",
        "perawi_melayu": "Sa'ad bin Hisham",
        "english_text": "Narrated Saad bin Hisham: I divorced my wife. I then came to Madina to sell my land that was there so that I could buy arms and fight in battle. I met a group of the Companions of the Prophet صلی ‌اللہ ‌علیہ ‌وسلم. They said: Six persons of us intended to do so (i. e. divorce their wives and purchase weapons), but the Prophet صلی ‌اللہ ‌علیہ ‌وسلم prohibited them. He said: For you in the Messenger of Allah there is an excellent model. I then came to Ibn Abbas and asked him about the witr observed by the Prophet صلی ‌اللہ ‌علیہ ‌وسلم. He said: I point to you a person who is most familiar with the witr observed by the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم. Go to Aishah. While going to her I asked Hakim bin Aflah to accompany me. He refused, but I adjured him. He, therefore, went along with me. We sought permission to enter upon Aishah. She said: Who is this ? He said: Hakim bin Aflah. She asked: Who is with you ? He replied: Saad bin Hisham. She said: Hisham son of Amir who was killed in the Battle of Uhud. I said: Yes. She said: What a good man Amir was! I said: Mother of faithful, tell me about the character of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم. She asked: Do you not recite the Quran ? The character of Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم was the Quran. I asked: Tell me about his vigil and prayer at night. She replied: Do you not recite: O thou folded in garments (73: 1). I said: Why not ? When the opening of this Surah was revealed, the Companions stood praying (most of the night) until their fett swelled, and the concluding verses were not revealed for twelve months from heaven. At last the concluding verses were revealed and the prayer at night became voluntary after it was obligatory. I said: Tell me about the witr of the Prophet صلی ‌اللہ ‌علیہ ‌وسلم. She replied: He used to pray eight rak'ahs, sitting only during the eighth of them. Then he would stand up and pray another rak'ahs. He would sit only after the eighth and the ninth rak'ahs. He would utter salutation only after the ninth rak'ah. He would then pray two rak'ahs sitting and that made eleven rak'ahs, O my son. But when he grew old and became fleshy he observed a witr of seven, sitting only in sixth and seventh rak'ahs, and would utter salutation only after the seventh rak'ah. He would then pray two rak'ahs sitting, and that made nine rak'ahs, O my son. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم would not pray through a whole night, or recite the whole Quran in a night or fast a complete month except in Ramadan. When he offered prayer, he would do that regularly. When he was overtaken by sleep at night, he would pray twelve rak'ahs. The narrator said: I came to Ibn Abbas and narrated all this to him. By Allah, this is really a tradition. Has I been on speaking terms with her, I would have come to her and heard it from her mouth. I said: If I knew that you were not on speaking terms with her, I would have never narrated it to you.",
        "malay_translation": "Dikisahkan oleh Sa'ad bin Hisham: Aku telah menceraikan isteriku. Kemudian aku pergi ke Madinah untuk menjual tanahku di sana agar aku dapat membeli senjata dan berjuang dalam peperangan. Aku bertemu sekumpulan sahabat Nabi صلی ‌اللہ ‌علیہ ‌وسلم. Mereka berkata: Enam orang di antara kami berniat melakukan demikian (iaitu menceraikan isteri dan membeli senjata), tetapi Nabi صلی ‌اللہ ‌علیہ ‌وسلم melarang mereka. Baginya, di dalam diri Rasulullah SAW ada teladan yang unggul. Kemudian aku menemui Ibnu Abbas dan bertanya kepadanya tentang solat witir yang diamalkan oleh Nabi صلی ‌اللہ ‌علیہ ‌وسلم. Beliau menjawab: Aku tunjukkan kepadamu seseorang yang sangat mahir dengan solat witir Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم. Pergilah kepada Aisyah. Ketika menuju ke arahnya, aku meminta Hakim bin Aflah untuk menemani aku. Beliau menolak, tetapi aku memohonnya dengan sungguh-sungguh. Oleh itu, beliau turut serta bersamaku. Kami memohon izin untuk masuk bertemu Aisyah. Beliau bertanya: Siapakah ini? Beliau menjawab: Hakim bin Aflah. Aisyah bertanya lagi: Siapakah yang bersamamu? Beliau menjawab: Sa'ad bin Hisham. Aisyah berkata: Hisyam anak Amir yang terbunuh dalam Perang Uhud. Aku berkata: Betul. Aisyah berkata: Sungguh seorang yang baik Amir itu! Aku berkata: Wahai Ibu orang-orang yang beriman, ceritakanlah kepadaku tentang akhlak Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم. Aisyah bertanya: Bukankah engkau membaca Al-Quran? Akhlak Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم adalah Al-Quran itu sendiri. Aku bertanya: Ceritakanlah kepadaku tentang amalan solat dan qiyamullail baginya. Aisyah menjawab: Bukankah engkau membaca: “Hai orang yang berselimut” (73:1)? Aku berkata: Ya. Ketika awal surah ini diturunkan, para sahabat berdiri beribadah (sepanjang malam) sehingga kaki mereka bengkak, dan ayat-ayat penutup surah tidak diturunkan selama dua belas bulan dari langit. Akhirnya, ayat-ayat penutup diturunkan dan amalan solat malam menjadi sunat setelah menjadi wajib. Aku bertanya: Ceritakan tentang witir Nabi صلی ‌اللہ ‌علیہ ‌وسلم. Aisyah menjawab: Baginda biasa mengerjakan solat witir sebanyak lapan rakaat, duduk hanya pada rakaat yang kelapan. Kemudian berdiri untuk solat satu rakaat lagi. Kemudian duduk pada rakaat kelapan dan kesembilan. Salam hanya diakhir rakaat kesembilan. Selepas itu solat dua rakaat sambil duduk, menjadikan keseluruhannya sebelas rakaat, wahai anakku. Namun, apabila baginda telah tua dan gemuk, beliau mengerjakan solat witir sebanyak tujuh rakaat, duduk pada rakaat keenam dan ketujuh, dan salam hanya diakhir rakaat ketujuh. Kemudian solat dua rakaat sambil duduk, menjadi sembilan rakaat, wahai anakku. Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم tidak mengerjakan solat sepanjang malam, tidak membaca seluruh Al-Quran dalam satu malam, dan tidak berpuasa sepanjang bulan kecuali pada bulan Ramadan. Apabila baginda mengerjakan solat, baginda melakukannya secara tetap. Apabila baginda ditimpa tidur pada waktu malam, baginda akan solat dua belas rakaat. Perawi berkata: Aku mendatangi Ibnu Abbas dan menceritakan semua ini kepadanya. Demi Allah, ini memang suatu hadis yang sahih. Jika aku berhubung baik dengannya, aku pasti datang kepadanya dan mendengarnya dari mulutnya sendiri. Aku berkata: Sekiranya aku tahu engkau tidak berhubung baik dengannya, aku tidak akan menceritakannya kepadamu.",
        "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، ‏‏‏‏‏‏حَدَّثَنَا هَمَّامٌ، ‏‏‏‏‏‏حَدَّثَنَا قَتَادَةُ، ‏‏‏‏‏‏عَنْ زُرَارَةَ بْنِ أَوْفَى، ‏‏‏‏‏‏عَنْ سَعْدِ بْنِ هِشَامٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ طَلَّقْتُ امْرَأَتِي، ‏‏‏‏‏‏فَأَتَيْتُ الْمَدِينَةَ لِأَبِيعَ عَقَارًا كَانَ لِي بِهَا فَأَشْتَرِيَ بِهِ السِّلَاحَ وَأَغْزُو، ‏‏‏‏‏‏فَلَقِيتُ نَفَرًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالُوا:‏‏‏‏ قَدْ أَرَادَ نَفَرٌ مِنَّا سِتَّةٌ أَنْ يَفْعَلُوا ذَلِكَ فَنَهَاهُمُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ ، ‏‏‏‏‏‏فَأَتَيْتُ ابْنَ عَبَّاسٍ فَسَأَلْتُهُ عَنْ وِتْرِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَدُلُّكَ عَلَى أَعْلَمِ النَّاسِ بِوِتْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَأْتِ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، ‏‏‏‏‏‏فَأَتَيْتُهَا، ‏‏‏‏‏‏فَاسْتَتْبَعْتُ حَكِيمَ بْنَ أَفْلَحَ، ‏‏‏‏‏‏فَأَبَى، ‏‏‏‏‏‏فَنَاشَدْتُهُ، ‏‏‏‏‏‏فَانْطَلَقَ مَعِي، ‏‏‏‏‏‏فَاسْتَأْذَنَّا عَلَى عَائِشَةَ، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ مَنْ هَذَا ؟ قَالَ:‏‏‏‏ حَكِيمُ بْنُ أَفْلَحَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ وَمَنْ مَعَكَ ؟ قَالَ:‏‏‏‏ سَعْدُ بْنُ هِشَامٍ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ هِشَامُ بْنُ عَامِرٍ الَّذِي قُتِلَ يَوْمَ أُحُدٍ ؟ قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ نِعْمَ الْمَرْءُ كَانَ عَامِرٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا أُمَّ الْمُؤْمِنِينَ، ‏‏‏‏‏‏حَدِّثِينِي عَنْ خُلُقِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ أَلَسْتَ تَقْرَأُ الْقُرْآنَ ؟ فَإِنَّ خُلُقَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ الْقُرْآنَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ حَدِّثِينِي عَنْ قِيَامِ اللَّيْلِ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ أَلَسْتَ تَقْرَأُ يَأَيُّهَا الْمُزَّمِّلُ ؟ قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ بَلَى، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ فَإِنَّ أَوَّلَ هَذِهِ السُّورَةِ نَزَلَتْ فَقَامَ أَصْحَابُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى انْتَفَخَتْ أَقْدَامُهُمْ، ‏‏‏‏‏‏وَحُبِسَ خَاتِمَتُهَا فِي السَّمَاءِ اثْنَيْ عَشَرَ شَهْرًا، ‏‏‏‏‏‏ثُمَّ نَزَلَ آخِرُهَا فَصَارَ قِيَامُ اللَّيْلِ تَطَوُّعًا بَعْدَ فَرِيضَةٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ حَدِّثِينِي عَنْ وِتْرِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَ يُوتِرُ بِثَمَانِ رَكَعَاتٍ لَا يَجْلِسُ إِلَّا فِي الثَّامِنَةِ، ‏‏‏‏‏‏ثُمَّ يَقُومُ فَيُصَلِّي رَكْعَةً أُخْرَى لَا يَجْلِسُ إِلَّا فِي الثَّامِنَةِ وَالتَّاسِعَةِ، ‏‏‏‏‏‏وَلَا يُسَلِّمُ إِلَّا فِي التَّاسِعَةِ، ‏‏‏‏‏‏ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ، ‏‏‏‏‏‏فَتِلْكَ إِحْدَى عَشْرَةَ رَكْعَةً يَا بُنَيَّ، ‏‏‏‏‏‏فَلَمَّا أَسَنَّ وَأَخَذَ اللَّحْمَ أَوْتَرَ بِسَبْعِ رَكَعَاتٍ لَمْ يَجْلِسْ إِلَّا فِي السَّادِسَةِ وَالسَّابِعَةِ، ‏‏‏‏‏‏وَلَمْ يُسَلِّمْ إِلَّا فِي السَّابِعَةِ، ‏‏‏‏‏‏ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ فَتِلْكَ هِيَ تِسْعُ رَكَعَاتٍ يَا بُنَيَّ، ‏‏‏‏‏‏وَلَمْ يَقُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةً يُتِمُّهَا إِلَى الصَّبَاحِ، ‏‏‏‏‏‏وَلَمْ يَقْرَأْ الْقُرْآنَ فِي لَيْلَةٍ قَطُّ وَلَمْ يَصُمْ شَهْرًا يُتِمُّهُ غَيْرَ رَمَضَانَ، ‏‏‏‏‏‏وَكَانَ إِذَا صَلَّى صَلَاةً دَاوَمَ عَلَيْهَا، ‏‏‏‏‏‏وَكَانَ إِذَا غَلَبَتْهُ عَيْنَاهُ مِنَ اللَّيْلِ بِنَوْمٍ صَلَّى مِنَ النَّهَارِ ثِنْتَيْ عَشْرَةَ رَكْعَةً قَالَ:‏‏‏‏ فَأَتَيْتُ ابْنَ عَبَّاسٍ فَحَدَّثْتُهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ هَذَا وَاللَّهِ هُوَ الْحَدِيثُ، ‏‏‏‏‏‏وَلَوْ كُنْتُ أُكَلِّمُهَا لَأَتَيْتُهَا حَتَّى أُشَافِهَهَا بِهِ مُشَافَهَةً، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ لَوْ عَلِمْتُ أَنَّكَ لَا تُكَلِّمُهَا مَا حَدَّثْتُكَ."
      },
      {
        "id": 20423,
        "hadith_number": "1343",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Sunnah Rasulullah SAW Mengenai Solat Witr",
        "perawi_melayu": "Qatadah",
        "english_text": "The above mentioned tradition has also been narrated by Qatadah through a different chain of narrators. This version adds: He (the Prophet ( used to pray eight rak'ahs during which he did not sit except the eight rak'ahs. He would sit, make mention of Allah, supplicate Him and then utter the salutation so loudly that we could hear it. He would then pray two rak'ahs sitting after he had uttered the salutation. Then he would pray one rak'ah, and that made eleven rak'ahs, O my son. When the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم grew old and became fleshy, he offered seven rak'ahs of witr, and then he would pray two rak'ahs sitting after he had uttered the salutation. The narrator narrated the tradition to the same effect till the end.",
        "malay_translation": "Hadis yang disebutkan di atas juga diriwayatkan oleh Qatadah melalui rangkaian perawi yang berbeza. Versi ini menambah: Baginda (Nabi SAW) biasa menunaikan solat sebanyak lapan rakaat, di mana Baginda tidak duduk melainkan pada lapan rakaat itu. Baginda akan duduk, menyebut nama Allah, berdoa kepada-Nya, dan kemudian mengucapkan salam dengan kuat sehingga kami dapat mendengarnya. Kemudian Baginda akan menunaikan dua rakaat sambil duduk selepas mengucapkan salam. Kemudian Baginda akan menunaikan satu rakaat lagi, menjadikan jumlahnya sebelas rakaat, wahai anakku.  Apabila Rasulullah SAW sudah tua dan bertambah berisi, Baginda menunaikan solat tujuh rakaat witir, dan kemudian dua rakaat sambil duduk selepas mengucapkan salam. Perawi meriwayatkan hadis ini dengan maksud yang sama hingga akhir.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ‏‏‏‏‏‏عَنْ سَعِيدٍ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏بِإِسْنَادِهِ نَحْوَهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ يُصَلِّي ثَمَانِيَ رَكَعَاتٍ لَا يَجْلِسُ فِيهِنَّ إِلَّا عِنْدَ الثَّامِنَةِ فَيَجْلِسُ فَيَذْكُرُ اللَّهَ عَزَّ وَجَلَّ، ‏‏‏‏‏‏ثُمَّ يَدْعُو، ‏‏‏‏‏‏ثُمَّ يُسَلِّمُ تَسْلِيمًا يُسْمِعُنَا، ‏‏‏‏‏‏ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ بَعْدَ مَا يُسَلِّمُ، ‏‏‏‏‏‏ثُمَّ يُصَلِّي رَكْعَةً فَتِلْكَ إِحْدَى عَشْرَةَ رَكْعَةً يَا بُنَيَّ، ‏‏‏‏‏‏فَلَمَّا أَسَنَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَخَذَ اللَّحْمَ أَوْتَرَ بِسَبْعٍ وَصَلَّى رَكْعَتَيْنِ وَهُوَ جَالِسٌ بَعْدَ مَا يُسَلِّمُ، ‏‏‏‏‏‏بِمَعْنَاهُ إِلَى مُشَافَهَةً ."
      },
      {
        "id": 20424,
        "hadith_number": "1344",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Kenyaringan Salam dalam Riwayat",
        "perawi_melayu": "Yahya bin Saeed (melalui jalur periwayatan yang sama, dengan tambahan)",
        "english_text": "The above tradition has also been transmitted by Yahya bin Saeed to the same effect. The version adds the words: He uttered the salutation so loudly that we could hear it.",
        "malay_translation": "Hadis di atas juga diriwayatkan oleh Yahya bin Saeed dengan makna yang sama. Riwayat ini menambah perkataan: Baginda mengucapkan salam dengan suara yang begitu kuat sehingga kami dapat mendengarnya.",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، ‏‏‏‏‏‏حَدَّثَنَا سَعِيدٌ بِهَذَا الْحَدِيثِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ يُسَلِّمُ تَسْلِيمًا يُسْمِعُنَا كَمَا قَالَ يَحْيَى بْنُ سَعِيدٍ."
      },
      {
        "id": 20425,
        "hadith_number": "1345",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Riwayat Tambahan tentang Salam Nabi SAW",
        "perawi_melayu": "Saeed (melalui sanad berbeza)",
        "english_text": "This tradition has also been transmitted by Saeed through a different chain of narrators to the same effect. Ibn Bashshar narrated the tradition like that of Yahya bin Saeed. His version has: He uttered the salutation in a way that we could hear it.",
        "malay_translation": "Hadis ini juga telah diriwayatkan oleh Saeed melalui satu rantaian perawi yang berbeza dengan makna yang sama. Ibn Bashshar meriwayatkan hadis seperti riwayat Yahya bin Saeed. Versinya menyebut: Baginda mengucapkan salam dengan cara yang kami dapat mendengarnya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، ‏‏‏‏‏‏عَنْ سَعِيدٍ، ‏‏‏‏‏‏بِهَذَا الْحَدِيثِ، ‏‏‏‏‏‏قَالَ ابْنُ بَشَّارٍ:‏‏‏‏ بِنَحْوِ حَدِيثِ يَحْيَى بْنِ سَعِيدٍ، ‏‏‏‏‏‏إِلَّا أَنَّهُ قَالَ:‏‏‏‏ وَيُسَلِّمُ تَسْلِيمَةً يُسْمِعُنَا ."
      },
      {
        "id": 20426,
        "hadith_number": "1346",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Cara Rasulullah SAW Menjalankan Solat Malam",
        "perawi_melayu": "Aishah رضي الله عنها",
        "english_text": "Narrated Aishah, Ummul Muminin: Zurarah ibn Awfa said that Aishah was asked about the midnight prayer of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم. She said: He used to offer his night prayer in congregation and then return to his family (in his house) and pray four rak'ahs. Then he would go to his bed and sleep, but the water for his ablution was placed covered near his head and his tooth-stick was also kept there until Allah awakened him at night. He then used the tooth-stick, performed ablution perfectly then came to the place of prayer and would pray eight rak'ahs, in which he would recite Surah al-Fatihah, and a surah from the Quran as Allah willed. He would not sit during any of them but sit after the eighth rak'ah, and would not utter the salutation, but recite (the Quran) during the ninth rak'ah. Then he would sit and supplicate as long as Allah willed, and beg Him and devote his attention to Him; He would utter the salutation once in such a loud voice that the inmates of the house were almost awakened by his loud salutation. He would then recite Surah al-Fatihah while sitting, bow while sitting, and then recite the Quran during the second rak'ah, and would bow and prostrate while sitting. He would supplicate Allah as long as He willed, then utter the salutation and turn away. This amount of prayer of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم continued till he put a weight. During that period he retrenched two rak'ahs from nine and began to pray six and seven rak'ahs standing and two rak'ahs sitting. This continued till he died.",
        "malay_translation": "Diceritakan oleh Aisyah رضي الله عنها: Zurarah bin Awfa berkata bahawa Aisyah ditanya tentang solat malam Rasulullah SAW. Baginda biasanya menunaikan solat malam secara berjemaah, kemudian pulang ke rumahnya dan menunaikan empat rakaat solat. Selepas itu, Baginda akan tidur, tetapi air wudhunya diletakkan berhampiran kepalanya dan miswak diletakkan di situ sehingga Allah SWT membangunkannya pada waktu malam. Kemudian Baginda menggunakan miswak, berwuduk dengan sempurna, dan pergi ke tempat solat serta menunaikan lapan rakaat solat.  Dalam setiap rakaat, Baginda membaca Surah al-Fatihah dan surah-surah dari Al-Quran mengikut kehendak Allah SWT. Baginda tidak duduk dalam solat tersebut kecuali selepas rakaat kelapan, dan tidak mengucapkan salam, tetapi terus membaca Al-Quran di rakaat kesembilan.  Kemudian Baginda duduk berdoa selama yang dikehendaki Allah, memohon rahmat dan tumpuan-Nya. Baginda mengucapkan salam dengan kuat sekali, hampir membangunkan penghuni rumah. Baginda kemudian membaca Surah al-Fatihah sambil duduk, rukuk sambil duduk, dan kemudian membaca Al-Quran di rakaat kedua, dan rukuk serta sujud sambil duduk. Baginda berdoa kepada Allah SWT selama yang dikehendaki-Nya, kemudian mengucapkan salam dan berpaling.  Solat Baginda SAW seperti ini berterusan sehingga beratnya solat itu  mengalami penurunan.  Dalam tempoh ini, Baginda mengurangkan dua rakaat daripada sembilan dan mula menunaikan enam atau tujuh rakaat dalam keadaan berdiri dan dua rakaat dalam keadaan duduk. Keadaan ini berterusan sehingga Baginda wafat.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ حُسَيْنٍ الدِّرْهَمِيُّ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، ‏‏‏‏‏‏عَنْ بَهْزِ بْنِ حَكِيمٍ، ‏‏‏‏‏‏حَدَّثَنَا زُرَارَةُ بْنُ أَوْفَى، ‏‏‏‏‏‏أَنَّ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا سُئِلَتْ عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَوْفِ اللَّيْلِ، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ كَانَ يُصَلِّي الْعِشَاءَ فِي جَمَاعَةٍ، ‏‏‏‏‏‏ثُمَّ يَرْجِعُ إِلَى أَهْلِهِ فَيَرْكَعُ أَرْبَعَ رَكَعَاتٍ، ‏‏‏‏‏‏ثُمَّ يَأْوِي إِلَى فِرَاشِهِ وَيَنَامُ وَطَهُورُهُ مُغَطًّى عِنْدَ رَأْسِهِ وَسِوَاكُهُ مَوْضُوعٌ حَتَّى يَبْعَثَهُ اللَّهُ سَاعَتَهُ الَّتِي يَبْعَثُهُ مِنَ اللَّيْلِ فَيَتَسَوَّكُ وَيُسْبِغُ الْوُضُوءَ، ‏‏‏‏‏‏ثُمَّ يَقُومُ إِلَى مُصَلَّاهُ فَيُصَلِّي ثَمَانِيَ رَكَعَاتٍ يَقْرَأُ فِيهِنَّ بِأُمِّ الْكِتَابِ وَسُورَةٍ مِنَ الْقُرْآنِ وَمَا شَاءَ اللَّهُ وَلَا يَقْعُدُ فِي شَيْءٍ مِنْهَا حَتَّى يَقْعُدَ فِي الثَّامِنَةِ، ‏‏‏‏‏‏وَلَا يُسَلِّمُ وَيَقْرَأُ فِي التَّاسِعَةِ، ‏‏‏‏‏‏ثُمَّ يَقْعُدُ فَيَدْعُو بِمَا شَاءَ اللَّهُ أَنْ يَدْعُوَهُ وَيَسْأَلَهُ وَيَرْغَبَ إِلَيْهِ وَيُسَلِّمُ تَسْلِيمَةً وَاحِدَةً شَدِيدَةً يَكَادُ يُوقِظُ أَهْلَ الْبَيْتِ مِنْ شِدَّةِ تَسْلِيمِهِ، ‏‏‏‏‏‏ثُمَّ يَقْرَأُ وَهُوَ قَاعِدٌ بِأُمِّ الْكِتَابِ وَيَرْكَعُ وَهُوَ قَاعِدٌ، ‏‏‏‏‏‏ثُمَّ يَقْرَأُ الثَّانِيَةَ فَيَرْكَعُ وَيَسْجُدُ وَهُوَ قَاعِدٌ، ‏‏‏‏‏‏ثُمَّ يَدْعُو مَا شَاءَ اللَّهُ أَنْ يَدْعُوَ، ‏‏‏‏‏‏ثُمَّ يُسَلِّمُ وَيَنْصَرِفُ، ‏‏‏‏‏‏فَلَمْ تَزَلْ تِلْكَ صَلَاةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى بَدَّنَ فَنَقَّصَ مِنَ التِّسْعِ ثِنْتَيْنِ فَجَعَلَهَا إِلَى السِّتِّ وَالسَّبْعِ وَرَكْعَتَيْهِ وَهُوَ قَاعِدٌ حَتَّى قُبِضَ عَلَى ذَلِكَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ."
      },
      {
        "id": 20427,
        "hadith_number": "1347",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Cara Solat Malam Nabi (SAW)",
        "perawi_melayu": "Banu al-Hakim (melalui rangkaian perawi yang berbeza)",
        "english_text": "The above-mentioned tradition has also been narrated by Banu al-Hakim through a different chain of narrators. This version adds: He (the Prophet) would offer the night prayer and go to his bed. In this version there is no mention of praying four rak'ahs. The narrator then transmitted the rest of the tradition. This version further says: He would pray eight rak'ahs during which his recitation of the Quran, bowing and prostration were all equal. He would sit only after the eight rak'ah, and then stand up without uttering the salutation, and pray one rak'ah observing witr prayer and then give the salutation raising his voice so much so that we were about to awake. The narrator then transmitted the tradition to the same effect.",
        "malay_translation": "Hadis di atas juga diriwayatkan oleh Banu al-Hakim melalui rantaian perawi yang berbeza. Versi ini menambah: Baginda (Nabi) akan menunaikan solat malam dan pergi ke tempat tidurnya. Dalam versi ini, tiada disebut tentang solat empat rakaat. Perawi kemudian meriwayatkan selebihnya hadis tersebut. Versi ini selanjutnya menyatakan: Baginda akan menunaikan solat lapan rakaat di mana bacaan al-Quran, rukuk, dan sujud adalah sama. Baginda hanya akan duduk selepas lapan rakaat, dan kemudian berdiri tanpa memberi salam, dan menunaikan satu rakaat dengan menunaikan solat witir dan kemudian memberi salam dengan meninggikan suaranya sehingga kami hampir terjaga. Perawi kemudian meriwayatkan hadis itu dengan maksud yang sama.",
        "arabic_text": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، ‏‏‏‏‏‏أَخْبَرَنَا بَهْزُ بْنُ حَكِيمٍ، ‏‏‏‏‏‏فَذَكَرَ هَذَا الْحَدِيثَ بِإِسْنَادِهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ يُصَلِّي الْعِشَاءَ ثُمَّ يَأْوِي إِلَى فِرَاشِهِ، ‏‏‏‏‏‏لَمْ يَذْكُرِ الْأَرْبَعَ رَكَعَاتٍ، ‏‏‏‏‏‏وَسَاقَ الْحَدِيثَ، ‏‏‏‏‏‏وَقَالَ فِيهِ:‏‏‏‏ فَيُصَلِّي ثَمَانِيَ رَكَعَاتٍ يُسَوِّي بَيْنَهُنَّ فِي الْقِرَاءَةِ وَالرُّكُوعِ وَالسُّجُودِ وَلَا يَجْلِسُ فِي شَيْءٍ مِنْهُنَّ إِلَّا فِي الثَّامِنَةِ فَإِنَّهُ كَانَ يَجْلِسُ، ‏‏‏‏‏‏ثُمَّ يَقُومُ وَلَا يُسَلِّمُ فِيهِ فَيُصَلِّي رَكْعَةً يُوتِرُ بِهَا، ‏‏‏‏‏‏ثُمَّ يُسَلِّمُ تَسْلِيمَةً يَرْفَعُ بِهَا صَوْتَهُ حَتَّى يُوقِظَنَا، ‏‏‏‏‏‏ثُمَّ سَاقَ مَعْنَاهُ ."
      },
      {
        "id": 20428,
        "hadith_number": "1348",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Isyak Nabi SAW dan Solat Malam Aishah RA",
        "perawi_melayu": "Zurarah bin Awfa",
        "english_text": "Zurarah bin Awfa said that Aishah was asked about the prayer of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم. She said: He used to lead the people in the 'Isha prayer and return to his family and pray four rak'ahs and go to his bed. The narrator then transmitted the tradition in full. This version does not mention the words: During them (the rak'ahs) he equated all the recitation of the Quran, bowing and recitation. This also does not mention the words about the salutation: Till he almost awakened us.",
        "malay_translation": "Zurarah bin Awfa berkata bahawa Aishah RA ditanya tentang solat Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم. Beliau berkata: Baginda memimpin solat Isyak bersama jemaah, kemudian kembali ke keluarganya dan menunaikan solat empat rakaat, lalu berbaring di tempat tidurnya. Perawi kemudiannya meriwayatkan hadis tersebut secara penuh. Riwayat ini tidak menyebut: Semasa (rakaat-rakaat) tersebut, baginda menyamaratakan bacaan al-Quran, rukuk, dan bacaan. Ia juga tidak menyebut tentang salam: Sehingga baginda hampir-hampir membangunkan kami.",
        "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ عُثْمَانَ، ‏‏‏‏‏‏حَدَّثَنَا مَرْوَانُ يَعْنِي ابْنَ مُعَاوِيَةَ، ‏‏‏‏‏‏عَنْ بَهْزٍ، ‏‏‏‏‏‏حَدَّثَنَا زُرَارَةُ بْنُ أَوْفَى، ‏‏‏‏‏‏عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، ‏‏‏‏‏‏أَنَّهَا سُئِلَتْ عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ كَانَ يُصَلِّي بِالنَّاسِ الْعِشَاءَ، ‏‏‏‏‏‏ثُمَّ يَرْجِعُ إِلَى أَهْلِهِ فَيُصَلِّي أَرْبَعًا، ‏‏‏‏‏‏ثُمَّ يَأْوِي إِلَى فِرَاشِهِ، ‏‏‏‏‏‏ثُمَّ سَاقَ الْحَدِيثَ بِطُولِهِ، ‏‏‏‏‏‏وَلَمْ يَذْكُرْ يُسَوِّي بَيْنَهُنَّ فِي الْقِرَاءَةِ وَالرُّكُوعِ وَالسُّجُودِ، ‏‏‏‏‏‏وَلَمْ يَذْكُرْ فِي التَّسْلِيمِ حَتَّى يُوقِظَنَا ."
      },
      {
        "id": 20429,
        "hadith_number": "1349",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hadis Berbeza Rangkaian Perawi dan Kesahihannya",
        "perawi_melayu": null,
        "english_text": "This tradition has also been transmitted by Aishah through a different chain of narrators. But the tradition narrated by Hammad bin Salamah is not equal to the tradition narrated by others.",
        "malay_translation": "Hadis ini juga telah disampaikan oleh Aisyah melalui rangkaian perawi yang berbeza. Namun, hadis yang diriwayatkan oleh Hammad bin Salamah bukanlah setara dengan hadis yang diriwayatkan oleh yang lain.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ، ‏‏‏‏‏‏عَنْ بَهْزِ بْنِ حَكِيمٍ، ‏‏‏‏‏‏عَنْ زُرَارَةَ بْنِ أَوْفَى، ‏‏‏‏‏‏عَنْ سَعْدِ بْنِ هِشَامٍ، ‏‏‏‏‏‏عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، ‏‏‏‏‏‏بِهَذَا الْحَدِيثِ، ‏‏‏‏‏‏وَلَيْسَ فِي تَمَامِ حَدِيثِهِمْ."
      },
      {
        "id": 20430,
        "hadith_number": "1350",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Malam Rasulullah SAW dan Solat Witir",
        "perawi_melayu": "Aishah (رَضِيَ اللَّهُ عَنْهَا)",
        "english_text": "Narrated Aishah: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم used to pray thirteen rak'ahs during the night, observing the witr prayer with nine (or as she said). He used to pray two rak'ahs while sitting and pray two rak'ahs of the dawn prayer between the adhan and the iqamah.",
        "malay_translation": "Diriwayatkan daripada Aishah: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم biasa menunaikan solat malam sebanyak tiga belas rakaat, dan menunaikan solat witir dengan sembilan rakaat (atau seperti yang beliau katakan). Baginda biasa menunaikan solat dua rakaat dalam keadaan duduk dan menunaikan solat sunat fajar dua rakaat di antara azan dan iqamah.",
        "arabic_text": "حَدَّثَنَا مُوسَى يَعْنِي ابْنَ إِسْمَاعِيلَ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ عَمْرٍو، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي مِنَ اللَّيْلِ ثَلَاثَ عَشْرَةَ رَكْعَةً يُوتِرُ بِتِسْعٍ، ‏‏‏‏‏‏أَوْ كَمَا قَالَتْ:‏‏‏‏ وَيُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ وَرَكْعَتَيِ الْفَجْرِ بَيْنَ الْأَذَانِ وَالْإِقَامَةِ ."
      },
      {
        "id": 20431,
        "hadith_number": "1351",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Cara Nabi SAW Mengerjakan Solat Witir",
        "perawi_melayu": "Aishah (RA)",
        "english_text": "Narrated Aishah: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم used to observe the witr prayer with nine rak'ahs. Then he used to pray seven rak'ahs (of witr prayer). He would pray two rak'ahs sitting after the witr in which he would recite the Quran (sitting). When he wished to bow, he stood up and bowed and prostrated. Abu Dawud said: These two traditions have been transmitted by Khalid bin Abdullah al-Wasiti. In his version he said: Alqamah bin Waqqas said: O mother, how did he pray the two rak'ahs ? He narrated the rest of the tradition to the same effect.",
        "malay_translation": "Diriwayatkan daripada Aishah (RA): Rasulullah SAW pernah mengerjakan solat witir sebanyak sembilan rakaat. Kemudian, baginda mengerjakan solat witir tujuh rakaat. Baginda juga pernah mengerjakan dua rakaat dalam keadaan duduk selepas witir dengan membaca Al-Quran. Apabila baginda ingin rukuk, baginda berdiri dan rukuk serta sujud. Abu Dawud berkata: Dua riwayat ini telah diriwayatkan oleh Khalid bin Abdullah al-Wasiti. Dalam riwayatnya, beliau berkata: Alqamah bin Waqqas berkata: Wahai ibu, bagaimanakah baginda mengerjakan dua rakaat tersebut? Beliau meriwayatkan baki hadis tersebut dengan makna yang sama.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادٌ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ عَمْرٍو، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ عَلْقَمَةَ بْنِ وَقَّاصٍ، ‏‏‏‏‏‏عَنْعَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُوتِرُ بِتِسْعِ رَكَعَاتٍ، ‏‏‏‏‏‏ثُمَّ أَوْتَرَ بِسَبْعِ رَكَعَاتٍ وَرَكَعَ رَكْعَتَيْنِ وَهُوَ جَالِسٌ بَعْدَ الْوِتْرِ يَقْرَأُ فِيهِمَا، ‏‏‏‏‏‏فَإِذَا أَرَادَ أَنْ يَرْكَعَ قَامَ فَرَكَعَ، ‏‏‏‏‏‏ثُمَّ سَجَدَ . قَالَ أَبُو دَاوُد:‏‏‏‏ رَوَى هَذينِ الْحَدِيثَيْنِ خَالِدُ بْنُ عَبْدِ اللَّهِ الْوَاسِطِيُّ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ عَمْرٍو مِثْلَهُ، ‏‏‏‏‏‏قَالَ فِيهِ:‏‏‏‏ قَالَ عَلْقَمَةُ بْنُ وَقَّاصٍ:‏‏‏‏ يَا أُمَّتَاهُ، ‏‏‏‏‏‏كَيْفَ كَانَ يُصَلِّي الرَّكْعَتَيْنِ ؟ فَذَكَرَ مَعْنَاهُ."
      },
      {
        "id": 20432,
        "hadith_number": "1352",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Cara Rasulullah SAW Menunaikan Solat Malam",
        "perawi_melayu": "Aishah binti Abu Bakar as-Siddiq r.a.",
        "english_text": "Narrated Aishah, Ummul Muminin: Saad ibn Hisham said: I came to Madina and called upon Aishah, and said to her: Tell me about the prayer of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم. She said: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم used to lead the people in the night prayer, and then go to his bed and sleep. When midnight came he got up, went to answer the call of nature and to perform ablution with water. Having performed ablution, he entered the mosque and prayed eight rak'ahs. To my mind he performed the recitation of the Quran, bowing and prostrating equally. He then observed witr with one rak'ah and prayed two rak'ahs sitting. Then he lay down on the ground. Sometimes Bilal came to him and called him for prayer. He then dozed, and sometimes I doubted whether he dozed or not, till he (Bilal) called him for prayer. This is the prayer he offered till he grew old or put on weight. She then mentioned how he put on weight as Allah wished.",
        "malay_translation": "Diceritakan oleh Aishah, Ummul Mukminin: Saad bin Hisham berkata, \"Saya datang ke Madinah dan menemui Aishah, lalu bertanya kepadanya tentang solat Rasulullah SAW. Beliau menjawab, \"Rasulullah SAW biasanya memimpin solat malam, kemudian berehat di atas katilnya. Apabila waktu tengah malam tiba, baginda bangun, membuang air kecil, dan melakukan wuduk dengan air. Setelah berwuduk, baginda masuk ke masjid dan menunaikan lapan rakaat solat. Seingat saya, baginda membaca Al-Quran, rukuk dan sujud secara seimbang. Kemudian, baginda mengerjakan solat witir satu rakaat dan dua rakaat solat duduk. Selepas itu, baginda berbaring di atas lantai. Kadang-kadang Bilal datang dan mengimamkan baginda solat. Baginda lantas mengantuk, dan kadang-kadang saya ragu-ragu sama ada baginda mengantuk atau tidak sehingga Bilal mengimamkan baginda solat. Begitulah cara baginda menunaikan solat sehingga baginda semakin tua atau bertambah berat badan. Beliau kemudian menyebut bagaimana baginda bertambah berat badannya sebagaimana kehendak Allah SWT.\"",
        "arabic_text": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ، ‏‏‏‏‏‏عَنْ خَالِدٍ، ‏‏‏‏‏‏وحَدَّثَنَا ابْنُ الْمُثَنَّى، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْأَعْلَى، ‏‏‏‏‏‏حَدَّثَنَا هِشَامٌ،‏‏‏‏عَنْ الْحَسَنِ، ‏‏‏‏‏‏عَنْ سَعْدِ بْنِ هِشَامٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَدِمْتُ الْمَدِينَةَ فَدَخَلْتُ عَلَى عَائِشَةَ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ أَخْبِرِينِي عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي بِالنَّاسِ صَلَاةَ الْعِشَاءِ، ‏‏‏‏‏‏ثُمَّ يَأْوِي إِلَى فِرَاشِهِ فَيَنَامُ، ‏‏‏‏‏‏فَإِذَا كَانَ جَوْفُ اللَّيْلِ قَامَ إِلَى حَاجَتِهِ وَإِلَى طَهُورِهِ فَتَوَضَّأَ، ‏‏‏‏‏‏ثُمَّ دَخَلَ الْمَسْجِدَ فَصَلَّى ثَمَانِيَ رَكَعَاتٍ، ‏‏‏‏‏‏يُخَيَّلُ إِلَيَّ أَنَّهُ يُسَوِّي بَيْنَهُنَّ فِي الْقِرَاءَةِ وَالرُّكُوعِ وَالسُّجُودِ، ‏‏‏‏‏‏ثُمَّ يُوتِرُ بِرَكْعَةٍ، ‏‏‏‏‏‏ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ، ‏‏‏‏‏‏ثُمَّ يَضَعُ جَنْبَهُ، ‏‏‏‏‏‏فَرُبَّمَا جَاءَ بِلَالٌ فَآذَنَهُ بِالصَّلَاةِ، ‏‏‏‏‏‏ثُمَّ يُغْفِي، ‏‏‏‏‏‏وَرُبَّمَا شَكَكْتُ أَغْفَى أَوْ لَا، ‏‏‏‏‏‏حَتَّى يُؤْذِنَهُ بِالصَّلَاةِ فَكَانَتْ تِلْكَ صَلَاتُهُ حَتَّى أَسَنَّ لَحُمَ ، ‏‏‏‏‏‏فَذَكَرَتْ مِنْ لَحْمِهِ مَا شَاءَ اللَّهُ، ‏‏‏‏‏‏وَسَاقَ الْحَدِيثَ"
      },
      {
        "id": 20433,
        "hadith_number": "1353",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulaiman bin al-Ash'ath al-Sijistani",
        "tajuk_hadith": "Sunnah Nabi SAW: Cara Solat dan Perbuatan Sebelum Solat",
        "perawi_melayu": "Abdullah bin Abbas",
        "english_text": "Abdullah bin Abbas said that he slept with the Prophet صلی ‌اللہ ‌علیہ ‌وسلم. He saw that he (the Prophet) awoke, used tooth-stick, performed ablution, and recited: In the creation of the heavens and earth [3: 190] to the end of the surah. Then he stood up and prayed two rak'ahs in which he prolonged the standing, bowing, and prostrations. He then uttered turned away and slept till he bagan to snore. This he did three times. This made six rak'ahs in all. He would use tooth-stick, then perform ablution, and recite those verses. He then observed the witr prayer. The version of Uthman has: with three rak'ahs. The muadhdhin then came to him and he went out for prayer. The version of Ibn 'Isa adds: He then observed witr prayer ; then Bilal came to him and called him for prayer when the dawn broke. He then prayed the two rak'ahs of the dawn prayer. He then went out for prayer. Then both the narrators were agreed: He beagan to supplicate saying: O Allah, place light in my heart, light in my tongue, light in my hearing, light in my eyesight, light on my right hand, light on my left hand, light in front of me, light behing me, light below me, O Allah, give me abundant light.",
        "malay_translation": "Abdullah bin Abbas meriwayatkan bahawa beliau tidur bersama Nabi صلی ‌اللہ ‌علیہ ‌وسلم. Beliau menyaksikan baginda terjaga, mengguna siwak, mandi hadas, dan membaca surah Al-Imran [ayat 190] hingga akhir surah. Kemudian baginda berdiri dan solat dua rakaat dengan memanjangkan rukuk dan sujud. Selepas itu baginda berpaling dan tidur hingga tersedar.  Begitulah yang baginda lakukan tiga kali. Ini berjumlah enam rakaat keseluruhannya. Baginda akan menggunakan siwak, kemudian mandi hadas, dan membaca ayat-ayat tersebut. Kemudian baginda solat witir. Versi Uthman menyebut: dengan tiga rakaat. Kemudian muazzin datang kepada baginda dan baginda keluar untuk solat. Versi Ibn 'Isa menambah: Kemudian baginda solat witir; kemudian Bilal datang dan menyeru baginda untuk solat ketika subuh menjelang. Kemudian baginda solat dua rakaat solat subuh. Kemudian baginda keluar untuk solat. Kedua-dua perawi bersetuju bahawa baginda berdoa: Ya Allah, limpahkan cahaya ke dalam hatiku, cahaya ke lidahku, cahaya ke pendengaranku, cahaya ke penglihatanku, cahaya ke tanganku kanan, cahaya ke tanganku kiri, cahaya di hadapan dan di belakangku, cahaya di bawahku, Ya Allah, limpahkanlah cahaya yang melimpah kepadaku.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، ‏‏‏‏‏‏حَدَّثَنَا هُشَيْمٌ، ‏‏‏‏‏‏أَخْبَرَنَا حُصَيْنٌ، ‏‏‏‏‏‏عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ. ح وحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، ‏‏‏‏‏‏عَنْ حُصَيْنٍ، ‏‏‏‏‏‏عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏أَنَّهُ رَقَدَ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَآهُ اسْتَيْقَظَ فَتَسَوَّكَ وَتَوَضَّأَ، ‏‏‏‏‏‏وَهُوَ يَقُولُ:‏‏‏‏ إِنَّ فِي خَلْقِ السَّمَوَاتِ وَالأَرْضِ سورة البقرة آية 164 حَتَّى خَتَمَ السُّورَةَ، ‏‏‏‏‏‏ثُمَّ قَامَ فَصَلَّى رَكْعَتَيْنِ أَطَالَ فِيهِمَا الْقِيَامَ وَالرُّكُوعَ وَالسُّجُودَ، ‏‏‏‏‏‏ثُمَّ انْصَرَفَ فَنَامَ حَتَّى نَفَخَ، ‏‏‏‏‏‏ثُمَّ فَعَلَ ذَلِكَ ثَلَاثَ مَرَّاتٍ بِسِتِّ رَكَعَاتٍ، ‏‏‏‏‏‏كُلُّ ذَلِكَ يَسْتَاكُ، ‏‏‏‏‏‏ثُمَّ يَتَوَضَّأُ وَيَقْرَأُ هَؤُلَاءِ الْآيَاتِ، ‏‏‏‏‏‏ثُمَّ أَوْتَرَ . قَالَ عُثْمَانُ:‏‏‏‏ بِثَلَاثِ رَكَعَاتٍ فَأَتَاهُ الْمُؤَذِّنُ فَخَرَجَ إِلَى الصَّلَاةِ ، ‏‏‏‏‏‏وَقَالَ ابْنُ عِيسَى:‏‏‏‏ ثُمَّ أَوْتَرَ فَأَتَاهُ بِلَالٌ فَآذَنَهُ بِالصَّلَاةِ حِينَ طَلَعَ الْفَجْرُ فَصَلَّى رَكْعَتَيِ الْفَجْرِ، ‏‏‏‏‏‏ثُمَّ خَرَجَ إِلَى الصَّلَاةِ، ‏‏‏‏‏‏ثُمَّ اتَّفَقَا، ‏‏‏‏‏‏وَهُوَ يَقُولُ:‏‏‏‏ اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا، ‏‏‏‏‏‏وَاجْعَلْ فِي لِسَانِي نُورًا، ‏‏‏‏‏‏وَاجْعَلْ فِي سَمْعِي نُورًا، ‏‏‏‏‏‏وَاجْعَلْ فِي بَصَرِي نُورًا، ‏‏‏‏‏‏وَاجْعَلْ خَلْفِي نُورًا، ‏‏‏‏‏‏وَأَمَامِي نُورًا، ‏‏‏‏‏‏وَاجْعَلْ مِنْ فَوْقِي نُورًا، ‏‏‏‏‏‏وَمِنْ تَحْتِي نُورًا، ‏‏‏‏‏‏اللَّهُمَّ وَأَعْظِمْ لِي نُورًا ."
      },
      {
        "id": 20434,
        "hadith_number": "1354",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Riwayat Tambahan: Mohon Cahaya yang Berlimpah",
        "perawi_melayu": "Husain (melalui rantaian perawi berbeza) & Ibn Abbas",
        "english_text": "The above tradition has also been transmitted by Husain through a different chain of narrators in like manner. This version has the words: And give me abundant light. Abu Dawud said: This tradition has been transmitted by Abu Khalid al-Dalani from Habib and Salamah bin Kuhail from Abu Rishdin from Ibn Abbas in a similar manner.",
        "malay_translation": "Riwayat di atas juga telah diriwayatkan oleh Husain melalui rantaian perawi yang berbeza, dengan cara yang serupa. Versi ini mengandungi lafaz: 'Dan berikanlah aku cahaya yang berlimpah'. Abu Dawud berkata: Hadith ini telah diriwayatkan oleh Abu Khalid al-Dalani daripada Habib dan Salamah bin Kuhail daripada Abu Rishdin daripada Ibn Abbas dengan cara yang serupa.",
        "arabic_text": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ، ‏‏‏‏‏‏عَنْ خَالِدٍ،‏‏‏‏عَنْ حُصَيْنٍ، ‏‏‏‏‏‏نَحْوَهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَأَعْظِمْ لِي نُورًا . قَالَ أَبُو دَاوُد:‏‏‏‏ وَكَذَلِكَ قَالَ أَبُو خَالِدٍ الدَّالَانِيُّ:‏‏‏‏ عَنْ حَبِيبٍ فِي هَذَا، ‏‏‏‏‏‏وَكَذَلِكَ قَالَ فِي هَذَا الْحَدِيثِ:‏‏‏‏ وَقَالَ سَلَمَةُ بْنُ كُهَيْلٍ:‏‏‏‏ عَنْ أَبِي رِشْدِينَ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ"
      },
      {
        "id": 20435,
        "hadith_number": "1355",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Cara Solat Nabi SAW dan Bacaan Ayat Al-Quran",
        "perawi_melayu": "Fadl bin Abbas",
        "english_text": "Narrated Fadl bin Abbas: I spent a night with the Prophet صلی ‌اللہ ‌علیہ ‌وسلم to see how he prayed. He got up, performed ablution and prayed two rak'ahs. His standing was like his bowing (i. e. equal in duration), and his bowing was like his prostration (equal in length). Then he slept. Afterwards he awoke, performed ablution, and used tooth-stick. He then recited five verses from Surah Al-Imran: In the creation of the heavens and the earth and the alternation of night and day . He went on doing so till he prayed ten rak'ahs. He then stood up and prayed one rak'ah observing witr with it. In the meantime the muadhdhin called to prayer. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم stood up after the muadhdhin had kept silent. He prayed two light rak'ahs and remained sitting till he offered the dawn prayer. Abu Dawud said: A part of the tradition transmitted by Ibn Bashshar remained hidden from me.",
        "malay_translation": "Dikisahkan oleh Fadl bin Abbas: Saya menghabiskan satu malam bersama Nabi SAW untuk memerhatikan cara baginda menunaikan solat. Baginda bangun, bersuci dan menunaikan dua rakaat solat. Waktu berdiri baginda sama seperti waktu rukuknya, dan waktu rukuknya sama seperti waktu sujudnya. Kemudian baginda tidur. Setelah itu, baginda bangun, bersuci dan menggunakan siwak. Kemudian baginda membaca lima ayat daripada Surah Al-Imran: Tentang ciptaan langit dan bumi, dan pergantian siang dan malam. Baginda meneruskan amalan ini sehingga menunaikan sepuluh rakaat solat. Kemudian baginda bangun dan menunaikan satu rakaat solat witir bersama. Ketika itu, muadzin telah menyeru azan. Rasulullah SAW bangun setelah muadzin berhenti. Baginda menunaikan dua rakaat solat ringan dan duduk sehingga menunaikan solat Subuh. Abu Dawud berkata: Sebahagian riwayat yang disampaikan oleh Ibn Bashshar tersembunyi daripada saya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو عَاصِمٍ، ‏‏‏‏‏‏حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ، ‏‏‏‏‏‏عَنْ كُرَيْبٍ، ‏‏‏‏‏‏عَنْ الْفَضْلِ بْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ بِتُّ لَيْلَةً عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَنْظُرَ كَيْفَ يُصَلِّي، ‏‏‏‏‏‏ فَقَامَ فَتَوَضَّأَ وَصَلَّى رَكْعَتَيْنِ قِيَامُهُ مِثْلُ رُكُوعِهِ وَرُكُوعُهُ مِثْلُ سُجُودِهِ، ‏‏‏‏‏‏ثُمَّ نَامَ، ‏‏‏‏‏‏ثُمَّ اسْتَيْقَظَ فَتَوَضَّأَ وَاسْتَنَّ، ‏‏‏‏‏‏ثُمَّ قَرَأَ بِخَمْسِ آيَاتٍ مِنْ آلِ عِمْرَانَ إِنَّ فِي خَلْقِ السَّمَوَاتِ وَالأَرْضِ وَاخْتِلافِ اللَّيْلِ وَالنَّهَارِ سورة آل عمران آية 190 فَلَمْ يَزَلْ يَفْعَلُ هَذَا حَتَّى صَلَّى عَشْرَ رَكَعَاتٍ، ‏‏‏‏‏‏ثُمَّ قَامَ فَصَلَّى سَجْدَةً وَاحِدَةً فَأَوْتَرَ بِهَا وَنَادَى الْمُنَادِي عِنْدَ ذَلِكَ، ‏‏‏‏‏‏فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ مَا سَكَتَ الْمُؤَذِّنُ، ‏‏‏‏‏‏فَصَلَّى سَجْدَتَيْنِ خَفِيفَتَيْنِ، ‏‏‏‏‏‏ثُمَّ جَلَسَ حَتَّى صَلَّى الصُّبْحَ . قَالَ أَبُو دَاوُد:‏‏‏‏ خَفِيَ عَلَيَّ مِنْ ابْنِ بَشَّارٍ بَعْضُهُ"
      },
      {
        "id": 20436,
        "hadith_number": "1356",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Malam Rasulullah SAW dan Sunnahnya",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "Narrated Ibn Abbas: I spent a night with my maternal aunt Maimunah. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم came after the evening has come. He asked: Did the boy pray ? She said: Yes. Then he lay down till a part of night had passed as much as Allah willed; he got up, performed ablution and prayed seven or five rak'ahs, observing witr with them. He uttered the salutation only in the last of them.",
        "malay_translation": "Dikisahkan oleh Ibn Abbas: Aku menghabiskan satu malam bersama bibiku dari pihak ibu, Maimunah. Rasulullah SAW datang setelah waktu maghrib. Baginda bertanya: \"Adakah anak lelaki ini menunaikan solat?\" Bibiku menjawab: \"Ya.\" Kemudian Baginda berbaring sehingga sebahagian daripada malam berlalu sebagaimana yang dikehendaki Allah; Baginda bangun, membersihkan diri (wضوء), dan menunaikan solat sebanyak tujuh atau lima rakaat, sambil mengiringinya dengan solat witir. Baginda mengucapkan salam hanya di akhir solat tersebut.",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ قَيْسٍ الْأَسَدِيُّ، ‏‏‏‏‏‏عَنْ الْحَكَمِ بْنِ عُتَيْبَةَ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ جُبَيْرٍ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ بِتُّ عِنْدَ خَالَتِي مَيْمُونَةَ، ‏‏‏‏‏‏فَجَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ مَا أَمْسَى، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَصَلَّى الْغُلَامُ ؟ قَالُوا:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏ فَاضْطَجَعَ حَتَّى إِذَا مَضَى مِنَ اللَّيْلِ مَا شَاءَ اللَّهُ قَامَ فَتَوَضَّأَ، ‏‏‏‏‏‏ثُمَّ صَلَّى سَبْعًا أَوْ خَمْسًا أَوْتَرَ بِهِنَّ لَمْ يُسَلِّمْ إِلَّا فِي آخِرِهِنَّ ."
      },
      {
        "id": 20437,
        "hadith_number": "1357",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Menjalankan Solat Malam dan Subuh di Rumah Bibi",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "Narrated Ibn Abbas: I spent a night in the house of my maternal aunt Maimunah, daughter of al-Harith. The Prophet صلی ‌اللہ ‌علیہ ‌وسلم offered the night prayer. He then came and prayed four rak'ahs and slept. He then stood up and prayed. I stood at his left side. He made me go round and made me stand at his right side. He then prayed five rak'ahs and slept, and I heard his snoring. He then got up and prayed two rak'ahs. Afterwards he came out and offered the dawn prayer.",
        "malay_translation": "Diceritakan oleh Ibn Abbas: Aku menghabiskan satu malam di rumah bibiku dari pihak ibu, Maimunah binti al-Harith. Nabi صلی ‌اللہ ‌علیہ ‌وسلم menunaikan solat malam. Kemudian baginda datang dan menunaikan empat rakaat solat dan tidur. Kemudian baginda bangun dan solat. Aku berdiri di sebelah kiri baginda. Baginda membuatku berpusing dan membuatku berdiri di sebelah kanan baginda. Kemudian baginda menunaikan lima rakaat solat dan tidur, dan aku mendengar dengkurannya. Kemudian baginda bangun dan menunaikan dua rakaat solat. Selepas itu baginda keluar dan menunaikan solat Subuh.",
        "arabic_text": "حَدَّثَنَا ابْنُ الْمُثَنَّى، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، ‏‏‏‏‏‏عَنْ شُعْبَةَ، ‏‏‏‏‏‏عَنْ الْحَكَمِ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ جُبَيْرٍ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ بِتُّ فِي بَيْتِ خَالَتِي مَيْمُونَةَ بِنْتِ الْحَارِثِ فَصَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعِشَاءَ، ‏‏‏‏‏‏ثُمَّ جَاءَ فَصَلَّى أَرْبَعًا، ‏‏‏‏‏‏ثُمَّ نَامَ، ‏‏‏‏‏‏ثُمَّ قَامَ يُصَلِّي، ‏‏‏‏‏‏فَقُمْتُ عَنْ يَسَارِهِ فَأَدَارَنِي فَأَقَامَنِي عَنْ يَمِينِهِ، ‏‏‏‏‏‏فَصَلَّى خَمْسًا، ‏‏‏‏‏‏ثُمَّ نَامَ حَتَّى سَمِعْتُ غَطِيطَهُ أَوْ خَطِيطَهُ، ‏‏‏‏‏‏ثُمَّ قَامَ فَصَلَّى رَكْعَتَيْنِ، ‏‏‏‏‏‏ثُمَّ خَرَجَ فَصَلَّى الْغَدَاةَ ."
      },
      {
        "id": 20438,
        "hadith_number": "1358",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Sunat Nabi SAW: Lapan Rakaat Kemudian Witir Lima Rakaat",
        "perawi_melayu": "Said bin Jubair",
        "english_text": "Saeed bin Jubair said that Ibn Abbas told him: He (the Prophet) got up and prayed eight rak'ahs in pairs, and then observed witr with five rak'ahs and he did not sit between them.",
        "malay_translation": "Said bin Jubair berkata bahawa Ibn Abbas memberitahunya: Baginda (Nabi) bangun dan solat lapan rakaat secara berpasangan, kemudian menunaikan witir dengan lima rakaat dan Baginda tidak duduk di antara mereka.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏عَنْ عَبْدِ الْمَجِيدِ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ عَبَّادٍ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ جُبَيْرٍ، ‏‏‏‏‏‏أَنَّ ابْنَ عَبَّاسٍ حَدَّثَهُ فِي هَذِهِ الْقِصَّةِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَقَامَ فَصَلَّى رَكْعَتَيْنِ رَكْعَتَيْنِ حَتَّى صَلَّى ثَمَانِيَ رَكَعَاتٍ، ‏‏‏‏‏‏ثُمَّ أَوْتَرَ بِخَمْسٍ وَلَمْ يَجْلِسْ بَيْنَهُنَّ ."
      },
      {
        "id": 20439,
        "hadith_number": "1359",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Bilangan Rakaat Solat Rasulullah ﷺ",
        "perawi_melayu": "Aishah (رَضِيَ ٱللَّٰهُ عَنْهَا)",
        "english_text": "Narrated Aishah: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم used to pray thirteen rak'ahs, observing six rak'ahs in pairs including the two rak'ahs of dawn prayer. He would observe witr and five rak'ahs. He sat only in the last of them.",
        "malay_translation": "Diriwayatkan daripada Aishah (رَضِيَ ٱللَّٰهُ عَنْهَا): Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم mengerjakan solat tiga belas rakaat, dengan mengerjakan enam rakaat secara berpasangan termasuk dua rakaat solat fajar. Baginda mengerjakan witir dengan lima rakaat. Baginda duduk hanya pada rakaat terakhir.",
        "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى الْحَرَّانِيُّ، ‏‏‏‏‏‏حَدَّثَنِي مُحَمَّدُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي ثَلَاثَ عَشْرَةَ رَكْعَةً بِرَكْعَتَيْهِ، ‏‏‏‏‏‏قَبْلَ الصُّبْحِ يُصَلِّي سِتًّا مَثْنَى مَثْنَى، ‏‏‏‏‏‏وَيُوتِرُ بِخَمْسٍ لَا يَقْعُدُ بَيْنَهُنَّ إِلَّا فِي آخِرِهِنَّ"
      },
      {
        "id": 20440,
        "hadith_number": "1360",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Malam Nabi ﷺ Sebanyak Tiga Belas Rakaat",
        "perawi_melayu": "Aishah (r.a.)",
        "english_text": "Narrated Aishah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم used to pray thirteen rak'ahs during the night including the two rak'ahs of the dawn prayer.",
        "malay_translation": "Diriwayatkan daripada Aishah (r.a.): Nabi ﷺ biasa mengerjakan solat sebanyak tiga belas rakaat pada waktu malam termasuk dua rakaat solat fajar (Subuh).",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، ‏‏‏‏‏‏حَدَّثَنَا اللَّيْثُ، ‏‏‏‏‏‏عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، ‏‏‏‏‏‏عَنْ عِرَاكِ بْنِ مَالِكٍ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏أَنَّهَا أَخْبَرَتْهُ، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي بِاللَّيْلِ ثَلَاثَ عَشْرَةَ رَكْعَةً بِرَكْعَتَيِ الْفَجْرِ ."
      },
      {
        "id": 20441,
        "hadith_number": "1361",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Malam Rasulullah SAW dan Solat Sunat Qabliyah Subuh",
        "perawi_melayu": "Aishah (radiallahu 'anha)",
        "english_text": "Narrated Aishah: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم offered the night prayer and then prayed eight rak'ahs standing, and two rak'ahs between the two adhans (i. e. the adhan for the dawn prayer and the iqamah). He never left them. Jaf'ar bin Musafir said in his version: (He prayed) the two rak'ahs sitting between the two adhans. He added the word sitting .",
        "malay_translation": "Diriwayatkan daripada Aishah: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم menunaikan solat Isyak, kemudian baginda solat lapan rakaat dalam keadaan berdiri, dan dua rakaat di antara dua azan (iaitu azan Subuh dan iqamah). Baginda tidak pernah meninggalkannya. Jaf'ar bin Musafir berkata dalam riwayatnya: (Baginda solat) dua rakaat dalam keadaan duduk di antara dua azan. Beliau menambah perkataan 'duduk'.",
        "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏وَجَعْفَرُ بْنُ مُسَافِرٍ، ‏‏‏‏‏‏أَنَّ عَبْدَ اللَّهِ بْنَ يَزِيدَ الْمُقْرِئَ أَخْبَرَهُمَا، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ أَبِي أَيُّوبَ، ‏‏‏‏‏‏عَنْجَعْفَرِ بْنِ رَبِيعَةَ، ‏‏‏‏‏‏عَنْ عِرَاكِ بْنِ مَالِكٍ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الْعِشَاءَ، ‏‏‏‏‏‏ثُمَّ صَلَّى ثَمَانِيَ رَكَعَاتٍ قَائِمًا وَرَكْعَتَيْنِ بَيْنَ الْأَذَانَيْنِ، ‏‏‏‏‏‏وَلَمْ يَكُنْ يَدَعُهُمَا . قَالَ جَعْفَرُ بْنُ مُسَافِرٍ فِي حَدِيثِهِ:‏‏‏‏ وَرَكْعَتَيْنِ جَالِسًا بَيْنَ الْأَذَانَيْنِ، ‏‏‏‏‏‏زَادَ جَالِسًا ."
      },
      {
        "id": 20442,
        "hadith_number": "1362",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Bilangan Rakaat Solat Witir Rasulullah ﷺ",
        "perawi_melayu": "Abdullah bin Abi Qais",
        "english_text": "Abdullah bin Abi Qais said that he asked Aishah: How many rak'ahs would the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم pray observing the witr ? She said: He used to observe the witr with four and three, six and three, eight and three, and ten and three rak'ahs never observing less than seven or more than thirteen. The narrator Ahmad added in his version: He would not observe the witr with two rak'ahs before the dawn. I asked: With what would he observe the witr ? She said: He would never leave it. The version of Ahmad does not mention the words six and three (rak'ahs) .",
        "malay_translation": "Abdullah bin Abi Qais berkata bahawa dia bertanya kepada Aishah: Berapa rakaat yang Rasulullah ﷺ solat untuk witir? Aishah menjawab: Baginda ﷺ biasanya solat witir dengan empat dan tiga, enam dan tiga, lapan dan tiga, dan sepuluh dan tiga rakaat, tidak pernah kurang daripada tujuh atau lebih daripada tiga belas. Perawi Ahmad menambah dalam riwayatnya: Baginda ﷺ tidak pernah solat witir dengan dua rakaat sebelum subuh. Saya bertanya: Dengan apa baginda ﷺ solat witir? Aishah berkata: Baginda ﷺ tidak pernah meninggalkannya. Riwayat Ahmad tidak menyebut perkataan enam dan tiga (rakaat).",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، ‏‏‏‏‏‏وَمُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَيْسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ لِعَائِشَةَ رَضِيَ اللَّهُ عَنْهَا:‏‏‏‏ بِكَمْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوتِرُ ؟ قَالَتْ:‏‏‏‏ كَانَ يُوتِرُ بِأَرْبَعٍ وَثَلَاثٍ وَسِتٍّ وَثَلَاثٍ وَثَمَانٍ وَثَلَاثٍ وَعَشْرٍ وَثَلَاثٍ، ‏‏‏‏‏‏وَلَمْ يَكُنْ يُوتِرُ بِأَنْقَصَ مِنْ سَبْعٍ وَلَا بِأَكْثَرَ مِنْ ثَلَاثَ عَشْرَةَ . قَالَ أَبُو دَاوُد:‏‏‏‏ زَادَ أَحْمَدُ بْنُ صَالِحٍ:‏‏‏‏ وَلَمْ يَكُنْ يُوتِرُ بِرَكْعَتَيْنِ قَبْلَ الْفَجْرِ ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ مَا يُوتِرُ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ لَمْ يَكُنْ يَدَعُ ذَلِكَ . وَلَمْ يَذْكُرْ أَحْمَدُ:‏‏‏‏ وَسِتٍّ وَثَلَاثٍ ."
      },
      {
        "id": 20443,
        "hadith_number": "1363",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Bilangan Rakaat Solat Nabi SAW di Waktu Malam",
        "perawi_melayu": "Aishah رضي الله عنها",
        "english_text": "Narrated Aishah, Ummul Muminin: Al-Aswad ibn Yazid said that he entered upon Aishah and asked her about the prayer of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم during the night. She said: He used to pray thirteen rak'ahs during the night. Then he began to pray eleven rak'ahs and left two rak'ahs. When he died, he would pray nine rak'ahs during the night. His last prayer during the night was witr.",
        "malay_translation": "Diceritakan oleh Aishah, Ummul Mukminin: Al-Aswad ibn Yazid berkata bahawa dia masuk menemui Aishah dan bertanya tentang solat Rasulullah SAW di waktu malam. Aishah menjawab: Baginda dahulu menunaikan solat sebanyak tiga belas rakaat pada waktu malam. Kemudian, Baginda beralih kepada menunaikan sebelas rakaat dan meninggalkan dua rakaat. Apabila Baginda wafat, Baginda menunaikan sembilan rakaat pada waktu malam. Solat terakhir Baginda pada waktu malam ialah solat witir.",
        "arabic_text": "حَدَّثَنَا مُؤَمَّلُ بْنُ هِشَامٍ، ‏‏‏‏‏‏حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ مَنْصُورِ بْنِ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاقَ الْهَمْدَانِيِّ، ‏‏‏‏‏‏عَنْ الْأَسْوَدِ بْنِ يَزِيدَ، ‏‏‏‏‏‏أَنَّهُ دَخَلَ عَلَى عَائِشَةَ فَسَأَلَهَا عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِاللَّيْلِ، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ كَانَ يُصَلِّي ثَلَاثَ عَشْرَةَ رَكْعَةً مِنَ اللَّيْلِ، ‏‏‏‏‏‏ثُمَّ إِنَّهُ صَلَّى إِحْدَى عَشْرَةَ رَكْعَةً وَتَرَكَ رَكْعَتَيْنِ، ‏‏‏‏‏‏ثُمَّ قُبِضَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ قُبِضَ وَهُوَ يُصَلِّي مِنَ اللَّيْلِ تِسْعَ رَكَعَاتٍ، ‏‏‏‏‏‏وَكَانَ آخِرُ صَلَاتِهِ مِنَ اللَّيْلِ الْوِتْرَ ."
      },
      {
        "id": 20444,
        "hadith_number": "1364",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Cara Rasulullah ﷺ Solat Malam",
        "perawi_melayu": "Kuraib, bekas hamba Ibn Abbas",
        "english_text": "The client of Ibn Abbas said that he asked him: How would the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم pray during the night ? He replied: I spent a night with him when he was with Maimunah. He slept and awoke when half the night or one-third of it had passed. He stood up and went to a leather bad containing water. He performed ablution and I also performed ablution with him. He then stood up and I also stood at his left side. He made me stand at his right side. He then put his hand upon my head, as he was touching my ear and awakening me. He then prayed two light rak'ahs and recited Surah al-Fatihah in each of them, and uttered the salutation. He then prayed eleven rak'ahs observing the witr and slept. Then Bilal came to him and said: Prayer, Messenger of Allah. He got up and prayed two rak'ahs, and then led the people in the prayer.",
        "malay_translation": "Bekas hamba Ibn Abbas berkata bahawa dia bertanya kepada Ibn Abbas: “Bagaimanakah Rasulullah ﷺ solat pada waktu malam?” Dia menjawab: “Aku bermalam bersama Baginda ketika Baginda bersama Maimunah. Baginda tidur dan bangun apabila separuh malam atau satu pertiga daripadanya telah berlalu. Baginda bangun dan pergi ke bekas kulit yang berisi air. Baginda berwudhu’ dan aku juga berwudhu’ bersama Baginda. Kemudian Baginda berdiri dan aku juga berdiri di sebelah kiri Baginda. Baginda menyuruh aku berdiri di sebelah kanan Baginda. Kemudian Baginda meletakkan tangan ke atas kepalaku, seolah-olah menyentuh telingaku dan membangunkan aku. Baginda kemudian solat dua rakaat ringan dan membaca Surah al-Fatihah pada setiap rakaat, dan memberi salam. Kemudian Baginda solat sebelas rakaat dengan mengamalkan witir dan tidur. Kemudian Bilal datang kepada Baginda dan berkata: “Solat, wahai Rasulullah.” Baginda bangun dan solat dua rakaat, kemudian mengimamkan solat kepada orang ramai.",
        "arabic_text": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، ‏‏‏‏‏‏حَدَّثَنِي أَبِي، ‏‏‏‏‏‏عَنْ جَدِّي، ‏‏‏‏‏‏عَنْ خَالِدِ بْنِ يَزِيدَ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ، ‏‏‏‏‏‏عَنْمَخْرَمَةَ بْنِ سُلَيْمَانَ،‏‏‏‏أَنَّ كُرَيْبًا مَوْلَى ابْنِ عَبَّاسٍ أَخْبَرَهُ، ‏‏‏‏‏‏أَنَّهُ قَالَ:‏‏‏‏ سَأَلْتُ ابْنَ عَبَّاسٍ:‏‏‏‏ كَيْفَ كَانَتْ صَلَاةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِاللَّيْلِ ؟ قَالَ:‏‏‏‏ بِتُّ عِنْدَهُ لَيْلَةً وَهُوَ عِنْدَ مَيْمُونَةَ، ‏‏‏‏‏‏ فَنَامَ حَتَّى إِذَا ذَهَبَ ثُلُثُ اللَّيْلِ أَوْ نِصْفُهُ اسْتَيْقَظَ، ‏‏‏‏‏‏فَقَامَ إِلَى شَنٍّ فِيهِ مَاءٌ، ‏‏‏‏‏‏فَتَوَضَّأَ وَتَوَضَّأْتُ مَعَهُ، ‏‏‏‏‏‏ثُمَّ قَامَ فَقُمْتُ إِلَى جَنْبِهِ عَلَى يَسَارِهِ فَجَعَلَنِي عَلَى يَمِينِهِ، ‏‏‏‏‏‏ثُمَّ وَضَعَ يَدَهُ عَلَى رَأْسِي كَأَنَّهُ يَمَسُّ أُذُنِي كَأَنَّهُ يُوقِظُنِي، ‏‏‏‏‏‏فَصَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ، ‏‏‏‏‏‏قُلْتُ فَقَرَأَ فِيهِمَا بِأُمِّ الْقُرْآنِ فِي كُلِّ رَكْعَةٍ، ‏‏‏‏‏‏ثُمَّ سَلَّمَ، ‏‏‏‏‏‏ثُمَّ صَلَّى حَتَّى صَلَّى إِحْدَى عَشْرَةَ رَكْعَةً بِالْوِتْرِ، ‏‏‏‏‏‏ثُمَّ نَامَ، ‏‏‏‏‏‏فَأَتَاهُ بِلَالٌ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ الصَّلَاةُ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏فَقَامَ فَرَكَعَ رَكْعَتَيْنِ، ‏‏‏‏‏‏ثُمَّ صَلَّى لِلنَّاسِ ."
      },
      {
        "id": 20445,
        "hadith_number": "1365",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawud",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Malam Nabi SAW dan Surah Al-Muzzammil",
        "perawi_melayu": "Abdullah ibn Abbas",
        "english_text": "Narrated Abdullah ibn Abbas: I spent a night with my maternal aunt Maymunah. The Prophet صلی ‌اللہ ‌علیہ ‌وسلم got up to pray at night. He prayed thirteen rak'ahs including two rak'ahs of the dawn prayer. I guessed that he stood in every rak'ah as long as one could recite Surah al-Muzzammil (73).",
        "malay_translation": "Diceritakan oleh Abdullah ibn Abbas: Aku pernah menghabiskan satu malam bersama bibiku dari pihak ibu, Maymunah. Baginda Rasulullah SAW bangun untuk solat malam. Baginda menunaikan sebanyak tiga belas rakaat, termasuk dua rakaat solat Subuh. Aku agak Baginda berdiri dalam setiap rakaat selama yang cukup untuk membaca Surah Al-Muzzammil (73).",
        "arabic_text": "حَدَّثَنَا نُوحُ بْنُ حَبِيبٍ، ‏‏‏‏‏‏وَيَحْيَى بْنُ مُوسَى، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَخْبَرَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنْ ابْنِ طَاوُسٍ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ بْنِ خَالِدٍ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ بِتُّ عِنْدَ خَالَتِي مَيْمُونَةَ فَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مِنَ اللَّيْلِ، ‏‏‏‏‏‏فَصَلَّى ثَلَاثَ عَشْرَةَ رَكْعَةً مِنْهَا رَكْعَتَا الْفَجْرِ حَزَرْتُ قِيَامَهُ فِي كُلِّ رَكْعَةٍ بِقَدْرِ يَأَيُّهَا الْمُزَّمِّلُ، ‏‏‏‏‏‏لَمْ يَقُلْ نُوحٌ، ‏‏‏‏‏‏مِنْهَا رَكْعَتَا الْفَجْرِ ."
      },
      {
        "id": 20446,
        "hadith_number": "1366",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Solat Malam Rasulullah ﷺ: Dua Belas Rakaat dan Witir",
        "perawi_melayu": "Zaid bin Khalid al-Juhani رضي الله عنه",
        "english_text": "Khalid al-Juhani said: I shall watch the prayer of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم at night. I slept at the threshold of his door or of his tent. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم prayed two light rak'ahs, and then prayed two long, long, long rak'ahs. He then prayed two rak'ahs that were not so long as the two rak'ahs before them ; he then prayed two rak'ahs that were less in duration, than the rak'ahs before them; again he prayed two rak'ahs that were less in length then the preceding rak'ahs; he then prayed two rak'ahs that were less in length than the previous rak'ahs. This made altogether thirteen rak'ahs.",
        "malay_translation": "Khalid al-Juhani berkata: Aku akan memerhatikan solat Rasulullah ﷺ pada waktu malam. Aku tidur di ambang pintu baginda atau khemah baginda. Rasulullah ﷺ solat dua rakaat ringan, kemudian solat dua rakaat yang panjang, panjang, panjang. Kemudian baginda solat dua rakaat yang tidak sepanjang dua rakaat sebelumnya; kemudian baginda solat dua rakaat yang lebih pendek daripada dua rakaat sebelumnya; sekali lagi baginda solat dua rakaat yang lebih pendek daripada rakaat sebelumnya; kemudian baginda solat dua rakaat yang lebih pendek daripada rakaat sebelumnya. Ini berjumlah tiga belas rakaat.",
        "arabic_text": "حَدَّثَنَا الْقَعْنَبِيُّ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏أَنَّ عَبْدَ اللَّهِ بْنَ قَيْسِ بْنِ مَخْرَمَةَ أَخْبَرَهُ، ‏‏‏‏‏‏عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، ‏‏‏‏‏‏أَنَّهُ قَالَ:‏‏‏‏ لَأَرْمُقَنَّ صَلَاةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّيْلَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَتَوَسَّدْتُ عَتَبَتَهُ أَوْ فُسْطَاطَهُ فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَيْنِ خَفِيفَتَيْنِ، ‏‏‏‏‏‏ثُمَّ صَلَّى رَكْعَتَيْنِ طَوِيلَتَيْنِ طَوِيلَتَيْنِ طَوِيلَتَيْنِ، ‏‏‏‏‏‏ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا، ‏‏‏‏‏‏ثُمَّ صَلَّى رَكْعَتَيْنِ دُونَ اللَّتَيْنِ قَبْلَهُمَا، ‏‏‏‏‏‏ثُمَّ صَلَّى رَكْعَتَيْنِ دُونَ اللَّتَيْنِ قَبْلَهُمَا، ‏‏‏‏‏‏ثُمَّ صَلَّى رَكْعَتَيْنِ دُونَ اللَّتَيْنِ قَبْلَهُمَا، ‏‏‏‏‏‏ثُمَّ أَوْتَرَ، ‏‏‏‏‏‏فَذَلِكَ ثَلَاثَ عَشْرَةَ رَكْعَةً ."
      },
      {
        "id": 20447,
        "hadith_number": "1367",
        "status": "sahih",
        "nama_buku": "Sunan Abu Daud",
        "penulis_buku": "Imam Abu Daud Sulaiman bin al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Cara Tidur dan Solat Nabi SAW di Malam Hari",
        "perawi_melayu": "Abdullah bin Abbas",
        "english_text": "Narrated Abdullah bin Abbas: That he spent a night with Maimunah, wife of the Prophet صلی ‌اللہ ‌علیہ ‌وسلم, who was also his (Ibn Abbas's) maternal aunt. I lay towards the width of the pillow and the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم and his wife slept towards its length. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم slept. When half the night passed, or a little before it or a little after it, the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم awoke and began to rub his face (eyes) to remove the sleep. He then recited ten verses from the last part of Surah 'Al-Imran. Hen then came to a bag of water that was hanging. He performed ablution from it and performed his ablution well. He then stood up and prayed. I also got up and did as he did. I then went and stood at his side. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم placed his right hand upon my head and took me by my ear twisting it. He then prayed two rak'ahs, then two rak'ahs, then two rak'ahs, then two rak'ahs, then two rak'ahs, then two rak'ahs. The narrator al-Qanabi said: Six times. He observed the witr prayer, and then slept until the muadhdhin came. He got up and prayed two light rak'ahs and then came out and offered the dawn prayer.",
        "malay_translation": "Dikisahkan oleh Abdullah bin Abbas bahawa beliau telah menghabiskan satu malam bersama Maimunah, isteri Nabi صلی ‌اللہ ‌علیہ ‌وسلم, yang juga merupakan bibinya yang ibu dari sebelah ibu beliau (Ibn Abbas). Saya berbaring di bahagian tepi bantal, manakala Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم dan isterinya berbaring di bahagian memanjangnya. Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم kemudian tidur. Apabila separuh malam berlalu, atau sedikit sebelum atau sedikit selepasnya, Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم terjaga dan mula menggosok wajahnya (matanya) untuk menghilangkan rasa mengantuk. Kemudian beliau membaca sepuluh ayat dari bahagian akhir Surah Al-Imran. Lalu beliau menuju ke satu bekas air yang tergantung. Beliau berwudhuk daripadanya dan melakukannya dengan sempurna. Kemudian beliau bangun dan bersembahyang. Saya juga bangun dan melakukan apa yang dilakukan oleh beliau. Saya kemudian pergi dan berdiri di sisinya. Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم meletakkan tangan kanannya di atas kepala saya dan memegang telinga saya sambil memutarnya. Kemudian beliau mengerjakan dua rakaat, kemudian dua rakaat, kemudian dua rakaat, kemudian dua rakaat, kemudian dua rakaat, kemudian dua rakaat. Penceritakan (al-Qanabi) berkata: Enam kali. Kemudian beliau menunaikan solat witir, dan tidur hingga azan kedengaran. Beliau bangun dan menunaikan dua rakaat solat sunat, kemudian keluar dan menunaikan solat subuh.",
        "arabic_text": "حَدَّثَنَا الْقَعْنَبِيُّ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ مَخْرمَةَ بْنِ سُلَيْمَانَ، ‏‏‏‏‏‏عَنْ كُرَيْبٍ موْلَى ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، ‏‏‏‏‏‏أَنَّهُ بَاتَ عِنْدَ مَيْمُونَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَهِيَ خَالَتُهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَاضْطَجَعْتُ فِي عَرْضِ الْوِسَادَةِ وَاضْطَجَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَهْلُهُ فِي طُولِهَا، ‏‏‏‏‏‏فَنَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى إِذَا انْتَصَفَ اللَّيْلُ أَوْ قَبْلَهُ بِقَلِيلٍ أَوْ بَعْدَهُ بِقَلِيلٍ اسْتَيْقَظَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَجَلَسَ يَمْسَحُ النَّوْمَ عَنْ وَجْهِهِ بِيَدِهِ، ‏‏‏‏‏‏ثُمَّ قَرَأَ الْعَشْرَ الْآيَاتِ الْخَوَاتِمِ مِنْ سُورَةِ آلِ عِمْرَانَ، ‏‏‏‏‏‏ثُمَّ قَامَ إِلَى شَنٍّ مُعَلَّقَةٍ، ‏‏‏‏‏‏فَتَوَضَّأَ مِنْهَا، ‏‏‏‏‏‏فَأَحْسَنَ وُضُوءَهُ، ‏‏‏‏‏‏ثُمَّ قَامَ يُصَلِّي، ‏‏‏‏‏‏قَالَ عَبْدُ اللَّهِ:‏‏‏‏ فَقُمْتُ، ‏‏‏‏‏‏فَصَنَعْتُ مِثْلَ مَا صَنَعَ، ‏‏‏‏‏‏ثُمَّ ذَهَبْتُ فَقُمْتُ إِلَى جَنْبِهِ، ‏‏‏‏‏‏فَوَضَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ الْيُمْنَى عَلَى رَأْسِي فَأَخَذَ بِأُذُنِي يَفْتِلُهَا فَصَلَّى رَكْعَتَيْنِ، ‏‏‏‏‏‏ثُمَّ رَكْعَتَيْنِ، ‏‏‏‏‏‏ثُمَّ رَكْعَتَيْنِ، ‏‏‏‏‏‏ثُمَّ رَكْعَتَيْنِ، ‏‏‏‏‏‏ثُمَّ رَكْعَتَيْنِ، ‏‏‏‏‏‏ثُمَّ رَكْعَتَيْنِ، ‏‏‏‏‏‏قَالَ الْقَعْنَبِيُّ:‏‏‏‏ سِتَّ مَرَّاتٍ، ‏‏‏‏‏‏ثُمَّ أَوْتَرَ، ‏‏‏‏‏‏ثُمَّ اضْطَجَعَ حَتَّى جَاءَهُ الْمُؤَذِّنُ، ‏‏‏‏‏‏فَقَامَ فَصَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ، ‏‏‏‏‏‏ثُمَّ خَرَجَ فَصَلَّى الصُّبْحَ ."
      },
      {
        "id": 20448,
        "hadith_number": "1368",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Amalan yang Berterusan dan Diredhai Allah",
        "perawi_melayu": "Aishah رضي الله عنها",
        "english_text": "Narrated Aishah: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم as saying: Choose such actions as you are capable of performing, for Allah does not grow weary till you do. The acts most pleasing to Allah are those which are done most continuously, even if they amount to little. Whenever he began an action, he would do it continuously.",
        "malay_translation": "Diriwayatkan daripada Aishah: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: \"Lakukanlah amalan yang kamu mampu melakukannya, kerana Allah tidak akan merasa jemu sehingga kamu merasa jemu. Sesungguhnya amalan yang paling disukai Allah adalah amalan yang berterusan walaupun sedikit. Dan apabila baginda memulakan sesuatu amalan, baginda akan melakukannya secara berterusan.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، ‏‏‏‏‏‏حَدَّثَنَا اللَّيْثُ، ‏‏‏‏‏‏عَنْ ابْنِ عَجْلَانَ، ‏‏‏‏‏‏عَنْ سَعِيدٍ الْمَقْبُرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ اكْلَفُوا مِنَ الْعَمَلِ مَا تُطِيقُونَ، ‏‏‏‏‏‏فَإِنَّ اللَّهَ لَا يَمَلُّ حَتَّى تَمَلُّوا، ‏‏‏‏‏‏وَإِنَّ أَحَبَّ الْعَمَلِ إِلَى اللَّهِ أَدْوَمُهُ وَإِنْ قَلَّ، ‏‏‏‏‏‏وَكَانَ إِذَا عَمِلَ عَمَلًا أَثْبَتَهُ ."
      },
      {
        "id": 20449,
        "hadith_number": "1369",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Nasihat Nabi SAW kepada Uthman bin Maz'un",
        "perawi_melayu": "Aishah (رَضِيَ ٱللَّٰهُ عَنْهَا)",
        "english_text": "Narrated Aishah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم called Uthman bin Maz'un. When he came to him, he said: Uthman, did you dislike my practice ? He said: No, by Allah, but I seek your practice. He said: I sleep, I pray, I keep fast, I (sometimes) leave fast, and I marry women. Fear Allah, Uthman, your wife has a right on you, your guest has a right on you, your self has a right on you ; you should keep fast and (sometimes) leave fast, and pray and sleep.",
        "malay_translation": "Diriwayatkan daripada Aishah (رَضِيَ ٱللَّٰهُ عَنْهَا): Nabi صلی ‌اللہ ‌علیہ ‌وسلم memanggil Uthman bin Maz'un. Apabila dia datang kepada baginda, baginda bersabda: \"Wahai Uthman, adakah engkau tidak suka kepada amalan-ku?\" Dia menjawab: \"Tidak, demi Allah, tetapi aku mencari amalan-mu.\" Baginda bersabda: \"Sesungguhnya aku tidur, aku solat, aku berpuasa, aku berbuka puasa (kadang-kadang), dan aku berkahwin dengan wanita. Bertaqwalah kepada Allah, wahai Uthman, sesungguhnya isteri engkau mempunyai hak ke atas engkau, tetamu engkau mempunyai hak ke atas engkau, diri engkau sendiri mempunyai hak ke atas engkau; berpuasalah dan berbukalah (kadang-kadang), dan solatlah dan tidurlah.\"",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدٍ، ‏‏‏‏‏‏حَدَّثَنَا عَمِّي، ‏‏‏‏‏‏حَدَّثَنَا أَبِي، ‏‏‏‏‏‏عَنْ ابْنِ إِسْحَاقَ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ إِلَى عُثْمَانَ بْنِ مَظْعُونٍ، ‏‏‏‏‏‏فَجَاءَهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا عُثْمَانُ، ‏‏‏‏‏‏أَرَغِبْتَ عَنْ سُنَّتِي ؟ قَالَ:‏‏‏‏ لَا وَاللَّهِ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏وَلَكِنْ سُنَّتَكَ أَطْلُبُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَإِنِّي أَنَامُ، ‏‏‏‏‏‏وَأُصَلِّي، ‏‏‏‏‏‏وَأَصُومُ، ‏‏‏‏‏‏وَأُفْطِرُ، ‏‏‏‏‏‏وَأَنْكِحُ النِّسَاءَ، ‏‏‏‏‏‏فَاتَّقِ اللَّهَ يَا عُثْمَانُ فَإِنَّ لِأَهْلِكَ عَلَيْكَ حَقًّا، ‏‏‏‏‏‏وَإِنَّ لِضَيْفِكَ عَلَيْكَ حَقًّا، ‏‏‏‏‏‏وَإِنَّ لِنَفْسِكَ عَلَيْكَ حَقًّا، ‏‏‏‏‏‏فَصُمْ وَأَفْطِرْ، ‏‏‏‏‏‏وَصَلِّ وَنَمْ ."
      },
      {
        "id": 20450,
        "hadith_number": "1370",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Amalan Nabi SAW yang Berterusan",
        "perawi_melayu": "Alqamah",
        "english_text": "Alqamah said: Aishah was asked about the actions of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم. Did he perform some actions exclusively on some particular days ? She said: No, he performed his actions regularly. Which of you has the strength as much as the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم had ?",
        "malay_translation": "Alqamah berkata: Aisyah radhiyallahu 'anha ditanya tentang amalan Rasulullah SAW. Adakah baginda melakukan beberapa amalan secara khusus pada hari-hari tertentu? Beliau menjawab: Tidak, baginda melakukan amalan secara berterusan. Siapakah di antara kamu yang mempunyai kekuatan seperti yang dimiliki oleh Rasulullah SAW?",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا جَرِيرٌ، ‏‏‏‏‏‏عَنْ مَنْصُورٍ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ عَلْقَمَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَأَلْتُ عَائِشَةَ:‏‏‏‏ كَيْفَ كَانَ عَمَلُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ؟ هَلْ كَانَ يَخُصُّ شَيْئًا مِنَ الْأَيَّامِ ؟ قَالَتْ:‏‏‏‏ لَا، ‏‏‏‏‏‏ كَانَ كُلُّ عَمَلِهِ دِيمَةً وَأَيُّكُمْ يَسْتَطِيعُ مَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَطِيعُ ؟."
      }
    ]
  }
}