{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 70,
    "data": [
      {
        "id": 22651,
        "hadith_number": "3571",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Kematian Hakim Tanpa Pisau",
        "perawi_melayu": "Abu Hurairah RA",
        "english_text": "Narrated Abu Hurairah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: He who has been appointed a judge has been killed without a knife.",
        "malay_translation": "Diriwayatkan dari Abu Hurairah RA: Nabi Muhammad صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Sesiapa yang dilantik menjadi hakim, maka dia telah disembelih tanpa pisau.",
        "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏أَخْبَرَنَا فُضَيْلُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏حَدَّثَنَا عَمْرُو بْنُ أَبِي عَمْرٍو، ‏‏‏‏‏‏عَنْ سَعِيدٍ الْمَقْبُرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَنْ وَلِيَ الْقَضَاءَ فَقَدْ ذُبِحَ بِغَيْرِ سِكِّينٍ ."
      },
      {
        "id": 22652,
        "hadith_number": "3572",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Ancaman Menjadi Hakim",
        "perawi_melayu": "Abu Hurairah RA",
        "english_text": "Narrated Abu Hurairah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: He who has been appointed a judge among the people has been killed without a knife.",
        "malay_translation": "Daripada Abu Hurairah RA, Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Sesiapa yang dilantik menjadi hakim di kalangan manusia, maka sesungguhnya dia telah dibunuh tanpa pisau.",
        "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏أَخْبَرَنَا بِشْرُ بْنُ عُمَرَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، ‏‏‏‏‏‏عَنْ عُثْمَانَ بْنِ مُحَمَّدٍ الْأَخْنَسِيِّ، ‏‏‏‏‏‏عَنْ الْمَقْبُرِيِّ، ‏‏‏‏‏‏وَالْأَعْرَجِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَنْ جُعِلَ قَاضِيًا بَيْنَ النَّاسِ، ‏‏‏‏‏‏فَقَدْ ذُبِحَ بِغَيْرِ سِكِّينٍ ."
      },
      {
        "id": 22653,
        "hadith_number": "3573",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Jenis-jenis Hakim (Kadi) dan Tempat Kembali Mereka",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Narrated Buraydah ibn al-Hasib: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Judges are of three types, one of whom will go to Paradise and two to Hell. The one who will go to Paradise is a man who knows what is right and gives judgment accordingly; but a man who knows what is right and acts tyrannically in his judgment will go to Hell; and a man who gives judgment for people when he is ignorant will go to Hell. Abu Dawud said: On this subject this is the soundest tradition, that is, the tradition of Ibn Buraidah: Judges are of three types.",
        "malay_translation": "Diriwayatkan daripada Buraydah ibn al-Hasib: Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Hakim (Kadi) ada tiga jenis; seorang daripadanya akan masuk Syurga dan dua lagi ke Neraka. Orang yang akan masuk Syurga adalah seorang lelaki yang mengetahui kebenaran dan memberi keputusan (hukuman) berdasarkan kebenaran itu; tetapi seorang lelaki yang mengetahui kebenaran tetapi bertindak zalim dalam keputusannya akan masuk Neraka; dan seorang lelaki yang memberi keputusan (hukuman) untuk orang ramai dalam keadaan dia jahil akan masuk Neraka. Abu Dawood berkata: Mengenai perkara ini, ini adalah hadis yang paling sahih, iaitu hadis Ibn Buraidah: Hakim (Kadi) ada tiga jenis.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ حَسَّانَ السَّمْتِيُّ، ‏‏‏‏‏‏حَدَّثَنَا خَلَفُ بْنُ خَلِيفَةَ، ‏‏‏‏‏‏عَنْ أَبِي هَاشِمٍ، ‏‏‏‏‏‏عَنْ ابْنِ بُرَيْدَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ الْقُضَاةُ ثَلَاثَةٌ:‏‏‏‏ وَاحِدٌ فِي الْجَنَّةِ، ‏‏‏‏‏‏وَاثْنَانِ فِي النَّارِ، ‏‏‏‏‏‏فَأَمَّا الَّذِي فِي الْجَنَّةِ فَرَجُلٌ عَرَفَ الْحَقَّ فَقَضَى بِه، ‏‏‏‏‏‏وَرَجُلٌ عَرَفَ الْحَقَّ فَجَارَ فِي الْحُكْمِ فَهُوَ فِي النَّارِ، ‏‏‏‏‏‏وَرَجُلٌ قَضَى لِلنَّاسِ عَلَى جَهْلٍ فَهُوَ فِي النَّارِ ، ‏‏‏‏‏‏قَالَ أَبُو دَاوُد:‏‏‏‏ وَهَذَا أَصَحُّ شَيْءٍ فِيهِ، ‏‏‏‏‏‏يَعْنِي حَدِيثَ ابْنِ بُرَيْدَةَ الْقُضَاةُ ثَلَاثَةٌ."
      },
      {
        "id": 22654,
        "hadith_number": "3574",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulaiman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Tiga Jenis Hakim dan Balasan Mereka",
        "perawi_melayu": "Buraidah RA",
        "english_text": "Narrated Buraidah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم as saying: Judges are of three types, one of who will go to Paradise and two to Hell. The one who will go to Paradise is a man who knows what is right and gives judgement accordingly; by a man who knows what is right and acts tyrannically in his judgement will go to Hell; and a man who gives judgement for people when he is ignorant will go to Hell. Abu Dawud said: On this subject this is the soundest tradition, that is m the tradition of Ibn Buraidah: Judges are of three types.",
        "malay_translation": "Daripada Buraidah RA, Nabi ﷺ bersabda: Hakim-hakim ada tiga jenis; satu jenis akan masuk syurga dan dua jenis akan masuk neraka. Hakim yang akan masuk syurga adalah seorang lelaki yang mengetahui kebenaran dan menghukum dengannya; seorang lelaki yang mengetahui kebenaran dan bertindak zalim dalam hukumannya akan masuk neraka; dan seorang lelaki yang menghukum di antara manusia dalam keadaan jahil akan masuk neraka. Abu Daud berkata: Mengenai subjek ini, hadis ini adalah hadis yang paling sahih, iaitu hadis daripada Ibn Buraidah: Hakim-hakim ada tiga jenis.",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ، ‏‏‏‏‏‏أَخْبَرَنِي يَزِيدُ بْنُ عَبْدِ اللَّهِ بْنِ الْهَادِ، ‏‏‏‏‏‏عَنْمُحَمَّدِ بْنِ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ بُسْرِ بْنِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ أَبِي قَيْسٍ مَوْلَى عَمْرِو بْنِ الْعَاصِ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ الْعَاصِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا حَكَمَ الْحَاكِمُ، ‏‏‏‏‏‏فَاجْتَهَدَ فَأَصَابَ فَلَهُ أَجْرَانِ وَإِذَا حَكَمَ فَاجْتَهَدَ فَأَخْطَأَ فَلَهُ أَجْرٌ ، ‏‏‏‏‏‏فَحَدَّثْتُ بِهِ أَبَا بَكْرِ بْنِ حَزْمٍ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ هَكَذَا حَدَّثَنِي أَبُو سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَة."
      },
      {
        "id": 22655,
        "hadith_number": "3575",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Balasan bagi Hakim yang Adil dan Zalim",
        "perawi_melayu": "Abu Hurairah RA",
        "english_text": "Narrated Abu Hurairah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: If anyone seeks the office of judge among Muslims till he gets it and his justice prevails over his tyranny, he will go to Paradise; but the man whose tyranny prevails over his justice will go to Hell.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah RA: Nabi Muhammad SAW bersabda: 'Sesiapa yang mencari jawatan hakim dalam kalangan umat Islam sehingga dia mendapatkannya, dan keadilannya mengatasi kezalimannya, maka dia akan masuk syurga; tetapi sesiapa yang kezalimannya mengatasi keadilannya, maka dia akan masuk neraka.'",
        "arabic_text": "حَدَّثَنَا عَبَّاسٌ الْعَنْبَرِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عُمَرُ بْنُ يُونُسَ، ‏‏‏‏‏‏حَدَّثَنَا مُلَازِمُ بْنُ عَمْرٍو، ‏‏‏‏‏‏حَدَّثَنِي مُوسَى بْنُ نَجْدَةَ، ‏‏‏‏‏‏عَنْ جَدِّهِ يَزِيدُ بْنُ عَبْدِ الرَّحْمَنِ وَهُوَ أَبُو كَثِيرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي أَبُو هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَنْ طَلَبَ قَضَاءَ الْمُسْلِمِينَ حَتَّى يَنَالَهُ، ‏‏‏‏‏‏ثُمَّ غَلَبَ عَدْلُهُ جَوْرَهُ فَلَهُ الْجَنَّةُ، ‏‏‏‏‏‏وَمَنْ غَلَبَ جَوْرُهُ عَدْلَهُ فَلَهُ النَّارُ ."
      },
      {
        "id": 22656,
        "hadith_number": "3576",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukuman Allah dan Golongan Kafir, Zalim, dan Fasik",
        "perawi_melayu": "Ibnu Abbas RA",
        "english_text": "Ibn Abbas said: If any do fail to judge (by the light of) what Allah has revealed, they are (no better than) unbelievers up to wrongdoers. These three verses were revealed about the Jews, particularly about Quraizah and al-Nadir.",
        "malay_translation": "Ibnu Abbas RA berkata: Sesiapa yang tidak menghukum dengan apa yang telah diturunkan oleh Allah, maka mereka adalah (tidak lebih baik daripada) orang-orang kafir, sehingga orang-orang yang zalim. Tiga ayat ini diturunkan mengenai orang-orang Yahudi, khususnya mengenai Quraizah dan al-Nadir.",
        "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ بْنِ أَبِي يَحْيَى الرَّمْلِيُّ، ‏‏‏‏‏‏حَدَّثَنَا زَيْدُ بْنُ أَبِي الزَّرْقَاءِ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْعُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَمَنْ لَمْ يَحْكُمْ بِمَا أَنْزَلَ اللَّهُ فَأُولَئِكَ هُمُ الْكَافِرُونَ إِلَى قَوْلِهِ الْفَاسِقُونَ سورة المائدة آية 44 ـ 47 هَؤُلَاءِ الْآيَاتِ الثَّلَاثِ نَزَلَتْ فِي الْيَهُودِ خَاصَّةً فِي قُرَيْظَةَ وَالنَّضِيرِ ."
      },
      {
        "id": 22657,
        "hadith_number": "3577",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulaiman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Tergesa-gesa dalam Membuat Keputusan",
        "perawi_melayu": "Tidak diketahui",
        "english_text": "Abdur Rahman ibn Bishr al-Ansari al-Azraq said: Two men from the locality of Kindah came while Abu Masud al-Ansari was sitting n a circle. They said: Is there any man who decides between us. A man from the circle said: I, Abu Masud took a handful of pebbles and threw at him, saying: Hush! It is disapproved to make haste in decision.",
        "malay_translation": "Abdur Rahman ibn Bishr al-Ansari al-Azraq berkata: Dua orang lelaki dari kawasan Kindah datang ketika Abu Mas'ud al-Ansari sedang duduk dalam satu halaqah (lingkaran). Mereka berkata: Adakah sesiapa yang boleh memutuskan perkara di antara kami? Seorang lelaki dari halaqah itu berkata: Saya. Abu Mas'ud mengambil segenggam batu kerikil dan melemparkannya kepada lelaki itu, sambil berkata: Diam! Sesungguhnya tidak disukai untuk tergesa-gesa dalam membuat keputusan.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ، ‏‏‏‏‏‏وَمُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏قَالَا:‏‏‏‏ أَخْبَرَنَا أَبُو مُعَاوِيَةَ، ‏‏‏‏‏‏عَنِ الْأَعْمَشِ، ‏‏‏‏‏‏عَنْ رَجَاءٍ الْأَنْصَارِيِّ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ بِشْرٍ الْأَنْصَارِيِّ الْأَزْرَقِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ دَخَلَ رَجُلَانِ مِنْ أَبْوَابِ كِنْدَةَ، ‏‏‏‏‏‏وَأَبُو مَسْعُودٍ الْأَنْصَارِيُّ جَالِسٌ فِي حَلْقَةٍ، ‏‏‏‏‏‏فَقَالَا:‏‏‏‏ أَلَا رَجُلٌ يُنَفِّذُ بَيْنَنَا ؟، ‏‏‏‏‏‏فَقَالَ رَجُلٌ مِنَ الْحَلْقَةِ:‏‏‏‏ أَنَا، ‏‏‏‏‏‏فَأَخَذَ أَبُو مَسْعُودٍ كَفًّا مِنْ حَصًى فَرَمَاهُ بِهِ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ مَهْ إِنَّهُ كَانَ يُكْرَهُ التَّسَرُّعُ إِلَى الْحُكْمِ ."
      },
      {
        "id": 22658,
        "hadith_number": "3578",
        "status": "sahih",
        "nama_buku": "Sunan Abu Daud",
        "penulis_buku": "Imam Abu Daud Sulaiman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Menginginkan Jawatan Hakim",
        "perawi_melayu": "Anas ibn Malik RA",
        "english_text": "Narrated Anas ibn Malik: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: If anyone desires the office of Judge and seeks help for it, he will be left to his own devices; if anyone does not desire it, nor does he seek help for it, Allah will send down an angel who will direct him aright. Waki said: (This tradition has also been transmitted) by Isra'il, from Abd al-A'la, from Bilal bin Abi Musa, from Anas, from the Prophet صلی ‌اللہ ‌علیہ ‌وسلم. Abu 'Awanah said: from Abd al-A'la, from Bilal bin Mirdas al-Fazari, from Khaithamah al-Basri from Anas.",
        "malay_translation": "Daripada Anas ibn Malik RA, Nabi Muhammad SAW bersabda: 'Sesiapa yang menginginkan jawatan hakim dan meminta bantuan untuknya, dia akan dibiarkan dengan dirinya sendiri; dan sesiapa yang tidak menginginkannya, dan tidak meminta bantuan untuknya, Allah akan menurunkan malaikat yang akan membimbingnya dengan betul.' Waki berkata: '(Hadis ini juga diriwayatkan) oleh Isra'il, daripada Abd al-A'la, daripada Bilal bin Abi Musa, daripada Anas, daripada Nabi SAW.' Abu 'Awanah berkata: 'daripada Abd al-A'la, daripada Bilal bin Mirdas al-Fazari, daripada Khaithamah al-Basri daripada Anas.'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، ‏‏‏‏‏‏أَخْبَرَنَا إِسْرَائِيلُ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْأَعْلَى، ‏‏‏‏‏‏عَنْ بِلَالٍ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ مَنْ طَلَبَ الْقَضَاءَ وَاسْتَعَانَ عَلَيْهِ وُكِلَ إِلَيْهِ، ‏‏‏‏‏‏وَمَنْ لَمْ يَطْلُبْهُ وَلَمْ يَسْتَعِنْ عَلَيْهِ أَنْزَلَ اللَّهُ مَلَكًا يُسَدِّدُهُ ، ‏‏‏‏‏‏وقَالَ وَكِيعٌ:‏‏‏‏ عَنْ إِسْرَائِيلَ، ‏‏‏‏‏‏عَنْ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏عَنْ بِلَالِ بْنِ أَبِي مُوسَى، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وقَالَ أَبُو عَوَانَةَ:‏‏‏‏ عَنْ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏عَنْ بِلَالِ بْنِ مِرْدَاسٍ الْفَزَارِيِّ، عَنْ خَيْثَمَةَ الْبَصْرِيِّ، ‏‏‏‏‏‏عَنْ أَنَسٍ."
      },
      {
        "id": 22659,
        "hadith_number": "3579",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Meminta Jawatan",
        "perawi_melayu": "Abu Buradah",
        "english_text": "Abu Buradah reported the Prophet صلی ‌اللہ ‌علیہ ‌وسلم as saying: We will never employ or we shall not employ (the narrator is doubtful) in our work one who wants it.",
        "malay_translation": "Abu Buradah meriwayatkan bahawa Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Kami tidak akan pernah mengambil bekerja atau kami tidak akan mengambil bekerja (perawi ragu-ragu) dalam pekerjaan kami seseorang yang menginginkannya.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ‏‏‏‏‏‏حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ، ‏‏‏‏‏‏حَدَّثَنَا حُمَيْدُ بْنُ هِلَالٍ، ‏‏‏‏‏‏حَدَّثَنِي أَبُو بُرْدَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ أَبُو مُوسَى، ‏‏‏‏‏‏قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَنْ نَسْتَعْمِلَ أَوْ لَا نَسْتَعْمِلُ عَلَى عَمَلِنَا مَنْ أَرَادَهُ ."
      },
      {
        "id": 22660,
        "hadith_number": "3580",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Rasuah",
        "perawi_melayu": "Abdullah ibn Amr ibn al-As",
        "english_text": "Narrated Abdullah ibn Amr ibn al-As: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم cursed the one who bribes and the one who takes bribe.",
        "malay_translation": "Diriwayatkan daripada Abdullah ibn Amr ibn al-As: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم melaknat pemberi rasuah dan penerima rasuah.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، ‏‏‏‏‏‏عَنْ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرَّاشِي وَالْمُرْتَشِي ."
      },
      {
        "id": 22661,
        "hadith_number": "3581",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Menyembunyikan Harta Amanah Jawatan Walaupun Sedikit",
        "perawi_melayu": "Adi ibn Umayrah al-Kindi",
        "english_text": "Narrated Adi ibn Umayrah al-Kindi: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: O people, if any of you is put in an administrative post on our behalf and conceals from us a needle or more, he is acting unfaithfully, and will bring it on the Day of Resurrection. A black man from the Ansar, as if I am seeing him, stood and said: Messenger of Allah, take back from me my post. He asked: What is that? He replied: I heard you say such and such. He said: And I say that. If we appoint anyone to an office, he must bring what is connected with it, both little and much. What he is given, he may take, and he must refrain from what is kept away from him.",
        "malay_translation": "Diriwayatkan daripada Adi ibn Umayrah al-Kindi: Nabi Muhammad صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Wahai manusia, jika sesiapa antara kamu dilantik ke jawatan pentadbiran bagi pihak kami dan menyembunyikan daripada kami walaupun sebatang jarum atau lebih daripada itu, maka dia telah bertindak khianat, dan dia akan membawanya (harta khianat itu) pada Hari Kiamat. Seorang lelaki berkulit hitam dari Ansar, seolah-olah aku melihatnya, berdiri dan berkata: Wahai Rasulullah, tarik balik jawatan saya daripada saya. Baginda bertanya: 'Apakah itu?' Dia menjawab: 'Saya mendengar engkau bersabda begini dan begini.' Baginda bersabda: 'Dan Aku mengatakan demikian.' Jika kami melantik sesiapa ke suatu jawatan, dia hendaklah membawa segala yang berkaitan dengannya, sedikit mahupun banyak. Apa yang diberikan kepadanya, dia boleh ambil, dan dia hendaklah menahan diri daripada apa yang ditahan daripadanya.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏عَنْ إِسْمَاعِيل بْنِ أَبِي خَالِدٍ، ‏‏‏‏‏‏حَدَّثَنِي قَيْسٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي عَدِيُّ بْنُ عُمَيْرَةَ الْكِنْدِيُّ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ يَا أَيُّهَا النَّاسُ، ‏‏‏‏‏‏مَنْ عُمِّلَ مِنْكُمْ لَنَا عَلَى عَمَلٍ فَكَتَمَنَا مِنْهُ مِخْيَطًا فَمَا فَوْقَهُ فَهُوَ غُلٌّ يَأْتِي بِهِ يَوْمَ الْقِيَامَةِ، ‏‏‏‏‏‏فَقَامَ رَجُلٌ مِنِ الْأَنْصَارِ، ‏‏‏‏‏‏أَسْوَدُ كَأَنِّي أَنْظُرُ إِلَيْهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏اقْبَلْ عَنِّي عَمَلَكَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَمَا ذَاكَ ؟، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُكَ تَقُولُ:‏‏‏‏ كَذَا وَكَذَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَأَنَا أَقُولُ ذَلِكَ مَنِ اسْتَعْمَلْنَاهُ عَلَى عَمَلٍ فَلْيَأْتِ بِقَلِيلِهِ وَكَثِيرِهِ، ‏‏‏‏‏‏فَمَا أُوتِيَ مِنْهُ أَخَذَهُ وَمَا نُهِيَ عَنْهُ انْتَهَى ."
      },
      {
        "id": 22662,
        "hadith_number": "3582",
        "status": "sahih",
        "nama_buku": "Sunan Abu Daud",
        "penulis_buku": "Imam Abu Daud Sulaiman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Arahan Rasulullah kepada Ali sebagai Hakim di Yaman",
        "perawi_melayu": "Ali bin Abu Talib",
        "english_text": "Narrated Ali ibn Abu Talib: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم sent me to the Yemen as judge, and I asked: Messenger of Allah, are you sending me when I am young and have no knowledge of the duties of a judge? He replied: Allah will guide your heart and keep your tongue true. When two litigants sit in front of you, do not decide till you hear what the other has to say as you heard what the first had to say; for it is best that you should have a clear idea of the best decision. He said: I had been a judge (for long); or he said (the narrator is doubtful): I have no doubts about a decision afterwards.",
        "malay_translation": "Diriwayatkan dari Ali bin Abu Talib: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم mengutusku ke Yaman sebagai hakim, dan aku bertanya: Wahai Rasulullah, adakah engkau mengutusku sedangkan aku masih muda dan tidak memiliki pengetahuan tentang tugas-tugas seorang hakim? Baginda menjawab: Allah akan memandu hatimu dan menjaga lidahmu tetap benar. Apabila dua orang yang bersengketa duduk di hadapanmu, janganlah memutuskan perkara sehingga kamu mendengar apa yang dikatakan oleh pihak yang lain sebagaimana kamu mendengar apa yang dikatakan oleh pihak pertama; kerana itu adalah cara terbaik agar kamu memiliki gambaran yang jelas tentang keputusan yang terbaik. Beliau berkata: Aku telah menjadi hakim (untuk waktu yang lama); atau beliau berkata (perawi ragu): Aku tidak pernah ragu tentang keputusan sesudahnya.",
        "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنَا شَرِيكٌ، ‏‏‏‏‏‏عَنْ سِمَاكٍ، ‏‏‏‏‏‏عَنْ حَنَشٍ، ‏‏‏‏‏‏عَنْ عَلِيّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَمَنِ قَاضِيًا، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏تُرْسِلُنِي وَأَنَا حَدِيثُ السِّنِّ، ‏‏‏‏‏‏وَلَا عِلْمَ لِي بِالْقَضَاءِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنَّ اللَّهَ سَيَهْدِي قَلْبَكَ، ‏‏‏‏‏‏وَيُثَبِّتُ لِسَانَكَ، ‏‏‏‏‏‏فَإِذَا جَلَسَ بَيْنَ يَدَيْكَ الْخَصْمَانِ فَلَا تَقْضِيَنَّ حَتَّى تَسْمَعَ مِنِ الْآخَرِ كَمَا سَمِعْتَ مِنِ الْأَوَّلِ فَإِنَّهُ أَحْرَى أَنْ يَتَبَيَّنَ لَكَ الْقَضَاءُ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَمَا زِلْتُ قَاضِيًا أَوْ مَا شَكَكْتُ فِي قَضَاءٍ بَعْدُ."
      },
      {
        "id": 22663,
        "hadith_number": "3583",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Rasulullah SAW: Aku Hanya Manusia Biasa dan Keputusan Berdasarkan Pendengaran",
        "perawi_melayu": "Diriwayatkan daripada Umm Salamah R.A.",
        "english_text": "Umm Salamah reported the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم as saying: I am only a human being, and you bring your disputes to me, some perhaps being more eloquent in their plea than others, so that I give judgement on their behalf according to what I hear from them. Therefore, whatever I decide fr anyone which by right belongs to his brother, he must not take anything, for I am granting him only a portion of Hell.",
        "malay_translation": "Umm Salamah meriwayatkan bahawa Rasulullah SAW bersabda: Sesungguhnya aku hanyalah seorang manusia, dan kamu membawa persengketaan kamu kepadaku. Barangkali sebahagian kamu lebih petah dalam hujah mereka daripada yang lain, sehingga aku membuat keputusan bagi pihak mereka berdasarkan apa yang aku dengar daripada mereka. Oleh itu, apa sahaja yang aku putuskan untuk seseorang yang sebenarnya adalah hak saudaranya, maka janganlah dia mengambilnya, kerana sesungguhnya aku memberikan kepadanya hanya sepotong daripada neraka.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، ‏‏‏‏‏‏أَخْبَرَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ، ‏‏‏‏‏‏عَنْ أُمِّ سَلَمَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّمَا أَنَا بَشَرٌ وَإِنَّكُمْ تَخْتَصِمُونَ إِلَيَّ، ‏‏‏‏‏‏وَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَلْحَنَ بِحُجَّتِهِ مِنْ بَعْضٍ فَأَقْضِيَ لَهُ عَلَى نَحْوِ مَا أَسْمَعُ مِنْهُ، ‏‏‏‏‏‏فَمَنْ قَضَيْتُ لَهُ مِنْ حَقِّ أَخِيهِ بِشَيْءٍ فَلَا يَأْخُذْ مِنْهُ شَيْئًا، ‏‏‏‏‏‏فَإِنَّمَا أَقْطَعُ لَهُ قِطْعَةً مِنَ النَّار ."
      },
      {
        "id": 22664,
        "hadith_number": "3584",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulaiman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Penyelesaian Sengketa Warisan Tanpa Bukti Melalui Perdamaian dan Undian",
        "perawi_melayu": "Ummu Salamah",
        "english_text": "Umm Salamah said: Two men came to the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم who were disputing over their inheritance. They had no evidence except their claim. The Prophet صلی ‌اللہ ‌علیہ ‌وسلم then said in a similar way. Thereupon both the men wept and each of them said: This right of mine go to you. The Prophet صلی ‌اللہ ‌علیہ ‌وسلم then said: Now you have done whatever you have done ; do divide it up, aiming at what is right, then drew lots, and let each of you consider the other to have what is legitimately his",
        "malay_translation": "Ummu Salamah meriwayatkan: Dua orang lelaki datang kepada Rasulullah ﷺ yang bertikai mengenai harta pusaka mereka. Mereka tidak mempunyai bukti kecuali dakwaan masing-masing. Nabi ﷺ kemudian bersabda dengan cara yang serupa.  Maka kedua lelaki itu menangis dan setiap seorang dari mereka berkata: Hak saya ini adalah untuk kamu. Nabi ﷺ kemudian bersabda: Sekarang setelah kamu berdua melakukan apa yang telah kamu lakukan ini; maka bahagikanlah harta pusaka tersebut, dan berusahalah untuk berlaku adil, kemudian lakukanlah undian, dan hendaklah setiap kamu menganggap bahawa yang lain memiliki apa yang menjadi haknya yang sah.",
        "arabic_text": "حَدَّثَنَا الرَّبِيعُ بْنُ نَافِعٍ أَبُو تَوْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ الْمُبَارَكِ، ‏‏‏‏‏‏عَنْ أُسَامَةَ بْنِ زَيْدٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ رَافِعٍ مَوْلَى أُمِّ سَلَمَةَ، ‏‏‏‏‏‏عَنْأُمِّ سَلَمَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلَانِ يَخْتَصِمَانِ فِي مَوَارِيثَ لَهُمَا لَمْ تَكُنْ لَهُمَا بَيِّنَةٌ إِلَّا دَعْوَاهُمَا، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ فَذَكَرَ مِثْلَهُ، ‏‏‏‏‏‏فَبَكَى الرَّجُلَانِ، ‏‏‏‏‏‏وَقَالَ كُلُّ وَاحِدٍ مِنْهُمَا:‏‏‏‏ حَقِّي لَكَ، ‏‏‏‏‏‏فَقَالَ لَهُمَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَمَّا إِذْ فَعَلْتُمَا مَا فَعَلْتُمَا، ‏‏‏‏‏‏فَاقْتَسِمَا وَتَوَخَّيَا الْحَقَّ، ‏‏‏‏‏‏ثُمَّ اسْتَهَمَا، ‏‏‏‏‏‏ثُمَّ تَحَالَّا."
      },
      {
        "id": 22665,
        "hadith_number": "3585",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Keputusan Nabi Berdasarkan Pendapat dalam Ketiadaan Wahyu",
        "perawi_melayu": "Umm Salamah",
        "english_text": "Umm Salamah reported the Prophet صلی ‌اللہ ‌علیہ ‌وسلم as saying when two men were disputing over inheritance and old things: I decide between you on the basis of my opinion in cases about which no revelation has been sent down to me.",
        "malay_translation": "Umm Salamah meriwayatkan bahawa Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda ketika dua orang lelaki bertikai mengenai harta pusaka dan perkara-perkara lama: Aku memutuskan antara kamu berdua berdasarkan pendapatku dalam perkara-perkara yang tidak diturunkan wahyu kepadaku mengenainya.",
        "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ، ‏‏‏‏‏‏أَخْبَرَنَا عِيسَى، ‏‏‏‏‏‏حَدَّثَنَا أُسَامَةُ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ رَافِعٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ أُمَّ سَلَمَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏بِهَذَا الْحَدِيث، ‏‏‏‏‏‏قَالَ:‏‏‏‏ يَخْتَصِمَانِ فِي مَوَارِيثَ وَأَشْيَاءَ قَدْ دَرَسَتْ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنِّي إِنَّمَا أَقْضِي بَيْنَكُمْ بِرَأْيِي فِيمَا لَمْ يُنْزَلْ عَلَيَّ فِيهِ."
      },
      {
        "id": 22666,
        "hadith_number": "3586",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Pendapat Rasulullah SAW Adalah Benar Kerana Wahyu, Pendapat Kita Sangkaan Semata-mata",
        "perawi_melayu": "Umar bin al-Khattab",
        "english_text": "Narrated Umar ibn al-Khattab: Umar said while he was (sitting) on the pulpit: O people, the opinion from the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم was right, because Allah showed (i. e. inspired) him; but from us it is sheer conjecture and artifice.",
        "malay_translation": "Diriwayatkan daripada Umar bin al-Khattab: Umar berkata ketika beliau (duduk) di atas mimbar: Wahai manusia, pendapat daripada Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم adalah benar, kerana Allah memperlihatkan (yakni mengilhamkan) kepadanya; tetapi daripada kami ia hanyalah sangkaan dan rekaan semata-mata.",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ، ‏‏‏‏‏‏أَخْبَرَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏عَنْ يُونُسَ بْنِ يَزِيدَ، ‏‏‏‏‏‏عَنِ ابْنِ شِهَابٍ، ‏‏‏‏‏‏أَنَّ عُمَرَ بْنَ الْخَطَّابِرَضِيَ اللَّهُ عَنْهُ، ‏‏‏‏‏‏قَالَوَ هُوَ عَلَى الْمِنْبَر:‏‏‏‏ يَا أَيُّهَا النَّاسُ، ‏‏‏‏‏‏إِنَّ الرَّأْيَ إِنَّمَا كَانَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُصِيبًا لِأَنَّ اللَّهَ كَانَ يُرِيهِ وَإِنَّمَا هُوَ مِنَّا الظَّنُّ وَالتَّكَلُّفُ ."
      },
      {
        "id": 22667,
        "hadith_number": "3587",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Daud",
        "penulis_buku": "Imam Abu Daud Sulaiman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Keutamaan Abu Uthman al-Shami",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Muadh bin Muadh said: Abu Uthman al-Shami, whose name is Hariz bin Uthman, told me. I think I did not see anyone from Syria better than him.",
        "malay_translation": "Muadh bin Muadh berkata: Abu Uthman al-Shami, yang namanya Hariz bin Uthman, memberitahu saya. Saya rasa saya tidak melihat sesiapa pun dari Syria yang lebih baik daripadanya.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ، ‏‏‏‏‏‏أَخْبَرَنَا مُعَاذُ بْنُ مُعَاذٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي أَبُو عُثْمَانَ الشَّامِيُّ وَلَا إِخَالُنِي رَأَيْتُ شَأْمِيًّا أَفْضَلَ مِنْهُ يَعْنِي حُرَيْزَ بْنَ عُثْمَانَ."
      },
      {
        "id": 22668,
        "hadith_number": "3588",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Pihak Bertikai Didudukkan di Hadapan Hakim",
        "perawi_melayu": "Abdullah ibn az-Zubayr",
        "english_text": "Narrated Abdullah ibn az-Zubayr: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم gave the decision that the two adversaries should be made to sit in front of the judge.",
        "malay_translation": "Diriwayatkan oleh Abdullah ibn az-Zubayr: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم membuat keputusan bahawa dua pihak yang bertikai harus didudukkan di hadapan hakim.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، ‏‏‏‏‏‏حَدَّثَنَا مُصْعَبُ بْنُ ثَابِتٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ الْخَصْمَيْنِ يَقْعُدَانِ بَيْنَ يَدَيِ الْحَكَمِ ."
      },
      {
        "id": 22669,
        "hadith_number": "3589",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulaiman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Menghakimi Ketika Marah",
        "perawi_melayu": "Abu Bakrah RA",
        "english_text": "Abdur-Rahman bin Abi Bakrah reported on the authority of his father that he wrote to his son: The Messenger of Allah صلى ‌اللہ ‌علیہ ‌وسلم said: A judge should not decide between the two while he is in anger.",
        "malay_translation": "Abdur-Rahman bin Abi Bakrah meriwayatkan daripada ayahnya bahawa dia menulis kepada anaknya: Rasulullah صلى ‌اللہ ‌علیہ ‌وسلم bersabda: Seorang hakim tidak boleh memutuskan antara dua pihak ketika dia sedang marah.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، ‏‏‏‏‏‏أَخْبَرَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏أَنَّهُ كَتَبَ إِلَى ابْنِهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا يَقْضِي الْحَكَمُ بَيْنَ اثْنَيْنِ، ‏‏‏‏‏‏وَهُوَ غَضْبَانُ ."
      },
      {
        "id": 22670,
        "hadith_number": "3590",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Ayat Al-Quran Dimansukhkan",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Ibn Abbas said: The Quranic verse: If they do come to thee, either judge between them, or decline to interfere was abrogated by the verse: So judge between them by what Allah hath revealed.",
        "malay_translation": "Ibnu Abbas berkata: Ayat Al-Quran: Jika mereka datang kepadamu, maka hukumlah di antara mereka atau berpalinglah dari mereka telah dimansukhkan oleh ayat: Maka hukumlah di antara mereka dengan apa yang telah Allah turunkan.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ الْمَرْوَزِيُّ، ‏‏‏‏‏‏حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ يَزِيدَ النَّحْوِيِّ، ‏‏‏‏‏‏عَنِ عِكْرِمَةَ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَإِنْ جَاءُوكَ فَاحْكُمْ بَيْنَهُمْ أَوْ أَعْرِضْ عَنْهُمْ سورة المائدة آية 42، ‏‏‏‏‏‏فَنُسِخَتْ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَاحْكُمْ بَيْنَهُمْ بِمَا أَنْزَلَ اللَّهُ سورة المائدة آية 48 ."
      },
      {
        "id": 22671,
        "hadith_number": "3591",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Kesaksamaan Diyat antara Bani Nadhir dan Bani Quraizah",
        "perawi_melayu": "Abdullah ibn Abbas",
        "english_text": "Narrated Abdullah ibn Abbas: When this verse was revealed: If they do come to thee, either judge between them, or decline to interfere. . . . If thou judge, judge in equity between them. Banu an-Nadir used to pay half blood-money if they killed any-one from Banu Qurayzah. When Banu Qurayzah killed anyone from Banu an-Nadir, they would pay full blood-money. So the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم made it equal between them.",
        "malay_translation": "Diriwayatkan daripada Abdullah ibn Abbas: Ketika ayat ini diturunkan: 'Jika mereka datang kepadamu (untuk meminta keputusan), maka hukumlah antara mereka atau berpalinglah daripada mereka. ... Jika engkau menghukum, maka hukumlah antara mereka dengan adil.' (Surah al-Maidah: 42). Bani Nadhir dahulu membayar separuh diyat (wang tebusan darah) jika mereka membunuh seseorang daripada Bani Quraizah. Apabila Bani Quraizah membunuh seseorang daripada Bani Nadhir, mereka akan membayar diyat penuh. Maka Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم menyamakan (hukum) antara mereka.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ إِسْحَاق، ‏‏‏‏‏‏عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، ‏‏‏‏‏‏عَنْعِكْرِمَةَ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَمَّا نَزَلَتْ هَذِهِ الْآيَةُ فَإِنْ جَاءُوكَ فَاحْكُمْ بَيْنَهُمْ أَوْ أَعْرِضْ عَنْهُمْ سورة المائدة آية 42، ‏‏‏‏‏‏وَإِنْ حَكَمْتَ فَاحْكُمْ بَيْنَهُمْ بِالْقِسْطِ سورة المائدة آية 42، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ بَنُو النَّضِيرِ إِذَا قَتَلُوا مِنْ بَنِي قُرَيْظَةَ أَدَّوْا نِصْفَ الدِّيَةِ، ‏‏‏‏‏‏وَإِذَا قَتَلَ بَنُو قُرَيْظَةَ مِنْ بَنِي النَّضِيرِ أَدَّوْا إِلَيْهِمُ الدِّيَةَ كَامِلَةً، ‏‏‏‏‏‏فَسَوَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَهُمْ ."
      },
      {
        "id": 22672,
        "hadith_number": "3592",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Panduan Menghakimi Menurut Al-Quran dan Sunnah",
        "perawi_melayu": "Beberapa sahabat Muadh bin Jabal",
        "english_text": "Some companions of Muadh ibn Jabal said: When the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم intended to send Muadh ibn Jabal to the Yemen, he asked: How will you judge when the occasion of deciding a case arises? He replied: I shall judge in accordance with Allah's Book. He asked: (What will you do) if you do not find any guidance in Allah's Book? He replied: (I shall act) in accordance with the Sunnah of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم. He asked: (What will you do) if you do not find any guidance in the Sunnah of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم and in Allah's Book? He replied: I shall do my best to form an opinion and I shall spare no effort. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم then patted him on the breast and said: Praise be to Allah Who has helped the messenger of the Messenger of Allah to find something which pleases the Messenger of Allah.",
        "malay_translation": "Beberapa sahabat Muadh bin Jabal berkata: Ketika Rasulullah ﷺ berhasrat untuk mengutus Muadh bin Jabal ke Yaman, baginda bertanya: \"Bagaimana kamu akan menghakimi apabila timbul keperluan untuk memutuskan suatu kes?\" Beliau menjawab: \"Saya akan menghakimi berdasarkan Kitab Allah.\" Baginda bertanya: \"(Apa yang akan kamu lakukan) jika kamu tidak menemukan panduan dalam Kitab Allah?\" Beliau menjawab: \"(Saya akan bertindak) berdasarkan Sunnah Rasulullah ﷺ.\" Baginda bertanya: \"(Apa yang akan kamu lakukan) jika kamu tidak menemukan panduan dalam Sunnah Rasulullah ﷺ dan dalam Kitab Allah?\" Beliau menjawab: \"Saya akan berusaha sebaik mungkin untuk membentuk pendapat dan saya tidak akan berusaha sedikit pun.\" Rasulullah ﷺ kemudian menepuk dadanya dan bersabda: \"Segala puji bagi Allah yang telah membantu utusan Rasulullah untuk menemukan sesuatu yang menyenangkan Rasulullah.\"",
        "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، ‏‏‏‏‏‏عَنْ شُعْبَةَ، ‏‏‏‏‏‏عَنْ أَبِي عَوْنٍ، ‏‏‏‏‏‏عَنِ الْحَارِثِ بْنِ عَمْرِو أَخِي الْمُغِيرَةِ بْنِ شُعْبَةَ، ‏‏‏‏‏‏عَنْ أُنَاسٍ مِنْ أَهْلِ حِمْصَ، ‏‏‏‏‏‏مِنْ أَصْحَابِ مُعَاذِ بْنِ جَبَلٍ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏لَمَّا أَرَادَ أَنْ يَبْعَثَ مُعَاذًا إِلَى الْيَمَنِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَيْفَ تَقْضِي إِذَا عَرَضَ لَكَ قَضَاءٌ ؟، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَقْضِي بِكِتَابِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَإِنْ لَمْ تَجِدْ فِي كِتَابِ اللَّهِ ؟، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَبِسُنَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَإِنْ لَمْ تَجِدْ فِي سُنَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَلَا فِي كِتَابِ اللَّهِ ؟، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَجْتَهِدُ رَأْيِي وَلَا آلُو، ‏‏‏‏‏‏فَضَرَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَدْرَهُ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ الْحَمْدُ لِلَّهِ الَّذِي وَفَّقَ رَسُولَ رَسُولِ اللَّهِ لِمَا يُرْضِي رَسُولَ اللَّهِ ."
      },
      {
        "id": 22673,
        "hadith_number": "3593",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Muadh bin Jabal Diutus ke Yaman",
        "perawi_melayu": "Muadh bin Jabal",
        "english_text": "Muadh bin Jabal said that when the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم sent him to the Yemen. . . He then narrated the rest of the tradition to the same effect.",
        "malay_translation": "Muadh bin Jabal meriwayatkan bahawa ketika Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم mengutusnya ke Yaman. . . Kemudian beliau meriwayatkan sisa hadis dengan maksud yang sama.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏عَنْ شُعْبَةَ، ‏‏‏‏‏‏حَدَّثَنِي أَبُو عَوْنٍ، ‏‏‏‏‏‏عَنْ الْحَارِثِ بْنِ عَمْرٍو، ‏‏‏‏‏‏عَنْ نَاسٍ، ‏‏‏‏‏‏مِنْ أَصْحَابِ مُعَاذٍ،‏‏‏‏عَنْمُعَاذِ بْنِ جَبَلٍ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏لَمَّا بَعَثَهُ إِلَى الْيَمَنِ، ‏‏‏‏‏‏فَذَكَرَ مَعْنَاهُ."
      },
      {
        "id": 22674,
        "hadith_number": "3594",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Perdamaian Antara Muslim",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Narrated Abu Hurairah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Conciliation between Muslims is permissible. The narrator Ahmad added in his version: except the conciliation which makes lawful unlawful and unlawful lawful. Sulayman ibn Dawud added: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said: Muslims are on (i. e. stick to) their conditions.",
        "malay_translation": "Diriwayatkan dari Abu Hurairah: Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Perdamaian antara umat Islam adalah dibolehkan. Perawi Ahmad menambahkan dalam riwayatnya: kecuali perdamaian yang menghalalkan yang haram dan mengharamkan yang halal. Sulaiman ibn Dawud menambahkan: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Umat Islam terikat dengan syarat-syarat mereka.",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ، ‏‏‏‏‏‏أَخْبَرَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏أَخْبَرَنِي سُلَيْمَانُ بْنُ بِلَالٍ. ح وحَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ الْوَاحِدِ الدِّمَشْقِيُّ، ‏‏‏‏‏‏حَدَّثَنَا مَرْوَانُ يَعْنِي ابْنَ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ، ‏‏‏‏‏‏أَوْ عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ شَكَّ الشَّيْخُ، ‏‏‏‏‏‏عَنْ كَثِيرِ بْنِ زَيْدٍ، ‏‏‏‏‏‏عَنِ الْوَلِيدِ بْنِ رَبَاحٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الصُّلْحُ جَائِزٌ بَيْنَ الْمُسْلِمِينَ ، ‏‏‏‏‏‏زَادَ أَحْمَدُ إِلَّا صُلْحًا أَحَلَّ حَرَامًا، ‏‏‏‏‏‏أَوْ حَرَّمَ حَلَالًا وَزَادَ سُلَيْمَانُ بْنُ دَاوُدَ، ‏‏‏‏‏‏وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْمُسْلِمُونَ عَلَى شُرُوطِهِمْ."
      },
      {
        "id": 22675,
        "hadith_number": "3595",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Galakan Mengurangkan Hutang",
        "perawi_melayu": "Kab bin Malik",
        "english_text": "Kab bin Malik said that in the time of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم he made demand in the mosque for payment of a debt due to him from Ibn Abi Hadrad, and their voices rose till the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم, who was in his house, heard them. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم then went out to them and, removing the curtain of his apartment, he called to Kab bin Malik, addressing: Kab! He said: At your service, Messenger of Allah. Thereupon he made a gesture with is hand indicating: Remit half the debt due to you. Kab said: I shall do so, Messenger of Allah. The Prophet صلی ‌اللہ ‌علیہ ‌وسلم then said: Get up and discharge",
        "malay_translation": "Kab bin Malik meriwayatkan bahawa pada zaman Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم, beliau menuntut pembayaran hutang daripada Ibn Abi Hadrad di masjid, dan suara mereka berdua meninggi sehingga Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم yang berada di rumahnya mendengar mereka. Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم kemudian keluar menemui mereka, dan dengan menyingkap tabir biliknya, beliau memanggil Kab bin Malik, seraya bersabda: Wahai Kab! Kab menjawab: Saya patuh, wahai Rasulullah. Baginda kemudian memberi isyarat dengan tangannya yang bermaksud: Kurangkan separuh daripada hutangmu. Kab berkata: Saya akan melakukannya, wahai Rasulullah. Nabi صلی ‌اللہ ‌علیہ ‌وسلم kemudian bersabda: Bangun dan lunaskanlah.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏أَخْبَرَنِي يُونُسُ، ‏‏‏‏‏‏عَنِ ابْنِ شِهَابٍ، ‏‏‏‏‏‏أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ كَعْبِ بْنِ مَالِكٍ، ‏‏‏‏‏‏أَنَّكَعْبَ بْنَ مَالِكٍ أَخْبَرَهُ، أَنَّهُ تَقَاضَى ابْنَ أَبِي حَدْرَدٍ دَيْنًا كَانَ لَهُ عَلَيْهِ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ، ‏‏‏‏‏‏فَارْتَفَعَتْ أَصْوَاتُهُمَا، ‏‏‏‏‏‏حَتَّى سَمِعَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي بَيْتِهِ، ‏‏‏‏‏‏فَخَرَجَ إِلَيْهِمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى كَشَفَ سِجْفَ حُجْرَتِهِ، ‏‏‏‏‏‏وَنَادَى كَعْبَ بْنَ مَالِكٍ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا كَعْبُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ لَبَّيْكَ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏فَأَشَارَ لَه بِيَدِهِ أَنْ ضَعِ الشَّطْرَ مِنْ دَيْنِكَ، ‏‏‏‏‏‏قَالَ كَعْبٌ:‏‏‏‏ قَدْ فَعَلْتُ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ قُمْ فَاقْضِهِ ."
      },
      {
        "id": 22676,
        "hadith_number": "3596",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawood Sulaiman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Sebaik-baik Saksi Adalah yang Memberi Keterangan Sebelum Diminta",
        "perawi_melayu": "Zaid bin Khalid al-Juhani",
        "english_text": "Zaid bin Khalid al-Juhani reported the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم as saying: Shall I not tell you of the best witnesses ? He is the one who produces his deposition or gives his evidence (the narrator is doubtful) before he is asked for it. Abdullah bin Abi Bakr dobted which of them he said. Abu Dawud said: Malis said: This refers to a man gives his evidence, but he does not know for whom it is meant. Al-Hamdani said: He should inform the authorities. Ibn al-Sarh said: He should give it to the ruler. The work ikhbar (inform) occurs in the version of al-Hamdani. Ibn al-Sarh said: Ibn Abi Amrah and not Abdur-Rahman.",
        "malay_translation": "Zaid bin Khalid al-Juhani meriwayatkan bahawa Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: “Mahukah aku memberitahu kamu tentang sebaik-baik saksi? Iaitu orang yang mengemukakan pengakuannya atau memberikan keterangannya (perawi ragu-ragu) sebelum dia diminta untuk itu.” Abdullah bin Abi Bakr ragu-ragu yang mana satu yang baginda sabdakan. Abu Daud berkata: Malis berkata: Ini merujuk kepada seorang lelaki yang memberikan keterangannya, tetapi dia tidak tahu untuk siapa keterangan itu dimaksudkan. Al-Hamdani berkata: Dia hendaklah memaklumkan pihak berkuasa. Ibn al-Sarh berkata: Dia hendaklah memberikannya kepada pemerintah. Perkataan ikhbar (memaklumkan) terdapat dalam versi al-Hamdani. Ibn al-Sarh berkata: Ibn Abi Amrah dan bukan Abdur-Rahman.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الْهَمَدَانِيُّ، ‏‏‏‏‏‏وأَحْمَدُ بْنُ السَّرْحِ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ أَخْبَرَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، ‏‏‏‏‏‏أَنَّ أَبَاهُ أَخْبَرَهُ، ‏‏‏‏‏‏أَنَّ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ عُثْمَانَ بْنِ عَفَّانَ أَخْبَرَهُ، ‏‏‏‏‏‏أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَبِي عَمْرَةَ الْأَنْصَارِيَّ أَخْبَرَهُ، ‏‏‏‏‏‏أَنَّ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ أَخْبَرَهُ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَلَا أُخْبِرُكُمْ بِخَيْرِ الشُّهَدَاءِ الَّذِي يَأْتِي بِشَهَادَتِهِ أَوْ يُخْبِرُ بِشَهَادَتِهِ قَبْلَ أَنْ يُسْأَلَهَا شَكَّ عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ أَيَّتَهُمَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ أَبُو دَاوُد:‏‏‏‏ قَالَ مَالِكٌ:‏‏‏‏ الَّذِي يُخْبِرُ بِشَهَادَتِهِ وَلَا يَعْلَمُ بِهَا الَّذِي هِيَ لَهُ، ‏‏‏‏‏‏قَالَ الْهَمَدَانِيُّ:‏‏‏‏ وَيَرْفَعُهَا إِلَى السُّلْطَانِ، ‏‏‏‏‏‏قَالَ ابْنُ السَّرْحِ:‏‏‏‏ أَوْ يَأْتِي بِهَا الْإِمَامَ وَالْإِخْبَارُ فِي حَدِيثِ الْهَمَدَانِيِّ، ‏‏‏‏‏‏قَالَ ابْنُ السَّرْحِ:‏‏‏‏ ابْنُ أَبِي عَمْرَةَ، ‏‏‏‏‏‏لَمْ يَقُلْ عَبْدَ الرَّحْمَنِ."
      },
      {
        "id": 22677,
        "hadith_number": "3597",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Menghalang Hukuman Allah, Membantah Kebatilan, dan Tuduhan Palsu Terhadap Muslim",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Yahya ibn Rashid said: We were sitting waiting for Abdullah ibn Umar who came out to us and sat. He then said: I heard the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم as saying: If anyone's intercession intervenes as an obstacle to one of the punishments prescribed by Allah, he has opposed Allah; if anyone disputes knowingly about something which is false, he remains in the displeasure of Allah till he desists, and if anyone makes an untruthful accusation against a Muslim, he will be made by Allah to dwell in the corrupt fluid flowing from the inhabitants of Hell till he retracts his statement.",
        "malay_translation": "Yahya ibn Rashid berkata: Kami sedang duduk menunggu Abdullah ibn Umar yang keluar kepada kami dan duduk. Kemudian beliau berkata: Saya mendengar Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Jika syafaat seseorang menjadi penghalang kepada salah satu hukuman yang ditetapkan oleh Allah, maka dia telah menentang Allah; jika seseorang membantah dengan sengaja tentang sesuatu yang batil, dia tetap dalam kemurkaan Allah hingga dia berhenti, dan jika seseorang membuat tuduhan palsu terhadap seorang Muslim, dia akan ditempatkan oleh Allah di dalam cairan busuk yang mengalir dari penduduk Neraka hingga dia menarik balik perkataannya.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، ‏‏‏‏‏‏حَدَّثَنَا زُهَيْرٌ، ‏‏‏‏‏‏حَدَّثَنَا عُمَارَةَ بْنِ غَزِيَّةَ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ رَاشِدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ جَلَسْنَا لِعَبْدِ اللَّهِ بْنِ عُمَرَ، ‏‏‏‏‏‏فَخَرَجَ إِلَيْنَا فَجَلَسَ،‏‏‏‏فَقَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ مَنْ حَالَتْ شَفَاعَتُهُ دُونَ حَدٍّ مِنْ حُدُودِ اللَّهِ فَقَدْ ضَادَّ اللَّهَ، ‏‏‏‏‏‏وَمَنْ خَاصَمَ فِي بَاطِلٍ وَهُوَ يَعْلَمُهُ لَمْ يَزَلْ فِي سَخَطِ اللَّهِ حَتَّى يَنْزِعَ عَنْهُ، ‏‏‏‏‏‏وَمَنْ قَالَ فِي مُؤْمِنٍ مَا لَيْسَ فِيهِ أَسْكَنَهُ اللَّهُ رَدْغَةَ الْخَبَالِ، ‏‏‏‏‏‏حَتَّى يَخْرُجَ مِمَّا قَالَ ."
      },
      {
        "id": 22678,
        "hadith_number": "3598",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Daud",
        "penulis_buku": "Imam Abu Daud Sulaiman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Membantu dalam Pertikaian Secara Zalim",
        "perawi_melayu": "-",
        "english_text": "The tradition mentioned above has also been transmitted by Ibn Umar from the Prophet صلی ‌اللہ ‌علیہ ‌وسلم through different chain of narrators to the same effect. In this version he also said: He who assits in a dispute unjustly deserves the anger of Allah, Most High.",
        "malay_translation": "Hadis yang disebutkan di atas juga telah diriwayatkan oleh Ibn Umar daripada Nabi صلی ‌اللہ ‌علیہ ‌وسلم melalui rangkaian perawi yang berbeza dengan maksud yang sama. Dalam versi ini, baginda juga bersabda: Sesiapa yang membantu dalam pertikaian secara tidak adil, maka dia berhak mendapat kemurkaan Allah, Yang Maha Tinggi.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ الْحُسَيْنِ بْنِ إِبْرَاهِيمَ، ‏‏‏‏‏‏حَدَّثَنَا عُمَرُ بْنُ يُونُسَ، ‏‏‏‏‏‏حَدَّثَنَا عَاصِمُ بْنُ مُحَمَّدِ بْنِ زَيْدٍ الْعُمَرِيُّ، ‏‏‏‏‏‏حَدَّثَنِي الْمُثَنَّى بْنُ يَزِيدٍ، ‏‏‏‏‏‏عَنْ مَطَرٍ الْوَرَّاقِ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَمَنْ أَعَانَ عَلَى خُصُومَةٍ بِظُلْمٍ، ‏‏‏‏‏‏فَقَدْ بَاءَ بِغَضَبٍ مِنَ اللَّهِ عَزَّ وَجَلَّ."
      },
      {
        "id": 22679,
        "hadith_number": "3599",
        "status": "sahih",
        "nama_buku": "Sunan Abu Daud",
        "penulis_buku": "Imam Abu Dawud Sulaiman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Saksi Dusta Setara dengan Syirik kepada Allah",
        "perawi_melayu": "Khuraym Ibn Fatik",
        "english_text": "Narrated Khuraym Ibn Fatik: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم offered the morning prayer. When he finished it, he stood up and said three times: False witness has been made equivalent to attributing a partner to Allah. He then recited: So avoid the abomination of idols and avoid speaking falsehood as people pure of faith to Allah, not associating anything with Him.",
        "malay_translation": "Diriwayatkan oleh Khuraym Ibn Fatik: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم menunaikan solat Subuh. Apabila baginda selesai solat, baginda berdiri dan bersabda sebanyak tiga kali: Saksi dusta telah disetarakan dengan menyekutukan Allah. Kemudian baginda membaca: Maka jauhilah kekejian penyembahan berhala dan jauhilah perkataan dusta sebagai orang-orang yang ikhlas kepada Allah, tidak mempersekutukan sesuatu pun dengan-Nya.",
        "arabic_text": "حَدَّثَنِي يَحْيَى بْنُ مُوسَى الْبَلْخِيُّ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، ‏‏‏‏‏‏حَدَّثَنِي سُفْيَانُ يَعْنِي الْعُصْفُرِيَّ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ حَبِيبِ بْنِ النُّعْمَانِ الْأَسَدِيِّ، ‏‏‏‏‏‏عَنْ خُرَيْمِ بْنِ فَاتِكٍ، ‏‏‏‏‏‏قَال:‏‏‏‏ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الصُّبْحِ، ‏‏‏‏‏‏فَلَمَّا انْصَرَفَ قَامَ قَائِمًا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ عُدِلَتْ شَهَادَةُ الزُّورِ، ‏‏‏‏‏‏بِالْإِشْرَاكِ بِاللَّهِ ثَلَاثَ مِرَارٍ، ‏‏‏‏‏‏ثُمَّ قَرَأَ:‏‏‏‏ فَاجْتَنِبُوا الرِّجْسَ مِنَ الأَوْثَانِ وَاجْتَنِبُوا قَوْلَ الزُّورِ ‏‏‏‏ 30 ‏‏‏‏ حُنَفَاءَ لِلَّهِ غَيْرَ مُشْرِكِينَ بِهِ سورة الحج آية 29-30 ."
      },
      {
        "id": 22680,
        "hadith_number": "3600",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Penolakan Kesaksian Pengkhianat, Pendendam dan Orang Tanggungan",
        "perawi_melayu": "Amr bin Shuaib, daripada bapanya, daripada datuknya",
        "english_text": "Amr bin Shuaib on his father's authority told that his grandfather said: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم rejected the testimony of a deceitful man and woman, of one who harbours rancour against his brother, and he rejected the testimony of one who is dependent on a family, and he allowed his testimony for other. Abu Dawud said: Ghimr means malice and enimity ; qani (dependant), a subordinate servant like a special servant.",
        "malay_translation": "Amr bin Shuaib, daripada bapanya, meriwayatkan bahawa datuknya berkata: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم menolak kesaksian lelaki dan perempuan pengkhianat, orang yang menyimpan dendam terhadap saudaranya, dan baginda menolak kesaksian orang yang bergantung kepada keluarga, dan baginda membenarkan kesaksiannya untuk orang lain. Abu Dawood berkata: 'Ghimr' bermaksud kedengkian dan permusuhan; 'qani' (tanggungan), seorang pelayan bawahan seperti pelayan khas.",
        "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ رَاشِدٍ، ‏‏‏‏‏‏حَدَّثَنَا سُلَيْمَانُ بْنُ مُوسَى، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْجَدِّهِ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَدَّ شَهَادَةَ الْخَائِنِ، ‏‏‏‏‏‏وَالْخَائِنَةِ، ‏‏‏‏‏‏وَذِي الْغِمْرِ عَلَى أَخِيهِ، ‏‏‏‏‏‏وَرَدَّ شَهَادَةَ الْقَانِعِ لِأَهْلِ الْبَيْتِ، ‏‏‏‏‏‏وَأَجَازَهَا لِغَيْرِهِمْ ، ‏‏‏‏‏‏قَالَ أَبُو دَاوُد:‏‏‏‏ الْغِمْرُ الْحِنَةُ، ‏‏‏‏‏‏وَالشَّحْنَاءُ، ‏‏‏‏‏‏وَالْقَانِعُ الْأَجِيرُ التَّابِعُ مِثْلُ الْأَجِيرِ الْخَاصِّ."
      },
      {
        "id": 22681,
        "hadith_number": "3601",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Kesaksian Orang Penipu, Penzina, dan Pendendam Tidak Diterima",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "The tradition mentioned above (No. 3593) has also been transmitted by Sulayman ibn Musa through a different chain of narrators. This version has: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said: The testimony of a deceitful man or woman, of an adulterer and adulteress, and of one who harbours rancour against his brother is not allowable.",
        "malay_translation": "Hadis yang disebutkan di atas (No. 3593) juga telah diriwayatkan oleh Sulayman ibn Musa melalui sanad yang berbeza. Versi ini menyebutkan: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Kesaksian seorang lelaki atau wanita penipu, penzina lelaki dan perempuan, dan orang yang menyimpan dendam terhadap saudaranya tidak dibenarkan.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ خَلَفِ بْنِ طَارِقٍ الرَّازِيُّ، ‏‏‏‏‏‏حَدَّثَنَا زَيْدُ بْنُ يَحْيَى بْنِ عُبَيْدٍ الْخُزَاعِيُّ، ‏‏‏‏‏‏حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ، ‏‏‏‏‏‏عَنْ سُلَيْمَانَ بْنِ مُوسَى، ‏‏‏‏‏‏بِإِسْنَادِهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تَجُوزُ شَهَادَةُ خَائِنٍ، ‏‏‏‏‏‏وَلَا خَائِنَةٍ، ‏‏‏‏‏‏وَلَا زَانٍ، ‏‏‏‏‏‏وَلَا زَانِيَةٍ، ‏‏‏‏‏‏وَلَا ذِي غِمْرٍ عَلَى أَخِيهِ ."
      },
      {
        "id": 22682,
        "hadith_number": "3602",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Kesaksian Badwi Terhadap Penduduk Kota Tidak Dibenarkan",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Narrated Abu Hurairah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: The testimony of a nomad Arab against a townsman is not allowable.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah: Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Kesaksian seorang Arab badwi terhadap penduduk kota tidak dibenarkan.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الْهَمَدَانِيُّ، ‏‏‏‏‏‏أَخْبَرَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏أَخْبَرَنِي يَحْيَى بْنُ أَيُّوبَ، ‏‏‏‏‏‏وَنَافِعُ بْنُ يَزِيدَ، ‏‏‏‏‏‏عَنِ ابْنِ الْهَادِ، ‏‏‏‏‏‏عَنْمُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، ‏‏‏‏‏‏عَنْ عَطَاءِ بْنِ يَسَارٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ لَا تَجُوزُ شَهَادَةُ بَدَوِيٍّ عَلَى صَاحِبِ قَرْيَةٍ ."
      },
      {
        "id": 22683,
        "hadith_number": "3603",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Wanita Hitam Mengaku Menyusukan Pasangan, membawa kepada perpisahan",
        "perawi_melayu": "Uqbah bin al-Harith",
        "english_text": "Uqbah bin al-Harith said: I married Umm Yahya daughter of Abu Ihab. A black woman entered upon us. She said that she had suckled both of us. So I came to the Prophet صلی ‌اللہ ‌علیہ ‌وسلم, and amentioned it to him. He turned away from me. I said (to him): Messenger of Allah! she is a liar. He said: What do you know? She has said what she has said. Separate yourself from her (wife).",
        "malay_translation": "Uqbah bin al-Harith berkata: Saya telah mengahwini Umm Yahya, anak perempuan Abu Ihab. Seorang wanita berkulit hitam datang kepada kami. Dia berkata bahawa dia telah menyusukan kami berdua. Maka saya datang kepada Nabi صلی ‌اللہ ‌علیہ ‌وسلم, dan memberitahu baginda tentang perkara itu. Baginda berpaling daripada saya. Saya berkata (kepada baginda): Wahai Rasulullah! Sesungguhnya dia seorang pendusta. Baginda bersabda: Apa yang kamu tahu? Dia telah berkata apa yang telah dia katakan. Pisahkan dirimu daripadanya (isterimu).",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، ‏‏‏‏‏‏عَنْ أَيُّوبَ، ‏‏‏‏‏‏عَنِ ابْنِ أَبِي مُلَيْكَةَ، ‏‏‏‏‏‏حَدَّثَنِي عُقْبَةُ بْنُ الْحَارِثِ، ‏‏‏‏‏‏وَحَدَّثَنِيهِصَاحِبٌ لِي عَنْهُ، ‏‏‏‏‏‏وَأَنَا لِحَدِيثِ صَاحِبِي أَحْفَظُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ تَزَوَّجْتُ أُمَّ يَحْيَى بِنْتَ أَبِي إِهَابٍ، ‏‏‏‏‏‏فَدَخَلَتْ عَلَيْنَا امْرَأَةٌ سَوْدَاءُ، ‏‏‏‏‏‏فَزَعَمَتْ أَنَّهَا أَرْضَعَتْنَا جَمِيعًا، ‏‏‏‏‏‏فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَذَكَرْتُ ذَلِكَ لَهُ فَأَعْرَضَ عَنِّي، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِنَّهَا لَكَاذِبَةٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَمَا يُدْرِيكَ ؟ وَقَدْ قَالَتْ:‏‏‏‏ مَا قَالَتْ دَعْهَا عَنْكَ ."
      },
      {
        "id": 22684,
        "hadith_number": "3604",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Penyampaian Hadis oleh Uqbah bin al-Harith melalui Rantaian Perawi yang Berbeza",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "The tradition mentioned above has also been transmitted by Uqbah bin al-Harith to the same effect through a different chain of narrators. Abu Dawud said: Hammad bin Zaid looked at al-Harith bin Umair and said: He is from reliable narrators from Ayyub.",
        "malay_translation": "Hadis yang disebutkan di atas juga telah diriwayatkan oleh Uqbah bin al-Harith dengan maksud yang sama melalui rangkaian perawi yang berbeza. Abu Dawud berkata: Hammad bin Zaid melihat kepada al-Harith bin Umair dan berkata: Beliau adalah daripada perawi yang dipercayai daripada Ayyub.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ الْحَرَّانِيُّ، ‏‏‏‏‏‏حَدَّثَنَا الْحَارِثُ بْنُ عُمَيْرٍ الْبَصْرِيُّ. ح وحَدَّثَنَا عُثْمُانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَاإِسْمَاعِيل ابْنُ عُلَيَّةَ كِلَاهُمَا، ‏‏‏‏‏‏عَنْ أَيُّوبَ، ‏‏‏‏‏‏عَنِ ابْنِ أَبِي مُلَيْكَةَ،‏‏‏‏عَنْ عُبَيْدِ بْنِ أَبِي مَرْيَمَ، ‏‏‏‏‏‏عَنْ عُقْبَةَ بْنِ الْحَارِثِ، ‏‏‏‏‏‏وَقَدْ سَمِعْتُهُ مِنْ عُقْبَةَ، ‏‏‏‏‏‏وَلَكِنِّي لِحَدِيثِ عُبَيْدٍ أَحْفَظُ فَذَكَرَ مَعْنَاهُ، ‏‏‏‏‏‏قَالَ أَبُو دَاوُد:‏‏‏‏ نَظَرَ حَمَّادُ بْنُ زَيْدٍ إِلَى،‏‏‏‏الْحَارِثِ بْنِ عُمَيْرٍ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ هَذَا مِنْ ثِقَاتِ أَصْحَابِ أَيُّوبَ."
      },
      {
        "id": 22685,
        "hadith_number": "3605",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Kesaksian Ahli Kitab dalam Wasiat Seorang Muslim Ketika Tiada Muslim Lain",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Ash-Shabi said: A Muslim was about to die at Daquqa', but he did not find any Muslim to call him for witness to his will. So he called two men of the people of the Book for witness. Then they came to Kufah, and approaching Abu Musa al-Ashari they informed him (about his) will. They brought his inheritance and will. Al-Ashari said: This is an incident (like) which happened in the time of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم and never occurred after him. So he made them to swear by Allah after the afternoon prayer to the effect that they had not misappropriated, nor told a lie, nor changed, nor concealed, nor altered, and that it was the will of the man and his inheritance. He then executed their witness.",
        "malay_translation": "Asy-Sya'bi berkata: Seorang Muslim hampir meninggal dunia di Daquqa', tetapi dia tidak menemukan seorang Muslim pun untuk dijadikan saksi atas wasiatnya. Maka dia memanggil dua orang lelaki dari kalangan Ahli Kitab untuk menjadi saksi. Kemudian mereka datang ke Kufah, dan menemui Abu Musa al-Asy'ari lalu mereka memberitahunya (tentang) wasiatnya. Mereka membawa harta peninggalan dan wasiatnya. Al-Asy'ari berkata: Ini adalah kejadian (seperti) yang berlaku pada zaman Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم dan tidak pernah terjadi setelahnya. Maka beliau menyuruh mereka bersumpah dengan nama Allah setelah solat Asar bahawa mereka tidak menggelapkan, tidak berdusta, tidak mengubah, tidak menyembunyikan, tidak menukar, dan bahawa itu adalah wasiat lelaki itu dan harta peninggalannya. Kemudian beliau melaksanakan kesaksian mereka.",
        "arabic_text": "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ، ‏‏‏‏‏‏حَدَّثَنَا هُشَيْمٌ، ‏‏‏‏‏‏أَخْبَرَنَا زَكَرِيَّا، ‏‏‏‏‏‏عَنِ الشَّعْبِيِّ، ‏‏‏‏‏‏ أَنَّ رَجُلًا مِنِ الْمُسْلِمِينَ حَضَرَتْهُ الْوَفَاةُ بِدَقُوقَاء هَذِهِ، ‏‏‏‏‏‏وَلَمْ يَجِدْ أَحَدًا مِنِ الْمُسْلِمِينَ يُشْهِدُهُ عَلَى وَصِيَّتِهِ، ‏‏‏‏‏‏فَأَشْهَدَ رَجُلَيْنِ مِنْ أَهْلِ الْكِتَابِ، ‏‏‏‏‏‏فَقَدِمَا الْكُوفَةَ فَأَتَيَا أَبَا مُوسَى الْأَشْعَرِيَّ، ‏‏‏‏‏‏فَأَخْبَرَاهُ، ‏‏‏‏‏‏وَقَدِمَا بِتَرِكَتِهِ، ‏‏‏‏‏‏وَوَصِيَّتِهِ، ‏‏‏‏‏‏فَقَالَ الْأَشْعَرِيُّ:‏‏‏‏ هَذَا أَمْرٌ لَمْ يَكُنْ بَعْدَ الَّذِي كَانَ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَأَحْلَفَهُمَا بَعْدَ الْعَصْرِ بِاللَّهِ مَا خَانَا وَلَا كَذَبَا وَلَا بَدَّلَا وَلَا كَتَمَا وَلَا غَيَّرَا، ‏‏‏‏‏‏وَإِنَّهَا لَوَصِيَّةُ الرَّجُلِ وَتَرِكَتُهُ فَأَمْضَى شَهَادَتَهُمَا ."
      },
      {
        "id": 22686,
        "hadith_number": "3606",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hadis tentang Sumpah dan Saksi dalam Kes Pusaka",
        "perawi_melayu": "Abdullah Ibn Abbas",
        "english_text": "Narrated Abdullah Ibn Abbas: A man from Banu Sahm went out with Tamim ad-Dari and Adi ibn BAdda. The man of Banu Sahm died in the land where no Muslim was present. When they returned with his inheritance, they (the heirs) did not find a silver cup with lines of gold (in his property). The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم administered on oath to them. The cup was then found (with someone) at Makkah. They said: We have bought it from Tamim and Adi. Then two men from the heirs of the man of Banu Sahm got up and swore saying: Our witness is more reliable than their witness. They said that the cup belonged to their man. He (Ibn Abbas) said: The following verse was revealed about them: O ye who believe! when death approaches any of you. . . . .",
        "malay_translation": "Diriwayatkan oleh Abdullah Ibn Abbas: Seorang lelaki dari Bani Sahm keluar bersama Tamim ad-Dari dan Adi ibn BAdda. Lelaki dari Bani Sahm itu meninggal dunia di tanah di mana tiada seorang Muslim pun hadir. Apabila mereka kembali dengan harta pusakanya, mereka (para waris) tidak menemui sebuah cawan perak dengan garis-garis emas (dalam hartanya). Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم menyuruh mereka bersumpah. Cawan itu kemudian ditemui (dengan seseorang) di Makkah. Mereka berkata: Kami telah membelinya dari Tamim dan Adi. Kemudian dua orang lelaki dari waris lelaki Bani Sahm bangkit dan bersumpah mengatakan: Saksi kami lebih dipercayai daripada saksi mereka. Mereka berkata bahawa cawan itu adalah milik lelaki mereka. Beliau (Ibn Abbas) berkata: Ayat berikut diturunkan mengenai mereka: Wahai orang-orang yang beriman! apabila kematian menghampiri salah seorang di antara kamu. . . . .",
        "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ آدَمَ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ أَبِي الْقَاسِمِ، ‏‏‏‏‏‏عَنْ عَبْدِ الْمَلِكِ بْنِ سَعِيدِ بْنِ جُبَيْرٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ خَرَجَ رَجُلٌ مِنْ بَنِي سَهْمٍ، ‏‏‏‏‏‏مَعَ تَمِيمٍ الدَّارِيِّ، ‏‏‏‏‏‏وَعُدَيِّ بْنِ بَدَّاءٍ، ‏‏‏‏‏‏فَمَاتَ السَّهْمِيُّ بِأَرْضٍ لَيْسَ بِهَا مُسْلِمٌ، ‏‏‏‏‏‏فَلَمَّا قَدِمَا بِتَرِكَتِهِ فَقَدُوا جَامَ فِضَّةٍ مُخَوَّصًا بِالذَّهَبِ، ‏‏‏‏‏‏فَأَحْلَفَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏ثُمَّ وُجِدَ الْجَامُ بِمَكَّةَ، ‏‏‏‏‏‏فَقَالُوا:‏‏‏‏ اشْتَرَيْنَاهُ مِنْ تَمِيمٍ وَعُدَيٍّ، ‏‏‏‏‏‏فَقَامَ رَجُلَانِ مِنْ أَوْلِيَاءِ السَّهْمِيِّ فَحَلَفَا لَشَهَادَتُنَا أَحَقُّ مِنْ شَهَادَتِهِمَا، ‏‏‏‏‏‏وَإِنَّ الْجَامَ لِصَاحِبِهِمْ قَالَ:‏‏‏‏ فَنَزَلَتْ فِيهِمْ يَأَيُّهَا الَّذِينَ آمَنُوا شَهَادَةُ بَيْنِكُمْ إِذَا حَضَرَ أَحَدَكُمُ الْمَوْتُ سورة المائدة آية 106 ."
      },
      {
        "id": 22687,
        "hadith_number": "3607",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Kesaksian Khuzaymah Setara dengan Kesaksian Dua Orang",
        "perawi_melayu": "Bapa saudara Umarah ibn Khuzaymah",
        "english_text": "Narrated Uncle of Umarah ibn Khuzaymah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم bought a horse from a Bedouin. The Prophet صلی ‌اللہ ‌علیہ ‌وسلم took him with him to pay him the price of his horse. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم walked quickly and the Bedouin walked slowly. The people stopped the Bedouin and began to bargain with him for the horse as and they did not know that the Prophet صلی ‌اللہ ‌علیہ ‌وسلم had bought it. The Bedouin called the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم saying: If you want this horse, (then buy it), otherwise I shall sell it. The Prophet صلی ‌اللہ ‌علیہ ‌وسلم stopped when he heard the call of the Bedouin, and said: Have I not bought it from you? The Bedouin said: I swear by Allah, I have not sold it to you. The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Yes, I have bought it from you. The Bedouin began to say: Bring a witness. Khuzaymah ibn Thabit then said: I bear witness that you have bought it. The Prophet صلی ‌اللہ ‌علیہ ‌وسلم turned to Khuzaymah and said: On what (grounds) do you bear witness? He said: By considering you trustworthy, Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم! The Prophet صلی ‌اللہ ‌علیہ ‌وسلم made the witness of Khuzaymah equivalent to the witness of two people.",
        "malay_translation": "Diriwayatkan daripada bapa saudara Umarah ibn Khuzaymah: Nabi ﷺ membeli seekor kuda daripada seorang Badwi. Nabi ﷺ membawa Badwi itu bersamanya untuk membayar harga kudanya. Rasulullah ﷺ berjalan dengan cepat dan Badwi itu berjalan perlahan. Orang ramai menghalang Badwi itu dan mula menawar kuda itu dengannya kerana mereka tidak tahu bahawa Nabi ﷺ telah membelinya. Badwi itu memanggil Rasulullah ﷺ sambil berkata: Jika kamu mahukan kuda ini, (maka belilah), jika tidak, saya akan menjualnya. Nabi ﷺ berhenti apabila mendengar panggilan Badwi itu, dan bersabda: Bukankah aku telah membelinya daripadamu? Badwi itu berkata: Demi Allah, saya tidak menjualnya kepada kamu. Nabi ﷺ bersabda: Ya, aku telah membelinya daripadamu. Badwi itu mula berkata: Bawakan seorang saksi. Khuzaymah ibn Thabit kemudian berkata: Saya bersaksi bahawa kamu telah membelinya. Nabi ﷺ berpaling kepada Khuzaymah dan bersabda: Atas dasar apa kamu bersaksi? Beliau berkata: Dengan mempercayai kamu, wahai Rasulullah ﷺ! Nabi ﷺ menjadikan kesaksian Khuzaymah setara dengan kesaksian dua orang.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ، ‏‏‏‏‏‏أَنَّ الْحَكَمَ بْنَ نَافِعٍ حَدَّثَهُمْ، ‏‏‏‏‏‏أَخْبَرَنَا شُعَيْبٌ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ عُمَارَةَ بْنِ خُزَيْمَةَ، ‏‏‏‏‏‏أَنَّ عَمَّهُ حَدَّثَهُ، ‏‏‏‏‏‏وَهُوَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ابْتَاعَ فَرَسًا مِنْ أَعْرَابِيٍّ، ‏‏‏‏‏‏فَاسْتَتْبَعَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيَقْضِيَهُ ثَمَنَ فَرَسِهِ، ‏‏‏‏‏‏فَأَسْرَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَشْيَ وَأَبْطَأَ الْأَعْرَابِيُّ، ‏‏‏‏‏‏فَطَفِقَ رِجَالٌ يَعْتَرِضُونَ الْأَعْرَابِيَّ فَيُسَاوِمُونَهُ بِالْفَرَسِ، ‏‏‏‏‏‏وَلَا يَشْعُرُونَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ابْتَاعَهُ، ‏‏‏‏‏‏فَنَادَى الْأَعْرَابِيُّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنْ كُنْتَ مُبْتَاعًا هَذَا الْفَرَسِ وَإِلَّا بِعْتُهُ، ‏‏‏‏‏‏فَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ سَمِعَ نِدَاءَ الْأَعْرَابِيِّ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَوْ لَيْسَ قَدِ ابْتَعْتُهُ مِنْكَ، ‏‏‏‏‏‏فَقَالَ الْأَعْرَابِيُّ:‏‏‏‏ لَا وَاللَّهِ مَا بِعْتُكَهُ، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ بَلَى، ‏‏‏‏‏‏قَدِ ابْتَعْتُهُ مِنْكَ، ‏‏‏‏‏‏فَطَفِقَ الْأَعْرَابِيُّ يَقُولُ:‏‏‏‏ هَلُمَّ شَهِيدًا، ‏‏‏‏‏‏فَقَالَ خُزَيْمَةُ بْنُ ثَابِتٍ:‏‏‏‏ أَنَا أَشْهَدُ أَنَّكَ قَدْ بَايَعْتَهُ، ‏‏‏‏‏‏فَأَقْبَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى خُزَيْمَةَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ بِمَ تَشْهَدُ ؟، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ بِتَصْدِيقِكَ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏فَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَهَادَةَ خُزَيْمَةَ بِشَهَادَةِ رَجُلَيْنِ ."
      },
      {
        "id": 22688,
        "hadith_number": "3608",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Keputusan Berdasarkan Sumpah dan Saksi",
        "perawi_melayu": "Ibnu Abbas",
        "english_text": "Ibn Abbas said: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم gave a decision on the basis of an oath and a single witness.",
        "malay_translation": "Ibnu Abbas berkata: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم membuat keputusan berdasarkan sumpah dan seorang saksi.",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏وَالْحَسَنُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏أَنَّ زَيْدَ بْنَ الْحُبَابِ حَدَّثَهُمْ، ‏‏‏‏‏‏حَدَّثَنَا سَيْفٌ الْمَكَّيُّ، ‏‏‏‏‏‏قَالَ عُثْمَانُ، ‏‏‏‏‏‏سَيْفُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏عَنْ قَيْسِ بْنِ سَعْدٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ دِينَارٍ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِيَمِينٍ وَشَاهِدٍ ."
      },
      {
        "id": 22689,
        "hadith_number": "3609",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Riwayat Hadis Serupa Mengenai Hak-Hak",
        "perawi_melayu": "Amr bin Dinar",
        "english_text": "The tradition mentioned above has also been transmitted by Amr bin Dinar through a different chain of narrators and to the same effect. Salamah has in his version: Amr said: In the rights (of the people).",
        "malay_translation": "Hadis yang disebutkan di atas juga telah diriwayatkan oleh Amr bin Dinar melalui sanad yang berbeza dan dengan maksud yang sama. Salamah dalam riwayatnya: Amr berkata: Dalam hak-hak (orang ramai).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏وَسَلَمَةُ بْنُ شَبِيبٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَخْبَرَنَا مُحَمَّدُ بْنُ مُسْلِمٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ دِينَارٍ، ‏‏‏‏‏‏بِإِسْنَادِهِ وَمَعْنَاهُ، ‏‏‏‏‏‏قَالَ سَلَمَةُ فِي حَدِيثِهِ، ‏‏‏‏‏‏قَالَ عَمْرٌو:‏‏‏‏ فِي الْحُقُوقِ."
      },
      {
        "id": 22690,
        "hadith_number": "3610",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Keputusan Nabi Berdasarkan Sumpah dan Saksi Tunggal",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Narrated Abu Hurairah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم gave a decision on the basis of an oath and a single witness. Abu Dawud said: Al-Rabi bin Sulaiman al-muadhdhin told me some additional words in this tradition: Al-Shafi'i told me from Abd al-Aziz. I then mentioned it fo Suhail who said: Rabiah told me - and he is reliable in my opinion - that I told him this (tradition) and I do not remember it. Abd al-Aziz said: Suhail suffered from some disease which caused him to lose a little of his intelligence, and he forgot some of his traditions. Thereafter Suhail would narrate traditions from Rabiah on the authority of his father.",
        "malay_translation": "Diriwayatkan dari Abu Hurairah: Nabi صلی ‌اللہ ‌علیہ ‌وسلم membuat keputusan berdasarkan sumpah dan seorang saksi. Abu Dawood berkata: Al-Rabi bin Sulaiman al-muadhdhin memberitahu saya beberapa perkataan tambahan dalam hadis ini: Al-Shafi'i memberitahu saya dari Abd al-Aziz. Kemudian saya menyebutkannya kepada Suhail yang berkata: Rabiah memberitahu saya - dan dia boleh dipercayai pada pendapat saya - bahawa saya memberitahunya hadis ini dan saya tidak mengingatinya. Abd al-Aziz berkata: Suhail menderita penyakit yang menyebabkan dia kehilangan sedikit kecerdasannya, dan dia lupa beberapa hadisnya. Selepas itu Suhail akan meriwayatkan hadis dari Rabiah berdasarkan autoriti bapanya.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي بَكْرٍ أَبُو مُصْعَبٍ الزُّهْرِيُّ، ‏‏‏‏‏‏حَدَّثَنَا الدَّرَاوَرْدِيُّ، ‏‏‏‏‏‏عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ،‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِالْيَمِينِ مَعَ الشَّاهِدِ ، ‏‏‏‏‏‏قَالَ أَبُو دَاوُد:‏‏‏‏ وَزَادَنِي الرَّبِيعُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏الْمُؤَذِّنُ فِي هَذَا الْحَدِيثِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي الشَّافِعِيُّ، ‏‏‏‏‏‏عَنْ عَبْدِ الْعَزِيزِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَذَكَرْتُ ذَلِكَ لِسُهَيْلٍ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَخْبَرَنِي رَبِيعَةُ، ‏‏‏‏‏‏وَهُوَ عِنْدِي ثِقَةٌ أَنِّي حَدَّثْتُهُ إِيَّاهُ وَلَا أَحْفَظُهُ، ‏‏‏‏‏‏قَالَ عَبْدُ الْعَزِيزِ: وَقَدْ كَانَ أَصَابَتْ سُهَيْلًا عِلَّةٌ أَذْهَبَتْ بَعْضَ عَقْلِهِ وَنَسِيَ بَعْضَ حَدِيثِهِ فَكَانَ سُهَيْلٌ بَعْدُ يُحَدِّثُهُ، ‏‏‏‏‏‏عَنْ رَبِيعَةَ عَنْهُ، ‏‏‏‏‏‏عَنْ أَبِيهِ."
      },
      {
        "id": 22691,
        "hadith_number": "3611",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Penyampaian Hadis: Jika Rabiah meriwayatkannya daripada saya, maka riwayatkanlah.",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "The tradition mentioned above has also been transmitted by Rabiah through the chain of Abu Musab and to the same effect. Sulaiman said: I then met Suhail and asked him about this tradition. He said: I do not know it. I said to him: Rabiah transmitted it to me from you. He said: If Rabiah transmitted it to you from me, then retransmit it from Rabiah on my authority.",
        "malay_translation": "Hadis yang disebutkan di atas juga telah diriwayatkan oleh Rabiah melalui sanad Abu Musab dan dengan maksud yang sama. Sulaiman berkata: Kemudian saya bertemu Suhail dan bertanya kepadanya tentang hadis ini. Dia berkata: Saya tidak mengetahuinya. Saya berkata kepadanya: Rabiah meriwayatkannya kepada saya daripada anda. Dia berkata: Jika Rabiah meriwayatkannya kepada anda daripada saya, maka riwayatkanlah ia daripada Rabiah atas autoriti saya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ دَاوُدَ الْإِسْكَنْدَرَانِيُّ، ‏‏‏‏‏‏حَدَّثَنَا زِيَادٌ يَعْنِي ابْنَ يُونُسَ، ‏‏‏‏‏‏حَدَّثَنِي سُلَيْمَانُ بْنُ بِلَالٍ، ‏‏‏‏‏‏عَنْ رَبِيعَةَ، ‏‏‏‏‏‏بِإِسْنَادِ أَبِي مُصْعَبٍ وَمَعْنَاهُ، ‏‏‏‏‏‏قَالَ سُلَيْمَانُ:‏‏‏‏ فَلَقِيتُ سُهَيْلًا فَسَأَلْتُهُ عَنْ هَذَا الْحَدِيثِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا أَعْرِفُهُ، ‏‏‏‏‏‏فَقُلْتُ لَهُ:‏‏‏‏ إِنَّ رَبِيعَةَ أَخْبَرَنِي بِهِ عَنْكَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَإِنْ كَانَ رَبِيعَةُ أَخْبَرَكَ عَنِّي فَحَدِّثْ بِهِ، ‏‏‏‏‏‏عَنْ رَبِيعَةَ عَنِّي."
      },
      {
        "id": 22692,
        "hadith_number": "3612",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Sumpah Keislaman Bani al-Anbar dan Pembahagian Harta",
        "perawi_melayu": "Zubayb ibn Thalabah al-Anbari",
        "english_text": "Narrated Zubayb ibn Thalabah al-Anbari: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم sent an army to Banu al-Anbar. They captured them at Rukbah in the suburbs of at-Taif and drove them to the Holy Prophet صلی ‌اللہ ‌علیہ ‌وسلم. I rode hurriedly to the Holy Prophet صلی ‌اللہ ‌علیہ ‌وسلم and said: Peace be on you, Messenger of Allah, and the mercy of Allah and His blessings. Your contingent came to us and arrested us, but we had already embraced Islam and cut the sides of the ears of our cattle. When Banu al-Anbar arrived, the Holy Prophet صلی ‌اللہ ‌علیہ ‌وسلم said to me: Have you any evidence that you had embraced Islam before you were captured today? I said: Yes. He said: Who is your witness? I said: Samurah, a man from Banu al-Anbar, and another man whom he named. The man testified but Samurah refused to testify. The Holy Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: He (Samurah) has refused to testify for you, so take an oath with your other witness. I said: Yes. He then dictated an oath to me and I swore to the effect that we had embraced Islam on a certain day, and that we had cut the sides of the ears of the cattle. The Holy Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Go and divide half of their property, but do not touch their children. Had Allah not disliked the wastage of action, we should not have taxed you even a rope. Zubayb said: My mother called me and said: This man has taken my mattress. I then went to the Holy Prophet صلی ‌اللہ ‌علیہ ‌وسلم and informed him. He said to me: Detain him. So I caught him with a garment around his neck, and stood there with him. Then the Holy Prophet صلی ‌اللہ ‌علیہ ‌وسلم looked at us standing there. He asked: What do you intend (doing) with your captive? I said: I shall let him go free if he returns to this (man) the mattress of his mother which he has taken from her. He said: Prophet of Allah صلی ‌اللہ ‌علیہ ‌وسلم, I no longer have it. He said: The Holy Prophet صلی ‌اللہ ‌علیہ ‌وسلم took the sword of the man and gave it to me, and said to him: Go and give him some sa's of cereal. So he gave me some sa's of barley.",
        "malay_translation": "Diriwayatkan daripada Zubayb ibn Thalabah al-Anbari: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم telah menghantar satu pasukan tentera kepada Bani al-Anbar. Mereka menangkap mereka di Rukbah di pinggir bandar Taif dan membawa mereka kepada Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم. Saya menunggang dengan tergesa-gesa kepada Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم dan berkata: Salam sejahtera ke atas kamu, wahai Rasulullah, dan rahmat Allah serta keberkatan-Nya. Pasukan tentera kamu telah datang kepada kami dan menangkap kami, padahal kami telah memeluk Islam dan memotong sisi telinga ternakan kami. Apabila Bani al-Anbar tiba, Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda kepada saya: Adakah kamu mempunyai bukti bahawa kamu telah memeluk Islam sebelum kamu ditangkap hari ini? Saya berkata: Ya. Baginda bersabda: Siapakah saksi kamu? Saya berkata: Samurah, seorang lelaki dari Bani al-Anbar, dan seorang lelaki lain yang baginda namakan. Lelaki itu memberi kesaksian tetapi Samurah enggan memberi kesaksian. Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Dia (Samurah) telah enggan memberi kesaksian untuk kamu, maka bersumpahlah dengan saksi kamu yang lain. Saya berkata: Ya. Kemudian baginda membacakan sumpah kepada saya dan saya bersumpah bahawa kami telah memeluk Islam pada hari sekian-sekian, dan bahawa kami telah memotong sisi telinga ternakan. Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Pergi dan bahagikan separuh daripada harta mereka, tetapi jangan sentuh anak-anak mereka. Kalaulah Allah tidak membenci pembaziran tindakan, kami tidak akan mengenakan cukai kepada kamu walaupun seutas tali. Zubayb berkata: Ibu saya memanggil saya dan berkata: Lelaki ini telah mengambil tilam saya. Kemudian saya pergi kepada Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم dan memberitahu baginda. Baginda bersabda kepada saya: Tahan dia. Maka saya menangkapnya dengan sehelai pakaian di lehernya, dan berdiri di situ bersamanya. Kemudian Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم melihat kami berdiri di situ. Baginda bertanya: Apa yang kamu ingin lakukan dengan tawanan kamu? Saya berkata: Saya akan melepaskannya jika dia mengembalikan kepada (lelaki) ini tilam ibunya yang telah diambilnya daripadanya. Dia berkata: Wahai Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم, saya tidak lagi memilikinya. Baginda bersabda: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم mengambil pedang lelaki itu dan memberikannya kepada saya, dan bersabda kepadanya: Pergi dan berikan kepadanya beberapa sa' bijirin. Maka dia memberikan kepada saya beberapa sa' barli.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ، ‏‏‏‏‏‏حَدَّثَنَا عَمَّارُ بْنُ شُعَيْثِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْبِ الْعَنْبَرِيُّ، ‏‏‏‏‏‏حَدَّثَنِي أَبِي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ جَدِّيالزُّبَيْبَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ بَعَثَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَيْشًا إِلَى بَنِي الْعَنْبَرِ، ‏‏‏‏‏‏فَأَخَذُوهُمْ بِرُكْبَةَ مِنْ نَاحِيَةِ الطَّائِفِ فَاسْتَاقُوهُمْ، ‏‏‏‏‏‏إِلَى نَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَكِبْتُ فَسَبَقْتُهُمْ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ السَّلَامُ عَلَيْكَ يَا نَبِيَّ اللَّهِ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، ‏‏‏‏‏‏أَتَانَا جُنْدُكَ فَأَخَذُونَا، ‏‏‏‏‏‏وَقَدْ كُنَّا أَسْلَمْنَا وَخَضْرَمْنَا آذَانَ النَّعَمِ، ‏‏‏‏‏‏فَلَمَّا قَدِمَ بَلْعَنْبَرِ، ‏‏‏‏‏‏قَالَ لِي نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ هَلْ لَكُمْ بَيِّنَةٌ عَلَى أَنَّكُمْ أَسْلَمْتُمْ قَبْلَ أَنْ تُؤْخَذُوا فِي هَذِهِ الْأَيَّامِ ؟، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَنْ بَيِّنَتُكَ ؟، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ سَمُرَةُ رَجُلٌ مِنْ بَنِي الْعَنْبَرِ، ‏‏‏‏‏‏وَرَجُلٌ آخَرُ سَمَّاهُ لَهُ، ‏‏‏‏‏‏فَشَهِدَ الرَّجُلُ، ‏‏‏‏‏‏وَأَبَى سَمُرَةُ أَنْ يَشْهَدَ، ‏‏‏‏‏‏فَقَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ قَدْ أَبَى أَنْ يَشْهَدَ لَكَ فَتَحْلِفُ مَعَ شَاهِدِكَ الْآخَرِ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏فَاسْتَحْلَفَنِي، ‏‏‏‏‏‏فَحَلَفْتُ بِاللَّهِ، ‏‏‏‏‏‏لَقَدْ أَسْلَمْنَا يَوْمَ كَذَا وَكَذَا، ‏‏‏‏‏‏وَخَضْرَمْنَا آذَانَ النَّعَمِ، ‏‏‏‏‏‏فَقَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اذْهَبُوا، ‏‏‏‏‏‏فَقَاسِمُوهُمْ أَنْصَافَ الْأَمْوَالِ، ‏‏‏‏‏‏وَلَا تَمَسُّوا ذَرَارِيَّهُمْ، ‏‏‏‏‏‏لَوْلَا أَنَّ اللَّهَ لَا يُحِبُّ ضَلَالَةَ الْعَمَلَ مَا رَزَيْنَاكُمْ عِقَالًا، ‏‏‏‏‏‏قَالَ الزُّبَيْبُ:‏‏‏‏ فَدَعَتْنِي أُمِّي، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ هَذَا الرَّجُلُ أَخَذَ زِرْبِيَّتِي، ‏‏‏‏‏‏فَانْصَرَفْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْنِي فَأَخْبَرْتُه، ‏‏‏‏‏‏فَقَالَ لِي:‏‏‏‏ احْبِسْهُ، ‏‏‏‏‏‏فَأَخَذْتُ بِتَلْبِيبِهِ، ‏‏‏‏‏‏وَقُمْتُ مَعَهُ مَكَانَنَا، ‏‏‏‏‏‏ثُمَّ نَظَرَ إِلَيْنَا نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَائِمَيْنِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا تُرِيدُ بِأَسِيرِكَ ؟، ‏‏‏‏‏‏فَأَرْسَلْتُهُ مِنْ يَدِي، ‏‏‏‏‏‏فَقَامَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ لِلرَّجُلِ:‏‏‏‏ رُدَّ عَلَى هَذَا زِرْبِيَّةَ أُمِّهِ الَّتِي أَخَذْتَ مِنْهَا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا نَبِيَّ اللَّهِ، ‏‏‏‏‏‏إِنَّهَا خَرَجَتْ مِنْ يَدِي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَاخْتَلَعَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَيْفَ الرَّجُلِ فَأَعْطَانِيهِ، ‏‏‏‏‏‏وَقَالَ لِلرَّجُلِ:‏‏‏‏ اذْهَبْ فَزِدْهُ آصُعًا مِنْ طَعَامٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَزَادَنِي آصُعًا مِنْ شَعِيرٍ ."
      },
      {
        "id": 22693,
        "hadith_number": "3613",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Keputusan Nabi tentang Tuntutan Haiwan Tanpa Bukti",
        "perawi_melayu": "Abu Musa al-Ash'ari",
        "english_text": "Narrated Abu Musa al-Ashari: Two men claimed a camel or an animal and brought the case to the Holy Prophet صلی ‌اللہ ‌علیہ ‌وسلم. But as neither of them produced any proof, the Holy Prophet صلی ‌اللہ ‌علیہ ‌وسلم declared that they should share it equally.",
        "malay_translation": "Diriwayatkan dari Abu Musa al-Ash'ari: Dua orang lelaki mendakwa memiliki seekor unta atau haiwan dan membawa kes itu kepada Nabi Muhammad صلی ‌اللہ ‌علیہ ‌وسلم. Namun, kerana tiada seorang pun daripada mereka yang mengemukakan bukti, Nabi Muhammad صلی ‌اللہ ‌علیہ ‌وسلم memutuskan bahawa mereka harus berkongsi haiwan itu sama rata.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمِنْهَالِ الضَّرِيرُ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ أَبِي عَرُوبَةَ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ أَبِي مُوسَى الْأَشْعَرِيّ، ‏‏‏‏‏‏ أَنَّ رَجُلَيْنِ ادَّعَيَا بَعِيرًا أَوْ دَابَّةً إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَتْ لِوَاحِدٍ مِنْهُمَا بَيِّنَةٌ، ‏‏‏‏‏‏فَجَعَلَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَهُمَا ."
      },
      {
        "id": 22694,
        "hadith_number": "3614",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hadis ini juga diriwayatkan oleh Sa'id melalui sanad lain",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "The tradition mentioned above has also been transmitted by Saeed through a different chain of narrators to the same effect.",
        "malay_translation": "Hadis yang disebutkan di atas juga diriwayatkan oleh Sa'id melalui sanad yang berbeza dengan maksud yang sama.",
        "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ آدَمَ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏عَنْ سَعِيدٍ بِإِسْنَادِهِ وَمَعْنَاهُ."
      },
      {
        "id": 22695,
        "hadith_number": "3615",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Pembahagian Unta yang Dituntut oleh Dua Lelaki",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "The tradition mentioned above has also been transmitted by Qatadah through a different chain of narrators to the effect that two men laid claim camel and both of them produced witness so the prophet صلی ‌اللہ ‌علیہ ‌وسلم divided it in halves between them.",
        "malay_translation": "Hadis yang disebutkan di atas juga telah diriwayatkan oleh Qatadah melalui sanad periwayat yang berbeza yang membawa maksud bahawa dua orang lelaki menuntut unta dan kedua-duanya mengemukakan saksi, maka Nabi ﷺ membahagikannya kepada dua bahagian antara mereka.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، ‏‏‏‏‏‏حَدَّثَنَا هَمَّامٌ، ‏‏‏‏‏‏عَنْ قَتَادَةَ بِمَعْنَى إِسْنَادِهِ، ‏‏‏‏‏‏أَنَّ رَجُلَيْنِ ادَّعَيَا بَعِيرًا عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَبَعَثَ كُلُّ وَاحِدٍ مِنْهُمَا شَاهِدَيْنِ، ‏‏‏‏‏‏فَقَسَمَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَهُمَا نِصْفَيْنِ."
      },
      {
        "id": 22696,
        "hadith_number": "3616",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Undian untuk Sumpah dalam Pertikaian Harta Tanpa Bukti",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Narrated Abu Hurairah: Two men disputed about some property and brought the case to the Holy Prophet صلی ‌اللہ ‌علیہ ‌وسلم, but neither of them could produce any proof. So the Holy Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Cast lots about the oath whatever it may be, whether they like it or dislike it.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah R.A.: Dua orang lelaki bertikai mengenai suatu harta dan membawa kes itu kepada Nabi Muhammad صلی ‌اللہ ‌علیہ ‌وسلم, tetapi kedua-duanya tidak dapat mengemukakan sebarang bukti. Maka Nabi Muhammad صلی ‌اللہ ‌علیہ ‌وسلم bersabda: 'Buatlah undian mengenai sumpah, apa pun keputusannya, sama ada mereka menyukainya atau tidak.'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمِنْهَالِ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ أَبِي عَرُوبَةَ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ خِلَاسٍ، ‏‏‏‏‏‏عَنْ أَبِي رَافِعٍ، ‏‏‏‏‏‏عَنْأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏ أَنَّ رَجُلَيْنِ اخْتَصَمَا فِي مَتَاعٍ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ لِوَاحِدٍ مِنْهُمَا بَيِّنَةٌ، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اسْتَهِمَا عَلَى الْيَمِينِ مَا كَانَ أَحَبَّا ذَلِكَ أَوْ كَرِهَا ."
      },
      {
        "id": 22697,
        "hadith_number": "3617",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Undian untuk Sumpah yang Tidak Disukai atau Digemari",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah reported the holy prophet صلی ‌اللہ ‌علیہ ‌وسلم as saying: When two men dislike the oath or like it, lots will be cost about it. Salamah said on the authority of Mamar who said: when the two are compelled to take an oath.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Nabi suci صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Apabila dua orang lelaki tidak menyukai sumpah atau menyukainya, maka hendaklah mereka membuat undian mengenainya. Salamah berkata berdasarkan autoriti Mamar yang berkata: Apabila kedua-duanya terpaksa bersumpah.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، ‏‏‏‏‏‏وَسَلَمَةُ بْنُ شَبِيبٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏قَالَ أَحْمَدُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِذَا كَرِهَ الِاثْنَانِ الْيَمِينَ أَوِ اسْتَحَبَّاهَا فَلْيَسْتَهِمَا عَلَيْهَا ، ‏‏‏‏‏‏قَالَ سَلَمَةُ:‏‏‏‏ قَالَ:‏‏‏‏ أَخْبَرَنَا مَعْمَرٌ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ إِذَا أُكْرِهَ الِاثْنَانِ عَلَى الْيَمِينِ ."
      },
      {
        "id": 22698,
        "hadith_number": "3618",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hadis Mengenai Undian untuk Sumpah Tanpa Bukti Haiwan",
        "perawi_melayu": "Saeed bin ‘Urubah",
        "english_text": "The tradition mentioned above has also been transmitted by Saeed bin ‘Urubah through the chain as narrated by Ibn Minhal. This version has: About an animal and they had no proof. So the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم ordered to cast lots about the oath.",
        "malay_translation": "Hadis yang disebutkan di atas juga diriwayatkan oleh Saeed bin ‘Urubah melalui sanad seperti yang diriwayatkan oleh Ibn Minhal. Versi ini menyebutkan: Mengenai seekor haiwan dan mereka tidak mempunyai bukti. Maka Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم memerintahkan untuk melakukan undian mengenai sumpah.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، ‏‏‏‏‏‏بِإِسْنَادِ ابْنِ مِنْهَالٍ مِثْلَهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فِي دَابَّةٍ وَلَيْسَ لَهُمَا بَيِّنَةٌ، ‏‏‏‏‏‏فَأَمَرَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَسْتَهِمَا عَلَى الْيَمِينِ."
      },
      {
        "id": 22699,
        "hadith_number": "3619",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Keputusan Rasulullah SAW Mengenai Sumpah Bagi Tertuduh",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Ibn Abi Mulaikah said: Ibn Abbas wrote to me that the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلمhad defendant should take an oath.",
        "malay_translation": "Ibn Abi Mulaikah berkata: Ibn Abbas menulis kepada saya bahawa Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم telah memutuskan bahawa tertuduh hendaklah bersumpah.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، ‏‏‏‏‏‏حَدَّثَنَا نَافِعُ بْنُ عُمَرَ، ‏‏‏‏‏‏عَنْ ابْنِ أَبِي مُلَيْكَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَتَبَ إِلَيَّ ابْنُ عَبَّاسٍ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِالْيَمِينِ عَلَى الْمُدَّعَى عَلَيْهِ ."
      },
      {
        "id": 22700,
        "hadith_number": "3620",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Sumpah dengan Nama Allah dalam Kes Plaintif",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Narrated Abdullah ibn Abbas: The Holy Prophet صلی ‌اللہ ‌علیہ ‌وسلم said to a man whom he asked to take an oath: Swear by Allah except whom there is no god that you have nothing belonging to him, i. e. the plaintiff.",
        "malay_translation": "Diriwayatkan daripada Abdullah ibn Abbas: Nabi Suci صلی ‌اللہ ‌علیہ ‌وسلم bersabda kepada seorang lelaki yang diminta untuk bersumpah: Bersumpahlah dengan nama Allah yang tiada tuhan selain Dia bahawa kamu tidak memiliki apa-apa yang menjadi haknya, iaitu plaintif.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو الْأَحْوَصِ، ‏‏‏‏‏‏حَدَّثَنَا عَطَاءُ بْنُ السَّائِبِ، ‏‏‏‏‏‏عَنْ أَبِي يَحْيَى، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ يَعْنِي لِرَجُلٍ حَلَّفَهُ:‏‏‏‏ احْلِفْ بِاللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ، ‏‏‏‏‏‏مَا لَهُ عِنْدَكَ شَيْءٌ ، ‏‏‏‏‏‏يَعْنِي لِلْمُدَّعِي، ‏‏‏‏‏‏قَالَ أَبُو دَاوُد:‏‏‏‏ أَبُو يَحْيَى اسْمُهُ زِيَادٌ كُوفِيٌّ ثِقَةٌ."
      },
      {
        "id": 22701,
        "hadith_number": "3621",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hadis tentang Pembuktian dan Sumpah dalam Pertikaian Tanah",
        "perawi_melayu": "Al-Ashath bin Qais",
        "english_text": "Al-Ashath bin Qais said: A Jew and I shared some land and he denied my right, so I took him to the holy prophet صلی ‌اللہ ‌علیہ ‌وسلم. The holy prophet صلی ‌اللہ ‌علیہ ‌وسلم said to me: Have you have proof. I said: No. He then said to the Jew: Swear an oath I said Messenger of Allah, he will swear an oath and go off my property. So Allah sent down: “Those who barter for a small price Allah’s covenant and their oaths. . . . to the end of the verse.",
        "malay_translation": "Al-Ashath bin Qais berkata: Saya dan seorang Yahudi berkongsi tanah dan dia menafikan hak saya, jadi saya membawa dia kepada nabi suci صلی ‌اللہ ‌علیہ ‌وسلم. Nabi suci صلی ‌اللہ ‌علیہ ‌وسلم berkata kepada saya: Adakah kamu mempunyai bukti. Saya berkata: Tidak. Kemudian baginda berkata kepada Yahudi itu: Bersumpahlah. Saya berkata: Wahai Rasulullah, dia akan bersumpah dan mengambil harta saya. Maka Allah menurunkan: “Sesungguhnya orang-orang yang menjual janji Allah dan sumpah-sumpah mereka dengan harga yang sedikit. . . . hingga akhir ayat.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، ‏‏‏‏‏‏حَدَّثَنَا أَبُو مُعَاوِيَةَ، ‏‏‏‏‏‏حَدَّثَنَا الْأَعْمَشُ، ‏‏‏‏‏‏عَنْ شَقِيقٍ، ‏‏‏‏‏‏عَنِ الْأَشْعَثِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ بَيْنِي وَبَيْنَ رَجُلٍ مِنْ الْيَهُودِ أَرْضٌ، ‏‏‏‏‏‏فَجَحَدَنِي، ‏‏‏‏‏‏فَقَدَّمْتُهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ لِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَلَكَ بَيِّنَةٌ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ لَا، ‏‏‏‏‏‏قَالَ لِلْيَهُودِيِّ:‏‏‏‏ احْلِفْ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِذًا يَحْلِفُ وَيَذْهَبُ بِمَالِي، ‏‏‏‏‏‏فَأَنْزَلَ اللَّهُ:‏‏‏‏ إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلا سورة آل عمران آية 77 إِلَى آخِرِ الْآيَةِ ."
      },
      {
        "id": 22702,
        "hadith_number": "3622",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Sengketa Tanah dan Sumpah",
        "perawi_melayu": "Diriwayatkan daripada Al-Ash'ath bin Qais",
        "english_text": "Al-Ashath bin Qais said: A men from Kindah and a men from Hadramawt came to the Holy Prophet صلی ‌اللہ ‌علیہ ‌وسلمwith their dispute about a land in the Yemen. The Hadrami said: Messenger of Allah, the this (man)had usurped land belonging to me, and it is his possession. He asked: Have you any proof ?He replied: No, but I can have him swear on oath. Allah knows that it is my land, and father seized it from me. The Kindi was prepared to take oath. He then narrated the rest of the tradition.",
        "malay_translation": "Al-Ash'ath bin Qais berkata: Seorang lelaki dari Kindah dan seorang lelaki dari Hadramawt datang kepada Nabi Suci صلی ‌اللہ ‌علیہ ‌وسلم dengan perselisihan mereka tentang sebidang tanah di Yaman. Lelaki Hadramawt itu berkata: Wahai Rasulullah, orang ini telah merampas tanah milikku, dan ia adalah miliknya. Baginda bertanya: Adakah kamu mempunyai bukti? Dia menjawab: Tidak, tetapi saya boleh menyuruhnya bersumpah. Allah tahu bahawa ini adalah tanah saya, dan ayahnya telah merampasnya daripada saya. Lelaki Kindi itu bersedia untuk bersumpah. Kemudian dia meriwayatkan sisa hadis tersebut.",
        "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ، ‏‏‏‏‏‏حَدَّثَنَا الْفَرْيَابِيُّ، ‏‏‏‏‏‏حَدَّثَنَا الْحَارِثُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏حَدَّثَنِي كُرْدُوسٌ، ‏‏‏‏‏‏عَنِ الْأَشْعَثِ بْنِ قَيْسٍ، ‏‏‏‏‏‏ أَنَّ رَجُلًا مِنْ كِنْدَةَ، ‏‏‏‏‏‏وَرَجُلًا مِنْ حَضْرَمَوْتَ، ‏‏‏‏‏‏اخْتَصَمَا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَرْضٍ مِنْ الْيَمَنِ، ‏‏‏‏‏‏فَقَالَ الْحَضْرَمِيُّ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِنَّ أَرْضِي اغْتَصَبَنِيهَا أَبُو هَذَا، ‏‏‏‏‏‏وَهِيَ فِي يَدِهِ قَالَ:‏‏‏‏ هَلْ لَكَ بَيِّنَةٌ ؟، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا، ‏‏‏‏‏‏وَلَكِنْ أُحَلِّفُهُ وَاللَّهِ مَا يَعْلَمُ أَنَّهَا أَرْضِي اغْتَصَبَنِيهَا أَبُوهُ فَتَهَيَّأَ الْكِنْدِيُّ يَعْنِي لِلْيَمِينِ وَسَاقَ الْحَدِيثَ ."
      },
      {
        "id": 22703,
        "hadith_number": "3623",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Pertikaian Tanah dan Sumpah",
        "perawi_melayu": "Wail bin Hujr al-Hadrami R.A.",
        "english_text": "Alqamah bin Wail bin Hujr al-Hadrami said on the authority of the father: A man from Hadramaw and a man from kindah came to the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم. The hadrami said: Messenger of Allah, this (man) has seized land which belonged to my father. Al-Kindi said: That is my land in my possession and I cultivate it; he has no right to it. The Holy prophet (may peace be upon him) said to the Hadrami: Have you any proof? We said: No. he (the Prophet)said: Then he will swear an oath for you. He said: Messenger of Allah, he is a reprobate and he would not care to swear to anything and stick at nothing. He said: That is only your recourse",
        "malay_translation": "Alqamah bin Wail bin Hujr al-Hadrami meriwayatkan daripada ayahnya: Seorang lelaki dari Hadramaut dan seorang lelaki dari Kindah datang kepada Rasulullah ﷺ. Lelaki Hadrami itu berkata: Wahai Rasulullah, orang ini telah merampas tanah yang merupakan milik ayah saya. Lelaki Kindi itu berkata: Itu adalah tanah saya dalam milik saya dan saya mengusahakannya; dia tidak mempunyai hak ke atasnya. Nabi Suci ﷺ bersabda kepada lelaki Hadrami itu: Adakah kamu mempunyai bukti? Dia berkata: Tidak. Baginda (Nabi) bersabda: Maka dia akan bersumpah untuk kamu. Dia berkata: Wahai Rasulullah, dia adalah seorang yang fasik dan dia tidak akan peduli untuk bersumpah tentang apa sahaja dan tidak akan berhenti daripada melakukan apa-apa. Baginda bersabda: Itulah sahaja jalan keluar kamu.",
        "arabic_text": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو الْأَحْوَصِ، ‏‏‏‏‏‏عَنْ سِمَاكٍ، ‏‏‏‏‏‏عَنْ عَلْقَمَةَ بْنِ وَائِلِ بْنِ حُجْرٍ الْحَضْرَمِيِّ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ جَاءَ رَجُلٌ مِنْ حَضْرَمَوْتَ، ‏‏‏‏‏‏وَرَجُلٌ مِنْ كِنْدَةَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ الْحَضْرَمِيُّ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِنَّ هَذَا غَلَبَنِي عَلَى أَرْضٍ كَانَتْ لِأَبِي، ‏‏‏‏‏‏فَقَالَ الْكِنْدِيُّ:‏‏‏‏ هِيَ أَرْضِي فِي يَدِي أَزْرَعُهَا لَيْسَ لَهُ فِيهَا حَقٌّ، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْحَضْرَمِيِّ:‏‏‏‏ أَلَكَ بَيِّنَةٌ ؟ قَالَ:‏‏‏‏ لَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَلَكَ يَمِينُهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِنَّهُ فَاجِرٌ لَيْسَ يُبَالِي مَا حَلَفَ لَيْسَ يَتَوَرَّعُ مِنْ شَيْءٍ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ لَيْسَ لَكَ مِنْهُ إِلَّا ذَلِكَ ."
      },
      {
        "id": 22704,
        "hadith_number": "3624",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Nabi Meminta Orang Yahudi Bersumpah Tentang Hukuman Zina dalam Taurat",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah said: The holy Prophet صلی ‌اللہ ‌علیہ ‌وسلم said to the Jew: I adjure you by Allah Who sent down the Torah to Moses! do you not find in the Torah (a rule about a man) who commits adultery. He then narrated the rest of the tradition relating to the stoning.",
        "malay_translation": "Abu Hurairah meriwayatkan: Nabi suci صلی ‌اللہ ‌علیہ ‌وسلم bersabda kepada seorang Yahudi: 'Aku meminta kamu bersumpah dengan nama Allah yang menurunkan Taurat kepada Musa! Tidakkah kamu dapati dalam Taurat (hukum tentang seorang lelaki) yang melakukan zina?' Kemudian baginda meneruskan riwayat hadis yang berkaitan dengan rejam.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَخْبَرَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏حَدَّثَنَا رَجُلٌ مِنْ مُزَيْنَةَ وَنَحْنُ عِنْدَ سَعِيدِ بْنِ الْمُسَيِّبِ،‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْنِي لِلْيَهُودِ:‏‏‏‏ أَنْشُدُكُمْ بِاللَّهِ الَّذِي أَنْزَلَ التَّوْرَاةَ عَلَى مُوسَى، ‏‏‏‏‏‏مَا تَجِدُونَ فِي التَّوْرَاةِ عَلَى مَنْ زَنَى وَسَاقَ الْحَدِيثَ فِي قِصَّةِ الرَّجْمِ ."
      },
      {
        "id": 22705,
        "hadith_number": "3625",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Riwayat Lain dari Zuhri dengan Sanad Berbeza",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "The tradition mentioned above has also been transmitted by al-Zuhri through a different chain of narrator. This version has: A man from Muzainah who followed the knowledge and memorized it to me that Saeed bin al-Musayyab transmitted it. He then mentioned the rest of the tradition to the same effect.",
        "malay_translation": "Hadis yang disebutkan di atas juga telah diriwayatkan oleh al-Zuhri melalui sanad perawi yang berbeza. Versi ini menyebutkan: Seorang lelaki dari Muzainah yang mengikuti ilmu dan menghafalnya, menyampaikan kepada saya bahawa Saeed bin al-Musayyab meriwayatkannya. Kemudian beliau menyebutkan sisa hadis itu dengan maksud yang sama.",
        "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى أَبُو الْأَصْبَغِ، ‏‏‏‏‏‏حَدَّثَنِي مُحَمَّدٌ يَعْنِي ابْنَ سَلَمَةَ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ إِسْحَاق، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏بِهَذَا الْحَدِيثِ وَبِإِسْنَادِهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي رَجُلٌ مِنْ مُزْيَنَةَ مِمَّنْ كَانَ يَتَّبِعُ الْعِلْمَ وَيَعِيهِ، ‏‏‏‏‏‏يُحَدِّثُ سَعِيدَ بْنَ الْمُسَيِّبِ وَسَاقَ الْحَدِيثَ بِمَعْنَاهُ."
      },
      {
        "id": 22706,
        "hadith_number": "3626",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Peringatan Nabi kepada Ibn Suriya' tentang Nikmat Allah dan Hukuman Rejam",
        "perawi_melayu": "Ikrimah",
        "english_text": "Narrated Ikrimah: The Holy Prophet صلی ‌اللہ ‌علیہ ‌وسلم said to Ibn Suriya': I remind you by Allah Who saved you from the people of Pharaoh, made you cover the sea, gave you the shade of clouds, sent down to you manna and quails, sent down you Torah to Moses, do you find stoning (for adultery) in your Book? He said: You have reminded me by the Great. It is not possible for me to belie you. He then transmitted the rest of the tradition.",
        "malay_translation": "Diriwayatkan oleh Ikrimah: Nabi Suci صلی ‌اللہ ‌علیہ ‌وسلم bersabda kepada Ibn Suriya': Aku mengingatkanmu demi Allah yang telah menyelamatkan kamu dari kaum Firaun, menjadikan kamu menyeberangi laut, memberikan kamu naungan awan, menurunkan kepadamu manna dan burung puyuh, menurunkan Taurat kepada Musa, adakah kamu mendapati hukuman rejam (untuk zina) dalam Kitab kamu? Dia berkata: Kamu telah mengingatkan aku demi Yang Maha Agung. Tidak mungkin bagiku untuk mendustakanmu. Kemudian dia menyampaikan baki hadis tersebut.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،‏‏‏‏حَدَّثَنَا عَبْدُ الْأَعْلَى، ‏‏‏‏‏‏حَدَّثَنَا سَعِيدٌ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ:‏‏‏‏ أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ لَهُ يَعْنِي لِابْنِ صُورِيَا:‏‏‏‏ أُذَكِّرُكُمْ بِاللَّهِ الَّذِي نَجَّاكُمْ مِنْ آلِ فِرْعَوْنَ، ‏‏‏‏‏‏وَأَقْطَعَكُمُ الْبَحْرَ، ‏‏‏‏‏‏وَظَلَّلَ عَلَيْكُمُ الْغَمَامَ، ‏‏‏‏‏‏وَأَنْزَلَ عَلَيْكُمُ الْمَنَّ وَالسَّلْوَى، ‏‏‏‏‏‏وَأَنْزَلَ عَلَيْكُمُ التَّوْرَاةَ عَلَى مُوسَى أَتَجِدُونَ فِي كِتَابِكُمُ الرَّجْمَ ؟ قَالَ:‏‏‏‏ ذَكَّرْتَنِي بِعَظِيمٍ وَلَا يَسَعُنِي أَنْ أَكْذِبَكَ، ‏‏‏‏‏‏وَسَاقَ الْحَدِيثَ."
      },
      {
        "id": 22707,
        "hadith_number": "3627",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Menggunakan Akal dan Berserah Kepada Allah dalam Urusan",
        "perawi_melayu": "Awf ibn Malik",
        "english_text": "Narrated Awf ibn Malik: The Holy Prophet صلی ‌اللہ ‌علیہ ‌وسلم gave a decision between two men, and the one against whom the decision was given turned away and said: For me Allah sufficeth, and He is the best dispenser of affairs. The Holy Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Allah, Most High, blames for falling short, but apply intelligence, and when the matter gets the better of you, say; For me Allah sufficeth, and He is the best disposer of affairs.",
        "malay_translation": "Diriwayatkan daripada Awf ibn Malik: Sesungguhnya Nabi Suci صلی ‌اللہ ‌علیہ ‌وسلم membuat keputusan di antara dua orang lelaki, dan orang yang dikenakan keputusan itu berpaling dan berkata: 'Cukuplah Allah bagiku, dan Dia adalah sebaik-baik pengurus urusan.' Nabi Suci صلی ‌اللہ ‌علیہ ‌وسلم bersabda: 'Sesungguhnya Allah, Yang Maha Tinggi, mencela kelemahan, tetapi gunakanlah akal, dan apabila sesuatu perkara mengatasi kamu, maka katakanlah; 'Cukuplah Allah bagiku, dan Dia adalah sebaik-baik pengurus urusan.'",
        "arabic_text": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ نَجْدَةَ، ‏‏‏‏‏‏وَمُوسَى بْنُ مَرْوَانَ الرَّقِّيُّ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ، ‏‏‏‏‏‏عَنْ بَحِيرِ بْنِ سَعْدٍ، ‏‏‏‏‏‏عَنْ خَالِدِ بْنِ مَعْدَانَ، ‏‏‏‏‏‏عَنْ سَيْفٍ، ‏‏‏‏‏‏عَنْ عَوْفِ بْنِ مَالِكٍ، ‏‏‏‏‏‏أَنَّهُ حَدَّثَهُمْ:‏‏‏‏ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏ قَضَى بَيْنَ رَجُلَيْنِ، ‏‏‏‏‏‏فَقَالَ الْمَقْضِيُّ عليْهِ لَمَّا أَدْبَرَ:‏‏‏‏ حَسْبِيَ اللَّهُ وَنِعْمَ الْوَكِيلُ، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ اللَّهَ يَلُومُ عَلَى الْعَجْزِ، ‏‏‏‏‏‏وَلَكِنْ عَلَيْكَ بِالْكَيْسِ، ‏‏‏‏‏‏فَإِذَا غَلَبَكَ أَمْرٌ، ‏‏‏‏‏‏فَقُلْ:‏‏‏‏ حَسْبِيَ اللَّهُ وَنِعْمَ الْوَكِيلُ ."
      },
      {
        "id": 22708,
        "hadith_number": "3628",
        "status": "sahih",
        "nama_buku": "Sunan Abu Daud",
        "penulis_buku": "Imam Abu Daud Sulaiman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Kelewatan Pembayaran Hutang oleh Orang Mampu Membolehkan Hukuman",
        "perawi_melayu": "Diriwayatkan daripada Ash-Sharid",
        "english_text": "Narrated Ash-Sharid: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Delay in payment on the part of one who possesses means makes it lawful to dishonour and punish him. Ibn al-Mubarak said that dishonour means that he may be spoken to roughly and punish means he may be imprisoned for it.",
        "malay_translation": "Diriwayatkan daripada Ash-Sharid: Nabi Muhammad صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Kelewatan pembayaran hutang oleh orang yang mampu menjadikannya halal untuk dicela dan dihukum. Ibn al-Mubarak berkata bahawa celaan bermaksud dia boleh ditegur dengan kasar dan hukuman bermaksud dia boleh dipenjarakan kerananya.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، ‏‏‏‏‏‏عَنْ وَبْرِ بْنِ أَبِي دُلَيْلَةَ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ مَيْمُونٍ، ‏‏‏‏‏‏عَنْعَمْرِو بْنِ الشَّرِيدِ،‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَيُّ الْوَاجِدِ يُحِلُّ عِرْضَهُ وَعُقُوبَتَهُ ، ‏‏‏‏‏‏قَالَ ابْنُ الْمُبَارَكِ:‏‏‏‏ يُحِلُّ عِرْضَهُ:‏‏‏‏ يُغَلَّظُ لَهُ، ‏‏‏‏‏‏وَعُقُوبَتَهُ:‏‏‏‏ يُحْبَسُ لَهُ."
      },
      {
        "id": 22709,
        "hadith_number": "3629",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Nasihat Nabi tentang Tawanan dan Penghutang",
        "perawi_melayu": "Tidak diketahui",
        "english_text": "Narrated Grandfather of Hirmas ibn Habib: I brought my debtor to the Holy Prophet صلی ‌اللہ ‌علیہ ‌وسلم. He said to me: Stick to him. He again said to me: O brother of Banu Tamim, what do you want to do with your prisoner.",
        "malay_translation": "Diriwayatkan daripada datuk Hirmas ibn Habib: Aku membawa orang yang berhutang kepadaku kepada Nabi Suci صلی ‌اللہ ‌علیہ ‌وسلم. Baginda bersabda kepadaku: Pegang dia. Baginda bersabda lagi kepadaku: Wahai saudara Bani Tamim, apa yang kamu ingin lakukan kepada tawananmu?",
        "arabic_text": "حَدَّثَنَا مُعَاذُ بْنُ أَسَدٍ، ‏‏‏‏‏‏حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ، ‏‏‏‏‏‏أَخْبَرَنَا هِرْمَاسُ بْنُ حَبِيبٍ رَجُلٌ مِنْ أَهْلِ الْبَادِيَةِ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْجَدَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِغَرِيمٍ لِي، ‏‏‏‏‏‏فَقَالَ لِي:‏‏‏‏ الْزَمْهُ، ‏‏‏‏‏‏ثُمَّ قَالَ لِي:‏‏‏‏ يَا أَخَا بَنِي تَمِيمٍ، ‏‏‏‏‏‏مَا تُرِيدُ أَنْ تَفْعَلَ بِأَسِيرِكَ ؟ ."
      },
      {
        "id": 22710,
        "hadith_number": "3630",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Nabi Memenjarakan Seseorang Atas Sangkaan",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Bahz bin Hakim, on his father's authority, said that his grandfather told that the Prophet صلی ‌اللہ ‌علیہ ‌وسلم imprisoned a man on suspicion.",
        "malay_translation": "Bahz bin Hakim, daripada ayahnya, berkata bahawa datuknya memberitahu bahawa Nabi صلی ‌اللہ ‌علیہ ‌وسلم memenjarakan seorang lelaki atas sangkaan.",
        "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ، ‏‏‏‏‏‏أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏عَنْ مَعْمَرٍ، ‏‏‏‏‏‏عَنْ بَهْزِ بْنِ حَكِيمٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ:‏‏‏‏ أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَبَسَ رَجُلًا فِي تُهْمَةٍ ."
      },
      {
        "id": 22711,
        "hadith_number": "3631",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Permintaan untuk Membebaskan Jiran yang Ditangkap Semasa Khutbah",
        "perawi_melayu": "Muawiyah bin Haidah Radiyallahu Anhu",
        "english_text": "Bahz ibn Hakim reported from his grandfather: (Ibn Qudamah's version has: His grandfather's brother or uncle reported: ) - the narrator Mu'ammal said: - He (his grandfather Muawiyah) got up before the Holy Prophet صلی ‌اللہ ‌علیہ ‌وسلم who was giving sermon: and he said: Why have your companions arrested my neighbours? He turned away from him twice. He (his grandfather Muawiyah) then mentioned something. The Holy Prophet صلی ‌اللہ ‌علیہ ‌وسلم then said: Let his neighbours go. (Mu'ammal did not mention the words He was giving sermon. )",
        "malay_translation": "Bahz bin Hakim meriwayatkan daripada datuknya: (Versi Ibn Qudamah ada: Saudara lelaki datuknya atau bapa saudara meriwayatkan: ) - perawi Mu'ammal berkata: - Dia (datuknya Muawiyah) bangun di hadapan Nabi Suci صلی ‌اللہ ‌علیہ ‌وسلم yang sedang berkhutbah: dan dia berkata: Mengapa sahabat-sahabatmu menangkap jiran-jiranku? Baginda berpaling daripadanya dua kali. Dia (datuknya Muawiyah) kemudian menyebut sesuatu. Nabi Suci صلی ‌اللہ ‌علیہ ‌وسلم kemudian bersabda: Biarkan jiran-jirannya pergi. (Mu'ammal tidak menyebut perkataan Baginda sedang berkhutbah. )",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ قُدَامَةَ، ‏‏‏‏‏‏وَمُؤَمَّلُ بْنُ هِشَامٍ، ‏‏‏‏‏‏قَالَ ابْنُ قُدَامَةَ، ‏‏‏‏‏‏حَدَّثَنِي إِسْمَاعِيل، ‏‏‏‏‏‏عَنْ بَهْزِ بْنِ حَكِيمٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْجَدِّهِ، ‏‏‏‏‏‏قَالَ ابْنُ قُدَامَةَ:‏‏‏‏ إِنَّ أَخَاهُ أَوْ عَمَّهُ، ‏‏‏‏‏‏وَقَالَ مُؤَمَّل:‏‏‏‏ إِنَّهُ قَامَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَخْطُبُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ جِيرَانِي بِمَا أُخِذُوا، ‏‏‏‏‏‏فَأَعْرَضَ عَنْهُ مَرَّتَيْنِ، ‏‏‏‏‏‏ثُمَّ ذَكَرَ شَيْئًا، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ خَلُّوا لَهُ عَنْ جِيرَانِهِ ، ‏‏‏‏‏‏لَمْ يَذْكُرْ مُؤَمَّلٌ وَهُوَ يَخْطُبُ."
      },
      {
        "id": 22712,
        "hadith_number": "3632",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Perintah Mengambil Kurma dari Wakil Nabi di Khaybar",
        "perawi_melayu": "Jabir ibn Abdullah",
        "english_text": "Narrated Jabir ibn Abdullah: I intended to go (on expedition) to Khaybar. So I came to the Holy Prophet صلی ‌اللہ ‌علیہ ‌وسلم, greeted him and said: I am intending to go to Khaybar. He said: When you come to my agent, you should take from him fifteen wasqs (of dates). If he asks you for a sign, then place your hand on his collar-bone.",
        "malay_translation": "Diriwayatkan oleh Jabir ibn Abdullah: Saya berniat untuk pergi (dalam ekspedisi) ke Khaybar. Kemudian saya datang kepada Nabi Suci صلی ‌اللہ ‌علیہ ‌وسلم, memberi salam kepadanya dan berkata: Saya berniat untuk pergi ke Khaybar. Baginda bersabda: Apabila kamu datang kepada wakilku, kamu hendaklah mengambil daripadanya lima belas wasq (kurma). Jika dia meminta tanda daripadamu, maka letakkan tanganmu di tulang selangka.",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ، ‏‏‏‏‏‏حَدَّثَنَا عَمِّي، ‏‏‏‏‏‏حَدَّثَنَا أَبِي، ‏‏‏‏‏‏عَنِ ابْنِ إِسْحَاق، ‏‏‏‏‏‏عَنْ أَبِي نُعَيْمٍ وَهْبِ بْنِ كَيْسَانَ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏أَنَّهُ سَمِعَهُ يُحَدِّثُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَرَدْتُ الْخُرُوجَ إِلَى خَيْبَرَ، ‏‏‏‏‏‏فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَسَلَّمْتُ عَلَيْهِ، ‏‏‏‏‏‏وَقُلْتُ لَهُ:‏‏‏‏ إِنِّي أَرَدْتُ الْخُرُوجَ إِلَى خَيْبَرَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِذَا أَتَيْتَ وَكِيلِي فَخُذْ مِنْهُ خَمْسَةَ عَشَرَ وَسْقًا، ‏‏‏‏‏‏فَإِنِ ابْتَغَى مِنْكَ آيَةً فَضَعْ يَدَكَ عَلَى تَرْقُوَتِهِ ."
      },
      {
        "id": 22713,
        "hadith_number": "3633",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Ruang Tepi Jalan Jika Berselisih",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Narrated Abu Hurairah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: If you dispute over a pathway, leave the margin of seven yards.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah: Nabi Muhammad صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Jika kamu bertelingkah mengenai jalan, tinggalkan ruang tepi sebanyak tujuh hasta.",
        "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏حَدَّثَنَا الْمُثَنَّى بْنُ سَعِيدٍ، ‏‏‏‏‏‏حَدَّثَنَا قَتَادَةُ، ‏‏‏‏‏‏عَنْ بُشَيْرِ بْنِ كَعْبٍ الْعَدَوِيِّ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِذَا تَدَارَأْتُمْ فِي طَرِيقٍ فَاجْعَلُوهُ سَبْعَةَ أَذْرُعٍ ."
      },
      {
        "id": 22714,
        "hadith_number": "3634",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Menghalang Jiran Memasang Pasak di Dinding",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Abu Hurairah reported the Holy Prophet صلی ‌اللہ ‌علیہ ‌وسلم as saying: When one of you asks permission for inserting a wooden peg in his wall, he should not prevent him. So they (the people) lowered down their heads. Then he (Abu Hurairah) said: What is the matter ? I am seeing you are neglecting (to hear this tradition), I shall spread it among you. Abu Dawud said: This is the tradition of Ibn Abi Khalaf is more perfect.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Nabi Muhammad صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Apabila salah seorang daripada kamu meminta izin kepada saudaranya untuk memasukkan pasak kayu ke dindingnya, maka janganlah dia menghalangnya. Maka mereka (orang ramai) menundukkan kepala mereka. Kemudian beliau (Abu Hurairah) berkata: Apa masalahnya? Aku melihat kamu mengabaikan (untuk mendengar hadis ini), aku akan menyebarkannya di antara kamu. Abu Daud berkata: Ini adalah hadis Ibn Abi Khalaf dan ia lebih sempurna.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏وَابْنُ أَبِي خَلَفٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ الْأَعْرَجِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا اسْتَأْذَنَ أَحَدُكُمْ أَخَاهُ أَنْ يَغْرِزَ خَشَبَةً فِي جِدَارِهِ فَلَا يَمْنَعُهُ، ‏‏‏‏‏‏فَنَكَّسُوا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا لِي أَرَاكُمْ قَدْ أَعْرَضْتُمْ ؟ لَأُلْقِيَنَّهَا بَيْنَ أَكْتَافِكُمْ ، ‏‏‏‏‏‏قَالَ أَبُو دَاوُد:‏‏‏‏ وَهَذَا حَدِيثُ ابْنِ أَبِي خَلَفٍ وَهُوَ أَتَمُّ."
      },
      {
        "id": 22715,
        "hadith_number": "3635",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Akibat Menyakiti dan Memusuhi Orang Lain",
        "perawi_melayu": "Abu Sirmah RA",
        "english_text": "Narrated Abu Sirmah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: If anyone harms (others), Allah will harm him, and if anyone shows hostility to others, Allah will show hostility to him.",
        "malay_translation": "Diriwayatkan dari Abu Sirmah: Nabi Muhammad ﷺ bersabda: Sesiapa yang menyakiti (orang lain), Allah akan menyakitinya, dan sesiapa yang menunjukkan permusuhan kepada orang lain, Allah akan menunjukkan permusuhan kepadanya.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، ‏‏‏‏‏‏حَدَّثَنَا اللَّيْثُ، ‏‏‏‏‏‏عَنْ يَحْيَى، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، ‏‏‏‏‏‏عَنْ لُؤْلُؤَةَ، ‏‏‏‏‏‏عَنْ أَبِي صِرْمَةَ، ‏‏‏‏‏‏قَالَ أَبُو دَاوُدَ:‏‏‏‏ غَيْرُ قُتَيْبَةَ فِي هَذَا الْحَدِيثِ، ‏‏‏‏‏‏عَنْ أَبِي صِرْمَةَ صَاحِبِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏أَنَّهُ قَالَ:‏‏‏‏ مَنْ ضَارَّ أَضَرَّ اللَّهُ بِهِ، ‏‏‏‏‏‏وَمَنْ شَاقَّ شَاقَّ اللَّهُ عَلَيْهِ ."
      },
      {
        "id": 22716,
        "hadith_number": "3636",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Arahan Mencabut Pokok Kurma yang Memudaratkan",
        "perawi_melayu": "Samurah ibn Jundub RA meriwayatkan bahawa",
        "english_text": "Abu Jafar Muhammad bin Ali reported from Samurah ibn Jundub that he had a row of palm-trees in the garden of a man of the Ansar. The man had his family with him. Samurah used to visit his palm-trees, and the man was annoyed by that and felt it keenly. So he asked him (Samurah) to sell them to him, but he refused. He then asked him to take something else in exchange, but he refused. So he came to the Holy Prophet صلی ‌اللہ ‌علیہ ‌وسلم and mentioned it to him. The Holy Prophet صلی ‌اللہ ‌علیہ ‌وسلم asked him to sell it to him, but he refused. He asked him to take something else in exchange, but he refused. He then said: Give it to him and you can have such and such, mentioning something with which he tried to please him, but he refused. He then said: You are a nuisance. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم then said to the Ansari: Go and uproot his palm-trees.",
        "malay_translation": "Abu Jaafar Muhammad bin Ali meriwayatkan daripada Samurah ibn Jundub bahawa beliau memiliki sebaris pokok kurma di kebun seorang lelaki Ansar. Lelaki itu tinggal bersama keluarganya. Samurah sering mengunjungi pokok kurmanya, dan lelaki itu merasa terganggu dan sangat tidak senang dengan hal itu. Oleh itu, dia meminta Samurah untuk menjualnya kepadanya, tetapi Samurah enggan. Kemudian dia meminta Samurah untuk mengambil sesuatu yang lain sebagai ganti, tetapi Samurah tetap enggan. Lalu, lelaki itu datang kepada Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم dan menceritakan hal ini kepada baginda. Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم meminta Samurah untuk menjualnya, tetapi Samurah enggan. Baginda meminta Samurah untuk mengambil sesuatu yang lain sebagai ganti, tetapi Samurah tetap enggan. Kemudian baginda bersabda: 'Berikan saja kepadanya dan kamu akan mendapat itu dan ini,' menyebutkan sesuatu yang dengannya baginda cuba untuk menggembirakannya, tetapi Samurah tetap enggan. Kemudian baginda bersabda: 'Kamu ini menyusahkan.' Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم kemudian bersabda kepada orang Ansar itu: 'Pergi dan cabutlah pokok kurmanya.'",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادٌ، ‏‏‏‏‏‏حَدَّثَنَا وَاصِلٌ مَوْلَى أَبِي عُيَيْنَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ أَبَا جَعْفَرٍ مُحَمَّدَ بْنَ عَلِيٍّيُحَدِّثُ، ‏‏‏‏‏‏عَنْ سَمُرَةَ بْنِ جُنْدُبٍ أَنَّهُ كَانَتْ لَهُ عَضُدٌ مِنْ نَخْلٍ فِي حَائِطِ رَجُلٍ مِنْ الْأَنْصَارِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَمَعَ الرَّجُلِ أَهْلُهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَكَانَ سَمُرَةُ يَدْخُلُ إِلَى نَخْلِهِ فَيَتَأَذَّى بِهِ وَيَشُقُّ عَلَيْهِ، ‏‏‏‏‏‏فَطَلَبَ إِلَيْهِ أَنْ يَبِيعَهُ، ‏‏‏‏‏‏فَأَبَى، ‏‏‏‏‏‏فَطَلَبَ إِلَيْهِ أَنْ يُنَاقِلَهُ، ‏‏‏‏‏‏فَأَبَى، ‏‏‏‏‏‏فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ، ‏‏‏‏‏‏فَطَلَبَ إِلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَبِيعَهُ، ‏‏‏‏‏‏فَأَبَى، ‏‏‏‏‏‏فَطَلَبَ إِلَيْهِ أَنْ يُنَاقِلَهُ، ‏‏‏‏‏‏فَأَبَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَهِبْهُ لَهُ وَلَكَ كَذَا وَكَذَا أَمْرًا رَغَّبَهُ فِيهِ، ‏‏‏‏‏‏فَأَبَى، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَنْتَ مُضَارٌّ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْأَنْصَارِيِّ:‏‏‏‏ اذْهَبْ فَاقْلَعْ نَخْلَهُ ."
      },
      {
        "id": 22717,
        "hadith_number": "3637",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Arahan Nabi tentang Pembahagian Air dan Keutamaan Jiran",
        "perawi_melayu": "Abdullah ibn az-Zubayr",
        "english_text": "Narrated Abdullah ibn az-Zubayr: A man disputed with az-Zubayr about streamlets in the lava plain which was irrigated by them. The Ansari said: Release the water and let it run, but az-Zubayr refused. The Holy Prophet صلی ‌اللہ ‌علیہ ‌وسلم said to az-Zubayr: Water (your ground), Zubayr, then let the water run to your neighbour. The Ansari then became angry and said: Messenger of Allah! it is because he is your cousin! Thereupon the face of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم changed colour and he said: Water (your ground), then keep back the water till it returns to the embankment. Az-Zubayr said: By Allah! I think this verse came down about that: But no, by thy Lord! they can have no (real) faith, until they make thee judge. . . . .",
        "malay_translation": "Diriwayatkan daripada Abdullah ibn az-Zubayr: Seorang lelaki bertengkar dengan az-Zubayr mengenai anak sungai di dataran lava yang diairi oleh mereka. Orang Ansar itu berkata: Lepaskan airnya dan biarkan ia mengalir, tetapi az-Zubayr enggan. Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda kepada az-Zubayr: Siramlah (tanah kamu), Zubayr, kemudian biarkan air itu mengalir kepada jiran kamu. Orang Ansar itu kemudian menjadi marah dan berkata: Wahai Rasulullah! Adakah kerana dia adalah sepupu kamu! Maka wajah Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم berubah warna dan baginda bersabda: Siramlah (tanah kamu), kemudian tahan air itu sehingga ia kembali ke tambak. Az-Zubayr berkata: Demi Allah! Saya rasa ayat ini diturunkan mengenai hal itu: Maka demi Tuhanmu, mereka (pada hakikatnya) tidak beriman hingga mereka menjadikan engkau hakim dalam perkara yang mereka perselisihkan....",
        "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ، ‏‏‏‏‏‏حَدَّثَنَا اللَّيْثِ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏أَنَّ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ حَدَّثَهُ:‏‏‏‏ أَنَّ رَجُلًا خَاصَمَ الزُّبَيْرَ فِي شِرَاجِ الْحَرَّةِ الَّتِي يَسْقُونَ بِهَا، ‏‏‏‏‏‏فَقَالَ الْأَنْصَارِيُّ:‏‏‏‏ سَرِّحْ الْمَاءَ يَمُرُّ، ‏‏‏‏‏‏فَأَبَى عَلَيْهِ الزُّبَيْرُ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلزُّبَيْرِ:‏‏‏‏ اسْقِ يَا زُبَيْرُ، ‏‏‏‏‏‏ثُمَّ أَرْسِلْ إِلَى جَارِكَ، ‏‏‏‏‏‏فَغَضِبَ الْأَنْصَارِيُّ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏أَنْ كَانَ ابْنَ عَمَّتِكَ ؟، ‏‏‏‏‏‏فَتَلَوَّنَ وَجْهُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ اسْقِ، ‏‏‏‏‏‏ثُمَّ احْبِسِ الْمَاءَ حَتَّى يَرْجِعَ إِلَى الْجَدْرِ، ‏‏‏‏‏‏فَقَالَ الزُّبَيْرُ:‏‏‏‏ فَوَاللَّهِ إِنِّي لَأَحْسَبُ هَذِهِ الْآيَةَ نَزَلَتْ فِي ذَلِكَ:‏‏‏‏ فَلا وَرَبِّكَ لا يُؤْمِنُونَ حَتَّى يُحَكِّمُوكَ سورة النساء آية 65 ."
      },
      {
        "id": 22718,
        "hadith_number": "3638",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukum Pembahagian Air: Tidak Menahan Air Melebihi Paras Buku Lali",
        "perawi_melayu": "Thalabah ibn Abu Malik",
        "english_text": "Narrated Thalabah ibn Abu Malik: Thalabah heard his elders say that a man from the Quraysh had his share with Banu Qurayzah (in water). He brought the dispute to the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم about al-Mahzur, a stream whose water they shared together. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم then decided that when water reached the ankles waters should not be held back to flow to the lower.",
        "malay_translation": "Diriwayatkan daripada Thalabah ibn Abu Malik: Thalabah mendengar para tetuanya berkata bahawa seorang lelaki dari Quraisy mempunyai bahagian dengan Bani Quraizah (dalam air). Dia membawa pertikaian ini kepada Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم mengenai al-Mahzur, iaitu sebuah anak sungai yang airnya mereka kongsi bersama. Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم kemudian memutuskan bahawa apabila air mencapai paras buku lali, air tidak boleh ditahan untuk mengalir ke bahagian yang lebih rendah.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو أُسَامَةَ، ‏‏‏‏‏‏عَنِ الْوَلِيدِ يَعْنِي ابْنَ كَثِيرٍ، ‏‏‏‏‏‏عَنْ أَبِي مَالِكِ بْنِ ثَعْلَبَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ ثَعْلَبَةَ بْنِ أَبِي مَالِكٍ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ كُبَرَاءَهُمْ يَذْكُرُونَ:‏‏‏‏ أَنَّ رَجُلًا مِنْ قُرَيْشٍ كَانَ لَهُ سَهْمٌ فِي بَنِي قُرَيْظَةَ، ‏‏‏‏‏‏فَخَاصَمَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَهْزُورٍ يَعْنِي السَّيْلَ الَّذِي يَقْتَسِمُونَ مَاءَهُ، ‏‏‏‏‏‏فَقَضَى بَيْنَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ الْمَاءَ إِلَى الْكَعْبَيْنِ لَا يَحْبِسُ الْأَعْلَى عَلَى الْأَسْفَلِ ."
      },
      {
        "id": 22719,
        "hadith_number": "3639",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Keputusan Rasulullah SAW tentang Air Aliran Al-Mahzur",
        "perawi_melayu": "Amr bin Shuaib, dari ayahnya, dari datuknya",
        "english_text": "Amr bin Shuaib on his father's authority said that his grandfather told that the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم decided regarding the stream al-Mahzur that its water should be held back till it reached the ankles, and that the upper waters should then be allowed to flow to the lower.",
        "malay_translation": "Amr bin Shuaib, berdasarkan autoriti bapanya, berkata bahawa datuknya memberitahu bahawa Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم memutuskan mengenai aliran al-Mahzur bahawa airnya harus ditahan sehingga mencapai paras buku lali, dan air di bahagian atas kemudiannya harus dibenarkan mengalir ke bahagian bawah.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ، ‏‏‏‏‏‏حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏حَدَّثَنِي أَبِي عَبْدُ الرَّحْمَنِ بْنُ الْحَارِثِ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ:‏‏‏‏ أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى فِي السَّيْلِ الْمَهْزُورِ أَنْ يُمْسَكَ حَتَّى يَبْلُغَ الْكَعْبَيْنِ، ‏‏‏‏‏‏ثُمَّ يُرْسِلُ الْأَعْلَى عَلَى الْأَسْفَلِ ."
      },
      {
        "id": 22720,
        "hadith_number": "3640",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Penyelesaian Pertikaian Sempadan Pokok Kurma",
        "perawi_melayu": "Abu Saeed al-Khudri",
        "english_text": "Narrated Abu Saeed al-Khudri: Two men brought their dispute about the precincts of a palm-tree to the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم. According to a version of this tradition, he ordered to measure and it was measured. It was found seven yards. According to another version, it was found five yards. He made a decision according to that. Abdul Aziz said: He ordered to measure with a branch of its branches. It was then measured.",
        "malay_translation": "Diriwayatkan daripada Abu Saeed al-Khudri: Dua orang lelaki membawa pertikaian mereka mengenai sempadan sebatang pokok kurma kepada Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم. Menurut satu riwayat hadis ini, baginda memerintahkan untuk mengukur dan ia diukur. Didapati tujuh hasta. Menurut riwayat lain, didapati lima hasta. Baginda membuat keputusan berdasarkan ukuran tersebut. Abdul Aziz berkata: Baginda memerintahkan untuk mengukur dengan pelepah dari pelepah pokok kurma itu. Kemudian ia diukur.",
        "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ، ‏‏‏‏‏‏أَنَّ مُحَمَّدَ بْنَ عُثْمَانَ حَدَّثَهُمْ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏عَنْ أَبِي طُوَالَةَ، ‏‏‏‏‏‏وَعَمْرُو بْنُ يَحْيَى، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ اخْتَصَمَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلَانِ فِي حَرِيمِ نَخْلَةٍ فِي حَدِيثِ أَحَدِهِمَا، ‏‏‏‏‏‏فَأَمَرَ بِهَا فَذُرِعَتْ، ‏‏‏‏‏‏فَوُجِدَتْ سَبْعَةَ أَذْرُعٍ، ‏‏‏‏‏‏وَفِي حَدِيثِ الْآخَرِ، ‏‏‏‏‏‏فَوُجِدَتْ خَمْسَةَ أَذْرُعٍ، ‏‏‏‏‏‏فَقَضَى بِذَلِكَ ، ‏‏‏‏‏‏قَالَ عَبْدُ الْعَزِيزِ:‏‏‏‏ فَأَمَرَ بِجَرِيدَةٍ مِنْ جَرِيدِهَا فَذُرِعَتْ."
      }
    ]
  }
}