{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 129,
    "data": [
      {
        "id": 21126,
        "hadith_number": "2046",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Anjuran Berkahwin Bagi Yang Mampu dan Kelebihan Puasa Bagi Yang Tidak Mampu",
        "perawi_melayu": "Alqamah meriwayatkan",
        "english_text": "Alqamah said “I was going with Abd Allaah bin Masud at Mina where Uthman met him and desired to have a talk with him in privacy”. When Abd Allaah (bin Masud) thought there was no need of privacy, he said to me “Come, Alqamah So I came (to him)”. Then Uthman said to him “Should we not marry you, Abu Abd Al Rahman to a virgin girl, so that the power you have lost may return to you?” Abd Allaah (bin Masud) said “If you say that, I heard the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم say “ Those of you who can support a wife, should marry, for it keeps you from looking at strange women and preserve from unlawful intercourse, but those who cannot should devote themselves to fasting, for it is a means of suppressing sexual desire.",
        "malay_translation": "Alqamah berkata, “Saya sedang berjalan bersama Abd Allaah bin Masud di Mina apabila Uthman bertemu dengannya dan ingin berbicara dengannya secara peribadi”. Apabila Abd Allaah (bin Masud) berpendapat tidak perlu berahsia, beliau berkata kepada saya, “Mari, Alqamah”. Maka saya pun datang (kepadanya). Kemudian Uthman berkata kepadanya, “Tidakkah kita patut menikahkanmu, wahai Abu Abd Al Rahman, dengan seorang gadis perawan, supaya kekuatan yang telah hilang daripadamu dapat kembali kepadamu?” Abd Allaah (bin Masud) berkata, “Jika kamu berkata demikian, sesungguhnya saya telah mendengar Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda, “Sesiapa di antara kamu yang mampu untuk berkahwin, maka berkahwinlah, kerana ia lebih menundukkan pandangan dan memelihara kemaluan. Dan sesiapa yang tidak mampu, maka hendaklah dia berpuasa, kerana ia adalah perisai baginya.”",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا جَرِيرٌ، ‏‏‏‏‏‏عَنْ الْأَعْمَشِ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ عَلْقَمَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنِّي لَأَمْشِي مَعَ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ بِمِنًى، ‏‏‏‏‏‏إِذْ لَقِيَهُ عُثْمَانُ فَاسْتَخْلَاهُ، ‏‏‏‏‏‏فَلَمَّا رَأَى عَبْدُ اللَّهِ أَنْ لَيْسَتْ لَهُ حَاجَةٌ، ‏‏‏‏‏‏قَالَ لِي:‏‏‏‏ تَعَالَ يَا عَلْقَمَةُ، ‏‏‏‏‏‏فَجِئْتُ، ‏‏‏‏‏‏فَقَالَ لَهُ عُثْمَانُ:‏‏‏‏ أَلَا نُزَوِّجُكَ يَا أَبَا عَبْدِ الرَّحْمَنِ بِجَارِيَةٍ بِكْرٍ، ‏‏‏‏‏‏لَعَلَّهُ يَرْجِعُ إِلَيْكَ مِنْ نَفْسِكَ مَا كُنْتَ تَعْهَدُ ؟ فَقَالَ عَبْدُ اللَّهِ:‏‏‏‏ لَئِنْ قُلْتَ ذَاكَ، ‏‏‏‏‏‏لَقَدْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ مَنِ اسْتَطَاعَ مِنْكُمُ الْبَاءَةَ فَلْيَتَزَوَّجْ، ‏‏‏‏‏‏فَإِنَّهُ أَغَضُّ لِلْبَصَرِ وَأَحْصَنُ لِلْفَرْجِ، ‏‏‏‏‏‏وَمَنْ لَمْ يَسْتَطِعْ مِنْكُمْ فَعَلَيْهِ بِالصَّوْمِ فَإِنَّهُ لَهُ وِجَاءٌ ."
      },
      {
        "id": 21127,
        "hadith_number": "2047",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Sebab-sebab Wanita Dinikahi dan Keutamaan Agama",
        "perawi_melayu": "Diriwayatkan dari Abu Hurairah RA",
        "english_text": "Abu Hurairah reported the Prophet صلی ‌اللہ ‌علیہ ‌وسلم as saying “Women may be married for four reasons: for her property, her ranks, her beauty and her religiosity. So get the one who is religious and prosper (lit. may your hands cleave to the dust). ”",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda, “Wanita dinikahi kerana empat perkara: kerana hartanya, keturunannya, kecantikannya dan agamanya. Maka pilihlah wanita yang beragama, nescaya engkau beruntung (secara harfiah: semoga tanganmu berdebu).",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ، ‏‏‏‏‏‏حَدَّثَنِي عُبَيْدُ اللَّهِ، ‏‏‏‏‏‏حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ تُنْكَحُ النِّسَاءُ لِأَرْبَعٍ:‏‏‏‏ لِمَالِهَا وَلِحَسَبِهَا وَلِجَمَالِهَا وَلِدِينِهَا، ‏‏‏‏‏‏فَاظْفَرْ بِذَاتِ الدِّينِ تَرِبَتْ يَدَاكَ ."
      },
      {
        "id": 21128,
        "hadith_number": "2048",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Anjuran Mengahwini Anak Dara",
        "perawi_melayu": "Jabir bin Abdullah meriwayatkan",
        "english_text": "Jabir bin Abdullah said “The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said to me “Did you marry?” I said “Yes”. He again said “Virgin or Non Virgin (woman previously married)?” I said “Non Virgin”. He said “Why (did you) not (marry) a virgin with whom you could sport and she could sport with you.",
        "malay_translation": "Jabir bin Abdullah berkata, “Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda kepadaku, “Adakah kamu sudah berkahwin?” Aku menjawab, “Ya.” Baginda bertanya lagi, “Dara atau janda (wanita yang pernah berkahwin)?” Aku menjawab, “Janda.” Baginda bersabda, “Mengapa kamu tidak (berkahwin) dengan anak dara supaya kamu boleh bergurau dengannya dan dia boleh bergurau denganmu?”",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو مُعَاوِيَةَ، ‏‏‏‏‏‏أَخْبَرَنَا الْأَعْمَشُ، ‏‏‏‏‏‏عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَتَزَوَّجْتَ ؟ قُلْتُ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ بِكْرًا أَمْ ثَيِّبًا ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ ثَيِّبًا ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَفَلَا بِكْرٌ تُلَاعِبُهَا وَتُلَاعِبُكَ ؟ ."
      },
      {
        "id": 21129,
        "hadith_number": "2049",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Isteri yang Tidak Menolak Sentuhan Lelaki Lain",
        "perawi_melayu": "Abdullah ibn Abbas meriwayatkan",
        "english_text": "Narrated Abdullah ibn Abbas: A man came to the Prophet صلی ‌اللہ ‌علیہ ‌وسلم, and said: My wife does not prevent the hand of a man who touches her. He said: Divorce her. He then said: I am afraid my inner self may covet her. He said: Then enjoy her.",
        "malay_translation": "Abdullah ibn Abbas meriwayatkan: Seorang lelaki datang kepada Nabi صلی ‌اللہ ‌علیہ ‌وسلم, dan berkata: Isteriku tidak menghalang tangan seorang lelaki yang menyentuhnya. Baginda bersabda: Ceraikan dia. Kemudian dia berkata: Aku khuatir diriku akan menginginkannya. Baginda bersabda: Maka berseronoklah dengannya.",
        "arabic_text": "قَالَ أَبُو دَاوُد:‏‏‏‏ كَتَبَ إِلَيَّ حُسَيْنُ بْنُ حُرَيْثٍ الْمَرْوَزِيُّ، ‏‏‏‏‏‏حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، ‏‏‏‏‏‏عَنْ الْحُسَيْنِ بْنِ وَاقِدٍ، ‏‏‏‏‏‏عَنْ عُمَارَةَ بْنِ أَبِي حَفْصَةَ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنَّ امْرَأَتِي لَا تَمْنَعُ يَدَ لَامِسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ غَرِّبْهَا ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخَافُ أَنْ تَتْبَعَهَا نَفْسِي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَاسْتَمْتِعْ بِهَا ."
      },
      {
        "id": 21130,
        "hadith_number": "2050",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Anjuran Mengahwini Wanita Subur dan Penyayang",
        "perawi_melayu": "Diriwayatkan daripada Maqil ibn Yasar R.A.",
        "english_text": "Narrated Maqil ibn Yasar: A man came to the Prophet صلی ‌اللہ ‌علیہ ‌وسلم and said: I have found a woman of rank and beauty, but she does not give birth to children. Should I marry her? He said: No. He came again to him, but he prohibited him. He came to him third time, and he (the Prophet) said: Marry women who are loving and very prolific, for I shall outnumber the peoples by you.",
        "malay_translation": "Diriwayatkan daripada Maqil ibn Yasar R.A.: Seorang lelaki datang kepada Nabi صلی ‌اللہ ‌علیہ ‌وسلم dan berkata: Saya telah menemui seorang wanita yang berkedudukan dan cantik, tetapi dia tidak melahirkan anak. Patutkah saya mengahwininya? Baginda bersabda: Tidak. Dia datang lagi kepadanya, tetapi baginda melarangnya. Dia datang kepadanya kali ketiga, dan baginda (Nabi) bersabda: Kahwinilah wanita yang penyayang dan sangat subur, kerana aku akan berbangga dengan bilangan kamu yang ramai di hadapan umat-umat lain.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، ‏‏‏‏‏‏أَخْبَرَنَا مُسْتَلِمُ بْنُ سَعِيدٍ ابْنَ أُخْتِ مَنْصُورِ بْنِ زَاذَانَ، ‏‏‏‏‏‏عَنْمَنْصُورٍ يَعْنِي ابْنَ زَاذَانَ، ‏‏‏‏‏‏عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ، ‏‏‏‏‏‏عَنْ مَعْقِلِ بْنِ يَسَارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنِّي أَصَبْتُ امْرَأَةً ذَاتَ حَسَبٍ وَجَمَالٍ وَإِنَّهَا لَا تَلِدُ، ‏‏‏‏‏‏أَفَأَتَزَوَّجُهَا ؟ قَالَ:‏‏‏‏ لَا ، ‏‏‏‏‏‏ثُمَّ أَتَاهُ الثَّانِيَةَ، ‏‏‏‏‏‏فَنَهَاهُ، ‏‏‏‏‏‏ثُمَّ أَتَاهُ الثَّالِثَةَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ تَزَوَّجُوا الْوَدُودَ الْوَلُودَ، ‏‏‏‏‏‏فَإِنِّي مُكَاثِرٌ بِكُمُ الْأُمَمَ ."
      },
      {
        "id": 21131,
        "hadith_number": "2051",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Mengahwini Penzina",
        "perawi_melayu": "Abdullah ibn Amr ibn al-As meriwayatkan:",
        "english_text": "Narrated Abdullah ibn Amr ibn al-As: Marthad ibn Abu Marthad al-Ghanawi used to take prisoners (of war) from Makkah (to Madina). At Makkah there was a prostitute called Inaq who had illicit relations with him. (Marthad said: ) I came to the Prophet صلی ‌اللہ ‌علیہ ‌وسلم and said to him: May I marry Inaq, Messenger of Allah? The narrator said: He kept silence towards me. Then the verse was revealed: . . . . and the adulteress none shall marry save and adulterer or an idolater. He called me and recited this (verse) to me, and said: Do not marry her.",
        "malay_translation": "Diriwayatkan oleh Abdullah ibn Amr ibn al-As: Marthad ibn Abu Marthad al-Ghanawi biasa membawa tawanan perang dari Makkah (ke Madinah). Di Makkah, terdapat seorang pelacur bernama Inaq yang mempunyai hubungan haram dengannya. (Marthad berkata:) Saya datang kepada Nabi صلی ‌اللہ ‌علیہ ‌وسلم dan berkata kepadanya: Bolehkah saya mengahwini Inaq, wahai Rasulullah? Perawi berkata: Baginda berdiam diri terhadap saya. Kemudian ayat ini diturunkan: ... dan perempuan zina tidak boleh dikahwini kecuali oleh penzina atau orang musyrik. Baginda memanggil saya dan membacakan ayat ini kepada saya, dan bersabda: Jangan kahwini dia.",
        "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُحَمَّدٍ التَّيْمِيُّ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ بْنِ الْأَخْنَسِ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْجَدِّهِ، ‏‏‏‏‏‏أَنَّ مَرْثَدَ بْنَ أَبِي مَرْثَدٍ الْغَنَوِيَّ كَانَ يَحْمِلُ الْأَسَارَى بِمَكَّةَ، ‏‏‏‏‏‏وَكَانَ بِمَكَّةَ بَغِيٌّ يُقَالُ لَهَا:‏‏‏‏ عَنَاقُ، ‏‏‏‏‏‏وَكَانَتْ صَدِيقَتَهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ جِئْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏أَنْكِحُ عَنَاقَ ؟ قَالَ:‏‏‏‏ فَسَكَتَ عَنِّي، ‏‏‏‏‏‏فَنَزَلَتْ:‏‏‏‏ وَالزَّانِيَةُ لا يَنْكِحُهَا إِلا زَانٍ أَوْ مُشْرِكٌ سورة النور آية 3، ‏‏‏‏‏‏فَدَعَانِي، ‏‏‏‏‏‏فَقَرَأَهَا عَلَيَّ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ لَا تَنْكِحْهَا ."
      },
      {
        "id": 21132,
        "hadith_number": "2052",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Kahwin dengan Penzina yang Sudah Disebat Melainkan dengan yang Serupa",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Narrated Abu Hurairah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: The adulterer who has been flogged shall not marry save the one like him. Abu Mamar said: Habib al-Mu'allim narrated (this tradition) to us on the authority of Amr ibn Shuayb.",
        "malay_translation": "Diriwayatkan oleh Abu Hurairah: Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Penzina yang telah disebat tidak boleh berkahwin kecuali dengan orang yang serupa dengannya. Abu Mamar berkata: Habib al-Mu'allim meriwayatkan (hadis ini) kepada kami daripada Amr ibn Shuayb.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏وَأَبُو مَعْمَرٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا عَبْدُ الْوَارِثِ، ‏‏‏‏‏‏عَنْ حَبِيبٍ، ‏‏‏‏‏‏حَدَّثَنِي عَمْرُو بْنُ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ سَعِيدٍ الْمَقْبُرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا يَنْكِحُ الزَّانِي الْمَجْلُودُ إِلَّا مِثْلَهُ . وقَالَ أَبُو مَعْمَرٍ:‏‏‏‏ حَدَّثَنِي حَبِيبٌ الْمُعَلِّمُ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ."
      },
      {
        "id": 21133,
        "hadith_number": "2053",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Ganjaran Berganda bagi Memerdekakan Hamba Perempuan dan Mengahwininya",
        "perawi_melayu": "Diriwayatkan daripada Abu Dawud bahawa Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: “Sesiapa yang memerdekakan hamba perempuannya dan kemudian mengahwininya, dia akan mendapat ganjaran berganda.”",
        "english_text": "Abu Dawud reported the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم as saying “Anyone who sets his slave girl free and then marries her, will have a double reward. ”",
        "malay_translation": "Abu Dawud meriwayatkan bahawa Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: “Sesiapa yang memerdekakan hamba perempuannya dan kemudian mengahwininya, dia akan mendapat ganjaran berganda.”",
        "arabic_text": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْثَرٌ، ‏‏‏‏‏‏عَنْ مُطَرِّفٍ، ‏‏‏‏‏‏عَنْ عَامِرٍ، ‏‏‏‏‏‏عَنْ أَبِي بُرْدَةَ، ‏‏‏‏‏‏عَنْ أَبِي مُوسَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ أَعْتَقَ جَارِيَتَهُ وَتَزَوَّجَهَا كَانَ لَهُ أَجْرَانِ ."
      },
      {
        "id": 21134,
        "hadith_number": "2054",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Pemusnahan Safiyyah dan Mahar Beliau",
        "perawi_melayu": "Anas bin Malik meriwayatkan",
        "english_text": "Anas bin Malik said “The Prophet صلی ‌اللہ ‌علیہ ‌وسلم manumitted Safiyyah and made her manumission her dower. ”",
        "malay_translation": "Anas bin Malik berkata, “Nabi صلی ‌اللہ ‌علیہ ‌وسلم membebaskan Safiyyah dan menjadikan pembebasannya sebagai maharnya.”",
        "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، ‏‏‏‏‏‏أَخْبَرَنَا أَبُو عَوَانَةَ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏وَعَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْتَقَ صَفِيَّةَ وَجَعَلَ عِتْقَهَا صَدَاقَهَا ."
      },
      {
        "id": 21135,
        "hadith_number": "2055",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukum Haram Disebabkan Susuan Sama Seperti Haram Disebabkan Keturunan",
        "perawi_melayu": "Aisyah, Ummul Muminin",
        "english_text": "Narrated Aishah, Ummul Muminin: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: What is unlawful by reason of consanguinity is unlawful by reason of fosterage.",
        "malay_translation": "Diriwayatkan dari Aisyah, Ummul Muminin: Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Apa yang haram disebabkan keturunan, haram juga disebabkan susuan.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، ‏‏‏‏‏‏عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَزَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ يَحْرُمُ مِنَ الرَّضَاعَةِ مَا يَحْرُمُ مِنَ الْوِلَادَةِ ."
      },
      {
        "id": 21136,
        "hadith_number": "2056",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Mengahwini Saudara Perempuan Isteri dan Anak Tiri",
        "perawi_melayu": "Umm Salamah meriwayatkan bahawa Umm Habibah berkata, \"Adakah anda berminat dengan saudara perempuan saya, Rasulullah ﷺ?\" Baginda bersabda, \"Apa yang patut saya lakukan?\" Dia berkata, \"Anda mengahwininya.\" Baginda bersabda, \"Saudara perempuanmu?\" Dia berkata, \"Ya.\" Baginda bersabda, \"Adakah kamu menyukai itu?\" Dia berkata, \"Saya tidak bersendirian denganmu dari mereka yang berkongsi kebaikan ini dengan saya, saudara perempuan saya adalah yang paling saya sukai. Baginda bersabda, \"Sesungguhnya dia tidak halal bagi saya.\" Dia berkata, \"Demi Allah, saya diberitahu bahawa anda akan bertunang dengan Darrah atau Durrah, perawi Zuhair ragu-ragu, anak perempuan Abu Salamah.\" Baginda bersabda, \"Anak perempuan Umm Salamah?\" Dia berkata, \"Ya.\" Baginda bersabda, \"Demi Allah, walaupun dia bukan anak tiri saya di bawah jagaan saya, dia tidak akan halal bagi saya. Sesungguhnya dia adalah anak saudara perempuan saya melalui susuan. Thuwaibah menyusukan saya dan ayahnya (Abu Salamah). Oleh itu, janganlah kamu menawarkan kepada saya anak-anak perempuan kamu dan saudara-saudara perempuan kamu.\"",
        "english_text": "Umm Salamah reported Umm Habibah said “Are you interested in my sister, Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم?” He said “What should I do?” She said “You marry her” He said “Your sister?” She said “Yes”. He said “Do you like that?” she said “I am not alone with you of those who share me in this good, my sister is most to my liking. He said “She is not lawful for me. ” She said “By Allaah, I was told that you were going to betroth with you Darrah to Durrah, the narrator Zuhair doubted the daughter of Abu Salamah. He said “The daughter of Umm Salamah? She said “Yes”. He said “ (She is my step daughter). Even if she had not been my step daughter under my protection, she would not have been lawful for me. She is my foster niece (daughter of my brother by fosterage). Thuwaibah suckled me as well as his father (Abu Salamah). So do not present to me your daughters and your sisters.",
        "malay_translation": "Umm Salamah meriwayatkan bahawa Umm Habibah berkata, \"Adakah anda berminat dengan saudara perempuan saya, Rasulullah ﷺ?\" Baginda bersabda, \"Apa yang patut saya lakukan?\" Dia berkata, \"Anda mengahwininya.\" Baginda bersabda, \"Saudara perempuanmu?\" Dia berkata, \"Ya.\" Baginda bersabda, \"Adakah kamu menyukai itu?\" Dia berkata, \"Saya tidak bersendirian denganmu dari mereka yang berkongsi kebaikan ini dengan saya, saudara perempuan saya adalah yang paling saya sukai. Baginda bersabda, \"Sesungguhnya dia tidak halal bagi saya.\" Dia berkata, \"Demi Allah, saya diberitahu bahawa anda akan bertunang dengan Darrah atau Durrah, perawi Zuhair ragu-ragu, anak perempuan Abu Salamah.\" Baginda bersabda, \"Anak perempuan Umm Salamah?\" Dia berkata, \"Ya.\" Baginda bersabda, \"Demi Allah, walaupun dia bukan anak tiri saya di bawah jagaan saya, dia tidak akan halal bagi saya. Sesungguhnya dia adalah anak saudara perempuan saya melalui susuan. Thuwaibah menyusukan saya dan ayahnya (Abu Salamah). Oleh itu, janganlah kamu menawarkan kepada saya anak-anak perempuan kamu dan saudara-saudara perempuan kamu.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، ‏‏‏‏‏‏حَدَّثَنَا زُهَيْرٌ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ، ‏‏‏‏‏‏عَنْ أُمِّ سَلَمَةَ، ‏‏‏‏‏‏أَنَّ أُمَّ حَبِيبَةَ، قَالَتْ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏هَلْ لَكَ فِي أُخْتِي ؟ قَالَ:‏‏‏‏ فَأَفْعَلُ مَاذَا ؟ قَالَتْ:‏‏‏‏ فَتَنْكِحُهَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أُخْتَكِ ؟ قَالَتْ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَوَتُحِبِّينَ ذَلِكَ ؟ قَالَتْ:‏‏‏‏ لَسْتُ بِمُخْلِيَةٍ بِكَ، ‏‏‏‏‏‏وَأَحَبُّ مَنْ شَرِكَنِي فِي خَيْرٍ أُخْتِي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَإِنَّهَا لَا تَحِلُّ لِي ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ فَوَاللَّهِ لَقَدْ أُخْبِرْتُ أَنَّكَ تَخْطُبُ دُرَّةَ أَوْ ذُرَّةَ شَكَّ زُهَيْرٌ بِنْتَ أَبِي سَلَمَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ بِنْتَ أُمِّ سَلَمَةَ ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَمَا وَاللَّهِ لَوْ لَمْ تَكُنْ رَبِيبَتِي فِي حِجْرِي مَا حَلَّتْ لِي، ‏‏‏‏‏‏إِنَّهَا ابْنَةُ أَخِي مِنَ الرَّضَاعَةِ، ‏‏‏‏‏‏أَرْضَعَتْنِي وَأَبَاهَا ثُوَيْبَةُ، ‏‏‏‏‏‏فَلَا تَعْرِضْنَ عَلَيَّ بَنَاتِكُنَّ وَلَا أَخَوَاتِكُنَّ ."
      },
      {
        "id": 21137,
        "hadith_number": "2057",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Aflah ibn Abul Qu'ays Masuk Menemui Aisyah RA dan Hukum Susuan",
        "perawi_melayu": "Diriwayatkan daripada Aishah, Ummul Muminin:",
        "english_text": "Narrated Aishah, Ummul Muminin: Aflah ibn AbulQu'ays entered upon me. I hid myself from him. He said: You are hiding yourself from me while I am your paternal uncle. She said: I said: From where? He said: The wife of my brother suckled you. She said: The woman suckled me and not the man. Thereafter the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم entered upon me and I told him this matter. He said: He is your paternal uncle; he may enter upon you.",
        "malay_translation": "Diriwayatkan daripada Aishah, Ummul Muminin: Aflah ibn Abul Qu'ays masuk menemuiku. Aku menyembunyikan diri daripadanya. Dia berkata: “Engkau menyembunyikan diri daripadaku padahal aku adalah bapa saudaramu sebelah bapa.” Aisyah berkata: Aku bertanya: “Dari mana?” Dia berkata: “Isteri saudaraku telah menyusukanmu.” Aisyah berkata: “Wanita itu sahaja yang menyusukanku dan bukan lelaki itu.” Kemudian Rasulullah ﷺ masuk menemuiku dan aku menceritakan perkara ini kepadanya. Baginda bersabda: “Dia adalah bapa saudaramu sebelah bapa; dia boleh masuk menemuimu.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ الْعَبْدِيُّ، ‏‏‏‏‏‏أَخْبَرَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ دَخَلَ عَلَيَّ أَفْلَحُ بْنُ أَبِي الْقُعَيْسِ فَاسْتَتَرْتُ مِنْهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ تَسْتَتِرِينَ مِنِّي وَأَنَا عَمُّكِ ؟ قَالَتْ:‏‏‏‏ قُلْتُ:‏‏‏‏ مِنْ أَيْنَ ؟ قَالَ:‏‏‏‏ أَرْضَعَتْكِ امْرَأَةُ أَخِي قَالَتْ:‏‏‏‏ إِنَّمَا أَرْضَعَتْنِي الْمَرْأَةُ وَلَمْ يُرْضِعْنِي الرَّجُلُ، ‏‏‏‏‏‏فَدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَحَدَّثْتُهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنَّهُ عَمُّكِ فَلْيَلِجْ عَلَيْكِ ."
      },
      {
        "id": 21138,
        "hadith_number": "2058",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Pertimbangan dalam Persaudaraan Susuan",
        "perawi_melayu": "Aisyah meriwayatkan bahawa Rasulullah SAW mengunjunginya ketika seorang lelaki bersamanya. Hafs berkata, \"Perkara ini membuatkan baginda berdukacita dan wajahnya berubah.\" Kemudian, dalam riwayat yang disepakati, Aisyah berkata, \"Wahai Rasulullah SAW, dia adalah saudara susuan saya.\" Baginda bersabda, \"Perhatikanlah siapa saudara-saudara kamu, kerana persusuan itu (berlaku) kerana kelaparan.\"",
        "english_text": "Aishah said the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم visited her when a man was with her. The narrator Hafs said “this grieved him and he frowned”. The agreed version then goes, She said “He is my foster brother Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم”. He said “Consider, who are you brethren, for fosterage is consequent on hunger. ”",
        "malay_translation": "Aisyah RA berkata bahawa Rasulullah SAW telah menziarahinya ketika seorang lelaki berada bersamanya. Perawi, Hafs berkata, \"Hal ini menyedihkan baginda dan baginda berkerut kening.\" Kemudian dalam riwayat yang dipersetujui, Aisyah berkata, \"Wahai Rasulullah SAW, sesungguhnya dia adalah saudara susuan saya.\" Baginda bersabda, \"Perhatikanlah siapa saudara-saudara kamu, kerana persusuan itu berlaku disebabkan kelaparan (yakni, memberi kesan hanya jika berlaku pada usia bayi yang memerlukan susu sebagai makanan).\"",
        "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، ‏‏‏‏‏‏حَدَّثَنَا شُعْبَةُ. ح وحَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، ‏‏‏‏‏‏أَخْبَرَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ أَشْعَثَ بْنِ سُلَيْمٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ مَسْرُوقٍ، ‏‏‏‏‏‏عَنْ عَائِشَةَ الْمَعْنَى وَاحِدٌ، ‏‏‏‏‏‏أن رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا وَعِنْدَهَا رَجُلٌ، ‏‏‏‏‏‏قَالَ حَفْصٌ:‏‏‏‏ فَشَقَّ ذَلِكَ عَلَيْهِ وَتَغَيَّرَ وَجْهُهُ ثُمَّ اتَّفَقَا، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِنَّهُ أَخِي مِنَ الرَّضَاعَةِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ انْظُرْنَ مَنْ إِخْوَانُكُنَّ، ‏‏‏‏‏‏فَإِنَّمَا الرَّضَاعَةُ مِنَ الْمَجَاعَةِ ."
      },
      {
        "id": 21139,
        "hadith_number": "2059",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hanya Penyusuan Yang Menguatkan Tulang dan Menumbuhkan Daging Dianggap Sah",
        "perawi_melayu": "Abd Allaah bin Masud",
        "english_text": "Abd Allaah bin Masud said “Fosterage is not valid except by what strengthens love and grows flesh. ” Abu Musa said “Do not ask us so long as this learned man is among us”",
        "malay_translation": "Abd Allaah bin Masud berkata, “Penyusuan tidak sah kecuali dengan apa yang menguatkan kasih sayang dan menumbuhkan daging.” Abu Musa berkata, “Jangan bertanya kepada kami selagi orang yang berilmu ini ada di antara kita.”",
        "arabic_text": "حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ مُطَهَّرٍ، ‏‏‏‏‏‏أَنَّ سُلَيْمَانَ بْنَ الْمُغِيرَةِ حَدَّثَهُمْ، ‏‏‏‏‏‏عَنْ أَبِي مُوسَى، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ ابْنٍ لِعَبْدِ اللَّهِ بْنِ مَسْعُودٍ، ‏‏‏‏‏‏عَنْ ابْنِ مَسْعُودٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا رِضَاعَ إِلَّا مَا شَدَّ الْعَظْمَ وَأَنْبَتَ اللَّحْمَ . فَقَالَ أَبُو مُوسَى:‏‏‏‏ لَا تَسْأَلُونَا وَهَذَا الْحَبْرُ فِيكُمْ."
      },
      {
        "id": 21140,
        "hadith_number": "2060",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Keterangan Tambahan tentang Hadis yang Diriwayatkan oleh Ibn Mas'ud",
        "perawi_melayu": "Diriwayatkan oleh Ibn Mas'ud",
        "english_text": "The aforesaid tradition has also been narrated by Ibn Masud through a different chain of narrators and to the same effect from the Prophet صلی ‌اللہ ‌علیہ ‌وسلم. This version has the words anshaz al-‘azma meaning which nourishes bones and makes them sturdy and vigorous.",
        "malay_translation": "Hadis yang disebutkan tadi juga diriwayatkan oleh Ibn Mas'ud melalui rangkaian perawi yang berbeza dan dengan maksud yang sama dari Nabi صلی ‌اللہ ‌علیہ ‌وسلم. Versi ini mempunyai perkataan 'anshaz al-‘azma' yang bermaksud yang menyuburkan tulang dan menjadikannya kuat dan bertenaga.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنْ سُلَيْمَانَ بْنِ الْمُغِيرَةِ، ‏‏‏‏‏‏عَنْ أَبِي مُوسَى الْهِلَالِيِّ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْابْنِ مَسْعُودٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏بِمَعْنَاهُ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ أَنْشَزَ الْعَظْمَ."
      },
      {
        "id": 21141,
        "hadith_number": "2061",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Pengambilan Anak Angkat dan Penyusuan untuk Hubungan Mahram",
        "perawi_melayu": "Aisyah, isteri Nabi ﷺ, dan Umm Salamah meriwayatkan",
        "english_text": "Aishah wife of the Prophet صلی ‌اللہ ‌علیہ ‌وسلم and Umm Salamah said “Abu Hudaifah bin ‘Utbah bin Rabiah bin Abd Shams adopted Salim as his son and married him to his niece Hind, daughter of Al Walid bin ‘Utbah bin Rabiah. He (Salim) was the freed slave of a woman from the Ansar (the Helpers) as the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم adopted Zaid as his son. In pre Islamic days when anyone adopted a man as his son, the people called him by his name and he was given a share from his inheritance. Allaah, the Exalted, revealed about this matter “Call them by (the name of) their fathers, that is juster in the sight of Allaah. And if ye know not their fathers, then (they are) your brethren in the faith and your clients. They were then called by their names of their fathers. A man, whose father was not known, remained under the protection of someone and considered brother in faith. Sahlah daughter of Suhail bin Amr Al Quraishi then came and said Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم, we used to consider Salim (our) son. He dwelled with me and Abu Hudhaifah in the same house, and he saw me in the short clothes, but Allaah the Exalted, has revealed about them what you know, then what is your opinion about him? The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said give him your breast feed. She gave him five breast feeds. He then became like her foster son. Hence, Aishah (may Allaah be pleased with her) used to ask the daughters of her sisters and the daughters of her brethren to give him breast feed five times, whom Aishah wanted to see and who wanted to visit her. Though he might be of age; he then visited her. But Umm Salamah and all other wives of the Prophet صلی ‌اللہ ‌علیہ ‌وسلم refused to allow anyone to visit them on the basis of such breast feeding unless one was given breast feed during infancy. They told Aishah by Allaah we do not know whether that was a special concession granted by the Prophet صلی ‌اللہ ‌علیہ ‌وسلم to Salim exclusive of the people.",
        "malay_translation": "Aisyah, isteri Nabi ﷺ, dan Umm Salamah berkata, “Abu Hudaifah bin ‘Utbah bin Rabiah bin Abd Shams mengambil Salim sebagai anak angkatnya dan menikahkannya dengan anak saudaranya, Hind, anak perempuan Al Walid bin ‘Utbah bin Rabiah. Dia (Salim) adalah bekas hamba seorang wanita dari Ansar (penolong) sebagaimana Rasulullah ﷺ mengambil Zaid sebagai anaknya. Pada zaman pra-Islam, apabila seseorang mengambil seorang lelaki sebagai anak, orang memanggilnya dengan namanya dan dia diberi bahagian daripada warisannya. Allah, Yang Maha Tinggi, menurunkan tentang perkara ini: “Panggillah mereka (anak-anak angkat itu) dengan (nama) bapa-bapa mereka; itulah yang lebih adil di sisi Allah. Dan jika kamu tidak mengetahui bapa-bapa mereka, maka (mereka adalah) saudara-saudaramu seagama dan hamba-hamba sahayamu.” Mereka kemudian dipanggil dengan nama bapa mereka. Seorang lelaki yang bapanya tidak diketahui, tetap berada di bawah perlindungan seseorang dan dianggap saudara seiman. Sahlah binti Suhail bin Amr Al Quraishi kemudian datang dan berkata, “Wahai Rasulullah ﷺ, kami biasa menganggap Salim (anak) kami. Dia tinggal bersama saya dan Abu Hudhaifah di rumah yang sama, dan dia melihat saya dengan pakaian pendek, tetapi Allah Yang Maha Tinggi telah menurunkan tentang mereka apa yang kamu ketahui, lalu bagaimana pendapatmu tentang dia?” Nabi ﷺ bersabda, “Susuilah dia.” Dia memberinya lima kali penyusuan. Dia kemudian menjadi seperti anak susunya. Oleh itu, Aisyah (semoga Allah meredhainya) biasa meminta anak-anak perempuan dari saudara perempuannya dan anak-anak perempuan dari saudara lelakinya untuk menyusukannya sebanyak lima kali, yang Aisyah ingin melihat dan yang ingin mengunjunginya. Walaupun dia sudah dewasa; dia kemudian mengunjunginya. Tetapi Umm Salamah dan semua isteri Nabi ﷺ yang lain enggan membenarkan sesiapa pun untuk mengunjungi mereka berdasarkan penyusuan sedemikian kecuali seseorang diberi susu semasa bayi. Mereka memberitahu Aisyah, “Demi Allah, kami tidak tahu adakah itu adalah pengecualian khusus yang diberikan oleh Nabi ﷺ kepada Salim sahaja selain daripada orang lain.”",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، ‏‏‏‏‏‏حَدَّثَنَا عَنْبَسَةُ، ‏‏‏‏‏‏حَدَّثَنِي يُونُسُ، ‏‏‏‏‏‏عَنْ ابْنِ شِهَابٍ، ‏‏‏‏‏‏حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأُمِّ سَلَمَةَ، ‏‏‏‏‏‏أَنَّ أَبَا حُذَيْفَةَ بْنَ عُتْبَةَ بْنِ رَبِيعَةَ بْنِ عَبْدِ شَمْسٍ كَانَ تَبَنَّى سَالِمًا وَأَنْكَحَهُ ابْنَةَ أَخِيهِ هِنْدَ بِنْتَ الْوَلِيدِ بْنِ عُتْبَةَ بْنِ رَبِيعَةَ، ‏‏‏‏‏‏وَهُوَ مَوْلًى لِامْرَأَةٍ مِنْ الْأَنْصَارِ، ‏‏‏‏‏‏كَمَا تَبَنَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَيْدًا، ‏‏‏‏‏‏وَكَانَ مَنْ تَبَنَّى رَجُلًا فِي الْجَاهِلِيَّةِ دَعَاهُ النَّاسُ إِلَيْهِ وَوُرِّثَ مِيرَاثَهُ، ‏‏‏‏‏‏حَتَّى أَنْزَلَ اللَّهُ سُبْحَانَهُ وَتَعَالَى فِي ذَلِكَ:‏‏‏‏ ادْعُوهُمْ لآبَائِهِمْ إِلَى قَوْلِهِ:‏‏‏‏ فَإِخْوَانُكُمْ فِي الدِّينِ وَمَوَالِيكُمْ سورة الأحزاب آية 5، ‏‏‏‏‏‏فَرُدُّوا إِلَى آبَائِهِمْ، ‏‏‏‏‏‏فَمَنْ لَمْ يُعْلَمْ لَهُ أَبٌ كَانَ مَوْلًى وَأَخًا فِي الدِّينِ، ‏‏‏‏‏‏فَجَاءَتْ سَهْلَةُ بِنْتُ سُهَيْلِ بْنِ عَمْرٍو الْقُرَشِيِّ، ‏‏‏‏‏‏ثُمَّ الْعَامِرِيِّ، ‏‏‏‏‏‏وَهِيَ امْرَأَةُ أَبِي حُذَيْفَةَ، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِنَّا كُنَّا نَرَى سَالِمًا وَلَدًا، ‏‏‏‏‏‏وَكَانَ يَأْوِي مَعِي وَمَعَ أَبِي حُذَيْفَةَ فِي بَيْتٍ وَاحِدٍ، ‏‏‏‏‏‏وَيَرَانِي فُضْلًا، ‏‏‏‏‏‏وَقَدْ أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ فِيهِمْ مَا قَدْ عَلِمْتَ، ‏‏‏‏‏‏فَكَيْفَ تَرَى فِيهِ ؟ فَقَالَ لَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَرْضِعِيهِ ، ‏‏‏‏‏‏فَأَرْضَعَتْهُ خَمْسَ رَضَعَاتٍ، ‏‏‏‏‏‏فَكَانَ بِمَنْزِلَةِ وَلَدِهَا مِنَ الرَّضَاعَةِ، ‏‏‏‏‏‏فَبِذَلِكَ كَانَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا تَأْمُرُ بَنَاتِ أَخَوَاتِهَا وَبَنَاتِ إِخْوَتِهَا أَنْ يُرْضِعْنَ مَنْ أَحَبَّتْ عَائِشَةُ أَنْ يَرَاهَا وَيَدْخُلَ عَلَيْهَا وَإِنْ كَانَ كَبِيرًا خَمْسَ رَضَعَاتٍ، ‏‏‏‏‏‏ثُمَّ يَدْخُلُ عَلَيْهَا، ‏‏‏‏‏‏وَأَبَتْ أُمُّ سَلَمَةَ وَسَائِرُ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُدْخِلْنَ عَلَيْهِنَّ بِتِلْكَ الرَّضَاعَةِ أَحَدًا مِنَ النَّاسِ حَتَّى يَرْضَعَ فِي الْمَهْدِ، ‏‏‏‏‏‏وَقُلْنَ لِعَائِشَةَ:‏‏‏‏ وَاللَّهِ مَا نَدْرِي ؟ لَعَلَّهَا كَانَتْ رُخْصَةً مِنَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِسَالِمٍ دُونَ النَّاسِ."
      },
      {
        "id": 21142,
        "hadith_number": "2062",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukum Penyusuan: Sepuluh Susuan Dibatalkan dengan Lima Susuan yang Diketahui",
        "perawi_melayu": "Aisyah RA",
        "english_text": "Aishah said “In what was sent down in the Quran ten suckling’s made marriage unlawful, but they were abrogated by five known ones and when the Prophet صلی ‌اللہ ‌علیہ ‌وسلم dies, these words were among what was recited in the Quran. ”",
        "malay_translation": "Aisyah RA berkata, “Dalam apa yang diturunkan di dalam Al-Quran, sepuluh susuan menjadikan perkahwinan tidak sah, tetapi ia telah dimansuhkan (abrogated) dengan lima susuan yang diketahui. Dan ketika Nabi صلی ‌اللہ ‌علیہ ‌وسلم wafat, kata-kata ini adalah antara apa yang dibaca di dalam Al-Quran.”",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، ‏‏‏‏‏‏عَنْعَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ،‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏أَنَّهَا قَالَتْ:‏‏‏‏ كَانَ فِيمَا أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ مِنَ الْقُرْآنِ عَشْرُ رَضَعَاتٍ يُحَرِّمْنَ، ‏‏‏‏‏‏ثُمَّ نُسِخْنَ بِخَمْسٍ مَعْلُومَاتٍ يُحَرِّمْنَ، ‏‏‏‏‏‏فَتُوُفِّيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُنَّ مِمَّا يُقْرَأُ مِنَ الْقُرْآنِ ."
      },
      {
        "id": 21143,
        "hadith_number": "2063",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Penyusuan Satu atau Dua Kali Tidak Membatalkan Perkahwinan",
        "perawi_melayu": "Diriwayatkan daripada Aisyah R.A.",
        "english_text": "Aishah reported “The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم as saying One or two sucks does not make marriage unlawful”.",
        "malay_translation": "Aisyah R.A. meriwayatkan bahawa Rasulullah SAW bersabda, “Satu atau dua kali susuan tidak menyebabkan perkahwinan menjadi haram.”",
        "arabic_text": "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ، ‏‏‏‏‏‏حَدَّثَنَا إِسْمَاعِيلُ، ‏‏‏‏‏‏عَنْ أَيُّوبَ، ‏‏‏‏‏‏عَنْ ابْنِ أَبِي مُلَيْكَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ عَائِشَةَرَضِيَ اللَّهُ عَنْهَا، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تُحَرِّمُ الْمَصَّةُ وَلَا الْمَصَّتَانِ ."
      },
      {
        "id": 21144,
        "hadith_number": "2064",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Kafarah Bagi Tanggungjawab Susuan",
        "perawi_melayu": "Diriwayatkan daripada Hajjaj ibn Malik al-Aslami: Aku bertanya: Wahai Rasulullah, apakah yang akan menghapuskan dariku kewajipan (tanggungjawab) kerana memberi susu kepada seorang anak? Baginda bersabda: Seorang hamba lelaki atau seorang hamba perempuan.",
        "english_text": "Narrated Hajjaj ibn Malik al-Aslami: I asked: Messenger of Allah, what will remove from me the obligation due for fostering a child? He said: A slave or a slave-woman.",
        "malay_translation": "Diriwayatkan daripada Hajjaj ibn Malik al-Aslami: Aku bertanya: Wahai Rasulullah, apakah yang akan menghapuskan dariku kewajipan (tanggungjawab) kerana memberi susu kepada seorang anak? Baginda bersabda: Seorang hamba lelaki atau seorang hamba perempuan.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو مُعَاوِيَةَ. ح وحَدَّثَنَا ابْنُ الْعَلَاءِ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ إِدْرِيسَ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ حَجَّاجِ بْنِ حَجَّاجٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏مَا يُذْهِبُ عَنِّي مَذَمَّةَ الرَّضَاعَةِ ؟ قَالَ:‏‏‏‏ الْغُرَّةُ الْعَبْدُ أَوِ الْأَمَةُ . قَالَ النُّفَيْلِيُّ:‏‏‏‏ حَجَّاجُ بْنُ حَجَّاجٍ الْأَسْلَمِيُّ، ‏‏‏‏‏‏وَهَذَا لَفْظُهُ."
      },
      {
        "id": 21145,
        "hadith_number": "2065",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Mengahwini Wanita dengan Saudara Perempuan Bapa atau Ibu Saudaranya",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA, bahawa Rasulullah SAW bersabda:",
        "english_text": "Abu Hurairah reported The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم as saying “ A woman should not be married to one who had married her paternal aunt or a paternal aunt to one who had married her brother’s daughter or a woman to one who had married her maternal aunt or maternal aunt to one who had married her sister’s daughter. A woman who is elder (in relation) must not be married to one who had married a woman who is younger (in relation) to her nor a woman who is younger (in relation) must be married to one who has married a woman who is elder (in relation) to her. ”",
        "malay_translation": "Seorang wanita tidak boleh dikahwini dengan lelaki yang telah mengahwini saudara perempuan bapanya, atau saudara perempuan bapa tidak boleh dikahwini dengan lelaki yang telah mengahwini anak perempuan saudaranya (lelaki), atau seorang wanita tidak boleh dikahwini dengan lelaki yang telah mengahwini saudara perempuan ibunya, atau saudara perempuan ibu tidak boleh dikahwini dengan lelaki yang telah mengahwini anak perempuan saudaranya (perempuan). Seorang wanita yang lebih tua (dari segi umur) tidak boleh dikahwini dengan lelaki yang telah mengahwini wanita yang lebih muda (dari segi umur) daripadanya, dan seorang wanita yang lebih muda (dari segi umur) tidak boleh dikahwini dengan lelaki yang telah mengahwini wanita yang lebih tua (dari segi umur) daripadanya.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، ‏‏‏‏‏‏حَدَّثَنَا زُهَيْرٌ، ‏‏‏‏‏‏حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ، ‏‏‏‏‏‏عَنْ عَامِرٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تُنْكَحُ الْمَرْأَةُ عَلَى عَمَّتِهَا، ‏‏‏‏‏‏وَلَا الْعَمَّةُ عَلَى بِنْتِ أَخِيهَا، ‏‏‏‏‏‏وَلَا الْمَرْأَةُ عَلَى خَالَتِهَا، ‏‏‏‏‏‏وَلَا الْخَالَةُ عَلَى بِنْتِ أُخْتِهَا، ‏‏‏‏‏‏وَلَا تُنْكَحُ الْكُبْرَى عَلَى الصُّغْرَى، ‏‏‏‏‏‏وَلَا الصُّغْرَى عَلَى الْكُبْرَى ."
      },
      {
        "id": 21146,
        "hadith_number": "2066",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Mengahwini Wanita Bersama Ibu Saudara Sebelah Ibu atau Bapa",
        "perawi_melayu": "Abu Hurairah RA",
        "english_text": "Abu Hurairah said “The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم forbade that a woman and her maternal aunt and a woman and her paternal aunt are joined in marriage. ”",
        "malay_translation": "Abu Hurairah RA berkata, “Rasulullah SAW melarang seorang wanita dikahwini bersama ibu saudaranya (sebelah ibu) dan seorang wanita dikahwini bersama ibu saudaranya (sebelah bapa).”",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، ‏‏‏‏‏‏حَدَّثَنَا عَنْبَسَةُ، ‏‏‏‏‏‏أَخْبَرَنِي يُونُسُ، ‏‏‏‏‏‏عَنْ ابْنِ شِهَابٍ، ‏‏‏‏‏‏أَخْبَرَنِي قَبِيصَةُ بْنُ ذُؤَيْبٍ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُجْمَعَ بَيْنَ الْمَرْأَةِ وَخَالَتِهَا، ‏‏‏‏‏‏وَبَيْنَ الْمَرْأَةِ وَعَمَّتِهَا ."
      },
      {
        "id": 21147,
        "hadith_number": "2067",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Mengahwini Wanita yang Mempunyai Hubungan Kekeluargaan Rapat",
        "perawi_melayu": "Abdullah ibn Abbas",
        "english_text": "Narrated Abdullah ibn Abbas: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم abominated the combination of paternal and maternal aunts and the combination of two maternal aunts and two paternal aunts in marriage.",
        "malay_translation": "Diriwayatkan daripada Abdullah ibn Abbas: Nabi صلی ‌اللہ ‌علیہ ‌وسلم membenci penggabungan antara ibu saudara sebelah bapa dan ibu saudara sebelah ibu, serta penggabungan antara dua ibu saudara sebelah ibu dan dua ibu saudara sebelah bapa dalam perkahwinan.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، ‏‏‏‏‏‏حَدَّثَنَا خَطَّابُ بْنُ الْقَاسِمِ، ‏‏‏‏‏‏عَنْ خُصَيْفٍ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏أَنَّهُ كَرِهَ أَنْ يُجْمَعَ بَيْنَ الْعَمَّةِ وَالْخَالَةِ، ‏‏‏‏‏‏وَبَيْنَ الْخَالَتَيْنِ وَالْعَمَّتَيْنِ ."
      },
      {
        "id": 21148,
        "hadith_number": "2068",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Mengahwini Anak Yatim Demi Harta dan Kecantikannya Tanpa Keadilan",
        "perawi_melayu": "Diriwayatkan daripada Ibn Shihab bahawa ‘Urwah bin Al Zubair bertanya kepada Aishah, isteri Nabi ﷺ tentang ayat Al-Quran “Dan jika kamu takut tidak akan dapat berlaku adil terhadap anak-anak yatim (perempuan), maka kahwinilah wanita-wanita (lain) yang kamu senangi…”.",
        "english_text": "Ibn Shihab said “Urwah bin Al Zubair asked Aishah, wife of the Prophet صلی ‌اللہ ‌علیہ ‌وسلم about the Quranic verse “And if ye fear that ye will not deal fairly by the orphans, marry of the women, who seem good to you. ” She said “O my nephew, this means the female orphan who is under the protection of her guardian and she holds a share in his property and her property and beauty attracts him; so her guardian intends to marry her without doing justice to her in respect of her dower and he gives her the same amount of dower as others give her. They (i. e., the guardians) were prohibited to marry them except that they do justice to them and pay them their maximum customary dower and they were asked to marry women other than them (i. e., the orphans) who seem good to them. Urwah reported that Aishah said “The people then consulted the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم about women after revelation of this verse. Thereupon Allaah the Exalted sent down the verse “They consult thee concerning women. Say Allaah giveth you decree concerning them and the scripture which hath been recited unto you (giveth decree) concerning female orphans unto whom you give not that which is ordained for them though you desire to marry them. “ She said “The mention made by Allaah about the Scripture recited to them refers to the former verse in which Allaah has said “And if ye fear that ye will not deal fairly by the orphans, marry of the women, who seem good to you. ” Aishah said “The pronouncement of Allaah, the Exalted in the latter verse “though you desire to marry them” means the disinterest of one of you in marrying a female orphan who was under his protection, but she said little property and beauty. So they were prohibited to marry them for their interest in the property and beauty of the female orphans due to their disinterest in themselves except that they do justice )to them). The narrator Yunus said “Rabiah said explain the Quranic verse “And if ye fear that ye will not deal fairly by the orphans” means “Leave them if you fear (that you will not do justice to them), for I have made four women lawful for you. ”",
        "malay_translation": "Ibn Shihab berkata, “‘Urwah bin Al Zubair bertanya kepada Aishah, isteri Nabi ﷺ tentang ayat Al-Quran, “Dan jika kamu takut tidak akan dapat berlaku adil terhadap anak-anak yatim (perempuan), maka kahwinilah wanita-wanita (lain) yang kamu senangi…”. Aishah menjawab, “Wahai anak saudaraku, ini bermaksud anak yatim perempuan yang berada di bawah jagaan walinya dan dia memiliki bahagian dalam harta walinya dan harta serta kecantikannya menarik perhatian walinya; maka walinya berniat untuk mengahwininya tanpa berlaku adil dalam hal maharnya dan dia memberikan mahar yang sama seperti yang diberikan oleh orang lain kepadanya. Mereka (iaitu, para wali) dilarang untuk mengahwini mereka kecuali mereka berlaku adil kepada mereka dan membayar mahar adat tertinggi mereka dan mereka diminta untuk mengahwini wanita selain daripada mereka (iaitu, anak-anak yatim) yang mereka senangi. ‘Urwah melaporkan bahawa Aishah berkata, “Orang ramai kemudian meminta fatwa kepada Rasulullah ﷺ tentang wanita-wanita setelah penurunan ayat ini. Maka Allah Yang Maha Tinggi menurunkan ayat “Mereka meminta fatwa kepadamu (Muhammad) tentang wanita. Katakanlah, “Allah memberi fatwa kepadamu tentang mereka, dan (juga) apa yang dibacakan kepadamu dalam Al-Kitab (Al-Quran) mengenai anak-anak yatim perempuan yang tidak kamu berikan kepada mereka apa (mahar) yang telah ditetapkan untuk mereka, padahal kamu ingin mengahwini mereka.” Aishah berkata, “Sebutkan yang dibuat oleh Allah tentang Kitab yang dibacakan kepada mereka merujuk kepada ayat sebelumnya di mana Allah telah berfirman, “Dan jika kamu takut tidak akan dapat berlaku adil terhadap anak-anak yatim (perempuan), maka kahwinilah wanita-wanita (lain) yang kamu senangi…”. Aishah berkata, “Firman Allah, Yang Maha Tinggi dalam ayat terakhir, “padahal kamu ingin mengahwini mereka” bermaksud ketidaktertarikan salah seorang daripada kamu untuk mengahwini anak yatim perempuan yang berada di bawah jagaannya, tetapi dia berkata sedikit harta dan kecantikan. Oleh itu, mereka dilarang mengahwini mereka kerana kepentingan mereka dalam harta dan kecantikan anak-anak yatim perempuan kerana ketidaktertarikan mereka terhadap diri mereka sendiri kecuali mereka berlaku adil kepada mereka). Perawi Yunus berkata, “Rabiah berkata menjelaskan ayat Al-Quran “Dan jika kamu takut tidak akan dapat berlaku adil terhadap anak-anak yatim” bermaksud “Tinggalkan mereka jika kamu takut (bahawa kamu tidak akan berlaku adil kepada mereka), kerana Aku telah menghalalkan empat wanita untukmu.”",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ الْمِصْرِيُّ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏أَخْبَرَنِي يُونُسُ، ‏‏‏‏‏‏عَنْ ابْنِ شِهَابٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، ‏‏‏‏‏‏أَنَّهُ سَأَلَ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَوْلِ اللَّهِ تَعَالَى:‏‏‏‏ وَإِنْ خِفْتُمْ أَلَّا تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ سورة النساء آية 3،‏‏‏‏قَالَتْ:‏‏‏‏ يَا ابْنَ أُخْتِي، ‏‏‏‏‏‏هِيَ الْيَتِيمَةُ تَكُونُ فِي حِجْرِ وَلِيِّهَا، ‏‏‏‏‏‏فَتُشَارِكُهُ فِي مَالِهِ فَيُعْجِبُهُ مَالُهَا وَجَمَالُهَا فَيُرِيدُ وَلِيُّهَا أَنْ يَتَزَوَّجَهَا بِغَيْرِ أَنْ يُقْسِطَ فِي صَدَاقِهَا، ‏‏‏‏‏‏فَيُعْطِيَهَا مِثْلَ مَا يُعْطِيهَا غَيْرُهُ، ‏‏‏‏‏‏فَنُهُوا أَنْ يَنْكِحُوهُنَّ إِلَّا أَنْ يُقْسِطُوا لَهُنَّ وَيَبْلُغُوا بِهِنَّ أَعْلَى سُنَّتِهِنَّ مِنَ الصَّدَاقِ، ‏‏‏‏‏‏وَأُمِرُوا أَنْ يَنْكِحُوا مَا طَابَ لَهُمْ مِنَ النِّسَاءِ سِوَاهُنَّ ، ‏‏‏‏‏‏قَالَ عُرْوَةُ:‏‏‏‏ قَالَتْ عَائِشَةُ:‏‏‏‏ ثُمَّ إِنَّ النَّاسَ اسْتَفْتَوْا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ هَذِهِ الْآيَةِ فِيهِنَّ، ‏‏‏‏‏‏فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ:‏‏‏‏ وَيَسْتَفْتُونَكَ فِي النِّسَاءِ قُلِ اللَّهُ يُفْتِيكُمْ فِيهِنَّ وَمَا يُتْلَى عَلَيْكُمْ فِي الْكِتَابِ فِي يَتَامَى النِّسَاءِ اللَّاتِي لا تُؤْتُونَهُنَّ مَا كُتِبَ لَهُنَّ وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ سورة النساء آية 127، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ وَالَّذِي ذَكَرَ اللَّهُ أَنَّهُ يُتْلَى عَلَيْهِمْ فِي الْكِتَابِ الْآيَةُ الْأُولَى الَّتِي قَالَ اللَّهُ سُبْحَانَهُ فِيهَا وَإِنْ خِفْتُمْ أَلَّا تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ سورة النساء آية 3، ‏‏‏‏‏‏قَالَتْ عَائِشَةُ:‏‏‏‏ وَقَوْلُ اللَّهِ عَزَّ وَجَلَّ فِي الْآيَةِ الْآخِرَةِ:‏‏‏‏ وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ سورة النساء آية 127 هِيَ رَغْبَةُ أَحَدِكُمْ عَنْ يَتِيمَتِهِ الَّتِي تَكُونُ فِي حِجْرِهِ حِينَ تَكُونُ قَلِيلَةَ الْمَالِ وَالْجَمَالِ، ‏‏‏‏‏‏فَنُهُوا أَنْ يَنْكِحُوا مَا رَغِبُوا فِي مَالِهَا وَجَمَالِهَا مِنْ يَتَامَى النِّسَاءِ إِلَّا بِالْقِسْطِ مِنْ أَجْلِ رَغْبَتِهِمْ عَنْهُنَّ . قَالَ يُونُسُ:‏‏‏‏ وَقَالَ رَبِيعَةُ فِي قَوْلِ اللَّهِ عَزَّ وَجَلَّ:‏‏‏‏ وَإِنْ خِفْتُمْ أَلَّا تُقْسِطُوا فِي الْيَتَامَى سورة النساء آية 3، ‏‏‏‏‏‏قَالَ:‏‏‏‏ يَقُولُ:‏‏‏‏ اتْرُكُوهُنَّ إِنْ خِفْتُمْ، ‏‏‏‏‏‏فَقَدْ أَحْلَلْتُ لَكُمْ أَرْبَعًا."
      },
      {
        "id": 21149,
        "hadith_number": "2069",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Mengumpulkan Anak Perempuan Rasulullah SAW dan Anak Perempuan Musuh Allah dalam Satu Rumah Tangga",
        "perawi_melayu": "Ali bin al-Hussain",
        "english_text": "Ali bin al-Hussain said that when they returned to Madeenah from Yazid bin Muawiyah the place of massacre of Al Hussain bin Ali (may Allaah be pleased with him) Al Miswar bin Makhramah met them and said “tell me if you have any need for me. I said to him “No”. He then said Will you not give me the sword of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم? I fear the people may not take it from you by force. (He said) By Allaah if you give it to me no one can take it from me so long as I am alive. Ali bin Abi Talib (may Allaah be pleased with him) asked for the hand of Abu Jahl’s daughter in marriage after the marriage with Fathima. I heard the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم say while he was addressing the people about this matter on the pulpit and I was mature in those days. Fathima is from me and I am not afraid that she will be tried in respect of her religion. He then mentioned his other son-in-law who belonged to Banu Abd Shams. He admired him immensely for his relationship with him and extolled him well. He said “He talked to me and talked truly and he made promise with me and fulfilled it. I do not make lawful what Is unlawful and unlawful what is lawful. But, by Allaah the daughter of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم and the daughter of the enemy of Allaah can never be combined together.",
        "malay_translation": "Ali bin al-Hussain berkata bahawa ketika mereka kembali ke Madinah dari Yazid bin Muawiyah, tempat pembunuhan Al Hussain bin Ali (semoga Allah meredhai mereka), Al Miswar bin Makhramah bertemu mereka dan berkata, “Beritahu saya jika anda memerlukan apa-apa daripada saya.” Saya berkata kepadanya, “Tidak.” Kemudian dia berkata, “Tidakkah anda akan memberikan saya pedang Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم? Saya khuatir orang ramai akan merampasnya daripada anda dengan paksa. (Dia berkata) Demi Allah, jika anda memberikannya kepada saya, tidak seorang pun dapat mengambilnya daripada saya selagi saya hidup. Ali bin Abi Talib (semoga Allah meredhainya) meminang putri Abu Jahl setelah perkahwinannya dengan Fathima. Saya mendengar Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda ketika baginda berucap kepada orang ramai tentang perkara ini di atas mimbar dan saya sudah baligh pada masa itu. Fathima adalah dari saya dan saya tidak takut dia akan diuji dalam agamanya. Kemudian baginda menyebut menantunya yang lain yang berasal dari Banu Abd Shams. Baginda sangat mengaguminya atas hubungannya dengannya dan memujinya dengan baik. Baginda bersabda, “Dia bercakap dengan saya dan bercakap benar dan dia membuat janji dengan saya dan menunaikannya. Saya tidak menghalalkan apa yang haram dan tidak mengharamkan apa yang halal. Tetapi, demi Allah, anak perempuan Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم dan anak perempuan musuh Allah tidak akan dapat disatukan bersama.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، ‏‏‏‏‏‏حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، ‏‏‏‏‏‏حَدَّثَنِي أَبِي، ‏‏‏‏‏‏عَنْ الْوَلِيدِ بْنِ كَثِيرٍ، ‏‏‏‏‏‏حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ حَلْحَلَةَ الدِّيلِيُّ، ‏‏‏‏‏‏أَنَّ ابْنَ شِهَابٍ حَدَّثَهُ، ‏‏‏‏‏‏أَنَّ عَلِيَّ بْنَ الْحُسَيْنِ حَدَّثَهُ، ‏‏‏‏‏‏أَنَّهُمْ حِينَ قَدِمُوا الْمَدِينَةَ مِنْ عِنْدِ يَزِيدَ بْنِ مُعَاوِيَةَ مَقْتَلَ الْحُسَيْنِ بْنِ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُمَا، ‏‏‏‏‏‏لَقِيَهُ الْمِسْوَرُ بْنُ مَخْرَمَةَ فَقَالَ لَهُ:‏‏‏‏ هَلْ لَكَ إِلَيَّ مِنْ حَاجَةٍ تَأْمُرُنِي بِهَا ؟ قَالَ:‏‏‏‏ فَقُلْتُ لَهُ:‏‏‏‏ لَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَلْ أَنْتَ مُعْطِيَّ سَيْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ؟ فَإِنِّي أَخَافُ أَنْ يَغْلِبَكَ الْقَوْمُ عَلَيْهِ، ‏‏‏‏‏‏وَايْمُ اللَّهِ لَئِنْ أَعْطَيْتَنِيهِ لَا يُخْلَصُ إِلَيْهِ أَبَدًا حَتَّى يُبْلَغَ إِلَى نَفْسِي، ‏‏‏‏‏‏إِنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ خَطَبَ بِنْتَ أَبِي جَهْلٍ عَلَى فَاطِمَةَ رَضِيَ اللَّهُ عَنْهَا، ‏‏‏‏‏‏فَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَخْطُبُ النَّاسَ فِي ذَلِكَ عَلَى مِنْبَرِهِ هَذَا وَأَنَا يَوْمَئِذٍ مُحْتَلِمٌ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنَّ فَاطِمَةَ مِنِّي، ‏‏‏‏‏‏وَأَنَا أَتَخَوَّفُ أَنْ تُفْتَنَ فِي دِينِهَا ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ثُمَّ ذَكَرَ صِهْرًا لَهُ مِنْ بَنِي عَبْدِ شَمْسٍ فَأَثْنَى عَلَيْهِ فِي مُصَاهَرَتِهِ إِيَّاهُ فَأَحْسَنَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي فَصَدَقَنِي، ‏‏‏‏‏‏وَوَعَدَنِي فَوَفَّى لِي، ‏‏‏‏‏‏وَإِنِّي لَسْتُ أُحَرِّمُ حَلَالًا وَلَا أُحِلُّ حَرَامًا، ‏‏‏‏‏‏وَلَكِنْ وَاللَّهِ لَا تَجْتَمِعُ بِنْتُ رَسُولِ اللَّهِ وَبِنْتُ عَدُوِّ اللَّهِ مَكَانًا وَاحِدًا أَبَدًا ."
      },
      {
        "id": 21150,
        "hadith_number": "2070",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Ali RA Mendiamkan Diri Tentang Perkahwinan Anak Perempuan Abu Jahl",
        "perawi_melayu": "Ibn Abi Mulaikah",
        "english_text": "The aforesaid tradition has also been transmitted by Ibn Abi Mulaikah. He said “Ali (Allaah be pleased with him) then kept silence about the marriage (i. e., marrying Abi Jahl’s daughter)",
        "malay_translation": "Hadis ini juga diriwayatkan oleh Ibn Abi Mulaikah. Beliau berkata, “Kemudian Ali RA mendiamkan diri tentang perkahwinan tersebut (iaitu, mengahwini anak perempuan Abu Jahl).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَخْبَرَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنْ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏عَنْ و أَيُّوبَ، ‏‏‏‏‏‏عَنْ ابْنِ أَبِي مُلَيْكَةَ بِهَذَا الْخَبَرِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَسَكَتَ عَلِيٌّ عَنْ ذَلِكَ النِّكَاحِ."
      },
      {
        "id": 21151,
        "hadith_number": "2071",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Menikahi Anak Perempuan Bani Hisham bin Al Mughirah Tanpa Cerai Anak Perempuan Rasulullah SAW",
        "perawi_melayu": "Al Miswar bin Makramah meriwayatkan bahawa beliau mendengar Rasulullah SAW bersabda di atas mimbar:",
        "english_text": "Al Miswar bin Makramah said that he heard the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم say on the pulpit Banu Hashim bin Al Mughirah sought permission from me to marry their daughter to Ali bin Abi Talib. But I do not permit, again, I do not permit, again, I do not permit except that Ibn Abi Talib divorces my daughter and marries their daughter. My daughter is my part, what makes her uneasy makes me uneasy and what troubles her troubles me. The full information rests with the tradition narrated by Ahmad.",
        "malay_translation": "\"Banu Hashim bin Al Mughirah meminta izin kepadaku untuk menikahkan puteri mereka dengan Ali bin Abi Talib. Tetapi aku tidak mengizinkan, sekali lagi aku tidak mengizinkan, sekali lagi aku tidak mengizinkan kecuali Ibn Abi Talib menceraikan puteriku dan menikahi puteri mereka. Puteriku adalah sebahagian dariku, apa yang membuatnya tidak selesa membuatku tidak selesa dan apa yang menyusahkannya menyusahkanku.\" Maklumat penuh terdapat dalam riwayat yang diriwayatkan oleh Ahmad.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، ‏‏‏‏‏‏وَقُتَيْبَةُ بْنُ سَعِيدٍ الْمَعْنَى، ‏‏‏‏‏‏قَالَ أَحْمَدُ:‏‏‏‏ حَدَّثَنَا اللَّيْثُ، ‏‏‏‏‏‏حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عُبَيْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ الْقُرَشِيُّ التَّيْمِيُّ، ‏‏‏‏‏‏أَنَّ الْمِسْوَرَ بْنَ مَخْرَمَةَ حَدَّثَهُ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ إِنَّ بَنِي هِشَامِ بْنِ الْمُغِيرَةِ اسْتَأْذَنُونِي أَنْ يُنْكِحُوا ابْنَتَهُمْ مِنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، ‏‏‏‏‏‏فَلَا آذَنُ، ‏‏‏‏‏‏ثُمَّ لَا آذَنُ، ‏‏‏‏‏‏ثُمَّ لَا آذَنُ، ‏‏‏‏‏‏إِلَّا أَنْ يُرِيدَ ابْنُ أَبِي طَالِبٍ أَنْ يُطَلِّقَ ابْنَتِي وَيَنْكِحَ ابْنَتَهُمْ، ‏‏‏‏‏‏فَإِنَّمَا ابْنَتِي بَضْعَةٌ مِنِّي يُرِيبُنِي مَا أَرَابَهَا وَيُؤْذِينِي مَا آذَاهَا . وَالْإِخْبَارُ فِي حَدِيثِ أَحْمَدَ."
      },
      {
        "id": 21152,
        "hadith_number": "2072",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Nikah Mut'ah Semasa Haji Wada'",
        "perawi_melayu": "Tiada Maklumat",
        "english_text": "Al Zuhri said “we were with Umar bin Abd Al Aziz, there we discussed temporary marriage. A man called Rabi bin Saburah said “I bear witness that my father told me that the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم had prohibited it at the Farewell Pilgrimage. ”",
        "malay_translation": "Al-Zuhri berkata, “Kami bersama Umar bin Abd Al Aziz, di sana kami membincangkan tentang nikah mut'ah (perkahwinan sementara). Seorang lelaki bernama Rabi bin Saburah berkata, “Saya bersaksi bahawa ayah saya memberitahu saya bahawa Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم telah melarangnya pada Haji Wada’ (Haji Perpisahan).”",
        "arabic_text": "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْوَارِثِ، ‏‏‏‏‏‏عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، ‏‏‏‏‏‏عَنْ الزُّهْرِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنَّا عِنْدَ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ فَتَذَاكَرْنَا مُتْعَةَ النِّسَاءِ، ‏‏‏‏‏‏فَقَالَ لَهُ رَجُلٌ يُقَالُ لَهُ:‏‏‏‏ رَبِيعُ بْنُ سَبْرَةَ:‏‏‏‏ أَشْهَدُ عَلَى أَبِي أَنَّهُ حَدَّثَ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهَا فِي حَجَّةِ الْوَدَاعِ ."
      },
      {
        "id": 21153,
        "hadith_number": "2073",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Nikah Shighar",
        "perawi_melayu": "Ibn Umar meriwayatkan bahawa Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم melarang nikah shighar. Musaddad menambah dalam riwayatnya: Aku bertanya kepada Nafi: Apakah itu shighar? (Maksudnya) seorang lelaki mengahwini anak perempuan lelaki lain dan memberikan anak perempuannya sendiri kepadanya dalam perkahwinan tanpa menetapkan mahar; dan seorang lelaki mengahwini saudara perempuan lelaki lain dan memberikan saudara perempuannya kepadanya dalam perkahwinan tanpa menetapkan mahar.",
        "english_text": "Ibn Umar said “The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم prohibited shighar marriage. Musaddad added in his version “I said to Nafi “What is shighar?” (It means that) a man marries the daughter of another man and gives his own daughter to him in marriage without fixing dower; and a man marries the sister of another man and gives him his sister in marriage without fixing dower.",
        "malay_translation": "Ibn Umar berkata, “Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم melarang pernikahan shighar. Musaddad menambah dalam riwayatnya, “Aku bertanya kepada Nafi', 'Apakah itu shighar?' (Ia bermaksud) seorang lelaki mengahwini anak perempuan lelaki lain dan memberikan anak perempuannya sendiri kepadanya dalam perkahwinan tanpa menetapkan mas kahwin; dan seorang lelaki mengahwini saudara perempuan lelaki lain dan memberikan saudara perempuannya kepadanya dalam perkahwinan tanpa menetapkan mas kahwin.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَخْبَرَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنْ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ رَبِيعِ بْنِ سَبْرَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَرَّمَ مُتْعَةَ النِّسَاءِ ."
      },
      {
        "id": 21154,
        "hadith_number": "2074",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Nikah Syighar",
        "perawi_melayu": "Diriwayatkan daripada Ibn Umar RA",
        "english_text": "Ibn Umar said “The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم prohibited shighar marriage. Musaddad added in his version “I said to Nafi “What is shighar?” (It means that) a man marries the daughter of another man and gives his own daughter to him in marriage without fixing dower; and a man marries the sister of another man and gives him his sister in marriage without fixing dower.",
        "malay_translation": "Ibn Umar RA berkata, “Rasulullah SAW melarang nikah syighar.” Musaddad menambahkan dalam riwayatnya, “Aku bertanya kepada Nafi’, ‘Apakah itu syighar?’ (Ia bermaksud) seorang lelaki menikahi anak perempuan lelaki lain dan memberikan anak perempuannya sendiri kepadanya dalam pernikahan tanpa menetapkan mahar; dan seorang lelaki menikahi saudara perempuan lelaki lain dan memberikannya saudara perempuannya dalam pernikahan tanpa menetapkan mahar.”",
        "arabic_text": "حَدَّثَنَا الْقَعْنَبِيُّ، ‏‏‏‏‏‏عَنْ مَالِكٍ. ح وحَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ، ‏‏‏‏‏‏كِلَاهُمَا عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الشِّغَارِ . زَادَ مُسَدَّد فِي حَدِيثِهِ:‏‏‏‏ قُلْتُ لِنَافِعٍ:‏‏‏‏ مَا الشِّغَارُ ؟ قَالَ:‏‏‏‏ يَنْكِحُ ابْنَةَ الرَّجُلِ وَيُنْكِحُهُ ابْنَتَهُ بِغَيْرِ صَدَاقٍ، ‏‏‏‏‏‏وَيَنْكِحُ أُخْتَ الرَّجُلِ وَيُنْكِحُهُ أُخْتَهُ بِغَيْرِ صَدَاقٍ."
      },
      {
        "id": 21155,
        "hadith_number": "2075",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Nikah Syighar",
        "perawi_melayu": "Abdur Rahman ibn Hurmuz al-Araj berkata:",
        "english_text": "Abdur Rahman ibn Hurmuz al-Araj said: Al-Abbas ibn Abdullah ibn al-Abbas married his daughter to Abdur Rahman ibn al-Hakam, and Abdur Rahman married his daughter to him. And they made this (exchange) their dower. Muawiyah wrote to Marwan commanding him to separate them. He wrote in his letter: This is the shighar which the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم has forbidden.",
        "malay_translation": "Abdur Rahman ibn Hurmuz al-Araj berkata: Al-Abbas ibn Abdullah ibn al-Abbas menikahkan puterinya kepada Abdur Rahman ibn al-Hakam, dan Abdur Rahman menikahkan puterinya kepada Al-Abbas. Mereka menjadikan pertukaran ini sebagai mas kahwin. Muawiyah menulis surat kepada Marwan memerintahkannya untuk memisahkan mereka. Dia menulis dalam suratnya: Ini adalah nikah syighar yang dilarang oleh Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ، ‏‏‏‏‏‏حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏حَدَّثَنَا أَبِي، ‏‏‏‏‏‏عَنْ ابْنِ إِسْحَاقَ، ‏‏‏‏‏‏حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ هُرْمُزَ الْأَعْرَجُ، ‏‏‏‏‏‏أَنَّ الْعَبَّاسَ بْنَ عَبْدِ اللَّهِ بْنِ الْعَبَّاسِ أَنْكَحَ عَبْدَ الرَّحْمَنِ بْنَ الْحَكَمِ ابْنَتَهُ وَأَنْكَحَهُ عَبْدُ الرَّحْمَنِ ابْنَتَهُ وَكَانَا جَعَلَا صَدَاقًا، ‏‏‏‏‏‏فَكَتَبَ مُعَاوِيَةُ إِلَى مَرْوَانَ يَأْمُرُهُ بِالتَّفْرِيقِ بَيْنَهُمَا، ‏‏‏‏‏‏وَقَالَ فِي كِتَابِهِ:‏‏‏‏ هَذَا الشِّغَارُ الَّذِي نَهَى عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ."
      },
      {
        "id": 21156,
        "hadith_number": "2076",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Terhadap Muhallil dan Muhallal Lahu (Kahwin Cina Buta)",
        "perawi_melayu": "Diriwayatkan daripada Ali ibn Abu Talib: (Perawi Ismail berkata: Saya rasa ash-Shabi mengaitkan hadis ini kepada Nabi). Nabi ﷺ bersabda: Laknat Allah ke atas orang yang menikahi wanita yang diceraikan dengan niat untuk menghalalkannya bagi bekas suaminya, dan ke atas orang yang untuknya dia dihalalkan.",
        "english_text": "Narrated Ali ibn Abu Talib: (The narrator Ismail said: I think ash-Shabi attributed this tradition to the Prophet) The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Curse be upon the one who marries a divorced woman with the intention of making her lawful for her former husband and upon the one for whom she is made lawful.",
        "malay_translation": "Diriwayatkan daripada Ali ibn Abu Talib: (Perawi Ismail berkata: Saya rasa ash-Shabi mengaitkan hadis ini kepada Nabi ﷺ). Nabi ﷺ bersabda: Laknat Allah ke atas orang yang menikahi wanita yang diceraikan dengan niat untuk menghalalkannya bagi bekas suaminya, dan ke atas orang yang untuknya dia dihalalkan. Ini adalah larangan terhadap amalan 'kahwin cina buta'.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، ‏‏‏‏‏‏حَدَّثَنَا زُهَيْرٌ، ‏‏‏‏‏‏حَدَّثَنِي إِسْمَاعِيلُ، ‏‏‏‏‏‏عَنْ عَامِرٍ، ‏‏‏‏‏‏عَنْ الْحَارِثِ، ‏‏‏‏‏‏عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ، ‏‏‏‏‏‏قَالَ إِسْمَاعِيلُ:‏‏‏‏ وَأُرَاهُ قَدْ رَفَعَهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَعَنَ اللَّهُ الْمُحَلِّلَ وَالْمُحَلَّلَ لَهُ ."
      },
      {
        "id": 21157,
        "hadith_number": "2077",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Penyampaian Hadis yang Sama oleh Ali RA dengan Rantaian Perawi yang Berbeza",
        "perawi_melayu": "Harith al-A'war meriwayatkan daripada seorang Sahabat Nabi SAW, dan mereka mengatakan bahawa",
        "english_text": "The aforesaid tradition has also been transmitted by Ali through a different chain of narrators from the Prophet صلی ‌اللہ ‌علیہ ‌وسلم to the same effect.",
        "malay_translation": "Hadis yang tersebut di atas juga diriwayatkan oleh Ali melalui rantaian perawi yang berbeza daripada Nabi صلی ‌اللہ ‌علیہ ‌وسلم dengan maksud yang sama.",
        "arabic_text": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ، ‏‏‏‏‏‏عَنْ خَالِدٍ، ‏‏‏‏‏‏عَنْ حُصَيْنٍ، ‏‏‏‏‏‏عَنْ عَامِرٍ، ‏‏‏‏‏‏عَنْ الْحَارِثِ الْأَعْوَرِ، ‏‏‏‏‏‏عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَرَأَيْنَا أَنَّهُ عَلِيٌّ عَلَيْهِ السَّلَام، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏بِمَعْنَاهُ."
      },
      {
        "id": 21158,
        "hadith_number": "2078",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hamba yang Berkahwin Tanpa Izin Tuan",
        "perawi_melayu": "Diriwayatkan daripada Jabir ibn Abdullah RA: Nabi ﷺ bersabda: Jika seorang hamba berkahwin tanpa izin tuannya, maka dia adalah seorang penzina.",
        "english_text": "Narrated Jabir ibn Abdullah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: If any slave marries without the permission of his masters, he is a fornicator.",
        "malay_translation": "Diriwayatkan daripada Jabir ibn Abdullah RA: Nabi ﷺ bersabda: Jika seorang hamba berkahwin tanpa izin tuannya, maka dia adalah seorang penzina.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، ‏‏‏‏‏‏وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ وَهَذَا لَفْظُ إِسْنَادِهِ، ‏‏‏‏‏‏وَكِلاهُمَا عَنْ وَكِيعٍ، ‏‏‏‏‏‏حَدَّثَنَا الْحَسَنُ بْنُ صَالِحٍ، ‏‏‏‏‏‏عَنْعَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، ‏‏‏‏‏‏عَنْ جَابِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَيُّمَا عَبْدٍ تَزَوَّجَ بِغَيْرِ إِذْنِ مَوَالِيهِ فَهُوَ عَاهِرٌ ."
      },
      {
        "id": 21159,
        "hadith_number": "2079",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Perkahwinan Hamba Tanpa Izin Tuan",
        "perawi_melayu": "Diriwayatkan daripada Ibn Umar",
        "english_text": "Ibn Umar reported the Prophet صلی ‌اللہ ‌علیہ ‌وسلم as saying “If a slave marries without the permission of his master, his marriage is null and void. Abu Dawud said “This tradition is weak. This is mauquf (does not go back to the Prophet). This is the statement of the Ibn Umar himself.",
        "malay_translation": "Ibn Umar meriwayatkan bahawa Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda, “Jika seorang hamba berkahwin tanpa izin tuannya, maka perkahwinannya adalah batal dan tidak sah.” Abu Dawood berkata, “Hadis ini dhaif (lemah). Ini adalah mauquf (tidak sampai kepada Nabi). Ini adalah kenyataan Ibn Umar sendiri.”",
        "arabic_text": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو قُتَيْبَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِذَا نَكَحَ الْعَبْدُ بِغَيْرِ إِذْنِ مَوْلَاهُ فَنِكَاحُهُ بَاطِلٌ . قَالَ أَبُو دَاوُد:‏‏‏‏ هَذَا الْحَدِيثُ ضَعِيفٌ، ‏‏‏‏‏‏وَهُوَ مَوْقُوفٌ، ‏‏‏‏‏‏وَهُوَ قَوْلُ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا."
      },
      {
        "id": 21160,
        "hadith_number": "2080",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Meminang Wanita yang Telah Dipinang",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA, bahawa Rasulullah SAW bersabda:",
        "english_text": "Abu Hurairah reported the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم as saying “ A man should not seek the hand of a woman in marriage when his brother has already sought her hand. ”",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda: “Seseorang lelaki tidak seharusnya meminang seorang wanita apabila saudaranya telah pun meminangnya.”",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا يَخْطُبُ الرَّجُلُ عَلَى خِطْبَةِ أَخِيهِ ."
      },
      {
        "id": 21161,
        "hadith_number": "2081",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Meminang Tunangan Orang Lain dan Menjual Semasa Jualan Saudara Lain Masih Berlangsung",
        "perawi_melayu": "Diriwayatkan daripada Abdullah ibn Umar RA:",
        "english_text": "Narrated Abdullah ibn Umar: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: One of you must not ask a woman in marriage when his brother has done so already, and one of you must not sell (his own goods) when his brother has already sold (his goods) except with his permission.",
        "malay_translation": "Diriwayatkan daripada Abdullah ibn Umar RA: Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Janganlah seseorang kamu meminang seorang wanita yang telah dipinang oleh saudaranya, dan janganlah seseorang kamu menjual (barangnya sendiri) ketika saudaranya telah menjual (barangnya) kecuali dengan izinnya.",
        "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ /a>، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا يَخْطُبْ أَحَدُكُمْ عَلَى خِطْبَةِ أَخِيهِ، ‏‏‏‏‏‏وَلَا يَبِيعْ عَلَى بَيْعِ أَخِيهِ، ‏‏‏‏‏‏إِلَّا بِإِذْنِهِ . قالَ سُفْيَانُ:‏‏‏‏ لا يَبِيعُ عَلَى بَيْعِ صَاحِبِهِ يَقُولُ عِنْدِي خَيْرٌ مِنْهَا."
      },
      {
        "id": 21162,
        "hadith_number": "2082",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Melihat Wanita yang Dipinang",
        "perawi_melayu": "Jabir ibn Abdullah meriwayatkan",
        "english_text": "Narrated Jabir ibn Abdullah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: When one of you asked a woman in marriage, if he is able to look at what will induce him to marry her, he should do so. He (Jabir) said: I asked a girl in marriage, I used to look at her secretly, until I looked at what induced me to marry her. I, therefore, married her.",
        "malay_translation": "Jabir ibn Abdullah meriwayatkan: Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Apabila seseorang daripada kamu meminang seorang wanita, jika dia mampu melihat apa yang mendorongnya untuk mengahwininya, maka hendaklah dia berbuat demikian. Dia (Jabir) berkata: Saya meminang seorang gadis, saya biasa melihatnya secara sembunyi, sehingga saya melihat apa yang mendorong saya untuk mengahwininya. Oleh itu, saya mengahwininya.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ، ‏‏‏‏‏‏عَنْ دَاوُدَ بْنِ حُصَيْنٍ، ‏‏‏‏‏‏عَنْ وَاقِدِ بْنِ عَبْدِ الرَّحْمَنِ يَعْنِي ابْنَ سَعْدِ بْنِ مُعَاذٍ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا خَطَبَ أَحَدُكُمُ الْمَرْأَةَ، ‏‏‏‏‏‏فَإِنِ اسْتَطَاعَ أَنْ يَنْظُرَ إِلَى مَا يَدْعُوهُ إِلَى نِكَاحِهَا فَلْيَفْعَلْ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَخَطَبْتُ جَارِيَةً، ‏‏‏‏‏‏فَكُنْتُ أَتَخَبَّأُ لَهَا حَتَّى رَأَيْتُ مِنْهَا مَا دَعَانِي إِلَى نِكَاحِهَا وَتَزَوُّجِهَا فَتَزَوَّجْتُهَا."
      },
      {
        "id": 21163,
        "hadith_number": "2083",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Nikah Wanita Tanpa Izin Wali Adalah Batal",
        "perawi_melayu": "Aisyah, Ummul Muminin",
        "english_text": "Narrated Aishah, Ummul Muminin: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said: The marriage of a woman who marries without the consent of her guardians is void. (He said these words) three times. If there is cohabitation, she gets her dower for the intercourse her husband has had. If there is a dispute, the sultan (man in authority) is the guardian of one who has none.",
        "malay_translation": "Diriwayatkan dari Aisyah, Ummul Muminin: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Pernikahan seorang wanita yang menikah tanpa izin walinya adalah batal. (Baginda mengucapkan kata-kata ini) sebanyak tiga kali. Jika telah terjadi persetubuhan, maka dia berhak mendapatkan maharnya atas persetubuhan yang telah dilakukan suaminya. Jika terjadi perselisihan, maka sultan (penguasa) adalah wali bagi orang yang tidak memiliki wali.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، ‏‏‏‏‏‏أَخْبَرَنَا سُفْيَانُ، ‏‏‏‏‏‏أَخْبَرَنَا ابْنُ جُرَيْجٍ، ‏‏‏‏‏‏عَنْ سُلَيْمَانَ بْنِ مُوسَى، ‏‏‏‏‏‏عَنْ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏عَنْعَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَيُّمَا امْرَأَةٍ نَكَحَتْ بِغَيْرِ إِذْنِ مَوَالِيهَا فَنِكَاحُهَا بَاطِلٌ ثَلَاثَ مَرَّاتٍ، ‏‏‏‏‏‏فَإِنْ دَخَلَ بِهَا، ‏‏‏‏‏‏فَالْمَهْرُ لَهَا بِمَا أَصَابَ مِنْهَا، ‏‏‏‏‏‏فَإِنْ تَشَاجَرُوا فَالسُّلْطَانُ وَلِيُّ مَنْ لَا وَلِيَّ لَهُ ."
      },
      {
        "id": 21164,
        "hadith_number": "2084",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Riwayat daripada Aishah mengenai Maksud yang Sama",
        "perawi_melayu": "Aishah",
        "english_text": "This tradition has also been transmitted by Aishah through a different chain of narrators from the Prophet صلی ‌اللہ ‌علیہ ‌وسلم to the same effect. Abu Dawud said “Jafar did not hear any tradition from Al Zuhri. Al Zuhri gave him his writing. ”",
        "malay_translation": "Hadis ini juga diriwayatkan oleh Aishah melalui sanad yang berbeza daripada Nabi صلی ‌اللہ ‌علیہ ‌وسلم dengan maksud yang sama. Abu Dawud berkata, \"Ja'far tidak mendengar apa-apa hadis daripada Al Zuhri. Al Zuhri memberikan tulisannya kepadanya.\"",
        "arabic_text": "حَدَّثَنَا الْقَعْنَبِيُّ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ لَهِيعَةَ، ‏‏‏‏‏‏عَنْ جَعْفَرٍ يَعْنِي ابْنَ رَبِيعَةَ، ‏‏‏‏‏‏عَنْ ابْنِ شِهَابٍ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏بِمَعْنَاهُ. قَالَ أَبُو دَاوُد:‏‏‏‏ جَعْفَرٌ لَمْ يَسْمَعْ مِنْ الزُّهْرِيِّ، ‏‏‏‏‏‏كَتَبَ إِلَيْهِ."
      },
      {
        "id": 21165,
        "hadith_number": "2085",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Tiada Pernikahan Sah Tanpa Wali",
        "perawi_melayu": "Diriwayatkan daripada Abu Musa RA:",
        "english_text": "Narrated Abu Musa: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: There is no marriage without the permission of a guardian. Abu Dawud said: The narrator Yunus also transmitted on the authority of Abu Burdah, and Isra'il narrated from Abu Ishaq on the authority of Abu Burdah.",
        "malay_translation": "Diriwayatkan daripada Abu Musa RA: Nabi ﷺ bersabda: Tidak sah sesuatu pernikahan tanpa izin seorang wali. Abu Dawud berkata: Perawi Yunus juga meriwayatkan daripada Abu Burdah, dan Isra'il meriwayatkan daripada Abu Ishaq daripada Abu Burdah.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ قُدَامَةَ بْنِ أَعْيَنَ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو عُبَيْدَةَ الْحَدَّادُ، ‏‏‏‏‏‏عَنْ يُونُسَ، ‏‏‏‏‏‏وَإِسْرَائِيلَ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاقَ، ‏‏‏‏‏‏عَنْ أَبِي بُرْدَةَ، ‏‏‏‏‏‏عَنْ أَبِي مُوسَى، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا نِكَاحَ إِلَّا بِوَلِيٍّ . قَالَ أَبُو دَاوُد:‏‏‏‏ وَهُوَ يُونُسُ، ‏‏‏‏‏‏عَنْ أَبِي بُرْدَةَ وَ إِسْرَائِيلُ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاقَ، ‏‏‏‏‏‏عَنْ أَبِي بُرْدَةَ."
      },
      {
        "id": 21166,
        "hadith_number": "2087",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Menghalang Wanita yang Ditalak untuk Berkahwin Semula dengan Bekas Suami",
        "perawi_melayu": "Maqil bin Yasar berkata",
        "english_text": "Maqil bin Yasar said “I had a sister and I was asked to give her in marriage. My cousin came to me and I married to him. He then divorced her one revocable divorce. He abandoned her till her waiting period passed. When I was asked to give her in marriage, he again came to me and asked her in marriage. ” Thereupon I said o him “No, by Allaah, I will never marry her to you. Then the following verse was revealed about my case “And when ye have divorced women and they reach their term, place not difficulties in the way of their marrying their husbands. ”",
        "malay_translation": "Maqil bin Yasar berkata, “Saya mempunyai seorang saudara perempuan dan saya diminta untuk menikahkannya. Sepupu saya datang kepada saya dan saya menikahkannya dengan dia. Kemudian dia menceraikannya dengan talak satu yang boleh dirujuk. Dia meninggalkannya sehingga tempoh iddahnya berakhir. Apabila saya diminta untuk menikahkannya, dia datang lagi kepada saya dan memintanya untuk dinikahi.” Lalu saya berkata kepadanya, “Tidak, demi Allah, saya tidak akan menikahkannya dengan kamu selama-lamanya.” Kemudian ayat berikut diturunkan mengenai kes saya, “Dan apabila kamu menceraikan isteri-isteri kamu, lalu mereka telah mendekati akhir tempoh iddah mereka, maka janganlah kamu menghalang mereka berkahwin dengan (bekas) suami mereka.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏حَدَّثَنِي أَبُو عَامِرٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبَّادُ بْنُ رَاشِدٍ، ‏‏‏‏‏‏عَنْ الْحَسَنِ، ‏‏‏‏‏‏حَدَّثَنِي مَعْقِلُ بْنُ يَسَارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَتْ لِي أُخْتٌ تُخْطَبُ إِلَيَّ، ‏‏‏‏‏‏فَأَتَانِي ابْنُ عَمّ لِي فَأَنْكَحْتُهَا إِيَّاهُ، ‏‏‏‏‏‏ثُمَّ طَلَّقَهَا طَلَاقًا لَهُ رَجْعَةٌ، ‏‏‏‏‏‏ثُمَّ تَرَكَهَا حَتَّى انْقَضَتْ عِدَّتُهَا، ‏‏‏‏‏‏فَلَمَّا خُطِبَتْ إِلَيَّ أَتَانِي يَخْطُبُهَا، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ لَا وَاللَّهِ لَا أُنْكِحُهَا أَبَدًا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَفِيَّ نَزَلَتْ هَذِهِ الْآيَةُ:‏‏‏‏ وَإِذَا طَلَّقْتُمُ النِّسَاءَ فَبَلَغْنَ أَجَلَهُنَّ فَلا تَعْضُلُوهُنَّ أَنْ يَنْكِحْنَ أَزْوَاجَهُنَّ سورة البقرة آية 232 الْآيَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَكَفَّرْتُ عَنْ يَمِينِي، ‏‏‏‏‏‏فَأَنْكَحْتُهَا إِيَّاهُ ."
      },
      {
        "id": 21167,
        "hadith_number": "2088",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Perkahwinan dan Jualan: Hak Keutamaan bagi yang Pertama",
        "perawi_melayu": "Diriwayatkan daripada Samurah RA",
        "english_text": "Narrated Samurah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Any woman who is married by two guardians (to two different men) belongs to the first woman who is married by two guardians (to two different men) belongs to the first of them and anything sold by a man to two persons belongs to the first of them.",
        "malay_translation": "Diriwayatkan daripada Samurah RA: Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Mana-mana wanita yang dinikahkan oleh dua wali (kepada dua lelaki yang berbeza), maka dia adalah milik yang pertama daripada mereka. Dan apa-apa sahaja yang dijual oleh seorang lelaki kepada dua orang, maka ia adalah milik yang pertama daripada mereka.",
        "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏حَدَّثَنَا هِشَامٌ. ح وحَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، ‏‏‏‏‏‏أَخْبَرَنَا هَمَّامٌ. ح وحَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادٌ الْمَعْنَى،‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ الْحَسَنِ، ‏‏‏‏‏‏عَنْ سَمُرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَيُّمَا امْرَأَةٍ زَوَّجَهَا وَلِيَّانِ فَهِيَ لِلْأَوَّلِ مِنْهُمَا، ‏‏‏‏‏‏وَأَيُّمَا رَجُلٍ بَاعَ بَيْعًا مِنْ رَجُلَيْنِ فَهُوَ لِلْأَوَّلِ مِنْهُمَا ."
      },
      {
        "id": 21168,
        "hadith_number": "2089",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Mewarisi Wanita Secara Paksa dan Menghalang Mereka Berkahwin",
        "perawi_melayu": "Abdullah ibn Abbas",
        "english_text": "Narrated Abdullah ibn Abbas: About the Quranic verse: It is not lawful for you forcibly to inherit the woman (of your deceased kinsmen), nor (that) ye should put constraint upon them. When a man died, his relatives had more right to his wife then her own guardian. If any one of them wanted to marry her, he did so; or they married her (to some other person), and if they did not want to marry her, they did so. So this verse was revealed about the matter.",
        "malay_translation": "Diriwayatkan daripada Abdullah ibn Abbas: Berkenaan ayat Al-Quran: Tidak halal bagi kamu mewarisi wanita (dari kerabat kamu yang telah meninggal dunia) secara paksa, dan tidak (pula) kamu menghalang mereka. Apabila seorang lelaki meninggal dunia, kerabatnya mempunyai hak yang lebih ke atas isterinya berbanding walinya sendiri. Jika sesiapa antara mereka ingin mengahwininya, dia berbuat demikian; atau mereka mengahwinkannya (dengan orang lain), dan jika mereka tidak mahu mengahwinkannya, mereka berbuat demikian. Maka ayat ini diturunkan mengenai perkara itu.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، ‏‏‏‏‏‏حَدَّثَنَا أَسْبَاطُ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا الشَّيْبَانِيُّ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ الشَّيْبَانِيُّ وَذَكَرَهُ عَطَاءٌ أَبُو الْحَسَنِ السُّوَائِيُّ، ‏‏‏‏‏‏وَلَا أَظُنُّهُ إِلَّا عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏فِي هَذِهِ الْآيَةِ:‏‏‏‏ لا يَحِلُّ لَكُمْ أَنْ تَرِثُوا النِّسَاءَ كَرْهًا وَلا تَعْضُلُوهُنَّ سورة النساء آية 19، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ الرَّجُلُ إِذَا مَاتَ كَانَ أَوْلِيَاؤُهُ أَحَقَّ بِامْرَأَتِهِ مِنْ وَلِيِّ نَفْسِهَا، ‏‏‏‏‏‏إِنْ شَاءَ بَعْضُهُمْ زَوَّجَهَا أَوْ زَوَّجُوهَا، ‏‏‏‏‏‏وَإِنْ شَاءُوا لَمْ يُزَوِّجُوهَا، ‏‏‏‏‏‏فَنَزَلَتْ هَذِهِ الْآيَةُ فِي ذَلِكَ ."
      },
      {
        "id": 21169,
        "hadith_number": "2090",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Mewarisi Wanita Secara Paksa dan Menghalang Mereka Berkahwin",
        "perawi_melayu": "Ibn Abbas menerangkan ayat Quran: Tidak halal bagi kamu mewarisi wanita (kerabat kamu yang telah meninggal dunia) secara paksa, dan tidak (pula) kamu boleh menyempitkan mereka supaya kamu mengambil kembali sebahagian daripada apa yang telah kamu berikan kepada mereka, kecuali jika mereka melakukan perbuatan keji yang nyata. Beliau berkata, \"Ini bermakna seorang lelaki biasa mewarisi seorang wanita kerabatnya. Dia menghalangnya daripada berkahwin sehingga dia meninggal dunia atau mengembalikan maharnya kepadanya. Oleh itu, Allah melarang amalan itu.\"",
        "english_text": "Ibn Abbas explained the Quranic verse It is not lawful for you forcibly to inherit the woman (of your deceased kinsmen) nor (that) ye should put constraint upon them that ye may take away a part of that which ye have given them, unless they be guilty of flagrant lewdness and said “This means that a man used to inherit a relative woman. He prevented her from marriage till she died or returned her dower to her. Hence, Allaah prohibited that practice.",
        "malay_translation": "Ibn Abbas menjelaskan ayat Al-Quran: Tidak halal bagi kamu mewarisi wanita (dari kalangan kerabat yang telah meninggal dunia) secara paksa, dan tidak (pula) kamu menyusahkan mereka untuk mengambil kembali sebahagian dari apa yang telah kamu berikan kepada mereka, kecuali jika mereka melakukan perbuatan keji yang nyata. Beliau berkata, \"Ini bermaksud seorang lelaki dahulukala mewarisi seorang wanita dari kalangan kerabatnya. Dia menghalangnya daripada berkahwin sehingga wanita itu meninggal dunia atau mengembalikan maharnya. Oleh itu, Allah melarang amalan tersebut.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ ثَابِتٍ الْمَرْوَزِيُّ، ‏‏‏‏‏‏حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنِ بْنِ وَاقِدٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ يَزِيدَ النَّحْوِيِّ، ‏‏‏‏‏‏عَنْعِكْرِمَةَ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لا يَحِلُّ لَكُمْ أَنْ تَرِثُوا النِّسَاءَ كَرْهًا وَلا تَعْضُلُوهُنَّ لِتَذْهَبُوا بِبَعْضِ مَا آتَيْتُمُوهُنَّ إِلا أَنْ يَأْتِينَ بِفَاحِشَةٍ مُبَيِّنَةٍ سورة النساء آية 19، ‏‏‏‏‏‏وَذَلِكَ أَنَّ الرَّجُلَ كَانَ يَرِثُ امْرَأَةَ ذِي قَرَابَتِهِ فَيَعْضُلُهَا حَتَّى تَمُوتَ، ‏‏‏‏‏‏أَوْ تَرُدَّ إِلَيْهِ صَدَاقَهَا، ‏‏‏‏‏‏فَأَحْكَمَ اللَّهُ عَنْ ذَلِكَ، ‏‏‏‏‏‏وَنَهَى عَنْ ذَلِكَ ."
      },
      {
        "id": 21170,
        "hadith_number": "2091",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Allah terhadap Amalan Tertentu",
        "perawi_melayu": "Diriwayatkan oleh Al-Dahhak dengan sanad yang berbeza dengan maksud yang sama.",
        "english_text": "The aforesaid tradition has also been transmitted by Al Dahhak to the same effect through a different chain of narrators. This version has Allaah prohibited that (practice).",
        "malay_translation": "Hadis yang sama juga diriwayatkan oleh Al-Dahhak dengan maksud yang serupa melalui rangkaian perawi yang berbeza. Dalam riwayat ini, Allah telah melarang amalan tersebut.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ شَبُّوَيْهِ الْمَرْوَزِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ، ‏‏‏‏‏‏عَنْ عِيسَى بْنِ عُبَيْدٍ، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ مَوْلَى عُمَرَ، ‏‏‏‏‏‏عَنْ الضَّحَّاكِ بِمَعْنَاهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَوَعَظَ اللَّهُ ذَلِكَ."
      },
      {
        "id": 21171,
        "hadith_number": "2092",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Keizinan Wanita Janda dan Dara dalam Perkahwinan",
        "perawi_melayu": "Diriwayatkan dari Abu Hurairah RA",
        "english_text": "Abu Hurairah reported the Prophet صلی ‌اللہ ‌علیہ ‌وسلم as saying “ A woman who has been previously married should not be married until her permission is asked nor should a virgin be married without her permission. “They (the people) asked “What is her permission, Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم? He replied “it is by her keeping silence. ”",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Nabi ﷺ bersabda, “Seorang wanita yang telah berkahwin sebelum ini tidak boleh dikahwinkan sehingga diminta izinnya, dan seorang gadis (dara) tidak boleh dikahwinkan tanpa izinnya.” Mereka (para sahabat) bertanya, “Apakah izinnya, wahai Rasulullah ﷺ?” Baginda menjawab, “Izinnya adalah dengan dia berdiam diri.”",
        "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏حَدَّثَنَا أَبَانُ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا تُنْكَحُ الثَّيِّبُ حَتَّى تُسْتَأْمَرَ، ‏‏‏‏‏‏وَلَا الْبِكْرُ إِلَّا بِإِذْنِهَا ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏وَمَا إِذْنُهَا ؟ قَالَ:‏‏‏‏ أَنْ تَسْكُتَ ."
      },
      {
        "id": 21172,
        "hadith_number": "2093",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Perundingan dengan Anak Yatim Dara dalam Perkahwinan",
        "perawi_melayu": "Abu Hurairah RA",
        "english_text": "Narrated Abu Hurairah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: An orphan virgin girl should be consulted about herself; if she says nothing that indicates her permission, but if she refuses, the authority of the guardian cannot be exercised against her will. The full information rest with the tradition narrated by Yazid. Abu Dawud said: This tradition has also been transmitted in a similar way by Abu Khalid Sulaiman bin Hayyan and Muadh bin Muadh on the authority of Muhammad bin Amr.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah RA: Nabi ﷺ bersabda: Anak yatim dara perlu dirundingkan tentang dirinya; jika dia tidak berkata apa-apa, itu menunjukkan keizinannya, tetapi jika dia menolak, kuasa penjaga tidak boleh dilaksanakan bertentangan dengan kehendaknya. Maklumat penuh terdapat dalam hadis yang diriwayatkan oleh Yazid. Abu Dawud berkata: Hadis ini juga telah diriwayatkan dengan cara yang serupa oleh Abu Khalid Sulaiman bin Hayyan dan Muadh bin Muadh daripada Muhammad bin Amr.",
        "arabic_text": "حَدَّثَنَا أَبُو كَامِلٍ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ. ح وحَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادٌ الْمَعْنَى، ‏‏‏‏‏‏حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرٍو، ‏‏‏‏‏‏حَدَّثَنَا أَبُو سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ تُسْتَأْمَرُ الْيَتِيمَةُ فِي نَفْسِهَا، ‏‏‏‏‏‏فَإِنْ سَكَتَتْ فَهُوَ إِذْنُهَا، ‏‏‏‏‏‏وَإِنْ أَبَتْ فَلَا جَوَازَ عَلَيْهَا . وَالْإِخْبَارُ فِي حَدِيثِ يَزِيدَ. قَالَ أَبُو دَاوُد:‏‏‏‏ وَكَذَلِكَ رَوَاهُ أَبُو خَالِدٍ سُلَيْمَانُ بْنُ حَيَّانَ ومُعَاذُ بْنُ مُعَاذٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ عَمْرٍو."
      },
      {
        "id": 21173,
        "hadith_number": "2094",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Persetujuan Anak Dara dalam Perkahwinan: Diamnya adalah Pengakuan",
        "perawi_melayu": "Muhammad bin Amr",
        "english_text": "The aforesaid tradition has also been transmitted through a different chain of narrators by Muhammad bin Amr. This version adds “If she weeps or keeps silence”. The narrator added the word “weeps”. Abu Dawud said: The word weeps is not guarded. This is a misunderstanding of the tradition on the part of the narrator Ibn Idris or Muhammad bin al-Ata. Abu Dawud said: This tradition has also been narrated by Abu Amr Dhakwan on the authority of Aishah who said: A virgin is ashamed of speaking, Messenger of Allah. He said: Her silence is her acceptance.",
        "malay_translation": "Hadis ini juga diriwayatkan melalui sanad yang berbeza oleh Muhammad bin Amr. Versi ini menambahkan, \"Jika dia menangis atau berdiam diri\". Perawi menambahkan perkataan \"menangis\". Abu Dawud berkata: Perkataan \"menangis\" tidak dijaga (yakni, tidak tepat). Ini adalah salah faham terhadap hadis tersebut dari pihak perawi Ibn Idris atau Muhammad bin al-Ata. Abu Dawud berkata: Hadis ini juga diriwayatkan oleh Abu Amr Dhakwan daripada Aishah yang berkata: Wahai Rasulullah, sesungguhnya anak dara malu untuk berbicara. Baginda bersabda: Diamnya adalah persetujuannya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ إِدْرِيسَ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ عَمْرٍو بِهَذَا الْحَدِيثِ بِإِسْنَادِهِ، ‏‏‏‏‏‏زَادَ فِيهِ:‏‏‏‏ قَالَ:‏‏‏‏ فَإِنْ بَكَتْ أَوْ سَكَتَتْ ، ‏‏‏‏‏‏زَادَ:‏‏‏‏ بَكَتْ. قَالَ أَبُو دَاوُد:‏‏‏‏ وَلَيْسَ بَكَتْ بِمَحْفُوظٍ، ‏‏‏‏‏‏وَهُوَ وَهْمٌ فِي الْحَدِيثِ، ‏‏‏‏‏‏الْوَهْمُ مِنْ ابْنِ إِدْرِيسَ أَوْ مِنْ مُحَمَّدِ بْنِ الْعَلَاءِ. قَالَ أَبُو دَاوُد:‏‏‏‏ وَرَوَاهُ أَبُو عَمْرٍو ذَكْوَانُ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِنَّ الْبِكْرَ تَسْتَحِي أَنْ تَتَكَلَّمَ قَالَ:‏‏‏‏ سُكَاتُهَا إِقْرَارُهَا ."
      },
      {
        "id": 21174,
        "hadith_number": "2095",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Perundingan Wanita dalam Perkahwinan Anak Perempuan",
        "perawi_melayu": "Abdullah ibn Umar",
        "english_text": "Narrated Abdullah ibn Umar: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Consult women about (the marriage of) their daughters.",
        "malay_translation": "Diriwayatkan daripada Abdullah ibn Umar: Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Rundingkanlah dengan wanita tentang (perkahwinan) anak-anak perempuan mereka.",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، ‏‏‏‏‏‏حَدَّثَنِي الثِّقَةُ، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ آمِرُوا النِّسَاءَ فِي بَنَاتِهِنَّ ."
      },
      {
        "id": 21175,
        "hadith_number": "2096",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hak Pilihan untuk Wanita yang Dikahwinkan Tanpa Kerelaannya",
        "perawi_melayu": "Abdullah ibn Abbas meriwayatkan:",
        "english_text": "Narrated Abdullah ibn Abbas: A virgin came to the Prophet صلی ‌اللہ ‌علیہ ‌وسلم and mentioned that her father had married her against her will, so the Prophet صلی ‌اللہ ‌علیہ ‌وسلم allowed her to exercise her choice.",
        "malay_translation": "Abdullah ibn Abbas meriwayatkan: Seorang gadis perawan datang kepada Nabi ﷺ dan menyebutkan bahawa ayahnya telah menikahkannya tanpa kerelaannya, maka Nabi ﷺ membenarkannya untuk menggunakan hak pilihannya.",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، ‏‏‏‏‏‏عَنْ أَيُّوبَ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏ أَنَّ جَارِيَةً بِكْرًا أَتَتِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَذَكَرَتْ أَنَّ أَبَاهَا زَوَّجَهَا وَهِيَ كَارِهَةٌ، ‏‏‏‏‏‏فَخَيَّرَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ."
      },
      {
        "id": 21176,
        "hadith_number": "2097",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hadis daripada Ikrimah daripada Nabi SAW - Riwayat Mursal yang Makruf",
        "perawi_melayu": "Ikrimah",
        "english_text": "The above tradition has been transmitted by Ikrimah from the Prophet صلی ‌اللہ ‌علیہ ‌وسلم. Abu Dawud said “He (Muhammad bin Ubaid) did not mention the name of Ibn Abbas in the chain of this tradition. The people have also narrated it mursal (without the mention of the name of Ibn Abbas) in a similar way. Its transmission in the mursal form is well known.",
        "malay_translation": "Hadis di atas telah diriwayatkan oleh Ikrimah daripada Nabi صلی ‌اللہ ‌علیہ ‌وسلم. Abu Dawud berkata, “Dia (Muhammad bin Ubaid) tidak menyebut nama Ibn Abbas dalam sanad hadis ini. Orang ramai juga meriwayatkannya secara mursal (tanpa menyebut nama Ibn Abbas) dengan cara yang serupa. Penyampaiannya dalam bentuk mursal adalah terkenal.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، ‏‏‏‏‏‏عَنْ أَيُّوبَ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏بِهَذَا الْحَدِيثِ. قَالَ أَبُو دَاوُد:‏‏‏‏ لَمْ يَذْكُرْ ابْنَ عَبَّاسٍ، ‏‏‏‏‏‏وَكَذَلِكَ رَوَاهُ النَّاسُ مُرْسَلًا مَعْرُوفٌ."
      },
      {
        "id": 21177,
        "hadith_number": "2098",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hak Wanita Janda dan Dara dalam Perkahwinan",
        "perawi_melayu": "Diriwayatkan daripada Ibn Abbas RA, Rasulullah SAW bersabda",
        "english_text": "Ibn Abbas reported the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم as saying “A woman without a husband has more right to her person than her guardian and a virgin’s permission must be asked, her permission being her silence. These are the words of Al Qanabi.",
        "malay_translation": "Ibn Abbas meriwayatkan bahawa Rasulullah SAW bersabda, “Seorang wanita yang tidak mempunyai suami (janda) lebih berhak ke atas dirinya daripada walinya, dan seorang anak dara perlu diminta izinnya, dan izinnya adalah diamnya.” Ini adalah lafaz Al Qanabi.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، ‏‏‏‏‏‏وَعَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ أَخْبَرَنَا مَالِكٌ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ، ‏‏‏‏‏‏عَنْ نَافِعِ بْنِ جُبَيْرٍ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْأَيِّمُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا، ‏‏‏‏‏‏وَالْبِكْرُ تُسْتَأْذَنُ فِي نَفْسِهَا، ‏‏‏‏‏‏وَإِذْنُهَا صُمَاتُهَا . وَهَذَا لَفْظُ الْقَعْنَبِيِّ."
      },
      {
        "id": 21178,
        "hadith_number": "2099",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hak Wanita Janda dan Keizinan Anak Dara dalam Perkahwinan",
        "perawi_melayu": "Diriwayatkan oleh Abd Allaah bin Al Fadl melalui sanadnya",
        "english_text": "The above tradition has been transmitted by Abd Allaah bin Al Fadl through his chain of narrators and with different meaning. The version goes “A woman without a husband has more right to her person than her guardian and the father of a virgin should ask her permission about herself. ” Abu Dawud said “ The word “her father” is not guarded.",
        "malay_translation": "Hadis di atas diriwayatkan oleh Abd Allaah bin Al Fadl melalui sanadnya dengan makna yang berbeza. Versi tersebut menyatakan, “Seorang wanita yang tidak mempunyai suami lebih berhak ke atas dirinya daripada walinya, dan bapa seorang anak dara hendaklah meminta izinnya tentang dirinya.” Abu Dawud berkata, “Perkataan ‘bapanya’ tidak terpelihara (yakni, tidak kuat).”",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ زِيَادِ بْنِ سَعْدٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ، ‏‏‏‏‏‏بِإِسْنَادِهِ وَمَعْنَاهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ الثَّيِّبُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا، ‏‏‏‏‏‏وَالْبِكْرُ يَسْتَأْمِرُهَا أَبُوهَا . قَالَ أَبُو دَاوُد:‏‏‏‏ أَبُوهَا لَيْسَ بِمَحْفُوظٍ."
      },
      {
        "id": 21179,
        "hadith_number": "2100",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Perempuan Janda Tidak Perlu Wali, Anak Yatim Perempuan Perlu Dirujuk",
        "perawi_melayu": "Abdullah ibn Abbas RA",
        "english_text": "Narrated Abdullah ibn Abbas: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: A guardian has no concern with a woman previously married and has no husband, and an orphan girl (i. e. virgin) must be consulted, her silence being her acceptance.",
        "malay_translation": "Diriwayatkan daripada Abdullah ibn Abbas RA: Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Seorang wali tidak mempunyai urusan dengan seorang wanita yang pernah berkahwin dan tidak mempunyai suami, dan seorang anak yatim perempuan (iaitu, perawan) mesti dirujuk, diamnya adalah penerimaannya.",
        "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَخْبَرَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنْ صَالِحِ بْنِ كَيْسَانَ، ‏‏‏‏‏‏عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، ‏‏‏‏‏‏عَنْابْنِ عَبَّاسٍ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَيْسَ لِلْوَلِيِّ مَعَ الثَّيِّبِ أَمْرٌ، ‏‏‏‏‏‏وَالْيَتِيمَةُ تُسْتَأْمَرُ، ‏‏‏‏‏‏وَصَمْتُهَا إِقْرَارُهَا ."
      },
      {
        "id": 21180,
        "hadith_number": "2101",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Pembatalan Perkahwinan Atas Bantahan Isteri yang Janda",
        "perawi_melayu": "Khansa binti Khidham al-Ansariyyah meriwayatkan bahawa ketika ayahnya mengahwinkannya (semasa dia seorang janda) dan dia tidak menyukainya, dia pergi kepada Rasulullah ﷺ dan menyebutkan hal itu kepada baginda. Baginda (Nabi) membatalkan perkahwinannya.",
        "english_text": "Khansa daughter of Khidham al-Ansariyyah reports that when her father married her when she had previously been married and she disapproved of that she went to the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم and mentioned it to him. He (the Prophet) revoked her marriage.",
        "malay_translation": "Khansa binti Khidham al-Ansariyyah meriwayatkan bahawa ketika ayahnya mengahwinkannya (semasa dia seorang janda) dan dia tidak menyukainya, dia pergi kepada Rasulullah ﷺ dan menyebutkan hal itu kepada baginda. Baginda (Nabi) membatalkan perkahwinannya.",
        "arabic_text": "حَدَّثَنَا الْقَعْنَبِيُّ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏وَمُجَمِّعٍ ابْنَيْ يَزِيدَ الأَنْصَارِيَّيْنِ، ‏‏‏‏‏‏عَنْ خَنْسَاءَ بِنْتِ خِذَامٍ الْأَنْصَارِيَّةِ، ‏‏‏‏‏‏أَنَّ أَبَاهَا زَوَّجَهَا وَهِيَ ثَيِّبٌ فَكَرِهَتْ ذَلِكَ، ‏‏‏‏‏‏فَجَاءَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَتْ ذَلِكَ لَهُ فَرَدَّ نِكَاحَهَا ."
      },
      {
        "id": 21181,
        "hadith_number": "2102",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Keutamaan Berbekam dan Anjuran Menikahkan Abu Hind",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah R.A.: Abu Hind telah membekam Nabi Muhammad SAW di bahagian tengah kepala Baginda. Nabi Muhammad SAW bersabda: Wahai Bani Bayadah, nikahkanlah Abu Hind (dengan anak perempuan kamu), dan mintalah dia menikahkan (anak perempuannya) dengan kamu. Baginda bersabda: Sebaik-baik perkara yang kamu gunakan untuk berubat adalah berbekam.",
        "english_text": "Narrated Abu Hurairah: Abu Hind cupped the Prophet صلی ‌اللہ ‌علیہ ‌وسلم in the middle of his head. The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Banu Bayadah, marry Abu Hind (to your daughter), and ask him to marry (his daughter) to you. He said: The best thing by which you treat yourself is cupping.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah R.A.: Abu Hind telah membekam Nabi Muhammad SAW di bahagian tengah kepala Baginda. Nabi Muhammad SAW bersabda: Wahai Bani Bayadah, nikahkanlah Abu Hind (dengan anak perempuan kamu), dan mintalah dia menikahkan (anak perempuannya) dengan kamu. Baginda bersabda: Sebaik-baik perkara yang kamu gunakan untuk berubat adalah berbekam.",
        "arabic_text": "حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ غِيَاثٍ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادٌ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنَّ أَبَا هِنْدٍ حَجَمَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْيَافُوخِ، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَا بَنِي بَيَاضَةَ، ‏‏‏‏‏‏أَنْكِحُوا أَبَا هِنْدٍ وَأَنْكِحُوا إِلَيْهِ ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ وَإِنْ كَانَ فِي شَيْءٍ مِمَّا تَدَاوُونَ بِهِ خَيْرٌ، ‏‏‏‏‏‏فَالْحِجَامَةُ ."
      },
      {
        "id": 21182,
        "hadith_number": "2103",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Kisah Maymunah dan Tawaran Kahwin dengan Imbalan Lembing",
        "perawi_melayu": "Maymunah binti Kardam",
        "english_text": "Narrated Maymunah, daughter of Kardam: I went out along with my father during the hajj performed by the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم. I saw the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم. My father came near him; he was riding his she-camel. He stopped there and listened to him. He had a whip like the whip of the teachers. I heard the Bedouin and the people saying: Keep away from the whip. My father came up to him. He caught hold of his foot and acknowledged him (his Prophethood). He stopped and listened to him. He then said: I participated in the army of Athran (in the pre-Islamic days). The narrator, Ibn al-Muthanna, said: Army of Gathran. Tariq ibn al-Muraqqa' said: Who will give me a lance and get a reward? I asked: What is its reward? He replied: I shall marry him to my first daughter born to me. So I gave him my lance and then disappeared from him till I knew that a daughter was born to him and she came of age. I then came to him and said: Send my wife to me. He swore that he would not do that until I fixed a dower afresh other than that agreed between me and him, and I swore that I should not give him the dower other than that I had given him before. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said: How old is she now? He said: She has grown old. He said: I think you should leave her. He said: This put awe and fear into me, and I looked at the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم. When he felt this in me, he said: You will not be sinful, nor will your companion be sinful. Abu Dawud said: Qatir means old age.",
        "malay_translation": "Diriwayatkan daripada Maymunah binti Kardam: Aku keluar bersama ayahku semasa haji yang dilakukan oleh Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم. Aku melihat Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم. Ayahku mendekati baginda; dia menunggang unta betinanya. Dia berhenti di situ dan mendengar baginda. Dia mempunyai cemeti seperti cemeti para guru. Aku mendengar orang Badwi dan orang ramai berkata: Jauhi cemeti itu. Ayahku menghampirinya. Dia memegang kaki baginda dan mengakui baginda (kenabiannya). Dia berhenti dan mendengar baginda. Kemudian dia berkata: Aku menyertai tentera Athran (pada zaman pra-Islam). Perawi, Ibn al-Muthanna, berkata: Tentera Gathran. Tariq ibn al-Muraqqa' berkata: Siapa yang akan memberi aku lembing dan mendapat ganjaran? Aku bertanya: Apakah ganjarannya? Dia menjawab: Aku akan mengahwinkannya dengan anak perempuan pertamaku yang lahir. Jadi aku memberinya lembingku dan kemudian menghilang daripadanya sehingga aku tahu bahawa seorang anak perempuan telah dilahirkan kepadanya dan dia telah mencapai usia baligh. Kemudian aku datang kepadanya dan berkata: Hantarkan isteriku kepadaku. Dia bersumpah bahawa dia tidak akan melakukan itu sehingga aku menetapkan mas kahwin yang baru selain daripada yang dipersetujui antara aku dan dia, dan aku bersumpah bahawa aku tidak akan memberinya mas kahwin selain daripada yang telah aku berikan kepadanya sebelum ini. Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Berapa umur dia sekarang? Dia berkata: Dia sudah tua. Baginda bersabda: Aku rasa kamu patut meninggalkannya. Dia berkata: Ini menyebabkan aku kagum dan takut, dan aku memandang Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم. Apabila baginda merasakan ini dalam diriku, baginda bersabda: Kamu tidak akan berdosa, dan sahabatmu juga tidak akan berdosa. Abu Dawud berkata: Qatir bermaksud usia tua.",
        "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏وَمُحَمَّدُ بْنُ الْمُثَنَّى الْمَعْنَى، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، ‏‏‏‏‏‏أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ بْنِ مِقْسَمٍ الثَّقَفِيُّ مِنْ أَهْلِ الطَّائِفِ، ‏‏‏‏‏‏حَدَّثَتْنِي سَارَةُ بِنْتُ مِقْسَمٍ، ‏‏‏‏‏‏أَنَّهَا سَمِعَتْ مَيْمُونَةَ بِنْتَ كَرْدَمٍ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ خَرَجْتُ مَعَ أَبِي فِي حَجَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَدَنَا إِلَيْهِ أَبِي وَهُوَ عَلَى نَاقَةٍ لَهُ، ‏‏‏‏‏‏فَوَقَفَ لَهُ وَاسْتَمَعَ مِنْهُ وَمَعَهُ دِرَّةٌ كَدِرَّةِ الْكُتَّابِ، ‏‏‏‏‏‏فَسَمِعْتُ الْأَعْرَابَ وَالنَّاسَ وَهُمْ يَقُولُونَ:‏‏‏‏ الطَّبْطَبِيَّةَ الطَّبْطَبِيَّةَ الطَّبْطَبِيَّةَ، ‏‏‏‏‏‏فَدَنَا إِلَيْهِ أَبِي فَأَخَذَ بِقَدَمِهِ فَأَقَرَّ لَهُ وَوَقَفَ عَلَيْهِ وَاسْتَمَعَ مِنْهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنِّي حَضَرْتُ جَيْشَ عِثْرَانَ، ‏‏‏‏‏‏قَالَ ابْنُ الْمُثَنَّى:‏‏‏‏ جَيْشَ غِثْرَانَ، ‏‏‏‏‏‏فَقَالَ طَارِقُ بْنُ الْمُرَقَّعِ:‏‏‏‏ مَنْ يُعْطِينِي رُمْحًا بِثَوَابِهِ ؟ قُلْتُ:‏‏‏‏ وَمَا ثَوَابُهُ ؟ قَالَ:‏‏‏‏ أُزَوِّجُهُ أَوَّلَ بِنْتٍ تَكُونُ لِي، ‏‏‏‏‏‏فَأَعْطَيْتُهُ رُمْحِي ثُمَّ غِبْتُ عَنْهُ حَتَّى عَلِمْتُ أَنَّهُ قَدْ وُلِدَ لَهُ جَارِيَةٌ وَبَلَغَتْ ثُمَّ جِئْتُهُ، ‏‏‏‏‏‏فَقُلْتُ لَهُ:‏‏‏‏ أَهْلِي جَهِّزْهُنَّ إِلَيَّ، ‏‏‏‏‏‏فَحَلَفَ أَنْ لَا يَفْعَلَ حَتَّى أُصْدِقَهُ صَدَاقًا جَدِيدًا غَيْرَ الَّذِي كَانَ بَيْنِي وَبَيْنَهُ، ‏‏‏‏‏‏وَحَلَفْتُ لَا أُصْدِقُ غَيْرَ الَّذِي أَعْطَيْتُهُ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ وَبِقَرْنِ أَيِّ النِّسَاءِ هِيَ الْيَوْمَ ؟ قَالَ:‏‏‏‏ قَدْ رَأَتِ الْقَتِيرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَرَى أَنْ تَتْرُكَهَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَرَاعَنِي ذَلِكَ وَنَظَرْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَلَمَّا رَأَى ذَلِكَ مِنِّي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا تَأْثَمُ وَلَا يَأْثَمُ صَاحِبُكَ . قَالَ أَبُو دَاوُد:‏‏‏‏ الْقَتِيرُ الشَّيْبُ."
      },
      {
        "id": 21183,
        "hadith_number": "2104",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Pengorbanan Kasut Sebagai Mahar di Zaman Jahiliyah",
        "perawi_melayu": "Ibrahim bin Maisarah meriwayatkan daripada ibu saudaranya yang meriwayatkan daripada seorang wanita bernama Mussaddaqah (seorang wanita yang benar).",
        "english_text": "Ibrahim bin Maisarah reported from his maternal aunt who reported on the authority of a woman called Mussaddaqah (a truthful woman). She said “In pre Islamic days, when my father participated in a battle the feet of the people burnt due to intense heat. Thereupon a man said “Who gives me his shoes, I shall marry him to my first daughter born to me. My father took off his shoes and there them before him. A girl was thereafter born to him and came of age. ” The narrator then mentioned a similar story. But he did not mention that she had grown old.",
        "malay_translation": "Ibrahim bin Maisarah meriwayatkan daripada ibu saudaranya yang meriwayatkan daripada seorang wanita bernama Mussaddaqah (seorang wanita yang benar). Dia berkata, \"Pada zaman pra-Islam, ketika ayah saya menyertai peperangan, kaki orang ramai terbakar kerana panas yang terik. Lalu seorang lelaki berkata, 'Siapa yang memberi saya kasutnya, saya akan menikahkannya dengan anak perempuan pertama saya yang lahir untuk saya.' Ayah saya menanggalkan kasutnya dan melemparkannya di hadapannya. Seorang gadis kemudian dilahirkan kepadanya dan mencapai usia baligh.\" Perawi kemudian menyebut kisah yang serupa. Tetapi dia tidak menyebut bahawa dia sudah tua.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَخْبَرَنَا ابْنُ جُرَيْجٍ، ‏‏‏‏‏‏أَخْبَرَنِي إِبْرَاهِيمُ بْنُ مَيْسَرَةَ، ‏‏‏‏‏‏أَنَّ خَالَتَهُ أَخْبَرَتْهُ، ‏‏‏‏‏‏عَنِامْرَأَةٍ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ هِيَ مُصَدَّقَةٌ امْرَأَةُ صِدْقٍ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ بَيْنَا أَبِي فِي غَزَاةٍ فِي الْجَاهِلِيَّةِ إِذْ رَمِضُوا، ‏‏‏‏‏‏فَقَالَ رَجُلٌ:‏‏‏‏ مَنْ يُعْطِينِي نَعْلَيْهِ وَأُنْكِحُهُ أَوَّلَ بِنْتٍ تُولَدُ لِي ؟ فَخَلَعَ أَبِي نَعْلَيْهِ، ‏‏‏‏‏‏فَأَلْقَاهُمَا إِلَيْهِ، ‏‏‏‏‏‏فَوُلِدَتْ لَهُ جَارِيَةٌ فَبَلَغَتْ، ‏‏‏‏‏‏وَذَكَرَ نَحْوَهُ، ‏‏‏‏‏‏لَمْ يَذْكُرْ قِصَّةَ الْقَتِيرِ."
      },
      {
        "id": 21184,
        "hadith_number": "2105",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Mahar Rasulullah SAW: Dua Belas Uqiyah dan Nashsh",
        "perawi_melayu": "Abu Salamah",
        "english_text": "Abu Salamah said “I asked Aishah about the dower given by the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم. She said “It was twelve Uqiyahs and a nashsh”. I asked “What is nashsh?” She said it is half an uqiyah.",
        "malay_translation": "Abu Salamah berkata, “Aku bertanya kepada Aisyah tentang mahar yang diberikan oleh Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم. Beliau menjawab, “Maharnya adalah dua belas Uqiyah dan satu nashsh.” Aku bertanya, “Apakah itu nashsh?” Beliau menjawab, “Ia adalah setengah uqiyah.”",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ الْهَادِ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْأَبِي سَلَمَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَأَلْتُ عَائِشَةَ رَضِيَ اللَّهُ عَنْ صَدَاقِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ ثِنْتَا عَشْرَةَ أُوقِيَّةً وَنَشٌّ ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ وَمَا نَشٌّ ؟ قَالَتْ:‏‏‏‏ نِصْفُ أُوقِيَّةٍ."
      },
      {
        "id": 21185,
        "hadith_number": "2106",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Jangan Melampau dalam Memberi Mahar kepada Wanita",
        "perawi_melayu": "Abul Ajfa as-Sulami berkata",
        "english_text": "Abul Ajfa as-Sulami said: Umar (Allah be pleased with him) delivered a speech to us and said: Do not go to extremes in giving women their dower, for if it represented honour in this world and piety in Allah's sight, the one of you most entitled to do so would have been the Prophet صلی ‌اللہ ‌علیہ ‌وسلم. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم did not marry any of his wives or gave any of his daughters in marriage for more than twelve uqiyahs.",
        "malay_translation": "Abul Ajfa as-Sulami berkata: Umar (semoga Allah meredhainya) menyampaikan ucapan kepada kami dan berkata: Janganlah kamu melampau dalam memberikan mahar kepada wanita, kerana jika ia melambangkan kemuliaan di dunia ini dan ketakwaan di sisi Allah, maka orang yang paling berhak untuk melakukannya adalah Nabi صلی ‌اللہ ‌علیہ ‌وسلم. Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم tidak pernah menikahi seorang pun isterinya atau memberikan puterinya dalam pernikahan dengan mahar lebih dari dua belas uqiyah.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، ‏‏‏‏‏‏عَنْ أَيُّوبَ، ‏‏‏‏‏‏عَنْ مُحَمَّدٍ، ‏‏‏‏‏‏عَنْ أَبِي الْعَجْفَاءِ السُّلَمِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ خَطَبَنَا عُمَرُرَحِمَهُ اللَّهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَلَا لَا تُغَالُوا بِصُدُقِ النِّسَاءِ، ‏‏‏‏‏‏فَإِنَّهَا لَوْ كَانَتْ مَكْرُمَةً فِي الدُّنْيَا أَوْ تَقْوَى عِنْدَ اللَّهِ لَكَانَ أَوْلَاكُمْ بِهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏مَا أَصْدَقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ امْرَأَةً مِنْ نِسَائِهِ، ‏‏‏‏‏‏وَلَا أُصْدِقَتِ امْرَأَةٌ مِنْ بَنَاتِهِ أَكْثَرَ مِنْ ثِنْتَيْ عَشْرَةَ أُوقِيَّةً ."
      },
      {
        "id": 21186,
        "hadith_number": "2107",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Perkahwinan Ummu Habibah dengan Nabi Muhammad SAW melalui Najasyi",
        "perawi_melayu": "Urwah meriwayatkan daripada Ummu Habibah RA",
        "english_text": "Urwah reported on the authority of Umm Habibah that she was married to Abdullah ibn Jahsh who died in Abyssinia, so the Negus married her to the Prophet صلی ‌اللہ ‌علیہ ‌وسلم giving her on his behalf a dower of four thousand (dirhams). He sent her to the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم with Shurahbil ibn Hasanah. Abu Dawud said: Hasanah is his mother.",
        "malay_translation": "Urwah meriwayatkan daripada Ummu Habibah RA bahawa beliau telah berkahwin dengan Abdullah ibn Jahsh yang meninggal dunia di Habsyah. Kemudian, Najasyi (Negus) telah menikahkan beliau dengan Nabi Muhammad SAW dan memberikan mahar bagi pihaknya sebanyak empat ribu (dirham). Beliau menghantar Ummu Habibah kepada Rasulullah SAW bersama Shurahbil ibn Hasanah. Abu Dawud berkata: Hasanah adalah ibunya.",
        "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ أَبِي يَعْقُوبَ الثَّقَفِيُّ، ‏‏‏‏‏‏حَدَّثَنَا مُعَلَّى بْنُ مَنْصُورٍ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ الْمُبَارَكِ، ‏‏‏‏‏‏حَدَّثَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنْ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏عَنْ أُمِّ حَبِيبَةَ، ‏‏‏‏‏‏أَنَّهَا كَانَتْ تَحْتَ عُبَيْدِ اللَّهِ بْنِ جَحْشٍ فَمَاتَ بِأَرْضِ الْحَبَشَةِ فَزَوَّجَهَا النَّجَاشِيُّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَمْهَرَهَا عَنْهُ أَرْبَعَةَ آلَافٍ، ‏‏‏‏‏‏وَبَعَثَ بِهَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَ شُرَحْبِيلَ ابْنِ حَسَنَةَ . قَالَ أَبُو دَاوُد:‏‏‏‏ حَسَنَةُ هِيَ أُمُّهُ."
      },
      {
        "id": 21187,
        "hadith_number": "2108",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Pernikahan Umm Habibah dengan Rasulullah SAW melalui Najasyi dan Mas Kahwin",
        "perawi_melayu": "Az-Zuhri",
        "english_text": "Az-Zuhri said: The Negus married Umm Habibah daughter of Abu Sufyan to the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم for a dower of four thousand dirhams. He wrote it to the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم who accepted it.",
        "malay_translation": "Az-Zuhri berkata: An-Najasyi menikahkan Umm Habibah binti Abu Sufyan dengan Rasulullah SAW dengan mas kahwin sebanyak empat ribu dirham. Dia menulis surat mengenai perkara itu kepada Rasulullah SAW dan baginda menerimanya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ بَزِيعٍ، ‏‏‏‏‏‏حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ بْنِ شَقِيقٍ، ‏‏‏‏‏‏عَنْ ابْنِ الْمُبَارَكِ، ‏‏‏‏‏‏عَنْ يُونُسَ، ‏‏‏‏‏‏عَنْ الزُّهْرِيِّ، ‏‏‏‏‏‏ أَنَّ النَّجَاشِيَّ زَوَّجَ أُمَّ حَبِيبَةَ بِنْتَ أَبِي سُفْيَانَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى صَدَاقِ أَرْبَعَةِ آلَافِ دِرْهَمٍ، ‏‏‏‏‏‏وَكَتَبَ بِذَلِكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَبِلَ ."
      },
      {
        "id": 21188,
        "hadith_number": "2109",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Anjuran Mengadakan Walimah Walaupun Sederhana",
        "perawi_melayu": "Anas meriwayatkan",
        "english_text": "Narrated Anas: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم saw the trace of yellow on Abdur-Rahman bin Awf. The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: What is this ? He replied: Messenger of Allah, I have married a woman. He asked: How much dower did you give her ? He said: A nawat weight of gold. He said: Hold a wedding feast, even if only with a sheep.",
        "malay_translation": "Anas meriwayatkan: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم melihat kesan kuning pada Abdur-Rahman bin Awf. Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Apa ini? Dia menjawab: Wahai Rasulullah, saya telah menikahi seorang wanita. Baginda bertanya: Berapa banyak mahar yang kamu berikan kepadanya? Dia berkata: Seberat *nawat* emas. Baginda bersabda: Adakanlah walimah, walaupun hanya dengan seekor kambing.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادٌ، ‏‏‏‏‏‏عَنْ ثَابِتٍ الْبُنَانِيِّ، ‏‏‏‏‏‏وَحُمَيْدٍ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ وَعَلَيْهِ رَدْعُ زَعْفَرَانٍ، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَهْيَمْ ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏تَزَوَّجْتُ امْرَأَةً، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَا أَصْدَقْتَهَا ؟ قَالَ:‏‏‏‏ وَزْنَ نَوَاةٍ مِنْ ذَهَبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَوْلِمْ وَلَوْ بِشَاةٍ . قال أَبُو دَاوُدَ:‏‏‏‏ النَّوَاةُ خَمْسَةُ دَرَاهِمَ، ‏‏‏‏‏‏وَالنَّشُّ عِشْرُونَ، ‏‏‏‏‏‏والأوقِيَّةُ أَرْبَعُونَ."
      },
      {
        "id": 21189,
        "hadith_number": "2110",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Mahar: Dua Genggam Tepung atau Kurma Sebagai Maskawin",
        "perawi_melayu": "Jabir ibn Abdullah",
        "english_text": "Narrated Jabir ibn Abdullah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: If anyone gives as a dower to his wife two handfuls of flour or dates he has made her lawful for him. Abu Dawud said: This tradition has been narrated by Abdur Rahman ibn Mahdi, from Salih ibn Ruman, from Abu al-Zubayr on the authority of Jabir as his own statement (not going back to the Prophet). It has also been transmitted by Abu Asim from Salih ibn Ruman, from Abuz Zubayr on the authority of Jabir who said: During the lifetime of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم we used to contract temporary marriage for a handful of grain. Abu Dawud said: This tradition has also been transmitted by Ibn Juraij from Abu al-Zubair on the authority of Jabir similar to the one narrated by Abu Asim.",
        "malay_translation": "Diriwayatkan dari Jabir ibn Abdullah: Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Jika seseorang memberikan sebagai mas kahwin kepada isterinya dua genggam tepung atau kurma, maka dia telah menghalalkannya untuknya. Abu Dawud berkata: Hadis ini diriwayatkan oleh Abdur Rahman ibn Mahdi, dari Salih ibn Ruman, dari Abu al-Zubayr dari Jabir sebagai kenyataannya sendiri (tidak sampai kepada Nabi). Ia juga diriwayatkan oleh Abu Asim dari Salih ibn Ruman, dari Abu al-Zubayr dari Jabir yang berkata: Semasa hayat Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم kami pernah melakukan perkahwinan sementara dengan segenggam bijirin. Abu Dawud berkata: Hadis ini juga diriwayatkan oleh Ibn Juraij dari Abu al-Zubair dari Jabir serupa dengan yang diriwayatkan oleh Abu Asim.",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ جِبْرَائِيلَ الْبَغْدَادِيُّ، ‏‏‏‏‏‏أَخْبَرَنَا يَزِيدُ، ‏‏‏‏‏‏أَخْبَرَنَا مُوسَى بْنُ مُسْلِمِ بْنِ رُومَانَ، ‏‏‏‏‏‏عَنْ أَبِي الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَنْ أَعْطَى فِي صَدَاقِ امْرَأَةٍ مِلْءَ كَفَّيْهِ سَوِيقًا أَوْ تَمْرًا فَقَدِ اسْتَحَلَّ . قَالَ أَبُو دَاوُد:‏‏‏‏ رَوَاهُ عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، ‏‏‏‏‏‏عَنْ صَالِحِ بْنِ رُومَانَ، ‏‏‏‏‏‏عَنْ أَبِي الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ جَابِرٍ مَوْقُوفًا. وَرَوَاهُأَبُو عَاصِمٍ، ‏‏‏‏‏‏عَنْ صَالِحِ بْنِ رُومَانَ، ‏‏‏‏‏‏عَنْ أَبِي الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ جَابِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنَّا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَسْتَمْتِعُ بِالْقُبْضَةِ مِنَ الطَّعَامِ عَلَى مَعْنَى الْمُتْعَةِ. قَالَ أَبُو دَاوُد:‏‏‏‏ رَوَاهُ ابْنُ جُرَيْجٍ، ‏‏‏‏‏‏عَنْ أَبِي الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ جَابِرٍ، ‏‏‏‏‏‏عَلَى مَعْنَى أَبِي عَاصِمٍ."
      },
      {
        "id": 21190,
        "hadith_number": "2111",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Mahar Berupa Ayat Al-Quran",
        "perawi_melayu": "Diriwayatkan daripada Sahl bin Saad al-Saeedi:",
        "english_text": "Narrated Sahl bin Saad al-Saeedi: A woman came to the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم and said: Messenger of Allah, I have offered myself to you. When she stood for a long time, a man got up and said: Messenger of Allah, marry her to me if you have no need for her. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم asked: Have you anything to give her as dower ? He replied: I have nothing by this lower garment of mine. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said: If you give your lower garment, you will sit while you have no lower garment. So look for something else. He said: I do not find anything. He said: Look for something, even though it should be an iron ring. The man sought it but found nothing. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said: Do you know anything from the Quran ? He said: Yes, I know surah so and so, which he named. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said: I have given you her in marriage for the part of the Quran which you know.",
        "malay_translation": "Seorang wanita datang kepada Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم dan berkata: Wahai Rasulullah, aku menawarkan diriku kepadamu. Apabila dia berdiri lama, seorang lelaki bangun dan berkata: Wahai Rasulullah, kahwinkanlah dia denganku jika engkau tidak berhajat kepadanya. Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bertanya: Adakah kamu mempunyai sesuatu untuk diberikan sebagai mahar kepadanya? Dia menjawab: Aku tidak mempunyai apa-apa kecuali kain bawahanku ini. Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Jika kamu memberikan kain bawahanmu, kamu akan duduk tanpa kain bawahan. Oleh itu, carilah sesuatu yang lain. Dia berkata: Aku tidak menjumpai apa-apa. Baginda bersabda: Carilah sesuatu, walaupun sebentuk cincin besi. Lelaki itu mencarinya tetapi tidak menjumpai apa-apa. Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Adakah kamu mengetahui sesuatu daripada Al-Quran? Dia berkata: Ya, aku mengetahui surah ini dan surah itu, yang dia sebutkan namanya. Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Aku telah mengahwinkan kamu dengannya dengan bahagian Al-Quran yang kamu ketahui.",
        "arabic_text": "حَدَّثَنَا الْقَعْنَبِيُّ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ، ‏‏‏‏‏‏عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَاءَتْهُ امْرَأَةٌ، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِنِّي قَدْ وَهَبْتُ نَفْسِي لَكَ، ‏‏‏‏‏‏فَقَامَتْ قِيَامًا طَوِيلًا، ‏‏‏‏‏‏فَقَامَ رَجُلٌ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏زَوِّجْنِيهَا إِنْ لَمْ يَكُنْ لَكَ بِهَا حَاجَةٌ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ هَلْ عِنْدَكَ مِنْ شَيْءٍ تُصْدِقُهَا إِيَّاهُ ؟ فَقَالَ:‏‏‏‏ مَا عِنْدِي إِلَّا إِزَارِي هَذَا، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّكَ إِنْ أَعْطَيْتَهَا إِزَارَكَ جَلَسْتَ وَلَا إِزَارَ لَكَ فَالْتَمِسْ شَيْئًا ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا أَجِدُ شَيْئًا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَالْتَمِسْ وَلَوْ خَاتَمًا مِنْ حَدِيدٍ ، ‏‏‏‏‏‏فَالْتَمَسَ فَلَمْ يَجِدْ شَيْئًا، ‏‏‏‏‏‏فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ فَهَلْ مَعَكَ مِنَ الْقُرْآنِ شَيْءٌ ؟ قَالَ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏سُورَةُ كَذَا وَسُورَةُ كَذَا، ‏‏‏‏‏‏لِسُوَرٍ سَمَّاهَا، ‏‏‏‏‏‏فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ قَدْ زَوَّجْتُكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ ."
      },
      {
        "id": 21191,
        "hadith_number": "2112",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Mahar: Mengajar Isteri Ayat Al-Quran",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "A tradition similar to the one narrated above has also been transmitted by Abu Hurairah through a different chain of narrators. This version does not mention the lower garment and iron ring. He (the Prophet) said: How much do you memorize from Quran? He said: Surat al-Baqarah or the one that follows it. He said: Stand up and teach her twenty verses: she is your wife.",
        "malay_translation": "Hadis yang serupa dengan yang diriwayatkan di atas juga telah disampaikan oleh Abu Hurairah melalui rangkaian perawi yang berbeza. Versi ini tidak menyebut tentang pakaian bawah dan cincin besi. Baginda (Nabi) bersabda: \"Berapa banyak yang kamu hafal dari Al-Quran?\" Dia berkata: \"Surah Al-Baqarah atau surah yang mengikutinya.\" Baginda bersabda: \"Berdirilah dan ajarkan dia dua puluh ayat: dia adalah isterimu.\"",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏حَدَّثَنِي أَبِي حَفْصُ بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ، ‏‏‏‏‏‏عَنْ الْحَجَّاجِ بْنِ الْحَجَّاجِ الْبَاهِلِيِّ، ‏‏‏‏‏‏عَنْ عِسْلٍ، ‏‏‏‏‏‏عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏نَحْوَ هَذِهِ الْقِصَّةِ، ‏‏‏‏‏‏لَمْ يَذْكُرِ الْإِزَارَ وَالْخَاتَمَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا تَحْفَظُ مِنَ الْقُرْآنِ ؟ قَالَ:‏‏‏‏ سُورَةَ الْبَقَرَةِ، ‏‏‏‏‏‏أَوِ الَّتِي تَلِيهَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَقُمْ، ‏‏‏‏‏‏فَعَلِّمْهَا عِشْرِينَ آيَةً وَهِيَ امْرَأَتُكَ ."
      },
      {
        "id": 21192,
        "hadith_number": "2113",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Selepas Rasulullah SAW",
        "perawi_melayu": "Makhul",
        "english_text": "Makhul has also transmitted a tradition like the one narrated by Sahl (b. Saad al-Saeedi). Makhul used to say: This is not lawful for anyone after the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم.",
        "malay_translation": "Makhul juga meriwayatkan hadis seperti yang diriwayatkan oleh Sahl bin Saad al-Saeedi. Makhul berkata: Ini tidak halal bagi sesiapa pun selepas Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم.",
        "arabic_text": "حَدَّثَنَا هَارُونُ بْنُ زَيْدِ بْنِ أَبِي الزَّرْقَاءِ، ‏‏‏‏‏‏حَدَّثَنَا أَبِي،‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ رَاشِدٍ، ‏‏‏‏‏‏عَنْ مَكْحُولٍ، ‏‏‏‏‏‏نَحْوَ خَبَرِ سَهْلٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَكَانَ مَكْحُولٌ يَقُولُ:‏‏‏‏ لَيْسَ ذَلِكَ لِأَحَدٍ بَعْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 21193,
        "hadith_number": "2114",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukum Wanita yang Meninggal Dunia Suaminya Sebelum Ditetapkan Mahar dan Dicampuri",
        "perawi_melayu": "Diriwayatkan daripada Abdullah ibn Mas'ud: Masruq berkata berdasarkan kuasa Abdullah ibn Mas'ud: Abdullah (ibn Mas'ud) ditanya tentang seorang lelaki yang berkahwin dengan seorang wanita tanpa bersetubuh dengannya atau menetapkan sebarang mas kahwin untuknya sehingga dia meninggal dunia. Ibn Mas'ud berkata: Dia harus menerima mas kahwin penuh (seperti yang diberikan kepada wanita dari kelasnya), menjalani tempoh menunggu ('Iddah), dan mendapat bahagian warisannya. Kemudian Maqil ibn Sinan berkata: Saya mendengar Rasulullah ﷺ memberikan keputusan yang sama mengenai Birwa anak perempuan Washiq (seperti keputusan yang telah anda berikan).",
        "english_text": "Narrated Abdullah ibn Masud: Masruq said on the authority of Abdullah ibn Masud: Abdullah (ibn Masud ) was asked about a man who had married a woman without cohabiting with her or fixing any dower for her till he died. Ibn Masud said: She should receive the full dower (as given to women of her class), observe the waiting period ('Iddah), and have her share of inheritance. Thereupon Maqil ibn Sinan said: I heard the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم giving the same decision regarding Birwa daughter of Washiq (as the decision you have given).",
        "malay_translation": "Diriwayatkan daripada Abdullah ibn Mas'ud: Masruq meriwayatkan daripada Abdullah ibn Mas'ud: Abdullah (ibn Mas'ud) ditanya tentang seorang lelaki yang telah berkahwin dengan seorang wanita tetapi belum melakukan hubungan suami isteri dan belum menetapkan mahar (mas kahwin) sehingga lelaki itu meninggal dunia. Ibn Mas'ud menjawab: Wanita itu berhak menerima mahar penuh (seperti yang diberikan kepada wanita yang setaraf dengannya), wajib menjalani tempoh 'Iddah, dan berhak mendapat bahagian daripada harta pusaka. Kemudian Maqil ibn Sinan berkata: Saya mendengar Rasulullah ﷺ membuat keputusan yang sama berkaitan kes Birwa binti Washiq (seperti keputusan yang telah kamu berikan).",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏عَنْ فِرَاسٍ، ‏‏‏‏‏‏عَنْ الشَّعْبِيِّ، ‏‏‏‏‏‏عَنْ مَسْرُوقٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ، ‏‏‏‏‏‏فِي رَجُلٍ تَزَوَّجَ امْرَأَةً فَمَاتَ عَنْهَا وَلَمْ يَدْخُلْ بِهَا وَلَمْ يَفْرِضْ لَهَا الصَّدَاقَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ لَهَا الصَّدَاقُ كَامِلًا وَعَلَيْهَا الْعِدَّةُ وَلَهَا الْمِيرَاثُ، ‏‏‏‏‏‏فَقَالَ مَعْقِلُ بْنُ سِنَانٍ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِهِ فِي بِرْوَعَ بِنْتِ وَاشِقٍ ."
      },
      {
        "id": 21194,
        "hadith_number": "2115",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Riwayat yang Sama daripada Alqamah daripada Abdullah",
        "perawi_melayu": "Alqamah meriwayatkan daripada Abdullah. Uthman (b. Abi Shaibah) meriwayatkan hadis yang serupa.",
        "english_text": "The aforesaid tradition has also been transmitted by Alqamah on the authority of Abdullah. Uthman (b. Abi Shaibah) narrated a similar tradition.",
        "malay_translation": "Hadis yang disebutkan tadi juga diriwayatkan oleh Alqamah daripada Abdullah. Uthman (b. Abi Shaibah) meriwayatkan hadis yang serupa.",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، ‏‏‏‏‏‏وَابْنُ مَهْدِيٍّ، ‏‏‏‏‏‏عَنْ سُفْيَانَ،‏‏‏‏عَنْ مَنْصُورٍ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْعَلْقَمَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ، ‏‏‏‏‏‏وَسَاقَ عُثْمَانُ مِثْلَهُ."
      },
      {
        "id": 21195,
        "hadith_number": "2116",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Keputusan Ibn Mas'ud Selaras dengan Keputusan Rasulullah SAW dalam Kes Perkahwinan",
        "perawi_melayu": "Diriwayatkan daripada Abdullah ibn Mas'ud: Abdullah ibn Utbah ibn Mas'ud berkata: Abdullah ibn Mas'ud diberitahu mengenai kisah seorang lelaki. Orang ramai terus mengunjunginya selama sebulan atau mengunjunginya berkali-kali (perawi tidak pasti).",
        "english_text": "Narrated Abdullah ibn Masud: Abdullah ibn Utbah ibn Masud said: Abdullah ibn Masud was informed of this story of a man. The people continued to visit him for a month or visited him many times (the narrator was not sure). He said: In this matter I hold the opinion that she should receive the type of dower given to women of her class with no diminution or excess, observe the waiting period ('iddah) and have her share of inheritance. If it is erroneous, that is from me and from Satan. Allah and His Messenger are free from its responsibility. Some people from Ashja got up; among them were al-Jarrah and Abu Sinan. They said: Ibn Masud, we bear witness that the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم gave a decision for us regarding Birwa, daughter of Washiq, to the same effect as the decision you have given. Her husband was Hilal ibn Murrah al-Ashjai. Thereupon Abdullah ibn Masud was very pleased when his decision agreed with the decision of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم.",
        "malay_translation": "Dia berkata: Dalam hal ini, saya berpendapat bahawa dia harus menerima jenis mas kahwin yang diberikan kepada wanita dari kelasnya tanpa pengurangan atau berlebihan, menjalani tempoh menunggu ('iddah) dan mendapat bahagian warisannya. Jika ia salah, itu adalah dari saya dan dari Syaitan. Allah dan Rasul-Nya bebas dari tanggungjawabnya. Beberapa orang dari Ashja bangun; di antara mereka adalah al-Jarrah dan Abu Sinan. Mereka berkata: Ibn Mas'ud, kami bersaksi bahawa Rasulullah SAW memberi keputusan untuk kami mengenai Birwa, anak perempuan Washiq, dengan kesan yang sama dengan keputusan yang telah anda berikan. Suaminya adalah Hilal ibn Murrah al-Ashjai. Kemudian Abdullah ibn Mas'ud sangat gembira apabila keputusannya sesuai dengan keputusan Rasulullah SAW.",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، ‏‏‏‏‏‏حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ خِلَاسٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، ‏‏‏‏‏‏أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ أُتِيَ فِي رَجُلٍ بِهَذَا الْخَبَرِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَاخْتَلَفُوا إِلَيْهِ شَهْرًا، ‏‏‏‏‏‏أَوْ قَالَ:‏‏‏‏ مَرَّاتٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَإِنِّي أَقُولُ فِيهَا:‏‏‏‏ إِنَّ لَهَا صَدَاقًا كَصَدَاقِ نِسَائِهَا لَا وَكْسَ وَلَا شَطَطَ، ‏‏‏‏‏‏وَإِنَّ لَهَا الْمِيرَاثَ وَعَلَيْهَا الْعِدَّةُ، ‏‏‏‏‏‏فَإِنْ يَكُ صَوَابًا فَمِنَ اللَّهِ، ‏‏‏‏‏‏وَإِنْ يَكُنْ خَطَأً فَمِنِّي وَمِنَ الشَّيْطَانِ، ‏‏‏‏‏‏وَاللَّهُ وَرَسُولُهُ بَرِيئَانِ، ‏‏‏‏‏‏فَقَامَ نَاسٌ مِنْ أَشْجَعَ فِيهِمْ الْجَرَّاحُ وَأَبُو سِنَانٍ، ‏‏‏‏‏‏فَقَالُوا:‏‏‏‏ يَا ابْنَ مَسْعُودٍ، ‏‏‏‏‏‏نَحْنُ نَشْهَدُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَاهَا فِينَا فِي بِرْوَعَ بِنْتِ وَاشِقٍ، ‏‏‏‏‏‏وَإِنَّ زَوْجَهَا هِلَالُ بْنُ مُرَّةَ الْأَشْجَعِيُّ كَمَا قَضَيْتَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَفَرِحَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ فَرَحًا شَدِيدًا حِينَ وَافَقَ قَضَاؤُهُ قَضَاءَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ."
      },
      {
        "id": 21196,
        "hadith_number": "2117",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Pemberian Mahar Selepas Pernikahan dan Kemudahan dalam Perkahwinan",
        "perawi_melayu": "Diriwayatkan daripada Uqbah ibn Amir: Nabi ﷺ bersabda kepada seorang lelaki: Adakah kamu suka jika saya menikahkan kamu dengan si fulanah? Dia berkata: Ya. Baginda juga bersabda kepada wanita itu: Adakah kamu suka jika saya menikahkan kamu dengan si fulan? Dia berkata: Ya. Kemudian Baginda menikahkan mereka berdua. Lelaki itu melakukan persetubuhan dengan wanita itu, tetapi dia tidak menetapkan mahar untuknya, dan juga tidak memberinya apa-apa. Dia adalah salah seorang yang menyertai ekspedisi ke al-Hudaybiyyah. Satu bahagian ekspedisi ke al-Hudaybiyyah mempunyai bahagian di Khaybar. Apabila dia hampir meninggal dunia, dia berkata: Rasulullah ﷺ telah menikahkan saya dengan si fulanah, dan saya tidak menetapkan mahar untuknya, dan juga tidak memberinya apa-apa. Saya memanggil kamu sebagai saksi bahawa saya telah memberikan bahagian saya di Khaybar sebagai maharnya. Maka dia mengambil bahagian itu dan menjualnya dengan satu lakh (dirham). Abu Daud berkata: Versi Umar bin al-Khattab menambah di permulaan hadis ini, dan versinya lebih sempurna. Dia meriwayatkan Rasulullah ﷺ bersabda: Perkahwinan yang terbaik adalah yang paling mudah. Rasulullah ﷺ bersabda kepada lelaki itu. Perawi kemudian menyampaikan baki hadis itu dengan kesan yang sama. Abu Daud berkata: Saya khuatir hadis ini telah ditambahkan kemudian, kerana perkara itu sebaliknya.",
        "english_text": "Narrated Uqbah ibn Amir: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said to a man: Would you like me to marry you to so-and-so? He said: Yes. He also said to the woman: Would you like me to marry you to so-and-so? She said: Yes. He then married one to the other. The man had sexual intercourse with her, but he did not fix any dower for her, nor did he give anything to her. He was one of those who participated in the expedition to al-Hudaybiyyah. One part of the expedition to al-Hudaybiyyah had a share in Khaybar. When he was nearing his death, he said: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم married me to so-and-so, and I did not fix a dower for her, nor did I give anything to her. I call upon you as witness that I have given my share in Khaybar as her dower. So she took the share and sold it for one lakh (of dirhams). Abu Dawud said: The version of Umar bin al-Khattab added in the beginning of this tradition, and his version is more perfect. He reported the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم as saying: The best marriage is the one that is most easy. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said to the man. The narrator then transmitted the rest of the tradition to the same effect. Abu Dawud said: I am afraid this tradition has been added later on, for the matter is otherwise.",
        "malay_translation": "Diriwayatkan daripada Uqbah ibn Amir: Nabi ﷺ bersabda kepada seorang lelaki: \"Adakah kamu suka jika aku menikahkan kamu dengan si fulanah?\" Dia berkata: \"Ya.\" Baginda juga bersabda kepada wanita itu: \"Adakah kamu suka jika aku menikahkan kamu dengan si fulan?\" Dia berkata: \"Ya.\" Kemudian Baginda menikahkan mereka berdua. Lelaki itu melakukan persetubuhan dengan wanita itu, tetapi dia tidak menetapkan mahar untuknya, dan juga tidak memberinya apa-apa. Dia adalah salah seorang yang menyertai ekspedisi ke al-Hudaybiyyah. Satu bahagian ekspedisi ke al-Hudaybiyyah mempunyai bahagian di Khaybar. Apabila dia hampir meninggal dunia, dia berkata: \"Rasulullah ﷺ telah menikahkan aku dengan si fulanah, dan aku tidak menetapkan mahar untuknya, dan juga tidak memberinya apa-apa. Aku memanggil kamu sebagai saksi bahawa aku telah memberikan bahagianku di Khaybar sebagai maharnya.\" Maka dia mengambil bahagian itu dan menjualnya dengan satu lakh (dirham). Abu Daud berkata: Versi Umar bin al-Khattab menambah di permulaan hadis ini, dan versinya lebih sempurna. Dia meriwayatkan Rasulullah ﷺ bersabda: \"Sebaik-baik perkahwinan adalah yang paling mudah.\" Rasulullah ﷺ bersabda kepada lelaki itu. Perawi kemudian menyampaikan baki hadis itu dengan kesan yang sama. Abu Daud berkata: \"Aku khuatir hadis ini telah ditambahkan kemudian, kerana perkara itu sebaliknya.\"",
        "arabic_text": "حَدَّثَنَا مُحمَّدُ بنُ يَحْيَى بنِ فارِسٍ الذُّهْلِيُّ، ‏‏‏‏‏‏وَمُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏وَعُمَرُ بْنُ الْخَطَّابِ، ‏‏‏‏‏‏قَالَ مُحَمَّدٌ:‏‏‏‏ حَدَّثَنَا أَبُو الْأَصْبَغِ الْجَزَرِيُّ عَبْدُ الْعَزِيزِ بْنُ يَحْيَى، ‏‏‏‏‏‏أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَبِي عَبْدِ الرَّحِيمِ خَالِدِ بْنِ أَبِي يَزِيدَ، ‏‏‏‏‏‏عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ، ‏‏‏‏‏‏عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، ‏‏‏‏‏‏عَنْ مَرْثَدِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ عُقْبَةَ بْنِ عَامِرٍ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِرَجُلٍ:‏‏‏‏ أَتَرْضَى أَنْ أُزَوِّجَكَ فُلَانَةَ ؟ قَالَ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏وَقَالَ لِلْمَرْأَةِ:‏‏‏‏ أَتَرْضَيْنَ أَنْ أُزَوِّجَكِ فُلَانًا ؟ قَالَتْ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏فَزَوَّجَ أَحَدَهُمَا صَاحِبَهُ، ‏‏‏‏‏‏فَدَخَلَ بِهَا الرَّجُلُ وَلَمْ يَفْرِضْ لَهَا صَدَاقًا وَلَمْ يُعْطِهَا شَيْئًا وَكَانَ مِمَّنْ شَهِدَ الْحُدَيْبِيَةَ وَكَانَ مَنْ شَهِدَ الْحُدَيْبِيَةَ لَهُ سَهْمٌ بِخَيْبَرَ، ‏‏‏‏‏‏فَلَمَّا حَضَرَتْهُ الْوَفَاةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَوَّجَنِي فُلَانَةَ وَلَمْ أَفْرِضْ لَهَا صَدَاقًا وَلَمْ أُعْطِهَا شَيْئًا، ‏‏‏‏‏‏وَإِنِّي أُشْهِدُكُمْ أَنِّي أَعْطَيْتُهَا مِنْ صَدَاقِهَا سَهْمِي بِخَيْبَرَ، ‏‏‏‏‏‏فَأَخَذَتْ سَهْمًا فَبَاعَتْهُ بِمِائَةِ أَلْفٍ. قَالَ أَبُو دَاوُد:‏‏‏‏ وَزَادَ عُمَرُ بْنُ الْخَطَّابِ وَحَدِيثُهُ أَتَمُّ فِي أَوَّلِ الْحَدِيثِ، ‏‏‏‏‏‏قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ خَيْرُ النِّكَاحِ أَيْسَرُهُ ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلرَّجُلِ، ‏‏‏‏‏‏ثُمَّ سَاقَ مَعْنَاهُ. قَالَ أَبُو دَاوُد:‏‏‏‏ يُخَافُ أَنْ يَكُونَ هَذَا الْحَدِيثُ مُلْزَقًا، ‏‏‏‏‏‏لِأَنَّ الْأَمْرَ عَلَى غَيْرِ هَذَا."
      },
      {
        "id": 21197,
        "hadith_number": "2118",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Khutbah al-Hajah: Pujian kepada Allah dan Nasihat untuk Bertaqwa",
        "perawi_melayu": "Diriwayatkan daripada Abdullah ibn Mas'ud RA:",
        "english_text": "Narrated Abdullah ibn Masud: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم taught us the address in case of some need: Praise be to Allah from Whom we ask help and pardon, and in Whom we take refuge from the evils within ourselves. He whom Allah guides has no one who can lead him astray, and he whom He leads astray has no one to guide him. I testify that there is no god but Allah, and I testify that Muhammad is His servant and Messenger. You who believe, . . . fear Allah by Whom you ask your mutual rights, and reverence the wombs. Allah has been watching you. . . . you who believe, fear Allah as He should be feared, and die only as Muslims . . . . you who believe, fear Allah as He should be feared, and die only as Muslims . . . . . you who believe, fear Allah and say what is true. He will make your deeds sound, and forgive your sins. He who obeys Allah and His Messenger has achieved a mighty success. The narrator, Muhammad ibn Sulayman, did mention the word inna (verily).",
        "malay_translation": "Diriwayatkan daripada Abdullah ibn Mas'ud RA: Rasulullah SAW mengajarkan kami khutbah ketika ada keperluan: Segala puji bagi Allah yang daripada-Nya kami memohon pertolongan dan ampunan, dan kepada-Nya kami berlindung daripada kejahatan diri kami. Sesiapa yang Allah beri petunjuk, maka tiada siapa yang dapat menyesatkannya, dan sesiapa yang Dia sesatkan, maka tiada siapa yang dapat memberinya petunjuk. Aku bersaksi bahawa tiada tuhan melainkan Allah, dan aku bersaksi bahawa Muhammad adalah hamba dan utusan-Nya. Wahai orang-orang yang beriman,... bertaqwalah kepada Allah yang dengan nama-Nya kamu saling meminta, dan peliharalah hubungan silaturahim. Sesungguhnya Allah sentiasa mengawasi kamu.... wahai orang-orang yang beriman, bertaqwalah kepada Allah dengan sebenar-benar taqwa, dan janganlah kamu mati melainkan dalam keadaan Muslim.... wahai orang-orang yang beriman, bertaqwalah kepada Allah dan katakanlah perkataan yang benar. Nescaya Allah akan memperbaiki amalan-amalan kamu dan mengampuni dosa-dosa kamu. Dan sesiapa yang mentaati Allah dan Rasul-Nya, maka sesungguhnya dia telah mencapai kejayaan yang besar. Perawi, Muhammad ibn Sulayman, ada menyebut perkataan inna (sesungguhnya).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، ‏‏‏‏‏‏أَخْبَرَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاقَ، ‏‏‏‏‏‏عَنْ أَبِي عُبَيْدَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ فِي خُطْبَةِ الْحَاجَةِ فِي النِّكَاحِ وَغَيْرِهِ. ح وحَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ الْمَعْنَى، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنْ إِسْرَائِيلَ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاقَ، ‏‏‏‏‏‏عَنْأَبِي الْأَحْوَصِ، ‏‏‏‏‏‏وَأَبِي عُبَيْدَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ عَلَّمَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُطْبَةَ الْحَاجَةِ أَنْ الْحَمْدُ لِلَّهِ نَسْتَعِينُهُ وَنَسْتَغْفِرُهُ وَنَعُوذُ بِهِ مِنْ شُرُورِ أَنْفُسِنَا، ‏‏‏‏‏‏مَنْ يَهْدِ اللَّهُ فَلَا مُضِلَّ لَهُ وَمَنْ يُضْلِلْ فَلَا هَادِيَ لَهُ، ‏‏‏‏‏‏وَأَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ، ‏‏‏‏‏‏يَأَيُّهَا الَّذِينَ آمَنُوا وَاتَّقُوا اللَّهَ الَّذِي تَسَاءَلُونَ بِهِ وَالأَرْحَامَ إِنَّ اللَّهَ كَانَ عَلَيْكُمْ رَقِيبًا سورة النساء آية 1، ‏‏‏‏‏‏يَأَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ وَلا تَمُوتُنَّ إِلا وَأَنْتُمْ مُسْلِمُونَ سورة آل عمران آية 102، ‏‏‏‏‏‏يَأَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَقُولُوا قَوْلا سَدِيدًا ‏‏‏‏ 70 ‏‏‏‏ يُصْلِحْ لَكُمْ أَعْمَالَكُمْ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَمَنْ يُطِعِ اللَّهَ وَرَسُولَهُ فَقَدْ فَازَ فَوْزًا عَظِيمًا ‏‏‏‏ 71 ‏‏‏‏ سورة الأحزاب آية 70-71 ، ‏‏‏‏‏‏لَمْ يَقُلْ مُحَمَّدُ بْنُ سُلَيْمَانَ أَنْ."
      },
      {
        "id": 21198,
        "hadith_number": "2119",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Ketaatan kepada Allah dan Rasul-Nya adalah Petunjuk yang Benar",
        "perawi_melayu": "Diriwayatkan daripada Abdullah ibn Mas'ud",
        "english_text": "Narrated Abdullah ibn Masud: When the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم recited the tashahhud. . . . He then narrated the same tradition. In this version after the word and His Messenger he added the words: He has sent him in truth as a bearer of glad tidings and a warner before the Hour. He who obeys Allah and His Prophet is on the right path, and he who disobeys them does not harm anyone except himself, and he does not harm Allah to the least.",
        "malay_translation": "Diriwayatkan daripada Abdullah ibn Mas'ud: Apabila Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم membaca tasyahhud... Kemudian beliau meriwayatkan hadis yang sama. Dalam riwayat ini, selepas perkataan dan Rasul-Nya, beliau menambah perkataan: Dia telah mengutusnya dengan kebenaran sebagai pembawa berita gembira dan pemberi amaran sebelum Kiamat. Sesiapa yang taat kepada Allah dan Rasul-Nya, maka sesungguhnya dia berada di jalan yang benar, dan sesiapa yang mengingkari keduanya, maka sesungguhnya dia tidak memudaratkan sesiapa kecuali dirinya sendiri, dan dia tidak memudaratkan Allah sedikit pun.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو عَاصِمٍ، ‏‏‏‏‏‏حَدَّثَنَا عِمْرَانُ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ رَبِّهِ، ‏‏‏‏‏‏عَنْ أَبِي عِيَاضٍ، ‏‏‏‏‏‏عَنْ ابْنِ مَسْعُودٍ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا تَشَهَّدَ ، ‏‏‏‏‏‏ذَكَرَ نَحْوَهُ، ‏‏‏‏‏‏وَقَالَ بَعْدَ قَوْلِهِ:‏‏‏‏ وَرَسُولُهُ أَرْسَلَهُ بِالْحَقِّ بَشِيرًا وَنَذِيرًا بَيْنَ يَدَيِ السَّاعَةِ، ‏‏‏‏‏‏مَنْ يُطِعِ اللَّهَ وَرَسُولَهُ فَقَدْ رَشَدَ، ‏‏‏‏‏‏وَمَنْ يَعْصِهِمَا فَإِنَّهُ لَا يَضُرُّ إِلَّا نَفْسَهُ وَلَا يَضُرُّ اللَّهَ شَيْئًا ."
      },
      {
        "id": 21199,
        "hadith_number": "2120",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Pernikahan Tanpa Bacaan Tasyahhud",
        "perawi_melayu": "Diriwayatkan daripada Ismail bin Ibrahim: Daripada seorang lelaki daripada Banu Sulaim: Aku meminta Nabi ﷺ untuk menikahkan Umamah binti Abd al-Muttalib denganku. Lalu Baginda menikahkan dia denganku tanpa membaca tasyahhud (iaitu khutbah untuk pernikahan).",
        "english_text": "Narrated Ismail bin Ibrahim: On the authority of a man from Banu Sulaim: I asked the Prophet صلی ‌اللہ ‌علیہ ‌وسلم to marry Umamah daughter of Abd al-Muttalib to me. So he married her to me without reciting the tashahhud (i. e. the sermon for marriage).",
        "malay_translation": "Diriwayatkan oleh Ismail bin Ibrahim: Daripada seorang lelaki dari Banu Sulaim: Aku meminta Nabi ﷺ untuk menikahkan Umamah binti Abd al-Muttalib denganku. Maka Baginda menikahkan aku dengannya tanpa membaca tasyahhud (yakni khutbah untuk pernikahan).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا بَدَلُ بْنُ الْمُحَبَّرِ، ‏‏‏‏‏‏أَخْبَرَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ الْعَلَاءِ ابْنَ أَخِي شُعَيْبٍ الرَّازِيِّ، ‏‏‏‏‏‏عَنْ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ رَجُلٍ مِنْ بَنِي سُلَيْمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ خَطَبْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُمَامَةَ بِنْتَ عَبْدِ الْمُطَّلِبِ فَأَنْكَحَنِي مِنْ غَيْرِ أَنْ يَتَشَهَّدَ ."
      },
      {
        "id": 21200,
        "hadith_number": "2121",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Perkahwinan Rasulullah SAW dengan Aisyah RA",
        "perawi_melayu": "Diriwayatkan daripada Aisyah RA:",
        "english_text": "Narrated Aishah: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم married me when I was seven years old. The narrator Sulaiman said: or Six years. He had intercourse with me when I was nine years old.",
        "malay_translation": "Diriwayatkan daripada Aisyah RA: Rasulullah SAW menikahi saya ketika saya berumur tujuh tahun. Perawi Sulaiman berkata: atau enam tahun. Baginda bergaul dengan saya ketika saya berumur sembilan tahun.",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، ‏‏‏‏‏‏وَأَبُو كَامِلٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ تَزَوَّجَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا بِنْتُ سَبْعٍ، ‏‏‏‏‏‏قَالَ سُلَيْمَانُ:‏‏‏‏ أَوْ سِتٍّ. وَدَخَلَ بِي وَأَنَا بِنْتُ تِسْعٍ ."
      },
      {
        "id": 21201,
        "hadith_number": "2122",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Tempoh Tinggal Rasulullah SAW Bersama Umm Salamah RA Setelah Berkahwin",
        "perawi_melayu": "Abd al-Malik bin Abi Bakr meriwayatkan daripada bapanya, daripada Umm Salamah RA:",
        "english_text": "Abd al-Malik bin Abi Bakr reported from his father on the authority of Umm Salamah: When the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم married Umm Salamah, he stayed with her three night, and said: Your people (i. e. clan) are not being humbled for you in my estimation. If you wish I shall stay with you seven nights ; and if I stay you seven nights, I shall stay with my other wives seven nights.",
        "malay_translation": "Abd al-Malik bin Abi Bakr meriwayatkan daripada bapanya, daripada Umm Salamah RA: Apabila Rasulullah SAW berkahwin dengan Umm Salamah, Baginda tinggal bersamanya selama tiga malam, dan bersabda: 'Kaummu tidak direndahkan kerana kamu pada pandanganku. Jika kamu mahu, aku akan tinggal bersamamu selama tujuh malam; dan jika aku tinggal bersamamu selama tujuh malam, aku akan tinggal bersama isteri-isteriku yang lain selama tujuh malam.'",
        "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرٍ، ‏‏‏‏‏‏عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي بَكْرٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أُمِّ سَلَمَةَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا تَزَوَّجَ أُمَّ سَلَمَةَ أَقَامَ عِنْدَهَا ثَلَاثًا، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ لَيْسَ بِكِ عَلَى أَهْلِكِ هَوَانٌ، ‏‏‏‏‏‏إِنْ شِئْتِ سَبَّعْتُ لَكِ وَإِنْ سَبَّعْتُ لَكِ سَبَّعْتُ لِنِسَائِي ."
      },
      {
        "id": 21202,
        "hadith_number": "2123",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Rasulullah SAW Menetap Bersama Safiyyah Setelah Menikahinya",
        "perawi_melayu": "Diriwayatkan daripada Anas bin Malik RA:",
        "english_text": "Narrated Anas bin Malik: When the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم married Safiyyah, he stayed with her three nights. The narrator Uthman added: She was non virgin (previously married). He said: This tradition has been narrated to me by Hushaim, reported by Humaid, and transmitted by Anas.",
        "malay_translation": "Diriwayatkan daripada Anas bin Malik RA: Ketika Rasulullah SAW menikahi Safiyyah, baginda menetap bersamanya selama tiga malam. Perawi Uthman menambahkan: Beliau (Safiyyah) adalah seorang janda (pernah berkahwin sebelumnya). Beliau berkata: Hadis ini telah diriwayatkan kepadaku oleh Hushaim, dilaporkan oleh Humaid, dan disampaikan oleh Anas.",
        "arabic_text": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ، ‏‏‏‏‏‏وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏عَنْ هُشَيْمٍ، ‏‏‏‏‏‏عَنْ حُمَيْدٍ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَمَّا أَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَفِيَّةَ، ‏‏‏‏‏‏أَقَامَ عِنْدَهَا ثَلَاثًا . زَادَ عُثْمَانُ:‏‏‏‏ وَكَانَتْ ثَيِّبًا . وقَالَ:‏‏‏‏ حَدَّثَنِي هُشَيْمٌ، ‏‏‏‏‏‏أَخْبَرَنَا حُمَيْدٌ، ‏‏‏‏‏‏أَخْبَرَنَا أَنَسٌ."
      },
      {
        "id": 21203,
        "hadith_number": "2124",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Tempoh Bermalam Bersama Isteri Baharu (Gadis dan Janda)",
        "perawi_melayu": "Anas bin Malik RA",
        "english_text": "Narrated Anas bin Malik: When a man who has a wife married a virgin he should stay with her seven nights ; if he marries to a woman who has been previously married he should stay with her three nights. (The narrator said: ) If I say that he (Anas) narrated this tradition from the Prophet صلی ‌اللہ ‌علیہ ‌وسلم I shall be true. But he said: The Sunnah is so-and-so.",
        "malay_translation": "Diriwayatkan daripada Anas bin Malik RA: Apabila seorang lelaki yang sudah beristeri berkahwin dengan seorang gadis, dia hendaklah bermalam bersamanya selama tujuh malam; dan jika dia berkahwin dengan seorang wanita yang pernah berkahwin sebelum ini (janda), dia hendaklah bermalam bersamanya selama tiga malam. (Perawi berkata:) Jika saya katakan bahawa beliau (Anas) meriwayatkan hadis ini daripada Nabi ﷺ, nescaya benarlah saya. Tetapi beliau berkata: Sunnahnya adalah sedemikian.",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا هُشَيْمٌ، ‏‏‏‏‏‏وَإِسْمَاعِيلُ ابْنُ عُلَيَّةَ، ‏‏‏‏‏‏عَنْ خَالِدٍ الْحَذَّاءِ، ‏‏‏‏‏‏عَنْ أَبِي قِلَابَةَ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِذَا تَزَوَّجَ الْبِكْرَ عَلَى الثَّيِّبِ أَقَامَ عِنْدَهَا سَبْعًا، ‏‏‏‏‏‏وَإِذَا تَزَوَّجَ الثَّيِّبَ أَقَامَ عِنْدَهَا ثَلَاثًا ، ‏‏‏‏‏‏وَلَوْ قُلْتُ:‏‏‏‏ إِنَّهُ رَفَعَهُ لَصَدَقْتُ، ‏‏‏‏‏‏وَلَكِنَّهُ قَالَ:‏‏‏‏ السُّنَّةُ كَذَلِكَ ."
      },
      {
        "id": 21204,
        "hadith_number": "2125",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Mahar Perkahwinan Ali dan Fatimah",
        "perawi_melayu": "Diriwayatkan daripada Abdullah ibn Abbas RA",
        "english_text": "Narrated Abdullah ibn Abbas: When Ali married Fatimah, the Prophet صلی ‌اللہ ‌علیہ ‌وسلم said to him: Give her something. He said: I have nothing with me. He said: Where is your Hutamiyyah (coat of mail).",
        "malay_translation": "Diriwayatkan daripada Abdullah ibn Abbas RA: Ketika Ali RA menikahi Fatimah RA, Nabi Muhammad SAW bersabda kepadanya: Berikanlah sesuatu (sebagai mahar) kepadanya. Ali menjawab: Aku tidak memiliki apa-apa. Baginda bersabda: Di mana baju besi Hutamiyyah milikmu?",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِسْمَاعِيلَ الطَّالَقَانِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدَةُ، ‏‏‏‏‏‏حَدَّثَنَا سَعِيدٌ، ‏‏‏‏‏‏عَنْ أَيُّوبَ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَمَّا تَزَوَّجَ عَلِيٌّ فَاطِمَةَ، ‏‏‏‏‏‏قَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَعْطِهَا شَيْئًا ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَا عِنْدِي شَيْءٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَيْنَ دِرْعُكَ الْحُطَمِيَّةُ ."
      },
      {
        "id": 21205,
        "hadith_number": "2126",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Mahar Perkahwinan: Memberi Sesuatu kepada Isteri Sebelum Bersama",
        "perawi_melayu": "Muhammad ibn Abdur Rahman ibn Thawban meriwayatkan daripada seorang lelaki dari kalangan Sahabat Nabi ﷺ",
        "english_text": "Muhammad ibn Abdur Rahman ibn Thawban reported on the authority of a man from the Companions of the Prophet صلی ‌اللہ ‌علیہ ‌وسلم: When Ali married Fatimah, daughter of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم, he intended to have intercourse with her. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم prohibited him to do so until he gave her something. Ali said: I have nothing with me, Messenger of Allah. The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Give her your coat of mail. So he gave her his coat of mail, and then cohabited with her.",
        "malay_translation": "Muhammad ibn Abdur Rahman ibn Thawban meriwayatkan daripada seorang lelaki dari kalangan Sahabat Nabi ﷺ: Ketika Ali RA berkahwin dengan Fatimah, puteri Rasulullah ﷺ, beliau berniat untuk bersetubuh dengannya. Rasulullah ﷺ melarangnya daripada berbuat demikian sehingga beliau memberikan sesuatu kepadanya. Ali RA berkata: Aku tidak mempunyai apa-apa, wahai Rasulullah. Nabi ﷺ bersabda: Berikan kepadanya baju besimu. Lalu beliau memberikan baju besinya, dan kemudian bersetubuh dengannya.",
        "arabic_text": "حَدَّثَنَا كَثِيرُ بْنُ عُبَيْدٍ الْحِمْصِيُّ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو حَيْوَةَ، ‏‏‏‏‏‏عَنْ شُعَيْبٍ يَعْنِي ابْنَ أَبِي حَمْزَةَ، ‏‏‏‏‏‏حَدَّثَنِي غَيْلَانُ بْنُ أَنَسٍ، ‏‏‏‏‏‏حَدَّثَنِيمُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ، ‏‏‏‏‏‏عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏أَنَّ عَلِيًّا لَمَّا تَزَوَّجَ فَاطِمَةَ بِنْتَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَضِيَ اللَّهُ عَنْهَا وَأَرَادَ أَنْ يَدْخُلَ بِهَا فَمَنَعَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى يُعْطِيَهَا شَيْئًا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏لَيْسَ لِي شَيْءٌ. فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَعْطِهَا دِرْعَكَ ، ‏‏‏‏‏‏فَأَعْطَاهَا دِرْعَهُ ثُمَّ دَخَلَ بِهَا."
      },
      {
        "id": 21206,
        "hadith_number": "2127",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hadis Serupa daripada Ibn Abbas RA",
        "perawi_melayu": "Diriwayatkan daripada Ibn Abbas RA melalui sanad yang berbeza.",
        "english_text": "A similar tradition has also been transmitted by Ibn Abbas through a different chain of narrators.",
        "malay_translation": "Hadis yang serupa juga diriwayatkan oleh Ibn Abbas RA melalui sanad yang berbeza.",
        "arabic_text": "حَدَّثَنَا كَثِيرٌ يَعْنِي ابْنَ عُبَيْدٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو حَيْوَةَ، ‏‏‏‏‏‏عَنْ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ غَيْلَانَ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏مِثْلَهُ."
      },
      {
        "id": 21207,
        "hadith_number": "2128",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Arahan Rasulullah SAW untuk Membantu Wanita Menuju Perkahwinan",
        "perawi_melayu": "Diriwayatkan daripada Aisyah, Ummul Muminin:",
        "english_text": "Narrated Aishah, Ummul Muminin: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم commanded me to send a woman to her husband before he gave something to her. Abu Dawud said: The narrator Khaithamah did not hear (any tradition) from Aishah.",
        "malay_translation": "Diriwayatkan daripada Aisyah, Ummul Muminin: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم memerintahkan aku untuk menghantar seorang wanita kepada suaminya sebelum dia memberikan sesuatu kepadanya. Abu Dawud berkata: Perawi Khaithamah tidak mendengar (sebarang hadis) daripada Aisyah.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ، ‏‏‏‏‏‏حَدَّثَنَا شَرِيكٌ، ‏‏‏‏‏‏عَنْ مَنْصُورٍ، ‏‏‏‏‏‏عَنْ طَلْحَةَ، ‏‏‏‏‏‏عَنْ خَيْثَمَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ أَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أُدْخِلَ امْرَأَةً عَلَى زَوْجِهَا قَبْلَ أَنْ يُعْطِيَهَا شَيْئًا . قَالَ أَبُو دَاوُد:‏‏‏‏ وَ خَيْثَمَةُ لَمْ يَسْمَعْ مِنْ عَائِشَةَ."
      },
      {
        "id": 21208,
        "hadith_number": "2129",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukum Mahar, Ganjaran, atau Janji Sebelum Nikah dan Hadiah untuk Anak Perempuan atau Saudara Perempuan",
        "perawi_melayu": "Amr bin Shuaib meriwayatkan daripada bapanya, daripada datuknya, bahawa Rasulullah SAW bersabda:",
        "english_text": "Amr bin Shuaib on his father's authority said that his grandfather reported The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said: A woman who marries on a dower or a reward or a promise before the solemnisation of marriage is entitled to it; and whatever is fixed for her after solemnisation of marriage belongs to whom it is given. A man is more entitled to receive a thing given as a gift on account of his daughter or sister (than other kinds of gifts).",
        "malay_translation": "Amr bin Shuaib meriwayatkan daripada bapanya, daripada datuknya, bahawa Rasulullah SAW bersabda: Mana-mana wanita yang berkahwin dengan mahar, ganjaran, atau janji sebelum akad nikah, maka ia adalah haknya; dan apa sahaja yang ditetapkan untuknya selepas akad nikah adalah milik orang yang memberikannya. Seorang lelaki lebih berhak menerima sesuatu yang diberikan sebagai hadiah kerana anak perempuannya atau saudara perempuannya (berbanding jenis hadiah lain).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ، ‏‏‏‏‏‏أَخْبَرَنَا ابْنُ جُرَيْجٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْجَدِّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَيُّمَا امْرَأَةٍ نُكِحَتْ عَلَى صَدَاقٍ أَوْ حِبَاءٍ أَوْ عِدَّةٍ قَبْلَ عِصْمَةِ النِّكَاحِ فَهُوَ لَهَا، ‏‏‏‏‏‏وَمَا كَانَ بَعْدَ عِصْمَةِ النِّكَاحِ فَهُوَ لِمَنْ أُعْطِيَهُ وَأَحَقُّ مَا أُكْرِمَ عَلَيْهِ الرَّجُلُ ابْنَتُهُ أَوْ أُخْتُهُ ."
      },
      {
        "id": 21209,
        "hadith_number": "2130",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Doa Nabi SAW untuk Pengantin Baru",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA",
        "english_text": "Narrated Abu Hurairah: When the Prophet صلی ‌اللہ ‌علیہ ‌وسلم congratulated a man on his marriage, he said: May Allah bless for you, and may He bless on you, and combine both of you in good (works).",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah RA: Apabila Nabi صلی ‌اللہ ‌علیہ ‌وسلم mengucapkan tahniah kepada seorang lelaki atas perkahwinannya, baginda bersabda: “Semoga Allah memberkati kamu, dan semoga Dia memberkati kamu, dan menghimpunkan kamu berdua dalam kebaikan.”",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ، ‏‏‏‏‏‏عَنْ سُهَيْلٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا رَفَّأَ الْإِنْسَانَ إِذَا تَزَوَّجَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ بَارَكَ اللَّهُ لَكَ وَبَارَكَ عَلَيْكَ وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ ."
      },
      {
        "id": 21210,
        "hadith_number": "2131",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukum Wanita Hamil Selepas Pernikahan dan Status Anak",
        "perawi_melayu": "Seorang lelaki dari Ansar bernama Basrah berkata:",
        "english_text": "A man from the Ansar called Basrah said: I married a virgin woman in her veil. When I entered upon her, I found her pregnant. (I mentioned this to the Prophet). The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: She will get the dower, for you made her vagina lawful for you. The child will be your slave. When she has begotten (a child), flog her (according to the version of al-Hasan). The version of Ibn AbusSari has: You people, flog her, or said: inflict hard punishment on him. Abu Dawud said: This tradition has been transmitted by Qatadah from Saad bin Yazid on the authority of Ibn al-Musayyab in a similar way. This tradition has been narrated by Yahya bin Abi Kathir from Yazid bin Nu'aim from Saeed bin al-Musayyab, and Ata al-Khurasani narrated it from Saeed bin al-Musayyab ; they all narrated this tradition from the Prophet صلی ‌اللہ ‌علیہ ‌وسلم omitting the link of the Companion (i. e. a mursal tradition). The version of Yahya bin Abi Kathir has: Basrah bin Aktham married a woman. The agreed version has: He made the child his servant.",
        "malay_translation": "Seorang lelaki daripada Ansar yang bernama Basrah berkata: Aku telah berkahwin dengan seorang wanita yang masih perawan dalam keadaan berhijab. Apabila aku bersetubuh dengannya, aku mendapati dia hamil. (Aku menyebut perkara ini kepada Nabi صلی ‌اللہ ‌علیہ ‌وسلم). Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda: Dia akan mendapat mas kahwin, kerana kamu telah menghalalkan farajnya untukmu. Anak itu akan menjadi hamba kamu. Apabila dia telah melahirkan (anak), sebatlah dia (menurut riwayat al-Hasan). Riwayat Ibn AbusSari ada menyebut: Wahai orang ramai, sebatlah dia, atau sabdanya: kenakanlah hukuman yang berat ke atasnya. Abu Dawud berkata: Hadis ini telah diriwayatkan oleh Qatadah daripada Saad bin Yazid daripada Ibn al-Musayyab dengan cara yang serupa. Hadis ini telah diriwayatkan oleh Yahya bin Abi Kathir daripada Yazid bin Nu'aim daripada Saeed bin al-Musayyab, dan Ata al-Khurasani meriwayatkannya daripada Saeed bin al-Musayyab; mereka semua meriwayatkan hadis ini daripada Nabi صلی ‌اللہ ‌علیہ ‌وسلم dengan menggugurkan sanad Sahabat (iaitu hadis mursal). Riwayat Yahya bin Abi Kathir ada menyebut: Basrah bin Aktham telah berkahwin dengan seorang wanita. Riwayat yang disepakati ada menyebut: Dia menjadikan anak itu sebagai hambanya.",
        "arabic_text": "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ، ‏‏‏‏‏‏وَالْحَسَنُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏وَمُحَمَّدُ بْنُ أَبِي السَّرِيِّ الْمَعْنَى، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَخْبَرَنَا ابْنُ جُرَيْجٍ، ‏‏‏‏‏‏عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، ‏‏‏‏‏‏عَنْ رَجُلٌ مِنْ الْأَنْصَارِ، ‏‏‏‏‏‏قَالَ ابْنُ أَبِي السَّرِيِّ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَقُلْ مِنْ الْأَنْصَارِ، ‏‏‏‏‏‏ثُمَّ اتَّفَقُوا، ‏‏‏‏‏‏يُقَالُ لَهُ:‏‏‏‏ بَصْرَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ تَزَوَّجْتُ امْرَأَةً بِكْرًا فِي سِتْرِهَا، ‏‏‏‏‏‏فَدَخَلْتُ عَلَيْهَا فَإِذَا هِيَ حُبْلَى، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَهَا الصَّدَاقُ بِمَا اسْتَحْلَلْتَ مِنْ فَرْجِهَا وَالْوَلَدُ عَبْدٌ لَكَ، ‏‏‏‏‏‏فَإِذَا وَلَدَتْ، ‏‏‏‏‏‏قَالَ الْحَسَنُ:‏‏‏‏ فَاجْلِدْهَا، ‏‏‏‏‏‏وقَالَ ابْنُ أَبِي السَّرِيِّ:‏‏‏‏ فَاجْلِدُوهَا، ‏‏‏‏‏‏أَوْ قَالَ:‏‏‏‏ فَحُدُّوهَا . قَالَ أَبُو دَاوُد:‏‏‏‏ رَوَى هَذَا الْحَدِيثَ قَتَادَةُ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ يَزِيدَ، ‏‏‏‏‏‏عَنْ ابْنِ الْمُسَيَّبِ، ‏‏‏‏‏‏وَرَوَاهُ يَحْيَى بْنُ أَبِي كَثِيرٍ، ‏‏‏‏‏‏عَنْ يَزِيدَ بْنِ نُعَيْمٍ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، ‏‏‏‏‏‏وَ عَطَاءٍ الْخُرَاسَانِيِّ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، ‏‏‏‏‏‏أَرْسَلُوهُ كُلُّهُمْ، ‏‏‏‏‏‏وَفِي حَدِيثِ يَحْيَى بْنِ أَبِي كَثِيرٍ، ‏‏‏‏‏‏أَنَّ بَصْرَةَ بْنَ أَكْثَمَ نَكَحَ امْرَأَةً، ‏‏‏‏‏‏وَكُلُّهُمْ قَالَ فِي حَدِيثِهِ:‏‏‏‏ جَعَلَ الْوَلَدَ عَبْدًا لَهُ."
      },
      {
        "id": 21211,
        "hadith_number": "2132",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Pernikahan dan Perceraian: Riwayat dari Said bin al-Musayyab",
        "perawi_melayu": "Diriwayatkan dari Said bin al-Musayyab",
        "english_text": "Saeed bin al-Musayyab said: A man called Basrah bin Akhtam married a woman. The narrator then reported the rest of the tradition to the same effect. This version added: And he separated them. The tradition narrated by Ibn Juraij is perfect.",
        "malay_translation": "Said bin al-Musayyab berkata: Seorang lelaki bernama Basrah bin Akhtam telah menikahi seorang wanita. Kemudian perawi meriwayatkan seluruh hadis dengan makna yang sama. Versi ini menambahkan: Dan dia (hakim/qadi) memisahkan mereka berdua. Hadis yang diriwayatkan oleh Ibn Juraij adalah lebih lengkap.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، ‏‏‏‏‏‏حَدَّثَنَا عَلِيٌّ يَعْنِي ابْنَ الْمُبَارَكِ، ‏‏‏‏‏‏عَنْ يَحْيَى، ‏‏‏‏‏‏عَنْ يَزِيدَ بْنِ نُعَيْمٍ، ‏‏‏‏‏‏عَنْسَعِيدِ بْنِ الْمُسَيِّبِ، ‏‏‏‏‏‏أَنَّ رَجُلًا يُقَالُ لَهُ:‏‏‏‏ بَصْرَةُ بْنُ أَكْثَمَ نَكَحَ امْرَأَةً، ‏‏‏‏‏‏فَذَكَرَ مَعْنَاهُ، ‏‏‏‏‏‏زَادَ وَفَرَّقَ بَيْنَهُمَا، ‏‏‏‏‏‏وَحَدِيثُ ابْنِ جُرَيْجٍ أَتَمُّ."
      },
      {
        "id": 21212,
        "hadith_number": "2133",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Ancaman Bagi Suami Yang Tidak Adil Terhadap Isteri-isterinya",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA:",
        "english_text": "Narrated Abu Hurairah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: When a man has two wives and he is inclined to one of them, he will come on the Day of resurrection with a side hanging down.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah RA: Nabi ﷺ bersabda: Apabila seorang lelaki mempunyai dua orang isteri dan dia cenderung kepada salah seorang daripada mereka, dia akan datang pada Hari Kiamat dengan satu sisi badannya tergantung.",
        "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ، ‏‏‏‏‏‏حَدَّثَنَا هَمَّامٌ، ‏‏‏‏‏‏حَدَّثَنَا قَتَادَةُ، ‏‏‏‏‏‏عَنْ النَّضْرِ بْنِ أَنَسٍ، ‏‏‏‏‏‏عَنْ بَشِيرِ بْنِ نَهِيكٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَنْ كَانَتْ لَهُ امْرَأَتَانِ فَمَالَ إِلَى إِحْدَاهُمَا، ‏‏‏‏‏‏جَاءَ يَوْمَ الْقِيَامَةِ وَشِقُّهُ مَائِلٌ ."
      },
      {
        "id": 21213,
        "hadith_number": "2134",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Pembahagian Masa Rasulullah dan Doa Baginda",
        "perawi_melayu": "Diriwayatkan daripada Aisyah, Ummul Muminin:",
        "english_text": "Narrated Aishah, Ummul Muminin: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم used to divide his time equally and said: O Allah, this is my division concerning what I control, so do not blame me concerning what You control and I do not. Abu Dawud said: By it meant the heart.",
        "malay_translation": "Diriwayatkan daripada Aisyah, Ummul Muminin: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم membahagikan masanya dengan adil dan bersabda: “Ya Allah, ini adalah pembahagianku dalam apa yang aku miliki, maka janganlah Engkau mencelaku dalam apa yang Engkau miliki dan aku tidak memilikinya.” Abu Dawood berkata: Maksudnya adalah hati.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادٌ، ‏‏‏‏‏‏عَنْ أَيُّوبَ، ‏‏‏‏‏‏عَنْ أَبِي قِلَابَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْخَطْمِيِّ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْسِمُ فَيَعْدِلُ، ‏‏‏‏‏‏وَيَقُولُ:‏‏‏‏ اللَّهُمَّ هَذَا قَسْمِي فِيمَا أَمْلِكُ، ‏‏‏‏‏‏فَلَا تَلُمْنِي فِيمَا تَمْلِكُ وَلَا أَمْلِكُ . قال أَبُو دَاوُدَ:‏‏‏‏ يَعْنِي الْقَلْبَ."
      },
      {
        "id": 21214,
        "hadith_number": "2135",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Keadilan Rasulullah SAW dalam Giliran Bersama Isteri-isteri Baginda dan Pemberian Saudah kepada Aisyah",
        "perawi_melayu": "Diriwayatkan daripada Hisham bin Urwah: Daripada ayahnya bahawa Aishah berkata: Wahai anak saudaraku, Rasulullah SAW tidak melebihkan seorang pun daripada kami berbanding yang lain dalam pembahagian masa Baginda tinggal bersama kami. Sangat jarang Baginda tidak mengunjungi kami pada mana-mana hari (iaitu Baginda mengunjungi kami semua setiap hari). Baginda akan mendekati setiap isterinya tanpa melakukan persetubuhan sehingga Baginda sampai kepada isteri yang mendapat giliran harinya dan bermalam bersamanya. Ketika Saudah binti Zam'ah menjadi tua dan khuatir Rasulullah SAW akan menceraikannya, dia berkata: Wahai Rasulullah, aku berikan kepada Aishah hari engkau mengunjungi aku. Rasulullah SAW menerimanya daripada dia. Aishah berkata: Kami berpendapat bahawa Allah SWT menurunkan tentang perkara ini atau perkara yang serupa dengannya ayat al-Quran: Jika seorang isteri bimbang akan kekejaman atau pengabaian suaminya... [4: 128]",
        "english_text": "Narrated Hisham bin Urwah: On the authority of his father that Aishah said: O my nephew, the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم did not prefer one of us to the other in respect of his division of the time of his staying with us. It was very rare that he did not visit us any day (i. e. he visited all of us every day). He would come near each of his wives without having intercourse with her until he reached the one who had her day and passed his night with her. When Saudah daughter of Zam'ah became old and feared that the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم would divorce her, she said: Messenger of Allah, I give to Aishah the day you visit me. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم accepted it from her. She said: We thing that Allah, the Exalted, revealed about this or similar matter the Quranic verse: If a wife fears cruelty or desertion on her husband's part. . . . [4: 128]",
        "malay_translation": "Diriwayatkan oleh Hisham bin Urwah: Berdasarkan autoriti daripada bapanya bahawa Aishah berkata: Wahai anak saudaraku, Rasulullah SAW tidak mengutamakan sesiapa pun di antara kami berhubung dengan pembahagian masa Baginda tinggal bersama kami. Sangat jarang sekali ada hari yang Baginda tidak mengunjungi kami semua; Baginda mendekati setiap isteri tanpa bersetubuh sehingga sampai giliran isteri tersebut dan bermalam bersamanya. Apabila Saudah binti Zam'ah menjadi tua dan takut Rasulullah SAW akan menceraikannya, dia berkata: Wahai Rasulullah, hari saya adalah untuk Aishah. Rasulullah SAW menerima pemberian itu daripadanya. Aishah berkata: Kami berpendapat bahawa Allah SWT menurunkan ayat al-Quran mengenai perkara ini atau yang serupa dengannya: Jika seorang isteri bimbang akan kekejaman atau pengabaian daripada suaminya... [4: 128].",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّحْمَنِ يَعْنِي ابْنَ أَبِي الزِّنَادِ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَتْ عَائِشَةُ:‏‏‏‏ يَا ابْنَ أُخْتِي، ‏‏‏‏‏‏كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُفَضِّلُ بَعْضَنَا عَلَى بَعْضٍ فِي الْقَسْمِ مِنْ مُكْثِهِ عِنْدَنَا، ‏‏‏‏‏‏وَكَانَ قَلَّ يَوْمٌ إِلَّا وَهُوَ يَطُوفُ عَلَيْنَا جَمِيعًا، ‏‏‏‏‏‏فَيَدْنُو مِنْ كُلِّ امْرَأَةٍ مِنْ غَيْرِ مَسِيسٍ حَتَّى يَبْلُغَ إِلَى الَّتِي هُوَ يَوْمُهَا فَيَبِيتَ عِنْدَهَا، ‏‏‏‏‏‏وَلَقَدْ قَالَتْ سَوْدَةُ بِنْتُ زَمْعَةَ حِينَ أَسَنَّتْ وَفَرِقَتْ أَنْ يُفَارِقَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏يَوْمِي لِعَائِشَةَ، ‏‏‏‏‏‏فَقَبِلَ ذَلِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهَا، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ نَقُولُ فِي ذَلِكَ أَنْزَلَ اللَّهُ تَعَالَى، ‏‏‏‏‏‏وَفِي أَشْبَاهِهَا أُرَاهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَإِنِ امْرَأَةٌ خَافَتْ مِنْ بَعْلِهَا نُشُوزًا سورة النساء آية 128 ."
      },
      {
        "id": 21215,
        "hadith_number": "2136",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Keizinan Rasulullah SAW kepada Isteri-isterinya dalam Giliran",
        "perawi_melayu": "Diriwayatkan daripada Aisyah R.A: Rasulullah SAW meminta izin daripada kami pada hari baginda perlu tinggal dengan salah seorang isterinya (secara bergilir) setelah ayat Al-Quran berikut diturunkan: Engkau boleh menjarakkan (giliran) sesiapa yang engkau kehendaki di antara mereka, dan mendekatkan (giliran) sesiapa yang engkau kehendaki [33:51]. Perawi, Muadhah berkata: Aku bertanya kepadanya: Apa yang engkau katakan kepada Rasulullah SAW? Dia berkata: Aku biasa berkata: Jika aku mempunyai pilihan untuk itu, aku tidak akan mengutamakan sesiapa pun daripada diriku sendiri.",
        "english_text": "Narrated Aishah: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم used to aske our permission on the day he had to stay with one of his wives (by turns) after the following Quranic verse was revealed: You may distance those whom you like, and draw close to those whom you like [33: 51]. The narrator Muadhah said: I said to her: What did you say to the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم ? She said: I used to say: If had an option for that, I would not preferred anyone to myself.",
        "malay_translation": "Diriwayatkan daripada Aisyah R.A: Rasulullah SAW biasa meminta izin daripada kami pada hari baginda perlu tinggal dengan salah seorang isterinya (secara bergilir) setelah ayat Al-Quran berikut diturunkan: Engkau boleh menjarakkan (giliran) sesiapa yang engkau kehendaki di antara mereka, dan mendekatkan (giliran) sesiapa yang engkau kehendaki [33:51]. Perawi, Muadhah berkata: Aku bertanya kepadanya: Apa yang engkau katakan kepada Rasulullah SAW? Dia berkata: Aku biasa berkata: Jika aku mempunyai pilihan untuk itu, aku tidak akan mengutamakan sesiapa pun daripada diriku sendiri.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ، ‏‏‏‏‏‏وَمُحَمَّدُ بْنُ عِيسَى الْمَعْنَى، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ، ‏‏‏‏‏‏عَنْ عَاصِمٍ، ‏‏‏‏‏‏عَنْ مُعَاذَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَأْذِنُنَا إِذَا كَانَ فِي يَوْمِ الْمَرْأَةِ مِنَّا بَعْدَ مَا نَزَلَتْ:‏‏‏‏ تُرْجِي مَنْ تَشَاءُ مِنْهُنَّ وَتُؤْوِي إِلَيْكَ مَنْ تَشَاءُ سورة الأحزاب آية 51 ، ‏‏‏‏‏‏قَالَتْ مَعَاذَةُ:‏‏‏‏ فَقُلْتُ لَهَا:‏‏‏‏ مَا كُنْتِ تَقُولِينَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ؟ قَالَتْ:‏‏‏‏ كُنْتُ أَقُولُ:‏‏‏‏ إِنْ كَانَ ذَلِكَ إِلَيَّ لَمْ أُوثِرْ أَحَدًا عَلَى نَفْسِي ."
      },
      {
        "id": 21216,
        "hadith_number": "2137",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Keizinan Isteri-Isteri Nabi SAW untuk Baginda Tinggal Bersama Aisyah RA Ketika Sakit",
        "perawi_melayu": "Diriwayatkan daripada Aisyah RA",
        "english_text": "Aishah said The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم sent for his wives during his illness. When they got together, he صلی ‌اللہ ‌علیہ ‌وسلم said “I am unable to visit all of you. If you think to permit me to stay with Aishah you may do so. ” So they permitted him (to stay with Aishah).",
        "malay_translation": "Aisyah RA berkata: Rasulullah SAW menghantar utusan kepada isteri-isterinya semasa baginda sakit. Apabila mereka berkumpul, baginda SAW bersabda: “Sesungguhnya aku tidak mampu untuk mengunjungi kamu semua. Jika kamu semua berpendapat untuk mengizinkan aku tinggal bersama Aisyah, kamu boleh melakukannya.” Maka mereka pun mengizinkan baginda (tinggal bersama Aisyah).",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا مَرْحُومُ بْنُ عَبْدِ الْعَزِيزِ الْعَطَّارُ، ‏‏‏‏‏‏حَدَّثَنِي أَبُو عِمْرَانَ الْجَوْنِيُّ، ‏‏‏‏‏‏عَنْ يَزِيدَ بْنِ بَابَنُوسَ، ‏‏‏‏‏‏عَنْعَائِشَةَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ إِلَى النِّسَاءِ تَعْنِي فِي مَرَضِهِ فَاجْتَمَعْنَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنِّي لَا أَسْتَطِيعُ أَنْ أَدُورَ بَيْنَكُنَّ، ‏‏‏‏‏‏فَإِنْ رَأَيْتُنَّ أَنْ تَأْذَنَّ لِي فَأَكُونَ عِنْدَ عَائِشَةَ فَعَلْتُنَّ ، ‏‏‏‏‏‏فَأَذِنَّ لَهُ."
      },
      {
        "id": 21217,
        "hadith_number": "2138",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Pembahagian Masa Rasulullah SAW di Antara Isteri-isteri Baginda dan Pemberian Hari Saudah kepada Aisyah",
        "perawi_melayu": "Daripada Aisyah isteri Nabi SAW",
        "english_text": "Aishah wife of the Prophet صلی ‌اللہ ‌علیہ ‌وسلم reported “When the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم intended to go on a journey he cast lots amongst his wives and the one who was chosen by lot went on it with him. He divided his time, day and night (equally) for each of his wives except that Saudah daughter of Zam’ah gave her day to Aishah.",
        "malay_translation": "Aisyah isteri Nabi SAW meriwayatkan, “Apabila Rasulullah SAW berhasrat untuk pergi dalam sesuatu perjalanan, baginda akan membuat undian di antara isteri-isterinya, dan sesiapa yang terpilih melalui undian itu akan pergi bersamanya. Baginda membahagikan masanya, siang dan malam (sama rata) untuk setiap isterinya, kecuali Saudah binti Zam'ah yang memberikan harinya kepada Aisyah.”",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، ‏‏‏‏‏‏أَخْبَرَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏عَنْ يُونُسَ، ‏‏‏‏‏‏عَنْ ابْنِ شِهَابٍ، ‏‏‏‏‏‏أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ حَدَّثَهُ، ‏‏‏‏‏‏أَنَّعَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ سَفَرًا أَقْرَعَ بَيْنَ نِسَائِهِ فَأَيَّتُهُنَّ خَرَجَ سَهْمُهَا خَرَجَ بِهَا مَعَهُ، ‏‏‏‏‏‏وَكَانَ يَقْسِمُ لِكُلِّ امْرَأَةٍ مِنْهُنَّ يَوْمَهَا وَلَيْلَتَهَا، ‏‏‏‏‏‏غَيْرَ أَنَّ سَوْدَةَ بِنْتَ زَمْعَةَ وَهَبَتْ يَوْمَهَا لِعَائِشَةَ ."
      },
      {
        "id": 21218,
        "hadith_number": "2139",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Syarat yang Paling Utama Dipenuhi dalam Pernikahan",
        "perawi_melayu": "Uqbah bin Amir meriwayatkan bahawa Rasulullah ﷺ bersabda",
        "english_text": "Uqbah bin Amir reported the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم as saying “The condition worthier to be fulfilled by you is the one by which you made the private parts (of your wife) lawful (for you).",
        "malay_translation": "Uqbah bin Amir meriwayatkan bahawa Rasulullah ﷺ bersabda: “Syarat yang paling utama untuk kamu penuhi adalah syarat yang membolehkan kamu menghalalkan faraj (isteri kamu).”",
        "arabic_text": "حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ، ‏‏‏‏‏‏أَخْبَرَنِي اللَّيْثُ، ‏‏‏‏‏‏عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، ‏‏‏‏‏‏عَنْ أَبِي الْخَيْرِ، ‏‏‏‏‏‏عَنْ عُقْبَةَ بْنِ عَامِرٍ، ‏‏‏‏‏‏عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏أَنَّهُ قَالَ:‏‏‏‏ إِنَّ أَحَقَّ الشُّرُوطِ أَنْ تُوفُوا بِهِ مَا اسْتَحْلَلْتُمْ بِهِ الْفُرُوجَ ."
      },
      {
        "id": 21219,
        "hadith_number": "2140",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Sujud kepada Seseorang Selain Allah dan Hak Suami ke atas Isteri",
        "perawi_melayu": "Qays ibn Saad meriwayatkan:",
        "english_text": "Narrated Qays ibn Saad: I went to al-Hirah and saw them (the people) prostrating themselves before a satrap of theirs, so I said: The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم has most right to have prostration made before him. When I came to the Prophet صلی ‌اللہ ‌علیہ ‌وسلم, I said: I went to al-Hirah and saw them prostrating themselves before a satrap of theirs, but you have most right, Messenger of Allah, to have (people) prostrating themselves before you. He said: Tell me, if you were to pass my grave, would you prostrate yourself before it? I said: No. He then said: Do not do so. If I were to command anyone to make prostration before another I would command women to prostrate themselves before their husbands, because of the special right over them given to husbands by Allah.",
        "malay_translation": "Qays ibn Saad meriwayatkan: Aku pergi ke al-Hirah dan melihat mereka (orang-orang) sujud kepada seorang gabenor mereka, lalu aku berkata: Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم lebih berhak untuk disujud kepadanya. Ketika aku datang kepada Nabi صلی ‌اللہ ‌علیہ ‌وسلم, aku berkata: Aku pergi ke al-Hirah dan melihat mereka sujud kepada seorang gabenor mereka, tetapi engkau lebih berhak, wahai Rasulullah, untuk (orang) sujud kepadamu. Baginda bersabda: Beritahu aku, jika engkau melalui kuburku, adakah engkau akan sujud kepadanya? Aku berkata: Tidak. Baginda kemudian bersabda: Jangan lakukan demikian. Sekiranya aku memerintahkan seseorang untuk sujud kepada orang lain, nescaya aku akan memerintahkan wanita untuk sujud kepada suami mereka, kerana hak istimewa yang diberikan Allah kepada suami ke atas mereka.",
        "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، ‏‏‏‏‏‏أَخْبَرَنَا إِسْحَاقُ بْنُ يُوسُفَ، ‏‏‏‏‏‏عَنْ شَرِيكٍ، ‏‏‏‏‏‏عَنْ حُصَيْنٍ، ‏‏‏‏‏‏عَنْ الشَّعْبِيِّ، ‏‏‏‏‏‏عَنْ قَيْسِ بْنِ سَعْدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَتَيْتُ الْحِيرَةَ فَرَأَيْتُهُمْ يَسْجُدُونَ لِمَرْزُبَانٍ لَهُمْ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ رَسُولُ اللَّهِ أَحَقُّ أَنْ يُسْجَدَ لَهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ إِنِّي أَتَيْتُ الْحِيرَةَ فَرَأَيْتُهُمْ يَسْجُدُونَ لِمَرْزُبَانٍ لَهُمْ، ‏‏‏‏‏‏فَأَنْتَ يَا رَسُولَ اللَّهِ أَحَقُّ أَنْ نَسْجُدَ لَكَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَرَأَيْتَ لَوْ مَرَرْتَ بِقَبْرِي أَكُنْتَ تَسْجُدُ لَهُ ؟ قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ لَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَلَا تَفْعَلُوا،‏‏‏‏لَوْ كُنْتُ آمِرًا أَحَدًا أَنْ يَسْجُدَ لِأَحَدٍ لَأَمَرْتُ النِّسَاءَ أَنْ يَسْجُدْنَ لِأَزْوَاجِهِنَّ، ‏‏‏‏‏‏لِمَا جَعَلَ اللَّهُ لَهُمْ عَلَيْهِنَّ مِنَ الْحَقِّ ."
      },
      {
        "id": 21220,
        "hadith_number": "2141",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Ancaman bagi Isteri yang Enggan Melayani Suami di Ranjang",
        "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Nabi Muhammad SAW bersabda",
        "english_text": "Abu Hurairah reported the Prophet صلی ‌اللہ ‌علیہ ‌وسلم as saying “When a man calls his wife to come to his bed and she refuses and does not come to him and he spends the night angry, the angels curse her till the morning. ”",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Nabi SAW bersabda: “Apabila seorang suami memanggil isterinya ke tempat tidurnya (untuk berjima’) dan isterinya enggan serta tidak mendatanginya, lalu suaminya bermalam dalam keadaan marah kepadanya, maka para malaikat akan melaknat wanita itu sehingga Subuh.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو الرَّازِيُّ، ‏‏‏‏‏‏حَدَّثَنَا جَرِيرٌ، ‏‏‏‏‏‏عَنْ الْأَعْمَشِ، ‏‏‏‏‏‏عَنْ أَبِي حَازِمٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِذَا دَعَا الرَّجُلُ امْرَأَتَهُ إِلَى فِرَاشِهِ فَأَبَتْ فَلَمْ تَأْتِهِ، ‏‏‏‏‏‏فَبَاتَ غَضْبَانَ عَلَيْهَا، ‏‏‏‏‏‏لَعَنَتْهَا الْمَلَائِكَةُ حَتَّى تُصْبِحَ ."
      },
      {
        "id": 21221,
        "hadith_number": "2142",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hak Isteri Ke Atas Suami Dalam Islam",
        "perawi_melayu": "Muawiyah al-Qushayri",
        "english_text": "Narrated Muawiyah al-Qushayri: Muawiyah asked: Messenger of Allah, what is the right of the wife of one of us over him? He replied: That you should give her food when you eat, clothe her when you clothe yourself, do not strike her on the face, do not revile her or separate yourself from her except in the house. Abu Dawud said: The meaning of do not revile her is, as you say: May Allah revile you .",
        "malay_translation": "Diriwayatkan oleh Muawiyah al-Qushayri: Muawiyah bertanya: Rasulullah, apakah hak isteri salah seorang daripada kami ke atas suaminya? Baginda menjawab: Hendaklah kamu memberinya makan apabila kamu makan, memberinya pakaian apabila kamu berpakaian, jangan memukul wajahnya, jangan mencacinya atau menjauhkan diri daripadanya kecuali di dalam rumah. Abu Dawud berkata: Maksud jangan mencacinya adalah, seperti kamu berkata: Semoga Allah mencacimu.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادٌ، ‏‏‏‏‏‏أَخْبَرَنَا أَبُو قَزَعَةَ الْبَاهِلِيُّ، ‏‏‏‏‏‏عَنْ حَكِيمِ بْنِ مُعَاوِيَةَ الْقُشَيْرِيِّ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏مَا حَقُّ زَوْجَةِ أَحَدِنَا عَلَيْهِ ؟ قَالَ:‏‏‏‏ أَنْ تُطْعِمَهَا إِذَا طَعِمْتَ، ‏‏‏‏‏‏وَتَكْسُوَهَا إِذَا اكْتَسَيْتَ أَوِ اكْتَسَبْتَ، ‏‏‏‏‏‏وَلَا تَضْرِبْ الْوَجْهَ، ‏‏‏‏‏‏وَلَا تُقَبِّحْ وَلَا تَهْجُرْ إِلَّا فِي الْبَيْتِ . قَالَ أَبُو دَاوُد:‏‏‏‏ وَلَا تُقَبِّحْ، ‏‏‏‏‏‏أَنْ تَقُولَ:‏‏‏‏ قَبَّحَكِ اللَّهُ."
      },
      {
        "id": 21222,
        "hadith_number": "2143",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Adab Terhadap Isteri: Memberi Makan, Pakaian, dan Larangan Kekerasan",
        "perawi_melayu": "Bahz bin Hakim meriwayatkan daripada ayahnya daripada datuknya (Muawiyah ibn Haydah) yang berkata: Aku berkata: Wahai Rasulullah, bagaimana kami harus mendekati isteri-isteri kami dan bagaimana kami harus meninggalkan mereka? Baginda menjawab: Dekatilah ladangmu bila atau bagaimana kamu mahu, berilah dia (isterimu) makan ketika kamu makan, pakaikan dia ketika kamu berpakaian, jangan mencela wajahnya, dan jangan memukulnya. Abu Dawud berkata: Versi daripada Shubah ada: Bahawa kamu memberinya makan ketika kamu makan sendiri, dan bahawa kamu memakaikannya ketika kamu berpakaian sendiri.",
        "english_text": "Bahz bin Hakim reported on the authority of his father from his grandfather (Muawiyah ibn Haydah) as saying: I said: Messenger of Allah, how should we approach our wives and how should we leave them? He replied: Approach your tilth when or how you will, give her (your wife) food when you take food, clothe when you clothe yourself, do not revile her face, and do not beat her. Abu Dawud said: The version of Shubah has: That you give her food when you have food yourself, and that you clothe her when you clothe yourself.",
        "malay_translation": "Bahz bin Hakim meriwayatkan daripada ayahnya daripada datuknya (Muawiyah ibn Haydah) yang berkata: Aku berkata: Wahai Rasulullah, bagaimana seharusnya kami mendekati isteri-isteri kami dan bagaimana seharusnya kami meninggalkan mereka? Baginda menjawab: Dekatilah ladangmu (isterimu) bila-bila masa dan bagaimana sahaja kamu suka, berilah dia (isterimu) makan apabila kamu makan, pakaikan dia apabila kamu berpakaian, janganlah kamu mencela wajahnya dan janganlah kamu memukulnya. Abu Daud berkata: Riwayat daripada Syu'bah menyatakan: Hendaklah kamu memberinya makan apabila kamu makan dan memakaikannya apabila kamu berpakaian.",
        "arabic_text": "حَدَّثَنَا ابْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ‏‏‏‏‏‏حَدَّثَنَا بَهْزُ بْنُ حَكِيمٍ، ‏‏‏‏‏‏حَدَّثَنِي أَبِي، ‏‏‏‏‏‏عَنْ جَدِّي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏نِسَاؤُنَا مَا نَأْتِي مِنْهُنَّ وَمَا نَذَرُ ؟ قَالَ:‏‏‏‏ ائْتِ حَرْثَكَ أَنَّى شِئْتَ، ‏‏‏‏‏‏وَأَطْعِمْهَا إِذَا طَعِمْتَ، ‏‏‏‏‏‏وَاكْسُهَا إِذَا اكْتَسَيْتَ، ‏‏‏‏‏‏وَلَا تُقَبِّحْ الْوَجْهَ وَلَا تَضْرِبْ . قَالَ أَبُو دَاوُد:‏‏‏‏ رَوَى شُعْبَةُ تُطْعِمُهَا إِذَا طَعِمْتَ وَتَكْسُوهَا إِذَا اكْتَسَيْتَ."
      },
      {
        "id": 21223,
        "hadith_number": "2144",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hak-Hak Isteri: Memberi Makan, Pakaian, dan Larangan Memukul atau Mencela",
        "perawi_melayu": "Muawiyah al-Qushayri meriwayatkan:",
        "english_text": "Narrated Muawiyah al-Qushayri: I went to the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم and asked him: What do you say (command) about our wives? He replied: Give them food what you have for yourself, and clothe them by which you clothe yourself, and do not beat them, and do not revile them.",
        "malay_translation": "Muawiyah al-Qushayri meriwayatkan: Aku pergi kepada Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم dan bertanya kepada baginda: Apa yang engkau katakan (perintahkan) tentang isteri-isteri kami? Baginda menjawab: Berilah mereka makan dari apa yang kamu makan, dan pakaikan mereka dengan apa yang kamu pakai, dan janganlah kamu memukul mereka, dan janganlah kamu mencela mereka.",
        "arabic_text": "أَخْبَرَنِي أَحْمَدُ بْنُ يُوسُفَ الْمُهَلَّبِيُّ النَّيْسَابُورِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عُمَرُ بْنُ عَبْدِ اللَّهِ بْنِ رَزِينٍ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ حُسَيْنٍ، ‏‏‏‏‏‏عَنْدَاوُدَ الْوَرَّاقِ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ حَكِيمِ بْنِ مُعَاوِيَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ مُعَاوِيَةَ الْقُشَيْرِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَقُلْتُ:‏‏‏‏ مَا تَقُولُ فِي نِسَائِنَا ؟ قَالَ:‏‏‏‏ أَطْعِمُوهُنَّ مِمَّا تَأْكُلُونَ، ‏‏‏‏‏‏وَاكْسُوهُنَّ مِمَّا تَكْتَسُونَ، ‏‏‏‏‏‏وَلَا تَضْرِبُوهُنَّ وَلَا تُقَبِّحُوهُنَّ ."
      },
      {
        "id": 21224,
        "hadith_number": "2145",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Menangani Isteri yang Nusyuz: Pengabaian di Tempat Tidur",
        "perawi_melayu": "Abu Harrah Al Ruqashi meriwayatkan daripada bapa saudaranya",
        "english_text": "Abu Harrah Al Ruqashi reported on the authority of his uncle” The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said “If you fear the recalcitrance abandon them in their beds. ” The narrator Hammad said “By abandonment he meant abandonment of intercourse. ”",
        "malay_translation": "Abu Harrah Al Ruqashi meriwayatkan daripada bapa saudaranya: Nabi صلی ‌اللہ ‌علیہ ‌وسلم bersabda, “Jika kamu khuatir akan nusyuz (keingkaran) mereka, maka tinggalkanlah mereka di tempat tidur.” Perawi, Hammad, berkata, “Maksud pengabaian itu adalah pengabaian hubungan kelamin.”",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادٌ، ‏‏‏‏‏‏عَنْ عَلِيِّ بْنِ زَيْدٍ، ‏‏‏‏‏‏عَنْ أَبِي حُرَّةَ الرَّقَاشِيِّ، ‏‏‏‏‏‏عَنْ عَمِّهِ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَإِنْ خِفْتُمْ نُشُوزَهُنَّ فَاهْجُرُوهُنَّ فِي الْمَضَاجِعِ ، ‏‏‏‏‏‏قَالَ حَمَّادٌ:‏‏‏‏ يَعْنِي النِّكَاحَ."
      },
      {
        "id": 21225,
        "hadith_number": "2146",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Memukul Wanita dan Keluhan Para Isteri",
        "perawi_melayu": "Iyas ibn Abdullah ibn Abu Dhubab meriwayatkan bahawa Rasulullah SAW bersabda:",
        "english_text": "Iyas ibn Abdullah ibn Abu Dhubab reported the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم as saying: Do not beat Allah's handmaidens, but when Umar came to the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم and said: Women have become emboldened towards their husbands, he (the Prophet) gave permission to beat them. Then many women came round the family of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم complaining against their husbands. So the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said: Many women have gone round Muhammad's family complaining against their husbands. They are not the best among you.",
        "malay_translation": "Iyas ibn Abdullah ibn Abu Dhubab meriwayatkan bahawa Rasulullah SAW bersabda: “Janganlah kamu memukul hamba-hamba perempuan Allah.” Tetapi ketika Umar datang kepada Rasulullah SAW dan berkata: “Para wanita telah berani terhadap suami mereka,” maka Baginda (Nabi SAW) memberikan izin untuk memukul mereka. Kemudian banyak wanita datang kepada keluarga Rasulullah SAW mengadu tentang suami mereka. Maka Rasulullah SAW bersabda: “Banyak wanita telah datang kepada keluarga Muhammad mengadu tentang suami mereka. Mereka itu bukanlah yang terbaik di antara kamu.”",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي خَلَفٍ، ‏‏‏‏‏‏وَأَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ ابْنُ السَّرْحِ عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ:‏‏‏‏ عَنْ إِيَاسِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي ذُبَابٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تَضْرِبُوا إِمَاءَ اللَّهِ ، ‏‏‏‏‏‏فَجَاءَ عُمَرُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ ذَئِرْنَ النِّسَاءُ عَلَى أَزْوَاجِهِنَّ، ‏‏‏‏‏‏فَرَخَّصَ فِي ضَرْبِهِنَّ، ‏‏‏‏‏‏فَأَطَافَ بِآلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نِسَاءٌ كَثِيرٌ يَشْكُونَ أَزْوَاجَهُنَّ، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَقَدْ طَافَ بِآلِ مُحَمَّدٍ نِسَاءٌ كَثِيرٌ يَشْكُونَ أَزْوَاجَهُنَّ، ‏‏‏‏‏‏لَيْسَ أُولَئِكَ بِخِيَارِكُمْ ."
      },
      {
        "id": 21226,
        "hadith_number": "2147",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Mempersoalkan Tindakan Suami Memukul Isterinya",
        "perawi_melayu": "Diriwayatkan daripada Umar ibn al-Khattab RA bahawa Nabi Muhammad SAW bersabda:",
        "english_text": "Narrated Umar ibn al-Khattab: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: A man will not be asked as to why he beat his wife.",
        "malay_translation": "Diriwayatkan daripada Umar ibn al-Khattab RA: Nabi SAW bersabda: Seseorang lelaki tidak akan dipersoalkan mengapa dia memukul isterinya.",
        "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو عَوَانَةَ، ‏‏‏‏‏‏عَنْ دَاوُدَ بْنِ عَبْدِ اللَّهِ الْأَوْدِيِّ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ الْمُسْلِيِّ، ‏‏‏‏‏‏عَنْ الْأَشْعَثِ بْنِ قَيْسٍ، ‏‏‏‏‏‏عَنْ عُمَرَ بْنِ الْخَطَّابِ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا يُسْأَلُ الرَّجُلُ فِيمَا ضَرَبَ امْرَأَتَهُ ."
      },
      {
        "id": 21227,
        "hadith_number": "2148",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Pandangan Tidak Sengaja dan Arahan untuk Mengalihkan Pandangan",
        "perawi_melayu": "Jarir",
        "english_text": "Jarir said I asked the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم about an accidental glance (on a woman). He صلی ‌اللہ ‌علیہ ‌وسلم said “Turn your eyes away. ”",
        "malay_translation": "Jarir berkata, “Aku bertanya kepada Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم tentang pandangan tidak sengaja (terhadap seorang wanita). Baginda صلی ‌اللہ ‌علیہ ‌وسلم bersabda, “Alihkan pandanganmu.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، ‏‏‏‏‏‏أَخْبَرَنَا سُفْيَانُ، ‏‏‏‏‏‏حَدَّثَنِي يُونُسُ بْنُ عُبَيْدٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ أَبِي زُرْعَةَ، ‏‏‏‏‏‏عَنْ جَرِيرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نَظْرَةِ الْفَجْأَةِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ اصْرِفْ بَصَرَكَ ."
      },
      {
        "id": 21228,
        "hadith_number": "2149",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Memandang (Wanita) Kali Kedua",
        "perawi_melayu": "Diriwayatkan daripada Buraydah ibn al-Hasib:",
        "english_text": "Narrated Buraydah ibn al-Hasib: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: to Ali: Do not give a second look, Ali, (because) while you are not to blame for the first, you have no right to the second.",
        "malay_translation": "Diriwayatkan daripada Buraydah ibn al-Hasib: Nabi Muhammad صلی ‌اللہ ‌علیہ ‌وسلم bersabda kepada Ali: Wahai Ali, jangan ikutkan pandangan (yang pertama) dengan pandangan (yang kedua), kerana pandangan pertama itu untukmu (tidak berdosa) tetapi tidak bagi pandangan yang kedua.",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُوسَى الْفَزَارِيُّ، ‏‏‏‏‏‏أَخْبَرَنَا شَرِيكٌ، ‏‏‏‏‏‏عَنْ أَبِي رَبِيعَةَ الْإِيَادِيِّ، ‏‏‏‏‏‏عَنْ ابْنِ بُرَيْدَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِعَلِيٍّ:‏‏‏‏ يَا عَلِيُّ، ‏‏‏‏‏‏لَا تُتْبِعِ النَّظْرَةَ النَّظْرَةَ، ‏‏‏‏‏‏فَإِنَّ لَكَ الْأُولَى وَلَيْسَتْ لَكَ الْآخِرَةُ ."
      },
      {
        "id": 21229,
        "hadith_number": "2150",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Wanita Menyentuh Badan Wanita Lain dan Menceritakannya kepada Suami",
        "perawi_melayu": "Diriwayatkan daripada Ibn Mas'ud RA bahawa Rasulullah SAW bersabda",
        "english_text": "Ibn Masud reported the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم as saying “ A woman should not rub her body directly with the body of another woman so that she describes it to her husband as if he were looking at her. ”",
        "malay_translation": "Daripada Ibn Mas'ud RA, Rasulullah SAW bersabda: “Seorang wanita tidak sepatutnya menyentuh badan wanita lain secara langsung, kemudian menceritakannya kepada suaminya seolah-olah suaminya melihatnya sendiri.”",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو عَوَانَةَ، ‏‏‏‏‏‏عَنْ الْأَعْمَشِ، ‏‏‏‏‏‏عَنْ أَبِي وَائِلٍ، ‏‏‏‏‏‏عَنْ ابْنِ مَسْعُودٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تُبَاشِرُ الْمَرْأَةُ الْمَرْأَةَ لِتَنْعَتَهَا لِزَوْجِهَا كَأَنَّمَا يَنْظُرُ إِلَيْهَا ."
      },
      {
        "id": 21230,
        "hadith_number": "2151",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Wanita Datang dalam Rupa Syaitan: Anjuran Menemui Isteri Ketika Terasa Godaan",
        "perawi_melayu": "Diriwayatkan daripada Jabir RA",
        "english_text": "Jabir said “The Prophet صلی ‌اللہ ‌علیہ ‌وسلم saw a woman so he entered upon Zainab daughter of Jahsh and had intercourse with her. He صلی ‌اللہ ‌علیہ ‌وسلم then came out and said to his companions and said to them “A woman advances in the form of a devil. When one of you finds that he should go to his wife (and have intercourse with her) for that will repel what he is feeling.",
        "malay_translation": "Jabir RA berkata, “Nabi ﷺ melihat seorang wanita, lalu Baginda masuk menemui Zainab binti Jahsh dan menunaikan hajatnya (bersetubuh) dengannya. Kemudian Baginda ﷺ keluar menemui para sahabatnya dan bersabda kepada mereka, “Sesungguhnya wanita itu datang dalam rupa syaitan. Maka, barangsiapa di antara kamu yang mendapati sesuatu (perasaan) seperti itu, hendaklah dia mendatangi isterinya (dan bersetubuh dengannya), kerana itu akan menolak apa yang dirasakannya.”",
        "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏حَدَّثَنَا هِشَامٌ، ‏‏‏‏‏‏عَنْ أَبِي الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ جَابِرٍ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى امْرَأَةً فَدَخَلَ عَلَى زَيْنَبَ بِنْتِ جَحْشٍ فَقَضَى حَاجَتَهُ مِنْهَا، ‏‏‏‏‏‏ثُمَّ خَرَجَ إِلَى أَصْحَابِهِ، ‏‏‏‏‏‏فَقَالَ لَهُمْ:‏‏‏‏ إِنَّ الْمَرْأَةَ تُقْبِلُ فِي صُورَةِ شَيْطَانٍ، ‏‏‏‏‏‏فَمَنْ وَجَدَ مِنْ ذَلِكَ شَيْئًا فَلْيَأْتِ أَهْلَهُ، ‏‏‏‏‏‏فَإِنَّهُ يُضْمِرُ مَا فِي نَفْسِهِ ."
      },
      {
        "id": 21231,
        "hadith_number": "2152",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Bahagian Zina yang Ditentukan untuk Anak Adam",
        "perawi_melayu": "Ibn Abbas berkata, “Aku tidak melihat sesuatu yang lebih menyerupai dosa-dosa kecil daripada apa yang diriwayatkan oleh Abu Hurairah daripada Nabi ﷺ yang bersabda, “Allah telah menetapkan bagi anak-anak Adam bahagian dalam zina, dia pasti akan mendapatkannya dengan segala cara, zina mata adalah melihat; zina lidah adalah berbicara; jiwa berkeinginan dan mempunyai nafsu; kemaluan mengesahkan atau mendustakannya.”",
        "english_text": "Ibn Abbas said “I did not see anything more resembling to minor sins than what Abu Hurairah reported from the Prophet صلی ‌اللہ ‌علیہ ‌وسلم who said “Allaah has decreed for the children of Adam a share in adultery, he will get it by all means, the adultery of eyes is looking; the adultery of tongue is speaking; the soul desires and has a passion; the private parts confirms or falsifies it. ”",
        "malay_translation": "Ibn Abbas berkata: “Aku tidak melihat sesuatu yang lebih menyerupai dosa-dosa kecil (Al-Lamam) daripada apa yang diriwayatkan oleh Abu Hurairah daripada Nabi ﷺ yang bersabda: “Sesungguhnya Allah telah menetapkan bagi setiap anak Adam bahagiannya daripada zina, dan dia pasti akan mendapatkannya. Zina mata adalah dengan melihat, zina lidah adalah dengan berbicara, dan jiwa berkeinginan serta berhasrat (untuk berzina), manakala kemaluan akan membenarkan atau mendustakannya.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ ثَوْرٍ، ‏‏‏‏‏‏عَنْ مَعْمَرٍ، ‏‏‏‏‏‏أَخْبَرَنَا ابْنُ طَاوُسٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَا رَأَيْتُ شَيْئًا أَشْبَهَ بِاللَّمَمِ مِمَّا قَالَ أَبُو هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏ إِنَّ اللَّهَ كَتَبَ عَلَى ابْنِ آدَمَ حَظَّهُ مِنَ الزِّنَا أَدْرَكَ ذَلِكَ لَا مَحَالَةَ، ‏‏‏‏‏‏فَزِنَا الْعَيْنَيْنِ النَّظَرُ، ‏‏‏‏‏‏وَزِنَا اللِّسَانِ الْمَنْطِقُ، ‏‏‏‏‏‏وَالنَّفْسُ تَمَنَّى وَتَشْتَهِي، ‏‏‏‏‏‏وَالْفَرْجُ يُصَدِّقُ ذَلِكَ وَيُكَذِّبُهُ ."
      },
      {
        "id": 21232,
        "hadith_number": "2153",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Setiap Anak Adam Ada Bahagian dalam Zina",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA bahawa Nabi Muhammad SAW bersabda",
        "english_text": "Abu Hurairah reported the Prophet صلی ‌اللہ ‌علیہ ‌وسلم as saying “ Every child of Adam has his share in adultery. He then narrated the rest of the tradition. This version goes “And the hands commit adultery; their adultery is catching; and the legs commit adultery; their adultery is walking; and the mouth commits adultery – its adultery is kissing. ”",
        "malay_translation": "Abu Hurairah RA meriwayatkan bahawa Nabi Muhammad SAW bersabda: “Setiap anak Adam mempunyai bahagiannya dalam zina.” Kemudian Baginda menceritakan saki-baki hadis tersebut. Dalam riwayat ini disebutkan: “Dan tangan berzina; zina mereka adalah menyentuh; dan kaki berzina; zina mereka adalah berjalan; dan mulut berzina – zina mereka adalah mencium.”",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادٌ، ‏‏‏‏‏‏عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لِكُلِّ ابْنِ آدَمَ حَظُّهُ مِنَ الزِّنَا ، ‏‏‏‏‏‏بِهَذِهِ الْقِصَّةِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَالْيَدَانِ تَزْنِيَانِ فَزِنَاهُمَا الْبَطْشُ، ‏‏‏‏‏‏وَالرِّجْلَانِ تَزْنِيَانِ فَزِنَاهُمَا الْمَشْيُ، ‏‏‏‏‏‏وَالْفَمُ يَزْنِي فَزِنَاهُ الْقُبَلُ ."
      },
      {
        "id": 21233,
        "hadith_number": "2154",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Zina Telinga adalah Mendengar (Perbuatan Dosa)",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah",
        "english_text": "The aforesaid tradition has also been transmitted by Abu Hurairah through a different chain of narrators. This version adds “The fornication of ear is hearing. ”",
        "malay_translation": "Hadis yang disebutkan di atas juga diriwayatkan oleh Abu Hurairah melalui sanad yang berbeza. Versi ini menambah, \"Zina telinga adalah mendengar (perkara yang dilarang).\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، ‏‏‏‏‏‏حَدَّثَنَا اللَّيْثُ، ‏‏‏‏‏‏عَنْ ابْنِ عَجْلَانَ، ‏‏‏‏‏‏عَنْ الْقَعْقَاعِ بْنِ حَكِيمٍ، ‏‏‏‏‏‏عَنْ أَبِي صَالِحٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏بِهَذِهِ الْقِصَّةِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَالْأُذُنُ زِنَاهَا الِاسْتِمَاعُ ."
      },
      {
        "id": 21234,
        "hadith_number": "2155",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukum Menyetubuhi Tawanan Wanita yang Bersuami Setelah Selesai Tempoh 'Iddah",
        "perawi_melayu": "Abu Saeed Al Khudri",
        "english_text": "Abu Saeed Al Khudri said “The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم sent a military expedition to Awtas on the occasion of the battle of Hunain. They met their enemy and fought with them. They defeated them and took them captives. Some of the Companions of Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم were reluctant to have intercourse with the female captives in the presence of their husbands who were unbelievers. So, Allaah the exalted sent down the Quranic verse “And all married women (are forbidden) unto you save those (captives) whom your right hand posses. ” This is to say they are lawful for them when they complete their waiting period.",
        "malay_translation": "Abu Saeed Al Khudri berkata, “Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم telah menghantar ekspedisi ketenteraan ke Awtas pada peristiwa peperangan Hunain. Mereka bertemu musuh mereka dan berperang dengan mereka. Mereka mengalahkan mereka dan menjadikan mereka tawanan. Beberapa sahabat Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم merasa keberatan untuk melakukan hubungan kelamin dengan tawanan wanita di hadapan suami mereka yang kafir. Maka, Allah Taala menurunkan ayat Al-Quran, “Dan (diharamkan juga kamu mengahwini) perempuan-perempuan bersuami, kecuali hamba-hamba perempuan yang kamu miliki (sebagai tawanan perang). ” Ini bermakna mereka halal bagi mereka apabila mereka selesai tempoh 'iddah mereka.",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، ‏‏‏‏‏‏حَدَّثَنَا سَعِيدٌ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ صَالِحٍ أَبِي الْخَلِيلِ، ‏‏‏‏‏‏عَنْأَبِي عَلْقَمَةَ الْهَاشِمِيِّ،‏‏‏‏عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ يَوْمَ حُنَيْنٍ بَعْثًا إِلَى أَوْطَاسَ، ‏‏‏‏‏‏فَلَقُوا عَدُوَّهُمْ فَقَاتَلُوهُمْ فَظَهَرُوا عَلَيْهِمْ وَأَصَابُوا لَهُمْ سَبَايَا، ‏‏‏‏‏‏فَكَأَنَّ أُنَاسًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَحَرَّجُوا مِنْ غِشْيَانِهِنَّ مِنْ أَجْلِ أَزْوَاجِهِنَّ مِنَ الْمُشْرِكِينَ، ‏‏‏‏‏‏فَأَنْزَلَ اللَّهُ تَعَالَى فِي ذَلِكَ:‏‏‏‏ وَالْمُحْصَنَاتُ مِنَ النِّسَاءِ إِلا مَا مَلَكَتْ أَيْمَانُكُمْ سورة النساء آية 24، ‏‏‏‏‏‏أَيْ فَهُنَّ لَهُمْ حَلَالٌ إِذَا انْقَضَتْ عِدَّتُهُنَّ ."
      },
      {
        "id": 21235,
        "hadith_number": "2156",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Ancaman Terhadap Hubungan Seksual dengan Wanita Hamil di Luar Nikah",
        "perawi_melayu": "Diriwayatkan dari Abu Al Darda' RA",
        "english_text": "Abu Al Darda said “The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم was in a battle. He saw a woman who was nearing the time when she was to deliver a child. “He said “Perhaps the master has intercourse with her. ”. They (the people) said “Yes”. He said “I am inclined to invoke a curse on him which will enter his grave with him. How can he make it (the child) an heir when it is not lawful for him? How can he take it into his service when that is not lawful for him?”",
        "malay_translation": "Abu Al Darda' berkata, “Rasulullah SAW berada dalam sebuah peperangan. Baginda melihat seorang wanita yang hampir melahirkan anak. Baginda bersabda, “Barangkali tuannya telah melakukan hubungan seks dengannya.” Mereka (orang ramai) berkata, “Ya.” Baginda bersabda, “Sesungguhnya aku cenderung untuk melaknatnya dengan laknat yang akan masuk bersamanya ke dalam kuburnya. Bagaimana dia boleh menjadikannya (anak itu) sebagai pewaris sedangkan ia tidak halal baginya? Bagaimana dia boleh mengambilnya sebagai khadam sedangkan itu tidak halal baginya?”",
        "arabic_text": "حَدَّثَنَا النُّفَيْلِيُّ، ‏‏‏‏‏‏حَدَّثَنَا مِسْكِينٌ، ‏‏‏‏‏‏حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ يَزِيدَ بْنِ خُمَيْرٍ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أَبِي الدَّرْدَاءِ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ فِي غَزْوَةٍ فَرَأَى امْرَأَةً مُجِحًّا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ لَعَلَّ صَاحِبَهَا أَلَمَّ بِهَا ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ لَقَدْ هَمَمْتُ أَنْ أَلْعَنَهُ لَعْنَةً تَدْخُلُ مَعَهُ فِي قَبْرِهِ، ‏‏‏‏‏‏كَيْفَ يُوَرِّثُهُ وَهُوَ لَا يَحِلُّ لَهُ، ‏‏‏‏‏‏وَكَيْفَ يَسْتَخْدِمُهُ وَهُوَ لَا يَحِلُّ لَهُ ."
      },
      {
        "id": 21236,
        "hadith_number": "2157",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukum Berhubung dengan Tawanan Perang di Autas: Larangan Menyetubuhi Wanita Hamil dan Wanita Tidak Hamil",
        "perawi_melayu": "Diriwayatkan daripada Abu Sa'id al-Khudri, daripada Nabi ﷺ",
        "english_text": "Abu Saeed Al Khudri traced to Prophet صلی ‌اللہ ‌علیہ ‌وسلم the following statement regarding the captives taken at Atwas. There must be no intercourse with pregnant woman till she gives birth to her child or with the one who is not pregnant till she has had one menstrual period.",
        "malay_translation": "Abu Sa'id Al Khudri meriwayatkan daripada Nabi ﷺ pernyataan berikut mengenai tawanan yang diambil di Autas. Tidak boleh bersetubuh dengan wanita hamil sehingga dia melahirkan anaknya atau dengan wanita yang tidak hamil sehingga dia mengalami satu tempoh haid.",
        "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، ‏‏‏‏‏‏أَخْبَرَنَا شَرِيكٌ، ‏‏‏‏‏‏عَنْ قَيْسِ بْنِ وَهْبٍ، ‏‏‏‏‏‏عَنْ أَبِي الْوَدَّاكِ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، ‏‏‏‏‏‏وَرَفَعَهُ، ‏‏‏‏‏‏أَنَّهُ قَالَ فِي سَبَايَا أَوْطَاسَ:‏‏‏‏ لَا تُوطَأُ حَامِلٌ حَتَّى تَضَعَ، ‏‏‏‏‏‏وَلَا غَيْرُ ذَاتِ حَمْلٍ حَتَّى تَحِيضَ حَيْضَةً ."
      },
      {
        "id": 21237,
        "hadith_number": "2158",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Terhadap Perbuatan yang Tidak Dibolehkan Bagi Seorang Mukmin",
        "perawi_melayu": "Diriwayatkan daripada Ruwayfi' ibn Thabit al-Ansari: Patutkah aku beritahu kamu apa yang aku dengar Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda pada hari Hunayn: Tidak halal bagi seorang lelaki yang beriman kepada Allah dan hari akhirat untuk menyiram airnya (mani) ke dalam tanaman orang lain (bermaksud bersetubuh dengan wanita yang hamil); tidak halal bagi seorang lelaki yang beriman kepada Allah dan hari akhirat untuk bersetubuh dengan wanita tawanan sehingga dia bersih daripada haid; dan tidak halal bagi seorang lelaki yang beriman kepada Allah dan hari akhirat untuk menjual harta rampasan perang sehingga ia dibahagikan.",
        "english_text": "Narrated Ruwayfi ibn Thabit al-Ansari: Should I tell you what I heard the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم say on the day of Hunayn: It is not lawful for a man who believes in Allah and the last day to water what another has sown with his water (meaning intercourse with women who are pregnant); it is not lawful for a man who believes in Allah and the Last Day to have intercourse with a captive woman till she is free from a menstrual course; and it is not lawful for a man who believes in Allah and the Last Day to sell spoil till it is divided.",
        "malay_translation": "Diriwayatkan daripada Ruwayfi' ibn Thabit al-Ansari: Patutkah aku beritahu kamu apa yang aku dengar Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم bersabda pada hari Hunayn: Tidak halal bagi seorang lelaki yang beriman kepada Allah dan hari akhirat untuk menyiram airnya ke dalam tanaman orang lain (iaitu, bersetubuh dengan wanita yang hamil); tidak halal bagi seorang lelaki yang beriman kepada Allah dan hari akhirat untuk bersetubuh dengan wanita tawanan sehingga dia bersih daripada haid; dan tidak halal bagi seorang lelaki yang beriman kepada Allah dan hari akhirat untuk menjual harta rampasan perang sehingga ia dibahagikan.",
        "arabic_text": "حَدَّثَنَا النُّفَيْلِيُّ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، ‏‏‏‏‏‏حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، ‏‏‏‏‏‏عَنْ أَبِي مَرْزُوقٍ، ‏‏‏‏‏‏عَنْحَنَشٍ الصَّنْعَانِيِّ، ‏‏‏‏‏‏عَنْ رُوَيْفِعِ بْنِ ثَابِتٍ الْأَنْصَارِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَامَ فِينَا خَطِيبًا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَمَا إِنِّي لَا أَقُولُ لَكُمْ إِلَّا مَا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَوْمَ حُنَيْنٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا يَحِلُّ لِامْرِئٍ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ يَسْقِيَ مَاءَهُ زَرْعَ غَيْرِهِ، ‏‏‏‏‏‏يَعْنِي إِتْيَانَ الْحَبَالَى، ‏‏‏‏‏‏وَلَا يَحِلُّ لِامْرِئٍ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ يَقَعَ عَلَى امْرَأَةٍ مِنَ السَّبْيِ حَتَّى يَسْتَبْرِئَهَا، ‏‏‏‏‏‏وَلَا يَحِلُّ لِامْرِئٍ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ يَبِيعَ مَغْنَمًا حَتَّى يُقْسَمَ ."
      },
      {
        "id": 21238,
        "hadith_number": "2159",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Menyalahgunakan Ghanimah (Harta Rampasan Perang) dan Pembetulan Riwayat tentang Haid",
        "perawi_melayu": "Diriwayatkan oleh Ibn Ishaq melalui sanad yang berbeza.",
        "english_text": "The aforesaid tradition has also been transmitted by Ibn Ishaq through a different chain of narrators. This version has the traditional word “a menstrual course” in the phrase “till she is free from a menstrual course”. This is a misunderstanding on the part of the narrator Abu Muawiyah. This is correct in the tradition of Abu Saeed Al Khudri. This version has the additional words “he who believes in Allaah and the Last Day should not ride on a mount belonging to the spoil of Muslims and when he makes it emaciated returns it; he who believes in Allaah and the Last Day should not put on cloth belonging to the spoils of Muslims and when makes it old (shabby) returns it. Abu Dawud said “The word “menstrual course” is not guarded. This is a misunderstanding on the part of Abu Muawiyah”",
        "malay_translation": "Hadis yang disebutkan di atas juga diriwayatkan oleh Ibn Ishaq melalui rantai perawi yang berbeza. Versi ini mempunyai perkataan tradisional “haid” dalam frasa “sehingga dia bersih dari haid”. Ini adalah kesalahfahaman dari pihak perawi Abu Muawiyah. Ini adalah betul dalam riwayat Abu Sa'eed Al Khudri. Versi ini mempunyai tambahan perkataan “Sesiapa yang beriman kepada Allah dan Hari Akhirat tidak seharusnya menunggang haiwan tunggangan daripada harta rampasan (ghanimah) kaum Muslimin, dan apabila dia membuatnya kurus, dia harus mengembalikannya; sesiapa yang beriman kepada Allah dan Hari Akhirat tidak seharusnya memakai kain daripada harta rampasan kaum Muslimin, dan apabila dia membuatnya usang (lusuh), dia harus mengembalikannya. Abu Dawood berkata “Perkataan 'haid' tidak terpelihara. Ini adalah kesalahfahaman dari pihak Abu Muawiyah.”",
        "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو مُعَاوِيَةَ، ‏‏‏‏‏‏عَنْ ابْنِ إِسْحَاقَ بِهَذَا الْحَدِيثِ، ‏‏‏‏‏‏قَالَ حَتَّى يَسْتَبْرِئَهَا بِحَيْضَةٍ ، ‏‏‏‏‏‏زَادَ فِيهِ:‏‏‏‏ حَيْضَةٍ وَهُوَ وَهْمٌ مِنْ أَبِي مُعَاوِيَةَ، ‏‏‏‏‏‏وَهُوَ صَحِيحٌ فِي حَدِيثِ أَبِي سَعِيدٍ، ‏‏‏‏‏‏زَادَ:‏‏‏‏ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا يَرْكَبْ دَابَّةً مِنْ فَيْءِ الْمُسْلِمِينَ حَتَّى إِذَا أَعْجَفَهَا رَدَّهَا فِيهِ، ‏‏‏‏‏‏وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا يَلْبَسْ ثَوْبًا مِنْ فَيْءِ الْمُسْلِمِينَ حَتَّى إِذَا أَخْلَقَهُ رَدَّهُ فِيهِ . قَالَ أَبُو دَاوُد:‏‏‏‏ الْحَيْضَةُ لَيْسَتْ بِمَحْفُوظَةٍ، ‏‏‏‏‏‏وَهُوَ وَهْمٌ مِنْ أَبِي مُعَاوِيَةَ."
      },
      {
        "id": 21239,
        "hadith_number": "2160",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Doa Ketika Berkahwin atau Membeli Hamba dan Unta",
        "perawi_melayu": "Amr bin Shuaib meriwayatkan daripada bapanya, daripada datuknya (Abdullah ibn Amr ibn al-As) melaporkan bahawa Nabi ﷺ bersabda:",
        "english_text": "Amr bin Shuaib on his father's authority said that his grandfather (Abdullah ibn Amr ibn al-As) reported the Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: If one of you marries a woman or buys a slave, he should say: O Allah, I ask You for the good in her, and in the disposition You have given her; I take refuge in You from the evil in her, and in the disposition You have given her. When he buys a camel, he should take hold of the top of its hump and say the same kind of thing. Abu Dawud said: Abu Saeed added the following words in his version: He should then tale hold of her forelock and pray for blessing in the case of a woman or a slave.",
        "malay_translation": "Amr bin Shuaib meriwayatkan daripada bapanya, daripada datuknya (Abdullah ibn Amr ibn al-As) melaporkan bahawa Nabi ﷺ bersabda: \"Jika salah seorang daripada kamu berkahwin dengan seorang wanita atau membeli seorang hamba, maka hendaklah dia berkata: 'Ya Allah, aku memohon kepada-Mu kebaikan yang ada padanya, dan kebaikan yang telah Engkau ciptakan padanya; aku berlindung kepada-Mu daripada keburukan yang ada padanya, dan keburukan yang telah Engkau ciptakan padanya.' Apabila dia membeli seekor unta, hendaklah dia memegang bahagian atas bonggolnya dan mengucapkan perkara yang sama.\" Abu Dawud berkata: Abu Sa'id menambahkan perkataan berikut dalam riwayatnya: \"Kemudian hendaklah dia memegang ubun-ubunnya dan berdoa memohon keberkatan dalam hal wanita atau hamba tersebut.\"",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏وَعَبْدُ اللَّهِ بْنُ سَعِيدٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا أَبُو خَالِدٍ يَعْنِي سُلَيْمَانَ بْنَ حَيَّانَ، ‏‏‏‏‏‏عَنْ ابْنِ عَجْلَانَ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ،‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِذَا تَزَوَّجَ أَحَدُكُمُ امْرَأَةً أَوِ اشْتَرَى خَادِمًا، ‏‏‏‏‏‏فَلْيَقُلْ:‏‏‏‏ اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا وَخَيْرَ مَا جَبَلْتَهَا عَلَيْهِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَمِنْ شَرِّ مَا جَبَلْتَهَا عَلَيْهِ، ‏‏‏‏‏‏وَإِذَا اشْتَرَى بَعِيرًا فَلْيَأْخُذْ بِذِرْوَةِ سَنَامِهِ وَلْيَقُلْ مِثْلَ ذَلِكَ . قَالَ أَبُو دَاوُد:‏‏‏‏ زَادَ أَبُو سَعِيدٍ:‏‏‏‏ ثُمَّ لِيَأْخُذْ بِنَاصِيَتِهَا وَلْيَدْعُ بِالْبَرَكَةِ فِي الْمَرْأَةِ وَالْخَادِمِ."
      },
      {
        "id": 21240,
        "hadith_number": "2161",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Perlindungan Anak daripada Syaitan ketika Bersama Isteri",
        "perawi_melayu": "Diriwayatkan daripada Ibn Abbas RA, Nabi SAW bersabda",
        "english_text": "Ibn Abbas reported the Prophet صلی ‌اللہ ‌علیہ ‌وسلم as saying “If anyone who means to have intercourse with his wife says “In the name of Allaah, O Allaah, keep us away from the devil and keep the devil away from what You hast provided us. ” It will be ordained that no devil will ever harm the child born to them.",
        "malay_translation": "Ibn Abbas meriwayatkan bahawa Nabi SAW bersabda, “Jika seseorang yang ingin melakukan hubungan dengan isterinya membaca, “Dengan nama Allah, Ya Allah, jauhkan kami daripada syaitan dan jauhkan syaitan daripada apa yang Engkau rezekikan kepada kami.” Maka telah ditakdirkan bahawa tidak ada syaitan yang akan membahayakan anak yang dilahirkan kepada mereka.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، ‏‏‏‏‏‏حَدَّثَنَا جَرِيرٌ، ‏‏‏‏‏‏عَنْ مَنْصُورٍ، ‏‏‏‏‏‏عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، ‏‏‏‏‏‏عَنْ كُرَيْبٍ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَوْ أَنَّ أَحَدَكُمْ إِذَا أَرَادَ أَنْ يَأْتِيَ أَهْلَهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ بِسْمِ اللَّهِ، ‏‏‏‏‏‏اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ وَجَنِّبْ الشَّيْطَانَ مَا رَزَقْتَنَا، ‏‏‏‏‏‏ثُمَّ قُدِّرَ أَنْ يَكُونَ بَيْنَهُمَا وَلَدٌ فِي ذَلِكَ لَمْ يَضُرَّهُ شَيْطَانٌ أَبَدًا ."
      },
      {
        "id": 21241,
        "hadith_number": "2162",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Menjimak Isteri Melalui Dubur",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA:",
        "english_text": "Narrated Abu Hurairah: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: He who has intercourse with his wife through her anus is accursed.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah RA: Nabi Muhammad SAW bersabda: “Sesiapa yang melakukan persetubuhan dengan isterinya melalui duburnya, maka dia dilaknat.”",
        "arabic_text": "حَدَّثَنَا هَنَّادٌ، ‏‏‏‏‏‏عَنْ وَكِيعٍ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، ‏‏‏‏‏‏عَنْ الْحَارِثِ بْنِ مَخْلَدٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَلْعُونٌ مَنْ أَتَى امْرَأَتَهُ فِي دُبُرِهَا ."
      },
      {
        "id": 21242,
        "hadith_number": "2163",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Penjelasan Ayat: Isteri adalah Ladang Kamu, Datangilah Ladang Kamu Bagaimana Kamu Suka",
        "perawi_melayu": "Muhammad bin Al Munkadir berkata: Aku mendengar Jabir berkata",
        "english_text": "Muhammad bin Al Munkadir said I heard Jabir say The Jews used to say “When a man has intercourse with his wife through the vagina, but being on her back the child will have a squint, so the verse came down. Your wives are a tilth to you, so come to your tilth however you will. ”",
        "malay_translation": "Muhammad bin Al Munkadir berkata: Aku mendengar Jabir berkata: Orang Yahudi pernah berkata, “Apabila seorang lelaki bersetubuh dengan isterinya melalui farajnya, tetapi isterinya berada di belakang, anak itu akan juling.” Maka turunlah ayat: Isteri-isteri kamu adalah ladang bagi kamu, maka datangilah ladang kamu bagaimana sahaja kamu suka.",
        "arabic_text": "حَدَّثَنَا ابْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّحْمَنِ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ جَابِرًا، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ إِنَّ الْيَهُودَ يَقُولُونَ:‏‏‏‏ إِذَا جَامَعَ الرَّجُلُ أَهْلَهُ فِي فَرْجِهَا مِنْ وَرَائِهَا كَانَ وَلَدُهُ أَحْوَلَ، ‏‏‏‏‏‏فَأَنْزَلَ اللَّهُ سُبْحَانَهُ وَتَعَالَى:‏‏‏‏ نِسَاؤُكُمْ حَرْثٌ لَكُمْ فَأْتُوا حَرْثَكُمْ أَنَّى شِئْتُمْ سورة البقرة آية 223 ."
      },
      {
        "id": 21243,
        "hadith_number": "2164",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Penjelasan Ayat: 'Isteri-isteri Kamu Adalah Ladang Kamu'",
        "perawi_melayu": "Diriwayatkan daripada Abdullah Ibn Abbas:",
        "english_text": "Narrated Abdullah Ibn Abbas: Ibn Umar misunderstood (the Quranic verse, So come to your tilth however you will )--may Allah forgive him. The fact is that this clan of the Ansar, who were idolaters, lived in the company of the Jews who were the people of the Book. They (the Ansar) accepted their superiority over themselves in respect of knowledge, and they followed most of their actions. The people of the Book (i. e. the Jews) used to have intercourse with their women on one side alone (i. e. lying on their backs). This was the most concealing position for (the vagina of) the women. This clan of the Ansar adopted this practice from them. But this tribe of the Quraysh used to uncover their women completely, and seek pleasure with them from in front and behind and laying them on their backs. When the muhajirun (the immigrants) came to Madina, a man married a woman of the Ansar. He began to do the same kind of action with her, but she disliked it, and said to him: We were approached on one side (i. e. lying on the back); do it so, otherwise keep away from me. This matter of theirs spread widely, and it reached the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم. So Allah, the Exalted, sent down the Quranic verse: Your wives are a tilth to you, so come to your tilth however you will, i. e. from in front, from behind or lying on the back. But this verse meant the place of the delivery of the child, i. e. the vagina.",
        "malay_translation": "Diriwayatkan daripada Abdullah Ibn Abbas: Ibn Umar salah faham (ayat Al-Quran, 'Maka datangilah ladang kamu bagaimana sahaja kamu mahu') - semoga Allah mengampuninya. Hakikatnya adalah bahawa klan Ansar ini, yang dahulunya penyembah berhala, tinggal bersama orang Yahudi yang merupakan Ahli Kitab. Mereka (kaum Ansar) menerima keunggulan mereka (Yahudi) dalam hal ilmu, dan mereka mengikuti kebanyakan tindakan mereka. Ahli Kitab (iaitu orang Yahudi) dahulunya melakukan persetubuhan dengan wanita mereka hanya pada satu sisi sahaja (iaitu berbaring terlentang). Ini adalah kedudukan yang paling menutup (vagina) wanita. Klan Ansar ini mengamalkan amalan ini daripada mereka. Tetapi suku Quraisy ini biasa mendedahkan wanita mereka sepenuhnya, dan mencari kesenangan dengan mereka dari depan dan belakang serta membaringkan mereka terlentang. Ketika kaum Muhajirin (para pendatang) datang ke Madinah, seorang lelaki menikahi seorang wanita Ansar. Dia mula melakukan tindakan yang sama dengannya, tetapi dia tidak menyukainya, dan berkata kepadanya: Kami didekati di satu sisi (iaitu berbaring terlentang); lakukanlah demikian, jika tidak jauhi aku. Perkara mereka ini tersebar luas, dan sampai kepada Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم. Maka Allah, Yang Maha Tinggi, menurunkan ayat Al-Quran: Isteri-isteri kamu adalah ladang kamu, maka datangilah ladang kamu bagaimana sahaja kamu mahu, iaitu dari depan, dari belakang atau berbaring terlentang. Tetapi ayat ini bermaksud tempat kelahiran anak, iaitu vagina.",
        "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى أَبُو الْأَصْبَغِ، ‏‏‏‏‏‏حَدَّثَنِي مُحَمَّدٌ يَعْنِي ابْنَ سَلَمَةَ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، ‏‏‏‏‏‏عَنْ أَبَانَ بْنِ صَالِحٍ، ‏‏‏‏‏‏عَنْ مُجَاهِدٍ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنَّ ابْنَ عُمَرَ وَاللَّهُ يَغْفِرُ لَهُ أَوْهَمَ إِنَّمَا كَانَ هَذَا الْحَيُّ مِنْ الْأَنْصَارِ وَهُمْ أَهْلُ وَثَنٍ مَعَ هَذَا الْحَيِّ مِنْ يَهُودَ وَهُمْ أَهْلُ كِتَابٍ، ‏‏‏‏‏‏وَكَانُوا يَرَوْنَ لَهُمْ فَضْلًا عَلَيْهِمْ فِي الْعِلْمِ فَكَانُوا يَقْتَدُونَ بِكَثِيرٍ مِنْ فِعْلِهِمْ، ‏‏‏‏‏‏وَكَانَ مِنْ أَمْرِ أَهْلِ الْكِتَابِ أَنْ لَا يَأْتُوا النِّسَاءَ إِلَّا عَلَى حَرْفٍ وَذَلِكَ أَسْتَرُ مَا تَكُونُ الْمَرْأَةُ، ‏‏‏‏‏‏فَكَانَ هَذَا الْحَيُّ مِنْ الْأَنْصَارِ قَدْ أَخَذُوا بِذَلِكَ مِنْ فِعْلِهِمْ، ‏‏‏‏‏‏وَكَانَ هَذَا الْحَيُّ مِنْ قُرَيْشٍ يَشْرَحُونَ النِّسَاءَ شَرْحًا مُنْكَرًا وَيَتَلَذَّذُونَ مِنْهُنَّ مُقْبِلَاتٍ وَمُدْبِرَاتٍ وَمُسْتَلْقِيَاتٍ، ‏‏‏‏‏‏فَلَمَّا قَدِمَ الْمُهَاجِرُونَ الْمَدِينَةَ تَزَوَّجَ رَجُلٌ مِنْهُمُ امْرَأَةً مِنْ الْأَنْصَارِ فَذَهَبَ يَصْنَعُ بِهَا ذَلِكَ فَأَنْكَرَتْهُ عَلَيْهِ، ‏‏‏‏‏‏وَقَالَتْ:‏‏‏‏ إِنَّمَا كُنَّا نُؤْتَى عَلَى حَرْفٍ، ‏‏‏‏‏‏فَاصْنَعْ ذَلِكَ وَإِلَّا فَاجْتَنِبْنِي، ‏‏‏‏‏‏حَتَّى شَرِيَ أَمْرُهُمَا، ‏‏‏‏‏‏فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ:‏‏‏‏ نِسَاؤُكُمْ حَرْثٌ لَكُمْ فَأْتُوا حَرْثَكُمْ أَنَّى شِئْتُمْ سورة البقرة آية 223، ‏‏‏‏‏‏أَيْ مُقْبِلَاتٍ وَمُدْبِرَاتٍ وَمُسْتَلْقِيَاتٍ، ‏‏‏‏‏‏يَعْنِي بِذَلِكَ مَوْضِعَ الْوَلَدِ."
      },
      {
        "id": 21244,
        "hadith_number": "2165",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Adab Ketika Haid: Perbezaan Amalan Yahudi dan Ajaran Islam",
        "perawi_melayu": "Anas bin Malik meriwayatkan",
        "english_text": "Anas bin Malik said Among the Jews when a woman menstruated, they did not eat with her and drink with her and did not associate with her in their houses, so the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم was questioned about it. Hence, Allah the Exalted revealed “And they ask you about menstruation, . Say “It is harmful, so keep aloof from women during menstruation till the end of the verse. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said “Associate with them in the houses and do everything except sexual intercourse. The Jews thereupon said “This man does not leave anything we do without opposing us in it. Usaid bin Hudair and Abbad bin Bishr came to the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم and said, Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم the Jews are saying such and such. Shall we not have intercourse with them during their menstruation? The face of the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم underwent such a change that we thought he was angry with them, so they went out. They were met by a gift of milk which was being brought to the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم and he sent after them, whereby we felt that he was not angry with them.",
        "malay_translation": "Anas bin Malik berkata: Di kalangan orang Yahudi, apabila seorang wanita datang haid, mereka tidak makan dan minum bersamanya, dan tidak bergaul dengannya di dalam rumah mereka. Lalu Rasulullah ﷺ ditanya tentang perkara itu. Maka, Allah Yang Maha Tinggi menurunkan firman-Nya: “Dan mereka bertanya kepadamu (wahai Muhammad) mengenai (hukum) haid. Katakanlah: 'Haid itu adalah suatu yang kotor (menjijikkan) oleh itu hendaklah kamu menjauhkan diri dari perempuan (isteri) ketika datang haid'” hingga akhir ayat. Rasulullah ﷺ bersabda: “Bergaullah dengan mereka (isteri-isteri kamu) di dalam rumah dan lakukanlah segala sesuatu kecuali persetubuhan.” Orang-orang Yahudi lalu berkata: “Orang ini (Muhammad) tidak meninggalkan satu pun dari amalan kami melainkan dia menentang kami di dalamnya.” Usaid bin Hudair dan Abbad bin Bishr datang kepada Rasulullah ﷺ dan berkata: “Wahai Rasulullah, sesungguhnya orang-orang Yahudi berkata begini dan begini. Bolehkah kami tidak bersetubuh dengan mereka (isteri-isteri kami) semasa haid?” Wajah Rasulullah ﷺ berubah sehingga kami menyangka baginda marah kepada mereka, lalu mereka keluar. Mereka bertemu dengan hadiah berupa susu yang dibawa kepada Rasulullah ﷺ dan baginda menyuruh memanggil mereka semula, maka kami merasakan bahawa baginda tidak marah kepada mereka.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادٌ، ‏‏‏‏‏‏أَخْبَرَنَا ثَابِتٌ الْبُنَانِيُّ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏أَنَّ الْيَهُودَ كَانَتْ إِذَا حَاضَتْ مِنْهُمُ امْرَأَةٌ أَخْرَجُوهَا مِنَ الْبَيْتِ وَلَمْ يُؤَاكِلُوهَا وَلَمْ يُشَارِبُوهَا وَلَمْ يُجَامِعُوهَا فِي الْبَيْتِ، ‏‏‏‏‏‏فَسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ، ‏‏‏‏‏‏فَأَنْزَلَ اللَّهُ سُبْحَانَهُ وَتَعَالَى:‏‏‏‏ وَيَسْأَلُونَكَ عَنِ الْمَحِيضِ قُلْ هُوَ أَذًى فَاعْتَزِلُوا النِّسَاءَ فِي الْمَحِيضِ سورة البقرة آية 222 إِلَى آخِرِ الْآيَةِ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ جَامِعُوهُنَّ فِي الْبُيُوتِ وَاصْنَعُوا كُلَّ شَيْءٍ غَيْرَ النِّكَاحِ ، ‏‏‏‏‏‏فَقَالَتْ الْيَهُودُ:‏‏‏‏ مَا يُرِيدُ هَذَا الرَّجُلُ أَنْ يَدَعَ شَيْئًا مِنْ أَمْرِنَا إِلَّا خَالَفَنَا فِيهِ، ‏‏‏‏‏‏فَجَاءَ أُسَيْدُ بْنُ حُضَيْرٍ وَ عَبَّادُ بْنُ بِشْرٍ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَا:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِنَّ الْيَهُودَ تَقُولُ كَذَا وَكَذَا، ‏‏‏‏‏‏أَفَلَا نَنْكِحُهُنَّ فِي الْمَحِيضِ ؟ فَتَمَعَّرَ وَجْهُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى ظَنَنَّا أَنْ قَدْ وَجَدَ عَلَيْهِمَا، ‏‏‏‏‏‏فَخَرَجَا هَدِيَّةٌ مِنْ لَبَنٍ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَبَعَثَ فِي آثَارِهِمَا، ‏‏‏‏‏‏فَظَنَنَّا أَنَّهُ لَمْ يَجِدْ عَلَيْهِمَا."
      },
      {
        "id": 21245,
        "hadith_number": "2166",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Kebersihan Pakaian Ketika Haid dan Solat",
        "perawi_melayu": "Diriwayatkan daripada Aisyah, Ummul Muminin:",
        "english_text": "Narrated Aishah, Ummul Muminin: I and the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم used to lie in one cloth at night while I was menstruating. If anything from me smeared him, he washed the same place (that was smeared), and did not wash beyond it. If anything from him smeared his clothe, he washed the same place and did not wash beyond that, and prayed with it (i. e. the clothe).",
        "malay_translation": "Diriwayatkan daripada Aisyah, Ummul Muminin: Aku dan Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم biasa berbaring di dalam satu kain pada waktu malam ketika aku sedang haid. Jika sesuatu daripadaku terkena pada baginda, baginda akan membasuh tempat yang terkena sahaja, dan tidak melebihinya. Jika sesuatu daripadanya terkena pada pakaiannya, baginda akan membasuh tempat yang terkena sahaja dan tidak melebihinya, dan solat dengan pakaian itu.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ صُبْحٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ خِلَاسًا الْهَجَرِيَّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، ‏‏‏‏‏‏تَقُولُ:‏‏‏‏ كُنْتُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَبِيتُ فِي الشِّعَارِ الْوَاحِدِ وَأَنَا حَائِضٌ طَامِثٌ، ‏‏‏‏‏‏فَإِنْ أَصَابَهُ مِنِّي شَيْءٌ غَسَلَ مَكَانَهُ وَلَمْ يَعْدُهُ، ‏‏‏‏‏‏وَإِنْ أَصَابَ، ‏‏‏‏‏‏تَعْنِي ثَوْبَهُ، ‏‏‏‏‏‏مِنْهُ شَيْءٌ غَسَلَ مَكَانَهُ وَلَمْ يَعْدُهُ وَصَلَّى فِيهِ ."
      },
      {
        "id": 21246,
        "hadith_number": "2167",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Melakukan Persetubuhan Semasa Haid dengan Memakai Kain",
        "perawi_melayu": "Maimunah binti Al Harith",
        "english_text": "Maimunah daughter of Al Harith said “When the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم intended to associate and lie with any of his wives who was menstruating, he ordered her to wrap up the lower garment (loin-cloth) and then he had association with her.",
        "malay_translation": "Maimunah binti Al Harith berkata: “Apabila Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم ingin bergaul dan berbaring dengan mana-mana isterinya yang sedang haid, baginda memerintahkannya untuk memakai kain (kain bawah) dan kemudian baginda bergaul dengannya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ، ‏‏‏‏‏‏وَمُسَدَّدٌ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا حَفْصٌ، ‏‏‏‏‏‏عَنْ الشَّيْبَانِيِّ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ، ‏‏‏‏‏‏عَنْ خَالَتِهِ مَيْمُونَةَ بِنْتِ الْحَارِثِ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَرَادَ أَنْ يُبَاشِرَ امْرَأَةً مِنْ نِسَائِهِ وَهِيَ حَائِضٌ، ‏‏‏‏‏‏أَمَرَهَا أَنْ تَتَّزِرَ ثُمَّ يُبَاشِرُهَا ."
      },
      {
        "id": 21247,
        "hadith_number": "2168",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukuman bagi lelaki yang melakukan hubungan seks dengan wanita haid",
        "perawi_melayu": "Abdullah ibn Abbas RA",
        "english_text": "Narrated Abdullah ibn Abbas: The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said about a man who has sexual intercourse with a menstruating woman: He should give one or half dinar as sadaqah.",
        "malay_translation": "Diriwayatkan oleh Abdullah ibn Abbas RA: Nabi ﷺ bersabda mengenai seorang lelaki yang melakukan hubungan seks dengan seorang wanita yang sedang haid: Dia hendaklah memberi satu atau setengah dinar sebagai sedekah.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏عَنْ شُعْبَةَ، ‏‏‏‏‏‏وَغَيْرُهُ، ‏‏‏‏‏‏عَنْ سَعِيدٍ، ‏‏‏‏‏‏حَدَّثَنِي الْحَكَمُ، ‏‏‏‏‏‏عَنْ عَبْدِ الْحَمِيدِ بْنِ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْمِقْسَمٍ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الَّذِي يَأْتِي امْرَأَتَهُ وَهِيَ حَائِضٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ يَتَصَدَّقُ بِدِينَارٍ أَوْ بِنِصْفِ دِينَارٍ ."
      },
      {
        "id": 21248,
        "hadith_number": "2169",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Kafarah bagi Persetubuhan dengan Wanita Haid",
        "perawi_melayu": "Abdullah ibn Abbas meriwayatkan:",
        "english_text": "Narrated Abdullah ibn Abbas: If a man has sexual intercourse (with menstruating woman) during her bleeding, he should give one dinar as sadaqah, and if he does so when bleeding has stopped, he should give half a dinar as sadaqah.",
        "malay_translation": "Diriwayatkan oleh Abdullah ibn Abbas: Jika seorang lelaki melakukan persetubuhan (dengan wanita yang sedang haid) semasa dia berdarah, dia hendaklah memberi satu dinar sebagai sedekah, dan jika dia melakukannya ketika darah haid telah berhenti, dia hendaklah memberi setengah dinar sebagai sedekah.",
        "arabic_text": "حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ مُطَهَّرٍ، ‏‏‏‏‏‏حَدَّثَنَا جَعْفَرٌ يَعْنِي ابْنَ سُلَيْمَانَ، ‏‏‏‏‏‏عَنْ عَلِيِّ بْنِ الْحَكَمِ الْبُنَانِيِّ، ‏‏‏‏‏‏عَنْ أَبِي الْحَسَنِ الْجَزَرِيِّ، ‏‏‏‏‏‏عَنْ مِقْسَمٍ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِذَا أَصَابَهَا فِي الدَّمِ فَدِينَارٌ، ‏‏‏‏‏‏وَإِذَا أَصَابَهَا فِي انْقِطَاعِ الدَّمِ فَنِصْفُ دِينَارٍ ."
      },
      {
        "id": 21249,
        "hadith_number": "2170",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan 'Azl (Mengeluarkan Air Mani di Luar Faraj) dan Ketentuan Takdir",
        "perawi_melayu": "Abu Sa'eed meriwayatkan, “Orang ramai menyebut tentang mengeluarkan zakar (air mani) di luar faraj di hadapan Nabi ﷺ. Baginda bersabda, “Mengapa salah seorang daripada kamu berbuat demikian?” Baginda tidak bersabda, “Janganlah salah seorang daripada kamu berbuat demikian.” Setiap jiwa yang akan dilahirkan, Allah akan menciptanya.” Abu Dawud berkata, “Qaza’ah adalah seorang klien Ziyad.”",
        "english_text": "Abu Saeed reported “The people mentioned about withdrawing the penis before the Prophet صلی ‌اللہ ‌علیہ ‌وسلم. He said “Why one of you does so? He did not say “One of you should not do so”. Every soul that is to be born, Allaah will create it. Abu Dawud said “Qaza’ah is a client of Ziyad”",
        "malay_translation": "Abu Sa'eed meriwayatkan, “Orang ramai menyebut tentang mengeluarkan zakar (air mani) di luar faraj di hadapan Nabi ﷺ. Baginda bersabda, “Mengapa salah seorang daripada kamu berbuat demikian?” Baginda tidak bersabda, “Janganlah salah seorang daripada kamu berbuat demikian.” Setiap jiwa yang akan dilahirkan, Allah akan menciptanya.” Abu Dawud berkata, “Qaza’ah adalah seorang klien Ziyad.”",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِسْمَاعِيلَ الطَّالَقَانِيُّ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ ابْنِ أَبِي نَجِيحٍ، ‏‏‏‏‏‏عَنْ مُجَاهِدٍ، ‏‏‏‏‏‏عَنْ قَزَعَةَ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ، ‏‏‏‏‏‏ذُكِرَ ذَلِكَ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَعْنِي الْعَزْلَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَلِمَ يَفْعَلُ أَحَدُكُمْ، ‏‏‏‏‏‏وَلَمْ يَقُلْ:‏‏‏‏ فَلَا يَفْعَلْ أَحَدُكُمْ، ‏‏‏‏‏‏فَإِنَّهُ لَيْسَتْ مِنْ نَفْسٍ مَخْلُوقَةٍ إِلَّا اللَّهُ خَالِقُهَا . قَالَ أَبُو دَاوُد:‏‏‏‏ قَزَعَةُ مَوْلَى زِيَادٍ."
      },
      {
        "id": 21250,
        "hadith_number": "2171",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukum 'Azl (Mengeluarkan Mani di Luar Faraj) dan Penafian Dakwaan Yahudi",
        "perawi_melayu": "Abu Sa'eed al-Khudri",
        "english_text": "Narrated Abu Saeed al-Khudri: A man said: Messenger of Allah, I have a slave-girl and I withdraw the penis from her (while having intercourse), and I dislike that she becomes pregnant. I intend (by intercourse) what the men intend by it. The Jews say that withdrawing the penis (azl) is burying the living girls on a small scale. He (the Prophet) said: The Jews told a lie. If Allah intends to create it, you cannot turn it away.",
        "malay_translation": "Diriwayatkan daripada Abu Sa'eed al-Khudri: Seorang lelaki berkata: Wahai Rasulullah, saya mempunyai seorang hamba perempuan dan saya melakukan 'azl (mengeluarkan mani di luar faraj) dengannya, dan saya tidak suka dia mengandung. Saya menginginkan (dari persetubuhan itu) apa yang diinginkan oleh lelaki lain. Orang Yahudi mengatakan bahawa 'azl itu seperti menanam anak perempuan hidup-hidup dalam skala kecil. Baginda (Nabi) bersabda: Orang Yahudi berdusta. Jika Allah berkehendak untuk menciptakannya, kamu tidak akan dapat menghalangnya.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، ‏‏‏‏‏‏حَدَّثَنَا أَبَانُ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏أَنَّ مُحَمَّدَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ حَدَّثَهُ، ‏‏‏‏‏‏أَنَّ رِفَاعَةَ حَدَّثَهُ، ‏‏‏‏‏‏عَنْ َأَبِي سَعِيدٍ الْخُدْرِيِّ، ‏‏‏‏‏‏أَنَّ رَجُلًا قَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِنَّ لِي جَارِيَةً وَأَنَا أَعْزِلُ عَنْهَا، ‏‏‏‏‏‏وَأَنَا أَكْرَهُ أَنْ تَحْمِلَ وَأَنَا أُرِيدُ مَا يُرِيدُ الرِّجَالُ، ‏‏‏‏‏‏وَإِنَّ الْيَهُودَ تُحَدِّثُ أَنَّ الْعَزْلَ مَوْءُودَةُ الصُّغْرَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَذَبَتْ يَهُودُ، ‏‏‏‏‏‏لَوْ أَرَادَ اللَّهُ أَنْ يَخْلُقَهُ مَا اسْتَطَعْتَ أَنْ تَصْرِفَهُ ."
      },
      {
        "id": 21251,
        "hadith_number": "2172",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukum 'Azl (Mengeluarkan Air Mani di Luar Faraj) dan Qadar Allah",
        "perawi_melayu": "Diriwayatkan daripada Muhairiz, beliau berkata",
        "english_text": "Muhairiz said “I entered the mosque and saw Abu Saeed Al Khudri. I sat with him and asked about withdrawing the penis (while having intercourse). Abu Saeed said We went out with the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم on the expedition to Banu Al Mustaliq and took some Arab women captive and we desired the women for we were suffering from the absence of our wives and we wanted ransom, so we intended to withdraw the penis (while having intercourse with the slave women). But we asked ourselves “can we draw the penis when the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم is among us before asking him about it? So we asked him about it. He said “it does not matter if you do not do it, for very soul that is to be born up to the Day of Resurrection will be born. ”",
        "malay_translation": "Muhairiz berkata, “Saya masuk ke masjid dan melihat Abu Saeed Al Khudri. Saya duduk bersamanya dan bertanya tentang ‘azl (mengeluarkan air mani di luar faraj). Abu Saeed berkata, “Kami keluar bersama Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم dalam ekspedisi ke Banu Al Mustaliq dan menawan beberapa wanita Arab. Kami menginginkan wanita-wanita itu kerana kami menderita akibat ketiadaan isteri-isteri kami dan kami menginginkan tebusan, jadi kami berniat untuk melakukan ‘azl (semasa berhubungan seks dengan hamba perempuan). Tetapi kami bertanya kepada diri sendiri, “Bolehkah kita melakukan ‘azl sedangkan Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم berada di antara kita sebelum bertanya kepadanya tentang hal itu?” Lalu kami bertanya kepadanya tentang hal itu. Baginda bersabda, “Tidak mengapa jika kamu tidak melakukannya, kerana setiap jiwa yang akan dilahirkan hingga Hari Kiamat pasti akan dilahirkan.”",
        "arabic_text": "حَدَّثَنَا الْقَعْنَبِيُّ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، ‏‏‏‏‏‏عَنْ ابْنِ مُحَيْرِيزٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ دَخَلْتُ الْمَسْجِدَ فَرَأَيْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، ‏‏‏‏‏‏فَجَلَسْتُ إِلَيْهِ فَسَأَلْتُهُ عَنِ الْعَزْلِ، ‏‏‏‏‏‏فَقَالَ أَبُو سَعِيدٍ:‏‏‏‏ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ بَنِي الْمُصْطَلِقِ، ‏‏‏‏‏‏فَأَصَبْنَا سَبْيًا مِنْ سَبْيِ الْعَرَبِ فَاشْتَهَيْنَا النِّسَاءَ وَاشْتَدَّتْ عَلَيْنَا الْعُزْبَةُ وَأَحْبَبْنَا الْفِدَاءَ فَأَرَدْنَا أَنْ نَعْزِلَ، ‏‏‏‏‏‏ثُمَّ قُلْنَا:‏‏‏‏ نَعْزِلُ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ أَظْهُرِنَا قَبْلَ أَنْ نَسْأَلَهُ عَنْ ذَلِكَ، ‏‏‏‏‏‏فَسَأَلْنَاهُ عَنْ ذَلِكَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا عَلَيْكُمْ أَنْ لَا تَفْعَلُوا، ‏‏‏‏‏‏مَا مِنْ نَسَمَةٍ كَائِنَةٍ إِلَى يَوْمِ الْقِيَامَةِ إِلَّا وَهِيَ كَائِنَةٌ ."
      },
      {
        "id": 21252,
        "hadith_number": "2173",
        "status": "sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Hukum 'Azl (mengeluarkan air mani di luar faraj) dan Takdir",
        "perawi_melayu": "Diriwayatkan daripada Jabir RA",
        "english_text": "Jabir said “A man from the Ansar came to the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم and said “I have a slave girl and I have intercourse with her. But I dislike her to conceive. He replied “Withdraw your penis from her if you wish for what is decreed for her will come to her. ” After a time the man came to him and said “The girl has become pregnant”. He said “I told you that what was decreed for her would come to her. ”",
        "malay_translation": "Jabir RA berkata, “Seorang lelaki dari Ansar datang kepada Rasulullah SAW dan berkata, “Saya memiliki seorang hamba perempuan dan saya melakukan hubungan kelamin dengannya. Tetapi saya tidak suka dia mengandung.” Baginda menjawab, “Tariklah zakar kamu daripadanya jika kamu mahu, kerana apa yang telah ditakdirkan untuknya akan tetap menimpanya.” Setelah beberapa waktu, lelaki itu datang kepadanya dan berkata, “Hamba perempuan itu telah mengandung.” Baginda bersabda, “Aku telah memberitahumu bahawa apa yang telah ditakdirkan untuknya akan tetap menimpanya.”",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ، ‏‏‏‏‏‏حَدَّثَنَا زُهَيْرٌ، ‏‏‏‏‏‏عَنْ أَبِي الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ جَابِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ جَاءَ رَجُلٌ مِنْ الْأَنْصَارِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنَّ لِي جَارِيَةً أَطُوفُ عَلَيْهَا وَأَنَا أَكْرَهُ أَنْ تَحْمِلَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ اعْزِلْ عَنْهَا إِنْ شِئْتَ فَإِنَّهُ سَيَأْتِيهَا مَا قُدِّرَ لَهَا ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَلَبِثَ الرَّجُلُ، ‏‏‏‏‏‏ثُمَّ أَتَاهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنَّ الْجَارِيَةَ قَدْ حَمَلَتْ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَدْ أَخْبَرْتُكَ أَنَّهُ سَيَأْتِيهَا مَا قُدِّرَ لَهَا ."
      },
      {
        "id": 21253,
        "hadith_number": "2174",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Larangan Menceritakan Hubungan Intim dan Adab Pemakaian Haruman",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah: Abu Nadrah melaporkan: Seorang lelaki tua dari Tufawah berkata kepadaku: Aku adalah tetamu Abu Hurairah di Madinah. Aku tidak menemui seorang pun daripada sahabat Nabi صلی ‌اللہ ‌علیہ ‌وسلم yang lebih tekun beribadah dan lebih ramah daripada Abu Hurairah. Pada suatu hari aku bersamanya ketika dia sedang duduk di atas katilnya. Dia mempunyai sebuah pundi yang mengandungi batu kerikil atau biji benih. Seorang hamba perempuan berkulit hitam miliknya duduk di bawah. Sambil menghitungnya, dia bertasbih kepada Allah. Apabila batu kerikil atau biji benih di dalam pundi itu habis, dia mengumpulkannya dan memasukkannya semula ke dalam pundi, lalu memberikannya kepadanya. Dia berkata: Tidakkah aku patut menceritakan kepadamu tentang diriku dan tentang Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم? Aku berkata: Ya. Dia berkata: Pernah sekali ketika aku demam di masjid, Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم datang dan memasuki masjid, dan berkata: Siapa yang melihat pemuda dari ad-Daws. Dia berkata demikian tiga kali. Seorang lelaki berkata: Wahai Rasulullah, dia sedang demam di satu sisi masjid. Baginda bergerak, berjalan sehingga sampai kepadaku. Baginda meletakkan tangannya ke atasku. Baginda berbicara dengan lembut kepadaku, dan aku bangun. Kemudian baginda mula berjalan sehingga sampai ke tempat baginda biasa menunaikan solat. Baginda memberikan perhatian kepada orang ramai. Terdapat dua saf lelaki dan satu saf wanita, atau dua saf wanita dan satu saf lelaki (perawi ragu-ragu). Kemudian baginda bersabda: Jika syaitan membuatkan aku terlupa sesuatu semasa solat, maka lelaki hendaklah bertasbih kepada Allah, dan wanita hendaklah bertepuk tangan. Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم kemudiannya solat dan baginda tidak terlupa apa-apa pun semasa solat. Baginda bersabda: Duduklah di tempat kamu, duduklah di tempat kamu. Perawi, Musa, menambahkan perkataan di sini . Kemudian baginda memuji Allah dan mengagungkan-Nya, dan bersabda: Sekarang kepada topik kita. Versi yang dipersetujui bermula: Kemudian baginda bersabda: Adakah di antara kamu seorang lelaki yang menghampiri isterinya, menutup pintu, menutup dirinya dengan langsir, dan dia terlindung dengan langsir Allah? Mereka menjawab: Ya. Baginda bersabda: Kemudian dia duduk dan berkata: Aku melakukan itu dan itu; aku melakukan itu dan itu. Orang ramai berdiam diri. Kemudian baginda berpaling kepada wanita dan bersabda (kepada mereka): Adakah di antara kamu seorang wanita yang menceritakannya? Mereka berdiam diri. Kemudian seorang gadis jatuh berlutut. Perawi, Mu'ammil, berkata dalam versinya: seorang gadis yang montok. Dia mengangkat kepalanya di hadapan Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم supaya baginda dapat melihatnya dan mendengar kata-katanya. Dia berkata: Wahai Rasulullah, mereka (lelaki) menceritakan rahsia (persetubuhan) dan mereka (wanita) juga menceritakan rahsia (persetubuhan) kepada orang ramai. Baginda bersabda: Adakah kamu tahu apa perumpamaannya? Baginda bersabda: Perumpamaan perbuatan ini adalah seperti syaitan perempuan yang bertemu dengan syaitan lelaki di tepi jalan; dia memenuhi nafsunya dengannya sementara orang ramai melihatnya. Awas! Haruman lelaki adalah yang baunya kelihatan dan warnanya tidak kelihatan. Awas! Haruman wanita adalah yang warnanya kelihatan dan baunya tidak ketara. Abu Dawud berkata: Dari sini aku mengingati hadis ini daripada Mu'ammil dan Musa: Awas! Janganlah seorang lelaki tidur dengan lelaki lain, janganlah seorang wanita tidur dengan wanita lain kecuali dengan anak atau bapa sendiri. Dia juga menyebut yang ketiga yang aku terlupa. Ini telah disebutkan dalam versi Musaddad, tetapi aku tidak mengingatinya setepat yang aku suka. Perawi, Musa, berkata: Hammad meriwayatkan hadis ini daripada al-Jarir daripada Abu Nadrah daripada at-Tufawi.",
        "english_text": "Narrated Abu Hurairah: Abu Nadrah reported: An old man of Tufawah said to me: I was a guest of Abu Hurairah at Madina. I did not find any one of the companions of the Prophet صلی ‌اللہ ‌علیہ ‌وسلم more devoted to worship and more hospitable than Abu Hurairah. One day I was with him when he was sitting on his bed. He had a purse which contained pebbles or kernels. A black slave-girl of his was sitting below. Counting them he was glorifying Allah. When the pebbles or the kernels in the purse were finished, she gathered them and put them again in the purse, and gave it to him. He said: Should I not tell you about me and about the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم? I said: Yes. He said: Once when I was laid up with fever in the mosque, the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم came and entered the mosque, and said: Who saw the youth of ad-Daws. He said this three times. A man said: Messenger of Allah, there he is, laid up with fever on one side of the mosque. He moved, walking forward till he reached me. He placed his hand on me. He had a kind talk with me, and I rose. He then began to walk till he reached the place where he used to offer his prayer. He paid his attention to the people. There were two rows of men and one row of women, or two rows of women and one row of men (the narrator is doubtful). He then said: If Satan makes me forget anything during the prayer, the men should glorify Allah, and the women should clap their hands. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم then prayed and he did not forget anything during the prayer. He said: Be seated in your places, be seated in your places. The narrator, Musa, added the word here . He then praised Allah and exalted Him, and said: Now to our topic. The agreed version begins: He then said: Is there any man among you who approaches his wife, closes the door, covers himself with a curtain, and he is concealed with the curtain of Allah? They replied: Yes. He said: later he sits and says: I did so-and-so; I did so-and-so. The people kept silence. He then turned to the women and said (to them): Is there any woman among you who narrates it? They kept silence. Then a girl fell on one of her knees. The narrator, Mu'ammil, said in his version: a buxom girl. She raised her head before the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم so that he could see her and listen to her. She said: Messenger of Allah, they (the men) describe the secrets (of intercourse) and they (the women) also describe the secrets (of intercourse) to the people. He said: Do you know what the similitude is? He said: The likeness of this act is the likeness of a female Satan who meets the male Satan on the roadside; he fulfils his desire with her while the people are looking at him. Beware! The perfume of men is that whose smell becomes visible and its colour does not appear. Beware! The perfume of women is that whose colour becomes visible and whose smell is not obvious. Abu Dawud said: From here I remembered this tradition from Mu'ammil and Musa: Beware! No man should lie with another man, no woman should lie with another woman except with one's child or father. He also mentioned a third which I have forgotten. This has been mentioned in the version of Musaddad, but I do not remember it as precisely as I like. The narrator, Musa, said: Hammad narrated this tradition from al-Jarir from Abu Nadrah from at-Tufawi.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah: Abu Nadrah melaporkan: Seorang lelaki tua dari Tufawah berkata kepadaku: Aku adalah tetamu Abu Hurairah di Madinah. Aku tidak menemui seorang pun daripada sahabat Nabi صلی ‌اللہ ‌علیہ ‌وسلم yang lebih tekun beribadah dan lebih ramah daripada Abu Hurairah. Pada suatu hari aku bersamanya ketika dia sedang duduk di atas katilnya. Dia mempunyai sebuah pundi yang mengandungi batu kerikil atau biji benih. Seorang hamba perempuan berkulit hitam miliknya duduk di bawah. Sambil menghitungnya, dia bertasbih kepada Allah. Apabila batu kerikil atau biji benih di dalam pundi itu habis, dia mengumpulkannya dan memasukkannya semula ke dalam pundi, lalu memberikannya kepadanya. Dia berkata: Tidakkah aku patut menceritakan kepadamu tentang diriku dan tentang Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم? Aku berkata: Ya. Dia berkata: Pernah sekali ketika aku demam di masjid, Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم datang dan memasuki masjid, dan berkata: Siapa yang melihat pemuda dari ad-Daws. Dia berkata demikian tiga kali. Seorang lelaki berkata: Wahai Rasulullah, dia sedang demam di satu sisi masjid. Baginda bergerak, berjalan sehingga sampai kepadaku. Baginda meletakkan tangannya ke atasku. Baginda berbicara dengan lembut kepadaku, dan aku bangun. Kemudian baginda mula berjalan sehingga sampai ke tempat baginda biasa menunaikan solat. Baginda memberikan perhatian kepada orang ramai. Terdapat dua saf lelaki dan satu saf wanita, atau dua saf wanita dan satu saf lelaki (perawi ragu-ragu). Kemudian baginda bersabda: Jika syaitan membuatkan aku terlupa sesuatu semasa solat, maka lelaki hendaklah bertasbih kepada Allah, dan wanita hendaklah bertepuk tangan. Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم kemudiannya solat dan baginda tidak terlupa apa-apa pun semasa solat. Baginda bersabda: Duduklah di tempat kamu, duduklah di tempat kamu. Perawi, Musa, menambahkan perkataan di sini . Kemudian baginda memuji Allah dan mengagungkan-Nya, dan bersabda: Sekarang kepada topik kita. Versi yang dipersetujui bermula: Kemudian baginda bersabda: Adakah di antara kamu seorang lelaki yang menghampiri isterinya, menutup pintu, menutup dirinya dengan langsir, dan dia terlindung dengan langsir Allah? Mereka menjawab: Ya. Baginda bersabda: Kemudian dia duduk dan berkata: Aku melakukan itu dan itu; aku melakukan itu dan itu. Orang ramai berdiam diri. Kemudian baginda berpaling kepada wanita dan bersabda (kepada mereka): Adakah di antara kamu seorang wanita yang menceritakannya? Mereka berdiam diri. Kemudian seorang gadis jatuh berlutut. Perawi, Mu'ammil, berkata dalam versinya: seorang gadis yang montok. Dia mengangkat kepalanya di hadapan Rasulullah صلی ‌اللہ ‌علیہ ‌وسلم supaya baginda dapat melihatnya dan mendengar kata-katanya. Dia berkata: Wahai Rasulullah, mereka (lelaki) menceritakan rahsia (persetubuhan) dan mereka (wanita) juga menceritakan rahsia (persetubuhan) kepada orang ramai. Baginda bersabda: Adakah kamu tahu apa perumpamaannya? Baginda bersabda: Perumpamaan perbuatan ini adalah seperti syaitan perempuan yang bertemu dengan syaitan lelaki di tepi jalan; dia memenuhi nafsunya dengannya sementara orang ramai melihatnya. Awas! Haruman lelaki adalah yang baunya kelihatan dan warnanya tidak kelihatan. Awas! Haruman wanita adalah yang warnanya kelihatan dan baunya tidak ketara. Abu Dawud berkata: Dari sini aku mengingati hadis ini daripada Mu'ammil dan Musa: Awas! Janganlah seorang lelaki tidur dengan lelaki lain, janganlah seorang wanita tidur dengan wanita lain kecuali dengan anak atau bapa sendiri. Dia juga menyebut yang ketiga yang aku terlupa. Ini telah disebutkan dalam versi Musaddad, tetapi aku tidak mengingatinya setepat yang aku suka. Perawi, Musa, berkata: Hammad meriwayatkan hadis ini daripada al-Jarir daripada Abu Nadrah daripada at-Tufawi.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، ‏‏‏‏‏‏حَدَّثَنَا بِشْرٌ، ‏‏‏‏‏‏حَدَّثَنَا الْجُرَيْرِيُّ. ح وحَدَّثَنَا مُؤَمَّلٌ، ‏‏‏‏‏‏حَدَّثَنَا إِسْمَاعِيل. ح وحَدَّثَنَا مُوسَى، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادٌ، ‏‏‏‏‏‏كُلُّهُمْ عَنْ الْجُرَيْرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي نَضْرَةَ، ‏‏‏‏‏‏حَدَّثَنِي شَيْخٌ مِنْ طُفَاوَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ تَثَوَّيْتُ أَبَا هُرَيْرَةَ بِالْمَدِينَةِ، ‏‏‏‏‏‏فَلَمْ أَرَ رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَشَدَّ تَشْمِيرًا وَلَا أَقْوَمَ عَلَى ضَيْفٍ مِنْهُ، ‏‏‏‏‏‏فَبَيْنَمَا أَنَا عِنْدَهُ يَوْمًا وَهُوَ عَلَى سَرِيرٍ لَهُ وَمَعَهُ كِيسٌ فِيهِ حَصًى أَوْ نَوًى وَأَسْفَلَ مِنْهُ جَارِيَةٌ لَهُ سَوْدَاءُ وَهُوَ يُسَبِّحُ بِهَا حَتَّى إِذَا أَنْفَدَ مَا فِي الْكِيسِ، ‏‏‏‏‏‏أَلْقَاهُ إِلَيْهَا فَجَمَعَتْهُ فَأَعَادَتْهُ فِي الْكِيسِ فَدَفَعَتْهُ إِلَيْهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَلَا أُحَدِّثُكَ عَنِّي وَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ بَلَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ بَيْنَا أَنَا أُوعَكُ فِي الْمَسْجِدِ، ‏‏‏‏‏‏إِذْ جَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى دَخَلَ الْمَسْجِدَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَنْ أَحَسَّ الْفَتَى الدَّوْسِيَّ ثَلَاثَ مَرَّاتٍ، ‏‏‏‏‏‏فَقَالَ رَجُلٌ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏هُوَ ذَا يُوعَكُ فِي جَانِبِ الْمَسْجِدِ، ‏‏‏‏‏‏فَأَقْبَلَ يَمْشِي حَتَّى انْتَهَى إِلَيَّ فَوَضَعَ يَدَهُ عَلَيَّ، ‏‏‏‏‏‏فَقَالَ لِي:‏‏‏‏ مَعْرُوفًا ، ‏‏‏‏‏‏فَنَهَضْتُ فَانْطَلَقَ يَمْشِي حَتَّى أَتَى مَقَامَهُ الَّذِي يُصَلِّي فِيهِ، ‏‏‏‏‏‏فَأَقْبَلَ عَلَيْهِمْ وَمَعَهُ صَفَّانِ مِنْ رِجَالٍ وَصَفٌّ مِنْ نِسَاءٍ، ‏‏‏‏‏‏أَوْ صَفَّانِ مِنْ نِسَاءٍ وَصَفٌّ مِنْ رِجَالٍ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنْ أَنْسَانِي الشَّيْطَانُ شَيْئًا مِنْ صَلَاتِي فَلْيُسَبِّحْ الْقَوْمُ وَلْيُصَفِّقْ النِّسَاءُ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَنْسَ مِنْ صَلَاتِهِ شَيْئًا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَجَالِسَكُمْ مَجَالِسَكُمْ، ‏‏‏‏‏‏زَادَ مُوسَى هَا هُنَا، ‏‏‏‏‏‏ثُمَّ حَمِدَ اللَّهَ تَعَالَى وَأَثْنَى عَلَيْهِ ، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ أَمَّا بَعْدُ ثُمَّ اتَّفَقُوا، ‏‏‏‏‏‏ثُمَّ أَقْبَلَ عَلَى الرِّجَالِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ هَلْ مِنْكُمُ الرَّجُلُ إِذَا أَتَى أَهْلَهُ فَأَغْلَقَ عَلَيْهِ بَابَهُ وَأَلْقَى عَلَيْهِ سِتْرَهُ وَاسْتَتَرَ بِسِتْرِ اللَّهِ ؟ قَالُوا:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ثُمَّ يَجْلِسُ بَعْدَ ذَلِكَ، ‏‏‏‏‏‏فَيَقُولُ:‏‏‏‏ فَعَلْتُ كَذَا فَعَلْتُ كَذَا ؟ قَالَ:‏‏‏‏ فَسَكَتُوا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَأَقْبَلَ عَلَى النِّسَاءِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ هَلْ مِنْكُنَّ مَنْ تُحَدِّثُ ؟ فَسَكَتْنَ، ‏‏‏‏‏‏فَجَثَتْ فَتَاةٌ، ‏‏‏‏‏‏قَالَ مُؤَمَّلٌ فِي حَدِيثِهِ:‏‏‏‏ فَتَاةٌ كَعَابٌ عَلَى إِحْدَى رُكْبَتَيْهَا، ‏‏‏‏‏‏وَتَطَاوَلَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيَرَاهَا وَيَسْمَعَ كَلَامَهَا، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِنَّهُمْ لَيَتَحَدَّثُونَ وَإِنَّهُنَّ لَيَتَحَدَّثْنَهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ هَلْ تَدْرُونَ مَا مَثَلُ ذَلِكَ ؟ فَقَالَ:‏‏‏‏ إِنَّمَا مَثَلُ ذَلِكَ مَثَلُ شَيْطَانَةٍ لَقِيَتْ شَيْطَانًا فِي السِّكَّةِ فَقَضَى مِنْهَا حَاجَتَهُ وَالنَّاسُ يَنْظُرُونَ إِلَيْهِ، ‏‏‏‏‏‏أَلَا وَإِنَّ طِيبَ الرِّجَالِ مَا ظَهَرَ رِيحُهُ وَلَمْ يَظْهَرْ لَوْنُهُ، ‏‏‏‏‏‏أَلَا إِنَّ طِيبَ النِّسَاءِ مَا ظَهَرَ لَوْنُهُ وَلَمْ يَظْهَرْ رِيحُهُ . قَالَ أَبُو دَاوُد:‏‏‏‏ وَمِنْ هَا هُنَا حَفِظْتُهُ عَنْ مُؤَمَّلٍ وَ مُوسَى، ‏‏‏‏‏‏أَلَا لَا يُفْضِيَنَّ رَجُلٌ إِلَى رَجُلٍ وَلَا امْرَأَةٌ إِلَى امْرَأَةٍ إِلَّا إِلَى وَلَدٍ أَوْ وَالِدٍ، ‏‏‏‏‏‏وَذَكَرَ ثَالِثَةً فَأُنْسِيتُهَا، ‏‏‏‏‏‏وَهُوَ فِي حَدِيثِ مُسَدَّدٍ، ‏‏‏‏‏‏وَلَكِنِّي لَمْ أُتْقِنْهُ كَمَا أُحِبُّ، ‏‏‏‏‏‏وقَالَ مُوسَى:‏‏‏‏ حَدَّثَنَا حَمَّادٌ، ‏‏‏‏‏‏عَنْ الْجُرَيْرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي نَضْرَةَ، ‏‏‏‏‏‏عَنْ الطُّفَاوِيِّ."
      },
      {
        "id": 21254,
        "hadith_number": "2086",
        "status": "Sahih",
        "nama_buku": "Sunan Abu Dawood",
        "penulis_buku": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
        "tajuk_hadith": "Perkahwinan Umm Habibah dengan Rasulullah ﷺ Setelah Kematian Suaminya di Habsyah",
        "perawi_melayu": "Diriwayatkan daripada Ibn Az-Zubayr, daripada Umm Habibah R.A.",
        "english_text": "Ibn Az-Zubayr reported on the authority of Umm Habibah that she was the wife of Ibn Jahsh, but he died, He was among those who migrated to Abyssinia. Negus then married her to the Messenger of Allah ﷺ.",
        "malay_translation": "Ibn Az-Zubayr meriwayatkan daripada Umm Habibah bahawa beliau adalah isteri kepada Ibn Jahsh, tetapi beliau meninggal dunia. Beliau termasuk dalam kalangan mereka yang berhijrah ke Habsyah. Kemudian, Najasyi mengahwinkan beliau dengan Rasulullah ﷺ.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ ، عَنْ مَعْمَرٍ ، عَنْ الزُّهْرِيِّ ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ ، عَنْ أُمِّ حَبِيبَةَ ، أَنَّهَا كَانَتْ عِنْدَ ابْنِ جَحْشٍ فَهَلَكَ عَنْهَا وَكَانَ فِيمَنْ هَاجَرَ إِلَى أَرْضِ الْحَبَشَةِ ، فَزَوَّجَهَا النَّجَاشِيُّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ عِنْدَهُمْ \" ."
      }
    ]
  }
}