{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 66,
    "data": [
      {
        "id": 36356,
        "hadith_number": "1368",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Keutamaan Hari Jumaat dan Kedudukan Umat Islam",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah RA",
        "english_text": "It was narrated that Abu Hurairah said: The Messenger of Allah (ﷺ) said: 'We are the last (to come) but will be the foremost on the Day of Resurrection, but they were given the Book before us and we were given it after them. They differed concerning this day which Allah (SWT), the Mighty and Sublime, had prescribed for them and Allah (SWT), the Mighty and Sublime, guided us to --meaning Friday-- so the people follow us, the Jews the next day and the Christians the day after that.'",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah RA, beliau berkata: Rasulullah (ﷺ) bersabda: 'Kita adalah yang terakhir (datang) tetapi akan menjadi yang terdepan pada Hari Kiamat, walaupun mereka diberikan Kitab sebelum kita dan kita diberikan Kitab setelah mereka. Mereka berselisih mengenai hari ini yang telah Allah (SWT), Yang Maha Perkasa dan Maha Agung, tetapkan bagi mereka, dan Allah (SWT), Yang Maha Perkasa dan Maha Agung, memberi petunjuk kepada kita kepadanya --iaitu hari Jumaat-- maka orang ramai mengikuti kita, Yahudi pada hari berikutnya dan Kristian pada hari selepasnya.'",
        "arabic_text": "أَخْبَرَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ أَبِي الزِّنَادِ، ‏‏‏‏‏‏عَنِ الْأَعْرَجِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ. ح وَابْنُ طَاوُسٍ،‏‏‏‏ عَنْ أَبِيهِ،‏‏‏‏ عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ نَحْنُ الْآخِرُونَ السَّابِقُونَ بَيْدَ أَنَّهُمْ أُوتُوا الْكِتَابَ مِنْ قَبْلِنَا وَأُوتِينَاهُ مِنْ بَعْدِهِمْ،‏‏‏‏ وَهَذَا الْيَوْمُ الَّذِي كَتَبَ اللَّهُ عَزَّ وَجَلَّ عَلَيْهِمْ فَاخْتَلَفُوا فِيهِ فَهَدَانَا اللَّهُ عَزَّ وَجَلَّ لَهُ،‏‏‏‏ يَعْنِي يَوْمَ الْجُمُعَةِ فَالنَّاسُ لَنَا فِيهِ تَبَعٌ الْيَهُودُ غَدًا وَالنَّصَارَى بَعْدَ غَدٍ ."
      },
      {
        "id": 36357,
        "hadith_number": "1369",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Keutamaan Hari Jumaat dan Kesesatan Umat Terdahulu Daripadanya",
        "perawi_melayu": "Hudhaifah",
        "english_text": "It was narrated that Hudhaifah said: The Messenger of Allah (ﷺ) said: 'Allah (SWT) sent astray from Friday those who came before us, so the Jews had Saturday and the Christians had Sunday. Then Allah (SWT), the Mighty and Sublime, brought us and guided us to Friday, so there is Friday, Saturday and Sunday, and thus they will follow us on the Day of Resurrection. We are the last of the people of this world but the first on the Day of Resurrection for whom judgment will be passed before all other creatures.'",
        "malay_translation": "Diriwayatkan daripada Hudhaifah, beliau berkata: Rasulullah (ﷺ) bersabda: 'Allah (SWT) menyesatkan daripada hari Jumaat umat-umat sebelum kita, maka Yahudi diberikan hari Sabtu dan Nasrani diberikan hari Ahad. Kemudian Allah (SWT), Yang Maha Perkasa dan Maha Agung, membawa kita dan memberi petunjuk kepada kita kepada hari Jumaat, maka jadilah hari Jumaat, Sabtu dan Ahad, dan begitulah mereka akan menjadi pengikut kita pada Hari Kiamat. Kita adalah umat terakhir dari penduduk dunia tetapi yang pertama pada Hari Kiamat yang akan dihakimi sebelum semua makhluk.'",
        "arabic_text": "أَخْبَرَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا ابْنُ فُضَيْلٍ، ‏‏‏‏‏‏عَنْ أَبِي مَالِكٍ الْأَشْجَعِيِّ، ‏‏‏‏‏‏عَنْ أَبِي حَازِمٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَعَنْ رِبْعِيِّ بْنِ حِرَاشٍ، ‏‏‏‏‏‏عَنْ حُذَيْفَةَ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَضَلَّ اللَّهُ عَزَّ وَجَلَّ عَنِ الْجُمُعَةِ مَنْ كَانَ قَبْلَنَا فَكَانَ لِلْيَهُودِ يَوْمُ السَّبْتِ،‏‏‏‏ وَكَانَ لِلنَّصَارَى يَوْمُ الْأَحَدِ،‏‏‏‏ فَجَاءَ اللَّهُ عَزَّ وَجَلَّ بِنَا فَهَدَانَا لِيَوْمِ الْجُمُعَةِ فَجَعَلَ الْجُمُعَةَ وَالسَّبْتَ وَالْأَحَدَ،‏‏‏‏ وَكَذَلِكَ هُمْ لَنَا تَبَعٌ يَوْمَ الْقِيَامَةِ،‏‏‏‏ وَنَحْنُ الْآخِرُونَ مِنْ أَهْلِ الدُّنْيَا وَالْأَوَّلُونَ يَوْمَ الْقِيَامَةِ الْمَقْضِيُّ لَهُمْ قَبْلَ الْخَلَائِقِ ."
      },
      {
        "id": 36358,
        "hadith_number": "1370",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Ancaman Meninggalkan Tiga Jumaat Berturut-turut Kerana Lalai",
        "perawi_melayu": "Abu Al-Ja'd Ad-Damri",
        "english_text": "It was narrated from Abu Al-Ja'd Ad-Damri-who was a Companion of the Prophet (ﷺ)- that the Prophet (ﷺ) said: Whoever missed three jumu'ahs out of negligence, Allah (SWT) will place a seal over his heart.",
        "malay_translation": "Diriwayatkan daripada Abu Al-Ja'd Ad-Damri—yang merupakan seorang Sahabat Nabi (ﷺ)—bahawa Nabi (ﷺ) bersabda: Sesiapa yang meninggalkan tiga Jumaat kerana kelalaian, Allah (SWT) akan meletakkan meterai di atas hatinya.",
        "arabic_text": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ عَمْرٍو، ‏‏‏‏‏‏عَنْ عَبِيدَةَ بْنِ سُفْيَانَ الْحَضْرَمِيِّ، ‏‏‏‏‏‏عَنْ أَبِي الْجَعْدِ الضَّمْرِيِّ وَكَانَتْ لَهُ صُحْبَةٌ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَنْ تَرَكَ ثَلَاثَ جُمَعٍ تَهَاوُنًا بِهَا،‏‏‏‏ طَبَعَ اللَّهُ عَلَى قَلْبِهِ ."
      },
      {
        "id": 36359,
        "hadith_number": "1371",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Ancaman Mengabaikan Solat Jumaat",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "It was narrated from Al-Hakam bin Mina' that: He heard Ibn Abbas and Ibn Umar narrated that while he was on the minbar, the Messenger of Allah (ﷺ) said: People should stop negleting jumu'ah or Allah (SWT) will place a seal on their hearts and they will be deemed as being among the negligent.",
        "malay_translation": "Diriwayatkan daripada Al-Hakam bin Mina': Beliau mendengar Ibn Abbas dan Ibn Umar meriwayatkan bahawa ketika Rasulullah (ﷺ) berada di atas mimbar, baginda bersabda: Hendaklah kaum berhenti daripada mengabaikan solat Jumaat, atau Allah (SWT) akan mengunci hati mereka dan mereka akan tergolong dalam golongan yang lalai.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حَبَّانُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبَانُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، ‏‏‏‏‏‏عَنِ الْحَضْرَمِيِّ بْنِ لَاحِقٍ، ‏‏‏‏‏‏عَنْ زَيْدٍ، ‏‏‏‏‏‏عَنْ أَبِي سَلَّامٍ، ‏‏‏‏‏‏عَنِ الْحَكَمِ بْنِ مِينَاءَ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ،‏‏‏‏ وَابْنَ عُمَرَ يُحَدِّثَانِ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَهُوَ عَلَى أَعْوَادِ مِنْبَرِهِ:‏‏‏‏ لَيَنْتَهِيَنَّ أَقْوَامٌ عَنْ وَدْعِهِمُ الْجُمُعَاتِ أَوْ لَيَخْتِمَنَّ اللَّهُ عَلَى قُلُوبِهِمْ وَلَيَكُونُنَّ مِنَ الْغَافِلِينَ ."
      },
      {
        "id": 36360,
        "hadith_number": "1372",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Kewajipan Juma'ah bagi Setiap Muslim yang Baligh",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "It was narrated from Hafsah, the wife of the Prophet (ﷺ) that: The Prophet (ﷺ) said: Going to jumu'ah is obligatory for everyone who has reached the age of puberty.'",
        "malay_translation": "Diriwayatkan daripada Hafsah, isteri Nabi (ﷺ) bahawa: Nabi (ﷺ) bersabda: Pergi ke Juma'ah adalah wajib bagi setiap orang yang telah mencapai usia baligh.",
        "arabic_text": "أَخْبَرَنِي مَحْمُودُ بْنُ غَيْلَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي الْمُفَضَّلُ بْنُ فَضَالَةَ، ‏‏‏‏‏‏عَنْ عَيَّاشِ بْنِ عَبَّاسٍ، ‏‏‏‏‏‏عَنْ بُكَيْرِ بْنِ الْأَشَجِّ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏عَنْ حَفْصَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ رَوَاحُ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ ."
      },
      {
        "id": 36361,
        "hadith_number": "1373",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Sedekah Bagi Mereka yang Meninggalkan Solat Jumaat Tanpa Uzur",
        "perawi_melayu": "Tidak Dinyatakan",
        "english_text": "It was narrated that Samurah bin Jundub said: The Messenger of Allah (ﷺ) said: Whoever misses jumu'ah with no excuse, let him give a dinar in charity, and if he cannot afford that, then half a dinar.",
        "malay_translation": "Diriwayatkan daripada Samurah bin Jundub RA, bahawa Rasulullah SAW bersabda: Sesiapa yang meninggalkan solat Jumaat tanpa uzur, maka hendaklah dia bersedekah dengan satu dinar, dan jika dia tidak mampu, maka setengah dinar.",
        "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا هَمَّامٌ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ قُدَامَةَ بْنِ وَبَرَةَ، ‏‏‏‏‏‏عَنْسَمُرَةَ بْنِ جُنْدُبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ تَرَكَ الْجُمُعَةَ مِنْ غَيْرِ عُذْرٍ فَلْيَتَصَدَّقْ بِدِينَارٍ،‏‏‏‏ فَإِنْ لَمْ يَجِدْ فَبِنِصْفِ دِينَارٍ ."
      },
      {
        "id": 36362,
        "hadith_number": "1374",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Keutamaan Hari Jumaat",
        "perawi_melayu": "Abdur-Rahman Al-A'raj",
        "english_text": "Abdur-Rahman Al-A'raj narrated that: He heard Abu Hurairah say: The Messenger of Allah (ﷺ) said: 'The best day on which the sun rises is Friday. On this day, Adam, peace be upon him, was created, on this day he was admitted to Paradise, and on this day he was taken out of it.'",
        "malay_translation": "Abdur-Rahman Al-A'raj meriwayatkan bahawa: Beliau mendengar Abu Hurairah berkata: Rasulullah (ﷺ) bersabda: 'Sebaik-baik hari di mana matahari terbit adalah hari Jumaat. Pada hari ini, Adam, alaihissalam, diciptakan, pada hari ini beliau dimasukkan ke dalam Syurga, dan pada hari ini beliau dikeluarkan daripadanya.'",
        "arabic_text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا عَبْدُ اللَّهِ، ‏‏‏‏‏‏عَنْ يُونُسَ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ الْأَعْرَجُ، ‏‏‏‏‏‏أَنَّهُ سَمِعَأَبَا هُرَيْرَةَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ خَيْرُ يَوْمٍ طَلَعَتْ فِيهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ،‏‏‏‏ فِيهِ خُلِقَ آدَمُ عَلَيْهِ السَّلَام،‏‏‏‏ وَفِيهِ أُدْخِلَ الْجَنَّةَ،‏‏‏‏ وَفِيهِ أُخْرِجَ مِنْهَا ."
      },
      {
        "id": 36363,
        "hadith_number": "1375",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Keutamaan Hari Jumaat dan Selawat kepada Nabi (ﷺ)",
        "perawi_melayu": "Aws bin Aws",
        "english_text": "It was narrated from Aws bin Aws that : The Prophet (ﷺ) said: One of the best of your days is Friday. On this day, Adam was created and on this day he died, on this day the Trumpet will be blown, and on this day all creatures will swoon. So send a great deal of salah upon me on this day, for your salah will be presented to me. They said: O Messenger of Allah (ﷺ), how will our salah be presented to you when you have decomposed (after death)? He said: Allah (SWT), the Mighty and Sublime, has forbidden the earth to consume the bodies of the prophets, peace be upon them.",
        "malay_translation": "Diriwayatkan daripada Aws bin Aws bahawa: Nabi (ﷺ) bersabda: 'Sesungguhnya hari yang paling utama bagi kamu adalah hari Jumaat. Pada hari itu Adam diciptakan dan pada hari itu dia wafat, pada hari itu sangkakala akan ditiup, dan pada hari itu semua makhluk akan pengsan. Maka perbanyakkanlah selawat ke atasku pada hari itu, kerana selawat kamu akan dipersembahkan kepadaku.' Mereka bertanya: 'Wahai Rasulullah (ﷺ), bagaimana selawat kami dipersembahkan kepadamu sedangkan engkau telah reput (selepas kematian)?' Baginda bersabda: 'Sesungguhnya Allah (SWT), Yang Maha Perkasa lagi Maha Agung, telah mengharamkan bumi untuk memakan jasad para nabi, salam ke atas mereka.'",
        "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حُسَيْنٌ الْجُعْفِيُّ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ جَابِرٍ، ‏‏‏‏‏‏عَنْ أَبِي الْأَشْعَثِ الصَّنْعَانِيِّ، ‏‏‏‏‏‏عَنْ أَوْسِ بْنِ أَوْسٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِنَّ مِنْ أَفْضَلِ أَيَّامِكُمْ يَوْمَ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ عَلَيْهِ السَّلَام،‏‏‏‏ وَفِيهِ قُبِضَ،‏‏‏‏ وَفِيهِ النَّفْخَةُ،‏‏‏‏ وَفِيهِ الصَّعْقَةُ،‏‏‏‏ فَأَكْثِرُوا عَلَيَّ مِنَ الصَّلَاةِ،‏‏‏‏ فَإِنَّ صَلَاتَكُمْ مَعْرُوضَةٌ عَلَيَّ ،‏‏‏‏ قَالُوا:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏ وَكَيْفَ تُعْرَضُ صَلَاتُنَا عَلَيْكَ وَقَدْ أَرَمْتَ أَيْ يَقُولُونَ قَدْ بَلِيتَ ؟ قَالَ:‏‏‏‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ قَدْ حَرَّمَ عَلَى الْأَرْضِ أَنْ تَأْكُلَ أَجْسَادَ الْأَنْبِيَاءِ عَلَيْهِمُ السَّلَام ."
      },
      {
        "id": 36364,
        "hadith_number": "1376",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Kewajipan Mandi dan Bersiwak pada Hari Jumaat serta Penggunaan Wangian",
        "perawi_melayu": "Abdur-Rahman bin Abi Sa'eed, daripada ayahnya",
        "english_text": "It was narrated (through two chains) from 'Abdur-Rahman bin Abi Sa'eed, from his father, that: The Messenger of Allah (ﷺ) said: Ghusl and using siwak on Fridays are obligatory for everyone who has reached the age of puberty, and he should put on whatever he can find of perfume. Except that Bukair (one of the narrators in one chain) did not mention 'Abdur-Rahman, and about the perfume he said: Even if it is women's perfume.",
        "malay_translation": "Diriwayatkan (melalui dua sanad) daripada 'Abdur-Rahman bin Abi Sa'eed, daripada ayahnya, bahawa: Rasulullah (ﷺ) bersabda: Mandi dan menggunakan siwak pada hari Jumaat adalah wajib bagi setiap orang yang telah baligh, dan hendaklah dia memakai apa sahaja wangian yang dia dapati. Kecuali Bukair (salah seorang perawi dalam satu sanad) tidak menyebut 'Abdur-Rahman, dan tentang wangian dia berkata: Walaupun ia adalah wangian wanita.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ الْحَارِثِ،‏‏‏‏ أَنَّ سَعِيدَ بْنَ أَبِي هِلَالٍ،‏‏‏‏ وَبُكَيْرَ بْنَ الْأَشَجِّحَدَّثَاهُ، ‏‏‏‏‏‏عَنْ أَبِي بَكْرِ بْنِ الْمُنْكَدِرِ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ سُلَيْمٍ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ الْغُسْلُ يَوْمَ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ،‏‏‏‏ وَالسِّوَاكُ،‏‏‏‏ وَيَمَسُّ مِنَ الطِّيبِ مَا قَدَرَ عَلَيْهِ ،‏‏‏‏ إِلَّا أَنَّ بُكَيْرًا لَمْ يَذْكُرْ عَبْدَ الرَّحْمَنِ،‏‏‏‏ وَقَالَ:‏‏‏‏ فِي الطِّيبِ وَلَوْ مِنْ طِيبِ الْمَرْأَةِ."
      },
      {
        "id": 36365,
        "hadith_number": "1377",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Mandi Jumaat",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "It was narrated from Ibn 'Umar that: The Messenger of Allah (ﷺ) said: When any one of you wants to come to Jumu'ah prayer, let him perform ghusl.",
        "malay_translation": "Diriwayatkan daripada Ibn 'Umar bahawa: Rasulullah (ﷺ) bersabda: Apabila salah seorang daripada kamu ingin datang ke solat Jumaat, maka hendaklah dia mandi.",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِذَا جَاءَ أَحَدُكُمُ الْجُمُعَةَ فَلْيَغْتَسِلْ ."
      },
      {
        "id": 36366,
        "hadith_number": "1378",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Kewajipan Mandi Jumaat bagi yang Baligh",
        "perawi_melayu": "Tidak diketahui",
        "english_text": "It was narrated from Abu Sa'eed Al-Khudri that: The Messenger of Allah (ﷺ) said: Ghusl on Friday is obligatory for everyone who has reached the age of puberty.",
        "malay_translation": "Diriwayatkan daripada Abu Sa'eed Al-Khudri bahawa: Rasulullah (ﷺ) bersabda: Mandi pada hari Jumaat adalah wajib bagi setiap orang yang telah baligh.",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، ‏‏‏‏‏‏عَنْ عَطَاءِ بْنِ يَسَارٍ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ غُسْلُ يَوْمِ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ ."
      },
      {
        "id": 36367,
        "hadith_number": "1379",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Kewajipan Mandi Ghusl Hari Jumaat",
        "perawi_melayu": "Jabir",
        "english_text": "It was narrated that Jabir said: The Messenger of Allah (ﷺ) said: 'Every Muslim man has to perform Ghusl one day in every seven, and that is on Friday.'",
        "malay_translation": "Diriwayatkan daripada Jabir, bahawa Rasulullah (ﷺ) bersabda: 'Setiap lelaki Muslim wajib melakukan mandi Ghusl sekali dalam tujuh hari, dan hari itu adalah hari Jumaat.'",
        "arabic_text": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا بِشْرٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ، ‏‏‏‏‏‏عَنْ أَبِي الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ جَابِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ عَلَى كُلِّ رَجُلٍ مُسْلِمٍ فِي كُلِّ سَبْعَةِ أَيَّامٍ غُسْلُ يَوْمٍ وَهُوَ يَوْمُ الْجُمُعَةِ ."
      },
      {
        "id": 36368,
        "hadith_number": "1380",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Sebab Disyariatkan Mandi Wajib Sebelum Solat Jumaat",
        "perawi_melayu": "Abdullah bin Al-'Ala meriwayatkan bahawa: Beliau mendengar Al-Qasim bin Muhammad bin Abi Bakr (berkata) bahawa mereka menyebut tentang mandi wajib pada hari Jumaat di hadapan 'Aishah dan beliau berkata: Sesungguhnya beberapa orang tinggal di Al-'Aliyah dan mereka datang untuk solat Jumaat dengan kotoran pada mereka (kerana pekerjaan mereka). Apabila angin bertiup, ia akan membawa bau mereka kepada orang ramai yang menyebabkan mereka terganggu. Hal itu disebutkan kepada Rasulullah ﷺ dan baginda bersabda: Mengapa kamu tidak mandi wajib?",
        "english_text": "Abdullah bin Al-'Ala narrated that: He heard Al-Qasim bin Muhammad bin Abi Bakr (say) that they mentioned Ghusl on Fridays in the presence of 'Aishah and she said: Some people used to live in Al-'Aliyah and they would come to Jumu'ah with dirt on them (because of their work). When a breeze came it would carry their smell to the people which annoyed them. Mention of that was made to the Messenger of Allah (ﷺ) and he said: Why don't you perform ghusl?",
        "malay_translation": "Abdullah bin Al-'Ala meriwayatkan bahawa: Beliau mendengar Al-Qasim bin Muhammad bin Abi Bakr (berkata) bahawa mereka menyebut tentang mandi wajib pada hari Jumaat di hadapan 'Aishah dan beliau berkata: Sesungguhnya beberapa orang tinggal di Al-'Aliyah dan mereka datang untuk solat Jumaat dengan kotoran pada mereka (kerana pekerjaan mereka). Apabila angin bertiup, ia akan membawa bau mereka kepada orang ramai yang menyebabkan mereka terganggu. Hal itu disebutkan kepada Rasulullah ﷺ dan baginda bersabda: Mengapa kamu tidak mandi wajib?",
        "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ خَالِدٍ، ‏‏‏‏‏‏عَنِ الْوَلِيدِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْعَلَاءِ،‏‏‏‏ أَنَّهُ سَمِعَ الْقَاسِمَ بْنَ مُحَمَّدِ بْنِ أَبِي بَكْرٍ،‏‏‏‏ أَنَّهُمْ ذَكَرُوا غُسْلَ يَوْمِ الْجُمُعَةِ عِنْدَ عَائِشَةَ فَقَالَتْ:‏‏‏‏ إِنَّمَا كَانَ النَّاسُ يَسْكُنُونَ الْعَالِيَةَ فَيَحْضُرُونَ الْجُمُعَةَ وَبِهِمْ وَسَخٌ،‏‏‏‏ فَإِذَا أَصَابَهُمُ الرَّوْحُ سَطَعَتْ أَرْوَاحُهُمْ فَيَتَأَذَّى بِهَا النَّاسُ،‏‏‏‏ فَذُكِرَ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ:‏‏‏‏ أَوَ لَا يَغْتَسِلُونَ ."
      },
      {
        "id": 36369,
        "hadith_number": "1381",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Kelebihan Mandi Wajib pada Hari Jumaat",
        "perawi_melayu": "Samurah",
        "english_text": "It was narrated that Samurah said: The Messenger of Allah (ﷺ) said: 'Whoever performs wudu' on Friday, that is all well and good, but whoever performs ghusl, the ghusl is better.'",
        "malay_translation": "Diriwayatkan daripada Samurah berkata: Rasulullah (ﷺ) bersabda: 'Sesiapa yang berwuduk pada hari Jumaat, itu adalah baik, tetapi sesiapa yang mandi wajib, mandi wajib itu lebih baik.'",
        "arabic_text": "أَخْبَرَنَا أَبُو الْأَشْعَثِ، ‏‏‏‏‏‏عَنْ يَزِيدَ بْنِ زُرَيْعٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنِ الْحَسَنِ، ‏‏‏‏‏‏عَنْ سَمُرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ تَوَضَّأَ يَوْمَ الْجُمُعَةِ فَبِهَا وَنِعْمَتْ وَمَنِ اغْتَسَلَ فَالْغُسْلُ أَفْضَلُ ،‏‏‏‏ قَالَ أَبُو عَبْد الرَّحْمَنِ:‏‏‏‏ الْحَسَنُ عَنْ سَمُرَةَ كِتَابًا،‏‏‏‏ وَلَمْ يَسْمَعِ الْحَسَنُ مِنْ سَمُرَةَ إِلَّا حَدِيثَ الْعَقِيقَةِ وَاللَّهُ تَعَالَى أَعْلَمُ."
      },
      {
        "id": 36370,
        "hadith_number": "1382",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Keutamaan Mandi, Datang Awal ke Masjid, dan Mendekati Imam",
        "perawi_melayu": "Aws bin Aws",
        "english_text": "It was narrated from Aws bin Aws that: The Prophet (ﷺ) said: Whoever washes (ghassala) and performs ghusl, comes early to the masjid and sits near the imam, and does not engage in idle talk, he will have for every step he takes (the reward of) a year's worth of good deeds, fasting it and praying Qiyam during it.",
        "malay_translation": "Diriwayatkan daripada Aws bin Aws bahawa: Nabi (ﷺ) bersabda: Sesiapa yang mandi (ghassala) dan melakukan ghusl, datang awal ke masjid dan duduk dekat dengan imam, dan tidak melibatkan diri dalam perbualan kosong, dia akan mendapat bagi setiap langkah yang diambilnya (pahala) amalan setahun, berpuasa dan melakukan Qiyam di dalamnya.",
        "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ،‏‏‏‏ وَهَارُونُ بْنُ مُحَمَّدِ بْنِ بَكَّارِ بْنِ بِلَالٍ،‏‏‏‏ وَاللَّفْظُ لَهُ قَالَا:‏‏‏‏ حَدَّثَنَا أَبُو مُسْهِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَاسَعِيدُ بْنُ عَبْدِ الْعَزِيزِ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ الْحَارِثِ، ‏‏‏‏‏‏عَنْ أَبِي الْأَشْعَثِ الصَّنْعَانِيِّ، ‏‏‏‏‏‏عَنْ أَوْسِ بْنِ أَوْسٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ غَسَّلَ وَاغْتَسَلَ وَغَدَا وَابْتَكَرَ وَدَنَا مِنَ الْإِمَامِ وَلَمْ يَلْغُ،‏‏‏‏ كَانَ لَهُ بِكُلِّ خُطْوَةٍ عَمَلُ سَنَةٍ صِيَامُهَا وَقِيَامُهَا ."
      },
      {
        "id": 36371,
        "hadith_number": "1383",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Larangan Memakai Pakaian Sutera bagi Lelaki dan Pemberiannya kepada Bukan Muslim",
        "perawi_melayu": "Abdullah bin Umar",
        "english_text": "It was narrated from 'Abdullah bin 'Umar that : 'Umar bin al-Khattab saw a Hullah and said: O Messenger of Allah (ﷺ), why don't you buy this and wear it on Fridays and when meeting the delegations when they come to you? The Messenger of Allah (ﷺ) said: This is worn by one who has no share in the Hereafter. Then something similar was brought to the Messenger of Allah (ﷺ) and he gave a Hullah to 'Umar from it. 'Umar said: O Messenger of Allah (ﷺ), have you given me this when you said what you said about the Hullah of 'Utarid? The Messenger of Allah (ﷺ) said: I have not given it to you to wear it. So 'Umar gave it to an idolator brother of his in Makkah.",
        "malay_translation": "Telah diriwayatkan daripada Abdullah bin Umar bahawa: Umar bin al-Khattab melihat sehelai Hullah lalu berkata: Wahai Rasulullah (ﷺ), mengapa tidak engkau membeli ini dan memakainya pada hari Jumaat dan ketika bertemu dengan rombongan utusan apabila mereka datang kepadamu? Rasulullah (ﷺ) bersabda: Ini dipakai oleh orang yang tidak mempunyai bahagian di akhirat. Kemudian sesuatu yang serupa dibawa kepada Rasulullah (ﷺ) dan baginda memberikan sehelai Hullah kepada Umar daripadanya. Umar berkata: Wahai Rasulullah (ﷺ), adakah engkau memberikan ini kepadaku sedangkan engkau telah berkata apa yang engkau katakan tentang Hullah 'Utarid? Rasulullah (ﷺ) bersabda: Aku tidak memberikan ini kepadamu untuk engkau memakainya. Lalu Umar memberikannya kepada saudara lelakinya yang musyrik di Makkah.",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، ‏‏‏‏‏‏أَنَّ عُمَرَ بْنَ الْخَطَّابِ رَأَى حُلَّةً،‏‏‏‏ فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏ لَوِ اشْتَرَيْتَ هَذِهِ فَلَبِسْتَهَا يَوْمَ الْجُمُعَةِ وَلِلْوَفْدِ إِذَا قَدِمُوا عَلَيْكَ، ‏‏‏‏‏‏قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّمَا يَلْبَسُ هَذِهِ مَنْ لَا خَلَاقَ لَهُ فِي الْآخِرَةِ ، ‏‏‏‏‏‏ثُمَّ جَاءَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلُهَا فَأَعْطَى عُمَرَ مِنْهَا حُلَّةً،‏‏‏‏ فَقَالَ عُمَرُ:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏ كَسَوْتَنِيهَا وَقَدْ قُلْتَ فِي حُلَّةِ عُطَارِدٍ مَا قُلْتَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَمْ أَكْسُكَهَا لِتَلْبَسَهَا ،‏‏‏‏ فَكَسَاهَا عُمَرُ أَخًا لَهُ مُشْرِكًا بِمَكَّةَ."
      },
      {
        "id": 36372,
        "hadith_number": "1384",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Kewajipan Mandi, Siwak, dan Wangian pada Hari Jumaat bagi yang Baligh",
        "perawi_melayu": "Abu Sa'eed al-Khudri R.A.",
        "english_text": "It was narrated from 'Abdur-Rahman bin Abi Sa'eed, from his father, that: The Messenger of Allah (ﷺ) said: Ghusl should be performed on Friday by everyone who has reached the age of puberty, and using the siwak, and he should put on whatever he is able of using perfume.",
        "malay_translation": "Telah diriwayatkan daripada 'Abdur-Rahman bin Abi Sa'eed, daripada bapanya, bahawa: Rasulullah (ﷺ) bersabda: Mandi (ghusl) adalah wajib pada hari Jumaat bagi setiap orang yang telah baligh, dan menggunakan siwak, dan hendaklah dia memakai wangian yang mampu baginya.",
        "arabic_text": "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا الْحَسَنُ بْنُ سَوَّارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا اللَّيْثُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا خَالِدٌ، ‏‏‏‏‏‏عَنْ سَعِيدٍ، ‏‏‏‏‏‏عَنْأَبِي بَكْرِ بْنِ الْمُنْكَدِرِ، ‏‏‏‏‏‏أَنَّ عَمْرَو بْنَ سُلَيْمٍ أَخْبَرَهُ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِنَّ الْغُسْلَ يَوْمَ الْجُمُعَةِ عَلَى كُلِّ مُحْتَلِمٍ،‏‏‏‏ وَالسِّوَاكَ،‏‏‏‏ وَأَنْ يَمَسَّ مِنَ الطِّيبِ مَا يَقْدِرُ عَلَيْهِ ."
      },
      {
        "id": 36373,
        "hadith_number": "1385",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Keutamaan Mandi Jumaat dan Amalan di Masjid untuk Mendapatkan Pahala Setahun",
        "perawi_melayu": "Aws bin Aws",
        "english_text": "Abu Al-Ash'ath narrated that: He heard Aws bin Aws, the Companion of the Messenger of Allah (ﷺ) say: The Messenger of Allah (ﷺ) said: 'Whoever performs Ghusl on Friday and washes (ghassala), and comes early to the masjid, walking not riding, and sits close to the imam and listens attentively and does not engage in idle speech, for every step he takes he will have (the reward of) a year's worth of good deeds.'",
        "malay_translation": "Abu Al-Ash'ath meriwayatkan bahawa: Beliau mendengar Aws bin Aws, sahabat Rasulullah (ﷺ) berkata: Rasulullah (ﷺ) bersabda: 'Sesiapa yang mandi pada hari Jumaat dan membasuh (ghassala), dan datang awal ke masjid, berjalan kaki dan tidak menunggang, dan duduk dekat dengan imam dan mendengar dengan teliti serta tidak bercakap sia-sia, maka bagi setiap langkah yang diambilnya dia akan mendapat (pahala) amalan setahun.'",
        "arabic_text": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا الْوَلِيدُ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ جَابِرٍ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ أَبَا الْأَشْعَثِ حَدَّثَهُ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ أَوْسَ بْنَ أَوْسٍ صَاحِبَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنِ اغْتَسَلَ يَوْمَ الْجُمُعَةِ وَغَسَلَ وَغَدَا وَابْتَكَرَ وَمَشَى وَلَمْ يَرْكَبْ،‏‏‏‏ وَدَنَا مِنَ الْإِمَامِ وَأَنْصَتَ وَلَمْ يَلْغُ،‏‏‏‏ كَانَ لَهُ بِكُلِّ خُطْوَةٍ عَمَلُ سَنَةٍ ."
      },
      {
        "id": 36374,
        "hadith_number": "1386",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Keutamaan Datang Awal untuk Solat Jumaat dan Catatan Malaikat",
        "perawi_melayu": "Abu Hurairah RA",
        "english_text": "It was narrated from Abu Hurairah that: The Prophet (ﷺ) said: When Friday comes, the angels sit at the doors of the masjid and record who comes to jumu'ah prayers. Then, when the imam comes out, the angels roll up their scrolls. The Messenger of Allah (ﷺ) said: 'The one who comes early to jumu'ah prayers is like one who sacrifices a camel, then like one who sacrifices a cow, then like one who sacrifices a sheep, then like one who sacrifices a duck, then like one who sacrifices a chicken, then like one who sacrifices an egg.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah RA bahawa: Nabi (ﷺ) bersabda: Apabila tiba hari Jumaat, para malaikat duduk di pintu-pintu masjid dan mencatat siapa yang datang untuk solat Jumaat. Kemudian, apabila imam keluar, para malaikat menggulung lembaran catatan mereka. Rasulullah (ﷺ) bersabda: 'Orang yang datang awal untuk solat Jumaat adalah seperti orang yang mengorbankan seekor unta, kemudian seperti orang yang mengorbankan seekor lembu, kemudian seperti orang yang mengorbankan seekor kambing, kemudian seperti orang yang mengorbankan seekor itik, kemudian seperti orang yang mengorbankan seekor ayam, kemudian seperti orang yang mengorbankan sebiji telur.'",
        "arabic_text": "أَخْبَرَنَا نَصْرُ بْنُ عَلِيِّ بْنِ نَصْرٍ، ‏‏‏‏‏‏عَنْ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنِ الْأَغَرِّ أَبِي عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِذَا كَانَ يَوْمُ الْجُمُعَةِ،‏‏‏‏ قَعَدَتِ الْمَلَائِكَةُ عَلَى أَبْوَابِ الْمَسْجِدِ فَكَتَبُوا مَنْ جَاءَ إِلَى الْجُمُعَةِ،‏‏‏‏ فَإِذَا خَرَجَ الْإِمَامُ طَوَتِ الْمَلَائِكَةُ الصُّحُفَ،‏‏‏‏ قَالَ:‏‏‏‏ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْمُهَجِّرُ إِلَى الْجُمُعَةِ كَالْمُهْدِي بَدَنَةً، ‏‏‏‏‏‏ثُمَّ كَالْمُهْدِي بَقَرَةً، ‏‏‏‏‏‏ثُمَّ كَالْمُهْدِي شَاةً، ‏‏‏‏‏‏ثُمَّ كَالْمُهْدِي بَطَّةً، ‏‏‏‏‏‏ثُمَّ كَالْمُهْدِي دَجَاجَةً، ‏‏‏‏‏‏ثُمَّ كَالْمُهْدِي بَيْضَةً ."
      },
      {
        "id": 36375,
        "hadith_number": "1387",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Keutamaan Datang Awal ke Masjid pada Hari Jumaat",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "It was narrated from Abu Hurairah, who was attributing it to the Prophet (ﷺ): When Friday comes, at every gate of the masjid there are angels who write down the people's names in the order in which they come, then when the imam comes out, they roll up the scrolls and listen to the khutbah. The one who comes early to the prayer is like the one who sacrifices a camel, then the one who comes after him is like the one who sacrifices a cow, then the one who comes after him is like the one who sacrifices a ram until he mentioned a chicken and an egg.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah, yang meriwayatkannya daripada Nabi (ﷺ): Apabila tiba hari Jumaat, di setiap pintu masjid terdapat malaikat yang mencatat nama-nama orang mengikut urutan kedatangan mereka, kemudian apabila imam keluar, mereka menggulung lembaran catatan dan mendengar khutbah. Orang yang datang awal untuk solat adalah seperti orang yang mengorbankan seekor unta, kemudian orang yang datang selepasnya adalah seperti orang yang mengorbankan seekor lembu, kemudian orang yang datang selepasnya adalah seperti orang yang mengorbankan seekor kibas sehingga beliau menyebut seekor ayam dan sebiji telur.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏حَدَّثَنَا الزُّهْرِيُّ، ‏‏‏‏‏‏عَنْ سَعِيدٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا كَانَ يَوْمُ الْجُمُعَةِ كَانَ عَلَى كُلِّ بَابٍ مِنْ أَبْوَابِ الْمَسْجِدِ مَلَائِكَةٌ يَكْتُبُونَ النَّاسَ عَلَى مَنَازِلِهِمُ الْأَوَّلَ فَالْأَوَّلَ،‏‏‏‏ فَإِذَا خَرَجَ الْإِمَامُ طُوِيَتِ الصُّحُفُ وَاسْتَمَعُوا الْخُطْبَةَ،‏‏‏‏ فَالْمُهَجِّرُ إِلَى الصَّلَاةِ كَالْمُهْدِي بَدَنَةً، ‏‏‏‏‏‏ثُمَّ الَّذِي يَلِيهِ كَالْمُهْدِي بَقَرَةً، ‏‏‏‏‏‏ثُمَّ الَّذِي يَلِيهِ كَالْمُهْدِي كَبْشًا حَتَّى ذَكَرَ الدَّجَاجَةَ وَالْبَيْضَةَ ."
      },
      {
        "id": 36376,
        "hadith_number": "1388",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Keutamaan Datang Awal ke Masjid pada Hari Jumaat",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "It was narrated from Abu Hurairah that: The Messenger of Allah (ﷺ) said: On Fridays the angels sit at the gates of the masjid writing down the peoples' names in the order in which they come. So the people are like a man who sacrifices a camel and like a man who sacrifices a camel, then like a man who sacrifices a cow and like a man who sacrifices a cow, then like a man who sacrifices a sheep and like a man who sacrifices a sheep, then like a man who sacrifices a chicken and like a man who sacrifices a chicken, then like a man who sacrifices a sparrow and like a man who sacrifices a sparrow, then like a man who sacrifices an egg and like a man who sacrifices an egg.",
        "malay_translation": "Daripada Abu Hurairah RA, bahawa Rasulullah ﷺ bersabda: Pada hari Jumaat, para malaikat duduk di pintu-pintu masjid, mencatat nama-nama orang mengikut urutan kedatangan mereka. Maka perumpamaan orang (yang datang awal) adalah seperti orang yang mengorbankan seekor unta, kemudian seperti orang yang mengorbankan seekor lembu, kemudian seperti orang yang mengorbankan seekor kambing, kemudian seperti orang yang mengorbankan seekor ayam, kemudian seperti orang yang mengorbankan seekor burung pipit, kemudian seperti orang yang mengorbankan sebiji telur.",
        "arabic_text": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا اللَّيْثُ، ‏‏‏‏‏‏عَنِ ابْنِ عَجْلَانَ، ‏‏‏‏‏‏عَنْ سُمَيٍّ، ‏‏‏‏‏‏عَنْ أَبِي صَالِحٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ تَقْعُدُ الْمَلَائِكَةُ يَوْمَ الْجُمُعَةِ عَلَى أَبْوَابِ الْمَسْجِدِ يَكْتُبُونَ النَّاسَ عَلَى مَنَازِلِهِمْ،‏‏‏‏ فَالنَّاسُ فِيهِ كَرَجُلٍ قَدَّمَ بَدَنَةً،‏‏‏‏ وَكَرَجُلٍ قَدَّمَ بَقَرَةً،‏‏‏‏ وَكَرَجُلٍ قَدَّمَ شَاةً،‏‏‏‏ وَكَرَجُلٍ قَدَّمَ دَجَاجَةً،‏‏‏‏ وَكَرَجُلٍ قَدَّمَ عُصْفُورًا،‏‏‏‏ وَكَرَجُلٍ قَدَّمَ بَيْضَةً ."
      },
      {
        "id": 36377,
        "hadith_number": "1389",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Keutamaan Mandi Wajib dan Berangkat Awal ke Masjid pada Hari Jumaat",
        "perawi_melayu": "Abu Hurairah RA",
        "english_text": "It was narrated from Abu Hurairah that: The Messenger of Allah (ﷺ) said: Whoever performs ghusl as from janabah on Friday, then comes (to the masjid), it is as if he sacrificed a camel. Then the one who comes in the second hour, it is as if he sacrificed a cow. Then the one who comes in the third hour, it is as if he sacrificed a ram. Then the one who comes in the fourth hour, it is as if he sacrificed a chicken. Then the one who comes in the fifth hour, it is as if he sacrificed an egg. Then when the imam comes out, the angels attend to listen to the khutbah.",
        "malay_translation": "Daripada Abu Hurairah RA, bahawa Rasulullah SAW bersabda: 'Sesiapa yang mandi wajib pada hari Jumaat seperti mandi janabah, kemudian dia pergi (ke masjid), maka seolah-olah dia telah mengorbankan seekor unta. Sesiapa yang pergi pada jam kedua, maka seolah-olah dia telah mengorbankan seekor lembu. Sesiapa yang pergi pada jam ketiga, maka seolah-olah dia telah mengorbankan seekor kibas. Sesiapa yang pergi pada jam keempat, maka seolah-olah dia telah mengorbankan seekor ayam. Sesiapa yang pergi pada jam kelima, maka seolah-olah dia telah mengorbankan sebiji telur. Kemudian apabila imam keluar (untuk berkhutbah), para malaikat akan hadir untuk mendengar khutbah.'",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ سُمَيٍّ، ‏‏‏‏‏‏عَنْ أَبِي صَالِحٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنِ اغْتَسَلَ يَوْمَ الْجُمُعَةِ غُسْلَ الْجَنَابَةِ، ‏‏‏‏‏‏ثُمَّ رَاحَ فَكَأَنَّمَا قَرَّبَ بَدَنَةً، ‏‏‏‏‏‏وَمَنْ رَاحَ فِي السَّاعَةِ الثَّانِيَةِ فَكَأَنَّمَا قَرَّبَ بَقَرَةً، ‏‏‏‏‏‏وَمَنْ رَاحَ فِي السَّاعَةِ الثَّالِثَةِ فَكَأَنَّمَا قَرَّبَ كَبْشًا، ‏‏‏‏‏‏وَمَنْ رَاحَ فِي السَّاعَةِ الرَّابِعَةِ فَكَأَنَّمَا قَرَّبَ دَجَاجَةً، ‏‏‏‏‏‏وَمَنْ رَاحَ فِي السَّاعَةِ الْخَامِسَةِ فَكَأَنَّمَا قَرَّبَ بَيْضَةً، ‏‏‏‏‏‏فَإِذَا خَرَجَ الْإِمَامُ حَضَرَتِ الْمَلَائِكَةُ يَسْتَمِعُونَ الذِّكْرَ ."
      },
      {
        "id": 36378,
        "hadith_number": "1390",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Keutamaan Waktu Mustajab Doa di Hari Jumaat",
        "perawi_melayu": "Diriwayatkan oleh Jabir bin 'Abdullah",
        "english_text": "It was narrated from Jabir bin 'Abdullah that: The Messenger of Allah (ﷺ) said: Friday is twelve hours in which there is no Muslim slave who asks Allah (SWT) for something but He will give it to him, so seek it in the last hour after 'Asr.",
        "malay_translation": "Diriwayatkan daripada Jabir bin 'Abdullah bahawa: Rasulullah (ﷺ) bersabda: Hari Jumaat itu ada dua belas jam; di mana tidak ada seorang hamba Muslim pun yang meminta sesuatu kepada Allah (SWT) melainkan Dia akan memberikannya kepadanya. Maka carilah waktu mustajab itu pada saat terakhir selepas Asar.",
        "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ سَوَّادِ بْنِ الْأَسْوَدِ بْنِ عَمْرٍو،‏‏‏‏ وَالْحَارِثُ بْنُ مِسْكِينٍ، ‏‏‏‏‏‏قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ، ‏‏‏‏‏‏عَنِ ابْنِ وَهْبٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ الْحَارِثِ، ‏‏‏‏‏‏عَنِ الْجُلَاحِ مَوْلَى عَبْدِ الْعَزِيزِ، ‏‏‏‏‏‏أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ حَدَّثَهُ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ يَوْمُ الْجُمُعَةِ اثْنَتَا عَشْرَةَ سَاعَةً، ‏‏‏‏‏‏لَا يُوجَدُ فِيهَا عَبْدٌ مُسْلِمٌ يَسْأَلُ اللَّهَ شَيْئًا إِلَّا آتَاهُ إِيَّاهُ،‏‏‏‏ فَالْتَمِسُوهَا آخِرَ سَاعَةٍ بَعْدَ الْعَصْرِ ."
      },
      {
        "id": 36379,
        "hadith_number": "1391",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Waktu Solat Jumaat dan Mengurus Unta Selepasnya",
        "perawi_melayu": "Ja'far bin Muhammad daripada ayahnya, daripada Jabir bin 'Abdullah",
        "english_text": "It was narrated that Ja'far bin Muhammad from his father, from Jabir bin 'Abdullah who said: We used to pray jumu'ah with the Messenger of Allah (ﷺ) then we would go back and tend to our camels. I said: At what time? He said: When the sun had passed its zenith.",
        "malay_translation": "Diriwayatkan daripada Ja'far bin Muhammad daripada ayahnya, daripada Jabir bin 'Abdullah yang berkata: Kami pernah solat Jumaat bersama Rasulullah (ﷺ) kemudian kami pulang dan mengurus unta-unta kami. Saya bertanya: Pada waktu bila? Beliau menjawab: Apabila matahari telah melepasi zenit (waktu tengah hari).",
        "arabic_text": "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنِي يَحْيَى بْنُ آدَمَ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا حَسَنُ بْنُ عَيَّاشٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قال:‏‏‏‏ كُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجُمُعَةَ ثُمَّ نَرْجِعُ فَنُرِيحُ نَوَاضِحَنَا ،‏‏‏‏ قُلْتُ:‏‏‏‏ أَيَّةَ سَاعَةٍ ؟ قَالَ:‏‏‏‏ زَوَالُ الشَّمْسِ ."
      },
      {
        "id": 36380,
        "hadith_number": "1392",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Solat Jumaat pada Awal Waktu",
        "perawi_melayu": "Iyas bin Al-Akwa'",
        "english_text": "Iyas bin Al-Akwa' narrated that his father said: We used to pray jumu'ah with the Messenger of Allah (ﷺ) then we would go back, and the walls had no shadow in which shade could be sought.",
        "malay_translation": "Iyas bin Al-Akwa' meriwayatkan bahawa bapanya berkata: Kami pernah solat Jumaat bersama Rasulullah (ﷺ) kemudian kami pulang, dan dinding-dinding tidak mempunyai bayang-bayang yang boleh dijadikan tempat berteduh.",
        "arabic_text": "أَخْبَرَنَا شُعَيْبُ بْنُ يُوسُفَ، ‏‏‏‏‏‏قال:‏‏‏‏ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ يَعْلَى بْنِ الْحَارِثِ، ‏‏‏‏‏‏قال:‏‏‏‏ سَمِعْتُ إِيَاسَ بْنَ سَلَمَةَ بْنِ الْأَكْوَعِيُحَدِّثُ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قال:‏‏‏‏ كُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجُمُعَةَ، ‏‏‏‏‏‏ثُمَّ نَرْجِعُ وَلَيْسَ لِلْحِيطَانِ فَيْءٌ يُسْتَظَلُّ بِهِ ."
      },
      {
        "id": 36381,
        "hadith_number": "1393",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Azan Ketiga pada Hari Jumaat",
        "perawi_melayu": "As-Sa'ib bin Yazid",
        "english_text": "As-Sa'ib bin Yazid narrated that: The first adhan used to be when the imam sat on the minbar on Friday, at the time of the Messenger of Allah (ﷺ) and Abu Bakr and 'Umar. During the caliphate of 'Uthman, when the number of people increased, 'Uthman commanded that a third adhan be given on Friday, so that adhan was given from the top of Az-Zawra, and that is how it remained.",
        "malay_translation": "As-Sa'ib bin Yazid meriwayatkan bahawa: Azan pertama adalah ketika imam duduk di atas mimbar pada hari Jumaat, pada zaman Rasulullah (ﷺ) dan Abu Bakr serta Umar. Semasa pemerintahan Khalifah Uthman, apabila bilangan orang bertambah, Uthman memerintahkan agar azan ketiga diberikan pada hari Jumaat, sehingga azan itu diberikan dari atas Az-Zawra, dan begitulah ia kekal.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏عَنْ يُونُسَ، ‏‏‏‏‏‏عَنِ ابْنِ شِهَابٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي السَّائِبُ بْنُ يَزِيدَ، ‏‏‏‏‏‏ أَنَّ الْأَذَانَ كَانَ أَوَّلُ حِينَ يَجْلِسُ الْإِمَامُ عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَعُمَرَ، ‏‏‏‏‏‏فَلَمَّا كَانَ فِي خِلَافَةِ عُثْمَانَ وَكَثُرَ النَّاسُ،‏‏‏‏ أَمَرَ عُثْمَانُ يَوْمَ الْجُمُعَةِ بِالْأَذَانِ الثَّالِثِ، ‏‏‏‏‏‏فَأُذِّنَ بِهِ عَلَى الزَّوْرَاءِ فَثَبَتَ الْأَمْرُ عَلَى ذَلِكَ ."
      },
      {
        "id": 36382,
        "hadith_number": "1394",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Azan Ketiga Diperintahkan Oleh Uthman Kerana Pertambahan Penduduk Madinah",
        "perawi_melayu": "As-Sa'ib bin Yazid",
        "english_text": "As-Sa'ib bin Yazid said: The third adhan was ordered by 'Uthman when the number of people in Al-Madinah increased. The Messenger of Allah (ﷺ) only had one adhan, and the adhan on Friday was when the imam sat down.",
        "malay_translation": "As-Sa'ib bin Yazid berkata: Azan ketiga diperintahkan oleh Uthman apabila bilangan penduduk di Madinah bertambah. Rasulullah (ﷺ) hanya mempunyai satu azan, dan azan pada hari Jumaat adalah ketika imam duduk.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يَعْقُوبُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبِي، ‏‏‏‏‏‏عَنْ صَالِحٍ، ‏‏‏‏‏‏عَنِ ابْنِ شِهَابٍ، ‏‏‏‏‏‏أَنَّ السَّائِبَ بْنَ يَزِيدَ أَخْبَرَهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنَّمَا أَمَرَ بِالتَّأْذِينِ الثَّالِثِ عُثْمَانُ حِينَ كَثُرَ أَهْلُ الْمَدِينَةِ، ‏‏‏‏‏‏وَلَمْ يَكُنْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيْرُ مُؤَذِّنٍ وَاحِدٍ، ‏‏‏‏‏‏وَكَانَ التَّأْذِينُ يَوْمَ الْجُمُعَةِ حِينَ يَجْلِسُ الْإِمَامُ ."
      },
      {
        "id": 36383,
        "hadith_number": "1395",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Amalan Bilal RA Melaungkan Azan dan Iqamah pada Hari Jumaat",
        "perawi_melayu": "As-Sa'ib bin Yazid RA",
        "english_text": "It was narrated that As-Sa'ib bin Yazid said: Bilal used to call the adhan when the Messenger of Allah (ﷺ) sat on the minbar on Friday, and when he came down he would say the Iqamah. It continued like that during the time of Abu Bakr and 'Umar, may Allah (SWT) be pleased with them.",
        "malay_translation": "Diriwayatkan daripada As-Sa'ib bin Yazid RA berkata: Bilal RA biasa melaungkan azan apabila Rasulullah SAW duduk di atas mimbar pada hari Jumaat, dan apabila baginda turun, Bilal akan membaca Iqamah. Amalan ini berterusan pada zaman Abu Bakr RA dan Umar RA, semoga Allah SWT meredhai mereka.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا الْمُعْتَمِرُ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنِ السَّائِبِ بْنِ يَزِيدَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ بِلَالٌ يُؤَذِّنُ إِذَا جَلَسَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ، ‏‏‏‏‏‏فَإِذَا نَزَلَ أَقَامَ، ‏‏‏‏‏‏ثُمَّ كَانَ كَذَلِكَ فِي زَمَنِ أَبِي بَكْرٍ وَعُمَرَ رَضِيَ اللَّهُ عَنْهُمَا ."
      },
      {
        "id": 36384,
        "hadith_number": "1396",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Anjuran Solat Dua Rakaat Ketika Imam Sudah Muncul",
        "perawi_melayu": "Jabir bin 'Abdullah",
        "english_text": "It was narrated that 'Amr bin Dinar said: I heard Jabir bin 'Abdullah say: 'The Messenger of Allah (ﷺ) said: If any one of you comes and the imam has appeared, let him pray two rak'ahs. Shu'bah (one of the narrators) said: On Friday.",
        "malay_translation": "Diriwayatkan bahawa 'Amr bin Dinar berkata: Saya mendengar Jabir bin 'Abdullah berkata: 'Rasulullah (ﷺ) bersabda: Jika salah seorang daripada kamu datang dan imam telah muncul (untuk berkhutbah), maka hendaklah dia solat dua rakaat.' Shu'bah (salah seorang perawi) berkata: Pada hari Jumaat.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا خَالِدٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ دِينَارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِذَا جَاءَ أَحَدُكُمْ وَقَدْ خَرَجَ الْإِمَامُ،‏‏‏‏ فَلْيُصَلِّ رَكْعَتَيْنِ ،‏‏‏‏ قَالَ شُعْبَةُ:‏‏‏‏ يَوْمَ الْجُمُعَةِ."
      },
      {
        "id": 36385,
        "hadith_number": "1397",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Tiang Kurma Menangis Ketika Rasulullah Berpindah ke Mimbar",
        "perawi_melayu": "Jabir bin 'Abdullah",
        "english_text": "Jabir bin 'Abdullah said: When the Messenger of Allah (ﷺ) delivered the khutbah, he used to lean against a palm tree trunk that formed one of the pillars of the masjid. When the minbar was made and he sat down on it, that pillar made a sound like the groaning of a camel, which the people of the masjid heard, until the Messenger of Allah (ﷺ) came down and embraced it, then it fell silent.",
        "malay_translation": "Jabir bin 'Abdullah meriwayatkan: Bahawa Rasulullah (ﷺ) apabila menyampaikan khutbah, baginda akan bersandar pada batang pohon kurma yang merupakan salah satu tiang masjid. Apabila mimbar telah dibuat dan baginda duduk di atasnya, tiang tersebut mengeluarkan bunyi seperti raungan unta, yang mana para jemaah masjid mendengarnya, sehingga Rasulullah (ﷺ) turun dan memeluknya, lalu tiang itu pun diam.",
        "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ سَوَّادِ بْنِ الْأَسْوَدِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏قال:‏‏‏‏ أَنْبَأَنَا ابْنُ جُرَيْجٍ، ‏‏‏‏‏‏أَنَّ أَبَا الزُّبَيْرِ أَخْبَرَهُ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا خَطَبَ يَسْتَنِدُ إِلَى جِذْعِ نَخْلَةٍ مِنْ سَوَارِي الْمَسْجِدِ، ‏‏‏‏‏‏فَلَمَّا صُنِعَ الْمِنْبَرُ وَاسْتَوَى عَلَيْهِ،‏‏‏‏ اضْطَرَبَتْ تِلْكَ السَّارِيَةُ كَحَنِينِ النَّاقَةِ حَتَّى سَمِعَهَا أَهْلُ الْمَسْجِدِ، ‏‏‏‏‏‏حَتَّى نَزَلَ إِلَيْهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاعْتَنَقَهَا فَسَكَتَتْ ."
      },
      {
        "id": 36386,
        "hadith_number": "1398",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Khutbah Duduk dan Teguran Berdasarkan Ayat Al-Quran",
        "perawi_melayu": "Ka'b bin 'Ujrah",
        "english_text": "It was narrated that Ka'b bin 'Ujrah said that: He entered the masjid and 'Abdur-Rahman bin Umm Al-Hakam was delivering the Khutbah while seated. He said: 'Look at this man who is delivering the khutbah while seated when Allah (SWT) says: And when they see some merchandise or some amusement they disperse headlong to it, and leave you standing.'",
        "malay_translation": "Diriwayatkan daripada Ka'b bin 'Ujrah RA berkata: Beliau masuk ke masjid dan 'Abdur-Rahman bin Umm Al-Hakam sedang menyampaikan Khutbah sambil duduk. Beliau berkata: 'Lihatlah orang ini yang menyampaikan khutbah sambil duduk sedangkan Allah SWT berfirman: Dan apabila mereka melihat perniagaan atau hiburan, mereka bersurai untuk menuju kepadanya dan meninggalkan engkau berdiri.'",
        "arabic_text": "أخبرنا أحمد بن عبد الله بن الحكم قال حدثنا محمد بن جعفر قال حدثنا شعبة عن منصور عن عمرو بن مرة عن أبي عبيدة عن كعب بن عجرة قال:‏‏‏‏ دخل المسجد وعبد الرحمن بن أم الحكم يخطب قاعدا فقال انظروا إلى هذا يخطب قاعدا وقد قال الله عز وجل ‏‏‏‏ وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما ‏‏‏‏ ‏.‏"
      },
      {
        "id": 36387,
        "hadith_number": "1399",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Ganjaran bagi Orang yang Mandi, Pergi Awal ke Masjid, Mendekati Imam dan Khusyuk Mendengar Khutbah",
        "perawi_melayu": "Aws bin Aws Ath-Thaqafi",
        "english_text": "It was narrated from Aws bin Aws Ath-Thaqafi that : The Messenger of Allah (ﷺ) said: Whoever washes (ghassala) and performs ghusl, and comes early to the masjid and sits near the imam, is attentive and does not engage in idle talk, for every step he takes he will have (the reward of) a year's worth of good deeds, its fasting and Qiyam prayer.",
        "malay_translation": "Diriwayatkan daripada Aws bin Aws Ath-Thaqafi bahawa: Rasulullah (ﷺ) bersabda: Sesiapa yang membasuh (ghassala) dan melakukan mandi wajib (ghusl), dan datang awal ke masjid dan duduk dekat dengan imam, khusyuk dan tidak bercakap sia-sia, maka bagi setiap langkah yang diambilnya akan mendapat (pahala) ganjaran amalan setahun, iaitu puasa dan solat malamnya.",
        "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ خَالِدٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنِي عُمَرُ بْنُ عَبْدِ الْوَاحِدِ، ‏‏‏‏‏‏قال:‏‏‏‏ سَمِعْتُ يَحْيَى بْنَ الْحَارِثِ يُحَدِّثُ،‏‏‏‏ عَنْ أَبِي الْأَشْعَثِ الصَّنْعَانِيِّ، ‏‏‏‏‏‏عَنْ أَوْسِ بْنِ أَوْسٍ الثَّقَفِيِّ، ‏‏‏‏‏‏عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ غَسَّلَ وَاغْتَسَلَ وَابْتَكَرَ وَغَدَا وَدَنَا مِنَ الْإِمَامِ وَأَنْصَتَ ثُمَّ لَمْ يَلْغُ، ‏‏‏‏‏‏كَانَ لَهُ بِكُلِّ خُطْوَةٍ كَأَجْرِ سَنَةٍ صِيَامِهَا وَقِيَامِهَا ."
      },
      {
        "id": 36388,
        "hadith_number": "1400",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Teguran Rasulullah SAW Kepada Lelaki Yang Mengganggu Jemaah",
        "perawi_melayu": "Abu Az-Zahiriyah",
        "english_text": "It was narrated from Abu Az-Zahiriyah about 'Abdullah bin Busr, he said: I was sitting beside him on Friday and he said: 'A man came, stepping over people's necks, and the Messenger of Allah (ﷺ) said: 'Sit down, you are disturbing people.",
        "malay_translation": "Diriwayatkan dari Abu Az-Zahiriyah dari Abdullah bin Busr, beliau berkata: Saya sedang duduk di sampingnya pada hari Jumaat dan beliau berkata: 'Seorang lelaki datang, melangkah leher orang ramai, dan Rasulullah ﷺ bersabda: 'Duduklah, kamu telah mengganggu orang ramai.'",
        "arabic_text": "أَخْبَرَنَا وَهْبُ بْنُ بَيَانٍ، ‏‏‏‏‏‏قال:‏‏‏‏ أَنْبَأَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏قال:‏‏‏‏ سَمِعْتُ مُعَاوِيَةَ بْنَ صَالِحٍ، ‏‏‏‏‏‏عَنْ أَبِي الزَّاهِرِيَّةِ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ، ‏‏‏‏‏‏قال:‏‏‏‏ كُنْتُ جَالِسًا إِلَى جَانِبِهِ يَوْمَ الْجُمُعَةِ،‏‏‏‏ فَقَالَ:‏‏‏‏ جَاءَ رَجُلٌ يَتَخَطَّى رِقَابَ النَّاسِ،‏‏‏‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَيِ اجْلِسْ فَقَدْ آذَيْتَ ."
      },
      {
        "id": 36389,
        "hadith_number": "1401",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Perintah untuk Solat Dua Rakaat bagi Orang yang Datang Ketika Nabi Berkhutbah Jumaat",
        "perawi_melayu": "Jabir bin 'Abdullah",
        "english_text": "Amr bin Dinar narrated that: He heard Jabir bin 'Abdullah say: A man came when the Prophet (ﷺ) was on the minbar on a Friday. He said to him: 'Have you prayed two rak'ahs?' He said: 'No.' He said: 'Pray.'",
        "malay_translation": "Amr bin Dinar meriwayatkan bahawa: Beliau mendengar Jabir bin 'Abdullah berkata: Seorang lelaki datang ketika Nabi (ﷺ) berada di atas mimbar pada hari Jumaat. Baginda bertanya kepadanya: 'Adakah kamu telah solat dua rakaat?' Dia berkata: 'Belum.' Baginda bersabda: 'Solatlah.'",
        "arabic_text": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ، ‏‏‏‏‏‏وَيُوسُفُ بْنُ سَعِيدٍ وَاللَّفْظُ لَهُ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا حَجَّاجٌ، ‏‏‏‏‏‏عَنِ ابْنِ جُرَيْجٍ، ‏‏‏‏‏‏قال:‏‏‏‏ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ جَاءَ رَجُلٌ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ، ‏‏‏‏‏‏فَقَالَ لَهُ:‏‏‏‏ أَرَكَعْتَ رَكْعَتَيْنِ ،‏‏‏‏ قَالَ:‏‏‏‏ لَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَارْكَعْ ."
      },
      {
        "id": 36390,
        "hadith_number": "1402",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Tegahan Bercakap Ketika Khutbah Jumaat",
        "perawi_melayu": "Abu Hurairah RA",
        "english_text": "It was narrated from Abu Hurairah that: The Messenger of Allah (ﷺ) said: Whoever says to his companion on Friday, when the imam is delivering the khutbah: 'Listen attentively,' has engaged in idle talk.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah RA bahawa: Rasulullah SAW bersabda: Sesiapa yang berkata kepada sahabatnya pada hari Jumaat, ketika imam sedang menyampaikan khutbah: 'Dengar dengan teliti,' maka dia telah melakukan perbuatan sia-sia.",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا اللَّيْثُ، ‏‏‏‏‏‏عَنْ عُقَيْلٍ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ قَالَ لِصَاحِبِهِ يَوْمَ الْجُمُعَةِ وَالْإِمَامُ يَخْطُبُ أَنْصِتْ،‏‏‏‏ فَقَدْ لَغَا ."
      },
      {
        "id": 36391,
        "hadith_number": "1403",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Larangan Bercakap Ketika Khutbah Jumaat",
        "perawi_melayu": "Diriwayatkan daripada",
        "english_text": "It was narrated from 'Abdullah bin Ibrahim bin Qariz and Sa'eed bin Al-Musayyab that: Abu Hurairah said: I heard the Messenger of Allah (ﷺ) say: 'If you say to your companion: Listen attentively on a Friday when the Imam is delivering the khutbah, then you have engaged in idle talk.'",
        "malay_translation": "Diriwayatkan daripada 'Abdullah bin Ibrahim bin Qariz dan Sa'eed bin Al-Musayyab bahawa: Abu Hurairah berkata: Aku mendengar Rasulullah (ﷺ) bersabda: 'Jika kamu berkata kepada sahabatmu: 'Dengar dengan teliti' pada hari Jumaat ketika Imam menyampaikan khutbah, maka sesungguhnya kamu telah melakukan perbuatan sia-sia.'",
        "arabic_text": "أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنِي أَبِي، ‏‏‏‏‏‏عَنْ جَدِّي، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنِي عُقَيْلٌ، ‏‏‏‏‏‏عَنِ ابْنِ شِهَابٍ، ‏‏‏‏‏‏عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ إِبْرَاهِيمَ بْنِ قَارِظٍ، ‏‏‏‏‏‏وَعَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، ‏‏‏‏‏‏أَنَّهُمَا حَدَّثَاهُ، ‏‏‏‏‏‏أَنَّأَبَا هُرَيْرَةَ، ‏‏‏‏‏‏قال:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ إِذَا قُلْتَ لِصَاحِبِكَ أَنْصِتْ يَوْمَ الْجُمُعَةِ وَالْإِمَامُ يَخْطُبُ،‏‏‏‏ فَقَدْ لَغَوْتَ ."
      },
      {
        "id": 36392,
        "hadith_number": "1404",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam An-Nasa`i",
        "tajuk_hadith": "Ganjaran Solat Jumaat dengan Bersuci dan Mendengar Khutbah",
        "perawi_melayu": "Salman (r.a.)",
        "english_text": "It was narrated that Salman said: The Messenger of Allah (ﷺ) said to me: 'There is no man who purifies himself on Friday as he is commanded, then comes out of his house to the Friday prayer, and listens attentively until he finishes his prayer, but it will be an expiation for what came before it the week before.",
        "malay_translation": "Diriwayatkan daripada Salman (r.a.), bahawa Rasulullah ﷺ bersabda kepadaku: 'Tidak ada seorang lelaki pun yang bersuci pada hari Jumaat sebagaimana yang diperintahkan, kemudian keluar dari rumahnya untuk solat Jumaat, dan mendengar dengan teliti sehingga selesai solatnya, melainkan ia akan menjadi penebus dosa untuk apa yang telah berlaku sebelumnya pada minggu sebelumnya.'",
        "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏قال:‏‏‏‏ أَنْبَأَنَا جَرِيرٌ، ‏‏‏‏‏‏عَنْ مَنْصُورٍ، ‏‏‏‏‏‏عَنْ أَبِي مَعْشَرٍ زِيَادِ بْنِ كُلَيْبٍ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْعَلْقَمَةَ، ‏‏‏‏‏‏عَنِ الْقَرْثَعِ الضَّبِّيِّ، ‏‏‏‏‏‏وَكَانَ مِنَ الْقُرَّاءِ الْأَوَّلِينَ، ‏‏‏‏‏‏عَنْ سَلْمَانَ، ‏‏‏‏‏‏قال:‏‏‏‏ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَا مِنْ رَجُلٍ يَتَطَهَّرُ يَوْمَ الْجُمُعَةِ كَمَا أُمِرَ، ‏‏‏‏‏‏ثُمَّ يَخْرُجُ مِنْ بَيْتِهِ حَتَّى يَأْتِيَ الْجُمُعَةَ وَيُنْصِتُ حَتَّى يَقْضِيَ صَلَاتَهُ، ‏‏‏‏‏‏إِلَّا كَانَ كَفَّارَةً لِمَا قَبْلَهُ مِنَ الْجُمُعَةِ ."
      },
      {
        "id": 36393,
        "hadith_number": "1405",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Khutbah Al-Hajah yang Diajarkan oleh Nabi (ﷺ)",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "It was narrated from 'Abdullah: The Prophet (ﷺ) taught us Khutbat Al-Hajah: Alhamduu lillahi nasta'inuhu wa nastagfiruhu, wa na'udhu billahi min shururi anfusina wa sayi'ati a'malina. Man yahdihillahu fala mudilla lahu wa man yudlil fala hadiya lahu. Wa ashhadu an la ilaha illallahu wa ashhadu anna Muhammadan 'abduhu wa rasuluhu. (Praise be to Allah, we seek His help and His forgiveness. We seek refuge in Allah from the evil of our own souls and from our bad deeds. Whomsoever Allah guides will never be led astray,and whomsoever Allah leaves astray, no one can guide. I bear witness that there is none worthy of worship except Allah, and I bear witness that Muhammad is His slave and Messenger.) Then he recited the following three verses: O you who believe! Fear Allah as He should be feared, and die not except as Muslims; O Mankind! Be dutiful to your Lord, Who created you from a single person, and from him he created his wife, and from them he created many men and women, and fear Allah through Whom you demand your mutual (rights), and (do not cut the relations of) the wombs (kinship). Surely, Allah is Ever and All-Watcher over you); O you who believe! Keep your duty to Allah and fear Him,and speak (always) the truth.)",
        "malay_translation": "Telah diriwayatkan daripada Abdullah: Nabi (ﷺ) mengajarkan kami Khutbah Al-Hajah: Alhamduu lillahi nasta'inuhu wa nastagfiruhu, wa na'udhu billahi min shururi anfusina wa sayi'ati a'malina. Man yahdihillahu fala mudilla lahu wa man yudlil fala hadiya lahu. Wa ashhadu an la ilaha illallahu wa ashhadu anna Muhammadan 'abduhu wa rasuluhu. (Segala puji bagi Allah, kami memohon pertolongan-Nya dan ampunan-Nya. Kami berlindung kepada Allah daripada kejahatan jiwa kami dan daripada keburukan amalan kami. Barangsiapa yang Allah beri hidayah, maka tidak ada yang dapat menyesatkannya, dan barangsiapa yang Allah sesatkan, maka tidak ada yang dapat memberinya hidayah. Aku bersaksi bahawa tiada Tuhan yang berhak disembah melainkan Allah, dan aku bersaksi bahawa Muhammad adalah hamba dan Rasul-Nya.) Kemudian baginda membaca tiga ayat berikut: Wahai orang-orang yang beriman! Bertaqwalah kepada Allah dengan sebenar-benar taqwa, dan janganlah kamu mati melainkan dalam keadaan Muslim; Wahai manusia! Bertaqwalah kepada Tuhanmu yang telah menciptakan kamu dari seorang diri, dan daripadanya Dia menciptakan isterinya, dan daripada keduanya Dia menciptakan ramai lelaki dan perempuan, dan bertaqwalah kepada Allah yang dengan nama-Nya kamu saling meminta, serta (peliharalah) hubungan rahim (kekeluargaan). Sesungguhnya Allah sentiasa menjadi Pengawas atas kamu); Wahai orang-orang yang beriman! Tetaplah bertaqwa kepada Allah dan takutlah kepada-Nya, dan berkatalah (sentiasa) benar.)",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏وَمُحَمَّدُ بْنُ بَشَّارٍ،‏‏‏‏ قَالَا:‏‏‏‏ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏قال:‏‏‏‏ سَمِعْتُ أَبَا إِسْحَاقَيُحَدِّثُ، ‏‏‏‏‏‏عَنْ أَبِي عُبَيْدَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ عَلَّمَنَا خُطْبَةَ الْحَاجَةِ، ‏‏‏‏‏‏الْحَمْدُ لِلَّهِ نَسْتَعِينُهُ وَنَسْتَغْفِرُهُ، ‏‏‏‏‏‏وَنَعُوذُ بِاللَّهِ مِنْ شُرُورِ أَنْفُسِنَا وَسَيِّئَاتِ أَعْمَالِنَا، ‏‏‏‏‏‏مَنْ يَهْدِهِ اللَّهُ فَلَا مُضِلَّ لَهُ وَمَنْ يُضْلِلْ فَلَا هَادِيَ لَهُ، ‏‏‏‏‏‏وَأَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ، ‏‏‏‏‏‏ثُمَّ يَقْرَأُ ثَلَاثَ آيَاتٍ يَأَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ وَلا تَمُوتُنَّ إِلا وَأَنْتُمْ مُسْلِمُونَ سورة آل عمران آية 102، ‏‏‏‏‏‏يَأَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ مِنْ نَفْسٍ وَاحِدَةٍ وَخَلَقَ مِنْهَا زَوْجَهَا وَبَثَّ مِنْهُمَا رِجَالا كَثِيرًا وَنِسَاءً وَاتَّقُوا اللَّهَ الَّذِي تَسَاءَلُونَ بِهِ وَالأَرْحَامَ إِنَّ اللَّهَ كَانَ عَلَيْكُمْ رَقِيبًا سورة النساء آية 1، ‏‏‏‏‏‏يَأَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَقُولُوا قَوْلا سَدِيدًا سورة الأحزاب آية 70،‏‏‏‏ قَالَ أَبُو عَبْد الرَّحْمَنِ:‏‏‏‏ أَبُو عُبَيْدَةَ لَمْ يَسْمَعْ مِنْ أَبِيهِ شَيْئًا،‏‏‏‏ وَلَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ،‏‏‏‏ وَلَا عَبْدُ الْجَبَّارِ بْنُ وَائِلِ بْنِ حُجْرٍ."
      },
      {
        "id": 36394,
        "hadith_number": "1406",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Anjuran Mandi Wajib Sebelum Solat Jumaat",
        "perawi_melayu": "Diriwayatkan oleh Ibn 'Umar RA",
        "english_text": "It was narrated that Ibn 'Umar said: The Messenger of Allah (ﷺ) delivered a khutbah and said: 'When any one of you wants to go to Jumu'ah, let him perform ghusl.'",
        "malay_translation": "Diriwayatkan daripada Ibn 'Umar RA berkata: Rasulullah SAW menyampaikan khutbah dan bersabda: 'Apabila salah seorang daripada kamu ingin pergi ke Jumaat, hendaklah dia mandi wajib.'",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنِ الْحَكَمِ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏قال:‏‏‏‏ خَطَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ:‏‏‏‏ إِذَا رَاحَ أَحَدُكُمْ إِلَى الْجُمُعَةِ فَلْيَغْتَسِلْ ."
      },
      {
        "id": 36395,
        "hadith_number": "1407",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Mandi Wajib Hari Jumaat Adalah Sunnah",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "It was narrated from Ibrahim bin Nashit that: He asked Ibn Shihab about ghusl on Friday. He said: It is a sunnah; Salim bin 'Abdullah told me, narrating from his father, that the Messenger of Allah (ﷺ) spoke about it from the minbar.",
        "malay_translation": "Diriwayatkan daripada Ibrahim bin Nashit bahawa: Beliau bertanya kepada Ibn Shihab mengenai mandi wajib pada hari Jumaat. Beliau berkata: Ia adalah sunnah; Salim bin 'Abdullah memberitahu saya, meriwayatkan daripada bapanya, bahawa Rasulullah (ﷺ) bersabda mengenainya dari atas mimbar.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ بْنِ نَشِيطٍ، ‏‏‏‏‏‏أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنِ الْغُسْلِ يَوْمَ الْجُمُعَةِ،‏‏‏‏ فَقَالَ:‏‏‏‏ سُنَّةٌ،‏‏‏‏ وَقَدْ حَدَّثَنِي بِهِ سَالِمُ بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَكَلَّمَ بِهَا عَلَى الْمِنْبَرِ ."
      },
      {
        "id": 36396,
        "hadith_number": "1408",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Mandi Sunat Hari Jumaat",
        "perawi_melayu": "Diriwayatkan daripada Abdullah bin Umar R.A.",
        "english_text": "It was narrated from 'Abdullah bin 'Abdullah (from 'Abdullah) Ibn 'Umar that: While he was standing on the minbar, the Messenger of Allah (ﷺ) said: Whoever among you comes (to prayer) on a Friday, let him perform ghusl.",
        "malay_translation": "Diriwayatkan daripada 'Abdullah bin 'Abdullah (daripada 'Abdullah) Ibn 'Umar bahawa: Ketika baginda berdiri di atas mimbar, Rasulullah (ﷺ) bersabda: Sesiapa di antara kamu yang datang (untuk solat) pada hari Jumaat, maka hendaklah dia mandi.",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا اللَّيْثُ، ‏‏‏‏‏‏عَنِ ابْنِ شِهَابٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، ‏‏‏‏‏‏عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏أَنَّهُ قَالَ وَهُوَ قَائِمٌ عَلَى الْمِنْبَرِ:‏‏‏‏ مَنْ جَاءَ مِنْكُمُ الْجُمُعَةَ فَلْيَغْتَسِلْ ،‏‏‏‏ قَالَ أَبُو عَبْد الرَّحْمَنِ:‏‏‏‏ مَا أَعْلَمُ أَحَدًا تَابَعَ اللَّيْثَ عَلَى هَذَا الْإِسْنَادِ، ‏‏‏‏‏‏غَيْرَ ابْنِ جُرَيْجٍ وَأَصْحَابُ الزُّهْرِيِّ،‏‏‏‏ يَقُولُونَ، ‏‏‏‏‏‏عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ أَبِيهِ بَدَلَ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ."
      },
      {
        "id": 36397,
        "hadith_number": "1409",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Galakan Bersedekah dan Kisah Lelaki Berpakaian Sederhana",
        "perawi_melayu": "Abu Sa'eed Al-Khudri",
        "english_text": "It was narrated that Iyad bin 'Abdullah said: I heard Abu Sa'eed Al-Khudri say: 'A man who appeared shabbily came on a Friday, while the Prophet (ﷺ) was delivering the Khutbah. The Messenger of Allah (ﷺ) said to him: 'Have you prayed? He said: 'No. He said: 'Pray two rak'ahs.' And he urged the people to give in charity. They gave clothes, and he gave him two garments. The following Friday, he came when the Messenger of Allah (ﷺ) was delivering the khutbah, and he urged the people to give charity. (That man) gave one of his two garments and the Messenger of Allah (ﷺ) said: 'This man came last Friday looking shabby, and I commanded the people to give charity and they gave clothes, and I said that he should be given two garments, and now he came and I commanded the people to give charity and he gave one of them. So he chided himself and said: Take your garment.'",
        "malay_translation": "Diriwayatkan daripada Iyad bin 'Abdullah, beliau berkata: Saya mendengar Abu Sa'eed Al-Khudri berkata: 'Seorang lelaki yang kelihatan sederhana pakaiannya datang pada hari Jumaat, ketika Nabi (ﷺ) sedang menyampaikan Khutbah. Rasulullah (ﷺ) bersabda kepadanya: 'Adakah kamu sudah solat? Lelaki itu menjawab: 'Belum.' Baginda bersabda: 'Solatlah dua rakaat.' Dan baginda menggalakkan orang ramai untuk bersedekah. Mereka memberikan pakaian, dan baginda memberikan lelaki itu dua helai pakaian. Pada hari Jumaat berikutnya, lelaki itu datang ketika Rasulullah (ﷺ) sedang menyampaikan khutbah, dan baginda menggalakkan orang ramai untuk bersedekah. Lelaki itu memberikan salah satu daripada dua helai pakaiannya, lalu Rasulullah (ﷺ) bersabda: 'Lelaki ini datang pada Jumaat lepas dengan pakaian yang sederhana, dan saya memerintahkan orang ramai untuk bersedekah lalu mereka memberikan pakaian, dan saya perintahkan agar dia diberikan dua helai pakaian, dan sekarang dia datang dan saya memerintahkan orang ramai untuk bersedekah dan dia memberikan salah satu daripadanya.' Kemudian baginda menegurnya dan bersabda: 'Ambillah kembali pakaianmu.'",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنِ ابْنِ عَجْلَانَ، ‏‏‏‏‏‏عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قال:‏‏‏‏ سَمِعْتُأَبَا سَعِيدٍ الْخُدْرِيَّ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ جَاءَ رَجُلٌ يَوْمَ الْجُمُعَةِ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ بِهَيْئَةٍ بَذَّةٍ، ‏‏‏‏‏‏فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَصَلَّيْتَ ،‏‏‏‏ قَالَ:‏‏‏‏ لَا،‏‏‏‏ قَالَ:‏‏‏‏ صَلِّ رَكْعَتَيْنِ ، ‏‏‏‏‏‏وَحَثَّ النَّاسَ عَلَى الصَّدَقَةِ، ‏‏‏‏‏‏فَأَلْقَوْا ثِيَابًا فَأَعْطَاهُ مِنْهَا ثَوْبَيْنِ، ‏‏‏‏‏‏فَلَمَّا كَانَتِ الْجُمُعَةُ الثَّانِيَةُ جَاءَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ، ‏‏‏‏‏‏فَحَثَّ النَّاسَ عَلَى الصَّدَقَةِ قَالَ:‏‏‏‏ فَأَلْقَى أَحَدَ ثَوْبَيْهِ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ جَاءَ هَذَا يَوْمَ الْجُمُعَةِ بِهَيْئَةٍ بَذَّةٍ، ‏‏‏‏‏‏فَأَمَرْتُ النَّاسَ بِالصَّدَقَةِ فَأَلْقَوْا ثِيَابًا، ‏‏‏‏‏‏فَأَمَرْتُ لَهُ مِنْهَا بِثَوْبَيْنِ، ‏‏‏‏‏‏ثُمَّ جَاءَ الْآنَ فَأَمَرْتُ النَّاسَ بِالصَّدَقَةِ فَأَلْقَى أَحَدَهُمَا فَانْتَهَرَهُ،‏‏‏‏ وَقَالَ:‏‏‏‏ خُذْ ثَوْبَكَ ."
      },
      {
        "id": 36398,
        "hadith_number": "1410",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Perintah untuk Menunaikan Solat Sunat Ketika Khutbah Jumaat",
        "perawi_melayu": "Jabir bin 'Abdullah",
        "english_text": "It was narrated from Jabir bin 'Abdullah who said: While the Prophet (ﷺ) was delivering the khutbah on Friday, a man came and the Prophet (ﷺ) said: 'Have you prayed?' He said: 'No.' He said: 'Stand up and pray.'",
        "malay_translation": "Diriwayatkan daripada Jabir bin 'Abdullah yang berkata: Ketika Nabi (ﷺ) sedang menyampaikan khutbah pada hari Jumaat, seorang lelaki datang dan Nabi (ﷺ) bersabda: 'Adakah kamu sudah solat sunat?' Dia berkata: 'Belum.' Baginda bersabda: 'Berdirilah dan solatlah.'",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ دِينَارٍ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قال:‏‏‏‏ بَيْنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ يَوْمَ الْجُمُعَةِ إِذْ جَاءَ رَجُلٌ،‏‏‏‏ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ صَلَّيْتَ ،‏‏‏‏ قَالَ:‏‏‏‏ لَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُمْ فَارْكَعْ ."
      },
      {
        "id": 36399,
        "hadith_number": "1411",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Keutamaan Al-Hasan dan Harapan Perdamaian Umat Islam",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Abu Bakrah said: I saw the Messenger of Allah (ﷺ) on the Minbar, and Al-Hasan was with him. He would turn to the people sometime and turn to him (Al-Hasan) sometimes, and he said: 'This son of mine is a leader (Sayyid) and Allah (SWT) may make peace between two large groups of Muslims through him.'",
        "malay_translation": "Abu Bakrah berkata: Saya melihat Rasulullah (ﷺ) di atas Mimbar, dan Al-Hasan bersama baginda. Baginda akan menghadap kepada orang ramai sekali-sekala dan menghadap kepadanya (Al-Hasan) sekali-sekala, dan baginda bersabda: 'Sesungguhnya anakku ini adalah seorang pemimpin (Sayyid) dan semoga Allah (SWT) mendamaikan antara dua golongan besar umat Islam melalui dirinya.'",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا أَبُو مُوسَى إِسْرَائِيلُ بْنُ مُوسَى، ‏‏‏‏‏‏قال:‏‏‏‏ سَمِعْتُ الْحَسَنَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ سَمِعْتُ أَبَا بَكْرَةَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ وَالْحَسَنُ مَعَهُ، ‏‏‏‏‏‏وَهُوَ يُقْبِلُ عَلَى النَّاسِ مَرَّةً وَعَلَيْهِ مَرَّةً،‏‏‏‏ وَيَقُولُ:‏‏‏‏ إِنَّ ابْنِي هَذَا سَيِّدٌ، ‏‏‏‏‏‏وَلَعَلَّ اللَّهَ أَنْ يُصْلِحَ بِهِ بَيْنَ فِئَتَيْنِ مِنَ الْمُسْلِمِينَ عَظِيمَتَيْنِ"
      },
      {
        "id": 36400,
        "hadith_number": "1412",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Hafalan Surah Qaf dari Mulut Rasulullah SAW di Mimbar pada Hari Jumaat",
        "perawi_melayu": "Anak perempuan Harithah bin An-Nu'man",
        "english_text": "It was narrated from Muhammad bin 'Abdur-Rahman that: The daughter of Harithah bin An-Nu'man said: I memorized 'Qaf. By the Glorious Qur'an.' From the mouth of the Messenger of Allah (ﷺ) when he was on the minbar on Friday.",
        "malay_translation": "Diriwayatkan daripada Muhammad bin 'Abdur-Rahman bahawa: Anak perempuan Harithah bin An-Nu'man berkata: Aku menghafal 'Qaf. Demi Al-Quran yang mulia.' Dari mulut Rasulullah (ﷺ) ketika baginda berada di atas mimbar pada hari Jumaat.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا هَارُونُ بْنُ إِسْمَاعِيلَ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا عَلِيٌّ وَهُوَ ابْنُ الْمُبَارَكِ، ‏‏‏‏‏‏عَنْ يَحْيَى، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنِ ابْنَةِ حَارِثَةَ بْنِ النُّعْمَانِ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ حَفِظْتُ ق وَالْقُرْءَانِ الْمَجِيدِ مِنْ فِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ ."
      },
      {
        "id": 36401,
        "hadith_number": "1413",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Larangan Mengangkat Tangan Berlebihan di Mimbar",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "It was narrated from Sufyan bin Husain that : Bishr bin Marwan raised his hands on Friday on the minbar, and 'Umarah bin Ruwaibah condemned him and said: The Messenger of Allah (ﷺ) did no more than this,' and he pointed with his forefinger.",
        "malay_translation": "Diriwayatkan daripada Sufyan bin Husain bahawa: Bishr bin Marwan mengangkat tangannya pada hari Jumaat di atas mimbar, dan 'Umarah bin Ruwaibah menegurnya dan berkata: Rasulullah (ﷺ) tidak melakukan lebih daripada ini,' dan beliau menunjuk dengan jari telunjuknya.",
        "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ حُصَيْنٍ، ‏‏‏‏‏‏أَنَّ بِشْرَ بْنَ مَرْوَانَ رَفَعَ يَدَيْهِ يَوْمَ الْجُمُعَةِ عَلَى الْمِنْبَرِ فَسَبَّهُ عُمَارَةُ بْنُ رُوَيْبَةَ الثَّقَفِيُّ، ‏‏‏‏‏‏وَقال:‏‏‏‏ مَا زَادَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى هَذَا، ‏‏‏‏‏‏وَأَشَارَ بِإِصْبَعِهِ السَّبَّابَةِ ."
      },
      {
        "id": 36402,
        "hadith_number": "1414",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Kasih Sayang Nabi Terhadap Cucu-cucunya: Hasan dan Husain Mengganggu Khutbah",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "It was narrated from 'Abdullah bin Buraidah that: His father said: The Prophet (ﷺ) was preaching, then Al-Hasan and Al-Husain came, wearing red shirts and stumbling in them. The Prophet (ﷺ) came down, interrupting himself, and picked them up, then he went back to the minbar and said: 'Allah has spoken the truth: Your wealth and your children are only a trial. I saw these two stumbling in their shirts and I could not continue until I had interrupted myself and picked them up.'",
        "malay_translation": "Diriwayatkan daripada Abdullah bin Buraidah bahawa: Bapanya berkata: Nabi (ﷺ) sedang berkhutbah, kemudian Al-Hasan dan Al-Husain datang, memakai baju merah dan tersandung di dalamnya. Nabi (ﷺ) turun (dari mimbar), menghentikan khutbahnya, dan mengangkat mereka berdua, kemudian baginda kembali ke mimbar dan bersabda: 'Allah telah berfirman benar: Sesungguhnya harta dan anak-anak kamu hanyalah cubaan. Aku melihat kedua-duanya tersandung dalam baju mereka dan aku tidak dapat meneruskan (khutbah) sehingga aku menghentikannya dan mengangkat mereka berdua.'",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، ‏‏‏‏‏‏عَنْ حُسَيْنِ بْنِ وَاقِدٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، ‏‏‏‏‏‏عَنْأَبِيهِ، ‏‏‏‏‏‏قال:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ فَجَاءَ الْحَسَنُ وَالْحُسَيْنُ رَضِيَ اللَّهُ عَنْهُمَا،‏‏‏‏ وَعَلَيْهِمَا قَمِيصَانِ أَحْمَرَانِ يَعْثُرَانِ فِيهِمَا، ‏‏‏‏‏‏فَنَزَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَطَعَ كَلَامَهُ،‏‏‏‏ فَحَمَلَهُمَا ثُمَّ عَادَ إِلَى الْمِنْبَرِ، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ صَدَقَ اللَّهُ إِنَّمَا أَمْوَالُكُمْ وَأَوْلادُكُمْ فِتْنَةٌ سورة التغابن آية 15،‏‏‏‏ رَأَيْتُ هَذَيْنِ يَعْثُرَانِ فِي قَمِيصَيْهِمَا، ‏‏‏‏‏‏فَلَمْ أَصْبِرْ حَتَّى قَطَعْتُ كَلَامِي فَحَمَلْتُهُمَا ."
      },
      {
        "id": 36403,
        "hadith_number": "1415",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Sifat-Sifat Rasulullah SAW: Zikir yang Banyak, Sedikit Bercakap Sia-Sia, Solat yang Panjang, dan Khutbah yang Pendek, serta Menolong Golongan Lemah",
        "perawi_melayu": "Abdullah bin Abi Awfa RA berkata:",
        "english_text": "Abdullah bin Abi Awfa said: The Messenger of Allah (ﷺ) used to recite a great deal of remembrance, engage little in idle talk, make the prayer long and keep the khutbah short, and he would not refrain from walking with a widow or poor person and tending to their needs.",
        "malay_translation": "Abdullah bin Abi Awfa RA berkata: Rasulullah SAW sering berzikir dengan banyak, kurang bercakap perkara sia-sia, memanjangkan solat, memendekkan khutbah, dan Baginda tidak pernah enggan untuk berjalan bersama seorang janda atau orang miskin serta menunaikan keperluan mereka.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ بْنِ غَزْوَانَ، ‏‏‏‏‏‏قال:‏‏‏‏ أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى، ‏‏‏‏‏‏عَنِ الْحُسَيْنِ بْنِ وَاقِدٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنِي يَحْيَى بْنُ عُقَيْلٍ، ‏‏‏‏‏‏قال:‏‏‏‏ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى يَقُولُ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكْثِرُ الذِّكْرَ وَيُقِلُّ اللَّغْوَ وَيُطِيلُ الصَّلَاةَ وَيُقَصِّرُ الْخُطْبَةَ، ‏‏‏‏‏‏وَلَا يَأْنَفُ أَنْ يَمْشِيَ مَعَ الْأَرْمَلَةِ وَالْمِسْكِينِ فَيَقْضِيَ لَهُ الْحَاجَةَ ."
      },
      {
        "id": 36404,
        "hadith_number": "1416",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Khutbah Nabi ﷺ Dilaksanakan Secara Berdiri",
        "perawi_melayu": "Jabir bin Samurah RA",
        "english_text": "It was narrated that Jabir bin Samurah said: I sat with the Prophet (ﷺ) and I did not see him deliver the khutbah except standing, and he sat, then he stood up and delivered the second khutbah.",
        "malay_translation": "Diriwayatkan daripada Jabir bin Samurah RA berkata: Aku duduk bersama Rasulullah ﷺ dan aku tidak pernah melihat baginda menyampaikan khutbah kecuali dalam keadaan berdiri, kemudian baginda duduk, kemudian baginda berdiri dan menyampaikan khutbah yang kedua.",
        "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا شَرِيكٌ، ‏‏‏‏‏‏عَنْ سِمَاكٍ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ سَمُرَةَ، ‏‏‏‏‏‏قال:‏‏‏‏ جَالَسْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَا رَأَيْتُهُ يَخْطُبُ إِلَّا قَائِمًا وَيَجْلِسُ، ‏‏‏‏‏‏ثُمَّ يَقُومُ فَيَخْطُبُ الْخُطْبَةَ الْآخِرَةَ ."
      },
      {
        "id": 36405,
        "hadith_number": "1417",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Rasulullah Menyampaikan Dua Khutbah Berdiri dan Memisahkannya dengan Duduk",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "It was narrated from 'Abdullah that: The Messenger of Allah (ﷺ) used to deliver two khutbahs standing, and he would separate them by sitting.",
        "malay_translation": "Diriwayatkan daripada Abdullah bahawa: Rasulullah (ﷺ) biasa menyampaikan dua khutbah dengan berdiri, dan Baginda memisahkan antara keduanya dengan duduk.",
        "arabic_text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا عُبَيْدُ اللَّهِ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ، ‏‏‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْطُبُ الْخُطْبَتَيْنِ وَهُوَ قَائِمٌ وَكَانَ يَفْصِلُ بَيْنَهُمَا بِجُلُوسٍ ."
      },
      {
        "id": 36406,
        "hadith_number": "1418",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Rasulullah SAW Berkhutbah Berdiri pada Hari Jumaat",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "It was narrated that Jabir bin Samurah said: I saw the Messenger of Allah (ﷺ) delivering the khutbah on Friday standing, then he sat briefly and did not speak, then he stood up and delivered a second khutbah. So whoever tells you that the Messenger of Allah (ﷺ) used to deliver the khutbah seated, he has lied.",
        "malay_translation": "Diriwayatkan daripada Jabir bin Samurah RA berkata: Aku melihat Rasulullah SAW menyampaikan khutbah pada hari Jumaat dalam keadaan berdiri, kemudian Baginda duduk sebentar dan tidak bercakap, kemudian Baginda berdiri dan menyampaikan khutbah kedua. Maka sesiapa yang memberitahu kamu bahawa Rasulullah SAW menyampaikan khutbah dalam keadaan duduk, maka sesungguhnya dia telah berdusta.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا إِسْرَائِيلُ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا سِمَاكٌ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ سَمُرَةَ، ‏‏‏‏‏‏قال:‏‏‏‏ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ يَوْمَ الْجُمُعَةِ قَائِمًا، ‏‏‏‏‏‏ثُمَّ يَقْعُدُ قِعْدَةً لَا يَتَكَلَّمُ، ‏‏‏‏‏‏ثُمَّ يَقُومُ فَيَخْطُبُ خُطْبَةً أُخْرَى، ‏‏‏‏‏‏فَمَنْ حَدَّثَكُمْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْطُبُ قَاعِدًا فَقَدْ كَذَبَ."
      },
      {
        "id": 36407,
        "hadith_number": "1419",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Khutbah dan Solat Nabi yang Sederhana Panjang",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "It was narrated that Jabir bin Samurah said: The Prophet (ﷺ) used to deliver the khutbah standing, then he would sit, then he would stand up and recite some Verses and remember Allah (SWT), the Mighty and Sublime. His khutbah was moderate in length and his prayer was moderate in length.",
        "malay_translation": "Diriwayatkan daripada Jabir bin Samurah RA berkata: Nabi ﷺ biasa menyampaikan khutbah dengan berdiri, kemudian Baginda duduk, kemudian Baginda berdiri dan membaca beberapa ayat dan mengingati Allah SWT, Yang Maha Perkasa dan Maha Agung. Khutbah Baginda sederhana panjangnya dan solat Baginda sederhana panjangnya.",
        "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ سِمَاكٍ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ سَمُرَةَ، ‏‏‏‏‏‏قال:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ قَائِمًا، ‏‏‏‏‏‏ثُمَّ يَجْلِسُ، ‏‏‏‏‏‏ثُمَّ يَقُومُ وَيَقْرَأُ آيَاتٍ وَيَذْكُرُ اللَّهَ عَزَّ وَجَلَّ، ‏‏‏‏‏‏وَكَانَتْ خُطْبَتُهُ قَصْدًا وَصَلَاتُهُ قَصْدًا ."
      },
      {
        "id": 36408,
        "hadith_number": "1420",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Nabi ﷺ Mendengar Kepada Orang Ramai Selepas Khutbah",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "It was narrated that Anas said: The Messenger of Allah (ﷺ) would come down from the minbar and a man would come to him and speak to him, then the Prophet (ﷺ) would listen to him until he gave him an answer, then he would go to his place of prayer and pray.",
        "malay_translation": "Diriwayatkan daripada Anas berkata: Rasulullah (ﷺ) akan turun dari mimbar dan seorang lelaki akan datang kepadanya dan bercakap dengannya, kemudian Nabi (ﷺ) akan mendengar kepadanya sehingga baginda memberikan jawapan kepadanya, kemudian baginda akan pergi ke tempat solatnya dan solat.",
        "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ عَلِيِّ بْنِ مَيْمُونٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا الْفِرْيَابِيُّ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، ‏‏‏‏‏‏عَنْ ثَابِتٍ الْبُنَانِيِّ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْزِلُ عَنِ الْمِنْبَرِ فَيَعْرِضُ لَهُ الرَّجُلُ فَيُكَلِّمُهُ، ‏‏‏‏‏‏فَيَقُومُ مَعَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى يَقْضِيَ حَاجَتَهُ، ‏‏‏‏‏‏ثُمَّ يَتَقَدَّمُ إِلَى مُصَلَّاهُ فَيُصَلِّي ."
      },
      {
        "id": 36409,
        "hadith_number": "1421",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Bilangan Rakaat Solat Jumaat, Hari Raya, dan Musafir",
        "perawi_melayu": "Abdur-Rahman bin Abi Laila",
        "english_text": "It was narrated from 'Abdur-Rahman bin Abi Laila that 'Umar said: Jumu'ah prayer is two rak'ahs, the prayer of Al-Fitr is two rak'ahs, the prayer of Al-Adha is two rak'ahs, the prayer when traveling is two rak'ahs, complete and not shortened, on the tongue of Muhammad (ﷺ).",
        "malay_translation": "Diriwayatkan daripada 'Abdur-Rahman bin Abi Laila bahawa 'Umar berkata: Solat Jumaat adalah dua rakaat, solat Aidilfitri adalah dua rakaat, solat Aidiladha adalah dua rakaat, solat ketika bermusafir adalah dua rakaat, sempurna dan tidak diringkaskan, (seperti yang diajarkan) melalui lisan Muhammad (ﷺ).",
        "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا شَرِيكٌ، ‏‏‏‏‏‏عَنْ زُبَيْدٍ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، ‏‏‏‏‏‏قال:‏‏‏‏ قَالَ عُمَرُ:‏‏‏‏ صَلَاةُ الْجُمُعَةِ رَكْعَتَانِ، ‏‏‏‏‏‏وَصَلَاةُ الْفِطْرِ رَكْعَتَانِ، ‏‏‏‏‏‏وَصَلَاةُ الْأَضْحَى رَكْعَتَانِ، ‏‏‏‏‏‏وَصَلَاةُ السَّفَرِ رَكْعَتَانِ، ‏‏‏‏‏‏تَمَامٌ غَيْرُ قَصْرٍ عَلَى لِسَانِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ،‏‏‏‏ قَالَ أَبُو عَبْد الرَّحْمَنِ:‏‏‏‏ عَبْدُ الرَّحْمَنِ بْنُ أَبِي لَيْلَى لَمْ يَسْمَعْ مِنْ عُمَرَ."
      },
      {
        "id": 36410,
        "hadith_number": "1422",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Bacaan Rasulullah SAW dalam Solat Subuh dan Jumaat",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "It was narrated from Ibn 'Abbas that : During the subh prayer on Friday, the Messenger of Allah (ﷺ) used to recite: Alif-Lam-Mim. The Revelation and: Has there not been over man, and in Jumu'ah prayer he would recite Al-Jumu'ah (62) and Al-Munafiqin (63).",
        "malay_translation": "Diriwayatkan daripada Ibn 'Abbas RA bahawa: Semasa solat Subuh pada hari Jumaat, Rasulullah SAW biasanya membaca: Alif-Lam-Mim. Wahyu dan: Bukankah telah datang kepada manusia suatu masa, dan dalam solat Jumaat Baginda membaca Surah Al-Jumu'ah (62) dan Al-Munafiqin (63).",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏قال:‏‏‏‏ أَخْبَرَنِي مُخَوَّلٌ، ‏‏‏‏‏‏قال:‏‏‏‏ سَمِعْتُ مُسْلِمًا الْبَطِينَ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ جُبَيْرٍ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ يَوْمَ الْجُمُعَةِ فِي صَلَاةِ الصُّبْحِ الم تَنْزِيلُ وَ هَلْ أَتَى عَلَى الْإِنْسَانِ وَفِي صَلَاةِ الْجُمُعَةِ بِسُورَةِ الْجُمُعَةِ وَالْمُنَافِقِينَ ."
      },
      {
        "id": 36411,
        "hadith_number": "1423",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Bacaan Rasulullah SAW dalam Solat Jumaat",
        "perawi_melayu": "Samurah",
        "english_text": "It was narrated that Samurah said: The Messenger of Allah (ﷺ) used to recite in jumu'ah prayer: 'Glorify the Name of your Lord, the Most Hight' and: 'Has there come to you the narration of the overwhelming (i.e. the Day of Resurrection)?",
        "malay_translation": "Diriwayatkan daripada Samurah, beliau berkata: Rasulullah (ﷺ) biasa membaca dalam solat Jumaat: 'Sucikanlah nama Tuhanmu Yang Maha Tinggi' dan: 'Adakah telah sampai kepadamu kisah tentang (hari kiamat) yang dahsyat?'",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا خَالِدٌ، ‏‏‏‏‏‏عَنْ شُعْبَةَ، ‏‏‏‏‏‏قال:‏‏‏‏ أَخْبَرَنِي مَعْبَدُ بْنُ خَالِدٍ، ‏‏‏‏‏‏عَنْ زَيْدِ بْنِ عُقْبَةَ، ‏‏‏‏‏‏عَنْسَمُرَةَ، ‏‏‏‏‏‏قال:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي صَلَاةِ الْجُمُعَةِ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَ هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ ."
      },
      {
        "id": 36412,
        "hadith_number": "1424",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Bacaan Rasulullah ﷺ pada Hari Jumaat Selepas Surah Al-Jumu'ah",
        "perawi_melayu": "Diriwayatkan daripada Ubaidullah bin Abdullah",
        "english_text": "Ad-Dahhak bin Qais asked An-Nu'man bin Bashir: What did the Messenger of Allah (ﷺ) use to recite on Friday after Surat Al-Jumu'ah? He said: He used to recite: 'Has there come to you the narration of the overwhelming (i.e. the Day of Resurrection)?'",
        "malay_translation": "Ad-Dahhak bin Qais bertanya kepada An-Nu'man bin Bashir: Apakah yang Rasulullah ﷺ baca pada hari Jumaat selepas Surah Al-Jumu'ah? Beliau berkata: Baginda ﷺ membaca: 'Sudahkah sampai kepadamu berita tentang (hari kiamat) yang dahsyat?'",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ ضَمْرَةَ بْنِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏أَنَّ الضَّحَّاكَ بْنَ قَيْسٍ،‏‏‏‏ سَأَلَ النُّعْمَانَ بْنَ بَشِيرٍ،‏‏‏‏ مَاذَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ يَوْمَ الْجُمُعَةِ عَلَى إِثْرِ سُورَةِ الْجُمُعَةِ ؟ قَالَ:‏‏‏‏ كَانَ يَقْرَأُ هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ ."
      },
      {
        "id": 36413,
        "hadith_number": "1425",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Bacaan Rasulullah SAW dalam Solat Jumaat dan Hari Raya",
        "perawi_melayu": "An-Nu'man bin Bashir",
        "english_text": "It was narrated that An-Nu'man bin Bashir said: The Messenger of Allah (ﷺ) used to recite 'Glorify the name of your Lord, the Most High' and 'Has there come to you the narration of the overwhelming (i.e. the day of resurrection)?' in the Jumu'ah prayer, and sometimes 'Eid and jumu'ah would fall on the same day, and he would recite them in both 'Eid and jumu'ah prayer.",
        "malay_translation": "Diriwayatkan bahawa An-Nu'man bin Bashir berkata: Rasulullah (ﷺ) biasa membaca 'Sucikanlah nama Tuhanmu Yang Maha Tinggi' dan 'Sudahkah sampai kepadamu berita tentang (hari kiamat) yang dahsyat?' dalam solat Jumaat, dan kadang-kadang 'Eid dan Jumaat jatuh pada hari yang sama, dan baginda membaca kedua-duanya dalam solat 'Eid dan Jumaat.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا خَالِدٌ، ‏‏‏‏‏‏عَنْ شُعْبَةَ، ‏‏‏‏‏‏أَنَّ إِبْرَاهِيمَ بْنَ مُحَمَّدِ بْنِ الْمُنْتَشِرِ أَخْبَرَهُ، ‏‏‏‏‏‏قال:‏‏‏‏ سَمِعْتُأَبِي يُحَدِّثُ، ‏‏‏‏‏‏عَنْ حَبِيبِ بْنِ سَالِمٍ، ‏‏‏‏‏‏عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، ‏‏‏‏‏‏قال:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الْجُمُعَةِ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَ هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ،‏‏‏‏ وَرُبَّمَا اجْتَمَعَ الْعِيدُ وَالْجُمُعَةُ،‏‏‏‏ فَيَقْرَأُ بِهِمَا فِيهِمَا جَمِيعًا ."
      },
      {
        "id": 36414,
        "hadith_number": "1426",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Mendapatkan Satu Rakaat Solat Jumaat Memadai",
        "perawi_melayu": "Abu Hurairah RA",
        "english_text": "It was narrated from Abu Hurairah that: The Prophet (ﷺ) said: Whoever catches up with a rak'ah of jumu'ah prayer has caught up with it.",
        "malay_translation": "Diriwayatkan dari Abu Hurairah RA bahawa: Nabi (ﷺ) bersabda: Sesiapa yang sempat mendapat satu rakaat solat Jumaat, maka dia telah mendapatkannya.",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ،‏‏‏‏ وَمُحَمَّدُ بْنُ مَنْصُورٍ وَاللَّفْظُ لَهُ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ أَدْرَكَ مِنْ صَلَاةِ الْجُمُعَةِ رَكْعَةً فَقَدْ أَدْرَكَ ."
      },
      {
        "id": 36415,
        "hadith_number": "1427",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Solat Empat Rakaat Selepas Solat Jumaat",
        "perawi_melayu": "Abu Hurairah RA",
        "english_text": "It was narrated that Abu Hurairah said: The Messenger of Allah (ﷺ) said: 'When any one of you prays jumu'ah let him pray four (rak'ahs) after that.'",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah RA berkata: Rasulullah SAW bersabda: 'Apabila salah seorang daripada kamu selesai solat Jumaat, maka hendaklah dia solat empat rakaat selepas itu.'",
        "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏قال:‏‏‏‏ أَنْبَأَنَا جَرِيرٌ، ‏‏‏‏‏‏عَنْ سُهَيْلٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قال:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا صَلَّى أَحَدُكُمُ الْجُمُعَةَ فَلْيُصَلِّ بَعْدَهَا أَرْبَعًا ."
      },
      {
        "id": 36416,
        "hadith_number": "1428",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Solat Sunat Selepas Solat Jumaat",
        "perawi_melayu": "Ibn 'Umar R.A.",
        "english_text": "It was narrated from Ibn 'Umar that: The Messenger of Allah (ﷺ) would not pray after jumu'ah until he had left, then he would pray two rak'ahs. (SAhih)",
        "malay_translation": "Diriwayatkan dari Ibn 'Umar bahawa: Rasulullah (ﷺ) tidak akan solat sunat selepas solat Jumaat sehingga baginda beredar, kemudian baginda akan solat dua rakaat. (Sahih)",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يُصَلِّي بَعْدَ الْجُمُعَةِ حَتَّى يَنْصَرِفَ فَيُصَلِّيَ رَكْعَتَيْنِ ."
      },
      {
        "id": 36417,
        "hadith_number": "1429",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Solat Sunat Dua Rakaat Selepas Jumaat di Rumah",
        "perawi_melayu": "Salim",
        "english_text": "It was narrated from Salim that: His father said: The Messenger of Allah (ﷺ) used to pray two rak'ahs in his house after jumu'ah.",
        "malay_translation": "Diriwayatkan daripada Salim bahawa: Bapanya berkata: Rasulullah (ﷺ) biasa solat dua rakaat di rumahnya selepas Jumaat.",
        "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏قال:‏‏‏‏ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ سَالِمٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قال:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ فِي بَيْتِهِ ."
      },
      {
        "id": 36418,
        "hadith_number": "1430",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad An-Nasa`i",
        "tajuk_hadith": "Solat Dua Rakaat Selepas Jumaat",
        "perawi_melayu": "Ibn 'Umar",
        "english_text": "It was narrated from Ibn 'Umar that: He used to pray two rak'ahs after jumu'ah, making them lengthy, and he said: The Messenger of Allah (ﷺ) used to do this.",
        "malay_translation": "Diriwayatkan daripada Ibn 'Umar bahawa: Beliau biasa menunaikan solat dua rakaat selepas Jumaat, dengan memanjangkannya, dan beliau berkata: Rasulullah (ﷺ) biasa melakukan ini.",
        "arabic_text": "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ يَزِيدَ وَهُوَ ابْنُ هَارُونَ، ‏‏‏‏‏‏قال:‏‏‏‏ أَنْبَأَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ أَيُّوبَ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏ أَنَّهُ كَانَ يُصَلِّي بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ يُطِيلُ فِيهِمَا،‏‏‏‏ وَيَقُولُ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُهُ ."
      },
      {
        "id": 36419,
        "hadith_number": "1431",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Kelebihan Hari Jumaat dan Waktu Mustajab Berdoa Padanya",
        "perawi_melayu": "Abu Hurairah RA",
        "english_text": "It was narrated that Abu Hurairah said: I went out to At-Tur and met Ka'b. He and I spent a day together, when I narrated things to him from the Messenger of Allah (ﷺ) and he narrated things to me from the Tawrah. I said to him: The Messenger of Allah (ﷺ) said: The best day on which the sun rises is Friday. On this day, Adam was created, on this day he was sent down, on it repentance was accepted, on this day he died, and on this day the Hour will begin. There is no living creature on Earth that does not listen out from Friday morning until the sun rises, fearing the onset of the Hour, except the son of Adam. On (Friday) there is an hour in which, if a believer prays and asks Allah (SWT) for something, He will give it to him. Ka'b said: Is than one day in every year? I said: No, it is every Friday.' Then Ka'b read in the Tawrah and said: The Messenger of Allah (ﷺ) spoke the truth; it is every Friday. Then I went out and met Basrah bin Abi Basrah Al-Ghifari. He said: From where have you come? I said: From At-Tur. He said: If I had met you before you went there, you would not have gone. I said to him: Why? He said: I heard the Messenger of Allah (ﷺ) say: Do not travel especially to visit a masjid except three: Al Masjid Al Haram (in Makkah), my masjid (in Al-Madinah) and the Masjid of Bait Al-Maqdis (in Jerusalem). Then I met 'Abdullah bin Salam and said: 'If you had only seen me, I went to At-Tur and met Ka'b, and he and I spent the day together, when I narrated things to him from the Messenger of Allah (ﷺ) and he narrated things to me from the Tawrah. I said to him: The Messenger of Allah (ﷺ) said: The best day on which the sun rises is Friday. On this day, Adam was created, on this day he was sent down, on it repentance was accepted, on this day he died, and on this day the Hour will begin. There is no living creature on Earth that does not listen out from Friday morning until the sun rises, fearing the onset of the Hour, except the son of Adam. On (Friday) there is an hour in which, if a believer prays and asks Allah (SWT) for something, He will give it to him. Ka'b said: That is one day in every year. 'Abdullah bin Salam said: Ka'b is not telling the truth. I said: Then Ka'b read (in the Tawrah) and said: The Messenger of Allah (ﷺ) spoke the truth; it is every Friday. 'Abdullah said: Ka'b spoke the truth; I know when that time is. I said: O my brother, tell me about it. He said: It is the last hour of Friday, before the sun sets. I said: Did you hear the Messenger of Allah (ﷺ) say: If a believer prays, but that is not a time for prayer. He said: Did you not hear the Messenger of Allah (ﷺ) say: Whoever prays and sits waiting for the (next) prayer, is in a state of prayer until the next prayer comes? I said: Of course. He said: That is what it is.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah RA, beliau berkata: Saya pergi ke Bukit Tursina dan bertemu dengan Ka'b Al-Ahbar. Saya dan beliau menghabiskan masa sehari bersama, saya meriwayatkan hadis daripada Rasulullah ﷺ kepadanya dan beliau meriwayatkan kisah-kisah daripada Taurat kepada saya. Saya berkata kepadanya: Rasulullah ﷺ bersabda: \"Sebaik-baik hari di mana matahari terbit adalah hari Jumaat. Pada hari itu Adam diciptakan, pada hari itu baginda diturunkan ke bumi, pada hari itu taubatnya diterima, pada hari itu baginda wafat, dan pada hari itu Kiamat akan terjadi. Tidak ada makhluk bernyawa di bumi ini melainkan ia akan mendengar (dengan penuh perhatian) pada pagi Jumaat sehingga terbit matahari, kerana takut akan datangnya Kiamat, kecuali anak Adam. Pada hari Jumaat, ada satu saat (waktu mustajab) yang mana jika seorang Mukmin berdoa dan meminta sesuatu kepada Allah SWT, pasti akan dikabulkan.\" Ka'b bertanya: \"Adakah waktu itu hanya sehari dalam setahun?\" Saya menjawab: \"Tidak, ia berlaku pada setiap hari Jumaat.\" Kemudian Ka'b membaca Taurat dan berkata: \"Benarlah sabda Rasulullah ﷺ, ia berlaku pada setiap hari Jumaat.\" Kemudian saya keluar dan bertemu dengan Basrah bin Abi Basrah Al-Ghifari. Beliau bertanya: \"Dari mana kamu datang?\" Saya menjawab: \"Dari Bukit Tursina.\" Beliau berkata: \"Sekiranya saya bertemu kamu sebelum kamu pergi ke sana, pasti kamu tidak akan pergi.\" Saya bertanya: \"Mengapa?\" Beliau menjawab: \"Saya mendengar Rasulullah ﷺ bersabda: 'Janganlah kamu bersusah payah melakukan perjalanan (dengan tujuan ibadah) kecuali ke tiga masjid: Masjid Al Haram (di Makkah), masjidku ini (di Madinah), dan Masjid Bait Al-Maqdis (di Jerusalem).\" Kemudian saya bertemu dengan Abdullah bin Salam RA dan berkata: \"Sekiranya kamu melihat apa yang telah saya lakukan, saya pergi ke Bukit Tursina dan bertemu dengan Ka'b Al-Ahbar, dan saya dan beliau menghabiskan masa sehari bersama, saya meriwayatkan hadis daripada Rasulullah ﷺ kepadanya dan beliau meriwayatkan kisah-kisah daripada Taurat kepada saya. Saya berkata kepadanya: Rasulullah ﷺ bersabda: 'Sebaik-baik hari di mana matahari terbit adalah hari Jumaat. Pada hari itu Adam diciptakan, pada hari itu baginda diturunkan ke bumi, pada hari itu taubatnya diterima, pada hari itu baginda wafat, dan pada hari itu Kiamat akan terjadi. Tidak ada makhluk bernyawa di bumi ini melainkan ia akan mendengar (dengan penuh perhatian) pada pagi Jumaat sehingga terbit matahari, kerana takut akan datangnya Kiamat, kecuali anak Adam. Pada hari Jumaat, ada satu saat (waktu mustajab) yang mana jika seorang Mukmin berdoa dan meminta sesuatu kepada Allah SWT, pasti akan dikabulkan.'\" Ka'b berkata: \"Waktu itu hanya sehari dalam setahun.\" Abdullah bin Salam RA berkata: \"Ka'b tidak benar.\" Saya berkata: \"Kemudian Ka'b membaca (dalam Taurat) dan berkata: 'Benarlah sabda Rasulullah ﷺ, ia berlaku pada setiap hari Jumaat.'\" Abdullah berkata: \"Ka'b benar; saya tahu bilakah waktu itu.\" Saya bertanya: \"Wahai saudaraku, beritahu saya bilakah waktu itu.\" Beliau menjawab: \"Ia adalah waktu terakhir pada hari Jumaat, sebelum matahari terbenam.\" Saya bertanya: \"Adakah kamu mendengar Rasulullah ﷺ bersabda: 'Jika seorang Mukmin berdoa,' sedangkan waktu itu bukanlah waktu solat?\" Beliau berkata: \"Tidakkah kamu mendengar Rasulullah ﷺ bersabda: 'Sesiapa yang solat dan duduk menunggu solat (berikutnya), maka dia dianggap dalam keadaan solat sehingga datang waktu solat berikutnya'\"? Saya menjawab: \"Ya, saya pernah mendengarnya.\" Beliau berkata: \"Itulah waktunya.\"",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا بَكْرٌ يَعْنِي ابْنَ مُضَرَ، ‏‏‏‏‏‏عَنِ ابْنِ الْهَادِ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قال:‏‏‏‏ أَتَيْتُ الطُّورَ فَوَجَدْتُ ثَمَّ كَعْبًا، ‏‏‏‏‏‏فَمَكَثْتُ أَنَا وَهُوَ يَوْمًا أُحَدِّثُهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَيُحَدِّثُنِي عَنِ التَّوْرَاةِ، ‏‏‏‏‏‏فَقُلْتُ لَهُ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ خَيْرُ يَوْمٍ طَلَعَتْ فِيهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ، ‏‏‏‏‏‏فِيهِ خُلِقَ آدَمُ وَفِيهِ أُهْبِطَ،‏‏‏‏ وَفِيهِ تِيبَ عَلَيْهِ،‏‏‏‏ وَفِيهِ قُبِضَ،‏‏‏‏ وَفِيهِ تَقُومُ السَّاعَةُ، ‏‏‏‏‏‏مَا عَلَى الْأَرْضِ مِنْ دَابَّةٍ إِلَّا وَهِيَ تُصْبِحُ يَوْمَ الْجُمُعَةِ مُصِيخَةً حَتَّى تَطْلُعَ الشَّمْسُ شَفَقًا مِنَ السَّاعَةِ إِلَّا ابْنَ آدَمَ، ‏‏‏‏‏‏وَفِيهِ سَاعَةٌ لَا يُصَادِفُهَا مُؤْمِنٌ وَهُوَ فِي الصَّلَاةِ يَسْأَلُ اللَّهَ فِيهَا شَيْئًا إِلَّا أَعْطَاهُ إِيَّاهُ ،‏‏‏‏ فَقَالَ كَعْبٌ:‏‏‏‏ ذَلِكَ يَوْمٌ فِي كُلِّ سَنَةٍ،‏‏‏‏ فَقُلْتُ:‏‏‏‏ بَلْ هِيَ فِي كُلِّ جُمُعَةٍ، ‏‏‏‏‏‏فَقَرَأَ كَعْبٌ التَّوْرَاةَ، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ صَدَقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُوَ فِي كُلِّ جُمُعَةٍ."
      },
      {
        "id": 36420,
        "hadith_number": "1432",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Keutamaan Hari Jumaat: Saat Mustajab Doa",
        "perawi_melayu": "Abu Hurairah RA",
        "english_text": "It was narrated from Abu Hurairah that: The Messenger of Allah (ﷺ) said: On Friday, there is an hour when, if a Muslim slave asks Allah (SWT) for something at that time, He will give it to him.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah RA bahawa: Rasulullah SAW bersabda: Pada hari Jumaat, terdapat satu saat yang mana jika seorang hamba Muslim meminta sesuatu kepada Allah SWT pada saat itu, pasti Allah akan memberikannya kepadanya.",
        "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا إِبْرَاهِيمُ بْنُ خَالِدٍ، ‏‏‏‏‏‏عَنْ رَبَاحٍ، ‏‏‏‏‏‏عَنْمَعْمَرٍ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنِي سَعِيدٌ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِنَّ فِي الْجُمُعَةِ سَاعَةً لَا يُوَافِقُهَا عَبْدٌ مُسْلِمٌ يَسْأَلُ اللَّهَ فِيهَا شَيْئًا إِلَّا أَعْطَاهُ إِيَّاهُ ."
      },
      {
        "id": 36421,
        "hadith_number": "1433",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Keberkatan Waktu Mustajab pada Hari Jumaat",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "It was narrated that Abu Hurairah said: Abu Al-Qasim (ﷺ) said: 'On Friday, there is an hour when, if a Muslim slave stands in prayer and asks Allah (SWT) for something at that time, He will give it to him.' He was reducing it: lessening it.",
        "malay_translation": "Diriwayatkan bahawa Abu Hurairah berkata: Abu Al-Qasim (ﷺ) bersabda: 'Pada hari Jumaat, ada satu saat yang mana, jika seorang hamba Muslim berdiri dalam solat dan meminta sesuatu kepada Allah (SWT) pada waktu itu, Dia akan memberikannya kepadanya.' Baginda meringankannya: mengurangkannya.",
        "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ، ‏‏‏‏‏‏قال:‏‏‏‏ أَنْبَأَنَا إِسْمَاعِيلُ، ‏‏‏‏‏‏عَنْ أَيُّوبَ، ‏‏‏‏‏‏عَنْ مُحَمَّدٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قال:‏‏‏‏ قَالَ أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ فِي الْجُمُعَةِ سَاعَةً لَا يُوَافِقُهَا عَبْدٌ مُسْلِمٌ قَائِمٌ يُصَلِّي يَسْأَلُ اللَّهَ عَزَّ وَجَلَّ شَيْئًا،‏‏‏‏ إِلَّا أَعْطَاهُ إِيَّاهُ ،‏‏‏‏ قُلْنَا:‏‏‏‏ يُقَلِّلُهَا يُزَهِّدُهَا، ‏‏‏‏‏‏قَالَ أَبُو عَبْد الرَّحْمَنِ:‏‏‏‏ لَا نَعْلَمُ أَحَدًا حَدَّثَ بِهَذَا الْحَدِيثِ غَيْرَ رَبَاحٍ، ‏‏‏‏‏‏عَنْ مَعْمَرٍ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ إِلَّا أَيُّوبَ بْنَ سُوَيْدٍ، ‏‏‏‏‏‏فَإِنَّهُ حَدَّثَ بِهِ، ‏‏‏‏‏‏عَنْ يُونُسَ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ سَعِيدٍ وَأَبِي سَلَمَةَ وَأَيُّوبُ بْنُ سُوَيْدٍ مَتْرُوكُ الْحَدِيثِ."
      }
    ]
  }
}