{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 27,
    "data": [
      {
        "id": 38379,
        "hadith_number": "3391",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Keutamaan Wanita, Wangian, dan Solat dalam Pandangan Rasulullah SAW",
        "perawi_melayu": "Anas bin Malik رضي الله عنه",
        "english_text": "Narrated Anas that the Messenger of Allah (peace and blessings be upon him) said: \"Among the worldly things I love are women and fragrances, and my eyes' delight is in prayer.",
        "malay_translation": "Daripada Anas رضي الله عنه bahawa Rasulullah SAW bersabda: \"Daripada perkara dunia, aku menyukai wanita dan wangian, dan kesenangan mataku adalah dalam solat.",
        "arabic_text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ عِيسَى الْقَوْمَسِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا سَلَّامٌ أَبُو الْمُنْذِرِ، ‏‏‏‏‏‏عَنْ ثَابِتٍ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ حُبِّبَ إِلَيَّ مِنَ الدُّنْيَا النِّسَاءُ،‏‏‏‏ وَالطِّيبُ، ‏‏‏‏‏‏وَجُعِلَ قُرَّةُ عَيْنِي فِي الصَّلَاةِ ."
      },
      {
        "id": 38380,
        "hadith_number": "3392",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Keutamaan Wanita, Wangian dan Solat",
        "perawi_melayu": "Anas bin Malik رضي الله عنه",
        "english_text": "Narrated Anas, that the Messenger of Allah (peace be upon him) said: 'I have been made to love women, fragrance, and prayer has been made the comfort of my eyes.'",
        "malay_translation": "Daripada Anas bin Malik رضي الله عنه, bahawa Rasulullah SAW bersabda, 'Aku dikurniakan kecintaan kepada wanita, wangian, dan solat dijadikan penyejuk mata ku.'",
        "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ مُسْلِمٍ الطُّوسِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا سَيَّارٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا جَعْفَرٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا ثَابِتٌ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ حُبِّبَ إِلَيَّ النِّسَاءُ،‏‏‏‏ وَالطِّيبُ،‏‏‏‏ وَجُعِلَتْ قُرَّةُ عَيْنِي فِي الصَّلَاةِ ."
      },
      {
        "id": 38381,
        "hadith_number": "3393",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Keutamaan Kuda di Sisi Rasulullah SAW Selepas Wanita",
        "perawi_melayu": "Anas bin Malik رضي الله عنه",
        "english_text": "Narrated Anas bin Malik رضي الله عنه that nothing was more beloved to the Messenger of Allah صلى الله عليه وسلم after women than horses.",
        "malay_translation": "Anas bin Malik رضي الله عنه meriwayatkan bahawa tiada sesuatu yang lebih dicintai oleh Rasulullah SAW selepas wanita melainkan kuda.",
        "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي أَبِي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَمْ يَكُنْ شَيْءٌ أَحَبَّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ النِّسَاءِ،‏‏‏‏ مِنَ الْخَيْلِ ."
      },
      {
        "id": 38382,
        "hadith_number": "3394",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Keadilan Antara Isteri",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "Whoever has two wives and inclines towards one of them, he will come on the Day of Resurrection with one side of his body leaning.",
        "malay_translation": "Sesiapa yang mempunyai dua orang isteri dan cenderung kepada salah seorang daripada mereka, dia akan datang pada Hari Kiamat dengan sebelah badannya senget.",
        "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا هَمَّامٌ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ النَّضْرِ بْنِ أَنَسٍ، ‏‏‏‏‏‏عَنْ بَشِيرِ بْنِ نَهِيكٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ كَانَ لَهُ امْرَأَتَانِ يَمِيلُ لِإِحْدَاهُمَا عَلَى الْأُخْرَى،‏‏‏‏ جَاءَ يَوْمَ الْقِيَامَةِ أَحَدُ شِقَّيْهِ مَائِلٌ ."
      },
      {
        "id": 38383,
        "hadith_number": "3395",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Keadilan Nabi Muhammad SAW dalam Pembahagian",
        "perawi_melayu": "Aisyah RA",
        "english_text": "Narrated `Aishah: Allah's Messenger (ﷺ) used to divide (his time) among his wives equally, then he would say: \"O Allah, this is my division in what I possess, so do not blame me in what You possess and I do not possess.\" Hammad bin Zaid sent it.",
        "malay_translation": "Diriwayatkan daripada Aisyah RA: Rasulullah SAW membahagikan (waktu) di kalangan isteri-isterinya secara sama rata, kemudian baginda bersabda: \"Ya Allah, ini adalah pembahagianku dalam apa yang aku miliki, maka janganlah Engkau mencelaku dalam apa yang Engkau miliki dan aku tidak memilikinya.\" Dihantar oleh Hammad bin Zaid.",
        "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَاعِيل بْنِ إِبْرَاهِيمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يَزِيدُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا حَمَّادُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَيُّوبَ، ‏‏‏‏‏‏عَنْ أَبِي قِلَابَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْسِمُ بَيْنَ نِسَائِهِ، ‏‏‏‏‏‏ثُمَّ يَعْدِلُ، ‏‏‏‏‏‏ثُمَّ يَقُولُ:‏‏‏‏ اللَّهُمَّ هَذَا فِعْلِي فِيمَا أَمْلِكُ،‏‏‏‏ فَلَا تَلُمْنِي فِيمَا تَمْلِكُ وَلَا أَمْلِكُ . أَرْسَلَهُ حَمَّادُ بْنُ زَيْدٍ."
      },
      {
        "id": 38384,
        "hadith_number": "3396",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Permintaan Keadilan untuk Anak Abu Quhafah dan Tindakan Nabi SAW",
        "perawi_melayu": "Ummu Al-Mukminin 'Aisyah r.a.",
        "english_text": "Narrated by 'Aishah (RA). The wives of the Prophet (peace be upon him) sent Fatimah bint Rasulullah (peace be upon him) to the Prophet (peace be upon him).  She sought permission to speak to him while he was reclining with me on my carpet. He permitted her.  She said: \"O Messenger of Allah! Your wives have sent me to you to ask for justice concerning the daughter of Abu Quhafah. I am silent on this matter.\" The Messenger of Allah (peace be upon him) said to her: \"O beloved daughter, do you not love the one whom I love?\" She replied: \"Yes.\" He said: \"Then love this (justice for the daughter of Abu Quhafah).\" Fatimah stood up when she heard this from the Messenger of Allah (peace be upon him) and returned to the wives of the Prophet (peace be upon him). She informed them of what she had said and what he had said to her. They said to her: \"We do not see you as having done anything to help us, so return to the Messenger of Allah (peace be upon him) and tell him that your wives request justice concerning the daughter of Abu Quhafah.\" Fatimah said: \"No by Allah, I will never speak to him about this again.\" Aisha (RA) narrates: The Prophet's wives then sent Zainab bint Jahsh to the Prophet (peace be upon him). She was among the wives of the Prophet (peace be upon him) who held a special place in the Prophet's heart. I have never seen a better woman in religion than Zainab, more pious to Allah, truthful in speech, more caring towards her relatives, more generous in charity, and more dedicated in her acts of worship except for a slight temper in her. She sought permission to speak to the Prophet (peace be upon him), and he was with me. He gave her permission. She said: \"O Messenger of Allah! Your wives have sent me to ask for justice concerning the daughter of Abu Quhafah, but I need to seek his approval.\" and I kept an eye on the Prophet, waiting for his permission. Zainab did not leave until she knew that the Messenger of Allah (peace be upon him) was not averse to me seeking justice, and upon receiving permission, I did not mention anything to him until I approached him, and he said: 'She is the daughter of Abu Bakr.'",
        "malay_translation": "Diceritakan oleh 'Aisyah (RA). Para isteri Nabi SAW telah menghantar Fatimah binti Rasulullah SAW kepada Nabi SAW. Beliau meminta izin untuk bercakap dengan Baginda sementara Baginda sedang bersandar bersamaku di atas hamparan permaidani saya. Baginda mengizinkannya. Fatimah berkata: \"Wahai Rasulullah! Isteri-isteri anda menghantar saya kepada anda untuk meminta keadilan bagi anak perempuan Abu Quhafah. Saya diam dalam perkara ini.\" Rasulullah SAW bertanya kepadanya: \"Wahai anakku yang dikasihi, tidakkah engkau menyukai orang yang aku sukai?\" Jawabnya: \"Ya.\" Baginda berkata: \"Maka sukai dan perjuangkan keadilan bagi anak perempuan Abu Quhafah ini.\" Fatimah bangun apabila mendengar itu dari Rasulullah SAW dan kembali kepada para isteri Nabi SAW. Beliau memberitahu mereka apa yang dikatakannya dan apa yang dikatakan Baginda kepadanya. Mereka berkata kepadanya: \"Kami tidak nampak anda melakukan sesuatu untuk membantu kami, jadi kembali kepada Rasulullah SAW dan sampaikan permintaan isteri-isteri anda untuk keadilan bagi anak perempuan Abu Quhafah.\" Fatimah berkata: \"Demi Allah, tidak, saya tidak akan bercakap dengan Baginda lagi tentang hal ini.\" 'Aisyah (RA) meneruskan kisahnya: Kemudian para isteri Nabi SAW menghantar Zainab binti Jahsy kepada Baginda. Beliau merupakan salah seorang isteri Nabi SAW yang mendapat tempat istimewa di hati Baginda. Saya tidak pernah melihat wanita yang lebih baik dalam agama daripada Zainab, lebih taat kepada Allah, lebih jujur dalam ucapannya, lebih menjaga silaturahim, lebih dermawan dalam sedekah, dan lebih berdedikasi dalam ibadahnya kecuali sedikit sifat marah yang ada padanya. Beliau meminta izin untuk berjumpa dengan Nabi SAW, dan Baginda bersamaku. Baginda mengizinkannya. Beliau berkata: \"Wahai Rasulullah! Isteri-isteri anda menghantar saya untuk meminta keadilan bagi anak perempuan Abu Quhafah, dan saya perlu meminta kebenaran anda.\"  Saya memerhatikan Baginda, menunggu kebenaran daripada Baginda. Zainab tidak pergi sehingga mengetahui bahawa Rasulullah SAW tidak keberatan saya menuntut keadilan. Setelah mendapat kebenaran, saya tidak menyebut apa-apa kepada Baginda sehingga saya menghampirinya, dan Baginda bersabda: 'Sesungguhnya dia adalah anak perempuan Abu Bakar.'",
        "arabic_text": "أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَمِّي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبِي، ‏‏‏‏‏‏عَنْ صَالِحٍ، ‏‏‏‏‏‏عَنِ ابْنِ شِهَابٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، ‏‏‏‏‏‏أَنَّ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ أَرْسَلَ أَزْوَاجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاطِمَةَ بِنْتَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ فَاسْتَأْذَنَتْ عَلَيْهِ وَهُوَ مُضْطَجِعٌ مَعِي فِي مِرْطِي، ‏‏‏‏‏‏فَأَذِنَ لَهَا، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏ إِنَّ أَزْوَاجَكَ أَرْسَلْنَنِي إِلَيْكَ يَسْأَلْنَكَ الْعَدْلَ فِي ابْنَةِ أَبِي قُحَافَةَ،‏‏‏‏ وَأَنَا سَاكِتَةٌ، ‏‏‏‏‏‏فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَيْ بُنَيَّةُ،‏‏‏‏ أَلَسْتِ تُحِبِّينَ مَنْ أُحِبُّ ؟ . قَالَتْ:‏‏‏‏ بَلَى. قَالَ:‏‏‏‏ فَأَحِبِّي هَذِهِ . فَقَامَتْ فَاطِمَةُ حِينَ سَمِعَتْ ذَلِكَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ فَرَجَعَتْ إِلَى أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ فَأَخْبَرَتْهُنَّ بِالَّذِي قَالَتْ وَالَّذِي قَالَ لَهَا، ‏‏‏‏‏‏فَقُلْنَ لَهَا:‏‏‏‏ مَا نَرَاكِ أَغْنَيْتِ عَنَّا مِنْ شَيْءٍ،‏‏‏‏ فَارْجِعِي إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُولِي لَهُ:‏‏‏‏ إِنَّ أَزْوَاجَكَ يَنْشُدْنَكَ الْعَدْلَ فِي ابْنَةِ أَبِي قُحَافَةَ. قَالَتْ فَاطِمَةُ:‏‏‏‏ لَا وَاللَّهِ،‏‏‏‏ لَا أُكَلِّمُهُ فِيهَا أَبَدًا. قَالَتْ عَائِشَةُ:‏‏‏‏ فَأَرْسَلَ أَزْوَاجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَيْنَبَ بِنْتَ جَحْشٍ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ الَّتِي كَانَتْ تُسَامِينِي مِنْ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَنْزِلَةِ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ وَلَمْ أَرَ امْرَأَةً قَطُّ خَيْرًا فِي الدِّينِ مِنْ زَيْنَبَ،‏‏‏‏ وَأَتْقَى لِلَّهِ عَزَّ وَجَلَّ،‏‏‏‏ وَأَصْدَقَ حَدِيثًا،‏‏‏‏ وَأَوْصَلَ لِلرَّحِمِ،‏‏‏‏ وَأَعْظَمَ صَدَقَةً،‏‏‏‏ وَأَشَدَّ ابْتِذَالًا لِنَفْسِهَا فِي الْعَمَلِ الَّذِي تَصَدَّقُ بِهِ،‏‏‏‏ وَتَقَرَّبُ بِهِ مَا عَدَا سَوْرَةً مِنْ حِدَّةٍ كَانَتْ فِيهَا تُسْرِعُ مِنْهَا الْفَيْئَةَ،‏‏‏‏ فَاسْتَأْذَنَتْ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَ عَائِشَةَ فِي مِرْطِهَا عَلَى الْحَالِ الَّتِي كَانَتْ دَخَلَتْ فَاطِمَةُ عَلَيْهَا،‏‏‏‏ فَأَذِنَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ فَقَالَتْ:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏ إِنَّ أَزْوَاجَكَ أَرْسَلْنَنِي يَسْأَلْنَكَ الْعَدْلَ فِي ابْنَةِ أَبِي قُحَافَةَ،‏‏‏‏ وَوَقَعَتْ بِي فَاسْتَطَالَتْ،‏‏‏‏ وَأَنَا أَرْقُبُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ وَأَرْقُبُ طَرْفَهُ هَلْ أَذِنَ لِي فِيهَا فَلَمْ تَبْرَحْ زَيْنَبُ حَتَّى عَرَفْتُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَكْرَهُ أَنْ أَنْتَصِرَ،‏‏‏‏ فَلَمَّا وَقَعْتُ بِهَا لَمْ أَنْشَبْهَا بِشَيْءٍ حَتَّى أَنْحَيْتُ عَلَيْهَا، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّهَا ابْنَةُ أَبِي بَكْرٍ ."
      },
      {
        "id": 38385,
        "hadith_number": "3397",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Perutusan Zainab kepada Nabi SAW",
        "perawi_melayu": "Sanad ini juga meriwayatkan bahawa",
        "english_text": "أَخْبَرَنِي عِمْرَانُ بْنُ بَكَّارٍ الْحِمْصِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو الْيَمَانِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا شُعَيْبٌ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، ‏‏‏‏‏‏أَنَّ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ فَذَكَرَتْ نَحْوَهُ، ‏‏‏‏‏‏وَقَالَتْ:‏‏‏‏ أَرْسَلَ أَزْوَاجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَيْنَبَ، ‏‏‏‏‏‏فَاسْتَأْذَنَتْ، ‏‏‏‏‏‏فَأَذِنَ لَهَا فَدَخَلَتْ، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ نَحْوَهُ . خَالَفَهُمَا مَعْمَرٌ رَوَاهُ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ.",
        "malay_translation": "Imran bin Bakkar al-Himsi telah mengkhabarkan kepadaku, katanya: Abu al-Yaman telah meriwayatkan kepada kami, katanya: Syuaib telah memberitahu kami, daripada al-Zuhri, katanya: Muhammad bin Abd al-Rahman bin al-Harith bin Hisyam telah mengkhabarkan kepadaku, bahawa Aisyah RA berkata: Lalu dia menyebutkan seumpamanya, dan dia berkata: Isteri-isteri Nabi SAW telah mengutus Zainab, lalu dia meminta izin, lalu diizinkan baginya lalu dia masuk, lalu dia berkata: Seumpamanya. Ma'mar telah menyelisihi keduanya, dia meriwayatkannya, daripada al-Zuhri, daripada Urwah, daripada Aisyah RA.",
        "arabic_text": "أَخْبَرَنِي عِمْرَانُ بْنُ بَكَّارٍ الْحِمْصِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو الْيَمَانِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا شُعَيْبٌ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، ‏‏‏‏‏‏أَنَّ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ فَذَكَرَتْ نَحْوَهُ، ‏‏‏‏‏‏وَقَالَتْ:‏‏‏‏ أَرْسَلَ أَزْوَاجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَيْنَبَ، ‏‏‏‏‏‏فَاسْتَأْذَنَتْ، ‏‏‏‏‏‏فَأَذِنَ لَهَا فَدَخَلَتْ، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ نَحْوَهُ . خَالَفَهُمَا مَعْمَرٌ رَوَاهُ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ."
      },
      {
        "id": 38386,
        "hadith_number": "3398",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Perbincangan dan Penyelesaian Isu Perselisihan Antar Isteri-Isteri Nabi SAW",
        "perawi_melayu": "Ustazah 'Aishah r.a.",
        "english_text": "The wives of the Prophet peace be upon him met and sent Fatimah to the Prophet peace be upon him. They said to her:  'Your wives are demanding justice in the case of the daughter of Abi Quhafah' [referring to a dispute]. She entered upon the Prophet peace be upon him, while he was with 'Aishah in her garment. She said to him: 'Your wives have sent me, and they are demanding justice in the case of the daughter of Abi Quhafah.' The Prophet peace be upon him said to her: 'Do you love me?' She said: 'Yes.' He said: 'Then love her [the daughter of Abi Quhafah].' She returned to them and told them what he had said. They said to her: 'You have done nothing, return to him.' She said: 'By Allah, I will never return to him in this matter.' The daughter of the Messenger of Allah peace be upon him was indeed rightful. Then they sent Zainab bint Jahsh. Aisha said: 'She was the one who used to compete with me from among the wives of the Prophet peace be upon him.' She said: 'Your wives have sent me, and they are demanding justice in the case of the daughter of Abi Quhafah,' then she turned to me, insulting me. I watched the Prophet peace be upon him and looked at his expression, whether he would allow me to retaliate against her. She insulted me until I thought that he did not object to me retaliating against her, so I faced her and soon silenced her. The Prophet peace be upon him said to her: 'She is the daughter of Abu Bakr.' Aisha said: 'I have not seen a woman better, more charitable, more righteous towards family ties, and more dedicated to acts of devotion towards Allah than Zainab, except for some hot temper which almost led to a disagreement.' Abu Abdurrahman said: 'This is a mistake, and the correct version is the previous one.'",
        "malay_translation": "Para isteri Nabi SAW berkumpul dan menghantar Fatimah kepada Nabi SAW. Mereka berkata kepadanya: 'Isteri-isteri engkau menuntut keadilan dalam hal anak perempuan Abi Quhafah' [merujuk kepada perselisihan tersebut]. Fatimah masuk menemui Nabi SAW, ketika baginda bersama 'Aishah di dalam pakaiannya. Dia berkata kepada baginda: 'Isteri-isteri engkau telah menghantar aku, dan mereka menuntut keadilan dalam hal anak perempuan Abi Quhafah.' Nabi SAW bersabda kepadanya: 'Engkau mencintai aku?' Dia menjawab: 'Ya.' Baginda bersabda: 'Maka sayangi (perempuan itu).'",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ النَّيْسَابُورِيُّ الثِّقَةُ الْمَأْمُونُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏عَنْ مَعْمَرٍ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ اجْتَمَعْنَ أَزْوَاجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَأَرْسَلْنَ فَاطِمَةَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقُلْنَ لَهَا:‏‏‏‏ إِنَّ نِسَاءَكَ وَذَكَرَ كَلِمَةً مَعْنَاهَا يَنْشُدْنَكَ الْعَدْلَ فِي ابْنَةِ أَبِي قُحَافَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ فَدَخَلَتْ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ وَهُوَ مَعَ عَائِشَةَ فِي مِرْطِهَا، ‏‏‏‏‏‏فَقَالَتْ لَهُ:‏‏‏‏ إِنَّ نِسَاءَكَ أَرْسَلْنَنِي،‏‏‏‏ وَهُنَّ يَنْشُدْنَكَ الْعَدْلَ فِي ابْنَةِ أَبِي قُحَافَةَ، ‏‏‏‏‏‏فَقَالَ لَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَتُحِبِّينِي ؟ قَالَتْ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَأَحِبِّيهَا . قَالَتْ:‏‏‏‏ فَرَجَعَتْ إِلَيْهِنَّ،‏‏‏‏ فَأَخْبَرَتْهُنَّ مَا قَالَ:‏‏‏‏ فَقُلْنَ لَهَا:‏‏‏‏ إِنَّكِ لَمْ تَصْنَعِي شَيْئًا فَارْجِعِي إِلَيْهِ، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ وَاللَّهِ،‏‏‏‏ لَا أَرْجِعُ إِلَيْهِ فِيهَا أَبَدًا. وَكَانَتِ ابْنَةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَقًّا،‏‏‏‏ فَأَرْسَلْنَ زَيْنَبَ بِنْتَ جَحْشٍ، ‏‏‏‏‏‏قَالَتْ عَائِشَةُ:‏‏‏‏ وَهِيَ الَّتِي كَانَتْ تُسَامِينِي مِنْ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ أَزْوَاجُكَ أَرْسَلْنَنِي،‏‏‏‏ وَهُنَّ يَنْشُدْنَكَ الْعَدْلَ فِي ابْنَةِ أَبِي قُحَافَةَ ثُمَّ أَقْبَلَتْ عَلَيَّ تَشْتِمُنِي،‏‏‏‏ فَجَعَلْتُ أُرَاقِبُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنْظُرُ طَرْفَهُ،‏‏‏‏ هَلْ يَأْذَنُ لِي مِنْ أَنْ أَنْتَصِرَ مِنْهَا، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ فَشَتَمَتْنِي حَتَّى ظَنَنْتُ أَنَّهُ لَا يَكْرَهُ أَنْ أَنْتَصِرَ مِنْهَا، ‏‏‏‏‏‏فَاسْتَقْبَلْتُهَا،‏‏‏‏ فَلَمْ أَلْبَثْ أَنْ أَفْحَمْتُهَا، ‏‏‏‏‏‏فَقَالَ لَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّهَا ابْنَةُ أَبِي بَكْرٍ ، ‏‏‏‏‏‏قَالَتْ عَائِشَةُ:‏‏‏‏ فَلَمْ أَرَ امْرَأَةً خَيْرًا،‏‏‏‏ وَلَا أَكْثَرَ صَدَقَةً،‏‏‏‏ وَلَا أَوْصَلَ لِلرَّحِمِ،‏‏‏‏ وَأَبْذَلَ لِنَفْسِهَا فِي كُلِّ شَيْءٍ يُتَقَرَّبُ بِهِ إِلَى اللَّهِ تَعَالَى مِنْ زَيْنَبَ،‏‏‏‏ مَا عَدَا سَوْرَةً مِنْ حِدَّةٍ كَانَتْ فِيهَا تُوشِكُ مِنْهَا الْفَيْئَةَ. قَالَ أَبُو عَبْد الرَّحْمَنِ:‏‏‏‏ هَذَا خَطَأٌ وَالصَّوَابُ الَّذِي قَبْلَهُ."
      },
      {
        "id": 38387,
        "hadith_number": "3399",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Keistimewaan Siti 'Aisyah di Kalangan Wanita",
        "perawi_melayu": "Daripada Abu Musa Al-Ash'ari رضي الله عنه",
        "english_text": "Daripada Abu Musa Al-Ash'ari رضي الله عنه yang meriwayatkan dari Nabi SAW, bahawa kelebihan Siti 'Aisyah di kalangan wanita seperti kelebihan hidangan 'Tharid' di kalangan makanan-makanan lain.",
        "malay_translation": "Dikhabarkan kepada kami oleh Ismail bin Mas'ud, katanya: Telah menceritakan kepada kami Bishr, iaitu Ibnu Al-Mufaddal, katanya: Telah menceritakan kepada kami Syu'bah, daripada Amru bin Murrah, daripada Murrah Al-Juhani, daripada Abu Musa, daripada Nabi SAW bersabda: Keistimewaan Siti 'Aisyah di kalangan wanita, seperti kelebihan hidangan 'Tharid' di kalangan makanan-makanan yang lain.",
        "arabic_text": "أَخْبَرَنَا إِسْمَاعِيل بْنُ مَسْعُودٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ الْمُفَضَّلِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ مُرَّةَ، ‏‏‏‏‏‏عَنْ مُرَّةَ الْجُهَنِيِّ، ‏‏‏‏‏‏عَنْ أَبِي مُوسَى، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ فَضْلُ عَائِشَةَ عَلَى النِّسَاءِ، ‏‏‏‏‏‏كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ ."
      },
      {
        "id": 38388,
        "hadith_number": "3400",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Keutamaan Aisyah (RA) Berbanding Wanita Lain",
        "perawi_melayu": "Daripada 'Aishah (RA)",
        "english_text": "The virtue of 'Aishah over other women is like the virtue of Ath-Tharid over other food.",
        "malay_translation": "Keutamaan Aishah (RA) berbanding wanita lain adalah seperti keutamaan Ath-Tharid berbanding makanan lain.",
        "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ خَشْرَمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا عِيسَى بْنُ يُونُسَ، ‏‏‏‏‏‏عَنِ ابْنِ أَبِي ذِئْبٍ، ‏‏‏‏‏‏عَنِ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ فَضْلُ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى سَائِر الطَّعَامِ ."
      },
      {
        "id": 38389,
        "hadith_number": "3401",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Larangan Menyakiti Rasulullah SAW Melalui Aisyah RA",
        "perawi_melayu": "Diriwayatkan daripada Aisyah RA",
        "english_text": "Not Available",
        "malay_translation": "Telah mengkhabarkan kepada kami Abu Bakr bin Ishaq As-Saghani, beliau berkata: Telah menceritakan kepada kami Shazaan, beliau berkata: Telah menceritakan kepada kami Hammad bin Zaid, daripada Hisham bin Urwah, daripada ayahnya, daripada Aisyah, beliau berkata: Rasulullah SAW bersabda: Wahai Ummu Salamah, janganlah kamu menyakitiku melalui Aisyah, kerana demi Allah, wahyu tidak pernah datang kepadaku di dalam selimut seorang wanita pun di antara kamu kecuali dia (Aisyah).",
        "arabic_text": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ إِسْحَاق الصَّغَانِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شَاذَانُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَا أُمَّ سَلَمَةَ، ‏‏‏‏‏‏لَا تُؤْذِينِي فِي عَائِشَةَ، ‏‏‏‏‏‏فَإِنَّهُ وَاللَّهِ مَا أَتَانِي الْوَحْيُ فِي لِحَافِ امْرَأَةٍ مِنْكُنَّ إِلَّا هِيَ ."
      },
      {
        "id": 38390,
        "hadith_number": "3402",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Isteri-isteri Nabi SAW Tidak Dibenarkan Bercakap Dengan Baginda SWT Ketika Wanita Lain Ada",
        "perawi_melayu": "Daripada Umm Salamah radhiyallahu 'anha",
        "english_text": "Akhbarani Muhammad bin Adam, 'an 'Abdah, 'an Hisham, 'an 'Auf bin al-Harith, 'an Ruqayyah, 'an Umm Salamah: anna nisaa' an-Nabi Shallallahu 'alayhi wa sallam kallamunahu an tukallim an-Nabi Shallallahu 'alayhi wa sallam, anna an-nassa kanu yatahrurun bi hadayahum yawma 'Aishah, wa taqulu lahu: innaa nuhibbul khaira kama tuhibb 'Aishah. Fakallamtahu, falam yujibha, falamma daara 'alayha kallamtahu aydan, falam yujibha, wa qulna: ma radda 'alayki? Qalat: lamyujibni. Qulna: la tad'ihi hatta yarudda 'alayki aw tanzurin maa yaqulu. Falamma daara 'alayha, kallamtahu, faqal: la tu'udhinni fi 'Aishah, fa innahu lam yanzil 'alayyal wahyu wa ana fi lihafi imra'atin minkun illa fi lihafi 'Aishah. Qal Abu Abd ar-Rahman: haadhaani al-haditsani sahihaani 'an 'Abdah.",
        "malay_translation": "Dikhabarkan kepadaku oleh Muhammad bin Adam, daripada 'Abdah, daripada Hisham, daripada 'Auf bin al-Harith, daripada Ruqayyah, daripada Umm Salamah r.a. bahawa para isteri Nabi SAW pernah meminta izin untuk berbicara dengan Baginda SAW, namun orang ramai ketika itu sering memberi hadiah kepada isteri Nabi SAW iaitu Siti 'Aisyah r.a. dan mereka berkata: “Kami menyukai kebaikan seperti yang disukai oleh Siti 'Aisyah.” Para isteri Nabi SAW pun berbicara kepada Baginda SAW, tetapi Baginda SAW tidak menjawab.  Selepas itu, apabila Baginda SAW kembali kepada mereka, para isteri Nabi SAW bertanya lagi, tetapi Baginda SAW tetap tidak menjawab. Kemudian, mereka bertanya, “Apakah jawapan yang diberikan kepada kamu?,” Umm Salamah r.a. menjawab, “Baginda SAW tidak menjawab.” Para isteri Nabi SAW berkata, “Jangan berhenti sehingga Baginda SAW menjawab atau kamu perhatikan apa yang Baginda SAW katakan.” Selepas itu, apabila Baginda SAW kembali kepada mereka, para isteri Nabi SAW bertanya lagi, dan Baginda SAW menjawab, “Janganlah kamu menyusahkan aku dengan urusan Siti 'Aisyah, kerana wahyu tidak turun kepadaku di dalam selimut salah seorang daripada kamu, melainkan hanya di dalam selimut Siti 'Aisyah.” Kata Abu Abd ar-Rahman, “Kedua-dua hadis ini sahih daripada 'Abdah.",
        "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ آدَمَ، ‏‏‏‏‏‏عَنْ عَبْدَةَ، ‏‏‏‏‏‏عَنْ هِشَامٍ، ‏‏‏‏‏‏عَنْ عَوْفِ بْنِ الْحَارِثِ، ‏‏‏‏‏‏عَنْ رُمَيْثَةَ، ‏‏‏‏‏‏عَنْ أُمِّ سَلَمَةَ:‏‏‏‏ أَنَّ نِسَاءَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَلَّمْنَهَا أَنْ تُكَلِّمَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ أَنَّ النَّاسَ كَانُوا يَتَحَرَّوْنَ بِهَدَايَاهُمْ يَوْمَ عَائِشَةَ، ‏‏‏‏‏‏وَتَقُولُ لَهُ:‏‏‏‏ إِنَّا نُحِبُّ الْخَيْرَ كَمَا تُحِبُّ عَائِشَةَ. فَكَلَّمَتْهُ، ‏‏‏‏‏‏فَلَمْ يُجِبْهَا،‏‏‏‏ فَلَمَّا دَارَ عَلَيْهَا كَلَّمَتْهُ أَيْضًا،‏‏‏‏ فَلَمْ يُجِبْهَا، ‏‏‏‏‏‏وَقُلْنَ:‏‏‏‏ مَا رَدَّ عَلَيْكِ ؟ قَالَتْ:‏‏‏‏ لَمْ يُجِبْنِي. قُلْنَ:‏‏‏‏ لَا تَدَعِيهِ حَتَّى يَرُدَّ عَلَيْكِ أَوْ تَنْظُرِينَ مَا يَقُولُ. فَلَمَّا:‏‏‏‏ دَارَ عَلَيْهَا،‏‏‏‏ كَلَّمَتْهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ لَا تُؤْذِينِي فِي عَائِشَةَ، ‏‏‏‏‏‏فَإِنَّهُ لَمْ يَنْزِلْ عَلَيَّ الْوَحْيُ وَأَنَا فِي لِحَافِ امْرَأَةٍ مِنْكُنَّ إِلَّا فِي لِحَافِ عَائِشَةَ . قَالَ أَبُو عَبْد الرَّحْمَنِ:‏‏‏‏ هَذَانِ الْحَدِيثَانِ صَحِيحَانِ عَنْ عَبْدَةَ."
      },
      {
        "id": 38391,
        "hadith_number": "3403",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Orang Ramai Memilih Hari Aisyah untuk Hadiah Mereka",
        "perawi_melayu": "Aisyah R.A.",
        "english_text": "Not Available",
        "malay_translation": "Telah mengkhabarkan kepada kami Ishaq bin Ibrahim, beliau berkata: Telah memberitakan kepada kami 'Abdah bin Sulaiman, beliau berkata: Telah menceritakan kepada kami Hisyam, daripada ayahnya, daripada Aisyah, beliau berkata: Orang ramai memilih hari Aisyah dengan hadiah-hadiah mereka, mereka mencari dengan demikian keredhaan Rasulullah SAW.",
        "arabic_text": "أَخْبَرَنَا إِسْحَاق بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا هِشَامٌ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَ النَّاسُ يَتَحَرَّوْنَ بِهَدَايَاهُمْ يَوْمَ عَائِشَةَ، ‏‏‏‏‏‏يَبْتَغُونَ بِذَلِكَ مَرْضَاةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ."
      },
      {
        "id": 38392,
        "hadith_number": "3404",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Nabi SAW Diberi Salam oleh Jibril di hadapan Aisyah RA",
        "perawi_melayu": "Aisyah RA",
        "english_text": "Narrated Aishah, \nAllah revealed to the Prophet peace be upon him, and I was with him. I stood and pushed the door between me and him, and when he was relieved of the matter, he said to me, 'O Aishah! Jibril gives you his greetings.",
        "malay_translation": "Dikisahkan oleh Aisyah رضي الله عنها, bahawa Allah SWT telah mewahyukan sesuatu kepada Nabi SAW, dan saya berada di sisi baginda. Saya berdiri dan menolak pintu di antara saya dan baginda, dan setelah keadaan baginda reda, baginda bersabda kepadaku, \"Wahai Aisyah! Jibril menghantar salam kepadamu.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ آدَمَ، ‏‏‏‏‏‏عَنْ عَبْدَةَ، ‏‏‏‏‏‏عَنْ هِشَامٍ، ‏‏‏‏‏‏عَنْ صَالِحِ بْنِ رَبِيعَةَ بْنِ هُدَيْرٍ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏، قَالَتْ:‏‏‏‏ أَوْحَى اللَّهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ وَأَنَا مَعَهُ، ‏‏‏‏‏‏فَقُمْتُ،‏‏‏‏ فَأَجَفْتُ الْبَابَ بَيْنِي وَبَيْنَهُ،‏‏‏‏ فَلَمَّا رُفِّهَ عَنْهُ، ‏‏‏‏‏‏قَالَ لِي:‏‏‏‏ يَا عَائِشَةُ،‏‏‏‏ إِنَّ جِبْرِيلَ يُقْرِئُكِ السَّلَامَ ."
      },
      {
        "id": 38393,
        "hadith_number": "3405",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Malaikat Jibril Menyampaikan Salam Kepada Aisyah RA",
        "perawi_melayu": "Daripada Aisyah RA",
        "english_text": "Narrated by Aishah (RA): The Prophet (peace be upon him) said to her: 'Gabriel greets you.'  She replied: 'And peace be upon him, and the mercy and blessings of Allah.  Do you see what we do not see?'",
        "malay_translation": "Diceritakan oleh Aisyah RA, bahawa Rasulullah SAW bersabda kepadanya: 'Malaikat Jibril memberi salam kepadamu.'  Lalu Aisyah RA menjawab: 'Dan salam sejahtera ke atasnya, dan rahmat serta keberkatan Allah.  Adakah engkau melihat apa yang tidak dapat kami lihat?'",
        "arabic_text": "أَخْبَرَنَا نُوحُ بْنُ حَبِيبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهَا:‏‏‏‏ إِنَّ جِبْرِيلَ يَقْرَأُ عَلَيْكِ السَّلَامَ . قَالَتْ:‏‏‏‏ وَعَلَيْهِ السَّلَامُ،‏‏‏‏ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، ‏‏‏‏‏‏تَرَى مَا لَا نَرَى."
      },
      {
        "id": 38394,
        "hadith_number": "3406",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Malaikat Jibril Mengucap Salam Kepada Aisyah",
        "perawi_melayu": "Daripada Aisyah رضي الله عنها",
        "english_text": "Narrated Aisha, Allah be pleased with her: The Messenger of Allah, peace and blessings be upon him, said, 'O Aisha, this is Jibril, and he is conveying greetings to you.'  The same applies. Abu Abdurrahman said: 'This is correct, and the one before it is incorrect.'",
        "malay_translation": "Dikisahkan daripada Aisyah رضي الله عنها, bahawa Rasulullah SAW bersabda, \"Wahai Aisyah, ini Jibril dan dia sedang menyampaikan salam kepadamu.\"  Perkara yang sama berlaku dalam hal ini. Abu Abdurrahman berkata, \"Inilah yang betul, dan yang sebelumnya adalah salah.\"",
        "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا شُعَيْبٌ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي أَبُو سَلَمَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَا عَائِشَةُ،‏‏‏‏ هَذَا جِبْرِيلُ وَهُوَ يَقْرَأُ عَلَيْكِ السَّلَامَ . مِثْلَهُ سَوَاءٌ، ‏‏‏‏‏‏قَالَ أَبُو عَبْد الرَّحْمَنِ:‏‏‏‏ هَذَا الصَّوَابُ،‏‏‏‏ وَالَّذِي قَبْلَهُ خَطَأٌ."
      },
      {
        "id": 38395,
        "hadith_number": "3407",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Nabi SAW Mengumpul Makanan Yang Terburai",
        "perawi_melayu": "Perawi: (Maklumat Perawi dalam Bahasa Melayu diperlukan)",
        "english_text": null,
        "malay_translation": "Dikisahkan, bahawa Nabi SAW berada di sisi salah seorang ibu-ibu mukmin.  Kemudian, seorang ibu mukmin yang lain menghantar makanan dalam sebuah pinggan.  Ketika Nabi SAW ingin mengambil makanan itu, tangan Baginda menyentuh pinggan tersebut lalu menyebabkan pinggan itu jatuh dan pecah.  Nabi SAW mengambil kedua-dua kepingan pinggan itu, dan menyatukannya. Baginda kemudian mengumpulkan sisa makanan itu dan bersabda, \"Makanlah, wahai kaumku.\" Lalu mereka semua makan.  Selepas itu, ibu mukmin yang menghantar makanan tersebut datang membawa pinggan yang baru dan sempurna, tetapi meninggalkan pinggan yang pecah tadi di rumahnya.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا خَالِدٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حُمَيْدٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَنَسٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ إِحْدَى أُمَّهَاتِ الْمُؤْمِنِينَ، ‏‏‏‏‏‏فَأَرْسَلَتْ أُخْرَى بِقَصْعَةٍ فِيهَا طَعَامٌ، ‏‏‏‏‏‏فَضَرَبَتْ يَدَ الرَّسُولِ، ‏‏‏‏‏‏فَسَقَطَتِ الْقَصْعَةُ، ‏‏‏‏‏‏فَانْكَسَرَتْ،‏‏‏‏ فَأَخَذَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْكِسْرَتَيْنِ، ‏‏‏‏‏‏فَضَمَّ إِحْدَاهُمَا إِلَى الْأُخْرَى، ‏‏‏‏‏‏فَجَعَلَ يَجْمَعُ فِيهَا الطَّعَامَ،‏‏‏‏ وَيَقُولُ:‏‏‏‏ غَارَتْ أُمُّكُمْ كُلُوا . فَأَكَلُوا، ‏‏‏‏‏‏فَأَمْسَكَ حَتَّى جَاءَتْ بِقَصْعَتِهَا الَّتِي فِي بَيْتِهَا،‏‏‏‏ فَدَفَعَ الْقَصْعَةَ الصَّحِيحَةَ إِلَى الرَّسُولِ وَتَرَكَ الْمَكْسُورَةَ فِي بَيْتِ الَّتِي كَسَرَتْهَا."
      },
      {
        "id": 38396,
        "hadith_number": "3408",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Cemburunya Aisyah dan Tindakan Nabi Terhadapnya",
        "perawi_melayu": "Ummu Salamah R.A.",
        "english_text": "Not Available",
        "malay_translation": "Telah mengkhabarkan kepada kami Ar-Rabi' bin Sulaiman, beliau berkata: Telah menceritakan kepada kami Asad bin Musa, beliau berkata: Telah menceritakan kepada kami Hammad bin Salamah, daripada Thabit, daripada Abu Al-Mutawakkil, daripada Ummu Salamah: Bahawa beliau (yakni Ummu Salamah) datang membawa makanan di dalam sebuah pinggan kepada Rasulullah SAW dan para sahabatnya. Lalu Aisyah datang dengan memakai kain sarung, dan bersamanya sepotong batu, lalu beliau memecahkan pinggan tersebut dengannya. Maka Nabi SAW mengumpulkan kedua pecahan pinggan itu, dan bersabda: \"Makanlah, ibu kamu cemburu,\" sebanyak dua kali. Kemudian Rasulullah SAW mengambil pinggan Aisyah, lalu mengirimkannya kepada Ummu Salamah dan memberikan pinggan Ummu Salamah kepada Aisyah.",
        "arabic_text": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَسَدُ بْنُ مُوسَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏عَنْ ثَابِتٍ، ‏‏‏‏‏‏عَنْ أَبِي الْمُتَوَكِّلِ، ‏‏‏‏‏‏عَنْ أُمِّ سَلَمَةَ:‏‏‏‏ أَنَّهَا يَعْنِي أَتَتْ بِطَعَامٍ فِي صَحْفَةٍ لَهَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابِهِ، ‏‏‏‏‏‏فَجَاءَتْ عَائِشَةُ مُتَّزِرَةً بِكِسَاءٍ،‏‏‏‏ وَمَعَهَا فِهْرٌ،‏‏‏‏ فَفَلَقَتْ بِهِ الصَّحْفَةَ،‏‏‏‏ فَجَمَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ فِلْقَتَيِ الصَّحْفَةِ،‏‏‏‏ وَيَقُولُ:‏‏‏‏ كُلُوا،‏‏‏‏ غَارَتْ أُمُّكُمْ ،‏‏‏‏ مَرَّتَيْنِ. ثُمَّ أَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَحْفَةَ عَائِشَةَ، ‏‏‏‏‏‏فَبَعَثَ بِهَا إِلَى أُمِّ سَلَمَةَ وَأَعْطَى صَحْفَةَ أُمِّ سَلَمَةَ عَائِشَةَ ."
      },
      {
        "id": 38397,
        "hadith_number": "3409",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Keistimewaan  Perbuatan Siti Khadijah  dalam Memberi Makanan Kepada Nabi SAW",
        "perawi_melayu": "Daripada Aisyah رضي الله عنها",
        "english_text": null,
        "malay_translation": "Dikhabarkan kepada kami oleh Muhammad bin Al-Musanna, dari Abdurrahman, dari Sufyan, dari Fulait, dari Jasrah binti Dajajah, dari Aisyah رضي الله عنها, beliau berkata: \"Aku tidak pernah melihat orang yang pandai memasak seperti  Safiyyah yang menghadiahkan kepada Nabi SAW  sebuah bekas berisi makanan. Aku sangat terdorong untuk memecahkannya.  Oleh itu, aku bertanya kepada Nabi SAW tentang kafaratnya. Baginda SAW menjawab: 'Bekas sama dengan bekas dan makanan sama dengan makanan.'\" ",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏عَنْ فُلَيْتٍ، ‏‏‏‏‏‏عَنْ جَسْرَةَ بِنْتِ دَجَاجَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ مَا رَأَيْتُ صَانِعَةَ طَعَامٍ مِثْلَ صَفِيَّةَ أَهْدَتْ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَاءً فِيهِ طَعَامٌ، ‏‏‏‏‏‏فَمَا مَلَكْتُ نَفْسِي أَنْ كَسَرْتُهُ، ‏‏‏‏‏‏فَسَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كَفَّارَتِهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنَاءٌ كَإِنَاءٍ وَطَعَامٌ كَطَعَامٍ ."
      },
      {
        "id": 38398,
        "hadith_number": "3410",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Kisah Madu dan Turunnya Ayat Al-Quran",
        "perawi_melayu": "Aisyah رضي الله عنها",
        "english_text": "Narrated by Aisha (RA): The Prophet (ﷺ) used to stay with Zainab bint Jahsh and drink honey with her. So, I and Hafsa conspired that whoever the Prophet (ﷺ) entered upon, should say to him, \"I smell from you the smell of Maghafir, did you eat Maghafir?\" So, he entered upon one of them, and she said that to him. He replied, \"No, I have drunk honey with Zainab bint Jahsh, and I will not return to it.\" Then the verse was revealed: \"O Prophet! Why do you forbid [yourself] that which Allah has made lawful for you...?\" (At-Tahrim: 1).\" (This was in reference) to Aisha and Hafsa.\" (And) When the Prophet disclosed a matter to some of his wives (At-Tahrim: 3) referring to his saying, \"I have drunk honey.\" ",
        "malay_translation": "Diriwayatkan daripada Aisyah رضي الله عنها: Nabi ﷺ pernah tinggal bersama Zainab binti Jahsh dan minum madu dengannya. Maka, aku dan Hafsa berpakat bahawa sesiapa di antara kami yang didatangi oleh Nabi ﷺ, hendaklah berkata kepada baginda, \"Saya mencium bau Maghafir dari Tuan, adakah Tuan memakan Maghafir?\" Maka, baginda masuk kepada salah seorang daripada mereka, dan dia berkata demikian kepada baginda. Baginda menjawab, \"Tidak, tetapi aku telah minum madu dengan Zainab binti Jahsh, dan aku tidak akan kembali kepadanya.\" Kemudian turunlah ayat: \"Wahai Nabi! Mengapa engkau haramkan apa yang Allah halalkan bagimu...?\" (At-Tahrim: 1). (Ini adalah merujuk) kepada Aisyah dan Hafsa.\" (Dan) Apabila Nabi membocorkan suatu rahsia kepada sebahagian isterinya (At-Tahrim: 3) merujuk kepada kata-kata baginda, \"Aku telah minum madu.\"",
        "arabic_text": "أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حَجَّاجٌ، ‏‏‏‏‏‏عَنِ ابْنِ جُرَيْجٍ، ‏‏‏‏‏‏عَنْ عَطَاءٍ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ عُبَيْدَ بْنَ عُمَيْرٍ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ سَمِعْتُ عَائِشَةَ تَزْعُمُ،‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَمْكُثُ عِنْدَ زَيْنَبَ بِنْتِ جَحْشٍ فَيَشْرَبُ عِنْدَهَا عَسَلًا، ‏‏‏‏‏‏فَتَوَاصَيْتُ أَنَا وَحَفْصَةُ،‏‏‏‏ أَنَّ أَيَّتُنَا دَخَلَ عَلَيْهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ فَلْتَقُلْ:‏‏‏‏ إِنِّي أَجِدُ مِنْكَ رِيحَ مَغَافِيرَ،‏‏‏‏ أَكَلْتَ مَغَافِيرَ ؟ فَدَخَلَ عَلَى إِحْدَاهُمَا،‏‏‏‏ فَقَالَتْ ذَلِكَ لَهُ،‏‏‏‏ فَقَالَ:‏‏‏‏ لَا،‏‏‏‏ بَلْ شَرِبْتُ عَسَلًا عِنْدَ زَيْنَبَ بِنْتِ جَحْشٍ،‏‏‏‏ وَلَنْ أَعُودَ لَهُ ،‏‏‏‏ فَنَزَلَتْ:‏‏‏‏ يَأَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَا أَحَلَّ اللَّهُ لَكَ سورة التحريم آية 1،‏‏‏‏ إِنْ تَتُوبَا إِلَى اللَّهِ سورة التحريم آية 4 لِعَائِشَةَ،‏‏‏‏ وَحَفْصَةَ،‏‏‏‏ وَإِذْ أَسَرَّ النَّبِيُّ إِلَى بَعْضِ أَزْوَاجِهِ حَدِيثًا سورة التحريم آية 3 لِقَوْلِهِ:‏‏‏‏ بَلْ شَرِبْتُ عَسَلًا ."
      },
      {
        "id": 38399,
        "hadith_number": "3411",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Larangan Nabi SAW Terhadap Seorang Gadis Hamba",
        "perawi_melayu": "Daripada Anas رضي الله عنه",
        "english_text": "Narrated by Anas that the Messenger of Allah had a female slave whom he would consort with.  Aisha and Hafsah continually admonished him until he prohibited himself from her. Then Allah revealed: \"O Prophet, why do you prohibit what Allah has made lawful for you?\" (Surat At-Tahrim, verse 1 to the end).",
        "malay_translation": "Telah menceritakan Anas رضي الله عنه bahawa Rasulullah SAW mempunyai seorang hamba perempuan yang diizinkan untuk bersamanya.  Aisyah dan Hafsah sentiasa menegurnya sehingga baginda SAW mengharamkan dirinya sendiri dari bercampur dengan hamba perempuan itu. Kemudian Allah SWT menurunkan ayat: \"Wahai Nabi, mengapakah engkau mengharamkan sesuatu yang Allah telah halalkan untukmu?\" (Surah At-Tahrim, ayat 1 hingga akhir).",
        "arabic_text": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يُونُسَ بْنِ مُحَمَّدٍ حَرَمِيٌّ هُوَ لَقَبُهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبِي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏عَنْ ثَابِتٍ، ‏‏‏‏‏‏عَنْ أَنَسٍ:‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَتْ لَهُ أَمَةٌ يَطَؤُهَا،‏‏‏‏ فَلَمْ تَزَلْ بِهِ عَائِشَةُ،‏‏‏‏ وَحَفْصَةُ حَتَّى حَرَّمَهَا عَلَى نَفْسِهِ،‏‏‏‏ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ:‏‏‏‏ يَأَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَا أَحَلَّ اللَّهُ لَكَ سورة التحريم آية 1 إِلَى آخِرِ الْآيَةِ ."
      },
      {
        "id": 38400,
        "hadith_number": "3412",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Syaitan Rasulullah ﷺ dan Keadaannya",
        "perawi_melayu": "Aisyah رضي الله عنها",
        "english_text": "Aisha (May Allah be pleased with her) reported: I was searching for the Messenger of Allah (ﷺ), and I put my hand in his hair, and he said, 'Your Satan has come to you.' I said, 'Do you have a Satan?' He said, 'Yes, but Allah has helped me against him, and he has become a Muslim.'",
        "malay_translation": "Aisyah رضي الله عنها meriwayatkan: Aku mencari Rasulullah ﷺ, dan aku memasukkan tanganku ke dalam rambutnya, lalu baginda bersabda, 'Syaitanmu telah datang kepadamu.' Aku berkata, 'Adakah tuan juga mempunyai syaitan?' Baginda bersabda, 'Ya, tetapi Allah telah membantuku menghadapinya, lalu dia telah memeluk Islam.'",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا اللَّيْثُ، ‏‏‏‏‏‏عَنْ يَحْيَى هُوَ ابْنُ سَعِيدٍ الْأَنْصَارِيُّ، ‏‏‏‏‏‏عَنْ عُبَادَةَ بْنِ الْوَلِيدِ بْنِ عُبَادَةَ بْنِ الصَّامِتِ، ‏‏‏‏‏‏أَنَّ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ الْتَمَسْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَأَدْخَلْتُ يَدِي فِي شَعْرِهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ قَدْ جَاءَكِ شَيْطَانُكِ . فَقُلْتُ:‏‏‏‏ أَمَا لَكَ شَيْطَانٌ ؟ فَقَالَ:‏‏‏‏ بَلَى، ‏‏‏‏‏‏وَلَكِنَّ اللَّهَ أَعَانَنِي عَلَيْهِ،‏‏‏‏ فَأَسْلَمَ ."
      },
      {
        "id": 38401,
        "hadith_number": "3413",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Rasulullah SAW Bertasbih dan Bertahmid dalam Sujud",
        "perawi_melayu": "Aisyah R.A.",
        "english_text": "Not available",
        "malay_translation": "Telah mengkhabarkan kepadaku Ibrahim bin al-Hasan al-Miqsamiy, daripada Hajjaj, daripada Ibnu Juraij, daripada 'Atha', telah mengkhabarkan kepadaku Ibnu Abi Mulaikah, daripada Aisyah R.A., beliau berkata: \"Pada suatu malam, aku kehilangan Rasulullah SAW. Aku menyangka Baginda pergi ke tempat salah seorang isterinya. Lalu aku mencari-cari Baginda. Tiba-tiba aku mendapati Baginda sedang rukuk atau sujud sambil berkata: 'Subhanaka wa bihamdika la ilaha illa Anta' (Maha Suci Engkau dan dengan memuji-Mu, tiada Tuhan melainkan Engkau). Maka aku berkata: 'Demi ayah dan ibuku, sesungguhnya engkau berada dalam urusan (ibadah), sedangkan aku berada dalam urusan yang lain.'",
        "arabic_text": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ الْمِقْسَمِيُّ، ‏‏‏‏‏‏عَنْ حَجَّاجٍ، ‏‏‏‏‏‏عَنِ ابْنِ جُرَيْجٍ، ‏‏‏‏‏‏عَنْ عَطَاءٍ، ‏‏‏‏‏‏أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ فَقَدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ، ‏‏‏‏‏‏فَظَنَنْتُ أَنَّهُ ذَهَبَ إِلَى بَعْضِ نِسَائِهِ، ‏‏‏‏‏‏فَتَجَسَّسْتُهُ، ‏‏‏‏‏‏فَإِذَا هُوَ رَاكِعٌ،‏‏‏‏ أَوْ سَاجِدٌ يَقُولُ:‏‏‏‏ سُبْحَانَكَ،‏‏‏‏ وَبِحَمْدِكَ لَا إِلَهَ إِلَّا أَنْتَ . فَقُلْتُ:‏‏‏‏ بِأَبِي،‏‏‏‏ وَأُمِّي إِنَّكَ لَفِي شَأْنٍ، ‏‏‏‏‏‏وَإِنِّي لَفِي شَأْنٍ آخَرَ."
      },
      {
        "id": 38402,
        "hadith_number": "3414",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Rasulullah SAW Bertasbih dan Bertahmid dalam Sujud",
        "perawi_melayu": "Aisyah R.A.",
        "english_text": "Not Available",
        "malay_translation": "Telah mengkhabarkan kepada kami Ishaq bin Mansur, dia berkata: Telah menceritakan kepada kami Abdur Razzaq, dia berkata: Telah memberitakan kepada kami Ibn Juraij, dia berkata: Telah mengkhabarkan kepadaku Ibn Abi Mulaikah, bahawa Aisyah berkata: Aku kehilangan Rasulullah SAW pada suatu malam, maka aku menyangka bahawa baginda telah pergi kepada sebahagian daripada isteri-isterinya. Lalu aku mencari-cari, kemudian aku kembali, dan ternyata baginda sedang ruku', atau sujud, seraya berkata: 'Subhanaka wa bihamdika la ilaha illa Anta (Maha Suci Engkau, dan dengan memuji-Mu, tidak ada Tuhan yang berhak disembah melainkan Engkau)'. Maka aku berkata: 'Demi ayah dan ibuku, sesungguhnya engkau berada dalam urusan (ibadah), dan aku berada dalam urusan (yang lain).'",
        "arabic_text": "أَخْبَرَنَا إِسْحَاق بْنُ مَنْصُورٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا ابْنُ جُرَيْجٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ، ‏‏‏‏‏‏أَنَّ عَائِشَةَ،‏‏‏‏ قَالَتْ:‏‏‏‏ افْتَقَدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ،‏‏‏‏ فَظَنَنْتُ أَنَّهُ ذَهَبَ إِلَى بَعْضِ نِسَائِهِ،‏‏‏‏ فَتَجَسَّسْتُ، ‏‏‏‏‏‏ثُمَّ رَجَعْتُ، ‏‏‏‏‏‏فَإِذَا هُوَ رَاكِعٌ،‏‏‏‏ أَوْ سَاجِدٌ يَقُولُ:‏‏‏‏ سُبْحَانَكَ،‏‏‏‏ وَبِحَمْدِكَ لَا إِلَهَ إِلَّا أَنْتَ . فَقُلْتُ:‏‏‏‏ بِأَبِي وَأُمِّي،‏‏‏‏ إِنَّكَ لَفِي شَأْنٍ، ‏‏‏‏‏‏وَإِنِّي لَفِي آخَرَ."
      },
      {
        "id": 38403,
        "hadith_number": "3415",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Lawatan Rasulullah SAW ke Baqi' dan Reaksi Aisyah R.A.",
        "perawi_melayu": "Diriwayatkan daripada Muhammad bin Qais",
        "english_text": "Not Available",
        "malay_translation": "Telah mengkhabarkan kepada kami Sulaiman bin Daud, dia berkata: Telah memberitakan kepada kami Ibn Wahb, dia berkata: Telah mengkhabarkan kepadaku Ibn Juraij, daripada Abdullah bin Kathir, bahawa dia mendengar Muhammad bin Qais, berkata: Aku mendengar Aisyah, berkata: \"Mahukah aku menceritakan kepada kamu tentang Nabi SAW dan tentang diriku?\" Kami berkata: \"Ya.\" Dia berkata: \"Ketika malam giliranku, baginda berbalik lalu meletakkan kedua terompahnya di sisi kakinya, dan meletakkan ridanya dan membentangkan kainnya di atas tempat tidurnya, dan tidak berlalu melainkan sekadar menyangka bahawa aku telah tidur, kemudian baginda memakai terompahnya perlahan-lahan dan mengambil ridanya perlahan-lahan, kemudian membuka pintu perlahan-lahan dan keluar serta menutupnya perlahan-lahan, dan aku meletakkan baju besiku di kepalaku, lalu aku bertelekung dan berselubung dengan kainku, dan aku pergi mengikut jejaknya sehingga baginda datang ke Baqi', lalu baginda mengangkat kedua tangannya tiga kali, dan memanjangkan berdiri, kemudian baginda berpaling dan aku pun berpaling, lalu baginda mempercepatkan langkahnya dan aku pun mempercepatkan langkahku, lalu baginda berlari-lari anak dan aku pun berlari-lari anak, lalu baginda berlari dan aku pun berlari, dan aku mendahuluinya lalu aku masuk dan tidak lain hanyalah aku berbaring lalu baginda masuk, lalu baginda bersabda: \"Kenapa denganmu wahai Aisyah, tercungap-cungap?\" Sulaiman berkata: Aku menyangka dia berkata: \"Termengah-mengah.\" Dia berkata: \"Kamu pasti akan memberitahuku, atau pasti akan memberitahuku al-Latif al-Khabir.\" Aku berkata: \"Wahai Rasulullah, demi ayah dan ibuku, aku memberitahunya khabar itu.\" Baginda bersabda: \"Kamukah bayangan yang aku lihat di hadapanku?\" Aku berkata: \"Ya.\" Dia berkata: \"Lalu baginda memukul dadaku dengan satu pukulan yang menyakitkan aku, baginda bersabda: \"Adakah kamu menyangka bahawa Allah dan Rasul-Nya akan berlaku zalim kepadamu?\" Dia berkata: \"Apa sahaja yang disembunyikan oleh manusia maka Allah Azzawajalla mengetahuinya.\" Baginda bersabda: \"Ya.\" Dia berkata: \"Sesungguhnya Jibril AS mendatangiku ketika kamu melihatku, dan dia tidak masuk ke tempatmu ketika kamu telah meletakkan pakaianmu, lalu dia memanggilku lalu dia menyembunyikannya daripadamu lalu aku menjawabnya dan aku menyembunyikannya daripadamu, dan aku menyangka bahawa kamu telah tidur, lalu aku tidak suka untuk mengejutkanmu dan aku khuatir kamu akan berasa sunyi, lalu dia memerintahkan aku untuk mendatangi ahli Baqi' lalu aku memohon ampun untuk mereka.\" Hajjaj bin Muhammad menyelisihi dia, dia berkata: Daripada Ibn Juraij, daripada Ibn Abi Mulaikah, daripada Muhammad bin Qais.",
        "arabic_text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي ابْنُ جُرَيْجٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ كَثِيرٍ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ مُحَمَّدَ بْنَ قَيْسٍ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ سَمِعْتُ عَائِشَةَ، ‏‏‏‏‏‏تَقُولُ:‏‏‏‏ أَلَا أُحَدِّثُكُمْ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَنِّي ؟ قُلْنَا:‏‏‏‏ بَلَى، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ لَمَّا كَانَتْ لَيْلَتِي انْقَلَبَ فَوَضَعَ نَعْلَيْهِ عِنْدَ رِجْلَيْهِ، ‏‏‏‏‏‏وَوَضَعَ رِدَاءَهُ وَبَسَطَ إِزَارَهُ عَلَى فِرَاشِهِ، ‏‏‏‏‏‏وَلَمْ يَلْبَثْ إِلَّا رَيْثَمَا ظَنَّ أَنِّي قَدْ رَقَدْتُ، ‏‏‏‏‏‏ثُمَّ انْتَعَلَ رُوَيْدًا وَأَخَذَ رِدَاءَهُ رُوَيْدًا، ‏‏‏‏‏‏ثُمَّ فَتَحَ الْبَابَ رُوَيْدًا وَخَرَجَ وَأَجَافَهُ رُوَيْدًا، ‏‏‏‏‏‏وَجَعَلْتُ دِرْعِي فِي رَأْسِي،‏‏‏‏ فَاخْتَمَرْتُ وَتَقَنَّعْتُ إِزَارِي،‏‏‏‏ وَانْطَلَقْتُ فِي إِثْرِهِ حَتَّى جَاءَ الْبَقِيعَ، ‏‏‏‏‏‏فَرَفَعَ يَدَيْهِ ثَلَاثَ مَرَّاتٍ،‏‏‏‏ وَأَطَالَ الْقِيَامَ، ‏‏‏‏‏‏ثُمَّ انْحَرَفَ وَانْحَرَفْتُ، ‏‏‏‏‏‏فَأَسْرَعَ فَأَسْرَعْتُ، ‏‏‏‏‏‏فَهَرْوَلَ فَهَرْوَلْتُ، ‏‏‏‏‏‏فَأَحْضَرَ فَأَحْضَرْتُ، ‏‏‏‏‏‏وَسَبَقْتُهُ فَدَخَلْتُ وَلَيْسَ إِلَّا أَنِ اضْطَجَعْتُ فَدَخَلَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا لَكِ يَا عَائِشُ رَابِيَةً ؟ قَالَ سُلَيْمَانُ:‏‏‏‏ حَسِبْتُهُ قَالَ:‏‏‏‏ حَشْيَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَتُخْبِرِنِّي،‏‏‏‏ أَوْ لَيُخْبِرَنِّي اللَّطِيفُ الْخَبِيرُ . قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏ بِأَبِي أَنْتَ وَأُمِّي،‏‏‏‏ فَأَخْبَرْتُهُ الْخَبَرَ. قَالَ:‏‏‏‏ أَنْتِ السَّوَادُ الَّذِي رَأَيْتُ أَمَامِي . قُلْتُ:‏‏‏‏ نَعَمْ. قَالَتْ:‏‏‏‏ فَلَهَدَنِي لَهْدَةً فِي صَدْرِي أَوْجَعَتْنِي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَظَنَنْتِ أَنْ يَحِيفَ اللَّهُ عَلَيْكِ وَرَسُولُهُ . قَالَتْ:‏‏‏‏ مَهْمَا يَكْتُمُ النَّاسُ فَقَدْ عَلِمَهُ اللَّهُ عَزَّ وَجَلَّ. قَالَ:‏‏‏‏ نَعَمْ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَإِنَّ جِبْرِيلَ عَلَيْهِ السَّلَام أَتَانِي حِينَ رَأَيْتِ،‏‏‏‏ وَلَمْ يَكُنْ يَدْخُلُ عَلَيْكِ وَقَدْ وَضَعْتِ ثِيَابَكِ،‏‏‏‏ فَنَادَانِي فَأَخْفَى مِنْكِ فَأَجَبْتُهُ وَأَخْفَيْتُهُ مِنْكِ، ‏‏‏‏‏‏وَظَنَنْتُ أَنَّكِ قَدْ رَقَدْتِ،‏‏‏‏ فَكَرِهْتُ أَنْ أُوقِظَكِ وَخَشِيتُ أَنْ تَسْتَوْحِشِي، ‏‏‏‏‏‏فَأَمَرَنِي أَنْ آتِيَ أَهْلَ الْبَقِيعِ فَأَسْتَغْفِرَ لَهُمْ . خَالَفَهُ حَجَّاجُ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ عَنِ ابْنِ جُرَيْجٍ، ‏‏‏‏‏‏عَنِ ابْنِ أَبِي مُلَيْكَةَ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ قَيْسٍ."
      },
      {
        "id": 38404,
        "hadith_number": "3416",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Kisah Rasulullah SAW dan Siti Aisyah RA di Malam Hari",
        "perawi_melayu": "Muhammad bin Qais bin Makhramah",
        "english_text": null,
        "malay_translation": "Dikisahkan oleh Muhammad bin Qais bin Makhramah, katanya, \"Aku mendengar Aisyah RA bercerita, 'Tidakkah aku ceritakan kepadamu tentang diriku dan Nabi SAW? 'Kami berkata, 'Ya.' Aisyah RA berkata, 'Pada malam aku berada bersama baginda, iaitu Nabi SAW, baginda menukar alas kasut di kaki baginda, melipat jubahnya, dan mengembangkan hujung kain selendangnya di atas tilamnya. Tidak lama kemudian, baginda mendapati aku telah tidur. Kemudian baginda perlahan-lahan memakai kasutnya, mengambil jubahnya perlahan-lahan, kemudian membuka pintu perlahan-lahan dan keluar perlahan-lahan. Aku meletakkan perisai di kepalaku dan menutupi diri dengan selendangku, dan berangkat mengejar baginda hingga sampai di Baqi'. Baginda mengangkat kedua-dua tangan sebanyak tiga kali, berlama-lama dalam solat, lalu beredar, dan aku pun beredar, lalu berlari perlahan, dan aku pun berlari perlahan. Lalu baginda semakin laju, dan aku pun semakin laju, dan akhirnya aku mendahului baginda dan masuk ke dalam. Baginda pun masuk dan bertanya, 'Wahai Aisyah, apa yang menjadikan kamu tergesa-gesa?' Aisyah RA menjawab, 'Tidak ada apa-apa.' Baginda bertanya lagi, 'Beritahu atau Allah SWT akan mengabarkannya kepadaku.' Aku berkata, 'Wahai Rasulullah, bapaku dan ibuku sebagai tebusanmu, aku akan menceritakannya kepada-Mu.' Kemudian aku menceritakan apa yang terjadi. Baginda bersabda, 'Maka engkaulah (bayang-bayang) yang aku lihat di depan aku?' Aisyah RA menjawab, 'Ya.' Aisyah RA berkata lagi, 'Lalu Allah memberikan kesakitan di dalam dadaku, hingga menyakitkan aku.' Kemudian baginda bersabda, 'Adakah kamu sangka Allah dan Rasul-Nya berlaku tidak adil kepadamu?' Aisyah RA bertanya, 'Apa yang disembunyikan manusia tetapi diketahui oleh Allah?' Baginda menjawab, 'Ya.' Baginda bersabda lagi, 'Malaikat Jibril AS datang kepadaku ketika kamu sedang melihatku, dan dia tidak akan menemuimu sedangkan pakaianmu masih terpasang, maka dia memanggilku dan aku mengasingkan dirimu. Lalu aku merasa kamu telah tidur dan takut kamu akan menjadi takut. Maka dia memerintahku untuk mengunjungi penduduk Baqi' dan meminta ampun untuk mereka.'\" Diceritakan oleh 'Asim dari Abdullah bin 'Amir dari Aisyah, dengan lafaz yang sedikit berbeza.",
        "arabic_text": "حَدَّثَنَا يُوسُفُ بْنُ سَعِيدِ بْنِ مُسْلِمٍ الْمِصِّيصِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حَجَّاجٌ، ‏‏‏‏‏‏عَنِ ابْنِ جُرَيْجٍ، ‏‏‏‏‏‏أَخْبَرَنِي عَبْدُ اللَّهِ ابْنُ أَبِي مُلَيْكَةَ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ مُحَمَّدَ بْنَ قَيْسِ بْنِ مَخْرَمَةَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ سَمِعْتُ عَائِشَةَ تُحَدِّثُ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ أَلَا أُحَدِّثُكُمْ عَنِّي،‏‏‏‏ وَعَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ؟ قُلْنَا:‏‏‏‏ بَلَى. قَالَتْ:‏‏‏‏ لَمَّا كَانَتْ لَيْلَتِي الَّتِي هُوَ عِنْدِي،‏‏‏‏ تَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ انْقَلَبَ فَوَضَعَ نَعْلَيْهِ عِنْدَ رِجْلَيْهِ،‏‏‏‏ وَوَضَعَ رِدَاءَهُ، ‏‏‏‏‏‏وَبَسَطَ طَرَفَ إِزَارِهِ عَلَى فِرَاشِهِ، ‏‏‏‏‏‏فَلَمْ يَلْبَثْ إِلَّا رَيْثَمَا ظَنَّ أَنِّي قَدْ رَقَدْتُ، ‏‏‏‏‏‏ثُمَّ انْتَعَلَ رُوَيْدًا،‏‏‏‏ وَأَخَذَ رِدَاءَهُ رُوَيْدًا، ‏‏‏‏‏‏ثُمَّ فَتَحَ الْبَابَ رُوَيْدًا،‏‏‏‏ وَخَرَجَ وَأَجَافَهُ رُوَيْدًا، ‏‏‏‏‏‏وَجَعَلْتُ دِرْعِي فِي رَأْسِي وَاخْتَمَرْتُ، ‏‏‏‏‏‏وَتَقَنَّعْتُ إِزَارِي فَانْطَلَقْتُ فِي إِثْرِهِ حَتَّى جَاءَ الْبَقِيعَ، ‏‏‏‏‏‏فَرَفَعَ يَدَيْهِ ثَلَاثَ مَرَّاتٍ، ‏‏‏‏‏‏وَأَطَالَ الْقِيَامَ ثُمَّ انْحَرَفَ فَانْحَرَفْتُ، ‏‏‏‏‏‏فَأَسْرَعَ فَأَسْرَعْتُ، ‏‏‏‏‏‏فَهَرْوَلَ فَهَرْوَلْتُ، ‏‏‏‏‏‏فَأَحْضَرَ فَأَحْضَرْتُ وَسَبَقْتُهُ، ‏‏‏‏‏‏فَدَخَلْتُ فَلَيْسَ إِلَّا أَنِ اضْطَجَعْتُ فَدَخَلَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا لَكِ يَا عَائِشَةُ حَشْيَا رَابِيَةً ؟ . قَالَتْ:‏‏‏‏ لَا. قَالَ:‏‏‏‏ لَتُخْبِرِنِّي،‏‏‏‏ أَوْ لَيُخْبِرَنِّي اللَّطِيفُ الْخَبِيرُ . قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏ بِأَبِي أَنْتَ وَأُمِّي،‏‏‏‏ فَأَخْبَرْتُهُ الْخَبَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَأَنْتِ السَّوَادُ الَّذِي رَأَيْتُهُ أَمَامِي ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ فَلَهَدَنِي فِي صَدْرِي لَهْدَةً أَوْجَعَتْنِي، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ أَظَنَنْتِ أَنْ يَحِيفَ اللَّهُ عَلَيْكِ وَرَسُولُهُ . قَالَتْ:‏‏‏‏ مَهْمَا يَكْتُمُ النَّاسُ فَقَدْ عَلِمَهُ اللَّهُ ؟ قَالَ:‏‏‏‏ نَعَمْ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَإِنَّ جِبْرِيلَ عَلَيْهِ السَّلَام أَتَانِي حِينَ رَأَيْتِ، ‏‏‏‏‏‏وَلَمْ يَكُنْ يَدْخُلُ عَلَيْكِ وَقَدْ وَضَعْتِ ثِيَابَكِ، ‏‏‏‏‏‏فَنَادَانِي، ‏‏‏‏‏‏فَأَخْفَى مِنْكِ،‏‏‏‏ فَأَجَبْتُهُ فَأَخْفَيْتُ مِنْكِ، ‏‏‏‏‏‏فَظَنَنْتُ أَنْ قَدْ رَقَدْتِ،‏‏‏‏ وَخَشِيتُ أَنْ تَسْتَوْحِشِي،‏‏‏‏ فَأَمَرَنِي أَنْ آتِيَ أَهْلَ الْبَقِيعِ فَأَسْتَغْفِرَ لَهُمْ . رَوَاهُ عَاصِمٌ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عَامِرٍ، ‏‏‏‏‏‏عَنْ عَائِشَةَ عَلَى غَيْرِ هَذَا اللَّفْظِ."
      },
      {
        "id": 38405,
        "hadith_number": "3417",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Kehilangan Kekasih pada Malam Hari",
        "perawi_melayu": "Daripada Aisyah رضي الله عنها, melalui sanad yang berikut: Ali bin Hujer, berkata: Sharīk, dari 'Asim, dari Abdullah bin Amir bin Rabi'ah, dari Aisyah رضي الله عنها, yang berkata:",
        "english_text": "From Aisyah رضي الله عنها, through a chain of narrators: Ali bin Hujer, said: Shariik, from Asim, from Abdullah bin Amir bin Rabi'ah, from Aisyah رضي الله عنها, who said: I lost him in the night and narrated the hadith",
        "malay_translation": "Daripada Aisyah رضي الله عنها, melalui sanad yang berikut: Ali bin Hujer, berkata: Sharīk, daripada 'Asim, daripada Abdullah bin Amir bin Rabi'ah, daripada Aisyah رضي الله عنها, yang berkata: Aku kehilangannya pada waktu malam, dan dia meneruskan hadis.",
        "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا شَرِيكٌ، ‏‏‏‏‏‏عَنْ عَاصِمٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ فَقَدْتُهُ مِنَ اللَّيْلِ وَسَاقَ الْحَدِيثَ."
      }
    ]
  }
}