{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 112,
    "data": [
      {
        "id": 40418,
        "hadith_number": "5430",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Perlindungan dengan Membaca Ayat Kursi dan Al-Mu'awwidzatain",
        "perawi_melayu": "Mu'adh bin Abdullah daripada bapanya",
        "english_text": "It was narrated from Mu'adh bin 'Abdullah that his father said: It was raining and dark, and we were waiting for the Messenger of Allah [SAW] to lead us in prayer. Then the Messenger of Allah [SAW] came out to lead us in prayer and he said: 'Say.' I said: 'What should I say?' He said: 'Say: He is Allah, (the) One and Al-Mu'awwadhatain in the evening and in the morning, three times, and that will suffice you against everything.'",
        "malay_translation": "Daripada Mu'adh bin Abdullah, daripada bapanya;  berkata:  Hujan lebat dan gelap, kami menunggu Rasulullah SAW untuk mengetuai solat.  Kemudian Rasulullah SAW keluar untuk mengetuai solat dan baginda bersabda: “Bacalah.”  Aku bertanya: “Apakah yang harus aku bacakan?” Baginda menjawab: “Bacalah: ‘Allah adalah Esa’, (Ayat Kursi) dan Al-Mu’awwidzatain (Surah Al-Falaq dan An-Nas) pada waktu petang dan pagi, tiga kali.  Itu sudah memadai untukmu daripada segala sesuatu.”",
        "arabic_text": "أَخْبَرَنَا أَبُو عَبْدِ الرَّحْمَنِ أَحْمَدُ بْنُ شُعَيْبٍ،‏‏‏‏ قَالَ:‏‏‏‏ أَنْبَأَنَا عَمْرُو بْنُ عَلِيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو عَاصِمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي أَسِيدُ بْنُ أَبِي أَسِيدٍ، ‏‏‏‏‏‏عَنْ مُعَاذِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَصَابَنَا طَشٌّ وَظُلْمَةٌ فَانْتَظَرْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيُصَلِّيَ بِنَا،‏‏‏‏ ثُمَّ ذَكَرَ كَلَامًا مَعْنَاهُ:‏‏‏‏ فَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيُصَلِّيَ بِنَا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ قُلْ ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ مَا أَقُولُ ؟ قَالَ:‏‏‏‏ قُلْ هُوَ اللَّهُ أَحَدٌ،‏‏‏‏ حِينَ تُمْسِي،‏‏‏‏ وَحِينَ تُصْبِحُ ثَلَاثًا يَكْفِيكَ كُلَّ شَيْءٍ ."
      },
      {
        "id": 40419,
        "hadith_number": "5431",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Menggunakan Surah Al-Falaq dan An-Nas sebagai Perlindungan",
        "perawi_melayu": "Mu'adz bin Abdullah bin Khubaib",
        "english_text": "It was narrated from Mu'adh bin 'Abdullah bin Khubaib that his father said: I was with the Messenger of Allah [SAW] on the road to Makkah when I found myself alone with the Messenger of Allah [SAW]. I drew close to him and he said: 'Say.' I said: 'What should I say?' He said: 'Say.' I said: 'What should I say?' He said: 'Say: I seek refuge with (Allah) the Lord of the daybreak...' until he finished (the Surah), then he said: 'Say: I seek refuge with (Allah) the Lord of mankind...' until he finished it. Then he said: 'The people cannot seek refuge with Allah by means of anything better than these two.'",
        "malay_translation": "Daripada Mu'adz bin Abdullah bin Khubaib, bahawa bapanya berkata: Aku bersama Rasulullah SAW dalam perjalanan ke Makkah, lalu aku mendapat kesempatan bersendirian dengan Rasulullah SAW. Aku mendekati baginda, lalu baginda bersabda: “Bacalah.” Aku berkata: “Apakah yang hendak kubacakan?” Baginda bersabda: “Bacalah.” Aku berkata: “Apakah yang hendak kubacakan?” Baginda bersabda: “Bacalah:  أَعُوذُ بِرَبِّ الْفَلَقِ (Aku berlindung kepada Tuhan yang menciptakan fajar)” sehingga baginda menghabiskan (surah tersebut), kemudian baginda bersabda: “Bacalah: أَعُوذُ بِرَبِّ النَّاسِ (Aku berlindung kepada Tuhan manusia)” sehingga baginda menghabiskan (surah tersebut). Kemudian baginda bersabda: “Tiada apa yang lebih baik untuk manusia memohon perlindungan daripada Allah daripada kedua-dua surah ini.”",
        "arabic_text": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي حَفْصُ بْنُ مَيْسَرَةَ، ‏‏‏‏‏‏عَنْ زَيْدِ بْنِ أَسْلَمَ، ‏‏‏‏‏‏عَنْ مُعَاذِ بْنِ عَبْدِ اللَّهِ بْنِ خُبَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي طَرِيقِ مَكَّةَ فَأَصَبْتُ خُلْوَةً مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ فَدَنَوْتُ مِنْهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ قُلْ ،‏‏‏‏ فَقُلْتُ:‏‏‏‏ مَا أَقُولُ ؟،‏‏‏‏ قَالَ:‏‏‏‏ قُلْ ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ مَا أَقُولُ ؟ ،‏‏‏‏ قَالَ:‏‏‏‏ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ حَتَّى خَتَمَهَا ، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ قُلْ أَعُوذُ بِرَبِّ النَّاسِ حَتَّى خَتَمَهَا ، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ مَا تَعَوَّذَ النَّاسُ بِأَفْضَلَ مِنْهُمَا ."
      },
      {
        "id": 40420,
        "hadith_number": "5432",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Keutamaan Membaca Ayat-ayat Perlindungan",
        "perawi_melayu": "Uqbah bin Amir Al-Juhani",
        "english_text": "It was narrated that 'Uqbah bin 'Amir Al-Juhani said: While I was leading the Messenger of Allah [SAW] on his mount on a military campaign, he said: 'O 'Uqbah, say!' I listened, then he said: 'O 'Uqbah, say!' I listened, then he said it a third time. I said: 'What should I say?' He said: 'Say: He is Allah, (the) One...' and he recited the Surah to the end. Then he recited: 'Say: I seek refuge with (Allah) the Lord of the daybreak...' and I recited it with him until the end. Then he recited: 'Say: I seek refuge with (Allah) the Lord of mankind...' and I recited it with him until the end. Then he said: 'No one ever sought refuge (with Allah) by means of anything like them.'",
        "malay_translation": "Daripada Uqbah bin Amir Al-Juhani, katanya: Ketika aku menuntun tunggangan Rasulullah SAW dalam satu ekspedisi tentera, Baginda bersabda: “Wahai Uqbah, bacalah!” Aku mendengar, kemudian Baginda bersabda lagi: “Wahai Uqbah, bacalah!” Aku mendengar, kemudian Baginda bersabda untuk kali ketiga. Aku bertanya: “Apakah yang patut aku bacakan?” Baginda menjawab: “Bacalah: ‘Katakanlah: Dia lah Allah, Yang Esa…’” kemudian Baginda membacakan surah tersebut sehingga tamat.  Kemudian Baginda membaca: “Katakanlah: Aku berlindung kepada Tuhan yang menguasai waktu fajar…” dan aku membacanya bersama Baginda sehingga tamat. Kemudian Baginda membaca: “Katakanlah: Aku berlindung kepada Tuhan manusia…” dan aku membacanya bersama Baginda sehingga tamat. Kemudian Baginda bersabda: “Tiada sesiapa pun yang pernah berlindung dengan sesuatu yang serupa dengannya.”",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي الْقَعْنَبِيُّ، ‏‏‏‏‏‏عَنْ عَبْدِ الْعَزِيزِ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ سُلَيْمَانَ، ‏‏‏‏‏‏عَنْ مُعَاذِ بْنِ عَبْدِ اللَّهِ بْنِ خُبَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ بَيْنَا أَنَا أَقُودُ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَاحِلَتَهُ فِي غَزْوَةٍ إِذْ قَالَ:‏‏‏‏ يَا عُقْبَةُ،‏‏‏‏ قُلْ ،‏‏‏‏ فَاسْتَمَعْتُ، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ يَا عُقْبَةُ،‏‏‏‏ قُلْ ،‏‏‏‏ فَاسْتَمَعْتُ،‏‏‏‏ فَقَالَهَا الثَّالِثَةَ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ مَا أَقُولُ ؟ فَقَالَ:‏‏‏‏ قُلْ هُوَ اللَّهُ أَحَدٌ فَقَرَأَ السُّورَةَ حَتَّى خَتَمَهَا ،‏‏‏‏ ثُمَّ قَرَأَ:‏‏‏‏ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ،‏‏‏‏ وَقَرَأْتُ مَعَهُ حَتَّى خَتَمَهَا ،‏‏‏‏ ثُمَّ قَرَأَ:‏‏‏‏ قُلْ أَعُوذُ بِرَبِّ النَّاسِ،‏‏‏‏ فَقَرَأْتُ مَعَهُ حَتَّى خَتَمَهَا ، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ مَا تَعَوَّذَ بِمِثْلِهِنَّ أَحَدٌ ."
      },
      {
        "id": 40421,
        "hadith_number": "5433",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa-doa perlindungan yang diajarkan Rasulullah SAW",
        "perawi_melayu": "Uqbah bin 'Amir Al-Juhani",
        "english_text": "It was narrated that 'Uqbah bin 'Amir Al-Juhani said: The Messenger of Allah [SAW] said to me: 'Say.' I said: 'What should I say?' He said: 'Say: He is Allah (the) One,' 'Say: I seek refuge with (Allah) the Lord of the daybreak,' 'Say: I seek refuge with (Allah) the Lord of mankind.' The Messenger of Allah [SAW] recited them, then he said: 'The people have never recited anything like them, or the people have never sought refuge (with Allah) by means of anything like them.'",
        "malay_translation": "Daripada Uqbah bin 'Amir Al-Juhani, katanya: Rasulullah SAW bersabda kepadaku: \"Bacalah.\" Aku bertanya: \"Apakah yang harus saya bacakan?\" Baginda menjawab: \"Bacalah: 'Dia lah Allah, Yang Maha Esa,' Bacalah: 'Aku berlindung kepada Tuhan yang menguasai waktu subuh,' Bacalah: 'Aku berlindung kepada Tuhan manusia.' Rasulullah SAW membacakan doa-doa tersebut, kemudian Baginda bersabda: \"Umat manusia tidak pernah membaca sesuatu yang serupa dengannya, atau umat manusia tidak pernah meminta perlindungan (kepada Allah) dengan sesuatu yang serupa dengannya.\"",
        "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ سُلَيْمَانَ الْأَسْلَمِيُّ، ‏‏‏‏‏‏عَنْ مُعَاذِ بْنِ عَبْدِ اللَّهِ بْنِ خُبَيْبٍ، ‏‏‏‏‏‏عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ قُلْ ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ وَمَا أَقُولُ ؟،‏‏‏‏ قَالَ:‏‏‏‏ قُلْ هُوَ اللَّهُ أَحَدٌ، ‏‏‏‏‏‏قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ، ‏‏‏‏‏‏قُلْ أَعُوذُ بِرَبِّ النَّاسِ ،‏‏‏‏ فَقَرَأَهُنَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ:‏‏‏‏ لَمْ يَتَعَوَّذْ النَّاسُ بِمِثْلِهِنَّ أَوْ لَا يَتَعَوَّذُ النَّاسُ بِمِثْلِهِنَّ ."
      },
      {
        "id": 40422,
        "hadith_number": "5434",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Perlindungan Terbaik dengan Membaca Surah Al-Falaq dan An-Nas",
        "perawi_melayu": "Ibn 'Abis Al-Juhani",
        "english_text": "Abu 'Abdullah narrated that Ibn 'Abis Al-Juhani told him that: The Messenger of Allah [SAW] said to him: O Ibn 'Abis, shall I not tell you of the best thing with which those who seek refuge with Allah may do so? He said: Yes, O Messenger of Allah. He said: Say: I seek refuge with (Allah) the Lord of the daybreak. , Say: I seek refuge with (Allah) the Lord of mankind. - these two Surahs.",
        "malay_translation": "Abu Abdullah meriwayatkan bahawa Ibn 'Abis Al-Juhani memberitahunya bahawa: Rasulullah SAW bersabda kepadanya: Wahai Ibn 'Abis, patutkah aku tidak memberimu tahu perkara terbaik yang boleh digunakan oleh mereka yang memohon perlindungan kepada Allah? Dia berkata: Ya, wahai Rasulullah. Baginda bersabda: Bacalah: Aku berlindung dengan (Allah) Tuhan Fajar. Dan bacalah: Aku berlindung dengan (Allah) Tuhan sekalian manusia. – kedua-dua surah ini.",
        "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ خَالِدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا الْوَلِيدُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو عَمْرٍو، ‏‏‏‏‏‏عَنْ يَحْيَى، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ، ‏‏‏‏‏‏أَخْبَرَنِي أَبُو عَبْدِ اللَّهِ، ‏‏‏‏‏‏أَنَّ ابْنَ عَابِسٍ الْجُهَنِيَّ أَخْبَرَهُ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ:‏‏‏‏ يَا ابْنَ عَابِسٍ،‏‏‏‏ أَلَا أَدُلُّكَ ؟ أَوْ قَالَ:‏‏‏‏ أَلَا أُخْبِرُكَ بِأَفْضَلِ مَا يَتَعَوَّذُ بِهِ الْمُتَعَوِّذُونَ ؟ قَالَ:‏‏‏‏ بَلَى يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ،‏‏‏‏ وَ قُلْ أَعُوذُ بِرَبِّ النَّاسِ هَاتَيْنِ السُّورَتَيْنِ ."
      },
      {
        "id": 40423,
        "hadith_number": "5435",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Rasulullah SAW Mengajar Uqbah Doa Pelindungan",
        "perawi_melayu": "Uqbah bin Amir",
        "english_text": "It was narrated that 'Uqbah bin 'Amir said: The Prophet [SAW] was given a gray mule which he rode, and 'Uqbah led it. The Messenger of Allah [SAW] said to 'Uqbah: 'Recite.' He said: 'What should I recite, O Messenger of Allah?' He said: 'Recite: 'Say: I seek refuge with (Allah) the Lord of the daybreak, from the evil of what He has created.' And he repeated it until I had learned it.",
        "malay_translation": "Diriwayatkan daripada Uqbah bin Amir bahawa Nabi SAW telah diberi seekor keldai kelabu yang Baginda tunggang, dan Uqbah mengetuai atau menuntunnya. Rasulullah SAW bersabda kepada Uqbah: \"Bacalah.\" Uqbah berkata: \"Apakah yang harus saya baca, wahai Rasulullah?\" Baginda bersabda: \"Bacalah: Katakanlah: Aku berlindung kepada Tuhan yang menguasai waktu subuh, daripada kejahatan makhluk yang Dia ciptakan.\" Dan Baginda mengulanginya sehingga saya telah mempelajarinya.",
        "arabic_text": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا بَقِيَّةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا بَحِيرُ بْنُ سَعْدٍ، ‏‏‏‏‏‏عَنْ خَالِدِ بْنِ مَعْدَانَ، ‏‏‏‏‏‏عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، ‏‏‏‏‏‏عَنْ عُقْبَةَ بْنِ عَامِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أُهْدِيَتْ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَغْلَةٌ شَهْبَاءُ فَرَكِبَهَا وَأَخَذَ عُقْبَةُ يَقُودُهَا بِهِ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِعُقْبَةَ:‏‏‏‏ اقْرَأْ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَمَا أَقْرَأُ يَا رَسُولَ اللَّهِ ؟ قَالَ:‏‏‏‏ اقْرَأْ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ مِنْ شَرِّ مَا خَلَقَ ،‏‏‏‏ فَأَعَادَهَا عَلَيَّ حَتَّى قَرَأْتُهَا فَعَرَفَ أَنِّي لَمْ أَفْرَحْ بِهَا جِدًّا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَعَلَّكَ تَهَاوَنْتَ بِهَا،‏‏‏‏ فَمَا قُمْتُ يَعْنِي بِمِثْلِهَا ."
      },
      {
        "id": 40424,
        "hadith_number": "5436",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Rasulullah SAW Membaca Al-Mu'awwidhatain dalam Solat Subuh",
        "perawi_melayu": "Uqbah bin Amir",
        "english_text": "It was narrated from 'Uqbah bin 'Amir that : He asked the Messenger of Allah [SAW] about Al-Mu'awwidhatain. 'Uqbah said: The Messenger of Allah [SAW] recited them when he led us in Salah Al-Ghadah (As-Subh).",
        "malay_translation": "Daripada Uqbah bin Amir, bahawa beliau bertanya kepada Rasulullah SAW tentang Al-Mu'awwidhatain. Uqbah berkata: Rasulullah SAW membacanya ketika baginda mengetuai kami dalam solat Subuh.",
        "arabic_text": "أَخْبَرَنَا مُوسَى بْنُ حِزَامٍ التِّرْمِذِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا أَبُو أُسَامَةَ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عُقْبَةَ بْنِ عَامِرٍ،‏‏‏‏ أَنَّهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْمُعَوِّذَتَيْنِ ؟ قَالَ عُقْبَةُ:‏‏‏‏ فَأَمَّنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهِمَا فِي صَلَاةِ الْغَدَاةِ ."
      },
      {
        "id": 40425,
        "hadith_number": "5437",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Rasulullah SAW Membaca Ayat-ayat Tersebut dalam Solat Subuh",
        "perawi_melayu": "Daripada Uqbah",
        "english_text": "It was narrated from 'Uqbah that: The Messenger of Allah [SAW] recited them in the Subh prayer.",
        "malay_translation": "Daripada Uqbah, bahawa Rasulullah SAW telah membacanya dalam solat Subuh.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا مُعَاوِيَةُ، ‏‏‏‏‏‏عَنِ الْعَلَاءِ بْنِ الْحَارِثِ، ‏‏‏‏‏‏عَنْ مَكْحُولٍ، ‏‏‏‏‏‏عَنْ عُقْبَةَ:‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ بِهِمَا فِي صَلَاةِ الصُّبْحِ ."
      },
      {
        "id": 40426,
        "hadith_number": "5438",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Dua Surah Terbaik",
        "perawi_melayu": "Uqbah bin Amir",
        "english_text": "It was narrated that 'Uqbah bin 'Amir said: I was leading the Messenger of Allah [SAW] (on his mount) on a journey, and the Messenger of Allah [SAW] said: 'O 'Uqbah, shall I not teach you the best two Surahs that can be recited?' And he taught me: 'Say: I seek refuge with (Allah) the Lord of the daybreak.' And 'Say: I seek refuge with (Allah) the Lord of mankind...' He thought that I did not seem too overjoyed with them, so when he stopped to pray Subh, he recited them when he led the people in the Subh prayer. When the Messenger of Allah [SAW] finished praying, he turned to me and said: 'O 'Uqbah, what do you think?'",
        "malay_translation": "Diriwayatkan bahawa Uqbah bin Amir berkata: Aku menuntun Rasulullah SAW (di atas kenderaannya) dalam satu perjalanan, dan Rasulullah SAW bersabda: \"Wahai Uqbah, patutkah aku tidak mengajarimu dua surah terbaik yang boleh dibacakan?\"  Lalu baginda mengajar aku: \"Katakanlah: Aku berlindung kepada Tuhan yang menguasai waktu fajar.\" Dan \"Katakanlah: Aku berlindung kepada Tuhan manusia...\" Baginda menyangka aku seolah-olah tidak begitu gembira dengannya, maka apabila baginda berhenti untuk solat Subuh, baginda membacanya ketika memimpin solat Subuh untuk orang ramai. Apabila Rasulullah SAW selesai solat, baginda berpaling kepadaku dan bersabda: \"Wahai Uqbah, apakah pendapatmu?\"",
        "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرٍو، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي مُعَاوِيَةُ بْنُ صَالِحٍ، ‏‏‏‏‏‏عَنْ ابْنِ الْحَارِثِ وَهُوَ الْعَلَاءُ، ‏‏‏‏‏‏عَنِ الْقَاسِمِ مَوْلَى مُعَاوِيَةَ، ‏‏‏‏‏‏عَنْ عُقْبَةَ بْنِ عَامِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنْتُ أَقُودُ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي السَّفَرِ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَا عُقْبَةُ،‏‏‏‏ أَلَا أُعَلِّمُكَ خَيْرَ سُورَتَيْنِ قُرِئَتَا ؟ فَعَلَّمَنِي قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ،‏‏‏‏ وَ قُلْ أَعُوذُ بِرَبِّ النَّاسِ فَلَمْ يَرَنِي سُرِرْتُ بِهِمَا جِدًّا،‏‏‏‏ فَلَمَّا نَزَلَ لِصَلَاةِ الصُّبْحِ صَلَّى بِهِمَا صَلَاةَ الصُّبْحِ لِلنَّاسِ، ‏‏‏‏‏‏فَلَمَّا فَرَغَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنَ الصَّلَاةِ الْتَفَتَ إِلَيَّ،‏‏‏‏ فَقَالَ:‏‏‏‏ يَا عُقْبَةُ كَيْفَ رَأَيْتَ ؟ ."
      },
      {
        "id": 40427,
        "hadith_number": "5439",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Hadis Tentang Dua Surah Terbaik untuk Dibaca Sebelum Tidur dan Bangun",
        "perawi_melayu": "Uqbah bin Amir",
        "english_text": "It was narrated that 'Uqbah bin 'Amir said: While I was leading the Messenger of Allah [SAW] (on his mount) in one of these mountain passes, he said: 'Why don't you ride, O 'Uqbah?' I had too much respect for the Messenger of Allah [SAW] to ride the mount of the Messenger of Allah [SAW]. Then he said: 'Why don't you ride, O 'Uqbah?' I was worried that I might be disobeying him, so he got off, and I rode for a little while, then I got off and the Messenger of Allah [SAW] rode. Then he said: 'Shall I not teach you two of the best Surahs that the people recite?' And he taught me: 'Say: I seek refuge with (Allah) the Lord of the daybreak,' and 'Say: I seek refuge with (Allah) the Lord of mankind. Then the Iqamah was said and he went forward and recited them. Then he passed by me and said: 'What do you think, O 'Uqbah bin 'Amir? Recite them every time you go to sleep and get up.'",
        "malay_translation": "Daripada Uqbah bin Amir, katanya: Ketika aku menuntun Rasulullah SAW (di atas kenderaannya) di salah satu laluan gunung ini, baginda bertanya: “Mengapa engkau tidak menunggang, wahai Uqbah?” Aku terlalu menghormati Rasulullah SAW untuk menunggang kenderaan Rasulullah SAW. Kemudian baginda bertanya lagi: “Mengapa engkau tidak menunggang, wahai Uqbah?” Aku bimbang akan melakukan keingkaran, maka baginda turun dan aku menunggang sebentar, kemudian aku turun dan Rasulullah SAW menunggang. Kemudian baginda berkata: “Patutkah aku tidak mengajarimu dua surah yang terbaik yang dibaca oleh manusia?” Lalu baginda mengajar aku: “Katakanlah: Aku berlindung kepada Tuhan yang menciptakan fajar,” dan “Katakanlah: Aku berlindung kepada Tuhan manusia.” Kemudian azan iqamah dikumandangkan, lalu baginda maju dan membacanya. Kemudian baginda lalu di sisiku dan berkata: “Bagaimana pendapatmu, wahai Uqbah bin Amir? Bacalah dua surah ini setiap kali engkau tidur dan bangun.”",
        "arabic_text": "أَخْبَرَنِي مَحْمُودُ بْنُ خَالِدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا الْوَلِيدُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي ابْنُ جَابِرٍ، ‏‏‏‏‏‏عَنِ الْقَاسِمِ أَبِي عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ عُقْبَةَ بْنِ عَامِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ بَيْنَا أَقُودُ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَقَبٍ مِنْ تِلْكَ النِّقَابِ،‏‏‏‏ إِذْ قَالَ:‏‏‏‏ أَلَا تَرْكَبُ يَا عُقْبَةُ ؟ ،‏‏‏‏ فَأَجْلَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَرْكَبْ مَرْكَبَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ أَلَا تَرْكَبُ يَا عُقْبَةُ ؟ ،‏‏‏‏ فَأَشْفَقْتُ أَنْ يَكُونَ مَعْصِيَةً، ‏‏‏‏‏‏فَنَزَلَ وَرَكِبْتُ هُنَيْهَةً،‏‏‏‏ وَنَزَلْتُ وَرَكِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ أَلَا أُعَلِّمُكَ سُورَتَيْنِ مِنْ خَيْرِ سُورَتَيْنِ قَرَأَ بِهِمَا النَّاسُ فَأَقْرَأَنِي قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ،‏‏‏‏ وَ قُلْ أَعُوذُ بِرَبِّ النَّاسِ ، ‏‏‏‏‏‏فَأُقِيمَتِ الصَّلَاةُ فَتَقَدَّمَ فَقَرَأَ بِهِمَا ثُمَّ مَرَّ بِي، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ كَيْفَ رَأَيْتَ يَا عُقْبَةَ بْنَ عَامِرٍ ؟ اقْرَأْ بِهِمَا كُلَّمَا نِمْتَ وَقُمْتَ ."
      },
      {
        "id": 40428,
        "hadith_number": "5440",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Mengadu kepada Allah dengan Membaca Surah Al-Falaq dan An-Nas",
        "perawi_melayu": "Uqbah bin Amir",
        "english_text": "It was narrated that 'Uqbah bin 'Amir said: I was walking with the Messenger of Allah [SAW] and he said: O 'Uqbah, say!' I said: 'What should I say, O Messenger of Allah?' He did not answer me, then h esaid: 'O 'Uqbah, say!' I said: 'What should I say, O Messenger of Allah?' But he did not answer me. I said: 'O Allah, make him answer me.' He said: 'O 'Uqbah, say!' I said: 'What should I say, O Messenger of Allah?' He said: 'Say: I seek refuge with (Allah) the Lord of the daybreak...' So I recited it until I came to the end. Then he said: 'Say,' and I said: 'What should I say, O Messenger of Allah?' He said: 'Say: I seek refuge with (Allah) the Lord of mankind...,' so I recited it until I came to the end. Then the Messenger of Allah [SAW] said: 'No one who asks has ever asked by means of anything like them, and no one who seeks refuge has ever sought refuge with anything like them.'",
        "malay_translation": "Daripada Uqbah bin Amir, katanya: Aku sedang berjalan bersama Rasulullah SAW, lalu baginda bersabda: \"Wahai Uqbah, bacalah!\" Aku bertanya: \"Apakah yang harus saya bacakan, wahai Rasulullah?\" Baginda tidak menjawabku. Kemudian baginda bersabda lagi: \"Wahai Uqbah, bacalah!\" Aku bertanya: \"Apakah yang harus saya bacakan, wahai Rasulullah?\" Baginda masih tidak menjawab. Lalu aku berdoa: \"Ya Allah, berilah jawapan kepadanya.\" Baginda bersabda: \"Wahai Uqbah, bacalah!\" Aku bertanya: \"Apakah yang harus saya bacakan, wahai Rasulullah?\" Baginda bersabda: \"Bacalah: 'Aku berlindung kepada Tuhan yang memiliki fajar...'\". Maka aku membacanya sehingga habis. Kemudian baginda bersabda: \"Bacalah!\" Aku bertanya: \"Apakah yang harus saya bacakan, wahai Rasulullah?\" Baginda bersabda: \"Bacalah: 'Aku berlindung kepada Tuhan manusia...'\". Maka aku membacanya sehingga habis. Kemudian Rasulullah SAW bersabda: \"Tidak pernah ada seorang pun yang memohon dengan sesuatu yang lebih baik daripada kedua-duanya ini, dan tidak pernah ada seorang pun yang meminta perlindungan dengan sesuatu yang lebih baik daripada kedua-duanya ini.\"",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا اللَّيْثُ، ‏‏‏‏‏‏عَنْ ابْنِ عَجْلَانَ، ‏‏‏‏‏‏عَنْ سَعِيدٍ الْمَقْبُرِيِّ، ‏‏‏‏‏‏عَنْ عُقْبَةَ بْنِ عَامِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنْتُ أَمْشِي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا عُقْبَةُ،‏‏‏‏ قُلْ ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ مَاذَا أَقُولُ يَا رَسُولَ اللَّهِ ؟،‏‏‏‏ فَسَكَتَ عَنِّي، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ يَا عُقْبَةُ،‏‏‏‏ قُلْ ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ مَاذَا أَقُولُ يَا رَسُولَ اللَّهِ ؟،‏‏‏‏ فَسَكَتَ عَنِّي، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ اللَّهُمَّ ارْدُدْهُ عَلَيَّ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا عُقْبَةُ،‏‏‏‏ قُلْ ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ مَاذَا أَقُولُ يَا رَسُولَ اللَّهِ ؟ فَقَالَ:‏‏‏‏ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ،‏‏‏‏ فَقَرَأْتُهَا حَتَّى أَتَيْتُ عَلَى آخِرِهَا، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ قُلْ ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ مَاذَا أَقُولُ يَا رَسُولَ اللَّهِ ؟ قَالَ:‏‏‏‏ قُلْ أَعُوذُ بِرَبِّ النَّاسِ ،‏‏‏‏ فَقَرَأْتُهَا حَتَّى أَتَيْتُ عَلَى آخِرِهَا، ‏‏‏‏‏‏ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ ذَلِكَ:‏‏‏‏ مَا سَأَلَ سَائِلٌ بِمِثْلِهِمَا،‏‏‏‏ وَلَا اسْتَعَاذَ مُسْتَعِيذٌ بِمِثْلِهِمَا ."
      },
      {
        "id": 40429,
        "hadith_number": "5441",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Keutamaan Ayat al-Falaq",
        "perawi_melayu": "Uqbah bin Amir",
        "english_text": "It was narrated that 'Uqbah bin 'Amir said: I came to the Messenger of Allah [SAW] while he was riding, and I put my hand on his foot and said: 'Teach me Surah Hud, teach me Surah Yusuf. He said: 'You will never recite anything more precious before Allah, the Mighty and Sublime, than: 'Say: I seek refuge with (Allah) the Lord of the daybreak.'",
        "malay_translation": "Daripada Uqbah bin Amir, katanya: Aku datang kepada Rasulullah SAW ketika baginda sedang menunggang, lalu aku meletakkan tanganku di atas kaki baginda dan berkata: \"Ajarkanlah kepadaku Surah Hud, ajarkanlah kepadaku Surah Yusuf.\" Baginda bersabda: \"Kamu tidak akan pernah membaca sesuatu yang lebih bernilai di sisi Allah SWT daripada: 'Katakanlah: Aku berlindung kepada Tuhan yang menguasai waktu fajar.'\"",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا اللَّيْثُ، ‏‏‏‏‏‏عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، ‏‏‏‏‏‏عَنْ أَبِي عِمْرَانَ أَسْلَمَ، ‏‏‏‏‏‏عَنْ عُقْبَةَ بْنِ عَامِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ رَاكِبٌ،‏‏‏‏ فَوَضَعْتُ يَدِي عَلَى قَدَمِهِ،‏‏‏‏ فَقُلْتُ:‏‏‏‏ أَقْرِئْنِي سُورَةَ هُودٍ، ‏‏‏‏‏‏أَقْرِئْنِي سُورَةَ يُوسُفَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ لَنْ تَقْرَأَ شَيْئًا أَبْلَغَ عِنْدَ اللَّهِ عَزَّ وَجَلَّ مِنْ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ."
      },
      {
        "id": 40430,
        "hadith_number": "5442",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Ayat-ayat Perlindungan daripada Allah SWT",
        "perawi_melayu": "Uqbah bin Amir",
        "english_text": "It was narrated from 'Uqbah bin 'Amir that: The Prophet [SAW] said: There have been revealed to me Verses the like of which has never been seen: 'Say: I seek refuge with (Allah) the Lord of the daybreak...' to the end of the Surah, and 'Say: I seek refuge with (Allah) the Lord of mankind...' to the end of the Surah.",
        "malay_translation": "Daripada Uqbah bin Amir, bahawa Nabi SAW bersabda: Telah diwahyukan kepadaku ayat-ayat yang tidak pernah dilihat sebelumnya:  'Katakanlah: Aku berlindung kepada Tuhan yang menguasai waktu fajar...' sehingga akhir surah, dan 'Katakanlah: Aku berlindung kepada Tuhan manusia...' sehingga akhir surah.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا إِسْمَاعِيل، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا قَيْسٌ، ‏‏‏‏‏‏عَنْ عُقْبَةَ بْنِ عَامِرٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أُنْزِلَ عَلَيَّ آيَاتٌ لَمْ يُرَ مِثْلُهُنَّ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ إِلَى آخِرِ السُّورَةِ،‏‏‏‏ وَ قُلْ أَعُوذُ بِرَبِّ النَّاسِ إِلَى آخِرِ السُّورَةِ ."
      },
      {
        "id": 40431,
        "hadith_number": "5443",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Keutamaan Membaca Surah Al-Falaq dan An-Nas",
        "perawi_melayu": "Jabir bin Abdullah",
        "english_text": "It was narrated that Jabir bin 'Abdullah said: The Messenger of Allah [SAW] said to me: 'Recite, O Jabir!' I said: 'What should I recite, may my father and mother be ransomed for you, O Messenger of Allah?' He said: Recite: 'Say: I seek refuge with (Allah) the Lord of the daybreak...,' and: 'Say: I seek refuge with (Allah) the Lord of mankind...' So I recited them, and he said: 'Recite them, for you will never recite anything like them.'",
        "malay_translation": "Jabir bin Abdullah meriwayatkan bahawa Rasulullah SAW bersabda kepadanya: \"Bacalah, wahai Jabir!\"  Aku berkata: \"Apakah yang patut saya bacakan, semoga ayah dan ibuku menjadi tebusan bagimu, wahai Rasulullah?\" Baginda bersabda: \"Bacalah: 'Katakanlah: Aku berlindung kepada Tuhan yang menguasai subuh...' dan 'Katakanlah: Aku berlindung kepada Tuhan manusia...'.\" Maka aku membacanya, dan baginda bersabda: \"Bacalah kedua-duanya, kerana engkau tidak akan pernah membaca sesuatu yang serupa dengannya.\"",
        "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي بَدَلٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شَدَّادُ بْنُ سَعِيدٍ أَبُو طَلْحَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا سَعِيدٌ الْجُرَيْرِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو نَضْرَةَ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اقْرَأْ يَا جَابِرُ ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ وَمَاذَا أَقْرَأُ بِأَبِي أَنْتَ وَأُمِّي يَا رَسُولَ اللَّهِ ؟ قَالَ:‏‏‏‏ اقْرَأْ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ وَ قُلْ أَعُوذُ بِرَبِّ النَّاسِ ،‏‏‏‏ فَقَرَأْتُهُمَا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ اقْرَأْ بِهِمَا وَلَنْ تَقْرَأَ بِمِثْلِهِمَا ."
      },
      {
        "id": 40432,
        "hadith_number": "5444",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Nabi SAW daripada Empat Perkara",
        "perawi_melayu": "Abdullah bin Amr",
        "english_text": "It was narrated from 'Abdullah bin Amr that: The Prophet [SAW] used to seek refuge (with Allah) from four things: From knowledge that is of no benefit, from a heart that does not feel humble, from a supplication that is not heard, and a soul that is never satisfied.",
        "malay_translation": "Daripada Abdullah bin Amr, diriwayatkan bahawa Nabi SAW selalu memohon perlindungan daripada Allah daripada empat perkara:  daripada ilmu yang tidak bermanfaat, daripada hati yang tidak khusyuk, daripada doa yang tidak dimakbul, dan daripada jiwa yang tidak pernah merasa puas.",
        "arabic_text": "أَخْبَرَنَا يَزِيدُ بْنُ سِنَانٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ أَبِي سِنَانٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ أَبِي الْهُذَيْلِ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو:‏‏‏‏ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَعَوَّذُ مِنْ أَرْبَعٍ:‏‏‏‏ مِنْ عِلْمٍ لَا يَنْفَعُ، ‏‏‏‏‏‏وَمِنْ قَلْبٍ لَا يَخْشَعُ، ‏‏‏‏‏‏وَدُعَاءٍ لَا يُسْمَعُ، ‏‏‏‏‏‏وَنَفْسٍ لَا تَشْبَعُ ."
      },
      {
        "id": 40433,
        "hadith_number": "5445",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Nabi SAW daripada Sifat Keji",
        "perawi_melayu": "Umar رضي الله عنه",
        "english_text": "It was narrated from 'Umar that: The Prophet [SAW] used to seek refuge with Allah from cowardice, miserliness, the tribulation of the heart and the torment of the grave.",
        "malay_translation": "Daripada Umar رضي الله عنه, diriwayatkan bahawa: Nabi SAW sentiasa memohon perlindungan daripada Allah daripada sifat pengecut, kedekut, fitnah hati dan azab kubur.",
        "arabic_text": "أَخْبَرَنَا إِسْحَاق بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا عُبَيْدُ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا إِسْرَائِيلُ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ مَيْمُونٍ، ‏‏‏‏‏‏عَنْ عَمُرَ:‏‏‏‏ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَعَوَّذُ مِنَ الْجُبْنِ، ‏‏‏‏‏‏وَالْبُخْلِ، ‏‏‏‏‏‏وَفِتْنَةِ الصَّدْرِ، ‏‏‏‏‏‏وَعَذَابِ الْقَبْرِ ."
      },
      {
        "id": 40434,
        "hadith_number": "5446",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Mencari Perlindungan daripada Allah SWT",
        "perawi_melayu": "Syakal bin Humaid",
        "english_text": "It was narrated that Shakal bin Humaid said: I came to the Prophet [SAW] and said: 'O Prophet of Allah, teach me words by means of which I may seek refuge with Allah.' He took me by the hand and said: 'Say: A'udhu bika min sharri sam'i, wa sharri basari, wa sharri lisani, wa sharri qalbi, wa sharri mani (I seek refuge with You from the evil of my hearing, the evil of my seeing, the evil of my tongue, the evil of my heart, and the evil of my sperm).'",
        "malay_translation": "Daripada Syakal bin Humaid, katanya: Aku datang kepada Nabi SAW lalu berkata: \"Wahai Nabi Allah, ajarkanlah kepadaku kata-kata yang boleh aku gunakan untuk memohon perlindungan daripada Allah.\" Baginda memegang tanganku lalu bersabda: \"Katakanlah:  Aku berlindung kepada-Mu daripada kejahatan pendengaranku, kejahatan penglihatanku, kejahatan lidahku, kejahatan hatiku, dan kejahatan mani ku.\"",
        "arabic_text": "أَخْبَرَنَا الْحَسَنُ بْنُ إِسْحَاق، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو نُعَيْمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا سَعْدُ بْنُ أَوْسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي بِلَالُ بْنُ يَحْيَى، ‏‏‏‏‏‏أَنَّ شُتَيْرَ بْنَ شَكَلٍ أَخْبَرَهُ، ‏‏‏‏‏‏عَنْ أَبِيهِ شَكَلِ بْنِ حُمَيْدٍ،‏‏‏‏ قَالَ:‏‏‏‏ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ فَقُلْتُ:‏‏‏‏ يَا نَبِيَّ اللَّهِ،‏‏‏‏ عَلِّمْنِي تَعَوُّذًا أَتَعَوَّذُ بِهِ ؟ فَأَخَذَ بِيَدِي ثُمَّ قَالَ:‏‏‏‏ قُلْ:‏‏‏‏ أَعُوذُ بِكَ مِنْ شَرِّ سَمْعِي، ‏‏‏‏‏‏وَشَرِّ بَصَرِي، ‏‏‏‏‏‏وَشَرِّ لِسَانِي، ‏‏‏‏‏‏وَشَرِّ قَلْبِي، ‏‏‏‏‏‏وَشَرِّ مَنِيِّي ، ‏‏‏‏‏‏قَالَ حَتَّى حَفِظْتُهَا. قَالَ سَعْدٌ:‏‏‏‏ وَالْمَنِيُّ مَاؤُهُ."
      },
      {
        "id": 40435,
        "hadith_number": "5447",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Rasulullah SAW daripada Sifat-Sifat Keji",
        "perawi_melayu": "Mus'ab bin Sa'd daripada bapanya",
        "english_text": "It was narrated that 'Abudl-Malik bin 'Umair said: I heard Mus'ab bin Sa'd (narrate) about his father: 'He used to tech us five things, which he said that the Messenger of Allah [SAW] used to recite in his supplication: 'Allahumma inni a'udhu bika minal-bukhli, wa a'udhu bika minal-jubni, wa a'udhu bika an uradda ila ardhalil-'umuri, wa a'udhu bika min fitnatid-dunya, wa a'udhu bika min 'adhabil-qabr (O Allah, I seek refuge in You from miserliness, and I seek refuge in You from cowardice, and I seek refuge in You from reaching the age of senility, and I seek refuge in You from the trials of this world, and I seek refuge in You from the torment of the grave).'",
        "malay_translation": "Telah menceritakan Abdul Malik bin Umair: Aku mendengar Mus'ab bin Sa'd (bercerita) tentang bapanya:  'Bapanya selalu mengajar kami lima perkara yang baginda Nabi Muhammad SAW selalu membacanya dalam doanya:  'Allahumma inni a'udhu bika minal-bukhli, wa a'udhu bika minal-jubni, wa a'udhu bika an uradda ila ardhalil-'umuri, wa a'udhu bika min fitnatid-dunya, wa a'udhu bika min 'adhabil-qabr (Ya Allah, aku berlindung kepadaMu daripada sifat kedekut, dan aku berlindung kepadaMu daripada sifat pengecut, dan aku berlindung kepadaMu daripada sampai ke usia tua yang lemah, dan aku berlindung kepadaMu daripada fitnah dunia, dan aku berlindung kepadaMu daripada azab kubur).' ",
        "arabic_text": "أَخْبَرَنَا إِسْمَاعِيل بْنُ مَسْعُودٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا خَالِدٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ مُصْعَبَ بْنَ سَعْدٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ،‏‏‏‏ قَالَ:‏‏‏‏ كَانَ يُعَلِّمُنَا خَمْسًا كَانَ يَقُولُ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو بِهِنَّ وَيَقُولُهُنَّ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبُخْلِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنَ الْجُبْنِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ ."
      },
      {
        "id": 40436,
        "hadith_number": "5448",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Nabi SAW daripada Lima Perkara",
        "perawi_melayu": "Ibn Mas'ud",
        "english_text": "It was narrated that Ibn Mas'ud said: The Prophet [SAW] used to seek refuge (with Allah) from five things: From miserliness, cowardice, reaching the age of second childhood, the tribulation of the heart and the torment of the grave.",
        "malay_translation": "Daripada Ibnu Mas'ud, katanya: Nabi SAW selalu memohon perlindungan (kepada Allah) daripada lima perkara: Kedekut, kepengecutan, usia tua yang membawa kepada kelemahan akal, fitnah hati dan azab kubur.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، ‏‏‏‏‏‏عَنْ زَكَرِيَّا، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ مَيْمُونٍ، ‏‏‏‏‏‏عَنْ ابْنِ مَسْعُودٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَعَوَّذُ مِنَ خَمْسٍ:‏‏‏‏ مِنَ الْبُخْلِ، ‏‏‏‏‏‏وَالْجُبْنِ، ‏‏‏‏‏‏وَسُوءِ الْعُمُرِ، ‏‏‏‏‏‏وَفِتْنَةِ الصَّدْرِ، ‏‏‏‏‏‏وَعَذَابِ الْقَبْرِ ."
      },
      {
        "id": 40437,
        "hadith_number": "5449",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa Sa'd untuk perlindungan daripada kedekut, kepengecutan, tua, fitnah dunia dan azab kubur",
        "perawi_melayu": "Amr bin Maimun Al-Awdi",
        "english_text": "It was narrated that 'Amr bin Maimun Al-Awdi said: Sa'd used to teach his children these words as a teacher teaches his students, and he said that the Messenger of Allah [SAW] used to seek refuge by means of them at the end of every prayer: 'Allahumma inni a'udhu bika minal-bukhli, wa a'udhu bika minal-jubni, wa a'udhu bika an uradda ila ardhalil-'umuri, wa a'udhu bika min fitnatid-dunya, wa a'udhu bika min 'adhabil-qabr (O Allah, I seek refuge with You from miserliness, and I seek refuge in You from cowardice, and I seek refuge in You from reaching the age of senility, and I seek refuge in You from the trials of this world, and I seek refuge in You from the torment of the grave.) So I narrated that to Mus'ab and he said that he told the truth.",
        "malay_translation": "Daripada Amr bin Maimun Al-Awdi, beliau berkata: Sa'd mengajar anak-anaknya perkataan ini sepertimana guru mengajar murid-muridnya, dan beliau berkata bahawa Rasulullah SAW sentiasa memohon perlindungan dengannya di akhir setiap solat:  \"Allahumma inni a'udhu bika minal-bukhli, wa a'udhu bika minal-jubni, wa a'udhu bika an uradda ila ardhalil-'umuri, wa a'udhu bika min fitnatid-dunya, wa a'udhu bika min 'adhabil-qabr (Ya Allah, aku berlindung kepadaMu daripada kedekut, dan aku berlindung kepadaMu daripada kepengecutan, dan aku berlindung kepadaMu daripada sampai ke usia tua yang lemah, dan aku berlindung kepadaMu daripada fitnah dunia, dan aku berlindung kepadaMu daripada azab kubur).\"  Maka aku ceritakan hal ini kepada Mus'ab, dan dia membenarkannya.",
        "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حَبَّانُ بْنُ هِلَالٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو عَوَانَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ مَيْمُونٍ الْأَوْدِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ سَعْدٌ يُعَلِّمُ بَنِيهِ هَؤُلَاءِ الْكَلِمَاتِ كَمَا يُعَلِّمُ الْمُعَلِّمُ الْغِلْمَانَ،‏‏‏‏ وَيَقُولُ:‏‏‏‏ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَعَوَّذُ بِهِنَّ دُبُرَ الصَّلَاةِ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبُخْلِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنَ الْجُبْنِ،‏‏‏‏ وَأَعُوذُ بِكَ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، ‏‏‏‏‏‏فَحَدَّثْتُ بِهَا مُصْعَبًا فَصَدَّقَهُ ."
      },
      {
        "id": 40438,
        "hadith_number": "5450",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Mencari Perlindungan daripada Kelemahan dan Ujian",
        "perawi_melayu": "Anas رضي الله عنه",
        "english_text": "It was narrated from Anas that: The Messenger of Allah [SAW] used to say: Allahumma inni a'udhu bika minal-'ajzi, wal-kasali, wal-bukhli, wal-harami, 'adhabil-qabr wa fitnatil-mahya wal-mamat (O Allah, I seek refuge in You from incapacity and laziness, and miserliness and old age, and the torment of the grave, and the trials of life and death.)",
        "malay_translation": "Dari Anas رضي الله عنه, diriwayatkan bahawa Rasulullah ﷺ selalu berdoa:  \"Allahumma inni a'udhu bika minal-'ajzi, wal-kasali, wal-bukhli, wal-harami, 'adhabil-qabr wa fitnatil-mahya wal-mamat.\" (Ya Allah, aku berlindung kepada-Mu daripada kelemahan dan kemalasan, daripada kedekut dan tua, daripada azab kubur, dan daripada ujian hidup dan mati.)",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏عَنْ مُعَاذِ بْنِ هِشَامٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبِي، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، ‏‏‏‏‏‏وَالْبُخْلِ وَالْهَرَمِ، ‏‏‏‏‏‏وَعَذَابِ الْقَبْرِ، ‏‏‏‏‏‏وَفِتْنَةِ الْمَحْيَا وَالْمَمَاتِ ."
      },
      {
        "id": 40439,
        "hadith_number": "5451",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Rasulullah SAW daripada Kelemahan dan Keburukan",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "It was narrated that Anas bin Malik said: The Messenger of Allah [SAW] had supplications that he never omitted to recite. He used to say: 'Allahumma inni a'udhu bika minal-hammi, wal-hazani, wal-'ajzi, wal-kasali, wal-bukhli, wal-jubni, wa ghalabatar-rijal (O Allah, I seek refuge with You from worry, grief, incapacity, laziness, miserliness, cowardice and being overpowered by (other) men.)",
        "malay_translation": "Dari Anas bin Malik, katanya: Rasulullah SAW sentiasa berdoa dengan doa ini dan tidak pernah meninggalkannya. Baginda selalu berdoa:  'Allahumma inni a'udhu bika minal-hammi, wal-hazani, wal-'ajzi, wal-kasali, wal-bukhli, wal-jubni, wa ghalabatar-rijal (Ya Allah, aku berlindung kepada-Mu daripada kegusaran, kesedihan, kelemahan, kemalasan, kedekut, kepengecutan dan daripada dikalahkan oleh manusia.)'",
        "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ الْمُنْذِرِ، ‏‏‏‏‏‏عَنْ ابْنِ فُضَيْلٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاق، ‏‏‏‏‏‏عَنْ الْمِنْهَالِ بْنِ عَمْرٍو، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعَوَاتٌ لَا يَدَعُهُنَّ، ‏‏‏‏‏‏كَانَ يَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، ‏‏‏‏‏‏وَالْعَجْزِ وَالْكَسَلِ، ‏‏‏‏‏‏وَالْبُخْلِ وَالْجُبْنِ، ‏‏‏‏‏‏وَغَلَبَةِ الرِّجَالِ ."
      },
      {
        "id": 40440,
        "hadith_number": "5452",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa Rasulullah SAW daripada Kerisauan dan Kelemahan",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "It was narrated that Anas bin Malik said: The Messenger of Allah [SAW] had supplications that he never neglected. He used to say: 'Allahumma inni a'udhu bika minal-hammi, wal-hazani, wal-'ajzi, wal-kasali, wal-bukhli, wal-jubni, wad-daini, wa ghalabatar-rijal (O Allah, I seek refuge with You from worry, grief, incapacity, laziness, miserliness, cowardice, debt, and being overpowered by (other) men.)",
        "malay_translation": "Dari Anas bin Malik, katanya: Rasulullah SAW sentiasa berdoa dengan doa-doa ini dan tidak pernah meninggalkannya. Baginda berdoa:  'Allahumma inni a'udhu bika minal-hammi, wal-hazani, wal-'ajzi, wal-kasali, wal-bukhli, wal-jubni, wad-daini, wa ghalabatar-rijal (Ya Allah, aku berlindung kepada-Mu daripada kerisauan, kesedihan, kelemahan, kemalasan, kedekut, kepengecutan, hutang, dan daripada ditindas oleh manusia).' ",
        "arabic_text": "أَخْبَرَنَا إِسْحَاق بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا جَرِيرٌ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ إِسْحَاق، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو،‏‏‏‏ عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعَوَاتٌ لَا يَدَعُهُنَّ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، ‏‏‏‏‏‏وَالْعَجْزِ وَالْكَسَلِ، ‏‏‏‏‏‏وَالْبُخْلِ وَالْجُبْنِ، ‏‏‏‏‏‏وَالدَّيْنِ وَغَلَبَةِ الرِّجَالِ . قَالَ أَبُو عَبْد الرَّحْمَنِ:‏‏‏‏ هَذَا الصَّوَابُ،‏‏‏‏ وَحَدِيثُ ابْنِ فُضَيْلٍ خَطَأٌ."
      },
      {
        "id": 40441,
        "hadith_number": "5453",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa Nabi SAW daripada Kelemahan dan Fitnah",
        "perawi_melayu": "Anas r.a.",
        "english_text": "Anas said: The Prophet [SAW] used to say in his supplication: 'Allahumma inni a'udhu bika minal-kasali, wal-harami, wal-jubni, wal-bukhli, wa fitnatid-dajjali, wa 'adhabil-qabr (O Allah, I seek refuge in You from laziness, old age, cowardice, miserliness, the tribulation of the Dajjal and the torment of the grave.)",
        "malay_translation": "Anas berkata: Rasulullah SAW selalu berdoa:  'Ya Allah, sesungguhnya aku berlindung kepadaMu daripada kemalasan, usia tua, sifat pengecut, kedekut, fitnah Dajjal, dan azab kubur.'",
        "arabic_text": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا بِشْرٌ، ‏‏‏‏‏‏عَنْ حُمَيْدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ أَنَسٌ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْهَرَمِ، ‏‏‏‏‏‏وَالْجُبْنِ وَالْبُخْلِ، ‏‏‏‏‏‏وَفِتْنَةِ الدَّجَّالِ، ‏‏‏‏‏‏وَعَذَابِ الْقَبْرِ ."
      },
      {
        "id": 40442,
        "hadith_number": "5454",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Mencari Perlindungan daripada Kelemahan dan Ujian",
        "perawi_melayu": "Anas bin Malik r.a.",
        "english_text": "It was narrated from Anas that: The Prophet [SAW] used to say: Allahumma inni a'udhu bika minal-'ajzi, wal-kasali, wal-harami, wal-bukhli, wal-jubni, wa 'audhu bika min 'adhabil-qabri, wa min fitnatil-mahya wal-mamati (O Allah, I seek refuge in You from incapacity, laziness, old age, miserliness and cowardice, and I seek refuge in You from the torment of the grave, and from the trials of life and death.)",
        "malay_translation": "Dari Anas r.a. diriwayatkan bahawa Nabi SAW selalu berdoa:  Allahumma inni a'udhu bika minal-'ajzi, wal-kasali, wal-harami, wal-bukhli, wal-jubni, wa a'udhu bika min 'adhabil-qabri, wa min fitnatil-mahya wal-mamati. (Ya Allah, aku berlindung kepada-Mu daripada kelemahan, kemalasan, ketuaan, kedekut dan pengecutan, dan aku berlindung kepada-Mu daripada azab kubur, dan daripada ujian hidup dan mati.)",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا الْمُعْتَمِرُ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، ‏‏‏‏‏‏وَالْهَرَمِ، ‏‏‏‏‏‏وَالْبُخْلِ وَالْجُبْنِ،‏‏‏‏ وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، ‏‏‏‏‏‏وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ ."
      },
      {
        "id": 40443,
        "hadith_number": "5455",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Mencari Perlindungan daripada Kebimbangan dan Kelemahan",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "It was narrated from Anas bin Malik, that : When the Messenger of Allah [SAW] supplicated, he would say: Allahumma inni a'udhu bika minal-hammi, wal-hazani, wal-'ajzi, wal-kasali, wal-bukhli, wal-jubni, wad-dala'id-daini, wa ghalabatir-rijal (O Allah, I seek refuge with You from worry, grief, incapacity, laziness, miserliness, cowardice, difficult debt and being overpowered by men.)",
        "malay_translation": "Dari Anas bin Malik, bahawa Rasulullah SAW apabila berdoa, baginda akan berdoa:  Allahumma inni a'udhu bika minal-hammi, wal-hazani, wal-'ajzi, wal-kasali, wal-bukhli, wal-jubni, wad-dala'id-daini, wa ghalabatir-rijal. (Ya Allah, aku memohon perlindungan kepada-Mu daripada kebimbangan, kesedihan, kelemahan, kemalasan, kedekut, kepengecutan, beban hutang yang berat dan daripada ditindas oleh manusia.)",
        "arabic_text": "أَخْبَرَنَا أَبُو حَاتِمٍ السِّجِسْتَانِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي سَعِيدُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي عَمْرُو بْنُ أَبِي عَمْرٍو مَوْلَى الْمُطَّلِبِ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ الْمُطَّلِبِ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا دَعَا قَالَ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، ‏‏‏‏‏‏وَالْعَجْزِ وَالْكَسَلِ، ‏‏‏‏‏‏وَالْبُخْلِ وَالْجُبْنِ، ‏‏‏‏‏‏وَضَلَعِ الدَّيْنِ، ‏‏‏‏‏‏وَغَلَبَةِ الرِّجَالِ . قَالَ أَبُو عَبْد الرَّحْمَنِ:‏‏‏‏ سَعِيدُ بْنُ سَلَمَةَ شَيْخٌ ضَعِيفٌ، ‏‏‏‏‏‏وَإِنَّمَا أَخْرَجْنَاهُ لِلزِّيَادَةِ فِي الْحَدِيثِ."
      },
      {
        "id": 40444,
        "hadith_number": "5456",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Rasulullah SAW Sentiasa Bertawakkal Dari Hutang dan Dosa",
        "perawi_melayu": "Aisyah r.a.",
        "english_text": "It was narrated that 'Aishah said: The Messenger of Allah [SAW] often used to seek refuge (with Allah) from debt and sin. I said: 'O Messenger of Allah, how often you seek refuge from debt!' He said: 'Whoever gets into debt speaks and lies, and makes a promise and breaks it.'",
        "malay_translation": "Daripada Aisyah r.a., bahawa Rasulullah SAW sering beristighfar daripada hutang dan dosa.  Aku berkata, \"Wahai Rasulullah, mengapa tuan sering beristighfar daripada hutang?\" Baginda menjawab, \"Sesungguhnya sesiapa yang berhutang, dia akan berkata-kata dan berdusta, serta berjanji dan mungkir.\"",
        "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ عُثْمَانَ بْنِ أَبِي صَفْوَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي سَلَمَةُ بْنُ سَعِيدِ بْنِ عَطِيَّةَ وَكَانَ خَيْرَ أَهْلِ زَمَانِهِ،‏‏‏‏ قَالَ:‏‏‏‏ حَدَّثَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ،‏‏‏‏ قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكْثَرَ مَا يَتَعَوَّذُ مِنَ الْمَغْرَمِ وَالْمَأْثَمِ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ مَا،‏‏‏‏ أَكْثَرَ مَا تَتَعَوَّذُ مِنَ الْمَغْرَمِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنَّهُ مَنْ غَرِمَ حَدَّثَ فَكَذَبَ، ‏‏‏‏‏‏وَوَعَدَ فَأَخْلَفَ ."
      },
      {
        "id": 40445,
        "hadith_number": "5457",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Mencari Perlindungan daripada Allah SWT",
        "perawi_melayu": "Syakal bin Humaid",
        "english_text": "It was narrated that Shakal bin Humaid said: I came to the Prophet [SAW] and said: 'O Prophet of Allah, teach me words by which I may seek refuge (with Allah).' He took me by the hand then said: 'Say: A'udhu bika min sharri sam'i, wa sharri basari, wa sharri lisani, wa sharri qalbi, wa sharri mani (I seek refuge in You from the evil of my hearing, the evil of my seeing, the evil of my tongue, the evil of my heart, and the evil of my sperm),' until I had memorized it. Waki' contradicted him in the wordings.",
        "malay_translation": "Daripada Syakal bin Humaid, katanya: Aku datang kepada Nabi SAW, lalu aku berkata: “Wahai Nabi Allah, ajarkanlah kepadaku sesuatu perkataan yang boleh aku gunakan untuk memohon perlindungan (kepada Allah).” Baginda memegang tanganku, kemudian bersabda: “Katakanlah:  ‘Aku berlindung kepada-Mu daripada kejahatan pendengaranku, kejahatan penglihatanku, kejahatan lidahku, kejahatan hatiku dan kejahatan air mani ku.’ ”  Sehinggalah aku menghafalnya. Waki’ berbeza pendapat dengannya dari segi lafaz.",
        "arabic_text": "أَخْبَرَنَا الْحَسَنُ بْنُ إِسْحَاق، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا أَبُو نُعَيْمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا سَعْدُ بْنُ أَوْسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي بلَالُ بْنُ يَحْيَى، ‏‏‏‏‏‏أَنَّ شُتَيْرَ بْنَ شَكَلٍ أَخْبَرَهُ، ‏‏‏‏‏‏عَنْ أَبِيهِ شَكَلِ بْنِ حُمَيْدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ فَقُلْتُ:‏‏‏‏ يَا نَبِيَّ اللَّهِ،‏‏‏‏ عَلِّمْنِي تَعَوُّذًا أَتَعَوَّذُ بِهِ،‏‏‏‏ فَأَخَذَ بِيَدِي، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ قُلْ:‏‏‏‏ أَعُوذُ بِكَ مِنْ شَرِّ سَمْعِي، ‏‏‏‏‏‏وَشَرِّ بَصَرِي، ‏‏‏‏‏‏وَشَرِّ لِسَانِي، ‏‏‏‏‏‏وَشَرِّ قَلْبِي، ‏‏‏‏‏‏وَشَرِّ مَنِيِّي ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَتَّى حَفِظْتُهَا. قَالَ سَعْدٌ:‏‏‏‏ وَالْمَنِيُّ مَاؤُهُ، ‏‏‏‏‏‏خَالَفَهُ وَكِيعٌ فِي لَفْظِهِ."
      },
      {
        "id": 40446,
        "hadith_number": "5458",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Perlindungan daripada Kejahatan",
        "perawi_melayu": "Syutair bin Syakal bin Humaid",
        "english_text": "It was narrated from Shutair bin Shakal bin Humaid, that his father said: I said: 'O Messenger of Allah, teach me a supplication from which I may benefit.' He said: 'Say: Allahumma 'afini min sharri sam'i, wa basari, wa lisani, wa qalbi, wa min sharri mani (O Allah, protect me from the evil of my hearing, my seeing, my tongue and my heart, and from the evil of my sperm.)' - Meaning sexual organ.",
        "malay_translation": "Daripada Syutair bin Syakal bin Humaid, bahawa bapanya berkata: Aku berkata: \"Wahai Rasulullah, ajarkan kepadaku satu doa yang dapat memberi manfaat kepadaku.\" Baginda SAW bersabda: \"Bacalah: Allahumma 'afini min sharri sam'i, wa basari, wa lisani, wa qalbi, wa min sharri maniyyi (Ya Allah, peliharalah aku daripada kejahatan pendengaran, penglihatanku, lidahku dan hatiku, dan daripada kejahatan air mani-ku).\" - Maksudnya: organ seksual.",
        "arabic_text": "أَخْبَرَنَا عُبَيْدُ بْنُ وَكِيعِ بْنِ الْجَرَّاحِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبِي، ‏‏‏‏‏‏عَنْ سَعْدِ بْنِ أَوْسٍ، ‏‏‏‏‏‏عَنْ بِلَالِ بْنِ يَحْيَى، ‏‏‏‏‏‏عَنْ شُتَيْرِ بْنِ شَكَلِ بْنِ حُمَيْدٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏ عَلِّمْنِي دُعَاءً أَنْتَفِعُ بِهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلِ:‏‏‏‏ اللَّهُمَّ عَافِنِي مِنْ شَرِّ سَمْعِي، ‏‏‏‏‏‏وَبَصَرِي، ‏‏‏‏‏‏وَلِسَانِي، ‏‏‏‏‏‏وَقَلْبِي،‏‏‏‏ وَمِنْ شَرِّ مَنِيِّي يَعْنِي ذَكَرَهُ."
      },
      {
        "id": 40447,
        "hadith_number": "5459",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Anas bin Malik daripada Azab Kubur dan Fitnah Dajjal",
        "perawi_melayu": "Humaid meriwayatkan daripada Anas bin Malik",
        "english_text": "It was narrated that Khalid said: Humaid narrated: 'Anas - bin Malik - was asked about the torment of the grave and about the Dajjal. He said: The Prophet of Allah [SAW] used to say: Allahumma, inni a'udhu bika minal-kasali, wal-harami, wal-jubni, wal-bukhli, wa fitnatid-dajjali, wa 'adhabil-qabr (O Allah, I seek refuge with You from laziness, old age, cowardice, stinginess, the tribulation of the Dajjal and the torment of the grave.)'",
        "malay_translation": "Dikatakan bahawa Khalid berkata: Humaid meriwayatkan: 'Anas bin Malik ditanya tentang azab kubur dan tentang Dajjal. Beliau berkata: Nabi Allah SAW selalu berdoa:  Allahumma inni a'udzu bika minal-kasali, wal-haram, wal-jubni, wal-bukhli, wa fitnatid-dajjali, wa 'adzabil-qabr (Ya Allah, aku berlindung kepadaMu daripada kemalasan, ketuaan, kepengecutan, kedekut, fitnah Dajjal dan azab kubur.)'",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏عَنْ خَالِدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حُمَيْدٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سُئِلَ أَنَسٌ وَهُوَ ابْنُ مَالِكٍ، ‏‏‏‏‏‏عَنْ عَذَابِ الْقَبْرِ، ‏‏‏‏‏‏وَعَنِ الدَّجَّالِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْهَرَمِ، ‏‏‏‏‏‏وَالْجُبْنِ وَالْبُخْلِ، ‏‏‏‏‏‏وَفِتْنَةِ الدَّجَّالِ، ‏‏‏‏‏‏وَعَذَابِ الْقَبْرِ ."
      },
      {
        "id": 40448,
        "hadith_number": "5460",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa perlindungan daripada kelemahan dan sifat-sifat mazmumah",
        "perawi_melayu": "Zaid bin Arqam",
        "english_text": "It was narrated that Zaid bin Arqam said: I will not teach you anything but that which the Messenger of Allah [SAW] used to teach us. He said: 'Allahumma inni a'udhu bika min al-'ajzi wal-kasali, wal-bukhli, wal-jubni, wal-harami, wa 'adhabil-qabri, Allahumma ati nafsi taqwaha, wa zakkiha anta khairu min zakkaha, anta waliyyuha wa mawlaha. Allahumma inni a'udhu bika min qalbin la yakhsha'u wa min nafsin la tashba'u wa 'ilmin la yanfa'u wa da'watin la yustajabu laha (O Allah, I seek refuge in You from incapacity, laziness, miserliness, cowardice, old age, the torment of the grave. O Allah, make my soul obedient and purify it, for You are the best One to purify it, You are its Guardian and Lord. O Allah, I seek refuge in You from a heart that is not humble, a soul that is not satisfied, knowledge that is of no benefit and a supplication that is not answered.)",
        "malay_translation": "Daripada Zaid bin Arqam, beliau berkata: Aku tidak akan mengajar kamu melainkan apa yang telah diajarkan oleh Rasulullah SAW kepada kami. Baginda bersabda:  \"Allahumma inni a'udhu bika min al-'ajzi wal-kasali, wal-bukhli, wal-jubni, wal-harami, wa 'adhabil-qabri, Allahumma ati nafsi taqwaha, wa zakkiha anta khairu min zakkaha, anta waliyyuha wa mawlaha. Allahumma inni a'udhu bika min qalbin la yakhsha'u wa min nafsin la tashba'u wa 'ilmin la yanfa'u wa da'watin la yustajabu laha.\" (Ya Allah, aku berlindung kepada-Mu daripada kelemahan, kemalasan, kedekut, pengecut, tua, dan azab kubur. Ya Allah, berikanlah kepada jiwaku ketaqwaannya, dan sucikanlah ia, kerana Engkaulah sebaik-baik yang menyucikannya, Engkaulah pelindung dan Tuhannya. Ya Allah, aku berlindung kepada-Mu daripada hati yang tidak tunduk, jiwa yang tidak pernah merasa puas, ilmu yang tidak bermanfaat, dan doa yang tidak dimakbulkan.)",
        "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا مُحَاضِرٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَاصِمٌ الْأَحْوَلُ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، ‏‏‏‏‏‏عَنْ زَيْدِ بْنِ أَرْقَمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا أُعَلِّمُكُمْ إِلَّا مَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَلِّمُنَا، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، ‏‏‏‏‏‏وَالْبُخْلِ وَالْجُبْنِ، ‏‏‏‏‏‏وَالْهَرَمِ وَعَذَابِ الْقَبْرِ، ‏‏‏‏‏‏اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا، ‏‏‏‏‏‏وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، ‏‏‏‏‏‏أَنْتَ وَلِيُّهَا وَمَوْلَاهَا، ‏‏‏‏‏‏اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ قَلْبٍ لَا يَخْشَعُ، ‏‏‏‏‏‏وَمِنْ نَفْسٍ لَا تَشْبَعُ، ‏‏‏‏‏‏وَعِلْمٍ لَا يَنْفَعُ، ‏‏‏‏‏‏وَدَعْوَةٍ لَا يُسْتَجَابُ لَهَا ."
      },
      {
        "id": 40449,
        "hadith_number": "5461",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa perlindungan daripada kelemahan dan ujian",
        "perawi_melayu": "Anas r.a.",
        "english_text": "It was narrated from Anas that: The Prophet of Allah [SAW] said: Allahumma inni a'udhu bika min al-'ajzi, wal-kasali, wal-bukhli, wal-jubni, wal-harami, wa 'adhabil-qabri, wa fitnatil-mahya wal-mamat (O Allah, I seek refuge in You from incapacity, laziness, miserliness, cowardice, old age, the torment of the grave and the trials of life and death.)",
        "malay_translation": "Dari Anas r.a., bahawa Nabi SAW bersabda:  \"Allahumma inni a'udzu bika min al-'ajzi, wal-kasali, wal-bukhli, wal-jubni, wal-harami, wa 'adhabil-qabri, wa fitnatil-mahya wal-mamat.\" (Ya Allah, aku berlindung kepada-Mu daripada kelemahan, kemalasan, kedekut, kepengecutan, ketuaan, azab kubur, dan ujian hidup dan mati.)",
        "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي أَبِي، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، ‏‏‏‏‏‏وَالْبُخْلِ وَالْجُبْنِ، ‏‏‏‏‏‏وَالْهَرَمِ وَعَذَابِ الْقَبْرِ، ‏‏‏‏‏‏وَفِتْنَةِ الْمَحْيَا وَالْمَمَاتِ ."
      },
      {
        "id": 40450,
        "hadith_number": "5462",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa Mencari Perlindungan daripada Kemiskinan, Kemelaratan dan Kezaliman",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "It was narrated from Abu Hurairah that: The Messenger of Allah [SAW] used to say: Allahumma, inni a'udhu bika minal-faqri wa a'udhu bika min al-qillati wadh-dhillati, wa a'udhu bika an azlima aw uzlam (O Allah, I seek refuge with you from poverty, I seek refuge with You from want and humiliation, and I seek refuge with You from wronging others or being wronged.) Al-Awza'I contradicted him.",
        "malay_translation": "Daripada Abu Hurairah, bahawa Rasulullah SAW selalu berdoa:  \"Ya Allah, aku berlindung kepada-Mu daripada kemiskinan, aku berlindung kepada-Mu daripada kekurangan dan kehinaan, dan aku berlindung kepada-Mu daripada melakukan kezaliman atau dianiaya.\" Al-Awza'i berbeza pendapat mengenainya.",
        "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ خُشَيْشُ بْنُ أَصْرَمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حَبَّانُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏عَنْ إِسْحَاق بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ يَسَارٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْفَقْرِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنَ الْقِلَّةِ وَالذِّلَّةِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ أَنْ أَظْلِمَ أَوْ أُظْلَمَ . خَالَفَهُ الْأَوْزَاعِيُّ."
      },
      {
        "id": 40451,
        "hadith_number": "5463",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Mengucapkan perlindungan kepada Allah daripada kemiskinan, kekurangan, kehinaan dan aniaya",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah said: The Messenger of Allah [SAW] said: 'Seek refuge with Allah from poverty, want, humiliation and wronging others or being wronged.'",
        "malay_translation": "Abu Hurairah berkata: Rasulullah SAW bersabda:  'Mohonlah perlindungan kepada Allah daripada kemiskinan, kekurangan, kehinaan, dan daripada menganiaya atau dianiaya.'",
        "arabic_text": "قَالَ:‏‏‏‏ أَخْبَرَنِي مَحْمُودُ بْنُ خَالِدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا الْوَلِيدُ، ‏‏‏‏‏‏عَنْ أَبِي عَمْرٍو هُوَ الْأَوْزَاعِيُّ قَالَ:‏‏‏‏ حَدَّثَنِي إِسْحَاق بْنُ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي جَعْفَرُ بْنُ عِيَاضٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي أَبُو هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ تَعَوَّذُوا بِاللَّهِ مِنَ الْفَقْرِ، ‏‏‏‏‏‏وَالْقِلَّةِ، ‏‏‏‏‏‏وَالذِّلَّةِ، ‏‏‏‏‏‏وَأَنْ تَظْلِمَ، ‏‏‏‏‏‏أَوْ تُظْلَمَ ."
      },
      {
        "id": 40452,
        "hadith_number": "5464",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Mencari Perlindungan daripada Kemiskinan dan Kezaliman",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "It was narrated from Abu Hurairah,: From the Prophet [SAW], that he used to say: Allahumma inni a'udhu bika minal-qillati wal-faqri, wadh-dhillati wa a'udhu bika min azlima aw uzlam (O Allah, I seek refuge with You from want, poverty and humiliation, and I seek refuge with You from wronging others or being wronged.)",
        "malay_translation": "Daripada Abu Hurairah r.a., bahawa Nabi SAW berdoa:  اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْقِلَّةِ وَالْفَقْرِ وَالذِّلَّةِ وَأَعُوذُ بِكَ أَنْ أَظْلِمَ أَوْ أُظْلَمَ  (Ya Allah, aku berlindung kepada-Mu daripada kekurangan, kemiskinan dan kehinaan, dan aku berlindung kepada-Mu daripada menzalimi orang lain atau dizalimi.)",
        "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ نَصْرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏عَنْ إِسْحَاق، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ يَسَارٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْقِلَّةِ، ‏‏‏‏‏‏وَالْفَقْرِ، ‏‏‏‏‏‏وَالذِّلَّةِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ أَنْ أَظْلِمَ، ‏‏‏‏‏‏أَوْ أُظْلَمَ ."
      },
      {
        "id": 40453,
        "hadith_number": "5465",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Mendoakan perlindungan daripada kemiskinan, kekurangan dan kehinaan",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah said: The Messenger of Allah [SAW] said: 'Seek refuge with Allah from poverty, want and humiliation, and from wronging others or being wronged.'",
        "malay_translation": "Abu Hurairah berkata: Rasulullah SAW bersabda: \"Mohonlah perlindungan kepada Allah daripada kemiskinan, kekurangan dan kehinaan, dan daripada menzalimi orang lain atau dizalimi.\"",
        "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ خَالِدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عُمَرُ يَعْنِي ابْنَ عَبْدِ الْوَاحِدِ، ‏‏‏‏‏‏عَنْ الْأَوْزَاعِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي إِسْحَاق بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي جَعْفَرُ بْنُ عِيَاضٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي أَبُو هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ تَعَوَّذُوا بِاللَّهِ مِنَ الْفَقْرِ، ‏‏‏‏‏‏وَمِنَ الْقِلَّةِ، ‏‏‏‏‏‏وَمِنَ الذِّلَّةِ، ‏‏‏‏‏‏وَأَنْ أَظْلِمَ، ‏‏‏‏‏‏أَوْ أُظْلَمَ ."
      },
      {
        "id": 40454,
        "hadith_number": "5466",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Mencari perlindungan daripada kemiskinan, kekurangan, kehinaan, dan kezaliman",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah narrated that: The Messenger of Allah [SAW] said: Seek refuge with Allah from poverty, want and humiliation, and from wronging others or being wronged.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:  “Mohonlah perlindungan kepada Allah daripada kemiskinan, kekurangan, kehinaan, dan daripada menzalimi orang lain atau dizalimi.”",
        "arabic_text": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي مُوسَى بْنُ شَيْبَةَ، ‏‏‏‏‏‏عَنْ الْأَوْزَاعِيِّ، ‏‏‏‏‏‏عَنْ إِسْحَاق بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي جَعْفَرُ بْنُ عِيَاضٍ، ‏‏‏‏‏‏أَنَّ أَبَا هُرَيْرَةَ حَدَّثَهُ، ‏‏‏‏‏‏عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ تَعَوَّذُوا بِاللَّهِ مِنَ الْفَقْرِ، ‏‏‏‏‏‏وَالْقِلَّةِ، ‏‏‏‏‏‏وَالذِّلَّةِ، ‏‏‏‏‏‏وَأَنْ تَظْلِمَ، ‏‏‏‏‏‏أَوْ تُظْلَمَ ."
      },
      {
        "id": 40455,
        "hadith_number": "5467",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Selepas Solat daripada Nabi SAW",
        "perawi_melayu": "Muslim bin Abi Bakrah",
        "english_text": "Muslim - meaning bin Abi Bakrah - narrated that: He heard his father say following the prayer: Allahumma inni a'udhu bika minal-kufri wal-faqri, wa 'adhabil-qabri (O Allah, I seek refuge with You from Kufr, poverty and the torment of the grave.) I started to recite them and he said: O my son, where did you learn these words? I said: O my father, I heard you saying this supplication at the end of the prayer, and I learned them from you. He said: Continue to recite them, O my son, for the Prophet of Allah [SAW] used to say this supplication at the end of the prayer.",
        "malay_translation": "Muslim - maksudnya bin Abi Bakrah - meriwayatkan bahawa: Baginda mendengar bapanya berdoa selepas solat:  Allahumma inni a'udhu bika minal-kufri wal-faqri, wa 'adhabil-qabri (Ya Allah, aku berlindung kepadaMu daripada kekufuran, kemiskinan, dan azab kubur.)  Aku mula membacanya dan bapaku berkata: Wahai anakku, di manakah engkau mempelajari kata-kata ini? Aku menjawab: Wahai bapaku, aku mendengar tuan membacanya di akhir solat, lalu aku mempelajarinya daripada tuan. Bapaku berkata: Teruskanlah membacanya, wahai anakku, kerana Nabi Allah SAW biasa berdoa dengannya di akhir solat.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عُثْمَانُ يَعْنِي الشَّحَّامَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا مُسْلِمٌ يَعْنِي ابْنَ أَبِي بَكْرَةَ، ‏‏‏‏‏‏أَنَّهُ كَانَ سَمِعَ وَالِدَهُ يَقُولُ فِي دُبُرِ الصَّلَاةِ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، ‏‏‏‏‏‏وَعَذَابِ الْقَبْرِ ،‏‏‏‏ فَجَعَلْتُ أَدْعُو بِهِنَّ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا بُنَيَّ،‏‏‏‏ أَنَّى عُلِّمْتَ هَؤُلَاءِ الْكَلِمَاتِ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ يَا أَبَتِ،‏‏‏‏ سَمِعْتُكَ تَدْعُو بِهِنَّ فِي دُبُرِ الصَّلَاةِ فَأَخَذْتُهُنَّ عَنْكَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَالْزَمْهُنَّ يَا بُنَيَّ، ‏‏‏‏‏‏فَإِنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو بِهِنَّ فِي دُبُرِ الصَّلَاةِ."
      },
      {
        "id": 40456,
        "hadith_number": "5468",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa Rasulullah SAW daripada Fitnah dan Dosa",
        "perawi_melayu": "Aisyah رضي الله عنها",
        "english_text": "It was narrated that 'Aishah said: The Messenger of Allah [SAW] often used to say these words in his supplication: 'Allahumma, inni a'udhu bika min fitnatin-nari, wa 'adhabin-nari, wa fitnatil-qabri, wa 'adhabil-qabr, wa sharri fitnatil masihid-dajjal, wa sharri fitnatil-faqri, wa sharri fitnatil-ghina. Allahummaghsil khatayaya bima'ith-thalji wal-baradi wa anqi qalbi minal-khataya kama anqaitath-thawbal-abyada min ad-danasi, wa ba'id baini wa baina khatayaya kama ba'adta bainal-mashriqi wal-maghrib. Allahumma inni a'udhu bika min al-kasali wal harami, wal ma'thami wal-maghram (O Allah, I seek refuge with You form the tribulation of the Fire and the torment of the Fire, from the tribulation of the grave and the torment of the grave, from the evil of the tribulation of the Al-Masihid-Dajjal, from the evils of the tribulation of poverty and from the evil of the tribulation of richness. O Allah, put a great distance between me and my sins, as great as the distance You have made between the East and the West. O Allah, I seek refuge in You from laziness, old age, sin and debt.)'",
        "malay_translation": "Daripada Aisyah رضي الله عنها, beliau berkata: Rasulullah SAW sering berdoa dengan doa ini: \"Ya Allah, aku berlindung kepada-Mu daripada fitnah neraka dan azab neraka, daripada fitnah kubur dan azab kubur, daripada kejahatan fitnah Dajjal, daripada kejahatan fitnah kemiskinan, dan daripada kejahatan fitnah kekayaan. Ya Allah, basuhlah dosa-dosaku dengan air salji dan hujan batu, dan sucikanlah hatiku daripada dosa sebagaimana Engkau menyucikan pakaian putih daripada kekotoran, dan jauhkanlah antara aku dan dosa-dosaku sebagaimana Engkau menjauhkan antara timur dan barat. Ya Allah, aku berlindung kepada-Mu daripada kemalasan, tua, dosa dan hutang.\"",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو أُسَامَةَ،‏‏‏‏ قَالَ:‏‏‏‏ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَثِيرًا مَا يَدْعُو بِهَؤُلَاءِ الْكَلِمَاتِ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ النَّارِ، ‏‏‏‏‏‏وَعَذَابِ النَّارِ، ‏‏‏‏‏‏وَفِتْنَةِ الْقَبْرِ، ‏‏‏‏‏‏وَعَذَابِ الْقَبْرِ، ‏‏‏‏‏‏وَشَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، ‏‏‏‏‏‏وَشَرِّ فِتْنَةِ الْفَقْرِ، ‏‏‏‏‏‏وَشَرِّ فِتْنَةِ الْغِنَى، ‏‏‏‏‏‏اللَّهُمَّ اغْسِلْ خَطَايَايَ بِمَاءِ الثَّلْجِ وَالْبَرَدِ، ‏‏‏‏‏‏وَأَنْقِ قَلْبِي مِنَ الْخَطَايَا كَمَا أَنْقَيْتَ الثَّوْبَ الْأَبْيَضَ مِنَ الدَّنَسِ، ‏‏‏‏‏‏وَبَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ، ‏‏‏‏‏‏كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، ‏‏‏‏‏‏اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْهَرَمِ وَالْمَأْثَمِ وَالْمَغْرَمِ ."
      },
      {
        "id": 40457,
        "hadith_number": "5469",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Mencari Perlindungan daripada Empat Perkara",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah said: The Messenger of Allah [SAW] used to say: 'Allahumma inni a'udhu bika min al-arba': min 'ilmin la yanfa'u, wa min qalbin la yakhsha'u, wa min nafsin la tashba'u, wa min du'a'in la yusma'u (O Allah, I seek refuge in You from four: From knowledge that is of no benefit, from a heart that is not humble, from a soul that is not satisfied and from a supplication that is not answered.)'",
        "malay_translation": "Abu Hurairah berkata: Rasulullah SAW selalu berdoa: \"Allahumma inni a'udzu bika minal arba': min 'ilmin la yanfa'u, wa min qalbin la yakhsyau, wa min nafsin la tasybau, wa min du'a'in la yusmau (Ya Allah, aku berlindung kepada-Mu daripada empat perkara: Daripada ilmu yang tidak bermanfaat, daripada hati yang tidak khusyuk, daripada jiwa yang tidak pernah merasa cukup, dan daripada doa yang tidak dimakbulkan).\"",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا اللَّيْثُ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، ‏‏‏‏‏‏عَنْ أَخِيهِ عَبَّادِ بْنِ أَبِي سَعِيدٍ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْأَرْبَعِ:‏‏‏‏ مِنْ عِلْمٍ لَا يَنْفَعُ، ‏‏‏‏‏‏وَمِنْ قَلْبٍ لَا يَخْشَعُ، ‏‏‏‏‏‏وَمِنْ نَفْسٍ لَا تَشْبَعُ، ‏‏‏‏‏‏وَمِنْ دُعَاءٍ لَا يُسْمَعُ ."
      },
      {
        "id": 40458,
        "hadith_number": "5470",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Mencari perlindungan daripada kelaparan dan khianat",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "It was narrated that Abu Hurairah said: The Messenger of Allah [SAW] said: 'Allahumma inni a'udhu bika minal-ju'I, fa innahu bi'sad-daji'u, wa a'udhu bika minal-khiyanati, fa innahu bi'satil-bitanah (O Allah, I seek refuge in You from hunger, for it is a bad companion, and I seek refuge with You from treachery, for it is a bad thing to hide in one's heart.)'",
        "malay_translation": "Dari Abu Hurairah, bahawa Rasulullah SAW bersabda:  \"Allahumma inni a'udzu bika minal-ju'i, fa innahu bi'sa ad-daji', wa a'udzu bika minal-khiyanati, fa innaha bi'satil-bitanah.\" (Ya Allah, aku berlindung kepada-Mu daripada kelaparan, kerana ia adalah teman yang buruk, dan aku berlindung kepada-Mu daripada khianat, kerana ia adalah perkara yang buruk untuk disembunyikan di dalam hati.)",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا ابْنُ إِدْرِيسَ، ‏‏‏‏‏‏عَنِ ابْنِ عَجْلَانَ، ‏‏‏‏‏‏عَنْ الْمَقْبُرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ،‏‏‏‏ قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْجُوعِ فَإِنَّهُ بِئْسَ الضَّجِيعُ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنَ الْخِيَانَةِ فَإِنَّهَا بِئْسَتِ الْبِطَانَةُ ."
      },
      {
        "id": 40459,
        "hadith_number": "5471",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Mencari Perlindungan daripada Kelaparan dan Khianat",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "It was narrated that Abu Hurairah said: The Messenger of Allah [SAW] used to say: 'Allahumma inni a'udhu bika minal-ju'i, fa innahu bi'sad-daji'u, wa a'udhu bika minal-khiyanati, fa innahu bi'satil-bitanah (O Allah, I seek refuge in You from hunger, for it is a bad companion, and I seek refuge with You from treachery, for it is a bad thing to hide in one's heart.)'",
        "malay_translation": "Daripada Abu Hurairah r.a., bahawa Rasulullah SAW berdoa: \"Ya Allah, aku berlindung kepadaMu daripada kelaparan, kerana ia adalah teman yang buruk, dan aku berlindung kepadaMu daripada khianat, kerana ia adalah perkara yang buruk untuk disembunyikan di dalam hati.\"",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا ابْنُ عَجْلَانَ وَذَكَرَ آخَرَ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْجُوعِ فَإِنَّهُ بِئْسَ الضَّجِيعُ، ‏‏‏‏‏‏وَمِنَ الْخِيَانَةِ فَإِنَّهَا بِئْسَتِ الْبِطَانَةُ ."
      },
      {
        "id": 40460,
        "hadith_number": "5472",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa Mencari Perlindungan daripada Ilmu yang Tidak Bermanfaat",
        "perawi_melayu": "Anas bin Malik رضي الله عنه",
        "english_text": "It was narrated from Anas that : The Prophet [SAW] used to say these supplications: Allahumma inni a'udhu bika min 'ilmin la yanfa'u, wa qalbin la yakhsha'u, wa du'a'in la yasma'u, wa nafsin la tashba'u. (O Allah, I seek refuge with You from knowledge that is of no benefit, a heart that is not humble, a supplication that is not heard and a soul that is not satisfied.) Then he would say: 'Allahumma inni a'udhu bika min ha'ula'il-arba' (O Allah, I seek refuge with You from these four.)",
        "malay_translation": "Dari Anas رضي الله عنه, diriwayatkan bahawa Nabi SAW berdoa dengan doa-doa ini:  اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ، وَقَلْبٍ لَا يَخْشَعُ، وَدُعَاءٍ لَا يُسْمَعُ، وَنَفْسٍ لَا تَشْبَعُ (Ya Allah, aku berlindung kepada-Mu daripada ilmu yang tidak bermanfaat, hati yang tidak khusyuk, doa yang tidak didengar, dan jiwa yang tidak pernah merasa puas.) Kemudian baginda akan berkata: اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ هَؤُلَاءِ الأَرْبَعِ (Ya Allah, aku berlindung kepada-Mu daripada keempat-empat perkara ini.)",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا خَلَفٌ، ‏‏‏‏‏‏عَنْ حَفْصٍ، ‏‏‏‏‏‏عَنْ أَنَسٍ:‏‏‏‏ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو بِهَذِهِ الدَّعَوَاتِ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ، ‏‏‏‏‏‏وَقَلْبٍ لَا يَخْشَعُ، ‏‏‏‏‏‏وَدُعَاءٍ لَا يُسْمَعُ، ‏‏‏‏‏‏وَنَفْسٍ لَا تَشْبَعُ، ‏‏‏‏‏‏ثُمَّ يَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ هَؤُلَاءِ الْأَرْبَعِ ."
      },
      {
        "id": 40461,
        "hadith_number": "5473",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Menjauhi Perpecahan, Kemunafikan dan Akhlak Buruk",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah said: The Messenger of Allah [SAW] used to say in his supplication: 'Allahumma inni a'udhu bika minash-shiqaqi wan-nifaqi, wa suw'il-akhlaq (O Allah, I seek refuge with You from opposing the truth, hypocrisy and bad manners.)'",
        "malay_translation": "Abu Hurairah berkata: Rasulullah SAW selalu berdoa:  \"Allahumma inni a'udzu bika minash-shiqaqi wan-nifaqi wa suw'il-akhlaq (Ya Allah, aku berlindung kepada-Mu daripada perpecahan, kemunafikan dan buruk akhlak).\"",
        "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا بَقِيَّةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا ضُبَارَةُ، ‏‏‏‏‏‏عَنْ دُوَيْدِ بْنِ نَافِعٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ أَبُو صَالِحٍ:‏‏‏‏ قَالَ أَبُو هُرَيْرَةَ:‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الشِّقَاقِ، ‏‏‏‏‏‏وَالنِّفَاقِ، ‏‏‏‏‏‏وَسُوءِ الْأَخْلَاقِ ."
      },
      {
        "id": 40462,
        "hadith_number": "5474",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Rasulullah SAW Sentiasa Bertawakal Dari Hutang dan Dosa",
        "perawi_melayu": "Aisyah r.a.",
        "english_text": "It was narrated that 'Aishah said: The Messenger of Allah [SAW] often used to seek refuge (with Allah) from debt and sin. It was said to him: 'O Messenger of Allah! You often seek refuge from debt and sin?' He said: 'If a man gets into debt, he speaks and lies, and he makes a promise and breaks it.'",
        "malay_translation": "Daripada Aisyah r.a., beliau berkata: Rasulullah SAW sering beristighfar (memohon perlindungan kepada Allah) daripada hutang dan dosa. Lalu baginda ditanya: \"Wahai Rasulullah, mengapa baginda sering beristighfar daripada hutang dan dosa?\" Baginda menjawab: \"Sesungguhnya seseorang itu apabila berhutang, dia akan berkata-kata dan berdusta, serta berjanji dan mengingkari janjinya.\"",
        "arabic_text": "أَخْبَرَنَا إِسْحَاق بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا بَقِيَّةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي أَبُو سَلَمَةَ سُلَيْمَانُ بْنُ سُلَيْمٍ الْحِمْصِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي الزُّهْرِيُّ، ‏‏‏‏‏‏عَنْ عُرْوَةَ هُوَ ابْنُ الزُّبَيْرِ،‏‏‏‏ عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكْثِرُ التَّعَوُّذَ مِنَ الْمَغْرَمِ وَالْمَأْثَمِ، ‏‏‏‏‏‏فَقِيلَ لَهُ:‏‏‏‏ يَا رَسُولَ اللَّهِ إِنَّكَ تُكْثِرُ التَّعَوُّذَ مِنَ الْمَغْرَمِ وَالْمَأْثَمِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنَّ الرَّجُلَ إِذَا غَرِمَ حَدَّثَ فَكَذَبَ،‏‏‏‏ وَوَعَدَ فَأَخْلَفَ ."
      },
      {
        "id": 40463,
        "hadith_number": "5475",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Mencegah Diri daripada Kefir dan Hutang",
        "perawi_melayu": "Abu Sa'eed",
        "english_text": "Abu Sa'eed said: I heard the Messenger of Allah [SAW] say: 'A'udhu billahi minal-kufri wad-dain. (I seek refuge with Allah from Kufr and debt.)' A man said: 'O Messenger of Allah, are you equating debt with Kufr?' The Messenger of Allah [SAW] said: 'Yes.'",
        "malay_translation": "Abu Sa'eed berkata: Saya mendengar Rasulullah SAW bersabda:  \"أَعُوذُ بِاللهِ مِنَ الْكُفْرِ وَالدَّيْنِ (A'udhu billahi minal-kufri wad-dain). (Aku berlindung kepada Allah daripada kufur dan hutang.)\"  Seorang lelaki bertanya: \"Wahai Rasulullah, adakah tuan menyamakan hutang dengan kufur?\" Rasulullah SAW menjawab: \"Ya.\"",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبِي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حَيْوَةُ،‏‏‏‏ وَذَكَرَ آخَرَ، قَالَ:‏‏‏‏ حَدَّثَنَا سَالِمُ بْنُ غَيْلَانَ التُّجِيبِيُّ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ دَرَّاجًا أَبَا السَّمْحِ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ أَبَا الْهَيْثَمِ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ أَبَا سَعِيدٍ،‏‏‏‏ يَقُولُ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ أَعُوذُ بِاللَّهِ مِنَ الْكُفْرِ وَالدَّيْنِ ، ‏‏‏‏‏‏قَالَ رَجُلٌ:‏‏‏‏ يَا رَسُولَ اللَّهِ أَتَعْدِلُ الدَّيْنَ بِالْكُفْرِ ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ نَعَمْ ."
      },
      {
        "id": 40464,
        "hadith_number": "5476",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Menguji Naungan Allah daripada Kefir dan Hutang",
        "perawi_melayu": "Abu Sa'eed",
        "english_text": "It was narrated from Abu Sa'eed that: The Prophet [SAW] said: A'udhu billahi minal-kufri wad-dain. (I seek refuge with Allah from Kufr and debt.) A man said: Are you equating debt with Kufr? He said: Yes.",
        "malay_translation": "Daripada Abu Sa'eed, diriwayatkan bahawa Nabi SAW bersabda:  أَعُوذُ بِاللَّهِ مِنَ الْكُفْرِ وَالدَّيْنِ (Aku berlindung kepada Allah daripada kekufuran dan hutang).  Seorang lelaki bertanya:  Adakah tuan menyamakan hutang dengan kekufuran? Baginda menjawab: Ya.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حَيْوَةُ، ‏‏‏‏‏‏عَنْ دَرَّاجٍ أَبِي السَّمْحِ، ‏‏‏‏‏‏عَنْ أَبِي الْهَيْثَمِ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ قَالَ:‏‏‏‏ أَعُوذُ بِاللَّهِ مِنَ الْكُفْرِ وَالدَّيْنِ ،‏‏‏‏ فَقَالَ رَجُلٌ:‏‏‏‏ تَعْدِلُ الدَّيْنَ بِالْكُفْرِ ؟ قَالَ:‏‏‏‏ نَعَمْ ."
      },
      {
        "id": 40465,
        "hadith_number": "5477",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa perlindungan daripada hutang, musuh dan kegembiraan musuh",
        "perawi_melayu": "Abdullah bin Amr bin Al-'As",
        "english_text": "It was narrated from 'Abdullah bin 'Amr bin Al-'As that: The Messenger of Allah [SAW] used to say these words in his supplication: Allahumma inni a'udhu bika min ghalabatid-dain, wa ghalabatil-'aduwwi, wa shamatatil-a'da'. (O Allah, I seek refuge with You from being overwhelmed with debt, from being overpowered by the enemy and from the enemy rejoicing over my misfortunes.)'",
        "malay_translation": "Daripada Abdullah bin Amr bin Al-'As, bahawa Rasulullah SAW berdoa dengan kata-kata ini:  Allahumma inni a'udhu bika min ghalabatid-dain, wa ghalabatil-'aduwwi, wa shamatatil-a'da'. (Ya Allah, aku berlindung kepadaMu daripada dibebani hutang, daripada dikalahkan oleh musuh dan daripada musuh-musuh bergembira atas kesusahanku.)",
        "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي حُيَيُّ بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي أَبُو عَبْدِ الرَّحْمَنِ الْحُبُلِيُّ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ:‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو بِهَؤُلَاءِ الْكَلِمَاتِ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، ‏‏‏‏‏‏وَغَلَبَةِ الْعَدُوِّ، ‏‏‏‏‏‏وَشَمَاتَةِ الْأَعْدَاءِ ."
      },
      {
        "id": 40466,
        "hadith_number": "5478",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Rasulullah SAW daripada pelbagai perkara yang membimbangkan",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "It was narrated that Anas bin Malik said: The Prophet [SAW] used to say: 'Allahumma inni a'udhu bika minal-hammi wal hazani, wal-kasali, wal-bukhli, wal-jubni, wa dala'id-dain, wa ghalabatir-rijal (O Allah, I seek refuge with You from worry, grief, laziness, miserliness, cowardice, difficult debt and being overpowered by men.)'",
        "malay_translation": "Anas bin Malik meriwayatkan bahawa Nabi SAW selalu berdoa: \"Allahumma inni a'udzu bika minal-hammi wal-hazani, wal-kasali, wal-bukhli, wal-jubni, wa dala'id-dain, wa ghalabatir-rijal (Ya Allah, aku berlindung kepada-Mu daripada kegusaran dan kesedihan, daripada kemalasan dan kedekut, daripada sifat pengecut dan beban hutang yang berat, dan daripada ditindas oleh manusia).\"",
        "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا الْقَاسِمُ وَهُوَ ابْنُ يَزِيدَ الْجَرْمِيُّ، ‏‏‏‏‏‏عَنْ عَبْدِ الْعَزِيزِ، ‏‏‏‏‏‏أَخْبَرَنِي عَمْرُو بْنُ أَبِي عَمْرٍو، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، ‏‏‏‏‏‏وَالْكَسَلِ وَالْبُخْلِ، ‏‏‏‏‏‏وَالْجُبْنِ وَضَلَعِ الدَّيْنِ، ‏‏‏‏‏‏وَغَلَبَةِ الرِّجَالِ ."
      },
      {
        "id": 40467,
        "hadith_number": "5479",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa perlindungan daripada azab kubur dan fitnah",
        "perawi_melayu": "Aisyah R.Anha",
        "english_text": "It was narrated that 'Aishah said: The Messenger of Allah [SAW] used to say: 'Allahumma inni a'udhu bika min 'adhabil-qabri, wa fitnatin-nar, wa fitnatil-qabr, wa 'adhabil-qabr, wa sharri fitnati masihid-dajjali wa sharri fitnatil-ghana', wa sharri fitnatil-faqri. Allahummaghsil khatayaya kama naqqaitath-thawbal-abyada minad-danas. Allahumma inni a'udhu bika minal-kasali walharami wal-maghrami wal-ma'tham (O Allah, I seek refuge with You from the torment of the grave, the tribulation of the Fire, the tribulation of the grave and the torment of the grave, the evil of the tribulation of Masihid-Dajjal, the evil of the tribulation of richness and the evil of the tribulation of poverty. O Allah, wash away my sins with water of snow and hail, and cleanse my heart of sin as a white garment is cleansed of filth. O Allah, I seek refuge with You from laziness, old age, debt and sin.)'",
        "malay_translation": "Daripada Aisyah R.Anha, bahawa Rasulullah SAW selalu berdoa: \"Ya Allah, aku berlindung kepadaMu daripada azab kubur, fitnah api neraka, fitnah kubur, dan azab kubur, serta kejahatan fitnah Dajjal, kejahatan fitnah kekayaan, dan kejahatan fitnah kefakiran. Ya Allah, cucilah dosa-dosaku dengan air salji dan hujan batu, dan sucikanlah hatiku daripada dosa sebagaimana Engkau menyucikan pakaian putih daripada kekotoran. Ya Allah, aku berlindung kepadaMu daripada kemalasan, usia tua, hutang dan dosa.\"",
        "arabic_text": "أَخْبَرَنَا إِسْحَاق بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا جَرِيرٌ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، ‏‏‏‏‏‏وَفِتْنَةِ النَّارِ، ‏‏‏‏‏‏وَفِتْنَةِ الْقَبْرِ، ‏‏‏‏‏‏وَعَذَابِ الْقَبْرِ، ‏‏‏‏‏‏وَشَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، ‏‏‏‏‏‏وَشَرِّ فِتْنَةِ الْغِنَى، ‏‏‏‏‏‏وَشَرِّ فِتْنَةِ الْفَقْرِ، ‏‏‏‏‏‏اللَّهُمَّ اغْسِلْ خَطَايَايَ بِمَاءِ الثَّلْجِ وَالْبَرَدِ، ‏‏‏‏‏‏وَنَقِّ قَلْبِي مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الْأَبْيَضَ مِنَ الدَّنَسِ، ‏‏‏‏‏‏اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْهَرَمِ، ‏‏‏‏‏‏وَالْمَغْرَمِ وَالْمَأْثَمِ ."
      },
      {
        "id": 40468,
        "hadith_number": "5480",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa Mencari Perlindungan daripada Kedekutan, Ketakutan, Tua dan Fitnah Dunia",
        "perawi_melayu": "Mus'ab bin Sa'd berkata bahawa Sa'd telah mengajarnya kata-kata ini, meriwayatkan daripada Nabi SAW:",
        "english_text": "Mus'ab bin Sa'd said that : Sa'd used to teach him these words, narrating from the Prophet [SAW]: Allahumma inni a'udhu bika minal-bukhli, wa a'udhu bika minal-jubni, wa a'udhu bika an uradda ila ardhalil-'umuri, wa a'udhu bika min fitnatid-dunya wa 'adhabil-qabr (O Allah, I seek refuge with You from miserliness, and I seek refuge with You from cowardice, and I seek refuge with You from reaching the age of senility, and I seek refuge in You from the trials of this world and the torment of the grave.)",
        "malay_translation": "Mus'ab bin Sa'd berkata bahawa Sa'd telah mengajarnya kata-kata ini, meriwayatkan daripada Nabi SAW:  Allahumma inni a'udhu bika minal-bukhli, wa a'udhu bika minal-jubni, wa a'udhu bika an uradda ila ardhalil-'umuri, wa a'udhu bika min fitnatid-dunya wa 'adhabil-qabr. (Ya Allah, aku berlindung kepada-Mu daripada kedekutan, dan aku berlindung kepada-Mu daripada sifat pengecut, dan aku berlindung kepada-Mu daripada sampai ke usia tua yang lemah, dan aku berlindung kepada-Mu daripada fitnah dunia dan azab kubur.)",
        "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو دَاوُدَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ مُصْعَبَ بْنَ سَعْدٍ قَالَ:‏‏‏‏ كَانَ سَعْدٌ يُعَلِّمُهُ هَؤُلَاءِ الْكَلِمَاتِ، ‏‏‏‏‏‏وَيَرْوِيهِنَّ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبُخْلِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنَ الْجُبْنِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنْ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا وَعَذَابِ الْقَبْرِ ."
      },
      {
        "id": 40469,
        "hadith_number": "5481",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa Sa'd untuk perlindungan daripada kejahatan",
        "perawi_melayu": "Mus'ab bin Sa'd dan 'Amr bin Maimun Al-Awdi",
        "english_text": "It was narrated that Mus'ab bin Sa'd and 'Amr bin Maimun Al-Awdi said: Sa'd used to teach his children these words as a teacher teaches his students, and he would say that the Messenger of Allah [SAW] used to seek refuge (with Allah) with these words at the end of every prayer: 'Allahumma inni a'udhu bika minal-bukhli, wa a'udhu bika minal-jubni, wa a'udhu bika an uradda ila ardhalil-'umuri, wa a'udhu bika min fitnatid-dunya, wa min 'adhabil-qabr (O Allah, I seek refuge with You from miserliness, and I seek refuge with You from cowardice, and I seek refuge with You from reaching the age of senility, and I seek refuge with You from the trials of this life and the torment of the grave.)'",
        "malay_translation": "Daripada Mus'ab bin Sa'd dan 'Amr bin Maimun Al-Awdi, mereka berkata: Sa'd mengajar anak-anaknya kata-kata ini seperti seorang guru mengajar murid-muridnya, dan beliau berkata bahawa Rasulullah SAW biasa memohon perlindungan (kepada Allah) dengan kata-kata ini pada akhir setiap solat: \"Allahumma inni a'udzu bika minal-bukhli, wa a'udzu bika minal-jubni, wa a'udzu bika an uradda ila ardhalil-'umuri, wa a'udzu bika min fitnatid-dunya, wa min 'adhabil-qabr (Ya Allah, aku memohon perlindungan kepada-Mu daripada kedekut, dan aku memohon perlindungan kepada-Mu daripada sifat pengecut, dan aku memohon perlindungan kepada-Mu daripada sampai ke usia tua yang lemah, dan aku memohon perlindungan kepada-Mu daripada fitnah dunia, dan daripada azab kubur).\"",
        "arabic_text": "أَخْبَرَنِي هِلَالُ بْنُ الْعَلَاءِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبِي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عُبَيْدُ اللَّهِ، ‏‏‏‏‏‏عَنْ إِسْرَائِيلَ، ‏‏‏‏‏‏عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، ‏‏‏‏‏‏عَنْ مُصْعَبِ بْنِ سَعْدٍ،‏‏‏‏ وَعَمْرِو بْنِ مَيْمُونٍ الْأَوْدِيِّ،‏‏‏‏ قَالَا:‏‏‏‏ كَانَ سَعْدٌ يُعَلِّمُ بَنِيهِ هَؤُلَاءِ الْكَلِمَاتِ، ‏‏‏‏‏‏كَمَا يُعَلِّمُ الْمُكْتِبُ الْغِلْمَانَ،‏‏‏‏ وَيَقُولُ:‏‏‏‏ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَعَوَّذُ بِهِنَّ فِي دُبُرِ كُلِّ صَلَاةٍ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبُخْلِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنَ الْجُبْنِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنْ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا،‏‏‏‏ وَعَذَابِ الْقَبْرِ ."
      },
      {
        "id": 40470,
        "hadith_number": "5482",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa Rasulullah SAW daripada Sifat-Sifat Keji",
        "perawi_melayu": "Umar رضي الله عنه",
        "english_text": "It was narrated from 'Umar that: The Prophet [SAW] used to seek refuge with Allah from cowardice, miserliness, reaching the age of second childhood, the trials of the heart and the torment of the grave.",
        "malay_translation": "Daripada Umar رضي الله عنه diriwayatkan bahawa: Nabi SAW selalu memohon perlindungan kepada Allah daripada sifat pengecut, kedekut,  menjadi pikun di usia tua, ujian pada hati dan azab kubur.",
        "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ فَضَالَةَ، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا إِسْرَائِيلُ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ مَيْمُونٍ، ‏‏‏‏‏‏عَنْ عُمَرَ:‏‏‏‏ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ:‏‏‏‏ يَتَعَوَّذُ مِنَ:‏‏‏‏ الْجُبْنِ وَالْبُخْلِ، ‏‏‏‏‏‏وَسُوءِ الْعُمُرِ، ‏‏‏‏‏‏وَفِتْنَةِ الصَّدْرِ، ‏‏‏‏‏‏وَعَذَابِ الْقَبْرِ ."
      },
      {
        "id": 40471,
        "hadith_number": "5483",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa Rasulullah SAW daripada Lima Perkara",
        "perawi_melayu": "Urwah bin Maimun",
        "english_text": "It was narrated that 'Urwah bin Maimun said: I heard 'Umar bin Al-Khattab say: 'The Messenger of Allah [SAW] used to seek refuge with Allah from five things and say: Allahumma inni a'udhu bika minal-jubni, wal-bukhli, wa suw'il-'umuri, wa fitnatis-sadri wa 'adhabil-qabr (O Allah, I seek refuge with You from cowardice, miserliness, reaching the age of second childhood, the trials of the heart and the torment of the grave.)'",
        "malay_translation": "Daripada riwayat Urwah bin Maimun: Aku mendengar Umar bin Al-Khattab berkata: 'Rasulullah SAW selalu memohon perlindungan kepada Allah daripada lima perkara dan berdoa:  Allahumma inni a'udhu bika minal-jubni, wal-bukhli, wa suw'il-'umuri, wa fitnatis-sadri wa 'adhabil-qabr (Ya Allah, aku berlindung kepada-Mu daripada sifat pengecut, kedekut,  menjadi pikun di usia tua,  ujian hati dan azab kubur.)'",
        "arabic_text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ سَلْمٍ الْبَلْخِيُّ هُوَ أَبُو دَاوُدَ الْمُصَاحِفِيّ،‏‏‏‏ قَالَ:‏‏‏‏ أَنْبَأَنَا النَّضْرُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا يُونُسُ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ مَيْمُونٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَعَوَّذُ مِنْ خَمْسٍ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْجُبْنِ، ‏‏‏‏‏‏وَالْبُخْلِ، ‏‏‏‏‏‏وَسُوءِ الْعُمُرِ، ‏‏‏‏‏‏وَفِتْنَةِ الصَّدْرِ، ‏‏‏‏‏‏وَعَذَابِ الْقَبْرِ ."
      },
      {
        "id": 40472,
        "hadith_number": "5484",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Rasulullah SAW Bertawakkal Kepada Allah daripada Sifat Kedekut, Penakut, Fitnah Hati dan Azab Kubur",
        "perawi_melayu": "Amr bin Maimun",
        "english_text": "It was narrated that 'Amr bin Maimun said: The Companions of Muhammad [SAW] told me that the Messenger of Allah [SAW] used to seek refuge with Allah from stinginess, cowardice, the trials of the heart and the torment of the grave.",
        "malay_translation": "Daripada Amr bin Maimun, katanya: Sahabat-sahabat Nabi Muhammad SAW memberitahu saya bahawa Rasulullah SAW sentiasa memohon perlindungan kepada Allah daripada sifat kedekut, sifat penakut, fitnah hati dan azab kubur.",
        "arabic_text": "أَخْبَرَنِي هِلَالُ بْنُ الْعَلَاءِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حُسَيْنٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا زُهَيْرٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو إِسْحَاق، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ مَيْمُونٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي أَصْحَابُ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَعَوَّذُ مِنَ الشُّحِّ وَالْجُبْنِ، ‏‏‏‏‏‏وَفِتْنَةِ الصَّدْرِ، ‏‏‏‏‏‏وَعَذَابِ الْقَبْرِ ."
      },
      {
        "id": 40473,
        "hadith_number": "5485",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Nabi SAW Bertawasul",
        "perawi_melayu": "Amr bin Maimun",
        "english_text": "It was narrated that 'Amr bin Maimun said: The Prophet [SAW] used to seek refuge. Mursal.",
        "malay_translation": "Daripada Amr bin Maimun, beliau berkata: Nabi SAW selalu bertawasul. (Mursal).",
        "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو دَاوُدَ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ مَيْمُونٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَعَوَّذُ . مُرْسَلٌ."
      },
      {
        "id": 40474,
        "hadith_number": "5486",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Perlindungan daripada Kejahatan",
        "perawi_melayu": "Shu'tair bin Syakal bin Humaid",
        "english_text": "It was narrated from Shutair bin Shakal bin Humaid, that his father said: I said: 'O Messenger of Allah, teach me a supplication from which I may benefit.' He said: 'Say: Allahumma 'afini min sharri sam'i, wa basari, wa lisani, wa qalbi, wa sharri mani (O Allah, protect me from the evil of my hearing, my seeing, my tongue and my heart, and the evil of my sperm.) - Meaning his sexual organ.",
        "malay_translation": "Daripada Shu'tair bin Syakal bin Humaid, diriwayatkan bahawa bapanya berkata: Aku berkata, \"Wahai Rasulullah, ajarkanlah kepadaku satu doa yang dapat memberikanku manfaat.\" Baginda SAW bersabda: \"Bacalah: Allahumma 'afini min sharri sam'i, wa basari, wa lisani, wa qalbi, wa sharri maniyyi (Ya Allah, peliharalah aku daripada kejahatan pendengaran, penglihatanku, lidahku, dan hatiku, serta kejahatan mani ku.) - Maksudnya: alat sulitnya.",
        "arabic_text": "أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ وَكِيعٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبِي، ‏‏‏‏‏‏عَنْ سَعْدِ بْنِ أَبِي أَوْسٍ، ‏‏‏‏‏‏عَنْ بِلَالِ بْنِ يَحْيَى، ‏‏‏‏‏‏عَنْ شُتَيْرِ بْنِ شَكَلِ بْنِ حُمَيْدٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏ عَلِّمْنِي دُعَاءً أَنْتَفِعُ بِهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلِ:‏‏‏‏ اللَّهُمَّ عَافِنِي مِنْ شَرِّ سَمْعِي، ‏‏‏‏‏‏وَبَصَرِي، ‏‏‏‏‏‏وَلِسَانِي، ‏‏‏‏‏‏وَقَلْبِي، ‏‏‏‏‏‏وَشَرِّ مَنِيِّي ، ‏‏‏‏‏‏يَعْنِي ذَكَرَهُ."
      },
      {
        "id": 40475,
        "hadith_number": "5487",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Mencegah Diri Dari Kekufuran dan Kemiskinan",
        "perawi_melayu": "Abu Sa'eed Al-Khudri",
        "english_text": "It was narrated from Abu Sa'eed Al-Khudri that: The Messenger of Allah [SAW] used to say: A'udhu billahi minal-kufri wal-faqr. (O Allah, I seek refuge with You from Kufr and poverty.) A man said: Are they equal? He said: Yes.",
        "malay_translation": "Dari Abu Sa'eed Al-Khudri, diriwayatkan bahawa Rasulullah SAW  selalu berdoa:  \"A'udhu billahi minal-kufri wal-faqr.\" (Ya Allah, aku berlindung kepada-Mu daripada kekufuran dan kemiskinan.) Seorang lelaki bertanya: \"Adakah kedua-duanya sama berat?\" Baginda menjawab: \"Ya.\" ",
        "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي سَالِمُ بْنُ غَيْلَانَ، ‏‏‏‏‏‏عَنْ دَرَّاجٍ أَبِي السَّمْحِ، ‏‏‏‏‏‏عَنْ أَبِي الْهَيْثَمِ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، ‏‏‏‏‏‏عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ ، ‏‏‏‏‏‏فَقَالَ رَجُلٌ:‏‏‏‏ وَيَعْدِلَانِ ؟ قَالَ:‏‏‏‏ نَعَمْ ."
      },
      {
        "id": 40476,
        "hadith_number": "5488",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Nabi SAW ketika keluar rumah",
        "perawi_melayu": "Umm Salamah",
        "english_text": "It was narrated from Umm Salamah that : When the Prophet [SAW] went out of his house, he said: Bismillahi Rabbi! A'udhu bika min an azilla aw adilla aw azlima aw uzlama, aw ajhala aw yujhala 'alayya (In the name of Allah, my Lord, I seek refuge in You from falling into error or going astray, or wrongdoing (others) or being wronged, and from behaving or being treated in an ignorant manner.)",
        "malay_translation": "Daripada Umm Salamah, diriwayatkan bahawa: apabila Nabi SAW keluar dari rumahnya, baginda bersabda:  \"Bismillahi Rabbi! A'udzu bika min an azilla aw adilla aw azlima aw uzlama, aw ajhala aw yujhala 'alayya.\" (Dengan nama Allah, Tuhanku, aku berlindung kepada-Mu daripada tergelincir atau tersesat, atau melakukan kezaliman atau dianiaya, atau bertindak jahil atau diperlakukan dengan kejahilan.)",
        "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ قُدَامَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا جَرِيرٌ، ‏‏‏‏‏‏عَنْ مَنْصُورٍ، ‏‏‏‏‏‏عَنِ الشَّعْبِيِّ، ‏‏‏‏‏‏عَنْ أُمِّ سَلَمَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا خَرَجَ مِنْ بَيْتِهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ بِسْمِ اللَّهِ رَبِّ،‏‏‏‏ أَعُوذُ بِكَ مِنْ أَنْ أَزِلَّ أَوْ أَضِلَّ، ‏‏‏‏‏‏أَوْ أَظْلِمَ أَوْ أُظْلَمَ، ‏‏‏‏‏‏أَوْ أَجْهَلَ أَوْ يُجْهَلَ عَلَيَّ ."
      },
      {
        "id": 40477,
        "hadith_number": "5489",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Mencari Perlindungan daripada Hutang, Musuh dan Kesedihan",
        "perawi_melayu": "Abdullah bin Amr bin Al-'As",
        "english_text": "It was narrated from 'Abdullah bin 'Amr bin Al-'As that: The Messenger of Allah [SAW] used to say supplication in these words: Allahumma inni a'udhu bika min ghalabatid-dain, wa ghalabatil-'aduwwi, wa shamatatil-a'da'. (O Allah, I seek refuge with You from being overwhelmed by debt and from being overpowered by the enemy, and from the enemy rejoicing at my misfortune.)",
        "malay_translation": "Daripada Abdullah bin Amr bin Al-'As, bahawa Rasulullah SAW berdoa dengan kata-kata ini:  Allahumma inni a'udzu bika min ghalabatid-dain, wa ghalabatil-'aduwwi, wa shamatatil-a'da'. (Ya Allah, aku berlindung kepada-Mu daripada dibebani hutang, daripada dikalahkan musuh, dan daripada musuh-musuh bergembira dengan kesusahan aku.)",
        "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي ابْنُ وَهْبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي حُيَيُّ بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي أَبُو عَبْدِ الرَّحْمَنِ الْحُبُلِيُّ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو بِهَؤُلَاءِ الْكَلِمَاتِ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، ‏‏‏‏‏‏وَغَلَبَةِ الْعَدُوِّ، ‏‏‏‏‏‏وَشَمَاتَةِ الْأَعْدَاءِ ."
      },
      {
        "id": 40478,
        "hadith_number": "5490",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa perlindungan daripada hutang, musuh dan kecaman musuh",
        "perawi_melayu": "Abdullah bin Amr",
        "english_text": "It was narrated from 'Abdullah bin 'Amr that : The Messenger of Allah [SAW] used to say supplication in these words: Allahumma inni a'udhu bika min ghalabatid-dain, wa ghalabatil-'aduwwi, wa shamatatil-a'da' (O Allah, I seek refuge with You from being overwhelmed by debt and from being overpowered by the enemy, and from the enemy rejoicing at my misfortune.)",
        "malay_translation": "Daripada Abdullah bin Amr, bahawa Rasulullah SAW berdoa dengan kata-kata ini:  Allahumma inni a’udzu bika min ghalabatid-dain, wa ghalabatil-'aduwwi, wa shamatatil-a’da’ (Ya Allah, aku berlindung kepada-Mu daripada ditimpa hutang yang banyak, daripada ditundukkan oleh musuh, dan daripada musuh-musuh bergembira dengan kesusahanku).",
        "arabic_text": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ حُيَيٌّ، ‏‏‏‏‏‏حَدَّثَنِي أَبُو عَبْدِ الرَّحْمَنِ الْحُبُلِيُّ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو بِهَؤُلَاءِ الْكَلِمَاتِ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، ‏‏‏‏‏‏وَشَمَاتَةِ الْأَعْدَاءِ ."
      },
      {
        "id": 40479,
        "hadith_number": "5491",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa Mencari Perlindungan daripada Kemalasan, Kelemahan dan Fitnah",
        "perawi_melayu": "Uthman bin Abi Al-'As",
        "english_text": "It was narrated from 'Uthman bin Abi Al-'As that: The Prophet [SAW] used to say supplication in these words: Allahumma inni a'udhu bika minal-kasali, walharami, wal-jubni, wal-'ajzi, wa min fitnatil-mahya wal-mamat. (O Allah, I seek refuge in You from laziness, old age, cowardice, and incapacity, and from the trials of life and death.)",
        "malay_translation": "Daripada Uthman bin Abi Al-'As, diriwayatkan bahawa Nabi SAW berdoa dengan doa ini:  Allahumma inni a'udzu bika minal-kasali, wal-harami, wal-jubni, wal-'ajzi, wa min fitnatil-mahya wal-mamat. (Ya Allah, aku berlindung kepada-Mu daripada kemalasan, ketuaan, kepengecutan, kelemahan dan daripada ujian hidup dan mati.)",
        "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ، ‏‏‏‏‏‏عَنْ هَارُونَ بْنِ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ مُحَمَّدٍ، ‏‏‏‏‏‏عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ:‏‏‏‏ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو بِهَذِهِ الدَّعَوَاتِ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْهَرَمِ، ‏‏‏‏‏‏وَالْجُبْنِ وَالْعَجْزِ، ‏‏‏‏‏‏وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ ."
      },
      {
        "id": 40480,
        "hadith_number": "5492",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Menguji perlindungan daripada Allah daripada pelbagai kejahatan",
        "perawi_melayu": "Daripada Amr bin Shu'aib, daripada bapanya, daripada datuknya",
        "english_text": "It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said: I heard the Messenger of Allah [SAW] say: 'Allahumma inni a'udhu bika minal-kasali, walharami, wal-maghrami, wal-ma'thami, wa a'udhu bika min sharril-masihid-dajjali, wa a'udhu bika min 'adhabil-qabri, wa a'udhu bika min 'adhabin-nar (O Allah, I seek refuge in You from laziness, old age, debt and sin, and I seek refuge in You from the evil of the Al-Masihid-Dajjal, and I seek refuge in You from the torment of the grave, and I seek refuge in You from the punishment of the Fire.)'",
        "malay_translation": "Daripada Amr bin Shu'aib, daripada bapanya, daripada datuknya, bahawa beliau berkata: Aku mendengar Rasulullah SAW bersabda:  'Allahumma inni a'udzu bika minal-kasali, wal-harami, wal-maghrami, wal-ma'thami, wa a'udzu bika min sharril-masihid-dajjali, wa a'udzu bika min 'adhabil-qabri, wa a'udzu bika min 'adhabin-nar (Ya Allah, aku berlindung kepada-Mu daripada kemalasan, usia tua, hutang dan dosa, dan aku berlindung kepada-Mu daripada kejahatan Al-Masih ad-Dajjal, dan aku berlindung kepada-Mu daripada azab kubur, dan aku berlindung kepada-Mu daripada azab neraka.)'",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ، ‏‏‏‏‏‏عَنْ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ اللَّيْثِ، ‏‏‏‏‏‏عَنْ يَزِيدَ بْنِ الْهَادِ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ، ‏‏‏‏‏‏وَالْهَرَمِ، ‏‏‏‏‏‏وَالْمَغْرَمِ، ‏‏‏‏‏‏وَالْمَأْثَمِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنْ شَرِّ الْمَسِيحِ الدَّجَّالِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَأَعُوذُ بِكَ مِنْ عَذَابِ النَّارِ ."
      },
      {
        "id": 40481,
        "hadith_number": "5493",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Nabi SAW daripada Tiga Bencana",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "It was narrated that Abu Hurairah said: The Prophet [SAW] used to seek refuge from these three: From being overtaken by destruction, from his enemies rejoicing in his misfortune, from being destined to an evil end, and from the difficult moment of a calamity. Sufyan (one of the narrators) said: There were three, and I mentioned four because I do not remember which one was not one of them.",
        "malay_translation": "Daripada Abu Hurairah r.a., bahawa Nabi SAW sentiasa memohon perlindungan daripada tiga perkara: daripada ditimpa kemusnahan, daripada musuh-musuh bergembira dengan kesusahannya, daripada ditimpa kesudahan yang buruk, dan daripada saat-saat getir bencana. Sufyan (seorang perawi) berkata: sebenarnya hanya tiga, tetapi saya menyebut empat kerana saya tidak ingat mana satu yang bukan termasuk di antara tiga itu.",
        "arabic_text": "أَخْبَرَنَا إِسْحَاق بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ سُمَيٍّ، ‏‏‏‏‏‏عَنْ أَبِي صَالِحٍ إِنْ شَاءَ اللَّهُ،‏‏‏‏ عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَعَوَّذُ مِنْ هَذِهِ الثَّلَاثَةِ:‏‏‏‏ مِنْ دَرَكِ الشَّقَاءِ، ‏‏‏‏‏‏وَشَمَاتَةِ الْأَعْدَاءِ، ‏‏‏‏‏‏وَسُوءِ الْقَضَاءِ، ‏‏‏‏‏‏وَجَهْدِ الْبَلَاءِ ، ‏‏‏‏‏‏قَالَ سُفْيَانُ:‏‏‏‏ هُوَ ثَلَاثَةٌ فَذَكَرْتُ أَرْبَعَةً لِأَنِّي لَا أَحْفَظُ الْوَاحِدَ الَّذِي لَيْسَ فِيهِ."
      },
      {
        "id": 40482,
        "hadith_number": "5494",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Mencari Perlindungan daripada Qada' yang Buruk dan Bala",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "It was narrated from Abu Hurairah that : The Prophet [SAW] used to seek refuge from being destined to an evil end, from his enemies rejoicing in his misfortune, from being overtaken by destruction and from the difficult moment of a calamity.",
        "malay_translation": "Daripada Abu Hurairah r.a., bahawa Nabi SAW selalu memohon perlindungan daripada qada' yang buruk, daripada kegembiraan musuh-musuh disebabkan kemalangannya, daripada ditimpa kesusahan dan daripada saat-saat getir bala.",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ سُمَيٍّ، ‏‏‏‏‏‏عَنْ أَبِي صَالِحٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ:‏‏‏‏ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَسْتَعِيذُ مِنْ سُوءِ الْقَضَاءِ، ‏‏‏‏‏‏وَشَمَاتَةِ الْأَعْدَاءِ، ‏‏‏‏‏‏وَدَرَكِ الشَّقَاءِ، ‏‏‏‏‏‏وَجَهْدِ الْبَلَاءِ ."
      },
      {
        "id": 40483,
        "hadith_number": "5495",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa Rasulullah SAW daripada penyakit",
        "perawi_melayu": "Anas bin Malik r.a.",
        "english_text": "It was narrated from Anas that: The Prophet [SAW] used to say: Allahumma inni a'udhu bika minal-jununi wal-jadhami, wal-barasi wa sayy'il-asqam (O Allah, I seek refuge in You from possession, leprosy, leukederma and bad sickness (that may lead to visible deformity).",
        "malay_translation": "Daripada Anas r.a., bahawa Nabi SAW berdoa:  \"Allahumma inni a'udhu bika minal-jununi wal-jadhami, wal-barasi wa sayyi'il-asqam.\" (Ya Allah, aku berlindung kepadaMu daripada kegilaan, penyakit kusta, penyakit kulit putih (vitiligo) dan penyakit-penyakit yang buruk (yang boleh menyebabkan kecacatan yang ketara).\"",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو دَاوُدَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا هَمَّامٌ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْجُنُونِ، ‏‏‏‏‏‏وَالْجُذَامِ، ‏‏‏‏‏‏وَالْبَرَصِ، ‏‏‏‏‏‏وَسَيِّئِ الْأَسْقَامِ ."
      },
      {
        "id": 40484,
        "hadith_number": "5496",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Rasulullah SAW Bertawakkal Kepada Allah Daripada Mata Jahat",
        "perawi_melayu": "Abu Sa'eed al-Khudri",
        "english_text": "It was narrated that Abu Sa'eed said: The Messenger of Allah [SAW] used to seek refuge from the evil eye of the Jinn and the evil eye of humans. When Al-Mu'awwadhatan were revealed, he started to recite them and stopped reciting anything else.",
        "malay_translation": "Daripada Abu Sa'eed, katanya: Rasulullah SAW sentiasa berlindung daripada mata jahat jin dan manusia.  Apabila surah al-Mu'awwidzatain diturunkan, baginda mula membacanya dan meninggalkan bacaan yang lain.",
        "arabic_text": "أَخْبَرَنَا هِلَالُ بْنُ الْعَلَاءِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبَّادٌ، ‏‏‏‏‏‏عَنْ الْجُرَيْرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي نَضْرَةَ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَتَعَوَّذُ مِنْ عَيْنِ الْجَانِّ، ‏‏‏‏‏‏وَعَيْنِ الْإِنْسِ، ‏‏‏‏‏‏فَلَمَّا نَزَلَتِ الْمُعَوِّذَتَانِ أَخَذَ بِهِمَا وَتَرَكَ مَا سِوَى ذَلِكَ ."
      },
      {
        "id": 40485,
        "hadith_number": "5497",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa Rasulullah SAW memohon perlindungan daripada kemalasan, usia tua, kepengecutan, kedekut dan azab kubur",
        "perawi_melayu": "Anas r.a.",
        "english_text": "It was narrated that Anas said: The Messenger of Allah [SAW] used to seek refuge by saying these words: 'Allahumma inni a'udhu bika minal-kasali, wal-harami, wal-jubni, wal-bukhli, wa suw'il-kibari, wa fitnatid-dajjali wa 'adhabil-qabr (O Allah, I seek refuge with You from laziness, old age, cowardice, miserliness, a bad old age, the tribulation of the Dajjal and the torment of the grave.)'",
        "malay_translation": "Anas r.a. meriwayatkan bahawa Rasulullah SAW sentiasa memohon perlindungan dengan membaca doa ini:  \"Allahumma inni a'udhu bika minal-kasali, wal-harami, wal-jubni, wal-bukhli, wa suw'il-kibari, wa fitnatid-dajjali wa 'adhabil-qabr.\" (Ya Allah, aku memohon perlindungan kepadaMu daripada kemalasan, kelemahan usia tua, kepengecutan, kedekut, buruknya usia tua, fitnah Dajjal dan azab kubur.)",
        "arabic_text": "أَخْبَرَنَا مُوسَى بْنُ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حُسَيْنٌ، ‏‏‏‏‏‏عَنْ زَائِدَةَ، ‏‏‏‏‏‏عَنْ حُمَيْدٍ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَعَوَّذُ بِهَؤُلَاءِ الْكَلِمَاتِ،‏‏‏‏ كَانَ يَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْهَرَمِ، ‏‏‏‏‏‏وَالْجُبْنِ وَالْبُخْلِ، ‏‏‏‏‏‏وَسُوءِ الْكِبَرِ وَفِتْنَةِ الدَّجَّالِ، ‏‏‏‏‏‏وَعَذَابِ الْقَبْرِ ."
      },
      {
        "id": 40486,
        "hadith_number": "5498",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Mencari Perlindungan daripada Kedekut, Ketakutan, Tua, dan Azab Kubur",
        "perawi_melayu": "Mus'ab bin Sa'd daripada bapanya",
        "english_text": "It was narrated that 'Abdul-Malik bin 'Umair said: I heard Mus'ab bin Sa'd say, concerning his father: 'He used to teach us five things that the Messenger of Allah [SAW] used to recite in his supplication, and say: Allahumma inni a'udhu bika minal-bukhli, wa a'udhu bika minal-jubni, wa a'udhu bika an uradda ila ardhalil-'umuri, wa a'udhu bika min 'adhabil-qabr (O Allah, I seek refuge in You from miserliness, and I seek refuge in You from cowardice, and I seek refuge in You from reaching the age of senility, and I seek refuge in You from the torment of the grave.)",
        "malay_translation": "Telah meriwayatkan Abdul-Malik bin Umair: Aku mendengar Mus'ab bin Sa'd berkata mengenai bapanya: \"Bapaku selalu mengajar kami lima perkara yang Rasulullah SAW selalu bacakan dalam doanya, iaitu: Allahumma inni a'udzu bika minal-bukhli, wa a'udzu bika minal-jubni, wa a'udzu bika an uradda ila ardhalil-'umuri, wa a'udzu bika min 'adhabil-qabr (Ya Allah, aku berlindung kepada-Mu daripada kedekut, dan aku berlindung kepada-Mu daripada sifat pengecut, dan aku berlindung kepada-Mu daripada sampai ke usia tua yang lemah, dan aku berlindung kepada-Mu daripada azab kubur).\"",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا خَالِدٌ، ‏‏‏‏‏‏عَنْ شُعْبَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ مُصْعَبَ بْنَ سَعْدٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ يُعَلِّمُنَا خَمْسًا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو بِهِنَّ، ‏‏‏‏‏‏وَيَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبُخْلِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنَ الْجُبْنِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنْ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ ."
      },
      {
        "id": 40487,
        "hadith_number": "5499",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Rasulullah SAW memohon perlindungan daripada lima perkara",
        "perawi_melayu": "Amr bin Maimun",
        "english_text": "It was narrated that 'Amr bin Maimun said: I went for Hajj with 'Umar, and in Muzdalifah, I heard him say that the Prophet [SAW] used to seek refuge from five things: 'Allahumma inni a'udhu bika minal-bukhli, wal-jubni, wa a'udhu bika min su'il-'umuri, wa a'udhu bika min fitnatis-sadri, wa a'udhu bika min 'adhabil-qabr (O Allah, I seek refuge with You from miserliness and cowardice, and I seek refuge with You from reaching the age of second childhood, and I seek refuge in You from the ills of the heart, and I seek refuge in You from the torment of the grave.'",
        "malay_translation": "Daripada Amr bin Maimun, beliau berkata: Saya menunaikan haji bersama Umar, dan di Muzdalifah, saya mendengar beliau berkata bahawa Nabi SAW sentiasa memohon perlindungan daripada lima perkara:  'Allahumma inni a'udhu bika minal-bukhli, wal-jubni, wa a'udhu bika min su'il-'umuri, wa a'udhu bika min fitnatis-sadri, wa a'udhu bika min 'adhabil-qabr (Ya Allah, aku memohon perlindungan kepadaMu daripada kedekut dan kepengecutan, dan aku memohon perlindungan kepadaMu daripada mencapai usia pikun, dan aku memohon perlindungan kepadaMu daripada kejahatan hati, dan aku memohon perlindungan kepadaMu daripada azab kubur).' ",
        "arabic_text": "أَخْبَرَنَا عِمْرَانُ بْنُ بَكَّارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَحْمَدُ بْنُ خَالِدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يُونُسُ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق يَعْنِي أَبَاهُ،‏‏‏‏ عَنْ عَمْرِو بْنِ مَيْمُونٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَجَجْتُ مَعَ عُمَرَ فَسَمِعْتُهُ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ بِجَمْعٍ أَلَا إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَعَوَّذُ مِنْ خَمْسٍ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبُخْلِ وَالْجُبْنِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنْ سُوءِ الْعُمُرِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الصَّدْرِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ ."
      },
      {
        "id": 40488,
        "hadith_number": "5500",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa ketika Mengembara",
        "perawi_melayu": "Abdullah bin Sarjis",
        "english_text": "It was narrated from 'Abdullah bin Sarjis that : When the Messenger of Allah [SAW] traveled, he would say: Allahumma inni a'udhu bika min wa'tha'is-safari, wa kabatil-munqalabi, wal-hawri ba'dal-kawri, wa da'watil-mazlumi, wa suw'il-munzari fil-ahli wal-mal (O Allah, I seek refuge with You from the hardships of travel and the sorrows of return, from loss after plenty, from the supplication of the one who has been wronged, and seeing some calamity befall my family or wealth.)",
        "malay_translation": "Daripada Abdullah bin Sarjis, bahawa Rasulullah SAW apabila melakukan perjalanan, baginda berdoa:  \"Allahumma inni a'udhu bika min wa'tha'is-safari, wa kabatil-munqalabi, wal-hawri ba'dal-kawri, wa da'watil-mazlumi, wa suw'il-munzari fil-ahli wal-mal.\" (Ya Allah, aku berlindung kepadaMu daripada kesusahan perjalanan dan kesedihan kepulangan, daripada kerugian selepas kemewahan, daripada doa orang yang dizalimi, dan daripada melihat bencana menimpa keluarga dan harta bendaku.)",
        "arabic_text": "أَخْبَرَنَا أَزْهَرُ بْنُ جَمِيلٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ عَاصِمٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ سَرْجِسَ،‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَافَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، ‏‏‏‏‏‏وَكَآبَةِ الْمُنْقَلَبِ، ‏‏‏‏‏‏وَالْحَوْرِ بَعْدَ الْكَوْرِ، ‏‏‏‏‏‏وَدَعْوَةِ الْمَظْلُومِ، ‏‏‏‏‏‏وَسُوءِ الْمَنْظَرِ فِي الْأَهْلِ وَالْمَالِ ."
      },
      {
        "id": 40489,
        "hadith_number": "5501",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa ketika Berpergian",
        "perawi_melayu": "Abdullah bin Sarjis",
        "english_text": "It was narrated from 'Abdullah bin Sarjis that : When the Messenger of Allah [SAW] traveled, he would say: Allahumma inni a'udhu bika min wa'tha'is-safari, wa kabatil-munqalabi, wal-hawri ba'dal-kawri, wa da'watil-mazlumi, wa su'il-munzari fil-ahli wal-mali wal-walad (O Allah, I seek refuge with You from the hardships of travel and the sorrows of return, from loss after plenty, from the supplication of the one who has been wronged, and seeing some calamity befall my family or wealth or child.)",
        "malay_translation": "Daripada Abdullah bin Sarjis, bahawa Rasulullah SAW, apabila baginda  berpergian, baginda berdoa:  \"Allahumma inni a'udhu bika min wa'tha'is-safari, wa kabatil-munqalabi, wal-hawri ba'dal-kawri, wa da'watil-mazlumi, wa su'il-munzari fil-ahli wal-mali wal-walad.\" (Ya Allah, aku berlindung kepadaMu daripada kesusahan perjalanan, dan kesedihan kepulangan, dan kerugian selepas kemewahan, dan doa orang yang dizalimi, dan melihat malapetaka menimpa keluarga, harta dan anakku.)",
        "arabic_text": "أَخْبَرَنَا إِسْحَاق بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا جَرِيرٌ، ‏‏‏‏‏‏عَنْ عَاصِمٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ سَرْجِسَ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَافَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، ‏‏‏‏‏‏وَكَآبَةِ الْمُنْقَلَبِ، ‏‏‏‏‏‏وَالْحَوْرِ بَعْدَ الْكَوْرِ، ‏‏‏‏‏‏وَدَعْوَةِ الْمَظْلُومِ، ‏‏‏‏‏‏وَسُوءِ الْمَنْظَرِ فِي الْأَهْلِ وَالْمَالِ وَالْوَلَدِ ."
      },
      {
        "id": 40490,
        "hadith_number": "5502",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa Nabi SAW Semasa Perjalanan",
        "perawi_melayu": "Abdullah bin Sarjis",
        "english_text": "It was narrated that 'Abdullah bin Sarjis said: When the Prophet [SAW] traveled, he would seek refuge with Allah from the hardships of travel, and the sorrows of return, from loss after plenty, from the supplication of the one who has been wronged, and from seeing some calamity befall.",
        "malay_translation": "Daripada Abdullah bin Sarjis, katanya:  Apabila Nabi SAW melakukan perjalanan, baginda akan memohon perlindungan kepada Allah daripada kesusahan perjalanan, dan kesedihan kepulangan, daripada kerugian selepas kemewahan, daripada doa orang yang teraniaya, dan daripada melihat sesuatu bencana yang menimpa.",
        "arabic_text": "أَخْبَرَنَا يُوسُفُ بْنُ حَمَّادٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا بِشْرُ بْنُ مَنْصُورٍ، ‏‏‏‏‏‏عَنْ عَاصِمٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ سَرْجِسَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَافَرَ يَتَعَوَّذُ مِنْ وَعْثَاءِ السَّفَرِ، ‏‏‏‏‏‏وَكَآبَةِ الْمُنْقَلَبِ، ‏‏‏‏‏‏وَالْحَوْرِ بَعْدَ الْكَوْرِ، ‏‏‏‏‏‏وَدَعْوَةِ الْمَظْلُومِ، ‏‏‏‏‏‏وَسُوءِ الْمَنْظَرِ ."
      },
      {
        "id": 40491,
        "hadith_number": "5503",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa ketika Mengembara",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "It was narrated that Abu Hurairah said: When the Messenger of Allah [SAW] traveled and rode his mount, he gestured with his finger - and Shu'bah (one of the narrators) stretched out his finger - and said: 'Allahumma, antas-sahibu fis-safari wal-khalifatu fil-ahli wal-mal. Allahumma, inni a'udhu bika min wa'tha'is-safari, wa kabatil-munqalabi (O Allah, You are our help when we are traveling and the One Who takes care of our families and wealth (in our absence). O Allah, I seek refuge in You from the hardships of travel and the sorrows of return.)'",
        "malay_translation": "Dari Abu Hurairah r.a., bahawa Rasulullah SAW apabila mengembara dan menunggang kenderaan baginda, baginda memberi isyarat dengan jari baginda – dan Syu’bah (salah seorang perawi) juga mengulur jari baginda – dan berdoa:  ‘Allahumma, antas-sahibu fis-safari wal-khalifatu fil-ahli wal-mal. Allahumma, inni a’udzu bika min wa’tha’is-safari, wa kabatil-munqalabi (Ya Allah, Engkaulah penolong kami ketika mengembara, dan Engkaulah yang menjaga keluarga dan harta kami (ketika ketiadaan kami). Ya Allah, aku berlindung kepada-Mu daripada kesusahan perjalanan dan kesedihan kepulangan.)’",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ عَلِيِّ بْنِ مُقَدَّمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، ‏‏‏‏‏‏عَنْ شُعْبَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ بِشْرٍ الْخَثْعَمِيِّ، ‏‏‏‏‏‏عَنْ أَبِي زُرْعَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَافَرَ فَرَكِبَ رَاحِلَتَهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ بِإِصْبَعِهِ،‏‏‏‏ وَمَدَّ شُعْبَةُ بِإِصْبَعِهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، ‏‏‏‏‏‏وَالْخَلِيفَةُ فِي الْأَهْلِ وَالْمَالِ، ‏‏‏‏‏‏اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، ‏‏‏‏‏‏وَكَآبَةِ الْمُنْقَلَبِ ."
      },
      {
        "id": 40492,
        "hadith_number": "5504",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Mencari perlindungan daripada jiran yang jahat",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "It was narrated that Abu Hurairah said: The Messenger of Allah [SAW] said: 'Seek refuge with Allah from a bad neighbor in one's permanent abode, for one's neighbor in the desert will change.'",
        "malay_translation": "Dari Abu Hurairah, bahawa Rasulullah SAW bersabda: \"Mohonlah perlindungan kepada Allah daripada jiran yang jahat di tempat tinggal tetap, kerana jiran di padang pasir akan berpindah.\" ",
        "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا مُحَمَّدُ بْنُ عَجْلَانَ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ تَعَوَّذُوا بِاللَّهِ مِنْ جَارِ السَّوْءِ فِي دَارِ الْمُقَامِ، ‏‏‏‏‏‏فَإِنَّ جَارَ الْبَادِيَةِ يَتَحَوَّلُ عَنْكَ ."
      },
      {
        "id": 40493,
        "hadith_number": "5505",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Anas bin Malik daripada Rasulullah SAW",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "Anas bin Malik said: The Messenger of Allah [SAW] said to Abu Talhah: 'Find me one of your boys to serve me.' Abu Talhah brought me out, riding behind him, and I served the Prophet [SAW] every time he stopped (on his journey). And I often heard him say: 'Allahumma, inni a'udhu bika min al-harami, wal-huzni, wal-'ajzi, wal-kasali, wal-bukhli, wal-jubni, wa dala'id-dain, wa ghalabatir-rijal (O Allah, I seek refuge in You from old age, grief, incapacity, laziness, miserliness, cowardice, the burden of debt and being overpowered by men.)'",
        "malay_translation": "Anas bin Malik berkata: Rasulullah SAW bersabda kepada Abu Talhah: \"Carikan untukku seorang daripada anak-anak lelakimu untuk melayaniku.\" Abu Talhah membawa aku keluar, aku menunggang di belakangnya, dan aku melayan Nabi SAW setiap kali baginda berhenti (dalam perjalanan). Dan aku sering mendengar baginda berdoa: \"Allahumma, inni a'udhu bika min al-harami, wal-huzni, wal-'ajzi, wal-kasali, wal-bukhli, wal-jubni, wa dala'id-dain, wa ghalabatir-rijal (Ya Allah, aku berlindung kepada-Mu daripada tua, kesedihan, ketidakupayaan, kemalasan, kedekut, pengecut, beban hutang dan ditindas oleh manusia).\"",
        "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا إِسْمَاعِيلُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَمْرُو بْنُ أَبِي عَمْرٍو،‏‏‏‏ أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَبِي طَلْحَةَ:‏‏‏‏ الْتَمِسْ لِي غُلَامًا مِنْ غِلْمَانِكُمْ يَخْدُمُنِي ، ‏‏‏‏‏‏فَخَرَجَ بِي أَبُو طَلْحَةَ يَرْدُفُنِي وَرَاءَهُ،‏‏‏‏ فَكُنْتُ أَخْدُمُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلَّمَا نَزَلَ فَكُنْتُ أَسْمَعُهُ يُكْثِرُ أَنْ يَقُولَ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَرَمِ وَالْحُزْنِ، ‏‏‏‏‏‏وَالْعَجْزِ وَالْكَسَلِ، ‏‏‏‏‏‏وَالْبُخْلِ وَالْجُبْنِ، ‏‏‏‏‏‏وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ ."
      },
      {
        "id": 40494,
        "hadith_number": "5506",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Nabi SAW daripada Azab Kubur dan Fitnah Dajjal",
        "perawi_melayu": "Aisyah رضي الله عنها",
        "english_text": "It was narrated from 'Aishah that: The Prophet [SAW] used to seek refuge with Allah from the torment of the grave and the tribulation of the Dajjal, and he said: You will be tried in your graves.",
        "malay_translation": "Daripada Aisyah رضي الله عنها, diriwayatkan bahawa Nabi SAW selalu memohon perlindungan kepada Allah daripada azab kubur dan fitnah Dajjal, dan baginda bersabda:  Sesungguhnya kamu akan diuji di dalam kubur kamu.",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ يَحْيَى، ‏‏‏‏‏‏عَنْ عَمْرَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَسْتَعِيذُ بِاللَّهِ مِنْ عَذَابِ الْقَبْرِ، ‏‏‏‏‏‏وَمِنْ فِتْنَةِ الدَّجَّالِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَقَالَ:‏‏‏‏ إِنَّكُمْ تُفْتَنُونَ فِي قُبُورِكُمْ ."
      },
      {
        "id": 40495,
        "hadith_number": "5507",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Menguji perlindungan daripada Allah daripada azab neraka, azab kubur, Dajjal dan ujian hidup dan mati.",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "It was narrated that Abu Hurairah said: The Messenger of Allah [SAW] said: A'udhu billahi min 'adhabi jahannama, wa a'udhu billahi min 'adhabil-qabri, wa a'udhu billahi min sharril-masihid-dajjali, wa a'udhu billahi min sharri fitnatil-mahya wal-mamat (I seek refuge with Allah from the torment of Hell, and I seek refuge with Allah from the torment of the grave, and I seek refuge with Allah from the evil of the Dajjal, and I seek refuge with Allah from the evil of the trials of life and death.)'",
        "malay_translation": "Daripada Abu Hurairah, bahawa Rasulullah SAW bersabda:  أَعُوذُ بِاللهِ مِنْ عَذَابِ جَهَنَّمَ، وَأَعُوذُ بِاللهِ مِنْ عَذَابِ الْقَبْرِ، وَأَعُوذُ بِاللهِ مِنْ شَرِّ الْمَسِيحِ الدَّجَّالِ، وَأَعُوذُ بِاللهِ مِنْ شَرِّ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ (Aku berlindung kepada Allah daripada azab neraka, dan aku berlindung kepada Allah daripada azab kubur, dan aku berlindung kepada Allah daripada kejahatan Dajjal, dan aku berlindung kepada Allah daripada kejahatan fitnah di dunia dan akhirat).",
        "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي أَبِي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي إِبْرَاهِيمُ، ‏‏‏‏‏‏عَنْ مُوسَى بْنِ عُقْبَةَ، ‏‏‏‏‏‏أَخْبَرَنِي أَبُو الزِّنَادِ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ الْأَعْرَجِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَعُوذُ بِاللَّهِ مِنْ عَذَابِ جَهَنَّمَ، ‏‏‏‏‏‏وَأَعُوذُ بِاللَّهِ مِنْ عَذَابِ الْقَبْرِ، ‏‏‏‏‏‏وَأَعُوذُ بِاللَّهِ مِنْ شَرِّ الْمَسِيحِ الدَّجَّالِ، ‏‏‏‏‏‏وَأَعُوذُ بِاللَّهِ مِنْ شَرِّ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ ."
      },
      {
        "id": 40496,
        "hadith_number": "5508",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Mendoakan Perlindungan daripada Azab Kubur, Neraka, Fitnah, dan Dajjal",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "It was narrated from Abu Hurairah that: The Messenger of Allah [SAW] used to say: Allahumma inni a'udhu bika min 'adhabil-qabri, wa a'udhu bika min 'adhabin-nari, wa a'udhu bika min fitnatil-mahya wal-mamat wa a'udhu bika min sharril-masihid-dajjali (O Allah, I seek refuge with You from the torment of the grave, and I seek refuge with You from the torment of the Fire, and I seek refuge with You from the trials of life and death, and I seek refuge with You from the evil of the Al-Masihid-Dajjal.)",
        "malay_translation": "Daripada Abu Hurairah, bahawa Rasulullah SAW  berdoa:  \"Allahumma inni a'udzu bika min 'adzabil-qabri, wa a'udzu bika min 'adzab-innari, wa a'udzu bika min fitnatil-mahya wal-mamat wa a'udzu bika min syarri al-Masih ad-Dajjal.\" (Ya Allah, aku berlindung kepada-Mu daripada azab kubur, dan aku berlindung kepada-Mu daripada azab neraka, dan aku berlindung kepada-Mu daripada fitnah kehidupan dan kematian, dan aku berlindung kepada-Mu daripada kejahatan Al-Masih ad-Dajjal.)",
        "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ دُرُسْتَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو إِسْمَاعِيلَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، ‏‏‏‏‏‏أَنَّ أَبَا سَلَمَةَ حَدَّثَهُ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ أَنَّهُ كَانَ يَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنْ عَذَابِ النَّارِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنْ شَرِّ الْمَسِيحِ الدَّجَّالِ ."
      },
      {
        "id": 40497,
        "hadith_number": "5509",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Mencari perlindungan daripada kejahatan syaitan jin dan manusia",
        "perawi_melayu": "Abu Dzar al-Ghifari",
        "english_text": "It was narrated that Abu Dharr said: I entered the Masjid and the Messenger of Allah [SAW] was there, so I came and sat before him and he said: 'O Abu Dharr, seek refuge with Allah from the evils of the devils among the Jinn and mankind.' I said: 'Are there devils among mankind?' He said: 'Yes.'",
        "malay_translation": "Daripada Abu Dzar al-Ghifari r.a., katanya: Aku masuk ke masjid, dan Rasulullah SAW berada di situ. Maka aku datang dan duduk di hadapan baginda. Baginda bersabda: \"Wahai Abu Dzar, mintalah perlindungan kepada Allah daripada kejahatan syaitan-syaitan dari kalangan jin dan manusia.\" Aku bertanya: \"Adakah terdapat syaitan-syaitan di kalangan manusia?\" Baginda menjawab: \"Ya.\" ",
        "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ أَبِي عُمَرَ، ‏‏‏‏‏‏عَنْ عُبَيْدِ بْنِ خَشْخَاشٍ، ‏‏‏‏‏‏عَنْ أَبِي ذَرٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ دَخَلْتُ الْمَسْجِدَ،‏‏‏‏ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهِ فَجِئْتُ فَجَلَسْتُ إِلَيْهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا أَبَا ذَرٍّ،‏‏‏‏تَعَوَّذْ بِاللَّهِ مِنْ شَرِّ شَيَاطِينِ الْجِنِّ،‏‏‏‏ وَالْإِنْسِ ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ أَوَ لِلْإِنْسِ شَيَاطِينُ ؟،‏‏‏‏ قَالَ:‏‏‏‏ نَعَمْ ."
      },
      {
        "id": 40498,
        "hadith_number": "5510",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Mencari perlindungan daripada Allah daripada azab kubur, ujian hidup dan mati, dan fitnah Dajjal",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "It was narrated from Abu Hurairah that: The Prophet [SAW] said: Seek refuge with Allah from the torment of the grave, seek refuge with Allah from the trials of life and death, and seek refuge with Allah from the tribulation of Al-Masihid-Dajjal.",
        "malay_translation": "Daripada Abu Hurairah, bahawa Nabi SAW bersabda: “Carilah perlindungan daripada Allah daripada azab kubur, carilah perlindungan daripada Allah daripada ujian hidup dan mati, dan carilah perlindungan daripada Allah daripada fitnah Al-Masih ad-Dajjal.”",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا سُفْيَانُ،‏‏‏‏ وَمَالِكٌ،‏‏‏‏ قَالَا:‏‏‏‏ حَدَّثَنَا أَبُو الزِّنَادِ، ‏‏‏‏‏‏عَنْ الْأَعْرَجِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ عُوذُوا بِاللَّهِ مِنْ عَذَابِ الْقَبْرِ، ‏‏‏‏‏‏عُوذُوا بِاللَّهِ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، ‏‏‏‏‏‏عُوذُوا بِاللَّهِ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ ."
      },
      {
        "id": 40499,
        "hadith_number": "5511",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Mencari Perlindungan daripada Lima Perkara",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "It was narrated from Abu Hurairah that: The Messenger of Allah [SAW] used to seek refuge with Allah from five things, saying: Seek refuge with Allah from the torment of the grave, and from the torment of Hell, and from the trials of life and death, and from the evil of Al-Masihid-Dajjal.",
        "malay_translation": "Dari Abu Hurairah, bahawa Rasulullah SAW sentiasa memohon perlindungan kepada Allah daripada lima perkara, dengan bersabda:  “Carilah perlindungan dengan Allah daripada azab kubur, dan daripada azab neraka Jahannam, dan daripada fitnah kehidupan dan kematian, dan daripada kejahatan Al-Masih ad-Dajjal.”",
        "arabic_text": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو دَاوُدَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي يَعْلَى بْنُ عَطَاءٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ أَبَا عَلْقَمَةَ يُحَدِّثُ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَعَوَّذُ مِنْ خَمْسٍ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ عُوذُوا بِاللَّهِ مِنْ عَذَابِ الْقَبْرِ، ‏‏‏‏‏‏وَمِنْ عَذَابِ جَهَنَّمَ، ‏‏‏‏‏‏وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، ‏‏‏‏‏‏وَمِنْ شَرِّ الْمَسِيحِ الدَّجَّالِ ."
      },
      {
        "id": 40500,
        "hadith_number": "5512",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Ketaatan Kepada Rasulullah SAW Adalah Ketaatan Kepada Allah",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah said: I heard the Messenger of Allah [SAW] say: 'Whoever obeys me has obeyed Allah and whoever disobeys me has disobeyed Allah.' And he used to seek refuge from the torment of the grave, the torment of Hell, the trials that may befall the living and the dead, and the tribulation of Al-Masihid-Dajjal.",
        "malay_translation": "Abu Hurairah berkata: Aku mendengar Rasulullah SAW bersabda: 'Sesiapa yang mentaatiku, maka sesungguhnya dia telah mentaati Allah, dan sesiapa yang menderhakaiku, maka sesungguhnya dia telah menderhaka kepada Allah.' Baginda juga selalu meminta perlindungan daripada azab kubur, azab neraka Jahannam, fitnah orang yang hidup dan yang mati, dan fitnah Al-Masih ad-Dajjal.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدٍ وَذَكَرَ كَلِمَةً مَعْنَاهَا، ‏‏‏‏‏‏حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ يَعْلَى بْنِ عَطَاءٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ أَبَا عَلْقَمَةَ الْهَاشِمِيَّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ أَبَا هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ مَنْ أَطَاعَنِي فَقَدْ أَطَاعَ اللَّهَ، ‏‏‏‏‏‏وَمَنْ عَصَانِي فَقَدْ عَصَى اللَّهَ ، ‏‏‏‏‏‏وَكَانَ:‏‏‏‏ يَتَعَوَّذُ مِنْ عَذَابِ الْقَبْرِ، ‏‏‏‏‏‏وَعَذَابِ جَهَنَّمَ، ‏‏‏‏‏‏وَفِتْنَةِ الْأَحْيَاءِ وَالْأَمْوَاتِ، ‏‏‏‏‏‏وَفِتْنَةِ الْمَسِيحِ الدَّجَّالِ ."
      },
      {
        "id": 40501,
        "hadith_number": "5513",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Mengucapkan perlindungan kepada Allah daripada lima perkara",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah said: He (meaning the Prophet [SAW]) said: 'Seek refuge with Allah from five things: From the torment of Hell, the torment of the grave, the trials of life and death, and the tribulation of Al-Masihid-Dajjal.'",
        "malay_translation": "Abu Hurairah berkata: Baginda (maksudnya Nabi SAW) bersabda: \"Mohonlah perlindungan kepada Allah daripada lima perkara: Daripada azab neraka Jahannam, azab kubur, ujian hidup dan mati, dan fitnah Al-Masih ad-Dajjal.\"",
        "arabic_text": "أَخْبَرَنَا أَبُو دَاوُدَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو الْوَلِيدِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو عَوَانَةَ، ‏‏‏‏‏‏عَنْ يَعْلَى بْنِ عَطَاءٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أَبِي عَلْقَمَةَ، ‏‏‏‏‏‏حَدَّثَنِي أَبُو هُرَيْرَةَ مِنْ فِيهِ إِلَى فِيَّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَقَالَ يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اسْتَعِيذُوا بِاللَّهِ مِنْ خَمْسٍ:‏‏‏‏ مِنْ عَذَابِ جَهَنَّمَ، ‏‏‏‏‏‏وَعَذَابِ الْقَبْرِ، ‏‏‏‏‏‏وَفِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، ‏‏‏‏‏‏وَفِتْنَةِ الْمَسِيحِ الدَّجَّالِ ."
      },
      {
        "id": 40502,
        "hadith_number": "5514",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa perlindungan daripada azab neraka, azab kubur, fitnah Dajjal dan ujian hidup dan mati",
        "perawi_melayu": "Abdullah bin Abbas",
        "english_text": "It was narrated from 'Abdullah bin 'Abbas that: The Messenger of Allah [SAW] used to teach them this supplication as he would teach them a Surah of the Qur'an: Say: 'Allahumma, inni na'uwdhu bika min 'adhabi jahannama, wa a'udhu bika min 'adhabil-qabri, wa a'udhu bika min fitnatil-masihid-dajjali, wa a'udhu bika min fitnatil-mahya wal-mamat (O Allah, we seek refuge with You from the torment of Hell, and I seek refuge with You from the torment of the grave, and I seek refuge with You from the tribulation of Al-Masihid-Dajjal, and I seek refuge with You from the trials of life and death.)'",
        "malay_translation": "Daripada Abdullah bin Abbas, bahawa Rasulullah SAW telah mengajar mereka doa ini sepertimana baginda mengajar mereka satu surah daripada al-Quran:  Katakanlah: \"Allahumma inni na’uzu bika min ‘azabi jahannama, wa a’uzu bika min ‘azabil qabri, wa a’uzu bika min fitnatil Masihid Dajjal, wa a’uzu bika min fitnatil mahya wal mamat.\" (Ya Allah, sesungguhnya kami berlindung kepadaMu daripada azab neraka Jahannam, dan aku berlindung kepadaMu daripada azab kubur, dan aku berlindung kepadaMu daripada fitnah Al-Masih ad-Dajjal, dan aku berlindung kepadaMu daripada fitnah kehidupan dan kematian.)",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ أَبِي الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ طَاوُسٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ:‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُعَلِّمُهُمْ هَذَا الدُّعَاءَ كَمَا يُعَلِّمُ السُّورَةَ مِنَ الْقُرْآنِ، ‏‏‏‏‏‏قُولُوا:‏‏‏‏ اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ ."
      },
      {
        "id": 40503,
        "hadith_number": "5515",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Mencari perlindungan daripada azab Allah",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "It was narrated from Abu Hurairah that: The Prophet [SAW] said: Seek refuge with Allah from the punishment of Allah, seek refuge with Allah from the trials of life and death, from the torment of the grave and from the tribulation of the Al-Masihid-Dajjal.",
        "malay_translation": "Daripada Abu Hurairah, bahawa Nabi SAW bersabda:  “Mohonlah perlindungan kepada Allah daripada azab Allah, mohonlah perlindungan kepada Allah daripada fitnah kehidupan dan kematian, daripada azab kubur, dan daripada fitnah Dajjal.”",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَيْمُونٍ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏عَنْ عَمْرٍو، ‏‏‏‏‏‏عَنْ طَاوُسَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ. وَأَبِي الزِّنَادِ، ‏‏‏‏‏‏عَنْ الْأَعْرَجِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ عُوذُوا بِاللَّهِ عَزَّ وَجَلَّ مِنْ عَذَابِ اللَّهِ، ‏‏‏‏‏‏عُوذُوا بِاللَّهِ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، ‏‏‏‏‏‏وَمِنْ عَذَابِ الْقَبْرِ، ‏‏‏‏‏‏وَمِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ ."
      },
      {
        "id": 40504,
        "hadith_number": "5516",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Rasulullah SAW memohon perlindungan daripada azab neraka, azab kubur, fitnah Dajjal dan ujian hidup dan mati.",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "It was narrated from Abu Hurairah that: The Messenger of Allah [SAW] used to say in his supplication: Allahumma, inni a'udhu bika min 'adhabi jahannama, wa a'udhu bika min 'adhabil-qabri, wa a'udhu bika min fitnatil-masihid-dajjali, wa a'udhu bika min fitnatil-mahya wal-mamat (O Allah, I seek refuge with You from the torment of Hell, and I seek refuge in You from the torment of the grave, and I seek refuge in You from the tribulation of the Al-Masihid-Dajjal, and I seek refuge with You from the trials of life and death.)",
        "malay_translation": "Dari Abu Hurairah, bahawa Rasulullah SAW berdoa:  \"Ya Allah, aku berlindung kepada-Mu daripada azab neraka Jahannam, dan aku berlindung kepada-Mu daripada azab kubur, dan aku berlindung kepada-Mu daripada fitnah Al-Masih ad-Dajjal, dan aku berlindung kepada-Mu daripada fitnah kehidupan dan kematian.\"",
        "arabic_text": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ:‏‏‏‏ عَنْ ابْنِ الْقَاسِمِ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ أَبِي الزِّنَادِ، ‏‏‏‏‏‏عَنْ الْأَعْرَجِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو يَقُولُ فِي دُعَائِهِ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ ."
      },
      {
        "id": 40505,
        "hadith_number": "5517",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Mencari Perlindungan daripada Fitnah Kubur, Dajjal, dan Ujian Hidup Mati",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "It was narrated from Sulaiman bin Yasar that he heard Abu Hurairah say: I heard the Messenger of Allah [SAW] say in his supplication: 'Allahumma, inni a'udhu bika min fitnatil-qabri, wa fitnatid-dajjali, wa fitnatil-mahya wal-mamat (O Allah, I seek refuge with You from the trial of the grave, and the tribulation of the Dajjal, and the trials of life and death.)'",
        "malay_translation": "Daripada Sulaiman bin Yasar, bahawa beliau mendengar Abu Hurairah berkata: Aku mendengar Rasulullah SAW berdoa: \"Ya Allah, aku berlindung kepada-Mu daripada fitnah kubur, dan fitnah Dajjal, dan fitnah kehidupan dan kematian.\"",
        "arabic_text": "أَخْبَرَنَا أَبُو عَاصِمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا الْقَاسِمُ بْنُ كَثِيرٍ الْمُقْرِيُّ، ‏‏‏‏‏‏عَنْ اللَّيْثِ بْنِ سَعْدٍ، ‏‏‏‏‏‏عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، ‏‏‏‏‏‏عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ،‏‏‏‏ يَقُولُ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ فِي دُعَائِهِ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ الْقَبْرِ، ‏‏‏‏‏‏وَفِتْنَةِ الدَّجَّالِ، ‏‏‏‏‏‏وَفِتْنَةِ الْمَحْيَا وَالْمَمَاتِ . قَالَ أَبُو عَبْد الرَّحْمَنِ:‏‏‏‏ هَذَا خَطَأٌ،‏‏‏‏ وَالصَّوَابُ سُلَيْمَانُ بْنُ سِنَانٍ."
      },
      {
        "id": 40506,
        "hadith_number": "5518",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Mencari perlindungan daripada Allah",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "It was narrated from Abu Hurairah that : The Prophet [SAW] said: Seek refuge with Allah from the punishment of Allah, seek refuge with Allah from the torment of the grave, seek refuge with Allah from the trials of life and death, and seek refuge with Allah from the tribulation of Al-Masihid-Dajjal.",
        "malay_translation": "Daripada Abu Hurairah, bahawa Nabi SAW bersabda: “Carilah perlindungan daripada Allah daripada azab Allah, carilah perlindungan daripada Allah daripada azab kubur, carilah perlindungan daripada Allah daripada fitnah hidup dan mati, dan carilah perlindungan daripada Allah daripada fitnah Al-Masih ad-Dajjal.”",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ أَبِي الزِّنَادِ، ‏‏‏‏‏‏عَنْ الْأَعْرَجِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ عُوذُوا بِاللَّهِ مِنْ عَذَابِ اللَّهِ، ‏‏‏‏‏‏عُوذُوا بِاللَّهِ مِنْ عَذَابِ الْقَبْرِ، ‏‏‏‏‏‏عُوذُوا بِاللَّهِ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، ‏‏‏‏‏‏عُوذُوا بِاللَّهِ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ ."
      },
      {
        "id": 40507,
        "hadith_number": "5519",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Rasulullah SAW Memohon Perlindungan daripada Azab Neraka, Azab Kubur, dan Dajjal",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "It was narrated that Abu Hurairah said: The Messenger of Allah [SAW] used to seek refuge (with Allah) from the torment of Hell, the torment of the grave, and Al-Masihid-Dajjal.",
        "malay_translation": "Daripada Abu Hurairah, katanya: Rasulullah SAW selalu memohon perlindungan kepada Allah daripada azab neraka Jahannam, azab kubur, dan Al-Masih ad-Dajjal.",
        "arabic_text": "أَخْبَرَنَا إِسْحَاق بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا أَبُو عَامِرٍ الْعَقَدِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ بُدَيْلِ بْنِ مَيْسَرَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَعَوَّذُ مِنْ عَذَابِ جَهَنَّمَ، ‏‏‏‏‏‏وَعَذَابِ الْقَبْرِ، ‏‏‏‏‏‏وَالْمَسِيحِ الدَّجَّالِ ."
      },
      {
        "id": 40508,
        "hadith_number": "5520",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Mencari perlindungan daripada Allah",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah said: The Messenger of Allah [SAW] said: Seek refuge with Allah from the torment of the Fire and the torment of the grave, from the trials of life and death, and from the evil of Al-Masihid-Dajjal.",
        "malay_translation": "Abu Hurairah berkata: Rasulullah SAW bersabda:  “Carilah perlindungan daripada Allah daripada azab neraka, azab kubur, fitnah kehidupan dan kematian, dan daripada kejahatan Al-Masih ad-Dajjal.”",
        "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ خَالِدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا الْوَلِيدُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو عَمْرٍو، ‏‏‏‏‏‏عَنْ يَحْيَى أَنَّهُ حَدَّثَهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي أَبُو سَلَمَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي أَبُو هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ تَعَوَّذُوا بِاللَّهِ مِنْ عَذَابِ النَّارِ، ‏‏‏‏‏‏وَعَذَابِ الْقَبْرِ، ‏‏‏‏‏‏وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، ‏‏‏‏‏‏وَمِنْ شَرِّ الْمَسِيحِ الدَّجَّالِ ."
      },
      {
        "id": 40509,
        "hadith_number": "5521",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Mengucapkan Doa Mencari Perlindungan daripada Api Neraka dan Azab Kubur",
        "perawi_melayu": "Aisyah رضي الله عنها",
        "english_text": "It was narrated that 'Aishah said: The Messenger of Allah [SAW] said: 'Allahumma, rabba jibra'ila, wa mika'ila wa rabba israfila, a'udhu bika min harrin-nari wa (min) 'adhabil-qabr (O Allah, Lord of Jibra'il and Mika'il and Lord of Israfil, I seek refuge in You from the heat of the Fire and (from) the torment of the grave.)'",
        "malay_translation": "Daripada Aisyah رضي الله عنها, bahawa Rasulullah ﷺ bersabda:  'Allahumma, rabba Jibrail, wa Mikail, wa rabba Israfil, a'udzu bika min harrin-nar wa min 'adzabil-qabr. (Ya Allah, Tuhan Jibrail, Mikail dan Israfil, aku berlindung kepada-Mu daripada panas api neraka dan daripada azab kubur.)'",
        "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي أَبِي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي إِبْرَاهِيمُ، ‏‏‏‏‏‏عَنْ سُفْيَانَ بْنِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ أَبِي حَسَّانَ، ‏‏‏‏‏‏عَنْ جَسْرَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ،‏‏‏‏ أَنَّهَا قَالَتْ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اللَّهُمَّ رَبَّ جِبْرَائِيلَ،‏‏‏‏ وَمِيكَائِيلَ،‏‏‏‏ وَرَبَّ إِسْرَافِيلَ، ‏‏‏‏‏‏أَعُوذُ بِكَ مِنْ حَرِّ النَّارِ، ‏‏‏‏‏‏وَمِنْ عَذَابِ الْقَبْرِ ."
      },
      {
        "id": 40510,
        "hadith_number": "5522",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Mendoakan Perlindungan daripada Fitnah Kubur, Dajjal, dan Neraka",
        "perawi_melayu": "Sulaiman bin Sinan Al-Muzani melalui Abu Hurairah",
        "english_text": "It was narrated from Sulaiman bin Sinan Al-Muzani that he heard Abu Hurairah say: I heard Abu Al-Qasim [SAW] say, during his prayer: 'Allahumma, inni a'udhu bika min fitnatil-qabri, wa fitnatid-dajjali, wa min fitnatil-mahya wal-mamati, wa min harri jahannam (O Allah, I seek refuge with You from the trial of the grave, and from the tribulation of the Dajjal, and from the trials of life and death, and from the heat of Hell.)'",
        "malay_translation": "Daripada Sulaiman bin Sinan Al-Muzani, bahawa beliau mendengar Abu Hurairah berkata: Aku mendengar Abu Al-Qasim [SAW] berdoa dalam solatnya:  'Allahumma, inni a'udzu bika min fitnatil-qabri, wa fitnatid-dajjali, wa min fitnatil-mahya wal-mamati, wa min harri jahannam (Ya Allah, aku berlindung kepada-Mu daripada fitnah kubur, dan daripada fitnah Dajjal, dan daripada fitnah kehidupan dan kematian, dan daripada azab neraka).' ",
        "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ سَوَّادٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَمْرُو بْنُ الْحَارِثِ، ‏‏‏‏‏‏عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، ‏‏‏‏‏‏عَنْ سُلَيْمَانَ بْنِ سِنَانٍ الْمُزَنِيِّ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ سَمِعْتُ أَبَا الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي صَلَاتِهِ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ الْقَبْرِ، ‏‏‏‏‏‏وَمِنْ فِتْنَةِ الدَّجَّالِ، ‏‏‏‏‏‏وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، ‏‏‏‏‏‏وَمِنْ حَرِّ جَهَنَّمَ . قَالَ أَبُو عَبْد الرَّحْمَنِ:‏‏‏‏ هَذَا الصَّوَابُ."
      },
      {
        "id": 40511,
        "hadith_number": "5523",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa memohon Syurga dan perlindungan dari Neraka",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "It was narrated that Anas bin Malik said: The Messenger of Allah [SAW] said: 'Whoever asks Allah for Paradise three times, Paradise will say: 'O Allah, admit him to Paradise.' And whoever seeks protection from Hell three times, Hell will say: 'O Allah, protect him from the Fire.'",
        "malay_translation": "Dari Anas bin Malik, katanya: Rasulullah SAW bersabda:  'Barangsiapa memohon kepada Allah akan Syurga sebanyak tiga kali, nescaya Syurga akan berkata: 'Ya Allah, masukkanlah dia ke dalam Syurga.' Dan barangsiapa meminta perlindungan daripada Neraka sebanyak tiga kali, nescaya Neraka akan berkata: 'Ya Allah, lindungilah dia daripada Api.'",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو الْأَحْوَصِ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنْ بُرَيْدِ بْنِ أَبِي مَرْيَمَ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ سَأَلَ اللَّهَ الْجَنَّةَ ثَلَاثَ مَرَّاتٍ، ‏‏‏‏‏‏قَالَتِ الْجَنَّةُ:‏‏‏‏ اللَّهُمَّ أَدْخِلْهُ الْجَنَّةَ، ‏‏‏‏‏‏وَمَنِ اسْتَجَارَ مِنَ النَّارِ ثَلَاثَ مَرَّاتٍ، ‏‏‏‏‏‏قَالَتِ النَّارُ:‏‏‏‏ اللَّهُمَّ أَجِرْهُ مِنَ النَّارِ ."
      },
      {
        "id": 40512,
        "hadith_number": "5524",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa Pengampunan Terbaik",
        "perawi_melayu": "Syaddad bin Aws",
        "english_text": "It was narrated from Shaddad bin Aws that : The Prophet [SAW] said: The best of prayers for forgiveness is for a person to say: 'Allahumma, anta rabbi, la ilaha illa anta, khalaqtani wa ana 'abduka, wa ana 'ala 'ahdika wa wa'dika mastata'tu, a'udhu bika min sharri ma sana'tu, abuw'u laka bidhanbi, wa abuw'u laka bini'matika 'alayya faghfirli, fa innahu la yaghfirudh-dhunuba illa anta (O Allah, You are my Lord, there is no god but You. You have created me and I am Your slave and I am keeping my promise and covenant to You as much as I can. I seek refuge with You from the evil of what I do. I acknowledge Your blessing and I acknowledge my sin, so forgive me, for there is none who can forgive sin except You.)' If he says this in the morning, believing in it firmly, and dies on that day before evening comes, he will enter Paradise, and if he says it in the evening, believing firmly in it, and dies before morning comes, he will enter Paradise. Al-Walid bin Tha'labah contradicted him.",
        "malay_translation": "Daripada Syaddad bin Aws, bahawa Nabi SAW bersabda: \"Doa yang terbaik untuk memohon keampunan ialah seseorang itu berkata: 'Allahumma anta Rabbi, la ilaha illa anta, khalaqtani wa ana 'abduka, wa ana 'ala 'ahdika wa wa'dika mastata'tu, a'udzu bika min syarri ma sana'tu, abu'u laka bidzanbi, wa abu'u laka bin'imatika 'alayya faghfirli, fa innahu la yaghfirudh-dhunuba illa anta' (Ya Allah, Engkaulah Tuhanku, tiada Tuhan melainkan Engkau. Engkau telah menciptakan aku dan aku adalah hamba-Mu, dan aku akan menepati janji dan perjanjian-Mu seberapa yang mampu, aku berlindung kepada-Mu daripada kejahatan amalku. Aku mengakui dosaku dan aku mengakui nikmat-Mu kepadaku, maka ampunkanlah aku, sesungguhnya tiada siapa yang dapat mengampunkan dosa melainkan Engkau).\" Jika dia mengucapkannya di waktu pagi dengan penuh keyakinan, dan dia mati pada hari itu sebelum petang, nescaya dia akan masuk syurga. Dan jika dia mengucapkannya di waktu petang dengan penuh keyakinan, dan dia mati sebelum pagi, nescaya dia akan masuk syurga.\" Al-Walid bin Tha'labah berselisih pendapat dengannya.",
        "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ زُرَيْعٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، ‏‏‏‏‏‏عَنْ بُشَيْرِ بْنِ كَعْبٍ، ‏‏‏‏‏‏عَنْ شَدَّادِ بْنِ أَوْسٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنَّ سَيِّدَ الِاسْتِغْفَارِ، ‏‏‏‏‏‏أَنْ يَقُولَ الْعَبْدُ:‏‏‏‏ اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنْتَ، ‏‏‏‏‏‏خَلَقْتَنِي وَأَنَا عَبْدُكَ، ‏‏‏‏‏‏وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، ‏‏‏‏‏‏أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، ‏‏‏‏‏‏أَبُوءُ لَكَ بِذَنْبِي، ‏‏‏‏‏‏وَأَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، ‏‏‏‏‏‏فَاغْفِرْ لِي، ‏‏‏‏‏‏فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، ‏‏‏‏‏‏فَإِنْ قَالَهَا حِينَ يُصْبِحُ مُوقِنًا بِهَا فَمَاتَ دَخَلَ الْجَنَّةَ، ‏‏‏‏‏‏وَإِنْ قَالَهَا حِينَ يُمْسِي مُوقِنًا بِهَا دَخَلَ الْجَنَّةَ . خَالَفَهُ الْوَلِيدُ بْنُ ثَعْلَبَةَ."
      },
      {
        "id": 40513,
        "hadith_number": "5525",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Rasulullah SAW Sebelum Wafat",
        "perawi_melayu": "Ibnu Yasaf",
        "english_text": "It was narrated from 'Abdah bin Abi Lubabah that Ibn Yasaf told him that he asked 'Aishah, the wife of the Prophet [SAW], : What supplication did the Messenger of Allah [SAW] say the most before he died? She said: The supplication that he said the most was: 'Allahumma, inni a'udhu bika min sharri ma 'amiltu wa min sharri ma lam a'mal ba'd (O Allah, I seek refuge with You from the evil of what I have done, and from the evil of what I have not done yet.)'",
        "malay_translation": "Daripada 'Abdah bin Abi Lubabah, bahawa Ibnu Yasaf memberitahunya bahawa dia bertanya kepada Aisyah, isteri Nabi SAW: Apakah doa yang paling banyak dibacakan oleh Rasulullah SAW sebelum wafatnya?  Aisyah berkata: Doa yang paling banyak dibacakan oleh Baginda ialah:  'Allahumma, inni a'udzu bika min sharri ma 'amiltu wa min sharri ma lam a'mal ba'd' (Ya Allah, aku berlindung kepada-Mu daripada kejahatan amalku dan daripada kejahatan apa yang belum aku lakukan).",
        "arabic_text": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏عَنْ ابْنِ وَهْبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي مُوسَى بْنُ شَيْبَةَ، ‏‏‏‏‏‏عَنْ الْأَوْزَاعِيِّ، ‏‏‏‏‏‏27 عَنْ عَبْدَةَ بْنِ أَبِي لُبَابَةَ، ‏‏‏‏‏‏أَنَّ ابْنَ يَسَافٍ حَدَّثَهُ، ‏‏‏‏‏‏أَنَّهُ سَأَلَ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَا كَانَ أَكْثَرُ مَا يَدْعُو بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْلَ مَوْتِهِ ؟ قَالَتْ:‏‏‏‏ كَانَ أَكْثَرُ مَا كَانَ يَدْعُو بِهِ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ،‏‏‏‏ وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ ."
      },
      {
        "id": 40514,
        "hadith_number": "5526",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Nabi SAW yang Paling Kerap",
        "perawi_melayu": "Ibn Yasaf",
        "english_text": "Ibn Yasaf said: I asked 'Aishah, what was the supplication that the Prophet [SAW] said the most? She said: 'The supplication that he said the most was: Allahumma, inni a'udhu bika min sharri ma 'amiltu wa min sharri ma lam a'mal ba'd (O Allah, I seek refuge with You from the evil of what I have done, and from the evil of what I have not done yet.)'",
        "malay_translation": "Ibn Yasaf berkata: Saya bertanya kepada Aisyah, apakah doa yang paling sering dibacakan oleh Nabi SAW?  Beliau menjawab: 'Doa yang paling sering Baginda bacakan ialah:  Allahumma inni a'udzu bika min sharri ma 'amiltu wa min sharri ma lam a'mal ba'd (Ya Allah, aku berlindung kepadaMu daripada kejahatan amalku dan daripada kejahatan apa yang belum aku lakukan).' ",
        "arabic_text": "أَخْبَرَنِي عِمْرَانُ بْنُ بَكَّارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو الْمُغِيرَةِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا الْأَوْزَاعِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي عَبْدَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي ابْنُ يَسَافٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سُئِلَتْ عَائِشَةُ:‏‏‏‏ مَا كَانَ أَكْثَرُ مَا كَانَ يَدْعُو بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ؟ قَالَتْ:‏‏‏‏ كَانَ أَكْثَرُ دُعَائِهِ أَنْ يَقُولَ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ، ‏‏‏‏‏‏وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ بَعْدُ ."
      },
      {
        "id": 40515,
        "hadith_number": "5527",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa Rasulullah SAW daripada kejahatan amalan dan belum amalan",
        "perawi_melayu": "Farwah bin Nawfal",
        "english_text": "It was narrated that Farwah bin Nawfal said: I asked the Mother of the Believers 'Aishah about what the Messenger of Allah [SAW] used to say in his supplication. She said: 'He used to say: A'udhu bika min sharri ma 'amiltu wa min sharri ma lam a'mal ba'd (I seek refuge with You from the evil of what I have done and the evil of what I have not done yet.)'",
        "malay_translation": "Daripada Farwah bin Nawfal, beliau berkata: Saya bertanya kepada isteri Rasulullah SAW, Saidatina Aisyah tentang doa yang selalu dibaca oleh Rasulullah SAW.  Baginda menjawab: Baginda SAW selalu berdoa: \" أعوذ بك من شر ما عملت ومن شر ما لم أعمل\" (A'udzu bika min sharri ma 'amiltu wa min sharri ma lam a'mal ba'd)  Maksudnya: “Aku berlindung kepadaMu daripada kejahatan amalku dan daripada kejahatan apa yang belum aku lakukan.”",
        "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ قُدَامَةَ، ‏‏‏‏‏‏عَنْ جَرِيرٍ، ‏‏‏‏‏‏عَنْ مَنْصُورٍ، ‏‏‏‏‏‏عَنْ هِلَالِ بْنِ يَسَافٍ، ‏‏‏‏‏‏عَنْ فَرْوَةَ بْنِ نَوْفَلٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَأَلْتُ أُمَّ الْمُؤْمِنِينَ عَائِشَةَ:‏‏‏‏ عَمَّا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو ؟ قَالَتْ:‏‏‏‏ كَانَ يَقُولُ:‏‏‏‏ أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ، ‏‏‏‏‏‏وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ ."
      },
      {
        "id": 40516,
        "hadith_number": "5528",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa Mencari Perlindungan daripada Kejahatan Amalan",
        "perawi_melayu": "Aisyah رضي الله عنها",
        "english_text": "It was narrated that 'Aishah said: The Messenger of Allah [SAW] used to say: 'Allahumma, inni a'udhu bika min sharri ma 'amiltu wa min sharri ma lam a'mal ba'd (O Allah, I seek refuge with You from the evil of what I have done and from the evil of what I have not done yet.)'",
        "malay_translation": "Daripada Aisyah رضي الله عنها, beliau berkata: Rasulullah ﷺ selalu berdoa: \"Allahumma inni a'udzu bika min sharri ma 'amiltu wa min sharri ma lam a'mal ba'du. (Ya Allah, aku berlindung kepada-Mu daripada kejahatan amalku dan daripada kejahatan apa yang belum aku lakukan.)\"",
        "arabic_text": "أَخْبَرَنَا هَنَّادٌ، ‏‏‏‏‏‏عَنْ أَبِي الْأَحْوَصِ، ‏‏‏‏‏‏عَنْ حُصَيْنٍ، ‏‏‏‏‏‏عَنْ هِلَالٍ، ‏‏‏‏‏‏عَنْ فَرْوَةَ بْنِ نَوْفَلٍ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ، ‏‏‏‏‏‏وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ ."
      },
      {
        "id": 40517,
        "hadith_number": "5529",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Rasulullah SAW memohon perlindungan daripada kejahatan perbuatan sendiri",
        "perawi_melayu": "Farwah bin Nawfal",
        "english_text": "It was narrated that Farwah bin Nawfal said: I asked 'Aishah: 'Tell me of something that the Messenger of Allah [SAW] used to say in his supplication.' She said: 'The Messenger of Allah [SAW] used to say: Allahumma, inni a'udhu bika min sharri ma 'amiltu wa min sharri ma lam a'mal ba'd (O Allah, I seek refuge with You from the evil of what I have done and from the evil of what I have not done.)'",
        "malay_translation": "Daripada Farwah bin Nawfal, katanya: Aku bertanya kepada Aisyah: \"Ceritakan kepadaku sesuatu yang selalu dibaca oleh Rasulullah SAW dalam doanya.\" Jawab Aisyah: \"Rasulullah SAW selalu berdoa: Allahumma inni a'udzu bika min sharri ma 'amiltu wa min sharri ma lam a'mal ba'd (Ya Allah, aku berlindung kepadaMu daripada kejahatan amalku dan daripada kejahatan apa yang aku tidak lakukan).\"",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا الْمُعْتَمِرُ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ حُصَيْنٍ، ‏‏‏‏‏‏عَنْ هِلَالِ بْنِ يَسَافٍ، ‏‏‏‏‏‏عَنْ فَرْوَةَ بْنِ نَوْفَلٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَأَلْتُ عَائِشَةَ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ حَدِّثِينِي بِشَيْءٍ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو بِهِ ؟ قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ، ‏‏‏‏‏‏وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ ."
      },
      {
        "id": 40518,
        "hadith_number": "5530",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Rasulullah SAW daripada kejahatan perbuatan dan juga yang belum dilakukan",
        "perawi_melayu": "Farwah bin Nawfal",
        "english_text": "It was narrated that Farwah bin Nawfal said: I said to 'Aishah: 'Tell me of a supplication that the Messenger of Allah [SAW] used to say.' She said: 'He used to say: Allahumma, inni a'udhu bika min sharri ma 'amiltu wa min sharri ma lam a'mal ba'd (O Allah, I seek refuge in You from the evil of what I have done and from the evil of what I have not done.)'",
        "malay_translation": "Daripada riwayat Farwah bin Nawfal, katanya: Aku berkata kepada Aisyah: “Ceritakan kepadaku satu doa yang biasa dibaca oleh Rasulullah SAW.”  Aisyah menjawab: “Baginda SAW biasa berdoa:  Allahumma inni a’udzu bika min sharri ma ‘amiltu wa min sharri ma lam a’mal ba’du (Ya Allah, aku berlindung kepada-Mu daripada kejahatan apa yang telah aku lakukan dan daripada kejahatan apa yang belum aku lakukan.)”",
        "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو دَاوُدَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ حُصَيْنٍ،‏‏‏‏ سَمِعْتُ هِلَالَ بْنَ يَسَافٍ، ‏‏‏‏‏‏عَنْ فَرْوَةَ بْنِ نَوْفَلٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ لِعَائِشَةَ:‏‏‏‏ أَخْبِرِينِي بِدُعَاءٍ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو بِهِ ؟ قَالَتْ:‏‏‏‏ كَانَ يَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ، ‏‏‏‏‏‏وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ ."
      },
      {
        "id": 40519,
        "hadith_number": "5531",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Mencari Perlindungan daripada Allah daripada Bencana Tanah Runtuh",
        "perawi_melayu": "Abdullah bin Umar R.A.",
        "english_text": "Umar said: I heard the Messenger of Allah [SAW] say: 'Allahumma, inni a'udhu bi-'azamatika an ughtala min tahti (O Allah, I seek refuge in Your greatness from being swallowed up from beneath me.)'",
        "malay_translation": "Umar berkata: Saya mendengar Rasulullah SAW bersabda: \"Allahumma inni a'udzu bi-'azamataka an ughthala min tahti (Ya Allah, sesungguhnya aku berlindung dengan keagungan-Mu daripada ditelan bumi dari bawahku).\"",
        "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ مَنْصُورٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ، ‏‏‏‏‏‏عَنْ عُبَادَةَ بْنِ مُسْلِمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي جُبَيْرُ بْنُ أَبِي سُلَيْمَانَ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، ‏‏‏‏‏‏أَنَّ ابْنَ عُمَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي ، ‏‏‏‏‏‏قَالَ جُبَيْرٌ:‏‏‏‏ وَهُوَ الْخَسْفُ، ‏‏‏‏‏‏قَالَ عُبَادَةُ:‏‏‏‏ فَلَا أَدْرِي قَوْلُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ أَوْ قَوْلُ جُبَيْرٍ."
      },
      {
        "id": 40520,
        "hadith_number": "5532",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Nabi SAW daripada Ditelan Bumi",
        "perawi_melayu": "Ibn Umar",
        "english_text": "It was narrated that Ibn 'Umar said: The Prophet [SAW] used to say: 'Allahumma (O Allah,)' and he mentioned the supplication, and said at the end, 'A'udhu bika an ughtala min tahti (and I seek refuge with You from being swallowed up from beneath me.)'",
        "malay_translation": "Daripada Ibnu Umar, katanya: Nabi SAW selalu berdoa: “Allahumma (Ya Allah),” kemudian baginda menyebut doa tersebut, dan pada akhirnya baginda berkata: “A’udzu bika an ughthala min tahti (dan aku berlindung kepada-Mu daripada ditelan dari bawahku).”",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْخَلِيلِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا مَرْوَانُ هُوَ ابْنُ مُعَاوِيَةَ، ‏‏‏‏‏‏عَنْ عَلِيِّ بْنِ عَبْدِ الْعَزِيزِ، ‏‏‏‏‏‏عَنْ عُبَادَةَ بْنِ مُسْلِمٍ الْفَزَارِيِّ، ‏‏‏‏‏‏عَنْ جُبَيْرِ بْنِ أَبِي سُلَيْمَانَ، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ اللَّهُمَّ ،‏‏‏‏ فَذَكَرَ الدُّعَاءَ، ‏‏‏‏‏‏وَقَالَ فِي آخِرِهِ:‏‏‏‏ أَعُوذُ بِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي ،‏‏‏‏ يَعْنِي بِذَلِكَ الْخَسْفَ."
      },
      {
        "id": 40521,
        "hadith_number": "5533",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Rasulullah SAW daripada pelbagai bencana dan kecelakaan",
        "perawi_melayu": "Abu Al-Yasar",
        "english_text": "It was narrated that Abu Al-Yasar said: The Messenger of Allah [SAW] used to say: 'Allahumma inni a'udhu bika minat-taraddi, wal-hadmi, wal-gharaqi, wal-hariqi, wa a'udhu bika, an yatakhabbatanish-shaitanu 'indal-mawti, wa a'udhu bika an amuta fi sabilika mudbiran, wa a'udhu bika an amuta ladigha (O Allah, I seek refuge with You from being thrown from a high place or crushed beneath a falling wall, or drowning or being burned, and I seek refuge with You from being led astray by the Shaitan at the time of death, and I seek refuge with You from dying in Your cause while fleeing from the battlefield, and I seek refuge with You from dying of a scorpion sting.)'",
        "malay_translation": "Telah diriwayatkan bahawa Abu Al-Yasar berkata: Rasulullah SAW selalu berdoa: \"Ya Allah, aku berlindung kepada-Mu daripada terjatuh dari tempat tinggi atau terhempap runtuhan bangunan, atau lemas atau terbakar, dan aku berlindung kepada-Mu daripada gangguan syaitan ketika mati, dan aku berlindung kepada-Mu daripada mati dalam jalan-Mu ketika melarikan diri daripada medan perang, dan aku berlindung kepada-Mu daripada mati disebabkan sengatan kala jengking.\"",
        "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ صَيْفِيٍّ مَوْلَى أَبِي أَيُّوبَ، ‏‏‏‏‏‏عَنْ أَبِي الْيَسَرِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ التَّرَدِّي وَالْهَدْمِ وَالْغَرَقِ وَالْحَرِيقِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ أَنْ يَتَخَبَّطَنِي الشَّيْطَانُ عِنْدَ الْمَوْتِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ أَنْ أَمُوتَ فِي سَبِيلِكَ مُدْبِرًا، ‏‏‏‏‏‏وَأَعُوذُ بِكَ أَنْ أَمُوتَ لَدِيغًا ."
      },
      {
        "id": 40522,
        "hadith_number": "5534",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Rasulullah SAW daripada Kemudaratan",
        "perawi_melayu": "Abu Al-Yasar",
        "english_text": "It was narrated from Abu Al-Yasar that : The Messenger of Allah [SAW] used to supplicate and say: Allahumma inni a'udhu bika min al-harami, wat-taraddi, wal-hadmi, wal-ghammi, wal-hariqi, wal-gharaqi, wa a'udhu bika, an yatakhabbatanish-shaitanu 'indal-mawti, wa an uqtala fi sabilika mudbiran, wa a'udhu bika wa an amuta ladigha (O Allah, I seek refuge with You from old age, being thrown from a high place, being crushed by a falling wall, distress, burning and drowning. I seek refuge with You from being led astray by the Shaitan at the time of death and from being killed in Your cause while fleeing from the battlefield. I seek refuge with You from dying of a scorpion sting.)",
        "malay_translation": "Daripada Abu Al-Yasar, bahawa Rasulullah SAW  berdoa dengan berkata:  \"Ya Allah, aku berlindung kepada-Mu daripada tua, daripada terjatuh dari tempat tinggi, daripada terhempap runtuhan bangunan, daripada kesusahan, daripada kebakaran, dan daripada lemas.  Aku berlindung kepada-Mu daripada gangguan syaitan ketika hendak mati, daripada terbunuh dalam jalan-Mu ketika melarikan diri, dan daripada mati disebabkan sengatan kala jengking.\"",
        "arabic_text": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي أَنَسُ بْنُ عِيَاضٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ صَيْفِيٍّ، ‏‏‏‏‏‏عَنْ أَبِي الْيَسَرِ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو، ‏‏‏‏‏‏فَيَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَرَمِ وَالتَّرَدِّي، ‏‏‏‏‏‏وَالْهَدْمِ وَالْغَمِّ، ‏‏‏‏‏‏وَالْحَرِيقِ وَالْغَرَقِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ أَنْ يَتَخَبَّطَنِي الشَّيْطَانُ عِنْدَ الْمَوْتِ، ‏‏‏‏‏‏وَأَنْ أُقْتَلَ فِي سَبِيلِكَ مُدْبِرًا، ‏‏‏‏‏‏وَأَعُوذُ بِكَ أَنْ أَمُوتَ لَدِيغًا ."
      },
      {
        "id": 40523,
        "hadith_number": "5535",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Rasulullah SAW daripada pelbagai bencana",
        "perawi_melayu": "Abu Al-Aswad Al-Sulami",
        "english_text": "It was narrated that Abu Al-Aswad Al-Sulami said: The Messenger of Allah [SAW] used to say: 'Allahumma inni a'udhu bika minal-hadmi, wa a'udhu bika minat-taraddi, wa a'udhu bika minal-gharaqi, wal-hariqi, wa a'udhu bika an yatakhabbatanish-shaitanu 'indal-mawti, wa a'udhu bika an amuta fi sabilika mudbiran, wa a'udhu bika an amuta ladigha (O Allah, I seek refuge in You from being crushed by a falling wall, and I seek refuge with You from drowning or being burned, and I seek refuge with You from being led astray by the Shaitan at the time of death, and I seek refuge with You from being killed for Your sake while fleeing the battlefield, and I seek refuge with You from dying of a scorpion sting.)'",
        "malay_translation": "Daripada Abu Al-Aswad Al-Sulami, bahawa Rasulullah SAW selalu berdoa: \"Ya Allah, aku berlindung kepadaMu daripada ditimpa runtuhan bangunan, dan aku berlindung kepadaMu daripada terjatuh dari tempat tinggi, dan aku berlindung kepadaMu daripada lemas dan kebakaran, dan aku berlindung kepadaMu daripada gangguan syaitan ketika hendak mati, dan aku berlindung kepadaMu daripada mati syahid ketika melarikan diri daripada medan perang, dan aku berlindung kepadaMu daripada mati kerana sengatan kala jengking.\"",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي صَيْفِيٌّ مَوْلَى أَبِي أَيُّوبَ الْأَنْصَارِيُّ، ‏‏‏‏‏‏عَنْ أَبِي الْأَسْوَدِ السُّلَمِيِّ،‏‏‏‏ هَكَذَا قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَدْمِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنَ التَّرَدِّي، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنَ الْغَرَقِ وَالْحَرِيقِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ أَنْ يَتَخَبَّطَنِي الشَّيْطَانُ عِنْدَ الْمَوْتِ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ أَنْ أَمُوتَ فِي سَبِيلِكَ مُدْبِرًا، ‏‏‏‏‏‏وَأَعُوذُ بِكَ أَنْ أَمُوتَ لَدِيغًا ."
      },
      {
        "id": 40524,
        "hadith_number": "5536",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa Rasulullah SAW ketika bersujud",
        "perawi_melayu": "Aisyah رضي الله عنها",
        "english_text": "It was narrated that 'Aishah said: I looked for the Messenger of Allah [SAW] one night in my bed, and I did not find him. I struck my hand on the head of the bed, and my hand fell on the soles of his feet. He was prostrating and saying: 'A'udhu bi 'afwika min 'iqabika, wa a'udhu bi ridaka min sakhatika, wa a'udhu bika minka (I seek refuge in Your forgiveness from Your punishment, and I seek refuge in Your pleasure from Your wrath, and I seek refuge in You from You.)'",
        "malay_translation": "Daripada Aisyah رضي الله عنها, beliau berkata:  Pada suatu malam, aku mencari Rasulullah SAW di tempat tidurku, tetapi aku tidak menjumpainya.  Aku meraba kepala katil, dan tanganku terkena tapak kakinya.  Ruparupanya baginda sedang bersujud dan berdoa:  \"أَعُوذُ بِعَفْوِكَ مِنْ عِقَابِكَ، وَأَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَأَعُوذُ بِكَ مِنْكَ (A'udhu bi 'afwika min 'iqabika, wa a'udhu bi ridaka min sakhatika, wa a'udhu bika minka)  (Aku berlindung dengan keampunan-Mu daripada azab-Mu, dan aku berlindung dengan keredaan-Mu daripada kemurkaan-Mu, dan aku berlindung dengan-Mu daripada diri-Ku sendiri.\"",
        "arabic_text": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي الْعَلَاءُ بْنُ هِلَالٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عُبَيْدُ اللَّهِ، ‏‏‏‏‏‏عَنْ زَيْدٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ مُرَّةَ، ‏‏‏‏‏‏عَنْ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ مَسْرُوقِ بْنِ الْأَجْدَعِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ طَلَبْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ فِي فِرَاشِي، ‏‏‏‏‏‏فَلَمْ أُصِبْهُ،‏‏‏‏ فَضَرَبْتُ بِيَدِي عَلَى رَأْسِ الْفِرَاشِ فَوَقَعَتْ يَدِي عَلَى أَخْمَصِ قَدَمَيْهِ فَإِذَا هُوَ سَاجِدٌ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ أَعُوذُ بِعَفْوِكَ مِنْ عِقَابِكَ، ‏‏‏‏‏‏وَأَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، ‏‏‏‏‏‏وَأَعُوذُ بِكَ مِنْكَ ."
      },
      {
        "id": 40525,
        "hadith_number": "5537",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Amalan Rasulullah SAW Membuka Qiamullail",
        "perawi_melayu": "Asim bin Humaid",
        "english_text": "It was narrated that 'Asim bin Humaid said: I asked 'Aishah with what the Messenger of Allah [SAW] would start Qiyam Al-Lail. She said: 'You have asked me about something that no one else has asked me about. He used to say Allahu Akbar ten times, and Subhan-Allah ten times, and Istaghfir-Allah ten times, and he would say, Allahummaghfirli, wahdini, warzuqni, wa'afini (O Allah, forgive me, guide me, grant me provision and give me good health,) and he would seek refuge from the difficulty of the standing on the Day of Resurrection.'",
        "malay_translation": "Daripada riwayat Asim bin Humaid: Aku bertanya kepada Aisyah tentang bagaimana Rasulullah SAW memulakan Qiamullail.  Beliau berkata: \"Engkau bertanya kepadaku sesuatu yang tidak pernah ditanyakan oleh sesiapa pun kepadaku. Baginda selalu bertakbir (Allahu Akbar) sepuluh kali, bertahmid (Subhanallah) sepuluh kali, dan istighfar (Astaghfirullah) sepuluh kali.  Kemudian Baginda berdoa:  \"Allahummaghfirli, wahdini, warzuqni, wa'afini\" (Ya Allah, ampunkanlah aku, berilah petunjuk kepadaku, kurniakan rezeki kepadaku, dan berikanlah kesihatan yang baik kepadaku). Dan Baginda memohon perlindungan daripada kesusahan berdiri pada hari kiamat.\"",
        "arabic_text": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، ‏‏‏‏‏‏أَنَّ مُعَاوِيَةَ بْنَ صَالِحٍ حَدَّثَهُ، ‏‏‏‏‏‏وَحَدَّثَنِي أَزْهَرُ بْنُ سَعِيدٍ، ‏‏‏‏‏‏يُقَالُ لَهُ:‏‏‏‏ الْحَرَازِيُّ شَامِيٌّ عَزِيز الْحَدِيث، ‏‏‏‏‏‏عَنْ عَاصِمِ بْنِ حُمَيْدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَأَلْتُ عَائِشَةَ:‏‏‏‏ بِمَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْتَتِحُ قِيَامَ اللَّيْلِ ؟، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ سَأَلْتَنِي عَنْ شَيْءٍ مَا سَأَلَنِي عَنْهُ أَحَدٌ،‏‏‏‏ كَانَ يُكَبِّرُ عَشْرًا، ‏‏‏‏‏‏وَيُسَبِّحُ عَشْرًا، ‏‏‏‏‏‏وَيَسْتَغْفِرُ عَشْرًا، ‏‏‏‏‏‏وَيَقُولُ:‏‏‏‏ اللَّهُمَّ اغْفِرْ لِي، ‏‏‏‏‏‏وَاهْدِنِي، ‏‏‏‏‏‏وَارْزُقْنِي، ‏‏‏‏‏‏وَعَافِنِي، ‏‏‏‏‏‏وَيَتَعَوَّذُ مِنْ ضِيقِ الْمَقَامِ يَوْمَ الْقِيَامَةِ ."
      },
      {
        "id": 40526,
        "hadith_number": "5538",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa memohon perlindungan daripada ilmu yang tidak bermanfaat",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "It was narrated from Sa'eed, from Abu Hurairah who said: The Messenger of Allah [SAW] said: 'Allahumma inni a'udhu bika min 'ilmin la yanfa'u, wa min qalbin la yakhsha'u, wa min nafsin la tashba'u, wa min du'a'in la yusma' (O Allah, I seek refuge with You from knowledge that is of no benefit, a heart that is not humble, a soul that is not satisfied and a supplication that is not heard.)'",
        "malay_translation": "Daripada Sa'eed, melalui Abu Hurairah, yang berkata bahawa Rasulullah SAW bersabda:  'Allahumma inni a'udzu bika min 'ilmin la yanfa'u, wa min qalbin la yakhsha'u, wa min nafsin la tashba'u, wa min du'a'in la yusma' (Ya Allah, aku berlindung kepada-Mu daripada ilmu yang tidak bermanfaat, hati yang tidak khusyuk, jiwa yang tidak pernah merasa cukup, dan doa yang tidak dimakbulkan).' ",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ آدَمَ، ‏‏‏‏‏‏عَنْ أَبِي خَالِدٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ عَجْلَانَ، ‏‏‏‏‏‏عَنْ سَعِيدٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ، ‏‏‏‏‏‏وَمِنْ قَلْبٍ لَا يَخْشَعُ، ‏‏‏‏‏‏وَمِنْ نَفْسٍ لَا تَشْبَعُ، ‏‏‏‏‏‏وَمِنْ دُعَاءٍ لَا يُسْمَعُ ،‏‏‏‏ قَالَ أَبُو عَبْد الرَّحْمَنِ:‏‏‏‏ سَعِيدٌ لَمْ يَسْمَعْهُ مِنْ أَبِي هُرَيْرَةَ بَلْ سَمِعَهُ مِنْ أَخِيهِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ."
      },
      {
        "id": 40527,
        "hadith_number": "5539",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa Mencari Perlindungan daripada Ilmu yang Tidak Bermanfaat",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah said: The Messenger of Allah [SAW] used to say: 'Allahumma inni a'udhu bika min 'ilmin la yanfa'u, wa min qalbin la yakhsha'u, wa min nafsin la tashba'u, wa min du'a'in la yusma' (O Allah, I seek refuge with You from knowledge that is of no benefit, a heart that is not humble, a soul that is not satisfied and a supplication that is not heard.)'",
        "malay_translation": "Abu Hurairah berkata: Rasulullah SAW selalu berdoa: \"Allahumma inni a'udzu bika min 'ilmin la yanfa'u, wa min qalbin la yakhsha'u, wa min nafsin la tashba'u, wa min du'a'in la yusma' (Ya Allah, aku berlindung kepada-Mu daripada ilmu yang tidak bermanfaat, hati yang tidak khusyuk, jiwa yang tidak pernah merasa puas, dan doa yang tidak dimakbul).\"",
        "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ فَضَالَةَ بْنِ إِبْرَاهِيمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا يَحْيَى يَعْنِي ابْنَ يَحْيَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، ‏‏‏‏‏‏عَنْ أَخِيهِ عَبَّادِ بْنِ أَبِي سَعِيدٍ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ،‏‏‏‏ يَقُولُ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ، ‏‏‏‏‏‏وَمِنْ قَلْبٍ لَا يَخْشَعُ، ‏‏‏‏‏‏وَمِنْ نَفْسٍ لَا تَشْبَعُ، ‏‏‏‏‏‏وَمِنْ دُعَاءٍ لَا يُسْمَعُ ."
      },
      {
        "id": 40528,
        "hadith_number": "5540",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Doa Pemeliharaan Diri daripada Kelemahan dan Kekurangan",
        "perawi_melayu": "Abdullah bin Al-Harith",
        "english_text": "It was narrated that 'Abdullah bin Al-Harith said: When it was said to Zaid bin Arqam: 'Tell us what you heard from the Messenger of Allah [SAW], he said: I will not tell you anything but that which the Messenger of Allah [SAW] commanded us to say: 'Allahumma inni a'udhu bika min al-'ajzi wal-kasali, wal-bukhli, wal-jubni, wal-harami, wa 'adhabil-qabri. Allahumma at nafsi taqwaha, wa zakkaha anta khairu min zakkaha, anta waliyyuha wa mawlaha. Allahumma inni a'udhu bika min nafsin la tashba'u wa min qalbin la yakhsha'u wa min 'ilmin la yanfa'u wa du'a'in la yustajab (O Allah, I seek refuge in You from incapacity, laziness, miserliness, cowardice, old age, the torment of the grave. O Allah, make my soul obedient and purify it, for You are the best One to purify it, You are its Guardian and Lord. O Allah, I seek refuge in You from a soul that is not satisfied, a heart that is not humble, knowledge that is of no benefit and a supplication that is not answered.)'",
        "malay_translation": "Telah diriwayatkan bahawa Abdullah bin Al-Harith berkata:  Apabila dikatakan kepada Zaid bin Arqam: 'Ceritakan kepada kami apa yang engkau dengar daripada Rasulullah SAW', beliau berkata: Aku tidak akan menceritakan kepada kamu melainkan apa yang Rasulullah SAW perintahkan kami untuk menyebut:  'Allahumma inni a'udzu bika min al-'ajzi wal-kasali, wal-bukhli, wal-jubni, wal-harami, wa 'adhabil-qabri. Allahumma at nafsi taqwaha, wa zakkaha anta khairu min zakkaha, anta waliyyuha wa mawlaha. Allahumma inni a'udzu bika min nafsin la tashba'u wa min qalbin la yakhsha'u wa min 'ilmin la yanfa'u wa du'a'in la yustajab (Ya Allah, aku berlindung kepada-Mu daripada kelemahan, kemalasan, kedekut, sifat pengecut, tua, dan azab kubur. Ya Allah, berikanlah kepada jiwaku ketaqwaan, dan sucikanlah ia, kerana Engkau adalah sebaik-baik yang menyucikannya, Engkau adalah pelindung dan pemiliknya. Ya Allah, aku berlindung kepada-Mu daripada jiwa yang tidak pernah merasa cukup, hati yang tidak tunduk, ilmu yang tidak bermanfaat, dan doa yang tidak dimakbulkan.)'",
        "arabic_text": "أَخْبَرَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏عَنْ ابْنِ فُضَيْلٍ، ‏‏‏‏‏‏عَنْ عَاصِمِ بْنِ سُلَيْمَانَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ إِذَا قِيلَ لِزَيْدِ بْنِ أَرْقَمَ:‏‏‏‏ حَدِّثْنَا مَا سَمِعْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ لَا أُحَدِّثُكُمْ إِلَّا مَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنَا بِهِ، ‏‏‏‏‏‏وَيَأْمُرُنَا أَنْ نَقُولَ:‏‏‏‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، ‏‏‏‏‏‏وَالْبُخْلِ وَالْجُبْنِ، ‏‏‏‏‏‏وَالْهَرَمِ، ‏‏‏‏‏‏وَعَذَابِ الْقَبْرِ، ‏‏‏‏‏‏اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا، ‏‏‏‏‏‏وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، ‏‏‏‏‏‏أَنْتَ وَلِيُّهَا وَمَوْلَاهَا، ‏‏‏‏‏‏اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ نَفْسٍ لَا تَشْبَعُ، ‏‏‏‏‏‏وَمِنْ قَلْبٍ لَا يَخْشَعُ، ‏‏‏‏‏‏وَمِنْ عِلْمٍ لَا يَنْفَعُ، ‏‏‏‏‏‏وَدَعْوَةٍ لَا تُسْتَجَابُ ."
      },
      {
        "id": 40529,
        "hadith_number": "5541",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Doa Nabi SAW ketika keluar rumah",
        "perawi_melayu": "Umm Salamah",
        "english_text": "It was narrated from Umm Salamah that: When the Prophet [SAW] went out of his house, he said: Bismillahi Rabbi. A'udhu bika min an azilla aw adilla aw azlima aw uzlama, aw ajhala aw yujhala 'alayya (In the name of Allah my Lord, I seek refuge in You from falling into error or going astray, or wronging (others) or being wronged, and from behaving or being treated in an ignorant manner.)",
        "malay_translation": "Daripada Umm Salamah, diriwayatkan bahawa: apabila Nabi SAW keluar dari rumahnya, baginda bersabda:  Bismillahi Rabbi, a'udzu bika min an azilla aw adilla aw azlima aw uzlama, aw ajhala aw yujhala 'alayya (Dengan nama Allah Tuhanku, aku berlindung kepada-Mu daripada tergelincir atau tersesat, atau menzalimi (orang lain) atau dizalimi, dan daripada berkelakuan bodoh atau diperlakukan dengan kebodohan).",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ مَنْصُورٍ، ‏‏‏‏‏‏عَنِ الشَّعْبِيِّ، ‏‏‏‏‏‏عَنْ أُمِّ سَلَمَةَ، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا خَرَجَ مِنْ بَيْتِهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ بِسْمِ اللَّهِ رَبِّ، ‏‏‏‏‏‏أَعُوذُ بِكَ مِنْ أَنْ أَزِلَّ أَوْ أَضِلَّ، ‏‏‏‏‏‏أَوْ أَظْلِمَ أَوْ أُظْلَمَ، ‏‏‏‏‏‏أَوْ أَجْهَلَ أَوْ يُجْهَلَ عَلَيَّ ."
      }
    ]
  }
}