{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 88,
    "data": [
      {
        "id": 39354,
        "hadith_number": "4366",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Larangan Mencukur Rambut dan Memotong Kuku Sebelum Korban",
        "perawi_melayu": "Umm Salamah (semoga Allah meredhainya)",
        "english_text": "It was narrated from Ummm Salamah that the Prophet said: Whoever sees the new crescent of Dhul-Hijjah and wants to offer a sacrifice, let him not remove any of his hair or nails until he has offered the sacrifice.",
        "malay_translation": "Diriwayatkan daripada Ummu Salamah (semoga Allah meredhainya), bahawa Nabi (SAW) bersabda: \"Sesiapa yang melihat anak bulan Zulhijjah dan ingin berkorban, maka janganlah dia mengambil (mencukur) rambutnya dan memotong kukunya sehingga dia selesai berkorban.\"",
        "arabic_text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ سَلْمٍ الْبَلْخِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا النَّضْرُ وَهُوَ ابْنُ شُمَيْلٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ مَالِكِ بْنِ أَنَسٍ، ‏‏‏‏‏‏عَنِ ابْنِ مُسْلِمٍ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، ‏‏‏‏‏‏عَنْ أُمِّ سَلَمَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ رَأَى هِلَالَ ذِي الْحِجَّةِ فَأَرَادَ أَنْ يُضَحِّيَ فَلَا يَأْخُذْ مِنْ شَعْرِهِ، ‏‏‏‏‏‏وَلَا مِنْ أَظْفَارِهِ حَتَّى يُضَحِّيَ ."
      },
      {
        "id": 39355,
        "hadith_number": "4367",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Larangan Memotong Kuku dan Rambut bagi yang Ingin Berkorban",
        "perawi_melayu": "Umm Salamah (semoga Allah meredhainya)",
        "english_text": "It was narrated that 'Amr bin Muslim said: Ibn Al-Musayyab told me that Umm Salamah, the wife of the Prophet told him that the Messenger of Allah said: 'Whoever wants to offer a sacrifice, let him not remove anything from his nails or cut his hair for the first ten days Dhul-Jijjah. '",
        "malay_translation": "Diriwayatkan daripada 'Amr bin Muslim berkata: Ibnu Al-Musayyab memberitahu saya bahawa Umm Salamah, isteri Nabi ﷺ memberitahunya bahawa Rasulullah ﷺ bersabda: 'Sesiapa yang ingin berkorban, janganlah dia memotong apa-apa daripada kukunya atau memotong rambutnya pada sepuluh hari pertama Zulhijjah.'",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ، ‏‏‏‏‏‏عَنْ شُعَيْبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا اللَّيْثُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا خَالِدُ بْنُ يَزِيدَ، ‏‏‏‏‏‏عَنِ ابْنِ أَبِي هِلَالٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ مُسْلِمٍ، ‏‏‏‏‏‏أَنَّهُ قَالَ:‏‏‏‏ أَخْبَرَنِي ابْنُ الْمُسَيَّبِ، ‏‏‏‏‏‏أَنَّ أُمَّ سَلَمَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَتْهُ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ أَرَادَ أَنْ يُضَحِّيَ فَلَا يَقْلِمْ مِنْ أَظْفَارِهِ، ‏‏‏‏‏‏وَلَا يَحْلِقْ شَيْئًا مِنْ شَعْرِهِ فِي عَشْرِ الْأُوَلِ مِنْ ذِي الْحِجَّةِ ."
      },
      {
        "id": 39356,
        "hadith_number": "4368",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Larangan Mengambil Rambut dan Kuku Semasa Awal Zulhijjah Bagi yang Berkorban",
        "perawi_melayu": "Sa'eed bin Al-Musayyab",
        "english_text": "It was narrated that Sa'eed bin Al-Musayyab said: Whoever wants to offer a sacrifice when dhul-Hijjah begins, let him not remove anything from his hair or nails. I (the narrator) mentioned that to 'Ikrimah, and he said: Should he not also keep away from women and perfume?",
        "malay_translation": "Diriwayatkan bahawa Sa'eed bin Al-Musayyab berkata: Sesiapa yang ingin melaksanakan ibadah korban apabila bermulanya bulan Zulhijjah, janganlah dia mengambil apa-apa daripada rambutnya atau kukunya. Aku (perawi) menyebutkan hal itu kepada 'Ikrimah, dan dia berkata: Patutkah dia tidak juga menjauhi wanita dan wangian?",
        "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا شَرِيكٌ، ‏‏‏‏‏‏عَنْ عُثْمَانَ الْأَحْلَافِيِّ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَنْ أَرَادَ أَنْ يُضَحِّيَ فَدَخَلَتْ أَيَّامُ الْعَشْرِ، ‏‏‏‏‏‏فَلَا يَأْخُذْ مِنْ شَعْرِهِ، ‏‏‏‏‏‏وَلَا أَظْفَارِهِ . فَذَكَرْتُهُ لِعِكْرِمَةَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَلَا يَعْتَزِلُ النِّسَاءَ، ‏‏‏‏‏‏وَالطِّيبَ."
      },
      {
        "id": 39357,
        "hadith_number": "4369",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Larangan Memotong Rambut dan Kulit Semasa 10 Awal Zulhijjah",
        "perawi_melayu": "Umm Salamah (semoga Allah meredhainya)",
        "english_text": "It was narrated from Umm Salamah that the Messenger of Allah said: when the (first) ten (days of Dhul-Jijjah) begin, and one of you wants to offer a sacrifice, let him not remove anything from his hair or skin.",
        "malay_translation": "Diriwayatkan daripada Umm Salamah (semoga Allah meredhainya) bahawa Rasulullah ﷺ bersabda: \"Apabila sepuluh (hari pertama Zulhijjah) bermula, dan sesiapa di antara kamu ingin melaksanakan ibadah korban, maka janganlah dia mengambil (memotong) apa-apa pun daripada rambut atau kulitnya.\"",
        "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، ‏‏‏‏‏‏عَنْ أُمِّ سَلَمَةَ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِذَا دَخَلَتِ الْعَشْرُ فَأَرَادَ أَحَدُكُمْ أَنْ يُضَحِّيَ فَلَا يَمَسَّ مِنْ شَعْرِهِ، ‏‏‏‏‏‏وَلَا مِنْ بَشَرِهِ شَيْئًا ."
      },
      {
        "id": 39358,
        "hadith_number": "4370",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Arahan Rasulullah SAW Mengenai Hari Raya Aidiladha dan Korban",
        "perawi_melayu": "'Abdullah bin 'Amr bin al-'As",
        "english_text": "It was narrated from 'Abdullah bin 'Amr bin al-As that the Messenger of Allah said to a man: I have been instructed to take the Day of Sacrifice as an 'Id which Allah, the Might and Sublime, has ordained for this Ummah. The man said: What do you think if I cannot find anything but a female sheep that has been loaned to me so that I may benefit from its milk - should I sacrifice it? He said: No. Rather cut something from your hair and your nails, trim your mustache and shave your pubic hairs, and you will have a complete reward with Allah, the Might and Sublime, as if you had offered the sacrifice.",
        "malay_translation": "Diriwayatkan daripada 'Abdullah bin 'Amr bin al-'As bahawa Rasulullah SAW bersabda kepada seorang lelaki: \"Aku telah diperintahkan untuk menjadikan Hari Korban sebagai 'Id (perayaan) yang Allah SWT telah tetapkan untuk umat ini.\" Lelaki itu bertanya: \"Apakah pendapatmu jika aku tidak mendapati apa-apa kecuali seekor kambing betina yang telah dipinjamkan kepadaku supaya aku boleh mengambil manfaat daripada susunya - patutkah aku menyembelihnya?\" Baginda bersabda: \"Tidak. Akan tetapi, potonglah sedikit daripada rambutmu dan kukumu, pendekkan misaimu dan cukurlah bulu ari-arimu, dan engkau akan mendapat ganjaran yang sempurna di sisi Allah SWT seolah-olah engkau telah melakukan korban.\"",
        "arabic_text": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي سَعِيدُ بْنُ أَبِي أَيُّوبَ، ‏‏‏‏‏‏وَذَكَرَ آخَرِينَ، ‏‏‏‏‏‏عَنْ عَيَّاشِ بْنِ عَبَّاسٍ الْقِتْبَانِيِّ، ‏‏‏‏‏‏عَنْ عِيسَى بْنِ هِلَالٍ الصَّدَفِيِّ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِرَجُلٍ:‏‏‏‏ أُمِرْتُ بِيَوْمِ الْأَضْحَى عِيدًا جَعَلَهُ اللَّهُ عَزَّ وَجَلَّ لِهَذِهِ الْأُمَّةِ ، ‏‏‏‏‏‏فَقَالَ الرَّجُلُ:‏‏‏‏ أَرَأَيْتَ إِنْ لَمْ أَجِدْ إِلَّا مَنِيحَةً أُنْثَى،‏‏‏‏ أَفَأُضَحِّي بِهَا ؟، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا، ‏‏‏‏‏‏وَلَكِنْ تَأْخُذُ مِنْ شَعْرِكَ، ‏‏‏‏‏‏وَتُقَلِّمُ أَظْفَارَكَ، ‏‏‏‏‏‏وَتَقُصُّ شَارِبَكَ، ‏‏‏‏‏‏وَتَحْلِقُ عَانَتَكَ، ‏‏‏‏‏‏فَذَلِكَ تَمَامُ أُضْحِيَّتِكَ عِنْدَ اللَّهِ عَزَّ وَجَلَّ ."
      },
      {
        "id": 39359,
        "hadith_number": "4371",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Nabi ﷺ Menyembelih di Tempat Solat",
        "perawi_melayu": "Nafi meriwayatkan daripada 'Abdullah",
        "english_text": "It was narrated from Nafi that: 'Abdullah told him that the Messenger of Allah used to offer the sacrifice at the prayer place.",
        "malay_translation": "Diriwayatkan daripada Nafi bahawa: 'Abdullah memberitahunya bahawa Rasulullah ﷺ selalu melakukan korban di tempat solat.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ، ‏‏‏‏‏‏عَنْ شُعَيْبٍ، ‏‏‏‏‏‏عَنِ اللَّيْثِ، ‏‏‏‏‏‏عَنْ كَثِيرِ بْنِ فَرْقَدٍ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏أَنَّ عَبْدَ اللَّهِ أَخْبَرَهُ:‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَذْبَحُ، ‏‏‏‏‏‏أَوْ يَنْحَرُ بِالْمُصَلَّى ."
      },
      {
        "id": 39360,
        "hadith_number": "4372",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Nabi SAW Berkorban di Hari Raya Aidiladha di Madinah",
        "perawi_melayu": "'Abdullah bin 'Umar",
        "english_text": "It was narrated from 'Abdullah bin 'Umar that: the Messenger of Allah offered the sacrifice obn the Day of Sacrifice in Al-Madinah. He said: if he did not offer the Nahr (sacrifice a camel) he would have offered Dhabihah (Sacrificed a sheep) at the prayer place.",
        "malay_translation": "Diriwayatkan daripada 'Abdullah bin 'Umar bahawa: Rasulullah SAW telah berkorban pada Hari Raya Aidiladha di Al-Madinah. Baginda bersabda: Jika baginda tidak melakukan Nahr (berkorban unta), nescaya baginda akan melakukan Dhabihah (berkorban kambing) di tempat solat.",
        "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ عُثْمَانَ النُّفَيْلِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا سَعِيدُ بْنُ عِيسَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا الْمُفَضَّلُ بْنُ فَضَالَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي نَافِعٌ،‏‏‏‏ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ:‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحَرَ يَوْمَ الْأَضْحَى بِالْمَدِينَةِ ،‏‏‏‏ قَالَ:‏‏‏‏ وَقَدْ كَانَ إِذَا لَمْ يَنْحَرْ يَذْبَحُ بِالْمُصَلَّى."
      },
      {
        "id": 39361,
        "hadith_number": "4373",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Perintah Menyembelih Korban Selepas Solat Aidiladha",
        "perawi_melayu": "Jundub bin Sufyan",
        "english_text": "It was narrated that Jundub bin Sufyan said: I attended (the day of) sacrifice with the Messenger of Allah He led the people 9in prayer, then when he finished praying he saw some sheep that had been sacrificed. He said 'Whoever slaughtered (his sacrifice) before the prayer. Let him slaughtered (his sacrifice) before the prayer, let him slaughter a sheep in its place, and whoever has not slaughtered, let him offer a sacrifice in the name of Allah, the Mighty and Sublime. '",
        "malay_translation": "Diriwayatkan bahawa Jundub bin Sufyan berkata: Aku menghadiri (hari) korban bersama Rasulullah SAW. Baginda mengimamkan solat bersama orang ramai, kemudian apabila selesai solat, baginda melihat beberapa ekor kambing yang telah disembelih. Baginda bersabda, 'Sesiapa yang menyembelih (korban) sebelum solat, hendaklah dia menyembelih (korban) sebelum solat, hendaklah dia menyembelih seekor kambing sebagai ganti, dan sesiapa yang belum menyembelih, hendaklah dia menawarkan korban atas nama Allah, Yang Maha Perkasa lagi Maha Agung.'",
        "arabic_text": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي الْأَحْوَصِ، ‏‏‏‏‏‏عَنِ الْأَسْوَدِ بْنِ قَيْسٍ، ‏‏‏‏‏‏عَنْ جُنْدُبِ بْنِ سُفْيَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ شَهِدْتُ أَضْحًى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ فَصَلَّى بِالنَّاسِ، ‏‏‏‏‏‏فَلَمَّا قَضَى الصَّلَاةَ رَأَى غَنَمًا قَدْ ذُبِحَتْ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَنْ ذَبَحَ قَبْلَ الصَّلَاةِ فَلْيَذْبَحْ شَاةً مَكَانَهَا، ‏‏‏‏‏‏وَمَنْ لَمْ يَكُنْ ذَبَحَ فَلْيَذْبَحْ عَلَى اسْمِ اللَّهِ عَزَّ وَجَلَّ ."
      },
      {
        "id": 39362,
        "hadith_number": "4374",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Haiwan Korban yang Tidak Dibenarkan",
        "perawi_melayu": "Abu Ad-Dahhak 'Ubaid bin Fairuz",
        "english_text": "It was narrated that Abu Ad-Dahhak 'Ubaid bin Fairuz, the freed slave of Banu Shaiban, said: IU said to Al-Bara bin Azib: 'Tell me of the sacrificial animals that the Messenger of Allah disliked or forbade, He said: The Messenger of Allah stood up, and my hands are shorter than his, and he said: There are four that will not do as sacrifices: the animals that clearly has one bad eye: the sick animals that is obviously sick; the lame animal with an obvious limp; and the animal that is so emaciated that it is as if three is no marrow in its bones. ' I said: I dislike that the animals should have some fault in its horns or teeth' He said;'what you dislike, forget about it and do not make it for bidden to anyone.",
        "malay_translation": "Diriwayatkan daripada Abu Ad-Dahhak 'Ubaid bin Fairuz, bekas hamba kepada Bani Shaiban, beliau berkata: Aku berkata kepada Al-Bara bin Azib: 'Ceritakanlah kepadaku tentang haiwan korban yang tidak disukai atau dilarang oleh Rasulullah SAW.' Beliau berkata: Rasulullah SAW berdiri, dan tanganku lebih pendek daripada tangannya, lalu baginda bersabda: 'Ada empat (jenis haiwan) yang tidak boleh dijadikan korban: haiwan yang jelas buta sebelah matanya; haiwan yang sakit yang jelas kesakitannya; haiwan yang tempang yang jelas ketempangannya; dan haiwan yang terlalu kurus sehingga seolah-olah tidak ada sumsum dalam tulangnya.' Aku berkata: 'Aku tidak suka jika haiwan itu mempunyai kecacatan pada tanduk atau giginya.' Beliau berkata: 'Apa yang kamu tidak suka, lupakanlah dan janganlah mengharamkannya kepada sesiapa pun.'",
        "arabic_text": "أَخْبَرَنَا إِسْمَاعِيل بْنُ مَسْعُودٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا خَالِدٌ، ‏‏‏‏‏‏عَنْ شُعْبَةَ، ‏‏‏‏‏‏عَنْ سُلَيْمَانَ بْنِ عَبْدِ الرَّحْمَنِ مَوْلَى بَنِي أَسَدٍ، ‏‏‏‏‏‏عَنْ أَبِي الضَّحَّاكِ عُبَيْدِ بْنِ فَيْرُوزَ مَوْلَى بَنِي شَيْبَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ لِلْبَرَاءِ:‏‏‏‏ حَدِّثْنِي عَمَّا نَهَى عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنَ الْأَضَاحِيِّ. قَالَ:‏‏‏‏ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَيَدِي أَقْصَرُ مِنْ يَدِهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَرْبَعٌ لَا يَجُزْنَ:‏‏‏‏ الْعَوْرَاءُ الْبَيِّنُ عَوَرُهَا، ‏‏‏‏‏‏وَالْمَرِيضَةُ الْبَيِّنُ مَرَضُهَا، ‏‏‏‏‏‏وَالْعَرْجَاءُ الْبَيِّنُ ظَلْعُهَا، ‏‏‏‏‏‏وَالْكَسِيرَةُ الَّتِي لَا تُنْقِي . قُلْتُ:‏‏‏‏ إِنِّي أَكْرَهُ أَنْ يَكُونَ فِي الْقَرْنِ نَقْصٌ، ‏‏‏‏‏‏وَأَنْ يَكُونَ فِي السِّنِّ نَقْصٌ. قَالَ:‏‏‏‏ مَا كَرِهْتَهُ فَدَعْهُ، ‏‏‏‏‏‏وَلَا تُحَرِّمْهُ عَلَى أَحَدٍ."
      },
      {
        "id": 39363,
        "hadith_number": "4375",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Haiwan Korban yang Dilarang",
        "perawi_melayu": "Ubaid bin Fairuz",
        "english_text": "Ubaid bin Fairuz said: I said to Al-Bara bin Azib: 'Tell me of the sacrificial animals that the Messenger of Allah dislike or forbade. He said: The Messenger of Allah gestured like this with his hand, and my hands are shorter than the hand of the Messenger of Allah, (and he said). 'There are four that will not do as sacrifices: The animal that clearly has one bad eye: the sick animals that is obviously sick; the lame animal with an obvious lamp; and the animal that is so emaciated that it is as if there is no marrow in its bones: He said: And I dislike that the animal should have some fault in its horns or ears. He said: What you dislike, forget about it, and do not make it forbidden to anyone.",
        "malay_translation": "Ubaid bin Fairuz berkata: Aku berkata kepada Al-Bara bin Azib: 'Ceritakan kepadaku tentang haiwan korban yang Rasulullah ﷺ tidak sukai atau larang.' Dia berkata: Rasulullah ﷺ membuat isyarat seperti ini dengan tangannya, dan tanganku lebih pendek daripada tangan Rasulullah ﷺ, (dan dia berkata): 'Ada empat (jenis haiwan) yang tidak boleh dijadikan korban: Haiwan yang jelas cacat sebelah matanya; haiwan yang sakit yang jelas sakitnya; haiwan yang tempang yang jelas ketempangannya; dan haiwan yang terlalu kurus sehingga seolah-olah tidak ada sumsum dalam tulangnya.' Dia berkata: Dan aku tidak suka jika haiwan itu mempunyai kecacatan pada tanduk atau telinganya. Dia berkata: Apa yang kamu tidak sukai, lupakanlah, dan jangan haramkan ia kepada sesiapa pun.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏وَأَبُو دَاوُدَ،‏‏‏‏ وَيَحْيَى، ‏‏‏‏‏‏وَعَبْدُ الرَّحْمَنِ، ‏‏‏‏‏‏وَابْنُ أَبِي عَدِيٍّ، ‏‏‏‏‏‏وَأَبُو الْوَلِيدِ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ أَنْبَأَنَا شُعْبَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ سُلَيْمَانَ بْنَ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ عُبَيْدَ بْنَ فَيْرُوزَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ لِلْبَرَاءِ بْنِ عَازِبٍ:‏‏‏‏ حَدِّثْنِي مَا كَرِهَ، ‏‏‏‏‏‏أَوْ نَهَى عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنَ الْأَضَاحِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ هَكَذَا بِيَدِهِ، ‏‏‏‏‏‏وَيَدِي أَقْصَرُ مِنْ يَدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَرْبَعَةٌ لَا يَجْزِينَ فِي الْأَضَاحِيِّ:‏‏‏‏ الْعَوْرَاءُ الْبَيِّنُ عَوَرُهَا، ‏‏‏‏‏‏وَالْمَرِيضَةُ الْبَيِّنُ مَرَضُهَا، ‏‏‏‏‏‏وَالْعَرْجَاءُ الْبَيِّنُ ظَلْعُهَا، ‏‏‏‏‏‏وَالْكَسِيرَةُ الَّتِي لَا تُنْقِي . قَالَ:‏‏‏‏ فَإِنِّي أَكْرَهُ أَنْ يَكُونَ نَقْصٌ فِي الْقَرْنِ، ‏‏‏‏‏‏وَالْأُذُنِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَمَا كَرِهْتَ مِنْهُ فَدَعْهُ، ‏‏‏‏‏‏وَلَا تُحَرِّمْهُ عَلَى أَحَدٍ."
      },
      {
        "id": 39364,
        "hadith_number": "4376",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Haiwan Korban yang Tidak Sah",
        "perawi_melayu": "Al-Bara' bin 'Azib",
        "english_text": "It was narrated from 'Ubaid bin Fairuz thatAl; -Bara bnin 'Azib said: I heard the Messenger of Allah say - and he gestured with his fingers, but his fingers were shorter than the fingers of the Messenger of Allah - he said It is not permissible to offer as a sacrifice an animal that clearly has one bad eye, a lame animal that is obviously lame, as sick animal that is obviously sick, or an animals that is so emaciated that it is as if there is no marrow in its bones.",
        "malay_translation": "Diriwayatkan daripada 'Ubaid bin Fairuz bahawa Al-Bara' bin 'Azib berkata: Aku mendengar Rasulullah SAW bersabda - dan baginda mengisyaratkan dengan jari-jarinya, namun jari-jariku lebih pendek daripada jari-jari Rasulullah SAW - baginda bersabda: Tidak boleh dijadikan korban haiwan yang jelas cacat matanya, haiwan yang tempang yang jelas ketempangannya, haiwan yang sakit yang jelas sakitnya, atau haiwan yang terlalu kurus sehingga seolah-olah tiada sumsum di dalam tulangnya.",
        "arabic_text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ، ‏‏‏‏‏‏عَنِ ابْنِ وَهْبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، ‏‏‏‏‏‏وَاللَّيْثُ بْنُ سَعْدٍ،‏‏‏‏ وَذَكَرَ آخَرَ، ‏‏‏‏‏‏وَقَدَّمَهُ أَنَّ سُلَيْمَانَ بْنَ عَبْدِ الرَّحْمَنِ حَدَّثَهُمْ، ‏‏‏‏‏‏عَنْ عُبَيْدِ بْنِ فَيْرُوزَ، ‏‏‏‏‏‏عَنِ الْبَرَاءِ بْنِ عَازِبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ وَأَشَارَ بِأَصَابِعِهِ، ‏‏‏‏‏‏وَأَصَابِعِي أَقْصَرُ مِنْ أَصَابِعِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يُشِيرُ أُصْبُعِهِ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ لَا يَجُوزُ مِنَ الضَّحَايَا:‏‏‏‏ الْعَوْرَاءُ الْبَيِّنُ عَوَرُهَا، ‏‏‏‏‏‏وَالْعَرْجَاءُ الْبَيِّنُ عَرَجُهَا، ‏‏‏‏‏‏وَالْمَرِيضَةُ الْبَيِّنُ مَرَضُهَا، ‏‏‏‏‏‏وَالْعَجْفَاءُ الَّتِي لَا تُنْقِي ."
      },
      {
        "id": 39365,
        "hadith_number": "4377",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Perintah Memeriksa Mata dan Telinga Haiwan Sembelihan",
        "perawi_melayu": "'Ali (Semoga Allah meredhainya)",
        "english_text": "It was narrated that 'Ali, may Allah be pleased with him, said: The Messenger of Allah commanded us to examine the eyes and ears (of animals), and no0t to sacrifice and animals with its ears slit from the front, and animal with its ears slit form the back, a animal with its tail cut, nor an animals with a round hole in its ear.",
        "malay_translation": "Diriwayatkan bahawa 'Ali, semoga Allah meredhainya, berkata: Rasulullah (SAW) memerintahkan kami untuk memeriksa mata dan telinga (haiwan), dan janganlah menyembelih haiwan yang telinganya terbelah dari hadapan, haiwan yang telinganya terbelah dari belakang, haiwan yang terpotong ekornya, mahupun haiwan yang mempunyai lubang bulat di telinganya.",
        "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ آدَمَ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحِيمِ وَهُوَ ابْنُ سُلَيْمَانَ، ‏‏‏‏‏‏عَنْ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنْ شُرَيْحِ بْنِ النُّعْمَانِ، ‏‏‏‏‏‏عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَسْتَشْرِفَ الْعَيْنَ وَالْأُذُنَ، ‏‏‏‏‏‏وَأَنْ لَا نُضَحِّيَ بِمُقَابَلَةٍ، ‏‏‏‏‏‏وَلَا مُدَابَرَةٍ، ‏‏‏‏‏‏وَلَا بَتْرَاءَ، ‏‏‏‏‏‏وَلَا خَرْقَاءَ ."
      },
      {
        "id": 39366,
        "hadith_number": "4378",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Perintah Rasulullah SAW Mengenai Cacat Haiwan Korban",
        "perawi_melayu": "'Ali (RA)",
        "english_text": "It was narrated that 'Ali said: The Messenger of Allah commanded us to examine the eyes and ears (of animals) and not to Sacrifice and animal with a bad eye, nor an animal with its ears slit from the front, nor an animals with its ears slit form the back, nor an animal with a round hole in its ear.",
        "malay_translation": "Diriwayatkan bahawa 'Ali berkata: Rasulullah SAW memerintahkan kami untuk memeriksa mata dan telinga (haiwan) dan tidak menyembelih haiwan yang matanya cacat, tidak juga haiwan yang telinganya terbelah dari hadapan, tidak juga haiwan yang telinganya terbelah dari belakang, dan tidak juga haiwan yang telinganya berlubang bulat.",
        "arabic_text": "أَخْبَرَنَا أَبُو دَاوُدَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدِ بْنِ أَعْيَنَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا زُهَيْرٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو إِسْحَاق، ‏‏‏‏‏‏عَنْ شُرَيْحِ بْنِ النُّعْمَانِ، ‏‏‏‏‏‏قَالَ أَبُو إِسْحَاق:‏‏‏‏ وَكَانَ رَجُلَ صِدْقٍ، ‏‏‏‏‏‏عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَسْتَشْرِفَ الْعَيْنَ وَالْأُذُنَ، ‏‏‏‏‏‏وَأَنْ لَا نُضَحِّيَ بِعَوْرَاءَ، ‏‏‏‏‏‏وَلَا مُقَابَلَةٍ، ‏‏‏‏‏‏وَلَا مُدَابَرَةٍ، ‏‏‏‏‏‏وَلَا شَرْقَاءَ، ‏‏‏‏‏‏وَلَا خَرْقَاءَ ."
      },
      {
        "id": 39367,
        "hadith_number": "4379",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Larangan Mengorbankan Haiwan yang Cacat Telinganya",
        "perawi_melayu": "'Ali bin Abi Talib (Semoga Allah meredhainya)",
        "english_text": "It was narrated that 'Ali bin Abi Talib, may Allah be please with him, said: The Messenger of Allah forbade sacrificing an animals with its ears slit form the front, and animals with its ears slit form the back, and animal with its ears slit lengthwise, an animals with a round hole in tits ear, or an animals with its nose cut off",
        "malay_translation": "Diriwayatkan bahawa 'Ali bin Abi Talib (semoga Allah meredhainya) berkata: Rasulullah ﷺ melarang daripada mengorbankan haiwan yang telinganya terbelah dari hadapan, atau telinganya terbelah dari belakang, atau telinganya terbelah memanjang, atau haiwan yang berlubang bulat di telinganya, atau haiwan yang hidungnya terpotong.",
        "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ نَاصِحٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنْ شُرَيْحِ بْنِ النُّعْمَانِ، ‏‏‏‏‏‏عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نُضَحِّيَ بِمُقَابَلَةٍ، ‏‏‏‏‏‏أَوْ مُدَابَرَةٍ، ‏‏‏‏‏‏أَوْ شَرْقَاءَ، ‏‏‏‏‏‏أَوْ خَرْقَاءَ، ‏‏‏‏‏‏أَوْ جَدْعَاءَ ."
      },
      {
        "id": 39368,
        "hadith_number": "4380",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Larangan Mengorbankan Haiwan yang Cacat",
        "perawi_melayu": "'Ali bin Abi Talib (Semoga Allah meredhainya)",
        "english_text": "It was narrated from 'Ali bin Abi Talib, may Allah be please wityh him, that the messenger of Allah said: Do not sacrifice and animal with its ears slit from the front, and animal with its ears slit from the back, an animals with its ears slit lengthwise, and animal with a round hole in its ears, or an animal with one bad eye.",
        "malay_translation": "Diriwayatkan daripada 'Ali bin Abi Talib (Semoga Allah meredhainya), bahawa Rasulullah (s.a.w) bersabda: \"Janganlah kamu mengorbankan haiwan yang telinganya terbelah dari hadapan, haiwan yang telinganya terbelah dari belakang, haiwan yang telinganya terbelah memanjang, haiwan yang berlubang bulat pada telinganya, atau haiwan yang matanya cacat (buta sebelah).\"",
        "arabic_text": "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شُجَاعُ بْنُ الْوَلِيدِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي زِيَادُ بْنُ خَيْثَمَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو إِسْحَاق عَنْ شُرَيْحِ بْنِ النُّعْمَانِ، ‏‏‏‏‏‏عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا يُضَحَّى بِمُقَابَلَةٍ، ‏‏‏‏‏‏وَلَا مُدَابَرَةٍ، ‏‏‏‏‏‏وَلَا شَرْقَاءَ، ‏‏‏‏‏‏وَلَا خَرْقَاءَ، ‏‏‏‏‏‏وَلَا عَوْرَاءَ ."
      },
      {
        "id": 39369,
        "hadith_number": "4381",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Perintah Memeriksa Mata dan Telinga Haiwan Korban",
        "perawi_melayu": "Ali (RA)",
        "english_text": "Ali said: The Messenger of Allah commanded us to examine the eyes and ears (of animals for sacrifice).",
        "malay_translation": "Ali (RA) berkata: Rasulullah SAW memerintahkan kami untuk memeriksa mata dan telinga (haiwan untuk korban).",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا خَالِدٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شُعْبَةُ،‏‏‏‏ أَنَّ سَلَمَةَ وَهُوَ ابْنُ كُهَيْلٍ أَخْبَرَهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ حُجَيَّةَ بْنَ عَدِيٍّ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ سَمِعْتُ عَلِيًّا، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَسْتَشْرِفَ الْعَيْنَ، ‏‏‏‏‏‏وَالْأُذُنَ ."
      },
      {
        "id": 39370,
        "hadith_number": "4382",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Larangan Menyembelih Haiwan dengan Tanduk Patah",
        "perawi_melayu": "Ali (RA)",
        "english_text": "Ali said: Messenger of Allah forbade us from sacrificing an animal with a broken horn. I (the narrator) mentioned that to Sa'eed bin Al_Musayyab and he said: Yes, m unless half or more of the horn is missing.",
        "malay_translation": "Ali berkata: Rasulullah SAW melarang kami daripada menyembelih haiwan yang mempunyai tanduk yang patah. Aku (perawi) menyebut perkara itu kepada Sa'eed bin Al-Musayyab dan dia berkata: Ya, melainkan jika separuh atau lebih daripada tanduk itu hilang.",
        "arabic_text": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، ‏‏‏‏‏‏عَنْ سُفَيَانَ وَهُوَ ابْنُ حَبِيبٍ، ‏‏‏‏‏‏عَنْ شُعْبَةَ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ جُرَيِّ بْنِ كُلَيْبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ عَلِيًّا، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُضَحَّى بِأَعْضَبِ الْقَرْنِ . فَذَكَرْتُ ذَلِكَ لِسَعِيدِ بْنِ الْمُسَيِّبِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏إِلَّا عَضَبَ النِّصْفِ، ‏‏‏‏‏‏وَأَكْثَرَ مِنْ ذَلِكَ."
      },
      {
        "id": 39371,
        "hadith_number": "4383",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Larangan Menyembelih Kecuali Musinnah (dan Pengecualian)",
        "perawi_melayu": "Jabir (RA)",
        "english_text": "It was narrated that Jabir said: The Messenger of Allah said: 'Do not slaughter anything but a Musinnah, unless that is difficult, in which case you can slaughter a Jadh'ah sheep. '",
        "malay_translation": "Diriwayatkan bahawa Jabir berkata: Rasulullah ﷺ bersabda: 'Janganlah kamu menyembelih melainkan Musinnah, kecuali jika hal itu sukar, maka bolehlah kamu menyembelih seekor kambing Jadh'ah.'",
        "arabic_text": "أَخْبَرَنَا أَبُو دَاوُدَ سُلَيْمَانُ بْنُ سَيْفٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا الْحَسَنُ وَهُوَ ابْنُ أَعْيَنَ، ‏‏‏‏‏‏وَأَبُو جَعْفَرٍ يَعْنِي النُّفَيْلِيَّ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا زُهَيْرٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ جَابِرٍ، ‏‏‏‏‏‏قَالَ، ‏‏‏‏‏‏قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تَذْبَحُوا إِلَّا مُسِنَّةً إِلَّا أَنْ يَعْسُرَ عَلَيْكُمْ،‏‏‏‏ فَتَذْبَحُوا جَذَعَةً مِنَ الضَّأْنِ ."
      },
      {
        "id": 39372,
        "hadith_number": "4384",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Perintah Rasulullah SAW untuk Menyembelih Kambing Kecil",
        "perawi_melayu": "'Uqbah bin 'Amair (رَضِيَ اللَّهُ عَنْهُ)",
        "english_text": "It was narrated from 'Uqbah bin 'Amair that: the Messenger of Allah gave him some sheep to distribute among his Companions. A small goat was left over and he mentioned that to the Messenger of Allah. He said: Sacrifice it yourself.",
        "malay_translation": "Diriwayatkan daripada 'Uqbah bin 'Amair (رَضِيَ اللَّهُ عَنْهُ) bahawa: Rasulullah SAW memberikan beberapa ekor kambing kepadanya untuk dibahagikan kepada para sahabatnya. Seekor kambing kecil tinggal lebih, lalu beliau menyebutkan perkara itu kepada Rasulullah SAW. Baginda bersabda: \"Sembelihlah ia sendiri.\"",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا اللَّيْثُ، ‏‏‏‏‏‏عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، ‏‏‏‏‏‏عَنْ أَبِي الْخَيْرِ، ‏‏‏‏‏‏عَنْ عُقْبَةَ بْنِ عَامِرٍ،‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطَاهُ غَنَمًا يُقَسِّمُهَا عَلَى صَحَابَتِهِ، ‏‏‏‏‏‏فَبَقِيَ عَتُودٌ، ‏‏‏‏‏‏فَذَكَرَهُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ ضَحِّ بِهِ أَنْتَ ."
      },
      {
        "id": 39373,
        "hadith_number": "4385",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Nabi SAW Membahagi Haiwan Korban dan Membenarkan Jadh'ah Disembelih",
        "perawi_melayu": "'Uqbah bin 'Amir",
        "english_text": "It was narrated from 'Uqbah bin 'Amir that: the Messenger of Allah divided some sacrificial animals among his Companions, and I got a Jadh'ah sheep. I said: 'O Messenger of Allah, I got a Jadh'ah sheep.' He said: 'Sacrifice it.'",
        "malay_translation": "Diriwayatkan daripada 'Uqbah bin 'Amir bahawa: Rasulullah SAW membahagikan beberapa haiwan korban di kalangan para sahabatnya, dan saya mendapat seekor kambing Jadh'ah. Saya berkata: 'Wahai Rasulullah, saya mendapat seekor kambing Jadh'ah.' Baginda bersabda: 'Sembelihlah ia.'",
        "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ دُرُسْتَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو إِسْمَاعِيل وَهُوَ الْقَنَّادُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي بَعْجَةُ بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ عُقْبَةَ بْنِ عَامِرٍ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَسَّمَ بَيْنَ أَصْحَابِهِ ضَحَايَا، ‏‏‏‏‏‏فَصَارَتْ لِي جَذَعَةٌ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏ صَارَتْ لِي جَذَعَةٌ ؟ فَقَالَ:‏‏‏‏ ضَحِّ بِهَا ."
      },
      {
        "id": 39374,
        "hadith_number": "4386",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Perintah Nabi SAW Untuk Menyembelih Kambing Jadh'ah",
        "perawi_melayu": "Uqbah bin 'Amir (Semoga Allah meredhainya)",
        "english_text": "It was narrated that 'Uqbah bin 'Amir said: The Messenger of Allah divided some sacrificial animals among his Companions, and I got a Jadh'ah sheep. I said: 'O Messenger of Allah, I got a Jadh'ah sheep.' He said: 'Sacrifice it.",
        "malay_translation": "Diriwayatkan bahawa 'Uqbah bin 'Amir berkata: Rasulullah SAW membahagikan beberapa haiwan korban di kalangan para sahabatnya, dan saya mendapat seekor kambing Jadh'ah. Saya berkata: 'Wahai Rasulullah, saya mendapat seekor kambing Jadh'ah.' Baginda bersabda: 'Sembelihlah ia.'",
        "arabic_text": "أَخْبَرَنَا إِسْمَاعِيل بْنُ مَسْعُودٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا خَالِدٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا هِشَامٌ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، ‏‏‏‏‏‏عَنْ بَعْجَةَ بْنِ عَبْدِ اللَّهِ الْجُهَنِيِّ، ‏‏‏‏‏‏عَنْ عُقْبَةَ بْنِ عَامِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَسَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ أَصْحَابِهِ أَضَاحِيَّ، ‏‏‏‏‏‏فَأَصَابَنِي جَذَعَةٌ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏ أَصَابَتْنِي جَذَعَةٌ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ ضَحِّ بِهَا ."
      },
      {
        "id": 39375,
        "hadith_number": "4387",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Pengorbanan Kambing Jadh'ah Bersama Rasulullah",
        "perawi_melayu": "'Uqbah bin 'Amir (Semoga Allah meredhainya)",
        "english_text": "it was narrated that 'Uqbah bin 'Amir said: 'We sacrificed a Jadh'ah sheep with the Messenger of Allah.",
        "malay_translation": "Diriwayatkan bahawa 'Uqbah bin 'Amir berkata: 'Kami telah berkorban seekor kambing Jadh'ah bersama Rasulullah ﷺ.'",
        "arabic_text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ، ‏‏‏‏‏‏عَنِ ابْنِ وَهْبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي عَمْرٌو، ‏‏‏‏‏‏عَنْ بُكَيْرِ بْنِ الْأَشَجِّ، ‏‏‏‏‏‏عَنْ مُعَاذِ بْنِ عَبْدِ اللَّهِ بْنِ خُبَيْبٍ، ‏‏‏‏‏‏عَنْ عُقْبَةَ بْنِ عَامِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ضَحَّيْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِجَذَعٍ مِنَ الضَّأْنِ ."
      },
      {
        "id": 39376,
        "hadith_number": "4388",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Cukupnya Jadh'ah dalam Korban",
        "perawi_melayu": "’Asim bin Kulaib daripada bapanya",
        "english_text": "It was narrated from 'Asim bin Kulaib that his father said: We were on a journey and the day of Al-adha came, so we started to by sheep, a Musinnah for two or three Jadh'ahs. A man from Muzainah said to us: 'We were with the Messenger of Allah on a journey when this came, and we stated to look for sheep, (offering to buy) aMusinnah for two or three Jadh'ahs. Then the Messenger of Allah said: A Jadh'ah is sufficient for that for which a Thani is sufficient.",
        "malay_translation": "Diriwayatkan daripada 'Asim bin Kulaib bahawa bapanya berkata: Kami dalam perjalanan dan tibalah hari Al-Adha, maka kami mula membeli kambing, seekor Musinnah dengan harga dua atau tiga Jadh'ah. Seorang lelaki dari Muzainah berkata kepada kami: 'Kami bersama Rasulullah dalam perjalanan apabila tiba hari ini, dan kami mula mencari kambing, (menawarkan untuk membeli) Musinnah dengan harga dua atau tiga Jadh'ah. Kemudian Rasulullah bersabda: 'Jadh'ah sudah memadai untuk apa yang Thani memadai'.",
        "arabic_text": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ فِي حَدِيثِهِ، ‏‏‏‏‏‏عَنْ أَبِي الْأَحْوَصِ، ‏‏‏‏‏‏عَنِ عَاصِمِ بْنِ كُلَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنَّا فِي سَفَرٍ،‏‏‏‏ فَحَضَرَ الْأَضْحَى، ‏‏‏‏‏‏فَجَعَلَ الرَّجُلُ مِنَّا يَشْتَرِي الْمُسِنَّةَ بِالْجَذَعَتَيْنِ وَالثَّلَاثَةِ، ‏‏‏‏‏‏فَقَالَ لَنَا رَجُلٌ مِنْ مُزَيْنَةَ:‏‏‏‏ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ،‏‏‏‏ فَحَضَرَ هَذَا الْيَوْمُ، ‏‏‏‏‏‏فَجَعَلَ الرَّجُلُ يَطْلُبُ الْمُسِنَّةَ بِالْجَذَعَتَيْنِ وَالثَّلَاثَةِ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ الْجَذَعَ يُوفِي مِمَّا يُوفِي مِنْهُ الثَّنِيُّ ."
      },
      {
        "id": 39377,
        "hadith_number": "4389",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Cukupnya Jadh'ah untuk Korban",
        "perawi_melayu": "Asim bin Kulaib, daripada bapanya, daripada seorang lelaki",
        "english_text": "It was narrated that 'Asim bin Kulaib said: I heard my father narrating from a man who said: 'We were with the Messenger of Allah two days before Al-Adha and we started to offer two Jadh ahs for one Thaniiyah, Then the Messenger of Allah said: 'A Jadh'ah is sufficient for that for which a Thaniyah is sufficient.",
        "malay_translation": "Diriwayatkan bahawa 'Asim bin Kulaib berkata: Saya mendengar bapa saya meriwayatkan daripada seorang lelaki yang berkata: 'Kami bersama Rasulullah ﷺ dua hari sebelum Al-Adha dan kami mula menawarkan dua ekor Jadh'ah untuk satu Thaniiyah, Kemudian Rasulullah ﷺ bersabda: 'Seekor Jadh'ah sudah memadai untuk apa yang seekor Thaniyah memadai.'",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا خَالِدٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ عَاصِمِ بْنِ كُلَيْبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ أَبِي يُحَدِّثُ، ‏‏‏‏‏‏عَنْ رَجُلٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْلَ الْأَضْحَى بِيَوْمَيْنِ نُعْطِي الْجَذَعَتَيْنِ بِالثَّنِيَّةِ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ الْجَذَعَةَ تُجْزِئُ مَا تُجْزِئُ مِنْهُ الثَّنِيَّةُ ."
      },
      {
        "id": 39378,
        "hadith_number": "4390",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Nabi SAW Berkorban Dua Ekor Kambing",
        "perawi_melayu": "Anas (RA)",
        "english_text": "It was narrated form Anas that: the Messenger of Allah used to sacrifice two rams. And Anas said: And I sacrifice two rams.",
        "malay_translation": "Diriwayatkan dari Anas (RA) bahawa: Rasulullah SAW biasa berkorban dengan dua ekor kambing jantan. Dan Anas berkata: Dan saya juga berkorban dengan dua ekor kambing jantan.",
        "arabic_text": "أَخْبَرَنَا إِسْحَاق بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا إِسْمَاعِيل، ‏‏‏‏‏‏عَنْ عَبْدِ الْعَزِيزِ وَهُوَ ابْنُ صُهَيْبٍ، ‏‏‏‏‏‏عَنْ أَنَسٍ:‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُضَحِّي بِكَبْشَيْنِ ، ‏‏‏‏‏‏قَالَ أَنَسٌ:‏‏‏‏ وَأَنَا أُضَحِّي بِكَبْشَيْنِ."
      },
      {
        "id": 39379,
        "hadith_number": "4391",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Pengorbanan Dua Kambing Amlah oleh Rasulullah ﷺ",
        "perawi_melayu": "Anas (semoga Allah meridhainya)",
        "english_text": "It was narrated that Ans said: The Messenger of Allah sacrificed two Amlah rams.",
        "malay_translation": "Diriwayatkan daripada Anas (semoga Allah meridhainya) bahawa Rasulullah ﷺ telah menyembelih dua ekor kambing Amlah.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏عَنْ خَالِدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حُمَيْدٌ، ‏‏‏‏‏‏عَنْ ثَابِتٍ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَبْشَيْنِ أَمْلَحَيْنِ ."
      },
      {
        "id": 39380,
        "hadith_number": "4392",
        "status": "Sahih (Sahih)",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Pengorbanan Nabi dengan Dua Ekor Kibasy Bertanduk",
        "perawi_melayu": "Anas",
        "english_text": "It was narrated that Anas said: The Prophet sacrificed two horned, Amlah rams, slaughtering them with his own hand, pronouncing the name of Allah, and saying: 'Allahu Akbar, and placing his foot on their sides.",
        "malay_translation": "Diriwayatkan bahawa Anas berkata: Nabi SAW telah berkorban dengan dua ekor kibasy Amlah yang bertanduk, menyembelihnya dengan tangan baginda sendiri, menyebut nama Allah, dan mengucapkan: 'Allahu Akbar, dan meletakkan kaki baginda di sisi mereka.",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو عَوَانَةَ، ‏‏‏‏‏‏عَنْ قَتَادَةَ،‏‏‏‏ عَنْ أَنَسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ضَحَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ، ‏‏‏‏‏‏ذَبَحَهُمَا بِيَدِهِ، ‏‏‏‏‏‏وَسَمَّى وَكَبَّرَ، ‏‏‏‏‏‏وَوَضَعَ رِجْلَهُ عَلَى صِفَاحِهِمَا ."
      },
      {
        "id": 39381,
        "hadith_number": "4393",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Nabi SAW Berkhutbah pada Hari Raya Korban dan Menyembelih Dua Ekor Kambing Jantan",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "It was narrated that Anas bin Malik said: The Messenge of Allah addressed us on the Day of Sacrifice, and he went toward two Amlah rams and sacrificed them. An abridgment. (Sahih )",
        "malay_translation": "Diriwayatkan bahawa Anas bin Malik berkata: Rasulullah SAW berkhutbah kepada kami pada Hari Raya Korban, dan baginda pergi ke arah dua ekor kambing jantan Amlah dan menyembelihnya. Ringkasan. (Sahih)",
        "arabic_text": "أَخْبَرَنَا إِسْمَاعِيل بْنُ مَسْعُودٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حَاتِمُ بْنُ وَرْدَانَ، ‏‏‏‏‏‏عَنْ أَيُّوبَ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ سِيرِينَ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ أَضْحَى، ‏‏‏‏‏‏وَانْكَفَأَ إِلَى كَبْشَيْنِ أَمْلَحَيْنِ فَذَبَحَهُمَا ، ‏‏‏‏‏‏مُخْتَصَرٌ."
      },
      {
        "id": 39382,
        "hadith_number": "4394",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Pengorbanan Nabi SAW pada Hari Raya Aidiladha",
        "perawi_melayu": "Adbur-Rahman bin Abi Bakrah, daripada bapanya",
        "english_text": "It was narrated from 'Adbur-Rahman bin Abi Bakrah that his father said: Then he meaning the Prophet on the Day of Sacrifice - Went toward two Amlah rams and sacrificed them, then (he went toward) a small flock of sheep and distributed them among us. (Sahih )",
        "malay_translation": "Diriwayatkan daripada 'Adbur-Rahman bin Abi Bakrah bahawa bapanya berkata: Kemudian baginda – iaitu Nabi SAW – pada Hari Raya Korban, pergi ke arah dua ekor kibas Amlah dan menyembelihnya, kemudian (baginda pergi ke arah) sekumpulan kecil kambing dan mengagihkannya di antara kami.",
        "arabic_text": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ فِي حَدِيثِهِ، ‏‏‏‏‏‏عَنْ يَزِيدَ بْنِ زُرَيْعٍ، ‏‏‏‏‏‏عَنِ ابْنِ عَوْنٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدٍ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ثُمَّ انْصَرَفَ كَأَنَّهُ يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ النَّحْرِ إِلَى كَبْشَيْنِ أَمْلَحَيْنِ فَذَبَحَهُمَا، ‏‏‏‏‏‏وَإِلَى جُذَيْعَةٍ مِنَ الْغَنَمِ فَقَسَمَهَا بَيْنَنَا ."
      },
      {
        "id": 39383,
        "hadith_number": "4395",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Pengorbanan Rasulullah SAW dengan Kambing Bertanduk",
        "perawi_melayu": "Abu Sa'eed (Semoga Allah meredhainya)",
        "english_text": "It was narrated that Abu Sa'eed said: The Messenger of Allah sacrificed a horned, intact ram, with black feet some black at the stomach and black around its eyes. (Sahih )",
        "malay_translation": "Diriwayatkan bahawa Abu Sa'eed berkata: Rasulullah SAW telah mengorbankan seekor kambing jantan bertanduk yang sempurna, dengan kaki hitam, sedikit hitam di perutnya dan hitam di sekeliling matanya. (Sahih)",
        "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ أَبُو سَعِيدٍ الْأَشَجُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، ‏‏‏‏‏‏عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَبْشٍ أَقْرَنَ، ‏‏‏‏‏‏فَحِيلٍ يَمْشِي فِي سَوَادٍ، ‏‏‏‏‏‏وَيَأْكُلُ فِي سَوَادٍ، ‏‏‏‏‏‏وَيَنْظُرُ فِي سَوَادٍ ."
      },
      {
        "id": 39384,
        "hadith_number": "4396",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Pembahagian Harta Rampasan Perang: 10 Ekor Kambing Setara Seekor Unta",
        "perawi_melayu": "Rafi bin Khadij (رضي الله عنه)",
        "english_text": "It was narrated that Rafi bin Khadij Said: When distributing the spoils of war, the Messenger of Allah used to make ten sheep equivalent to one camel. Shu'bah said: I know most if it from what I heard form Sa'eed bin Masruq, and Sufyan narrated it to me. (Sahih )",
        "malay_translation": "Diriwayatkan daripada Rafi bin Khadij (رضي الله عنه), beliau berkata: \"Apabila membahagikan harta rampasan perang, Rasulullah ﷺ menjadikan sepuluh ekor kambing bersamaan dengan seekor unta.\" Shu'bah berkata: \"Saya tahu kebanyakan daripada apa yang saya dengar daripada Sa'eed bin Masruq, dan Sufyan meriwayatkannya kepada saya.\" (Sahih)",
        "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعٍ، ‏‏‏‏‏‏عَنْ جَدِّهِ رَافِعِ بْنِ خَدِيجٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَجْعَلُ فِي قَسْمِ الْغَنَائِمِ عَشْرًا مِنَ الشَّاءِ بِبَعِيرٍ . قَالَ شُعْبَةُ:‏‏‏‏ وَأَكْبَرُ عِلْمِي أَنِّي سَمِعْتُهُ مِنِ سَعِيدِ بْنِ مَسْرُوقٍ، ‏‏‏‏‏‏وَحَدَّثَنِي بِهِ سُفْيَانُ عَنْهُ، ‏‏‏‏‏‏وَاللَّهُ تَعَالَى أَعْلَمُ."
      },
      {
        "id": 39385,
        "hadith_number": "4397",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Perkongsian Unta dan Lembu dalam Ibadah Korban",
        "perawi_melayu": "Ibnu Abbas",
        "english_text": "It was narrated that Ibn 'Abbas said: We were with the Mesenger of Allah on a journey, when the Day of Sacrifice came, so we shared a camel among ten men, and a cow among seven.",
        "malay_translation": "Diriwayatkan daripada Ibnu Abbas, beliau berkata: Kami bersama Rasulullah ﷺ dalam suatu perjalanan, ketika tiba Hari Raya Korban, maka kami berkongsi seekor unta antara sepuluh orang, dan seekor lembu antara tujuh orang.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ بْنِ غَزْوَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، ‏‏‏‏‏‏عَنْ حُسَيْنٍ يَعْنِي ابْنَ وَاقِدٍ، ‏‏‏‏‏‏عَنْ عِلْبَاءَ بْنِ أَحْمَرَ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَحَضَرَ النَّحْرُ، ‏‏‏‏‏‏فَاشْتَرَكْنَا فِي الْبَعِيرِ عَنْ عَشْرَةٍ، ‏‏‏‏‏‏وَالْبَقَرَةِ عَنْ سَبْعَةٍ ."
      },
      {
        "id": 39386,
        "hadith_number": "4398",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Amalan Tamattu' dan Penyembelihan Lembu Semasa Haji",
        "perawi_melayu": "Jabir (رَضِيَ اللَّهُ عَنْهُ)",
        "english_text": "It was narrated that Jabir said: We would make Tamattu' when the Prophet was with us, and we would sacrifice a cow on behalf of seven people, sharing it among ourselves. (Sahih )",
        "malay_translation": "Diriwayatkan daripada Jabir (رَضِيَ اللَّهُ عَنْهُ) berkata: Kami melakukan Tamattu' ketika Nabi (ﷺ) bersama kami, dan kami menyembelih seekor lembu bagi pihak tujuh orang, kami berkongsi di kalangan kami. (Sahih)",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏عَنْ يَحْيَى، ‏‏‏‏‏‏عَنْ عَبْدِ الْمَلِكِ، ‏‏‏‏‏‏عَنْ عَطَاءٍ، ‏‏‏‏‏‏عَنْ جَابِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنَّا نَتَمَتَّعُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَنَذْبَحُ الْبَقَرَةَ عَنْ سَبْعَةٍ، ‏‏‏‏‏‏وَنَشْتَرِكُ فِيهَا ."
      },
      {
        "id": 39387,
        "hadith_number": "4399",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Kisah Al-Bara bin 'Azib: Perintah Menyembelih Korban Selepas Solat Hari Raya",
        "perawi_melayu": "Al-Bara bin 'Azib",
        "english_text": "It was narrated that Al-Bara bin 'Azib said: The Messenger of Allah stood up on the Day of Sacrifice and Said: 'Whoever turn toward our Qiblah and prays as we pray and offers the same sacrifice as we do, let him not offer his sacrifice until he has prayed; My maternal uncle stood up and said: 'O Messenger of Allah, I hastened to slaughter my sacrifice, so that I could feed my family,. And the members of my household,; or my family and my neighbors,; The Messenger of Allah said; 'Offer another sacrifice,; He said: 'I have a suckling she-goat kid that is dearer to me than two sheep raised for meat,' He said: 'Sacrifice it, for it is the better of your two sacrifices. But no Jadh'ah will do as a sacrifice for anyone after you. ' (Sahih )",
        "malay_translation": "Diriwayatkan daripada Al-Bara bin 'Azib, beliau berkata: Rasulullah SAW berdiri pada Hari Raya Aidiladha dan bersabda: 'Sesiapa yang menghadap kiblat kami, solat seperti kami solat, dan menyembelih korban seperti kami lakukan, maka janganlah dia menyembelih korbannya sehingga dia telah selesai solat.' Bapa saudara sebelah ibu saya berdiri dan berkata: 'Wahai Rasulullah, sesungguhnya saya telah menyegerakan penyembelihan korban saya supaya saya dapat memberi makan kepada keluarga saya, dan ahli keluarga saya, atau keluarga saya dan jiran-jiran saya.' Rasulullah SAW bersabda: 'Sembelihlah korban yang lain.' Dia berkata: 'Saya mempunyai seekor anak kambing betina yang menyusu yang lebih saya sayangi daripada dua ekor kambing yang dibela untuk daging.' Baginda bersabda: 'Sembelihlah ia, kerana ia adalah yang terbaik daripada dua korbanmu. Tetapi tiada Jadh'ah boleh menjadi korban bagi sesiapa pun selepasmu.' (Sahih)",
        "arabic_text": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، ‏‏‏‏‏‏عَنِ ابْنِ أَبِي زَائِدَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا أَبِي، ‏‏‏‏‏‏عَنْ فِرَاسٍ، ‏‏‏‏‏‏عَنْ عَامِرٍ، ‏‏‏‏‏‏عَنِ الْبَرَاءِ بْنِ عَازِبٍ. ح وَأَنْبَأَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ، ‏‏‏‏‏‏عَنِ الشَّعْبِيِّ، ‏‏‏‏‏‏عَنِ الْبَرَاءِ، ‏‏‏‏‏‏فَذَكَرَ أَحَدُهُمَا مَا لَمْ يَذْكُرِ الْآخَرُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْأَضْحَى، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَنْ وَجَّهَ قِبْلَتَنَا، ‏‏‏‏‏‏وَصَلَّى صَلَاتَنَا، ‏‏‏‏‏‏وَنَسَكَ نُسُكَنَا، ‏‏‏‏‏‏فَلَا يَذْبَحْ حَتَّى يُصَلِّيَ ، ‏‏‏‏‏‏فَقَامَ خَالِي، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏ إِنِّي عَجَّلْتُ نُسُكِي لِأُطْعِمَ أَهْلِي، ‏‏‏‏‏‏وَأَهْلَ دَارِي، ‏‏‏‏‏‏أَوْ أَهْلِي، ‏‏‏‏‏‏وَجِيرَانِي. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَعِدْ ذِبْحًا آخَرَ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَإِنَّ عِنْدِي عَنَاقَ لَبَنٍ هِيَ أَحَبُّ إِلَيَّ مِنْ شَاتَيْ لَحْمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ اذْبَحْهَا فَإِنَّهَا خَيْرُ نَسِيكَتَيْكَ، ‏‏‏‏‏‏وَلَا تَقْضِي جَذَعَةٌ عَنْ أَحَدٍ بَعْدَكَ ."
      },
      {
        "id": 39388,
        "hadith_number": "4400",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Hukum Korban Sebelum Solat Aidiladha",
        "perawi_melayu": "Al-Bara bin 'Azib",
        "english_text": "It was narrated that Al-Bara bin 'Azib said: The Messenger of Allah addressed us on the Day of Sacrifice and said: 'whoever prays as we pray nand offers the sacrtifice as we do, has done the rituals properly. Whoever offered the sacrifice before the prayer, that is just a sheep for meat. Abu Burdah said: 'O Messengers of Allah, by Allah, I offered my sacrifice before I went out to pray. I knew that this day is a day of eating and drinking, so I hastened to eat and to feed my family and my neighbors.' The Messenger of Allah said: 'The Messenger of Allah said; 'That was just a sheep for meat.' He said: 'I have a Jadh'ah she-goat that is better than two sheep for meat; will it suffice for me (as a sacrifice)?' He said: 'Yes, but it will never suff8ice for anyone after you. ' (Sahih )",
        "malay_translation": "Diriwayatkan daripada Al-Bara bin 'Azib, beliau berkata: Rasulullah SAW berkhutbah kepada kami pada Hari Raya Aidiladha, kemudian baginda bersabda: 'Sesiapa yang solat seperti kami solat dan menyembelih korban seperti kami menyembelih, maka dia telah menyempurnakan ibadah korban. Sesiapa yang menyembelih korban sebelum solat, maka ia hanyalah seekor kambing untuk dimakan.' Abu Burdah berkata: 'Wahai Rasulullah, demi Allah, sesungguhnya aku telah menyembelih korban sebelum aku keluar untuk solat. Aku tahu hari ini adalah hari makan dan minum, maka aku bersegera makan dan memberi makan kepada keluargaku dan jiran-jiranku.' Rasulullah SAW bersabda: 'Itu hanyalah seekor kambing untuk dimakan.' Beliau berkata: 'Aku mempunyai seekor kambing Jadh'ah betina yang lebih baik daripada dua ekor kambing untuk dimakan; adakah ia memadai bagiku (sebagai korban)?' Baginda bersabda: 'Ya, tetapi ia tidak akan memadai bagi sesiapa pun selepasmu.' (Sahih)",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو الْأَحْوَصِ، ‏‏‏‏‏‏عَنْ مَنْصُورٍ، ‏‏‏‏‏‏عَنِ الشَّعْبِيِّ، ‏‏‏‏‏‏عَنِ الْبَرَاءِ بْنِ عَازِبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ النَّحْرِ بَعْدَ الصَّلَاةِ، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ مَنْ صَلَّى صَلَاتَنَا، ‏‏‏‏‏‏وَنَسَكَ نُسُكَنَا فَقَدْ أَصَابَ النُّسُكَ، ‏‏‏‏‏‏وَمَنْ نَسَكَ قَبْلَ الصَّلَاةِ، ‏‏‏‏‏‏فَتِلْكَ شَاةُ لَحْمٍ ، ‏‏‏‏‏‏فَقَالَ أَبُو بُرْدَةَ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏وَاللَّهِ لَقَدْ نَسَكْتُ قَبْلَ أَنْ أَخْرُجَ إِلَى الصَّلَاةِ، ‏‏‏‏‏‏وَعَرَفْتُ أَنَّ الْيَوْمَ يَوْمُ أَكْلٍ وَشُرْبٍ فَتَعَجَّلْتُ فَأَكَلْتُ، ‏‏‏‏‏‏وَأَطْعَمْتُ أَهْلِي، ‏‏‏‏‏‏وَجِيرَانِي. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ تِلْكَ شَاةُ لَحْمٍ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَإِنَّ عِنْدِي عَنَاقًا جَذَعَةً، ‏‏‏‏‏‏خَيْرٌ مِنْ شَاتَيْ لَحْمٍ، ‏‏‏‏‏‏فَهَلْ تُجْزِئُ عَنِّي ؟، ‏‏‏‏‏‏قَالَ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏وَلَنْ تَجْزِيَ عَنْ أَحَدٍ بَعْدَكَ ."
      },
      {
        "id": 39389,
        "hadith_number": "4401",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Kisah Sesiapa yang Menyembelih Korban Sebelum Solat Hari Raya",
        "perawi_melayu": "Anas (Semoga Allah meredhainya)",
        "english_text": "It was narrated that Anas said: The Messenger of Allah said on the Day of Sacrifice:' Whoever slaughtered his sacrifice before the prayer, let him repeat it.' A man stood up and said: 'O Messenger of Allah, this is a day when people want to eat meat.' He mentioned that his neighbors were poor and it was as if the Messenger of Allah believed him. He said: 'I have a Jadh'ah that is dearer to me than tow sheep for meat.; So he granted him a concession (allowing him to sacrifice it) but I do not know whether it applied to anyone else or not. Then he went toward two rams and sacrificed them. (Sahih )",
        "malay_translation": "Diriwayatkan bahawa Anas berkata: Rasulullah ﷺ bersabda pada Hari Raya Korban: 'Sesiapa yang menyembelih korbannya sebelum solat, hendaklah dia mengulanginya.' Seorang lelaki bangun dan berkata: 'Wahai Rasulullah, hari ini adalah hari di mana orang ramai ingin makan daging.' Dia menyebutkan bahawa jiran-jirannya miskin dan seolah-olah Rasulullah ﷺ mempercayainya. Baginda bersabda: 'Saya mempunyai Jadh'ah yang lebih saya sukai daripada dua ekor kambing untuk daging.' Maka baginda memberikan keringanan kepadanya (membenarkannya untuk berkorban) tetapi saya tidak tahu sama ada ia terpakai kepada orang lain atau tidak. Kemudian baginda pergi ke arah dua ekor kibas jantan dan menyembelihnya. (Sahih)",
        "arabic_text": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا ابْنُ عُلَيَّةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَيُّوبُ، ‏‏‏‏‏‏عَنْ مُحَمَّدٍ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ النَّحْرِ:‏‏‏‏ مَنْ كَانَ ذَبَحَ قَبْلَ الصَّلَاةِ فَلْيُعِدْ ، ‏‏‏‏‏‏فَقَامَ رَجُلٌ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ هَذَا يَوْمٌ يُشْتَهَى فِيهِ اللَّحْمُ، ‏‏‏‏‏‏فَذَكَرَ هَنَةً مِنْ جِيرَانِهِ، ‏‏‏‏‏‏كَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَدَّقَهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ عِنْدِي جَذَعَةٌ هِيَ أَحَبُّ إِلَيَّ مِنْ شَاتَيْ لَحْمٍ، ‏‏‏‏‏‏فَرَخَّصَ لَهُ، ‏‏‏‏‏‏فَلَا أَدْرِي أَبَلَغَتْ رُخْصَتُهُ مَنْ سِوَاهُ، ‏‏‏‏‏‏أَمْ لَا، ‏‏‏‏‏‏ثُمَّ انْكَفَأَ إِلَى كَبْشَيْنِ فَذَبَحَهُمَا."
      },
      {
        "id": 39390,
        "hadith_number": "4402",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Pengorbanan Sebelum Waktunya dan Keutamaan Jadh'ah",
        "perawi_melayu": "Abu Burdah bin Niyar",
        "english_text": "It was narrated from Abu Burdah bin Niyar that he slaughtered (his sacrifice) before the Prophet and the Prophet told him to repeat it. He said: I have a Jadh'ah she-goat that is dearer to me than two Muslinnahs. He said: Sacrifice it, According to the Hadith of: Ubaidullah, he said: I cannot find anything but a Jadh'ah, and he told him to slaughter it. (Sahih )",
        "malay_translation": "Diriwayatkan daripada Abu Burdah bin Niyar bahawa beliau menyembelih (korban)nya sebelum Nabi ﷺ dan Nabi ﷺ memerintahkannya untuk mengulanginya. Beliau berkata: Saya mempunyai seekor kambing betina Jadh'ah yang lebih saya sayangi daripada dua ekor Muslinnah. Nabi ﷺ bersabda: Sembelihlah ia, Menurut Hadith Ubaidullah, beliau berkata: Saya tidak menemui apa-apa melainkan Jadh'ah, dan Nabi ﷺ menyuruhnya menyembelihnya. (Sahih)",
        "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏عَنْ يَحْيَى. ح وَأَنْبَأَنَا عَمْرُو بْنُ عَلِيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ بُشَيْرِ بْنِ يَسَارٍ، ‏‏‏‏‏‏عَنْ أَبِي بُرْدَةَ بْنِ نِيَارٍ:‏‏‏‏ أَنَّهُ ذَبَحَ قَبْلَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ فَأَمَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُعِيدَ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ عِنْدِي عَنَاقُ جَذَعَةٍ،‏‏‏‏ هِيَ أَحَبُّ إِلَيَّ مِنْ مُسِنَّتَيْنِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ اذْبَحْهَا . فِي حَدِيثِ عُبَيْدِ اللَّهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنِّي لَا أَجِدُ إِلَّا جَذَعَةً ؟ فَأَمَرَهُ أَنْ يَذْبَحَ."
      },
      {
        "id": 39391,
        "hadith_number": "4403",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Hukum Menyembelih Korban Sebelum Solat Hari Raya",
        "perawi_melayu": "Jundab bin Sufyan",
        "english_text": "It was narrated that Jundab bin Sufyan said: We slaughtered the sacrifice with the Messenger of Allah on day, and the people slaughtered their sacrifices before the prayer. When he finished (the prayer) the Prophet saw that they had slaughtered their sacrifices before the prayer. He said: Whoever slaughtered his sacrifice before the prayer, let him slaughter another in its place, and whoever did not slaughter his sacrifice until we had prayed, let him slaughter it in the name of Allah, The Mighty and Sublime, (Sahih )",
        "malay_translation": "Diriwayatkan bahawa Jundab bin Sufyan berkata: Kami menyembelih korban bersama Rasulullah ﷺ pada suatu hari, dan orang ramai menyembelih korban mereka sebelum solat. Apabila baginda selesai (solat), Nabi ﷺ melihat mereka telah menyembelih korban mereka sebelum solat. Baginda bersabda: Sesiapa yang menyembelih korbannya sebelum solat, hendaklah dia menyembelih yang lain sebagai gantinya, dan sesiapa yang tidak menyembelih korbannya sehingga kami selesai solat, hendaklah dia menyembelihnya dengan nama Allah, Yang Maha Perkasa lagi Maha Agung, (Sahih)",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو عَوَانَةَ، ‏‏‏‏‏‏عَنِ الْأَسْوَدِ بْنِ قَيْسٍ، ‏‏‏‏‏‏عَنْ جُنْدُبِ بْنِ سُفْيَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ضَحَّيْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَضْحًى ذَاتَ يَوْمٍ، ‏‏‏‏‏‏فَإِذَا النَّاسُ قَدْ ذَبَحُوا ضَحَايَاهُمْ قَبْلَ الصَّلَاةِ، ‏‏‏‏‏‏فَلَمَّا انْصَرَفَ رَآهُمُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُمْ ذَبَحُوا قَبْلَ الصَّلَاةِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَنْ ذَبَحَ قَبْلَ الصَّلَاةِ، ‏‏‏‏‏‏فَلْيَذْبَحْ مَكَانَهَا أُخْرَى، ‏‏‏‏‏‏وَمَنْ كَانَ لَمْ يَذْبَحْ حَتَّى صَلَّيْنَا، ‏‏‏‏‏‏فَلْيَذْبَحْ عَلَى اسْمِ اللَّهِ عَزَّ وَجَلَّ ."
      },
      {
        "id": 39392,
        "hadith_number": "4404",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Keharusan Memakan Arnab yang Disebutkan dengan Marwah",
        "perawi_melayu": "Muhammad bin Safwan (Semoga Allah meredhainya)",
        "english_text": "It was narrated from Muhammad bin Safwan that: he caught two rabbits and he could not find a knife with which to slaughter then, so he slaughtered them with Marwah. Then he came to the Prophet and said: O Mesenger of Allah! I caught two rabbits but I could not find a knife with which to slaughter them, so I slaughtered them with Marwah;l can I eat them? He said: Eat (them).",
        "malay_translation": "Diriwayatkan daripada Muhammad bin Safwan bahawa: Beliau telah menangkap dua ekor arnab dan tidak menjumpai pisau untuk menyembelihnya, lalu beliau menyembelihnya dengan Marwah. Kemudian beliau datang kepada Nabi dan berkata: Wahai Rasulullah! Saya telah menangkap dua ekor arnab tetapi tidak menjumpai pisau untuk menyembelihnya, jadi saya telah menyembelihnya dengan Marwah; Bolehkah saya memakannya? Baginda bersabda: Makanlah (mereka).",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا دَاوُدُ، ‏‏‏‏‏‏عَنْ عَامِرٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ صَفْوَانَ:‏‏‏‏ أَنَّهُ أَصَابَ أَرْنَبَيْنِ، ‏‏‏‏‏‏وَلَمْ يَجِدْ حَدِيدَةً يَذْبَحُهُمَا بِهِ، ‏‏‏‏‏‏فَذَكَّاهُمَا بِمَرْوَةٍ، ‏‏‏‏‏‏فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِنِّي اصْطَدْتُ أَرْنَبَيْنِ،‏‏‏‏ فَلَمْ أَجِدْ حَدِيدَةً أُذَكِّيهِمَا بِهِ فَذَكَّيْتُهُمَا بِمَرْوَةٍ،‏‏‏‏ أَفَآكُلُ ؟، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُلْ ."
      },
      {
        "id": 39393,
        "hadith_number": "4405",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Kebenaran Memakan Haiwan yang Disembelih Setelah Diserang Serigala",
        "perawi_melayu": "Zaid bin Thabit",
        "english_text": "It was narrated from Zaid bin Thabit that: a wolf bit a sheep so he slaughtered it with Marwah, and the Prophet allowed him to eat it.",
        "malay_translation": "Diriwayatkan daripada Zaid bin Thabit bahawa: seekor serigala menggigit seekor kambing lalu dia menyembelihnya dengan batu Marwah, dan Nabi SAW membenarkannya memakan daging kambing tersebut.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حَاضِرُ بْنُ الْمُهَاجِرِ الْبَاهِلِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ سُلَيْمَانَ بْنَ يَسَارٍ يُحَدِّثُ، ‏‏‏‏‏‏عَنْ زَيْدِ بْنِ ثَابِتٍ:‏‏‏‏ أَنَّ ذِئْبًا نَيَّبَ فِي شَاةٍ، ‏‏‏‏‏‏فَذَبَحُوهَا بِالْمَرْوَةِ، ‏‏‏‏‏‏فَرَخَّصَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَكْلِهَا ."
      },
      {
        "id": 39394,
        "hadith_number": "4406",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Menyembelih Binatang Buruan dengan Alat Selain Pisau",
        "perawi_melayu": "'Adiyy bin Hatim",
        "english_text": "It was narrated that 'Adiyy bin Hatim said: I said: 'O Messenger of Allah, I release my dog and I catch the game, but I cannot find anything to slaughter it with, so I slaughter it with a Marwah or a stick,; He said: 'Shed the blood with whatever you wish, and say the name of Allah. '",
        "malay_translation": "Diriwayatkan bahawa 'Adiyy bin Hatim berkata: Saya berkata: 'Wahai Rasulullah, saya melepaskan anjing saya dan saya menangkap buruan, tetapi saya tidak menemui apa-apa untuk menyembelihnya, jadi saya menyembelihnya dengan Marwah atau sebatang kayu.'; Baginda bersabda: 'Tumpahkanlah darah dengan apa sahaja yang kamu mahu, dan sebutlah nama Allah.'",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏وَإِسْمَاعِيل بْنُ مَسْعُودٍ،‏‏‏‏ عَنْ خَالِدٍ، ‏‏‏‏‏‏عَنْ شُعْبَةَ، ‏‏‏‏‏‏عَنْ سِمَاكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ مُرِّيَّ بْنَ قَطَرِيٍّ، ‏‏‏‏‏‏عَنْ عَدِيِّ بْنِ حَاتِمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِنِّي أُرْسِلُ كَلْبِي فَآخُذُ الصَّيْدَ فَلَا أَجِدُ مَا أُذَكِّيهِ بِهِ، ‏‏‏‏‏‏فَأَذْبَحُهُ بِالْمَرْوَةِ، ‏‏‏‏‏‏وَبِالْعَصَا ؟، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْهِرِ الدَّمَ بِمَا شِئْتَ، ‏‏‏‏‏‏وَاذْكُرِ اسْمَ اللَّهِ عَزَّ وَجَلَّ ."
      },
      {
        "id": 39395,
        "hadith_number": "4407",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Lelaki Ansar Menyembelih Unta dengan Pancang Kayu",
        "perawi_melayu": "Abu Sa'eed Al-Khudri",
        "english_text": "It was narrated that Abu Sa'eed Al-Khudri said: A man form among the Ansar had a she-camel which used to graze in front of Uhud. Something happened to it, and he slaughtered it with a stake, - (Ayyub, one of the narrators, said) I said to Zaid:' A stake of wood or of iron? He said No of wood. - Then he went to the Prophet and asked him, and he told him to eat it. (Sahih )",
        "malay_translation": "Diriwayatkan bahawa Abu Sa'eed Al-Khudri berkata: Seorang lelaki dari kalangan Ansar mempunyai seekor unta betina yang menggembalakan dirinya di hadapan Uhud. Sesuatu telah berlaku kepadanya, dan dia menyembelihnya dengan pancang kayu, - (Ayyub, salah seorang perawi, berkata) Aku berkata kepada Zaid: 'Pancang kayu atau besi?' Dia berkata: Tidak, kayu. - Kemudian dia pergi kepada Nabi dan bertanya kepadanya, dan baginda menyuruhnya memakannya. (Sahih)",
        "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ مَعْمَرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حَبَّانُ بْنُ هِلَالٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَيُّوبُ، ‏‏‏‏‏‏عَنْ زَيْدِ بْنِ أَسْلَمَ،‏‏‏‏ فَلَقِيتُ زَيْدَ بْنَ أَسْلَمَ فَحَدَّثَنِي، ‏‏‏‏‏‏عَنْ عَطَاءِ بْنِ يَسَارٍ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَتْ لِرَجُلٍ مِنَ الْأَنْصَارِ نَاقَةٌ تَرْعَى فِي قِبَلِ أُحُدٍ، ‏‏‏‏‏‏فَعُرِضَ لَهَا،‏‏‏‏ فَنَحَرَهَا بِوَتَدٍ، ‏‏‏‏‏‏فَقُلْتُ لِزَيْدٍ:‏‏‏‏ وَتَدٌ مِنْ خَشَبٍ، ‏‏‏‏‏‏أَوْ حَدِيدٍ ؟، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا، ‏‏‏‏‏‏بَلْ خَشَبٌ، ‏‏‏‏‏‏فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ فَسَأَلَهُ،‏‏‏‏ فَأَمَرَهُ بِأَكْلِهَا ."
      },
      {
        "id": 39396,
        "hadith_number": "4408",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Hukum Memakan Haiwan yang Disembelih",
        "perawi_melayu": "Rafi bin Khadij",
        "english_text": "It was narrated from Rafi bin Khadij that the Messenger of Allah said: If the blood is shed and the name of Allah is mentioned, then eat, unless (it is slaughtered) with teeth or nails.",
        "malay_translation": "Diriwayatkan daripada Rafi bin Khadij bahawa Rasulullah ﷺ bersabda: \"Jika darah mengalir dan nama Allah disebut, maka makanlah (haiwan tersebut), kecuali (jika ia disembelih) dengan gigi atau kuku.\"",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ عُمَرَ بْنِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَبَايَةَ بْنِ رِفَاعَةَ، ‏‏‏‏‏‏عَنْ رَافِعِ بْنِ خَدِيجٍ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَا أَنْهَرَ الدَّمَ، ‏‏‏‏‏‏وَذُكِرَ اسْمُ اللَّهِ، ‏‏‏‏‏‏فَكُلْ إِلَّا بِسِنٍّ، ‏‏‏‏‏‏أَوْ ظُفُرٍ ."
      },
      {
        "id": 39397,
        "hadith_number": "4409",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Hukum Memakan Haiwan Sembelihan Tanpa Pisau",
        "perawi_melayu": "Rafi bin Khadij (رَافِعِ بْنِ خَدِيجٍ)",
        "english_text": "It was narrated that Rafi bin Khadij said: I said: 'O Messenger of Allah we are going to meet the enemy tomorrow and we do not have any knives.' The Messenger of Allah said: If the blood is shed and the name of Allah is mentioned, then eat, unless (it is slaughtered (with teeth or nails, and I will tell you about that. As for teeth, they are bones, and as for nails, they are the knives of the Ethiopians. ' (Sahih )",
        "malay_translation": "Diriwayatkan bahawa Rafi bin Khadij berkata: Aku berkata: 'Wahai Rasulullah, kita akan bertemu musuh esok hari dan kita tidak mempunyai pisau.' Rasulullah ﷺ bersabda: 'Jika darah mengalir dan nama Allah disebut, maka makanlah, kecuali jika ia disembelih dengan gigi atau kuku, dan aku akan memberitahu kamu tentang itu. Adapun gigi, ia adalah tulang, dan adapun kuku, ia adalah pisau orang Habsyah.' (Sahih)",
        "arabic_text": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي الْأَحْوَصِ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ مَسْرُوقٍ، ‏‏‏‏‏‏عَنْ عَبَايَةَ بْنِ رِفَاعَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ رَافِعِ بْنِ خَدِيجٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِنَّا نَلْقَى الْعَدُوَّ غَدًا، ‏‏‏‏‏‏وَلَيْسَ مَعَنَا مُدًى ؟، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَا أَنْهَرَ الدَّمَ، ‏‏‏‏‏‏وَذُكِرَ اسْمُ اللَّهِ عَزَّ وَجَلَّ، ‏‏‏‏‏‏فَكُلُوا مَا لَمْ يَكُنْ سِنًّا، ‏‏‏‏‏‏أَوْ ظُفُرًا، ‏‏‏‏‏‏وَسَأُحَدِّثُكُمْ عَنْ ذَلِكَ، ‏‏‏‏‏‏أَمَّا السِّنُّ:‏‏‏‏ فَعَظْمٌ، ‏‏‏‏‏‏وَأَمَّا الظُّفُرُ:‏‏‏‏ فَمُدَى الْحَبَشَةِ ."
      },
      {
        "id": 39398,
        "hadith_number": "4410",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Kebaikan dalam Pembunuhan dan Penyembelihan",
        "perawi_melayu": "Shaddad bin Aws",
        "english_text": "It was narrated that Shaddad bin Aws said: There are two things that I memorized from the Messenger of Allah, who said: 'Allah has decreed proficiency in all things, so when you kill, kill well, and when you slaughter, slaughter well. Let one of you sharpen his blade and spare suffering to the animal he slaughters.' (Sahih)",
        "malay_translation": "Diriwayatkan bahawa Shaddad bin Aws berkata: Terdapat dua perkara yang aku hafal daripada Rasulullah ﷺ, yang bersabda: 'Sesungguhnya Allah telah menetapkan kebaikan dalam segala sesuatu, maka apabila kamu membunuh, bunuhlah dengan baik, dan apabila kamu menyembelih, sembelihlah dengan baik. Hendaklah salah seorang daripada kamu menajamkan mata pisaunya dan meringankan penderitaan haiwan yang disembelihnya.' (Sahih)",
        "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا إِسْمَاعِيل، ‏‏‏‏‏‏عَنْ خَالِدٍ، ‏‏‏‏‏‏عَنْ أَبِي قِلَابَةَ، ‏‏‏‏‏‏عَنْ أَبِي الْأَشْعَثِ، ‏‏‏‏‏‏عَنْ شَدَّادِ بْنِ أَوْسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ اثْنَتَانِ حَفِظْتُهُمَا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنَّ اللَّهَ كَتَبَ الْإِحْسَانَ عَلَى كُلِّ شَيْءٍ، ‏‏‏‏‏‏فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا الْقِتْلَةَ، ‏‏‏‏‏‏وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذِّبْحَةَ، ‏‏‏‏‏‏وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ، ‏‏‏‏‏‏وَلْيُرِحْ ذَبِيحَتَهُ ."
      },
      {
        "id": 39399,
        "hadith_number": "4411",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Menyembelih Kuda dan Memakannya",
        "perawi_melayu": "Asma bint Abi Bakr",
        "english_text": "It was narrated that Asma bint Abi Bakr said: We slaughtered (Naharna) a horse during the time of the Messenger of Allah and ate it . (Sahih )",
        "malay_translation": "Diriwayatkan daripada Asma bint Abi Bakr, beliau berkata: Kami menyembelih (Naharna) seekor kuda pada zaman Rasulullah ﷺ dan memakannya. (Sahih)",
        "arabic_text": "أَخْبَرَنَا عِيسَى بْنُ أَحْمَدَ الْعَسْقَلَانِيُّ عَسْقَلَانُ بَلْخٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي سُفْيَانُ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ حَدَّثَهُ، ‏‏‏‏‏‏عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ، ‏‏‏‏‏‏عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ نَحَرْنَا فَرَسًا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَكَلْنَاهُ ."
      },
      {
        "id": 39400,
        "hadith_number": "4412",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Kisah Kambing Disembelih dengan Marwah dan Kebenaran Memakannya",
        "perawi_melayu": "Zaid bin Thabit (semoga Allah meredhainya)",
        "english_text": "It was narrated from Zaid bin Thabit that: a wolf attacked a sheep so they slaughtered it with a Marwah, and the Prophet allowed it to be eaten.",
        "malay_translation": "Diriwayatkan daripada Zaid bin Thabit bahawa: seekor serigala menyerang seekor kambing, lalu mereka menyembelihnya dengan Marwah (sejenis batu), dan Nabi ﷺ membenarkan ia dimakan.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ حَاضِرَ بْنَ الْمُهَاجِرِ الْبَاهِلِيَّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ سُلَيْمَانَ بْنَ يَسَارٍ يُحَدِّثُ، ‏‏‏‏‏‏عَنْ زَيْدِ بْنِ ثَابِتٍ:‏‏‏‏ أَنَّ ذِئْبًا نَيَّبَ فِي شَاةٍ، ‏‏‏‏‏‏فَذَبَحُوهَا بِمَرْوَةٍ، ‏‏‏‏‏‏فَرَخَّصَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَكْلِهَا ."
      },
      {
        "id": 39401,
        "hadith_number": "4413",
        "status": "Daif (Lemah)",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Cukup Menyembelih Walaupun di Paha?",
        "perawi_melayu": "Abu Ushara' (Ayahnya)",
        "english_text": "It was narrated from Abu Ushara' that his father said: I said: O Messenger of Allah, is slaughtering only in the throat or upper chest? He said: 'If you stab it in the thigh, that will suffice, '(Daif)",
        "malay_translation": "Diriwayatkan dari Abu Ushara' bahawa ayahnya berkata: Saya berkata: Wahai Rasulullah, adakah penyembelihan itu hanya pada kerongkong atau dada atas? Baginda bersabda: 'Jika kamu menikamnya di paha, ia sudah memadai,' (Daif)",
        "arabic_text": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ حَمَّادِ بْنِ سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَبِي الْعُشَرَاءِ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏أَمَا تَكُونُ الذَّكَاةُ إِلَّا فِي الْحَلْقِ، ‏‏‏‏‏‏وَاللَّبَّةِ ؟، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَوْ طَعَنْتَ فِي فَخِذِهَا لَأَجْزَأَكَ ."
      },
      {
        "id": 39402,
        "hadith_number": "4414",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Hukum Memakan Haiwan Sembelihan Tanpa Pisau dalam Peperangan",
        "perawi_melayu": "Rafi'",
        "english_text": "It was narrated that Rafi said: I said: 'O Messenger of Allah, we are going to meet the enemy tomorrow, and we do not have any knives.' He said: 'If the blood is shed and the name of Allah is mentioned, then eat, unlike (it is slaughtered) with teeth or nails. Then the Messenger of Allah got some spoils of war and a camel ran away. A man shot and arrow at it and stopped it. He (the Prophet) said; 'Some of these animals - or 'these camels'- 'are untamed like wild animals, so if one of them goes out of your control, do the same. ' (Sahih )",
        "malay_translation": "Diriwayatkan daripada Rafi' bahawa dia berkata: Aku berkata, 'Wahai Rasulullah, sesungguhnya kita akan bertemu musuh esok, dan kita tidak mempunyai pisau.' Baginda bersabda: 'Jika darah mengalir dan nama Allah disebut, maka makanlah, kecuali (disembelih) dengan gigi atau kuku. Kemudian Rasulullah SAW mendapat sedikit harta rampasan perang dan seekor unta melarikan diri. Seorang lelaki memanah dan menghentikannya. Baginda (Nabi) bersabda; 'Sesungguhnya sebahagian daripada haiwan ini - atau 'unta-unta ini' - 'adalah liar seperti haiwan liar, jadi jika salah seorang daripada mereka terlepas daripada kawalan kamu, lakukanlah perkara yang sama.' (Sahih)",
        "arabic_text": "أَخْبَرَنَا إِسْمَاعِيل بْنُ مَسْعُودٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا خَالِدٌ، ‏‏‏‏‏‏عَنْ شُعْبَةَ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ مَسْرُوقٍ، ‏‏‏‏‏‏عَنْ عَبَايَةَ بْنِ رَافِعٍ، ‏‏‏‏‏‏عَنْ رَافِعٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِنَّا لَاقُو الْعَدُوِّ غَدًا، ‏‏‏‏‏‏وَلَيْسَ مَعَنَا مُدًى ؟، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَا أَنْهَرَ الدَّمَ، ‏‏‏‏‏‏وَذُكِرَ اسْمُ اللَّهِ عَزَّ وَجَلَّ، ‏‏‏‏‏‏فَكُلْ مَا خَلَا السِّنَّ، ‏‏‏‏‏‏وَالظُّفُرَ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَأَصَابَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهْبًا فَنَدَّ بَعِيرٌ، ‏‏‏‏‏‏فَرَمَاهُ رَجُلٌ بِسَهْمٍ فَحَبَسَهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنَّ لِهَذِهِ النَّعَمِ، ‏‏‏‏‏‏أَوْ قَالَ:‏‏‏‏ الْإِبِلِ أَوَابِدَ كَأَوَابِدِ الْوَحْشِ، ‏‏‏‏‏‏فَمَا غَلَبَكُمْ مِنْهَا،‏‏‏‏ فَافْعَلُوا بِهِ هَكَذَا ."
      },
      {
        "id": 39403,
        "hadith_number": "4415",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Cara Menyembelih Haiwan: Penggunaan Alat dan Mengatasi Haiwan Liar",
        "perawi_melayu": "Rafi bin Khadij",
        "english_text": "It was narrated that Rafi bin Khadij said: I said: 'O Messenger of Allah, we are going to meet the enemy tomorrow, and we do not have any knives.' He said: If the blood is shed and the name of Allah is mentioned, then eat, unlike (it is slaughtered) with teeth or nails and I will tell you about that. As for teeth, they are bones, and as for nails, they are the knives of the Ethiopians,; We acquired some spoils of war including sheep or camels, and a camel ran away, so a man shot an arrow at it an stopped it. The Messenger of Allah said: 'some of these animals' or 'these camels'- 'are untamed like wild animals, so if one of them goes out of your control, do the same. (Sahih )",
        "malay_translation": "Diriwayatkan daripada Rafi bin Khadij, beliau berkata: Aku berkata: 'Wahai Rasulullah, sesungguhnya kami akan bertemu musuh esok hari, dan kami tidak mempunyai pisau.' Baginda bersabda: 'Apa sahaja yang mengalirkan darah dan disebut nama Allah, maka makanlah, berbeza dengan (penyembelihan) menggunakan gigi atau kuku, dan aku akan memberitahu kamu mengenai hal itu. Adapun gigi, ia adalah tulang, dan adapun kuku, ia adalah pisau orang Habsyah. Kami mendapat beberapa harta rampasan perang termasuklah biri-biri atau unta, dan seekor unta melarikan diri, lalu seorang lelaki memanah dengan anak panah dan menghentikannya. Rasulullah ﷺ bersabda: 'Sebahagian daripada haiwan-haiwan ini' atau 'unta-unta ini' - 'adalah tidak jinak seperti haiwan liar, maka jika salah satu daripada mereka terlepas daripada kawalan kamu, lakukanlah perkara yang sama.' (Sahih)",
        "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا يَحْيَى بْنُ سَعِيدٍ، ‏‏‏‏‏‏قَالَ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي أَبِي، ‏‏‏‏‏‏عَنْ عَبَايَةَ بْنِ رِفَاعَةَ، ‏‏‏‏‏‏عَنْ رَافِعِ بْنِ خَدِيجٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِنَّا لَاقُو الْعَدُوِّ غَدًا، ‏‏‏‏‏‏وَلَيْسَتْ مَعَنَا مُدًى ؟، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَا أَنْهَرَ الدَّمَ، ‏‏‏‏‏‏وَذُكِرَ اسْمُ اللَّهِ عَزَّ وَجَلَّ فَكُلْ لَيْسَ السِّنَّ، ‏‏‏‏‏‏وَالظُّفُرَ، ‏‏‏‏‏‏وَسَأُحَدِّثُكُمْ، ‏‏‏‏‏‏أَمَّا السِّنُّ:‏‏‏‏ فَعَظْمٌ، ‏‏‏‏‏‏وَأَمَّا الظُّفُرُ:‏‏‏‏ فَمُدَى الْحَبَشَةِ ، ‏‏‏‏‏‏وَأَصَبْنَا نَهْبَةَ إِبِلٍ، ‏‏‏‏‏‏أَوْ غَنَمٍ فَنَدَّ مِنْهَا بَعِيرٌ فَرَمَاهُ رَجُلٌ بِسَهْمٍ فَحَبَسَهُ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ لِهَذِهِ الْإِبِلِ أَوَابِدَ كَأَوَابِدِ الْوَحْشِ، ‏‏‏‏‏‏فَإِذَا غَلَبَكُمْ مِنْهَا شَيْءٌ فَافْعَلُوا بِهِ هَكَذَا ."
      },
      {
        "id": 39404,
        "hadith_number": "4416",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Kebaikan dalam Segala Perkara",
        "perawi_melayu": "Shaddad bin Aws (رَضِيَ ٱللَّٰهُ عَنْهُ)",
        "english_text": "It was narrated that Shaddad bin Aws said: I heard the Messenger of Allah say: 'Allah, the Mighty and Sublime, has decreed proficiency in all things, so when you kill, kill well, and when you slaughter, slaughter well. Let one of you sharpen his blade and spare suffering to the animal he slaughters (Sahih)",
        "malay_translation": "Diriwayatkan bahawa Shaddad bin Aws berkata: Aku mendengar Rasulullah ﷺ bersabda: 'Sesungguhnya Allah, Maha Perkasa lagi Maha Agung, telah menetapkan kebaikan dalam segala perkara. Jika kamu membunuh, maka bunuhlah dengan baik, dan jika kamu menyembelih, sembelihlah dengan baik. Hendaklah seseorang daripada kamu menajamkan bilahnya dan meringankan kesakitan haiwan yang disembelihnya.' (Sahih)",
        "arabic_text": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا إِسْرَائِيلُ، ‏‏‏‏‏‏عَنْ مَنْصُورٍ، ‏‏‏‏‏‏عَنْ خَالِدٍ الْحَذَّاءِ، ‏‏‏‏‏‏عَنْ أَبِي قِلَابَةَ، ‏‏‏‏‏‏عَنْ أَبِي أَسْمَاءَ الرَّحَبِيِّ، ‏‏‏‏‏‏عَنْ أَبِي الْأَشْعَثِ، ‏‏‏‏‏‏عَنْ شَدَّادِ بْنِ أَوْسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ كَتَبَ الْإِحْسَانَ عَلَى كُلِّ شَيْءٍ، ‏‏‏‏‏‏فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا الْقِتْلَةَ، ‏‏‏‏‏‏وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذَّبْحَ، ‏‏‏‏‏‏وَلْيُحِدَّ أَحَدُكُمْ إِذَا ذَبَحَ شَفْرَتَهُ، ‏‏‏‏‏‏وَلْيُرِحْ ذَبِيحَتَهُ ."
      },
      {
        "id": 39405,
        "hadith_number": "4417",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Perintah Allah tentang Melakukan Kebaikan dalam Segala Perkara",
        "perawi_melayu": "Shaddad bin Aws",
        "english_text": "It was narrated that Shaddad bin Aws said: The Messenger of Allah said: 'Allah has decreed proficiency in all things, so when you kill, kill well, and when you slaughter, slaughter well. Let one of you sharpen his blade and spare suffering to the animal he slaughters.'",
        "malay_translation": "Diriwayatkan bahawa Shaddad bin Aws berkata: Rasulullah ﷺ bersabda: 'Sesungguhnya Allah telah mewajibkan kebaikan dalam segala perkara. Apabila kamu membunuh, maka bunuhlah dengan baik. Apabila kamu menyembelih, maka sembelihlah dengan baik. Hendaklah salah seorang daripada kamu menajamkan mata pisaunya dan meringankan penderitaan haiwan yang disembelihnya.'",
        "arabic_text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ أَبُو عَمَّارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا جَرِيرٌ، ‏‏‏‏‏‏عَنْ مَنْصُورٍ، ‏‏‏‏‏‏عَنْ خَالِدٍ الْحَذَّاءِ، ‏‏‏‏‏‏عَنْ أَبِي قِلَابَةَ، ‏‏‏‏‏‏عَنْ أَبِي الْأَشْعَثِ الصَّنْعَانِيِّ، ‏‏‏‏‏‏عَنْ شَدَّادِ بْنِ أَوْسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ اللَّهَ كَتَبَ الْإِحْسَانَ عَلَى كُلِّ شَيْءٍ، ‏‏‏‏‏‏فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا الْقِتْلَةَ، ‏‏‏‏‏‏وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذَّبْحَ، ‏‏‏‏‏‏وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ، ‏‏‏‏‏‏وَلْيُرِحْ ذَبِيحَتَهُ ."
      },
      {
        "id": 39406,
        "hadith_number": "4418",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Kebaikan dalam Membunuh dan Menyembelih",
        "perawi_melayu": "Shadad bin Aws",
        "english_text": "It was narrated that Shadad bin Aws said: I heard two things from the Messenger of Allah He said 'Allah, the Mighty and Sublime, ahs decreed proficiency in all things, so when you kill, kill well, and when you slaughter, slaughter well. Let one of you sharpen his blade and spear suffering to the animal he slaughter. (Sahih )",
        "malay_translation": "Diriwayatkan bahawa Shadad bin Aws berkata: Aku mendengar dua perkara daripada Rasulullah SAW. Baginda bersabda: 'Sesungguhnya Allah SWT telah menetapkan kebaikan (ihsan) dalam segala sesuatu. Apabila kamu membunuh, maka bunuhlah dengan baik; dan apabila kamu menyembelih, maka sembelihlah dengan baik. Hendaklah seseorang daripada kamu menajamkan mata pisau, dan ringankanlah penderitaan haiwan sembelihannya.' (Sahih)",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنْ أَيُّوبَ، ‏‏‏‏‏‏عَنْ أَبِي قِلَابَةَ، ‏‏‏‏‏‏عَنْ أَبِي الْأَشْعَثِ، ‏‏‏‏‏‏عَنْ شَدَّادِ بْنِ أَوْسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ مِنَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اثْنَتَيْنِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ كَتَبَ الْإِحْسَانَ عَلَى كُلِّ شَيْءٍ، ‏‏‏‏‏‏فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا الْقِتْلَةَ، ‏‏‏‏‏‏وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذَّبْحَ، ‏‏‏‏‏‏وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ، ‏‏‏‏‏‏ثُمَّ لِيُرِحْ ذَبِيحَتَهُ ."
      },
      {
        "id": 39407,
        "hadith_number": "4419",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Kebaikan dalam Semua Perkara: Membunuh dan Menyembelih dengan Baik",
        "perawi_melayu": "Shaddad bin Aws",
        "english_text": "It was narrated that Shaddad bin Aws said: Two things that I memorized form the Messenger of Allah; 'Allah, the Mighty and Sublime, has decreed proficiency in all things, so when you kill, kill well, and when you slaughter, slaughter well. Let one of you sharpen his blade and spare suffering to the animal he slaughter, (Sahih )",
        "malay_translation": "Diriwayatkan bahawa Shaddad bin Aws berkata: Dua perkara yang aku hafal daripada Rasulullah ﷺ; 'Sesungguhnya Allah ﷻ, Yang Maha Agung dan Maha Tinggi, telah menetapkan kebaikan dalam segala sesuatu. Maka apabila kamu membunuh, bunuhlah dengan baik, dan apabila kamu menyembelih, sembelihlah dengan baik. Hendaklah seseorang daripada kamu menajamkan mata pisau dan meringankan penderitaan haiwan yang disembelihnya, (Sahih)",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ زُرَيْعٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا خَالِدٌ. ح وَأَنْبَأَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا غُنْدَرٌ، ‏‏‏‏‏‏عَنْ شُعْبَةَ، ‏‏‏‏‏‏عَنْ خَالِدٍ، ‏‏‏‏‏‏عَنْ أَبِي قِلَابَةَ، ‏‏‏‏‏‏عَنْ أَبِي الْأَشْعَثِ، ‏‏‏‏‏‏عَنْ شَدَّادِ بْنِ أَوْسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ثِنْتَانِ حَفِظْتُهُمَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ كَتَبَ الْإِحْسَانَ عَلَى كُلِّ شَيْءٍ، ‏‏‏‏‏‏فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا الْقِتْلَةَ، ‏‏‏‏‏‏وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذِّبْحَةَ، ‏‏‏‏‏‏لِيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ، ‏‏‏‏‏‏وَلْيُرِحْ ذَبِيحَتَهُ ."
      },
      {
        "id": 39408,
        "hadith_number": "4420",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Pengorbanan Nabi SAW dengan Dua Kambing Jantan Bertanduk",
        "perawi_melayu": "Anas رضي الله عنه",
        "english_text": "Anas said: The Messenger of Allah sacrificed two horned, Amlah rams, saying: 'Allah Akbar and pronouncing the Name of Allah. I saw him slaughtering them with his own hand, and placing his foot on their sides. I said: You heard it from Him? He said: Yes. (Sahih )",
        "malay_translation": "Anas رضي الله عنه berkata: Rasulullah SAW telah menyembelih dua ekor kambing jantan berwarna putih bercampur hitam yang bertanduk. Baginda mengucapkan 'Allahu Akbar' dan menyebut nama Allah. Aku melihat baginda menyembelihnya dengan tangan baginda sendiri, dan meletakkan kaki baginda pada sisi kambing-kambing itu. Aku bertanya: Adakah kamu mendengarnya sendiri daripada baginda? Beliau menjawab: Ya.",
        "arabic_text": "أَخْبَرَنَا إِسْمَاعِيل بْنُ مَسْعُودٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا خَالِدٌ، ‏‏‏‏‏‏عَنْ شُعْبَةَ، ‏‏‏‏‏‏أَخْبَرَنِي قَتَادَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ أَنَسًا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ، ‏‏‏‏‏‏يُكَبِّرُ، ‏‏‏‏‏‏وَيُسَمِّي، ‏‏‏‏‏‏وَلَقَدْ رَأَيْتُهُ يَذْبَحُهُمَا بِيَدِهِ، ‏‏‏‏‏‏وَاضِعًا عَلَى صِفَاحِهِمَا قَدَمَهُ . قُلْتُ:‏‏‏‏ أَنْتَ سَمِعْتَهُ مِنْهُ ؟، ‏‏‏‏‏‏قَالَ:‏‏‏‏ نَعَمْ."
      },
      {
        "id": 39409,
        "hadith_number": "4421",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Pengorbanan Nabi SAW dengan Dua Ekor Kambing",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "Anas bin Malik said: The Messenger of Allah used to sacrifice two pronounce the name of Allah and say: 'Allah Akabar,' and I saw him slaughtering them with his own hand, and placing his foot on their sides (Sahih )",
        "malay_translation": "Anas bin Malik berkata: Rasulullah SAW biasa mengorbankan dua ekor kambing yang berwarna putih kehitaman, baginda menyebut nama Allah dan berkata: 'Allah Akabar,' dan saya melihat baginda menyembelihnya dengan tangan baginda sendiri, serta meletakkan kaki baginda di sisi mereka. (Sahih)",
        "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ نَاصِحٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا هُشَيْمٌ، ‏‏‏‏‏‏عَنْ شُعْبَةَ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُضَحِّي بِكَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ، ‏‏‏‏‏‏وَكَانَ يُسَمِّي، ‏‏‏‏‏‏وَيُكَبِّرُ، ‏‏‏‏‏‏وَلَقَدْ رَأَيْتُهُ يَذْبَحُهُمَا بِيَدِهِ، ‏‏‏‏‏‏وَاضِعًا رِجْلَهُ عَلَى صِفَاحِهِمَا ."
      },
      {
        "id": 39410,
        "hadith_number": "4422",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Nabi SAW Menyembelih Korban Sendiri",
        "perawi_melayu": "Anas (Semoga Allah meredhainya)",
        "english_text": "It was narrated that Anas said: I saw him: - meaning the Prophet - slaughtering them with his own hand, and placing his foot on their sides, pronouncing the name of Allah and saying: 'Allah Akbar,' (sacrificing) two horned, Amlah rams. (Sahih )",
        "malay_translation": "Diriwayatkan bahawa Anas berkata: Aku melihat baginda - iaitu Nabi - menyembelih korban dengan tangan baginda sendiri, meletakkan kaki baginda pada sisi mereka, menyebut nama Allah dan mengucapkan: 'Allahu Akbar,' (mengorbankan) dua ekor kibas jantan yang bertanduk, Amlah. (Sahih)",
        "arabic_text": "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا مُصْعَبُ بْنُ الْمِقْدَامِ، ‏‏‏‏‏‏عَنِ الْحَسَنِ يَعْنِي ابْنَ صَالِحٍ، ‏‏‏‏‏‏عَنْ شُعْبَةَ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَقَدْ رَأَيْتُهُ يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَذْبَحُهُمَا بِيَدِهِ، ‏‏‏‏‏‏وَاضِعًا عَلَى صِفَاحِهِمَا قَدَمَهُ، ‏‏‏‏‏‏يُسَمِّي، ‏‏‏‏‏‏وَيُكَبِّرُ،‏‏‏‏ كَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ ."
      },
      {
        "id": 39411,
        "hadith_number": "4423",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Pengorbanan Nabi SAW dengan Dua Kambing Biri-biri Bertanduk",
        "perawi_melayu": "Anas bin Malik (Semoga Allah meredhainya)",
        "english_text": "It was narrated that Anas bin Malik told them that: the Prophet sacrificed two Amlah horned rams, putting his foot on their sides and slaughtering them pronouncing the name of Allah, and saying: Allahu Akbar. (Sahih )",
        "malay_translation": "Diriwayatkan bahawa Anas bin Malik memberitahu mereka bahawa: Nabi SAW telah berkorban dengan dua ekor kambing biri-biri bertanduk Amlah, meletakkan kaki baginda di sisi mereka dan menyembelih mereka sambil menyebut nama Allah, dan berkata: Allahu Akbar. (Sahih)",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا سَعِيدٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا قَتَادَةُ، ‏‏‏‏‏‏أَنَّ أَنَسَ بْنَ مَالِكٍ حَدَّثَهُمْ:‏‏‏‏ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَحَّى بِكَبْشَيْنِ أَقْرَنَيْنِ أَمْلَحَيْنِ، ‏‏‏‏‏‏يَطَؤُ عَلَى صِفَاحِهِمَا، ‏‏‏‏‏‏وَيَذْبَحُهُمَا، ‏‏‏‏‏‏وَيُسَمِّي، ‏‏‏‏‏‏وَيُكَبِّرُ ."
      },
      {
        "id": 39412,
        "hadith_number": "4424",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Nabi SAW Menyembelih Haiwan Korban Sendiri dan Orang Lain",
        "perawi_melayu": "Jabir bin 'Abdullah",
        "english_text": "It was narrated from Jabir bin 'Abdullah that: the Messenger of Allah slaughtered some of his sacrificial animals with his won hand, and someone else slaughtered some of them. (Sahih )",
        "malay_translation": "Diriwayatkan daripada Jabir bin 'Abdullah bahawa: Rasulullah SAW telah menyembelih sebahagian daripada haiwan korban baginda dengan tangan baginda sendiri, dan ada orang lain menyembelih sebahagian daripadanya. (Sahih)",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، ‏‏‏‏‏‏عَنِ ابْنِ الْقَاسِمِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي مَالِكٌ، ‏‏‏‏‏‏عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ:‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحَرَ بَعْضَ بُدْنِهِ بِيَدِهِ، ‏‏‏‏‏‏وَنَحَرَ بَعْضَهَا غَيْرُهُ ."
      },
      {
        "id": 39413,
        "hadith_number": "4425",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Asma' menceritakan penyembelihan kuda dan memakannya",
        "perawi_melayu": "Asma' (Semoga Allah meredhainya)",
        "english_text": "It was narrated that Asma said: We slaughtered (Naharna) a horse during the time of Messenger of Allah and ate it. In his hadith Qutaibah (one of the narrators) said: And we ate its meat. (Sahih ) 'Abdah bin sulaiman contradicted him.",
        "malay_translation": "Diriwayatkan bahawa Asma' berkata: Kami menyembelih (Naharna) seekor kuda pada zaman Rasulullah SAW dan memakannya. Dalam hadisnya, Qutaibah (salah seorang perawi) berkata: Dan kami memakan dagingnya. (Sahih) 'Abdah bin Sulaiman menyanggahnya.",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ،‏‏‏‏ قَالَا:‏‏‏‏ حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ فَاطِمَةَ، ‏‏‏‏‏‏عَنْ أَسْمَاءَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ نَحَرْنَا فَرَسًا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَكَلْنَاهُ ، ‏‏‏‏‏‏وَقَالَ قُتَيْبَةُ فِي حَدِيثِهِ:‏‏‏‏ فَأَكَلْنَا لَحْمَهُ. خَالَفَهُ عَبْدَةُ بْنُ سُلَيْمَانَ."
      },
      {
        "id": 39414,
        "hadith_number": "4426",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Memakan Daging Kuda Semasa di Madinah",
        "perawi_melayu": "Asma' (Semoga Allah meredhainya)",
        "english_text": "It was narrated that Asma said: We slaughtered (naharna) a horse during the time of the Messenger of Allah while we were in Al-Madinah, and we ate it. (Sahih )",
        "malay_translation": "Diriwayatkan bahawa Asma' berkata: Kami menyembelih (naharna) seekor kuda pada zaman Rasulullah ﷺ semasa kami berada di Al-Madinah, dan kami memakannya. (Sahih)",
        "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ آدَمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدَةُ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ فَاطِمَةَ، ‏‏‏‏‏‏عَنْ أَسْمَاءَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ ذَبَحْنَا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَسًا، ‏‏‏‏‏‏وَنَحْنُ بِالْمَدِينَةِ فَأَكَلْنَاهُ ."
      },
      {
        "id": 39415,
        "hadith_number": "4427",
        "status": "Sahih (Sahih)",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Empat Perkara yang Dilaknat oleh Allah (S.W.T)",
        "perawi_melayu": "'Amir bin Wathilah",
        "english_text": "It was narrated that 'Amir bin Wathilah said: A man asked 'Ali Did the Messenger of Allah used to tell you anything in secret that he did not tell the people?' Ali got so angry that his face turned red, and he said: 'He used not to tell me anything in secret that he di8d not tell the people except that he told me four things when he and I were alone in the house. He said: Allah curses the alone who curses his father, Allah curses the one who offers a sacrifice to anyone other than Allah, Allah curse the one who gives refuge to an offender and Allah curses the one who changes boundary markers. (Sahih )",
        "malay_translation": "Diriwayatkan daripada 'Amir bin Wathilah, katanya: Seorang lelaki bertanya kepada 'Ali, \"Adakah Rasulullah (S.A.W) pernah memberitahu sesuatu rahsia kepadamu yang tidak diberitahu kepada orang lain?\" 'Ali berasa sangat marah sehingga mukanya menjadi merah, dan dia berkata: \"Baginda tidak pernah memberitahu aku sesuatu rahsia yang tidak diberitahu kepada orang lain, kecuali baginda memberitahu aku empat perkara ketika aku dan baginda bersendirian di dalam rumah. Baginda bersabda: 'Allah melaknat orang yang melaknat ibu bapanya, Allah melaknat orang yang menyembelih korban kepada selain Allah, Allah melaknat orang yang memberi perlindungan kepada penjenayah, dan Allah melaknat orang yang mengubah tanda sempadan.' (Sahih)",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يَحْيَى وَهُوَ ابْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ، ‏‏‏‏‏‏عَنْ ابْنِ حَيَّانَ يَعْنِي مَنْصُورًا، ‏‏‏‏‏‏عَنْ عَامِرِ بْنِ وَاثِلَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَأَلَ رَجُلٌ عَلِيًّا، ‏‏‏‏‏‏هَلْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسِرُّ إِلَيْكَ بِشَيْءٍ دُونَ النَّاسِ ؟،‏‏‏‏ فَغَضِبَ عَلِيٌّ حَتَّى احْمَرَّ وَجْهُهُ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ مَا كَانَ يُسِرُّ إِلَيَّ شَيْئًا دُونَ النَّاسِ، ‏‏‏‏‏‏غَيْرَ أَنَّهُ حَدَّثَنِي، ‏‏‏‏‏‏بِأَرْبَعِ كَلِمَاتٍ، ‏‏‏‏‏‏وَأَنَا وَهُوَ فِي الْبَيْتِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ لَعَنَ اللَّهُ مَنْ لَعَنَ وَالِدَهُ، ‏‏‏‏‏‏وَلَعَنَ اللَّهُ مَنْ ذَبَحَ لِغَيْرِ اللَّهِ، ‏‏‏‏‏‏وَلَعَنَ اللَّهُ مَنْ آوَى مُحْدِثًا، ‏‏‏‏‏‏وَلَعَنَ اللَّهُ مَنْ غَيَّرَ مَنَارَ الْأَرْضِ ."
      },
      {
        "id": 39416,
        "hadith_number": "4428",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Larangan Memakan Daging Korban Selepas Tiga Hari",
        "perawi_melayu": "Daripada Ibn 'Umar",
        "english_text": "It was narrated from Ibn 'Umar that: the Messenger of Allah forbade eating the meat of sacrificial animals after three days (Sahih )",
        "malay_translation": "Diriwayatkan daripada Ibn 'Umar bahawa: Rasulullah ﷺ melarang memakan daging haiwan korban selepas tiga hari (Sahih).",
        "arabic_text": "أَخْبَرَنَا إِسْحَاق بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ سَالِمٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ نَهَى أَنْ تُؤْكَلَ لُحُومُ الْأَضَاحِيِّ بَعْدَ ثَلَاثٍ ."
      },
      {
        "id": 39417,
        "hadith_number": "4429",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Solat Hari Raya dan Larangan Menyimpan Korban Lebih Tiga Hari",
        "perawi_melayu": "Abu 'Ubaid, bekas hamba Ibn 'Awf",
        "english_text": "It ws narrated that Abu 'Ubaid - the freed slave of Ibn 'Awf - said: I saw 'Ali bin Abi Talib - may Allah honor his face on the day of 'Id. He started with the prayer before the Khutbah, and then he prayed with no Adhan and no Iqamah. Then he said: 'I heard the Messenger of Allah forbidding anyone form keeping anything of his sacrificial animal for more than three days. (Sahih )",
        "malay_translation": "Diriwayatkan bahawa Abu 'Ubaid - bekas hamba Ibn 'Awf - berkata: Saya melihat 'Ali bin Abi Talib - semoga Allah memuliakan wajahnya pada hari 'Id. Dia memulakan dengan solat sebelum Khutbah, dan kemudian dia solat tanpa Azan dan tanpa Iqamah. Kemudian dia berkata: 'Saya mendengar Rasulullah ﷺ melarang sesiapa sahaja daripada menyimpan sebarang bahagian daripada haiwan korbannya melebihi tiga hari. (Sahih)",
        "arabic_text": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ غُنْدَرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا مَعْمَرٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا الزُّهْرِيُّ، ‏‏‏‏‏‏عَنْ أَبِي عُبَيْدٍ مَوْلَى ابْنِ عَوْفٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ شَهِدْتُ عَلِيَّ بْنَ أَبِي طَالِبٍ كَرَّمَ اللَّهُ وَجْهَهُ فِي يَوْمِ عِيدٍ، ‏‏‏‏‏‏بَدَأَ بِالصَّلَاةِ قَبْلَ الْخُطْبَةِ، ‏‏‏‏‏‏ثُمَّ صَلَّى بِلَا أَذَانٍ، ‏‏‏‏‏‏وَلَا إِقَامَةٍ، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَنْهَى أَنْ يُمْسِكَ أَحَدٌ مِنْ نُسُكِهِ شَيْئًا فَوْقَ ثَلَاثَةِ أَيَّامٍ ."
      },
      {
        "id": 39418,
        "hadith_number": "4430",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Larangan Memakan Daging Korban Lebih Daripada Tiga Hari",
        "perawi_melayu": "Ali bin Abi Talib رضي الله عنه",
        "english_text": "Ali bin Abi Talib Said: The Messenger of Allah has forbidden you from eating the meat of your sacrificaial animals for more than three day. (Sahih )",
        "malay_translation": "Ali bin Abi Talib رضي الله عنه berkata: Rasulullah ﷺ telah melarang kamu daripada memakan daging korban kamu lebih daripada tiga hari. (Sahih)",
        "arabic_text": "أَخْبَرَنَا أَبُو دَاوُدَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يَعْقُوبُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبِي، ‏‏‏‏‏‏عَنْ صَالِحٍ، ‏‏‏‏‏‏عَنِ ابْنِ شِهَابٍ، ‏‏‏‏‏‏أَنَّ أَبَا عُبَيْدٍ أَخْبَرَهُ، ‏‏‏‏‏‏أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ نَهَاكُمْ أَنْ تَأْكُلُوا لُحُومَ نُسُكِكُمْ فَوْقَ ثَلَاثٍ ."
      },
      {
        "id": 39419,
        "hadith_number": "4431",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Larangan Memakan Daging Korban Selepas Tiga Hari",
        "perawi_melayu": "Jabir bin 'Abdullah",
        "english_text": "It was narrated from Jabir bin 'Abdullah that: the Messenger of Allah forbade eating the meat of the sacrificial animals after three days then he said: Eat, take some with you (if traveling). And store some. ( Sahih)",
        "malay_translation": "Diriwayatkan daripada Jabir bin 'Abdullah bahawa: Rasulullah SAW melarang memakan daging haiwan korban selepas tiga hari kemudian Baginda bersabda: Makanlah, bawalah sedikit bersama kamu (jika bermusafir). Dan simpanlah sebahagiannya.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ، ‏‏‏‏‏‏عَنِ ابْنِ الْقَاسِمِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي مَالِكٌ، ‏‏‏‏‏‏عَنْ أَبِي الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏أَنَّهُ أَخْبَرَهُ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ أَكْلِ لُحُومِ الضَّحَايَا بَعْدَ ثَلَاثٍ، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ كُلُوا، ‏‏‏‏‏‏وَتَزَوَّدُوا، ‏‏‏‏‏‏وَادَّخِرُوا ."
      },
      {
        "id": 39420,
        "hadith_number": "4432",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Kebenaran Memakan Daging Korban Selepas Tiga Hari",
        "perawi_melayu": "Daripada Ibn Khabbab - yang merupakan 'Abdullah bin Khabbab -",
        "english_text": "It was narrated from Ibn Khabbab - who is 'Abdullah bin Khabbab - that: Abu Sa 'eed Al- Kahudri arrived from a jouney and his family offered him some meat from the sacrificial animal. He said: I am not going to eat it until I ask about it, So he went to his half-brother through his mother, Qatadah bin An- Nu man who had been presently at Badr, and asked him about that. He said: The opposite of what you were forbidden occurred after that, and (Permission was granted) to eat the sacrificial meat after three days (Sahih )",
        "malay_translation": "Diriwayatkan daripada Ibn Khabbab - iaitu 'Abdullah bin Khabbab - bahawa: Abu Sa'eed Al-Khudri tiba dari satu perjalanan dan keluarganya menghidangkannya sedikit daging daripada haiwan korban. Beliau berkata: \"Saya tidak akan memakannya sehingga saya bertanya tentangnya.\" Lalu, beliau pergi kepada saudara seibunya, Qatadah bin An-Nu'man yang turut serta dalam Perang Badar, dan bertanya kepadanya tentang perkara itu. Beliau berkata: \"Perkara yang bertentangan dengan apa yang kamu dilarang telah berlaku selepas itu, dan (Kebenaran telah diberikan) untuk memakan daging korban selepas tiga hari (Sahih).\"",
        "arabic_text": "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ زُغْبَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا اللَّيْثُ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ، ‏‏‏‏‏‏عَنِ ابْنِ خَبَّابٍ هُوَ عَبْدُ اللَّهِ بْنُ خَبَّابٍ، ‏‏‏‏‏‏أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ، ‏‏‏‏‏‏قَدِمَ مِنْ سَفَرٍ، ‏‏‏‏‏‏فَقَدَّمَ إِلَيْهِ أَهْلُهُ لَحْمًا مِنْ لُحُومِ الْأَضَاحِيِّ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا أَنَا بِآكِلِهِ حَتَّى أَسْأَلَ، ‏‏‏‏‏‏فَانْطَلَقَ إِلَى أَخِيهِ لِأُمِّهِ قَتَادَةَ بْنِ النُّعْمَانِ، ‏‏‏‏‏‏وَكَانَ بَدْرِيًّا،‏‏‏‏ فَسَأَلَهُ عَنْ ذَلِكَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنَّهُ قَدْ حَدَثَ بَعْدَكَ أَمْرٌ نَقْضًا لِمَا كَانُوا نُهُوا عَنْهُ مِنْ أَكْلِ لُحُومِ الْأَضَاحِيِّ بَعْدَ ثَلَاثَةِ أَيَّامٍ ."
      },
      {
        "id": 39421,
        "hadith_number": "4433",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Larangan dan Kebenaran Memakan Daging Korban Melebihi Tiga Hari",
        "perawi_melayu": "Abu Sa'eed Al-Khudri",
        "english_text": "It was narrated from Abu Sa'eed Al-Khudri that: the Messenger of Alllah forbade (Eating) the meat of sacrificial animals after three days. Then Qatadh bin An-Nu' man, who was brother of Abu Sa'eed through his mo0ther, and had been present at Badr, came and they offered him (some of the meat) .He said: Didn't the Messenger of Allah forbid it? Abu Sa eed said: Something happened later. The Messenger of Allah forbade us to eat it for more than three days, then he allowed us to eat it and store it. (Sahih )",
        "malay_translation": "Diriwayatkan daripada Abu Sa'eed Al-Khudri bahawa: Rasulullah SAW melarang (memakan) daging haiwan korban selepas tiga hari. Kemudian Qatadah bin An-Nu'man, yang merupakan saudara lelaki Abu Sa'eed melalui ibunya, dan telah hadir di Badr, datang dan mereka menawarkan kepadanya (sebahagian daripada daging itu). Dia berkata: Bukankah Rasulullah SAW melarangnya? Abu Sa'eed berkata: Sesuatu telah berlaku kemudiannya. Rasulullah SAW melarang kami memakannya lebih daripada tiga hari, kemudian baginda membenarkan kami memakannya dan menyimpannya. (Sahih)",
        "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏عَنْ سَعْدِ بْنِ إِسْحَاق، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَتْنِي زَيْنَبُ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ:‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ لُحُومِ الْأَضَاحِيِّ فَوْقَ ثَلَاثَةِ أَيَّامٍ، ‏‏‏‏‏‏فَقَدِمَ قَتَادَةُ بْنُ النُّعْمَانِ، ‏‏‏‏‏‏وَكَانَ أَخَا أَبِي سَعِيدٍ لِأُمِّهِ، ‏‏‏‏‏‏وَكَانَ بَدْرِيًّا، ‏‏‏‏‏‏فَقَدَّمُوا إِلَيْهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَلَيْسَ قَدْ نَهَى عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ؟، ‏‏‏‏‏‏قَالَ أَبُو سَعِيدٍ:‏‏‏‏ إِنَّهُ قَدْ حَدَثَ فِيهِ أَمْرٌ:‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَانَا أَنْ نَأْكُلَهُ فَوْقَ ثَلَاثَةِ أَيَّامٍ، ‏‏‏‏‏‏ثُمَّ رَخَّصَ لَنَا أَنْ نَأْكُلَهُ، ‏‏‏‏‏‏وَنَدَّخِرَهُ ."
      },
      {
        "id": 39422,
        "hadith_number": "4434",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Larangan Dahulu dan Kebenaran Kemudian Mengenai Ziarah Kubur, Daging Korban, dan Minuman",
        "perawi_melayu": "Daripada Ibn Buraidah, daripada bapanya",
        "english_text": "It was narrated from Ibn Buraidah that his father said: The Messenger of Allah said: 'I used to forbid you from doing three things: to visit graves, but now visit three, for you may benefit from that. And I used to forbid you (from eating) the meat of sacrificial animals after three days but now eat it, and keep whatever you want. A and I forbade you to drink form (certain kinds of) vessels, but now drink form whatever kind of vessel you want but do not drink any kind of intoxicant. (Sahih ) Muhammad (one of the narrators) did not mention: kept (whatever you want).",
        "malay_translation": "Diriwayatkan daripada Ibn Buraidah bahawa bapanya berkata: Rasulullah ﷺ bersabda: \"Sesungguhnya aku melarang kamu daripada tiga perkara: menziarahi kubur, tetapi sekarang ziarahilah, kerana ia memberi manfaat kepada kamu. Dan aku melarang kamu (memakan) daging haiwan korban selepas tiga hari, tetapi sekarang makanlah ia, dan simpanlah apa yang kamu mahu. Dan aku melarang kamu daripada minum daripada bekas (tertentu), tetapi sekarang minumlah daripada mana-mana bekas yang kamu mahu tetapi jangan minum sebarang minuman yang memabukkan.\" (Sahih) Muhammad (salah seorang perawi) tidak menyebut: simpan (apa yang kamu mahu).",
        "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ وَهُوَ النُّفَيْلِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا زُهَيْرٌ. ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ مَعْدَانَ بْنِ عِيسَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا زُهَيْرٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا زُبَيْدُ بْنُ الْحَارِثِ، ‏‏‏‏‏‏عَنْ مُحَارِبِ بْنِ دِثَارٍ، ‏‏‏‏‏‏عَنِ ابْنِ بُرَيْدَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنِّي كُنْتُ نَهَيْتُكُمْ عَنْ ثَلَاثٍ، ‏‏‏‏‏‏عَنْ زِيَارَةِ الْقُبُورِ فَزُورُوهَا، ‏‏‏‏‏‏وَلْتَزِدْكُمْ زِيَارَتُهَا خَيْرًا، ‏‏‏‏‏‏وَنَهَيْتُكُمْ عَنْ لُحُومِ الْأَضَاحِيِّ بَعْدَ ثَلَاثٍ، ‏‏‏‏‏‏فَكُلُوا مِنْهَا، ‏‏‏‏‏‏وَأَمْسِكُوا مَا شِئْتُمْ، ‏‏‏‏‏‏وَنَهَيْتُكُمْ عَنِ الْأَشْرِبَةِ فِي الْأَوْعِيَةِ، ‏‏‏‏‏‏فَاشْرَبُوا فِي أَيِّ وِعَاءٍ شِئْتُمْ، ‏‏‏‏‏‏وَلَا تَشْرَبُوا مُسْكِرًا . وَلَمْ يَذْكُرْ مُحَمَّدٌ:‏‏‏‏ وَأَمْسِكُوا."
      },
      {
        "id": 39423,
        "hadith_number": "4435",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Kebenaran Memakan Daging Korban, Ziarah Kubur, dan Peringatan tentang Arak",
        "perawi_melayu": "Ibn Buraidah daripada bapanya",
        "english_text": "It was narrated from Ibn Buraidah that his fhater said: The Messenger of Allah said: I used to forbid you (from eating) the meat of sacrificial animals after three days, and to (make) Nadidh except in a water skin, and to visit graves. But now eat whatever you want of the meat, or take some with you (when traveling) or store it: and whoever wants to visit graves, it will remind him of the Hereafter; and drink, but beware of any kind of intoxicant. ' (Sahih )",
        "malay_translation": "Diriwayatkan daripada Ibn Buraidah bahawa bapanya berkata: Rasulullah ﷺ bersabda: “Sesungguhnya aku pernah melarang kamu (daripada memakan) daging korban selepas tiga hari, dan membuat Nadidh kecuali di dalam bekas air, dan daripada menziarahi kubur. Tetapi sekarang makanlah daging korban seberapa yang kamu mahu, atau bawalah sebahagiannya bersama kamu (ketika bermusafir) atau simpanlah: dan sesiapa yang ingin menziarahi kubur, ia akan mengingatkannya kepada Akhirat; dan minumlah, tetapi berwaspadalah daripada sebarang jenis minuman yang memabukkan.” (Sahih)",
        "arabic_text": "أَخْبَرَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، ‏‏‏‏‏‏عَنْ الْأَحْوَصِ بْنِ جَوَّابٍ، ‏‏‏‏‏‏عَنْ عَمَّارِ بْنِ رُزَيْقٍ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنِ الزُّبَيْرِ بْنِ عَدِيٍّ، ‏‏‏‏‏‏عَنِ ابْنِ بُرَيْدَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنِّي كُنْتُ نَهَيْتُكُمْ عَنْ لُحُومِ الْأَضَاحِيِّ بَعْدَ ثَلَاثٍ، ‏‏‏‏‏‏وَعَنِ النَّبِيذِ إِلَّا فِي سِقَاءٍ، ‏‏‏‏‏‏وَعَنْ زِيَارَةِ الْقُبُورِ، ‏‏‏‏‏‏فَكُلُوا مِنْ لُحُومِ الْأَضَاحِيِّ مَا بَدَا لَكُمْ، ‏‏‏‏‏‏وَتَزَوَّدُوا وَادَّخِرُوا، ‏‏‏‏‏‏وَمَنْ أَرَادَ زِيَارَةَ الْقُبُورِ فَإِنَّهَا تُذَكِّرُ الْآخِرَةَ، ‏‏‏‏‏‏وَاشْرَبُوا، ‏‏‏‏‏‏وَاتَّقُوا كُلَّ مُسْكِرٍ ."
      },
      {
        "id": 39424,
        "hadith_number": "4436",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Kebenaran Memakan Daging Korban dan Penyimpanannya",
        "perawi_melayu": "Aisyah (RA)",
        "english_text": "It was narrated that 'Aishah said: Some Bedouins came to Al-Madinah at the time of (Eid) Al-Adha and the Messenger of Allah said: 'Eat, and store (the meat) for three days.' After that they said: 'O Messenger of Allah, the people used to benefit form their sacrifices by melting down the fat, and (also) making water skins from them.' He said: 'Why are you asking?' He said: 'Because you forbade us form keeping the meat of the sacrificial animals.' He said: 'I only forbade that because of the Bedouins who came. (Now) eat it, store it and give it in charity, (Sahih )",
        "malay_translation": "Diriwayatkan daripada Aisyah (RA) bahawa: Beberapa orang Badwi datang ke Al-Madinah pada waktu (Hari Raya) Al-Adha dan Rasulullah SAW bersabda: 'Makanlah, dan simpanlah (daging) selama tiga hari.' Selepas itu mereka berkata: 'Wahai Rasulullah, orang ramai dahulu mendapat manfaat daripada korban mereka dengan mencairkan lemak, dan (juga) membuat bekas air daripadanya.' Baginda bersabda: 'Mengapa kamu bertanya?' Mereka berkata: 'Kerana engkau melarang kami daripada menyimpan daging haiwan korban.' Baginda bersabda: 'Sesungguhnya aku melarang kerana (kedatangan) orang-orang Badwi yang datang. (Sekarang) makanlah, simpanlah dan sedekahkanlah, (Sahih )",
        "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ، ‏‏‏‏‏‏عَنْ عَمْرَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ دَفَّتْ دَافَّةٌ مِنْ أَهْلِ الْبَادِيَةِ حَضْرَةَ الْأَضْحَى، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ كُلُوا، ‏‏‏‏‏‏وَادَّخِرُوا ثَلَاثًا ، ‏‏‏‏‏‏فَلَمَّا كَانَ بَعْدَ ذَلِكَ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِنَّ النَّاسَ كَانُوا يَنْتَفِعُونَ مِنْ أَضَاحِيِّهِمْ، ‏‏‏‏‏‏يَجْمُلُونَ مِنْهَا الْوَدَكَ، ‏‏‏‏‏‏وَيَتَّخِذُونَ مِنْهَا الْأَسْقِيَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَمَا ذَاكَ ؟، ‏‏‏‏‏‏قَالَ:‏‏‏‏ الَّذِي نَهَيْتَ مِنْ إِمْسَاكِ لُحُومِ الْأَضَاحِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنَّمَا نَهَيْتُ لِلدَّافَّةِ الَّتِي دَفَّتْ كُلُوا، ‏‏‏‏‏‏وَادَّخِرُوا، ‏‏‏‏‏‏وَتَصَدَّقُوا ."
      },
      {
        "id": 39425,
        "hadith_number": "4437",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Larangan Makan Daging Korban Melebihi Tiga Hari Kerana Keperluan",
        "perawi_melayu": "'Abdur-Rahman bin 'Abis daripada bapanya",
        "english_text": "It was narrated from 'Abdur-Rahman bin 'Abis that his father said: I came in to 'Aishah and said: 'Did the Messenger of Allah forbid (eating) the meat of sacrificial animals after three day?' She said: 'Yes Hardship had befallen the people, and the Messenger of Allah wanted the rich to feed the poor.' Then she said: 'I remember the family of Muhammad eating the trotters after fifteen days. I said: 'Why is that She laughed and said: 'The family of Muhammad never ate their fill of bread and something to go with it, for three days in row, until he met Allah, the Mighty and Sublime, ' (Sahih )",
        "malay_translation": "Diriwayatkan daripada 'Abdur-Rahman bin 'Abis bahawa bapanya berkata: Aku masuk menemui 'Aishah dan berkata: 'Adakah Rasulullah SAW melarang (makan) daging korban selepas tiga hari?' Dia berkata: 'Ya. Kesulitan telah menimpa orang ramai, dan Rasulullah SAW ingin orang kaya memberi makan kepada orang miskin.' Kemudian dia berkata: 'Aku teringat keluarga Muhammad memakan kaki haiwan selepas lima belas hari.' Aku bertanya: 'Mengapa begitu?' Dia ketawa dan berkata: 'Keluarga Muhammad tidak pernah kenyang makan roti dan lauknya selama tiga hari berturut-turut, sehingga baginda bertemu Allah, Yang Maha Perkasa dan Maha Agung.' (Sahih)",
        "arabic_text": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ دَخَلْتُ عَلَى عَائِشَةَ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ أَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْ لُحُومِ الْأَضَاحِيِّ بَعْدَ ثَلَاثٍ ؟، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ نَعَمْ،‏‏‏‏ أَصَابَ النَّاسَ شِدَّةٌ، ‏‏‏‏‏‏فَأَحَبَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُطْعِمَ الْغَنِيُّ الْفَقِيرَ، ‏‏‏‏‏‏ثُمَّ قَالَت:‏‏‏‏ لَقَدْ رَأَيْتُ آلَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُونَ الْكُرَاعَ بَعْدَ خَمْسَ عَشْرَةَ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ مِمَّ ذَاكَ ؟ فَضَحِكَتْ، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ مَا شَبِعَ آلُ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ خُبْزٍ مَأْدُومٍ ثَلَاثَةَ أَيَّامٍ، ‏‏‏‏‏‏حَتَّى لَحِقَ بِاللَّهِ عَزَّ وَجَلَّ ."
      },
      {
        "id": 39426,
        "hadith_number": "4438",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Menyimpan Kaki Haiwan Korban untuk Dimakan",
        "perawi_melayu": "'Abdur Rahman bin 'Abis dari bapanya",
        "english_text": "It was narrated from 'Abdur'Rahman bin 'Abis that his father said: I asked 'Aishah about the meat of the sacrificial animals and she said: 'We used to keep the trotters for the Messenger of Allah for a month, then he would eat them.",
        "malay_translation": "Diriwayatkan daripada 'Abdur Rahman bin 'Abis bahawa bapanya berkata: Saya bertanya kepada 'Aishah tentang daging haiwan korban, lalu dia berkata: 'Kami pernah menyimpan kaki (trotter) untuk Rasulullah ﷺ selama sebulan, kemudian baginda memakannya.",
        "arabic_text": "أَخْبَرَنَا يُوسُفُ بْنُ عِيسَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ زِيَادِ بْنِ أَبِي الْجَعْدِ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَأَلْتُ عَائِشَةَ عَنْ لُحُومِ الْأَضَاحِيِّ ؟، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كُنَّا نَخْبَأُ الْكُرَاعَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَهْرًا، ‏‏‏‏‏‏ثُمَّ يَأْكُلُهُ ."
      },
      {
        "id": 39427,
        "hadith_number": "4439",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Larangan Menyimpan Daging Korban Lebih Tiga Hari",
        "perawi_melayu": "Abu Sa'eed Al-Khudri",
        "english_text": "It was narrated that Abu sa'eed Al-aKhudri said: The Messenger of Allah forbade keeping the meat of the sacrificial animals for more than three days, then he said: 'Eat and feed other, ' (Sahih )",
        "malay_translation": "Diriwayatkan bahawa Abu Sa'eed Al-Khudri berkata: Rasulullah ﷺ melarang menyimpan daging haiwan korban lebih daripada tiga hari, kemudian baginda bersabda: 'Makanlah dan berilah makan orang lain.' (Sahih)",
        "arabic_text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا عَبْدُ اللَّهِ، ‏‏‏‏‏‏عَنِ ابْنِ عَوْنٍ، ‏‏‏‏‏‏عَنِ ابْنِ سِيرِينَ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ إِمْسَاكِ الْأُضْحِيَّةِ فَوْقَ ثَلَاثَةِ أَيَّامٍ، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ كُلُوا، ‏‏‏‏‏‏وَأَطْعِمُوا ."
      },
      {
        "id": 39428,
        "hadith_number": "4440",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Abdullah bin Mughaffal dan Beg Lemak di Khaibar",
        "perawi_melayu": "Abdullah bin Mughaffal (Semoga Allah merahmatinya)",
        "english_text": "Abdullah bin Mughaffal said: A bag of fat was thrown on the day of Khaibar, and I caught it and said: I will not give anything of this to anyone.' I turned around and saw the Messenger of Allah there, smiling. (Sahih )",
        "malay_translation": "Abdullah bin Mughaffal berkata: 'Sebuah beg berisi lemak dijatuhkan pada hari Khaibar, lalu aku menyambutnya dan berkata: 'Aku tidak akan memberikan sedikit pun daripada ini kepada sesiapa pun.' Aku berpaling dan melihat Rasulullah s.a.w. di situ, tersenyum. (Sahih)",
        "arabic_text": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ‏‏‏‏‏‏عَنْ سُلَيْمَانَ بْنِ مُغِيرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حُمَيْدُ بْنُ هِلَالٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُغَفَّلٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ دُلِّيَ جِرَابٌ مِنْ شَحْمٍ يَوْمَ خَيْبَرَ فَالْتَزَمْتُهُ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ لَا أُعْطِي أَحَدًا مِنْهُ شَيْئًا، ‏‏‏‏‏‏فَالْتَفَتُّ،‏‏‏‏ فَإِذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَبَسَّمُ ."
      },
      {
        "id": 39429,
        "hadith_number": "4441",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Memakan Daging dari Orang Badwi: Menyebut Nama Allah",
        "perawi_melayu": "'Aishah (r.a.)",
        "english_text": "It was narrated from 'Aishah that: some Bedouin people used to bring us meat, and we did not know whether they had mentioned the Name of Allah (when slaughtering it) or not. The Messenger of Allah said: Messenger of Allah said: Mention the Name of Allah and eat. (Sahih )",
        "malay_translation": "Diriwayatkan daripada 'Aishah (r.a.) bahawa: beberapa orang Badwi sering membawa kepada kami daging, dan kami tidak tahu sama ada mereka ada menyebut nama Allah (ketika menyembelihnya) atau tidak. Rasulullah (s.a.w.) bersabda: Sebutlah nama Allah dan makanlah. (Sahih)",
        "arabic_text": "أَخْبَرَنَا إِسْحَاق بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏أَنَّ نَاسًا مِنَ الْأَعْرَابِ كَانُوا يَأْتُونَا بِلَحْمٍ، ‏‏‏‏‏‏وَلَا نَدْرِي أَذَكَرُوا اسْمَ اللَّهِ عَلَيْهِ، ‏‏‏‏‏‏أَمْ لَا، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اذْكُرُوا اسْمَ اللَّهِ عَزَّ وَجَلَّ عَلَيْهِ وَكُلُوا ."
      },
      {
        "id": 39430,
        "hadith_number": "4442",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Penjelasan Ayat Larangan Memakan Makanan yang Tidak Disebut Nama Allah",
        "perawi_melayu": "Daripada Ibnu Abbas r.a.",
        "english_text": "Harun bin Abi Walki-who is Harun bin 'Antarah -narrated from his father, form Ibn 'Abbas, concerning the saying of Allah, the Mighty and Sublime: Eat not of that on which Allah's name has not been pronounced - that he said: The idolaters argued with them and said: 'Whatever Allah kills you do not eat, and whatever you kill you eat!",
        "malay_translation": "Harun bin Abi Walki - iaitu Harun bin 'Antarah - meriwayatkan daripada bapanya, daripada Ibnu Abbas, mengenai firman Allah, Yang Maha Agung lagi Maha Mulia: \"Dan janganlah kamu memakan dari apa (binatang) yang tidak disebut nama Allah ketika menyembelihnya\" - bahawa beliau berkata: Orang-orang musyrik berhujah dengan mereka dan berkata: 'Apa sahaja yang dibunuh oleh Allah, kamu tidak memakannya, dan apa sahaja yang kamu bunuh, kamu memakannya!'",
        "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي هَارُونُ بْنُ أَبِي وَكِيعٍ وَهُوَ هَارُونُ بْنُ عَنْتَرَةَ،‏‏‏‏ عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏فِي قَوْلِهِ عَزَّ وَجَلَّ:‏‏‏‏ وَلا تَأْكُلُوا مِمَّا لَمْ يُذْكَرِ اسْمُ اللَّهِ عَلَيْهِ سورة الأنعام آية 121، ‏‏‏‏‏‏قَالَ:‏‏‏‏ خَاصَمَهُمُ الْمُشْرِكُونَ، ‏‏‏‏‏‏فَقَالُوا:‏‏‏‏ مَا ذَبَحَ اللَّهُ فَلَا تَأْكُلُوهُ، ‏‏‏‏‏‏وَمَا ذَبَحْتُمْ أَنْتُمْ أَكَلْتُمُوهُ ."
      },
      {
        "id": 39431,
        "hadith_number": "4443",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Haram Menggunakan Haiwan Sebagai Sasaran",
        "perawi_melayu": "Abu Tha'labah (رَضِيَ ٱللَّٰهُ عَنْهُ)",
        "english_text": "It was narrated that Abu Tha'labah said: The Messenger of Allah said: An animal that has been taken as a target is not lawful.",
        "malay_translation": "Diriwayatkan bahawa Abu Tha'labah berkata: Rasulullah ﷺ bersabda: 'Haiwan yang dijadikan sasaran (untuk memanah atau menembak) adalah tidak halal.'",
        "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا بَقِيَّةُ، ‏‏‏‏‏‏عَنْ بَحِيرٍ، ‏‏‏‏‏‏عَنْ خَالِدٍ، ‏‏‏‏‏‏عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، ‏‏‏‏‏‏عَنْ أَبِي ثَعْلَبَةَ قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تَحِلُّ الْمُجَثَّمَةُ ."
      },
      {
        "id": 39432,
        "hadith_number": "4444",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Larangan Menggunakan Haiwan Sebagai Sasaran",
        "perawi_melayu": "Hisham bin Zaid",
        "english_text": "It was narrated that Hisham bin Zaid said; Ans and I entered upon Al-Hakam - that it, Ibn Ayyb - and there were some people shooting at a chicken in the house of the governor. He said: 'The Messenger of Allah forbade using animals as targets;'",
        "malay_translation": "Diriwayatkan bahawa Hisham bin Zaid berkata; Saya dan Anas masuk menemui Al-Hakam - iaitu Ibn Ayyb - dan terdapat beberapa orang sedang menembak seekor ayam di rumah gabenor. Dia berkata: 'Rasulullah SAW melarang menggunakan haiwan sebagai sasaran.'",
        "arabic_text": "أَخْبَرَنَا إِسْمَاعِيل بْنُ مَسْعُودٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا خَالِدٌ، ‏‏‏‏‏‏عَنْ شُعْبَةَ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ زَيْدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ دَخَلْتُ مَعَ أَنَسٍ عَلَى الْحَكَمِ يَعْنِي ابْنَ أَيُّوبَ، ‏‏‏‏‏‏فَإِذَا أُنَاسٌ يَرْمُونَ دَجَاجَةً فِي دَارِ الْأَمِيرِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تُصْبَرَ الْبَهَائِمُ ."
      },
      {
        "id": 39433,
        "hadith_number": "4445",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Larangan Menjadikan Haiwan sebagai Sasaran",
        "perawi_melayu": "'Abdullah bin Ja'far",
        "english_text": "It was narrated that 'Abdullah bin Ja'far said: The Messenger of Allah passed by some people who were shooting arrows at a ram. He denounced that and said: 'Do not disfigure animals (by using them as targets). (Sahih )",
        "malay_translation": "Diriwayatkan bahawa 'Abdullah bin Ja'far berkata: Rasulullah ﷺ lalu di hadapan beberapa orang yang sedang memanah anak panah ke arah seekor kambing. Baginda menegur perbuatan itu dan bersabda: 'Janganlah kamu mencacatkan haiwan (dengan menjadikannya sebagai sasaran). (Sahih)",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ زُنْبُورٍ الْمَكِّيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا ابْنُ أَبِي حَازِمٍ، ‏‏‏‏‏‏عَنْ يَزِيدَ وَهُوَ ابْنُ الْهَادِ، ‏‏‏‏‏‏عَنْ مُعَاوِيَةَ بْنِ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَرَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أُنَاسٍ وَهُمْ يَرْمُونَ كَبْشًا بِالنَّبْلِ، ‏‏‏‏‏‏فَكَرِهَ ذَلِكَ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ لَا تَمْثُلُوا بِالْبَهَائِمِ ."
      },
      {
        "id": 39434,
        "hadith_number": "4446",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Rasulullah melaknat mereka yang menjadikan makhluk bernyawa sebagai sasaran",
        "perawi_melayu": "Ibn 'Umar (Radiyallahu 'anhuma)",
        "english_text": "It was narrated that Ibn 'Umar said: The Messenger of Allah cursed those who take anything that has a soul as a target. (Sahih )",
        "malay_translation": "Diriwayatkan bahawa Ibn 'Umar berkata: Rasulullah ﷺ melaknat mereka yang menjadikan sesuatu yang mempunyai jiwa sebagai sasaran. (Sahih)",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا هُشَيْمٌ، ‏‏‏‏‏‏عَنْ أَبِي بِشْرٍ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ جُبَيْرٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنِ اتَّخَذَ شَيْئًا فِيهِ الرُّوحُ غَرَضًا ."
      },
      {
        "id": 39435,
        "hadith_number": "4447",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Laknat Allah ke atas mereka yang mencacatkan haiwan",
        "perawi_melayu": "Abdullah bin Umar رضي الله عنهما (seperti yang diriwayatkan)",
        "english_text": "It was narrated that Ibn 'Umar said; I heard the Messenger of Allah say: 'May Allah curse the one who disfigures and animal. (Sahih )",
        "malay_translation": "Diriwayatkan bahawa Ibnu 'Umar berkata; Aku mendengar Rasulullah ﷺ bersabda: 'Semoga Allah melaknat orang yang mencacatkan haiwan.' (Sahih)",
        "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا يَحْيَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي الْمِنْهَالُ بْنُ عَمْرٍو، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ جُبَيْرٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ لَعَنَ اللَّهُ مَنْ مَثَّلَ بِالْحَيَوَانِ ."
      },
      {
        "id": 39436,
        "hadith_number": "4448",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Larangan Menggunakan Makhluk Bernyawa sebagai Sasaran",
        "perawi_melayu": "Daripada Ibnu 'Abbas",
        "english_text": "It was narrated from Ibn 'Abbas that the Messenger of Allah said: Do not take anything that has a soul as a target.",
        "malay_translation": "Diriwayatkan daripada Ibnu 'Abbas bahawa Rasulullah ﷺ bersabda: “Janganlah kamu menjadikan sesuatu yang mempunyai nyawa sebagai sasaran.”",
        "arabic_text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا عَبْدُ اللَّهِ، ‏‏‏‏‏‏عَنْ شُعْبَةَ، ‏‏‏‏‏‏عَنْ عَدِيِّ بْنِ ثَابِتٍ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ جُبَيْرٍ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا تَتَّخِذُوا شَيْئًا فِيهِ الرُّوحُ غَرَضًا ."
      },
      {
        "id": 39437,
        "hadith_number": "4449",
        "status": "Sahih (Sahih)",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Larangan Menggunakan Makhluk Bernyawa Sebagai Sasaran",
        "perawi_melayu": "Ibnu 'Abbas",
        "english_text": "It was narrated that Ibn 'Abbbas Said: The messenger of Allah forbade us from using anything with a soul as a target. (Sahih )",
        "malay_translation": "Diriwayatkan bahawa Ibnu 'Abbas berkata: Rasulullah SAW melarang kami daripada menggunakan apa sahaja yang mempunyai nyawa sebagai sasaran. (Sahih)",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْكُوفِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَلِيُّ بْنُ هَاشِمٍ، ‏‏‏‏‏‏عَنِ الْعَلَاءِ بْنِ صَالِحٍ، ‏‏‏‏‏‏عَنْ عَدِيِّ بْنِ ثَابِتٍ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ جُبَيْرٍ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا تَتَّخِذُوا شَيْئًا فِيهِ الرُّوحُ غَرَضًا ."
      },
      {
        "id": 39438,
        "hadith_number": "4450",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Hukuman Membunuh Burung atau Binatang Tanpa Sebab yang Benar",
        "perawi_melayu": "'Abdullah bin 'Amr",
        "english_text": "It was narrated from 'Abdullah bin 'Amr, who attributed it to the Messenger of Allah: There is no person who kills a small bird or anything larger, for no just reason, but Allah will ask him about it. It was said: O Messenger of Allah, what does 'just reason mean? He said: That you slaughters it and eat it, and o not cut off its head and throw it aside,",
        "malay_translation": "Diriwayatkan daripada 'Abdullah bin 'Amr, yang menyandarkannya kepada Rasulullah SAW: Tidak ada seorang pun yang membunuh burung kecil atau sesuatu yang lebih besar tanpa sebab yang benar, melainkan Allah akan menyoalnya mengenainya. Dikatakan: Wahai Rasulullah, apakah maksud 'sebab yang benar'? Baginda bersabda: Iaitu kamu menyembelihnya dan memakannya, dan janganlah kamu memenggal kepalanya dan membuangnya.",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ عَمْرٍو، ‏‏‏‏‏‏عَنْ صُهَيْبٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو يَرْفَعُهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَنْ قَتَلَ عُصْفُورًا فَمَا فَوْقَهَا بِغَيْرِ حَقِّهَا، ‏‏‏‏‏‏سَأَلَ اللَّهُ عَزَّ وَجَلَّ عَنْهَا يَوْمَ الْقِيَامَةِ، ‏‏‏‏‏‏قِيلَ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏فَمَا حَقُّهَا ؟، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَقُّهَا أَنْ تَذْبَحَهَا فَتَأْكُلَهَا، ‏‏‏‏‏‏وَلَا تَقْطَعْ رَأْسَهَا، ‏‏‏‏‏‏فَيُرْمَى بِهَا ."
      },
      {
        "id": 39439,
        "hadith_number": "4451",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Kesan Membunuh Burung Kecil Tanpa Sebab",
        "perawi_melayu": "'Amr bin Sharid meriwayatkan bahawa dia mendengar Sharid berkata:",
        "english_text": "It was narrated that 'Amr bin Sharid said: I heard Sharid say: 'I herd the Messenger of Allah say: Whoever kills a small bird for no reason, it will beseech Allah on the Day of Resurrection saying: O Lord, so and so killed me for no reason. And he did not kill me for any beneficial purpose. '",
        "malay_translation": "Diriwayatkan bahawa 'Amr bin Sharid berkata: Saya mendengar Sharid berkata: Saya mendengar Rasulullah ﷺ bersabda: 'Sesiapa yang membunuh burung kecil tanpa sebab, ia akan merayu kepada Allah pada Hari Kiamat dengan berkata: 'Ya Tuhan, si fulan membunuhku tanpa sebab. Dan dia tidak membunuhku untuk sebarang tujuan yang bermanfaat.'",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ دَاوُدَ الْمِصِّيصِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا أَبُو عُبَيْدَةَ عَبْدُ الْوَاحِدِ بْنُ وَاصِلٍ، ‏‏‏‏‏‏عَنْ خَلَفٍ يَعْنِي ابْنَ مِهْرَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَامِرٌ الْأَحْوَلُ، ‏‏‏‏‏‏عَنْ صَالِحِ بْنِ دِينَارٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ الشَّرِيدِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ الشَّرِيدَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ مَنْ قَتَلَ عُصْفُورًا عَبَثًا، ‏‏‏‏‏‏عَجَّ إِلَى اللَّهِ عَزَّ وَجَلَّ يَوْمَ الْقِيَامَةِ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ يَا رَبِّ،‏‏‏‏ إِنَّ فُلَانًا قَتَلَنِي عَبَثًا، ‏‏‏‏‏‏وَلَمْ يَقْتُلْنِي لِمَنْفَعَةٍ ."
      },
      {
        "id": 39440,
        "hadith_number": "4452",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Larangan Memakan Daging Keldai Jinak dan Al-Jallalah",
        "perawi_melayu": "'Amr bin Shu'aib, daripada bapanya, daripada datuknya",
        "english_text": "It was narrated from 'Amr bin Shu'aib, from his father, from his father Muhammad bin 'Abdullah bin 'Amr - or on one occasion he said: from his father, form his grandfather - the on the Day of Kahaibar, the Messenger of Allah forbade the flesh of domesticated donkeys and of al-Jallalah (animals that eat dung), and (he forbade) riding them and eating their mat.",
        "malay_translation": "Diriwayatkan daripada 'Amr bin Shu'aib, daripada bapanya, daripada bapanya Muhammad bin 'Abdullah bin 'Amr - atau pada satu ketika beliau berkata: daripada bapanya, daripada datuknya - bahawa pada Hari Khaibar, Rasulullah ﷺ melarang memakan daging keldai jinak dan al-Jallalah (haiwan yang memakan najis), dan (baginda melarang) menunggang mereka dan memakan daging mereka.",
        "arabic_text": "أَخْبَرَنِي عُثْمَانُ بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي سَهْلُ بْنُ بَكَّارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا وُهَيْبُ بْنُ خَالِدٍ، ‏‏‏‏‏‏عَنِ ابْنِ طَاوُسٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أَبِيهِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَمْرٍو، ‏‏‏‏‏‏قَالَ مَرَّةً:‏‏‏‏ عَنْ أَبِيهِ، ‏‏‏‏‏‏وَقَالَ مَرَّةً:‏‏‏‏ عَنْ جَدِّهِ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ نَهَى يَوْمَ خَيْبَرَ عَنْ لُحُومِ الْحُمُرِ الْأَهْلِيَّةِ، ‏‏‏‏‏‏وَعَنِ الْجَلَّالَةِ، ‏‏‏‏‏‏وَعَنْ رُكُوبِهَا، ‏‏‏‏‏‏وَعَنْ أَكْلِ لَحْمِهَا ."
      },
      {
        "id": 39441,
        "hadith_number": "4453",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Larangan Rasulullah SAW Terhadap Makanan dan Minuman Tertentu",
        "perawi_melayu": "Ibn 'Abbas",
        "english_text": "It was narrated that Ibn 'Abbas said: The Messenger of Allah forbade (eating) animals that had been taken as targets, the milk of Al-Jallalah (animals that eat dung), and drinking directly from water skins.",
        "malay_translation": "Diriwayatkan daripada Ibn 'Abbas berkata: Rasulullah SAW melarang (memakan) haiwan yang dijadikan sasaran, susu Al-Jallalah (haiwan yang memakan najis), dan minum terus daripada bekas air (susu).",
        "arabic_text": "أَخْبَرَنَا إِسْمَاعِيل بْنُ مَسْعُودٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا خَالِدٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا هِشَامٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا قَتَادَةُ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْمُجَثَّمَةِ، ‏‏‏‏‏‏وَلَبَنِ الْجَلَّالَةِ، ‏‏‏‏‏‏وَالشُّرْبِ مِنْ فِي السِّقَاءِ ."
      }
    ]
  }
}