{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 26,
    "data": [
      {
        "id": 36422,
        "hadith_number": "1434",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Keringanan Solat Ketika Ketakutan dan Penerimaan Kurniaan Allah",
        "perawi_melayu": "Ya'la bin Umayyah",
        "english_text": "It was narrated that Ya'la bin Umayyah said: I said to 'Umar bin Al-Khattab: 'There is no sin on you if you shorten salah and if you fear that the disbelievers may put you in trial (attack you). But now the people are safe.' 'Umar said: 'I wondered the same thing, so I asked the Messenger of Allah (ﷺ) about that and he said: This is a favor from Allah (SWT) to you, so accept His favor.",
        "malay_translation": "Diriwayatkan daripada Ya'la bin Umayyah berkata: Aku berkata kepada Umar bin Al-Khattab: 'Tidak ada dosa bagi kamu jika kamu memendekkan solat dan jika kamu takut orang-orang kafir akan menimpakan cubaan (menyerang kamu). Tetapi sekarang orang-orang telah aman.' Umar berkata: 'Aku juga tertanya-tanya perkara yang sama, jadi aku bertanya kepada Rasulullah (ﷺ) tentang hal itu dan baginda bersabda: Ini adalah kurniaan daripada Allah (SWT) untuk kamu, maka terimalah kurniaan-Nya.'",
        "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏قال:‏‏‏‏ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، ‏‏‏‏‏‏قال:‏‏‏‏ أَنْبَأَنَا ابْنُ جُرَيْجٍ، ‏‏‏‏‏‏عَنِ ابْنِ أَبِي عَمَّارٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ بَابَيْهِ، ‏‏‏‏‏‏عَنْ يَعْلَى بْنِ أُمَيَّةَ، ‏‏‏‏‏‏قال:‏‏‏‏ قُلْتُ لِعُمَرَ بْنِ الْخَطَّابِ:‏‏‏‏ فَلَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَقْصُرُوا مِنَ الصَّلاةِ إِنْ خِفْتُمْ أَنْ يَفْتِنَكُمُ الَّذِينَ كَفَرُوا سورة النساء آية 101 فَقَدْ أَمِنَ النَّاسُ، ‏‏‏‏‏‏فَقَالَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ:‏‏‏‏ عَجِبْتُ مِمَّا عَجِبْتَ مِنْهُ، ‏‏‏‏‏‏فَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ،‏‏‏‏ فَقَالَ:‏‏‏‏ صَدَقَةٌ تَصَدَّقَ اللَّهُ بِهَا عَلَيْكُمْ فَاقْبَلُوا صَدَقَتَهُ ."
      },
      {
        "id": 36423,
        "hadith_number": "1435",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Penjelasan tentang Solat Musafir Mengikut Sunnah Nabi",
        "perawi_melayu": "Umayyah bin 'Abdullah bin Khalid",
        "english_text": "It was narrated from Umayyah bin 'Abdullah bin Khalid that: He said to 'Abdullah bin 'Umar: We find (mention of) prayer when one is at home (i.e., not traveling) and prayer at times of fear in the Qur'an, but we do not find any mention in the Qur'an of prayer when traveling. Ibn Umar said to him: 'O son of my brother, Allah (SWT) send Muhammad (ﷺ) to us when we did not know anything, and all we should do is to do that which we saw Muhammad (ﷺ) doing.'",
        "malay_translation": "Diriwayatkan daripada Umayyah bin 'Abdullah bin Khalid bahawa: Beliau berkata kepada 'Abdullah bin 'Umar: Kami mendapati (sebutan tentang) solat ketika berada di rumah (iaitu, tidak bermusafir) dan solat ketika waktu ketakutan di dalam Al-Quran, tetapi kami tidak mendapati sebarang sebutan di dalam Al-Quran tentang solat ketika bermusafir. Ibn Umar berkata kepadanya: 'Wahai anak saudaraku, sesungguhnya Allah (SWT) mengutuskan Muhammad (ﷺ) kepada kami ketika kami tidak mengetahui apa-apa, dan apa yang patut kami lakukan adalah mengikut apa yang kami lihat Muhammad (ﷺ) lakukan.'",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا اللَّيْثُ، ‏‏‏‏‏‏عَنِ ابْنِ شِهَابٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ أُمَيَّةَ بْنِ عَبْدِ اللَّهِ بْنِ خَالِدٍ، ‏‏‏‏‏‏أَنَّهُ قَالَ لِعَبْدِ اللَّهِ بْنِ عُمَرَ:‏‏‏‏ إِنَّا نَجِدُ صَلَاةَ الْحَضَرِ وَصَلَاةَ الْخَوْفِ فِي الْقُرْآنِ، ‏‏‏‏‏‏وَلَا نَجِدُ صَلَاةَ السَّفَرِ فِي الْقُرْآنِ،‏‏‏‏ فَقَالَ لَهُ ابْنُ عُمَرَ:‏‏‏‏ يَا ابْنَ أَخِي،‏‏‏‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ بَعَثَ إِلَيْنَا مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَلَا نَعْلَمُ شَيْئًا وَإِنَّمَا نَفْعَلُ كَمَا رَأَيْنَا مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُ ."
      },
      {
        "id": 36424,
        "hadith_number": "1436",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Perjalanan Rasulullah ke Madinah dan Ketakutan kepada Allah",
        "perawi_melayu": "Ibn 'Abbas",
        "english_text": "It was narrated from Ibn 'Abbas that: The Messenger of Allah (ﷺ) set out from Makkah to Al-Madinah, fearing nothing but the Lord of the worlds, and praying two rak'ahs.",
        "malay_translation": "Diriwayatkan daripada Ibn 'Abbas bahawa: Rasulullah (ﷺ) keluar dari Makkah menuju ke Madinah, tidak takut kecuali kepada Allah Tuhan semesta alam, dan menunaikan solat dua rakaat.",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا هُشَيْمٌ، ‏‏‏‏‏‏عَنْ مَنْصُورِ بْنِ زَاذَانَ، ‏‏‏‏‏‏عَنِ ابْنِ سِيرِينَ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ مَكَّةَ إِلَى الْمَدِينَةِ لَا يَخَافُ إِلَّا رَبَّ الْعَالَمِينَ يُصَلِّي رَكْعَتَيْنِ ."
      },
      {
        "id": 36425,
        "hadith_number": "1437",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Solat Dua Rakaat Semasa Musafir Antara Makkah dan Madinah",
        "perawi_melayu": "Ibn 'Abbas RA",
        "english_text": "It was narrated that Ibn 'Abbas said: We used to travel with the Messenger of Allah (ﷺ) between Makkah and Al-Madinah, fearing nothing but Allah, the Mighty and Sublime, and praying two rak'ahs.",
        "malay_translation": "Diriwayatkan daripada Ibn 'Abbas RA berkata: Kami pernah bermusafir bersama Rasulullah SAW antara Makkah dan Madinah, tidak takut melainkan kepada Allah, Yang Maha Perkasa lagi Maha Agung, dan kami solat dua rakaat.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا خَالِدٌ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا ابْنُ عَوْنٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدٍ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قال:‏‏‏‏ كُنَّا نَسِيرُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ مَكَّةَ وَالْمَدِينَةِ لَا نَخَافُ إِلَّا اللَّهَ عَزَّ وَجَلَّ نُصَلِّي رَكْعَتَيْنِ ."
      },
      {
        "id": 36426,
        "hadith_number": "1438",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Mengikuti Sunnah Rasulullah ﷺ dalam Solat di Dzul-Hulaifah",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "It was narrated that Ibn Al-Simt said: I saw 'Umar bin Al-Khattab praying two rak'ahs in Dhul-Hulaifah and I asked him about that. He said: 'I am simply doing that which I saw the Messenger of Allah (ﷺ) doing.'",
        "malay_translation": "Diriwayatkan daripada Ibn Al-Simt, beliau berkata: Saya melihat Umar bin Al-Khattab menunaikan solat dua rakaat di Dzul-Hulaifah dan saya bertanya kepadanya tentang hal itu. Beliau berkata: 'Sesungguhnya aku melakukan ini sebagaimana aku melihat Rasulullah ﷺ melakukannya.'",
        "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ يَزِيدَ بْنِ خُمَيْرٍ، ‏‏‏‏‏‏قال:‏‏‏‏ سَمِعْتُحَبِيبَ بْنَ عُبَيْدٍ يُحَدِّثُ، ‏‏‏‏‏‏عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، ‏‏‏‏‏‏عَنِ ابْنِ السِّمْطِ، ‏‏‏‏‏‏قال:‏‏‏‏ رَأَيْتُ عُمَرَ بْنَ الْخَطَّابِ يُصَلِّي بِذِي الْحُلَيْفَةِ رَكْعَتَيْنِ، ‏‏‏‏‏‏فَسَأَلْتُهُ عَنْ ذَلِكَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنَّمَا أَفْعَلُ كَمَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُ."
      },
      {
        "id": 36427,
        "hadith_number": "1439",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Rasulullah ﷺ Memendekkan Solat di Mekah Selama Sepuluh Hari",
        "perawi_melayu": "Anas",
        "english_text": "It was narrated that Anas said: I went out with the Messenger of Allah (ﷺ) from Al-Madinah to Mekkah, and he continued to shorten his prayers, and he stayed there for ten days.",
        "malay_translation": "Diriwayatkan daripada Anas, beliau berkata: Saya keluar bersama Rasulullah ﷺ dari Madinah ke Mekah, dan baginda terus memendekkan solatnya, dan baginda tinggal di sana selama sepuluh hari.",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا أَبُو عَوَانَةَ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ أَبِي إِسْحَاقَ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ خَرَجْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنَ الْمَدِينَةِ إِلَى مَكَّةَ، ‏‏‏‏‏‏فَلَمْ يَزَلْ يَقْصُرُ حَتَّى رَجَعَ فَأَقَامَ بِهَا عَشْرًا ."
      },
      {
        "id": 36428,
        "hadith_number": "1440",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Solat Dua Rakaat Semasa Perjalanan Bersama Rasulullah dan Para Sahabat",
        "perawi_melayu": "Tidak disebutkan perawi",
        "english_text": "It was narrated that 'Abdullah said: I prayed two rak'ahs with the Messenger of Allah (ﷺ) on a journey, and two rak'ahs with Abu Bakr, and two rak'ahs with 'Umar, may Allah (SWT) be pleased with them both.",
        "malay_translation": "Diriwayatkan bahawa Abdullah berkata: Saya solat dua rakaat bersama Rasulullah (ﷺ) dalam perjalanan, dan dua rakaat bersama Abu Bakr, dan dua rakaat bersama Umar, semoga Allah (SWT) meredhai mereka berdua.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ الْحَسَنِ بْنِ شَقِيقٍ،‏‏‏‏ قَالَ أَبِي،‏‏‏‏ أَنْبَأَنَا أَبُو حَمْزَةَ وَهُوَ السُّكَّرِيُّ، ‏‏‏‏‏‏عَنْ مَنْصُورٍ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْعَلْقَمَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قال:‏‏‏‏ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي السَّفَرِ رَكْعَتَيْنِ، ‏‏‏‏‏‏وَمَعَ أَبِي بَكْرٍ رَكْعَتَيْنِ، ‏‏‏‏‏‏وَمَعَ عُمَرَ رَكْعَتَيْنِ رَضِيَ اللَّهُ عَنْهُمَا ."
      },
      {
        "id": 36429,
        "hadith_number": "1441",
        "status": "Sahih",
        "nama_buku": "Sunan an-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Solat Dua Rakaat untuk Jumaat, Aidilfitri, Aidiladha dan Musafir",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "It was narrated that 'Umar said: The prayer for jumu'ah is two rak'ahs, and for Al-Fitr is two rak'ahs, and for An-Nahr is two rak'ahs, and for traveling is two rak'ahs, complete and not shortened, on the tongue of the Prophet (ﷺ).",
        "malay_translation": "Diriwayatkan bahawa 'Umar berkata: Solat Jumaat adalah dua rakaat, dan (solat) Aidilfitri adalah dua rakaat, dan (solat) Aidiladha adalah dua rakaat, dan (solat) musafir adalah dua rakaat, sempurna dan tidak dipendekkan, (sebagaimana) yang diucapkan oleh Nabi (ﷺ).",
        "arabic_text": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، ‏‏‏‏‏‏عَنْ سُفْيَانَ وَهُوَ ابْنُ حَبِيبٍ، ‏‏‏‏‏‏عَنْ شُعْبَةَ، ‏‏‏‏‏‏عَنْ زُبَيْدٍ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، ‏‏‏‏‏‏عَنْعُمَرَ، ‏‏‏‏‏‏قال:‏‏‏‏ صَلَاةُ الْجُمُعَةِ رَكْعَتَانِ، ‏‏‏‏‏‏وَالْفِطْرِ رَكْعَتَانِ، ‏‏‏‏‏‏وَالنَّحْرِ رَكْعَتَانِ، ‏‏‏‏‏‏وَالسَّفَرِ رَكْعَتَانِ، ‏‏‏‏‏‏تَمَامٌ غَيْرُ قَصْرٍ عَلَى لِسَانِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ."
      },
      {
        "id": 36430,
        "hadith_number": "1442",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Jumlah Rakaat Solat bagi Orang Bermukim, Musafir, dan dalam Keadaan Takut",
        "perawi_melayu": "Daripada Ibn 'Abbas RA",
        "english_text": "It was narrated that Ibn 'Abbas said: The prayer of the resident was enjoined on the tongue of your Prophet (ﷺ), four (rak'ahs), and the prayer of the traveler is two rak'ahs, and the prayer of fear is one rak'ah.",
        "malay_translation": "Diriwayatkan daripada Ibn 'Abbas RA berkata: Solat bagi orang yang bermukim difardukan melalui lisan Nabi kamu (ﷺ) sebanyak empat rakaat, solat bagi musafir adalah dua rakaat, dan solat dalam keadaan takut adalah satu rakaat.",
        "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ وَهْبٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنِي أَبُو عَبْدِ الرَّحِيمِ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنِي زَيْدٌ، ‏‏‏‏‏‏عَنْ أَيُّوبَ وَهُوَ ابْنُ عَائِذٍ، ‏‏‏‏‏‏عَنْ بُكَيْرِ بْنِ الْأَخْنَسِ، ‏‏‏‏‏‏عَنْ مُجَاهِدٍ أَبِي الْحَجَّاجِ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قال:‏‏‏‏ فُرِضَتْ صَلَاةُ الْحَضَرِ عَلَى لِسَانِ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعًا، ‏‏‏‏‏‏وَصَلَاةُ السَّفَرِ رَكْعَتَيْنِ، ‏‏‏‏‏‏وَصَلَاةُ الْخَوْفِ رَكْعَةً ."
      },
      {
        "id": 36431,
        "hadith_number": "1443",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Kewajipan Solat: Rakaat Ketika Bermukim, Musafir dan Ketakutan",
        "perawi_melayu": "Diriwayatkan daripada Ibn 'Abbas r.a.",
        "english_text": "It was narrated that Ibn 'Abbas said: Allah, the Mighty and Sublime, enjoined the prayer on the tongue of your Prophet (ﷺ): While a resident four (rak'ahs), while traveling two, and at times of fear one.",
        "malay_translation": "Diriwayatkan daripada Ibn 'Abbas r.a., beliau berkata: Allah, Yang Maha Perkasa lagi Maha Agung, telah mewajibkan solat melalui lisan Nabi kamu (ﷺ): Semasa bermukim empat rakaat, semasa musafir dua rakaat, dan semasa ketakutan satu rakaat.",
        "arabic_text": "أَخْبَرَنَا يَعْقُوبُ بْنُ مَاهَانَ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا الْقَاسِمُ بْنُ مَالِكٍ، ‏‏‏‏‏‏عَنْ أَيُّوبَ بْنِ عَائِذٍ، ‏‏‏‏‏‏عَنْ بُكَيْرِ بْنِ الْأَخْنَسِ، ‏‏‏‏‏‏عَنْ مُجَاهِدٍ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قال:‏‏‏‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ فَرَضَ الصَّلَاةَ عَلَى لِسَانِ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْحَضَرِ أَرْبَعًا، ‏‏‏‏‏‏وَفِي السَّفَرِ رَكْعَتَيْنِ، ‏‏‏‏‏‏وَفِي الْخَوْفِ رَكْعَةً ."
      },
      {
        "id": 36432,
        "hadith_number": "1444",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Solat Sunnah Dua Rakaat di Makkah Bagi yang Tidak Berjemaah",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "It was narrated that Qatadah said: I heard Muas- bin Salamah-say: 'I said to Ibn 'Abbas: How should I pray in Makkah if I do not pray in congregation? He said: Two rak'ahs, the sunnah of Abu Al-Qasim.'",
        "malay_translation": "Diriwayatkan bahawa Qatadah berkata: Saya mendengar Musa bin Salamah berkata: 'Saya berkata kepada Ibn 'Abbas: Bagaimana saya harus solat di Makkah jika saya tidak solat berjemaah? Beliau berkata: Dua rakaat, sunnah Abu Al-Qasim.'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى فِي حَدِيثِهِ، ‏‏‏‏‏‏عَنْ خَالِدِ بْنِ الْحَارِثِ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏قال:‏‏‏‏ سَمِعْتُ مُوسَى وَهُوَ ابْنُ سَلَمَةَ، ‏‏‏‏‏‏قال:‏‏‏‏ قُلْتُ لِابْنِ عَبَّاسٍ:‏‏‏‏ كَيْفَ أُصَلِّي بِمَكَّةَ إِذَا لَمْ أُصَلِّ فِي جَمَاعَةٍ ؟ قَالَ:‏‏‏‏ رَكْعَتَيْنِ سُنَّةَ أَبِي الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ."
      },
      {
        "id": 36433,
        "hadith_number": "1445",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Cara Solat Sunat Apabila Terlepas Solat Berjemaah",
        "perawi_melayu": "Diriwayatkan daripada Musa bin Salamah bahawa",
        "english_text": "Musa bin Salamah narrated that he asked Ibn 'Abbas: I missed the prayer in congregation when I was in Al-Batha; how do you think I should pray? He said: Two rak'ahs, the sunnah of the Messenger of Allah (ﷺ).",
        "malay_translation": "Musa bin Salamah meriwayatkan bahawa beliau bertanya kepada Ibn 'Abbas: Saya terlepas solat berjemaah ketika saya berada di Al-Batha; bagaimana pendapat kamu tentang cara saya harus solat? Beliau berkata: Dua rakaat, sunnah Rasulullah (ﷺ).",
        "arabic_text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا سَعِيدٌ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا قَتَادَةُ، ‏‏‏‏‏‏أَنَّ مُوسَى بْنَ سَلَمَةَ حَدَّثَهُمْ، ‏‏‏‏‏‏أَنَّهُ سَأَلَ ابْنَ عَبَّاسٍ،‏‏‏‏ قُلْتُ:‏‏‏‏ تَفُوتُنِي الصَّلَاةُ فِي جَمَاعَةٍ وَأَنَا بِالْبَطْحَاءِ مَا تَرَى أَنْ أُصَلِّيَ ؟،‏‏‏‏ قَالَ:‏‏‏‏ رَكْعَتَيْنِ سُنَّةَ أَبِي الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ."
      },
      {
        "id": 36434,
        "hadith_number": "1446",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Solat Dua Rakaat Bersama Nabi di Mina dalam Keadaan Aman dan Ramai",
        "perawi_melayu": "Harithah bin Wahab Al-Khuza'i",
        "english_text": "It was narrated that Harithah bin Wahab Al-Khuza'i said: I prayed two rak'ahs with the Prophet (ﷺ) in Mina when the people were more secure and greater in number.",
        "malay_translation": "Diriwayatkan daripada Harithah bin Wahab Al-Khuza'i, beliau berkata: Saya solat dua rakaat bersama Nabi (ﷺ) di Mina ketika orang ramai berada dalam keadaan paling aman dan jumlah yang ramai.",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا أَبُو الْأَحْوَصِ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاقَ، ‏‏‏‏‏‏عَنْ حَارِثَةَ بْنِ وَهْبٍ الْخُزَاعِيِّ، ‏‏‏‏‏‏قال:‏‏‏‏ صَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى آمَنَ مَا كَانَ النَّاسُ وَأَكْثَرَهُ رَكْعَتَيْنِ ."
      },
      {
        "id": 36435,
        "hadith_number": "1447",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Solat Dua Rakaat di Mina Ketika Ramai dan Aman",
        "perawi_melayu": "Harithah bin Wahab",
        "english_text": "It was narrated that Harithah bin Wahab said: The Messenger of Allah (ﷺ) led us in prayer in Mina, two rak'ahs, when the people were greater in number and more secure.",
        "malay_translation": "Diriwayatkan bahawa Harithah bin Wahab berkata: Rasulullah (ﷺ) telah mengimamkan kami dalam solat di Mina, dua rakaat, ketika bilangan orang ramai lebih besar dan lebih aman.",
        "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا أَبُو إِسْحَاقَ. ح وَأَنْبَأَنَا عَمْرُو بْنُ عَلِيٍّ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏قال:‏‏‏‏ أَخْبَرَنِي أَبُو إِسْحَاقَ، ‏‏‏‏‏‏عَنْ حَارِثَةَ بْنِ وَهْبٍ، ‏‏‏‏‏‏قال:‏‏‏‏ صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى أَكْثَرَ مَا كَانَ النَّاسُ وَآمَنَهُ رَكْعَتَيْنِ ."
      },
      {
        "id": 36436,
        "hadith_number": "1448",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Solat Dua Rakaat di Mina Bersama Rasulullah dan Para Khulafa Ar-Rasyidin",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "It was narrated from Anas bin Malik that he said: I prayed two rak'ahs with the Messenger of Allah (ﷺ) in Mina, and with Abu Bakr and 'Umar, and two rak'ahs with 'Uthman at the beginning of his Caliphate.",
        "malay_translation": "Diriwayatkan daripada Anas bin Malik bahawa beliau berkata: Saya solat dua rakaat bersama Rasulullah (ﷺ) di Mina, dan bersama Abu Bakr dan Umar, dan dua rakaat bersama Uthman pada awal kekhalifahannya.",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا اللَّيْثُ، ‏‏‏‏‏‏عَنْ بُكَيْرٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي سُلَيْمَانَ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏أَنَّهُ قَالَ:‏‏‏‏ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى، ‏‏‏‏‏‏وَمَعَ أَبِي بَكْرٍ وَعُمَرَ رَكْعَتَيْنِ، ‏‏‏‏‏‏وَمَعَ عُثْمَانَ رَكْعَتَيْنِ صَدْرًا مِنْ إِمَارَتِهِ ."
      },
      {
        "id": 36437,
        "hadith_number": "1449",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Solat Dua Rakaat di Mina Bersama Rasulullah ﷺ",
        "perawi_melayu": "Abdullah bin Mas'ud RA",
        "english_text": "It was narrated that 'Abdullah (ﷺ) said: I prayed two rak'ahs in Mina with the Messenger of Allah (ﷺ).",
        "malay_translation": "Diriwayatkan daripada Abdullah (ﷺ) berkata: Saya solat dua rakaat di Mina bersama Rasulullah (ﷺ).",
        "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا عَبْدُ الْوَاحِدِ، ‏‏‏‏‏‏عَنِ الْأَعْمَشِ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا إِبْرَاهِيمُ، ‏‏‏‏‏‏قال:‏‏‏‏ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ يَزِيدَ. ح وَأَنْبَأَنَا مَحْمُودُ بْنُ غَيْلَانَ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنِ الْأَعْمَشِ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُ، ‏‏‏‏‏‏قال:‏‏‏‏ صَلَّيْتُ بِمِنًى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَيْنِ ."
      },
      {
        "id": 36438,
        "hadith_number": "1450",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Solat di Mina: Empat Rakaat Uthman, Dua Rakaat Rasulullah (ﷺ)",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "It was narrated that 'Abdur-Rahman bin Yazid said: Uthman prayer four (rak'ahs) in Mina until news of that reached 'Abdullah who said: 'I prayed two rak'ahs with the Messenger of Allah (ﷺ).'",
        "malay_translation": "Diriwayatkan daripada 'Abdur-Rahman bin Yazid, beliau berkata: Uthman solat empat rakaat di Mina sehingga berita itu sampai kepada 'Abdullah, yang berkata: 'Saya telah solat dua rakaat bersama Rasulullah (ﷺ).'",
        "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ خَشْرَمٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا عِيسَى، ‏‏‏‏‏‏عَنِ الْأَعْمَشِ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، ‏‏‏‏‏‏قال:‏‏‏‏ صَلَّى عُثْمَانُ بِمِنًى أَرْبَعًا حَتَّى بَلَغَ ذَلِكَ عَبْدَ اللَّهِ فَقَالَ:‏‏‏‏ لَقَدْ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَيْنِ ."
      },
      {
        "id": 36439,
        "hadith_number": "1451",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Solat Dua Rakaat di Mina Bersama Rasulullah SAW dan Para Sahabat",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "It was narrated that Ibn 'Umar said: I prayed two rak'ahs with the Messenger of Allah (ﷺ) in Mina, and two rak'ahs with Abu Bakr, may Allah (SWT) be pleased with him, and two rak'ahs with Umar, may Allah (ﷺ) be pleased with him.",
        "malay_translation": "Diriwayatkan daripada Ibn 'Umar RA, beliau berkata: Saya solat dua rakaat bersama Rasulullah SAW di Mina, dan dua rakaat bersama Abu Bakr RA, dan dua rakaat bersama Umar RA.",
        "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، ‏‏‏‏‏‏قال:‏‏‏‏ أَنْبَأَنَا يَحْيَى، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏قال:‏‏‏‏ صَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى رَكْعَتَيْنِ، ‏‏‏‏‏‏وَمَعَ أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ رَكْعَتَيْنِ، ‏‏‏‏‏‏وَمَعَ عُمَرَ رَضِيَ اللَّهُ عَنْهُ رَكْعَتَيْنِ ."
      },
      {
        "id": 36440,
        "hadith_number": "1452",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Rasulullah, Abu Bakr, Umar, dan Uthman Mendirikan Solat Dua Rakaat di Mina",
        "perawi_melayu": "Diriwayatkan oleh Ubaidullah bin 'Abdullah bin Umar",
        "english_text": "Ubaidullah bin 'Abdullah bin Umar narrated that: His father said: The Messenger of Allah (ﷺ) prayed two rak'ahs in Mina, and Abu Bakr prayed two rak'ahs, and Umar prayed two rak'ahs, and Uthman prayed (two rak'ahs) at the beginning of his Khilafah.",
        "malay_translation": "Ubaidullah bin 'Abdullah bin Umar meriwayatkan bahawa: Bapanya berkata: Rasulullah (ﷺ) mendirikan solat dua rakaat di Mina, dan Abu Bakr mendirikan solat dua rakaat, dan Umar mendirikan solat dua rakaat, dan Uthman mendirikan solat (dua rakaat) pada permulaan Khilafahnya.",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏عَنْ يُونُسَ، ‏‏‏‏‏‏عَنِ ابْنِ شِهَابٍ، ‏‏‏‏‏‏قال:‏‏‏‏ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قال:‏‏‏‏ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى رَكْعَتَيْنِ، ‏‏‏‏‏‏وَصَلَّاهَا أَبُو بَكْرٍ رَكْعَتَيْنِ، ‏‏‏‏‏‏وَصَلَّاهَا عُمَرُ رَكْعَتَيْنِ، ‏‏‏‏‏‏وَصَلَّاهَا عُثْمَانُ صَدْرًا مِنْ خِلَافَتِهِ ."
      },
      {
        "id": 36441,
        "hadith_number": "1453",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Solat Dua Rakaat Semasa Musafir dari Madinah ke Makkah",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "It was narrated from Yahya bin Abi Ishaq that : Anas bin Malik said: We went out with the Messenger of Allah (ﷺ) from Al-Madinah to Makkah and he used to lead us in praying two rak'ahs until we came back. I (Yahya) said: Did he stay in Makkah? He (Anas) said: Yes, we stayed there for ten days.",
        "malay_translation": "Telah diriwayatkan dari Yahya bin Abi Ishaq bahawa: Anas bin Malik berkata: Kami keluar bersama Rasulullah (ﷺ) dari Madinah ke Makkah dan baginda selalu mengimamkan kami solat dua rakaat sehingga kami kembali. Saya (Yahya) bertanya: Adakah baginda menetap di Makkah? Beliau (Anas) berkata: Ya, kami menetap di sana selama sepuluh hari.",
        "arabic_text": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا يَزِيدُ، ‏‏‏‏‏‏قال:‏‏‏‏ أَنْبَأَنَا يَحْيَى بْنُ أَبِي إِسْحَاقَ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قال:‏‏‏‏ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنَ الْمَدِينَةِ إِلَى مَكَّةَ، ‏‏‏‏‏‏فَكَانَ يُصَلِّي بِنَا رَكْعَتَيْنِ حَتَّى رَجَعْنَا ،‏‏‏‏ قُلْتُ:‏‏‏‏ هَلْ أَقَامَ بِمَكَّةَ ؟ قَالَ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏أَقَمْنَا بِهَا عَشْرًا."
      },
      {
        "id": 36442,
        "hadith_number": "1454",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Solat Dua Rakaat Rasulullah SAW di Makkah Selama Lima Belas Hari",
        "perawi_melayu": "Diriwayatkan daripada Ibn 'Abbas RA",
        "english_text": "It was narrated from Ibn 'Abbas that: The Messenger of Allah (ﷺ) stayed in Makkah (for fifteen days), praying each prayer with two rak'ahs.",
        "malay_translation": "Diriwayatkan daripada Ibn 'Abbas RA bahawa: Rasulullah SAW tinggal di Makkah (selama lima belas hari), menunaikan setiap solat dengan dua rakaat.",
        "arabic_text": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ الْأَسْوَدِ الْبَصْرِيُّ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا مُحَمَّدُ بْنُ رَبِيعَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ، ‏‏‏‏‏‏عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، ‏‏‏‏‏‏عَنْ عِرَاكِ بْنِ مَالِكٍ، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ،‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقَامَ بِمَكَّةَ خَمْسَةَ عَشَرَ يُصَلِّي رَكْعَتَيْنِ رَكْعَتَيْنِ ."
      },
      {
        "id": 36443,
        "hadith_number": "1455",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Tempoh Tinggal Muhajir Selepas Ritual",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Al-'Ala bin Al-Hadrami said: The Messenger of Allah (ﷺ) said: 'The Muhajir may stay for three days after completing his rituals.'",
        "malay_translation": "Al-'Ala bin Al-Hadrami berkata: Rasulullah (ﷺ) bersabda: 'Seorang Muhajir boleh tinggal selama tiga hari setelah menyelesaikan ritualnya.'",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ زَنْجُوَيْهِ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّزَّاقِ، ‏‏‏‏‏‏عَنِ ابْنِ جُرَيْجٍ، ‏‏‏‏‏‏قال:‏‏‏‏ أَخْبَرَنِي إِسْمَاعِيلُ بْنُ مُحَمَّدِ بْنِ سَعْدٍ، ‏‏‏‏‏‏أَنَّ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ أَخْبَرَهُ، ‏‏‏‏‏‏أَنَّ السَّائِبَ بْنَ يَزِيدَ أَخْبَرَهُ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ الْعَلَاءَ بْنَ الْحَضْرَمِيِّ،‏‏‏‏ يَقُولُ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَمْكُثُ الْمُهَاجِرُ بَعْدَ قَضَاءِ نُسُكِهِ ثَلَاثًا ."
      },
      {
        "id": 36444,
        "hadith_number": "1456",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Tempoh Tinggal Muhajir Selepas Ibadah Haji/Umrah",
        "perawi_melayu": "Al-'Ala bin Al-Hadrami",
        "english_text": "It was narrated that Al-'Ala bin Al-Hadrami said: The Prophet (ﷺ) said: 'The Muhajir may stay for three days after his rituals.'",
        "malay_translation": "Diriwayatkan bahawa Al-'Ala bin Al-Hadrami berkata: Nabi (ﷺ) bersabda: 'Seorang Muhajir boleh tinggal selama tiga hari selepas ibadah haji atau umrahnya.'",
        "arabic_text": "أَخْبَرَنَا أَبُو عَبْ الرَّحْمَنِ،‏‏‏‏ قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ فِي حَدِيثِهِ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ حُمَيْدٍ، ‏‏‏‏‏‏عَنِ السَّائِبِ بْنِ يَزِيدَ، ‏‏‏‏‏‏عَنِ الْعَلَاءِ بْنِ الْحَضْرَمِيِّ، ‏‏‏‏‏‏قال:‏‏‏‏ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَمْكُثُ الْمُهَاجِرُ بِمَكَّةَ بَعْدَ نُسُكِهِ ثَلَاثًا ."
      },
      {
        "id": 36445,
        "hadith_number": "1457",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Pertanyaan 'Aishah tentang Solat dan Puasa Semasa Umrah dan Pengiktirafan Nabi SAW",
        "perawi_melayu": "Daripada 'Aishah RA",
        "english_text": "It was narrated from 'Aishah that: She performed Umrah with the Messenger of Allah (ﷺ), traveling from Al-Madinah to Makkah. Then, when she came to Makkah, she said: O Messenger of Allah (ﷺ), may my father and mother be ransomed for you, you shortened you prayers and I offered them in full, you did not fast and I fasted. He said: 'Well done, O 'Aishah!' and he did not criticize me.",
        "malay_translation": "Daripada 'Aishah RA meriwayatkan: Beliau menunaikan Umrah bersama Rasulullah SAW, dalam perjalanan dari Al-Madinah ke Makkah. Kemudian, ketika beliau tiba di Makkah, beliau berkata: Wahai Rasulullah SAW, tebusan ayah dan ibuku untukmu, engkau memendekkan solat dan aku menunaikannya dengan sempurna, engkau tidak berpuasa dan aku berpuasa. Baginda bersabda: 'Bagus, wahai 'Aishah!' dan baginda tidak menegurku.",
        "arabic_text": "أَخْبَرَنِي أَحْمَدُ بْنُ يَحْيَى الصُّوفِيُّ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا أَبُو نُعَيْمٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا الْعَلَاءُ بْنُ زُهَيْرٍ الْأَزْدِيُّ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْأَسْوَدِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏أَنَّهَا اعْتَمَرَتْ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنَ الْمَدِينَةِ إِلَى مَكَّةَ، ‏‏‏‏‏‏حَتَّى إِذَا قَدِمَتْ مَكَّةَ قَالَتْ:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏ بِأَبِي أَنْتَ وَأُمِّي قَصَرْتَ وَأَتْمَمْتُ وَأَفْطَرْتَ وَصُمْتُ،‏‏‏‏ قَالَ:‏‏‏‏ أَحْسَنْتِ يَا عَائِشَةُ وَمَا عَابَ عَلَيَّ"
      },
      {
        "id": 36446,
        "hadith_number": "1458",
        "status": "Sahih",
        "nama_buku": "Sunan An-Nasa'i",
        "penulis_buku": "Imam Ahmad an-Nasa'i",
        "tajuk_hadith": "Amalan Solat Musafir Rasulullah ﷺ Seperti yang Dilihat oleh Ibn Umar",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Wabarah bin Abdur-Rahman said: Ibn 'Umar did not offer more than two rak'ahs when traveling, and he did not offer any prayer before or after that. It was said to him: 'What is this?' He said: 'This is what I saw the Messenger of Allah (ﷺ) doing.'",
        "malay_translation": "Wabarah bin Abdur-Rahman berkata: Ibn 'Umar tidak menunaikan lebih dari dua rakaat ketika bermusafir, dan beliau tidak menunaikan solat sunat sebelum atau selepas itu. Ditanyakan kepadanya: 'Apa ini?' Beliau menjawab: 'Inilah yang aku lihat Rasulullah ﷺ lakukan.'",
        "arabic_text": "أَخْبَرَنِي أَحْمَدُ بْنُ يَحْيَى، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا أَبُو نُعَيْمٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا الْعَلَاءُ بْنُ زُهَيْرٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا وَبَرَةُ بْنُ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏قال:‏‏‏‏ كَانَ ابْنُ عُمَرَ لَا يَزِيدُ فِي السَّفَرِ عَلَى رَكْعَتَيْنِ لَا يُصَلِّي قَبْلَهَا وَلَا بَعْدَهَا،‏‏‏‏ فَقِيلَ لَهُ:‏‏‏‏ مَا هَذَا ؟ قَالَ:‏‏‏‏ هَكَذَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ ."
      },
      {
        "id": 36447,
        "hadith_number": "1459",
        "status": "sahih",
        "nama_buku": "Sunan An-Nasa`i",
        "penulis_buku": "Imam Ahmad an-Nasa`i",
        "tajuk_hadith": "Keringanan dalam Musafir: Solat Zuhur dan Asar Dua Rakaat",
        "perawi_melayu": "Diriwayatkan daripada 'Eisa bin Hafs bin 'Asim daripada bapanya",
        "english_text": "Eisa bin Hafs bin 'Asim said: My father told me: 'I was with Ibn Umar on a journey, and he prayed Zuhr and 'Asr with two rak'ahs each, then he went and sat on his carpet. He saw some people offering voluntary prayers and said: What are these people doing? I said: They are offering voluntary prayers. He said: If I had wanted to pray before and after (the obligatory prayer) I would have offered it in full. I accompanied the Messenger of Allah (ﷺ) and he did not pray more than two rak'ahs when traveling, and Abu Bakr (did likewise) until he died, as did 'Umar and 'Uthman, may Allah (SWT) be pleased with them all.",
        "malay_translation": "‘Eisa bin Hafs bin ‘Asim berkata: Bapa saya memberitahu saya: ‘Saya bersama Ibn Umar dalam perjalanan, dan beliau menunaikan solat Zuhur dan Asar dengan dua rakaat setiap satu, kemudian beliau pergi dan duduk di atas tikarnya. Beliau melihat beberapa orang menunaikan solat sunat dan berkata: Apa yang dilakukan oleh orang-orang ini? Saya berkata: Mereka sedang menunaikan solat sunat. Beliau berkata: Jika saya ingin solat sebelum dan selepas (solat wajib), saya pasti akan menunaikannya dengan sempurna. Saya menemani Rasulullah ﷺ dan baginda tidak pernah solat lebih daripada dua rakaat ketika bermusafir, begitu juga Abu Bakr (melakukan perkara yang sama) sehingga beliau meninggal dunia, begitu juga ‘Umar dan ‘Uthman, semoga Allah SWT meredhai mereka semua.’",
        "arabic_text": "أَخْبَرَنِي نُوحُ بْنُ حَبِيبٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا عِيسَى بْنُ حَفْصِ بْنِ عَاصِمٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنِي أَبِي، ‏‏‏‏‏‏قال:‏‏‏‏ كُنْتُ مَعَ ابْنِ عُمَرَ فِي سَفَرٍ فَصَلَّى الظُّهْرَ وَالْعَصْرَ رَكْعَتَيْنِ، ‏‏‏‏‏‏ثُمَّ انْصَرَفَ إِلَى طِنْفِسَةٍ لَهُ، ‏‏‏‏‏‏فَرَأَى قَوْمًا يُسَبِّحُونَ،‏‏‏‏ قَالَ:‏‏‏‏ مَا يَصْنَعُ هَؤُلَاءِ ؟ قُلْتُ:‏‏‏‏ يُسَبِّحُونَ،‏‏‏‏ قَالَ:‏‏‏‏ لَوْ كُنْتُ مُصَلِّيًا قَبْلَهَا أَوْ بَعْدَهَا لَأَتْمَمْتُهَا، ‏‏‏‏‏‏صَحِبْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَ:‏‏‏‏ لَا يَزِيدُ فِي السَّفَرِ عَلَى الرَّكْعَتَيْنِ،‏‏‏‏ وَأَبَا بَكْرٍ حَتَّى قُبِضَ وَعُمَرَ وَعُثْمَانَ رَضِيَ اللَّهُ عَنْهُمْ كَذَلِكَ ."
      }
    ]
  }
}