{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 114,
    "data": [
      {
        "id": 9401,
        "hadith_number": "1837",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah Diingatkan Ayat Al-Quran yang Terlupa",
        "perawi_melayu": "Aisyah رضی اللہ تعالیٰ عنہا meriwayatkan:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) heard a person reciting the Qur'an at night. Upon this he said: May Allah show mercy to him; he has reminded me of such and such a verse which I had missed in such and such a surah.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) mendengar seseorang membaca Al-Quran pada waktu malam. Baginda bersabda: “Semoga Allah merahmati dia; dia telah mengingatkan aku tentang ayat itu dan itu yang aku terlepas dalam surah itu dan itu.”",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعَ رَجُلًا يَقْرَأُ مِنْ اللَّيْلِ فَقَالَ يَرْحَمُهُ اللَّهُ لَقَدْ أَذْكَرَنِي كَذَا وَكَذَا آيَةً كُنْتُ أَسْقَطْتُهَا مِنْ سُورَةِ كَذَا وَكَذَا."
      },
      {
        "id": 9402,
        "hadith_number": "1838",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah Diingatkan Ayat Al-Quran dan Mendoakan Rahmat Pembaca",
        "perawi_melayu": "Diriwayatkan oleh Aisyah رضی اللہ تعالیٰ عنہا:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) listened to the recitation of the Qur'an by a man in the mosque. Thereupon he said: May Allah have mercy upon him; be reminded me of the verse which I had been made to forget.",
        "malay_translation": "Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) mendengar bacaan Al-Quran oleh seorang lelaki di dalam masjid. Lalu baginda bersabda: 'Semoga Allah merahmati dia; dia telah mengingatkan aku tentang ayat yang aku telah dilupakan.'",
        "arabic_text": "و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا عَبْدَةُ وَأَبُو مُعَاوِيَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَمِعُ قِرَاءَةَ رَجُلٍ فِي الْمَسْجِدِ فَقَالَ رَحِمَهُ اللَّهُ لَقَدْ أَذْكَرَنِي آيَةً كُنْتُ أُنْسِيتُهَا."
      },
      {
        "id": 9403,
        "hadith_number": "1839",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perumpamaan Penghafal Al-Quran Seperti Unta yang Diikat",
        "perawi_melayu": "Abdullah bin 'Umar meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The example of a man who has memorised the Qur'an is like that of a hobbled camel. If he remained vigilant, he would be able to retain it (with him), and if he loosened the hobbled camel it would escape.",
        "malay_translation": "Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Perumpamaan seorang lelaki yang menghafal Al-Quran adalah seperti unta yang diikat. Jika dia sentiasa berjaga-jaga, dia akan dapat memeliharanya (bersamanya), dan jika dia melonggarkan ikatan unta itu, ia akan melarikan diri.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّمَا مَثَلُ صَاحِبِ الْقُرْآنِ كَمَثَلِ الْإِبِلِ الْمُعَقَّلَةِ إِنْ عَاهَدَ عَلَيْهَا أَمْسَكَهَا وَإِنْ أَطْلَقَهَا ذَهَبَتْ."
      },
      {
        "id": 9404,
        "hadith_number": "1840",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Anjuran Membaca Al-Quran Siang dan Malam Agar Tidak Lupa",
        "perawi_melayu": "Hadis ini diriwayatkan oleh Ibn 'Umar رضی اللہ تعالیٰ عنہ daripada Rasulullah ( صلى ‌الله ‌علیه ‌وسلم ), tetapi dalam hadis yang diriwayatkan oleh Musa bin 'Uqba, tambahan ini dibuat:",
        "english_text": "When one who had committed the Qur'an to memory (or who is familiar with it) gets up (for night prayer) and recites it night and day, it remains fresh in his mind, but if he does not get up (for prayer and thus does not recite it) he forgets it.",
        "malay_translation": "Apabila seseorang yang telah menghafal Al-Quran (atau yang akrab dengannya) bangun (untuk solat malam) dan membacanya siang dan malam, ia akan kekal segar dalam fikirannya, tetapi jika dia tidak bangun (untuk solat dan dengan itu tidak membacanya) dia akan melupakannya.",
        "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالُوا حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي كُلُّهُمْ عَنْ عُبَيْدِ اللَّهِ ح و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ أَيُّوبَ ح و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ ح و حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ الْمُسَيَّبِيُّ حَدَّثَنَا أَنَسٌ يَعْنِي ابْنَ عِيَاضٍ جَمِيعًا عَنْ مُوسَى بْنِ عُقْبَةَ كُلُّ هَؤُلَاءِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ مَالِكٍ وَزَادَ فِي حَدِيثِ مُوسَى بْنِ عُقْبَةَ وَإِذَا قَامَ صَاحِبُ الْقُرْآنِ فَقَرَأَهُ بِاللَّيْلِ وَالنَّهَارِ ذَكَرَهُ وَإِذَا لَمْ يَقُمْ بِهِ نَسِيَهُ."
      },
      {
        "id": 9405,
        "hadith_number": "1841",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Mengatakan 'Aku Lupa Ayat' dan Anjuran Menjaga Al-Quran",
        "perawi_melayu": "Daripada Abdullah رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: What a wretched person is he amongst them who says: I have forgotten such and such a verse. (He should instead of using this expression say): I have been made to forget it. Try to remember the Qur'an for it is more apt to escape from men's minds than a hobbled camel.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Alangkah celakanya seseorang di antara kamu yang berkata: Aku telah melupakan ayat ini dan ayat itu. (Sebaliknya, dia harus menggunakan ungkapan): Aku telah dilupakan ayat itu. Berusahalah untuk mengingati Al-Quran kerana ia lebih cepat terlepas dari ingatan manusia daripada unta yang terikat.",
        "arabic_text": "و حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ إِسْحَقُ أَخْبَرَنَا وَقَالَ الْآخَرَانِ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِئْسَمَا لِأَحَدِهِمْ يَقُولُ نَسِيتُ آيَةَ كَيْتَ وَكَيْتَ بَلْ هُوَ نُسِّيَ اسْتَذْكِرُوا الْقُرْآنَ فَلَهُوَ أَشَدُّ تَفَصِّيًا مِنْ صُدُورِ الرِّجَالِ مِنْ النَّعَمِ بِعُقُلِهَا."
      },
      {
        "id": 9406,
        "hadith_number": "1842",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Menggalakkan Memperbaharui Ilmu Tentang Kitab Suci dan Larangan Mengatakan 'Aku Lupa Ayat'",
        "perawi_melayu": "Abdullah رضی اللہ تعالیٰ عنہ meriwayatkan bahawa beliau berkata:",
        "english_text": "Keep refreshing your knowledge of the sacred books (or always renew your knowledge of these sacred books) and sometimes he would mention the Qur'an for it is more apt to escape from men's minds than animals which are hobbled, and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: None of you should say: I forgot such and such a verse, but he has been made to forget.",
        "malay_translation": "Sentiasalah memperbaharui pengetahuan kamu tentang kitab-kitab suci (atau sentiasa memperbaharui pengetahuan kamu tentang kitab-kitab suci ini) dan kadang-kadang baginda menyebut al-Quran kerana ia lebih cepat terlepas dari fikiran manusia daripada binatang yang terikat, dan Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Janganlah seorang pun di antara kamu berkata: Aku lupa ayat itu dan ini, tetapi dia sebenarnya telah dilupakan.",
        "arabic_text": "حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي وَأَبُو مُعَاوِيَةَ ح و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَاللَّفْظُ لَهُ قَالَ أَخْبَرَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ قَالَ قَالَ عَبْدُ اللَّهِ تَعَاهَدُوا هَذِهِ الْمَصَاحِفَ وَرُبَّمَا قَالَ الْقُرْآنَ فَلَهُوَ أَشَدُّ تَفَصِّيًا مِنْ صُدُورِ الرِّجَالِ مِنْ النَّعَمِ مِنْ عُقُلِهِ قَالَ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَقُلْ أَحَدُكُمْ نَسِيتُ آيَةَ كَيْتَ وَكَيْتَ بَلْ هُوَ نُسِّيَ."
      },
      {
        "id": 9407,
        "hadith_number": "1843",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Celaan bagi Orang yang Mengatakan Lupa Ayat Quran Padahal Dibuat Lupa",
        "perawi_melayu": "Diriwayatkan dari Ibn Mas'ud رضی اللہ تعالیٰ عنہ:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Wretched is the man who says: I forgot such and such a sura, or I forget such and such a verse, but he has been made to forget.",
        "malay_translation": "Rasulullah ﷺ bersabda: Celakalah orang yang berkata: Aku lupa surah itu dan ini, atau aku lupa ayat itu dan ini, tetapi sebenarnya dia telah dibuat lupa.",
        "arabic_text": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ حَدَّثَنِي عَبْدَةُ بْنُ أَبِي لُبَابَةَ عَنْ شَقِيقِ بْنِ سَلَمَةَ قَالَ سَمِعْتُ ابْنَ مَسْعُودٍ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بِئْسَمَا لِلرَّجُلِ أَنْ يَقُولَ نَسِيتُ سُورَةَ كَيْتَ وَكَيْتَ أَوْ نَسِيتُ آيَةَ كَيْتَ وَكَيْتَ بَلْ هُوَ نُسِّيَ."
      },
      {
        "id": 9408,
        "hadith_number": "1844",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Anjuran untuk Sentiasa Memperbaharui Pengetahuan tentang Al-Quran",
        "perawi_melayu": "Diriwayatkan daripada Abu Musa al-Ash'ari:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Keep refreshing your knowledge of the Qur'an, for I swear by Him in Whose Hand is the life of Mahammad that it is more liable to escape than camels which are hobbled.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Sentiasalah memperbaharui pengetahuan kamu tentang Al-Quran, kerana demi Zat yang jiwaku berada di Tangan-Nya, sesungguhnya ia lebih cepat terlepas daripada unta yang diikat.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَرَّادٍ الْأَشْعَرِيُّ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ بُرَيْدٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَعَاهَدُوا هَذَا الْقُرْآنَ فَوَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَهُوَ أَشَدُّ تَفَلُّتًا مِنْ الْإِبِلِ فِي عُقُلِهَا وَلَفْظُ الْحَدِيثِ لِابْنِ بَرَّادٍ."
      },
      {
        "id": 9409,
        "hadith_number": "1845",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Allah Mendengar Bacaan Al-Quran Nabi dengan Suara Merdu",
        "perawi_melayu": "Abu Hurairah رضی اللہ تعالیٰ عنہ melaporkan ini secara langsung dari Rasulullah ( صلى الله عليه وسلم ):",
        "english_text": "God has not listened to anything as He listens to a Prophet reciting the Qur'an in a sweet voice.",
        "malay_translation": "Allah tidak pernah mendengar sesuatu pun seperti Dia mendengar seorang Nabi membaca Al-Quran dengan suara yang merdu.",
        "arabic_text": "حَدَّثَنِي عَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا أَذِنَ اللَّهُ لِشَيْءٍ مَا أَذِنَ لِنَبِيٍّ يَتَغَنَّى بِالْقُرْآنِ."
      },
      {
        "id": 9410,
        "hadith_number": "1846",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Allah Mendengar Bacaan Al-Quran Nabi dengan Suara Merdu",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "This hadith has been narrated by Ibn Shihab with the same chain of transmitters with words: As He listens to a Prophet reciting the Qur'an in a sweet voice.",
        "malay_translation": "Hadis ini telah diriwayatkan oleh Ibn Shihab dengan sanad yang sama dengan lafaz: Ketika Dia mendengar seorang Nabi membaca Al-Qur'an dengan suara yang merdu.",
        "arabic_text": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ ح و حَدَّثَنِي يُونُسُ بْنُ عَبْدِ الْأَعْلَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو كِلَاهُمَا عَنْ ابْنِ شِهَابٍ بِهَذَا الْإِسْنَادِ قَالَ كَمَا يَأْذَنُ لِنَبِيٍّ يَتَغَنَّى بِالْقُرْآنِ."
      },
      {
        "id": 9411,
        "hadith_number": "1847",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kesenangan Allah Mendengar Bacaan Al-Quran Nabi dengan Suara Merdu",
        "perawi_melayu": "Abu Hurairah رضی اللہ تعالیٰ عنہ meriwayatkan bahawa beliau mendengar:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Allah does not listen to anything, (more approvingly) as He listens to a Prophet reciting loudly the Qur'an in a sweet voice.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Allah tidak mendengar sesuatu pun (dengan lebih menyenangi) seperti Dia mendengar seorang Nabi membaca al-Quran dengan suara yang merdu dan lantang.",
        "arabic_text": "حَدَّثَنِي بِشْرُ بْنُ الْحَكَمِ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا أَذِنَ اللَّهُ لِشَيْءٍ مَا أَذِنَ لِنَبِيٍّ حَسَنِ الصَّوْتِ يَتَغَنَّى بِالْقُرْآنِ يَجْهَرُ بِهِ."
      },
      {
        "id": 9412,
        "hadith_number": "1848",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Riwayat Hadis dengan Sanad Serupa Tetapi Perbezaan Lafaz",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "This hadith has been narrated with the same chain of transmitters by Ibn al-Had except this that Abu Huraira reported Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying and he did not say: He heard it.",
        "malay_translation": "Hadis ini telah diriwayatkan dengan sanad yang sama oleh Ibn al-Had, kecuali ini bahawa Abu Huraira meriwayatkan Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda dan beliau tidak mengatakan: 'Beliau mendengarnya.'",
        "arabic_text": "و حَدَّثَنِي ابْنُ أَخِي ابْنِ وَهْبٍ حَدَّثَنَا عَمِّي عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي عُمَرُ بْنُ مَالِكٍ وَحَيْوَةُ بْنُ شُرَيْحٍ عَنْ ابْنِ الْهَادِ بِهَذَا الْإِسْنَادِ مِثْلَهُ سَوَاءً وَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَقُلْ سَمِعَ"
      },
      {
        "id": 9413,
        "hadith_number": "1849",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Mendengar Al-Quran dengan Suara Merdu",
        "perawi_melayu": "Abu Huraira رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Allah has not heard anything (more pleasing) than listening to the Prophet reciting the Qur'an in a sweet loud voice.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Allah tidak mendengar sesuatu pun (yang lebih menyenangkan) daripada mendengar Nabi membaca Al-Quran dengan suara yang merdu dan lantang.",
        "arabic_text": "و حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى حَدَّثَنَا هِقْلٌ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَذِنَ اللَّهُ لِشَيْءٍ كَأَذَنِهِ لِنَبِيٍّ يَتَغَنَّى بِالْقُرْآنِ يَجْهَرُ بِهِ."
      },
      {
        "id": 9414,
        "hadith_number": "1850",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Serupa dengan Hadis Yahya bin Abi Kathir daripada Abu Hurairah",
        "perawi_melayu": "Abu Hurairah رضي الله تعالى عنه",
        "english_text": "A hadith similar to that of Yahya bin Abi Kathir (no. 1849) was narrated from Abu Hurairah رضی اللہ تعالیٰ عنہ .",
        "malay_translation": "Hadis yang serupa dengan hadis Yahya bin Abi Kathir (no. 1849) diriwayatkan daripada Abu Hurairah رضي الله تعالى عنه .",
        "arabic_text": "و حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ بْنُ سَعِيدٍ وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ جَعْفَرٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَ حَدِيثِ يَحْيَى بْنِ أَبِي كَثِيرٍ غَيْرَ أَنَّ ابْنَ أَيُّوبَ قَالَ فِي رِوَايَتِهِ كَإِذْنِهِ."
      },
      {
        "id": 9415,
        "hadith_number": "1851",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keindahan Suara Abdullah bin Qais seperti Keluarga Nabi Daud",
        "perawi_melayu": "Buraida رضی اللہ تعالیٰ عنہ meriwayatkan daripada ayahnya:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had said: 'Abdullah bin Qais or al-Ash'ari has been gifted with a sweet melodious voice out of the voices of the family of David.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: 'Abdullah bin Qais atau al-Ash'ari telah dikurniakan suara yang merdu daripada suara keluarga Daud.'",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا مَالِكٌ وَهُوَ ابْنُ مِغْوَلٍ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ عَبْدَ اللَّهِ بْنَ قَيْسٍ أَوْ الْأَشْعَرِيَّ أُعْطِيَ مِزْمَارًا مِنْ مَزَامِيرِ آلِ دَاوُدَ."
      },
      {
        "id": 9416,
        "hadith_number": "1852",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pujian Rasulullah SAW Atas Suara Merdu Abu Musa",
        "perawi_melayu": "Abu Burda meriwayatkan daripada Abu Musa رضی اللہ تعالیٰ عنہ :",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had said to Abu Musa: If you were to see me, as I was listening to your recitation (of the Qur'an) yester-night (you would have felt delighted). You are in fact endowed with a sweet voice like that of David himself.",
        "malay_translation": "Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda kepada Abu Musa: Sekiranya kamu melihat aku ketika aku mendengar bacaanmu (Al-Quran) semalam, (pasti kamu akan gembira). Sesungguhnya kamu telah dikurniakan suara yang merdu seperti suara Nabi Daud sendiri.",
        "arabic_text": "و حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا طَلْحَةُ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَبِي مُوسَى لَوْ رَأَيْتَنِي وَأَنَا أَسْتَمِعُ لِقِرَاءَتِكَ الْبَارِحَةَ لَقَدْ أُوتِيتَ مِزْمَارًا مِنْ مَزَامِيرِ آلِ دَاوُدَ."
      },
      {
        "id": 9417,
        "hadith_number": "1853",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah ﷺ Membaca Surah al-Fath Semasa Perjalanan",
        "perawi_melayu": "Mu'awiya bin Qurra meriwayatkan daripada 'Abdullah bin Mughaffal al-Muzani رضی اللہ تعالیٰ عنہ berkata:",
        "english_text": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) recited on his ride Surat al Fath during a journey in the year of the Conquest (of Mecca), and he repeated (the words) in his recitation. Mu'awiya said: If I were not afraid that the people would crowd around me, I would have given a demonstration of (the Prophet's) recitation before you.",
        "malay_translation": "Rasulullah ﷺ membaca Surah al-Fath ketika menunggang kenderaan dalam perjalanan pada tahun Pembukaan Kota Mekah, dan baginda mengulang-ulang (ayat-ayat) dalam bacaannya. Mu'awiya berkata: Sekiranya aku tidak takut orang ramai akan berkerumun di sekelilingku, aku akan memperagakan bacaan (Nabi) di hadapan kamu.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ وَوَكِيعٌ عَنْ شُعْبَةَ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مُغَفَّلٍ الْمُزَنِيَّ يَقُولُ قَرَأَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْفَتْحِ فِي مَسِيرٍ لَهُ سُورَةَ الْفَتْحِ عَلَى رَاحِلَتِهِ فَرَجَّعَ فِي قِرَاءَتِهِ قَالَ مُعَاوِيَةُ لَوْلَا أَنِّي أَخَافُ أَنْ يَجْتَمِعَ عَلَيَّ النَّاسُ لَحَكَيْتُ لَكُمْ قِرَاءَتَهُ."
      },
      {
        "id": 9418,
        "hadith_number": "1854",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah ﷺ Membaca Surah Al-Fath di Atas Unta Semasa Pembukaan Mekah",
        "perawi_melayu": "Diriwayatkan daripada Mu'awiya bin Qurra bahawa beliau mendengar Abdullah bin Mughaffal berkata:",
        "english_text": "I saw the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) reciting Surah Fath on his camel on the day of the Conquest of Mecca. He (the narrator) said: Ibn Mughaffal رضی اللہ تعالیٰ عنہ recited it and repeated it. Mu'awiya said: Had there been (no crowed of) people, I would have given a practical demonstration of that which Ibn Mughaffal رضی اللہ تعالیٰ عنہ had mentioned from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
        "malay_translation": "Saya melihat Rasulullah ﷺ membaca Surah Al-Fath di atas unta baginda pada hari Pembukaan Mekah. Beliau (perawi) berkata: Ibn Mughaffal رضي الله تعالى عنه membacanya dan mengulanginya. Mu'awiya berkata: Sekiranya tidak ada orang ramai, saya akan memberikan demonstrasi praktikal tentang apa yang telah disebutkan oleh Ibn Mughaffal رضي الله تعالى عنه daripada Rasulullah ﷺ.",
        "arabic_text": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مُغَفَّلٍ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ فَتْحِ مَكَّةَ عَلَى نَاقَتِهِ يَقْرَأُ سُورَةَ الْفَتْحِ قَالَ فَقَرَأَ ابْنُ مُغَفَّلٍ وَرَجَّعَ فَقَالَ مُعَاوِيَةُ لَوْلَا النَّاسُ لَأَخَذْتُ لَكُمْ بِذَلِكَ الَّذِي ذَكَرَهُ ابْنُ مُغَفَّلٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 9419,
        "hadith_number": "1855",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Nabi Muhammad SAW Membaca Surah al-Fath Semasa Perjalanan",
        "perawi_melayu": "Hadis ini diriwayatkan oleh Khalid al-Harith dengan sanad yang sama (dengan kata-kata ini):",
        "english_text": "(The Holy Prophet) was reciting Surat al-Fath as he was travelling on his mount.",
        "malay_translation": "(Nabi Suci) sedang membaca Surah al-Fath ketika baginda sedang dalam perjalanan di atas tunggangannya.",
        "arabic_text": "و حَدَّثَنَاه يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ ح و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي قَالَا حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ نَحْوَهُ وَفِي حَدِيثِ خَالِدِ بْنِ الْحَارِثِ قَالَ عَلَى رَاحِلَةٍ يَسِيرُ وَهُوَ يَقْرَأُ سُورَةَ الْفَتْحِ."
      },
      {
        "id": 9420,
        "hadith_number": "1856",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keberkatan dan Ketenangan Ketika Membaca Surah Al-Kahf",
        "perawi_melayu": "Al-Bara' رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "A person was reciting Surat al-Kahf and there was a horse tied with two ropes at his side, a cloud overshadowed him, and as it began to come nearer and nearer his horse began to take fright from it. He went and mentioned that to the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in the morning, and he (the Holy Prophet) said: That was tranquillity which came down at the recitation of the Qur'an.",
        "malay_translation": "Seorang lelaki sedang membaca Surah al-Kahf dan terdapat seekor kuda yang diikat dengan dua tali di sisinya, awan menaunginya, dan apabila ia mula mendekat dan mendekat, kudanya mula menjadi takut kerananya. Dia pergi dan menyebut perkara itu kepada Nabi (صلی ‌اللہ ‌علیہ ‌وسلم ‌) pada waktu pagi, dan baginda (Nabi Suci) bersabda: Itu adalah ketenangan yang turun ketika bacaan Al-Quran.",
        "arabic_text": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَ كَانَ رَجُلٌ يَقْرَأُ سُورَةَ الْكَهْفِ وَعِنْدَهُ فَرَسٌ مَرْبُوطٌ بِشَطَنَيْنِ فَتَغَشَّتْهُ سَحَابَةٌ فَجَعَلَتْ تَدُورُ وَتَدْنُو وَجَعَلَ فَرَسُهُ يَنْفِرُ مِنْهَا فَلَمَّا أَصْبَحَ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ تِلْكَ السَّكِينَةُ تَنَزَّلَتْ لِلْقُرْآنِ."
      },
      {
        "id": 9421,
        "hadith_number": "1857",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Surah al-Kahf dan Turunnya Sakina",
        "perawi_melayu": "Ibn Ishaq meriwayatkan:",
        "english_text": "I heard al-Bara' رضی اللہ تعالیٰ عنہ as saying that a man recited al-Kahf when an animal was there in the house and it began to take fright. And as he looked around, he found a cloud overshadowing it. He mentioned that to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). Upon this he said: O so and so, recite on (the surah) as-Sakina descends at the (recitation of the Qur'an) or on account (of the recitation) of the Qur'an.",
        "malay_translation": "Saya mendengar al-Bara' رضی اللہ تعالیٰ عنہ berkata bahawa seorang lelaki membaca surah al-Kahf ketika seekor haiwan berada di dalam rumah dan ia mula ketakutan. Dan ketika dia melihat sekeliling, dia mendapati awan menaunginya. Dia menyebut perkara itu kepada Rasulullah (صلی اللہ علیہ وسلم). Lalu baginda bersabda: Wahai fulan, teruskan membaca (surah ini) kerana as-Sakina turun ketika (bacaan al-Quran) atau disebabkan (bacaan) al-Quran.",
        "arabic_text": "و حَدَّثَنَا ابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ وَاللَّفْظُ لِابْنِ الْمُثَنَّى قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ قَالَ سَمِعْتُ الْبَرَاءَ يَقُولُ قَرَأَ رَجُلٌ الْكَهْفَ وَفِي الدَّارِ دَابَّةٌ فَجَعَلَتْ تَنْفِرُ فَنَظَرَ فَإِذَا ضَبَابَةٌ أَوْ سَحَابَةٌ قَدْ غَشِيَتْهُ قَالَ فَذَكَرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ اقْرَأْ فُلَانُ فَإِنَّهَا السَّكِينَةُ تَنَزَّلَتْ عِنْدَ الْقُرْآنِ أَوْ تَنَزَّلَتْ لِلْقُرْآنِ."
      },
      {
        "id": 9422,
        "hadith_number": "1858",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Penyebutan Al Bara dan Kuda Melompat (Serupa dengan Hadith 1857)",
        "perawi_melayu": "Diriwayatkan daripada Abu Ishaq berkata:",
        "english_text": "\"I heard Al Bara رضی اللہ تعالیٰ عنہ say....\" and he mentioned something similar (to no. 1857), but they said: \" (the horse) jumped.\"",
        "malay_translation": "Saya mendengar Al Bara رضی اللہ تعالیٰ عنہ berkata....\" dan beliau menyebutkan sesuatu yang serupa (dengan no. 1857), tetapi mereka berkata: \" (kuda itu) melompat.\"",
        "arabic_text": "و حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ وَأَبُو دَاوُدَ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ قَالَ سَمِعْتُ الْبَرَاءَ يَقُولُ فَذَكَرَا نَحْوَهُ غَيْرَ أَنَّهُمَا قَالَا تَنْقُزُ."
      },
      {
        "id": 9423,
        "hadith_number": "1859",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Malaikat Mendengar Bacaan Al-Quran",
        "perawi_melayu": "Abu Sa'id al-Khudri رضی اللہ تعالیٰ عنہ meriwayatkan daripada Usaid bin Hudair رضی اللہ تعالیٰ عنہ yang berkata:",
        "english_text": "One night he recited the Qur'an in his enclosure, when the horse began to jump about. He again recited and (the horse) again jumped. He again recited and it jumped as before. Usaid رضی اللہ تعالیٰ عنہ said: I was afraid lest it should trample (his son) Yahya. I stood near it (the horse) and saw something like a canopy over my head with what seemed to be lamps in it, rising up in the sky till it disappeared. I went to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on the next day and said: Messenger of Allah, I recited the Qur'an during the night in my enclosure and my horse began to jump. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: You should have kept on reciting, Ibn Hudair. He (Ibn Hudair) said: I recited. It jumped (as before). Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) again said: You should have kept on reciting, Ibn Hudair. He (Ibn Hudair) said: I recited and it again jumped (as before). The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) again said: You should kave kept on reciting, Ibu Hudair. He (Ibn Hudair) said: (Messenger of Allah) I finished (the recitation) for Yahya was near (the horse) and I was afraid lest it should trample him. I saw something like a canopy with what seemed to be lamps in it rising up in the sky till it disappeared. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Those were the angels who listened to you; and if you had continued reciting, the people would have seen them in the morning and they would not have concealed themselves from them.",
        "malay_translation": "Pada suatu malam, beliau membaca Al-Quran di dalam kandangnya, ketika kuda itu mula melompat-lompat. Beliau membaca lagi, dan kuda itu melompat lagi. Beliau membaca lagi, dan ia melompat seperti sebelumnya. Usaid رضی اللہ تعالیٰ عنہ berkata: \"Saya takut ia akan memijak anak saya, Yahya.\" Saya berdiri dekat dengan kuda itu dan melihat sesuatu seperti kanopi di atas kepala saya dengan apa yang kelihatan seperti lampu di dalamnya, naik ke langit sehingga hilang. Pada keesokan harinya, saya pergi menemui Rasulullah (صلی اللہ علیہ وسلم) dan berkata: \"Wahai Rasulullah, saya membaca Al-Quran pada malam hari di dalam kandang saya dan kuda saya mula melompat.\" Rasulullah (صلی اللہ علیہ وسلم) bersabda: \"Seharusnya kamu teruskan membaca, wahai Ibn Hudair.\" Ibn Hudair berkata: \"Saya membaca lagi, dan ia melompat seperti sebelumnya.\" Rasulullah (صلی اللہ علیہ وسلم) bersabda lagi: \"Seharusnya kamu teruskan membaca, wahai Ibn Hudair.\" Ibn Hudair berkata: \"Saya membaca lagi, dan ia melompat lagi seperti sebelumnya.\" Rasulullah (صلی اللہ علیہ وسلم) bersabda lagi: \"Seharusnya kamu teruskan membaca, wahai Ibn Hudair.\" Ibn Hudair berkata: \"(Wahai Rasulullah) Saya berhenti membaca kerana Yahya berada dekat dengan kuda itu dan saya takut ia akan memijaknya. Saya melihat sesuatu seperti kanopi dengan apa yang kelihatan seperti lampu di dalamnya naik ke langit sehingga hilang.\" Rasulullah (صلی اللہ علیہ وسلم) bersabda: \"Itulah para malaikat yang sedang mendengar bacaanmu; dan sekiranya kamu terus membaca, pasti orang ramai akan dapat melihat mereka pada pagi hari dan mereka tidak akan menyembunyikan diri dari pandangan mereka.\"",
        "arabic_text": "و حَدَّثَنِي حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ وَحَجَّاجُ بْنُ الشَّاعِرِ وَتَقَارَبَا فِي اللَّفْظِ قَالَا حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبِي حَدَّثَنَا يَزِيدُ بْنُ الْهَادِ أَنَّ عَبْدَ اللَّهِ بْنَ خَبَّابٍ حَدَّثَهُ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ حَدَّثَهُ أَنَّ أُسَيْدَ بْنَ حُضَيْرٍ بَيْنَمَا هُوَ لَيْلَةً يَقْرَأُ فِي مِرْبَدِهِ إِذْ جَالَتْ فَرَسُهُ فَقَرَأَ ثُمَّ جَالَتْ أُخْرَى فَقَرَأَ ثُمَّ جَالَتْ أَيْضًا قَالَ أُسَيْدٌ فَخَشِيتُ أَنْ تَطَأَ يَحْيَى فَقُمْتُ إِلَيْهَا فَإِذَا مِثْلُ الظُّلَّةِ فَوْقَ رَأْسِي فِيهَا أَمْثَالُ السُّرُجِ عَرَجَتْ فِي الْجَوِّ حَتَّى مَا أَرَاهَا قَالَ فَغَدَوْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ بَيْنَمَا أَنَا الْبَارِحَةَ مِنْ جَوْفِ اللَّيْلِ أَقْرَأُ فِي مِرْبَدِي إِذْ جَالَتْ فَرَسِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْرَأْ ابْنَ حُضَيْرٍ قَالَ فَقَرَأْتُ ثُمَّ جَالَتْ أَيْضًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْرَأْ ابْنَ حُضَيْرٍ قَالَ فَقَرَأْتُ ثُمَّ جَالَتْ أَيْضًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْرَأْ ابْنَ حُضَيْرٍ قَالَ فَانْصَرَفْتُ وَكَانَ يَحْيَى قَرِيبًا مِنْهَا خَشِيتُ أَنْ تَطَأَهُ فَرَأَيْتُ مِثْلَ الظُّلَّةِ فِيهَا أَمْثَالُ السُّرُجِ عَرَجَتْ فِي الْجَوِّ حَتَّى مَا أَرَاهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تِلْكَ الْمَلَائِكَةُ كَانَتْ تَسْتَمِعُ لَكَ وَلَوْ قَرَأْتَ لَأَصْبَحَتْ يَرَاهَا النَّاسُ مَا تَسْتَتِرُ مِنْهُمْ."
      },
      {
        "id": 9424,
        "hadith_number": "1860",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perumpamaan Seorang Mukmin yang Membaca Al-Quran dan Seorang Munafik",
        "perawi_melayu": "Diriwayatkan daripada Abu Musa al-Ash'ari رضی اللہ تعالیٰ عنہ:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: A believer who recites the Qur'an is like an orange whose fragrance is sweet and whose taste is sweet; a believer who does not recite the Qur'an is like a date which has no fragrance but has a sweet taste; and the hypocrite who recites the Qur'an is like a basil whose fragrance is sweet, but whose taste is bitter; and a hypocrite who does not recite the Qur'an is like the colocynth which has no fragrance and has a bitter taste.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Perumpamaan seorang mukmin yang membaca Al-Quran adalah seperti buah oren, baunya harum dan rasanya manis; perumpamaan seorang mukmin yang tidak membaca Al-Quran adalah seperti buah kurma, tidak berbau tetapi rasanya manis; dan perumpamaan seorang munafik yang membaca Al-Quran adalah seperti tumbuhan selasih, baunya harum, tetapi rasanya pahit; dan perumpamaan seorang munafik yang tidak membaca Al-Quran adalah seperti buah labu pahit yang tidak berbau dan rasanya pahit.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَأَبُو كَامِلٍ الْجَحْدَرِيُّ كِلَاهُمَا عَنْ أَبِي عَوَانَةَ قَالَ قُتَيْبَةُ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثَلُ الْمُؤْمِنِ الَّذِي يَقْرَأُ الْقُرْآنَ مَثَلُ الْأُتْرُجَّةِ رِيحُهَا طَيِّبٌ وَطَعْمُهَا طَيِّبٌ وَمَثَلُ الْمُؤْمِنِ الَّذِي لَا يَقْرَأُ الْقُرْآنَ مَثَلُ التَّمْرَةِ لَا رِيحَ لَهَا وَطَعْمُهَا حُلْوٌ وَمَثَلُ الْمُنَافِقِ الَّذِي يَقْرَأُ الْقُرْآنَ مَثَلُ الرَّيْحَانَةِ رِيحُهَا طَيِّبٌ وَطَعْمُهَا مُرٌّ وَمَثَلُ الْمُنَافِقِ الَّذِي لَا يَقْرَأُ الْقُرْآنَ كَمَثَلِ الْحَنْظَلَةِ لَيْسَ لَهَا رِيحٌ وَطَعْمُهَا مُرٌّ."
      },
      {
        "id": 9425,
        "hadith_number": "1861",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perbezaan Riwayat Hadis: Munafik atau Jahat",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "This hadith has been narrated by Qatada with the same chain of transmitters but with one alteration that instead of the word: hypocrite (Munafiq), there it is wicked (fajir).",
        "malay_translation": "Hadis ini telah diriwayatkan oleh Qatada dengan sanad yang sama tetapi dengan satu perubahan iaitu menggantikan perkataan: munafik (Munafiq), di situ ia adalah jahat (fajir).",
        "arabic_text": "و حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ حَدَّثَنَا هَمَّامٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ كِلَاهُمَا عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ مِثْلَهُ غَيْرَ أَنَّ فِي حَدِيثِ هَمَّامٍ بَدَلَ الْمُنَافِقِ الْفَاجِرِ."
      },
      {
        "id": 9426,
        "hadith_number": "1862",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Membaca Al-Quran bagi yang Mahir dan yang Tergagap",
        "perawi_melayu": "Diriwayatkan daripada A'isha رضی اللہ تعالیٰ عنہا:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) (as saying): One who is proficient in the Qur'an is associated with the noble, upright, recording angels; and he who falters in it, and finds it difficult for him, will have a double reward.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Orang yang mahir dalam membaca Al-Quran akan bersama para malaikat yang mulia lagi berbakti; dan orang yang membaca Al-Quran dengan tergagap-gagap dan merasa kesulitan, maka baginya pahala yang berlipat ganda.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ جَمِيعًا عَنْ أَبِي عَوَانَةَ قَالَ ابْنُ عُبَيْدٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ سَعْدِ بْنِ هِشَامٍ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَاهِرُ بِالْقُرْآنِ مَعَ السَّفَرَةِ الْكِرَامِ الْبَرَرَةِ وَالَّذِي يَقْرَأُ الْقُرْآنَ وَيَتَتَعْتَعُ فِيهِ وَهُوَ عَلَيْهِ شَاقٌّ لَهُ أَجْرَانِ."
      },
      {
        "id": 9427,
        "hadith_number": "1863",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ganjaran Berganda bagi Kesukaran Membaca Al-Quran",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "This hadith has been reported with the same chain of transmitters by Qatada except with this change: He who finds it hard (to recite the Qur'an) will have a double reward.",
        "malay_translation": "Hadis ini telah diriwayatkan dengan sanad yang sama oleh Qatada kecuali dengan perubahan ini: Sesiapa yang mendapati sukar (untuk membaca Al-Quran) akan mendapat pahala berganda.",
        "arabic_text": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ سَعِيدٍ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ هِشَامٍ الدَّسْتَوَائِيِّ كِلَاهُمَا عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ و قَالَ فِي حَدِيثِ وَكِيعٍ وَالَّذِي يَقْرَأُ وَهُوَ يَشْتَدُّ عَلَيْهِ لَهُ أَجْرَانِ."
      },
      {
        "id": 9428,
        "hadith_number": "1864",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perintah Allah kepada Rasulullah untuk Membacakan Al-Quran kepada Ubayy bin Ka'b dan Kegembiraan Ubayy",
        "perawi_melayu": "Diriwayatkan oleh Anas رضی اللہ تعالیٰ عنہ:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying to Ubayy bin Ka'b: Allah has commanded me to recite the Qur'an to you. He said: Did Allah mention me to you by name? He (the Holy Prophet) said: Allah made a mention of your name to me. (On hearing this) Ubayy b. Ka'b wept.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda kepada Ubayy bin Ka'b: Allah telah memerintahkan aku untuk membacakan Al-Quran kepadamu. Dia bertanya: Adakah Allah menyebut namaku kepadamu? Baginda (Nabi Suci) bersabda: Allah menyebut namamu kepadaku. (Mendengar ini) Ubayy b. Ka'b menangis.",
        "arabic_text": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأُبَيٍّ إِنَّ اللَّهَ أَمَرَنِي أَنْ أَقْرَأَ عَلَيْكَ قَالَ آللَّهُ سَمَّانِي لَكَ قَالَ اللَّهُ سَمَّاكَ لِي قَالَ فَجَعَلَ أُبَيٌّ يَبْكِي."
      },
      {
        "id": 9429,
        "hadith_number": "1865",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perintah Allah kepada Rasulullah untuk Membacakan Surah Al-Bayyinah kepada Ubayy bin Ka'b dan Kegembiraan Ubayy",
        "perawi_melayu": "Daripada Anas رضی اللہ تعالیٰ عنہ :",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying to Ubayy bin Ka`b رضی اللہ تعالیٰ عنہ : Allah has commanded me to recite to you: Those who disbelieve were not... (al-Qur'an, xcviii. 1). He said: Did He mention me by name? He (the Prophet said): Yes. Upon this he shed tears (of gratitude).",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda kepada Ubayy bin Ka'b رضی اللہ تعالیٰ عنہ : Allah telah memerintahkan aku untuk membacakan kepadamu: Orang-orang yang kafir dari Ahli Kitab... (Al-Quran, xcviii. 1). Ubayy bertanya: Adakah Allah menyebut namaku? Baginda (Nabi) menjawab: Ya. Maka Ubayy pun menitiskan air mata (kesyukuran).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأُبَيِّ بْنِ كَعْبٍ إِنَّ اللَّهَ أَمَرَنِي أَنْ أَقْرَأَ عَلَيْكَ لَمْ يَكُنْ الَّذِينَ كَفَرُوا قَالَ وَسَمَّانِي لَكَ قَالَ نَعَمْ قَالَ فَبَكَى."
      },
      {
        "id": 9430,
        "hadith_number": "1866",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah ﷺ Bersabda Perkara yang Sama kepada Ubayy رضي الله عنه",
        "perawi_melayu": "Qatada berkata:",
        "english_text": "I heard Anas رضی اللہ تعالیٰ عنہ saying that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to Ubayy رضی اللہ تعالیٰ عنہ the same thing.",
        "malay_translation": "Saya mendengar Anas رضی اللہ تعالیٰ عنہ berkata bahawa Rasulullah ( صلى الله عليه وسلم ) bersabda kepada Ubayy رضی الله تعالیٰ عنه perkara yang sama.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ أَنَسًا يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأُبَيٍّ بِمِثْلِهِ."
      },
      {
        "id": 9431,
        "hadith_number": "1867",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah SAW Menangis Ketika Mendengar Bacaan Al-Quran",
        "perawi_melayu": "Abdullah (bin Mas'ud) رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "The Messenger of Allah (may peace be upon (him) asked me to recite the Qur'an. He said: Messenger of Allah, (how) should I recite to you whereas it has been sent down to you? He (the Holy Prophet) said: I desire to hear it from someone else. So I recited Surat al-Nisa' till I reached the verse: How then shall it be when We shall bring from every people a witness and bring you against them as a witness? (verse 41). I lifted my head or a person touched me in my side, and so I lifted my head and saw his tears falling (from the Holy Prophet's eyes).",
        "malay_translation": "Rasulullah ﷺ meminta saya untuk membaca Al-Quran. Saya berkata: Wahai Rasulullah, (bagaimana) saya harus membaca kepada anda sedangkan ia diturunkan kepada anda? Baginda ﷺ bersabda: Aku ingin mendengarnya dari orang lain. Maka saya membaca Surah An-Nisa' hingga saya sampai pada ayat: Maka bagaimanakah (keadaan orang kafir nanti), apabila Kami datangkan dari tiap-tiap umat seorang saksi (rasul), dan Kami datangkan kamu (Muhammad) sebagai saksi atas mereka itu (sebagai umatmu)? (ayat 41). Saya mengangkat kepala saya atau seseorang menyentuh saya di sisi saya, lalu saya mengangkat kepala dan melihat air mata Baginda ﷺ jatuh (dari mata Rasulullah ﷺ).",
        "arabic_text": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ جَمِيعًا عَنْ حَفْصٍ قَالَ أَبُو بَكْرٍ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَبِيدَةَ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْرَأْ عَلَيَّ الْقُرْآنَ قَالَ فَقُلْتُ يَا رَسُولَ اللَّهِ أَقْرَأُ عَلَيْكَ وَعَلَيْكَ أُنْزِلَ قَالَ إِنِّي أَشْتَهِي أَنْ أَسْمَعَهُ مِنْ غَيْرِي فَقَرَأْتُ النِّسَاءَ حَتَّى إِذَا بَلَغْتُ فَكَيْفَ إِذَا جِئْنَا مِنْ كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَى هَؤُلَاءِ شَهِيدًا رَفَعْتُ رَأْسِي أَوْ غَمَزَنِي رَجُلٌ إِلَى جَنْبِي فَرَفَعْتُ رَأْسِي فَرَأَيْتُ دُمُوعَهُ تَسِيلُ."
      },
      {
        "id": 9432,
        "hadith_number": "1868",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah Meminta Bacaan di Mimbar",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "This hadith has been narratted by A'mash with the same chain of transmitters but with this addition: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was on the pulpit when he asked me to recite to him.",
        "malay_translation": "Hadis ini diriwayatkan oleh A'mash dengan sanad yang sama tetapi dengan tambahan ini: Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) berada di atas mimbar ketika baginda meminta saya untuk membacakan kepadanya.",
        "arabic_text": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ وَمِنْجَابُ بْنُ الْحَارِثِ التَّمِيمِيُّ جَمِيعًا عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ وَزَادَ هَنَّادٌ فِي رِوَايَتِهِ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى الْمِنْبَرِ اقْرَأْ عَلَيَّ."
      },
      {
        "id": 9433,
        "hadith_number": "1869",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah SAW Meminta Abdullah bin Mas'ud Membacakan Al-Quran dan Baginda Menangis",
        "perawi_melayu": "Ibrahim meriwayatkan:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) asked 'Abdullah bin Mas'ud رضی اللہ تعالیٰ عنہ to recite to him (the Qur'an). He said: Should I recite it to you while it has been sent down or revealed to you? He (the Holy Prophet) said: I love to hear it from someone else. So he ('Abdullah b. Mas'ud) recited to him (from the beginning of Surat al Nisa' up to the verse: How shall then it be when We bring from every people a witness and bring you as a witness against them? He (the Holy Prophet) wept (on listening to it). It is narrated on the authority of Ibn Mas'ud رضی اللہ تعالیٰ عنہ through another chain of transmitters that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) also said that he had been a witness to his people as long as (said he): I lived among them or I had been among them.",
        "malay_translation": "Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) bertanya kepada 'Abdullah bin Mas'ud رضی اللہ تعالیٰ عنہ untuk membacakan (Al-Quran) kepadanya. Beliau berkata: Patutkah saya membacakannya kepada anda sedangkan ia diturunkan atau diwahyukan kepada anda? Baginda (Nabi Suci) bersabda: Saya suka mendengarnya daripada orang lain. Maka beliau ('Abdullah b. Mas'ud) membacakan kepadanya (dari permulaan Surah an-Nisa' hingga ayat: Maka bagaimanakah (keadaan mereka) apabila Kami datangkan dari tiap-tiap umat seorang saksi dan Kami datangkan kamu (Muhammad) sebagai saksi atas mereka itu (sebagai umatmu)? Baginda (Nabi Suci) menangis (ketika mendengarkannya). Diriwayatkan daripada Ibn Mas'ud رضی اللہ تعالیٰ عنہ melalui rangkaian periwayat lain bahawa Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) juga bersabda bahawa baginda menjadi saksi kepada umatnya selagi (sabda baginda): Saya hidup di antara mereka atau saya berada di antara mereka.",
        "arabic_text": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنِي مِسْعَرٌ وَقَالَ أَبُو كُرَيْبٍ عَنْ مِسْعَرٍ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ إِبْرَاهِيمَ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِعَبْدِ اللَّهِ بْنِ مَسْعُودٍ اقْرَأْ عَلَيَّ قَالَ أَقْرَأُ عَلَيْكَ وَعَلَيْكَ أُنْزِلَ قَالَ إِنِّي أُحِبُّ أَنْ أَسْمَعَهُ مِنْ غَيْرِي قَالَ فَقَرَأَ عَلَيْهِ مِنْ أَوَّلِ سُورَةِ النِّسَاءِ إِلَى قَوْلِهِ فَكَيْفَ إِذَا جِئْنَا مِنْ كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَى هَؤُلَاءِ شَهِيدًا فَبَكَى قَالَ مِسْعَرٌ فَحَدَّثَنِي مَعْنٌ عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ حُرَيْثٍ عَنْ أَبِيهِ عَنْ ابْنِ مَسْعُودٍ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَهِيدًا عَلَيْهِمْ مَا دُمْتُ فِيهِمْ أَوْ مَا كُنْتُ فِيهِمْ شَكَّ مِسْعَرٌ."
      },
      {
        "id": 9434,
        "hadith_number": "1870",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Teguran terhadap Bacaan al-Quran dan Hukuman bagi Peminum Arak",
        "perawi_melayu": "Abdullah (bin Mas'ud) رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "I was in Hims when some of the people asked me to recite the Qur'an to them. So I recited Surah Yusuf to them. One of the persons among the people said: By Allah, this is not how it has been sent down. I said: Woe upon you! By Allah, I recited it to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he said to me: You have (recited) it well. I was talking with him (the man who objected to my recitation) that I sensed the smell of wine from him. So I said to him. Do you drink wine and belie the Book (of Allah)? You would not depart till I would whip you. So I lashed him according to the prescribed punishment (for the offence of drinking wine).",
        "malay_translation": "Saya berada di Hims ketika beberapa orang meminta saya untuk membaca al-Quran kepada mereka. Maka saya membaca Surah Yusuf kepada mereka. Salah seorang daripada orang ramai berkata: Demi Allah, bukan begini ia diturunkan. Saya berkata: Celaka kamu! Demi Allah, saya membacanya kepada Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) dan baginda bersabda kepada saya: Kamu telah (membacanya) dengan baik. Saya sedang bercakap dengannya (lelaki yang membantah bacaan saya) apabila saya terhidu bau arak daripadanya. Maka saya berkata kepadanya: Adakah kamu minum arak dan mendustakan Kitab (Allah)? Kamu tidak akan pergi sehingga saya menyebat kamu. Maka saya menyebatnya menurut hukuman yang ditetapkan (bagi kesalahan minum arak).",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ كُنْتُ بِحِمْصَ فَقَالَ لِي بَعْضُ الْقَوْمِ اقْرَأْ عَلَيْنَا فَقَرَأْتُ عَلَيْهِمْ سُورَةَ يُوسُفَ قَالَ فَقَالَ رَجُلٌ مِنْ الْقَوْمِ وَاللَّهِ مَا هَكَذَا أُنْزِلَتْ قَالَ قُلْتُ وَيْحَكَ وَاللَّهِ لَقَدْ قَرَأْتُهَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لِي أَحْسَنْتَ فَبَيْنَمَا أَنَا أُكَلِّمُهُ إِذْ وَجَدْتُ مِنْهُ رِيحَ الْخَمْرِ قَالَ فَقُلْتُ أَتَشْرَبُ الْخَمْرَ وَتُكَذِّبُ بِالْكِتَابِ لَا تَبْرَحُ حَتَّى أَجْلِدَكَ قَالَ فَجَلَدْتُهُ الْحَدَّ."
      },
      {
        "id": 9435,
        "hadith_number": "1871",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pujian Nabi atas Bacaan Al-Quran yang Baik",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "This hadith has been narrated by A'mash with the same chain of transmitters but with an exception that it is not mentioned in it: He said to me: You recited (the Qur'an) well.",
        "malay_translation": "Hadis ini telah diriwayatkan oleh A'mash dengan sanad yang sama tetapi dengan pengecualian bahawa tidak disebutkan di dalamnya: Dia berkata kepada saya: Kamu membaca (Al-Quran) dengan baik.",
        "arabic_text": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَلِيُّ بْنُ خَشْرَمٍ قَالَا أَخْبَرَنَا عِيسَى بْنُ يُونُسَ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ جَمِيعًا عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ وَلَيْسَ فِي حَدِيثِ أَبِي مُعَاوِيَةَ فَقَالَ لِي أَحْسَنْتَ."
      },
      {
        "id": 9436,
        "hadith_number": "1872",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Membaca Ayat Al-Quran dalam Solat",
        "perawi_melayu": "Abu Hurairah رضی اللہ تعالیٰ عنہ",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Would any one of you like, when he returns to his family, to find there three large, fat, pregnant she-camels? We said: Yes. Upon this he said: Three verses that one of you recites in his prayer are better for him than three large, fat, pregnant she-camels.",
        "malay_translation": "Rasulullah ﷺ bersabda: “Adakah sesiapa di antara kamu suka, apabila dia kembali kepada keluarganya, mendapati di sana tiga ekor unta betina yang besar, gemuk, dan bunting?” Kami berkata: “Ya.” Kemudian baginda bersabda: “Tiga ayat yang dibaca oleh salah seorang daripada kamu dalam solatnya adalah lebih baik baginya daripada tiga ekor unta betina yang besar, gemuk, dan bunting.”",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو سَعِيدٍ الْأَشَجُّ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُحِبُّ أَحَدُكُمْ إِذَا رَجَعَ إِلَى أَهْلِهِ أَنْ يَجِدَ فِيهِ ثَلَاثَ خَلِفَاتٍ عِظَامٍ سِمَانٍ قُلْنَا نَعَمْ قَالَ فَثَلَاثُ آيَاتٍ يَقْرَأُ بِهِنَّ أَحَدُكُمْ فِي صَلَاتِهِ خَيْرٌ لَهُ مِنْ ثَلَاثِ خَلِفَاتٍ عِظَامٍ سِمَانٍ."
      },
      {
        "id": 9437,
        "hadith_number": "1873",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Mempelajari Ayat-ayat Al-Quran di Masjid",
        "perawi_melayu": "Uqba bin 'Amir رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "When we were in Suffa, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came out and said: Which of you would like to go out every morning to Buthan or al-'Aqiq and bring two large she-camels without being guilty of sin or without severing the ties of kinship? We said: Messenger of Allah, we would like to do it. Upon this he said: Does not one of you go out in the morning to the mosque and teach or recite two verses from the Book of Allah. the Majestic and Glorious? That is better for him than two she-camels, and three verses are better (than three she-camels). and four verses are better for him than four (she-camels), and to on their number in camels.",
        "malay_translation": "Daripada Uqba bin 'Amir رضی اللہ تعالیٰ عنہ meriwayatkan: Ketika kami berada di Suffa, Rasulullah (صلی اللہ علیہ وسلم) keluar dan bersabda: “Siapakah di antara kamu yang ingin pergi setiap pagi ke Buthan atau al-'Aqiq dan membawa dua ekor unta betina yang besar tanpa melakukan dosa atau memutuskan tali persaudaraan?” Kami berkata: “Ya Rasulullah, kami ingin melakukannya.” Kemudian baginda bersabda: “Tidakkah salah seorang di antara kamu pergi pada pagi hari ke masjid dan mengajarkan atau membaca dua ayat daripada Kitab Allah, Yang Maha Agung dan Maha Mulia? Itu lebih baik baginya daripada dua ekor unta betina, dan tiga ayat lebih baik (daripada tiga ekor unta betina), dan empat ayat lebih baik baginya daripada empat (ekor unta betina), dan seterusnya sesuai dengan bilangannya dalam bilangan unta.”",
        "arabic_text": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ عَنْ مُوسَى بْنِ عُلَيٍّ قَالَ سَمِعْتُ أَبِي يُحَدِّثُ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ فِي الصُّفَّةِ فَقَالَ أَيُّكُمْ يُحِبُّ أَنْ يَغْدُوَ كُلَّ يَوْمٍ إِلَى بُطْحَانَ أَوْ إِلَى الْعَقِيقِ فَيَأْتِيَ مِنْهُ بِنَاقَتَيْنِ كَوْمَاوَيْنِ فِي غَيْرِ إِثْمٍ وَلَا قَطْعِ رَحِمٍ فَقُلْنَا يَا رَسُولَ اللَّهِ نُحِبُّ ذَلِكَ قَالَ أَفَلَا يَغْدُو أَحَدُكُمْ إِلَى الْمَسْجِدِ فَيَعْلَمُ أَوْ يَقْرَأُ آيَتَيْنِ مِنْ كِتَابِ اللَّهِ عَزَّ وَجَلَّ خَيْرٌ لَهُ مِنْ نَاقَتَيْنِ وَثَلَاثٌ خَيْرٌ لَهُ مِنْ ثَلَاثٍ وَأَرْبَعٌ خَيْرٌ لَهُ مِنْ أَرْبَعٍ وَمِنْ أَعْدَادِهِنَّ مِنْ الْإِبِلِ."
      },
      {
        "id": 9438,
        "hadith_number": "1874",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Membaca Al-Quran dan Surah Al-Baqarah serta Ali Imran",
        "perawi_melayu": "Abu Umama رضی اللہ تعالیٰ عنہ berkata:",
        "english_text": "He heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say: Recite the Qur'an, for on the Day of Resurrection it will come as an intercessor for those who recite It. Recite the two bright ones, al-Baqara and Surah Al 'Imran, for on the Day of Resurrection they will come as two clouds or two shades, or two flocks of birds in ranks, pleading for those who recite them. Recite Surah al-Baqara, for to take recourse to it is a blessing and to give it up is a cause of grief, and the magicians cannot confront it. (Mu'awiya said: It has been conveyed to me that here Batala means magicians.)",
        "malay_translation": "Beliau mendengar Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Bacalah Al-Quran, kerana sesungguhnya ia akan datang pada Hari Kiamat sebagai pemberi syafaat bagi mereka yang membacanya. Bacalah dua yang bercahaya, al-Baqara dan Surah Ali Imran, kerana sesungguhnya keduanya akan datang pada Hari Kiamat seperti dua awan atau dua naungan, atau dua kelompok burung yang berbaris, memohon syafaat bagi mereka yang membacanya. Bacalah Surah al-Baqara, kerana mengambilnya adalah keberkatan dan meninggalkannya adalah penyebab kesedihan, dan ahli sihir tidak dapat menghadapinya. (Mu'awiya berkata: Telah disampaikan kepadaku bahawa di sini Batala bermaksud ahli sihir.)",
        "arabic_text": "حَدَّثَنِي الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ حَدَّثَنَا أَبُو تَوْبَةَ وَهُوَ الرَّبِيعُ بْنُ نَافِعٍ حَدَّثَنَا مُعَاوِيَةُ يَعْنِي ابْنَ سَلَّامٍ عَنْ زَيْدٍ أَنَّهُ سَمِعَ أَبَا سَلَّامٍ يَقُولُ حَدَّثَنِي أَبُو أُمَامَةَ الْبَاهِلِيُّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اقْرَءُوا الْقُرْآنَ فَإِنَّهُ يَأْتِي يَوْمَ الْقِيَامَةِ شَفِيعًا لِأَصْحَابِهِ اقْرَءُوا الزَّهْرَاوَيْنِ الْبَقَرَةَ وَسُورَةَ آلِ عِمْرَانَ فَإِنَّهُمَا تَأْتِيَانِ يَوْمَ الْقِيَامَةِ كَأَنَّهُمَا غَمَامَتَانِ أَوْ كَأَنَّهُمَا غَيَايَتَانِ أَوْ كَأَنَّهُمَا فِرْقَانِ مِنْ طَيْرٍ صَوَافَّ تُحَاجَّانِ عَنْ أَصْحَابِهِمَا اقْرَءُوا سُورَةَ الْبَقَرَةِ فَإِنَّ أَخْذَهَا بَرَكَةٌ وَتَرْكَهَا حَسْرَةٌ وَلَا تَسْتَطِيعُهَا الْبَطَلَةُ قَالَ مُعَاوِيَةُ بَلَغَنِي أَنَّ الْبَطَلَةَ السَّحَرَةُ."
      },
      {
        "id": 9439,
        "hadith_number": "1875",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Penyampaian Hadis oleh Mu'awiya",
        "perawi_melayu": "Hadis ini diriwayatkan oleh Mu'awiya dengan sanad yang sama tetapi dengan pengecualian bahawa dalam riwayat ini kata-kata Mu'awiya:",
        "english_text": "It has been conveyed to me... have not been mentioned.",
        "malay_translation": "Telah disampaikan kepada saya... tidak disebutkan.",
        "arabic_text": "و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ أَخْبَرَنَا يَحْيَى يَعْنِي ابْنَ حَسَّانَ حَدَّثَنَا مُعَاوِيَةُ بِهَذَا الْإِسْنَادِ مِثْلَهُ غَيْرَ أَنَّهُ قَالَ وَكَأَنَّهُمَا فِي كِلَيْهِمَا وَلَمْ يَذْكُرْ قَوْلَ مُعَاوِيَةَ بَلَغَنِي."
      },
      {
        "id": 9440,
        "hadith_number": "1876",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Al-Quran dan Surah Al-Baqarah serta Ali Imran",
        "perawi_melayu": "An-Nawwas bin Sam'an رضی اللہ تعالیٰ عنہ berkata:",
        "english_text": "He heard the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say: On the Day of Resurrection the Qur'an and those who acted according to it will be brought with Surah al-Baqara and AI 'Imran preceding them. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) likened them to three things, which I did not forget afterwards. He (the Holy Prophet) likened them to two clouds, or two black canopies with light between them, or like two flocks of birds in ranks pleading for one who recited them.",
        "malay_translation": "Beliau mendengar Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Pada Hari Kiamat, Al-Quran dan mereka yang beramal dengannya akan dibawa, dengan Surah Al-Baqarah dan Ali Imran mendahului mereka. Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) mengumpamakan keduanya dengan tiga perkara, yang tidak saya lupakan selepas itu. Baginda (Nabi Suci) mengumpamakan keduanya seperti dua awan, atau dua kanopi hitam dengan cahaya di antara keduanya, atau seperti dua kelompok burung yang berbaris memohon syafaat bagi orang yang membacanya.",
        "arabic_text": "حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا يَزِيدُ بْنُ عَبْدِ رَبِّهِ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ مُحَمَّدِ بْنِ مُهَاجِرٍ عَنْ الْوَلِيدِ بْنِ عَبْدِ الرَّحْمَنِ الْجُرَشِيِّ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ قَالَ سَمِعْتُ النَّوَّاسَ بْنَ سَمْعَانَ الْكِلَابِيَّ يَقُولُ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يُؤْتَى بِالْقُرْآنِ يَوْمَ الْقِيَامَةِ وَأَهْلِهِ الَّذِينَ كَانُوا يَعْمَلُونَ بِهِ تَقْدُمُهُ سُورَةُ الْبَقَرَةِ وَآلُ عِمْرَانَ وَضَرَبَ لَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَةَ أَمْثَالٍ مَا نَسِيتُهُنَّ بَعْدُ قَالَ كَأَنَّهُمَا غَمَامَتَانِ أَوْ ظُلَّتَانِ سَوْدَاوَانِ بَيْنَهُمَا شَرْقٌ أَوْ كَأَنَّهُمَا حِزْقَانِ مِنْ طَيْرٍ صَوَافَّ تُحَاجَّانِ عَنْ صَاحِبِهِمَا."
      },
      {
        "id": 9441,
        "hadith_number": "1877",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pembukaan Pintu di Langit dan Kelebihan Dua Cahaya",
        "perawi_melayu": "Daripada Ibn 'Abbas RA meriwayatkan:",
        "english_text": "While Gabriel was sitting with the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) he heard a creaking sound above him. He lifted his head and said: This is a gate opened in heaven today which had never been opened before. Then when an angel descended through it, he said: This is an angel who came down to the earth who had never come down before. He greeted and said: Rejoice in two lights given to you which have not been given to any prophet before you: Fatihat al-Kitab and the concluding verses of Surah al-Baqara. You will never recite a letter from them for which you will not be given (a reward).",
        "malay_translation": "Ketika Jibril sedang duduk bersama Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم), beliau mendengar bunyi berkeriut di atasnya. Jibril mengangkat kepalanya dan berkata: Ini adalah pintu yang dibuka di langit pada hari ini yang belum pernah dibuka sebelum ini. Kemudian ketika seorang malaikat turun melaluinya, Jibril berkata: Ini adalah malaikat yang turun ke bumi yang belum pernah turun sebelum ini. Malaikat itu memberi salam dan berkata: Bergembiralah dengan dua cahaya yang diberikan kepadamu yang belum pernah diberikan kepada nabi sebelummu: Fatihat al-Kitab dan ayat-ayat terakhir Surah al-Baqarah. Engkau tidak akan membaca satu huruf pun daripadanya kecuali engkau akan diberikan (ganjaran).",
        "arabic_text": "حَدَّثَنَا حَسَنُ بْنُ الرَّبِيعِ وَأَحْمَدُ بْنُ جَوَّاسٍ الْحَنْفِيُّ قَالَا حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ عَمَّارِ بْنِ رُزَيْقٍ عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ بَيْنَمَا جِبْرِيلُ قَاعِدٌ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعَ نَقِيضًا مِنْ فَوْقِهِ فَرَفَعَ رَأْسَهُ فَقَالَ هَذَا بَابٌ مِنْ السَّمَاءِ فُتِحَ الْيَوْمَ لَمْ يُفْتَحْ قَطُّ إِلَّا الْيَوْمَ فَنَزَلَ مِنْهُ مَلَكٌ فَقَالَ هَذَا مَلَكٌ نَزَلَ إِلَى الْأَرْضِ لَمْ يَنْزِلْ قَطُّ إِلَّا الْيَوْمَ فَسَلَّمَ وَقَالَ أَبْشِرْ بِنُورَيْنِ أُوتِيتَهُمَا لَمْ يُؤْتَهُمَا نَبِيٌّ قَبْلَكَ فَاتِحَةُ الْكِتَابِ وَخَوَاتِيمُ سُورَةِ الْبَقَرَةِ لَنْ تَقْرَأَ بِحَرْفٍ مِنْهُمَا إِلَّا أُعْطِيتَهُ."
      },
      {
        "id": 9442,
        "hadith_number": "1878",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Dua Ayat Terakhir Surah al-Baqarah",
        "perawi_melayu": "Abdul-Rahman bin Yazid meriwayatkan:",
        "english_text": "I met Abu Mas'ud رضی اللہ تعالیٰ عنہ near the House (Ka'ba) and said to him: A hadith has been conveyed to me on your authority about the two (concluding verses of Surah al-Baqara. He said: Yes. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) (in fact) said: Anyone who recites the two verses at the end of Surah al-Baqara at night, they would suffice for him.",
        "malay_translation": "Saya bertemu Abu Mas'ud رضی اللہ تعالیٰ عنہ berdekatan dengan Baitullah (Kaabah) dan berkata kepadanya: Sebuah hadis telah disampaikan kepada saya daripada anda tentang dua (ayat terakhir Surah al-Baqarah). Beliau berkata: Ya. Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) (sebenarnya) bersabda: Sesiapa yang membaca dua ayat terakhir Surah al-Baqarah pada waktu malam, kedua-duanya akan mencukupinya.",
        "arabic_text": "و حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا مَنْصُورٌ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ قَالَ لَقِيتُ أَبَا مَسْعُودٍ عِنْدَ الْبَيْتِ فَقُلْتُ حَدِيثٌ بَلَغَنِي عَنْكَ فِي الْآيَتَيْنِ فِي سُورَةِ الْبَقَرَةِ فَقَالَ نَعَمْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْآيَتَانِ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ مَنْ قَرَأَهُمَا فِي لَيْلَةٍ كَفَتَاهُ."
      },
      {
        "id": 9443,
        "hadith_number": "1879",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Diriwayatkan dengan Sanad yang Sama",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "This hadith has been narrated by Mansur with the same chain of transmitters.",
        "malay_translation": "Hadis ini telah diriwayatkan oleh Mansur dengan sanad (rantai perawi) yang sama.",
        "arabic_text": "و حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ كِلَاهُمَا عَنْ مَنْصُورٍ بِهَذَا الْإِسْنَادِ."
      },
      {
        "id": 9444,
        "hadith_number": "1880",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Dua Ayat Terakhir Surah Al-Baqarah",
        "perawi_melayu": "Abu Mas'ud رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: If anyone recites the two verses at the end of Surah al-Baqara at night, they would suffice for him 'Abdul-Rahman رضی اللہ تعالیٰ عنہ said: I met Abu Mas'ud رضی اللہ تعالیٰ عنہ and he was circumambulating the House (of Allah) and asked him about this (tradition) and he narrated it to me from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Jika seseorang membaca dua ayat terakhir Surah al-Baqarah pada malam hari, kedua ayat itu akan mencukupinya.' Abdul-Rahman رضی اللہ تعالیٰ عنہ berkata: Saya bertemu Abu Mas'ud رضی اللہ تعالیٰ عنہ dan beliau sedang tawaf di Baitullah lalu saya bertanya kepadanya tentang hadis ini dan beliau meriwayatkannya kepada saya dari Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
        "arabic_text": "و حَدَّثَنَا مِنْجَابُ بْنُ الْحَارِثِ التَّمِيمِيُّ أَخْبَرَنَا ابْنُ مُسْهِرٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ عَلْقَمَةَ بْنِ قَيْسٍ عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَرَأَ هَاتَيْنِ الْآيَتَيْنِ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ فِي لَيْلَةٍ كَفَتَاهُ قَالَ عَبْدُ الرَّحْمَنِ فَلَقِيتُ أَبَا مَسْعُودٍ وَهُوَ يَطُوفُ بِالْبَيْتِ فَسَأَلْتُهُ فَحَدَّثَنِي بِهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 9445,
        "hadith_number": "1881",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis dari Abu Mas'ud melalui Sanad Lain",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "A hadith like this has been narrated by Abu Mas'ud from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) through another chain of transmitters.",
        "malay_translation": "Hadis seperti ini telah diriwayatkan oleh Abu Mas'ud daripada Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) melalui sanad periwayatan yang lain.",
        "arabic_text": "و حَدَّثَنِي عَلِيُّ بْنُ خَشْرَمٍ أَخْبَرَنَا عِيسَى يَعْنِي ابْنَ يُونُسَ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ جَمِيعًا عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ وَعَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ أَبِي مَسْعُودٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ."
      },
      {
        "id": 9446,
        "hadith_number": "1882",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis daripada Abu Mas'ud melalui Rantaian Sanad Lain",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "It is through another chain of transmitters that this hadith has been reported by Abu Mas'ud from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
        "malay_translation": "Hadis ini diriwayatkan melalui sanad lain oleh Abu Mas'ud daripada Rasulullah ﷺ.",
        "arabic_text": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَفْصٌ وَأَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ أَبِي مَسْعُودٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ."
      },
      {
        "id": 9447,
        "hadith_number": "1883",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Menghafal Sepuluh Ayat Pertama Surah Al-Kahf",
        "perawi_melayu": "Diriwayatkan oleh Abu Darda' رضی اللہ تعالیٰ عنہ:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: If anyone learns by heart the first ten verses of the Surah al-Kahf, he will be protected from the Dajjal.",
        "malay_translation": "Rasulullah ﷺ bersabda: Sesiapa yang menghafal sepuluh ayat pertama dari Surah al-Kahf, dia akan dilindungi dari Dajjal.",
        "arabic_text": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ الْغَطَفَانِيِّ عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ الْيَعْمَرِيِّ عَنْ أَبِي الدَّرْدَاءِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ حَفِظَ عَشْرَ آيَاتٍ مِنْ أَوَّلِ سُورَةِ الْكَهْف عُصِمَ مِنْ الدَّجَّالِ."
      },
      {
        "id": 9448,
        "hadith_number": "1884",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perbahasan Mengenai Permulaan Surah al-Kahf",
        "perawi_melayu": "Hadis ini telah diriwayatkan oleh Qatada dengan sanad yang sama. Tetapi Shu'ba (salah seorang perawi) berkata:",
        "english_text": "At the end of Surah al-Kahf, but Hammam said: At the beginning of Surah al-Kahf.",
        "malay_translation": "Pada akhir Surah al-Kahf, tetapi Hammam berkata: Pada permulaan Surah al-Kahf.",
        "arabic_text": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ ح و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا هَمَّامٌ جَمِيعًا عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ قَالَ شُعْبَةُ مِنْ آخِرِ الْكَهْفِ و قَالَ هَمَّامٌ مِنْ أَوَّلِ الْكَهْف كَمَا قَالَ هِشَامٌ.["
      },
      {
        "id": 9449,
        "hadith_number": "1885",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ayat Teragung dalam Al-Quran",
        "perawi_melayu": "Ubayy bin Ka'b رضي الله تعالى عنه berkata:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: O Abu'al-Mundhir, do you know the verse from the Book of Allah which, according to you, is the greatest? I said: Allah and His Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) know best. He again said: Abu'l-Mundhir, do you know the verse from the Book of Allah which, according to you, is the greatest? I said: Allah, there is no god but He, the Living, the Eternal. Thereupon he struck me on my breast and said: May knowledge be pleasant for you, O Abu'l-Mundhir!",
        "malay_translation": "Rasulullah ﷺ bersabda: “Wahai Abu'al-Mundhir, adakah kamu tahu ayat dari Kitab Allah yang, menurutmu, adalah yang paling agung?” Aku menjawab: “Allah dan Rasul-Nya ﷺ lebih mengetahui.” Baginda bersabda lagi: “Wahai Abu'al-Mundhir, adakah kamu tahu ayat dari Kitab Allah yang, menurutmu, adalah yang paling agung?” Aku menjawab: “Allah, tiada Tuhan melainkan Dia, Yang Maha Hidup, Yang Maha Kekal.” Maka baginda menepuk dadaku dan bersabda: “Semoga ilmu bermanfaat bagimu, wahai Abu'al-Mundhir!”",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ عَبْدِ الْأَعْلَى عَنْ الْجُرَيْرِيِّ عَنْ أَبِي السَّلِيلِ عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ الْأَنْصَارِيِّ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَ قَالَ رَسُولُ اللَّهِ يَا أَبَا الْمُنْذِرِ أَتَدْرِي أَيُّ آيَةٍ مِنْ كِتَابِ اللَّهِ مَعَكَ أَعْظَمُ قَالَ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ يَا أَبَا الْمُنْذِرِ أَتَدْرِي أَيُّ آيَةٍ مِنْ كِتَابِ اللَّهِ مَعَكَ أَعْظَمُ قَالَ قُلْتُ اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ قَالَ فَضَرَبَ فِي صَدْرِي وَقَالَ وَاللَّهِ لِيَهْنِكَ الْعِلْمُ أَبَا الْمُنْذِرِ."
      },
      {
        "id": 9450,
        "hadith_number": "1886",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Membaca Surah Al-Ikhlas yang Menyamai Sepertiga Al-Quran",
        "perawi_melayu": "Abu Darda' رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Is any one of you incapable of reciting a third of the Qur'an in a night? They (the Companions) asked: How could one recite a third of the Qur'an (in a night)? Upon this he (the Holy Prophet) said: 'Say: He is Allah, One' (Qur'an. cxii) is equivalent to a third of the Qur'an.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Adakah sesiapa di antara kamu yang tidak mampu membaca sepertiga Al-Quran dalam satu malam? Mereka (para Sahabat) bertanya: Bagaimana seseorang boleh membaca sepertiga Al-Quran (dalam satu malam)? Kemudian baginda (Nabi Suci) bersabda: 'Katakanlah: Dialah Allah, Yang Maha Esa' (Surah Al-Ikhlas 112) adalah bersamaan dengan sepertiga Al-Quran.",
        "arabic_text": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَ زُهَيْرٌ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ عَنْ أَبِي الدَّرْدَاءِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيَعْجِزُ أَحَدُكُمْ أَنْ يَقْرَأَ فِي لَيْلَةٍ ثُلُثَ الْقُرْآنِ قَالُوا وَكَيْفَ يَقْرَأْ ثُلُثَ الْقُرْآنِ قَالَ قُلْ هُوَ اللَّهُ أَحَدٌ تَعْدِلُ ثُلُثَ الْقُرْآنِ."
      },
      {
        "id": 9451,
        "hadith_number": "1887",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pembahagian Al-Quran kepada Tiga Bahagian dan Surah Al-Ikhlas Sebagai Satu Pertiga",
        "perawi_melayu": "Hadis ini diriwayatkan oleh Qatada dengan sanad yang sama dengan perawi-perawi ini dalam lafaz ini:",
        "english_text": "He (the Messenger of Allah) said: Allah divided the Qur'an into three parts, and he made: Say: He, Allah is One. one part out of the (three) parts of the Qur'an.",
        "malay_translation": "Baginda (Rasulullah SAW) bersabda: Allah membahagikan Al-Quran kepada tiga bahagian, dan Dia menjadikan: Katakanlah: Dialah Allah, Yang Maha Esa. satu bahagian daripada (tiga) bahagian Al-Quran.",
        "arabic_text": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَفَّانُ حَدَّثَنَا أَبَانُ الْعَطَّارُ جَمِيعًا عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ وَفِي حَدِيثِهِمَا مِنْ قَوْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ جَزَّأَ الْقُرْآنَ ثَلَاثَةَ أَجْزَاءٍ فَجَعَلَ قُلْ هُوَ اللَّهُ أَحَدٌ جُزْءًا مِنْ أَجْزَاءِ الْقُرْآنِ."
      },
      {
        "id": 9452,
        "hadith_number": "1888",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Surah Al-Ikhlas Menyamai Sepertiga Al-Quran",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah رضی اللہ تعالیٰ عنہ :",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Get together. for I am going to recite one-third of the Qur'an before you. And those who could get together gathered there. Then the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came out and recited: Say: He, Allah, is One. He then entered (his house). Some of us said to the others: Perhaps there has been some news from the heaven on account of which he has gone Inside (the house). The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) again came out and said: I told you that I was going to recite one-third of the Qur'in; keep in mind, this (Surah Ikhlas) is equivalent to one-third of the Qur'an.",
        "malay_translation": "Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: 'Berkumpullah, kerana aku akan membacakan kepada kamu sepertiga Al-Quran sebelum kamu.' Maka orang-orang yang dapat berkumpul pun berkumpul di sana. Kemudian Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) keluar dan membaca: 'Katakanlah (Muhammad), Dialah Allah, Yang Maha Esa.' Kemudian baginda masuk (ke rumahnya). Sebahagian kami berkata kepada yang lain: 'Mungkin ada wahyu dari langit yang menyebabkan baginda masuk (ke rumah).' Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) kemudian keluar lagi dan bersabda: 'Aku telah memberitahu kamu bahawa aku akan membaca sepertiga Al-Quran; ingatlah, surah ini (Surah Al-Ikhlas) menyamai sepertiga Al-Quran.'",
        "arabic_text": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ يَحْيَى قَالَ ابْنُ حَاتِمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا يَزِيدُ بْنُ كَيْسَانَ حَدَّثَنَا أَبُو حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْشُدُوا فَإِنِّي سَأَقْرَأُ عَلَيْكُمْ ثُلُثَ الْقُرْآنِ فَحَشَدَ مَنْ حَشَدَ ثُمَّ خَرَجَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَرَأَ قُلْ هُوَ اللَّهُ أَحَدٌ ثُمَّ دَخَلَ فَقَالَ بَعْضُنَا لِبَعْضٍ إِنِّي أُرَى هَذَا خَبَرٌ جَاءَهُ مِنْ السَّمَاءِ فَذَاكَ الَّذِي أَدْخَلَهُ ثُمَّ خَرَجَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنِّي قُلْتُ لَكُمْ سَأَقْرَأُ عَلَيْكُمْ ثُلُثَ الْقُرْآنِ أَلَا إِنَّهَا تَعْدِلُ ثُلُثَ الْقُرْآنِ."
      },
      {
        "id": 9453,
        "hadith_number": "1889",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Surah Al-Ikhlas Sebagai Sepertiga Al-Quran",
        "perawi_melayu": "Abu Hurairah رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came out to us and said: I am going to recite before you one-third of the Qur'an. He (the Holy Prophet) then recited: Say: He is Allah, One--Allah, the Eternal, to the end of the Surah.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) keluar kepada kami dan bersabda: 'Aku akan membacakan kepada kamu sepertiga Al-Qur'an.' Kemudian Baginda (Nabi Suci) membaca: 'Katakanlah (Muhammad): Dia-lah Allah, Yang Maha Esa. Allah adalah tempat bergantung segala sesuatu,' hingga akhir surah.",
        "arabic_text": "و حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى حَدَّثَنَا ابْنُ فُضَيْلٍ عَنْ بَشِيرٍ أَبِي إِسْمَعِيلَ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَ خَرَجَ إِلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَقْرَأُ عَلَيْكُمْ ثُلُثَ الْقُرْآنِ فَقَرَأَ قُلْ هُوَ اللَّهُ أَحَدٌ اللَّهُ الصَّمَدُ حَتَّى خَتَمَهَا."
      },
      {
        "id": 9454,
        "hadith_number": "1890",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Surah Al-Ikhlas dan Kecintaan Allah kepada Pembacanya",
        "perawi_melayu": "Daripada Aisyah رضی اللہ تعالیٰ عنہا meriwayatkan:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) sent a man in charge of an expedition and he would recite for his Companions during their prayer, ending (recitation) with: Say, He is God, One. When they returned mention was made of it to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). He (the Holy Prophet) told them to ask him why he had done like that. So they asked him and he said: Verily, it is an attribute of the Compassionate One, and (for this reason) I love to recite it. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) thereupon said: Inform him that Allah loves him.",
        "malay_translation": "Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم) telah mengutus seorang lelaki sebagai ketua ekspedisi dan dia selalu membaca (surah) untuk para sahabatnya semasa solat mereka, mengakhiri (bacaan) dengan: Katakanlah (Muhammad), Dialah Allah, Yang Maha Esa. Apabila mereka kembali, perkara itu disebutkan kepada Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم). Baginda (Nabi Muhammad) menyuruh mereka bertanya kepadanya mengapa dia melakukan sedemikian. Maka mereka bertanya kepadanya dan dia berkata: Sesungguhnya, ia adalah sifat Ar-Rahman (Yang Maha Pemurah), dan (kerana alasan ini) saya suka membacanya. Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم) kemudian bersabda: Beritahu dia bahawa Allah mencintainya.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ وَهْبٍ حَدَّثَنَا عَمِّي عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنَا عَمْرُو بْنُ الْحَارِثِ عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ أَنَّ أَبَا الرِّجَالِ مُحَمَّدَ بْنَ عَبْدِ الرَّحْمَنِ حَدَّثَهُ عَنْ أُمِّهِ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ وَكَانَتْ فِي حَجْرِ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ رَجُلًا عَلَى سَرِيَّةٍ وَكَانَ يَقْرَأُ لِأَصْحَابِهِ فِي صَلَاتِهِمْ فَيَخْتِمُ بِقُلْ هُوَ اللَّهُ أَحَدٌ فَلَمَّا رَجَعُوا ذُكِرَ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ سَلُوهُ لِأَيِّ شَيْءٍ يَصْنَعُ ذَلِكَ فَسَأَلُوهُ فَقَالَ لِأَنَّهَا صِفَةُ الرَّحْمَنِ فَأَنَا أُحِبُّ أَنْ أَقْرَأَ بِهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبِرُوهُ أَنَّ اللَّهَ يُحِبُّهُ"
      },
      {
        "id": 9455,
        "hadith_number": "1891",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kehebatan Ayat-Ayat yang Diturunkan",
        "perawi_melayu": "Diriwayatkan daripada Uqba bin 'Amir رضی اللہ تعالیٰ عنہ:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: What wonderful verses have been sent down today. the like of which has never been seen! They are: Say: I seek refuge with the Lord of the dawn, and Say: I seek refuge with the Lord of men.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Ayat-ayat yang sungguh menakjubkan telah diturunkan pada hari ini, yang seumpamanya belum pernah dilihat! Ayat-ayat itu adalah: Katakanlah: Aku berlindung kepada Tuhan Pemilik subuh, dan Katakanlah: Aku berlindung kepada Tuhan Pemilik manusia.",
        "arabic_text": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا جَرِيرٌ عَنْ بَيَانٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَمْ تَرَ آيَاتٍ أُنْزِلَتْ اللَّيْلَةَ لَمْ يُرَ مِثْلُهُنَّ قَطُّ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ وَقُلْ أَعُوذُ بِرَبِّ النَّاسِ."
      },
      {
        "id": 9456,
        "hadith_number": "1892",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Penerimaan Wahyu Mu'awwidhatain",
        "perawi_melayu": "Uqba bin 'Amir رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to me: There have been sent down to me verses the like of which had never been seen before. They are the Mu'awwadhatain.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda kepadaku: Ayat-ayat telah diturunkan kepadaku yang seumpamanya belum pernah dilihat sebelumnya. Ayat-ayat itu adalah Mu'awwidhatain.",
        "arabic_text": "و حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا إِسْمَعِيلُ عَنْ قَيْسٍ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُنْزِلَ أَوْ أُنْزِلَتْ عَلَيَّ آيَاتٌ لَمْ يُرَ مِثْلُهُنَّ قَطُّ الْمُعَوِّذَتَيْنِ."
      },
      {
        "id": 9457,
        "hadith_number": "1893",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Riwayat daripada Uqbah bin Amr Al Juhani secara Langsung daripada Nabi Muhammad SAW",
        "perawi_melayu": "Laporan yang serupa (seperti no.1892) diriwayatkan daripada Ismail dengan sanad ini. Dalam laporan Abu Usamah dinyatakan:",
        "english_text": "\"It was narrated from Uqbah bin Amr Al Juhani رضی اللہ تعالیٰ عنہ who was one of those who narrated directly from Muhammad ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
        "malay_translation": "Diriwayatkan daripada Uqbah bin Amr Al Juhani رضی اللہ تعالیٰ عنہ, salah seorang daripada mereka yang meriwayatkan secara langsung daripada Muhammad (صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
        "arabic_text": "و حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا أَبُو أُسَامَةَ كِلَاهُمَا عَنْ إِسْمَعِيلَ بِهَذَا الْإِسْنَادِ مِثْلَهُ وَفِي رِوَايَةِ أَبِي أُسَامَةَ عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ وَكَانَ مِنْ رُفَعَاءِ أَصْحَابِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 9458,
        "hadith_number": "1894",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keharusan Hasad dalam Dua Perkara: Ilmu Al-Quran dan Membelanjakan Harta",
        "perawi_melayu": "Salim meriwayatkan daripada ayahnya (Ibn 'Umar رضی اللہ تعالیٰ عنہ ) bahawa Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) bersabda:",
        "english_text": "Envy is not justified but in case of two persons only: one who, having been given (knowledge of) the Qur'an by Allah, recites it during the night and day (and also acts upon it) and a man who, having been given wealth by God, spends it during the night and the day (for the welfare of others. seeking the pleasure of the Lord).",
        "malay_translation": "Tidak dibenarkan hasad kecuali dalam dua perkara sahaja: seseorang yang diberikan (ilmu) Al-Quran oleh Allah, lalu dia membacanya pada waktu malam dan siang (dan juga mengamalkannya), dan seorang lelaki yang diberikan kekayaan oleh Allah, lalu dia membelanjakannya pada waktu malam dan siang (untuk kebajikan orang lain, mencari keredhaan Tuhan).",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ كُلُّهُمْ عَنْ ابْنِ عُيَيْنَةَ قَالَ زُهَيْرٌ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ حَدَّثَنَا الزُّهْرِيُّ عَنْ سَالِمٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا حَسَدَ إِلَّا فِي اثْنَتَيْنِ رَجُلٌ آتَاهُ اللَّهُ الْقُرْآنَ فَهُوَ يَقُومُ بِهِ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ وَرَجُلٌ آتَاهُ اللَّهُ مَالًا فَهُوَ يُنْفِقُهُ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ."
      },
      {
        "id": 9459,
        "hadith_number": "1895",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Ghirah pada Pembaca Al-Quran dan Pemberi Sedekah",
        "perawi_melayu": "Salim bin Abdullah bin 'Umar رضی اللہ تعالیٰ عنہ meriwayatkan daripada ayahnya:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observed: Envy is not justified but in case of two persons only: one who, having been given (knowledge of) the Qur'an by Allah, recites it during the night and during the day (and acts upon it), and the person who, having been given wealth by God, gives it in charity during the night and the day.",
        "malay_translation": "Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Tidak boleh dengki kecuali dalam dua perkara: (Pertama) seorang yang Allah berikan kepadanya (ilmu tentang) Al-Quran, lalu dia membacanya siang dan malam (dan mengamalkannya), dan (kedua) seorang yang Allah berikan kepadanya harta, lalu dia menafkahkannya siang dan malam.",
        "arabic_text": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا حَسَدَ إِلَّا عَلَى اثْنَتَيْنِ رَجُلٌ آتَاهُ اللَّهُ هَذَا الْكِتَابَ فَقَامَ بِهِ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ وَرَجُلٌ آتَاهُ اللَّهُ مَالًا فَتَصَدَّقَ بِهِ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ."
      },
      {
        "id": 9460,
        "hadith_number": "1896",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keharusan Hasad pada Harta dan Hikmah",
        "perawi_melayu": "Diriwayatkan oleh Abdullah bin Mas'ud:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: There should be no envy but only in case of two persons: one having been endowed with wealth and power to spend it in the cause of Truth, and (the other) who has been endowed with wisdom and he decides cases with the help of it and teaches it (to others).",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Tidak boleh ada hasad kecuali dalam dua perkara: (pertama) seseorang yang dianugerahkan kekayaan dan kemampuan untuk membelanjakannya di jalan kebenaran, dan (kedua) seseorang yang dianugerahkan kebijaksanaan dan dia memutuskan perkara dengannya serta mengajarkannya (kepada orang lain).",
        "arabic_text": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ إِسْمَعِيلَ عَنْ قَيْسٍ قَالَ قَالَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي وَمُحَمَّدُ بْنُ بِشْرٍ قَالَا حَدَّثَنَا إِسْمَعِيلُ عَنْ قَيْسٍ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا حَسَدَ إِلَّا فِي اثْنَتَيْنِ رَجُلٌ آتَاهُ اللَّهُ مَالًا فَسَلَّطَهُ عَلَى هَلَكَتِهِ فِي الْحَقِّ وَرَجُلٌ آتَاهُ اللَّهُ حِكْمَةً فَهُوَ يَقْضِي بِهَا وَيُعَلِّمُهَا."
      },
      {
        "id": 9461,
        "hadith_number": "1897",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Ilmu Al-Quran dan Syariah dalam Kepimpinan",
        "perawi_melayu": "Amir bin Wathila meriwayatkan:",
        "english_text": "Nafi' bin 'Abdul-Harith met 'Umar رضی اللہ تعالیٰ عنہ at 'Usfan and 'Umar had employed him as collector in Mecca. He (Hadrat 'Umar) said to him (Nafi'): Whom have you appointed as collector over the people of the valley? He said: Ibn Abza. He said: Who is Ibn Abza? He said: He is one of our freed slaves. He (Hadrat 'Umar رضی اللہ تعالیٰ عنہ ) said: So you have appointed a freed slave over them. He said: He is well versed In the Book of Allah. the Exalted and Great, and he is well versed In the commandments and injunctions (of the Shari'ah). 'Umar رضی اللہ تعالیٰ عنہ said: So the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: By this Book, Allah would exalt some peoples and degrade others.",
        "malay_translation": "Nafi' bin 'Abdul-Harith bertemu 'Umar رضی اللہ تعالیٰ عنہ di 'Usfan dan 'Umar telah mengambilnya bekerja sebagai pemungut cukai di Mekah. Dia ('Umar) berkata kepadanya (Nafi'): Siapa yang kamu lantik sebagai pemungut cukai ke atas penduduk lembah? Dia berkata: Ibn Abza. Dia berkata: Siapa Ibn Abza? Dia berkata: Dia adalah salah seorang bekas hamba kami yang dimerdekakan. Dia ('Umar رضی اللہ تعالیٰ عنہ ) berkata: Jadi kamu telah melantik seorang bekas hamba ke atas mereka. Dia berkata: Dia sangat arif dalam Kitab Allah, Yang Maha Tinggi dan Maha Agung, dan dia sangat arif dalam perintah dan larangan (Syariah). 'Umar رضی اللہ تعالیٰ عنہ berkata: Maka Nabi ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) bersabda: Dengan kitab ini, Allah akan meninggikan martabat sesetengah kaum dan merendahkan yang lain.",
        "arabic_text": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنِي أَبِي عَنْ ابْنِ شِهَابٍ عَنْ عَامِرِ بْنِ وَاثِلَةَ أَنَّ نَافِعَ بْنَ عَبْدِ الْحَارِثِ لَقِيَ عُمَرَ بِعُسْفَانَ وَكَانَ عُمَرُ يَسْتَعْمِلُهُ عَلَى مَكَّةَ فَقَالَ مَنْ اسْتَعْمَلْتَ عَلَى أَهْلِ الْوَادِي فَقَالَ ابْنَ أَبْزَى قَالَ وَمَنْ ابْنُ أَبْزَى قَالَ مَوْلًى مِنْ مَوَالِينَا قَالَ فَاسْتَخْلَفْتَ عَلَيْهِمْ مَوْلًى قَالَ إِنَّهُ قَارِئٌ لِكِتَابِ اللَّهِ عَزَّ وَجَلَّ وَإِنَّهُ عَالِمٌ بِالْفَرَائِضِ قَالَ عُمَرُ أَمَا إِنَّ نَبِيَّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ قَالَ إِنَّ اللَّهَ يَرْفَعُ بِهَذَا الْكِتَابِ أَقْوَامًا وَيَضَعُ بِهِ آخَرِينَ."
      },
      {
        "id": 9462,
        "hadith_number": "1898",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Serupa dengan Hadis Ibrahim bin Sad daripada Az-Zuhri",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Amr bin Wathila Al Laith narrated that Nafi bin Abdul Harith Al Khuzai met Umar bin Al Khattab رضی اللہ تعالیٰ عنہ in Usfan..\" a hadith similar to that of Ibrahim bin Sad from Az-Zuhri (no. 1897).",
        "malay_translation": "Amr bin Wathila Al Laith meriwayatkan bahawa Nafi bin Abdul Harith Al Khuzai bertemu Umar bin Al Khattab رضی اللہ تعالیٰ عنہ di Usfan..\" sebuah hadis yang serupa dengan hadis Ibrahim bin Sad daripada Az-Zuhri (no. 1897).",
        "arabic_text": "و حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ وَأَبُو بَكْرِ بْنُ إِسْحَقَ قَالَا أَخْبَرَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ حَدَّثَنِي عَامِرُ بْنُ وَاثِلَةَ اللَّيْثِيُّ أَنَّ نَافِعَ بْنَ عَبْدِ الْحَارِثِ الْخُزَاعِيَّ لَقِيَ عُمَرَ بْنَ الْخَطَّابِ بِعُسْفَانَ بِمِثْلِ حَدِيثِ إِبْرَاهِيمَ بْنِ سَعْدٍ عَنْ الزُّهْرِيِّ."
      },
      {
        "id": 9463,
        "hadith_number": "1899",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Al-Quran Diturunkan dalam Tujuh Dialek",
        "perawi_melayu": "Umar bin Khattab رضی اللہ تعالیٰ عنہ berkata:",
        "english_text": "I heard Hisham bin Hakim bin Hizam reciting Surah al-Furqan in a style different from that in which I used to recite it, and in which Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had taught me to recite it. I was about to dispute with him (on this style) but I delayed till he had finished that (the recitation). Then I caught hold of his cloak and brought him to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Messenger of Allah, I heard this man reciting Surah al-Furqan in a style different from the one in which you taught me to recite. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) told (me) to leave him alone and asked him to recite. He then recited in the style in which I beard him recite it. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) then said: Thus was it sent down. He then told me to recite and I recited it, and he said: Thus was it sent down. The Qur'an was sent down in seven dialects. So recite what seems easy therefrom.",
        "malay_translation": "Aku mendengar Hisyam bin Hakim bin Hizam membaca Surah al-Furqan dengan gaya yang berbeza dari gaya yang biasa aku baca, dan gaya yang Rasulullah (صلی اللہ علیہ وسلم) telah ajarkan kepadaku untuk membacanya. Aku hampir sahaja bertengkar dengannya (mengenai gaya ini) tetapi aku menangguhkannya sehingga dia selesai (membaca). Kemudian aku memegang jubahnya dan membawanya kepada Rasulullah (صلی اللہ علیہ وسلم) dan berkata: Wahai Rasulullah, aku mendengar lelaki ini membaca Surah al-Furqan dengan gaya yang berbeza daripada gaya yang engkau ajarkan kepadaku untuk membacanya. Atas hal ini, Rasulullah (صلی اللہ علیہ وسلم) menyuruh (aku) untuk membiarkannya dan meminta dia membaca. Dia kemudian membaca dengan gaya yang aku dengar dia membacanya. Rasulullah (صلی اللہ علیہ وسلم) kemudian bersabda: Demikianlah ia diturunkan. Kemudian baginda menyuruhku membaca dan aku membacanya, dan baginda bersabda: Demikianlah ia diturunkan. Al-Quran diturunkan dalam tujuh dialek. Maka bacalah apa yang mudah daripadanya.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدٍ الْقَارِيِّ قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ يَقُولُ سَمِعْتُ هِشَامَ بْنَ حَكِيمِ بْنِ حِزَامٍ يَقْرَأُ سُورَةَ الْفُرْقَانِ عَلَى غَيْرِ مَا أَقْرَؤُهَا وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْرَأَنِيهَا فَكِدْتُ أَنْ أَعْجَلَ عَلَيْهِ ثُمَّ أَمْهَلْتُهُ حَتَّى انْصَرَفَ ثُمَّ لَبَّبْتُهُ بِرِدَائِهِ فَجِئْتُ بِهِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي سَمِعْتُ هَذَا يَقْرَأُ سُورَةَ الْفُرْقَانِ عَلَى غَيْرِ مَا أَقْرَأْتَنِيهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْسِلْهُ اقْرَأْ فَقَرَأَ الْقِرَاءَةَ الَّتِي سَمِعْتُهُ يَقْرَأُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَكَذَا أُنْزِلَتْ ثُمَّ قَالَ لِي اقْرَأْ فَقَرَأْتُ فَقَالَ هَكَذَا أُنْزِلَتْ إِنَّ هَذَا الْقُرْآنَ أُنْزِلَ عَلَى سَبْعَةِ أَحْرُفٍ فَاقْرَءُوا مَا تَيَسَّرَ مِنْهُ."
      },
      {
        "id": 9464,
        "hadith_number": "1900",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Umar RA Mendengar Hisham bin Hakim Membaca Surah al-Furqan",
        "perawi_melayu": "Hadis ini telah diriwayatkan oleh 'Umar bin Khattab رضی اللہ تعالیٰ عنہ (dengan sedikit perubahan perkataan):",
        "english_text": "I heard Hisham bin Hakim reciting Surah al-Furqan during the lifetime of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). The rest is the same but with this addition: I was about to catch hold of him in prayer, but I exercised patience till he pronounced salutation.",
        "malay_translation": "Saya mendengar Hisham bin Hakim membaca Surah al-Furqan semasa hayat Rasulullah (ﷺ). Selebihnya adalah sama tetapi dengan tambahan ini: Saya hampir menangkapnya ketika solat, tetapi saya bersabar sehingga dia mengucapkan salam.",
        "arabic_text": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ الْمِسْوَرَ بْنَ مَخَرَمَةَ وَعَبْدَ الرَّحْمَنِ بْنَ عَبْدٍ الْقَارِيَّ أَخْبَرَاهُ أَنَّهُمَا سَمِعَا عُمَرَ بْنَ الْخَطَّابِ يَقُولُ سَمِعْتُ هِشَامَ بْنَ حَكِيمٍ يَقْرَأُ سُورَةَ الْفُرْقَانِ فِي حَيَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَاقَ الْحَدِيثَ بِمِثْلِهِ وَزَادَ فَكِدْتُ أُسَاوِرُهُ فِي الصَّلَاةِ فَتَصَبَّرْتُ حَتَّى سَلَّمَ."
      },
      {
        "id": 9465,
        "hadith_number": "1901",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Laporan Serupa dengan Hadis Yunus dengan Sanad yang Sama",
        "perawi_melayu": "Tidak diketahui",
        "english_text": "A report Similar to that of Yunus (no. 1900) was narrated from Az-Zuhri with the same chain.",
        "malay_translation": "Laporan yang serupa dengan laporan Yunus (no. 1900) diriwayatkan daripada Az-Zuhri dengan sanad yang sama.",
        "arabic_text": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَبْدُ بْنُ حُمَيْدٍ قَالَا أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ كَرِوَايَةِ يُونُسَ بِإِسْنَادِهِ."
      },
      {
        "id": 9466,
        "hadith_number": "1902",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Tujuh Cara Bacaan Al-Quran yang Diajar oleh Jibril",
        "perawi_melayu": "Diriwayatkan daripada Ibn 'Abbas Radiyallahu Anhu:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Gabriel taught me to recite in one style. I replied to him and kept asking him to give more (styles), till he reached seven modes (of recitation). Ibn Shibab said: It has reached me that these seven styles are essentially one, not differing about what is permitted and what is forbidden.",
        "malay_translation": "Rasulullah (Sallallahu Alaihi Wasallam) bersabda: Jibril mengajarku membaca (Al-Quran) dalam satu gaya. Aku menjawab kepadanya dan terus memintanya untuk memberikan lebih banyak (gaya), sehingga dia mencapai tujuh bentuk (bacaan). Ibn Shibab berkata: Telah sampai kepadaku bahawa tujuh gaya ini pada dasarnya adalah satu, tidak berbeza mengenai apa yang dibenarkan dan apa yang dilarang.",
        "arabic_text": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ أَنَّ ابْنَ عَبَّاسٍ حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَقْرَأَنِي جِبْرِيلُ عَلَيْهِ السَّلَام عَلَى حَرْفٍ فَرَاجَعْتُهُ فَلَمْ أَزَلْ أَسْتَزِيدُهُ فَيَزِيدُنِي حَتَّى انْتَهَى إِلَى سَبْعَةِ أَحْرُفٍ قَالَ ابْنُ شِهَابٍ بَلَغَنِي أَنَّ تِلْكَ السَّبْعَةَ الْأَحْرُفَ إِنَّمَا هِيَ فِي الْأَمْرِ الَّذِي يَكُونُ وَاحِدًا لَا يَخْتَلِفُ فِي حَلَالٍ وَلَا حَرَامٍ."
      },
      {
        "id": 9467,
        "hadith_number": "1903",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Riwayat Hadith oleh Zuhri dengan Sanad yang Sama",
        "perawi_melayu": "Tidak diketahui",
        "english_text": "This hadith has been narrated by Zuhri with the same chain of transmitters.",
        "malay_translation": "Hadith ini telah diriwayatkan oleh Zuhri dengan sanad perawi yang sama.",
        "arabic_text": "و حَدَّثَنَاه عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ."
      },
      {
        "id": 9468,
        "hadith_number": "1904",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kebenaran Bacaan Al-Quran dalam Tujuh Dialek dan Permohonan Keampunan Nabi untuk Umatnya",
        "perawi_melayu": "Ubayy bin Ka'b رضی اللہ تعالیٰ عنہ melaporkan:",
        "english_text": "I was in the mosque when a man entered and prayed and recited (the Qur'in) in a style to which I objected. Then another man entered (the mosque) and recited in a style different from that of his companion. When we had finished the prayer, we all went to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said to him: This man recited in a style to which I objected, and the other entered and recited in a style different from that of his companion. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) asked them to recite and so they recited, and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) expressed approval of their affairs (their modes of recitation). and there occurred In my mind a sort of denial which did not occur even during the Days of Ignorance. When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) saw how I was affected (by a wrong idea), he struck my chest, whereupon I broke into sweating and felt as though I were looking at Allah with fear. He (the Holy Prophet) said to me: Ubayy. a message was sent to me to recite the Qur'an in one dialect, and I replied: Make (things) easy for my people. It was conveyed to me for the second time that it should be recited in two dialects. I again replied to him: Make affairs easy for my people. It was again conveyed to me for the third time to recite in seven dialects And (I was further told): You have got a seeking for every reply that I sent you, which you should seek from Me. I said: O Allah! forgive my people, forgive my people, and I have deferred the third one for the day on which the entire creation will turn to me, including even Ibrahim (peace be upon him) (for intercession).",
        "malay_translation": "Saya berada di masjid ketika seorang lelaki masuk dan solat serta membaca (Al-Quran) dengan gaya yang saya tidak setujui. Kemudian seorang lelaki lain masuk (masjid) dan membaca dengan gaya yang berbeza dari rakannya. Apabila kami selesai solat, kami semua pergi kepada Rasulullah (ﷺ) dan berkata kepadanya: Lelaki ini membaca dengan gaya yang saya tidak setujui, dan yang lain masuk dan membaca dengan gaya yang berbeza dari rakannya. Rasulullah (ﷺ) meminta mereka membaca dan mereka pun membaca, dan Rasulullah (ﷺ) menyatakan persetujuan terhadap urusan mereka (gaya bacaan mereka). Dan timbul dalam fikiran saya semacam penolakan yang tidak pernah terjadi bahkan pada Zaman Jahiliyah. Ketika Rasulullah (ﷺ) melihat betapa terpengaruhnya saya (oleh idea yang salah), baginda memukul dada saya, sehingga saya berpeluh dan merasa seolah-olah saya sedang melihat Allah dengan rasa takut. Baginda (Nabi Suci) berkata kepada saya: Wahai Ubayy, perutusan telah dihantar kepadaku untuk membaca Al-Quran dalam satu dialek, dan saya menjawab: Permudahkanlah (urusan) bagi umatku. Perutusan itu disampaikan kepada saya untuk kali kedua bahawa ia harus dibaca dalam dua dialek. Saya sekali lagi menjawab kepadanya: Permudahkanlah urusan bagi umatku. Perutusan itu sekali lagi disampaikan kepada saya untuk kali ketiga untuk membaca dalam tujuh dialek. Dan (saya diberitahu lagi): Kamu telah mendapat permohonan untuk setiap jawapan yang saya hantar kepadamu, yang patut kamu mohon daripada-Ku. Saya berkata: Ya Allah! ampunilah umatku, ampunilah umatku, dan saya telah menangguhkan yang ketiga untuk hari di mana seluruh makhluk akan berpaling kepada saya, termasuk juga Ibrahim (alaihi salam) (untuk syafaat).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ جَدِّهِ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَ كُنْتُ فِي الْمَسْجِدِ فَدَخَلَ رَجُلٌ يُصَلِّي فَقَرَأَ قِرَاءَةً أَنْكَرْتُهَا عَلَيْهِ ثُمَّ دَخَلَ آخَرُ فَقَرَأَ قِرَاءَةً سِوَى قَرَاءَةِ صَاحِبِهِ فَلَمَّا قَضَيْنَا الصَّلَاةَ دَخَلْنَا جَمِيعًا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ إِنَّ هَذَا قَرَأَ قِرَاءَةً أَنْكَرْتُهَا عَلَيْهِ وَدَخَلَ آخَرُ فَقَرَأَ سِوَى قِرَاءَةِ صَاحِبِهِ فَأَمَرَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَرَآ فَحَسَّنَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَأْنَهُمَا فَسَقَطَ فِي نَفْسِي مِنْ التَّكْذِيبِ وَلَا إِذْ كُنْتُ فِي الْجَاهِلِيَّةِ فَلَمَّا رَأَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا قَدْ غَشِيَنِي ضَرَبَ فِي صَدْرِي فَفِضْتُ عَرَقًا وَكَأَنَّمَا أَنْظُرُ إِلَى اللَّهِ عَزَّ وَجَلَّ فَرَقًا فَقَالَ لِي يَا أُبَيُّ أُرْسِلَ إِلَيَّ أَنْ اقْرَأْ الْقُرْآنَ عَلَى حَرْفٍ فَرَدَدْتُ إِلَيْهِ أَنْ هَوِّنْ عَلَى أُمَّتِي فَرَدَّ إِلَيَّ الثَّانِيَةَ اقْرَأْهُ عَلَى حَرْفَيْنِ فَرَدَدْتُ إِلَيْهِ أَنْ هَوِّنْ عَلَى أُمَّتِي فَرَدَّ إِلَيَّ الثَّالِثَةَ اقْرَأْهُ عَلَى سَبْعَةِ أَحْرُفٍ فَلَكَ بِكُلِّ رَدَّةٍ رَدَدْتُكَهَا مَسْأَلَةٌ تَسْأَلُنِيهَا فَقُلْتُ اللَّهُمَّ اغْفِرْ لِأُمَّتِي اللَّهُمَّ اغْفِرْ لِأُمَّتِي وَأَخَّرْتُ الثَّالِثَةَ لِيَوْمٍ يَرْغَبُ إِلَيَّ الْخَلْقُ كُلُّهُمْ حَتَّى إِبْرَاهِيمُُ عَلَيْهِ السَلَام."
      },
      {
        "id": 9469,
        "hadith_number": "1905",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perihal Solat dan Bacaan di Masjid",
        "perawi_melayu": "Ubayy bin Ka'b رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "He was sitting in a mosque that a person entered it and he observed prayer, and made recitation, the rest of the hadith is the same.",
        "malay_translation": "Beliau sedang duduk di dalam masjid ketika seseorang masuk ke dalamnya dan menunaikan solat, serta membaca (Al-Quran), dan selebihnya hadis adalah sama.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنِي إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عِيسَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى أَخْبَرَنِي أُبَيُّ بْنُ كَعْبٍ أَنَّهُ كَانَ جَالِسًا فِي الْمَسْجِدِ إِذْ دَخَلَ رَجُلٌ فَصَلَّى فَقَرَأَ قِرَاءَةً وَاقْتَصَّ الْحَدِيثَ بِمِثْلِ حَدِيثِ ابْنِ نُمَيْرٍ."
      },
      {
        "id": 9470,
        "hadith_number": "1906",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Al-Quran Diturunkan dalam Tujuh Dialek",
        "perawi_melayu": "Ubayy bin Ka'b رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was near the tank of Banu Ghifar that Gabriel came to him and said: Allah has commanded you to recite to your people the Qur'an in one dialect. Upon this he said: I ask from Allah pardon and forgiveness. My people are not capable of doing it. He then came for the second time and said: Allah has commanded you that you should recite the Qur'an to your people in two dialects. Upon this he (the Holy prophet) again said: I seek pardon and forgiveness from Allah, my people would not be able to do so. He (Gabriel) came for the third time and said: Allah has commanded you to recite the Qur'an to your people in three dialects. Upon this he said: I ask pardon and forgiveness from Allah. My people would not be able to do it. He then came to him for the fourth time and said: Allah has commanded you to recite the Qur'an to your people in seven dialects, and in whichever dialect they would recite, they would be right.",
        "malay_translation": "Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم) berada dekat kolam Banu Ghifar ketika Jibril datang kepadanya dan berkata: Allah telah memerintahkanmu untuk membacakan kepada umatmu Al-Quran dalam satu dialek. Atas hal ini beliau bersabda: Aku memohon ampunan dan maaf dari Allah. Umatku tidak mampu melakukannya. Kemudian Jibril datang untuk kali kedua dan berkata: Allah telah memerintahkanmu agar engkau membacakan Al-Quran kepada umatmu dalam dua dialek. Atas hal ini beliau (Nabi Muhammad) bersabda lagi: Aku memohon ampunan dan maaf dari Allah, umatku tidak akan mampu melakukannya. Jibril datang untuk kali ketiga dan berkata: Allah telah memerintahkanmu untuk membacakan Al-Quran kepada umatmu dalam tiga dialek. Atas hal ini beliau bersabda: Aku memohon ampunan dan maaf dari Allah. Umatku tidak akan mampu melakukannya. Kemudian Jibril datang kepadanya untuk kali keempat dan berkata: Allah telah memerintahkanmu untuk membacakan Al-Quran kepada umatmu dalam tujuh dialek, dan dalam dialek mana pun mereka membacanya, mereka akan benar.",
        "arabic_text": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ ح و حَدَّثَنَاه ابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ مُجَاهِدٍ عَنْ ابْنِ أَبِي لَيْلَى عَنْ أُبَيِّ بْنِ كَعْبٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ عِنْدَ أَضَاةِ بَنِي غِفَارٍ قَالَ فَأَتَاهُ جِبْرِيلُ عَلَيْهِ السَّلَام فَقَالَ إِنَّ اللَّهَ يَأْمُرُكَ أَنْ تَقْرَأَ أُمَّتُكَ الْقُرْآنَ عَلَى حَرْفٍ فَقَالَ أَسْأَلُ اللَّهَ مُعَافَاتَهُ وَمَغْفِرَتَهُ وَإِنَّ أُمَّتِي لَا تُطِيقُ ذَلِكَ ثُمَّ أَتَاهُ الثَّانِيَةَ فَقَالَ إِنَّ اللَّهَ يَأْمُرُكَ أَنْ تَقْرَأَ أُمَّتُكَ الْقُرْآنَ عَلَى حَرْفَيْنِ فَقَالَ أَسْأَلُ اللَّهَ مُعَافَاتَهُ وَمَغْفِرَتَهُ وَإِنَّ أُمَّتِي لَا تُطِيقُ ذَلِكَ ثُمَّ جَاءَهُ الثَّالِثَةَ فَقَالَ إِنَّ اللَّهَ يَأْمُرُكَ أَنْ تَقْرَأَ أُمَّتُكَ الْقُرْآنَ عَلَى ثَلَاثَةِ أَحْرُفٍ فَقَالَ أَسْأَلُ اللَّهَ مُعَافَاتَهُ وَمَغْفِرَتَهُ وَإِنَّ أُمَّتِي لَا تُطِيقُ ذَلِكَ ثُمَّ جَاءَهُ الرَّابِعَةَ فَقَالَ إِنَّ اللَّهَ يَأْمُرُكَ أَنْ تَقْرَأَ أُمَّتُكَ الْقُرْآنَ عَلَى سَبْعَةِ أَحْرُفٍ فَأَيُّمَا حَرْفٍ قَرَءُوا عَلَيْهِ فَقَدْ أَصَابُوا."
      },
      {
        "id": 9471,
        "hadith_number": "1907",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Diriwayatkan dengan Sanad yang Sama",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "This hadith has been narrated by Shu'ba with the same chain of transmitters.",
        "malay_translation": "Hadis ini telah diriwayatkan oleh Shu'ba dengan sanad yang sama.",
        "arabic_text": "و حَدَّثَنَاه عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ مِثْلَهُ."
      },
      {
        "id": 9472,
        "hadith_number": "1908",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Membaca Al-Quran dengan Tergesa-gesa dan Keutamaan Memahaminya",
        "perawi_melayu": "Diriwayatkan oleh Abu Wa'il:",
        "english_text": "A person named Nabik bin Sinan came to Abdullah (bin Mas'ud رضی اللہ تعالیٰ عنہ) and said: Abu 'Abdul-Rahman, how do you recite this word (alif) or (ya)? Would you read It as: min ma'in ghaira asin or au min ma'in ghaira ghaira yasin. (al-Qur'an, xlvii. 15)? 'Abdullah said: You (seem to) have memorised the whole of the Qur'an except this. He (again) said: I recite all the mufassal surahs in one rak'ah. Upon this 'Abdullah رضی اللہ تعالیٰ عنہ said: (You must have been reciting It) hastily like the recitation of poetry. Verily. there are people who recite the Qur'an, but it does not go down beyond their collar bones. It is (a fact with the Qur'an) that it is beneficial only when it settles in the heart and is rooted deeply in it. The best of (the acts) in prayer are bowing and prostration. I am quite aware of the occasions when the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) combined together two surahs in every rak'ah. 'Abdullah then stood up and went out with 'Alqama following in his footstep. He said Ibn Numair had told him that the narration was like that: A person belonging to Banu Bajila came to 'Abdullah رضی اللہ تعالیٰ عنہ , and he did not mention (the name of) Nahik bin Sinan.",
        "malay_translation": "Seorang lelaki bernama Nabik bin Sinan datang kepada Abdullah (bin Mas'ud رضی اللہ تعالیٰ عنہ) dan berkata: Abu 'Abdul-Rahman, bagaimana kamu membaca perkataan ini (alif) atau (ya)? Adakah kamu membacanya sebagai: min ma'in ghaira asin atau au min ma'in ghaira ghaira yasin. (Al-Qur'an, xlvii. 15)? 'Abdullah berkata: Kamu (nampaknya) telah menghafal seluruh Al-Qur'an kecuali ini. Dia (sekali lagi) berkata: Saya membaca semua surah mufassal dalam satu rakaat. Atas hal ini 'Abdullah رضی اللہ تعالیٰ عنہ berkata: (Kamu pasti membacanya) dengan tergesa-gesa seperti bacaan syair. Sesungguhnya, ada orang yang membaca Al-Qur'an, tetapi ia tidak turun melebihi tulang selangka mereka. Ia adalah (fakta dengan Al-Qur'an) bahawa ia hanya bermanfaat apabila ia menetap di dalam hati dan berakar umbi di dalamnya. Sebaik-baik (perbuatan) dalam solat adalah rukuk dan sujud. Saya sangat menyedari tentang kesempatan-kesempatan ketika Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم‌) menggabungkan dua surah dalam setiap rakaat. 'Abdullah kemudian berdiri dan keluar dengan 'Alqama mengikuti jejak langkahnya. Dia berkata Ibn Numair telah memberitahunya bahawa riwayat itu adalah seperti itu: Seorang lelaki yang berasal dari Banu Bajila datang kepada 'Abdullah رضی اللہ تعالیٰ عنہ, dan dia tidak menyebut (nama) Nahik bin Sinan.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ نُمَيْرٍ جَمِيعًا عَنْ وَكِيعٍ قَالَ أَبُو بَكْرٍ حَدَّثَنَا وَكِيعٌ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ قَالَ جَاءَ رَجُلٌ يُقَالُ لَهُ نَهِيكُ بْنُ سِنَانٍ إِلَى عَبْدِ اللَّهِ فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ كَيْفَ تَقْرَأُ هَذَا الْحَرْفَ أَلِفًا تَجِدُهُ أَمْ يَاءً مِنْ مَاءٍ غَيْرِ آسِنٍ أَوْ مِنْ مَاءٍ غَيْرِ يَاسِنٍ قَالَ فَقَالَ عَبْدُ اللَّهِ وَكُلَّ الْقُرْآنِ قَدْ أَحْصَيْتَ غَيْرَ هَذَا قَالَ إِنِّي لَأَقْرَأُ الْمُفَصَّلَ فِي رَكْعَةٍ فَقَالَ عَبْدُ اللَّهِ هَذًّا كَهَذِّ الشِّعْرِ إِنَّ أَقْوَامًا يَقْرَءُونَ الْقُرْآنَ لَا يُجَاوِزُ تَرَاقِيَهُمْ وَلَكِنْ إِذَا وَقَعَ فِي الْقَلْبِ فَرَسَخَ فِيهِ نَفَعَ إِنَّ أَفْضَلَ الصَّلَاةِ الرُّكُوعُ وَالسُّجُودُ إِنِّي لَأَعْلَمُ النَّظَائِرَ الَّتِي كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرُنُ بَيْنَهُنَّ سُورَتَيْنِ فِي كُلِّ رَكْعَةٍ ثُمَّ قَامَ عَبْدُ اللَّهِ فَدَخَلَ عَلْقَمَةُ فِي إِثْرِهِ ثُمَّ خَرَجَ فَقَالَ قَدْ أَخْبَرَنِي بِهَا قَالَ ابْنُ نُمَيْرٍ فِي رِوَايَتِهِ جَاءَ رَجُلٌ مِنْ بَنِي بَجِيلَةَ إِلَى عَبْدِ اللَّهِ وَلَمْ يَقُلْ نَهِيكُ بْنُ سِنَانٍ."
      },
      {
        "id": 9473,
        "hadith_number": "1909",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Bilangan Surah Mufassal dalam Kompilasi Al-Quran Abdullah bin Mas'ud",
        "perawi_melayu": "Diriwayatkan oleh Abu Wa'il:",
        "english_text": "A person came to 'Abdullah, who was called Nahik bin Sinan, and the rest of the hadith is the same but for this: Alqama came to him ('Abdullah bin Mas'ud رضی اللہ تعالیٰ عنہ) and we said to him: Ask him about the manners in which he combined (two surahs) in one rak'ah. So he went to him and asked him and then came to us and said: Twenty are the mufassal surahs in the compilation (of the Qur'an) made by 'Abdullah رضی اللہ تعالیٰ عنہ .",
        "malay_translation": "Seorang lelaki datang kepada 'Abdullah, yang dikenali sebagai Nahik bin Sinan, dan baki hadis adalah sama kecuali untuk ini: Alqama datang kepadanya ('Abdullah bin Mas'ud رضی اللہ تعالیٰ عنہ) dan kami berkata kepadanya: Tanyakan kepadanya tentang cara dia menggabungkan (dua surah) dalam satu rakaat. Maka dia pergi kepadanya dan bertanya kepadanya dan kemudian datang kepada kami dan berkata: Dua puluh adalah surah-surah mufassal dalam kompilasi (Al-Quran) yang dibuat oleh 'Abdullah رضی اللہ تعالیٰ عنہ .",
        "arabic_text": "و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ قَالَ جَاءَ رَجُلٌ إِلَى عَبْدِ اللَّهِ يُقَالُ لَهُ نَهِيكُ بْنُ سِنَانٍ بِمِثْلِ حَدِيثِ وَكِيعٍ غَيْرَ أَنَّهُ قَالَ فَجَاءَ عَلْقَمَةُ لِيَدْخُلَ عَلَيْهِ فَقُلْنَا لَهُ سَلْهُ عَنْ النَّظَائِرِ الَّتِي كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ بِهَا فِي رَكْعَةٍ فَدَخَلَ عَلَيْهِ فَسَأَلَهُ ثُمَّ خَرَجَ عَلَيْنَا فَقَالَ عِشْرُونَ سُورَةً مِنْ الْمُفَصَّلِ فِي تَأْلِيفِ عَبْدِ اللَّهِ."
      },
      {
        "id": 9474,
        "hadith_number": "1910",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Cara Rasulullah Membaca Surah dalam Rakaat",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "This hadith has been narrated by A'mash with the same chain of transmitters in which ('Abdullah bin Mas'ud رضی اللہ تعالیٰ عنہ) said: I know the manners in which the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) recited the two surahs in one rak'ah and then twenty surahs in ten rak'ahs.",
        "malay_translation": "Hadis ini telah diriwayatkan oleh A'mash dengan sanad yang sama di mana ('Abdullah bin Mas'ud رضی اللہ تعالیٰ عنہ) berkata: Saya mengetahui cara Rasulullah (ﷺ) membaca dua surah dalam satu rakaat dan kemudian dua puluh surah dalam sepuluh rakaat.",
        "arabic_text": "و حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا الْأَعْمَشُ فِي هَذَا الْإِسْنَادِ بِنَحْوِ حَدِيثِهِمَا وَقَالَ إِنِّي لَأَعْرِفُ النَّظَائِرَ الَّتِي كَانَ يَقْرَأُ بِهِنَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اثْنَتَيْنِ فِي رَكْعَةٍ عِشْرِينَ سُورَةً فِي عَشْرِ رَكَعَاتٍ."
      },
      {
        "id": 9475,
        "hadith_number": "1911",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ziarah kepada Abdullah bin Mas'ud dan Amalan Zikir Pagi",
        "perawi_melayu": "Diriwayatkan oleh Abu Wa'il:",
        "english_text": "One day we went to 'Abdullah bin Mas'ud رضی اللہ تعالیٰ عنہ after we had observed the dawn prayer and we paid salutation at the door. He permitted us to enter, but we stayed for a while at the door, when the slave-girl came out and said: Why don't you come in? So we went in and (we found 'Abdullah bin Mas'ud) sitting and glorifying Allah (i. e. he was busy in dhikr) and he said: What obstructed you from coming in though you had been granted permission for it? We said: There was nothing (behind it) but we entertained the idea that some inmate of the house might be sleeping. He said: Do you presume any idleness on the part of the family of Ibn Umm 'Abd (the mother of Abdullah bin Mas'ud)? He was again busy with the glorification of Allah till he thought that the sun had risen. He said: Girl, see whether (the sun) has arisen. She glanced but it had not risen (by that time). He was again busy with the glorification (of Allah) and he (again) thought that the sun had arisen. She glanced (and confirmed) that, it had risen. Upon this he ('Abdullah bin Mas'ud رضی اللہ تعالیٰ عنہ) said: Praise be to Allah Who did not call us to account for our sins today. Mahdi said: I think that he said, He did not destroy us for our sins. One among the people said: I recited all the mufassal surahs during the night. 'Abdullah رضی اللہ تعالیٰ عنہ said: (You must have recited them) like the (recitation) of poetry. I heard (the Holy Prophet) combining (the sarahs) and I remember the combinations which the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) made In the recitation (of surahs). These were constituted of eighteen mufassal surahs and two surahs (commencing with) Ha-Mim.",
        "malay_translation": "Pada suatu hari, kami pergi ke rumah Abdullah bin Mas'ud رضي الله تعالى عنه setelah kami selesai menunaikan solat Subuh. Kami memberi salam di pintu rumahnya. Beliau mengizinkan kami masuk, tetapi kami berhenti seketika di pintu. Kemudian, seorang hamba perempuan keluar dan bertanya: \"Kenapa kamu tidak masuk?\"  Lalu kami pun masuk dan mendapati Abdullah bin Mas'ud sedang duduk berzikir dan bertasbih kepada Allah. Beliau bertanya: \"Apa yang menghalang kamu daripada masuk, padahal kamu sudah diizinkan?\" Kami menjawab: \"Tidak ada apa-apa, hanya kami beranggapan mungkin ada ahli rumah yang masih tidur.\" Beliau berkata: \"Adakah kamu menyangka keluarga Ibn Umm 'Abd (ibu Abdullah bin Mas'ud) ini bermalas-malasan?\" Beliau kembali meneruskan zikir dan tasbihnya kepada Allah sehingga beliau menyangka matahari telah terbit. Beliau berkata: \"Wahai anak perempuan, lihatlah apakah matahari sudah terbit.\" Hamba perempuan itu melihat dan mendapati matahari belum terbit. Beliau kembali berzikir dan bertasbih kepada Allah sehingga beliau menyangka matahari telah terbit lagi. Hamba perempuan itu melihat dan mengesahkan bahawa matahari telah terbit.  Kemudian Abdullah bin Mas'ud رضي الله تعالى عنه berkata: \"Segala puji bagi Allah yang tidak menghisab (menghitung) dosa-dosa kami pada hari ini.\" Mahdi berkata: \"Saya rasa beliau berkata, 'Dia tidak membinasakan kami kerana dosa-dosa kami'.\" Salah seorang dari antara kami berkata: \"Saya telah membaca semua surah mufassal pada malam tadi.\" Abdullah رضي الله تعالى عنه berkata: \"(Kamu pasti membacanya) seperti bacaan syair.\" Saya mendengar Rasulullah ﷺ menggabungkan surah-surah dan saya masih ingat gabungan surah yang dilakukan oleh Rasulullah ﷺ dalam bacaan (solat). Gabungan itu terdiri daripada lapan belas surah mufassal dan dua surah yang bermula dengan Ha-Mim.",
        "arabic_text": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ حَدَّثَنَا وَاصِلٌ الْأَحْدَبُ عَنْ أَبِي وَائِلٍ قَالَ غَدَوْنَا عَلَى عَبْدِ اللَّهِ بْنِ مَسْعُودٍ يَوْمًا بَعْدَ مَا صَلَّيْنَا الْغَدَاةَ فَسَلَّمْنَا بِالْبَابِ فَأَذِنَ لَنَا قَالَ فَمَكَثْنَا بِالْبَابِ هُنَيَّةً قَالَ فَخَرَجَتْ الْجَارِيَةُ فَقَالَتْ أَلَا تَدْخُلُونَ فَدَخَلْنَا فَإِذَا هُوَ جَالِسٌ يُسَبِّحُ فَقَالَ مَا مَنَعَكُمْ أَنْ تَدْخُلُوا وَقَدْ أُذِنَ لَكُمْ فَقُلْنَا لَا إِلَّا أَنَّا ظَنَنَّا أَنَّ بَعْضَ أَهْلِ الْبَيْتِ نَائِمٌ قَالَ ظَنَنْتُمْ بِآلِ ابْنِ أُمِّ عَبْدٍ غَفْلَةً قَالَ ثُمَّ أَقْبَلَ يُسَبِّحُ حَتَّى ظَنَّ أَنَّ الشَّمْسَ قَدْ طَلَعَتْ فَقَالَ يَا جَارِيَةُ انْظُرِي هَلْ طَلَعَتْ قَالَ فَنَظَرَتْ فَإِذَا هِيَ لَمْ تَطْلُعْ فَأَقْبَلَ يُسَبِّحُ حَتَّى إِذَا ظَنَّ أَنَّ الشَّمْسَ قَدْ طَلَعَتْ قَالَ يَا جَارِيَةُ انْظُرِي هَلْ طَلَعَتْ فَنَظَرَتْ فَإِذَا هِيَ قَدْ طَلَعَتْ فَقَالَ الْحَمْدُ لِلَّهِ الَّذِي أَقَالَنَا يَوْمَنَا هَذَا فَقَالَ مَهْدِيٌّ وَأَحْسِبُهُ قَالَ وَلَمْ يُهْلِكْنَا بِذُنُوبِنَا قَالَ فَقَالَ رَجُلٌ مِنْ الْقَوْمِ قَرَأْتُ الْمُفَصَّلَ الْبَارِحَةَ كُلَّهُ قَالَ فَقَالَ عَبْدُ اللَّهِ هَذًّا كَهَذِّ الشِّعْرِ إِنَّا لَقَدْ سَمِعْنَا الْقَرَائِنَ وَإِنِّي لَأَحْفَظُ الْقَرَائِنَ الَّتِي كَانَ يَقْرَؤُهُنَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَمَانِيَةَ عَشَرَ مِنْ الْمُفَصَّلِ وَسُورَتَيْنِ مِنْ آلِ حم."
      },
      {
        "id": 9476,
        "hadith_number": "1912",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Bacaan Surah Mufassal dalam Satu Rakaat",
        "perawi_melayu": "Shaqiq meriwayatkan:",
        "english_text": "A person from Banu Bajila who was called Nabik bin Sinan came to Abdullah رضی اللہ تعالیٰ عنہ and said: I recite mufassal surahs in one rak'ah. Upon this 'Abdullah رضی اللہ تعالیٰ عنہ said: (You recite) like the recitation of poetry. I know the manner in which the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) recited two surahs in one rak'ah.",
        "malay_translation": "Seorang lelaki dari Bani Bajilah yang bernama Nabik bin Sinan datang kepada Abdullah رضی اللہ تعالیٰ عنہ dan berkata: Saya membaca surah-surah mufassal dalam satu rakaat.  Maka Abdullah رضی اللہ تعالیٰ عنہ berkata: (Kamu membaca) seperti bacaan syair. Aku tahu cara Rasulullah (صلی الله علیه وسلم) membaca dua surah dalam satu rakaat.",
        "arabic_text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ الْجُعْفِيُّ عَنْ زَائِدَةَ عَنْ مَنْصُورٍ عَنْ شَقِيقٍ قَالَ جَاءَ رَجُلٌ مِنْ بَنِي بَجِيلَةَ يُقَالُ لَهُ نَهِيكُ بْنُ سِنَانٍ إِلَى عَبْدِ اللَّهِ فَقَالَ إِنِّي أَقْرَأُ الْمُفَصَّلَ فِي رَكْعَةٍ فَقَالَ عَبْدُ اللَّهِ هَذًّا كَهَذِّ الشِّعْرِ لَقَدْ عَلِمْتُ النَّظَائِرَ الَّتِي كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ بِهِنَّ سُورَتَيْنِ فِي رَكْعَةٍ."
      },
      {
        "id": 9477,
        "hadith_number": "1913",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Bacaan Tergesa-gesa dalam Solat",
        "perawi_melayu": "Diriwayatkan oleh Abu Wa'il:",
        "english_text": "A person came to 'Abdullah bin Mas'ud رضی اللہ تعالیٰ عنہ and said: I recited all the mufassal surahs in one rak'ah during the night. 'Abdullah رضی اللہ تعالیٰ عنہ said: You must have recited hastily like the recitation of poetry. 'Abdullah رضی اللہ تعالیٰ عنہ said: I remember well the manner in which the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to combine them, and he then mentioned twenty of the mufassal surahs, and (their combinations in) two in every rak'ah.",
        "malay_translation": "Seorang lelaki datang kepada Abdullah bin Mas'ud (r.a.) dan berkata: Saya telah membaca semua surah mufassal dalam satu rakaat pada waktu malam. Abdullah (r.a.) berkata: Pasti kamu membacanya dengan tergesa-gesa seperti bacaan syair. Abdullah (r.a.) berkata: Saya masih ingat dengan baik cara Rasulullah ﷺ menggabungkan surah-surah tersebut, kemudian beliau menyebut dua puluh surah mufassal, dan (gabungan mereka) dua surah dalam setiap rakaat.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ أَنَّهُ سَمِعَ أَبَا وَائِلٍ يُحَدِّثُ أَنَّ رَجُلًا جَاءَ إِلَى ابْنِ مَسْعُودٍ فَقَالَ إِنِّي قَرَأْتُ الْمُفَصَّلَ اللَّيْلَةَ كُلَّهُ فِي رَكْعَةٍ فَقَالَ عَبْدُ اللَّهِ هَذًّا كَهَذِّ الشِّعْرِ فَقَالَ عَبْدُ اللَّهِ لَقَدْ عَرَفْتُ النَّظَائِرَ الَّتِي كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرُنُ بَيْنَهُنَّ قَالَ فَذَكَرَ عِشْرِينَ سُورَةً مِنْ الْمُفَصَّلِ سُورَتَيْنِ سُورَتَيْنِ فِي كُلِّ رَكْعَةٍ."
      },
      {
        "id": 9478,
        "hadith_number": "1914",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Cara Bacaan 'Muddakir' Menurut Abdullah bin Mas'ud",
        "perawi_melayu": "Abu Ishaq meriwayatkan:",
        "english_text": "I saw a man asking Aswad bin Yazid who taught the Qur'an in the mosque: How do you recite the verse (fahal min muddakir) whether (the word muddakir) Is with (d) or (dh)? He (Aswad) said: It was with (d). I heard Abdullah bin Mas'ud رضی اللہ تعالیٰ عنہ saying that he had heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) reciting (muddakir) with (d).",
        "malay_translation": "Saya melihat seorang lelaki bertanya kepada Aswad bin Yazid yang mengajar Al-Quran di masjid: Bagaimana kamu membaca ayat (fahal min muddakir), adakah (perkataan muddakir) dengan (d) atau (dh)? Beliau (Aswad) berkata: Ia adalah dengan (d). Saya mendengar Abdullah bin Mas'ud رضی اللہ تعالیٰ عنہ berkata bahawa beliau telah mendengar Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) membaca (muddakir) dengan (d).",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو إِسْحَقَ قَالَ رَأَيْتُ رَجُلًا سَأَلَ الْأَسْوَدَ بْنَ يَزِيدَ وَهُوَ يُعَلِّمُ الْقُرْآنَ فِي الْمَسْجِدِ فَقَالَ كَيْفَ تَقْرَأُ هَذِهِ الْآيَةَ فَهَلْ مِنْ مُدَّكِرٍ أَدَالًا أَمْ ذَالًا قَالَ بَلْ دَالًا سَمِعْتُ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مُدَّكِرٍ دَالًا."
      },
      {
        "id": 9479,
        "hadith_number": "1915",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Bacaan Rasulullah (SAW): Fahal Min Muddakir",
        "perawi_melayu": "Diriwayatkan daripada Ishaq yang berkata daripada Aswad yang memetik daripada 'Abdullah bin Mas'ud رضی اللہ تعالیٰ عنہ :",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to recite these words as (fahal min muddakir).",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) biasa membaca kalimah ini sebagai (fahal min muddakir).",
        "arabic_text": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ عَنْ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقْرَأُ هَذَا الْحَرْفَ فَهَلْ مِنْ مُدَّكِرٍ."
      },
      {
        "id": 9480,
        "hadith_number": "1916",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Bacaan Abdullah bin Mas'ud Menurut Abu Darda'",
        "perawi_melayu": "Diriwayatkan oleh Alqama:",
        "english_text": "We went to Syria and Abu Darda' رضی اللہ تعالیٰ عنہ came to us and said: Is there anyone among you who recites according to the recitation of Abdullah رضی اللہ تعالیٰ عنہ? I said: Yes, it is I. He again said: How did you hear 'Abdullah رضی اللہ تعالیٰ عنہ reciting this verse: (wa'l-lail-i-idha yaghsha = when the night covers)? He ('Alqama) said: I heard him reciting it (like this) (wa'l-lail-i-idha yaghsha) wa-dhakar wal untha = when the night covers and the males and the females). Upon this he said: By Allah, I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) reciting in this way, but they (the Muslims of Syria) desire us to recite: (wa ma khalaqa), but I do not yield to their desire.",
        "malay_translation": "Kami pergi ke Syam dan Abu Darda' رضی اللہ تعالیٰ عنہ datang kepada kami dan berkata: Adakah sesiapa di antara kamu yang membaca mengikut bacaan Abdullah رضی اللہ تعالیٰ عنہ? Saya berkata: Ya, saya. Beliau berkata lagi: Bagaimana kamu mendengar 'Abdullah رضی اللہ تعالیٰ عنہ membaca ayat ini: (wa'l-lail-i-idha yaghsha = demi malam apabila menutupi)? Beliau ('Alqama) berkata: Saya mendengar beliau membacanya (seperti ini) (wa'l-lail-i-idha yaghsha) wa-dhakar wal untha = demi malam apabila menutupi, dan lelaki serta perempuan). Lalu beliau berkata: Demi Allah, saya mendengar Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) membaca seperti ini, tetapi mereka (Muslim Syam) ingin kami membaca: (wa ma khalaqa), tetapi saya tidak menurut keinginan mereka.",
        "arabic_text": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَاللَّفْظُ لِأَبِي بَكْرٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ قَالَ قَدِمْنَا الشَّامَ فَأَتَانَا أَبُو الدَّرْدَاءِ فَقَالَ أَفِيكُمْ أَحَدٌ يَقْرَأُ عَلَى قِرَاءَةِ عَبْدِ اللَّهِ فَقُلْتُ نَعَمْ أَنَا قَالَ فَكَيْفَ سَمِعْتَ عَبْدَ اللَّهِ يَقْرَأُ هَذِهِ الْآيَةَ وَاللَّيْلِ إِذَا يَغْشَى قَالَ سَمِعْتُهُ يَقْرَأُ وَاللَّيْلِ إِذَا يَغْشَى وَالذَّكَرِ وَالْأُنْثَى قَالَ وَأَنَا وَاللَّهِ هَكَذَا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَؤُهَا وَلَكِنْ هَؤُلَاءِ يُرِيدُونَ أَنْ أَقْرَأَ وَمَا خَلَقَ فَلَا أُتَابِعُهُمْ."
      },
      {
        "id": 9481,
        "hadith_number": "1917",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah 'Alqama di Syam dan Pertanyaan tentang Bacaan Abdullah",
        "perawi_melayu": "Ibrahim meriwayatkan:",
        "english_text": "'Alqama came to Syria and entered the mosque and prayed there and then went to a (place where people were sitting in a) circle and he sat therein. Then a person came there and I perceived that the people were annoyed and perturbed (on this arrival). and he sat on my side and then said: Do you remember how 'Abdullah رضی اللہ تعالیٰ عنہ used to recite (the Qur'an)? And then the rest of the hadith was narrated.",
        "malay_translation": "'Alqama datang ke Syam dan memasuki masjid dan solat di sana, kemudian pergi ke (tempat di mana orang ramai duduk dalam) bulatan dan dia duduk di situ. Kemudian seorang lelaki datang ke sana dan saya perhatikan bahawa orang ramai merasa jengkel dan terganggu (dengan kedatangan ini). Dan dia duduk di sisi saya dan kemudian berkata: Adakah kamu ingat bagaimana 'Abdullah رضی اللہ تعالیٰ عنہ biasa membaca (Al-Qur'an)? Dan kemudian hadis seterusnya diriwayatkan.",
        "arabic_text": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا جَرِيرٌ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ قَالَ أَتَى عَلْقَمَةُ الشَّامَ فَدَخَلَ مَسْجِدًا فَصَلَّى فِيهِ ثُمَّ قَامَ إِلَى حَلْقَةٍ فَجَلَسَ فِيهَا قَالَ فَجَاءَ رَجُلٌ فَعَرَفْتُ فِيهِ تَحَوُّشَ الْقَوْمِ وَهَيْئَتَهُمْ قَالَ فَجَلَسَ إِلَى جَنْبِي ثُمَّ قَالَ أَتَحْفَظُ كَمَا كَانَ عَبْدُ اللَّهِ يَقْرَأُ فَذَكَرَ بِمِثْلِهِ."
      },
      {
        "id": 9482,
        "hadith_number": "1918",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pengakuan Abu Darda' tentang Bacaan Rasulullah SAW",
        "perawi_melayu": "Alqama meriwayatkan:",
        "english_text": "I met Abu Darda' رضی اللہ تعالیٰ عنہ , and he said to me: To which country do you belong? I said: I am one of the people of Iraq. He again said: To which city? I replied: City of Kufa. He again said: Do you recite according to the recitation of 'Abdullah bin Mas'ud رضی اللہ تعالیٰ عنہ ? I said: Yes. He said: Recite this verse (By the night when it covers) So I recited it: (By the night when it covers, and the day when it shines, and the creating of the male and the female). He laughed and said: I have heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) reciting like this.",
        "malay_translation": "Saya bertemu Abu Darda' رضی اللہ تعالیٰ عنہ , dan beliau berkata kepada saya: Dari negara mana kamu berasal? Saya berkata: Saya adalah salah seorang dari penduduk Iraq. Beliau bertanya lagi: Dari kota mana? Saya menjawab: Kota Kufah. Beliau bertanya lagi: Adakah kamu membaca (Al-Quran) mengikut bacaan Abdullah bin Mas'ud رضی اللہ تعالیٰ عنہ ? Saya berkata: Ya. Beliau berkata: Bacalah ayat ini (Demi malam apabila ia menutupi) Maka saya membacanya: (Demi malam apabila ia menutupi, dan siang apabila ia bersinar, dan penciptaan lelaki dan perempuan). Beliau tertawa dan berkata: Saya telah mendengar Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) membaca seperti ini.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنْ الشَّعْبِيِّ عَنْ عَلْقَمَةَ قَالَ لَقِيتُ أَبَا الدَّرْدَاءِ فَقَالَ لِي مِمَّنْ أَنْتَ قُلْتُ مِنْ أَهْلِ الْعِرَاقِ قَالَ مِنْ أَيِّهِمْ قُلْتُ مِنْ أَهْلِ الْكُوفَةِ قَالَ هَلْ تَقْرَأُ عَلَى قِرَاءَةِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ قُلْتُ نَعَمْ قَالَ فَاقْرَأْ وَاللَّيْلِ إِذَا يَغْشَى قَالَ فَقَرَأْتُ وَاللَّيْلِ إِذَا يَغْشَى وَالنَّهَارِ إِذَا تَجَلَّى وَالذَّكَرِ وَالْأُنْثَى قَالَ فَضَحِكَ ثُمَّ قَالَ هَكَذَا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَؤُهَا."
      },
      {
        "id": 9483,
        "hadith_number": "1919",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pertemuan dengan Abu Ad-Darda' di Ash-Sham dan Riwayat Hadis Serupa",
        "perawi_melayu": "Diriwayatkan daripada 'lqamah berkata:",
        "english_text": "I came to Ash-Sham and I met Abu Ad-Dard'...\" and he Quoted a Hadith similar to that of Ibn 'Ulayyah (no. 1918).",
        "malay_translation": "Aku datang ke Ash-Sham dan aku bertemu Abu Ad-Darda'...\" dan beliau meriwayatkan sebuah Hadis yang serupa dengan Hadis Ibn 'Ulayyah (no. 1918).",
        "arabic_text": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنِي عَبْدُ الْأَعْلَى حَدَّثَنَا دَاوُدُ عَنْ عَامِرٍ عَنْ عَلْقَمَةَ قَالَ أَتَيْتُ الشَّامَ فَلَقِيتُ أَبَا الدَّرْدَاءِ فَذَكَرَ بِمِثْلِ حَدِيثِ ابْنِ عُلَيَّةَ."
      },
      {
        "id": 9484,
        "hadith_number": "1920",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Solat Sunat Selepas Asar dan Subuh",
        "perawi_melayu": "Abu Hurairah رضی اللہ تعالیٰ عنہ meriwayatkan bahawa:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) prohibited to observe prayer after the 'Asr prayer till the sun is set, and after the dawn till the sun rises.",
        "malay_translation": "Rasulullah ﷺ melarang untuk melakukan solat sunat setelah solat Asar sehingga matahari terbenam, dan setelah fajar sehingga matahari terbit.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الصَّلَاةِ بَعْدَ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ وَعَنْ الصَّلَاةِ بَعْدَ الصُّبْحِ حَتَّى تَطْلُعَ الشَّمْسُ."
      },
      {
        "id": 9485,
        "hadith_number": "1921",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Solat Sunat Selepas Subuh dan Asar",
        "perawi_melayu": "Diriwayatkan daripada Ibn 'Abbas رضی اللہ تعالیٰ عنہ :",
        "english_text": "I heard it from so many Companions of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and one among them is 'Umar bin Khattab رضی اللہ تعالیٰ عنہ , and he is most dear to me among them that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) prohibited observing of prayer after the dawn prayer till the sun rose and after the 'Asr till the sun set.",
        "malay_translation": "Saya mendengar daripada ramai Sahabat Rasulullah (ﷺ) dan salah seorang daripada mereka adalah 'Umar bin Khattab رضی اللہ تعالیٰ عنہ, dan beliau adalah yang paling saya cintai di antara mereka, bahawa Rasulullah (ﷺ) melarang mendirikan solat sunat selepas solat Subuh sehingga matahari terbit dan selepas solat Asar sehingga matahari terbenam.",
        "arabic_text": "و حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ وَإِسْمَعِيلُ بْنُ سَالِمٍ جَمِيعًا عَنْ هُشَيْمٍ قَالَ دَاوُدُ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا مَنْصُورٌ عَنْ قَتَادَةَ قَالَ أَخْبَرَنَا أَبُو الْعَالِيَةِ عَنْ ابْنِ عَبَّاسٍ قَالَ سَمِعْتُ غَيْرَ وَاحِدٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهُمْ عُمَرُ بْنُ الْخَطَّابِ وَكَانَ أَحَبَّهُمْ إِلَيَّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الصَّلَاةِ بَعْدَ الْفَجْرِ حَتَّى تَطْلُعَ الشَّمْسُ وَبَعْدَ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ."
      },
      {
        "id": 9486,
        "hadith_number": "1922",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Waktu Selepas Subuh Hingga Matahari Terbit",
        "perawi_melayu": "Diriwayatkan daripada Qatadah dengan sanad ini (hadis yang serupa dengan no. 1921) kecuali dalam Hadis Saeed dan Hisham, ia menyebut:",
        "english_text": "\"After Subh until the sun has risen brightly.\"",
        "malay_translation": "\"Selepas Subuh sehingga matahari terbit dengan terang.\"",
        "arabic_text": "و حَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ ح و حَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا سَعِيدٌ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي كُلُّهُمْ عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّ فِي حَدِيثِ سَعِيدٍ وَهِشَامٍ بَعْدَ الصُّبْحِ حَتَّى تَشْرُقَ الشَّمْسُ."
      },
      {
        "id": 9487,
        "hadith_number": "1923",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Solat Selepas Asar dan Subuh",
        "perawi_melayu": "Abu Sa'id al-Khudri r.a.",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: No prayer is valid after the 'Asr prayer till the sun sets and no prayer is valid after the dawn prayer till the sun rises.",
        "malay_translation": "Rasulullah ﷺ bersabda: Tidak sah solat selepas solat Asar sehingga matahari terbenam dan tidak sah solat selepas solat Subuh sehingga matahari terbit.",
        "arabic_text": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ أَنَّ ابْنَ شِهَابٍ أَخْبَرَهُ قَالَ أَخْبَرَنِي عَطَاءُ بْنُ يَزِيدَ اللَّيْثِيُّ أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا صَلَاةَ بَعْدَ صَلَاةِ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ وَلَا صَلَاةَ بَعْدَ صَلَاةِ الْفَجْرِ حَتَّى تَطْلُعَ الشَّمْسُ."
      },
      {
        "id": 9488,
        "hadith_number": "1924",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Solat Ketika Matahari Terbit dan Terbenam",
        "perawi_melayu": "Diriwayatkan dari Ibn 'Umar رضی اللہ تعالیٰ عنہ:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Let not any one of you intend to observe prayer at the time of the rising of the sun or of the setting sun.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Janganlah seorang pun di antara kamu berniat untuk menunaikan solat pada waktu matahari terbit atau matahari terbenam.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَتَحَرَّى أَحَدُكُمْ فَيُصَلِّيَ عِنْدَ طُلُوعِ الشَّمْسِ وَلَا عِنْدَ غُرُوبِهَا."
      },
      {
        "id": 9489,
        "hadith_number": "1925",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Solat Ketika Matahari Terbit dan Terbenam",
        "perawi_melayu": "Diriwayatkan dari Ibn 'Umar رضی اللہ تعالیٰ عنہ:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Do not intend to observe prayer at the time of the rising of the sun nor at its setting, for it rises between the horns of Satan.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Janganlah kamu berniat untuk mengerjakan solat pada waktu matahari terbit dan tidak juga ketika matahari terbenam, kerana ia terbit di antara dua tanduk syaitan.",
        "arabic_text": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي وَمُحَمَّدُ بْنُ بِشْرٍ قَالَا جَمِيعًا حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَحَرَّوْا بِصَلَاتِكُمْ طُلُوعَ الشَّمْسِ وَلَا غُرُوبَهَا فَإِنَّهَا تَطْلُعُ بِقَرْنَيْ شَيْطَانٍ."
      },
      {
        "id": 9490,
        "hadith_number": "1926",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Solat Ketika Matahari Terbit dan Terbenam",
        "perawi_melayu": "Daripada Ibn 'Umar رضی اللہ تعالیٰ عنہ:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: When the rim of the sun starts appearing defer prayer till it completely appears, and when the rim of the sun disappears defer prayer till it completely disappears.",
        "malay_translation": "Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Apabila pinggir matahari mula kelihatan, maka tangguhkan solat sehingga ia kelihatan sepenuhnya, dan apabila pinggir matahari hilang, maka tangguhkan solat sehingga ia hilang sepenuhnya.",
        "arabic_text": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي وَابْنُ بِشْرٍ قَالُوا جَمِيعًا حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا بَدَا حَاجِبُ الشَّمْسِ فَأَخِّرُوا الصَّلَاةَ حَتَّى تَبْرُزَ وَإِذَا غَابَ حَاجِبُ الشَّمْسِ فَأَخِّرُوا الصَّلَاةَ حَتَّى تَغِيبَ."
      },
      {
        "id": 9491,
        "hadith_number": "1927",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Solat Asar dan Penjelasan Waktunya",
        "perawi_melayu": "Diriwayatkan oleh Abu Basra Ghifari رضی اللہ تعالیٰ عنہ:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) led us in the 'Asr prayer at (the place known as) Mukhammas, and then said: This prayer was presented to those gone before you, but they lost it, and he who guards it has two rewards in store for him. And no prayer is valid after till the onlooker appears (by onlooker is meant the evening star).",
        "malay_translation": "Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) mengimamkan kami dalam solat Asar di (tempat yang dikenali sebagai) Mukhammas, dan kemudian bersabda: Solat ini telah dipersembahkan kepada mereka yang terdahulu daripada kamu, tetapi mereka menghilangkannya, dan sesiapa yang menjaganya akan mendapat dua ganjaran untuknya. Dan tidak ada solat yang sah selepas itu sehingga bintang malam muncul (yang dimaksudkan dengan bintang malam ialah bintang Zuhrah).",
        "arabic_text": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ خَيْرِ بْنِ نُعَيْمٍ الْحَضْرَمِيِّ عَنْ ابْنِ هُبَيْرَةَ عَنْ أَبِي تَمِيمٍ الْجَيْشَانِيِّ عَنْ أَبِي بَصْرَةَ الْغِفَارِيِّ قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَصْرَ بِالْمُخَمَّصِ فَقَالَ إِنَّ هَذِهِ الصَّلَاةَ عُرِضَتْ عَلَى مَنْ كَانَ قَبْلَكُمْ فَضَيَّعُوهَا فَمَنْ حَافَظَ عَلَيْهَا كَانَ لَهُ أَجْرُهُ مَرَّتَيْنِ وَلَا صَلَاةَ بَعْدَهَا حَتَّى يَطْلُعَ الشَّاهِدُ وَالشَّاهِدُ النَّجْمُ."
      },
      {
        "id": 9492,
        "hadith_number": "1928",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah Shallallahu 'alaihi wasallam Mengimami Solat Asar",
        "perawi_melayu": "Diriwayatkan daripada Abu Basrah Al Ghifari berkata:",
        "english_text": "The Messenger of Allah led us in praying 'Asr\"  similar report (as no. 1927).",
        "malay_translation": "Rasulullah Shallallahu 'alaihi wasallam mengimami kami dalam solat Asar\" laporan yang serupa (seperti no. 1927).",
        "arabic_text": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبِي عَنْ ابْنِ إِسْحَقَ قَالَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ عَنْ خَيْرِ بْنِ نُعَيْمٍ الْحَضْرَمِيِّ عَنْ عَبْدِ اللَّهِ بْنِ هُبَيْرَةَ السَّبَائِيِّ وَكَانَ ثِقَةً عَنْ أَبِي تَمِيمٍ الْجَيْشَانِيِّ عَنْ أَبِي بَصْرَةَ الْغِفَارِيِّ قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَصْرَ بِمِثْلِهِ."
      },
      {
        "id": 9493,
        "hadith_number": "1929",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Solat dan Mengebumikan Jenazah pada Tiga Waktu",
        "perawi_melayu": "Uqba bin 'Amir رضی اللہ تعالیٰ عنہ berkata:",
        "english_text": "There were three times at which Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) forbade us to pray, or bury our dead: When the sun begins to rise till it is fully up, when the sun is at its height at midday till it passes over the meridian, and when the sun draws near to setting till it sets",
        "malay_translation": "Terdapat tiga waktu yang Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) melarang kami untuk solat, atau mengebumikan jenazah kami: Ketika matahari mulai terbit sehingga ia terbit sepenuhnya, ketika matahari berada tepat di tengah hari sehingga ia melewati garis meridian, dan ketika matahari hampir terbenam sehingga ia terbenam.",
        "arabic_text": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ مُوسَى بْنِ عُلَيٍّ عَنْ أَبِيهِ قَالَ سَمِعْتُ عُقْبَةَ بْنَ عَامِرٍ الْجُهَنِيَّ يَقُولُ ثَلَاثُ سَاعَاتٍ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَانَا أَنْ نُصَلِّيَ فِيهِنَّ أَوْ أَنْ نَقْبُرَ فِيهِنَّ مَوْتَانَا حِينَ تَطْلُعُ الشَّمْسُ بَازِغَةً حَتَّى تَرْتَفِعَ وَحِينَ يَقُومُ قَائِمُ الظَّهِيرَةِ حَتَّى تَمِيلَ الشَّمْسُ وَحِينَ تَضَيَّفُ الشَّمْسُ لِلْغُرُوبِ حَتَّى تَغْرُبَ."
      },
      {
        "id": 9494,
        "hadith_number": "1930",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Permulaan Keislaman 'Amr bin 'Abasa dan Ajaran tentang Solat dan Wuduk",
        "perawi_melayu": "Diriwayatkan oleh Amr bin 'Abasa Sulami رضی اللہ تعالیٰ عنہ:",
        "english_text": "In the state of the Ignorance (before embracing Islam), I used to think that the people were in error and they were not on anything (which may be called the right path) and worshipped the idols. Meanwhile, I heard of a man in Mecca who was giving news (on the basis of his prophetic knowledge); so I sat on my ride and went to him. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was at that time hiding as his people had made life hard for him. I adopted a friendly attitude (towards the Meccans and thus managed) to enter Mecca and go to him (the Holy Prophet) and I said to him: Who are you? He said: I am a Prophet (of Allah). I again said: Who is a Prophet? He said: (I am a Prophet in the sense that) I have been sent by Allah. I said: What is that which you have been sent with? He said: I have been sent to join ties of relationship (with kindness and affection), to break the Idols, and to proclaim the oneness of Allah (in a manner that) nothing is to be associated with Him. I said: Who is with you in this (in these beliefs and practices)? He said: A free man and a slave. He (the narrator) said: Abu Bakr and Bilal were there with him among those who had embraced Islam by that time. I said: I intend to follow you. He said: During these days you would not be able to do so. Don't you see the (hard) condition under which I and (my) people are living? You better go back to your people and when you hear that I have been granted victory, you come to me. So I went to my family. I was in my home when the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came to Medina. I was among my people and used to seek news and ask people when he arrived in Medina. Then a group of people belonging to Yathrib (Medina) came. I said (to them): How is that person getting on who has come to Medina? They said: The people are hastening to him, while his people (the polytheists of Mecca) planned to kill him, but they could not do so. I (on hearing it) came to Medina and went to him and said: Messenger of Allah, do you recognise me? He said: Yes, you are the same man who met me at Mecca. I said: It is so. I again said: Prophet of Allah, tell me that which Allah has taught you and which I do not know, tell me about the prayer. He said: Observe the dawn prayer, then stop praying when the sun is rising till it is fully up, for when it rises it comes up between the horns of Satan, and the unbelievers prostrate themselves to it at that time. Then pray, for the prayer is witnessed and attended (by angels) till the shadow becomes about the length of a lance; then cease prayer, for at that time Hell is heated up. Then when the shadow moves forward, pray, for the prayer is witnessed and attended by angels, till you pray the afternoon prayer, then cease prayer till the sun sets, for it sets between the horns of devil, and at that time the unbelievers prostrate themselves before it. I said: Apostle of Allah, tell me about ablution also. He said: None of you who uses water for ablution and rinses his mouth, snuffs up water and blows it, but the sins of his face, and his mouth and his nostrils fall out. When he washes his face, as Allah has commanded him, the sins of his face fall out from the end of his beard with water. Then (when) he washes his forearms up to the elbows, the sins of his arms fall out along with water from his finger-tips. And when he wipes his head, the sins of his head fall out from the points of his hair along with water. And (when) he washes his feet up to the ankles, the sins of his feet fall out from his toes along with water. And if he stands to pray and praises Allah, lauds Him and glorifies Him with what becomes Him and shows wholehearted devotion to Allah, his sins would depart leaving him (as innocent) as he was on the day his mother bore him. 'Amr b. 'Abasa narrated this hadith to Abu Umama رضی اللہ تعالیٰ عنہ, a Companion of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and Abu Umama رضی اللہ تعالیٰ عنہ said to him: 'Amr bin 'Abasa, think what you are saying that such (a great reward) is given to a man at one place (only in the act of ablution and prayer). Upon this 'Amr رضی اللہ تعالیٰ عنہ said: Abu Umama رضی اللہ تعالیٰ عنہ, I have grown old and my bones have become weak and I am at the door of death; what impetus is there for me to attribute a lie to Allah and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ )? Had I heard it from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) once, twice, or three times (even seven times), I would have never narrated it, but I have heard it from him on occasions more than these.",
        "malay_translation": "Pada zaman Jahiliyyah (sebelum memeluk Islam), saya dahulu beranggapan bahawa orang ramai berada dalam kesesatan dan mereka tidak berpegang pada apa-apa (yang boleh dianggap jalan yang benar) dan menyembah berhala. Sementara itu, saya mendengar tentang seorang lelaki di Makkah yang memberikan berita (berdasarkan pengetahuan kenabiannya); maka saya menunggang kenderaan saya dan pergi kepadanya. Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) pada masa itu bersembunyi kerana kaumnya telah menyukarkan hidup baginda. Saya mengambil sikap mesra (terhadap penduduk Makkah dan dengan itu berjaya) memasuki Makkah dan pergi kepadanya (Nabi Suci) dan saya berkata kepadanya: Siapakah kamu? Baginda bersabda: Saya seorang Nabi (Allah). Saya bertanya lagi: Siapakah Nabi itu? Baginda bersabda: (Saya seorang Nabi dalam erti kata) Saya telah diutus oleh Allah. Saya berkata: Apakah yang engkau diutus dengannya? Baginda bersabda: Saya telah diutus untuk menyambung tali persaudaraan (dengan kebaikan dan kasih sayang), untuk memecahkan berhala, dan untuk mengisytiharkan keesaan Allah (dengan cara) tiada sesuatu pun yang boleh disekutukan dengan-Nya. Saya berkata: Siapakah yang bersama engkau dalam hal ini (dalam kepercayaan dan amalan ini)? Baginda bersabda: Seorang lelaki merdeka dan seorang hamba. Perawi berkata: Abu Bakar dan Bilal bersama baginda di antara mereka yang telah memeluk Islam pada masa itu. Saya berkata: Saya berniat untuk mengikuti engkau. Baginda bersabda: Pada masa ini kamu tidak akan dapat berbuat demikian. Tidakkah kamu lihat keadaan (sukar) yang saya dan kaum saya sedang alami? Lebih baik kamu kembali kepada kaum kamu dan apabila kamu mendengar bahawa saya telah diberikan kemenangan, kamu datanglah kepada saya. Maka saya pun pulang ke keluarga saya. Saya berada di rumah saya ketika Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) datang ke Madinah. Saya berada di kalangan kaum saya dan biasa mencari berita dan bertanya kepada orang ramai apabila baginda tiba di Madinah. Kemudian sekumpulan orang yang berasal dari Yathrib (Madinah) datang. Saya berkata (kepada mereka): Bagaimana keadaan orang yang telah datang ke Madinah itu? Mereka berkata: Orang ramai bergegas kepadanya, manakala kaumnya (kaum musyrik Makkah) merancang untuk membunuhnya, tetapi mereka tidak dapat berbuat demikian. Saya (setelah mendengarnya) datang ke Madinah dan pergi kepadanya dan berkata: Wahai Rasulullah, adakah engkau mengenali saya? Baginda bersabda: Ya, kamu adalah orang yang sama yang bertemu saya di Makkah. Saya berkata: Benar. Saya berkata lagi: Wahai Nabi Allah, beritahu saya apa yang Allah telah ajarkan kepada engkau dan yang tidak saya ketahui, beritahu saya tentang solat. Baginda bersabda: Kerjakanlah solat subuh, kemudian berhenti solat ketika matahari sedang terbit sehingga ia naik sepenuhnya, kerana apabila ia terbit, ia terbit di antara dua tanduk syaitan, dan orang-orang kafir sujud kepadanya pada waktu itu. Kemudian solatlah, kerana solat itu disaksikan dan dihadiri (oleh malaikat) sehingga bayang-bayang menjadi kira-kira sepanjang tombak; kemudian berhentilah solat, kerana pada waktu itu neraka dipanaskan. Kemudian apabila bayang-bayang bergerak ke hadapan, solatlah, kerana solat itu disaksikan dan dihadiri oleh malaikat, sehingga kamu mengerjakan solat asar, kemudian berhentilah solat sehingga matahari terbenam, kerana ia terbenam di antara dua tanduk syaitan, dan pada waktu itu orang-orang kafir sujud kepadanya. Saya berkata: Wahai Rasulullah, beritahu saya tentang wuduk juga. Baginda bersabda: Tidak seorang pun di antara kamu yang menggunakan air untuk berwuduk dan berkumur, memasukkan air ke hidung dan menghembuskannya, melainkan dosa-dosa wajahnya, dan mulutnya dan hidungnya gugur. Apabila dia membasuh wajahnya, seperti yang diperintahkan Allah kepadanya, dosa-dosa wajahnya gugur dari hujung janggutnya bersama air. Kemudian (apabila) dia membasuh lengan bawahnya hingga ke siku, dosa-dosa lengannya gugur bersama air dari hujung jari-jarinya. Dan apabila dia menyapu kepalanya, dosa-dosa kepalanya gugur dari titik-titik rambutnya bersama air. Dan (apabila) dia membasuh kakinya hingga ke buku lali, dosa-dosa kakinya gugur dari jari-jari kakinya bersama air. Dan jika dia berdiri untuk solat dan memuji Allah, menyanjung-Nya dan mengagungkan-Nya dengan apa yang layak bagi-Nya dan menunjukkan ketaatan sepenuh hati kepada Allah, dosa-dosanya akan pergi meninggalkannya (sebersih) seperti keadaannya pada hari ibunya melahirkannya. 'Amr b. 'Abasa meriwayatkan hadis ini kepada Abu Umama رضی اللہ تعالیٰ عنہ, seorang Sahabat Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌), dan Abu Umama رضی اللہ تعالیٰ عنہ berkata kepadanya: 'Amr bin 'Abasa, fikirkan apa yang kamu katakan bahawa (pahala yang besar) diberikan kepada seseorang di satu tempat (hanya dalam perbuatan wuduk dan solat). Atas hal ini 'Amr رضی اللہ تعالیٰ عنہ berkata: Wahai Abu Umama رضی اللہ تعالیٰ عنہ, saya telah tua dan tulang-tulang saya telah menjadi lemah dan saya berada di ambang kematian; apa dorongan bagi saya untuk mengaitkan dusta kepada Allah dan Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌)? Sekiranya saya mendengarnya daripada Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) sekali, dua kali, atau tiga kali (malah tujuh kali), saya tidak akan pernah meriwayatkannya, tetapi saya telah mendengarnya daripada baginda pada lebih banyak kesempatan daripada ini.",
        "arabic_text": "حَدَّثَنِي أَحْمَدُ بْنُ جَعْفَرٍ الْمَعْقِرِيُّ حَدَّثَنَا النَّضْرُ بْنُ مُحَمَّدٍ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ حَدَّثَنَا شَدَّادُ بْنُ عَبْدِ اللَّهِ أَبُو عَمَّارٍ وَيَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ أَبِي أُمَامَةَ قَالَ عِكْرِمَةُ وَلَقِيَ شَدَّادٌ أَبَا أُمَامَةَ وَوَاثِلَةَ وَصَحِبَ أَنَسًا إِلَى الشَّامِ وَأَثْنَى عَلَيْهِ فَضْلًا وَخَيْرًا عَنْ أَبِي أُمَامَةَ قَالَ قَالَ عَمْرُو بْنُ عَبَسَةَ السُّلَمِيُّ كُنْتُ وَأَنَا فِي الْجَاهِلِيَّةِ أَظُنُّ أَنَّ النَّاسَ عَلَى ضَلَالَةٍ وَأَنَّهُمْ لَيْسُوا عَلَى شَيْءٍ وَهُمْ يَعْبُدُونَ الْأَوْثَانَ فَسَمِعْتُ بِرَجُلٍ بِمَكَّةَ يُخْبِرُ أَخْبَارًا فَقَعَدْتُ عَلَى رَاحِلَتِي فَقَدِمْتُ عَلَيْهِ فَإِذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُسْتَخْفِيًا جُرَءَاءُ عَلَيْهِ قَوْمُهُ فَتَلَطَّفْتُ حَتَّى دَخَلْتُ عَلَيْهِ بِمَكَّةَ فَقُلْتُ لَهُ مَا أَنْتَ قَالَ أَنَا نَبِيٌّ فَقُلْتُ وَمَا نَبِيٌّ قَالَ أَرْسَلَنِي اللَّهُ فَقُلْتُ وَبِأَيِّ شَيْءٍ أَرْسَلَكَ قَالَ أَرْسَلَنِي بِصِلَةِ الْأَرْحَامِ وَكَسْرِ الْأَوْثَانِ وَأَنْ يُوَحَّدَ اللَّهُ لَا يُشْرَكُ بِهِ شَيْءٌ قُلْتُ لَهُ فَمَنْ مَعَكَ عَلَى هَذَا قَالَ حُرٌّ وَعَبْدٌ قَالَ وَمَعَهُ يَوْمَئِذٍ أَبُو بَكْرٍ وَبِلَالٌ مِمَّنْ آمَنَ بِهِ فَقُلْتُ إِنِّي مُتَّبِعُكَ قَالَ إِنَّكَ لَا تَسْتَطِيعُ ذَلِكَ يَوْمَكَ هَذَا أَلَا تَرَى حَالِي وَحَالَ النَّاسِ وَلَكِنْ ارْجِعْ إِلَى أَهْلِكَ فَإِذَا سَمِعْتَ بِي قَدْ ظَهَرْتُ فَأْتِنِي قَالَ فَذَهَبْتُ إِلَى أَهْلِي وَقَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ وَكُنْتُ فِي أَهْلِي فَجَعَلْتُ أَتَخَبَّرُ الْأَخْبَارَ وَأَسْأَلُ النَّاسَ حِينَ قَدِمَ الْمَدِينَةَ حَتَّى قَدِمَ عَلَيَّ نَفَرٌ مِنْ أَهْلِ يَثْرِبَ مِنْ أَهْلِ الْمَدِينَةَ فَقُلْتُ مَا فَعَلَ هَذَا الرَّجُلُ الَّذِي قَدِمَ الْمَدِينَةَ فَقَالُوا النَّاسُ إِلَيْهِ سِرَاعٌ وَقَدْ أَرَادَ قَوْمُهُ قَتْلَهُ فَلَمْ يَسْتَطِيعُوا ذَلِكَ فَقَدِمْتُ الْمَدِينَةَ فَدَخَلْتُ عَلَيْهِ فَقُلْتُ يَا رَسُولَ اللَّهِ أَتَعْرِفُنِي قَالَ نَعَمْ أَنْتَ الَّذِي لَقِيتَنِي بِمَكَّةَ قَالَ فَقُلْتُ بَلَى فَقُلْتُ يَا نَبِيَّ اللَّهِ أَخْبِرْنِي عَمَّا عَلَّمَكَ اللَّهُ وَأَجْهَلُهُ أَخْبِرْنِي عَنْ الصَّلَاةِ قَالَ صَلِّ صَلَاةَ الصُّبْحِ ثُمَّ أَقْصِرْ عَنْ الصَّلَاةِ حَتَّى تَطْلُعَ الشَّمْسُ حَتَّى تَرْتَفِعَ فَإِنَّهَا تَطْلُعُ حِينَ تَطْلُعُ بَيْنَ قَرْنَيْ شَيْطَانٍ وَحِينَئِذٍ يَسْجُدُ لَهَا الْكُفَّارُ ثُمَّ صَلِّ فَإِنَّ الصَّلَاةَ مَشْهُودَةٌ مَحْضُورَةٌ حَتَّى يَسْتَقِلَّ الظِّلُّ بِالرُّمْحِ ثُمَّ أَقْصِرْ عَنْ الصَّلَاةِ فَإِنَّ حِينَئِذٍ تُسْجَرُ جَهَنَّمُ فَإِذَا أَقْبَلَ الْفَيْءُ فَصَلِّ فَإِنَّ الصَّلَاةَ مَشْهُودَةٌ مَحْضُورَةٌ حَتَّى تُصَلِّيَ الْعَصْرَ ثُمَّ أَقْصِرْ عَنْ الصَّلَاةِ حَتَّى تَغْرُبَ الشَّمْسُ فَإِنَّهَا تَغْرُبُ بَيْنَ قَرْنَيْ شَيْطَانٍ وَحِينَئِذٍ يَسْجُدُ لَهَا الْكُفَّارُ قَالَ فَقُلْتُ يَا نَبِيَّ اللَّهِ فَالْوُضُوءَ حَدِّثْنِي عَنْهُ قَالَ مَا مِنْكُمْ رَجُلٌ يُقَرِّبُ وَضُوءَهُ فَيَتَمَضْمَضُ وَيَسْتَنْشِقُ فَيَنْتَثِرُ إِلَّا خَرَّتْ خَطَايَا وَجْهِهِ وَفِيهِ وَخَيَاشِيمِهِ ثُمَّ إِذَا غَسَلَ وَجْهَهُ كَمَا أَمَرَهُ اللَّهُ إِلَّا خَرَّتْ خَطَايَا وَجْهِهِ مِنْ أَطْرَافِ لِحْيَتِهِ مَعَ الْمَاءِ ثُمَّ يَغْسِلُ يَدَيْهِ إِلَى الْمِرْفَقَيْنِ إِلَّا خَرَّتْ خَطَايَا يَدَيْهِ مِنْ أَنَامِلِهِ مَعَ الْمَاءِ ثُمَّ يَمْسَحُ رَأْسَهُ إِلَّا خَرَّتْ خَطَايَا رَأْسِهِ مِنْ أَطْرَافِ شَعْرِهِ مَعَ الْمَاءِ ثُمَّ يَغْسِلُ قَدَمَيْهِ إِلَى الْكَعْبَيْنِ إِلَّا خَرَّتْ خَطَايَا رِجْلَيْهِ مِنْ أَنَامِلِهِ مَعَ الْمَاءِ فَإِنْ هُوَ قَامَ فَصَلَّى فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ وَمَجَّدَهُ بِالَّذِي هُوَ لَهُ أَهْلٌ وَفَرَّغَ قَلْبَهُ لِلَّهِ إِلَّا انْصَرَفَ مِنْ خَطِيئَتِهِ كَهَيْئَتِهِ يَوْمَ وَلَدَتْهُ أُمُّهُ فَحَدَّثَ عَمْرُو بْنُ عَبَسَةَ بِهَذَا الْحَدِيثِ أَبَا أُمَامَةَ صَاحِبَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُ أَبُو أُمَامَةَ يَا عَمْرَو بْنَ عَبَسَةَ انْظُرْ مَا تَقُولُ فِي مَقَامٍ وَاحِدٍ يُعْطَى هَذَا الرَّجُلُ فَقَالَ عَمْرٌو يَا أَبَا أُمَامَةَ لَقَدْ كَبِرَتْ سِنِّي وَرَقَّ عَظْمِي وَاقْتَرَبَ أَجَلِي وَمَا بِي حَاجَةٌ أَنْ أَكْذِبَ عَلَى اللَّهِ وَلَا عَلَى رَسُولِ اللَّهِ لَوْ لَمْ أَسْمَعْهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا مَرَّةً أَوْ مَرَّتَيْنِ أَوْ ثَلَاثًا حَتَّى عَدَّ سَبْعَ مَرَّاتٍ مَا حَدَّثْتُ بِهِ أَبَدًا وَلَكِنِّي سَمِعْتُهُ أَكْثَرَ مِنْ ذَلِكَ."
      },
      {
        "id": 9495,
        "hadith_number": "1931",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kesalahfahaman Umar RA Terhadap Larangan Solat Ketika Matahari Terbit dan Terbenam",
        "perawi_melayu": "Diriwayatkan oleh A'isha رضی اللہ تعالیٰ عنہا:",
        "english_text": "'Umar رضی اللہ تعالیٰ عنہ misconstrued the fact that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had prohibited the observance of prayer at the time of the rising sun and at the time of its setting.",
        "malay_translation": "'Umar رضی اللہ تعالیٰ عنہ salah faham tentang fakta bahawa Rasulullah (صلی اللہ علیہ وسلم) telah melarang pelaksanaan solat pada waktu matahari terbit dan pada waktu matahari terbenam.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا بَهْزٌ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ طَاوُسٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّهَا قَالَتْ وَهِمَ عُمَرُ إِنَّمَا نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُتَحَرَّى طُلُوعُ الشَّمْسِ وَغُرُوبُهَا."
      },
      {
        "id": 9496,
        "hadith_number": "1932",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Solat Sunat Selepas Asar dan Penjelasan Waktu Solat yang Dilarang",
        "perawi_melayu": "A'isha رضی اللہ تعالیٰ عنہ berkata:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) did not abandon observing two rak'ahs after 'Asr, but she reported Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Do not get used to observe prayer at the time of the rising sun and at the time of its setting and (exhorted the Muslims) to pray at their times.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) tidak pernah meninggalkan untuk mengerjakan dua rakaat setelah solat Asar, tetapi beliau meriwayatkan bahawa Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Jangan membiasakan diri untuk mengerjakan solat pada waktu matahari terbit dan pada waktu matahari terbenam dan (menganjurkan umat Islam) untuk mengerjakan solat pada waktunya.",
        "arabic_text": "و حَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّهَا قَالَتْ لَمْ يَدَعْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ قَالَ فَقَالَتْ عَائِشَةُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَتَحَرَّوْا طُلُوعَ الشَّمْسِ وَلَا غُرُوبَهَا فَتُصَلُّوا عِنْدَ ذَلِكَ."
      },
      {
        "id": 9497,
        "hadith_number": "1933",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Penjelasan tentang Solat Dua Rakaat Selepas Asar dan Sebab Rasulullah SAW Melakukannya",
        "perawi_melayu": "Kuraib, bekas hamba Ibn 'Abbas, meriwayatkan bahawa 'Abdullah bin 'Abbas, 'Abd al-Rahman bin Azhar, al-Miswar bin Makhrama telah mengutusnya kepada 'A'isha رضی اللہ تعالیٰ عنہا , isteri Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم):",
        "english_text": "Telling him to give her their greetings, and ask her about the two rak'ahs after the afternoon prayer, (for) we have heard that you observe them whereas it has been conveyed to us that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) prohibited their observance. Ibn 'Abbas رضی اللہ تعالیٰ عنہ said: I along with 'Umar bin al-Khattab dissuaded people to do so (to observe two rak'ahs of prayer). Kuraib said: I went to her ('A'isha رضی اللہ تعالیٰ عنہا ) and conveyed to her the message with which I was sent. She said: (Better) ask Umm Salama. So I went to them (those who had sent him to Hadrat 'A'isha رضی اللہ تعالیٰ عنہا ) and informed them about what she had said. They sent me back to Umm Salama with that with which I was sent to 'A'isha. Umm Salama said: I beard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) prohibiting them, and then afterwards I saw him observing them. And when he observed them (two rak'ahs) he had already observed the 'Asr prayer. Then he (the Holy Prophet) came, while there were with me ladies of Banu Haram, a tribe of the Ansar and he (the Holy Prophet) observed them (the two rak'ahs). I sent a slave-girl to him asking her to stand by his side and say to him that Umm Salama says: Messenger of Allah, I heard you prohibiting these two rak'ahs, whereas I saw you observing them; and if he (the Holy Prophet) points with his hand (to wait), then do wait. The slave-girl did like that. He (the Holy Prophet) pointed out with his hand and she got aside and waited, and when he had finished (the prayer) he said: Daughter of Abu Umayya. you have asked about the two rak'ahs after the 'Asr prayer. Some people of 'Abu al-Qais came to me for embracing Islam and hindered me from observing the two rak'ahs which come after the noon prayer. So those are the two I have been praying.",
        "malay_translation": "Menyuruhnya menyampaikan salam mereka kepada beliau, dan bertanya kepadanya tentang dua rakaat selepas solat Asar, kerana kami mendengar bahawa kamu melakukannya sedangkan telah disampaikan kepada kami bahawa Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم) melarangnya. Ibn 'Abbas رضی اللہ تعالیٰ عنہ berkata: Saya bersama 'Umar bin al-Khattab melarang orang ramai daripada melakukan demikian (solat dua rakaat tersebut). Kuraib berkata: Saya pergi kepada beliau ('A'isha رضی اللہ تعالیٰ عنہا ) dan menyampaikan pesan yang diamanahkan kepada saya. Beliau berkata: Lebih baik kamu bertanya kepada Umm Salama. Lalu saya pergi kepada mereka (yang mengutus saya kepada Hadrat 'A'isha رضی اللہ تعالیٰ عنہا ) dan memberitahu mereka apa yang beliau katakan. Mereka mengutus saya kembali kepada Umm Salama dengan pesan yang sama seperti yang dihantar kepada 'A'isha. Umm Salama berkata: Saya mendengar Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم) melarangnya, tetapi kemudian saya melihat beliau melakukannya. Dan ketika beliau melakukannya (dua rakaat), beliau sudah pun selesai solat Asar. Kemudian beliau (Nabi Muhammad) datang, ketika itu ada bersama saya wanita-wanita dari Banu Haram, sebuah suku Ansar, dan beliau (Nabi Muhammad) melakukannya (dua rakaat). Saya menghantar seorang hamba perempuan kepadanya, menyuruhnya berdiri di sisinya dan berkata kepadanya bahawa Umm Salama berkata: Wahai Rasulullah, saya mendengar anda melarang dua rakaat ini, tetapi saya melihat anda melakukannya; dan jika beliau (Nabi Muhammad) memberi isyarat dengan tangan (untuk menunggu), maka tunggulah. Hamba perempuan itu melakukannya. Beliau (Nabi Muhammad) memberi isyarat dengan tangannya dan hamba perempuan itu menepi dan menunggu. Setelah beliau selesai solat, beliau berkata: Wahai puteri Abu Umayya, kamu bertanya tentang dua rakaat selepas solat Asar. Beberapa orang dari Abu al-Qais datang menemui saya untuk memeluk Islam dan menghalang saya daripada melakukan dua rakaat selepas solat Zuhur. Maka, itulah dua rakaat yang saya kerjakan.",
        "arabic_text": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو وَهُوَ ابْنُ الْحَارِثِ عَنْ بُكَيْرٍ عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ وَعَبْدَ الرَّحْمَنِ بْنَ أَزْهَرَ وَالْمِسْوَرَ بْنَ مَخْرَمَةَ أَرْسَلُوهُ إِلَى عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا اقْرَأْ عَلَيْهَا السَّلَامَ مِنَّا جَمِيعًا وَسَلْهَا عَنْ الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ وَقُلْ إِنَّا أُخْبِرْنَا أَنَّكِ تُصَلِّينَهُمَا وَقَدْ بَلَغَنَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهُمَا قَالَ ابْنُ عَبَّاسٍ وَكُنْتُ أَضْرِبُ مَعَ عُمَرَ بْنِ الْخَطَّابِ النَّاسَ عَلَيْهَا قَالَ كُرَيْبٌ فَدَخَلْتُ عَلَيْهَا وَبَلَّغْتُهَا مَا أَرْسَلُونِي بِهِ فَقَالَتْ سَلْ أُمَّ سَلَمَةَ فَخَرَجْتُ إِلَيْهِمْ فَأَخْبَرْتُهُمْ بِقَوْلِهَا فَرَدُّونِي إِلَى أُمِّ سَلَمَةَ بِمِثْلِ مَا أَرْسَلُونِي بِهِ إِلَى عَائِشَةَ فَقَالَتْ أُمُّ سَلَمَةَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْهُمَا ثُمَّ رَأَيْتُهُ يُصَلِّيهِمَا أَمَّا حِينَ صَلَّاهُمَا فَإِنَّهُ صَلَّى الْعَصْرَ ثُمَّ دَخَلَ وَعِنْدِي نِسْوَةٌ مِنْ بَنِي حَرَامٍ مِنْ الْأَنْصَارِ فَصَلَّاهُمَا فَأَرْسَلْتُ إِلَيْهِ الْجَارِيَةَ فَقُلْتُ قُومِي بِجَنْبِهِ فَقُولِي لَهُ تَقُولُ أُمُّ سَلَمَةَ يَا رَسُولَ اللَّهِ إِنِّي أَسْمَعُكَ تَنْهَى عَنْ هَاتَيْنِ الرَّكْعَتَيْنِ وَأَرَاكَ تُصَلِّيهِمَا فَإِنْ أَشَارَ بِيَدِهِ فَاسْتَأْخِرِي عَنْهُ قَالَ فَفَعَلَتْ الْجَارِيَةُ فَأَشَارَ بِيَدِهِ فَاسْتَأْخَرَتْ عَنْهُ فَلَمَّا انْصَرَفَ قَالَ يَا بِنْتَ أَبِي أُمَيَّةَ سَأَلْتِ عَنْ الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ إِنَّهُ أَتَانِي نَاسٌ مِنْ عَبْدِ الْقَيْسِ بِالْإِسْلَامِ مِنْ قَوْمِهِمْ فَشَغَلُونِي عَنْ الرَّكْعَتَيْنِ اللَّتَيْنِ بَعْدَ الظُّهْرِ فَهُمَا هَاتَانِ."
      },
      {
        "id": 9498,
        "hadith_number": "1934",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Dua Rakaat Sunat Selepas Asar",
        "perawi_melayu": "Abu Salama bertanya:",
        "english_text": "'A'isha رضی اللہ تعالیٰ عنہا about the two prostrations (i. e. rak'ahs) which the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) made after the 'Asr. She said: He (the Holy Prophet) observed them before the 'Asr prayer, but then he was hindered to do so, or he forgot them and then he observed them after the 'Asr, and then he continued observing them. (It was his habit) that when he (the Holy Prophet) observed prayer, he then continued observing it. Isma'il said: It implies that he always did that.",
        "malay_translation": "'A'isha رضی اللہ تعالیٰ عنہا meriwayatkan tentang dua sujud (iaitu rakaat) yang dilakukan oleh Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) selepas solat Asar. Beliau berkata: Baginda (Nabi Muhammad) melakukannya sebelum solat Asar, tetapi kemudian Baginda terhalang untuk melakukannya, atau Baginda terlupa dan kemudian Baginda melakukannya selepas solat Asar, dan kemudian Baginda terus melakukannya. (Adalah menjadi kebiasaan Baginda) bahawa apabila Baginda (Nabi Muhammad) melakukan solat, Baginda kemudian terus melakukannya. Isma'il berkata: Ini menunjukkan bahawa Baginda sentiasa melakukannya.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَعَلِيُّ بْنُ حُجْرٍ قَالَ ابْنُ أَيُّوبَ حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ جَعْفَرٍ أَخْبَرَنِي مُحَمَّدٌ وَهُوَ ابْنُ أَبِي حَرْمَلَةَ قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ أَنَّهُ سَأَلَ عَائِشَةَ عَنْ السَّجْدَتَيْنِ اللَّتَيْنِ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّيهِمَا بَعْدَ الْعَصْرِ فَقَالَتْ كَانَ يُصَلِّيهِمَا قَبْلَ الْعَصْرِ ثُمَّ إِنَّهُ شُغِلَ عَنْهُمَا أَوْ نَسِيَهُمَا فَصَلَّاهُمَا بَعْدَ الْعَصْرِ ثُمَّ أَثْبَتَهُمَا وَكَانَ إِذَا صَلَّى صَلَاةً أَثْبَتَهَا قَالَ يَحْيَى بْنُ أَيُّوبَ قَالَ إِسْمَعِيلُ تَعْنِي دَاوَمَ عَلَيْهَا."
      },
      {
        "id": 9499,
        "hadith_number": "1935",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah SAW Tidak Pernah Meninggalkan Solat Sunat Dua Rakaat Selepas Asar",
        "perawi_melayu": "Diriwayatkan oleh Aisyah:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) did not abandon at all observing two rak'ahs after the 'Asr in my house.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) tidak pernah meninggalkan langsung untuk mengerjakan dua rakaat setelah solat Asar di rumahku.",
        "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي جَمِيعًا عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ مَا تَرَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَيْنِ بَعْدَ الْعَصْرِ عِنْدِي قَطُّ."
      },
      {
        "id": 9500,
        "hadith_number": "1936",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Solat Sunat Rasulullah SAW di Rumah: Dua Rakaat Sebelum Subuh dan Selepas Asar",
        "perawi_melayu": "A'isha رضی اللہ تعالیٰ عنہا meriwayatkan:",
        "english_text": "Two are the prayers which the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) always observed in my house-openly or secretly-two rak'ahs before the dawn and two rak'ahs after the 'Asr.",
        "malay_translation": "Dua solat yang Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم) sentiasa kerjakan di rumah saya - secara terang-terangan atau sembunyi-sembunyi - dua rakaat sebelum fajar dan dua rakaat selepas Asar.",
        "arabic_text": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ ح و حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ وَاللَّفْظُ لَهُ أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ أَخْبَرَنَا أَبُو إِسْحَقَ الشَّيْبَانِيُّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ صَلَاتَانِ مَا تَرَكَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِي قَطُّ سِرًّا وَلَا عَلَانِيَةً رَكْعَتَيْنِ قَبْلَ الْفَجْرِ وَرَكْعَتَيْنِ بَعْدَ الْعَصْرِ."
      },
      {
        "id": 9501,
        "hadith_number": "1937",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Solat Sunat Dua Rakaat Selepas Asar Nabi ﷺ",
        "perawi_melayu": "Diriwayatkan oleh Aswad dan Masruq:",
        "english_text": "We bear testimony to the fact that 'A'isha رضی اللہ تعالیٰ عنہا said: Never was there a day that he (the Holy Prophet) was with me and he did not observe two rak'ahs of prayer in my house, i.e. two rak'ahs after the Asr.",
        "malay_translation": "Kami bersaksi terhadap fakta bahawa 'A'isha رضی اللہ تعالیٰ عنہا berkata: Tidak pernah ada sehari pun baginda (Nabi Suci) bersama saya dan baginda tidak menunaikan dua rakaat solat di rumah saya, iaitu dua rakaat selepas Asar.",
        "arabic_text": "و حَدَّثَنَا ابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ وَمَسْرُوقٍ قَالَا نَشْهَدُ عَلَى عَائِشَةَ أَنَّهَا قَالَتْ مَا كَانَ يَوْمُهُ الَّذِي كَانَ يَكُونُ عِنْدِي إِلَّا صَلَّاهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِي تَعْنِي الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ."
      },
      {
        "id": 9502,
        "hadith_number": "1938",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Solat Sunat Selepas Asar dan Sebelum Maghrib: Amalan Sahabat dan Pandangan Nabi",
        "perawi_melayu": "Mukhtar bin Fulful berkata:",
        "english_text": "I asked Anas bin Malik رضی اللہ تعالیٰ عنہ about the voluntary prayers after the afternoon prayer, and he replied: 'Umar رضی اللہ تعالیٰ عنہ struck hit hands on prayer observed after the 'Asr prayer and we used to observe two rak'ahs after the sun set before the evening prayer during the time of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). I said to him: Did the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observe them? He said: He saw us observing them, but he neither commanded us nor forbade us to do so.",
        "malay_translation": "Saya bertanya kepada Anas bin Malik رضی اللہ تعالیٰ عنہ tentang solat sunat selepas solat Asar, dan beliau menjawab: 'Umar رضی اللہ تعالیٰ عنہ melarang solat yang dilakukan selepas solat Asar, dan kami biasa mengerjakan dua rakaat selepas matahari terbenam sebelum solat Maghrib pada zaman Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). Saya bertanya kepadanya: Adakah Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) mengerjakannya? Beliau berkata: Baginda melihat kami mengerjakannya, tetapi Baginda tidak memerintahkan kami dan tidak juga melarang kami melakukannya.",
        "arabic_text": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ جَمِيعًا عَنْ ابْنِ فُضَيْلٍ قَالَ أَبُو بَكْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ مُخْتَارِ بْنِ فُلْفُلٍ قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ عَنْ التَّطَوُّعِ بَعْدَ الْعَصْرِ فَقَالَ كَانَ عُمَرُ يَضْرِبُ الْأَيْدِي عَلَى صَلَاةٍ بَعْدَ الْعَصْرِ وَكُنَّا نُصَلِّي عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَيْنِ بَعْدَ غُرُوبِ الشَّمْسِ قَبْلَ صَلَاةِ الْمَغْرِبِ فَقُلْتُ لَهُ أَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّاهُمَا قَالَ كَانَ يَرَانَا نُصَلِّيهِمَا فَلَمْ يَأْمُرْنَا وَلَمْ يَنْهَنَا."
      },
      {
        "id": 9503,
        "hadith_number": "1939",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kebiasaan Solat Sunat Dua Rakaat Sebelum Maghrib di Madinah",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik رضی اللہ تعالیٰ عنہ:",
        "english_text": "When we were in Medina, the moment the Mu'adhdhin made the call to the sunset prayer, the people hastened to the pillars of the mosque and prayed two rak'ahs with the result that any stranger coming into the mosque would think that the obligatory prayer had been observed owing to the number who were praying then.",
        "malay_translation": "Ketika kami berada di Madinah, sebaik sahaja Mu'adhdhin melaungkan azan untuk solat Maghrib, orang ramai bergegas ke tiang-tiang masjid dan menunaikan solat dua rakaat sehingga sesiapa sahaja yang datang ke masjid akan menyangka solat fardhu telah didirikan kerana ramainya orang yang sedang solat ketika itu.",
        "arabic_text": "و حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ عَبْدِ الْعَزِيزِ وَهُوَ ابْنُ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كُنَّا بِالْمَدِينَةِ فَإِذَا أَذَّنَ الْمُؤَذِّنُ لِصَلَاةِ الْمَغْرِبِ ابْتَدَرُوا السَّوَارِيَ فَيَرْكَعُونَ رَكْعَتَيْنِ رَكْعَتَيْنِ حَتَّى إِنَّ الرَّجُلَ الْغَرِيبَ لَيَدْخُلُ الْمَسْجِدَ فَيَحْسِبُ أَنَّ الصَّلَاةَ قَدْ صُلِّيَتْ مِنْ كَثْرَةِ مَنْ يُصَلِّيهِمَا."
      },
      {
        "id": 9504,
        "hadith_number": "1940",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Solat Sunat Antara Azan dan Iqamah",
        "perawi_melayu": "Abdullah bin Mughaffal رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) u saying: There Is between the two calls (Adhan and Iqama) a prayer. And he mentioned it three times, and at the third time he said: This applies to those who wish to do it.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Antara dua panggilan (Azan dan Iqamah) ada solat. Dan baginda menyebutnya tiga kali, dan pada kali ketiga baginda bersabda: Ini terpakai bagi mereka yang ingin melakukannya.",
        "arabic_text": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ وَوَكِيعٌ عَنْ كَهْمَسٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ الْمُزَنِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ كُلِّ أَذَانَيْنِ صَلَاةٌ قَالَهَا ثَلَاثًا قَالَ فِي الثَّالِثَةِ لِمَنْ شَاءَ."
      },
      {
        "id": 9505,
        "hadith_number": "1941",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pilihan Selepas Kali Keempat",
        "perawi_melayu": "Hadith ini diriwayatkan oleh Abdullah bin Mughaffal رضی اللہ تعالیٰ عنہ melalui sanad yang lain, tetapi dengan variasi ini:",
        "english_text": "He (the Holy Prophet) said at the fourth time: He who wishes (may do to).",
        "malay_translation": "Baginda (Nabi Suci) bersabda pada kali keempat: Sesiapa yang mahu (boleh melakukan).",
        "arabic_text": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ الْجُرَيْرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ إِلَّا أَنَّهُ قَالَ فِي الرَّابِعَةِ لِمَنْ شَاءَ."
      },
      {
        "id": 9506,
        "hadith_number": "1942",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Solat Khauf: Rasulullah Memimpin Dua Kumpulan",
        "perawi_melayu": "Salim bin Abdullah bin 'Umar رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "The Messenger of Allah (ﷺ) led on of the two groups In one rak'ah of prayer in danger, while the other group faced the -enemy. Then they (the members of the first group) went back and replaced their companions who were facing the enemy. and then they (the members of the second group) came and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) led them in one rak'ah of prayer. Then the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) pronounced salutation, and then they (the members of the Ant group) completed the rak'ah and they (the members of the second group) completed the rak'ah.",
        "malay_translation": "Rasulullah (ﷺ) memimpin salah satu daripada dua kumpulan dalam satu rakaat solat dalam keadaan bahaya, sementara kumpulan yang lain menghadap musuh. Kemudian mereka (anggota kumpulan pertama) kembali dan menggantikan sahabat mereka yang sedang menghadap musuh. Kemudian mereka (anggota kumpulan kedua) datang dan Rasulullah (ﷺ) memimpin mereka dalam satu rakaat solat. Kemudian Rasulullah (ﷺ) mengucapkan salam, dan kemudian mereka (anggota kumpulan pertama) menyempurnakan rakaat dan mereka (anggota kumpulan kedua) menyempurnakan rakaat.",
        "arabic_text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ قَالَ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْخَوْفِ بِإِحْدَى الطَّائِفَتَيْنِ رَكْعَةً وَالطَّائِفَةُ الْأُخْرَى مُوَاجِهَةُ الْعَدُوِّ ثُمَّ انْصَرَفُوا وَقَامُوا فِي مَقَامِ أَصْحَابِهِمْ مُقْبِلِينَ عَلَى الْعَدُوِّ وَجَاءَ أُولَئِكَ ثُمَّ صَلَّى بِهِمْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَةً ثُمَّ سَلَّمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَضَى هَؤُلَاءِ رَكْعَةً وَهَؤُلَاءِ رَكْعَةً."
      },
      {
        "id": 9507,
        "hadith_number": "1943",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Solat dalam Keadaan Ketakutan",
        "perawi_melayu": "Diriwayatkan dari Salim bin Abdullah bin Umar bahawa bapanya:",
        "english_text": "He used to narrate concerning the messenger of Allah at times of fear, and he said: \"We prayed in this manner in the Messenger of Allah ﷺ.\"",
        "malay_translation": "Dia pernah meriwayatkan mengenai Rasulullah SAW pada waktu-waktu ketakutan, dan dia berkata: \"Kami solat dengan cara ini bersama Rasulullah SAW.\"",
        "arabic_text": "و حَدَّثَنِيهِ أَبُو الرَّبِيعِ الزَّهْرَانِيُّ حَدَّثَنَا فُلَيْحٌ عَنْ الزُّهْرِيِّ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ أَنَّهُ كَانَ يُحَدِّثُ عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْخَوْفِ وَيَقُولُ صَلَّيْتُهَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْمَعْنَى."
      },
      {
        "id": 9508,
        "hadith_number": "1944",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Solat dalam Keadaan Bahaya",
        "perawi_melayu": "Diriwayatkan oleh Ibn Umar رضی اللہ تعالیٰ عنہ:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed prayer in danger on some day (in this way): a group stood with him (the Holy Prophet) (for prayer) and the other group stood In front of the enemy. Then those who were with (him) observed one rak'ah of prayer and they went back and the others came and they observed one rak'ah (with him). Then both the groups completed one rak'ah each. Ibn Umar رضی اللہ تعالیٰ عنہ said: When there is greater danger, then observe prayer even on the ride or with the help of gestures in a standing posture.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) pernah mengerjakan solat dalam keadaan bahaya pada suatu hari (dengan cara ini): Sekumpulan berdiri bersama baginda (Nabi Muhammad) (untuk solat) dan kumpulan lain berdiri di hadapan musuh. Kemudian mereka yang bersama baginda mengerjakan satu rakaat solat dan mereka berundur, lalu yang lain datang dan mereka mengerjakan satu rakaat (bersama baginda). Kemudian kedua-dua kumpulan menyempurnakan satu rakaat masing-masing. Ibn Umar رضی اللہ تعالیٰ عنہ berkata: Apabila ada bahaya yang lebih besar, maka kerjakanlah solat walaupun sambil berkendaraan atau dengan isyarat ketika berdiri.",
        "arabic_text": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ سُفْيَانَ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْخَوْفِ فِي بَعْضِ أَيَّامِهِ فَقَامَتْ طَائِفَةٌ مَعَهُ وَطَائِفَةٌ بِإِزَاءِ الْعَدُوِّ فَصَلَّى بِالَّذِينَ مَعَهُ رَكْعَةً ثُمَّ ذَهَبُوا وَجَاءَ الْآخَرُونَ فَصَلَّى بِهِمْ رَكْعَةً ثُمَّ قَضَتْ الطَّائِفَتَانِ رَكْعَةً رَكْعَةً قَالَ وَقَالَ ابْنُ عُمَرَ فَإِذَا كَانَ خَوْفٌ أَكْثَرَ مِنْ ذَلِكَ فَصَلِّ رَاكِبًا أَوْ قَائِمًا تُومِئُ إِيمَاءً."
      },
      {
        "id": 9509,
        "hadith_number": "1945",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Solat dalam Keadaan Bahaya",
        "perawi_melayu": "Diriwayatkan oleh Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ:",
        "english_text": "I observed prayer in danger with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). We drew ourselves up in two rows, one row behind him with the enemy between us and the Qibla. The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Allah is Most Great, and we all said it. He then bowed and we all bowed. He then raised his head from bowing, we all raised (our heads). He then went down in prostration along with the row close to him, and the rear row faced the enemy; then when the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) completed the prostration, ; and then stood up, the row near to him also did it; then went down the rear row in prostration; then they stood up; then the rear row went to the front and the front row went to the rear. Then the Messenger of Allah (may peace he upon him) bowed down and we all bowed. He then raised his head from bowing and we also raised (our heads). He and the row close to him which I had been in the rear then went down in prostration In the first rak'ah, whereas the rear row faced the enemy. And when the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and the rear row close to him had finished the prostration, the rear row went down and prostrated themselves; then the Messenger of Allah pronounced the salutation and we also pronounced the salutation. (Jabir رضی اللہ تعالیٰ عنہ said we hadith) as your guards behave with their chiefs.",
        "malay_translation": "Saya telah menunaikan solat dalam keadaan bahaya bersama Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم‌). Kami berbaris dalam dua saf, satu saf di belakang baginda dengan musuh berada di antara kami dan Kiblat. Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم‌) bersabda: Allah Maha Besar, dan kami semua mengucapkannya. Kemudian baginda rukuk dan kami semua rukuk. Kemudian baginda mengangkat kepala dari rukuk, kami semua mengangkat (kepala kami). Kemudian baginda sujud bersama saf yang dekat dengan baginda, dan saf belakang menghadap musuh; kemudian apabila Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم‌) selesai sujud, dan kemudian berdiri, saf yang dekat dengan baginda juga melakukannya; kemudian saf belakang sujud; kemudian mereka berdiri; kemudian saf belakang pergi ke hadapan dan saf depan pergi ke belakang. Kemudian Rasulullah (semoga selawat dan salam ke atasnya) rukuk dan kami semua rukuk. Kemudian baginda mengangkat kepala dari rukuk dan kami juga mengangkat (kepala kami). Baginda dan saf yang dekat dengan baginda yang saya berada di saf belakang kemudian sujud dalam rakaat pertama, sedangkan saf belakang menghadap musuh. Dan apabila Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم‌) dan saf belakang yang dekat dengan baginda telah selesai sujud, saf belakang sujud; kemudian Rasulullah mengucapkan salam dan kami juga mengucapkan salam. (Jabir رضی اللہ تعالیٰ عنہ berkata kami hadith) seperti pengawal kamu berkelakuan dengan ketua mereka.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ عَنْ عَطَاءٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ شَهِدْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْخَوْفِ فَصَفَّنَا صَفَّيْنِ صَفٌّ خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْعَدُوُّ بَيْنَنَا وَبَيْنَ الْقِبْلَةِ فَكَبَّرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَبَّرْنَا جَمِيعًا ثُمَّ رَكَعَ وَرَكَعْنَا جَمِيعًا ثُمَّ رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ وَرَفَعْنَا جَمِيعًا ثُمَّ انْحَدَرَ بِالسُّجُودِ وَالصَّفُّ الَّذِي يَلِيهِ وَقَامَ الصَّفُّ الْمُؤَخَّرُ فِي نَحْرِ الْعَدُوِّ فَلَمَّا قَضَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السُّجُودَ وَقَامَ الصَّفُّ الَّذِي يَلِيهِ انْحَدَرَ الصَّفُّ الْمُؤَخَّرُ بِالسُّجُودِ وَقَامُوا ثُمَّ تَقَدَّمَ الصَّفُّ الْمُؤَخَّرُ وَتَأَخَّرَ الصَّفُّ الْمُقَدَّمُ ثُمَّ رَكَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَكَعْنَا جَمِيعًا ثُمَّ رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ وَرَفَعْنَا جَمِيعًا ثُمَّ انْحَدَرَ بِالسُّجُودِ وَالصَّفُّ الَّذِي يَلِيهِ الَّذِي كَانَ مُؤَخَّرًا فِي الرَّكْعَةِ الْأُولَى وَقَامَ الصَّفُّ الْمُؤَخَّرُ فِي نُحُورِ الْعَدُوِّ فَلَمَّا قَضَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السُّجُودَ وَالصَّفُّ الَّذِي يَلِيهِ انْحَدَرَ الصَّفُّ الْمُؤَخَّرُ بِالسُّجُودِ فَسَجَدُوا ثُمَّ سَلَّمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَلَّمْنَا جَمِيعًا قَالَ جَابِرٌ كَمَا يَصْنَعُ حَرَسُكُمْ هَؤُلَاءِ بِأُمَرَائِهِمْ."
      },
      {
        "id": 9510,
        "hadith_number": "1946",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Solat dalam Keadaan Perang dan Pendedahan Rancangan Musuh",
        "perawi_melayu": "Jabir رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "We fought In the company of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) with the tribe of Juhaina. They fought with us terribly. When we had finished the noon prayer, the polytheists said: Had we attacked them at once. we would have killed them. Gabriel informed the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) about It (about their evil design). The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) made a mention of it to us, adding that they (the polytheists) had also said: Shortly there would be time for the 'Asr prayer. which is dearer o them (the Muslims) than even their children. So when the time of the 'Asr prayer came. we formed ourselves into two rows, while the polytheists were between us and the Qibla. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Allah is Most Great, and we also said so. He bowed and we also bowed. He went down in prostration and the first row prostrated along with him. When they stood up, the second row went down in prostration. Then the first row went into the rear, and the second row came in the front and occupied the place of the first row. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) then said: Allah is Most Great, and we also said so. He then bowed, and we also bowed. He then went down in prostration and along with him the row also (went down in prostration), and the second row remained standing. And when the second row had also prostrated and all of them sat down then the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) pronounced salutation to them. Abu Zubair said: Jabir رضی اللہ تعالیٰ عنہ made a mention specially of this thing: just as your chiefs observe prayer.",
        "malay_translation": "Kami berperang bersama Rasulullah (صلی اللہ علیہ وسلم) dengan suku Juhaina. Mereka berperang dengan kami dengan dahsyat. Apabila kami selesai solat Zuhur, kaum musyrikin berkata: Sekiranya kami menyerang mereka sekaligus, pasti kami akan membunuh mereka. Jibril memberitahu Rasulullah (صلی اللہ علیہ وسلم) tentang hal itu (tentang rancangan jahat mereka). Rasulullah (صلی اللہ علیہ وسلم) menyebutkan hal itu kepada kami, sambil menambah bahawa mereka (kaum musyrikin) juga berkata: Sebentar lagi akan tiba waktu solat Asar, yang lebih mereka (umat Islam) cintai daripada anak-anak mereka sendiri. Maka apabila tiba waktu solat Asar, kami membentuk diri kami menjadi dua baris, sementara kaum musyrikin berada di antara kami dan Kiblat. Rasulullah (صلی اللہ علیہ وسلم) bersabda: Allah Maha Besar, dan kami juga berkata demikian. Baginda rukuk dan kami juga rukuk. Baginda sujud dan barisan pertama sujud bersama baginda. Apabila mereka berdiri, barisan kedua sujud. Kemudian barisan pertama pergi ke belakang, dan barisan kedua datang ke depan dan menduduki tempat barisan pertama. Rasulullah (صلی اللہ علیہ وسلم) kemudian bersabda: Allah Maha Besar, dan kami juga berkata demikian. Baginda kemudian rukuk, dan kami juga rukuk. Baginda kemudian sujud dan bersama baginda barisan itu juga (sujud), dan barisan kedua tetap berdiri. Dan apabila barisan kedua juga telah sujud dan kesemua mereka duduk maka Rasulullah (صلی اللہ علیہ وسلم) mengucapkan salam kepada mereka. Abu Zubair berkata: Jabir رضی اللہ تعالیٰ عنہ menyebutkan secara khusus tentang perkara ini: sama seperti ketua-ketua kamu menunaikan solat.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَ غَزَوْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَوْمًا مِنْ جُهَيْنَةَ فَقَاتَلُونَا قِتَالًا شَدِيدًا فَلَمَّا صَلَّيْنَا الظُّهْرَ قَالَ الْمُشْرِكُونَ لَوْ مِلْنَا عَلَيْهِمْ مَيْلَةً لَاقْتَطَعْنَاهُمْ فَأَخْبَرَ جِبْرِيلُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَلِكَ فَذَكَرَ ذَلِكَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَقَالُوا إِنَّهُ سَتَأْتِيهِمْ صَلَاةٌ هِيَ أَحَبُّ إِلَيْهِمْ مِنْ الْأَوْلَادِ فَلَمَّا حَضَرَتْ الْعَصْرُ قَالَ صَفَّنَا صَفَّيْنِ وَالْمُشْرِكُونَ بَيْنَنَا وَبَيْنَ الْقِبْلَةِ قَالَ فَكَبَّرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَبَّرْنَا وَرَكَعَ فَرَكَعْنَا ثُمَّ سَجَدَ وَسَجَدَ مَعَهُ الصَّفُّ الْأَوَّلُ فَلَمَّا قَامُوا سَجَدَ الصَّفُّ الثَّانِي ثُمَّ تَأَخَّرَ الصَّفُّ الْأَوَّلُ وَتَقَدَّمَ الصَّفُّ الثَّانِي فَقَامُوا مَقَامَ الْأَوَّلِ فَكَبَّرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَبَّرْنَا وَرَكَعَ فَرَكَعْنَا ثُمَّ سَجَدَ مَعَهُ الصَّفُّ الْأَوَّلُ وَقَامَ الثَّانِي فَلَمَّا سَجَدَ الصَّفُّ الثَّانِي ثُمَّ جَلَسُوا جَمِيعًا سَلَّمَ عَلَيْهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو الزُّبَيْرِ ثُمَّ خَصَّ جَابِرٌ أَنْ قَالَ كَمَا يُصَلِّي أُمَرَاؤُكُمْ هَؤُلَاءِ."
      },
      {
        "id": 9511,
        "hadith_number": "1947",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Solat dalam Keadaan Bahaya",
        "perawi_melayu": "Diriwayatkan dari Sahl bin Abu Hathma رضی اللہ تعالیٰ عنہ:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) led his Companions in prayer in danger. He made them stand in two rows behind him. He led them who were close to him in one rak'ah. He then stood up and kept standing till those who were behind them observed one rak'ah. Then they (those standing in the second row) came in front and those who were in front went into the rear. He then led them In one rak'ah. He then sat down, till those who were behind him observed one rak'ah and then pronounced salutation.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) memimpin para Sahabatnya dalam solat ketika dalam keadaan bahaya. Baginda menjadikan mereka berdiri dalam dua saf di belakangnya. Baginda memimpin mereka yang dekat dengannya dalam satu rakaat. Kemudian Baginda berdiri dan terus berdiri sehingga mereka yang berada di belakang mereka melakukan satu rakaat. Kemudian mereka (yang berdiri di saf kedua) datang ke depan dan mereka yang di depan pergi ke belakang. Kemudian Baginda memimpin mereka dalam satu rakaat. Kemudian Baginda duduk, sehingga mereka yang berada di belakangnya melakukan satu rakaat dan kemudian mengucapkan salam.",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ صَالِحِ بْنِ خَوَّاتِ بْنِ جُبَيْرٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِأَصْحَابِهِ فِي الْخَوْفِ فَصَفَّهُمْ خَلْفَهُ صَفَّيْنِ فَصَلَّى بِالَّذِينَ يَلُونَهُ رَكْعَةً ثُمَّ قَامَ فَلَمْ يَزَلْ قَائِمًا حَتَّى صَلَّى الَّذِينَ خَلْفَهُمْ رَكْعَةً ثُمَّ تَقَدَّمُوا وَتَأَخَّرَ الَّذِينَ كَانُوا قُدَّامَهُمْ فَصَلَّى بِهِمْ رَكْعَةً ثُمَّ قَعَدَ حَتَّى صَلَّى الَّذِينَ تَخَلَّفُوا رَكْعَةً ثُمَّ سَلَّمَ."
      },
      {
        "id": 9512,
        "hadith_number": "1948",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Solat dalam Keadaan Bahaya",
        "perawi_melayu": "Yazid bin Ruman meriwayatkan daripada Salih bin Khawwat daripada seorang yang solat dalam keadaan bahaya bersama Rasulullah (ﷺ) dalam Peperangan Dhat ar-Riqa' bahawa:",
        "english_text": "A group formed a row and prayed along with him, and a group faced the enemy. He led the group which was along with him in a rak'ah, then remained standing while they finished the prayer by themselves. Then they departed and formed a row facing the enemy. Then the second group came and he led them in the remaining rak'ah, after which he remained seated while they finished the prayer themselves. He then led them in salutation.",
        "malay_translation": "Sekumpulan membentuk saf dan solat bersamanya, dan sekumpulan menghadap musuh. Baginda memimpin kumpulan yang bersamanya dalam satu rakaat, kemudian berdiri sementara mereka menyelesaikan solat sendiri. Kemudian mereka pergi dan membentuk saf menghadap musuh. Kemudian kumpulan kedua datang dan baginda memimpin mereka dalam rakaat yang tinggal, selepas itu baginda duduk sementara mereka menyelesaikan solat sendiri. Kemudian baginda memimpin mereka dalam memberi salam.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ يَزِيدَ بْنِ رُومَانَ عَنْ صَالِحِ بْنِ خَوَّاتٍ عَمَّنْ صَلَّى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ ذَاتِ الرِّقَاعِ صَلَاةَ الْخَوْفِ أَنَّ طَائِفَةً صَفَّتْ مَعَهُ وَطَائِفَةٌ وِجَاهَ الْعَدُوِّ فَصَلَّى بِالَّذِينَ مَعَهُ رَكْعَةً ثُمَّ ثَبَتَ قَائِمًا وَأَتَمُّوا لِأَنْفُسِهِمْ ثُمَّ انْصَرَفُوا فَصَفُّوا وِجَاهَ الْعَدُوِّ وَجَاءَتْ الطَّائِفَةُ الْأُخْرَى فَصَلَّى بِهِمْ الرَّكْعَةَ الَّتِي بَقِيَتْ ثُمَّ ثَبَتَ جَالِسًا وَأَتَمُّوا لِأَنْفُسِهِمْ ثُمَّ سَلَّمَ بِهِمْ."
      },
      {
        "id": 9513,
        "hadith_number": "1949",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keberanian Rasulullah dan Solat Khauf di Dzat ar-Riqa'",
        "perawi_melayu": "Jabir رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "We went forward with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and when we reached Dhat ar-Riqa', we came to a shady tree which -we left for him One of the polytheists came there and, seeing the sword of the Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) hanging by a free. took it up. drew it from the scabbard and said to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ): Are you afraid of Me? He (the Holy Prophet) said: No. He again said: Who would protect you from me? He said: Allah will protect me from you. The Companions of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) threatened him. He sheathed the sword and hung it up. Then call to prayer was made and he (the Holy Prophet) led a group in two rak'ah. Then (the members of this group) withdrew and he led the second group in two rak'ah. So the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed four rak'ah and people observed two rak'ah.",
        "malay_translation": "Kami bergerak maju bersama Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم‌) dan ketika kami sampai di Dzat ar-Riqa', kami tiba di sebuah pohon rindang yang kami tinggalkan untuk baginda. Seorang musyrik datang ke sana dan, melihat pedang Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم‌) tergantung di pohon, mengambilnya, menghunusnya dari sarung dan berkata kepada Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم‌): Adakah kamu takut kepada saya? Baginda (Nabi Suci) berkata: Tidak. Dia berkata lagi: Siapa yang akan melindungi kamu dari saya? Baginda berkata: Allah akan melindungi saya dari kamu. Para Sahabat Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم‌) mengancamnya. Dia menyarungkan pedang dan menggantungkannya kembali. Kemudian azan dikumandangkan dan baginda (Nabi Suci) memimpin satu kelompok dalam dua rakaat. Kemudian (anggota kelompok ini) berundur dan baginda memimpin kelompok kedua dalam dua rakaat. Jadi Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم‌) mengerjakan empat rakaat dan orang ramai mengerjakan dua rakaat.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَفَّانُ حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ جَابِرٍ قَالَ أَقْبَلْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى إِذَا كُنَّا بِذَاتِ الرِّقَاعِ قَالَ كُنَّا إِذَا أَتَيْنَا عَلَى شَجَرَةٍ ظَلِيلَةٍ تَرَكْنَاهَا لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَجَاءَ رَجُلٌ مِنْ الْمُشْرِكِينَ وَسَيْفُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُعَلَّقٌ بِشَجَرَةٍ فَأَخَذَ سَيْفَ نَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاخْتَرَطَهُ فَقَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَخَافُنِي قَالَ لَا قَالَ فَمَنْ يَمْنَعُكَ مِنِّي قَالَ اللَّهُ يَمْنَعُنِي مِنْكَ قَالَ فَتَهَدَّدَهُ أَصْحَابُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَغْمَدَ السَّيْفَ وَعَلَّقَهُ قَالَ فَنُودِيَ بِالصَّلَاةِ فَصَلَّى بِطَائِفَةٍ رَكْعَتَيْنِ ثُمَّ تَأَخَّرُوا وَصَلَّى بِالطَّائِفَةِ الْأُخْرَى رَكْعَتَيْنِ قَالَ فَكَانَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعُ رَكَعَاتٍ وَلِلْقَوْمِ رَكْعَتَانِ."
      },
      {
        "id": 9514,
        "hadith_number": "1950",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Solat dalam Keadaan Bahaya",
        "perawi_melayu": "Abu Salama bin 'Abdul-Rahman meriwayatkan bahawa Jabir رضی اللہ تعالیٰ عنہ memberitahunya:",
        "english_text": "He had observed the prayer in danger with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) (first) led one of the two groups in two rak'ah of prayer. and then led the second group in two rak'ah of prayer. So the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed four rak'ah and led in two rak'ah each of the groups.",
        "malay_translation": "Beliau telah menunaikan solat dalam keadaan bahaya bersama Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم). Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم) (pertama) memimpin salah satu daripada dua kumpulan dalam dua rakaat solat, dan kemudian memimpin kumpulan kedua dalam dua rakaat solat. Maka Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم) menunaikan empat rakaat dan memimpin dalam dua rakaat setiap kumpulan.",
        "arabic_text": "و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ أَخْبَرَنَا يَحْيَى يَعْنِي ابْنَ حَسَّانَ حَدَّثَنَا مُعَاوِيَةُ وَهُوَ ابْنُ سَلَّامٍ أَخْبَرَنِي يَحْيَى أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ جَابِرًا أَخْبَرَهُ أَنَّهُ صَلَّى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْخَوْفِ فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِإِحْدَى الطَّائِفَتَيْنِ رَكْعَتَيْنِ ثُمَّ صَلَّى بِالطَّائِفَةِ الْأُخْرَى رَكْعَتَيْنِ فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعَ رَكَعَاتٍ وَصَلَّى بِكُلِّ طَائِفَةٍ رَكْعَتَيْنِ."
      }
    ]
  }
}