{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 31,
    "data": [
      {
        "id": 11334,
        "hadith_number": "3770",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Membebaskan Hamba dengan Nisbah dan Harga Yang Tepat",
        "perawi_melayu": "Ibn Umar (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ﷺ as saying: If anyone emancipates his share ina slave and has enough money to pay the full price for him, a fair price for the slave should be fixed, his partners given their shares, and the slave be thus emancipated, otherwise he is emancipated only to the extent of the first man's share.",
        "malay_translation": "Rasulullah SAW bersabda: Sekiranya seseorang membebaskan sebahagian hamba dan mempunyai wang yang cukup untuk membayar harga penuhnya, maka perlulah ditetapkan harga yang adil untuk hamba tersebut, rakan-rakannya diberi bahagian masing-masing, dan hamba tersebut dibebaskan sepenuhnya. Jika tidak, maka pembebasan hanya sehingga bahagian orang pertama sahaja.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قُلْتُ لِمَالِكٍ حَدَّثَكَ نَافِعٌ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ مَنْ أَعْتَقَ شِرْكًا لَهُ فِي عَبْدٍ فَكَانَ لَهُ مَالٌ يَبْلُغُ ثَمَنَ الْعَبْدِ قُوِّمَ عَلَيْهِ قِيمَةَ الْعَدْلِ فَأُعْطِيَ شُرَكَاؤُهُ حِصَصَهُمْ وَعَتَقَ عَلَيْهِ الْعَبْدُ وَإِلاَّ فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ‏ ‏.‏"
      },
      {
        "id": 11335,
        "hadith_number": "3771",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis tentang Perjalanan Riwayat Ibn 'Umar",
        "perawi_melayu": "Ibn 'Umar",
        "english_text": "This hadith has been reported on the authority of Ibn 'Umar through another chain of transmitters.",
        "malay_translation": "Hadis ini telah diriwayatkan dengan sanad daripada Ibn 'Umar melalui satu rangkaian perawi yang lain.",
        "arabic_text": "وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ رُمْحٍ، جَمِيعًا عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، ح وَحَدَّثَنَا أَبُو الرَّبِيعِ، وَأَبُو كَامِلٍ قَالاَ حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللَّهِ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ، الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، ح وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي إِسْمَاعِيلُ بْنُ أُمَيَّةَ، ح وَحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ، الأَيْلِيُّ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي أُسَامَةُ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، عَنِ ابْنِ أَبِي ذِئْبٍ، كُلُّ هَؤُلاَءِ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، بِمَعْنَى حَدِيثِ مَالِكٍ عَنْ نَافِعٍ.‏"
      },
      {
        "id": 11336,
        "hadith_number": "3772",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Tanggungjawab Membebaskan Hamba Bersama",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The slave who is jointly owned by two persons, and is emancipated by one of them, (this one) has liability (upon him to secure complete freedom for that slave).",
        "malay_translation": "Rasulullah (صلى الله عليه وسلم) bersabda: Hamba yang dimiliki bersama oleh dua orang, dan dibebaskan oleh salah seorang daripadanya, maka orang yang membebaskannya itu bertanggungjawab untuk membebaskan sepenuhnya hamba tersebut.",
        "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ، بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ فِي الْمَمْلُوكِ بَيْنَ الرَّجُلَيْنِ فَيُعْتِقُ أَحَدُهُمَا قَالَ ‏ ‏ يَضْمَنُ‏.‏"
      },
      {
        "id": 11337,
        "hadith_number": "3773",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Membebaskan Hamba dan Kewajipan Pembebasan",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: If anyone emancipates a share in a slave, he is to be completely emancipated if he has money; but if he has none, the slave will be required to work to pay for his freedom, but must not be over-burhened.",
        "malay_translation": "Nabi (ﷺ) bersabda: Sekiranya seseorang membebaskan sebahagian daripada hamba, maka hamba itu perlu dibebaskan sepenuhnya jika orang itu mempunyai wang; tetapi jika tidak, hamba itu akan diwajibkan bekerja untuk membayar harga kebebasannya, tetapi tidak boleh terlalu dibebani.",
        "arabic_text": "وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنِ ابْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ ‏ مَنْ أَعْتَقَ شِقْصًا لَهُ فِي عَبْدٍ فَخَلاَصُهُ فِي مَالِهِ إِنْ كَانَ لَهُ مَالٌ فَإِنْ لَمْ يَكُنْ لَهُ مَالٌ اسْتُسْعِيَ الْعَبْدُ غَيْرَ مَشْقُوقٍ عَلَيْهِ .‏"
      },
      {
        "id": 11338,
        "hadith_number": "3774",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Menentukan Harga dan Kerja Bebas untuk Membebaskan Hamba Bersama",
        "perawi_melayu": "Hadis ini diriwayatkan oleh Sa'id bin Abu 'Aruba dengan sanad yang sama, tetapi dengan tambahan:",
        "english_text": "If he (one of the joint owners emancipating the slave) has not (enough) money (to secure freedom for the other half) a fair price for the slave should be fixed, and he will be required to work to pay for his freedom, but must not be over-burdened.",
        "malay_translation": "Jika salah seorang pemilik bersama ingin membebaskan hamba tersebut, tetapi tidak mempunyai wang yang cukup untuk membebaskan keseluruhannya, maka harga yang adil bagi hamba tersebut perlu ditetapkan. Pemilik perlu bekerja untuk membayar harga pembebasan hamba itu, tetapi tidak boleh dibebani kerja yang melampau.",
        "arabic_text": "وَحَدَّثَنَاهُ عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عِيسَى، - يَعْنِي ابْنَ يُونُسَ - عَنْ سَعِيدِ بْنِ، أَبِي عَرُوبَةَ بِهَذَا الإِسْنَادِ وَزَادَ ‏ ‏ إِنْ لَمْ يَكُنْ لَهُ مَالٌ قُوِّمَ عَلَيْهِ الْعَبْدُ قِيمَةَ عَدْلٍ ثُمَّ يُسْتَسْعَى فِي نَصِيبِ الَّذِي لَمْ يُعْتِقْ غَيْرَ مَشْقُوقٍ عَلَيْهِ.‏"
      },
      {
        "id": 11339,
        "hadith_number": "3775",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kepentingan Penetapan Harga yang Adil",
        "perawi_melayu": "Wahb bin Jarir meriwayatkan: \"Bapakku berkata: Aku mendengar Qatadah رضی ‌اللہ ‌عنہ meriwayatkan...\" satu hadis yang serupa dengan hadis Ibn Abi 'Arubah (no. 3774) dengan sanad yang sama, dan beliau menyebut dalam hadis tersebut:",
        "english_text": "\"A fair price should be worked out for him.\"",
        "malay_translation": "\"Sebuah harga yang adil perlu ditetapkan untuknya.\"",
        "arabic_text": "حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي قَالَ، سَمِعْتُ قَتَادَةَ، يُحَدِّثُ بِهَذَا الإِسْنَادِ بِمَعْنَى حَدِيثِ ابْنِ أَبِي عَرُوبَةَ وَذَكَرَ فِي الْحَدِيثِ قُوِّمَ عَلَيْهِ قِيمَةَ عَدْلٍ."
      },
      {
        "id": 11340,
        "hadith_number": "3776",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Membebaskan Hamba dan Warisannya",
        "perawi_melayu": "Ibn Umar رضی اللہ عنہ melaporkan:",
        "english_text": "'A'isha رضی اللہ عنہا memutuskan untuk membeli seorang hamba perempuan dan kemudian membebaskannya, tetapi tuannya berkata: Kami bersedia menjualnya kepada anda dengan syarat hak warisnya akan jatuh kepada anda. Beliau (Hadrat A'isha رضی اللہ عنہا) menyebut perkara ini kepada Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) lalu baginda bersabda: Ini tidak boleh menghalang anda. Hak waris jatuh kepada orang yang membebaskan.",
        "malay_translation": "'Aisyah رضي الله عنها berniat untuk membeli seorang hamba perempuan dan kemudian membebaskannya, tetapi tuannya berkata, \"Kami bersedia menjualnya kepada anda dengan syarat hak warisnya akan jatuh kepada anda.\"  Beliau (Hadrat Aisyah رضي الله عنها) memberitahu Rasulullah SAW, maka baginda SAW bersabda, \"Hal ini tidak boleh menghalang anda. Hak waris jatuh kepada orang yang membebaskannya.\"",
        "arabic_text": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ عَائِشَةَ، أَنَّهَا أَرَادَتْ أَنْ تَشْتَرِيَ جَارِيَةً تُعْتِقُهَا، فَقَالَ: أَهْلُهَا: نَبِيعُكِهَا عَلَى أَنَّ وَلَاءَهَا لَنَا، فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «لَا يَمْنَعُكِ ذَلِكِ، فَإِنَّمَا الْوَلَاءُ لِمَنْ أَعْتَقَ»."
      },
      {
        "id": 11341,
        "hadith_number": "3777",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Membeli Bebas Seorang Hamba dan Hak Warisan",
        "perawi_melayu": "Aisyah رضي الله عنها meriwayatkan:",
        "english_text": "Barira datang kepadanya untuk meminta bantuan membebaskannya, tetapi dia belum membayar sebarang wang daripada jumlah yang telah ditetapkan dalam kontrak. 'Aisyah رضي الله عنها berkata kepadanya. Pergi kepada keluargamu (yang memiliki engkau), dan jika mereka bersetuju supaya aku membayar jumlah (kontrak) untuk membebaskanmu, maka aku berhak atas harta pusakamu. (Jika mereka bersetuju) aku bersedia (untuk membuat pembayaran ini). Barira memberitahu hal ini kepada keluarganya, tetapi mereka menolak dan berkata: Jika dia (Hadrat 'Aisyah رضي الله عنها) ingin berbuat baik kepadamu kerana Allah, dia boleh melakukannya, tetapi hak warisan tetap kepunyaan kami. Dia (Hadrat 'Aisyah رضي الله عنها) menceritakan hal ini kepada Rasulullah ﷺ, dan baginda bersabda kepadanya: Belilah dia, dan bebaskan dia, kerana hak warisan adalah milik orang yang membebaskannya. Rasulullah ﷺ kemudian berdiri dan berkata: Apakah yang berlaku kepada manusia sehingga mereka menetapkan syarat yang tidak terdapat dalam Kitab Allah? Dan sesiapa yang menetapkan syarat yang tidak terdapat dalam Kitab Allah, maka syarat itu tidak sah, walaupun ditetapkan seratus kali. Syarat yang ditetapkan oleh Allah adalah yang paling berat dan paling sah.",
        "malay_translation": "Barirah datang kepada 'Aisyah رضي الله عنها untuk meminta pertolongan dalam pembebasan dirinya, namun dia belum membayar sebarang wang daripada jumlah yang tertera dalam perjanjian. 'Aisyah رضي الله عنها berkata kepadanya, \"Kembalilah kepada keluargamu, dan jika mereka bersetuju supaya aku membayar jumlah tersebut untuk membebaskanmu, maka aku berhak ke atas pusakamu. Aku sedia membayarnya.\" Barirah memberitahu keluarganya, namun mereka enggan dan berkata, \"Jika dia (Aisyah رضي الله عنها) ingin berbuat baik kepadamu kerana Allah, biarlah dia melakukannya. Namun, hak pusaka tetap milik kami.\" Kemudian, Aisyah رضي الله عنها menceritakan hal ini kepada Rasulullah ﷺ, dan baginda bersabda, \"Belilah dia dan bebaskanlah dia, kerana hak waris adalah milik orang yang membebaskannya.\" Rasulullah ﷺ kemudian bangun dan berkata, \"Apakah yang berlaku kepada manusia sehingga mereka menetapkan syarat-syarat yang tidak terdapat dalam Kitab Allah? Sesiapa yang menetapkan syarat yang bukan daripada Kitab Allah, maka ia tidak sah, walaupun diulangi seratus kali. Syarat yang ditetapkan oleh Allah adalah paling berat dan paling sah.\" ",
        "arabic_text": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ، أَنَّ بَرِيرَةَ جَاءَتْ عَائِشَةَ تَسْتَعِينُهَا فِي كِتَابَتِهَا، وَلَمْ تَكُنْ قَضَتْ مِنْ كِتَابَتِهَا شَيْئًا، فَقَالَتْ لَهَا عَائِشَةُ: ارْجِعِي إِلَى أَهْلِكِ، فَإِنْ أَحَبُّوا أَنْ أَقْضِيَ عَنْكِ كِتَابَتَكِ وَيَكُونَ وَلَاؤُكِ لِي فَعَلْتُ، فَذَكَرَتْ ذَلِكَ بَرِيرَةُ لِأَهْلِهَا فَأَبَوْا، وَقَالُوا: إِنْ شَاءَتْ أَنْ تَحْتَسِبَ عَلَيْكِ فَلْتَفْعَلْ، وَيَكُونَ لَنَا وَلَاؤُكِ، فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: لَهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «ابْتَاعِي فَأَعْتِقِي، فَإِنَّمَا الْوَلَاءُ لِمَنْ أَعْتَقَ»، ثُمَّ قَامَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «مَا بَالُ أُنَاسٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللهِ، مَنِ اشْتَرَطَ شَرْطًا لَيْسَ فِي كِتَابِ اللهِ فَلَيْسَ لَهُ وَإِنْ شَرَطَ مِائَةَ مَرَّةٍ، شَرْطُ اللهِ أَحَقُّ وَأَوْثَقُ."
      },
      {
        "id": 11342,
        "hadith_number": "3778",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Membebaskan Hamba dengan Perjanjian dan Warisan",
        "perawi_melayu": "Aisyah رضي الله عنها, isteri Rasulullah صلى الله عليه وسلم, meriwayatkan:",
        "english_text": "Barira datang kepadaku dan berkata: 'Aisyah رضي اللہ عنہا , aku telah membuat perjanjian untuk membebaskan diriku dengan keluarga (yang memiliki aku) dengan harga sembilan 'uqiyas (perak), satu 'uqiya setiap tahun. Selebihnya hadis ini sama (tetapi dengan tambahan ini): Hal ini (masalah hak warisan) janganlah menghalangmu. Belilah dia dan bebaskanlah dia. Beliau bersabda dalam satu hadis: Utusan Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) berdiri di kalangan manusia, memuji Allah, memuji-Nya, dan kemudian bersabda: untuk......",
        "malay_translation": "Barirah datang kepadaku dan berkata: 'Aisyah رضي الله عنها, aku telah berjanji untuk menebus kebebasan diriku daripada keluargaku (yang memiliki aku) dengan harga sembilan 'uqiyah (perak), satu 'uqiyah setiap tahun. Selebihnya hadis ini sama (tetapi dengan tambahan ini): Hal ini (masalah hak warisan) janganlah menghalangmu. Belilah dia dan bebaskanlah dia. Rasulullah صلى الله عليه وسلم bersabda dalam satu hadis: Utusan Allah (ﷺ) berdiri di tengah-tengah manusia, memuji Allah, memuji-Nya, dan kemudian bersabda: untuk....",
        "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْ: جَاءَتْ بَرِيرَةُ إِلَيَّ، فَقَالَتْ: يَا عَائِشَةُ، إِنِّي كَاتَبْتُ أَهْلِي عَلَى تِسْعِ أَوَاقٍ، فِي كُلِّ عَامٍ أُوقِيَّةٌ بِمَعْنَى حَدِيثِ اللَّيْثِ، وَزَادَ، فَقَالَ: «لَا يَمْنَعُكِ ذَلِكِ مِنْهَا ابْتَاعِي وَأَعْتِقِي»، وَقَالَ فِي الْحَدِيثِ: ثُمَّ قَامَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي النَّاسِ، فَحَمِدَ اللهَ وَأَثْنَى عَلَيْهِ، ثُمَّ قَالَ: أَمَّا بَعْدُ."
      },
      {
        "id": 11343,
        "hadith_number": "3779",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Membebaskan Hamba dan Hak Waris",
        "perawi_melayu": "Aishah (رضي الله عنها) meriwayatkan:",
        "english_text": "Barira datang kepadaku dan berkata: Keluargaku (tuan-tuan) telah membuat perjanjian dengan aku (untuk membebaskan aku) dengan harga sembilan 'uqiya (perak) yang dibayar dalam tempoh sembilan tahun, satu 'uqiya setiap tahun. Tolonglah aku (untuk membuat bayaran ini). Aku berkata kepadanya: Jika keluargamu menghendaki, aku bersedia membayar penuh dalam satu ansuran, dan dengan itu membebaskanmu, tetapi hak waris akan menjadi milikku, jika aku berbuat demikian. Dia (Barira) menyebutkannya kepada keluarganya, tetapi mereka menolak (kecuali) dengan syarat hak waris akan menjadi milik mereka. Dia datang kepadaku dan menyebutkannya, jika Dia (Aishah) berkata: Aku menegurnya. Dia (Barira) berkata: Demi Allah, ia mustahil (mereka tidak akan bersetuju dengannya). Dan ketika dia berkata demikian, Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم) mendengar, dan dia bertanya kepadaku, aku memberitahunya dan dia berkata: Belilah dia dan bebaskanlah dia, dan biarkan hak waris menjadi milik mereka, kerana mereka tidak berhak menuntutnya (dengan hak) kerana hak waris adalah milik orang yang membebaskan (hamba; oleh itu, orang-orang ini tidak berhak membuat tuntutan palsu). Dan aku berbuat demikian. Dia (Aishah) berkata: Kemudian Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم) menyampaikan khutbah pada petang itu. Dia memuji Allah dan memuji-Nya dengan apa yang Dia layak, dan kemudian berkata kemudian: Apa yang berlaku kepada manusia sehingga mereka menetapkan syarat yang tidak terdapat dalam Kitab Allah? Dan syarat yang tidak terdapat dalam Kitab Allah adalah tidak sah, walaupun bilangannya seratus. Kitab Allah lebih benar (daripada sebarang perbuatan) dan syarat yang ditetapkan oleh Allah lebih mengikat (daripada sebarang syarat lain). Apa yang berlaku kepada orang-orang di antara kamu yang seseorang di antara kamu berkata: Bebaskanlah si anu, tetapi hak waris menjadi milikku? Sesungguhnya, hak waris adalah milik orang yang membebaskan.",
        "malay_translation": "Barira datang kepadaku dan berkata, \"Keluargaku telah membuat perjanjian pembebasan dengan aku dengan harga sembilan uqiyah perak yang dibayar dalam tempoh sembilan tahun, satu uqiyah setiap tahun. Bantu aku.\" Aku menjawab, \"Jika keluargamu mahukan, aku bersedia membayar penuh sekali gus, dan membebaskanmu, namun hak waris akan menjadi milikku. Namun, jika mereka tetap mahu membayar secara ansuran, hak waris tetap menjadi milik mereka.\" Barira kemudian berbincang dengan keluarganya, tetapi mereka menolak kecuali jika hak waris tetap menjadi milik mereka. Barira datang mengadu kepadaku sekali lagi, dan Aishah menceritakan kejadian tersebut. Aishah memberitahu bahawa aku menegurnya. Barira menjawab, \"Demi Allah, hal ini mustahil.\"  Rasulullah mendengar perbualan itu dan bertanya kepadaku. Setelah aku memberitahunya, baginda bersabda, \"Belilah dan bebaskanlah Barira. Biarlah hak waris menjadi milik keluarganya, kerana mereka tidak berhak atasnya. Mereka tidak boleh menuntut hak waris.\" Aku pun bertindak sedemikian. Aishah berkata, \"Kemudian Rasulullah SAW menyampaikan khutbah pada petang itu. Baginda memuji Allah SWT dan bersabda, \"Apakah yang mendorong manusia menetapkan syarat-syarat yang tidak terdapat dalam Kitab Allah?  Setiap syarat yang tidak dalam Kitab Allah adalah tidak sah, walau berapa banyakpun syarat itu. Kitab Allah adalah kebenaran yang mutlak dan lebih utama berbanding apa-apa syarat yang lain. Kenapa ada di antara kamu yang menetapkan syarat hak waris atas pembebasan hamba? Hak waris adalah milik orang yang membebaskan hamba itu.\"",
        "arabic_text": "وحَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ الْهَمْدَانِيُّ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ، قَالَتْ: دَخَلَتْ عَلَيَّ بَرِيرَةُ، فَقَالَتْ: إِنَّ أَهْلِي كَاتَبُونِي عَلَى تِسْعِ أَوَاقٍ فِي تِسْعِ سِنِينَ، فِي كُلِّ سَنَةٍ أُوقِيَّةٌ فَأَعِينِينِي، فَقُلْتُ لَهَا: إِنْ شَاءَ أَهْلُكِ أَنْ أَعُدَّهَا لَهُمْ عَدَّةً وَاحِدَةً وَأُعْتِقَكِ، وَيَكُونَ الْوَلَاءُ لِي فَعَلْتُ، فَذَكَرَتْ ذَلِكَ لِأَهْلِهَا فَأَبَوْا إِلَّا أَنْ يَكُونَ الْوَلَاءُ لَهُمْ، فَأَتَتْنِي فَذَكَرَتْ ذَلِكَ قَالَتْ: فَانْتَهَرْتُهَا، فَقَالَتْ: لَا هَا اللهِ إِذًا قَالَتْ، فَسَمِعَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَسَأَلَنِي، فَأَخْبَرْتُهُ، فَقَالَ: «اشْتَرِيهَا وَأَعْتِقِيهَا، وَاشْتَرِطِي لَهُمُ الْوَلَاءَ، فَإِنَّ الْوَلَاءَ لِمَنْ أَعْتَقَ»، فَفَعَلْتُ، قَالَتْ: ثُمَّ خَطَبَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَشِيَّةً، فَحَمِدَ اللهَ، وَأَثْنَى عَلَيْهِ بِمَا هُوَ أَهْلُهُ، ثُمَّ قَالَ: «أَمَّا بَعْدُ، فَمَا بَالُ أَقْوَامٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللهِ، مَا كَانَ مِنْ شَرْطٍ لَيْسَ فِي كِتَابِ اللهِ عَزَّ وَجَلَّ فَهُوَ بَاطِلٌ، وَإِنْ كَانَ مِائَةَ شَرْطٍ، كِتَابُ اللهِ أَحَقُّ وَشَرْطُ اللهِ أَوْثَقُ، مَا بَالُ رِجَالٍ مِنْكُمْ يَقُولُ أَحَدُهُمْ أَعْتِقْ فُلَانًا وَالْوَلَاءُ لِي، إِنَّمَا الْوَلَاءُ لِمَنْ أَعْتَقَ."
      },
      {
        "id": 11344,
        "hadith_number": "3780",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pilihan Barirah untuk Memutuskan Perkahwinan dengan Hamba",
        "perawi_melayu": "Hisham bin 'Urwa meriwayatkan hadis yang serupa dengan sanad yang sama, kecuali (dengan perbezaan) bahawa dalam hadis yang diriwayatkan daripada Jarir (kata-katanya adalah):",
        "english_text": "Her (Barira's) husband was a slave, so Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) gave her the option (either to retain her matrimonial relation with her husband or sever it off). She opted to break off (and secure freedom for her even from the matrimonial alliance). And if he were free he would not have given her the option. In the hadith narrated on the authority (of this chain of transmitters) these words are not found: Amma ba'du.",
        "malay_translation": "Suaminya seorang hamba, maka Rasulullah ﷺ memberikan pilihan kepadanya (sama ada untuk mengekalkan perhubungan perkahwinannya dengan suaminya atau memutuskannya). Dia memilih untuk memutuskan perhubungan (dan memperoleh kebebasan baginya, meskipun daripada perhubungan perkahwinan). Dan jika dia (suaminya) merdeka, baginda tidak akan memberikannya pilihan itu. Dalam hadis yang diriwayatkan melalui sanad ini, perkataan-perkataan ini tidak ditemui: Amma ba'du.",
        "arabic_text": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا ابْنُ نُمَيْرٍ، ح وحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، ح وحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، جَمِيعًا، عَنْ جَرِيرٍ، كُلُّهُمْ، عَنْ هِشَامِ بْنِ عُرْوَةَ بِهَذَا الْإِسْنَادِ نَحْوَ حَدِيثِ أَبِي أُسَامَةَ، غَيْرَ أَنَّ فِي حَدِيثِ جَرِيرٍ، قَالَ: وَكَانَ زَوْجُهَا عَبْدًا، فَخَيَّرَهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَاخْتَارَتْ نَفْسَهَا، وَلَوْ كَانَ حُرًّا لَمْ يُخَيِّرْهَا، وَلَيْسَ فِي حَدِيثِهِمْ أَمَّا بَعْدُ."
      },
      {
        "id": 11345,
        "hadith_number": "3781",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ketetapan Warisan dan Pembebasan Budak Wanita Barirah",
        "perawi_melayu": "Abdul-Rahman bin al-Qasim melaporkan dari bapanya:",
        "english_text": "'A'isha (رضی اللہ عنہا ) said: There were three issues which were clarified in case of Barira  رضی اللہ عنہا : her owners had decided to sell her on the condition that the right of her inheritance would vest with them. She ('A'isha رضی اللہ عنہا ) said: I made a mention of that to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he said: Buy her and emancipate her, for verily the right of inheritance vests with one who emancipates. She said that she emancipated (her) and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) gave her the option (either to retain her matrimonial alliance or break it after emancipation). She (taking advantage of the option) opted for herself (the severing of matrimonial alliance). 'A'isha رضی اللہ عنہا said: The people used to give her charity and she gave us that as gift. I made a mention of it to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), whereupon he said: That is charity for her but gift for you, so take that.",
        "malay_translation": "'Aisyah رضي الله عنها berkata: Terdapat tiga perkara yang dijelaskan berkaitan Barirah رضي الله عنها: pemiliknya telah memutuskan untuk menjualnya dengan syarat hak warisannya akan menjadi milik mereka. 'Aisyah رضي الله عنها berkata: Saya menceritakan hal itu kepada Rasulullah صلى الله عليه وسلم, dan baginda bersabda: Belilah dan bebaskan dia, kerana sesungguhnya hak warisannya akan menjadi milik orang yang membebaskannya. Dia (Barirah) berkata bahawa dia telah membebaskan dirinya dan Rasulullah صلى الله عليه وسلم memberikan pilihan kepadanya (sama ada mengekalkan pertunangannya atau menamatkan pertunangannya selepas pembebasan). Dia memilih untuk menamatkan pertunangannya. 'Aisyah رضي الله عنها berkata: Orang ramai memberi sedekah kepadanya dan dia memberikannya kepada kami sebagai hadiah. Saya menceritakan hal itu kepada Rasulullah صلى الله عليه وسلم, lalu baginda bersabda: Itu sedekah untuknya tetapi hadiah untuk kamu, maka ambillah.",
        "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْعَلَاءِ، وَاللَّفْظُ لِزُهَيْرٍ، قَالَا: حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ: كَانَ فِي بَرِيرَةَ ثَلَاثُ قَضِيَّاتٍ: أَرَادَ أَهْلُهَا أَنْ يَبِيعُوهَا وَيَشْتَرِطُوا وَلَاءَهَا، فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «اشْتَرِيهَا وَأَعْتِقِيهَا، فَإِنَّ الْوَلَاءَ لِمَنْ أَعْتَقَ» قَالَتْ: وَعَتَقَتْ، فَخَيَّرَهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَاخْتَارَتْ نَفْسَهَا، قَالَتْ: وَكَانَ النَّاسُ يَتَصَدَّقُونَ عَلَيْهَا وَتُهْدِي لَنَا، فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «هُوَ عَلَيْهَا صَدَقَةٌ، وَهُوَ لَكُمْ هَدِيَّةٌ، فَكُلُوهُ."
      },
      {
        "id": 11346,
        "hadith_number": "3782",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perjanjian Pembebasan dan Hadiah Barirah رضي الله عنها",
        "perawi_melayu": "Aisyah رضي الله عنها meriwayatkan:",
        "english_text": "The had bought Barira رضی اللہ عنہا from the people of Ansar, but they laid down the condition that the right of inheritance (would vest in them), whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) said: The right of inheritance vests with one who shows favour (who emancipates) and Allah's Messenger (ﷺ) gave her the choice (either to retain) her matrimonial alliance or break it). Her husband was a slave. She (Barira also) gave 'A'isha رضی اللہ عنہا some meat as gift. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: I wish you could prepare (cook) for us out of this meat. 'A'isha  رضی اللہ عنہا said, It has been given as charity to Barira, whereupon he said: That is charity for her and gift for us.",
        "malay_translation": "Barirah رضي الله عنها dibeli daripada orang Ansar, tetapi mereka menetapkan syarat bahawa hak waris akan menjadi milik mereka.  Lalu Rasulullah SAW bersabda: Hak waris itu tetap pada orang yang melepaskan (membebaskan). Dan Rasulullah SAW memberi pilihan kepada Barirah sama ada untuk meneruskan atau memutuskan pertunangannya. Suaminya adalah seorang hamba.  Barirah juga memberi sedikit daging sebagai hadiah kepada Aisyah رضي الله عنها. Rasulullah SAW bersabda: Semoga engkau dapat menyediakan (memasak) sebahagian daging ini untuk kami. Aisyah رضي الله عنها menjawab, Ia telah diberikan sebagai sedekah untuk Barirah. Maka baginda bersabda: Itu adalah sedekah untuknya dan hadiah untuk kami.",
        "arabic_text": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنْ سِمَاكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا اشْتَرَتْ بَرِيرَةَ مِنْ أُنَاسٍ مِنَ الْأَنْصَارِ وَاشْتَرَطُوا الْوَلَاءَ، فَقَالَ: رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْوَلَاءُ لِمَنْ وَلِيَ النِّعْمَةَ»، وَخَيَّرَهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَكَانَ زَوْجُهَا عَبْدًا، وَأَهْدَتْ لِعَائِشَةَ لَحْمًا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَوْ صَنَعْتُمْ لَنَا مِنْ هَذَا اللَّحْمِ»، قَالَتْ عَائِشَةُ: تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ، فَقَالَ: «هُوَ لَهَا صَدَقَةٌ وَلَنَا هَدِيَّةٌ."
      },
      {
        "id": 11347,
        "hadith_number": "3783",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pembebasan Barirah رضي الله عنها dan Hak Warisan",
        "perawi_melayu": "Aisyah رضي الله عنها meriwayatkan:",
        "english_text": "She wanted to buy Barira رضی اللہ عنہا with a view to emancipating her. They (the sellers) laid down the condition that the right of inheritance would vest (with them). She (Hadrat 'A'isha رضی اللہ عنہا) made a mention of that to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), whereupon he said: Buy her and emancipate her for the right of inheritance vests with one who emancipates. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was given meat as gift. They (his Companions) said to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌): This was given as charity to Barira رضی اللہ عنہا , whereupon he said: That is charity for her but gift for us. And she was given option (to retain her matrimonial alliance or to break it). Abd al-Rahman said: Her husband was a free man. Shu'ba said: I then asked him (one of the narrators) about Barira's husband (whether he had been a free mart or a slave), whereupon he said: I do not know.",
        "malay_translation": "Dia ingin membeli Barirah رضي الله عنها untuk membebaskannya. Para penjual menetapkan syarat bahawa hak warisan akan jatuh kepada mereka. Dia (Hadrat Aisyah رضي الله عنها) mengadu hal ini kepada Rasulullah SAW, lalu baginda bersabda: Belilah dan bebaskannya, kerana hak waris ada pada orang yang membebaskannya. Rasulullah SAW diberi daging sebagai hadiah. Para sahabat baginda berkata kepada Rasulullah SAW: Ini diberikan sebagai sedekah kepada Barirah رضي الله عنها, lalu baginda bersabda: Itu sedekah untuknya, tetapi hadiah untuk kita. Dan dia diberi pilihan (untuk mengekalkan perkahwinannya atau mengakhirinya). Abd al-Rahman berkata: Suaminya adalah seorang lelaki merdeka. Syu'bah berkata: Kemudian saya bertanya kepadanya (salah seorang perawi) tentang suami Barirah (sama ada dia seorang hamba atau lelaki merdeka), lalu dia menjawab: Saya tidak tahu.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ: سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ، قَالَ: سَمِعْتُ الْقَاسِمَ، يُحَدِّثُ عَنْ عَائِشَةَ، أَنَّهَا أَرَادَتْ أَنْ تَشْتَرِيَ بَرِيرَةَ لِلْعِتْقِ، فَاشْتَرَطُوا وَلَاءَهَا، فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «اشْتَرِيهَا وَأَعْتِقِيهَا، فَإِنَّ الْوَلَاءَ لِمَنْ أَعْتَقَ» وَأُهْدِيَ لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَحْمٌ، فَقَالُوا لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: هَذَا تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ، فَقَالَ: «هُوَ لَهَا صَدَقَةٌ، وَهُوَ لَنَا هَدِيَّةٌ» وَخُيِّرَتْ - فَقَالَ عَبْدُ الرَّحْمَنِ: - وَكَانَ زَوْجُهَا حُرًّا، قَالَ شُعْبَةُ: ثُمَّ سَأَلْتُهُ، عَنْ زَوْجِهَا، فَقَالَ: لَا أَدْرِي."
      },
      {
        "id": 11348,
        "hadith_number": "3784",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Mengenai Membebaskan Hamba",
        "perawi_melayu": null,
        "english_text": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters.",
        "malay_translation": "Hadis ini telah diriwayatkan dengan sanad yang sama daripada Shu'ba.",
        "arabic_text": "وَحَدَّثَنَاهُ أَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِيُّ، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ نَحْوَهُ."
      },
      {
        "id": 11349,
        "hadith_number": "3785",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Suami Barirah رضي الله عنها Seorang Hamba",
        "perawi_melayu": "Aishah رضي الله عنها meriwayatkan:",
        "english_text": "The husband of Barira رضی اللہ عنہا was a slave.",
        "malay_translation": "Suami Barirah رضي الله عنها adalah seorang hamba.",
        "arabic_text": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، جَمِيعًا عَنْ أَبِي هِشَامٍ، قَالَ ابْنُ الْمُثَنَّى: حَدَّثَنَا مُغِيرَةُ بْنُ سَلَمَةَ الْمَخْزُومِيُّ أَبُو هِشَامٍ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عُبَيْدُ اللهِ، عَنْ يَزِيدَ بْنِ رُومَانَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ: «كَانَ زَوْجُ بَرِيرَةَ عَبْدًا"
      },
      {
        "id": 11350,
        "hadith_number": "3786",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Sedekah dan Hak Waris dalam Membebaskan Budak",
        "perawi_melayu": "Aisyah رضي الله عنها, isteri Rasulullah SAW, berkata:",
        "english_text": "Three are the Sunan (usages) (that we came to know in case of Bairara رضی اللہ عنہا). She was given option in regard to her husband when she was emancipated. She was given meat as charity. Allah's Messenger (ﷺ) visited me when an earthen pot with meat in it was placed on the fire. He asked for food and be was given bread with ordinary meat (usually cooked in the) house. Thereupon he (Allah's Messenger) said: Don't I see the earthen pot on fire with meat in it? They said: Yes. Allah's Messenger ﷺ, there is meat in it which was given as charity to Barira رضی اللہ عنہا. We did not deem it advisable that we should give you that to eat, whereupon he said: It is charity for her, but it is gift for us. Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) also said: The right of inheritance vests with one who emancipates.",
        "malay_translation": "Tiga perkara Sunnah (amalan) telah kita ketahui tentang Barirah رضي الله عنها. Beliau diberi pilihan mengenai suaminya sewaktu dibebaskan. Beliau diberi daging sebagai sedekah. Rasulullah SAW mengunjungi saya ketika periuk tanah liat berisi daging diletakkan di atas api. Baginda meminta makanan dan diberi roti dengan daging biasa yang dimasak di rumah. Lalu baginda bersabda: Tidakkah aku lihat periuk tanah liat berisi daging di atas api? Mereka menjawab: Ya. Ya Rasulullah, daging itu adalah sedekah yang diberikan kepada Barirah رضي الله عنها. Kami tidak menganggap wajar memberikannya kepada Baginda, lalu baginda bersabda: Ia adalah sedekah untuknya, tetapi hadiah untuk kami. Rasulullah SAW juga bersabda: Hak waris terletak di tangan orang yang membebaskan.",
        "arabic_text": "وحَدَّثَنِي أَبُو الطَّاهِرِ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْ: كَانَ فِي بَرِيرَةَ ثَلَاثُ سُنَنٍ: خُيِّرَتْ عَلَى زَوْجِهَا حِينَ عَتَقَتْ، وَأُهْدِيَ لَهَا لَحْمٌ، فَدَخَلَ عَلَيَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَالْبُرْمَةُ عَلَى النَّارِ، فَدَعَا بِطَعَامٍ، فَأُتِيَ بِخُبْزٍ وَأُدُمٍ مِنْ أُدُمِ الْبَيْتِ، فَقَالَ: «أَلَمْ أَرَ بُرْمَةً عَلَى النَّارِ فِيهَا لَحْمٌ»، فَقَالُوا: بَلَى يَا رَسُولَ اللهِ، ذَلِكَ لَحْمٌ تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ، فَكَرِهْنَا أَنْ نُطْعِمَكَ مِنْهُ، فَقَالَ: «هُوَ عَلَيْهَا صَدَقَةٌ، وَهُوَ مِنْهَا لَنَا هَدِيَّةٌ»، وَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِيهَا: «إِنَّمَا الْوَلَاءُ لِمَنْ أَعْتَقَ."
      },
      {
        "id": 11351,
        "hadith_number": "3787",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Membebaskan Hamba dan Warisan",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "'A'isha ( رضی اللہ عنہا) ingin membeli seorang hamba perempuan dan memerdekakannya, tetapi pemiliknya enggan menjual melainkan dengan syarat warisan akan menjadi hak mereka.  Beliau menceritakan hal ini kepada Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).  Baginda bersabda: Janganlah hal ini menghalangmu. Warisan tetap menjadi hak orang yang memerdekakan.",
        "malay_translation": "'Aisyah (رضي الله عنها) ingin membeli seorang hamba perempuan dan memerdekakannya, tetapi pemiliknya enggan menjual kecuali dengan syarat bahawa hak warisan akan menjadi hak mereka.  Beliau menceritakan perkara ini kepada Rasulullah (صلی الله عليه وسلم). Baginda bersabda: Janganlah perkara ini menghalangmu daripada memerdekakan hamba itu. Hak warisan tetap menjadi hak orang yang memerdekakannya.",
        "arabic_text": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، عَنْ سُلَيْمَانَ بْنِ بِلَالٍ، حَدَّثَنِي سُهَيْلُ بْنُ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: أَرَادَتْ عَائِشَةُ أَنْ تَشْتَرِيَ جَارِيَةً تُعْتِقُهَا، فَأَبَى أَهْلُهَا إِلَّا أَنْ يَكُونَ لَهُمُ الْوَلَاءُ، فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «لَا يَمْنَعُكِ ذَلِكِ، فَإِنَّمَا الْوَلَاءُ لِمَنْ أَعْتَقَ."
      },
      {
        "id": 11352,
        "hadith_number": "3788",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Menjual atau Memberi Hadiah Hak Waris Hamba",
        "perawi_melayu": "Ibn Umar (رضی اللہ عنہ) meriwayatkan:",
        "english_text": "Allah's Messenger (ﷺ) forbade the selling and making a gift of the right of inheritance of a slave. Imam Muslim said: All the persons depend upon Abdullah bin Dinar in regard to this hadith.",
        "malay_translation": "Utusan Allah (ﷺ) melarang menjual atau menghadiahkan hak waris hamba. Imam Muslim berkata: Semua orang bergantung kepada Abdullah bin Dinar mengenai hadis ini.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، أَخْبَرَنَا سُلَيْمَانُ بْنُ بِلَالٍ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الْوَلَاءِ، وَعَنْ هِبَتِهِ»، قَالَ مُسْلِمٌ: «النَّاسُ كُلُّهُمْ عِيَالٌ عَلَى عَبْدِ اللهِ بْنِ دِينَارٍ فِي هَذَا الْحَدِيثِ."
      },
      {
        "id": 11353,
        "hadith_number": "3789",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Mengenai Jual Beli dan Pemberian Hadiah",
        "perawi_melayu": "Abdullah bin Dinar, daripada Ibn Umar رضي الله عنه, daripada Nabi SAW",
        "english_text": "Laporan yang serupa (seperti no. 3788) diriwayatkan daripada 'Abdullah bin Dinar, daripada Ibn Umar رضي الله عنه, daripada Nabi SAW, kecuali dalam Hadis Ath-Thaqafi daripada 'Ubaidullah, ia hanya menyebut tentang jual beli dan tidak menyebut tentang pemberian.",
        "malay_translation": "Satu laporan yang serupa (seperti hadis no. 3788) telah diriwayatkan daripada 'Abdullah bin Dinar, daripada Ibn Umar رضي الله عنه, daripada Nabi SAW, kecuali dalam hadis daripada Ath-Thaqafi daripada 'Ubaidullah, ia hanya menyebut tentang jual beli dan tidak menyebutkan tentang pemberian.",
        "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالَا: حَدَّثَنَا ابْنُ عُيَيْنَةَ، ح وحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ حُجْرٍ، قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سُفْيَانُ بْنُ سَعِيدٍ، ح وحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، ح وحَدَّثَنَا ابْنُ الْمُثَنَّى، قَالَ: حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا عُبَيْدُ اللهِ، ح وحَدَّثَنَا ابْنُ رَافِعٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنَا الضَّحَّاكُ يَعْنِي ابْنَ عُثْمَانَ، كُلُّ هَؤُلَاءِ عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ، غَيْرَ أَنَّ الثَّقَفِيَّ لَيْسَ فِي حَدِيثِهِ عَنْ عُبَيْدِ اللهِ، إِلَّا الْبَيْعُ، وَلَمْ يَذْكُرِ الْهِبَةَ."
      },
      {
        "id": 11354,
        "hadith_number": "3790",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kewajipan Mengeluarkan Denda Darah dan Larangan Menjadi Wali Tanpa Keizinan",
        "perawi_melayu": "Jabir bin Abdullah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) made it obligatory for every tribe (the payment) of blood-wit; he then also made it explicit that it is not permissible for a Muslim to make himself the ally (of the slave emancipated by another) Muslim without his permission. He (the narrator further added): I was informed that he (the Holy Prophet ﷺ) cursed the one who did that (and it was recorded) in his Sahifa (in a document).",
        "malay_translation": "Rasulullah SAW mewajibkan setiap puak (untuk membayar) diat darah; kemudian Baginda juga menjelaskan bahawa tidak dibenarkan bagi seorang Muslim menjadikan dirinya sebagai wali (hamba yang dibebaskan oleh Muslim lain) tanpa keizinan daripadanya. Beliau (perawi menambah): Aku diberitahu bahawa Baginda (Nabi SAW) mengutuk orang yang melakukannya (dan ia direkodkan) di dalam Sahifah-Nya (dalam satu dokumen).",
        "arabic_text": "وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: كَتَبَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «عَلَى كُلِّ بَطْنٍ عُقُولَهُ»، ثُمَّ كَتَبَ: «أَنَّهُ لَا يَحِلُّ لِمُسْلِمٍ أَنْ يُتَوَالَى مَوْلَى رَجُلٍ مُسْلِمٍ بِغَيْرِ إِذْنِهِ»، ثُمَّ أُخْبِرْتُ أَنَّهُ لَعَنَ فِي صَحِيفَتِهِ مَنْ فَعَلَ ذَلِكَ."
      },
      {
        "id": 11355,
        "hadith_number": "3791",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Laknat Allah dan Malaikat kepada Orang yang Mengambil Wali Tanpa Izin Pemilik Terdahulu",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He who takes anyone as his ally without the consent of his previous master, there will be the curse of Allah and that of His angels upon him, and neither, any obligatory act of his nor the supererogatory one will be accepted (by Allah).",
        "malay_translation": "Rasulullah صلى الله عليه وسلم bersabda: Barangsiapa yang mengambil seseorang sebagai walinya tanpa izin pemilik sebelumnya, maka akan turun laknat Allah dan malaikat-Nya kepadanya, dan tidak akan diterima (oleh Allah) amalan wajibnya mahupun sunatnya.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «مَنْ تَوَلَّى قَوْمًا بِغَيْرِ إِذْنِ مَوَالِيهِ، فَعَلَيْهِ لَعْنَةُ اللهِ وَالْمَلَائِكَةِ، لَا يُقْبَلُ مِنْهُ عَدْلٌ، وَلَا صَرْفٌ»."
      },
      {
        "id": 11356,
        "hadith_number": "3792",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Laknat Allah atas Orang Yang Membebaskan Hamba Tanpa Keizinanan Tuannya",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) as saying: He who took the freed slave as his ally without the consent of his previous master, there is upon him the curse of Allah and that of His angels and that of the whole mankind, and there will not be accepted from him his obligatory acts or super crogatory acts on the Day of Resurrection.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Barangsiapa yang mengambil hamba yang telah dibebaskan sebagai sekutunya tanpa izin bekas tuannya, maka ditimpakan atasnya laknat Allah, laknat malaikat-Nya, dan laknat seluruh umat manusia, dan tidak akan diterima darinya amalan wajib atau sunat pada Hari Kiamat.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ الْجُعْفِيُّ، عَنْ زَائِدَةَ، عَنْ سُلَيْمَانَ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «مَنْ تَوَلَّى قَوْمًا بِغَيْرِ إِذْنِ مَوَالِيهِ، فَعَلَيْهِ لَعْنَةُ اللهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ، لَا يُقْبَلُ مِنْهُ يَوْمَ الْقِيَامَةِ عَدْلٌ، وَلَا صَرْفٌ."
      },
      {
        "id": 11357,
        "hadith_number": "3793",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Mengambil Wali Tanpa Keizinan",
        "perawi_melayu": "Diceritakan dari Al-Amash dengan sanad ini (Hadis serupa dengan no. 3792) kecuali dia berkata:",
        "english_text": "\"Whoever takes people other than those who set him free as Mawla without their permission...\"",
        "malay_translation": "\"Barangsiapa mengambil orang lain selain mereka yang membebaskannya sebagai Wali tanpa izin mereka...\".",
        "arabic_text": "وحَدَّثَنِيهِ إِبْرَاهِيمُ بْنُ دِينَارٍ، حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُوسَى، حَدَّثَنَا شَيْبَانُ، عَنِ الْأَعْمَشِ، بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّهُ قَالَ: «وَمَنْ وَالَى غَيْرَ مَوَالِيهِ بِغَيْرِ إِذْنِهِمْ»."
      },
      {
        "id": 11358,
        "hadith_number": "3794",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Mengada-ngada dan Mengikut Bid'ah serta Kewajipan Menjaga Kesatuan Umat Islam",
        "perawi_melayu": "Ibrahim al-Taimi melaporkan berdasarkan sanad daripada bapanya:",
        "english_text": "'Ali bin Abu Talib ( رضی اللہ عنہ) addressed us and said: He who thinks that we (the members of the Prophet's family) read anything else besides the Book of Allah and this Sahifa (and he said that Sahifa was tied to the scabbard of the sword) tells a lie. (This Sahifa) contains (problems) pertaining to the ages of the camels and (the recompense) of the injuries, and it also records the words of the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ): Medina is a sacred territory from 'Ayr to Thaur (it is most probably Uhud). He who innovates (an act or practice) or gives protection to an innovator, there is a curse of Allah and that of His angels and that of the whole humanity upon him. Allah will not accdpt from him (as a recompense) any obligatory act or supererogatory act, and the responsibility of the Muslims is a joint responsibility; even the lowest in rank can undertake the responsibility (on behalf of others), and he who claims anyone else as his father besides his own father or makes one his ally other than the one (who freed him), there is a curse of Allah. that of His angels and that of the whole mankind upon him. Allah will not accept the obligatory act of the supererogatery act (as a recompense) from him.",
        "malay_translation": "'Ali bin Abi Talib (رضي الله عنه) berkata kepada kami: Sesiapa yang menyangka bahawa kami (ahlul bait) membaca selain daripada Kitab Allah dan sahifah ini (dan baginda menyebut sahifah itu diikat pada sarung pedang) adalah pendusta. Sahifah ini mengandungi masalah berkaitan umur unta dan ganti rugi kecederaan, dan juga mengandungi sabda Rasulullah (ﷺ): Madinah adalah tanah suci dari 'Ayr hingga Thaur (iaitu kemungkinan besar Uhud). Sesiapa yang melakukan bid'ah atau memberi perlindungan kepada pelakunya, maka ditimpa laknat Allah, malaikat-Nya dan seluruh manusia. Allah tidak akan menerima amalan wajib mahupun sunat daripadanya sebagai balasan. Tanggungjawab umat Islam adalah tanggungjawab bersama; malah orang yang paling rendah kedudukannya boleh menanggung tanggungjawab itu bagi pihak orang lain. Dan sesiapa yang mendakwa orang lain sebagai bapanya selain bapanya yang sebenar atau menjadikan seseorang sebagai sekutunya selain orang yang membebaskannya, maka ditimpa laknat Allah, malaikat-Nya dan seluruh manusia. Allah tidak akan menerima amalan wajib dan sunat daripadanya sebagai balasan.",
        "arabic_text": "وحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الْأَعْمَشُ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ، قَالَ: خَطَبَنَا عَلِيُّ بْنُ أَبِي طَالِبٍ، فَقَالَ: مَنْ زَعَمَ أَنَّ عِنْدَنَا شَيْئًا نَقْرَؤُهُ إِلَّا كِتَابَ اللهِ وَهَذِهِ الصَّحِيفَةَ، قَالَ: وَصَحِيفَةٌ مُعَلَّقَةٌ فِي قِرَابِ سَيْفِهِ، فَقَدْ كَذَبَ، فِيهَا أَسْنَانُ الْإِبِلِ، وَأَشْيَاءُ مِنَ الْجِرَاحَاتِ، وَفِيهَا قَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْمَدِينَةُ حَرَمٌ مَا بَيْنَ عَيْرٍ إِلَى ثَوْرٍ، فَمَنْ أَحْدَثَ فِيهَا حَدَثًا، أَوْ آوَى مُحْدِثًا، فَعَلَيْهِ لَعْنَةُ اللهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ، لَا يَقْبَلُ اللهُ مِنْهُ يَوْمَ الْقِيَامَةِ صَرْفًا، وَلَا عَدْلًا، وَذِمَّةُ الْمُسْلِمِينَ وَاحِدَةٌ يَسْعَى بِهَا أَدْنَاهُمْ، وَمَنِ ادَّعَى إِلَى غَيْرِ أَبِيهِ، أَوِ انْتَمَى إِلَى غَيْرِ مَوَالِيهِ، فَعَلَيْهِ لَعْنَةُ اللهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ، لَا يَقْبَلُ اللهُ مِنْهُ يَوْمَ الْقِيَامَةِ صَرْفًا، وَلَا عَدْلًا."
      },
      {
        "id": 11359,
        "hadith_number": "3795",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Membebaskan Hamba Memberi Kebebasan Dari Neraka",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: If anyone emancipates a Muslim slave, Allah will set free from Hell an organ of his body for every organ of his (slave's) body.",
        "malay_translation": "Rasulullah صلى الله عليه وسلم bersabda: Barangsiapa memerdekakan seorang hamba Muslim, Allah akan membebaskan sebahagian daripada anggota tubuhnya dari api neraka bagi setiap anggota tubuh hamba tersebut.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عَبْدِ اللهِ بْنِ سَعِيدٍ وَهُوَ ابْنُ أَبِي هِنْدٍ، حَدَّثَنِي إِسْمَاعِيلُ بْنُ أَبِي حَكِيمٍ، عَنْ سَعِيدِ ابْنِ مَرْجَانَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «مَنْ أَعْتَقَ رَقَبَةً مُؤْمِنَةً، أَعْتَقَ اللهُ بِكُلِّ إِرْبٍ مِنْهَا إِرْبًا مِنْهُ مِنَ النَّارِ."
      },
      {
        "id": 11360,
        "hadith_number": "3796",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Membebaskan Hamba Menghapuskan Azab Neraka",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger (ﷺ) as saying: He who emancipates a slave, Allah will set free from Hell every limb (of his body) for every limb of his (slave's) body, even his private parts.",
        "malay_translation": "Rasulullah SAW bersabda: Barangsiapa yang memerdekakan seorang hamba, Allah akan membebaskan setiap anggota (badannya) dari neraka untuk setiap anggota badannya, termasuk bahagian sulitnya.",
        "arabic_text": "وحَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنْ مُحَمَّدِ بْنِ مُطَرِّفٍ أَبِي غَسَّانَ الْمَدَنِيِّ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، عَنْ سَعِيدِ ابْنِ مَرْجَانَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَعْتَقَ رَقَبَةً، أَعْتَقَ اللهُ بِكُلِّ عُضْوٍ مِنْهَا عُضْوًا مِنْ أَعْضَائِهِ مِنَ النَّارِ، حَتَّى فَرْجَهُ بِفَرْجِهِ."
      },
      {
        "id": 11361,
        "hadith_number": "3797",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Membebaskan Hamba Membebaskan Anggota Tubuh dari Api Neraka",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who emancipates a believing slave. Allah will set free from Fire his every limb for every limb of his (slave's), even his private parts for his.",
        "malay_translation": "Aku mendengar Rasulullah SAW bersabda: Barang siapa membebaskan seorang hamba yang beriman, Allah akan membebaskan setiap anggota tubuhnya dari api neraka, bagi setiap anggota tubuh hamba tersebut, bahkan termasuk kemaluannya.",
        "arabic_text": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ الْهَادِ، عَنْ عُمَرَ بْنِ عَلِيِّ بْنِ حُسَيْنٍ، عَنْ سَعِيدِ ابْنِ مَرْجَانَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ أَعْتَقَ رَقَبَةً مُؤْمِنَةً، أَعْتَقَ اللهُ بِكُلِّ عُضْوٍ مِنْهُ عُضْوًا مِنَ النَّارِ، حَتَّى يُعْتِقَ فَرْجَهُ بِفَرْجِهِ."
      },
      {
        "id": 11362,
        "hadith_number": "3798",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Membebaskan Seorang Hamba, Menyelamatkan Dari Api Neraka",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: A Muslim who emancipates a Muslim (slave). Allah will save from Fire every limb of his for every limb (of the slave). Sa'id bin Marjana said: When I heard this hadith from Abu Huraira (رضی اللہ عنہ), I went away and made a mention of it to 'Ali bin Husain and he at once emancipated the slave for which Ibn ja'far was prepared to pay ten thousand dirhams or one thousand dinars.",
        "malay_translation": "Rasulullah SAW bersabda:  Sesiapa yang membebaskan seorang hamba Muslim, Allah akan melepaskan setiap anggota badannya dari api neraka untuk setiap anggota (hamba yang dibebaskan). Sa'id bin Marjana berkata:  Apabila aku mendengar hadith ini daripada Abu Hurairah (رضي الله عنه), aku segera memberitahu Ali bin Husain, dan beliau dengan segera membebaskan hamba itu. Ibn Ja'far sanggup membayar sepuluh ribu dirham atau seribu dinar untuk pembebasan tersebut.",
        "arabic_text": "وحَدَّثَنِي حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا عَاصِمٌ وَهُوَ ابْنُ مُحَمَّدٍ الْعُمَرِيُّ، حَدَّثَنَا وَاقِدٌ - يَعْنِي أَخَاهُ -، حَدَّثَنِي سَعِيدُ ابْنُ مَرْجَانَةَ - صَاحِبُ عَلِيِّ بْنِ حُسَيْنٍ -، قَالَ: سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَيُّمَا امْرِئٍ مُسْلِمٍ أَعْتَقَ امْرَأً مُسْلِمًا، اسْتَنْقَذَ اللهُ بِكُلِّ عُضْوٍ مِنْهُ عُضْوًا مِنْهُ مِنَ النَّارِ»، قَالَ: فَانْطَلَقْتُ حِينَ سَمِعْتُ الْحَدِيثَ مِنْ أَبِي هُرَيْرَةَ، فَذَكَرْتُهُ لِعَلِيِّ بْنِ الْحُسَيْنِ، فَأَعْتَقَ عَبْدًا لَهُ قَدْ أَعْطَاهُ بِهِ ابْنُ جَعْفَرٍ عَشَرَةَ آلَافِ دِرْهَمٍ أَوْ أَلْفَ دِينَارٍ."
      },
      {
        "id": 11363,
        "hadith_number": "3799",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Tanggungjawab Anak Terhadap Ayahnya",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: A son does not repay what he owes his father unless he buys him (the father) in case he is a slave and then emancipates him. In the narration transmitted by Ibn Abu Shaiba there is a slight change of words.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Seorang anak lelaki tidak dapat membalas hutangnya kepada bapanya melainkan dengan membeli bapanya sekiranya bapanya adalah hamba dan kemudian memerdekakannya. Dalam riwayat Ibn Abu Shaiba terdapat sedikit perbezaan perkataan.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالَا: حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَجْزِي وَلَدٌ وَالِدًا، إِلَّا أَنْ يَجِدَهُ مَمْلُوكًا فَيَشْتَرِيَهُ فَيُعْتِقَهُ»، وَفِي رِوَايَةِ ابْنِ أَبِي شَيْبَةَ: «وَلَدٌ وَالِدَهُ."
      },
      {
        "id": 11364,
        "hadith_number": "3800",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis yang Sama dengan Riwayat Suhail",
        "perawi_melayu": "Suhail",
        "english_text": "A hadith like this has been narrated on the authority of Suhail with the same chain of transmitters.",
        "malay_translation": "Sebuah hadis yang serupa dengan ini telah diriwayatkan dengan sanad yang sama daripada Suhail.",
        "arabic_text": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، ح وحَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، كُلُّهُمْ عَنْ سُفْيَانَ، عَنْ سُهَيْلٍ، بِهَذَا الْإِسْنَادِ مِثْلَهُ، وَقَالُوا: «وَلَدٌ وَالِدَهُ."
      }
    ]
  }
}