{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 93,
    "data": [
      {
        "id": 9515,
        "hadith_number": "1951",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Mandi Sebelum Solat Jumaat",
        "perawi_melayu": "Diriwayatkan bahawa Abdullah mendengar Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda:",
        "english_text": "When any one of you intends to come for Jumu'a prayer, he should take a bath.",
        "malay_translation": "Apabila salah seorang daripada kamu ingin datang untuk solat Jumaat, maka hendaklah dia mandi.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ وَمُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ قَالَا أَخْبَرَنَا اللَّيْثُ ح و حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا لَيْثٌ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا أَرَادَ أَحَدُكُمْ أَنْ يَأْتِيَ الْجُمُعَةَ فَلْيَغْتَسِلْ."
      },
      {
        "id": 9516,
        "hadith_number": "1952",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Anjuran Mandi untuk Solat Jumaat",
        "perawi_melayu": "Abdullah bin Umar رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "The Messenger of Allah (ﷺ) was standing on the pulpit when he said this: He who comes for Jumu'a he should take a bath.",
        "malay_translation": "Rasulullah (ﷺ) sedang berdiri di atas mimbar ketika baginda bersabda: Sesiapa yang datang untuk solat Jumaat, hendaklah dia mandi.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنَا ابْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ وَهُوَ قَائِمٌ عَلَى الْمِنْبَرِ مَنْ جَاءَ مِنْكُمْ الْجُمُعَةَ فَلْيَغْتَسِلْ."
      },
      {
        "id": 9517,
        "hadith_number": "1953",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Serupa daripada Ibn Umar RA daripada Nabi ﷺ",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "A similar (report as no.1954) was narrated from Salim and Abdullah bin Umar, from Ibn Umar رضی اللہ تعالیٰ عنہ , from the prophet ﷺ.",
        "malay_translation": "Riwayat yang serupa (seperti no. 1954) telah diriwayatkan daripada Salim dan Abdullah bin Umar, daripada Ibn Umar رضی اللہ تعالیٰ عنہ, daripada Nabi ﷺ.",
        "arabic_text": "و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي ابْنُ شِهَابٍ عَنْ سَالِمٍ وَعَبْدِ اللَّهِ ابْنَيْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ."
      },
      {
        "id": 9518,
        "hadith_number": "1954",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Penyampaian Hadis Serupa oleh Rasulullah ﷺ",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "It was narrated from Salim bin Abdullah that this father said: I heard the Messenger of Allah ﷺ say a similar report (as no. 1952).",
        "malay_translation": "Diriwayatkan daripada Salim bin Abdullah bahawa bapanya berkata: Aku mendengar Rasulullah ﷺ bersabda laporan yang serupa (seperti no. 1952).",
        "arabic_text": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بِمِثْلِهِ."
      },
      {
        "id": 9519,
        "hadith_number": "1955",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Teguran Umar kepada Sahabat yang Lewat ke Solat Jumaat dan Perintah Mandi Jumaat",
        "perawi_melayu": "Abdullah bin 'Umar رضی اللہ تعالیٰ عنہ meriwayatkan daripada bapanya:",
        "english_text": "While he was addressing the people on Friday (sermon), a person, one of the Companions of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), entered (the mosque). Umar said to him loudly: What is this hour (for attending the prayer)? He said: I was busy today and I did not return to my house when I heard the call (to Friday prayer), and I did no more but performed ablution only. Upon this Umar said: just ablution! You know that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) commanded (us) to take a bath (on Friday).",
        "malay_translation": "Ketika Umar sedang berkhutbah kepada orang ramai pada hari Jumaat, seorang lelaki, seorang daripada Sahabat Rasulullah (ﷺ), masuk (ke masjid). Umar berkata kepadanya dengan suara yang kuat: Jam berapa ini (untuk menghadiri solat)? Dia berkata: Saya sibuk hari ini dan saya tidak pulang ke rumah saya apabila saya mendengar azan (untuk solat Jumaat), dan saya tidak melakukan lebih daripada berwuduk sahaja. Maka Umar berkata: Hanya berwuduk! Tidakkah kamu tahu bahawa Rasulullah (ﷺ) memerintahkan (kita) untuk mandi (pada hari Jumaat).",
        "arabic_text": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ عَنْ أَبِيهِ أَنَّ عُمَرَ بْنَ الْخَطَّابِ بَيْنَا هُوَ يَخْطُبُ النَّاسَ يَوْمَ الْجُمُعَةِ دَخَلَ رَجُلٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَادَاهُ عُمَرُ أَيَّةُ سَاعَةٍ هَذِهِ فَقَالَ إِنِّي شُغِلْتُ الْيَوْمَ فَلَمْ أَنْقَلِبْ إِلَى أَهْلِي حَتَّى سَمِعْتُ النِّدَاءَ فَلَمْ أَزِدْ عَلَى أَنْ تَوَضَّأْتُ قَالَ عُمَرُ وَالْوُضُوءَ أَيْضًا وَقَدْ عَلِمْتَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُ بِالْغُسْلِ."
      },
      {
        "id": 9520,
        "hadith_number": "1956",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kewajipan Mandi untuk Solat Jumaat",
        "perawi_melayu": "Abu Huraira رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "Umar bin Khattab رضی اللہ تعالیٰ عنہ was delivering a sermon to the people on Friday when 'Uthman bin 'Affan رضی اللہ تعالیٰ عنہ came there. 'Umar رضی اللہ تعالیٰ عنہ hinting to him said: What would become of those persons who come after the call to prayer? Upon this 'Uthman رضی اللہ تعالیٰ عنہ said: Commander of the faithful, I did no more than this that after listening to the call, I performed ablution and came (to the mosque). 'Umar said: Just ablution! Did you not hear the Messenger of Allah (my peace be upon him) say this: When any one of you comes for Jumu'a, he should take a bath.",
        "malay_translation": "Umar bin Khattab رضی اللہ تعالیٰ عنہ sedang menyampaikan khutbah kepada orang ramai pada hari Jumaat apabila 'Uthman bin 'Affan رضی اللہ تعالیٰ عنہ datang ke sana. 'Umar رضی اللہ تعالیٰ عنہ memberi isyarat kepadanya dan berkata: Apa akan jadi kepada orang-orang yang datang selepas azan? Lalu 'Uthman رضی اللہ تعالیٰ عنہ berkata: Wahai Amirul Mukminin, saya tidak melakukan lebih daripada ini, iaitu selepas mendengar azan, saya berwuduk dan datang (ke masjid). 'Umar berkata: Hanya wuduk sahaja! Tidakkah kamu mendengar Rasulullah (صلی اللہ علیہ وسلم) bersabda: Apabila salah seorang daripada kamu datang untuk Jumaat, hendaklah dia mandi.",
        "arabic_text": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ الْأَوْزَاعِيِّ قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنِي أَبُو هُرَيْرَةَ قَالَ بَيْنَمَا عُمَرُ بْنُ الْخَطَّابِ يَخْطُبُ النَّاسَ يَوْمَ الْجُمُعَةِ إِذْ دَخَلَ عُثْمَانُ بْنُ عَفَّانَ فَعَرَّضَ بِهِ عُمَرُ فَقَالَ مَا بَالُ رِجَالٍ يَتَأَخَّرُونَ بَعْدَ النِّدَاءِ فَقَالَ عُثْمَانُ يَا أَمِيرَ الْمُؤْمِنِينَ مَا زِدْتُ حِينَ سَمِعْتُ النِّدَاءَ أَنْ تَوَضَّأْتُ ثُمَّ أَقْبَلْتُ فَقَالَ عُمَرُ وَالْوُضُوءَ أَيْضًا أَلَمْ تَسْمَعُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا جَاءَ أَحَدُكُمْ إِلَى الْجُمُعَةِ فَلْيَغْتَسِلْ."
      },
      {
        "id": 9521,
        "hadith_number": "1957",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kewajipan Mandi pada Hari Jumaat bagi Setiap Orang Dewasa",
        "perawi_melayu": "Sa'id al-Khudri رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Taking a bath on Friday is essential for every adult person",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Mandi pada hari Jumaat adalah wajib bagi setiap orang dewasa.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْغُسْلُ يَوْمَ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ."
      },
      {
        "id": 9522,
        "hadith_number": "1958",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Galakan Membersihkan Diri untuk Solat Jumaat",
        "perawi_melayu": "Aisha رضی اللہ تعالیٰ عنہa meriwayatkan:",
        "english_text": "The people came for Jumu'a prayer from their houses in the neighbouring villages dressed in woollen garments on which dust was settled and this emitted a foul smell. A person among them (those who were dressed so) came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) while he was in my house. The Messenger of Allah (ﷺ) said to him: Were you to cleanse yourselves on this day.",
        "malay_translation": "Orang ramai datang untuk solat Jumaat dari rumah-rumah mereka di kampung-kampung berdekatan berpakaian pakaian bulu yang berdebu dan berbau hapak. Seorang daripada mereka (yang berpakaian sedemikian) datang kepada Rasulullah (ﷺ) ketika baginda berada di rumah saya. Rasulullah (ﷺ) bersabda kepadanya: Tidakkah kamu membersihkan diri pada hari ini?",
        "arabic_text": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ وَأَحْمَدُ بْنُ عِيسَى قَالَا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ أَنَّ مُحَمَّدَ بْنَ جَعْفَرٍ حَدَّثَهُ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ أَنَّهَا قَالَتْ كَانَ النَّاسُ يَنْتَابُونَ الْجُمُعَةَ مِنْ مَنَازِلِهِمْ مِنْ الْعَوَالِي فَيَأْتُونَ فِي الْعَبَاءِ وَيُصِيبُهُمْ الْغُبَارُ فَتَخْرُجُ مِنْهُمْ الرِّيحُ فَأَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْسَانٌ مِنْهُمْ وَهُوَ عِنْدِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ أَنَّكُمْ تَطَهَّرْتُمْ لِيَوْمِكُمْ هَذَا."
      },
      {
        "id": 9523,
        "hadith_number": "1959",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Galakan Mandi Jumaat bagi Pekerja",
        "perawi_melayu": "Aisyah رضی اللہ تعالیٰ عنہا meriwayatkan:",
        "english_text": "The people (mostly) were workers and they had no servants. Ill-smell thus emitted out of them. It was said to them: Were you to take bath on Friday.",
        "malay_translation": "Orang ramai (kebanyakannya) adalah pekerja dan mereka tidak mempunyai pembantu rumah. Bau busuk keluar dari mereka. Dikatakan kepada mereka: Sekiranya kamu mandi pada hari Jumaat.",
        "arabic_text": "و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ أَنَّهَا قَالَتْ كَانَ النَّاسُ أَهْلَ عَمَلٍ وَلَمْ يَكُنْ لَهُمْ كُفَاةٌ فَكَانُوا يَكُونُ لَهُمْ تَفَلٌ فَقِيلَ لَهُمْ لَوْ اغْتَسَلْتُمْ يَوْمَ الْجُمُعَةِ."
      },
      {
        "id": 9524,
        "hadith_number": "1960",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kewajipan Mandi Jumaat, Miswak, dan Wangian",
        "perawi_melayu": "Abd al-Rahman bin Abd Sa'id al-Khudri رضی اللہ تعالیٰ عنہ meriwayatkan daripada bapanya:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Bathing on Friday for every adult, using of Miswak and applying some perfume, that is available-these are essential. So far as the perfume is concerned, it may be that used by a lady.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Mandi pada hari Jumaat bagi setiap orang dewasa, menggunakan Miswak dan memakai sedikit wangian, yang ada - ini adalah penting. Mengenai wangian itu, ia mungkin yang digunakan oleh seorang wanita.",
        "arabic_text": "و حَدَّثَنَا عَمْرُو بْنُ سَوَّادٍ الْعَامِرِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنَا عَمْرُو بْنُ الْحَارِثِ أَنَّ سَعِيدَ بْنَ أَبِي هِلَالٍ وَبُكَيْرَ بْنَ الْأَشَجِّ حَدَّثَاهُ عَنْ أَبِي بَكْرِ بْنِ الْمُنْكَدِرِ عَنْ عَمْرِو بْنِ سُلَيْمٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ غُسْلُ يَوْمِ الْجُمُعَةِ عَلَى كُلِّ مُحْتَلِمٍ وَسِوَاكٌ وَيَمَسُّ مِنْ الطِّيبِ مَا قَدَرَ عَلَيْهِ إِلَّا أَنَّ بُكَيْرًا لَمْ يَذْكُرْ عَبْدَ الرَّحْمَنِ وَقَالَ فِي الطِّيبِ وَلَوْ مِنْ طِيبِ الْمَرْأَةِ."
      },
      {
        "id": 9525,
        "hadith_number": "1961",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Mandi pada Hari Jumaat dan Penggunaan Minyak Wangi",
        "perawi_melayu": "Tawus meriwayatkan bahawa Ibn Abbas رضی اللہ تعالیٰ عنہ menceritakan kata-kata:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) about taking bath on Friday. Tawus said: I asked Ibn Abbas it one should apply to oneself perfume or oil which is available with his wife. He (Ibn Abbas) said: I do not know of it.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) mengenai mandi pada hari Jumaat. Tawus berkata: Saya bertanya kepada Ibn Abbas sama ada seseorang patut menggunakan minyak wangi atau minyak yang ada pada isterinya. Beliau (Ibn Abbas) berkata: Saya tidak tahu mengenainya.",
        "arabic_text": "حَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا ابْنُ جُرَيْجٍ ح و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي إِبْرَاهِيمُ بْنُ مَيْسَرَةَ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ أَنَّهُ ذَكَرَ قَوْلَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْغُسْلِ يَوْمَ الْجُمُعَةِ قَالَ طَاوُسٌ فَقُلْتُ لِابْنِ عَبَّاسٍ وَيَمَسُّ طِيبًا أَوْ دُهْنًا إِنْ كَانَ عِنْدَ أَهْلِهِ قَالَ لَا أَعْلَمُهُ."
      },
      {
        "id": 9526,
        "hadith_number": "1962",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Riwayat Hadis oleh Ibn Juraij dengan Sanad yang Sama",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "This hadith has been narrated by Ibn Juraij with the came chain of transmitters.",
        "malay_translation": "Hadis ini telah diriwayatkan oleh Ibn Juraij dengan sanad yang sama.",
        "arabic_text": "و حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ ح و حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ كِلَاهُمَا عَنْ ابْنِ جُرَيْجٍ بِهَذَا الْإِسْنَادِ."
      },
      {
        "id": 9527,
        "hadith_number": "1963",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kewajipan Mandi pada Hari Jumaat",
        "perawi_melayu": "Abu Hurairah رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said. it is the right of Allah upon every Muslim that he should take a bath (at least) on one day (Friday) during the seven days (of the week) and he should wash his head and body.",
        "malay_translation": "Rasulullah ﷺ bersabda, 'Merupakan hak Allah ke atas setiap Muslim untuk mandi (sekurang-kurangnya) pada satu hari (Jumaat) dalam tujuh hari (seminggu) dan dia hendaklah mencuci kepala dan badannya.'",
        "arabic_text": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا بَهْزٌ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ طَاوُسٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حَقٌّ لِلَّهِ عَلَى كُلِّ مُسْلِمٍ أَنْ يَغْتَسِلَ فِي كُلِّ سَبْعَةِ أَيَّامٍ يَغْسِلُ رَأْسَهُ وَجَسَدَهُ."
      },
      {
        "id": 9528,
        "hadith_number": "1964",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Mandi Jumaat dan Kehadiran Awal ke Masjid",
        "perawi_melayu": "Abu Hurairah Radiyallahu Anhu meriwayatkan:",
        "english_text": "The Messenger of, Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said. He who takes a bath on Friday, the bath which is obligatory after the sexual discharge and then goes (to the mosque), he is like one who offers a she-camel as a sacrifice, and he who comes at the second hour would be like one who offers a cow, and he who comes at the third hour is live one who offers a ram with horns, and he who comes at the fourth hour is like one who offers a hen, and he who comes at the fifth hour is like one who offers an egg. And when the Imam comes out, the angels are also present and listen to the mention of God (the sermon).",
        "malay_translation": "Rasulullah ﷺ bersabda: Sesiapa yang mandi pada hari Jumaat, mandi yang wajib setelah junub, kemudian pergi (ke masjid), dia adalah seperti orang yang mengorbankan seekor unta betina. Sesiapa yang datang pada jam kedua adalah seperti orang yang mengorbankan seekor lembu. Sesiapa yang datang pada jam ketiga adalah seperti orang yang mengorbankan seekor kibas bertanduk. Sesiapa yang datang pada jam keempat adalah seperti orang yang mengorbankan seekor ayam betina. Sesiapa yang datang pada jam kelima adalah seperti orang yang mengorbankan sebiji telur. Dan apabila Imam keluar (untuk berkhutbah), para malaikat juga hadir dan mendengar zikir kepada Allah (khutbah).",
        "arabic_text": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكِ بْنِ أَنَسٍ فِيمَا قُرِئَ عَلَيْهِ عَنْ سُمَيٍّ مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ السَّمَّانِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اغْتَسَلَ يَوْمَ الْجُمُعَةِ غُسْلَ الْجَنَابَةِ ثُمَّ رَاحَ فَكَأَنَّمَا قَرَّبَ بَدَنَةً وَمَنْ رَاحَ فِي السَّاعَةِ الثَّانِيَةِ فَكَأَنَّمَا قَرَّبَ بَقَرَةً وَمَنْ رَاحَ فِي السَّاعَةِ الثَّالِثَةِ فَكَأَنَّمَا قَرَّبَ كَبْشًا أَقْرَنَ وَمَنْ رَاحَ فِي السَّاعَةِ الرَّابِعَةِ فَكَأَنَّمَا قَرَّبَ دَجَاجَةً وَمَنْ رَاحَ فِي السَّاعَةِ الْخَامِسَةِ فَكَأَنَّمَا قَرَّبَ بَيْضَةً فَإِذَا خَرَجَ الْإِمَامُ حَضَرَتْ الْمَلَائِكَةُ يَسْتَمِعُونَ الذِّكْرَ."
      },
      {
        "id": 9529,
        "hadith_number": "1965",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Bercakap-cakap Semasa Khutbah Jumaat",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ تعالیٰ عنہ:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: If you (even) ask your companion to be quiet on Friday while the Imam is delivering the sermon, you have in fact talked irrelevance.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Jika kamu (sekalipun) meminta temanmu untuk diam pada hari Jumaat ketika Imam sedang menyampaikan khutbah, maka sesungguhnya kamu telah berbicara sia-sia.",
        "arabic_text": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ قَالَ ابْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ أَنَّ أَبَا هُرَيْرَةَ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قُلْتَ لِصَاحِبِكَ أَنْصِتْ يَوْمَ الْجُمُعَةِ وَالْإِمَامُ يَخْطُبُ فَقَدْ لَغَوْتَ."
      },
      {
        "id": 9530,
        "hadith_number": "1966",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis dari Sanad Lain oleh Abu Hurairah",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "A hadith like this has been narrated by Abu Huraira رضی اللہ تعالیٰ عنہ by another chain of transmitters.",
        "malay_translation": "Hadis seperti ini telah diriwayatkan oleh Abu Hurairah رضی اللہ تعالیٰ عنہ melalui sanad periwayatan yang lain.",
        "arabic_text": "و حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ حَدَّثَنِي أَبِي عَنْ جَدِّي حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ عَنْ ابْنِ شِهَابٍ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ عَبْدِ اللَّهِ بْنِ إِبْرَاهِيمَ بْنِ قَارِظٍ وَعَنْ ابْنِ الْمُسَيَّبِ أَنَّهُمَا حَدَّثَاهُ أَنَّ أَبَا هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بِمِثْلِهِ."
      },
      {
        "id": 9531,
        "hadith_number": "1967",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Serupa dengan Sanad yang Berbeza",
        "perawi_melayu": "Diriwayatkan oleh Ibn Juraij:",
        "english_text": "A similar Hadith (as no. 1965) from Ibn Shihab with both chains, except that Ibn Juraij said: Ibrahim bin 'Abdullah bin Qariz.",
        "malay_translation": "Hadis yang serupa (seperti no. 1965) daripada Ibn Shihab dengan kedua-dua sanad, kecuali bahawa Ibn Juraij berkata: Ibrahim bin 'Abdullah bin Qariz.",
        "arabic_text": "و حَدَّثَنِيهِ مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي ابْنُ شِهَابٍ بِالْإِسْنَادَيْنِ جَمِيعًا فِي هَذَا الْحَدِيثِ مِثْلَهُ غَيْرَ أَنَّ ابْنَ جُرَيْجٍ قَالَ إِبْرَاهِيمُ بْنُ عَبْدِ اللَّهِ بْنِ قَارِظٍ."
      },
      {
        "id": 9532,
        "hadith_number": "1968",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Bercakap-cakap Semasa Khutbah Jumaat",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah رضی اللہ تعالیٰ عنہ :",
        "english_text": "The prophet ﷺ said: \"If you say to your companion: Listen attentively on a Friday, While the Imam is delivering the Khutbah, then you have engaged in Idle speech.\"",
        "malay_translation": "Nabi ﷺ bersabda: \"Jika kamu berkata kepada sahabatmu: 'Dengar dengan teliti' pada hari Jumaat, ketika Imam sedang menyampaikan Khutbah, maka sesungguhnya kamu telah melakukan perbuatan sia-sia.\"",
        "arabic_text": "و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قُلْتَ لِصَاحِبِكَ أَنْصِتْ يَوْمَ الْجُمُعَةِ وَالْإِمَامُ يَخْطُبُ فَقَدْ لَغِيتَ قَالَ أَبُو الزِّنَادِ هِيَ لُغَةُ أَبِي هُرَيْرَةَ وَإِنَّمَا هُوَ فَقَدْ لَغَوْتَ."
      },
      {
        "id": 9533,
        "hadith_number": "1969",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Waktu Mustajab Doa pada Hari Jumaat",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah رضی اللہ تعالیٰ عنہ:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There is a time on Friday at which no Muslim servant would pray and would ask Allah for a thing (that is good) but He would give it to him. Qutaiba pointed with the help of his hand that it (the time) is short.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Sesungguhnya pada hari Jumaat ada suatu waktu, tidaklah seorang hamba Muslim pun berdiri solat dan memohon sesuatu kebaikan kepada Allah, melainkan Allah akan mengabulkannya. Qutaiba memberi isyarat dengan tangannya bahawa waktu itu singkat.",
        "arabic_text": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ ح و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرَ يَوْمَ الْجُمُعَةِ فَقَالَ فِيهِ سَاعَةٌ لَا يُوَافِقُهَا عَبْدٌ مُسْلِمٌ وَهُوَ يُصَلِّي يَسْأَلُ اللَّهَ شَيْئًا إِلَّا أَعْطَاهُ إِيَّاهُ زَادَ قُتَيْبَةُ فِي رِوَايَتِهِ وَأَشَارَ بِيَدِهِ يُقَلِّلُهَا."
      },
      {
        "id": 9534,
        "hadith_number": "1970",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Waktu Mustajab Doa pada Hari Jumaat",
        "perawi_melayu": "Abu Huraira رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "Abu'l-Qasim (the kunya of the Holy Prophet) ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: There is a time on Friday at which no Muslim would stand and pray and beg Allah for what Is good but He would give it to him; and he pointed with his hand that (this time) is short and narrow.",
        "malay_translation": "Abu al-Qasim (gelaran Nabi Muhammad SAW) (صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Sesungguhnya pada hari Jumaat ada suatu waktu yang tidaklah seorang Muslim berdiri menunaikan solat dan memohon sesuatu kebaikan kepada Allah, melainkan Dia akan mengabulkannya; dan baginda memberi isyarat dengan tangannya bahawa (waktu) itu singkat dan sebentar.",
        "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَيُّوبُ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ فِي الْجُمُعَةِ لَسَاعَةً لَا يُوَافِقُهَا مُسْلِمٌ قَائِمٌ يُصَلِّي يَسْأَلُ اللَّهَ خَيْرًا إِلَّا أَعْطَاهُ إِيَّاهُ وَقَالَ بِيَدِهِ يُقَلِّلُهَا يُزَهِّدُهَا."
      },
      {
        "id": 9535,
        "hadith_number": "1971",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Laporan Serupa dengan Hadis Sebelumnya",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "It was narrated that Abu Huraira رضی اللہ تعالیٰ عنہ said:...\" a similar report (as no 1970).",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah رضی اللہ تعالیٰ عنہ berkata: ...\" laporan yang serupa (seperti no 1970).",
        "arabic_text": "حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ ابْنِ عَوْنٍ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ."
      },
      {
        "id": 9536,
        "hadith_number": "1972",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Diriwayatkan oleh Abu Hurairah melalui Rantaian Sanad Lain",
        "perawi_melayu": "Tiada Perawi",
        "english_text": "This hadith has been narrated by Abu Huraira رضی اللہ تعالیٰ عنہ by another chain of transmitters.",
        "malay_translation": "Hadis ini diriwayatkan oleh Abu Huraira رضی اللہ تعالیٰ عنہ melalui rantaian sanad yang lain.",
        "arabic_text": "و حَدَّثَنِي حُمَيْدُ بْنُ مَسْعَدَةَ الْبَاهِلِيُّ حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ مُفَضَّلٍ حَدَّثَنَا سَلَمَةُ وَهُوَ ابْنُ عَلْقَمَةَ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ."
      },
      {
        "id": 9537,
        "hadith_number": "1973",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Waktu Mustajab Doa pada Hari Jumaat",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah رضی اللہ تعالیٰ عنہ:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: There is a time on Friday at which no Muslim would ask Allah for what is good but He would give it to him. And further said: This is a very short time.",
        "malay_translation": "Rasulullah ﷺ bersabda: Sesungguhnya pada hari Jumaat ada suatu waktu yang tidaklah seorang Muslim meminta kepada Allah kebaikan pada waktu itu melainkan Allah akan memberikannya kepadanya. Dan baginda bersabda lagi: Waktu itu sangat singkat.",
        "arabic_text": "و حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَلَّامٍ الْجُمَحِيُّ حَدَّثَنَا الرَّبِيعُ يَعْنِي ابْنَ مُسْلِمٍ عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِنَّ فِي الْجُمُعَةِ لَسَاعَةً لَا يُوَافِقُهَا مُسْلِمٌ يَسْأَلُ اللَّهَ فِيهَا خَيْرًا إِلَّا أَعْطَاهُ إِيَّاهُ قَالَ وَهِيَ سَاعَةٌ خَفِيفَةٌ."
      },
      {
        "id": 9538,
        "hadith_number": "1974",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah SAW Tidak Menyatakan Masa Itu Singkat",
        "perawi_melayu": "Hammam bin Munabbih meriwayatkan hadis ini daripada Abu Hurairah رضی اللہ تعالیٰ عنہ yang meriwayatkan:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) but he did not say: That time is short.",
        "malay_translation": "Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) tetapi baginda tidak bersabda: 'Masa itu singkat.'",
        "arabic_text": "و حَدَّثَنَاه مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَقُلْ وَهِيَ سَاعَةٌ خَفِيفَةٌ."
      },
      {
        "id": 9539,
        "hadith_number": "1975",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Waktu Mustajab Doa pada Hari Jumaat",
        "perawi_melayu": "Abu Burda bin Abu Musa al-Ash'ari رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "'Abdullah bin Umar رضی اللہ تعالیٰ عنہ said to me: Did you hear anything from your father narrating something from the messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about the time on Friday? I said: Yes, I heard him say from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) (these words): It is between the time when the Imam sits down and the end of the prayer.",
        "malay_translation": "'Abdullah bin Umar رضی اللہ تعالیٰ عنہ berkata kepada saya: “Adakah kamu mendengar apa-apa daripada ayahmu meriwayatkan sesuatu daripada Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) tentang waktu pada hari Jumaat?” Saya berkata: “Ya, saya mendengar beliau berkata daripada Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) (kata-kata ini): “Ia adalah antara waktu imam duduk dan berakhirnya solat.”",
        "arabic_text": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَعَلِيُّ بْنُ خَشْرَمٍ قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ عَنْ مَخْرَمَةَ بْنِ بُكَيْرٍ ح و حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ وَأَحْمَدُ بْنُ عِيسَى قَالَا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنَا مَخْرَمَةُ عَنْ أَبِيهِ عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَ قَالَ لِي عَبْدُ اللَّهِ بْنُ عُمَرَ أَسَمِعْتَ أَبَاكَ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي شَأْنِ سَاعَةِ الْجُمُعَةِ قَالَ قُلْتُ نَعَمْ سَمِعْتُهُ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ هِيَ مَا بَيْنَ أَنْ يَجْلِسَ الْإِمَامُ إِلَى أَنْ تُقْضَى الصَّلَاةُ."
      },
      {
        "id": 9540,
        "hadith_number": "1976",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Hari Jumaat",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ تعالیٰ عنہ:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The best day on which the sun has risen is Friday; on it Adam was created, on it he was made to enter Paradise, on it he was expelled from it.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Hari terbaik di mana matahari terbit adalah hari Jumaat; pada hari itu Adam diciptakan, pada hari itu dia dimasukkan ke dalam Syurga, dan pada hari itu dia dikeluarkan daripadanya.",
        "arabic_text": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ الْأَعْرَجُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ يَوْمٍ طَلَعَتْ عَلَيْهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ أُدْخِلَ الْجَنَّةَ وَفِيهِ أُخْرِجَ مِنْهَا."
      },
      {
        "id": 9541,
        "hadith_number": "1977",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Hari Jumaat: Hari Terbaik, Penciptaan Adam, Kemasukan ke Syurga dan Hari Kiamat",
        "perawi_melayu": "Diriwayatkan oleh Abu Huraira رضی اللہ تعالیٰ عنہ:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The best day on which the sun has risen is Friday; on it Adam was created. on it he was made to enter Paradise, on it he was expelled from it. And the last hour will take place on no day other than Friday.",
        "malay_translation": "Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Hari terbaik di mana matahari terbit adalah hari Jumaat; pada hari itu Adam diciptakan. Pada hari itu dia dimasukkan ke dalam Syurga, pada hari itu dia dikeluarkan daripadanya. Dan hari kiamat tidak akan berlaku kecuali pada hari Jumaat.",
        "arabic_text": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا الْمُغِيرَةُ يَعْنِي الْحِزَامِيَّ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَيْرُ يَوْمٍ طَلَعَتْ عَلَيْهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ أُدْخِلَ الْجَنَّةَ وَفِيهِ أُخْرِجَ مِنْهَا وَلَا تَقُومُ السَّاعَةُ إِلَّا فِي يَوْمِ الْجُمُعَةِ."
      },
      {
        "id": 9542,
        "hadith_number": "1978",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Umat Islam pada Hari Kiamat",
        "perawi_melayu": "Abu Huraira رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: We who are the last shall be the first on the Day of Resurrection, except that every Ummah was given the Book before us and we were given it after them. It was this day which Allah prescribed for us and guided us to it and the people came after us with regard to it, the Jews observing the next day and the Christians the day following that.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Kita yang terakhir akan menjadi yang pertama pada Hari Kiamat, kecuali setiap umat telah diberikan Kitab sebelum kita dan kita diberikan Kitab setelah mereka. Ia adalah hari ini yang telah Allah tetapkan untuk kita dan memberikan petunjuk kepada kita kepadanya dan orang-orang datang setelah kita berkenaan dengannya, orang Yahudi mengamati hari berikutnya dan orang Kristian hari berikutnya selepas itu.",
        "arabic_text": "و حَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْنُ الْآخِرُونَ وَنَحْنُ السَّابِقُونَ يَوْمَ الْقِيَامَةِ بَيْدَ أَنَّ كُلَّ أُمَّةٍ أُوتِيَتْ الْكِتَابَ مِنْ قَبْلِنَا وَأُوتِينَاهُ مِنْ بَعْدِهِمْ ثُمَّ هَذَا الْيَوْمُ الَّذِي كَتَبَهُ اللَّهُ عَلَيْنَا هَدَانَا اللَّهُ لَهُ فَالنَّاسُ لَنَا فِيهِ تَبَعٌ الْيَهُودُ غَدًا وَالنَّصَارَى بَعْدَ غَدٍ."
      },
      {
        "id": 9543,
        "hadith_number": "1979",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Umat Terakhir, yang Pertama pada Hari Kiamat",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah رضي الله عنه :",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: We are the last and would be the first on the Day of Resurrection.",
        "malay_translation": "Rasulullah ﷺ bersabda: Kita adalah yang terakhir (datang ke dunia) dan akan menjadi yang pertama (dibangkitkan) pada Hari Kiamat.",
        "arabic_text": "و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ وَابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْنُ الْآخِرُونَ وَنَحْنُ السَّابِقُونَ يَوْمَ الْقِيَامَةِ بِمِثْلِهِ."
      },
      {
        "id": 9544,
        "hadith_number": "1980",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Umat Muhammad dan Hari Jumaat",
        "perawi_melayu": "Abu Huraira رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: We are the last (but) we would be the first on the Day of Resurrection, and we would be the first to enter Paradise, but that they were given the Book before us and we were given after them. They disagreed and Allah guided us aright on whatever they disagreed regarding the truth. And it was this day of theirs about which they disagreed, but Allah guided us to it, and that is Friday for us; the next day is for the Jews and the day following for the Christians.",
        "malay_translation": "Rasulullah (صلی اللہ علیہ وسلم) bersabda: Kita adalah yang terakhir (dalam kedatangan ke dunia) tetapi kita akan menjadi yang pertama pada Hari Kiamat, dan kita akan menjadi yang pertama memasuki Syurga. Namun, mereka (umat terdahulu) diberikan Kitab sebelum kita dan kita diberikan setelah mereka. Mereka berselisih pendapat dan Allah memberikan petunjuk kepada kita mengenai kebenaran yang mereka perselisihkan. Dan hari inilah yang mereka perselisihkan, tetapi Allah memberikan petunjuk kepada kita kepadanya, iaitu hari Jumaat bagi kita; hari berikutnya adalah untuk Yahudi dan hari berikutnya lagi untuk Kristian.",
        "arabic_text": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْنُ الْآخِرُونَ الْأَوَّلُونَ يَوْمَ الْقِيَامَةِ وَنَحْنُ أَوَّلُ مَنْ يَدْخُلُ الْجَنَّةَ بَيْدَ أَنَّهُمْ أُوتُوا الْكِتَابَ مِنْ قَبْلِنَا وَأُوتِينَاهُ مِنْ بَعْدِهِمْ فَاخْتَلَفُوا فَهَدَانَا اللَّهُ لِمَا اخْتَلَفُوا فِيهِ مِنْ الْحَقِّ فَهَذَا يَوْمُهُمْ الَّذِي اخْتَلَفُوا فِيهِ هَدَانَا اللَّهُ لَهُ قَالَ يَوْمُ الْجُمُعَةِ فَالْيَوْمَ لَنَا وَغَدًا لِلْيَهُودِ وَبَعْدَ غَدٍ لِلنَّصَارَى."
      },
      {
        "id": 9545,
        "hadith_number": "1981",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Umat Muhammad pada Hari Kiamat",
        "perawi_melayu": "Abu Huraira رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "Muhammad, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), as saying: We who are the last would be the first on the Day of Resurrection but they (other Ummahs) were given the Book before us and we were given after them, and this was the day that was prescribed for them but they disagreed on it. And Allah guided us to it. and they came after us with regard to it, the Jews observing the next day and the Christians the day following that.",
        "malay_translation": "Muhammad, Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌), bersabda: Kita yang terakhir (umat ini) akan menjadi yang pertama pada Hari Kiamat, tetapi mereka (umat-umat lain) telah diberikan Kitab sebelum kita dan kita diberikan setelah mereka. Dan ini adalah hari yang telah ditetapkan untuk mereka tetapi mereka berselisih mengenainya. Dan Allah telah memberi petunjuk kepada kita mengenainya. Dan mereka datang setelah kita berkenaan dengannya, orang Yahudi mengamalkannya pada hari berikutnya dan orang Kristian pada hari selepas itu.",
        "arabic_text": "و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ أَخِي وَهْبِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ مُحَمَّدٍ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْنُ الْآخِرُونَ السَّابِقُونَ يَوْمَ الْقِيَامَةِ بَيْدَ أَنَّهُمْ أُوتُوا الْكِتَابَ مِنْ قَبْلِنَا وَأُوتِينَاهُ مِنْ بَعْدِهِمْ وَهَذَا يَوْمُهُمْ الَّذِي فُرِضَ عَلَيْهِمْ فَاخْتَلَفُوا فِيهِ فَهَدَانَا اللَّهُ لَهُ فَهُمْ لَنَا فِيهِ تَبَعٌ فَالْيَهُودُ غَدًا وَالنَّصَارَى بَعْدَ غَدٍ."
      },
      {
        "id": 9546,
        "hadith_number": "1982",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Hari Jumaat dan Kedudukan Umat Islam",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ تعالیٰ عنہ dan Hudhaifah رضی اللہ تعالیٰ عنہ :",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: It was Friday from which Allah diverted those who were before us. For the Jews (the day set aside for prayer) was Sabt (Saturday), and for the Christians it was Sunday. And Allah turned towards us and guided us to Friday (as the day of prayer) for us. In fact, He (Allah) made Friday, Saturday and Sunday (as days of prayer). In this order would they (Jews and Christians) come after us on the Day of Resurrection. We are the last of (the Ummahs) among the people in this world and the first among the created to be judged on the Day of Resurrection. In one narration it is: to be judged among them .",
        "malay_translation": "Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Hari Jumaat adalah hari yang Allah palingkan daripada orang-orang sebelum kita. Bagi Yahudi (hari yang dikhususkan untuk ibadah) adalah Sabt (Sabtu), dan bagi Kristian adalah Ahad (Minggu). Dan Allah berpaling kepada kita dan memberi petunjuk kepada kita kepada hari Jumaat (sebagai hari ibadah) untuk kita. Bahkan, Dia (Allah) menjadikan hari Jumaat, Sabtu dan Ahad (sebagai hari ibadah). Dalam urutan ini mereka (Yahudi dan Kristian) akan datang selepas kita pada Hari Kiamat. Kita adalah yang terakhir dari (umat-umat) di antara manusia di dunia ini dan yang pertama di antara makhluk yang akan dihakimi pada Hari Kiamat. Dalam satu riwayat disebutkan: untuk dihakimi di antara mereka.",
        "arabic_text": "و حَدَّثَنَا أَبُو كُرَيْبٍ وَوَاصِلُ بْنُ عَبْدِ الْأَعْلَى قَالَا حَدَّثَنَا ابْنُ فُضَيْلٍ عَنْ أَبِي مَالِكٍ الْأَشْجَعِيِّ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ وَعَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ حُذَيْفَةَ قَالَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَضَلَّ اللَّهُ عَنْ الْجُمُعَةِ مَنْ كَانَ قَبْلَنَا فَكَانَ لِلْيَهُودِ يَوْمُ السَّبْتِ وَكَانَ لِلنَّصَارَى يَوْمُ الْأَحَدِ فَجَاءَ اللَّهُ بِنَا فَهَدَانَا اللَّهُ لِيَوْمِ الْجُمُعَةِ فَجَعَلَ الْجُمُعَةَ وَالسَّبْتَ وَالْأَحَدَ وَكَذَلِكَ هُمْ تَبَعٌ لَنَا يَوْمَ الْقِيَامَةِ نَحْنُ الْآخِرُونَ مِنْ أَهْلِ الدُّنْيَا وَالْأَوَّلُونَ يَوْمَ الْقِيَامَةِ الْمَقْضِيُّ لَهُمْ قَبْلَ الْخَلَائِقِ وَفِي رِوَايَةِ وَاصِلٍ الْمَقْضِيُّ بَيْنَهُمْ."
      },
      {
        "id": 9547,
        "hadith_number": "1983",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Petunjuk Hari Jumaat dan Penyelewengan Umat Terdahulu",
        "perawi_melayu": "Diriwayatkan dari Huraira رضی اللہ تعالیٰ عنہ:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: We were guided aright to Friday (as a day of prayer and meditation), but Allah diverted those who were before us from it. The rest of the hadith is the same.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Kami telah diberi petunjuk yang benar mengenai hari Jumaat (sebagai hari solat dan renungan), tetapi Allah telah memesongkan mereka yang sebelum kami daripadanya. Selebihnya hadis adalah sama.",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ أَخْبَرَنَا ابْنُ أَبِي زَائِدَةَ عَنْ سَعْدِ بْنِ طَارِقٍ حَدَّثَنِي رِبْعِيُّ بْنُ حِرَاشٍ عَنْ حُذَيْفَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُدِينَا إِلَى الْجُمُعَةِ وَأَضَلَّ اللَّهُ عَنْهَا مَنْ كَانَ قَبْلَنَا فَذَكَرَ بِمَعْنَى حَدِيثِ ابْنِ فُضَيْلٍ."
      },
      {
        "id": 9548,
        "hadith_number": "1984",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Datang Awal untuk Solat Jumaat",
        "perawi_melayu": "Abu Huraira رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When it is Friday, the angels stand at every door of the mosque and record the people in the order of their arrival, and when the Imam sits (on the pulpit for delivering the sermon) they fold up their sheets (manuscripts of the Qur'an) and listen to the mention (of Allah). And he who comes early is like one who offers a she-camel as a sacrifice, the next like one who offers a cow, the next a ram, the next a hen, the next an egg.",
        "malay_translation": "Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Apabila tiba hari Jumaat, para malaikat berdiri di setiap pintu masjid dan mencatat orang-orang mengikut urutan kedatangan mereka, dan apabila Imam duduk (di atas mimbar untuk menyampaikan khutbah) mereka melipat lembaran-lembaran mereka (manuskrip Al-Quran) dan mendengar sebutan (zikir kepada Allah). Dan sesiapa yang datang awal adalah seperti orang yang mengorbankan seekor unta betina, kemudian seperti orang yang mengorbankan seekor lembu, kemudian seekor biri-biri, kemudian seekor ayam betina, kemudian sebiji telur.",
        "arabic_text": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ وَعَمْرُو بْنُ سَوَّادٍ الْعَامِرِيُّ قَالَ أَبُو الطَّاهِرِ حَدَّثَنَا و قَالَ الْآخَرَانِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي أَبُو عَبْدِ اللَّهِ الْأَغَرُّ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ يَوْمُ الْجُمُعَةِ كَانَ عَلَى كُلِّ بَابٍ مِنْ أَبْوَابِ الْمَسْجِدِ مَلَائِكَةٌ يَكْتُبُونَ الْأَوَّلَ فَالْأَوَّلَ فَإِذَا جَلَسَ الْإِمَامُ طَوَوْا الصُّحُفَ وَجَاءُوا يَسْتَمِعُونَ الذِّكْرَ وَمَثَلُ الْمُهَجِّرِ كَمَثَلِ الَّذِي يُهْدِي الْبَدَنَةَ ثُمَّ كَالَّذِي يُهْدِي بَقَرَةً ثُمَّ كَالَّذِي يُهْدِي الْكَبْشَ ثُمَّ كَالَّذِي يُهْدِي الدَّجَاجَةَ ثُمَّ كَالَّذِي يُهْدِي الْبَيْضَةَ."
      },
      {
        "id": 9549,
        "hadith_number": "1985",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Riwayat Abu Huraira melalui Rantaian Sanad Lain",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "This hadith has been narrated by Abu Huraira رضی اللہ عنہ through another chain of transmitters.",
        "malay_translation": "Hadis ini telah diriwayatkan oleh Abu Huraira رضی اللہ عنہ melalui rantaian sanad yang lain.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَعَمْرٌو النَّاقِدُ عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ."
      },
      {
        "id": 9550,
        "hadith_number": "1986",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Malaikat Mencatat Kedatangan Awal ke Masjid untuk Solat Jumaat",
        "perawi_melayu": "Diriwayatkan dari Abu Huraira رضی اللہ تعالیٰ عنہ:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There is an angel on every door of the mosque recording him first who (comes) first (to the mosque for Friday prayer). And he [the Prophet] likened him to one who offers a camel as a sacrifice and then he went on in the descending order till he reached the point at which the minimum (sacrifice) is that of an egg. And when the Imam sits (on the pulpit) the sheets are folded and they (the angels) attend to the mention of Allah.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Sesungguhnya terdapat malaikat di setiap pintu masjid yang mencatat orang yang pertama kali masuk (ke masjid untuk solat Jumaat). Dan baginda [Nabi] membandingkan orang tersebut dengan orang yang mengorbankan seekor unta, kemudian diikuti dengan urutan menurun sehingga sampai pada titik di mana (korban) paling rendah adalah sebutir telur. Dan apabila imam duduk (di atas mimbar), lembaran-lembaran (catatan) dilipat dan mereka (para malaikat) memberi perhatian kepada zikir kepada Allah.",
        "arabic_text": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَلَى كُلِّ بَابٍ مِنْ أَبْوَابِ الْمَسْجِدِ مَلَكٌ يَكْتُبُ الْأَوَّلَ فَالْأَوَّلَ مَثَّلَ الْجَزُورَ ثُمَّ نَزَّلَهُمْ حَتَّى صَغَّرَ إِلَى مَثَلِ الْبَيْضَةِ فَإِذَا جَلَسَ الْإِمَامُ طُوِيَتْ الصُّحُفُ وَحَضَرُوا الذِّكْرَ."
      },
      {
        "id": 9551,
        "hadith_number": "1987",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Mandi dan Menghadiri Solat Jumaat",
        "perawi_melayu": "Abu Hurairah Radiyallahu Anhu meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who took a bath and then came for Jumu'a prayer and then prayed what was fixed for him, then kept silence till the Imam finished the sermon, and then prayed along with him, his sins between that time and the next Friday would be forgiven, and even of three days more.",
        "malay_translation": "Rasulullah ﷺ bersabda: Sesiapa yang mandi, kemudian datang untuk solat Jumaat, dan mengerjakan solat sunat yang ditetapkan baginya, kemudian berdiam diri sehingga imam selesai berkhutbah, dan kemudian solat Jumaat bersamanya, dosa-dosanya antara Jumaat itu dan Jumaat berikutnya akan diampuni, bahkan ditambah tiga hari lagi.",
        "arabic_text": "حَدَّثَنَا أُمَيَّةُ بْنُ بِسْطَامٍ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ حَدَّثَنَا رَوْحٌ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اغْتَسَلَ ثُمَّ أَتَى الْجُمُعَةَ فَصَلَّى مَا قُدِّرَ لَهُ ثُمَّ أَنْصَتَ حَتَّى يَفْرُغَ مِنْ خُطْبَتِهِ ثُمَّ يُصَلِّي مَعَهُ غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الْجُمُعَةِ الْأُخْرَى وَفَضْلُ ثَلَاثَةِ أَيَّامٍ."
      },
      {
        "id": 9552,
        "hadith_number": "1988",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Solat Jumaat dan Adab Mendengarnya",
        "perawi_melayu": "Abu Hurairah رضی اللہ تعالیٰ عنہ",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who performed ablution well, then came to Friday prayer, listened (to the sermon), kept silence all (his sins) between that time and the next Friday would be forgiven with three days extra, and he who touched pebbles caused an interruption.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Sesiapa yang berwuduk dengan baik, kemudian datang ke solat Jumaat, mendengar (khutbah), dan berdiam diri, maka dosanya antara Jumaat itu dan Jumaat berikutnya akan diampuni, ditambah lagi tiga hari. Dan sesiapa yang menyentuh batu kerikil, maka dia telah melakukan perbuatan sia-sia.",
        "arabic_text": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الْآخَرَانِ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ أَتَى الْجُمُعَةَ فَاسْتَمَعَ وَأَنْصَتَ غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الْجُمُعَةِ وَزِيَادَةُ ثَلَاثَةِ أَيَّامٍ وَمَنْ مَسَّ الْحَصَى فَقَدْ لَغَا."
      },
      {
        "id": 9553,
        "hadith_number": "1989",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Waktu Solat Jumaat dan Rehatkan Unta Air",
        "perawi_melayu": "Diriwayatkan oleh Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ:",
        "english_text": "We used to observe (Jumu'a) prayer with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and then we returned and gave rest to our camels used for carrying water. Hassan[ (one of the narrators) said: I asked Ja'far what time that was. He said.. It is the time when the sun passes the meridian.",
        "malay_translation": "Kami dahulunya menunaikan solat Jumaat bersama Rasulullah (ﷺ) kemudian kami pulang dan merehatkan unta-unta kami yang digunakan untuk membawa air. Hassan (salah seorang perawi) berkata: Saya bertanya kepada Ja'far pukul berapa waktu itu. Beliau berkata.. Ia adalah waktu ketika matahari tergelincir dari tengah hari.",
        "arabic_text": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَبُو بَكْرٍ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا حَسَنُ بْنُ عَيَّاشٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ كُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ نَرْجِعُ فَنُرِيحُ نَوَاضِحَنَا قَالَ حَسَنٌ فَقُلْتُ لِجَعْفَرٍ فِي أَيِّ سَاعَةٍ تِلْكَ قَالَ زَوَالَ الشَّمْسِ."
      },
      {
        "id": 9554,
        "hadith_number": "1990",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Solat Jumaat dan Istirahat Unta Selepasnya",
        "perawi_melayu": "Ja'far meriwayatkan daripada ayahnya: bahawa dia bertanya kepada Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ :",
        "english_text": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed Jumu'a prayer. He said: He used to observe prayer, and we then went (back) to our camels and gave them rest. 'Abdullah made this addition in his narration: Till the sun passed the meridian. and the camels used for carrying water (took rest).",
        "malay_translation": "Apabila Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم‌) menunaikan solat Jumaat. Baginda bersabda: Baginda biasa menunaikan solat, dan kemudian kami pergi (kembali) kepada unta-unta kami dan memberi mereka rehat. 'Abdullah membuat tambahan ini dalam riwayatnya: Sehingga matahari melewati meridian. dan unta-unta yang digunakan untuk membawa air (berehat).",
        "arabic_text": "و حَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّاءَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ ح و حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ قَالَا جَمِيعًا حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ عَنْ جَعْفَرٍ عَنْ أَبِيهِ أَنَّهُ سَأَلَ جَابِرَ بْنَ عَبْدِ اللَّهِ مَتَى كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الْجُمُعَةَ قَالَ كَانَ يُصَلِّي ثُمَّ نَذْهَبُ إِلَى جِمَالِنَا فَنُرِيحُهَا زَادَ عَبْدُ اللَّهِ فِي حَدِيثِهِ حِينَ تَزُولُ الشَّمْسُ يَعْنِي النَّوَاضِحَ."
      },
      {
        "id": 9555,
        "hadith_number": "1991",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Menangguhkan Tidur Siang dan Makan Tengah Hari Sehingga Selepas Solat Jumaat Pada Zaman Nabi",
        "perawi_melayu": "Sahl bin Said رضی اللہ تعالیٰ عنہ berkata:",
        "english_text": "We did not have a siesta or lunch till after the Friday prayer. (Ibn Hajr added: ) During the lifetime of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
        "malay_translation": "Kami tidak tidur siang atau makan tengah hari sehingga selepas solat Jumaat. (Ibn Hajr menambah: ) Semasa hayat Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
        "arabic_text": "و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ وَيَحْيَى بْنُ يَحْيَى وَعَلِيُّ بْنُ حُجْرٍ قَالَ يَحْيَى أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ عَنْ أَبِيهِ عَنْ سَهْلٍ قَالَ مَا كُنَّا نَقِيلُ وَلَا نَتَغَدَّى إِلَّا بَعْدَ الْجُمُعَةِ زَادَ ابْنُ حُجْرٍ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 9556,
        "hadith_number": "1992",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Menunaikan Solat Jumaat dan Mencari Teduhan daripada Panas",
        "perawi_melayu": "Diriwayatkan oleh Iyas bin Salama bin al-Akwa' daripada ayahnya:",
        "english_text": "We used to observe the Friday prayer with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) when the sun passed the meridian. and we then returned and tried to find out afternoon shadow (of the walls for protecting themselves from the heat of the sun).",
        "malay_translation": "Kami biasa menunaikan solat Jumaat bersama Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) ketika matahari tergelincir dari tengah hari. Kemudian kami pulang dan cuba mencari bayang-bayang petang (dinding) untuk melindungi diri daripada panas matahari.",
        "arabic_text": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَا أَخْبَرَنَا وَكِيعٌ عَنْ يَعْلَى بْنِ الْحَارِثِ الْمُحَارِبِيِّ عَنْ إِيَاسِ بْنِ سَلَمَةَ بْنِ الْأَكْوَعِ عَنْ أَبِيهِ قَالَ كُنَّا نُجَمِّعُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا زَالَتْ الشَّمْسُ ثُمَّ نَرْجِعُ نَتَتَبَّعُ الْفَيْءَ"
      },
      {
        "id": 9557,
        "hadith_number": "1993",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Solat Jumaat pada Awal Waktu dan Keadaan Panas Terik Selepasnya",
        "perawi_melayu": "Iyas bin Salama bin Akwa' meriwayatkan daripada ayahnya, katanya:",
        "english_text": "We used to observe the Friday prayer with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and when we returned we did not find the shadow of the walls in which we could take protection (from the heat of the sun).",
        "malay_translation": "Kami dahulunya menunaikan solat Jumaat bersama Rasulullah (ﷺ), dan apabila kami pulang, kami tidak mendapati bayang-bayang dinding tempat kami boleh berlindung (dari panas matahari).",
        "arabic_text": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ حَدَّثَنَا يَعْلَى بْنُ الْحَارِثِ عَنْ إِيَاسِ بْنِ سَلَمَةَ بْنِ الْأَكْوَعِ عَنْ أَبِيهِ قَالَ كُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجُمُعَةَ فَنَرْجِعُ وَمَا نَجِدُ لِلْحِيطَانِ فَيْئًا نَسْتَظِلُّ بِهِ."
      },
      {
        "id": 9558,
        "hadith_number": "1994",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Cara Rasulullah SAW Menyampaikan Khutbah Jumaat",
        "perawi_melayu": "Ibn 'Umar رضی اللہ تعالیٰ عنہ berkata:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to deliver the sermon on Friday while standing. He would then sit and then stand (for the second sermon) as they (the Muslims) do nowadays.",
        "malay_translation": "Rasulullah ﷺ biasa menyampaikan khutbah pada hari Jumaat sambil berdiri. Kemudian Baginda akan duduk, dan kemudian berdiri (untuk khutbah kedua) seperti yang dilakukan oleh umat Islam pada masa kini.",
        "arabic_text": "و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ وَأَبُو كَامِلٍ الْجَحْدَرِيُّ جَمِيعًا عَنْ خَالِدٍ قَالَ أَبُو كَامِلٍ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ يَوْمَ الْجُمُعَةِ قَائِمًا ثُمَّ يَجْلِسُ ثُمَّ يَقُومُ قَالَ كَمَا يَفْعَلُونَ الْيَوْمَ."
      },
      {
        "id": 9559,
        "hadith_number": "1995",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Khutbah Rasulullah SAW dengan Dua Khutbah, Bacaan Al-Quran dan Nasihat",
        "perawi_melayu": "Jabir bin Samura رضی اللہ تعالیٰ عنہ berkata:",
        "english_text": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) gave two sermons between which he sat, recited the Qur'an and exhorted the people.",
        "malay_translation": "Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) menyampaikan dua khutbah yang di antaranya baginda duduk, membaca Al-Quran dan memberi nasihat kepada orang ramai.",
        "arabic_text": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَحَسَنُ بْنُ الرَّبِيعِ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ يَحْيَى أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ كَانَتْ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُطْبَتَانِ يَجْلِسُ بَيْنَهُمَا يَقْرَأُ الْقُرْآنَ وَيُذَكِّرُ النَّاسَ"
      },
      {
        "id": 9560,
        "hadith_number": "1996",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah Berkhutbah Sambil Berdiri",
        "perawi_melayu": "Jabir bin Samura رضی اللہ تعالیٰ عنہ berkata:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to deliver the sermon while standing. He would then sit down and then stand up and address in a standing posture; and whoever informed you that he (the Holy Prophet) delivered the sermon while sitting told a lie. By Allah. I prayed with him more than two thousand times.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) biasa menyampaikan khutbah sambil berdiri. Kemudian baginda akan duduk, kemudian berdiri semula dan menyampaikan khutbah dalam keadaan berdiri; dan sesiapa yang memberitahu kamu bahawa baginda (Nabi Suci) menyampaikan khutbah sambil duduk, maka dia telah berbohong. Demi Allah. Aku telah solat bersamanya lebih dari dua ribu kali.",
        "arabic_text": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ سِمَاكٍ قَالَ أَنْبَأَنِي جَابِرُ بْنُ سَمُرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْطُبُ قَائِمًا ثُمَّ يَجْلِسُ ثُمَّ يَقُومُ فَيَخْطُبُ قَائِمًا فَمَنْ نَبَّأَكَ أَنَّهُ كَانَ يَخْطُبُ جَالِسًا فَقَدْ كَذَبَ فَقَدْ وَاللَّهِ صَلَّيْتُ مَعَهُ أَكْثَرَ مِنْ أَلْفَيْ صَلَاةٍ."
      },
      {
        "id": 9561,
        "hadith_number": "1997",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kafilah Tiba Semasa Khutbah Jumaat dan Penurunan Ayat Jumaat",
        "perawi_melayu": "Diriwayatkan oleh Jabir bin Abdullah رضی اللہ عنہ:",
        "english_text": "The Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was delivering the sermon on Friday in a standing posture when a caravan from Syria arrived. The people flocked towards it till no one was left (with the Holy Prophet) but twelve persons, and it was on this occasion that this verse in regard to Jumu'a was revealed. And when they see merchandise or sport. they break away to it and leave thee standing.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم‌) sedang menyampaikan khutbah pada hari Jumaat dalam keadaan berdiri ketika sebuah kafilah dari Syam tiba. Orang ramai berpusu-pusu ke arahnya sehingga tidak ada seorang pun yang tinggal (bersama Rasulullah) kecuali dua belas orang, dan pada peristiwa inilah ayat mengenai Jumaat diturunkan. Dan apabila mereka melihat perniagaan atau hiburan, mereka bergegas kepadanya dan meninggalkan engkau berdiri.",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ كِلَاهُمَا عَنْ جَرِيرٍ قَالَ عُثْمَانُ حَدَّثَنَا جَرِيرٌ عَنْ حُصَيْنِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْطُبُ قَائِمًا يَوْمَ الْجُمُعَةِ فَجَاءَتْ عِيرٌ مِنْ الشَّامِ فَانْفَتَلَ النَّاسُ إِلَيْهَا حَتَّى لَمْ يَبْقَ إِلَّا اثْنَا عَشَرَ رَجُلًا فَأُنْزِلَتْ هَذِهِ الْآيَةُ الَّتِي فِي الْجُمُعَةِ وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا (الجمعة:11)"
      },
      {
        "id": 9562,
        "hadith_number": "1998",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Variasi Riwayat Hadis",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "This hadith has been narrated by Husain with the same chain of transmitters but with this alteration that he did not make mention of the standing position.",
        "malay_translation": "Hadis ini telah diriwayatkan oleh Husain dengan sanad yang sama tetapi dengan perubahan ini bahawa beliau tidak menyebut tentang kedudukan berdiri.",
        "arabic_text": "و حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ حُصَيْنٍ بِهَذَا الْإِسْنَادِ قَالَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ وَلَمْ يَقُلْ قَائِمًا."
      },
      {
        "id": 9563,
        "hadith_number": "1999",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Kekal dalam Khutbah Jumaat Walaupun Kedatangan Kafilah Dagang",
        "perawi_melayu": "Jabir bin Abdullah رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "I was along with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) on Friday when a caravan arrived. The people went to it, and none but twelve persons were left behind and I was one of them; and it was on this occasion that this verse was revealed: And when they see merchandise or sport away to it, and leave thee standing (lxii. 1 1). they break",
        "malay_translation": "Saya bersama Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) pada hari Jumaat ketika sebuah kafilah tiba. Orang ramai pergi kepadanya, dan tidak ada yang tinggal kecuali dua belas orang dan saya adalah salah seorang daripada mereka; dan pada kesempatan inilah ayat ini diturunkan: Dan apabila mereka melihat perniagaan atau hiburan, mereka bergegas kepadanya dan meninggalkan engkau berdiri (lxii. 11). mereka berpecah.",
        "arabic_text": "و حَدَّثَنَا رِفَاعَةُ بْنُ الْهَيْثَمِ الْوَاسِطِيُّ حَدَّثَنَا خَالِدٌ يَعْنِي الطَّحَّانَ عَنْ حُصَيْنٍ عَنْ سَالِمٍ وَأَبِي سُفْيَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ كُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْجُمُعَةِ فَقَدِمَتْ سُوَيْقَةٌ قَالَ فَخَرَجَ النَّاسُ إِلَيْهَا فَلَمْ يَبْقَ إِلَّا اثْنَا عَشَرَ رَجُلًا أَنَا فِيهِمْ قَالَ فَأَنْزَلَ اللَّهُ وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا إِلَى آخِرِ الْآيَةِ."
      },
      {
        "id": 9564,
        "hadith_number": "2000",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kedatangan Kafilah Dagang Ketika Khutbah Jumaat",
        "perawi_melayu": "Jabir bin Abdullah رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "While the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was delivering (a sermon) on Friday, a caravan of merchandise came to Medina. The Companions of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) rushed towards it till only twelve persons were left with him including Abu Bakr and 'Umar; and it was at this occasion that this verse was revealed. And when they see merchandise or sport, they break away to it.",
        "malay_translation": "Ketika Rasulullah SAW sedang berkhutbah pada hari Jumaat, sebuah kafilah dagangan tiba di Madinah. Para Sahabat Rasulullah SAW bergegas ke arahnya sehingga hanya tinggal dua belas orang sahaja yang tinggal bersamanya termasuk Abu Bakr dan Umar RA; dan pada ketika inilah ayat ini diturunkan. Dan apabila mereka melihat perniagaan atau hiburan, mereka berpecah untuk pergi kepadanya.",
        "arabic_text": "و حَدَّثَنَا إِسْمَعِيلُ بْنُ سَالِمٍ أَخْبَرَنَا هُشَيْمٌ أَخْبَرَنَا حُصَيْنٌ عَنْ أَبِي سُفْيَانَ وَسَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ بَيْنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَائِمٌ يَوْمَ الْجُمُعَةِ إِذْ قَدِمَتْ عِيرٌ إِلَى الْمَدِينَةِ فَابْتَدَرَهَا أَصْحَابُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى لَمْ يَبْقَ مَعَهُ إِلَّا اثْنَا عَشَرَ رَجُلًا فِيهِمْ أَبُو بَكْرٍ وَعُمَرُ قَالَ وَنَزَلَتْ هَذِهِ الْآيَةُ وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا."
      },
      {
        "id": 9565,
        "hadith_number": "2001",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Khutbah sambil Duduk",
        "perawi_melayu": "Diriwayatkan dari Ka'b bin 'Ujra رضی اللہ تعالیٰ عنہ:",
        "english_text": "He entered the mosque and saw Abd al-Rahman b. Umm Hakam delivering the sermon in a sitting posture. Upon this he said: Look at this wretched person; he delivers the sermon while sitting, whereas Allah said: And when they see merchandise or sport, they break away to it and leave thee standing.",
        "malay_translation": "Baginda masuk ke dalam masjid dan melihat Abd al-Rahman b. Umm Hakam menyampaikan khutbah dalam keadaan duduk.  Lalu baginda bersabda: Lihatlah orang yang malang ini; dia menyampaikan khutbah sambil duduk, sedangkan Allah berfirman: Dan apabila mereka melihat perniagaan atau hiburan, mereka bergegas kepadanya dan meninggalkan engkau berdiri.",
        "arabic_text": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ أَبِي عُبَيْدَةَ عَنْ كَعْبِ بْنِ عُجْرَةَ قَالَ دَخَلَ الْمَسْجِدَ وَعَبْدُ الرَّحْمَنِ ابْنُ أُمِّ الْحَكَمِ يَخْطُبُ قَاعِدًا فَقَالَ انْظُرُوا إِلَى هَذَا الْخَبِيثِ يَخْطُبُ قَاعِدًا وَقَالَ اللَّهُ تَعَالَى وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا."
      },
      {
        "id": 9566,
        "hadith_number": "2002",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ancaman Meninggalkan Solat Jumaat",
        "perawi_melayu": "Abdullah bin Umar dan Abu Hurairah رضی اللہ تعالیٰ عنہ berkata:",
        "english_text": "They heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say on the planks of his pulpit: People must cease to neglect the Friday prayer or Allah will seal their hearts and then they will be among the negligent.",
        "malay_translation": "Mereka mendengar Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم) bersabda di atas mimbar baginda: Hendaklah orang ramai berhenti daripada mengabaikan solat Jumaat, jika tidak Allah akan memeteraikan hati mereka, dan kemudian mereka akan tergolong dalam golongan yang lalai.",
        "arabic_text": "و حَدَّثَنِي الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ حَدَّثَنَا أَبُو تَوْبَةَ حَدَّثَنَا مُعَاوِيَةُ وَهُوَ ابْنُ سَلَّامٍ عَنْ زَيْدٍ يَعْنِي أَخَاهُ أَنَّهُ سَمِعَ أَبَا سَلَّامٍ قَالَ حَدَّثَنِي الْحَكَمُ بْنُ مِينَاءَ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ وَأَبَا هُرَيْرَةَ حَدَّثَاهُ أَنَّهُمَا سَمِعَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ عَلَى أَعْوَادِ مِنْبَرِهِ لَيَنْتَهِيَنَّ أَقْوَامٌ عَنْ وَدْعِهِمْ الْجُمُعَاتِ أَوْ لَيَخْتِمَنَّ اللَّهُ عَلَى قُلُوبِهِمْ ثُمَّ لَيَكُونُنَّ مِنْ الْغَافِلِينَ."
      },
      {
        "id": 9567,
        "hadith_number": "2003",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kesederhanaan Solat dan Khutbah Nabi",
        "perawi_melayu": "Jabir bin Samura رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "I used to pray with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and both his prayer and sermon were of moderate length.",
        "malay_translation": "Saya pernah solat bersama Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) dan kedua-dua solat serta khutbah baginda adalah sederhana panjang.",
        "arabic_text": "حَدَّثَنَا حَسَنُ بْنُ الرَّبِيعِ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَا حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ كُنْتُ أُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَتْ صَلَاتُهُ قَصْدًا وَخُطْبَتُهُ قَصْدًا."
      },
      {
        "id": 9568,
        "hadith_number": "2004",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kesederhanaan Solat dan Khutbah Rasulullah ﷺ",
        "perawi_melayu": "Jabir bin Samura رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "I used to observe prayer with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and his prayer was of moderate length and his sermon too was of moderate length.",
        "malay_translation": "Saya pernah solat bersama Rasulullah ﷺ dan solatnya adalah sederhana panjangnya, begitu juga khutbahnya sederhana panjangnya.",
        "arabic_text": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ نُمَيْرٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا زَكَرِيَّاءُ حَدَّثَنِي سِمَاكُ بْنُ حَرْبٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ كُنْتُ أُصَلِّي مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّلَوَاتِ فَكَانَتْ صَلَاتُهُ قَصْدًا وَخُطْبَتُهُ قَصْدًا وَفِي رِوَايَةِ أَبِي بَكْرٍ زَكَرِيَّاءُ عَنْ سِمَاكٍ."
      },
      {
        "id": 9569,
        "hadith_number": "2005",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Khutbah Rasulullah SAW dan Peringatan Penting",
        "perawi_melayu": "Jabir bin Abdullah رضی اللہ تعالیٰ عنہ berkata:",
        "english_text": "When Allah's Messenger (may peace he upon him) delivered the sermon, his eyes became red, his voice rose, and his anger increased so that he was like one giving a warning against the enemy and saying: The enemy has made a morning attack on you and in the evening too. He would also say: The Last Hour and I have been sent like these two. And he would join his forefinger and middle finger; and would further say: The best of the speech is embodied in the Book of Allah, and the best of the guidance is the guidance given by Muhammad. And the most evil affairs are their innovations; and every innovation is error. He would further say:, I am more dear to a Muslim even than his self; and he who left behind property that is for his family; and he who dies under debt or leaves children (in helplessness), the responsibility (of paying his debt and bringing up his children) lies on me.",
        "malay_translation": "Apabila Rasulullah SAW menyampaikan khutbah, mata baginda menjadi merah, suara baginda meninggi, dan kemarahan baginda bertambah sehingga baginda seperti seorang yang memberi amaran terhadap musuh dan bersabda: Musuh telah menyerang kamu pada waktu pagi dan juga pada waktu petang. Baginda juga bersabda: Kiamat dan aku telah diutuskan seperti dua ini. Dan baginda menggabungkan jari telunjuk dan jari tengahnya; dan baginda selanjutnya bersabda: Sebaik-baik perkataan adalah yang terkandung dalam Kitab Allah, dan sebaik-baik petunjuk adalah petunjuk yang diberikan oleh Muhammad. Dan seburuk-buruk perkara adalah perkara-perkara yang diada-adakan; dan setiap perkara yang diada-adakan adalah kesesatan. Baginda selanjutnya bersabda: Aku lebih dikasihi oleh seorang Muslim daripada dirinya sendiri; dan sesiapa yang meninggalkan harta maka itu adalah untuk keluarganya; dan sesiapa yang mati dalam keadaan berhutang atau meninggalkan anak-anak (dalam keadaan lemah), tanggungjawab (untuk membayar hutangnya dan membesarkan anak-anaknya) terletak padaku.",
        "arabic_text": "و حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْمَجِيدِ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا خَطَبَ احْمَرَّتْ عَيْنَاهُ وَعَلَا صَوْتُهُ وَاشْتَدَّ غَضَبُهُ حَتَّى كَأَنَّهُ مُنْذِرُ جَيْشٍ يَقُولُ صَبَّحَكُمْ وَمَسَّاكُمْ وَيَقُولُ بُعِثْتُ أَنَا وَالسَّاعَةُ كَهَاتَيْنِ وَيَقْرُنُ بَيْنَ إِصْبَعَيْهِ السَّبَّابَةِ وَالْوُسْطَى وَيَقُولُ أَمَّا بَعْدُ فَإِنَّ خَيْرَ الْحَدِيثِ كِتَابُ اللَّهِ وَخَيْرُ الْهُدَى هُدَى مُحَمَّدٍ وَشَرُّ الْأُمُورِ مُحْدَثَاتُهَا وَكُلُّ بِدْعَةٍ ضَلَالَةٌ ثُمَّ يَقُولُ أَنَا أَوْلَى بِكُلِّ مُؤْمِنٍ مِنْ نَفْسِهِ مَنْ تَرَكَ مَالًا فَلِأَهْلِهِ وَمَنْ تَرَكَ دَيْنًا أَوْ ضَيَاعًا فَإِلَيَّ وَعَلَيَّ."
      },
      {
        "id": 9570,
        "hadith_number": "2006",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pujian Allah dalam Khutbah Rasulullah SAW",
        "perawi_melayu": "Ja'far bin Muhammad meriwayatkan daripada ayahnya:",
        "english_text": "I heard Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ saying that in the sermon of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) he praised Allah, lauded Him (and subsequently said [other words] and raised his voice, and the rest of the hadith is the same).",
        "malay_translation": "Saya mendengar Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ berkata bahawa dalam khutbah Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم‌) baginda memuji Allah, mengagungkan-Nya (dan kemudiannya mengucapkan [kata-kata lain] dan meninggikan suaranya, dan selebihnya hadis adalah sama).",
        "arabic_text": "و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلَالٍ حَدَّثَنِي جَعْفَرُ بْنُ مُحَمَّدٍ عَنْ أَبِيهِ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ كَانَتْ خُطْبَةُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْجُمُعَةِ يَحْمَدُ اللَّهَ وَيُثْنِي عَلَيْهِ ثُمَّ يَقُولُ عَلَى إِثْرِ ذَلِكَ وَقَدْ عَلَا صَوْتُهُ ثُمَّ سَاقَ الْحَدِيثَ بِمِثْلِهِ ِ."
      },
      {
        "id": 9571,
        "hadith_number": "2007",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Khutbah Rasulullah, Pujian kepada Allah, dan Keutamaan Kitab Allah",
        "perawi_melayu": "Jabir رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), while delivering the sermon' to the people, praised Allah, and lauded Him for what He deserves, and would then say: He whom Allah guides aright, there is none to mislead him, and he who is led astray, there is none to guide him (aright), and the best of the talk is embodied in the Book of Allah. And the rest of the hadith is the same.",
        "malay_translation": "Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم‌), ketika menyampaikan khutbah kepada orang ramai, memuji Allah, dan menyanjung-Nya atas apa yang Dia layak terima, dan kemudian bersabda: Sesiapa yang Allah beri petunjuk, maka tidak ada siapa pun yang dapat menyesatkannya, dan sesiapa yang disesatkan, maka tidak ada siapa pun yang dapat memberinya petunjuk (yang benar), dan sebaik-baik perkataan adalah yang terkandung dalam Kitab Allah. Dan seterusnya hadis itu adalah sama.",
        "arabic_text": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ جَعْفَرٍ عَنْ أَبِيهِ عَنْ جَابِرٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ النَّاسَ يَحْمَدُ اللَّهَ وَيُثْنِي عَلَيْهِ بِمَا هُوَ أَهْلُهُ ثُمَّ يَقُولُ مَنْ يَهْدِهِ اللَّهُ فَلَا مُضِلَّ لَهُ وَمَنْ يُضْلِلْ فَلَا هَادِيَ لَهُ وَخَيْرُ الْحَدِيثِ كِتَابُ اللَّهِ ثُمَّ سَاقَ الْحَدِيثَ بِمِثْلِ حَدِيثِ الثَّقَفِيّ."
      },
      {
        "id": 9572,
        "hadith_number": "2008",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keislaman Dimad Setelah Mendengar Khutbah Nabi",
        "perawi_melayu": "Diriwayatkan daripada Ibn 'Abbas رضی اللہ تعالیٰ عنہ :",
        "english_text": "Dimad came to Mecca and he belonged to the tribe of Azd Shanu'a, and he used to protect the person who was under the influence of charm. He heard the foolish people of Mecca say that Muhammad ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was under the spell. Upon this he said: If 1 were to come across this man, Allah might cure him at my hand. He met him and said: Muhammad, I can protect (one) who is under the influence of charm, and Allah cures one whom He so desires at my hand. Do you desire (this)? Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Praise is due to Allah, we praise Him, ask His help; and he whom Allah guides aright there is none to lead him astray, and he who is led astray there is none to guide him, and I bear testimony to the fact that there is no god but Allah, He is One, having no partner with Him, and that Muhammad is His Servant and Messenger. Now after this he (Dimad) said: Repeat these words of yours before me, and the messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) repeated these to him thrice; and he said I have heard the words of soothsayers and the words of magicians, and the words of poets, but I have never heard such words as yours, and they reach the depth (of the ocean of eloquence) ; bring forth your hand so that I should take oath of fealty to you on Islam. So he took an oath of allegiance to him. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: It (this allegiance of yours) is on behalf of your people too. He said: It is on behalf of my people too. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) sent an expedition and the flying column passed by his people. The leader of the flying column said to the detachment: Did you find anything from these people? One of the people said: I found a utensil for water. Upon this he (the commander) said: Return it, for he is one of the people of Dimad رضی اللہ تعالیٰ عنہ .",
        "malay_translation": "Dimad datang ke Mekah dan dia berasal dari suku Azd Shanu'a, dan dia biasa melindungi orang yang berada di bawah pengaruh sihir. Dia mendengar orang-orang bodoh Mekah mengatakan bahawa Muhammad (صلی اللہ علیہ وسلم) berada di bawah sihir. Mendengar ini, dia berkata: Jika aku bertemu dengan lelaki ini, Allah mungkin menyembuhkannya melalui tanganku. Dia bertemu dengan baginda dan berkata: Muhammad, aku boleh melindungi (seseorang) yang berada di bawah pengaruh sihir, dan Allah menyembuhkan sesiapa yang Dia kehendaki melalui tanganku. Adakah kamu mahu (ini)? Maka Rasulullah (صلی اللہ علیہ وسلم) bersabda: Segala puji bagi Allah, kami memuji-Nya, memohon pertolongan-Nya; dan sesiapa yang Allah beri petunjuk, maka tiada siapa yang dapat menyesatkannya, dan sesiapa yang disesatkan, maka tiada siapa yang dapat memberinya petunjuk, dan aku bersaksi bahawa tiada tuhan selain Allah, Dia Maha Esa, tiada sekutu bagi-Nya, dan Muhammad adalah hamba dan Rasul-Nya. Kemudian setelah itu dia (Dimad) berkata: Ulangi kata-kata kamu ini di hadapanku, dan Rasulullah (صلی اللہ علیہ وسلم) mengulanginya sebanyak tiga kali kepadanya; dan dia berkata: Aku telah mendengar kata-kata peramal dan kata-kata ahli sihir, dan kata-kata penyair, tetapi aku tidak pernah mendengar kata-kata seperti kata-katamu, dan kata-kata itu mencapai kedalaman (lautan kefasihan); hulurkan tanganmu agar aku dapat berbai'at kepadamu atas Islam. Maka dia berbai'at kepadanya. Rasulullah (صلی اللہ علیہ وسلم) bersabda: (Bai'at kamu ini) juga bagi pihak kaummu. Dia berkata: Ia juga bagi pihak kaumku. Rasulullah (صلی اللہ علیہ وسلم) menghantar ekspedisi dan pasukan berkuda melalui kaumnya. Ketua pasukan berkuda itu berkata kepada detasemen: Adakah kamu menemui apa-apa dari kaum ini? Salah seorang daripada mereka berkata: Aku menemui sebuah bekas air. Mendengar ini, dia (komander) berkata: Kembalikan ia, kerana dia adalah salah seorang daripada kaum Dimad رضی اللہ تعالیٰ عنہ .",
        "arabic_text": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ الْمُثَنَّى كِلَاهُمَا عَنْ عَبْدِ الْأَعْلَى قَالَ ابْنُ الْمُثَنَّى حَدَّثَنِي عَبْدُ الْأَعْلَى وَهُوَ أَبُو هَمَّامٍ حَدَّثَنَا دَاوُدُ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ ضِمَادًا قَدِمَ مَكَّةَ وَكَانَ مِنْ أَزْدِ شَنُوءَةَ وَكَانَ يَرْقِي مِنْ هَذِهِ الرِّيحِ فَسَمِعَ سُفَهَاءَ مِنْ أَهْلِ مَكَّةَ يَقُولُونَ إِنَّ مُحَمَّدًا مَجْنُونٌ فَقَالَ لَوْ أَنِّي رَأَيْتُ هَذَا الرَّجُلَ لَعَلَّ اللَّهَ يَشْفِيهِ عَلَى يَدَيَّ قَالَ فَلَقِيَهُ فَقَالَ يَا مُحَمَّدُ إِنِّي أَرْقِي مِنْ هَذِهِ الرِّيحِ وَإِنَّ اللَّهَ يَشْفِي عَلَى يَدِي مَنْ شَاءَ فَهَلْ لَكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الْحَمْدَ لِلَّهِ نَحْمَدُهُ وَنَسْتَعِينُهُ مَنْ يَهْدِهِ اللَّهُ فَلَا مُضِلَّ لَهُ وَمَنْ يُضْلِلْ فَلَا هَادِيَ لَهُ وَأَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ أَمَّا بَعْدُ قَالَ فَقَالَ أَعِدْ عَلَيَّ كَلِمَاتِكَ هَؤُلَاءِ فَأَعَادَهُنَّ عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَ مَرَّاتٍ قَالَ فَقَالَ لَقَدْ سَمِعْتُ قَوْلَ الْكَهَنَةِ وَقَوْلَ السَّحَرَةِ وَقَوْلَ الشُّعَرَاءِ فَمَا سَمِعْتُ مِثْلَ كَلِمَاتِكَ هَؤُلَاءِ وَلَقَدْ بَلَغْنَ نَاعُوسَ الْبَحْرِ قَالَ فَقَالَ هَاتِ يَدَكَ أُبَايِعْكَ عَلَى الْإِسْلَامِ قَالَ فَبَايَعَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَى قَوْمِكَ قَالَ وَعَلَى قَوْمِي قَالَ فَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَرِيَّةً فَمَرُّوا بِقَوْمِهِ فَقَالَ صَاحِبُ السَّرِيَّةِ لِلْجَيْشِ هَلْ أَصَبْتُمْ مِنْ هَؤُلَاءِ شَيْئًا فَقَالَ رَجُلٌ مِنْ الْقَوْمِ أَصَبْتُ مِنْهُمْ مِطْهَرَةً فَقَالَ رُدُّوهَا فَإِنَّ هَؤُلَاءِ قَوْمُ ضِمَادٍ"
      },
      {
        "id": 9573,
        "hadith_number": "2009",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Tanda Kefahaman Agama: Memanjangkan Solat dan Memendekkan Khutbah",
        "perawi_melayu": "Abu Wa'il meriwayatkan:",
        "english_text": "'Ammar رضی اللہ تعالیٰ عنہ delivered to us the sermon. It was short and eloquent. When he (, Ammir) descended (from the pulpit) we said to him: 0 Abd al-Yaqzn, you have delivered a short and eloquent sermon. Would that you had lengthened (the sermon). He said: I have heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The lengthening of prayer by a man and the shortness of the sermon is the sign of his understanding (of faith). So lengthen the prayer and shorten the sermon, for there is charm (in precise) expression.",
        "malay_translation": "'Ammar رضی اللہ تعالیٰ عنہ menyampaikan khutbah kepada kami. Ia ringkas dan fasih. Ketika beliau (, Ammir) turun (dari mimbar), kami berkata kepadanya: Wahai Abd al-Yaqzn, anda telah menyampaikan khutbah yang ringkas dan fasih. Alangkah baiknya jika anda memanjangkan (khutbah). Beliau berkata: Saya telah mendengar Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) bersabda: Memanjangkan solat oleh seseorang dan memendekkan khutbah adalah tanda kefahaman agamanya. Oleh itu, panjangkanlah solat dan pendekkanlah khutbah, kerana sesungguhnya ada daya tarikan (dalam ungkapan yang tepat).",
        "arabic_text": "حَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبْجَرَ عَنْ أَبِيهِ عَنْ وَاصِلِ بْنِ حَيَّانَ قَالَ قَالَ أَبُو وَائِلٍ خَطَبَنَا عَمَّارٌ فَأَوْجَزَ وَأَبْلَغَ فَلَمَّا نَزَلَ قُلْنَا يَا أَبَا الْيَقْظَانِ لَقَدْ أَبْلَغْتَ وَأَوْجَزْتَ فَلَوْ كُنْتَ تَنَفَّسْتَ فَقَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ طُولَ صَلَاةِ الرَّجُلِ وَقِصَرَ خُطْبَتِهِ مَئِنَّةٌ مِنْ فِقْهِهِ فَأَطِيلُوا الصَّلَاةَ وَاقْصُرُوا الْخُطْبَةَ وَإِنَّ مِنْ الْبَيَانِ سِحْرًا."
      },
      {
        "id": 9574,
        "hadith_number": "2010",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Teguran Rasulullah SAW Terhadap Penceramah yang Menggunakan Ungkapan Kurang Tepat",
        "perawi_melayu": "Adi bin Hatim رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "A person recited a sermon before the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) thus: He who obeys Allah and His Apostle, he in fact follows the right path, and he who disobeys both of them, he goes astray. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: What a bad speaker you are; say: He who disobeys Allah and His Apostle. Ibn Numair added: He in fact went astray.",
        "malay_translation": "Seorang lelaki menyampaikan khutbah di hadapan Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) dengan berkata: Sesiapa yang mentaati Allah dan Rasul-Nya, maka sesungguhnya dia telah mengikuti jalan yang benar, dan sesiapa yang menderhaka kepada kedua-duanya, maka dia telah sesat.  Maka Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Seburuk-buruk penceramah kamu; sebutkan: Sesiapa yang menderhaka kepada Allah dan Rasul-Nya. Ibn Numair menambahkan: Sesungguhnya dia telah sesat.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنْ تَمِيمِ بْنِ طَرَفَةَ عَنْ عَدِيِّ بْنِ حَاتِمٍ أَنَّ رَجُلًا خَطَبَ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَنْ يُطِعْ اللَّهَ وَرَسُولَهُ فَقَدْ رَشَدَ وَمَنْ يَعْصِهِمَا فَقَدْ غَوَى فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِئْسَ الْخَطِيبُ أَنْتَ قُلْ وَمَنْ يَعْصِ اللَّهَ وَرَسُولَهُ قَالَ ابْنُ نُمَيْرٍ فَقَدْ غَوِيَ."
      },
      {
        "id": 9575,
        "hadith_number": "2011",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah Membaca Al-Quran di Mimbar dan Seruan 'Wahai Malik'",
        "perawi_melayu": "Safwan bin Ya'la رضی اللہ تعالیٰ عنہ meriwayatkan daripada ayahnya bahawa",
        "english_text": "He heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) reciting (verses of the Qur'an) on the pulpit. and They cried: O Malik.",
        "malay_translation": "Beliau mendengar Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم) membaca (ayat-ayat Al-Quran) di atas mimbar. Dan mereka berseru: Wahai Malik.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ الْحَنْظَلِيُّ جَمِيعًا عَنْ ابْنِ عُيَيْنَةَ قَالَ قُتَيْبَةُ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو سَمِعَ عَطَاءً يُخْبِرُ عَنْ صَفْوَانَ بْنِ يَعْلَى عَنْ أَبِيهِ أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ عَلَى الْمِنْبَرِ وَنَادَوْا يَا مَالِكُ."
      },
      {
        "id": 9576,
        "hadith_number": "2012",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Menghafal Surah Qaf dan Bacaannya oleh Nabi pada Hari Jumaat",
        "perawi_melayu": "Amra binti Abdul-Rahman meriwayatkan daripada saudara perempuan Amra:",
        "english_text": "I memorised (surah) Qaf, by the glorious Qur'an from the mouth of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) on Friday for he recited it on the pulpit on every Friday.",
        "malay_translation": "Saya menghafal surah Qaf, daripada al-Quran yang mulia dari mulut Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) pada hari Jumaat kerana baginda membacanya di atas mimbar pada setiap hari Jumaat.",
        "arabic_text": "و حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ عَنْ أُخْتٍ لِعَمْرَةَ قَالَتْ أَخَذْتُ ق وَالْقُرْآنِ الْمَجِيدِ مِنْ فِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْجُمُعَةِ وَهُوَ يَقْرَأُ بِهَا عَلَى الْمِنْبَرِ فِي كُلِّ جُمُعَةٍ."
      },
      {
        "id": 9577,
        "hadith_number": "2013",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Surah Qaf dari Khutbah Jumaat Nabi SAW dan Rumah Berdekatan",
        "perawi_melayu": "Tiada perawi yang dinyatakan",
        "english_text": "The daughter of Haritha bin Nu'man said: I did not memorise (Surah) Qaf but from the mouth of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as he used to deliver the. sermon along with it on every Friday. She also added: Our oven and that of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was one.",
        "malay_translation": "Anak perempuan Haritha bin Nu'man berkata: Aku tidak menghafal (Surah) Qaf melainkan dari mulut Rasulullah (صلی الله علیه وسلم) ketika baginda menyampaikan khutbah bersama surah itu pada setiap hari Jumaat. Beliau juga menambah: Dapur kami dan dapur Rasulullah (صلی الله علیه وسلم) adalah satu.",
        "arabic_text": "و حَدَّثَنِيهِ أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ عَنْ يَحْيَى بْنِ أَيُّوبَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ عَنْ أُخْتٍ لِعَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ كَانَتْ أَكْبَرَ مِنْهَا بِمِثْلِ حَدِيثِ سُلَيْمَانَ بْنِ بِلَالٍ."
      },
      {
        "id": 9578,
        "hadith_number": "2014",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ketuhar yang Sama dengan Rasulullah dan Pembelajaran Surah Qaf daripada Baginda",
        "perawi_melayu": "Umm Bisham hint Haritha bin Nu'man berkata:",
        "english_text": "Our oven and that of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was one for two years, or for one year or for a part of a year; and I learnt Qaf. By the Glorious Qur'an from no other source than the tongue of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) who used to recite it every Friday on the pulpit when he delivered the sermon to the people.",
        "malay_translation": "Ketuhar kami dan ketuhar Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) adalah satu selama dua tahun, atau selama satu tahun atau sebahagian daripada satu tahun; dan saya belajar Surah Qaf. Demi Al-Quran yang Mulia, daripada sumber lain kecuali lidah Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) yang biasa membacanya setiap hari Jumaat di atas mimbar ketika beliau menyampaikan khutbah kepada orang ramai.",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ خُبَيْبٍ عَنْ عَبدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ مَعْنٍ عَنْ بِنْتٍ لِحَارِثَةَ بْنِ النُّعْمَانِ قَالَتْ مَا حَفِظْتُ ق إِلَّا مِنْ فِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ بِهَا كُلَّ جُمُعَةٍ قَالَتْ وَكَانَ تَنُّورُنَا وَتَنُّورُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاحِدًا."
      },
      {
        "id": 9579,
        "hadith_number": "2015",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kesamaan Dapur dan Pembelajaran Surah Qaf daripada Nabi SAW",
        "perawi_melayu": "Diriwayatkan daripada Ummu Hisham binti Harithah bin An-Nu'man رضی اللہ تعالیٰ عنہ berkata:",
        "english_text": "Our oven and the oven of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) were the same for two years, or for one year and part of a year. And I only learned Surah Qaf. By the Glorious Quran from the tongue of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), who used to recited it every Friday from the Minbar, when he addresses the people.",
        "malay_translation": "Dapur kami dan dapur Rasulullah (صلی اللہ علیہ وسلم) adalah sama selama dua tahun, atau selama setahun dan sebahagian tahun. Dan saya hanya mempelajari Surah Qaf. Dari Al-Quran yang mulia dari lidah Rasulullah (صلی اللہ علیہ وسلم), yang biasa membacanya setiap hari Jumaat dari Mimbar, ketika baginda berkhutbah kepada orang ramai.",
        "arabic_text": "و حَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِي عَنْ مُحَمَّدِ بْنِ إِسْحَقَ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ الْأَنْصَارِيُّ عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَعْدِ بْنِ زُرَارَةَ عَنْ أُمِّ هِشَامٍ بِنْتِ حَارِثَةَ بْنِ النُّعْمَانِ قَالَتْ لَقَدْ كَانَ تَنُّورُنَا وَتَنُّورُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاحِدًا سَنَتَيْنِ أَوْ سَنَةً وَبَعْضَ سَنَةٍ وَمَا أَخَذْتُ ق وَالْقُرْآنِ الْمَجِيدِ إِلَّا عَنْ لِسَانِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَؤُهَا كُلَّ يَوْمِ جُمُعَةٍ عَلَى الْمِنْبَرِ إِذَا خَطَبَ النَّاسَ."
      },
      {
        "id": 9580,
        "hadith_number": "2016",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Mengangkat Tangan Berlebihan dalam Khutbah",
        "perawi_melayu": "Umara bin Ruwaiba RA berkata:",
        "english_text": "He saw Bishr bin Marwan on the pulpit raising his hands and said: Allah, disfigure these hands! I have seen Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) gesture no more than this with his hands, and he pointed with his forefinger.",
        "malay_translation": "Beliau melihat Bishr bin Marwan di atas mimbar mengangkat tangannya dan berkata: Ya Allah, buruk rupa tangan-tangan ini! Saya telah melihat Rasulullah (ﷺ) memberi isyarat tidak lebih dari ini dengan tangannya, dan beliau menunjuk dengan jari telunjuknya.",
        "arabic_text": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ حُصَيْنٍ عَنْ عُمَارَةَ بْنِ رُؤَيْبَةَ قَالَ رَأَى بِشْرَ بْنَ مَرْوَانَ عَلَى الْمِنْبَرِ رَافِعًا يَدَيْهِ فَقَالَ قَبَّحَ اللَّهُ هَاتَيْنِ الْيَدَيْنِ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا يَزِيدُ عَلَى أَنْ يَقُولَ بِيَدِهِ هَكَذَا وَأَشَارَ بِإِصْبَعِهِ الْمُسَبِّحَةِ."
      },
      {
        "id": 9581,
        "hadith_number": "2017",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Bishr bin Marwan Mengangkat Tangan pada Hari Jumaat",
        "perawi_melayu": "Diriwayatkan bahawa Hussain bin Abdur Rahman berkata:",
        "english_text": "\"I saw Bishr bin Marwan on a Friday, raising his hand, and Umarah bin Ruaibah said...\" and he mentioned something similar (to no. 2016).",
        "malay_translation": "Saya melihat Bishr bin Marwan pada hari Jumaat, mengangkat tangannya, dan Umarah bin Ruaibah berkata... dan beliau menyebutkan sesuatu yang serupa (dengan no. 2016).",
        "arabic_text": "و حَدَّثَنَاه قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ حُصَيْنِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ رَأَيْتُ بِشْرَ بْنَ مَرْوَانَ يَوْمَ جُمُعَةٍ يَرْفَعُ يَدَيْهِ فَقَالَ عُمَارَةُ بْنُ رُؤَيْبَةَ فَذَكَرَ نَحْوَهُ."
      },
      {
        "id": 9582,
        "hadith_number": "2018",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Anjuran Solat Sunat Dua Rakaat Ketika Masuk Masjid Semasa Khutbah Jumaat",
        "perawi_melayu": "Diriwayatkan daripada Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ:",
        "english_text": "While Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was delivering the sermon on Friday a person came there, and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to him: So and so, have you prayed (two rak'ahs)? He said: No. He (the Holy Prophet) said: Then stand and pray.",
        "malay_translation": "Ketika Rasulullah ﷺ sedang menyampaikan khutbah pada hari Jumaat, seorang lelaki datang. Rasulullah ﷺ bersabda kepadanya: 'Wahai Fulan, adakah kamu sudah solat (dua rakaat)?' Lelaki itu menjawab: 'Belum.' Baginda (Nabi Muhammad ﷺ) bersabda: 'Kalau begitu, bangun dan solatlah.'",
        "arabic_text": "و حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالَا حَدَّثَنَا حَمَّادٌ وَهُوَ ابْنُ زَيْدٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ بَيْنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ يَوْمَ الْجُمُعَةِ إِذْ جَاءَ رَجُلٌ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصَلَّيْتَ يَا فُلَانُ قَالَ لَا قَالَ قُمْ فَارْكَعْ."
      },
      {
        "id": 9583,
        "hadith_number": "2019",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Riwayat Jabir Tentang Rakaat",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "This hadith is narrated by Jabir رضی اللہ تعالیٰ عنہ through another chain of transmitters but Hammad (one of the narrators) made no mention of the two rak'ahs.",
        "malay_translation": "Hadis ini diriwayatkan oleh Jabir رضی اللہ تعالیٰ عنہ melalui sanad periwayatan yang lain, tetapi Hammad (salah seorang perawi) tidak menyebut tentang dua rakaat.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَيَعْقُوبُ الدَّوْرَقِيُّ عَنْ ابْنِ عُلَيَّةَ عَنْ أَيُّوبَ عَنْ عَمْرٍو عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا قَالَ حَمَّادٌ وَلَمْ يَذْكُرْ الرَّكْعَتَيْنِ."
      },
      {
        "id": 9584,
        "hadith_number": "2020",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Solat Dua Rakaat Ketika Masuk Masjid Semasa Khutbah Jumaat",
        "perawi_melayu": "Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ berkata:",
        "english_text": "A person entered the Mosque while the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was delivering the sermon on Friday. Upon this he (the Holy Prophet) said: Have you observed prayer? He said: No. He (the Holy Prophet) said: Stand and offer the two rak'ahs. According to Qutaiba, the words are: He said: Offer two rak'ahs.",
        "malay_translation": "Seorang lelaki masuk ke dalam masjid ketika Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم) sedang menyampaikan khutbah pada hari Jumaat. Baginda (Nabi Muhammad SAW) bersabda: 'Adakah kamu sudah solat?' Lelaki itu menjawab: 'Belum.' Baginda (Nabi Muhammad SAW) bersabda: 'Berdirilah dan solatlah dua rakaat.' Menurut Qutaiba, lafaznya adalah: Baginda bersabda: 'Solatlah dua rakaat.'",
        "arabic_text": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ قُتَيْبَةُ حَدَّثَنَا وَقَالَ إِسْحَقُ أَخْبَرَنَا سُفْيَانُ عَنْ عَمْرٍو سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ دَخَلَ رَجُلٌ الْمَسْجِدَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ يَوْمَ الْجُمُعَةِ فَقَالَ أَصَلَّيْتَ قَالَ لَا قَالَ قُمْ فَصَلِّ الرَّكْعَتَيْنِ وَفِي رِوَايَةِ قُتَيْبَةَ قَالَ صَلِّ رَكْعَتَيْنِ."
      },
      {
        "id": 9585,
        "hadith_number": "2021",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Solat Sunat Sebelum Duduk Ketika Khutbah Jumaat",
        "perawi_melayu": "Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "A person came (in the Mosque) while the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was delivering the sermon on Friday (standing) on the pulpit. He (the Holy Prophet) said to him: Have you offered two rak'ahs? He said: No. Upon this he said: Then observe (them).",
        "malay_translation": "Seorang lelaki datang (ke dalam Masjid) ketika Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sedang menyampaikan khutbah pada hari Jumaat (berdiri) di atas mimbar. Baginda (Nabi Suci) bertanya kepadanya: Adakah kamu sudah menunaikan solat dua rakaat? Dia menjawab: Belum. Lalu Baginda bersabda: Maka tunaikanlah (solat sunat dua rakaat).",
        "arabic_text": "و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ قَالَ ابْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ جَاءَ رَجُلٌ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ يَخْطُبُ فَقَالَ لَهُ أَرَكَعْتَ رَكْعَتَيْنِ قَالَ لَا فَقَالَ ارْكَعْ."
      },
      {
        "id": 9586,
        "hadith_number": "2022",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Anjuran Solat Dua Rakaat Sebelum Jumaat Walaupun Imam Sudah Hadir",
        "perawi_melayu": "Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ berkata:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) delivered the sermon and said: When any one of you comes for the Friday (prayer) and the Imam comes out (from his apartment), (even then) should observe two rak'ahs (of prayer).",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) menyampaikan khutbah dan bersabda: Apabila salah seorang kamu datang untuk solat Jumaat dan imam telah keluar (dari biliknya), (maka) hendaklah dia menunaikan dua rakaat (solat).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدٌ وَهُوَ ابْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرٍو قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَ فَقَالَ إِذَا جَاءَ أَحَدُكُمْ يَوْمَ الْجُمُعَةِ وَقَدْ خَرَجَ الْإِمَامُ فَلْيُصَلِّ رَكْعَتَيْنِ."
      },
      {
        "id": 9587,
        "hadith_number": "2023",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perintah Solat Dua Rakaat Sebelum Duduk di Masjid",
        "perawi_melayu": "Jabir رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "Sulaik Ghatafani came on Friday (for prayer) while the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was sitting on the pulpit. Sulaik also sat down before observing prayer. The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Have you observed two rak'ahs? He said: No. He (the Holy Prophet) said: Stand and observe them",
        "malay_translation": "Sulaik al-Ghatafani datang pada hari Jumaat (untuk solat) ketika Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) sedang duduk di atas mimbar. Sulaik juga terus duduk sebelum menunaikan solat. Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) bertanya: 'Adakah kamu sudah menunaikan solat dua rakaat?' Dia menjawab: 'Belum.' Baginda (Nabi Muhammad SAW) bersabda: 'Bangun dan tunaikanlah solat dua rakaat tersebut.'",
        "arabic_text": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّهُ قَالَ جَاءَ سُلَيْكٌ الْغَطَفَانِيُّ يَوْمَ الْجُمُعَةِ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَاعِدٌ عَلَى الْمِنْبَرِ فَقَعَدَ سُلَيْكٌ قَبْلَ أَنْ يُصَلِّيَ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرَكَعْتَ رَكْعَتَيْنِ قَالَ لَا قَالَ قُمْ فَارْكَعْهُمَا."
      },
      {
        "id": 9588,
        "hadith_number": "2024",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Solat Dua Rakaat Ringkas Ketika Imam Berkhutbah pada Hari Jumaat",
        "perawi_melayu": "Jabir bin 'Abdullah رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "Sulaik Ghatafani رضی اللہ تعالیٰ عنہ came on Friday when the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was delivering the sermon. He (Sulaik) sat down. He (the Holy Prophet) said to him: 0 Sulaik I stand and observe two rak'ahs and make them short, and then said: When any one of you comes on Friday, while the Imam delivers the sermon, he should observe two rak'ahs and should make them short.",
        "malay_translation": "Sulaik Ghatafani رضی اللہ تعالیٰ عنہ datang pada hari Jumaat ketika Rasulullah (صلی اللہ علیہ وسلم) sedang menyampaikan khutbah. Beliau (Sulaik) duduk. Baginda (Nabi Muhammad SAW) bersabda kepadanya: Wahai Sulaik! Berdirilah dan solatlah dua rakaat dan ringkaskanlah keduanya, kemudian bersabda: Apabila salah seorang daripada kamu datang pada hari Jumaat, ketika imam sedang menyampaikan khutbah, maka hendaklah dia solat dua rakaat dan hendaklah dia meringkaskan keduanya.",
        "arabic_text": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَلِيُّ بْنُ خَشْرَمٍ كِلَاهُمَا عَنْ عِيسَى بْنِ يُونُسَ قَالَ ابْنُ خَشْرَمٍ أَخْبَرَنَا عِيسَى عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ جَاءَ سُلَيْكٌ الْغَطَفَانِيُّ يَوْمَ الْجُمُعَةِ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ فَجَلَسَ فَقَالَ لَهُ يَا سُلَيْكُ قُمْ فَارْكَعْ رَكْعَتَيْنِ وَتَجَوَّزْ فِيهِمَا ثُمَّ قَالَ إِذَا جَاءَ أَحَدُكُمْ يَوْمَ الْجُمُعَةِ وَالْإِمَامُ يَخْطُبُ فَلْيَرْكَعْ رَكْعَتَيْنِ وَلْيَتَجَوَّزْ فِيهِمَا."
      },
      {
        "id": 9589,
        "hadith_number": "2025",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Nabi Mengajar Agama kepada Orang Asing dan Menghentikan Khutbah Seketika",
        "perawi_melayu": "Abu Rifa'a رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "I came to the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) when he was delivering the sermon, and I said: Messenger of Allah, here is a stranger and he wants to learn about this religion and he does not know what this religion is. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) looked at me and left his sermon till he came to me, and he was given a chair and I thought that Its legs were made of iron. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) sat In it and he began to teach me what Allah had taught him. He then came (to the pulpit) for his sermon and completed it to the end.",
        "malay_translation": "Aku datang kepada Nabi (ﷺ) ketika baginda sedang menyampaikan khutbah, dan aku berkata: Wahai Rasulullah, ini adalah seorang asing dan dia ingin belajar tentang agama ini dan dia tidak tahu apa agama ini. Rasulullah (ﷺ) memandangku dan menghentikan khutbah baginda sehingga baginda datang kepadaku, dan baginda diberikan sebuah kerusi dan aku menyangka kaki kerusi itu diperbuat daripada besi. Rasulullah (ﷺ) duduk di atasnya dan baginda mula mengajar aku apa yang Allah telah ajarkan kepada baginda. Kemudian baginda datang (ke mimbar) untuk khutbahnya dan menyempurnakannya hingga akhir.",
        "arabic_text": "و حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ حَدَّثَنَا حُمَيْدُ بْنُ هِلَالٍ قَالَ قَالَ أَبُو رِفَاعَةَ انْتَهَيْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَخْطُبُ قَالَ فَقُلْتُ يَا رَسُولَ اللَّهِ رَجُلٌ غَرِيبٌ جَاءَ يَسْأَلُ عَنْ دِينِهِ لَا يَدْرِي مَا دِينُهُ قَالَ فَأَقْبَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَتَرَكَ خُطْبَتَهُ حَتَّى انْتَهَى إِلَيَّ فَأُتِيَ بِكُرْسِيٍّ حَسِبْتُ قَوَائِمَهُ حَدِيدًا قَالَ فَقَعَدَ عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَعَلَ يُعَلِّمُنِي مِمَّا عَلَّمَهُ اللَّهُ ثُمَّ أَتَى خُطْبَتَهُ فَأَتَمَّ آخِرَهَا."
      },
      {
        "id": 9590,
        "hadith_number": "2026",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Bacaan Surah dalam Solat Jumaat",
        "perawi_melayu": "Berkata Ibn Abu Rafi':",
        "english_text": "Marwan appointed Abu Huraira رضی اللہ عنہ as his deputy in Medina and he himself left for Mecca. Abu Huraira رضی اللہ عنہ led us in the Jumu'a prayer and recited after Surah Jumu'a in the second rak'ah: When the hypocrites came to thee (Surah 63). I then met Abu Huraira as he came back and said to him: You have recited two surahs which 'Ali bin Abu Talib used to recite in Kufah. Upon this Abu Huraira رضی اللہ عنہ said: I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) reciting these two in the Friday (prayer).",
        "malay_translation": "Marwan melantik Abu Hurairah رضی اللہ عنہ sebagai timbalannya di Madinah dan beliau sendiri pergi ke Makkah. Abu Hurairah رضی اللہ عنہ mengimamkan solat Jumaat dan membaca selepas Surah Jumaat pada rakaat kedua: Apabila orang-orang munafik datang kepadamu (Surah 63). Kemudian saya bertemu Abu Hurairah ketika beliau kembali dan berkata kepadanya: Anda telah membaca dua surah yang biasa dibaca oleh 'Ali bin Abu Talib di Kufah. Atas pertanyaan ini, Abu Hurairah رضی اللہ عنہ berkata: Saya mendengar Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) membaca kedua surah ini dalam solat Jumaat.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا سُلَيْمَانُ وَهُوَ ابْنُ بِلَالٍ عَنْ جَعْفَرٍ عَنْ أَبِيهِ عَنْ ابْنِ أَبِي رَافِعٍ قَالَ اسْتَخْلَفَ مَرْوَانُ أَبَا هُرَيْرَةَ عَلَى الْمَدِينَةِ وَخَرَجَ إِلَى مَكَّةَ فَصَلَّى لَنَا أَبُو هُرَيْرَةَ الْجُمُعَةَ فَقَرَأَ بَعْدَ سُورَةِ الْجُمُعَةِ فِي الرَّكْعَةِ الْآخِرَةِ إِذَا جَاءَكَ الْمُنَافِقُونَ قَالَ فَأَدْرَكْتُ أَبَا هُرَيْرَةَ حِينَ انْصَرَفَ فَقُلْتُ لَهُ إِنَّكَ قَرَأْتَ بِسُورَتَيْنِ كَانَ عَلِيُّ بْنُ أَبِي طَالِبٍ يَقْرَأُ بِهِمَا بِالْكُوفَةِ فَقَالَ أَبُو هُرَيْرَةَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ بِهِمَا يَوْمَ الْجُمُعَةِ."
      },
      {
        "id": 9591,
        "hadith_number": "2027",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Bacaan Surah Jumu'ah dan Al-Munafiqun dalam Solat",
        "perawi_melayu": "Hadis ini diriwayatkan oleh Abdullah bin Abu Rafi' dengan sanad yang sama tetapi dengan sedikit perubahan:",
        "english_text": "That he recited Surah Jumu'a (lxii.) in the first rak'ah and The hypocrites came in the second rak'ah.",
        "malay_translation": "Bahawa baginda membaca Surah Jumu'ah (lxii.) pada rakaat pertama dan surah Al-Munafiqun pada rakaat kedua.",
        "arabic_text": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَا حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ ح و حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي الدَّرَاوَرْدِيَّ كِلَاهُمَا عَنْ جَعْفَرٍ عَنْ أَبِيهِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ قَالَ اسْتَخْلَفَ مَرْوَانُ أَبَا هُرَيْرَةَ بِمِثْلِهِ غَيْرَ أَنَّ فِي رِوَايَةِ حَاتِمٍ فَقَرَأَ بِسُورَةِ الْجُمُعَةِ فِي السَّجْدَةِ الْأُولَى وَفِي الْآخِرَةِ إِذَا جَاءَكَ الْمُنَافِقُونَ وَرِوَايَةُ عَبْدِ الْعَزِيزِ مِثْلُ حَدِيثِ سُلَيْمَانَ بْنِ بِلَالٍ."
      },
      {
        "id": 9592,
        "hadith_number": "2028",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Bacaan Surah dalam Solat Hari Raya dan Jumaat",
        "perawi_melayu": "Nu'man bin Bashir رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to recite on two 'Ids and in Friday prayer: Glorify The name of Thy Lord, the Most High (Surah lxxxvii.), and: Has there come to thee the news of the overwhelming event (lxxxviii.). And when the 'Id and Jumu'a combined on a day he recited these two (surah) in both the prayers.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم‌) biasanya membaca dalam solat dua Hari Raya dan solat Jumaat: 'Sucikanlah nama Tuhanmu Yang Maha Tinggi' (Surah al-A'la, lxxxvii), dan: 'Sudahkah sampai kepadamu berita tentang peristiwa yang dahsyat (hari kiamat)?' (Surah al-Ghashiyah, lxxxviii). Dan apabila Hari Raya dan Jumaat jatuh pada hari yang sama, baginda membaca kedua-dua surah ini dalam kedua-dua solat tersebut.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ جَمِيعًا عَنْ جَرِيرٍ قَالَ يَحْيَى أَخْبَرَنَا جَرِيرٌ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ عَنْ أَبِيهِ عَنْ حَبِيبِ بْنِ سَالِمٍ مَوْلَى النُّعْمَانِ بْنِ بَشِيرٍ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الْعِيدَيْنِ وَفِي الْجُمُعَةِ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَهَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ قَالَ وَإِذَا اجْتَمَعَ الْعِيدُ وَالْجُمُعَةُ فِي يَوْمٍ وَاحِدٍ يَقْرَأُ بِهِمَا أَيْضًا فِي الصَّلَاتَيْنِ."
      },
      {
        "id": 9593,
        "hadith_number": "2029",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Diriwayatkan dengan Sanad yang Sama",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "This hadith has been narrated by Ibrahim bin Muhammad bin al-Muntashir with the same chain of transmitters.",
        "malay_translation": "Hadis ini telah diriwayatkan oleh Ibrahim bin Muhammad bin al-Muntashir dengan sanad yang sama.",
        "arabic_text": "و حَدَّثَنَاه قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ بِهَذَا الْإِسْنَادِ."
      },
      {
        "id": 9594,
        "hadith_number": "2030",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Bacaan Rasulullah SAW pada Hari Jumaat Selain Surah al-Jumu'ah",
        "perawi_melayu": "Dahhak bin Qais menulis surat kepada Nu'man bin Bashir رضی اللہ تعالیٰ عنہ bertanya kepadanya:",
        "english_text": "What the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) recited on Friday besides Surah Jumu'a He said that he recited: Has there reached... (Surah lxxxviii, ).",
        "malay_translation": "Apa yang Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) baca pada hari Jumaat selain Surah Jumu'ah. Beliau berkata bahawa baginda membaca: Adakah telah sampai kepadamu... (Surah al-Ghashiyah, ).",
        "arabic_text": "و حَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ ضَمْرَةَ بْنِ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ قَالَ كَتَبَ الضَّحَّاكُ بْنُ قَيْسٍ إِلَى النُّعْمَانِ بْنِ بَشِيرٍ يَسْأَلُهُ أَيَّ شَيْءٍ قَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْجُمُعَةِ سِوَى سُورَةِ الْجُمُعَةِ فَقَالَ كَانَ يَقْرَأُ هَلْ أَتَاكَ."
      },
      {
        "id": 9595,
        "hadith_number": "2031",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Bacaan Rasulullah SAW dalam Solat Subuh dan Jumaat pada Hari Jumaat",
        "perawi_melayu": "Diriwayatkan oleh Ibn Abbas رضی اللہ تعالیٰ عنہ:",
        "english_text": "The Apostle of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to recite in the morning prayer on Friday Surah Alif-Lam-Mim, Tanz'il ul-Sajda (Surah xxxii.): Surely there came over the man a time (Surah lxxvii) and he used to recite in Jumu'a prayer Surahs Jumu'a and al-Munafiqin.",
        "malay_translation": "Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) biasa membaca dalam solat Subuh pada hari Jumaat Surah Alif-Lam-Mim, Tanz'il ul-Sajda (Surah xxxii.): Sesungguhnya telah datang kepada manusia suatu masa (Surah lxxvii) dan baginda biasa membaca dalam solat Jumaat Surah Jumu'a dan al-Munafiqin.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ سُفْيَانَ عَنْ مُخَوَّلِ بْنِ رَاشِدٍ عَنْ مُسْلِمٍ الْبَطِينِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي صَلَاةِ الْفَجْرِ يَوْمَ الْجُمُعَةِ الم تَنْزِيلُ السَّجْدَةِ وَهَلْ أَتَى عَلَى الْإِنْسَانِ حِينٌ مِنْ الدَّهْرِ وَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي صَلَاةِ الْجُمُعَةِ سُورَةَ الْجُمُعَةِ وَالْمُنَافِقِينَ."
      },
      {
        "id": 9596,
        "hadith_number": "2032",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Serupa Diriwayatkan oleh Sufyan",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "A hadith like this has been narrated by Sufyan with the same chain of transmitters.",
        "malay_translation": "Hadis seperti ini telah diriwayatkan oleh Sufyan dengan sanad yang sama.",
        "arabic_text": "و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي ح و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا وَكِيعٌ كِلَاهُمَا عَنْ سُفْيَانَ بِهَذَا الْإِسْنَادِ مِثْلَهُ."
      },
      {
        "id": 9597,
        "hadith_number": "2033",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Laporan Serupa Berkaitan Solat (Seperti No. 2031)",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "A similar report (as no. 2031) was narrated from Mukhawwal with this chain concerning \r\nboth prayers, as Sufyan said.",
        "malay_translation": "Laporan yang serupa (seperti no. 2031) diriwayatkan daripada Mukhawwal dengan sanad ini berkenaan kedua-dua solat, seperti yang dikatakan oleh Sufyan.",
        "arabic_text": "و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ مُخَوَّلٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ فِي الصَّلَاتَيْنِ كِلْتَيْهِمَا كَمَا قَالَ سُفْيَانُ."
      },
      {
        "id": 9598,
        "hadith_number": "2034",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Bacaan Rasulullah SAW dalam Solat Subuh pada Hari Jumaat",
        "perawi_melayu": "Daripada Abu Hurairah رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to recite in the dawn prayer on Friday Alif-Lam-Mim, Tanzil and Surely there came.",
        "malay_translation": "Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) biasa membaca dalam solat Subuh pada hari Jumaat Alif-Lam-Mim, Tanzil dan Sesungguhnya telah datang.",
        "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقْرَأُ فِي الْفَجْرِ يَوْمَ الْجُمُعَةِ الم تَنْزِيلُ وَهَلْ أَتَى."
      },
      {
        "id": 9599,
        "hadith_number": "2035",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Bacaan Rasulullah SAW dalam Solat Subuh pada Hari Jumaat",
        "perawi_melayu": "Abu Huraira رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to recite in the dawn prayer on Friday: Alif-Lam-Mim, Tanzil in the first rak'ah, and in the second one: Surely there came over the man a time when he was nothing that could be mentioned.",
        "malay_translation": "Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) biasa membaca dalam solat Subuh pada hari Jumaat: Alif-Lam-Mim, Tanzil dalam rakaat pertama, dan dalam rakaat kedua: Sesungguhnya telah datang kepada manusia suatu masa ketika dia bukanlah sesuatu yang dapat disebut.",
        "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ عَنْ أَبِيهِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي الصُّبْحِ يَوْمَ الْجُمُعَةِ بِ الم تَنْزِيلُ فِي الرَّكْعَةِ الْأُولَى وَفِي الثَّانِيَةِ هَلْ أَتَى عَلَى الْإِنْسَانِ حِينٌ مِنْ الدَّهْرِ لَمْ يَكُنْ شَيْئًا مَذْكُورًا."
      },
      {
        "id": 9600,
        "hadith_number": "2036",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Anjuran Solat Sunat Empat Rakaat Selepas Solat Jumaat",
        "perawi_melayu": "Diriwayatkan daripada Abu Huraira رضی اللہ تعالیٰ عنہ:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: When any one of you observes the Jumu'a prayer (two obligatory rak'ahs in congregation), he should observe four (rak'ahs) afterwards.",
        "malay_translation": "Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Apabila salah seorang kamu selesai menunaikan solat Jumaat (dua rakaat wajib secara berjemaah), maka hendaklah dia mengerjakan empat (rakaat) selepasnya.",
        "arabic_text": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى أَحَدُكُمْ الْجُمُعَةَ فَلْيُصَلِّ بَعْدَهَا أَرْبَعًا."
      },
      {
        "id": 9601,
        "hadith_number": "2037",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Solat Sunat Selepas Jumaat: Empat atau Dua Rakaat",
        "perawi_melayu": "Suhail meriwayatkan daripada Abu Huraira رضی اللہ تعالیٰ عنہ :",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: When you observe prayer after (the two obligatory rak'ahs) of Jumu'ah, you should observe four rak'ahs (and 'Amr in his narration has made this addition that Ibn Idris said this on the authority of Suhail): And if you are in a hurry on account of something, you should observe two rak'ahs in the mosque and two when you return (to your house).",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Apabila kamu menunaikan solat sunat selepas (dua rakaat wajib) solat Jumaat, maka hendaklah kamu menunaikan empat rakaat (dan 'Amr dalam riwayatnya telah membuat tambahan ini bahawa Ibn Idris berkata ini berdasarkan riwayat daripada Suhail): Dan jika kamu tergesa-gesa kerana sesuatu urusan, maka hendaklah kamu menunaikan dua rakaat di masjid dan dua rakaat apabila kamu kembali (ke rumah kamu).",
        "arabic_text": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّيْتُمْ بَعْدَ الْجُمُعَةِ فَصَلُّوا أَرْبَعًا زَادَ عَمْرٌو فِي رِوَايَتِهِ قَالَ ابْنُ إِدْرِيسَ قَالَ سُهَيْلٌ فَإِنْ عَجِلَ بِكَ شَيْءٌ فَصَلِّ رَكْعَتَيْنِ فِي الْمَسْجِدِ وَرَكْعَتَيْنِ إِذَا رَجَعْتَ."
      },
      {
        "id": 9602,
        "hadith_number": "2038",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Solat Sunat Empat Rakaat Selepas Jumaat",
        "perawi_melayu": "Daripada Abu Hurairah رضی اللہ تعالیٰ عنہ meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: When any one amongst you observes prayer after Jumu'a, he should observe four rak'ahs. (In the hadith transmitted by Jarir the word minkum is not recorded.)",
        "malay_translation": "Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Apabila salah seorang daripada kamu menunaikan solat selepas solat Jumaat, maka hendaklah dia menunaikan empat rakaat. (Dalam hadis yang diriwayatkan oleh Jarir, perkataan 'minkum' tidak direkodkan.)",
        "arabic_text": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ ح و حَدَّثَنَا عَمْرٌو النَّاقِدُ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ كِلَاهُمَا عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَ مِنْكُمْ مُصَلِّيًا بَعْدَ الْجُمُعَةِ فَلْيُصَلِّ أَرْبَعًا وَلَيْسَ فِي حَدِيثِ جَرِيرٍ مِنْكُمْ."
      },
      {
        "id": 9603,
        "hadith_number": "2039",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Amalan Abdullah bin Umar Selepas Solat Jumaat di Rumah",
        "perawi_melayu": "Diriwayatkan oleh Nafi':",
        "english_text": "When 'Abdullah (bin 'Umar رضی اللہ تعالیٰ عنہ ) observed the Friday prayer and came back he observed two rak'ahs in his house, and then said: The Messenger of Allah (may peace be updn him) used to do this.",
        "malay_translation": "Ketika 'Abdullah bin 'Umar (رضي الله تعالى عنه) menunaikan solat Jumaat dan kembali, beliau menunaikan dua rakaat di rumahnya, dan kemudian berkata: Rasulullah ( صلى الله عليه وسلم ) biasa melakukan ini.",
        "arabic_text": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَمُحَمَّدُ بْنُ رُمْحٍ قَالَا أَخْبَرَنَا اللَّيْثُ ح و حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا لَيْثٌ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ أَنَّهُ كَانَ إِذَا صَلَّى الْجُمُعَةَ انْصَرَفَ فَسَجَدَ سَجْدَتَيْنِ فِي بَيْتِهِ ثُمَّ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ ذَلِكَ."
      },
      {
        "id": 9604,
        "hadith_number": "2040",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Solat Sunat Selepas Jumaat di Rumah",
        "perawi_melayu": "Abdullah bin 'Umar Radiyallahu Anhu",
        "english_text": "While describing the Nafl prayer of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), said: He did not observe (Nafl) prayer after Jumu'a till he went back and observed two rak'ahs in his house. Yahya said: I guess that I uttered these words (before Imam Malik) that he of course observed (them).",
        "malay_translation": "Ketika menerangkan tentang solat sunat Rasulullah (Sallallahu Alaihi Wasallam), beliau berkata: Baginda tidak melakukan solat (sunat) selepas Jumaat sehinggalah Baginda pulang dan melakukan dua rakaat di rumah Baginda. Yahya berkata: Saya rasa saya mengucapkan kata-kata ini (di hadapan Imam Malik) bahawa baginda sememangnya melakukannya (solat sunat tersebut).",
        "arabic_text": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّهُ وَصَفَ تَطَوُّعَ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَكَانَ لَا يُصَلِّي بَعْدَ الْجُمُعَةِ حَتَّى يَنْصَرِفَ فَيُصَلِّي رَكْعَتَيْنِ فِي بَيْتِهِ قَالَ يَحْيَى أَظُنُّنِي قَرَأْتُ فَيُصَلِّي أَوْ أَلْبَتَّةَ."
      },
      {
        "id": 9605,
        "hadith_number": "2041",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Sunat Dua Rakaat Selepas Jumaat",
        "perawi_melayu": "Salim meriwayatkan daripada ayahnya:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to observe two rak'ahs after Jumu'a.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) biasa mengerjakan dua rakaat selepas Jumaat.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَابْنُ نُمَيْرٍ قَالَ زُهَيْرٌ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ حَدَّثَنَا عَمْرٌو عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ."
      },
      {
        "id": 9606,
        "hadith_number": "2042",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Meneruskan Solat Sunat Selepas Jumaat di Tempat Solat Tanpa Bercakap atau Bergerak",
        "perawi_melayu": "`Umar bin `Ata' bin Abu Khuwar berkata:",
        "english_text": "Nafi` bin Jubair sent him to al- Sa'ib the son of Namir's sister to ask him about what he had seen in the prayer of Mu`awiya رضی اللہ تعالیٰ عنہ. He said: Yes, I observed the Jumu`a prayer along with him in Maqsura and when the Imam pronounced salutation I stood up at my place and observed (Sunan rak`ahs). As he entered (the apartment) he sent for me and said: Do not repeat what you have done. Whenever you have observed the Jumu`a prayer, do not observe (Sunan prayer) till you, have talked or gone out, for the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had ordered us to do this and not to combine two (types of) prayers without talking or going out.",
        "malay_translation": "Nafi` bin Jubair telah menghantarnya kepada al-Sa'ib anak saudara perempuan Namir untuk bertanya kepadanya tentang apa yang telah dilihatnya dalam solat Mu`awiya رضی اللہ تعالیٰ عنہ. Beliau berkata: Ya, saya telah menunaikan solat Jumaat bersamanya di Maqsura dan apabila Imam mengucapkan salam, saya berdiri di tempat saya dan menunaikan (rak'at sunat). Ketika beliau masuk (ke apartmen), beliau telah menghantar seseorang untuk memanggil saya dan berkata: Jangan ulangi apa yang telah kamu lakukan. Setiap kali kamu telah menunaikan solat Jumaat, jangan menunaikan (solat sunat) sehingga kamu telah bercakap atau keluar, kerana Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) telah memerintahkan kami untuk melakukan ini dan tidak menggabungkan dua (jenis) solat tanpa bercakap atau keluar.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا غُنْدَرٌ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي عُمَرُ بْنُ عَطَاءِ بْنِ أَبِي الْخُوَارِ أَنَّ نَافِعَ بْنَ جُبَيْرٍ أَرْسَلَهُ إِلَى السَّائِبِ ابْنِ أُخْتِ نَمِرٍ يَسْأَلُهُ عَنْ شَيْءٍ رَآهُ مِنْهُ مُعَاوِيَةُ فِي الصَّلَاةِ فَقَالَ نَعَمْ صَلَّيْتُ مَعَهُ الْجُمُعَةَ فِي الْمَقْصُورَةِ فَلَمَّا سَلَّمَ الْإِمَامُ قُمْتُ فِي مَقَامِي فَصَلَّيْتُ فَلَمَّا دَخَلَ أَرْسَلَ إِلَيَّ فَقَالَ لَا تَعُدْ لِمَا فَعَلْتَ إِذَا صَلَّيْتَ الْجُمُعَةَ فَلَا تَصِلْهَا بِصَلَاةٍ حَتَّى تَكَلَّمَ أَوْ تَخْرُجَ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَنَا بِذَلِكَ أَنْ لَا تُوصَلَ صَلَاةٌ بِصَلَاةٍ حَتَّى نَتَكَلَّمَ أَوْ نَخْرُجَ."
      },
      {
        "id": 9607,
        "hadith_number": "2043",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Berdiri Selepas Taslim Tanpa Menyebut Imam",
        "perawi_melayu": "'Umar bin Ata' meriwayatkan:",
        "english_text": "Nafi bin Jubair sent him to As Saib bin Yazid the son of the sister of Namir... and he quoted a similar Hadith (as no. 2042), that he said: \"When he said the Taslim I stood up where I was,\" and he did not mention the Imam.",
        "malay_translation": "Nafi bin Jubair telah menghantarnya kepada As Saib bin Yazid anak saudara perempuan Namir... dan dia memetik Hadis yang serupa (seperti no. 2042), bahawa dia berkata: \"Apabila dia mengucapkan Taslim, saya berdiri di tempat saya berada,\" dan dia tidak menyebut Imam.",
        "arabic_text": "و حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عُمَرُ بْنُ عَطَاءٍ أَنَّ نَافِعَ بْنَ جُبَيْرٍ أَرْسَلَهُ إِلَى السَّائِبِ بْنِ يَزِيدَ ابْنِ أُخْتِ نَمِرٍ وَسَاقَ الْحَدِيثَ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ فَلَمَّا سَلَّمَ قُمْتُ فِي مَقَامِي وَلَمْ يَذْكُرْ الْإِمَامَ."
      }
    ]
  }
}