{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 170,
    "data": [
      {
        "id": 10962,
        "hadith_number": "3398",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkahwinan Sebagai Pencegah Daripada Kemungkaran",
        "perawi_melayu": "Alqama melaporkan:",
        "english_text": "While I was walking with 'Abdullah at Mina, 'Uthman رضی اللہ عنہ happened to meet him. He stopped there and began to talk with him. Uthman said to him: Abu 'Abdul-Rahman, should we not marry you to a young girl who may recall to you some of the past of your bygone days; thereupon he said: If you say so, Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) said: O young men, those among you who can support a wife should marry, for it restrains eyes from casting (evil glances). and preserves one from immorality; but those who cannot should devote themselves to fasting for it is a means of controlling sexual desire.",
        "malay_translation": "Ketika aku berjalan bersama 'Abdullah di Mina, 'Uthman رضی اللہ عنہ kebetulan bertemu dengannya. Beliau berhenti di situ dan mula bercakap dengannya. 'Uthman berkata kepadanya: Wahai Abu 'Abdul-Rahman, mengapakah kita tidak menikahkan engkau dengan seorang gadis muda yang mungkin mengingatkan engkau akan kenangan masa lalu; lalu dia menjawab: Jika itu yang engkau ingin, Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) bersabda: Wahai para pemuda, sesiapa di antara kamu yang mampu menyara isteri hendaklah berkahwin, kerana ia menahan pandangan yang buruk dan memelihara daripada perbuatan maksiat. Tetapi bagi mereka yang tidak mampu, hendaklah mereka berpuasa, kerana ia adalah jalan untuk mengawal keinginan seksual.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْعَلَاءِ الْهَمْدَانِيُّ، جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ، وَاللَّفْظُ لِيَحْيَى، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، قَالَ: كُنْتُ أَمْشِي مَعَ عَبْدِ اللهِ بِمِنًى، فَلَقِيَهُ عُثْمَانُ، فَقَامَ مَعَهُ يُحَدِّثُهُ، فَقَالَ لَهُ عُثْمَانُ: يَا أَبَا عَبْدِ الرَّحْمَنِ، أَلَا نُزَوِّجُكَ جَارِيَةً شَابَّةً، لَعَلَّهَا تُذَكِّرُكَ بَعْضَ مَا مَضَى مِنْ زَمَانِكَ، قَالَ: فَقَالَ عَبْدُ اللهِ: لَئِنْ قُلْتَ ذَاكَ، لَقَدْ قَالَ لَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَا مَعْشَرَ الشَّبَابِ، مَنِ اسْتَطَاعَ مِنْكُمُ الْبَاءَةَ فَلْيَتَزَوَّجْ، فَإِنَّهُ أَغَضُّ لِلْبَصَرِ، وَأَحْصَنُ لِلْفَرْجِ، وَمَنْ لَمْ يَسْتَطِعْ فَعَلَيْهِ بِالصَّوْمِ، فَإِنَّهُ لَهُ وِجَا."
      },
      {
        "id": 10963,
        "hadith_number": "3399",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perbualan 'Abdullah bin Mas'ud dan 'Uthman bin 'Affan Mengenai Perkahwinan",
        "perawi_melayu": "Alqama meriwayatkan:",
        "english_text": "While I was going along with 'Abdullah bin Ma'sud (رضی اللہ عنہ) in Mina, 'Uthman bin 'Affan (رضی اللہ عنہ) happened to meet him and said: Come here, Abu 'Abdul-Rahman (kunya of Abdullah bin Mas'ud), and he isolated him (from me), and when 'Abdullah (bin Mas'ud) رضی اللہ عنہ saw that there was no need (for this privacy), he said to me: 'Alqama, come on, and so I went there. (Then) 'Uthman رضی اللہ عنہ said to him: Abu Abdul-Rahman, should we not marry you to a virgin girl that your past may be recalled to your mind? 'Abdullah رضی اللہ عنہ said: If you say so, the rest of the hadith is the same as narrated above.",
        "malay_translation": "Ketika aku berjalan bersama 'Abdullah bin Mas'ud (رضي الله عنه) di Mina, 'Uthman bin 'Affan (رضي الله عنه) kebetulan bertemu dengannya dan berkata: Datanglah ke sini, wahai Abu 'Abdul-Rahman (gelaran bagi 'Abdullah bin Mas'ud), dan dia mengasingkan 'Abdullah (dariku).  Apabila 'Abdullah bin Mas'ud (رضي الله عنه) melihat bahawa tiada keperluan untuk berasingan, dia berkata kepadaku: 'Alqama, datanglah,' dan aku pun pergi ke situ. Kemudian, 'Uthman (رضي الله عنه) berkata kepadanya: Wahai Abu 'Abdul-Rahman, mengapakah kita tidak menikahkanmu dengan seorang gadis perawan supaya peristiwa masa lalumu teringat semula? 'Abdullah (رضي الله عنه) menjawab: Jika itu kehendakmu, maka selebihnya hadith ini adalah seperti yang diriwayatkan di atas.",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، قَالَ: إِنِّي لَأَمْشِي مَعَ عَبْدِ اللهِ بْنِ مَسْعُودٍ بِمِنًى، إِذْ لَقِيَهُ عُثْمَانُ بْنُ عَفَّانَ، فَقَالَ: هَلُمَّ يَا أَبَا عَبْدِ الرَّحْمَنِ، قَالَ: فَاسْتَخْلَاهُ، فَلَمَّا رَأَى عَبْدُ اللهِ أَنْ لَيْسَتْ لَهُ حَاجَةٌ، قَالَ: قَالَ لِي: تَعَالَ يَا عَلْقَمَةُ، قَالَ: فَجِئْتُ، فَقَالَ لَهُ عُثْمَانُ: أَلَا نُزَوِّجُكَ يَا أَبَا عَبْدِ الرَّحْمَنِ جَارِيَةً بِكْرًا، لَعَلَّهُ يَرْجِعُ إِلَيْكَ مِنْ نَفْسِكَ مَا كُنْتَ تَعْهَدُ؟ فَقَالَ عَبْدُ اللهِ: لَئِنْ قُلْتَ ذَاكَ، فَذَكَرَ بِمِثْلِ حَدِيثِ أَبِي مُعَاوِيَةَ."
      },
      {
        "id": 10964,
        "hadith_number": "3400",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkahwinan Sebagai Pencegahan Daripada Kemaksiatan",
        "perawi_melayu": "Abdullah bin Mas'ud (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to us: O young men, those among you who can support a wife should marry, for it restrains eyes (from casting evil glances) and preserves one from immorality; but he who cannot afford It should observe fast for it is a means of controlling the sexual desire.",
        "malay_translation": "Rasulullah (ﷺ) bersabda kepada kita: Wahai para pemuda, sesiapa di antara kamu yang mampu menyara isteri, hendaklah dia berkahwin. Kerana ia dapat mengawal pandangan (daripada memandang dengan pandangan yang buruk) dan memelihara diri daripada perbuatan yang keji. Tetapi, sesiapa yang tidak mampu, hendaklah dia berpuasa, kerana ia merupakan jalan untuk mengawal nafsu.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ عَبْدِ اللهِ، قَالَ: قَالَ لَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَا مَعْشَرَ الشَّبَابِ، مَنِ اسْتَطَاعَ مِنْكُمُ الْبَاءَةَ فَلْيَتَزَوَّجْ، فَإِنَّهُ أَغَضُّ لِلْبَصَرِ، وَأَحْصَنُ لِلْفَرْجِ، وَمَنْ لَمْ يَسْتَطِعْ فَعَلَيْهِ بِالصَّوْمِ، فَإِنَّهُ لَهُ وِجَاءٌ»."
      },
      {
        "id": 10965,
        "hadith_number": "3401",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis tentang Perkahwinan dan Pengajaran Nabi SAW",
        "perawi_melayu": "Abu al-Rahman bin Yazid berkata:",
        "english_text": "I and my uncle 'Alqama and al-Aswad went to 'Abdullah bin Mas'ud (رضی اللہ عنہ). He (the narrator further) said: I was at that time young, and he narrated a hadith which it seemed he narrated for me that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said like one transmitted by Mu'awiya, and further added: I lost no time in marrying.",
        "malay_translation": "Saya dan bapa saudara saya, 'Alqama dan al-Aswad, pergi menemui 'Abdullah bin Mas'ud (رضي الله عنه). Beliau (perawi selanjutnya) berkata: Saya masih muda pada waktu itu, dan beliau menyampaikan satu hadis seolah-olah khusus untuk saya, bahawa Rasulullah SAW bersabda seperti yang disampaikan oleh Mu'awiyah, dan selanjutnya beliau menambah: Saya tidak menunda-nunda untuk berkahwin.",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الْأَعْمَشِ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، قَالَ: دَخَلْتُ أَنَا وَعَمِّي عَلْقَمَةُ، وَالْأَسْوَدُ عَلَى عَبْدِ اللهِ بْنِ مَسْعُودٍ قَالَ: وَأَنَا شَابٌّ يَوْمَئِذٍ، فَذَكَرَ حَدِيثًا رُئِيتُ أَنَّهُ حَدَّثَ بِهِ مِنْ أَجْلِي، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ أَبِي مُعَاوِيَةَ، وَزَادَ قَالَ: فَلَمْ أَلْبَثْ حَتَّى تَزَوَّجْتُ."
      },
      {
        "id": 10966,
        "hadith_number": "3402",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkahwinan Tidak Ditangguh Walaupun Muda",
        "perawi_melayu": "Abdul-Rahman bin Yazid meriwayatkan daripada Abdullah رضي الله عنه :",
        "english_text": "We went to him, and I was the youngest of all (of us), but he did not mention: I lost no time in marrying.",
        "malay_translation": "Kami pergi kepadanya, dan saya adalah yang paling muda di antara kami semua, tetapi beliau tidak menyebut: Saya tidak membuang masa untuk berkahwin.",
        "arabic_text": "حَدَّثَنِي عَبْدُ اللهِ بْنُ سَعِيدٍ الْأَشَجُّ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الْأَعْمَشُ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ عَبْدِ اللهِ، قَالَ: دَخَلْنَا عَلَيْهِ وَأَنَا أَحْدَثُ الْقَوْمِ. بِمِثْلِ حَدِيثِهِمْ. وَلَمْ يَذْكُرْ: فَلَمْ أَلْبَثْ حَتَّى تَزَوَّجْتُ."
      },
      {
        "id": 10967,
        "hadith_number": "3403",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kebaikan Amalan Nabi dan Mencontohi Cara Hidup Baginda",
        "perawi_melayu": "Anas (رضي الله عنه) meriwayatkan:",
        "english_text": "Some of the Companions of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) asked his (the Prophet's) wives about the acts that he performed in private. Someone among them (among his Companions) said: I will not marry women; someone among them said: I will not eat meat; and someone among them said: I will not lie down in bed. He (the Holy Prophet) praised Allah and glorified Him, and said: What has happened to these people that they say so and so, whereas I observe prayer and sleep too; I observe fast and suspend observing them; I marry women also? And he who turns away from my Sunnah, he has no relation with Me.",
        "malay_translation": "Sebahagian sahabat Rasulullah SAW bertanya kepada isteri-isterinya tentang amalan Baginda secara peribadi. Ada di antara mereka berkata: Aku tidak akan berkahwin; ada yang berkata: Aku tidak akan makan daging; dan ada yang berkata: Aku tidak akan berbaring di atas katil. Baginda memuji Allah dan memuliakan-Nya, dan bersabda: Apakah yang telah menimpa orang-orang ini sehingga mereka berkata demikian, sedangkan aku menunaikan solat dan tidur juga; aku berpuasa dan menangguhkannya; aku berkahwin juga? Dan sesiapa yang berpaling daripada sunnahku, dia tidak ada hubungan denganku.",
        "arabic_text": "وحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ الْعَبْدِيُّ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ نَفَرًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سَأَلُوا أَزْوَاجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ عَمَلِهِ فِي السِّرِّ؟ فَقَالَ بَعْضُهُمْ: لَا أَتَزَوَّجُ النِّسَاءَ، وَقَالَ بَعْضُهُمْ: لَا آكُلُ اللَّحْمَ، وَقَالَ بَعْضُهُمْ: لَا أَنَامُ عَلَى فِرَاشٍ، فَحَمِدَ اللهَ وَأَثْنَى عَلَيْهِ. فَقَالَ: «مَا بَالُ أَقْوَامٍ قَالُوا كَذَا وَكَذَا؟ لَكِنِّي أُصَلِّي وَأَنَامُ، وَأَصُومُ وَأُفْطِرُ، وَأَتَزَوَّجُ النِّسَاءَ، فَمَنْ رَغِبَ عَنْ سُنَّتِي فَلَيْسَ مِنِّي»."
      },
      {
        "id": 10968,
        "hadith_number": "3404",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Rasulullah SAW Mengenai Kehidupan Selibat Uthman bin Muz'un",
        "perawi_melayu": "Sa'd bin Abi Waqqas (رضي الله عنه) meriwayatkan:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) rejected (the idea) of Uthman bin Muz'un رضی اللہ عنہ living in celibacy (saying): And if he (the Holy Prophet ﷺ) had given me permission We would have got ourselves castrated.",
        "malay_translation": "Pesuruhjaya Allah (صلی الله عليه وسلم) menolak (gagasan) Uthman bin Muz'un رضي الله عنه hidup dalam kebebasan seks (dengan bersabda): Dan sekiranya baginda (Nabi SAW) memberi izin kepada kami, kami akan mengkandungkan diri kami.",
        "arabic_text": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللهِ بْنُ الْمُبَارَكِ، ح وحَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ، وَاللَّفْظُ لَهُ، أَخْبَرَنَا ابْنُ الْمُبَارَكِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، قَالَ: «رَدَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى عُثْمَانَ بْنِ مَظْعُونٍ التَّبَتُّلَ، وَلَوْ أَذِنَ لَهُ لَاخْتَصَيْنَا."
      },
      {
        "id": 10969,
        "hadith_number": "3405",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Penolakan Kehidupan Selibat Uthman bin Maz'un",
        "perawi_melayu": "Sa'id bin al-Musayyib melaporkan:",
        "english_text": "I heard Sa'd (bin Abi Waqqas) saying that the idea of 'Uthman bin Maz'un ‌رضی ‌اللہ ‌عنہ ‌ ‌ for living in celibacy was rejected (by the Holy Prophet ﷺ), and if he had been given permission they would have got themselves castrated.",
        "malay_translation": "Saya mendengar Sa'd (bin Abi Waqqas) berkata bahawa idea Uthman bin Maz'un ‌رضی ‌اللہ ‌عنہ ‌ ‌ untuk hidup selibat ditolak (oleh Nabi saw). Dan sekiranya kebenaran diberikan, mereka akan mencacatkan diri mereka sendiri.",
        "arabic_text": "وحَدَّثَنِي أَبُو عِمْرَانَ مُحَمَّدُ بْنُ جَعْفَرِ بْنِ زِيَادٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، قَالَ: سَمِعْتُ سَعْدًا، يَقُولُ: «رُدَّ عَلَى عُثْمَانَ بْنِ مَظْعُونٍ التَّبَتُّلُ، وَلَوْ أُذِنَ لَهُ لَاخْتَصَيْنَا."
      },
      {
        "id": 10970,
        "hadith_number": "3406",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Hidup Selibat oleh Rasulullah SAW",
        "perawi_melayu": "Sa'id bin al Musayyib mendengar Sa'd bin Abi Waqqas رضي الله عنه berkata:",
        "english_text": "Uthman bin Maz'un رضی اللہ عنہ decided to live in celibacy, but Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) forbade him to do so, and if he had permitted him, we would have got ourselves castrated.",
        "malay_translation": "Uthman bin Maz'un رضي الله عنه bertekad untuk hidup selibat, tetapi Rasulullah صلى الله عليه وسلم melarangnya. Sekiranya baginda membenarkannya, nescaya kami akan melakukan pembedahan untuk menjadikan diri kami selibat.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا حُجَيْنُ بْنُ الْمُثَنَّى، حَدَّثَنَا لَيْثٌ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ: أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيِّبِ، أَنَّهُ سَمِعَ سَعْدَ بْنَ أَبِي وَقَّاصٍ، يَقُولُ: «أَرَادَ عُثْمَانُ بْنُ مَظْعُونٍ أَنْ يَتَبَتَّلَ، فَنَهَاهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَلَوْ أَجَازَ لَهُ ذَلِكَ لَاخْتَصَيْنَا»."
      },
      {
        "id": 10971,
        "hadith_number": "3407",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Wanita dan Godaan Syaitan dalam Perspektif Nabi SAW",
        "perawi_melayu": "Jabir رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) saw a woman, and so he came to his wife, Zainab رضی اللہ عنہا , as she was tanning a leather and had sexual intercourse with her. He then went to his Companions and told them: The woman advances and retires in the shape of a devil, so when one of you sees a woman, he should come to his wife, for that will repel what he feels in his heart.",
        "malay_translation": "Rasulullah SAW melihat seorang wanita, lalu baginda mendatangi isterinya, Zainab رضي الله عنها, ketika beliau sedang menyamak kulit dan melakukan hubungan seksual dengannya. Kemudian baginda menemui para sahabatnya dan bersabda: Wanita itu maju dan mundur seperti bentuk syaitan. Oleh itu, jika salah seorang dari kamu melihat seorang wanita, hendaklah dia segera mendatangi isterinya, kerana hal itu akan mencegah atau menolak apa yang dirasakan dalam hatinya.",
        "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الْأَعْلَى، حَدَّثَنَا هِشَامُ بْنُ أَبِي عَبْدِ اللهِ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَأَى امْرَأَةً، فَأَتَى امْرَأَتَهُ زَيْنَبَ، وَهِيَ تَمْعَسُ مَنِيئَةً لَهَا، فَقَضَى حَاجَتَهُ، ثُمَّ خَرَجَ إِلَى أَصْحَابِهِ، فَقَالَ: «إِنَّ الْمَرْأَةَ تُقْبِلُ فِي صُورَةِ شَيْطَانٍ، وَتُدْبِرُ فِي صُورَةِ شَيْطَانٍ، فَإِذَا أَبْصَرَ أَحَدُكُمُ امْرَأَةً فَلْيَأْتِ أَهْلَهُ، فَإِنَّ ذَلِكَ يَرُدُّ مَا فِي نَفْسِهِ»."
      },
      {
        "id": 10972,
        "hadith_number": "3408",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah SAW Melihat Seorang Wanita dan Perbualan dengan Isteri Baginda",
        "perawi_melayu": "Jabir bin 'Abdullah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saw a woman; and the rest of the hadith was narrated but (with this exception) that he said he came to his wife Zainab رضی اللہ عنہا , who was tanning a (piece of) leather, and he made no mention of: She retires in the shape of satan.",
        "malay_translation": "Rasulullah SAW (صلی الله عليه وسلم) melihat seorang wanita; dan selebihnya hadis ini diriwayatkan tetapi (dengan pengecualian ini) baginda menceritakan bahawa baginda datang kepada isterinya, Zainab رضي الله عنها, yang sedang menyamak kulit, dan baginda tidak menyebut:  Dia menarik diri dalam rupa iblis.",
        "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنَا حَرْبُ بْنُ أَبِي، الْعَالِيَةِ حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى امْرَأَةً ‏.‏ فَذَكَرَ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ فَأَتَى امْرَأَتَهُ زَيْنَبَ وَهْىَ تَمْعَسُ مَنِيئَةً ‏.‏ وَلَمْ يَذْكُرْ تُدْبِرُ فِي صُورَةِ شَيْطَانٍ .‏"
      },
      {
        "id": 10973,
        "hadith_number": "3409",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Mengatasi Kerinduan Hati dengan Istri",
        "perawi_melayu": "Jabir رضی اللہ عنہ mendengar Rasulullah SAW bersabda:",
        "english_text": "When a woman fascinates any one of you and she captivates his heart, he should go to his wife and have an intercourse with her, for it would repel what he feels.",
        "malay_translation": "Apabila seorang wanita memikat hati salah seorang dari kalian, dan dia menawan hatinya, hendaklah dia pergi kepada istrinya dan melakukan hubungan intim dengannya, kerana ia akan menolak perasaan yang dia rasakan.",
        "arabic_text": "وحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ، قَالَ: قَالَ جَابِرٌ: سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِذَا أَحَدُكُمْ أَعْجَبَتْهُ الْمَرْأَةُ، فَوَقَعَتْ فِي قَلْبِهِ، فَلْيَعْمِدْ إِلَى امْرَأَتِهِ فَلْيُوَاقِعْهَا، فَإِنَّ ذَلِكَ يَرُدُّ مَا فِي نَفْسِهِ."
      },
      {
        "id": 10974,
        "hadith_number": "3410",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keizinan Perkahwinan Sementara dan Larangan Perbuatan Mencacatkan Diri",
        "perawi_melayu": "Abdullah bin Mas'ud رضي الله عنه meriwayatkan:",
        "english_text": "We were on an expedition with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and we had no women with us. We said: Should we not have ourselves castrated? He (the Holy Prophet) forbade us to do so He then granted us permission that we should contract temporary marriage for a stipulated period giving her a garment, and 'Abdullah رضی اللہ عنہ then recited this verse: 'Those who believe do not make unlawful the good things which Allah has made lawful for you, and do not transgress. Allah does not like transgressors (al-Qur'an, v. 87).",
        "malay_translation": "Kami berada dalam ekspedisi bersama Rasulullah SAW, dan kami tidak membawa wanita bersama kami. Kami bertanya, \"Bukankah patut kami mencacatkan diri?\" Baginda (Nabi SAW) melarang kami melakukannya. Kemudian Baginda mengizinkan kami untuk melakukan perkahwinan sementara (mut'ah) untuk tempoh tertentu dengan memberikan pakaian kepada wanita tersebut. Kemudian 'Abdullah رضي الله عنه membaca ayat ini: 'Orang-orang yang beriman janganlah mengharamkan perkara-perkara baik yang Allah telah halalkan untuk kamu, dan janganlah melampaui batas. Allah tidak menyukai orang-orang yang melampaui batas' (al-Qur'an, ayat 87).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ الْهَمْدَانِيُّ، حَدَّثَنَا أَبِي، وَوَكِيعٌ، وَابْنُ بِشْرٍ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، قَالَ: سَمِعْتُ عَبْدَ اللهِ، يَقُولُ: كُنَّا نَغْزُو مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، لَيْسَ لَنَا نِسَاءٌ، فَقُلْنَا: أَلَا نَسْتَخْصِي؟ فَنَهَانَا عَنْ ذَلِكَ، ثُمَّ رَخَّصَ لَنَا أَنْ نَنْكِحَ الْمَرْأَةَ بِالثَّوْبِ إِلَى أَجَلٍ ، ثُمَّ قَرَأَ عَبْدُ اللهِ: {يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُحَرِّمُوا طَيِّبَاتِ مَا أَحَلَّ اللهُ لَكُمْ وَلَا تَعْتَدُوا إِنَّ اللهَ لَا يُحِبُّ الْمُعْتَدِينَ."
      },
      {
        "id": 10975,
        "hadith_number": "3411",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Mengenai Bacaan Ayat Al-Quran",
        "perawi_melayu": "Jarir",
        "english_text": "This hadith has been narrated on the authority of Jarir with the same chain of transmitters and he also recited this (above-mentioned verse) to us, but he did not say that 'Abdullah رضی اللہ عنہ recited it.",
        "malay_translation": "Hadis ini telah diriwayatkan daripada Jarir dengan sanad yang sama dan beliau juga membacakan ayat (yang disebut di atas) kepada kami, tetapi beliau tidak menyebut bahawa 'Abdullah رضي الله عنه membacanya.",
        "arabic_text": "وحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، بِهَذَا الْإِسْنَادِ، مِثْلَهُ. وَقَالَ: ثُمَّ قَرَأَ عَلَيْنَا هَذِهِ الْآيَةَ، وَلَمْ يَقُلْ: قَرَأَ عَبْدُ اللهِ."
      },
      {
        "id": 10976,
        "hadith_number": "3412",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ketidakpastian dan Pertimbangan dalam Perang",
        "perawi_melayu": "Hadis ini diriwayatkan oleh Isma'il dengan sanad yang sama (dan perkataannya adalah):",
        "english_text": "We were young, so we said: Allah's Messenger, should we not have ourselves castrated? But he (the narrator) did not say; We were on an expedition.",
        "malay_translation": "Kami masih muda, maka kami berkata: Rasulullah, mengapakah kami tidak melakukan pemotongan zakar kepada diri sendiri? Tetapi baginda (perawi) tidak menyebut; Kami sedang berada dalam ekspedisi.",
        "arabic_text": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ إِسْمَاعِيلَ، بِهَذَا الْإِسْنَادِ، قَالَ: كُنَّا وَنَحْنُ شَبَابٌ، فَقُلْنَا: يَا رَسُولَ اللهِ، أَلَا نَسْتَخْصِي؟ وَلَمْ يَقُلْ: نَغْزُو."
      },
      {
        "id": 10977,
        "hadith_number": "3413",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keizinan Mengamalkan Perkahwinan Sementara",
        "perawi_melayu": "Jabir bin 'Abdullah dan Salama bin al-Akwa' رضي الله عنهما berkata:",
        "english_text": "There came to us the proclaimer of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) has granted you permission to benefit yourselves, i. e. to contract temporary marriage with women.",
        "malay_translation": "Seorang pembawa berita dari Rasulullah SAW datang kepada kami dan berkata: Rasulullah SAW telah memberikan izin kepada kamu untuk mencari kebaikan (bagi diri sendiri), iaitu untuk mendirikan perkahwinan sementara dengan wanita.",
        "arabic_text": "وحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ دِينَارٍ، قَالَ: سَمِعْتُ الْحَسَنَ بْنَ مُحَمَّدٍ، يُحَدِّثُ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، وَسَلَمَةَ بْنِ الْأَكْوَعِ، قَالَا: خَرَجَ عَلَيْنَا مُنَادِي رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَدْ أَذِنَ لَكُمْ أَنْ تَسْتَمْتِعُوا» يَعْنِي مُتْعَةَ النِّسَاءِ."
      },
      {
        "id": 10978,
        "hadith_number": "3414",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkenan Rasulullah SAW Mengenai Perkahwinan Sementara",
        "perawi_melayu": "Salama bin al Akwa' dan Jabir bin Abdullah رضي الله عنهما meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to us and permitted us to contract temporary marriage.",
        "malay_translation": "Pesuruhjaya Allah (ﷺ) datang kepada kami dan membenarkan kami untuk mendirikan perkahwinan sementara.",
        "arabic_text": "وحَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامَ الْعَيْشِيُّ، حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ، حَدَّثَنَا رَوْحٌ يَعْنِي ابْنَ الْقَاسِمِ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ، عَنْ سَلَمَةَ بْنِ الْأَكْوَعِ، وَجَابِرِ بْنِ عَبْدِ اللهِ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَتَانَا فَأَذِنَ لَنَا فِي الْمُتْعَةِ»."
      },
      {
        "id": 10979,
        "hadith_number": "3415",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keizinan Nikah Sementara pada Zaman Rasulullah SAW dan Khulafa Ar-Rasyidin",
        "perawi_melayu": "Ibn Uraij melaporkan: 'Ata' berkata:",
        "english_text": "Jabir bin Abdullah رضی اللہ عنہ datang untuk melakukan 'Umrah, dan kami datang ke rumahnya, dan orang ramai bertanya kepadanya tentang perkara-perkara yang berbeza, dan kemudian mereka menyebut tentang pernikahan sementara, lalu dia berkata: Ya, kami telah memanfaatkan diri kami melalui pernikahan sementara ini semasa hayat Nabi ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) dan pada zaman Abu Bakar dan 'Umar رضی اللہ عنہما.",
        "malay_translation": "Jabir bin Abdullah رضي الله عنه datang untuk mengerjakan umrah, dan kami datang ke rumahnya. Orang ramai bertanya kepadanya tentang berbagai perkara, lalu mereka menyinggung tentang pernikahan sementara. Beliau menjawab, \"Ya, kami telah mengambil manfaat dari pernikahan sementara ini semasa hidup Rasulullah SAW dan pada zaman pemerintahan Abu Bakar dan Umar رضي الله عنهما.\"",
        "arabic_text": "وحَدَّثَنَا الْحَسَنُ الْحُلْوَانِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ: قَالَ عَطَاءٌ: قَدِمَ جَابِرُ بْنُ عَبْدِ اللهِ مُعْتَمِرًا، فَجِئْنَاهُ فِي مَنْزِلِهِ، فَسَأَلَهُ الْقَوْمُ عَنْ أَشْيَاءَ، ثُمَّ ذَكَرُوا الْمُتْعَةَ، فَقَالَ: «نَعَمْ، اسْتَمْتَعْنَا عَلَى عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَأَبِي بَكْرٍ، وَعُمَرَ."
      },
      {
        "id": 10980,
        "hadith_number": "3416",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkahwinan Sementara di Zaman Rasulullah dan Abu Bakar Hingga Dilarang oleh Umar",
        "perawi_melayu": "Jabir bin 'Abdullah رضي الله عنه meriwayatkan:",
        "english_text": "We contracted temporary marriage giving a handful of (tales or flour as a dower during the lifetime of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and durnig the time of Abu Bakr   رضی اللہ عنہ until 'Umar رضی اللہ عنہ forbade it in the case of 'Amr bin Huraith.",
        "malay_translation": "Kami mengadakan perkahwinan sementara dengan hantaran segenggam (tepung atau benda lain) pada zaman Rasulullah SAW dan semasa pemerintahan Abu Bakar رضي الله عنه, hingga Umar رضي الله عنه melarangnya dalam kes 'Amr bin Huraith.",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، قَالَ: سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: «كُنَّا نَسْتَمْتِعُ بِالْقَبْضَةِ مِنَ التَّمْرِ وَالدَّقِيقِ، الْأَيَّامَ عَلَى عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَأَبِي بَكْرٍ، حَتَّى نَهَى عَنْهُ عُمَرُ، فِي شَأْنِ عَمْرِو بْنِ حُرَيْثٍ»."
      },
      {
        "id": 10981,
        "hadith_number": "3417",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perbezaan Pendapat tentang Mut'as dan Larangan Umar رضي الله عنه",
        "perawi_melayu": "Abu Nadra melaporkan:",
        "english_text": "While I was in the company of Jabir bin Abdullah رضی اللہ عنہ , a person came to him and said that Ibn 'Abbas and Ibn Zubair رضی اللہ عنہم differed on the two types of Mut'as (Tamattu' of Hajj 1846 and Tamattu' with women), whereupon Jabir رضی اللہ عنہ said: We used to do these two during the lifetime of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). Umar رضی اللہ عنہ then forbade us to do them, and so we did not revert to them.",
        "malay_translation": "Ketika aku bersama Jabir bin Abdullah رضي الله عنه, seorang datang kepadanya dan berkata bahawa Ibn 'Abbas dan Ibn Zubair رضي الله عنهما berbeza pendapat tentang dua jenis Mut'as (Tamattu' bagi Haji dan Tamattu' dengan wanita). Lalu Jabir رضي الله عنه berkata: Kami biasa melakukannya kedua-duanya semasa hayat Rasulullah صلى الله عليه وسلم. Kemudian Umar رضي الله عنه melarang kami melakukannya, dan kami tidak kembali kepadanya.",
        "arabic_text": "حَدَّثَنَا حَامِدُ بْنُ عُمَرَ الْبَكْرَاوِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ يَعْنِي ابْنَ زِيَادٍ، عَنْ عَاصِمٍ، عَنْ أَبِي نَضْرَةَ، قَالَ: كُنْتُ عِنْدَ جَابِرِ بْنِ عَبْدِ اللهِ، فَأَتَاهُ آتٍ، فَقَالَ: ابْنُ عَبَّاسٍ وَابْنُ الزُّبَيْرِ اخْتَلَفَا فِي الْمُتْعَتَيْنِ، فَقَالَ جَابِرٌ: «فَعَلْنَاهُمَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ثُمَّ نَهَانَا عَنْهُمَا عُمَرُ، فَلَمْ نَعُدْ لَهُمَا."
      },
      {
        "id": 10982,
        "hadith_number": "3418",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keizinan dan Larangan Perkahwinan Sementara",
        "perawi_melayu": "Iyas bin Salama رضي الله عنه meriwayatkan daripada bapanya :",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) gave sanction for contracting temporary marriage for three nights in the year of Autas 1847 and then forbade it.",
        "malay_translation": "Rasulullah SAW membenarkan perkahwinan sementara (mut'ah) selama tiga malam pada tahun Autas 1847, kemudian melarangnya.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا أَبُو عُمَيْسٍ، عَنْ إِيَاسِ بْنِ سَلَمَةَ، عَنْ أَبِيهِ، قَالَ: «رَخَّصَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَامَ أَوْطَاسٍ، فِي الْمُتْعَةِ ثَلَاثًا، ثُمَّ نَهَى عَنْهَا."
      },
      {
        "id": 10983,
        "hadith_number": "3419",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keizinan Perkahwinan Sementara dan Keputusan Rasulullah SAW",
        "perawi_melayu": "Sabra Juhanni رضي الله عنه melaporkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) permitted temporary marriage for us. So I and another person went out and saw a woman of Bana 'Amir, who was like a young long-necked she-camel. We presented ourselves to her (for contracting temporary marriage), whereupon she said: What dower would you give me? I said: My cloak. And my companion also said: My cloak. And the cloak of-my companion was superior to my cloak, but I was younger than he. So when she looked at the cloak of my companion she liked it, and when she cast a glance at me I looked more attractive to her. She then said: Well, you and your cloak are sufficient for me. I remained with her for three nights, and then Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He who has any such woman with whom he had contracted temporary marriage, he should let her off.",
        "malay_translation": "Rasulullah SAW membenarkan perkahwinan sementara bagi kami. Oleh itu, saya dan seorang teman keluar dan menemui seorang wanita dari Bani Amir, yang rupawan seperti unta betina muda berleher panjang. Kami mendekati dia untuk menunaikan perkahwinan sementara, lalu dia bertanya: Apa mas kahwin yang akan kamu berikan? Saya berkata: Jubah saya. Dan teman saya juga berkata: Jubah saya. Jubah teman saya lebih baik daripada jubah saya, namun saya lebih muda darinya. Oleh itu, ketika dia melihat jubah teman saya, dia menyukainya, dan ketika dia memandang saya, saya kelihatan lebih menarik baginya. Dia kemudian berkata: Baiklah, kau dan jubahmu cukup untukku. Saya tinggal bersamanya selama tiga malam, dan kemudian Rasulullah SAW bersabda: Barangsiapa yang memiliki seorang wanita seperti itu yang telah dia lakukan perkahwinan sementara, dia harus melepaskannya.",
        "arabic_text": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنِ الرَّبِيعِ بْنِ سَبْرَةَ الْجُهَنِيِّ، عَنْ أَبِيهِ سَبْرَةَ، أَنَّهُ قَالَ: أَذِنَ لَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالْمُتْعَةِ، فَانْطَلَقْتُ أَنَا وَرَجُلٌ إِلَى امْرَأَةٍ مِنْ بَنِي عَامِرٍ، كَأَنَّهَا بَكْرَةٌ عَيْطَاءُ، فَعَرَضْنَا عَلَيْهَا أَنْفُسَنَا، فَقَالَتْ: مَا تُعْطِي؟ فَقُلْتُ: رِدَائِي، وَقَالَ صَاحِبِي: رِدَائِي، وَكَانَ رِدَاءُ صَاحِبِي أَجْوَدَ مِنْ رِدَائِي، وَكُنْتُ أَشَبَّ مِنْهُ، فَإِذَا نَظَرَتْ إِلَى رِدَاءِ صَاحِبِي أَعْجَبَهَا، وَإِذَا نَظَرَتْ إِلَيَّ أَعْجَبْتُهَا، ثُمَّ قَالَتْ: أَنْتَ وَرِدَاؤُكَ يَكْفِينِي، فَمَكَثْتُ مَعَهَا ثَلَاثًا، ثُمَّ إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ كَانَ عِنْدَهُ شَيْءٌ مِنْ هَذِهِ النِّسَاءِ الَّتِي يَتَمَتَّعُ، فَلْيُخَلِّ سَبِيلَهَا."
      },
      {
        "id": 10984,
        "hadith_number": "3420",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkahwinan Sementara di Mekah setelah Fathul Mekah",
        "perawi_melayu": "Rabi' bin Sabra meriwayatkan:",
        "english_text": "His father went on an expedition with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) during the Victory of Mecca, and we stayed there for fifteen days (i. e. for thirteen full days and a day and a night), and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) permitted us to contract temporary marriage with women. So I and another person of my tribe went out, and I was more handsome than he, whereas he was almost ugly. Each one of us had a cloaks, My cloak was worn out, whereas the cloak of my cousin was quite new. As we reached the lower or the upper side of Mecca, we came across a young woman like a young smart long-necked she-camel. We said: Is it possible that one of us may contract temporary marriage with you? She said: What will you give me as a dower? Each one of us spread his cloak. She began to cast a glance on both the persons. My companion also looked at her when she was casting a glance at her side and he said: This cloak of his is worn out, whereas my cloak is quite new. She, however, said twice or thrice: There is no harm in (accepting) this cloak (the old one). So I contracted temporary marriage with her, and I did not come out (of this) until Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) declared it forbidden.",
        "malay_translation": "Bapanya turut serta dalam ekspedisi bersama Rasulullah SAW semasa Fathul Mekah, dan kami tinggal di sana selama lima belas hari (iaitu selama tiga belas hari penuh dan satu hari satu malam), dan Rasulullah SAW membenarkan kami untuk melakukan perkahwinan sementara dengan wanita. Maka aku dan seorang lagi ahli kaumku keluar, dan aku lebih tampan daripadanya, sedangkan dia hampir hodoh. Setiap kami mempunyai sehelai jubah, jubahku lusuh, sedangkan jubah sepupu aku baru. Sewaktu kami sampai ke bahagian bawah atau atas Mekah, kami menemui seorang wanita muda seperti unta betina muda yang menarik dan lehernya panjang. Kami berkata: Adakah mungkin salah seorang daripada kami boleh berkahwin sementara dengan engkau? Dia bertanya: Apakah yang akan engkau berikan sebagai mas kahwin? Setiap kami menghamparkan jubahnya. Dia mulai memandang kedua-dua orang tersebut. Temanku juga memandangnya ketika dia memandangnya dan berkata: Jubahnya lusuh, sedangkan jubahku baru. Namun dia berkata dua atau tiga kali: Tidak mengapa dengan jubah ini (yang lama). Maka aku berkahwin sementara dengannya, dan aku tidak keluar (daripada keadaan ini) sehingga Rasulullah SAW mengharamkannya.",
        "arabic_text": "حَدَّثَنَا أَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ، حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ مُفَضَّلٍ، حَدَّثَنَا عُمَارَةُ بْنُ غَزِيَّةَ، عَنِ الرَّبِيعِ بْنِ سَبْرَةَ، أَنَّ أَبَاهُ، «غَزَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَتْحَ مَكَّةَ»، قَالَ: فَأَقَمْنَا بِهَا خَمْسَ عَشْرَةَ - ثَلَاثِينَ بَيْنَ لَيْلَةٍ وَيَوْمٍ - فَأَذِنَ لَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي مُتْعَةِ النِّسَاءِ، فَخَرَجْتُ أَنَا وَرَجُلٌ مِنْ قَوْمِي، وَلِي عَلَيْهِ فَضْلٌ فِي الْجَمَالِ، وَهُوَ قَرِيبٌ مِنَ الدَّمَامَةِ، مَعَ كُلِّ وَاحِدٍ مِنَّا بُرْدٌ، فَبُرْدِي خَلَقٌ، وَأَمَّا بُرْدُ ابْنِ عَمِّي فَبُرْدٌ جَدِيدٌ، غَضٌّ، حَتَّى إِذَا كُنَّا بِأَسْفَلِ مَكَّةَ - أَوْ بِأَعْلَاهَا - فَتَلَقَّتْنَا فَتَاةٌ مِثْلُ الْبَكْرَةِ الْعَنَطْنَطَةِ، فَقُلْنَا: هَلْ لَكِ أَنْ يَسْتَمْتِعَ مِنْكِ أَحَدُنَا؟ قَالَتْ: وَمَاذَا تَبْذُلَانِ؟ فَنَشَرَ كُلُّ وَاحِدٍ مِنَّا بُرْدَهُ، فَجَعَلَتْ تَنْظُرُ إِلَى الرَّجُلَيْنِ، وَيَرَاهَا صَاحِبِي تَنْظُرُ إِلَى عِطْفِهَا، فَقَالَ: إِنَّ بُرْدَ هَذَا خَلَقٌ، وَبُرْدِي جَدِيدٌ غَضٌّ، فَتَقُولُ: بُرْدُ هَذَا لَا بَأْسَ بِهِ ثَلَاثَ مِرَارٍ - أَوْ مَرَّتَيْنِ - ثُمَّ اسْتَمْتَعْتُ مِنْهَا، فَلَمْ أَخْرُجْ حَتَّى حَرَّمَهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 10985,
        "hadith_number": "3421",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Mengenai Jubah Lelaki Yang Usang",
        "perawi_melayu": "Rabi' bin S'abra al-jahanni meriwayatkan daripada bapanya:",
        "english_text": "We went with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) to Mecca during the year of Victory and he narrated like this a hadith transmitted by Bishr (the previous one) but with this addition: She said: Can it be possible? And it is also mentioned in it: He said: The cloak of this (man) is old and worn out.",
        "malay_translation": "Kami pergi bersama Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) ke Mekah pada tahun Fathu Mekah dan baginda meriwayatkan hadis seperti yang disampaikan oleh Bishr (sebelumnya) tetapi dengan tambahan: Dia berkata, \"Adakah mungkin?\" Dan juga disebutkan di dalamnya: Baginda bersabda, \"Jubah lelaki ini sudah tua dan koyak.\"",
        "arabic_text": "وحَدَّثَنِي أَحْمَدُ بْنُ سَعِيدِ بْنِ صَخْرٍ الدَّارِمِيُّ، حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عُمَارَةُ بْنُ غَزِيَّةَ، حَدَّثَنِي الرَّبِيعُ بْنُ سَبْرَةَ الْجُهَنِيُّ، عَنْ أَبِيهِ، قَالَ: خَرَجْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَامَ الْفَتْحِ إِلَى مَكَّةَ، فَذَكَرَ بِمِثْلِ حَدِيثِ بِشْرٍ، وَزَادَ قَالَتْ: وَهَلْ يَصْلُحُ ذَاكَ؟ وَفِيهِ: قَالَ: إِنَّ بُرْدَ هَذَا خَلَقٌ مَحٌّ."
      },
      {
        "id": 10986,
        "hadith_number": "3422",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Nikah Mut'ah -  Penghentian sementara oleh Rasulullah SAW",
        "perawi_melayu": "Sabra al-Juhani meriwayatkan dari bapanya:",
        "english_text": "While he was with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) he said: O people, I had permitted you to contract temporary marriage with women, but Allah has forbidden it (now) until the Day of Resurrection. So he who has any (woman with this type of marriage contract) he should let her off, and do not take back anything you have given to them (as dower).",
        "malay_translation": "Ketika baginda Rasulullah SAW berada di antara kami, baginda bersabda: Wahai manusia, sememangnya aku telah membenarkan kamu berkahwin sementara, tetapi Allah telah mengharamkannya (kini) sehingga Hari Kiamat. Oleh itu, sesiapa yang mempunyai perjanjian pernikahan sementara sebegini hendaklah membebaskannya, dan janganlah kamu mengambil kembali apa-apa yang telah kamu berikan kepada mereka (sebagai mas kahwin).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عُمَرَ، حَدَّثَنِي الرَّبِيعُ بْنُ سَبْرَةَ الْجُهَنِيُّ، أَنَّ أَبَاهُ، حَدَّثَهُ، أَنَّهُ كَانَ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «يَا أَيُّهَا النَّاسُ، إِنِّي قَدْ كُنْتُ أَذِنْتُ لَكُمْ فِي الِاسْتِمْتَاعِ مِنَ النِّسَاءِ، وَإِنَّ اللهَ قَدْ حَرَّمَ ذَلِكَ إِلَى يَوْمِ الْقِيَامَةِ، فَمَنْ كَانَ عِنْدَهُ مِنْهُنَّ شَيْءٌ فَلْيُخَلِّ سَبِيلَهُ، وَلَا تَأْخُذُوا مِمَّا آتَيْتُمُوهُنَّ شَيْئًا."
      },
      {
        "id": 10987,
        "hadith_number": "3423",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah SAW Bercerita Hadis di Dekat Kaabah",
        "perawi_melayu": "Hadis ini diriwayatkan daripada 'Abdul-'Aziz bin 'Umar dengan sanad yang sama, dan beliau berkata:",
        "english_text": "I saw Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) standing between the pillar and the gate (of the Ka'ba) and he was relating a hadith as narrated by Ibn Numair.",
        "malay_translation": "Saya melihat Rasulullah SAW berdiri di antara tiang dan pintu Kaabah, dan Baginda sedang menyampaikan sebuah hadis yang diriwayatkan oleh Ibn Numair.",
        "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ عَبْدِ الْعَزِيزِ بْنِ عُمَرَ، بِهَذَا الْإِسْنَادِ، قَالَ: رَأَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَائِمًا بَيْنَ الرُّكْنِ وَالْبَابِ، وَهُوَ يَقُولُ: بِمِثْلِ حَدِيثِ ابْنِ نُمَيْرٍ."
      },
      {
        "id": 10988,
        "hadith_number": "3424",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keizinan Perkahwinan Sementara di Tahun Pembebasan Mekah",
        "perawi_melayu": "Abdul-Malik bin Rabi' bin Sabra al-Juhanni meriwayatkan daripada bapanya yang meriwayatkan daripada bapanya (iaitu datuk Abdul-Malik, Sabura al-Juhanni).",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) permitted us to contract temporary marriage in the Year of Victory, as we entered Mecca, and we did come out of it but he forbade us to do it.",
        "malay_translation": "Pesuruhjaya Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) mengizinkan kami mendirikan perkahwinan sementara pada Tahun Pembebasan ketika kami memasuki Mekah, dan kami keluar daripadanya, tetapi baginda melarang kami melakukannya selepas itu.",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ عَبْدِ الْمَلِكِ بْنِ الرَّبِيعِ بْنِ سَبْرَةَ الْجُهَنِيِّ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ: «أَمَرَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالْمُتْعَةِ عَامَ الْفَتْحِ، حِينَ دَخَلْنَا مَكَّةَ، ثُمَّ لَمْ نَخْرُجْ مِنْهَا حَتَّى نَهَانَا عَنْهَا."
      },
      {
        "id": 10989,
        "hadith_number": "3425",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keizinan Rasulullah SAW untuk Perkahwinan Sementara pada Tahun Pembebasan",
        "perawi_melayu": "Sabra bin Ma'bad رضي الله عنه melaporkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) permitted his Companions to contract temporary marriage with women in the Year of Victory. So I and a friend of mine from Banu Sulaim went out, until we found a young woman of Banu Amir who was like a young she-camel having a long neck. We proposed to her for contracting temporary marriage with us, and presented to her our cloaks (as dower). She began to look and found me more handsome than my friend, but found the cloak of my friend more beautiful than my cloak. She thought in her mind for a while, but then preferred me to my friend. So I remained with her for three (nights), and then Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded us to part with them (such women).",
        "malay_translation": "Rasulullah SAW mengizinkan para sahabatnya untuk melakukan perkahwinan sementara (mut'ah) pada Tahun Pembebasan. Maka aku dan seorang sahabatku dari Bani Sulaim keluar mencari, sehingga kami mendapati seorang wanita muda dari Bani Amir yang cantik jelita seperti unta betina muda yang lehernya panjang. Kami melamarnya untuk perkahwinan sementara dan menghulurkan jubah kami (sebagai mas kahwin). Dia merenungkan, dan mendapati aku lebih tampan daripada sahabatku, tetapi mendapati jubah sahabatku lebih menarik daripada jubahku. Dia merenung seketika, lalu memilihku daripada sahabatku. Maka aku tinggal bersamanya selama tiga malam, dan kemudian Rasulullah SAW memerintahkan kami untuk berpisah dengan wanita-wanita seperti itu.",
        "arabic_text": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ الرَّبِيعِ بْنِ سَبْرَةَ بْنِ مَعْبَدٍ، قَالَ: سَمِعْتُ أَبِي رَبِيعَ بْنَ سَبْرَةَ، يُحَدِّثُ عَنْ أَبِيهِ سَبْرَةَ بْنِ مَعْبَدٍ، «أَنَّ نَبِيَّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَامَ فَتْحِ مَكَّةَ أَمَرَ أَصْحَابَهُ بِالتَّمَتُّعِ مِنَ النِّسَاءِ»، قَالَ: «فَخَرَجْتُ أَنَا وَصَاحِبٌ لِي مِنْ بَنِي سُلَيْمٍ، حَتَّى وَجَدْنَا جَارِيَةً مِنْ بَنِي عَامِرٍ كَأَنَّهَا بَكْرَةٌ عَيْطَاءُ، فَخَطَبْنَاهَا إِلَى نَفْسِهَا وَعَرَضْنَا عَلَيْهَا بُرْدَيْنَا، فَجَعَلَتْ تَنْظُرُ فَتَرَانِي أَجْمَلَ مِنْ صَاحِبِي، وَتَرَى بُرْدَ صَاحِبِي أَحْسَنَ مِنْ بُرْدِي، فَآمَرَتْ نَفْسَهَا سَاعَةً ثُمَّ اخْتَارَتْنِي عَلَى صَاحِبِي، فَكُنَّ مَعَنَا ثَلَاثًا، ثُمَّ أَمَرَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِفِرَاقِهِنَّ."
      },
      {
        "id": 10990,
        "hadith_number": "3426",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Perkahwinan Sementara oleh Rasulullah SAW",
        "perawi_melayu": "Rabi' bin Sabra melaporkan berdasarkan perawi ayahnya:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) prohibited the contracting of temporary marriage.",
        "malay_translation": "Rasulullah SAW telah melarang perjanjian perkahwinan sementara.",
        "arabic_text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَابْنُ نُمَيْرٍ، قَالَا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنِ الرَّبِيعِ بْنِ سَبْرَةَ، عَنْ أَبِيهِ، «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ نِكَاحِ الْمُتْعَةِ."
      },
      {
        "id": 10991,
        "hadith_number": "3427",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Perkahwinan Sementara pada Hari Kemenangan",
        "perawi_melayu": "Rabi' bin Sabra meriwayatkan daripada bapanya:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade on the Day of Victory to contract temporary marriage with women.",
        "malay_translation": "Pesuruhjaya Allah (صلی الله عليه وسلم) telah melarang perkahwinan sementara dengan wanita pada Hari Kemenangan.",
        "arabic_text": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ عُلَيَّةَ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنِ الرَّبِيعِ بْنِ سَبْرَةَ، عَنْ أَبِيهِ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى يَوْمَ الْفَتْحِ عَنْ مُتْعَةِ النِّسَاءِ."
      },
      {
        "id": 10992,
        "hadith_number": "3428",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Perkahwinan Sementara di Zaman Kekuasaan dan Perkahwinan Bapa Rasulullah",
        "perawi_melayu": "Diceritakan daripada Ar-Rabi' bin Sabra رضي الله عنه",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) forbade to contract temporary marriage with women at the time of Victory, and that his father had contracted the marriage for two red cloaks.",
        "malay_translation": "Rasulullah SAW melarang perkahwinan sementara dengan wanita pada masa penaklukan, dan bapanya telah mengahwinkan [seseorang] dengan dua jubah merah.",
        "arabic_text": "وحَدَّثَنِيهِ حَسَنٌ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، عَنْ يَعْقُوبَ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِح، أَخْبَرَنَا ابْنُ شِهَابٍ، عَنِ الرَّبِيعِ بْنِ سَبْرَةَ الْجُهَنِيِّ، عَنْ أَبِيهِ، أَنَّهُ أَخْبَرَهُ؛ «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الْمُتْعَةِ زَمَانَ الْفَتْحِ - مُتْعَةِ النِّسَاءِ - وَأَنَّ أَبَاهُ كَانَ تَمَتَّعَ بِبُرْدَيْنِ أَحْمَرَيْنِ»."
      },
      {
        "id": 10993,
        "hadith_number": "3429",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Penjelasan dan Larangan Perkahwinan Sementara (Mut'ah)",
        "perawi_melayu": "Urwa bin Zubair melaporkan:",
        "english_text": "'Abdullah bin Zubair (رضی اللہ عنہ) stood up (and delivered an address) in Mecca saying: Allah has made blind the hearts of some people as He has deprived them of eyesight that they give religious verdict in favour of temporary marriage, while he was alluding to a person (Ibn 'Abbas رضی اللہ عنہ ). Ibn Abbas رضی اللہ عنہ called him and said: You are an uncouth person, devoid of sense. By my life, Mut'a was practised during the lifetime of the leader of the pious (he meant Allah's Messenger, may peace be upon him), and Ibn Zubair رضی اللہ عنہ said to him: just do it yourselves, and by Allah, if you do that I will stone you with your stones. Ibn Shihab said. Khalid bin Muhajir bin Saifullah informed me: While I was sitting in the company of a person, a person came to him and he asked for a religious verdict about Mut'a and he permitted him to do it. Ibn Abu 'Amrah al-Ansari (رضی اللہ عنہ) said to him: Be gentle. It was permitted in-the early days of Islam, (for one) who was driven to it under the stress of necessity just as (the eating of) carrion and the blood and flesh of swine and then Allah intensified (the commands of) His religion and prohibited it (altogether). Ibn Shihab reported: Rabi' bin Sabra told me that his father (Sabra) said: I contracted temporary marriage with a woman of Banu 'Amir for two cloaks during the lifetime of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌); then he forbade us to do Mut'a. Ibn Shihab said: I heard Rabi' bin Sabra narrating it to Umar bin 'Abdul-'Aziz and I was sitting there.",
        "malay_translation": "'Abdullah bin Zubair (رضي الله عنه) berdiri di Mekah dan menyampaikan ceramah: Allah telah membutakan hati segelintir manusia sehingga mereka memutuskan hukum perkahwinan sementara (mut'ah) sedangkan mereka buta terhadap hakikatnya, dan ini merujuk kepada Ibn 'Abbas (رضي الله عنه). Ibn 'Abbas (رضي الله عنه) menegurnya dan berkata: Engkau orang yang kasar dan tidak berakal! Demi jiwaku, Mut'ah pernah dibolehkan pada masa Rasulullah (صلی الله عليه وسلم). Ibn Zubair (رضي الله عنه) menjawab: Lakukanlah sendiri, dan demi Allah, jika kamu melakukannya, aku akan merajammu dengan batu! Ibn Shihab berkata, Khalid bin Muhajir bin Saifullah memberitahu saya: Ketika saya duduk bersama seseorang, ada orang datang kepadanya dan bertanya tentang hukum mut'ah, dan dia mengizinkannya melakukannya. Ibn Abu 'Amrah al-Ansari (رضي الله عنه) berkata kepadanya: Bersikaplah lembut. Pada awal Islam, ia dibolehkan bagi mereka yang terdesak seperti memakan bangkai, darah, dan daging babi. Kemudian Allah menguatkan syariat-Nya dan mengharamkannya. Ibn Shihab meriwayatkan: Rabi' bin Sabra memberitahuku bahawa bapanya (Sabra) berkata: Aku mengahwini seorang wanita dari Bani 'Amir secara mut'ah dengan dua helai kain di zaman Rasulullah (صلی الله عليه وسلم). Kemudian Baginda (صلی الله عليه وسلم) melarang kami daripada melakukan mut'ah. Ibn Shihab berkata: Aku mendengar Rabi' bin Sabra menceritakannya kepada Umar bin Abdul 'Aziz, dan aku hadir ketika itu.",
        "arabic_text": "وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، قَالَ ابْنُ شِهَابٍ: أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَبْدَ اللهِ بْنَ الزُّبَيْرِ، قَامَ بِمَكَّةَ، فَقَالَ: «إِنَّ نَاسًا أَعْمَى اللهُ قُلُوبَهُمْ، كَمَا أَعْمَى أَبْصَارَهُمْ، يُفْتُونَ بِالْمُتْعَةِ»، يُعَرِّضُ بِرَجُلٍ، فَنَادَاهُ، فَقَالَ: إِنَّكَ لَجِلْفٌ جَافٍ، فَلَعَمْرِي، لَقَدْ كَانَتِ الْمُتْعَةُ تُفْعَلُ عَلَى عَهْدِ إِمَامِ الْمُتَّقِينَ - يُرِيدُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - فَقَالَ لَهُ ابْنُ الزُّبَيْرِ: «فَجَرِّبْ بِنَفْسِكَ، فَوَاللهِ، لَئِنْ فَعَلْتَهَا لَأَرْجُمَنَّكَ بِأَحْجَارِكَ»، قَالَ ابْنُ شِهَابٍ: فَأَخْبَرَنِي خَالِدُ بْنُ الْمُهَاجِرِ بْنِ سَيْفِ اللهِ، أَنَّهُ بَيْنَا هُوَ جَالِسٌ عِنْدَ رَجُلٍ، جَاءَهُ رَجُلٌ فَاسْتَفْتَاهُ فِي الْمُتْعَةِ، فَأَمَرَهُ بِهَا، فَقَالَ لَهُ ابْنُ أَبِي عَمْرَةَ الْأَنْصَارِيُّ: مَهْلًا، قَالَ: مَا هِيَ؟ وَاللهِ، لَقَدْ فُعِلَتْ فِي عَهْدِ إِمَامِ الْمُتَّقِينَ، قَالَ: ابْنُ أَبِي عَمْرَةَ «إِنَّهَا كَانَتْ رُخْصَةً فِي أَوَّلِ الْإِسْلَامِ لِمَنِ اضْطُرَّ إِلَيْهَا، كَالْمَيْتَةِ، وَالدَّمِ، وَلَحْمِ الْخِنْزِيرِ، ثُمَّ أَحْكَمَ اللهُ الدِّينَ وَنَهَى عَنْهَا» قَالَ ابْنُ شِهَابٍ: وَأَخْبَرَنِي رَبِيعُ بْنُ سَبْرَةَ الْجُهَنِيُّ، أَنَّ أَبَاهُ قَالَ: «قَدْ كُنْتُ اسْتَمْتَعْتُ فِي عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ امْرَأَةً مِنْ بَنِي عَامِرٍ بِبُرْدَيْنِ أَحْمَرَيْنِ، ثُمَّ نَهَانَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْمُتْعَةِ»، قَالَ ابْنُ شِهَابٍ: وَسَمِعْتُ رَبِيعَ بْنَ سَبْرَةَ، يُحَدِّثُ ذَلِكَ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، وَأَنَا جَالِسٌ."
      },
      {
        "id": 10994,
        "hadith_number": "3430",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Perkahwinan Sementara",
        "perawi_melayu": "Sabra al-Juhanni meriwayatkan daripada bapanya:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) prohibited the contracting of temporary marriage and said: Behold, it is forbidden from this very day of yours to the Day of Resurrection, and he who has given something (as a dower) should not take it back.",
        "malay_translation": "Rasulullah SAW melarang perkahwinan sementara dan bersabda: Sesungguhnya ia diharamkan dari hari ini hingga Hari Kiamat, dan sesiapa yang memberi sesuatu (sebagai mas kahwin) tidak boleh mengambilnya kembali.",
        "arabic_text": "وحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنِ ابْنِ أَبِي عَبْلَةَ، عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ، قَالَ: حَدَّثَنَا الرَّبِيعُ بْنُ سَبْرَةَ الْجُهَنِيُّ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الْمُتْعَةِ، وَقَالَ: «أَلَا إِنَّهَا حَرَامٌ مِنْ يَوْمِكُمْ هَذَا إِلَى يَوْمِ الْقِيَامَةِ، وَمَنْ كَانَ أَعْطَى شَيْئًا فَلَا يَأْخُذْهُ."
      },
      {
        "id": 10995,
        "hadith_number": "3431",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Perkahwinan Sementara dan Makan Daging Keldai di Khaibar",
        "perawi_melayu": "Ali bin Abi Talib رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) prohibited on the Day of Khaibar the contracting of temporary marriage with women and the eating of the flesh of domestic asses.",
        "malay_translation": "Rasulullah SAW mengharamkan pada Hari Khaibar perkahwinan sementara dengan wanita dan memakan daging keldai peliharaan.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ اللهِ، وَالْحَسَنِ، ابْنَيْ مُحَمَّدِ بْنِ عَلِيٍّ، عَنْ أَبِيهِمَا، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ مُتْعَةِ النِّسَاءِ يَوْمَ خَيْبَرَ، وَعَنْ أَكْلِ لُحُومِ الْحُمُرِ الْإِنْسِيَّةِ."
      },
      {
        "id": 10996,
        "hadith_number": "3432",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Mut'ah Menurut Rasulullah SAW",
        "perawi_melayu": "Malik meriwayatkan hadis ini dengan sanad yang sama:",
        "english_text": "'Ali bin Abi Talib berkata kepada seseorang: Kamu sesat; Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) melarang kita (dari melakukan Mut'ah), sebagaimana yang dinyatakan dalam hadis yang diriwayatkan daripada Yahya bin Malik.",
        "malay_translation": "'Ali bin Abi Talib berkata kepada seseorang, \"Engkau sesat. Rasulullah SAW telah melarang kita daripada melakukan Mut'ah, sebagaimana dinyatakan dalam hadis yang diriwayatkan daripada Yahya bin Malik.\"",
        "arabic_text": "وَحَدَّثَنَاهُ عَبْدُ اللهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ الضُّبَعِيُّ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ مَالِكٍ، بِهَذَا الْإِسْنَادِ، وَقَالَ: سَمِعَ عَلِيَّ بْنَ أَبِي طَالِبٍ، يَقُولُ لِفُلَانٍ: إِنَّكَ رَجُلٌ تَائِهٌ نَهَانَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ يَحْيَى بْنِ يَحْيَى، عَنْ مَالک."
      },
      {
        "id": 10997,
        "hadith_number": "3433",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Nikah Sementara dan Makan Daging Keledai oleh Rasulullah SAW di Khaibar",
        "perawi_melayu": "Muhammad bin 'Ali meriwayatkan daripada bapanya, 'Ali رضي الله عنه",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on the Day of Khaibar prohibited for ever the contracting of temporary marriage and eating of the flesh of the domestic asses.",
        "malay_translation": "Rasulullah SAW pada Hari Khaibar telah mengharamkan selama-lamanya perjanjian perkahwinan sementara dan memakan daging keldai peliharaan.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ نُمَيْرٍ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، قَالَ زُهَيْرٌ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنِ الْحَسَنِ، وَعَبْدِ اللهِ، ابْنَيْ مُحَمَّدِ بْنِ عَلِيٍّ، عَنْ أَبِيهِمَا، عَنْ عَلِيٍّ، «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ نِكَاحِ الْمُتْعَةِ يَوْمَ خَيْبَرَ، وَعَنْ لُحُومِ الْحُمُرِ الْأَهْلِيَّةِ."
      },
      {
        "id": 10998,
        "hadith_number": "3434",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Perkahwinan Sementara dan Makan Daging Keldai di Khaibar",
        "perawi_melayu": "Ibn Abbas (رضي الله عنه):",
        "english_text": "Ibn Abbas ( رضی اللہ عنہ) gave some relaxation in connection with the contracting of temporary marriage, whereupon he said: Don't be hasty (in your religious verdict), Ibn 'Abbas رضی اللہ عنہ , for Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on the Day of Khaibar prohibited that forever-along with the eating of flesh of domestic asses.",
        "malay_translation": "Ibn Abbas (رضي الله عنه) memberikan sedikit kelonggaran berkaitan perkahwinan sementara, lalu beliau berkata: Jangan tergesa-gesa (dalam keputusan agama kamu), Ibn 'Abbas رضي الله عنه, kerana Rasulullah (صلي الله عليه وسلم) pada Hari Khaibar mengharamkan perkara itu selama-lamanya, bersama-sama dengan memakan daging keldai peliharaan.",
        "arabic_text": "وحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللهِ، عَنِ ابْنِ شِهَابٍ، عَنِ الْحَسَنِ، وَعَبْدِ اللهِ، ابْنَيْ مُحَمَّدِ بْنِ عَلِيٍّ، عَنْ أَبِيهِمَا، عَنْ عَلِيٍّ، أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ يُلَيِّنُ فِي مُتْعَةِ النِّسَاءِ، فَقَالَ: «مَهْلًا يَا ابْنَ عَبَّاسٍ، فَإِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهَا يَوْمَ خَيْبَرَ، وَعَنْ لُحُومِ الْحُمُرِ الْإِنْسِيَّةِ»."
      },
      {
        "id": 10999,
        "hadith_number": "3435",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Perkahwinan Sementara dan Makan Daging Keledai",
        "perawi_melayu": "Ali (رضي الله عنه) berkata kepada Ibn 'Abbas (رضي الله عنه):",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on the Day of Khaibar forbade forever the contracting of temporary marriage and the eating of the flesh of domestic asses.",
        "malay_translation": "Nabi SAW pada hari Khaibar melarang selama-lamanya perkahwinan sementara dan memakan daging keldai peliharaan.",
        "arabic_text": "وحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنِ الْحَسَنِ، وَعَبْدِ اللهِ، ابْنَيْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ، عَنْ أَبِيهِمَا، أَنَّهُ سَمِعَ عَلِيَّ بْنَ أَبِي طَالِبٍ يَقُولُ لِابْنِ عَبَّاسٍ: «نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ مُتْعَةِ النِّسَاءِ يَوْمَ خَيْبَرَ، وَعَنْ أَكْلِ لُحُومِ الْحُمُرِ الْإِنْسِيَّةِ."
      },
      {
        "id": 11000,
        "hadith_number": "3436",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Mengahwini Wanita dengan Saudara Perempuan Bapa atau Ibu",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger (ﷺ) having said this: One should not combine a woman and her father's sister, nor a woman and her mother's sister in marriage.",
        "malay_translation": "Rasulullah SAW bersabda: Tidak boleh menggabungkan perkahwinan seorang wanita dengan saudara perempuan bapanya, atau saudara perempuan ibunya.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، حَدَّثَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يُجْمَعُ بَيْنَ الْمَرْأَةِ وَعَمَّتِهَا، وَلَا بَيْنَ الْمَرْأَةِ وَخَالَتِهَا."
      },
      {
        "id": 11001,
        "hadith_number": "3437",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Menggabungkan Empat Wanita dalam Perkahwinan",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade combining of four women in marriage: a woman with her father's sister, and a woman with her mother's sister.",
        "malay_translation": "Rasulullah (صلی الله عليه وسلم) melarang perkahwinan yang menggabungkan empat wanita sekaligus: seorang wanita dengan kakak bapanya, dan seorang wanita dengan kakak ibunya.",
        "arabic_text": ") وحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، أَخْبَرَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عِرَاكِ بْنِ مَالِكٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ أَرْبَعِ نِسْوَةٍ، أَنْ يُجْمَعَ بَيْنَهُنَّ: الْمَرْأَةِ وَعَمَّتِهَا، وَالْمَرْأَةِ وَخَالَتِهَا."
      },
      {
        "id": 11002,
        "hadith_number": "3438",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Pernikahan Saudara Ayah dengan Anak Perempuan Saudara Lelaki, dan Anak Perempuan Saudara Perempuan dengan Bibi",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say: Father's sister should not be combined with her brother's daughter, nor the daughter of a sister with her mother's sister.",
        "malay_translation": "Aku mendengar Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Saudara perempuan ayah tidak boleh dinikahi dengan anak perempuan saudaranya lelaki, dan anak perempuan saudara perempuan tidak boleh dinikahi dengan bibinya.",
        "arabic_text": "وحَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْعَزِيزِ، قَالَ ابْنُ مَسْلَمَةَ: - مَدَنِيٌّ مِنَ الْأَنْصَارِ مِنْ وَلَدِ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ - عَنِ ابْنِ شِهَابٍ، عَنْ قَبِيصَةَ بْنِ ذُؤَيْبٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا تُنْكَحُ الْعَمَّةُ عَلَى بِنْتِ الْأَخِ، وَلَا ابْنَةُ الْأُخْتِ عَلَى الْخَالَةِ."
      },
      {
        "id": 11003,
        "hadith_number": "3439",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Perkahwinan dengan Saudara Perempuan Bapa dan Ibu",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade a person to combine in marriage a woman and her father's sister, and a woman and her mother's sister. Ibn Shihab said: So we regarded the paternal aunt of her (wife's) father and the maternal aunt of her (wife's) father at the same level.",
        "malay_translation": "Utusan Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) melarang seseorang daripada mengahwinkan seorang wanita dengan kakak bapanya, dan juga mengahwinkan seorang wanita dengan kakak ibunya. Ibn Shihab berkata: Oleh itu, kami menganggap makcik bapa isterinya dan makcik ibu isterinya berada pada tahap yang sama.",
        "arabic_text": "وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي قَبِيصَةُ بْنُ ذُؤَيْبٍ الْكَعْبِيُّ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: «نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يَجْمَعَ الرَّجُلُ بَيْنَ الْمَرْأَةِ وَعَمَّتِهَا، وَبَيْنَ الْمَرْأَةِ وَخَالَتِهَا»، قَالَ ابْنُ شِهَابٍ: «فَنُرَى خَالَةَ أَبِيهَا، وَعَمَّةَ أَبِيهَا بِتِلْكَ الْمَنْزِلَةِ»."
      },
      {
        "id": 11004,
        "hadith_number": "3440",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Perkahwinan dengan Saudara Perempuan Bapa dan Ibu",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: One should not combine in marriage a woman with her father's sister, or her mother's sister.",
        "malay_translation": "Rasulullah SAW bersabda: Janganlah seseorang mengahwinkan seorang perempuan dengan saudara perempuan bapanya, atau saudara perempuan ibunya.",
        "arabic_text": "وحَدَّثَنِي أَبُو مَعْنٍ الرَّقَاشِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، أَنَّهُ كَتَبَ إِلَيْهِ عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تُنْكَحُ الْمَرْأَةُ عَلَى عَمَّتِهَا، وَلَا عَلَى خَالَتِهَا."
      },
      {
        "id": 11005,
        "hadith_number": "3441",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis yang serupa dengan Hadis nombor 3440",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "Abu Huraira (رضي الله عنه) said: The Messenger of Allah said...\" a similar hadith (as no. 3440).",
        "malay_translation": "Abu Hurairah رضي الله عنه berkata: Rasulullah SAW bersabda... \" (Hadis yang serupa dengan hadis nombor 3440).",
        "arabic_text": "وحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُوسَى، عَنْ شَيْبَانَ، عَنْ يَحْيَى، حَدَّثَنِي أَبُو سَلَمَةَ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: بِمِثْلِهِ."
      },
      {
        "id": 11006,
        "hadith_number": "3442",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Mengajukan Permintaan Perkahwinan atau Tawaran Harga yang Sama",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: A man must not make proposal of marriage to a woman when his brother has done so already. And he must not offer a price for a thing for which his brother had already offered a price; and a woman must not be combined in marriage with her father's sister, nor with her mother's sister, and a woman must not ask to have her sister divorced in order to deprive her of what belongs to her, but she must marry, because she will have what Allah has decreed for her.",
        "malay_translation": "Rasulullah SAW bersabda: Seorang lelaki tidak boleh melamar seorang wanita jika saudaranya telah melamarnya terlebih dahulu. Dia juga tidak boleh menawarkan harga sesuatu yang telah ditawarkan saudaranya; dan seorang wanita tidak boleh berkahwin dengan kakak bapanya, atau kakak ibunya. Seorang wanita juga tidak boleh meminta cerai saudarinya untuk merampas haknya, sebaliknya dia mesti berkahwin kerana dia akan menerima apa yang telah ditetapkan oleh Allah untuknya.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَخْطُبُ الرَّجُلُ عَلَى خِطْبَةِ أَخِيهِ، وَلَا يَسُومُ عَلَى سَوْمِ أَخِيهِ، وَلَا تُنْكَحُ الْمَرْأَةُ عَلَى عَمَّتِهَا وَلَا عَلَى خَالَتِهَا، وَلَا تَسْأَلُ الْمَرْأَةُ طَلَاقَ أُخْتِهَا لِتَكْتَفِئَ صَحْفَتَهَا وَلْتَنْكِحْ، فَإِنَّمَا لَهَا مَا كَتَبَ اللهُ لَهَا."
      },
      {
        "id": 11007,
        "hadith_number": "3443",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Mengahwini Saudara Perempuan Bapa dan Ibu, serta Larangan Perempuan Memohon Cerai untuk Menyakiti Saudara Perempuannya",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade the combining of a woman in marriage with her father's sister, or with her mother's sister, or that a woman should ask for divorce for her sister in order to deprive her of what belongs to her. Allah, the Exalted'and Majestic, is her Sustainer too.",
        "malay_translation": "Rasulullah SAW melarang perkahwinan seorang wanita dengan saudara perempuan bapanya atau saudara perempuan ibunya, atau seorang wanita memohon cerai untuk saudara perempuannya dengan tujuan merampas haknya. Allah Yang Maha Tinggi dan Maha Mulia juga adalah Pemberi rezekinya.",
        "arabic_text": "وحَدَّثَنِي مُحْرِزُ بْنُ عَوْنِ بْنِ أَبِي عَوْنٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: «نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ تُنْكَحَ الْمَرْأَةُ عَلَى عَمَّتِهَا أَوْ خَالَتِهَا، أَوْ أَنْ تَسْأَلَ الْمَرْأَةُ طَلَاقَ أُخْتِهَا لِتَكْتَفِئَ مَا فِي صَحْفَتِهَا، فَإِنَّ اللهَ عَزَّ وَجَلَّ رَازِقُهَا."
      },
      {
        "id": 11008,
        "hadith_number": "3444",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Pernikahan Wanita dengan Kakak Ibunya Bapa dan Kakak Ibunya Ibu",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade to combine a woman and her father's sister, and a woman and her mother's sister.",
        "malay_translation": "Nabi saw. melarang perkahwinan antara seorang wanita dengan kakak perempuan bapanya, dan seorang wanita dengan kakak perempuan ibunya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، وَأَبُو بَكْرِ بْنُ نَافِعٍ، وَاللَّفْظُ لِابْنِ الْمُثَنَّى، وَابْنِ نَافِعٍ، قَالُوا: أَخْبَرَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: «نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يُجْمَعَ بَيْنَ الْمَرْأَةِ وَعَمَّتِهَا، وَبَيْنَ الْمَرْأَةِ وَخَالَتِهَا»."
      },
      {
        "id": 11009,
        "hadith_number": "3445",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis yang Sama dengan Hadis yang Tertera dalam Nas",
        "perawi_melayu": "Amr bin Dinar",
        "english_text": "A hadith like this has been transmitted on the authority of Amr bin Dinar.",
        "malay_translation": "Sebuah hadis seperti ini telah disampaikan atas dasar kepercayaan kepada Amr bin Dinar.",
        "arabic_text": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا وَرْقَاءُ عَنْ عَمْرِو بْنِ دِينَارٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ."
      },
      {
        "id": 11010,
        "hadith_number": "3446",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Muhrim Mengahwini atau Mengahwinkan Orang Lain",
        "perawi_melayu": "Nubaih bin Wahb melaporkan:",
        "english_text": "'Umar bin Ubaidullah bercadang untuk menikahkan Talha bin 'Umar dengan anak perempuan Shaiba bin Jubair; maka ia menghantar utusan kepada Aban bin Uthman untuk menghadiri majlis perkahwinan itu, dan pada masa itu Aban adalah Amir Haji. Aban berkata: Aku mendengar 'Uthman bin 'Affan رضی اللہ عنہ berkata bahawa Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) telah bersabda: Seorang Muhrim tidak boleh mengahwini dirinya sendiri, atau mengahwinkan orang lain, atau melamar perkahwinan.",
        "malay_translation": "'Umar bin Ubaidullah ingin menikahkan Talhah bin 'Umar dengan anak perempuan Shaibah bin Jubair. Lalu, dia menghantar utusan kepada Aban bin Uthman untuk menghadiri majlis perkahwinan itu, ketika Aban memegang jawatan Amir Haji. Aban berkata, \"Saya mendengar Uthman bin 'Affan رضي الله عنه berkata bahawa Rasulullah SAW telah bersabda: Seorang yang dalam ihram tidak boleh mengahwini dirinya sendiri, atau mengahwinkan orang lain, atau melamar perkahwinan.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنْ نُبَيْهِ بْنِ وَهْبٍ، أَنَّ عُمَرَ بْنَ عُبَيْدِ اللهِ، أَرَادَ أَنْ يُزَوِّجَ طَلْحَةَ بْنَ عُمَرَ بِنْتَ شَيْبَةَ بْنِ جُبَيْرٍ، فَأَرْسَلَ إِلَى أَبَانَ بْنِ عُثْمَانَ يَحْضُرُ ذَلِكَ وَهُوَ أَمِيرُ الْحَجِّ، فَقَالَ أَبَانُ: سَمِعْتُ عُثْمَانَ بْنَ عَفَّانَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَنْكِحُ الْمُحْرِمُ، وَلَا يُنْكَحُ، وَلَا يَخْطُبُ."
      },
      {
        "id": 11011,
        "hadith_number": "3447",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkahwinan Seorang Muhrim Semasa Haji",
        "perawi_melayu": "Nubaih bin Wahb melaporkan:",
        "english_text": "Umar bin Ubaidullah bin Ma'mar menghantar saya kepada Aban bin Uthman kerana beliau ingin melamar anak lelakinya dengan anak perempuan Shaiba bin Uthman. Pada waktu itu (Aban bin Uthman) sedang berada dalam musim Haji. Beliau berkata: Saya menganggapnya seorang lelaki padang pasir (kerana ia perkara biasa) bahawa seorang Muhrim tidak boleh berkahwin, dan tidak dibenarkan berkahwin dengan sesiapapun. Uthman (bin Affan رضی اللہ عنہ) yang melaporkan kepada kita daripada Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
        "malay_translation": "Umar bin Ubaidullah bin Ma'mar mengutuskan saya kepada Aban bin Uthman kerana beliau ingin melamar anak lelakinya dengan anak perempuan Shaiba bin Uthman. Pada masa itu, (Aban bin Uthman) sedang berada dalam musim haji. Beliau berkata: Aku menganggapnya seorang lelaki padang pasir (kerana ia perkara biasa) bahawa seorang Muhrim tidak boleh berkahwin dan tidak dibenarkan berkahwin dengan sesiapa pun. Uthman (bin Affan رضي الله عنه) melaporkan kepada kita daripada Rasulullah SAW.",
        "arabic_text": "وحَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، حَدَّثَنِي نُبَيْهُ بْنُ وَهْبٍ، قَالَ: بَعَثَنِي عُمَرُ بْنُ عُبَيْدِ اللهِ بْنِ مَعْمَرٍ، وَكَانَ يَخْطُبُ بِنْتَ شَيْبَةَ بْنِ عُثْمَانَ عَلَى ابْنِهِ، فَأَرْسَلَنِي إِلَى أَبَانَ بْنِ عُثْمَانَ وَهُوَ عَلَى الْمَوْسِمِ، فَقَالَ: أَلَا أُرَاهُ أَعْرَابِيًّا، «إِنَّ الْمُحْرِمَ لَا يَنْكِحُ، وَلَا يُنْكَحُ»، أَخْبَرَنَا بِذَلِكَ عُثْمَانُ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 11012,
        "hadith_number": "3448",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Perkahwinan bagi Orang dalam Ihram",
        "perawi_melayu": "Uthman bin 'Affan رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had said: A Muhrim should neither marry himself, nor should he be got married to anyone, nor should he make the proposal of marriage.",
        "malay_translation": "Rasulullah SAW bersabda: Orang yang sedang berihram tidak boleh mengahwini dirinya sendiri, tidak boleh dikahwinkan dengan orang lain, dan tidak boleh melamar sesiapa pun.",
        "arabic_text": "وَحَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، حَدَّثَنَا عَبْدُ الْأَعْلَى، ح وحَدَّثَنِي أَبُو الْخَطَّابِ زِيَادُ بْنُ يَحْيَى، حَدَّثَنَا مُحَمَّدُ بْنُ سَوَاءٍ، قَالَا جَمِيعًا: حَدَّثَنَا سَعِيدٌ، عَنْ مَطَرٍ، وَيَعْلَى بْنِ حَكِيمٍ، عَنْ نَافِعٍ، عَنْ نُبَيْهِ بْنِ وَهْبٍ، عَنْ أَبَانَ بْنِ عُثْمَانَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «لَا يَنْكِحُ الْمُحْرِمُ، وَلَا يُنْكَحُ، وَلَا يَخْطُبُ."
      },
      {
        "id": 11013,
        "hadith_number": "3449",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Perkahwinan Bagi Orang Ihram",
        "perawi_melayu": "Uthman bin 'Affan رضي الله عنه meriwayatkan:",
        "english_text": "It directly from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) that he said: A Muhrim should neither marry (in that state) nor make the proposal of marriage.",
        "malay_translation": "Daripada Rasulullah SAW, baginda bersabda: Seorang yang sedang ihram tidak boleh berkahwin atau melamar perkahwinan dalam keadaan itu.",
        "arabic_text": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، قَالَ زُهَيْرٌ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَيُّوبَ بْنِ مُوسَى، عَنْ نُبَيْهِ بْنِ وَهْبٍ، عَنْ أَبَانَ بْنِ عُثْمَانَ، عَنْ عُثْمَانَ، يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «الْمُحْرِمُ لَا يَنْكِحُ، وَلَا يَخْطُبُ."
      },
      {
        "id": 11014,
        "hadith_number": "3450",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Perkahwinan Bagi Orang Ihram",
        "perawi_melayu": "Nabaih bin Wahb melaporkan:",
        "english_text": "Umar bin 'Ubaidullah bin Ma'mar berhasrat untuk menikahkan anaknya, Talha, dengan anak perempuan Shaiba bin Jubair semasa mengerjakan haji. Pada masa itu, Aban bin Uthman merupakan Amir Haji. Maka Umar bin Ubaidullah menghantar utusan kepada Aban sambil berkata: Saya berhasrat untuk menikahkan Talha bin Umar dan saya amat ingin agar tuan hadir di majlis perkahwinan itu. Aban berkata kepadanya: Saya mendapati tuan seorang yang bodoh dari Iraq. Saya mendengar Uthman bin 'Affan رضي الله عنه berkata bahawa Rasulullah صلى الله عليه وسلم bersabda: Orang yang berihram tidak boleh berkahwin.",
        "malay_translation": "Umar bin 'Ubaidullah bin Ma'mar berhasrat untuk menikahkan anaknya, Talha, dengan anak perempuan Shaiba bin Jubair semasa mengerjakan haji. Pada masa itu, Aban bin Uthman merupakan Amir Haji. Maka Umar bin Ubaidullah menghantar utusan kepada Aban sambil berkata: Saya berhasrat untuk menikahkan Talha bin Umar dan saya amat ingin agar tuan hadir di majlis perkahwinan itu. Aban berkata kepadanya: Saya mendapati tuan seorang yang bodoh dari Iraq. Saya mendengar Uthman bin 'Affan رضي الله عنه berkata bahawa Rasulullah صلى الله عليه وسلم bersabda: Orang yang berihram tidak boleh berkahwin.",
        "arabic_text": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي خَالِدُ بْنُ يَزِيدَ، حَدَّثَنِي سَعِيدُ بْنُ أَبِي هِلَالٍ، عَنْ نُبَيْهِ بْنِ وَهْبٍ، أَنَّ عُمَرَ بْنَ عُبَيْدِ اللهِ بْنِ مَعْمَرٍ أَرَادَ أَنْ يُنْكِحَ ابْنَهُ طَلْحَةَ بِنْتَ شَيْبَةَ بْنِ جُبَيْرٍ فِي الْحَجِّ، وَأَبَانُ بْنُ عُثْمَانَ يَوْمَئِذٍ أَمِيرُ الْحَاجِّ، فَأَرْسَلَ إِلَى أَبَانٍ: إِنِّي قَدْ أَرَدْتُ أَنْ أُنْكِحَ طَلْحَةَ بْنَ عُمَرَ، فَأُحِبُّ أَنْ تَحْضُرَ ذَلِكَ، فَقَالَ لَهُ أَبَانُ: أَلَا أُرَاكَ عِرَاقِيًّا جَافِيًا، إِنِّي سَمِعْتُ عُثْمَانَ بْنَ عَفَّانَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَنْكِحُ الْمُحْرِمُ."
      },
      {
        "id": 11015,
        "hadith_number": "3451",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkahwinan Rasulullah SAW dengan Maimunah r.a. dalam Keadaan Ihram",
        "perawi_melayu": "Ibn Abbas (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) married Maimuna رضی اللہ عنہا in the state of Ihram. Ibn Numair made this addition: I narrated it to Zuhri and he said: Yazid bin al-Asamm (Allah be pleased with him) told me that he (the Holy Prophet ﷺ) married her when he was not a muhrim.",
        "malay_translation": "Rasulullah SAW (ﷺ) telah mengahwini Maimunah رضي الله عنها dalam keadaan ihram. Ibn Numair menambah, \"Aku meriwayatkannya kepada Zuhri, dan dia berkata: Yazid bin al-Asamm (رضي الله عنه) memberitahuku bahawa baginda (Nabi SAW) mengahwininya ketika baginda bukanlah dalam keadaan ihram.\"",
        "arabic_text": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ نُمَيْرٍ، وَإِسْحَاقُ الْحَنْظَلِيُّ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، قَالَ ابْنُ نُمَيْرٍ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ أَبِي الشَّعْثَاءِ، أَنَّ ابْنَ عَبَّاسٍ، أَخْبَرَهُ «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ تَزَوَّجَ مَيْمُونَةَ وَهُوَ مُحْرِمٌ»، زَادَ ابْنُ نُمَيْرٍ، فَحَدَّثْتُ بِهِ الزُّهْرِيَّ، فَقَالَ: أَخْبَرَنِي يَزِيدُ بْنُ الْأَصَمِّ، أَنَّهُ نَكَحَهَا وَهُوَ حَلَالٌ."
      },
      {
        "id": 11016,
        "hadith_number": "3452",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkahwinan Rasulullah SAW dengan Maimunah ketika dalam Ihram",
        "perawi_melayu": "Ibn 'Abbas (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) married Maimuna while he was a Muhrim.",
        "malay_translation": "Rasulullah SAW telah mengahwini Maimunah ketika baginda dalam keadaan ihram.",
        "arabic_text": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا دَاوُدُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرِ بْنِ زَيْدٍ أَبِي الشَّعْثَاءِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ قَالَ: «تَزَوَّجَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَيْمُونَةَ وَهُوَ مُحْرِمٌ."
      },
      {
        "id": 11017,
        "hadith_number": "3453",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkahwinan Nabi SAW dengan Maimunah tanpa Ihram",
        "perawi_melayu": "Yazid bin al-Asamm melaporkan:",
        "english_text": "Maimuna anak perempuan al-Harith رضی اللہ عنہا meriwayatkan kepada saya bahawa Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) telah mengahwininya dan Baginda tidak dalam keadaan ihram. Dan beliau (Maimuna) adalah kakak kepada ibu saya dan juga saudara perempuan kepada Ibn 'Abbas (رضی اللہ عنہ).",
        "malay_translation": "Maimunah binti al-Harith رضي الله عنها meriwayatkan kepada saya bahawa Rasulullah SAW telah mengahwininya dalam keadaan tidak berihram. Dan beliau (Maimunah) adalah saudara perempuan ibu saya dan saudara perempuan Ibn 'Abbas رضي الله عنه.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، حَدَّثَنَا أَبُو فَزَارَةَ، عَنْ يَزِيدَ بْنِ الْأَصَمِّ، حَدَّثَتْنِي مَيْمُونَةُ بِنْتُ الْحَارِثِ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ تَزَوَّجَهَا وَهُوَ حَلَالٌ»، قَالَ: «وَكَانَتْ خَالَتِي، وَخَالَةَ ابْنِ عَبَّاسٍ."
      },
      {
        "id": 11018,
        "hadith_number": "3454",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Bersaing dalam Perjanjian dan Menawarkan Perkahwinan atas Cadangan Orang Lain",
        "perawi_melayu": "Ibn Umar (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as having said this: None amongst you should outbid another in a transaction, nor should he make proposals of marriage upon the proposal made by someone else.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Janganlah seseorang di antara kamu bersaing dalam tawar-menawar jual beli dengan orang lain, dan janganlah ia mencadangkan perkahwinan atas cadangan perkahwinan orang lain.",
        "arabic_text": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وحَدَّثَنَا ابْنُ رُمْح، أَخْبَرَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «لَا يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ، وَلَا يَخْطُبْ بَعْضُكُمْ عَلَى خِطْبَةِ بَعْضٍ."
      },
      {
        "id": 11019,
        "hadith_number": "3455",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Memulakan Perniagaan atau Perkahwinan Apabila Saudara Sedang Berurusniaga atau Bertunang",
        "perawi_melayu": "Ibn Umar (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as having said this: A person should not enter into a transaction when his brother (had already entered into but not finalized), and he should not make proposal of marriage upon the proposal already made by his brother, until he permits it.",
        "malay_translation": "Rasulullah SAW bersabda: Seorang tidak sepatutnya memulakan urus niaga apabila saudaranya sedang berurus niaga (tetapi belum selesai), dan dia juga tidak patut melamar wanita yang telah dilamar oleh saudaranya, sehingga saudara itu mengizinkannya.",
        "arabic_text": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، جَمِيعًا عَنْ يَحْيَى الْقَطَّانِ، قَالَ زُهَيْرٌ: حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللهِ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَبِعِ الرَّجُلُ عَلَى بَيْعِ أَخِيهِ، وَلَا يَخْطُبْ عَلَى خِطْبَةِ أَخِيهِ، إِلَّا أَنْ يَأْذَنَ لَهُ."
      },
      {
        "id": 11020,
        "hadith_number": "3456",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis yang Serupa dengan Hadis Ke-3455",
        "perawi_melayu": "Dikisahkan oleh Ibnu Umar:",
        "english_text": "It was narrated from Ubaidullah with this chain (a hadith similar to no. 3455).",
        "malay_translation": "Dikisahkan daripada Ubaidullah dengan sanad ini (satu hadis yang serupa dengan hadis nombor 3455).",
        "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ عُبَيْدِ اللهِ، بِهَذَا الْإِسْنَادِ."
      },
      {
        "id": 11021,
        "hadith_number": "3457",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Sama seperti Hadis Nombor 3455",
        "perawi_melayu": "Nafī",
        "english_text": "It was narrated from Nafi with this chain (a hadith similar to no. 3455).",
        "malay_translation": "Dikisahkan daripada Nafī dengan sanad ini (satu hadis yang serupa dengan hadis nombor 3455).",
        "arabic_text": "وحَدَّثَنِيهِ أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، بِهَذَا الْإِسْنَادِ."
      },
      {
        "id": 11022,
        "hadith_number": "3458",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Bersaing dan Mengganggu dalam Perdagangan dan Perkahwinan",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as having forbidden a dweller of the town selling the merchandise of a villager or outbidding in a sale (in order that another might fall into a snare), or a person making the proposal of marriage when his brother has already made such a proposal, or entering into a transaction when his brother has already entered; and a woman asking the divorce of her sister in order to deprive her of what belongs to her. 'Amr made this addition: The person should not purchase in opposition to his brother.",
        "malay_translation": "Rasulullah SAW telah melarang penduduk bandar menjual barang milik penduduk kampung atau menawar lebih tinggi dalam jual beli (untuk menjerat orang lain), atau seseorang mencadangkan perkahwinan sedangkan saudaranya telah terlebih dahulu mencadangkannya, atau memasuki perjanjian sementara saudaranya telah terlebih dahulu memasuki perjanjian itu; dan seorang wanita meminta perceraian saudaranya untuk merampas haknya.  'Amr menambah, \"Seseorang tidak sepatutnya membeli sesuatu secara berlawanan dengan saudaranya.\"",
        "arabic_text": "وحَدَّثَنِي عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، وَابْنُ أَبِي عُمَرَ، قَالَ زُهَيْرٌ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يَبِيعَ حَاضِرٌ لِبَادٍ، أَوْ يَتَنَاجَشُوا، أَوْ يَخْطُبَ الرَّجُلُ عَلَى خِطْبَةِ أَخِيهِ، أَوْ يَبِيعَ عَلَى بَيْعِ أَخِيهِ، وَلَا تَسْأَلِ الْمَرْأَةُ طَلَاقَ أُخْتِهَا لِتَكْتَفِئَ مَا فِي إِنَائِهَا، أَوْ مَا فِي صَحْفَتِهَا»، زَادَ عَمْرٌو فِي رِوَايَتِهِ: «وَلَا يَسُمِ الرَّجُلُ عَلَى سَوْمِ أَخِيهِ."
      },
      {
        "id": 11023,
        "hadith_number": "3459",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Bersaing dan Menipu dalam Perniagaan serta Perkahwinan",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as having said this: Do not outbid in a sale in order to ensnare. No man should enter into a transaction in which his brother has already entered, and no dweller of the town should sell on behalf of the villager. And no man should make a proposal of marriage which his brother has already made and no woman should ask for the divorce of another (co-wife) in order to deprive her of what belongs to her.",
        "malay_translation": "Rasulullah صلى الله عليه وسلم bersabda: Janganlah kamu menawar dengan melampaui batas dalam jual beli untuk menipu. Janganlah seseorang memasuki perjanjian jual beli yang telah dimasuki saudaranya, dan janganlah penduduk bandar menjual bagi pihak penduduk kampung. Janganlah seseorang melamar perempuan yang telah dilamar saudaranya, dan janganlah seorang wanita meminta cerai isteri lain dengan tujuan untuk merampas haknya.",
        "arabic_text": "وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيِّبِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَنَاجَشُوا، وَلَا يَبِعِ الْمَرْءُ عَلَى بَيْعِ أَخِيهِ، وَلَا يَبِعْ حَاضِرٌ لِبَادٍ، وَلَا يَخْطُبِ الْمَرْءُ عَلَى خِطْبَةِ أَخِيهِ، وَلَا تَسْأَلِ الْمَرْأَةُ طَلَاقَ الْأُخْرَى لِتَكْتَفِئَ مَا فِي إِنَائِهَا."
      },
      {
        "id": 11024,
        "hadith_number": "3460",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Menawar Tinggi Saudara",
        "perawi_melayu": "Laporan serupa (seperti no. 3460) telah diriwayatkan daripada Az-Zuhri dengan rangkaian sanad ini, kecuali dalam Hadis Mamar terdapat perkataan:",
        "english_text": "\"And no man should outbid his brother.",
        "malay_translation": "\"Dan janganlah seseorang menawar tinggi barang yang dituju oleh saudaranya.\"",
        "arabic_text": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الْأَعْلَى، ح وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، جَمِيعًا عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، بِهَذَا الْإِسْنَادِ مِثْلَهُ، غَيْرَ أَنَّ فِي حَدِيثِ مَعْمَرٍ: وَلَا يَزِدِ الرَّجُلُ عَلَى بَيْعِ أَخِيهِ."
      },
      {
        "id": 11025,
        "hadith_number": "3461",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Membeli Barang Dagangan dan Mengajukan Permintaan Perkahwinan yang Telah Diajukan Saudara Muslim",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The Muslim should not purchase in opposition to his brother, and he should not make the proposal of marriage on the proposal already made by his brother.",
        "malay_translation": "Rasulullah SAW bersabda: Seorang Muslim tidak sepatutnya membeli sesuatu yang sedang dibeli saudaranya, dan dia tidak sepatutnya mengajukan permintaan perkahwinan kepada wanita yang telah diajukan permintaan oleh saudaranya.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ حُجْرٍ، جَمِيعًا عَنْ إِسْمَاعِيلَ بْنِ جَعْفَرٍ - قَالَ ابْنُ أَيُّوبَ: حَدَّثَنَا إِسْمَاعِيلُ - أَخْبَرَنِي الْعَلَاءُ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «لَا يَسُمِ الْمُسْلِمُ عَلَى سَوْمِ أَخِيهِ، وَلَا يَخْطُبْ عَلَى خِطْبَتِهِ."
      },
      {
        "id": 11026,
        "hadith_number": "3462",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Berkaitan Perkahwinan",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "It was narrated from Abu Huraira ( رضی اللہ عنہ) prophet ﷺ (a Hadith similar to no.3460).",
        "malay_translation": "Telah diriwayatkan daripada Abu Hurairah رضي الله عنه, daripada Nabi SAW (sebuah hadis yang serupa dengan no. 3460).",
        "arabic_text": "وحَدَّثَنِي أَحْمَدُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا شُعْبَةُ، عَنِ الْعَلَاءِ، وَسُهَيْلٍ، عَنْ أَبِيهِمَا، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ"
      },
      {
        "id": 11027,
        "hadith_number": "3463",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Menawarkan Harga Lebih Tinggi atau Memohon Perkahwinan Selepas Saudara",
        "perawi_melayu": "Dikisahkan daripada Shubah dan yang lain daripada Abu Hurairah رضي الله عنه daripada Nabi ﷺ (hadith yang serupa dengan no. 3461) kecuali mereka berkata:",
        "english_text": "\"...offer a higher price than his brother, or propose marriage when his brother has already propose.",
        "malay_translation": "\"...menawarkan harga yang lebih tinggi daripada saudaranya, atau melamar perkahwinan sedangkan saudaranya telah melamar terlebih dahulu.",
        "arabic_text": "ح وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا شُعْبَةُ، عَنِ الْأَعْمَشِ، عَنْ أَبِي صَالِح، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِلَّا أَنَّهُمْ قَالُوا: «عَلَى سَوْمِ أَخِيهِ، وَخِطْبَةِ أَخِيهِ."
      },
      {
        "id": 11028,
        "hadith_number": "3464",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Persaudaraan Umat Islam dan Larangan Bersaing dalam Pernikahan",
        "perawi_melayu": "Uqba bin 'Amir رضي الله عنه berkhutbah:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: A believer is the brother of a believer, so it is not lawful for a believer to outbid his brother, and he should not propose an engagement when his brother has thus proposed until he gives it up.",
        "malay_translation": "Rasulullah صلى الله عليه وسلم bersabda: Seorang mukmin adalah saudara kepada mukmin yang lain. Oleh itu, tidak halal bagi seorang mukmin untuk menawar lebih tinggi daripada saudaranya dalam tawaran pembelian, dan dia tidak boleh melamar seseorang yang telah dilamar oleh saudaranya sehingga saudaranya itu melepaskan lamaran tersebut.",
        "arabic_text": "وحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، عَنِ اللَّيْثِ وَغَيْرِهِ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ شِمَاسَةَ، أَنَّهُ سَمِعَ عُقْبَةَ بْنَ عَامِرٍ، عَلَى الْمِنْبَرِ يَقُولُ: إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «الْمُؤْمِنُ أَخُو الْمُؤْمِنِ، فَلَا يَحِلُّ لِلْمُؤْمِنِ أَنْ يَبْتَاعَ عَلَى بَيْعِ أَخِيهِ، وَلَا يَخْطُبَ عَلَى خِطْبَةِ أَخِيهِ حَتَّى يَذَرَ."
      },
      {
        "id": 11029,
        "hadith_number": "3465",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Pertukaran Perkahwinan Tanpa Mas Kawin",
        "perawi_melayu": "Ibn Umar (رضي الله عنه) berkata:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) prohibited Shighar which means that a man gives his daughter in marriage on the condition that the other gives his daughter to him in marriage without any dower being paid by either.",
        "malay_translation": "Rasulullah SAW melarang Shighar, yang bermaksud seseorang lelaki menikahkan anak perempuannya dengan syarat lelaki lain menikahkan anak perempuannya kepadanya tanpa sebarang mas kawin dibayar oleh mana-mana pihak.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الشِّغَارِ، وَالشِّغَارُ: أَنْ يُزَوِّجَ الرَّجُلُ ابْنَتَهُ، عَلَى أَنْ يُزَوِّجَهُ ابْنَتَهُ، وَلَيْسَ بَيْنَهُمَا صَدَاقٌ."
      },
      {
        "id": 11030,
        "hadith_number": "3466",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Tentang Pernikahan dengan Variasi Ringkas",
        "perawi_melayu": null,
        "english_text": "A hadith like this has been narrated on the authority of Abdullah bin 'Umar (رضی اللہ عنہ) but with a slight variation of words.",
        "malay_translation": "Hadis seperti ini telah diriwayatkan dengan sanad daripada Abdullah bin 'Umar (رضي الله عنه) tetapi dengan sedikit perbezaan perkataan.",
        "arabic_text": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَعُبَيْدُ اللهِ بْنُ سَعِيدٍ، قَالُوا: حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، بِمِثْلِهِ، غَيْرَ أَنَّ فِي حَدِيثِ عُبَيْدِ اللهِ، قَالَ: قُلْتُ لِنَافِعٍ مَا الشِّغَارُ؟"
      },
      {
        "id": 11031,
        "hadith_number": "3467",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Rasulullah SAW Terhadap Shighar",
        "perawi_melayu": "Ibn Umar (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) prohibited Shighar.",
        "malay_translation": "Rasulullah SAW (ﷺ) melarang Shighar.",
        "arabic_text": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَبْدِ الرَّحْمَنِ السَّرَّاجِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الشِّغَارِ."
      },
      {
        "id": 11032,
        "hadith_number": "3468",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Tidak Terdapat Shighar dalam Islam",
        "perawi_melayu": "Ibn 'Umar (رضي الله عنهما) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as having said: There is no Shighar in islam.",
        "malay_translation": "Rasulullah (صلی الله عليه وسلم) bersabda: Tidak ada Shighar dalam Islam.",
        "arabic_text": "وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا شِغَارَ فِي الْإِسْلَامِ."
      },
      {
        "id": 11033,
        "hadith_number": "3469",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Rasulullah SAW terhadap Shighar",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) prohibited Shighar. Ibn Numair added: Shighar means that a person should say to the other person: Give me the hand of your daughter in marriage and I will (in return) marry my daughter to you; or merry me your sister, and I will marry my sister to you.",
        "malay_translation": "Rasulullah SAW melarang Shighar. Ibn Numair menambah, Shighar bermaksud seseorang berkata kepada orang lain: Berikanlah aku tangan puteri anda untuk dinikahi dan aku akan (sebagai balasannya) menikahkan puteri saya dengan anda; atau nikahilah saudara perempuan anda, dan aku akan nikahi saudara perempuan saya dengan anda.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ عَنْ عُبَيْدِ اللهِ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: «نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الشِّغَارِ» زَادَ ابْنُ نُمَيْرٍ: وَالشِّغَارُ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ: زَوِّجْنِي ابْنَتَكَ وَأُزَوِّجُكَ ابْنَتِي، أَوْ زَوِّجْنِي أُخْتَكَ وَأُزَوِّجُكَ أُخْتِي."
      },
      {
        "id": 11034,
        "hadith_number": "3470",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Nikah: Perihal Pengambilan Sunnah Tanpa Tambahan Ibnu Numair",
        "perawi_melayu": "Abu Kuraib, Abdul, dan Ubaidullah bin Umar",
        "english_text": "This hadith has been narrated on the authority of Ibn Umar with the same chain of transmitters, but there is no mention of Ibn Numair.",
        "malay_translation": "Hadis ini telah diriwayatkan dengan sanad yang sama daripada Ibn Umar, tetapi tiada sebutan tambahan daripada Ibnu Numair.",
        "arabic_text": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا عَبْدَةُ، عَنْ عُبَيْدِ اللهِ وَهُوَ ابْنُ عُمَرَ، بِهَذَا الْإِسْنَادِ. وَلَمْ يَذْكُرْ زِيَادَةَ ابْنِ نُمَيْرٍ."
      },
      {
        "id": 11035,
        "hadith_number": "3471",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Rasulullah SAW Terhadap Shighar",
        "perawi_melayu": "Jabir bin Abdullah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) prohibited Shighar.",
        "malay_translation": "Rasulullah SAW melarang Shighar.",
        "arabic_text": "وحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللهِ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ: قَالَ ابْنُ جُرَيْجٍ، ح وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ رَافِعٍ، عَنْ عَبْدِ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: «نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الشِّغَارِ."
      },
      {
        "id": 11036,
        "hadith_number": "3472",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Syarat Kehalalan Jimak (Persetubuhan)",
        "perawi_melayu": "Uqba bin Amir (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) as saying: The most worthy condition which must be fulfilled is that which makes sexual intercourse lawful. In the narration transmitted by Ibn Muthanna (instead of the word condition ) it is conditions .",
        "malay_translation": "Rasulullah SAW bersabda: Syarat yang paling utama dan wajib dipenuhi ialah syarat yang menghalalkan persetubuhan. Dalam riwayat yang disampaikan oleh Ibn Muthanna, ia menggunakan perkataan 'syarat-syarat' (bukan 'syarat').",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، حَدَّثَنَا هُشَيْمٌ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا وَكِيعٌ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ، عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ مَرْثَدِ بْنِ عَبْدِ اللهِ الْيَزَنِيِّ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَحَقَّ الشَّرْطِ أَنْ يُوفَى بِهِ، مَا اسْتَحْلَلْتُمْ بِهِ الْفُرُوجَ»، هَذَا لَفْظُ حَدِيثِ أَبِي بَكْرٍ، وَابْنِ الْمُثَنَّى، غَيْرَ أَنَّ ابْنَ الْمُثَنَّى قَالَ: «الشُّرُوطِ."
      },
      {
        "id": 11037,
        "hadith_number": "3473",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keperluan Perundingan dalam Perkahwinan Wanita",
        "perawi_melayu": "Abu Hurairah رضي الله عنه melaporkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as having said: A woman without a husband (or divorced or a widow) must not be married until she is consulted, and a virgin must not be married until her permission is sought. They asked the Prophet of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌): How her (virgin's) consent can be solicited? He (the Holy Prophet) said: That she keeps silence.",
        "malay_translation": "Rasulullah SAW bersabda: Wanita yang tidak berkahwin (atau bercerai atau balu) tidak boleh dinikahkan sehingga dia dirunding, dan gadis tidak boleh dinikahkan sehingga izinnya dicari. Mereka bertanya kepada Rasulullah SAW: Bagaimana izinnya (gadis) boleh didapatkan? Baginda SAW menjawab: Dengan diamnya.",
        "arabic_text": "حَدَّثَنِي عُبَيْدُ اللهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ الْقَوَارِيرِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، حَدَّثَنَا أَبُو سَلَمَةَ، حَدَّثَنَا أَبُو هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تُنْكَحُ الْأَيِّمُ حَتَّى تُسْتَأْمَرَ، وَلَا تُنْكَحُ الْبِكْرُ حَتَّى تُسْتَأْذَنَ»، قَالُوا: يَا رَسُولَ اللهِ، وَكَيْفَ إِذْنُهَا؟ قَالَ: «أَنْ تَسْكُتَ»."
      },
      {
        "id": 11038,
        "hadith_number": "3474",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis yang Serupa dengan Hadis Hisham (Bil. 3473) dan Perkataan yang Sama antara Hadis Hisham, Shaiban dan Muwiyah bin Salam",
        "perawi_melayu": null,
        "english_text": "A hadith similar to that of  Hisham (no. 3473) with its chain was narrated from Ibn Abi Kathir. The wording of the Ahadith of Hisham, Shaiban and Muwiyah bin Salam are all the same.",
        "malay_translation": "Satu hadis yang serupa dengan hadis Hisham (bil. 3473) beserta sanadnya telah diriwayatkan daripada Ibn Abi Kathir. Perkataan dalam hadis Hisham, Shaiban dan Muwiyah bin Salam semuanya sama.",
        "arabic_text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا الْحَجَّاجُ بْنُ أَبِي، عُثْمَانَ ح وَحَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا عِيسَى، - يَعْنِي ابْنَ يُونُسَ - عَنِ الأَوْزَاعِيِّ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ، حَدَّثَنَا شَيْبَانُ، ح وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، وَمُحَمَّدُ بْنُ رَافِعٍ قَالاَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، ح وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، الدَّارِمِيُّ أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ، حَدَّثَنَا مُعَاوِيَةُ، كُلُّهُمْ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، ‏.‏ بِمِثْلِ مَعْنَى حَدِيثِ هِشَامٍ وَإِسْنَادِهِ ‏.‏ وَاتَّفَقَ لَفْظُ حَدِيثِ هِشَامٍ وَشَيْبَانَ وَمُعَاوِيَةَ بْنِ سَلاَّمٍ فِي هَذَا الْحَدِيثِ‏.‏"
      },
      {
        "id": 11039,
        "hadith_number": "3475",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Meminta Kebenaran Perempuan Yang Dikalikan oleh Wali",
        "perawi_melayu": "Aishah رضي الله عنها meriwayatkan:",
        "english_text": "I asked Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about a virgin whose marriage is solemnised by her guardian, whether it was necessary or not to consult her. Allah's Messerger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Yes, she must be consulted. 'A'isha رضی اللہ عنہا reported: I told him that she feels shy, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Her silence implies her consent.",
        "malay_translation": "Saya bertanya kepada Rasulullah صلی الله عليه وسلم tentang wanita perawan yang perkahwinannya dilantik oleh wali, sama ada perlu atau tidak untuk berunding dengannya. Rasulullah صلی الله عليه وسلم menjawab: Ya, dia mesti dirunding. Aishah رضي الله عنها meriwayatkan: Saya memberitahunya bahawa dia merasa segan, lalu Rasulullah صلی الله عليه وسلم bersabda:  Kesenyapannya menandakan persetujuannya.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللهِ بْنُ إِدْرِيسَ، عَنِ ابْنِ جُرَيْجٍ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ رَافِعٍ، جَمِيعًا عَنْ عَبْدِ الرَّزَّاقِ، وَاللَّفْظُ لِابْنِ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ: سَمِعْتُ ابْنَ أَبِي مُلَيْكَةَ، يَقُولُ: قَالَ ذَكْوَانُ، مَوْلَى عَائِشَةَ، سَمِعْتُ عَائِشَةَ تَقُولُ: سَأَلْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْجَارِيَةِ يُنْكِحُهَا أَهْلُهَا، أَتُسْتَأْمَرُ أَمْ لَا؟ فَقَالَ لَهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «نَعَمْ، تُسْتَأْمَرُ»، فَقَالَتْ عَائِشَةُ: فَقُلْتُ لَهُ: فَإِنَّهَا تَسْتَحِي، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فَذَلِكَ إِذْنُهَا، إِذَا هِيَ سَكَتَتْ."
      },
      {
        "id": 11040,
        "hadith_number": "3476",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hak Wanita dan Persetujuan Perawan",
        "perawi_melayu": "Ibn 'Abbas (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Apostle (ﷺ) bersabda: Seorang wanita yang tidak berpasangan mempunyai hak lebih terhadap dirinya sendiri daripada penjaganya, dan persetujuan seorang gadis perlu diminta darinya, dan diamnya bererti persetujuannya.",
        "malay_translation": "Rasulullah SAW bersabda: Seorang wanita yang tidak berkahwin mempunyai hak lebih terhadap dirinya sendiri daripada penjaganya. Persetujuan seorang gadis perlu diminta darinya, dan diamnya bermakna persetujuannya.",
        "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، قَالَا: حَدَّثَنَا مَالِكٌ، ح وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَاللَّفْظُ لَهُ، قَالَ: قُلْتُ لِمَالِكٍ: حَدَّثَكَ عَبْدُ اللهِ بْنُ الْفَضْلِ، عَنْ نَافِعِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْأَيِّمُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا، وَالْبِكْرُ تُسْتَأْذَنُ فِي نَفْسِهَا، وَإِذْنُهَا صُمَاتُهَا»؟ قَالَ: نَعَمْ."
      },
      {
        "id": 11041,
        "hadith_number": "3477",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hak Wanita dalam Perkahwinan dan Persetujuan Perempuan yang belum Berkahwin",
        "perawi_melayu": "Ibn Abbas (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Wanita yang telah berkahwin sebelumnya (Thayyib) mempunyai hak lebih terhadap dirinya sendiri berbanding wali (penjaga)nya. Dan perempuan yang masih dara juga perlu dirundingkan, dan diamnya menandakan persetujuannya.",
        "malay_translation": "Nabi saw bersabda: Wanita yang telah berkahwin sebelum ini (Thayyib) mempunyai hak lebih ke atas dirinya daripada walinya. Dan perempuan dara juga perlu dirundingkan, dan diamnya dianggap persetujuan.",
        "arabic_text": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ زِيَادِ بْنِ سَعْدٍ، عَنْ عَبْدِ اللهِ بْنِ الْفَضْلِ، سَمِعَ نَافِعَ بْنَ جُبَيْرٍ، يُخْبِرُ عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الثَّيِّبُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا، وَالْبِكْرُ تُسْتَأْمَرُ، وَإِذْنُهَا سُكُوتُهَا."
      },
      {
        "id": 11042,
        "hadith_number": "3478",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hak Wanita Terdahulu Berkahwin Atas Diri Sendiri",
        "perawi_melayu": "Sufyan melaporkan berdasarkan rangkaian perawi yang sama (dan perkataannya ialah):",
        "english_text": "A woman who has been previously married (Thayyib) has more right to her person than her guardian; and a virgin's father must ask her consent from her, her consent being her silence, At times he said: Her silence is her affirmation.",
        "malay_translation": "Seorang wanita yang pernah berkahwin (Thayyib) mempunyai hak yang lebih besar terhadap dirinya sendiri berbanding wali atau penjaganya; dan bapa seorang gadis perlu meminta persetujuannya, persetujuannya ialah dengan diamnya. Kadangkala baginda bersabda: Diamnya adalah persetujuannya.",
        "arabic_text": "وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، بِهَذَا الْإِسْنَادِ، وَقَالَ: «الثَّيِّبُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا، وَالْبِكْرُ يَسْتَأْذِنُهَا أَبُوهَا فِي نَفْسِهَا، وَإِذْنُهَا صُمَاتُهَا»، وَرُبَّمَا قَالَ: «وَصَمْتُهَا إِقْرَارُهَا."
      },
      {
        "id": 11043,
        "hadith_number": "3479",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkahwinan Rasulullah SAW di Usia Muda dan Pengalaman Aisyah r.a.",
        "perawi_melayu": "Aisyah (رضي الله عنها) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) mengahwini saya ketika usia saya enam tahun, dan saya diizinkan masuk ke rumahnya pada usia sembilan tahun. Beliau berkata lagi: Kami pergi ke Madinah dan saya mengalami demam selama sebulan, dan rambut saya sampai ke cuping telinga. Umm Ruman رضي الله عنها (ibu saya) datang kepada saya ketika saya sedang bermain ayunan bersama teman-teman saya. Dia memanggil saya dengan kuat, dan saya pun pergi mendapatkannya, tidak mengetahui apa yang dia inginkan. Beliau memegang tangan saya dan membawa saya ke pintu, dan saya berkata: Ha, ha (seolah-olah saya terengah-engah), sehingga kegelisahan hati saya reda. Beliau membawa saya ke sebuah rumah, di mana para wanita Ansar berkumpul. Mereka semua mendoakan kebaikan dan kebahagiaan buat saya, dan berkata: Semoga engkau beroleh keberuntungan. Beliau (ibu saya) menyerahkan saya kepada mereka. Mereka mencuci kepala saya dan menghiasi saya, dan saya tidak merasa takut. Rasulullah SAW datang ke situ di pagi hari, dan saya diserahkan kepada Baginda.",
        "malay_translation": "Rasulullah SAW mengahwini saya ketika saya berumur enam tahun, dan saya diizinkan masuk ke rumah Baginda pada usia sembilan tahun. Beliau (Aisyah r.a) berkata lagi: Kami pergi ke Madinah, dan saya mengalami demam selama sebulan, rambut saya sampai ke cuping telinga. Umm Ruman رضي الله عنها (ibu saya) datang kepada saya ketika saya sedang bermain ayunan bersama rakan-rakan saya.  Dia memanggil saya dengan kuat, dan saya pun pergi mendapatkannya, tidak mengetahui apa yang diinginkannya. Beliau memegang tangan saya dan membawa saya ke pintu, dan saya berkata: Ha, ha (seolah-olah saya terengah-engah), sehingga kegelisahan hati saya reda. Beliau membawa saya ke sebuah rumah, di mana para wanita Ansar berkumpul. Mereka semua mendoakan kebaikan dan kebahagiaan untuk saya, dan berkata: Semoga engkau beroleh keberuntungan. Beliau (ibu saya) menyerahkan saya kepada mereka. Mereka mencuci kepala saya dan menghiasi saya, dan saya tidak merasa takut.  Rasulullah SAW datang ke situ pada pagi hari, dan saya diserahkan kepada Baginda.",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ، حَدَّثَنَا أَبُو أُسَامَةَ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، قَالَ: وَجَدْتُ فِي كِتَابِي عَنْ أَبِي أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ: «تَزَوَّجَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِسِتِّ سِنِينَ، وَبَنَى بِي وَأَنَا بِنْتُ تِسْعِ سِنِينَ»، قَالَتْ: فَقَدِمْنَا الْمَدِينَةَ، فَوُعِكْتُ شَهْرًا، فَوَفَى شَعْرِي جُمَيْمَةً، فَأَتَتْنِي أُمُّ رُومَانَ، وَأَنَا عَلَى أُرْجُوحَةٍ، وَمَعِي صَوَاحِبِي، فَصَرَخَتْ بِي فَأَتَيْتُهَا، وَمَا أَدْرِي مَا تُرِيدُ بِي فَأَخَذَتْ بِيَدِي، فَأَوْقَفَتْنِي عَلَى الْبَابِ، فَقُلْتُ: هَهْ هَهْ، حَتَّى ذَهَبَ نَفَسِي، فَأَدْخَلَتْنِي بَيْتًا، فَإِذَا نِسْوَةٌ مِنَ الْأَنْصَارِ، فَقُلْنَ: عَلَى الْخَيْرِ وَالْبَرَكَةِ، وَعَلَى خَيْرِ طَائِرٍ، فَأَسْلَمَتْنِي إِلَيْهِنَّ، فَغَسَلْنَ رَأْسِي وَأَصْلَحْنَنِي، فَلَمْ يَرُعْنِي إِلَّا وَرَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ضُحًى، فَأَسْلَمْنَنِي إِلَيْهِ."
      },
      {
        "id": 11044,
        "hadith_number": "3480",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkahwinan Rasulullah SAW pada Umur Muda",
        "perawi_melayu": "Aisyah رضي الله عنها meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) married me when I was six years old, and I was admitted to his house when I was nine years old.",
        "malay_translation": "Rasulullah SAW mengahwini saya ketika usia saya enam tahun, dan saya diizinkan masuk ke rumahnya ketika berusia sembilan tahun.",
        "arabic_text": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، وَاللَّفْظُ لَهُ، حَدَّثَنَا عَبْدَةُ هُوَ ابْنُ سُلَيْمَانَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ: «تَزَوَّجَنِي النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَنَا بِنْتُ سِتِّ سِنِينَ، وَبَنَى بِي وَأَنَا بِنْتُ تِسْعِ سِنِينَ»."
      },
      {
        "id": 11045,
        "hadith_number": "3481",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkahwinan Nabi SAW dengan Aisyah r.a. pada Umur Muda",
        "perawi_melayu": "Aisyah r.a. meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) married her when she was seven years old, and he was taken to his house as a bride when she was nine, and her dolls were with her; and when he (the Holy Prophet ﷺ) died she was eighteen years old.",
        "malay_translation": "Rasulullah SAW mengahwininya ketika umurnya tujuh tahun, dan baginda dibawa ke rumahnya sebagai pengantin ketika umurnya sembilan tahun, dan masih bermain dengan anak patungnya. Ketika baginda wafat, umurnya telah mencapai lapan belas tahun.",
        "arabic_text": "وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ تَزَوَّجَهَا وَهِيَ بِنْتُ سَبْعِ سِنِينَ، وَزُفَّتْ إِلَيْهِ وَهِيَ بِنْتُ تِسْعِ سِنِينَ، وَلُعَبُهَا مَعَهَا، وَمَاتَ عَنْهَا وَهِيَ بِنْتُ ثَمَانَ عَشْرَةَ."
      },
      {
        "id": 11046,
        "hadith_number": "3482",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkahwinan Nabi SAW dengan Aisyah رضي الله عنها",
        "perawi_melayu": "Dikisahkan oleh 'Aisyah رضي الله عنها:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) married her when she was six years old, and he (the Holy Prophet ﷺ) took her to his house when she was nine, and when he (the Holy Prophet ﷺ) died she was eighteen years old.",
        "malay_translation": "Rasulullah SAW mengahwininya ketika usianya enam tahun, dan baginda membawanya ke rumahnya ketika umurnya sembilan tahun, dan ketika baginda wafat, umurnya lapan belas tahun.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَ يَحْيَى، وَإِسْحَاقُ: أَخْبَرَنَا، وقَالَ الْآخَرَانِ: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الْأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ: «تَزَوَّجَهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهِيَ بِنْتُ سِتٍّ، وَبَنَى بِهَا وَهِيَ بِنْتُ تِسْعٍ، وَمَاتَ عَنْهَا وَهِيَ بِنْتُ ثَمَانَ عَشْرَةَ."
      },
      {
        "id": 11047,
        "hadith_number": "3483",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkahwinan Rasulullah SAW dengan Aisyah رضي الله عنها dan Keutamaan Bulan Syawal",
        "perawi_melayu": "Aisyah رضي الله عنها meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) contracted marriage with me in Shawwal and took me to his house as a bride during Shawwal. And who among the wives of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was dearer to him than I, and  'A'isha رضي الله عنها liked that the women (of her family) should enter the houses as brides during the month of Shawwal.",
        "malay_translation": "Rasulullah SAW mengahwini saya pada bulan Syawal dan membawa saya ke rumahnya sebagai pengantin pada bulan Syawal itu juga.  Dan siapakah di antara isteri-isteri Rasulullah SAW yang lebih disayanginya daripada saya? Aisyah رضي الله عنها menyukai wanita-wanita (dari keluarganya) memasuki rumah sebagai pengantin pada bulan Syawal.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَاللَّفْظُ لِزُهَيْرٍ، قَالَا: حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، عَنْ عَبْدِ اللهِ بْنِ عُرْوَةَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ: «تَزَوَّجَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي شَوَّالٍ، وَبَنَى بِي فِي شَوَّالٍ، فَأَيُّ نِسَاءِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ أَحْظَى عِنْدَهُ مِنِّي؟»، قَالَ: «وَكَانَتْ عَائِشَةُ تَسْتَحِبُّ أَنْ تُدْخِلَ نِسَاءَهَا فِي شَوَّالٍ."
      },
      {
        "id": 11048,
        "hadith_number": "3484",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Mengenai Perkahwinan dan Tindakan 'Aisyah رضي الله عنها",
        "perawi_melayu": null,
        "english_text": "This hadith has been narrated on the authority of Sufyan with the same chain of transmitters, but he made no mention of the act of 'A'isha رضی اللہ عنہا (being admitted as a wife in the house of the Holy Prophet ﷺ).",
        "malay_translation": "Hadis ini telah diriwayatkan dengan sanad yang sama oleh Sufyan, tetapi beliau tidak menyebut tindakan 'Aisyah رضي الله عنها (dimasukkan sebagai isteri di rumah Nabi SAW).",
        "arabic_text": "وَحَدَّثَنَاهُ ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سُفْيَانُ، بِهَذَا الْإِسْنَادِ، وَلَمْ يَذْكُرْ فِعْلَ عَائِشَةَ."
      },
      {
        "id": 11049,
        "hadith_number": "3485",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Menjalin Perkahwinan dengan Wanita Ansar dan Meninjau",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "I was in the company of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) when there came a man and informed him that he had contracted to marry a woman of the Ansar. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Did you cast a glance at her? He said: No. He said: Go and cast a glance at her, for there is something in the eyes of the Ansar.",
        "malay_translation": "Aku bersama Rasulullah (صلی الله عليه وسلم) ketika datang seorang lelaki yang memberitahunya bahawa dia telah bertunang dengan seorang wanita Ansar. Lalu Rasulullah (صلی الله عليه وسلم) bertanya: Adakah engkau melihatnya? Lelaki itu menjawab: Tidak.  Rasulullah (صلی الله عليه وسلم) bersabda: Pergilah dan lihatlah dia, kerana terdapat sesuatu pada pandangan mata wanita Ansar.",
        "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ يَزِيدَ بْنِ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: كُنْتُ عِنْدَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَتَاهُ رَجُلٌ فَأَخْبَرَهُ أَنَّهُ تَزَوَّجَ امْرَأَةً مِنَ الْأَنْصَارِ، فَقَالَ لَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَنَظَرْتَ إِلَيْهَا؟»، قَالَ: لَا، قَالَ: «فَاذْهَبْ فَانْظُرْ إِلَيْهَا، فَإِنَّ فِي أَعْيُنِ الْأَنْصَارِ شَيْئًا»."
      },
      {
        "id": 11050,
        "hadith_number": "3486",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pertimbangan Dower dan Kemungkinan Ekspedisi",
        "perawi_melayu": "Abu Hurairah رضي الله عنه melaporkan:",
        "english_text": "A man came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: I have contracted marriage with a woman of the Ansar, whereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Did you cast a glance at her, for there is something in the eyes of the Ansar? He said: I did cast a glance at her, whereupon he said: For what (dower) did you marry her? He said: For four 'uqiyas. Thereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: For four 'uqiyas; it seems as if you dig out silver from the side of this mountain (and that is why you are prepared to pay such a large amount of dower). We have nothing which we should give you. There is a possibility that we may send you to an (expedition) where you may get (booty). So he sent that man (in the expedition) which was despatched to Banu 'Abs.",
        "malay_translation": "Seorang lelaki datang kepada Rasulullah SAW dan berkata: Saya telah mengahwini seorang wanita Ansar.  Lalu Rasulullah SAW bertanya: Adakah engkau memandangnya? Kerana terdapat sesuatu yang tersendiri dalam pandangan kaum Ansar. Lelaki itu menjawab: Saya memang memandangnya. Lalu Rasulullah SAW bertanya: Untuk apa (mas kahwin) engkau mengahwininya? Lelaki itu menjawab: Untuk empat 'uqiyah.  Lalu Rasulullah SAW bersabda: Untuk empat 'uqiyah; seolah-olah engkau menggali perak dari sisi gunung ini (dan itu sebab engkau sanggup membayar mas kahwin yang banyak itu). Kami tidak mempunyai apa-apa yang patut kami berikan kepadamu. Ada kemungkinan kami menghantarmu ke suatu ekspedisi di mana engkau boleh mendapatkan rampasan perang. Maka baginda menghantar lelaki itu (dalam ekspedisi) yang dihantar ke kaum Banu 'Abs.",
        "arabic_text": "وحَدَّثَنِي يَحْيَى بْنُ مَعِينٍ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ، حَدَّثَنَا يَزِيدُ بْنُ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: إِنِّي تَزَوَّجْتُ امْرَأَةً مِنَ الْأَنْصَارِ، فَقَالَ لَهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «هَلْ نَظَرْتَ إِلَيْهَا؟ فَإِنَّ فِي عُيُونِ الْأَنْصَارِ شَيْئًا» قَالَ: قَدْ نَظَرْتُ إِلَيْهَا، قَالَ: «عَلَى كَمْ تَزَوَّجْتَهَا؟» قَالَ: عَلَى أَرْبَعِ أَوَاقٍ، فَقَالَ لَهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «عَلَى أَرْبَعِ أَوَاقٍ؟ كَأَنَّمَا تَنْحِتُونَ الْفِضَّةَ مِنْ عُرْضِ هَذَا الْجَبَلِ، مَا عِنْدَنَا مَا نُعْطِيكَ، وَلَكِنْ عَسَى أَنْ نَبْعَثَكَ فِي بَعْثٍ تُصِيبُ مِنْهُ»، قَالَ: فَبَعَثَ بَعْثًا إِلَى بَنِي عَبْسٍ بَعَثَ ذَلِكَ الرَّجُلَ فِيهِمْ."
      },
      {
        "id": 11051,
        "hadith_number": "3487",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkahwinan dengan Sebahagian Ayat Al-Quran",
        "perawi_melayu": "Sahl bin Sa'd al-Sa'idi (رضي الله عنه) meriwayatkan:",
        "english_text": "A woman came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Messenger of Allah, I have come to you to entrust myself to you (you may contract my marriage with anyone at your discretion). Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saw her and cast a glance at her from head to foot. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) then lowered his head. When the woman saw that he had made no decision in regard to her, she sat down. There stood up a person from amongst his companions and said: Messenger of Allah, marry her to me if you have no need of her. He (the Prophet) said: is there anything with you (which you con give as a dower)? He said: No, Messenger of Allah, by Allah I have nothing. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Go to your people (family) and see if you can find something. He returned and said: I have found nothing. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: See even if it is an iron ring. He went and returned and said: No, by Allah, not even an iron ring, but only this lower garment of mine (Sahl said that he had no upper garment), half of which (I am prepared to part with) for her. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: How can your lower garment serve your purpose, for it you wear it, she would not be able to make any use of it and if she wears it there would not be anything on you? The man sat down and as the sitting prolonged he stood up (in disappointment) and as he was going back Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded (him) to be called back, and as he came, he said to him: Do you know any part of the Qur'an? He said: I know such and such surahs (and he counted them), whereupon he ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Can you recite them from heart (from your memory)? He said: Yes, whereupon he (Allah's Messenger) said: Go, I have given her to you in marriage for the part of the Qur'an which you know. This is the Hadith of Ibn Abi Hazim (a narrator) is very similar in wording.",
        "malay_translation": "Seorang wanita datang kepada Rasulullah SAW dan berkata: Wahai Rasulullah, saya datang kepada anda untuk mempercayakan diri saya kepada anda (anda boleh menikahkan saya dengan sesiapa sahaja mengikut budi bicara anda). Rasulullah SAW melihatnya dan meliriknya dari kepala hingga kaki. Kemudian Rasulullah SAW menundukkan kepalanya. Apabila wanita itu melihat bahawa baginda tidak membuat keputusan mengenainya, dia duduk. Seorang daripada sahabat baginda berdiri dan berkata: Wahai Rasulullah, nikahkan dia dengan saya jika baginda tidak memerlukannya. Baginda bertanya: Adakah sesuatu pada dirimu (yang boleh kau berikan sebagai mas kahwin)? Dia berkata: Tidak, Wahai Rasulullah, demi Allah, aku tidak mempunyai apa-apa. Lalu Rasulullah SAW berkata: Pergilah kepada keluargamu dan lihat adakah kau dapati sesuatu. Dia kembali dan berkata: Aku tidak dapati apa-apa. Rasulullah SAW berkata: Lihatlah sekurang-kurangnya sebentuk cincin besi. Dia pergi dan kembali dan berkata: Tidak, demi Allah, bahkan tidak sebentuk cincin besi, hanya pakaian bawahku ini (Sahl berkata bahawa dia tidak mempunyai pakaian atas), separuh daripadanya (aku bersedia untuk memberikannya) untuknya. Lalu Rasulullah SAW berkata: Bagaimana pakaian bawahmu dapat memenuhi tujuanmu? Jika engkau memakainya, dia tidak akan dapat menggunakannya dan jika dia memakainya, engkau tidak akan ada apa-apa? Lelaki itu duduk dan setelah lama duduk, dia bangun (dengan kecewa) dan ketika dia hendak pergi, Rasulullah SAW memerintahkan supaya dia dipanggil kembali, dan ketika dia datang, baginda berkata kepadanya: Adakah engkau mengetahui sebahagian Al-Quran? Dia berkata: Aku mengetahui beberapa surah (dan dia menyebutkannya), lalu baginda bertanya: Bolehkah engkau membacanya dari hafalan? Dia berkata: Ya, lalu baginda berkata: Pergilah, aku telah menikahkannya denganmu dengan bahagian Al-Quran yang engkau ketahui. Ini adalah hadis daripada Ibn Abi Hazim (seorang perawi) yang sangat serupa perkataannya.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ الثَّقَفِيُّ، حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، ح وَحَدَّثَنَاهُ قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، قَالَ: جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَتْ: يَا رَسُولَ اللهِ، جِئْتُ أَهَبُ لَكَ نَفْسِي، فَنَظَرَ إِلَيْهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَصَعَّدَ النَّظَرَ فِيهَا وَصَوَّبَهُ، ثُمَّ طَأْطَأَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَأْسَهُ، فَلَمَّا رَأَتِ الْمَرْأَةُ أَنَّهُ لَمْ يَقْضِ فِيهَا شَيْئًا جَلَسَتْ، فَقَامَ رَجُلٌ مِنْ أَصْحَابِهِ، فَقَالَ: يَا رَسُولَ اللهِ، إِنْ لَمْ يَكُنْ لَكَ بِهَا حَاجَةٌ فَزَوِّجْنِيهَا، فَقَالَ: «فَهَلْ عِنْدَكَ مِنْ شَيْءٍ؟» فَقَالَ: لَا، وَاللهِ يَا رَسُولَ اللهِ، فَقَالَ: «اذْهَبْ إِلَى أَهْلِكَ فَانْظُرْ هَلْ تَجِدُ شَيْئًا؟» فَذَهَبَ ثُمَّ رَجَعَ، فَقَالَ: لَا، وَاللهِ، مَا وَجَدْتُ شَيْئًا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «انْظُرْ وَلَوْ خَاتِمًا مِنْ حَدِيدٍ»، فَذَهَبَ ثُمَّ رَجَعَ، فَقَالَ: لَا، وَاللهِ، يَا رَسُولَ اللهِ، وَلَا خَاتِمًا مِنْ حَدِيدٍ، وَلَكِنْ هَذَا إِزَارِي - قَالَ سَهْلٌ: مَا لَهُ رِدَاءٌ - فَلَهَا نِصْفُهُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا تَصْنَعُ بِإِزَارِكَ؟ إِنْ لَبِسْتَهُ لَمْ يَكُنْ عَلَيْهَا مِنْهُ شَيْءٌ، وَإِنْ لَبِسَتْهُ لَمْ يَكُنْ عَلَيْكَ مِنْهُ شَيْءٌ»، فَجَلَسَ الرَّجُلُ، حَتَّى إِذَا طَالَ مَجْلِسُهُ قَامَ، فَرَآهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مُوَلِّيًا، فَأَمَرَ بِهِ فَدُعِيَ، فَلَمَّا جَاءَ قَالَ: «مَاذَا مَعَكَ مِنَ الْقُرْآنِ؟» قَالَ: مَعِي سُورَةُ كَذَا وَسُورَةُ كَذَا - عَدَّدَهَا - فَقَالَ: «تَقْرَؤُهُنَّ عَنْ ظَهْرِ قَلْبِكَ؟» قَالَ: نَعَمْ، قَالَ: «اذْهَبْ فَقَدْ مُلِّكْتَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ»، هَذَا حَدِيثُ ابْنِ أَبِي حَازِمٍ، وَحَدِيثُ يَعْقُوبَ يُقَارِبُهُ فِي اللَّفْظِ."
      },
      {
        "id": 11052,
        "hadith_number": "3488",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkahwinan dan Pengajaran Al-Quran",
        "perawi_melayu": "Hadith ini diriwayatkan daripada Sahl bin Sa'd رضي الله عنه dengan sedikit perubahan perkataan, tetapi hadith yang disampaikan melalui Za'idah menyatakan bahawa Baginda Rasulullah SAW bersabda:",
        "english_text": "Go, I have married her to you, and you teach her something of the Qur'an.",
        "malay_translation": "Pergilah, Aku telah menikahkannya denganmu, dan engkau mengajarkannya sedikit ilmu Al-Quran.",
        "arabic_text": "وَحَدَّثَنَاهُ خَلَفُ بْنُ هِشَامٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، ح وحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، عَنِ الدَّرَاوَرْدِيِّ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، كُلُّهُمْ عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، بِهَذَا الْحَدِيثِ، يَزِيدُ بَعْضُهُمْ عَلَى بَعْضٍ، غَيْرَ أَنَّ فِي حَدِيثِ زَائِدَةَ، قَالَ: «انْطَلِقْ فَقَدْ زَوَّجْتُكَهَا فَعَلِّمْهَا مِنَ الْقُرْآنِ."
      },
      {
        "id": 11053,
        "hadith_number": "3489",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Maslah Walimah Rasulullah SAW",
        "perawi_melayu": "Abu Salama bin Abdul Rahman melaporkan:",
        "english_text": "I asked 'A'isha رضی اللہ عنہا , the wife of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌): What is the amount of dower of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌)? She said: It was twelve 'uqiyas and one nash. She said: Do you know what is al-nash? I said: No. She said: It is half of uqiya, and it amounts to five hundred dirhams, and that was the dower given by Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) to his wives.",
        "malay_translation": "Saya bertanya kepada 'Aisha رضي الله عنها, isteri Rasulullah SAW: Berapakah mas kahwin Rasulullah SAW?  Dia menjawab: Ia sebanyak dua belas 'uqiyah dan satu nash. Dia bertanya lagi: Tahukah engkau apa itu al-nash? Saya menjawab: Tidak. Dia menjawab: Ia separuh daripada 'uqiyah, dan ia bersamaan dengan lima ratus dirham, dan itulah mas kahwin yang diberikan oleh Rasulullah SAW kepada isteri-isterinya.",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، حَدَّثَنِي يَزِيدُ بْنُ عَبْدِ اللهِ بْنِ أُسَامَةَ بْنِ الْهَادِ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ، وَاللَّفْظُ لَهُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ يَزِيدَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ قَالَ: سَأَلْتُ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: كَمْ كَانَ صَدَاقُ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ قَالَتْ: «كَانَ صَدَاقُهُ لِأَزْوَاجِهِ ثِنْتَيْ عَشْرَةَ أُوقِيَّةً وَنَشًّا»، قَالَتْ: «أَتَدْرِي مَا النَّشُّ؟» قَالَ: قُلْتُ: لَا، قَالَتْ: «نِصْفُ أُوقِيَّةٍ، فَتِلْكَ خَمْسُمِائَةِ دِرْهَمٍ، فَهَذَا صَدَاقُ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِأَزْوَاجِهِ."
      },
      {
        "id": 11054,
        "hadith_number": "3490",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Mengadakan Perkahwinan Walaupun Hanya dengan Seekor Kambing",
        "perawi_melayu": "Daripada Anas bin Malik رضي الله عنه",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saw the trace of yellowness on 'Abdul-Rahman bin 'Auf  رضی اللہ عنہ and said: What is this? Thereupon he said: Allah's Messenger, I have married a woman for a date-stone's weight of gold. He said: God bless you! Hold a wedding feast, even if only with a sheep.",
        "malay_translation": "Rasulullah صلى الله عليه وسلم melihat tanda kekuningan pada 'Abdul Rahman bin 'Auf رضي الله عنه dan bertanya, \"Apa ini?\" Dia menjawab, \"Wahai Rasulullah, saya telah mengahwini seorang wanita dengan emas seberat batu kurma.\" Baginda bersabda, \"Semoga Allah memberkati kamu! Adakan kenduri perkahwinan, walaupun hanya dengan seekor kambing.\"",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَأَبُو الرَّبِيعِ سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَاللَّفْظُ لِيَحْيَى، قَالَ يَحْيَى: أَخْبَرَنَا، وَقَالَ الْآخَرَانِ: حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَأَى عَلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَثَرَ صُفْرَةٍ، فَقَالَ: «مَا هَذَا؟» قَالَ: يَا رَسُولَ اللهِ، إِنِّي تَزَوَّجْتُ امْرَأَةً عَلَى وَزْنِ نَوَاةٍ مِنْ ذَهَبٍ، قَالَ: «فَبَارَكَ اللهُ لَكَ، أَوْلِمْ وَلَوْ بِشَاةٍ."
      },
      {
        "id": 11055,
        "hadith_number": "3491",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkahwinan dan Jamuan Kecil",
        "perawi_melayu": "Anas bin Malik (رضي الله عنه) meriwayatkan:",
        "english_text": "'Abdul-Rahman bin 'Auf (رضی اللہ عنہ) menikah semasa hayat Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) dengan mahar seberat nawat emas dan Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda kepadanya: Adakan jamuan walaupun sekadar seekor kambing.",
        "malay_translation": "'Abdul-Rahman bin 'Auf (رضي الله عنه) berkahwin semasa hayat Rasulullah (ﷺ) dengan mahar seberat nawat emas dan Rasulullah (ﷺ) bersabda kepadanya: Adakan jamuan walaupun sekadar seekor kambing.",
        "arabic_text": "وحَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ، تَزَوَّجَ عَلَى عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، عَلَى وَزْنِ نَوَاةٍ مِنْ ذَهَبٍ، فَقَالَ لَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَوْلِمْ وَلَوْ بِشَاةٍ»."
      },
      {
        "id": 11056,
        "hadith_number": "3492",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkahwinan dengan Hadiah Sesuai dari Harta",
        "perawi_melayu": "Anas bin Malik (رضي الله عنه) meriwayatkan:",
        "english_text": "'Abdul-Rahman bin 'Auf (رضی اللہ عنہ) berkahwin dengan seorang wanita dengan harga seberat batu kurma emas dan Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda kepadanya: Adakan kenduri perkahwinan, walaupun hanya dengan seekor kambing.",
        "malay_translation": "'Abdul-Rahman bin 'Auf (رضي الله عنه) telah mengahwini seorang wanita dengan mas kahwin seberat batu kurma emas.  Dan Rasulullah (صلى الله عليه وسلم) bersabda kepadanya: Adakan kenduri kahwin, walaupun hanya dengan seekor kambing.",
        "arabic_text": "وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا وَكِيعٌ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، وَحُمَيْدٍ، عَنْ أَنَسٍ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ تَزَوَّجَ امْرَأَةً عَلَى وَزْنِ نَوَاةٍ مِنْ ذَهَبٍ، وَأَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ: «أَوْلِمْ وَلَوْ بِشَاةٍ."
      },
      {
        "id": 11057,
        "hadith_number": "3493",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkahwinan dan Kehidupan Berumah Tangga",
        "perawi_melayu": "Hadith ini diriwayatkan oleh Humaid dengan sanad yang sama, kecuali dengan sedikit perbezaan perkataan:",
        "english_text": "'Abdul-Rahman رضی اللہ عنہ said: I married a woman.",
        "malay_translation": "'Abdul-Rahman رضي الله عنه berkata: Aku telah mengahwini seorang wanita.",
        "arabic_text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو دَاوُدَ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، وَهَارُونُ بْنُ عَبْدِ اللهِ، قَالَا: حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، ح وحَدَّثَنَا أَحْمَدُ بْنُ خِرَاشٍ، حَدَّثَنَا شَبَابَةُ، كُلُّهُمْ عَنْ شُعْبَةَ، عَنْ حُمَيْدٍ، بِهَذَا الْإِسْنَادِ، غَيْرَ أَنَّ فِي حَدِيثِ وَهْبٍ، قَالَ: قَالَ عَبْدُ الرَّحْمَنِ: تَزَوَّجْتُ امْرَأَةً."
      },
      {
        "id": 11058,
        "hadith_number": "3494",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pernikahan dan Mahr dalam Islam",
        "perawi_melayu": "Abdul Rahman bin 'Auf (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) melihat tanda-tanda kegembiraan perkahwinan pada diriku, dan aku berkata: Aku telah mengahwini seorang wanita dari kalangan Ansar. Baginda bertanya: Berapa banyak mas kahwin yang engkau berikan? Aku menjawab: Sebesar berat emas sebutir kurma. Dan dalam hadis yang diriwayatkan oleh Ishaq (iaitu): (berat nawat) emas.",
        "malay_translation": "Nabi SAW melihat tanda-tanda kegembiraan perkahwinan pada diri saya, dan saya berkata, \"Saya telah berkahwin dengan seorang wanita Ansar.\" Baginda bertanya, \"Berapakah mas kahwin yang engkau berikan?\" Saya menjawab, \"Sebesar berat emas sebutir kurma.\" Dan dalam hadis yang diriwayatkan oleh Ishaq (iaitu), (berat nawat) emas.",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ قُدَامَةَ، قَالَا: أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ، قَالَ: سَمِعْتُ أَنَسًا، يَقُولُ: قَالَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ: رَآنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَعَلَيَّ بَشَاشَةُ الْعُرْسِ، فَقُلْتُ: تَزَوَّجْتُ امْرَأَةً مِنَ الْأَنْصَارِ، فَقَالَ: «كَمْ أَصْدَقْتَهَا؟» فَقُلْتُ: نَوَاةً، وَفِي حَدِيثِ إِسْحَاقَ: مِنْ ذَهَبٍ."
      },
      {
        "id": 11059,
        "hadith_number": "3495",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkahwinan 'Abdul-Rahman dengan Harga Seberat Batu Zamrud",
        "perawi_melayu": "Anas bin Malik رضی اللہ عنہ meriwayatkan:",
        "english_text": "'Abdul-Rahman رضی اللہ عنہ married a woman for a datestone weight of gold.",
        "malay_translation": "'Abdul-Rahman رضی اللہ عنہ mengahwini seorang wanita dengan mas kahwin seberat batu zamrud.",
        "arabic_text": "وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي حَمْزَةَ، - قَالَ شُعْبَةُ وَاسْمُهُ عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَبْدِ اللَّهِ - عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ عَبْدَ الرَّحْمَنِ، تَزَوَّجَ امْرَأَةً عَلَى وَزْنِ نَوَاةٍ مِنْ ذَهَبٍ ‏.‏"
      },
      {
        "id": 11060,
        "hadith_number": "3496",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkataan Seseorang dari Anak-anak 'Abdul Rahman",
        "perawi_melayu": "Shu'ba telah meriwayatkan hadis ini dengan sanad yang sama, kecuali (perubahan ini) yang beliau katakan:",
        "english_text": "A person from among the sons of 'Abdul Rahman رضی اللہ عنہ said:",
        "malay_translation": "Seseorang daripada anak-anak 'Abdul Rahman رضي الله عنه berkata:",
        "arabic_text": "وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا وَهْبٌ، أَخْبَرَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّهُ قَالَ فَقَالَ رَجُلٌ مِنْ وَلَدِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ مِنْ ذَهَبٍ ‏."
      },
      {
        "id": 11061,
        "hadith_number": "3497",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Penaklukan Khaibar dan Perkahwinan Nabi SAW dengan Sayyidah Safiyyah",
        "perawi_melayu": "Dikisahkan daripada Anas bin Malik:",
        "english_text": "The Messenger of Allah launched a compaign against Khabar. \"We prayed Al-Ghndah (Fajr) there when it was still dark, then the prophet of Allah ﷺ rode and Talhah rode, and I was seated behind Abu Talhah (on his mount). The prophet let ﷺ let his mount run through the narrow street of Khaibar, and my knee was touching the thigh of the prophet of Allah ﷺ. The Izar slipped from the thigh of the prophet of Allah ﷺ and I could see the whiteness of the thigh of the prophet of Allah ﷺ. When he entered the town, he said: Allahu Akbar (Allah is the Greatest). Khaibar is ruined. And when we get down in the valley of a people evil is the morning of the warned ones. He repeated it thrice. In the meanwhile the people went out for their work, and said: By Allah, Muhammad (has come). Abdul-'Aziz or some of our companions said: Muhammad and the army (have come). He said: We took it (the territory of Khaibar) by force, and there were gathered the prisoners of war. There came Dihya and he said: Messenger of Allah, bestow upon me a girl from among the prisoners. He said: Go and get any girl. He made a choice for Safiyya daughter of Huyayy (bin Akhtab). There came a person to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Apostle of Allah, you have bestowed Safiyya bint Huyayy, the chief of Quraiza and al-Nadir, upon Dihya and she is worthy of you only. He said: Call him along with her. So he came along with her. When Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) saw her he said: Take any other woman from among the prisoners. He (the narrator) said: He (the Holy Prophet) then granted her emancipation and married her. Thabit said to him: Abu Hamza, how much dower did he (the Holy Prophet) give to her? He said: He granted her freedom and then married her. On the way Umm Sulaim embellished her and then sent her to him (the Holy Prophet) at night. Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) appeared as a bridegroom in the morning. He (the Holy Prophet) said: He who has anything (to eat) should bring that. Then the cloth was spread. A person came with cheese, another came with dates, and still another came with refined butter, and they prepared hais and that was the wedding feast of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌)",
        "malay_translation": "Utusan Allah melancarkan kempen menentang Khaibar. \"Kami berdoa Al-Ghndah (Subuh) di sana ketika masih gelap, kemudian Nabi SAW menunggang dan Talhah juga menunggang, dan aku duduk di belakang Abu Talhah (di atas tunggangannya). Nabi SAW membiarkan tunggangannya berlari di lorong sempit Khaibar, dan lututku menyentuh paha Nabi SAW.  Izar (pakaian) Nabi SAW terlepas dari paha Baginda, dan aku dapat melihat bahagian putih paha Baginda. Apabila Baginda memasuki kota, Baginda berseru: Allahu Akbar (Allah Maha Besar). Khaibar telah hancur. Dan ketika kami turun ke lembah suatu kaum yang tidak baik, pagi mereka membawa peringatan. Baginda mengulanginya sebanyak tiga kali. Sementara itu, penduduk keluar untuk kerja mereka, dan berkata: Demi Allah, Muhammad telah datang. Abdul-'Aziz atau beberapa sahabat kami berkata: Muhammad dan tentera telah tiba. Baginda bersabda: Kami telah merebutnya (wilayah Khaibar) dengan paksaan, dan para tawanan perang telah dikumpulkan. Dihya datang dan berkata: Utusan Allah, berikanlah seorang wanita tawanan untukku. Baginda bersabda: Pergilah dan dapatkan seorang wanita.  Beliau memilih Safiyyah binti Huyayy (bin Akhtab).  Seorang datang kepada Rasulullah SAW dan berkata: Wahai Rasulullah, engkau telah memberikan Safiyyah binti Huyayy, ketua Quraiza dan al-Nadir, kepada Dihya dan beliau layak untukmu sahaja. Baginda bersabda: Panggil dia bersama dengannya. Oleh itu, dia datang bersamanya. Ketika Rasulullah SAW melihatnya, Baginda bersabda: Ambillah wanita tawanan lain.  Beliau (perawi) berkata: Baginda (Nabi SAW) kemudian membebaskan dan mengahwininya. Thabit bertanya kepadanya: Wahai Abu Hamza, berapa hantaran yang Baginda berikan kepadanya? Beliau menjawab: Baginda membebaskan dan kemudian mengahwininya. Di perjalanan, Umm Sulaim mempercantiknya dan kemudian menghantarnya kepada Nabi SAW pada waktu malam. Utusan Allah muncul sebagai pengantin lelaki pada pagi harinya. Baginda bersabda: Siapa yang mempunyai sesuatu (makanan), bawalah itu. Kemudian kain itu dibentangkan. Seorang membawa keju, seorang lain membawa kurma, dan seorang lagi membawa mentega cair, dan mereka menyediakan hidangan, dan itu adalah jamuan pernikahan Utusan Allah SAW.",
        "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنِي ابْنَ عُلَيَّةَ - عَنْ عَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم غَزَا خَيْبَرَ قَالَ فَصَلَّيْنَا عِنْدَهَا صَلاَةَ الْغَدَاةِ بِغَلَسٍ فَرَكِبَ نَبِيُّ اللَّهِ صلى الله عليه وسلم وَرَكِبَ أَبُو طَلْحَةَ وَأَنَا رَدِيفُ أَبِي طَلْحَةَ فَأَجْرَى نَبِيُّ اللَّهِ صلى الله عليه وسلم فِي زُقَاقِ خَيْبَرَ وَإِنَّ رُكْبَتِي لَتَمَسُّ فَخِذَ نَبِيِّ اللَّهِ صلى الله عليه وسلم وَانْحَسَرَ الإِزَارُ عَنْ فَخِذِ نَبِيِّ اللَّهِ صلى الله عليه وسلم فَإِنِّي لأَرَى بَيَاضَ فَخِذِ نَبِيِّ اللَّهِ صلى الله عليه وسلم فَلَمَّا دَخَلَ الْقَرْيَةَ قَالَ ‏ ‏ اللَّهُ أَكْبَرُ خَرِبَتْ خَيْبَرُ إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ فَسَاءَ صَبَاحُ الْمُنْذَرِينَ ‏ ‏ ‏.‏ قَالَهَا ثَلاَثَ مَرَّاتٍ قَالَ وَقَدْ خَرَجَ الْقَوْمُ إِلَى أَعْمَالِهِمْ فَقَالُوا مُحَمَّدٌ وَاللَّهِ ‏.‏ قَالَ عَبْدُ الْعَزِيزِ وَقَالَ بَعْضُ أَصْحَابِنَا مُحَمَّدٌ وَالْخَمِيسُ ‏.‏ قَالَ وَأَصَبْنَاهَا عَنْوَةً وَجُمِعَ السَّبْىُ فَجَاءَهُ دِحْيَةُ فَقَالَ يَا رَسُولَ اللَّهِ أَعْطِنِي جَارِيَةً مِنَ السَّبْىِ ‏.‏ فَقَالَ ‏ ‏ اذْهَبْ فَخُذْ جَارِيَةً ‏ ‏ ‏.‏ فَأَخَذَ صَفِيَّةَ بِنْتَ حُيَىٍّ فَجَاءَ رَجُلٌ إِلَى نَبِيِّ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا نَبِيَّ اللَّهِ أَعْطَيْتَ دِحْيَةَ صَفِيَّةَ بِنْتَ حُيَىٍّ سَيِّدِ قُرَيْظَةَ وَالنَّضِيرِ مَا تَصْلُحُ إِلاَّ لَكَ ‏.‏ قَالَ ‏ ‏ ادْعُوهُ بِهَا ‏ ‏ ‏.‏ قَالَ فَجَاءَ بِهَا فَلَمَّا نَظَرَ إِلَيْهَا النَّبِيُّ صلى الله عليه وسلم قَالَ ‏ ‏ خُذْ جَارِيَةً مِنَ السَّبْىِ غَيْرَهَا ‏ ‏ ‏.‏ قَالَ وَأَعْتَقَهَا وَتَزَوَّجَهَا ‏.‏ فَقَالَ لَهُ ثَابِتٌ يَا أَبَا حَمْزَةَ مَا أَصْدَقَهَا قَالَ نَفْسَهَا أَعْتَقَهَا وَتَزَوَّجَهَا حَتَّى إِذَا كَانَ بِالطَّرِيقِ جَهَّزَتْهَا لَهُ أُمُّ سُلَيْمٍ فَأَهْدَتْهَا لَهُ مِنَ اللَّيْلِ فَأَصْبَحَ النَّبِيُّ صلى الله عليه وسلم عَرُوسًا فَقَالَ ‏ ‏ مَنْ كَانَ عِنْدَهُ شَىْءٌ فَلْيَجِئْ بِهِ ‏ ‏ قَالَ وَبَسَطَ نِطَعًا قَالَ فَجَعَلَ الرَّجُلُ يَجِيءُ بِالأَقِطِ وَجَعَلَ الرَّجُلُ يَجِيءُ بِالتَّمْرِ وَجَعَلَ الرَّجُلُ يَجِيءُ بِالسَّمْنِ فَحَاسُوا حَيْسًا ‏.‏ فَكَانَتْ وَلِيمَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏"
      },
      {
        "id": 11062,
        "hadith_number": "3498",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kebebasan Safiyyah رضي الله عنها Sebagai Hadiah Perkahwinan",
        "perawi_melayu": "Hadis ini turut diriwayatkan melalui sanad lain dengan perawi Anas رضي الله عنه",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) emancipated Safiyya رضی اللہ عنہا, and her emancipation was treated as her wedding gift, and in the hadith transmitted by Mu'adh on the authority of his father (the words are): He (the Holy Prophet) married Safiyya رضي الله عنها and bestowed her emancipation as her wedding gift.",
        "malay_translation": "Rasulullah صلی الله عليه وسلم telah memerdekakan Safiyyah رضي الله عنها, dan pembebasannya dianggap sebagai hadiah perkahwinannya.  Dalam riwayat hadith yang disampaikan oleh Mu'adh daripada bapanya (kata-katanya): Baginda (Nabi) telah menikahkan Safiyyah رضي الله عنها dan memberikan pembebasannya sebagai hadiah perkahwinannya.",
        "arabic_text": "وحَدَّثَنِي أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، عَنْ ثَابِتٍ، وَعَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسٍ، ح وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، عَنْ ثَابِتٍ، وَشُعَيْبِ بْنِ حَبْحَابٍ، عَنْ أَنَسٍ، ح وحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، وَعَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي عُثْمَانَ، عَنْ أَنَسٍ، ح وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ شُعَيْبِ بْنِ الْحَبْحَابِ، عَنْ أَنَسٍ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، وَعُمَرُ بْنُ سَعْدٍ، وَعَبْدُ الرَّزَّاقِ، جَمِيعًا عَنْ سُفْيَانَ، عَنْ يُونُسَ بْنِ عُبَيْدٍ، عَنْ شُعَيْبِ بْنِ الْحَبْحَابِ، عَنْ أَنَسٍ، كُلُّهُمْ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، «أَنَّهُ أَعْتَقَ صَفِيَّةَ، وَجَعَلَ عِتْقَهَا صَدَاقَهَا»، وَفِي حَدِيثِ مُعَاذٍ، عَنْ أَبِيهِ تَزَوَّجَ صَفِيَّةَ وَأَصْدَقَهَا عِتْقَهَا."
      },
      {
        "id": 11063,
        "hadith_number": "3499",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Dua Ganjaran untuk yang Memerdekakan dan Mengahwini Hamba Wanita",
        "perawi_melayu": "Abu Musa رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said about one who emancipated a slave woman, and then married her, that for him there are two rewards.",
        "malay_translation": "Rasulullah صلى الله عليه وسلم bersabda tentang seseorang yang memerdekakan seorang hamba perempuan, kemudian mengahwininya, bahawa baginya terdapat dua ganjaran.",
        "arabic_text": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللهِ، عَنْ مُطَرِّفٍ، عَنْ عَامِرٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الَّذِي يُعْتِقُ جَارِيَتَهُ، ثُمَّ يَتَزَوَّجُهَا: «لَهُ أَجْرَانِ."
      },
      {
        "id": 11064,
        "hadith_number": "3500",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkahwinan Nabi SAW dengan Sayyidah Safiyyah RA dan Kejadian di Khaibar",
        "perawi_melayu": "Anas bin Malik رضي الله عنه meriwayatkan:",
        "english_text": "I was sitting behind Abu Talha رضی اللہ عنہ on the Day of Khaibar and my feet touched the foot of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and we came (to the people of Khaibar) when the sun had risen and they had driven out their cattle, and had themselves come out with their axes, large baskets and hatchets, and they said: (Here come) Muhammad and the army. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Khaibar is ruined. Verily when we get down in the valley of a people, evil is the morning of the warned ones (al-Qur'an, xxxvii. 177). Allah, the Majestic and the Glorious, defeated them (the inhabitants of Khaibar), and there fell to the lot of Dihya a beautiful girl, and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) got her in exchange of seven heads, and then entrusted her to Umm Sulaim so that she might embellish her and prepare her (for marriage) with him. He (the narrator) said: He had been under the impression that he had said that so that she might spend her period of 'Iddah in her (Umm Sulaim's) house. (The woman) was Safiyya daughter of Huyayy. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) arranged the wedding feast consisting of dates, cheese, and refined butter, and pits were dug and tiers were set in them dining cloths, and there was brought cheese and refined butter, and these were placed there. And the people ate to their fill, and they said: We do not know whether he (the Holy Prophet) had married her (as a free woman), or as a slave woman. They said: If he (the Holy Prophet) would make her wear the veil, then she would be a (free married) woman, and if he would not make her wear the veil, then she should be a slave woman. When he intended to ride, he made her wear the veil and she sat on the hind part of the camel; so they came to know that he had married her. As they approached Medina, Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) drove (his ride) quickly and so we did. 'Adba' (the name of Allah's Apostle's camel) stumbled and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) fell down and she (Radrat Safiyya: also fell down. He (the Holy Prophet) stood up and covered her. Women looked towards her and said: May Allah keep away the Jewess! He (the narrator) said: I said: Aba Hamza, did Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) really fall down? He said: Yes, by Allah, he in fact fell down.",
        "malay_translation": "Aku duduk di belakang Abu Talha رضي الله عنه pada Hari Khaibar dan kakiku menyentuh kaki Rasulullah (صلی الله عليه وسلم). Kami tiba di Khaibar ketika matahari terbit dan penduduknya telah mengusir ternakan mereka serta keluar dengan kapak, bakul besar, dan beliung. Mereka berkata, \"Muhammad dan tentera telah datang!\" Rasulullah (صلی الله عليه وسلم) bersabda, \"Khaibar telah binasa.\" Sesungguhnya apabila kita turun ke lembah kaum, pagi orang-orang yang telah diberi peringatan itu amat buruk. (al-Quran, xxxvii. 177). Allah Yang Maha Agung dan Maha Mulia mengalahkan mereka (penduduk Khaibar), dan Dihya mendapatkan seorang gadis cantik. Rasulullah (صلی الله عليه وسلم) menukarnya dengan tujuh kepala, lalu menyerahkannya kepada Umm Sulaim untuk mempercantik dan menyediakannya untuk dinikahinya. Dikatakan bahwa ia (periwayat) beranggapan bahwa wanita itu akan menghabiskan tempo 'iddah di rumah Umm Sulaim. Wanita itu ialah Safiyyah binti Huyayy. Rasulullah (صلی الله عليه وسلم) mengadakan jamuan perkahwinan yang meriah dengan kurma, keju, dan mentega yang halus. Mereka menggali lubang dan meletakkan tikar, meletakkan keju dan mentega halus. Orang ramai makan dengan lazat, dan mereka berkata, \"Kami tidak tahu sama ada baginda telah menikahinya sebagai wanita merdeka atau hamba.\" Mereka berkata, \"Jika baginda menutupinya dengan tudung, maka dia akan menjadi isteri yang merdeka, dan jika baginda tidak menutupinya dengan tudung, maka dia akan menjadi hamba.\" Ketika baginda mahu menunggang, baginda menutupinya dengan tudung, dan dia duduk di atas belakang unta. Maka, mereka mengetahui bahawa baginda telah menikahinya.  Ketika mereka sampai ke Madinah, Rasulullah (صلی الله عليه وسلم) menunggang dengan cepat, dan kami pun demikian. Unta 'Adba tergelincir dan Rasulullah (صلی الله عليه وسلم) jatuh, dan dia (Safiyyah) turut terjatuh. Baginda berdiri dan menutupinya. Wanita-wanita melihat ke arahnya dan berkata, \"Semoga Allah menjaga wanita Yahudi itu!\" Periwayat berkata, \"Aku bertanya kepada Abu Hamza, \"Adakah Rasulullah (صلی الله عليه وسلم) benar-benar jatuh?\" Dia menjawab, \"Ya, demi Allah, baginda benar-benar jatuh.\"",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، قَالَ: كُنْتُ رِدْفَ أَبِي طَلْحَةَ يَوْمَ خَيْبَرَ، وَقَدَمِي تَمَسُّ قَدَمَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: فَأَتَيْنَاهُمْ حِينَ بَزَغَتِ الشَّمْسُ وَقَدْ أَخْرَجُوا مَوَاشِيَهُمْ، وَخَرَجُوا بِفُئُوسِهِمْ، وَمَكَاتِلِهِمْ، وَمُرُورِهِمْ، فَقَالُوا: مُحَمَّدٌ، وَالْخَمِيسُ، قَالَ: وَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: خَرِبَتْ خَيْبَرُ، إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ {فَسَاءَ صَبَاحُ الْمُنْذَرِينَ} [الصافات: 177] ، قَالَ: وَهَزَمَهُمُ اللهُ عَزَّ وَجَلَّ، وَوَقَعَتْ فِي سَهْمِ دِحْيَةَ جَارِيَةٌ جَمِيلَةٌ، فَاشْتَرَاهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِسَبْعَةِ أَرْؤُسٍ، ثُمَّ دَفَعَهَا إِلَى أُمِّ سُلَيْمٍ تُصَنِّعُهَا لَهُ وَتُهَيِّئُهَا - قَالَ: وَأَحْسِبُهُ قَالَ - وَتَعْتَدُّ فِي بَيْتِهَا، وَهِيَ صَفِيَّةُ بِنْتُ حُيَيٍّ، قَالَ: وَجَعَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَلِيمَتَهَا التَّمْرَ وَالْأَقِطَ وَالسَّمْنَ، فُحِصَتِ الْأَرْضُ أَفَاحِيصَ، وَجِيءَ بِالْأَنْطَاعِ، فَوُضِعَتْ فِيهَا، وَجِيءَ بِالْأَقِطِ وَالسَّمْنِ فَشَبِعَ النَّاسُ، قَالَ: وَقَالَ النَّاسُ: لَا نَدْرِي أَتَزَوَّجَهَا، أَمِ اتَّخَذَهَا أُمَّ وَلَدٍ؟ قَالُوا: إِنْ حَجَبَهَا فَهِيَ امْرَأَتُهُ، وَإِنْ لَمْ يَحْجُبْهَا فَهِيَ أُمُّ وَلَدٍ، فَلَمَّا أَرَادَ أَنْ يَرْكَبَ حَجَبَهَا، فَقَعَدَتْ عَلَى عَجُزِ الْبَعِيرِ، فَعَرَفُوا أَنَّهُ قَدْ تَزَوَّجَهَا، فَلَمَّا دَنَوْا مِنَ الْمَدِينَةِ، دَفَعَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَدَفَعْنَا، قَالَ: فَعَثَرَتِ النَّاقَةُ الْعَضْبَاءُ، وَنَدَرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَنَدَرَتْ، فَقَامَ فَسَتَرَهَا، وَقَدْ أَشْرَفَتِ النِّسَاءُ، فَقُلْنَ: أَبْعَدَ اللهُ الْيَهُودِيَّةَ، قَالَ: قُلْتُ: يَا أَبَا حَمْزَةَ، أَوَقَعَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: إِي وَاللهِ، لَقَدْ وَقَعَ حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، قَالَ: كُنْتُ رِدْفَ أَبِي طَلْحَةَ يَوْمَ خَيْبَرَ، وَقَدَمِي تَمَسُّ قَدَمَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: فَأَتَيْنَاهُمْ حِينَ بَزَغَتِ الشَّمْسُ وَقَدْ أَخْرَجُوا مَوَاشِيَهُمْ، وَخَرَجُوا بِفُئُوسِهِمْ، وَمَكَاتِلِهِمْ، وَمُرُورِهِمْ، فَقَالُوا: مُحَمَّدٌ، وَالْخَمِيسُ، قَالَ: وَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: خَرِبَتْ خَيْبَرُ، إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ {فَسَاءَ صَبَاحُ الْمُنْذَرِينَ} [الصافات: 177] ، قَالَ: وَهَزَمَهُمُ اللهُ عَزَّ وَجَلَّ، وَوَقَعَتْ فِي سَهْمِ دِحْيَةَ جَارِيَةٌ جَمِيلَةٌ، فَاشْتَرَاهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِسَبْعَةِ أَرْؤُسٍ، ثُمَّ دَفَعَهَا إِلَى أُمِّ سُلَيْمٍ تُصَنِّعُهَا لَهُ وَتُهَيِّئُهَا - قَالَ: وَأَحْسِبُهُ قَالَ - وَتَعْتَدُّ فِي بَيْتِهَا، وَهِيَ صَفِيَّةُ بِنْتُ حُيَيٍّ، قَالَ: وَجَعَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَلِيمَتَهَا التَّمْرَ وَالْأَقِطَ وَالسَّمْنَ، فُحِصَتِ الْأَرْضُ أَفَاحِيصَ، وَجِيءَ بِالْأَنْطَاعِ، فَوُضِعَتْ فِيهَا، وَجِيءَ بِالْأَقِطِ وَالسَّمْنِ فَشَبِعَ النَّاسُ، قَالَ: وَقَالَ النَّاسُ: لَا نَدْرِي أَتَزَوَّجَهَا، أَمِ اتَّخَذَهَا أُمَّ وَلَدٍ؟ قَالُوا: إِنْ حَجَبَهَا فَهِيَ امْرَأَتُهُ، وَإِنْ لَمْ يَحْجُبْهَا فَهِيَ أُمُّ وَلَدٍ، فَلَمَّا أَرَادَ أَنْ يَرْكَبَ حَجَبَهَا، فَقَعَدَتْ عَلَى عَجُزِ الْبَعِيرِ، فَعَرَفُوا أَنَّهُ قَدْ تَزَوَّجَهَا، فَلَمَّا دَنَوْا مِنَ الْمَدِينَةِ، دَفَعَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَدَفَعْنَا، قَالَ: فَعَثَرَتِ النَّاقَةُ الْعَضْبَاءُ، وَنَدَرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَنَدَرَتْ، فَقَامَ فَسَتَرَهَا، وَقَدْ أَشْرَفَتِ النِّسَاءُ، فَقُلْنَ: أَبْعَدَ اللهُ الْيَهُودِيَّةَ، قَالَ: قُلْتُ: يَا أَبَا حَمْزَةَ، أَوَقَعَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: إِي وَاللهِ، لَقَدْ وَقَعَ حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، قَالَ: كُنْتُ رِدْفَ أَبِي طَلْحَةَ يَوْمَ خَيْبَرَ، وَقَدَمِي تَمَسُّ قَدَمَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: فَأَتَيْنَاهُمْ حِينَ بَزَغَتِ الشَّمْسُ وَقَدْ أَخْرَجُوا مَوَاشِيَهُمْ، وَخَرَجُوا بِفُئُوسِهِمْ، وَمَكَاتِلِهِمْ، وَمُرُورِهِمْ، فَقَالُوا: مُحَمَّدٌ، وَالْخَمِيسُ، قَالَ: وَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: خَرِبَتْ خَيْبَرُ، إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ {فَسَاءَ صَبَاحُ الْمُنْذَرِينَ} [الصافات: 177] ، قَالَ: وَهَزَمَهُمُ اللهُ عَزَّ وَجَلَّ، وَوَقَعَتْ فِي سَهْمِ دِحْيَةَ جَارِيَةٌ جَمِيلَةٌ، فَاشْتَرَاهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِسَبْعَةِ أَرْؤُسٍ، ثُمَّ دَفَعَهَا إِلَى أُمِّ سُلَيْمٍ تُصَنِّعُهَا لَهُ وَتُهَيِّئُهَا - قَالَ: وَأَحْسِبُهُ قَالَ - وَتَعْتَدُّ فِي بَيْتِهَا، وَهِيَ صَفِيَّةُ بِنْتُ حُيَيٍّ، قَالَ: وَجَعَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَلِيمَتَهَا التَّمْرَ وَالْأَقِطَ وَالسَّمْنَ، فُحِصَتِ الْأَرْضُ أَفَاحِيصَ، وَجِيءَ بِالْأَنْطَاعِ، فَوُضِعَتْ فِيهَا، وَجِيءَ بِالْأَقِطِ وَالسَّمْنِ فَشَبِعَ النَّاسُ، قَالَ: وَقَالَ النَّاسُ: لَا نَدْرِي أَتَزَوَّجَهَا، أَمِ اتَّخَذَهَا أُمَّ وَلَدٍ؟ قَالُوا: إِنْ حَجَبَهَا فَهِيَ امْرَأَتُهُ، وَإِنْ لَمْ يَحْجُبْهَا فَهِيَ أُمُّ وَلَدٍ، فَلَمَّا أَرَادَ أَنْ يَرْكَبَ حَجَبَهَا، فَقَعَدَتْ عَلَى عَجُزِ الْبَعِيرِ، فَعَرَفُوا أَنَّهُ قَدْ تَزَوَّجَهَا، فَلَمَّا دَنَوْا مِنَ الْمَدِينَةِ، دَفَعَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَدَفَعْنَا، قَالَ: فَعَثَرَتِ النَّاقَةُ الْعَضْبَاءُ، وَنَدَرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَنَدَرَتْ، فَقَامَ فَسَتَرَهَا، وَقَدْ أَشْرَفَتِ النِّسَاءُ، فَقُلْنَ: أَبْعَدَ اللهُ الْيَهُودِيَّةَ، قَالَ: قُلْتُ: يَا أَبَا حَمْزَةَ، أَوَقَعَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: إِي وَاللهِ، لَقَدْ وَقَعَ."
      },
      {
        "id": 11065,
        "hadith_number": "3501",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kejadian Perkahwinan Baginda Nabi SAW dengan Saidatina Safiyyah",
        "perawi_melayu": "Anas bin Malik (رضي الله عنه) meriwayatkan",
        "english_text": "Safiyya (رضی اللہ عنہا) jatuh kepada Dihya (رضی اللہ عنہ) dalam rampasan perang, dan mereka memuji beliau di hadapan Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) dan berkata: Kami tidak melihat yang serupa dengannya di kalangan tawanan perang. Baginda menghantar utusan kepada Dihya (رضی اللہ عنہ) dan dia memberikan apa sahaja yang dimintanya. Kemudian Baginda mengutuskannya kepada ibuku dan meminta supaya dia menghiasi beliau. Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) kemudian keluar dari Khaibar sehingga di seberang Khaibar, Baginda berhenti dan khemah didirikan untuk Baginda. Ketika pagi, Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Siapa yang mempunyai lebihan makanan, bawalah kepada kita. Beberapa orang membawa lebihan kurma, dan yang lain lebihan bubur barli hingga menjadi timbunan yang besar. Mereka mula makan kurma dan minum air dari kolam yang berhampiran yang mempunyai air hujan. Anas (رضي الله عنه) berkata bahawa itu merupakan jamuan perkahwinan Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). Beliau berkata lagi: Kami berjalan hingga kami melihat tembok Madinah, dan kami gembira. Kami mempercepatkan tunggangan kami dan Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) juga mempercepatkan tunggangannya. Dan Saidatina Safiyyah (رضی اللہ عنہا) berada di belakangnya, dan Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) telah dudukkannya di belakangnya. Unta Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) terhuyung dan Baginda jatuh ke bawah, dan beliau juga jatuh ke bawah. Dan tiada seorang pun melihatnya, sehingga Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bangun dan menutupnya, dan kami datang kepada Baginda dan Baginda berkata: Kami tidak mengalami kecederaan. Kami memasuki Madinah dan keluar para wanita dari keluarga. Mereka melihatnya (Saidatina Safiyyah رضي الله عنها) dan mencela beliau kerana terjatuh.",
        "malay_translation": "Saidatina Safiyyah (رضي الله عنها) menjadi rampasan perang dan diberikan kepada Dihya (رضي الله عنه). Mereka memujinya di hadapan Rasulullah (صلى الله عليه وسلم) dan berkata, \"Kami tidak pernah melihat yang serupa dengannya di kalangan tawanan perang.\"  Rasulullah (صلى الله عليه وسلم) menghantar utusan kepada Dihya (رضي الله عنه) dan beliau memberikan apa yang diminta. Kemudian, Rasulullah (صلى الله عليه وسلم) mengutuskannya kepada ibu saya dan meminta beliau menghiasi beliau.  Rasulullah (صلى الله عليه وسلم) keluar dari Khaibar sehingga beliau berada di seberang Khaibar, dan khemah didirikan untuk Baginda. Pada pagi itu, Rasulullah (صلى الله عليه وسلم) bersabda, \"Sesiapa yang mempunyai lebihan makanan, bawalah kepada kami.\" Beberapa orang membawa lebihan kurma dan yang lain lebihan bubur barli sehingga menjadi timbunan yang banyak. Mereka mula makan kurma dan minum air dari kolam yang berhampiran yang berisi air hujan. Anas (رضي الله عنه) berkata bahawa ini adalah jamuan perkahwinan Rasulullah (صلى الله عليه وسلم). Beliau berkata lagi, \"Kami berjalan sehingga kami melihat tembok Madinah, dan kami gembira. Kami mempercepatkan tunggangan kami dan Rasulullah (صلى الله عليه وسلم) juga mempercepatkan tunggangannya. Saidatina Safiyyah (رضي الله عنها) berada di belakangnya, dan Rasulullah (صلى الله عليه وسلم) telah dudukkannya di belakangnya. Unta Rasulullah (صلى الله عليه وسلم) terhuyung dan Baginda jatuh ke bawah, dan beliau juga jatuh ke bawah. Tiada sesiapa yang melihat kejadian tersebut sehingga Rasulullah (صلى الله عليه وسلم) bangun dan menutupnya. Kami datang kepada Baginda dan Baginda berkata, \"Kami tidak mengalami kecederaan.\" Kami memasuki Madinah dan wanita-wanita keluar dari rumah. Mereka melihat Saidatina Safiyyah (رضي الله عنها) dan mencela beliau kerana terjatuh.",
        "arabic_text": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا سُلَيْمَانُ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، ح وحَدَّثَنِي بِهِ عَبْدُ اللهِ بْنُ هَاشِمِ بْنِ حَيَّانَ، وَاللَّفْظُ لَهُ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ ثَابِتٍ، حَدَّثَنَا أَنَسٌ قَالَ: صَارَتْ صَفِيَّةُ لِدِحْيَةَ فِي مَقْسَمِهِ، وَجَعَلُوا يَمْدَحُونَهَا عِنْدَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: وَيَقُولُونَ: مَا رَأَيْنَا فِي السَّبْيِ مِثْلَهَا، قَالَ: فَبَعَثَ إِلَى دِحْيَةَ، فَأَعْطَاهُ بِهَا مَا أَرَادَ، ثُمَّ دَفَعَهَا إِلَى أُمِّي، فَقَالَ: «أَصْلِحِيهَا»، قَالَ: ثُمَّ خَرَجَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ خَيْبَرَ، حَتَّى إِذَا جَعَلَهَا فِي ظَهْرِهِ نَزَلَ، ثُمَّ ضَرَبَ عَلَيْهَا الْقُبَّةَ، فَلَمَّا أَصْبَحَ، قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَانَ عِنْدَهُ فَضْلُ زَادٍ، فَلْيَأْتِنَا بِهِ»، قَالَ: فَجَعَلَ الرَّجُلُ يَجِيءُ بِفَضْلِ التَّمْرِ، وَفَضْلِ السَّوِيقِ، حَتَّى جَعَلُوا مِنْ ذَلِكَ سَوَادًا حَيْسًا، فَجَعَلُوا يَأْكُلُونَ مِنْ ذَلِكَ الْحَيْسِ، وَيَشْرَبُونَ مِنْ حِيَاضٍ إِلَى جَنْبِهِمْ مِنْ مَاءِ السَّمَاءِ، قَالَ: فَقَالَ أَنَسٌ: فَكَانَتْ تِلْكَ وَلِيمَةَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَيْهَا، قَالَ: فَانْطَلَقْنَا، حَتَّى إِذَا رَأَيْنَا جُدُرَ الْمَدِينَةِ هَشِشْنَا إِلَيْهَا، فَرَفَعْنَا مَطِيَّنَا، وَرَفَعَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَطِيَّتَهُ، قَالَ: وَصَفِيَّةُ خَلْفَهُ، قَدْ أَرْدَفَهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ. قَالَ: فَعَثَرَتْ مَطِيَّةُ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ. فَصُرِعَ وَصُرِعَتْ، قَالَ: فَلَيْسَ أَحَدٌ مِنَ النَّاسِ يَنْظُرُ إِلَيْهِ، وَلَا إِلَيْهَا، حَتَّى قَامَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَسَتَرَهَا، قَالَ: فَأَتَيْنَاهُ، فَقَالَ: «لَمْ نُضَرَّ»، قَالَ: فَدَخَلْنَا الْمَدِينَةَ، فَخَرَجَ جَوَارِي نِسَائِهِ يَتَرَاءَيْنَهَا وَيَشْمَتْنَ بِصَرْعَتِهَا."
      },
      {
        "id": 11066,
        "hadith_number": "3502",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Peristiwa Perkahwinan Zainab رضي الله عنها dan Kepatuhan Kepada Wahyu Allah",
        "perawi_melayu": "Anas ( رضي الله عنه) meriwayatkan:",
        "english_text": "When the 'Iddah of Zainab رضی اللہ عنہا was over, Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to Zaid to make a mention to her about him. Zaid رضی اللہ عنہ went on until he came to her and she was fermenting her flour. He (Zaid) said: As I saw her I felt in my heart an idea of her greatness so much so that I could not see towards her (simply for the fact) that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had made a mention of her. So I turned my back towards her. and I turned upon my heels, and said: Zainab, Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) has sent (me) with a message to you. She said: I do not do anything until I solicit the will of my Lord. So she stood at her place of worship and the (verse of) the Qur'an (pertaining to her marriage) were revealed, and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to her without permission. He (the narrator) said: I saw that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) served us bread and meat until it was broad day light and the people went away, but some persons who were busy in con- versation stayed on in the house after the meal. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) also went out and I also followed him, and he began to visit the apartments of his wives greeting them (with the words): As-Salamu 'alaikum, and they would say: Allah's Messenger ﷺ, how did you find your family (hadrat Zainab رضی اللہ عنہا)? He (the narrator) stated: I do not know whether I had informed him that the people had gone out or he (the Holy Prophet ﷺ) informed me (about that). He moved on until he entered the apartment, and I also went and wanted to enter (the apartment) along with him, but he threw a curtain between me and him, as (the verfes pertaining to seclusion) had been revealed, and people were instructed in what they had been instructed. Ibn Rafii had made this addition in his narration: O you who believe, enter not the houses of the Prophet unless permission is given to you for a meal, not waiting for its cooking being finished... to the words ... Allah forbears not from the truth.",
        "malay_translation": "Apabila tempoh ‘iddah Zainab رضي الله عنها berakhir, Rasulullah ﷺ menyuruh Zaid menyampaikan mesej kepadanya. Zaid رضي الله عنه menemui Zainab رضي الله عنها dan mendapati beliau sedang menguli tepung. Zaid berkata:  Seketika melihatnya, hatiku penuh dengan rasa agungnya sehingga aku tidak mampu memandangnya kerana Rasulullah ﷺ telah menyebut namanya. Lalu aku berpaling dan berkata, “Wahai Zainab, Rasulullah ﷺ telah mengutuskan aku untuk menyampaikan mesej kepadamu.” Zainab menjawab, “Aku tidak akan bertindak tanpa meminta izin dari Tuhanku.” Lalu beliau berdoa di tempat ibadahnya dan ayat al-Quran mengenai perkahwinannya diturunkan.  Rasulullah ﷺ datang menemuinya tanpa izin. (Perawi berkata): Aku melihat Rasulullah ﷺ menjamu kami roti dan daging sehingga siang menjelang dan orang ramai meninggalkan rumah. Namun beberapa orang yang masih berbual-bual terus berada di rumah selepas makan.  Rasulullah ﷺ pun keluar dan aku mengikutinya. Baginda melawat isteri-isterinya dan menyapa mereka dengan ucapan “Assalamualaikum.” Mereka menjawab, “Wahai Rasulullah ﷺ, bagaimana keadaan keluarga anda (terutamanya Zainab رضي الله عنها)?”  Aku tidak pasti sama ada aku memberitahu Rasulullah ﷺ bahawa orang ramai sudah beredar atau Rasulullah ﷺ yang memberitahu aku tentangnya. Kemudian Baginda masuk ke dalam biliknya dan aku turut ingin masuk bersamanya, tetapi Baginda mendirikan tabir di antara kami kerana ayat-ayat mengenai penjagaan privasi telah diturunkan dan manusia telah diberi arahan.  Ibn Rafii menambah dalam riwayatnya: Wahai orang-orang yang beriman, janganlah kamu memasuki rumah-rumah Nabi melainkan dengan izin untuk makan, bukan menunggu makanan dimasak…” sehingga perkataan “…Allah tidak mengabaikan kebenaran.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ، حَدَّثَنَا بَهْزٌ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا أَبُو النَّضْرِ هَاشِمُ بْنُ الْقَاسِمِ، قَالَا جَمِيعًا: حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، وَهَذَا حَدِيثُ بَهْزٍ، قَالَ: لَمَّا انْقَضَتْ عِدَّةُ زَيْنَبَ، قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِزَيْدٍ: «فَاذْكُرْهَا عَلَيَّ»، قَالَ: فَانْطَلَقَ زَيْدٌ حَتَّى أَتَاهَا وَهِيَ تُخَمِّرُ عَجِينَهَا، قَالَ: فَلَمَّا رَأَيْتُهَا عَظُمَتْ فِي صَدْرِي، حَتَّى مَا أَسْتَطِيعُ أَنْ أَنْظُرَ إِلَيْهَا، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ذَكَرَهَا، فَوَلَّيْتُهَا ظَهْرِي، وَنَكَصْتُ عَلَى عَقِبِي، فَقُلْتُ: يَا زَيْنَبُ: أَرْسَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَذْكُرُكِ، قَالَتْ: مَا أَنَا بِصَانِعَةٍ شَيْئًا حَتَّى أُوَامِرَ رَبِّي، فَقَامَتْ إِلَى مَسْجِدِهَا، وَنَزَلَ الْقُرْآنُ، وَجَاءَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَدَخَلَ عَلَيْهَا بِغَيْرِ إِذْنٍ، قَالَ، فَقَالَ: وَلَقَدْ رَأَيْتُنَا أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَطْعَمَنَا الْخُبْزَ وَاللَّحْمَ حِينَ امْتَدَّ النَّهَارُ، فَخَرَجَ النَّاسُ وَبَقِيَ رِجَالٌ يَتَحَدَّثُونَ فِي الْبَيْتِ بَعْدَ الطَّعَامِ، فَخَرَجَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَاتَّبَعْتُهُ، فَجَعَلَ يَتَتَبَّعُ حُجَرَ نِسَائِهِ يُسَلِّمُ عَلَيْهِنَّ، وَيَقُلْنَ: يَا رَسُولَ اللهِ، كَيْفَ وَجَدْتَ أَهْلَكَ؟ قَالَ: فَمَا أَدْرِي أَنَا أَخْبَرْتُهُ أَنَّ الْقَوْمَ قَدْ خَرَجُوا أَوْ أَخْبَرَنِي، قَالَ: فَانْطَلَقَ حَتَّى دَخَلَ الْبَيْتَ، فَذَهَبْتُ أَدْخُلُ مَعَهُ، فَأَلْقَى السِّتْرَ بَيْنِي وَبَيْنَهُ، وَنَزَلَ الْحِجَابُ، قَالَ: وَوُعِظَ الْقَوْمُ بِمَا وُعِظُوا بِهِ زَادَ ابْنُ رَافِعٍ فِي حَدِيثِهِ: {لَا تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلَّا أَنْ يُؤْذَنَ لَكُمْ إِلَى طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ} [الأحزاب: 53] إِلَى قَوْلِهِ {وَاللهُ لَا يَسْتَحْيِي مِنَ الْحَقِّ}."
      },
      {
        "id": 11067,
        "hadith_number": "3503",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Tidak Melihat Rasulullah SAW Memberikan Jamuan Perkahwinan Seperti dengan Zainab",
        "perawi_melayu": "Anas (رضي الله عنه) meriwayatkan:",
        "english_text": "I did not see Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) giving a wedding feast (on the marriage) of any one (of his wives) as he did in the case of (his marriage with) Zainab, for then he sacrificed a goat (on this occasion).",
        "malay_translation": "Aku tidak melihat Rasulullah SAW memberikan jamuan perkahwinan untuk sesiapa pun dari isteri-isterinya sebagaimana yang dilakukannya ketika mengahwini Zainab. Pada masa itu, baginda menyembelih seekor kambing.",
        "arabic_text": "حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، وَأَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، قَالُوا: حَدَّثَنَا حَمَّادٌ وَهُوَ ابْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، وَفِي رِوَايَةِ أَبِي كَامِلٍ: سَمِعْتُ أَنَسًا، قَالَ: مَا رَأَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَوْلَمَ عَلَى امْرَأَةٍ - وَقَالَ أَبُو كَامِلٍ: عَلَى شَيْءٍ مِنْ نِسَائِهِ - مَا أَوْلَمَ عَلَى زَيْنَبَ، فَإِنَّهُ ذَبَحَ شَاةً."
      },
      {
        "id": 11068,
        "hadith_number": "3504",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkahwinan Nabi SAW dengan Zainab رضي الله عنها: Jamuan yang Paling Baik",
        "perawi_melayu": "Anas bin Malik (رضي الله عنه) meriwayatkan:",
        "english_text": "Rasulullah SAW tidak mengadakan jamuan perkahwinan yang lebih baik daripada perkahwinan baginda dengan Zainab رضي الله عنها.  Thabit al-Bunani (salah seorang perawi) bertanya, \"Apakah yang dihidangkan dalam jamuan perkahwinan tersebut?\"  Anas رضي الله عنه menjawab, \"Baginda memberi mereka roti dan daging dengan begitu banyak sehingga para tetamu berhenti memakannya setelah kenyang.\"",
        "malay_translation": "Tidak ada jamuan perkahwinan yang lebih mulia daripada jamuan perkahwinan Rasulullah SAW dengan Zainab رضي الله عنها. Thabit al-Bunani bertanya, “Apakah yang dihidangkan dalam jamuan perkahwinan tersebut?” Anas رضي الله عنه menjawab, “Baginda memberi mereka roti dan daging dalam jumlah yang banyak sehingga para tetamu berhenti memakannya kerana kenyang.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ عَبَّادِ بْنِ جَبَلَةَ بْنِ أَبِي رَوَّادٍ، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدٌ وَهُوَ ابْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، قَالَ: سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ: «مَا أَوْلَمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى امْرَأَةٍ مِنْ نِسَائِهِ أَكْثَرَ - أَوْ أَفْضَلَ - مِمَّا أَوْلَمَ عَلَى زَيْنَبَ»، فَقَالَ ثَابِتٌ الْبُنَانِيُّ: بِمَا أَوْلَمَ؟ قَالَ: «أَطْعَمَهُمْ خُبْزًا وَلَحْمًا حَتَّى تَرَكُوهُ."
      },
      {
        "id": 11069,
        "hadith_number": "3505",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Masuk Rumah Nabiﷺ Tanpa Izinkan",
        "perawi_melayu": "Anas bin Malik رضي الله عنه melaporkan:",
        "english_text": "When Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) married Zainab bint jahsh رضی اللہ عنہا , he invited people (to the wedding feast) and they ate food. They then sat there and entered into conversation. He (the Holy Prophet ﷺ) made a stir as if he was preparing to stand up, but (the persons busy in talking) did not stand up. When he (the Holy Prophet ﷺ) saw it, he stood up and when he did so, some other persons stood up. 'Asim and Abdul-A'la in their narrations made this addition: Three (persons) sat there, and Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) came there to enter (the apartment) but he found the people sitting there. Then they stood up and went away. He said: Then I came and informed Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) that they had gone away. He (the Holy Prophet ﷺ) then came there until he entered (the apartment). I also went and was about to enter, when he hung a curtain between me and him (and it was on this occasion that) Allah, the Exalted and Majestic, revealed this verse: O you who believe, enter not the houses of the Prophet unless permission is given to you for a meal, not waiting for its cooking being finished to the (words) Surely this is serious in the sight of Allah (xxxiii. 53).",
        "malay_translation": "Apabila Rasulullah ﷺ mengahwini Zainab binti Jahsh رضي الله عنها, baginda mengundang orang ramai (untuk kenduri perkahwinan) dan mereka makan. Kemudian mereka duduk dan berbual-bual. Baginda ﷺ membuat isyarat seolah-olah ingin berdiri, tetapi (orang yang sedang berbual) tidak berdiri. Apabila baginda ﷺ melihatnya, baginda berdiri, dan apabila baginda berdiri, beberapa orang lain pun berdiri. 'Asim dan Abdul-A'la dalam riwayat mereka menambah: Ada tiga orang yang duduk di situ, dan Rasulullah ﷺ datang untuk masuk (ke dalam rumah) tetapi baginda mendapati orang ramai masih duduk di situ. Kemudian mereka berdiri dan pergi. Lalu saya datang dan memberitahu Rasulullah ﷺ bahawa mereka telah pergi. Baginda ﷺ kemudian datang hingga masuk (ke dalam rumah). Saya juga pergi dan hampir masuk, ketika baginda mendirikan tirai di antara saya dan baginda (dan pada peristiwa inilah) Allah, Yang Maha Tinggi dan Maha Mulia, menurunkan ayat ini: Wahai orang-orang yang beriman, janganlah kamu memasuki rumah-rumah Nabi melainkan apabila diizinkan untuk makan, bukan menunggu hidangan disediakan, kerana sesungguhnya perkara ini amat berat di sisi Allah (Surah Al-Ahzab, ayat 53).",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، وَعَاصِمُ بْنُ النَّضْرِ التَّيْمِيُّ، وَمُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى، كُلُّهُمْ عَنْ مُعْتَمِرٍ، وَاللَّفْظُ لِابْنِ حَبِيبٍ، حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ: سَمِعْتُ أَبِي، حَدَّثَنَا أَبُو مِجْلَزٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: «لَمَّا تَزَوَّجَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ زَيْنَبَ بِنْتَ جَحْشٍ، دَعَا الْقَوْمَ فَطَعِمُوا، ثُمَّ جَلَسُوا يَتَحَدَّثُونَ»، قَالَ: «فَأَخَذَ كَأَنَّهُ يَتَهَيَّأُ لِلْقِيَامِ، فَلَمْ يَقُومُوا، فَلَمَّا رَأَى ذَلِكَ قَامَ، فَلَمَّا قَامَ قَامَ مَنْ قَامَ مِنَ الْقَوْمِ» - زَادَ عَاصِمٌ، وَابْنُ عَبْدِ الْأَعْلَى فِي حَدِيثِهِمَا، قَالَ: فَقَعَدَ ثَلَاثَةٌ - «وَإِنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ جَاءَ لِيَدْخُلَ فَإِذَا الْقَوْمُ جُلُوسٌ، ثُمَّ إِنَّهُمْ قَامُوا فَانْطَلَقُوا»، قَالَ: «فَجِئْتُ فَأَخْبَرْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُمْ قَدِ انْطَلَقُوا»، قَالَ: فَجَاءَ حَتَّى دَخَلَ، فَذَهَبْتُ أَدْخُلُ، فَأَلْقَى الْحِجَابَ بَيْنِي وَبَيْنَهُ، قَالَ: وَأَنْزَلَ اللهُ عَزَّ وَجَلَّ {يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلَّا أَنْ يُؤْذَنَ لَكُمْ إِلَى طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ} [الأحزاب: 53] إِلَى قَوْلِهِ {إِنَّ ذَلِكُمْ كَانَ عِنْدَ اللهِ عَظِيمًا} [الأحزاب: 53"
      },
      {
        "id": 11070,
        "hadith_number": "3506",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan dan Ketetapan Hijab dalam Islam",
        "perawi_melayu": "Anas bin Malik رضي الله عنه meriwayatkan:",
        "english_text": "I was the best informed among the people pertaining to Hijab (veil and seclusion). Ubayy bin Ka'b رضی اللہ عنہ used to ask me about it. Anas (رضی اللہ عنہ) thus narrated: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) got up in the morning as a bridegroom of Zainab bint jahsh ( رضی اللہ عنہا) as he had married her at Medina. He invited people to the wedding feast after the day had well risen. There sat Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and there kept sitting along with him some persons after the people had stood up (for departure); then Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) stood up and walked on and I also walked along with him until he reached the door of the apartment of 'A'isha (رضی اللہ عنہا). He then thought that they (those who had been sitting there after meal) had gone away. So he returned and I also returned with him, but they were still sitting at their places. So he returned for the second time and I also returned until he reached the apartment of 'A'isha رضی اللہ عنہا. He again returned and I also returned and they had (by that time) stood up, and he hung a curtain between me and him (at the door of the apartment of Hadrat Zainab رضی اللہ عنہا, where he had to stay), and Allah revealed the verse pertaining to veil.",
        "malay_translation": "Aku adalah orang yang paling mengetahui mengenai hijab (tudung dan pengasingan). Ubayy bin Ka'b رضي الله عنه sering bertanya kepadaku tentangnya. Anas رضي الله عنه meriwayatkan: Rasulullah SAW bangun pagi seperti seorang pengantin lelaki Zainab binti Jahsh رضي الله عنها kerana baginda telah menikahinya di Madinah. Baginda mengundang orang ramai ke kenduri pernikahan itu setelah matahari terbit. Rasulullah SAW duduk di sana dan beberapa orang tetap duduk bersama Baginda setelah orang ramai berdiri (untuk pulang). Kemudian Rasulullah SAW bangun dan berjalan, dan aku pun berjalan bersamanya hingga sampai ke pintu bilik 'Aisyah رضي الله عنها. Baginda kemudian mengira mereka (orang-orang yang duduk di sana selepas makan) telah pergi. Maka baginda kembali, dan aku juga kembali bersamanya, tetapi mereka masih duduk di tempat duduk masing-masing. Kemudian baginda kembali untuk kali kedua, dan aku juga kembali bersamanya hingga sampai ke pintu bilik 'Aisyah رضي الله عنها. Baginda kembali lagi, dan aku juga kembali, dan mereka pada ketika itu telah berdiri, dan Baginda mendirikan tirai di antara aku dan baginda (di pintu bilik Hadrat Zainab رضي الله عنها, tempat Baginda perlu tinggal), dan Allah menurunkan ayat yang berkaitan dengan hijab.",
        "arabic_text": "وحَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِح، قَالَ ابْنُ شِهَابٍ: إِنَّ أَنَسَ بْنَ مَالِكٍ قَالَ: أَنَا أَعْلَمُ النَّاسِ بِالْحِجَابِ، لَقَدْ كَانَ أُبَيُّ بْنُ كَعْبٍ يَسْأَلُنِي عَنْهُ، قَالَ أَنَسٌ: «أَصْبَحَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَرُوسًا بِزَيْنَبَ بِنْتِ جَحْشٍ»، قَالَ: «وَكَانَ تَزَوَّجَهَا بِالْمَدِينَةِ، فَدَعَا النَّاسَ لِلطَّعَامِ بَعْدَ ارْتِفَاعِ النَّهَارِ، فَجَلَسَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَجَلَسَ مَعَهُ رِجَالٌ بَعْدَ مَا قَامَ الْقَوْمُ، حَتَّى قَامَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَمَشَى، فَمَشَيْتُ مَعَهُ حَتَّى بَلَغَ بَابَ حُجْرَةِ عَائِشَةَ، ثُمَّ ظَنَّ أَنَّهُمْ قَدْ خَرَجُوا، فَرَجَعَ وَرَجَعْتُ مَعَهُ، فَإِذَا هُمْ جُلُوسٌ مَكَانَهُمْ، فَرَجَعَ فَرَجَعْتُ الثَّانِيَةَ، حَتَّى بَلَغَ حُجْرَةَ عَائِشَةَ، فَرَجَعَ فَرَجَعَتْ، فَإِذَا هُمْ قَدْ قَامُوا، فَضَرَبَ بَيْنِي وَبَيْنَهُ بِالسِّتْرِ، وَأَنْزَلَ اللهُ آيَةَ الْحِجَابِ»."
      },
      {
        "id": 11071,
        "hadith_number": "3507",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Mengundang Tamu dan Hikmah Menjaga Kehormatan Rumah Rasulullah SAW",
        "perawi_melayu": "Anas bin Malik (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) contracted marriage and he went to his wife. My mother Umm Sulaim رضی اللہ عنہا prepared hais and placed it in an earthen vessel and said: Anas رضی اللہ عنہا , take it to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and say: My mother has sent that to you and she offers greetings to you, and says that it is a humble gift for you on our behalf, Messenger of Allah ﷺ. So I went along with it to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) and said: My mother offers you salutations, and says that it is a humble gift for you on our behalf. He said: Place it here, and then said: Go and invite on my behalf so and so and anyone whom you meet, and he even named some persons. He (Anas رضی اللہ عنہ) said: I invited whom he had named and whom I met. I (one of the narrators) said: I said to Anas رضی اللہ عنہ: How many (persons) were there? He (Anas رضی اللہ عنہ) said: They were about three hundred persons. Then Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) (said to me): Anas رضی اللہ عنہ, bring that earthen vessel. They (the guests) then began to enter until the courtyard and the apartment were fully packed. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Make a circle of ten (guests), and every person should eat from that nearest to him. They began to eat, until they ate to their fill. A group went out (after eating the food), and another group came in until all of them had eaten. He (the Holy Prophet) said to me: Anas رضی اللہ عنہ, lift it (the earthen vessel), so I lifted it, but I could not assess whether it had more (food) when I placed it (before Allah's Messenger) or when I lifted it (after the people had been served out of it). A group among them (the guests) began to talk in the house of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was sitting and his wife had been sitting with her face turned towards the wall. It was troublesome for Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), so Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) went out and greeted his wives. He then returned. When they (the guests) saw that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had returned they thought that it (their overstay) was something troublesome for him. He (the narrator) said: They hastened towards the door and all of them went out. And there came Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he hung a curtain and went in, and I was sitting in his apartment and he did not stay but for a short while. He then came to me and these verses were revealed. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came out and recited them to the people: O you who believe, enter not the houses of the Prophet unless permission is given to you for a meal, not waiting for its cooking being finished-but when you are invited, enter, and when you have taken food, disperse not seeking to listen to talk. Surely this gives the Prophet trouble , to the end of verse (xxxiii. 53). (Al-Ja'd said that Anas bin Malik  رضي الله عنه] stated: I am the first amongst the people to hear these verses), and henceforth the wives of the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) began to observe seclusion (al-hijab).",
        "malay_translation": "Rasulullah SAW telah mengahwini seorang isteri, dan baginda pergi ke rumahnya. Ibuku, Umm Sulaim رضي الله عنها, menyediakan hidangan dan meletakkannya dalam sebuah bekas tanah liat. Beliau berkata kepada Anas رضي الله عنه, \"Bawalah ini kepada Rasulullah SAW dan katakan, 'Ibuku menghantar ini dan menjemput salam kepadamu, dan ia sebagai hadiah sederhana dari kami buatmu, wahai Rasulullah SAW.'\" Maka aku membawanya kepada Rasulullah SAW dan berkata, 'Ibuku menjemput salam kepadamu dan memberikan hadiah sederhana ini buatmu dari kami.' Baginda menjawab, 'Letakkanlah di sini.' Kemudian baginda bersabda, 'Pergilah dan jemputlah si fulan dan sesiapa yang kamu temui atas namaku.' Baginda menyebut beberapa nama. Anas رضي الله عنه berkata, 'Aku telah menjemput orang-orang yang baginda sebutkan, dan mereka yang aku temui.' Aku (seorang perawi) bertanya kepada Anas رضي الله عنه, 'Berapakah jumlah mereka?' Anas رضي الله عنه menjawab, 'Kira-kira tiga ratus orang.' Kemudian Rasulullah SAW bersabda kepada aku, 'Anas رضي الله عنه, bawakan bekas tanah liat itu.' Para tetamu mula masuk sehingga halaman dan bilik rumah itu penuh sesak. Rasulullah SAW bersabda, 'Bentuklah bulatan sepuluh orang, dan setiap orang makan daripada yang terdekat dengannya.' Mereka mula makan sehingga kenyang. Sebahagian dari mereka keluar, dan sebahagian lain masuk sehingga semuanya selesai makan. Rasulullah SAW bersabda, 'Anas رضي الله عنه, angkatkan bekas itu.' Aku mengangkatnya, dan kulihat tidak ada kekurangan makanan sama ada ketika aku meletakkannya atau mengangkatnya selepas dihidangkan kepada tetamu. Ada segelintir daripada mereka berbual di dalam rumah Rasulullah SAW, manakala baginda sedang duduk. Isteri baginda duduk dengan menghadap dinding. Perkara ini menyusahkan baginda, lantas baginda keluar dan menjemput salam isterinya. Kemudian baginda kembali. Apabila mereka melihat Rasulullah SAW kembali, mereka menyangka perkara ini menyusahkan baginda. Mereka segera menuju pintu dan keluar semuanya. Kemudian Rasulullah SAW menutup dengan tirai dan masuk. Aku duduk di bilik baginda. Baginda tidak lama. Kemudian baginda datang kepadaku dan ayat-ayat al-Quran ini diturunkan. Rasulullah SAW keluar dan membacanya kepada manusia: 'Wahai orang-orang yang beriman, janganlah kamu memasuki rumah-rumah Nabi kecuali jika diizinkan untuk makan, dan janganlah kamu menunggu hingga masakannya dimasak. Apabila kamu dijemput, maka masuklah dan apabila kamu telah makan, maka beredarlah dan janganlah kamu berbual yang mengganggu Nabi.' Ini menyusahkan baginda. Akhir ayat (33:53). (Al-Ja'd berkata, Anas bin Malik رضي الله عنه telah berkata, 'Aku orang pertama yang mendengar ayat-ayat ini') sejak itu, para isteri Rasulullah SAW mula mengamalkan pengasingan (al-hijab). ",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَعْفَرٌ يَعْنِي ابْنَ سُلَيْمَانَ، عَنِ الْجَعْدِ أَبِي عُثْمَانَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: تَزَوَّجَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَدَخَلَ بِأَهْلِهِ، قَالَ: فَصَنَعَتْ أُمِّي أُمُّ سُلَيْمٍ حَيْسًا، فَجَعَلَتْهُ فِي تَوْرٍ، فَقَالَتْ: يَا أَنَسُ، اذْهَبْ بِهَذَا إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقُلْ: بَعَثَتْ بِهَذَا إِلَيْكَ أُمِّي وَهِيَ تُقْرِئُكَ السَّلَامَ، وَتَقُولُ: إِنَّ هَذَا لَكَ مِنَّا قَلِيلٌ يَا رَسُولَ اللهِ، قَالَ: فَذَهَبْتُ بِهَا إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقُلْتُ: إِنَّ أُمِّي تُقْرِئُكَ السَّلَامَ، وَتَقُولُ: إِنَّ هَذَا لَكَ مِنَّا قَلِيلٌ يَا رَسُولَ اللهِ، فَقَالَ: «ضَعْهُ»، ثُمَّ قَالَ: «اذْهَبْ، فَادْعُ لِي فُلَانًا وَفُلَانًا وَفُلَانًا، وَمَنْ لَقِيتَ»، وَسَمَّى رِجَالًا، قَالَ: فَدَعَوْتُ مَنْ سَمَّى، وَمَنْ لَقِيتُ، قَالَ: قُلْتُ لِأَنَسٍ: عَدَدَ كَمْ كَانُوا؟ قَالَ: زُهَاءَ ثَلَاثِمِائَةٍ، وَقَالَ لِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَا أَنَسُ، هَاتِ التَّوْرَ»، قَالَ: فَدَخَلُوا حَتَّى امْتَلَأَتِ الصُّفَّةُ وَالْحُجْرَةُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لِيَتَحَلَّقْ عَشَرَةٌ عَشَرَةٌ، وَلْيَأْكُلْ كُلُّ إِنْسَانٍ مِمَّا يَلِيهِ»، قَالَ: فَأَكَلُوا حَتَّى شَبِعُوا، قَالَ: فَخَرَجَتْ طَائِفَةٌ، وَدَخَلَتْ طَائِفَةٌ، حَتَّى أَكَلُوا كُلُّهُمْ، فَقَالَ لِي: «يَا أَنَسُ، ارْفَعْ»، قَالَ: فَرَفَعْتُ، فَمَا أَدْرِي حِينَ وَضَعْتُ كَانَ أَكْثَرَ، أَمْ حِينَ رَفَعْتُ، قَالَ: وَجَلَسَ طَوَائِفُ مِنْهُمْ يَتَحَدَّثُونَ فِي بَيْتِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَرَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ جَالِسٌ وَزَوْجَتُهُ مُوَلِّيَةٌ وَجْهَهَا إِلَى الْحَائِطِ، فَثَقُلُوا عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَخَرَجَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَسَلَّمَ عَلَى نِسَائِهِ، ثُمَّ رَجَعَ، فَلَمَّا رَأَوْا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَدْ رَجَعَ، ظَنُّوا أَنَّهُمْ قَدْ ثَقُلُوا عَلَيْهِ، قَالَ: فَابْتَدَرُوا الْبَابَ، فَخَرَجُوا كُلُّهُمْ، وَجَاءَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، حَتَّى أَرْخَى السِّتْرَ، وَدَخَلَ وَأَنَا جَالِسٌ فِي الْحُجْرَةِ، فَلَمْ يَلْبَثْ إِلَّا يَسِيرًا حَتَّى خَرَجَ عَلَيَّ، وَأُنْزِلَتْ هَذِهِ الْآيَةُ، فَخَرَجَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَقَرَأَهُنَّ عَلَى النَّاسِ: {يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلَّا أَنْ يُؤْذَنَ لَكُمْ إِلَى طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ وَلَكِنْ إِذَا دُعِيتُمْ فَادْخُلُوا فَإِذَا طَعِمْتُمْ فَانْتَشِرُوا وَلَا مُسْتَأْنِسِينَ لِحَدِيثٍ إِنَّ ذَلِكُمْ كَانَ يُؤْذِي النَّبِيَّ} [الأحزاب: 53] إِلَى آخِرِ الْآيَةِ قَالَ الْجَعْدُ: قَالَ أَنَسُ بْنُ مَالِكٍ: أَنَا أَحْدَثُ النَّاسِ عَهْدًا بِهَذِهِ الْآيَاتِ. وَحُجِبْنَ نِسَاءُ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 11072,
        "hadith_number": "3508",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ketetapan Rasulullah SAW Mengenai Mengundang Tetamu dan Masuk Rumahnya",
        "perawi_melayu": "Anas bin Malik رضي الله عنه meriwayatkan:",
        "english_text": "When Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) contracted marriage with Zainab (رضی اللہ عنہا), Umm Sulaim رضی اللہ عنہا sent him hats in a vessel of stone as a gift. Anas رضی اللہ عنہ stated that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to him: Go and invite on my behalf all the Muslims whom you meet. So I invited on his behalf everyone whom I met. They entered (his house) and they ate and went out. And Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had kept his hand on the food, and he invoked blessing on that, and said whatever Allah wished him to say, and none whom I met was left uninvited. They ate to their fill and went out, but a group among them remained there and was engaged in lengthy discussion. Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) felt shy of saying them anything. So he went out and left them in his house and Allah the Great and Majestic revealed this verse: 0 you who believe, enter not the houses of the Prophet unless permission is given to you for a meal, not waiting for its cooking being finished. Qatada (instead of using the word Ghaira Nazirina) used the word Ghaira Mutahayyinina (i. e. not waiting for the time of the food). But when you are invited, enter... up to this verse. This is purer for your hearts and their hearts.",
        "malay_translation": "Ketika Rasulullah SAW mengahwini Zainab رضي الله عنها, Umm Sulaim رضي الله عنها menghadiahkannya topi-topi dalam bekas batu. Anas رضي الله عنه melaporkan bahawa Rasulullah SAW bersabda kepadanya: 'Pergi dan undang semua orang Islam yang kau temui atas namaku.' Maka aku mengundang semua orang yang kutemui atas namanya. Mereka masuk (ke rumahnya), makan dan keluar. Rasulullah SAW meletakkan tangannya di atas makanan, memohon keberkatan, dan bersabda apa sahaja yang dikehendaki Allah baginya, dan tidak ada seorang pun yang kutemui yang tidak diundang. Mereka makan sehingga kenyang dan keluar, tetapi sekelompok dari mereka tinggal di situ dan terlibat dalam perbincangan yang panjang. Rasulullah SAW merasa malu untuk berkata sesuatu kepada mereka. Oleh itu, baginda keluar dan meninggalkan mereka di rumahnya, dan Allah Yang Maha Besar dan Maha Mulia menurunkan ayat ini: Wahai orang-orang yang beriman, janganlah memasuki rumah-rumah Nabi kecuali jika diizinkan untuk makan, dan janganlah menunggu makanan dimasak. Qatadah (bukan menggunakan kata Ghaira Nazirina) menggunakan perkataan Ghaira Mutahayyinina (iaitu, bukan menunggu waktu makanan dimasak). Tetapi apabila kalian diundang, masuklah… hingga ayat ini.  Hal ini lebih suci bagi hati kalian dan hati mereka.",
        "arabic_text": "وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ أَبِي عُثْمَانَ، عَنْ أَنَسٍ قَالَ: لَمَّا تَزَوَّجَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ زَيْنَبَ أَهْدَتْ لَهُ أُمُّ سُلَيْمٍ حَيْسًا فِي تَوْرٍ مِنْ حِجَارَةٍ، فَقَالَ أَنَسٌ: فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اذْهَبْ، فَادْعُ لِي مَنْ لَقِيتَ مِنَ الْمُسْلِمِينَ»، فَدَعَوْتُ لَهُ مَنْ لَقِيتُ، فَجَعَلُوا يَدْخُلُونَ عَلَيْهِ فَيَأْكُلُونَ وَيَخْرُجُونَ، وَوَضَعَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَدَهُ عَلَى الطَّعَامِ، فَدَعَا فِيهِ، وَقَالَ فِيهِ مَا شَاءَ اللهُ أَنْ يَقُولَ، وَلَمْ أَدَعْ أَحَدًا لَقِيتُهُ إِلَّا دَعَوْتُهُ، فَأَكَلُوا حَتَّى شَبِعُوا، وَخَرَجُوا وَبَقِيَ طَائِفَةٌ مِنْهُمْ، فَأَطَالُوا عَلَيْهِ الْحَدِيثَ، فَجَعَلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَسْتَحْيِي مِنْهُمْ أَنْ يَقُولَ لَهُمْ شَيْئًا، فَخَرَجَ وَتَرَكَهُمْ فِي الْبَيْتِ، فَأَنْزَلَ اللهُ عَزَّ وَجَلَّ: {يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلَّا أَنْ يُؤْذَنَ لَكُمْ إِلَى طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ} [الأحزاب: 53]- قَالَ قَتَادَةُ: غَيْرَ مُتَحَيِّنِينَ طَعَامًا {وَلَكِنْ إِذَا دُعِيتُمْ فَادْخُلُوا} [الأحزاب: 53] حَتَّى بَلَغَ {ذَلِكُمْ أَطْهَرُ لِقُلُوبِكُمْ وَقُلُوبِهِنَّ} [الأحزاب: 53"
      },
      {
        "id": 11073,
        "hadith_number": "3509",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Menghadiri Jamuan Sekiranya Diundang",
        "perawi_melayu": "Ibn Umar (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: When any one of you is invited to a feast, he should attend it.",
        "malay_translation": "Rasulullah صلى الله عليه وسلم bersabda: Apabila seseorang dari kalangan kamu dijemput ke kenduri, hendaklah dia hadir.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا دُعِيَ أَحَدُكُمْ إِلَى الْوَلِيمَةِ فَلْيَأْتِهَا."
      },
      {
        "id": 11074,
        "hadith_number": "3510",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Mengakui Jemputan Jamuan",
        "perawi_melayu": "Ibn 'Umar (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Apabila seseorang daripada kamu dijemput ke suatu jamuan, hendaklah dia menerimanya. 'Ubaidallah menganggap jamuan tersebut sebagai jamuan perkahwinan.",
        "malay_translation": "Rasulullah SAW bersabda, \"Apabila seseorang di antara kamu dijemput ke suatu jamuan, hendaklah dia menerimanya.\" 'Ubaidallah memahami jamuan tersebut sebagai jamuan perkahwinan.",
        "arabic_text": ") وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، عَنْ عُبَيْدِ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا دُعِيَ أَحَدُكُمْ إِلَى الْوَلِيمَةِ، فَلْيُجِبْ»، قَالَ خَالِدٌ: فَإِذَا عُبَيْدُ اللهِ يُنَزِّلُهُ عَلَى الْعُرْسِ."
      },
      {
        "id": 11075,
        "hadith_number": "3511",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Menerima Jemputan Perkahwinan",
        "perawi_melayu": "Ibn Umar (رضي الله عنه)",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) having said this: When any one of you is invited to a wedding feast, he should accept that.",
        "malay_translation": "Rasulullah (ﷺ) bersabda:  Apabila seseorang dari kalian dijemput ke kenduri perkahwinan, dia harus menerimanya.",
        "arabic_text": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا دُعِيَ أَحَدُكُمْ إِلَى وَلِيمَةِ عُرْسٍ، فَلْيُجِبْ»."
      },
      {
        "id": 11076,
        "hadith_number": "3512",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Menerima Jamuan yang Dihidangkan",
        "perawi_melayu": "Ibnu Umar (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger (ﷺ) having said this: Accept the feast, when you are invited.",
        "malay_translation": "Rasulullah SAW bersabda: Terimalah jamuan apabila kamu dijemput.",
        "arabic_text": "حَدَّثَنِي أَبُو الرَّبِيعِ، وَأَبُو كَامِلٍ، قَالَ: حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، ح وحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «ائْتُوا الدَّعْوَةَ إِذَا دُعِيتُمْ»."
      },
      {
        "id": 11077,
        "hadith_number": "3513",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Mengundang Saudaranya - Menghadiahkan Jamuan",
        "perawi_melayu": "Ibn Umar (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Apabila seseorang di antara kamu mengundang saudaranya, hendaklah ia (yang diundang) menerima jamuan kenduri atau seumpamanya.",
        "malay_translation": "Rasulullah SAW bersabda: Apabila salah seorang di antara kamu mengundang saudaranya, hendaklah ia (yang diundang) menerima jamuan kenduri atau seumpamanya.",
        "arabic_text": "وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، كَانَ يَقُولُ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا دَعَا أَحَدُكُمْ أَخَاهُ، فَلْيُجِبْ عُرْسًا كَانَ أَوْ نَحْوَهُ»."
      },
      {
        "id": 11078,
        "hadith_number": "3514",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Penerimaan Jemputan Majlis Perkahwinan atau Seumpamanya",
        "perawi_melayu": "Ibn 'Umar (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said: He who is invited to a wedding feast or like it, he should accept it.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Barangsiapa dijemput ke majlis kenduri kahwin atau yang seumpamanya, hendaklah dia menerimanya.",
        "arabic_text": "وحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنِي عِيسَى بْنُ الْمُنْذِرِ، حَدَّثَنَا بَقِيَّةُ، حَدَّثَنَا الزُّبَيْدِيُّ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ دُعِيَ إِلَى عُرْسٍ أَوْ نَحْوِهِ، فَلْيُجِبْ."
      },
      {
        "id": 11079,
        "hadith_number": "3515",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Mengundang Jemputan",
        "perawi_melayu": "Abdullah bin Umar (رضي الله عنهما) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Datanglah ke majlis kenduri, apabila kamu dijemput.",
        "malay_translation": "Rasulullah SAW bersabda: Datanglah ke majlis kenduri, apabila kamu dijemput.",
        "arabic_text": "حَدَّثَنِي حُمَيْدُ بْنُ مَسْعَدَةَ الْبَاهِلِيُّ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أُمَيَّةَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «ائْتُوا الدَّعْوَةَ إِذَا دُعِيتُمْ."
      },
      {
        "id": 11080,
        "hadith_number": "3516",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Menerima Jamuan Ketika Diundang",
        "perawi_melayu": "Nafi melaporkan:",
        "english_text": "I heard Abdullah bin Umar ( رضی اللہ عنہ) narrating that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Accept the feast when you are invited to it. And Abdullah (bin Umar رضی اللہ عنہ ) used to come to the feast, whether it was a wedding feast or other than that, and he would come there even in the state of fasting.",
        "malay_translation": "Saya mendengar Abdullah bin Umar (رضي الله عنه) meriwayatkan bahawa Rasulullah (صلي الله عليه وسلم) bersabda: Terimalah jamuan apabila kamu dijemput. Dan Abdullah (bin Umar رضي الله عنه) selalu datang ke majlis jamuan, sama ada ia adalah kenduri kahwin atau selainnya, dan dia akan datang ke sana walaupun dalam keadaan berpuasa.",
        "arabic_text": "وحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللهِ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، قَالَ: سَمِعْتُ عَبْدَ اللهِ بْنَ عُمَرَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَجِيبُوا هَذِهِ الدَّعْوَةَ إِذَا دُعِيتُمْ لَهَا»، قَالَ: «وَكَانَ عَبْدُ اللهِ بْنُ عُمَرَ يَأْتِي الدَّعْوَةَ فِي الْعُرْسِ، وَغَيْرِ الْعُرْسِ، وَيَأْتِيهَا وَهُوَ صَائِمٌ»."
      },
      {
        "id": 11081,
        "hadith_number": "3517",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Mengterima Jemputan Jamuan, Walau Sederhana",
        "perawi_melayu": "Ibn Umar (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said: When you are invited to a feast (even though it is) the leg of the sheep, you should accept it.",
        "malay_translation": "Rasulullah SAW bersabda: Sekiranya kamu dijemput ke suatu jamuan, walau sekadar kaki kambing, wajib menerimanya.",
        "arabic_text": "وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، حَدَّثَنِي عُمَرُ بْنُ مُحَمَّدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «إِذَا دُعِيتُمْ إِلَى كُرَاعٍ، فَأَجِيبُوا."
      },
      {
        "id": 11082,
        "hadith_number": "3518",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Mengakui Jemputan Jamuan dan Kebebasan Makan",
        "perawi_melayu": "Jabir (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger (ﷺ) said: When any one of you is invited to a feast, he should accept it. He may eat if he likes, or he may abandon (eating) if he likes. Ibn Mathanni did not make mention of the word feast .",
        "malay_translation": "Pesuruhjaya Allah (ﷺ) bersabda: Apabila sesiapa di antara kamu dijemput ke suatu jamuan, dia hendaklah menerimanya. Dia boleh makan jika dia suka, atau dia boleh meninggalkannya jika dia suka. Ibn Mathanni tidak menyebut perkataan jamuan.",
        "arabic_text": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، قَالَا: حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا دُعِيَ أَحَدُكُمْ إِلَى طَعَامٍ، فَلْيُجِبْ، فَإِنْ شَاءَ طَعِمَ، وَإِنْ شَاءَ تَرَكَ»، وَلَمْ يَذْكُرِ ابْنُ الْمُثَنَّى: «إِلَى طَعَامٍ."
      },
      {
        "id": 11083,
        "hadith_number": "3519",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis yang Sama dengan Rantaian Perawi yang Sama",
        "perawi_melayu": "Abu Zubair",
        "english_text": "A hadith like this has been narrated on the authority of Abu Zubair with the same chain of transmitters.",
        "malay_translation": "Satu hadis seperti ini telah diriwayatkan daripada Abu Zubair dengan sanad yang sama.",
        "arabic_text": "وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ بِهَذَا الْإِسْنَادِ، بِمِثْلِهِ."
      },
      {
        "id": 11084,
        "hadith_number": "3520",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Penerimaan Jemputan dan Doa Bagi Orang Berpuasa dan Tidak Berpuasa",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: If any one of you is invited, he should accept (the invitation). In case he is fasting, he should pray (in order to bless the inmates of the house), and if he is not fasting he should eat.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Sekiranya salah seorang daripada kamu dijemput, hendaklah ia menerima jemputan tersebut. Jika dia berpuasa, hendaklah dia berdoa (untuk keberkatan penghuni rumah), dan jika dia tidak berpuasa, hendaklah dia makan.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ هِشَامٍ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا دُعِيَ أَحَدُكُمْ، فَلْيُجِبْ، فَإِنْ كَانَ صَائِمًا، فَلْيُصَلِّ، وَإِنْ كَانَ مُفْطِرًا، فَلْيَطْعَمْ»."
      },
      {
        "id": 11085,
        "hadith_number": "3521",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Jenis Makanan Paling Tercela: Jamuan Perkahwinan Yang Mengabaikan Orang Miskin",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) pernah berkata:",
        "english_text": "The worst kind of food is the wedding feast to which the rich are invited and the poor are ignored. He who does not come to the feast, he in fact disobeys Allah and His Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
        "malay_translation": "Jenis makanan yang paling tercela ialah jamuan perkahwinan yang mengundang golongan kaya dan mengabaikan golongan miskin. Seseorang yang tidak hadir ke jamuan itu, sebenarnya telah menderhaka kepada Allah dan Rasul-Nya (صلی الله عليه وسلم).",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ كَانَ يَقُولُ: «بِئْسَ الطَّعَامُ طَعَامُ الْوَلِيمَةِ، يُدْعَى إِلَيْهِ الْأَغْنِيَاءُ وَيُتْرَكُ الْمَسَاكِينُ، فَمَنْ لَمْ يَأْتِ الدَّعْوَةَ، فَقَدْ عَصَى اللهَ وَرَسُولَهُ."
      },
      {
        "id": 11086,
        "hadith_number": "3522",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ketidakpuasan Hati terhadap Makanan di Perjamuan Kaya",
        "perawi_melayu": "Sufyan melaporkan:",
        "english_text": "I said to Zuhri: Abu Bakr, what does this hadith mean: The worst kind of food is at a wedding feast of the rich ? He laughed and said: The food served in the feast given by the rich is not worst (in itself). Sufyan said: My father was rich, so I felt disturbed when I heard this hadith, so I asked Zuhri who said: I heard from 'Abdul-Rahman al-Alraj that he heard Abu Huraira (رضی اللہ عنہ) say: The worst kind of food is that served at the wedding feast. The rest of the hadith is the same.",
        "malay_translation": "Saya berkata kepada Zuhri: Abu Bakar, apakah maksud hadis ini: Makanan paling buruk adalah di majlis perkahwinan orang kaya? Dia ketawa dan berkata: Makanan yang dihidangkan dalam jamuan orang kaya bukanlah yang terburuk (pada asasnya). Sufyan berkata: Bapa saya kaya, maka saya merasa terganggu ketika mendengar hadis ini, jadi saya bertanya kepada Zuhri yang berkata: Saya mendengar daripada 'Abdul-Rahman al-Alraj bahawa dia mendengar Abu Hurairah (رضی اللہ عنہ) berkata: Makanan paling buruk adalah yang dihidangkan di majlis perkahwinan.  Bahagian lain hadis ini sama.",
        "arabic_text": "وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، قَالَ: قُلْتُ لِلزُّهْرِيِّ: يَا أَبَا بَكْرٍ، كَيْفَ هَذَا الْحَدِيثُ: شَرُّ الطَّعَامِ طَعَامُ الْأَغْنِيَاءِ؟ فَضَحِكَ، فَقَالَ: لَيْسَ هُوَ شَرُّ الطَّعَامِ طَعَامُ الْأَغْنِيَاءِ، قَالَ سُفْيَانُ: وَكَانَ أَبِي غَنِيًّا، فَأَفْزَعَنِي هَذَا الْحَدِيثُ حِينَ سَمِعْتُ بِهِ، فَسَأَلْتُ عَنْهُ الزُّهْرِيَّ، فَقَالَ: حَدَّثَنِي عَبْدُ الرَّحْمَنِ الْأَعْرَجُ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: شَرُّ الطَّعَامِ طَعَامُ الْوَلِيمَةِ، ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ مَالِكٍ."
      },
      {
        "id": 11087,
        "hadith_number": "3523",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Makanan Perayaan Yang Paling Tercela",
        "perawi_melayu": "Dikisahkan bahawa Abu Hurairah (رضي الله عنه) berkata:",
        "english_text": "The worst of food is the food of a (wedding) feast..\" a hadith like that of Malik.",
        "malay_translation": "Makanan yang paling tercela adalah makanan kenduri kahwin…\" hadis yang seperti hadis Malik.",
        "arabic_text": "وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، عَنْ عَبْدِ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، وَعَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: شَرُّ الطَّعَامِ طَعَامُ الْوَلِيمَةِ نَحْوَ حَدِيثِ مَالِكٍ، وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، نَحْوَ ذَلِكَ."
      },
      {
        "id": 11088,
        "hadith_number": "3524",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis yang serupa dengannya diriwayatkan oleh Abu Hurairah رضي الله عنه",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "A hadith like this has been narrated by Abu Huraira (رضی اللہ عنہ) through another chain of transmitters.",
        "malay_translation": "Sebuah hadis yang serupa dengannya telah diriwayatkan oleh Abu Hurairah رضي الله عنه melalui sanad yang lain.",
        "arabic_text": "وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، نَحْوَ ذَلِكَ."
      },
      {
        "id": 11089,
        "hadith_number": "3525",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Makanan Terburuk pada Jamuan Perkahwinan",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying. The worst kind of food is at the wedding feast from which one who comes is turned away, and he who refuses it is invited, and he who did not accept the invitation disobeyed Allah and His Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
        "malay_translation": "Rasulullah SAW bersabda, “Jenis makanan yang paling tercela adalah makanan pada jamuan perkahwinan di mana seseorang yang datang ditolak, dan orang yang menolak jemputan itu dijemput, dan orang yang tidak menerima jemputan itu telah menderhaka kepada Allah dan Rasul-Nya SAW.”",
        "arabic_text": "وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، قَالَ: سَمِعْتُ زِيَادَ بْنَ سَعْدٍ، قَالَ: سَمِعْتُ ثَابِتًا الْأَعْرَجَ، يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «شَرُّ الطَّعَامِ طَعَامُ الْوَلِيمَةِ، يُمْنَعُهَا مَنْ يَأْتِيهَا، وَيُدْعَى إِلَيْهَا مَنْ يَأْبَاهَا، وَمَنْ لَمْ يُجِبِ الدَّعْوَةَ، فَقَدْ عَصَى اللهَ وَرَسُولَهُ»."
      },
      {
        "id": 11090,
        "hadith_number": "3526",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perempuan yang Bercerai dan Mencari Kembali Suaminya",
        "perawi_melayu": "Aisyah رضي الله عنها meriwayatkan:",
        "english_text": "There came the wife of Rifa'a to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: I was married to Rifa'a but he divorced me, making may divorce irrevocable. Afterwards I married Abdul-Rahman bin al-Zubair, but all he possesses is like the fringe of a garment (i.e. he is sexually weak). Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) smiled, and said: Do you wish to return to Rifa'a. (You) cannot (do it) until you have tasted his sweetness and he ('Abdul-Rahman) has tasted your sweetness. Abu Bakr رضي الله عنه was at that time near him (the Holy Prophet) and Khalid (bin Sa'id) رضي الله عنه was at the door waiting for the permission to be granted to him to enter), He (Khalid) said; Abu Bakr رضي الله عنه , do you hear what she is saying loudly in the presence of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ )?",
        "malay_translation": "Seorang isteri Rifa'a datang menemui Rasulullah SAW dan berkata: Saya telah berkahwin dengan Rifa'a, tetapi dia menceraikan saya dengan talak tiga. Kemudian saya berkahwin dengan Abdul Rahman bin al-Zubair, tetapi kekuatannya adalah seperti benang kain (iaitu lemah). Baginda Rasulullah SAW tersenyum dan bersabda: Adakah engkau mahu kembali kepada Rifa'a? Engkau tidak boleh melakukannya sehingga engkau merasakan nikmatnya bersama Rifa'a dan dia juga merasai nikmatmu. Pada waktu itu, Abu Bakar رضي الله عنه berada di dekat Baginda Rasulullah SAW dan Khalid bin Said رضي الله عنه berada di pintu, menunggu keizinan untuk masuk. Khalid berkata: Wahai Abu Bakar رضي الله عنه, adakah engkau mendengar apa yang dia katakan dengan kuat di hadapan Rasulullah SAW?",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَاللَّفْظُ لِعَمْرٍو، قَالَا: حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ: جَاءَتِ امْرَأَةُ رِفَاعَةَ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَتْ: كُنْتُ عِنْدَ رِفَاعَةَ، فَطَلَّقَنِي، فَبَتَّ طَلَاقِي، فَتَزَوَّجْتُ عَبْدَ الرَّحْمَنِ بْنَ الزَّبِيرِ، وَإِنَّ مَا مَعَهُ مِثْلُ هُدْبَةِ الثَّوْبِ، فَتَبَسَّمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «أَتُرِيدِينَ أَنْ تَرْجِعِي إِلَى رِفَاعَةَ؟ لَا، حَتَّى تَذُوقِي عُسَيْلَتَهُ، وَيَذُوقَ عُسَيْلَتَكِ»، قَالَتْ وَأَبُو بَكْرٍ عِنْدَهُ وَخَالِدٌ بِالْبَابِ يَنْتَظِرُ أَنْ يُؤْذَنَ لَهُ، فَنَادَى: يَا أَبَا بَكْرٍ، أَلَا تَسْمَعُ هَذِهِ مَا تَجْهَرُ بِهِ عِنْدَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 11091,
        "hadith_number": "3527",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perceraian dan Perkahwinan Semula: Nasihat Rasulullah SAW",
        "perawi_melayu": "Aisyah رضي الله عنها, isteri Rasulullah SAW, meriwayatkan:",
        "english_text": "Rifa'a al-Quraid (Allah be pleased with him) divorced his wife, making her divorce irrevocable. Afterwards she married Abd at-Rahman b. al-Zubair (Allah be pleased with him), She came to Allah's Apostle (may peace be upon him and said to Allah's messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) that she had been the wife of Rifa'a (Allah be pleased with him) and he had divorced her by three pronouncements and afterwards she married 'Abdul-Rahman bin al-Zubair. By Allah, all he possesses is like the fringe of a garment, and she took hold of the fringe of her garment. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) laughed and said: Perhaps you wish to return to Rifa'a, (but you) cannot (do it) until he has tasted your sweetness and you have tasted his sweetness. Abu Bakr al-siddiq (رضی اللہ عنہ) was sitting at that time with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and Khalid bin Sa'id bin al-'As (رضی اللہ عنہ) was sitting at the door of his apartment and he was not permitted to (enter the room), and Kbalid called loudly saying: Abu Bakr رضی اللہ عنہ , why don't you scold her for what she is saying loudly in the presence of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌)?",
        "malay_translation": "Rifa'ah al-Quraidhi (رضي الله عنه) menceraikan isterinya, menjadikan cerainya sebagai talak tiga. Kemudian, beliau berkahwin dengan Abd al-Rahman bin al-Zubair (رضي الله عنه).  Isteri tersebut menghadap Rasulullah SAW dan menceritakan bahawa beliau telah menjadi isteri Rifa'ah (رضي الله عنه) dan beliau telah menceraikannya sebanyak tiga kali, kemudian berkahwin dengan 'Abdul-Rahman bin al-Zubair. Demi Allah, semua yang dimiliki olehnya adalah seperti tepi kain, dan beliau memegang tepi kain tersebut.  Lalu Rasulullah SAW tertawa dan bersabda: Mungkin engkau ingin kembali kepada Rifa'ah, namun engkau tidak dapat melakukannya sehingga engkau merasakan manisnya hidup bersamanya dan dia merasakan manisnya hidup denganmu.  Pada waktu itu, Abu Bakar al-Siddiq (رضي الله عنه) sedang duduk bersama Rasulullah SAW dan Khalid bin Said bin al-'As (رضي الله عنه) sedang duduk di pintu rumahnya dan tidak diizinkan masuk. Khalid pun memanggil dengan suara lantang, \"Wahai Abu Bakar (رضي الله عنه), mengapa engkau tidak menegurnya atas apa yang dibicarakannya dengan lantang di hadapan Rasulullah SAW?\".",
        "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، وَاللَّفْظُ لِحَرْمَلَةَ، قَالَ أَبُو الطَّاهِرِ: حَدَّثَنَا، وَقَالَ حَرْمَلَةُ: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَتْهُ، أَنَّ رِفَاعَةَ الْقُرَظِيَّ طَلَّقَ امْرَأَتَهُ، فَبَتَّ طَلَاقَهَا، فَتَزَوَّجَتْ بَعْدَهُ عَبْدَ الرَّحْمَنِ بْنَ الزَّبِيرِ، فَجَاءَتِ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ: يَا رَسُولَ اللهِ، إِنَّهَا كَانَتْ تَحْتَ رِفَاعَةَ، فَطَلَّقَهَا آخِرَ ثَلَاثِ تَطْلِيقَاتٍ، فَتَزَوَّجْتُ بَعْدَهُ عَبْدَ الرَّحْمَنِ بْنَ الزَّبِيرِ، وَإِنَّهُ وَاللهِ، مَا مَعَهُ إِلَّا مِثْلُ الْهُدْبَةِ، وَأَخَذَتْ بِهُدْبَةٍ مِنْ جِلْبَابِهَا، قَالَ: فَتَبَسَّمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ضَاحِكًا، فَقَالَ: «لَعَلَّكِ تُرِيدِينَ أَنْ تَرْجِعِي إِلَى رِفَاعَةَ، لَا، حَتَّى يَذُوقَ عُسَيْلَتَكِ، وَتَذُوقِي عُسَيْلَتَهُ»، وَأَبُو بَكْرٍ الصِّدِّيقُ جَالِسٌ عِنْدَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَخَالِدُ بْنُ سَعِيدِ بْنِ الْعَاصِ جَالِسٌ بِبَابِ الْحُجْرَةِ، لَمْ يُؤْذَنْ لَهُ، قَالَ: فَطَفِقَ خَالِدٌ يُنَادِي أَبَا بَكْرٍ: أَلَا تَزْجُرُ هَذِهِ عَمَّا تَجْهَرُ بِهِ عِنْدَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 11092,
        "hadith_number": "3528",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perceraian dan Perkahwinan Semula",
        "perawi_melayu": "`Aisyah (رضي الله عنها) meriwayatkan:",
        "english_text": "Rifa`a al Qurazi divorced his wife and afterwards `Abd al-Rahman b. al-Zubair married her. She came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Messenger of Allah, Rifa`a has divorced me by three pronouncements. (The rest of the hadith is the same.)",
        "malay_translation": "Rifa`a al-Qurazi menceraikan isterinya, dan kemudiannya `Abd al-Rahman bin al-Zubair mengahwininya. Wanita itu datang kepada Rasulullah (صلی الله عليه وسلم) dan berkata, \"Wahai Rasulullah, Rifa`a telah menceraikan saya sebanyak tiga kali.\" (Selebihnya hadith sama.)",
        "arabic_text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ رِفَاعَةَ الْقُرَظِيَّ طَلَّقَ امْرَأَتَهُ، فَتَزَوَّجَهَا عَبْدُ الرَّحْمَنِ بْنُ الزَّبِيرِ، فَجَاءَتِ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَتْ: يَا رَسُولَ اللهِ، إِنَّ رِفَاعَةَ طَلَّقَهَا آخِرَ ثَلَاثِ تَطْلِيقَاتٍ، بِمِثْلِ حَدِيثِ يُونُسَ."
      },
      {
        "id": 11093,
        "hadith_number": "3529",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kehalalan Perkahwinan Semula Selepas Cerai",
        "perawi_melayu": "Aisyah رضي الله عنها meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was asked about a woman whom a man married and then divorced her, and then she married (another) person, and she was divorced before sexual intercourse with her, whether it was lawful for her first husband (to marry her in this state). He (the Holy Prophet ﷺ) said: No, until he has tasted her sweetness.",
        "malay_translation": "Rasulullah صلى الله عليه وسلم ditanya tentang seorang wanita yang dinikahi seorang lelaki, kemudian dicerai, dan kemudian dinikahi orang lain, serta dicerai sebelum berlaku persetubuhan. Adakah halal bagi suaminya yang pertama untuk menikahinya dalam keadaan ini? Baginda صلى الله عليه وسلم bersabda: Tidak, sehingga dia merasai nikmatnya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ الْهَمْدَانِيُّ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنِ الْمَرْأَةِ يَتَزَوَّجُهَا الرَّجُلُ، فَيُطَلِّقُهَا فَتَتَزَوَّجُ رَجُلًا، فَيُطَلِّقُهَا قَبْلَ أَنْ يَدْخُلَ بِهَا، أَتَحِلُّ لِزَوْجِهَا الْأَوَّلِ؟ قَالَ: «لَا، حَتَّى يَذُوقَ عُسَيْلَتَهَا."
      },
      {
        "id": 11094,
        "hadith_number": "3530",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis yang Disampaikan dengan Sanad yang Sama",
        "perawi_melayu": null,
        "english_text": "A hadith like this has been narrated on the authority of Hisham with the same chain of transmitters.",
        "malay_translation": "Hadis seperti ini telah diriwayatkan dengan sanad yang sama daripada Hisham.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ فُضَيْلٍ، ح وحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، جَمِيعًا عَنْ هِشَامٍ بِهَذَا الْإِسْنَادِ."
      },
      {
        "id": 11095,
        "hadith_number": "3531",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Perkahwinan Semula sebelum Kekasih Kedua Mencicipi Kenikmatan Perkahwinan",
        "perawi_melayu": "Aisyah (رضي الله عنها) meriwayatkan:",
        "english_text": "A person divorced his wife by three pronouncements; then another person married her and he also divorced her without having sexual intercourse with her. Then the first husband of her intended to remarry her. It was about such a case that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was asked, whereupon he said: No, until the second one has tasted her sweetness as the first one had tasted.",
        "malay_translation": "Seseorang menceraikan isterinya sebanyak tiga kali; kemudian orang lain mengahwininya dan juga menceraikannya tanpa melakukan hubungan intim dengannya. Kemudian suami pertamanya berhasrat untuk mengahwininya semula. Hal ini ditanyakan kepada Rasulullah (ﷺ), lalu baginda bersabda: Tidak boleh, sehingga yang kedua merasakan kenikmatan (hubungan) seperti yang pertama merasainya.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ عُبَيْدِ اللهِ بْنِ عُمَرَ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، قَالَتْ: طَلَّقَ رَجُلٌ امْرَأَتَهُ ثَلَاثًا، فَتَزَوَّجَهَا رَجُلٌ، ثُمَّ طَلَّقَهَا قَبْلَ أَنْ يَدْخُلَ بِهَا، فَأَرَادَ زَوْجُهَا الْأَوَّلُ أَنْ يَتَزَوَّجَهَا، فَسُئِلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ، فَقَالَ: «لَا، حَتَّى يَذُوقَ الْآخِرُ مِنْ عُسَيْلَتِهَا مَا ذَاقَ الْأَوَّلُ»."
      },
      {
        "id": 11096,
        "hadith_number": "3532",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Samadan dengan Hadis Nombor 3522 dari Ubidullah",
        "perawi_melayu": null,
        "english_text": "A similar report (as no. 3522) was narrated with this Hadith from Ubidullah.",
        "malay_translation": "Satu laporan yang serupa (seperti no. 3522) telah diriwayatkan dengan Hadis ini daripada Ubidullah.",
        "arabic_text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، ح وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ، جَمِيعًا عَنْ عُبَيْدِ اللهِ، بِهَذَا الْإِسْنَادِ مِثْلَهُ، وَفِي حَدِيثِ يَحْيَى: عَنْ عُبَيْدِ اللهِ، حَدَّثَنَا الْقَاسِمُ، عَنْ عَائِشَةَ."
      },
      {
        "id": 11097,
        "hadith_number": "3533",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Doa Sebelum Berhubungan Suami Isteri dan Keselamatan Anak yang Akan Dikurniakan",
        "perawi_melayu": "Ibnu Abbas meriwayatkan:",
        "english_text": "\"The Messenger of Allah said: 'If one of you says, when he wants to have intercourse with his wife, \"Bismilla, Allahumah! jannibnash-Shaitana ma razaqtana. (In the name of Allah, O Allah, keep the Shaitan away from us and keep the Shaitan away from that with which you provide us, then if it is decreed that they should have a child from that, the Shaitan will never harm him.\"",
        "malay_translation": "\"Rasulullah SAW bersabda, ‘Jika salah seorang di antara kamu, apabila ingin melakukan hubungan intim dengan isterinya, membaca: Bismillah, Allahumma jannibna ash-Shaytān, wa jannib ash-Shaytān ma razaqtana (Dengan nama Allah, Ya Allah, jauhkanlah kami dari Syaitan dan jauhkanlah Syaitan dari rezeki yang Engkau kurniakan kepada kami), maka jika ditakdirkan mereka akan dikurniakan anak dari perhubungan itu, Syaitan tidak akan membahayakannya.’\"",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لِيَحْيَى - قَالاَ أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ سَالِمٍ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَوْ أَنَّ أَحَدَهُمْ إِذَا أَرَادَ أَنْ يَأْتِيَ أَهْلَهُ قَالَ بِاسْمِ اللَّهِ اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا فَإِنَّهُ إِنْ يُقَدَّرْ بَيْنَهُمَا وَلَدٌ فِي ذَلِكَ لَمْ يَضُرَّهُ شَيْطَانٌ أَبَدًا ‏\"‏‏.‏"
      },
      {
        "id": 11098,
        "hadith_number": "3534",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perbezaan dalam Riwayat Hadis Berkaitan Permulaan dengan 'Bismillah'",
        "perawi_melayu": null,
        "english_text": "A hadith similar to that of Jarir (no. 3533) was narrated from Mansur, except that in the hadith of Shubah it does not mention the words \"In the name of Allah.\" In the report of Abdur-Razzaq from Ath-Thawri it does not say \"In the name of Allah.\" In the report of Ibn Numiar, Mansur said: \"I think he said: \\'In the name of Allah.\\'\"",
        "malay_translation": "Sebuah hadis yang serupa dengan hadis Jarir (no. 3533) diriwayatkan daripada Mansur, kecuali dalam hadis daripada Shubah ia tidak menyebut perkataan \"Dengan nama Allah.\" Dalam riwayat Abdur-Razzaq daripada Ath-Thawri, ia tidak menyebut \"Dengan nama Allah.\" Dalam riwayat Ibn Numiar, Mansur berkata, \"Aku rasa dia berkata, 'Dengan nama Allah.'\"",
        "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، جَمِيعًا عَنِ الثَّوْرِيِّ، كِلاَهُمَا عَنْ مَنْصُورٍ، بِمَعْنَى حَدِيثِ جَرِيرٍ غَيْرَ أَنَّ شُعْبَةَ لَيْسَ فِي حَدِيثِهِ ذِكْرُ ‏\"‏ بِاسْمِ اللَّهِ ‏\"‏ ‏.‏ وَفِي رِوَايَةِ عَبْدِ الرَّزَّاقِ عَنِ الثَّوْرِيِّ ‏\"‏ بِاسْمِ اللَّهِ ‏\"‏ ‏.‏ وَفِي رِوَايَةِ ابْنِ نُمَيْرٍ قَالَ مَنْصُورٌ أُرَاهُ قَالَ ‏\"‏ بِاسْمِ اللَّهِ ‏\"‏ ‏.‏"
      },
      {
        "id": 11099,
        "hadith_number": "3535",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Mengenai Perhubungan Suami Isteri dan Kesan Pada Anak",
        "perawi_melayu": "Jabir (رضي الله عنه) menyatakan:",
        "english_text": "The Jews used to say: When a man has intercourse with his wife through the vagina but being on her back. the child will have squint, so the verse came down: Your wives are your tilth; go then unto your tilth as you may desire (ii. 223)",
        "malay_translation": "Orang Yahudi dahulu berkata: Apabila seorang lelaki melakukan hubungan seksual dengan isterinya melalui faraj tetapi dengan posisi dia di atas belakang isterinya, maka anak yang dilahirkan akan mengalami mata juling. Oleh itu, ayat suci turun: \"Isteri-isteri kamu adalah ladang bagimu; maka kejarlah ladangmu itu sebagaimana yang kamu sukai\" (Surah Al-Baqarah ayat 223).",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَاللَّفْظُ لِأَبِي بَكْرٍ، قَالُوا: حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ الْمُنْكَدِرِ، سَمِعَ جَابِرًا، يَقُولُ: كَانَتِ الْيَهُودُ تَقُولُ: إِذَا أَتَى الرَّجُلُ امْرَأَتَهُ مِنْ دُبُرِهَا فِي قُبُلِهَا، كَانَ الْوَلَدُ أَحْوَلَ، فَنَزَلَتْ: {نِسَاؤُكُمْ حَرْثٌ لَكُمْ فَأْتُوا حَرْثَكُمْ أَنَّى شِئْتُمْ}."
      },
      {
        "id": 11100,
        "hadith_number": "3536",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Penjelasan tentang Hukum Persetubuhan dan Kelahiran Anak yang Mengalami Juling",
        "perawi_melayu": "Jabir bin Abdullah (رضي الله عنه) meriwayatkan:",
        "english_text": "The Jews used to say that when one comes to one's wife through the vagina, but being on her back, and she becomes pregnant, the child has a squint. So the verse came down: Your wives are your tilth; go then unto your tilth, as you may desire.",
        "malay_translation": "Orang Yahudi dahulu mengatakan bahawa jika seseorang bersetubuh dengan isterinya melalui faraj, tetapi dalam keadaan berbaring di atasnya, dan isterinya mengandung, maka anak yang dilahirkan akan mengalami juling. Oleh itu, turunlah ayat: \"Isteri-isteri kamu adalah ladang (tanaman) untuk kamu. Maka datangilah ladang-ladang kamu sebagaimana yang kamu kehendaki.\"",
        "arabic_text": "وحَدَّثَنَا مُحَمَّدُ بْنُ رُمْح، أَخْبَرَنَا اللَّيْثُ، عَنِ ابْنِ الْهَادِ، عَنْ أَبِي حَازِمٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، أَنَّ يَهُودَ كَانَتْ تَقُولُ: إِذَا أُتِيَتِ الْمَرْأَةُ مِنْ دُبُرِهَا، فِي قُبُلِهَا، ثُمَّ حَمَلَتْ، كَانَ وَلَدُهَا أَحْوَلَ ، قَالَ: فَأُنْزِلَتْ: {نِسَاؤُكُمْ حَرْثٌ لَكُمْ فَأْتُوا حَرْثَكُمْ أَنَّى شِئْتُمْ}."
      },
      {
        "id": 11101,
        "hadith_number": "3537",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Cara Berhubungan Suami Isteri yang Dibolehkan",
        "perawi_melayu": "Hadis ini diriwayatkan daripada Jabir رضي الله عنه melalui sanad yang lain, tetapi dalam riwayat Zuhri terdapat tambahan (kata-kata ini):",
        "english_text": "If he likes he may (have intercourse) being on the back or in front of her, but it should be through one opening (vagina).",
        "malay_translation": "Jika dia suka, dia boleh (berhubungan) dengan berada di belakang atau di hadapannya, tetapi ia mestilah melalui satu liang (faraj).",
        "arabic_text": "وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، ح وحَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، عَنْ أَيُّوبَ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا شُعْبَةُ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، ح وحَدَّثَنِي عُبَيْدُ اللهِ بْنُ سَعِيدٍ، وَهَارُونُ بْنُ عَبْدِ اللهِ، وَأَبُو مَعْنٍ الرَّقَاشِيُّ، قَالُوا: حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي، قَالَ: سَمِعْتُ النُّعْمَانَ بْنَ رَاشِدٍ، يُحَدِّثُ عَنِ الزُّهْرِيِّ، ح وحَدَّثَنِي سُلَيْمَانُ بْنُ مَعْبَدٍ، حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ وَهُوَ ابْنُ الْمُخْتَارِ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِح، كُلُّ هَؤُلَاءِ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، بِهَذَا الْحَدِيثِ، وَزَادَ فِي حَدِيثِ النُّعْمَانِ، عَنِ الزُّهْرِيِّ: إِنْ شَاءَ مُجَبِّيَةً، وَإِنْ شَاءَ غَيْرَ مُجَبِّيَةٍ، غَيْرَ أَنَّ ذَلِكَ فِي صِمَامٍ وَاحِدٍ"
      },
      {
        "id": 11102,
        "hadith_number": "3538",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kutuk Malaikat Terhadap Wanita Meninggalkan Tempat Tidur Suaminya",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: When a woman spends the night away from the bed of her husband, the angels curse her until morning.",
        "malay_translation": "Rasulullah صلى الله عليه وسلم bersabda: Apabila seorang wanita meninggalkan tempat tidur suaminya pada malam hari, malaikat akan mengutuknya sehingga pagi.",
        "arabic_text": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، وَاللَّفْظُ لِابْنِ الْمُثَنَّى، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ: سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «إِذَا بَاتَتِ الْمَرْأَةُ، هَاجِرَةً فِرَاشَ زَوْجِهَا، لَعَنَتْهَا الْمَلَائِكَةُ حَتَّى تُصْبِحَ»."
      },
      {
        "id": 11103,
        "hadith_number": "3539",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Menunggu Kembalinya Wanita",
        "perawi_melayu": "Shobah meriwayatkannya dengan sanad yang sedikit berbeza:",
        "english_text": "He said: Until she comes back.",
        "malay_translation": "Beliau berkata: Sehingga dia kembali.",
        "arabic_text": "وحَدَّثَنِيهِ يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، حَدَّثَنَا شُعْبَةُ، بِهَذَا الْإِسْنَادِ، وَقَالَ: «حَتَّى تَرْجِعَ»."
      },
      {
        "id": 11104,
        "hadith_number": "3540",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ketidakpuasan Tuhan Atas Isteri yang Tidak Memenuhi Panggilan Suami",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: By Him in Whose Hand is my life, when a man calls his wife to his bed, and she does not respond, the One Who is in the heaven is displeased with her until he (her husband) is pleased with her.",
        "malay_translation": "Rasulullah (صلی الله عليه وسلم) bersabda: Demi Zat yang jiwa saya di tangan-Nya, apabila seorang lelaki memanggil isterinya ke tempat tidur, dan dia tidak menyahut, Yang Maha Tinggi di langit tidak berpuas hati dengannya sehingga dia (suami) berpuas hati dengannya.",
        "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا مَرْوَانُ، عَنْ يَزِيدَ يَعْنِي ابْنَ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «وَالَّذِي نَفْسِي بِيَدِهِ، مَا مِنْ رَجُلٍ يَدْعُو امْرَأَتَهُ إِلَى فِرَاشِهَا، فَتَأْبَى عَلَيْهِ، إِلَّا كَانَ الَّذِي فِي السَّمَاءِ سَاخِطًا عَلَيْهَا حَتَّى يَرْضَى عَنْهَا."
      },
      {
        "id": 11105,
        "hadith_number": "3541",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kutukan Malaikat Terhadap Isteri Yang Tidak Memenuhi Kehendak Suami",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger (ﷺ) as saying: When a man invites his wife to his bed and she does not come, and he (the husband) spends the sight being angry with her, the angels curse her until morning.",
        "malay_translation": "Rasulullah SAW bersabda: Apabila seorang suami mengajak isterinya ke tempat tidurnya dan dia tidak datang, dan suami itu menghabiskan waktunya dengan marah kepadanya, maka para malaikat akan mengutuknya sehingga pagi.",
        "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنِي أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا جَرِيرٌ، كُلُّهُمْ عَنِ الأَعْمَشِ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ إِذَا دَعَا الرَّجُلُ امْرَأَتَهُ إِلَى فِرَاشِهِ فَلَمْ تَأْتِهِ فَبَاتَ غَضْبَانَ عَلَيْهَا لَعَنَتْهَا الْمَلاَئِكَةُ حَتَّى تُصْبِحَ ‏.‏"
      },
      {
        "id": 11106,
        "hadith_number": "3542",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Lelaki Yang Mengkhianati Rahsia Isterinya di Hari Kiamat",
        "perawi_melayu": "Abu Sa'id al-Khudri (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger (ﷺ) said: The most wicked among the people in the eye of Allah on the Day of judgment is the men who goes to his wife and she comes to him, and then he divulges her secret.",
        "malay_translation": "Rasulullah SAW bersabda: Orang yang paling jahat di sisi Allah pada Hari Kiamat ialah lelaki yang menghampiri isterinya dan isterinya menghampirinya, kemudian dia mendedahkan rahsia isterinya.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، عَنْ عُمَرَ بْنِ حَمْزَةَ الْعُمَرِيِّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَعْدٍ، قَالَ: سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ مِنْ أَشَرِّ النَّاسِ عِنْدَ اللهِ مَنْزِلَةً يَوْمَ الْقِيَامَةِ، الرَّجُلَ يُفْضِي إِلَى امْرَأَتِهِ، وَتُفْضِي إِلَيْهِ، ثُمَّ يَنْشُرُ سِرَّهَا."
      },
      {
        "id": 11107,
        "hadith_number": "3543",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Kepercayaan Antara Suami dan Isteri di Sisi Allah",
        "perawi_melayu": "Abu Sirma al-Khudri (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The most important of the trusts in the sight of Allah on the Day of judgment is that a man goes to his wife and she goes to him (and the breach of this trust is) that he should divulge her secret Ibn Numair narrates this hadith with a slight change of wording.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Kepercayaan yang paling penting di sisi Allah pada Hari Kiamat ialah seorang suami mengunjungi isterinya dan isterinya mengunjungi suaminya. (Dan khianat dalam hal ini adalah) suami mendedahkan rahsia isterinya. Ibn Numair meriwayatkan hadis ini dengan sedikit perubahan perkataan.",
        "arabic_text": "وحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عُمَرَ بْنِ حَمْزَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَعْدٍ، قَالَ: سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ مِنْ أَعْظَمِ الْأَمَانَةِ عِنْدَ اللهِ يَوْمَ الْقِيَامَةِ، الرَّجُلَ يُفْضِي إِلَى امْرَأَتِهِ، وَتُفْضِي إِلَيْهِ، ثُمَّ يَنْشُرُ سِرَّهَا»، وَقَالَ ابْنُ نُمَيْرٍ: «إِنَّ أَعْظَمَ."
      },
      {
        "id": 11108,
        "hadith_number": "3544",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kebolehan `Azl dan Penciptaan Jiwa Hingga Hari Kiamat",
        "perawi_melayu": "Abu Sirma berkata kepada Abu Sa'id al-Khudri (رضي الله عنه):",
        "english_text": "O Abu Sa'id, did you hear Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) mentioning al-'azl? He said: Yes, and added: We went out with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on the expedition to the Bi'l-Mustaliq and took captive some excellent Arab women; and we desired them, for we were suffering from the absence of our wives, (but at the same time) we also desired ransom for them. So we decided to have sexual intercourse with them but by observing 'azl (Withdrawing the male sexual organ before emission of semen to avoid-conception). But we said: We are doing an act whereas Allah's Messenger is amongst us; why not ask him? So we asked Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and he said: It does not matter if you do not do it, for every soul that is to be born up to the Day of Resurrection will be born.",
        "malay_translation": "Wahai Abu Sa'id, adakah engkau mendengar Rasulullah (ﷺ) menyebut tentang `azl? Beliau menjawab: Ya, dan menambahkan: Kami keluar bersama Rasulullah (ﷺ) dalam ekspedisi ke Bi'l-Mustaliq dan menangkap beberapa wanita Arab yang cantik; dan kami menginginkan mereka, kerana kami mengalami kesedihan kerana ketiadaan isteri-isteri kami, (tetapi pada masa yang sama) kami juga menginginkan tebusan untuk mereka. Maka kami memutuskan untuk melakukan hubungan seksual dengan mereka tetapi dengan melakukan `azl (menarik anggota kelamin lelaki sebelum ejakulasi untuk mengelakkan pembuahan). Tetapi kami berkata: Kami sedang melakukan suatu perbuatan sedangkan Rasulullah berada di tengah-tengah kami; mengapa tidak bertanya kepada baginda? Oleh itu, kami bertanya kepada Rasulullah (ﷺ), dan baginda menjawab: Tidak mengapa jika kamu tidak melakukannya, kerana setiap jiwa yang akan dilahirkan sehingga Hari Kiamat akan dilahirkan.",
        "arabic_text": "وحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ، قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، أَخْبَرَنِي رَبِيعَةُ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنِ ابْنِ مُحَيْرِيزٍ، أَنَّهُ قَالَ: دَخَلْتُ أَنَا وَأَبُو صِرْمَةَ عَلَى أَبِي سَعِيدٍ الْخُدْرِيِّ، فَسَأَلَهُ أَبُو صِرْمَةَ، فَقَالَ: يَا أَبَا سَعِيدٍ، هَلْ سَمِعْتَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَذْكُرُ الْعَزْلَ؟ فَقَالَ: نَعَمْ، غَزَوْنَا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ غَزْوَةَ بَلْمُصْطَلِقِ، فَسَبَيْنَا كَرَائِمَ الْعَرَبِ، فَطَالَتْ عَلَيْنَا الْعُزْبَةُ، وَرَغِبْنَا فِي الْفِدَاءِ، فَأَرَدْنَا أَنْ نَسْتَمْتِعَ وَنَعْزِلَ، فَقُلْنَا: نَفْعَلُ وَرَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَيْنَ أَظْهُرِنَا لَا نَسْأَلُهُ، فَسَأَلْنَا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ «لَا عَلَيْكُمْ أَنْ لَا تَفْعَلُوا، مَا كَتَبَ اللهُ خَلْقَ نَسَمَةٍ هِيَ كَائِنَةٌ إِلَى يَوْمِ الْقِيَامَةِ، إِلَّا سَتَكُونُ."
      },
      {
        "id": 11109,
        "hadith_number": "3545",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Allah Menentukan Takdir Setiap Makhluk Hingga Hari Kiamat",
        "perawi_melayu": "Hadis seperti ini telah diriwayatkan melalui Habban dengan sanad yang sama (tetapi dengan perubahan ini) bahawa beliau berkata:",
        "english_text": "Allah has ordained whom he has to create until the Day of judgment.",
        "malay_translation": "Allah telah menetapkan takdir setiap makhluk yang diciptakan-Nya hingga Hari Kiamat.",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ الْفَرَجِ، مَوْلَى بَنِي هَاشِمٍ، حَدَّثَنَا مُحَمَّدُ بْنُ الزِّبْرِقَانِ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، بِهَذَا الْإِسْنَادِ، فِي مَعْنَى حَدِيثِ رَبِيعَةَ، غَيْرَ أَنَّهُ قَالَ: «فَإِنَّ اللهَ كَتَبَ مَنْ هُوَ خَالِقٌ إِلَى يَوْمِ الْقِيَامَةِ."
      },
      {
        "id": 11110,
        "hadith_number": "3546",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Mengenai Mengamalkan Azl dan Kelahiran Jiwa",
        "perawi_melayu": "Abu Sa'id al-Khudri (رضي الله عنه) meriwayatkan:",
        "english_text": "We took women captives, and we wanted to do 'azl with them. We then asked Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about it, and he said to us: Verily you do it, verily you do it, verily you do it, but the soul which has to be born until the Day of judg-ment must be born.",
        "malay_translation": "Kami mengambil wanita sebagai tawanan, dan kami ingin melakukan azl dengan mereka. Kemudian, kami bertanya kepada Rasulullah (ﷺ) tentang hal itu, dan baginda bersabda kepada kami: Sesungguhnya kamu boleh melakukannya, sesungguhnya kamu boleh melakukannya, sesungguhnya kamu boleh melakukannya, tetapi jiwa yang ditakdirkan lahir hingga Hari Kiamat mestilah lahir.",
        "arabic_text": "حَدَّثَنِي عَبْدُ اللهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ الضُّبَعِيُّ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ مَالِكٍ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ مُحَيْرِيزٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّهُ أَخْبَرَهُ، قَالَ: أَصَبْنَا سَبَايَا، فَكُنَّا نَعْزِلُ، ثُمَّ سَأَلْنَا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ، فَقَالَ لَنَا: «وَإِنَّكُمْ لَتَفْعَلُونَ؟ وَإِنَّكُمْ لَتَفْعَلُونَ؟ وَإِنَّكُمْ لَتَفْعَلُونَ؟ مَا مِنْ نَسَمَةٍ كَائِنَةٍ إِلَى يَوْمِ الْقِيَامَةِ، إِلَّا هِيَ كَائِنَةٌ."
      },
      {
        "id": 11111,
        "hadith_number": "3547",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Tidak Ada Kerugian Jika Tidak Melaksanakan Adat Kelahiran",
        "perawi_melayu": "Daripada Anas bin Sirin",
        "english_text": "Abu Sa'id al-Khudri (رضی اللہ عنہ) (was asked if he had heard it himself), to which he said: Yes. (I heard) Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There is no harm if you do not practise it, for it (the birth of the child) is something ordained (by Allah).",
        "malay_translation": "Abu Sa’id al-Khudri (رضي الله عنه) (dipertanyakan sama ada beliau mendengar sendiri), dan beliau menjawab: Ya. (Aku dengar) Rasulullah (ﷺ) bersabda: Tidak ada keburukan jika kamu tidak mempraktikkannya, kerana ia (kelahiran anak) adalah sesuatu yang ditentukan (oleh Allah).",
        "arabic_text": ") وحَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا شُعْبَةُ، عَنْ أَنَسِ بْنِ سِيرِينَ، عَنْ مَعْبَدِ بْنِ سِيرِينَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، - قَالَ: قُلْتُ لَهُ: سَمِعْتَهُ مِنْ أَبِي سَعِيدٍ؟ قَالَ: نَعَمْ - عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «لَا عَلَيْكُمْ أَنْ لَا تَفْعَلُوا، فَإِنَّمَا هُوَ الْقَدَرُ."
      },
      {
        "id": 11112,
        "hadith_number": "3548",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Penjelasan Tentang Hukum 'Azl dan Pertimbangan Takdir",
        "perawi_melayu": "Anas bin Sirin",
        "english_text": "A similar reported was narrated from Anas bin Sireen with this chain, except that in their hadith it says: \"From the prophet who said concerning \\'Azl: It does not matter if you do not do it, for it is only the Divine Decree (that decides).\\'\" According to the report of Bahz, Shubah said: \\'\\'I said to him: Did you hear it from Abu Saeed رضی اللہ عنہ ?\\' He said: \\'yes\\'\"",
        "malay_translation": "Hadis yang serupa juga diriwayatkan daripada Anas bin Sirin dengan sanad yang sama, kecuali dalam hadis mereka ada menyebut: \"Dari Nabi SAW mengenai 'Azl: Tidak mengapa jika kamu tidak melakukannya, kerana ia hanyalah ketentuan Allah (yang menentukan).\" Menurut riwayat Bahz, Syubah berkata: \"Saya bertanya kepadanya: Adakah anda mendengarnya dari Abu Sa'id radhiallahu 'anhu?\" Dia menjawab: \"Ya.\"",
        "arabic_text": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وحَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، وَبَهْزٌ، قَالُوا جَمِيعًا: حَدَّثَنَا شُعْبَةُ، عَنْ أَنَسِ بْنِ سِيرِينَ، بِهَذَا الْإِسْنَادِ مِثْلَهُ، غَيْرَ أَنَّ فِي حَدِيثِهِمْ: عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْعَزْلِ: «لَا عَلَيْكُمْ أَنْ لَا تَفْعَلُوا ذَاكُمْ، فَإِنَّمَا هُوَ الْقَدَرُ»، وَفِي رِوَايَةِ بَهْزٍ، قَالَ شُعْبَةُ: قُلْتُ لَهُ: سَمِعْتَهُ مِنْ أَبِي سَعِيدٍ؟ قَالَ: نَعَمْ."
      },
      {
        "id": 11113,
        "hadith_number": "3549",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Penjelasan Mengenai 'Azl dan Hukumnya",
        "perawi_melayu": "Abu Sa'id al-Khudri (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was asked about 'azl, whereupon he said: There is no harm if you do not do that, for it (the birth of the child) is something ordained. Muhammad (one of the narrators) said: (The words) La 'alaykum (there is no harm) implies its Prohibition.",
        "malay_translation": "Rasulullah (ﷺ) ditanya tentang ‘azl, lalu baginda bersabda: Tidak mengapa jika kamu tidak melakukannya, kerana kelahiran anak itu adalah sesuatu yang telah ditetapkan. Muhammad (salah seorang perawi) berkata: Perkataan ‘La ‘alaykum’ (tidak mengapa) menandakan pengharamannya.",
        "arabic_text": "وحَدَّثَنِي أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، وَأَبُو كَامِلٍ الْجَحْدَرِيُّ، وَاللَّفْظُ لِأَبِي كَامِلٍ، قَالَا: حَدَّثَنَا حَمَّادٌ وَهُوَ ابْنُ زَيْدٍ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ بِشْرِ بْنِ مَسْعُودٍ، رَدَّهُ إِلَى أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ: سُئِلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْعَزْلِ، فَقَالَ: «لَا عَلَيْكُمْ أَنْ لَا تَفْعَلُوا ذَاكُمْ، فَإِنَّمَا هُوَ الْقَدَرُ»، قَالَ: مُحَمَّدٌ: وَقَوْلُهُ: «لَا عَلَيْكُمْ» أَقْرَبُ إِلَى النَّهْيِ."
      },
      {
        "id": 11114,
        "hadith_number": "3550",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Penjelasan Mengenai 'Azl dan Takdir Kelahiran",
        "perawi_melayu": "Abu Sa'id al-Khudri (رضي الله عنه) meriwayatkan:",
        "english_text": "Mention was made of 'azl in the presence of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) whereupon he said: Why do you practise it? They said: There is a man whose wife has to suckle the child, and if that person has a sexual intercourse with her (she may conceive) which he does not like, and there is another person who has a slave-girl and he has a sexual intercourse with her, but he does not like her to have conception so that she may not become Umm Walad, whereupon he (the Holy Prophet) said: There is no harm if you do not do that, for that (the birth of the child) is something pre- ordained. Ibn 'Aun said: I made a mention of this hadith to Hasan, and he said: By Allah, (it seems) as if there is upbraiding in it (for 'azl).",
        "malay_translation": "Disebutkan tentang 'azl di hadapan Rasulullah (صلى الله عليه وسلم), lalu baginda bertanya: Mengapa kamu melakukannya? Mereka menjawab: Ada seorang lelaki yang isterinya sedang menyusukan anak, dan jika dia melakukan hubungan seksual dengannya, dia tidak menginginkannya hamil, dan ada lagi seorang lelaki yang memiliki hamba perempuan dan melakukan hubungan seksual dengannya, tetapi dia tidak ingin hamba perempuan itu hamil agar dia tidak menjadi Umm Walad. Lalu baginda bersabda: Tidak mengapa jika kamu tidak melakukannya, kerana kelahiran itu adalah sesuatu yang telah ditetapkan. Ibn 'Aun berkata: Aku menyampaikan hadith ini kepada Hasan, dan dia berkata: Demi Allah, (seolah-olah) terdapat teguran di dalamnya (mengenai 'azl).",
        "arabic_text": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ مُحَمَّدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ بِشْرٍ الْأَنْصَارِيِّ، قَالَ: فَرَدَّ الْحَدِيثَ حَتَّى رَدَّهُ إِلَى أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: ذُكِرَ الْعَزْلُ عِنْدَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «وَمَا ذَاكُمْ؟» قَالُوا: الرَّجُلُ تَكُونُ لَهُ الْمَرْأَةُ تُرْضِعُ، فَيُصِيبُ مِنْهَا، وَيَكْرَهُ أَنْ تَحْمِلَ مِنْهُ، وَالرَّجُلُ تَكُونُ لَهُ الْأَمَةُ فَيُصِيبُ مِنْهَا، وَيَكْرَهُ أَنْ تَحْمِلَ مِنْهُ، قَالَ: «فَلَا عَلَيْكُمْ أَنْ لَا تَفْعَلُوا ذَاكُمْ، فَإِنَّمَا هُوَ الْقَدَرُ»، قَالَ ابْنُ عَوْنٍ: فَحَدَّثْتُ بِهِ الْحَسَنَ، فَقَالَ: وَاللهِ لَكَأَنَّ هَذَا زَجْرٌ."
      },
      {
        "id": 11115,
        "hadith_number": "3551",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Mengenai 'Azl yang Diriwayatkan oleh Abd al-Rahman bin Bishr",
        "perawi_melayu": "Ibn 'Aun melaporkan:",
        "english_text": "I reported to Muhammad on the authority of Ibrahim the hadith reported by 'Abdul-Rahmann bin Bishr (the hadith concerning 'azl), whereupon he said: That (hadith) Abd ul-Rahman bin Bishr had narrated to me (also).",
        "malay_translation": "Saya menyampaikan kepada Muhammad dengan sanad daripada Ibrahim hadis yang diriwayatkan oleh 'Abdul-Rahman bin Bishr (hadis berkenaan 'azl), lalu baginda bersabda:  Hadis tersebut juga telah diriwayatkan oleh Abd al-Rahman bin Bishr kepada saya.",
        "arabic_text": "وحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنِ ابْنِ عَوْنٍ، قَالَ: حَدَّثْتُ مُحَمَّدًا، عَنْ إِبْرَاهِيمَ، بِحَدِيثِ عَبْدِ الرَّحْمَنِ بْنِ بِشْرٍ - يَعْنِي حَدِيثَ الْعَزْلِ - فَقَالَ: إِيَّايَ حَدَّثَهُ عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ."
      },
      {
        "id": 11116,
        "hadith_number": "3552",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Soal Jawab Mengenai Kaedah Al-'Azl",
        "perawi_melayu": "Ma'bad bin Sirin bertanya kepada Abu Sa'id (رضي الله عنه):",
        "english_text": "Did you hear Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) making a mention of something in regard to al-'azl? Thereupon he said: Yes. The rest (of the hadith is the same)",
        "malay_translation": "Adakah kamu mendengar Rasulullah (ﷺ) menyebut sesuatu berkaitan dengan al-'azl? Baginda menjawab: Ya. (Selebihnya hadis ini sama)",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْأَعْلَى، حَدَّثَنَا هِشَامٌ، عَنْ مُحَمَّدٍ، عَنْ مَعْبَدِ بْنِ سِيرِينَ، قَالَ: قُلْنَا لِأَبِي سَعِيدٍ: هَلْ سَمِعْتَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَذْكُرُ فِي الْعَزْلِ شَيْئًا؟ قَالَ: نَعَمْ وَسَاقَ الْحَدِيثَ بِمَعْنَى حَدِيثِ ابْنِ عَوْنٍ إِلَى قَوْلِهِ الْقَدَرُ."
      },
      {
        "id": 11117,
        "hadith_number": "3553",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Penjelasan Mengenai Perceraian Sementara (Al-'Azl) dari Rasulullah SAW",
        "perawi_melayu": "Abu Sa'id al-Khudri (رضي الله عنه) meriwayatkan:",
        "english_text": "Mention was made about al-'azl in the presence of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), whereupon he said: Why any one of you practises it? (He did not say: One of you should not do it), for there is no created soul, whose creator is not Allah.",
        "malay_translation": "Sebutan mengenai al-'azl disebut di hadapan Rasulullah SAW, lalu baginda bersabda: \"Mengapa salah seorang daripada kamu mempraktikkannya?\" (Baginda tidak bersabda: Janganlah salah seorang daripada kamu melakukannya), kerana tiada jiwa yang diciptakan, yang tidak mempunyai Allah sebagai Penciptanya.",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، وَأَحْمَدُ بْنُ عَبْدَةَ، قَالَ ابْنُ عَبْدَةَ: أَخْبَرَنَا، وقَالَ عُبَيْدُ اللهِ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ أَبِي نَجِيح، عَنْ مُجَاهِدٍ، عَنْ قَزْعَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: ذُكِرَ الْعَزْلُ عِنْدَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: وَلِمَ يَفْعَلُ ذَلِكَ أَحَدُكُمْ؟ - وَلَمْ يَقُلْ: فَلَا يَفْعَلْ ذَلِكَ أَحَدُكُمْ - فَإِنَّهُ لَيْسَتْ نَفْسٌ مَخْلُوقَةٌ إِلَّا اللهُ خَالِقُهَا."
      },
      {
        "id": 11118,
        "hadith_number": "3554",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Penjelasan Mengenai Azl dan Takdir",
        "perawi_melayu": "Abu Sa'id al-Khudri (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was asked about 'azl, whereupon he said: The child does not come from all the liquid (sermen) and when Allah intends to create anything nothing can prevent it (from coming into existence).",
        "malay_translation": "Utusan Allah (ﷺ) ditanya tentang azl, lalu baginda bersabda: Anak tidak terhasil daripada semua cecair (mani), dan apabila Allah menghendaki sesuatu untuk diciptakan, tiada yang dapat menghalangkannya daripada terwujud.",
        "arabic_text": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي مُعَاوِيَةُ يَعْنِي ابْنَ صَالِحٍ، عَنْ عَلِيِّ بْنِ أَبِي طَلْحَةَ، عَنْ أَبِي الْوَدَّاكِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، سَمِعَهُ يَقُولُ: سُئِلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، عَنِ الْعَزْلِ، فَقَالَ: «مَا مِنْ كُلِّ الْمَاءِ يَكُونُ الْوَلَدُ، وَإِذَا أَرَادَ اللهُ خَلْقَ شَيْءٍ، لَمْ يَمْنَعْهُ شَيْءٌ."
      },
      {
        "id": 11119,
        "hadith_number": "3555",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Yang Serupa Dengan Hadis Nombor 3554",
        "perawi_melayu": "Abu Said Al-Khudri رضي الله عنه",
        "english_text": "A similar report (as no. 3554) was narrated from Abu Saeed Al-Khudri رضی اللہ عنہ , from the prophet ﷺ.",
        "malay_translation": "Satu riwayat yang serupa (seperti hadis no. 3554) diriwayatkan daripada Abu Said Al-Khudri رضي الله عنه, daripada Nabi ﷺ.",
        "arabic_text": "حَدَّثَنِي أَحْمَدُ بْنُ الْمُنْذِرِ الْبَصْرِيُّ، حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ، حَدَّثَنَا مُعَاوِيَةُ، أَخْبَرَنِي عَلِيُّ بْنُ أَبِي طَلْحَةَ الْهَاشِمِيُّ، عَنْ أَبِي الْوَدَّاكِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، بِمِثْلِهِ."
      },
      {
        "id": 11120,
        "hadith_number": "3556",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Panduan Mengenai Perhubungan Seksual dan Kehamilan",
        "perawi_melayu": "Jabir رضي الله عنه meriwayatkan:",
        "english_text": "A man came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: I have a slave-girl who is our servant and she carries water for us and I have intercourse with her, but I do not want her to conceive. He said: Practise 'azl, if you so like, but what is decreed for her will come to her. The person stayed back (for some time) and then came and said: The girl has become pregnant, whereupon he said: I told you what was decreed for her would come to her.",
        "malay_translation": "Seorang lelaki datang menemui Rasulullah صلى الله عليه وسلم dan berkata: Saya mempunyai seorang hamba perempuan yang bekerja untuk kita dan dia mengangkut air untuk kita, dan saya melakukan hubungan seksual dengannya, tetapi saya tidak mahu dia hamil. Baginda bersabda: Lakukan 'azl, jika kamu suka, tetapi apa yang telah ditakdirkan untuknya akan datang kepadanya. Lelaki itu menunggu sebentar, kemudian datang dan berkata: Gadis itu telah hamil, lalu Baginda bersabda: Aku telah memberitahu kamu bahawa apa yang telah ditakdirkan untuknya akan datang kepadanya.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللهِ بْنِ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، أَخْبَرَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَجُلًا أَتَى رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: إِنَّ لِي جَارِيَةً، هِيَ خَادِمُنَا وَسَانِيَتُنَا، وَأَنَا أَطُوفُ عَلَيْهَا، وَأَنَا أَكْرَهُ أَنْ تَحْمِلَ، فَقَالَ: «اعْزِلْ عَنْهَا إِنْ شِئْتَ، فَإِنَّهُ سَيَأْتِيهَا مَا قُدِّرَ لَهَا»، فَلَبِثَ الرَّجُلُ، ثُمَّ أَتَاهُ، فَقَالَ: إِنَّ الْجَارِيَةَ قَدْ حَبِلَتْ، فَقَالَ: «قَدْ أَخْبَرْتُكَ أَنَّهُ سَيَأْتِيهَا مَا قُدِّرَ لَهَا."
      },
      {
        "id": 11121,
        "hadith_number": "3557",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Azl dan Ketidakmampuannya Mencegah Takdir Allah",
        "perawi_melayu": "Jabir bin 'Abdullah (رضي الله عنه) meriwayatkan:",
        "english_text": "A person asked Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying: I have a slave-girl and I practise 'azl with her, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: This cannot prevent that which Allah has decreed. The person then came (after some time) and said: Messenger of Allah, the slave-girl about whom I talked to you has conceived, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: I am the servant of Allah and His Messenger.",
        "malay_translation": "Seseorang bertanya kepada Rasulullah (صلى الله عليه وسلم), \"Saya mempunyai seorang hamba perempuan dan saya melakukan azl kepadanya. Apakah ini dapat mencegah takdir Allah?\" Rasulullah (صلى الله عليه وسلم) menjawab, \"Ini tidak dapat mencegah apa yang telah ditetapkan oleh Allah.\" Kemudian orang itu datang kembali (setelah beberapa waktu) dan berkata, \"Ya Rasulullah, hamba perempuan yang saya ceritakan kepada Anda telah mengandung.\" Rasulullah (صلى الله عليه وسلم) menjawab, \"Aku adalah hamba Allah dan Rasul-Nya.\"",
        "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الْأَشْعَثِيُّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ سَعِيدِ بْنِ حَسَّانَ، عَنْ عُرْوَةَ بْنِ عِيَاضٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: سَأَلَ رَجُلٌ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: إِنَّ عِنْدِي جَارِيَةً لِي، وَأَنَا أَعْزِلُ عَنْهَا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ ذَلِكَ لَنْ يَمْنَعَ شَيْئًا أَرَادَهُ اللهُ» قَالَ: فَجَاءَ الرَّجُلُ، فَقَالَ: يَا رَسُولَ اللهِ، إِنَّ الْجَارِيَةَ الَّتِي كُنْتُ ذَكَرْتُهَا لَكَ حَمَلَتْ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَنَا عَبْدُ اللهِ وَرَسُولُهُ."
      },
      {
        "id": 11122,
        "hadith_number": "3558",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kedatangan Seseorang Kepada Rasulullah ﷺ (Hadis serupa dengan no. 3557)",
        "perawi_melayu": "Jabir bin 'Abdullah (رضي الله عنه) meriwayatkan:",
        "english_text": "A person came to Allah's Apostle ﷺ ...\" a hadith like that of Sufyan (no. 3557).",
        "malay_translation": "Seseorang datang menemui Rasulullah ﷺ...\" sebuah hadis yang serupa dengan hadis Sufyan (no. 3557).",
        "arabic_text": "وحَدَّثَنَا حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا سَعِيدُ بْنُ حَسَّانَ، قَاصُّ أَهْلِ مَكَّةَ، أَخْبَرَنِي عُرْوَةُ بْنُ عِيَاضِ بْنِ عَدِيِّ بْنِ الْخِيَارِ النَّوْفَلِيُّ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ سُفْيَانَ."
      },
      {
        "id": 11123,
        "hadith_number": "3559",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perbahasan tentang Azl di Zaman Turunnya Al-Quran",
        "perawi_melayu": "Jabir (رضي الله عنه) meriwayatkan:",
        "english_text": "We used to practice 'azl while the Qur'an was revealed.\" Ishaq added: Sufyan said: If anything were to have forbidden it by the Quran.",
        "malay_translation": "Kami pernah melakukan 'azl ketika Al-Quran diturunkan. Ishaq menambah, Sufyan berkata: Sekiranya Al-Quran mengharamkannya.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ: أَخْبَرَنَا، وَقَالَ أَبُو بَكْرٍ: حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ: «كُنَّا نَعْزِلُ، وَالْقُرْآنُ يَنْزِلُ»، زَادَ إِسْحَاقُ، قَالَ سُفْيَانُ: لَوْ كَانَ شَيْئًا يُنْهَى عَنْهُ لَنَهَانَا عَنْهُ الْقُرْآنُ."
      },
      {
        "id": 11124,
        "hadith_number": "3560",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Penggunaan Kaedah 'Azl pada Zaman Rasulullah SAW",
        "perawi_melayu": "Jabir (رضي الله عنه) meriwayatkan:",
        "english_text": "We used to practice 'azl during the life of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
        "malay_translation": "Kami biasa mengamalkan kaedah 'azl semasa hayat Rasulullah SAW.",
        "arabic_text": "وحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ عَطَاءٍ، قَالَ: سَمِعْتُ جَابِرًا، يَقُولُ: «لَقَدْ كُنَّا نَعْزِلُ عَلَى عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ»."
      },
      {
        "id": 11125,
        "hadith_number": "3561",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keizinan 'Azl Pada Zaman Rasulullah SAW",
        "perawi_melayu": "Jabir (رضي الله عنه) meriwayatkan:",
        "english_text": "We used to practice 'azl during the lifetime of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). This (the news of this practice) reached Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and he did not forbid us.",
        "malay_translation": "Kami pernah mengamalkan 'azl semasa hayat Rasulullah SAW. Berita tentang amalan ini sampai kepada Baginda SAW, dan Baginda tidak melarang kami.",
        "arabic_text": "وحَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، حَدَّثَنَا مُعَاذٌ يَعْنِي ابْنَ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ: «كُنَّا نَعْزِلُ عَلَى عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَبَلَغَ ذَلِكَ نَبِيَّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَلَمْ يَنْهَنَا."
      },
      {
        "id": 11126,
        "hadith_number": "3562",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Perzinaan dan Perhambaan Anak Haram",
        "perawi_melayu": "Abu Darda' (رضي الله عنه) meriwayatkan daripada Rasulullah SAW:",
        "english_text": "He came upon a woman who was in the advanced stage of pregnancy at the door of a tent. He (the Holy Prophet ﷺ) said: Perhaps he (the man accompanying her) intends to cohabit with her. They said: Yes. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: I have decided to curse him with such a curse as may go along with him to his grave. How can he own him (the child to be born) and that is not lawful for him, and how can he take him as a servant for that is not lawful for him?",
        "malay_translation": "Baginda mendapati seorang wanita yang sedang mengandung di ambang khemah. Baginda (Nabi SAW) bertanya: Mungkin dia (lelaki yang bersamanya) berniat untuk berzina dengannya? Mereka menjawab: Ya. Lalu Rasulullah SAW bersabda: Aku telah memutuskan untuk mengutuknya dengan kutukan yang akan menyertainya ke kuburnya. Bagaimanakah dia boleh memiliki anak itu (yang akan dilahirkan) sedangkan itu tidak halal baginya? Dan bagaimana pula dia boleh menjadikan anak itu sebagai hambanya, sedangkan itu juga tidak halal baginya?",
        "arabic_text": "وحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ يَزِيدَ بْنِ خُمَيْرٍ، قَالَ: سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ جُبَيْرٍ، يُحَدِّثُ عَنْ أَبِيهِ، عَنْ أَبِي الدَّرْدَاءِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَنَّهُ أَتَى بِامْرَأَةٍ مُجِحٍّ عَلَى بَابِ فُسْطَاطٍ، فَقَالَ: «لَعَلَّهُ يُرِيدُ أَنْ يُلِمَّ بِهَا»، فَقَالُوا: نَعَمْ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَقَدْ هَمَمْتُ أَنْ أَلْعَنَهُ لَعْنًا يَدْخُلُ مَعَهُ قَبْرَهُ، كَيْفَ يُوَرِّثُهُ وَهُوَ لَا يَحِلُّ لَهُ؟ كَيْفَ يَسْتَخْدِمُهُ وَهُوَ لَا يَحِلُّ لَهُ؟"
      },
      {
        "id": 11127,
        "hadith_number": "3563",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis yang Diterima Melalui Perantaraan Syu'bah",
        "perawi_melayu": null,
        "english_text": "A hadith like this has been transmitted on the authority of Shu'ba.",
        "malay_translation": "Hadis seperti ini telah disampaikan dengan izin Syu'bah.",
        "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو دَاوُدَ، جَمِيعًا عَنْ شُعْبَةَ، فِي هَذَا الْإِسْنَادِ."
      },
      {
        "id": 11128,
        "hadith_number": "3564",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Pergaulan dengan Wanita Menyusu dan Kebenarannya dalam Masyarakat",
        "perawi_melayu": "Judaima binti Wahb al-Asadiyyah (رضي الله عنها) meriwayatkan:",
        "english_text": "She heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) assaying: I intended to prohibit cohabitation with a suckling woman until I considered that the Romans and the Persians do it without any injury being caused to their children thereby. (Imam Muslim said: Khalaf reported it from Judamat al-'Asadiyya, but the correct wording is what has been stated by Yahya.)",
        "malay_translation": "Beliau mendengar Rasulullah SAW bersabda: Aku berniat untuk melarang pergaulan dengan wanita yang menyusui anak hingga aku mempertimbangkan bahawa orang Rom dan Parsi melakukannya tanpa sebarang mudarat kepada anak-anak mereka. (Imam Muslim berkata: Khalaf meriwayatkannya daripada Judaima al-Asadiyyah, tetapi lafaz yang betul adalah seperti yang dinyatakan oleh Yahya.)",
        "arabic_text": "وَحَدَّثَنَا خَلَفُ بْنُ هِشَامٍ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، - وَاللَّفْظُ لَهُ - قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ عَنْ جُدَامَةَ بِنْتِ وَهْبٍ الأَسَدِيَّةِ أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ ‏ لَقَدْ هَمَمْتُ أَنْ أَنْهَى عَنِ الْغِيلَةِ حَتَّى ذَكَرْتُ أَنَّ الرُّومَ وَفَارِسَ يَصْنَعُونَ ذَلِكَ فَلاَ يَضُرُّ أَوْلاَدَهُمْ ‏ ‏ ‏.‏ قَالَ مُسْلِمٌ وَأَمَّا خَلَفٌ فَقَالَ عَنْ جُذَامَةَ الأَسَدِيَّةِ ‏.‏ وَالصَّحِيحُ مَا قَالَهُ يَحْيَى بِالدَّالِ.‏"
      },
      {
        "id": 11129,
        "hadith_number": "3565",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Persetubuhan dengan Wanita Menyusu & Perbuatan Azl",
        "perawi_melayu": "Judama binti Wahb, adik perempuan Ukkasha (رضي الله عنه) meriwayatkan:",
        "english_text": "I went to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) along with some persons and he was saying: I intended to prohibit cohabitation with the suckling women, but I considered the Greeks and Persians, and saw that they suckle their children and this thing (cohabitation) does not do any harm to them (to the suckling women). Then they asked him about 'azl, whereupon he said. That is the secret (way of) burying alive, and Ubaidullah has made this addition in the hadith transmitted by al-Muqri and that is: When the one buried alive is asked.",
        "malay_translation": "Aku pergi menemui Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersama beberapa orang, dan baginda bersabda: Aku berniat untuk melarang persetubuhan dengan wanita yang menyusu anak, tetapi aku mempertimbangkan amalan orang Yunani dan Parsi, dan melihat mereka menyusu anak-anak mereka dan perbuatan itu (persetubuhan) tidak mendatangkan mudarat kepada mereka (wanita yang menyusu). Kemudian mereka bertanya kepada baginda tentang ‘azl, lalu baginda menjawab: Itulah cara penguburan hidup-hidup secara tersembunyi. Dan Ubaidullah telah menambah hadis ini, seperti yang diriwayatkan oleh al-Muqri, iaitu: Apabila orang yang dihidup-hidupkan secara tersembunyi itu ditanya.",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ أَبِي عُمَرَ، قَالَا: حَدَّثَنَا الْمُقْرِئُ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ، حَدَّثَنِي أَبُو الْأَسْوَدِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، عَنْ جُدَامَةَ بِنْتِ وَهْبٍ، أُخْتِ عُكَّاشَةَ، قَالَتْ: حَضَرْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فِي أُنَاسٍ وَهُوَ يَقُولُ: «لَقَدْ هَمَمْتُ أَنْ أَنْهَى عَنِ الْغِيلَةِ، فَنَظَرْتُ فِي الرُّومِ وَفَارِسَ، فَإِذَا هُمْ يُغِيلُونَ أَوْلَادَهُمْ، فَلَا يَضُرُّ أَوْلَادَهُمْ ذَلِكَ شَيْئًا»، ثُمَّ سَأَلُوهُ عَنِ الْعَزْلِ؟ فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «ذَلِكَ الْوَأْدُ الْخَفِيُّ»، زَادَ عُبَيْدُ اللهِ فِي حَدِيثِهِ: عَنِ الْمُقْرِئِ، وَهِيَ: {وَإِذَا الْمَوْءُودَةُ سُئِلَتْ}."
      },
      {
        "id": 11130,
        "hadith_number": "3566",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Azl dan Persetubuhan dengan Wanita Menyusu",
        "perawi_melayu": "Daripada Aisyah رضي الله عنها, daripada Judamah binti Wahb al-Asadiyyah (رضي الله عنها), telah meriwayatkan bahawa:",
        "english_text": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying this. The rest of the hadith is the same concerning 'azl and ghila (cohabitating with a suckling woman), but with a slight variation of words.",
        "malay_translation": "Aku mendengar Rasulullah SAW bersabda demikian.  Bahagian lain daripada hadis ini sama tentang hukum 'azl dan ghila (persetubuhan dengan wanita yang menyusu), tetapi dengan sedikit perbezaan perkataan.",
        "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ، حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ الْقُرَشِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، عَنْ جُدَامَةَ بِنْتِ وَهْبٍ الْأَسَدِيَّةِ، أَنَّهَا قَالَتْ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَذَكَرَ بِمِثْلِ حَدِيثِ سَعِيدِ بْنِ أَبِي أَيُّوبَ فِي الْعَزْلِ، وَالْغِيلَةِ، غَيْرَ أَنَّهُ قَالَ: «الْغِيَالِ»."
      },
      {
        "id": 11131,
        "hadith_number": "3567",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Menganiaya Pasangan dan Anak-Anak",
        "perawi_melayu": "Sa'd bin Abu Waqqas (رضي الله عنه) meriwayatkan:",
        "english_text": "A person came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: I do 'azi with my wife. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Why do you do that? The person said: I fear harm to her child or her children. Thereupon Allah's Messenger (way peace be upon him) said: If that were harmful it would harm the Persians and the Greeks.",
        "malay_translation": "Seseorang datang kepada Rasulullah SAW dan berkata: Saya melakukan 'azi terhadap isteri saya.  Lalu Rasulullah SAW bertanya: Mengapa engkau berbuat demikian? Orang itu menjawab: Saya bimbang akan kemudaratan terhadap anak-anaknya. Maka Rasulullah SAW bersabda: Sekiranya perkara itu membawa mudarat, ia akan menimpa orang Parsi dan orang Yunani.",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، وَزُهَيْرُ بْنُ حَرْبٍ، وَاللَّفْظُ لِابْنِ نُمَيْرٍ، قَالَا: حَدَّثَنَا عَبْدُ اللهِ بْنُ يَزِيدَ الْمَقْبُرِيُّ، حَدَّثَنَا حَيْوَةُ، حَدَّثَنِي عَيَّاشُ بْنُ عَبَّاسٍ، أَنَّ أَبَا النَّضْرِ، حَدَّثَهُ، عَنْ عَامِرِ بْنِ سَعْدٍ، أَنَّ أُسَامَةَ بْنَ زَيْدٍ، أَخْبَرَ وَالِدَهُ سَعْدَ بْنَ أَبِي وَقَّاصٍ، أَنَّ رَجُلًا جَاءَ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: إِنِّي أَعْزِلُ عَنِ امْرَأَتِي، فَقَالَ لَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لِمَ تَفْعَلُ ذَلِكَ؟» فَقَالَ الرَّجُلُ: أُشْفِقُ عَلَى وَلَدِهَا، أَوْ عَلَى أَوْلَادِهَا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَوْ كَانَ ذَلِكَ ضَارًّا ضَرَّ فَارِسَ وَالرُّومَ»، وقَالَ زُهَيْرٌ فِي رِوَايَتِهِ: «إِنْ كَانَ لِذَلِكَ فَلَا، مَا ضَارَ ذَلِكَ فَارِسَ، وَلَا الرُّومَ»."
      }
    ]
  }
}