{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 23,
    "data": [
      {
        "id": 13425,
        "hadith_number": "5862",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Allah SWT sebagai Dahr",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Allah, the Exalted and Glorious, said: The son of Adam abuses Dahr (the time), whereas I am Dahr since in My hand are the day and the night.",
        "malay_translation": "Aku mendengar Rasulullah ﷺ bersabda: Allah Yang Maha Tinggi dan Maha Mulia berfirman: Anak Adam mencaci Dahr (masa), sedangkan Akulah Dahr kerana di tangan-Ku siang dan malam.",
        "arabic_text": "وحَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ: قَالَ أَبُو هُرَيْرَةَ سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: قَالَ اللهُ عَزَّ وَجَلَّ: «يَسُبُّ ابْنُ آدَمَ الدَّهْرَ، وَأَنَا الدَّهْرُ بِيَدِيَ اللَّيْلُ وَالنَّهَارُ»."
      },
      {
        "id": 13426,
        "hadith_number": "5863",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Allah SWT dan Masa (Dahr)",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Allah, the Exalted and Glorious, said: The son of Adam displeases Me by abusing Dahr (time), whereas I am Dahr--I alternate the night and the day.",
        "malay_translation": "Rasulullah SAW bersabda: Allah SWT berfirman: Anak Adam menyakitiku dengan mengutuk Dahr (masa), sedangkan Akulah Dahr – Akulah yang mengganti malam dan siang.",
        "arabic_text": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ - وَاللَّفْظُ لِابْنِ أَبِي عُمَرَ، قَالَ إِسْحَاقُ، أَخْبَرَنَا وقَالَ ابْنُ أَبِي عُمَرَ - حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: قَالَ اللهُ عَزَّ وَجَلَّ: «يُؤْذِينِي ابْنُ آدَمَ، يَسُبُّ الدَّهْرَ وَأَنَا الدَّهْرُ، أُقَلِّبُ اللَّيْلَ وَالنَّهَارَ»."
      },
      {
        "id": 13427,
        "hadith_number": "5864",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah SAW melarang ungkapan ‘Celaka Waktu’",
        "perawi_melayu": "Abu Hurairah رضی اللہ عنہ meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Allah, the Exalted and Glorious, said: The son of Adam causes Me pain as he says: Woe be upon the Time. None of you should say this: Woe be upon the Time, as I am the Time (because) I alternate the day and the night, and when I wish I can finish them up.",
        "malay_translation": "Rasulullah SAW bersabda: Allah SWT berfirman: Anak Adam menyakitiKu dengan ucapannya: ‘Celaka waktu!’ Janganlah sesiapa di antara kamu berkata demikian, kerana Akulah Waktu; Akulah yang mengganti siang dan malam, dan apabila Aku berkehendak, Aku akan menghapuskannya.",
        "arabic_text": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: قَالَ اللهُ عَزَّ وَجَلَّ: يُؤْذِينِي ابْنُ آدَمَ يَقُولُ: يَا خَيْبَةَ الدَّهْرِ فَلَا يَقُولَنَّ أَحَدُكُمْ: يَا خَيْبَةَ الدَّهْرِ فَإِنِّي أَنَا الدَّهْرُ، أُقَلِّبُ لَيْلَهُ وَنَهَارَهُ، فَإِذَا شِئْتُ قَبَضْتُهُمَا."
      },
      {
        "id": 13428,
        "hadith_number": "5865",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Jangan Mengutuk Masa",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: None of you should say: Woe be upon the Time, for verily Allah is the Time.",
        "malay_translation": "Rasulullah SAW bersabda: “Tiada seorang pun di antara kamu hendaklah berkata: ‘Celaka masa ini!’ Sesungguhnya Allah jualah masa itu.”",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَقُولَنَّ أَحَدُكُمْ يَا خَيْبَةَ الدَّهْرِ، فَإِنَّ اللهَ هُوَ الدَّهْرُ»."
      },
      {
        "id": 13429,
        "hadith_number": "5866",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Jangan Sia-siakan Masa",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Do not abuse Time, for it is Allah Who is the Time.",
        "malay_translation": "Rasulullah SAW bersabda: Janganlah kamu sia-siakan masa, kerana Allah jualah Masa itu.",
        "arabic_text": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ هِشَامٍ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَسُبُّوا الدَّهْرَ، فَإِنَّ اللهَ هُوَ الدَّهْرُ»."
      },
      {
        "id": 13430,
        "hadith_number": "5867",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Jangan Membazir Masa dan Sebutan Anggur",
        "perawi_melayu": "Abu Hurairah رضی اللہ عنہ meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: None of you should abuse Time for it is Allah Who is the Time, and none of you should call 'Inab (grape) as al-karm, for karm is a Muslim person.",
        "malay_translation": "Rasulullah ﷺ bersabda: “Tiada seorang pun di antara kamu harus membazirkan masa, kerana Allah jualah yang menentukan masa, dan tiada seorang pun di antara kamu harus memanggil ‘Inab (anggur) sebagai al-karm, kerana karm ialah orang Islam.”",
        "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَسُبُّ أَحَدُكُمُ الدَّهْرَ، فَإِنَّ اللهَ هُوَ الدَّهْرُ وَلَا يَقُولَنَّ أَحَدُكُمْ لِلْعِنَبِ الْكَرْمَ، فَإِنَّ الْكَرْمَ الرَّجُلُ الْمُسْلِمُ»."
      },
      {
        "id": 13431,
        "hadith_number": "5868",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Menggunakan Perkataan 'Karm' untuk Arak",
        "perawi_melayu": "Abu Hurairah meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Do not use the word karm (for wine) for worthy of respect is the heart of a believer.",
        "malay_translation": "Rasulullah SAW bersabda: Janganlah kamu menggunakan perkataan 'karm' (untuk arak) kerana hati orang yang beriman itu mulia.",
        "arabic_text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَابْنُ أَبِي عُمَرَ، قَالَا: حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَقُولُوا كَرْمٌ فَإِنَّ الْكَرْمَ، قَلْبُ الْمُؤْمِنِ»."
      },
      {
        "id": 13432,
        "hadith_number": "5869",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Menggunakan Nama Lain untuk Anggur",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Do not name grape as karm, for worthy of respect is a Muslim.",
        "malay_translation": "Rasulullah ﷺ bersabda: Janganlah kamu menamakan anggur dengan nama ‘karm’, kerana seorang Muslim itu layak dihormati.",
        "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ هِشَامٍ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تُسَمُّوا الْعِنَبَ الْكَرْمَ، فَإِنَّ الْكَرْمَ الرَّجُلُ الْمُسْلِمُ»."
      },
      {
        "id": 13433,
        "hadith_number": "5870",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Jangan Sebut Hati Orang Mukmin Sebagai 'al-Harin'",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: None of you should use the word al-harin (for grape) for the heart of a believer is karm (worthy of respect).",
        "malay_translation": "Rasulullah SAW bersabda: “Tiada seorang pun di antara kamu menggunakan perkataan al-harīn (untuk anggur) kerana hati orang yang beriman itu karm (bernilai dan mulia).",
        "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَلِيُّ بْنُ حَفْصٍ، حَدَّثَنَا وَرْقَاءُ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَقُولَنَّ أَحَدُكُمُ الْكَرْمُ، فَإِنَّمَا الْكَرْمُ قَلْبُ الْمُؤْمِنِ»."
      },
      {
        "id": 13434,
        "hadith_number": "5871",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Jangan Panggil Anggur 'Al-Karm'",
        "perawi_melayu": "Daripada Hammam bin Munabbih, katanya:",
        "english_text": "That is what Abu Hurairah رضی اللہ عنہ narrated to us from the Messenger of Allah ﷺ, and he mention a number of Ahadith, including the following: \"The Messenger of Allah ﷺ said: 'None of you should call grapes al-karm for 'Inab, for karm (worthy of respect) is a Muslim person.",
        "malay_translation": "Demikianlah yang diriwayatkan oleh Abu Hurairah رضی اللہ عنہ daripada Rasulullah ﷺ, dan beliau menyebut beberapa hadis, antaranya:  Rasulullah ﷺ bersabda:  'Tiada seorang pun di antara kamu yang harus memanggil anggur dengan nama al-karm sebagai ganti 'Inab, kerana karm (yang layak dihormati) ialah seorang Muslim.'",
        "arabic_text": "وَحَدَّثَنَا ابْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ: هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَا، وَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَقُولَنَّ أَحَدُكُمْ، لِلْعِنَبِ الْكَرْمَ، إِنَّمَا الْكَرْمُ الرَّجُلُ الْمُسْلِمُ»."
      },
      {
        "id": 13435,
        "hadith_number": "5872",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Menggunakan Perkataan \"Al-Karm\"",
        "perawi_melayu": "Alqama bin Wa'il meriwayatkan daripada bapanya:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said: Do not say al-karm (for the word vine) but say al-habala (that is grape).",
        "malay_translation": "Rasulullah SAW bersabda: Janganlah kamu mengatakan al-karm (untuk perkataan pokok anggur), tetapi katakanlah al-habala (iaitu buah anggur).",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عِيسَى يَعْنِي ابْنَ يُونُسَ، عَنْ شُعْبَةَ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ عَلْقَمَةَ بْنِ وَائِلٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا تَقُولُوا: الْكَرْمُ، وَلَكِنْ قُولُوا الْحَبْلَةُ يَعْنِي الْعِنَبَ."
      },
      {
        "id": 13436,
        "hadith_number": "5873",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Menggunakan Perkataan \"Karm\"",
        "perawi_melayu": "Hadis ini diriwayatkan oleh Alqama bin Wa'il daripada bapanya bahawa Nabi ﷺ bersabda:",
        "english_text": "\"Do not say Karm, rather say 'Inab and Hablah.",
        "malay_translation": "\"Janganlah kamu berkata 'Karm', sebaliknya katakanlah 'Inab' dan 'Hablah'.",
        "arabic_text": "وحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكٍ، قَالَ: سَمِعْتُ عَلْقَمَةَ بْنَ وَائِلٍ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَقُولُوا الْكَرْمُ وَلَكِنْ قُولُوا الْعِنَبُ وَالْحَبْلَةُ»."
      },
      {
        "id": 13437,
        "hadith_number": "5874",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Menggunakan Gelaran Hamba dan Penuh",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: None of you should say: My bondman and my slave-girl, for all of you are the bondmen of Allah, and all your women are the slave-girls of Allah; but say: My servant, my girl, and my young man and my young girl.",
        "malay_translation": "Rasulullah ﷺ bersabda: “Tiada seorang pun di antara kamu harus berkata: ‘hamba lelakiku’ dan ‘hamba perempuanku’, kerana sesungguhnya kamu semua adalah hamba Allah, dan wanita-wanita kamu juga adalah hamba Allah.  Sebaliknya katakanlah: ‘pelayan lelakiku’, ‘pelayan perempuanku’, ‘anak lelakiku’ dan ‘anak perempuanku’.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ حُجْرٍ، قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ وَهُوَ ابْنُ جَعْفَرٍ، عَنِ الْعَلَاءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَقُولَنَّ أَحَدُكُمْ عَبْدِي وَأَمَتِي كُلُّكُمْ عَبِيدُ اللهِ، وَكُلُّ نِسَائِكُمْ إِمَاءُ اللهِ، وَلَكِنْ لِيَقُلْ غُلَامِي وَجَارِيَتِي وَفَتَايَ وَفَتَاتِي»."
      },
      {
        "id": 13438,
        "hadith_number": "5875",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Menggunakan Gelaran 'Hamba'",
        "perawi_melayu": "Abu Hurairah رضی اللہ عنہ meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: None of you should say: My bondman, for all of you are the bondmen of Allah, but say: My young man, and the servant should not say: My Lord, but should say: My chief.",
        "malay_translation": "Rasulullah SAW bersabda: “Tiada seorang pun di antara kamu harus berkata: ‘hambaku’, kerana kamu semua adalah hamba Allah.  Tetapi katakanlah: ‘pemuda-pemuda ku’, dan hamba janganlah berkata: ‘Tuhanku’, tetapi hendaklah berkata: ‘ketuaku’.",
        "arabic_text": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الْأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: لَا يَقُولَنَّ أَحَدُكُمْ: عَبْدِي، فَكُلُّكُمْ عَبِيدُ اللهِ، وَلَكِنْ لِيَقُلْ: فَتَايَ، وَلَا يَقُلِ الْعَبْدُ: رَبِّي، وَلَكِنْ لِيَقُلْ: سَيِّدِي."
      },
      {
        "id": 13439,
        "hadith_number": "5876",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Hamba Mengajak Tuanya Dengan Sebutan 'Tuhanku'",
        "perawi_melayu": "Daripada al-A'mash melalui sanad yang sama.",
        "english_text": "This hadith has been reported on the authority of al-A'mash with the same chain of transmitters, and the words are that the servant should not say to his chief: My Lord, and Abu Mu'awiya made an addition: For it is Allah, the Exalted and Glorious, Who is your Lord.",
        "malay_translation": "Hadis ini diriwayatkan daripada al-A'mash dengan sanad yang sama, dan maksudnya ialah seorang hamba tidak sepatutnya berkata kepada tuannya: \"Tuhanku\".  Abu Muawiyah menambah: Kerana Allah SWT jualah Tuhanmu.",
        "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ، حَدَّثَنَا وَكِيعٌ، كِلَاهُمَا عَنِ الْأَعْمَشِ، بِهَذَا الْإِسْنَادِ، وَفِي حَدِيثِهِمَا وَلَا يَقُلِ الْعَبْدُ لِسَيِّدِهِ مَوْلَايَ وَزَادَ فِي حَدِيثِ أَبِي مُعَاوِيَةَ فَإِنَّ مَوْلَاكُمُ اللهُ عَزَّ وَجَلَّ وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الْأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: لَا يَقُولَنَّ أَحَدُكُمْ: عَبْدِي، فَكُلُّكُمْ عَبِيدُ اللهِ، وَلَكِنْ لِيَقُلْ: فَتَايَ، وَلَا يَقُلِ الْعَبْدُ: رَبِّي، وَلَكِنْ لِيَقُلْ: سَيِّدِي."
      },
      {
        "id": 13440,
        "hadith_number": "5877",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Adab Berdoa dan Merujuk kepada Allah",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) so many ahadith and one of them is this that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: None of you should say: Supply drink to your lord, feed your lord, help your lord in performing ablution, and none of you should say: My Lord. He should say: My chief, my patron; and none of you should say: My bondman, my slave-girl, but simply say: My boy, my girl, my servant.",
        "malay_translation": "Rasulullah ﷺ bersabda: “Janganlah sesiapa di antara kamu berkata: Berikan minuman kepada Tuhanmu, beri makan kepada Tuhanmu, bantulah Tuhanmu dalam berwuduk.  Dan janganlah sesiapa di antara kamu berkata: Tuhanku.  Katakanlah: Penghulu ku, pelindungku. Dan janganlah sesiapa di antara kamu berkata: Hamba lelakiku, hamba perempuanku, tetapi katakanlah: Anak lelakiku, anak perempuanku, pelayan ku.”",
        "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ: هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَقُلْ أَحَدُكُمُ اسْقِ رَبَّكَ، أَطْعِمْ رَبَّكَ، وَضِّئْ رَبَّكَ، وَلَا يَقُلْ أَحَدُكُمْ رَبِّي، وَلْيَقُلْ سَيِّدِي مَوْلَايَ، وَلَا يَقُلْ أَحَدُكُمْ عَبْدِي أَمَتِي، وَلْيَقُلْ فَتَايَ فَتَاتِي غُلَامِي»."
      },
      {
        "id": 13441,
        "hadith_number": "5878",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Jangan Kata Jiwa Saya Jahat, Tetapi Kata Jiwa Saya Keras Hati",
        "perawi_melayu": "Aisyah رضي الله عنها meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said: None of you should say: My soul has become evil, but he should say: My soul has become remorseless. This hadith has been transmitted on the authority of Abu Bakr with a slight variation of wording.",
        "malay_translation": "Rasulullah SAW bersabda:  “Tiada seorang pun di antara kamu harus berkata: ‘Jiwa saya telah menjadi jahat’, tetapi hendaklah dia berkata: ‘Jiwa saya telah menjadi keras hati’. Hadis ini diriwayatkan daripada Abu Bakar dengan sedikit perbezaan lafaz.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ، حَدَّثَنَا أَبُو أُسَامَةَ، كِلَاهُمَا عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَقُولَنَّ أَحَدُكُمْ خَبُثَتْ نَفْسِي، وَلَكِنْ لِيَقُلْ لَقِسَتْ نَفْسِي» هَذَا حَدِيثُ أَبِي كُرَيْبٍ وقَالَ: أَبُو بَكْرٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَلَمْ يَذْكُرْ «لَكِنْ»."
      },
      {
        "id": 13442,
        "hadith_number": "5879",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Sanad Hadis daripada Abia Mu'iwiya",
        "perawi_melayu": "Abia Mu'iwiya dan sanad yang sama",
        "english_text": "This hadith has been narrated on the authority of Abia Mu'iwiya with the same chain of transmitters.",
        "malay_translation": "Hadis ini diriwayatkan melalui Abia Mu'iwiya dengan sanad perawi yang sama.",
        "arabic_text": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، بِهَذَا الْإِسْنَادِ."
      },
      {
        "id": 13443,
        "hadith_number": "5880",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Jangan Mengatakan Jiwa Saya Jahat",
        "perawi_melayu": "Abu Umamah bin Sahl bin Hunayf, daripada bapanya meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: None of you should say: My soul has become evil, but he should say: My soul has become remorseless.",
        "malay_translation": "Rasulullah SAW bersabda: “Tiada seorang pun di antara kamu hendaklah berkata: ‘Jiwa saya telah menjadi jahat’, tetapi hendaklah dia berkata: ‘Jiwa saya telah menjadi lalai’.",
        "arabic_text": "وحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَقُلْ أَحَدُكُمْ خَبُثَتْ نَفْسِي، وَلْيَقُلْ لَقِسَتْ نَفْسِي»."
      },
      {
        "id": 13444,
        "hadith_number": "5881",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Wanita Bani Israil yang Sederhana",
        "perawi_melayu": "Abu Sa'id Khudri رضی اللہ عنہ meriwayatkan",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There was a woman from Bani Isra'il who was short-statured and she walked in the company of two tall women with wooden sandals in her feet and a ring of gold made of plates with musk filled in them and then looked up, and musk is the best of scents; then she walked between two women and they (the people) did not recognise her, and she made a gesture with her hand like this, and Shu'ba shook his hand in order to give an indication how she shook her hand.",
        "malay_translation": "Rasulullah SAW bersabda:  “Terdapat seorang wanita dari Bani Israil yang berperawakan rendah. Dia berjalan di antara dua orang wanita yang tinggi dengan memakai sandal kayu, dan sebentuk cincin emas yang diperbuat daripada kepingan-kepingan yang diisi dengan kasturi, kemudian dia mendongak. Kasturi adalah wangian yang terbaik. Kemudian dia berjalan di antara dua orang wanita dan mereka (orang ramai) tidak mengenalinya.  Dia membuat isyarat dengan tangannya seperti ini,” dan Syu’bah menggerakkan tangannya untuk menunjukkan bagaimana wanita itu menggerakkan tangannya.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ شُعْبَةَ، حَدَّثَنِي خُلَيْدُ بْنُ جَعْفَرٍ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كَانَتِ امْرَأَةٌ مِنْ بَنِي إِسْرَائِيلَ، قَصِيرَةٌ تَمْشِي مَعَ امْرَأَتَيْنِ طَوِيلَتَيْنِ، فَاتَّخَذَتْ رِجْلَيْنِ مِنْ خَشَبٍ، وَخَاتَمًا مِنْ ذَهَبٍ مُغْلَقٌ مُطْبَقٌ، ثُمَّ حَشَتْهُ مِسْكًا، وَهُوَ أَطْيَبُ الطِّيبِ، فَمَرَّتْ بَيْنَ الْمَرْأَتَيْنِ، فَلَمْ يَعْرِفُوهَا، فَقَالَتْ بِيَدِهَا هَكَذَا» وَنَفَضَ شُعْبَةُ يَدَهُ."
      },
      {
        "id": 13445,
        "hadith_number": "5882",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Wanita Bani Israel dan Wangian Kasturi",
        "perawi_melayu": "Abu Said al-Khudri رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) made a mention of a woman of Bana Isra'il who had filled her ring with musk and musk is the most fragrant of the scents.",
        "malay_translation": "Rasulullah SAW menyebut tentang seorang wanita Bani Israil yang telah mengisi cincinnya dengan kasturi, dan kasturi adalah wangian yang paling harum.",
        "arabic_text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ شُعْبَةَ، عَنْ خُلَيْدِ بْنِ جَعْفَرٍ، وَالْمُسْتَمِرِّ، قَالَا: سَمِعْنَا أَبَا نَضْرَةَ، يُحَدِّثُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ذَكَرَ امْرَأَةً مِنْ بَنِي إِسْرَائِيلَ، حَشَتْ خَاتَمَهَا مِسْكًا، وَالْمِسْكُ أَطْيَبُ الطِّيبِ."
      },
      {
        "id": 13446,
        "hadith_number": "5883",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Menerima Kurniaan",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who is presented with a flower should not reject it, for it is light to carry and pleasant in odour.",
        "malay_translation": "Rasulullah ﷺ bersabda: Barang siapa yang diberi sekuntum bunga, maka janganlah dia menolaknya, kerana ia ringan untuk dibawa dan harum baunya.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، كِلَاهُمَا عَنِ الْمُقْرِئِ، قَالَ أَبُو بَكْرٍ: حَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ الْمُقْرِئُ، عَنْ سَعِيدِ بْنِ أَبِي أَيُّوبَ، حَدَّثَنِي عُبَيْدُ اللهِ بْنُ أَبِي جَعْفَرٍ، عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ عُرِضَ عَلَيْهِ رَيْحَانٌ فَلَا يَرُدُّهُ، فَإِنَّهُ خَفِيفُ الْمَحْمِلِ طَيِّبُ الرِّيحِ»."
      },
      {
        "id": 13447,
        "hadith_number": "5884",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Cara Rasulullah SAW melakukan pengasapan",
        "perawi_melayu": "Nafi' meriwayatkan:",
        "english_text": "When Ibn Umar رضی اللہ عنہ wanted fumigation he got it from aloeswood without mixing anything with it, or he put camphor along with aloeswood and then said: This is how Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) fumigated.",
        "malay_translation": "Apabila Ibnu Umar رضی اللہ عنہ ingin melakukan pengasapan, baginda menggunakan kayu gaharu tanpa mencampurkan apa-apa, atau baginda mencampurkan kapur barus bersama kayu gaharu dan kemudian berkata: Inilah cara Rasulullah SAW melakukan pengasapan.",
        "arabic_text": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، وَأَبُو طَاهِرٍ، وَأَحْمَدُ بْنُ عِيسَى، - قَالَ أَحْمَدُ: حَدَّثَنَا، وقَالَ الْآخَرَانِ - أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَخْرَمَةُ، عَنْ أَبِيهِ، عَنْ نَافِعٍ، قَالَ: كَانَ ابْنُ عُمَرَ «إِذَا اسْتَجْمَرَ اسْتَجْمَرَ بِالْأَلُوَّةِ، غَيْرَ مُطَرَّاةٍ وَبِكَافُورٍ، يَطْرَحُهُ مَعَ الْأَلُوَّةِ» ثُمَّ قَالَ: «هَكَذَا كَانَ يَسْتَجْمِرُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ»."
      }
    ]
  }
}