{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 91,
    "data": [
      {
        "id": 11216,
        "hadith_number": "3652",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perceraian semasa Haid dan Tempoh Menunggu",
        "perawi_melayu": "Ibn 'Umar (رضي الله عنه) meriwayatkan:",
        "english_text": "He divorced his wife while she was menstruating during the lifetime of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم). 'Umar bin Khattib (رضي الله عنه) asked Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about it, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) said: Command him ('Abdullah bin 'Umar) to take her back (and keep her) and pronounce divorce when she is purified and she again enters the period of menstruation and she is again purified (after passing the period of menses), and then if he so desires he may keep her and if he desires divorce her (finally) before touching her (without having an intercourse with her), for that is the period of waiting ('ldda) which God, the Exalted and Glorious, has commanded for the divorce of women.",
        "malay_translation": "Beliau menceraikan isterinya ketika isterinya sedang haid semasa hayat Rasulullah SAW. 'Umar bin al-Khattab RA bertanya kepada Rasulullah SAW tentang hal itu, lalu Rasulullah SAW bersabda: Suruhlah dia ('Abdullah bin 'Umar) mengambil kembali isterinya dan melafazkan talak apabila dia suci dan memasuki tempoh haid yang kedua dan suci (selepas tempoh haid), dan jika dia menginginkannya, dia boleh memeliharanya dan jika dia menginginkannya, dia boleh menceraikannya (akhirnya) sebelum menyentuhnya (tanpa melakukan hubungan seksual dengannya), kerana itulah tempoh menunggu ('iddah) yang Allah SWT perintahkan untuk perceraian wanita.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، قَالَ: قَرَأْتُ عَلَى مَالِكِ بْنِ أَنَسٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ طَلَّقَ امْرَأَتَهُ، وَهِيَ حَائِضٌ فِي عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَسَأَلَ عُمَرُ بْنُ الْخَطَّابِ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ، فَقَالَ لَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مُرْهُ فَلْيُرَاجِعْهَا، ثُمَّ لِيَتْرُكْهَا حَتَّى تَطْهُرَ، ثُمَّ تَحِيضَ، ثُمَّ تَطْهُرَ، ثُمَّ إِنْ شَاءَ أَمْسَكَ بَعْدُ، وَإِنْ شَاءَ طَلَّقَ قَبْلَ أَنْ يَمَسَّ، فَتِلْكَ الْعِدَّةُ الَّتِي أَمَرَ اللهُ عَزَّ وَجَلَّ أَنْ يُطَلَّقَ لَهَا النِّسَاءُ."
      },
      {
        "id": 11217,
        "hadith_number": "3653",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Arahan Mengenai Perceraian Semasa Haid",
        "perawi_melayu": "Abdullah bin 'Umar رضی اللہ عنہ meriwayatkan:",
        "english_text": "He divorced a wife of his with the pronouncement of one divorce during the period of menstruation. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded him to take her back and keep her until she was purified, and then she entered the period of menses in his (house) for the second time. And he should wait until she was purified of her menses. And then if he would decide to divorce her, he should do so when she was purified before having a sexual intercourse with her; for that was the 'Idda which Allah had commanded for the divorce of women. Ibn Rumh in his narration made this addition: When 'Abdullah رضی اللہ عنہ was asked about it, he said to one of them: If you have divorced your wife with one pronouncement or two (then you can take her back), for Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded me to do it; but if you have divorced her with three pronouncements, then she is forbidden for you until she married another husband, and you disobeyed Allah in regard to the divorce of your wife what He had commanded you. (Muslim said: The word one divorce used by Laith is good.)",
        "malay_translation": "Beliau menceraikan isterinya dengan satu kali talak ketika isterinya sedang haid. Rasulullah SAW memerintahkannya untuk mengambil kembali isterinya dan memeliharanya sehingga suci daripada haid. Sekiranya isterinya datang haid buat kali kedua di rumahnya, maka dia perlu menunggu sehingga suci daripada haid.  Jika ingin menceraikan isterinya kemudian, hendaklah dilakukan ketika dia suci sebelum melakukan hubungan seksual dengannya; kerana itulah tempoh 'iddah yang Allah telah perintahkan untuk perceraian wanita. Ibn Rumh menambah dalam riwayatnya: Apabila Abdullah رضي الله عنه ditanya tentang hal ini, beliau berkata kepada salah seorang daripada mereka: Jika anda menceraikan isteri anda dengan satu atau dua kali talak (maka anda boleh mengambilnya kembali), kerana Rasulullah SAW telah memerintahkan saya untuk melakukannya. Namun, jika anda menceraikannya dengan tiga kali talak, maka isteri anda haram bagi anda sehingga dia berkahwin dengan lelaki lain, dan anda telah mengingkari perintah Allah berkenaan perceraian isteri anda. (Muslim berkata: Perkataan \"satu kali talak\" yang digunakan oleh Laith adalah tepat.)",
        "arabic_text": ") حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَقُتَيْبَةُ، وَابْنُ رُمْح، وَاللَّفْظُ لِيَحْيَى، قَالَ قُتَيْبَةُ: حَدَّثَنَا لَيْثٌ، وَقَالَ الْآخَرَانِ: أَخْبَرَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللهِ، أَنَّهُ «طَلَّقَ امْرَأَةً لَهُ وَهِيَ حَائِضٌ تَطْلِيقَةً وَاحِدَةً، فَأَمَرَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يُرَاجِعَهَا، ثُمَّ يُمْسِكَهَا حَتَّى تَطْهُرَ، ثُمَّ تَحِيضَ عِنْدَهُ حَيْضَةً أُخْرَى، ثُمَّ يُمْهِلَهَا حَتَّى تَطْهُرَ مِنْ حَيْضَتِهَا، فَإِنْ أَرَادَ أَنْ يُطَلِّقَهَا فَلْيُطَلِّقْهَا حِينَ تَطْهُرُ مِنْ قَبْلِ أَنْ يُجَامِعَهَا، فَتِلْكَ الْعِدَّةُ الَّتِي أَمَرَ اللهُ أَنْ يُطَلَّقَ لَهَا النِّسَاءُ»، وَزَادَ ابْنُ رُمْح فِي رِوَايَتِهِ: وَكَانَ عَبْدُ اللهِ إِذَا سُئِلَ عَنْ ذَلِكَ، قَالَ لِأَحَدِهِمْ: أَمَّا أَنْتَ طَلَّقْتَ امْرَأَتَكَ مَرَّةً أَوْ مَرَّتَيْنِ، فَإِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَمَرَنِي بِهَذَا، وَإِنْ كُنْتَ طَلَّقْتَهَا ثَلَاثًا، فَقَدْ حَرُمَتْ عَلَيْكَ، حَتَّى تَنْكِحَ زَوْجًا غَيْرَكَ، وَعَصَيْتَ اللهَ فِيمَا أَمَرَكَ مِنْ طَلَاقِ امْرَأَتِكَ، قَالَ مُسْلِمٌ: «جَوَّدَ اللَّيْثُ فِي قَوْلِهِ تَطْلِيقَةً وَاحِدَةً»."
      },
      {
        "id": 11218,
        "hadith_number": "3654",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Cerai Ketika Haid",
        "perawi_melayu": "Ibn Umar (رضي الله عنه) meriwayatkan:",
        "english_text": "I divorced my wife during the lifetime of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) when she was in the state of menses. 'Umar (رضی اللہ عنہ ) made a mention of it to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), whereupon he said: Command him to take her back and leave her (in that state) until she is purified. Then (let her) enter the period of second menses, and when she is purified, then divorce her (finally) before having a sexual intercourse with her, or retain her (finally). That is the 'Idda (the prescribed period) which Allah commanded (to be kept in view) while divorcing the women. 'Ubaidullah reported: I said to Nafi': What became of that divorce (pronounced within 'Idda)? He said: It was as one which she counted.",
        "malay_translation": "Aku menceraikan isteriku semasa Rasulullah SAW masih hidup ketika dia dalam keadaan haid. 'Umar r.a. telah mengadu hal ini kepada Rasulullah SAW, lalu baginda bersabda: Suruh dia mengambil kembali isterinya dan biarkan dia (dalam keadaan haid) sehingga suci. Kemudian biar dia menjalani tempoh haid kedua, dan apabila dia suci, maka ceraikan dia (akhirnya) sebelum melakukan hubungan seksual dengannya, atau tahan dia (akhirnya). Itulah iddah (tempoh yang ditetapkan) yang Allah perintahkan (diperhatikan) ketika menceraikan wanita. 'Ubaidullah meriwayatkan: Aku bertanya kepada Nafi': Bagaimana pula dengan perceraian (yang dijatuhkan semasa iddah)? Dia menjawab: Ia dianggap seperti perceraian yang dikira.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: طَلَّقْتُ امْرَأَتِي عَلَى عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهِيَ حَائِضٌ، فَذَكَرَ ذَلِكَ عُمَرُ لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «مُرْهُ فَلْيُرَاجِعْهَا، ثُمَّ لِيَدَعْهَا حَتَّى تَطْهُرَ، ثُمَّ تَحِيضَ حَيْضَةً أُخْرَى، فَإِذَا طَهُرَتْ فَلْيُطَلِّقْهَا قَبْلَ أَنْ يُجَامِعَهَا، أَوْ يُمْسِكْهَا، فَإِنَّهَا الْعِدَّةُ الَّتِي أَمَرَ اللهُ أَنْ يُطَلَّقَ لَهَا النِّسَاءُ». قَالَ عُبَيْدُ اللهِ: قُلْتُ لِنَافِعٍ: مَا صَنَعَتِ التَّطْلِيقَةُ؟ قَالَ: «وَاحِدَةٌ اعْتَدَّ بِهَا."
      },
      {
        "id": 11219,
        "hadith_number": "3655",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Penjelasan Mengenai Perceraian dan Kembalinya Kepada Istri",
        "perawi_melayu": "Ubaidullah",
        "english_text": "A hadith like this has been narrated on the authority of 'Ubaidullah, but he made no mention of the words of Ubaidullah that he said to Nafi'.",
        "malay_translation": "Hadis seperti ini telah diriwayatkan berdasarkan perawi 'Ubaidullah, tetapi beliau tidak menyebut perkataan Ubaidullah kepada Nafi'.",
        "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ عُبَيْدِ اللَّهِ، بِهَذَا الإِسْنَادِ ‏.‏ نَحْوَهُ وَلَمْ يَذْكُرْ قَوْلَ عُبَيْدِ اللَّهِ لِنَافِعٍ ‏.‏ قَالَ ابْنُ الْمُثَنَّى فِي رِوَايَتِهِ فَلْيَرْجِعْهَا ‏.‏ وَقَالَ أَبُو بَكْرٍ فَلْيُرَاجِعْهَا ‏.‏"
      },
      {
        "id": 11220,
        "hadith_number": "3656",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Perceraian Semasa Haid dan Panduannya",
        "perawi_melayu": "Daripada Nafi' :",
        "english_text": "Ibn 'Umar (رضی اللہ عنہ) menceraikan isterinya ketika dia sedang haid. 'Umar (رضی اللہ عنہ) bertanya kepada Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), dan baginda memerintahkannya ('Abdullah bin 'Umar رضي الله عنه) untuk mengambilnya kembali, dan kemudian memberinya tempoh sehingga dia memasuki haid kedua, dan kemudian memberinya tempoh sehingga suci, kemudian menceraikannya (akhirnya) sebelum menyentuhnya (berhubungan seksual dengannya), kerana itulah tempoh yang ditetapkan oleh Allah untuk menceraikan wanita. Apabila Ibn 'Umar (رضی اللہ عنہ) ditanya tentang orang yang menceraikan isterinya ketika haid, beliau berkata: Jika anda mengucapkan satu atau dua kali talak, Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) telah memerintahkannya untuk mengambilnya kembali, dan kemudian memberinya tempoh sehingga dia memasuki haid kedua, dan kemudian memberinya tempoh sehingga suci, dan kemudian menceraikannya (akhirnya) sebelum menyentuhnya (berhubungan seksual dengannya); dan jika anda mengucapkan (tiga talak sekali gus), maka anda telah mengingkari Tuhan anda berkenaan apa yang telah Dia perintahkan kepada anda tentang menceraikan isteri anda. Namun begitu, perceraian tetap berlaku.",
        "malay_translation": "Ibn 'Umar (رضي الله عنه) menceraikan isterinya ketika dia sedang dalam keadaan haid.  'Umar (رضي الله عنه) bertanya kepada Rasulullah (صلى الله عليه وسلم), dan baginda memerintahkan 'Abdullah bin 'Umar (رضي الله عنه) untuk mengambil kembali isterinya, kemudian memberinya tempoh sehingga dia memasuki haid kedua, dan kemudian tempoh lagi sehingga dia suci, lalu diceraikannya (akhirnya) sebelum menyentuhnya (berhubungan seksual dengannya).  Ini kerana itulah tempoh yang ditetapkan Allah untuk menceraikan seorang wanita. Apabila Ibn 'Umar (رضي الله عنه) ditanya tentang seseorang yang menceraikan isterinya semasa haid, beliau menjawab: Sekiranya seseorang mengucapkan satu atau dua kali talak, Rasulullah (صلى الله عليه وسلم) telah memerintahkannya untuk mengambil kembali isterinya, kemudian memberinya tempoh sehingga memasuki haid kedua, kemudian tempoh lagi sehingga suci, lalu diceraikannya (akhirnya) sebelum menyentuhnya (berhubungan seksual dengannya).  Namun, jika seseorang mengucapkan tiga talak sekali gus, dia telah mengingkari perintah Allah tentang perceraian.  Walau bagaimanapun, perceraian itu tetap sah.",
        "arabic_text": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ، فَسَأَلَ عُمَرُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، «فَأَمَرَهُ أَنْ يَرْجِعَهَا، ثُمَّ يُمْهِلَهَا حَتَّى تَحِيضَ حَيْضَةً أُخْرَى، ثُمَّ يُمْهِلَهَا حَتَّى تَطْهُرَ، ثُمَّ يُطَلِّقَهَا قَبْلَ أَنْ يَمَسَّهَا، فَتِلْكَ الْعِدَّةُ الَّتِي أَمَرَ اللهُ أَنْ يُطَلَّقَ لَهَا النِّسَاءُ». قَالَ: فَكَانَ ابْنُ عُمَرَ إِذَا سُئِلَ عَنِ الرَّجُلِ يُطَلِّقُ امْرَأَتَهُ وَهِيَ حَائِضٌ، يَقُولُ: أَمَّا أَنْتَ طَلَّقْتَهَا وَاحِدَةً أَوِ اثْنَتَيْنِ، إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُ أَنْ يَرْجِعَهَا، ثُمَّ يُمْهِلَهَا حَتَّى تَحِيضَ حَيْضَةً أُخْرَى، ثُمَّ يُمْهِلَهَا حَتَّى تَطْهُرَ، ثُمَّ يُطَلِّقَهَا قَبْلَ أَنْ يَمَسَّهَا، وَأَمَّا أَنْتَ طَلَّقْتَهَا ثَلَاثًا، فَقَدْ عَصَيْتَ رَبَّكَ فِيمَا أَمَرَكَ بِهِ مِنْ طَلَاقِ امْرَأَتِكَ، وَبَانَتْ مِنْكَ."
      },
      {
        "id": 11221,
        "hadith_number": "3657",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkara Perceraian Ketika Haid",
        "perawi_melayu": "Abdullah bin 'Umar (رضي الله عنه) meriwayatkan:",
        "english_text": "I divorced my wife while she was in the state of menses. 'Umar (رضی اللہ عنہ) made mention of it to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he was enraged and he said: Command him to take her back until she enters the second ensuing menses other than the one in which he divorced her and in case he deems proper to divorce her, he should pronounce divorce (finally) before touching her (in the period) when she is purified of her menses, and that is the prescribed period in regard to divorce as Allah has commanded. 'Abdullah رضی اللہ عنہ made a pronouncement of one divorce and it was counted in case of divorce. 'Abdullah رضي الله عنه took her back as Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had commanded him.",
        "malay_translation": "Aku menceraikan isteriku ketika dia dalam keadaan haid. 'Umar (رضي الله عنه) melaporkannya kepada Rasulullah ( ‌صلي الله عليه وسلم ‌) dan baginda sangat marah serta bersabda: Suruhlah dia mengambil kembali isterinya sehingga dia memasuki haid yang kedua selepas haid di mana dia menceraikannya. Dan jika dia mahu menceraikannya, hendaklah dia mengucapkan talak (akhirnya) sebelum menyentuhnya (pada tempoh) ketika dia suci daripada haid, dan itulah tempoh yang ditentukan dalam hal perceraian seperti yang diperintahkan oleh Allah. 'Abdullah رضي الله عنه mengucapkan satu kali talak dan ia dikira dalam kes perceraian. 'Abdullah رضي الله عنه mengambil kembali isterinya seperti yang diperintahkan oleh Rasulullah ( ‌صلي الله عليه وسلم ‌).",
        "arabic_text": "حَدَّثَنِي عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا مُحَمَّدٌ، وَهُوَ ابْنُ أَخِي الزُّهْرِيِّ، عَنْ عَمِّهِ، أَخْبَرَنَا سَالِمُ بْنُ عَبْدِ اللهِ، أَنَّ عَبْدَ اللهِ بْنَ عُمَرَ، قَالَ: طَلَّقْتُ امْرَأَتِي وَهِيَ حَائِضٌ، فَذَكَرَ ذَلِكَ عُمَرُ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَتَغَيَّظَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ثُمَّ قَالَ: «مُرْهُ فَلْيُرَاجِعْهَا حَتَّى تَحِيضَ حَيْضَةً أُخْرَى مُسْتَقْبَلَةً سِوَى حَيْضَتِهَا الَّتِي طَلَّقَهَا فِيهَا، فَإِنْ بَدَا لَهُ أَنْ يُطَلِّقَهَا، فَلْيُطَلِّقْهَا طَاهِرًا مِنْ حَيْضَتِهَا قَبْلَ أَنْ يَمَسَّهَا، فَذَلِكَ الطَّلَاقُ لِلْعِدَّةِ كَمَا أَمَرَ اللهُ»، وَكَانَ عَبْدُ اللهِ طَلَّقَهَا تَطْلِيقَةً وَاحِدَةً، فَحُسِبَتْ مِنْ طَلَاقِهَا، وَرَاجَعَهَا عَبْدُ اللهِ كَمَا أَمَرَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 11222,
        "hadith_number": "3658",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Membatalkan Perceraian dengan Pengakuan",
        "perawi_melayu": "Diceritakan daripada Az-Zuhri, yang berkata: Ibn Umar (رضي الله عنه) berkata:",
        "english_text": "I took her back, and counted this pronouncement of divorce (as valid) with which I divorced her.",
        "malay_translation": "Aku mengambilnya kembali, dan menganggap perkataan perceraian ini (sah) yang dengannya aku menceraikannya.",
        "arabic_text": "وحَدَّثَنِيهِ إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا يَزِيدُ بْنُ عَبْدِ رَبِّهِ، حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، حَدَّثَنِي الزُّبَيْدِيُّ، عَنِ الزُّهْرِيِّ، بِهَذَا الْإِسْنَادِ، غَيْرَ أَنَّهُ قَالَ: قَالَ ابْنُ عُمَرَ: فَرَاجَعْتُهَا، وَحَسَبْتُ لَهَا التَّطْلِيقَةَ الَّتِي طَلَّقْتُهَا."
      },
      {
        "id": 11223,
        "hadith_number": "3659",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Talaq Ketika Haid dan Panduannya",
        "perawi_melayu": "Ibn 'Umar (رضي الله عنه) meriwayatkan:",
        "english_text": "He divorced his wife while she was in the state of menses. 'Umar (رضی اللہ عنہ) made mention of it to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he said: Command him to take her back, then divorce her when she is pure or she is pregnant.",
        "malay_translation": "Beliau menceraikan isterinya ketika isterinya dalam keadaan haid. 'Umar (رضي الله عنه) membawakan perkara ini kepada Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) dan baginda bersabda: Suruhlah dia mengambil kembali isterinya, kemudian cerai dia apabila dia suci atau dia mengandung.",
        "arabic_text": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَابْنُ نُمَيْرٍ، وَاللَّفْظُ لِأَبِي بَكْرٍ، قَالُوا: حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، مَوْلَى آلِ طَلْحَةَ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ، فَذَكَرَ ذَلِكَ عُمَرُ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «مُرْهُ فَلْيُرَاجِعْهَا، ثُمَّ لِيُطَلِّقْهَا طَاهِرًا، أَوْ حَامِلًا."
      },
      {
        "id": 11224,
        "hadith_number": "3660",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perceraian Ketika Haid",
        "perawi_melayu": "Ibn 'Umar (رضی اللہ عنہ) meriwayatkan:",
        "english_text": "He divorced his wife while she was in her menses. 'Umar (رضی اللہ عنہ) asked Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about that, and he said: Command him to take her back until she is pure and then she enters the second menses and then becomes pure. Then either divorce her (finally) or retain her.",
        "malay_translation": "Dia menceraikan isterinya ketika dia sedang dalam haid. 'Umar (رضی اللہ عنہ) bertanya kepada Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) tentang hal itu, dan baginda menjawab: Suruhlah dia mengambilnya kembali sehingga dia suci, kemudian dia memasuki haid yang kedua, dan kemudian suci. Kemudian dia boleh menceraikannya (akhirnya) atau mengekalkannya.",
        "arabic_text": "وحَدَّثَنِي أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ الْأَوْدِيُّ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنِي سُلَيْمَانُ وَهُوَ ابْنُ بِلَالٍ، حَدَّثَنِي عَبْدُ اللهِ بْنُ دِينَارٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ، فَسَأَلَ عُمَرُ عَنْ ذَلِكَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ «مُرْهُ فَلْيُرَاجِعْهَا حَتَّى تَطْهُرَ، ثُمَّ تَحِيضَ حَيْضَةً أُخْرَى، ثُمَّ تَطْهُرَ، ثُمَّ يُطَلِّقُ بَعْدُ، أَوْ يُمْسِكُ."
      },
      {
        "id": 11225,
        "hadith_number": "3661",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perceraian Seorang Lelaki kepada Isterinya ketika Haid",
        "perawi_melayu": "Ibn Sirin melaporkan:",
        "english_text": "One who was blameless (as a narrator) narrated to me for twenty years that Ibn 'Umar  ( رضی اللہ عنہ) pronounced three divorces to his wife while she was in the state of menses. He was commanded to take her back. I neither blamed them (the narrators) nor recognised the hadith (to be perfectly genuine) until I met Abu Ghallab Yunus bin Jubair al-Bahili and he was very authentic, and he narrated to me that he had asked Ibn 'Umar ( رضی اللہ عنہ) and he narrated it to him that he made one pronouncement of divorce to his wife as she was in the state of menses, but he was commanded to take her back. I said: Was it counted (as one pronouncement)? He said: Why not, was I helpless or foolish?",
        "malay_translation": "Seseorang yang terbilang terpercaya (sebagai perawi) telah meriwayatkan kepada saya selama dua puluh tahun bahawa Ibn 'Umar (رضي الله عنه) telah mengucapkan tiga kali talak kepada isterinya ketika isterinya dalam keadaan haid. Beliau diperintahkan untuk kembali kepada isterinya. Saya tidak menyalahkan mereka (para perawi) dan tidak menerima hadis ini (sebagai sahih) sehingga saya bertemu dengan Abu Ghallab Yunus bin Jubair al-Bahili, seorang perawi yang sangat sahih, dan beliau telah meriwayatkan kepada saya bahawa beliau telah bertanya kepada Ibn 'Umar (رضي الله عنه) dan beliau telah menceritakan kepadanya bahawa beliau hanya mengucapkan satu kali talak kepada isterinya ketika isterinya dalam keadaan haid, tetapi beliau diperintahkan untuk kembali kepada isterinya. Saya bertanya: Bolehkah ia dikira sebagai satu kali talak? Beliau menjawab: Mengapa tidak? Adakah saya lemah atau bodoh?",
        "arabic_text": "وحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ أَيُّوبَ، عَنِ ابْنِ سِيرِينَ، قَالَ: مَكَثْتُ عِشْرِينَ سَنَةً يُحَدِّثُنِي مَنْ لَا أَتَّهِمُ أَنَّ ابْنَ عُمَرَ طَلَّقَ امْرَأَتَهُ ثَلَاثًا وَهِيَ حَائِضٌ، فَأُمِرَ أَنْ يُرَاجِعَهَا، فَجَعَلْتُ لَا أَتَّهِمُهُمْ، وَلَا أَعْرِفُ الْحَدِيثَ، حَتَّى لَقِيتُ أَبَا غَلَّابٍ يُونُسَ بْنَ جُبَيْرٍ الْبَاهِلِيَّ، وَكَانَ ذَا ثَبَتٍ، فَحَدَّثَنِي أَنَّهُ سَأَلَ ابْنَ عُمَرَ، فَحَدَّثَهُ «أَنَّهُ طَلَّقَ امْرَأَتَهُ تَطْلِيقَةً وَهِيَ حَائِضٌ، فَأُمِرَ أَنْ يَرْجِعَهَا»، قَالَ: قُلْتُ: أَفَحُسِبَتْ عَلَيْهِ؟ قَالَ: «فَمَهْ، أَوَ إِنْ عَجَزَ، وَاسْتَحْمَقَ."
      },
      {
        "id": 11226,
        "hadith_number": "3662",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pertanyaan Umar bin Al-Khattab Kepada Nabi SAW Mengenai Perceraian",
        "perawi_melayu": null,
        "english_text": "A similar report (as no. 3661) from Ayyub with this chain, except that he said: \" \\'Umar رضی اللہ عنہ asked the prophet ﷺ and he told him...\"",
        "malay_translation": "Laporan yang serupa (seperti no. 3661) daripada Ayyub dengan sanad yang sama, kecuali beliau berkata: \"Umar رضي الله عنه bertanya kepada Nabi SAW dan baginda memerintahkannya...\" ",
        "arabic_text": ") وَحَدَّثَنَاهُ أَبُو الرَّبِيعِ، وَقُتَيْبَةُ، قَالَا: حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، بِهَذَا الْإِسْنَادِ نَحْوَهُ، غَيْرَ أَنَّهُ قَالَ: فَسَأَلَ عُمَرُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَمَرَهُ."
      },
      {
        "id": 11227,
        "hadith_number": "3663",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Arahan Mengenai Penceraian Wanita dalam Keadaan suci",
        "perawi_melayu": "Ayyub meriwayatkan hadis yang serupa dengan sanad yang sama dan berkata:",
        "english_text": "Umar (رضی اللہ عنہ) bertanya kepada Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) mengenainya dan baginda memerintahkannya untuk mengambilnya semula sehingga dia diceraikan dalam keadaan suci tanpa melakukan hubungan seksual dengannya, dan bersabda: Ceraikanlah dia pada awal 'iddah atau 'iddah-nya bermula.",
        "malay_translation": "Umar (رضی اللہ عنہ) bertanya kepada Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) tentang perkara ini dan baginda memerintahkannya agar mengambil kembali isterinya sehingga dia diceraikan dalam keadaan suci tanpa melakukan hubungan intim dengannya. Baginda bersabda, \"Ceraikanlah dia pada awal 'iddah atau 'iddah-nya bermula.\"",
        "arabic_text": "وحَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، عَنْ أَيُّوبَ، بِهَذَا الْإِسْنَادِ وَقَالَ فِي الْحَدِيثِ: فَسَأَلَ عُمَرُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ، فَأَمَرَهُ أَنْ يُرَاجِعَهَا حَتَّى يُطَلِّقَهَا طَاهِرًا مِنْ غَيْرِ جِمَاعٍ، وَقَالَ: «يُطَلِّقُهَا فِي قُبُلِ عِدَّتِهَا."
      },
      {
        "id": 11228,
        "hadith_number": "3664",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Cerai Ketika Wanita Haid",
        "perawi_melayu": "Yunus bin Jubair melaporkan:",
        "english_text": "I said to Ibn 'Umar ( رضی اللہ عنہ): A person divorced his wife while she was in the state of menses, whereupon he said: Do you know 'Abdullah bin Umar ( رضی اللہ عنہ), for he divorced his wife in the state of menses. 'Umar ( رضی اللہ عنہ) came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and asked him, and he (the Holy Prophet ﷺ) commanded him that he should take her back, and she started her 'Idda. I said to him: When a person divorces his wife, and she is in the state of menses, should that pronouncement of divorce be counted? He said: Why not, was he hopless or foolish?",
        "malay_translation": "Saya berkata kepada Ibn 'Umar (رضي الله عنه): Seseorang menceraikan isterinya ketika beliau sedang dalam haid, lalu beliau berkata: Adakah anda mengetahui 'Abdullah bin 'Umar (رضي الله عنه), kerana beliau menceraikan isterinya ketika dalam haid? 'Umar (رضي الله عنه) mendatangi Rasulullah (صلى الله عليه وسلم) dan bertanya, dan baginda memerintahkannya agar mengambil semula isterinya, dan isterinya memulakan tempoh 'iddah. Saya bertanya kepadanya: Apabila seseorang menceraikan isterinya ketika beliau sedang dalam haid, adakah perceraian itu dikira sah? Beliau menjawab: Mengapakah tidak, adakah dia putus asa atau bodoh?",
        "arabic_text": "وحَدَّثَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، عَنِ ابْنِ عُلَيَّةَ، عَنْ يُونُسَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ يُونُسَ بْنِ جُبَيْرٍ، قَالَ: قُلْتُ لِابْنِ عُمَرَ: رَجُلٌ طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ، فَقَالَ: أَتَعْرِفُ عَبْدَ اللهِ بْنَ عُمَرَ، فَإِنَّهُ طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ، فَأَتَى عُمَرُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَسَأَلَهُ: «فَأَمَرَهُ أَنْ يَرْجِعَهَا، ثُمَّ تَسْتَقْبِلَ عِدَّتَهَا». قَالَ: فَقُلْتُ لَهُ: إِذَا طَلَّقَ الرَّجُلُ امْرَأَتَهُ وَهِيَ حَائِضٌ، أَتَعْتَدُّ بِتِلْكَ التَّطْلِيقَةِ؟ فَقَالَ: «فَمَهْ، أَوَ إِنْ عَجَزَ وَاسْتَحْمَقَ."
      },
      {
        "id": 11229,
        "hadith_number": "3665",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perceraian semasa Haid dan Hukumnya",
        "perawi_melayu": "Ibn 'Umar (رضي الله عنه) meriwayatkan:",
        "english_text": "I divorced my wife while she was in the state of menses. 'Umar (رضی اللہ عنہ) came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and made mention of that to him, whereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) told that be should take her back, and when she is pure he may divorce her. if he would so wish. I (one of the narrators) said to Ibn 'Umar (رضی اللہ عنہ): Did you count (this pronouncement of divorce) in her case? He said: What (after all) prevents him from doing so? Do you find him (Ibn Umar رضي الله عنه) either helpless or foolish?",
        "malay_translation": "Aku menceraikan isteriku ketika dia dalam keadaan haid. 'Umar (رضي الله عنه) datang kepada Rasulullah (ﷺ) dan menceritakan hal itu kepadanya, lalu Rasulullah (ﷺ) memerintahkannya untuk mengambil kembali isterinya itu, dan apabila dia suci, dia boleh menceraikannya jika dikehendakinya. Aku (salah seorang perawi) bertanya kepada Ibn 'Umar (رضي الله عنه), 'Apakah engkau menghitung (perceraian ini) dalam kesnya?' Beliau menjawab, 'Apakah yang menghalanginya untuk melakukannya? Apakah engkau menganggapnya (Ibn 'Umar رضي الله عنه) lemah atau bodoh?'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَ ابْنُ الْمُثَنَّى: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ: سَمِعْتُ يُونُسَ بْنَ جُبَيْرٍ، قَالَ: سَمِعْتُ ابْنَ عُمَرَ، يَقُولُ: طَلَّقْتُ امْرَأَتِي وَهِيَ حَائِضٌ، فَأَتَى عُمَرُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَذَكَرَ ذَلِكَ لَهُ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لِيُرَاجِعْهَا، فَإِذَا طَهُرَتْ فَإِنْ شَاءَ فَلْيُطَلِّقْهَا»، قَالَ: فَقُلْتُ لِابْنِ عُمَرَ: أَفَاحْتَسَبْتَ بِهَا؟ قَالَ: «مَا يَمْنَعُهُ، أَرَأَيْتَ إِنْ عَجَزَ، وَاسْتَحْمَقَ»."
      },
      {
        "id": 11230,
        "hadith_number": "3666",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Perceraian Wanita Ketika Haid",
        "perawi_melayu": "Anas bin Sirin melaporkan:",
        "english_text": "I asked Ibn 'Umar (رضی اللہ عنہ) about the woman whom he had divorced. He said: I divorced her while she was in the state of menses. It was mentioned to 'Umar (رضی اللہ عنہ) and he then made a mention of that to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), whereupon he said: Command him to take her back and when the period of menses is over, then (he may divorce her in the state of her purity. He (Ibn Umar رضی اللہ عنہ) said: So I took her back, then divorced her in her purity. I (the narrator) said: Did you count that divorce which you pronounced in the state of menses? He said: Why should I not have counted that? Was I helpless or foolish?",
        "malay_translation": "Saya bertanya kepada Ibn 'Umar (رضی اللہ عنہ) tentang wanita yang telah dia cerai. Beliau berkata: Saya menceraikannya ketika dia sedang dalam keadaan haid. Hal ini disampaikan kepada 'Umar (رضی اللہ عنہ) dan beliau kemudian menyampaikannya kepada Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). Lalu Baginda bersabda: Suruhlah dia mengambilnya kembali dan apabila tempoh haidnya berakhir, barulah dia boleh menceraikannya dalam keadaan suci. Beliau (Ibn Umar رضی اللہ عنہ) berkata: Maka saya mengambilnya kembali, kemudian menceraikannya dalam keadaan suci. Saya (perawi) bertanya: Adakah anda menghitung perceraian yang anda ucapkan ketika dia sedang haid? Beliau berkata: Mengapa saya tidak harus menghitungnya? Adakah saya tidak mampu atau bodoh?",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللهِ، عَنْ عَبْدِ الْمَلِكِ، عَنْ أَنَسِ بْنِ سِيرِينَ، قَالَ: سَأَلْتُ ابْنَ عُمَرَ عَنِ امْرَأَتِهِ الَّتِي طَلَّقَ، فَقَالَ: طَلَّقْتُهَا وَهِيَ حَائِضٌ، فَذُكِرَ ذَلِكَ لِعُمَرَ، فَذَكَرَهُ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «مُرْهُ فَلْيُرَاجِعْهَا، فَإِذَا طَهُرَتْ فَلْيُطَلِّقْهَا لِطُهْرِهَا»، قَالَ: «فَرَاجَعْتُهَا، ثُمَّ طَلَّقْتُهَا لِطُهْرِهَا»، قُلْتُ: فَاعْتَدَدْتَ بِتِلْكَ التَّطْلِيقَةِ الَّتِي طَلَّقْتَ وَهِيَ حَائِضٌ؟ قَالَ: «مَا لِيَ لَا أَعْتَدُّ بِهَا، وَإِنْ كُنْتُ عَجَزْتُ وَاسْتَحْمَقْتُ»."
      },
      {
        "id": 11231,
        "hadith_number": "3667",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Cara Menceraikan Isteri Ketika Haid",
        "perawi_melayu": "Anas bin Sirin meriwayatkan:",
        "english_text": "He had heard Ibn 'Umar (رضی اللہ عنہ) as saying. I divorced my wife while she was in the state of menses. 'Umar (رضی اللہ عنہ) came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and informed him about it, whereupon he (Allah's Apostle) said: Command him to take her back and when she is pure, then divorce her. I said to Ibn 'Umar (رضی اللہ عنہ): Did you count that pronouncement of divorce? He said: Why not?",
        "malay_translation": "Beliau mendengar Ibn 'Umar (رضی اللہ عنہ) berkata, \"Aku menceraikan isteriku ketika dia dalam keadaan haid.\" 'Umar (رضی اللہ عنہ) datang kepada Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) dan memberitahunya tentang hal itu, lalu Baginda bersabda: Perintahkan kepadanya untuk mengambil kembali isterinya dan apabila dia suci, maka cerai padanya. Aku bertanya kepada Ibn 'Umar (رضی اللہ عنہ), \"Adakah engkau mengira perceraian itu?\" Dia menjawab, \"Mengapa tidak?\" ",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَ ابْنُ الْمُثَنَّى: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَنَسِ بْنِ سِيرِينَ، أَنَّهُ سَمِعَ ابْنَ عُمَرَ، قَالَ: طَلَّقْتُ امْرَأَتِي وَهِيَ حَائِضٌ، فَأَتَى عُمَرُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَخْبَرَهُ، فَقَالَ: «مُرْهُ فَلْيُرَاجِعْهَا، ثُمَّ إِذَا طَهُرَتْ، فَلْيُطَلِّقْهَا» قُلْتُ لِابْنِ عُمَرَ: أَفَاحْتَسَبْتَ بِتِلْكَ التَّطْلِيقَةِ؟ قَالَ: «فَمَهْ."
      },
      {
        "id": 11232,
        "hadith_number": "3668",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pertanyaan dan Jawapan Mengenai Pengambilan Kembali Isteri",
        "perawi_melayu": "Shu'ba meriwayatkan dengan sanad ini (seperti hadis no. 3667), kecuali dalam hadis mereka tertulis: \"...biarkan dia mengambilnya kembali.\" Dan dalam hadis mereka (ada yang tertulis): Katanya,",
        "english_text": "\"I said to him: Did you count it as such? He said: 'Of course.'\"",
        "malay_translation": "\"Aku bertanya kepadanya: Engkau anggap demikian? Dia menjawab: 'Tentu.'\"",
        "arabic_text": "وحَدَّثَنِيهِ يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، ح وحَدَّثَنِيهِ عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ، حَدَّثَنَا بَهْزٌ، قَالَا: حَدَّثَنَا شُعْبَةُ، بِهَذَا الْإِسْنَادِ، غَيْرَ أَنَّ فِي حَدِيثِهِمَا: «لِيَرْجِعْهَا»، وَفِي حَدِيثِهِمَا: قَالَ: قُلْتُ لَهُ: أَتَحْتَسِبُ بِهَا؟ قَالَ: فَمَهْ."
      },
      {
        "id": 11233,
        "hadith_number": "3669",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perintah Memulangkan Isteri yang Diceraikan ketika Haid",
        "perawi_melayu": "Ibn Tawus meriwayatkan dari bapanya:",
        "english_text": "Ibn 'Umar (رضی اللہ عنہ) was asked about the person who divorced his wife in the state of menses, whereupon he said: Do you know 'Abdullah bin Umar رضی اللہ عنہ ? He said: Yes. He said: It was he who divorced his wife jn the state of menses and 'Umar رضی اللہ عنہ went to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and gave him this information. and he commanded him that he should take her back; and he (Abu Tawus) said: I did not hear any addition to this (hadith) from my father.",
        "malay_translation": "Ibn 'Umar (رضی اللہ عنہ) ditanya tentang seseorang yang menceraikan isterinya ketika sedang haid, lalu beliau berkata: Adakah kamu kenal 'Abdullah bin Umar رضی اللہ عنہ? Dia menjawab: Ya. Beliau berkata: Dia lah yang menceraikan isterinya ketika sedang haid dan 'Umar رضی اللہ عنہ pergi kepada Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) dan menyampaikan maklumat ini kepadanya. Dan baginda memerintahkannya agar mengambil kembali isterinya; dan dia (Abu Tawus) berkata: Aku tidak mendengar sebarang tambahan pada hadis ini daripada bapaku.",
        "arabic_text": "وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ ابْنَ عُمَرَ، يُسْأَلُ عَنْ رَجُلٍ، طَلَّقَ امْرَأَتَهُ حَائِضًا، فَقَالَ: أَتَعْرِفُ عَبْدَ اللهِ بْنَ عُمَرَ؟ قَالَ: نَعَمْ، قَالَ: «فَإِنَّهُ طَلَّقَ امْرَأَتَهُ حَائِضًا، فَذَهَبَ عُمَرُ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَخْبَرَهُ الْخَبَرَ، فَأَمَرَهُ أَنْ يُرَاجِعَهَا» قَالَ: لَمْ أَسْمَعْهُ يَزِيدُ عَلَى ذَلِكَ لِأَبِيهِ."
      },
      {
        "id": 11234,
        "hadith_number": "3670",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Perceraian Wanita dalam Keadaan Haid",
        "perawi_melayu": "Abu Zubair meriwayatkan:",
        "english_text": "He heard 'Abdul-Rahman bin Aiman (the freed slave of 'Azza) say that he asked Ibn 'Umar (رضی اللہ عنہ) and Abu Zubair heard: What is your opinion about the person who divorced his wife in the state of menses? Thereupon he said: Ibn Umar (رضی اللہ عنہ) divorced his wife during the lifetime of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) while she was in the state of menses. Upon this Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) told him to take her back and so he took her back and he (further) said: When she is pure, then either divorce her or retain her. Ibn 'Umar (رضی اللہ عنہ) said that Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) then recited this verse: O Apostle, when you divorce women, divorce them at the commencement of their prescribed period (Ixv 1).",
        "malay_translation": "Beliau mendengar 'Abdul-Rahman bin Aiman (hamba yang dibebaskan oleh 'Azza) berkata bahawa dia bertanya kepada Ibn 'Umar (رضي الله عنه) dan Abu Zubair mendengar: Apakah pandangan anda tentang orang yang menceraikan isterinya dalam keadaan haid? Lalu beliau berkata: Ibn 'Umar (رضي الله عنه) menceraikan isterinya semasa hayat Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) ketika isterinya dalam keadaan haid. Atas perkara ini, Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) menyuruhnya mengambil kembali isterinya dan dia mengambilnya kembali, dan beliau (setengah) berkata: Apabila dia suci, maka cerai atau rujuk. Ibn 'Umar (رضي الله عنه) berkata bahawa Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) kemudian membaca ayat ini: Wahai Rasul, apabila engkau menceraikan wanita, ceraikan mereka pada permulaan tempoh haid mereka (Ixv 1).",
        "arabic_text": "وحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللهِ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ: قَالَ ابْنُ جُرَيْجٍ: أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ عَبْدَ الرَّحْمَنِ بْنَ أَيْمَنَ، مَوْلَى عَزَّةَ، يَسْأَلُ ابْنَ عُمَرَ، وَأَبُو الزُّبَيْرِ يَسْمَعُ ذَلِكَ، كَيْفَ تَرَى فِي رَجُلٍ طَلَّقَ امْرَأَتَهُ حَائِضًا؟ فَقَالَ: طَلَّقَ ابْنُ عُمَرَ امْرَأَتَهُ وَهِيَ حَائِضٌ عَلَى عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَسَأَلَ عُمَرُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: إِنَّ عَبْدَ اللهِ بْنَ عُمَرَ طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ، فَقَالَ لَهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لِيُرَاجِعْهَا»، فَرَدَّهَا، وَقَالَ: «إِذَا طَهُرَتْ فَلْيُطَلِّقْ، أَوْ لِيُمْسِكْ»، قَالَ ابْنُ عُمَرَ: وَقَرَأَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَا أَيُّهَا النَّبِيُّ إِذَا طَلَّقْتُمُ النِّسَاءَ فَطَلِّقُوهُنَّ فِي قُبُلِ عِدَّتِهِنَّ."
      },
      {
        "id": 11235,
        "hadith_number": "3671",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis yang serupa dengan Hadis nombor 3670 dari Ibn Umar رضي الله عنه",
        "perawi_melayu": null,
        "english_text": "A similar story (as no. 3670) was narrated from Ibn Umar رضی اللہ عنہ .",
        "malay_translation": "Kisah yang serupa (seperti Hadis nombor 3670) telah diriwayatkan daripada Ibn Umar رضي الله عنه.",
        "arabic_text": "وحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللهِ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنِ ابْنِ عُمَرَ، نَحْوَ هَذِهِ الْقِصَّةِ."
      },
      {
        "id": 11236,
        "hadith_number": "3672",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perbetulan Kesalahan dalam Hadis Tersebut",
        "perawi_melayu": "Abu Az-zubair yang mendengar Abdur Rahman bin Ayman, bekas hamba sahaya 'Urwah, bertanya kepada Ibn Umar, semasa Abu Az-zubair mendengar… satu hadis seperti hadis Hajjaj (no. 3670), dengan beberapa tambahan.",
        "english_text": "Muslim said: He maid a mistake when he said: \"...the freed slave of 'Urwah \", he was the freed slave of 'Azzah.",
        "malay_translation": "Muslim berkata: Beliau melakukan kesilapan apabila menyebut: \"…bekas hamba sahaya 'Urwah\"; sebenarnya, beliau adalah bekas hamba sahaya 'Azzah.",
        "arabic_text": "وحَدَّثَنِيهِ مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ عَبْدَ الرَّحْمَنِ بْنَ أَيْمَنَ، مَوْلَى عُرْوَةَ، يَسْأَلُ ابْنَ عُمَرَ، وَأَبُو الزُّبَيْرِ يَسْمَعُ، بِمِثْلِ حَدِيثِ حَجَّاجٍ وَفِيهِ بَعْضُ الزِّيَادَةِ، قَالَ مُسْلِمٌ: أَخْطَأَ حَيْثُ قَالَ عُرْوَةَ: إِنَّمَا هُوَ مَوْلَى عَزَّةَ."
      },
      {
        "id": 11237,
        "hadith_number": "3673",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkaitan Tiga Kali Talak dan Dua Tahun Kekhalifahan Umar",
        "perawi_melayu": "Ibn 'Abbas رضي الله عنه meriwayatkan:",
        "english_text": "The (pronouncement) of three divorces during the lifetime of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and that of Abu Bakr رضی اللہ عنہ and two years of the caliphate of Umar ( رضی اللہ عنہ) (was treated) as one. But Umar bin Khattab (رضی اللہ عنہ) said: Verily the people have begun to hasten in the matter in which they are required to observe respite. So if we had imposed this upon them, and he imposed it upon them.",
        "malay_translation": "Perkara mengucapkan tiga kali talak semasa hayat Rasulullah SAW, Abu Bakar رضي الله عنه dan dua tahun pemerintahan Khalifah Umar رضي الله عنه dianggap sebagai satu perkara. Namun, Umar al-Khattab رضي الله عنه berkata, \"Sesungguhnya manusia telah mula tergesa-gesa dalam perkara yang memerlukan pertimbangan. Sekiranya kita mewajibkan ini kepada mereka, seperti yang telah dilakukannya.",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ رَافِعٍ، وَاللَّفْظُ لِابْنِ رَافِعٍ، قَالَ إِسْحَاقُ: أَخْبَرَنَا، وَقَالَ ابْنُ رَافِعٍ: حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: كَانَ الطَّلَاقُ عَلَى عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَأَبِي بَكْرٍ، وَسَنَتَيْنِ مِنْ خِلَافَةِ عُمَرَ، طَلَاقُ الثَّلَاثِ وَاحِدَةً، فَقَالَ عُمَرُ بْنُ الْخَطَّابِ: إِنَّ النَّاسَ قَدِ اسْتَعْجَلُوا فِي أَمْرٍ قَدْ كَانَتْ لَهُمْ فِيهِ أَنَاةٌ، فَلَوْ أَمْضَيْنَاهُ عَلَيْهِمْ، فَأَمْضَاهُ عَلَيْهِمْ."
      },
      {
        "id": 11238,
        "hadith_number": "3674",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Tiga Cerai Sebagai Satu Semasa Zaman Rasulullah SAW, Abu Bakar RA, dan Tiga Tahun Pemerintahan Umar RA",
        "perawi_melayu": "Abu Sahba' berkata kepada Ibn 'Abbas رضي الله عنه:",
        "english_text": "Do you know that three (divorces) were treated as one during the lifetime of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and that of Abu Bakr رضی اللہ عنہ , and during three (years) of the caliphate of Umar (رضی اللہ عنہ)? Ibn Abbas (رضی اللہ عنہ) said: Yes.",
        "malay_translation": "Tahukah kamu bahawa tiga kali talak dianggap sebagai satu talak semasa zaman Rasulullah SAW, dan zaman Abu Bakar رضي الله عنه, dan selama tiga tahun pemerintahan Khalifah Umar رضي الله عنه?  Ibn Abbas رضي الله عنه menjawab: Ya.",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، ح وحَدَّثَنَا ابْنُ رَافِعٍ، وَاللَّفْظُ لَهُ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، أَنَّ أَبَا الصَّهْبَاءِ، قَالَ لِابْنِ عَبَّاسٍ: أَتَعْلَمُ أَنَّمَا «كَانَتِ الثَّلَاثُ تُجْعَلُ وَاحِدَةً عَلَى عَهْدِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَأَبِي بَكْرٍ، وَثَلَاثًا مِنْ إِمَارَةِ عُمَرَ»؟ فَقَالَ ابْنُ عَبَّاسٍ: «نَعَمْ."
      },
      {
        "id": 11239,
        "hadith_number": "3675",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Penjelasan Hukum Talaq Tiga Bersatu pada Masa Rasulullah dan Abu Bakar",
        "perawi_melayu": "Abu al-Sahba' bertanya kepada Ibn 'Abbas رضي الله عنه",
        "english_text": "Enlighten us with your information whether the three divorces (pronounced at one and the same time) were not treated as one during the lifetime of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and Abu Bakr رضی اللہ عنہ . He said: It was in fact so, but when during the caliphate of 'Umar (رضی اللہ عنہ ) people began to pronounce divorce frequently, he allowed them to do so (to treat pronouncements of three divorces in a single breath as one).",
        "malay_translation": "Beri penjelasan tentang sama ada tiga kali talak (diucapkan serentak) tidak dikira sebagai satu kali pada zaman Rasulullah SAW dan Abu Bakar رضي الله عنه. Beliau berkata: Memang begitu, tetapi ketika zaman pemerintahan Umar رضي الله عنه, orang ramai mula banyak menjatuhkan talak, maka beliau membenarkannya (menganggap tiga kali talak dalam satu nafas sebagai satu talak).",
        "arabic_text": "وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ، عَنْ حَمَّادِ بْنِ زَيْدٍ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ، عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ، عَنْ طَاوُسٍ، أَنَّ أَبَا الصَّهْبَاءِ، قَالَ لِابْنِ عَبَّاسٍ: هَاتِ مِنْ هَنَاتِكَ، «أَلَمْ يَكُنِ الطَّلَاقُ الثَّلَاثُ عَلَى عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَأَبِي بَكْرٍ وَاحِدَةً»؟ فَقَالَ: «قَدْ كَانَ ذَلِكَ، فَلَمَّا كَانَ فِي عَهْدِ عُمَرَ تَتَايَعَ النَّاسُ فِي الطَّلَاقِ، فَأَجَازَهُ عَلَيْهِمْ."
      },
      {
        "id": 11240,
        "hadith_number": "3676",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ketetapan Hukum Sumpah yang Tidak Sah dan Perlu Ditebus",
        "perawi_melayu": "Ibn Abbas رضی اللہ عنہ meriwayatkan:",
        "english_text": "About (declaring of one's woman) unlawful as an oath which must be atoned, and Ibn 'Abbas رضی اللہ عنہ said: Verily, there is in the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) a model pattern for you.",
        "malay_translation": "Perihal (menyatakan wanita seseorang) haram sebagai sumpah yang perlu ditebus, dan Ibn 'Abbas رضی اللہ عنہ berkata: Sesungguhnya, terdapat dalam diri Rasulullah (صلی اللہ علیہ وسلم) teladan yang baik untuk kalian.",
        "arabic_text": "وحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ هِشَامٍ يَعْنِي الدَّسْتَوَائِيَّ، قَالَ: كَتَبَ إِلَيَّ يَحْيَى بْنُ أَبِي كَثِيرٍ، يُحَدِّثُ عَنْ يَعْلَى بْنِ حَكِيمٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ كَانَ يَقُولُ فِي الْحَرَامِ: «يَمِينٌ يُكَفِّرُهَا»، وَقَالَ ابْنُ عَبَّاسٍ: {لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللهِ أُسْوَةٌ} [الأحزاب: 21] حَسَنَةٌ"
      },
      {
        "id": 11241,
        "hadith_number": "3677",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Sumpah Membatalkan Perkahwinan dan Teladan Baginda Rasulullah SAW",
        "perawi_melayu": "Ibn Abbas (رضي الله عنه) meriwayatkan:",
        "english_text": "When a man declares his wife unlawful for himself that is an oath which must be atoned, and he said: There is in the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) a noble pattern for you.",
        "malay_translation": "Apabila seorang lelaki mengharamkan isterinya, ia adalah sumpah yang perlu ditebus, dan beliau berkata: Sesungguhnya terdapat teladan yang mulia dalam diri Rasulullah SAW untuk kamu.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بِشْرٍ الْحَرِيرِيُّ، حَدَّثَنَا مُعَاوِيَةُ يَعْنِي ابْنَ سَلَّامٍ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، أَنَّ يَعْلَى بْنَ حَكِيمٍ، أَخْبَرَهُ، أَنَّ سَعِيدَ بْنَ جُبَيْرٍ، أَخْبَرَهُ، أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ، قَالَ: «إِذَا حَرَّمَ الرَّجُلُ عَلَيْهِ امْرَأَتَهُ، فَهِيَ يَمِينٌ يُكَفِّرُهَا»، وَقَالَ: {لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللهِ أُسْوَةٌ} [الأحزاب: 21] حَسَنَةٌ."
      },
      {
        "id": 11242,
        "hadith_number": "3678",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Penggunaan Madu oleh Rasulullah SAW dan Penjelasan Ayat Al-Quran",
        "perawi_melayu": "Aisyah رضي الله عنها meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) used to spend time with Zainab رضی اللہ عنہا daughter of Jahsh and drank honey at her house. She ('A'isha رضی اللہ عنہا further) said: I and Hafsa رضی اللہ عنہا agreed that one whom Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) would visit first should say: I notice that you have an odour of the Maghafir (gum of mimosa). He (the Holy Prophet ﷺ) visited one of them and she said to him like this, whereupon he said: I have taken honey in the house of Zainab bint Jabsh and I will never do it again. It was at this (that the following verse was revealed): 'Why do you hold to be forbidden what Allah has made lawful for you... (up to). If you both ('A'isha and Hafsa رضی اللہ عنہا ) turn to Allah up to: And when the Prophet confided an information to one of his wives (lxvi. 3). This refers to his saying: But I have taken honey.",
        "malay_translation": "Rasulullah SAW sering meluangkan masa bersama Zainab رضي الله عنها, anak perempuan Jahsh, dan minum madu di rumahnya. Aisyah رضي الله عنها seterusnya berkata: Aku dan Hafsah رضي الله عنها bersetuju bahawa sesiapa yang diziarahi oleh Rasulullah SAW terlebih dahulu perlu berkata: “Aku perasan kamu berbau Maghafir (getah mimosa).”  Baginda (Nabi SAW) mengunjungi salah seorang daripada mereka, dan perempuan itu berkata demikian, lalu Baginda menjawab: “Aku mengambil madu di rumah Zainab binti Jabsh dan aku tidak akan melakukannya lagi.” Pada ketika ini, ayat Al-Quran berikut diturunkan: “Mengapa kamu mengharamkan apa yang Allah halalkan untuk kamu… (sehingga). Jika kamu berdua (Aisyah dan Hafsah رضي الله عنهما) bertaubat kepada Allah hingga: Dan apabila Nabi memberitahu suatu berita kepada salah seorang isterinya (lxvi. 3). Ini merujuk kepada perkataan Baginda: Tetapi aku telah mengambil madu.”",
        "arabic_text": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَطَاءٌ، أَنَّهُ سَمِعَ عُبَيْدَ بْنَ عُمَيْرٍ، يُخْبِرُ أَنَّهُ سَمِعَ عَائِشَةَ، تُخْبِرُ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يَمْكُثُ عِنْدَ زَيْنَبَ بِنْتِ جَحْشٍ فَيَشْرَبُ عِنْدَهَا عَسَلًا، قَالَتْ: فَتَوَاطَأْتُ أَنَا وَحَفْصَةُ أَنَّ أَيَّتَنَا مَا دَخَلَ عَلَيْهَا النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَلْتَقُلْ: إِنِّي أَجِدُ مِنْكَ رِيحَ مَغَافِيرَ، أَكَلْتَ مَغَافِيرَ؟ فَدَخَلَ عَلَى إِحْدَاهُمَا، فَقَالَتْ ذَلِكَ لَهُ، فَقَالَ: «بَلْ شَرِبْتُ عَسَلًا عِنْدَ زَيْنَبَ بِنْتِ جَحْشٍ، وَلَنْ أَعُودَ لَهُ»، فَنَزَلَ: {لِمَ تُحَرِّمُ مَا أَحَلَّ اللهُ لَكَ} [التحريم: 1] إِلَى قَوْلِهِ: {إِنْ تَتُوبَا} [التحريم: 4] لِعَائِشَةَ وَحَفْصَةَ، {وَإِذْ أَسَرَّ النَّبِيُّ إِلَى بَعْضِ أَزْوَاجِهِ حَدِيثًا} [التحريم: 3]، لِقَوْلِهِ: «بَلْ شَرِبْتُ عَسَلًا."
      },
      {
        "id": 11243,
        "hadith_number": "3679",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kegemaran Rasulullah SAW terhadap Madu dan Kisah Perkara yang Diadakan oleh Para Isteri Baginda",
        "perawi_melayu": "'Aishah رضي الله عنها meriwayatkan",
        "english_text": "\"The Messenger of Allah liked sweets and honey, when he had prayed Asr, he would go round to his wives and get closed of them. He entered upon Hafsah رضی اللہ عنہا and stayed there longer than he usually did. I asked about that and I was told that a woman from among her people had given her a small vessel of honey as a gift, and she had poured some of the prophet to drink. I said: 'By Allah, we will play a trick on him. I mention that to Sawdah رضی اللہ عنہا and said: 'When he enter upon you, will get close to you, so they to him: \"O Messenger of Allah, you have eaten Maghafir?\" He will say to you: \"No.\" So say to him: \"What is this smell?\" -for the Messenger of Allah hated to have any smell coming from him -He will tell you: \"Hafsah رضی اللہ عنہا poured me a drink of honey.\" I will  say that to him too, and you say it as well, O Safiyyah.' Then he entered upon Sawdah رضی اللہ عنہا.\" She said: \"Sawdah رضي الله عنها used to say: 'By the one besides Whom there is none worthy of worship, I nearly decided to tell him what you had told me to say, when he was at the door, but I was afraid of you.' When the Messenger of Allah drew closed, she said: 'O Messenger of Allah, have you eaten Maghafir?' He said: 'No.' She said: 'Then what is this smell?' He said: 'Hafsah رضي الله عنها poured me a drink of honey.' She said: 'The bees must have sipped the nectar of Al-'Urfut.' When he entered upon me, I said the same thing, then he entered upon Safiyyah رضي الله عنهاand she said the same thing. When he entered upon Hafsah رضي الله عنها she said: O Messenger of Allah, shall I pour you some?' He said: 'I have no need of it.'\"",
        "malay_translation": "“Rasulullah SAW gemar makanan manis dan madu. Selepas solat Asar, baginda akan melawat para isteri baginda. Baginda masuk menemui Hafsah رضي الله عنها dan tinggal lebih lama daripada kebiasaan. Saya bertanya tentang hal itu dan diberitahu bahawa seorang wanita daripada kaumnya memberikan kepadanya sebuah bekas madu sebagai hadiah, dan isteri baginda itu memberi Nabi SAW minum sedikit darinya. Saya berkata, ‘Demi Allah, kita akan bermain helah dengannya.’ Saya memberitahu Sawdah رضي الله عنها dan berkata, ‘Apabila baginda masuk kepadamu, baginda akan mendekatimu. Katakanlah kepadanya: “Wahai Rasulullah, adakah engkau makan Maghafir?” Baginda akan menjawab: “Tidak.” Maka katakanlah kepadanya, “Apakah bau ini?” –kerana Rasulullah SAW membenci apa-apa bau daripada dirinya– Baginda akan memberitahu kamu: “Hafsah رضي الله عنها memberi aku minum madu.” Aku akan katakan demikian kepadanya juga, dan engkau katakan juga, wahai Safiyyah.’ Kemudian baginda masuk menemui Sawdah رضي الله عنها.” Beliau berkata, “Sawdah رضي الله عنها biasa berkata, ‘Demi Yang Satu di sisi-Nya tiada Tuhan yang layak disembah, hampir aku memutuskan untuk memberitahu baginda apa yang kamu suruh aku katakan, ketika baginda berada di pintu, tetapi aku takut kepada kamu.’ Apabila Rasulullah SAW masuk, beliau berkata, ‘Wahai Rasulullah, adakah engkau makan Maghafir?’ Baginda menjawab, ‘Tidak.’ Beliau berkata, ‘Maka apakah bau ini?’ Baginda menjawab, ‘Hafsah رضي الله عنها memberi aku minum madu.’ Beliau berkata, ‘Lebah mesti telah mencicipi madu Al-`Urfut.’ Apabila baginda masuk kepadaku, aku berkata perkara yang sama. Kemudian baginda masuk menemui Safiyyah رضي الله عنها, dan beliau berkata perkara yang sama. Apabila baginda masuk menemui Hafsah رضي الله عنها, beliau berkata, ‘Wahai Rasulullah, adakah aku perlu tuangkan untuk engkau?’ Baginda menjawab, ‘Aku tidak memerlukannya.’”",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ، وَهَارُونُ بْنُ عَبْدِ اللهِ قَالَا: حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُحِبُّ الْحَلْوَاءَ وَالْعَسَلَ، فَكَانَ إِذَا صَلَّى الْعَصْرَ دَارَ عَلَى نِسَائِهِ، فَيَدْنُو مِنْهُنَّ، فَدَخَلَ عَلَى حَفْصَةَ، فَاحْتَبَسَ عِنْدَهَا أَكْثَرَ مِمَّا كَانَ يَحْتَبِسُ، فَسَأَلْتُ عَنْ ذَلِكَ، فَقِيلَ لِي: أَهْدَتْ لَهَا امْرَأَةٌ مِنْ قَوْمِهَا عُكَّةً مِنْ عَسَلٍ، فَسَقَتْ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْهُ شَرْبَةً، فَقُلْتُ: أَمَا وَاللهِ لَنَحْتَالَنَّ لَهُ، فَذَكَرْتُ ذَلِكَ لِسَوْدَةَ، وَقُلْتُ: إِذَا دَخَلَ عَلَيْكِ، فَإِنَّهُ سَيَدْنُو مِنْكِ، فَقُولِي لَهُ: يَا رَسُولَ اللهِ، أَكَلْتَ مَغَافِيرَ؟ فَإِنَّهُ سَيَقُولُ لَكِ: «لَا»، فَقُولِي لَهُ: مَا هَذِهِ الرِّيحُ؟ وَكَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَشْتَدُّ عَلَيْهِ أَنْ يُوجَدَ مِنْهُ الرِّيحُ، فَإِنَّهُ سَيَقُولُ لَكِ: «سَقَتْنِي حَفْصَةُ شَرْبَةَ عَسَلٍ»، فَقُولِي لَهُ: جَرَسَتْ نَحْلُهُ الْعُرْفُطَ، وَسَأَقُولُ ذَلِكِ لَهُ، وَقُولِيهِ أَنْتِ يَا صَفِيَّةُ، فَلَمَّا دَخَلَ عَلَى سَوْدَةَ قَالَتْ: تَقُولُ سَوْدَةُ: وَالَّذِي لَا إِلَهَ إِلَّا هُوَ لَقَدْ كِدْتُ أَنْ أُبَادِئَهُ بِالَّذِي قُلْتِ لِي، وَإِنَّهُ لَعَلَى الْبَابِ فَرَقًا مِنْكِ، فَلَمَّا دَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَتْ: يَا رَسُولَ اللهِ، أَكَلْتَ مَغَافِيرَ؟ قَالَ: «لَا»، قَالَتْ: فَمَا هَذِهِ الرِّيحُ؟ قَالَ: «سَقَتْنِي حَفْصَةُ شَرْبَةَ عَسَلٍ»، قَالَتْ: جَرَسَتْ نَحْلُهُ الْعُرْفُطَ، فَلَمَّا دَخَلَ عَلَيَّ، قُلْتُ لَهُ: مِثْلَ ذَلِكَ، ثُمَّ دَخَلَ عَلَى صَفِيَّةَ، فَقَالَتْ بِمِثْلِ ذَلِكَ، فَلَمَّا دَخَلَ عَلَى حَفْصَةَ، قَالَتْ: يَا رَسُولَ اللهِ، أَلَا أَسْقِيكَ مِنْهُ؟ قَالَ: «لَا حَاجَةَ لِي بِهِ»، قَالَتْ: تَقُولُ سَوْدَةُ: سُبْحَانَ اللهِ، وَاللهِ لَقَدْ حَرَمْنَاهُ، قَالَتْ: قُلْتُ لَهَا: اسْكُتِيقَالَ أَبُو إِسْحَاقَ إِبْرَاهِيمُ، حَدَّثَنَا الْحَسَنُ بْنُ بِشْرِ بْنِ الْقَاسِمِ، حَدَّثَنَا أَبُو أُسَامَةَ، بِهَذَا سَوَاءً."
      },
      {
        "id": 11244,
        "hadith_number": "3680",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Serupa dengan Nombor 3679 dengan Sanad yang Berbeza",
        "perawi_melayu": "Ibnu Abbas (redha Allah dengan mereka) meriwayatkan:",
        "english_text": "A similar report (as no. 3679) was narrated from Hisham bin Urwah with this chain.",
        "malay_translation": "Satu riwayat yang serupa (seperti hadis nombor 3679) telah diriwayatkan daripada Hisham bin Urwah dengan sanad ini.",
        "arabic_text": "وحَدَّثَنِيهِ سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ بِهَذَا الْإِسْنَادِ، نَحْوَهُ."
      },
      {
        "id": 11245,
        "hadith_number": "3681",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Arahan Rasulullah SAW Kepada Isterinya dan Pilihan di Antara Dunia dan Akhirat",
        "perawi_melayu": "Aisyah رضي الله عنها meriwayatkan:",
        "english_text": "When the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was commanded to give option to his wives, he started it from me saying: I am going to mention to you a matter which you should not (decide) in haste until you have consulted your parents. She said that he already knew that my parents would never allow me to seek separation from him She said: Then he said: Allah, the Exalted and Glorious, said: Prophet, say to thy wives: If you desire this world's life and its adornment, then come, I will give you a provision and allow you to depart a goodly departing; and if you desire Allah and His Messenger and the abode of the Hereafter, then Allah has prepared for the doers of good among you a great reward She is reported to have said: About what should I consult my parents, for I desire Allah and His Messenger and the abode of the Hereafter? She ('A'isha رضی اللہ عنہا ) said: Then all the wives of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) did as I had done",
        "malay_translation": "Apabila Rasulullah SAW diperintahkan untuk memberikan pilihan kepada para isterinya, baginda memulakannya dengan saya. Baginda berkata, \"Aku akan memberitahu kamu tentang sesuatu perkara yang tidak boleh kamu putuskan dengan tergesa-gesa sehingga kamu berunding dengan ibu bapa kamu.\" Aisyah رضي الله عنها berkata, Baginda sudah mengetahui bahawa ibu bapanya tidak akan membenarkan saya untuk berpisah dari baginda. Kemudian baginda berkata, Allah SWT berfirman, \"Wahai Nabi, katakanlah kepada isteri-isterimu: Jika kamu menginginkan kehidupan dunia dan perhiasannya, maka datanglah, Aku akan berikan kamu rezeki dan biarkan kamu berpisah dengan cara yang baik; dan jika kamu menginginkan Allah dan Rasul-Nya serta akhirat, maka Allah telah menyediakan ganjaran yang besar bagi orang-orang yang berbuat baik di antara kamu.\" Aisyah رضي الله عنها meriwayatkan, \"Untuk apa yang patut saya minta nasihat kepada ibu bapa saya, kerana saya menginginkan Allah dan Rasul-Nya serta akhirat?\" Aisyah رضي الله عنها berkata lagi, Kemudian semua isteri Rasulullah SAW bertindak seperti yang telah saya lakukan.",
        "arabic_text": "وحَدَّثَنِي أَبُو الطَّاهِرِ، حَدَّثَنَا ابْنُ وَهْبٍ، ح وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ، وَاللَّفْظُ لَهُ، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّ عَائِشَةَ، قَالَتْ: لَمَّا أُمِرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِتَخْيِيرِ أَزْوَاجِهِ، بَدَأَ بِي، فَقَالَ: «إِنِّي ذَاكِرٌ لَكِ أَمْرًا، فَلَا عَلَيْكِ أَنْ لَا تَعْجَلِي حَتَّى تَسْتَأْمِرِي أَبَوَيْكِ»، قَالَتْ: قَدْ عَلِمَ أَنَّ أَبَوَيَّ لَمْ يَكُونَا لِيَأْمُرَانِي بِفِرَاقِهِ، قَالَتْ: ثُمَّ قَالَ: إِنَّ اللهَ عَزَّ وَجَلَّ قَالَ: {يَا أَيُّهَا النَّبِيُّ قُلْ لِأَزْوَاجِكَ إِنْ كُنْتُنَّ تُرِدْنَ الْحَيَاةَ الدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُنَّ وَأُسَرِّحْكُنَّ سَرَاحًا جَمِيلًا وَإِنْ كُنْتُنَّ تُرِدْنَ اللهَ وَرَسُولَهُ وَالدَّارَ الْآخِرَةَ فَإِنَّ اللهَ أَعَدَّ لِلْمُحْسِنَاتِ مِنْكُنَّ أَجْرًا عَظِيمًا} [الأحزاب: 29] ، قَالَتْ: فَقُلْتُ: فِي أَيِّ هَذَا أَسْتَأْمِرُ أَبَوَيَّ؟ فَإِنِّي أُرِيدُ اللهَ وَرَسُولَهُ وَالدَّارَ الْآخِرَةَ، قَالَتْ: ثُمَّ فَعَلَ أَزْوَاجُ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِثْلَ مَا فَعَلْتُ."
      },
      {
        "id": 11246,
        "hadith_number": "3682",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keizinan Rasulullah SAW dan Wahyu Tentang Pergaulan Istri",
        "perawi_melayu": "Aisyah رضي الله عنها meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sought our permission when he had a (turn to spend) a day with (one of his wives) amongst us (whereas he wanted to visit his other wives too). It was after this that this verse was revealed: Thou mayest put off whom thou pleasest of them, and take for thee whom thou pleasest (xxxiii. 5). Mu'adha said to her: What did you say to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) when he sought your permission? She said: I used to say: If it had the option in this I would not have (allowed anyone) to have precedence over me.",
        "malay_translation": "Rasulullah SAW meminta izin kepada kami ketika beliau ingin menghabiskan sehari bersama salah seorang isterinya di antara kami (sedangkan beliau juga ingin mengunjungi isteri-isteri beliau yang lain). Setelah itu, ayat ini diturunkan: \"Engkau boleh menangguhkan siapa yang engkau sukai di antara mereka, dan ambillah untukmu siapa yang engkau sukai (xxxiii. 5)\". Mu'adha berkata kepadanya: Apa yang engkau katakan kepada Rasulullah SAW ketika beliau meminta izin? Dia menjawab: Aku selalu berkata: Sekiranya aku ada pilihan dalam hal ini, aku tidak akan membenarkan sesiapa mendahului aku.",
        "arabic_text": "حَدَّثَنَا سُرَيْجُ بْنُ يُونُسَ، حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ، عَنْ عَاصِمٍ، عَنْ مُعَاذَةَ الْعَدَوِيَّةِ، عَنْ عَائِشَةَ، قَالَتْ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَسْتَأْذِنُنَا، إِذَا كَانَ فِي يَوْمٍ لِلْمَرْأَةِ مِنَّا، بَعْدَ مَا نَزَلَتْ: {تُرْجِي مَنْ تَشَاءُ مِنْهُنَّ وَتُؤْوِي إِلَيْكَ مَنْ تَشَاءُ} [الأحزاب: 51] فَقَالَتْ لَهَا مُعَاذَةُ: فَمَا كُنْتِ تَقُولِينَ لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَأْذَنَكِ؟ قَالَتْ: «كُنْتُ أَقُولُ إِنْ كَانَ ذَاكَ إِلَيَّ لَمْ أُوثِرْ أَحَدًا عَلَى نَفْسِي."
      },
      {
        "id": 11247,
        "hadith_number": "3683",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Sama Sekaligus (Setaraf Hadis Nombor 3684)",
        "perawi_melayu": "Asim",
        "english_text": "A similar report (as no. 3684) was narrated by Asim.",
        "malay_translation": "Satu laporan yang serupa (seperti hadis nombor 3684) telah diriwayatkan oleh Asim.",
        "arabic_text": "وَحَدَّثَنَاهُ الْحَسَنُ بْنُ عِيسَى، أَخْبَرَنَا ابْنُ الْمُبَارَكِ، أَخْبَرَنَا عَاصِمٌ بِهَذَا الْإِسْنَادِ، نَحْوَهُ."
      },
      {
        "id": 11248,
        "hadith_number": "3684",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah SAW Memberi Pilihan, Namun Tidak Dianggap Sebagai Perceraian",
        "perawi_melayu": "Aisyah رضي الله عنها meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) gave us the option (to get divorce) but we did not deem it as divorce.",
        "malay_translation": "Pesuruhjaya Allah (ﷺ) memberikan pilihan (untuk bercerai) tetapi kami tidak menganggapnya sebagai perceraian.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، أَخْبَرَنَا عَبْثَرٌ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنِ الشَّعْبِيِّ، عَنْ مَسْرُوقٍ، قَالَ: قَالَتْ عَائِشَةُ: «قَدْ خَيَّرَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَلَمْ نَعُدَّهُ طَلَاقًا."
      },
      {
        "id": 11249,
        "hadith_number": "3685",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Pilihan Cerai bagi Isteri",
        "perawi_melayu": "Masruq melaporkan:",
        "english_text": "I do not mind if I give option to my wife (to get divorce) once, hundred times, or thousand times after (knowing it) that she has chosen me (and would never seek divorce). I asked 'A'isha (رضی اللہ عنہا) (about it) and she said: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) gave us the option, but did it imply divorce? (It was in fact not a divorce; it is effective when women actually avail themselves of it.)",
        "malay_translation": "Saya tidak keberatan jika saya memberikan pilihan kepada isteri saya (untuk meminta cerai) sekali, seratus kali, atau seribu kali selepas (mengetahui) dia memilih saya (dan tidak akan pernah meminta cerai). Saya bertanya kepada 'Aisyah (رضی اللہ عنہا) (tentang hal itu) dan dia berkata: Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) memberi kita pilihan, tetapi adakah ia bererti perceraian? (Sebenarnya ia bukan perceraian; ia hanya berkesan apabila wanita benar-benar memanfaatkan pilihan tersebut.)",
        "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنِ الشَّعْبِيِّ، عَنْ مَسْرُوقٍ، قَالَ: مَا أُبَالِي خَيَّرْتُ امْرَأَتِي وَاحِدَةً، أَوْ مِائَةً، أَوْ أَلْفًا بَعْدَ أَنْ تَخْتَارَنِي، وَلَقَدْ سَأَلْتُ عَائِشَةَ، فَقَالَتْ: «قَدْ خَيَّرَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَفَكَانَ طَلَاقًا."
      },
      {
        "id": 11250,
        "hadith_number": "3686",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah SAW Memberi Pilihan kepada Isteri-Isterinya, Bukanlah Perceraian",
        "perawi_melayu": "Aisyah رضي الله عنها meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) gave option to his wives, but it was not a divorce.",
        "malay_translation": "Pesuruhjaya Allah (صلی اللہ علیہ وسلم) memberikan pilihan kepada isteri-isterinya, namun itu bukan perceraian.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَاصِمٍ، عَنِ الشَّعْبِيِّ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ خَيَّرَ نِسَاءَهُ، فَلَمْ يَكُنْ طَلَاقًا."
      },
      {
        "id": 11251,
        "hadith_number": "3687",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah SAW Memberi Pilihan dan Tidak Mengira Sebagai Talak",
        "perawi_melayu": "Aisyah رضي الله عنها meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) gave us the option (to get divorce) and we chose him and he did not count it a divorce.",
        "malay_translation": "Pesuruhjaya Allah (صلی اللہ علیہ وسلم) memberi pilihan (untuk bercerai) kepada kita dan kita memilihnya, dan baginda tidak menganggapnya sebagai talak.",
        "arabic_text": "وحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ عَاصِمٍ الْأَحْوَلِ، وَإِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنِ الشَّعْبِيِّ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ: «خَيَّرَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَاخْتَرْنَاهُ، فَلَمْ يَعُدَّهُ طَلَاقًا."
      },
      {
        "id": 11252,
        "hadith_number": "3688",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah SAW Memberi Pilihan Cerai, Namun Kami Pilih Menyatukan Diri",
        "perawi_melayu": "Aisyah (رضي الله عنها) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) gave us the option (to get divorce), but me made a choice of him and he did not count anything (as divorce) in regard to us.",
        "malay_translation": "Rasulullah SAW memberi pilihan (untuk bercerai), tetapi kami memilih untuk tetap bersama dan baginda tidak menganggapnya sebagai perceraian.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَ يَحْيَى: أَخْبَرَنَا، وقَالَ الْآخَرَانِ: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ: «خَيَّرَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَاخْتَرْنَاهُ، فَلَمْ يَعْدُدْهَا عَلَيْنَا شَيْئًا»."
      },
      {
        "id": 11253,
        "hadith_number": "3689",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis yang serupa dengan Hadis no. 3888, diriwayatkan oleh 'Aisyah رضي الله عنها",
        "perawi_melayu": "Aisyah رضي الله عنها",
        "english_text": "A similar report (as no. 3888) was narrated from 'A'isha رضی اللہ عنہا .",
        "malay_translation": "Satu laporan yang serupa (seperti no. 3888) telah diriwayatkan daripada 'Aisyah رضي الله عنها.",
        "arabic_text": "وحَدَّثَنِي أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّاءَ، حَدَّثَنَا الْأَعْمَشُ، عَنْ إِبْرَاهِيمَ، عَنِ الْأَسْوَدِ، عَنْ عَائِشَةَ، وَعَنِ الْأَعْمَشِ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، بِمِثْلِهِ"
      },
      {
        "id": 11254,
        "hadith_number": "3690",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Peristiwa Permintaan Wang dan Nasihat Rasulullah SAW kepada Para Isteri",
        "perawi_melayu": "Jabir bin 'Abdullah (رضي الله عنه) meriwayatkan:",
        "english_text": "Abu Bakr (رضي الله عنه) datang dan meminta izin untuk menemui Rasulullah ( ‌صلي ‌اللہ ‌علیہ ‌وسلم ‌). Beliau mendapati beberapa orang duduk di pintu rumahnya dan tiada seorang pun dibenarkan masuk, tetapi Abu Bakr رضي الله عنه dibenarkan masuk. Kemudian datanglah 'Umar dan meminta izin, dan izin diberikan kepadanya. Beliau mendapati Rasulullah ( ‌صلي ‌اللہ ‌علیہ ‌وسلم ‌) duduk dalam keadaan sedih dan diam bersama isteri-isterinya di sekelilingnya.  Beliau (Hadrat 'Umar رضي الله عنه) berkata: Saya ingin mengucapkan sesuatu yang akan membuatkan Nabi ( ‌صلي ‌اللہ ‌علیہ ‌وسلم ‌) tertawa. Maka baginda berkata:  Ya Rasulullah SAW, saya ingin kamu melihat bagaimana anak perempuan Khadijah dilayan tatkala kamu meminta sedikit wang daripadaku. Lalu aku menampar lehernya. Rasulullah SAW tertawa dan berkata: Mereka mengelilingi saya seperti yang kamu lihat, meminta wang lebih banyak. Abu Bakr (رضي الله عنه) kemudian bangun pergi ke 'A'ishah (رضي الله عنها) dan menampar lehernya, dan 'Umar bangun di hadapan Hafsah رضي الله عنها dan menamparnya sambil berkata: Kamu meminta Rasulullah ( ‌صلي ‌اللہ ‌علیہ ‌وسلم ‌) sesuatu yang tidak ada padanya. Mereka berkata: Demi Allah, kami tidak meminta Rasulullah ( ‌صلي ‌اللہ ‌علیہ ‌وسلم ‌) sesuatu yang tidak ada padanya. Kemudian beliau menarik diri dari mereka selama sebulan atau selama dua puluh sembilan hari. Kemudian ayat ini diturunkan kepadanya: Nabi SAW: Katakanlah kepada isteri-isterimu... demi ganjaran yang besar (xxxiii. 28).  Kemudian baginda pergi dulu kepada 'A'ishah (رضي الله عنها) dan berkata: Saya ingin menerangkan sesuatu kepada kamu, 'A'ishah رضي الله عنها, tetapi jangan menjawab dengan tergesa-gesa sebelum kamu berunding dengan ibu bapa kamu. Dia berkata: Ya Rasulullah SAW, apakah itu? Baginda (Nabi SAW) membacakan kepadanya ayat itu, lalu dia berkata: Adakah aku perlu berunding dengan ibu bapaku mengenai kamu, Ya Rasulullah SAW? Tidak, aku memilih Allah, Rasul-Nya, dan Akhirat; tetapi aku meminta engkau agar tidak memberitahu isteri-isterimu apa yang aku katakan. Baginda menjawab: Tiada seorang pun daripada mereka akan bertanya kepadaku tanpa aku memberitahunya. Allah tidak mengutuskan aku untuk bersikap keras, atau mendatangkan mudarat, tetapi Allah mengutuskan aku untuk mengajar dan memudahkan urusan.",
        "malay_translation": "Abu Bakar (رضي الله عنه) datang dan memohon izin untuk menemui Rasulullah SAW. Beliau mendapati beberapa orang sedang duduk di depan rumah baginda, dan tiada seorang pun yang dibenarkan masuk, kecuali Abu Bakar. Kemudian 'Umar datang dan meminta izin, dan izin diberikan kepadanya. Beliau mendapati Rasulullah SAW sedang duduk dalam keadaan sedih dan diam bersama isteri-isterinya di sekelilingnya. 'Umar berkata, \"Saya ingin mengucapkan sesuatu yang akan membuatkan Nabi SAW tertawa.\" Nabi SAW bertanya, \"Apa itu?\" 'Umar menjawab, \"Saya ingin kamu lihat bagaimana anak perempuan Khadijah dilayan tatkala kamu meminta sedikit wang daripadaku. Lalu aku menampar lehernya.\" Rasulullah SAW tertawa dan berkata, \"Mereka mengelilingi aku seperti yang kamu lihat, meminta wang lebih banyak.\" Abu Bakar kemudian bangun dan pergi ke 'Aisyah (رضي الله عنها) dan menampar lehernya. 'Umar pula berdiri di hadapan Hafsah (رضي الله عنها) dan menamparnya sambil berkata, \"Kamu meminta Rasulullah SAW sesuatu yang tidak ada padanya.\" Mereka menjawab, \"Demi Allah, kami tidak meminta Rasulullah SAW sesuatu yang tidak ada padanya.\" Kemudian baginda menarik diri selama sebulan atau 29 hari. Selepas itu, ayat ini diturunkan kepadanya: \"Katakanlah kepada isteri-isterimu... demi ganjaran yang besar.\" Kemudian baginda menghampiri 'Aisyah (رضي الله عنها) dan berkata, \"Aku ingin menerangkan sesuatu kepadamu. Namun, jangan menjawab dengan terburu-buru sebelum berunding dengan ibu bapamu.\" Dia menjawab, \"Ya Rasulullah, apakah itu?\" Nabi SAW membacakan ayat tersebut kepadanya. 'Aisyah berkata, \"Adakah aku perlu berunding dengan ibu bapaku tentang kamu? Tidak, aku memilih Allah, Rasul-Nya, dan Akhirat. Namun, aku meminta engkau agar tidak memberitahu isteri-isteri yang lain tentang perkara ini.\" Nabi SAW menjawab, \"Tiada seorang pun daripada mereka akan bertanya kepadaku tanpa aku memberitahunya. Allah tidak mengutuskan aku untuk bersikap keras, atau mendatangkan mudarat, tetapi Allah mengutuskan aku untuk mengajar dan memudahkan urusan.",
        "arabic_text": "وحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ إِسْحَاقَ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: دَخَلَ أَبُو بَكْرٍ يَسْتَأْذِنُ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَوَجَدَ النَّاسَ جُلُوسًا بِبَابِهِ، لَمْ يُؤْذَنْ لِأَحَدٍ مِنْهُمْ، قَالَ: فَأُذِنَ لِأَبِي بَكْرٍ، فَدَخَلَ، ثُمَّ أَقْبَلَ عُمَرُ، فَاسْتَأْذَنَ فَأُذِنَ لَهُ، فَوَجَدَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ جَالِسًا حَوْلَهُ نِسَاؤُهُ، وَاجِمًا سَاكِتًا، قَالَ: فَقَالَ: لَأَقُولَنَّ شَيْئًا أُضْحِكُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: يَا رَسُولَ اللهِ، لَوْ رَأَيْتَ بِنْتَ خَارِجَةَ، سَأَلَتْنِي النَّفَقَةَ، فَقُمْتُ إِلَيْهَا، فَوَجَأْتُ عُنُقَهَا، فَضَحِكَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَقَالَ: «هُنَّ حَوْلِي كَمَا تَرَى، يَسْأَلْنَنِي النَّفَقَةَ»، فَقَامَ أَبُو بَكْرٍ إِلَى عَائِشَةَ يَجَأُ عُنُقَهَا، فَقَامَ عُمَرُ إِلَى حَفْصَةَ يَجَأُ عُنُقَهَا، كِلَاهُمَا يَقُولُ: تَسْأَلْنَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَا لَيْسَ عِنْدَهُ، فَقُلْنَ: وَاللهِ لَا نَسْأَلُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ شَيْئًا أَبَدًا لَيْسَ عِنْدَهُ، ثُمَّ اعْتَزَلَهُنَّ شَهْرًا - أَوْ تِسْعًا وَعِشْرِينَ - ثُمَّ نَزَلَتْ عَلَيْهِ هَذِهِ الْآيَةُ: {يَا أَيُّهَا النَّبِيُّ قُلْ لِأَزْوَاجِكَ} [الأحزاب: 28] حَتَّى بَلَغَ {لِلْمُحْسِنَاتِ مِنْكُنَّ أَجْرًا عَظِيمًا} [الأحزاب: 29]، قَالَ: فَبَدَأَ بِعَائِشَةَ، فَقَالَ: «يَا عَائِشَةُ، إِنِّي أُرِيدُ أَنْ أَعْرِضَ عَلَيْكِ أَمْرًا أُحِبُّ أَنْ لَا تَعْجَلِي فِيهِ حَتَّى تَسْتَشِيرِي أَبَوَيْكِ»، قَالَتْ: وَمَا هُوَ يَا رَسُولَ اللهِ؟ فَتَلَا عَلَيْهَا الْآيَةَ، قَالَتْ: أَفِيكَ يَا رَسُولَ اللهِ، أَسْتَشِيرُ أَبَوَيَّ؟ بَلْ أَخْتَارُ اللهَ وَرَسُولَهُ، وَالدَّارَ الْآخِرَةَ، وَأَسْأَلُكَ أَنْ لَا تُخْبِرَ امْرَأَةً مِنْ نِسَائِكَ بِالَّذِي قُلْتُ، قَالَ: «لَا تَسْأَلُنِي امْرَأَةٌ مِنْهُنَّ إِلَّا أَخْبَرْتُهَا، إِنَّ اللهَ لَمْ يَبْعَثْنِي مُعَنِّتًا، وَلَا مُتَعَنِّتًا، وَلَكِنْ بَعَثَنِي مُعَلِّمًا مُيَسِّرًا."
      },
      {
        "id": 11255,
        "hadith_number": "3691",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Umar al-Khattab dan Perkara Perselisihan Rasulullah SAW dengan Isteri-isterinya serta Turunnya Ayat Pilihan",
        "perawi_melayu": "Umar bin al-Khattab (رضي الله عنه) meriwayatkan:",
        "english_text": "When Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) kept himself away from his wives, I entered the mosque, and found people striking the ground with pebble sand saying: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) has divorced his wives, and that was before they were commanded to observe seclusion 'Umar رضی اللہ عنہ said to himself: I must find this (actual position) today. So I went to 'A'isha (رضی اللہ عنہا) and said (to her): Daughter of Abu Bakr رضی اللہ عنہ, have you gone to the extent of giving trouble to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌)? Thereupon she said: Son of Khattab, you have nothing to do with me, and I have nothing to do with you. You should look to your own receptacle. He ('Umar رضی اللہ عنہ) said: I visited Hafsa daughter of 'Umar رضی اللہ عنہ , and said to her: Hafsa رضی اللہ عنہا , the (news) has reached me that you cause Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) trouble. You know that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) does not love you, and had I not been (your father) he would have divorced you. (On hearing this) she wept bitterly. I said to her: Where is Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌)? She said: He is in the attic room. I went in and found Rabah, the servant of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), sitting on the thresholds of the window dangling his feet on the hollow wood of the date-palm with the help of which Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) climbed (to the apartment) and came down. I cried: O Rabah, seek permission for me from Allah's Messenger (way peace be upon him). Rabah cast a glance at the apartment and then looked toward me but said nothing. I again said: Rabah, seek permission for me from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). Rabah looked towards the apartment and then cast a glance at me, but said nothing. I then raised my voice and said: 0 Rabah, seek permission for me from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). I think that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) is under the impression that I have come for the sake of Hafsa رضی اللہ عنہا . By Allah, if Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) would command me to strike her neck, I would certainly strike her neck. I raised my voice and he pointed me to climb up (and get into his apartment). I visited Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and he was lying on a mat. I sat down and he drew up his lower garment over him and he had nothing (else) over him, and that the mat had left its marks on his sides. I looked with my eyes in the store room of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). I found only a handful of barley equal to one sa' and an equal quantity of the leaves of Mimosa Flava placed in the nook of the cell, and a semi-tanned leather bag hanging (in one side), and I was moved to tears (on seeing this extremely austere living of the Holy Prophet), and he said: Ibn Khattab رضی اللہ عنہ, what wakes you weep? I said: Apostle of Allah, why should I not shed tears? This mat has left its marks on your sides and I do not see in your store room (except these few things) that I have seen; Ceasar and Closroes are leading their lives in plenty whereas you are Allah's Messenger. His chosen one, and that is your store! He said: Ibn Khattab, aren't you satisfied that for us (there should be the prosperity) of the Hereafter, and for them (there should be the prosperity of) this world? I said: Yes. And as I had entered I had seen the signs of anger on his face, and I therefore, said: Messenger of Allah, what trouble do you feel from your wives, and if youhave divorced them, verily Allah is with you, His angels, Gabriel, Mika'il, I and Abu Bakr رضی اللہ عنہ and the believers are with you. And seldom I talked and (which I uttered on that day) I hoped that Allah would testify to my words that I uttered. And so the verse of option (Ayat al-Takhyir) was revealed. Maybe his Lord, if he divorce you, will give him in your place wives better than you... (Ixv. 5). And if you back up one another against him, then surely Allah is his Patron, and Gabriel and the righteous believers, and the angels after that are the aidera (lvi. 4). And it was 'A'isha, daughter of Abu Bakr رضی اللہ عنہ , and Hafsa رضی اللہ عنہا who had prevailed upon all the wives of Allah's Prophet (way peace be upon him) for (pressing them for mote money). I said: Messenger of Allah, have you divorced them? He said: No. I said: Messenger of Allah, I entered the mosque and found the Muslims playing with pebbles (absorbed in thought) and saying: Allah's Messenger has divorced his wives. Should I get down and inform there that you have not divorced them? He said: Yes, if you so like. And I went on talking to him until I (found) the signs of anger disappeared on his face and (his seriousness was changed to a happy mood and as a result thereof) his face had the natural tranquillity upon it and he laughed and his teeth were the most charming (among the teeth) of all people. Then Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) climbed down and I also climbed down and catching hold of the wood of the palm-tree and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came down (with such ease) as if he was walking on the ground, not touching anything with his hand (to get support). I said: Messenger of Allah, you remained in your apartment for twenty-nine days. He said: (At times) the month consists of twenty-nine days. I stood at the door of the mosque and I called out at the top of my voice: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) has not divorced his wives (and it was on this occasion that this) verse was revealed: And if any matter pertaining to peace or alarm comes within their ken, they broadcast it; whereas, if they would refer it to the Apostle and those who have been entrusted with authority amongst them, those of them who are engaged in obtaining intelligence would indeed know (what to do with) it (iv 83). And it was I who understood this matter, and Allah revealed the verse pertaining to option (given to the Prophet (may peace be upon him in regard to the retaining or divorcing of his wives).",
        "malay_translation": "Apabila Rasulullah SAW menjauhi isteri-isterinya, aku memasuki masjid dan mendapati orang ramai memukul tanah dengan batu kecil sambil berkata: Rasulullah SAW telah menceraikan isteri-isterinya. Ini berlaku sebelum mereka diperintahkan untuk beruzlah (menarik diri dari khalayak ramai). Umar r.a. berkata dalam hatinya: Aku mesti mencari kebenaran pada hari ini. Maka aku pergi menemui Aisyah r.a. dan berkata kepadanya: Wahai anak perempuan Abu Bakar r.a., adakah engkau telah menyusahkan Rasulullah SAW? Dia menjawab: Wahai anak Khattab, aku tidak berurusan denganmu, dan engkau juga tidak berurusan denganku. Engkau perlu menjaga dirimu sendiri. Aku kemudian menemui Hafsah binti Umar r.a. dan berkata: Wahai Hafsah r.a., khabar sampai kepadaku bahawa engkau menyusahkan Rasulullah SAW. Engkau tahu bahawa Rasulullah SAW tidak menyayangi engkau, dan kalau bukan kerana bapa engkau, nescaya beliau akan menceraikan engkau. Mendengar itu, Hafsah r.a menangis dengan kuat. Aku bertanya: Di manakah Rasulullah SAW? Dia menjawab: Beliau berada di bilik atas. Aku pergi ke sana dan mendapati Rabah, hamba Rasulullah SAW, sedang duduk di ambang tingkap, menggantung kakinya pada batang pohon kurma yang digunakan oleh Rasulullah SAW untuk naik dan turun. Aku berteriak: Wahai Rabah, mintalah izin untukku menemui Rasulullah SAW. Rabah memandang ke dalam bilik dan kemudian memandangku, tetapi tidak berkata apa-apa. Aku berteriak lagi: Wahai Rabah, mintalah izin untukku menemui Rasulullah SAW. Rabah memandang ke dalam bilik dan kemudian memandangku, tetapi tidak berkata apa-apa. Kemudian aku berteriak lagi dengan lantang: Wahai Rabah, mintalah izin untukku menemui Rasulullah SAW. Aku rasa Rasulullah SAW beranggapan aku datang untuk Hafsah r.a. Demi Allah, sekiranya Rasulullah SAW memerintahkan aku untuk memotong lehernya, nescaya aku akan melakukannya. Aku berteriak dan beliau memberi isyarat agar aku naik. Aku menemui Rasulullah SAW yang sedang berbaring di atas tikar. Aku duduk dan beliau menarik jubahnya menutupinya, dan tidak ada apa-apa lagi menutupinya, dan tikar itu meninggalkan kesan pada tubuhnya. Aku melihat ke dalam stor Rasulullah SAW. Aku hanya mendapati segenggam gandum seukuran satu sa' dan sejumlah daun mimosa di sudut bilik, serta beg kulit separa kering tergantung. Aku menangis melihat kesederhanaan Rasulullah SAW. Beliau bertanya: Wahai Ibn Khattab, mengapa engkau menangis? Aku menjawab: Wahai Rasulullah, mengapa aku tidak menangis? Tikar ini meninggalkan kesan pada tubuhmu, dan aku tidak melihat apa-apa di dalam stormu melainkan sedikit ini, sementara Kaisar dan Khosrow hidup dalam kemewahan, sedangkan engkau adalah utusan Allah, yang terpilih, dan ini adalah stormu! Beliau menjawab: Wahai Ibn Khattab, adakah engkau tidak puas hati bahawa untuk kita (adalah kebahagiaan) akhirat, dan untuk mereka (adalah kebahagiaan) dunia ini? Aku menjawab: Ya. Ketika aku masuk, aku melihat tanda-tanda kemarahan pada wajah beliau. Maka aku berkata: Wahai Rasulullah SAW, apakah masalah yang engkau hadapi daripada isteri-isterimu? Sekiranya engkau telah menceraikan mereka, sesungguhnya Allah bersamamu, malaikat-malaikat-Nya, Jibril, Mikail, aku, Abu Bakar r.a., dan orang beriman bersamamu. Aku banyak bercakap pada hari itu dan berharap Allah akan menyaksikan kata-kataku. Maka turunlah ayat pilihan (Ayat al-Takhyir). Mungkin Tuhannya, sekiranya Dia menceraikan kamu, akan menggantikan kamu dengan isteri yang lebih baik daripada kamu... (Al-Tahrim 5). Dan jika mereka menentangmu, maka sesungguhnya Allah adalah pelindungmu, Jibril dan orang-orang yang beriman, serta malaikat-malaikat setelah itu adalah penolongmu (Al-Tahrim 4). Aisyah binti Abu Bakar r.a. dan Hafsah r.a adalah orang yang telah menyuruh isteri-isteri Rasulullah SAW meminta lebih banyak harta. Aku berkata: Wahai Rasulullah SAW, adakah engkau telah menceraikan mereka? Beliau menjawab: Tidak. Aku berkata: Wahai Rasulullah SAW, aku masuk ke masjid dan mendapati umat Islam bermain dengan batu sambil berkata: Rasulullah SAW telah menceraikan isteri-isterinya. Patutkah aku turun dan memberitahu mereka bahawa engkau tidak menceraikan mereka? Beliau menjawab: Ya, jika engkau ingin. Aku terus bercakap dengan beliau sehingga tanda-tanda kemarahan hilang dari wajahnya dan wajahnya kembali tenang, serta beliau tertawa dan giginya paling menarik di antara manusia. Kemudian Rasulullah SAW turun dan aku juga turun sambil memegang batang pokok kurma dan beliau turun dengan mudah seolah-olah berjalan di atas tanah, tanpa menyentuh apa-apa dengan tangannya. Aku bertanya: Wahai Rasulullah SAW, engkau berada di bilikmu selama dua puluh sembilan hari. Beliau menjawab: Kadangkala bulan terdiri daripada dua puluh sembilan hari. Aku berdiri di pintu masjid dan berteriak: Rasulullah SAW tidak menceraikan isteri-isterinya (dan pada masa inilah ayat ini) turun: Dan sekiranya sesuatu yang berkaitan dengan keamanan atau bahaya datang kepada mereka, mereka akan mengumumkannya; tetapi sekiranya mereka merujuknya kepada Rasul dan orang-orang yang bertanggungjawab di antara mereka, orang-orang yang mengumpul maklumat akan mengetahui apa yang harus dilakukan (An-Nur 83). Dan akulah yang memahami perkara ini, dan Allah menurunkan ayat pilihan yang diberikan kepada Rasulullah SAW mengenai mengekalkan atau menceraikan isteri-isterinya.",
        "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عُمَرُ بْنُ يُونُسَ الْحَنَفِيُّ، حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، عَنْ سِمَاكٍ أَبِي زُمَيْلٍ، حَدَّثَنِي عَبْدُ اللهِ بْنُ عَبَّاسٍ، حَدَّثَنِي عُمَرُ بْنُ الْخَطَّابِ، قَالَ: لَمَّا اعْتَزَلَ نَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نِسَاءَهُ، قَالَ: دَخَلْتُ الْمَسْجِدَ، فَإِذَا النَّاسُ يَنْكُتُونَ بِالْحَصَى، وَيَقُولُونَ: طَلَّقَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نِسَاءَهُ، وَذَلِكَ قَبْلَ أَنْ يُؤْمَرْنَ بِالْحِجَابِ، فَقَالَ عُمَرُ، فَقُلْتُ: لَأَعْلَمَنَّ ذَلِكَ الْيَوْمَ، قَالَ: فَدَخَلْتُ عَلَى عَائِشَةَ، فَقُلْتُ: يَا بِنْتَ أَبِي بَكْرٍ، أَقَدْ بَلَغَ مِنْ شَأْنِكِ أَنْ تُؤْذِي رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَتْ: مَا لِي وَمَا لَكَ [ص:1106] يَا ابْنَ الْخَطَّابِ، عَلَيْكَ بِعَيْبَتِكَ، قَالَ فَدَخَلْتُ عَلَى حَفْصَةَ بِنْتِ عُمَرَ، فَقُلْتُ لَهَا: يَا حَفْصَةُ، أَقَدْ بَلَغَ مِنْ شَأْنِكِ أَنْ تُؤْذِي رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ وَاللهِ، لَقَدْ عَلِمْتِ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، لَا يُحِبُّكِ، وَلَوْلَا أَنَا لَطَلَّقَكِ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَبَكَتْ أَشَدَّ الْبُكَاءِ، فَقُلْتُ لَهَا: أَيْنَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ قَالَتْ: هُوَ فِي خِزَانَتِهِ فِي الْمَشْرُبَةِ، فَدَخَلْتُ، فَإِذَا أَنَا بِرَبَاحٍ غُلَامِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَاعِدًا عَلَى أُسْكُفَّةِ الْمَشْرُبَةِ، مُدَلٍّ رِجْلَيْهِ عَلَى نَقِيرٍ مِنْ خَشَبٍ - وَهُوَ جِذْعٌ يَرْقَى عَلَيْهِ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَيَنْحَدِرُ - فَنَادَيْتُ: يَا رَبَاحُ، اسْتَأْذِنْ لِي عِنْدَكَ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَنَظَرَ رَبَاحٌ إِلَى الْغُرْفَةِ، ثُمَّ نَظَرَ إِلَيَّ، فَلَمْ يَقُلْ شَيْئًا، ثُمَّ قُلْتُ: يَا رَبَاحُ، اسْتَأْذِنْ لِي عِنْدَكَ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَنَظَرَ رَبَاحٌ إِلَى الْغُرْفَةِ، ثُمَّ نَظَرَ إِلَيَّ، فَلَمْ يَقُلْ شَيْئًا، ثُمَّ رَفَعْتُ صَوْتِي، فَقُلْتُ: يَا رَبَاحُ، اسْتَأْذِنْ لِي عِنْدَكَ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَإِنِّي أَظُنُّ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ظَنَّ أَنِّي جِئْتُ مِنْ أَجْلِ حَفْصَةَ، وَاللهِ، لَئِنْ أَمَرَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِضَرْبِ عُنُقِهَا، لَأَضْرِبَنَّ عُنُقَهَا، وَرَفَعْتُ صَوْتِي، فَأَوْمَأَ إِلَيَّ أَنِ ارْقَهْ، فَدَخَلْتُ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُضْطَجِعٌ عَلَى حَصِيرٍ، فَجَلَسْتُ، فَأَدْنَى عَلَيْهِ إِزَارَهُ وَلَيْسَ عَلَيْهِ غَيْرُهُ، وَإِذَا الْحَصِيرُ قَدْ أَثَّرَ فِي جَنْبِهِ، فَنَظَرْتُ بِبَصَرِي فِي خِزَانَةِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَإِذَا أَنَا بِقَبْضَةٍ مِنْ شَعِيرٍ نَحْوِ الصَّاعِ، وَمِثْلِهَا قَرَظًا فِي نَاحِيَةِ [ص:1107] الْغُرْفَةِ، وَإِذَا أَفِيقٌ مُعَلَّقٌ، قَالَ: فَابْتَدَرَتْ عَيْنَايَ، قَالَ: «مَا يُبْكِيكَ يَا ابْنَ الْخَطَّابِ» قُلْتُ: يَا نَبِيَّ اللهِ، وَمَا لِي لَا أَبْكِي وَهَذَا الْحَصِيرُ قَدْ أَثَّرَ فِي جَنْبِكَ، وَهَذِهِ خِزَانَتُكَ لَا أَرَى فِيهَا إِلَّا مَا أَرَى، وَذَاكَ قَيْصَرُ وَكِسْرَى فِي الثِّمَارِ وَالْأَنْهَارِ، وَأَنْتَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَصَفْوَتُهُ، وَهَذِهِ خِزَانَتُكَ، فَقَالَ: «يَا ابْنَ الْخَطَّابِ، أَلَا تَرْضَى أَنْ تَكُونَ لَنَا الْآخِرَةُ وَلَهُمُ الدُّنْيَا؟»، قُلْتُ: بَلَى، قَالَ: وَدَخَلْتُ عَلَيْهِ حِينَ دَخَلْتُ، وَأَنَا أَرَى فِي وَجْهِهِ الْغَضَبَ، فَقُلْتُ: يَا رَسُولَ اللهِ، مَا يَشُقُّ عَلَيْكَ مِنْ شَأْنِ النِّسَاءِ؟ فَإِنْ كُنْتَ طَلَّقْتَهُنَّ، فَإِنَّ اللهَ مَعَكَ، وَمَلَائِكَتَهُ، وَجِبْرِيلَ، وَمِيكَائِيلَ، وَأَنَا، وَأَبُو بَكْرٍ، وَالْمُؤْمِنُونَ مَعَكَ، وَقَلَّمَا تَكَلَّمْتُ وَأَحْمَدُ اللهَ بِكَلَامٍ، إِلَّا رَجَوْتُ أَنْ يَكُونَ اللهُ يُصَدِّقُ قَوْلِي الَّذِي أَقُولُ، وَنَزَلَتْ هَذِهِ الْآيَةُ آيَةُ التَّخْيِيرِ: {عَسَى رَبُّهُ إِنْ طَلَّقَكُنَّ أَنْ يُبْدِلَهُ أَزْوَاجًا خَيْرًا مِنْكُنَّ} [التحريم: 5]، {وَإِنْ تَظَاهَرَا عَلَيْهِ فَإِنَّ اللهَ هُوَ مَوْلَاهُ وَجِبْرِيلُ وَصَالِحُ الْمُؤْمِنِينَ وَالْمَلَائِكَةُ بَعْدَ ذَلِكَ ظَهِيرٌ} [التحريم: 4]، وَكَانَتْ عَائِشَةُ بِنْتُ أَبِي بَكْرٍ، وَحَفْصَةُ تَظَاهَرَانِ عَلَى سَائِرِ نِسَاءِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقُلْتُ: يَا رَسُولَ اللهِ أَطَلَّقْتَهُنَّ؟ قَالَ: «لَا»، قُلْتُ: يَا رَسُولَ اللهِ، إِنِّي دَخَلْتُ الْمَسْجِدَ وَالْمُسْلِمُونَ يَنْكُتُونَ بِالْحَصَى، يَقُولُونَ: طَلَّقَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نِسَاءَهُ، أَفَأَنْزِلُ، فَأُخْبِرَهُمْ أَنَّكَ لَمْ تُطَلِّقْهُنَّ، قَالَ: «نَعَمْ، إِنْ شِئْتَ»، فَلَمْ أَزَلْ أُحَدِّثُهُ حَتَّى تَحَسَّرَ الْغَضَبُ عَنْ وَجْهِهِ، وَحَتَّى كَشَرَ فَضَحِكَ، وَكَانَ مِنْ أَحْسَنِ النَّاسِ ثَغْرًا، ثُمَّ نَزَلَ نَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَنَزَلْتُ، فَنَزَلْتُ أَتَشَبَّثُ بِالْجِذْعِ، وَنَزَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَأَنَّمَا يَمْشِي عَلَى الْأَرْضِ مَا يَمَسُّهُ بِيَدِهِ، فَقُلْتُ: يَا رَسُولَ اللهِ إِنَّمَا كُنْتَ فِي الْغُرْفَةِ تِسْعَةً وَعِشْرِينَ، قَالَ: «إِنَّ الشَّهْرَ يَكُونُ تِسْعًا وَعِشْرِينَ»، فَقُمْتُ عَلَى بَابِ الْمَسْجِدِ، فَنَادَيْتُ بِأَعْلَى صَوْتِي، لَمْ يُطَلِّقْ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نِسَاءَهُ، وَنَزَلَتْ هَذِهِ الْآيَةُ: {وَإِذَا جَاءَهُمْ أَمْرٌ مِنَ الْأَمْنِ أَوِ الْخَوْفِ أَذَاعُوا بِهِ وَلَوْ رَدُّوهُ إِلَى الرَّسُولِ وَإِلَى أُولِي الْأَمْرِ مِنْهُمْ لَعَلِمَهُ الَّذِينَ يَسْتَنْبِطُونَهُ مِنْهُمْ} [النساء: 83] فَكُنْتُ أَنَا اسْتَنْبَطْتُ ذَلِكَ الْأَمْرَ، وَأَنْزَلَ اللهُ عَزَّ وَجَلَّ آيَةَ التَّخْيِيرِ."
      },
      {
        "id": 11256,
        "hadith_number": "3692",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Peristiwa Umar bin al-Khattab (رضي الله عنه) dan Perselisihan dengan Isteri-isteri Rasulullah (صلى الله عليه وسلم)",
        "perawi_melayu": "Abdullah bin Abbas (رضي الله عنه) meriwayatkan:",
        "english_text": "I intended to ask 'Umar bin al-Khattab ( رضی اللہ عنہ) about a verse, but I waited for one year to ask him out of his fear, until he went out for Pilgrimage and I also accompanied him. As he came back and we were on the way he stepped aside towards an Arak tree to ease himself. I waited for him until he was free. I then walked along with him and said: Commander of the Faithful, who are the two among the wives of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) who backed up one another (in their demand for extra money)? He said: They were Hafsa and 'A'isha (رضی اللہ عنہا ). I said to him: It is for one year that I intended to ask you about this matter but I could not date so on account of the awe for you. He said: Don't do that. If you think that I have any knowledge, do ask me about that. And if I were to know that, I would inform you. He (the narrator) stated that 'Umar رضی اللہ عنہ had said: By Allah, during the days of ignorance we had no regard for women until Allah the Exalted revealed about them what He has revealed, and appointed (turn) for them what he appointed. He said: It so happened that I was thinking about some matter that my wife said: I wish you had done that and that. I said to her: It does not concern you and you should not feel disturbed in a matter which I intend to do. She said to me: How strange is it that you, O son of Khattab, do not like anyone to retort upon you, whereas your daughter retorts upon Allah's Messenger (ﷺ) until he spends the day in vexation. 'Umar رضی اللہ عنہ said: I took hold of my cloak, then came out of my house until I visited Hafsa and said to her: O daughter, (I heard) that you retort upon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) until he spends the day in vexation, whereupon Hafsa رضی اللہ عنہا said: By Allah, we do retort upon him. I said: You should bear in mind, my daughter, that I warn you against the punishment of Allah and the wrath of His Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). You may not be misled by one whose beauty has fascinated her, and the love of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) for her. I ('Umar رضی اللہ عنہ) then visited Umm Salama رضی اللہ عنہا because of my relationship with her and I talked to her. Umm Salama رضی اللہ عنہا said to me: Umar bin al-Khattab رضی اللہ عنہا , how strange is it that you meddle with every matter so much so that you are anxious to interfere between Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and his wives, and this perturbed me so much that I refrained from saying what I had to say, so I came out of her apartment, and I had a friend from the Anar. When I had been absent (from the company of the Holy Prophet ﷺ) he used to bring me the news and when he had been absent I used to bring him the news, and at that time we dreaded a king of Ghassan. It was mentioned to us that he intended to attack us, and our minds were haunted by him. My friend, the Ansari, came to me, and he knocked at the door and said: Open it, open it. I said: Has the Ghassani come? He said: (The matter is) more serious than that. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) has separated himself from his wives. I said: Let the nose of Hafsa رضی اللہ عنہا and 'A'isha رضی اللہ عنہا  be besmeared with dust. I then took hold of my cloth and went out until I came and found Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in his attic to which he climbed by means of a ladder made of date-palm, and the servant of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) who was black had been sitting at the end of the ladder. I said: This is Umar. So permission was granted to me. I narrated this news to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and as I narrated the news concerning Umm Salama رضی اللہ عنہا , Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) smiled. He was lying on the mat and there was nothing between him and that (mat), and under his head there was a pillow made of leather and it was stuffed with plam fibres and at his feet were lying a heap of sant tree (acacia niloctica, meant for dyeing) and near his head there was hanging a hide. And I saw the marks of the maton the side of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and so I wept. He said: What makes you weep? I said: Messenger of Allah, the Khusrau and the Ceasars (spendd their lives in) the midst of (luxuries), whereas you being Allah's Messenger (are leading your life in this poverty). Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Don't you like that they should have riches of their world, and you have the Hereafter.",
        "malay_translation": "Saya ingin bertanya kepada 'Umar bin al-Khattab (رضي الله عنه) tentang satu ayat, tetapi saya menunggu selama setahun untuk bertanya kepadanya kerana takut, sehingga beliau keluar untuk menunaikan haji dan saya turut serta. Ketika beliau pulang dan kita dalam perjalanan, beliau berhenti di sebelah pokok ara untuk membuang air kecil. Saya menunggu sehingga beliau selesai. Kemudian, saya berjalan bersamanya dan berkata: “Wahai Panglima Mukminin, siapakah dua isteri Rasulullah (صلى الله عليه وسلم) yang saling menyokong (dalam tuntutan mereka untuk mendapatkan tambahan wang)?” Beliau menjawab: “Mereka adalah Hafsah dan 'Aisyah (رضي الله عنهما).” Saya berkata kepadanya: “Sudah setahun saya berhasrat untuk bertanya tentang perkara ini tetapi tidak dapat melakukannya kerana takut kepada anda.” Beliau berkata: “Janganlah begitu. Jika anda rasa saya mempunyai ilmu, tanyakanlah. Dan jika saya mengetahuinya, saya akan beritahu anda.” Beliau (perawi) menyatakan bahawa 'Umar رضي الله عنه telah berkata: “Demi Allah, pada zaman jahiliah, kita tidak mementingkan wanita sehingga Allah Yang Maha Tinggi menurunkan wahyu tentang mereka dan menetapkan apa yang Dia tetapkan.” Beliau berkata: “Kebetulan saya memikirkan sesuatu perkara yang isteri saya berkata: “Andainya anda melakukannya.” Saya berkata kepadanya: “Itu bukan urusan anda dan anda tidak sepatutnya bimbang tentang perkara yang saya ingin lakukan.” Isteri saya berkata: “Betapa anehnya, wahai anak Khattab, anda tidak suka dikritik, sedangkan anak perempuan anda mengkritik Rasulullah (ﷺ) sehingga beliau menghabiskan hari dalam keadaan marah.” 'Umar رضي الله عنه berkata: “Saya memegang jubah saya, lalu keluar dari rumah saya hingga saya melawat Hafsah dan berkata kepadanya: “Wahai anak perempuan, saya mendengar bahawa anda mengkritik Rasulullah (صلى الله عليه وسلم) sehingga beliau menghabiskan hari dalam keadaan marah, lalu Hafsah رضي الله عنها berkata: “Demi Allah, kami memang mengkritiknya.” Saya berkata: “Ingatlah, anak perempuan, bahawa saya memperingatkan anda daripada azab Allah dan kemurkaan Rasul-Nya (صلى الله عليه وسلم). Jangan tertipu oleh seseorang yang kecantikannya memukau anda dan kasih sayang Rasulullah (صلى الله عليه وسلم) terhadapnya. Kemudian, saya melawat Umm Salamah رضي الله عنها atas sebab hubungan saya dengannya dan saya berbincang dengannya. Umm Salamah رضي الله عنها berkata kepada saya: “Umar bin al-Khattab رضي الله عنه, betapa peliknya anda mencampuri setiap perkara sehingga anda ingin campur tangan di antara Rasulullah (صلى الله عليه وسلم) dan isteri-isterinya, dan perkara ini sangat mengganggu saya sehingga saya menahan diri daripada berkata apa yang saya ingin katakan, lalu saya keluar dari rumahnya. Saya mempunyai seorang kawan daripada kaum Anar. Apabila saya tidak berada di sisi Nabi (ﷺ), beliau akan memberitahu saya berita dan apabila beliau tidak berada di sisi saya, saya akan memberitahu beliau. Pada masa itu, kita takut kepada seorang raja Ghassan. Kita diberitahu bahawa dia berhasrat menyerang kita dan fikiran kita dibayangi olehnya. Kawan saya, seorang Ansar, datang kepada saya dan mengetuk pintu. Katanya: “Buka, buka.” Saya bertanya: “Adakah Raja Ghassan telah datang?” Beliau menjawab: “Lebih serius daripada itu. Rasulullah (صلى الله عليه وسلم) telah mengasingkan diri dari isteri-isterinya.” Saya berkata: “Semoga hidung Hafsah رضي الله عنها dan 'Aisyah رضي الله عنها dipenuhi debu.” Kemudian, saya memegang kain saya dan keluar hingga saya mendapati Rasulullah (صلى الله عليه وسلم) di bumbung rumahnya yang didaki melalui tangga pokok kurma, dan hamba Rasulullah (صلى الله عليه وسلم) yang berkulit hitam duduk di hujung tangga. Saya berkata: “Ini Umar.” Maka kebenaran diberikan kepada saya. Saya memberitahu Rasulullah (صلى الله عليه وسلم) tentang berita ini, dan ketika saya menceritakan berita tentang Umm Salamah رضي الله عنها, Rasulullah (صلى الله عليه وسلم) tersenyum. Beliau berbaring di atas tikar, dan tiada apa-apa di antara beliau dan tikar itu, dan di bawah kepala beliau terdapat bantal kulit yang diisi dengan serat kurma, dan di kaki beliau terdapat timbunan kayu santan (untuk pewarnaan) dan berhampiran kepala beliau tergantung kulit binatang. Saya melihat kesan tikar pada sisi Rasulullah (صلى الله عليه وسلم), dan saya menangis. Beliau bertanya: “Apa yang membuat anda menangis?” Saya menjawab: “Wahai Rasulullah, Khusrau dan Kaisar hidup dalam kemewahan, sedangkan anda, sebagai Rasul Allah, hidup dalam kesederhanaan.” Lalu Rasulullah (صلى الله عليه وسلم) bersabda: “Bukankah anda lebih suka mereka menikmati kekayaan dunia dan anda mempunyai akhirat?”",
        "arabic_text": "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي سُلَيْمَانُ يَعْنِي ابْنَ بِلَالٍ، أَخْبَرَنِي يَحْيَى، أَخْبَرَنِي عُبَيْدُ بْنُ حُنَيْنٍ، أَنَّهُ سَمِعَ عَبْدَ اللهِ بْنَ عَبَّاسٍ، يُحَدِّثُ قَالَ: مَكَثْتُ سَنَةً وَأَنَا أُرِيدُ أَنْ أَسْأَلَ عُمَرَ بْنَ الْخَطَّابِ عَنْ آيَةٍ، فَمَا أَسْتَطِيعُ أَنْ أَسْأَلَهُ، هَيْبَةً لَهُ حَتَّى خَرَجَ حَاجًّا، فَخَرَجْتُ مَعَهُ، فَلَمَّا رَجَعَ فَكُنَّا بِبَعْضِ الطَّرِيقِ عَدَلَ إِلَى الْأَرَاكِ لِحَاجَةٍ لَهُ، فَوَقَفْتُ لَهُ حَتَّى فَرَغَ، ثُمَّ سِرْتُ مَعَهُ، فَقُلْتُ: يَا أَمِيرَ الْمُؤْمِنِينَ، مَنِ اللَّتَانِ تَظَاهَرَتَا عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ أَزْوَاجِهِ، فَقَالَ: تِلْكَ حَفْصَةُ وَعَائِشَةُ، قَالَ فَقُلْتُ لَهُ: وَاللهِ، إِنْ كُنْتُ لَأُرِيدُ أَنْ أَسْأَلَكَ عَنْ هَذَا مُنْذُ سَنَةٍ، فَمَا أَسْتَطِيعُ هَيْبَةً لَكَ، قَالَ: فَلَا تَفْعَلْ، مَا ظَنَنْتَ أَنَّ عِنْدِي مِنْ عِلْمٍ فَسَلْنِي عَنْهُ، فَإِنْ كُنْتُ أَعْلَمُهُ أَخْبَرْتُكَ، قَالَ: وَقَالَ عُمَرُ: وَاللهِ، إِنْ كُنَّا فِي الْجَاهِلِيَّةِ مَا نَعُدُّ لِلنِّسَاءِ أَمْرًا، حَتَّى أَنْزَلَ اللهُ تَعَالَى فِيهِنَّ مَا أَنْزَلَ، وَقَسَمَ لَهُنَّ مَا قَسَمَ، قَالَ: فَبَيْنَمَا أَنَا فِي أَمْرٍ أَأْتَمِرُهُ إِذْ قَالَتْ لِي امْرَأَتِي: لَوْ صَنَعْتَ كَذَا وَكَذَا، فَقُلْتُ لَهَا: وَمَا لَكِ أَنْتِ، وَلِمَا هَاهُنَا؟ وَمَا تَكَلُّفُكِ فِي أَمْرٍ أُرِيدُهُ، فَقَالَتْ لِي: عَجَبًا لَكَ يَا ابْنَ الْخَطَّابِ، مَا تُرِيدُ أَنْ تُرَاجَعَ أَنْتَ، وَإِنَّ ابْنَتَكَ لَتُرَاجِعُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، حَتَّى يَظَلَّ يَوْمَهُ غَضْبَانَ، قَالَ عُمَرُ [ص:1109]: فَآخُذُ رِدَائِي، ثُمَّ أَخْرُجُ مَكَانِي حَتَّى أَدْخُلَ عَلَى حَفْصَةَ، فَقُلْتُ لَهَا: يَا بُنَيَّةُ إِنَّكِ لَتُرَاجِعِينَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، حَتَّى يَظَلَّ يَوْمَهُ غَضْبَانَ؟ فَقَالَتْ حَفْصَةُ: وَاللهِ إِنَّا لَنُرَاجِعُهُ، فَقُلْتُ: تَعْلَمِينَ أَنِّي أُحَذِّرُكِ عُقُوبَةَ اللهِ، وَغَضَبَ رَسُولِهِ، يَا بُنَيَّةُ، لَا يَغُرَّنَّكِ هَذِهِ الَّتِي قَدْ أَعْجَبَهَا حُسْنُهَا، وَحُبُّ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِيَّاهَا، ثُمَّ خَرَجْتُ حَتَّى أَدْخُلَ عَلَى أُمِّ سَلَمَةَ لِقَرَابَتِي مِنْهَا، فَكَلَّمْتُهَا، فَقَالَتْ لِي أُمُّ سَلَمَةَ: عَجَبًا لَكَ يَا ابْنَ الْخَطَّابِ قَدْ دَخَلْتَ فِي كُلِّ شَيْءٍ، حَتَّى تَبْتَغِيَ أَنْ تَدْخُلَ بَيْنَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَزْوَاجِهِ، قَالَ: فَأَخَذَتْنِي أَخْذًا كَسَرَتْنِي عَنْ بَعْضِ مَا كُنْتُ أَجِدُ، فَخَرَجْتُ مِنْ عِنْدِهَا، وَكَانَ لِي صَاحِبٌ مِنَ الْأَنْصَارِ إِذَا غِبْتُ أَتَانِي بِالْخَبَرِ، وَإِذَا غَابَ كُنْتُ أَنَا آتِيهِ بِالْخَبَرِ، وَنَحْنُ حِينَئِذٍ نَتَخَوَّفُ مَلِكًا مِنْ مُلُوكِ غَسَّانَ، ذُكِرَ لَنَا أَنَّهُ يُرِيدُ أَنْ يَسِيرَ إِلَيْنَا، فَقَدِ امْتَلَأَتْ صُدُورُنَا مِنْهُ، فَأَتَى صَاحِبِي الْأَنْصَارِيُّ يَدُقُّ الْبَابَ، وَقَالَ: افْتَحِ افْتَحْ، فَقُلْتُ: جَاءَ الْغَسَّانِيُّ؟ فَقَالَ: أَشَدُّ مِنْ ذَلِكَ، اعْتَزَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَزْوَاجَهُ، فَقُلْتُ: رَغِمَ أَنْفُ حَفْصَةَ وَعَائِشَةَ، ثُمَّ آخُذُ ثَوْبِي، فَأَخْرُجُ حَتَّى جِئْتُ، فَإِذَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي مَشْرُبَةٍ لَهُ يُرْتَقَى إِلَيْهَا بِعَجَلَةٍ، وَغُلَامٌ لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَسْوَدُ عَلَى رَأْسِ الدَّرَجَةِ، فَقُلْتُ: هَذَا عُمَرُ، فَأُذِنَ لِي، قَالَ عُمَرُ: فَقَصَصْتُ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ هَذَا الْحَدِيثَ، فَلَمَّا بَلَغْتُ حَدِيثَ أُمِّ سَلَمَةَ، تَبَسَّمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَإِنَّهُ لَعَلَى حَصِيرٍ مَا بَيْنَهُ وَبَيْنَهُ شَيْءٌ، وَتَحْتَ رَأْسِهِ وِسَادَةٌ مِنْ أَدَمٍ، حَشْوُهَا لِيفٌ، وَإِنَّ عِنْدَ رِجْلَيْهِ قَرَظًا مَضْبُورًا، وَعِنْدَ رَأْسِهِ أُهُبًا مُعَلَّقَةً، فَرَأَيْتُ أَثَرَ الْحَصِيرِ فِي جَنْبِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَبَكَيْتُ، فَقَالَ: «مَا يُبْكِيكَ؟» فَقُلْتُ: يَا رَسُولَ اللهِ، إِنَّ كِسْرَى وَقَيْصَرَ فِيمَا هُمَا فِيهِ، وَأَنْتَ رَسُولُ اللهِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَمَا تَرْضَى أَنْ تَكُونَ لَهُمَا الدُّنْيَا، وَلَكَ الْآخِرَةُ."
      },
      {
        "id": 11257,
        "hadith_number": "3693",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Peristiwa di Marr al-Zahran dan Kunjungan Nabi SAW kepada Isteri-isterinya",
        "perawi_melayu": "Ibn Abbas (رضي الله عنه) berkata:",
        "english_text": "I came along with Umar رضی اللہ عنہ until we reached Marr al-Zahran (the name of a place), and the rest of the hadith is the same as narrated by Sulaiman bin Bilal (except with) the variation (of words) that I said: (What) about these two women? He said: They were Hafsa and Umm Salama  رضی اللہ عنھن . And he made this addition: I came to the apartments and in every apartment there was (the noise) of weeping. And this addition was also made: And he (the Holy Prophet ﷺ) had taken an oath of remaining away from them for a month, and when twenty-nine days had passed, he visited them.",
        "malay_translation": "Saya bersama Umar رضي الله عنه sehingga kami sampai ke Marr al-Zahran (nama tempat tersebut), dan selebihnya hadis ini sama seperti yang diriwayatkan oleh Sulaiman bin Bilal (kecuali dengan) perbezaan (kata-kata) bahawa saya bertanya, \"Bagaimana pula dengan dua wanita ini?\"  Beliau menjawab: \"Mereka adalah Hafsah dan Umm Salamah رضي الله عنهما.\" Dan beliau menambah: \"Saya sampai ke apartmen-apartmen dan di setiap apartmen terdapat tangisan. Dan tambahan ini juga dibuat: Dan baginda (Nabi SAW) telah berjanji untuk tidak mengunjungi mereka selama sebulan, dan setelah dua puluh sembilan hari berlalu, baginda melawat mereka.\"",
        "arabic_text": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، أَخْبَرَنِي يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ بْنِ حُنَيْنٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: أَقْبَلْتُ مَعَ عُمَرَ حَتَّى إِذَا كُنَّا بِمَرِّ الظَّهْرَانِ، وَسَاقَ الْحَدِيثَ بِطُولِهِ كَنَحْوِ حَدِيثِ سُلَيْمَانَ بْنِ بِلَالٍ، غَيْرَ أَنَّهُ قَالَ: قُلْتُ: شَأْنُ الْمَرْأَتَيْنِ؟ قَالَ: حَفْصَةُ، وَأُمُّ سَلَمَةَ، وَزَادَ فِيهِ: وَأَتَيْتُ الْحُجَرَ، فَإِذَا فِي كُلِّ بَيْتٍ بُكَاءٌ، وَزَادَ أَيْضًا: وَكَانَ آلَى مِنْهُنَّ شَهْرًا، فَلَمَّا كَانَ تِسْعًا وَعِشْرِينَ نَزَلَ إِلَيْهِنَّ."
      },
      {
        "id": 11258,
        "hadith_number": "3694",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Dua Wanita Penolong Nabi SAW di Masa Rasulullah SAW dan Perkenalan dengan 'Umar",
        "perawi_melayu": "Ibnu Abbas رضی اللہ عنہ berkata:",
        "english_text": "\"I wanted to ask 'Umar رضی اللہ عنہ about the two women who helped one another at the time of the Messenger of Allah, but for one year I could not find any opportunity, until I accompanied him to Makkah. When he was in Marr Az-Zahran, he went to relieve himself, and he said: 'Bring me a jug of water.' So I brought it to him, and when he had relieved himself and came back, I went to pour water for him, then I remembered and said to him: O commander of the Believers, who were the two women?' And I do not finish what I was saying before he said: \"Aishah and Hafsah رضی اللہ عنھن .\"",
        "malay_translation": "\"Aku ingin bertanya kepada 'Umar رضی اللہ عنہ tentang dua wanita yang saling menolong pada zaman Rasulullah SAW, tetapi selama setahun aku tidak mendapat peluang, sehingga aku menemaninya ke Makkah. Ketika beliau berada di Marr Az-Zahran, beliau pergi ke tandas, dan bersabda: 'Bawakan aku kendi air.' Maka aku membawanya kepadanya, dan setelah beliau selesai dan kembali, aku ingin menuangkan air untuknya, kemudian teringat dan aku berkata kepadanya: Wahai Amirul Mukminin, siapakah kedua wanita itu? Dan aku belum selesai berkata sebelum beliau menjawab: \"Aisyah dan Hafsah رضی اللہ عنھن.\"",
        "arabic_text": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَاللَّفْظُ لِأَبِي بَكْرٍ، قَالَا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، سَمِعَ عُبَيْدَ بْنَ حُنَيْنٍ، وَهُوَ مَوْلَى الْعَبَّاسِ، قَالَ: سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ: كُنْتُ أُرِيدُ أَنْ أَسْأَلَ عُمَرَ عَنِ الْمَرْأَتَيْنِ اللَّتَيْنِ تَظَاهَرَتَا عَلَى عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَلَبِثْتُ سَنَةً مَا أَجِدُ لَهُ مَوْضِعًا، حَتَّى صَحِبْتُهُ إِلَى مَكَّةَ، فَلَمَّا كَانَ بِمَرِّ الظَّهْرَانِ ذَهَبَ يَقْضِي حَاجَتَهُ، فَقَالَ: أَدْرِكْنِي بِإِدَاوَةٍ مِنْ مَاءٍ، فَأَتَيْتُهُ بِهَا، فَلَمَّا قَضَى حَاجَتَهُ وَرَجَعَ، ذَهَبْتُ أَصُبُّ عَلَيْهِ، وَذَكَرْتُ، فَقُلْتُ لَهُ: يَا أَمِيرَ الْمُؤْمِنِينَ، مَنِ الْمَرْأَتَانِ؟ فَمَا قَضَيْتُ كَلَامِي حَتَّى قَالَ: «عَائِشَةُ وَحَفْصَةُ."
      },
      {
        "id": 11259,
        "hadith_number": "3695",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perbincangan 'Umar al-Khattab dengan Isteri-isteri Rasulullah SAW dan Keprihatinannya Terhadap Kehidupan Rasulullah SAW",
        "perawi_melayu": "Abdullah bin Abbas (رضي الله عنه) meriwayatkan:",
        "english_text": "I intended to ask 'Umar bin al-Khattab ( رضی اللہ عنہ) about a verse, but I waited for one year to ask him out of his fear, until he went out for Pilgrimage and I also accompanied him. As he came back and we were on the way he stepped aside towards an Arak tree to ease himself. I waited for him until he was free. I then walked along with him and said: Commander of the Faithful, who are the two among the wives of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) who backed up one another (in their demand for extra money)? He said: They were Hafsa and 'A'isha ( رضی اللہ عنھن). I said to him: It is for one year that I intended to ask you about this matter but I could not date so on account of the awe for you. He said: Don't do that. If you think that I have any knowledge, do ask me about that. And if I were to know that, I would inform you. He (the narrator) stated that 'Umar رضی اللہ عنہ had said: By Allah, during the days of ignorance we had no regard for women until Allah the Exalted revealed about them what He has revealed, and appointed (turn) for them what he appointed. He said: It so happened that I was thinking about some matter that my wife said: I wish you had done that and that. I said to her: It does not concern you and you should not feel disturbed in a matter which I intend to do. She said to me: How strange is it that you, O son of Khattab, do not like anyone to retort upon you, whereas your daughter retorts upon Allah's Messenger (ﷺ) until he spends the day in vexation. 'Umar رضی اللہ عنہ said: I took hold of my cloak, then came out of my house until I visited Hafsa and said to her: O daughter, (I heard) that you retort upon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) until he spends the day in vexation, whereupon Hafsa said: By Allah, we do retort upon him. I said: You should bear in mind, my daughter, that I warn you against the punishment of Allah and the wrath of His Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). You may not be misled by one whose beauty has fascinated her, and the love of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) for her. I ('Umar رضی اللہ عنہ) then visited Umm Salama because of my relationship with her and I talked to her. Umm Salama said to me: Umar bin al-Khattab رضی اللہ عنہ, how strange is it that you meddle with every matter so much so that you are anxious to interfere between Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and his wives, and this perturbed me so much that I refrained from saying what I had to say, so I came out of her apartment, and I had a friend from the Anar. When I had been absent (from the company of the Holy Prophet) he used to bring me the news and when he had been absent I used to bring him the news, and at that time we dreaded a king of Ghassan. It was mentioned to us that he intended to attack us, and our minds were haunted by him. My friend, the Ansari, came to me, and he knocked at the door and said: Open it, open it. I said: Has the Ghassani come? He said: (The matter is) more serious than that. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) has separated himself from his wives. I said: Let the nose of Hafsa and 'A'isha رضی اللہ عنہا be besmeared with dust. I then took hold of my cloth and went out until I came and found Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in his attic to which he climbed by means of a ladder made of date-palm, and the servant of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) who was black had been sitting at the end of the ladder. I said: This is Umar. So permission was granted to me. I narrated this news to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and as I narrated the news concerning Umm Salama رضی اللہ عنہا , Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) smiled. He was lying on the mat and there was nothing between him and that (mat), and under his head there was a pillow made of leather and it was stuffed with plam fibres and at his feet were lying a heap of sant tree (acacia niloctica, meant for dyeing) and near his head there was hanging a hide. And I saw the marks of the maton the side of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and so I wept. He said: What makes you weep? I said: Messenger of Allah, the Khusrau and the Ceasars (spended their lives in) the midst of (luxuries), whereas you being Allah's Messenger (are leading your life in this poverty). Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Don't you like that they should have riches of their world, and you have the Hereafter.",
        "malay_translation": "Saya bermaksud bertanya kepada 'Umar bin al-Khattab (رضي الله عنه) tentang satu ayat, tetapi saya menunggu setahun untuk bertanya kepadanya kerana rasa hormat, sehingga beliau keluar untuk menunaikan haji dan saya juga menyertainya. Semasa beliau pulang dan kita dalam perjalanan, beliau berhenti di sebelah pokok ara untuk membuang hajat. Saya menunggu sehingga beliau selesai. Kemudian, saya berjalan bersamanya dan berkata: Ya, Amirul Mukminin, siapakah dua isteri Rasulullah SAW yang saling menyokong (dalam permintaan mereka untuk wang tambahan)? Baginda menjawab: Mereka ialah Hafsah dan 'Aisyah (رضي الله عنهما). Saya berkata kepadanya: Saya berhasrat untuk bertanya kepada anda tentang perkara ini selama setahun tetapi tidak berkesempatan disebabkan rasa hormat kepada anda. Beliau menjawab: Janganlah begitu. Jika anda berpendapat bahawa saya mempunyai ilmu, tanyakanlah. Dan jika saya mengetahuinya, saya akan memberitahu anda. Beliau (pengriwayatkan) berkata bahawa 'Umar رضي الله عنه telah berkata: Demi Allah, pada zaman jahiliah, kita tidak menghargai wanita sehingga Allah yang Maha Tinggi telah menurunkan wahyu tentang mereka dan menetapkan hukum bagi mereka. Beliau berkata: Kebetulan saya sedang memikirkan sesuatu perkara, lalu isteri saya berkata: Andai saja kamu telah berbuat demikian dan demikian. Saya berkata kepadanya: Ia bukan urusanmu dan janganlah engkau merasa terganggu dengan hal yang aku hendak lakukan. Dia berkata: Sungguh aneh, wahai anak Khattab, engkau tidak suka jika ada yang menasihati, sedangkan anak perempuanmu menasihati Rasulullah SAW sehingga beliau menghabiskan hari dalam keadaan marah. 'Umar رضي الله عنه berkata: Saya memegang jubah saya, lalu keluar dari rumah sehingga saya menemui Hafsah dan berkata kepadanya: Wahai anak perempuan, aku dengar engkau menasihati Rasulullah SAW sehingga beliau menghabiskan hari dalam keadaan marah. Lalu Hafsah berkata: Demi Allah, kami memang menasihatinya. Aku berkata: Ingatlah, anakku, aku memperingatkanmu tentang azab Allah dan murka RasulNya. Janganlah kau terpedaya dengan kecantikannya dan kasih sayang Rasulullah untuknya. Kemudian, aku menemui Umm Salamah kerana hubungan kekeluargaan dan aku bercakap dengannya. Umm Salamah berkata kepadaku: Wahai 'Umar bin al-Khattab رضي الله عنه, sungguh aneh engkau mencampuri setiap urusan sehinggakan engkau ingin campur tangan di antara Rasulullah dan isteri-isterinya. Perkara ini sangat mengganggu sehingga aku enggan berkata apa yang harus aku katakan, jadi aku keluar dari rumahnya, dan aku mempunyai seorang sahabat dari kalangan suku Anar. Ketika aku tidak bersama Nabi, dia akan menyampaikan berita kepadaku, dan apabila dia tidak hadir, aku menyampaikan berita kepadanya. Ketika itu, kita takut kepada raja Ghassan. Dikatakan kepadaku bahawa dia berhasrat untuk menyerang kita, dan fikiran kita dihantui olehnya. Temanku, seorang Ansari, datang kepadaku, mengetuk pintu dan berkata: Buka pintu! Buka! Aku berkata: Adakah Raja Ghassan datang? Dia menjawab: Masalah ini lebih serius daripada itu. Rasulullah telah mengasingkan diri daripada isteri-isterinya. Aku berkata: Biarlah hidung Hafsah dan 'Aisyah رضي الله عنهما dipenuhi debu. Lalu aku memegang jubahku dan keluar sehingga aku bertemu Rasulullah SAW di tingkat atas rumahnya yang didaki melalui tangga pokok kurma, dan hamba Rasulullah SAW yang berkulit hitam sedang duduk di hujung tangga. Aku berkata: Ini 'Umar. Oleh itu, aku diberi izin. Aku menceritakan berita ini kepada Rasulullah SAW, dan ketika aku menceritakan berita tentang Umm Salamah رضي الله عنها, Rasulullah tersenyum. Baginda sedang berbaring di atas tikar dan tiada apa di antara baginda dan tikar itu, dan di bawah kepala baginda ada bantal kulit yang diisi dengan serat pelepah kurma, di kaki baginda terdapat timbunan kayu gaharu (untuk pewarnaan) dan berhampiran kepala baginda tergantung kulit. Dan aku melihat kesan tikar di sisi Rasulullah SAW, dan aku menangis. Baginda bertanya: Apakah yang membuatkan engkau menangis? Aku berkata: Wahai Rasulullah, Khusrau dan Kaisar (menjalani kehidupan mereka di tengah-tengah) kemewahan, sedangkan engkau, sebagai Rasulullah, menjalani kehidupan dalam kemiskinan. Lalu Rasulullah SAW berkata: Tidakkah engkau menyukai mereka mempunyai kekayaan duniawi, dan kamu memiliki akhirat?",
        "arabic_text": "وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَمُحَمَّدُ بْنُ أَبِي عُمَرَ، وَتَقَارَبَا فِي لَفْظِ الْحَدِيثِ، قَالَ ابْنُ أَبِي عُمَرَ: حَدَّثَنَا، وقَالَ إِسْحَاقُ: أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ بْنِ أَبِي ثَوْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: لَمْ أَزَلْ حَرِيصًا أَنْ أَسْأَلَ عُمَرَ عَنِ الْمَرْأَتَيْنِ مِنْ أَزْوَاجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ اللَّتَيْنِ قَالَ اللهُ تَعَالَى: {إِنْ تَتُوبَا إِلَى اللهِ فَقَدْ صَغَتْ قُلُوبُكُمَا} [التحريم: 4]؟ حَتَّى حَجَّ عُمَرُ وَحَجَجْتُ مَعَهُ، فَلَمَّا كُنَّا بِبَعْضِ الطَّرِيقِ، عَدَلَ عُمَرُ، وَعَدَلْتُ مَعَهُ بِالْإِدَاوَةِ، فَتَبَرَّزَ، ثُمَّ أَتَانِي، فَسَكَبْتُ عَلَى يَدَيْهِ، فَتَوَضَّأَ، فَقُلْتُ: يَا أَمِيرَ الْمُؤْمِنِينَ، مَنِ الْمَرْأَتَانِ مِنْ أَزْوَاجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ اللَّتَانِ قَالَ اللهُ عَزَّ وَجَلَّ لَهُمَا: {إِنْ تَتُوبَا إِلَى اللهِ فَقَدْ صَغَتْ قُلُوبُكُمَا} [التحريم: 4]؟ قَالَ عُمَرُ: وَاعَجَبًا لَكَ يَا ابْنَ عَبَّاسٍ - قَالَ الزُّهْرِيُّ: كَرِهَ وَاللهِ مَا سَأَلَهُ عَنْهُ، وَلَمْ يَكْتُمْهُ - قَالَ: «هِيَ حَفْصَةُ وَعَائِشَةُ»، ثُمَّ أَخَذَ يَسُوقُ الْحَدِيثَ، قَالَ: كُنَّا مَعْشَرَ قُرَيْشٍ قَوْمًا نَغْلِبُ النِّسَاءَ، فَلَمَّا قَدِمْنَا الْمَدِينَةَ، وَجَدْنَا قَوْمًا تَغْلِبُهُمْ نِسَاؤُهُمْ، فَطَفِقَ نِسَاؤُنَا يَتَعَلَّمْنَ مِنْ نِسَائِهِمْ، قَالَ: وَكَانَ مَنْزِلِي فِي بَنِي أُمَيَّةَ بْنِ زَيْدٍ بِالْعَوَالِي، فَتَغَضَّبْتُ يَوْمًا عَلَى امْرَأَتِي، فَإِذَا هِيَ تُرَاجِعُنِي، فَأَنْكَرْتُ أَنْ تُرَاجِعَنِي، فَقَالَتْ: مَا تُنْكِرُ أَنْ أُرَاجِعَكَ، فَوَاللهِ إِنَّ أَزْوَاجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَيُرَاجِعْنَهُ، وَتَهْجُرُهُ إِحْدَاهُنَّ الْيَوْمَ إِلَى اللَّيْلِ، فَانْطَلَقْتُ فَدَخَلْتُ عَلَى حَفْصَةَ، فَقُلْتُ: أَتُرَاجِعِينَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ فَقَالَتْ: نَعَمْ، فَقُلْتُ: أَتَهْجُرُهُ إِحْدَاكُنَّ الْيَوْمَ إِلَى اللَّيْلِ؟ قَالَتْ: نَعَمْ، قُلْتُ: قَدْ خَابَ مَنْ فَعَلَ ذَلِكَ مِنْكُنَّ، وَخَسِرَ، أَفَتَأْمَنُ إِحْدَاكُنَّ أَنْ يَغْضَبَ اللهُ عَلَيْهَا لِغَضَبِ رَسُولِهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ فَإِذَا هِيَ قَدْ هَلَكَتْ، لَا تُرَاجِعِي رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَلَا تَسْأَلِيهِ شَيْئًا، وَسَلِينِي مَا بَدَا لَكِ، وَلَا يَغُرَّنَّكِ أَنْ كَانَتْ جَارَتُكِ هِيَ أَوْسَمَ وَأَحَبَّ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْكِ - يُرِيدُ عَائِشَةَ [ص:1112] قَالَ: وَكَانَ لِي جَارٌ مِنَ الْأَنْصَارِ، فَكُنَّا نَتَنَاوَبُ النُّزُولَ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَيَنْزِلُ يَوْمًا وَأَنْزِلُ يَوْمًا، فَيَأْتِينِي بِخَبَرِ الْوَحْيِ وَغَيْرِهِ، وَآتِيهِ بِمِثْلِ ذَلِكَ. وَكُنَّا نَتَحَدَّثُ أَنَّ غَسَّانَ تُنْعِلُ الْخَيْلَ لِتَغْزُوَنَا، فَنَزَلَ صَاحِبِي، ثُمَّ أَتَانِي عِشَاءً، فَضَرَبَ بَابِي، ثُمَّ نَادَانِي، فَخَرَجْتُ إِلَيْهِ، فَقَالَ: حَدَثَ أَمْرٌ عَظِيمٌ، قُلْتُ: مَاذَا؟ أَجَاءَتْ غَسَّانُ؟ قَالَ: لَا، بَلْ أَعْظَمُ مِنْ ذَلِكَ وَأَطْوَلُ، طَلَّقَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نِسَاءَهُ، فَقُلْتُ: قَدْ خَابَتْ حَفْصَةُ وَخَسِرَتْ، قَدْ كُنْتُ أَظُنُّ هَذَا كَائِنًا، حَتَّى إِذَا صَلَّيْتُ الصُّبْحَ شَدَدْتُ عَلَيَّ ثِيَابِي، ثُمَّ نَزَلْتُ فَدَخَلْتُ عَلَى حَفْصَةَ وَهِيَ تَبْكِي، فَقُلْتُ: أَطَلَّقَكُنَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ فَقَالَتْ: لَا أَدْرِي، هَا هُوَ ذَا مُعْتَزِلٌ فِي هَذِهِ الْمَشْرُبَةِ، فَأَتَيْتُ غُلَامًا لَهُ أَسْوَدَ، فَقُلْتُ اسْتَأْذِنْ لِعُمَرَ، فَدَخَلَ ثُمَّ خَرَجَ إِلَيَّ، فَقَالَ: قَدْ ذَكَرْتُكَ لَهُ، فَصَمَتَ، فَانْطَلَقْتُ حَتَّى انْتَهَيْتُ إِلَى الْمِنْبَرِ فَجَلَسْتُ، فَإِذَا عِنْدَهُ رَهْطٌ جُلُوسٌ يَبْكِي بَعْضُهُمْ، فَجَلَسْتُ قَلِيلًا ثُمَّ غَلَبَنِي مَا أَجِدُ، ثُمَّ أَتَيْتُ الْغُلَامَ، فَقُلْتُ: اسْتَأْذِنْ لِعُمَرَ، فَدَخَلَ ثُمَّ خَرَجَ إِلَيَّ، فَقَالَ: قَدْ ذَكَرْتُكَ لَهُ، فَصَمَتَ، فَوَلَّيْتُ مُدْبِرًا، فَإِذَا الْغُلَامُ يَدْعُونِي، فَقَالَ: ادْخُلْ فَقَدْ أَذِنَ لَكَ، فَدَخَلْتُ، فَسَلَّمْتُ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَإِذَا هُوَ مُتَّكِئٌ عَلَى رَمْلِ حَصِيرٍ، قَدْ أَثَّرَ فِي جَنْبِهِ، فَقُلْتُ: أَطَلَّقْتَ يَا رَسُولَ اللهِ نِسَاءَكَ؟ فَرَفَعَ رَأْسَهُ إِلَيَّ، وَقَالَ: «لَا»، فَقُلْتُ: اللهُ أَكْبَرُ، لَوْ رَأَيْتَنَا يَا رَسُولَ اللهِ وَكُنَّا مَعْشَرَ قُرَيْشٍ قَوْمًا نَغْلِبُ النِّسَاءَ، فَلَمَّا قَدِمْنَا الْمَدِينَةَ وَجَدْنَا قَوْمًا تَغْلِبُهُمْ نِسَاؤُهُمْ، فَطَفِقَ نِسَاؤُنَا يَتَعَلَّمْنَ مِنْ نِسَائِهِمْ، فَتَغَضَّبْتُ عَلَى امْرَأَتِي يَوْمًا، فَإِذَا هِيَ تُرَاجِعُنِي، فَأَنْكَرْتُ أَنْ تُرَاجِعَنِي، فَقَالَتْ: مَا تُنْكِرُ أَنْ أُرَاجِعَكَ، فَوَاللهِ، إِنَّ أَزْوَاجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَيُرَاجِعْنَهُ، وَتَهْجُرُهُ إِحْدَاهُنَّ الْيَوْمَ إِلَى اللَّيْلِ، فَقُلْتُ: قَدْ خَابَ مَنْ فَعَلَ ذَلِكِ مِنْهُنَّ وَخَسِرَ، أَفَتَأْمَنُ إِحْدَاهُنَّ أَنْ يَغْضَبَ اللهُ عَلَيْهَا لِغَضَبِ رَسُولِهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ فَإِذَا هِيَ قَدْ هَلَكَتْ، فَتَبَسَّمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقُلْتُ: يَا رَسُولَ اللهِ، قَدْ دَخَلْتُ عَلَى حَفْصَةَ، فَقُلْتُ: لَا يَغُرَّنَّكِ أَنْ كَانَتْ جَارَتُكِ هِيَ أَوْسَمُ مِنْكِ، وَأَحَبُّ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْكِ، فَتَبَسَّمَ أُخْرَى، فَقُلْتُ: أَسْتَأْنِسُ يَا رَسُولَ اللهِ، قَالَ: «نَعَمْ»، فَجَلَسْتُ فَرَفَعْتُ رَأْسِي فِي الْبَيْتِ، فَوَاللهِ، مَا رَأَيْتُ فِيهِ شَيْئًا يَرُدُّ الْبَصَرَ، إِلَّا أَهَبًا ثَلَاثَةً، فَقُلْتُ: ادْعُ اللهَ يَا رَسُولَ اللهِ أَنْ يُوَسِّعَ عَلَى أُمَّتِكَ، فَقَدْ وَسَّعَ عَلَى فَارِسَ وَالرُّومِ، وَهُمْ لَا يَعْبُدُونَ اللهَ، فَاسْتَوَى جَالِسًا، ثُمَّ قَالَ: «أَفِي شَكٍّ أَنْتَ يَا ابْنَ الْخَطَّابِ، أُولَئِكَ قَوْمٌ عُجِّلَتْ لَهُمْ طَيِّبَاتُهُمْ فِي الْحَيَاةِ الدُّنْيَا»، فَقُلْتُ: اسْتَغْفِرْ لِي يَا رَسُولَ اللهِ، وَكَانَ أَقْسَمَ أَنْ لَا يَدْخُلَ عَلَيْهِنَّ شَهْرًا مِنْ شِدَّةِ مَوْجِدَتِهِ عَلَيْهِنَّ، حَتَّى عَاتَبَهُ اللهُ عَزَّ وَجَلَّ."
      },
      {
        "id": 11260,
        "hadith_number": "3696",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perbincangan Rasulullah SAW Mengenai Perkahwinan dan Nasihat Kepada Seorang Wanita",
        "perawi_melayu": "Zuhri berkata: 'Urwa memberitahu aku bahawa 'Aishah رضي الله عنها berkata:",
        "english_text": "When twenty-nine nights were over, Allah's Messenger (ﷺ) visited me, and he began (his visit) with me. I said: Messenger of Allah, you had taken an oath that you would not visit us for a month, while you have visited after I have counted only twenty-nine (nights). Thereupon he said: The month may also be of twenty-nine (days). He then said: 'A'isha رضی اللہ عنہا , I am going to talk to you about a matter, and you should not be hasty in it (and do not give your final decision) until you have consulted your parents. He then recited this verse to me:\" O Prophet, say to your wives\" till he reached\" mighty reward\" (xxxiii. 28). 'A'isha (رضی اللہ عنہا) said: By Allah, he knew that my parents would not allow me to separate from him. I said: Is there any need to consult my parents in this matter? I in fact choose Allah and His Messenger (ﷺ) and the abode in the Hereafter. Ma'mar said: Ayyub reported to me that 'A'isha رضی اللہ عنہا said: Don't inform your wives that I have chosen you, whereupon Allah's Apostle (ﷺ) said: Verily Allah has sent me as a conveyer of message, and He has not sent me as a source of hardship (to others). Qatada said:\" Saghat qulubukum\" means\" Your hearts have inclined.\"",
        "malay_translation": "Apabila dua puluh sembilan malam berlalu, Rasulullah SAW melawat aku, dan baginda memulakan lawatan itu dengan aku. Aku berkata: Wahai Rasulullah, engkau telah bersumpah tidak akan melawat kami selama sebulan, sedangkan baginda telah melawat setelah aku kira hanya dua puluh sembilan malam. Lalu baginda berkata: Bulan juga boleh terdiri daripada dua puluh sembilan hari. Kemudian baginda berkata: 'Aishah رضي الله عنها, aku hendak membincangkan suatu perkara denganmu, dan janganlah engkau tergesa-gesa (dan jangan membuat keputusan akhir) sehingga engkau berunding dengan ibu bapamu. Kemudian baginda membacakan ayat ini kepadaku: \"Wahai Nabi, katakanlah kepada isteri-isterimu\" sehingga sampai kepada \"pahala yang besar\" (al-Ahzab 33:28). 'Aishah (رضي الله عنها) berkata: Demi Allah, baginda tahu bahawa ibu bapaku tidak akan membenarkan aku berpisah darinya. Aku berkata: Adakah perlu berunding dengan ibu bapaku dalam perkara ini? Aku memilih Allah dan Rasul-Nya serta kehidupan akhirat. Ma'mar berkata: Ayyub melaporkan kepadaku bahawa 'Aishah رضي الله عنها berkata: Janganlah engkau memberitahu isteri-isterimu bahawa aku telah memilihmu, lalu Rasulullah SAW bersabda: Sesungguhnya Allah telah mengutusku sebagai penyampai risalah, dan Dia tidak mengutusku sebagai sumber kesusahan (kepada orang lain). Qatada berkata: \"Saghat qulubukum\" bermaksud \"Hati-hatimu telah condong.\"",
        "arabic_text": "قَالَ الزُّهْرِيُّ: فَأَخْبَرَنِي عُرْوَةُ، عَنْ عَائِشَةَ، قَالَتْ: لَمَّا مَضَى تِسْعٌ وَعِشْرُونَ لَيْلَةً دَخَلَ عَلَيَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، بَدَأَ بِي، فَقُلْتُ: يَا رَسُولَ اللهِ، إِنَّكَ أَقْسَمْتَ أَنْ لَا تَدْخُلَ عَلَيْنَا شَهْرًا، وَإِنَّكَ دَخَلْتَ مِنْ تِسْعٍ وَعِشْرِينَ أَعُدُّهُنَّ، فَقَالَ: «إِنَّ الشَّهْرَ تِسْعٌ وَعِشْرُونَ»، ثُمَّ قَالَ: «يَا عَائِشَةُ، إِنِّي ذَاكِرٌ لَكِ أَمْرًا، فَلَا عَلَيْكِ أَنْ لَا تَعْجَلِي فِيهِ حَتَّى تَسْتَأْمِرِي أَبَوَيْكِ»، ثُمَّ قَرَأَ عَلَيَّ الْآيَةَ {يَا أَيُّهَا النَّبِيُّ قُلْ لِأَزْوَاجِكَ} [الأحزاب: 28] حَتَّى بَلَغَ {أَجْرًا عَظِيمًا} [النساء: 40]، قَالَتْ عَائِشَةُ: قَدْ عَلِمَ وَاللهِ أَنَّ أَبَوَيَّ لَمْ يَكُونَا لِيَأْمُرَانِي بِفِرَاقِهِ، قَالَتْ: فَقُلْتُ: أَوَفِي هَذَا أَسْتَأْمِرُ أَبَوَيَّ؟ فَإِنِّي أُرِيدُ اللهَ وَرَسُولَهُ وَالدَّارَ الْآخِرَةَ، قَالَ مَعْمَرٌ، فَأَخْبَرَنِي أَيُّوبُ، أَنَّ عَائِشَةَ، قَالَتْ: لَا تُخْبِرْ نِسَاءَكَ أَنِّي اخْتَرْتُكَ، فَقَالَ لَهَا النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللهَ أَرْسَلَنِي مُبَلِّغًا، وَلَمْ يُرْسِلْنِي مُتَعَنِّتًا»، قَالَ قَتَادَةُ: «صَغَتْ قُلُوبُكُمَا، مَالَتْ قُلُوبُكُمَا."
      },
      {
        "id": 11261,
        "hadith_number": "3697",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perceraian dan Perkahwinan, serta Nasihat Rasulullah SAW",
        "perawi_melayu": "Fatimah binti Qais رضي الله عنها melaporkan:",
        "english_text": "Abu 'Amr bin Hafs رضی اللہ عنہ divorced her absolutely when he was away from home, and he sent his agent to her with some barley. She was displeased with him and when he said: I swear by Allah that you have no claim on us. she went to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and mentioned that to him. He said: There is no maintenance due to you from him, and he commanded her to spend the 'Idda in the house of Umm Sharik رضی اللہ عنہا , but then said: That is a woman whom my companions visit. So better spend this period in the house of Ibn Umm Maktum رضي الله عنه , for he is a blind man and yon can put off your garments. And when the 'Idda is over, inform me. She said: When my period of 'Idda was over, I mentioned to him that Mu'awiya bin Abu Sufyan and Jahm had sent proposal of marriage to me, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: As for Abu Jahm رضي الله عنه , he does not put down his staff from his shoulder, and as for Mu'awiya, he is a poor man having no property; marry Usama bin Zaid رضي الله عنه . I objected to him, but he again said: Marry Usama; so I married him. Allah blessed there in and I was envied (by others).",
        "malay_translation": "Abu 'Amr bin Hafs رضي الله عنه telah menceraikan isterinya dengan talak bain tanpa syarat semasa beliau jauh dari rumah, dan menghantar wakilnya dengan sedikit barli. Isterinya tidak berpuas hati dengannya dan apabila wakilnya berkata: Aku bersumpah dengan Allah bahawa engkau tidak mempunyai hak ke atas kami. Dia pergi menemui Rasulullah SAW dan menceritakan hal itu kepadanya. Baginda bersabda: Tiada nafkah yang wajib bagimu darinya, dan Baginda memerintahkannya untuk menghabiskan tempoh 'iddah di rumah Umm Sharik رضي الله عنها, tetapi kemudian bersabda: Dia seorang wanita yang para sahabatku melawatnya. Oleh itu, lebih baik engkau menghabiskan tempoh ini di rumah Ibn Umm Maktum رضي الله عنه, kerana dia buta dan engkau boleh melepaskan pakaianmu. Dan apabila tempoh 'iddah berakhir, beritahukan kepadaku. Dia berkata: Setelah tempoh 'iddahku tamat, aku menceritakan kepadanya bahawa Mu'awiyah bin Abi Sufyan dan Jahm telah melamar aku, lalu Rasulullah SAW bersabda: Adapun Abu Jahm رضي الله عنه, dia tidak melepaskan tongkatnya dari bahunya, dan adapun Mu'awiyah, dia seorang lelaki miskin tanpa harta; kahwinlah dengan Usamah bin Zaid رضي الله عنه. Aku keberatan, tetapi Baginda lagi bersabda: Kahwinlah dengan Usamah, maka aku berkahwin dengannya. Allah memberkati perkahwinan itu dan aku dikasihani (oleh orang lain).",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ عَبْدِ اللهِ بْنِ يَزِيدَ مَوْلَى الْأَسْوَدِ بْنِ سُفْيَانَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ، أَنَّ أَبَا عَمْرِو بْنَ حَفْصٍ طَلَّقَهَا الْبَتَّةَ، وَهُوَ غَائِبٌ، فَأَرْسَلَ إِلَيْهَا وَكِيلُهُ بِشَعِيرٍ، فَسَخِطَتْهُ، فَقَالَ: وَاللهِ مَا لَكِ عَلَيْنَا مِنْ شَيْءٍ، فَجَاءَتْ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَذَكَرَتْ ذَلِكَ لَهُ، فَقَالَ: «لَيْسَ لَكِ عَلَيْهِ نَفَقَةٌ»، فَأَمَرَهَا أَنْ تَعْتَدَّ فِي بَيْتِ أُمِّ شَرِيكٍ، ثُمَّ قَالَ: «تِلْكِ امْرَأَةٌ يَغْشَاهَا أَصْحَابِي، اعْتَدِّي عِنْدَ ابْنِ أُمِّ مَكْتُومٍ، فَإِنَّهُ رَجُلٌ أَعْمَى تَضَعِينَ ثِيَابَكِ، فَإِذَا حَلَلْتِ فَآذِنِينِي»، قَالَتْ: فَلَمَّا حَلَلْتُ ذَكَرْتُ لَهُ أَنَّ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ، وَأَبَا جَهْمٍ خَطَبَانِي، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَمَّا أَبُو جَهْمٍ، فَلَا يَضَعُ عَصَاهُ عَنْ عَاتِقِهِ، وَأَمَّا مُعَاوِيَةُ فَصُعْلُوكٌ لَا مَالَ لَهُ، انْكِحِي أُسَامَةَ بْنَ زَيْدٍ» فَكَرِهْتُهُ، ثُمَّ قَالَ: «انْكِحِي أُسَامَةَ»، فَنَكَحْتُهُ، فَجَعَلَ اللهُ فِيهِ خَيْرًا، وَاغْتَبَطْتُ بِهِ."
      },
      {
        "id": 11262,
        "hadith_number": "3698",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perceraian dan Tuntutan Nafkah Istri",
        "perawi_melayu": "Fatima binti Qais رضي الله عنها meriwayatkan:",
        "english_text": "Her husband divorced her during the life time of Allah's Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and gave her a meagre maintenance allowance. When she saw that, she said: By Allah, I will inform Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and if maintenance allowance is due to me then I will accept that which will suffice me, and if it is not due to me, I will not accept anything from him. She said: I made a mention of that to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he said: There is neither maintenance allowance for you nor lodging.",
        "malay_translation": "Suaminya menceraikannya semasa hayat Rasulullah SAW dan memberikan nafkah yang sedikit. Melihat hal itu, dia berkata: Demi Allah, aku akan memberitahu Rasulullah SAW, dan jika nafkah itu hakku, aku akan menerimanya secukupnya. Jika tidak, aku tidak akan menerima apa-apa darinya. Dia berkata: Aku telah melaporkannya kepada Rasulullah SAW, dan baginda bersabda: Tidak ada nafkah untukmu dan juga tempat tinggal.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ عِمْرَانَ بْنِ أَبِي أَنَسٍ، عَنْ أَبِي سَلَمَةَ، أَنَّهُ قَالَ: سَأَلْتُ فَاطِمَةَ بِنْتَ قَيْسٍ، فَأَخْبَرَتْنِي أَنَّ زَوْجَهَا الْمَخْزُومِيَّ طَلَّقَهَا، فَأَبَى أَنْ يُنْفِقَ عَلَيْهَا، فَجَاءَتْ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَخْبَرَتْهُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا نَفَقَةَ لَكِ، فَانْتَقِلِي فَاذْهَبِي إِلَى ابْنِ أُمِّ مَكْتُومٍ، فَكُونِي عِنْدَهُ، فَإِنَّهُ رَجُلٌ أَعْمَى تَضَعِينَ ثِيَابَكِ عِنْدَهُ."
      },
      {
        "id": 11263,
        "hadith_number": "3699",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perceraian dan Kehidupan Wanita yang Dikurangkan Nafkahnya",
        "perawi_melayu": "Fatimah binti Qais رضي الله عنها melaporkan:",
        "english_text": "Her husband al-Makhzulmi divorced her and refused to pay her maintenance allowance. So she came to Allah's Messenger (ﷺ) and informed him, whereupon he said: There is no maintenance allowance for you, and you better go to the house of Ibn Umm Maktum رضی اللہ عنہ and live with him for he is a blind man and you can put off your clothes in his house (i.e. you shall not face much difficulty in observing purdah there).",
        "malay_translation": "Suaminya, al-Makhzulmi, menceraikannya dan enggan membayar nafkahnya. Lalu, dia datang kepada Rasulullah SAW dan memberitahu hal tersebut, lantas baginda bersabda: Tidak ada nafkah untukmu. Lebih baik engkau pergi ke rumah Ibn Umm Maktum رضي الله عنه dan tinggal bersamanya. Dia buta, dan engkau dapat menanggalkan pakaianmu di rumahnya (iaitu, engkau tidak akan menghadapi kesulitan dalam mengamalkan purdah di sana).",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ عِمْرَانَ بْنِ أَبِي أَنَسٍ، عَنْ أَبِي سَلَمَةَ، أَنَّهُ قَالَ: سَأَلْتُ فَاطِمَةَ بِنْتَ قَيْسٍ، فَأَخْبَرَتْنِي أَنَّ زَوْجَهَا الْمَخْزُومِيَّ طَلَّقَهَا، فَأَبَى أَنْ يُنْفِقَ عَلَيْهَا، فَجَاءَتْ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَخْبَرَتْهُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا نَفَقَةَ لَكِ، فَانْتَقِلِي فَاذْهَبِي إِلَى ابْنِ أُمِّ مَكْتُومٍ، فَكُونِي عِنْدَهُ، فَإِنَّهُ رَجُلٌ أَعْمَى تَضَعِينَ ثِيَابَكِ عِنْدَهُ."
      },
      {
        "id": 11264,
        "hadith_number": "3700",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ketetapan Hukum Nafkah dan Perceraian dalam Islam",
        "perawi_melayu": "Abu Salama meriwayatkan:",
        "english_text": "Fatima bint Qais رضی اللہ عنہ , the sister of al-Dahhak bint Qais رضی اللہ عنہا informed him that Abu Hafs bin Mughira al-Makhzumi divorced her three times and then he proceeded on to the Yemen. The members of his family said to her: There is no maintenance allowance due to you from us. Khalid bin Walid رضی اللہ عنہ along with a group of persons visited Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in the house of Maimuna رضی اللہ عنہا  and they said: Abu Hafs has divorced his wife with three pronouncements; is there any maintenance allowance due to her? Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: No maintenance allowance is due to her, but she is required to spend the 'Idda; and he sent her the message that she should not be hasty in making a decision about herself and commanded her to move to the house of Umm Sharik  رضی اللہ عنہا , and then sent her the message that as the first immigrants (frequently) visit the house of Umm Sharik رضی اللہ عنہا , she should better go to the house of Ibn Umm Maktum, the blind, (and further said: In case you put off your head-dress, he (Ibn Umm Makhtum) will not see you. So she went to his house, and when the 'Idda was over, Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) married her to Usama bin Zaid bin Haritha  رضی اللہ عنہا .",
        "malay_translation": "Fatimah binti Qais رضي الله عنها, adik perempuan kepada al-Dahhak binti Qais رضي الله عنها, memberitahunya bahawa Abu Hafs bin Mughirah al-Makhzumi telah menceraikannya tiga kali dan kemudiannya pergi ke Yaman. Anggota keluarganya memberitahunya: Tiada nafkah yang terhutang kepadamu daripada kami. Khalid bin al-Walid رضي الله عنه bersama sekumpulan orang mengunjungi Rasulullah SAW di rumah Maimunah رضي الله عنها dan mereka bertanya: Abu Hafs telah menceraikan isterinya tiga kali; adakah nafkah yang terhutang kepadanya? Lalu Rasulullah SAW menjawab: Tiada nafkah yang terhutang kepadanya, tetapi dia perlu menjalani tempoh 'iddah; dan baginda mengutuskan pesannya agar dia tidak tergesa-gesa membuat keputusan mengenai dirinya sendiri dan memerintahkannya untuk berpindah ke rumah Umm Syarik رضي الله عنها, dan kemudian mengutuskan pesannya agar, kerana pendatang pertama (kerap) mengunjungi rumah Umm Syarik رضي الله عنها, lebih baik dia pergi ke rumah Ibn Umm Maktum, orang buta itu. (Dan selanjutnya baginda berkata: Sekiranya anda menanggalkan penutup kepala anda, dia (Ibn Umm Makhtum) tidak akan melihat anda.) Maka dia pergi ke rumahnya, dan setelah tempoh 'iddah berakhir, Rasulullah SAW menikahkannya dengan Usamah bin Zaid bin Harithah رضي الله عنه.",
        "arabic_text": "وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى وَهُوَ ابْنُ أَبِي كَثِيرٍ، أَخْبَرَنِي أَبُو سَلَمَةَ، أَنَّ فَاطِمَةَ بِنْتَ قَيْسٍ، أُخْتَ الضَّحَّاكِ بْنِ قَيْسٍ، أَخْبَرَتْهُ، أَنَّ أَبَا حَفْصِ بْنَ الْمُغِيرَةِ الْمَخْزُومِيَّ، طَلَّقَهَا ثَلَاثًا، ثُمَّ انْطَلَقَ إِلَى الْيَمَنِ، فَقَالَ لَهَا أَهْلُهُ: لَيْسَ لَكِ عَلَيْنَا نَفَقَةٌ، فَانْطَلَقَ خَالِدُ بْنُ الْوَلِيدِ فِي نَفَرٍ، فَأَتَوْا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِ مَيْمُونَةَ، فَقَالُوا: إِنَّ أَبَا حَفْصٍ طَلَّقَ امْرَأَتَهُ ثَلَاثًا، فَهَلْ لَهَا مِنْ نَفَقَةٍ؟ فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَتْ لَهَا نَفَقَةٌ، وَعَلَيْهَا الْعِدَّةُ»، وَأَرْسَلَ إِلَيْهَا أَنْ لَا تَسْبِقِينِي بِنَفْسِكِ، وَأَمَرَهَا أَنْ تَنْتَقِلَ إِلَى أُمِّ شَرِيكٍ، ثُمَّ أَرْسَلَ إِلَيْهَا: «أَنَّ أُمَّ شَرِيكٍ يَأْتِيهَا الْمُهَاجِرُونَ الْأَوَّلُونَ، فَانْطَلِقِي إِلَى ابْنِ أُمِّ مَكْتُومٍ الْأَعْمَى، فَإِنَّكِ إِذَا وَضَعْتِ خِمَارَكِ لَمْ يَرَكِ»، فَانْطَلَقَتْ إِلَيْهِ، فَلَمَّا مَضَتْ عِدَّتُهَا أَنْكَحَهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أُسَامَةَ بْنَ زَيْدِ بْنِ حَارِثَةَ."
      },
      {
        "id": 11265,
        "hadith_number": "3701",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Permintaan Nafkah Selepas Talaq Bain",
        "perawi_melayu": "Fatima binti Qais رضي الله عنها melaporkan:",
        "english_text": "I had been married to a person from Banu Makhzum and he divorced me with irrevocable divorce. I sent a message to his family asking for maintenance allowance, and the rest of the hadith has been transmitted with a slight change of words.",
        "malay_translation": "Saya pernah berkahwin dengan seorang lelaki daripada Bani Makhzum dan dia menceraikan saya dengan talak bain. Saya menghantar mesej kepada keluarganya untuk meminta nafkah, dan selebihnya hadis ini telah disampaikan dengan sedikit perubahan kata-kata.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَابْنُ حُجْرٍ، قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ يَعْنُونَ ابْنَ جَعْفَرٍ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ، ح وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو، حَدَّثَنَا أَبُو سَلَمَةَ، عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ، قَالَ: كَتَبْتُ ذَلِكَ مِنْ فِيهَا كِتَابًا، قَالَتْ: كُنْتُ عِنْدَ رَجُلٍ مِنْ بَنِي مَخْزُومٍ، فَطَلَّقَنِي الْبَتَّةَ، فَأَرْسَلْتُ إِلَى أَهْلِهِ أَبْتَغِي النَّفَقَةَ، وَاقْتَصُّوا الْحَدِيثَ بِمَعْنَى حَدِيثِ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، غَيْرَ أَنَّ فِي حَدِيثِ مُحَمَّدِ بْنِ عَمْرٍو: «لَا تَفُوتِينَا بِنَفْسِكِ."
      },
      {
        "id": 11266,
        "hadith_number": "3702",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perintah Nabi SAW Mengenai Perceraian dan Pindah Rumah",
        "perawi_melayu": "Fatimah binti Qais رضي الله عنها meriwayatkan:",
        "english_text": "She had been married to Abu 'Amr bin Hafs bin al-Mughira رضی اللہ عنہ and he divorced her with three pronouncements. She stated that she went to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) asking him about abandoning that house. He commanded her to move to the house of Ibn Umm Maktum رضی اللہ عنہ , the blind. Marwan refused to testify the divorced woman abandoning her house (before the 'Idda was over). 'Urwa said that 'A'isha رضی اللہ عنہا objected to (the words of) Fatima bint Qais رضی اللہ عنہا .",
        "malay_translation": "Beliau telah berkahwin dengan Abu 'Amr bin Hafs bin al-Mughira رضي الله عنه dan dia menceraikannya sebanyak tiga kali. Beliau memohon kepada Rasulullah SAW tentang meninggalkan rumah itu. Baginda memerintahkannya berpindah ke rumah Ibn Umm Maktum رضي الله عنه, yang buta. Marwan enggan memberikan keterangan bahawa wanita yang diceraikan itu telah meninggalkan rumahnya (sebelum tempoh 'iddah berakhir). 'Urwa berkata bahawa 'Aisha رضي الله عنها tidak bersetuju dengan perkataan Fatimah binti Qais رضي الله عنها.",
        "arabic_text": "حَدَّثَنَا حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، جَمِيعًا عَنْ يَعْقُوبَ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِح، عَنِ ابْنِ شِهَابٍ، أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَخْبَرَهُ، أَنَّ فَاطِمَةَ بِنْتَ قَيْسٍ، أَخْبَرَتْهُ أَنَّهَا كَانَتْ تَحْتَ أَبِي عَمْرِو بْنِ حَفْصِ بْنِ الْمُغِيرَةِ، فَطَلَّقَهَا آخِرَ ثَلَاثِ تَطْلِيقَاتٍ، فَزَعَمَتْ أَنَّهَا جَاءَتْ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ تَسْتَفْتِيهِ فِي خُرُوجِهَا مِنْ بَيْتِهَا، «فَأَمَرَهَا أَنْ تَنْتَقِلَ إِلَى ابْنِ أُمِّ مَكْتُومٍ الْأَعْمَى»، «فَأَبَى مَرْوَانُ أَنْ يُصَدِّقَهُ فِي خُرُوجِ الْمُطَلَّقَةِ مِنْ بَيْتِهَا»، وقَالَ عُرْوَةُ: إِنَّ عَائِشَةَ أَنْكَرَتْ ذَلِكَ عَلَى فَاطِمَةَ بِنْتِ قَيْسٍ."
      },
      {
        "id": 11267,
        "hadith_number": "3703",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Penolakan Umat Khadijah terhadap tindakan Fatimah binti Qais",
        "perawi_melayu": "Muhammad bin Rāfi' dari Hujaim dari Laith dari 'Uqaal dari Ibn Shihab",
        "english_text": "A similar report (as no. 3703) was narrated from Shihab with this chain, as well of the comment of Urwah about 'Aishah's رضی اللہ عنہا objection to Fatimah bint Qais رضی اللہ عنہا .",
        "malay_translation": "Hadis yang serupa (seperti nombor 3703) diriwayatkan dari Ibn Shihab dengan sanad ini, bersama-sama dengan kenyataan Urwah mengenai bantahan 'Aisyah رضي الله عنها terhadap Fatimah binti Qais رضي الله عنها.",
        "arabic_text": "وحَدَّثَنِيهِ مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا حُجَيْنٌ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، بِهَذَا الْإِسْنَادِ مِثْلَهُ، مَعَ قَوْلِ عُرْوَةَ: إِنَّ عَائِشَةَ أَنْكَرَتْ ذَلِكَ عَلَى فَاطِمَةَ."
      },
      {
        "id": 11268,
        "hadith_number": "3704",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Nafkah dan Perceraian dalam Islam: Kisah Seorang Wanita dan Rasulullah SAW",
        "perawi_melayu": "Ubaidillah bin Abdullah bin Utba meriwayatkan:",
        "english_text": "'Amr bin Hafs bin al-Mughira رضی اللہ عنہ set out along with 'Ali bin Abi Talib ( رضی اللہ عنہ) to the Yemen and sent to his wife the one pronouncement of divorce which was still left from the (irrevocable) divorce; and he commanded al-Harith bin Hisham and 'Ayyash bin Abu Rabi'a to give her maintenance allowance. They said to her: By Allah, there is no maintenance allowance for you, except in case you are pregnant. She came to Allah's Apostle (may peace he upon him) and mentioned their opinion to him, whereupon he said: There is no maintenance allowance for you. Then she sought permission to move (to another place), and he (the Holy Prophet) permitted her. She said: Allah's Messenger, where (should I go)? He said: To the house of Ibn Umm Maktum and, as he is blind, she could put off her garmeqts in his presence and he would not see her. And when her 'Idda was over. Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) married her to Usama bin Zaid رضی اللہ عنہ . Marwan (the governor of Medina) sent Qabisa bin Dhuwaib in order to ask her about this hadith, and she narrated it to him, whereupon Marwan said: We have not heard this hadith but from a woman. We would adopt a safe (path) where we found the people. Fatima رضی اللہ عنہا said that when these words of, Marwan were conveyed to her. There is between me and you the word of Allah, the Exalted and Majestic: Do not turn them out of their houses. She asserted: This is in regard to the revocable divorce what new (turn can the event take) after three pronouncements (separation between irrevocable). Why do you say there is no maintenance allowance for her if she is not pregnant? Then on what ground do you restrain her?",
        "malay_translation": "'Amr bin Hafs bin al-Mughira رضي الله عنه berangkat ke Yaman bersama 'Ali bin Abi Talib رضي الله عنه dan mengirimkan satu kali talak kepada istrinya yang masih tersisa dari talak tiga (talak bain). Beliau memerintahkan al-Harith bin Hisham dan 'Ayyash bin Abu Rabi'a untuk memberi nafkah kepada istrinya. Mereka berkata kepadanya, \"Demi Allah, tidak ada nafkah untukmu kecuali jika engkau sedang hamil.\"  Kemudian, ia menemui Rasulullah SAW dan menyampaikan pendapat mereka.  Rasulullah SAW bersabda, \"Tidak ada nafkah untukmu.\"  Lalu ia meminta izin untuk berpindah tempat, dan Rasulullah SAW mengizinkannya. Ia bertanya, \"Wahai Rasulullah, ke mana gerangan aku pergi?\"  Beliau menjawab, \"Ke rumah Ibn Umm Maktum. Karena dia buta, engkau dapat melepas pakaianmu di hadapannya tanpa ia melihatmu.\"  Setelah masa 'iddah-nya berakhir, Rasulullah SAW menikahkannya dengan Usamah bin Zaid رضي الله عنه. Marwan (gubernur Madinah) mengirimkan Qabisa bin Dhuwaib untuk menanyakan hadith ini kepadanya, dan ia menceritakannya. Marwan berkata, \"Kami hanya mendengar hadith ini dari seorang wanita. Kami akan mengambil jalan yang aman di mana kami mendapati orang-orangnya.\"  Fatimah رضي الله عنها berkata, \"Ketika perkataan Marwan disampaikan kepadanya. Antara aku dan engkau ada firman Allah Yang Maha Tinggi dan Maha Agung, \"Janganlah kamu usir mereka dari rumah-rumah mereka.\" Dia berkata, \"Ini mengenai talak raj'i, bagaimana bisa ada kejadian baru setelah tiga kali talak (talak bain)? Mengapa engkau mengatakan tidak ada nafkah untuknya jika dia tidak hamil? Lalu berdasarkan apa engkau menahannya?\".",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، وَاللَّفْظُ لِعَبْدٍ، قَالَا: أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ بْنِ عُتْبَةَ، أَنَّ أَبَا عَمْرِو بْنَ حَفْصِ بْنِ الْمُغِيرَةِ، خَرَجَ مَعَ عَلِيِّ بْنِ أَبِي طَالِبٍ إِلَى الْيَمَنِ، فَأَرْسَلَ إِلَى امْرَأَتِهِ فَاطِمَةَ بِنْتِ قَيْسٍ بِتَطْلِيقَةٍ كَانَتْ بَقِيَتْ مِنْ طَلَاقِهَا، وَأَمَرَ لَهَا الْحَارِثَ بْنَ هِشَامٍ، وَعَيَّاشَ بْنَ أَبِي رَبِيعَةَ بِنَفَقَةٍ، فَقَالَا لَهَا: وَاللهِ مَا لَكِ نَفَقَةٌ إِلَّا أَنْ تَكُونِي حَامِلًا، فَأَتَتِ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَذَكَرَتْ لَهُ قَوْلَهُمَا، فَقَالَ: «لَا نَفَقَةَ لَكِ»، فَاسْتَأْذَنَتْهُ فِي الِانْتِقَالِ، فَأَذِنَ لَهَا، فَقَالَتْ: أَيْنَ يَا رَسُولَ اللهِ؟ فَقَالَ: «إِلَى ابْنِ أُمِّ مَكْتُومٍ» وَكَانَ أَعْمَى، تَضَعُ ثِيَابَهَا عِنْدَهُ وَلَا يَرَاهَا، فَلَمَّا مَضَتْ عِدَّتُهَا أَنْكَحَهَا النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أُسَامَةَ بْنَ زَيْدٍ، فَأَرْسَلَ إِلَيْهَا مَرْوَانُ، قَبِيصَةَ بْنَ ذُؤَيْبٍ يَسْأَلُهَا عَنِ الْحَدِيثِ، فَحَدَّثَتْهُ بِهِ، فَقَالَ مَرْوَانُ: لَمْ نَسْمَعْ هَذَا الْحَدِيثَ إِلَّا مِنِ امْرَأَةٍ، سَنَأْخُذُ بِالْعِصْمَةِ الَّتِي وَجَدْنَا النَّاسَ عَلَيْهَا، فَقَالَتْ فَاطِمَةُ، حِينَ بَلَغَهَا قَوْلُ مَرْوَانَ: فَبَيْنِي وَبَيْنَكُمُ الْقُرْآنُ، قَالَ اللهُ عَزَّ وَجَلَّ: {لَا تُخْرِجُوهُنَّ مِنْ بُيُوتِهِنَّ} [الطلاق: 1] الْآيَةَ، قَالَتْ: هَذَا لِمَنْ كَانَتْ لَهُ مُرَاجَعَةٌ، فَأَيُّ أَمْرٍ يَحْدُثُ بَعْدَ الثَّلَاثِ؟ فَكَيْفَ تَقُولُونَ: لَا نَفَقَةَ لَهَا إِذَا لَمْ تَكُنْ حَامِلًا؟ فَعَلَامَ تَحْبِسُونَهَا."
      },
      {
        "id": 11269,
        "hadith_number": "3705",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkara Penginapan dan Penjagaan Semasa 'Iddah",
        "perawi_melayu": "Sha'bi meriwayatkan:",
        "english_text": "I visited Fatima bint Qais رضی اللہ عنہ and asked her about the verdict of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about (board and lodging during the 'Idda) and she said that her husband divorced her with an irrevocable divorce. She (further. said): I contended with him before Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about lodging and maintenance allowance, and she said: He did not provide me with any lodging or maintenance allowance, and he commanded me to spend the 'Idda in the house of Ibn Umm Maktum رضی اللہ عنہ .",
        "malay_translation": "Aku melawat Fatima binti Qais رضي الله عنها dan bertanya kepadanya tentang keputusan Rasulullah صلى الله عليه وسلم mengenai (penginapan dan nafkah semasa 'iddah). Dia berkata bahawa suaminya menceraikannya dengan talak bain. Dia (tambahan): Aku bertelagah dengannya di hadapan Rasulullah صلى الله عليه وسلم mengenai penginapan dan nafkah, dan dia berkata: Dia tidak menyediakan sebarang penginapan atau nafkah untukku, dan baginda memerintahkan aku untuk menghabiskan 'iddah di rumah Ibn Umm Maktum رضي الله عنه.",
        "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا سَيَّارٌ، وَحُصَيْنٌ، وَمُغِيرَةُ، وَأَشْعَثُ، وَمُجَالِدٌ، وَإِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، وَدَاوُدُ، كُلُّهُمْ عَنِ الشَّعْبِيِّ، قَالَ: دَخَلْتُ عَلَى فَاطِمَةَ بِنْتِ قَيْسٍ فَسَأَلْتُهَا عَنْ قَضَاءِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَيْهَا، فَقَالَتْ: طَلَّقَهَا زَوْجُهَا الْبَتَّةَ، فَقَالَتْ: فَخَاصَمْتُهُ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي السُّكْنَى وَالنَّفَقَةِ، قَالَتْ: «فَلَمْ يَجْعَلْ لِي سُكْنَى، وَلَا نَفَقَةً، وَأَمَرَنِي أَنْ أَعْتَدَّ فِي بَيْتِ ابْنِ أُمِّ مَكْتُومٍ»."
      },
      {
        "id": 11270,
        "hadith_number": "3706",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Pertemuan dengan Fatimah Binti Qais dan Persamaan dengan Hadis Zubair",
        "perawi_melayu": "Yahya bin Yahya",
        "english_text": "It was narrated from Ash-Shabi that he said: I entered upon Fatimah bint Qais...\" a hadith like that of Zubair from Hushaim.",
        "malay_translation": "Diceritakan oleh Ash-Shabi, katanya: Saya memasuki rumah Fatimah binti Qais... \" Hadis ini serupa dengan hadis Zubair daripada Hushaim.",
        "arabic_text": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ حُصَيْنٍ، وَدَاوُدَ، وَمُغِيرَةَ، وَإِسْمَاعِيلَ، وَأَشْعَثَ، عَنِ الشَّعْبِيِّ، أَنَّهُ قَالَ: دَخَلْتُ عَلَى فَاطِمَةَ بِنْتِ قَيْسٍ، بِمِثْلِ حَدِيثِ زُهَيْرٍ، عَنْ هُشَيْمٍ."
      },
      {
        "id": 11271,
        "hadith_number": "3707",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Panduan Tempoh Idah Wanita Cerai Tiga",
        "perawi_melayu": "Sha'bi melaporkan:",
        "english_text": "We visited Fatima bint Qais رضی اللہ عنہا and she served us fresh dates and a drink of barley flour, and I asked her: Where should a woman who has been divorced by three pronouncements, spend the period of her 'Idda. She said: My husband divorced me with three pronouncements, and Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) permitted me to spend my 'Idda period with my family (with my parents).",
        "malay_translation": "Kami melawat Fatimah binti Qais رضي الله عنها dan beliau menjamu kami kurma segar dan minuman tepung barli. Lalu aku bertanya kepadanya, \"Di manakah seorang wanita yang diceraikan tiga kali perlu menghabiskan tempoh idahnya?\" Beliau menjawab, \"Suami saya menceraikan saya sebanyak tiga kali, dan Rasulullah SAW membenarkan saya menghabiskan tempoh idah saya bersama keluarga saya (bersama ibu bapa saya).\"",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ الْهُجَيْمِيُّ، حَدَّثَنَا قُرَّةُ، حَدَّثَنَا سَيَّارٌ أَبُو الْحَكَمِ، حَدَّثَنَا الشَّعْبِيُّ، قَالَ: دَخَلْنَا عَلَى فَاطِمَةَ بِنْتِ قَيْسٍ، فَأَتْحَفَتْنَا بِرُطَبِ ابْنِ طَابٍ، وَسَقَتْنَا سَوِيقَ سُلْتٍ، فَسَأَلْتُهَا عَنِ الْمُطَلَّقَةِ ثَلَاثًا، أَيْنَ تَعْتَدُّ؟ قَالَتْ: «طَلَّقَنِي بَعْلِي ثَلَاثًا، فَأَذِنَ لِي النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ أَعْتَدَّ فِي أَهْلِي."
      },
      {
        "id": 11272,
        "hadith_number": "3708",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Tidak Ada Tuntutan Tempat Tinggal dan Nafkah untuk Wanita yang Diceraikan Secara Mutlak",
        "perawi_melayu": "Daripada Ash-Shabi daripada Fatimah binti Qais (رضي الله عنها) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) that there is no lodging and maintenance allowance for a woman who has been given irrevocable divorce.",
        "malay_translation": "Rasulullah (صلى الله عليه وسلم) bersabda bahawa tidak ada tuntutan tempat tinggal dan nafkah bagi wanita yang telah diceraikan secara mutlak.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنِ الشَّعْبِيِّ، عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الْمُطَلَّقَةِ ثَلَاثًا، قَالَ: «لَيْسَ لَهَا سُكْنَى، وَلَا نَفَقَةٌ."
      },
      {
        "id": 11273,
        "hadith_number": "3709",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perintah Mengundur Diri ke Rumah Saudara Sepupu Semasa Idah",
        "perawi_melayu": "Fatima binti Qais (رضي الله عنها) meriwayatkan:",
        "english_text": "My husband divorced me with three pronouncements. I decided to move (from his house to another place). So I came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and he said: Move to the house of your cousin 'Amr bin Umm Maktum and spend your period of 'Idda there.",
        "malay_translation": "Suami saya menceraikan saya sebanyak tiga kali. Saya memutuskan untuk berpindah (dari rumahnya ke tempat lain). Maka saya mendatangi Rasulullah (ﷺ), dan baginda bersabda: \"Pindahlah ke rumah saudara sepupu engkau, 'Amr bin Umm Maktum, dan habiskan tempoh idah di sana.\"",
        "arabic_text": "وحَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا عَمَّارُ بْنُ رُزَيْقٍ، عَنْ أَبِي إِسْحَاقَ، عَنِ الشَّعْبِيِّ، عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ، قَالَتْ: طَلَّقَنِي زَوْجِي ثَلَاثًا، فَأَرَدْتُ النُّقْلَةَ، فَأَتَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «انْتَقِلِي إِلَى بَيْتِ ابْنِ عَمِّكِ عَمْرِو بْنِ أُمِّ مَكْتُومٍ، فَاعْتَدِّي عِنْدَهُ»."
      },
      {
        "id": 11274,
        "hadith_number": "3710",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ketidakwujudan Peruntukan Penginapan dan Nafkah untuk Fatimah Bint Qais",
        "perawi_melayu": "Abu Ishaq melaporkan:",
        "english_text": "I was with al-Aswad bin Yazid sitting in the great mosque, and there was with us al-Sha'bi, and he narrated the narration of Fatima bint Qais (رضی اللہ عنہا ) that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) did not make any provision for lodging and maintenance allowance for her. Al-Aswad caught hold of some pebbles in his fist and he threw them towards him saying: Woe be to thee, you narrate like it, whereas Umar رضی اللہ عنہ said: We cannot abandon the Book of Allah and the Sunnah of our Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) for the words of a woman. We do not know whether she remembers that or she forgets. For her, there is a provision of lodging and maintenance allowance. Allah, the Exalted and Majestic, said: Turn them not from their houses nor should they themselves go forth unless they commit an open indecency (lxv. 1).",
        "malay_translation": "Saya bersama al-Aswad bin Yazid duduk di masjid yang besar, dan bersama kita ada al-Sha'bi, dan dia meriwayatkan perkataan Fatimah binti Qais (رضي الله عنها) bahawa Rasulullah SAW tidak menetapkan sebarang peruntukan penginapan dan nafkah untuknya. Al-Aswad memegang beberapa batu di tangannya dan melemparkannya kepadanya sambil berkata: Celakalah kamu, kamu meriwayatkan seperti itu, sedangkan Umar رضي الله عنه berkata: Kita tidak boleh meninggalkan Kitab Allah dan Sunnah Rasul-Nya SAW kerana perkataan seorang wanita. Kita tidak tahu sama ada dia mengingati atau dia lupa. Baginya, terdapat peruntukan penginapan dan nafkah. Allah, Yang Maha Tinggi dan Maha Mulia, berfirman: Jangan usir mereka dari rumah-rumah mereka dan janganlah mereka keluar kecuali mereka melakukan perbuatan yang keji terang-terangan (lxv. 1).",
        "arabic_text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ عَمْرِو بْنِ جَبَلَةَ، حَدَّثَنَا أَبُو أَحْمَدَ، حَدَّثَنَا عَمَّارُ بْنُ رُزَيْقٍ، عَنْ أَبِي إِسْحَاقَ، قَالَ: كُنْتُ مَعَ الْأَسْوَدِ بْنِ يَزِيدَ جَالِسًا فِي الْمَسْجِدِ الْأَعْظَمِ، وَمَعَنَا الشَّعْبِيُّ، فَحَدَّثَ الشَّعْبِيُّ بِحَدِيثِ فَاطِمَةَ بِنْتِ قَيْسٍ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، لَمْ يَجْعَلْ لَهَا سُكْنَى وَلَا نَفَقَةً»، ثُمَّ أَخَذَ الْأَسْوَدُ كَفًّا مِنْ حَصًى، فَحَصَبَهُ بِهِ، فَقَالَ: وَيْلَكَ تُحَدِّثُ بِمِثْلِ هَذَا، قَالَ عُمَرُ: لَا نَتْرُكُ كِتَابَ اللهِ وَسُنَّةَ نَبِيِّنَا صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِقَوْلِ امْرَأَةٍ، لَا نَدْرِي لَعَلَّهَا حَفِظَتْ، أَوْ نَسِيَتْ، لَهَا السُّكْنَى وَالنَّفَقَةُ، قَالَ اللهُ عَزَّ وَجَلَّ: {لَا تُخْرِجُوهُنَّ مِنْ بُيُوتِهِنَّ وَلَا يَخْرُجْنَ إِلَّا أَنْ يَأْتِينَ بِفَاحِشَةٍ مُبَيِّنَةٍ."
      },
      {
        "id": 11275,
        "hadith_number": "3711",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis yang serupa dengan Hadis Abu Ahmad dari 'Ammar bin Raziq",
        "perawi_melayu": null,
        "english_text": "A hadith like this has been narrated on the authority of Ishaq with the same chain of transmitters.",
        "malay_translation": "Sebuah hadis seperti ini telah diriwayatkan dengan sanad yang sama dari Ishaq.",
        "arabic_text": "وحَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا سُلَيْمَانُ بْنُ مُعَاذٍ، عَنْ أَبِي إِسْحَاقَ، بِهَذَا الْإِسْنَادِ، نَحْوَ حَدِيثِ أَبِي أَحْمَدَ، عَنْ عَمَّارِ بْنِ رُزَيْقٍ بِقِصَّتِهِ."
      },
      {
        "id": 11276,
        "hadith_number": "3712",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perceraian dan Pilihan Suami Nabi SAW",
        "perawi_melayu": "Fatima bint Qais (رضي الله عنها) meriwayatkan:",
        "english_text": "Her husband divorced her with three, pronouncements and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) made no provision for her lodging and maintenance allowance. She (further said): Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to me: When your period of 'Idda is over, inform me. So I informed him. (By that time) Mu'awiya, Abu Jahm and Usama bin Zaid رضی اللہ عنہم had given her the proposal of marriage. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: So far as Mu'awiya is concerned, he is a poor man without any property. So far as Abu Jahm is concerned, he is a great beater of women, but Usama bin Zaid... She pointed with her hand (that she did not approve of the idea of marrying) Usama. But Allah's Messenger (ﷺ) said: Obedience to Allah and obedience to His Messenger is better for thee. She said: So I married him, and I became an object of envy.",
        "malay_translation": "Suaminya menceraikannya tiga kali, dan Rasulullah SAW tidak menyediakan tempat tinggal dan nafkahnya. Beliau (Fatima) berkata lagi: Rasulullah SAW bersabda kepadaku, \"Apabila tempoh 'iddahmu berakhir, beritahu aku.\" Maka aku memberitahunya. Pada masa itu, Mu'awiyah, Abu Jahm, dan Usamah bin Zaid رضي الله عنهم telah melamarnya. Rasulullah SAW bersabda: Mengenai Mu'awiyah, dia seorang miskin tanpa harta. Mengenai Abu Jahm, dia seorang yang sering memukul isterinya, tetapi Usamah bin Zaid... Dia (Fatima) menolak Usamah dengan isyarat tangannya. Namun, Rasulullah SAW bersabda: \"Taat kepada Allah dan taat kepada Rasul-Nya adalah lebih baik bagimu.\" Dia berkata: Maka aku menikahinya, dan aku menjadi orang yang dicemburui.",
        "arabic_text": ") وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي بَكْرِ بْنِ أَبِي الْجَهْمِ بْنِ صُخَيْرٍ الْعَدَوِيِّ، قَالَ: سَمِعْتُ فَاطِمَةَ بِنْتَ قَيْسٍ، تَقُولُ: إِنَّ زَوْجَهَا طَلَّقَهَا ثَلَاثًا، فَلَمْ يَجْعَلْ لَهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سُكْنَى، وَلَا نَفَقَةً، قَالَتْ: قَالَ لِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا حَلَلْتِ فَآذِنِينِي»، فَآذَنْتُهُ، فَخَطَبَهَا مُعَاوِيَةُ، وَأَبُو جَهْمٍ، وَأُسَامَةُ بْنُ زَيْدٍ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَمَّا مُعَاوِيَةُ فَرَجُلٌ تَرِبٌ، لَا مَالَ لَهُ، وَأَمَّا أَبُو جَهْمٍ فَرَجُلٌ ضَرَّابٌ لِلنِّسَاءِ، وَلَكِنْ أُسَامَةُ بْنُ زَيْدٍ» فَقَالَتْ بِيَدِهَا هَكَذَا: أُسَامَةُ، أُسَامَةُ، فَقَالَ لَهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «طَاعَةُ اللهِ، وَطَاعَةُ رَسُولِهِ خَيْرٌ لَكِ»، قَالَتْ: فَتَزَوَّجْتُهُ، فَاغْتَبَطْتُ."
      },
      {
        "id": 11277,
        "hadith_number": "3713",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Penceraian dan Nafkah Wanita dalam Tempoh 'Iddah",
        "perawi_melayu": "Fatima binti Qais (رضي الله عنها) meriwayatkan:",
        "english_text": "My husband Abu 'Amr bin Hafs bin al-Mughira رضی اللہ عنہ sent 'Ayyish bin Abu Rabi'a to me with a divorce, and he also sent through him five si's of dates and five si's of barley. I said: Is there no maintenance allowance for me but only this, and I cannot even spend my 'Idda period in your house? He said: No. She said: I dressed myself and came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). He said: How many pronouncements of divorce have been made for you? I said: Three. He said what he ('Ayyish b. Abu Rabi'a) had stated was true. There is no maintenance allowance for you. Spend 'Idda period in the house of your cousin, Ibn Umm Maktum. He is blind and you can put off your garment in his presence. And when you have spent your Idda period, you inform me. She said: Mu'awiya and Abu'l-Jahm (Allah be pleased with them) were among those who had given me the proposal of marriage. Thereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Mu'awiya is destitute and in poor condition and Abu'l-Jahm is very harsh with women (or he beats women, or like that), you should take Usama bin Zaid (as your husband).",
        "malay_translation": "Suami saya, Abu 'Amr bin Hafs bin al-Mughira رضي الله عنه, menghantar 'Ayyish bin Abu Rabi'a kepada saya dengan lafaz talak, dan beliau juga menghantar lima si' kurma dan lima si' barli melalui beliau. Saya bertanya, \"Adakah tiada nafkah untuk saya melainkan ini sahaja, dan saya tidak boleh membelanjakan tempoh 'iddah di rumah anda?\" Beliau menjawab, \"Tidak.\"  Maka saya berpakaian dan datang kepada Rasulullah SAW. Baginda bertanya, \"Berapa kali talak telah diucapkan untuk anda?\" Saya menjawab, \"Tiga kali.\" Baginda mengesahkan bahawa apa yang dikatakan 'Ayyish bin Abu Rabi'a itu benar. Tiada nafkah untuk anda.  Belanjakan tempoh 'iddah di rumah sepupu anda, Ibn Umm Maktum. Beliau buta dan anda boleh menanggalkan pakaian anda di hadapannya.  Apabila tempoh 'iddah telah tamat, beritahu saya.  Kemudian, baginda bersabda, \"Mu'awiyah miskin dan dalam keadaan susah, dan Abu'l-Jahm sangat kasar terhadap wanita (atau memukul wanita, atau sebagainya),  maka engkau sepatutnya mengambil Usamah bin Zaid sebagai suami.",
        "arabic_text": "وحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ أَبِي بَكْرِ بْنِ أَبِي الْجَهْمِ، قَالَ: سَمِعْتُ فَاطِمَةَ بِنْتَ قَيْسٍ، تَقُولُ: أَرْسَلَ إِلَيَّ زَوْجِي أَبُو عَمْرِو بْنُ حَفْصِ بْنِ الْمُغِيرَةِ، عَيَّاشَ بْنَ أَبِي رَبِيعَةَ بِطَلَاقِي، وَأَرْسَلَ مَعَهُ بِخَمْسَةِ آصُعِ تَمْرٍ، وَخَمْسَةِ آصُعِ شَعِيرٍ، فَقُلْتُ: أَمَا لِي نَفَقَةٌ إِلَّا هَذَا؟ وَلَا أَعْتَدُّ فِي مَنْزِلِكُمْ؟ قَالَ: لَا، قَالَتْ: فَشَدَدْتُ عَلَيَّ ثِيَابِي، وَأَتَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ. فَقَالَ: «كَمْ طَلَّقَكِ؟» قُلْتُ: ثَلَاثًا، قَالَ: «صَدَقَ، لَيْسَ لَكِ نَفَقَةٌ، اعْتَدِّي فِي بَيْتِ ابْنِ عَمِّكِ ابْنِ أُمِّ مَكْتُومٍ، فَإِنَّهُ ضَرِيرُ الْبَصَرِ، تُلْقِي ثَوْبَكِ عِنْدَهُ، فَإِذَا انْقَضَتْ عِدَّتُكِ فَآذِنِينِي» قَالَتْ: فَخَطَبَنِي خُطَّابٌ مِنْهُمْ مُعَاوِيَةُ، وَأَبُو الْجَهْمِ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ مُعَاوِيَةَ تَرِبٌ، خَفِيفُ الْحَالِ، وَأَبُو الْجَهْمِ مِنْهُ شِدَّةٌ عَلَى النِّسَاءِ - أَوْ يَضْرِبُ النِّسَاءَ، أَوْ نَحْوَ هَذَا -، وَلَكِنْ عَلَيْكِ بِأُسَامَةَ بْنِ زَيْدٍ."
      },
      {
        "id": 11278,
        "hadith_number": "3714",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkongsian Peristiwa Perceraian dan Keutamaan dalam Islam",
        "perawi_melayu": "Abu Bakr bin Abu'l-Jahm melaporkan:",
        "english_text": "I and Abu Salama bin 'Abdul-Rahman came to fatima bint Qais ( رضی اللہ عنہا) and asked her (about divorce, etc.). She said: I was the wife of Abu 'Amr bin Hafs bin al-Mughira  رضی اللہ عنہ , and he set out to join the battle of Najran. The rest of the hadith is the same, but he made this addition: She said: I married him and Allah hornoured me on account of Ibn Zaid and Allah favoured me because of him.",
        "malay_translation": "Saya dan Abu Salama bin 'Abdul-Rahman menemui Fatimah binti Qais (رضي الله عنها) dan bertanya kepadanya (tentang perceraian, dan sebagainya). Beliau menjawab: Saya adalah isteri kepada Abu 'Amr bin Hafs bin al-Mughira (رضي الله عنه), dan beliau keluar untuk menyertai peperangan Najran.  Bahagian hadis yang lain adalah sama, tetapi beliau menambah: Beliau berkata: Saya mengahwininya dan Allah memuliakan saya kerana Ibn Zaid dan Allah memberikan kurnia kepada saya disebabkan beliau.",
        "arabic_text": "وحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا أَبُو عَاصِمٍ، حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ، حَدَّثَنِي أَبُو بَكْرِ بْنُ أَبِي الْجَهْمِ، قَالَ: دَخَلْتُ أَنَا وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، عَلَى فَاطِمَةَ بِنْتِ قَيْسٍ، فَسَأَلْنَاهَا، فَقَالَتْ: كُنْتُ عِنْدَ أَبِي عَمْرِو بْنِ حَفْصِ بْنِ الْمُغِيرَةِ، فَخَرَجَ فِي غَزْوَةِ نَجْرَانَ وَسَاقَ الْحَدِيثَ بِنَحْوِ حَدِيثِ ابْنِ مَهْدِيٍّ، وَزَادَ قَالَتْ: فَتَزَوَّجْتُهُ، فَشَرَّفَنِي اللهُ بِابْنِ زَيْدٍ، وَكَرَّمَنِي اللهُ بِابْنِ زَيْد."
      },
      {
        "id": 11279,
        "hadith_number": "3715",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perceraian yang Tidak Dapat Dibatalkan dari Perspektif Fatima binti Qais",
        "perawi_melayu": "Abu Bakr melaporkan:",
        "english_text": "I and Abu Salama came to Fatima bint Qais (رضی اللہ عنہا ) during the time of Ibn Zubair (Allah be pleased with him) and she narrated to us that her husband gave her an irrevocable divorce. (The rest of the hadith is the same.)",
        "malay_translation": "Saya dan Abu Salama datang menemui Fatima binti Qais (رضی اللہ عنہا) ketika zaman pemerintahan Ibn Zubair (رضي الله عنه). Beliau menceritakan kepada kami bahawa suaminya telah menceraikannya dengan talak bain. (Selebihnya hadith adalah sama.)",
        "arabic_text": "وحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، حَدَّثَنِي أَبُو بَكْرٍ، قَالَ: دَخَلْتُ أَنَا وَأَبُو سَلَمَةَ، عَلَى فَاطِمَةَ بِنْتِ قَيْسٍ زَمَنَ ابْنِ الزُّبَيْرِ، فَحَدَّثَتْنَا أَنَّ زَوْجَهَا طَلَّقَهَا طَلَاقًا بَاتًّا، بِنَحْوِ حَدِيثِ سُفْيَانَ."
      },
      {
        "id": 11280,
        "hadith_number": "3716",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perceraian dengan Tiga Kali Ucapan dan Tiada Penjagaan Daripada Suami",
        "perawi_melayu": "Fatima binti Qais (رضي الله عنها) meriwayatkan:",
        "english_text": "My husband divorced me with three pronouncements and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) made no provision for lodging and maintenance allowance.",
        "malay_translation": "Suami saya menceraikan saya sebanyak tiga kali dan Rasulullah (ﷺ) tidak menetapkan sebarang penjagaan tempat tinggal dan nafkah.",
        "arabic_text": "وحَدَّثَنِي حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا حَسَنُ بْنُ صَالِح، عَنِ السُّدِّيِّ، عَنِ الْبَهِيِّ، عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ، قَالَتْ: «طَلَّقَنِي زَوْجِي ثَلَاثًا، فَلَمْ يَجْعَلْ لِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سُكْنَى، وَلَا نَفَقَةً."
      },
      {
        "id": 11281,
        "hadith_number": "3717",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perceraian dan Perlakuan Tidak Beradab dalam Keluarga",
        "perawi_melayu": "Hisham meriwayatkan dari bapanya:",
        "english_text": "Yahya bin Sa'id bin al-'As berkahwin dengan anak perempuan 'Abdul-Rahman bin al-Hakam, dan dia menceraikannya serta mengusirnya dari rumahnya. 'Urwa (redha Allah dengannya) mengkritik tindakan mereka (anggota keluarga pihak suami). Mereka berkata: Sesungguhnya, Fatima juga keluar (dari rumah keluarga pihak suami). 'Urwa berkata: Aku menemui 'A'ishah (رضي الله عنها) dan memberitahunya tentang hal itu, dan dia berkata: Tidak ada kebaikan bagi Fatimah binti Qais (رضي الله عنها) untuk menyebutkannya.",
        "malay_translation": "Yahya bin Sa'id bin al-'As berkahwin dengan anak perempuan 'Abdul-Rahman bin al-Hakam, dan dia menceraikannya serta mengusirnya dari rumahnya. 'Urwa (redha Allah dengannya) mengkritik tindakan mereka (anggota keluarga pihak suami). Mereka berkata: Sesungguhnya, Fatimah juga keluar (dari rumah keluarga pihak suami). 'Urwa berkata: Aku menemui 'A'ishah (رضي الله عنها) dan memberitahunya tentang hal itu, dan dia berkata: Tidak ada kebaikan bagi Fatimah binti Qais (رضي الله عنها) untuk menyebutkannya.",
        "arabic_text": "وحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، حَدَّثَنِي أَبِي، قَالَ: تَزَوَّجَ يَحْيَى بْنُ سَعِيدِ بْنِ الْعَاصِ، بِنْتَ عَبْدِ الرَّحْمَنِ بْنِ الْحَكَمِ، فَطَلَّقَهَا، فَأَخْرَجَهَا مِنْ عِنْدِهِ، فَعَابَ ذَلِكَ عَلَيْهِمْ عُرْوَةُ، فَقَالُوا: إِنَّ فَاطِمَةَ قَدْ خَرَجَتْ، قَالَ عُرْوَةُ: فَأَتَيْتُ عَائِشَةَ، فَأَخْبَرْتُهَا بِذَلِكَ، فَقَالَتْ: «مَا لِفَاطِمَةَ بِنْتِ قَيْسٍ خَيْرٌ فِي أَنْ تَذْكُرَ هَذَا الْحَدِيثَ."
      },
      {
        "id": 11282,
        "hadith_number": "3718",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perceraian dan Ketakutan Terhadap Kesusahan",
        "perawi_melayu": "Fatimah binti Qais (رضي الله عنها) meriwayatkan bahawa beliau berkata:",
        "english_text": "Allah's Messenger, my husband has divorcee me with three pronouncements and I am afraid that I may be put to hardship, and so he commanded her and so she moved (to another house).",
        "malay_translation": "Rasulullah SAW, suamiku menceraikan aku sebanyak tiga kali dan aku takut akan ditimpa kesusahan. Maka dia memerintahkannya (suamiku) dan dia (aku) pun berpindah (ke rumah lain).",
        "arabic_text": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ، قَالَتْ: قُلْتُ: يَا رَسُولَ اللهِ، زَوْجِي طَلَّقَنِي ثَلَاثًا، وَأَخَافُ أَنْ يُقْتَحَمَ عَلَيَّ، قَالَ: «فَأَمَرَهَا، فَتَحَوَّلَتْ."
      },
      {
        "id": 11283,
        "hadith_number": "3719",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perkara Tidak Baik bagi Fatimah Mengenai Tidak Ada Tunjangan Penjagaan untuk Wanita Cerai",
        "perawi_melayu": "Aisyah رضي الله عنها berkata:",
        "english_text": "It is no good for Fatima to make mention of it, i.e. her statement: There is no lodging and maintenance allowance (for the divorced women).",
        "malay_translation": "Tidak baik bagi Fatimah menyebutnya, iaitu pernyataannya: Tidak ada tunjangan tempat tinggal dan nafkah (bagi wanita yang diceraikan).",
        "arabic_text": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ: «مَا لِفَاطِمَةَ خَيْرٌ أَنْ تَذْكُرَ هَذَا» قَالَ: تَعْنِي قَوْلَهَا: لَا سُكْنَى وَلَا نَفَقَةَ."
      },
      {
        "id": 11284,
        "hadith_number": "3720",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perceraian dan Nasihat 'Aisyah (رضي الله عنها)",
        "perawi_melayu": "Ibn al-Qasim meriwayatkan daripada bapanya bahawa 'Urwa bin Zubair (رضي الله عنه) berkata kepada 'Aisyah (رضي الله عنها):",
        "english_text": "Didn't you see that such and such daughter of al-Hakam was divorced by her husband with an irrevocable divorce, and she left (the house of her husband)? Thereupon 'A'isha (رضی اللہ عنہا) said: It was bad that she did. He (Urwa) said: Have you not heard the words of Fatima? Thereupon she said: There if no good for her in making mention of it.",
        "malay_translation": "Tidakkah engkau lihat bahawa anak perempuan al-Hakam itu diceraikan oleh suaminya dengan perceraian yang tidak boleh diubah, dan dia meninggalkan (rumah suaminya)? Lalu 'Aisyah (رضي الله عنها) berkata: Buruk perbuatannya itu. Beliau (Urwa) bertanya: Tidakkah engkau mendengar perkataan Fatimah? Lalu dia (Aisyah) menjawab: Tidak ada kebaikan baginya untuk menyebut-nyebut perkara itu.",
        "arabic_text": ") وحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، قَالَ: قَالَ عُرْوَةُ بْنُ الزُّبَيْرِ لِعَائِشَةَ: أَلَمْ تَرَيْ إِلَى فُلَانَةَ بِنْتِ الْحَكَمِ طَلَّقَهَا زَوْجُهَا الْبَتَّةَ، فَخَرَجَتْ، فَقَالَتْ: «بِئْسَمَا صَنَعَتْ»، فَقَالَ: أَلَمْ تَسْمَعِي إِلَى قَوْلِ فَاطِمَةَ، فَقَالَتْ: «أَمَا إِنَّهُ لَا خَيْرَ لَهَا فِي ذِكْرِ ذَلِكَ."
      },
      {
        "id": 11285,
        "hadith_number": "3721",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Memungut Kurma Semasa Idah",
        "perawi_melayu": "Jabir bin 'Abdullah (رضي الله عنه) meriwayatkan:",
        "english_text": "My maternal aunt was divorced, and she intended to pluck her dates. A person scolded her for having come out (during the period of 'Idda). She came to Allah's Prophet (ﷺ) and he said: Certainly you can pluck (dates) from your palm trees, for perhaps you may give charity or do an act of kindness.",
        "malay_translation": "Paman saya yang merupakan ibu saudara perempuan telah bercerai, dan dia berhasrat untuk memetik buah kurmanya. Seseorang menegurnya kerana keluar (semasa tempoh 'iddah). Beliau datang kepada Nabi Allah (ﷺ) dan baginda bersabda: Sesungguhnya engkau boleh memetik buah kurma dari pokok kurmamu, kerana mungkin engkau dapat memberi sedekah atau melakukan kebaikan.",
        "arabic_text": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، ح وحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللهِ، وَاللَّفْظُ لَهُ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ: قَالَ ابْنُ جُرَيْجٍ: أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ يَقُولُ: طُلِّقَتْ خَالَتِي، فَأَرَادَتْ أَنْ تَجُدَّ نَخْلَهَا، فَزَجَرَهَا رَجُلٌ أَنْ تَخْرُجَ، فَأَتَتِ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «بَلَى فَجُدِّي نَخْلَكِ، فَإِنَّكِ عَسَى أَنْ تَصَدَّقِي، أَوْ تَفْعَلِي مَعْرُوفًا."
      },
      {
        "id": 11286,
        "hadith_number": "3722",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Perkahwinan Wanita Selepas Bersalin",
        "perawi_melayu": "Ubaidullah bin 'Abdullah bin 'Utba (bin Mas'ud) melaporkan bahawa bapanya menulis kepada Umar bin 'Abdullah bin al-Arqam al-Zuhri",
        "english_text": "He would go to Subai'ah bint al-Hirith al-Aslamiyya ( رضی اللہ عنہا) and ask her about a verdict from him which Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) gave her when she had asked that from him (in regard to the termination of 'Idda at the birth of a child) 'Umar bin Abdullah wrote to 'Abdullah bin 'Utba informing him that Subai'ah رضی اللہ عنہا had told him that she had been married to Sa'd bin Khaula and he belonged to the tribe of Amir bin Lu'ayy, and was one of those who participated in the Battle of Badr, and he died in the Farewell Pilgrimage and she had been in the family way at that time. And much time had not elapsed that she gave birth to a child after his death and when she was free from the effects of childbirth she embellished herself for those who had to give proposals of marriage. Abdul-Sunabil bin Ba'kak (from Banu 'Abdul-Dar) came to her and said: What is this that I see you embellished; perhaps you are inclined to marry, By Allah, you cannot marry unless four months and ten days (of 'Idda are passed). When he said that. I dressed myself, and as it was evening I came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and asked him about it, and he gave me a religious verdict that I was allowed to marry when I had given birth to a child and asked me to marry if I so liked. Ibn Shihab said: I do not find any harm fur her in marrying when she has given birth to a child even when she is bleeding (after the birth of the child) except that her husband should not go near her until she is purified.",
        "malay_translation": "Beliau akan pergi menemui Subai'ah binti al-Hirith al-Aslamiyya (رضي الله عنها) dan bertanya kepadanya tentang fatwa yang telah diberikan oleh Rasulullah (صلي الله عليه وسلم) kepadanya apabila dia meminta fatwa tersebut (berhubung dengan tempoh 'iddah selepas kelahiran bayi). 'Umar bin Abdullah menulis kepada 'Abdullah bin 'Utba memberitahunya bahawa Subai'ah رضي الله عنها telah memberitahunya bahawa dia telah berkahwin dengan Sa'd bin Khaula, yang berasal dari puak Amir bin Lu'ayy dan merupakan salah seorang yang turut serta dalam Pertempuran Badar, dan dia meninggal dunia semasa Haji Wida' ketika Subai'ah sedang mengandung. Tidak lama kemudian, dia melahirkan bayi selepas kematian suaminya. Apabila dia sudah bebas daripada kesan bersalin, dia mempersiapkan diri untuk menerima lamaran perkahwinan. Abdul-Sunabil bin Ba'kak (dari Bani 'Abdul-Dar) datang kepadanya dan berkata: Apakah ini yang saya lihat? Anda nampaknya bersedia untuk berkahwin. Demi Allah, engkau tidak boleh berkahwin kecuali selepas empat bulan dan sepuluh hari (tempoh 'iddah). Selepas dia berkata demikian, saya memakai pakaian saya, dan ketika itu sudah petang, saya mendatangi Rasulullah (صلي الله عليه وسلم) dan bertanya kepadanya tentang perkara itu. Baginda telah memberi fatwa bahawa dia dibenarkan untuk berkahwin apabila telah melahirkan bayi dan menasihatkannya untuk berkahwin jika dia suka. Ibn Shihab berkata: Saya tidak menemui sebarang halangan bagi wanita tersebut untuk berkahwin selepas melahirkan bayi, walaupun dia masih mengalami pendarahan (selepas bersalin), kecuali suaminya tidak boleh mendekati sehingga dia suci.",
        "arabic_text": "وحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، وَتَقَارَبَا فِي اللَّفْظِ، قَالَ حَرْمَلَةُ: حَدَّثَنَا، وقَالَ أَبُو الطَّاهِرِ: أَخْبَرَنَا ابْنُ وَهْبٍ، حَدَّثَنِي يُونُسُ بْنُ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عُبَيْدُ اللهِ بْنُ عَبْدِ اللهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ أَبَاهُ كَتَبَ إِلَى عُمَرَ بْنِ عَبْدِ اللهِ بْنِ الْأَرْقَمِ الزُّهْرِيِّ، يَأْمُرُهُ أَنْ يَدْخُلَ عَلَى سُبَيْعَةَ بِنْتِ الْحَارِثِ الْأَسْلَمِيَّةِ، فَيَسْأَلَهَا عَنْ حَدِيثِهَا، وَعَمَّا قَالَ لَهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حِينَ اسْتَفْتَتْهُ، فَكَتَبَ عُمَرُ بْنُ عَبْدِ اللهِ إِلَى عَبْدِ اللهِ بْنِ عُتْبَةَ يُخْبِرُهُ، أَنَّ سُبَيْعَةَ أَخْبَرَتْهُ: أَنَّهَا كَانَتْ تَحْتَ سَعْدِ بْنِ خَوْلَةَ وَهُوَ فِي بَنِي عَامِرِ بْنِ لُؤَيٍّ، وَكَانَ مِمَّنْ شَهِدَ بَدْرًا، فَتُوُفِّيَ عَنْهَا فِي حَجَّةِ الْوَدَاعِ وَهِيَ حَامِلٌ، فَلَمْ تَنْشَبْ أَنْ وَضَعَتْ حَمْلَهَا بَعْدَ وَفَاتِهِ، فَلَمَّا تَعَلَّتْ مِنْ نِفَاسِهَا، تَجَمَّلَتْ لِلْخُطَّابِ، فَدَخَلَ عَلَيْهَا أَبُو السَّنَابِلِ بْنُ بَعْكَكٍ - رَجُلٌ مِنْ بَنِي عَبْدِ الدَّارِ - فَقَالَ لَهَا: مَا لِي أَرَاكِ مُتَجَمِّلَةً؟ لَعَلَّكِ تَرْجِينَ النِّكَاحَ، إِنَّكِ، وَاللهِ، مَا أَنْتِ بِنَاكِحٍ حَتَّى تَمُرَّ عَلَيْكِ أَرْبَعَةُ أَشْهُرٍ وَعَشْرٌ، قَالَتْ سُبَيْعَةُ: فَلَمَّا قَالَ لِي ذَلِكَ، جَمَعْتُ عَلَيَّ ثِيَابِي حِينَ أَمْسَيْتُ، فَأَتَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَسَأَلْتُهُ عَنْ ذَلِكَ، «فَأَفْتَانِي بِأَنِّي قَدْ حَلَلْتُ حِينَ وَضَعْتُ حَمْلِي، وَأَمَرَنِي بِالتَّزَوُّجِ إِنْ بَدَا لِي»، قَالَ ابْنُ شِهَابٍ: «فَلَا أَرَى بَأْسًا أَنْ تَتَزَوَّجَ حِينَ وَضَعَتْ، وَإِنْ كَانَتْ فِي دَمِهَا، غَيْرَ أَنَّهُ لَا يَقْرَبُهَا زَوْجُهَا حَتَّى تَطْهُرَ."
      },
      {
        "id": 11287,
        "hadith_number": "3723",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Peraturan Idah Wanita Yang Melahirkan Selepas Kehilangan Suami",
        "perawi_melayu": "Sulaiman bin Yasar meriwayatkan:",
        "english_text": "Abu Salama bin 'Abdul-Rahman dan Ibn 'Abbas (رضی اللہ عنہ) berkumpul di rumah Abu Hurairah (رضی اللہ عنہ) dan mula berbincang tentang wanita yang melahirkan anak beberapa malam selepas kematian suaminya. Ibn 'Abbas (رضی اللہ عنہ) berkata: Idahnya adalah tempoh yang lebih lama daripada dua tempoh (antara empat bulan dan sepuluh hari dan kelahiran anak, mana-mana yang lebih lama). Abu Salama pula berkata: Idahnya tamat (dengan kelahiran anak), dan mereka berbalah antara satu sama lain tentang isu ini, lalu Abu Hurairah (رضی اللہ عنہ) berkata: Aku bersetuju dengan pandangan keponakanku (iaitu Abu Salama رضی اللہ عنہا). Mereka menghantar Kuraib (hamba yang dibebaskan Ibn 'Abbas) kepada Umm Salama untuk bertanya mengenainya. Dia kembali kepada mereka dan memberitahu mereka bahawa Umm Salama (رضی اللہ عنہا) berkata bahawa Subai'ah al-Aslamiyya رضی اللہ عنہا melahirkan anak selepas kematian suaminya ketika beberapa malam (baru sahaja) berlalu dan dia menyebutnya kepada Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) dan baginda memerintahkannya untuk berkahwin.",
        "malay_translation": "Abu Salama bin Abdul Rahman dan Ibn Abbas (رضي الله عنهما) berkumpul di rumah Abu Hurairah (رضي الله عنه) dan berbincang mengenai wanita yang melahirkan anak beberapa malam selepas kematian suaminya. Ibn Abbas (رضي الله عنه) menyatakan bahawa idah wanita tersebut adalah tempoh yang lebih panjang daripada dua tempoh iaitu (antara empat bulan sepuluh hari dan kelahiran anak, mana-mana yang lebih panjang). Abu Salama pula berpendapat bahawa idah wanita tersebut tamat dengan kelahiran anaknya. Mereka berbalah mengenai isu ini, lalu Abu Hurairah (رضي الله عنه) menyokong pandangan keponakannya (Abu Salama رضي الله عنه). Mereka kemudian menghantar Kuraib (hamba yang dibebaskan Ibn Abbas) kepada Umm Salamah untuk mendapatkan penjelasan. Kuraib kembali dan melaporkan bahawa Umm Salamah (رضي الله عنها) berkata bahawa Subai'ah al-Aslamiyya (رضي الله عنها) melahirkan anak selepas kematian suaminya dalam tempoh beberapa malam yang singkat. Wanita itu menceritakan hal ini kepada Rasulullah (صلی الله عليه وسلم) dan baginda memerintahkannya untuk berkahwin.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ: سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، أَخْبَرَنِي سُلَيْمَانُ بْنُ يَسَارٍ، أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ، وَابْنَ عَبَّاسٍ، اجْتَمَعَا عِنْدَ أَبِي هُرَيْرَةَ، وَهُمَا يَذْكُرَانِ الْمَرْأَةَ تُنْفَسُ بَعْدَ وَفَاةِ زَوْجِهَا بِلَيَالٍ، فَقَالَ ابْنُ عَبَّاسٍ: عِدَّتُهَا آخِرُ الْأَجَلَيْنِ، وَقَالَ أَبُو سَلَمَةَ: قَدْ حَلَّتْ، فَجَعَلَا يَتَنَازَعَانِ ذَلِكَ، قَالَ: فَقَالَ أَبُو هُرَيْرَةَ: أَنَا مَعَ ابْنِ أَخِي - يَعْنِي أَبَا سَلَمَةَ - فَبَعَثُوا كُرَيْبًا مَوْلَى ابْنِ عَبَّاسٍ، إِلَى أُمِّ سَلَمَةَ، يَسْأَلُهَا عَنْ ذَلِكَ، فَجَاءَهُمْ فَأَخْبَرَهُمْ، أَنَّ أُمَّ سَلَمَةَ قَالَتْ: «إِنَّ سُبَيْعَةَ الْأَسْلَمِيَّةَ نُفِسَتْ بَعْدَ وَفَاةِ زَوْجِهَا بِلَيَالٍ، وَإِنَّهَا ذَكَرَتْ ذَلِكَ لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَمَرَهَا أَنْ تَتَزَوَّجَ."
      },
      {
        "id": 11288,
        "hadith_number": "3724",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hantar Kepada Umm Salama Tanpa Sebut Kuraib",
        "perawi_melayu": "Diceritakan oleh Yahya bin Saeed dengan sanad yang sama (mirip dengan hadis no. 3723), kecuali Al-Laith dalam hadisnya:",
        "english_text": "They sent him to Umm Salama رضی اللہ عنہا , but no mention was made of Kuraib.",
        "malay_translation": "Mereka menghantarnya kepada Umm Salama رضي الله عنها, tetapi tidak disebut tentang Kuraib.",
        "arabic_text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ رُمْح، أَخْبَرَنَا اللَّيْثُ، ح وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، قَالَا: حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، كِلَاهُمَا عَنْ يَحْيَى بْنِ سَعِيدٍ، بِهَذَا الْإِسْنَادِ. غَيْرَ أَنَّ اللَّيْثَ قَالَ فِي حَدِيثِهِ: فَأَرْسَلُوا إِلَى أُمِّ سَلَمَةَ، وَلَمْ يُسَمِّ كُرَيْبًا."
      },
      {
        "id": 11289,
        "hadith_number": "3725",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Berkabung Lebih Tiga Hari Kecuali Suami",
        "perawi_melayu": "Zainab binti Abu Salama (رضي الله عنها) meriwayatkan:",
        "english_text": "I went to Umm Habiba رضی اللہ عنہا , the wife of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), when her father Abu Sufyan رضی اللہ عنہ had died. Umm Habiba رضی اللہ عنہا sent for a perfume having yellowness in it or something else like it, and she applied it to a girl and then rubbed it on her cheeks and then said: By Allah, I need no perfume but for the fact that I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say on the pulpit: It is not permissible for a woman believing in Allah and the Hereafter to mourn for the dead beyond three days, but (in case of the death) of the husband it is permissible for four months and ten days.",
        "malay_translation": "Saya pergi kepada Umm Habiba رضي الله عنها, isteri Rasulullah صلى الله عليه وسلم, ketika bapanya, Abu Sufyan رضي الله عنه, meninggal dunia. Umm Habiba رضي الله عنها menghantar untuk mendapatkan wangi-wangian yang berwarna kuning atau sesuatu yang serupa, dan dia mengaplikasikannya pada seorang gadis, kemudian menggosokkannya pada pipinya dan berkata: Demi Allah, saya tidak memerlukan wangi-wangian ini melainkan kerana saya mendengar Rasulullah صلى الله عليه وسلم bersabda di atas mimbar: Tidak dibenarkan bagi wanita yang beriman kepada Allah dan Hari Akhirat untuk berkabung bagi orang yang meninggal dunia melebihi tiga hari, tetapi (dalam kes kematian) suami dibenarkan selama empat bulan sepuluh hari.",
        "arabic_text": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ عَبْدِ اللهِ بْنِ أَبِي بَكْرٍ، عَنْ حُمَيْدِ بْنِ نَافِعٍ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، أَنَّهَا أَخْبَرَتْهُ، هَذِهِ الْأَحَادِيثَ الثَّلَاثَةَ، قَالَ: قَالَتْ زَيْنَبُ: دَخَلْتُ عَلَى أُمِّ حَبِيبَةَ زَوْجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، حِينَ تُوُفِّيَ أَبُوهَا أَبُو سُفْيَانَ، فَدَعَتْ أُمُّ حَبِيبَةَ بِطِيبٍ فِيهِ صُفْرَةٌ خَلُوقٌ - أَوْ غَيْرُهُ - فَدَهَنَتْ مِنْهُ جَارِيَةً، ثُمَّ مَسَّتْ بِعَارِضَيْهَا، ثُمَّ قَالَتْ: وَاللهِ مَا لِي بِالطِّيبِ مِنْ حَاجَةٍ، غَيْرَ أَنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ عَلَى الْمِنْبَرِ: «لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ تُحِدُّ عَلَى مَيِّتٍ فَوْقَ ثَلَاثٍ، إِلَّا عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا»."
      },
      {
        "id": 11290,
        "hadith_number": "3726",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis tentang Tempoh Berkabung Wanita",
        "perawi_melayu": "Zainab berkata:",
        "english_text": "\"Then I entered upon Zainab bint Jahsh رضی اللہ عنہا when her brother died. She called for some perfume and put on some of it, then she said: 'By Allah, I have no need of perfume, but I heard the Messenger of Allah saying on the Minbar. \"It is not permissible for a women who believes in Allah and the last Day to mourn for more than free days for anyone who dies, except for a husband; four month and ten days.\"",
        "malay_translation": "Kemudian aku masuk menemui Zainab binti Jahsh رضی الله عنها ketika saudaranya meninggal dunia. Dia meminta sedikit minyak wangi dan memakainya, lalu berkata, 'Demi Allah, aku tidak memerlukan minyak wangi ini, tetapi aku mendengar Rasulullah SAW bersabda di atas mimbar, \"Tidak dibolehkan bagi wanita yang beriman kepada Allah dan Hari Akhirat untuk berkabung melebihi tiga hari bagi setiap orang yang meninggal dunia, kecuali bagi suami; empat bulan sepuluh hari.\"",
        "arabic_text": "قَالَتْ زَيْنَبُ: ثُمَّ دَخَلْتُ عَلَى زَيْنَبَ بِنْتِ جَحْشٍ حِينَ تُوُفِّيَ أَخُوهَا، فَدَعَتْ بِطِيبٍ، فَمَسَّتْ مِنْهُ، ثُمَّ قَالَتْ: وَاللهِ مَا لِي بِالطِّيبِ مِنْ حَاجَةٍ، غَيْرَ أَنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ عَلَى الْمِنْبَرِ: «لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ، تُحِدُّ عَلَى مَيِّتٍ فَوْقَ ثَلَاثٍ، إِلَّا عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا."
      },
      {
        "id": 11291,
        "hadith_number": "3727",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Penggunaan Obat Mata bagi Anak Janda",
        "perawi_melayu": "Zainab (رضي الله عنها) meriwayatkan:",
        "english_text": "I heard my mother Umm Salama (رضی اللہ عنہا) as saying: A woman came to Allah's Messenger (ﷺ) and said: Allah's Messenger. I have a daughter whose husband has died and there has developed some trouble in her eye; should we apply collyrium to it? Thereupon Allah's Messenger (ﷺ) said: No (repeating it twice or thrice, saying only, NO\" all the time). Then he said: It is only four mouths and ten days, whereas in the pre Islamic period none of you threw away the dung until one year had passed.",
        "malay_translation": "Aku mendengar ibuku, Umm Salama (رضي الله عنها) berkata: Seorang wanita datang kepada Rasulullah SAW dan berkata, \"Ya Rasulullah, anak perempuan saya telah ditinggalkan oleh suami, dan matanya mengalami masalah; adakah kita perlu menggunakan obat mata?\"  Rasulullah SAW menjawab: Tidak. (Beliau mengulangi kata \"tidak\" dua atau tiga kali). Kemudian beliau bersabda:  Hanya empat bulan dan sepuluh hari. Adapun di zaman Jahiliah, tidak seorang pun di antara kamu membuang kotoran sampai satu tahun berlalu.",
        "arabic_text": "قَالَتْ زَيْنَبُ: سَمِعْتُ أُمِّي أُمَّ سَلَمَةَ، تَقُولُ: جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَتْ: يَا رَسُولَ اللهِ، إِنَّ ابْنَتِي تُوُفِّيَ عَنْهَا زَوْجُهَا، وَقَدِ اشْتَكَتْ عَيْنُهَا، أَفَنَكْحُلُهَا؟ فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا» - مَرَّتَيْنِ أَوْ ثَلَاثًا، كُلَّ ذَلِكَ يَقُولُ: لَا - ثُمَّ قَالَ: «إِنَّمَا هِيَ أَرْبَعَةُ أَشْهُرٍ وَعَشْرٌ، وَقَدْ كَانَتْ إِحْدَاكُنَّ فِي الْجَاهِلِيَّةِ تَرْمِي بِالْبَعْرَةِ عَلَى رَأْسِ الْحَوْلِ»."
      },
      {
        "id": 11292,
        "hadith_number": "3728",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Cara Berduka Cita dan Memulihkan Diri Selepas Kematian Suami",
        "perawi_melayu": "Humaid berkata:",
        "english_text": "I said to Zainab رضی اللہ عنہا : What is this throwing of dung until a year is passed? Zainab said: When the husband of a woman died, she went into a hut and put on her worst clothes, and did not apply perfume or something like it until a year was over. Then an animal like a donkey, or a goat, or a bird was brought to her and she rubbed her hand over it, and it so happened that one on which she rubbed her hand died. She then came out of her house and she was given dung and she threw it and then she made use of anything like perfume or something else as she liked.",
        "malay_translation": "Aku bertanya kepada Zainab رضي الله عنها, \"Apakah makna perbuatan membuang tahi hingga tempoh setahun ini?\" Zainab menjawab, \"Apabila suami seorang wanita meninggal dunia, wanita itu akan masuk ke dalam pondok, memakai pakaian paling buruk, dan tidak menggunakan minyak wangi atau seumpamanya sehingga setahun berlalu. Kemudian, seekor haiwan seperti keldai, kambing, atau burung dibawa kepadanya, dan dia menggosok tangannya ke atas haiwan tersebut.  Kebetulan haiwan yang diusapnya mati. Kemudian, dia keluar dari rumahnya dan diberi tahi, lalu dia membuangnya. Setelah itu, dia bebas menggunakan minyak wangi atau seumpamanya seperti yang disukainya.\"",
        "arabic_text": "قَالَ حُمَيْدٌ: فَقُلْتُ لِزَيْنَبَ، وَمَا تَرْمِي بِالْبَعْرَةِ عَلَى رَأْسِ الْحَوْلِ؟ فَقَالَتْ زَيْنَبُ: «كَانَتِ الْمَرْأَةُ إِذَا تُوُفِّيَ عَنْهَا زَوْجُهَا دَخَلَتْ حِفْشًا، وَلَبِسَتْ شَرَّ ثِيَابِهَا، وَلَمْ تَمَسَّ طِيبًا، وَلَا شَيْئًا حَتَّى تَمُرَّ بِهَا سَنَةٌ، ثُمَّ تُؤْتَى بِدَابَّةٍ - حِمَارٍ، أَوْ شَاةٍ، أَوْ طَيْرٍ - فَتَفْتَضُّ بِهِ، فَقَلَّمَا تَفْتَضُّ بِشَيْءٍ إِلَّا مَاتَ، ثُمَّ تَخْرُجُ، فَتُعْطَى بَعْرَةً، فَتَرْمِي بِهَا، ثُمَّ تُرَاجِعُ بَعْدُ مَا شَاءَتْ مِنْ طِيبٍ أَوْ غَيْرِهِ."
      },
      {
        "id": 11293,
        "hadith_number": "3729",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Berkabung Melebihi Tiga Hari, Kecuali Bagi Isteri",
        "perawi_melayu": "Zainab binti Umm Salama (رضي الله عنها) meriwayatkan:",
        "english_text": "A relative of Umm Habiba (رضی اللہ عنہا) died. She sent for a yellow (perfume) and applied that to her forearm and said: I, am doing it, for I have heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying: It is not permissible for a woman believing in Allah and the Hereafter to mourn beyond three days except the husband (for whom she can mourn) for four months and ten days.",
        "malay_translation": "Seorang saudara mara Umm Habiba (رضي الله عنها) meninggal dunia. Beliau menghantar untuk mendapatkan wangian kuning dan mengaplikasikannya pada lengannya sambil berkata: Saya melakukannya, kerana saya telah mendengar Rasulullah SAW bersabda: Tidak dibenarkan bagi seorang wanita yang beriman kepada Allah dan Hari Akhirat untuk berkabung melebihi tiga hari kecuali bagi isteri (yang dibenarkan berkabung) selama empat bulan sepuluh hari.",
        "arabic_text": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ حُمَيْدِ بْنِ نَافِعٍ، قَالَ: سَمِعْتُ زَيْنَبَ بِنْتَ أُمِّ سَلَمَةَ، قَالَتْ: تُوُفِّيَ حَمِيمٌ لِأُمِّ حَبِيبَةَ، فَدَعَتْ بِصُفْرَةٍ، فَمَسَحَتْهُ بِذِرَاعَيْهَا، وَقَالَتْ: إِنَّمَا أَصْنَعُ هَذَا لِأَنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ أَنْ تُحِدَّ فَوْقَ ثَلَاثٍ، إِلَّا عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا."
      },
      {
        "id": 11294,
        "hadith_number": "3730",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Tentang Cerai dan Perceraian",
        "perawi_melayu": "Zainab, daripada ibunya dan daripada Zainab رضي الله عنها, isteri Rasulullah صلى الله عليه وسلم, atau dari isteri Rasulullah صلى الله عليه وسلم yang lain.",
        "english_text": "This hadith was narrated by Zainab from her mother and from Zainab رضی اللہ عنہا , the wife of Allah's Apostle ( صلى الله عليه وسلم ), or from some other lady from among the wives of the Prophet ( صلى الله عليه وسلم ).",
        "malay_translation": "Hadis ini diriwayatkan oleh Zainab daripada ibunya dan daripada Zainab رضي الله عنها, isteri Rasulullah صلى الله عليه وسلم, atau daripada isteri Rasulullah صلى الله عليه وسلم yang lain.",
        "arabic_text": "وَحَدَّثَتْهُ زَيْنَبُ، عَنْ أُمِّهَا، وَعَنْ زَيْنَبَ زَوْجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَوْ عَنِ امْرَأَةٍ مِنْ بَعْضِ أَزْوَاجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 11295,
        "hadith_number": "3731",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ketidakpatuhan Wanita terhadap Tempoh Idah dan Penggunaan Krim Mata",
        "perawi_melayu": "Zainab binti Umm Salama (رضي الله عنها) meriwayatkan daripada ibunya:",
        "english_text": "A woman lost her husband. (As her eyes were ailing) they (her kith and kin) entertained fear about her eyes, so they came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and sought permission for the use of collyrium, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: One among you used to spend one year in a dungeon dressed in worst clothes. (And at the end of this period) she threw dung at the dog which happened to pass that way and then she came out (of her 'Idda). Can't she (wait) even for four months and ten days?",
        "malay_translation": "Seorang wanita kehilangan suaminya. (Oleh kerana matanya sakit) kaum kerabatnya bimbang tentang keadaan matanya, lalu mereka datang kepada Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) dan memohon izin untuk menggunakan ubat mata. Baginda Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) menjawab, \"Adalah seorang daripada kamu yang pernah menghabiskan setahun di dalam penjara dengan pakaian yang buruk. (Dan pada akhir tempoh tersebut) dia membuang tahi pada seekor anjing yang melintas lalu dan kemudian keluar dari tempoh idahnya. Tidakkah dia mampu menunggu selama empat bulan sepuluh hari?\" ",
        "arabic_text": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ حُمَيْدِ بْنِ نَافِعٍ، قَالَ: سَمِعْتُ زَيْنَبَ بِنْتَ أُمِّ سَلَمَةَ، تُحَدِّثُ عَنْ أُمِّهَا، أَنَّ امْرَأَةً تُوُفِّيَ زَوْجُهَا، فَخَافُوا عَلَى عَيْنِهَا، فَأَتَوُا النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَاسْتَأْذَنُوهُ فِي الْكُحْلِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «قَدْ كَانَتْ إِحْدَاكُنَّ تَكُونُ فِي شَرِّ بَيْتِهَا فِي أَحْلَاسِهَا - أَوْ فِي شَرِّ أَحْلَاسِهَا - فِي بَيْتِهَا حَوْلًا، فَإِذَا مَرَّ كَلْبٌ رَمَتْ بِبَعْرَةٍ، فَخَرَجَتْ، أَفَلَا أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا."
      },
      {
        "id": 11296,
        "hadith_number": "3732",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis tentang Penggunaan Khol dan Isteri Nabi SAW",
        "perawi_melayu": "Humaid bin Nafi'",
        "english_text": "Humaid bin Nafi' narrated two traditions from Umm Salama رضی اللہ عنہا dealing with collyrium and the other hadith from the wives of Allah's Prophet (صلی اللہ علیہ وسلم) except with this that no mention was made of Zainab.",
        "malay_translation": "Humaid bin Nafi' meriwayatkan dua hadis daripada Umm Salamah رضي الله عنها berkaitan dengan penggunaan kحل (kollyrium) dan hadis yang lain daripada isteri-isteri Nabi (صلی اللہ علیہ وسلم), kecuali tidak disebut nama Zainab.",
        "arabic_text": "وحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ حُمَيْدِ بْنِ نَافِعٍ بِالْحَدِيثَيْنِ جَمِيعًا حَدِيثِ أُمِّ سَلَمَةَ فِي الْكُحْلِ، وَحَدِيثِ أُمِّ سَلَمَةَ، وَأُخْرَى مِنْ أَزْوَاجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، غَيْرَ أَنَّهُ لَمْ تُسَمِّهَا زَيْنَبَ، نَحْوَ حَدِيثِ مُحَمَّدِ بْنِ جَعْفَرٍ."
      },
      {
        "id": 11297,
        "hadith_number": "3733",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Penggunaan Kolam Mata bagi Wanita Berduka",
        "perawi_melayu": "Zainab binti Abu Salama رضي الله عنها meriwayatkan:",
        "english_text": "Umm Salama and Umm Habiba (رضی اللہ عنہا) were talking with each other (and saying) that a woman came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and mentioned to him that her daughter had lost her husband, and her eyes were sore and she wnted to use collyrium, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: One among you used to throw dung at the end of a year, and now (this abstinence from adornment) is only for four months and ten days.",
        "malay_translation": "Umm Salama dan Umm Habiba (رضي الله عنهما) berbual antara satu sama lain, menceritakan bahawa seorang wanita datang kepada Rasulullah (ﷺ) dan mengadu bahawa anak perempuannya telah kehilangan suami, matanya sakit dan ingin menggunakan kohl.  Lalu Rasulullah (ﷺ) bersabda:  Dahulu di antara kamu ada yang membuang tahi lembu pada akhir tahun, dan sekarang (larangan berhias) hanya untuk tempoh empat bulan sepuluh hari.",
        "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ قَالَا حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ حُمَيْدِ بْنِ نَافِعٍ أَنَّهُ سَمِعَ زَيْنَبَ بِنْتَ أَبِي سَلَمَةَ تُحَدِّثُ عَنْ أُمِّ سَلَمَةَ وَأُمِّ حَبِيبَةَ تَذْكُرَانِ أَنَّ امْرَأَةً أَتَتْ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَتْ لَهُ أَنَّ بِنْتًا لَهَا تُوُفِّيَ عَنْهَا زَوْجُهَا فَاشْتَكَتْ عَيْنُهَا فَهِيَ تُرِيدُ أَنْ تَكْحُلَهَا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «قَدْ كَانَتْ إِحْدَاكُنَّ تَرْمِي بِالْبَعْرَةِ عِنْدَ رَأْسِ الْحَوْلِ وَإِنَّمَا هِيَ أَرْبَعَةُ أَشْهُرٍ وَعَشْرٌ»."
      },
      {
        "id": 11298,
        "hadith_number": "3734",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Wanita Menjauhi Perhiasan Kecuali Bagi Arwah Suami",
        "perawi_melayu": "Zainab binti Abu Salama رضي الله عنها meriwayatkan:",
        "english_text": "When the news of the death of Abu Safyan رضی اللہ عنہ came to Umm Habiba رضی اللہ عنہا she sent for yellow (perfume) on the third day and rubbed it on her forearms and on her cheeks and said: I had in fact no need of it, but I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: It is not permissible for the women believing in Allah and the Hereafter to abstain from adornment beyond three days except (at the death of) husband (in which case she must abstain from adornment) for four months and ten days.",
        "malay_translation": "Apabila berita kematian Abu Safyan رضي الله عنه sampai kepada Umm Habiba رضي الله عنها, beliau menghantar orang untuk mendapatkan minyak wangi berwarna kuning pada hari ketiga. Beliau mengoleskannya pada lengan dan pipinya. Beliau berkata, \"Sebenarnya, aku tidak memerlukannya, tetapi aku mendengar Rasulullah SAW bersabda: Tidak dibolehkan bagi wanita yang beriman kepada Allah dan Hari Akhirat untuk menjauhi perhiasan melebihi tiga hari kecuali (dalam kes kematian suami, di mana dia mesti menjauhi perhiasan) selama empat bulan sepuluh hari.",
        "arabic_text": "وحَدَّثَنَا عَمْرٌو النَّاقِدُ، وَابْنُ أَبِي عُمَرَ، وَاللَّفْظُ لِعَمْرٍو، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَيُّوبَ بْنِ مُوسَى، عَنْ حُمَيْدِ بْنِ نَافِعٍ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، قَالَتْ: لَمَّا أَتَى أُمَّ حَبِيبَةَ نَعِيُّ أَبِي سُفْيَانَ، دَعَتْ فِي الْيَوْمِ الثَّالِثِ بِصُفْرَةٍ، فَمَسَحَتْ بِهِ ذِرَاعَيْهَا، وَعَارِضَيْهَا، وَقَالَتْ: كُنْتُ عَنْ هَذَا غَنِيَّةً، سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ، أَنْ تُحِدَّ فَوْقَ ثَلَاثٍ، إِلَّا عَلَى زَوْجٍ، فَإِنَّهَا تُحِدُّ عَلَيْهِ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا."
      },
      {
        "id": 11299,
        "hadith_number": "3735",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Berkabung Melebihi Tiga Hari untuk Wanita Mukminah",
        "perawi_melayu": "Safiyyah binti Abu 'Ubaid meriwayatkan berdasarkan perawi Hafsah رضي الله عنها atau 'Aisyah رضي الله عنها, atau daripada keduanya:",
        "english_text": "Allah's Messenger (ﷺ) said: It is not permissible for a woman believing in Allah and the Hereafter (or believing in Allah and His Messenger) that she should observe mourning for the dead beyond three days except in case of her husband.",
        "malay_translation": "Rasulullah SAW bersabda: Tidak dibolehkan bagi wanita yang beriman kepada Allah dan Hari Akhirat (atau beriman kepada Allah dan Rasul-Nya) untuk berkabung melebihi tiga hari kecuali dalam kes suaminya.",
        "arabic_text": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَقُتَيْبَةُ، وَابْنُ رُمْح، عَنِ اللَّيْثِ بْنِ سَعْدٍ، عَنْ نَافِعٍ، أَنَّ صَفِيَّةَ بِنْتَ أَبِي عُبَيْدٍ، حَدَّثَتْهُ، عَنْ حَفْصَةَ، أَوْ عَنْ عَائِشَةَ، أَوْ عَنْ كِلْتَيْهِمَا، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ - أَوْ تُؤْمِنُ بِاللهِ وَرَسُولِهِ - أَنْ تُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلَاثَةِ أَيَّامٍ، إِلَّا عَلَى زَوْجِهَا."
      },
      {
        "id": 11300,
        "hadith_number": "3736",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Serupa dengan Hadis Al-Laith",
        "perawi_melayu": null,
        "english_text": "A hadith similar to that of Al-Laith (no. 3735) was narrated from Nafi with this chain.",
        "malay_translation": "Satu hadis yang serupa dengan hadis Al-Laith (no. 3735) diriwayatkan daripada Nafi dengan sanad ini.",
        "arabic_text": "وَحَدَّثَنَاهُ شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُسْلِمٍ، حَدَّثَنَا عَبْدُ اللهِ بْنُ دِينَارٍ، عَنْ نَافِعٍ، بِإِسْنَادِ حَدِيثِ اللَّيْثِ مِثْلَ رِوَايَتِهِ."
      },
      {
        "id": 11301,
        "hadith_number": "3737",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Berhias bagi Janda dalam Tempoh Empat Bulan Sepuluh Hari",
        "perawi_melayu": "Safiyyah binti Abu 'Ubaid melaporkan:",
        "english_text": "She heard Hafsa daughter of Umar (رضی اللہ عنہا), (and) wife of Allah's Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), narrating a hadith like this from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and she made this addition: She should abstain from adorning herself (in case of the death of her husband) for four months and ten days.",
        "malay_translation": "Dia mendengar Hafsah binti Umar (رضي الله عنها), isteri Nabi (ﷺ), menceritakan hadis seperti ini daripada Rasulullah (ﷺ), dan beliau menambah: Dia perlu menjauhi berhias (jika suaminya meninggal dunia) selama empat bulan sepuluh hari.",
        "arabic_text": "وَحَدَّثَنَاهُ أَبُو غَسَّانَ الْمِسْمَعِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالَا: حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ: سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، يَقُولُ: سَمِعْتُ نَافِعًا، يُحَدِّثُ عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ، أَنَّهَا سَمِعَتْ حَفْصَةَ بِنْتَ عُمَرَ، زَوْجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ تُحَدِّثُ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ اللَّيْثِ، وَابْنِ دِينَارٍ، وَزَادَ فَإِنَّهَا تُحِدُّ عَلَيْهِ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا."
      },
      {
        "id": 11302,
        "hadith_number": "3738",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis tentang Perceraian dan Kisah Isteri Rasulullah SAW",
        "perawi_melayu": "Safiyya binti Abu 'Ubaid",
        "english_text": "Safiyya bint Abu 'Ubaid narrated this tradition of Allah's Prophet ( صلى الله عليه وسلم ) on the authority of some wives of Allah's Apostle ( صلى الله عليه وسلم )",
        "malay_translation": "Safiyya binti Abu 'Ubaid meriwayatkan hadis ini daripada beberapa isteri Rasulullah SAW (صلى الله عليه وسلم).  Perawi ini menyampaikan hadis tersebut melalui beberapa perantaraan (sanad) yang menceritakan kisah dan hadis Rasulullah SAW (صلى الله عليه وسلم) yang berkaitan.",
        "arabic_text": "وحَدَّثَنَا أَبُو الرَّبِيعِ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللهِ، جَمِيعًا عَنْ نَافِعٍ، عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ، عَنْ بَعْضِ أَزْوَاجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِهِمْ."
      },
      {
        "id": 11303,
        "hadith_number": "3739",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Berkabung Melebihi Tiga Hari Bagi Wanita Mukmin",
        "perawi_melayu": "Aisyah رضي الله عنها meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Tidak dibolehkan bagi seorang wanita yang beriman kepada Allah dan Hari Akhirat untuk berkabung atas kematian orang yang disayang melebihi tiga hari, kecuali bagi kematian suaminya.",
        "malay_translation": "Rasulullah SAW bersabda, \"Tidak dibenarkan bagi wanita yang beriman kepada Allah dan Hari Akhirat untuk berkabung atas kematian seseorang melebihi tiga hari, kecuali dalam kes kematian suaminya.\"",
        "arabic_text": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، وَاللَّفْظُ لِيَحْيَى، قَالَ يَحْيَى: أَخْبَرَنَا، وَقَالَ الْآخَرُونَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ، أَنْ تُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلَاثٍ، إِلَّا عَلَى زَوْجِهَا."
      },
      {
        "id": 11304,
        "hadith_number": "3740",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Berkabung dan Perhiasan Wanita selepas Kematian Suami",
        "perawi_melayu": "Umm `Atiyya (رضي الله عنها) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had said: A woman must not observe mourning for one who had died for more than three (days) except for four months and ten days in the case of her husband. And she must not wear a dyed garment except one of the types made of dyed yarn, or apply collyrium, or touch perfume except a little perfume or incense, when she has been purified after her courses.",
        "malay_translation": "Pesuruhjaya Allah (ﷺ) telah bersabda: Seorang wanita tidak boleh berkabung melebihi tiga hari kecuali untuk empat bulan sepuluh hari sekiranya ia adalah kematian suaminya. Dan dia tidak boleh memakai pakaian berwarna kecuali yang daripada benang yang telah dicelup warna, atau memakai kohl, atau menggunakan minyak wangi kecuali sedikit minyak wangi atau wewangian, setelah ia suci dari haidnya.",
        "arabic_text": "وحَدَّثَنَا حَسَنُ بْنُ الرَّبِيعِ، حَدَّثَنَا ابْنُ إِدْرِيسَ، عَنْ هِشَامٍ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تُحِدُّ امْرَأَةٌ عَلَى مَيِّتٍ فَوْقَ ثَلَاثٍ، إِلَّا عَلَى زَوْجٍ، أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا، وَلَا تَلْبَسُ ثَوْبًا مَصْبُوغًا، إِلَّا ثَوْبَ عَصْبٍ، وَلَا تَكْتَحِلُ، وَلَا تَمَسُّ طِيبًا، إِلَّا إِذَا طَهُرَتْ، نُبْذَةً مِنْ قُسْطٍ أَوْ أَظْفَارٍ."
      },
      {
        "id": 11305,
        "hadith_number": "3741",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kebersihan Selepas Haid dan sedikit Qust atau Azhar",
        "perawi_melayu": "Dikisahkan oleh Hisham dengan sanad yang serupa dengan hadis nombor 3740, dan beliau berkata:",
        "english_text": "\"As soon as her menses and a little of Qust or Azhar.",
        "malay_translation": "Segera selepas haid dan sedikit dari Qust atau Azhar.",
        "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللهِ بْنُ نُمَيْرٍ، ح وحَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، كِلَاهُمَا عَنْ هِشَامٍ، بِهَذَا الْإِسْنَادِ. وَقَالَا: «عِنْدَ أَدْنَى طُهْرِهَا نُبْذَةً مِنْ قُسْطٍ وَأَظْفَارٍ."
      },
      {
        "id": 11306,
        "hadith_number": "3742",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Berkabung Melebihi Tiga Hari Kecuali Bagi Suami Isteri dan Larangan Memakai Perhiasan",
        "perawi_melayu": "Umm 'Atiyya (رضی اللہ عنہا) berkata:",
        "english_text": "We were forbidden to observe mourning for the dead beyond three days except in the case of husband (where it is permissible) for four months and ten days, and (that during this period) we should neither use collyrium nor touch perfume, nor wear dyed clothes, but concession was given to a woman when one of us was purified of our courses to make use of a little incense or scent.",
        "malay_translation": "Kami dilarang berkabung melebihi tiga hari kecuali dalam kes suami isteri (di mana dibenarkan) selama empat bulan sepuluh hari. Dan (selama tempoh ini), kita tidak sepatutnya menggunakan kohl, menyentuh minyak wangi, atau memakai pakaian yang berwarna-warni. Walau bagaimanapun, pengecualian diberikan kepada wanita apabila telah suci daripada haid untuk menggunakan sedikit wewangian atau bau-bauan.",
        "arabic_text": "وحَدَّثَنِي أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ: «كُنَّا نُنْهَى أَنْ نُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلَاثٍ، إِلَّا عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا، وَلَا نَكْتَحِلُ، وَلَا نَتَطَيَّبُ، وَلَا نَلْبَسُ ثَوْبًا مَصْبُوغًا، وَقَدْ رُخِّصَ لِلْمَرْأَةِ فِي طُهْرِهَا إِذَا اغْتَسَلَتْ إِحْدَانَا مِنْ مَحِيضِهَا، فِي نُبْذَةٍ مِنْ قُسْطٍ وَأَظْفَارٍ."
      }
    ]
  }
}