{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 106,
    "data": [
      {
        "id": 14585,
        "hadith_number": "7024",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kepayahan Perjalanan dan Ujian terhadap Abdullah bin Ubayy",
        "perawi_melayu": "Zaid bin Arqam",
        "english_text": "Zaid b. Arqam reported: We set out on a journey along with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in which we faced many hardships. 'Abdullah b. Ubayy said to his friends: Do not give what you have in your possession to those who are with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) until they desert him. Zubair said: That is the reciting of that person who recited as min haulahu (from around him) and the other reciting is man haulahia (who are around him). And in this case when we would return to Medina the honourable would drive out the meaner therefrom (lxiv. 8). I came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and informed him about that and he sent someone to 'Abdullah b. Ubayy and he asked him whether he had said that or not. He took an oath to the fact that he had not done that and told that it was Zaid who had stated a lie to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). Zaid said: I was much perturbed because of this until this verse was revealed attesting my truth: When the hypocrites come (lxiii. 1). Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) then called them in order to seek forgiveness for them, but they turned away their heads as if they were hooks of wood fixed in the wall (lxiii. 4), and they were in fact apparently good-looking persons.",
        "malay_translation": "Zaid bin Arqam meriwayatkan: Kami berangkat dalam satu perjalanan bersama Rasulullah SAW, di mana kami menghadapi pelbagai kesulitan. Abdullah bin Ubayy berkata kepada rakan-rakannya: Janganlah berikan apa yang kamu miliki kepada mereka yang bersama Rasulullah SAW sehingga mereka meninggalkan baginda. Zubair berkata: Itulah bacaan orang yang membaca 'min haulahu' (dari sekelilingnya) dan bacaan yang lain pula ialah 'man haulahia' (yang berada di sekelilingnya). Dan dalam keadaan ini, apabila kami kembali ke Madinah, orang-orang mulia akan menghalau orang-orang yang hina daripadanya. Saya menghadap Rasulullah SAW dan menceritakan kepadanya tentang perkara itu, lalu baginda mengutus seseorang kepada Abdullah bin Ubayy dan bertanya kepadanya sama ada dia telah berkata demikian atau tidak. Dia bersumpah bahawa dia tidak pernah berkata demikian dan mengatakan bahawa Zaid telah berdusta kepada Rasulullah SAW. Zaid berkata: Saya amat sedih disebabkan perkara ini sehingga ayat ini diturunkan sebagai pengesahan kebenaran saya: \"Apabila orang-orang munafik datang.\" Rasulullah SAW kemudian memanggil mereka untuk memohon keampunan bagi mereka, tetapi mereka memalingkan muka mereka seolah-olah mereka adalah cangkuk kayu yang tertancap di dinding, dan mereka sebenarnya kelihatan orang yang baik.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى حَدَّثَنَا زُهَيْرُ بْنُ مُعَاوِيَةَ حَدَّثَنَا أَبُو إِسْحَقَ أَنَّهُ سَمِعَ زَيْدَ بْنَ أَرْقَمَ يَقُولُ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ أَصَابَ النَّاسَ فِيهِ شِدَّةٌ فَقَالَ عَبْدُ اللَّهِ بْنُ أُبَيٍّ لِأَصْحَابِهِ لَا تُنْفِقُوا عَلَى مَنْ عِنْدَ رَسُولِ اللَّهِ حَتَّى يَنْفَضُّوا مِنْ حَوْلِهِ قَالَ زُهَيْرٌ وَهِيَ قِرَاءَةُ مَنْ خَفَضَ حَوْلَهُ وَقَالَ لَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الْأَعَزُّ مِنْهَا الْأَذَلَّ قَالَ فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرْتُهُ بِذَلِكَ فَأَرْسَلَ إِلَى عَبْدِ اللَّهِ بْنِ أُبَيٍّ فَسَأَلَهُ فَاجْتَهَدَ يَمِينَهُ مَا فَعَلَ فَقَالَ كَذَبَ زَيْدٌ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَوَقَعَ فِي نَفْسِي مِمَّا قَالُوهُ شِدَّةٌ حَتَّى أَنْزَلَ اللَّهُ تَصْدِيقِي إِذَا جَاءَكَ الْمُنَافِقُونَ قَالَ ثُمَّ دَعَاهُمْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيَسْتَغْفِرَ لَهُمْ قَالَ فَلَوَّوْا رُءُوسَهُمْ و قَوْله كَأَنَّهُمْ خُشُبٌ مُسَنَّدَةٌ وَقَالَ كَانُوا رِجَالًا أَجْمَلَ شَيْءٍ"
      },
      {
        "id": 14586,
        "hadith_number": "7025",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Rasulullah SAW di Kubur Abdullah bin Ubayy",
        "perawi_melayu": "Jabir",
        "english_text": "Jabir reported Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came to the grave of 'Abdullah b. Ubayy, brought him out from that, placed him on his knee and put his saliva in his mouth and shrouded him in his own shirt and Allah knows best.",
        "malay_translation": "Jabir meriwayatkan bahawa Rasulullah SAW telah datang ke kubur Abdullah bin Ubayy, mengeluarkannya dari situ, meletakkannya di atas lutut baginda dan mentitiskan air liurnya ke dalam mulutnya serta mengkafankan beliau dengan baju baginda sendiri. Dan Allah SWT lebih mengetahui.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَأَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ وَاللَّفْظُ لِابْنِ أَبِي شَيْبَةَ قَالَ ابْنُ عَبْدَةَ أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرٍو أَنَّهُ سَمِعَ جَابِرًا يَقُولُ أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْرَ عَبْدِ اللَّهِ بْنِ أُبَيٍّ فَأَخْرَجَهُ مِنْ قَبْرِهِ فَوَضَعَهُ عَلَى رُكْبَتَيْهِ وَنَفَثَ عَلَيْهِ مِنْ رِيقِهِ وَأَلْبَسَهُ قَمِيصَهُ فَاللَّهُ أَعْلَمُ"
      },
      {
        "id": 14587,
        "hadith_number": "7026",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah ﷺ Menziarahi Kubur Abdullah bin Ubayy",
        "perawi_melayu": "Jabir bin Abdullah",
        "english_text": "Jabir b. 'Abdullah reported that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came to the grave of 'Abdullah b. Ubayy as he was placed in that. The rest of the hadith is the same.",
        "malay_translation": "Jabir bin Abdullah meriwayatkan bahawa Rasulullah ﷺ telah datang ke kubur Abdullah bin Ubayy ketika jenazahnya sedang dikebumikan. Baki riwayat hadis adalah sama.",
        "arabic_text": "حَدَّثَنِي أَحْمَدُ بْنُ يُوسُفَ الْأَزْدِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ جَاءَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى عَبْدِ اللَّهِ بْنِ أُبَيٍّ بَعْدَ مَا أُدْخِلَ حُفْرَتَهُ فَذَكَرَ بِمِثْلِ حَدِيثِ سُفْيَانَ"
      },
      {
        "id": 14588,
        "hadith_number": "7027",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Solat Jenazah untuk Abdullah bin Ubayy",
        "perawi_melayu": "Ibn Umar",
        "english_text": "Ibn 'Umar reported that when 'Abdullah b. Ubayy b. Salul died. His son 'Abdullah b. 'Abdullah (b. Ubayy) came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and begged him that he should give him his shirt which he would use as a coffin for his father, he gave him that. He then begged that he should conduct funeral prayer for him. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had hardly got up to observe the prayer for him that 'Umar stood up and caught hold of the garment of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said: Allah's Messenger, are you going to conduct prayer for this man, whereas Allah has forbidden you to offer prayer for him? Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Allah has given me an option as He has said: You may beg pardon for them or you may not beg pardon for them, and even if you beg pardon for them, seventy times (ix. 80), and I am going to make an addition to the seventy. He was a hypocrite and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) offered prayer for him and Allah, the Exalted and Glorious, revealed this verse: Do not offer prayer for any one of them at all and do not stand upon their graves for (offering prayer over them) (ix. 84).",
        "malay_translation": "Ibn Umar meriwayatkan bahawa apabila Abdullah bin Ubayy bin Salul meninggal dunia, anaknya Abdullah bin Abdullah (bin Ubayy) datang kepada Rasulullah ﷺ dan merayu agar baginda memberikan baju baginda untuk digunakan sebagai kafan bagi bapanya. Baginda memberikannya. Kemudian dia merayu agar baginda mengetuai solat jenazah untuknya. Rasulullah ﷺ baru sahaja hendak memulakan solat untuknya, Umar bangun dan memegang jubah Rasulullah ﷺ lalu berkata: “Wahai Rasulullah, adakah tuan akan mengetuai solat untuk lelaki ini, sedangkan Allah telah melarang tuan daripada melakukan solat untuknya?”  Lalu Rasulullah ﷺ bersabda: “Allah telah memberi aku pilihan sepertimana firman-Nya: Kamu boleh memohon keampunan bagi mereka atau kamu tidak perlu memohon keampunan bagi mereka, dan walaupun kamu memohon keampunan bagi mereka sebanyak tujuh puluh kali (Surah At-Taubah: 80), dan aku akan menambah kepada tujuh puluh itu.” Dia adalah seorang munafik dan Rasulullah ﷺ mengetuai solat jenazah untuknya, dan Allah SWT menurunkan ayat ini: “Janganlah kamu solatkan sesiapa pun daripada mereka dan janganlah kamu berdiri di atas kubur mereka (untuk solat)” (Surah At-Taubah: 84).",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ لَمَّا تُوُفِّيَ عَبْدُ اللَّهِ بْنُ أُبَيٍّ ابْنُ سَلُولَ جَاءَ ابْنُهُ عَبْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ أَنْ يُعْطِيَهُ قَمِيصَهُ يُكَفِّنُ فِيهِ أَبَاهُ فَأَعْطَاهُ ثُمَّ سَأَلَهُ أَنْ يُصَلِّيَ عَلَيْهِ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيُصَلِّيَ عَلَيْهِ فَقَامَ عُمَرُ فَأَخَذَ بِثَوْبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ أَتُصَلِّي عَلَيْهِ وَقَدْ نَهَاكَ اللَّهُ أَنْ تُصَلِّيَ عَلَيْهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا خَيَّرَنِي اللَّهُ فَقَالَ اسْتَغْفِرْ لَهُمْ أَوْ لَا تَسْتَغْفِرْ لَهُمْ إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً وَسَأَزِيدُهُ عَلَى سَبْعِينَ قَالَ إِنَّهُ مُنَافِقٌ فَصَلَّى عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ وَلَا تُصَلِّ عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا وَلَا تَقُمْ عَلَى قَبْرِهِ"
      },
      {
        "id": 14589,
        "hadith_number": "7028",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Meninggalkan Solat Jenazah",
        "perawi_melayu": "'Abdullah (rantaian perawi sama, dengan tambahan)",
        "english_text": "This hadith has been narrated on the authority of 'Abdullah with the same chain of transmitters but with this addition: He then abandoned offering (funeral) prayer for them.",
        "malay_translation": "Hadis ini diriwayatkan daripada Abdullah dengan sanad yang sama, tetapi dengan tambahan: Kemudian dia meninggalkan solat jenazah untuk mereka.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَا حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ عَنْ عُبَيْدِ اللَّهِ بِهَذَا الْإِسْنَادِ نَحْوَهُ وَزَادَ قَالَ فَتَرَكَ الصَّلَاةَ عَلَيْهِمْ"
      },
      {
        "id": 14590,
        "hadith_number": "7029",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Allah Maha Mendengar, Walau Bisikan",
        "perawi_melayu": "Ibn Mas'ud",
        "english_text": "Ibn Mas'ud reported that there gathered near the House three persons amongst whom two were Quraishi and one was a Thaqafi or two were Thaqafis and one was a Quraishi. They lacked understanding but wore more flesh. One of them said: Do you think that Allah hears as we speak? The other one said: He does hear when we speak loudly and He does not hear when we speak in undertones, and still the other one said: If He listens when we speak loudly, He also listens when we speak in undertones. It was on this occasion that this verse was revealed: You did not conceal yourselves lest your ears, your eyes and your skins would stand witness against you (xli. 22).",
        "malay_translation": "Ibn Mas'ud meriwayatkan bahawa berhimpun berdekatan Kaabah tiga orang, dua daripadanya adalah Quraisy dan seorang lagi adalah Thaqifi, atau dua orang Thaqifi dan seorang Quraisy. Mereka kurang ilmu, tetapi badannya berisi (sihat). Seorang dari mereka berkata: “Adakah kamu fikir Allah mendengar apa yang kita cakapkan?” Seorang lagi berkata: “Allah mendengar apabila kita berkata dengan suara yang kuat, tetapi tidak mendengar apabila kita berbisik.” Dan seorang lagi berkata: “Jika Dia mendengar apabila kita berkata dengan suara yang kuat, Dia juga mendengar apabila kita berbisik.” Pada ketika itulah ayat ini diturunkan:  “Kamu tidak menyembunyikan dirimu, sehingga pendengaranmu, penglihatanmu, dan kulitmu menjadi saksi terhadapmu.” (Fussilat: 22).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ عَنْ أَبِي مَعْمَرٍ عَنْ ابْنِ مَسْعُودٍ قَالَ اجْتَمَعَ عِنْدَ الْبَيْتِ ثَلَاثَةُ نَفَرٍ قُرَشِيَّانِ وَثَقَفِيٌّ أَوْ ثَقَفِيَّانِ وَقُرَشِيٌّ قَلِيلٌ فِقْهُ قُلُوبِهِمْ كَثِيرٌ شَحْمُ بُطُونِهِمْ فَقَالَ أَحَدُهُمْ أَتُرَوْنَ اللَّهَ يَسْمَعُ مَا نَقُولُ وَقَالَ الْآخَرُ يَسْمَعُ إِنْ جَهَرْنَا وَلَا يَسْمَعُ إِنْ أَخْفَيْنَا وَقَالَ الْآخَرُ إِنْ كَانَ يَسْمَعُ إِذَا جَهَرْنَا فَهُوَ يَسْمَعُ إِذَا أَخْفَيْنَا فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ وَمَا كُنْتُمْ تَسْتَتِرُونَ أَنْ يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَلَا أَبْصَارُكُمْ وَلَا جُلُودُكُمْ الْآيَةَ"
      },
      {
        "id": 14591,
        "hadith_number": "7030",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Sanad Hadith daripada Abdullah",
        "perawi_melayu": "'Abdullah melalui beberapa perawi lain.",
        "english_text": "This hadith has been narrated on the authority of 'Abdullah through another chain of transmitters.",
        "malay_translation": "Hadis ini diriwayatkan daripada Abdullah melalui sanad yang lain.",
        "arabic_text": "و حَدَّثَنِي أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ حَدَّثَنَا سُفْيَانُ حَدَّثَنِي سُلَيْمَانُ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ وَهْبِ بْنِ رَبِيعَةَ عَنْ عَبْدِ اللَّهِ ح و قَالَ حَدَّثَنَا يَحْيَى حَدَّثَنَا سُفْيَانُ حَدَّثَنِي مَنْصُورٌ عَنْ مُجَاهِدٍ عَنْ أَبِي مَعْمَرٍ عَنْ عَبْدِ اللَّهِ بِنَحْوِهِ"
      },
      {
        "id": 14592,
        "hadith_number": "7031",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perpecahan di Uhud dan Ayat yang Diturunkan",
        "perawi_melayu": "Zaid bin Thabit",
        "english_text": "Zaid b. Thabit reported that Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) set out for Uhud. Some of those persons who were with them came back. The Companions of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) were divided in two groups. One group said: We would kill them, and the other one said: No, this should not be done, and it was on this occasion that this verse was revealed: Why should you, then, be two parties in relation to hypocrites? (iv. 88).",
        "malay_translation": "Zaid bin Thabit meriwayatkan bahawa Rasulullah ﷺ berangkat ke Uhud. Sebahagian daripada mereka yang bersama baginda kembali. Sahabat-sahabat Rasulullah ﷺ terbahagi kepada dua kumpulan. Satu kumpulan berkata: “Kita akan membunuh mereka”, dan kumpulan yang lain berkata: “Tidak, ini tidak sepatutnya dilakukan”, dan pada ketika itulah ayat ini diturunkan: “Mengapa kamu menjadi dua golongan mengenai orang-orang munafik?” (Surah an-Nisa’, 4:88).",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ عَدِيٍّ وَهُوَ ابْنُ ثَابِتٍ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ يَزِيدَ يُحَدِّثُ عَنْ زَيْدِ بْنِ ثَابِتٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ إِلَى أُحُدٍ فَرَجَعَ نَاسٌ مِمَّنْ كَانَ مَعَهُ فَكَانَ أَصْحَابُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهِمْ فِرْقَتَيْنِ قَالَ بَعْضُهُمْ نَقْتُلُهُمْ وَقَالَ بَعْضُهُمْ لَا فَنَزَلَتْ فَمَا لَكُمْ فِي الْمُنَافِقِينَ فِئَتَيْنِ"
      },
      {
        "id": 14593,
        "hadith_number": "7032",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Sanad Hadith daripada Syu'ba",
        "perawi_melayu": "Syu'ba",
        "english_text": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters.",
        "malay_translation": "Hadis ini diriwayatkan daripada Syu'ba dengan sanad yang sama.",
        "arabic_text": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ ح و حَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ حَدَّثَنَا غُنْدَرٌ كِلَاهُمَا عَنْ شُعْبَةَ بِهَذَا الْإِسْنَادِ نَحْوَهُ"
      },
      {
        "id": 14594,
        "hadith_number": "7033",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Munafik dan Perang:  Sifat Orang Munafik Ketika Rasulullah SAW Pergi Perang",
        "perawi_melayu": "Abu Sa'id Khudri",
        "english_text": "Abu Sa'id Khudri reported that during the lifetime of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) the hypocrites behaved in this way that when Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) set out for a battle, they kept themselves behind, and they became happy that they had managed to sit in the house contrary to (the act of) Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and when Allah's Apostle (may peace he upon him) came back, they put forward excuses and took oath and wished that people should laud them for the deeds which they had not done. It was on this occasion that this verse was revealed: Think not that those who exult in what they have done, and love to be praised for what they have not done-think not them to be safe from the chastisement; and for them is a painful chastisement (iii. 18).",
        "malay_translation": "Abu Sa'id Khudri meriwayatkan bahawa pada zaman Rasulullah SAW, orang-orang munafik bersikap sedemikian rupa: apabila Rasulullah SAW berangkat berperang, mereka tinggal di belakang, dan mereka gembira kerana dapat duduk di rumah berlawanan dengan tindakan Rasulullah SAW.  Apabila Rasulullah SAW kembali, mereka membuat pelbagai alasan, bersumpah, dan menginginkan pujian daripada orang ramai atas perbuatan yang sebenarnya tidak mereka lakukan.  Pada ketika itulah ayat ini diturunkan:  “Janganlah kamu menyangka bahawa orang-orang yang bergembira dengan apa yang telah mereka kerjakan, dan mereka suka dipuji dengan apa yang tidak mereka kerjakan, menyangka bahawa mereka selamat daripada azab; dan bagi mereka azab yang pedih.” (Ali Imran: 18).",
        "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ وَمُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ قَالَا حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ أَخْبَرَنِي زَيْدُ بْنُ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ رِجَالًا مِنْ الْمُنَافِقِينَ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانُوا إِذَا خَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْغَزْوِ تَخَلَّفُوا عَنْهُ وَفَرِحُوا بِمَقْعَدِهِمْ خِلَافَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا قَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اعْتَذَرُوا إِلَيْهِ وَحَلَفُوا وَأَحَبُّوا أَنْ يُحْمَدُوا بِمَا لَمْ يَفْعَلُوا فَنَزَلَتْ لَا تَحْسَبَنَّ الَّذِينَ يَفْرَحُونَ بِمَا أَتَوْا وَيُحِبُّونَ أَنْ يُحْمَدُوا بِمَا لَمْ يَفْعَلُوا فَلَا تَحْسَبَنَّهُمْ بِمَفَازَةٍ مِنْ الْعَذَابِ"
      },
      {
        "id": 14595,
        "hadith_number": "7034",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kegembiraan Atas Amalan dan Pujian Tanpa Kebenaran",
        "perawi_melayu": "Humaid b. 'Abd al-Rahman b. 'Auf",
        "english_text": "Humaid b. 'Abd al-Rahman b. 'Auf reported that Marwan said to Rafi', his chamberlain, that he should go to Ibn 'Abbas and ask him: If every one of us be punished for his being happy upon his deed and for his being praised for what he has not done, nobody would be saved from the torment. Ibn 'Abbas said: What you have to do with this verse? It has been in fact revealed in connection with the people of the Book. Then Ibn Abbas recited this verse: When Allah took a covenant from those who had been given the Book: You shall explain it to people and shall not conceal this (iii. 186), and then Ibn 'Abbas recited this verse: Think not that those who exult in what they have done and love to be praised for what they have not done (iii. 186). Ibn 'Abbas (further) said: Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) asked them about something and then they concealed that and they told him something else and they went out and they thought that they had informed him as lie had asked them and they felt happy of what they had concealed.",
        "malay_translation": "Humaid bin Abd al-Rahman bin Auf meriwayatkan bahawa Marwan berkata kepada Rafi', sida-sidanya, supaya pergi kepada Ibnu Abbas dan bertanya kepadanya: Jika setiap seorang daripada kita dihukum kerana gembira dengan perbuatannya dan kerana dipuji atas apa yang tidak dilakukannya, tiada seorang pun akan terselamat daripada azab. Ibnu Abbas berkata: Apakah kaitan ayat ini denganmu? Ia sebenarnya diturunkan berkaitan dengan Ahli Kitab. Kemudian Ibnu Abbas membaca ayat ini: \"Apabila Allah mengambil perjanjian daripada orang-orang yang diberi Kitab: Kamu hendaklah menerangkannya kepada manusia dan janganlah kamu menyembunyikannya (3:186)\", dan kemudian Ibnu Abbas membaca ayat ini: \"Janganlah kamu menyangka bahawa orang-orang yang bergembira dengan apa yang telah mereka lakukan dan suka dipuji atas apa yang tidak mereka lakukan (3:186)\". Ibnu Abbas (lagi) berkata: Rasulullah ﷺ bertanya kepada mereka tentang sesuatu, kemudian mereka menyembunyikannya dan memberitahu baginda sesuatu yang lain, dan mereka keluar dengan menyangka bahawa mereka telah memberitahu baginda seperti yang ditanyakan, lalu mereka berasa gembira dengan apa yang telah mereka sembunyikan.",
        "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَهَارُونُ بْنُ عَبْدِ اللَّهِ وَاللَّفْظُ لِزُهَيْرٍ قَالَا حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ أَنَّ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَخْبَرَهُ أَنَّ مَرْوَانَ قَالَ اذْهَبْ يَا رَافِعُ لِبَوَّابِهِ إِلَى ابْنِ عَبَّاسٍ فَقُلْ لَئِنْ كَانَ كُلُّ امْرِئٍ مِنَّا فَرِحَ بِمَا أَتَى وَأَحَبَّ أَنْ يُحْمَدَ بِمَا لَمْ يَفْعَلْ مُعَذَّبًا لَنُعَذَّبَنَّ أَجْمَعُونَ فَقَالَ ابْنُ عَبَّاسٍ مَا لَكُمْ وَلِهَذِهِ الْآيَةِ إِنَّمَا أُنْزِلَتْ هَذِهِ الْآيَةُ فِي أَهْلِ الْكِتَابِ ثُمَّ تَلَا ابْنُ عَبَّاسٍ وَإِذْ أَخَذَ اللَّهُ مِيثَاقَ الَّذِينَ أُوتُوا الْكِتَابَ لَتُبَيِّنُنَّهُ لِلنَّاسِ وَلَا تَكْتُمُونَهُ هَذِهِ الْآيَةَ وَتَلَا ابْنُ عَبَّاسٍ لَا تَحْسَبَنَّ الَّذِينَ يَفْرَحُونَ بِمَا أَتَوْا وَيُحِبُّونَ أَنْ يُحْمَدُوا بِمَا لَمْ يَفْعَلُوا وَقَالَ ابْنُ عَبَّاسٍ سَأَلَهُمْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ شَيْءٍ فَكَتَمُوهُ إِيَّاهُ وَأَخْبَرُوهُ بِغَيْرِهِ فَخَرَجُوا قَدْ أَرَوْهُ أَنْ قَدْ أَخْبَرُوهُ بِمَا سَأَلَهُمْ عَنْهُ وَاسْتَحْمَدُوا بِذَلِكَ إِلَيْهِ وَفَرِحُوا بِمَا أَتَوْا مِنْ كِتْمَانِهِمْ إِيَّاهُ مَا سَأَلَهُمْ عَنْهُ"
      },
      {
        "id": 14596,
        "hadith_number": "7035",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pendapat Ammar ibn Yasir tentang Pihak yang Disokongnya",
        "perawi_melayu": "Qais",
        "english_text": "Qais reported: I said to 'Ammar: What is your opinion about that which you have done in case (of your siding with Hadrat 'Ali)? Is it your personal opinion or something you got from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ )? 'Ammar said: We have got nothing from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) which people at large did not get, but Hudhaifa told me that Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had especially told him amongst his Companion, that there would be twelve hypocrites out of whom eight would not get into Paradise, until a camel would be able to pass through the needle hole. The ulcer would be itself sufficient (to kill) eight. So far as four are concerned, I do not remember what Shu'ba said about them.",
        "malay_translation": "Qais meriwayatkan: Aku berkata kepada Ammar: Apakah pendapatmu tentang apa yang telah kamu lakukan (dengan menyokong Hadrat Ali)? Adakah ia pendapat peribadimu atau sesuatu yang kamu perolehi daripada Rasulullah SAW? Ammar berkata: Kami tidak mendapat apa-apa daripada Rasulullah SAW yang tidak diperolehi oleh orang ramai, tetapi Hudzaifah memberitahuku bahawa Rasulullah SAW telah memberitahu kepadanya secara khusus di kalangan para sahabatnya, bahawa akan ada dua belas orang munafik, lapan daripadanya tidak akan masuk syurga sehingga unta dapat melalui lubang jarum. Penyakit itu sendiri sudah memadai (untuk membunuh) lapan orang.  Bagi empat orang lagi, aku tidak ingat apa yang Shu'bah katakan tentang mereka.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا شُعْبَةُ بْنُ الْحَجَّاجِ عَنْ قَتَادَةَ عَنْ أَبِي نَضْرَةَ عَنْ قَيْسٍ قَالَ قُلْتُ لِعَمَّارٍ أَرَأَيْتُمْ صَنِيعَكُمْ هَذَا الَّذِي صَنَعْتُمْ فِي أَمْرِ عَلِيٍّ أَرَأْيًا رَأَيْتُمُوهُ أَوْ شَيْئًا عَهِدَهُ إِلَيْكُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا عَهِدَ إِلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا لَمْ يَعْهَدْهُ إِلَى النَّاسِ كَافَّةً وَلَكِنْ حُذَيْفَةُ أَخْبَرَنِي عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَصْحَابِي اثْنَا عَشَرَ مُنَافِقًا فِيهِمْ ثَمَانِيَةٌ لَا يَدْخُلُونَ الْجَنَّةَ حَتَّى يَلِجَ الْجَمَلُ فِي سَمِّ الْخِيَاطِ ثَمَانِيَةٌ مِنْهُمْ تَكْفِيكَهُمُ الدُّبَيْلَةُ وَأَرْبَعَةٌ لَمْ أَحْفَظْ مَا قَالَ شُعْبَةُ فِيهِمْ"
      },
      {
        "id": 14597,
        "hadith_number": "7036",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perihal Munafik di dalam Ummah Nabi",
        "perawi_melayu": "Qais bin Ubad",
        "english_text": "Qais b. 'Ubad reported: We said to 'Ammar: Was your fighting (on the side of 'Ali in the Battle of Siffin) a matter of your own choice or you got its hints from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) for it, is likely for one to err in one's own discretion or was it because of any covenant that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) got from you? He said: It was not because of any covenant that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) got from us which he did get from other people, and he further said that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: In my Ummah. And I think that Hudhaifa reported to me and according to Ghundar (the words are) that he said: In my Ummah, there would be twelve hypocrites and they would not be admitted to Paradise and they would not smell its odour, until the camel would pass through a needle's hole. Dubaila (ulcer) would be enough to (torment them) -a kind of flame of Fire which would appear in their shoulders and it would protrude from their chest.",
        "malay_translation": "Qais bin Ubad meriwayatkan: Kami bertanya kepada Ammar: Adakah peperangan kamu (di pihak Ali dalam Perang Siffin) atas pilihan kamu sendiri atau kamu mendapat petunjuk daripada Rasulullah SAW, kerana seseorang itu mudah tersilap dalam membuat keputusan sendiri, atau adakah ia disebabkan oleh sebarang perjanjian yang Rasulullah SAW telah ambil daripada kamu? Dia berkata: Ia bukanlah disebabkan oleh sebarang perjanjian yang Rasulullah SAW telah ambil daripada kami, yang mana baginda juga telah mengambilnya daripada orang lain, dan beliau selanjutnya berkata bahawa Rasulullah SAW bersabda: Di dalam umatku. Dan saya fikir Hudhaifah telah memberitahu saya dan menurut Ghundar (kata-katanya ialah) bahawa beliau berkata: Di dalam umatku, akan ada dua belas orang munafik dan mereka tidak akan dimasukkan ke dalam syurga dan mereka tidak akan dapat menghidu baunya, sehingga unta dapat melalui lubang jarum.  Dubaila (bisul) sudah memadai untuk (menyeksa mereka) - sejenis api neraka yang akan muncul di bahu mereka dan akan menonjol dari dada mereka.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ وَاللَّفْظُ لِابْنِ الْمُثَنَّى قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَبِي نَضْرَةَ عَنْ قَيْسِ بْنِ عُبَادٍ قَالَ قُلْنَا لِعَمَّارٍ أَرَأَيْتَ قِتَالَكُمْ أَرَأْيًا رَأَيْتُمُوهُ فَإِنَّ الرَّأْيَ يُخْطِئُ وَيُصِيبُ أَوْ عَهْدًا عَهِدَهُ إِلَيْكُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا عَهِدَ إِلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا لَمْ يَعْهَدْهُ إِلَى النَّاسِ كَافَّةً وَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ فِي أُمَّتِي قَالَ شُعْبَةُ وَأَحْسِبُهُ قَالَ حَدَّثَنِي حُذَيْفَةُ وَقَالَ غُنْدَرٌ أُرَاهُ قَالَ فِي أُمَّتِي اثْنَا عَشَرَ مُنَافِقًا لَا يَدْخُلُونَ الْجَنَّةَ وَلَا يَجِدُونَ رِيحَهَا حَتَّى يَلِجَ الْجَمَلُ فِي سَمِّ الْخِيَاطِ ثَمَانِيَةٌ مِنْهُمْ تَكْفِيكَهُمُ الدُّبَيْلَةُ سِرَاجٌ مِنْ النَّارِ يَظْهَرُ فِي أَكْتَافِهِمْ حَتَّى يَنْجُمَ مِنْ صُدُورِهِمْ"
      },
      {
        "id": 14598,
        "hadith_number": "7037",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perselisihan di Aqabah dan Azab Orang Mendahului Rasulullah",
        "perawi_melayu": "Abu Tufail",
        "english_text": "Abu Tufail reported that there was a dispute between Hudhaifa and one from the people of Aqaba as it happens amongst people. He said: I adjure you by Allah to tell me as to how many people from Aqaba were. The people said to him (Hudhaifa) to inform him as he had asked. We have been informed that they were fourteen and If you are to be counted amongst them, then they would be fifteen and I state by Allah that twelve amongst them were the enemies of Allah and of His Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in this world. The rest of the three put forward this excuse: We did not hear the announcement of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and we were not aware of the intention of the people as he (the Holy Prophet) had been in the hot atmosphere. He (the Holy Prophet) then said: The water is small in quantity (at the next station). So nobody should go ahead of me, but he found people who had gone ahead of him and he cursed them on that day.",
        "malay_translation": "Abu Tufail meriwayatkan bahawa berlaku perselisihan faham antara Hudhaifah dan seorang daripada penduduk Aqabah, sepertimana yang biasa berlaku di kalangan manusia.  Beliau berkata: Aku bersumpah atas nama Allah untuk memberitahu aku berapa ramai penduduk Aqabah itu.  Orang ramai memberitahu Hudhaifah seperti yang diminta. Kami telah dimaklumkan bahawa mereka berempat belas orang, dan jika kamu dikira bersama mereka, maka jumlah mereka menjadi lima belas. Aku bersumpah demi Allah bahawa dua belas daripada mereka adalah musuh-musuh Allah dan Rasul-Nya (ﷺ) di dunia ini.  Tiga orang yang lain memberi alasan: Kami tidak mendengar pengumuman daripada Rasulullah (ﷺ) dan kami tidak menyedari niat orang ramai kerana baginda berada dalam suasana yang panas. Baginda (Rasulullah) kemudiannya bersabda: Air di tempat persinggahan seterusnya sedikit kuantitinya. Oleh itu, tiada sesiapa yang harus mendahului aku. Tetapi baginda mendapati orang ramai telah mendahului baginda, lalu baginda melaknat mereka pada hari itu.",
        "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا أَبُو أَحْمَدَ الْكُوفِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ جُمَيْعٍ حَدَّثَنَا أَبُو الطُّفَيْلِ قَالَ كَانَ بَيْنَ رَجُلٍ مِنْ أَهْلِ الْعَقَبَةِ وَبَيْنَ حُذَيْفَةَ بَعْضُ مَا يَكُونُ بَيْنَ النَّاسِ فَقَالَ أَنْشُدُكَ بِاللَّهِ كَمْ كَانَ أَصْحَابُ الْعَقَبَةِ قَالَ فَقَالَ لَهُ الْقَوْمُ أَخْبِرْهُ إِذْ سَأَلَكَ قَالَ كُنَّا نُخْبَرُ أَنَّهُمْ أَرْبَعَةَ عَشَرَ فَإِنْ كُنْتَ مِنْهُمْ فَقَدْ كَانَ الْقَوْمُ خَمْسَةَ عَشَرَ وَأَشْهَدُ بِاللَّهِ أَنَّ اثْنَيْ عَشَرَ مِنْهُمْ حَرْبٌ لِلَّهِ وَلِرَسُولِهِ فِي الْحَيَاةِ الدُّنْيَا وَيَوْمَ يَقُومُ الْأَشْهَادُ وَعَذَرَ ثَلَاثَةً قَالُوا مَا سَمِعْنَا مُنَادِيَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا عَلِمْنَا بِمَا أَرَادَ الْقَوْمُ وَقَدْ كَانَ فِي حَرَّةٍ فَمَشَى فَقَالَ إِنَّ الْمَاءَ قَلِيلٌ فَلَا يَسْبِقْنِي إِلَيْهِ أَحَدٌ فَوَجَدَ قَوْمًا قَدْ سَبَقُوهُ فَلَعَنَهُمْ يَوْمَئِذٍ"
      },
      {
        "id": 14599,
        "hadith_number": "7038",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pengampunan Dosa di Bukit Murar",
        "perawi_melayu": "Jabir bin Abdullah",
        "english_text": "Jabir b. Abdullah reported that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: He who climbed this hill, the hill of Murar, his sins would be obliterated as were obliterated the sins of Bani Isra'il. So the first to take their horses were the people of Banu Khazraj. Then there was a ceaseless flow of persons and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to them: All of you are those who have been pardoned except the owner of a red camel. We came to him and said to him: You also come on, so that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) may seek forgiveness for you. But he said: By Allah, so far as I am concerned, the finding of something lost is dearer to me than seeking of forgiveness for me by your companion (the Holy Prophet), and he remained busy in finding out his lost thing.",
        "malay_translation": "Jabir bin Abdullah meriwayatkan bahawa Rasulullah SAW bersabda: Sesiapa yang mendaki bukit ini, iaitu Bukit Murar, nescaya dosanya akan dihapuskan sebagaimana dihapuskan dosa-dosa Bani Israil. Maka orang-orang Bani Khazraj adalah yang pertama menaiki kuda mereka. Kemudian berduyun-duyun manusia datang dan Rasulullah SAW bersabda kepada mereka: Kamu semua telah diampunkan kecuali pemilik unta merah itu. Kami mendatanginya dan berkata kepadanya: Datanglah juga supaya Rasulullah SAW memohon keampunan untukmu. Tetapi dia berkata: Demi Allah, bagi saya, menjumpai sesuatu yang hilang lebih berharga daripada memohon keampunan daripada sahabatmu (Nabi Muhammad SAW), dan dia terus sibuk mencari barangnya yang hilang.",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ يَصْعَدُ الثَّنِيَّةَ ثَنِيَّةَ الْمُرَارِ فَإِنَّهُ يُحَطُّ عَنْهُ مَا حُطَّ عَنْ بَنِي إِسْرَائِيلَ قَالَ فَكَانَ أَوَّلَ مَنْ صَعِدَهَا خَيْلُنَا خَيْلُ بَنِي الْخَزْرَجِ ثُمَّ تَتَامَّ النَّاسُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكُلُّكُمْ مَغْفُورٌ لَهُ إِلَّا صَاحِبَ الْجَمَلِ الْأَحْمَرِ فَأَتَيْنَاهُ فَقُلْنَا لَهُ تَعَالَ يَسْتَغْفِرْ لَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ وَاللَّهِ لَأَنْ أَجِدَ ضَالَّتِي أَحَبُّ إِلَيَّ مِنْ أَنْ يَسْتَغْفِرَ لِي صَاحِبُكُمْ قَالَ وَكَانَ رَجُلٌ يَنْشُدُ ضَالَّةً لَهُ"
      },
      {
        "id": 14600,
        "hadith_number": "7039",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Mengenai Orang yang Mendaki Bukit Murar",
        "perawi_melayu": "Jabir bin Abdullah",
        "english_text": "Jabir b. Abdullah reported Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: He who would climb this hill of Murar. The rest of the hadith is the same but with this variation that it was a desert Arab who was finding out his lost thing.",
        "malay_translation": "Jabir bin Abdullah meriwayatkan bahawa Rasulullah SAW bersabda: Sesiapa yang mendaki bukit Murar ini.  Baki hadis adalah sama, tetapi dengan variasi bahawa ia adalah seorang Arab Badwi yang sedang mencari barangnya yang hilang.",
        "arabic_text": "و حَدَّثَنَاه يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا قُرَّةُ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ يَصْعَدُ ثَنِيَّةَ الْمُرَارِ أَوْ الْمَرَارِ بِمِثْلِ حَدِيثِ مُعَاذٍ غَيْرَ أَنَّهُ قَالَ وَإِذَا هُوَ أَعْرَابِيٌّ جَاءَ يَنْشُدُ ضَالَّةً لَهُ"
      },
      {
        "id": 14601,
        "hadith_number": "7040",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Seorang Ahli Kitab yang Murtad",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "Anas b. Malik reported: There was a person amongst us who belonged to the tribe of Bani Najjar and he recited Sura al-Baqarah and Surat Al-i-'Imran and he used to transcribe for Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). He ran away as a rebel and joined the People of the Book. They gave it much importance and said: He is the person who used to transcribe for Muhammad and they were much pleased with him. Time rolled on that Allah caused his death. They dug the grave and buried him therein, but they found to their surprise that the earth had thrown him out over the surface. They again dug the grave for him and buried him but the earth again threw him out upon the surface. They again dug the grave for him and buried him but the earth again threw him out upon the surface. At last they left him unburied.",
        "malay_translation": "Anas bin Malik meriwayatkan:  Di kalangan kami ada seorang lelaki daripada kabilah Bani Najjar yang menghafaz Surah al-Baqarah dan Surah Ali Imran, dan dia pernah menyalin wahyu untuk Rasulullah SAW. Dia lari sebagai seorang pemberontak dan menyertai Ahli Kitab. Mereka amat menghargai dan berkata, \"Dia adalah orang yang pernah menyalin wahyu untuk Muhammad,\" dan mereka amat gembira dengannya. Kemudian, Allah SWT menjemputnya ke rahmatullah. Mereka menggali kubur dan mengkebumikannya, tetapi hairanlah mereka apabila bumi menolaknya ke permukaan. Mereka sekali lagi menggali kubur dan mengkebumikannya, tetapi bumi sekali lagi menolaknya ke permukaan. Mereka sekali lagi menggali kubur dan mengkebumikannya, tetapi bumi sekali lagi menolaknya ke permukaan. Akhirnya, mereka meninggalkannya tanpa dikebumikan.",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا سُلَيْمَانُ وَهُوَ ابْنُ الْمُغِيرَةِ عَنْ ثَابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ مِنَّا رَجُلٌ مِنْ بَنِي النَّجَّارِ قَدْ قَرَأَ الْبَقَرَةَ وَآلَ عِمْرَانَ وَكَانَ يَكْتُبُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَانْطَلَقَ هَارِبًا حَتَّى لَحِقَ بِأَهْلِ الْكِتَابِ قَالَ فَرَفَعُوهُ قَالُوا هَذَا قَدْ كَانَ يَكْتُبُ لِمُحَمَّدٍ فَأُعْجِبُوا بِهِ فَمَا لَبِثَ أَنْ قَصَمَ اللَّهُ عُنُقَهُ فِيهِمْ فَحَفَرُوا لَهُ فَوَارَوْهُ فَأَصْبَحَتْ الْأَرْضُ قَدْ نَبَذَتْهُ عَلَى وَجْهِهَا ثُمَّ عَادُوا فَحَفَرُوا لَهُ فَوَارَوْهُ فَأَصْبَحَتْ الْأَرْضُ قَدْ نَبَذَتْهُ عَلَى وَجْهِهَا ثُمَّ عَادُوا فَحَفَرُوا لَهُ فَوَارَوْهُ فَأَصْبَحَتْ الْأَرْضُ قَدْ نَبَذَتْهُ عَلَى وَجْهِهَا فَتَرَكُوهُ مَنْبُوذًا"
      },
      {
        "id": 14602,
        "hadith_number": "7041",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Angin Kencang dan Kematian Seorang Munafik",
        "perawi_melayu": "Jabir",
        "english_text": "Jabir reported that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came back from a journey and as he was near Medina, there was such a violent gale that the mountain seemed to be pressed. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: This wind has perhaps been made to blow for the death of a hypocrite, and as he reached Medina a notorious hypocrite from amongst the hypocrites had died.",
        "malay_translation": "Jabir meriwayatkan bahawa Rasulullah SAW  kembali dari suatu perjalanan dan ketika baginda hampir sampai ke Madinah, tiupan angin ribut yang sangat kuat sehingga gunung seolah-olah terhimpit. Rasulullah SAW bersabda: Angin ini mungkin ditiupkan kerana kematian seorang munafik, dan setelah baginda sampai ke Madinah, seorang munafik yang terkenal di kalangan kaum munafik telah meninggal dunia.",
        "arabic_text": "حَدَّثَنِي أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا حَفْصٌ يَعْنِي ابْنَ غِيَاثٍ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدِمَ مِنْ سَفَرٍ فَلَمَّا كَانَ قُرْبَ الْمَدِينَةِ هَاجَتْ رِيحٌ شَدِيدَةٌ تَكَادُ أَنْ تَدْفِنَ الرَّاكِبَ فَزَعَمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بُعِثَتْ هَذِهِ الرِّيحُ لِمَوْتِ مُنَافِقٍ فَلَمَّا قَدِمَ الْمَدِينَةَ فَإِذَا مُنَافِقٌ عَظِيمٌ مِنْ الْمُنَافِقِينَ قَدْ مَاتَ"
      },
      {
        "id": 14603,
        "hadith_number": "7042",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Demam yang Lebih Berat pada Hari Kiamat",
        "perawi_melayu": "Iyas (daripada bapanya)",
        "english_text": "Iyas reported on the authority of his father: We went along with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) to visit a person suffering from fever. When I placed my hand upon him, I said: By Allah, I have never seen, till this day, a person running higher temperature than he. Thereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), turning his face to his companions, said: May I not inform you of a severer temperature than this which these two persons would run on the Day of Resurrection? And they were two hypocrites riding upon the camel turning their back towards (the Muslims).",
        "malay_translation": "Iyas meriwayatkan daripada bapanya: Kami pergi bersama Rasulullah ﷺ melawat seseorang yang demam. Apabila aku meletakkan tanganku ke atasnya, aku berkata: Demi Allah, aku tidak pernah melihat, sehingga hari ini, seseorang yang mengalami suhu badan lebih tinggi darinya.  Lalu Rasulullah ﷺ, sambil menghadapkan wajahnya kepada para sahabat, bersabda:  Patutkah aku tidak memberitahu kamu tentang suhu yang lebih teruk daripada ini yang akan dialami oleh dua orang ini pada Hari Kiamat? Dan mereka adalah dua orang munafik yang menunggang unta sambil membelakangkan (umat Islam).",
        "arabic_text": "حَدَّثَنِي عَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ حَدَّثَنَا أَبُو مُحَمَّدٍ النَّضْرُ بْنُ مُحَمَّدِ بْنِ مُوسَى الْيَمَامِيُّ حَدَّثَنَا عِكْرِمَةُ حَدَّثَنَا إِيَاسٌ حَدَّثَنِي أَبِي قَالَ عُدْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا مَوْعُوكًا قَالَ فَوَضَعْتُ يَدِي عَلَيْهِ فَقُلْتُ وَاللَّهِ مَا رَأَيْتُ كَالْيَوْمِ رَجُلًا أَشَدَّ حَرًّا فَقَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا أُخْبِرُكُمْ بِأَشَدَّ حَرًّا مِنْهُ يَوْمَ الْقِيَامَةِ هَذَيْنِكَ الرَّجُلَيْنِ الرَّاكِبَيْنِ الْمُقَفِّيَيْنِ لِرَجُلَيْنِ حِينَئِذٍ مِنْ أَصْحَابِهِ"
      },
      {
        "id": 14604,
        "hadith_number": "7043",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perumpamaan Orang Munafik Seperti Kambing",
        "perawi_melayu": "Ibn Umar",
        "english_text": "Ibn Umar reported Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The similitude of a hypocrite is that of a sheep which roams aimlessly between two flocks. She goes to one at one time and to the other at another time.",
        "malay_translation": "Ibn Umar meriwayatkan bahawa Rasulullah SAW bersabda:  Perumpamaan orang munafik adalah seperti seekor kambing yang mengembara tanpa hala tuju di antara dua kumpulan.  Kadang-kadang ia pergi kepada kumpulan yang satu, dan kadang-kadang kepada kumpulan yang lain.",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ قَالَا حَدَّثَنَا عُبَيْدُ اللَّهِ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَاللَّفْظُ لَهُ أَخْبَرَنَا عَبْدُ الْوَهَّابِ يَعْنِي الثَّقَفِيَّ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَثَلُ الْمُنَافِقِ كَمَثَلِ الشَّاةِ الْعَائِرَةِ بَيْنَ الْغَنَمَيْنِ تَعِيرُ إِلَى هَذِهِ مَرَّةً وَإِلَى هَذِهِ مَرَّةً"
      },
      {
        "id": 14605,
        "hadith_number": "7044",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perempuan yang Mencari Jalan dalam Kumpulan Kambing",
        "perawi_melayu": "Ibn Umar",
        "english_text": "Ibn Umar reported Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) saying like this but with this change of words: She sometimes finds a way in one flock and then in another flock.",
        "malay_translation": "Ibn Umar meriwayatkan bahawa Rasulullah ﷺ bersabda (dengan sedikit perubahan lafaz):  Kadang-kadang dia (perempuan) mencari jalan di dalam satu kumpulan kambing, kemudian di dalam kumpulan kambing yang lain.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ تَكِرُّ فِي هَذِهِ مَرَّةً وَفِي هَذِهِ مَرَّةً"
      },
      {
        "id": 14606,
        "hadith_number": "7045",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Beban Amal Pada Hari Kiamat",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Huraira reported Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: A bulky person would be brought on the Day of judgment and he would not carry the weight to the eye of Allah equal even to that of a gnat. Nor shall We set up a balance for them on the Day of Resurrection (xviii. 105).",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:  Seorang yang besar tubuh badannya akan dibawa pada hari kiamat, dan amalnya tidak akan seberat nyamuk di sisi Allah.  Dan Kami tidak akan menyediakan timbangan bagi mereka pada hari kiamat.",
        "arabic_text": "حَدَّثَنِي أَبُو بَكْرِ بْنُ إِسْحَقَ حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ حَدَّثَنِي الْمُغِيرَةُ يَعْنِي الْحِزَامِيَّ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّهُ لَيَأْتِي الرَّجُلُ الْعَظِيمُ السَّمِينُ يَوْمَ الْقِيَامَةِ لَا يَزِنُ عِنْدَ اللَّهِ جَنَاحَ بَعُوضَةٍ اقْرَءُوا فَلَا نُقِيمُ لَهُمْ يَوْمَ الْقِيَامَةِ وَزْنًا"
      },
      {
        "id": 14607,
        "hadith_number": "7046",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Allah SWT Membawa Alam Semesta pada Hari Kiamat",
        "perawi_melayu": "Abdullah bin Mas'ud",
        "english_text": "Abdullah b. Mas'ud reported that a Jewish scholar came to Allah's Apostle (may peace he upon him) and said: Muhammad, or Abu al-Qasim, verily, Allah, the Exalted and Glorious would carry the Heavens on the Day of Judgment upon one finger and earths upon one finger and the mountains and trees upon one finger and the ocean and moist earth upon one finger, and in fact the whole of the creation upon one finger, and then He would stir them and say: I am your Lord, I am your Lord. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) smiled testifying what that scholar had said. He then recited this verse: And they honour not Allah with the honour due to Him; and the whole earth will be in His grip on the Day of Resurrection and the heaven rolled up in His right hand. Glory be to Him I and highly Exalted is He above what they associate (with Him) (Az-Zumar:67).",
        "malay_translation": "Abdullah bin Mas'ud meriwayatkan bahawa seorang ulama Yahudi datang kepada Rasulullah SAW dan berkata: Muhammad, atau Abu al-Qasim, sesungguhnya Allah SWT, Yang Maha Tinggi dan Maha Mulia, akan mengangkat langit pada Hari Kiamat di atas satu jari, dan bumi di atas satu jari, dan gunung-ganang serta pepohonan di atas satu jari, dan lautan serta tanah lembap di atas satu jari, dan sebenarnya seluruh makhluk di atas satu jari, kemudian Dia akan menggoncangkannya dan berfirman: Aku adalah Tuhan kamu, Aku adalah Tuhan kamu.  Maka Rasulullah SAW tersenyum, mengesahkan apa yang dikatakan oleh ulama tersebut.  Kemudian baginda membaca ayat ini:  Dan mereka tidak memuliakan Allah dengan kemuliaan yang semestinya; dan seluruh bumi akan berada dalam genggaman-Nya pada Hari Kiamat dan langit digulung di tangan kanan-Nya. Maha Suci Allah dan Maha Tinggi Dia daripada apa yang mereka sekutukan dengan-Nya (Az-Zumar: 67).",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ حَدَّثَنَا فُضَيْلٌ يَعْنِي ابْنَ عِيَاضٍ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَبِيدَةَ السَّلْمَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ جَاءَ حَبْرٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا مُحَمَّدُ أَوْ يَا أَبَا الْقَاسِمِ إِنَّ اللَّهَ تَعَالَى يُمْسِكُ السَّمَاوَاتِ يَوْمَ الْقِيَامَةِ عَلَى إِصْبَعٍ وَالْأَرَضِينَ عَلَى إِصْبَعٍ وَالْجِبَالَ وَالشَّجَرَ عَلَى إِصْبَعٍ وَالْمَاءَ وَالثَّرَى عَلَى إِصْبَعٍ وَسَائِرَ الْخَلْقِ عَلَى إِصْبَعٍ ثُمَّ يَهُزُّهُنَّ فَيَقُولُ أَنَا الْمَلِكُ أَنَا الْمَلِكُ فَضَحِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَعَجُّبًا مِمَّا قَالَ الْحَبْرُ تَصْدِيقًا لَهُ ثُمَّ قَرَأَ وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ وَالْأَرْضُ جَمِيعًا قَبْضَتُهُ يَوْمَ الْقِيَامَةِ وَالسَّمَاوَاتُ مَطْوِيَّاتٌ بِيَمِينِهِ سُبْحَانَهُ وَتَعَالَى عَمَّا يُشْرِكُونَ"
      },
      {
        "id": 14608,
        "hadith_number": "7047",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ulama Yahudi Berjumpa Rasulullah SAW",
        "perawi_melayu": "Mansur",
        "english_text": "This hadlth has been narrated on the authority of Mansur with the same chain of truemittm (and the words are): A Jew scholar came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). The rest of the hadith is the same, but there is no mention of then He would stir them. But there is this addition: I saw Allah's Messengcr ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) smiling so much that his front teeth appeared and testifying him (th Jew scholar) ; then Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) recited the verse: And they honour not Allah with the honour due to Him (xxxix. 67).",
        "malay_translation": "Hadis ini diriwayatkan daripada Mansur dengan sanad yang sama (dan lafaznya ialah): Seorang ulama Yahudi datang kepada Rasulullah SAW.  Baki hadis adalah sama, tetapi tiada disebut kemudian Baginda akan mengaduknya.  Tetapi ada tambahan ini: Saya melihat Rasulullah SAW tersenyum sehingga gigi hadapan Baginda kelihatan dan memberi kesaksian kepadanya (ulama Yahudi itu); kemudian Rasulullah SAW membaca ayat: Dan mereka tidak memuliakan Allah dengan kemuliaan yang sepatutnya bagi-Nya (xxxix. 67).",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ كِلَاهُمَا عَنْ جَرِيرٍ عَنْ مَنْصُورٍ بِهَذَا الْإِسْنَادِ قَالَ جَاءَ حَبْرٌ مِنْ الْيَهُودِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ فُضَيْلٍ وَلَمْ يَذْكُرْ ثُمَّ يَهُزُّهُنَّ وَقَالَ فَلَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ تَعَجُّبًا لِمَا قَالَ تَصْدِيقًا لَهُ ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ وَتَلَا الْآيَةَ"
      },
      {
        "id": 14609,
        "hadith_number": "7048",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kekuasaan Allah Yang Maha Agung",
        "perawi_melayu": "Abdullah",
        "english_text": "Abdullah reported that a person from the People of the Book came to Allah's Apostle (may peace he upon him) and said: Abu al-Qasim, verily, Allah holds the Heavens upon one finger and the earths upon one finger and the trees and moist earth upon one finger and in fact the whole of the creation upon one finger and then say: I am the King. I am the King. And he (the narrator) further said: I saw Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) smiling until his front teeth became visible and then he recited the verse: And they measure not the power of Allah with His true measure (39:67).",
        "malay_translation": "Abdullah meriwayatkan bahawa seorang daripada Ahli Kitab datang kepada Rasulullah SAW dan berkata: Wahai Abu al-Qasim, sesungguhnya Allah memegang langit dengan satu jari, dan bumi dengan satu jari, dan pokok-pokok serta tanah lembap dengan satu jari, dan sebenarnya seluruh makhluk dengan satu jari, kemudian berkata: Aku adalah Raja. Aku adalah Raja.  Dan dia (perawi) berkata lagi: Aku melihat Rasulullah SAW tersenyum sehingga gigi hadapan baginda kelihatan, kemudian baginda membaca ayat: Dan mereka tidak mengukur kekuasaan Allah dengan ukuran yang sebenar (39:67).",
        "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَعْمَشُ قَالَ سَمِعْتُ إِبْرَاهِيمَ يَقُولُ سَمِعْتُ عَلْقَمَةَ يَقُولُ قَالَ عَبْدُ اللَّهِ جَاءَ رَجُلٌ مِنْ أَهْلِ الْكِتَابِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا أَبَا الْقَاسِمِ إِنَّ اللَّهَ يُمْسِكُ السَّمَاوَاتِ عَلَى إِصْبَعٍ وَالْأَرْضِينَ عَلَى إِصْبَعٍ وَالشَّجَرَ وَالثَّرَى عَلَى إِصْبَعٍ وَالْخَلَائِقَ عَلَى إِصْبَعٍ ثُمَّ يَقُولُ أَنَا الْمَلِكُ أَنَا الْمَلِكُ قَالَ فَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ ثُمَّ قَرَأَ وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ"
      },
      {
        "id": 14610,
        "hadith_number": "7049",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perbezaan Ringkas Perawi Hadis",
        "perawi_melayu": "A'mash",
        "english_text": "This hadith has been narrated on the authority of A'mash with the same chain of transmitters but with a slight variation of wording.",
        "malay_translation": "Hadis ini diriwayatkan daripada A'mash dengan sanad yang sama, tetapi dengan sedikit perbezaan lafaz.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَلِيُّ بْنُ خَشْرَمٍ قَالَا أَخْبَرَنَا عِيسَى بْنُ يُونُسَ ح و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ كُلُّهُمْ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّ فِي حَدِيثِهِمْ جَمِيعًا وَالشَّجَرَ عَلَى إِصْبَعٍ وَالثَّرَى عَلَى إِصْبَعٍ وَلَيْسَ فِي حَدِيثِ جَرِيرٍ وَالْخَلَائِقَ عَلَى إِصْبَعٍ وَلَكِنْ فِي حَدِيثِهِ وَالْجِبَالَ عَلَى إِصْبَعٍ وَزَادَ فِي حَدِيثِ جَرِيرٍ تَصْدِيقًا لَهُ تَعَجُّبًا لِمَا قَالَ"
      },
      {
        "id": 14611,
        "hadith_number": "7050",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Allah SWT sebagai Tuhan Yang Maha Kuasa pada Hari Kiamat",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Huraira reported Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Allah, the Exalted and Glorious, will take in His grip the Earth on the Day of Judgment and He would roll up the sky in His right hand and would say: I am the Lord; where are the sovereigns of the world?",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda: Allah SWT Yang Maha Tinggi dan Maha Mulia akan menggenggam bumi pada Hari Kiamat dan Dia akan menggulung langit di tangan kanan-Nya dan akan berfirman: Akulah Tuhan; di manakah para penguasa dunia?",
        "arabic_text": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي ابْنُ الْمُسَيَّبِ أَنَّ أَبَا هُرَيْرَةَ كَانَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْبِضُ اللَّهُ تَبَارَكَ وَتَعَالَى الْأَرْضَ يَوْمَ الْقِيَامَةِ وَيَطْوِي السَّمَاءَ بِيَمِينِهِ ثُمَّ يَقُولُ أَنَا الْمَلِكُ أَيْنَ مُلُوكُ الْأَرْضِ"
      },
      {
        "id": 14612,
        "hadith_number": "7051",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Allah SWT Akan Melipat Langit dan Bumi pada Hari Kiamat",
        "perawi_melayu": "Abdullah bin Umar",
        "english_text": "Abdullah b. 'Umar reported Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) saying: Allah, the Exalted and Glorious, would fold the Heavens on the Day of Judgment and then He would place them on His right hand and say: I am the Lord; where are the haughty and where are the proud (today)? He would fold the' earth (placing it) on the left hand and say: I am the Lord; where are the haughty and where are the proud (today)?",
        "malay_translation": "Abdullah bin Umar meriwayatkan bahawa Rasulullah SAW bersabda: Allah SWT Yang Maha Tinggi dan Maha Mulia akan melipat langit pada Hari Kiamat, kemudian Dia akan meletakkannya di tangan kanan-Nya dan berfirman: Aku Tuhan, di manakah orang-orang yang sombong dan orang-orang yang angkuh (pada hari ini)? Kemudian Dia akan melipat bumi dan meletakkannya di tangan kiri-Nya dan berfirman: Aku Tuhan, di manakah orang-orang yang sombong dan orang-orang yang angkuh (pada hari ini)?",
        "arabic_text": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عُمَرَ بْنِ حَمْزَةَ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَطْوِي اللَّهُ عَزَّ وَجَلَّ السَّمَاوَاتِ يَوْمَ الْقِيَامَةِ ثُمَّ يَأْخُذُهُنَّ بِيَدِهِ الْيُمْنَى ثُمَّ يَقُولُ أَنَا الْمَلِكُ أَيْنَ الْجَبَّارُونَ أَيْنَ الْمُتَكَبِّرُونَ ثُمَّ يَطْوِي الْأَرَضِينَ بِشِمَالِهِ ثُمَّ يَقُولُ أَنَا الْمَلِكُ أَيْنَ الْجَبَّارُونَ أَيْنَ الْمُتَكَبِّرُونَ"
      },
      {
        "id": 14613,
        "hadith_number": "7052",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Allah SWT Maha Kuasa dan Pencipta Alam",
        "perawi_melayu": "Abdullah bin Miqsam",
        "english_text": "Abdullah b. Miqsam reported that he saw Abdullah b. Umar as he narrated Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Allah, the Exalted and Glorious, would take in His hand His Heavens and His Earth, and would say: I am Allah. And He would clench His fingers and then would open them (and say): I am your Lord. I saw the pulpit in commotion from underneath because of something (vib-ating) there. And (I felt this commotion so much) that I said (to myself): It may not fall with Allah's Massenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) upon it.",
        "malay_translation": "Abdullah bin Miqsam melaporkan bahawa beliau melihat Abdullah bin Umar ketika beliau meriwayatkan bahawa Rasulullah ﷺ bersabda: Allah Yang Maha Tinggi dan Maha Mulia, akan mengambil langit dan bumi-Nya di dalam genggaman-Nya, dan berfirman: Aku adalah Allah.  Kemudian Dia akan menggenggam jari-jari-Nya dan membukanya (seraya berfirman): Aku adalah Tuhan kamu. Aku melihat mimbar itu bergegar dari bawah kerana sesuatu (getaran) di situ. Dan (aku merasakan gegaran itu sangat kuat) sehingga aku berkata (dalam hati): Jangan sampai ia runtuh dengan Rasulullah ﷺ di atasnya.",
        "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ حَدَّثَنِي أَبُو حَازِمٍ عَنْ عُبَيْدِ اللَّهِ بْنِ مِقْسَمٍ أَنَّهُ نَظَرَ إِلَى عَبْدِ اللَّهِ بْنِ عُمَرَ كَيْفَ يَحْكِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَأْخُذُ اللَّهُ عَزَّ وَجَلَّ سَمَاوَاتِهِ وَأَرَضِيهِ بِيَدَيْهِ فَيَقُولُ أَنَا اللَّهُ وَيَقْبِضُ أَصَابِعَهُ وَيَبْسُطُهَا أَنَا الْمَلِكُ حَتَّى نَظَرْتُ إِلَى الْمِنْبَرِ يَتَحَرَّكُ مِنْ أَسْفَلِ شَيْءٍ مِنْهُ حَتَّى إِنِّي لَأَقُولُ أَسَاقِطٌ هُوَ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ"
      },
      {
        "id": 14614,
        "hadith_number": "7053",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Allah SWT Memegang Langit dan Bumi",
        "perawi_melayu": "Abdullah bin Miqsam meriwayatkan daripada Abdullah bin Umar",
        "english_text": "Abdullah b. Miqsam reported that 'Abdullah b. 'Umar reported: I saw Allah'h Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) upon the pulpit and he was saying that the Mighty Lord, the Exalted and Glorious would take hold of the Heavens and earth in His hand. The rest of the hadith is the same,",
        "malay_translation": "Abdullah bin Miqsam meriwayatkan bahawa Abdullah bin Umar berkata: Aku melihat Rasulullah SAW di atas mimbar, baginda bersabda bahawa Tuhan Yang Maha Kuasa, Yang Maha Tinggi dan Maha Mulia akan memegang langit dan bumi di tangan-Nya.  Baki hadis adalah sama.",
        "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ حَدَّثَنِي أَبِي عَنْ عُبَيْدِ اللَّهِ بْنِ مِقْسَمٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ وَهُوَ يَقُولُ يَأْخُذُ الْجَبَّارُ عَزَّ وَجَلَّ سَمَاوَاتِهِ وَأَرَضِيهِ بِيَدَيْهِ ثُمَّ ذَكَرَ نَحْوَ حَدِيثِ يَعْقُوبَ"
      },
      {
        "id": 14615,
        "hadith_number": "7054",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Penciptaan Alam Semesta Menurut Rasulullah",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Huraira reported that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) took hold of my hands and said: Allah, the Exalted and Glorious, created the clay on Saturday and He created the mountains on Sunday and He created the trees on Monday and He created the things entailing labour on Tuesday and created light on Wednesday and He caused the animals to spread on Thursday and created Adam (peace be upon him) after 'Asr on Friday; the last creation at the last hour of the hours of Friday, i. e. between afternoon and night. This hadith is narrated through another chain of transmitters.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW memegang tangan saya dan bersabda: Allah SWT, Yang Maha Tinggi dan Maha Mulia, menciptakan tanah liat pada hari Sabtu, dan Dia menciptakan gunung-ganang pada hari Ahad, dan Dia menciptakan pokok-pokok pada hari Isnin, dan Dia menciptakan segala sesuatu yang melibatkan kerja keras pada hari Selasa, dan menciptakan cahaya pada hari Rabu, dan Dia menyebarkan haiwan-haiwan pada hari Khamis, dan menciptakan Adam a.s. selepas Asar pada hari Jumaat; makhluk terakhir pada waktu terakhir daripada waktu-waktu Jumaat, iaitu di antara waktu petang dan malam. Hadis ini diriwayatkan melalui sanad lain.",
        "arabic_text": "حَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ وَهَارُونُ بْنُ عَبْدِ اللَّهِ قَالَا حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي إِسْمَعِيلُ بْنُ أُمَيَّةَ عَنْ أَيُّوبَ بْنِ خَالِدٍ عَنْ عَبْدِ اللَّهِ بْنِ رَافِعٍ مَوْلَى أُمِّ سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ أَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِي فَقَالَ خَلَقَ اللَّهُ عَزَّ وَجَلَّ التُّرْبَةَ يَوْمَ السَّبْتِ وَخَلَقَ فِيهَا الْجِبَالَ يَوْمَ الْأَحَدِ وَخَلَقَ الشَّجَرَ يَوْمَ الِاثْنَيْنِ وَخَلَقَ الْمَكْرُوهَ يَوْمَ الثُّلَاثَاءِ وَخَلَقَ النُّورَ يَوْمَ الْأَرْبِعَاءِ وَبَثَّ فِيهَا الدَّوَابَّ يَوْمَ الْخَمِيسِ وَخَلَقَ آدَمَ عَلَيْهِ السَّلَام بَعْدَ الْعَصْرِ مِنْ يَوْمِ الْجُمُعَةِ فِي آخِرِ الْخَلْقِ فِي آخِرِ سَاعَةٍ مِنْ سَاعَاتِ الْجُمُعَةِ فِيمَا بَيْنَ الْعَصْرِ إِلَى اللَّيْلِ قَالَ إِبْرَاهِيمُ حَدَّثَنَا الْبِسْطَامِيُّ وَهُوَ الْحُسَيْنُ بْنُ عِيسَى وَسَهْلُ بْنُ عَمَّارٍ وَإِبْرَاهِيمُ ابْنُ بِنْتِ حَفْصٍ وَغَيْرُهُمْ عَنْ حَجَّاجٍ بِهَذَا الْحَدِيثِ"
      },
      {
        "id": 14616,
        "hadith_number": "7055",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kehadiran Manusia di Padang Mahsyar",
        "perawi_melayu": "Sahl bin Sa'd",
        "english_text": "Sahl b. Sa'd reported that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: The people will be assembled on the Day of Resurrection on a white plain with a reddish tinge like the loaf of white bread with no marks set up for anyone.",
        "malay_translation": "Sahl bin Sa'd meriwayatkan bahawa Rasulullah SAW bersabda: Manusia akan dikumpulkan pada Hari Kiamat di atas dataran putih yang sedikit kemerah-merahan, seperti roti putih tanpa tanda aras yang ditetapkan untuk sesiapa pun.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ أَبِي كَثِيرٍ حَدَّثَنِي أَبُو حَازِمِ بْنُ دِينَارٍ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحْشَرُ النَّاسُ يَوْمَ الْقِيَامَةِ عَلَى أَرْضٍ بَيْضَاءَ عَفْرَاءَ كَقُرْصَةِ النَّقِيِّ لَيْسَ فِيهَا عَلَمٌ لِأَحَدٍ"
      },
      {
        "id": 14617,
        "hadith_number": "7056",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kehidupan di Hari Kiamat",
        "perawi_melayu": "Aisyah",
        "english_text": "A'isha reported: I asked Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) about the words of Allah, the Exalted and Glorious: The day when the earth would be changed for another earth and Heaven would be changed for another Heaven (XiV. 48), (and inquired: ) (Allah's Messenger), where would the people be on that day? He said: They would be on the Sirat.",
        "malay_translation": "Aisyah meriwayatkan: Saya bertanya kepada Rasulullah ﷺ tentang firman Allah SWT: \"Pada hari ketika bumi diganti dengan bumi yang lain dan langit diganti dengan langit yang lain (Ibrahim: 48)\", dan (saya bertanya): Wahai Rasulullah, di manakah manusia pada hari itu? Baginda menjawab: Mereka berada di atas Sirat.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ دَاوُدَ عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَوْلِهِ عَزَّ وَجَلَّ يَوْمَ تُبَدَّلُ الْأَرْضُ غَيْرَ الْأَرْضِ وَالسَّمَاوَاتُ فَأَيْنَ يَكُونُ النَّاسُ يَوْمَئِذٍ يَا رَسُولَ اللَّهِ فَقَالَ عَلَى الصِّرَاطِ"
      },
      {
        "id": 14618,
        "hadith_number": "7057",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Jamuan di Hari Kiamat",
        "perawi_melayu": "Abu al-Sa'id Khudri",
        "english_text": "Abu al-Sa'id Khudri reported Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying that the earth would turn to be one single bread on the Day of Resurrection and the Almighty would turn it in His hand as one of you turns a loaf while on a journey. It would be a feast arranged in the honour of the people of Paradise. He (the narrator) further narrated that a person from among the Jews came and he said: Abu al-Qasim, may the Compassionate Lord be pleased with you! May I inform you about the feast arranged in honour of the people of Paradise on the Day of Resurrection? He said: Do it, of course. He said: The earth would become one single bread. Then Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) looked towards us and laughed until his molar teeth became visible. He then again said: May I inform you about that with which they would season it? He said: Do it, of course. He said: Their seasoning would be balim and fish. The Companions of the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: What is this balam? He said: Ox and fish from whose excessive livers seventy thousand people would be able to eat.",
        "malay_translation": "Abu al-Sa'id Khudri meriwayatkan bahawa Rasulullah SAW bersabda bahawa bumi akan menjadi satu roti yang besar pada Hari Kiamat dan Yang Maha Kuasa akan memutarnya di tangan-Nya sepertimana salah seorang daripada kamu memutar roti ketika dalam perjalanan. Ia akan menjadi jamuan yang disediakan untuk penghuni syurga. Baginda (perawi) selanjutnya meriwayatkan bahawa seorang lelaki daripada kalangan Yahudi datang dan berkata: Wahai Abu al-Qasim, semoga Tuhan Yang Maha Penyayang merahmati kamu!  Bolehkah saya memberitahu kamu tentang jamuan yang disediakan untuk penghuni syurga pada Hari Kiamat? Baginda SAW bersabda: Tentulah. Lelaki itu berkata: Bumi akan menjadi satu roti yang besar. Kemudian Rasulullah SAW memandang ke arah kami dan tersenyum sehingga gigi gerahamnya kelihatan. Baginda kemudiannya bersabda lagi: Bolehkah saya memberitahu kamu tentang perasa yang akan digunakan? Baginda SAW bersabda: Tentulah. Lelaki itu berkata: Perasa mereka adalah balim dan ikan. Para sahabat Rasulullah SAW berkata: Apakah balam itu? Baginda SAW bersabda: Lembu dan ikan, daripada hati yang banyak itu, tujuh puluh ribu orang mampu memakannya.",
        "arabic_text": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ حَدَّثَنِي أَبِي عَنْ جَدِّي حَدَّثَنِي خَالِدُ بْنُ يَزِيدَ عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَكُونُ الْأَرْضُ يَوْمَ الْقِيَامَةِ خُبْزَةً وَاحِدَةً يَكْفَؤُهَا الْجَبَّارُ بِيَدِهِ كَمَا يَكْفَأُ أَحَدُكُمْ خُبْزَتَهُ فِي السَّفَرِ نُزُلًا لِأَهْلِ الْجَنَّةِ قَالَ فَأَتَى رَجُلٌ مِنْ الْيَهُودِ فَقَالَ بَارَكَ الرَّحْمَنُ عَلَيْكَ أَبَا الْقَاسِمِ أَلَا أُخْبِرُكَ بِنُزُلِ أَهْلِ الْجَنَّةِ يَوْمَ الْقِيَامَةِ قَالَ بَلَى قَالَ تَكُونُ الْأَرْضُ خُبْزَةً وَاحِدَةً كَمَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَنَظَرَ إِلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ قَالَ أَلَا أُخْبِرُكَ بِإِدَامِهِمْ قَالَ بَلَى قَالَ إِدَامُهُمْ بَالَامُ وَنُونٌ قَالُوا وَمَا هَذَا قَالَ ثَوْرٌ وَنُونٌ يَأْكُلُ مِنْ زَائِدَةِ كَبِدِهِمَا سَبْعُونَ أَلْفًا"
      },
      {
        "id": 14619,
        "hadith_number": "7058",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kesan Dakwah Rasulullah SAW terhadap Ahli Kitab",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Huraira reported Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: If ten scholars of the Jews would follow me, no Jew would be left upon the surface of the earth who would not embrace Islam.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda: Sekiranya sepuluh orang alim daripada kalangan Yahudi mengikutku, nescaya tidak akan tinggal seorang Yahudi pun di muka bumi ini yang tidak memeluk Islam.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا قُرَّةُ حَدَّثَنَا مُحَمَّدٌ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ تَابَعَنِي عَشَرَةٌ مِنْ الْيَهُودِ لَمْ يَبْقَ عَلَى ظَهْرِهَا يَهُودِيٌّ إِلَّا أَسْلَمَ"
      },
      {
        "id": 14620,
        "hadith_number": "7059",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah SAW Ditanya Mengenai Jiwa",
        "perawi_melayu": "Abdullah bin Mas'ud",
        "english_text": "`Abdullah (b. Mas`ud) reported: As I was going along with Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in a cultivable land and he (the Holy Prophet) was walking with the support of a wood, a group of Jews happened to meet him. Some of them said to the others: Ask him about the Soul. They said: What is your doubt about it? There is a possibility that you may ask him about anything (the answer of) which you may not like. They said: Ask him. So one amongst them asked him about the Soul. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) kept quiet and he gave no reply and I came to know that revelation was being sent to him, so I stood at my place and thus this revelation descended upon him: They ask thee about the Soul. Say: The Soul is by the Commandment of my Lord, and of Knowledge you are given but a little (xvii. 58).",
        "malay_translation": "Abdullah bin Mas'ud meriwayatkan: Ketika aku berjalan bersama Rasulullah SAW di tanah pertanian, baginda berjalan dengan bantuan tongkat, sekumpulan Yahudi bertemu dengan baginda. Sebahagian daripada mereka berkata kepada yang lain: “Tanyakan kepadanya tentang jiwa.” Mereka berkata: “Apakah keraguanmu tentangnya? Mungkin engkau akan bertanya kepadanya tentang sesuatu yang jawapannya tidak engkau sukai.” Mereka berkata: “Tanyakanlah.” Maka seorang di antara mereka bertanya kepada baginda tentang jiwa. Rasulullah SAW berdiam diri dan tidak menjawab, dan aku tahu bahawa wahyu sedang diturunkan kepadanya, maka aku berdiri di tempatku dan wahyu itu pun turun ke atas baginda:  Mereka bertanya kepadamu tentang jiwa. Katakanlah: “Jiwa itu menurut perintah Tuhanku, dan kamu hanyalah diberi sedikit pengetahuan.” (Surah Al-Isra’ 17: 85)",
        "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَعْمَشُ حَدَّثَنِي إِبْرَاهِيمُ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ بَيْنَمَا أَنَا أَمْشِي مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَرْثٍ وَهُوَ مُتَّكِئٌ عَلَى عَسِيبٍ إِذْ مَرَّ بِنَفَرٍ مِنْ الْيَهُودِ فَقَالَ بَعْضُهُمْ لِبَعْضٍ سَلُوهُ عَنْ الرُّوحِ فَقَالُوا مَا رَابَكُمْ إِلَيْهِ لَا يَسْتَقْبِلُكُمْ بِشَيْءٍ تَكْرَهُونَهُ فَقَالُوا سَلُوهُ فَقَامَ إِلَيْهِ بَعْضُهُمْ فَسَأَلَهُ عَنْ الرُّوحِ قَالَ فَأَسْكَتَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَرُدَّ عَلَيْهِ شَيْئًا فَعَلِمْتُ أَنَّهُ يُوحَى إِلَيْهِ قَالَ فَقُمْتُ مَكَانِي فَلَمَّا نَزَلَ الْوَحْيُ قَالَ وَيَسْأَلُونَكَ عَنْ الرُّوحِ قُلْ الرُّوحُ مِنْ أَمْرِ رَبِّي وَمَا أُوتِيتُمْ مِنْ الْعِلْمِ إِلَّا قَلِيلًا"
      },
      {
        "id": 14621,
        "hadith_number": "7060",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perjalanan Rasulullah di Ladang Madinah",
        "perawi_melayu": "Abdullah",
        "english_text": "Abdullah reported: I was walking along with Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in a field of Medina. The rest of the hadith is the same, but there is a slight variation of wording.",
        "malay_translation": "Abdullah meriwayatkan: Aku berjalan bersama Rasulullah ﷺ di sebuah ladang di Madinah.  Baki hadis ini adalah sama, tetapi terdapat sedikit perbezaan lafaz.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو سَعِيدٍ الْأَشَجُّ قَالَا حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ وَعَلِيُّ بْنُ خَشْرَمٍ قَالَا أَخْبَرَنَا عِيسَى بْنُ يُونُسَ كِلَاهُمَا عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ كُنْتُ أَمْشِي مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَرْثٍ بِالْمَدِينَةِ بِنَحْوِ حَدِيثِ حَفْصٍ غَيْرَ أَنَّ فِي حَدِيثِ وَكِيعٍ وَمَا أُوتِيتُمْ مِنْ الْعِلْمِ إِلَّا قَلِيلًا وَفِي حَدِيثِ عِيسَى بْنِ يُونُسَ وَمَا أُوتُوا مِنْ رِوَايَةِ ابْنِ خَشْرَمٍ"
      },
      {
        "id": 14622,
        "hadith_number": "7061",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah Bersandar di Sebuah Pokok",
        "perawi_melayu": "Abdullah",
        "english_text": "Abdullah reported that Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was reclining against a tree in the garden. The rest of the hadith is the same with a slight variation of wording.",
        "malay_translation": "Abdullah melaporkan bahawa Rasulullah SAW bersandar pada sebatang pokok di dalam taman.  Baki hadith adalah sama dengan sedikit perbezaan kata-kata.",
        "arabic_text": "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ إِدْرِيسَ يَقُولُ سَمِعْتُ الْأَعْمَشَ يَرْوِيهِ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَخْلٍ يَتَوَكَّأُ عَلَى عَسِيبٍ ثُمَّ ذَكَرَ نَحْوَ حَدِيثِهِمْ عَنْ الْأَعْمَشِ وَقَالَ فِي رِوَايَتِهِ وَمَا أُوتِيتُمْ مِنْ الْعِلْمِ إِلَّا قَلِيلًا"
      },
      {
        "id": 14623,
        "hadith_number": "7062",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hutang dan Keingkaran terhadap Rasulullah",
        "perawi_melayu": "Khabbab",
        "english_text": "Khabbab reported that Al-`As b. Wa'il owed debt to me. I came to him in order to demand that. He said: I will never repay you unless you belie Muhammad. I said: I would never belie Muhammad until you die and you are again raised up. He said: When I would be raised up after death, I would repay your debt when I would get my property and children back. Waki` said: This is how Al-A`mash has narrated and it was on this occasion that this verse was revealed: Hast thou seen him who disbelieves in Our message and says: I shall certainly be given wealth and children (xix, 77) up to he would come to Us alone (xix, 80).",
        "malay_translation": "Khabbab meriwayatkan bahawa Al-`As bin Wa'il berhutang kepadaku. Aku mendatanginya untuk menagih hutang itu. Dia berkata: Aku tidak akan membayarmu melainkan jika engkau mendustakan Muhammad. Aku berkata: Aku tidak akan mendustakan Muhammad sehingga engkau mati dan dibangkitkan semula. Dia berkata: Apabila aku dibangkitkan semula selepas mati, aku akan membayar hutangmu apabila aku mendapat semula harta dan anak-anakku. Waki` berkata: Beginilah cara Al-A`mash meriwayatkan dan pada ketika itulah ayat ini diturunkan: \"(Adakah) engkau melihat orang yang mendustakan ayat-ayat Kami dan berkata: \"Sesungguhnya aku pasti akan diberi kekayaan dan anak-anak.\" (Surah Maryam, 19:77) sehingga dia menghadap Kami seorang diri.\" (Surah Maryam, 19:80).",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَبْدُ اللَّهِ بْنُ سَعِيدٍ الْأَشَجُّ وَاللَّفْظُ لِعَبْدِ اللَّهِ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي الضُّحَى عَنْ مَسْرُوقٍ عَنْ خَبَّابٍ قَالَ كَانَ لِي عَلَى الْعَاصِ بْنِ وَائِلٍ دَيْنٌ فَأَتَيْتُهُ أَتَقَاضَاهُ فَقَالَ لِي لَنْ أَقْضِيَكَ حَتَّى تَكْفُرَ بِمُحَمَّدٍ قَالَ فَقُلْتُ لَهُ إِنِّي لَنْ أَكْفُرَ بِمُحَمَّدٍ حَتَّى تَمُوتَ ثُمَّ تُبْعَثَ قَالَ وَإِنِّي لَمَبْعُوثٌ مِنْ بَعْدِ الْمَوْتِ فَسَوْفَ أَقْضِيكَ إِذَا رَجَعْتُ إِلَى مَالٍ وَوَلَدٍ قَالَ وَكِيعٌ كَذَا قَالَ الْأَعْمَشُ قَالَ فَنَزَلَتْ هَذِهِ الْآيَةُ أَفَرَأَيْتَ الَّذِي كَفَرَ بِآيَاتِنَا وَقَالَ لَأُوتَيَنَّ مَالًا وَوَلَدًا إِلَى قَوْلِهِ وَيَأْتِينَا فَرْدًا"
      },
      {
        "id": 14624,
        "hadith_number": "7063",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Tukang Besi Sebelum Islam",
        "perawi_melayu": "Khabbib (melalui beberapa perawi lain)",
        "english_text": "This hadith has been narrated on the authority of Khabbib through another chain of transmitters and the words are. I in the pre-Islamic days used to work as an iron-smith. I did some work for 'As b. Wa'il and came to him for getting the remuneration of my wages.",
        "malay_translation": "Hadis ini diriwayatkan daripada Khabbib melalui sanad lain, dan mafhumnya: Aku, pada zaman jahiliyyah, bekerja sebagai tukang besi. Aku pernah melakukan kerja untuk As bin Wa'il dan datang kepadanya untuk mendapatkan upahku.",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ ح و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ كُلُّهُمْ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ نَحْوَ حَدِيثِ وَكِيعٍ وَفِي حَدِيثِ جَرِيرٍ قَالَ كُنْتُ قَيْنًا فِي الْجَاهِلِيَّةِ فَعَمِلْتُ لِلْعَاصِ بْنِ وَائِلٍ عَمَلًا فَأَتَيْتُهُ أَتَقَاضَاهُ"
      },
      {
        "id": 14625,
        "hadith_number": "7064",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Doa Abu Jahal dan Ayat yang Diturunkan",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "Anas b. Malik reported that Abu Jahl said: O Allah, if he is true, then shower upon us the volley of stones from the sky or inflict upon us a grievous torment, and it was on this occasion that this verse was revealed: 'Allah would never torment them so long as you are amongst them. And Allah is not going to torment them as long as they seek forgiveness. And why is it that Allah should not torment them and they prevent people from coming to the sacred mosque.... (viii. 34) to the end.",
        "malay_translation": "Anas bin Malik meriwayatkan bahawa Abu Jahal berkata: Wahai Allah, jika dia benar, maka hujanilah kami dengan hujan batu dari langit atau timpakanlah kami dengan azab yang pedih.  Pada ketika itulah ayat ini diturunkan:  'Allah tidak akan menyeksa mereka selagi kamu berada di kalangan mereka. Dan Allah tidak akan menyeksa mereka selagi mereka memohon keampunan. Dan mengapakah Allah tidak menyeksa mereka sedangkan mereka menghalang manusia daripada datang ke Masjidil Haram… (8:34) hingga kesudahannya.",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الْحَمِيدِ الزِّيَادِيِّ أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ يَقُولُ قَالَ أَبُو جَهْلٍ اللَّهُمَّ إِنْ كَانَ هَذَا هُوَ الْحَقَّ مِنْ عِنْدِكَ فَأَمْطِرْ عَلَيْنَا حِجَارَةً مِنْ السَّمَاءِ أَوْ ائْتِنَا بِعَذَابٍ أَلِيمٍ فَنَزَلَتْ وَمَا كَانَ اللَّهُ لِيُعَذِّبَهُمْ وَأَنْتَ فِيهِمْ وَمَا كَانَ اللَّهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ وَمَا لَهُمْ أَلَّا يُعَذِّبَهُمْ اللَّهُ وَهُمْ يَصُدُّونَ عَنْ الْمَسْجِدِ الْحَرَامِ إِلَى آخِرِ الْآيَةِ"
      },
      {
        "id": 14626,
        "hadith_number": "7065",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keangkuhan Abu Jahal dan Ayat yang Diturunkan",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Huraira reported that Abu Jahl asked (people) whether Muhammad placed his face (on the ground) in their presence. It was said to him: Yes. He said: By Lat and `Uzza. If I were to see him do that, I would trample his neck, or I would smear his face with dust. He came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as he was engaged in prayer and thought of trampling his neck (and the people say) that he came near him but turned upon his heels and tried to repulse something with his hands. It was said to him: What is the matter with you? He said: There is between me and him a ditch of fire and terror and wings. Thereupon Allah's Messenger (may peace he upon him) said: If he were to come near me the angels would have torn him to pieces. Then Allah, the Exalted and Glorious, revealed this verse- (the narrator) said: We do not know whether it is the hadith transmitted by Abu Huraira or something conveyed to him from another source: Nay, man is surely inordinate, because he looks upon himself as self-sufficient. Surely to thy Lord is the return. Hast thou seen him who forbids a servant when he prays? Seest thou if he is on the right way, or enjoins observance of piety? Seest thou if he [Abu Jahl] denies and turns away? Knowest he not that Allah sees? Nay, if he desists not, We will seize him by the forelock-a lying, sinful forelock. Then let him summon his council. We will summon the guards of the Hell. Nay! Obey not thou him (lcvi, 6-19). (Rather prostrate thyself.) Ubaidullah made this addition: It was after this that (prostration) was enjoined upon and Ibn Abd al-Ala made this addition that by Nadiyah he meant his people.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Abu Jahal bertanya (kepada orang ramai) sama ada Muhammad meletakkan mukanya (ke tanah) di hadapan mereka. Dikatakan kepadanya: Ya. Dia berkata: Demi Lat dan `Uzza. Sekiranya aku melihatnya berbuat demikian, nescaya aku akan memijak lehernya, atau aku akan mencalarkan mukanya dengan debu. Dia datang kepada Rasulullah ﷺ ketika baginda sedang solat dan berniat untuk memijak leher baginda (dan orang ramai berkata) bahawa dia hampir kepada baginda tetapi berpatah balik dan cuba menolak sesuatu dengan tangannya. Dikatakan kepadanya: Apakah yang berlaku kepadamu? Dia berkata: Ada satu parit api, ketakutan dan sayap di antara aku dengannya.  Maka Rasulullah ﷺ bersabda: Sekiranya dia menghampiriku, nescaya malaikat akan mencabik-cabiknya. Kemudian Allah SWT menurunkan ayat ini – (perawi) berkata: Kami tidak tahu sama ada ini hadis yang diriwayatkan oleh Abu Hurairah atau sesuatu yang disampaikan kepadanya daripada sumber lain:  Sesungguhnya manusia itu benar-benar melampaui batas, kerana dia menganggap dirinya cukup. Sesungguhnya kepada Tuhanmulah tempat kembali.  Adakah engkau melihat orang yang menghalang seorang hamba apabila dia berdoa?  Adakah engkau melihat jika dia berada di jalan yang benar, atau menyuruh bertakwa? Adakah engkau melihat jika dia [Abu Jahal] mengingkari dan berpaling?  Tidakkah dia tahu bahawa Allah melihat?  Sekiranya dia tidak berhenti, nescaya Kami akan memegangnya dari ubun-ubunnya – ubun-ubun yang pendusta lagi berdosa.  Kemudian hendaklah dia memanggil bala tentaranya, dan Kami akan memanggil penjaga-penjaga neraka.  Tidak! Janganlah engkau taat kepadanya (Lcvi, 6-19). (Sebaliknya sujudlah). Ubaidullah menambah: Selepas ini, (sujud) diwajibkan dan Ibn Abd al-Ala menambah bahawa yang dimaksudkan dengan Nadiyah ialah kaumnya.",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ وَمُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الْقَيْسِيُّ قَالَا حَدَّثَنَا الْمُعْتَمِرُ عَنْ أَبِيهِ حَدَّثَنِي نُعَيْمُ بْنُ أَبِي هِنْدٍ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ أَبُو جَهْلٍ هَلْ يُعَفِّرُ مُحَمَّدٌ وَجْهَهُ بَيْنَ أَظْهُرِكُمْ قَالَ فَقِيلَ نَعَمْ فَقَالَ وَاللَّاتِ وَالْعُزَّى لَئِنْ رَأَيْتُهُ يَفْعَلُ ذَلِكَ لَأَطَأَنَّ عَلَى رَقَبَتِهِ أَوْ لَأُعَفِّرَنَّ وَجْهَهُ فِي التُّرَابِ قَالَ فَأَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصَلِّي زَعَمَ لِيَطَأَ عَلَى رَقَبَتِهِ قَالَ فَمَا فَجِئَهُمْ مِنْهُ إِلَّا وَهُوَ يَنْكُصُ عَلَى عَقِبَيْهِ وَيَتَّقِي بِيَدَيْهِ قَالَ فَقِيلَ لَهُ مَا لَكَ فَقَالَ إِنَّ بَيْنِي وَبَيْنَهُ لَخَنْدَقًا مِنْ نَارٍ وَهَوْلًا وَأَجْنِحَةً فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ دَنَا مِنِّي لَاخْتَطَفَتْهُ الْمَلَائِكَةُ عُضْوًا عُضْوًا قَالَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ لَا نَدْرِي فِي حَدِيثِ أَبِي هُرَيْرَةَ أَوْ شَيْءٌ بَلَغَهُ كَلَّا إِنَّ الْإِنْسَانَ لَيَطْغَى أَنْ رَآهُ اسْتَغْنَى إِنَّ إِلَى رَبِّكَ الرُّجْعَى أَرَأَيْتَ الَّذِي يَنْهَى عَبْدًا إِذَا صَلَّى أَرَأَيْتَ إِنْ كَانَ عَلَى الْهُدَى أَوْ أَمَرَ بِالتَّقْوَى أَرَأَيْتَ إِنْ كَذَّبَ وَتَوَلَّى يَعْنِي أَبَا جَهْلٍ أَلَمْ يَعْلَمْ بِأَنَّ اللَّهَ يَرَى كَلَّا لَئِنْ لَمْ يَنْتَهِ لَنَسْفَعًا بِالنَّاصِيَةِ نَاصِيَةٍ كَاذِبَةٍ خَاطِئَةٍ فَلْيَدْعُ نَادِيَهُ سَنَدْعُ الزَّبَانِيَةَ كَلَّا لَا تُطِعْهُ زَادَ عُبَيْدُ اللَّهِ فِي حَدِيثِهِ قَالَ وَأَمَرَهُ بِمَا أَمَرَهُ بِهِ وَزَادَ ابْنُ عَبْدِ الْأَعْلَى فَلْيَدْعُ نَادِيَهُ يَعْنِي قَوْمَهُ"
      },
      {
        "id": 14627,
        "hadith_number": "7066",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Amaran Abdullah tentang Bercakap Tanpa Ilmu dan Tafsiran Ayat Asap",
        "perawi_melayu": "Masruq",
        "english_text": "Masruq reported: We were sitting in the company of Abdullah and he was lying on the bed that a person came and said: Abd Abd al-Rabmin, a story-teller at the gates of Kinda says that the verse (of the Qur'an) which deals with the smoke implies that which is about to come and it would hold the breath of the infidels and would inflict the believers with cold. Thereupon Abdullah got up and said in anger. O people, fear Allah and say only that which one knows amongst you and do not say which he does not know and he should simply say: Allah has the best knowledge for He has the best knowledge amongst all of you. It does not behove him to say that which he does not know. Allah has the best knowledge of it. Verily Allah, the Exalted and Glorious, said to His Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) to state: I do not ask from you any remuneration and I am not the one to put you in trouble, and when Allah's Mesqenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) saw people turning back (from religion) he said: O Allah, afflict thern with seven famines as was done in the case of Yusuf, so they were afflicted with famine by which they were forced to eat everything until they were obliged to eat the hides and the dead bodies because of hunger, and every one of them looked towards the sky and he found a smoke. And Abu Sufyan came and he said: Muhammad, you have come to command us to obey Allah and cement the ties of blood- relation whereas your people are undone; supplicate Allah for tlicm. Thereupon Allah, the Exalted and Glorious, said: Wait for the day when there would be clear smoke from the sky which would envelop people and that would be grievous torivent up to the words: you are going to return to (evil). (if this verse implied the torment of the next life) could the chastisement of the next (life) be averted (as the Qur'an states): On the day when We seize (them) with the most violent seizing; surely We shall exact retribution (xliv. 16)? The seizing (in the hadith) implies that of the Day of Badr. And so far as the sign of smoke, seizing, inevitability and signs of Rome are concern- ed, they have become things of the past now.",
        "malay_translation": "Masruq meriwayatkan: Kami sedang duduk bersama Abdullah, baginda berbaring di atas katil, ketika seorang lelaki datang dan berkata: Abd Abd al-Rabmin, seorang pencerita di pintu gerbang Kinda berkata bahawa ayat (Al-Quran) yang menyebut tentang asap itu merujuk kepada sesuatu yang bakal berlaku, ia akan menyekat nafas orang-orang kafir dan menyebabkan orang-orang beriman mengalami kesejukan.  Lalu Abdullah bangun dan berkata dengan marah, “Wahai manusia, bertaqwalah kepada Allah dan katakanlah hanya apa yang kamu ketahui, dan janganlah kamu katakan apa yang kamu tidak ketahui.  Katakanlah sahaja: Allah jualah yang Maha Mengetahui, kerana Dialah yang paling mengetahui di antara kamu semua. Tidak sepatutnya seseorang itu berkata apa yang dia tidak ketahui. Allah jualah yang Maha Mengetahui tentangnya. Sesungguhnya Allah SWT telah berfirman kepada Nabi-Nya (ﷺ): Aku tidak meminta sebarang balasan daripada kamu dan Aku bukanlah orang yang akan menyusahkan kamu. Dan apabila Rasulullah ﷺ melihat manusia berpaling (daripada agama), baginda berdoa: Ya Allah, timpakan mereka dengan tujuh tahun bencana kebuluran seperti yang berlaku pada zaman Yusuf. Maka mereka ditimpa dengan kebuluran yang memaksa mereka memakan segala-galanya sehingga mereka terpaksa memakan kulit dan mayat kerana kelaparan. Setiap seorang daripada mereka memandang ke langit dan melihat asap. Kemudian Abu Sufyan datang dan berkata: Muhammad, engkau datang untuk memerintahkan kami supaya taat kepada Allah dan menyambung silaturahim, sedangkan kaummu sendiri berada dalam keadaan yang susah; berdoalah kepada Allah untuk mereka. Lalu Allah SWT berfirman: Tunggulah hari di mana akan ada asap yang jelas dari langit yang akan menyelubungi manusia dan itu akan menjadi azab yang pedih… sehingga kepada perkataan: kamu akan kembali kepada (kejahatan). (Jika ayat ini merujuk kepada azab akhirat) bolehkah azab akhirat dielakkan (sepertimana yang dinyatakan dalam Al-Quran): Pada hari Kami akan mencengkam (mereka) dengan cengkam yang paling kuat; sesungguhnya Kami akan membalas dendam (44:16)?  Cengkam (dalam hadis) itu merujuk kepada peristiwa Perang Badar. Dan setakat tanda asap, cengkam, keharusan dan tanda-tanda Rom berkenaan, ia telah menjadi perkara yang lalu.”",
        "arabic_text": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ أَبِي الضُّحَى عَنْ مَسْرُوقٍ قَالَ كُنَّا عِنْدَ عَبْدِ اللَّهِ جُلُوسًا وَهُوَ مُضْطَجِعٌ بَيْنَنَا فَأَتَاهُ رَجُلٌ فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنَّ قَاصًّا عِنْدَ أَبْوَابِ كِنْدَةَ يَقُصُّ وَيَزْعُمُ أَنَّ آيَةَ الدُّخَانِ تَجِيءُ فَتَأْخُذُ بِأَنْفَاسِ الْكُفَّارِ وَيَأْخُذُ الْمُؤْمِنِينَ مِنْهُ كَهَيْئَةِ الزُّكَامِ فَقَالَ عَبْدُ اللَّهِ وَجَلَسَ وَهُوَ غَضْبَانُ يَا أَيَّهَا النَّاسُ اتَّقُوا اللَّهَ مَنْ عَلِمَ مِنْكُمْ شَيْئًا فَلْيَقُلْ بِمَا يَعْلَمُ وَمَنْ لَمْ يَعْلَمْ فَلْيَقُلْ اللَّهُ أَعْلَمُ فَإِنَّهُ أَعْلَمُ لِأَحَدِكُمْ أَنْ يَقُولَ لِمَا لَا يَعْلَمُ اللَّهُ أَعْلَمُ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ قَالَ لِنَبِيِّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْ مَا أَسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ وَمَا أَنَا مِنْ الْمُتَكَلِّفِينَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا رَأَى مِنْ النَّاسِ إِدْبَارًا فَقَالَ اللَّهُمَّ سَبْعٌ كَسَبْعِ يُوسُفَ قَالَ فَأَخَذَتْهُمْ سَنَةٌ حَصَّتْ كُلَّ شَيْءٍ حَتَّى أَكَلُوا الْجُلُودَ وَالْمَيْتَةَ مِنْ الْجُوعِ وَيَنْظُرُ إِلَى السَّمَاءِ أَحَدُهُمْ فَيَرَى كَهَيْئَةِ الدُّخَانِ فَأَتَاهُ أَبُو سُفْيَانَ فَقَالَ يَا مُحَمَّدُ إِنَّكَ جِئْتَ تَأْمُرُ بِطَاعَةِ اللَّهِ وَبِصِلَةِ الرَّحِمِ وَإِنَّ قَوْمَكَ قَدْ هَلَكُوا فَادْعُ اللَّهَ لَهُمْ قَالَ اللَّهُ عَزَّ وَجَلَّ فَارْتَقِبْ يَوْمَ تَأْتِي السَّمَاءُ بِدُخَانٍ مُبِينٍ يَغْشَى النَّاسَ هَذَا عَذَابٌ أَلِيمٌ إِلَى قَوْلِهِ إِنَّكُمْ عَائِدُونَ قَالَ أَفَيُكْشَفُ عَذَابُ الْآخِرَةِ يَوْمَ نَبْطِشُ الْبَطْشَةَ الْكُبْرَى إِنَّا مُنْتَقِمُونَ فَالْبَطْشَةُ يَوْمَ بَدْرٍ وَقَدْ مَضَتْ آيَةُ الدُّخَانِ وَالْبَطْشَةُ وَاللِّزَامُ وَآيَةُ الرُّومِ"
      },
      {
        "id": 14628,
        "hadith_number": "7067",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Asap pada Hari Kiamat dan Doa untuk Kaum Mudar",
        "perawi_melayu": "Masruq",
        "english_text": "Masruq reported that there came to Abdullah a person and said: I have left behind in the mosque a man who explains the Qur'an according to his personal discretion and he explained this verse: So wait for the day when the Heaven brings a clear smoke. He says that a smoke would come to the people on the Day of Resurrection anl it will withhold breath and they would be inflicted with cold. 'Abdullah said: He who has knowledge should say something and he who has no knowledge should simply say: Allah is best aware. This reflects the understanding of a person that he should say about that which he does not know that it is Allah who knows best. The fact is that when the Quraish disobeyed Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) he supplicated Allah that they should be afflicted with famine and starvation as was done in case of Yusuf. And they were so much hard pressed that a person would ace the sky and he would see between him and the sky something like smoke and they were so much hard pressed that they began to cat the bones, and a person came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said: Allah's Messenger. seek forgiveness for the tribe of Mudar for (its people) have been undone. The Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: For Mudar? You are overbold, but he supplicated Allah for them. It was upon this that this verse was revealed: We shall remove the chastisement a little, but they will surely return to evil (xliv. 15). lie (the narrator) said: There was a downpoor of rain upon them. When there was some relief for them they returned to the same position as they had been before, and Allah, the Exalted and Glorious, revealed this verse: So wait for the day when the heaven brings a clear smoke enveloping people. This is a grievous torment on the day when We seize them with the most violent seizing; surely, We shall exact retribution. And this (seizing) implied (Battle) of Badr.",
        "malay_translation": "Masruq meriwayatkan bahawa seorang lelaki datang kepada Abdullah dan berkata: Aku telah meninggalkan di masjid seorang lelaki yang menjelaskan al-Quran mengikut tafsiran peribadinya, dan dia menjelaskan ayat ini:  Maka tunggulah hari (ketika) langit mendatangkan asap yang nyata. Dia berkata bahawa asap akan datang kepada manusia pada Hari Kiamat dan ia akan menahan nafas dan mereka akan ditimpa kesejukan. Abdullah berkata: Sesiapa yang mempunyai ilmu hendaklah berkata sesuatu, dan sesiapa yang tiada ilmu hendaklah berkata: Allah lebih mengetahui. Ini mencerminkan pemahaman seseorang bahawa dia harus berkata tentang apa yang dia tidak ketahui bahawa Allah yang Maha Mengetahui.  Hakikatnya, apabila kaum Quraisy menderhaka kepada Rasulullah ﷺ, baginda berdoa kepada Allah agar mereka ditimpa kebuluran dan kelaparan seperti yang berlaku kepada Yusuf. Dan mereka sangat susah sehingga seseorang akan memandang langit dan dia akan melihat di antara dirinya dan langit sesuatu yang seperti asap, dan mereka sangat susah sehingga mereka mula memakan tulang-tulang, dan seorang lelaki datang kepada Rasulullah ﷺ dan berkata: Wahai Rasulullah, mohonkan ampun untuk kaum Mudar kerana mereka telah binasa. Rasulullah ﷺ bersabda: Untuk kaum Mudar? Kamu terlalu berani, tetapi baginda berdoa untuk mereka.  Atas dasar itulah ayat ini diwahyukan: Maka Kami akan hilangkan sedikit azab itu, tetapi mereka akan kembali kepada kejahatan (44:15).  (Perawi) berkata: Kemudian turunlah hujan lebat kepada mereka. Apabila mereka mendapat sedikit kelegaan, mereka kembali kepada keadaan seperti sebelumnya, dan Allah SWT mewahyukan ayat ini: Maka tunggulah hari (ketika) langit mendatangkan asap yang nyata meliputi manusia.  Ini adalah azab yang pedih pada hari (ketika) Kami akan menangkap mereka dengan tangkapan yang paling hebat; sesungguhnya, Kami akan memberikan balasan. Dan tangkapan ini merujuk kepada Perang Badar.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ وَوَكِيعٌ ح و حَدَّثَنِي أَبُو سَعِيدٍ الْأَشَجُّ أَخْبَرَنَا وَكِيعٌ ح و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ كُلُّهُمْ عَنْ الْأَعْمَشِ ح و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو كُرَيْبٍ وَاللَّفْظُ لِيَحْيَى قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ مُسْلِمِ بْنِ صُبَيْحٍ عَنْ مَسْرُوقٍ قَالَ جَاءَ إِلَى عَبْدِ اللَّهِ رَجُلٌ فَقَالَ تَرَكْتُ فِي الْمَسْجِدِ رَجُلًا يُفَسِّرُ الْقُرْآنَ بِرَأْيِهِ يُفَسِّرُ هَذِهِ الْآيَةَ يَوْمَ تَأْتِي السَّمَاءُ بِدُخَانٍ مُبِينٍ قَالَ يَأْتِي النَّاسَ يَوْمَ الْقِيَامَةِ دُخَانٌ فَيَأْخُذُ بِأَنْفَاسِهِمْ حَتَّى يَأْخُذَهُمْ مِنْهُ كَهَيْئَةِ الزُّكَامِ فَقَالَ عَبْدُ اللَّهِ مَنْ عَلِمَ عِلْمًا فَلْيَقُلْ بِهِ وَمَنْ لَمْ يَعْلَمْ فَلْيَقُلْ اللَّهُ أَعْلَمُ مِنْ فِقْهِ الرَّجُلِ أَنْ يَقُولَ لِمَا لَا عِلْمَ لَهُ بِهِ اللَّهُ أَعْلَمُ إِنَّمَا كَانَ هَذَا أَنَّ قُرَيْشًا لَمَّا اسْتَعْصَتْ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعَا عَلَيْهِمْ بِسِنِينَ كَسِنِي يُوسُفَ فَأَصَابَهُمْ قَحْطٌ وَجَهْدٌ حَتَّى جَعَلَ الرَّجُلُ يَنْظُرُ إِلَى السَّمَاءِ فَيَرَى بَيْنَهُ وَبَيْنَهَا كَهَيْئَةِ الدُّخَانِ مِنْ الْجَهْدِ وَحَتَّى أَكَلُوا الْعِظَامَ فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ اسْتَغْفِرْ اللَّهَ لِمُضَرَ فَإِنَّهُمْ قَدْ هَلَكُوا فَقَالَ لِمُضَرَ إِنَّكَ لَجَرِيءٌ قَالَ فَدَعَا اللَّهَ لَهُمْ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ إِنَّا كَاشِفُوا الْعَذَابِ قَلِيلًا إِنَّكُمْ عَائِدُونَ قَالَ فَمُطِرُوا فَلَمَّا أَصَابَتْهُمْ الرَّفَاهِيَةُ قَالَ عَادُوا إِلَى مَا كَانُوا عَلَيْهِ قَالَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ فَارْتَقِبْ يَوْمَ تَأْتِي السَّمَاءُ بِدُخَانٍ مُبِينٍ يَغْشَى النَّاسَ هَذَا عَذَابٌ أَلِيمٌ يَوْمَ نَبْطِشُ الْبَطْشَةَ الْكُبْرَى إِنَّا مُنْتَقِمُونَ قَالَ يَعْنِي يَوْمَ بَدْرٍ"
      },
      {
        "id": 14629,
        "hadith_number": "7068",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Lima Tanda Kepercayaan Rasulullah",
        "perawi_melayu": "Abdullah",
        "english_text": "Abdullah said that five signs have (become things) of the past (and have proved the truth of the Holy Prophet): (Enveloping) by the smoke, inevitable (punishment to the Meccans at Badr), (the victory of) Rome, (violent) seizing (of the Meccans at Badr) and (the splitting up of) the Moon.",
        "malay_translation": "Abdullah berkata bahawa lima tanda telah (menjadi perkara) yang lalu (dan telah membuktikan kebenaran Nabi Muhammad SAW): (Kejadian) asap, azab (yang pasti kepada orang-orang Mekah di Badar), (kemenangan) Rom, (penawanan) yang ganas (orang-orang Mekah di Badar) dan (pecah belah) bulan.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي الضُّحَى عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ قَالَ خَمْسٌ قَدْ مَضَيْنَ الدُّخَانُ وَاللِّزَامُ وَالرُّومُ وَالْبَطْشَةُ وَالْقَمَرُ"
      },
      {
        "id": 14630,
        "hadith_number": "7069",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Sanad Hadith daripada A'mash",
        "perawi_melayu": "A'mash dan sanad yang sama",
        "english_text": "This hadith has been narrated on the authority of A'mash with the same chain of transmitters.",
        "malay_translation": "Hadis ini diriwayatkan melalui sanad yang sama daripada A'mash.",
        "arabic_text": "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ بِهَذَا الْإِسْنَادِ مِثْلَهُ"
      },
      {
        "id": 14631,
        "hadith_number": "7070",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Azab Dunia Sebelum Azab Akhirat",
        "perawi_melayu": "Ubayy b. Ka'b",
        "english_text": "Ubayy b. Ka'b reported that the words of Allah, the Exalted and Glorious: We will, surely, make them taste the lesser punishment before the severer punishment (that haply they may return) (xxxii. 21) imply the torments of the world. (victory of) Rome, seizing (of the Meccans), or smoke. And Shalba was in doubt about seizing or smoke.",
        "malay_translation": "Ubayy b. Ka'b meriwayatkan bahawa firman Allah SWT:  \"Sesungguhnya Kami akan memberi mereka merasai azab yang ringan sebelum azab yang berat, agar mereka kembali ( bertaubat)\" (Surah As-Sajdah: 21) merujuk kepada azab dunia.  (Kemenangan) Rom, penawanan (orang Mekah), atau asap.  Shalba ragu-ragu antara penawanan atau asap.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَاللَّفْظُ لَهُ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ عَزْرَةَ عَنْ الْحَسَنِ الْعُرَنِيِّ عَنْ يَحْيَى بْنِ الْجَزَّارِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أُبَيِّ بْنِ كَعْبٍ فِي قَوْلِهِ عَزَّ وَجَلَّ وَلَنُذِيقَنَّهُمْ مِنْ الْعَذَابِ الْأَدْنَى دُونَ الْعَذَابِ الْأَكْبَرِ قَالَ مَصَائِبُ الدُّنْيَا وَالرُّومُ وَالْبَطْشَةُ أَوْ الدُّخَانُ شُعْبَةُ الشَّاكُّ فِي الْبَطْشَةِ أَوْ الدُّخَانِ"
      },
      {
        "id": 14632,
        "hadith_number": "7071",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pembelahan Bulan pada Zaman Rasulullah",
        "perawi_melayu": "Abu Ma'mar melalui Abdullah",
        "english_text": "Abu Ma'mar reported on the authority of Abdullah that the moon was split up during lifetime by Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in two parts and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Bear testimony to this.",
        "malay_translation": "Abu Ma'mar meriwayatkan daripada Abdullah bahawa bulan telah dibelah kepada dua bahagian semasa hayat Rasulullah ﷺ, dan Rasulullah ﷺ bersabda: “Saksikanlah perkara ini.”",
        "arabic_text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ عَنْ أَبِي مَعْمَرٍ عَنْ عَبْدِ اللَّهِ قَالَ انْشَقَّ الْقَمَرُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشِقَّتَيْنِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اشْهَدُوا"
      },
      {
        "id": 14633,
        "hadith_number": "7072",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Peristiwa Pembelahan Bulan di Mina",
        "perawi_melayu": "Abdullah bin Mas'ud",
        "english_text": "This hadith has been transmitted on the authority of Abdullah b. Mas'ud (who said): We were along with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) at Mina, that moon was split up into two. One of its parts was behind the mountain and the other one was on this side of the mountain. Allah's Messenger (may peace be upbn him) said to us: Bear witness to this.",
        "malay_translation": "Hadis ini diriwayatkan daripada Abdullah bin Mas'ud yang berkata: Kami berada bersama Rasulullah ﷺ di Mina, ketika bulan terbelah dua. Sebahagiannya berada di sebalik gunung dan sebahagian lagi di sebelah sini. Rasulullah ﷺ bersabda kepada kami: Saksikanlah peristiwa ini.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ ح و حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ حَدَّثَنَا أَبِي كِلَاهُمَا عَنْ الْأَعْمَشِ ح و حَدَّثَنَا مِنْجَابُ بْنُ الْحَارِثِ التَّمِيمِيُّ وَاللَّفْظُ لَهُ أَخْبَرَنَا ابْنُ مُسْهِرٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ أَبِي مَعْمَرٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ بَيْنَمَا نَحْنُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى إِذَا انْفَلَقَ الْقَمَرُ فِلْقَتَيْنِ فَكَانَتْ فِلْقَةٌ وَرَاءَ الْجَبَلِ وَفِلْقَةٌ دُونَهُ فَقَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اشْهَدُوا"
      },
      {
        "id": 14634,
        "hadith_number": "7073",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pembelahan Bulan Ketika Zaman Rasulullah",
        "perawi_melayu": "Abdullah bin Mas'ud",
        "english_text": "Abdullah b. Mas'ud reported that the moon was split up in two parts during the lifetime of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). The mountain covered one of its parts and one part of it was above the mountain and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Bear witness to this.",
        "malay_translation": "Abdullah bin Mas'ud meriwayatkan bahawa bulan telah terbelah kepada dua bahagian ketika zaman Rasulullah SAW.  Sebahagiannya tertutup oleh gunung dan sebahagian lagi berada di atas gunung, dan Rasulullah SAW bersabda: “Saksikanlah ini.”",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ أَبِي مَعْمَرٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ انْشَقَّ الْقَمَرُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِلْقَتَيْنِ فَسَتَرَ الْجَبَلُ فِلْقَةً وَكَانَتْ فِلْقَةٌ فَوْقَ الْجَبَلِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ اشْهَدْ"
      },
      {
        "id": 14635,
        "hadith_number": "7074",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Sanad Lain Menerangkan Perihal Hadis Ini",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Another chain of transmitters reported the like of this hadith.",
        "malay_translation": "Satu lagi sanad periwayat meriwayatkan perkara yang serupa dengan hadis ini.",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ الْأَعْمَشِ عَنْ مُجَاهِدٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَ ذَلِكَ"
      },
      {
        "id": 14636,
        "hadith_number": "7075",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perbezaan Ringkas Perawi Dalam Hadis",
        "perawi_melayu": "Syuba",
        "english_text": "This hadith has been transmitted on the authority of Shu'ba with a slight variation of wording.",
        "malay_translation": "Hadis ini telah diriwayatkan daripada Syuba dengan sedikit perbezaan lafaz.",
        "arabic_text": "و حَدَّثَنِيهِ بِشْرُ بْنُ خَالِدٍ أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ح و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ كِلَاهُمَا عَنْ شُعْبَةَ بِإِسْنَادِ ابْنِ مُعَاذٍ عَنْ شُعْبَةَ نَحْوَ حَدِيثِهِ غَيْرَ أَنَّ فِي حَدِيثِ ابْنِ أَبِي عَدِيٍّ فَقَالَ اشْهَدُوا اشْهَدُوا"
      },
      {
        "id": 14637,
        "hadith_number": "7076",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Peristiwa Pembelahan Bulan",
        "perawi_melayu": "Anas",
        "english_text": "Anas reported that the people of Mecca demanded from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) that he should show them (some) signs (miracles) and he showed twice the splitting of the moon.",
        "malay_translation": "Anas meriwayatkan bahawa penduduk Mekah meminta Rasulullah ﷺ menunjukkan kepada mereka beberapa mukjizat, dan baginda menunjukkan dua kali peristiwa pembelahan bulan.",
        "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ وَعَبْدُ بْنُ حُمَيْدٍ قَالَا حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ حَدَّثَنَا شَيْبَانُ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسٍ أَنَّ أَهْلَ مَكَّةَ سَأَلُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُرِيَهُمْ آيَةً فَأَرَاهُمْ انْشِقَاقَ الْقَمَرِ مَرَّتَيْنِ"
      },
      {
        "id": 14638,
        "hadith_number": "7077",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Sanad Hadis daripada Anas",
        "perawi_melayu": "Daripada Anas melalui beberapa perawi lain.",
        "english_text": "This hadlth has been narrated on the authority of Anas through another chain of transmitters.",
        "malay_translation": "Hadis ini diriwayatkan daripada Anas melalui sanad yang lain.",
        "arabic_text": "و حَدَّثَنِيهِ مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ بِمَعْنَى حَدِيثِ شَيْبَانَ"
      },
      {
        "id": 14639,
        "hadith_number": "7078",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pembelahan Bulan",
        "perawi_melayu": "Anas",
        "english_text": "Anas reported that the moon was split up in two parts and in the hadith recorded in Abu Dawud, the words are: The moon was split up into two parts during the life of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
        "malay_translation": "Anas meriwayatkan bahawa bulan terbelah kepada dua bahagian dan di dalam hadis yang diriwayatkan di dalam Abu Daud, lafaznya adalah: Bulan terbelah kepada dua bahagian semasa hayat Rasulullah SAW.",
        "arabic_text": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ وَأَبُو دَاوُدَ ح و حَدَّثَنَا ابْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ جَعْفَرٍ وَأَبُو دَاوُدَ كُلُّهُمْ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَ انْشَقَّ الْقَمَرُ فِرْقَتَيْنِ وَفِي حَدِيثِ أَبِي دَاوُدَ انْشَقَّ الْقَمَرُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ"
      },
      {
        "id": 14640,
        "hadith_number": "7079",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pembelahan Bulan Pada Zaman Rasulullah SAW",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "Ibn 'Abbas reported that the moon was split up during the lifetime of Allah's Messenger (may peace he upon him).",
        "malay_translation": "Ibn Abbas meriwayatkan bahawa bulan telah terbelah dua pada zaman Rasulullah SAW.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ قُرَيْشٍ التَّمِيمِيُّ حَدَّثَنَا إِسْحَقُ بْنُ بَكْرِ بْنِ مُضَرَ حَدَّثَنِي أَبِي حَدَّثَنَا جَعْفَرُ بْنُ رَبِيعَةَ عَنْ عِرَاكِ بْنِ مَالِكٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ عَنْ ابْنِ عَبَّاسٍ قَالَ إِنَّ الْقَمَرَ انْشَقَّ عَلَى زَمَانِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ"
      },
      {
        "id": 14641,
        "hadith_number": "7080",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kesabaran Allah SWT Mendengar Perkara Yang Paling Menyusahkan",
        "perawi_melayu": "Abu Musa",
        "english_text": "Abu Musa reported that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: There is none to show more patience at listening to the most irksome things than Allah, the Exalted and Glorious. 'Partnership is associated to Him (polytheism), and (fatherhood) of a child is attributed to Him, but in spite of this He protects them (people) and provides them sustenance.'",
        "malay_translation": "Abu Musa meriwayatkan bahawa Rasulullah SAW bersabda: Tiada sesiapa yang lebih sabar mendengar perkara-perkara yang paling menyakitkan hati melainkan Allah SWT Yang Maha Tinggi dan Maha Mulia.  'Syirik dikaitkan kepada-Nya, dan (kebapaan) anak diatributkan kepada-Nya, tetapi walaupun begitu, Dia melindungi mereka (manusia) dan memberi mereka rezeki.'",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ وَأَبُو أُسَامَةَ عَنْ الْأَعْمَشِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ عَنْ أَبِي مُوسَى قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا أَحَدَ أَصْبَرُ عَلَى أَذًى يَسْمَعُهُ مِنْ اللَّهِ عَزَّ وَجَلَّ إِنَّهُ يُشْرَكُ بِهِ وَيُجْعَلُ لَهُ الْوَلَدُ ثُمَّ هُوَ يُعَافِيهِمْ وَيَرْزُقُهُمْ"
      },
      {
        "id": 14642,
        "hadith_number": "7081",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perbezaan Ringkas Perawi Hadis daripada Abu Musa",
        "perawi_melayu": "Abu Musa al-Asy'ari",
        "english_text": "This hadith has been transmitted on the authority of Abu Musa with a slight variation of wording.",
        "malay_translation": "Hadis ini diriwayatkan daripada Abu Musa dengan sedikit perbezaan lafaz.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَأَبُو سَعِيدٍ الْأَشَجُّ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ حَدَّثَنَا سَعِيدُ بْنُ جُبَيْرٍ عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ عَنْ أَبِي مُوسَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ إِلَّا قَوْلَهُ وَيُجْعَلُ لَهُ الْوَلَدُ فَإِنَّهُ لَمْ يَذْكُرْهُ"
      },
      {
        "id": 14643,
        "hadith_number": "7082",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kesabaran Allah SWT Mendengar Perkara Yang Paling Mengecewakan",
        "perawi_melayu": "Abdullah b. Qais",
        "english_text": "Abdullah b. Qais reported from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) that none is more forbearing in listening to the most irksome things than Allah, the Exalted. They associate rivals with him, attribute sonhood to Him, but in spite of this He provides them sustenance, grants them safety, confers upon them so many things.",
        "malay_translation": "Abdullah bin Qais meriwayatkan daripada Rasulullah SAW bahawa tiada siapa yang lebih penyabar dalam mendengar perkara-perkara yang paling menyakitkan hati melainkan Allah SWT. Mereka mempersekutukan-Nya, menuduh-Nya mempunyai anak, tetapi walaupun begitu, Dia masih memberi mereka rezeki, keselamatan, dan kurniaan yang banyak.",
        "arabic_text": "و حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ الْأَعْمَشِ حَدَّثَنَا سَعِيدُ بْنُ جُبَيْرٍ عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ قَالَ قَالَ عَبْدُ اللَّهِ بْنُ قَيْسٍ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَحَدٌ أَصْبَرَ عَلَى أَذًى يَسْمَعُهُ مِنْ اللَّهِ تَعَالَى إِنَّهُمْ يَجْعَلُونَ لَهُ نِدًّا وَيَجْعَلُونَ لَهُ وَلَدًا وَهُوَ مَعَ ذَلِكَ يَرْزُقُهُمْ وَيُعَافِيهِمْ وَيُعْطِيهِمْ"
      },
      {
        "id": 14644,
        "hadith_number": "7083",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Azab Akhirat dan Janji Allah",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "Anas b. Malik reported Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Allah, the Exalted and High, would say to one who shall have to undergo the least torture (on the Day of Resurrection): Would you like to go as ransom if you had all worldly riches; he would say: Yes. Allah would say to him: When you were in the loins of Adam, I demanded from you something easier than this that you should not associate anything with Me. (The narrator says): I think He also said: I would not cause you to enter Hell-Fire but you defied and attributed Divinity (to others besides Me).",
        "malay_translation": "Anas bin Malik meriwayatkan bahawa Rasulullah ﷺ bersabda: Allah SWT akan berfirman kepada seseorang yang akan menanggung azab paling ringan pada Hari Kiamat: “Adakah engkau mahu ditebus dengan semua kekayaan dunia?”  Dia akan menjawab: “Ya.” Allah SWT akan berfirman kepadanya: “Ketika engkau berada di dalam tulang sulbi Adam, Aku telah meminta sesuatu yang lebih mudah daripada ini iaitu supaya engkau tidak menyekutukan-Ku dengan sesuatu.” (Perawi berkata): Saya fikir baginda juga bersabda: “Aku tidak akan memasukkanmu ke dalam neraka, tetapi engkau telah derhaka dan mempertuhankan selain-Ku.”",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَقُولُ اللَّهُ تَبَارَكَ وَتَعَالَى لِأَهْوَنِ أَهْلِ النَّارِ عَذَابًا لَوْ كَانَتْ لَكَ الدُّنْيَا وَمَا فِيهَا أَكُنْتَ مُفْتَدِيًا بِهَا فَيَقُولُ نَعَمْ فَيَقُولُ قَدْ أَرَدْتُ مِنْكَ أَهْوَنَ مِنْ هَذَا وَأَنْتَ فِي صُلْبِ آدَمَ أَنْ لَا تُشْرِكَ أَحْسِبُهُ قَالَ وَلَا أُدْخِلَكَ النَّارَ فَأَبَيْتَ إِلَّا الشِّرْكَ"
      },
      {
        "id": 14645,
        "hadith_number": "7084",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ancaman Neraka",
        "perawi_melayu": "Anas bin Malik (melalui sanad lain dengan sedikit perbezaan lafaz)",
        "english_text": "This hadith has been narrated on the authority of Anas b. Malik through another chain of transmitters, but with a slight variation of wording (and the words are): I shall cause him to enter Hell. (The words subsequent to these) have not been mentioned.",
        "malay_translation": "Hadis ini diriwayatkan daripada Anas bin Malik melalui sanad lain, tetapi dengan sedikit perbezaan lafaz.  Lafaznya ialah:  Aku akan memasukkannya ke dalam neraka. (Lafaz-lafaz selepasnya) tidak disebut.",
        "arabic_text": "حَدَّثَنَاه مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي عِمْرَانَ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يُحَدِّثُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ إِلَّا قَوْلَهُ وَلَا أُدْخِلَكَ النَّارَ فَإِنَّهُ لَمْ يَذْكُرْهُ"
      },
      {
        "id": 14646,
        "hadith_number": "7085",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kebebasan di Hari Kiamat",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "Anas b. Malik reported that Allah's Messenger (may peace be u n him) said: It would be said to the non-believers on the Day of Resurrection: If you were to possess gold, filling the whole earth, would you like to secure your freedom by paying that? He would say: Yes. Thereupon it would be said to him: Something easier (than this) was demanded from you (but you paid no heed to it).",
        "malay_translation": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda:  Akan dikatakan kepada orang-orang kafir pada Hari Kiamat:  Andainya kamu memiliki emas yang memenuhi seluruh bumi, adakah kamu mahu menebus kebebasanmu dengannya?  Dia akan berkata: Ya.  Maka akan dikatakan kepadanya: Sesuatu yang lebih mudah daripada ini telah diminta daripada kamu (tetapi kamu tidak menghiraukannya).",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ الْآخَرُونَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنَا أَبِي عَنْ قَتَادَةَ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يُقَالُ لِلْكَافِرِ يَوْمَ الْقِيَامَةِ أَرَأَيْتَ لَوْ كَانَ لَكَ مِلْءُ الْأَرْضِ ذَهَبًا أَكُنْتَ تَفْتَدِي بِهِ فَيَقُولُ نَعَمْ فَيُقَالُ لَهُ قَدْ سُئِلْتَ أَيْسَرَ مِنْ ذَلِكَ"
      },
      {
        "id": 14647,
        "hadith_number": "7086",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kebohongan dan Keesaan Allah",
        "perawi_melayu": "Anas (melalui beberapa perawi)",
        "english_text": "Anas reported this hadlth through another chain of transmitters and the words are: It would be said to him: You have told a lie; what had been demanded from you was quite easier than this (the belief in the Oneness of Allah).",
        "malay_translation": "Anas meriwayatkan hadis ini melalui sanad lain, dan katanya:  Dia akan dikatakan kepadanya:  Engkau telah berdusta; apa yang dituntut darimu adalah lebih mudah daripada ini (yakni, aqidah tauhid kepada Allah).",
        "arabic_text": "و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ ح و حَدَّثَنِي عَمْرُو بْنُ زُرَارَةَ أَخْبَرَنَا عَبْدُ الْوَهَّابِ يَعْنِي ابْنَ عَطَاءٍ كِلَاهُمَا عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ فَيُقَالُ لَهُ كَذَبْتَ قَدْ سُئِلْتَ مَا هُوَ أَيْسَرُ مِنْ ذَلِكَ"
      },
      {
        "id": 14648,
        "hadith_number": "7087",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kemampuan Allah Mengumpulkan Kaum Kafir pada Hari Kiamat",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "Anas b. Malik reported that a person said: Allah's Messenger, how the non-believers be made to assemble on the Day of Resurrection (by crawling) on their faces? Thereupon he said: Is He Who is powerful to make them walk on their feet not powerful enough to make them (crawl) upon their faces on the Day of Resurrection? Qatada said: Of course, it is so. (He adjured): By the might of our Lord.",
        "malay_translation": "Anas bin Malik meriwayatkan bahawa seseorang bertanya: Wahai Rasulullah, bagaimanakah orang-orang kafir akan dikumpulkan pada Hari Kiamat dengan merangkak di atas muka mereka?  Lalu Baginda menjawab: Adakah Allah yang Maha Kuasa untuk menjadikan mereka berjalan dengan kaki tidak cukup berkuasa untuk menjadikan mereka merangkak di atas muka mereka pada Hari Kiamat? Qatadah berkata: Sudah tentu, begitulah. (Beliau bersumpah): Demi keagungan Tuhan kita.",
        "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ وَعَبْدُ بْنُ حُمَيْدٍ وَاللَّفْظُ لِزُهَيْرٍ قَالَا حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ حَدَّثَنَا شَيْبَانُ عَنْ قَتَادَةَ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ أَنَّ رَجُلًا قَالَ يَا رَسُولَ اللَّهِ كَيْفَ يُحْشَرُ الْكَافِرُ عَلَى وَجْهِهِ يَوْمَ الْقِيَامَةِ قَالَ أَلَيْسَ الَّذِي أَمْشَاهُ عَلَى رِجْلَيْهِ فِي الدُّنْيَا قَادِرًا عَلَى أَنْ يُمْشِيَهُ عَلَى وَجْهِهِ يَوْمَ الْقِيَامَةِ قَالَ قَتَادَةُ بَلَى وَعِزَّةِ رَبِّنَا"
      },
      {
        "id": 14649,
        "hadith_number": "7088",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kesenangan dan Kesusahan di Akhirat",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "Anas b. Malik reported that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said that one amongst the denizens of Hell who had led a life of ease and plenty amongst the people of the world would be made to dip in Fire only once on the Day of Resurrection and then it would be said to him: O, son of Adam, did you find any comfort, did you happen to get any material blessing? He would say: By Allah, no, my Lord. And then that person from amongst the persons of the world be brought who had led the most miserable life (in the world) from amongst the inmates of Paradise. and he would be made to dip once in Paradise and it would be said to him. 0, son of Adam, did you face, any hardship? Or had any distress fallen to your lot? And he would say: By Allah, no,0 my Lord, never did I face any hardship or experience any distress.",
        "malay_translation": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda bahawa seorang daripada penduduk neraka yang telah menjalani kehidupan senang dan mewah di dunia akan dicelupkan ke dalam neraka hanya sekali pada Hari Kiamat, kemudian akan ditanya kepadanya: Wahai anak Adam, adakah engkau mendapat sebarang kesenangan, adakah engkau mendapat sebarang nikmat duniawi? Dia akan menjawab: Demi Allah, tidak, ya Tuhanku. Kemudian akan dibawa orang yang paling sengsara hidupnya di dunia daripada penduduk syurga. Dan dia akan dicelupkan sekali ke dalam syurga dan akan ditanya kepadanya: Wahai anak Adam, adakah engkau menghadapi sebarang kesusahan? Atau adakah sebarang kesedihan menimpa dirimu? Dan dia akan menjawab: Demi Allah, tidak, ya Tuhanku, aku tidak pernah menghadapi sebarang kesusahan atau mengalami sebarang kesedihan.",
        "arabic_text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُؤْتَى بِأَنْعَمِ أَهْلِ الدُّنْيَا مِنْ أَهْلِ النَّارِ يَوْمَ الْقِيَامَةِ فَيُصْبَغُ فِي النَّارِ صَبْغَةً ثُمَّ يُقَالُ يَا ابْنَ آدَمَ هَلْ رَأَيْتَ خَيْرًا قَطُّ هَلْ مَرَّ بِكَ نَعِيمٌ قَطُّ فَيَقُولُ لَا وَاللَّهِ يَا رَبِّ وَيُؤْتَى بِأَشَدِّ النَّاسِ بُؤْسًا فِي الدُّنْيَا مِنْ أَهْلِ الْجَنَّةِ فَيُصْبَغُ صَبْغَةً فِي الْجَنَّةِ فَيُقَالُ لَهُ يَا ابْنَ آدَمَ هَلْ رَأَيْتَ بُؤْسًا قَطُّ هَلْ مَرَّ بِكَ شِدَّةٌ قَطُّ فَيَقُولُ لَا وَاللَّهِ يَا رَبِّ مَا مَرَّ بِي بُؤْسٌ قَطُّ وَلَا رَأَيْتُ شِدَّةً قَطُّ"
      },
      {
        "id": 14650,
        "hadith_number": "7089",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keadilan Allah terhadap Orang Mukmin dan Kafir",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "Anas b. Malik reported that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Verily, Allah does not treat a believer unjustly in regard to his virtues. He would confer upon him (His blessing) in this world and would give him reward in the Hereafter. And as regards a non-believer, he would be made to taste the reward (of virtue in this world) what he has done for himself so much that when it would be the Hereafter, he would find no virtue for which he should be rewarded.",
        "malay_translation": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda:  Sesungguhnya, Allah tidak akan berlaku zalim kepada orang beriman berkenaan dengan kebaikannya.  Allah akan memberikan nikmat kepada orang beriman di dunia dan pahala di akhirat.  Adapun orang kafir, dia akan merasai balasan (kebaikan di dunia) hasil usahanya sendiri, sehingga apabila sampai di akhirat, dia tidak akan menemui sebarang kebaikan yang layak diberi pahala.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَاللَّفْظُ لِزُهَيْرٍ قَالَا حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا هَمَّامُ بْنُ يَحْيَى عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ لَا يَظْلِمُ مُؤْمِنًا حَسَنَةً يُعْطَى بِهَا فِي الدُّنْيَا وَيُجْزَى بِهَا فِي الْآخِرَةِ وَأَمَّا الْكَافِرُ فَيُطْعَمُ بِحَسَنَاتِ مَا عَمِلَ بِهَا لِلَّهِ فِي الدُّنْيَا حَتَّى إِذَا أَفْضَى إِلَى الْآخِرَةِ لَمْ تَكُنْ لَهُ حَسَنَةٌ يُجْزَى بِهَا"
      },
      {
        "id": 14651,
        "hadith_number": "7090",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ganjaran Amal Orang Kafir dan Mukmin",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "Anas b. Malik reported that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) thus told him: When a non-believer does good he is made to taste Its reward in this world. And so far as the believer is concerned, Allah stores (the reward) of his virtues for the Hereafter and provides him sustenance in accordance with his obedience to Him.",
        "malay_translation": "Anas bin Malik meriwayatkan bahawa Rasulullah ﷺ bersabda: \"Apabila orang kafir berbuat kebaikan, dia akan merasai pahalanya di dunia ini.  Adapun orang mukmin, Allah menyimpan pahala kebaikannya untuk akhirat dan memberi rezekinya mengikut ketaatannya kepada Allah.\"",
        "arabic_text": "حَدَّثَنَا عَاصِمُ بْنُ النَّضْرِ التَّيْمِيُّ حَدَّثَنَا مُعْتَمِرٌ قَالَ سَمِعْتُ أَبِي حَدَّثَنَا قَتَادَةُ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ حَدَّثَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الْكَافِرَ إِذَا عَمِلَ حَسَنَةً أُطْعِمَ بِهَا طُعْمَةً مِنْ الدُّنْيَا وَأَمَّا الْمُؤْمِنُ فَإِنَّ اللَّهَ يَدَّخِرُ لَهُ حَسَنَاتِهِ فِي الْآخِرَةِ وَيُعْقِبُهُ رِزْقًا فِي الدُّنْيَا عَلَى طَاعَتِهِ"
      },
      {
        "id": 14652,
        "hadith_number": "7091",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Sanad Hadis daripada Anas bin Malik",
        "perawi_melayu": "Anas bin Malik melalui beberapa perawi lain.",
        "english_text": "This hadith has been narrated on the authority of Anas b. Malik through another chain of transmitters.",
        "malay_translation": "Hadis ini diriwayatkan daripada Anas bin Malik melalui sanad lain.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرُّزِّيُّ أَخْبَرَنَا عَبْدُ الْوَهَّابِ بْنُ عَطَاءٍ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِهِمَا"
      },
      {
        "id": 14653,
        "hadith_number": "7092",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perumpamaan Orang Mukmin dan Munafik",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Huraira reported Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The Similitude of a believer is that of (a standing) crop which the air continues to toss from one side to another; in the same way a believer always (receives the strokes) of misfortune. The similitude of a hypocrite is that of a cypress tree which does not move until it is uprooted.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda:  Perumpamaan orang mukmin seperti tanaman yang ditiup angin dari satu sisi ke sisi yang lain; begitu juga orang mukmin sentiasa ditimpa musibah.  Perumpamaan orang munafik pula seperti pokok aras yang tidak bergerak sehingga ia dicabut.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثَلُ الْمُؤْمِنِ كَمَثَلِ الزَّرْعِ لَا تَزَالُ الرِّيحُ تُمِيلُهُ وَلَا يَزَالُ الْمُؤْمِنُ يُصِيبُهُ الْبَلَاءُ وَمَثَلُ الْمُنَافِقِ كَمَثَلِ شَجَرَةِ الْأَرْزِ لَا تَهْتَزُّ حَتَّى تَسْتَحْصِدَ"
      },
      {
        "id": 14654,
        "hadith_number": "7093",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Variasi Ringkas Perawi Zuhri dalam Hadis",
        "perawi_melayu": "Zuhri dan sanad yang sama",
        "english_text": "This hadith has been narrated on the authority of Zuhri with the same chain of transmitters, but with a slight variation of wording.",
        "malay_translation": "Hadis ini diriwayatkan melalui sanad Zuhri dengan isnad yang sama, tetapi dengan sedikit perbezaan lafaz.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ عَنْ عَبْدِ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّ فِي حَدِيثِ عَبْدِ الرَّزَّاقِ مَكَانَ قَوْلِهِ تُمِيلُهُ تُفِيئُهُ"
      },
      {
        "id": 14655,
        "hadith_number": "7094",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perumpamaan Orang Mukmin dan Orang Kafir",
        "perawi_melayu": "Ka'b",
        "english_text": "Ka'b reported that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said that the similitude of a believer is that of a standing crop in a field which is shaken by wind and then it comes to its original position but it stands at its roots. The similitude of a non-believer is that of a cypress tree which stands on its roots and nothing shakes it but it is uprooted (with) one (violent stroke).",
        "malay_translation": "Ka'b meriwayatkan bahawa Rasulullah SAW bersabda: “Perumpamaan orang mukmin seperti tanaman yang berdiri teguh di ladang, ditiup angin kencang, kemudian kembali ke kedudukannya yang asal, tetapi tetap teguh di akarnya.  Perumpamaan orang kafir pula seperti pokok ara yang berdiri teguh di atas akarnya, dan tiada apa yang menggoncangkannya kecuali ia akan tumbang dengan satu tiupan yang kuat.”",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ وَمُحَمَّدُ بْنُ بِشْرٍ قَالَا حَدَّثَنَا زَكَرِيَّاءُ بْنُ أَبِي زَائِدَةَ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ حَدَّثَنِي ابْنُ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِ كَعْبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثَلُ الْمُؤْمِنِ كَمَثَلِ الْخَامَةِ مِنْ الزَّرْعِ تُفِيئُهَا الرِّيحُ تَصْرَعُهَا مَرَّةً وَتَعْدِلُهَا أُخْرَى حَتَّى تَهِيجَ وَمَثَلُ الْكَافِرِ كَمَثَلِ الْأَرْزَةِ الْمُجْذِيَةِ عَلَى أَصْلِهَا لَا يُفِيئُهَا شَيْءٌ حَتَّى يَكُونَ انْجِعَافُهَا مَرَّةً وَاحِدَةً"
      },
      {
        "id": 14656,
        "hadith_number": "7095",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perumpamaan Orang Mukmin dan Munafik",
        "perawi_melayu": "Ka'b bin Malik (daripada bapanya)",
        "english_text": "Ka'b b. Malik reported on the authority of his father that the similitude of a believer is that of a standing crop. The wind sometimes shakes it and sometimes raises it up and then it comes to its destined end. And the similitude of a hypocrite is that of a cypress tree which is not affected by anything but is uprooted once for all.",
        "malay_translation": "Ka'b bin Malik meriwayatkan daripada bapanya bahawa perumpamaan orang mukmin adalah seperti tanaman yang berdiri teguh. Angin kadang-kadang menggoncangkannya dan kadang-kadang mengangkatnya, kemudian ia sampai ke penghujung takdirnya.  Dan perumpamaan orang munafik adalah seperti pokok aras yang tidak terkesan oleh apa-apa, tetapi akan ditebang sekali gus.",
        "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثَلُ الْمُؤْمِنِ كَمَثَلِ الْخَامَةِ مِنْ الزَّرْعِ تُفِيئُهَا الرِّيَاحُ تَصْرَعُهَا مَرَّةً وَتَعْدِلُهَا حَتَّى يَأْتِيَهُ أَجَلُهُ وَمَثَلُ الْمُنَافِقِ مَثَلُ الْأَرْزَةِ الْمُجْذِيَةِ الَّتِي لَا يُصِيبُهَا شَيْءٌ حَتَّى يَكُونَ انْجِعَافُهَا مَرَّةً وَاحِدَةً"
      },
      {
        "id": 14657,
        "hadith_number": "7096",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Sama Seperti Hadis 7095",
        "perawi_melayu": "Rujukan Hadis 7095",
        "english_text": "Same as Hadees 7095",
        "malay_translation": "Sama seperti Hadis 7095",
        "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثَلُ الْمُؤْمِنِ كَمَثَلِ الْخَامَةِ مِنْ الزَّرْعِ تُفِيئُهَا الرِّيَاحُ تَصْرَعُهَا مَرَّةً وَتَعْدِلُهَا حَتَّى يَأْتِيَهُ أَجَلُهُ وَمَثَلُ الْمُنَافِقِ مَثَلُ الْأَرْزَةِ الْمُجْذِيَةِ الَّتِي لَا يُصِيبُهَا شَيْءٌ حَتَّى يَكُونَ انْجِعَافُهَا مَرَّةً وَاحِدَةً"
      },
      {
        "id": 14658,
        "hadith_number": "7097",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perumpamaan Orang Kafir dalam Hadis",
        "perawi_melayu": "Sanad hadis ini diriwayatkan melalui beberapa jalur periwayat yang lain, satu jalur menyebutkan perumpamaan orang kafir dan satu lagi sependapat dengan lafaz hadis sebelumnya.",
        "english_text": "This hadith has been narrated through a couple of other chains of transmitters, one which says the similitude of the disbeliever instead and another which agrees with the wording of the previous hadith.",
        "malay_translation": "Hadis ini diriwayatkan melalui beberapa sanad lain.  Satu sanad menyebutkan perumpamaan orang kafir, manakala sanad yang lain pula sependapat dengan lafaz hadis sebelumnya.",
        "arabic_text": "و حَدَّثَنِيهِ مُحَمَّدُ بْنُ حَاتِمٍ وَمَحْمُودُ بْنُ غَيْلَانَ قَالَا حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ حَدَّثَنَا سُفْيَانُ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيْرَ أَنَّ مَحْمُودًا قَالَ فِي رِوَايَتِهِ عَنْ بِشْرٍ وَمَثَلُ الْكَافِرِ كَمَثَلِ الْأَرْزَةِ وَأَمَّا ابْنُ حَاتِمٍ فَقَالَ مَثَلُ الْمُنَافِقِ كَمَا قَالَ زُهَيْرٌ و حَدَّثَنَاه مُحَمَّدُ بْنُ بَشَّارٍ وَعَبْدُ اللَّهِ بْنُ هَاشِمٍ قَالَا حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ عَنْ سُفْيَانَ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ قَالَ ابْنُ هَاشِمٍ عَنْ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِ و قَالَ ابْنُ بَشَّارٍ عَنْ ابْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِ حَدِيثِهِمْ وَقَالَا جَمِيعًا فِي حَدِيثِهِمَا عَنْ يَحْيَى وَمَثَلُ الْكَافِرِ مَثَلُ الْأَرْزَةِ"
      },
      {
        "id": 14659,
        "hadith_number": "7098",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pokok Kurma Sebagai Umpama Muslim",
        "perawi_melayu": "Abdullah b. Umar",
        "english_text": "Abdullah b. Umar reported that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: There is a tree amongst trees, the leaves of which do not wither and that is like a Muslim; tell me which that (tree) can be? The people began to think of the trees of the forest. Abdullah said: I thought that it could be the date-palm tree, but I felt hesitant (to say that). They (the Companions) then said: Allah's Messenger, (kindly) tell us which that can be? Thereupon he said: It is the date-palm tree. I made a mention of that to 'Umar, whereupon he said: Had you said that it meant the date-palm tree, this statement of yours (would have been dearer to me) than such and such things.",
        "malay_translation": "Abdullah bin Umar meriwayatkan bahawa Rasulullah SAW bersabda: “Terdapat sejenis pohon di antara pohon-pohon, daunnya tidak layu, dan ia adalah seperti seorang Muslim. Katakanlah, pohon apakah itu?”  Orang ramai mula memikirkan pelbagai jenis pohon di hutan. Abdullah berkata: “Saya fikir ia mungkin pohon kurma, tetapi saya ragu-ragu untuk mengatakannya.”  Mereka (para sahabat) kemudian bertanya: “Wahai Rasulullah, beritahukanlah kepada kami, pohon apakah itu?”  Baginda kemudian bersabda: “Ia adalah pohon kurma.” Saya telah menceritakan hal ini kepada Umar, lalu beliau berkata: “Sekiranya engkau mengatakan ia adalah pohon kurma, penyataanmu itu lebih berharga bagiku daripada perkara-perkara lain.”",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ بْنُ سَعِيدٍ وَعَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ وَاللَّفْظُ لِيَحْيَى قَالُوا حَدَّثَنَا إِسْمَعِيلُ يَعْنُونَ ابْنَ جَعْفَرٍ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ دِينَارٍ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِنْ الشَّجَرِ شَجَرَةً لَا يَسْقُطُ وَرَقُهَا وَإِنَّهَا مَثَلُ الْمُسْلِمِ فَحَدِّثُونِي مَا هِيَ فَوَقَعَ النَّاسُ فِي شَجَرِ الْبَوَادِي قَالَ عَبْدُ اللَّهِ وَوَقَعَ فِي نَفْسِي أَنَّهَا النَّخْلَةُ فَاسْتَحْيَيْتُ ثُمَّ قَالُوا حَدِّثْنَا مَا هِيَ يَا رَسُولَ اللَّهِ قَالَ فَقَالَ هِيَ النَّخْلَةُ قَالَ فَذَكَرْتُ ذَلِكَ لِعُمَرَ قَالَ لَأَنْ تَكُونَ قُلْتَ هِيَ النَّخْلَةُ أَحَبُّ إِلَيَّ مِنْ كَذَا وَكَذَا"
      },
      {
        "id": 14660,
        "hadith_number": "7099",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pokok Kurma dan Orang Mukmin",
        "perawi_melayu": "Ibn Umar",
        "english_text": "Ibn Umar reported that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) one day said to his Companions: Tell me about a tree which has resemblance with a believer. The people began to mention (different) trees of the forest. Ibn 'Umar said: It was instilled in my mind or in my heart and it stuck therein that it implied the date- palm tree. I made up my mind to make a mention of that but could not do that because of the presence of the elderly people there. When there was a hush amongst them (after they had expressed their views), Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: It Is the date-palm tree.",
        "malay_translation": "Ibn Umar meriwayatkan bahawa Rasulullah SAW suatu hari bersabda kepada para sahabatnya: “Ceraikan kepada aku sebatang pohon yang mempunyai persamaan dengan seorang mukmin.”  Para sahabat mula menyebut pelbagai jenis pokok di hutan. Ibn Umar berkata: “Terlintas di fikiran atau di hatiku, dan ia terpahat di situ bahawa maksudnya adalah pokok kurma. Aku berazam untuk menyebutnya, tetapi aku tidak mampu berbuat demikian kerana kehadiran para alim ulama di situ. Setelah mereka menyuarakan pendapat masing-masing, maka Rasulullah SAW bersabda: “Ia adalah pokok kurma.”",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي الْخَلِيلِ الضُّبَعِيِّ عَنْ مُجَاهِدٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا لِأَصْحَابِهِ أَخْبِرُونِي عَنْ شَجَرَةٍ مَثَلُهَا مَثَلُ الْمُؤْمِنِ فَجَعَلَ الْقَوْمُ يَذْكُرُونَ شَجَرًا مِنْ شَجَرِ الْبَوَادِي قَالَ ابْنُ عُمَرَ وَأُلْقِيَ فِي نَفْسِي أَوْ رُوعِيَ أَنَّهَا النَّخْلَةُ فَجَعَلْتُ أُرِيدُ أَنْ أَقُولَهَا فَإِذَا أَسْنَانُ الْقَوْمِ فَأَهَابُ أَنْ أَتَكَلَّمَ فَلَمَّا سَكَتُوا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هِيَ النَّخْلَةُ"
      },
      {
        "id": 14661,
        "hadith_number": "7100",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Mujahid Mendengar Hadis daripada Ibnu Umar",
        "perawi_melayu": "Mujahid",
        "english_text": "Mujahid said: (I have had the privilege) of accompanying Ibn 'Umar up to Medina but I did not hear him narrate anything from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) except one hadith. And he said: We were in the presence of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) that there was brought to him the kernel of a date. The rest of the hadith is the same.",
        "malay_translation": "Mujahid berkata:  (Saya berpeluang) mengiringi Ibnu Umar sehingga ke Madinah, tetapi saya tidak pernah mendengarnya meriwayatkan sesuatu daripada Rasulullah ﷺ kecuali satu hadis. Dan beliau berkata: Kami berada di sisi Rasulullah ﷺ, lalu dihadiahkan kepadanya sebiji isi tamar (kurma).  Baki hadis tersebut adalah sama.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ أَبِي عُمَرَ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ قَالَ صَحِبْتُ ابْنَ عُمَرَ إِلَى الْمَدِينَةِ فَمَا سَمِعْتُهُ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا حَدِيثًا وَاحِدًا قَالَ كُنَّا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأُتِيَ بِجُمَّارٍ فَذَكَرَ بِنَحْوِ حَدِيثِهِمَا"
      },
      {
        "id": 14662,
        "hadith_number": "7101",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Bijirin yang Dibawa Kepada Rasulullah SAW",
        "perawi_melayu": "Mujahid (daripada Ibnu Umar)",
        "english_text": "Mujahid reported: I heard Ibn 'Umar as saying: There was brought to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) the kernel. The rest of the hadith is tile same.",
        "malay_translation": "Mujahid meriwayatkan: Aku mendengar Ibnu Umar berkata: Telah dibawa kepada Rasulullah SAW bijirin.  Baki hadis adalah sama.",
        "arabic_text": "و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا سَيْفٌ قَالَ سَمِعْتُ مُجَاهِدًا يَقُولُ سَمِعْتُ ابْنَ عُمَرَ يَقُولُ أُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِجُمَّارٍ فَذَكَرَ نَحْوَ حَدِيثِهِمْ"
      },
      {
        "id": 14663,
        "hadith_number": "7102",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Persamaan Pokok Kurma dengan Seorang Muslim",
        "perawi_melayu": "Ibn Umar",
        "english_text": "Ibn Umar reported: We were'in the company of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) that he said: Tell me of a tree which has resemblance to a Muslim and the leaves of which do not wither. Ibrahim said that perhaps Imam Muslim had stated like this: It constantly bears fruit but I have, however, seen [It does not bear fruit constantly]. Ibn Umar said: It crossed my mind that it could be the date-palm tree, but as I saw Aba Bakr and Umar observe silence, I did not deem it fit that I should speak or I should say something. 'Umar said: Had you said so, it would have been dearer to me than such and such thing.",
        "malay_translation": "Ibn Umar meriwayatkan: Kami berada di sisi Rasulullah ﷺ, baginda bertanya:  Ceritakan kepadaku sebatang pokok yang mempunyai persamaan dengan seorang Muslim dan daun-daunnya tidak layu. Ibrahim berkata bahawa mungkin Imam Muslim telah menyatakan seperti ini: Ia sentiasa berbuah, tetapi saya telah melihat [Ia tidak sentiasa berbuah]. Ibn Umar berkata: Terlintas di fikiran saya bahawa ia mungkin pokok kurma, tetapi kerana saya melihat Abu Bakar dan Umar  mendiamkan diri, saya tidak rasa sesuai untuk saya berkata-kata. Umar berkata: Sekiranya engkau mengatakannya, ia akan lebih berharga bagiku daripada perkara sebegini.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ كُنَّا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَخْبِرُونِي بِشَجَرَةٍ شِبْهِ أَوْ كَالرَّجُلِ الْمُسْلِمِ لَا يَتَحَاتُّ وَرَقُهَا قَالَ إِبْرَاهِيمُ لَعَلَّ مُسْلِمًا قَالَ وَتُؤْتِي أُكُلَهَا وَكَذَا وَجَدْتُ عِنْدَ غَيْرِي أَيْضًا وَلَا تُؤْتِي أُكُلَهَا كُلَّ حِينٍ قَالَ ابْنُ عُمَرَ فَوَقَعَ فِي نَفْسِي أَنَّهَا النَّخْلَةُ وَرَأَيْتُ أَبَا بَكْرٍ وَعُمَرَ لَا يَتَكَلَّمَانِ فَكَرِهْتُ أَنْ أَتَكَلَّمَ أَوْ أَقُولَ شَيْئًا فَقَالَ عُمَرُ لَأَنْ تَكُونَ قُلْتَهَا أَحَبُّ إِلَيَّ مِنْ كَذَا وَكَذَا"
      },
      {
        "id": 14664,
        "hadith_number": "7103",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Harapan Syaitan Menyemai Permusuhan",
        "perawi_melayu": "Jabir",
        "english_text": "Jabir reported: I heard Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Verily, the Satan has lost all hopes that the worshippers would ever worship (him) in the peninsula of Arabia, but he (is hopeful) that he would sow the seed of dissension amongst them.",
        "malay_translation": "Jabir meriwayatkan: Aku mendengar Rasulullah SAW bersabda: Sesungguhnya, syaitan telah hilang harapan bahawa para penyembah akan menyembahnya di Jazirah Arab, tetapi dia (berharap) bahawa dia akan menanam benih perselisihan di kalangan mereka.",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ عُثْمَانُ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ الشَّيْطَانَ قَدْ أَيِسَ أَنْ يَعْبُدَهُ الْمُصَلُّونَ فِي جَزِيرَةِ الْعَرَبِ وَلَكِنْ فِي التَّحْرِيشِ بَيْنَهُمْ"
      },
      {
        "id": 14665,
        "hadith_number": "7104",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Sanad Hadith daripada A'mash",
        "perawi_melayu": "A'mash dan sanad yang sama",
        "english_text": "This hadith has been narrated on the authority of A'mash with the same chain of transmitters.",
        "malay_translation": "Hadis ini diriwayatkan melalui A'mash dengan sanad yang sama.",
        "arabic_text": "و حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ كِلَاهُمَا عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ"
      },
      {
        "id": 14666,
        "hadith_number": "7105",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Takhta Iblis dan Ujian Fitnah",
        "perawi_melayu": "Jabir",
        "english_text": "Jabir reported: I heard Allah's Messenger (way peace be upon him) as saying: The throne of Iblis is upon the ocean and he sends detachments (to different parts) inorder to put people to trial and the most important figure in his eyes is one who is most notorious in sowing the seed of dissension.",
        "malay_translation": "Jabir meriwayatkan: Aku mendengar Rasulullah SAW bersabda: \"Takhta Iblis berada di atas lautan, dan dia menghantar pasukan-pasukan (ke pelbagai tempat) untuk menguji manusia, dan orang yang paling penting di matanya ialah orang yang paling terkenal dalam menabur benih perselisihan.\" ",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ عُثْمَانُ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ عَرْشَ إِبْلِيسَ عَلَى الْبَحْرِ فَيَبْعَثُ سَرَايَاهُ فَيَفْتِنُونَ النَّاسَ فَأَعْظَمُهُمْ عِنْدَهُ أَعْظَمُهُمْ فِتْنَةً"
      },
      {
        "id": 14667,
        "hadith_number": "7106",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Iblis dan Fitnah Perpecahan",
        "perawi_melayu": "Jabir",
        "english_text": "Jabir reported that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Iblis places his throne upon water; he then sends detachments (for creating dissension) ; the nearer to him in rank are those who are most notorious in creating dissension. One of them comes and says: I did so and so. And he says: You have done nothing. Then one amongst them comes and says: I did not spare so and so until I sowed the seed of discord between a husband and a wife. The Satan goes near him and says: You have done well. A'mash said: He then embraces him.",
        "malay_translation": "Jabir meriwayatkan bahawa Rasulullah ﷺ bersabda:  Iblis meletakkan takhtnya di atas air; kemudian dia menghantar pasukan (untuk mencipta perpecahan); yang lebih dekat kepadanya pangkatnya ialah mereka yang paling terkenal dalam mencipta perpecahan. Seorang daripada mereka datang dan berkata: Aku telah melakukan begini dan begitu. Dan Iblis berkata: Kamu tidak melakukan apa-apa. Kemudian seorang di antara mereka datang dan berkata: Aku tidak melepaskan begitu dan begitu sehingga aku menabur benih perselisihan di antara suami dan isteri. Syaitan itu mendekatinya dan berkata: Kamu telah melakukan dengan baik. A'mash berkata: Kemudian Iblis memeluknya.",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَاللَّفْظُ لِأَبِي كُرَيْبٍ قَالَا أَخْبَرَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ إِبْلِيسَ يَضَعُ عَرْشَهُ عَلَى الْمَاءِ ثُمَّ يَبْعَثُ سَرَايَاهُ فَأَدْنَاهُمْ مِنْهُ مَنْزِلَةً أَعْظَمُهُمْ فِتْنَةً يَجِيءُ أَحَدُهُمْ فَيَقُولُ فَعَلْتُ كَذَا وَكَذَا فَيَقُولُ مَا صَنَعْتَ شَيْئًا قَالَ ثُمَّ يَجِيءُ أَحَدُهُمْ فَيَقُولُ مَا تَرَكْتُهُ حَتَّى فَرَّقْتُ بَيْنَهُ وَبَيْنَ امْرَأَتِهِ قَالَ فَيُدْنِيهِ مِنْهُ وَيَقُولُ نِعْمَ أَنْتَ قَالَ الْأَعْمَشُ أُرَاهُ قَالَ فَيَلْتَزِمُهُ"
      },
      {
        "id": 14668,
        "hadith_number": "7107",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Syaitan Menyemai Permusuhan",
        "perawi_melayu": "Jabir",
        "english_text": "Jabir reported that Allah's Apostle (may peace be upqn him) said: The Satan sends detachments of his own in order to put people to trial and the highest in rank, in his eyes, is one who is most notorious in sowing the seed of dissension.",
        "malay_translation": "Jabir meriwayatkan bahawa Rasulullah SAW bersabda:  Syaitan menghantar pasukan-pasukannya untuk menguji manusia, dan yang paling tinggi darjatnya di sisi syaitan ialah orang yang paling terkenal dalam menabur benih permusuhan.",
        "arabic_text": "حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ حَدَّثَنَا مَعْقِلٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَبْعَثُ الشَّيْطَانُ سَرَايَاهُ فَيَفْتِنُونَ النَّاسَ فَأَعْظَمُهُمْ عِنْدَهُ مَنْزِلَةً أَعْظَمُهُمْ فِتْنَةً"
      },
      {
        "id": 14669,
        "hadith_number": "7108",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Setan dan Perlindungan Allah",
        "perawi_melayu": "Abdullah bin Mas'ud",
        "english_text": "Abdullah b. Mas'ud reported that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: There is none amongst you with whom is not an attache from amongst the jinn (devil). They (the Companions) said: Allah's Messenger, with you too? Thereupon he said: Yes, but Allah helps me against him and so I am safe from his hand and he does not command me but for good.",
        "malay_translation": "Abdullah bin Mas'ud meriwayatkan bahawa Rasulullah ﷺ bersabda: Tiada seorang pun di antara kamu melainkan ada bersama-sama dia seorang yang mengikut dari kalangan jin (syaitan). Mereka (para sahabat) berkata: Wahai Rasulullah, adakah engkau juga?  Lalu baginda bersabda: Ya, tetapi Allah menolongku terhadapnya, maka aku selamat daripada kejahatannya dan ia tidak menyuruhku melainkan kepada kebaikan.",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ عُثْمَانُ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْكُمْ مِنْ أَحَدٍ إِلَّا وَقَدْ وُكِّلَ بِهِ قَرِينُهُ مِنْ الْجِنِّ قَالُوا وَإِيَّاكَ يَا رَسُولَ اللَّهِ قَالَ وَإِيَّايَ إِلَّا أَنَّ اللَّهَ أَعَانَنِي عَلَيْهِ فَأَسْلَمَ فَلَا يَأْمُرُنِي إِلَّا بِخَيْرٍ"
      },
      {
        "id": 14670,
        "hadith_number": "7109",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Variasi Perkataan Hadis Daripada Manṣūr",
        "perawi_melayu": "Manṣūr (dan sanad yang sama dengan sedikit perbezaan lafaz)",
        "english_text": "This hadith has been narrated on the authority of Mansiir with the same chain of transmitters but with a slight variation of wording.",
        "malay_translation": "Hadis ini diriwayatkan daripada Manṣūr dengan sanad yang sama, tetapi dengan sedikit perbezaan lafaz.",
        "arabic_text": "حَدَّثَنَا ابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ يَعْنِيَانِ ابْنَ مَهْدِيٍّ عَنْ سُفْيَانَ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ عَمَّارِ بْنِ رُزَيْقٍ كِلَاهُمَا عَنْ مَنْصُورٍ بِإِسْنَادِ جَرِيرٍ مِثْلَ حَدِيثِهِ غَيْرَ أَنَّ فِي حَدِيثِ سُفْيَانَ وَقَدْ وُكِّلَ بِهِ قَرِينُهُ مِنْ الْجِنِّ وَقَرِينُهُ مِنْ الْمَلَائِكَةِ"
      },
      {
        "id": 14671,
        "hadith_number": "7110",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Cemburu Aisyah dan Syaitan",
        "perawi_melayu": "Aisyah r.a.",
        "english_text": "A'isha the wife of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), reported that one day Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came out of her (apartment) during the night and she felt jealous. Then he came and he saw me (in what agitated state of mind) I was. He said: A'isha, what has happened to you? Do you feel jealous? Thereupon she said: How can it be (that a woman like me) should not feel jealous in regard to a husband like you. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: It was your devil who had come to you, and she said: Allah's Messenger, is there along with me a devil? He said: Yes. I said: Is a devil attached to everyone? He said: Yes. I (Aisha) again said: Allah's Messenger, is it with you also? He said: Yes, but my Lord has helped me against him and as such I am absolutely safe from his mischief.",
        "malay_translation": "Aisyah, isteri Rasulullah ﷺ, meriwayatkan bahawa suatu malam, Rasulullah ﷺ keluar dari rumahnya dan Aisyah merasa cemburu. Kemudian baginda kembali dan melihat keadaan Aisyah yang gelisah. Baginda bertanya, \"Aisyah, apa yang terjadi kepadamu? Adakah engkau cemburu?\" Aisyah menjawab, \"Bagaimana mungkin aku tidak cemburu kepada suami sepertimu?\" Rasulullah ﷺ bersabda, \"Itu adalah syaitanmu yang mendatangimu.\" Aisyah bertanya, \"Wahai Rasulullah, adakah syaitan bersamaku?\" Baginda menjawab, \"Ya.\" Aisyah bertanya lagi, \"Adakah setiap orang mempunyai syaitan?\" Baginda menjawab, \"Ya.\" Aisyah bertanya lagi, \"Wahai Rasulullah, adakah syaitan juga bersamamu?\" Baginda menjawab, \"Ya, tetapi Tuhanku telah menolongku darinya, maka aku selamat daripada kejahatannya.\"",
        "arabic_text": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي أَبُو صَخْرٍ عَنْ ابْنِ قُسَيْطٍ حَدَّثَهُ أَنَّ عُرْوَةَ حَدَّثَهُ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَتْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ عِنْدِهَا لَيْلًا قَالَتْ فَغِرْتُ عَلَيْهِ فَجَاءَ فَرَأَى مَا أَصْنَعُ فَقَالَ مَا لَكِ يَا عَائِشَةُ أَغِرْتِ فَقُلْتُ وَمَا لِي لَا يَغَارُ مِثْلِي عَلَى مِثْلِكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقَدْ جَاءَكِ شَيْطَانُكِ قَالَتْ يَا رَسُولَ اللَّهِ أَوْ مَعِيَ شَيْطَانٌ قَالَ نَعَمْ قُلْتُ وَمَعَ كُلِّ إِنْسَانٍ قَالَ نَعَمْ قُلْتُ وَمَعَكَ يَا رَسُولَ اللَّهِ قَالَ نَعَمْ وَلَكِنْ رَبِّي أَعَانَنِي عَلَيْهِ حَتَّى أَسْلَمَ"
      },
      {
        "id": 14672,
        "hadith_number": "7111",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keselamatan Bukan Semata-mata Kerana Amalan",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Huraira reported Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: None amongst you would attain salvation purely because of his deeds. A person said: Allah's Messenger, even you? Thereupon he said: Yes, not even I except that Allah wraps me in Mercy, but you should act with moderation.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda: Tiada seorang pun di antara kamu akan mendapat keselamatan semata-mata kerana amalnya.  Seseorang berkata: Wahai Rasulullah, bahkan engkau pun?  Lalu baginda bersabda: Ya, bahkan aku pun tidak, melainkan Allah menyelubungi aku dengan rahmat-Nya.  Tetapi kamu semua hendaklah bersederhana dalam beramal.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ بُكَيْرٍ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَنْ يُنْجِيَ أَحَدًا مِنْكُمْ عَمَلُهُ قَالَ رَجُلٌ وَلَا إِيَّاكَ يَا رَسُولَ اللَّهِ قَالَ وَلَا إِيَّايَ إِلَّا أَنْ يَتَغَمَّدَنِيَ اللَّهُ مِنْهُ بِرَحْمَةٍ وَلَكِنْ سَدِّدُوا"
      },
      {
        "id": 14673,
        "hadith_number": "7112",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perawi Hadith Bukair b. al-Ashajj",
        "perawi_melayu": "Bukair b. al-Ashajj",
        "english_text": "This hadith has been transmitted on the authority of Bukair b. al-Ashajj with a slight variation of wording.",
        "malay_translation": "Hadis ini diriwayatkan daripada Bukair b. al-Ashajj dengan sedikit perbezaan lafaz.",
        "arabic_text": "و حَدَّثَنِيهِ يُونُسُ بْنُ عَبْدِ الْأَعْلَى الصَّدَفِيُّ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ بُكَيْرِ بْنِ الْأَشَجِّ بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّهُ قَالَ بِرَحْمَةٍ مِنْهُ وَفَضْلٍ وَلَمْ يَذْكُرْ وَلَكِنْ سَدِّدُوا"
      },
      {
        "id": 14674,
        "hadith_number": "7113",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rahmat Allah: Jalan Masuk Syurga",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Huraira reported Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: There is none whose deeds alone would entitle him to get into Paradise. It was said to him: And, Allah's Messenger, not even you? Thereupon he said: Not even I, but that my Lord wraps me in Mercy.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda: Tiada seorang pun yang hanya amalannya sahaja melayakkan dia masuk syurga.  Lalu dikatakan kepadanya: Wahai Rasulullah, adakah termasuk engkau juga?  Maka baginda menjawab: Aku pun tidak, melainkan kerana Tuhanku melimpahkan rahmat ke atasku.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا مِنْ أَحَدٍ يُدْخِلُهُ عَمَلُهُ الْجَنَّةَ فَقِيلَ وَلَا أَنْتَ يَا رَسُولَ اللَّهِ قَالَ وَلَا أَنَا إِلَّا أَنْ يَتَغَمَّدَنِي رَبِّي بِرَحْمَةٍ"
      },
      {
        "id": 14675,
        "hadith_number": "7114",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Amalan Saja Tidak Mencukupi untuk Keselamatan",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Huraira reported Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: There is none amongst you whose deeds alone would attain salvation for him. They (the Companions) said: Allah's Messenger, not even you? He (the Holy Prophet) said: Not even I, but that Allah wraps me in Mercy and He grants me pardon. Ibn 'Aun pointed towards his head with his hand saying: Not even I, but that Allah wraps me in His Forgiveness and Mercy.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah ﷺ bersabda: Tiada seorang pun di kalangan kamu yang amalannya sahaja akan memperoleh keselamatan baginya. Mereka (para sahabat) berkata: Wahai Rasulullah, bahkan engkau pun tidak? Baginda (Nabi Muhammad SAW) bersabda: Bahkan aku pun tidak, melainkan Allah melimpahiku dengan rahmat dan Dia mengampuniku. Ibn 'Aun menunjuk ke arah kepalanya dengan tangannya sambil berkata: Bahkan aku pun tidak, melainkan Allah melimpahiku dengan keampunan dan rahmat-Nya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ ابْنِ عَوْنٍ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ أَحَدٌ مِنْكُمْ يُنْجِيهِ عَمَلُهُ قَالُوا وَلَا أَنْتَ يَا رَسُولَ اللَّهِ قَالَ وَلَا أَنَا إِلَّا أَنْ يَتَغَمَّدَنِيَ اللَّهُ مِنْهُ بِمَغْفِرَةٍ وَرَحْمَةٍ وَقَالَ ابْنُ عَوْنٍ بِيَدِهِ هَكَذَا وَأَشَارَ عَلَى رَأْسِهِ وَلَا أَنَا إِلَّا أَنْ يَتَغَمَّدَنِيَ اللَّهُ مِنْهُ بِمَغْفِرَةٍ وَرَحْمَةٍ"
      },
      {
        "id": 14676,
        "hadith_number": "7115",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Amatlah sedikit amal yang menjamin keselamatan",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Huraira reported Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: There is none whose deeds alone can'secure salvation for him. They said: Allah's Messenger, not even you? Thereupon he said: Not even I, but that, the Mercy of Allah should take hold of me.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah ﷺ bersabda: Tiada seorang pun yang hanya amalnya sahaja dapat menjamin keselamatannya. Mereka berkata: Wahai Rasulullah, adakah anda juga? Lalu baginda bersabda: Aku pun tidak, melainkan rahmat Allah akan meliputiku.",
        "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ أَحَدٌ يُنْجِيهِ عَمَلُهُ قَالُوا وَلَا أَنْتَ يَا رَسُولَ اللَّهِ قَالَ وَلَا أَنَا إِلَّا أَنْ يَتَدَارَكَنِيَ اللَّهُ مِنْهُ بِرَحْمَةٍ"
      },
      {
        "id": 14677,
        "hadith_number": "7116",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Tidak Ada yang Masuk Syurga Hanya Dengan Amalan Semata-mata",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Huraira reported Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: None amongst you can get into Paradise by virtue of his deeds alone. They said: Allah's Messenger, not even you? Thereupon he said: Not even I, but that Allah should wrap me in His Grace and Mercy.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah ﷺ bersabda: Tiada seorang pun di antara kamu yang boleh masuk syurga hanya dengan kebaikan amalannya sahaja. Mereka berkata: Wahai Rasulullah, adakah anda juga tidak? Baginda menjawab: Aku pun tidak, melainkan dengan rahmat dan keampunan Allah SWT.",
        "arabic_text": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا أَبُو عَبَّادٍ يَحْيَى بْنُ عَبَّادٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ حَدَّثَنَا ابْنُ شِهَابٍ عَنْ أَبِي عُبَيْدٍ مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَنْ يُدْخِلَ أَحَدًا مِنْكُمْ عَمَلُهُ الْجَنَّةَ قَالُوا وَلَا أَنْتَ يَا رَسُولَ اللَّهِ قَالَ وَلَا أَنَا إِلَّا أَنْ يَتَغَمَّدَنِيَ اللَّهُ مِنْهُ بِفَضْلٍ وَرَحْمَةٍ"
      },
      {
        "id": 14678,
        "hadith_number": "7117",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kesederhanaan dalam Amalan dan Rahmat Allah",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Huraira reported Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Observe moderation in deeds (and if it is not possible, try to be near moderation) and understand that none amongst you can attain salvation because of his deeds alone. They said: Allah's Messenger, not even you? Thereupon he said: Not even I, but that Allah should wrap me in His Mercy and Grace.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda: “Bersederhanalah dalam amalan (dan jika tidak mampu, cuba mendekati kesederhanaan), dan ketahuilah bahawa sesiapa pun di antara kamu tidak akan mendapat keselamatan hanya kerana amalannya sahaja.” Mereka berkata: “Wahai Rasulullah, adakah engkau juga tidak?” Baginda menjawab: “Aku juga tidak, melainkan dengan rahmat dan kurniaan Allah.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَارِبُوا وَسَدِّدُوا وَاعْلَمُوا أَنَّهُ لَنْ يَنْجُوَ أَحَدٌ مِنْكُمْ بِعَمَلِهِ قَالُوا يَا رَسُولَ اللَّهِ وَلَا أَنْتَ قَالَ وَلَا أَنَا إِلَّا أَنْ يَتَغَمَّدَنِيَ اللَّهُ بِرَحْمَةٍ مِنْهُ وَفَضْلٍ"
      },
      {
        "id": 14679,
        "hadith_number": "7118",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Sanad Hadis daripada Jabir",
        "perawi_melayu": "Jabir melalui beberapa perawi lain.",
        "english_text": "This hadith has been narrated on the authority of Jabir through another chain of transmitters.",
        "malay_translation": "Hadis ini diriwayatkan daripada Jabir melalui sanad yang lain.",
        "arabic_text": "و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ"
      },
      {
        "id": 14680,
        "hadith_number": "7119",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Diriwayatkan Melalui Dua Sanad",
        "perawi_melayu": "A'mash (melalui dua sanad lain)",
        "english_text": "A hadith like this has been narrated on the authority of A'mash through two other chains of transmitters. The wording is, however, the same.",
        "malay_translation": "Hadis seperti ini telah diriwayatkan daripada A'mash melalui dua sanad lain.  Namun, lafaznya adalah sama.",
        "arabic_text": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ بِالْإِسْنَادَيْنِ جَمِيعًا كَرِوَايَةِ ابْنِ نُمَيْرٍ"
      },
      {
        "id": 14681,
        "hadith_number": "7120",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Memberi Khabar Gembira",
        "perawi_melayu": "Abu Hurairah (melalui sanad lain)",
        "english_text": "This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters with this addition: Give them glad tidings .",
        "malay_translation": "Hadis ini diriwayatkan daripada Abu Hurairah melalui sanad lain dengan tambahan: Berilah mereka khabar gembira.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ وَزَادَ وَأَبْشِرُوا"
      },
      {
        "id": 14682,
        "hadith_number": "7121",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rahmat Allah Jalan Masuk Syurga",
        "perawi_melayu": "Jabir",
        "english_text": "Jabir reported: I heard Allah's Apoetle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: None of you would get into Paradise because of his good deeds alone, and he would not be rescued from Fire, not even I, but because of the Mercy of Allah.",
        "malay_translation": "Jabir meriwayatkan: Aku mendengar Rasulullah ﷺ bersabda: Tiada seorang pun di antara kamu akan masuk syurga semata-mata kerana amalnya, dan tiada seorang pun akan diselamatkan daripada neraka, bahkan aku sendiri, melainkan kerana rahmat Allah.",
        "arabic_text": "حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ حَدَّثَنَا مَعْقِلٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يُدْخِلُ أَحَدًا مِنْكُمْ عَمَلُهُ الْجَنَّةَ وَلَا يُجِيرُهُ مِنْ النَّارِ وَلَا أَنَا إِلَّا بِرَحْمَةٍ مِنْ اللَّهِ"
      },
      {
        "id": 14683,
        "hadith_number": "7122",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Amalan Berterusan Walaupun Kecil",
        "perawi_melayu": "Aisyah r.a.",
        "english_text": "A'isha, the wife of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), reported that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to say: Observe moderation (in doing deeds), and if you fail to observe it perfectly, try to do as much as you can do (to live up to this ideal of moderation) and be happy for none would be able to get into Paradise because of his deeds alone. They (the Companions of the Holy Prophet) said: Allah's Messenger, not even you? Thereupon he said: Not even I, but that Allah wraps me in His Mercy, and bear this in mind that the deed loved most by Allah is one which is done constantly even though it is small.",
        "malay_translation": "Aisyah, isteri Rasulullah SAW, meriwayatkan bahawa Rasulullah SAW bersabda:  “Bersederhanalah dalam beramal, dan jika kamu tidak mampu bersederhana sepenuhnya, usahakanlah sedaya upaya (untuk mencapai kesederhanaan itu) dan berlapang dadalah, kerana tiada seorang pun akan dapat masuk syurga semata-mata kerana amalannya.”  Para sahabat bertanya: “Wahai Rasulullah, adakah engkau juga tidak terkecuali?” Baginda menjawab: “Aku juga tidak terkecuali, melainkan dengan rahmat Allah SWT. Ketahuilah bahawa amalan yang paling disukai oleh Allah SWT ialah amalan yang dilakukan secara berterusan walaupun kecil.”",
        "arabic_text": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ أَخْبَرَنَا مُوسَى بْنُ عُقْبَةَ ح و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ وَاللَّفْظُ لَهُ حَدَّثَنَا بَهْزٌ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ قَالَ سَمِعْتُ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ يُحَدِّثُ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا كَانَتْ تَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَدِّدُوا وَقَارِبُوا وَأَبْشِرُوا فَإِنَّهُ لَنْ يُدْخِلَ الْجَنَّةَ أَحَدًا عَمَلُهُ قَالُوا وَلَا أَنْتَ يَا رَسُولَ اللَّهِ قَالَ وَلَا أَنَا إِلَّا أَنْ يَتَغَمَّدَنِيَ اللَّهُ مِنْهُ بِرَحْمَةٍ وَاعْلَمُوا أَنَّ أَحَبَّ الْعَمَلِ إِلَى اللَّهِ أَدْوَمُهُ وَإِنْ قَلَّ"
      },
      {
        "id": 14684,
        "hadith_number": "7123",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Riwayat Musa bin Uqbah: Tanpa Sebutan ‘Bersukacitalah’",
        "perawi_melayu": "Musa bin Uqbah",
        "english_text": "This hadith has been narrated on the authority of Musa b. `Uqba with the same chain of transmitters and he did not make a mention of: Be happy .",
        "malay_translation": "Hadis ini diriwayatkan daripada Musa bin Uqbah dengan sanad yang sama, dan beliau tidak menyebut: ‘Bersukacitalah’.",
        "arabic_text": "و حَدَّثَنَاه حَسَنٌ الْحُلْوَانِيُّ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُطَّلِبِ عَنْ مُوسَى بْنِ عُقْبَةَ بِهَذَا الْإِسْنَادِ وَلَمْ يَذْكُرْ وَأَبْشِرُوا"
      },
      {
        "id": 14685,
        "hadith_number": "7124",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ketekunan Ibadah Rasulullah SAW",
        "perawi_melayu": "Mughira bin Syu'bah",
        "english_text": "Mughira b. Shu'ba reported that Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) worshipped so much that his feet were swollen. It was said to him: (Why do you undergo so much hardship despite the fact that) Allah has pardoned for you your earlier and later sins? Thereupon he said: May I not (prove myself) to be a grateful servant (of Allah)?",
        "malay_translation": "Mughira bin Syu'bah meriwayatkan bahawa Rasulullah SAW begitu tekun beribadah sehingga kedua-dua kakinya bengkak. Baginda ditanya: \"Wahai Rasulullah, mengapa Baginda menanggung kesusahan yang begitu banyak sedangkan Allah SWT telah mengampunkan dosa-dosa Baginda yang lalu dan yang akan datang?\"  Maka Baginda menjawab: \"Bukankah sepatutnya aku menjadi hamba yang bersyukur kepada Allah SWT?\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ زِيَادِ بْنِ عِلَاقَةَ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى حَتَّى انْتَفَخَتْ قَدَمَاهُ فَقِيلَ لَهُ أَتَكَلَّفُ هَذَا وَقَدْ غَفَرَ اللَّهُ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ فَقَالَ أَفَلَا أَكُونُ عَبْدًا شَكُورًا"
      },
      {
        "id": 14686,
        "hadith_number": "7125",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah SAW Berdiri Solat Sehingga Kaki Bengkak",
        "perawi_melayu": "Mughira bin Syu'bah",
        "english_text": "This hadith has been transmitted on the authority of Mughira b. Shu'ba and the words are: Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) kept standing in prayer (for such long hours) that his feet were swollen. They (his Companions) said: Verily, Allah has pardoned for thee the earlier and the later of thine sins. Thereupon he said: Should I not prove myself to be a grateful servant (of Allah)?",
        "malay_translation": "Hadis ini diriwayatkan daripada Mughira bin Syu'bah, iaitu: Rasulullah SAW berdiri solat dalam tempoh yang lama sehingga kaki baginda bengkak.  Para sahabat berkata: Sesungguhnya Allah telah mengampunkan dosa-dosa baginda yang lalu dan yang akan datang.  Lalu baginda bersabda: Patutkah aku tidak menjadi hamba yang bersyukur (kepada Allah)?",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ نُمَيْرٍ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ زِيَادِ بْنِ عِلَاقَةَ سَمِعَ الْمُغِيرَةَ بْنَ شُعْبَةَ يَقُولُ قَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى وَرِمَتْ قَدَمَاهُ قَالُوا قَدْ غَفَرَ اللَّهُ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ قَالَ أَفَلَا أَكُونُ عَبْدًا شَكُورًا"
      },
      {
        "id": 14687,
        "hadith_number": "7126",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kesungguhan Rasulullah SAW dalam Solat",
        "perawi_melayu": "Aisyah",
        "english_text": "A'isha reported that when Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) occupied himself in prayer, he observed such a (long) qiyam (posture of standing in prayer) that his feet were swollen. A'isha said: Allah's Messenger you do this (in spite of the fact) that your earlier and later sins have been pardoned for you? Thereupon, he said. Aisyah should I not prove myself to be a thanksgiving servant (of Allah)?",
        "malay_translation": "Aisyah meriwayatkan bahawa apabila Rasulullah SAW menunaikan solat, baginda berdiri (qiyam) begitu lama sehingga kedua-dua kakinya bengkak. Aisyah berkata: \"Wahai Rasulullah, mengapa baginda melakukan ini sedangkan dosa-dosa baginda yang lalu dan akan datang telah diampunkan?\"  Baginda menjawab: \"Wahai Aisyah, bukankah sepatutnya aku menjadi hamba yang bersyukur kepada Allah?\" ",
        "arabic_text": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ وَهَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ قَالَا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي أَبُو صَخْرٍ عَنْ ابْنِ قُسَيْطٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى قَامَ حَتَّى تَفَطَّرَ رِجْلَاهُ قَالَتْ عَائِشَةُ يَا رَسُولَ اللَّهِ أَتَصْنَعُ هَذَا وَقَدْ غُفِرَ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ فَقَالَ يَا عَائِشَةُ أَفَلَا أَكُونُ عَبْدًا شَكُورًا"
      },
      {
        "id": 14688,
        "hadith_number": "7127",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keengganan Abdullah bin Mas'ud Memberi Ceramah Berlebihan",
        "perawi_melayu": "Syakiq",
        "english_text": "Shaqiq reported: We were sitting at the door of Abdullah (b. Mas'ud) waiting for him (to come out and deliver a sermon to us). It was at this time that there happened to pass by us Yazid b. Mu'awiya an-Nakha'i. We said: Inform him ('Abdullah b. Mas'ud) of our presence here. He went in and Abdullah b. Mas'ud lost no time in coming out to us and said: I was informed of your presence here but nothing hindered me to come out to you but the fact that I did not like to bore you (by stuffing your minds with sermons) as Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) did not deliver us sermon on certain days fearing that it might prove to be boring for us.",
        "malay_translation": "Syakiq meriwayatkan: Kami duduk di pintu rumah Abdullah bin Mas'ud, menunggunya keluar untuk menyampaikan khutbah kepada kami. Pada ketika itu, Yazid bin Mu'awiya An-Nakha'i lalu berlalu di hadapan kami. Kami berkata: Sampaikan kepada beliau (Abdullah bin Mas'ud) bahawa kami ada di sini. Dia masuk, dan Abdullah bin Mas'ud segera keluar menemui kami dan berkata: Aku telah dimaklumkan tentang kehadiran kamu, tetapi tiada apa yang menghalang aku untuk keluar menemui kamu melainkan kerana aku tidak mahu membebankan kamu (dengan khutbah yang terlalu banyak) sebagaimana Rasulullah ﷺ tidak menyampaikan khutbah kepada kami pada hari-hari tertentu kerana bimbang ia akan menjadi membosankan bagi kami.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ وَأَبُو مُعَاوِيَةَ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ وَاللَّفْظُ لَهُ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ قَالَ كُنَّا جُلُوسًا عِنْدَ بَابِ عَبْدِ اللَّهِ نَنْتَظِرُهُ فَمَرَّ بِنَا يَزِيدُ بْنُ مُعَاوِيَةَ النَّخَعِيُّ فَقُلْنَا أَعْلِمْهُ بِمَكَانِنَا فَدَخَلَ عَلَيْهِ فَلَمْ يَلْبَثْ أَنْ خَرَجَ عَلَيْنَا عَبْدُ اللَّهِ فَقَالَ إِنِّي أُخْبَرُ بِمَكَانِكُمْ فَمَا يَمْنَعُنِي أَنْ أَخْرُجَ إِلَيْكُمْ إِلَّا كَرَاهِيَةُ أَنْ أُمِلَّكُمْ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَخَوَّلُنَا بِالْمَوْعِظَةِ فِي الْأَيَّامِ مَخَافَةَ السَّآمَةِ عَلَيْنَا"
      },
      {
        "id": 14689,
        "hadith_number": "7128",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Sanad Hadis daripada Abdullah",
        "perawi_melayu": "Abdullah melalui beberapa jalur periwayat lain.",
        "english_text": "This hadith has been narrated on the authority of 'Abdullah through other chains of transmitters.",
        "malay_translation": "Hadis ini diriwayatkan daripada Abdullah melalui beberapa sanad periwayat yang lain.",
        "arabic_text": "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا ابْنُ إِدْرِيسَ ح و حَدَّثَنَا مِنْجَابُ بْنُ الْحَارِثِ التَّمِيمِيُّ حَدَّثَنَا ابْنُ مُسْهِرٍ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَلِيُّ بْنُ خَشْرَمٍ قَالَا أَخْبَرَنَا عِيسَى بْنُ يُونُسَ ح و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ كُلُّهُمْ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ نَحْوَهُ وَزَادَ مِنْجَابٌ فِي رِوَايَتِهِ عَنْ ابْنِ مُسْهِرٍ قَالَ الْأَعْمَشُ وَحَدَّثَنِي عَمْرُو بْنُ مُرَّةَ عَنْ شَقِيقٍ عَنْ عَبْدِ اللَّهِ مِثْلَهُ"
      },
      {
        "id": 14690,
        "hadith_number": "7129",
        "status": "sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ceramah Abdullah dan Hikmah Rasulullah SAW",
        "perawi_melayu": "Shaqiq b. Wi'il",
        "english_text": "Shaqiq b. Wi'il reported that 'Abdullah used to give us sermon on every Thursday. A person said: Abu 'Abd al-Rahman, we love your talk and so we yearn (to listen to you) and earnestly desire that you should deliver us lecture every day. Thereupon he said: There is nothing to hinder me in giving you talk (every day) but the fact that you may be bored. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) did not deliver sermons on certain days (fearing that we might be bored).",
        "malay_translation": "Shaqiq b. Wi'il meriwayatkan bahawa Abdullah biasa memberi ceramah kepada kami setiap hari Khamis. Seseorang berkata: Wahai Abu 'Abd al-Rahman, kami menyukai ceramah tuan dan kami merindui (untuk mendengar tuan) dan amat menginginkan agar tuan menyampaikan ceramah kepada kami setiap hari. Lalu beliau berkata: Tiada apa yang menghalang saya daripada memberi ceramah (setiap hari) kecuali kebimbangan bahawa kamu mungkin akan bosan. Rasulullah SAW  (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) tidak menyampaikan ceramah pada hari-hari tertentu (kerana bimbang kami akan bosan).",
        "arabic_text": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ عَنْ مَنْصُورٍ ح و حَدَّثَنَا ابْنُ أَبِي عُمَرَ وَاللَّفْظُ لَهُ حَدَّثَنَا فُضَيْلُ بْنُ عِيَاضٍ عَنْ مَنْصُورٍ عَنْ شَقِيقٍ أَبِي وَائِلٍ قَالَ كَانَ عَبْدُ اللَّهِ يُذَكِّرُنَا كُلَّ يَوْمِ خَمِيسٍ فَقَالَ لَهُ رَجُلٌ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنَّا نُحِبُّ حَدِيثَكَ وَنَشْتَهِيهِ وَلَوَدِدْنَا أَنَّكَ حَدَّثْتَنَا كُلَّ يَوْمٍ فَقَالَ مَا يَمْنَعُنِي أَنْ أُحَدِّثَكُمْ إِلَّا كَرَاهِيَةُ أَنْ أُمِلَّكُمْ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَخَوَّلُنَا بِالْمَوْعِظَةِ فِي الْأَيَّامِ كَرَاهِيَةَ السَّآمَةِ عَلَيْنَا"
      }
    ]
  }
}