{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 27,
    "data": [
      {
        "id": 11307,
        "hadith_number": "3743",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Tindakan Terhadap Penemuan Lelaki Bersama Isteri dan Perceraian",
        "perawi_melayu": "Sahl bin Sa'd al-Sa'idi رضي الله عنه meriwayatkan:",
        "english_text": "'Uwaimir al-'Ajlani came to 'Asim bin 'Adi al-Ansari and said to him. Tell me about a person who finds a man with his wife; should he kill him, and be killed In retaliation; or how should he act? 'Asim رضی اﷲ عنہ , ask for me (religious verdict about it) from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). So 'Asim رضی اﷲ عنہ asked Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he did not like this question and he disapproved of it so much that'Asim felt aggrieved at what he had heard from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). When 'Asim came back to his family, 'Uwaimir came to him and said: 'Asim, what did Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say to you? 'Asim said to 'Uwaimir: You did not bring something good. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) did not like this religious verdict that I sought from him. 'Uwaimir said: By Allah, I will not rest until I have asked him about it. 'Uwaimir proceeded until he came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as he was sitting amidst people, and said: Messenger of Allah, tell me about a person who found a man with his wife. Should he kill him, and then you would kill him, or how should he act? Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: (Verses) have been revealed concerning you and your wife; so go and bring her. Sahl said that they both invoked curses (and further said): I was along with people in the company of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). And when they had finished, Uwaimir said: Allah's Messenger, I shall have told a lie against her if I keep her (now). So he divorced her with three pronouncements before Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had commanded him. Ibn Shihab said: Subsequently that was the practice of invokers of curses (al Mutala'inain)",
        "malay_translation": "'Uwaimir al-‘Ajlani menemui ‘Asim bin ‘Adi al-Ansari dan bertanya kepadanya tentang seseorang yang mendapati seorang lelaki bersama isterinya.  Bolehkah lelaki itu membunuh lelaki tersebut sebagai balasan dan membunuh diri sendiri? Atau bagaimana tindakan yang sewajarnya? ‘Asim رضي الله عنه meminta fatwa dari Rasulullah صلى الله عليه وسلم. Rasulullah صلى الله عليه وسلم tidak bersetuju dengan pertanyaan tersebut dan sangat tidak menyukainya sehingga ‘Asim merasa tidak senang dengan jawapan yang didapatnya.  Setelah ‘Asim kembali ke keluarganya, ‘Uwaimir menemuinya dan bertanya tentang jawapan Rasulullah صلى الله عليه وسلم. ‘Asim menjawab, \"Engkau tidak membawa sesuatu yang baik. Rasulullah صلى الله عليه وسلم tidak bersetuju dengan fatwa yang aku minta darinya.\" ‘Uwaimir berkata, \"Demi Allah, aku tidak akan berhenti sehingga aku bertanyakannya sendiri kepada Baginda.\" ‘Uwaimir terus menemui Rasulullah صلى الله عليه وسلم yang sedang duduk bersama orang ramai, dan bertanya: Wahai Rasulullah, apakah tindakan yang sewajarnya bagi seseorang yang mendapati seorang lelaki bersama isterinya? Adakah ia boleh membunuh lelaki tersebut dan dibunuh pula sebagai balasan? Atau bagaimana tindakannya?  Lalu Rasulullah صلى الله عليه وسلم menjawab: (Ayat-ayat) telah diturunkan berkenaan kamu dan isterimu, jadi pergilah dan bawa dia. Sahl berkata, mereka berdua (lelaki dan isteri) mendoakan laknat.  Aku berada di kalangan orang ramai bersama Rasulullah صلى الله عليه وسلم.  Kemudian, ‘Uwaimir berkata: Wahai Rasulullah, aku telah melakukan dusta jika aku menyimpannya. Maka, dia menceraikan isterinya tiga kali sebelum Rasulullah صلى الله عليه وسلم memerintahkannya. Ibn Shihab berkata: Selepas itu, itulah amalan orang-orang yang mendoakan laknat (al-Mutala‘inain).",
        "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، أَنَّ سَهْلَ بْنَ سَعْدٍ، السَّاعِدِيَّ أَخْبَرَهُ أَنَّ عُوَيْمِرًا الْعَجْلاَنِيَّ جَاءَ إِلَى عَاصِمِ بْنِ عَدِيٍّ الأَنْصَارِيِّ فَقَالَ لَهُ أَرَأَيْتَ يَا عَاصِمُ لَوْ أَنَّ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً أَيَقْتُلُهُ فَتَقْتُلُونَهُ أَمْ كَيْفَ يَفْعَلُ فَسَلْ لِي عَنْ ذَلِكَ يَا عَاصِمُ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏ فَسَأَلَ عَاصِمٌ رَسُولَ اللَّهِ صلى الله عليه وسلم فَكَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَسَائِلَ وَعَابَهَا حَتَّى كَبُرَ عَلَى عَاصِمٍ مَا سَمِعَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا رَجَعَ عَاصِمٌ إِلَى أَهْلِهِ جَاءَهُ عُوَيْمِرٌ فَقَالَ يَا عَاصِمُ مَاذَا قَالَ لَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ عَاصِمٌ لِعُوَيْمِرٍ لَمْ تَأْتِنِي بِخَيْرٍ قَدْ كَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَسْأَلَةَ الَّتِي سَأَلْتُهُ عَنْهَا ‏.‏ قَالَ عُوَيْمِرٌ وَاللَّهِ لاَ أَنْتَهِي حَتَّى أَسْأَلَهُ عَنْهَا ‏.‏ فَأَقْبَلَ عُوَيْمِرٌ حَتَّى أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم وَسَطَ النَّاسِ فَقَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً أَيَقْتُلُهُ فَتَقْتُلُونَهُ أَمْ كَيْفَ يَفْعَلُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ قَدْ نَزَلَ فِيكَ وَفِي صَاحِبَتِكَ فَاذْهَبْ فَأْتِ بِهَا ‏ ‏ ‏.‏ قَالَ سَهْلٌ فَتَلاَعَنَا وَأَنَا مَعَ النَّاسِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا فَرَغَا قَالَ عُوَيْمِرٌ كَذَبْتُ عَلَيْهَا يَا رَسُولَ اللَّهِ إِنْ أَمْسَكْتُهَا ‏.‏ فَطَلَّقَهَا ثَلاَثًا قَبْلَ أَنْ يَأْمُرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ ابْنُ شِهَابٍ فَكَانَتْ سُنَّةَ الْمُتَلاَعِنَيْنِ ‏.‏"
      },
      {
        "id": 11308,
        "hadith_number": "3744",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pewarisan Anak dan Perkahwinan  (Hadith)",
        "perawi_melayu": "'Uwaimir al-Ansari (رضي الله عنه) dari Bani 'Ajlan menemui 'Asim bin 'Adi (رضي الله عنه). Bahagian hadith yang lain sama dan juga dicatatkan:  Perceraian menjadi amalan al-Mutala'inain. Tambahan lagi, dia mengandung dan anaknya dianggap anak kandungnya, dan menjadi kebiasaan anak itu mewarisi ibunya dan ibu mewarisi anak tersebut mengikut bahagian yang ditetapkan oleh Allah.",
        "english_text": "'Uwaimir al-Ansari ( رضی اﷲ عنہ) from Banu'l-'Ajlan came to 'Asim bin 'Adi ( رضی اﷲ عنہ) the remaining part of the hadith is the same and it was also reecorded in it: And subsequebtly the separation became the practice of al-Mutala'inain. And this addition was also made: She was pregnant and her son was ascribed to her, and it became customary that such (a son) would inherit her and she would inherit him in the share prescribed by Allah for her.",
        "malay_translation": "'Uwaimir al-Ansari (رضي الله عنه) dari Bani 'Ajlan menemui 'Asim bin 'Adi (رضي الله عنه). Bahagian hadith yang lain sama dan juga dicatatkan:  Perceraian menjadi amalan al-Mutala'inain. Tambahan lagi, dia mengandung dan anaknya dianggap anak kandungnya, dan menjadi kebiasaan anak itu mewarisi ibunya dan ibu mewarisi anak tersebut mengikut bahagian yang ditetapkan oleh Allah.",
        "arabic_text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي سَهْلُ بْنُ سَعْدٍ الأَنْصَارِيُّ، أَنَّ عُوَيْمِرًا الأَنْصَارِيَّ، مِنْ بَنِي الْعَجْلاَنِ أَتَى عَاصِمَ بْنَ عَدِيٍّ ‏.‏ وَسَاقَ الْحَدِيثَ بِمِثْلِ حَدِيثِ مَالِكٍ وَأَدْرَجَ فِي الْحَدِيثِ قَوْلَهُ وَكَانَ فِرَاقُهُ إِيَّاهَا بَعْدُ سُنَّةً فِي الْمُتَلاَعِنَيْنِ ‏.‏ وَزَادَ فِيهِ قَالَ سَهْلٌ فَكَانَتْ حَامِلاً فَكَانَ ابْنُهَا يُدْعَى إِلَى أُمِّهِ ‏.‏ ثُمَّ جَرَتِ السُّنَّةُ أَنَّهُ يَرِثُهَا وَتَرِثُ مِنْهُ مَا فَرَضَ اللَّهُ لَهَا.‏"
      },
      {
        "id": 11309,
        "hadith_number": "3745",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Mengutuk dan Perceraian di Hadapan Rasulullah SAW",
        "perawi_melayu": "Ibn Juraij meriwayatkan:",
        "english_text": "Ibn Shihab narrated about the invokers of curses and the practice of (li'an) based on the authority of Sahl bin Sa'd, of the tribe of Sa'ida. That a person from the Ansar came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Allah's Messenger, tell me about the person who found a man with his wife. The remaining part of the hadith is the same (but) with this addition: They invoked curses in the mosque and I was present there. And he narrated in the hadith: He divorced her with three pronouncements before Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded him (to get separation). He separated from her in the presence of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), whereupon he said: There is a separation between the invokers of curses.",
        "malay_translation": "Ibn Shihab meriwayatkan tentang orang-orang yang mengutuk dan amalan (li'an) berdasarkan riwayat Sahl bin Sa'd, dari puak Sa'ida. Bahwa seorang Ansar datang kepada Rasulullah SAW dan berkata: Wahai Rasulullah, beritahu saya tentang orang yang mendapati suaminya bersama isterinya. Bahagian hadis yang lain sama (tetapi) dengan tambahan ini: Mereka mengutuk di masjid dan saya hadir di situ. Dan beliau meriwayatkan dalam hadis: Dia menceraikannya dengan tiga kali pengucapan sebelum Rasulullah SAW memerintahkannya (untuk bercerai). Dia bercerai darinya di hadapan Rasulullah SAW, lalu baginda bersabda:  Terdapat perpisahan antara orang-orang yang mengutuk.",
        "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي ابْنُ شِهَابٍ، عَنِ الْمُتَلاَعِنَيْنِ، وَعَنِ السُّنَّةِ، فِيهِمَا عَنْ حَدِيثِ، سَهْلِ بْنِ سَعْدٍ أَخِي بَنِي سَاعِدَةَ أَنَّ رَجُلاً، مِنَ الأَنْصَارِ جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً وَذَكَرَ الْحَدِيثَ بِقِصَّتِهِ ‏.‏ وَزَادَ فِيهِ فَتَلاَعَنَا فِي الْمَسْجِدِ وَأَنَا شَاهِدٌ ‏.‏ وَقَالَ فِي الْحَدِيثِ فَطَلَّقَهَا ثَلاَثًا قَبْلَ أَنْ يَأْمُرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ فَفَارَقَهَا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ذَاكُمُ التَّفْرِيقُ بَيْنَ كُلِّ مُتَلاَعِنَيْنِ ‏.‏"
      },
      {
        "id": 11310,
        "hadith_number": "3746",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perpisahan Antara Orang yang Melakukan Sumpah Laknat dan Perkara yang Berkaitan dengan Perzinaan",
        "perawi_melayu": "Sa'id bin Jubair رضي الله عنه meriwayatkan:",
        "english_text": "I was asked about the invokers of curses during the reign of Mus'ab (bin Zubair) whether they could separate (themselves by this process). He said: I did not understand what to say. So I went to the house of Ibn 'Umar ( رضی اﷲ عنہ) in Mecca. I said to his servant: Seek permission for Me. He said that he (Ibn 'Umar رضی اﷲ عنہ) had been taking rest. He (Ibn 'Umar رضی اﷲ عنہ) heard my voice. and said: Are you Ibn Jubair? I said: Yes. He 'said: Come in. By Allah, it must be some (great) need which has brought you here at this Hour. So I got in and found him lying on a blanket reclining against a pillow stuffed with fibres of date-palm. I said: O Abu'Abd al-Rahman, should there be separation between the invokers of curses? He said: Maha suci Allah, ya, Orang pertama yang bertanya tentang hal ini adalah si fulan. Dia bertanya: Rasulullah, bagaimana jika salah seorang dari kita mendapati istrinya berzina? Apa yang harus dilakukan? Jika dia bicara, itu perkara besar, dan jika dia diam, itu juga perkara besar (yang tidak mampu dia lakukan). Rasulullah ﷺ diam (atau dalam beberapa waktu). Setelah beberapa waktu, orang itu kembali menghadapnya (Rasulullah) dan berkata: Aku telah terlibat dalam perkara ini, yang telah aku tanyakan kepadamu. Kemudian Allah Azza wa Jalla menurunkan ayat-ayat Surah An-Nur: Orang-orang yang menuduh istrinya (ayat 6), dan dia (Nabi) membacakannya kepadanya dan menegurnya, dan memberi nasihat kepadanya, dan memberitahukan kepadanya bahawa azab dunia lebih ringan daripada azab akhirat. Dia berkata: Tidak, demi Dzat yang mengutusmu dengan kebenaran, aku tidak berdusta terhadapnya. Kemudian (Rasulullah) memanggil istrinya (istri orang yang menuduhnya) dan menegurnya, dan memberi nasihat kepadanya, dan memberitahukan kepadanya bahawa azab dunia lebih ringan daripada azab akhirat. Dia berkata: Tidak, demi Dzat yang mengutusmu dengan kebenaran, dia pendusta. Orang itu yang mula bersumpah dan bersumpah dengan nama Allah empat kali bahawa dia termasuk orang yang benar. dan pada kali kelima dia berkata: Semoga laknat Allah ke atasnya jika dia termasuk orang yang berdusta. Kemudian wanita itu dipanggil dan dia bersumpah dengan nama Allah empat kali bahawa dia (suaminya) termasuk orang yang berdusta, dan pada kali kelima (dia berkata): Semoga laknat ke atasnya jika dia termasuk orang yang benar. Kemudian Nabi ﷺ memisahkan keduanya.",
        "malay_translation": "Aku ditanya tentang orang-orang yang mengutuk dalam pemerintahan Mus'ab (bin Zubair) sama ada mereka boleh berpisah (melalui proses ini). Dia berkata: Aku tidak mengerti apa yang harus kukatakan. Maka aku pergi ke rumah Ibn 'Umar (رضي الله عنه) di Mekah. Aku berkata kepada pembantunya: Minta izin untukku. Dia berkata bahawa beliau (Ibn 'Umar رضي الله عنه) sedang berehat. Beliau (Ibn 'Umar رضي الله عنه) mendengar suaraku dan berkata: Adakah engkau Ibn Jubair? Aku berkata: Ya. Beliau berkata: Masuklah. Demi Allah, mesti ada keperluan besar yang membawa engkau ke sini pada saat ini. Kemudian aku masuk dan mendapati beliau berbaring di atas selimut bersandar pada bantal yang diisi dengan serat kurma. Aku berkata: Wahai Abu 'Abd al-Rahman, adakah harus ada pemisahan antara orang-orang yang mengutuk? Beliau berkata: Maha suci Allah, ya. Orang pertama yang bertanya tentang hal ini adalah si fulan. Dia bertanya: Rasulullah, bagaimana jika salah seorang dari kita mendapati istrinya berzina? Apa yang harus dilakukan? Jika dia bicara, itu perkara besar, dan jika dia diam, itu juga perkara besar (yang tidak mampu dia lakukan). Rasulullah ﷺ diam (atau dalam beberapa waktu). Setelah beberapa waktu, orang itu kembali menghadapnya (Rasulullah) dan berkata: Aku telah terlibat dalam perkara ini, yang telah aku tanyakan kepadamu. Kemudian Allah Azza wa Jalla menurunkan ayat-ayat Surah An-Nur: Orang-orang yang menuduh istrinya (ayat 6), dan dia (Nabi) membacakannya kepadanya dan menegurnya, dan memberi nasihat kepadanya, dan memberitahukan kepadanya bahawa azab dunia lebih ringan daripada azab akhirat. Dia berkata: Tidak, demi Dzat yang mengutusmu dengan kebenaran, aku tidak berdusta terhadapnya. Kemudian (Rasulullah) memanggil istrinya (istri orang yang menuduhnya) dan menegurnya, dan memberi nasihat kepadanya, dan memberitahukan kepadanya bahawa azab dunia lebih ringan daripada azab akhirat. Dia berkata: Tidak, demi Dzat yang mengutusmu dengan kebenaran, dia pendusta. Orang itu yang mula bersumpah dan bersumpah dengan nama Allah empat kali bahawa dia termasuk orang yang benar. dan pada kali kelima dia berkata: Semoga laknat Allah ke atasnya jika dia termasuk orang yang berdusta. Kemudian wanita itu dipanggil dan dia bersumpah dengan nama Allah empat kali bahawa dia (suaminya) termasuk orang yang berdusta, dan pada kali kelima (dia berkata): Semoga laknat ke atasnya jika dia termasuk orang yang benar. Kemudian Nabi ﷺ memisahkan keduanya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ، عَنْ سَعِيدِ بْنِ، جُبَيْرٍ قَالَ سُئِلْتُ عَنِ الْمُتَلاَعِنَيْنِ، فِي إِمْرَةِ مُصْعَبٍ أَيُفَرَّقُ بَيْنَهُمَا قَالَ فَمَا دَرَيْتُ مَا أَقُولُ فَمَضَيْتُ إِلَى مَنْزِلِ ابْنِ عُمَرَ بِمَكَّةَ فَقُلْتُ لِلْغُلاَمِ اسْتَأْذِنْ لِي ‏.‏ قَالَ إِنَّهُ قَائِلٌ فَسَمِعَ صَوْتِي ‏.‏ قَالَ ابْنُ جُبَيْرٍ قُلْتُ نَعَمْ ‏.‏ قَالَ ادْخُلْ فَوَاللَّهِ مَا جَاءَ بِكَ هَذِهِ السَّاعَةَ إِلاَّ حَاجَةٌ فَدَخَلْتُ فَإِذَا هُوَ مُفْتَرِشٌ بَرْذَعَةً مُتَوَسِّدٌ وِسَادَةً حَشْوُهَا لِيفٌ قُلْتُ أَبَا عَبْدِ الرَّحْمَنِ الْمُتَلاَعِنَانِ أَيُفَرَّقُ بَيْنَهُمَا قَالَ سُبْحَانَ اللَّهِ نَعَمْ إِنَّ أَوَّلَ مَنْ سَأَلَ عَنْ ذَلِكَ فُلاَنُ بْنُ فُلاَنٍ قَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ أَنْ لَوْ وَجَدَ أَحَدُنَا امْرَأَتَهُ عَلَى فَاحِشَةٍ كَيْفَ يَصْنَعُ إِنْ تَكَلَّمَ تَكَلَّمَ بِأَمْرٍ عَظِيمٍ ‏.‏ وَإِنْ سَكَتَ سَكَتَ عَلَى مِثْلِ ذَلِكَ قَالَ فَسَكَتَ النَّبِيُّ صلى الله عليه وسلم فَلَمْ يُجِبْهُ فَلَمَّا كَانَ بَعْدَ ذَلِكَ أَتَاهُ فَقَالَ إِنَّ الَّذِي سَأَلْتُكَ عَنْهُ قَدِ ابْتُلِيتُ بِهِ ‏.‏ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ هَؤُلاَءِ الآيَاتِ فِي سُورَةِ النُّورِ ‏{‏ وَالَّذِينَ يَرْمُونَ أَزْوَاجَهُمْ‏}‏ فَتَلاَهُنَّ عَلَيْهِ وَوَعَظَهُ وَذَكَّرَهُ وَأَخْبَرَهُ أَنَّ عَذَابَ الدُّنْيَا أَهْوَنُ مِنْ عَذَابِ الآخِرَةِ قَالَ لاَ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا كَذَبْتُ عَلَيْهَا ‏.‏ ثُمَّ دَعَاهَا فَوَعَظَهَا وَذَكَّرَهَا وَأَخْبَرَهَا أَنَّ عَذَابَ الدُّنْيَا أَهْوَنُ مِنْ عَذَابِ الآخِرَةِ ‏.‏ قَالَتْ لاَ وَالَّذِي بَعَثَكَ بِالْحَقِّ إِنَّهُ لَكَاذِبٌ فَبَدَأَ بِالرَّجُلِ فَشَهِدَ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ إِنَّهُ لَمِنَ الصَّادِقِينَ وَالْخَامِسَةُ أَنَّ لَعْنَةَ اللَّهِ عَلَيْهِ إِنْ كَانَ مِنَ الْكَاذِبِينَ ثُمَّ ثَنَّى بِالْمَرْأَةِ فَشَهِدَتْ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ إِنَّهُ لَمِنَ الْكَاذِبِينَ وَالْخَامِسَةُ أَنَّ غَضَبَ اللَّهِ عَلَيْهَا إِنْ كَانَ مِنَ الصَّادِقِينَ ثُمَّ فَرَّقَ بَيْنَهُمَا.‏"
      },
      {
        "id": 11311,
        "hadith_number": "3747",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perbincangan Mengenai Dua Orang yang Melakukan Lian",
        "perawi_melayu": "Saeed bin Jubair رضي الله عنه berkata:",
        "english_text": "\"At the time of Musab bin Az-Zubair, I was asked about the two who engaged in Lian, and I did not know what to say, so I went to 'Abdullah bin Umar رضی اللہ عنہ and I said: 'Do you think that two who engaged in Lian should be separated?... '\" then he mentioned a Hadith like that of Ibn Umair (no. 3746).",
        "malay_translation": "\"Pada masa Mus'ab bin Az-Zubair, aku ditanya tentang dua orang yang melakukan Lian, dan aku tidak tahu apa yang harus kukatakan, lalu aku pergi kepada 'Abdullah bin 'Umar رضي الله عنه dan aku berkata: 'Apakah menurutmu, dua orang yang melakukan Lian patut dipisahkan? ...'\", kemudian beliau menyebut hadis seperti hadis Ibnu 'Umar (no. 3746).",
        "arabic_text": "وَحَدَّثَنِيهِ عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ، أَبِي سُلَيْمَانَ قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، قَالَ سُئِلْتُ عَنِ الْمُتَلاَعِنَيْنِ، زَمَنَ مُصْعَبِ بْنِ الزُّبَيْرِ فَلَمْ أَدْرِ مَا أَقُولُ فَأَتَيْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ فَقُلْتُ أَرَأَيْتَ الْمُتَلاَعِنَيْنِ أَيُفَرَّقُ بَيْنَهُمَا ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ ابْنِ نُمَيْرٍ.‏"
      },
      {
        "id": 11312,
        "hadith_number": "3748",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perintah Nabi SAW kepada Orang yang Mengutuk dan Hak Harta Dower",
        "perawi_melayu": "Ibn Umar (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying to the invokers of curse: Your account is with Allah. One of you must be a liar. You have now no right over this woman. He said: Messenger of Allah, what about my wealth (dower that I paid her at the time of marriage)? He said: You have no claim to wealth. If you tell the truth, it (dower) is the recompense for your having had the right to intercourse with her, and if you tell a lie against her, it is still more remote from you than she is. Zuhair said in his narration: Sufyan reported to us on the authority of 'Amr that he had heard Sa'id bin Jubair saying: I heard Ibn Umar (رضی اللہ عنہ) saying that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had said it.",
        "malay_translation": "Rasulullah SAW bersabda kepada orang-orang yang mengutuk: \"Perkara kamu terletak di sisi Allah. Pasti salah seorang daripada kamu berdusta. Kamu tidak lagi mempunyai hak ke atas wanita ini.\"  Beliau bertanya lagi: Wahai Rasulullah, bagaimana pula dengan harta dower yang saya berikan kepadanya?  Rasulullah SAW menjawab: \"Kamu tidak mempunyai tuntutan ke atas harta tersebut. Jika kamu berkata benar, maka harta dower itu adalah ganjaran atas hak persetubuhan dengannya. Dan jika kamu berdusta terhadapnya, maka harta itu lebih jauh dari kamu daripada wanita tersebut.\"  Zuhair berkata dalam riwayatnya: Sufyan meriwayatkan kepada kami dari 'Amr yang mendengar Sa'id bin Jubair berkata: Saya mendengar Ibn Umar (رضي الله عنه) berkata bahawa Rasulullah SAW telah bersabda demikian.",
        "arabic_text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ - وَاللَّفْظُ لِيَحْيَى - قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ سَعِيدِ بْنِ، جُبَيْرٍ عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِلْمُتَلاَعِنَيْنِ ‏ ‏ حِسَابُكُمَا عَلَى اللَّهِ أَحَدُكُمَا كَاذِبٌ لاَ سَبِيلَ لَكَ عَلَيْهَا ‏ ‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ مَالِي قَالَ ‏ ‏ لاَ مَالَ لَكَ إِنْ كُنْتَ صَدَقْتَ عَلَيْهَا فَهْوَ بِمَا اسْتَحْلَلْتَ مِنْ فَرْجِهَا وَإِنْ كُنْتَ كَذَبْتَ عَلَيْهَا فَذَاكَ أَبْعَدُ لَكَ مِنْهَا ‏ ‏ ‏.‏ قَالَ زُهَيْرٌ فِي رِوَايَتِهِ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو سَمِعَ سَعِيدَ بْنَ جُبَيْرٍ يَقُولُ سَمِعْتُ ابْنَ عُمَرَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏"
      },
      {
        "id": 11313,
        "hadith_number": "3749",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pengasingan Ahli Banu al-‘Ajlan dan Teguran Kepada Pendusta",
        "perawi_melayu": "Ibn ‘Umar (رضي الله عنه) berkata:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) effected separation between the two members of Banu al-'Ajlan, and said: Allah knows that one of you is a liar. Is there one to repent among you?",
        "malay_translation": "Pesuruhjaya Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) memisahkan kedua-dua ahli Banu al-‘Ajlan, dan bersabda: Allah mengetahui bahawa salah seorang daripada kamu adalah pendusta. Adakah ada di antara kamu yang mahu bertaubat?",
        "arabic_text": "وَحَدَّثَنِي أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عُمَرَ، قَالَ فَرَّقَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ أَخَوَىْ بَنِي الْعَجْلاَنِ وَقَالَ اللَّهُ يَعْلَمُ أَنَّ أَحَدَكُمَا كَاذِبٌ فَهَلْ مِنْكُمَا تَائِبٌ .‏"
      },
      {
        "id": 11314,
        "hadith_number": "3750",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perbahasan tentang Mengutuk (Li'an) mengikut Hadis Rasulullah SAW",
        "perawi_melayu": "Sa'id bin Jubair melaporkan:",
        "english_text": "I asked Ibn 'Umar (رضی اللہ عنہ) about invoking curse (li'an), and he narrated Similarly from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
        "malay_translation": "Saya bertanya kepada Ibn 'Umar (رضي الله عنه) tentang mengutuk (li'an), dan beliau meriwayatkannya secara sama seperti dari Rasulullah SAW ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
        "arabic_text": "وَحَدَّثَنَاهُ ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، سَمِعَ سَعِيدَ بْنَ جُبَيْرٍ، قَالَ سَأَلْتُ ابْنَ عُمَرَ عَنِ اللِّعَانِ، ‏.‏ فَذَكَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏"
      },
      {
        "id": 11315,
        "hadith_number": "3751",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pengasingan antara Dua Golongan dalam Banu al-'Ajlan",
        "perawi_melayu": "Sa'id bin Jubair melaporkan:",
        "english_text": "Mus'ab bin Zubair did not effect separation between the Mutala'inain (invokers of curses). Sa'id said: It was mentioned to 'Abdullah bin Umar (رضی اللہ عنہ) and he said: Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) effected separation between the two members of Banu al-'Ajlan.",
        "malay_translation": "Mus'ab bin Zubair tidak melakukan pengasingan di antara orang-orang Mutala'inain (orang yang memohon laknat). Sa'id berkata: Hal ini disebut kepada 'Abdullah bin Umar (رضی اللہ عنہ) dan beliau berkata: Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) telah melakukan pengasingan antara dua anggota Bani al-'Ajlan.",
        "arabic_text": "وَحَدَّثَنَا أَبُو غَسَّانَ الْمِسْمَعِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ - وَاللَّفْظُ لِلْمِسْمَعِيِّ وَابْنِ الْمُثَنَّى - قَالُوا حَدَّثَنَا مُعَاذٌ، - وَهُوَ ابْنُ هِشَامٍ - قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ عَزْرَةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ لَمْ يُفَرِّقِ الْمُصْعَبُ بَيْنَ الْمُتَلاَعِنَيْنِ ‏.‏ قَالَ سَعِيدٌ فَذُكِرَ ذَلِكَ لِعَبْدِ اللَّهِ بْنِ عُمَرَ ‏.‏ فَقَالَ فَرَّقَ نَبِيُّ اللَّهِ صلى الله عليه وسلم بَيْنَ أَخَوَىْ بَنِي الْعَجْلاَنِ ‏.‏"
      },
      {
        "id": 11316,
        "hadith_number": "3752",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Memintakan Kemurkaan atas Isteri dan Perceraian",
        "perawi_melayu": "Nafi' meriwayatkan dari Ibn Umar (رضي الله عنه):",
        "english_text": "A person invoked curse on the wife during the lifetime of Allah s Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), so he effected separation between them and traced the lineage of the son to his mother.",
        "malay_translation": "Seseorang memaki isterinya semasa hayat Rasulullah SAW, lalu menyebabkan perceraian di antara mereka dan keturunan anak itu dikaitkan kepada ibunya.",
        "arabic_text": "وَحَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا مَالِكٌ، ح وَحَدَّثَنَا يَحْيَى، بْنُ يَحْيَى - وَاللَّفْظُ لَهُ - قَالَ قُلْتُ لِمَالِكٍ حَدَّثَكَ نَافِعٌ، عَنِ ابْنِ عُمَرَ، أَنَّ رَجُلاً، لاَعَنَ امْرَأَتَهُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَفَرَّقَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَهُمَا وَأَلْحَقَ الْوَلَدَ بِأُمِّهِ قَالَ نَعَمْ.‏"
      },
      {
        "id": 11317,
        "hadith_number": "3753",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah SAW Memisahkan Pasangan yang Mengutuk Satu Sama Lain",
        "perawi_melayu": "Ibn 'Umar (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) asked a person from the Anger and his wife to invoke curse (upon one another in order to testify to their truthfulness), and then effected separation between them.",
        "malay_translation": "Rasulullah SAW (ﷺ) meminta seorang lelaki dan isterinya yang bertelingkah untuk saling mengutuk (sebagai bukti kejujuran), dan kemudian memisahkan mereka.",
        "arabic_text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، قَالاَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ لاَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ رَجُلٍ مِنَ الأَنْصَارِ وَامْرَأَتِهِ وَفَرَّقَ بَيْنَهُمَا.‏"
      },
      {
        "id": 11318,
        "hadith_number": "3754",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis yang Sama Sanadnya, Berkata 'Ubaidillah",
        "perawi_melayu": null,
        "english_text": "A hadith like this has been narrated on the authority of 'Ubaidulah with the same chain of transmitters.",
        "malay_translation": "Satu hadis seperti ini telah diriwayatkan dengan sanad yang sama dari 'Ubaidillah.",
        "arabic_text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا يَحْيَى، - وَهُوَ الْقَطَّانُ - عَنْ عُبَيْدِ اللَّهِ، بِهَذَا الإِسْنَادِ ‏.‏"
      },
      {
        "id": 11319,
        "hadith_number": "3755",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum dan Proses Li'an dalam Islam",
        "perawi_melayu": "Abdullah رضي الله عنه meriwayatkan:",
        "english_text": "We were on the night of Friday staying in the mosque when a person from the Ansar came there and said: If a person finds his woman along with a man, and he speaks about it, you would lash him, and if he kills, you will kill him, and if he keeps quiet he shall have to consume anger. By Allah, I will definitely ask about him from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). On the following day he came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and asked him thus: If a man were to find with his wife a man and if he were to talk about it, you would lash him; and if he killed, you would kill him, and if he were to keep quiet. he would consume anger, whereupon he (the Holy Prophet ﷺ) said: Allah, solve (this problem), and he began to supplicate (before Him), and then the verses pertaining to li'an were revealed: Those who accuse their wives and have no witnesses except themselves (xxiv. 6). The person was then put to test according to these verses in the presence of the people. There came he and his wife in the presence of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and they invoked curses (in order to testify their claim). The man swore four times in the name of Allah that he was one of the truthful and then invoked curse for the fifth time saying: Let there be curse of Allah upon him if he were among the liars. Then she began to invoke curse. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to her: just wait (and curse after considering over it), but she refused and invoked curse and when she turned away, he (Allah's Apostle ﷺ) said: It seems that this woman shall give birth to a curly-haired black child, And so she did gave birth to a curly-haired black child.",
        "malay_translation": "Kami berada di malam Jumaat di masjid ketika seorang Ansar datang dan berkata: Jika seseorang mendapati isterinya bersama seorang lelaki, dan dia membicarakannya, kamu akan mencambuknya; jika dia membunuh, kamu akan membunuhnya; dan jika dia diam, dia akan ditimpa kemarahan. Demi Allah, aku pasti akan bertanya kepada Rasulullah (ﷺ) tentang hal ini. Pada hari berikutnya, dia mendatangi Rasulullah (ﷺ) dan bertanya demikian: Jika seorang lelaki mendapati isterinya bersama seorang lelaki, jika dia membicarakannya, kamu akan mencambuknya; jika dia membunuh, kamu akan membunuhnya; dan jika dia diam, dia akan ditimpa kemarahan. Rasulullah (ﷺ) pun berdoa: Ya Allah, selesaikan masalah ini. Kemudian Allah menurunkan ayat-ayat tentang li'an: Orang-orang yang menuduh isteri mereka dan tiada saksi melainkan diri mereka sendiri (24:6). Kemudian orang itu diuji mengikut ayat-ayat ini di hadapan orang ramai. Dia dan isterinya datang ke hadapan Rasulullah (ﷺ), dan mereka berdoa meminta azab jika mereka berdusta. Lelaki itu bersumpah empat kali dengan nama Allah bahawa dia termasuk orang yang benar, kemudian meminta azab untuk kelima kalinya, sambil berkata: Semoga azab Allah menimpa diriku jika aku termasuk pendusta. Kemudian wanita itu mula meminta azab. Rasulullah (ﷺ) berkata kepadanya: Tunggulah (dan minta azab setelah berfikir), tetapi dia enggan dan meminta azab. Ketika dia berpaling, Rasulullah (ﷺ) berkata: Sepertinya wanita ini akan melahirkan seorang anak lelaki berkulit hitam berambut kerinting. Dan memang benar, dia melahirkan seorang anak lelaki berkulit hitam berambut kerinting.",
        "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لِزُهَيْرٍ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ إِنَّا لَيْلَةَ الْجُمُعَةِ فِي الْمَسْجِدِ إِذْ جَاءَ رَجُلٌ مِنَ الأَنْصَارِ فَقَالَ لَوْ أَنَّ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً فَتَكَلَّمَ جَلَدْتُمُوهُ أَوْ قَتَلَ قَتَلْتُمُوهُ وَإِنْ سَكَتَ سَكَتَ عَلَى غَيْظٍ وَاللَّهِ لأَسْأَلَنَّ عَنْهُ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏ فَلَمَّا كَانَ مِنَ الْغَدِ أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَسَأَلَهُ فَقَالَ لَوْ أَنَّ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً فَتَكَلَّمَ جَلَدْتُمُوهُ أَوْ قَتَلَ قَتَلْتُمُوهُ أَوْ سَكَتَ سَكَتَ عَلَى غَيْظٍ ‏.‏ فَقَالَ ‏ ‏ اللَّهُمَّ افْتَحْ ‏ ‏ ‏.‏ وَجَعَلَ يَدْعُو فَنَزَلَتْ آيَةُ اللِّعَانِ ‏{‏ وَالَّذِينَ يَرْمُونَ أَزْوَاجَهُمْ وَلَمْ يَكُنْ لَهُمْ شُهَدَاءُ إِلاَّ أَنْفُسُهُمْ‏}‏ هَذِهِ الآيَاتُ فَابْتُلِيَ بِهِ ذَلِكَ الرَّجُلُ مِنْ بَيْنِ النَّاسِ فَجَاءَ هُوَ وَامْرَأَتُهُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَتَلاَعَنَا فَشَهِدَ الرَّجُلُ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ إِنَّهُ لَمِنَ الصَّادِقِينَ ثُمَّ لَعَنَ الْخَامِسَةَ أَنَّ لَعْنَةَ اللَّهِ عَلَيْهِ إِنْ كَانَ مِنَ الْكَاذِبِينَ فَذَهَبَتْ لِتَلْعَنَ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ مَهْ.‏ فَأَبَتْ فَلَعَنَتْ فَلَمَّا أَدْبَرَا قَالَ ‏ ‏ لَعَلَّهَا أَنْ تَجِيءَ بِهِ أَسْوَدَ جَعْدًا.‏ فَجَاءَتْ بِهِ أَسْوَدَ جَعْدًا‏.‏"
      },
      {
        "id": 11320,
        "hadith_number": "3756",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis yang Serupa dengan Hadis Nombor 3755, Diriwayatkan oleh Al-A'mash",
        "perawi_melayu": null,
        "english_text": "A similar report as no. 3755 was narrated from Al-A'mash with this chain.",
        "malay_translation": "Satu laporan yang serupa dengan no. 3755 telah diriwayatkan daripada Al-A'mash dengan sanad ini.",
        "arabic_text": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ، أَبِي شَيْبَةَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، جَمِيعًا عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏"
      },
      {
        "id": 11321,
        "hadith_number": "3757",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hikayah tentang Sumpah Laknat (Li'an) dan Ciri-ciri Anak",
        "perawi_melayu": "Muhammad (Salah seorang perawi) melaporkan:",
        "english_text": "I asked Anas bin Malik (رضی اﷲ عنہ) knowing that he had a knowledge of (the case of li'an). He said: Hilal bin Umayya (رضی اﷲ عنہ ) accused his wife with the charge of fornication with Sharik bin Sahma, the brother of al-Bara'b Malik from the side of his mother. And he was the first person who invoked curse (li'an) in Islam. He in fact invoked curse upon her. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: See to her if she gives birth to a white-complexioned child having dark hair and bright eyes; he must be the son of Hilal bin Umayya; and if she gives birth to a child with dark eyelids, curly hair and lean shanks, he must be the offspring of Sharik bin Sahma. He said: I was informed that she gave birth to a child having dark eyelids, curly hair and lean shanks.",
        "malay_translation": "Aku bertanya kepada Anas bin Malik (رضي الله عنه), mengetahui bahawa beliau mempunyai pengetahuan tentang (perkara li'an). Beliau berkata: Hilal bin Umayya (رضي الله عنه) menuduh isterinya melakukan zina dengan Sharik bin Sahma, iaitu saudara al-Bara'b Malik dari pihak ibu. Dan beliaulah orang pertama yang melaungkan sumpah laknat (li'an) dalam Islam. Sebenarnya beliau telah melaungkan sumpah laknat ke atasnya. Rasulullah (ﷺ) bersabda: Perhatikanlah jika dia melahirkan anak yang berkulit cerah, berambut gelap dan bermata bersinar; dia mestilah anak Hilal bin Umayya. Dan jika dia melahirkan anak dengan kelopak mata gelap, rambut kerinting dan kaki yang kurus, dia mestilah anak Sharik bin Sahma. Beliau berkata: Aku diberitahu bahawa dia melahirkan seorang anak yang memiliki kelopak mata gelap, rambut kerinting dan kaki yang kurus.",
        "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا هِشَامٌ، عَنْ مُحَمَّدٍ، قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ وَأَنَا أُرَى، أَنَّ عِنْدَهُ، مِنْهُ عِلْمًا ‏.‏ فَقَالَ إِنَّ هِلاَلَ بْنَ أُمَيَّةَ قَذَفَ امْرَأَتَهُ بِشَرِيكِ ابْنِ سَحْمَاءَ وَكَانَ أَخَا الْبَرَاءِ بْنِ مَالِكٍ لأُمِّهِ وَكَانَ أَوَّلَ رَجُلٍ لاَعَنَ فِي الإِسْلاَمِ - قَالَ - فَلاَعَنَهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ أَبْصِرُوهَا فَإِنْ جَاءَتْ بِهِ أَبْيَضَ سَبِطًا قَضِيءَ الْعَيْنَيْنِ فَهُوَ لِهِلاَلِ بْنِ أُمَيَّةَ وَإِنْ جَاءَتْ بِهِ أَكْحَلَ جَعْدًا حَمْشَ السَّاقَيْنِ فَهُوَ لِشَرِيكِ ابْنِ سَحْمَاءَ ‏ ‏ ‏.‏ قَالَ فَأُنْبِئْتُ أَنَّهَا جَاءَتْ بِهِ أَكْحَلَ جَعْدًا حَمْشَ السَّاقَيْنِ ‏.‏"
      },
      {
        "id": 11322,
        "hadith_number": "3758",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Perceraian dan Pengadilan berdasarkan Bukti",
        "perawi_melayu": "Ibnu Abbas رضي الله عنه meriwayatkan:",
        "english_text": "Mention was made of li'an in the presence of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). And Asim bin 'Adi passed a remark about it and then turned away, and a man of his tribe came to him complaining that he had found a man with his wife, whereupon 'Asim رضی اﷲ عنہ said: I have been taken by my words. He took him to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and told him about the man whom he had found with his wife and this man was a lean, yellow-coloured man with lank hair, and the person who was accused of committing adultery with her (his wife) had fleshy shanks, with wheat complexion and heavy bulk. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: O Allah, make (this case) manifest. And as she gave birth to a child, whose face resembled that person about whom her husband had made mention that he had found her with, and Allah's Messenger (ﷺ) had asked them to invoke curses. A person said to Ibn 'Abbas (رضی اﷲ عنہ): Is she (that woman) about whom Allah's Messenger (ﷺ) (said): If I were to stone anybody without evidence, I would have stoned her ? Ibn 'Abbas (رضی اﷲ عنہ) said: No, it is not she. That woman was one who openly spread evil in society.",
        "malay_translation": "Disebutkan tentang li'an di hadapan Rasulullah SAW.  Asim bin 'Adi memberi komentar mengenainya dan kemudian berpaling. Kemudian seorang lelaki dari kaumnya datang mengadu kepadanya bahawa dia mendapati seorang lelaki bersama isterinya.  Maka Asim رضي الله عنه berkata: \"Perkataanku telah menyesatkan aku.\"  Kemudian Asim membawa lelaki itu kepada Rasulullah SAW dan menceritakan lelaki yang didapati bersama isterinya itu, seorang yang kurus, berkulit kuning dan berambut panjang, dan orang yang dituduh melakukan zina dengan isterinya itu bertungkai besar, berkulit gandum dan berbadan tegap. Rasulullah SAW bersabda: \"Ya Allah, tampakkanlah kebenaran dalam perkara ini.\"  Dan apabila wanita itu melahirkan seorang anak yang wajahnya serupa dengan lelaki yang dikatakan suaminya mendapati bersamanya, dan Rasulullah SAW telah meminta mereka mengutuk. Seseorang bertanya kepada Ibnu Abbas رضي الله عنه: \"Adakah wanita itu yang Rasulullah SAW katakan: Sekiranya aku hendak merajam seseorang tanpa bukti, nescaya aku telah merajamnya?\" Ibnu Abbas رضي الله عنه menjawab: \"Tidak, wanita itu bukanlah wanita tersebut. Wanita itu adalah orang yang menyebarkan kejahatan di masyarakat.",
        "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، وَعِيسَى بْنُ حَمَّادٍ الْمِصْرِيَّانِ، - وَاللَّفْظُ لاِبْنِ رُمْحٍ - قَالاَ أَخْبَرَنَا اللَّيْثُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنِ الْقَاسِمِ، بْنِ مُحَمَّدٍ عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ قَالَ ذُكِرَ التَّلاَعُنُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ عَاصِمُ بْنُ عَدِيٍّ فِي ذَلِكَ قَوْلاً ثُمَّ انْصَرَفَ فَأَتَاهُ رَجُلٌ مِنْ قَوْمِهِ يَشْكُو إِلَيْهِ أَنَّهُ وَجَدَ مَعَ أَهْلِهِ رَجُلاً ‏.‏ فَقَالَ عَاصِمٌ مَا ابْتُلِيتُ بِهَذَا إِلاَّ لِقَوْلِي فَذَهَبَ بِهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرَهُ بِالَّذِي وَجَدَ عَلَيْهِ امْرَأَتَهُ وَكَانَ ذَلِكَ الرَّجُلُ مُصْفَرًّا قَلِيلَ اللَّحْمِ سَبِطَ الشَّعَرِ وَكَانَ الَّذِي ادَّعَى عَلَيْهِ أَنَّهُ وَجَدَ عِنْدَ أَهْلِهِ خَدْلاً آدَمَ كَثِيرَ اللَّحْمِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ اللَّهُمَّ بَيِّنْ ‏ ‏ ‏.‏ فَوَضَعَتْ شَبِيهًا بِالرَّجُلِ الَّذِي ذَكَرَ زَوْجُهَا أَنَّهُ وَجَدَهُ عِنْدَهَا فَلاَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَهُمَا فَقَالَ رَجُلٌ لاِبْنِ عَبَّاسٍ فِي الْمَجْلِسِ أَهِيَ الَّتِي قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ لَوْ رَجَمْتُ أَحَدًا بِغَيْرِ بَيِّنَةٍ رَجَمْتُ هَذِهِ ‏ ‏ ‏.‏ فَقَالَ ابْنُ عَبَّاسٍ لاَ تِلْكَ امْرَأَةٌ كَانَتْ تُظْهِرُ فِي الإِسْلاَمِ السُّوءَ ‏.‏"
      },
      {
        "id": 11323,
        "hadith_number": "3759",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Perceraian (Li'an) di Hadapan Rasulullah SAW",
        "perawi_melayu": "Telah diriwayatkan bahawa Ibn 'Abbas (رضي الله عنه) berkata: melalui sanad yang lain dengan tambahan kata-kata ini:",
        "english_text": "Mention of the two who engage in lian was made in the presence of the Messenger of Allah...\" a Hadith like that of Al-Laith (no. 3758), and he added, after saying bulky, with very curly hair.\"",
        "malay_translation": "Sebutan mengenai dua orang yang terlibat dalam li'an telah disebut di hadapan Rasulullah SAW… Hadis seperti Hadis Al-Laith (no. 3758), dan beliau menambah, selepas menyebutnya sebagai orang yang bertubuh besar, dengan rambut yang kerinting yang tebal.",
        "arabic_text": "وَحَدَّثَنِيهِ أَحْمَدُ بْنُ يُوسُفَ الأَزْدِيُّ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، حَدَّثَنِي سُلَيْمَانُ، - يَعْنِي ابْنَ بِلاَلٍ - عَنْ يَحْيَى، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ قَالَ ذُكِرَ الْمُتَلاَعِنَانِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ بِمِثْلِ حَدِيثِ اللَّيْثِ وَزَادَ فِيهِ بَعْدَ قَوْلِهِ كَثِيرَ اللَّحْمِ قَالَ جَعْدًا قَطَطًا ‏.‏"
      },
      {
        "id": 11324,
        "hadith_number": "3760",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perbincangan tentang Orang yang Mengutuk Sebelum Ibn 'Abbas dan Perkara Perzinaan Terbuka",
        "perawi_melayu": "Abdullah bin Shaddad melaporkan:",
        "english_text": "Mention was made about the invokers of curses before Ibn 'Abbas ( رضی اﷲ عنہما) and  Ibn Shaddad said: Are these the two about whom Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said. If I were to stone one without evidence, I would have definitely stoned her ? Ibn Abbas (رضی اﷲ عنہما) said: She is not this woman; but she is the one who (committed adultery) openly.",
        "malay_translation": "Terdapat perbincangan mengenai orang-orang yang mengutuk sebelum Ibn 'Abbas (رضي الله عنهما) dan Ibn Shaddad berkata: Adakah kedua-dua wanita ini yang disebut oleh Rasulullah (صلى الله عليه وسلم) jika aku hendak merajam salah seorang tanpa bukti, sudah pasti aku akan merajamnya?  Ibn Abbas (رضي الله عنهما) berkata: Wanita itu bukan wanita ini; tetapi wanita yang (menjalankan perzinaan) secara terang-terangan.",
        "arabic_text": "وَحَدَّثَنَا عَمْرٌو النَّاقِدُ، وَابْنُ أَبِي عُمَرَ، - وَاللَّفْظُ لِعَمْرٍو - قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ، عُيَيْنَةَ عَنْ أَبِي الزِّنَادِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، قَالَ قَالَ عَبْدُ اللَّهِ بْنُ شَدَّادٍ وَذُكِرَ الْمُتَلاَعِنَانِ عِنْدَ ابْنِ عَبَّاسٍ فَقَالَ ابْنُ شَدَّادٍ أَهُمَا اللَّذَانِ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ ‏ لَوْ كُنْتُ رَاجِمًا أَحَدًا بِغَيْرِ بَيِّنَةٍ لَرَجَمْتُهَا ‏ ‏ ‏.‏ فَقَالَ ابْنُ عَبَّاسٍ لاَ تِلْكَ امْرَأَةٌ أَعْلَنَتْ ‏.‏ قَالَ ابْنُ أَبِي عُمَرَ فِي رِوَايَتِهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ ‏.‏"
      },
      {
        "id": 11325,
        "hadith_number": "3761",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Membunuh Orang yang Menemani Isteri",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Sa'd bin 'Ubada al-Ansari رضي اﷲ عنہ berkata: Wahai Rasulullah, jika seorang lelaki mendapati isterinya bersama orang lain, patutkah dia membunuh orang itu? Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) menjawab: Tidak. Sa'd bertanya: Mengapa tidak? Demi Zat Yang Telah Memuliakan Anda dengan Kebenaran. Maka Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) menjawab: Dengarlah apa yang dikatakan oleh ketua kamu.",
        "malay_translation": "Sa'd bin 'Ubada al-Ansari رضي الله عنه berkata, \"Wahai Rasulullah, sekiranya seorang lelaki mendapati isterinya bersama lelaki lain, adakah dia patut membunuh lelaki itu?\" Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) menjawab, \"Tidak.\" Sa'd bertanya, \"Mengapa tidak? Demi Zat Yang Telah Memuliakan Engkau dengan Kebenaran.\"  Lalu Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) menjawab, \"Dengarkanlah apa yang dikatakan oleh ketua kamu.\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي الدَّرَاوَرْدِيَّ - عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ سَعْدَ بْنَ عُبَادَةَ الأَنْصَارِيَّ، قَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ الرَّجُلَ يَجِدُ مَعَ امْرَأَتِهِ رَجُلاً أَيَقْتُلُهُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ لاَ ‏ ‏ ‏.‏ قَالَ سَعْدٌ بَلَى وَالَّذِي أَكْرَمَكَ بِالْحَقِّ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم اسْمَعُوا إِلَى مَا يَقُولُ سَيِّدُكُمْ.‏"
      },
      {
        "id": 11326,
        "hadith_number": "3762",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Menghadapi Perzinaan dalam Rumah Tangga",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Sa'd bin Ubada (رضی اﷲ عنہ) said: Messenger of Allah, if I were to find with my wife a man, should I wait until I bring four witnesses? He said: Yes.",
        "malay_translation": "Sa'd bin Ubada (رضي الله عنه) berkata: Rasulullah, sekiranya aku mendapati seorang lelaki bersama isteriku, patutkah aku menunggu sehingga mendapatkan empat saksi? Baginda bersabda: Ya.",
        "arabic_text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنِي إِسْحَاقُ بْنُ عِيسَى، حَدَّثَنَا مَالِكٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ سَعْدَ بْنَ عُبَادَةَ، قَالَ يَا رَسُولَ اللَّهِ إِنْ وَجَدْتُ مَعَ امْرَأَتِي رَجُلاً أَأُمْهِلُهُ حَتَّى آتِيَ بِأَرْبَعَةِ شُهَدَاءَ قَالَ نَعَمْ‏.‏"
      },
      {
        "id": 11327,
        "hadith_number": "3763",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kewajipan Suami Terhadap Perbuatan Tidak Senonoh dalam Rumah Tangga",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Sa'd bin Ubada ( رضی اﷲ عنہ) said: Messenger of Allah, if I were to find with my wife a man, should I not touch him before bringing four witnesses? Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Yes. He said: By no means. By Him Who has sent you with the Truth, I would hasten with my sword to him before that. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Listen to what your chief says. He is jealous of his honour, I am more jealous than he (is) and God is more jealous than I.",
        "malay_translation": "Sa'd bin Ubada (رضي الله عنه) berkata: Wahai Rasulullah, sekiranya aku mendapati seorang lelaki bersama isteriku, bukankah aku sepatutnya menyentuhnya sebelum membawa empat saksi? Rasulullah (صلى الله عليه وسلم) menjawab: Ya. Beliau berkata: Tidak sekali-kali. Demi Dia yang mengutuskanmu dengan kebenaran, aku akan segera menyeranginya dengan pedangku sebelum itu. Rasulullah (صلى الله عليه وسلم) bersabda: Dengarlah apa yang dikatakan ketua kamu. Dia cemburu terhadap kehormatannya, aku lebih cemburu daripada dia dan Allah lebih cemburu daripada aku.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، عَنْ سُلَيْمَانَ بْنِ بِلاَلٍ، حَدَّثَنِي سُهَيْلٌ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ سَعْدُ بْنُ عُبَادَةَ يَا رَسُولَ اللَّهِ لَوْ وَجَدْتُ مَعَ أَهْلِي رَجُلاً لَمْ أَمَسَّهُ حَتَّى آتِيَ بِأَرْبَعَةِ شُهَدَاءَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ نَعَمْ ‏ ‏ ‏.‏ قَالَ كَلاَّ وَالَّذِي بَعَثَكَ بِالْحَقِّ إِنْ كُنْتُ لأُعَاجِلُهُ بِالسَّيْفِ قَبْلَ ذَلِكَ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ اسْمَعُوا إِلَى مَا يَقُولُ سَيِّدُكُمْ إِنَّهُ لَغَيُورٌ وَأَنَا أَغْيَرُ مِنْهُ وَاللَّهُ أَغْيَرُ مِنِّي .‏"
      },
      {
        "id": 11328,
        "hadith_number": "3764",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kecemburuan dalam Islam dan Larangan Perbuatan Tercela",
        "perawi_melayu": "AI-Mughira bin Shu'ba (رضي الله عنه) meriwayatkan:",
        "english_text": "Sa'd bin 'Ubada ( رضی اﷲ عنہ) berkata: Sekiranya aku melihat seorang lelaki bersama isteriku, aku akan memukulnya dengan pedang, dan bukan dengan bahagian rata (sisinya).  Apabila Rasulullah (ﷺ) mendengar perkara itu, Baginda bersabda:  Adakah engkau hairan dengan kecemburuan Sa'd terhadap maruahnya? Demi Allah, aku lebih cemburu terhadap maruahku daripada dia, dan Allah lebih cemburu daripada aku. Kerana kecemburuan-Nya, Allah telah mengharamkan perbuatan keji, sama ada terang atau tersembunyi. Dan tiada seorang pun lebih cemburu terhadap maruahnya daripada Allah, dan tiada seorang pun lebih suka menerima alasan daripada Allah, oleh sebab itulah Dia telah mengutuskan para rasul, pembawa berita gembira dan pemberi amaran; dan tiada seorang pun lebih menyukai pujian daripada Allah, oleh sebab itu Allah telah menjanjikan Syurga.",
        "malay_translation": "Sa'd bin 'Ubada (رضي الله عنه) berkata: Sekiranya aku melihat seorang lelaki bersama isteriku, aku akan memukulnya dengan pedang, dan bukan dengan bahagian rata (sisinya).  Apabila Rasulullah SAW mendengar perkara itu, Baginda bersabda:  Adakah engkau hairan dengan kecemburuan Sa'd terhadap maruahnya? Demi Allah, aku lebih cemburu terhadap maruahku daripada dia, dan Allah lebih cemburu daripada aku. Kerana kecemburuan-Nya, Allah telah mengharamkan perbuatan keji, sama ada terang atau tersembunyi. Dan tiada seorang pun yang lebih cemburu terhadap maruahnya daripada Allah, dan tiada seorang pun yang lebih suka menerima alasan daripada Allah, oleh sebab itu Dia telah mengutuskan para rasul, pembawa berita gembira dan pemberi amaran; dan tiada seorang pun yang lebih menyukai pujian daripada Allah, oleh sebab itu Allah telah menjanjikan Syurga.",
        "arabic_text": "حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، وَأَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ - وَاللَّفْظُ لأَبِي كَامِلٍ - قَالاَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ وَرَّادٍ، - كَاتِبِ الْمُغِيرَةِ - عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ قَالَ سَعْدُ بْنُ عُبَادَةَ لَوْ رَأَيْتُ رَجُلاً مَعَ امْرَأَتِي لَضَرَبْتُهُ بِالسَّيْفِ غَيْرَ مُصْفِحٍ عَنْهُ ‏.‏ فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ ‏ أَتَعْجَبُونَ مِنْ غَيْرَةِ سَعْدٍ فَوَاللَّهِ لأَنَا أَغْيَرُ مِنْهُ وَاللَّهُ أَغْيَرُ مِنِّي مِنْ أَجْلِ غَيْرَةِ اللَّهِ حَرَّمَ الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ وَلاَ شَخْصَ أَغْيَرُ مِنَ اللَّهِ وَلاَ شَخْصَ أَحَبُّ إِلَيْهِ الْعُذْرُ مِنَ اللَّهِ مِنْ أَجْلِ ذَلِكَ بَعَثَ اللَّهُ الْمُرْسَلِينَ مُبَشِّرِينَ وَمُنْذِرِينَ وَلاَ شَخْصَ أَحَبُّ إِلَيْهِ الْمِدْحَةُ مِنَ اللَّهِ مِنْ أَجْلِ ذَلِكَ وَعَدَ اللَّهُ الْجَنَّةَ.‏"
      },
      {
        "id": 11329,
        "hadith_number": "3765",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Serupa dengan No. 3764, Berasal dari 'Abdul Malik bin Umair",
        "perawi_melayu": "Abu Bakar bin Abi Syaibah, Husin bin Ali, Zaidah, dan Abdul Malik bin Umair",
        "english_text": "A similar report (as no. 3764) was narrated from 'Abdul Malik bin Umair with this chain.",
        "malay_translation": "Satu riwayat yang serupa (seperti no. 3764) telah diriwayatkan daripada 'Abdul Malik bin Umair dengan sanad ini.",
        "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنْ عَبْدِ الْمَلِكِ، بْنِ عُمَيْرٍ بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏ وَقَالَ غَيْرَ مُصْفِحٍ ‏.‏ وَلَمْ يَقُلْ عَنْهُ.‏"
      },
      {
        "id": 11330,
        "hadith_number": "3766",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Penjelasan tentang Warna Kulit Bayi dan Kemungkinan Pewarisan Sifat",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "There came a person to the Prophet (ﷺ) from Banu Fazara and said: My wife has given birth to a child who is black, whereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Have you any camels? He said: Yes. He again said: What is this colour? He said: They are red. He said: Is there a dusky one among them? He said: Yes, there are dusky ones among them He said: How has it come about? He said: It is perhaps the strain to which it has reverted, whereupon he (the Holy Prophet ﷺ) said: It is perhaps the strain to which he (the child) has reverted.",
        "malay_translation": "Datang seorang lelaki daripada Banu Fazara kepada Nabi (ﷺ) dan berkata: Isteri saya telah melahirkan seorang anak yang berkulit hitam, lalu Rasulullah (ﷺ) bertanya: Adakah kamu mempunyai unta? Dia menjawab: Ya. Kemudian Baginda bertanya lagi: Apakah warna unta itu? Dia menjawab: Unta-unta itu berwarna merah. Baginda bertanya lagi: Adakah terdapat unta yang berwarna kelabu di antara mereka? Dia menjawab: Ya, ada unta yang berwarna kelabu di antara mereka. Baginda bertanya lagi: Bagaimana ini berlaku? Dia menjawab: Mungkin disebabkan keturunannya. Lalu Baginda menjawab: Mungkin disebabkan keturunannya (anak itu).",
        "arabic_text": "وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ - وَاللَّفْظُ لِقُتَيْبَةَ - قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ رَجُلٌ مِنْ بَنِي فَزَارَةَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ إِنَّ امْرَأَتِي وَلَدَتْ غُلاَمًا أَسْوَدَ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ ‏ هَلْ لَكَ مِنْ إِبِلٍ ‏ ‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏ ‏ فَمَا أَلْوَانُهَا ‏ ‏ ‏.‏ قَالَ حُمْرٌ ‏.‏ قَالَ ‏ ‏ هَلْ فِيهَا مِنْ أَوْرَقَ ‏ ‏ ‏.‏ قَالَ إِنَّ فِيهَا لَوُرْقًا ‏.‏ قَالَ ‏ ‏ فَأَنَّى أَتَاهَا ذَلِكَ ‏ ‏ ‏.‏ قَالَ عَسَى أَنْ يَكُونَ نَزَعَهُ عِرْقٌ ‏.‏ قَالَ ‏ ‏ وَهَذَا عَسَى أَنْ يَكُونَ نَزَعَهُ عِرْقٌ ‏.‏"
      },
      {
        "id": 11331,
        "hadith_number": "3767",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Membenci Anak Berkulit Hitam",
        "perawi_melayu": "Hadis ini diriwayatkan daripada Zuhri dengan sanad yang sama. Dalam riwayat Ma'mar, (ayatnya adalah):",
        "english_text": "O Messenger of Allah ﷺ, my wife has given birth to a dark-complexioned boy, and he at that time was intending to disown him. And this addition has been made at the end of the hadith: He (the Holy Prophet ﷺ) did not permit him to disown him.",
        "malay_translation": "Wahai Rasulullah ﷺ, isteri saya telah melahirkan seorang anak lelaki berkulit gelap, dan pada waktu itu dia berniat untuk mengingkari anak tersebut. Dan tambahan ini telah diletakkan di hujung hadis: Baginda (Nabi SAW) tidak membenarkan dia mengingkari anaknya.",
        "arabic_text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ ابْنُ رَافِعٍ حَدَّثَنَا وَقَالَ الآخَرَانِ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، ح وَحَدَّثَنَا ابْنُ رَافِعٍ، حَدَّثَنَا ابْنُ، أَبِي فُدَيْكٍ أَخْبَرَنَا ابْنُ أَبِي ذِئْبٍ، جَمِيعًا عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ ‏.‏ نَحْوَ حَدِيثِ ابْنِ عُيَيْنَةَ ‏.‏ غَيْرَ أَنَّ فِي، حَدِيثِ مَعْمَرٍ فَقَالَ يَا رَسُولَ اللَّهِ وَلَدَتِ امْرَأَتِي غُلاَمًا أَسْوَدَ وَهُوَ حِينَئِذٍ يُعَرِّضُ بِأَنْ يَنْفِيَهُ ‏.‏ وَزَادَ فِي آخِرِ الْحَدِيثِ وَلَمْ يُرَخِّصْ لَهُ فِي الاِنْتِفَاءِ مِنْهُ ‏.‏"
      },
      {
        "id": 11332,
        "hadith_number": "3768",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Menolak Anak Berkulit Hitam dan Perbandingan dengan Unta",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "A desert Arab came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: My wife has given birth to a dark-complexioned child and I have disowned him. Thereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Have you any camels? He said: Yes. He said: What is their colour? He said? They are red. He said: Is there anyone dusky among them? He said: Yes. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: How has it come about? He said: Messenger of Allah, it is perhaps due to the strain to which it has reverted, whereupon the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: It (the birth) of the black child may be due to the strain to which he (the child) might have reverted.",
        "malay_translation": "Seorang Arab badwi datang kepada Rasulullah SAW dan berkata: Istriku telah melahirkan anak berkulit hitam dan aku telah mengingkarinya.  Lalu Rasulullah SAW bertanya: Apakah engkau mempunyai unta? Dia menjawab: Ya. Beliau bertanya lagi: Apa warna unta-unta itu? Dia menjawab: Mereka berwarna merah. Beliau bertanya lagi: Adakah unta yang berwarna gelap di antara mereka? Dia menjawab: Ya.  Rasulullah SAW bertanya: Bagaimana hal itu terjadi? Dia menjawab: Wahai Rasulullah, mungkin disebabkan oleh beban yang ditanggungnya.  Lalu Rasulullah SAW bersabda: Kemungkinan anak berkulit hitam ini terlahir kerana beban yang ditanggungnya.",
        "arabic_text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، - وَاللَّفْظُ لِحَرْمَلَةَ - قَالاَ أَخْبَرَنَا ابْنُ، وَهْبٍ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّصلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ امْرَأَتِي وَلَدَتْ غُلاَمًا أَسْوَدَ وَإِنِّي أَنْكَرْتُهُ ‏.‏ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏ ‏ هَلْ لَكَ مِنْ إِبِلٍ ‏ ‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏ ‏ مَا أَلْوَانُهَا.‏ قَالَ حُمْرٌ ‏.‏ قَالَ ‏ ‏ فَهَلْ فِيهَا مِنْ أَوْرَقَ ‏ ‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ فَأَنَّى هُوَ ‏ ‏ ‏.‏ قَالَ لَعَلَّهُ يَا رَسُولَ اللَّهِ يَكُونُ نَزَعَهُ عِرْقٌ لَهُ ‏.‏ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏ ‏ وَهَذَا لَعَلَّهُ يَكُونُ نَزَعَهُ عِرْقٌ لَهُ ‏.‏"
      },
      {
        "id": 11333,
        "hadith_number": "3769",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis yang serupa dengan ini diriwayatkan oleh Abu Hurairah رضي الله عنه melalui sanad yang lain",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "A hadith like this has been narrated on the authority of Abu Huraira (رضی اﷲ عنہ) through another chain of transmitters.",
        "malay_translation": "Satu hadis yang serupa dengan ini telah diriwayatkan dengan sanad yang lain daripada Abu Hurairah رضي الله عنه.",
        "arabic_text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا حُجَيْنٌ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ بَلَغَنَا أَنَّ أَبَا هُرَيْرَةَ، كَانَ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم بِنَحْوِ حَدِيثِهِمْ‏.‏"
      }
    ]
  }
}