{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 178,
    "data": [
      {
        "id": 11526,
        "hadith_number": "3962",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perjanjian Rasulullah ﷺ dengan Penduduk Khaibar",
        "perawi_melayu": "Ibn Umar (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) contracted with the people of Khaibar the (trees) on the condition that he would have half the produce in fruits and harvest.",
        "malay_translation": "Rasulullah ﷺ telah mengadakan perjanjian dengan penduduk Khaibar (berkenaan pokok-pokok) dengan syarat baginda akan mendapat separuh daripada hasil buah-buahan dan tanaman.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، وَزُهَيْرُ بْنُ حَرْبٍ، وَاللَّفْظُ لِزُهَيْرٍ، قَالَا: حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ، عَنْ عُبَيْدِ اللهِ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَامَلَ أَهْلَ خَيْبَرَ بِشَطْرِ مَا يَخْرُجُ مِنْهَا مِنْ ثَمَرٍ أَوْ زَرْعٍ."
      },
      {
        "id": 11527,
        "hadith_number": "3963",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pembahagian Tanah Khaibar oleh Rasulullah SAW dan Pilihan Isteri-Isteri Baginda",
        "perawi_melayu": "Ibnu Umar (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) handed over the land of Khaibar (on the condition) of the share of produce of fruits and harvest, and he also gave to his wives every year one hundred wasqs: eighty wasqs of dates and twenty wasqs of barley. When 'Umar رضی اللہ عنہ became the caliph he distributed the (lands and trees) of Khaibar, and gave option to the wives of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) to earmark for themselves the land and water or stick to the wasqs (that they got) every year. They differed in this matter. Some of them opted for land and water, and some of them opted for wasqs every year. 'A'isha and Hafsa رضی اللہ عنھن were among those who opted for land and water.",
        "malay_translation": "Rasulullah (صلى الله عليه وسلم) menyerahkan tanah Khaibar (dengan syarat) bahagian hasil buah-buahan dan tanaman, dan baginda juga memberi kepada isteri-isteri baginda setiap tahun seratus wasq: lapan puluh wasq kurma dan dua puluh wasq barli. Apabila 'Umar رضي الله عنه menjadi khalifah, beliau mengagihkan (tanah dan pokok) Khaibar, dan memberi pilihan kepada isteri-isteri Rasulullah (صلى الله عليه وسلم) untuk memperuntukkan bagi diri mereka tanah dan air atau kekal dengan wasq (yang mereka perolehi) setiap tahun. Mereka berbeza pendapat dalam perkara ini. Sebahagian daripada mereka memilih tanah dan air, dan sebahagian daripada mereka memilih wasq setiap tahun. 'A'ishah dan Hafsah رضي الله عنھن adalah antara mereka yang memilih tanah dan air.",
        "arabic_text": "وحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، حَدَّثَنَا عَلِيٌّ وَهُوَ ابْنُ مُسْهِرٍ، أَخْبَرَنَا عُبَيْدُ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: «أَعْطَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ خَيْبَرَ بِشَطْرِ مَا يَخْرُجُ مِنْ ثَمَرٍ أَوْ زَرْعٍ، فَكَانَ يُعْطِي أَزْوَاجَهُ كُلَّ سَنَةٍ مِائَةَ وَسْقٍ، ثَمَانِينَ وَسْقًا مِنْ تَمْرٍ، وَعِشْرِينَ وَسْقًا مِنْ شَعِيرٍ»، «فَلَمَّا وَلِيَ عُمَرُ قَسَمَ خَيْبَرَ، خَيَّرَ أَزْوَاجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يُقْطِعَ لَهُنَّ الْأَرْضَ وَالْمَاءَ، أَوْ يَضْمَنَ لَهُنَّ الْأَوْسَاقَ كُلَّ عَامٍ، فَاخْتَلَفْنَ، فَمِنْهُنَّ مَنِ اخْتَارَ الْأَرْضَ وَالْمَاءَ، وَمِنْهُنَّ مَنِ اخْتَارَ الْأَوْسَاقَ كُلَّ عَامٍ، فَكَانَتْ عَائِشَةُ، وَحَفْصَةُ مِمَّنِ اخْتَارَتَا الْأَرْضَ وَالْمَاءَ."
      },
      {
        "id": 11528,
        "hadith_number": "3964",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perjanjian Rasulullah SAW dengan Penduduk Khaibar",
        "perawi_melayu": "Abdullah bin Umar (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) contracted with the people of Khaibar (land and trees on the condition that they should give) half of the yield from land and trees. The rest of the hadith is the same. In the hadith transmitted on the authority of AIi bin Mushir there is no mention of it, but that A'isha and Hafsa رضی اللہ عنھن were those who opted for land and water, but he (the narrator) said: He (Hadrat 'Umar, gave option to the wives of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) that land would be earmarked for them, but he made no mention of water.",
        "malay_translation": "Rasulullah (صلى الله عليه وسلم) membuat perjanjian dengan penduduk Khaibar (tanah dan pokok-pokok) dengan syarat mereka harus memberikan separuh daripada hasil tanah dan pokok-pokok tersebut. Selebihnya hadith adalah sama. Dalam hadith yang diriwayatkan daripada AIi bin Mushir, tiada disebut mengenainya, tetapi A'isha dan Hafsa رضي الله عنهما adalah mereka yang memilih tanah dan air, tetapi perawi berkata: Beliau (Hadrat 'Umar) memberi pilihan kepada isteri-isteri Rasulullah (صلى الله عليه وسلم) bahawa tanah akan diperuntukkan untuk mereka, tetapi beliau tidak menyebut tentang air.",
        "arabic_text": "وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللهِ، حَدَّثَنِي نَافِعٌ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَامَلَ أَهْلَ خَيْبَرَ بِشَطْرِ مَا خَرَجَ مِنْهَا مِنْ زَرْعٍ أَوْ ثَمَرٍ، وَاقْتَصَّ الْحَدِيثَ بِنَحْوِ حَدِيثِ عَلِيِّ بْنِ مُسْهِرٍ، وَلَمْ يَذْكُرْ فَكَانَتْ عَائِشَةُ، وَحَفْصَةُ مِمَّنِ اخْتَارَتَا الْأَرْضَ وَالْمَاءَ، وَقَالَ: خَيَّرَ أَزْوَاجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يُقْطِعَ لَهُنَّ الْأَرْضَ وَلَمْ يَذْكُرِ الْمَاءَ."
      },
      {
        "id": 11529,
        "hadith_number": "3965",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perjanjian Nabi dengan Penduduk Khaibar Selepas Penaklukan",
        "perawi_melayu": "Abdullah bin Umar (رضی اللہ عنہ) meriwayatkan:",
        "english_text": "When Khaibar had been conquered, the Jews asked Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) to let them continue (cultivation in those lands) on half of the share of yield in fruits and crop, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: I will allow you to continue here, so long as we would desire. The rest of the hadith is the same, but with this addition: The fruit would be distributed equal to the half of Khaibar. And out of hall of the produce of the land, Allah's Apostle (ﷺ) got the fifth part.",
        "malay_translation": "Ketika Khaibar telah ditakluki, kaum Yahudi meminta kepada Rasulullah (صلی اللہ علیہ وسلم) untuk membiarkan mereka terus (bertani di tanah itu) dengan separuh daripada hasil buah-buahan dan tanaman, lalu Rasulullah (صلی اللہ علیہ وسلم) bersabda: 'Aku akan membenarkan kamu terus di sini, selagi kami mahu.' Selebihnya hadis adalah sama, tetapi dengan tambahan ini: Buah-buahan akan diagihkan sama dengan separuh daripada Khaibar. Dan daripada separuh hasil tanah, Rasulullah (ﷺ) mendapat seperlima bahagian.",
        "arabic_text": "وحَدَّثَنِي أَبُو الطَّاهِرِ، حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ اللَّيْثِيُّ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، قَالَ: لَمَّا افْتُتِحَتْ خَيْبَرُ سَأَلَتْ يَهُودُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يُقِرَّهُمْ فِيهَا، عَلَى أَنْ يَعْمَلُوا عَلَى نِصْفِ مَا خَرَجَ مِنْهَا مِنَ الثَّمَرِ وَالزَّرْعِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أُقِرُّكُمْ فِيهَا عَلَى ذَلِكَ مَا شِئْنَا»، ثُمَّ سَاقَ الْحَدِيثَ بِنَحْوِ حَدِيثِ ابْنِ نُمَيْرٍ، وَابْنِ مُسْهِرٍ، عَنْ عُبَيْدِ اللهِ، وَزَادَ فِيهِ، وَكَانَ الثَّمَرُ يُقْسَمُ عَلَى السُّهْمَانِ مِنْ نِصْفِ خَيْبَرَ، فَيَأْخُذُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْخُمْسَ."
      },
      {
        "id": 11530,
        "hadith_number": "3966",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah ﷺ Mengembalikan Kurma Khaibar kepada Yahudi",
        "perawi_melayu": "Abdullah bin Umar (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) returned to the Jews of Khaibar the date-palms of Khaibar and its land on the condition that they should work upon them with their own wealth (seeds, implements), and give half of the yield to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
        "malay_translation": "Rasulullah ﷺ mengembalikan kepada orang Yahudi Khaibar pokok kurma Khaibar dan tanahnya dengan syarat mereka harus mengusahakannya dengan harta mereka sendiri (benih, peralatan), dan memberikan separuh daripada hasilnya kepada Rasulullah ﷺ.",
        "arabic_text": "وحَدَّثَنَا ابْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، «أَنَّهُ دَفَعَ إِلَى يَهُودِ خَيْبَرَ نَخْلَ خَيْبَرَ وَأَرْضَهَا، عَلَى أَنْ يَعْتَمِلُوهَا مِنْ أَمْوَالِهِمْ، وَلِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ شَطْرُ ثَمَرِهَا."
      },
      {
        "id": 11531,
        "hadith_number": "3967",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pengusiran Yahudi dan Kristian dari Tanah Hijaz",
        "perawi_melayu": "Ibn Umar meriwayatkan:",
        "english_text": "'Umar bin al-Khattab (رضی اللہ عنہ) expelled the Jews and Christians from the land of Hijaz, and that when Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) conquered Khaibar he made up his mind to expel the Jews from it (the territory of Khaibar) because, when that land was conquered, it came under the sway of Allah, that of His Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and that of the Muslims. The jews asked Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) to let them continue there on the condition that they would work on it, and would get in turn half of the fruit (of the trees), whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: We would let you continue there so long as we will desire. So they continued (to cultivate the lands) till 'Umar رضی اللہ عنہ externed them to Taima' ang Ariha (two villages in Arabia, but out of Hijaz).",
        "malay_translation": "Umar bin al-Khattab (رضي الله عنه) telah mengusir orang Yahudi dan Kristian dari tanah Hijaz, dan sesungguhnya ketika Rasulullah (صلى الله عليه وسلم) menakluki Khaibar, baginda bertekad untuk mengusir orang Yahudi dari situ (wilayah Khaibar) kerana, apabila tanah itu ditakluki, ia berada di bawah kekuasaan Allah, Rasul-Nya (صلى الله عليه وسلم) dan umat Islam. Orang Yahudi meminta Rasulullah (صلى الله عليه وسلم) untuk membiarkan mereka terus tinggal di sana dengan syarat mereka akan bekerja di atasnya, dan akan mendapat sebagai balasan separuh daripada buah (pokok), kemudian Rasulullah (صلى الله عليه وسلم) bersabda: Kami akan membiarkan kamu terus berada di sana selagi kami inginkan. Maka mereka terus (mengusahakan tanah) sehingga 'Umar (رضي الله عنه) mengusir mereka ke Taima' dan Ariha (dua kampung di Arab, tetapi di luar Hijaz).",
        "arabic_text": ") وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَإِسْحَاقُ بْنُ مَنْصُورٍ، وَاللَّفْظُ لِابْنِ رَافِعٍ، قَالَا: حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، حَدَّثَنِي مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، أَجْلَى الْيَهُودَ وَالنَّصَارَى مِنْ أَرْضِ الْحِجَازِ، وَأَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَمَّا ظَهَرَ عَلَى خَيْبَرَ أَرَادَ إِخْرَاجَ الْيَهُودِ مِنْهَا، وَكَانَتِ الْأَرْضُ حِينَ ظُهِرَ عَلَيْهَا لِلَّهِ وَلِرَسُولِهِ وَلِلْمُسْلِمِينَ، فَأَرَادَ إِخْرَاجَ الْيَهُودِ مِنْهَا، فَسَأَلَتِ الْيَهُودُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يُقِرَّهُمْ بِهَا، عَلَى أَنْ يَكْفُوا عَمَلَهَا وَلَهُمْ نِصْفُ الثَّمَرِ، فَقَالَ لَهُمْ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «نُقِرُّكُمْ بِهَا عَلَى ذَلِكَ مَا شِئْنَا»، فَقَرُّوا بِهَا حَتَّى أَجْلَاهُمْ عُمَرُ إِلَى تَيْمَاءَ وَأَرِيحَاءَ."
      },
      {
        "id": 11532,
        "hadith_number": "3968",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ganjaran Pahala Menanam Pokok",
        "perawi_melayu": "Jabir (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Never does a Muslim plants a tree except that he has the reward of charity for him, for what is eaten out of that is charity; what is stolen out of that, what the beasts eat out of that, what the birds eat out of that is charity for him. (In short) none incurs a loss to him but it becomes a charity on his part.",
        "malay_translation": "Rasulullah (صلى الله عليه وسلم) bersabda: Tidaklah seorang Muslim menanam pokok, melainkan dia akan mendapat pahala sedekah daripada apa yang dimakan daripadanya adalah sedekah, apa yang dicuri daripadanya, apa yang dimakan oleh binatang daripadanya, dan apa yang dimakan oleh burung daripadanya adalah sedekah baginya. (Pendek kata) tidak ada yang merugikannya melainkan ia menjadi sedekah baginya.",
        "arabic_text": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عَبْدُ الْمَلِكِ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ مُسْلِمٍ يَغْرِسُ غَرْسًا إِلَّا كَانَ مَا أُكِلَ مِنْهُ لَهُ صَدَقَةً، وَمَا سُرِقَ مِنْهُ لَهُ صَدَقَةٌ، وَمَا أَكَلَ السَّبُعُ مِنْهُ فَهُوَ لَهُ صَدَقَةٌ، وَمَا أَكَلَتِ الطَّيْرُ فَهُوَ لَهُ صَدَقَةٌ، وَلَا يَرْزَؤُهُ أَحَدٌ إِلَّا كَانَ لَهُ صَدَقَةٌ."
      },
      {
        "id": 11533,
        "hadith_number": "3969",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ganjaran Sedekah daripada Menanam Pokok Kurma",
        "perawi_melayu": "Jabir (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) visited Umm Mubashshir al-Ansariya at her orchard of date-palms and said to her: Who has planted these trees of dates-a Muslim or a non-Musim? She said: A Muslim, of course, whereupon he said: Never a Muslim plants, or cultivates a land, and it out of that men eat, or the animals eat, or anything else eats, but that becomes charity on his (planter's) behalf.",
        "malay_translation": "Rasulullah (ﷺ) telah mengunjungi Ummu Mubashshir al-Ansariyyah di kebun kurmanya dan bersabda kepadanya: \"Siapakah yang menanam pokok-pokok kurma ini – seorang Muslim atau seorang bukan Muslim?\" Dia menjawab: \"Seorang Muslim, sudah tentu.\" Kemudian baginda bersabda: \"Tidaklah seorang Muslim menanam, atau mengusahakan sebidang tanah, dan dari hasil tanamannya itu manusia makan, atau binatang makan, atau apa sahaja memakannya, melainkan ia menjadi sedekah baginya (penanam).\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَى أُمِّ مُبَشِّرٍ الْأَنْصَارِيَّةِ فِي نَخْلٍ لَهَا، فَقَالَ لَهَا النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ غَرَسَ هَذَا النَّخْلَ؟ أَمُسْلِمٌ أَمْ كَافِرٌ؟» فَقَالَتْ: بَلْ مُسْلِمٌ، فَقَالَ: «لَا يَغْرِسُ مُسْلِمٌ غَرْسًا، وَلَا يَزْرَعُ زَرْعًا، فَيَأْكُلَ مِنْهُ إِنْسَانٌ، وَلَا دَابَّةٌ، وَلَا شَيْءٌ، إِلَّا كَانَتْ لَهُ صَدَقَةً."
      },
      {
        "id": 11534,
        "hadith_number": "3970",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ganjaran Menanam dan Mengusahakan Tanaman",
        "perawi_melayu": "Jabir bin 'Abdullah (رضی اللہ عنہ) meriwayatkan:",
        "english_text": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying: Never does a Muslim plant, or cultivate, but has reward for him for what the beasts eat, or the birds eat or anything else eats out of that.",
        "malay_translation": "Saya mendengar Rasulullah (ﷺ) bersabda: Tidaklah seorang Muslim menanam atau mengusahakan sesuatu, melainkan baginya ganjaran atas apa yang dimakan oleh binatang ternak, atau burung, atau apa sahaja yang memakannya daripada tanaman itu.",
        "arabic_text": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، وَابْنُ أَبِي خَلَفٍ، قَالَا: حَدَّثَنَا رَوْحٌ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «لَا يَغْرِسُ رَجُلٌ مُسْلِمٌ غَرْسًا، وَلَا زَرْعًا، فَيَأْكُلَ مِنْهُ سَبُعٌ أَوْ طَائِرٌ أَوْ شَيْءٌ، إِلَّا كَانَ لَهُ فِيهِ أَجْرٌ»، وقَالَ ابْنُ أَبِي خَلَفٍ: طَائِرٌ شَيْءٌ."
      },
      {
        "id": 11535,
        "hadith_number": "3971",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ganjaran Sedekah daripada Menanam Pokok",
        "perawi_melayu": "Jabir bin Abdullah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) visited the orchard of Umm Ma'sud and said: Umm Ma'bad رضی اللہ عنہا . he who has planted this tree, is he a Muslim or a non-Muslim? She said: Of course, he is a Muslim, whereupon he (the Holy Prophet) said: No Muslim who plants (trees) and from their fruits the human beings or the beasts or birds eat, but that would be taken as an act of charity on the Day of Resurrection.",
        "malay_translation": "Rasulullah (صلى الله عليه وسلم) telah melawat kebun Umm Ma'sud dan bersabda: Wahai Umm Ma'bad (رضي الله عنها), siapakah yang menanam pokok ini, adakah dia seorang Muslim atau bukan Muslim? Beliau menjawab: Sudah tentu dia seorang Muslim. Kemudian, Baginda (Nabi صلى الله عليه وسلم) bersabda: Tidaklah seorang Muslim yang menanam (pokok) dan daripada buahnya manusia, haiwan, atau burung makan, melainkan ia akan dikira sebagai sedekah pada Hari Kiamat.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدِ بْنِ إِبْرَاهِيمَ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا زَكَرِيَّا بْنُ إِسْحَاقَ، أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: دَخَلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى أُمِّ مَعْبَدٍ حَائِطًا، فَقَالَ: «يَا أُمَّ مَعْبَدٍ، مَنْ غَرَسَ هَذَا النَّخْلَ؟ أَمُسْلِمٌ أَمْ كَافِرٌ؟» فَقَالَتْ: بَلْ مُسْلِمٌ، قَالَ: «فَلَا يَغْرِسُ الْمُسْلِمُ غَرْسًا، فَيَأْكُلَ مِنْهُ إِنْسَانٌ، وَلَا دَابَّةٌ، وَلَا طَيْرٌ، إِلَّا كَانَ لَهُ صَدَقَةً إِلَى يَوْمِ الْقِيَامَةِ."
      },
      {
        "id": 11536,
        "hadith_number": "3972",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Riwayat Mengenai Hadith Daripada Umm Mubashir dan Isteri Zaid bin Harithah",
        "perawi_melayu": "Al-Amash, daripada Abu Sufyan, daripada Jabir رضي الله عنه. 'Amr menambah dalam riwayatnya daripada Ammar, dan Abu Kuraib menambah dalam riwayatnya daripada Abu Mu'awiyah \"daripada Umm Mubashir.\" Dalam riwayat Ibn Fudail dinyatakan: \"Daripada isteri Zaid bin Harithah رضي الله عنه.\" Dalam riwayat Ishaq daripada Abu Mu'awiyah dinyatakan: \"Mungkin dia berkata: \"daripada Umm Mubashir daripada Nabi ﷺ' dan mungkin dia tidak berkata demikian.\" Kesemuanya berkata: \"daripada Nabi ﷺ,\" seperti Hadith 'Ata' (no. 3968), Abu Az-Zubair (no. 3969) dan Amr bin Dinaar (no. 3971).",
        "english_text": "It was narrate from Al-Amash, from Abu Sufyan, from Jabir رضی اللہ عنہ . 'Amr added in his report from Ammar, and Abu Kuraib added in his report from Abu Mu'awiyah \"from Umm Mubashir. \" In the report of Ibn Fudail it says: \"From the wife of Zaid bin Harithah رضی اللہ عنہ .\" In the report of of Ishaq from Abu Mu'awiyah it says: \"Perhaps he said: \"from Umm Mubashir  from the prophet ﷺ' and Perhaps he did not say it.\" All of them said: \"from the prophet ﷺ,\" like the Hadith of 'Ata' (no. 3968), Abu Az-Zubair (no. 3969) and Amr bin Dinaar (no. 3971).",
        "malay_translation": "Diriwayatkan daripada Al-Amash, daripada Abu Sufyan, daripada Jabir رضي الله عنه. 'Amr menambah dalam riwayatnya daripada Ammar, dan Abu Kuraib menambah dalam riwayatnya daripada Abu Mu'awiyah \"daripada Umm Mubashir.\" Dalam riwayat Ibn Fudail dinyatakan: \"Daripada isteri Zaid bin Harithah رضي الله عنه.\" Dalam riwayat Ishaq daripada Abu Mu'awiyah dinyatakan: \"Mungkin dia berkata: \"daripada Umm Mubashir daripada Nabi ﷺ' dan mungkin dia tidak berkata demikian.\" Kesemuanya berkata: \"daripada Nabi ﷺ,\" seperti Hadith 'Ata' (no. 3968), Abu Az-Zubair (no. 3969) dan Amr bin Dinaar (no. 3971).",
        "arabic_text": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، ح وحَدَّثَنَا أَبُو كُرَيْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ، ح وحَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا عَمَّارُ بْنُ مُحَمَّدٍ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ فُضَيْلٍ، كُلُّ هَؤُلَاءِ عَنِ الْأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، زَادَ عَمْرٌو فِي رِوَايَتِهِ، عَنْ عَمَّارٍ، ح وَأَبُو كُرَيْبٍ فِي رِوَايَتِهِ: عَنْ أَبِي مُعَاوِيَةَ، فَقَالَا: عَنْ أُمِّ مُبَشِّرٍ، وَفِي رِوَايَةِ ابْنِ فُضَيْلٍ: عَنِ امْرَأَةِ زَيْدِ بْنِ حَارِثَةَ، وَفِي رِوَايَةِ إِسْحَاقَ: عَنْ أَبِي مُعَاوِيَةَ، قَالَ: رُبَّمَا قَالَ: عَنْ أُمِّ مُبَشِّرٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَرُبَّمَا لَمْ يَقُلْ، وَكُلُّهُمْ قَالُوا: عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِ حَدِيثِ عَطَاءٍ، وَأَبِي الزُّبَيْرِ، وَعَمْرِو بْنِ دِينَارٍ."
      },
      {
        "id": 11537,
        "hadith_number": "3973",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ganjaran Menanam Pokok dan Mengusahakan Tanah",
        "perawi_melayu": "Anas رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying Never does a Muslim plant trees or cultivate land and birds or a man or a beast eat out of them but that is a charity on his behalf.",
        "malay_translation": "Rasulullah ﷺ bersabda: “Tidaklah seorang Muslim menanam pokok atau mengusahakan tanah, lalu burung, manusia, atau binatang memakan hasilnya, melainkan ia adalah sedekah baginya.”",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ، وَاللَّفْظُ لِيَحْيَى، قَالَ يَحْيَى: أَخْبَرَنَا، وقَالَ الْآخَرَانِ: حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ مُسْلِمٍ يَغْرِسُ غَرْسًا، أَوْ يَزْرَعُ زَرْعًا، فَيَأْكُلُ مِنْهُ طَيْرٌ، أَوْ إِنْسَانٌ، أَوْ بَهِيمَةٌ، إِلَّا كَانَ لَهُ بِهِ صَدَقَةٌ."
      },
      {
        "id": 11538,
        "hadith_number": "3974",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kunjungan Rasulullah SAW ke Kebun Kurma Umm Mubashir",
        "perawi_melayu": "Anas bin Malik (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) visited the date-palms of Umm Mubashir ( رضی اللہ عنہا), a lady from the Ansar, and said: Who planted this palm-a Muslim or an unbelievers The rest of the hadith is the same.",
        "malay_translation": "Rasulullah SAW mengunjungi kebun kurma Umm Mubashir (رضي الله عنها), seorang wanita daripada golongan Ansar, dan bersabda: \"Siapakah yang menanam pokok kurma ini - seorang Muslim atau seorang kafir?\" Selebihnya hadis adalah sama.",
        "arabic_text": "وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ، حَدَّثَنَا قَتَادَةُ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، أَنَّ نَبِيَّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ دَخَلَ نَخْلًا لِأُمِّ مُبَشِّرٍ، امْرَأَةٍ مِنَ الْأَنْصَارِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ غَرَسَ هَذَا النَّخْلَ؟ أَمُسْلِمٌ أَمْ كَافِرٌ؟» قَالُوا: مُسْلِمٌ، بِنَحْوِ حَدِيثِهِمْ."
      },
      {
        "id": 11539,
        "hadith_number": "3975",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Mengambil Keuntungan Apabila Buah-Buahan Ditimpa Musibah",
        "perawi_melayu": "Jabir bin Abdullah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying: If You sell fruits to your brother (and Jabir bin Abdullah رضی اللہ عنہ reported through another chain of narrators: If you were to sell fruits to your brother) and these is a stricken with Calamity, it is not permissible for you to get anything from him. Why do you get the wealth of your brother, without jutification?",
        "malay_translation": "Rasulullah ﷺ bersabda: \"Jika kamu menjual buah-buahan kepada saudaramu (dan Jabir bin Abdullah رضي الله عنه meriwayatkan melalui satu lagi rantaian perawi: Jika kamu menjual buah-buahan kepada saudaramu) dan buah-buahan tersebut ditimpa musibah, maka tidak halal bagimu untuk mengambil apa-apa daripadanya. Mengapa kamu mengambil harta saudaramu tanpa hak?\"",
        "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنِ ابْنِ جُرَيْجٍ، أَنَّ أَبَا الزُّبَيْرِ، أَخْبَرَهُ عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنْ بِعْتَ مِنْ أَخِيكَ ثَمَرًا»، ح وحَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، حَدَّثَنَا أَبُو ضَمْرَةَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَوْ بِعْتَ مِنْ أَخِيكَ ثَمَرًا، فَأَصَابَتْهُ جَائِحَةٌ، فَلَا يَحِلُّ لَكَ أَنْ تَأْخُذَ مِنْهُ شَيْئًا، بِمَ تَأْخُذُ مَالَ أَخِيكَ بِغَيْرِ حَقٍّ."
      },
      {
        "id": 11540,
        "hadith_number": "3976",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadith Serupa Diriwayatkan oleh Juraij",
        "perawi_melayu": "Tiada maklumat perawi",
        "english_text": "A hadith like this has been narrated on the authority of Juraij with the same chain of transmitters.",
        "malay_translation": "Hadith seperti ini telah diriwayatkan daripada Juraij dengan sanad perawi yang sama.",
        "arabic_text": "وحَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ."
      },
      {
        "id": 11541,
        "hadith_number": "3977",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Menjual Buah Kurma Sebelum Masak",
        "perawi_melayu": "Anas (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade the sale of the fruit of date-palms until it becomes mellow. We (some of the other narrators in the chain of transmitters) said: What does the word mellow mean? He said: (There the fruit) turns red or yellow. Don't you see if Allah had checked (the growth of) fruits; then what for the wealth of your brother would be permissible for you?",
        "malay_translation": "Rasulullah (صلى الله عليه وسلم) melarang penjualan buah kurma sehingga ia menjadi masak. Kami (sebahagian daripada perawi lain dalam rantaian perawi) berkata: Apakah maksud perkataan masak? Baginda bersabda: (Di sana buah itu) menjadi merah atau kuning. Tidakkah kamu melihat jika Allah menghalang (pertumbuhan) buah-buahan; maka apakah harta saudaramu halal bagimu?",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَعَلِيُّ بْنُ حُجْرٍ، قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ ثَمَرِ النَّخْلِ حَتَّى تَزْهُوَ»، فَقُلْنَا لِأَنَسٍ: مَا زَهْوُهَا؟ قَالَ: «تَحْمَرُّ وَتَصْفَرُّ، أَرَأَيْتَكَ إِنْ مَنَعَ اللهُ الثَّمَرَةَ بِمَ تَسْتَحِلُّ مَالَ أَخِيكَ."
      },
      {
        "id": 11542,
        "hadith_number": "3978",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Menjual Buah-Buahan Sebelum Masak",
        "perawi_melayu": "Anas bin Malik (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) forbade the sale of fruits until these are mellow. They (the companions of Anas) said: What is meant by mellow ? He said: It implies that these became red. He said: When Allah hinders the growth of fruits, (then) what for the wealth of your brother would become permissible for you?",
        "malay_translation": "Rasulullah (صلى الله عليه وسلم) melarang penjualan buah-buahan sehingga ia masak. Mereka (sahabat Anas) berkata: Apakah maksud 'masak'? Baginda bersabda: Ia bermaksud buah-buahan itu menjadi merah. Baginda bersabda: Apabila Allah menghalang pertumbuhan buah-buahan, (maka) mengapa harta saudaramu menjadi halal bagimu?",
        "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَالِكٌ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الثَّمَرَةِ حَتَّى تُزْهِيَ»، قَالُوا: وَمَا تُزْهِيَ؟ قَالَ: «تَحْمَرُّ»، فَقَالَ: «إِذَا مَنَعَ اللهُ الثَّمَرَةَ فَبِمَ تَسْتَحِلُّ مَالَ أَخِيكَ."
      },
      {
        "id": 11543,
        "hadith_number": "3979",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rezeki yang Diberikan Allah",
        "perawi_melayu": "Anas (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: If Allah does not fructify them, then what is permissible for one of you to take the wealth of his brother?",
        "malay_translation": "Rasulullah ﷺ bersabda: 'Jika Allah tidak memberikan rezeki kepada mereka, maka apakah halal bagi seseorang daripada kamu mengambil harta saudaranya?'",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبَّادٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنْ لَمْ يُثْمِرْهَا اللهُ، فَبِمَ يَسْتَحِلُّ أَحَدُكُمْ مَالَ أَخِيهِ؟"
      },
      {
        "id": 11544,
        "hadith_number": "3980",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perintah Nabi (ﷺ) tentang Pengurangan Bayaran bagi yang Ditimpa Musibah",
        "perawi_melayu": "Jabir (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) commanded to make deductions in the payment of that stricken with a Calamity. \r\nAbu Ishaq said: \"Ibrahim (who was the companion of Muslims) said: ' \"Abdur Rahman bin Bishr narrated this to me from Sufyan. '\"",
        "malay_translation": "Rasulullah (ﷺ) memerintahkan untuk membuat potongan dalam pembayaran bagi mereka yang ditimpa musibah.\nAbu Ishaq berkata: \"Ibrahim (yang merupakan sahabat kaum Muslimin) berkata: 'Abdur Rahman bin Bishr meriwayatkan ini kepada saya daripada Sufyan.'\"",
        "arabic_text": "حَدَّثَنَا بِشْرُ بْنُ الْحَكَمِ، وَإِبْرَاهِيمُ بْنُ دِينَارٍ، وَعَبْدُ الْجَبَّارِ بْنُ الْعَلَاءِ، وَاللَّفْظُ لِبِشْرٍ، قَالُوا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ حُمَيْدٍ الْأَعْرَجِ، عَنْ سُلَيْمَانَ بْنِ عَتِيقٍ، عَنْ جَابِرٍ، «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِوَضْعِ الْجَوَائِحِ»، قَالَ أَبُو إِسْحَاقَ - وَهُوَ صَاحِبُ مُسْلِمٍ -: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ، عَنْ سُفْيَانَ، بِهَذَا."
      },
      {
        "id": 11545,
        "hadith_number": "3981",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Bantuan Zakat untuk Membayar Hutang yang Tidak Cukup",
        "perawi_melayu": "Abu Sa'id al-Khudri (رضي الله عنه) meriwayatkan:",
        "english_text": "In the time of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) a man suffered loss in fruits he had bought and his debt increased; so Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) told (the people) to give him charity and they gave him charity, but that was not enough to pay the debt in full, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to his creditors: Take what you find, you will have nothing but alms.",
        "malay_translation": "Pada zaman Rasulullah (صلى الله عليه وسلم), seorang lelaki mengalami kerugian dalam buah-buahan yang dibelinya dan hutangnya bertambah; maka Rasulullah (صلى الله عليه وسلم) menyuruh (orang ramai) memberikan sedekah kepadanya dan mereka memberikan sedekah, tetapi itu tidak mencukupi untuk membayar hutang sepenuhnya, lalu Rasulullah (صلى الله عليه وسلم) berkata kepada pemiutangnya: Ambil apa yang kamu dapati, kamu hanya akan mendapat sedekah.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ بُكَيْرٍ، عَنْ عِيَاضِ بْنِ عَبْدِ اللهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ: أُصِيبَ رَجُلٌ فِي عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي ثِمَارٍ ابْتَاعَهَا، فَكَثُرَ دَيْنُهُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «تَصَدَّقُوا عَلَيْهِ»، فَتَصَدَّقَ النَّاسُ عَلَيْهِ، فَلَمْ يَبْلُغْ ذَلِكَ وَفَاءَ دَيْنِهِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِغُرَمَائِهِ: «خُذُوا مَا وَجَدْتُمْ، وَلَيْسَ لَكُمْ إِلَّا ذَلِكَ."
      },
      {
        "id": 11546,
        "hadith_number": "3982",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Mengenai Sanad yang Sama",
        "perawi_melayu": "Bukair bin al-Ashajj",
        "english_text": "This hadith has been narrated on the authority of Bukair bin al-Ashajj with the same chain of transmitters.",
        "malay_translation": "Hadis ini telah diriwayatkan daripada Bukair bin al-Ashajj dengan rangkaian perawi yang sama.",
        "arabic_text": "حَدَّثَنِي يُونُسُ بْنُ عَبْدِ الْأَعْلَى، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ بُكَيْرِ بْنِ الْأَشَجِّ بِهَذَا الْإِسْنَادِ مِثْلَهُ."
      },
      {
        "id": 11547,
        "hadith_number": "3983",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah ﷺ Mendengar Perdebatan di Pintu",
        "perawi_melayu": "A'isha (رضي الله عنها) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) heard the voices of altercation of two disputants at the door; both the voices were quite loud. The one demanded some remission and desired that the other one should show leniency to him, whereupon the (other one) was saying: By Allah will not do that. Then there came Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) to them and said: Where is he who swears by Allah that he would not do good? He said: Messenger of Allah, it is I. He may do as he desires.",
        "malay_translation": "Rasulullah ﷺ mendengar suara perbalahan dua orang yang bertengkar di pintu; kedua-dua suara itu agak kuat. Seorang menuntut sedikit keringanan dan berharap orang yang lain menunjukkan belas kasihan kepadanya, lalu (orang yang lain) berkata: Demi Allah, saya tidak akan berbuat demikian. Kemudian datanglah Rasulullah ﷺ kepada mereka dan bersabda: Di manakah orang yang bersumpah demi Allah bahawa dia tidak akan berbuat baik? Dia berkata: Rasulullah, saya orangnya. Dia boleh berbuat seperti yang dia inginkan.",
        "arabic_text": "وحَدَّثَنِي غَيْرُ وَاحِدٍ مِنْ أَصْحَابِنَا، قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ وَهُوَ ابْنُ بِلَالٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي الرِّجَالِ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ أُمَّهُ عَمْرَةَ بِنْتَ عَبْدِ الرَّحْمَنِ، قَالَتْ: سَمِعْتُ عَائِشَةَ، تَقُولُ: سَمِعَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ صَوْتَ خُصُومٍ بِالْبَابِ، عَالِيَةٍ أَصْوَاتُهُمَا، وَإِذَا أَحَدُهُمَا يَسْتَوْضِعُ الْآخَرَ وَيَسْتَرْفِقُهُ فِي شَيْءٍ، وَهُوَ يَقُولُ: وَاللهِ لَا أَفْعَلُ، فَخَرَجَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَيْهِمَا، فَقَالَ: «أَيْنَ الْمُتَأَلِّي عَلَى اللهِ لَا يَفْعَلُ الْمَعْرُوفَ؟» قَالَ: أَنَا، يَا رَسُولَ اللهِ، فَلَهُ أَيُّ ذَلِكَ أَحَبَّ."
      },
      {
        "id": 11548,
        "hadith_number": "3984",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Nabi ﷺ Membantu Menyelesaikan Hutang di Masjid",
        "perawi_melayu": "Abdullah bin Ka'ab bin Malik meriwayatkan daripada bapanya:",
        "english_text": "He pressed in the mosque Ibn Abu Hadrad رضی اللہ عنہ for the payment of the debt that he owed to him during the lifetime of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). (In this altercation) their voices became loud, until Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) heard them, while he was in the house, so Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came out towards them, and he lifted the curtain of his apartment and he called upon Ka'b b. Malik and said: O Ka'b. He said: At thy beck and call, Allah's Messenger. He pointed out with the help of his hand to remit half of the loan due to him. Ka'b said: Allah's Messenger, I am ready to do that, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said (to Ibn Abu Hadrad): Stand up and make him the payment (of the rest).",
        "malay_translation": "Ibn Abu Hadrad رضی اللہ عنہ menuntut pembayaran hutang di dalam masjid yang perlu dibayar kepadanya semasa hayat Rasulullah ﷺ. (Dalam pertengkaran ini) suara mereka menjadi kuat, sehingga Rasulullah ﷺ mendengar mereka, sedangkan Baginda berada di dalam rumah. Lalu Rasulullah ﷺ keluar kepada mereka, dan Baginda mengangkat tirai bilik Baginda dan memanggil Ka'b b. Malik dan berkata: Wahai Ka'b. Dia berkata: Saya sedia, wahai Rasulullah. Baginda memberi isyarat dengan tangannya untuk mengurangkan separuh daripada hutang yang perlu dibayar kepadanya. Ka'b berkata: Wahai Rasulullah, saya bersedia berbuat demikian, lalu Rasulullah ﷺ berkata (kepada Ibn Abu Hadrad): Bangun dan bayarlah baki (hutang) itu kepadanya.",
        "arabic_text": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عَبْدُ اللهِ بْنُ كَعْبِ بْنِ مَالِكٍ، أَخْبَرَهُ، عَنْ أَبِيهِ، أَنَّهُ تَقَاضَى ابْنَ أَبِي حَدْرَدٍ دَيْنًا كَانَ لَهُ عَلَيْهِ فِي عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ، فَارْتَفَعَتْ أَصْوَاتُهُمَا حَتَّى سَمِعَهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي بَيْتِهِ، فَخَرَجَ إِلَيْهِمَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَتَّى كَشَفَ سِجْفَ حُجْرَتِهِ، وَنَادَى كَعْبَ بْنَ مَالِكٍ، فَقَالَ: «يَا كَعْبُ»، فَقَالَ: لَبَّيْكَ يَا رَسُولَ اللهِ، «فَأَشَارَ إِلَيْهِ بِيَدِهِ أَنْ ضَعِ الشَّطْرَ مِنْ دَيْنِكَ»، قَالَ كَعْبٌ: قَدْ فَعَلْتُ يَا رَسُولَ اللهِ، قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «قُمْ فَاقْضِهِ."
      },
      {
        "id": 11549,
        "hadith_number": "3985",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Permintaan Pembayaran Hutang oleh Ka'b bin Malik kepada Ibn Abi Hadrad",
        "perawi_melayu": "Tiada maklumat",
        "english_text": "Kab bin Malik رضی اللہ عنہ narrated that he asked Ibn Abi Hadard رضی اللہ عنہ to pay off a debt that he owed him.. a Hadith like that of Ibn Wahb (3984).",
        "malay_translation": "Ka'b bin Malik رضي الله عنه meriwayatkan bahawa beliau meminta Ibn Abi Hadard رضي الله عنه untuk membayar hutang yang beliau berhutang kepadanya.. sebuah Hadith seperti Ibn Wahb (3984).",
        "arabic_text": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عُثْمَانُ بْنُ عُمَرَ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، عَنْ عَبْدِ اللهِ بْنِ كَعْبِ بْنِ مَالِكٍ، أَنَّ كَعْبَ بْنَ مَالِكٍ، أَخْبَرَهُ أَنَّهُ تَقَاضَى دَيْنًا لَهُ عَلَى ابْنِ أَبِي حَدْرَدٍ بِمِثْلِ حَدِيثِ ابْنِ وَهْبٍ"
      },
      {
        "id": 11550,
        "hadith_number": "3986",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Nabi ﷺ Mengarahkan Pembayaran Separuh Hutang",
        "perawi_melayu": "Ka'b bin Malik رضي الله عنه meriwayatkan:",
        "english_text": "He made a demand for the payment of the debt that Ibn Abu Hadrad رضی اللہ عنہ owed to him. This hadith is narrated through another chain of transmitters and (the words are): He had to get the loan from Abdullah bin Hadrad al-Aslami رضی اللہ عنہ . He met him and pressed him for payment. There was an altercation between them, until their voices became loud. There happened to pass by them Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he said: O Ka'b, and pointed out with his hand in such a way as he meant half. So he got half of what he (Ibn Abu Hadrad رضی اللہ عنہ ) owed to him and remitted the half.",
        "malay_translation": "Beliau menuntut pembayaran hutang yang dihutang oleh Ibn Abu Hadrad رضي الله عنه kepadanya. Hadis ini diriwayatkan melalui satu lagi rantaian perawi dan (lafaznya adalah): Beliau terpaksa mendapatkan pinjaman daripada Abdullah bin Hadrad al-Aslami رضي الله عنه. Beliau bertemu dengannya dan mendesaknya untuk membayar. Terdapat perbalahan antara mereka, sehingga suara mereka menjadi kuat. Tiba-tiba, Rasulullah ﷺ melalui mereka dan berkata: Wahai Ka'b, dan menunjukkan dengan tangannya seolah-olah bermaksud separuh. Maka dia mendapat separuh daripada apa yang (Ibn Abu Hadrad رضي الله عنه ) berhutang kepadanya dan memaafkan separuh lagi.",
        "arabic_text": "قَالَ مُسْلِمٌ: وَرَوَى اللَّيْثُ بْنُ سَعْدٍ، حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ، عَنْ عَبْدِ اللهِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ كَعْبِ بْنِ مَالِكٍ، أَنَّهُ كَانَ لَهُ مَالٌ عَلَى عَبْدِ اللهِ بْنِ أَبِي حَدْرَدٍ الْأَسْلَمِيِّ، فَلَقِيَهُ، فَلَزِمَهُ، فَتَكَلَّمَا حَتَّى ارْتَفَعَتْ أَصْوَاتُهُمَا، فَمَرَّ بِهِمَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «يَا كَعْبُ»، «فَأَشَارَ بِيَدِهِ كَأَنَّهُ يَقُولُ النِّصْفَ»، فَأَخَذَ نِصْفًا مِمَّا عَلَيْهِ، وَتَرَكَ نِصْفًا."
      },
      {
        "id": 11551,
        "hadith_number": "3987",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hak Pemilik untuk Mendapatkan Hartanya Semula Apabila Pembeli Muflis",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: He who found his property intact with a person (who bought it but who later on) became insolvent (or a person who became insolvent), he (the seller) is entitled to get it more than anyone else. '",
        "malay_translation": "Rasulullah (ﷺ) bersabda: 'Sesiapa yang mendapati hartanya masih utuh pada seseorang (yang membelinya tetapi kemudian) menjadi muflis (atau seseorang yang menjadi muflis), maka dia (penjual) berhak mendapatkannya lebih daripada sesiapa sahaja.'",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللهِ بْنِ يُونُسَ، حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، أَخْبَرَنِي أَبُو بَكْرِ بْنُ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، أَخْبَرَهُ، أَنَّ أَبَا بَكْرِ بْنَ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، أَخْبَرَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: - أَوْ سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: - «مَنْ أَدْرَكَ مَالَهُ بِعَيْنِهِ عِنْدَ رَجُلٍ قَدْ أَفْلَسَ - أَوْ إِنْسَانٍ قَدْ أَفْلَسَ - فَهُوَ أَحَقُّ بِهِ مِنْ غَيْرِهِ»."
      },
      {
        "id": 11552,
        "hadith_number": "3988",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Orang Yang Muflis",
        "perawi_melayu": "Hadis seperti yang diriwayatkan daripada Zubair (no. 3988) telah diriwayatkan daripada Yahya bin Saeed dengan sanad ini. Ibn Rumh berkata dalam riwayatnya:",
        "english_text": "\"Any man who becomes bnkrupt.\"",
        "malay_translation": "\"Sesiapa sahaja yang menjadi muflis.\"",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، ح وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ رُمْحٍ، جَمِيعًا عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وحَدَّثَنَا أَبُو الرَّبِيعِ، وَيَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، قَالَا: حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، وَيَحْيَى بْنُ سَعِيدٍ، وَحَفْصُ بْنُ غِيَاثٍ، كُلُّ هَؤُلَاءِ، عَنْ يَحْيَى بْنِ سَعِيدٍ، فِي هَذَا الْإِسْنَادِ بِمَعْنَى حَدِيثِ زُهَيْرٍ، وقَالَ ابْنُ رُمْحٍ مِنْ بَيْنِهِمْ فِي رِوَايَتِهِ: «أَيُّمَا امْرِئٍ فُلِّسَ."
      },
      {
        "id": 11553,
        "hadith_number": "3989",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Harta Orang Muflis yang Masih Utuh",
        "perawi_melayu": "Abu Hurairah (رَضِيَ ٱللَّٰهُ عَنْهُ) meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying about a person who becomes insolvent and (the thing bought by him) is found intact with him, that belongs to one who sold it.",
        "malay_translation": "Rasulullah (ﷺ) bersabda mengenai seseorang yang muflis dan (barang yang dibelinya) didapati masih utuh bersamanya, bahawa ia adalah milik orang yang menjualnya.",
        "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا هِشَامُ بْنُ سُلَيْمَانَ وَهُوَ ابْنُ عِكْرِمَةَ بْنِ خَالِدٍ الْمَخْزُومِيُّ، عَنِ ابْنِ جُرَيْجٍ، حَدَّثَنِي ابْنُ أَبِي حُسَيْنٍ، أَنَّ أَبَا بَكْرِ بْنَ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، أَخْبَرَهُ، أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، حَدَّثَهُ، عَنْ حَدِيثِ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَدِيثِ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فِي الرَّجُلِ الَّذِي يُعْدِمُ، إِذَا وُجِدَ عِنْدَهُ الْمَتَاعُ، وَلَمْ يُفَرِّقْهُ: «أَنَّهُ لِصَاحِبِهِ الَّذِي بَاعَهُ»."
      },
      {
        "id": 11554,
        "hadith_number": "3990",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hak Penjual Barang yang Belum Dibayar",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When a man becomes insolvent (and the other) man (the seller) finds his commodity intact with him, he is more entitled to get it (than anyone else)",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Apabila seseorang menjadi muflis (tidak mampu membayar hutang) dan seseorang (penjual) yang lain mendapati barangnya masih ada padanya (si pembeli), maka penjual itu adalah lebih berhak untuk mengambilnya (berbanding orang lain).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالَا: حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا أَفْلَسَ الرَّجُلُ، فَوَجَدَ الرَّجُلُ مَتَاعَهُ بِعَيْنِهِ، فَهُوَ أَحَقُّ بِهِ»."
      },
      {
        "id": 11555,
        "hadith_number": "3991",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hak Mendapatkannya Lebih Utama",
        "perawi_melayu": "Hadith ini diriwayatkan dari Qatada dengan rantaian perawi yang sama.",
        "english_text": "He is more entitled to get it than any other creditor.",
        "malay_translation": "Dia lebih berhak mendapatkannya daripada mana-mana pemiutang yang lain.",
        "arabic_text": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا سَعِيدٌ، ح وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، أَيْضًا حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، كِلَاهُمَا عَنْ قَتَادَةَ، بِهَذَا الْإِسْنَادِ مِثْلَهُ، وَقَالَا: «فَهُوَ أَحَقُّ بِهِ مِنَ الْغُرَمَاءِ»."
      },
      {
        "id": 11556,
        "hadith_number": "3992",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hak Penjual dalam Keadaan Pembeli Muflis",
        "perawi_melayu": "Abu Hurairah (رَضِيَ ٱللَّٰهُ عَنْهُ) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When a man becomes insolvent, and the other person (seller) finds his goods intact with him, he is more entitled to get them than anyone else.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Apabila seseorang menjadi muflis, dan orang lain (penjual) mendapati barangnya masih utuh bersamanya, maka dia lebih berhak mendapatkannya daripada orang lain.",
        "arabic_text": "وحَدَّثَنِي مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ، وَحَجَّاجُ بْنُ الشَّاعِرِ، قَالَا: حَدَّثَنَا أَبُو سَلَمَةَ الْخُزَاعِيُّ، قَالَ حَجَّاجٌ: مَنْصُورُ بْنُ سَلَمَةَ، أَخْبَرَنَا سُلَيْمَانُ بْنُ بِلَالٍ، عَنْ خُثَيْمِ بْنِ عِرَاكٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا أَفْلَسَ الرَّجُلُ، فَوَجَدَ الرَّجُلُ عِنْدَهُ سِلْعَتَهُ بِعَيْنِهَا، فَهُوَ أَحَقُّ بِهَا»."
      },
      {
        "id": 11557,
        "hadith_number": "3993",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Malaikat Mencabut Nyawa dan Pengampunan Allah",
        "perawi_melayu": "Hudhaifa رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying The angels took away the soul of a person who had lived among people who were before you. They (the angels) said: Did you do anything good? He said: No. they said: Try to recall. He said: I used to lend to people and order my servants to give respite to one in straitened circumstances and give allowance to the solvent, for Allah, the Exalted and Majestic, said (to the angels): You should ignore (his failing).",
        "malay_translation": "Rasulullah (صلى الله عليه وسلم) bersabda: Malaikat mencabut nyawa seorang lelaki yang pernah hidup dalam kalangan orang sebelum kamu. Mereka (malaikat) bertanya: Adakah kamu melakukan sebarang kebaikan? Dia menjawab: Tidak. Mereka berkata: Cuba ingat semula. Dia berkata: Aku biasa memberi pinjaman kepada orang ramai dan aku mengarahkan pelayan-pelayanku supaya memberi tangguh kepada orang yang dalam kesempitan dan memberi kelonggaran kepada orang yang mampu, kerana Allah, Yang Maha Tinggi dan Maha Agung, berfirman (kepada malaikat): Kamu patut mengabaikan (kekurangannya).",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللهِ بْنِ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا مَنْصُورٌ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، أَنَّ حُذَيْفَةَ، حَدَّثَهُمْ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: تَلَقَّتِ الْمَلَائِكَةُ رُوحَ رَجُلٍ مِمَّنْ كَانَ قَبْلَكُمْ، فَقَالُوا: أَعَمِلْتَ مِنَ الْخَيْرِ شَيْئًا؟ قَالَ: لَا، قَالُوا: تَذَكَّرْ، قَالَ: كُنْتُ أُدَايِنُ النَّاسَ فَآمُرُ فِتْيَانِي أَنْ يُنْظِرُوا الْمُعْسِرَ، وَيَتَجَوَّزُوا عَنِ الْمُوسِرِ، قَالَ: قَالَ اللهُ عَزَّ وَجَلَّ: تَجَوَّزُوا عَنْهُ."
      },
      {
        "id": 11558,
        "hadith_number": "3994",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Seorang yang Membebaskan Hutang",
        "perawi_melayu": "Hudhaifa رضی اللہ عنہ meriwayatkan:",
        "english_text": "A person met his Lord (after death) and He said: What (good) did you do? He said: I did no good except this that I was a rich man, and I demanded from the people (the repayment of debt that I advanced to them). I, however, accepted that which the solvent gave and remitted (the debt) of the insolvent, whereupon He (the Lord) said: You should ignore (the faults) of My servant. Abu Mas'ud ( رضی اللہ عنہ) said: This is what I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying.",
        "malay_translation": "Seseorang bertemu dengan Tuhannya (selepas kematian) dan Dia berfirman: Apakah (kebaikan) yang telah kamu lakukan? Dia berkata: Aku tidak melakukan kebaikan kecuali ini, bahawa aku adalah seorang lelaki kaya, dan aku menuntut daripada orang ramai (pembayaran balik hutang yang aku berikan kepada mereka). Walau bagaimanapun, aku menerima apa yang diberikan oleh orang yang mampu membayar dan membebaskan (hutang) orang yang tidak mampu, lalu Dia (Tuhan) berfirman: Kamu patut mengabaikan (kesilapan) hamba-Ku. Abu Mas'ud (رضي الله عنه) berkata: Inilah yang aku dengar Rasulullah (صلى الله عليه وسلم) bersabda.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَاللَّفْظُ لِابْنِ حُجْرٍ، قَالَا: حَدَّثَنَا جَرِيرٌ، عَنِ الْمُغِيرَةِ، عَنْ نُعَيْمِ بْنِ أَبِي هِنْدٍ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، قَالَ: اجْتَمَعَ حُذَيْفَةُ، وَأَبُو مَسْعُودٍ، فَقَالَ حُذَيْفَةُ: رَجُلٌ لَقِيَ رَبَّهُ، فَقَالَ: مَا عَمِلْتَ؟ قَالَ: مَا عَمِلْتُ مِنَ الْخَيْرِ إِلَّا أَنِّي كُنْتُ رَجُلًا ذَا مَالٍ، فَكُنْتُ أُطَالِبُ بِهِ النَّاسَ فَكُنْتُ أَقْبَلُ الْمَيْسُورَ، وَأَتَجَاوَزُ عَنِ الْمَعْسُورِ، فَقَالَ: تَجَاوَزُوا عَنْ عَبْدِي ، قَالَ أَبُو مَسْعُودٍ: هَكَذَا سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ."
      },
      {
        "id": 11559,
        "hadith_number": "3995",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kelebihan Berlemah Lembut dalam Urusan Muamalah",
        "perawi_melayu": "Hudhaifa ( رضی اللہ عنہ) meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: A person died and he entered Paradise. It was said to him What (act) did you do? (Either he recalled it himself or he was made to recall), he said I used to enter into transactions with people and I gave respite to the insolvent and did not show any strictness in case of accepting a coin or demanding cash payment. (For these acts of his) he was granted pardon. Abu Mas'ud  رضی اللہ عنہ said: I heard this from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
        "malay_translation": "Rasulullah (صلى الله عليه وسلم) bersabda: Seorang lelaki meninggal dunia lalu dia masuk ke dalam syurga. Dikatakan kepadanya: Apakah (amalan) yang telah kamu lakukan? (Sama ada dia mengingatinya sendiri atau dia diingatkan), dia berkata: Aku dahulu selalu melakukan urusan jual beli dengan orang ramai dan aku memberi tangguh kepada orang yang tidak mampu membayar hutang dan tidak bersikap keras dalam menerima wang atau menuntut pembayaran tunai. (Kerana amalan-amalannya itu) dia diampuni. Abu Mas'ud  رضی اللہ عنہ berkata: Aku mendengar ini daripada Rasulullah (صلى الله عليه وسلم).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ حُذَيْفَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَنَّ رَجُلًا مَاتَ، فَدَخَلَ الْجَنَّةَ، فَقِيلَ لَهُ: مَا كُنْتَ تَعْمَلُ؟ - قَالَ: فَإِمَّا ذَكَرَ وَإِمَّا ذُكِّرَ - فَقَالَ: إِنِّي كُنْتُ أُبَايِعُ النَّاسَ، فَكُنْتُ أُنْظِرُ الْمُعْسِرَ، وَأَتَجَوَّزُ فِي السِّكَّةِ - أَوْ فِي النَّقْدِ - فَغُفِرَ لَهُ ، فَقَالَ أَبُو مَسْعُودٍ: وَأَنَا سَمِعْتُهُ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 11560,
        "hadith_number": "3996",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kelebihan Kemaafan dan Pemberian Kelonggaran kepada Peminjam",
        "perawi_melayu": "Hudhaifa (رضي اﷲ عنہ) meriwayatkan:",
        "english_text": "A servant from amongst the servants of Allah was brought to Him whom Allah had endowed with riches. He (Allah) said to him: What (did you do) in the world? (They cannot conceal anything from Allah) He (the person) said: O my Lord, You endowed me with Your riches. I used to enter into transactions with people. It was my nature to be lenient to (my debtors). I showed leniency to the solvent and gave respite to the insolvent, whereupon Allah said: I have more right than you to do this to connive at My servant. 'Uqba bin 'Amir al-Juhani and Abu Mas'ud رضی اﷲ عنہ said: This is what we heard from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
        "malay_translation": "Seorang hamba daripada kalangan hamba-hamba Allah dibawa kepada-Nya, yang mana Allah telah mengurniakan kepadanya kekayaan. Allah berfirman kepadanya: Apa yang kamu lakukan di dunia? (Mereka tidak dapat menyembunyikan sesuatu pun daripada Allah). Orang itu berkata: Wahai Tuhanku, Engkau telah mengurniakan kepadaku kekayaan-Mu. Aku selalu menjalankan urusan perniagaan dengan manusia. Adalah menjadi tabiatku untuk bermurah hati kepada (peminjamku). Aku memberi kelonggaran kepada yang mampu membayar dan memberi tempoh kepada yang tidak mampu, lalu Allah berfirman: Aku lebih berhak daripada kamu untuk melakukan ini, iaitu memaafkan hamba-Ku. 'Uqba bin 'Amir al-Juhani dan Abu Mas'ud رضی اﷲ عنہ berkata: Inilah yang kami dengar daripada Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم).",
        "arabic_text": "حَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ سَعْدِ بْنِ طَارِقٍ، عَنْ رِبْعِيِّ، بْنِ حِرَاشٍ عَنْ حُذَيْفَةَ، قَالَ ‏ ‏ أُتِيَ اللَّهُ بِعَبْدٍ مِنْ عِبَادِهِ آتَاهُ اللَّهُ مَالاً فَقَالَ لَهُ مَاذَا عَمِلْتَ فِي الدُّنْيَا - قَالَ وَلاَ يَكْتُمُونَ اللَّهَ حَدِيثًا - قَالَ يَا رَبِّ آتَيْتَنِي مَالَكَ فَكُنْتُ أُبَايِعُ النَّاسَ وَكَانَ مِنْ خُلُقِي الْجَوَازُ فَكُنْتُ أَتَيَسَّرُ عَلَى الْمُوسِرِ وَأُنْظِرُ الْمُعْسِرَ ‏.‏ فَقَالَ اللَّهُ أَنَا أَحَقُّ بِذَا مِنْكَ تَجَاوَزُوا عَنْ عَبْدِي ‏ ‏ ‏.‏ فَقَالَ عُقْبَةُ بْنُ عَامِرٍ الْجُهَنِيُّ وَأَبُو مَسْعُودٍ الأَنْصَارِيُّ هَكَذَا سَمِعْنَاهُ مِنْ فِي رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏"
      },
      {
        "id": 11561,
        "hadith_number": "3997",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Orang Kaya yang Mengampuni Orang yang Susah",
        "perawi_melayu": "Abu Mas'ud (رضی اﷲ عنہ) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: A person from people who lived before you was called to account (by Allah at the Day of Judgment) and no good was found in his account except this that lie being a rich man had (financial) dealings with people and had commanded his servants to show leniency to the straitened ones. Upon this Allah, the Exalted and Majestic, said: We have more right to this, so overlook (his faults).",
        "malay_translation": "Rasulullah (صلى الله عليه وسلم) bersabda: Seorang daripada umat sebelum kamu dihisab (oleh Allah pada Hari Kiamat) dan tiada kebaikan ditemui dalam catatannya kecuali dia seorang yang kaya yang mempunyai urusan (kewangan) dengan manusia dan telah memerintahkan pembantunya untuk memberikan kelonggaran kepada mereka yang dalam kesusahan. Maka Allah, Yang Maha Tinggi dan Maha Agung, berfirman: Kami lebih berhak terhadap perkara ini, maka ampunkanlah (kesalahannya).",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ - وَاللَّفْظُ لِيَحْيَى - قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ أَبِي مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ حُوسِبَ رَجُلٌ مِمَّنْ كَانَ قَبْلَكُمْ فَلَمْ يُوجَدْ لَهُ مِنَ الْخَيْرِ شَىْءٌ إِلاَّ أَنَّهُ كَانَ يُخَالِطُ النَّاسَ وَكَانَ مُوسِرًا فَكَانَ يَأْمُرُ غِلْمَانَهُ أَنْ يَتَجَاوَزُوا عَنِ الْمُعْسِرِ قَالَ قَالَ اللَّهُ عَزَّ وَجَلَّ نَحْنُ أَحَقُّ بِذَلِكَ مِنْهُ تَجَاوَزُوا عَنْهُ.‏"
      },
      {
        "id": 11562,
        "hadith_number": "3998",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kelebihan Memberi Kelonggaran kepada Peminjam yang Tidak Mampu",
        "perawi_melayu": "Abu Hurairah (رَضِيَ اللَّهُ عَنْهُ) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There was a person who gave loans to the people and said to his men: When an insolvent comes to you show him leniency that Allah may overlook our (faults). So when he met Allah, He overlooked his faults (forgave him).",
        "malay_translation": "Rasulullah (صلى الله عليه وسلم) bersabda: Ada seorang lelaki yang memberi pinjaman kepada orang ramai dan berkata kepada orang-orangnya: Apabila orang yang tidak mampu membayar datang kepada kamu, tunjukkanlah kelonggaran kepadanya supaya Allah memaafkan (kesalahan) kita. Maka apabila dia bertemu Allah, Allah memaafkan kesalahan-kesalahannya (mengampuninya).",
        "arabic_text": "حَدَّثَنَا مَنْصُورُ بْنُ أَبِي مُزَاحِمٍ، وَمُحَمَّدُ بْنُ جَعْفَرِ بْنِ زِيَادٍ، - قَالَ مَنْصُورٌ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ الزُّهْرِيِّ، وَقَالَ ابْنُ جَعْفَرٍ، أَخْبَرَنَا إِبْرَاهِيمُ، وَهُوَ ابْنُ سَعْدٍ عَنِ ابْنِ، شِهَابٍ عَنِ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ ‏ كَانَ رَجُلٌ يُدَايِنُ النَّاسَ فَكَانَ يَقُولُ لِفَتَاهُ إِذَا أَتَيْتَ مُعْسِرًا فَتَجَاوَزْ عَنْهُ لَعَلَّ اللَّهَ يَتَجَاوَزُ عَنَّا ‏.‏ فَلَقِيَ اللَّهَ فَتَجَاوَزَ عَنْهُ.‏"
      },
      {
        "id": 11563,
        "hadith_number": "3999",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keterangan daripada Abu Hurairah tentang Riwayat Serupa",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "Abu Hurairah رضی اللہ عنہ said: \"I heard the Messenger of Allah ﷺ say...: a similar report (as no. 3998).",
        "malay_translation": "Abu Hurairah رضي الله عنه berkata: \"Saya mendengar Rasulullah ﷺ bersabda...: suatu riwayat yang serupa (seperti no. 3998).",
        "arabic_text": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُبَيْدَ اللهِ بْنَ عَبْدِ اللهِ بْنِ عُتْبَةَ، حَدَّثَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ بِمِثْلِهِ."
      },
      {
        "id": 11564,
        "hadith_number": "4000",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kelebihan Memberi Tangguh atau Menggugurkan Hutang Orang yang Susah",
        "perawi_melayu": "Abdullah bin Abu Qatada meriwayatkan:",
        "english_text": "Abu Qatada (رضی اللہ عنہ) demanded (the payment of his debt) from his debtor but he disappeared; later on he found him and he said: I am hard up financially, whereupon he said: (Do you state it) by God? He said: By God. Upon this he (Qatada) said: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: He who loves that Allah saves him from the torments of the Day of Resurrection should give respite to the insolvent or remit (his debt).",
        "malay_translation": "Abu Qatada (رضي الله عنه) menuntut (pembayaran hutangnya) daripada orang yang berhutang dengannya, tetapi orang itu menghilangkan diri; kemudian dia menemuinya dan berkata: Saya mengalami kesukaran dari segi kewangan, lalu dia berkata: (Adakah kamu menyatakan) demi Allah? Dia berkata: Demi Allah. Kemudian dia (Qatada) berkata: Saya mendengar Rasulullah (صلى الله عليه وسلم) bersabda: Sesiapa yang suka Allah menyelamatkannya daripada azab pada Hari Kiamat hendaklah memberi tangguh kepada orang yang tidak mampu membayar hutang atau menggugurkan (hutangnya).",
        "arabic_text": "حَدَّثَنَا أَبُو الْهَيْثَمِ خَالِدُ بْنُ خِدَاشِ بْنِ عَجْلَانَ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللهِ بْنِ أَبِي قَتَادَةَ، أَنَّ أَبَا قَتَادَةَ، طَلَبَ غَرِيمًا لَهُ، فَتَوَارَى عَنْهُ ثُمَّ وَجَدَهُ، فَقَالَ: إِنِّي مُعْسِرٌ، فَقَالَ: آللَّهِ؟ قَالَ: آللَّهِ؟ قَالَ: فَإِنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «مَنْ سَرَّهُ أَنْ يُنْجِيَهُ اللهُ مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ، فَلْيُنَفِّسْ عَنْ مُعْسِرٍ، أَوْ يَضَعْ عَنْهُ»."
      },
      {
        "id": 11565,
        "hadith_number": "4001",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadith Sama Rantaian Sanad",
        "perawi_melayu": "Tiada maklumat",
        "english_text": "This hadith has been narrated on the authority of Ayyub with the same chain of transmitters.",
        "malay_translation": "Hadith ini telah diriwayatkan dari Ayyub dengan rantaian perawi yang sama.",
        "arabic_text": "وحَدَّثَنِيهِ أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي جَرِيرُ بْنُ حَازِمٍ، عَنْ أَيُّوبَ، بِهَذَا الْإِسْنَادِ نَحْوَهُ."
      },
      {
        "id": 11566,
        "hadith_number": "4002",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Penangguhan Hutang oleh Orang Kaya adalah Kezaliman",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Delay (in the payment of debt) on the part of a rich man is injustice, and when one of you is retired to a rich man, he should follow him.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Penangguhan (dalam pembayaran hutang) oleh orang kaya adalah kezaliman, dan apabila seseorang daripada kamu dirujuk kepada orang kaya, maka hendaklah dia mengikutinya.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَطْلُ الْغَنِيِّ ظُلْمٌ، وَإِذَا أُتْبِعَ أَحَدُكُمْ عَلَى مَلِيءٍ فَلْيَتْبَعْ»."
      },
      {
        "id": 11567,
        "hadith_number": "4003",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Riwayat Hadith Serupa Daripada Abu Hurairah (r.a.)",
        "perawi_melayu": "Tiada maklumat perawi",
        "english_text": "A hadith like this has been transmitted on the authority of Abu Huraira ( رضی اللہ عنہ).",
        "malay_translation": "Hadith seperti ini telah diriwayatkan daripada Abu Hurairah (r.a.).",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَا جَمِيعًا: حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ."
      },
      {
        "id": 11568,
        "hadith_number": "4004",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Menjual Air Berlebihan",
        "perawi_melayu": "Jabir bin 'Abdullah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade the sale of excess water.",
        "malay_translation": "Rasulullah (ﷺ) melarang penjualan air yang berlebihan.",
        "arabic_text": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، أَخْبَرَنَا وَكِيعٌ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، جَمِيعًا عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: «نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ فَضْلِ الْمَاءِ."
      },
      {
        "id": 11569,
        "hadith_number": "4005",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Menyewa Unta untuk Mengawinkan Unta Betina dan Menjual Air dan Tanah",
        "perawi_melayu": "Jabir bin 'Abdullah (رَضِيَ ٱللَّٰهُ عَنْهُ) meriwayatkan bahawa",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade the hiring of a Camel to cover a she-Camel and from selling water and land to be tilled. So from all this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade.",
        "malay_translation": "Rasulullah (ﷺ) melarang menyewa unta jantan untuk mengawini unta betina dan daripada menjual air dan tanah untuk diusahakan. Maka daripada semua ini, Rasulullah (ﷺ) melarangnya.",
        "arabic_text": "وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: «نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ ضِرَابِ الْجَمَلِ، وَعَنْ بَيْعِ الْمَاءِ وَالْأَرْضِ لِتُحْرَثَ»، فَعَنْ ذَلِكَ نَهَى النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 11570,
        "hadith_number": "4006",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Menahan Lebihan Air",
        "perawi_melayu": "Abu Hurairah (رضی اللہ عنہ) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Excess water must not be withheld so that the growth of herbage may be hindered.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: \"Air lebihan tidak boleh ditahan sehingga menghalang pertumbuhan tumbuhan.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، ح وحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا لَيْثٌ كِلَاهُمَا، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يُمْنَعُ فَضْلُ الْمَاءِ لِيُمْنَعَ بِهِ الْكَلَأُ»."
      },
      {
        "id": 11571,
        "hadith_number": "4007",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Menahan Air Berlebihan",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Do not withhold excess of water, so that you may prevent the growth of herbage.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Janganlah menahan lebihan air, supaya kamu tidak menghalang tumbuhnya tumbuhan.",
        "arabic_text": "وحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، وَاللَّفْظُ لِحَرْمَلَةَ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيِّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَمْنَعُوا فَضْلَ الْمَاءِ لِتَمْنَعُوا بِهِ الْكَلَأَ»."
      },
      {
        "id": 11572,
        "hadith_number": "4008",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Menjual Air Berlebihan untuk Membolehkan Jualan Rumput",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The excess of water should not be sold in order to enable the sate of herbage.",
        "malay_translation": "Rasulullah (صلى الله عليه وسلم) bersabda: \"Air yang berlebihan tidak boleh dijual untuk membolehkan jualan rumput (padang rumput).\"",
        "arabic_text": "وحَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِيُّ، حَدَّثَنَا أَبُو عَاصِمٍ الضَّحَّاكُ بْنُ مَخْلَدٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي زِيَادُ بْنُ سَعْدٍ، أَنَّ هِلَالَ بْنَ أُسَامَةَ، أَخْبَرَهُ، أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ، أَخْبَرَهُ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يُبَاعُ فَضْلُ الْمَاءِ لِيُبَاعَ بِهِ الْكَلَأُ»."
      },
      {
        "id": 11573,
        "hadith_number": "4009",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Menerima Bayaran Anjing, Pelacur, dan Pemberian kepada Kahin",
        "perawi_melayu": "Aba Mas'ud al-Ansari (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade the charging of price of the dog, and earnings of a prostitute and sweets offered to a kahin.",
        "malay_translation": "Rasulullah (صلى الله عليه وسلم) melarang menerima bayaran anjing, pendapatan pelacur, dan manisan yang diberikan kepada seorang kahin.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ ثَمَنِ الْكَلْبِ، وَمَهْرِ الْبَغِيِّ، وَحُلْوَانِ الْكَاهِنِ»."
      },
      {
        "id": 11574,
        "hadith_number": "4010",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadith Serupa Diriwayatkan Melalui Rantaian Perawi Lain",
        "perawi_melayu": "Tiada maklumat",
        "english_text": "A hadith like this is reported on the authority of Abu Mas'ud رضی اللہ عنہ through another chain of transmitters.",
        "malay_translation": "Hadith seperti ini diriwayatkan daripada Abu Mas'ud رضي الله عنه melalui rantaian perawi yang lain.",
        "arabic_text": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ رُمْحٍ، عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، كِلَاهُمَا عَنِ الزُّهْرِيِّ، بِهَذَا الْإِسْنَادِ مِثْلَهُ، وَفِي حَدِيثِ اللَّيْثِ، مِنْ رِوَايَةِ ابْنِ رُمْحٍ، أَنَّهُ سَمِعَ أَبَا مَسْعُودٍ."
      },
      {
        "id": 11575,
        "hadith_number": "4011",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pendapatan Paling Buruk",
        "perawi_melayu": "Rafi bin Khadij (رضي الله عنه) meriwayatkan:",
        "english_text": "I heard Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The worst earning is the earning of a prostitute, the price of a dog and the earning of a cupper.",
        "malay_translation": "Saya mendengar Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Pendapatan yang paling buruk adalah pendapatan pelacur, harga anjing, dan pendapatan tukang bekam.",
        "arabic_text": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، عَنْ مُحَمَّدِ بْنِ يُوسُفَ، قَالَ: سَمِعْتُ السَّائِبَ بْنَ يَزِيدَ، يُحَدِّثُ عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «شَرُّ الْكَسْبِ مَهْرُ الْبَغِيِّ، وَثَمَنُ الْكَلْبِ، وَكَسْبُ الْحَجَّامِ»."
      },
      {
        "id": 11576,
        "hadith_number": "4012",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Harga Anjing, Pendapatan Pelacur dan Tukang Bekam yang Buruk",
        "perawi_melayu": "Rafi bin Khadij رضي الله عنه meriwayatkan:",
        "english_text": "Allah'& Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The price of a dog is evil, the earning of a prostitute is evil and the earning of a cupper is evil.",
        "malay_translation": "Rasulullah ﷺ bersabda: Harga anjing itu buruk, pendapatan pelacur itu buruk, dan pendapatan tukang bekam itu buruk.",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنِ الْأَوْزَاعِيِّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، حَدَّثَنِي إِبْرَاهِيمُ بْنُ قَارِظٍ، عَنِ السَّائِبِ بْنِ يَزِيدَ، حَدَّثَنِي رَافِعُ بْنُ خَدِيجٍ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «ثَمَنُ الْكَلْبِ خَبِيثٌ، وَمَهْرُ الْبَغِيِّ خَبِيثٌ، وَكَسْبُ الْحَجَّامِ خَبِيثٌ»."
      },
      {
        "id": 11577,
        "hadith_number": "4013",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadith Serupa Melalui Sanad Lain",
        "perawi_melayu": "Tiada perawi dinyatakan.",
        "english_text": "A hadith like this has been narrated on the authority of Rafi' bin Khadij through another chain of transmitters.",
        "malay_translation": "Hadith seperti ini telah diriwayatkan daripada Rafi' bin Khadij melalui sanad perawi yang lain.",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، بِهَذَا الْإِسْنَادِ مِثْلَهُ."
      },
      {
        "id": 11578,
        "hadith_number": "4014",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Serupa Riwayat Rafi' bin Khadij",
        "perawi_melayu": "Tiada maklumat (Diriwayatkan melalui satu lagi rangkaian perawi)",
        "english_text": "A hadith like this has been narrated on the authority of Rafi' bin Khadij رضی اللہ عنہ through another chain of transmitters.",
        "malay_translation": "Hadis seperti ini telah diriwayatkan daripada Rafi' bin Khadij رضي الله عنه melalui satu lagi rangkaian perawi.",
        "arabic_text": "وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، حَدَّثَنِي إِبْرَاهِيمُ بْنُ عَبْدِ اللهِ، عَنِ السَّائِبِ بْنِ يَزِيدَ، حَدَّثَنَا رَافِعُ بْنُ خَدِيجٍ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ"
      },
      {
        "id": 11579,
        "hadith_number": "4015",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Menjual Anjing dan Kucing",
        "perawi_melayu": "Abu Zubair berkata:",
        "english_text": "I asked Jabir رضی اللہ عنہ about the price of a dog and a cat; he said: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) disapproved of that.",
        "malay_translation": "Saya bertanya kepada Jabir رضی اللہ عنہ tentang harga anjing dan kucing; beliau berkata: Rasulullah ﷺ tidak menyukai perkara itu.",
        "arabic_text": "حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ، قَالَ: سَأَلْتُ جَابِرًا، عَنْ ثَمَنِ الْكَلْبِ وَالسِّنَّوْرِ؟ قَالَ: «زَجَرَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ»."
      },
      {
        "id": 11580,
        "hadith_number": "4016",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perintah Rasulullah ﷺ untuk Membunuh Anjing",
        "perawi_melayu": "Ibn 'Umar (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) giving command for killing dogs.",
        "malay_translation": "Rasulullah ﷺ memberi perintah untuk membunuh anjing.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِقَتْلِ الْكِلَابِ»."
      },
      {
        "id": 11581,
        "hadith_number": "4017",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perintah Membunuh Anjing di Madinah",
        "perawi_melayu": "Ibn 'Umar ( رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) ordered to kill dogs, and he sent (men) to the corners of Medina that they should be killed.",
        "malay_translation": "Rasulullah (ﷺ) memerintahkan untuk membunuh anjing, dan Baginda menghantar (orang) ke sudut-sudut Madinah agar mereka dibunuh.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا عُبَيْدُ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: «أَمَرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِقَتْلِ الْكِلَابِ، فَأَرْسَلَ فِي أَقْطَارِ الْمَدِينَةِ أَنْ تُقْتَلَ»."
      },
      {
        "id": 11582,
        "hadith_number": "4018",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perintah Membunuh Anjing dan Pelaksanaannya",
        "perawi_melayu": "Abdullah (bin Umar) (رضی اللہ عنہ) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) ordered the killing of dogs and we would send (men) in Medina and its corners and we did not spare any dog that we did not kill, so much so that we killed the dog that accompanied the wet she-camel belonging to the people of the desert.",
        "malay_translation": "Rasulullah (ﷺ) memerintahkan pembunuhan anjing, dan kami mengutus (lelaki) ke Madinah dan sudut-sudutnya, dan kami tidak membiarkan seekor anjing pun yang tidak kami bunuh, sehinggakan kami membunuh anjing yang menemani unta betina yang menyusukan milik penduduk padang pasir.",
        "arabic_text": "وحَدَّثَنِي حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ الْمُفَضَّلِ، حَدَّثَنَا إِسْمَاعِيلُ وَهُوَ ابْنُ أُمَيَّةَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللهِ، قَالَ: «كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُ بِقَتْلِ الْكِلَابِ، فَنَنْبَعِثُ فِي الْمَدِينَةِ وَأَطْرَافِهَا فَلَا نَدَعُ كَلْبًا إِلَّا قَتَلْنَاهُ، حَتَّى إِنَّا لَنَقْتُلُ كَلْبَ الْمُرَيَّةِ مِنْ أَهْلِ الْبَادِيَةِ يَتْبَعُهَا»."
      },
      {
        "id": 11583,
        "hadith_number": "4019",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perintah Membunuh Anjing Kecuali yang Bermanfaat",
        "perawi_melayu": "Ibn Umar (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger (ﷺ) ordered the killing of dogs except the dog tamed for hunting, or watching of the herd of sheep or other domestic animals. It was said to Ibn Umar (رضی اللہ عنہ) that Abu Huraira (رضی اللہ عنہ) talks of (exception) about the dog for watching the field, whereupon he said: Since Abu Huraira (رضی اللہ عنہ) possessed land.",
        "malay_translation": "Rasulullah (ﷺ) memerintahkan pembunuhan anjing kecuali anjing yang dilatih untuk berburu, atau menjaga kawanan kambing atau haiwan ternakan lain. Dikatakan kepada Ibn Umar (رضي الله عنه) bahawa Abu Hurairah (رضي الله عنه) berbicara tentang (pengecualian) anjing untuk menjaga ladang, lalu beliau berkata: Kerana Abu Hurairah (رضي الله عنه) memiliki tanah.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِقَتْلِ الْكِلَابِ، إِلَّا كَلْبَ صَيْدٍ، أَوْ كَلْبَ غَنَمٍ، أَوْ مَاشِيَةٍ»، فَقِيلَ لِابْنِ عُمَرَ: إِنَّ أَبَا هُرَيْرَةَ يَقُولُ: «أَوْ كَلْبَ زَرْعٍ»، فَقَالَ ابْنُ عُمَرَ: «إِنَّ لِأَبِي هُرَيْرَةَ زَرْعًا."
      },
      {
        "id": 11584,
        "hadith_number": "4020",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perintah Membunuh Anjing, Kemudian Dibatalkan",
        "perawi_melayu": "Abu Zubair mendengar daripada Jabir bin 'Abdullah (رضي الله عنه)",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) ordered us to kill dogs, and we carried out this order so much so that we also kill the dog coming with a woman from the desert. Then Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade their killing. He (the Prophet further) said: It is your duty the jet-black (dog) having two spots (on the eyes), for it is a devil.",
        "malay_translation": "Rasulullah (صلى الله عليه وسلم) memerintahkan kami untuk membunuh anjing, dan kami melaksanakan perintah ini sehinggakan kami turut membunuh anjing yang datang bersama seorang wanita dari padang pasir. Kemudian Rasulullah (صلى الله عليه وسلم) melarang pembunuhan mereka. Baginda (Nabi) bersabda: Adalah menjadi kewajipan kamu (membunuh) anjing hitam legam yang mempunyai dua bintik (di mata), kerana ia adalah syaitan.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ، حَدَّثَنَا رَوْحٌ، ح وحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: أَمَرَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِقَتْلِ الْكِلَابِ، حَتَّى إِنَّ الْمَرْأَةَ تَقْدَمُ مِنَ الْبَادِيَةِ بِكَلْبِهَا فَنَقْتُلُهُ، ثُمَّ نَهَى النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ قَتْلِهَا، وَقَالَ: «عَلَيْكُمْ بِالْأَسْوَدِ الْبَهِيمِ ذِي النُّقْطَتَيْنِ، فَإِنَّهُ شَيْطَانٌ»."
      },
      {
        "id": 11585,
        "hadith_number": "4021",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perintah Membunuh Anjing dan Pengecualiannya",
        "perawi_melayu": "Ibn Mughaffal رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) ordered the killing of dogs and then said: what is the trouble with them (the people of Medina)? How dogs are nuisance to them (the citizens of Medina)? He then permitted keeping of dogs for hunting and (the protection of) herds.",
        "malay_translation": "Rasulullah ﷺ memerintahkan pembunuhan anjing, kemudian bersabda: \"Apakah masalah mereka (penduduk Madinah)? Mengapa anjing menjadi gangguan kepada mereka (penduduk Madinah)?\" Kemudian Baginda membenarkan pemeliharaan anjing untuk tujuan memburu dan menjaga ternakan.",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي التَّيَّاحِ، سَمِعَ مُطَرِّفَ بْنَ عَبْدِ اللهِ، عَنِ ابْنِ الْمُغَفَّلِ، قَالَ: أَمَرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِقَتْلِ الْكِلَابِ، ثُمَّ قَالَ: «مَا بَالُهُمْ وَبَالُ الْكِلَابِ؟»، ثُمَّ رَخَّصَ فِي كَلْبِ الصَّيْدِ، وَكَلْبِ الْغَنَمِ."
      },
      {
        "id": 11586,
        "hadith_number": "4022",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keringanan Mengenai Anjing untuk Mengawal Ternakan dan Memburu",
        "perawi_melayu": "Diriwayatkan daripada Syu'bah (hadis yang serupa dengan no. 4021, dengan rantai perawi yang berbeza) dengan rantai ini. Ibn Hatim berkata dalam hadisnya daripada Yahya:",
        "english_text": "He granted a concession with regard to dogs for herding sheep, Hunting and (guard dogs) in farm.",
        "malay_translation": "Baginda memberi keringanan berkenaan anjing untuk menggembalakan biri-biri, memburu dan (anjing pengawal) di ladang.",
        "arabic_text": "وحَدَّثَنِيهِ يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ الْوَلِيدِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا النَّضْرُ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، كُلُّهُمْ عَنْ شُعْبَةَ بِهَذَا الْإِسْنَادِ، وقَالَ ابْنُ حَاتِمٍ فِي حَدِيثِهِ: عَنْ يَحْيَى، وَرَخَّصَ فِي كَلْبِ الْغَنَمِ، وَالصَّيْدِ، وَالزَّرْعِ."
      },
      {
        "id": 11587,
        "hadith_number": "4023",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ganjaran Pahala Berkurang Akibat Memelihara Anjing",
        "perawi_melayu": "Daripada Ibn Umar (رَضِيَ ٱللَّٰهُ عَنْهُ)",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who keeps a dog other than that meant for watching the herd or for hunting loses every day out of his deeds equal to two qirat.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Sesiapa yang memelihara anjing selain daripada anjing untuk menjaga ternakan atau untuk berburu, maka setiap hari akan hilang pahala daripada amalannya sebanyak dua qirat.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اقْتَنَى كَلْبًا إِلَّا كَلْبَ مَاشِيَةٍ، أَوْ ضَارٍ، نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطَانِ»."
      },
      {
        "id": 11588,
        "hadith_number": "4024",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ganjaran Berkurangan Bagi Pemelihara Anjing",
        "perawi_melayu": "Salim meriwayatkan dari bapanya:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He who kept a dog other than one meant for hunting or for watching the herd, lost two qirat of his reward every day.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Sesiapa yang memelihara anjing selain untuk berburu atau menjaga ternakan, akan hilang pahala dua qirat setiap hari.",
        "arabic_text": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَابْنُ نُمَيْرٍ، قَالُوا: حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنِ اقْتَنَى كَلْبًا، إِلَّا كَلْبَ صَيْدٍ، أَوْ مَاشِيَةٍ، نَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطَانِ»."
      },
      {
        "id": 11589,
        "hadith_number": "4025",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ganjaran Amalan Terjejas Akibat Memelihara Anjing",
        "perawi_melayu": "Ibn 'Umar رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying He who kept a dog other than one meant for hunting or for watching the herd lost out of his deeds (equal to) two qirat every day.",
        "malay_translation": "Rasulullah ﷺ bersabda: “Sesiapa yang memelihara anjing selain daripada anjing untuk berburu atau menjaga ternakan, maka berkuranganlah daripada pahala amalannya (bersamaan) dua qirat setiap hari.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ حُجْرٍ، قَالَ يَحْيَى بْنُ يَحْيَى: أَخْبَرَنَا، وَقَالَ الْآخَرُونَ: حَدَّثَنَا إِسْمَاعِيلُ وَهُوَ ابْنُ جَعْفَرٍ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، أَنَّهُ سَمِعَ ابْنَ عُمَرَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اقْتَنَى كَلْبًا، إِلَّا كَلْبَ ضَارِيَةٍ، أَوْ مَاشِيَةٍ، نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطَانِ»."
      },
      {
        "id": 11590,
        "hadith_number": "4026",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kehilangan Pahala Bagi Pelihara Anjing Kecuali Tujuan Tertentu",
        "perawi_melayu": "Salim bin 'Abdullah meriwayatkan daripada bapanya",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He who kept a dog other than one meant for watching the herd or for hunting would lose every day two qirat of his good deeds. 'Abdullah رضی اللہ عنہ and Abu Huraira رضی اللہ عنہ also said: Or dog meant for watching the field.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: \"Sesiapa yang memelihara anjing selain daripada anjing untuk menjaga ternakan atau untuk berburu, akan hilang daripada pahala amalnya setiap hari sebanyak dua qirat.\" Abdullah رضي الله عنه dan Abu Hurairah رضي الله عنه juga berkata: \"Atau anjing yang digunakan untuk menjaga ladang.\"",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ حُجْرٍ، قَالَ يَحْيَى: أَخْبَرَنَا، وَقَالَ الْآخَرُونَ: حَدَّثَنَا إِسْمَاعِيلُ، عَنْ مُحَمَّدٍ وَهُوَ ابْنُ أَبِي حَرْمَلَةَ، عَنْ سَالِمِ بْنِ عَبْدِ اللهِ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنِ اقْتَنَى كَلْبًا، إِلَّا كَلْبَ مَاشِيَةٍ، أَوْ كَلْبَ صَيْدٍ، نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطٌ»، قَالَ عَبْدُ اللهِ، وَقَالَ أَبُو هُرَيْرَةَ: «أَوْ كَلْبَ حَرْثٍ»."
      },
      {
        "id": 11591,
        "hadith_number": "4027",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kehilangan Pahala Memelihara Anjing",
        "perawi_melayu": "Salim meriwayatkan dari bapanya (رضي الله عنه):",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He who kept a dog other than one meant for hunting or for the protection of the herd would lose two qirat of his deeds every day. Salim said: Abu Huraira ( رضی اللہ عنہ) used to say: Or the dog meant for watching the field, and he was the owner of the land.",
        "malay_translation": "Rasulullah (صلى الله عليه وسلم) bersabda: Sesiapa yang memelihara anjing selain daripada anjing untuk berburu atau menjaga ternakan, akan hilang dua qirat daripada amalnya setiap hari. Salim berkata: Abu Hurairah (رضي الله عنه) selalu berkata: Atau anjing yang bertujuan untuk menjaga ladang, dan dia adalah pemilik tanah.",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا وَكِيعٌ، حَدَّثَنَا حَنْظَلَةُ بْنُ أَبِي سُفْيَانَ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنِ اقْتَنَى كَلْبًا، إِلَّا كَلْبَ ضَارٍ، أَوْ مَاشِيَةٍ، نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطَانِ»، قَالَ سَالِمٌ: وَكَانَ أَبُو هُرَيْرَةَ يَقُولُ: «أَوْ كَلْبَ حَرْثٍ»، وَكَانَ صَاحِبَ حَرْثٍ."
      },
      {
        "id": 11592,
        "hadith_number": "4028",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ancaman Kehilangan Pahala Memelihara Anjing di Rumah",
        "perawi_melayu": "Salim bin Abdullah meriwayatkan daripada bapanya:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Whoseover amongst the owners of the house keeps a dog other than one meant for watching the herd or for hunting loses two qirat of his deeds every day.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Sesiapa sahaja di kalangan pemilik rumah yang memelihara anjing selain daripada anjing untuk menjaga ternakan atau untuk berburu, akan hilang dua qirat daripada amalan-amalannya setiap hari.",
        "arabic_text": "حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، أَخْبَرَنَا عُمَرُ بْنُ حَمْزَةَ بْنِ عَبْدِ اللهِ بْنِ عُمَرَ، حَدَّثَنَا سَالِمُ بْنُ عَبْدِ اللهِ، عَنْ أَبِيهِ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَيُّمَا أَهْلِ دَارٍ اتَّخَذُوا كَلْبًا، إِلَّا كَلْبَ مَاشِيَةٍ، أَوْ كَلْبَ صَائِدٍ، نَقَصَ مِنْ عَمَلِهِمْ كُلَّ يَوْمٍ قِيرَاطَانِ."
      },
      {
        "id": 11593,
        "hadith_number": "4029",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ganjaran Berkurang Bagi Memelihara Anjing",
        "perawi_melayu": "Ibn Umar (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who kept a dog ther than one meant for watching the fields or herds or hunting would lose one qirat every day out of his reward (with God).",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم‌) bersabda: Sesiapa yang memelihara anjing selain daripada anjing untuk menjaga ladang, ternakan atau untuk berburu, maka pahalanya akan berkurang satu qirat setiap hari.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، وَاللَّفْظُ لِابْنِ الْمُثَنَّى، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَبِي الْحَكَمِ، قَالَ: سَمِعْتُ ابْنَ عُمَرَ، يُحَدِّثُ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنِ اتَّخَذَ كَلْبًا، إِلَّا كَلْبَ زَرْعٍ، أَوْ غَنَمٍ، أَوْ صَيْدٍ، يَنْقُصُ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطٌ."
      },
      {
        "id": 11594,
        "hadith_number": "4030",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ganjaran Berkurangan Bagi Mereka yang Memelihara Anjing (Kecuali untuk Tujuan Tertentu)",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who kept a dog which is neither meant for hunting nor for watching the animals nor for watching the fields would lose two qirat every day out of his reward; and there is no mention of the fields in the hadith transmitted by Abu Tahir.",
        "malay_translation": "Rasulullah ﷺ bersabda: Sesiapa yang memelihara anjing yang bukan untuk tujuan memburu, menjaga ternakan, atau menjaga ladang, akan hilang dua qirat pahala setiap hari; dan tiada disebut tentang ladang dalam hadis yang diriwayatkan oleh Abu Tahir.",
        "arabic_text": "وحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنِ اقْتَنَى كَلْبًا، لَيْسَ بِكَلْبِ صَيْدٍ، وَلَا مَاشِيَةٍ، وَلَا أَرْضٍ، فَإِنَّهُ يَنْقُصُ مِنْ أَجْرِهِ قِيرَاطَانِ كُلَّ يَوْمٍ»، وَلَيْسَ فِي حَدِيثِ أَبِي الطَّاهِرِ: وَلَا أَرْضٍ."
      },
      {
        "id": 11595,
        "hadith_number": "4031",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukuman bagi Memelihara Anjing Selain Keperluan",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who kept a dog except one meant for watching the herd, or for hunting or for watching the fields. he lost two qirat of reward every day. Zuhri said: The words of Abu Huraira (رضی اللہ عنہ) were conveyed to Ibn Umar رضی اللہ عنہ who said: May Allah have mercy upon Abu Huraira رضی اللہ عنہ ; he owned a field.",
        "malay_translation": "Rasulullah ﷺ bersabda: \"Sesiapa yang memelihara anjing selain daripada anjing untuk menjaga ternakan, atau untuk berburu, atau untuk menjaga ladang, maka pahalanya akan berkurangan sebanyak dua qirat setiap hari.\" Az-Zuhri berkata: Kata-kata Abu Hurairah (رضي الله عنه) disampaikan kepada Ibnu Umar (رضي الله عنه), lalu beliau berkata: Semoga Allah merahmati Abu Hurairah (رضي الله عنه); beliau memiliki ladang.",
        "arabic_text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اتَّخَذَ كَلْبًا إِلَّا كَلْبَ مَاشِيَةٍ، أَوْ صَيْدٍ، أَوْ زَرْعٍ، انْتَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطٌ»، قَالَ الزُّهْرِيُّ: فَذُكِرَ لِابْنِ عُمَرَ قَوْلُ أَبِي هُرَيْرَةَ، فَقَالَ: «يَرْحَمُ اللهُ أَبَا هُرَيْرَةَ كَانَ صَاحِبَ زَرْعٍ»."
      },
      {
        "id": 11596,
        "hadith_number": "4032",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ganjaran Amalan Terjejas Disebabkan Memelihara Anjing",
        "perawi_melayu": "Abu Hurairah ( رضي الله عنه ) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who kept a dog would lose out of his deeds equal to one qirat every day. except (one kept) for watching the field or herd.",
        "malay_translation": "Rasulullah ( صلى الله عليه وسلم ) bersabda: Sesiapa yang memelihara anjing akan terjejas daripada amalan kebajikannya sebanyak satu qirat setiap hari, kecuali (anjing) untuk menjaga ladang atau ternakan.",
        "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامٌ الدَّسْتَوَائِيُّ، حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَمْسَكَ كَلْبًا، فَإِنَّهُ يَنْقُصُ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطٌ، إِلَّا كَلْبَ حَرْثٍ، أَوْ مَاشِيَةٍ»."
      },
      {
        "id": 11597,
        "hadith_number": "4033",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Riwayat Hadith Serupa Daripada Abu Hurairah",
        "perawi_melayu": "Tidak dinyatakan (Riwayat melalui Abu Hurairah)",
        "english_text": "A hadith like this has been transmitted on the authority of Abu Huraira رضی اللہ عنہ .",
        "malay_translation": "Hadith seperti ini telah diriwayatkan daripada Abu Hurairah رضي الله عنه.",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا شُعَيْبُ بْنُ إِسْحَاقَ، حَدَّثَنَا الْأَوْزَاعِيُّ، حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، حَدَّثَنِي أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ."
      },
      {
        "id": 11598,
        "hadith_number": "4034",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Riwayat Hadis Melalui Rangkaian Perawi yang Sama",
        "perawi_melayu": "Tiada maklumat",
        "english_text": "This hadith has been reported on the authority of Yahya bin Abu Kathir with the same chain of transmitters.",
        "malay_translation": "Hadis ini telah diriwayatkan daripada Yahya bin Abu Kathir dengan rangkaian perawi yang sama.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ الْمُنْذِرِ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا حَرْبٌ، حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، بِهَذَا الْإِسْنَادِ مِثْلَهُ."
      },
      {
        "id": 11599,
        "hadith_number": "4035",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pengurangan Pahala Memelihara Anjing",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: He who kept a dog, but not meant for hunting or watching the herd, would lose one qirat of reward every day.",
        "malay_translation": "Rasulullah (صلى الله عليه وسلم) bersabda: Sesiapa yang memelihara anjing, tetapi bukan untuk tujuan memburu atau menjaga ternakan, akan berkurangan pahala sebanyak satu qirat setiap hari.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ يَعْنِي ابْنَ زِيَادٍ، عَنْ إِسْمَاعِيلَ بْنِ سُمَيْعٍ، حَدَّثَنَا أَبُو رَزِينٍ، قَالَ: سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اتَّخَذَ كَلْبًا، لَيْسَ بِكَلْبِ صَيْدٍ، وَلَا غَنَمٍ، نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطٌ»."
      },
      {
        "id": 11600,
        "hadith_number": "4036",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ganjaran Amalan Berkurangan Bagi Mereka yang Memelihara Anjing",
        "perawi_melayu": "Sufyan bin Abu Zuhair (beliau adalah seorang dari suku Shanu'a dan merupakan kalangan Sahabat Rasulullah (ﷺ) berkata:",
        "english_text": "I heard Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who kept a dog (other than that) which is indispensable for watching the field or the animals would lose one qirat out of his deeds every day. As-Sa'ib bin Yazid (one of the narrators) said: Did you hear it from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌)? He said: Yes. by the Lord of this mosque.",
        "malay_translation": "Saya mendengar Rasulullah (ﷺ) bersabda: \"Sesiapa yang memelihara anjing (selain daripada yang diperlukan untuk menjaga ladang atau haiwan ternakan) akan kehilangan satu qirat daripada amalannya setiap hari.\" As-Sa'ib bin Yazid (salah seorang perawi) berkata: \"Adakah kamu mendengarnya daripada Rasulullah (ﷺ)?\" Beliau menjawab: \"Ya, demi Tuhan masjid ini.\"",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ يَزِيدَ بْنِ خُصَيْفَةَ، أَنَّ السَّائِبَ بْنَ يَزِيدَ، أَخْبَرَهُ أَنَّهُ سَمِعَ سُفْيَانَ بْنَ أَبِي زُهَيْرٍ - وَهُوَ رَجُلٌ مِنْ شَنُوءَةَ، مِنْ أَصْحَابِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ -، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «مَنِ اقْتَنَى كَلْبًا، لَا يُغْنِي عَنْهُ زَرْعًا، وَلَا ضَرْعًا، نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطٌ»، قَالَ: آنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: إِي وَرَبِّ هَذَا الْمَسْجِدِ."
      },
      {
        "id": 11601,
        "hadith_number": "4037",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Riwayat Sufyan bin Abu Zuhair al-Shana'i",
        "perawi_melayu": "Sufyan bin Abu Zuhair al-Shana'i",
        "english_text": "This hadith has been narrated on the authority of Sufyan bin Abu Zuhair al-Shana'i.",
        "malay_translation": "Hadis ini telah diriwayatkan daripada Sufyan bin Abu Zuhair al-Shana'i.",
        "arabic_text": "دَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ حُجْرٍ، قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ، عَنْ يَزِيدَ بْنِ خُصَيْفَةَ، أَخْبَرَنِي السَّائِبُ بْنُ يَزِيدَ، أَنَّهُ وَفَدَ عَلَيْهِمْ سُفْيَانُ بْنُ أَبِي زُهَيْرٍ الشَّنَئِيُّ، فَقَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ."
      },
      {
        "id": 11602,
        "hadith_number": "4038",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Nabi ﷺ Mendapatkan Bekam dan Ganjaran kepada Tukang Bekam",
        "perawi_melayu": "Diriwayatkan daripada Humaid:",
        "english_text": "Anas bin Malik رضی اللہ عنہ was asked about the earnings of the cupper. He said: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) got himself cupped. His cupper was Abu Taiba and he (the Holy Prophet) commanded to give him two sa's of corn. He (the Holy Prophet) talked with the members of his family and they lightened the burden of Kharaj (tax) from him (i. e. they made remission in the charges of their own accord). He (Allah's Apostle) said: The best (treatment) which you take is cupping, or it is the best of your treatments.",
        "malay_translation": "Anas bin Malik رضي الله عنه ditanya tentang pendapatan tukang bekam. Beliau berkata: Rasulullah ﷺ mendapatkan bekam. Tukang bekam Baginda ialah Abu Taiba dan Baginda (Nabi) memerintah supaya memberikan dua sa' gandum kepadanya. Baginda (Nabi) berbincang dengan ahli keluarganya dan mereka meringankan beban Kharaj (cukai) daripadanya (iaitu mereka membuat pengurangan dalam bayaran atas kemahuan mereka sendiri). Baginda (Rasulullah) bersabda: Rawatan terbaik yang kamu ambil ialah bekam, atau ia adalah rawatan terbaik kamu.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ، قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ يَعْنُونَ ابْنَ جَعْفَرٍ، عَنْ حُمَيْدٍ، قَالَ: سُئِلَ أَنَسُ بْنُ مَالِكٍ، عَنْ كَسْبِ الْحَجَّامِ؟ فَقَالَ: احْتَجَمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، حَجَمَهُ أَبُو طَيْبَةَ، فَأَمَرَ لَهُ بِصَاعَيْنِ مِنْ طَعَامٍ، وَكَلَّمَ أَهْلَهُ، فَوَضَعُوا عَنْهُ مِنْ خَرَاجِهِ، وَقَالَ: «إِنَّ أَفْضَلَ مَا تَدَاوَيْتُمْ بِهِ الْحِجَامَةُ»، أَوْ «هُوَ مِنْ أَمْثَلِ دَوَائِكُمْ»."
      },
      {
        "id": 11603,
        "hadith_number": "4039",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kaedah Perubatan Terbaik dan Larangan Menyiksa Anak-anak",
        "perawi_melayu": "Rumaid meriwayatkan bahawa Anas bin Malik (رضی اللہ عنہ) telah bertanya tentang pendapatan seorang tukang bekam. Kemudian (hadis yang disebutkan di atas diriwayatkan tetapi dengan tambahan ini) bahawa dia berkata:",
        "english_text": "The best treatment which you get is cupping or aloeswood and do not torture your children by pressing their uvula.",
        "malay_translation": "Rawatan terbaik yang anda perolehi adalah bekam atau kayu gaharu dan jangan seksa anak-anak anda dengan menekan uvula mereka.",
        "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا مَرْوَانُ يَعْنِي الْفَزَارِيَّ، عَنْ حُمَيْدٍ، قَالَ: سُئِلَ أَنَسٌ عَنْ كَسْبِ الْحَجَّامِ؟ فَذَكَرَ بِمِثْلِهِ، غَيْرَ أَنَّهُ، قَالَ: «إِنَّ أَفْضَلَ مَا تَدَاوَيْتُمْ بِهِ الْحِجَامَةُ، وَالْقُسْطُ الْبَحْرِيُّ، وَلَا تُعَذِّبُوا صِبْيَانَكُمْ بِالْغَمْزِ»."
      },
      {
        "id": 11604,
        "hadith_number": "4040",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah ﷺ Memerintahkan Pembayaran untuk Bekam",
        "perawi_melayu": "Humaid meriwayatkan daripada Anas (رضي الله عنه)",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) called for young cupper belonging to us. He capped him and he (the Holy Prophet ﷺ) commanded that he should be paid one sa' or one mudd or two mudds (of wheat). It was said (that charges were high) and a reduction was made in the charges.",
        "malay_translation": "Rasulullah ﷺ memanggil tukang bekam muda dari kalangan kami. Baginda membekamnya, dan baginda (Nabi Suci ﷺ) memerintahkan supaya dia dibayar satu sa' atau satu mudd atau dua mudd (gandum). Dikatakan (bahawa bayarannya tinggi) dan pengurangan telah dibuat dalam bayaran tersebut.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ الْحَسَنِ بْنِ خِرَاشٍ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا شُعْبَةُ، عَنْ حُمَيْدٍ، قَالَ: سَمِعْتُ أَنَسًا، يَقُولُ: «دَعَا النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ غُلَامًا لَنَا حَجَّامًا، فَحَجَمَهُ، فَأَمَرَ لَهُ بِصَاعٍ، أَوْ مُدٍّ، أَوْ مُدَّيْنِ، وَكَلَّمَ فِيهِ، فَخُفِّفَ عَنْ ضَرِيبَتِهِ»."
      },
      {
        "id": 11605,
        "hadith_number": "4041",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah ﷺ Berbekam dan Membayar Upah",
        "perawi_melayu": "Ibn Abbas (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) got himself cupped and he paid the clipper his charges and he put medicine in his nostrils.",
        "malay_translation": "Rasulullah ﷺ berbekam dan baginda membayar upah kepada tukang bekam serta meletakkan ubat di dalam hidung baginda.",
        "arabic_text": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الْمَخْزُومِيُّ، كِلَاهُمَا عَنْ وُهَيْبٍ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، «أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ، وَأَعْطَى الْحَجَّامَ أَجْرَهُ، وَاسْتَعَطَ»."
      },
      {
        "id": 11606,
        "hadith_number": "4042",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Upah Hamba Banu Bayada dan Pengurangan Caj",
        "perawi_melayu": "Ibnu Abbas (رضي الله عنه) meriwayatkan:",
        "english_text": "The slave of Banu Bayada cupped Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he gave him his wages, and talked to his master and he reduced the charges, and if this earning was unlawful Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) would not have given it.",
        "malay_translation": "Hamba kepada Banu Bayada membekam Rasulullah (ﷺ) dan baginda memberikan upahnya. Baginda juga berbincang dengan tuannya dan tuannya mengurangkan caj. Sekiranya pendapatan ini haram, Rasulullah (ﷺ) tidak akan memberikan upahnya.",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، وَاللَّفْظُ لِعَبْدٍ، قَالَا: أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ عَاصِمٍ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: «حَجَمَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَبْدٌ لِبَنِي بَيَاضَةَ، فَأَعْطَاهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَجْرَهُ، وَكَلَّمَ سَيِّدَهُ فَخَفَّفَ عَنْهُ مِنْ ضَرِيبَتِهِ، وَلَوْ كَانَ سُحْتًا لَمْ يُعْطِهِ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ»."
      },
      {
        "id": 11607,
        "hadith_number": "4043",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pengharaman Arak: Arahan Rasulullah SAW",
        "perawi_melayu": "Abu Sa'id al-Khudri (رضی اللہ عنہ) meriwayatkan:",
        "english_text": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) addressing in Medina. He said: O people, Allah is giving an indication (of the prohibition) of wine. and He is probably soon going to give an order about it. So he who has anything of it with him should sell that, and derive benefit out of it. He (the narrator) said: We waited for some time that Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Verily Allah, the Exalted, has forbidden wine. So who hears this verse and he has anything of it with him, he should neither drink it nor sell it. He (the narrator) said: The people then brought whatever they had of it with them on the streets of Medina and spilt that.",
        "malay_translation": "Saya mendengar Rasulullah ﷺ berkhutbah di Madinah. Baginda bersabda: Wahai manusia, Allah sedang memberi isyarat (larangan) terhadap arak. Dan Dia mungkin akan segera mengeluarkan perintah mengenainya. Maka sesiapa yang mempunyai sebarang daripadanya, hendaklah dia menjualnya dan mendapat manfaat daripadanya. Perawi berkata: Kami menunggu seketika sehingga Rasulullah ﷺ bersabda: Sesungguhnya Allah, Maha Tinggi, telah mengharamkan arak. Maka sesiapa yang mendengar ayat ini dan dia mempunyai sebarang arak, dia tidak boleh meminumnya mahupun menjualnya. Perawi berkata: Kemudian orang ramai membawa apa sahaja yang mereka miliki di jalan-jalan Madinah dan menumpahkannya.",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ عَبْدِ الْأَعْلَى أَبُو هَمَّامٍ، حَدَّثَنَا سَعِيدٌ الْجُرَيْرِيُّ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ بِالْمَدِينَةِ، قَالَ: «يَا أَيُّهَا النَّاسُ، إِنَّ اللهَ تَعَالَى يُعَرِّضُ بِالْخَمْرِ، وَلَعَلَّ اللهَ سَيُنْزِلُ فِيهَا أَمْرًا، فَمَنْ كَانَ عِنْدَهُ مِنْهَا شَيْءٌ فَلْيَبِعْهُ وَلْيَنْتَفِعْ بِهِ»، قَالَ: فَمَا لَبِثْنَا إِلَّا يَسِيرًا حَتَّى قَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللهَ تَعَالَى حَرَّمَ الْخَمْرَ، فَمَنْ أَدْرَكَتْهُ هَذِهِ الْآيَةُ وَعِنْدَهُ مِنْهَا شَيْءٌ فَلَا يَشْرَبْ، وَلَا يَبِعْ»، قَالَ: فَاسْتَقْبَلَ النَّاسُ بِمَا كَانَ عِنْدَهُ مِنْهَا فِي طَرِيقِ الْمَدِينَةِ فَسَفَكُوهَ."
      },
      {
        "id": 11608,
        "hadith_number": "4044",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Haramnya Menjual Arak yang Diperbuat Daripada Anggur",
        "perawi_melayu": "Abdul-Rahman bin Wa'ala as-Saba'i (yang berasal dari Mesir) bertanya:",
        "english_text": "'Abdullah bin Abbas (رضی اللہ عنہ) about that which is extracted from the grapes, whereupon he said: A person presented to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) a small water-skin of wine. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to him: Do you know that Allah has forbidden it? He said: No. He then whispered to another man. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) asked him what he had whispered. He said: I advised him to sell that, whereupon he (the Holy Prophet ﷺ) said: Verily He Who has forbidden its drinking has forbidden its sale also. He (the narrator) said: He opened the water skin until what was contained in it was spilt.",
        "malay_translation": "Daripada Abdullah bin Abbas (رَضِيَ ٱللَّٰهُ عَنْهُمَا) berkenaan perkara yang diperolehi daripada anggur, lalu beliau berkata: Seseorang telah menghadiahkan kepada Rasulullah (صلى الله عليه وسلم) sebotol kecil arak. Rasulullah (صلى الله عليه وسلم) bertanya kepadanya: Adakah kamu tahu bahawa Allah telah mengharamkannya? Dia menjawab: Tidak. Kemudian dia berbisik kepada seorang lelaki lain. Rasulullah (صلى الله عليه وسلم) bertanya kepadanya apa yang telah dia bisikkan. Dia menjawab: Saya menasihatinya untuk menjualnya, lalu baginda (Nabi ﷺ) bersabda: Sesungguhnya Dia yang mengharamkan meminumnya, telah mengharamkan juga menjualnya. (Perawi) berkata: Baginda membuka botol tersebut sehingga isinya tertumpah.",
        "arabic_text": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا حَفْصُ بْنُ مَيْسَرَةَ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ وَعْلَةَ - رَجُلٌ مِنْ أَهْلِ مِصْرَ - أَنَّهُ جَاءَ عَبْدَ اللهِ بْنَ عَبَّاسٍ، ح وحَدَّثَنَا أَبُو الطَّاهِرِ، وَاللَّفْظُ لَهُ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ، وَغَيْرُهُ عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ وَعْلَةَ السَّبَإِيِّ، مِنْ أَهْلِ مِصْرَ، أَنَّهُ سَأَلَ عَبْدَ اللهِ بْنَ عَبَّاسٍ، عَمَّا يُعْصَرُ مِنَ الْعِنَبِ، فَقَالَ ابْنُ عَبَّاسٍ: إِنَّ رَجُلًا أَهْدَى لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَاوِيَةَ خَمْرٍ، فَقَالَ لَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «هَلْ عَلِمْتَ أَنَّ اللهَ قَدْ حَرَّمَهَا؟» قَالَ: لَا، فَسَارَّ إِنْسَانًا، فَقَالَ لَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «بِمَ سَارَرْتَهُ؟»، فَقَالَ: أَمَرْتُهُ بِبَيْعِهَا، فَقَالَ: «إِنَّ الَّذِي حَرَّمَ شُرْبَهَا حَرَّمَ بَيْعَهَا»، قَالَ: فَفَتَحَ الْمَزَادَةَ حَتَّى ذَهَبَ مَا فِيهَا."
      },
      {
        "id": 11609,
        "hadith_number": "4045",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Riwayat Abdul-Rahman bin Wa'ala daripada Abdullah bin Abbas",
        "perawi_melayu": "Abdul-Rahman bin Wa'ala meriwayatkan hadis ini daripada 'Abdullah bin Abbas رضی اللہ عنہ.",
        "english_text": "Abdul-Rahman bin Wa'ala narrated this on the authority of 'Abdullah bin Abbas رضی اللہ عنہ .",
        "malay_translation": "Abdul-Rahman bin Wa'ala meriwayatkan hadis ini daripada 'Abdullah bin Abbas (semoga Allah meredhainya).",
        "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي سُلَيْمَانُ بْنُ بِلَالٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ وَعْلَةَ، عَنْ عَبْدِ اللهِ بْنِ عَبَّاسٍ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ."
      },
      {
        "id": 11610,
        "hadith_number": "4046",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Berdagang Arak Selepas Ayat Terakhir Surah Al-Baqarah",
        "perawi_melayu": "A'isha (رضي الله عنها) meriwayatkan:",
        "english_text": "When the concluding verses of Sura Baqara were revealed, Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) went out and read them out to the people and then forbade them to trade in wine.",
        "malay_translation": "Ketika ayat-ayat terakhir Surah Al-Baqarah diturunkan, Rasulullah ﷺ keluar dan membacakannya kepada orang ramai, kemudian baginda melarang mereka daripada berdagang arak.",
        "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ قَالَ زُهَيْرٌ: حَدَّثَنَا، وَقَالَ إِسْحَاقُ: أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ: «لَمَّا نَزَلَتِ الْآيَاتُ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ، خَرَجَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَاقْتَرَأَهُنَّ عَلَى النَّاسِ، ثُمَّ نَهَى عَنِ التِّجَارَةِ فِي الْخَمْرِ»."
      },
      {
        "id": 11611,
        "hadith_number": "4047",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Nabi ﷺ Terhadap Perdagangan Arak Selepas Ayat Riba Diturunkan",
        "perawi_melayu": "A'ishah (رضي الله عنها) meriwayatkan:",
        "english_text": "When the concluding verses of Sura Baqara pertaining to Riba were revealed, Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) went out to the mosque and he forbade the trade in wine.",
        "malay_translation": "Ketika ayat-ayat terakhir Surah Al-Baqarah yang berkaitan dengan Riba diturunkan, Rasulullah ﷺ keluar ke masjid dan baginda melarang perdagangan arak.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَاللَّفْظُ لِأَبِي كُرَيْبٍ، قَالَ إِسْحَاقُ: أَخْبَرَنَا، وَقَالَ الْآخَرَانِ: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ: «لَمَّا أُنْزِلَتِ الْآيَاتُ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ فِي الرِّبَا»، قَالَتْ: «خَرَجَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِلَى الْمَسْجِدِ فَحَرَّمَ التِّجَارَةَ فِي الْخَمْرِ."
      },
      {
        "id": 11612,
        "hadith_number": "4048",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pengharaman Jual Beli Arak, Bangkai, Khinzir, dan Berhala",
        "perawi_melayu": "Jabir bin 'Abdullah (رَضِيَ ٱللَّٰهُ عَنْهُ) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying in the Year of Victory while he was in Mecca: Verily Allah and His Messenger have forbidden the sale of wine, carcass, swine and idols, It was said: Allah's Messenger, you see that the fat of the carcass is used for coating the boats and varnishing the hides and people use it for lighting purposes, whereupon he said: No, it is forbidden, Then Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: May Allah the Exalted and Majestic destroy the Jews; when Allah forbade the use of fat of the carcass for them, they melted it, and then sold it and made use of its price (received from it).",
        "malay_translation": "Rasulullah (ﷺ) bersabda pada Tahun Pembukaan Kota Mekah: Sesungguhnya Allah dan Rasul-Nya telah mengharamkan jual beli arak, bangkai, khinzir dan berhala. Dikatakan: Wahai Rasulullah, sesungguhnya lemak bangkai digunakan untuk menyaluti kapal dan mengilat kulit, dan manusia menggunakannya untuk tujuan pencahayaan, maka baginda bersabda: Tidak, ia haram. Kemudian Rasulullah (ﷺ) bersabda: Semoga Allah Yang Maha Tinggi lagi Maha Agung membinasakan orang-orang Yahudi; apabila Allah mengharamkan penggunaan lemak bangkai ke atas mereka, mereka meleburnya, kemudian menjualnya dan memanfaatkan harganya (yang diterima daripadanya).",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، أَنَّهُ سَمِعَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ عَامَ الْفَتْحِ وَهُوَ بِمَكَّةَ: «إِنَّ اللهَ وَرَسُولَهُ حَرَّمَ بَيْعَ الْخَمْرِ، وَالْمَيْتَةِ، وَالْخِنْزِيرِ، وَالْأَصْنَامِ»، فَقِيلَ: يَا رَسُولَ اللهِ، أَرَأَيْتَ شُحُومَ الْمَيْتَةِ، فَإِنَّهُ يُطْلَى بِهَا السُّفُنُ، وَيُدْهَنُ بِهَا الْجُلُودُ، وَيَسْتَصْبِحُ بِهَا النَّاسُ، فَقَالَ: «لَا، هُوَ حَرَامٌ»، ثُمَّ قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عِنْدَ ذَلِكَ: «قَاتَلَ اللهُ الْيَهُودَ، إِنَّ اللهَ عَزَّ وَجَلَّ لَمَّا حَرَّمَ عَلَيْهِمْ شُحُومَهَا أَجْمَلُوهُ، ثُمَّ بَاعُوهُ فَأَكَلُوا ثَمَنَهُ»."
      },
      {
        "id": 11613,
        "hadith_number": "4049",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Jabir Mendengar Hadith Rasulullah (ﷺ) pada Tahun Kemenangan",
        "perawi_melayu": "Yazid bin Abu Habib رضی اللہ عنہ meriwayatkan:",
        "english_text": "'Ata' reported to me that he heard Jabir (bin 'Abdullah رضی اللہ عنہ) saying it that he had heard that from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in the Year of Victory.",
        "malay_translation": "'Ata' meriwayatkan kepada saya bahawa dia mendengar Jabir (bin 'Abdullah رضی اللہ عنہ) berkata bahawa dia telah mendengar daripada Rasulullah (ﷺ) pada Tahun Kemenangan.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ نُمَيْرٍ، قَالَا: حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَامَ الْفَتْحِ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا الضَّحَّاكُ يَعْنِي أَبَا عَاصِمٍ، عَنْ عَبْدِ الْحَمِيدِ، حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، قَالَ: كَتَبَ إِلَيَّ عَطَاءٌ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَامَ الْفَتْحِ بِمِثْلِ حَدِيثِ اللَّيْثِ."
      },
      {
        "id": 11614,
        "hadith_number": "4050",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kutukan Allah ke atas Orang Yahudi yang Menjual Lemak Haram",
        "perawi_melayu": "Ibn Abbas (رضي الله عنه) meriwayatkan:",
        "english_text": "This news reached 'Umar رضی اللہ عنہ that Samura رضی اللہ عنہ had sold wine, whereupon he said: May Allah destroy Samura; does he not know that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Let there be the curse of Allah upon the Jews that fat was declared forbidden for them, but they melted it and then sold it ?",
        "malay_translation": "Berita ini sampai kepada 'Umar رضي الله عنه bahawa Samura رضي الله عنه telah menjual arak, lalu dia berkata: Semoga Allah membinasakan Samura; tidakkah dia tahu bahawa Rasulullah ﷺ bersabda: Laknat Allah ke atas orang-orang Yahudi kerana lemak diharamkan ke atas mereka, tetapi mereka mencairkannya dan kemudian menjualnya?",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَاللَّفْظُ لِأَبِي بَكْرٍ، قَالُوا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: بَلَغَ عُمَرَ أَنَّ سَمُرَةَ بَاعَ خَمْرًا، فَقَالَ: قَاتَلَ اللهُ سَمُرَةَ، أَلَمْ يَعْلَمْ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَعَنَ اللهُ الْيَهُودَ، حُرِّمَتْ عَلَيْهِمُ الشُّحُومُ، فَجَمَلُوهَا، فَبَاعُوهَا»."
      },
      {
        "id": 11615,
        "hadith_number": "4051",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Mengenai Sanad Yang Sama",
        "perawi_melayu": "Tiada maklumat perawi",
        "english_text": "This hadith has been narrated on the authority of 'Amr bin Dinar with the same chain of transmitters.",
        "malay_translation": "Hadis ini telah diriwayatkan daripada 'Amr bin Dinar dengan rangkaian perawi yang sama.",
        "arabic_text": "حَدَّثَنَا أُمَيَّةُ بْنُ بِسْطَامَ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا رَوْحٌ يَعْنِي ابْنَ الْقَاسِمِ، عَنْ عَمْرِو بْنِ دِينَارٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ"
      },
      {
        "id": 11616,
        "hadith_number": "4052",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Laknat ke atas Yahudi kerana melanggar larangan Allah",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: May Allah destroy the Jews for Allah forbade the use of fats for them, but they sold them and made use of their price.",
        "malay_translation": "Rasulullah (صلى الله عليه وسلم) bersabda: “Semoga Allah membinasakan orang-orang Yahudi kerana Allah mengharamkan lemak ke atas mereka, tetapi mereka menjualnya dan mengambil manfaat daripada harganya.”",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي ابْنُ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، أَنَّهُ حَدَّثَهُ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «قَاتَلَ اللهُ الْيَهُودَ، حَرَّمَ اللهُ عَلَيْهِمُ الشُّحُومَ، فَبَاعُوهَا وَأَكَلُوا أَثْمَانَهَا»."
      },
      {
        "id": 11617,
        "hadith_number": "4053",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Laknat ke atas Yahudi kerana melanggar larangan Allah",
        "perawi_melayu": "Abu Hurairah (رَضِيَ ٱللَّٰهُ عَنْهُ) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: May Allah destroy the Jews for Allah forbade the use of fat for them, but they sold it and made use of its price.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: “Semoga Allah membinasakan kaum Yahudi. Sesungguhnya Allah mengharamkan lemak bagi mereka, tetapi mereka menjualnya dan mengambil keuntungannya.”",
        "arabic_text": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «قَاتَلَ اللهُ الْيَهُودَ، حُرِّمَ عَلَيْهِمُ الشَّحْمُ، فَبَاعُوهُ وَأَكَلُوا ثَمَنَهُ»."
      },
      {
        "id": 11618,
        "hadith_number": "4054",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Menjual Emas dan Perak dengan Kadar yang Berlebihan atau Tertunda",
        "perawi_melayu": "Abu Sa'id al-Khudri رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Do not sell gold for gold, except like for like, and don't increase something of it upon something; and don't sell silver unless like for like, and don't increase some thing of it upon something, and do not sell for ready money something to be given later.",
        "malay_translation": "Rasulullah ﷺ bersabda: \"Janganlah kamu menjual emas dengan emas, kecuali sama dengan sama, dan janganlah kamu melebihkan sesuatu daripadanya; dan janganlah kamu menjual perak kecuali sama dengan sama, dan janganlah kamu melebihkan sesuatu daripadanya; dan janganlah kamu menjual (sesuatu) yang sedia (tunai) dengan (sesuatu) yang akan diberikan kemudian (tertunda).\"",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَبِيعُوا الذَّهَبَ بِالذَّهَبِ، إِلَّا مِثْلًا بِمِثْلٍ، وَلَا تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ، وَلَا تَبِيعُوا الْوَرِقَ بِالْوَرِقِ، إِلَّا مِثْلًا بِمِثْلٍ، وَلَا تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ، وَلَا تَبِيعُوا مِنْهَا غَائِبًا بِنَاجِزٍ»."
      },
      {
        "id": 11619,
        "hadith_number": "4055",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Jual Beli Emas dan Perak Secara Bertangguh",
        "perawi_melayu": "Nafi' meriwayatkan bahawa Ibn 'Umar رضی اللہ عنہ memberitahunya:",
        "english_text": "A person of the tribe of Laith said that Abu Sa'id al-Kludri رضی اللہ عنہ narrated it (the above-mentioned hadith) from tile Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in a narration of Qutaiba. So 'Abdulah رضی اللہ عنہ and Nafi' went along with him, and in the hadith transmitted by Ibn Rumh (the words are) that Nafi' said: 'Abdullah (bin 'Umar) رضی اللہ عنہ went and I along with the person belonging to Banu Laith entered (the house) of Sa'id al-Khudri رضی اللہ عنہ , and he ('Abdullah bin Umar رضی اللہ عنہ) said: I have been informed that you say that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) forbade the sale of silver with silver except in case of like for like, and sale of gold for gold except in case of like for like. Abu Sa'id رضی اللہ عنہ pointed towards this eyes and his ears with his fingers and said: My eyes saw, and my ears listened to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) saying: Do not sell gold for gold, and do not sell silver for silver except in case of like for like, and do not increase something of it upon something, and do not sell for ready money something, not present, but hand to hand.",
        "malay_translation": "Seorang daripada kabilah Laith berkata bahawa Abu Sa'id al-Khudri رضی اللہ عنہ meriwayatkannya (hadis di atas) daripada Rasulullah (صلى الله عليه وسلم) dalam riwayat Qutaiba. Kemudian 'Abdullah رضی اللہ عنہ dan Nafi' pergi bersamanya, dan dalam hadis yang diriwayatkan oleh Ibn Rumh (lafaznya ialah) bahawa Nafi' berkata: 'Abdullah (bin 'Umar) رضی اللہ عنہ pergi dan saya bersama orang dari Bani Laith memasuki (rumah) Sa'id al-Khudri رضی اللہ عنہ, dan dia ('Abdullah bin Umar رضی اللہ عنہ) berkata: Saya telah dimaklumkan bahawa anda berkata bahawa Rasulullah (صلى الله عليه وسلم) melarang penjualan perak dengan perak kecuali jika sama dengan sama, dan penjualan emas dengan emas kecuali jika sama dengan sama. Abu Sa'id رضی اللہ عنہ menunjuk ke arah matanya dan telinganya dengan jarinya dan berkata: Mata saya melihat, dan telinga saya mendengar Rasulullah (صلى الله عليه وسلم) bersabda: Janganlah kamu menjual emas dengan emas, dan janganlah kamu menjual perak dengan perak kecuali jika sama dengan sama, dan janganlah kamu menambah sesuatu daripadanya atas sesuatu yang lain, dan janganlah kamu menjual secara tunai sesuatu yang tidak ada di tangan, tetapi serah terima.",
        "arabic_text": "دَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، قَالَ لَهُ رَجُلٌ مِنْ بَنِي لَيْثٍ: إِنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَأْثُرُ هَذَا عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي رِوَايَةِ قُتَيْبَةَ، فَذَهَبَ عَبْدُ اللهِ، وَنَافِعٌ مَعَهُ، وَفِي حَدِيثِ ابْنِ رُمْحٍ: قَالَ نَافِعٌ: فَذَهَبَ عَبْدُ اللهِ وَأَنَا مَعَهُ وَاللَّيْثِيُّ، حَتَّى دَخَلَ عَلَى أَبِي سَعِيدٍ الْخُدْرِيِّ، فَقَالَ: إِنَّ هَذَا أَخْبَرَنِي أَنَّكَ تُخْبِرُ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الْوَرِقِ بِالْوَرِقِ إِلَّا مِثْلًا بِمِثْلٍ، وَعَنْ بَيْعِ الذَّهَبِ بِالذَّهَبِ إِلَّا مِثْلًا بِمِثْلٍ ، فَأَشَارَ أَبُو سَعِيدٍ بِإِصْبَعَيْهِ إِلَى عَيْنَيْهِ وَأُذُنَيْهِ، فَقَالَ: أَبْصَرَتْ عَيْنَايَ، وَسَمِعَتْ أُذُنَايَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا تَبِيعُوا الذَّهَبَ بِالذَّهَبِ، وَلَا تَبِيعُوا الْوَرِقَ بِالْوَرِقِ، إِلَّا مِثْلًا بِمِثْلٍ، وَلَا تُشِفُّوا بَعْضَهُ عَلَى بَعْضٍ، وَلَا تَبِيعُوا شَيْئًا غَائِبًا مِنْهُ بِنَاجِزٍ، إِلَّا يَدًا بِيَدٍ»."
      },
      {
        "id": 11620,
        "hadith_number": "4056",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Riwayat Hadith Melalui Rantaian Perawi Lain",
        "perawi_melayu": "Abu Sa'id al-Khudri رضي الله عنه (Melalui rantaian perawi lain)",
        "english_text": "This hadith has been narrated on the authority of Abu Sa'id al-Khudri رضی اللہ عنہ through another chain of transmitters.",
        "malay_translation": "Hadith ini telah diriwayatkan daripada Abu Sa'id al-Khudri رضي الله عنه melalui satu lagi rantaian perawi.",
        "arabic_text": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا جَرِيرٌ يَعْنِي ابْنَ حَازِمٍ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ: سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنِ ابْنِ عَوْنٍ، كُلُّهُمْ عَنْ نَافِعٍ، بِنَحْوِ حَدِيثِ اللَّيْثِ، عَنْ نَافِعٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 11621,
        "hadith_number": "4057",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Menjual Emas dengan Emas dan Perak dengan Perak secara Bertukar Ganti",
        "perawi_melayu": "Abu Sa'id al-Khudri (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Do not sell gold for gold and silver for silver weight for weight or of the same quality.",
        "malay_translation": "Rasulullah (صلى الله عليه وسلم) bersabda: Janganlah kamu menjual emas dengan emas dan perak dengan perak, secara timbangan yang sama atau dengan kualiti yang sama.",
        "arabic_text": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَبِيعُوا الذَّهَبَ بِالذَّهَبِ، وَلَا الْوَرِقَ بِالْوَرِقِ، إِلَّا وَزْنًا بِوَزْنٍ، مِثْلًا بِمِثْلٍ، سَوَاءً بِسَوَاءٍ»."
      },
      {
        "id": 11622,
        "hadith_number": "4058",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Menjual Dinar dan Dirham dengan Nisbah Tertentu",
        "perawi_melayu": "Uthman bin 'Affan رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Do not sell a dinar for two dinars and one dirham for two dirhams.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: \"Janganlah kamu menjual satu dinar dengan dua dinar dan satu dirham dengan dua dirham.\"",
        "arabic_text": "حَدَّثَنَا أَبُو الطَّاهِرِ، وَهَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، وَأَحْمَدُ بْنُ عِيسَى، قَالُوا: حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَخْرَمَةُ، عَنْ أَبِيهِ، قَالَ: سَمِعْتُ سُلَيْمَانَ بْنَ يَسَارٍ، يَقُولُ: إِنَّهُ سَمِعَ مَالِكَ بْنَ أَبِي عَامِرٍ، يُحَدِّثُ عَنْ عُثْمَانَ بْنِ عَفَّانَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَبِيعُوا الدِّينَارَ بِالدِّينَارَيْنِ، وَلَا الدِّرْهَمَ بِالدِّرْهَمَيْنِ»."
      },
      {
        "id": 11623,
        "hadith_number": "4059",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Pertukaran Emas dan Perak (Riba)",
        "perawi_melayu": "Malik bin Aus bin al-Hadathan meriwayatkan:",
        "english_text": "I came saying who was prepared toexchange dirhams (for my gold), whereupon Talha bin Ubaidullah (رضی اللہ عنہ) (as he was sitting with 'Umar bin Khattib رضی اللہ عنہ) said: Show us your gold and then come to us (at a later time). When our servant would come we would give you your silver (dirhams due to you). Thereupon 'Umar bin al-Khattib (رضی اللہ عنہ) said: Not at all. By Allah, either give him his silver (coins). or return his gold to him, for Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Exchange of silver for gold (has an element of) interest in it. except when (it is exchanged) on the spot; and wheat for wheat is an interest unless both are handed over on the spot: barley for barley is interest unless both are handed over on the spot; dates for dates is interest unless both are handed over on the Spot",
        "malay_translation": "Saya datang menawarkan diri untuk menukar dirham (dengan emas saya), lalu Talha bin Ubaidullah (رضي الله عنه) (semasa beliau sedang duduk bersama 'Umar bin Khattib رضي الله عنه) berkata: Tunjukkan emas kamu kepada kami, kemudian datanglah kepada kami (pada masa lain). Apabila hamba kami datang, kami akan memberikan perak (dirham) yang menjadi hak kamu. Kemudian 'Umar bin al-Khattib (رضي الله عنه) berkata: Tidak sama sekali. Demi Allah, sama ada berikan peraknya (dirham) kepadanya, atau kembalikan emasnya kepadanya, kerana Rasulullah (صلى الله عليه وسلم) bersabda: Pertukaran perak dengan emas (mengandungi unsur) riba di dalamnya, kecuali jika (ia ditukar) serta-merta; dan gandum dengan gandum adalah riba kecuali kedua-duanya diserahkan serta-merta: barli dengan barli adalah riba kecuali kedua-duanya diserahkan serta-merta; kurma dengan kurma adalah riba kecuali kedua-duanya diserahkan serta-merta.",
        "arabic_text": "دَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ، أَنَّهُ قَالَ: أَقْبَلْتُ أَقُولُ مَنْ يَصْطَرِفُ الدَّرَاهِمَ؟ فَقَالَ طَلْحَةُ بْنُ عُبَيْدِ اللهِ - وَهُوَ عِنْدَ عُمَرَ بْنِ الْخَطَّابِ -: أَرِنَا ذَهَبَكَ، ثُمَّ ائْتِنَا، إِذَا جَاءَ خَادِمُنَا، نُعْطِكَ وَرِقَكَ، فَقَالَ عُمَرُ بْنُ الْخَطَّابِ: كَلَّا، وَاللهِ لَتُعْطِيَنَّهُ وَرِقَهُ، أَوْ لَتَرُدَّنَّ إِلَيْهِ ذَهَبَهُ، فَإِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْوَرِقُ بِالذَّهَبِ رِبًا، إِلَّا هَاءَ وَهَاءَ، وَالْبُرُّ بِالْبُرِّ رِبًا، إِلَّا هَاءَ وَهَاءَ، وَالشَّعِيرُ بِالشَّعِيرِ رِبًا، إِلَّا هَاءَ وَهَاءَ، وَالتَّمْرُ بِالتَّمْرِ رِبًا، إِلَّا هَاءَ وَهَاءَ»."
      },
      {
        "id": 11624,
        "hadith_number": "4060",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadith Diriwayatkan Melalui Sanad yang Sama",
        "perawi_melayu": "Tiada maklumat",
        "english_text": "This hadith has been narrated on the authority of Zuhri with the same chain of transmitters.",
        "malay_translation": "Hadith ini telah diriwayatkan daripada Zuhri dengan sanad yang sama.",
        "arabic_text": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ، عَنِ ابْنِ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ."
      },
      {
        "id": 11625,
        "hadith_number": "4061",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Haram Riba dalam Jual Beli Barang yang Sama Jenis",
        "perawi_melayu": "Abi Qilabah meriwayatkan:",
        "english_text": "I was in Syria (having) a circle (of friends). in which was Muslim b. Yasir. There came Abu'l-Ash'ath. He (the narrator) said that they (the friends) called him: Abu'l-Ash'ath, Abu'l-Ash'ath, and he sat down. I said to him: Narrate to our brother the hadith of Ubada bin Samit رضی اللہ عنہ . He said: Yes. We went out on an expedition, Mu'awiya  رضی اللہ عنہ being the leader of the people, and we gained a lot of spoils of war. And there was one silver utensil in what we took as spoils. Mu'awiya رضی اللہ عنہ ordered a person to sell it for payment to the people (soldiers). The people made haste in getting that. The news of (this state of affairs) reached 'Ubada bin Samit رضی اللہ عنہ , and he stood up and said: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbidding the sale of gold by gold, and silver by silver, and wheat by wheat, and barley by barley, and dates by dates, and salt by salt, except like for like and equal for equal. So he who made an addition or who accepted an addition (committed the sin of taking) interest. So the people returned what they had got. This reached Mu'awiya رضی اللہ عنہ . and he stood up to deliver an address. He said: What is the matter with people that they narrate from the Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) such tradition which we did not hear though we saw him (the Holy Prophet) and lived in his company? Thereupon, Ubida bin Samit رضی اللہ عنہ stood up and repeated that narration, and then said: We will definitely narrate what we heard from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) though it may be unpleasant to Mu'awiya رضی اللہ عنہ (or he said: Even if it is against his will). I do not mind if I do not remain in his troop in the dark night. Hammad said this or something like this.",
        "malay_translation": "Saya berada di Syria (mempunyai) satu majlis (sahabat). Di dalamnya ada Muslim b. Yasir. Datang Abu'l-Ash'ath. Dia (perawi) berkata bahawa mereka (sahabat) memanggilnya: Abu'l-Ash'ath, Abu'l-Ash'ath, dan dia duduk. Saya berkata kepadanya: Ceritakan kepada saudara kita hadis 'Ubada bin Samit رضي الله عنه . Dia berkata: Ya. Kami keluar dalam satu ekspedisi, Mu'awiya رضي الله عنه menjadi ketua orang ramai, dan kami mendapat banyak harta rampasan perang. Dan ada satu bekas perak dalam apa yang kami ambil sebagai harta rampasan. Mu'awiya رضي الله عنه memerintahkan seseorang untuk menjualnya untuk pembayaran kepada orang ramai (tentera). Orang ramai bergegas mendapatkannya. Berita (keadaan ini) sampai kepada 'Ubada bin Samit رضي الله عنه , dan dia berdiri dan berkata: Saya mendengar Rasulullah (صلى الله عليه وسلم) melarang penjualan emas dengan emas, dan perak dengan perak, dan gandum dengan gandum, dan barli dengan barli, dan kurma dengan kurma, dan garam dengan garam, kecuali sama dengan sama dan sama rata. Maka sesiapa yang membuat tambahan atau menerima tambahan (melakukan dosa mengambil) riba. Maka orang ramai memulangkan apa yang telah mereka dapatkan. Ini sampai kepada Mu'awiya رضي الله عنه . dan dia berdiri untuk menyampaikan ucapan. Dia berkata: Apakah masalah orang ramai yang mereka meriwayatkan daripada Rasulullah (صلى الله عليه وسلم) tradisi sedemikian yang kami tidak dengar walaupun kami melihatnya (Nabi Suci) dan hidup bersamanya? Kemudian, Ubida bin Samit رضي الله عنه berdiri dan mengulangi riwayat itu, dan kemudian berkata: Kami pasti akan meriwayatkan apa yang kami dengar daripada Rasulullah (صلى الله عليه وسلم) walaupun ia mungkin tidak menyenangkan bagi Mu'awiya رضي الله عنه (atau dia berkata: Walaupun bertentangan dengan kehendaknya). Saya tidak kisah jika saya tidak berada dalam tenteranya pada malam yang gelap. Hammad berkata ini atau sesuatu yang serupa ini.",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلَابَةَ، قَالَ: كُنْتُ بِالشَّامِ فِي حَلْقَةٍ فِيهَا مُسْلِمُ بْنُ يَسَارٍ، فَجَاءَ أَبُو الْأَشْعَثِ، قَالَ: قَالُوا: أَبُو الْأَشْعَثِ، أَبُو الْأَشْعَثِ، فَجَلَسَ، فَقُلْتُ لَهُ: حَدِّثْ أَخَانَا حَدِيثَ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ: نَعَمْ، غَزَوْنَا غَزَاةً وَعَلَى النَّاسِ مُعَاوِيَةُ، فَغَنِمْنَا غَنَائِمَ كَثِيرَةً، فَكَانَ فِيمَا غَنِمْنَا آنِيَةٌ مِنْ فِضَّةٍ، فَأَمَرَ مُعَاوِيَةُ رَجُلًا أَنْ يَبِيعَهَا فِي أَعْطِيَاتِ النَّاسِ، فَتَسَارَعَ النَّاسُ فِي ذَلِكَ، فَبَلَغَ عُبَادَةَ بْنَ الصَّامِتِ، فَقَامَ، فَقَالَ: إِنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَنْهَى عَنْ بَيْعِ الذَّهَبِ بِالذَّهَبِ، وَالْفِضَّةِ بِالْفِضَّةِ، وَالْبُرِّ بِالْبُرِّ، وَالشَّعِيرِ بِالشَّعِيرِ، وَالتَّمْرِ بِالتَّمْرِ، وَالْمِلْحِ بِالْمِلْحِ، إِلَّا سَوَاءً بِسَوَاءٍ، عَيْنًا بِعَيْنٍ، فَمَنْ زَادَ، أَوِ ازْدَادَ، فَقَدْ أَرْبَى»، فَرَدَّ النَّاسُ مَا أَخَذُوا، فَبَلَغَ ذَلِكَ مُعَاوِيَةَ فَقَامَ خَطِيبًا، فَقَالَ: أَلَا مَا بَالُ رِجَالٍ يَتَحَدَّثُونَ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَحَادِيثَ قَدْ كُنَّا نَشْهَدُهُ وَنَصْحَبُهُ فَلَمْ نَسْمَعْهَا مِنْهُ، فَقَامَ عُبَادَةُ بْنُ الصَّامِتِ فَأَعَادَ الْقِصَّةَ، ثُمَّ قَالَ: لَنُحَدِّثَنَّ بِمَا سَمِعْنَا مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَإِنْ كَرِهَ مُعَاوِيَةُ - أَوْ قَالَ: وَإِنْ رَغِمَ - مَا أُبَالِي أَنْ لَا أَصْحَبَهُ فِي جُنْدِهِ لَيْلَةً سَوْدَاءَ ، قَالَ حَمَّادٌ هَذَا أَوْ نَحْوَه."
      },
      {
        "id": 11626,
        "hadith_number": "4062",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Riwayat Hadith Melalui Sanad Lain",
        "perawi_melayu": "Tiada maklumat perawi",
        "english_text": "The above hadith is likewise narrated through another chain of transmission on the authority of Abi Qilabah.",
        "malay_translation": "Hadith di atas juga diriwayatkan melalui sanad lain daripada Abi Qilabah.",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنْ عَبْدِ الْوَهَّابِ الثَّقَفِيِّ، عَنْ أَيُّوبَ بِهَذَا الْإِسْنَادِ نَحْوَهُ."
      },
      {
        "id": 11627,
        "hadith_number": "4063",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Pertukaran Emas, Perak, Gandum, Barli, Kurma, dan Garam",
        "perawi_melayu": "Ubida bin al-Simit (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Gold is to be paid for by gold, silver by silver, wheat by wheat, barley by barley, dates by dates, and salt by salt, like for like and equal for equal, payment being made hand to hand. If these classes differ, then sell as you wish if payment is made hand to hand.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Emas ditukar dengan emas, perak dengan perak, gandum dengan gandum, barli dengan barli, kurma dengan kurma, dan garam dengan garam, sama sukatan dan sama kualiti, dan hendaklah serah-menyerah serta-merta. Jika jenis-jenis ini berbeza, maka juallah sesuka hati kamu sekiranya serah-menyerah serta-merta.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَاللَّفْظُ لِابْنِ أَبِي شَيْبَةَ، قَالَ إِسْحَاقُ: أَخْبَرَنَا، وَقَالَ الْآخَرَانِ: حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلَابَةَ، عَنْ أَبِي الْأَشْعَثِ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الذَّهَبُ بِالذَّهَبِ، وَالْفِضَّةُ بِالْفِضَّةِ، وَالْبُرُّ بِالْبُرِّ، وَالشَّعِيرُ بِالشَّعِيرِ، وَالتَّمْرُ بِالتَّمْرِ، وَالْمِلْحُ بِالْمِلْحِ، مِثْلًا بِمِثْلٍ، سَوَاءً بِسَوَاءٍ، يَدًا بِيَدٍ، فَإِذَا اخْتَلَفَتْ هَذِهِ الْأَصْنَافُ، فَبِيعُوا كَيْفَ شِئْتُمْ، إِذَا كَانَ يَدًا بِيَدٍ»."
      },
      {
        "id": 11628,
        "hadith_number": "4064",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Riba dalam Pertukaran Barang",
        "perawi_melayu": "Abu Sa'id al-Khudri (رضی اللہ عنہ) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Gold is to be paid for by gold, silver by silver, wheat by wheat, barley by barley, dates by dates, salt by salt, like by like, payment being made hand to hand. He who made an addition to it, or asked for an addition, in fact dealt in usury. The receiver and the giver are equally guilty.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Emas dibayar dengan emas, perak dengan perak, gandum dengan gandum, barli dengan barli, kurma dengan kurma, garam dengan garam, sama dengan sama, pembayaran dilakukan secara tunai. Sesiapa yang menambahnya, atau meminta tambahan, sesungguhnya dia telah melakukan riba. Penerima dan pemberi adalah sama-sama berdosa.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُسْلِمٍ الْعَبْدِيُّ، حَدَّثَنَا أَبُو الْمُتَوَكِّلِ النَّاجِيُّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الذَّهَبُ بِالذَّهَبِ، وَالْفِضَّةُ بِالْفِضَّةِ، وَالْبُرُّ بِالْبُرِّ، وَالشَّعِيرُ بِالشَّعِيرِ، وَالتَّمْرُ بِالتَّمْرِ، وَالْمِلْحُ بِالْمِلْحِ، مِثْلًا بِمِثْلٍ، يَدًا بِيَدٍ، فَمَنْ زَادَ، أَوِ اسْتَزَادَ، فَقَدْ أَرْبَى، الْآخِذُ وَالْمُعْطِي فِيهِ سَوَاءٌ»."
      },
      {
        "id": 11629,
        "hadith_number": "4065",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perihal Emas dengan Emas (Serupa)",
        "perawi_melayu": "Diriwayatkan daripada Abu Saeed al-Khudri (رضی اللہ عنہ)",
        "english_text": "\"The Messenger of Allah ﷺ said: 'Gold for gold, like for like....\" a similar hadith (as no. 4064).",
        "malay_translation": "\"Rasulullah ﷺ bersabda: 'Emas dengan emas, serupa dengan serupa....' sebuah hadith yang serupa (seperti no. 4064).",
        "arabic_text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا سُلَيْمَانُ الرَّبَعِيُّ، حَدَّثَنَا أَبُو الْمُتَوَكِّلِ النَّاجِيُّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الذَّهَبُ بِالذَّهَبِ، مِثْلًا بِمِثْلٍ» فَذَكَرَ بِمِثْلِهِ."
      },
      {
        "id": 11630,
        "hadith_number": "4066",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Pertukaran Kurma, Gandum, Barli, dan Garam",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Dates are to be paid for by dates, wheat by wheat, barley by barley, salt by salt, like for like, payment being made on the spot. He who made an addition or demanded an addition, in fact, dealt in usury except in case where their classes differ.",
        "malay_translation": "Rasulullah (صلى الله عليه وسلم) bersabda: \"Kurma hendaklah dibayar dengan kurma, gandum dengan gandum, barli dengan barli, garam dengan garam, sama dengan sama, bayaran hendaklah dibuat serta-merta. Sesiapa yang menambah atau meminta tambahan, sesungguhnya dia telah melakukan riba kecuali jika jenisnya berbeza.",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ، وَوَاصِلُ بْنُ عَبْدِ الْأَعْلَى، قَالَا: حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «التَّمْرُ بِالتَّمْرِ، وَالْحِنْطَةُ بِالْحِنْطَةِ، وَالشَّعِيرُ بِالشَّعِيرِ، وَالْمِلْحُ بِالْمِلْحِ، مِثْلًا بِمِثْلٍ، يَدًا بِيَدٍ، فَمَنْ زَادَ، أَوِ اسْتَزَادَ، فَقَدْ أَرْبَى، إِلَّا مَا اخْتَلَفَتْ أَلْوَانُهُ»."
      },
      {
        "id": 11631,
        "hadith_number": "4067",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Riwayat Hadith Fudail bin Ghazwan",
        "perawi_melayu": "Tiada maklumat perawi",
        "english_text": "This hadith has been narrated on the authority of Fudail bin Ghazwan with the same chain of transmitters, but he made no mention of (payment being) made on the spot.",
        "malay_translation": "Hadith ini telah diriwayatkan daripada Fudail bin Ghazwan dengan rangkaian perawi yang sama, tetapi beliau tidak menyebut tentang (pembayaran) yang dibuat serta-merta.",
        "arabic_text": "وحَدَّثَنِيهِ أَبُو سَعِيدٍ الْأَشَجُّ، حَدَّثَنَا الْمُحَارِبِيُّ، عَنْ فُضَيْلِ بْنِ غَزْوَانَ، بِهَذَا الْإِسْنَادِ، وَلَمْ يَذْكُرْ يَدًا بِيَدٍ."
      },
      {
        "id": 11632,
        "hadith_number": "4068",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Pertukaran Emas dan Perak",
        "perawi_melayu": "Abu Hurairah (رَضِيَ ٱللَّٰهُ عَنْهُ) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Gold is to be paid for by gold with equal weight, like for like, and silver is to be paid for by silver with equal weight, like for like. He who made an addition to it or demanded an addition dealt in usury.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Emas hendaklah ditukar dengan emas yang sama berat, seperti untuk seperti, dan perak hendaklah ditukar dengan perak yang sama berat, seperti untuk seperti. Sesiapa yang menambah atau meminta tambahan, maka dia telah melakukan riba.",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، وَوَاصِلُ بْنُ عَبْدِ الْأَعْلَى، قَالَا: حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنِ ابْنِ أَبِي نُعْمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الذَّهَبُ بِالذَّهَبِ وَزْنًا بِوَزْنٍ، مِثْلًا بِمِثْلٍ، وَالْفِضَّةُ بِالْفِضَّةِ وَزْنًا بِوَزْنٍ، مِثْلًا بِمِثْلٍ، فَمَنْ زَادَ أَوِ اسْتَزَادَ فَهُوَ رِبًا»."
      },
      {
        "id": 11633,
        "hadith_number": "4069",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pertukaran Dinar dan Dirham",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Let dinar be exchanged for dinar, with no addition on either side and dirham be exchanged for dirham with no addition on either side.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Hendaklah dinar ditukarkan dengan dinar, tanpa ada tambahan pada kedua belah pihak, dan dirham ditukarkan dengan dirham, tanpa ada tambahan pada kedua belah pihak.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ بِلَالٍ، عَنْ مُوسَى بْنِ أَبِي تَمِيمٍ، عَنْ سَعِيدِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الدِّينَارُ بِالدِّينَارِ لَا فَضْلَ بَيْنَهُمَا، وَالدِّرْهَمُ بِالدِّرْهَمِ لَا فَضْلَ بَيْنَهُمَا»."
      },
      {
        "id": 11634,
        "hadith_number": "4070",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Riwayat Serupa oleh Musa bin Abi Tamim",
        "perawi_melayu": "Musa bin Abi Tamim",
        "english_text": "Musa bin Abi Tamim narrated a similar report (as Hadith no. 4069) with this chain.",
        "malay_translation": "Musa bin Abi Tamim meriwayatkan laporan yang serupa (seperti Hadis no. 4069) dengan sanad ini.",
        "arabic_text": "دَّثَنِيهِ أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، قَالَ: سَمِعْتُ مَالِكَ بْنَ أَنَسٍ، يَقُولُ: حَدَّثَنِي مُوسَى بْنُ أَبِي تَمِيمٍ، بِهَذَا الْإِسْنَادِ مِثْلَهُ."
      },
      {
        "id": 11635,
        "hadith_number": "4071",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Jual Beli Perak Secara Tangguh dan Hukum Riba",
        "perawi_melayu": "Abu Minhal meriwayatkan:",
        "english_text": "My partner sold silver to be paid in the (Hajj) season or (in the days of) Hajj. He (my partner) came to me and informed me, and I said to him: Such transaction is not desirable. He said: I sold it in the market (on loan) but nobody objected to this. I went to al-Bara' bin 'Azib رضی اللہ عنہ and asked him, and he said: Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came to Medina and we made such transaction, whereupon he said: In case the payment is made on the spot, there is no harm in it, and in case (it is 'sold) on loan, it is usury. You better go to Zaid bin Arqam رضی اللہ عنہ , for he is a greater trader than I; so I went to him and asked him, and he said like it.",
        "malay_translation": "Rakan kongsi saya menjual perak dengan pembayaran pada musim (Haji) atau (pada hari-hari) Haji. Dia (rakan kongsi saya) datang kepada saya dan memberitahu saya, dan saya berkata kepadanya: Urus niaga sedemikian tidak diingini. Dia berkata: Saya menjualnya di pasar (secara hutang) tetapi tiada siapa yang membantah perkara ini. Saya pergi kepada al-Bara' bin 'Azib رضی اللہ عنہ dan bertanya kepadanya, dan dia berkata: Rasulullah (صلی ‌اللہ ‌علیہ ‌وسلم ‌) datang ke Madinah dan kami membuat urus niaga sedemikian, kemudian dia berkata: Sekiranya pembayaran dibuat serta-merta, tidak ada salahnya, dan sekiranya (ia dijual) secara hutang, ia adalah riba. Sebaiknya kamu pergi kepada Zaid bin Arqam رضی اللہ عنہ, kerana dia adalah peniaga yang lebih besar daripada saya; jadi saya pergi kepadanya dan bertanya kepadanya, dan dia berkata begitu juga.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ أَبِي الْمِنْهَالِ، قَالَ: بَاعَ شَرِيكٌ لِي وَرِقًا بِنَسِيئَةٍ إِلَى الْمَوْسِمِ، أَوْ إِلَى الْحَجِّ، فَجَاءَ إِلَيَّ فَأَخْبَرَنِي، فَقُلْتُ: هَذَا أَمْرٌ لَا يَصْلُحُ، قَالَ: قَدْ بِعْتُهُ فِي السُّوقِ، فَلَمْ يُنْكِرْ ذَلِكَ عَلَيَّ أَحَدٌ، فَأَتَيْتُ الْبَرَاءَ بْنَ عَازِبٍ، فَسَأَلْتُهُ، فَقَالَ: قَدِمَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ وَنَحْنُ نَبِيعُ هَذَا الْبَيْعَ، فَقَالَ: «مَا كَانَ يَدًا بِيَدٍ فَلَا بَأْسَ بِهِ، وَمَا كَانَ نَسِيئَةً فَهُوَ رِبًا»، وَائْتِ زَيْدَ بْنَ أَرْقَمَ، فَإِنَّهُ أَعْظَمُ تِجَارَةً مِنِّي، فَأَتَيْتُهُ فَسَأَلْتُهُ، فَقَالَ: مِثْلَ ذَلِكَ."
      },
      {
        "id": 11636,
        "hadith_number": "4072",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Jual Beli Emas dan Perak Secara Tangguh",
        "perawi_melayu": "Habib meriwayatkan bahawa dia mendengar Abu Minhal berkata:",
        "english_text": "I asked al-Bara' bin Azib رضی اللہ عنہ about the exchange of (gold for silver or vice versa), whereupon he said: you better ask Zaid bin Arqam رضی اللہ عنہ for he knows more than I. So I asked Zaid but he said: You better ask al-Bara' for he knows more than I. Then both of them said: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade the sale of silver for gold when payment is to be made in future.",
        "malay_translation": "Saya bertanya kepada al-Bara' bin Azib رضی اللہ عنہ tentang pertukaran (emas dengan perak atau sebaliknya), lalu dia berkata: lebih baik kamu bertanya kepada Zaid bin Arqam رضی اللہ عنہ kerana dia lebih tahu daripada saya. Lalu saya bertanya kepada Zaid, tetapi dia berkata: Lebih baik kamu bertanya kepada al-Bara' kerana dia lebih tahu daripada saya. Kemudian kedua-duanya berkata: Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) melarang penjualan perak dengan emas apabila pembayaran dibuat pada masa akan datang.",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ حَبِيبٍ، أَنَّهُ سَمِعَ أَبَا الْمِنْهَالِ، يَقُولُ: سَأَلْتُ الْبَرَاءَ بْنَ عَازِبٍ عَنِ الصَّرْفِ، فَقَالَ: سَلْ زَيْدَ بْنَ أَرْقَمَ، فَهُوَ أَعْلَمُ، فَسَأَلْتُ زَيْدًا، فَقَالَ: سَلِ الْبَرَاءَ، فَإِنَّهُ أَعْلَمُ، ثُمَّ قَالَا: «نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الْوَرِقِ بِالذَّهَبِ دَيْنًا»."
      },
      {
        "id": 11637,
        "hadith_number": "4073",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Jual Beli Emas dan Perak Secara Tidak Sama Kadar",
        "perawi_melayu": "Abdul-Rahman bin Abi Bakra meriwayatkan dari bapanya:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade the sale of gold for gold, and silver for silver except equal for equal, and commanded us to buy silver for gold as we desired and buy gold for silver as we desired. A person asked him (about the nature of payment), whereupon he said: It is to be made on the spot. This is what I heard (from Allah's Messenger (ﷺ).",
        "malay_translation": "Rasulullah (ﷺ) melarang penjualan emas dengan emas, dan perak dengan perak kecuali sama dengan sama, dan memerintahkan kami untuk membeli perak dengan emas seperti yang kami kehendaki dan membeli emas dengan perak seperti yang kami kehendaki. Seseorang bertanya kepada baginda (tentang bentuk pembayaran), lalu baginda bersabda: Ia hendaklah dilakukan pada waktu itu juga. Inilah yang aku dengar (dari Rasulullah (ﷺ).",
        "arabic_text": "حَدَّثَنَا أَبُو الرَّبِيعِ الْعَتَكِيُّ، حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ، أَخْبَرَنَا يَحْيَى بْنُ أَبِي إِسْحَاقَ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، قَالَ: «نَهَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، عَنِ الْفِضَّةِ بِالْفِضَّةِ، وَالذَّهَبِ بِالذَّهَبِ، إِلَّا سَوَاءً بِسَوَاءٍ، وَأَمَرَنَا أَنْ نَشْتَرِيَ الْفِضَّةَ بِالذَّهَبِ كَيْفَ شِئْنَا، وَنَشْتَرِيَ الذَّهَبَ بِالْفِضَّةِ كَيْفَ شِئْنَا»، قَالَ: فَسَأَلَهُ رَجُلٌ، فَقَالَ: يَدًا بِيَدٍ؟ فَقَالَ: «هَكَذَا سَمِعْتُ»."
      },
      {
        "id": 11638,
        "hadith_number": "4074",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Nabi (ﷺ): Sama seperti di atas",
        "perawi_melayu": "Abdul-Rahman bin Abu Bakra رضي الله عنه",
        "english_text": "same as above Abdul-Rahman bin Abu Bakra رضی اللہ عنہ said: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) prohibited us. The rest of the hadith is the same.",
        "malay_translation": "Sama seperti di atas, Abdul-Rahman bin Abu Bakra رضي الله عنه berkata: Rasulullah (ﷺ) melarang kami. Selebihnya hadis adalah sama.",
        "arabic_text": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا يَحْيَى بْنُ صَالِحٍ، حَدَّثَنَا مُعَاوِيَةُ، عَنْ يَحْيَى وَهُوَ ابْنُ أَبِي كَثِيرٍ، عَنْ يَحْيَى بْنِ أَبِي إِسْحَاقَ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرَةَ، أَخْبَرَهُ أَنَّ أَبَا بَكْرَةَ، قَالَ: نَهَانَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ."
      },
      {
        "id": 11639,
        "hadith_number": "4075",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Perintah Memisahkan Emas dalam Rampasan Perang",
        "perawi_melayu": "Fadala bin Ubaid al-Ansari رضی اللہ عنہ meriwayatkan:",
        "english_text": "A necklace having gold and gems in it was brought to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) in Khaibar and it was one of the spoils of war and was put to sale. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The gold used in it should be separated, and then Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) further said: (Sell) gold for gold with equal weight.",
        "malay_translation": "Sebuah kalung yang mengandungi emas dan permata dibawa kepada Rasulullah (ﷺ) di Khaibar, dan ia adalah salah satu daripada rampasan perang dan diletakkan untuk dijual. Rasulullah (ﷺ) bersabda: Emas yang digunakan di dalamnya hendaklah dipisahkan, dan kemudian Rasulullah (ﷺ) selanjutnya bersabda: (Jual) emas dengan emas dengan berat yang sama.",
        "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي أَبُو هَانِئٍ الْخَوْلَانِيُّ، أَنَّهُ سَمِعَ عُلَيَّ بْنَ رَبَاحٍ اللَّخْمِيَّ، يَقُولُ: سَمِعْتُ فَضَالَةَ بْنَ عُبَيْدٍ الْأَنْصَارِيَّ، يَقُولُ: أُتِيَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ بِخَيْبَرَ بِقِلَادَةٍ فِيهَا خَرَزٌ وَذَهَبٌ، وَهِيَ مِنَ الْمَغَانِمِ تُبَاعُ، فَأَمَرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالذَّهَبِ الَّذِي فِي الْقِلَادَةِ فَنُزِعَ وَحْدَهُ، ثُمَّ قَالَ لَهُمْ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الذَّهَبُ بِالذَّهَبِ وَزْنًا بِوَزْنٍ»."
      },
      {
        "id": 11640,
        "hadith_number": "4076",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Menjual Barang Emas Berhias yang Belum Dipisahkan",
        "perawi_melayu": "Fadila bin 'Ubaid (رضي الله عنه) meriwayatkan:",
        "english_text": "I bought on the day (of the Victory of Khaibar) a necklace for twelve dinars (gold coins). It was made of gold studded with gems. I separated (gold from gems) in it, and found (gold) of more (worth) than twelve dinars. I made a mention of it to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), whereupon he said: It should not be sold unless it is separated.",
        "malay_translation": "Saya membeli pada hari (Kemenangan Khaibar) seutas kalung dengan harga dua belas dinar (syiling emas). Ia diperbuat daripada emas bertatahkan permata. Saya memisahkan (emas daripada permata) di dalamnya, dan mendapati (emas) lebih (bernilai) daripada dua belas dinar. Saya menyebutnya kepada Rasulullah (صلى الله عليه وسلم), lalu baginda bersabda: \"Ia tidak boleh dijual melainkan ia dipisahkan.\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ أَبِي شُجَاعٍ سَعِيدِ بْنِ يَزِيدَ، عَنْ خَالِدِ بْنِ أَبِي عِمْرَانَ، عَنْ حَنَشٍ الصَّنْعَانِيِّ، عَنْ فَضَالَةَ بْنِ عُبَيْدٍ، قَالَ: اشْتَرَيْتُ يَوْمَ خَيْبَرَ قِلَادَةً بِاثْنَيْ عَشَرَ دِينَارًا، فِيهَا ذَهَبٌ وَخَرَزٌ، فَفَصَّلْتُهَا، فَوَجَدْتُ فِيهَا أَكْثَرَ مِنِ اثْنَيْ عَشَرَ دِينَارًا، فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «لَا تُبَاعُ حَتَّى تُفَصَّلَ»."
      },
      {
        "id": 11641,
        "hadith_number": "4077",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Serupa Dari Sa'id bin Yazid",
        "perawi_melayu": "Tiada Maklumat (Jika ada, perawi akan dinyatakan)",
        "english_text": "A hadith like this is narrated on the authority of Sa'id bin Yazid with the same chain of transmitters.",
        "malay_translation": "Hadis seperti ini diriwayatkan daripada Sa'id bin Yazid dengan sanad yang sama.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا ابْنُ مُبَارَكٍ، عَنْ سَعِيدِ بْنِ يَزِيدَ، بِهَذَا الْإِسْنَادِ نَحْوَهُ."
      },
      {
        "id": 11642,
        "hadith_number": "4078",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Jual Beli Emas Semasa Perang Khaibar",
        "perawi_melayu": "Fadala bin 'Ubaid رضي الله عنه meriwayatkan:",
        "english_text": "We were in the company of Allah's Messenger (ﷺ) on the day (of the Victory of) Khaibar, and made transaction with the Jews for the 'uqiya of gold for the dinars or three (gold coins), whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Do not sell gold for gold but for equal weight",
        "malay_translation": "Kami bersama Rasulullah ﷺ pada hari (Kemenangan) Khaibar, dan membuat urus niaga dengan orang Yahudi untuk 'uqiya emas dengan dinar atau tiga (syiling emas), lalu Rasulullah ﷺ bersabda: Janganlah kamu menjual emas dengan emas kecuali dengan berat yang sama.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ أَبِي جَعْفَرٍ، عَنِ الْجُلَاحِ أَبِي كَثِيرٍ، حَدَّثَنِي حَنَشٌ الصَّنْعَانِيُّ، عَنْ فَضَالَةَ بْنِ عُبَيْدٍ، قَالَ: كُنَّا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمَ خَيْبَرَ، نُبَايِعُ الْيَهُودَ الْوُقِيَّةَ الذَّهَبَ بِالدِّينَارَيْنِ وَالثَّلَاثَةِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَبِيعُوا الذَّهَبَ بِالذَّهَبِ، إِلَّا وَزْنًا بِوَزْنٍ»."
      },
      {
        "id": 11643,
        "hadith_number": "4079",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Menjual Rantai Emas dan Permata",
        "perawi_melayu": "Hanash meriwayatkan:",
        "english_text": "We were along with Fadala bin Ubaid (رضی اللہ عنہ) in an expedition. There fell to my and my friend's lot a necklace made of gold, silver and jewels. I decided to buy that. I asked Fadala bin 'Ubaid رضی اللہ عنہ , whereupon he said: Separate its gold and place it in one pan (of the balance) and place your gold in the other pan, and do not receive but equal for equal, for I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who believes in Allah and the Hereafter should not take but equal for equal.",
        "malay_translation": "Kami bersama Fadala bin Ubaid (رضي الله عنه) dalam satu ekspedisi. Kami dan sahabat saya mendapat seutas rantai yang diperbuat daripada emas, perak, dan permata. Saya bercadang untuk membelinya. Saya bertanya kepada Fadala bin 'Ubaid رضي الله عنه, lalu dia berkata: Asingkan emasnya dan letakkannya di satu bekas (timbangan) dan letakkan emas anda di bekas yang lain, dan janganlah mengambil kecuali sama dengan sama, kerana saya mendengar Rasulullah (صلى الله عليه وسلم) bersabda: Sesiapa yang beriman kepada Allah dan Hari Akhirat, janganlah mengambil kecuali sama dengan sama.",
        "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ قُرَّةَ بْنِ عَبْدِ الرَّحْمَنِ الْمَعَافِرِيِّ، وَعَمْرِو بْنِ الْحَارِثِ، وَغَيْرِهِمَا، أَنَّ عَامِرَ بْنَ يَحْيَى الْمَعَافِرِيَّ، أَخْبَرَهُمْ، عَنْ حَنَشٍ، أَنَّهُ قَالَ: كُنَّا مَعَ فَضَالَةَ بْنِ عُبَيْدٍ فِي غَزْوَةٍ، فَطَارَتْ لِي وَلِأَصْحَابِي قِلَادَةٌ فِيهَا ذَهَبٌ وَوَرِقٌ وَجَوْهَرٌ، فَأَرَدْتُ أَنْ أَشْتَرِيَهَا، فَسَأَلْتُ فَضَالَةَ بْنَ عُبَيْدٍ، فَقَالَ: انْزِعْ ذَهَبَهَا فَاجْعَلْهُ فِي كِفَّةٍ، وَاجْعَلْ ذَهَبَكَ فِي كِفَّةٍ، ثُمَّ لَا تَأْخُذَنَّ إِلَّا مِثْلًا بِمِثْلٍ، فَإِنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «مَنْ كَانَ يُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ، فَلَا يَأْخُذَنَّ إِلَّا مِثْلًا بِمِثْلٍ»."
      },
      {
        "id": 11644,
        "hadith_number": "4080",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Gandum ditukar dengan barli: Prinsip kesamaan dalam jual beli",
        "perawi_melayu": "Ma'mar bin Abdullah رضي الله عنه meriwayatkan:",
        "english_text": "He sent his slave with a sa' of wheat and said to him: Sell it, and then buy with it barley. The slave went away and he got a sa' (of barley) and a part of sa' over and above that. When he came to Ma'mar he informed him about that, whereupon Ma'mar said to him: Why did you do that? Go back and return that, and do not accept but weight, for weight, for I used to hear from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Wheat for wheat and like for like. He (one of the narrators) said: Our food in those days consisted of barley. It was said to him (Ma'mar) that (wheat) is not like that (barley). He replied: I am afraid these may not be similar",
        "malay_translation": "Baginda menghantar hambanya dengan satu sa' gandum dan berkata kepadanya: Jualkannya, kemudian belilah dengannya barli. Hamba itu pergi dan dia mendapat satu sa' (barli) dan sebahagian daripada sa' lebih daripada itu. Apabila dia datang kepada Ma'mar dia memaklumkan kepadanya tentang perkara itu, lalu Ma'mar berkata kepadanya: Mengapa kamu melakukan itu? Kembalilah dan pulangkan itu, dan jangan menerima melainkan timbangan, untuk timbangan, kerana aku pernah mendengar daripada Rasulullah (صلى الله عليه وسلم) bersabda: Gandum untuk gandum dan serupa dengan serupa. Dia (salah seorang perawi) berkata: Makanan kami pada masa itu terdiri daripada barli. Dikatakan kepadanya (Ma'mar) bahawa (gandum) tidak seperti itu (barli). Dia menjawab: Aku khuatir ini mungkin tidak serupa",
        "arabic_text": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، ح وحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، أَنَّ أَبَا النَّضْرِ، حَدَّثَهُ أَنَّ بُسْرَ بْنَ سَعِيدٍ، حَدَّثَهُ، عَنْ مَعْمَرِ بْنِ عَبْدِ اللهِ، أَنَّهُ أَرْسَلَ غُلَامَهُ بِصَاعِ قَمْحٍ، فَقَالَ: بِعْهُ، ثُمَّ اشْتَرِ بِهِ شَعِيرًا، فَذَهَبَ الْغُلَامُ، فَأَخَذَ صَاعًا وَزِيَادَةَ بَعْضِ صَاعٍ، فَلَمَّا جَاءَ مَعْمَرًا أَخْبَرَهُ بِذَلِكَ، فَقَالَ لَهُ مَعْمَرٌ: لِمَ فَعَلْتَ ذَلِكَ؟ انْطَلِقْ فَرُدَّهُ، وَلَا تَأْخُذَنَّ إِلَّا مِثْلًا بِمِثْلٍ، فَإِنِّي كُنْتُ أَسْمَعُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «الطَّعَامُ بِالطَّعَامِ مِثْلًا بِمِثْلٍ»، قَالَ: «وَكَانَ طَعَامُنَا يَوْمَئِذٍ الشَّعِيرَ»، قِيلَ لَهُ: فَإِنَّهُ لَيْسَ بِمِثْلِهِ، قَالَ: «إِنِّي أَخَافُ أَنْ يُضَارِعَ."
      },
      {
        "id": 11645,
        "hadith_number": "4081",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Menjual Kurma Berkualiti Tinggi dengan Tukaran Kurma Campuran",
        "perawi_melayu": "Abu Hurairah dan Abu Sa'id al-Khudri (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) deputed a person from Banu 'Adi al-Ansari to collect revenue from Khaibar. He came with a fine quality of dates, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to him: Are all the dates of Khaibar like this? He said: Allah's Messenger, it is not so. We buy one sa' of (fine quality of dates) for two sa's out of total output (including even the inferior quality of dates), whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Don't do that, but like for like, or sell this (the inferior quality and receive the price) and then buy with the price of that, and that would make up the measure.",
        "malay_translation": "Rasulullah ﷺ mengutuskan seorang dari Bani 'Adi al-Ansari untuk mengumpul hasil daripada Khaibar. Dia datang dengan kurma yang berkualiti baik, kemudian Rasulullah ﷺ bersabda kepadanya: Adakah semua kurma Khaibar seperti ini? Dia menjawab: Wahai Rasulullah, tidaklah demikian. Kami membeli satu sa' (kurma berkualiti baik) dengan dua sa' daripada jumlah keseluruhan (termasuk kurma yang berkualiti rendah), maka Rasulullah ﷺ bersabda: Jangan lakukan demikian, tetapi hendaklah sama dengan sama, atau jual yang ini (kualiti rendah dan terima harganya) kemudian beli dengan harga itu, dan itu akan memenuhi sukatan.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ بِلَالٍ، عَنْ عَبْدِ الْمَجِيدِ بْنِ سُهَيْلِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيِّبِ، يُحَدِّثُ أَنَّ أَبَا هُرَيْرَةَ، وَأَبَا سَعِيدٍ، حَدَّثَاهُ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَعَثَ أَخَا بَنِي عَدِيٍّ الْأَنْصَارِيَّ، فَاسْتَعْمَلَهُ عَلَى خَيْبَرَ، فَقَدِمَ بِتَمْرٍ جَنِيبٍ، فَقَالَ لَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَكُلُّ تَمْرِ خَيْبَرَ هَكَذَا؟» قَالَ: لَا وَاللهِ يَا رَسُولَ اللهِ إِنَّا لَنَشْتَرِي الصَّاعَ بِالصَّاعَيْنِ مِنَ الْجَمْعِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَفْعَلُوا، وَلَكِنْ مِثْلًا بِمِثْلٍ، أَوْ بِيعُوا هَذَا وَاشْتَرُوا بِثَمَنِهِ مِنْ هَذَا، وَكَذَلِكَ الْمِيزَانُ»."
      },
      {
        "id": 11646,
        "hadith_number": "4082",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Menukar Kurma Berkualiti dengan Kuantiti Berbeza",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) deputed a person to collect revenue from Khaibar. He brought fine quality of dates, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Are all the dates of Khaibar like this)? He said: No. We got one sa' (of fine dates) for two sa's (of inferior dates), and (similarly) two sa's for three sa's. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Don't do that rather sell the inferior quality of dates for dirhams (money), and then buy the superior quality with the help of dirhams.",
        "malay_translation": "Rasulullah (ﷺ) mengutuskan seseorang untuk mengutip hasil dari Khaibar. Dia membawa kurma yang berkualiti tinggi, lalu Rasulullah (ﷺ) bertanya: \"Adakah semua kurma Khaibar seperti ini?\" Dia menjawab: \"Tidak. Kami mendapat satu sa' (kurma yang baik) sebagai ganti dua sa' (kurma yang kurang baik), dan (begitu juga) dua sa' sebagai ganti tiga sa'. Kemudian Rasulullah (ﷺ) bersabda: \"Jangan lakukan itu. Sebaliknya, juallah kurma yang kurang baik dengan dirham (wang), kemudian belilah kurma yang baik dengan menggunakan dirham tersebut.\"",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ عَبْدِ الْمَجِيدِ بْنِ سُهَيْلِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، وَعَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ اسْتَعْمَلَ رَجُلًا عَلَى خَيْبَرَ، فَجَاءَهُ بِتَمْرٍ جَنِيبٍ، فَقَالَ لَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَكُلُّ تَمْرِ خَيْبَرَ هَكَذَا؟»، فَقَالَ: لَا وَاللهِ يَا رَسُولَ اللهِ إِنَّا لَنَأْخُذُ الصَّاعَ مِنْ هَذَا بِالصَّاعَيْنِ، وَالصَّاعَيْنِ بِالثَّلَاثَةِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فَلَا تَفْعَلْ، بِعِ الْجَمْعَ بِالدَّرَاهِمِ، ثُمَّ ابْتَعْ بِالدَّرَاهِمِ جَنِيبًا»."
      },
      {
        "id": 11647,
        "hadith_number": "4083",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Bilal (ra) dan Pertukaran Kurma Berkualiti",
        "perawi_melayu": "Abu Sa'id (ra) meriwayatkan:",
        "english_text": "Bilal (رضی اللہ عنہ) came with fine quality of dates. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to him: From where (you have brought them)? Bilal رضی اللہ عنہ said: We had inferior quality of dates and I exchanged two sa's (of inferior quality) with one sa (of fine quality) as food for Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Woe! it is in fact usury; therefore, don't do that. But when you intend to buy dates (of superior quality), sell (the inferior quality) in a separate bargain and then buy (the superior quality). And in the hadith transmitted by Ibn Sahl there is no mention of whereupon .",
        "malay_translation": "Bilal (رضي الله عنه) datang membawa kurma berkualiti baik. Rasulullah (ﷺ) bertanya kepadanya: \"Dari mana (kamu perolehnya)?\" Bilal (رضي الله عنه) menjawab: \"Kami mempunyai kurma berkualiti rendah dan saya menukarkan dua sa' (kualiti rendah) dengan satu sa' (kualiti baik) sebagai makanan untuk Rasulullah (ﷺ), lalu Rasulullah (ﷺ) bersabda: \"Celaka! Itu sebenarnya riba; oleh itu, jangan lakukan itu. Tetapi apabila kamu ingin membeli kurma (kualiti terbaik), juallah (kualiti rendah) dalam urus niaga berasingan dan kemudian belilah (kualiti terbaik).\" Dan dalam hadis yang diriwayatkan oleh Ibn Sahl, tiada disebut perkataan 'lalu'.",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا يَحْيَى بْنُ صَالِحٍ الْوُحَاظِيُّ، حَدَّثَنَا مُعَاوِيَةُ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ، وَعَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، وَاللَّفْظُ لَهُمَا جَمِيعًا، عَنْ يَحْيَى بْنِ حَسَّانَ، حَدَّثَنَا مُعَاوِيَةُ وَهُوَ ابْنُ سَلَّامٍ، أَخْبَرَنِي يَحْيَى وَهُوَ ابْنُ أَبِي كَثِيرٍ، قَالَ: سَمِعْتُ عُقْبَةَ بْنَ عَبْدِ الْغَافِرِ، يَقُولُ: سَمِعْتُ أَبَا سَعِيدٍ، يَقُولُ: جَاءَ بِلَالٌ بِتَمْرٍ بَرْنِيٍّ، فَقَالَ لَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مِنْ أَيْنَ هَذَا؟» فَقَالَ بِلَالٌ: تَمْرٌ كَانَ عِنْدَنَا رَدِيءٌ، فَبِعْتُ مِنْهُ صَاعَيْنِ بِصَاعٍ لِمَطْعَمِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ رَسُولُ اللهِ عِنْدَ ذَلِكَ: «أَوَّهْ عَيْنُ الرِّبَا، لَا تَفْعَلْ، وَلَكِنْ إِذَا أَرَدْتَ أَنْ تَشْتَرِيَ التَّمْرَ فَبِعْهُ بِبَيْعٍ آخَرَ، ثُمَّ اشْتَرِ بِهِ»، لَمْ يَذْكُرِ ابْنُ سَهْلٍ فِي حَدِيثِهِ عِنْدَ ذَلِكَ."
      },
      {
        "id": 11648,
        "hadith_number": "4084",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Riba dalam Penjualan Kurma",
        "perawi_melayu": "Abu Sa'id (رضي الله عنه) meriwayatkan:",
        "english_text": "Dates were brought to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and he said: These dates are not like our dates, whereupon a man said: We sold two sa's of our dates (in order to get) one sa', of these (fine dates), whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: That is interest; so return (these dates of fine quality), and get your (inferior dates) ; then sell our dates (for money) and buy for us (with the help of money) such (fine dates).",
        "malay_translation": "Kurma dibawa kepada Rasulullah ﷺ, lalu baginda bersabda: \"Kurma ini tidak seperti kurma kita.\" Seorang lelaki berkata: \"Kami menjual dua *sa'* kurma kami (untuk mendapatkan) satu *sa'* kurma yang lebih baik ini.\" Lalu Rasulullah ﷺ bersabda: \"Itu adalah riba; maka pulangkanlah (kurma yang berkualiti baik) itu, dan ambillah (kurma yang kurang baik) kamu; kemudian juallah kurma kami (untuk mendapatkan wang) dan belikanlah untuk kami (dengan bantuan wang) kurma yang seperti itu (kurma yang baik).\"",
        "arabic_text": "حَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي قَزَعَةَ الْبَاهِلِيِّ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ: أُتِيَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِتَمْرٍ، فَقَالَ: «مَا هَذَا التَّمْرُ مِنْ تَمْرِنَا؟»، فَقَالَ الرَّجُلُ: يَا رَسُولَ اللهِ، بِعْنَا تَمْرَنَا صَاعَيْنِ بِصَاعٍ مِنْ هَذَا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «هذَا الرِّبَا فَرُدُّوهُ، ثُمَّ بِيعُوا تَمْرَنَا وَاشْتَرُوا لَنَا مِنْ هَذَا»."
      },
      {
        "id": 11649,
        "hadith_number": "4085",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Menjual Kurma/Gandum Berbeza Kualiti dengan Nisbah Tidak Sama",
        "perawi_melayu": "Abu Sa'id (رضي الله عنه) meriwayatkan:",
        "english_text": "We were given to eat, during the lifetime of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), dates of different qualities mixed together, and we used to sell two sa's of these for one sa, (of fine quality of dates). This reached Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), whereupon he said: There should be no exchange of two sa's of (inferior) dates for one sa (of fine dates) and two sa's of (inferior) wheat for one sa' of (fine) wheat. and one dirham for two dirharms.",
        "malay_translation": "Kami pernah diberi makan, semasa hayat Rasulullah (ﷺ), kurma daripada pelbagai kualiti yang dicampur aduk, dan kami biasa menjual dua sa' daripada kurma ini dengan satu sa' (kurma berkualiti baik). Perkara ini sampai kepada Rasulullah (ﷺ), lalu baginda bersabda: Janganlah ada pertukaran dua sa' kurma (kurang berkualiti) dengan satu sa' (kurma berkualiti baik) dan dua sa' gandum (kurang berkualiti) dengan satu sa' gandum (berkualiti baik), dan satu dirham dengan dua dirham.",
        "arabic_text": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُوسَى، عَنْ شَيْبَانَ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ: كُنَّا نُرْزَقُ تَمْرَ الْجَمْعِ عَلَى عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَهُوَ الْخِلْطُ مِنَ التَّمْرِ، فَكُنَّا نَبِيعُ صَاعَيْنِ بِصَاعٍ، فَبَلَغَ ذَلِكَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «لَا صَاعَيْ تَمْرٍ بِصَاعٍ، وَلَا صَاعَيْ حِنْطَةٍ بِصَاعٍ، وَلَا دِرْهَمَ بِدِرْهَمَيْنِ."
      },
      {
        "id": 11650,
        "hadith_number": "4086",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Penukaran Emas dan Perak serta Larangan Riba",
        "perawi_melayu": "Abu Nadra meriwayatkan:",
        "english_text": "I asked Ibn Abbas ( رضی اللہ عنہ) about the conversion (of gold and silver for silver and gold). We said: Is it hand to hand exchange? I said: Yes. whereupon he said: There is no harm in it. I informed Abu Sa'id رضی اللہ عنہ about it, telling him that I had asked Ibn 'Abbas رضی اللہ عنہ about it and he said: Is it hand to hand exchange? I said: Yes, whereupon he said: There is no harm in it. He (the narrator) said, or he said like it: We will soon write to him, and he will not give you this fatwa (religious verdict). He said: By Allah, someone of the boy-servants of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) brought dates, but he refused to accept them (on the plea) that those did not seem to be of the dates of our land. He said: Something had happened to the dates of our land, or our dates. So I got these dates (in exchange by giving) excess (of the dates of our land), whereupon he said: You made an addition for getting the fine dates (in exchange) which tantamounts, to interest; don't do that (in future). Whenever you find some doubt (as regards the deteriorating quality of) your dates, sell them, and then buy the dates that you like.",
        "malay_translation": "Saya bertanya kepada Ibnu Abbas ( رضي الله عنه) tentang penukaran (emas dan perak dengan perak dan emas). Kami berkata: Adakah ia pertukaran tangan ke tangan? Saya berkata: Ya. Maka beliau berkata: Tiada masalah padanya. Saya memaklumkan hal ini kepada Abu Sa'id رضي الله عنه, memberitahunya bahawa saya telah bertanya kepada Ibnu Abbas رضي الله عنه tentang hal itu dan beliau berkata: Adakah ia pertukaran tangan ke tangan? Saya berkata: Ya, lalu beliau berkata: Tiada masalah padanya. Beliau (periwayat) berkata, atau beliau berkata seumpamanya: Kami akan segera menulis surat kepadanya, dan beliau tidak akan memberikan fatwa (keputusan agama) ini kepada kamu. Beliau berkata: Demi Allah, seseorang daripada budak lelaki-pelayan Rasulullah (صلى الله عليه وسلم) membawa kurma, tetapi beliau enggan menerimanya (atas alasan) bahawa kurma-kurma itu kelihatan bukan daripada kurma tanah kami. Beliau berkata: Sesuatu telah berlaku pada kurma tanah kami, atau kurma kami. Maka saya mendapat kurma-kurma ini (sebagai tukaran dengan memberikan) lebih (daripada kurma tanah kami), lalu beliau berkata: Kamu telah membuat tambahan untuk mendapatkan kurma yang baik (sebagai tukaran) yang bersamaan dengan riba; jangan lakukan itu (pada masa hadapan). Apabila kamu dapati ada keraguan (berkenaan kualiti yang merosot) kurma kamu, juallah ia, dan kemudian belilah kurma yang kamu suka.",
        "arabic_text": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ سَعِيدٍ الْجُرَيْرِيِّ، عَنْ أَبِي نَضْرَةَ، قَالَ: سَأَلْتُ ابْنَ عَبَّاسٍ عَنِ الصَّرْفِ، فَقَالَ: أَيَدًا بِيَدٍ؟ قُلْتُ: نَعَمْ، قَالَ: فَلَا بَأْسَ بِهِ، فَأَخْبَرْتُ أَبَا سَعِيدٍ، فَقُلْتُ: إِنِّي سَأَلْتُ ابْنَ عَبَّاسٍ عَنِ الصَّرْفِ، فَقَالَ: أَيَدًا بِيَدٍ؟ قُلْتُ: نَعَمْ، قَالَ: فَلَا بَأْسَ بِهِ، قَالَ: أَوَ قَالَ ذَلِكَ؟ إِنَّا سَنَكْتُبُ إِلَيْهِ فَلَا يُفْتِيكُمُوهُ، قَالَ: فَوَاللهِ لَقَدْ جَاءَ بَعْضُ فِتْيَانِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِتَمْرٍ، فَأَنْكَرَهُ، فَقَالَ: «كَأَنَّ هَذَا لَيْسَ مِنْ تَمْرِ أَرْضِنَا» قَالَ: كَانَ فِي تَمْرِ أَرْضِنَا، أَوْ فِي تَمْرِنَا الْعَامَ بَعْضُ الشَّيْءِ، فَأَخَذْتُ هَذَا وَزِدْتُ بَعْضَ الزِّيَادَةِ، فَقَالَ: «أَضْعَفْتَ، أَرْبَيْتَ، لَا تَقْرَبَنَّ هَذَا، إِذَا رَابَكَ مِنْ تَمْرِكَ شَيْءٌ فَبِعْهُ، ثُمَّ اشْتَرِ الَّذِي تُرِيدُ مِنَ التَّمْرِ»."
      },
      {
        "id": 11651,
        "hadith_number": "4087",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Riba dalam Pertukaran Emas dan Kurma",
        "perawi_melayu": "Abu Nadra meriwayatkan:",
        "english_text": "I asked Ibn Umar and Ibn Abbas (رضی اللہ عنہ) about the conversion of gold with gold but they did not find any harm in that. I was sitting in the company of Abd Sa'id al-Khudri (رضی اللہ عنہ) and asked him about this exchange, and he said: Whatever is addition is an' interest. I refused to accept it on account of their statement (statement of Ibn 'Abbas and Ibn 'Umar رضی اللہ عنہ ). He said: I am not narrating to you except what I heard from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). There came to him the owner of a date-palm with one sa' of fine dates, and the dates of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) were of that colour. Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to him: Where did you get these dates? I went with two sa's of (inferior dates) and bought one sa' of (these fine dates), for that is the prevailing price (of inferior dates) in the market and that is the price (of the fine quality of dates in the market), whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Woe be upon you! You have dealt in interest, when you decide to do it (i.e. exchange superior quality of dates for inferior quality); so you should sell your dates for another commodity (or currency) and then with the help of that commodity buy the dates you like. Abu Sa'ad رضی اللہ عنہ said: When dates are exchanged for dates (with different qualities) there is the possibility (of the element of) interest (creeping into that) or when gold is exchanged for gold having different qualities. I subsequently came to Ibn 'Umar رضی اللہ عنہ and he forbade me (to do it), but I did not come to Ibn 'Abbas (رضی اللہ عنہ). He (the narrator) said: Abu as-Sahba' narrated to me: He asked Ibn Abbas (رضی اللہ عنہ) in Mecca, and he too disapproved of it.",
        "malay_translation": "Saya bertanya kepada Ibnu Umar dan Ibnu Abbas (رضی اللہ عنہ) tentang pertukaran emas dengan emas, tetapi mereka tidak melihat sebarang kemudaratan dalam hal itu. Saya sedang duduk bersama Abd Sa'id al-Khudri (رضی اللہ عنہ) dan bertanya kepadanya tentang pertukaran ini, dan dia berkata: Apa sahaja tambahan adalah riba. Saya enggan menerimanya kerana kenyataan mereka (kenyataan Ibnu Abbas dan Ibnu Umar رضی اللہ عنہ). Dia berkata: Saya tidak meriwayatkan kepada kamu kecuali apa yang saya dengar daripada Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). Datanglah kepada baginda pemilik pokok kurma dengan satu sa' kurma yang berkualiti, dan kurma Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) berwarna seperti itu. Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) berkata kepadanya: Dari mana kamu dapatkan kurma ini? Saya pergi dengan dua sa' (kurma yang kurang berkualiti) dan membeli satu sa' (kurma yang berkualiti ini), kerana itulah harga pasaran (kurma yang kurang berkualiti) dan itulah harga (kurma yang berkualiti tinggi di pasaran), kemudian Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Celakalah kamu! Kamu telah berurusan dengan riba, apabila kamu memutuskan untuk melakukannya (iaitu menukar kurma berkualiti tinggi dengan kurma berkualiti rendah); jadi, kamu harus menjual kurmamu dengan komoditi lain (atau mata wang) dan kemudian dengan bantuan komoditi itu membeli kurma yang kamu suka. Abu Sa'ad رضی اللہ عنہ berkata: Apabila kurma ditukar dengan kurma (dengan kualiti yang berbeza) ada kemungkinan (unsur) riba (merayap ke dalamnya) atau apabila emas ditukar dengan emas yang mempunyai kualiti yang berbeza. Saya kemudiannya datang kepada Ibnu Umar رضی اللہ عنہ dan dia melarang saya (melakukannya), tetapi saya tidak datang kepada Ibnu Abbas (رضی اللہ عنہ). Dia (perawi) berkata: Abu as-Sahba' meriwayatkan kepada saya: Dia bertanya kepada Ibnu Abbas (رضی اللہ عنہ) di Mekah, dan dia juga tidak menyetujuinya.",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الْأَعْلَى، أَخْبَرَنَا دَاوُدُ، عَنْ أَبِي نَضْرَةَ، قَالَ: سَأَلْتُ ابْنَ عُمَرَ، وَابْنَ عَبَّاسٍ عَنِ الصَّرْفِ، فَلَمْ يَرَيَا بِهِ بَأْسًا، فَإِنِّي لَقَاعِدٌ عِنْدَ أَبِي سَعِيدٍ الْخُدْرِيِّ، فَسَأَلْتُهُ عَنِ الصَّرْفِ، فَقَالَ: مَا زَادَ فَهُوَ رِبًا، فَأَنْكَرْتُ ذَلِكَ لِقَوْلِهِمَا، فَقَالَ: لَا أُحَدِّثُكَ إِلَّا مَا سَمِعْتُ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: جَاءَهُ صَاحِبُ نَخْلِهِ بِصَاعٍ مِنْ تَمْرٍ طَيِّبٍ، وَكَانَ تَمْرُ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ هَذَا اللَّوْنَ، فَقَالَ لَهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَنَّى لَكَ هَذَا؟» قَالَ: انْطَلَقْتُ بِصَاعَيْنِ فَاشْتَرَيْتُ بِهِ هَذَا الصَّاعَ، فَإِنَّ سِعْرَ هَذَا فِي السُّوقِ كَذَا، وَسِعْرَ هَذَا كَذَا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «وَيْلَكَ، أَرْبَيْتَ، إِذَا أَرَدْتَ ذَلِكَ، فَبِعْ تَمْرَكَ بِسِلْعَةٍ، ثُمَّ اشْتَرِ بِسِلْعَتِكَ أَيَّ تَمْرٍ شِئْتَ»، قَالَ أَبُو سَعِيدٍ: «فَالتَّمْرُ بِالتَّمْرِ أَحَقُّ أَنْ يَكُونَ رِبًا، أَمِ الْفِضَّةُ بِالْفِضَّةِ؟»، قَالَ: فَأَتَيْتُ ابْنَ عُمَرَ بَعْدُ فَنَهَانِي، وَلَمْ آتِ ابْنَ عَبَّاسٍ، قَالَ: فَحَدَّثَنِي أَبُو الصَّهْبَاءِ، أَنَّهُ سَأَلَ ابْنَ عَبَّاسٍ عَنْهُ بِمَكَّةَ فَكَرِهَهُ."
      },
      {
        "id": 11652,
        "hadith_number": "4088",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Riba dalam Pertukaran Mata Wang Emas dan Perak",
        "perawi_melayu": "Abu Salih meriwayatkan:",
        "english_text": "I heard Abu Sa'id al-Khudri (رضی اللہ عنہ) said: Dinar (gold) for gold and dirham for dirham can be (exchanged) with equal for equal; but he who gives more or demands more in fact deals in interest. I said to him: Ibn 'Abbas (رضی اللہ عنہ) says otherwise, whereupon he said: I met Ibn 'Abbas (رضی اللہ عنہ) and said: Do you see what you say; have you heard it from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), or found it in the Book of Allah, the Glorious and Majestic? He said: I did not hear it from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). and I did not find it in the Book of Allah (Glorious and Majestic), but Usama bin Zaid رضی اللہ عنہ narrated it to me that Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: There can be an element of interest in credit.",
        "malay_translation": "Saya mendengar Abu Sa'id al-Khudri (رضي الله عنه) berkata: Dinar (emas) dengan dinar dan dirham dengan dirham boleh ditukar dengan sama banyak; tetapi sesiapa yang memberi lebih atau meminta lebih, sesungguhnya dia terlibat dalam riba. Saya berkata kepadanya: Ibnu 'Abbas (رضي الله عنه) berkata sebaliknya, lalu dia berkata: Saya bertemu dengan Ibnu 'Abbas (رضي الله عنه) dan berkata: Adakah kamu melihat apa yang kamu katakan; adakah kamu mendengarnya daripada Rasulullah (صلى الله عليه وسلم), atau menjumpainya dalam Kitab Allah, Yang Maha Agung dan Maha Mulia? Dia berkata: Saya tidak mendengarnya daripada Rasulullah (صلى الله عليه وسلم). dan saya tidak menjumpainya dalam Kitab Allah (Yang Maha Agung dan Maha Mulia), tetapi Usama bin Zaid رضي الله عنه meriwayatkannya kepada saya bahawa Rasulullah (صلى الله عليه وسلم) bersabda: Boleh jadi terdapat unsur riba dalam kredit.",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبَّادٍ، وَمُحَمَّدُ بْنُ حَاتِمٍ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ، وَاللَّفْظُ لِابْنِ عَبَّادٍ، قَالَ: حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ أَبِي صَالِحٍ، قَالَ: سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ: الدِّينَارُ بِالدِّينَارِ، وَالدِّرْهَمُ بِالدِّرْهَمِ، مِثْلًا بِمِثْلٍ، مَنْ زَادَ، أَوِ ازْدَادَ، فَقَدْ أَرْبَى، فَقُلْتُ لَهُ: إِنَّ ابْنَ عَبَّاسٍ، يَقُولُ غَيْرَ هَذَا، فَقَالَ: لَقَدْ لَقِيتُ ابْنَ عَبَّاسٍ، فَقُلْتُ: أَرَأَيْتَ هَذَا الَّذِي تَقُولُ؟ أَشَيْءٌ سَمِعْتَهُ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَوْ وَجَدْتَهُ فِي كِتَابِ اللهِ عَزَّ وَجَلَّ، فَقَالَ: لَمْ أَسْمَعْهُ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَلَمْ أَجِدْهُ فِي كِتَابِ اللهِ، وَلَكِنْ حَدَّثَنِي أُسَامَةُ بْنُ زَيْدٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الرِّبَا فِي النَّسِيئَةِ»."
      },
      {
        "id": 11653,
        "hadith_number": "4089",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Unsur Riba dalam Kredit",
        "perawi_melayu": "Ubaidullah bin Abu Yazid mendengar Ibn 'Abbas (رضی اللہ عنہ) berkata: Usama bin Zaid (رضی اللہ عنہ) meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There can be an element of interest in credit (when the payment is not equal).",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Boleh jadi terdapat unsur riba dalam kredit (apabila bayaran tidak sama).",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ، وَاللَّفْظُ لِعَمْرٍو، قَالَ إِسْحَاقُ: أَخْبَرَنَا، وَقَالَ الْآخَرُونَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عُبَيْدِ اللهِ بْنِ أَبِي يَزِيدَ، أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ، يَقُولُ: أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «إِنَّمَا الرِّبَا فِي النَّسِيئَةِ»."
      },
      {
        "id": 11654,
        "hadith_number": "4090",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Tiada Unsur Riba dalam Pertukaran Langsung",
        "perawi_melayu": "Ibn 'Abbas (رضي الله عنه) meriwayatkan daripada Usama bin Zaid رضي الله عنه :",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as having said this: There is no element of interest when the money or commodity is exchanged hand to hand.",
        "malay_translation": "Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: “Tiada unsur riba apabila wang atau komoditi ditukarkan secara langsung, dari tangan ke tangan.”",
        "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَفَّانُ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، قَالَا: حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا رِبًا فِيمَا كَانَ يَدًا بِيَدٍ»."
      },
      {
        "id": 11655,
        "hadith_number": "4091",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Riba dalam Urusan Kredit",
        "perawi_melayu": "Ata' bin Abu Rabah meriwayatkan:",
        "english_text": "Abu Sa'id al-Khudri ( رضی اللہ عنہ) met Ibn 'Abbas (رضی اللہ عنہ) and said to him: What do you say in regard to the conversion (of commodities or money) did you hear it from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), or is it something which you found In Allah's Book, Majestic and Glorious? Thereupon Ibn Abbas ( رضی اللہ عنہ) said: I don't say that. So far at Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) is concerned, you know him better, and to far as the Book of Allah to concerned, I do not know it (more than you do), but 'Usama bin Zaid ( رضی اللہ عنہ) narrated to me Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as having said this: Beware, there can be an element of interest in credit.",
        "malay_translation": "Abu Sa'id al-Khudri (رضي الله عنه) bertemu dengan Ibn 'Abbas (رضي الله عنه) dan berkata kepadanya: Apakah pendapatmu mengenai penukaran (barang atau wang)? Adakah kamu mendengarnya daripada Rasulullah (صلى الله عليه وسلم), atau adakah ia sesuatu yang kamu dapati di dalam Kitab Allah, Maha Agung lagi Maha Mulia? Lalu Ibn Abbas (رضي الله عنه) berkata: Saya tidak mengatakan sedemikian. Sejauh yang berkaitan dengan Rasulullah (صلى الله عليه وسلم), kamu lebih mengenali baginda, dan sejauh yang berkaitan dengan Kitab Allah, saya tidak mengetahuinya (lebih daripada kamu), tetapi 'Usama bin Zaid (رضي الله عنه) meriwayatkan kepadaku bahawa Rasulullah (صلى الله عليه وسلم) bersabda: Awas, mungkin terdapat unsur riba dalam kredit.",
        "arabic_text": "حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى، حَدَّثَنَا هِقْلٌ، عَنِ الْأَوْزَاعِيِّ، قَالَ: حَدَّثَنِي عَطَاءُ بْنُ أَبِي رَبَاحٍ، أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ، لَقِيَ ابْنَ عَبَّاسٍ، فَقَالَ لَهُ: أَرَأَيْتَ قَوْلَكَ فِي الصَّرْفِ، أَشَيْئًا سَمِعْتَهُ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، أَمْ شَيْئًا وَجَدْتَهُ فِي كِتَابِ اللهِ عَزَّ وَجَلَّ؟ فَقَالَ ابْنُ عَبَّاسٍ: كَلَّا، لَا أَقُولُ أَمَّا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَنْتُمْ أَعْلَمُ بِهِ، وَأَمَّا كِتَابُ اللهِ فَلَا أَعْلَمُهُ، وَلَكِنْ حَدَّثَنِي أُسَامَةُ بْنُ زَيْدٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «أَلَا إِنَّمَا الرِّبَا فِي النَّسِيئَةِ»."
      },
      {
        "id": 11656,
        "hadith_number": "4092",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kutukan ke Atas Penerima dan Pemberi Riba",
        "perawi_melayu": "Abdullah (bin Mas'ud) (رضی اللہ عنہ) berkata:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) cursed the one who accepted interest and the one who paid it I asked about the one who recorded it, and two witnesses to it. He (the narrator) said: We narrate what we have heard.",
        "malay_translation": "Rasulullah (ﷺ) melaknat orang yang menerima riba dan orang yang membayarnya. Aku bertanya tentang orang yang mencatatnya, dan dua orang saksi mengenainya. Beliau (perawi) berkata: Kami meriwayatkan apa yang telah kami dengar.",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَاللَّفْظُ لِعُثْمَانَ، قَالَ إِسْحَاقُ: أَخْبَرَنَا، وَقَالَ عُثْمَانُ: حَدَّثَنَا جَرِيرٌ، عَنْ مُغِيرَةَ، قَالَ: سَأَلَ شِبَاكٌ إِبْرَاهِيمَ، فَحَدَّثَنَا عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللهِ، قَالَ: «لَعَنَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ آكِلَ الرِّبَا وَمُؤْكِلَهُ»، قَالَ: قُلْتُ: وَكَاتِبَهُ، وَشَاهِدَيْهِ؟ قَالَ: «إِنَّمَا نُحَدِّثُ بِمَا سَمِعْنَا»."
      },
      {
        "id": 11657,
        "hadith_number": "4093",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah ﷺ Melaknat Peniaga Riba dan Saksi-saksinya",
        "perawi_melayu": "Jabir رضي الله عنه berkata:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) cursed the accepter of interest and its payer, and one who records it, and the two witnesses, and he said: They are all equal.",
        "malay_translation": "Rasulullah ﷺ melaknat penerima riba, pembayar riba, penulisnya, dan dua orang saksi. Baginda bersabda: Mereka semua adalah sama.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، وَزُهَيْرُ بْنُ حَرْبٍ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، قَالُوا: حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ: «لَعَنَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ آكِلَ الرِّبَا، وَمُؤْكِلَهُ، وَكَاتِبَهُ، وَشَاهِدَيْهِ»، وَقَالَ: «هُمْ سَوَاءٌ»."
      },
      {
        "id": 11658,
        "hadith_number": "4094",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kejelasan Perkara Halal dan Haram serta Amaran Terhadap Perkara Syubhah",
        "perawi_melayu": "Nu'man bin Bashir (رضي الله عنه) meriwayatkan:",
        "english_text": "I heard Allah's Messenger (ﷺ) as having said this (and Nu'man) pointed towards his ears with his fingers): What is lawful is evident and what is unlawful is evident, and in between them are the things doubtful which many people do not know. So he who guards against doubtful things keeps his religion and honour blameless, and he who indulges in doubtful things indulges in fact in unlawful things, just as a shepherd who pastures his animals round a preserve will soon pasture them in it. Beware, every king has a preserve, and the things God his declaced unlawful are His preserves. Beware, in the body there is a piece of flesh; if it is sound, the whole body is sound and if it is corrupt the whole body is corrupt, and hearken it is the heart.",
        "malay_translation": "Saya mendengar Rasulullah (ﷺ) bersabda (dan Nu'man menunjuk ke telinganya dengan jari-jarinya): Apa yang halal itu jelas dan apa yang haram itu jelas, dan di antara keduanya ada perkara syubhah (meragukan) yang ramai manusia tidak mengetahuinya. Maka sesiapa yang menjaga diri daripada perkara syubhah, maka sesungguhnya dia telah menjaga agama dan kehormatannya, dan sesiapa yang terjebak dalam perkara syubhah, sesungguhnya dia telah terjebak ke dalam perkara haram, seumpama seorang penggembala yang menggembalakan haiwannya di sekitar kawasan larangan, hampir-hampir dia akan menggembalakannya di dalamnya. Ketahuilah, setiap raja mempunyai kawasan larangannya, dan perkara yang Allah haramkan adalah kawasan larangan-Nya. Ketahuilah, di dalam jasad itu terdapat seketul daging; jika ia baik, maka baiklah seluruh jasad; dan jika ia rosak, maka rosaklah seluruh jasad; ketahuilah, ia adalah hati.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ الْهَمْدَانِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا زَكَرِيَّاءُ، عَنِ الشَّعْبِيِّ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، قَالَ: سَمِعْتُهُ يَقُولُ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: - وَأَهْوَى النُّعْمَانُ بِإِصْبَعَيْهِ إِلَى أُذُنَيْهِ - «إِنَّ الْحَلَالَ بَيِّنٌ، وَإِنَّ الْحَرَامَ بَيِّنٌ، وَبَيْنَهُمَا مُشْتَبِهَاتٌ لَا يَعْلَمُهُنَّ كَثِيرٌ مِنَ النَّاسِ، فَمَنِ اتَّقَى الشُّبُهَاتِ اسْتَبْرَأَ لِدِينِهِ، وَعِرْضِهِ، وَمَنْ وَقَعَ فِي الشُّبُهَاتِ وَقَعَ فِي الْحَرَامِ، كَالرَّاعِي يَرْعَى حَوْلَ الْحِمَى، يُوشِكُ أَنْ يَرْتَعَ فِيهِ، أَلَا وَإِنَّ لِكُلِّ مَلِكٍ حِمًى، أَلَا وَإِنَّ حِمَى اللهِ مَحَارِمُهُ، أَلَا وَإِنَّ فِي الْجَسَدِ مُضْغَةً، إِذَا صَلَحَتْ، صَلَحَ الْجَسَدُ كُلُّهُ، وَإِذَا فَسَدَتْ، فَسَدَ الْجَسَدُ كُلُّهُ، أَلَا وَهِيَ الْقَلْبُ."
      },
      {
        "id": 11659,
        "hadith_number": "4095",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadith dengan Sanad yang Sama",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "This hadith has been narrated on the authority of Zakariya with the same chain of transmitters.",
        "malay_translation": "Hadith ini telah diriwayatkan daripada Zakariya dengan sanad perawi yang sama.",
        "arabic_text": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، قَالَا: حَدَّثَنَا زَكَرِيَّاءُ، بِهَذَا الْإِسْنَادِ مِثْلَهُ."
      },
      {
        "id": 11660,
        "hadith_number": "4096",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Riwayat Al-Nu'man bin Bashir (RA) dan Perbezaan Panjang Hadith",
        "perawi_melayu": "Al-Nu'man bin Bashir (RA)",
        "english_text": "AI-Nu'man bin Bashir reported it from Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). The hadith narrated by Zakariya is, however, more complete and lengthy than the other ones.",
        "malay_translation": "Al-Nu'man bin Bashir meriwayatkannya daripada Rasulullah SAW. Hadith yang diriwayatkan oleh Zakariya, bagaimanapun, adalah lebih lengkap dan panjang daripada yang lain.",
        "arabic_text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنْ مُطَرِّفٍ، وَأَبِي، فَرْوَةَ الْهَمْدَانِيِّ ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ - عَنِ ابْنِ عَجْلاَنَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَعِيدٍ، كُلُّهُمْ عَنِ الشَّعْبِيِّ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا الْحَدِيثِ غَيْرَ أَنَّ حَدِيثَ زَكَرِيَّاءَ أَتَمُّ مِنْ حَدِيثِهِمْ وَأَكْثَرُ.‏"
      },
      {
        "id": 11661,
        "hadith_number": "4097",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kehalalan dan Keharaman yang Jelas",
        "perawi_melayu": "Daripada Amir Ash-Shabi, bahawa:",
        "english_text": "He heard An-Nu'man bin Bashir bin Sa'd, a Companion of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was heard delivering a sermon at Him and was saying: I heard Allah's Messenger (ﷺ) as saying: The lawful is evident and the unlawful is evident, the rest of the hadith is the same as related by Zakariya.",
        "malay_translation": "Beliau mendengar An-Nu'man bin Bashir bin Sa'd, seorang Sahabat Rasulullah (ﷺ) menyampaikan khutbah di hadapannya, sambil berkata: Aku mendengar Rasulullah (ﷺ) bersabda: Yang halal itu jelas dan yang haram itu jelas, selebihnya hadis ini adalah sama seperti yang diriwayatkan oleh Zakariya.",
        "arabic_text": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي خَالِدُ، بْنُ يَزِيدَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي هِلاَلٍ، عَنْ عَوْنِ بْنِ عَبْدِ اللَّهِ، عَنْ عَامِرٍ الشَّعْبِيِّ، أَنَّهُ سَمِعَ نُعْمَانَ بْنَ بَشِيرِ بْنِ سَعْدٍ، صَاحِبَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ يَخْطُبُ النَّاسَ بِحِمْصَ وَهُوَ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ ‏ الْحَلاَلُ بَيِّنٌ وَالْحَرَامُ بَيِّنٌ ‏ ‏ ‏.‏ فَذَكَرَ بِمِثْلِ حَدِيثِ زَكَرِيَّاءَ عَنِ الشَّعْبِيِّ إِلَى قَوْلِهِ ‏ ‏ يُوشِكُ أَنْ يَقَعَ فِيهِ.‏"
      },
      {
        "id": 11662,
        "hadith_number": "4098",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Unta yang Dijadikan Lebih Baik oleh Rasulullah ﷺ",
        "perawi_melayu": "Jabir bin 'Abdullah (رضي اﷲ عنہ) meriwayatkan:",
        "english_text": "He was travelling on his camel which had grown jaded, and he decided to let it off. When Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) met him and prayed for him and struck it, so it trotted as it had never trotted before. He said: Sell it to me for an 'uqaya. I said: No. He again said: Sell it to me. So I sold it to him for an 'uqaya, but made the stipulation that I should be allowed to ride back to my family. Then when I came to (my place) I took the camel to him and he paid me its price in ready money. I then went back and he sent: (someone) behind me (and as I came) he said: Do you see that I asked you to reduce price for buying your camel. Take your camel and your coins; these are yours.",
        "malay_translation": "Beliau sedang mengembara dengan untanya yang telah menjadi lesu, lalu beliau memutuskan untuk melepaskannya. Apabila Rasulullah ﷺ bertemu dengannya dan berdoa untuknya serta memukulnya, maka unta itu berjalan seperti yang tidak pernah dialaminya sebelum ini. Baginda bersabda: \"Jualkan unta itu kepadaku dengan harga satu 'uqaya.\" Aku berkata: \"Tidak.\" Baginda berkata lagi: \"Jualkan unta itu kepadaku.\" Maka aku menjualnya kepadanya dengan harga satu 'uqaya, tetapi membuat syarat bahawa aku dibenarkan menunggangnya kembali ke keluargaku. Kemudian apabila aku sampai (ke tempatku), aku membawa unta itu kepadanya dan baginda membayar harga unta itu dengan wang tunai. Kemudian aku kembali dan baginda menghantar (seseorang) di belakangku (dan apabila aku datang) baginda berkata: \"Adakah kamu nampak aku meminta kamu mengurangkan harga untuk membeli untamu? Ambillah untamu dan duit syilingmu; ini adalah milikmu.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا زَكَرِيَّاءُ، عَنْ عَامِرٍ، حَدَّثَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ، أَنَّهُ كَانَ يَسِيرُ عَلَى جَمَلٍ لَهُ قَدْ أَعْيَا فَأَرَادَ أَنْ يُسَيِّبَهُ قَالَ فَلَحِقَنِي النَّبِيُّ صلى الله عليه وسلم فَدَعَا لِي وَضَرَبَهُ فَسَارَ سَيْرًا لَمْ يَسِرْ مِثْلَهُ قَالَ ‏ ‏ بِعْنِيهِ بِوُقِيَّةٍ ‏ ‏ ‏.‏ قُلْتُ لاَ ‏.‏ ثُمَّ قَالَ ‏ ‏ بِعْنِيهِ ‏ ‏ ‏.‏ فَبِعْتُهُ بِوُقِيَّةٍ وَاسْتَثْنَيْتُ عَلَيْهِ حُمْلاَنَهُ إِلَى أَهْلِي فَلَمَّا بَلَغْتُ أَتَيْتُهُ بِالْجَمَلِ فَنَقَدَنِي ثَمَنَهُ ثُمَّ رَجَعْتُ فَأَرْسَلَ فِي أَثَرِي فَقَالَ ‏ ‏ أَتُرَانِي مَاكَسْتُكَ لآخُذَ جَمَلَكَ خُذْ جَمَلَكَ وَدَرَاهِمَكَ فَهُوَ لَكَ.‏"
      },
      {
        "id": 11663,
        "hadith_number": "4099",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Riwayat Hadith Melalui Sanad Lain",
        "perawi_melayu": "Tiada (Riwayat ini diriwayatkan melalui sanad lain)",
        "english_text": "This hadith has been narrated on the authority of Jabir through another chain of transmitters.",
        "malay_translation": "Hadith ini telah diriwayatkan daripada Jabir melalui rantaian perawi yang lain.",
        "arabic_text": "وَحَدَّثَنَاهُ عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عِيسَى، - يَعْنِي ابْنَ يُونُسَ - عَنْ زَكَرِيَّاءَ، عَنْ عَامِرٍ، حَدَّثَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ، بِمِثْلِ حَدِيثِ ابْنِ نُمَيْرٍ.‏"
      },
      {
        "id": 11664,
        "hadith_number": "4100",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Unta yang Sembuh dan Perkahwinan Jabir",
        "perawi_melayu": "Jabir bin 'Abdullah (رضي اﷲ عنہ) meriwayatkan:",
        "english_text": "I went on an expedition with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). He overtook me and I was on a water-carrying camel who had grown tired and did not walk (trot). He (the Holy Prophet) said to me: What is the matter with your camel? I said: It is sick. He (the Holy Prophet) stepped behind and drove it and prayed for it, and then it always moved ahead of other camels. He (then) said: How do you find your camel? I said: It is, by the grace of your prayer, all right. He said: Would you sell this (camel) to me? I felt shy (to say him, No ) as we had no other camel for carrying water, but (later on) I said: Yes, and to I sold it to him on the condition that (I would be permitted) to ride it until I reached Madina. I said to him: Allah's Messenger, I am newly married, so I asked his permission (to go ahead of the caravan). He permitted me, and I reached Medina well in advance of other people, until I reached my destination. There my maternal uncle met me and asked me about the camel, and I told him what I had done with regard to it. He reproved me in this connection. He (Jabir) said: When I asked his permission (to go ahead of the caravan) Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) inquired of me whether I had married a virgin or a non-virgin. I said to him: I have married a non-virgin. He said: Why did you not marry a virgin who would have played with you and you would have played with her? I said to him: Allah's Messenger, my father died (or he fell as a martyr), and I have small sisters to (look after), so I did not like the idea that I should marry a woman who is like them and thus be not able to teach them manners and look after them properly. So I have married a non-virgin so that she should be able to look after them and teach them manners, When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came to Medina, I went to him in the morning with the camel. He paid me its price and returned that (the camel) to me.",
        "malay_translation": "Saya keluar dalam satu ekspedisi bersama Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). Baginda memintas saya dan saya menunggang unta pembawa air yang telah letih dan tidak berjalan (berjalan dengan perlahan). Baginda (Rasulullah) bertanya kepada saya: Apakah masalah dengan unta kamu? Saya menjawab: Ia sakit. Baginda (Rasulullah) melangkah ke belakang dan memandunya serta mendoakannya, dan kemudian ia sentiasa bergerak ke hadapan unta-unta lain. Baginda (kemudian) bertanya: Bagaimana keadaan unta kamu? Saya menjawab: Ia baik, dengan rahmat doa daripada kamu. Baginda berkata: Adakah kamu akan menjual (unta) ini kepada saya? Saya berasa malu (untuk berkata, Tidak ) kerana kami tidak mempunyai unta lain untuk membawa air, tetapi (kemudian) saya berkata: Ya, dan saya menjualnya kepada baginda dengan syarat (saya dibenarkan) untuk menunggangnya sehingga saya sampai ke Madinah. Saya berkata kepada baginda: Wahai Rasulullah, saya baru berkahwin, jadi saya meminta izin daripada baginda (untuk mendahului kafilah). Baginda memberi izin kepada saya, dan saya sampai ke Madinah lebih awal daripada orang lain, sehingga saya sampai ke destinasi saya. Di sana bapa saudara sebelah ibu saya berjumpa dengan saya dan bertanya tentang unta itu, dan saya menceritakan kepadanya apa yang telah saya lakukan berkenaan dengannya. Dia menegur saya mengenai perkara ini. Beliau (Jabir) berkata: Apabila saya meminta izin (untuk mendahului kafilah) Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) bertanya kepada saya sama ada saya telah mengahwini seorang dara atau bukan dara. Saya berkata kepada baginda: Saya telah mengahwini bukan dara. Baginda berkata: Mengapa kamu tidak mengahwini seorang dara yang akan bermain dengan kamu dan kamu akan bermain dengannya? Saya berkata kepada baginda: Wahai Rasulullah, ayah saya telah meninggal dunia (atau beliau gugur sebagai syahid), dan saya mempunyai adik perempuan yang masih kecil untuk (menjaga), jadi saya tidak suka idea bahawa saya harus mengahwini seorang wanita yang seperti mereka dan dengan itu tidak dapat mengajar mereka adab dan menjaga mereka dengan betul. Jadi saya telah mengahwini bukan dara supaya dia dapat menjaga mereka dan mengajar mereka adab, Apabila Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) tiba di Madinah, saya pergi berjumpa baginda pada waktu pagi dengan unta itu. Baginda membayar harga unta itu kepada saya dan memulangkannya (unta itu) kepada saya.",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لِعُثْمَانَ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ، عُثْمَانُ حَدَّثَنَا جَرِيرٌ، عَنْ مُغِيرَةَ، عَنِ الشَّعْبِيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَتَلاَحَقَ بِي وَتَحْتِي نَاضِحٌ لِي قَدْ أَعْيَا وَلاَ يَكَادُ يَسِيرُ قَالَ فَقَالَ لِي ‏ ‏ مَا لِبَعِيرِكَ ‏ ‏ ‏.‏ قَالَ قُلْتُ عَلِيلٌ - قَالَ - فَتَخَلَّفَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَزَجَرَهُ وَدَعَا لَهُ فَمَازَالَ بَيْنَ يَدَىِ الإِبِلِ قُدَّامَهَا يَسِيرُ ‏.‏ قَالَ فَقَالَ لِي ‏ ‏ كَيْفَ تَرَى بَعِيرَكَ ‏ ‏ ‏.‏ قَالَ قُلْتُ بِخَيْرٍ قَدْ أَصَابَتْهُ بَرَكَتُكَ ‏.‏ قَالَ ‏ ‏ أَفَتَبِيعُنِيهِ ‏ ‏ ‏.‏ فَاسْتَحْيَيْتُ وَلَمْ يَكُنْ لَنَا نَاضِحٌ غَيْرُهُ قَالَ فَقُلْتُ نَعَمْ ‏.‏ فَبِعْتُهُ إِيَّاهُ عَلَى أَنَّ لِي فَقَارَ ظَهْرِهِ حَتَّى أَبْلُغَ الْمَدِينَةَ - قَالَ - فَقُلْتُ لَهُ يَا رَسُولَ اللَّهِ إِنِّي عَرُوسٌ فَاسْتَأْذَنْتُهُ فَأَذِنَ لِي فَتَقَدَّمْتُ النَّاسَ إِلَى الْمَدِينَةِ حَتَّى انْتَهَيْتُ فَلَقِيَنِي خَالِي فَسَأَلَنِي عَنِ الْبَعِيرِ فَأَخْبَرْتُهُ بِمَا صَنَعْتُ فِيهِ فَلاَمَنِي فِيهِ - قَالَ - وَقَدْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ لِي حِينَ اسْتَأْذَنْتُهُ ‏ ‏ مَا تَزَوَّجْتَ أَبِكْرًا أَمْ ثَيِّبًا ‏ ‏ ‏.‏ فَقُلْتُ لَهُ تَزَوَّجْتُ ثَيِّبًا ‏.‏ قَالَ ‏ ‏ أَفَلاَ تَزَوَّجْتَ بِكْرًا تُلاَعِبُكَ وَتُلاَعِبُهَا ‏ ‏ ‏.‏ فَقُلْتُ لَهُ يَا رَسُولَ اللَّهِ تُوُفِّيَ وَالِدِي - أَوِ اسْتُشْهِدَ - وَلِي أَخَوَاتٌ صِغَارٌ فَكَرِهْتُ أَنْ أَتَزَوَّجَ إِلَيْهِنَّ مِثْلَهُنَّ فَلاَ تُؤَدِّبُهُنَّ وَلاَ تَقُومُ عَلَيْهِنَّ فَتَزَوَّجْتُ ثَيِّبًا لِتَقُومَ عَلَيْهِنَّ وَتُؤَدِّبَهُنَّ - قَالَ - فَلَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ غَدَوْتُ إِلَيْهِ بِالْبَعِيرِ فَأَعْطَانِي ثَمَنَهُ وَرَدَّهُ عَلَىَّ ‏.‏"
      },
      {
        "id": 11665,
        "hadith_number": "4101",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Nabi SAW Membeli Unta Jabir RA dan Memberi Tambahan",
        "perawi_melayu": "Jabir رضي الله عنه meriwayatkan:",
        "english_text": "We went from Mecca to Medina with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) when my camel fell ill, and the rest of the hadith is the same. (But it in also narrated in it: ) He (the Holy Prophet) said to me: Sell your camel to me. I said: No, but it is yours. He said: No. (it can't be), but sell it to me. I said: No, but, Allah's Messenger, it is yours. He said: No, it can't be, but sell it to me. I said: Then give me an 'uqaya of gold for I owe that to a person and then it would be yours. He (the Holy Prophet) said: I take it (for an 'uqiya of gold) and you reach Medina on it. As I reached Medina, Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to Bilal رضی اللہ عنہ : Give him an 'uqiya of gold and make some extra payment too. He (Jabir) said: He gave me an 'uqiya of gold and made an addition of a qirat. He (Jabir) said: The addition made by Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) was with me (as a sacred trust for belssing) and lay with me in a pocket until the people of Syria took it on the Day of Harra.",
        "malay_translation": "Kami pergi dari Mekah ke Madinah bersama Rasulullah ﷺ ketika unta saya sakit, dan selebihnya hadis adalah sama. (Tetapi ia juga diriwayatkan di dalamnya:) Baginda (Nabi SAW) berkata kepada saya: Jual untamu kepada saya. Saya berkata: Tidak, tetapi ia adalah milikmu. Baginda berkata: Tidak. (Ia tidak boleh), tetapi jualkan ia kepada saya. Saya berkata: Tidak, tetapi, wahai Rasulullah, ia adalah milikmu. Baginda berkata: Tidak, ia tidak boleh, tetapi jualkan ia kepada saya. Saya berkata: Kemudian berikan saya satu 'uqaya emas kerana saya berhutang kepada seseorang dan kemudian ia akan menjadi milikmu. Baginda (Nabi SAW) berkata: Saya mengambilnya (dengan harga satu 'uqiya emas) dan kamu sampai ke Madinah dengannya. Ketika saya sampai ke Madinah, Rasulullah ﷺ berkata kepada Bilal رضي الله عنه : Berikan kepadanya satu 'uqaya emas dan berikan juga sedikit bayaran tambahan. Beliau (Jabir) berkata: Dia memberikan kepada saya satu 'uqaya emas dan membuat tambahan satu qirat. Beliau (Jabir) berkata: Tambahan yang dibuat oleh Rasulullah ﷺ bersama saya (sebagai amanah suci untuk keberkatan) dan berada di dalam poket saya sehingga orang-orang Syria mengambilnya pada Hari Harra.",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الْأَعْمَشِ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ جَابِرٍ، قَالَ: أَقْبَلْنَا مِنْ مَكَّةَ إِلَى الْمَدِينَةِ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَاعْتَلَّ جَمَلِي، وَسَاقَ الْحَدِيثَ بِقِصَّتِهِ، وَفِيهِ ثُمَّ قَالَ لِي: «بِعْنِي جَمَلَكَ هَذَا»، قَالَ: قُلْتُ: لَا، بَلْ هُوَ لَكَ، قَالَ: «لَا، بَلْ بِعْنِيهِ» قَالَ: قُلْتُ: لَا، بَلْ هُوَ لَكَ يَا رَسُولَ اللهِ، قَالَ: «لَا، بَلْ بِعْنِيهِ»، قَالَ: قُلْتُ: فَإِنَّ لِرَجُلٍ عَلَيَّ أُوقِيَّةَ ذَهَبٍ، فَهُوَ لَكَ بِهَا، قَالَ: «قَدْ أَخَذْتُهُ، فَتَبَلَّغْ عَلَيْهِ إِلَى الْمَدِينَةِ»، قَالَ: فَلَمَّا قَدِمْتُ الْمَدِينَةَ، قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِبِلَالٍ: «أَعْطِهِ أُوقِيَّةً مِنْ ذَهَبٍ وَزِدْهُ»، قَالَ: فَأَعْطَانِي أُوقِيَّةً مِنْ ذَهَبٍ، وَزَادَنِي قِيرَاطًا، قَالَ: فَقُلْتُ: لَا تُفَارِقُنِي زِيَادَةُ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: فَكَانَ فِي كِيسٍ لِي فَأَخَذَهُ أَهْلُ الشَّامِ يَوْمَ الْحَرَّةِ."
      },
      {
        "id": 11666,
        "hadith_number": "4102",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Doa Rasulullah (ﷺ) kepada Seorang Sahabat yang Tertinggal",
        "perawi_melayu": "Jabir bin 'Abdullah (رضي الله عنه) meriwayatkan:",
        "english_text": "We were with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in a journey and my camel meant for carrying water lagged behind. The rest of the hadith is the same and it is mentioned also: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) pricked it and then said to me: Ride in the name of Allah. He constantly made addition (in prayers for me) and went on saying. May Allah forgive you!",
        "malay_translation": "Kami bersama Rasulullah (ﷺ) dalam suatu perjalanan dan untaku yang membawa air ketinggalan. Selebihnya hadith adalah sama, dan juga disebut: Rasulullah (ﷺ) mencucuknya dan kemudian bersabda kepada saya: Naiklah dengan nama Allah. Baginda sentiasa mendoakan (untukku) dan terus berkata: Semoga Allah mengampunimu!",
        "arabic_text": "حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا الْجُرَيْرِيُّ، عَنْ أَبِي نَضْرَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: كُنَّا مَعَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَتَخَلَّفَ نَاضِحِي وَسَاقَ الْحَدِيثَ، وَقَالَ فِيهِ: فَنَخَسَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ثُمَّ قَالَ لِي: «ارْكَبْ بِاسْمِ اللهِ»، وَزَادَ أَيْضًا قَالَ: فَمَا زَالَ يَزِيدُنِي وَيَقُولُ: «وَاللهُ يَغْفِرُ لَكَ»."
      },
      {
        "id": 11667,
        "hadith_number": "4103",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Jabir Menjual Unta kepada Nabi (ﷺ)",
        "perawi_melayu": "Jabir (رضي الله عنه) meriwayatkan:",
        "english_text": "My camel had grown tired as Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came to me. He goaded it and it began to jump. After that I tried to restrain its rein so that I could listen to his (Prophet's) words, but I could not do that. Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) met me and said: Sell it to me, and I sold it for five 'uqiyas. I said: On the condition that I may use it as a ride (for going back) to Medina. He (the Holy Prophet) said: Well, you may use it as a ride up till Medina. When I came to Medina I handed over that to him and he made an addition of an uqiya (to that amount which had been agreed upon) and then presented that (camel) to me.",
        "malay_translation": "Untaku telah menjadi letih ketika Rasulullah (ﷺ) datang kepadaku. Baginda memacu unta itu dan ia mula melompat. Selepas itu, aku cuba menahan tali kekangnya supaya aku dapat mendengar kata-kata baginda (Nabi), tetapi aku tidak dapat berbuat demikian. Rasulullah (ﷺ) menemuiku dan berkata: Jualkan kepadaku, dan aku menjualnya dengan lima 'uqiyas. Aku berkata: Dengan syarat aku boleh menggunakannya sebagai tunggangan (untuk kembali) ke Madinah. Baginda (Nabi Suci) berkata: Baiklah, kamu boleh menggunakannya sebagai tunggangan sehingga ke Madinah. Apabila aku sampai ke Madinah, aku menyerahkannya kepada baginda dan baginda menambah satu uqiya (kepada jumlah yang telah dipersetujui) dan kemudian menghadiahkan (unta) itu kepadaku.",
        "arabic_text": "وحَدَّثَنِي أَبُو الرَّبِيعِ الْعَتَكِيُّ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ: لَمَّا أَتَى عَلَيَّ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَقَدْ أَعْيَا بَعِيرِي، قَالَ: فَنَخَسَهُ، فَوَثَبَ، فَكُنْتُ بَعْدَ ذَلِكَ أَحْبِسُ خِطَامَهُ لِأَسْمَعَ حَدِيثَهُ، فَمَا أَقْدِرُ عَلَيْهِ، فَلَحِقَنِي النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «بِعْنِيهِ»، فَبِعْتُهُ مِنْهُ بِخَمْسِ أَوَاقٍ، قَالَ: قُلْتُ: عَلَى أَنَّ لِي ظَهْرَهُ إِلَى الْمَدِينَةِ، قَالَ: «وَلَكَ ظَهْرُهُ إِلَى الْمَدِينَةِ»، قَالَ: فَلَمَّا قَدِمْتُ الْمَدِينَةَ أَتَيْتُهُ بِهِ، فَزَادَنِي وُقِيَّةً، ثُمَّ وَهَبَهُ لِي."
      },
      {
        "id": 11668,
        "hadith_number": "4104",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Jabir dan Unta dalam Perjalanan",
        "perawi_melayu": "Abd Mutawakkil al-Najl meriwayatkan daripada Jabir bin 'Abdullah (رضي الله عنه) yang berkata:",
        "english_text": "I accompanied Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in one of his journeys (the narrator says, he said in Jihad), and he narrated the rest of the hadith, and made this addition: He (the Holy Prophet ﷺ) said: Jabir, have you received the price? I said: Yes, whereupon he said: Yours is the price as well as the camel; yours is the price as well as the camel.",
        "malay_translation": "Saya mengiringi Rasulullah (صلى الله عليه وسلم) dalam salah satu perjalanan baginda (perawi berkata, baginda berkata dalam Jihad), dan baginda menceritakan selebihnya daripada hadis, dan membuat tambahan ini: Baginda (Nabi Suci ﷺ) bersabda: Wahai Jabir, adakah engkau telah menerima harga? Saya berkata: Ya, lalu baginda bersabda: Engkau berhak menerima harga dan juga unta itu; engkau berhak menerima harga dan juga unta itu.",
        "arabic_text": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ، حَدَّثَنَا يَعْقُوبُ بْنُ إِسْحَاقَ، حَدَّثَنَا بَشِيرُ بْنُ عُقْبَةَ، عَنْ أَبِي الْمُتَوَكِّلِ النَّاجِيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: سَافَرْتُ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي بَعْضِ أَسْفَارِهِ - أَظُنُّهُ قَالَ: غَازِيًا -، وَاقْتَصَّ الْحَدِيثَ، وَزَادَ فِيهِ قَالَ: «يَا جَابِرُ، أَتَوَفَّيْتَ الثَّمَنَ؟» قُلْتُ: نَعَمْ، قَالَ: لَكَ الثَّمَنُ، وَلَكَ الْجَمَلُ، لَكَ الثَّمَنُ، وَلَكَ الْجَمَلُ."
      },
      {
        "id": 11669,
        "hadith_number": "4105",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pembelian Unta dan Pembayaran Lebih oleh Rasulullah ﷺ",
        "perawi_melayu": "Jabir bin 'Abdullah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bought a camel from me for two 'uqiyas and a dirham or two dirhams. As he reached Sirar (a village near Medina), he commanded a cow to be slaughtered and it was slaughtered, and they ate of that, and as he (the Holy Prophet ﷺ) reached Medina he ordered me to go to the mosque and offer two rak'ahs of prayer, and he measured for me the price of the camel and even made an excess payment to me.",
        "malay_translation": "Rasulullah (ﷺ) membeli seekor unta daripada saya dengan harga dua 'uqiyas dan satu atau dua dirham. Apabila baginda sampai di Sirar (sebuah kampung berhampiran Madinah), baginda memerintahkan seekor lembu disembelih, lalu ia disembelih, dan mereka makan daripadanya. Sebaik sahaja baginda (Nabi ﷺ) sampai di Madinah, baginda memerintahkan saya pergi ke masjid dan menunaikan solat dua rakaat, dan baginda mengukur harga unta tersebut dan membayar lebih kepada saya.",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَارِبٍ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: «اشْتَرَى مِنِّي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَعِيرًا بِوُقِيَّتَيْنِ، وَدِرْهَمٍ أَوْ دِرْهَمَيْنِ»، قَالَ: «فَلَمَّا قَدِمَ صِرَارًا أَمَرَ بِبَقَرَةٍ، فَذُبِحَتْ فَأَكَلُوا مِنْهَا، فَلَمَّا قَدِمَ الْمَدِينَةَ أَمَرَنِي أَنْ آتِيَ الْمَسْجِدَ، فَأُصَلِّيَ رَكْعَتَيْنِ، وَوَزَنَ لِي ثَمَنَ الْبَعِيرِ، فَأَرْجَحَ لِي."
      },
      {
        "id": 11670,
        "hadith_number": "4106",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Nabi membeli unta dan menyembelih lembu",
        "perawi_melayu": "Jabir bin 'Abdullah (رضي الله عنه) meriwayatkan hadis ini daripada Rasulullah (صلى الله عليه وسلم) tetapi dengan variasi ini: beliau berkata:",
        "english_text": "He (the Holy Prophet) bought the camel from me on a stipulated price. And he did not mention two 'uqiyas and a dirham or two dirhams, and he comanded a cow (to be slaughtered) and it was slaughtered, and he then distributed its flesh.",
        "malay_translation": "Baginda (Nabi Suci) membeli unta itu daripada saya dengan harga yang ditetapkan. Dan baginda tidak menyebut dua 'uqiyas dan satu dirham atau dua dirham, dan baginda memerintahkan seekor lembu (untuk disembelih) dan ia disembelih, dan kemudian baginda mengagihkan dagingnya.",
        "arabic_text": "حَدَّثَنِي يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنَا مُحَارِبٌ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِهَذِهِ الْقِصَّةِ، غَيْرَ أَنَّهُ قَالَ: فَاشْتَرَاهُ مِنِّي بِثَمَنٍ قَدْ سَمَّاهُ، وَلَمْ يَذْكُرِ الْوُقِيَّتَيْنِ، وَالدِّرْهَمَ وَالدِّرْهَمَيْنِ، وَقَالَ: أَمَرَ بِبَقَرَةٍ فَنُحِرَتْ، ثُمَّ قَسَمَ لَحْمَهَا."
      },
      {
        "id": 11671,
        "hadith_number": "4107",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Nabi ﷺ Membeli Unta dan Membenarkan Jabir Menungganginya",
        "perawi_melayu": "Jabir (رضی اللہ عنہ) meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to him: I have taken your camel for four dinars, and you may ride upon it to Medina.",
        "malay_translation": "Rasulullah (ﷺ) bersabda kepadanya: \"Aku telah mengambil untamu dengan harga empat dinar, dan engkau boleh menungganginya ke Madinah.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ: «قَدْ أَخَذْتُ جَمَلَكَ بِأَرْبَعَةِ دَنَانِيرَ، وَلَكَ ظَهْرُهُ إِلَى الْمَدِينَةِ»."
      },
      {
        "id": 11672,
        "hadith_number": "4108",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Membayar Balik Pinjaman dengan Cara Terbaik",
        "perawi_melayu": "Abu Rafi' رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) took from a man as a loan a young camel (below six years). Then the camels of Sadaqa were brought to him. He ordered Abu Rafi' رضی اللہ عنہ to return to that person the young camel (as a return of the loan). Abu Rafi' رضی اللہ عنہ returned to him and said: I did not find among them but better camels above the age of six. He (the Holy Prophet ﷺ) said: Give that to him for the best men are those who are best in paying off the debt.",
        "malay_translation": "Rasulullah (صلى الله عليه وسلم) meminjam daripada seorang lelaki seekor unta muda (di bawah usia enam tahun). Kemudian unta-unta Sadaqah dibawa kepada baginda. Baginda memerintahkan Abu Rafi' رضي الله عنه untuk memulangkan kepada lelaki itu unta muda tersebut (sebagai bayaran balik pinjaman). Abu Rafi' رضي الله عنه kembali kepada baginda dan berkata: Saya tidak menemui di kalangan unta-unta itu melainkan unta yang lebih baik yang berumur lebih daripada enam tahun. Baginda (Nabi صلى الله عليه وسلم) bersabda: Berikan sahaja kepadanya, kerana sebaik-baik manusia adalah mereka yang terbaik dalam membayar hutang.",
        "arabic_text": "حَدَّثَنَا أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي رَافِعٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ اسْتَسْلَفَ مِنْ رَجُلٍ بَكْرًا، فَقَدِمَتْ عَلَيْهِ إِبِلٌ مِنْ إِبِلِ الصَّدَقَةِ، فَأَمَرَ أَبَا رَافِعٍ أَنْ يَقْضِيَ الرَّجُلَ بَكْرَهُ، فَرَجَعَ إِلَيْهِ أَبُو رَافِعٍ، فَقَالَ: لَمْ أَجِدْ فِيهَا إِلَّا خِيَارًا رَبَاعِيًا، فَقَالَ: «أَعْطِهِ إِيَّاهُ، إِنَّ خِيَارَ النَّاسِ أَحْسَنُهُمْ قَضَاءً»."
      },
      {
        "id": 11673,
        "hadith_number": "4109",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Orang Terbaik dalam Membayar Hutang",
        "perawi_melayu": "Abu Rafi' رضي الله عنه, bekas hamba Allah's Messenger (صلى الله عليه وسلم), berkata:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) took as a loan (the rest of the hadith is the same), but with this variation that he (the Holy Prophet) said: Good amongst the servants of Allah is he who is best in paying off the debt.",
        "malay_translation": "Rasulullah (صلى الله عليه وسلم) mengambil sebagai pinjaman (selebihnya hadis adalah sama), tetapi dengan variasi ini baginda (Nabi Suci) bersabda: Sebaik-baik hamba Allah adalah orang yang terbaik dalam membayar hutang.",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ، سَمِعْتُ زَيْدَ بْنَ أَسْلَمَ، أَخْبَرَنَا عَطَاءُ بْنُ يَسَارٍ، عَنْ أَبِي رَافِعٍ، مَوْلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: اسْتَسْلَفَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَكْرًا بِمِثْلِهِ، غَيْرَ أَنَّهُ قَالَ: «فَإِنَّ خَيْرَ عِبَادِ اللهِ أَحْسَنُهُمْ قَضَاءً»."
      },
      {
        "id": 11674,
        "hadith_number": "4110",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kewajipan Membayar Hutang dengan Baik",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) owed (something) to a person. He behaved in an uncivil manner with him. This vexed the Companions of the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), whereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He who has a right is entitled to speak, and said to them (his Companions): Buy a camel for him and give that to him. They said: We do not find a camel (of that age) but one with better age than that. He said: Buy that and give that to him, for best of you or best amongst you are those who are best in paying off debt.",
        "malay_translation": "Rasulullah (صلى الله عليه وسلم) berhutang (sesuatu) dengan seseorang. Orang itu berkelakuan tidak sopan terhadapnya. Hal ini membuat para Sahabat Nabi (صلى الله عليه وسلم) marah, lalu Rasulullah (صلى الله عليه وسلم) bersabda: Sesiapa yang mempunyai hak berhak untuk berkata, dan baginda berkata kepada mereka (para Sahabat): Belikan unta untuknya dan berikan kepadanya. Mereka berkata: Kami tidak menjumpai unta (pada usia itu) melainkan yang lebih tua daripada itu. Baginda bersabda: Belilah yang itu dan berikan kepadanya, kerana sebaik-baik kamu atau sebaik-baik antara kamu adalah mereka yang terbaik dalam membayar hutang.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارِ بْنِ عُثْمَانَ الْعَبْدِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: كَانَ لِرَجُلٍ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَقٌّ، فَأَغْلَظَ لَهُ، فَهَمَّ بِهِ أَصْحَابُ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ لِصَاحِبِ الْحَقِّ مَقَالًا»، فَقَالَ لَهُمْ: «اشْتَرُوا لَهُ سِنًّا، فَأَعْطُوهُ إِيَّاهُ»، فَقَالُوا: إِنَّا لَا نَجِدُ إِلَّا سِنًّا هُوَ خَيْرٌ مِنْ سِنِّهِ، قَالَ: «فَاشْتَرُوهُ، فَأَعْطُوهُ إِيَّاهُ، فَإِنَّ مِنْ خَيْرِكُمْ، أَوْ خَيْرَكُمْ أَحْسَنُكُمْ قَضَاءً."
      },
      {
        "id": 11675,
        "hadith_number": "4111",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kebaikan dalam Membayar Hutang",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) took a camel on loan, and then returned him (the lender) the camel of a more mature age and said: Good among you are those who are good in clearing off the debt.",
        "malay_translation": "Rasulullah (ﷺ) meminjam seekor unta, kemudian baginda memulangkannya (kepada pemberi pinjaman) dengan seekor unta yang lebih matang usianya dan bersabda: \"Sebaik-baik kamu ialah mereka yang baik dalam melunaskan hutang.\"",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، عَنْ عَلِيِّ بْنِ صَالِحٍ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: اسْتَقْرَضَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سِنًّا، فَأَعْطَى سِنًّا فَوْقَهُ، وَقَالَ: «خِيَارُكُمْ مَحَاسِنُكُمْ قَضَاءً»."
      },
      {
        "id": 11676,
        "hadith_number": "4112",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Membayar Hutang",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "There came a person demanding a camel from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). He (the Holy Prophet) said: Give him (the camel) of that age or of more mature age, and said: Best among you is one who is best in clearing off the debt.",
        "malay_translation": "Seorang lelaki datang meminta seekor unta daripada Rasulullah ﷺ. Baginda bersabda: Berikan kepadanya (unta) yang sepadan umurnya atau yang lebih tua, dan bersabda: Sebaik-baik kamu ialah orang yang paling baik dalam melunaskan hutang.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سُفْيَانُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: جَاءَ رَجُلٌ يَتَقَاضَى رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَعِيرًا، فَقَالَ: أَعْطُوهُ سِنًّا فَوْقَ سِنِّهِ، وَقَالَ: «خَيْرُكُمْ أَحْسَنُكُمْ قَضَاءً»."
      },
      {
        "id": 11677,
        "hadith_number": "4113",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Hamba yang Berbai'ah dan Pembelian oleh Rasulullah (ﷺ)",
        "perawi_melayu": "Jabir (رضي الله عنه) meriwayatkan:",
        "english_text": "There came a slave and pledged allegiance to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) on migration; he (the Holy Prophet) did not know that he was a slave. Then there came his master and demanded him back, whereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Sell him to me. And he bought him for two black slaves, and he did not afterwards take allegiance from anyone until he had asked him whether he was a slave (or a free man)",
        "malay_translation": "Seorang hamba datang dan berbai'ah kepada Rasulullah (ﷺ) atas penghijrahan; Baginda (Nabi ﷺ) tidak tahu bahawa dia adalah seorang hamba. Kemudian datang tuannya dan menuntutnya kembali, lalu Rasulullah (ﷺ) bersabda: Jualkan dia kepadaku. Dan Baginda membelinya dengan harga dua orang hamba hitam, dan Baginda selepas itu tidak mengambil bai'ah daripada sesiapa pun sehingga Baginda bertanya kepadanya sama ada dia seorang hamba (atau seorang yang merdeka).",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَابْنُ رُمْحٍ، قَالَا: أَخْبَرَنَا اللَّيْثُ، ح وحَدَّثَنِيهِ قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ: جَاءَ عَبْدٌ فَبَايَعَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى الْهِجْرَةِ، وَلَمْ يَشْعُرْ أَنَّهُ عَبْدٌ، فَجَاءَ سَيِّدُهُ يُرِيدُهُ، فَقَالَ لَهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «بِعْنِيهِ»، فَاشْتَرَاهُ بِعَبْدَيْنِ أَسْوَدَيْنِ، ثُمَّ لَمْ يُبَايِعْ أَحَدًا بَعْدُ حَتَّى يَسْأَلَهُ: «أَعَبْدٌ هُوَ."
      },
      {
        "id": 11678,
        "hadith_number": "4114",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Nabi ﷺ Membeli Gandum daripada Seorang Yahudi",
        "perawi_melayu": "A'ishah (رضي الله عنها) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bought some grain from a Jew on credit and gave him a coat-of-mail of his as a pledge.",
        "malay_translation": "Rasulullah ﷺ membeli gandum daripada seorang Yahudi secara kredit dan memberikan baju besi baginda sebagai gadaian.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْعَلَاءِ، وَاللَّفْظُ لِيَحْيَى، قَالَ يَحْيَى: أَخْبَرَنَا، وَقَالَ الْآخَرَانِ: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الْأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ: «اشْتَرَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ يَهُودِيٍّ طَعَامًا بِنَسِيئَةٍ، فَأَعْطَاهُ دِرْعًا لَهُ رَهْنًا»."
      },
      {
        "id": 11679,
        "hadith_number": "4115",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Nabi (ﷺ) Membeli Gandum daripada Orang Yahudi dengan Menggadaikan Baju Besinya",
        "perawi_melayu": "A'isha (رضي الله عنها) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bought from a Jew grain (as loan) and pledged him his iron coat-of-mail.",
        "malay_translation": "Rasulullah (ﷺ) membeli gandum daripada seorang Yahudi (sebagai pinjaman) dan menggadaikan baju besi besinya kepadanya.",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَعَلِيُّ بْنُ خَشْرَمٍ، قَالَا: أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الْأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ: «اشْتَرَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ يَهُودِيٍّ طَعَامًا، وَرَهَنَهُ دِرْعًا مِنْ حَدِيدٍ."
      },
      {
        "id": 11680,
        "hadith_number": "4116",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah ﷺ Membeli Gandum dan Menggadaikan Baju Besi",
        "perawi_melayu": "A'ishah (رضي الله عنها) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bought from a Jew grain for a specified time; and gave him iron coat-of-mail of his as a pledge.",
        "malay_translation": "Rasulullah ﷺ membeli gandum daripada seorang Yahudi untuk tempoh masa yang ditetapkan; dan baginda memberikan baju besi besi baginda sebagai gadaian.",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا الْمَخْزُومِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، عَنِ الْأَعْمَشِ، قَالَ: ذَكَرْنَا الرَّهْنَ فِي السَّلَمِ عِنْدَ إِبْرَاهِيمَ النَّخَعِيِّ، فَقَالَ: حَدَّثَنَا الْأَسْوَدُ بْنُ يَزِيدَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اشْتَرَى مِنْ يَهُودِيٍّ طَعَامًا إِلَى أَجَلٍ، وَرَهَنَهُ دِرْعًا لَهُ مِنْ حَدِيدٍ»."
      },
      {
        "id": 11681,
        "hadith_number": "4117",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Riwayat Tambahan Tentang Hadith 'A'ishah (رضی اللہ عنہا)",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "This hadith has been narrated on the authority of 'A'isha (رضی اللہ عنہا), through another chain at transmitters, but no mention was made of (its being made) of iron.",
        "malay_translation": "Hadith ini telah diriwayatkan daripada 'A'ishah (رضی اللہ عنہا) melalui satu lagi rangkaian perawi, tetapi tiada disebut tentang (pembuatannya) daripada besi.",
        "arabic_text": "حَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، قَالَ: حَدَّثَنِي الْأَسْوَدُ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ، وَلَمْ يَذْكُرْ مِنْ حَدِيدٍ."
      },
      {
        "id": 11682,
        "hadith_number": "4118",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Membayar Pendahuluan untuk Buah-buahan yang Tidak Jelas",
        "perawi_melayu": "Ibn 'Abbas ( رضي الله عنه ) meriwayatkan:",
        "english_text": "When Allah's Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to Medina, they were paying one and two years in advance for fruits, so he said: Those who pay in advance for anything must do so for a specified weight and for a definite time.",
        "malay_translation": "Ketika Nabi Allah (ﷺ) tiba di Madinah, mereka membayar pendahuluan satu dan dua tahun untuk buah-buahan. Maka baginda bersabda: Sesiapa yang membayar pendahuluan untuk sesuatu, hendaklah melakukannya untuk timbangan yang tertentu dan tempoh masa yang ditetapkan.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَعَمْرٌو النَّاقِدُ، وَاللَّفْظُ لِيَحْيَى، قَالَ عَمْرٌو: حَدَّثَنَا، وَقَالَ يَحْيَى: أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ عَبْدِ اللهِ بْنِ كَثِيرٍ، عَنْ أَبِي الْمِنْهَالِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: قَدِمَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ، وَهُمْ يُسْلِفُونَ فِي الثِّمَارِ السَّنَةَ وَالسَّنَتَيْنِ، فَقَالَ: «مَنْ أَسْلَفَ فِي تَمْرٍ، فَلْيُسْلِفْ فِي كَيْلٍ مَعْلُومٍ، وَوَزْنٍ مَعْلُومٍ، إِلَى أَجَلٍ مَعْلُومٍ»."
      },
      {
        "id": 11683,
        "hadith_number": "4119",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Membayar Pendahuluan dalam Urusniaga",
        "perawi_melayu": "Ibn 'Abbas (رضي الله عنه) meriwayatkan:",
        "english_text": "When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to (Medina) and the people were paying in advance (for the fruits, etc.), he said to them: He who makes an advance payment should not make advance payment except for a specified measure and weight (and for a specified period).",
        "malay_translation": "Ketika Rasulullah (ﷺ) tiba di (Madinah) dan orang ramai membayar secara pendahuluan (untuk buah-buahan, dan sebagainya), baginda bersabda kepada mereka: Sesiapa yang membuat pembayaran pendahuluan, janganlah dia membuat pembayaran pendahuluan kecuali untuk sukatan dan timbangan yang tertentu (dan untuk tempoh masa yang tertentu).",
        "arabic_text": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنِ ابْنِ أَبِي نَجِيحٍ، حَدَّثَنِي عَبْدُ اللهِ بْنُ كَثِيرٍ، عَنْ أَبِي الْمِنْهَالِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: قَدِمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَالنَّاسُ يُسْلِفُونَ، فَقَالَ لَهُمْ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَسْلَفَ فَلَا يُسْلِفْ إِلَّا فِي كَيْلٍ مَعْلُومٍ، وَوَزْنٍ مَعْلُومٍ»."
      },
      {
        "id": 11684,
        "hadith_number": "4120",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Riwayat Hadith Ibn Abu Najih (Tanpa Tempoh Tertentu)",
        "perawi_melayu": "Tidak dinyatakan (Ibn Abu Najih)",
        "english_text": "Ibn Abu Najih has narrated a hadith like this with the same chain of transmitters, but he has not mentioned: for a definite period .",
        "malay_translation": "Ibn Abu Najih meriwayatkan hadith seperti ini dengan rantaian perawi yang sama, tetapi beliau tidak menyebut: untuk tempoh yang tertentu.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْمَاعِيلُ بْنُ سَالِمٍ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، عَنِ ابْنِ أَبِي نَجِيحٍ، بِهَذَا الْإِسْنَادِ مِثْلَ حَدِيثِ عَبْدِ الْوَارِثِ، وَلَمْ يَذْكُرْ: «إِلَى أَجَلٍ مَعْلُومٍ»."
      },
      {
        "id": 11685,
        "hadith_number": "4121",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadith Mengenai Tempoh Tertentu",
        "perawi_melayu": "Tidak dinyatakan (melalui rantaian periwayat lain)",
        "english_text": "This hadith has been narrated by Ibn Abu Najih through another chain of transmitters mentioning in it for a specified period.",
        "malay_translation": "Hadith ini diriwayatkan oleh Ibn Abu Najih melalui rantaian periwayat lain, menyebutkan di dalamnya mengenai tempoh tertentu.",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، وَابْنُ أَبِي عُمَرَ، قَالَا: حَدَّثَنَا وَكِيعٌ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، كِلَاهُمَا عَنْ سُفْيَانَ، عَنِ ابْنِ أَبِي نَجِيحٍ، بِإِسْنَادِهِمْ مِثْلَ حَدِيثِ ابْنِ عُيَيْنَةَ، يَذْكُرُ فِيهِ إِلَى أَجَلٍ مَعْلُومٍ."
      },
      {
        "id": 11686,
        "hadith_number": "4122",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukuman Menimbun Harta",
        "perawi_melayu": "Ma`mar (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who hoards is a sinner. It was said to Sa`id (bin al-Musayyib): You also hoard. Sa`id said: Ma`mar رضی اللہ عنہ who narrated this hadith also hoarded.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: \"Sesiapa yang menimbun (harta) adalah seorang yang berdosa.\" Dikatakan kepada Sa`id (bin al-Musayyib): \"Engkau juga menimbun.\" Sa`id berkata: \"Ma`mar رضي الله عنه yang meriwayatkan hadith ini juga menimbun.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ بِلَالٍ، عَنْ يَحْيَى وَهُوَ ابْنُ سَعِيدٍ، قَالَ: كَانَ سَعِيدُ بْنُ الْمُسَيِّبِ، يُحَدِّثُ أَنَّ مَعْمَرًا، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنِ احْتَكَرَ فَهُوَ خَاطِئٌ»، فَقِيلَ لِسَعِيدٍ: فَإِنَّكَ تَحْتَكِرُ، قَالَ سَعِيدٌ: إِنَّ مَعْمَرًا الَّذِي كَانَ يُحَدِّثُ هَذَا الْحَدِيثَ، كَانَ يَحْتَكِرُ."
      },
      {
        "id": 11687,
        "hadith_number": "4123",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukuman Bagi Orang Yang Suka Mengumpul Harta (Menimbun)",
        "perawi_melayu": "Ma'mar bin Abdullah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: No one hoards but the sinner.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: “Tidaklah seseorang itu suka menimbun harta melainkan orang yang berdosa.”",
        "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الْأَشْعَثِيُّ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ مُحَمَّدِ بْنِ عَجْلَانَ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ مَعْمَرِ بْنِ عَبْدِ اللهِ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «لَا يَحْتَكِرُ إِلَّا خَاطِئٌ»."
      },
      {
        "id": 11688,
        "hadith_number": "4124",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Riwayat Hadith Melalui Sulaiman bin Bilal",
        "perawi_melayu": "Tiada Maklumat",
        "english_text": "This hadith has been transmitted on the authority of Sulaiman bin Bilal from Yahya.",
        "malay_translation": "Hadith ini telah diriwayatkan dari Sulaiman bin Bilal daripada Yahya.",
        "arabic_text": "قَالَ إِبْرَاهِيمُ: قَالَ مُسْلِمٌ: وحَدَّثَنِي بَعْضُ أَصْحَابِنَا، عَنْ عَمْرِو بْنِ عَوْنٍ، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللهِ، عَنْ عَمْرِو بْنِ يَحْيَى، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ مَعْمَرِ بْنِ أَبِي مَعْمَرٍ أَحَدِ بَنِي عَدِيِّ بْنِ كَعْبٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: فَذَكَرَ بِمِثْلِ حَدِيثِ سُلَيْمَانَ بْنِ بِلَالٍ، عَنْ يَحْيَى."
      },
      {
        "id": 11689,
        "hadith_number": "4125",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Sumpah Melariskan Jualan, Memadamkan Berkat",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) berkata:",
        "english_text": "He heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Swearing produces a ready sale for a commodity, but blots out the blessing.",
        "malay_translation": "Beliau mendengar Rasulullah ﷺ bersabda: Sumpah menyebabkan barangan cepat dijual, tetapi memadamkan keberkatan.",
        "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا أَبُو صَفْوَانَ الْأُمَوِيُّ، ح وحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، كِلَاهُمَا عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيِّبِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «الْحَلِفُ مَنْفَقَةٌ لِلسِّلْعَةِ، مَمْحَقَةٌ لِلرِّبْحِ»."
      },
      {
        "id": 11690,
        "hadith_number": "4126",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Amaran Nabi tentang Bersumpah",
        "perawi_melayu": "Abu Qatada al-Ansari (رضي الله عنه) meriwayatkan:",
        "english_text": "He heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say: Beware of swearing; it produces a ready sale for a commodity, but blots out the blessing.",
        "malay_translation": "Beliau mendengar Rasulullah (ﷺ) bersabda: “Berhati-hatilah daripada bersumpah; ia menghasilkan jualan yang cepat bagi sesuatu barangan, tetapi menghilangkan keberkatan.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَاللَّفْظُ لِابْنِ أَبِي شَيْبَةَ، قَالَ إِسْحَاقُ: أَخْبَرَنَا، وَقَالَ الْآخَرَانِ: حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الْوَلِيدِ بْنِ كَثِيرٍ، عَنْ مَعْبَدِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِي قَتَادَةَ الْأَنْصَارِيِّ، أَنَّهُ سَمِعَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِيَّاكُمْ وَكَثْرَةَ الْحَلِفِ فِي الْبَيْعِ، فَإِنَّهُ يُنَفِّقُ، ثُمَّ يَمْحَقُ»."
      },
      {
        "id": 11691,
        "hadith_number": "4127",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Menjual Harta Bersama",
        "perawi_melayu": "Jabir bin 'Abdullah (رضی اللہ عنہ) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who has a partner in a dwelling or a garden, it is not lawful for him to sell that until he is permitted by his partner. If he (the partner) agrees, he should go in for that, and if he disapproves of that, he should abandon (the idea of selling it).",
        "malay_translation": "Rasulullah (صلی اللہ علیہ وسلم) bersabda: Sesiapa yang mempunyai perkongsian dalam sebuah rumah atau kebun, tidak halal baginya untuk menjualnya sehingga mendapat keizinan daripada rakan kongsinya. Jika rakan kongsinya bersetuju, hendaklah dia meneruskan penjualan itu, dan jika dia tidak bersetuju, hendaklah dia membatalkan (cadangan menjualnya).",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، ح وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَانَ لَهُ شَرِيكٌ فِي رَبْعَةٍ، أَوْ نَخْلٍ، فَلَيْسَ لَهُ أَنْ يَبِيعَ حَتَّى يُؤْذِنَ شَرِيكَهُ، فَإِنْ رَضِيَ أَخَذَ، وَإِنْ كَرِهَ تَرَكَ»."
      },
      {
        "id": 11692,
        "hadith_number": "4128",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hak Mendahulukan Dalam Perkongsian Harta",
        "perawi_melayu": "Jabir bin 'Abdullah (رضي الله عنه) berkata:",
        "english_text": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) decreed pre-emption in every joint ownership and not divided-the one-it may be a dwelling or a garden. It is not lawful for him (for the partner) to sell that until his partner gives his consent. He (the partner) is entitled to buy it when he desires and he can abandon it if he so likes. And if he (the one partner) sells it without getting the consent of the (other partner), he has the greatest right to it.",
        "malay_translation": "Rasulullah (ﷺ) telah menetapkan hak mendahulukan (syuf'ah) dalam setiap perkongsian harta yang tidak dibahagikan, sama ada rumah atau kebun. Tidak halal baginya (rakan kongsi) untuk menjualnya sehingga rakannya memberikan persetujuan. Rakan kongsi berhak membelinya apabila dia mahu dan dia boleh meninggalkannya jika dia mahu. Dan jika dia (rakan kongsi) menjualnya tanpa mendapatkan persetujuan (rakan kongsi yang lain), maka dialah yang paling berhak terhadapnya.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَاللَّفْظُ لِابْنِ نُمَيْرٍ، قَالَ إِسْحَاقُ: أَخْبَرَنَا، وَقَالَ الْآخَرَانِ: حَدَّثَنَا عَبْدُ اللهِ بْنُ إِدْرِيسَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ: «قَضَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالشُّفْعَةِ فِي كُلِّ شِرْكَةٍ لَمْ تُقْسَمْ، رَبْعَةٍ أَوْ حَائِطٍ، لَا يَحِلُّ لَهُ أَنْ يَبِيعَ حَتَّى يُؤْذِنَ شَرِيكَهُ، فَإِنْ شَاءَ أَخَذَ، وَإِنْ شَاءَ تَرَكَ، فَإِذَا بَاعَ وَلَمْ يُؤْذِنْهُ فَهُوَ أَحَقُّ بِهِ»."
      },
      {
        "id": 11693,
        "hadith_number": "4129",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hak Pra-beli dalam Harta Kongsi",
        "perawi_melayu": "Jabir bin 'Abdullah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There is pre-emption in everything which is shared, be it land, or a dwelling or a garden. It is not proper to sell it until he informs his partner; he may go in for that, or he may abandon it; and it he (the partner intending to sell his share) does not do that, then his partner has the greatest right to it until he permits him.",
        "malay_translation": "Rasulullah (صلى الله عليه وسلم) bersabda: Terdapat hak pra-beli dalam setiap harta yang dikongsi, sama ada tanah, rumah kediaman atau kebun. Tidaklah sepatutnya ia dijual sehingga dia memaklumkan kepada rakannya; dia boleh mengambil hak tersebut, atau dia boleh meninggalkannya; dan jika dia (rakan yang berhasrat menjual bahagiannya) tidak berbuat demikian, maka rakannya mempunyai hak yang paling besar terhadapnya sehingga dia mengizinkannya.",
        "arabic_text": "وحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنِ ابْنِ جُرَيْجٍ، أَنَّ أَبَا الزُّبَيْرِ، أَخْبَرَهُ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الشُّفْعَةُ فِي كُلِّ شِرْكٍ، فِي أَرْضٍ، أَوْ رَبْعٍ، أَوْ حَائِطٍ، لَا يَصْلُحُ أَنْ يَبِيعَ حَتَّى يَعْرِضَ عَلَى شَرِيكِهِ، فَيَأْخُذَ أَوْ يَدَعَ، فَإِنْ أَبَى، فَشَرِيكُهُ أَحَقُّ بِهِ حَتَّى يُؤْذِنَهُ»."
      },
      {
        "id": 11694,
        "hadith_number": "4130",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Menghalang Jiran Memasang Tiang di Dinding",
        "perawi_melayu": "Abu Hurairah (رَضِيَ اللَّهُ عَنْهُ) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: None among you should prevent his neighbor from fixing a beam in his wall. Abu Huraira (رضی اللہ عنہ) then said: What is this that I see you evading (this injunction of the Holy Prophet ﷺ)? By Allah, I will certainly throw it between your shoulders (narrate this to you.)",
        "malay_translation": "Rasulullah (صلی اللہ علیہ وسلم) bersabda: \"Janganlah seorang pun di antara kamu menghalang jiran daripada memasang rasuk pada dindingnya.\" Abu Hurairah (رَضِيَ اللَّهُ عَنْهُ) kemudian berkata: \"Apakah yang aku lihat kamu mengelak (perintah Nabi ﷺ) ini? Demi Allah, aku pasti akan menyampaikannya (meriwayatkannya kepada) kamu.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَمْنَعْ أَحَدُكُمْ جَارَهُ أَنْ يَغْرِزَ خَشَبَةً فِي جِدَارِهِ»، قَالَ: ثُمَّ يَقُولُ أَبُو هُرَيْرَةَ: «مَا لِي أَرَاكُمْ عَنْهَا مُعْرِضِينَ، وَاللهِ لَأَرْمِيَنَّ بِهَا بَيْنَ أَكْتَافِكُمْ»."
      },
      {
        "id": 11695,
        "hadith_number": "4131",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadith ini diriwayatkan melalui sanad yang sama",
        "perawi_melayu": "Tiada perawi",
        "english_text": "This hadith is narrated on the authority of Zuhri with the same chain of transrmitters.",
        "malay_translation": "Hadith ini diriwayatkan daripada Zuhri melalui rangkaian perawi yang sama.",
        "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ح وحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، كُلُّهُمْ عَنِ الزُّهْرِيِّ، بِهَذَا الْإِسْنَادِ نَحْوَهُ."
      },
      {
        "id": 11696,
        "hadith_number": "4132",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukuman Bagi Mereka yang Mengambil Tanah Orang Lain Secara Zalim",
        "perawi_melayu": "Sa'id bin Zaid bin 'Amr bin Nufail (رضی اللہ عنہ) meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who wrongly took a span of land, Allah shall make him carry around his neck seven earths.",
        "malay_translation": "Rasulullah ﷺ bersabda: Sesiapa yang mengambil walau seinci tanah orang lain secara zalim, Allah akan membebankannya memikul tujuh lapisan bumi di lehernya.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ، قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ وَهُوَ ابْنُ جَعْفَرٍ، عَنِ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَبَّاسِ بْنِ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، عَنْ سَعِيدِ بْنِ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنِ اقْتَطَعَ شِبْرًا مِنَ الْأَرْضِ ظُلْمًا، طَوَّقَهُ اللهُ إِيَّاهُ يَوْمَ الْقِيَامَةِ مِنْ سَبْعِ أَرَضِينَ."
      },
      {
        "id": 11697,
        "hadith_number": "4133",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukuman Bagi Yang Merampas Tanah Orang Lain",
        "perawi_melayu": "Sa'id bin Zaid bin 'Amr bin Nufail (رضي الله عنه) meriwayatkan:",
        "english_text": "Arwi (bint Uwais) disputed with him (in regard to a part of the land) of his hodse. He said: Leave it and take off your claim from it, for I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: He who took a span of land without his right would be made to wear around his neck seven earths on the Day of Resurrection. He (Sa'id bin Zaid) said: O Allah, make her blind if she has told a lie and make her grave in her house. He (the narrator) said: I saw her blind groping (her way) by touching the walls and saying: The curse of Sa'id bin Zaid has hit me. And it so happened that as she was walking in her house, she passed by a well in her house and fell therein and that became her grave.",
        "malay_translation": "Arwi (bint Uwais) berbantah dengannya (berkenaan sebahagian tanah) daripada rumahnya. Dia berkata: Tinggalkan ia dan tarik balik tuntutan kamu daripadanya, kerana aku mendengar Rasulullah (صلى الله عليه وسلم) bersabda: Sesiapa yang mengambil walau seinci tanah tanpa haknya, dia akan dipakaikan dengan tujuh lapisan bumi di lehernya pada Hari Kiamat. Dia (Sa'id bin Zaid) berkata: Ya Allah, jadikan dia buta jika dia berdusta dan jadikan kuburnya di dalam rumahnya. Dia (perawi) berkata: Aku melihat dia buta meraba-raba (jalannya) dengan menyentuh dinding dan berkata: Sumpahan Sa'id bin Zaid telah menimpaku. Dan ia berlaku bahawa semasa dia berjalan di dalam rumahnya, dia melalui sebuah perigi di rumahnya dan terjatuh ke dalamnya dan itulah kuburnya.",
        "arabic_text": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، حَدَّثَنِي عُمَرُ بْنُ مُحَمَّدٍ، أَنَّ أَبَاهُ، حَدَّثَهُ، عَنْ سَعِيدِ بْنِ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ، أَنَّ أَرْوَى خَاصَمَتْهُ فِي بَعْضِ دَارِهِ، فَقَالَ: دَعُوهَا وَإِيَّاهَا، فَإِنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «مَنْ أَخَذَ شِبْرًا مِنَ الْأَرْضِ بِغَيْرِ حَقِّهِ، طُوِّقَهُ فِي سَبْعِ أَرَضِينَ يَوْمَ الْقِيَامَةِ»، اللهُمَّ، إِنْ كَانَتْ كَاذِبَةً فَأَعْمِ بَصَرَهَا، وَاجْعَلْ قَبْرَهَا فِي دَارِهَا، قَالَ: فَرَأَيْتُهَا عَمْيَاءَ تَلْتَمِسُ الْجُدُرَ تَقُولُ: أَصَابَتْنِي دَعْوَةُ سَعِيدِ بْنِ زَيْدٍ، فَبَيْنَمَا هِيَ تَمْشِي فِي الدَّارِ مَرَّتْ عَلَى بِئْرٍ فِي الدَّارِ، فَوَقَعَتْ فِيهَا، فَكَانَتْ قَبْرَهَا."
      },
      {
        "id": 11698,
        "hadith_number": "4134",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukuman bagi yang Merampas Tanah Secara Zalim",
        "perawi_melayu": "Hisham bin Urwa meriwayatkan dari bapanya:",
        "english_text": "Arwa bint Uwais disputed with Sa'id bin Zaid رضی اللہ عنہ that he had seized some of the land belonging to her. She brought this dispute before Marwan b. al-Hakam. Sa'id said: How could I take a part of her land, after what I heard from Allah's Messenger (may peace be upon'him)? He (Marwan) said: What did you hear from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ )? He said: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say: He who wrongly took a span of land would be made to wear around his neck seven earths. Marwan said: I do not ask any evidence from you after this. He (Sa'id) said: O Allah, make her blind if she has told a lie and kill her in her own land. He (the narrator) said: She did not die until she had lost her eyesight, and (one day) as she was walking in her land, she fell down into a pit and died.",
        "malay_translation": "Arwa binti Uwais berselisih dengan Sa'id bin Zaid رضي الله عنه bahawa dia telah merampas sebahagian daripada tanah miliknya. Dia membawa perselisihan ini kepada Marwan bin al-Hakam. Sa'id berkata: Bagaimana mungkin aku mengambil sebahagian daripada tanahnya, setelah apa yang aku dengar daripada Rasulullah (ﷺ)? Dia (Marwan) berkata: Apa yang kamu dengar daripada Rasulullah (ﷺ)? Dia berkata: Aku mendengar Rasulullah (ﷺ) bersabda: Sesiapa yang mengambil tanah secara zalim walau seinci pun, akan dipakaikan di lehernya tujuh lapis bumi. Marwan berkata: Aku tidak meminta sebarang bukti daripada kamu selepas ini. Dia (Sa'id) berkata: Ya Allah, butakanlah penglihatannya jika dia berdusta dan matikanlah dia di tanahnya sendiri. Dia (perawi) berkata: Dia tidak mati sehingga dia kehilangan penglihatannya, dan (pada suatu hari) semasa dia berjalan di tanahnya, dia terjatuh ke dalam lubang dan meninggal dunia.",
        "arabic_text": "حَدَّثَنَا أَبُو الرَّبِيعِ الْعَتَكِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ أَرْوَى بِنْتَ أُوَيْسٍ، ادَّعَتْ عَلَى سَعِيدِ بْنِ زَيْدٍ أَنَّهُ أَخَذَ شَيْئًا مِنْ أَرْضِهَا، فَخَاصَمَتْهُ إِلَى مَرْوَانَ بْنِ الْحَكَمِ، فَقَالَ سَعِيدٌ: أَنَا كُنْتُ آخُذُ مِنْ أَرْضِهَا شَيْئًا بَعْدَ الَّذِي سَمِعْتُ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: وَمَا سَمِعْتَ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «مَنْ أَخَذَ شِبْرًا مِنَ الْأَرْضِ ظُلْمًا، طُوِّقَهُ إِلَى سَبْعِ أَرَضِينَ»، فَقَالَ لَهُ مَرْوَانُ: لَا أَسْأَلُكَ بَيِّنَةً بَعْدَ هَذَا، فَقَالَ: «اللهُمَّ، إِنْ كَانَتْ كَاذِبَةً فَعَمِّ بَصَرَهَا، وَاقْتُلْهَا فِي أَرْضِهَا»، قَالَ: «فَمَا مَاتَتْ حَتَّى ذَهَبَ بَصَرُهَا، ثُمَّ بَيْنَا هِيَ تَمْشِي فِي أَرْضِهَا، إِذْ وَقَعَتْ فِي حُفْرَةٍ فَمَاتَتْ»."
      },
      {
        "id": 11699,
        "hadith_number": "4135",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukuman Bagi yang Merampas Sejengkal Tanah",
        "perawi_melayu": "Sa'id bin Zaid رضي الله عنه meriwayatkan:",
        "english_text": "I heard Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say: He who took a span of earth wrongly would be made to wear around his neck seven earths on the Day of Resurrection.",
        "malay_translation": "Saya mendengar Rasulullah ﷺ bersabda: Sesiapa yang mengambil sejengkal tanah secara zalim, dia akan dipakaikan di lehernya tujuh lapis bumi pada Hari Kiamat.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ سَعِيدِ بْنِ زَيْدٍ، قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ أَخَذَ شِبْرًا مِنَ الْأَرْضِ ظُلْمًا، فَإِنَّهُ يُطَوَّقُهُ يَوْمَ الْقِيَامَةِ مِنْ سَبْعِ أَرَضِينَ»."
      },
      {
        "id": 11700,
        "hadith_number": "4136",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukuman Mengambil Tanah Secara Haram",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه) meriwayatkan:",
        "english_text": "Allah's Messenger (ﷺ) as saying: One should not take a span of land without having legitimate right to it, otherwise Allah would make him wear (around his neck) seven earths on the Day of Resurrection.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: \"Seseorang tidak boleh mengambil sebidang tanah tanpa hak yang sah, jika tidak Allah akan memakaikannya (di lehernya) tujuh lapis bumi pada Hari Kiamat.\"",
        "arabic_text": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَأْخُذُ أَحَدٌ شِبْرًا مِنَ الْأَرْضِ بِغَيْرِ حَقِّهِ، إِلَّا طَوَّقَهُ اللهُ إِلَى سَبْعِ أَرَضِينَ يَوْمَ الْقِيَامَةِ»."
      },
      {
        "id": 11701,
        "hadith_number": "4137",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukuman Merampas Sebidang Tanah",
        "perawi_melayu": "Muhammad bin Ibrahim meriwayatkan bahawa Abu Salama meriwayatkan kepada beliau:",
        "english_text": "There was between him and his people dispute over a piece of land, and he came to 'A'isha رضی اللہ عنہا and mentioned that to her, whereupon she said: Abu Salama, abstain from getting this land, for Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: He who usurps even a span of land would be made to wear around his neck seven earths.",
        "malay_translation": "Terdapat pertikaian antara beliau dan kaumnya mengenai sebidang tanah, lalu beliau datang kepada 'A'ishah رضي الله عنها dan menyebutkan hal itu kepadanya. Kemudian, beliau berkata: Wahai Abu Salama, jauhi daripada mendapatkan tanah ini, kerana Rasulullah ﷺ bersabda: Sesiapa yang merampas walaupun sehasta tanah, nescaya dia akan dipakaikan di lehernya tujuh lapis bumi.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، حَدَّثَنَا عَبْدُ الصَّمَدِ يَعْنِي ابْنَ عَبْدِ الْوَارِثِ، حَدَّثَنَا حَرْبٌ وَهُوَ ابْنُ شَدَّادٍ، حَدَّثَنَا يَحْيَى وَهُوَ ابْنُ أَبِي كَثِيرٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، أَنَّ أَبَا سَلَمَةَ، حَدَّثَهُ، وَكَانَ بَيْنَهُ وَبَيْنَ قَوْمِهِ خُصُومَةٌ فِي أَرْضٍ، وَأَنَّهُ دَخَلَ عَلَى عَائِشَةَ فَذَكَرَ ذَلِكَ لَهَا، فَقَالَتْ: يَا أَبَا سَلَمَةَ اجْتَنِبِ الْأَرْضَ، فَإِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «مَنْ ظَلَمَ قِيدَ شِبْرٍ مِنَ الْأَرْضِ، طُوِّقَهُ مِنْ سَبْعِ أَرَضِينَ»."
      },
      {
        "id": 11702,
        "hadith_number": "4138",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Laporan Serupa daripada Abu Salama tentang Hadith 'Aishah",
        "perawi_melayu": "Abu Salama",
        "english_text": "Abu Salama narrated that he entered upon  'Aishah... a similar report (as no. 4137).",
        "malay_translation": "Abu Salama meriwayatkan bahawa dia masuk menemui 'Aishah... sebuah laporan yang serupa (seperti no. 4137).",
        "arabic_text": "وحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا حَبَّانُ بْنُ هِلَالٍ، أَخْبَرَنَا أَبَانُ، حَدَّثَنَا يَحْيَى، أَنَّ مُحَمَّدَ بْنَ إِبْرَاهِيمَ، حَدَّثَهُ أَنَّ أَبَا سَلَمَةَ، حَدَّثَهُ، أَنَّهُ دَخَلَ عَلَى عَائِشَةَ، فَذَكَرَ مِثْلَهُ."
      },
      {
        "id": 11703,
        "hadith_number": "4139",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Lebar Jalan Jika Berlaku Perselisihan",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When you disagree about a path, its breadth should be made seven cubits.",
        "malay_translation": "Rasulullah ﷺ bersabda: \"Apabila kamu berselisih tentang jalan, hendaklah lebarnya dibuat tujuh hasta.",
        "arabic_text": "حَدَّثَنِي أَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ، حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنْ يُوسُفَ بْنِ عَبْدِ اللهِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا اخْتَلَفْتُمْ فِي الطَّرِيقِ، جُعِلَ عَرْضُهُ سَبْعَ أَذْرُعٍ»."
      }
    ]
  }
}