{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 88,
    "data": [
      {
        "id": 11818,
        "hadith_number": "4254",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Bersumpah dengan Nama Bapa",
        "perawi_melayu": "Umar bin al-Khattib رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Allah, the Great and Majestic, forbids you to swear by your fathers. Umar رضی اللہ عنہ said: By Allah. I have never sworn (by my father) since I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbidding it mentioning them on my behalf nor on behalf of someone else.",
        "malay_translation": "Rasulullah ﷺ bersabda: Allah, Yang Maha Agung dan Maha Mulia, melarang kamu bersumpah dengan nama bapa-bapa kamu. Umar رضي الله عنه berkata: Demi Allah, aku tidak pernah bersumpah (dengan nama bapa) sejak aku mendengar Rasulullah ﷺ melarangnya, baik menyebut nama mereka bagi pihakku mahupun bagi pihak orang lain.",
        "arabic_text": "وحَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، ح وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللهِ، عَنْ أَبِيهِ، قَالَ: سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللهَ عَزَّ وَجَلَّ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ»، قَالَ عُمَرُ: «فَوَاللهِ مَا حَلَفْتُ بِهَا مُنْذُ سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهَا ذَاكِرًا، وَلَا آثِرًا."
      },
      {
        "id": 11819,
        "hadith_number": "4255",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Bersumpah Selain Allah",
        "perawi_melayu": "Hadith ini diriwayatkan dari Zuhri, kecuali dalam hadith yang diriwayatkan dari Uqail.",
        "english_text": "I did not take oath by (anyone else except Allah) since I heard Allah's Messenger forbidding it. nor did I speak in such terms, and the narrator did not say, on my own behalf or on behalf of someone else .",
        "malay_translation": "Saya tidak bersumpah dengan (selain Allah) sejak saya mendengar Rasulullah SAW melarangnya. Saya juga tidak berkata dalam perkataan sedemikian, dan perawi tidak mengatakan, bagi pihak saya sendiri atau bagi pihak orang lain.",
        "arabic_text": "وحَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَا: حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، كِلَاهُمَا عَنِ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ مِثْلَهُ، غَيْرَ أَنَّ فِي حَدِيثِ عُقَيْلٍ: مَا حَلَفْتُ بِهَا مُنْذُ سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْهَا، وَلَا تَكَلَّمْتُ بِهَا، وَلَمْ يَقُلْ ذَاكِرًا، وَلَا آثِرًا."
      },
      {
        "id": 11820,
        "hadith_number": "4256",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Rasulullah ﷺ Mendengar 'Umar Bersumpah dengan Nama Bapanya",
        "perawi_melayu": "Salim meriwayatkan daripada bapanya:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) heard 'Umar رضی اللہ عنہ while he was taking oath by his father. The rest of the hadith is the same.",
        "malay_translation": "Rasulullah ﷺ mendengar 'Umar رضي الله عنه ketika dia bersumpah dengan nama bapanya. Selebihnya hadis adalah sama.",
        "arabic_text": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالُوا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ: سَمِعَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عُمَرَ وَهُوَ يَحْلِفُ بِأَبِيهِ بِمِثْلِ رِوَايَةِ يُونُسَ، وَمَعْمَرٍ."
      },
      {
        "id": 11821,
        "hadith_number": "4257",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Bersumpah Selain Allah",
        "perawi_melayu": "Abdullah (bin Umar) رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) found, Umar bin al-Khattab رضی اللہ عنہ amongst the riders and he was taking oath by his father Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) called them (saying); Our Allah, the Exated and Majestic, has forbidden you that you take oath by your father. He who bag to take an oath, he must take it by Allah or keep quiet.",
        "malay_translation": "Rasulullah ﷺ mendapati Umar bin al-Khattab رضي الله عنه di kalangan penunggang kuda dan dia sedang bersumpah dengan nama bapanya. Rasulullah ﷺ memanggil mereka (seraya bersabda): 'Sesungguhnya Allah, Maha Tinggi dan Maha Agung, telah melarang kamu daripada bersumpah dengan nama bapa kamu. Sesiapa yang ingin bersumpah, hendaklah dia bersumpah dengan nama Allah atau diam sahaja.'",
        "arabic_text": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، وَاللَّفْظُ لَهُ، أَخْبَرَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللهِ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ أَدْرَكَ عُمَرَ بْنَ الْخَطَّابِ فِي رَكْبٍ، وَعُمَرُ يَحْلِفُ بِأَبِيهِ، فَنَادَاهُمْ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَلَا إِنَّ اللهَ عَزَّ وَجَلَّ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ، فَمَنْ كَانَ حَالِفًا فَلْيَحْلِفْ بِاللهِ أَوْ لِيَصْمُتْ"
      },
      {
        "id": 11822,
        "hadith_number": "4258",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Riwayat Hadith Melalui Rantaian Perawi Lain",
        "perawi_melayu": "Tiada Maklumat (Riwayat ini diriwayatkan dari Ibn Umar)",
        "english_text": "This hadith is narrated on the authority of Ibn Umar رضی اللہ عنہ through another chain of transmitters.",
        "malay_translation": "Hadith ini diriwayatkan daripada Ibn Umar رضی اللہ عنہ melalui satu lagi rantaian perawi.",
        "arabic_text": "وحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ، عَنْ عُبَيْدِ اللهِ، ح وحَدَّثَنِي بِشْرُ بْنُ هِلَالٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ، ح وحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الْوَلِيدِ بْنِ كَثِيرٍ، ح وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، ح وحَدَّثَنَا ابْنُ رَافِعٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنَا الضَّحَّاكُ، وَابْنُ أَبِي ذِئْبٍ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ رَافِعٍ، عَنْ عَبْدِ الرَّزَّاقِ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي عَبْدُ الْكَرِيمِ، كُلُّ هَؤُلَاءِ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ بِمِثْلِ هَذِهِ الْقِصَّةِ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّم."
      },
      {
        "id": 11823,
        "hadith_number": "4259",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Bersumpah Selain dengan Nama Allah",
        "perawi_melayu": "Ibnu Umar رضي الله عنه meriwayatkan bahawa Rasulullah ﷺ bersabda:",
        "english_text": "He who has to take an oath, he must not take oath but by Allah. The Quraish used to take oath by their fathers. So he (the Holy Prophet ﷺ) said: Do not take oath by your fathers.",
        "malay_translation": "Sesiapa yang ingin bersumpah, hendaklah dia bersumpah hanya dengan nama Allah. Kaum Quraisy dahulu sering bersumpah dengan nama bapa-bapa mereka. Maka Baginda (Nabi ﷺ) bersabda: Janganlah kamu bersumpah dengan nama bapa-bapa kamu.",
        "arabic_text": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ حُجْرٍ، قَالَ يَحْيَى بْنُ يَحْيَى: أَخْبَرَنَا، وقَالَ الْآخَرُونَ: حَدَّثَنَا إِسْمَاعِيلُ وَهُوَ ابْنُ جَعْفَرٍ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، أَنَّهُ سَمِعَ ابْنَ عُمَرَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَانَ حَالِفًا فَلَا يَحْلِفْ إِلَّا بِاللهِ»، وَكَانَتْ قُرَيْشٌ تَحْلِفُ بِآبَائِهَا، فَقَالَ: «لَا تَحْلِفُوا بِآبَائِكُمْ."
      },
      {
        "id": 11824,
        "hadith_number": "4260",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kewajipan Mengucapkan Syahadah dan Sedekah",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who takes an oath in the course of which he says: By Lat (and al-'Uzza), he should say: There is no god but Allah; and that if anyone says to his friend: Come and I will gamble with you, he should pay sadaqa.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Sesiapa yang bersumpah dengan menyebut: Demi Lat (dan al-'Uzza), maka hendaklah dia mengucapkan: Tiada Tuhan selain Allah; dan sesiapa yang berkata kepada rakannya: Marilah, aku akan berjudi denganmu, maka hendaklah dia bersedekah.",
        "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، ح وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: مَنْ حَلَفَ مِنْكُمْ، فَقَالَ فِي حَلِفِهِ: بِاللَّاتِ، فَلْيَقُلْ: لَا إِلَهَ إِلَّا اللهُ، وَمَنْ قَالَ لِصَاحِبِهِ: تَعَالَ أُقَامِرْكَ، فَلْيَتَصَدَّقْ."
      },
      {
        "id": 11825,
        "hadith_number": "4261",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Riwayat dari Az-Zuhri Mengenai Sumpah dan Sedekah",
        "perawi_melayu": "Tiada maklumat perawi",
        "english_text": "It was narrated from Az-zuhri with this chain (a hadith similar to no. 4260), and the hadith of Ma'mar is like the Hadith of Yunus, except that he said: \"Let him give something in charity.\" In the hadith of Al-Awza'iit say: \"Whoever swears by al-Lat aand -Uzza.\"\r\nAbu Al-Hussain Muslim said: This phrase meaning: \"Come, I will gamble with you\" - was  not narrated by anyone except Az-Zuhri had approximately ninety phrases which he narrated from prophet ﷺ and no one else narrated them with any reliable chaain of narrators.",
        "malay_translation": "Diriwayatkan daripada Az-Zuhri dengan sanad ini (hadis yang serupa dengan no. 4260), dan hadis Ma'mar adalah seperti Hadis Yunus, kecuali bahawa dia berkata: \"Hendaklah dia bersedekah.\" Dalam hadis Al-Awza'i, dinyatakan: \"Sesiapa yang bersumpah dengan al-Lat dan al-Uzza.\"\r\nAbu Al-Hussain Muslim berkata: Frasa ini bermaksud: \"Mari, saya akan berjudi dengan kamu\" - tidak diriwayatkan oleh sesiapa pun kecuali Az-Zuhri mempunyai kira-kira sembilan puluh frasa yang diriwayatkannya daripada Nabi ﷺ dan tiada siapa pun selainnya meriwayatkannya dengan sanad yang boleh dipercayai.",
        "arabic_text": "وحَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنِ الْأَوْزَاعِيِّ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَا: حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، كِلَاهُمَا عَنِ الزُّهْرِيِّ، بِهَذَا الْإِسْنَادِ، وَحَدِيثُ مَعْمَرٍ مِثْلُ حَدِيثِ يُونُسَ غَيْرَ أَنَّهُ قَالَ: فَلْيَتَصَدَّقْ بِشَيْءٍ، وَفِي حَدِيثِ الْأَوْزَاعِيِّ: «مَنْ حَلَفَ بِاللَّاتِ وَالْعُزَّى»، قَالَ أَبُو الْحُسَيْنِ مُسْلِمٌ: هَذَا الْحَرْفُ يَعْنِي قَوْلَهُ تَعَالَى أُقَامِرْكَ فَلْيَتَصَدَّقْ، لَا يَرْوِيهِ أَحَدٌ غَيْرُ الزُّهْرِيِّ، قَالَ: وَلِلزُّهْرِيِّ نَحْوٌ مِنْ تِسْعِينَ حَدِيثًا يَرْوِيهِ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، لَا يُشَارِكُهُ فِيهِ أَحَدٌ بِأَسَانِيدَ جِيَادٍ."
      },
      {
        "id": 11826,
        "hadith_number": "4262",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Bersumpah dengan Berhala dan Bapa",
        "perawi_melayu": "Abdul-Rahman bin Samura رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Do not swear by idols, nor by your fathers.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: \"Janganlah kamu bersumpah dengan berhala, dan janganlah bersumpah dengan bapa-bapa kamu.\"",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الْأَعْلَى، عَنْ هِشَامٍ، عَنِ الْحَسَنِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَحْلِفُوا بِالطَّوَاغِي، وَلَا بِآبَائِكُمْ."
      },
      {
        "id": 11827,
        "hadith_number": "4263",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kurniaan Allah Melalui Rasulullah (ﷺ): Kisah Unta dan Sumpah",
        "perawi_melayu": "Abu Musa al-Ash'ari رضي الله عنه meriwayatkan:",
        "english_text": "I came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) along with a group of Ash'arites requesting to give us a mount. He (the Holy Prophet ﷺ) said: By Allah, I cannot provide you with a mount, and there is nothing with me which I should give you as a ride. He (the narrator) said: We stayed there as long as Allah willed. Then there were brought to him (to the Holy Prophet ﷺ) camels. He (the Holy Prophet ﷺ) then ordered to give us three white humped camels, We started and said (or some of us said to the others): Allah will not bless us. We came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) begging him to provide us with riding camels. He swore that he could not provide us with a mount, but later on he provided us with that. They (some of the Prophet's Companions) came and informed him about this (rankling of theirs), whereupon he said: It was not I who provided you with a mount, but Allah has provided you with that. So far as I am concerned, by Allah, if He so wills, I would not swear, but if, later on, I would see better than it, I (would break the vow) and expiate it and do that which is better.",
        "malay_translation": "Saya datang kepada Rasulullah (صلی اللہ علیہ وسلم) bersama-sama sekumpulan orang Ash'arites meminta untuk memberi kami tunggangan. Baginda (ﷺ) bersabda: Demi Allah, saya tidak dapat memberi anda tunggangan, dan tiada apa-apa pun dengan saya untuk saya berikan kepada anda sebagai kenderaan. Perawi berkata: Kami tinggal di sana selama mana yang Allah kehendaki. Kemudian dibawa kepada Baginda (ﷺ) unta. Baginda (ﷺ) kemudian memerintahkan untuk memberi kami tiga ekor unta bonggol putih. Kami pun memulakan perjalanan dan berkata (atau sebahagian daripada kami berkata kepada yang lain): Allah tidak akan memberkati kami. Kami datang kepada Rasulullah (صلی اللہ علیہ وسلم) memohon kepada baginda untuk menyediakan kami dengan unta tunggangan. Baginda bersumpah bahawa baginda tidak dapat menyediakan kami dengan tunggangan, tetapi kemudian baginda menyediakan kami dengan itu. Mereka (sebahagian daripada Sahabat Nabi) datang dan memaklumkan kepada baginda tentang perkara ini (kerisauan mereka), lalu baginda bersabda: Bukanlah aku yang menyediakan kamu dengan tunggangan, tetapi Allah telah menyediakan kamu dengan itu. Sejauh yang saya ketahui, demi Allah, jika Dia menghendaki, saya tidak akan bersumpah, tetapi jika, kemudian, saya melihat lebih baik daripada itu, saya (akan membatalkan sumpah) dan menebusnya dan melakukan perkara yang lebih baik.",
        "arabic_text": "حَدَّثَنَا خَلَفُ بْنُ هِشَامٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَيَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، وَاللَّفْظُ لِخَلَفٍ، قَالُوا: حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ غَيْلَانَ بْنِ جَرِيرٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ، قَالَ: أَتَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي رَهْطٍ مِنَ الْأَشْعَرِيِّينَ نَسْتَحْمِلُهُ، فَقَالَ: «وَاللهِ لَا أَحْمِلُكُمْ، وَمَا عِنْدِي مَا أَحْمِلُكُمْ عَلَيْهِ»، قَالَ: فَلَبِثْنَا مَا شَاءَ اللهُ، ثُمَّ أُتِيَ بِإِبِلٍ، فَأَمَرَ لَنَا بِثَلَاثِ ذَوْدٍ غُرِّ الذُّرَى، فَلَمَّا انْطَلَقْنَا قُلْنَا: - أَوْ قَالَ بَعْضُنَا لِبَعْضٍ: - لَا يُبَارِكُ اللهُ لَنَا، أَتَيْنَا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَسْتَحْمِلُهُ، فَحَلَفَ أَنْ لَا يَحْمِلَنَا، ثُمَّ حَمَلَنَا، فَأَتَوْهُ فَأَخْبَرُوهُ، فَقَالَ: «مَا أَنَا حَمَلْتُكُمْ وَلَكِنَّ اللهَ حَمَلَكُمْ، وَإِنِّي وَاللهِ إِنْ شَاءَ اللهُ لَا أَحْلِفُ عَلَى يَمِينٍ، ثُمَّ أَرَى خَيْرًا مِنْهَا، إِلَّا كَفَّرْتُ عَنْ يَمِينِي، وَأَتَيْتُ الَّذِي هُوَ خَيْرٌ."
      },
      {
        "id": 11828,
        "hadith_number": "4264",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Nabi ﷺ Menyediakan Kenderaan untuk Rakan-rakan Abu Musa Al-Asy'ari",
        "perawi_melayu": "Abu Musa رضي الله عنه meriwayatkan:",
        "english_text": "My friends sent me to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) asking him to provide them with mounts as they were going along with him in jaish al-'Usrah (the army of destitutes or of meagre means or army setting out during the hard times and that is the occasion of the expedition of Tabuk) I said: Apostle of Allah, my friends have sent me to you so that you may provide them with mounts. He (the Holy Prophet ﷺ) said: By Allah, I cannot provide you with anything to ride. And it so happened that he was at that time much perturbed. I little knew of it, so I came back with a heavy heart on account of the refusal of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and the fear that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) might have some feelings against me. I returned to my friends and informed them about what Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had said. I had hardly stayed for a little that I heard Bilal رضی اللہ عنہ calling: 'Abdullah bin Qais. I responded to his call. He said: Hasten to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), he is calling you, When I came to the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) he said: Take this pair, this pair, and this pair (i.e. six camels which he had bought from Sa'd رضی اللہ عنہ), and take them to y, our friends and say: Verily Allah (or he said: Verily Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) has provided you with these animals. So ride upon them. Abu Musa رضی اللہ عنہ said: I went along with them to my friends and said: Verily Allah's messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) has provided you with these animals for riding; but by Allah, I shall not leave you until some of you go along with me to him who had heard the talk of Allah's Messenger (ﷺ) then I asked him for you, and his refusal for the first time, and then his granting them to me subsequently; so you should not think that I narrated to you something which he did not say. They said to me: By Allah, in our opinion you are certainly truthful, and we would do as you like. So Abu Musa رضی اللہ عنہ  went along with some of the men from them until they came to those who had heard the words of Allah's Messenger (ﷺ) and his refusal to (provide) them with (animals) ; and subsequently his granting (the animals) to them; and they narrated to them exactly as Abu Masa رضی اللہ عنہ had narrated to them.",
        "malay_translation": "Sahabat-sahabatku mengutusku kepada Rasulullah ﷺ untuk meminta baginda menyediakan tunggangan kerana mereka akan bersama baginda dalam Jaish al-'Usrah (tentera orang yang serba kekurangan atau tentera yang keluar pada waktu yang sukar dan itulah ketika peperangan Tabuk). Aku berkata: Wahai Rasulullah, sahabat-sahabatku telah mengutusku kepadamu supaya engkau menyediakan tunggangan untuk mereka. Baginda (Nabi ﷺ) bersabda: Demi Allah, aku tidak dapat menyediakan apa-apa untuk kamu tunggangi. Dan pada waktu itu baginda kelihatan sangat terganggu. Aku tidak mengetahui hal itu, maka aku kembali dengan hati yang berat kerana penolakan Rasulullah ﷺ, dan khuatir Rasulullah ﷺ mempunyai perasaan yang tidak baik terhadapku. Aku kembali kepada sahabat-sahabatku dan memberitahu mereka tentang apa yang telah dikatakan Rasulullah ﷺ. Belum berapa lama aku berada di sana, aku mendengar Bilal رضي الله عنه memanggil: 'Abdullah bin Qais. Aku menyahut panggilannya. Dia berkata: Segeralah kepada Rasulullah ﷺ, baginda memanggilmu. Apabila aku datang kepada Nabi ﷺ, baginda bersabda: Ambillah pasangan ini, pasangan ini, dan pasangan ini (iaitu enam ekor unta yang telah dibeli daripada Sa'd رضي الله عنه), dan bawalah mereka kepada sahabat-sahabatmu dan katakan: Sesungguhnya Allah (atau baginda berkata: Sesungguhnya Rasulullah ﷺ) telah menyediakan haiwan-haiwan ini untukmu. Maka tunggangilah mereka. Abu Musa رضي الله عنه berkata: Aku pergi bersama mereka kepada sahabat-sahabatku dan berkata: Sesungguhnya Rasulullah ﷺ telah menyediakan haiwan-haiwan ini untuk ditunggangi; tetapi demi Allah, aku tidak akan meninggalkanmu sehingga sebahagian daripada kamu pergi bersamaku kepada orang yang telah mendengar ucapan Rasulullah ﷺ, kemudian aku memintanya untukmu, dan penolakannya untuk kali pertama, dan kemudian pemberiannya kepada mereka kemudiannya; jadi janganlah kamu menyangka bahawa aku menceritakan kepadamu sesuatu yang tidak dikatakannya. Mereka berkata kepadaku: Demi Allah, pada pandangan kami, engkau sememangnya benar, dan kami akan lakukan seperti yang engkau suka. Maka Abu Musa رضي الله عنه pergi bersama sebahagian lelaki daripada mereka sehingga mereka datang kepada orang yang telah mendengar kata-kata Rasulullah ﷺ dan penolakannya untuk (menyediakan) mereka dengan (haiwan); dan kemudian pemberiannya (haiwan) kepada mereka; dan mereka menceritakan kepada mereka dengan tepat seperti yang diceritakan oleh Abu Musa رضي الله عنه kepada mereka.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللهِ بْنُ بَرَّادٍ الْأَشْعَرِيُّ، وَمُحَمَّدُ بْنُ الْعَلَاءِ الْهَمْدَانِيُّ، وَتَقَارَبَا فِي اللَّفْظِ، قَالَا: حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ: أَرْسَلَنِي أَصْحَابِي إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَسْأَلُهُ لَهُمُ الْحُمْلَانَ، إِذْ هُمْ مَعَهُ فِي جَيْشِ الْعُسْرَةِ، وَهِيَ غَزْوَةُ تَبُوكَ، فَقُلْتُ: يَا نَبِيَّ اللهِ، إِنَّ أَصْحَابِي أَرْسَلُونِي إِلَيْكَ لِتَحْمِلَهُمْ، فَقَالَ: «وَاللهِ لَا أَحْمِلُكُمْ عَلَى شَيْءٍ»، وَوَافَقْتُهُ وَهُوَ غَضْبَانُ وَلَا أَشْعُرُ، فَرَجَعْتُ حَزِينًا مِنْ مَنْعِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَمِنْ مَخَافَةِ أَنْ يَكُونَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَدْ وَجَدَ فِي نَفْسِهِ عَلَيَّ، فَرَجَعْتُ إِلَى أَصْحَابِي، فَأَخْبَرْتُهُمُ الَّذِي قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَلَمْ أَلْبَثْ إِلَّا سُوَيْعَةً إِذْ سَمِعْتُ بِلَالًا يُنَادِي: أَيْ عَبْدَ اللهِ بْنَ قَيْسٍ فَأَجَبْتُهُ، فَقَالَ: أَجِبْ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَدْعُوكَ، فَلَمَّا أَتَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: خُذْ هَذَيْنِ الْقَرِينَيْنِ، وَهَذَيْنِ الْقَرِينَيْنِ، وَهَذَيْنِ الْقَرِينَيْنِ، لِسِتَّةِ أَبْعِرَةٍ ابْتَاعَهُنَّ حِينَئِذٍ مِنْ سَعْدٍ، فَانْطَلِقْ بِهِنَّ إِلَى أَصْحَابِكَ، فَقُلْ: إِنَّ اللهَ - أَوْ قَالَ: إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - يَحْمِلُكُمْ عَلَى هَؤُلَاءِ فَارْكَبُوهُنَّ ، قَالَ أَبُو مُوسَى: فَانْطَلَقْتُ إِلَى أَصْحَابِي بِهِنَّ، فَقُلْتُ: إِنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَحْمِلُكُمْ عَلَى هَؤُلَاءِ، وَلَكِنْ وَاللهِ لَا أَدَعُكُمْ حَتَّى يَنْطَلِقَ مَعِي بَعْضُكُمْ إِلَى مَنْ سَمِعَ مَقَالَةَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حِينَ سَأَلْتُهُ لَكُمْ، وَمَنْعَهُ فِي أَوَّلِ مَرَّةٍ، ثُمَّ إِعْطَاءَهُ إِيَّايَ بَعْدَ ذَلِكَ، لَا تَظُنُّوا أَنِّي حَدَّثْتُكُمْ شَيْئًا لَمْ يَقُلْهُ، فَقَالُوا لِي: وَاللهِ إِنَّكَ عِنْدَنَا لَمُصَدَّقٌ، وَلَنَفْعَلَنَّ مَا أَحْبَبْتَ، فَانْطَلَقَ أَبُو مُوسَى بِنَفَرٍ مِنْهُمْ، حَتَّى أَتَوُا الَّذِينَ سَمِعُوا قَوْلَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَمَنْعَهُ إِيَّاهُمْ، ثُمَّ إِعْطَاءَهُمْ بَعْدُ، فَحَدَّثُوهُمْ بِمَا حَدَّثَهُمْ بِهِ أَبُو مُوسَى سَوَاءً."
      },
      {
        "id": 11829,
        "hadith_number": "4265",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Abu Musa dan Rasulullah ﷺ Berkaitan dengan Makanan Burung dan Lafaz Sumpah",
        "perawi_melayu": "Ayyub berkata: \"Hadis Al-Qasim lebih dikenali oleh saya daripada Hadis Abu Qilabah. Beliau berkata:",
        "english_text": "We were sitting in the company of Abu Musa رضی اللہ عنہ that he called for food and it consisted of flesh of fowl. It was then that a person from Banu Tamim visited him. His complexion was red having the resemblance of a slave. He said to him: Come and (join me in food). He showed reluctance. He (Abu Masa رضی اللہ عنہ) said: Come on, for I saw Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) eating it (fowl's meat), whereupon that person said: I saw it eating something (of filth and rubbish) and I found it repugnant and took an oath that I would never eat that. He (Abu Muds) said: Come, so that I would narrate to you about that (the incident pertaining to vow). (And he narrated thus): I came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) along with a group of people belonging to the tribe of Ash'ari, asking him to provide us with riding camels. He (the Holy Prophet ﷺ) said: By Allah, I cannot provide you with riding animals. And there is nothing with me with which I can provide you a mount. We stayed (for some time) there as Allah willed, and there was brought to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) booty of camels. He called us and commanded that we should be given five white humped camels. As we were about to go back, some of us said to the other: As we made Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forget oath, there would be no blessing for us (in his gift). We went back to him and said: Allah's Messenger ﷺ, we came to you to provide us with riding animals and you took an oath that you would never equip us with mounts and then you have provided us with the riding beasts Allah's Messenger ﷺ, have you forgotten? Thereupon he said: I swear by Allah that if Allah so wills, I shall not swear an oath, and then consider something else to be better than it without making atonement for my oath and doing the thing that is better. So you go; Allah, the Exalted and Glorious, has given you riding animals.",
        "malay_translation": "Kami sedang duduk bersama Abu Musa رضي الله عنه, lalu beliau meminta makanan yang terdiri daripada daging ayam. Kemudian datanglah seorang lelaki dari Bani Tamim menemuinya. Wajahnya kemerahan menyerupai seorang hamba. Beliau berkata kepadanya: Marilah (makan bersamaku). Lelaki itu enggan. Beliau (Abu Musa رضي الله عنه) berkata: Marilah, kerana saya melihat Rasulullah ﷺ memakannya (daging ayam), lalu lelaki itu berkata: Saya melihatnya memakan sesuatu (yang kotor dan sampah) dan saya merasa jijik dan bersumpah bahawa saya tidak akan memakannya. Beliau (Abu Musa) berkata: Marilah, agar saya menceritakan kepada kamu tentang hal itu (peristiwa yang berkaitan dengan sumpah). (Dan beliau menceritakannya begini): Saya datang kepada Rasulullah ﷺ bersama-sama dengan sekumpulan orang dari suku Ash'ari, meminta kepada baginda untuk memberikan kami unta tunggangan. Baginda (Nabi ﷺ) bersabda: Demi Allah, saya tidak dapat memberikan kamu haiwan tunggangan. Dan tidak ada sesuatu pun pada saya yang boleh saya berikan kepada kamu untuk ditunggangi. Kami tinggal (untuk beberapa waktu) di sana seperti yang Allah kehendaki, dan dibawa kepada Rasulullah ﷺ harta rampasan berupa unta. Baginda memanggil kami dan memerintahkan agar kami diberi lima ekor unta berpunuk putih. Ketika kami hendak pulang, sebahagian daripada kami berkata kepada yang lain: Oleh kerana kami membuat Rasulullah ﷺ lupa akan sumpah, tidak akan ada keberkatan bagi kami (dalam pemberian baginda). Kami kembali kepada baginda dan berkata: Ya Rasulullah ﷺ, kami datang kepada kamu untuk meminta haiwan tunggangan dan kamu bersumpah bahawa kamu tidak akan memberikan kami tunggangan, dan kemudian kamu telah memberikan kami binatang tunggangan. Ya Rasulullah ﷺ, adakah kamu lupa? Baginda kemudian bersabda: Saya bersumpah demi Allah, bahawa jika Allah menghendaki, saya tidak akan bersumpah, dan kemudian menganggap sesuatu yang lain lebih baik daripada itu tanpa membuat penebusan dosa untuk sumpah saya dan melakukan perkara yang lebih baik. Jadi pergilah kamu; Allah, Yang Maha Tinggi dan Maha Mulia, telah memberikan kamu haiwan tunggangan.",
        "arabic_text": "حَدَّثَنِي أَبُو الرَّبِيعِ الْعَتَكِيُّ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلَابَةَ، وَعَنِ الْقَاسِمِ بْنِ عَاصِمٍ، عَنْ زَهْدَمٍ الْجَرْمِيِّ، قَالَ أَيُّوبُ: وَأَنَا لِحَدِيثِ الْقَاسِمِ، أَحْفَظُ مِنِّي لِحَدِيثِ أَبِي قِلَابَةَ، قَالَ: كُنَّا عِنْدَ أَبِي مُوسَى فَدَعَا بِمَائِدَتِهِ وَعَلَيْهَا لَحْمُ دَجَاجٍ، فَدَخَلَ رَجُلٌ مِنْ بَنِي تَيْمِ اللهِ، أَحْمَرُ شَبِيهٌ بِالْمَوَالِي، فَقَالَ لَهُ: هَلُمَّ، فَتَلَكَّأَ، فَقَالَ: هَلُمَّ، فَإِنِّي قَدْ رَأَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ مِنْهُ، فَقَالَ الرَّجُلُ: إِنِّي رَأَيْتُهُ يَأْكُلُ شَيْئًا، فَقَذِرْتُهُ، فَحَلَفْتُ أَنْ لَا أَطْعَمَهُ، فَقَالَ: هَلُمَّ أُحَدِّثْكَ عَنْ ذَلِكَ، إِنِّي أَتَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي رَهْطٍ مِنَ الْأَشْعَرِيِّينَ نَسْتَحْمِلُهُ، فَقَالَ: «وَاللهِ لَا أَحْمِلُكُمْ وَمَا عِنْدِي مَا أَحْمِلُكُمْ عَلَيْهِ»، فَلَبِثْنَا مَا شَاءَ اللهُ، فَأُتِيَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِنَهْبِ إِبِلٍ، فَدَعَا بِنَا، فَأَمَرَ لَنَا بِخَمْسِ ذَوْدٍ غُرِّ الذُّرَى، قَالَ: فَلَمَّا انْطَلَقْنَا، قَالَ بَعْضُنَا لِبَعْضٍ: أَغْفَلْنَا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَمِينَهُ، لَا يُبَارَكُ لَنَا، فَرَجَعْنَا إِلَيْهِ، فَقُلْنَا: يَا رَسُولَ اللهِ، إِنَّا أَتَيْنَاكَ نَسْتَحْمِلُكَ، وَإِنَّكَ حَلَفْتَ أَنْ لَا تَحْمِلَنَا، ثُمَّ حَمَلْتَنَا أَفَنَسِيتَ يَا رَسُولَ اللهِ؟ قَالَ: «إِنِّي وَاللهِ إِنْ شَاءَ اللهُ، لَا أَحْلِفُ عَلَى يَمِينٍ، فَأَرَى غَيْرَهَا خَيْرًا مِنْهَا، إِلَّا أَتَيْتُ الَّذِي هُوَ خَيْرٌ وَتَحَلَّلْتُهَا، فَانْطَلِقُوا فَإِنَّمَا حَمَلَكُمُ اللهُ عَزَّ وَجَلَّ."
      },
      {
        "id": 11830,
        "hadith_number": "4266",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kasih Sayang dan Persaudaraan antara Kabilah Jarm dan Ash'ari",
        "perawi_melayu": "Diriwayatkan daripada Zahdam Al-Jarmi:",
        "english_text": "\"There was love and brotherhood between this clan of Jarm and the Ash'ari رضی اللہ عنہ and some food containing chicken was brought to him... and he narrated some similar (as Hadith no. 4265).\"",
        "malay_translation": "\"Terdapat kasih sayang dan persaudaraan antara kabilah Jarm dan Al-Ash'ari رضى الله عنه, dan makanan yang mengandungi ayam dibawa kepadanya... dan dia meriwayatkan sesuatu yang serupa (seperti Hadith no. 4265).\"",
        "arabic_text": "وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلَابَةَ، وَالْقَاسِمِ التَّمِيمِيِّ، عَنْ زَهْدَمٍ الْجَرْمِيِّ، قَالَ: كَانَ بَيْنَ هَذَا الْحَيِّ مِنْ جَرْمٍ وَبَيْنَ الْأَشْعَرِيِّينَ وُدٌّ وَإِخَاءٌ، فَكُنَّا عِنْدَ أَبِي مُوسَى الْأَشْعَرِيِّ، فَقُرِّبَ إِلَيْهِ طَعَامٌ فِيهِ لَحْمُ دَجَاجٍ، فَذَكَرَ نَحْوَهُ."
      },
      {
        "id": 11831,
        "hadith_number": "4267",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Zahdam al-Jarmi bersama Abu Musa",
        "perawi_melayu": "Tiada maklumat (Zahdam al-Jarmi)",
        "english_text": "Zahdam al-Jarmi reported: We were in the company of Abu Musa. The rest of the hadith is the same.",
        "malay_translation": "Zahdam al-Jarmi meriwayatkan: Kami bersama Abu Musa. Selebihnya hadis adalah sama.",
        "arabic_text": "وحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ نُمَيْرٍ، عَنْ إِسْمَاعِيلَ ابْنِ عُلَيَّةَ، عَنْ أَيُّوبَ، عَنِ الْقَاسِمِ التَّمِيمِيِّ، عَنْ زَهْدَمٍ الْجَرْمِيِّ، ح وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلَابَةَ، عَنْ زَهْدَمٍ الْجَرْمِيِّ، ح وحَدَّثَنِي أَبُو بَكْرِ بْنُ إِسْحَاقَ، حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلَابَةَ، وَالْقَاسِمِ، عَنْ زَهْدَمٍ الْجَرْمِيِّ، قَالَ: كُنَّا عِنْدَ أَبِي مُوسَى وَاقْتَصُّوا جَمِيعًا الْحَدِيثَ بِمَعْنَى حَدِيثِ حَمَّادِ بْنِ زَيْدٍ."
      },
      {
        "id": 11832,
        "hadith_number": "4268",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Saksi Abu Musa Memakan Daging Ayam",
        "perawi_melayu": "Zahdam al-Jarmi meriwayatkan:",
        "english_text": "I visited Abu Musa رضی اللہ عنہ and lie was eating fowl's meat. The rest of the hadith is the same with this addition that he (the Holy Prophet) said: By Allah, I did not forget it.",
        "malay_translation": "Saya melawat Abu Musa رضي الله عنه dan beliau sedang makan daging ayam. Selebihnya hadis adalah sama dengan tambahan ini bahawa baginda (Nabi SAW) bersabda: Demi Allah, saya tidak melupakannya.",
        "arabic_text": "وحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا الصَّعْقُ يَعْنِي ابْنَ حَزْنٍ، حَدَّثَنَا مَطَرٌ الْوَرَّاقُ، حَدَّثَنَا زَهْدَمٌ الْجَرْمِيُّ، قَالَ: دَخَلْتُ عَلَى أَبِي مُوسَى وَهُوَ يَأْكُلُ لَحْمَ دَجَاجٍ، وَسَاقَ الْحَدِيثَ بِنَحْوِ حَدِيثِهِمْ وَزَادَ فِيهِ، قَالَ: «إِنِّي وَاللهِ مَا نَسِيتُهَا."
      },
      {
        "id": 11833,
        "hadith_number": "4269",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Permintaan Kenderaan dan Jawapan Nabi ﷺ",
        "perawi_melayu": "Abu Musa al-Ash'ari رضي الله عنه meriwayatkan:",
        "english_text": "We came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) requesting him to provide us with riding camels. He (the Holy Prophet ﷺ) said: There is nothing with me with which I should equip you. By Allah, I would not provide you with (riding camels). Then Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent to us three camels with spotted bumps. We said: We came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) asking him to equip us with riding animals. He took an oath that he could not equip us. We came to him and informed him. He said: By Allah, I do not take an oath, but when I find the other thing better than that, I do that which is better.",
        "malay_translation": "Kami datang kepada Rasulullah ﷺ meminta baginda menyediakan kami unta tunggangan. Baginda ﷺ bersabda: \"Tidak ada padaku sesuatu yang boleh kupergunakan untuk melengkapkan kamu.\" Demi Allah, aku tidak akan menyediakan kamu dengan (unta tunggangan). Kemudian Rasulullah ﷺ mengutus kepada kami tiga ekor unta yang mempunyai bonggol yang berbintik-bintik. Kami berkata: \"Kami datang kepada Rasulullah ﷺ meminta baginda melengkapkan kami dengan haiwan tunggangan.\" Baginda bersumpah bahawa baginda tidak dapat melengkapkan kami. Kami datang kepada baginda dan memaklumkan kepada baginda. Baginda bersabda: \"Demi Allah, aku tidak bersumpah, tetapi apabila aku mendapati perkara lain lebih baik daripada itu, aku melakukan apa yang lebih baik.\"",
        "arabic_text": "وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ ضُرَيْبِ بْنِ نُقَيْرٍ الْقَيْسِيِّ، عَنْ زَهْدَمٍ، عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ، قَالَ: أَتَيْنَا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَسْتَحْمِلُهُ، فَقَالَ: «مَا عِنْدِي مَا أَحْمِلُكُمْ، وَاللهِ مَا أَحْمِلُكُمْ»، ثُمَّ بَعَثَ إِلَيْنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِثَلَاثَةِ ذَوْدٍ بُقْعِ الذُّرَى، فَقُلْنَا: إِنَّا أَتَيْنَا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَسْتَحْمِلُهُ، فَحَلَفَ أَنْ لَا يَحْمِلَنَا، فَأَتَيْنَاهُ فَأَخْبَرْنَاهُ، فَقَالَ: «إِنِّي لَا أَحْلِفُ عَلَى يَمِينٍ، أَرَى غَيْرَهَا خَيْرًا مِنْهَا، إِلَّا أَتَيْتُ الَّذِي هُوَ خَيْرٌ."
      },
      {
        "id": 11834,
        "hadith_number": "4270",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Permintaan Kenderaan daripada Rasulullah ﷺ",
        "perawi_melayu": "Abu Musa رضي الله عنه meriwayatkan:",
        "english_text": "We walked on foot and came to Allah's Apostle (may peace he upon him) asking him to provide us with mounts. The rest of the hadith is the same.",
        "malay_translation": "Kami berjalan kaki dan datang kepada Rasulullah ﷺ meminta baginda menyediakan kenderaan untuk kami. Selebihnya hadis adalah sama.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى التَّيْمِيُّ، حَدَّثَنَا الْمُعْتَمِرُ، عَنْ أَبِيهِ، حَدَّثَنَا أَبُو السَّلِيلِ، عَنْ زَهْدَمٍ، يُحَدِّثُهُ عَنْ أَبِي مُوسَى، قَالَ: كُنَّا مُشَاةً فَأَتَيْنَا نَبِيَّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَسْتَحْمِلُهُ بِنَحْوِ حَدِيثِ جَرِيرٍ."
      },
      {
        "id": 11835,
        "hadith_number": "4271",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Orang yang Bersumpah dan Mendapati Sesuatu yang Lebih Baik",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "A person sat late in the night with Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and then came to his family and found that his children had gone to sleep. His wife brought food for him. but he took an oath that he would not eat because of his children (having gone to sleep without food) He then gave precedence (of breaking the vow and then expiating it) and ate the food He then came to Allah s Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and made mention of that to him, whereupon Allah's Messenger (ﷺ) said: He who took an oath and (later on) found something better than that should do that, and expiate for (breaking) his vow.",
        "malay_translation": "Seorang lelaki duduk lewat malam bersama Rasulullah (صلى الله عليه وسلم), kemudian pulang ke keluarganya dan mendapati anak-anaknya telah tidur. Isterinya menghidangkan makanan untuknya, tetapi dia bersumpah tidak akan makan kerana anak-anaknya (telah tidur tanpa makanan). Kemudian dia mengutamakan (membatalkan sumpah dan menebusnya) dan memakan makanan itu. Kemudian dia datang kepada Rasulullah (صلى الله عليه وسلم) dan menceritakan hal itu kepadanya, lalu Rasulullah (ﷺ) bersabda: \"Sesiapa yang bersumpah dan (kemudian) mendapati sesuatu yang lebih baik daripada itu, maka lakukanlah, dan bayarlah kafarah (untuk membatalkan) sumpahnya.\"",
        "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ، أَخْبَرَنَا يَزِيدُ بْنُ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: أَعْتَمَ رَجُلٌ عِنْدَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ثُمَّ رَجَعَ إِلَى أَهْلِهِ فَوَجَدَ الصِّبْيَةَ قَدْ نَامُوا، فَأَتَاهُ أَهْلُهُ بِطَعَامِهِ، فَحَلَفَ لَا يَأْكُلُ مِنْ أَجْلِ صِبْيَتِهِ، ثُمَّ بَدَا لَهُ فَأَكَلَ، فَأَتَى رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ حَلَفَ عَلَى يَمِينٍ، فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا، فَلْيَأْتِهَا، وَلْيُكَفِّرْ عَنْ يَمِينِهِ."
      },
      {
        "id": 11836,
        "hadith_number": "4272",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kaffarah Sumpah dan Melakukan Perkara yang Lebih Baik",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: He who took an oath and then found another thing better than (this) should expiate for the oath (broken) by him and do (the better thing).",
        "malay_translation": "Rasulullah (صلى الله عليه وسلم) bersabda: Sesiapa yang bersumpah, kemudian mendapati perkara lain yang lebih baik daripada (sumpah) itu, maka hendaklah dia membayar kaffarah sumpah (yang telah dimungkiri) dan melakukan (perkara yang lebih baik itu).",
        "arabic_text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي مَالِكٌ، عَنْ سُهَيْلِ بْنِ أَبِي، صَالِحٍ عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيُكَفِّرْ عَنْ يَمِينِهِ وَلْيَفْعَلْ ‏\"‏ ‏.‏"
      },
      {
        "id": 11837,
        "hadith_number": "4273",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kewajipan Memenuhi Perkara yang Lebih Baik Setelah Bersumpah",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who took an oath and (later on) found another thing better than that, he should do that which is better, and expiate for the vow (broken by him).",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Sesiapa yang bersumpah, kemudian mendapati perkara lain yang lebih baik daripada sumpahnya itu, maka hendaklah dia melakukan perkara yang lebih baik itu dan membayar kafarah atas sumpah (yang dilanggarnya).",
        "arabic_text": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا ابْنُ أَبِي أُوَيْسٍ، حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ الْمُطَّلِبِ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ حَلَفَ عَلَى يَمِينٍ، فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا، فَلْيَأْتِ الَّذِي هُوَ خَيْرٌ، وَلْيُكَفِّرْ عَنْ يَمِينِهِ."
      },
      {
        "id": 11838,
        "hadith_number": "4274",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kaffarah Sumpah dan Melakukan Perkara yang Lebih Baik",
        "perawi_melayu": "Hadith ini diriwayatkan dari Suhail dengan rantaian periwayat yang sama (dengan lafaz ini):",
        "english_text": "He should expiate for (breaking) the vow and do that which is better.",
        "malay_translation": "Hendaklah dia membayar kaffarah (melanggar) sumpah dan melakukan perkara yang lebih baik.",
        "arabic_text": "وحَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّا، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنِي سُلَيْمَانُ يَعْنِي ابْنَ بِلَالٍ، حَدَّثَنِي سُهَيْلٌ، فِي هَذَا الْإِسْنَادِ بِمَعْنَى حَدِيثِ مَالِكٍ: «فَلْيُكَفِّرْ يَمِينَهُ، وَلْيَفْعَلِ الَّذِي هُوَ خَيْرٌ."
      },
      {
        "id": 11839,
        "hadith_number": "4275",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Pengemis dan Sumpah 'Adi bin Hatim",
        "perawi_melayu": "Tamim bin Tarafa meriwayatkan:",
        "english_text": "A beggar came to 'Adi bin Hatim رضی اللہ عنہ and he begged him to give him the price of a slave, or some portion of the price of the slave. He ('Adi) said: I have nothing to give you except my coat-of-mail and helmet. I will, however, write to my family to give that to you, but he did not agree to that. Thereupon 'Adi رضی اللہ عنہ was enraged, and said: By Allah, I will not give you anything. The person (then) agreed to accept that, whereupon he said: By Allah, had I not heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saying: He who took an oath, but then found something more pious in the sight of Allah, he should (break the oath) and do that which is more pious, I would not have broken the oath (and thus paid you anything).",
        "malay_translation": "Seorang pengemis datang kepada 'Adi bin Hatim رضی اللہ عنہ dan dia meminta kepadanya untuk memberikan harga seorang hamba, atau sebahagian daripada harga hamba tersebut. Dia ('Adi) berkata: Saya tidak mempunyai apa-apa untuk diberikan kepada kamu kecuali baju besi dan topi keledar saya. Walau bagaimanapun, saya akan menulis kepada keluarga saya untuk memberikan itu kepada kamu, tetapi dia tidak bersetuju dengan itu. Kemudian 'Adi رضی اللہ عنہ berang, dan berkata: Demi Allah, saya tidak akan memberikan apa-apa kepada kamu. Orang itu (kemudian) bersetuju untuk menerima itu, lalu dia berkata: Demi Allah, sekiranya saya tidak mendengar Rasulullah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) bersabda: Sesiapa yang bersumpah, tetapi kemudian mendapati sesuatu yang lebih soleh di sisi Allah, dia hendaklah (membatalkan sumpah) dan melakukan perkara yang lebih soleh, saya tidak akan membatalkan sumpah (dan dengan itu membayar apa-apa kepada kamu).",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عَبْدِ الْعَزِيزِ يَعْنِي ابْنَ رُفَيْعٍ، عَنْ تَمِيمِ بْنِ طَرَفَةَ، قَالَ: جَاءَ سَائِلٌ إِلَى عَدِيِّ بْنِ حَاتِمٍ، فَسَأَلَهُ نَفَقَةً فِي ثَمَنِ خَادِمٍ - أَوْ فِي بَعْضِ ثَمَنِ خَادِمٍ - فَقَالَ: لَيْسَ عِنْدِي مَا أُعْطِيكَ إِلَّا دِرْعِي، وَمِغْفَرِي، فَأَكْتُبُ إِلَى أَهْلِي أَنْ يُعْطُوكَهَا، قَالَ: فَلَمْ يَرْضَ، فَغَضِبَ عَدِيٌّ، فَقَالَ: أَمَا وَاللهِ لَا أُعْطِيكَ شَيْئًا، ثُمَّ إِنَّ الرَّجُلَ رَضِيَ، فَقَالَ: أَمَا وَاللهِ لَوْلَا أَنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «مَنْ حَلَفَ عَلَى يَمِينٍ، ثُمَّ رَأَى أَتْقَى لِلَّهِ مِنْهَا، فَلْيَأْتِ التَّقْوَى» مَا حَنَّثْتُ يَمِينِي."
      },
      {
        "id": 11840,
        "hadith_number": "4276",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keutamaan Melakukan Perkara yang Lebih Baik daripada Sumpah",
        "perawi_melayu": "Adi bin Hatim رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who took an oath, but he found something else better than that, should do that which is better and break his oath.",
        "malay_translation": "Rasulullah ﷺ bersabda: “Sesiapa yang bersumpah, kemudian dia mendapati sesuatu yang lebih baik daripada apa yang disumpah, maka hendaklah dia melakukan yang lebih baik itu dan membatalkan sumpahnya.”",
        "arabic_text": "وحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، عَنْ تَمِيمِ بْنِ طَرَفَةَ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ:مَنْ حَلَفَ عَلَى يَمِينٍ، فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا، فَلْيَأْتِ الَّذِي هُوَ خَيْرٌ، وَلْيَتْرُكْ يَمِينَهُ."
      },
      {
        "id": 11841,
        "hadith_number": "4277",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kaffarah Sumpah dan Pilihan yang Lebih Baik",
        "perawi_melayu": "Adi رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When anyone amongst you takes an oath, but he finds (something) better than that he should expiate (the breaking of the oath), and do that which is better.",
        "malay_translation": "Rasulullah ﷺ bersabda: “Apabila seseorang di antara kamu bersumpah, kemudian dia mendapati (sesuatu) yang lebih baik daripada sumpah itu, maka hendaklah dia membayar kaffarah (kerana membatalkan sumpah) dan melakukan yang lebih baik itu.",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، وَمُحَمَّدُ بْنُ طَرِيفٍ الْبَجَلِيُّ، وَاللَّفْظُ لِابْنِ طَرِيفٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنِ الْأَعْمَشِ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، عَنْ تَمِيمٍ الطَّائِيِّ، عَنْ عَدِيٍّ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا حَلَفَ أَحَدُكُمْ عَلَى الْيَمِينِ، فَرَأَى خَيْرًا مِنْهَا، فَلْيُكَفِّرْهَا، وَلْيَأْتِ الَّذِي هُوَ خَيْرٌ."
      },
      {
        "id": 11842,
        "hadith_number": "4278",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadis Riwayat Adi bin Hatim melalui Rantaian Perawi Lain",
        "perawi_melayu": "Adi bin Hatim (رضي الله عنه)",
        "english_text": "This hadith is reported on the authority of Adi bin Hatim رضی اللہ عنہ through another chain of transmitters.",
        "malay_translation": "Hadis ini diriwayatkan daripada Adi bin Hatim رضي الله عنه melalui satu lagi rantaian perawi.",
        "arabic_text": "وحَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنِ الشَّيْبَانِيِّ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، عَنْ تَمِيمٍ الطَّائِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ ذَلِكَ."
      },
      {
        "id": 11843,
        "hadith_number": "4279",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah 'Adi bin Hatim dan Sumpah yang Lebih Baik",
        "perawi_melayu": "Tamim bin Tarafa meriwayatkan bahawa beliau mendengar 'Adi bin Hatim رضي الله عنه berkata:",
        "english_text": "A person came to him and asked for one hundred dirhams. He ('Adi) said: You asked me for one hundred dirhams and I am the son of Hatim; by Allah, I will not give you. But then he said: (I would have done that) if I had not heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say: He who takes an oath, but then finds something better than that, should do that which is better.",
        "malay_translation": "Seorang datang kepadanya dan meminta seratus dirham. Beliau ('Adi) berkata: Kamu meminta seratus dirham dariku, dan aku adalah anak Hatim; demi Allah, aku tidak akan memberikannya kepadamu. Tetapi kemudian beliau berkata: (Aku akan melakukan hal itu) jika aku tidak mendengar Rasulullah (صلی اللہ علیہ وسلم) bersabda: Sesiapa yang bersumpah, tetapi kemudian mendapati sesuatu yang lebih baik daripada itu, maka hendaklah dia melakukan yang lebih baik.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ تَمِيمِ بْنِ طَرَفَةَ، قَالَ: سَمِعْتُ عَدِيَّ بْنَ حَاتِمٍ، وَأَتَاهُ رَجُلٌ يَسْأَلُهُ مِائَةَ دِرْهَمٍ، فَقَالَ: تَسْأَلُنِي مِائَةَ دِرْهَمٍ، وَأَنَا ابْنُ حَاتِمٍ، وَاللهِ لَا أُعْطِيكَ، ثُمَّ قَالَ: لَوْلَا أَنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «مَنْ حَلَفَ عَلَى يَمِينٍ، ثُمَّ رَأَى خَيْرًا مِنْهَا، فَلْيَأْتِ الَّذِي هُوَ خَيْرٌ."
      },
      {
        "id": 11844,
        "hadith_number": "4280",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kurniaan Empat Ratus Dirham",
        "perawi_melayu": "Tamim bin Tarafa meriwayatkan:",
        "english_text": "I heard 'Adi bin Hatim رضی اللہ عنہ say that a person asked that and then narrated (the hadith) like one (mentioned above), but he made this addition: Here are four hundred (dirhams) for you out of my gift.",
        "malay_translation": "Saya mendengar 'Adi bin Hatim رضي الله عنه berkata bahawa seorang lelaki bertanya tentang perkara itu, kemudian meriwayatkan (hadith) seperti yang (disebutkan di atas), tetapi beliau menambahkan: \"Ini adalah empat ratus (dirham) untukmu daripada pemberianku.\"",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا سِمَاكُ بْنُ حَرْبٍ، قَالَ: سَمِعْتُ تَمِيمَ بْنَ طَرَفَةَ، قَالَ: سَمِعْتُ عَدِيَّ بْنَ حَاتِمٍ، أَنَّ رَجُلًا سَأَلَهُ، فَذَكَرَ مِثْلَهُ، وَزَادَ وَلَكَ أَرْبَعَمِائَةٍ فِي عَطَائِي."
      },
      {
        "id": 11845,
        "hadith_number": "4281",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Nasihat Rasulullah SAW kepada Abdul-Rahman bin Samura tentang Jawatan dan Sumpah",
        "perawi_melayu": "Abdul-Rahman bin Samura رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to me: Abdul-Rahman bin Samura, don't ask for authority for if it is granted to you for asking for it, you would be commissioned for it (without having the support of Allah), but if you are granted it without your asking for it. You would be helped (by Allah) in it. And when you take an oath and find something else better than that, expiate for (breaking) your oath, and do that which is better. This hadith has also been transmitted on the authority of Ibn Farrukh.",
        "malay_translation": "Rasulullah ﷺ bersabda kepada saya: Wahai Abdul-Rahman bin Samura, janganlah kamu meminta jawatan. Sesungguhnya jika kamu diberi jawatan kerana memintanya, nescaya kamu akan diserahkan kepadanya (tanpa pertolongan Allah), tetapi jika kamu diberi jawatan tanpa memintanya, nescaya kamu akan dibantu (oleh Allah) di dalamnya. Dan apabila kamu bersumpah dan kamu mendapati sesuatu yang lebih baik daripada sumpah itu, maka bayarlah kafarah (tebusan) sumpahmu, dan lakukanlah perkara yang lebih baik. Hadith ini juga diriwayatkan daripada Ibn Farrukh.",
        "arabic_text": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، حَدَّثَنَا الْحَسَنُ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَمُرَةَ، قَالَ: قَالَ لِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَا عَبْدَ الرَّحْمَنِ بْنَ سَمُرَةَ، لَا تَسْأَلِ الْإِمَارَةَ، فَإِنَّكَ إِنْ أُعْطِيتَهَا عَنْ مَسْأَلَةٍ وُكِلْتَ إِلَيْهَا، وَإِنْ أُعْطِيتَهَا عَنْ غَيْرِ مَسْأَلَةٍ أُعِنْتَ عَلَيْهَا، وَإِذَا حَلَفْتَ عَلَى يَمِينٍ، فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا، فَكَفِّرْ عَنْ يَمِينِكَ، وَائْتِ الَّذِي هُوَ خَيْرٌ»، قَالَ أَبُو أَحْمَدَ الْجُلُودِيُّ: حَدَّثَنَا أَبُو الْعَبَّاسِ الْمَاسَرْجِسِيُّ، حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَاجَرِيرِ بنِ حَازِمٍ بِهَذَا الِاسنَادٍ."
      },
      {
        "id": 11846,
        "hadith_number": "4282",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Riwayat Hadith: Abdul-Rahman bin Samura (Radiyallahu Anhu)",
        "perawi_melayu": "Tiada maklumat",
        "english_text": "This hadith has been narrated on the authority of 'Abdul-Rahman bin Samura رضی اللہ عنہ through another chain of transmitters but there is no mention of the word authority .",
        "malay_translation": "Hadith ini telah diriwayatkan daripada Abdul-Rahman bin Samura رضی اللہ عنہ melalui satu lagi rantaian perawi, tetapi tidak disebut perkataan 'kuasa'.",
        "arabic_text": "حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، حَدَّثَنَا هُشَيْمٌ، عَنْ يُونُسَ وَمَنْصُورٍ، وَحُمَيْدٍ، ح وحَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ سِمَاكِ بْنِ عَطِيَّةَ، وَيُونُسَ بْنِ عُبَيْدٍ، وَهِشَامِ بْنِ حَسَّانَ، فِي آخَرِينَ، ح وحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا الْمُعْتَمِرُ، عَنْ أَبِيهِ، ح وحَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ، حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، كُلُّهُمْ عَنِ الْحَسَنِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ، وَلَيْسَ فِي حَدِيثِ الْمُعْتَمِرِ، عَنْ أَبِيهِ ذِكْرُ الْإِمَارَةِ."
      },
      {
        "id": 11847,
        "hadith_number": "4283",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Sumpah Hendaklah Berkaitan dengan Perkara yang Dipercayai",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Your oath should be about something regarding which your companion will believe you. 'Amr said: By which your companion will believe you.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: \"Sumpah kamu hendaklah mengenai sesuatu yang mana sahabatmu akan mempercayai kamu.\" 'Amr berkata: \"Yang mana sahabatmu akan mempercayai kamu.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَعَمْرٌو النَّاقِدُ، قَالَ يَحْيَى: أَخْبَرَنَا هُشَيْمُ بْنُ بَشِيرٍ، عَنْ عَبْدِ اللهِ بْنِ أَبِي صَالِحٍ، وقَالَ عَمْرٌو: حَدَّثَنَا هُشَيْمُ بْنُ بَشِيرٍ، أَخْبَرَنَا عَبْدُ اللهِ بْنُ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَمِينُكَ عَلَى مَا يُصَدِّقُكَ عَلَيْهِ صَاحِبُكَ»، وقَالَ عَمْرٌو: يُصَدِّقُكَ بِهِ صَاحِبُكَ."
      },
      {
        "id": 11848,
        "hadith_number": "4284",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Tafsiran Sumpah Berdasarkan Niat",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: An oath is to be interpreted according to the intention of the one who takes it.",
        "malay_translation": "Rasulullah ﷺ bersabda: Sumpah itu ditafsirkan berdasarkan niat orang yang bersumpah.",
        "arabic_text": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ هُشَيْمٍ، عَنْ عَبَّادِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْيَمِينُ عَلَى نِيَّةِ الْمُسْتَحْلِفِ."
      },
      {
        "id": 11849,
        "hadith_number": "4285",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Nabi Sulaiman dan Ujian Kehendak Allah",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "(Hadrat) Sulaiman had sixty wives. He (one day) said: I will visit each one of them every night, and every one of them will become pregnant and give birth to a male child who will be a horseman and fight in the cause of Allah. But (it so happened) that none of them became pregnant except one, but she gave birth to an incomplete child. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Had he said Insha' Allah (if God so wills), then every one of them would have given birth to a child who would have been a horseman and fought in the cause of Allah",
        "malay_translation": "Nabi Sulaiman mempunyai enam puluh orang isteri. Pada suatu hari, baginda berkata: 'Aku akan mendatangi setiap mereka pada setiap malam, dan setiap mereka akan hamil dan melahirkan seorang anak lelaki yang akan menjadi seorang penunggang kuda dan berjuang di jalan Allah.' Tetapi (ternyata) tidak seorang pun daripada mereka hamil kecuali seorang, tetapi dia melahirkan seorang anak yang tidak sempurna. Kemudian Rasulullah ﷺ bersabda: 'Sekiranya dia berkata InsyaAllah (jika Allah menghendaki), nescaya setiap mereka akan melahirkan seorang anak yang akan menjadi penunggang kuda dan berjuang di jalan Allah.",
        "arabic_text": "حَدَّثَنِي أَبُو الرَّبِيعِ الْعَتَكِيُّ، وَأَبُو كَامِلٍ الْجَحْدَرِيُّ فُضَيْلُ بْنُ حُسَيْنٍ، وَاللَّفْظُ لِأَبِي الرَّبِيعِ، قَالَا: حَدَّثَنَا حَمَّادٌ وَهُوَ ابْنُ زَيْدٍ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: كَانَ لِسُلَيْمَانَ سِتُّونَ امْرَأَةً، فَقَالَ: لَأَطُوفَنَّ عَلَيْهِنَّ اللَّيْلَةَ، فَتَحْمِلُ كُلُّ وَاحِدَةٍ مِنْهُنَّ، فَتَلِدُ كُلُّ وَاحِدَةٍ مِنْهُنَّ غُلَامًا فَارِسًا يُقَاتِلُ فِي سَبِيلِ اللهِ، فَلَمْ تَحْمِلْ مِنْهُنَّ إِلَّا وَاحِدَةٌ، فَوَلَدَتْ نِصْفَ إِنْسَانٍ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَوْ كَانَ اسْتَثْنَى لَوَلَدَتْ كُلُّ وَاحِدَةٍ مِنْهُنَّ غُلَامًا فَارِسًا، يُقَاتِلُ فِي سَبِيلِ اللهِ."
      },
      {
        "id": 11850,
        "hadith_number": "4286",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Nabi Sulaiman dan Keinginan yang Tidak Kesampaian",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying that Sulaiman bin Dawud, the Messenger of Allah, observed: I will have an intercourse with seventy wives during the night; all of them will give birth to a male child who will fight in the cause of Allah. His companion or the ang I said to him: Say, If God wills. But he (Hadrat Sulaimin) did not say so, and he forgot it. And none of his wives gave birth to a child, but one who gave birth to a premature child. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Had he said Insha' Allah (if God so will). he would not have failed and his desire would have been materialised.",
        "malay_translation": "Rasulullah ﷺ bersabda bahawa Sulaiman bin Dawud, Rasulullah, berkata: 'Aku akan bersetubuh dengan tujuh puluh orang isteri pada malam itu; kesemua mereka akan melahirkan seorang anak lelaki yang akan berjuang di jalan Allah.' Sahabatnya atau malaikat berkata kepadanya: 'Katakan, Jika Allah menghendaki.' Tetapi dia (Hadrat Sulaiman) tidak mengatakannya, dan dia terlupa. Dan tiada seorang pun daripada isterinya melahirkan anak, kecuali seorang yang melahirkan anak pramatang. Rasulullah ﷺ bersabda: 'Sekiranya dia berkata Insya-Allah (jika Allah menghendaki), dia tidak akan gagal dan hasratnya akan tercapai.'",
        "arabic_text": "وحَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، وَابْنُ أَبِي عُمَرَ، وَاللَّفْظُ لِابْنِ أَبِي عُمَرَ، قَالَا: حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامِ بْنِ حُجَيْرٍ، عَنْ طَاوُسٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: قَالَ سُلَيْمَانُ بْنُ دَاوُدَ نَبِيُّ اللهِ: لَأَطُوفَنَّ اللَّيْلَةَ عَلَى سَبْعِينَ امْرَأَةً، كُلُّهُنَّ تَأْتِي بِغُلَامٍ يُقَاتِلُ فِي سَبِيلِ اللهِ، فَقَالَ لَهُ صَاحِبُهُ - أَوِ الْمَلَكُ -: قُلْ: إِنْ شَاءَ اللهُ، فَلَمْ يَقُلْ وَنَسِيَ، فَلَمْ تَأْتِ وَاحِدَةٌ مِنْ نِسَائِهِ إِلَّا وَاحِدَةٌ جَاءَتْ بِشِقِّ غُلَامٍ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: وَلَوْ قَالَ: إِنْ شَاءَ اللهُ، لَمْ يَحْنَثْ، وَكَانَ دَرَكًا لَهُ فِي حَاجَتِهِ."
      },
      {
        "id": 11851,
        "hadith_number": "4287",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Riwayat Abu Hurairah: Satu Sanad Lain",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "Abu Huraira رضی اللہ عنہ reported this hadith from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) through another chain of transmitters.",
        "malay_translation": "Abu Hurairah رضي الله عنه meriwayatkan hadith ini daripada Rasulullah ﷺ melalui satu lagi rangkaian perawi.",
        "arabic_text": "وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ أَوْ نَحْوَهُ."
      },
      {
        "id": 11852,
        "hadith_number": "4288",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Nabi Sulaiman dan Keajaiban Insha' Allah",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Sulaiman bin Dawud said: I will certainly have intercourse with seventy wives during the night, and every wife amongst them will give birth to a child, who will fight in the cause of Allah. It was said to him: Say: Insha' Allah (God willing), but he did not say so and forgot it. He went round them but none of them give birth to a child except one woman and that too was an incomplete person. Upon this Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: If he had said Insha' Allah. he would not have failed, and his desire must have been fulfilled.",
        "malay_translation": "Sulaiman bin Dawud berkata: \"Sesungguhnya aku akan bersama dengan tujuh puluh orang isteri pada malam itu, dan setiap isteri akan melahirkan seorang anak yang akan berjuang di jalan Allah.\" Dikatakan kepadanya: \"Katakanlah Insha' Allah (Jika Allah mengizinkan),\" tetapi dia tidak mengatakannya dan terlupa. Beliau mendekati mereka, tetapi tiada seorang pun daripada mereka yang melahirkan anak kecuali seorang wanita, dan itu pun seorang yang tidak sempurna. Rasulullah ﷺ bersabda: \"Sekiranya dia berkata Insha' Allah, nescaya dia tidak akan gagal, dan keinginannya pasti akan dipenuhi.",
        "arabic_text": "وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ بْنُ هَمَّامٍ، أَخْبَرَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ سُلَيْمَانُ بْنُ دَاوُدَ: لَأُطِيفَنَّ اللَّيْلَةَ عَلَى سَبْعِينَ امْرَأَةً، تَلِدُ كُلُّ امْرَأَةٍ مِنْهُنَّ غُلَامًا يُقَاتِلُ فِي سَبِيلِ اللهِ، فَقِيلَ لَهُ: قُلْ إِنْ شَاءَ اللهُ، فَلَمْ يَقُلْ، فَأَطَافَ بِهِنَّ، فَلَمْ تَلِدْ مِنْهُنَّ إِلَّا امْرَأَةٌ وَاحِدَةٌ نِصْفَ إِنْسَانٍ، قَالَ: فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: لَوْ قَالَ: إِنْ شَاءَ اللهُ لَمْ يَحْنَثْ، وَكَانَ دَرَكًا لِحَاجَتِهِ."
      },
      {
        "id": 11853,
        "hadith_number": "4289",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Nabi Sulaiman dan Ucapkan 'Insya-Allah'",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying that Sulaiman bin Dawud (once) said: I will go round in the night to my ninety wives, and every one of them will give birth to a child (who will grow up) as a horseman and fight in the cause of Allah His companions said to him: Say Insha' Allah. but he did not say Inshii' Allah. He went round all of them but none of them became pregnant but one, and she gave birth to a premature child. And by Him in Whose hand is the life of Muhammad, if he had said, Insha' Allah (his wives would have given birth to the children who would all have grown up into horsemen and fought in the way of Allah).",
        "malay_translation": "Rasulullah ﷺ bersabda bahawa Sulaiman bin Dawud عليه السلام pernah berkata: \"Aku akan mengelilingi (bersama) sembilan puluh isteriku pada waktu malam, dan setiap daripada mereka akan melahirkan seorang anak (yang akan membesar) sebagai seorang penunggang kuda dan berjuang di jalan Allah.\" Para sahabatnya berkata kepadanya: \"Katakan Insya-Allah.\" tetapi beliau tidak berkata Insya-Allah. Beliau mengelilingi mereka semua, tetapi tiada seorang pun daripada mereka yang hamil kecuali seorang, dan dia melahirkan seorang anak yang pramatang. Demi Tuhan yang di tangan-Nya nyawa Muhammad, sekiranya beliau berkata, Insya-Allah (isterinya akan melahirkan anak-anak yang semuanya akan membesar menjadi penunggang kuda dan berjuang di jalan Allah).",
        "arabic_text": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنِي وَرْقَاءُ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: قَالَ سُلَيْمَانُ بْنُ دَاوُدَ: لَأَطُوفَنَّ اللَّيْلَةَ عَلَى تِسْعِينَ امْرَأَةً كُلُّهَا تَأْتِي بِفَارِسٍ يُقَاتِلُ فِي سَبِيلِ اللهِ، فَقَالَ لَهُ صَاحِبُهُ: قُلْ: إِنْ شَاءَ اللهُ، فَلَمْ يَقُلْ: إِنْ شَاءَ اللهُ، فَطَافَ عَلَيْهِنَّ جَمِيعًا، فَلَمْ تَحْمِلْ مِنْهُنَّ إِلَّا امْرَأَةٌ وَاحِدَةٌ، فَجَاءَتْ بِشِقِّ رَجُلٍ، وَايْمُ الَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَوْ قَالَ: إِنْ شَاءَ اللهُ لَجَاهَدُوا فِي سَبِيلِ اللهِ فُرْسَانًا أَجْمَعُونَ."
      },
      {
        "id": 11854,
        "hadith_number": "4290",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Setiap Mereka Melahirkan Anak Pejuang di Jalan Allah",
        "perawi_melayu": "Hadith ini telah diriwayatkan dari Abu Zinad dengan rangkaian perawi yang sama dengan variasi (kata-kata ini):",
        "english_text": "Every one of them giving birth to a child, who would have fought in the cause of Allah.",
        "malay_translation": "Setiap daripada mereka melahirkan seorang anak, yang akan berjuang di jalan Allah.",
        "arabic_text": "وحَدَّثَنِيهِ سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا حَفْصُ بْنُ مَيْسَرَةَ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ أَبِي الزِّنَادِ، بِهَذَا الْإِسْنَادِ مِثْلَهُ، غَيْرَ أَنَّهُ قَالَ: كُلُّهَا تَحْمِلُ غُلَامًا يُجَاهِدُ فِي سَبِيلِ اللهِ."
      },
      {
        "id": 11855,
        "hadith_number": "4291",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Dosa Bersumpah Palsu Lebih Besar daripada Membayar Kifarat",
        "perawi_melayu": "Hammam bin Munabbih meriwayatkan:",
        "english_text": "This is what Abu Huraira رضی اللہ عنہ reported to us from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and he narrated a hadith and (one) of them is that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: I swear by Allah, it is more sinful in Allah's sight for one of you to persist in an oath regarding his family than payment of its expiation which Allah has imposed upon him (for breaking the oath).",
        "malay_translation": "Inilah yang diriwayatkan oleh Abu Hurairah رضي الله عنه daripada Rasulullah ﷺ, dan beliau meriwayatkan sebuah hadis yang mana Rasulullah ﷺ bersabda: Demi Allah, sesungguhnya lebih besar dosanya di sisi Allah bagi seseorang daripada kamu untuk berterusan dalam sumpahnya mengenai keluarganya daripada membayar kifaratnya yang telah difardukan Allah ke atasnya (kerana memungkiri sumpah).",
        "arabic_text": "دَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ: هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَذَكَرَ أَحَادِيثَ مِنْهَا، وَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «وَاللهِ لَأَنْ يَلَجَّ أَحَدُكُمْ بِيَمِينِهِ فِي أَهْلِهِ، آثَمُ لَهُ عِنْدَ اللهِ مِنْ أَنْ يُعْطِيَ كَفَّارَتَهُ الَّتِي فَرَضَ اللهُ."
      },
      {
        "id": 11856,
        "hadith_number": "4292",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Umar RA Memenuhi Nazar I'tikaf di Masjidil Haram",
        "perawi_melayu": "Ibn 'Umar رضي الله عنه meriwayatkan:",
        "english_text": "Umar (bin Khattab) رضی اللہ عنہ said: Messenger of Allah, I had taken a vow during the days of Ignorance (Jahiliyya) that I would observe I'tikaf for a night in the Sacred Mosque. He (the Holy Prophet) said: Fulfil your vow.",
        "malay_translation": "Umar (bin Khattab) رضي الله عنه berkata: Wahai Rasulullah, sesungguhnya aku pernah bernazar pada zaman Jahiliyyah bahawa aku akan beriktikaf selama satu malam di Masjidil Haram. Baginda (Nabi صلى الله عليه وسلم) bersabda: Tunaikanlah nazarmu.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَزُهَيْرُ بْنُ حَرْبٍ، وَاللَّفْظُ لِزُهَيْرٍ، قَالُوا: حَدَّثَنَا يَحْيَى وَهُوَ ابْنُ سَعِيدٍ الْقَطَّانُ، عَنْ عُبَيْدِ اللهِ، قَالَ: أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، أَنَّ عُمَرَ، قَالَ: يَا رَسُولَ اللهِ، إِنِّي نَذَرْتُ فِي الْجَاهِلِيَّةِ أَنْ أَعْتَكِفَ لَيْلَةً فِي الْمَسْجِدِ الْحَرَامِ، قَالَ: «فَأَوْفِ بِنَذْرِكَ."
      },
      {
        "id": 11857,
        "hadith_number": "4293",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kewajipan I'tikaf Sehari",
        "perawi_melayu": "Hadith ini (yang serupa dengan no. 4292) diriwayatkan daripada Ibnu Umar رضي الله عنه . Adapun Abu Usamah dan ath-Thaqafi, hadith mereka menyebut I'tikaf selama satu malam. Adapun Syubah, dia berkata:",
        "english_text": "\"He obliged himself to spend a day in I tikaf. In the Hadith there is no mention of  day or a night.",
        "malay_translation": "Dia mewajibkan dirinya untuk menghabiskan satu hari dalam I'tikaf. Dalam Hadith tidak ada sebutan tentang siang atau malam.",
        "arabic_text": "وحَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ، حَدَّثَنَا أَبُو أُسَامَةَ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ يَعْنِي الثَّقَفِيَّ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْعَلَاءِ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، جَمِيعًا عَنْ حَفْصِ بْنِ غِيَاثٍ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ جَبَلَةَ بْنِ أَبِي رَوَّادٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، كُلُّهُمْ عَنْ عُبَيْدِ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَو، قَالَ حَفْصٌ مِنْ بَيْنِهِمْ: عَنْ عُمَرَ بِهَذَا الْحَدِيثِ، أَمَّا أَبُو أُسَامَةَ وَالثَّقَفِيُّ، فَفِي حَدِيثِهِمَا اعْتِكَافُ لَيْلَةٍ، وَأَمَّا فِي حَدِيثِ شُعْبَةَ، فَقَالَ: جَعَلَ عَلَيْهِ يَوْمًا يَعْتَكِفُهُ، وَلَيْسَ فِي حَدِيثِ حَفْصٍ ذِكْرُ يَوْمٍ وَلَا لَيْلَةٍ."
      },
      {
        "id": 11858,
        "hadith_number": "4294",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Umar bertanya tentang I'tikaf dan Pembebasan Tawanan",
        "perawi_melayu": "Abdullah bin 'Umar رضي الله عنه meriwayatkan:",
        "english_text": "'Umar bin Khattab رضی اللہ عنہ asked the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as he was at ji'rana (a town near Mecca) on his way back from Ta'if: Messenger of Allah, I had taken a vow during the days of Ignorance that I would observe I'tikaf for one day in the Sacred Mosque. So what is your opinion? He said: Go and observe I'tikaf for a day. And Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) gave him a slave girl out of the one-fifth (of the spoils of war meant for the Holy Prophet). And when Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) set the war prisoners free. 'Umar bin Khattab رضی اللہ عنہ heard their voice as they were saying: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) has set as free. He (Hadrat 'Umar رضی اللہ عنہ) said: What is this? They said: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) has set free the prisoners of war (which had fallen to the lot of people). Thereupon he (Hadrat 'Umar رضی اللہ عنہ) said: Abdullah رضی اللہ عنہ, go to that slave-girl and set her free.",
        "malay_translation": "'Umar bin Khattab رضي الله عنه bertanya kepada Rasulullah ﷺ ketika baginda berada di Ji'rana (sebuah bandar berhampiran Mekah) dalam perjalanan pulang dari Ta'if: Wahai Rasulullah, sesungguhnya aku telah bernazar semasa zaman Jahiliah untuk melakukan I'tikaf selama sehari di Masjidil Haram. Maka, apakah pendapatmu? Baginda bersabda: Pergilah dan lakukan I'tikaf selama sehari. Dan Rasulullah ﷺ memberikan kepadanya seorang hamba perempuan daripada seperlima (daripada harta rampasan perang yang dikhaskan untuk Nabi). Dan ketika Rasulullah ﷺ membebaskan tawanan perang, 'Umar bin Khattab رضي الله عنه mendengar suara mereka berkata: Rasulullah ﷺ telah membebaskan mereka. Beliau (Hadrat 'Umar رضي الله عنه) berkata: Apakah ini? Mereka berkata: Rasulullah ﷺ telah membebaskan tawanan perang (yang menjadi hak orang ramai). Kemudian beliau (Hadrat 'Umar رضي الله عنه) berkata: Abdullah رضي الله عنه, pergilah kepada hamba perempuan itu dan bebaskannya.",
        "arabic_text": "وحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، أَنَّ أَيُّوبَ، حَدَّثَهُ أَنَّ نَافِعًا، حَدَّثَهُ أَنَّ عَبْدَ اللهِ بْنَ عُمَرَ، حَدَّثَهُ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ سَأَلَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ بِالْجِعْرَانَةِ، بَعْدَ أَنْ رَجَعَ مِنَ الطَّائِفِ، فَقَالَ: يَا رَسُولَ اللهِ، إِنِّي نَذَرْتُ فِي الْجَاهِلِيَّةِ أَنْ أَعْتَكِفَ يَوْمًا فِي الْمَسْجِدِ الْحَرَامِ، فَكَيْفَ تَرَى؟ قَالَ: «اذْهَبْ فَاعْتَكِفْ يَوْمًا»، قَالَ: وَكَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَدْ أَعْطَاهُ جَارِيَةً مِنَ الْخُمْسِ، فَلَمَّا أَعْتَقَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سَبَايَا النَّاسِ سَمِعَ عُمَرُ بْنُ الْخَطَّابِ أَصْوَاتَهُمْ يَقُولُونَ: أَعْتَقَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: مَا هَذَا؟ فَقَالُوا: أَعْتَقَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ سَبَايَا النَّاسِ، فَقَالَ عُمَرُ: يَا عَبْدَ اللهِ، اذْهَبْ إِلَى تِلْكَ الْجَارِيَةِ، فَخَلِّ سَبِيلَهَا."
      },
      {
        "id": 11859,
        "hadith_number": "4295",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Umar bertanya tentang Nazar I'tikaf",
        "perawi_melayu": "Ibnu 'Umar رضی اللہ عنہ meriwayatkan:",
        "english_text": "When Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came back from the Battle of Hunain, Umar رضی اللہ عنہ asked Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) about the vow he had taken during the days of Ignorance that he would observe I'tikaf for a day. The rest of the hadith is the same.",
        "malay_translation": "Ketika Rasulullah ﷺ kembali dari Peperangan Hunain, Umar رضی اللہ عنہ bertanya kepada Rasulullah ﷺ tentang nazar yang telah diambilnya pada zaman Jahiliyah bahawa dia akan melakukan I'tikaf selama sehari. Selebihnya hadith adalah sama.",
        "arabic_text": "وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: لَمَّا قَفَلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ حُنَيْنٍ سَأَلَ عُمَرُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ نَذْرٍ كَانَ نَذَرَهُ فِي الْجَاهِلِيَّةِ اعْتِكَافِ يَوْمٍ، ثُمَّ ذَكَرَ بِمَعْنَى حَدِيثِ جَرِيرِ بْنِ حَازِمٍ."
      },
      {
        "id": 11860,
        "hadith_number": "4296",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Nabi (ﷺ) Melakukan Umrah dari Ja'rana",
        "perawi_melayu": "Nafi' meriwayatkan:",
        "english_text": "A mention of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) observing 'Umra from ja'rina was made before Ibn 'Umar رضی اللہ عنہ . He said: He did not enter into the state of Ihram from that (place), and Umar رضی اللہ عنہ had taken a vow of observing I'tikaf for a night during the days of Ignorance. The rest of the hadith is the same.",
        "malay_translation": "Perkara mengenai Rasulullah (ﷺ) yang melaksanakan Umrah dari Ja'rana telah disebut di hadapan Ibn 'Umar رضي الله عنه. Beliau berkata: Baginda tidak memasuki ihram dari tempat itu, dan Umar رضي الله عنه pernah bernazar untuk melakukan I'tikaf selama satu malam pada zaman Jahiliyah. Selebihnya hadis adalah sama.",
        "arabic_text": "وحَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، قَالَ: ذُكِرَ عِنْدَ ابْنِ عُمَرَ عُمْرَةُ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنَ الْجِعْرَانَةِ، فَقَالَ: لَمْ يَعْتَمِرْ مِنْهَا، قَالَ: وَكَانَ عُمَرُ نَذَرَ اعْتِكَافَ لَيْلَةٍ فِي الْجَاهِلِيَّةِ، ثُمَّ ذَكَرَ نَحْوَ حَدِيثِ جَرِيرِ بْنِ حَازِمٍ، وَمَعْمَرٍ، عَنْ أَيُّوبَ."
      },
      {
        "id": 11861,
        "hadith_number": "4297",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadith Mengenai Nazar dan I'tikaf Sehari",
        "perawi_melayu": "Ibn Umar رضي الله عنه",
        "english_text": "This hadith about vow was narrated from Ibn Umar رضی اللہ عنہ (a Hadith similar to no. 4294). In both their Ahadith it mentions I tikaf for one day.",
        "malay_translation": "Hadith ini mengenai nazar diriwayatkan daripada Ibn Umar رضي الله عنه (Hadith yang serupa dengan no. 4294). Dalam kedua-dua Hadith mereka, ia menyebut mengenai I'tikaf selama satu hari.",
        "arabic_text": "وحَدَّثَنِي عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، حَدَّثَنَا حَجَّاجُ بْنُ الْمِنْهَالِ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، ح وحَدَّثَنَا يَحْيَى بْنُ خَلَفٍ، حَدَّثَنَا عَبْدُ الْأَعْلَى، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، كِلَاهُمَا عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، بِهَذَا الْحَدِيثِ فِي النَّذْرِ، وَفِي حَدِيثِهِمَا جَمِيعًا اعْتِكَافُ يَوْمٍ."
      },
      {
        "id": 11862,
        "hadith_number": "4298",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kelebihan Membebaskan Hamba",
        "perawi_melayu": "Zadhan Abl Umar meriwayatkan:",
        "english_text": "I came to Ibn 'Umar رضی اللہ عنہ as he had granted freedom to a stave. He (the narrator further) said: He took hold of a wood or something like it from the earth and said: It (freedom of a slave) has not the reward evert equal to it, but the fact that I heard Allah's Messenger (way peace be upon him) say: He who slaps his slave or beats him, the expiation for it is that he should set him free.",
        "malay_translation": "Saya datang kepada Ibnu 'Umar رضی اللہ عنہ ketika dia telah membebaskan seorang hamba. Dia (periwayat selanjutnya) berkata: Dia mengambil kayu atau sesuatu yang serupa dengannya dari tanah dan berkata: Ia (kebebasan seorang hamba) tidak mempunyai ganjaran yang setara dengannya, tetapi hakikatnya saya mendengar Rasulullah ﷺ bersabda: Sesiapa yang menampar hambanya atau memukulnya, maka kaffarahnya ialah hendaklah dia membebaskannya.",
        "arabic_text": "حَدَّثَنِي أَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ فِرَاسٍ، عَنْ ذَكْوَانَ أَبِي صَالِحٍ، عَنْ زَاذَانَ أَبِي عُمَرَ، قَالَ: أَتَيْتُ ابْنَ عُمَرَ وَقَدْ أَعْتَقَ مَمْلُوكًا، قَالَ: فَأَخَذَ مِنَ الْأَرْضِ عُودًا أَوْ شَيْئًا، فَقَالَ: مَا فِيهِ مِنَ الْأَجْرِ مَا يَسْوَى هَذَا، إِلَّا أَنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ لَطَمَ مَمْلُوكَهُ، أَوْ ضَرَبَهُ، فَكَفَّارَتُهُ أَنْ يُعْتِقَهُ."
      },
      {
        "id": 11863,
        "hadith_number": "4299",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pembebasan Hamba dan Kifarah Memukul",
        "perawi_melayu": "Zadhan meriwayatkan:",
        "english_text": "Ibn Umar رضی اللہ عنہ called his slave and he found the marks (of beating) upon his back. He said to him: I have caused you pain. He said: No. But he (Ibn Umar رضی اللہ عنہ ) said: You are free. He then took hold of something from the earth and said: There is no reward for me even to the weight equal to it. I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who beats a slave without cognizable offence of his or slaps him (without any serious fault), then expiation for it is that he should set him free.",
        "malay_translation": "Ibnu Umar رضي الله عنه memanggil hambanya dan mendapati kesan (pukulan) di belakangnya. Beliau berkata kepadanya: \"Aku telah menyebabkan kamu kesakitan.\" Dia berkata: \"Tidak.\" Tetapi beliau (Ibnu Umar رضي الله عنه) berkata: \"Kamu bebas.\" Kemudian beliau mengambil sesuatu dari tanah dan berkata: \"Tiada ganjaran bagiku walaupun seberat ini.\" Aku mendengar Rasulullah ﷺ bersabda: \"Sesiapa yang memukul hamba tanpa kesalahan yang jelas atau menamparnya (tanpa sebarang kesalahan yang serius), maka kifarahnya adalah dia membebaskannya.",
        "arabic_text": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، وَاللَّفْظُ لِابْنِ الْمُثَنَّى، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ فِرَاسٍ، قَالَ: سَمِعْتُ ذَكْوَانَ، يُحَدِّثُ عَنْ زَاذَانَ، أَنَّ ابْنَ عُمَرَ، دَعَا بِغُلَامٍ لَهُ فَرَأَى بِظَهْرِهِ أَثَرًا، فَقَالَ لَهُ: أَوْجَعْتُكَ؟ قَالَ: لَا، قَالَ: فَأَنْتَ عَتِيقٌ، قَالَ: ثُمَّ أَخَذَ شَيْئًا مِنَ الْأَرْضِ، فَقَالَ: مَا لِي فِيهِ مِنَ الْأَجْرِ مَا يَزِنُ هَذَا، إِنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ ضَرَبَ غُلَامًا لَهُ حَدًّا لَمْ يَأْتِهِ، أَوْ لَطَمَهُ، فَإِنَّ كَفَّارَتَهُ أَنْ يُعْتِقَهُ."
      },
      {
        "id": 11864,
        "hadith_number": "4300",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Memukul Hamba Tanpa Sebab",
        "perawi_melayu": "Diriwayatkan dari Firas dengan rangkaian Shubah dan Abu Awanah (Hadis serupa dengan no. 4299). Adapun Hadis Ibn Mahdi, ia berkata: \"Tanpa dia melakukan sesuatu yang menyebabkannya\". Dalam Hadis Waki ia berkata:",
        "english_text": "\"Whosever slaps his slave\" and does not mention \"Without him having done anything to deserve it.\"",
        "malay_translation": "\"Sesiapa yang menampar hambanya\" dan tidak menyebutkan \"Tanpa dia melakukan sesuatu yang menyebabkannya.\"",
        "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، كِلَاهُمَا عَنْ سُفْيَانَ، عَنْ فِرَاسٍ، بِإِسْنَادِ شُعْبَةَ، وَأَبِي عَوَانَةَ، أَمَّا حَدِيثُ ابْنِ مَهْدِيٍّ، فَذَكَرَ فِيهِ «حَدًّا لَمْ يَأْتِهِ»، وَفِي حَدِيثِ وَكِيعٍ: «مَنْ لَطَمَ عَبْدَهُ»، وَلَمْ يَذْكُرِ الْحَدَّ."
      },
      {
        "id": 11865,
        "hadith_number": "4301",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Membebaskan Hamba Sahaja",
        "perawi_melayu": "Mu'awiya bin Suwaid meriwayatkan:",
        "english_text": "I slapped a slave belonging to us and then fled away. I came back just before noon and offered prayer behind my father. He called him (the slave) and me and said: Do as he has done to you. He granted pardon. He (my father) then said: We belonged to the family of Muqarrin during the lifetime of Allah's Messenger (may peace be upon him. and had only one slave-girl and one of us slapped her. This news reached Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he said: Set her free. They (the members of the family) said: There is no other servant except she. Thereupon he said: Then employ her and when you can afford to dispense with her services, then set her free.",
        "malay_translation": "Saya telah menampar seorang hamba milik kami, kemudian melarikan diri. Saya kembali sebelum tengah hari dan menunaikan solat di belakang ayah saya. Beliau memanggilnya (hamba itu) dan saya, lalu berkata: Lakukan seperti yang telah dia lakukan kepada kamu. Beliau memaafkan. Beliau (ayah saya) kemudian berkata: Kami adalah dari keluarga Muqarrin semasa hayat Rasulullah ﷺ dan hanya mempunyai seorang hamba perempuan dan salah seorang daripada kami menamparnya. Berita ini sampai kepada Rasulullah ﷺ dan beliau bersabda: Merdekakan dia. Mereka (ahli keluarga) berkata: Tidak ada hamba lain selain dia. Kemudian beliau bersabda: Maka pekerjakan dia, dan apabila kamu mampu untuk melepaskan dia daripada perkhidmatanmu, maka merdekakan dia.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللهِ بْنُ نُمَيْرٍ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، وَاللَّفْظُ لَهُ، حَدَّثَنَا أَبِي، حَدَّثَنَا سُفْيَانُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ مُعَاوِيَةَ بْنِ سُوَيْدٍ، قَالَ: لَطَمْتُ مَوْلًى لَنَا فَهَرَبْتُ، ثُمَّ جِئْتُ قُبَيْلَ الظُّهْرِ، فَصَلَّيْتُ خَلْفَ أَبِي، فَدَعَاهُ وَدَعَانِي، ثُمَّ قَالَ: امْتَثِلْ مِنْهُ، فَعَفَا، ثُمَّ قَالَ: كُنَّا بَنِي مُقَرِّنٍ عَلَى عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَيْسَ لَنَا إِلَّا خَادِمٌ وَاحِدَةٌ، فَلَطَمَهَا أَحَدُنَا، فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «أَعْتِقُوهَا»، قَالُوا: لَيْسَ لَهُمْ خَادِمٌ غَيْرُهَا، قَالَ:فَلْيَسْتَخْدِمُوهَا، فَإِذَا اسْتَغْنَوْا عَنْهَا، فَلْيُخَلُّوا سَبِيلَهَا."
      },
      {
        "id": 11866,
        "hadith_number": "4302",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Memukul Hamba Wanita & Perintah Membebaskannya",
        "perawi_melayu": "Diriwayatkan oleh Hilal bin Yasaf",
        "english_text": "A person got angry and slapped his slave-girl. Thereupon Suwaid bin Muqarrin  رضی اللہ عنہ said to him: You could find no other part (to slap) but the prominent part of her face. See I was one of the seven sons of Muqarrin, and we had but only one slave-girl. The youngest of us slapped her, and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) commanded us to set her free.",
        "malay_translation": "Seorang lelaki marah dan menampar hamba wanitanya. Lalu Suwaid bin Muqarrin رضي الله عنه berkata kepadanya: 'Tidakkah engkau dapat mencari tempat lain (untuk menampar) selain pada bahagian wajahnya yang jelas kelihatan? Ketahuilah, aku adalah salah seorang daripada tujuh orang anak Muqarrin, dan kami hanya mempunyai seorang hamba wanita. Anak kami yang paling muda menamparnya, dan Rasulullah ﷺ memerintahkan kami untuk membebaskannya.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، وَاللَّفْظُ لِأَبِي بَكْرٍ، قَالَا: حَدَّثَنَا ابْنُ إِدْرِيسَ، عَنْ حُصَيْنٍ، عَنْ هِلَالِ بْنِ يَسَافٍ، قَالَ: عَجِلَ شَيْخٌ فَلَطَمَ خَادِمًا لَهُ، فَقَالَ لَهُ سُوَيْدُ بْنُ مُقَرِّنٍ: عَجَزَ عَلَيْكَ إِلَّا حُرُّ وَجْهِهَا، «لَقَدْ رَأَيْتُنِي سَابِعَ سَبْعَةٍ مِنْ بَنِي مُقَرِّنٍ مَا لَنَا خَادِمٌ إِلَّا وَاحِدَةٌ، لَطَمَهَا أَصْغَرُنَا، فَأَمَرَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ نُعْتِقَهَا."
      },
      {
        "id": 11867,
        "hadith_number": "4303",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Seorang Hamba Wanita dan Tindakan Suwaid bin Muqarrin",
        "perawi_melayu": "Hilal bin Yasaf رضي الله عنه meriwayatkan:",
        "english_text": "We used to sell cloth in the house of Suwaid bin Muqarrin, the brother of Nu'man bin Muqarrin. There came out a slave-girl, and she said something to a person amongst us, and he slapped her. Suwaid was enraged-the rest of the hadith is the same.",
        "malay_translation": "Kami pernah menjual kain di rumah Suwaid bin Muqarrin, saudara lelaki Nu'man bin Muqarrin. Seorang hamba wanita keluar, dan dia berkata sesuatu kepada seseorang di antara kami, dan dia menamparnya. Suwaid berang - selebihnya hadith adalah sama.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ حُصَيْنٍ، عَنْ هِلَالِ بْنِ يَسَافٍ، قَالَ: كُنَّا نَبِيعُ الْبَزَّ فِي دَارِ سُوَيْدِ بْنِ مُقَرِّنٍ، أَخِي النُّعْمَانِ بْنِ مُقَرِّنٍ، فَخَرَجَتْ جَارِيَةٌ، فَقَالَتْ لِرَجُلٍ مِنَّا كَلِمَةً، فَلَطَمَهَا، فَغَضِبَ سُوَيْدٌ، فَذَكَرَ نَحْوَ حَدِيثِ ابْنِ إِدْرِيسَ."
      },
      {
        "id": 11868,
        "hadith_number": "4304",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukuman Membebaskan Hamba Kerana Menampar Wajah",
        "perawi_melayu": "Suwaid bin Muqarrin رضي الله عنه meriwayatkan:",
        "english_text": "He had a slave-girl and a person (one of the members of the family) slapped her, whereupon Suwaid رضی اللہ عنہ said to him: Don't you know that it is forbidden (to strike the) face. He said: You see I was the seventh one amongst my brothers during the lifetime of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and we had but only one servant. One of us got enraged and slapped him. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) commanded us to set him free.",
        "malay_translation": "Beliau mempunyai seorang hamba perempuan dan seseorang (salah seorang daripada ahli keluarga) telah menamparnya, lalu Suwaid رضي الله عنه berkata kepadanya: Tidakkah kamu tahu bahawa haram (menampar) wajah. Dia berkata: Kamu lihat saya adalah yang ketujuh daripada kalangan saudara lelaki saya semasa hayat Rasulullah (صلى الله عليه وسلم), dan kami hanya mempunyai seorang hamba. Seorang daripada kami menjadi marah dan menamparnya. Lalu Rasulullah (صلى الله عليه وسلم) memerintahkan kami membebaskannya.",
        "arabic_text": "وحَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ، حَدَّثَنِي أَبِي، حَدَّثَنَا شُعْبَةُ، قَالَ: قَالَ لِي مُحَمَّدُ بْنُ الْمُنْكَدِرِ: مَا اسْمُكَ؟ قُلْتُ شُعْبَةُ: فَقَالَ: مُحَمَّدٌ: حَدَّثَنِي أَبُو شُعْبَةَ الْعِرَاقِيُّ، عَنْ سُوَيْدِ بْنِ مُقَرِّنٍ، أَنَّ جَارِيَةً لَهُ لَطَمَهَا إِنْسَانٌ، فَقَالَ لَهُ سُوَيْدٌ: أَمَا عَلِمْتَ أَنَّ الصُّورَةَ مُحَرَّمَةٌ، فَقَالَ: «لَقَدْ رَأَيْتُنِي وَإِنِّي لَسَابِعُ إِخْوَةٍ لِي مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَمَا لَنَا خَادِمٌ غَيْرُ وَاحِدٍ، فَعَمَدَ أَحَدُنَا فَلَطَمَهُ، فَأَمَرَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ نُعْتِقَهُ."
      },
      {
        "id": 11869,
        "hadith_number": "4305",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Soalan Mengenai Nama",
        "perawi_melayu": "Wahb bin Jarir meriwayatkan: Shu'ba memaklumkan bahawa Muhammad bin Munkadir berkata kepada saya:",
        "english_text": "What is your name? The rest of the hadith is the same.",
        "malay_translation": "Siapakah nama kamu? Selebihnya hadis adalah sama.",
        "arabic_text": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، عَنْ وَهْبِ بْنِ جَرِيرٍ، أَخْبَرَنَا شُعْبَةُ، قَالَ: قَالَ لِي مُحَمَّدُ بْنُ الْمُنْكَدِرِ: مَا اسْمُكَ؟ فَذَكَرَ بِمِثْلِ حَدِيثِ عَبْدِ الصَّمَدِ."
      },
      {
        "id": 11870,
        "hadith_number": "4306",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Larangan Memukul Hamba dengan Keterlaluan",
        "perawi_melayu": "Abu Mas'ud al-Badri رضي الله عنه meriwayatkan:",
        "english_text": "I was beating my slave with a whip when I heard a voice behind me: Understand, Abu Masud; but I did not recognise the voice due to intense anger. He (Abu Mas'ud) reported: As he came near me (I found) that he was the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and he was saying: Bear in mind, Abu Mas'ud; bear in mind. Abu Mas'ud. He (Aba Maslad) said: threw the whip from my hand. Thereupon he (the Holy Prophet) said: Bear in mind, Abu Mas'ud; verily Allah has more dominance upon you than you have upon your slave. I (then) said: I would never beat my servant in future.",
        "malay_translation": "Aku sedang memukul hambaku dengan cemeti apabila aku mendengar satu suara di belakangku: Fahami, Abu Mas'ud; tetapi aku tidak mengenali suara itu kerana marah yang membara. Beliau (Abu Mas'ud) meriwayatkan: Apabila dia mendekatiku (aku mendapati) bahawa dia adalah Rasulullah ( صلى الله عليه وسلم ) dan dia sedang berkata: Ingatlah, Abu Mas'ud; ingatlah. Abu Mas'ud. Beliau (Aba Maslad) berkata: Aku campakkan cemeti itu dari tanganku. Kemudian baginda (Rasulullah SAW) bersabda: Ingatlah, Abu Mas'ud; sesungguhnya Allah lebih berkuasa ke atasmu daripada kamu ke atas hambamu. Aku (kemudian) berkata: Aku tidak akan memukul hambaku lagi di masa hadapan.",
        "arabic_text": "حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ يَعْنِي ابْنَ زِيَادٍ، حَدَّثَنَا الْأَعْمَشُ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ، قَالَ: قَالَ أَبُو مَسْعُودٍ الْبَدْرِيُّ: كُنْتُ أَضْرِبُ غُلَامًا لِي بِالسَّوْطِ، فَسَمِعْتُ صَوْتًا مِنْ خَلْفِي، «اعْلَمْ، أَبَا مَسْعُودٍ»، فَلَمْ أَفْهَمِ الصَّوْتَ مِنَ الْغَضَبِ، قَالَ: فَلَمَّا دَنَا مِنِّي إِذَا هُوَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَإِذَا هُوَ يَقُولُ: «اعْلَمْ، أَبَا مَسْعُودٍ، اعْلَمْ، أَبَا مَسْعُودٍ»، قَالَ: فَأَلْقَيْتُ السَّوْطَ مِنْ يَدِي، فَقَالَ: «اعْلَمْ، أَبَا مَسْعُودٍ، أَنَّ اللهَ أَقْدَرُ عَلَيْكَ مِنْكَ عَلَى هَذَا الْغُلَامِ»، قَالَ: فَقُلْتُ: لَا أَضْرِبُ مَمْلُوكًا بَعْدَهُ أَبَدًا."
      },
      {
        "id": 11871,
        "hadith_number": "4307",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kesan Kehebatan Nabi ﷺ",
        "perawi_melayu": "Hadith serupa (seperti no. 4306) diriwayatkan daripada Al-A'mash dengan rantaian ini, kecuali dalam Hadith Jarir ia berkata:",
        "english_text": "There fell from my hand the whip on account of his (the Prophet's) awe.",
        "malay_translation": "Jatuhlah cemeti dari tanganku disebabkan rasa gerun terhadap baginda (Nabi ﷺ).",
        "arabic_text": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، ح وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ وَهُوَ الْمَعْمَرِيُّ، عَنْ سُفْيَانَ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا سُفْيَانُ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا أَبُو عَوَانَةَ، كُلُّهُمْ عَنِ الْأَعْمَشِ بِإِسْنَادِ عَبْدِ الْوَاحِدِ نَحْوَ حَدِيثِهِ، غَيْرَ أَنَّ فِي حَدِيثِ جَرِيرٍ، فَسَقَطَ مِنْ يَدِي السَّوْطُ مِنْ هَيْبَتِهِ."
      },
      {
        "id": 11872,
        "hadith_number": "4308",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Pembebasan Hamba oleh Abu Mas'ud dan Amaran Rasulullah",
        "perawi_melayu": "Abu Mas'ud al-Ansari رضي الله عنه meriwayatkan:",
        "english_text": "When I was beating my servant, I heard a voice behind me (saying): Abu Mas'ud, bear in mind Allah has more dominance over you than you have upon him. I turned and (found him) to be Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). I said: Allah's Messenger, I set him free for the sake of Allah. Thereupon he said: Had you not done that, (the gates of) Hell would have opened for you, or the fire would have burnt you",
        "malay_translation": "Ketika aku memukul hambaku, aku mendengar suara di belakangku (berkata): Abu Mas'ud, ingatlah Allah lebih berkuasa atasmu daripada kamu berkuasa ke atasnya. Aku berpaling dan (mendapati) dia adalah Rasulullah (صلى الله عليه وسلم). Aku berkata: Wahai Rasulullah, aku membebaskannya kerana Allah. Kemudian baginda bersabda: Sekiranya kamu tidak berbuat demikian, (pintu-pintu) Neraka pasti akan terbuka untukmu, atau api akan membakarmu.",
        "arabic_text": "وحَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الْأَعْمَشُ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ، قَالَ: كُنْتُ أَضْرِبُ غُلَامًا لِي، فَسَمِعْتُ مِنْ خَلْفِي صَوْتًا: «اعْلَمْ، أَبَا مَسْعُودٍ، لَلَّهُ أَقْدَرُ عَلَيْكَ مِنْكَ عَلَيْهِ»، فَالْتَفَتُّ فَإِذَا هُوَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقُلْتُ: يَا رَسُولَ اللهِ، هُوَ حُرٌّ لِوَجْهِ اللهِ، فَقَالَ: «أَمَا لَوْ لَمْ تَفْعَلْ لَلَفَحَتْكَ النَّارُ»، أَوْ «لَمَسَّتْكَ النَّارُ»."
      },
      {
        "id": 11873,
        "hadith_number": "4309",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Hamba yang Dipukul dan Pengampunan Rasulullah ﷺ",
        "perawi_melayu": "Abu Mas'ud رضي الله عنه meriwayatkan:",
        "english_text": "He had been beating his slave and he had been saying: I seek refuge with Allah, but he continued beating him, whereupon he said: I seek refuge with Allah's Messenger, and he spared him. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: By Allah, God has more dominance over you than you have over him (the slave). He said that he set him free.",
        "malay_translation": "Dia telah memukul hambanya dan dia telah berkata: Aku berlindung kepada Allah, tetapi dia terus memukulnya, lalu dia berkata: Aku berlindung kepada Rasulullah ﷺ, dan baginda membebaskannya. Kemudian Rasulullah ﷺ bersabda: Demi Allah, Allah lebih berkuasa ke atasmu daripada kamu terhadapnya (hamba itu). Beliau berkata bahawa dia membebaskannya.",
        "arabic_text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ وَاللَّفْظُ لِابْنِ الْمُثَنَّى، قَالَا: حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي مَسْعُودٍ، أَنَّهُ كَانَ يَضْرِبُ غُلَامَهُ، فَجَعَلَ يَقُولُ: أَعُوذُ بِاللهِ، قَالَ: فَجَعَلَ يَضْرِبُهُ، فَقَالَ: أَعُوذُ بِرَسُولِ اللهِ، فَتَرَكَهُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «وَاللهِ لَلَّهُ أَقْدَرُ عَلَيْكَ مِنْكَ عَلَيْهِ»، قَالَ: فَأَعْتَقَهُ."
      },
      {
        "id": 11874,
        "hadith_number": "4310",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Memohon Perlindungan kepada Allah dan Rasul-Nya",
        "perawi_melayu": "Hadith ini telah diriwayatkan daripada Shu'ba dengan rantaian perawi yang sama, tetapi tidak menyebut (kata-kata) beliau:",
        "english_text": "I seek refuge with Allah, I seek refuge with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
        "malay_translation": "Aku berlindung kepada Allah, aku berlindung kepada Rasulullah (‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
        "arabic_text": "وحَدَّثَنِيهِ بِشْرُ بْنُ خَالِدٍ، أَخْبَرَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ، عَنْ شُعْبَةَ، بِهَذَا الْإِسْنَادِ، وَلَمْ يَذْكُرْ قَوْلَهُ: أَعُوذُ بِاللهِ، أَعُوذُ بِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 11875,
        "hadith_number": "4311",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukuman bagi Orang yang Menuduh Hambanya Berzina",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Abu'l-Qasim (one of the names of Allah's Messenger [ﷺ]) said: He who accused his slave of adultery, punishment would be imposed upon him on the Day of Resurrection, except in case the accusation was as he had said.",
        "malay_translation": "Abu'l-Qasim (salah satu nama Rasulullah [ﷺ]) bersabda: Sesiapa yang menuduh hambanya berzina, maka akan dikenakan hukuman ke atasnya pada Hari Kiamat, kecuali jika tuduhan itu benar seperti apa yang dikatakannya.",
        "arabic_text": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ نُمَيْرٍ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا فُضَيْلُ بْنُ غَزْوَانَ، قَالَ: سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ أَبِي نُعْمٍ، حَدَّثَنِي أَبُو هُرَيْرَةَ، قَالَ: قَالَ أَبُو الْقَاسِمِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَذَفَ مَمْلُوكَهُ بِالزِّنَا، يُقَامُ عَلَيْهِ الْحَدُّ يَوْمَ الْقِيَامَةِ، إِلَّا أَنْ يَكُونَ كَمَا قَالَ."
      },
      {
        "id": 11876,
        "hadith_number": "4312",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Nasihat Rasulullah tentang Taubat",
        "perawi_melayu": "Daripada Ibn Ghazwan",
        "english_text": "This hadith has been narrated on the authority of Ibn Ghazwan (and the words are): I heard Abu'l-Qasim ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as the Prophet of repentance.",
        "malay_translation": "Hadis ini diriwayatkan daripada Ibn Ghazwan (dan kata-katanya): Aku mendengar Abu'l-Qasim (ﷺ) sebagai Nabi yang menyeru kepada taubat.",
        "arabic_text": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، ح وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ الْأَزْرَقُ، كِلَاهُمَا عَنْ فُضَيْلِ بْنِ غَزْوَانَ، بِهَذَا الْإِسْنَادِ، وَفِي حَدِيثِهِمَا سَمِعْتُ أَبَا الْقَاسِمِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيَّ التَّوْبَةِ."
      },
      {
        "id": 11877,
        "hadith_number": "4313",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Keadilan Terhadap Hamba dan Larangan Memandang Rendah Orang Lain",
        "perawi_melayu": "Al-Ma'rur bin Suwaid berkata:",
        "english_text": "We went to Abu Dharr (Ghifari) in Rabadha and he had a mantle over him, and his slave had one like it. We said: Abu Dharr رضی اللہ عنہ , had you joined them together, it would have been a complete garment. Thereupon he said: There was an altercation between me and one of the persons among my brothers. His mother was a non-Arab. I reproached him for his mother. He complained against me to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). As I met Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) he said: Abu Dharr ﷺ, you are a person who still has (in him the remnants) of the days (of Ignorance). Thereupon I said: Allah's Messenger, he who abuses (other) persons, they abuse (in return) his father and mother. He (the Holy Prophet ﷺ) said: Abu Dharr رضی اللہ عنہ , you are a person who still has (the remnants) of Ignorance in him They (your servants and slaves) are your brothers. Allah has put them in your care, so feed them with what you eat, clothe them with what you wear. and do not burden them beyond their capacities; but if you burden them (with an unbearable burden), then help them (by sharing their extra burden).",
        "malay_translation": "Kami pergi kepada Abu Dharr (Ghifari) di Rabadha dan dia memakai selimut, dan hambanya juga memakai selimut yang sama. Kami berkata: Abu Dharr رضی اللہ عنہ , alangkah baiknya jika anda menyatukan kedua selimut itu, ia akan menjadi pakaian yang sempurna. Maka beliau berkata: Terjadi pertengkaran antara aku dan salah seorang dari saudara-saudaraku. Ibunya bukan Arab. Aku mencelanya kerana ibunya. Dia mengadu kepadaku kepada Rasulullah (صلى الله عليه وسلم). Apabila aku bertemu Rasulullah (صلى الله عليه وسلم) Baginda bersabda: Abu Dharr ﷺ, engkau adalah orang yang masih memiliki (sisa-sisa) dari zaman (Jahiliyah). Maka aku berkata: Wahai Rasulullah, sesiapa yang mencaci maki (orang lain), mereka akan mencaci maki (sebagai balasan) ibu dan bapanya. Baginda (Nabi ﷺ) bersabda: Abu Dharr رضی اللہ عنہ , engkau adalah orang yang masih memiliki (sisa-sisa) Jahiliyah di dalam dirinya. Mereka (hamba dan pelayanmu) adalah saudara-saudaramu. Allah telah menempatkan mereka di bawah penjagaanmu, maka berilah mereka makan daripada apa yang kamu makan, berilah mereka pakaian daripada apa yang kamu pakai, dan janganlah membebani mereka melebihi kemampuan mereka; tetapi jika kamu membebani mereka (dengan beban yang tidak tertanggung), maka bantulah mereka (dengan berkongsi beban tambahan mereka).",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الْأَعْمَشُ، عَنِ الْمَعْرُورِ بْنِ سُوَيْدٍ، قَالَ: مَرَرْنَا بِأَبِي ذَرٍّ بِالرَّبَذَةِ وَعَلَيْهِ بُرْدٌ وَعَلَى غُلَامِهِ مِثْلُهُ، فَقُلْنَا: يَا أَبَا ذَرٍّ لَوْ جَمَعْتَ بَيْنَهُمَا كَانَتْ حُلَّةً، فَقَالَ: إِنَّهُ كَانَ بَيْنِي وَبَيْنَ رَجُلٍ مِنْ إِخْوَانِي كَلَامٌ، وَكَانَتْ أُمُّهُ أَعْجَمِيَّةً، فَعَيَّرْتُهُ بِأُمِّهِ، فَشَكَانِي إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَلَقِيتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «يَا أَبَا ذَرٍّ، إِنَّكَ امْرُؤٌ فِيكَ جَاهِلِيَّةٌ»، قُلْتُ: يَا رَسُولَ اللهِ، مَنْ سَبَّ الرِّجَالَ سَبُّوا أَبَاهُ وَأُمَّهُ، قَالَ: «يَا أَبَا ذَرٍّ، إِنَّكَ امْرُؤٌ فِيكَ جَاهِلِيَّةٌ، هُمْ إِخْوَانُكُمْ، جَعَلَهُمُ اللهُ تَحْتَ أَيْدِيكُمْ، فَأَطْعِمُوهُمْ مِمَّا تَأْكُلُونَ، وَأَلْبِسُوهُمْ مِمَّا تَلْبَسُونَ، وَلَا تُكَلِّفُوهُمْ مَا يَغْلِبُهُمْ، فَإِنْ كَلَّفْتُمُوهُمْ فَأَعِينُوهُمْ."
      },
      {
        "id": 11878,
        "hadith_number": "4314",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Sifat Ketinggalan Jahiliah dalam Diri",
        "perawi_melayu": "Hadith ini diriwayatkan daripada A'mash, tetapi dengan sedikit variasi perkataan, contohnya dalam hadith yang diriwayatkan daripada Zuhair dan Abu Mu'awiya selepas sabda baginda (ﷺ):",
        "english_text": "You are a person having the remnants of Ignorance in him. (these words also occur, that Abu Dharr) said: Even up to this time of my old age? He (the Holy Prophet ﷺ) said: Yes. In the tradition transmitted on the authority of Abu Mu'awiya (the words are): Yes, in this time of your old age. In the tradition transmitted on the authority of 'Isa (the words are): If you burden him (with an unbearable burden), you should sell him (and get another slave who can easily undertake this burden). In the hadith transmitted on the authority of Zuhair (the words are): Help him in that (work). In the hadith transmitted by Abu Mu'awiya (separately) there is no such word: Then sell him or help him. This hadith concludes with these words: Do not burden him beyond his capacity.",
        "malay_translation": "Kamu adalah seorang yang masih mempunyai sisa-sisa kejahilan dalam dirinya. (Perkataan ini juga disebut, bahawa Abu Dharr) berkata: Walaupun sehingga ke usia tua saya ini? Baginda (Nabi Muhammad ﷺ) bersabda: Ya. Dalam riwayat yang diriwayatkan daripada Abu Mu'awiya (perkataannya adalah): Ya, pada usia tua kamu ini. Dalam riwayat yang diriwayatkan daripada 'Isa (perkataannya adalah): Jika kamu membebankannya (dengan bebanan yang tidak tertanggung), hendaklah kamu menjualnya (dan dapatkan hamba lain yang mudah menanggung beban ini). Dalam hadith yang diriwayatkan daripada Zuhair (perkataannya adalah): Bantulah dia dalam (kerja) itu. Dalam hadith yang diriwayatkan oleh Abu Mu'awiya (secara berasingan) tidak ada perkataan seperti itu: Kemudian jualkan dia atau bantulah dia. Hadith ini diakhiri dengan perkataan ini: Jangan bebankannya melebihi kemampuannya.",
        "arabic_text": "وَحَدَّثَنَاهُ أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، ح وحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، كُلُّهُمْ عَنِ الْأَعْمَشِ، بِهَذَا الْإِسْنَادِ، وَزَادَ فِي حَدِيثِ زُهَيْرٍ، وَأَبِي مُعَاوِيَةَ بَعْدَ قَوْلِهِ: «إِنَّكَ امْرُؤٌ فِيكَ جَاهِلِيَّةٌ»، قَالَ: قُلْتُ: عَلَى حَالِ سَاعَتِي مِنَ الْكِبَرِ؟ قَالَ: «نَعَمْ»، وَفِي رِوَايَةِ أَبِي مُعَاوِيَةَ: «نَعَمْ عَلَى حَالِ سَاعَتِكَ مِنَ الْكِبَرِ»، وَفِي حَدِيثِ عِيسَى: «فَإِنْ كَلَّفَهُ مَا يَغْلِبُهُ فَلْيَبِعْهُ»، وَفِي حَدِيثِ زُهَيْرٍ: «فَلْيُعِنْهُ عَلَيْهِ»، وَلَيْسَ فِي حَدِيثِ أَبِي مُعَاوِيَةَ: «فَلْيَبِعْهُ»، وَلَا «فَلْيُعِنْهُ»، انْتَهَى عِنْدَ قَوْلِهِ: «وَلَا يُكَلِّفْهُ مَا يَغْلِبُهُ»."
      },
      {
        "id": 11879,
        "hadith_number": "4315",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Persamaan Hak Hamba dan Tuan dalam Islam",
        "perawi_melayu": "Ma'rur bin Suwaid meriwayatkan:",
        "english_text": "I saw Abu Dharr رضی اللہ عنہ wearing clothes, and his slave wearing similar ones. I asked him about it, and he narrated that he had abused a person during the lifetime of Allah's Messenger (ﷺ) and he reproached him for his mother. That person came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and made mention of that to him. Thereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: You are a person who has (remnants of) Ignorance in him. Your slaves are brothers of yours. Allah has placed them in your hand, and he who has his brother under him, he should feed him with what he eats, and dress him with what he dresses himself, and do not burden them beyond their capacities, and if you burden them, (beyond their capacities), then help them.",
        "malay_translation": "Saya melihat Abu Dharr رضي الله عنه memakai pakaian, dan hambanya memakai pakaian yang serupa. Saya bertanya kepadanya tentang hal itu, dan dia meriwayatkan bahawa dia telah mencela seorang individu semasa zaman Rasulullah ﷺ dan dia mencela orang itu kerana ibunya. Orang itu datang kepada Rasulullah ﷺ dan memberitahunya tentang hal itu. Kemudian Rasulullah ﷺ bersabda: Kamu adalah orang yang masih mempunyai (sisa-sisa) kejahilan dalam dirinya. Hamba-hambamu adalah saudara-saudaramu. Allah telah meletakkan mereka di tanganmu, dan sesiapa yang mempunyai saudaranya di bawahnya, hendaklah dia memberinya makan seperti apa yang dia makan, dan memakaikan pakaian seperti apa yang dia pakai sendiri, dan janganlah membebani mereka di luar kemampuan mereka, dan jika kamu membebani mereka (di luar kemampuan mereka), maka bantulah mereka.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ، وَاللَّفْظُ لِابْنِ الْمُثَنَّى، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ وَاصِلٍ الْأَحْدَبِ، عَنِ الْمَعْرُورِ بْنِ سُوَيْدٍ، قَالَ: رَأَيْتُ أَبَا ذَرٍّ وَعَلَيْهِ حُلَّةٌ، وَعَلَى غُلَامِهِ مِثْلُهَا، فَسَأَلْتُهُ عَنْ ذَلِكَ، قَالَ: فَذَكَرَ أَنَّهُ سَابَّ رَجُلًا عَلَى عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَعَيَّرَهُ بِأُمِّهِ، قَالَ: فَأَتَى الرَّجُلُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَذَكَرَ ذَلِكَ لَهُ، فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّكَ امْرُؤٌ فِيكَ جَاهِلِيَّةٌ، إِخْوَانُكُمْ وَخَوَلُكُمْ، جَعَلَهُمُ اللهُ تَحْتَ أَيْدِيكُمْ، فَمَنْ كَانَ أَخُوهُ تَحْتَ يَدَيْهِ، فَلْيُطْعِمْهُ مِمَّا يَأْكُلُ، وَلْيُلْبِسْهُ مِمَّا يَلْبَسُ، وَلَا تُكَلِّفُوهُمْ مَا يَغْلِبُهُمْ، فَإِنْ كَلَّفْتُمُوهُمْ فَأَعِينُوهُمْ عَلَيْهِ."
      },
      {
        "id": 11880,
        "hadith_number": "4316",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kewajipan Memberi Makan dan Pakaian Hamba",
        "perawi_melayu": "Abu Huraira meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: It is essential to feed the slave, clothe him (properly) and not burden him with work which is beyond his power.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Adalah wajib memberi makan kepada hamba, memakaikan pakaian yang sesuai dan tidak membebankannya dengan kerja yang di luar kemampuannya.",
        "arabic_text": "وحَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنَا عَمْرُو بْنُ الْحَارِثِ، أَنَّ بُكَيْرَ بْنَ الْأَشَجِّ، حَدَّثَهُ عَنِ الْعَجْلَانِ، مَوْلَى فَاطِمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «لِلْمَمْلُوكِ طَعَامُهُ وَكِسْوَتُهُ، وَلَا يُكَلَّفُ مِنَ الْعَمَلِ إِلَّا مَا يُطِيقُ."
      },
      {
        "id": 11881,
        "hadith_number": "4317",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kewajipan Melayan Pembantu Rumah dengan Baik",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When the slave of anyone amongst you prepares food for him and he serves him after having sat close to (and undergoing the hardship of) heat and smoke, he should make him (the slave) sit along with him and make him eat (along with him), and if the food seems to run short, then he should spare some portion for him (from his own share) - (another narrator) Dawud said: i. e. a morsel or two . 4097",
        "malay_translation": "Rasulullah ﷺ bersabda: Apabila seorang hamba dalam kalangan kamu menyediakan makanan untuk tuannya dan dia melayan tuannya setelah berhampiran (dan mengalami kesukaran) haba dan asap, maka hendaklah dia (tuan) mendudukkan hamba itu bersama-samanya dan menyuruhnya makan (bersama-samanya), dan jika makanan itu kelihatan berkurangan, maka hendaklah dia menyimpan sebahagian (daripada bahagiannya sendiri) untuknya – (perawi lain) Dawud berkata: iaitu sepotong atau dua.",
        "arabic_text": "وحَدَّثَنَا الْقَعْنَبِيُّ، حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ، عَنْ مُوسَى بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا صَنَعَ لِأَحَدِكُمْ خَادِمُهُ طَعَامَهُ، ثُمَّ جَاءَهُ بِهِ، وَقَدْ وَلِيَ حَرَّهُ وَدُخَانَهُ، فَلْيُقْعِدْهُ مَعَهُ، فَلْيَأْكُلْ، فَإِنْ كَانَ الطَّعَامُ مَشْفُوهًا قَلِيلًا، فَلْيَضَعْ فِي يَدِهِ مِنْهُ أُكْلَةً أَوْ أُكْلَتَيْنِ»، قَالَ دَاوُدُ: «يَعْنِي لُقْمَةً، أَوْ لُقْمَتَيْنِ."
      },
      {
        "id": 11882,
        "hadith_number": "4318",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ganjaran Hamba yang Berbakti dan Beribadah dengan Baik",
        "perawi_melayu": "Ibn Umar رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When a slave looks to the welfare of his master and worships Allah well, he has two rewards for him.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Apabila seorang hamba menjaga kebajikan tuannya dan beribadah kepada Allah dengan baik, maka dia akan mendapat dua ganjaran.",
        "arabic_text": "حدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الْعَبْدَ إِذَا نَصَحَ لِسَيِّدِهِ، وَأَحْسَنَ عِبَادَةَ اللهِ، فَلَهُ أَجْرُهُ مَرَّتَيْنِ."
      },
      {
        "id": 11883,
        "hadith_number": "4319",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Riwayat Hadith Melalui Sanad Lain",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "This hadith has been narrated on the authority of Ibn 'Umar رضی اللہ عنہ through another chain of transmitters.",
        "malay_translation": "Hadith ini telah diriwayatkan daripada Ibn 'Umar رضي الله عنه melalui satu lagi rangkaian perawi.",
        "arabic_text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالَا: حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ، كُلُّهُمْ عَنْ عُبَيْدِ اللهِ، ح وحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنِي أُسَامَةُ، جَمِيعًا عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ مَالِكٍ."
      },
      {
        "id": 11884,
        "hadith_number": "4320",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ganjaran Bagi Hamba Beriman",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: For a faithful slave there are two rewards. By him in Whose hand is the life of Abu Huraira رضی اللہ عنہ , but for Jihad in the cause of Allah, and Pilgrimage and kindness to my mother, I would have preferred to die as a slave. He (one of the narrators in the chain of transmitters) said: This news reached us that Abu Huraira رضی اللہ عنہ did not perform Pilgrimage until his mother died for (keeping himself constantly) in her service.",
        "malay_translation": "Rasulullah ﷺ bersabda: Bagi seorang hamba yang beriman terdapat dua ganjaran. Demi Tuhan yang di tangan-Nya nyawa Abu Hurairah رضي الله عنه, sekiranya bukan kerana jihad di jalan Allah, haji, dan berbuat baik kepada ibuku, nescaya aku lebih suka mati sebagai seorang hamba. Beliau (salah seorang perawi dalam silsilah periwayatan) berkata: Berita ini sampai kepada kami bahawa Abu Hurairah رضي الله عنه tidak menunaikan haji sehingga ibunya meninggal dunia (kerana sentiasa berkhidmat kepadanya).",
        "arabic_text": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالَا: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ: سَمِعْتُ سَعِيدَ بْنَ الْمُسَيِّبِ، يَقُولُ: قَالَ أَبُو هُرَيْرَةَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لِلْعَبْدِ الْمَمْلُوكِ الْمُصْلِحِ أَجْرَانِ»، وَالَّذِي نَفْسُ أَبِي هُرَيْرَةَ بِيَدِهِ، لَوْلَا الْجِهَادُ فِي سَبِيلِ اللهِ، وَالْحَجُّ، وَبِرُّ أُمِّي، لَأَحْبَبْتُ أَنْ أَمُوتَ وَأَنَا مَمْلُوكٌ ، قَالَ: وَبَلَغَنَا أَنَّ أَبَا هُرَيْرَةَ لَمْ يَكُنْ يَحُجُّ حَتَّى مَاتَتْ أُمُّهُ لِصُحْبَتِهَا، قَالَ أَبُو الطَّاهِرِ فِي حَدِيثِهِ: «لِلْعَبْدِ الْمُصْلِحِ»، وَلَمْ يَذْكُرْ «الْمَمْلُوكَ»."
      },
      {
        "id": 11885,
        "hadith_number": "4321",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadith dengan Sedikit Perbezaan Lafaz",
        "perawi_melayu": "Tiada maklumat",
        "english_text": "This hadith has been transmitted on the authority of Abu Tahir but with a slight variation of words.",
        "malay_translation": "Hadith ini telah diriwayatkan daripada Abu Tahir tetapi dengan sedikit perbezaan lafaz.",
        "arabic_text": "وحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا أَبُو صَفْوَانَ الْأُمَوِيُّ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، بِهَذَا الْإِسْنَادِ، وَلَمْ يَذْكُرْ بَلَغَنَا وَمَا بَعْدَهُ."
      },
      {
        "id": 11886,
        "hadith_number": "4322",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Ganjaran Berganda bagi Hamba yang Memenuhi Kewajipan",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When a slave fulfils obligation of Allah and obligation of his master, he has two rewards for him. I narrated this to Ka'b, and Ka'b said: (Such a slave) has no accountability, nor has a poor believer.",
        "malay_translation": "Rasulullah ﷺ bersabda: Apabila seorang hamba memenuhi kewajipan kepada Allah dan kewajipan kepada tuannya, dia akan mendapat dua ganjaran. Aku menceritakan hal ini kepada Ka'b, dan Ka'b berkata: (Hamba seperti itu) tidak ada hisab (pertanggungjawaban), begitu juga orang beriman yang miskin.",
        "arabic_text": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَدَّى الْعَبْدُ حَقَّ اللهِ وَحَقَّ مَوَالِيهِ، كَانَ لَهُ أَجْرَانِ»، قَالَ: فَحَدَّثْتُهَا كَعْبًا، فَقَالَ كَعْبٌ: «لَيْسَ عَلَيْهِ حِسَابٌ وَلَا عَلَى مُؤْمِنٍ مُزْهِدٍ."
      },
      {
        "id": 11887,
        "hadith_number": "4323",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadith Serupa Melalui Rantaian Al-A'mash",
        "perawi_melayu": "Tiada maklumat perawi",
        "english_text": "It was narrated from Al-A'mash with this chain (a Hadith similar to no. 4322).",
        "malay_translation": "Diriwayatkan daripada Al-A'mash dengan rantaian ini (Hadith yang serupa dengan no. 4322).",
        "arabic_text": "وحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الْأَعْمَشِ، بِهَذَا الْإِسْنَادِ."
      },
      {
        "id": 11888,
        "hadith_number": "4324",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kebaikan Hamba dalam Ibadah dan Khidmat",
        "perawi_melayu": "Abu Hurairah رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: It is good for a slave that he worships Allah well, and serves his master (well). It is good for him.",
        "malay_translation": "Rasulullah ﷺ bersabda: \"Sungguh baik bagi seorang hamba jika dia beribadah kepada Allah dengan baik, dan berkhidmat kepada tuannya (dengan baik). Itu adalah baik baginya.\"",
        "arabic_text": "وحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ: هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَذَكَرَ أَحَادِيثَ مِنْهَا، وَقَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «نِعِمَّا لِلْمَمْلُوكِ أَنْ يُتَوَفَّى يُحْسِنُ عِبَادَةَ اللهِ، وَصَحَابَةَ سَيِّدِهِ، نِعِمَّا لَهُ."
      },
      {
        "id": 11889,
        "hadith_number": "4325",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pembebasan Hamba Sebahagian",
        "perawi_melayu": "Ibnu 'Umar رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who gives up his share in a slave, and has enough money to pay the full price of the slave, then full emancipation devolves upon him; but if he has not the money, then he emancipated what he emancipated.",
        "malay_translation": "Rasulullah ﷺ bersabda: Sesiapa yang melepaskan bahagiannya dalam seorang hamba, dan mempunyai wang yang mencukupi untuk membayar harga penuh hamba tersebut, maka pembebasan sepenuhnya akan terpakai ke atasnya; tetapi jika dia tidak mempunyai wang, maka dia membebaskan apa yang dia bebaskan.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قُلْتُ لِمَالِكٍ: حَدَّثَكَ نَافِعٌ، عَنِ ابْنِ عُمَرَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَعْتَقَ شِرْكًا لَهُ فِي عَبْدٍ، فَكَانَ لَهُ مَالٌ يَبْلُغُ ثَمَنَ الْعَبْدِ، قُوِّمَ عَلَيْهِ قِيمَةَ الْعَدْلِ، فَأَعْطَى شُرَكَاءَهُ حِصَصَهُمْ، وَعَتَقَ عَلَيْهِ الْعَبْدُ، وَإِلَّا فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ."
      },
      {
        "id": 11890,
        "hadith_number": "4326",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kewajipan Membebaskan Sebahagian Hamba Sahaya",
        "perawi_melayu": "Ibn 'Umar رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who emancipates his share in the slave, it is his responsibility to secure full freedom for him provided he (the slave) has enough money to pay the (remaining) price, but it he has not so much money he would be emancipated to the extent that the first man emancipated.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Sesiapa yang memerdekakan sebahagian sahamnya pada seorang hamba, adalah menjadi tanggungjawabnya untuk memastikan kebebasan sepenuhnya bagi hamba tersebut dengan syarat hamba itu mempunyai wang yang cukup untuk membayar (baki) harga, tetapi jika dia tidak mempunyai wang yang banyak, maka dia akan dimerdekakan setakat mana orang pertama memerdekakannya.",
        "arabic_text": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَعْتَقَ شِرْكًا لَهُ مِنْ مَمْلُوكٍ، فَعَلَيْهِ عِتْقُهُ كُلُّهُ، إِنْ كَانَ لَهُ مَالٌ يَبْلُغُ ثَمَنَهُ، فَإِنْ لَمْ يَكُنْ لَهُ مَالٌ، عَتَقَ مِنْهُ مَا عَتَقَ."
      },
      {
        "id": 11891,
        "hadith_number": "4327",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kemerdekaan Hamba Sebahagian dan Kewajipan Membayar Harga Penuh",
        "perawi_melayu": "Abdullah bin 'Umar رضی اللہ عنہ meriwayatkan:",
        "english_text": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who gives up his share in a slave, and he has money enough to meet the full price, a fair price for him should be fixed; otherwise be has emancipated him to the extent that he has emancipated.",
        "malay_translation": "Rasulullah (صلى الله عليه وسلم) bersabda: Sesiapa yang melepaskan bahagiannya ke atas seorang hamba, dan dia mempunyai wang yang cukup untuk membayar harga penuh, harga yang adil untuknya hendaklah ditetapkan; jika tidak, dia telah membebaskannya setakat mana bahagian yang telah dilepaskannya.",
        "arabic_text": "وحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، عَنْ نَافِعٍ، مَوْلَى عَبْدِ اللهِ بْنِ عُمَرَ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَعْتَقَ نَصِيبًا لَهُ فِي عَبْدٍ، فَكَانَ لَهُ مِنَ الْمَالِ قَدْرُ مَا يَبْلُغُ قِيمَتَهُ، قُوِّمَ عَلَيْهِ قِيمَةَ عَدْلٍ، وَإِلَّا فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ."
      },
      {
        "id": 11892,
        "hadith_number": "4328",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hukum Membebaskan Hamba Jika Tidak Cukup Harta",
        "perawi_melayu": "Hadis ini diriwayatkan daripada Ibn 'Umar رضی اللہ عنہ, (serupa dengan no. 4326) daripada Nabi ﷺ tetapi dalam Hadis mereka tidak menyatakan:",
        "english_text": "If he does not enough money than he has freed only what he has freed.\" but in the hadith of Ayyub and yahya bin Saeed, they mention this phrase but they said: \"We do not know whether it is part of the Hadith or is something that was said by Nafi (a narrator through another chain of transmitters with a slight variation of words.",
        "malay_translation": "Jika dia tidak mempunyai wang yang mencukupi, maka dia hanya membebaskan (hamba) setakat mana yang telah dibebaskannya.\" Tetapi dalam hadis Ayyub dan Yahya bin Saeed, mereka menyebut frasa ini tetapi mereka berkata: \"Kami tidak tahu sama ada ia adalah sebahagian daripada Hadis atau sesuatu yang dikatakan oleh Nafi (seorang perawi melalui rantai perawi lain dengan sedikit perbezaan perkataan.",
        "arabic_text": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ رُمْحٍ، عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ: سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، ح وحَدَّثَنِي أَبُو الرَّبِيعِ، وَأَبُو كَامِلٍ، قَالَا: حَدَّثَنَا حَمَّادٌ وَهُوَ ابْنُ زَيْدٍ، ح وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ عُلَيَّةَ، كِلَاهُمَا عَنْ أَيُّوبَ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي إِسْمَاعِيلُ بْنُ أُمَيَّةَ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، عَنِ ابْنِ أَبِي ذِئْبٍ، ح وحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، قَالَ: أَخْبَرَنِي أُسَامَةُ يَعْنِي ابْنَ زَيْدٍ، كُلُّ هَؤُلَاءِ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ، وَلَيْسَ فِي حَدِيثِهِمْ: «وَإِنْ لَمْ يَكُنْ لَهُ مَالٌ فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ» إِلَّا فِي حَدِيثِ أَيُّوبَ، وَيَحْيَى بْنِ سَعِيدٍ فَإِنَّهُمَا ذَكَرَا هَذَا الْحَرْفَ فِي الْحَدِيثِ، وَقَالَا: لَا نَدْرِي أَهُوَ شَيْءٌ فِي الْحَدِيثِ، أَوْ قَالَهُ نَافِعٌ مِنْ قِبَلِهِ، وَلَيْسَ فِي رِوَايَةِ أَحَدٍ مِنْهُمْ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، إِلَّا فِي حَدِيثِ اللَّيْثِ بْنِ سَعْدٍ."
      },
      {
        "id": 11893,
        "hadith_number": "4329",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Membebaskan Hamba Sahaya Secara Bersama",
        "perawi_melayu": "Salim bin 'Abdullah meriwayatkan daripada bapanya:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: He who emancipates a slave (shared) by him and another one, his full price may be justly assessed from his wealth, neither less nor more, and he (the slave) would be emancipated if he (the partner) would be solvent enough (to forgo the amount of his share).",
        "malay_translation": "Rasulullah ( ﷺ ) bersabda: Sesiapa yang membebaskan seorang hamba sahaya (yang dikongsi) olehnya dan orang lain, harga penuhnya hendaklah dinilai dengan adil daripada hartanya, tidak kurang dan tidak lebih, dan dia (hamba itu) akan dibebaskan jika dia (rakan kongsi) mampu mencukupi (untuk melepaskan jumlah bahagiannya).",
        "arabic_text": "دَّثَنَا عَمْرٌو النَّاقِدُ، وَابْنُ أَبِي عُمَرَ، كِلَاهُمَا عَنِ ابْنِ عُيَيْنَةَ، قَالَ ابْنُ أَبِي عُمَرَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ سَالِمِ بْنِ عَبْدِ اللهِ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَعْتَقَ عَبْدًا بَيْنَهُ وَبَيْنَ آخَرَ، قُوِّمَ عَلَيْهِ فِي مَالِهِ قِيمَةَ عَدْلٍ، لَا وَكْسَ، وَلَا شَطَطَ، ثُمَّ عَتَقَ عَلَيْهِ فِي مَالِهِ إِنْ كَانَ مُوسِرًا."
      },
      {
        "id": 11894,
        "hadith_number": "4330",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kewajipan Membayar Bahagian Hamba yang Dilepaskan",
        "perawi_melayu": "Ibn 'Umar رضي الله عنه meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who gives up his share in a slave, the remaining (share) will be paid out of his riches if his riches are enough to meet the price of the slave.",
        "malay_translation": "Rasulullah ﷺ bersabda: Sesiapa yang melepaskan bahagiannya dalam seorang hamba, maka (bahagian) yang tinggal akan dibayar daripada kekayaannya jika kekayaannya mencukupi untuk membayar harga hamba tersebut.",
        "arabic_text": "وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَعْتَقَ شِرْكًا لَهُ فِي عَبْدٍ، عَتَقَ مَا بَقِيَ فِي مَالِهِ، إِذَا كَانَ لَهُ مَالٌ يَبْلُغُ ثَمَنَ الْعَبْدِ."
      },
      {
        "id": 11895,
        "hadith_number": "4331",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pembebasan Hamba oleh Dua Pemilik",
        "perawi_melayu": "Abu Huraira meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: In case the slave is owned by two persons, and one of them emancipates him, he will guarantee (his full freedom).",
        "malay_translation": "Rasulullah ﷺ bersabda: Sekiranya seorang hamba dimiliki oleh dua orang, dan salah seorang daripada mereka membebaskannya, maka dia akan menjamin (kebebasan penuhnya).",
        "arabic_text": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، وَاللَّفْظُ لِابْنِ الْمُثَنَّى، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْمَمْلُوكِ بَيْنَ الرَّجُلَيْنِ، فَيُعْتِقُ أَحَدُهُمَا، قَالَ: «يَضْمَنُ."
      },
      {
        "id": 11896,
        "hadith_number": "4332",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Membebaskan Sebahagian Hamba",
        "perawi_melayu": "Hadith ini telah diriwayatkan dari Shu'ba dengan rangkaian perawi yang sama (dan kata-katanya adalah):",
        "english_text": "He who emancipates a portion in a slave, he should (secure full) freedom for him from his property.",
        "malay_translation": "Sesiapa yang membebaskan sebahagian hamba, maka hendaklah dia (memastikan) kebebasan sepenuhnya baginya daripada hartanya.",
        "arabic_text": "حَدَّثَنَاهُ عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ، قَالَ: «مَنْ أَعْتَقَ شَقِيصًا مِنْ مَمْلُوكٍ، فَهُوَ حُرٌّ مِنْ مَالِهِ."
      },
      {
        "id": 11897,
        "hadith_number": "4333",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pembebasan Sebahagian Hamba, Pembebasan Penuh dengan Hartanya",
        "perawi_melayu": "Abu Hurairah meriwayatkan:",
        "english_text": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who emancipates his portion in a slave, full emancipation may be secured for him out of his property (if he has money) if he has enough property to meet (the required expenses), but if he has not enough property, the slave should be put to extra labour (in order to earn money for buying his freedom), but he should not be overburdened.",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Sesiapa yang membebaskan sebahagian daripada seorang hamba, maka pembebasan penuh boleh diperolehi baginya daripada hartanya (jika dia mempunyai wang) sekiranya dia mempunyai harta yang mencukupi untuk memenuhi (perbelanjaan yang diperlukan), tetapi jika dia tidak mempunyai harta yang mencukupi, maka hamba itu hendaklah bekerja lebih masa (untuk mendapatkan wang bagi membeli kebebasannya), tetapi dia tidak boleh dibebani secara berlebihan.",
        "arabic_text": "وحَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنِ ابْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَعْتَقَ شَقِيصًا لَهُ فِي عَبْدٍ، فَخَلَاصُهُ فِي مَالِهِ، إِنْ كَانَ لَهُ مَالٌ، فَإِنْ لَمْ يَكُنْ لَهُ مَالٌ، اسْتُسْعِيَ الْعَبْدُ غَيْرَ مَشْقُوقٍ عَلَيْهِ."
      },
      {
        "id": 11898,
        "hadith_number": "4334",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kewajipan Kerja untuk Kebebasan Sebahagian Hamba",
        "perawi_melayu": "Diriwayatkan dari Ibi Abi Arubah dengan (rantai periwayatan yang berbeza, sebuah Hadis yang serupa dengan no. 4333). Dalam Hadis Eisa ia berkata:",
        "english_text": "He will be required to work (in order to secure freedom) for that portion in which he has not been emancipated, without overburdening him.",
        "malay_translation": "Dia akan dikehendaki bekerja (untuk mendapatkan kebebasan) bagi bahagian yang dia belum dimerdekakan, tanpa membebankannya.",
        "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، وَمُحَمَّدُ بْنُ بِشْرٍ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَلِيُّ بْنُ خَشْرَمٍ، قَالَا: أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، جَمِيعًا عَنِ ابْنِ أَبِي عَرُوبَةَ، بِهَذَا الْإِسْنَادِ، وَفِي حَدِيثِ عِيسَى: «ثُمَّ يُسْتَسْعَى فِي نَصِيبِ الَّذِي لَمْ يُعْتِقْ غَيْرَ مَشْقُوقٍ عَلَيْهِ."
      },
      {
        "id": 11899,
        "hadith_number": "4335",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Pembebasan Hamba Secara Tidak Adil",
        "perawi_melayu": "Imran bin Husain رضي الله عنه meriwayatkan:",
        "english_text": "A person who had no other property emancipated six slaves of his at the time of his death. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) called for them and divided them into three sections, cast lots amongst them, and set two free and kept four in slavery; and he (the Holy Prophet) spoke severely of him.",
        "malay_translation": "Seorang yang tidak mempunyai harta lain membebaskan enam orang hambanya semasa kematiannya. Rasulullah ﷺ memanggil mereka dan membahagikan mereka kepada tiga bahagian, membuat undian di antara mereka, dan membebaskan dua orang dan mengekalkan empat orang dalam perhambaan; dan baginda (Nabi ﷺ) berkata dengan keras tentangnya.",
        "arabic_text": "دَّثَنَا عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ وَهُوَ ابْنُ عُلَيَّةَ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلَابَةَ، عَنْ أَبِي الْمُهَلَّبِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، «أَنَّ رَجُلًا أَعْتَقَ سِتَّةَ مَمْلُوكِينَ لَهُ عِنْدَ مَوْتِهِ، لَمْ يَكُنْ لَهُ مَالٌ غَيْرَهُمْ، فَدَعَا بِهِمْ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَجَزَّأَهُمْ أَثْلَاثًا، ثُمَّ أَقْرَعَ بَيْنَهُمْ، فَأَعْتَقَ اثْنَيْنِ، وَأَرَقَّ أَرْبَعَةً، وَقَالَ لَهُ قَوْلًا شَدِيدًا."
      },
      {
        "id": 11900,
        "hadith_number": "4336",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Wasiat Memerdekakan Hamba oleh Seorang Ansar",
        "perawi_melayu": "Diriwayatkan daripada Ayyub dengan sanad ini (Hadis serupa dengan no. 4335). Adapun Hammad (seorang perawi), Hadisnya adalah seperti riwayat Ibn 'Ulayyah (no. 4335). Adapun Ath-Thaqafi dalam Hadisnya menyebut:",
        "english_text": "A person from among the Ansar willed away the freedom of six slaves of his at the time of his death.",
        "malay_translation": "Seorang daripada kalangan Ansar mewasiatkan kemerdekaan enam orang hambanya ketika saat kematiannya.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَمَّادٌ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ، عَنِ الثَّقَفِيِّ، كِلَاهُمَا عَنْ أَيُّوبَ، بِهَذَا الْإِسْنَادِ، أَمَّا حَمَّادٌ، فَحَدِيثُهُ كَرِوَايَةِ ابْنِ عُلَيَّةَ، وَأَمَّا الثَّقَفِيُّ، فَفِي حَدِيثِهِ أَنَّ رَجُلًا مِنَ الْأَنْصَارِ أَوْصَى عِنْدَ مَوْتِهِ فَأَعْتَقَ سِتَّةَ مَمْلُوكِينَ."
      },
      {
        "id": 11901,
        "hadith_number": "4337",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Riwayat Hadith Melalui Rantaian Sanad Lain",
        "perawi_melayu": "Imran bin Husain رضي الله عنه (Melalui rantaian perawi lain)",
        "english_text": "This hadith has been reported on the authority of Imran bin Husain رضی اللہ عنہ through another chain of narrators.",
        "malay_translation": "Hadith ini telah diriwayatkan daripada Imran bin Husain رضي الله عنه melalui satu lagi rantaian perawi.",
        "arabic_text": "وحَدَّثَنَا مُحَمَّدُ بْنُ مِنْهَالٍ الضَّرِيرُ، وَأَحْمَدُ بْنُ عَبْدَةَ، قَالَا: حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، بِمِثْلِ حَدِيثِ ابْنِ عُلَيَّةَ، وَحَمَّادٍ."
      },
      {
        "id": 11902,
        "hadith_number": "4338",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Jual Beli Hamba Selepas Kematian Tuan",
        "perawi_melayu": "Jabir bin 'Abdullah رضي الله عنه berkata:",
        "english_text": "A person among the Ansar declared his slave free after his death, as he had no other property. This news reached the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) and he said: Who will buy him from me? And Nu'aim bin al-Nahham bought him for eight hundred dirhams and he handed them over to him, 'Amr (one of the narrators) said: I heard Jabir bin 'Abdullah رضی اللہ عنہ as saying: He was a Coptic slave, and he died in the first year (of the Caliphate of 'Abdullah bin Zubair رضی اللہ عنہ).",
        "malay_translation": "Seorang lelaki daripada kalangan Ansar mengisytiharkan hambanya merdeka selepas kematiannya, kerana dia tidak mempunyai harta lain. Berita ini sampai kepada Rasulullah (صلى الله عليه وسلم) dan baginda bersabda: Siapa yang akan membeli hamba ini daripada aku? Dan Nu'aim bin al-Nahham membelinya dengan harga lapan ratus dirham dan dia menyerahkan wang tersebut kepadanya. 'Amr (salah seorang perawi) berkata: Saya mendengar Jabir bin 'Abdullah رضي الله عنه berkata: Dia adalah seorang hamba Koptik, dan dia meninggal dunia pada tahun pertama (Khalifah 'Abdullah bin Zubair رضي الله عنه).",
        "arabic_text": "حَدَّثَنَا أَبُو الرَّبِيعِ سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، أَنَّ رَجُلًا مِنَ الْأَنْصَارِ أَعْتَقَ غُلَامًا لَهُ عَنْ دُبُرٍ، لَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُ، فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «مَنْ يَشْتَرِيهِ مِنِّي؟» فَاشْتَرَاهُ نُعَيْمُ بْنُ عَبْدِ اللهِ بِثَمَانِ مِائَةِ دِرْهَمٍ، فَدَفَعَهَا إِلَيْهِ، قَالَ عَمْرٌو: سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ: «عَبْدًا قِبْطِيًّا مَاتَ عَامَ أَوَّلَ."
      },
      {
        "id": 11903,
        "hadith_number": "4339",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Kisah Pembebasan Hamba dan Penjualan Oleh Nabi (ﷺ)",
        "perawi_melayu": "Jabir رضي الله عنه meriwayatkan:",
        "english_text": "A person amongst the Ansar who had no other property declared a slave free after his death. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sold him, and Ibn al-Nahham bought him and he was a Coptic slave (who) died in the first year of the Caliphate of Ibn Zubair رضی اللہ عنہ .",
        "malay_translation": "Seorang lelaki daripada kalangan Ansar yang tidak mempunyai harta lain telah mengisytiharkan seorang hamba sebagai merdeka selepas kematiannya. Rasulullah (ﷺ) menjual hamba tersebut, dan Ibn al-Nahham membelinya dan dia adalah seorang hamba Koptik (yang) meninggal dunia pada tahun pertama Khilafah Ibn Zubair رضي الله عنه.",
        "arabic_text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، عَنِ ابْنِ عُيَيْنَةَ، قَالَ أَبُو بَكْرٍ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، قَالَ: سَمِعَ عَمْرٌو، جَابِرًا يَقُولُ: دَبَّرَ رَجُلٌ مِنَ الْأَنْصَارِ غُلَامًا لَهُ، لَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُ، فَبَاعَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ جَابِرٌ: «فَاشْتَرَاهُ ابْنُ النَّحَّامِ عَبْدًا قِبْطِيًّا مَاتَ عَامَ أَوَّلَ فِي إِمَارَةِ ابْنِ الزُّبَيْرِ."
      },
      {
        "id": 11904,
        "hadith_number": "4340",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Hadith Mengenai Mudabbir (Pengurusan Harta)",
        "perawi_melayu": "Daripada Jabir رضي الله عنه",
        "english_text": "A hadith like that Hammad from 'Amr bin Dinaar (as no. 4338) was narrated from Jabir رضی اللہ عنہ, from prophet ﷺ, concerning the Mudabbir.",
        "malay_translation": "Sebuah hadith seperti itu diriwayatkan daripada Hammad daripada 'Amr bin Dinaar (seperti no. 4338) daripada Jabir رضي الله عنه, daripada Nabi ﷺ, berkenaan dengan Mudabbir.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَابْنُ رُمْحٍ، عَنِ اللَّيْثِ بْنِ سَعْدٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فِي الْمُدَبَّرِ نَحْوَ حَدِيثِ حَمَّادٍ، عَنْ عَمْرِو بْنِ دِينَارٍ."
      },
      {
        "id": 11905,
        "hadith_number": "4341",
        "status": "Sahih",
        "nama_buku": "Sahih Muslim",
        "penulis_buku": "Imam Muslim",
        "tajuk_hadith": "Jualan Mudabbar oleh Jabir bin Abdullah (Radiyallahu 'Anhu)",
        "perawi_melayu": "Tiada maklumat perawi",
        "english_text": "It was narrated from 'Ata bin Abi Rabah, Ibn Az Zubair and 'Amr bin Dinar that Jabir bin Abdullah رضی اللہ عنہ told them about the sale of a Mudabbar. All of them said, a Hadith like that of Hammad and Ibn Uyaynah from 'Amr from Jabir رضی اللہ عنہ (no. 4338, 4339)",
        "malay_translation": "Diriwayatkan daripada 'Ata bin Abi Rabah, Ibn Az Zubair dan 'Amr bin Dinar bahawa Jabir bin Abdullah رضي الله عنه memberitahu mereka tentang penjualan seorang Mudabbar. Kesemua mereka berkata, sebuah Hadith seperti yang diriwayatkan oleh Hammad dan Ibn Uyaynah daripada 'Amr daripada Jabir رضي الله عنه (no. 4338, 4339)",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا الْمُغِيرَةُ يَعْنِي الْحِزَامِيَّ، عَنْ عَبْدِ الْمَجِيدِ بْنِ سُهَيْلٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، ح وحَدَّثَنِي عَبْدُ اللهِ بْنُ هَاشِمٍ، حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ، عَنِ الْحُسَيْنِ بْنِ ذَكْوَانَ الْمُعَلِّمِ، حَدَّثَنِي عَطَاءٌ، عَنْ جَابِرٍ، ح وحَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، حَدَّثَنَا مُعَاذٌ، حَدَّثَنِي أَبِي، عَنْ مَطَرٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، وَأَبِي الزُّبَيْرِ، وَعَمْرِو بْنِ دِينَارٍ، أَنَّ جَابِرَ بْنَ عَبْدِ اللهِ، حَدَّثَهُمْ فِي بَيْعِ الْمُدَبَّرِ كُلُّ هَؤُلَاءِ، قَالَ: عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ حَمَّادٍ، وَابْنِ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ جَابِرٍ."
      }
    ]
  }
}