{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 67,
    "data": [
      {
        "id": 26662,
        "hadith_number": "2308",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Sesiapa Dilantik Sebagai Hakim Telah Disembelih Tanpa Pisau",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said: “Whoever is appointed judge between the people, he has been slaughtered without a knife.”",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah bahawa Nabi (ﷺ) bersabda: “Sesiapa yang dilantik sebagai hakim di antara manusia, sesungguhnya dia telah disembelih tanpa pisau.”",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا مُعَلَّى بْنُ مَنْصُورٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، ‏‏‏‏‏‏عَنْ عُثْمَانَ بْنِ مُحَمَّدٍ، ‏‏‏‏‏‏عَنْالْمَقْبُريِّ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ جُعِلَ قَاضِيًا بَيْنَ النَّاسِ فَقَدْ ذُبِحَ بِغَيْرِ سِكِّينٍ ."
      },
      {
        "id": 26663,
        "hadith_number": "2309",
        "status": "Sahih (Sahih)",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Balasan Bagi Mereka yang Meminta Jawatan Hakim",
        "perawi_melayu": "Anas bin Malik (Semoga Allah meredhainya)",
        "english_text": "It was narrated from Anas bin Malik that the Messenger of Allah (ﷺ) said: “Whoever asks to be appointed a judge, will be entrusted to himself, but “Whoever asks to be appointed a judge, will be entrusted to himself, but whoever is forced to accept position, an angel will come down to him and guide him.' ”",
        "malay_translation": "Diriwayatkan daripada Anas bin Malik bahawa Rasulullah (ﷺ) bersabda: “Sesiapa yang meminta untuk dilantik sebagai hakim, maka dia akan diserahkan kepada dirinya sendiri. Tetapi sesiapa yang dipaksa untuk menerima jawatan, maka malaikat akan turun kepadanya dan membimbingnya.”",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ إِسْمَاعِيل، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏حَدَّثَنَا إِسْرَائِيلُ، ‏‏‏‏‏‏عَنْ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏عَنْ بِلَالِ بْنِ أَبِي مُوسَى، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ سَأَلَ الْقَضَاءَ وُكِلَ إِلَى نَفْسِهِ وَمَنْ جُبِرَ عَلَيْهِ نَزَلَ إِلَيْهِ آلِكْ فَسَدَّدَهُ ."
      },
      {
        "id": 26664,
        "hadith_number": "2310",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Doa Rasulullah (ﷺ) untuk Ali (r.a.) Ketika Mengutus ke Yaman",
        "perawi_melayu": "'Ali (r.a.)",
        "english_text": "It was narrated that 'Ali said: “The Messenger of Allah (ﷺ) sent me to Yemen. I said: 'O Messenger of Allah, you are sending me to judge between them while I am a young man, and I do not know how to judge.' He struck me on the chest with his hand and said: 'O Allah, guide his heart and make his tongue steadfast.' And after that I never doubted in passing judgment between two people.”",
        "malay_translation": "Diriwayatkan bahawa 'Ali berkata: “Rasulullah (ﷺ) mengutusku ke Yaman. Aku berkata: 'Wahai Rasulullah, engkau mengutusku untuk menghakimi antara mereka sedangkan aku masih muda, dan aku tidak tahu bagaimana untuk menghakimi.' Baginda menepuk dadaku dengan tangan baginda dan berkata: 'Ya Allah, bimbinglah hatinya dan teguhkanlah lidahnya.' Dan selepas itu, aku tidak pernah ragu dalam membuat keputusan antara dua orang.”",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا يَعْلَى، ‏‏‏‏‏‏ وَأَبُو مُعَاوِيَةَ، ‏‏‏‏‏‏عَنِ الأَعْمَشِ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ مُرَّةَ، ‏‏‏‏‏‏عَنْ أَبِي الْبَخْتَرِيِّ، ‏‏‏‏‏‏عَنْ عَلِيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَمَنِ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ تَبْعَثُنِي وَأَنَا شَابٌّ أَقْضِي بَيْنَهُمْ وَلَا أَدْرِي مَا الْقَضَاءُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَضَرَبَ بِيَدِهِ فِي صَدْرِي ثُمَّ قَالَ:‏‏‏‏ اللَّهُمَّ اهْدِ قَلْبَهُ وَثَبِّتْ لِسَانَهُ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَمَا شَكَكْتُ بَعْدُ فِي قَضَاءٍ بَيْنَ اثْنَيْنِ."
      },
      {
        "id": 26665,
        "hadith_number": "2311",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukuman bagi Hakim yang Zalim",
        "perawi_melayu": "'Abdullah (bin Mas'ud)",
        "english_text": "It was narrated that 'Abdullah said: “The Messenger of Allah (ﷺ) said: “There is no judge who judges between the people but on the Day of Resurrection an angel will come and take hold of the back of his head towards the sky and if it said: “Throw him, “he will throw into an abyss the depth of forty autumns (years).' ”",
        "malay_translation": "Diriwayatkan bahawa 'Abdullah berkata: \"Rasulullah (ﷺ) bersabda: 'Tidak ada seorang hakim yang menghakimi di antara manusia melainkan pada Hari Kiamat, seorang malaikat akan datang dan memegang tengkuk kepalanya ke arah langit. Jika malaikat itu berkata: 'Lemparkannya,' maka dia akan dilemparkan ke dalam jurang yang kedalamannya adalah empat puluh musim (tahun).'",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، ‏‏‏‏‏‏حَدَّثَنَا مُجَالِدٌ عَنْ عَامِرٍ، ‏‏‏‏‏‏عَنْ مَسْرُوقٍ، ‏‏‏‏‏‏عَنْعَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَا مِنْ حَاكِمٍ يَحْكُمُ بَيْنَ النَّاسِ إِلَّا جَاءَ يَوْمَ الْقِيَامَةِ وَمَلَكٌ آخِذٌ بِقَفَاهُ ثُمَّ يَرْفَعُ رَأْسَهُ إِلَى السَّمَاءِ فَإِنْ قَالَ:‏‏‏‏ أَلْقِهِ أَلْقَاهُ فِي مَهْوَاةٍ أَرْبَعِينَ خَرِيفًا ."
      },
      {
        "id": 26666,
        "hadith_number": "2312",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Allah Bersama Hakim yang Adil",
        "perawi_melayu": "Daripada 'Abdullah bin Abu Awfa",
        "english_text": "It was narrated from 'Abdullah bin Abu Awfa that the Messenger of Allah (ﷺ) said: “Allah is with the judge so long as he is not unjust, but if he rules unjustly, He entrusts him to himself.”",
        "malay_translation": "Diriwayatkan daripada 'Abdullah bin Abu Awfa bahawa Rasulullah (ﷺ) bersabda: “Sesungguhnya Allah bersama dengan hakim selagi dia tidak berlaku zalim. Sekiranya dia menghukum secara zalim, maka Allah menyerahkannya kepada dirinya sendiri.”",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانَ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ بِلَالٍ، ‏‏‏‏‏‏عَنْ عِمْرَانَ الْقَطَّانِ، ‏‏‏‏‏‏عَنْ حُسَيْنٍ يَعْنِي ابْنَ عِمْرَانَ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق الشَّيْبَانِيِّ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ اللَّهَ مَعَ الْقَاضِي مَا لَمْ يَجُرْ فَإِذَا جَارَ وَكَّلَهُ إِلَى نَفْسِهِ ."
      },
      {
        "id": 26667,
        "hadith_number": "2313",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Laknat Allah ke atas Pemberi dan Penerima Rasuah",
        "perawi_melayu": "'Abdullah bin 'Amr (Semoga Allah meredhainya)",
        "english_text": "It was narrated from 'Abdullah bin 'Amr that the Messenger of Allah (ﷺ) said: “The curse of Allah is upon the one who offers a bribe and the one who takes it.”",
        "malay_translation": "Diriwayatkan daripada 'Abdullah bin 'Amr (Semoga Allah meredhainya), bahawa Rasulullah (ﷺ) bersabda: \"Laknat Allah ke atas pemberi rasuah dan penerimanya.\"",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، ‏‏‏‏‏‏عَنْ خَالِهِ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْعَبْدِ اللَّهِ بْنِ عَمْرٍو، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَعْنَةُ اللَّهِ عَلَى الرَّاشِي وَالْمُرْتَشِي ."
      },
      {
        "id": 26668,
        "hadith_number": "2314",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Ganjaran Hakim yang Adil dan Usahanya",
        "perawi_melayu": "'Amr bin 'As رضي الله عنه",
        "english_text": "It was narrated from 'Amr bin 'As that he heard the Messenger of Allah (ﷺ) say: “When the judge passes a judgement and does his best and gets it right, he will have two rewards, and if he passes a judgement and does his best and gets it wrong, he will have one reward.” (Sahih) Yazid (one of narrators) said : “So I Narrated it to Abu Bakr bin 'Amr bin Hazm. He said: 'This is how it was narrated to me by Abu Salamah from Abu Hurairah.'”",
        "malay_translation": "Diriwayatkan daripada 'Amr bin 'As رضي الله عنه bahawa dia mendengar Rasulullah ﷺ bersabda: \"Apabila seorang hakim membuat keputusan dan berusaha sedaya upaya, lalu keputusannya betul, maka baginya dua ganjaran, dan jika dia membuat keputusan dan berusaha sedaya upaya, lalu keputusannya salah, maka baginya satu ganjaran.\" (Sahih) Yazid (salah seorang perawi) berkata: \"Maka aku meriwayatkannya kepada Abu Bakr bin 'Amr bin Hazm. Dia berkata: 'Beginilah Abu Salamah meriwayatkannya kepadaku daripada Abu Hurairah.'\"",
        "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ اللَّهِ بْنِ الْهَادِ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ، ‏‏‏‏‏‏عَنْ بُسْرِ بْنِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ أَبِي قَيْسٍ مَوْلَى عَمْرِو بْنِ الْعَاصِ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ الْعَاصِ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ إِذَا حَكَمَ الْحَاكِمُ فَاجْتَهَدَ فَأَصَابَ فَلَهُ أَجْرَانِ، ‏‏‏‏‏‏وَإِذَا حَكَمَ فَاجْتَهَدَ فَأَخْطَأَ فَلَهُ أَجْرٌ ، ‏‏‏‏‏‏قَالَ يَزِيدُ:‏‏‏‏ فَحَدَّثْتُ بِهِ أَبَا بَكْرِ بْنَ عَمْرِو بْنِ حَزْمٍ فَقَالَ:‏‏‏‏ هَكَذَا حَدَّثَنِيهِ أَبُو سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ"
      },
      {
        "id": 26669,
        "hadith_number": "2315",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hakim: Tiga Kategori, Dua di Neraka, Satu di Syurga",
        "perawi_melayu": "Abu Hashim",
        "english_text": "Abu Hashim said: “Were it not for the Hadith of Ibn Buraidah from his father, from the Prophet (ﷺ) who said: 'Judges are of three types, two of whom will be in Hell and one will be in Paradise. The man who knows the truth and rules in accordance with it, will be in Paradise. The man who passes judgment on the people in ignorance will be in Hell' - we would have said that if the judge does his best he will be in Paradise.”",
        "malay_translation": "Abu Hashim berkata: “Sekiranya bukan kerana Hadith daripada Ibn Buraidah daripada bapanya, daripada Nabi (ﷺ) yang bersabda: 'Hakim itu ada tiga jenis, dua daripadanya akan berada di Neraka dan satu akan berada di Syurga. Seseorang yang mengetahui kebenaran dan menghukumnya, akan berada di Syurga. Seseorang yang membuat penghakiman terhadap manusia dalam kejahilan akan berada di Neraka' - kami akan berkata bahawa jika hakim berusaha sedaya upaya, dia akan berada di Syurga.”",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيل بْنُ تَوْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا خَلَفُ بْنُ خَلِيفَةَ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو هَاشِمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَوْلَا حَدِيثُ ابْنِ بُرَيْدَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ الْقُضَاةُ ثَلَاثَةٌ:‏‏‏‏ اثْنَانِ فِي النَّارِ، ‏‏‏‏‏‏وَوَاحِدٌ فِي الْجَنَّةِ رَجُلٌ عَلِمَ الْحَقَّ فَقَضَى بِهِ فَهُوَ فِي الْجَنَّةِ وَرَجُلٌ قَضَى لِلنَّاسِ عَلَى جَهْلٍ فَهُوَ فِي النَّارِ وَرَجُلٌ جَارَ فِي الْحُكْمِ فَهُوَ فِي النَّارِ لَقُلْنَا إِنَّ الْقَاضِيَ إِذَا اجْتَهَدَ فَهُوَ فِي الْجَنَّةِ ."
      },
      {
        "id": 26670,
        "hadith_number": "2316",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Penghakiman Tidak Sah Ketika Marah",
        "perawi_melayu": "'Abdul-Malik bin 'Umair meriwayatkan daripada 'Abdur-Rahman bin Abu Bakrah daripada bapanya",
        "english_text": "It was narrated from 'Abdul-Malik bin 'Umair that he heard 'Abdur-Rahman bin Abu Bakrah (narrate) from his father that the Messenger of Allah (ﷺ) said: “Let the judge (Qadi) not pass a judgment when he is angry.”",
        "malay_translation": "Diriwayatkan daripada 'Abdul-Malik bin 'Umair bahawa dia mendengar 'Abdur-Rahman bin Abu Bakrah (meriwayatkan) daripada bapanya bahawa Rasulullah (ﷺ) bersabda: \"Janganlah seorang hakim (Qadi) membuat keputusan ketika dia sedang marah.\"",
        "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، ‏‏‏‏‏‏ وَأَحْمَدُ بْنُ ثَابِتٍ الْجَحْدَرِيُّ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا يَقْضِي الْقَاضِي بَيْنَ اثْنَيْنِ وَهُوَ غَضْبَانُ ، ‏‏‏‏‏‏قَالَ هِشَامٌ فِي حَدِيثِهِ:‏‏‏‏ لَا يَنْبَغِي لِلْحَاكِمِ أَنْ يَقْضِيَ بَيْنَ اثْنَيْنِ وَهُوَ غَضْبَانُ."
      },
      {
        "id": 26671,
        "hadith_number": "2317",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukum Berdasarkan Bukti, Bukan Kebenaran Mutlak",
        "perawi_melayu": "Umm Salamah",
        "english_text": "It was narrated from Umm Salamah that the Messenger of Allah (ﷺ) said: “You refer your disputes to me and I am only human. Perhaps some of you may be more eloquent in presenting your case than others, so I rule in your favor because of what I hear from you. If I pass a judgement in favor of one of you that detracts from his brother's rights, then he should not take it, because it is a piece of fire that is given to him which he will bring forth on the Day Resurrection.”",
        "malay_translation": "Diriwayatkan daripada Ummu Salamah bahawa Rasulullah (ﷺ) bersabda: “Kamu mengemukakan perselisihan kamu kepadaku, dan aku hanyalah manusia. Barangkali sebahagian daripada kamu lebih fasih dalam mengemukakan kes daripada yang lain, maka aku menghukum memihak kepada kamu berdasarkan apa yang aku dengar daripada kamu. Jika aku membuat keputusan memihak kepada salah seorang daripada kamu yang mengurangkan hak saudaranya, maka janganlah dia mengambilnya, kerana ia adalah seketul api yang diberikan kepadanya yang akan dibawanya pada Hari Kebangkitan.”",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ، ‏‏‏‏‏‏عَنْ أُمِّ سَلَمَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّكُمْ تَخْتَصِمُونَ إِلَيَّ وَإِنَّمَا أَنَا بَشَرٌ وَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَلْحَنَ بِحُجَّتِهِ مِنْ بَعْضٍ وَإِنَّمَا أَقْضِي بَيْنَكُمْ عَلَى نَحْوٍ مِمَّا أَسْمَعُ مِنْكُمْ فَمَنْ قَضَيْتُ لَهُ مِنْ حَقِّ أَخِيهِ شَيْئًا فَلَا يَأْخُذْهُ فَإِنَّمَا أَقْطَعُ لَهُ قِطْعَةً مِنَ النَّارِ يَأْتِي بِهَا يَوْمَ الْقِيَامَةِ ."
      },
      {
        "id": 26672,
        "hadith_number": "2318",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Nabi ﷺ Bersabda: 'Aku Hanya Manusia Biasa'",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: “I am only human, and some of you may be more eloquent in presenting your case than others. If I pass a judgement in his favor that detracts from his brother's rights, I am giving him a piece of fire.”",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah رضي الله عنه bahawa Rasulullah ﷺ bersabda: “Sesungguhnya aku hanyalah manusia biasa, dan sesetengah daripada kamu mungkin lebih petah dalam mengemukakan kes daripada yang lain. Jika aku membuat keputusan memihak kepadanya sehingga mencacati hak saudaranya, maka sesungguhnya aku memberinya sekeping daripada neraka.”",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّمَا أَنَا بَشَرٌ وَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَلْحَنَ بِحُجَّتِهِ مِنْ بَعْضٍ فَمَنْ قَطَعْتُ لَهُ مِنْ حَقِّ أَخِيهِ قِطْعَةً فَإِنَّمَا أَقْطَعُ لَهُ قِطْعَةً مِنَ النَّارِ ."
      },
      {
        "id": 26673,
        "hadith_number": "2319",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Ancaman Bagi Yang Mengaku Hak Orang Lain",
        "perawi_melayu": "Abu Dharr",
        "english_text": "It was narrated from Abu Dharr that he heard the Messenger of Allah (ﷺ) say: “Whoever claims something that does not belong to him; he is not one of us, so let him take his place in Hell.”",
        "malay_translation": "Diriwayatkan daripada Abu Dharr bahawa dia mendengar Rasulullah (ﷺ) bersabda: “Sesiapa yang mendakwa sesuatu yang bukan haknya, maka dia bukanlah daripada golongan kami, maka biarlah dia mengambil tempatnya di dalam Neraka.”",
        "arabic_text": "حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ بْنِ عَبْدِ الْوَارِثِ بْنِ سَعِيدٍ أَبُو عُبَيْدَةَ، ‏‏‏‏‏‏حَدَّثَنِي أَبِي، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏حَدَّثَنِي الْحُسَيْنُ بْنُ ذَكْوَانَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنِي يَحْيَى بْنُ يَعْمَرَ، ‏‏‏‏‏‏أَنَّ أَبَا الْأَسْوَدِ الدِّيلِيّ حَدَّثَهُ، ‏‏‏‏‏‏عَنْ أَبِي ذَرٍّ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ مَنِ ادَّعَى مَا لَيْسَ لَهُ فَلَيْسَ مِنَّا وَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ ."
      },
      {
        "id": 26674,
        "hadith_number": "2320",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kemurkaan Allah Terhadap Pembelaan Kezaliman",
        "perawi_melayu": "Daripada Ibn 'Umar",
        "english_text": "It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said: “Whoever takes the wrongdoer's side in a dispute or supports wrongdoing, he will remain subject to the wrath of Allah until he gives it up.”",
        "malay_translation": "Diriwayatkan daripada Ibn 'Umar bahawa Rasulullah (ﷺ) bersabda: “Sesiapa yang membela orang zalim dalam perselisihan atau menyokong perbuatan zalim, dia akan terus berada di bawah kemurkaan Allah sehingga dia menghentikannya.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ ثَعْلَبَةَ بْنِ سَوَاءٍ، ‏‏‏‏‏‏حَدَّثَنِي عَمِّي مُحَمَّدُ بْنُ سَوَاءٍ، ‏‏‏‏‏‏عَنْ حُسَيْنٍ الْمُعَلِّمِ، ‏‏‏‏‏‏عَنْ مَطَرٍ الْوَرَّاقِ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ أَعَانَ عَلَى خُصُومَةٍ بِظُلْمٍ أَوْ يُعِينُ عَلَى ظُلْمٍ لَمْ يَزَلْ فِي سَخَطِ اللَّهِ حَتَّى يَنْزِعَ ."
      },
      {
        "id": 26675,
        "hadith_number": "2321",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kewajipan Sumpah dalam Tuntutan",
        "perawi_melayu": "Daripada Ibn 'Abbas",
        "english_text": "It was narrated from Ibn 'Abbas that the Messenger of Allah (ﷺ) said: “If the people were given what they claimed, some would have claimed the lives and property of men. But the one the claim is made against is obliged to swear an oath.”",
        "malay_translation": "Diriwayatkan daripada Ibn 'Abbas bahawa Rasulullah (ﷺ) bersabda: “Sekiranya manusia diberikan apa yang mereka tuntut, nescaya ada orang yang akan menuntut nyawa dan harta orang lain. Akan tetapi, orang yang dituntut itu diwajibkan bersumpah.”",
        "arabic_text": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى الْمِصْرِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، ‏‏‏‏‏‏أَنْبَأَنَا ابْنُ جُرَيْجٍ، ‏‏‏‏‏‏عَنِ ابْنِ أَبِي مُلَيْكَةَ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَوْ يُعْطَى النَّاسُ بِدَعْوَاهُمُ ادَّعَى نَاسٌ دِمَاءَ رِجَالٍ وَأَمْوَالَهُمْ وَلَكِنْ الْيَمِينُ عَلَى الْمُدَّعَى عَلَيْهِ ."
      },
      {
        "id": 26676,
        "hadith_number": "2322",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Sumpah Palsu dan Akibatnya",
        "perawi_melayu": "Ash'ath bin Qais",
        "english_text": "It was narrated that Ash'ath bin Qais Said: “There was a dispute between myself and a Jewish man concerning some land, and he denied me my rights so I brought him to the Prophet (ﷺ). The Messenger of Allah (ﷺ) said to me: 'Do you have proof' I said: 'No.’ He said to the Jews, 'Swear an oath.' I said: 'If he swears an oath he will take my property.' Then Allah, Glorious is He, revealed: 'Verily, those who purchase a small gain at the cost of Allah's covenant and their oaths, they shall have no portion in the Hereafter (Paradise). Neither will Allah neither speak to them nor look at them on the Day of Resurrection nor will He purifies them, and they shall have a painful torment.”",
        "malay_translation": "Diriwayatkan daripada Ash'ath bin Qais, beliau berkata: \"Telah berlaku pertikaian antara aku dan seorang lelaki Yahudi mengenai sebidang tanah, dan dia menafikan hakku. Lalu aku membawanya kepada Nabi (ﷺ). Rasulullah (ﷺ) bertanya kepadaku: 'Adakah kamu mempunyai bukti?' Aku menjawab: 'Tidak.' Baginda berkata kepada orang Yahudi itu: 'Bersumpahlah.' Aku berkata: 'Jika dia bersumpah, dia akan mengambil hartaku.' Kemudian Allah, Maha Suci Dia, menurunkan firman-Nya: 'Sesungguhnya, orang-orang yang menjual janji Allah dan sumpah mereka dengan harga yang murah, mereka tidak akan mendapat bahagian di akhirat (Syurga). Allah tidak akan berbicara kepada mereka dan tidak akan memandang mereka pada Hari Kiamat dan tidak akan menyucikan mereka, dan bagi mereka azab yang pedih.\"'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، ‏‏‏‏‏‏ وَعَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏ وَأَبُو مُعَاوِيَةَ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا الْأَعْمَشُ، ‏‏‏‏‏‏عَنْ شَقِيقٍ، ‏‏‏‏‏‏عَنِ الْأَشْعَثِ بْنِ قَيْسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ بَيْنِي وَبَيْنَ رَجُلٍ مِنَ الْيَهُودِ أَرْضٌ فَجَحَدَنِي فَقَدَّمْتُهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ هَلْ لَكَ بَيِّنَةٌ؟ قُلْتُ:‏‏‏‏ لَا، ‏‏‏‏‏‏قَالَ لِلْيَهُودِيِّ:‏‏‏‏ احْلِفْ ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ إِذًا يَحْلِفَ فِيهِ فَيَذْهَبَ بِمَالِي، ‏‏‏‏‏‏فَأَنْزَلَ اللَّهُ سُبْحَانَهُ إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلا سورة آل عمران آية 77 إِلَى آخِرِ الْآيَةِ ."
      },
      {
        "id": 26677,
        "hadith_number": "2323",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Ancaman Sumpah Palsu untuk Mengambil Harta Orang Muslim",
        "perawi_melayu": "Abdullah bin Mas'ud (Semoga Allah meredhainya)",
        "english_text": "It was narrated from 'Abdullah bin Mas'ud that the Messenger of Allah (ﷺ) said: “Whoever swears a false oath in order to seize the wealth of a Muslim unlawfully, he will meet Allah when He is angry with him.”",
        "malay_translation": "Diriwayatkan daripada 'Abdullah bin Mas'ud (Semoga Allah meredhainya), bahawa Rasulullah (ﷺ) bersabda: “Sesiapa yang bersumpah dengan sumpah palsu untuk merampas harta seorang Muslim secara tidak sah, dia akan bertemu Allah dalam keadaan Allah murka kepadanya.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏ وَأَبُو مُعَاوِيَةَ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا الْأَعْمَشُ، ‏‏‏‏‏‏عَنْ شَقِيقٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ حَلَفَ عَلَى يَمِينٍ وَهُوَ فِيهَا فَاجِرٌ يَقْتَطِعُ بِهَا مَالَ امْرِئٍ مُسْلِمٍ لَقِيَ اللَّهَ وَهُوَ عَلَيْهِ غَضْبَانُ ."
      },
      {
        "id": 26678,
        "hadith_number": "2324",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukuman Merampas Harta Muslim dengan Sumpah Palsu",
        "perawi_melayu": "Abu Umamah Al-Harithi (Semoga Allah meredhainya)",
        "english_text": "Abu Umamah Al-Harithi narrated that he heard the Messenger of Allah (ﷺ) say: “No man seizes the wealth of a Muslim unlawfully by means of his (false) oath, but Allah will deny Paradise to him and will doom him to Hell.” A man among the people said: “O Messenger of Allah, even if it is something small?” He said: “Even if it is a twig of an Arak tree.”",
        "malay_translation": "Abu Umamah Al-Harithi meriwayatkan bahawa dia mendengar Rasulullah (ﷺ) bersabda: “Tidaklah seorang lelaki merampas harta seorang Muslim secara haram dengan sumpahnya yang (palsu), melainkan Allah akan mengharamkan syurga baginya dan akan memasukkannya ke dalam neraka.” Seorang lelaki di kalangan orang ramai berkata: “Wahai Rasulullah, walaupun ia sesuatu yang kecil?” Baginda bersabda: “Walaupun ia sebatang ranting pokok Arak.”",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو أُسَامَةَ، ‏‏‏‏‏‏عَنِ الْوَلِيدِ بْنِ كَثِيرٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ كَعْبٍ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ أَخَاهُ عَبْدَ اللَّهِ بْنَ كَعْبٍ، ‏‏‏‏‏‏أَنَّ أَبَا أُمَامَةَ الْحَارِثِيَّ حَدَّثَهُ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ لَا يَقْتَطِعُ رَجُلٌ حَقَّ امْرِئٍ مُسْلِمٍ بِيَمِينِهِ إِلَّا حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ وَأَوْجَبَ لَهُ النَّارَ ، ‏‏‏‏‏‏فَقَالَ رَجُلٌ مِنَ الْقَوْمِ:‏‏‏‏ يَا رَسُولَ اللَّهِ وَإِنْ كَانَ شَيْئًا يَسِيرًا؟ قَالَ:‏‏‏‏ وَإِنْ كَانَ سِوَاكًا مِنْ أَرَاكٍ ."
      },
      {
        "id": 26679,
        "hadith_number": "2325",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Ancaman Sumpah Palsu di Mimbar Nabi",
        "perawi_melayu": "Jabir bin 'Abdullah (Semoga Allah meredhai mereka)",
        "english_text": "It was narrated from Jabir bin 'Abdullah that the Messenger of Allah (ﷺ) said: 'Whoever swears a false oath near this pulpit of mine, let him take his place in Hell, even if it is for a green twig.”",
        "malay_translation": "Diriwayatkan daripada Jabir bin 'Abdullah bahawa Rasulullah (ﷺ) bersabda: 'Sesiapa yang bersumpah palsu di dekat mimbar aku ini, maka hendaklah dia mengambil tempatnya di dalam neraka, walaupun hanya kerana dahan hijau.'",
        "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، ‏‏‏‏‏‏حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، ‏‏‏‏‏‏ح وَحَدَّثَنَا أَحْمَدُ بْنُ ثَابِتٍ الْجَحْدَرِيُّ، ‏‏‏‏‏‏حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا هَاشِمُ بْنُ هَاشِمٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ نِسْطَاسٍ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ حَلَفَ بِيَمِينٍ آثِمَةٍ عِنْدَ مِنْبَرِي هَذَا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ وَلَوْ عَلَى سِوَاكٍ أَخْضَرَ ."
      },
      {
        "id": 26680,
        "hadith_number": "2326",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Sumpah Palsu di Mimbar Rasulullah (ﷺ)",
        "perawi_melayu": "Abu Hurairah (رَضِيَ اللَّهُ عَنْهُ)",
        "english_text": "Muhammad bin Yahya, who is Abu Yunus Al-Qawi, said: I heard Abu Salamah say: I heard Abu Hurairah say: “The Messenger of Allah (ﷺ) said: 'No man or woman swears a false oath beside this pulpit, even if it is for a fresh twig, but he will be doomed to Hell.”",
        "malay_translation": "Muhammad bin Yahya, yang dikenali sebagai Abu Yunus Al-Qawi, berkata: Saya mendengar Abu Salamah berkata: Saya mendengar Abu Hurairah berkata: “Rasulullah (ﷺ) bersabda: 'Tidak ada lelaki atau perempuan yang bersumpah palsu di sisi mimbar ini, walaupun untuk sebatang ranting yang segar, melainkan dia akan dihumbankan ke Neraka.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏ وَزَيْدُ بْنُ أَخْزَمَ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ، ‏‏‏‏‏‏حَدَّثَنَا الْحَسَنُ بْنُ يَزِيدَ بْنِ فَرُّوخَ، ‏‏‏‏‏‏قَالَ مُحَمَّدُ بْنُ يَحْيَى وَهُوَ أَبُو يُونُسَ الْقَوِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ أَبَا سَلَمَةَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ سَمِعْتُ أَبَا هُرَيْرَةَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا يَحْلِفُ عِنْدَ هَذَا الْمِنْبَرِ عَبْدٌ وَلَا أَمَةٌ عَلَى يَمِينٍ آثِمَةٍ وَلَوْ عَلَى سِوَاكٍ رَطْبٍ إِلَّا وَجَبَتْ لَهُ النَّارُ ."
      },
      {
        "id": 26681,
        "hadith_number": "2327",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Nabi ﷺ Bersumpah dengan Nama Allah kepada Ulama Yahudi",
        "perawi_melayu": "Bara' bin 'Azib (رضي الله عنه)",
        "english_text": "It was narrated from Bara' bin 'Azib that the Messenger of Allah (ﷺ) called one of the Jewish scholars and said: “ Swear by the One Who sent the Torah (Tawrah) down to Musa.”",
        "malay_translation": "Diriwayatkan daripada Bara' bin 'Azib bahawa Rasulullah (ﷺ) memanggil salah seorang ulama Yahudi dan bersabda: “Bersumpahlah demi Allah yang menurunkan Taurat (Tawrah) kepada Musa.”",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو مُعَاوِيَةَ، ‏‏‏‏‏‏عَنِ الْأَعْمَشِ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، ‏‏‏‏‏‏عَنِ الْبَرَاءِ بْنِ عَازِبٍ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعَا رَجُلًا مِنْ عُلَمَاءِ الْيَهُودِ فَقَالَ:‏‏‏‏ أَنْشُدُكَ بِاللهِ الَّذِي أَنْزَلَ التَّوْرَاةَ عَلَى مُوسَى ."
      },
      {
        "id": 26682,
        "hadith_number": "2328",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Nabi ﷺ Bersumpah dengan Nama Allah kepada Dua Orang Yahudi",
        "perawi_melayu": "Jabir bin 'Abdullah (Semoga Allah meredhainya)",
        "english_text": "It was narrated from Jabir bin 'Abdullah that the Messenger of Allah (ﷺ) said to two Jews: “Swear by Allah Who sent the Tawrah down to Musa, peace be upon him.”",
        "malay_translation": "Diriwayatkan daripada Jabir bin 'Abdullah (Semoga Allah meredhainya) bahawa Rasulullah (ﷺ) bersabda kepada dua orang Yahudi: “Bersumpahlah dengan Allah yang telah menurunkan Taurat kepada Musa, semoga kesejahteraan ke atasnya.”",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو أُسَامَةَ، ‏‏‏‏‏‏عَنْ مُجَالِدٍ، ‏‏‏‏‏‏أَنْبَأَنَا عَامِرٌ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِيَهُودِيَّيْنِ:‏‏‏‏ نَشَدْتُكُمَا بِاللَّهِ الَّذِي أَنْزَلَ التَّوْرَاةَ عَلَى مُوسَى عَلَيْهِ السَّلَام ."
      },
      {
        "id": 26683,
        "hadith_number": "2329",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Perintah Nabi (ﷺ) Melempar Undi dalam Tuntutan Haiwan",
        "perawi_melayu": "Abu Hurairah (رَضِيَ اللَّهُ عَنْهُ)",
        "english_text": "It was narrated from Abu Hurairah that: he said that two men laid claim to an animal, and neither of them had any proof, so the Prophet (ﷺ) commanded them to cast lots as to which of them should swear an oath.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah (رَضِيَ اللَّهُ عَنْهُ) bahawa: Beliau berkata ada dua orang lelaki mendakwa seekor haiwan, dan tiada seorang pun daripada mereka mempunyai sebarang bukti, maka Nabi (ﷺ) memerintahkan mereka melempar undi tentang siapa di antara mereka yang perlu bersumpah.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، ‏‏‏‏‏‏حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ خِلَاسٍ، ‏‏‏‏‏‏عَنْ أَبِي رَافِعٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنَّهُ ذَكَرَ أَنَّ رَجُلَيْنِ ادَّعَيَا دَابَّةً وَلَمْ يَكُنْ بَيْنَهُمَا بَيِّنَةٌ فَأَمَرَهُمَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَنْ يَسْتَهِمَا عَلَى الْيَمِينِ ."
      },
      {
        "id": 26684,
        "hadith_number": "2330",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Keputusan Nabi ﷺ tentang Pembahagian Haiwan yang Diperselisihkan",
        "perawi_melayu": "Daripada Abu Musa",
        "english_text": "It was narrated from Abu Musa that : two men referred a dispute to the Messenger of Allah (ﷺ) concerning an animal, and neither of them had proof, so he ruled that it should be divided in half.",
        "malay_translation": "Diriwayatkan daripada Abu Musa رضي الله عنه bahawa: Dua orang lelaki mengemukakan pertikaian kepada Rasulullah ﷺ mengenai seekor haiwan, dan tiada seorang pun daripada mereka mempunyai bukti, maka Baginda memutuskan bahawa haiwan itu harus dibahagikan kepada dua bahagian.",
        "arabic_text": "حَدَّثَنَا إِسْحَاق بْنُ مَنْصُورٍ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ مَعْمَرٍ، ‏‏‏‏‏‏ وَزُهَيْرُ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، ‏‏‏‏‏‏حَدَّثَنَا سَعِيدٌ، ‏‏‏‏‏‏عَنْقَتَادَةَ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أَبِي مُوسَى، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اخْتَصَمَ إِلَيْهِ رَجُلَانِ بَيْنَهُمَا دَابَّةٌ وَلَيْسَ لِوَاحِدٍ مِنْهُمَا بَيِّنَةٌ فَجَعَلَهَا بَيْنَهُمَا نِصْفَيْنِ ."
      },
      {
        "id": 26685,
        "hadith_number": "2331",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hak Memiliki Barang yang Hilang atau Dicuri",
        "perawi_melayu": "Samurah bin Jundub رضي الله عنه",
        "english_text": "It was narrated from Samurah bin Jundub that the Messenger of Allah (ﷺ) said: “If a man loses something, or it is stolen from him, and he finds it in the possession of a man who bought it, then he has more right to it, and the one who bought it should ask for his money back from the one who sold it to him.' ”",
        "malay_translation": "Diriwayatkan daripada Samurah bin Jundub bahawa Rasulullah ﷺ bersabda: “Jika seseorang lelaki kehilangan sesuatu barang, atau barangnya dicuri, dan dia mendapatinya di dalam milikan seseorang lelaki yang telah membelinya, maka dia (pemilik asal) lebih berhak terhadapnya, dan orang yang membelinya hendaklah meminta semula wangnya daripada orang yang menjualnya kepadanya.”",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو مُعَاوِيَةَ، ‏‏‏‏‏‏حَدَّثَنَا حَجَّاجٌ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ عُبَيْدِ بْنِ زَيْدِ بْنِ عُقْبَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْسَمُرَةَ بْنِ جُنْدَبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا ضَاعَ لِلرَّجُلِ مَتَاعٌ أَوْ سُرِقَ لَهُ مَتَاعٌ فَوَجَدَهُ فِي يَدِ رَجُلٍ يَبِيعُهُ فَهُوَ أَحَقُّ بِهِ وَيَرْجِعُ الْمُشْتَرِي عَلَى الْبَائِعِ بِالثَّمَنِ ."
      },
      {
        "id": 26686,
        "hadith_number": "2332",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Tanggungjawab Pemilik Terhadap Haiwan Ternakan dan Harta Benda",
        "perawi_melayu": "Ibn Muhayyisah Al-Ansari",
        "english_text": "It was narrated from Ibn Shihab that : Ibn Muhayyisah Al-Ansari told him that a she-camel belonging to Bara used to wander free. It entered a garden belonging to some people and caused some damage. The Messenger of Allah (ﷺ) was told of that, and he ruled that property was to be protected by its owners of livestock were responsible for any damage caused by their animals during the night.",
        "malay_translation": "Diriwayatkan daripada Ibn Shihab bahawa: Ibn Muhayyisah Al-Ansari memberitahu beliau bahawa seekor unta betina milik Bara sering berkeliaran bebas. Unta tersebut memasuki kebun milik beberapa orang dan menyebabkan kerosakan. Rasulullah (ﷺ) dimaklumkan tentang hal itu, dan baginda memutuskan bahawa harta benda perlu dilindungi oleh pemiliknya dan pemilik ternakan bertanggungjawab terhadap sebarang kerosakan yang disebabkan oleh haiwan ternakan mereka pada waktu malam.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ، ‏‏‏‏‏‏أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، ‏‏‏‏‏‏عَنِ ابْنِ شِهَابٍ، ‏‏‏‏‏‏أَنَّ ابْنَ مُحَيِّصَةَ الْأَنْصَارِيَّ أَخْبَرَهُ أَنَّ نَاقَةً لِلْبَرَاءِ كَانَتْ ضَارِيَةً دَخَلَتْ فِي حَائِطِ قَوْمٍ فَأَفْسَدَتْ فِيهِ فَكُلِّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهَا فَقَضَى أَنَّ حِفْظَ الْأَمْوَالِ عَلَى أَهْلِهَا بِالنَّهَارِ، ‏‏‏‏‏‏وَعَلَى أَهْلِ الْمَوَاشِي مَا أَصَابَتْ مَوَاشِيهِمْ بِاللَّيْلِ ."
      },
      {
        "id": 26687,
        "hadith_number": "2333",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Sifat Peribadi Rasulullah (ﷺ) dan Kelembutan Hati Baginda",
        "perawi_melayu": "Seorang lelaki dari Bani Suwa'ah",
        "english_text": "It was narrated that a man from Banu Suwa'ah said: 'I said to 'Aishah: Tell me about the character of the Messenger of Allah (ﷺ).' She said: 'Have you not read the Qur'an: “And verily, you (O Mohammed {SAW}) are on an exalted (standard of) character?” She said: 'The Messenger of Allah (ﷺ) was with his Companions, and I made some food for him, and Hafsah made some food for him, but Hafash got there before me. So I said to the slave girl: “Overturn her bowl.” She went and caught up with her, and she was about to put (the bowl) in front of the Messenger of Allah (ﷺ). She overturned it and the bowl broke, scattering the food. The Messenger of Allah (ﷺ) gathered the pieces and the food on the leather mat and they ate. Then he sent for my bowl and gave it to Hafsah, and said: “Take this pot in place of your pot, and eat what is in it.” And I did not see any expression of anger on the face of the Messenger of Allah (ﷺ).' ”",
        "malay_translation": "Diriwayatkan bahawa seorang lelaki dari Bani Suwa'ah berkata: 'Aku berkata kepada 'Aishah: Ceritakan kepadaku tentang akhlak Rasulullah (ﷺ).' Beliau berkata: 'Tidakkah kamu membaca Al-Quran: “Dan sesungguhnya engkau (Muhammad) benar-benar berbudi pekerti yang agung?”' Beliau berkata: 'Rasulullah (ﷺ) bersama para Sahabatnya, dan aku menyediakan sedikit makanan untuknya, dan Hafsah juga menyediakan sedikit makanan untuknya, tetapi Hafsah sampai di sana sebelumku. Lalu aku berkata kepada hamba perempuan: “Terbalikkan mangkuknya.” Dia pergi dan mengejarnya, dan dia hampir meletakkan (mangkuk) di hadapan Rasulullah (ﷺ). Dia menerbalikannya dan mangkuk itu pecah, menyebabkan makanan bertaburan. Rasulullah (ﷺ) mengumpulkan kepingan-kepingan dan makanan di atas alas kulit dan mereka makan. Kemudian baginda meminta mangkukku dan memberikannya kepada Hafsah, dan berkata: “Ambillah bekas ini sebagai ganti bekasmu, dan makanlah apa yang ada di dalamnya.” Dan aku tidak melihat sebarang riak kemarahan di wajah Rasulullah (ﷺ).'",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا شَرِيكُ بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ قَيْسِ بْنِ وَهْبٍ، ‏‏‏‏‏‏عَنْ رَجُلٍ مِنْ بَنِي سُوءَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ لِعَائِشَةَ:‏‏‏‏ أَخْبِرِينِي عَنْ خُلُقِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ أَوَ مَا تَقْرَأُ الْقُرْآنَ وَإِنَّكَ لَعَلَى خُلُقٍ عَظِيمٍ سورة القلم آية 4 قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَ أَصْحَابِهِ فَصَنَعْتُ لَهُ طَعَامًا وَصَنَعَتْ لَهُ حَفْصَةُ طَعَامًا، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ فَسَبَقَتْنِي حَفْصَةُ، ‏‏‏‏‏‏فَقُلْتُ لِلْجَارِيَةِ:‏‏‏‏ انْطَلِقِي فَأَكْفِئِي قَصْعَتَهَا فَلَحِقَتْهَا وَقَدْ هَمَّتْ أَنْ تَضَعَ بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَكْفَأَتْهَا فَانْكَسَرَتِ الْقَصْعَةُ وَانْتَشَرَ الطَّعَامُ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ فَجَمَعَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا فِيهَا مِنَ الطَّعَامِ عَلَى النِّطَعِ فَأَكَلُوا ثُمَّ بَعَثَ بِقَصْعَتِي فَدَفَعَهَا إِلَى حَفْصَةَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ خُذُوا ظَرْفًا مَكَانَ ظَرْفِكُمْ وَكُلُوا مَا فِيهَا ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ فَمَا رَأَيْتُ ذَلِكَ فِي وَجْهِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 26688,
        "hadith_number": "2334",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kisah Cemburu Isteri dan Ketabahan Nabi (ﷺ)",
        "perawi_melayu": "Anas bin Malik (Semoga Allah meredhainya)",
        "english_text": "It was narrated that Anas bin Malik said: “The Prophet (ﷺ) was with one of the Mothers of the Believers (his wives) and another (wife) sent a bowl containing food. She (the first wife) struck the hand of the Messenger of (ﷺ) and the bowl fell and broke. The Messenger of Allah (ﷺ) took the two pieces and put them back together, then he started gathering up the food and putting it in (the bowl). He said: 'Your mother was jealous. Eat.' So they ate, and she (the wife who broke the bowl) brought the bowl that was in her house and gave the intact bowl to the Messenger (ﷺ), who left the broken bowl in the house of the one who broke it.”",
        "malay_translation": "Diriwayatkan daripada Anas bin Malik (semoga Allah meredhainya) berkata: “Nabi (ﷺ) sedang bersama salah seorang daripada Ummahatul Mukminin (isteri-isteri baginda), dan seorang lagi (isteri) menghantar sebuah mangkuk berisi makanan. Isteri yang pertama memukul tangan Rasulullah (ﷺ) dan mangkuk itu terjatuh lalu pecah. Rasulullah (ﷺ) mengambil dua serpihan mangkuk tersebut lalu menyatukannya semula, kemudian baginda mula mengumpulkan makanan dan memasukkannya ke dalam (mangkuk). Baginda bersabda: 'Ibumu sedang cemburu. Makanlah.' Lalu mereka pun makan, dan isteri yang memecahkan mangkuk itu membawa mangkuk yang ada di rumahnya dan memberikan mangkuk yang tidak pecah kepada Rasulullah (ﷺ), yang meninggalkan mangkuk yang pecah itu di rumah orang yang memecahkannya.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، ‏‏‏‏‏‏حَدَّثَنَا حُمَيْدٌ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ إِحْدَى أُمَّهَاتِ الْمُؤْمِنِينَ فَأَرْسَلَتْ أُخْرَى بِقَصْعَةٍ فِيهَا طَعَامٌ فَضَرَبَتْ يَدَ الرَّسُولِ فَسَقَطَتِ الْقَصْعَةُ فَانْكَسَرَتْ، ‏‏‏‏‏‏فَأَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْكِسْرَتَيْنِ فَضَمَّ إِحْدَاهُمَا إِلَى الْأُخْرَى فَجَعَلَ يَجْمَعُ فِيهَا الطَّعَامَ وَيَقُولُ:‏‏‏‏ غَارَتْ أُمُّكُمْ كُلُوا ، ‏‏‏‏‏‏فَأَكَلُوا حَتَّى جَاءَتْ بِقَصْعَتِهَا الَّتِي فِي بَيْتِهَا فَدَفَعَ الْقَصْعَةَ الصَّحِيحَةَ إِلَى الرَّسُولِ وَتَرَكَ الْمَكْسُورَةَ فِي بَيْتِ الَّتِي كَسَرَتْهَا."
      },
      {
        "id": 26689,
        "hadith_number": "2335",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hutang Budi Membenarkan Kayu Pada Dinding Jiran",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "It was narrated that Anas bin Malik said: “The Prophet (ﷺ): 'When anyone of you asks his neighbor for permission to fix a piece of wood to his wall, he should not refuse him. 'When Abu Hurairah told them this, they lowered their heads, and when he saw them he said: 'Why do I see you turning away from it? By Allah, I will force you to accept it.' ”",
        "malay_translation": "Diriwayatkan daripada Anas bin Malik, beliau berkata: “Rasulullah (ﷺ) bersabda: 'Apabila seseorang daripada kamu meminta izin daripada jirannya untuk memasang sepotong kayu pada dindingnya, maka janganlah dia menghalanginya.' Apabila Abu Hurairah menceritakan perkara ini kepada mereka, mereka menundukkan kepala, dan apabila beliau melihat mereka, beliau berkata: 'Mengapa aku melihat kamu berpaling daripadanya? Demi Allah, aku akan memaksa kamu menerimanya.'",
        "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ الصَّبَّاحِ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ أَبَا هُرَيْرَةَ يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِذَا اسْتَأْذَنَ أَحَدَكُمْ جَارُهُ أَنْ يَغْرِزَ خَشَبَةً فِي جِدَارِهِ فَلَا يَمْنَعْهُ ، ‏‏‏‏‏‏فَلَمَّا حَدَّثَهُمْ أَبُو هُرَيْرَةَ طَأْطَئُوا رُءُوسَهُمْ فَلَمَّا رَآهُمْ قَالَ:‏‏‏‏ مَا لِي أَرَاكُمْ عَنْهَا مُعْرِضِينَ وَاللَّهِ لَأَرْمِيَنَّ بِهَا بَيْنَ أَكْتَافِكُمْ."
      },
      {
        "id": 26690,
        "hadith_number": "2336",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Menghalang Jiran Memasang Kayu di Dinding",
        "perawi_melayu": "Ikrimah bin Salamah",
        "english_text": "Ikrimah bin Salamh narrated that : there were two brothers from among the sons of Mughirah. One of them swore an oath to set a slave free if the other one fixed a piece of wood to his wall. Mujammi' bin Yazid and many men from among the Ansar came and said: “We bear witness that the Messenger of Allah (ﷺ) said: 'None of you should refuse to let his neighbor fix a piece of wood to his wall.' ” He said: 'O my brother, judgment has been passed in your favor against me, but I have sworn an oath.' So go ahead and fix your wood to my wall.”",
        "malay_translation": "Diriwayatkan oleh Ikrimah bin Salamah: Terdapat dua orang saudara lelaki dari kalangan anak-anak Mughirah. Salah seorang daripada mereka bersumpah untuk membebaskan seorang hamba jika saudaranya memasang sekeping kayu di dindingnya. Mujammi' bin Yazid dan ramai lelaki dari kalangan Ansar datang dan berkata: “Kami bersaksi bahawa Rasulullah (ﷺ) bersabda: 'Janganlah salah seorang daripada kamu menghalang jirannya daripada memasang sekeping kayu di dindingnya.' ” Lelaki itu berkata: 'Wahai saudaraku, keputusan telah dibuat memihak kepadamu, tetapi aku telah bersumpah.' Oleh itu, silalah pasang kayu anda di dindingku.”",
        "arabic_text": "حَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو عَاصِمٍ، ‏‏‏‏‏‏عَنِ ابْنِ جُرَيْجٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ دِينَارٍ، ‏‏‏‏‏‏أَنَّ هِشَامَ بْنَ يَحْيَىأَخْبَرَهُ، ‏‏‏‏‏‏أَنَّ عِكْرِمَةَ بْنَ سَلَمَةَ أَخْبَرَهُ، ‏‏‏‏‏‏أَنَّ أَخَوَيْنِ مِنْ بَلْمُغِيرَةِ أَعْتَقَ أَحَدَهُمَا أَنْ لَا يَغْرِزَ خَشَبًا فِي جِدَارِهِ، ‏‏‏‏‏‏فَأَقْبَلَمُجَمِّعُ بْنُ يَزِيدَ وَرِجَالٌ كَثِيرٌ مِنَ الْأَنْصَارِ، ‏‏‏‏‏‏فَقَالُوا:‏‏‏‏ نَشْهَدُ أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا يَمْنَعْ أَحَدُكُمْ جَارَهُ أَنْ يَغْرِزَ خَشَبَةً فِي جِدَارِهِ . فَقَالَ:‏‏‏‏ يَا أَخِي إِنَّكَ مَقْضِيٌّ لَكَ عَلَيَّ وَقَدْ حَلَفْتُ فَاجْعَلْ أُسْطُوَانًا دُونَ حَائِطِي أَوْ جِدَارِي فَاجْعَلْ عَلَيْهِ خَشَبَكَ."
      },
      {
        "id": 26691,
        "hadith_number": "2337",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Tidak Boleh Menghalang Jiran Memasang Kayu di Dinding",
        "perawi_melayu": "Daripada Ibn 'Abbas",
        "english_text": "It was narrated from Ibn 'Abbas that the Prophet (ﷺ) said: “No one of you should refuse to let his neighbor fix a piece of wood to his wall.”",
        "malay_translation": "Diriwayatkan daripada Ibn 'Abbas bahawa Nabi (ﷺ) bersabda: “Janganlah salah seorang daripada kamu enggan membenarkan jirannya memasang sepotong kayu di dindingnya.”",
        "arabic_text": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، ‏‏‏‏‏‏أَخْبَرَنِي ابْنُ لَهِيعَةَ، ‏‏‏‏‏‏عَنْ أَبِي الْأَسْوَدِ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا يَمْنَعْ أَحَدُكُمْ جَارَهُ أَنْ يَغْرِزَ خَشَبَةً عَلَى جِدَارِهِ ."
      },
      {
        "id": 26692,
        "hadith_number": "2338",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Lebarkan Laluan: Tujuh Hasta",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه)",
        "english_text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: “Make the path seven forearms length wide.”",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah (رضي الله عنه) bahawa Rasulullah (ﷺ) bersabda: “Luaskanlah laluan itu selebar tujuh hasta.”",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏حَدَّثَنَا مُثَنَّى بْنُ سَعِيدٍ الضُّبَعِيُّ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ بُشَيْرِ بْنِ كَعْبٍ، ‏‏‏‏‏‏عَنْأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اجْعَلُوا الطَّرِيقَ سَبْعَةَ أَذْرُعٍ ."
      },
      {
        "id": 26693,
        "hadith_number": "2339",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Lebar Jalan: Tujuh Hasta",
        "perawi_melayu": "Daripada Ibn 'Abbas",
        "english_text": "It was narrated from Ibn 'Abbas that the Messenger of Allah (ﷺ) said: “When you dispute concerning a path, make it seven forearms length wide.' ”",
        "malay_translation": "Diriwayatkan daripada Ibn 'Abbas bahawa Rasulullah (ﷺ) bersabda: \"Apabila kamu berselisih tentang jalan, jadikanlah lebarnya tujuh hasta.\" ",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ عُمَرَ بْنِ هَيَّاجٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا قَبِيصَةُ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ سِمَاكٍ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا اخْتَلَفْتُمْ فِي الطَّرِيقِ فَاجْعَلُوهُ سَبْعَةَ أَذْرُعٍ ."
      },
      {
        "id": 26694,
        "hadith_number": "2340",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Memudaratkan dan Membalas Kemudaratan",
        "perawi_melayu": "'Ubadah bin Samit (Semoga Allah meredhainya)",
        "english_text": "It was narrated from 'Ubadah bin Samit that the Messenger of Allah (ﷺ) ruled: “There should be neither harming nor reciprocating harm.”",
        "malay_translation": "Diriwayatkan daripada 'Ubadah bin Samit bahawa Rasulullah (ﷺ) telah memutuskan: “Tidak boleh memudaratkan dan tidak boleh membalas kemudaratan.”",
        "arabic_text": "حَدَّثَنَا عَبْدُ رَبِّهِ بْنُ خَالِدٍ النُّمَيْرِيُّ أَبُو الْمُغَلِّسِ، ‏‏‏‏‏‏حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، ‏‏‏‏‏‏حَدَّثَنَاإِسْحَاق بْنُ يَحْيَى بْنِ الْوَلِيدِ، ‏‏‏‏‏‏عَنْ عُبَادَةَ بْنِ الصَّامِتِ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى أَنْ:‏‏‏‏ لَا ضَرَرَ وَلَا ضِرَارَ ."
      },
      {
        "id": 26695,
        "hadith_number": "2341",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Memudaratkan Diri Sendiri dan Orang Lain",
        "perawi_melayu": "Daripada Ibn 'Abbas رضي الله عنه",
        "english_text": "It was narrated from Ibn 'Abbas that the Messenger of Allah (ﷺ) said: “There should be neither harming nor reciprocating harm.”",
        "malay_translation": "Diriwayatkan daripada Ibn 'Abbas رضي الله عنه bahawa Rasulullah ﷺ bersabda: “Tidak boleh memudaratkan diri sendiri dan tidak boleh membalas dengan memudaratkan orang lain.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَنْبَأَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنْ جَابِرٍ الْجُعْفِيِّ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا ضَرَرَ وَلَا ضِرَارَ ."
      },
      {
        "id": 26696,
        "hadith_number": "2342",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Balasan Bagi Mereka yang Memudaratkan dan Menyusahkan Orang Lain",
        "perawi_melayu": "Abu Sirmah (رضي الله عنه)",
        "english_text": "It was narrated from Abu Sirmah that the Messenger of Allah (ﷺ) said: “Whoever harms others, Allah (SWT) will harm him; and whoever causes hardship to other Allah will cause hardship to him.”",
        "malay_translation": "Diriwayatkan daripada Abu Sirmah (رضي الله عنه) bahawa Rasulullah (ﷺ) bersabda: “Sesiapa yang memudaratkan orang lain, Allah (SWT) akan memudaratkannya; dan sesiapa yang menyusahkan orang lain, Allah akan menyusahkannya.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، ‏‏‏‏‏‏أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، ‏‏‏‏‏‏عَنْ لُؤْلُؤَةَ، ‏‏‏‏‏‏عَنْأَبِي صِرْمَةَ، ‏‏‏‏‏‏عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ ضَارَّ أَضَرَّ اللَّهُ بِهِ وَمَنْ شَاقَّ شَقَّ اللَّهُ عَلَيْهِ ."
      },
      {
        "id": 26697,
        "hadith_number": "2343",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Penghakiman Nabi (ﷺ) Berkaitan Sebuah Pondok",
        "perawi_melayu": "Nimran bin Jariyah daripada bapanya",
        "english_text": "It was narrated from Nimran bin Jariyah, from his father, that : some people referred a dispute to the Prophet (ﷺ) about a hut, so that he could judge between them. He sent Hudhaifah to judge between them, and he ruled in favor of those who had the rope (with which the hut was blinded together). When he went back to the Prophet (ﷺ) he told him (what he had done) and he said: “You did the right thing, and you did well.”",
        "malay_translation": "Diriwayatkan daripada Nimran bin Jariyah, daripada bapanya, bahawa: beberapa orang merujuk satu pertikaian kepada Nabi (ﷺ) tentang sebuah pondok, supaya baginda dapat menghakimi antara mereka. Baginda mengutus Hudzaifah untuk menghakimi antara mereka, dan Hudzaifah memutuskan memihak kepada mereka yang mempunyai tali (yang digunakan untuk mengikat pondok tersebut). Apabila Hudzaifah kembali kepada Nabi (ﷺ), dia memberitahu baginda (apa yang telah dilakukannya) dan baginda bersabda: “Kamu telah melakukan perkara yang betul, dan kamu telah melakukan dengan baik.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، ‏‏‏‏‏‏ وَعَمَّارُ بْنُ خَالِدٍ الْوَاسِطِيُّ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، ‏‏‏‏‏‏عَنْ دَهْثَمِ بْنِ قُرَّانٍ، ‏‏‏‏‏‏عَنْنِمْرَانَ بْنِ جَارِيَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏أَنَّ قَوْمًا اخْتَصَمُوا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي خُصٍّ كَانَ بَيْنَهُمْ فَبَعَثَ حُذَيْفَةَ يَقْضِي بَيْنَهُمْ فَقَضَى لِلَّذِينَ يَلِيهِمُ الْقِمْطُ فَلَمَّا رَجَعَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَهُ فَقَالَ:‏‏‏‏ أَصَبْتَ وَأَحْسَنْتَ ."
      },
      {
        "id": 26698,
        "hadith_number": "2344",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Jualan Barang kepada Dua Orang",
        "perawi_melayu": "(Daripada 'Uqbah bin 'Amir atau) Samurah bin Jundub",
        "english_text": "It was narrated from ('Uqbah bin 'Amir or) Samurah bin Jundub that : the Messenger of Allah (ﷺ) said: “If a product is sold to two men, it is for the one who was first.”",
        "malay_translation": "Diriwayatkan daripada ('Uqbah bin 'Amir atau) Samurah bin Jundub bahawa: Rasulullah (ﷺ) bersabda: \"Jika sesuatu produk dijual kepada dua orang, maka ia adalah hak orang yang pertama.\"",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو الْوَلِيدِ، ‏‏‏‏‏‏حَدَّثَنَا هَمَّامٌ، ‏‏‏‏‏‏عَنْ قتَادَةَ، ‏‏‏‏‏‏عَنِ الْحَسَنِ، ‏‏‏‏‏‏عَنْ سَمُرَةَ بْنِ جُنْدَبٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِذَا بِيعَ الْبَيْعُ مِنْ رَجُلَيْنِ فَالْبَيْعُ لِلْأَوَّلِ ، ‏‏‏‏‏‏قَالَ أَبُو الْوَلِيدِ فِي هَذَا الْحَدِيثِ:‏‏‏‏ إِبْطَالُ الْخَلَاصِ."
      },
      {
        "id": 26699,
        "hadith_number": "2345",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Pembahagian Hamba Selepas Kematian",
        "perawi_melayu": "'Imran bin Husain",
        "english_text": "It was narrated from 'Imran bin Husain that : a man had six slaves, and he did not have any other wealth apart from them, and he set them free when he died. The Messenger of Allah (ﷺ) divided them into groups, set two free and left four as slaves.",
        "malay_translation": "Diriwayatkan daripada 'Imran bin Husain bahawa: Seorang lelaki mempunyai enam orang hamba, dan dia tidak mempunyai harta lain selain mereka, dan dia membebaskan mereka ketika dia meninggal dunia. Rasulullah (ﷺ) membahagikan mereka kepada beberapa kumpulan, membebaskan dua orang dan meninggalkan empat orang sebagai hamba.",
        "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا عَبْدُ الْأَعْلَى، ‏‏‏‏‏‏حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، ‏‏‏‏‏‏عَنْ أَبِي قِلَابَةَ، ‏‏‏‏‏‏عَنْ أَبِي الْمُهَلَّبِ، ‏‏‏‏‏‏عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، ‏‏‏‏‏‏ أَنَّ رَجُلًا كَانَ لَهُ سِتَّةُ مَمْلُوكِينَ لَيْسَ لَهُ مَالٌ غَيْرُهُمْ فَأَعْتَقَهُمْ عِنْدَ مَوْتِهِ فَجَزَّأَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَعْتَقَ اثْنَيْنِ وَأَرَقَّ أَرْبَعَةً ."
      },
      {
        "id": 26700,
        "hadith_number": "2346",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Undian untuk Sumpah dalam Pertikaian Jual Beli",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "It was narrated from Abu Hurairah that : two men disputed concerning a transaction, and neither of them had proof. The Messenger of Allah commanded them to draw lots as to which of them should swear an oath, whether they liked it or not.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah bahawa: dua orang lelaki bertelingkah mengenai satu urusan jual beli, dan tiada seorang pun daripada mereka mempunyai bukti. Rasulullah ﷺ memerintahkan mereka supaya mengundi untuk menentukan siapa di antara mereka yang perlu bersumpah, sama ada mereka suka atau tidak.",
        "arabic_text": "حَدَّثَنَا جَمِيلُ بْنُ الْحَسَنِ الْعَتَكِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْأَعْلَى، ‏‏‏‏‏‏حَدَّثَنَا سَعِيدٌ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ خِلَاسٍ، ‏‏‏‏‏‏عَنْ أَبِي رَافِعٍ، ‏‏‏‏‏‏عَنْأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏ أَنَّ رَجُلَيْنِ تَدَارَءَا فِي بَيْعٍ لَيْسَ لِوَاحِدٍ مِنْهُمَا بَيِّنَةٌ فَأَمَرَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَسْتَهِمَا عَلَى الْيَمِينِ أَحَبَّا ذَلِكَ أَمْ كَرِهَا ."
      },
      {
        "id": 26701,
        "hadith_number": "2347",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Undian Nabi (ﷺ) dalam Perjalanan",
        "perawi_melayu": "Aishah (رَضِيَ اللَّهُ عَنْهَا)",
        "english_text": "It was narrated from 'Aishah that : when the Prophet (ﷺ) traveled, he would cast lots among his wives (to decide which one would accompany him).",
        "malay_translation": "Diriwayatkan daripada Aishah (رَضِيَ اللَّهُ عَنْهَا): Apabila Nabi (ﷺ) bermusafir, baginda akan membuat undian di kalangan isteri-isterinya (untuk menentukan siapa yang akan menemani baginda).",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ يَمَانٍ، ‏‏‏‏‏‏عَنْ مَعْمَرٍ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَافَرَ أَقْرَعَ بَيْنَ نِسَائِهِ ."
      },
      {
        "id": 26702,
        "hadith_number": "2348",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Keputusan 'Ali bin Abi Talib tentang kes tiga lelaki dan seorang wanita",
        "perawi_melayu": "Zaid bin Arqam",
        "english_text": "It was narrated that Zaid bin Arqam said: “A case was brought to 'Ali bin Abu Talib when he was in Yemen, concerning three men who had intercourse with a woman during one period of being free from menses. He asked two of them: “Do you affirm that this child belongs to (the third man)?” And they said: “No.” He asked another two of them: “Do you affirm that this child belongs to (the third man)?” And they said: “No.” Every time he asked two of them whether they affirmed that the child belonged to the third, they would say no. So he cast lots between them, and attributed the child to the one whose name was chosen in this manner, and obliged him to pay two thirds of the Diyah. The Prophet (ﷺ) was told of this, and he smiled so broadly that his back teeth became visible.",
        "malay_translation": "Diriwayatkan daripada Zaid bin Arqam, beliau berkata: “Satu kes telah dibawa kepada 'Ali bin Abu Talib ketika beliau berada di Yaman, mengenai tiga orang lelaki yang telah melakukan persetubuhan dengan seorang wanita dalam satu tempoh suci (bebas daripada haid). Beliau bertanya kepada dua daripada mereka: “Adakah kamu mengesahkan bahawa anak ini adalah daripada (lelaki ketiga)?” Mereka menjawab: “Tidak.” Beliau bertanya kepada dua orang yang lain: “Adakah kamu mengesahkan bahawa anak ini adalah daripada (lelaki ketiga)?” Mereka menjawab: “Tidak.” Setiap kali beliau bertanya kepada dua daripada mereka sama ada mereka mengesahkan bahawa anak itu daripada lelaki ketiga, mereka akan menjawab tidak. Lalu beliau melakukan undian di antara mereka, dan mengaitkan anak itu kepada orang yang namanya terpilih dalam cara ini, dan mewajibkan dia membayar dua pertiga daripada Diyah. Perkara ini diberitahu kepada Nabi (ﷺ), dan Baginda tersenyum begitu lebar sehingga gigi gerahamnya kelihatan.",
        "arabic_text": "حَدَّثَنَا إِسْحَاق بْنُ مَنْصُورٍ، ‏‏‏‏‏‏أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَنْبَأَنَا الثَّوْرِيُّ، ‏‏‏‏‏‏عَنْ صَالِحٍ الْهَمْدَانِيِّ، ‏‏‏‏‏‏عَنِ الشَّعْبِيِّ، ‏‏‏‏‏‏عَنْ عَبْدِ خَيْرٍ الْحَضْرَمِيِّ، ‏‏‏‏‏‏عَنْ زَيْدِ بْنِ أَرْقَمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أُتِيَ عَلِيُّ بْنُ أَبِي طَالِبٍ وَهُوَ بِالْيَمَنِ فِي ثَلَاثَةٍ قَدْ وَقَعُوا عَلَى امْرَأَةٍ فِي طُهْرٍ وَاحِدٍ فَسَأَلَ اثْنَيْنِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَتُقِرَّانِ لِهَذَا بِالْوَلَدِ؟ فَقَالَا:‏‏‏‏ لَا، ‏‏‏‏‏‏ثُمَّ سَأَلَ اثْنَيْنِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَتُقِرَّانِ لِهَذَا بِالْوَلَدِ؟ فَقَالَا:‏‏‏‏ لَا، ‏‏‏‏‏‏فَجَعَلَ كُلَّمَا سَأَلَ اثْنَيْنِ أَتُقِرَّانِ لِهَذَا بِالْوَلَدِ؟ قَالَا:‏‏‏‏ لَا، ‏‏‏‏‏‏فَأَقْرَعَ بَيْنَهُمْ وَأَلْحَقَ الْوَلَدَ بِالَّذِي أَصَابَتْهُ الْقُرْعَةُ، ‏‏‏‏‏‏وَجَعَلَ عَلَيْهِ ثُلُثَيِ الدِّيَةِ فَذُكِرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ ."
      },
      {
        "id": 26703,
        "hadith_number": "2349",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kisah Usamah dan Zaid: Pengakuan Mujazziz Al-Mudliji",
        "perawi_melayu": "'Aishah (R.A.)",
        "english_text": "It was narrated that 'Aishah said: “The Messenger of Allah (ﷺ) came in one day looking happy, and said: 'O 'Aishah, did you not see that Mujazziz Al-Mudliji entered upon me and saw Usamah and Zaid. There was a blanket over them and their faces were covered but their feet were exposed, and he said: 'These feet belong to one another'.”",
        "malay_translation": "Diriwayatkan bahawa 'Aishah berkata: “Rasulullah (ﷺ) datang pada suatu hari dalam keadaan gembira, lalu bersabda: 'Wahai 'Aishah, tidakkah kamu melihat bahawa Mujazziz Al-Mudliji telah masuk menemuiku dan melihat Usamah dan Zaid. Terdapat selimut di atas mereka dan wajah mereka ditutupi tetapi kaki mereka terdedah, lalu dia berkata: 'Kaki-kaki ini adalah daripada satu sama lain'.”",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏ وَهِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ الصَّبَّاحِ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنِالزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ دَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ مَسْرُورًا وَهُوَ يَقُولُ:‏‏‏‏ يَا عَائِشَةُ، ‏‏‏‏‏‏ أَلَمْ تَرَيْ أَنَّ مُجَزِّزًا الْمُدْلِجِيَّ دَخَلَ عَلَيَّ فَرَأَى أُسَامَةَ وَزَيْدًا عَلَيْهِمَا قَطِيفَةٌ قَدْ غَطَّيَا رُءُوسَهُمَا وَقَدْ بَدَتْ أَقْدَامُهُمَا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنَّ هَذِهِ الْأَقْدَامَ بَعْضُهَا مِنْ بَعْضٍ ."
      },
      {
        "id": 26704,
        "hadith_number": "2350",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Tanda-tanda Kenabian: Tapak Kaki Nabi Muhammad (ﷺ)",
        "perawi_melayu": "Daripada Ibnu 'Abbas",
        "english_text": "It was narrated from Ibn 'Abbas that : the Quraish went to a sorceress and they said to her: “Tell us whose footprints most resemble those of the owner of Al-Maqam (the station of Ibrahim).” She said: “If you spread a piece of cloth over this soft earth and walk over it, I will tell you.” So they spread out a piece of cloth and the people walked over it. She saw the footprints of the Messenger of Allah (ﷺ) and said: “This one most closely resembles him among you.” After that twenty years passed, of as long as Allah willed, then Allah sent Muhammad (ﷺ) (i.e., missioned him as the Prophet).",
        "malay_translation": "Diriwayatkan daripada Ibnu 'Abbas bahawa: Kaum Quraisy pergi kepada seorang ahli sihir dan mereka berkata kepadanya: “Beritahu kami, siapakah yang tapak kakinya paling menyerupai pemilik Al-Maqam (Makam Ibrahim)?” Dia berkata: “Jika kamu membentangkan sehelai kain di atas tanah yang lembut ini dan berjalan di atasnya, saya akan beritahu kamu.” Lalu mereka membentangkan sehelai kain dan orang ramai berjalan di atasnya. Dia melihat tapak kaki Rasulullah (ﷺ) dan berkata: “Orang ini yang paling menyerupainya di antara kamu.” Selepas itu, berlalu dua puluh tahun, atau selama mana yang Allah kehendaki, kemudian Allah mengutus Muhammad (ﷺ) (iaitu melantiknya sebagai Nabi).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، ‏‏‏‏‏‏حَدَّثَنَا إِسْرَائِيلُ، ‏‏‏‏‏‏حَدَّثَنَا سِمَاكُ بْنُ حَرْبٍ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏أَنَّ قُرَيْشًا أَتَوْا امْرَأَةً كَاهِنَةً فَقَالُوا لَهَا:‏‏‏‏ أَخْبِرِينَا أَشْبَهَنَا أَثَرًا بِصَاحِبِ الْمَقَامِ، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ إِنْ أَنْتُمْ جَرَرْتُمْ كِسَاءً عَلَى هَذِهِ السِّهْلَةِ ثُمَّ مَشَيْتُمْ عَلَيْهَا أَنْبَأْتُكُمْ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَجَرُّوا كِسَاءً ثُمَّ مَشَى النَّاسُ عَلَيْهَا فَأَبْصَرَتْ أَثَرَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ:‏‏‏‏ هَذَا أَقْرَبُكُمْ إِلَيْهِ شَبَهًا ثُمَّ مَكَثُوا بَعْدَ ذَلِكَ عِشْرِينَ سَنَةً أَوْ مَا شَاءَ اللَّهُ ثُمَّ بَعَثَ اللَّهُ مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ."
      },
      {
        "id": 26705,
        "hadith_number": "2351",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Nabi (ﷺ) Memilihkan Kanak-kanak antara Ibu Bapa",
        "perawi_melayu": "Abu Hurairah (Semoga Allah meredhainya)",
        "english_text": "It was narrated from Abu Hurairah that : the Prophet (ﷺ) gave a child the choice between his father and his mother (i.e., which parent to live with). He said: “O boy, this is your mother and this is your father.”",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah (semoga Allah meredhainya), bahawa Nabi (ﷺ) memberi pilihan kepada seorang kanak-kanak antara bapanya dan ibunya (iaitu, dengan ibu bapa yang mana dia akan tinggal). Baginda bersabda: “Wahai anak, ini ibumu dan ini bapamu.”",
        "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ زِيَادِ بْنِ سَعْدٍ، ‏‏‏‏‏‏عَنْ هِلَالِ بْنِ أَبِي مَيْمُونَةَ، ‏‏‏‏‏‏عَنْ أَبِي مَيْمُونَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيَّرَ غُلَامًا بَيْنَ أَبِيهِ وَأُمِّهِ وَقَالَ:‏‏‏‏ يَا غُلَامُ هَذِهِ أُمُّكَ وَهَذَا أَبُوكَ ."
      },
      {
        "id": 26706,
        "hadith_number": "2352",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Nabi ﷺ Meminta Petunjuk Allah untuk Ibu Bapa yang Berbeza Agama",
        "perawi_melayu": "Daripada 'Abdul-Hamid bin Salamah, daripada bapanya, daripada datuknya",
        "english_text": "It was narrated from 'Abdul-Hamid bin Salamah, from his father, from his grandfather, that : his parents referred their dispute to the Prophet (ﷺ), and one of them was a disbeliever. He (the Prophet (ﷺ)) said: “O Allah, guide him,” and he turned towards the Muslim, and he ruled that he should go with that parent.",
        "malay_translation": "Diriwayatkan daripada 'Abdul-Hamid bin Salamah, daripada bapanya, daripada datuknya, bahawa: kedua ibu bapanya mengemukakan perselisihan mereka kepada Nabi ﷺ, dan salah seorang daripada mereka adalah seorang kafir. Baginda (Nabi ﷺ) bersabda: “Ya Allah, berilah petunjuk kepadanya,” dan baginda berpaling kepada orang Islam, dan baginda memutuskan bahawa dia harus pergi bersama ibu bapa itu.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا إِسْمَاعِيل ابْنُ عُلَيَّةَ، ‏‏‏‏‏‏عَنْ عُثْمَانَ الْبَتِّيِّ، ‏‏‏‏‏‏عَنْ عَبْدِ الْحَمِيدِ بْنِ سَلَمَةَ، ‏‏‏‏‏‏عَنْأَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏أَنَّ أَبَوَيْهِ اخْتَصَمَا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَدُهُمَا كَافِرٌ وَالْآخَرُ مُسْلِمٌ، ‏‏‏‏‏‏فَخَيَّرَهُ فَتَوَجَّهَ إِلَى الْكَافِرِ فَقَالَ:‏‏‏‏ اللَّهُمَّ اهْدِهِ . فَتَوَجَّهَ إِلَى الْمُسْلِمِ فَقَضَى لَهُ بِهِ."
      },
      {
        "id": 26707,
        "hadith_number": "2353",
        "status": "Sahih (Sahih)",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Perdamaian Dibenarkan Kecuali yang Mengharamkan atau Menghalalkan yang Haram",
        "perawi_melayu": "Kathir bin 'Abdullah bin 'Amr bin 'Awf meriwayatkan daripada bapanya bahawa datuknya berkata:",
        "english_text": "Kathir bin 'Abdullah bin 'Amr bin 'Awf narrated from his father that his grandfather said: “I heard the Messenger of Allah (ﷺ) say: 'Reconciling between Muslims is permissible, except reconciliation that forbids something that is allowed, or allows something that is forbidden.'”",
        "malay_translation": "Kathir bin 'Abdullah bin 'Amr bin 'Awf meriwayatkan daripada bapanya bahawa datuknya berkata: \"Aku mendengar Rasulullah (ﷺ) bersabda: 'Perdamaian antara orang Islam adalah dibolehkan, kecuali perdamaian yang mengharamkan sesuatu yang halal, atau menghalalkan sesuatu yang haram.'\"",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، ‏‏‏‏‏‏حَدَّثَنَا كَثِيرُ بْنُ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عَوْفٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ الصُّلْحُ جَائِزٌ بَيْنَ الْمُسْلِمِينَ إِلَّا صُلْحًا حَرَّمَ حَلَالًا أَوْ أَحَلَّ حَرَامًا ."
      },
      {
        "id": 26708,
        "hadith_number": "2354",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Nasihat Nabi (ﷺ) kepada Seorang Lelaki yang Kurang Waras Semasa Berniaga",
        "perawi_melayu": "Anas bin Malik (Semoga Allah meredhainya)",
        "english_text": "It was narrated from Anas bin Malik that : there was a man at the time of the Messenger of Allah (ﷺ) whose mental faculties were lacking, and he used to buy and sell. His family came to the Prophet (ﷺ) and said, “O Messenger of Allah, stop him.” So The Prophet (ﷺ) called him, and told him not to do that. He said: “O Messenger of Allah (ﷺ), I cannot bear to be away from business.” He said, “If you engage in a transaction then say: “Take it (i.e., the goods) and don't cheat (me).' ”",
        "malay_translation": "Diriwayatkan daripada Anas bin Malik (Semoga Allah meredhainya) bahawa: Terdapat seorang lelaki pada zaman Rasulullah (ﷺ) yang kurang waras, dan dia biasa membeli dan menjual. Keluarga lelaki tersebut datang kepada Nabi (ﷺ) dan berkata, “Wahai Rasulullah, cegahlah dia.” Maka Nabi (ﷺ) memanggilnya, dan melarangnya daripada berbuat demikian. Lelaki itu berkata: “Wahai Rasulullah (ﷺ), saya tidak dapat menahan diri daripada perniagaan.” Baginda bersabda: “Jika kamu terlibat dalam urusan jual beli, maka katakan: ‘Ambillah (iaitu, barang-barang) dan jangan menipu (saya).'”",
        "arabic_text": "حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْأَعْلَى، ‏‏‏‏‏‏حَدَّثَنَا سَعِيدٌ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏أَنَّ رَجُلًا كَانَ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي عُقْدَتِهِ ضَعْفٌ، ‏‏‏‏‏‏وَكَانَ يُبَايِعُ وَأَنَّ أَهْلَهُ أَتَوْا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا:‏‏‏‏ يَا رَسُولَ اللَّهِ احْجُرْ عَلَيْهِ فَدَعَاهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَهَاهُ عَنْ ذَلِكَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ إِنِّي لَا أَصْبِرُ عَنِ الْبَيْعِ، ‏‏‏‏‏‏فَقَال:‏‏‏‏ إِذَا بَايَعْتَ فَقُلْ هَا وَلَا خِلَابَةَ"
      },
      {
        "id": 26709,
        "hadith_number": "2355",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hak Memilih dalam Urusan Jual Beli",
        "perawi_melayu": "Muhammad bin Yahya bin Habban",
        "english_text": "It was narrated that Muhammad bin Yahya bin Habban said: “My grandfather was Munqidh bin 'Amr. He was a man who had suffered a head wound and lost the power of speech, but that did not stop him from engaging in trade. He was always being cheated, so he went to the Prophet (ﷺ) and told him about that. He said to him: 'When you buy something, say: “There should be no intention of cheating,” and for every product you buy, you have the choice for three nights. If you are pleased with it, keep it, and if you are displeased then return it.’”",
        "malay_translation": "Diriwayatkan bahawa Muhammad bin Yahya bin Habban berkata: \"Datuk saya ialah Munqidh bin 'Amr. Beliau adalah seorang lelaki yang mengalami kecederaan di kepala dan hilang keupayaan untuk bercakap, tetapi itu tidak menghalangnya daripada menjalankan perniagaan. Beliau sering ditipu, jadi beliau pergi kepada Nabi (ﷺ) dan menceritakan hal itu kepada baginda. Baginda bersabda kepadanya: 'Apabila kamu membeli sesuatu, katakanlah: 'Tidak ada niat untuk menipu', dan bagi setiap produk yang kamu beli, kamu mempunyai pilihan selama tiga malam. Jika kamu berpuas hati dengannya, simpanlah, dan jika kamu tidak berpuas hati, kembalikanlah kepada penjualnya.'\"",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْأَعْلَى، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ إِسْحَاق، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هُوَ جَدِّي مُنْقِذُ بْنُ عَمْرٍو وَكَانَ رَجُلًا قَدْ أَصَابَتْهُ آمَّةٌ فِي رَأْسِهِ فَكَسَرَتْ لِسَانَهُ، ‏‏‏‏‏‏وَكَانَ لَا يَدَعُ عَلَى ذَلِكَ التِّجَارَةَ، ‏‏‏‏‏‏وَكَانَ لَا يَزَالُ يُغْبَنُ فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ لَهُ:‏‏‏‏ إِذَا أَنْتَ بَايَعْتَ فَقُلْ لَا خِلَابَةَ، ‏‏‏‏‏‏ثُمَّ أَنْتَ فِي كُلِّ سِلْعَةٍ ابْتَعْتَهَا بِالْخِيَارِ ثَلَاثَ لَيَالٍ، ‏‏‏‏‏‏فَإِنْ رَضِيتَ فَأَمْسِكْ وَإِنْ سَخِطْتَ فَارْدُدْهَا عَلَى صَاحِبِهَا ."
      },
      {
        "id": 26710,
        "hadith_number": "2356",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Bantuan Kewangan kepada Mereka yang Mengalami Kerugian",
        "perawi_melayu": "Abu Sa'eed Al-Khudri",
        "english_text": "It was narrated that Abu Sa'eed Al-Khudri said: “At the time of the Messenger of Allah (ﷺ), a man suffered loss of some fruit that he had purchase, and his debts increased. The Messenger of Allah (ﷺ) said: 'Give him charity.' So the people gave him charity, but that was not enough to pay off his debts. The Messenger of Allah (ﷺ) said: “Take what you find, but you have no right to more than that, meaning his creditors.”",
        "malay_translation": "Diriwayatkan bahawa Abu Sa'eed Al-Khudri berkata: “Pada zaman Rasulullah (ﷺ), seorang lelaki mengalami kerugian ke atas beberapa buah-buahan yang dibelinya, dan hutangnya bertambah. Rasulullah (ﷺ) bersabda: 'Berilah dia sedekah.' Maka orang ramai bersedekah kepadanya, tetapi itu tidak mencukupi untuk membayar hutangnya. Rasulullah (ﷺ) bersabda: “Ambillah apa yang kamu dapati, tetapi kamu tidak berhak lebih daripada itu, maksudnya pemiutangnya.”",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا شَبَابَةُ، ‏‏‏‏‏‏حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ، ‏‏‏‏‏‏عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ، ‏‏‏‏‏‏عَنْعِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ سَعْدٍ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أُصِيبَ رَجُلٌ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ثِمَارٍ ابْتَاعَهَا فَكَثُرَ دَيْنُهُ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ تَصَدَّقُوا عَلَيْهِ ، ‏‏‏‏‏‏فَتَصَدَّقَ النَّاسُ عَلَيْهِ فَلَمْ يَبْلُغْ ذَلِكَ وَفَاءَ دَيْنِهِ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ خُذُوا مَا وَجَدْتُمْ وَلَيْسَ لَكُمْ إِلَّا ذَلِكَ يَعْنِي الْغُرَمَاءَ."
      },
      {
        "id": 26711,
        "hadith_number": "2357",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Rasulullah (ﷺ) Menyelesaikan Hutang Mu'adh bin Jabal dan Melantiknya sebagai Gabenor Yaman",
        "perawi_melayu": "Jabir bin 'Abdullah",
        "english_text": "It was narrated from Jabir bin 'Abdullah that : the Messenger of Allah (ﷺ) rid Mu'adh bin Jabal of his creditors, then he appointed him governor of Yemen. Mu'adh said: “The Messenger of Allah (ﷺ) settled my debts with my creditors using what wealth I had, then he appointed me as governor.”",
        "malay_translation": "Diriwayatkan daripada Jabir bin 'Abdullah bahawa: Rasulullah (ﷺ) melepaskan Mu'adh bin Jabal daripada para penghutangnya, kemudian Baginda melantiknya sebagai gabenor Yaman. Mu'adh berkata: “Rasulullah (ﷺ) menyelesaikan hutang-hutangku dengan para penghutangku menggunakan harta yang aku miliki, kemudian Baginda melantikku sebagai gabenor.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو عَاصِمٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُسْلِمِ بْنِ هُرْمُزٍ، ‏‏‏‏‏‏عَنْ سَلَمَةَ الْمَكِّيِّ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَلَعَ مُعَاذَ بْنَ جَبَلٍ مِنْ غُرَمَائِهِ ثُمَّ اسْتَعْمَلَهُ عَلَى الْيَمَنِ فَقَالَ مُعَاذٌ:‏‏‏‏ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَخْلَصَنِي بِمَالِي ثُمَّ اسْتَعْمَلَنِي ."
      },
      {
        "id": 26712,
        "hadith_number": "2358",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hak Pemilik Terhadap Hartanya yang Dijumpai Semula",
        "perawi_melayu": "Daripada Abu Hurairah",
        "english_text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: “Whoever finds his exact property with a man who has become bankrupt, and then he has more right to it than anyone else.”",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah bahawa Rasulullah (ﷺ) bersabda: “Sesiapa yang menjumpai hartanya yang sama di sisi seorang lelaki yang telah muflis, maka dia adalah lebih berhak terhadapnya daripada orang lain.”",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، ‏‏‏‏‏‏أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ جَمِيعًا، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، ‏‏‏‏‏‏عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ، ‏‏‏‏‏‏عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ وَجَدَ مَتَاعَهُ بِعَيْنِهِ عِنْدَ رَجُلٍ قَدْ أَفْلَسَ فَهُوَ أَحَقُّ بِهِ مِنْ غَيْرِهِ ."
      },
      {
        "id": 26713,
        "hadith_number": "2359",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hak Penjual Apabila Pembeli Muflis",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said: “Any man who sells a product with the man who has become bankrupt, and he has not taken any of its price, it belongs to him, but if he had taken any of its price, then he is like any other creditor.”",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah رضي الله عنه bahawa Nabi ﷺ bersabda: “Mana-mana lelaki yang menjual suatu produk kepada seseorang yang telah muflis, dan dia belum menerima sebarang bayaran, maka produk itu adalah miliknya. Tetapi jika dia telah menerima sebarang bayaran, maka dia adalah seperti mana-mana pemiutang yang lain.”",
        "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا إِسْمَاعِيل بْنُ عَيَّاشٍ، ‏‏‏‏‏‏عَنْ مُوسَى بْنِ عُقْبَةَ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ أَيُّمَا رَجُلٍ بَاعَ سِلْعَةً فَأَدْرَكَ سِلْعَتَهُ بِعَيْنِهَا عِنْدَ رَجُلٍ وَقَدْ أَفْلَسَ وَلَمْ يَكُنْ قَبَضَ مِنْ ثَمَنِهَا شَيْئًا، ‏‏‏‏‏‏فَهِيَ لَهُ وَإِنْ كَانَ قَبَضَ مِنْ ثَمَنِهَا شَيْئًا فَهُوَ أُسْوَةٌ لِلْغُرَمَاءِ ."
      },
      {
        "id": 26714,
        "hadith_number": "2360",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hak Pemilik Barang Apabila Pembeli Muflis",
        "perawi_melayu": "Ibn Khaldah (seorang hakim di Madinah)",
        "english_text": "It was narrated that Ibn Khaldah, who was a judge in Al-Madinah, said: We came to Abu Hurairah and asked him about a companion of ours who had become bankrupt. He said: “This is what the Prophet (ﷺ) ruled: 'Any man who dies or becomes bankrupt, the owner of the product has more right to it, if he finds the exact thing.”",
        "malay_translation": "Diriwayatkan daripada Ibn Khaldah, seorang hakim di Madinah, berkata: Kami datang kepada Abu Hurairah dan bertanya tentang seorang sahabat kami yang telah muflis. Beliau berkata: “Ini adalah apa yang telah diputuskan oleh Nabi (ﷺ): 'Sesiapa sahaja yang meninggal dunia atau muflis, pemilik barang tersebut mempunyai hak yang lebih terhadapnya, jika dia menjumpai barang yang sama.”",
        "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ، ‏‏‏‏‏‏ وَعَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، ‏‏‏‏‏‏عَنْ ابْنِ أَبِي ذِئْبٍ، ‏‏‏‏‏‏عَنْ أَبِي الْمُعْتَمِرِ بْنِ عَمْرِو بْنِ رَافِعٍ، ‏‏‏‏‏‏عَنِ ابْنِ خَلْدَةَ الزُّرَقِيِّ وَكَانَ قَاضِيًا بِالْمَدِينَةِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ جِئْنَا أَبَا هُرَيْرَةَ فِي صَاحِبٍ لَنَا قَدْ أَفْلَسَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ هَذَا الَّذِي قَضَى فِيهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَيُّمَا رَجُلٍ مَاتَ أَوْ أَفْلَسَ فَصَاحِبُ الْمَتَاعِ أَحَقُّ بِمَتَاعِهِ إِذَا وَجَدَهُ بِعَيْنِهِ ."
      },
      {
        "id": 26715,
        "hadith_number": "2361",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hutang yang Belum Dibayar (Kematian)",
        "perawi_melayu": "Abu Hurairah (Semoga Allah meredhainya)",
        "english_text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: “Any man who dies and has the property of another man, whether he paid something towards it or not, (the owner of those goods) is like any other creditor.”",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah (semoga Allah meredhainya) bahawa Rasulullah (ﷺ) bersabda: “Sesiapa sahaja lelaki yang meninggal dunia dan masih memiliki harta orang lain, sama ada dia telah membayar sesuatu atau tidak, (pemilik harta tersebut) adalah seperti mana-mana pemiutang yang lain.”",
        "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ، ‏‏‏‏‏‏حَدَّثَنَا الْيَمَانُ بْنُ عَدِيٍّ، ‏‏‏‏‏‏حَدَّثَنِي الزُّبَيْدِيُّ مُحَمَّدُ بْنُ الْوَلِيدِ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَيُّمَا امْرِئٍ مَاتَ وَعِنْدَهُ مَالُ امْرِئٍ بِعَيْنِهِ اقْتَضَى مِنْهُ شَيْئًا أَوْ لَمْ يَقْتَضِ فَهُوَ أُسْوَةٌ لِلْغُرَمَاءِ ."
      },
      {
        "id": 26716,
        "hadith_number": "2362",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Generasi Terbaik",
        "perawi_melayu": "Abdullah bin Mas'ud",
        "english_text": "Abdullah bin Mas'ud said: “The Messenger of Allah (ﷺ) was asked, 'Which of the people are best?' He said: 'My generation, then those that follow them, then those that follow them. Then there will come people whose testimony precedes their oath and whose oath precedes their testimony.”",
        "malay_translation": "Abdullah bin Mas'ud berkata: “Rasulullah (ﷺ) ditanya, 'Siapakah manusia yang terbaik?' Baginda menjawab: 'Generasiku, kemudian orang-orang yang mengikuti mereka, kemudian orang-orang yang mengikuti mereka. Kemudian akan datang suatu kaum yang kesaksian mereka mendahului sumpah mereka dan sumpah mereka mendahului kesaksian mereka.”",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏ وَعَمْرُو بْنُ رَافِعٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا جَرِيرٌ، ‏‏‏‏‏‏عَنْ مَنْصُورٍ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ عَبِيدَةَ السَّلْمَانِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ، ‏‏‏‏‏‏سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ النَّاسِ خَيْرٌ؟ قَالَ:‏‏‏‏ قَرْنِي، ‏‏‏‏‏‏ثُمَّ الَّذِينَ يَلُونَهُمْ، ‏‏‏‏‏‏ثُمَّ الَّذِينَ يَلُونَهُمْ، ‏‏‏‏‏‏ثُمَّ يَجِيءُ قَوْمٌ تَبْدُرُ شَهَادَةُ أَحَدِهِمْ يَمِينَهُ وَيَمِينُهُ شَهَادَتَهُ ."
      },
      {
        "id": 26717,
        "hadith_number": "2363",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Menghormati Sahabat Nabi dan Amaran Terhadap Pembohongan",
        "perawi_melayu": "Jabir bin Samurah",
        "english_text": "It was narrated that Jabir bin Samurah said: 'Umar bin Khattab addressed us at Jabiyah and said: “The Messenger of Allah (ﷺ) stood up among us as I stand among you, and said: 'Honor my Companions for my sake, then those who come after them, then those who come after them. Then lying will prevail until a man will give testimony without being asked to do so, and he will swear an oath without being asked to do so.' ”",
        "malay_translation": "Diriwayatkan daripada Jabir bin Samurah, beliau berkata: 'Umar bin Khattab berkhutbah kepada kami di Jabiyah dan berkata: “Rasulullah (ﷺ) berdiri di kalangan kami sebagaimana aku berdiri di kalangan kamu, lalu bersabda: 'Hormatilah para Sahabatku demi diriku, kemudian orang-orang yang datang selepas mereka, kemudian orang-orang yang datang selepas mereka. Kemudian pembohongan akan berleluasa sehingga seseorang memberi kesaksian tanpa diminta, dan dia akan bersumpah tanpa diminta.' ”",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بنُ الْجَرَّاحِ، ‏‏‏‏‏‏حَدَّثَنَا جَرِيرٌ، ‏‏‏‏‏‏عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ سَمُرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ خَطَبَنَا عُمَرُ بْنُ الْخَطَّابِ بِالْجَابِيَةِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ فِينَا مِثْلَ مُقَامِي فِيكُمْ فَقَالَ:‏‏‏‏ احْفَظُونِي فِي أَصْحَابِي، ‏‏‏‏‏‏ثُمَّ الَّذِينَ يَلُونَهُمْ، ‏‏‏‏‏‏ثُمَّ الَّذِينَ يَلُونَهُمْ، ‏‏‏‏‏‏ثُمَّ يَفْشُو الْكَذِبُ حَتَّى يَشْهَدَ الرَّجُلُ وَمَا يُسْتَشْهَدُ وَيَحْلِفَ وَمَا يُسْتَحْلَفُ ."
      },
      {
        "id": 26718,
        "hadith_number": "2364",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Saksi Terbaik: Mereka yang Memberi Keterangan Sebelum Diminta",
        "perawi_melayu": "Zaid bin Khalid Al-Juhani",
        "english_text": "Zaid bin Khalid Al-Juhani said that he heard the Messenger of Allah (ﷺ) say: “The best of witnesses is the one who gives his testimony before he is asked for it.”",
        "malay_translation": "Zaid bin Khalid Al-Juhani berkata bahawa dia mendengar Rasulullah (ﷺ) bersabda: “Sebaik-baik saksi adalah orang yang memberi kesaksiannya sebelum dia diminta untuk berbuat demikian.”",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ عَبدِ الرَّحْمَنِ الْجُعْفِيُّ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا زَيْدُ بْنُ الْحُبَاب:‏‏‏‏ الْعُكْلِيُّ، ‏‏‏‏‏‏أَخْبَرَنِي أُبَيُّ بْنُ عَبَّاسِ بْنِ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيُّ، ‏‏‏‏‏‏حَدَّثَنِي أَبُو بَكْرِ بْنُ عَمْرِو بْنِ حَزْمٍ، ‏‏‏‏‏‏حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عُثْمَانَ بْنِ عَفَّانَ، ‏‏‏‏‏‏حَدَّثَنِي خَارِجَةُ بْنُ زَيْدِ بْنِ ثَابِتٍ، ‏‏‏‏‏‏أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَمْرَةَ الْأَنْصَارِيُّ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ يَقُولُ:‏‏‏‏ إِنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ خَيْرُ الشُّهُودِ مَنْ أَدَّى شَهَادَتَهُ قَبْلَ أَنْ يُسْأَلَهَا ."
      },
      {
        "id": 26719,
        "hadith_number": "2365",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Ayat Hutang Membatalkan Ketetapan Sebelumnya",
        "perawi_melayu": "Abu Sa'eed Al-Khudri (Semoga Allah meredhainya)",
        "english_text": "It was narrated that : Abu Sa'eed Al-Khudri recited this Verse: “O you who believe! When you contract a debt for a fixed period...” until: “then if one of you entrusts the other.” Then he said: “This abrogates what came before.”",
        "malay_translation": "Diriwayatkan bahawa: Abu Sa'eed Al-Khudri membaca ayat ini: “Wahai orang-orang yang beriman! Apabila kamu melakukan hutang untuk tempoh yang ditetapkan…” sehinggalah: “Kemudian jika sebahagian kamu mempercayai sebahagian yang lain.” Kemudian beliau berkata: “Ini membatalkan apa yang terdahulu.”",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ يُوسُفَ الْجُبَيْرِيُّ، ‏‏‏‏‏‏ وَجَمِيلُ بْنُ الْحَسَنِ الْعَتَكِيُّ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا مُحَمَّدُ بْنُ مَرْوَانَ الْعِجْلِيُّ، ‏‏‏‏‏‏حَدَّثَنَاعَبْدُ الْمَلِكِ بْنُ أَبِي نَضْرَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ تَلَا هَذِهِ الْآيَةَ يَأَيُّهَا الَّذِينَ آمَنُوا إِذَا تَدَايَنْتُمْ بِدَيْنٍ إِلَى أَجَلٍ مُسَمًّى حَتَّى بَلَغَ فَإِنْ أَمِنَ بَعْضُكُمْ بَعْضًا سورة البقرة آية 282 ـ 283 فَقَالَ:‏‏‏‏ هَذِهِ نَسَخَتْ مَا قَبْلَهَا ."
      },
      {
        "id": 26720,
        "hadith_number": "2366",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kesaksian Orang Khianat dan Hukuman Had",
        "perawi_melayu": "'Amr bin Shuaib daripada bapanya daripada datuknya",
        "english_text": "It was narrated from 'Amr bin Shuaib from his father that his grandfather said: “The Testimony of a man or woman who is treacherous, or of one who has been subjected to one of the Haad punishments of Islam, or of one who bears a grudge against his brother, is not permissible.”",
        "malay_translation": "Diriwayatkan daripada 'Amr bin Shuaib daripada bapanya bahawa datuknya berkata: “Kesaksian seorang lelaki atau perempuan yang khianat, atau seseorang yang telah dikenakan salah satu hukuman Had dalam Islam, atau seseorang yang menyimpan dendam terhadap saudaranya, adalah tidak dibenarkan.”",
        "arabic_text": "حَدَّثَنَا أَيُّوبُ بْنُ مُحَمَّدٍ الرَّقِّيُّ، ‏‏‏‏‏‏حَدَّثَنَا مُعَمَّرُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏ح وَحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا حَجَّاجُ بْنُ أَرْطَاةَ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تَجُوزُ شَهَادَةُ خَائِنٍ وَلَا خَائِنَةٍ وَلَا مَحْدُودٍ فِي الْإِسْلَامِ وَلَا ذِي غِمْرٍ عَلَى أَخِيهِ ."
      },
      {
        "id": 26721,
        "hadith_number": "2367",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kesaksian Orang Badwi terhadap Penduduk Bandar",
        "perawi_melayu": "Abu Hurairah (رَضِيَ ٱللَّٰهُ عَنْهُ)",
        "english_text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) say: “The testimony of a Bedouin against a town-dweller is not permissible.”",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah (رَضِيَ ٱللَّٰهُ عَنْهُ), bahawa Rasulullah (ﷺ) bersabda: “Kesaksian orang Badwi terhadap penduduk bandar tidak boleh diterima.”",
        "arabic_text": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، ‏‏‏‏‏‏أَخْبَرَنِي نَافِعُ بْنُ يَزِيدَ، ‏‏‏‏‏‏عَنِ ابْنِ الْهَادِ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، ‏‏‏‏‏‏عَنْ عَطَاءِ بْنِ يَسَارٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ لَا تَجُوزُ شَهَادَةُ بَدَوِيٍّ عَلَى صَاحِبِ قَرْيَةٍ ."
      },
      {
        "id": 26722,
        "hadith_number": "2368",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Keputusan Rasulullah (ﷺ) Berdasarkan Sumpah dan Saksi",
        "perawi_melayu": "Abu Hurairah (RA)",
        "english_text": "It was narrated from Abu Hurairah that: the Messenger of Allah (ﷺ) passed judgment on the basis of an oath (from the claimant) along with a (single) witness. [This is in the absence of two witnesses.]",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah bahawa: Rasulullah (ﷺ) membuat keputusan berdasarkan sumpah (daripada pengadu) berserta seorang saksi. [Ini adalah dalam ketiadaan dua orang saksi.]",
        "arabic_text": "حَدَّثَنَا أَبُو مُصْعَبٍ الْمَدِينِيُّ أَحْمَدُ بْنُ عَبْدِ اللَّهِ الزُّهْرِيُّ، ‏‏‏‏‏‏ وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ، ‏‏‏‏‏‏عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ قَضَى بِالْيَمِينِ مَعَ الشَّاهِدِ ."
      },
      {
        "id": 26723,
        "hadith_number": "2369",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Keputusan Berdasarkan Sumpah dan Saksi",
        "perawi_melayu": "Jabir",
        "english_text": "It was narrated from Jabir that: the Prophet (ﷺ) passed judgement on the basis of an oath (from the claimant) along with a (single) witness.",
        "malay_translation": "Diriwayatkan daripada Jabir bahawa: Nabi (ﷺ) telah membuat keputusan berdasarkan sumpah (daripada penuntut) bersama dengan seorang saksi.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْوَهَّابِ، ‏‏‏‏‏‏حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَابِرٍ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ قَضَى بِالْيَمِينِ مَعَ الشَّاهِدِ ."
      },
      {
        "id": 26724,
        "hadith_number": "2370",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Keputusan Rasulullah (ﷺ) Berdasarkan Saksi dan Sumpah",
        "perawi_melayu": "Ibn 'Abbas (رضي الله عنه)",
        "english_text": "It was narrated that Ibn 'Abbas said: “The Messenger of Allah (ﷺ) passed judgement on the basis of a witness along with an oath by the claimant.",
        "malay_translation": "Diriwayatkan bahawa Ibn 'Abbas berkata: “Rasulullah (ﷺ) telah membuat keputusan berdasarkan seorang saksi bersama dengan sumpah daripada pihak penuntut.",
        "arabic_text": "حَدَّثَنَا أَبُو إِسْحَاق الْهَرَوِيُّ إِبْرَاهِيمُ بْنُ عَبْدِ اللَّهِ بْنِ حَاتِمٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْحَارِثِ الْمَخْزُومِيُّ، ‏‏‏‏‏‏حَدَّثَنَا سَيْفُ بْنُ سُلَيْمَانَ الْمَكِّيُّ، ‏‏‏‏‏‏أَخْبَرَنِي قَيْسُ بْنُ سَعْدٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ دِينَارٍ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالشَّاهِدِ وَالْيَمِينِ ."
      },
      {
        "id": 26725,
        "hadith_number": "2371",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kesaksian Seorang Lelaki dan Sumpah Pihak Penuntut",
        "perawi_melayu": "Daripada Surraq",
        "english_text": "It was narrated from Surraq that : the Prophet (ﷺ) allowed the testimony of a man along with the oath of the claimant.",
        "malay_translation": "Diriwayatkan daripada Surraq bahawa: Nabi (ﷺ) membenarkan kesaksian seorang lelaki bersama dengan sumpah pihak penuntut.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، ‏‏‏‏‏‏أَنْبَأَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ مَوْلَى الْمُنْبَعِثِ، ‏‏‏‏‏‏عَنْ رَجُلٍ مِنْ أَهْلِ مِصْرَ، ‏‏‏‏‏‏عَنْ سُرَّقٍ أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَجَازَ شَهَادَةَ الرَّجُلِ وَيَمِينَ الطَّالِبِ ."
      },
      {
        "id": 26726,
        "hadith_number": "2372",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kesaksian Palsu Menyamai Syirik",
        "perawi_melayu": "Khuraim bin Fatik Al-Asadi",
        "english_text": "It was narrated that Khuraim bin Fatik Al-Asadi said that : the Prophet(ﷺ) prayed the Morning prayer, and when he had finished, he stood up and said: “Bearing false witness is equivalent to associating others with Allah,” three times. Then he recited this Verse: “And shun lying speech (false statements), Hunafa' Lillah (i.e., worshiping none but Allah), not associating partners (in worship) to Him.”",
        "malay_translation": "Diriwayatkan bahawa Khuraim bin Fatik Al-Asadi berkata: Nabi (ﷺ) telah menunaikan solat Subuh, dan setelah selesai, baginda berdiri dan bersabda: “Memberi kesaksian palsu adalah sama seperti menyekutukan Allah,” sebanyak tiga kali. Kemudian baginda membacakan ayat ini: “Dan jauhilah perkataan-perkataan dusta, sebagai orang-orang yang hanif, (yakni) beribadat kepada Allah dengan tidak menyekutukan-Nya (dengan sesuatu apa pun).”",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ الْعُصْفُرِيُّ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ حَبِيبِ بْنِ النُّعْمَانِ الْأَسَدِيِّ، ‏‏‏‏‏‏عَنْ خُرَيْمِ بْنِ فَاتِكٍ الْأَسَدِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ صَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصُّبْحَ فَلَمَّا انْصَرَفَ قَامَ قَائِمًا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ عُدِلَتْ شَهَادَةُ الزُّورِ بِالْإِشْرَاكِ بِاللَّهِ ثَلَاثَ مَرَّاتٍ ثُمَّ تَلَا هَذِهِ الْآيَةَ وَاجْتَنِبُوا قَوْلَ الزُّورِ ‏‏‏‏ 30 ‏‏‏‏ حُنَفَاءَ لِلَّهِ غَيْرَ مُشْرِكِينَ بِهِ سورة الحج آية 30-31 ."
      },
      {
        "id": 26727,
        "hadith_number": "2373",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukuman Bagi Saksi Palsu",
        "perawi_melayu": "Daripada Ibn 'Umar رضي الله عنه",
        "english_text": "It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said: 'The one who bears false witness will not move away (on the Day of Resurrection) until Allah condemns him to Hell.' ”",
        "malay_translation": "Diriwayatkan daripada Ibn 'Umar رضي الله عنه bahawa Rasulullah ﷺ bersabda: 'Sesiapa yang memberi kesaksian palsu tidak akan berganjak (pada Hari Kiamat) sehingga Allah menghukumnya ke dalam Neraka.' ",
        "arabic_text": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ الْفُرَاتِ، ‏‏‏‏‏‏عَنْ مُحَارِبِ بْنِ دِثَارٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَنْ تَزُولَ قَدَمُ شَاهِدِ الزُّورِ حَتَّى يُوجِبَ اللَّهُ لَهُ النَّارَ ."
      },
      {
        "id": 26728,
        "hadith_number": "2374",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kebolehan Kesaksian Ahli Kitab",
        "perawi_melayu": "Jabir bin 'Abdullah",
        "english_text": "It was narrated from Jabir bin 'Abdullah that : the Messenger of Allah (ﷺ) allowed the People of the Book to testify against one another.",
        "malay_translation": "Diriwayatkan daripada Jabir bin 'Abdullah bahawa: Rasulullah (ﷺ) membenarkan Ahli Kitab memberikan kesaksian antara satu sama lain.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ، ‏‏‏‏‏‏عَنْ مُجَالِدٍ، ‏‏‏‏‏‏عَنْ عَامِرٍ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَجَازَ شَهَادَةَ أَهْلِ الْكِتَابِ بَعْضِهِمْ عَلَى بَعْضٍ ."
      }
    ]
  }
}