{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 102,
    "data": [
      {
        "id": 24919,
        "hadith_number": "565",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kejadian Rantai dan Hikmah Ijin Tayammum",
        "perawi_melayu": "Umar bin Yasir r.a.",
        "english_text": "It was narrated that 'Ammar bin Yasir said: Aishah dropped a necklace and stayed behind to look for it. Abu Bakr went to 'Aishah and got angry with her for keeping the people waiting. Then Allah revealed the concession allowing dry ablution, so we wiped our arms up to the shoulders. Abu Bakr went to 'Aishah and said: 'I did not know that you are blessed.'",
        "malay_translation": "Diceritakan bahawa 'Ammar bin Yasir berkata: Aisyah menjatuhkan rantai lehernya dan tertinggal untuk mencarinya. Abu Bakar pergi kepada Aisyah dan marah kepadanya kerana membuat orang ramai menunggu. Kemudian Allah menurunkan rukhsah (keringanan) untuk tayammum, maka kami mengusap lengan hingga ke bahu. Abu Bakar pergi kepada Aisyah dan berkata: 'Aku tidak tahu bahawa engkau adalah seorang yang diberkati.'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، ‏‏‏‏‏‏حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ، ‏‏‏‏‏‏عَنِ ابْنِ شِهَابٍ، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ عَمَّارِ بْنِ يَاسِرٍ، ‏‏‏‏‏‏أَنَّهُ قَالَ:‏‏‏‏ سَقَطَ عِقْدُ عَائِشَةَ فَتَخَلَّفَتْ لِالْتِمَاسِهِ، ‏‏‏‏‏‏فَانْطَلَقَ أَبُو بَكْرٍ إِلَى عَائِشَةَ، ‏‏‏‏‏‏فَتَغَيَّظَ عَلَيْهَا فِي حَبْسِهَا النَّاسَ، ‏‏‏‏‏‏فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ الرُّخْصَةَ فِي التَّيَمُّمِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَمَسَحْنَا يَوْمَئِذٍ إِلَى الْمَنَاكِبِ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَانْطَلَقَ أَبُو بَكْرٍ إِلَى عَائِشَةَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا عَلِمْتُ إِنَّكِ لَمُبَارَكَةٌ."
      },
      {
        "id": 24920,
        "hadith_number": "566",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Wudhu’ Tayammum Bersama Rasulullah SAW Hingga Bahu",
        "perawi_melayu": "Ammar bin Yasir RA",
        "english_text": "It was narrated that 'Ammar [bin Yasir] said: We did dry ablution with the Messenger of Allah, (wiping our arms) up to our shoulders.",
        "malay_translation": "Dikisahkan bahawa 'Ammar bin Yasir RA berkata: Kami telah melakukan wuduk tayammum bersama Rasulullah SAW, (dengan mengusap lengan kami) sehingga ke bahu kami.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْعَدَنِيُّ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ عَمْرٍو، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَمَّارِ بْنِ يَاسِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ تَيَمَّمْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْمَنَاكِبِ ."
      },
      {
        "id": 24921,
        "hadith_number": "567",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Bumi Sebagai Masjid dan Tempat Pembersihan",
        "perawi_melayu": "Dari Abu Hurairah رضي الله عنه",
        "english_text": "It was narrated from Abu Hurairah that: The Messenger of Allah said: the earth has been made for me a place of worship and a means of purification.",
        "malay_translation": "Daripada Abu Hurairah رضي الله عنه, bahawa Rasulullah SAW bersabda: Bumi telah dijadikan untukku sebagai tempat beribadah dan pembasuhan (tempat suci).",
        "arabic_text": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ . ح وحَدَّثَنَا أَبُو إِسْحَاق الْهَرَوِيُّ، ‏‏‏‏‏‏حَدَّثَنَاإِسْمَاعِيل بْنُ جَعْفَرٍ جَمِيعًا، ‏‏‏‏‏‏عَنِ الْعَلَاءِ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ جُعِلَتْ لِي الْأَرْضُ مَسْجِدًا وَطَهُورًا ."
      },
      {
        "id": 24922,
        "hadith_number": "568",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Pengungkapan Ayat Tayammum Akibat Kehilangan Barang dan Solat Tanpa Wuduk",
        "perawi_melayu": "Aishah r.a.",
        "english_text": "It was narrated from 'Aishah that: She borrowed a necklace from Asma', and she lost it. The Prophet sent some people to look for it, and the time for prayer came so they prayed without ablution. When they came to the Prophet they complained to him about that, then the Verse of dry ablution was revealed. Usaid bin Hudair said: May Allah reward you with good, for by Allah, nothing ever happens to you but Allah grants you a way out and blesses the Muslims thereby.",
        "malay_translation": "Daripada 'Aishah r.a. disebutkan bahawa: Baginda telah meminjam sebuah rantai dari Asma', dan ia telah hilang. Nabi s.a.w. telah menghantar beberapa orang untuk mencarinya, dan waktu solat telah tiba maka mereka telah menunaikan solat tanpa wuduk. Apabila mereka datang kepada Nabi s.a.w. mereka mengadu hal tersebut kepadanya, lalu ayat tayammum diturunkan. Usaid bin Hudair berkata: Semoga Allah membalasmu dengan kebaikan, kerana demi Allah, tiada sesuatu menimpa kamu melainkan Allah memudahkannya dan memberkati umat Islam dengannya.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو أُسَامَةَ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏أَنَّهَا اسْتَعَارَتْ مِنْ أَسْمَاءَ قِلَادَةً فَهَلَكَتْ، ‏‏‏‏‏‏ فَأَرْسَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُنَاسًا فِي طَلَبِهَا، ‏‏‏‏‏‏فَأَدْرَكَتْهُمُ الصَّلَاةُ فَصَلَّوْا بِغَيْرِ وُضُوءٍ، ‏‏‏‏‏‏فَلَمَّا أَتَوْا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَكَوْا ذَلِكَ إِلَيْهِ، ‏‏‏‏‏‏فَنَزَلَتْ آيَةُ التَّيَمُّمِ ، ‏‏‏‏‏‏فَقَالَ أُسَيْدُ بْنُ حُضَيْرٍ:‏‏‏‏ جَزَاكِ اللَّهُ خَيْرًا، ‏‏‏‏‏‏فَوَاللَّهِ مَا نَزَلَ بِكِ أَمْرٌ قَطُّ إِلَّا جَعَلَ اللَّهُ لَكِ مِنْهُ مَخْرَجًا، ‏‏‏‏‏‏وَجَعَلَ لِلْمُسْلِمِينَ فِيهِ بَرَكَةً."
      },
      {
        "id": 24923,
        "hadith_number": "569",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Cara Menangani Keadaan Tidak Mempunyai Air untuk Bersuci Selepas Mengeluarkan Air Mani",
        "perawi_melayu": "Daripada Said bin Abdur-Rahman bin Abza daripada bapanya",
        "english_text": "It was narrated from Sa'eed bin 'Abdur-Rahman bin Abza from his father, that: A man came to 'Umar bin khattab and said: I became impure following sexual emission and cannot find any water. 'Umar said to him: Do not pray. But 'Ammar bin Yasir said: Do you not remember, O Commander of the Believers, when you and I were on a military expedition and we became sexually impure and could not find water? As for you, you did not pray, but I rolled in the dust and then prayed. When I came to the Prophet and told him what had happened, he said: 'It would have been enough for you (to do this).' (Then demonstrating) the Prophet struck the ground with his hands, then blew on hem, and wiped his face and palms with them.",
        "malay_translation": "Dikisahkan daripada Said bin Abdur-Rahman bin Abza daripada bapanya, bahawa seorang lelaki datang menemui 'Umar bin al-Khattab dan berkata, \"Saya telah terkena hadas besar selepas keluarnya air mani dan tidak menemui air untuk bersuci.\" 'Umar menjawab, \"Janganlah kamu solat.\"  Lalu 'Ammar bin Yasir berkata, \"Wahai Amirul Mukminin, tidakkah engkau ingat ketika engkau dan aku berada dalam ekspedisi tentera dan kita berdua terkena hadas besar tanpa menemui air?  Engkau tidak menunaikan solat, tetapi aku bergulung di dalam debu kemudian menunaikan solat.  Apabila aku datang menemui Nabi SAW dan menceritakan kejadian tersebut, baginda bersabda, \"Itu sudah memadai bagimu.\" Kemudian baginda menunjukkan dengan menepuk bumi dengan kedua-dua tangannya, kemudian meniupnya dan menyeka wajah dan telapak tangannya dengan debu itu.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ الْحَكَمِ، ‏‏‏‏‏‏عَنْ ذَرٍّ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏أَنَّ رَجُلًا أَتَى عُمَرَ بْنَ الْخَطَّابِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنِّي أَجْنَبْتُ فَلَمْ أَجِدِ الْمَاءَ، ‏‏‏‏‏‏فَقَالَ عُمَرُ:‏‏‏‏ لَا تُصَلِّ، ‏‏‏‏‏‏فَقَالَعَمَّارُ بْنُ يَاسِرٍ:‏‏‏‏ أَمَا تَذْكُرُ يَا أَمِيرَ الْمُؤْمِنِينَ إِذْ أَنَا وَأَنْتَ فِي سَرِيَّةٍ فَأَجْنَبْنَا فَلَمْ نَجِدِ الْمَاءَ، ‏‏‏‏‏‏فَأَمَّا أَنْتَ فَلَمْ تُصَلِّ، ‏‏‏‏‏‏وَأَمَّا أَنَا فَتَمَعَّكْتُ فِي التُّرَابِ فَصَلَّيْتُ، ‏‏‏‏‏‏فَلَمَّا أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ ذَلِكَ لَهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنَّمَا كَانَ يَكْفِيكَ وَضَرَبَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدَيْهِ إِلَى الْأَرْضِ، ‏‏‏‏‏‏ثُمَّ نَفَخَ فِيهِمَا وَمَسَحَ بِهِمَا وَجْهَهُ وَكَفَّيْهِ ."
      },
      {
        "id": 24924,
        "hadith_number": "570",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Cara Melakukan Tayamum Menurut Hadis Nabi",
        "perawi_melayu": "Hakam dan Salamah bin Kuhail",
        "english_text": "It was narrated from Hakam and Salamah in Kuhail that: They asked 'Abdullah bin Abi Awfa about dry ablution. He said: The Prophet commanded 'Ammar to do like this;' and he struck the ground with his palms, shook the dust off and wiped his face. (Da'if)Hakam said, and his hands, Salamah said, and his elbows.",
        "malay_translation": "Dikisahkan daripada Hakam dan Salamah bin Kuhail bahawa mereka bertanya kepada Abdullah bin Abi Awfa tentang tayamum. Baginda menjawab: Nabi SAW memerintahkan 'Ammar untuk melakukannya seperti ini; dan beliau menepuk bumi dengan kedua-dua telapak tangannya, kemudian menggegarkan debu dan menyapu wajahnya. (Da'if) Hakam berkata, dan kedua-dua tangannya, Salamah berkata, dan kedua-dua siku.",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنِ ابْنِ أَبِي لَيْلَى، ‏‏‏‏‏‏عَنِ الْحَكَمِ، ‏‏‏‏‏‏ وَسَلَمَةَ بْنِ كُهَيْلٍ، ‏‏‏‏‏‏أَنَّهُمَا سَأَلا عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى عَنِ التَّيَمُّمِ؟ فَقَالَ:‏‏‏‏ أَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَمَّارًا أَنْ يَفْعَلَ هَكَذَا وَضَرَبَ بِيَدَيْهِ إِلَى الْأَرْضِ، ‏‏‏‏‏‏ثُمَّ نَفَضَهُمَا وَمَسَحَ عَلَى وَجْهِهِ ، ‏‏‏‏‏‏قَالَ الْحَكَمُ:‏‏‏‏ وَيَدَيْهِ، ‏‏‏‏‏‏وَقَالَ سَلَمَةُ:‏‏‏‏ وَمِرْفَقَيْهِ."
      },
      {
        "id": 24925,
        "hadith_number": "571",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Cara Tayammum Menurut Sunnah Nabi SAW",
        "perawi_melayu": "Daripada 'Ammar bin Yasir رضي الله عنهما",
        "english_text": "It was narrated from 'Ammar bin Yasir that: When they did dry ablution with the Messenger of Allah, he commanded the Muslims to strike the dust with the palms of their hands, and they did not pick up any dust. Then they wiped their faces once, then they struck the dust with their palms once again and wiped their hands.",
        "malay_translation": "Telah diriwayatkan daripada 'Ammar bin Yasir bahawa: Ketika mereka melakukan tayammum bersama Rasulullah SAW, baginda memerintahkan umat Islam untuk menepuk tanah dengan tapak tangan mereka, dan mereka tidak mengambil sebarang tanah. Kemudian mereka menyeka muka mereka sekali, kemudian mereka menepuk tanah sekali lagi dengan tapak tangan mereka dan menyeka tangan mereka.",
        "arabic_text": "حَدَّثَنَا أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ الْمِصْرِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَنْبَأَنَا يُونُسُ بْنُ يَزِيدَ، ‏‏‏‏‏‏عَنِ ابْنِ شِهَابٍ، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ عَمَّارِ بْنِ يَاسِرٍ حِينَ تَيَمَّمُوا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ الْمُسْلِمِينَ فَضَرَبُوا بِأَكُفِّهِمُ التُّرَابَ، ‏‏‏‏‏‏وَلَمْ يَقْبِضُوا مِنَ التُّرَابِ شَيْئًا، ‏‏‏‏‏‏فَمَسَحُوا بِوُجُوهِهِمْ مَسْحَةً وَاحِدَةً، ‏‏‏‏‏‏ثُمَّ عَادُوا فَضَرَبُوا بِأَكُفِّهِمُ الصَّعِيدَ مَرَّةً أُخْرَى، ‏‏‏‏‏‏فَمَسَحُوا بِأَيْدِيهِمْ ."
      },
      {
        "id": 24926,
        "hadith_number": "572",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Penjelasan Mengenai Perawatan Luka Kepala dan Mengatasi Mimpi Basah",
        "perawi_melayu": "Atā bin Abī Rabāḥ",
        "english_text": "It was narrated that 'Ata' bin Abu Rabah said: I heard Ibn 'Abbas saying that a man was injured in the head at the time of the Messenger of Allah, then he had a wet dream. He was told to have a bath, so he took the bath, became rigid and stiff, and died. News of that reached the Messenger of Allah and he said: 'They have killed him, may Allah kill them! Is not the cure for a lack of knowledge to ask questions?' 'Ata' said: We heard that the Messenger of Allah said: 'If only he had washed his body and left his head alone where the wound was.'",
        "malay_translation": "Diceritakan bahawa 'Ata' bin Abī Rabāḥ berkata: Aku mendengar Ibn 'Abbās berkata bahawa seorang lelaki mengalami kecederaan di kepalanya pada zaman Rasulullah SAW, kemudian dia mengalami mimpi basah. Dia diperintahkan untuk mandi, maka dia mandi, menjadi kaku dan tegar, dan meninggal dunia. Berita itu sampai kepada Rasulullah SAW dan baginda bersabda: 'Mereka telah membunuhnya, semoga Allah membunuh mereka! Bukankah bertanya adalah penyembuhan bagi kekurangan ilmu?' 'Ata' berkata: Kami mendengar bahawa Rasulullah SAW bersabda: 'Sekiranya dia mencuci badannya dan membiarkan kepalanya di tempat luka itu sahaja.' ",
        "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ حَبِيبِ بْنِ أَبِي الْعِشْرِينِ، ‏‏‏‏‏‏حَدَّثَنَا الْأَوْزَاعِيُّ، ‏‏‏‏‏‏عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ ابْنَ عَبَّاسٍ يُخْبِرُ، ‏‏‏‏‏‏ أَنَّ رَجُلًا أَصَابَهُ جُرْحٌ فِي رَأْسِهِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏ثُمَّ أَصَابَهُ احْتِلَامٌ، ‏‏‏‏‏‏فَأُمِرَ بِالِاغْتِسَالِ فَاغْتَسَلَ فَكُزَّ فَمَاتَ، ‏‏‏‏‏‏فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ:‏‏‏‏ قَتَلُوهُ قَتَلَهُمُ اللَّهُ أَفَلَمْ يَكُنْ شِفَاءَ الْعِيِّ السُّؤَالُ ، ‏‏‏‏‏‏قَالَ عَطَاءٌ:‏‏‏‏ وَبَلَغَنَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَوْ غَسَلَ جَسَدَهُ وَتَرَكَ رَأْسَهُ حَيْثُ أَصَابَهُ الْجِرَاحُ ."
      },
      {
        "id": 24927,
        "hadith_number": "573",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Cara Rasulullah SAW Mandi Junub",
        "perawi_melayu": "Ummu Maimunah RA",
        "english_text": "Ibn 'Abbas narrated that his maternal aunt Maimunah said: I put out some water for the Prophet to take a bath, and he bathe to cleanse himself from impurity following sexual activity. He tilted the vessel with his left hand, pouring water into his right, and washed his hands three times. Then he pourd water over his private parts, then he rubbed his hands on the ground. Then he rinsed his mouth and nose, and washed his face three times, and his forearms three times. Then he poured water over the rest of his body, then he moved aside and washed his feet.",
        "malay_translation": "Ibn 'Abbas meriwayatkan bahawa bibinya yang ibu, Ummu Maimunah RA, berkata: Saya menyediakan air untuk Nabi SAW mandi hadas besar. Baginda mandi untuk membersihkan diri daripada najis selepas bersenggama. Baginda memiringkan bekas air dengan tangan kirinya, menuangkan air ke tangan kanannya, dan membasuh kedua-dua tangannya sebanyak tiga kali. Kemudian, Baginda menuangkan air ke bahagian sulitnya, kemudian menggosok kedua-dua tangannya ke tanah. Kemudian, Baginda membilas mulut dan hidungnya, membasuh wajahnya sebanyak tiga kali, dan kedua lengannya sebanyak tiga kali. Kemudian, Baginda menuangkan air ke seluruh badannya, lalu menyingkir ke tepi dan membasuh kedua-dua kakinya.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏ وَعَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنِ الْأَعْمَشِ، ‏‏‏‏‏‏عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، ‏‏‏‏‏‏عَنْكُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ عَبَّاسٍ، ‏‏‏‏‏‏عَنْ خَالَتِهِ مَيْمُونَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ وَضَعْتُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غُسْلًا فَاغْتَسَلَ مِنَ الْجَنَابَةِ، ‏‏‏‏‏‏فَأَكْفَأَ الْإِنَاءَ بِشِمَالِهِ عَلَى يَمِينِهِ فَغَسَلَ كَفَّيْهِ ثَلَاثًا، ‏‏‏‏‏‏ثُمَّ أَفَاضَ عَلَى فَرْجِهِ، ‏‏‏‏‏‏ثُمَّ دَلَكَ يَدَهُ فِي الأَرْضِ، ‏‏‏‏‏‏ثُمَّ مَضْمَضَ وَاسْتَنْشَقَ، ‏‏‏‏‏‏وَغَسَلَ وَجْهَهُ ثَلَاثًا، ‏‏‏‏‏‏وَذِرَاعَيْهِ ثَلَاثًا، ‏‏‏‏‏‏ثُمَّ أَفَاضَ الْمَاءَ عَلَى سَائِرِ جَسَدِهِ، ‏‏‏‏‏‏ثُمَّ تَنَحَّى فَغَسَلَ رِجْلَيْهِ ."
      },
      {
        "id": 24928,
        "hadith_number": "574",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Cara Rasulullah SAW Mandi Junub",
        "perawi_melayu": "Jumai' bin 'Umair At-Taimi",
        "english_text": "Jumai' bin 'Umair At-Taimi said: I went out with my paternal aunt and maternal aunt and we entered upon 'Aishah. We asked her: 'What did the Messenger of Allah do when he had the bath to cleanse himself from sexual impurity?' She said: 'He used to pour water on his hand three times, then he would put them in the vessel and wash his face three times, then he would pour water over his body, then he would get up and perform prayer. As for us, we would wash our heads five times because of our braided hair.'",
        "malay_translation": "Jumai' bin 'Umair al-Taimi berkata: Saya keluar bersama bibi bapa dan bibi ibu saya, lalu kami menemuinya 'Aishah. Kami bertanya kepadanya, 'Apakah yang dilakukan Rasulullah SAW ketika mandi junub?' Dia menjawab, 'Baginda akan menuangkan air ke telapak tangannya sebanyak tiga kali, kemudian memasukkannya ke dalam bekas dan membasuh wajahnya tiga kali, kemudian menuangkan air ke seluruh badannya, lalu berdiri untuk solat. Adapun kami, kami akan membasuh kepala kami lima kali kerana rambut kami yang digunting.' ",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، ‏‏‏‏‏‏حَدَّثَنَا صَدَقَةُ بْنُ سَعِيدٍ الْحَنَفِيُّ، ‏‏‏‏‏‏حَدَّثَنَا جُمَيْعُ بْنُ عُمَيْرٍ التَّيْمِيُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ انْطَلَقْتُ مَعَ عَمَّتِي وَخَالَتِي، ‏‏‏‏‏‏فَدَخَلْنَا عَلَى عَائِشَةَ فَسَأَلْنَاهَا كَيْفَ كَانَ يَصْنَعُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ غُسْلِهِ مِنَ الْجَنَابَةِ؟ قَالَتْ:‏‏‏‏ كَانَ يُفِيضُ عَلَى كَفَّيْهِ ثَلَاثَ مَرَّاتٍ، ‏‏‏‏‏‏ثُمَّ يُدْخِلُهَا فِي الْإِنَاءِ، ‏‏‏‏‏‏ثُمَّ يَغْسِلُ رَأْسَهُ ثَلَاثَ مَرَّاتٍ، ‏‏‏‏‏‏ثُمَّ يُفِيضُ عَلَى جَسَدِهِ، ‏‏‏‏‏‏ثُمَّ يَقُومُ إِلَى الصَّلَاةِ ، ‏‏‏‏‏‏وَأَمَّا نَحْنُ فَإِنَّا نَغْسِلُ رُؤْسَنَا خَمْسَ مِرَارٍ مِنْ أَجْلِ الضَّفْرِ."
      },
      {
        "id": 24929,
        "hadith_number": "575",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Cara Rasulullah SAW Membersihkan Diri Daripada Najis.",
        "perawi_melayu": "Jubair bin Mut'im رضي الله عنه",
        "english_text": "It was narrated that Jubair bin Mut'im said: (The Companions) disputed in the presence of the Messenger of Allah about having a bath to cleanse oneself from sexual impurity. The Messenger of Allah said: 'As for me, I pour three handfuls of water on my head.'",
        "malay_translation": "Dikisahkan bahawa Jubair bin Mut'im رضي الله عنه berkata: Para sahabat berbincang di hadapan Rasulullah SAW tentang cara membersihkan diri daripada hadas besar. Rasulullah SAW bersabda: \"Adapun aku, aku mencurahkan tiga genggam air ke atas kepala aku.\"",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو الْأَحْوَصِ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنْ سُلَيْمَانَ بْنِ صُرَدٍ، ‏‏‏‏‏‏عَنْ جُبَيْرِ بْنِ مُطْعِمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ تَمَارَوْا فِي الْغُسْلِ مِنَ الْجَنَابَةِ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَمَّا أَنَا فَأُفِيضُ عَلَى رَأْسِي ثَلَاثَ أَكُفٍّ ."
      },
      {
        "id": 24930,
        "hadith_number": "576",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Cara Bersuci dari Najis dengan Mandi: Mengatasi Rambut yang Banyak",
        "perawi_melayu": "Dari Abu Sa'id al-Khudri radhiyallahu 'anhu",
        "english_text": "It was narrated from Abu Sa'eed that: A man asked him about having a bath to cleanse oneself from sexual impurity. He said to pour water three times. The man said: But I have a lot of hair. He said: The Messenger of Allah had more hair than you and he was cleaner.",
        "malay_translation": "Daripada Abu Sa'id al-Khudri radhiallahu 'anhu, diriwayatkan bahawa: Seorang lelaki bertanya kepadanya tentang cara mandi untuk bersuci daripada hadas besar. Beliau menjawab: Tuangkan air tiga kali. Lelaki itu berkata: Tetapi rambut saya banyak. Beliau menjawab: Rasulullah SAW mempunyai rambut lebih banyak daripada kamu dan beliau lebih bersih.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏ وَعَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ . ح وحَدَّثَنَا أَبُو كُرَيْبٍ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ فُضَيْلٍجَمِيعًا، ‏‏‏‏‏‏عَنْ فُضَيْلِ بْنِ مَرْزُوقٍ، ‏‏‏‏‏‏عَنْ عَطِيَّةَ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ، ‏‏‏‏‏‏ أَنَّ رَجُلًا سَأَلَهُ عَنِ الْغُسْلِ مِنَ الْجَنَابَةِ؟ فَقَالَ:‏‏‏‏ ثَلَاثًا، ‏‏‏‏‏‏فَقَالَ الرَّجُلُ:‏‏‏‏ إِنْ شَعْرِي كَثِيرٌ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ أَكْثَرَ شَعْرًا مِنْكَ وَأَطْيَبَ ."
      },
      {
        "id": 24931,
        "hadith_number": "577",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Cara Menguruskan Wudhuk di Tanah Sejuk",
        "perawi_melayu": "Jabir",
        "english_text": "It was narrated that Jabir said: I said: 'O Messenger of Allah! I live in a cold land, so how should I have a bath to cleanse myself from sexual impurity?' He said: 'As for me, I pour three handfuls of water over my head.'",
        "malay_translation": "Telah diriwayatkan bahawa Jabir berkata: Saya berkata, 'Wahai Rasulullah! Saya tinggal di tanah yang sejuk, bagaimana saya hendak mandi hadas besar?' Baginda bersabda: 'Adapun aku, aku menuang tiga genggam air ke atas kepalaku.'",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، ‏‏‏‏‏‏عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَابِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏ أَنَا فِي أَرْضٍ بَارِدَةٍ فَكَيْفَ الْغُسْلُ مِنَ الْجَنَابَةِ؟ فَقَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَمَّا أَنَا فَأَحْثُو عَلَى رَأْسِي ثَلَاثًا ."
      },
      {
        "id": 24932,
        "hadith_number": "578",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Cara Membasuh Diri Orang Junub Mengikut Sunnah Nabi SAW",
        "perawi_melayu": "Abu Hurairah RA",
        "english_text": "It was narrated from Abu Hurairah that : A man asked him: How much water should I pour over my head when I m sexually impure? He said: the messenger of Allah used to pour three handfuls of water over his head. The man said: My hair is long. He said: The Messenger of Allah had more hair than you and he was cleaner.",
        "malay_translation": "Telah diriwayatkan daripada Abu Hurairah RA bahawa seorang lelaki bertanya kepadanya: Berapa banyak air yang perlu saya tuang ke atas kepala saya apabila saya dalam keadaan junub? Beliau menjawab: Rasulullah SAW biasanya menumpahkan tiga genggam air ke atas kepalanya. Lelaki itu berkata: Rambut saya panjang. Beliau menjawab: Rasulullah SAW mempunyai rambut lebih banyak daripada awak, dan beliau lebih bersih.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بِنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ، ‏‏‏‏‏‏عَنِ ابْنِ عَجْلَانَ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏سَأَلَهُ رَجُلٌ كَمْ أُفِيضُ عَلَى رَأْسِي وَأَنَا جُنُبٌ؟ قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحْثُو عَلَى رَأْسِهِ ثَلَاثَ حَثَيَاتٍ ، ‏‏‏‏‏‏قَالَ الرَّجُلُ:‏‏‏‏ إِنَّ شَعْرِي طَوِيلٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكْثَرَ شَعْرًا مِنْكَ وَأَطْيَبَ ."
      },
      {
        "id": 24933,
        "hadith_number": "579",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Rasulullah SAW Tidak Berwuduk Selepas Mandi Junub",
        "perawi_melayu": "Aishah RA",
        "english_text": "It was narrated that 'Aishah said: The Messenger of Allah would not perform ablution after the bath to cleanse himself from sexual impurity.",
        "malay_translation": "Telah diriwayatkan bahawa 'Aishah RA berkata: Rasulullah SAW tidak akan berwuduk selepas mandi junub.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏ وَعَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ زُرَارَةَ، ‏‏‏‏‏‏ وَإِسْمَاعِيل بْنُ مُوسَى السُّدِّيُّ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ حَدَّثَنَاشَرِيكٌ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنِ الْأَسْوَدِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَتَوَضَّأُ بَعْدَ الْغُسْلِ مِنَ الْجَنَابَةِ ."
      },
      {
        "id": 24934,
        "hadith_number": "580",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Keperihalan Nabi SAW Mandi dan Mengelap Diri Bersama Aisyah RA",
        "perawi_melayu": "Aisyah رضي الله عنها",
        "english_text": "It was narrated that 'Aishah said: The Messenger of Allah used to have a bath to cleanse himself from sexual impurity, then he would warm himself with me before I had the bath.",
        "malay_translation": "Telah diriwayatkan daripada Aisyah رضي الله عنها, baginda Rasulullah SAW biasa mandi hadas besar, kemudian beliau akan melepaskan kepanasan diri dengan saya sebelum saya mandi.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا شَرِيكٌ، ‏‏‏‏‏‏عَنْ حُرَيْثٍ، ‏‏‏‏‏‏عَنِ الشَّعْبِيِّ، ‏‏‏‏‏‏عَنْ مَسْرُوقٍ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْتَسِلُ مِنَ الْجَنَابَةِ، ‏‏‏‏‏‏ثُمَّ يَسْتَدْفِئُ بِي قَبْلَ أَنْ أَغْتَسِلَ ."
      },
      {
        "id": 24935,
        "hadith_number": "581",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Cara Rasulullah SAW Menjaga Kebersihan Diri Selepas Berhubungan Badan",
        "perawi_melayu": "Ummu Al-Mu'minin 'Aishah r.a. berkata:",
        "english_text": "It was narrated that 'Aishah said: The Messenger of Allah would become sexually impure and then sleep without water until he got up later on and taken a bath.",
        "malay_translation": "Telah diriwayatkan bahawa 'Aishah r.a. berkata: Rasulullah SAW akan menjadi junub, kemudian tidur tanpa mengambil wudhuk sehingga baginda bangun kemudian mandi.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، ‏‏‏‏‏‏عَنِ الْأَعْمَشِ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنِ الْأَسْوَدِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُجْنِبُ، ‏‏‏‏‏‏ثُمَّ يَنَامُ، ‏‏‏‏‏‏وَلَا يَمَسُّ مَاءً حَتَّى يَقُومَ بَعْدَ ذَلِكَ، ‏‏‏‏‏‏فَيَغْتَسِلَ ."
      },
      {
        "id": 24936,
        "hadith_number": "582",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Cara Rasulullah SAW Memenuhi Keperluan Rumah Tangga dan Tidur",
        "perawi_melayu": "Aishah r.a.",
        "english_text": "It was narrated that 'Aishah said: The Messenger of Allah, if he needed any of his wives, would satisfy his needs then he would sleep as he was, without touching water.",
        "malay_translation": "Telah diriwayatkan bahawa 'Aishah r.a. berkata: Rasulullah SAW jika mempunyai keperluan terhadap isteri-isterinya, maka Baginda akan menunaikannya, kemudian Baginda akan tidur seperti sedia ada tanpa menyentuh air.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو الْأَحْوَصِ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنِ الْأَسْوَدِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ كَانَتْ لَهُ إِلَى أَهْلِهِ حَاجَةٌ قَضَاهَا، ‏‏‏‏‏‏ثُمَّ يَنَامُ كَهَيْئَتِهِ لَا يَمَسُّ مَاءً ."
      },
      {
        "id": 24937,
        "hadith_number": "583",
        "status": "Da'if",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Perkara Rasulullah SAW Mengenai Menjaga Kebersihan Dan Tidur",
        "perawi_melayu": "Aishah رضي الله عنها",
        "english_text": "It was narrated from 'Aishah that: The Messenger of Allah would become sexually impure then sleep as he was, without touching water. (Da'if)Sufyan said: I mentioned this Hadith one day, and Isma'il said to me: 'O young man, you should support this Hadith with something else.'",
        "malay_translation": "Daripada 'Aishah رضي الله عنها, diceritakan bahawa Rasulullah SAW apabila telah junub, baginda akan tidur dalam keadaan itu tanpa menyentuh air. (Da'if) Sufyan berkata: Aku pernah menceritakan hadis ini suatu hari, lalu Ismail berkata kepadaku: \"Wahai pemuda, hendaklah engkau menyokong hadis ini dengan sesuatu yang lain.\"",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنِ الْأَسْوَدِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُجْنِبُ، ‏‏‏‏‏‏ثُمَّ يَنَامُ كَهَيْئَتِهِ لَا يَمَسُّ مَاءً ، ‏‏‏‏‏‏قَالَ سُفْيَانُ:‏‏‏‏ فَذَكَرْتُ الْحَدِيثَ يَوْمًا، ‏‏‏‏‏‏فَقَالَ لِي إِسْمَاعِيل:‏‏‏‏ يَا فَتَى يُشَدُّ هَذَا الْحَدِيثُ بِشَيْءٍ."
      },
      {
        "id": 24938,
        "hadith_number": "584",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Wudhu Rasulullah SAW Sewaktu Ingin Tidur dalam Keadaan Junub",
        "perawi_melayu": "Aishah رضي الله عنها",
        "english_text": "It was narrated that 'Aishah said: When the Messenger of Allah wanted to sleep and he was sexually impure, he would perform ablution as for prayer.",
        "malay_translation": "Telah diriwayatkan bahawa 'Aishah رضي الله عنها berkata: Apabila Rasulullah SAW ingin tidur dan dalam keadaan junub, baginda akan melakukan wuduk seperti wuduk untuk solat.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ، ‏‏‏‏‏‏نَبَّأَنَا اللَّيْثُ بْنُ سَعْدٍ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ أَنْ يَنَامَ وَهُوَ جُنُبٌ تَوَضَّأَ وُضُوءَهُ لِلصَّلَاةِ ."
      },
      {
        "id": 24939,
        "hadith_number": "585",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Bolehkah Orang yang Junub Tidur?",
        "perawi_melayu": "Ibn 'Umar",
        "english_text": "It was narrated from Ibn 'Umar that : 'Umar bin Khattab said to the Messenger of Allah: can anyone of us sleep if he is sexually impure? He said: Yes, if he performs ablution.",
        "malay_translation": "Telah diriwayatkan daripada Ibn 'Umar bahawa: 'Umar bin al-Khattab bertanya kepada Rasulullah SAW, \"Bolehkah seseorang di antara kita tidur dalam keadaan junub?\" Baginda menjawab, \"Ya, jika dia berwudhuk.\"",
        "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْأَعْلَى، ‏‏‏‏‏‏حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَر، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏أَنَّعُمَرَ بْنَ الْخَطَّابِ قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَيَرْقُدُ أَحَدُنَا وَهُوَ جُنُبٌ؟ قَالَ:‏‏‏‏ نَعَمْ إِذَا تَوَضَّأَ ."
      },
      {
        "id": 24940,
        "hadith_number": "586",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Menyelesaikan Keperluan Wudhuk Sebelum Tidur Jika Terkena Janabat",
        "perawi_melayu": "Daripada Abu Sa'id al-Khudri r.a.",
        "english_text": "It was narrated from Abu Sa'eed Khudri that: He used to become sexually impure at night, then he would want to sleep. The Messenger of Allah told him to perform ablution and then go to sleep.",
        "malay_translation": "Telah diriwayatkan daripada Abu Sa'id al-Khudri bahawa: Beliau pernah mengalami hadas besar pada waktu malam, kemudian beliau ingin tidur. Rasulullah SAW menyuruhnya berwudhuk terlebih dahulu sebelum tidur.",
        "arabic_text": "حَدَّثَنَا أَبُو مَرْوَانَ الْعُثْمَانِيُّ مُحَمَّدُ بْنُ عُثْمَانَ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الْهَادِ، ‏‏‏‏‏‏عَنْعَبْدِ اللَّهِ بْنِ خَبَّابٍ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، ‏‏‏‏‏‏أَنَّهُ كَانَ تُصِيبُهُ الْجَنَابَةُ بِاللَّيْلِ فَيُرِيدُ أَنْ يَنَامَ، ‏‏‏‏‏‏ فَأَمَرَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَتَوَضَّأَ ثُمَّ يَنَامَ ."
      },
      {
        "id": 24941,
        "hadith_number": "587",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Mengulangi Hubungan Suami Isteri Tanpa Mandi Wudhu",
        "perawi_melayu": "Abu Sa'eed al-Khudri RA berkata",
        "english_text": "It was narrated that Abu Sa'eed said: The Messenger of Allah said: 'If anyone of you has intercourse with his wife, then he wants to do it again, let him perform ablution.'",
        "malay_translation": "Telah diriwayatkan bahawa Abu Sa'eed al-Khudri RA berkata: Rasulullah SAW bersabda, 'Jika salah seorang daripada kamu melakukan hubungan intim dengan isterinya, kemudian dia ingin mengulanginya, maka hendaklah dia berwudhuk.'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، ‏‏‏‏‏‏حَدَّثَنَا عَاصِمٌ الْأَحْوَلُ، ‏‏‏‏‏‏عَنْ أَبِي الْمُتَوَكِّلِ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا أَتَى أَحَدُكُمْ أَهْلَهُ، ‏‏‏‏‏‏ثُمَّ أَرَادَ أَنْ يَعُودَ فَلْيَتَوَضَّأْ ."
      },
      {
        "id": 24942,
        "hadith_number": "588",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Rasulullah SAW Menziarahi Isteri-isterinya dengan Satu Mandi",
        "perawi_melayu": "Anas r.a.",
        "english_text": "It was narrated from Anas that: The Prophet used to go round to all his wives with one bath.",
        "malay_translation": "Daripada Anas r.a., bahawa Nabi SAW  selalu menziarahi semua isterinya dalam satu mandi sahaja.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، ‏‏‏‏‏‏ وَأَبُو أَحْمَدَ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏عَنْ مَعْمَرٍ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْأَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَطُوفُ عَلَى نِسَائِهِ فِي غُسْلٍ وَاحِدٍ ."
      },
      {
        "id": 24943,
        "hadith_number": "589",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Rasulullah SAW Mandi selepas Menziarahi Semua Isteri dalam Satu Malam",
        "perawi_melayu": "Anas bin Malik r.a.",
        "english_text": "It was narrated that Anas said: I put out water for the Messenger of Allah for a bath, and he had a bath after going to all of his wives in one night.",
        "malay_translation": "Telah diriwayatkan bahawa Anas r.a. berkata:  Aku menyediakan air untuk mandi bagi Rasulullah SAW, dan baginda mandi selepas mengunjungi semua isteri baginda dalam satu malam.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنْ صَالِحِ بْنِ أَبِي الْأَخْضَرِ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَضَعْتُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غُسْلًا، ‏‏‏‏‏‏ فَاغْتَسَلَ مِنْ جَمِيعِ نِسَائِهِ فِي لَيْلَةٍ ."
      },
      {
        "id": 24944,
        "hadith_number": "590",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kebersihan dan Keutamaan Mandi Berasingan",
        "perawi_melayu": "Abu Rafi'",
        "english_text": "It was narrated from Abu Rafi' that: The Prophet went around to all of his wives in one night, and he had a bath after each one of them. It was said to him: O Messenger of Allah, why not make it one bath? He said: This is purer, better and cleaner.",
        "malay_translation": "Telah diriwayatkan daripada Abu Rafi' bahawa: Rasulullah SAW telah melawat semua isterinya dalam satu malam, dan beliau mandi selepas setiap seorang daripada mereka. Lalu dikatakan kepadanya: Wahai Rasulullah, mengapa tidak mandi sekali sahaja? Baginda bersabda: Mandi berasingan ini lebih suci, lebih baik dan lebih bersih.",
        "arabic_text": "حَدَّثَنَا إِسْحَاق بْنُ مَنْصُورٍ، ‏‏‏‏‏‏أَنْبَأَنَا عَبْدُ الصَّمَدِ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادٌ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي رَافِعٍ، ‏‏‏‏‏‏عَنْ عَمَّتِهِ سَلْمَى، ‏‏‏‏‏‏عَنْ أَبِي رَافِعٍ:‏‏‏‏ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَافَ عَلَى نِسَائِهِ فِي لَيْلَةٍ، ‏‏‏‏‏‏وَكَانَ يَغْتَسِلُ عِنْدَ كُلِّ وَاحِدَةٍ مِنْهُنَّ، ‏‏‏‏‏‏فَقِيلَ لَهُ:‏‏‏‏ يَا رَسُولَ اللَّهِ أَلَا تَجْعَلُهُ غُسْلًا وَاحِدًا؟ فَقَالَ:‏‏‏‏ هُوَ أَزْكَى وَأَطْيَبُ وَأَطْهَرُ ."
      },
      {
        "id": 24945,
        "hadith_number": "591",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Wajibnya Mandi Wuduk Sebelum Makan Jika Junub",
        "perawi_melayu": "Aishah رضي الله عنها",
        "english_text": "It was narrated that 'Aishah said: If the Messenger of Allah wanted to eat when he was sexually impure, he would perform ablution.",
        "malay_translation": "Diceritakan bahawa 'Aishah رضي الله عنها berkata: Sekiranya Rasulullah SAW ingin makan ketika dalam keadaan junub, baginda akan melakukan wuduk.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ عُلَيَّةَ، ‏‏‏‏‏‏ وَغُنْدَرٌ، ‏‏‏‏‏‏ وَوَكِيعٌ، ‏‏‏‏‏‏عَنْ شُعْبَةَ، ‏‏‏‏‏‏عَنِ الْحَكَمِ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنِالْأَسْوَدِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ أَنْ يَأْكُلَ وَهُوَ جُنُبٌ تَوَضَّأَ"
      },
      {
        "id": 24946,
        "hadith_number": "592",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kebolehan Orang Junub Tidur, Makan, dan Minum",
        "perawi_melayu": "Jabir bin Abdullah رضي الله عنهما",
        "english_text": "It was narrated that Jabir bin 'Abdullah said: The Prophet was asked about whether a person who is sexually impure can sleep, or eat, or drink. He said: 'yes, if he does ablution as for the prayer.'",
        "malay_translation": "Telah diriwayatkan bahawa Jabir bin 'Abdullah رضي الله عنهما berkata: Nabi SAW ditanya tentang sama ada seseorang yang dalam keadaan junub boleh tidur, makan, atau minum. Baginda menjawab: 'Ya, jika dia berwضو (berwuduk) seperti untuk solat.'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ هَيَّاجٍ، ‏‏‏‏‏‏حَدَّثَنَا إِسْمَاعِيل بْنُ صُبَيْحٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو أُوَيْسٍ، ‏‏‏‏‏‏عَنْ شُرَحْبِيلَ بْنِ سَعْدٍ، ‏‏‏‏‏‏عَنْجَابِرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْجُنُبِ هَلْ يَنَامُ، ‏‏‏‏‏‏أَوْ يَأْكُلُ، ‏‏‏‏‏‏أَوْ يَشْرَبُ؟ قَالَ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏إِذَا تَوَضَّأَ وُضُوءَهُ لِلصَّلَاةِ ."
      },
      {
        "id": 24947,
        "hadith_number": "593",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Petunjuk Rasulullah SAW Mengenai Bersuci Sebelum Makan Ketika Junub",
        "perawi_melayu": "Aishah رضي الله عنها",
        "english_text": "It was narrated from 'Aishah that: If the Prophet wanted to eat when he was sexually impure, he would wash his hands.",
        "malay_translation": "Diriwayatkan daripada 'Aishah رضي الله عنها bahawa: Jika Rasulullah SAW ingin makan ketika dalam keadaan junub, baginda akan mencuci tangannya.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ ابْنُ الْمُبَارَكِ، ‏‏‏‏‏‏عَنْ يُونُسَ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْعَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَرَادَ أَنْ يَأْكُلَ وَهُوَ جُنُبٌ غَسَلَ يَدَيْهِ ."
      },
      {
        "id": 24948,
        "hadith_number": "594",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kebersihan Rasulullah SAW dan Pembacaan Al-Quran Selepas Membuang Air",
        "perawi_melayu": "Abdullah bin Salamah",
        "english_text": "It was narrated that 'Abdullah bin Salamah said: I entered upon 'Ali bin Abu Talib and he said: 'The Messenger of Allah used to go to the lavatory and relieve himself, then come out, and he would eat bread and meat with us and recite Qur'an, nothing stopped him' or perhaps he said: 'prevented him from doing so except sexual impurity.'",
        "malay_translation": "Dikisahkan bahawa Abdullah bin Salamah berkata: \"Saya pernah menemui Ali bin Abi Talib, dan beliau berkata: 'Utusan Allah SAW akan pergi ke tandas, membuang air, kemudian keluar, dan beliau akan makan roti dan daging bersama kami serta membaca Al-Quran, tiada apa yang menghalang beliau'. Atau mungkin beliau berkata: 'Tidak ada yang menghalangnya daripada melakukan perkara tersebut kecuali hadas besar.'\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ مُرَّةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ سَلَمَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ دَخَلْتُ عَلَى عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْتِي الْخَلَاءَ فَيَقْضِي الْحَاجَةَ، ‏‏‏‏‏‏ثُمَّ يَخْرُجُ فَيَأْكُلُ مَعَنَا الْخُبْزَ، ‏‏‏‏‏‏وَاللَّحْمَ، ‏‏‏‏‏‏وَيَقْرَأُ الْقُرْآنَ، ‏‏‏‏‏‏وَلَا يَحْجُبُهُ، ‏‏‏‏‏‏وَرُبَّمَا قَالَ:‏‏‏‏ لَا يَحْجُزُهُ عَنِ الْقُرْآنِ شَيْءٌ إِلَّا الْجَنَابَةُ ."
      },
      {
        "id": 24949,
        "hadith_number": "595",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Membaca Al-Quran dalam Keadaan Junub dan Haid",
        "perawi_melayu": "Ibn 'Umar",
        "english_text": "It was narrated that Ibn 'Umar said: The Messenger of Allah said: 'No one who is sexually impure and no woman who is menstruating should recite Qur'an.'",
        "malay_translation": "Telah diriwayatkan bahawa Ibn 'Umar berkata: Rasulullah SAW bersabda: \"Tidak sepatutnya orang yang junub dan wanita yang haid membaca Al-Quran.\"",
        "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا إِسْمَاعِيل بْنُ عَيَّاشٍ، ‏‏‏‏‏‏حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا يَقْرَأُ الْقُرْآنَ الْجُنُبُ، ‏‏‏‏‏‏وَلَا الْحَائِضُ ."
      },
      {
        "id": 24950,
        "hadith_number": "596",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Membaca Al-Quran oleh Orang Junub dan Wanita Haid",
        "perawi_melayu": "Ibn 'Umar r.a.",
        "english_text": "It was narrated that Ibn 'Umar said: The Messenger of Allah said: 'No one who is sexually impure and no woman who is menstruating should recite anything of the Qur'an.'",
        "malay_translation": "Telah diriwayatkan bahawa Ibn 'Umar r.a. berkata: Rasulullah SAW bersabda: \"Tidak boleh seseorang yang dalam keadaan junub dan wanita yang sedang haid membaca sebarang ayat Al-Quran.\"",
        "arabic_text": "قَالَ أَبُو الْحَسَنِ:‏‏‏‏ وَحَدَّثَنَا أَبُو حَاتِمٍ، ‏‏‏‏‏‏حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا إِسْمَاعِيل بْنُ عَيَّاشٍ، ‏‏‏‏‏‏حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا يَقْرَأُ الْجُنُبُ وَالْحَائِضُ شَيْئًا مِنَ الْقُرْآنِ ."
      },
      {
        "id": 24951,
        "hadith_number": "597",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kebersihan Rambut dan Kulit",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "It was narrated that Abu Hurairah said: The Messenger of Allah said: 'Under every hair there is the state of sexual impurity, so wash the hair and cleanse the skin.'",
        "malay_translation": "Diceritakan bahawa Abu Hurairah رضي الله عنه berkata: Rasulullah SAW bersabda, 'Di bawah setiap helai rambut terdapat najis junub, maka basuhlah rambut dan bersihkanlah kulit.'.",
        "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، ‏‏‏‏‏‏حَدَّثَنَا الْحَارِثُ بْنُ وَجِيهٍ، ‏‏‏‏‏‏حَدَّثَنَا مَالِكُ بْنُ دِينَارٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ سِيرِينَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ تَحْتَ كُلِّ شَعَرَةٍ جَنَابَةً، ‏‏‏‏‏‏فَاغْسِلُوا الشَّعَرَ، ‏‏‏‏‏‏وَأَنْقُوا الْبَشَرَةَ ."
      },
      {
        "id": 24952,
        "hadith_number": "598",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Solat Lima Waktu, Hari Jumaat Kepada Hari Jumaat, dan Menunaikan Amanah sebagai Penebus Dosa",
        "perawi_melayu": "Abu Ayyub al-Ansari",
        "english_text": "Abu Ayyub Al-Ansari narrated that: The Prophet said: The five daily prayers, from one Friday to the next, and fulfilling the trust are all expiation for whatever (sins) come between them. I said: What is fulfilling the trust? He said: Having a bath to cleanse oneself from sexual impurity, for under every hair there is the state of sexual impurity.",
        "malay_translation": "Abu Ayyub al-Ansari meriwayatkan bahawa: Rasulullah SAW bersabda: Solat lima waktu, dari satu hari Jumaat ke hari Jumaat berikutnya, dan menunaikan amanah adalah penghapus dosa-dosa yang berlaku di antara keduanya. Aku bertanya, \"Apakah maksud menunaikan amanah?\" Baginda menjawab, \"Membasuh diri untuk membersihkan diri daripada hadas besar, kerana di bawah setiap rambut ada hadas besar.",
        "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، ‏‏‏‏‏‏حَدَّثَنِي عُتْبَةُ بْنُ أَبِي حَكِيمٍ، ‏‏‏‏‏‏حَدَّثَنِي طَلْحَةُ بْنُ نَافِعٍ، ‏‏‏‏‏‏حَدَّثَنِي أَبُو أَيُّوبَ الْأَنْصَارِيُّ، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ الصَّلَوَاتُ الْخَمْسُ، ‏‏‏‏‏‏وَالْجُمُعَةُ إِلَى الْجُمُعَةِ، ‏‏‏‏‏‏وَأَدَاءُ الْأَمَانَةِ كَفَّارَةٌ لِمَا بَيْنَهَا ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ وَمَا أَدَاءُ الْأَمَانَةِ؟ قَالَ:‏‏‏‏ غُسْلُ الْجَنَابَةِ فَإِنَّ تَحْتَ كُلِّ شَعَرَةٍ جَنَابَةً ."
      },
      {
        "id": 24953,
        "hadith_number": "599",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Meninggalkan Najis dan Kewajipan Membersihkan",
        "perawi_melayu": "Ali bin Abi Talib r.a.",
        "english_text": "It was narrated from 'Ali bin Abu Talib that: The Prophet said: Whoever leaves an area the size of a hair on his body and does not cleanse it from sexual impurity, such and such will be done to him in the Fire. 'Ali said: Because of that I am hostile towards my hair, and he used to shave his head.",
        "malay_translation": "Dikisahkan daripada Ali bin Abi Talib bahawa: Rasulullah SAW bersabda, \"Sesiapa yang meninggalkan sebahagian tubuhnya sebesar sehelai rambut dan tidak membersihkannya daripada hadas besar, maka sebegini dan sebegitulah akan berlaku kepadanya di dalam Neraka.\" Ali berkata: Oleh sebab itu, aku membenci rambutku, dan baginda selalu mencukur kepalanya.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا الْأَسْوَدُ بْنُ عَامِرٍ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏عَنْ عَطَاءِ بْنِ السَّائِبِ، ‏‏‏‏‏‏عَنْزَاذَانَ، ‏‏‏‏‏‏عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ تَرَكَ مَوْضِعَ شَعَرَةٍ مِنْ جَسَدِهِ مِنْ جَنَابَةٍ لَمْ يَغْسِلْهَا فُعِلَ بِهِ كَذَا وَكَذَا مِنَ النَّارِ ، ‏‏‏‏‏‏قَالَ عَلِيٌّ:‏‏‏‏ فَمِنْ ثَمَّ عَادَيْتُ شَعَرِي وَكَانَ يَجُزُّهُ."
      },
      {
        "id": 24954,
        "hadith_number": "600",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukum Wanita yang Melihat Mimpi Seperti Lelaki dan Tindakannya",
        "perawi_melayu": "Umm Salamah r.a. melalui Zainab binti Umm Salamah r.a. dan Umm Sulaim r.a.",
        "english_text": "It was narrated from Zainab, the daughter of Umm Salamah, that : Her mother Umm Salamah said: Umm Sulaim came to the Prophet and asked him about a woman who sees in her dream something like a man sees. He said: 'Yes, if she sees water (discharge), let her take a bath.' I said: 'You have embarrassed the women. Do women experience wet dreams?' The Prophet said: 'May your hands be rubbed with dust, how else does her child resemble her?'",
        "malay_translation": "Dikisahkan daripada Zainab, anak perempuan Umm Salamah, bahawa ibunya, Umm Salamah berkata: Umm Sulaim datang kepada Nabi saw dan bertanya tentang seorang wanita yang melihat dalam mimpinya sesuatu yang serupa dengan apa yang dilihat lelaki. Baginda menjawab: 'Ya, jika dia melihat air (berair), hendaklah dia mandi.' Aku (Umm Salamah) berkata: 'Engkau telah mengaibkan kaum wanita. Adakah wanita mengalami mimpi basah?' Nabi saw bersabda: 'Semoga tanganmu ditimpa debu, bagaimanakah anak perempuannya serupa dengannya?'",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏ وَعَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ، ‏‏‏‏‏‏عَنْ أُمِّهَا أَمِّ سَلَمَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ جَاءَتْ أُمُّ سُلَيْمٍ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَتْهُ عَنِ الْمَرْأَةِ تَرَى فِي مَنَامِهَا مَا يَرَى الرَّجُلُ؟ قَالَ:‏‏‏‏ نَعَمْ إِذَا رَأَتِ الْمَاءَ فَلْتَغْتَسِلْ ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ فَضَحْتِ النِّسَاءَ، ‏‏‏‏‏‏وَهَلْ تَحْتَلِمُ الْمَرْأَةُ؟ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ تَرِبَتْ يَمِينُكِ، ‏‏‏‏‏‏فَبِمَ يُشْبِهُهَا وَلَدُهَا إِذًا ."
      },
      {
        "id": 24955,
        "hadith_number": "601",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukum Wanita Mengalami Mimpi Seperti Lelaki Dan Keadaan Air Mani",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "It was narrated from Anas that: Umm Sulaim asked the Messenger of Allah about a woman who sees in her dream something like that which a man sees. The Messenger of Allah said: If she sees that and has a discharge, then let her perform a bath. Umm Salamah said: O Messenger of Allah, does that really happen? He said: Yes, the water of the man is thick and white and the water of a woman is thin and yellow. Whichever of them comes first or predominates, the child will resemble (that parent).",
        "malay_translation": "Daripada Anas, disebutkan bahawa Umm Sulaim bertanya kepada Rasulullah SAW tentang seorang wanita yang melihat sesuatu dalam mimpinya seperti yang dilihat oleh seorang lelaki. Rasulullah SAW menjawab: Jika dia melihat itu dan mengalami keluarnya air mani, maka hendaklah dia mandi wajib. Umm Salamah bertanya: Ya Rasulullah, adakah perkara ini benar-benar berlaku? Baginda menjawab: Ya, air mani lelaki tebal dan putih, manakala air mani wanita nipis dan kuning. Yang mana datang terlebih dahulu atau lebih banyak akan menentukan rupa anak yang dilahirkan, menyerupai ibu bapa itu.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، ‏‏‏‏‏‏ وَعَبْدُ الْأَعْلَى، ‏‏‏‏‏‏عَنِ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏أَنَّ أُمَّ سُلَيْمٍ سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْمَرْأَةِ تَرَى فِي مَنَامِهَا مَا يَرَى الرَّجُلُ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا رَأَتْ ذَلِكَ فَأَنْزَلَتْ فَعَلَيْهَا الْغُسْلُ ، ‏‏‏‏‏‏فَقَالَتْ أُمُّ سَلَمَةَ:‏‏‏‏ يَا رَسُولَ اللَّهِ أَيَكُونُ هَذَا؟ قَالَ:‏‏‏‏ نَعَمْ مَاءُ الرَّجُلِ غَلِيظٌ أَبْيَضُ، ‏‏‏‏‏‏وَمَاءُ الْمَرْأَةِ رَقِيقٌ أَصْفَرُ، ‏‏‏‏‏‏فَأَيُّهُمَا سَبَقَ أَوْ عَلَا أَشْبَهَهُ الْوَلَدُ ."
      },
      {
        "id": 24956,
        "hadith_number": "602",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukum Mandi Wanita yang Mimpi Seperti Lelaki",
        "perawi_melayu": "Daripada Khawlah binti Hakim",
        "english_text": "It was narrated from Khawlah bint Hakim that: She asked the Messenger of Allah about a woman who sees in her dream that which a man sees. He said: She does not have to take a bath unless she has an orgasm, just as man does not have to take a bath unless he has an orgasm.",
        "malay_translation": "Daripada Khawlah binti Hakim, dia bertanya kepada Rasulullah SAW tentang wanita yang melihat dalam mimpinya apa yang dilihat oleh lelaki. Baginda bersabda: Wanita itu tidak perlu mandi melainkan jika dia mengalami orgasme, sama seperti lelaki tidak perlu mandi melainkan jika dia mengalami orgasme.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏ وَعَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏عَنْ عَلِيِّ بْنِ زَيْدٍ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، ‏‏‏‏‏‏عَنْ خَوْلَةَ بِنْتِ حَكِيمٍ، ‏‏‏‏‏‏أَنَّهَا سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْمَرْأَةِ تَرَى فِي مَنَامِهَا مَا يَرَى الرَّجُلُ؟ فَقَالَ:‏‏‏‏ لَيْسَ عَلَيْهَا غُسْلٌ حَتَّى تُنْزِلَ، ‏‏‏‏‏‏كَمَا أَنَّهُ لَيْسَ عَلَى الرَّجُلِ غُسْلٌ حَتَّى يُنْزِلَ ."
      },
      {
        "id": 24957,
        "hadith_number": "603",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Cara Penyucian Wanita Berambut Panjang daripada Najis Junub",
        "perawi_melayu": "Umm Salamah r.a.",
        "english_text": "It was narrated that Umm Salamah said: I said, O Messenger of Allah! I am a woman with tight braids. Should I undo them when I take a bath to cleanse myself from the state of sexual impurity? He said: Rather it is sufficient for you to pour three handfuls of water over yourself, and you will be purified, or he said: In that case you would have become purified.",
        "malay_translation": "Dikisahkan bahawa Umm Salamah r.a. berkata: Saya bertanya, Wahai Rasulullah! Saya seorang wanita yang mengikat rambutnya dengan erat. Adakah saya perlu melepaskan ikatan rambut ketika mandi untuk membersihkan diri daripada hadas besar? Baginda bersabda: Cukup bagi anda menuang tiga genggam air ke atas diri anda, dan anda akan suci, atau Baginda bersabda: Maka anda telah suci.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ أَيُّوبَ بْنِ مُوسَى، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ رَافِعٍ، ‏‏‏‏‏‏عَنْ أُمِّ سَلَمَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏ إِنِّي امْرَأَةٌ أَشُدُّ ضَفْرَ رَأْسِي أَفَأَنْقُضُهُ لِغُسْلِ الْجَنَابَةِ؟ فَقَالَ:‏‏‏‏ إِنَّمَا يَكْفِيكِ أَنْ تَحْثِي عَلَيْهِ ثَلَاثَ حَثَيَاتٍ مِنْ مَاءٍ، ‏‏‏‏‏‏ثُمَّ تُفِيضِي عَلَيْكِ مِنَ الْمَاءِ فَتَطْهُرِينَ أَوْ قَالَ:‏‏‏‏ فَإِذَا أَنْتِ قَدْ طَهُرْتِ ."
      },
      {
        "id": 24958,
        "hadith_number": "604",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Keanehan Perintah Membuka Rambut Wanita Ketika Mandi",
        "perawi_melayu": "Ubaid bin 'Umair",
        "english_text": "It was narrated that 'Ubaid bin 'Umair said: Aishah heard that 'Abdullah bin 'Amr was telling his wives to undo their braids (when they bathed). She said: 'How odd that Ibn 'Amr would do that! Why does he not tell them to shave their heads? The Messenger of Allah and I used to bathe from a single vessel, and I never did more than pour three handfuls of water over my head.'",
        "malay_translation": "Diceritakan bahawa Ubaid bin 'Umair berkata: Aisyah mendengar bahawa Abdullah bin 'Amr menyuruh isterinya membuka kepangan rambut mereka (apabila mereka mandi). Aisyah berkata: 'Betapa anehnya Ibn 'Amr melakukan itu! Mengapa dia tidak menyuruh mereka mencukur kepala mereka? Aku dan Rasulullah SAW pernah mandi menggunakan bekas yang sama, dan aku tidak pernah menggunakan lebih daripada tiga genggam air ke atas kepalaku.'",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا إِسْمَاعِيل ابْنُ عُلَيَّةَ، ‏‏‏‏‏‏عَنْ أَيُّوبَ، ‏‏‏‏‏‏عَنْ أَبِي الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ عُبَيْدِ بْنِ عُمَيْرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ بَلَغَ عَائِشَةَ، ‏‏‏‏‏‏أَنَّ عَبْدَ اللَّهِ بْنَ عَمْرٍو، ‏‏‏‏‏‏يَأْمُرُ نِسَاءَهُ إِذَا اغْتَسَلْنَ أَنْ يَنْقُضْنَ رُءُوسَهُنَّ، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ يَا عَجَبًا لِابْنِ عَمْرٍو هَذَا، ‏‏‏‏‏‏أَفَلَا يَأْمُرُهُنَّ أَنْ يَحْلِقْنَ رُءُوسَهُنَّ، ‏‏‏‏‏‏لَقَدْ كُنْتُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَغْتَسِلُ مِنْ إِنَاءٍ وَاحِدٍ، ‏‏‏‏‏‏فَلَا أَزِيدُ عَلَى أَنْ أُفْرِغَ عَلَى رَأْسِي ثَلَاثَ إِفْرَاغَاتٍ ."
      },
      {
        "id": 24959,
        "hadith_number": "605",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Mandi di Air Mengalir Ketika Junub",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "It was narrated from Bukair bin 'Abdullah bin Ashajj that: Abu Sa'ib, the freed slave of Hisham bin Zuhrah, told him that he heard Abu Hurairah say: The Messenger of Allah said: 'No one of you should bathe in standing water when he is sexually impure.' He (Abu Sa'ib) said: What should he do, O Abu Hurairah? He said: Let him take some out (and pour it over himself).",
        "malay_translation": "Diriwayatkan daripada Bukair bin 'Abdullah bin Ashajj bahawa: Abu Sa'ib, bekas hamba yang dibebaskan Hisham bin Zuhrah, memberitahunya bahawa dia mendengar Abu Hurairah berkata: Rasulullah SAW bersabda: 'Janganlah sesiapa di antara kamu mandi di dalam air yang mengalir ketika sedang junub.' Beliau (Abu Sa'ib) bertanya: Apakah yang perlu dilakukan, wahai Abu Hurairah? Beliau menjawab: Hendaklah dia mengambil sedikit air (dan menuangkannya ke atas dirinya sendiri).",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عِيسَى، ‏‏‏‏‏‏ وَحَرْمَلَةُ بْنُ يَحْيَى الْمِصْرِيَّانِ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا بْنُ وَهْبٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ الْحَارِثِ، ‏‏‏‏‏‏عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ، ‏‏‏‏‏‏أَنَّ أَبَا السَّائِبِ مَوْلَى هِشَامِ بْنِ زُهْرَةَ، ‏‏‏‏‏‏حَدَّثَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا يَغْتَسِلْ أَحَدُكُمْ فِي الْمَاءِ الدَّائِمِ وَهُوَ جُنُبٌ ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ كَيْفَ يَفْعَلُ يَا أَبَا هُرَيْرَةَ؟ قَالَ:‏‏‏‏ يَتَنَاوَلُهُ تَنَاوُلًا."
      },
      {
        "id": 24960,
        "hadith_number": "606",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kebolehan Melakukan Wudhuk Sebagai Pengganti Mandi Junub Jika Terburu-buru atau Terhalang",
        "perawi_melayu": "Abu Sa'id Al-Khudri",
        "english_text": "It was narrated from Abu Sa'eed Al-Khudri that: The Messenger of Allah passed by (the house of) one of the Ansar and sent word for him to come out. He came out with his head dripping and (the Prophet) said: Perhaps we made you hurry? He said: O Messenger of Allah. He said, If you are hurried (by someone) or obstructed (from orgasm) and do not ejaculate, then you do not have to take a bath, but you should perform ablution.",
        "malay_translation": "Telah diriwayatkan daripada Abu Sa'id Al-Khudri bahawa: Rasulullah SAW melewati rumah salah seorang daripada kaum Ansar dan mengutuskan pesanan baginda untuk keluar. Dia keluar dengan kepalanya menitik air dan (Rasulullah) bertanya: \"Mungkin kami telah menyebabkan kamu terburu-buru?\" Dia menjawab: \"Ya, wahai Rasulullah.\" Baginda bersabda, \"Jika kamu terburu-buru (oleh seseorang) atau terhalang (daripada klimaks) dan tidak mengalami ejakulasi, maka engkau tidak perlu mandi, tetapi engkau perlu melakukan wudhuk.\"",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا غُنْدَرٌ مُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏عَنْ شُعْبَةَ، ‏‏‏‏‏‏عَنْ الْحَكَمِ، ‏‏‏‏‏‏عَنْ ذَكْوَانَ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، ‏‏‏‏‏‏أَنَّ ّرَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ عَلَى رَجُلٍ مِنَ الْأَنْصَارِ، ‏‏‏‏‏‏فَأَرْسَلَ إِلَيْهِ فَخَرَجَ رَأْسُهُ يَقْطُرُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ لَعَلَّنَا أَعْجَلْنَاكَ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ نَعَمْ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِذَا أُعْجِلْتَ، ‏‏‏‏‏‏أَوْ أُقْحِطْتَ فَلَا غُسْلَ عَلَيْكَ، ‏‏‏‏‏‏وَعَلَيْكَ الْوُضُوءُ ."
      },
      {
        "id": 24961,
        "hadith_number": "607",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Air Mandi Untuk Air Mani",
        "perawi_melayu": "Abu Ayyub Al-Ansari r.a.",
        "english_text": "It was narrated that Abu Ayyub said: The Messenger of Allah said: 'Water (of bath) is for water (of seminal discharge).'",
        "malay_translation": "Telah diriwayatkan bahawa Abu Ayyub r.a. berkata: Rasulullah s.a.w. bersabda: 'Air mandi adalah untuk air mani.'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ دِينَارٍ، ‏‏‏‏‏‏عَنْ ابْنِ السَّائِبِ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ سُعَادَ، ‏‏‏‏‏‏عَنْ أَبِي أَيُّوبَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْمَاءُ مِنَ الْمَاءِ ."
      },
      {
        "id": 24962,
        "hadith_number": "608",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Wajib Mandi Jika Kemaluan Bersentuhan",
        "perawi_melayu": "Aisyah RA",
        "english_text": "It was narrated that 'Aishah the wife of the Prophet said: When the two circumcised parts meet, then bath is obligatory. The Messenger of Allah and I did that, and we bathed.",
        "malay_translation": "'Aisyah RA, isteri Nabi SAW, meriwayatkan, \"Apabila kedua bahagian yang dikhitan bertemu, maka mandi wajib. Aku dan Rasulullah SAW melakukannya, dan kami telah mandi.\"",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ الطَّنَافِسِيُّ، ‏‏‏‏‏‏ وَعَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، ‏‏‏‏‏‏حَدَّثَنَاالْأَوْزَاعِيُّ، ‏‏‏‏‏‏أَنْبَأَنَا عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ، ‏‏‏‏‏‏أَخْبَرَنَا الْقَاسِمُ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ:‏‏‏‏ إِذَا الْتَقَى الْخِتَانَانِ فَقَدْ وَجَبَ الْغُسْلُ، ‏‏‏‏‏‏فَعَلْتُهُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاغْتَسَلْنَا ."
      },
      {
        "id": 24963,
        "hadith_number": "609",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Rukhsah Awal Islam dan Kewajipan Mandi Kemudian",
        "perawi_melayu": "Ubayy bin Ka'b رضي الله عنه",
        "english_text": "Ubayy bin Ka'b said: That was a concession that was granted in the early days of Islam, then we were commanded to have a bathe after that.",
        "malay_translation": "Ubayy bin Ka'b رضي الله عنه berkata: Ia adalah keringanan yang diberikan pada awal Islam, kemudian kami diperintahkan untuk mandi selepas itu.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، ‏‏‏‏‏‏أَنْبَأَنَا يُونُسُ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏قَالَ، ‏‏‏‏‏‏قَالَ سَهْلُ بْنُ سَعْدٍ السَّاعِدِيُّ، ‏‏‏‏‏‏أَنْبَأَنَا أُبَيُّ بْنُ كَعْبٍ، ‏‏‏‏‏‏قَال:‏‏‏‏ إِنَّمَا كَانَتْ رُخْصَةً فِي أَوَّلِ الْإِسْلَامِ، ‏‏‏‏‏‏ثُمَّ أُمِرْنَا بِالْغُسْلِ بَعْدُ ."
      },
      {
        "id": 24964,
        "hadith_number": "610",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kewajipan Mandi Jika Bersetubuh di Antara Bahagian Tubuh Istri",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "It was narrated from Abu Hurairah that: The Messenger of Allah said: When a man sits between the four parts (arms and legs of his wife) and has intercourse, then bath is obligatory.",
        "malay_translation": "Daripada Abu Hurairah رضي الله عنه, bahawa Rasulullah SAW bersabda: Apabila seorang lelaki duduk di antara empat bahagian (lengan dan kaki isterinya) dan melakukan persetubuhan, maka mandi wajib.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ، ‏‏‏‏‏‏عَنْ هِشَامٍ الدَّسْتُوَائِيِّ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنِ الْحَسَنِ، ‏‏‏‏‏‏عَنْ أَبِي رَافِعٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِذَا جَلَسَ الرَّجُلُ بَيْنَ شُعَبِهَا الْأَرْبَعِ، ‏‏‏‏‏‏ثُمَّ جَهَدَهَا، ‏‏‏‏‏‏فَقَدْ وَجَبَ الْغُسْلُ ."
      },
      {
        "id": 24965,
        "hadith_number": "611",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Ketetapan Mandi Wajib Jika Kemaluan Bertemu dan Anggota Tersembunyi",
        "perawi_melayu": "Dari 'Amr bin Syu'aib dari bapanya, dari datuknya.",
        "english_text": "It was narrated from 'Amr bin Shu'aib from his father, that his grandfather said: The Messenger of Allah said: 'When the two circumcised parts meet, and (the tip of the penis) disappears, then bath is obligatory.'",
        "malay_translation": "Diriwayatkan daripada 'Amr bin Syu'aib daripada bapanya, bahawa datuknya berkata: Rasulullah SAW bersabda, \"Apabila kedua-dua zakar yang telah dikhitan bertemu, dan bahagian hujungnya tersembunyi, maka wajib mandi.\" ",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو مُعَاوِيَةَ، ‏‏‏‏‏‏عَنْ حَجَّاجٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا الْتَقَى الْخِتَانَانِ وَتَوَارَتِ الْحَشَفَةُ، ‏‏‏‏‏‏فَقَدْ وَجَبَ الْغُسْلُ ."
      },
      {
        "id": 24966,
        "hadith_number": "612",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Panduan Bersuci Selepas Mimpi Basah",
        "perawi_melayu": "Aishah رضي الله عنها",
        "english_text": "It was narrated from 'Aishah that: The Prophet said: If anyone of wakes up and sees some wetness, but he does not think that he had an erotic dream, let him have a bath. But if he thinks that he had an erotic dream but he does not see any wetness, then he does not have to take a bath.",
        "malay_translation": "Daripada 'Aishah رضي الله عنها, daripada Nabi SAW, disebutkan bahawa, \"Jika seseorang terjaga dari tidurnya dan melihat basah, tetapi dia tidak berfikir bahawa dia mengalami mimpi basah, maka hendaklah dia mandi. Namun, jika dia berfikir bahawa dia mengalami mimpi basah tetapi tidak melihat basah, maka dia tidak perlu mandi.\"",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ، ‏‏‏‏‏‏عَنِ الْعُمَرِيِّ، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ، ‏‏‏‏‏‏عَنِ الْقَاسِمِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِذَا اسْتَيْقَظَ أَحَدُكُمْ مِنْ نَوْمِهِ فَرَأَى بَلَلًا، ‏‏‏‏‏‏وَلَمْ يَرَ أَنَّهُ احْتَلَمَ اغْتَسَلَ، ‏‏‏‏‏‏وَإِذَا رَأَى أَنَّهُ قَدِ احْتَلَمَ، ‏‏‏‏‏‏وَلَمْ يَرَ بَلَلًا فَلَا غُسْلَ عَلَيْهِ ."
      },
      {
        "id": 24967,
        "hadith_number": "613",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Petunjuk Rasulullah SAW dalam Mandi (Wudhuk)",
        "perawi_melayu": "Abu Samh r.a. berkata:",
        "english_text": "Abu Samh said: I used to serve the Prophet, and when he wanted to take a bath he would say: 'Turn your back to me.' So I would turn my back and hung up a cloth, and concealed him with it.",
        "malay_translation": "Abu Samh r.a. berkata: Saya pernah berkhidmat kepada Rasulullah SAW. Apabila baginda ingin mandi, baginda akan bersabda, 'Palingkanlah belakangmu kepada ku.' Maka aku akan berpaling dan menggantung sehelai kain, lalu menutupinya dengan kain itu.",
        "arabic_text": "حَدَّثَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، ‏‏‏‏‏‏ وَأَبُو حَفْصٍ عَمْرُو بْنُ عَلِيٍّ الْفَلَّاسُ، ‏‏‏‏‏‏ وَمُجَاهِدُ بْنُ مُوسَى، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ حَدَّثَنَاعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ الْوَلِيدِ، ‏‏‏‏‏‏أَخْبَرَنِي مُحِلُّ بْنُ خَلِيفَةَ، ‏‏‏‏‏‏حَدَّثَنِي أَبُو السَّمْحِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنْتُ أَخْدُمُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَ إِذَا أَرَادَ أَنْ يَغْتَسِلَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَلِّنِي، ‏‏‏‏‏‏فَأُوَلِّيهِ قَفَايَ، ‏‏‏‏‏‏وَأَنْشُرُ الثَّوْبَ فَأَسْتُرُهُ بِهِ ."
      },
      {
        "id": 24968,
        "hadith_number": "614",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Solat Sunat Semasa Perjalanan Nabi SAW dan Peristiwa Penaklukan Mekah",
        "perawi_melayu": "Abdullah bin Abdullah bin Nawfal",
        "english_text": "It was narrated that 'Abdullah bin Harith bin Nawfal said: I asked whether the Messenger of Allah prayed voluntary prayer when traveling, but I could not find anyone to tell me until Umm Hani' bint Abu Talib told me that he had come during the year of the Conquest (of Makkah). He ordered that a screen be held up, and that was done, and he took a bath; then he prayed eight Rak'ah (units) of voluntary prayer.",
        "malay_translation": "Telah diriwayatkan bahawa Abdullah bin Harith bin Nawfal berkata: Saya bertanya sama ada Rasulullah SAW menunaikan solat sunat ketika dalam perjalanan, tetapi saya tidak menemui sesiapa yang dapat memberitahu saya sehingga Umm Hani binti Abu Talib memberitahu saya bahawa baginda telah tiba pada tahun penaklukan Makkah. Baginda memerintahkan agar tabir digantungkan, dan ia dilakukan, dan baginda mandi; kemudian baginda menunaikan lapan rakaat solat sunat.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ، ‏‏‏‏‏‏أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، ‏‏‏‏‏‏عَنِ ابْنِ شِهَابٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ نَوْفَلٍ، ‏‏‏‏‏‏أَنَّهُ قَالَ:‏‏‏‏ سَأَلْتُ فَلَمْ أَجِدْ أَحَدًا يُخْبِرُنِي، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَبَّحَ فِي سَفَرٍ، ‏‏‏‏‏‏حَتَّى أَخْبَرَتْنِي أُمُّ هَانِئٍ بِنْتُ أَبِي طَالِبٍ، ‏‏‏‏‏‏أَنَّهُ قَدِمَ عَامَ الْفَتْحِ، ‏‏‏‏‏‏ فَأَمَرَ بِسِتْرٍ فَسُتِرَ عَلَيْهِ فَاغْتَسَلَ، ‏‏‏‏‏‏ثُمَّ سَبَّحَ ثَمَانِيَ رَكَعَاتٍ ."
      },
      {
        "id": 24969,
        "hadith_number": "615",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Mandi di Tempat Terbuka dan Tanpa Penutup",
        "perawi_melayu": "Abdullah bin Mas'ud radhiallahu 'anhu",
        "english_text": "It was narrated that 'Abdullah bin Mas'ud said: The Messenger of Allah said: 'No one of you should bathe in open land or on a roof where he is not concealed; even if he does not see anyone, he can still be seen.'",
        "malay_translation": "Dikisahkan bahawa Abdullah bin Mas'ud r.a. berkata: Rasulullah s.a.w. bersabda: \"Janganlah sesiapa di antara kamu mandi di tempat terbuka atau di atas bumbung yang tidak tertutup; walaupun dia tidak nampak sesiapa, namun dia boleh dilihat.\" ",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ بْنِ ثَعْلَبَةَ الْحِمَّانِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْحَمِيدِ أَبُو يَحْيَى الْحِمَّانِيُّ، ‏‏‏‏‏‏حَدَّثَنَا الْحَسَنُ بْنُ عُمَارَةَ، ‏‏‏‏‏‏عَنِالْمِنْهَالِ بْنِ عَمْرٍو، ‏‏‏‏‏‏عَنْ أَبِي عُبَيْدَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا يَغْتَسِلَنَّ أَحَدُكُمْ بِأَرْضِ فَلَاةٍ، ‏‏‏‏‏‏وَلَا فَوْقَ سَطْحٍ لَا يُوَارِيهِ، ‏‏‏‏‏‏فَإِنْ لَمْ يَكُنْ يَرَى فَإِنَّهُ يُرَى ."
      },
      {
        "id": 24970,
        "hadith_number": "616",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Tatacara Mengutamakan Membuang Hajat Jika Waktu Solat Iqamah",
        "perawi_melayu": "Abdullah bin Arqam r.a. meriwayatkan",
        "english_text": "It was narrated that 'Abdullah bin Arqam said: The Messenger of Allah said: 'If anyone of you needs to defecate and the immediate call to prayer (Iqamah) is given, let him start with (relieving himself).'",
        "malay_translation": "Telah diriwayatkan bahawa Abdullah bin Arqam r.a. berkata: Rasulullah SAW bersabda, \"Jika seseorang di antara kamu memerlukan untuk membuang air besar dan azan iqamah dikumandangkan, maka hendaklah dia mulakan dengan membuang air besar terlebih dahulu.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، ‏‏‏‏‏‏أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ أَرْقَمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا أَرَادَ أَحَدُكُمُ الْغَائِطَ وَأُقِيمَتِ الصَّلَاةُ فَلْيَبْدَأْ بِهِ ."
      },
      {
        "id": 24971,
        "hadith_number": "617",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Solat Ketika Menahan Air Kencing atau Tahi",
        "perawi_melayu": "Daripada Abu Umamah",
        "english_text": "It was narrated from Abu Umamah that: The Messenger of Allah forbade a man to perform prayer when he was suppressing (the urge to urinate or defecate",
        "malay_translation": "Telah diriwayatkan daripada Abu Umamah bahawa Rasulullah SAW melarang seseorang lelaki daripada menunaikan solat ketika menahan air kencing atau najis.",
        "arabic_text": "حَدَّثَنَا بِشْرُ بْنُ آدَمَ، ‏‏‏‏‏‏حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، ‏‏‏‏‏‏حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ، ‏‏‏‏‏‏عَنِ السَّفْرِ بْنِ نُسَيْر، ‏‏‏‏‏‏عَنْ يَزِيدَ بْنِ شُرَيْحٍ، ‏‏‏‏‏‏عَنْ أَبِي أُمَامَةَ:‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُصَلِّيَ الرَّجُلُ وَهُوَ حَاقِنٌ ."
      },
      {
        "id": 24972,
        "hadith_number": "618",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Solat Dalam Keadaan Tidak Selesa",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "It was narrated that Abu Hurairah said: The Messenger of Allah said, 'No one of you should stand to pray when he feels some discomfort (because of needing to urinate or defecate).'",
        "malay_translation": "Telah diriwayatkan bahawa Abu Hurairah رضي الله عنه berkata: Rasulullah SAW bersabda, 'Janganlah sesiapa di antara kamu berdiri untuk solat ketika dia merasa tidak selesa (kerana keperluan untuk membuang air kecil atau membuang air besar).'.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو أُسَامَةَ، ‏‏‏‏‏‏عَنْ إِدْرِيسَ الْأَوْدِيِّ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا يَقُومُ أَحَدُكُمْ إِلَى الصَّلَاةِ وَبِهِ أَذًى ."
      },
      {
        "id": 24973,
        "hadith_number": "619",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Solat Ketika Mengurung Keperluan Buang Air",
        "perawi_melayu": "Thawban r.a.",
        "english_text": "It was narrated from Thawban that: The Messenger of Allah said: No one among the Muslims should stand to pray when he is suppressing (the need to urinate or defecate), until he has to relieve himself.",
        "malay_translation": "Telah diriwayatkan daripada Thawban bahawa: Rasulullah SAW bersabda, \"Janganlah sesiapa di kalangan umat Islam berdiri untuk solat sedang menahan (keperluan membuang air kecil atau besar) sehingga dia perlu melepaskannya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ، ‏‏‏‏‏‏حَدَّثَنَا بَقِيَّةُ، ‏‏‏‏‏‏عَنْ حَبِيبِ بْنِ صَالِحٍ، ‏‏‏‏‏‏عَنْ أَبِي حَيٍّ الْمُؤَذِّنِ، ‏‏‏‏‏‏عَنْ ثَوْبَانَ، ‏‏‏‏‏‏عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ:‏‏‏‏ لَا يَقُومُ أَحَدٌ مِنَ الْمُسْلِمِينَ وَهُوَ حَاقِنٌ حَتَّى يَتَخَفَّفَ ."
      },
      {
        "id": 24974,
        "hadith_number": "620",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukum Solat Semasa Haid",
        "perawi_melayu": "Fatimah binti Abi Hubaish رضي الله عنها",
        "english_text": "It was narrated from 'Urwah bin Zubair that Fatimah bint Abi Hubaish narrated to him that: She went to the Messenger of Allah and complained to him about bleeding. The Messenger of Allah said: Rather that is a vein, so look and see when your period comes, then do not perform the prayer. When the period is over, then purify yourself and perform the prayer between one period to the next.",
        "malay_translation": "Dikisahkan daripada 'Urwah bin Zubair bahawa Fatimah binti Abi Hubaish telah menceritakan kepadanya bahawa: Beliau telah mengadu kepada Rasulullah SAW mengenai pendarahan. Rasulullah SAW bersabda: 'Itu hanyalah urat, jadi perhatikanlah apabila datang haid, maka janganlah engkau solat. Apabila haid selesai, maka bersihkan diri dan solatlah antara satu tempoh haid ke tempoh haid yang berikutnya.'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، ‏‏‏‏‏‏أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، ‏‏‏‏‏‏عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، ‏‏‏‏‏‏عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ الْمُنْذِرِ بْنِ الْمُغِيرَةِ، ‏‏‏‏‏‏عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، ‏‏‏‏‏‏أَنَّ فَاطِمَةَ بِنْتَ أَبِي حُبَيْشٍ، ‏‏‏‏‏‏حَدَّثَتْهُ أَنَّهَا أَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَشَكَتْ إِلَيْهِ الدَّمَ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّمَا ذَلِكَ عِرْقٌ، ‏‏‏‏‏‏فَانْظُرِي إِذَا أَتَى قَرْؤُكِ فَلَا تُصَلِّي، ‏‏‏‏‏‏فَإِذَا مَرَّ الْقَرْءُ فَتَطَهَّرِي، ‏‏‏‏‏‏ثُمَّ صَلِّي مَا بَيْنَ الْقَرْءِ إِلَى الْقَرْءِ ."
      },
      {
        "id": 24975,
        "hadith_number": "621",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Panduan Solat Bagi Wanita Yang Mengalami Pendarahan Tidak Normal",
        "perawi_melayu": "Aishah رضي الله عنها",
        "english_text": "It was narrated that 'Aishah said: Fatimah bint Abi Hubaish came to the Messenger of Allah and said: 'O Messenger of Allah! I am a woman who bleeds continuously and never becomes pure, should I give up the prayer?' He said: 'No, rather that is a vein and it is not menstruation. When the time of your period comes, leave off the prayer, and when it is over, take a bath and wash the blood from yourself and perform the prayer. This is the Hadith of Waki'.",
        "malay_translation": "Telah diriwayatkan bahawa Aishah رضي الله عنها berkata: Fatimah binti Abi Hubaish datang kepada Rasulullah SAW dan berkata: 'Wahai Rasulullah! Saya seorang wanita yang mengalami pendarahan yang berterusan dan tidak pernah suci, patutkah saya meninggalkan solat?' Baginda menjawab: 'Tidak, itu bukan haid tetapi urat. Apabila tiba waktu haid, tinggalkan solat, dan apabila selesai, mandi dan cuci darah dari diri anda dan tunaikan solat. Hadis ini daripada Waki'.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْجَرَّاحِ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ . ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏ وَعَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ جَاءَتْ فَاطِمَةُ بِنْتُ أَبِي حُبَيْشٍ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِنِّي امْرَأَةٌ أُسْتَحَاضُ فَلَا أَطْهُرُ أَفَأَدَعُ الصَّلَاةَ؟ قَالَ:‏‏‏‏ لَا إِنَّمَا ذَلِكِ عِرْقٌ، ‏‏‏‏‏‏وَلَيْسَ بِالْحَيْضَةِ، ‏‏‏‏‏‏فَإِذَا أَقْبَلَتِ الْحَيْضَةُ فَدَعِي الصَّلَاةَ، ‏‏‏‏‏‏وَإِذَا أَدْبَرَتْ فَاغْسِلِي عَنْكِ الدَّمَ وَصَلِّي ، ‏‏‏‏‏‏هَذَا حَدِيثُ وَكِيعٍ."
      },
      {
        "id": 24976,
        "hadith_number": "622",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Petua Mengatasi Masalah Haid Yang Berterusan",
        "perawi_melayu": "Umm Habibah binti Jahsh r.a.",
        "english_text": "It was narrated that Umm Habibah bint Jahsh said: I used to bleed continuously and heavily. I went to the Prophet asking him for advice and telling him (about my situation). I found him with my sister Zainab and said: 'o Messenger of Allah! I need to ask you something.' He said: 'What is it?' I said: 'I bleed continuously and heavily, and that is keeping me from prayer and fasting. What do you command me to do about it?' He said: 'I advise you to use a piece of cotton, for that will take away the blood.' I said: 'It is more than that.' And he mentioned something like the Hadith of Sharik (below).",
        "malay_translation": "Dikisahkan bahawa Umm Habibah binti Jahsh r.a. berkata: Saya pernah mengalami pendarahan haid yang banyak dan berterusan. Saya menemui Rasulullah s.a.w. untuk meminta nasihat dan menceritakan keadaan saya. Saya menjumpainya bersama adik perempuan saya, Zainab, dan berkata: 'Wahai Rasulullah s.a.w., saya ada satu permintaan.' Baginda bertanya: 'Apa itu?' Saya menjawab: 'Saya mengalami pendarahan haid yang banyak dan berterusan, dan ini menghalang saya daripada menunaikan solat dan berpuasa. Apakah yang harus saya lakukan?' Baginda menasihatkan: 'Saya menasihatkan anda menggunakan secebis kapas, kerana ia dapat menghilangkan darah tersebut.' Saya berkata: 'Lebih daripada itu.' Kemudian baginda menyebut sesuatu yang serupa dengan hadis daripada Sharik (di bawah).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّزَّاقِ إِمْلَاءً عَلَيَّ مِنْ كِتَابِهِ وَكَانَ السَّائِلُ غَيْرِي، ‏‏‏‏‏‏أَنْبَأَنَا ابْنُ جُرَيْجٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ طَلْحَةَ، ‏‏‏‏‏‏عَنْ عُمَرَ بْنِ طَلْحَةَ، ‏‏‏‏‏‏عَنْ أُمِّ حَبِيبَةَ بِنْتِ جَحْشٍ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كُنْتُ أُسْتَحَاضُ حَيْضَةً كَثِيرَةً طَوِيلَةً، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ فَجِئْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْتَفْتِيهِ وَأُخْبِرُهُ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ فَوَجَدْتُهُ عِنْدَ أُخْتِي زَيْنَبَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِنَّ لِي إِلَيْكَ حَاجَةً، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَمَا هِيَ أَيْ هَنْتَاهُ ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ إِنِّي أُسْتَحَاضُ حَيْضَةً طَوِيلَةً كَبِيرَةً وَقَدْ مَنَعَتْنِي الصَّلَاةَ وَالصَّوْمَ، ‏‏‏‏‏‏فَمَا تَأْمُرُنِي فِيهَا؟ قَالَ:‏‏‏‏ أَنْعَتُ لَكِ الْكُرْسُفَ فَإِنَّهُ يُذْهِبُ الدَّمَ ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ هُوَ أَكْثَرُ. فَذَكَرَ نَحْوَ حَدِيث شَرِيكٍ."
      },
      {
        "id": 24977,
        "hadith_number": "623",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Panduan Wanita yang Mengalami Perdarahan Berterusan semasa Solat",
        "perawi_melayu": "Umm Salamah r.a.",
        "english_text": "It was narrated that Umm Salamah said: A woman asked the Prophet: 'I bleed continuously and I do not become pure. Should I give up the prayer?' He said: 'No, but leave off praying for the number of days and nights that used to menstruate.' (One of the narrators) Abu Bakr (Ibn Abu Shaibah) said in this Hadith: Estimate the number of days in the month, then take a bath and cover your private part with a cloth and perform prayer",
        "malay_translation": "Dikisahkan bahawa Umm Salamah r.a. berkata: Seorang wanita bertanya kepada Nabi SAW, 'Saya mengalami perdarahan yang berterusan dan tidak suci. Patutkah saya berhenti menunaikan solat?' Baginda menjawab, 'Tidak, tetapi berhentilah menunaikan solat selama tempoh hari dan malam yang anda biasa mengalami haid.' (Salah seorang perawi) Abu Bakr (Ibn Abu Shaibah) dalam hadis ini berkata: Kira bilangan hari dalam sebulan, kemudian mandi wajib, tutup bahagian sulit dengan kain, dan tunaikan solat.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏ وَعَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا أَبُو أُسَامَةَ، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنْسُلَيْمَانَ بْنِ يَسَارٍ، ‏‏‏‏‏‏عَنْ أُمِّ سَلَمَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ سَأَلَتِ امْرَأَةٌ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ:‏‏‏‏ إِنِّي أُسْتَحَاضُ فَلَا أَطْهُرُ أَفَأَدَعُ الصَّلَاةَ؟ قَالَ:‏‏‏‏ لَا، ‏‏‏‏‏‏وَلَكِنْ دَعِي قَدْرَ الْأَيَّامِ وَاللَّيَالِي الَّتِي كُنْتِ تَحِيضِينَ ، ‏‏‏‏‏‏قَالَ أَبُو بَكْرٍ فِي حَدِيثِهِ:‏‏‏‏ وَقَدْرَهُنَّ مِنَ الشَّهْرِ، ‏‏‏‏‏‏ثُمَّ اغْتَسِلِي، ‏‏‏‏‏‏وَاسْتَثْفِرِي بِثَوْبٍ وَصَلِّي ."
      },
      {
        "id": 24978,
        "hadith_number": "624",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukum Solat Wanita Yang Mengalami Pendarahan Berterusan",
        "perawi_melayu": "Aishah r.a.",
        "english_text": "It was narrated that 'Aishah said: Fatimah bint Abi Hubaish came to the Prophet: 'O Messenger of Allah! I am a woman who bleeds continuously and never becomes pure. Should I give up prayer?' he said: 'No, that is just a vein and is not menstruation. Do not perform prayer during the days of your period, then take a bath, and perform ablution for each prayer, even if drops of blood fall on the mat.'",
        "malay_translation": "Dikisahkan bahawa 'Aishah r.a. berkata: Fatimah binti Abi Hubaish datang menemui Rasulullah SAW.  Katanya, \"Wahai Rasulullah SAW, saya seorang wanita yang mengalami pendarahan berterusan dan tidak pernah suci. Patutkah saya tinggalkan solat?\" Baginda menjawab, \"Tidak.  Itu hanyalah urat, bukan haid. Jauhi solat semasa tempoh haid anda, kemudian mandi wajib, dan berwudhuk untuk setiap solat, walaupun darah menitik ke atas tikar.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنِ الْأَعْمَشِ، ‏‏‏‏‏‏عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، ‏‏‏‏‏‏عَنْعُرْوَةَ بْنِ الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ جَاءَتْ فَاطِمَةُ بِنْتُ أَبِي حُبَيْشٍ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِنِّي امْرَأَةٌ أُسْتَحَاضُ فَلَا أَطْهُرُ أَفَأَدَعُ الصَّلَاةَ؟ قَالَ:‏‏‏‏ لَا إِنَّمَا ذَلِكِ عِرْقٌ وَلَيْسَتْ بِالْحَيْضَةِ اجْتَنِبِي الصَّلَاةَ أَيَّامَ مَحِيضِكِ، ‏‏‏‏‏‏ثُمَّ اغْتَسِلِي، ‏‏‏‏‏‏وَتَوَضَّئِي لِكُلِّ صَلَاةٍ وَإِنْ قَطَرَ الدَّمُ عَلَى الْحَصِيرِ ."
      },
      {
        "id": 24979,
        "hadith_number": "625",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukum Solat dan Puasa Wanita yang Mengalami Perdarahan Tidak Haid",
        "perawi_melayu": "Dari 'Adiyy bin Thabit, dari bapanya, dari datuknya, daripada Nabi SAW.",
        "english_text": "It was narrated from 'Adiyy bin Thabit, from his father, from his grandfather, that: The Prophet said: The woman who experiences irregular non-menstrual bleeding should leave prayer during the days of her period, then she should take a bath, and perform ablution for each prayer, and she should fast and perform the prayer.",
        "malay_translation": "Dikisahkan daripada 'Adiyy bin Thabit, daripada bapanya, daripada datuknya, bahawa Rasulullah SAW bersabda: Wanita yang mengalami pendarahan luar biasa bukan haid hendaklah meninggalkan solat semasa tempoh pendarahan itu, kemudian dia perlu mandi wajib, dan berwuduk untuk setiap solat, dan dia hendaklah berpuasa dan menunaikan solat.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏ وَإِسْمَاعِيل بْنُ مُوسَى، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا شَرِيكٌ، ‏‏‏‏‏‏عَنْ أَبِي الْيَقْظَانِ، ‏‏‏‏‏‏عَنْ عَدِيِّ بْنِ ثَابِتٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ الْمُسْتَحَاضَةُ تَدَعُ الصَّلَاةَ أَيَّامَ أَقْرَائِهَا، ‏‏‏‏‏‏ثُمَّ تَغْتَسِلُ، ‏‏‏‏‏‏وَتَتَوَضَّأُ لِكُلِّ صَلَاةٍ، ‏‏‏‏‏‏وَتَصُومُ، ‏‏‏‏‏‏وَتُصَلِّي"
      },
      {
        "id": 24980,
        "hadith_number": "626",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Penjelasan Mengenai Perdarahan Bukan Haid dan Cara Menjalankan Solat",
        "perawi_melayu": "Urwah bin Zubair dan 'Amrah binti 'Abdur-Rahman",
        "english_text": "It was narrated from 'Urwah bin Zubair and 'Amrah bint 'Abdur-Rahman that : 'Aishah the wife of the Prophet said: Umm Habibah Jahsh experienced prolonged non-menstrual bleeding for seven years when she was married to 'Abdur-Rahman bin 'Awf. She complained about that to the Prophet and the Prophet said: 'That is not menstruation, rather it is a vein, so when the time of your period comes, leave the prayer, and when it is over, take a bath and perform prayer.' 'Aishah said: She used to bathe for every prayer and then perform the prayer. She used to sit in a washtub belonging to her sister Zainab bint Jahsh and the blood would turn the water red.",
        "malay_translation": "Dikisahkan daripada Urwah bin Zubair dan 'Amrah binti 'Abdur-Rahman bahawa: 'Aishah, isteri Nabi SAW, berkata: Umm Habibah Jahsh mengalami pendarahan yang berpanjangan selama tujuh tahun ketika beliau berkahwin dengan 'Abdur-Rahman bin 'Awf. Beliau mengadu hal ini kepada Nabi SAW dan baginda bersabda: 'Itu bukanlah haid, tetapi ia adalah urat darah. Oleh itu, apabila waktu haid tiba, tinggalkan solat, dan apabila ia sudah habis, mandilah dan lakukan solat.' 'Aishah berkata: Beliau (Umm Habibah) akan mandi untuk setiap solat dan kemudian mengerjakan solat. Beliau duduk di dalam baldi milik kakaknya, Zainab binti Jahsh, dan darah akan menjadikan air itu berwarna merah.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا أَبُو الْمُغِيرَةِ، ‏‏‏‏‏‏حَدَّثَنَا الْأَوْزَاعِيُّ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، ‏‏‏‏‏‏ وَعَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ:‏‏‏‏ اسْتُحِيضَتْ أُمُّ حَبِيبَةَ بِنْتُ جَحْشٍ وَهِيَ تَحْتَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ سَبْعَ سِنِينَ، ‏‏‏‏‏‏فَشَكَتْ ذَلِكَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ هَذِهِ لَيْسَتْ بِالْحَيْضَةِ، ‏‏‏‏‏‏وَإِنَّمَا هُوَ عِرْقٌ، ‏‏‏‏‏‏فَإِذَا أَقْبَلَتِ الْحَيْضَةُ فَدَعِي الصَّلَاةَ، ‏‏‏‏‏‏وَإِذَا أَدْبَرَتْ فَاغْتَسِلِي وَصَلِّي ، ‏‏‏‏‏‏قَالَتْ عَائِشَةُ:‏‏‏‏ فَكَانَتْ تَغْتَسِلُ لِكُلِّ صَلَاةٍ، ‏‏‏‏‏‏ثُمَّ تُصَلِّي، ‏‏‏‏‏‏وَكَانَتْ تَقْعُدُ فِي مِرْكَنٍ لِأُخْتِهَا زَيْنَبَ بِنْتِ جَحْشٍ، ‏‏‏‏‏‏حَتَّى إِنَّ حُمْرَةَ الدَّمِ لَتَعْلُو الْمَاءَ"
      },
      {
        "id": 24981,
        "hadith_number": "627",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Panduan Mengendalikan Haid yang Berpanjangan",
        "perawi_melayu": "Daripada Hamnah binti Jahsh رضي الله عنها",
        "english_text": "It was narrated from Hamnah bint Jahsh that: She experienced prolonged non-menstrual bleeding during the time of the Messenger of Allah. She came to the Messenger of Allah and said: I am suffering prolonged and painful bleeding. He said: Fill it with a pad of cloth. She said: It is worse than that, it is flowing copiously. He said: Then bind yourself with a cloth and observe your menses for six or seven days, in the knowledge of Allah, then have a bath and perform prayer and fast for twenty-three or twenty-four days. Delay Zuhr and bring 'Asr forward, and take (one) bath for both, and delay Maghrib and bring 'Isha' forward, and have (one) bath for both. That is what I prefer of the two matters.'",
        "malay_translation": "Diceritakan daripada Hamnah binti Jahsh رضي الله عنها bahawa baginda pernah mengalami pendarahan luar biasa yang berpanjangan pada zaman Rasulullah SAW. Baginda mendatangi Rasulullah SAW dan berkata: \"Aku mengalami pendarahan yang berpanjangan dan menyakitkan.\" Baginda menjawab: \"Pakai kain lap.\" Hamnah berkata: \"Lebih teruk daripada itu, pendarahannya sangat banyak.\" Baginda bersabda: \"Kemudian ikat dirimu dengan kain dan perhatikan tempoh haid selama enam atau tujuh hari, dengan ilmu Allah, kemudian mandi dan solat serta berpuasa selama dua puluh tiga atau dua puluh empat hari. Tangguhkan solat Zuhur dan percepatkan solat Asar, dan mandi sekali untuk kedua-duanya. Tangguhkan solat Maghrib dan percepatkan solat Isyak, dan mandi sekali untuk kedua-duanya. Itulah yang aku lebih suka daripada kedua-dua perkara ini.\"",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، ‏‏‏‏‏‏أَنْبَأَنَا شَرِيكٌ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، ‏‏‏‏‏‏عَنْإِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ طَلْحَةَ، ‏‏‏‏‏‏عَنْ عَمِّهِ عِمْرَانَ بْنِ طَلْحَةَ، ‏‏‏‏‏‏عَنْ أُمِّهِ حَمْنَةَ بِنْتِ جَحْشٍ، ‏‏‏‏‏‏أَنَّهَا اسْتُحِيضَتْ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَأَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ إِنِّي اسْتُحِضْتُ حَيْضَةً مُنْكَرَةً شَدِيدَةً، ‏‏‏‏‏‏قَالَ لَهَا:‏‏‏‏ احْتَشِي كُرْسُفًا ، ‏‏‏‏‏‏قَالَتْ لَهُ:‏‏‏‏ إِنَّهُ أَشَدُّ مِنْ ذَلِكَ إِنِّي أَثُجُّ ثَجًّا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ تَلَجَّمِي وَتَحَيَّضِي فِي كُلِّ شَهْرٍ فِي عِلْمِ اللَّهِ سِتَّةَ أَيَّامٍ، ‏‏‏‏‏‏أَوْ سَبْعَةَ أَيَّامٍ، ‏‏‏‏‏‏ثُمَّ اغْتَسِلِي غُسْلًا فَصَلِّي وَصُومِي ثَلَاثَةً وَعِشْرِينَ، ‏‏‏‏‏‏أَوْ أَرْبَعَةً وَعِشْرِينَ، ‏‏‏‏‏‏وَأَخِّرِي الظُّهْرَ وَقَدِّمِي الْعَصْرَ، ‏‏‏‏‏‏وَاغْتَسِلِي لَهُمَا غُسْلًا، ‏‏‏‏‏‏وَأَخِّرِي الْمَغْرِبَ وَعَجِّلِي الْعِشَاءَ، ‏‏‏‏‏‏وَاغْتَسِلِي لَهُمَا غُسْلًا، ‏‏‏‏‏‏وَهَذَا أَحَبُّ الْأَمْرَيْنِ إِلَيَّ ."
      },
      {
        "id": 24982,
        "hadith_number": "628",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Cara Membersihkan Darah Haid yang Menempel di Pakaian",
        "perawi_melayu": "Umm Qais binti Mihsan r.a.",
        "english_text": "It was narrated that Umm Qais bint Mihsan said: I asked the Messenger of Allah about menstrual blood that gets on clothing. He said, 'Wash it with water and lote leaves, and rub it, even with a piece of stick.'",
        "malay_translation": "Dikisahkan bahawa Umm Qais binti Mihsan berkata: Saya bertanya kepada Rasulullah tentang darah haid yang menempel pada pakaian. Baginda bersabda, 'Basuhlah dengan air dan daun sidr, kemudian gosok, walaupun menggunakan sebatang kayu.'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ‏‏‏‏‏‏ وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ ثَابِتِ بْنِ هُرْمُزَ أَبِي الْمِقْدَامِ، ‏‏‏‏‏‏عَنْ عَدِيِّ بْنِ دِينَارٍ، ‏‏‏‏‏‏عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ دَمِ الْحَيْضِ يُصِيبُ الثَّوْبَ؟ قَالَ:‏‏‏‏ اغْسِلِيهِ بِالْمَاءِ، ‏‏‏‏‏‏وَالسِّدْرِ، ‏‏‏‏‏‏وَحُكِّيهِ وَلَوْ بِضِلَعٍ ."
      },
      {
        "id": 24983,
        "hadith_number": "629",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Tindakan Terhadap Darah Haid yang Melekat pada Pakaian",
        "perawi_melayu": "Asma' binti Abi Bakr al-Siddiq رضي الله عنهما",
        "english_text": "It was narrated that Asma' bint Abi Bakr said: The Messenger of Allah was asked about menstrual blood that gets on clothing. He said: 'Rub it off, wash it and perform prayer in (the garment).'",
        "malay_translation": "Dikisahkan bahawa Asma' binti Abi Bakr رضي الله عنهما berkata: Rasulullah SAW ditanya tentang darah haid yang melekat pada pakaian. Baginda menjawab: \"Gosokkan ia, basuh dan solatlah di dalam (pakaian tersebut).\"",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ، ‏‏‏‏‏‏عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ الصِّدِّيقِ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ دَمِ الْحَيْضِ يَكُونُ فِي الثَّوْبِ؟ قَالَ:‏‏‏‏ اقْرُصِيهِ وَاغْسِلِيهِ وَصَلِّي فِيهِ ."
      },
      {
        "id": 24984,
        "hadith_number": "630",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Cara Membersihkan Baju Selepas Haid",
        "perawi_melayu": "Aisha isteri Nabi SAW",
        "english_text": "It was narrated that 'Aisha the wife of the Prophet said: One of us used to menstruate, then rub the blood off her garment when she became pure again, and wash it, and sprinkle water over the rest of the garment, then perform prayer in it.",
        "malay_translation": "Telah diriwayatkan bahawa 'Aisha, isteri Nabi SAW, berkata: Sesungguhnya di antara kita ada yang mengalami haid, kemudian membersihkan darah daripada pakaiannya apabila suci, dan mencucinya, serta menyiramkan air ke seluruh pakaian tersebut, kemudian mengerjakan solat di dalam pakaian itu.",
        "arabic_text": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ وَهْبٍ، ‏‏‏‏‏‏أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏أَنَّهَا قَالَتْ:‏‏‏‏ إِنْ كَانَتْ إِحْدَانَا لَتَحِيضُ، ‏‏‏‏‏‏ثُمَّ تَقْتَنِصُ الدَّمَ مِنْ ثَوْبِهَا عِنْدَ طُهْرِهَا فَتَغْسِلُهُ، ‏‏‏‏‏‏وَتَنْضَحُ عَلَى سَائِرِهِ، ‏‏‏‏‏‏ثُمَّ تُصَلِّي فِيهِ ."
      },
      {
        "id": 24985,
        "hadith_number": "631",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukum Solat Wanita Haid mengikut Hadis",
        "perawi_melayu": "Aishah رضي الله عنها",
        "english_text": "It was narrated from 'Aishah that: A woman asked her: Does a woman who menstruates have to make up for the prayers she misses? 'Aisha said to her: Are you a Haruriyyah? We used to menstruate with the Prophet and then become pure, and he did not tell us to make up for the prayers we missed.",
        "malay_translation": "Telah diriwayatkan daripada 'Aishah رضي الله عنها bahawa: Seorang wanita bertanya kepadanya: Adakah wanita yang haid perlu mengganti solat yang ditinggalkan? 'Aishah menjawab kepadanya: Adakah engkau seorang Haruriyyah? Kami pernah mengalami haid ketika bersama Nabi saw, kemudian suci, dan Baginda tidak memerintahkan kami untuk mengganti solat yang ditinggalkan.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ مُعَاذَةَ الْعَدَوِيَّةِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏أَنَّ امْرَأَةً سَأَلَتْهَا أَتَقْضِي الْحَائِضُ الصَّلَاةَ؟ قَالَتْ لَهَا عَائِشَةُ:‏‏‏‏ أَحَرُورِيَّةٌ أَنْتِ؟ قَدْ كُنَّا نَحِيضُ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏ثُمَّ نَطْهُرُ وَلَمْ يَأْمُرْنَا بِقَضَاءِ الصَّلَاةِ ."
      },
      {
        "id": 24986,
        "hadith_number": "632",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Pesanan Rasulullah SAW Mengenai Haid dan Kewajipan",
        "perawi_melayu": "Aishah رضي الله عنها",
        "english_text": "It was narrated that 'Aishah said: The Messenger of Allah said to me: 'Get me a mat from the mosque.' I said: 'I am menstruating.' He said: 'Your menstruation is not in your hand.'",
        "malay_translation": "Diriwayatkan bahawa Aishah رضي الله عنها berkata: Rasulullah SAW bersabda kepadaku, 'Ambilkan tikar dari masjid untukku.' Aku berkata, 'Aku sedang haid.' Baginda bersabda, 'Haidmu bukan di tanganmu.'",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو الْأَحْوَصِ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنْ الْبَهِيِّ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ، ‏‏‏‏‏‏قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ نَاوِلِينِي الْخُمْرَةَ مِنَ الْمَسْجِدِ ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ إِنِّي حَائِضٌ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ لَيْسَتْ حَيْضَتُكِ فِي يَدِكِ ."
      },
      {
        "id": 24987,
        "hadith_number": "633",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Perlakuan Nabi SAW Ketika Berihram dan Haid",
        "perawi_melayu": "Aishah رضي الله عنها",
        "english_text": "It was narrated that 'Aishah said: The Prophet used to bring his head close to me when I was menstruating and he was in I'tikaf (seclusion in a mosques for the purpose of worship), and I would wash it and comb his hair",
        "malay_translation": "Diriwayatkan bahawa 'Aishah رضي الله عنها berkata: Nabi SAW akan mendekatkan kepalanya kepadaku ketika aku sedang haid dan baginda sedang berI'tikaf (menetap di masjid untuk beribadah), dan aku akan membasuh dan menyisir rambutnya.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏ وَعَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُدْنِي رَأْسَهُ إِلَيَّ وَأَنَا حَائِضٌ، ‏‏‏‏‏‏وَهُوَ مُجَاوِرٌ تَعْنِي:‏‏‏‏ مُعْتَكِفًا، ‏‏‏‏‏‏فَأَغْسِلُهُ، ‏‏‏‏‏‏وَأُرَجِّلُهُ ."
      },
      {
        "id": 24988,
        "hadith_number": "634",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Rasulullah SAW Meletakkan Kepala di Pangkuan Aisyah Saat Haid dan Membaca Al-Quran",
        "perawi_melayu": "Aisyah رضي الله عنها",
        "english_text": "It was narrated that 'Aishah said: The Messenger of Allah used to put his head in my lap when I was menstruating and recite Qur'an.",
        "malay_translation": "Dikisahkan bahawa 'Aisyah رضي الله عنها berkata: Rasulullah SAW pernah meletakkan kepalanya di pangkuanku ketika aku sedang haid dan membacakan Al-Quran.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَنْبَأَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ مَنْصُورِ بْنِ صَفِيَّةَ، ‏‏‏‏‏‏عَنْ أُمِّهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ لَقَدْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَضَعُ رَأْسَهُ فِي حِجْرِي وَأَنَا حَائِضٌ، ‏‏‏‏‏‏وَيَقْرَأُ الْقُرْآنَ ."
      },
      {
        "id": 24989,
        "hadith_number": "635",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Tindakan Rasulullah SAW terhadap Wanita Haid dan Pengawalan Nafsu",
        "perawi_melayu": "Aishah رضي الله عنها",
        "english_text": "It was narrated that 'Aishah said: If one of us was menstruating, the Messenger of Allah would tell her to tie her waist-wrapper around herself if the bleeding was heavy, then he would embrace her. And who among you can control his desire as the Messenger of Allah used to control his desire?",
        "malay_translation": "Telah diriwayatkan bahawa 'Aisyah رضي الله عنها berkata: Jika salah seorang daripada kita sedang haid, Rasulullah SAW akan memberitahunya untuk mengikat serban pinggangnya jika pendarahannya banyak, kemudian beliau akan merangkulnya. Dan siapakah di antara kamu yang dapat mengawal nafsunya seperti Rasulullah SAW yang biasa mengawal nafsunya?",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْجَرَّاحِ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو الْأَحْوَصِ، ‏‏‏‏‏‏عَنْ عَبْدِ الْكَرِيمِ . ح وحَدَّثَنَا أَبُو سَلَمَةَ يَحْيَى بْنُ خَلَفٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْأَعْلَى، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ إِسْحَاق . ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، ‏‏‏‏‏‏عَنْالشَّيْبَانِيِّ جَمِيعًا، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَتْ إِحْدَانَا إِذَا كَانَتْ حَائِضًا، ‏‏‏‏‏‏أَمَرَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تَأْتَزِرَ فِي فَوْرِ حَيْضَتِهَا، ‏‏‏‏‏‏ثُمَّ يُبَاشِرُهَا، ‏‏‏‏‏‏وَأَيُّكُمْ يَمْلِكُ إِرْبَهُ كَمَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْلِكُ إِرْبَهُ ."
      },
      {
        "id": 24990,
        "hadith_number": "636",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Tindakan Rasulullah SAW Terhadap Wanita Haid",
        "perawi_melayu": "Aishah r.a.",
        "english_text": "It was narrated that 'Aishah said: If one of us was menstruating, the Messenger of Allah would tell her to tie her waist-wrapper around herself, then he would embrace her.",
        "malay_translation": "Dikisahkan bahawa 'Aishah r.a. berkata: Jika salah seorang daripada kita sedang mengalami haid, Rasulullah SAW akan menyuruhnya memakai kain pelikat, kemudian beliau akan memeluknya.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا جَرِيرٌ، ‏‏‏‏‏‏عَنْ مَنْصُورٍ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنِ الْأَسْوَدِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَتْ إِحْدَانَا إِذَا حَاضَتْ أَمَرَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تَأْتَزِرَ بِإِزَارٍ، ‏‏‏‏‏‏ثُمَّ يُبَاشِرُهَا ."
      },
      {
        "id": 24991,
        "hadith_number": "637",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Perintah Nabi SAW Tentang Haid dan kembali ke Lantakan",
        "perawi_melayu": "Umm Salamah r.a.",
        "english_text": "It was narrated that Umm Salamah said: I was with the Messenger of Allah under his blanket, then I felt that I was menstruating as women do, so I slipped out from under the cover. The Messenger of Allah said: 'Are you menstruating?' I said: 'I feel that I am menstruating as women do.' He said: 'That is what Allah has decreed for the daughters of Adam.' So I slipped out and sorted myself out, then I came back, and the Messenger of Allah said to me: 'Come under the cover with me,' so I went in with him.'",
        "malay_translation": "Diceritakan bahawa Umm Salamah r.a. berkata: Saya bersama Rasulullah SAW di bawah selimutnya, kemudian saya merasakan saya sedang mengalami haid seperti wanita lain, maka saya keluar dari bawah selimut itu. Rasulullah SAW bertanya, \"Adakah kamu sedang haid?\" Saya menjawab, \"Saya merasakan saya sedang mengalami haid seperti wanita lain.\" Baginda SAW menjawab, \"Itulah yang telah ditetapkan Allah SWT bagi anak perempuan Adam.\" Maka saya keluar, membersihkan diri, dan kemudian kembali. Rasulullah SAW bersabda kepada saya, \"Mari masuk ke dalam selimut bersamaku,\" lalu saya masuk bersama Baginda.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو، ‏‏‏‏‏‏حَدَّثَنَا أَبُو سَلَمَةَ، ‏‏‏‏‏‏عَنْ أُمِّ سَلَمَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كُنْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي لِحَافِهِ، ‏‏‏‏‏‏فَوَجَدْتُ مَا تَجِدُ النِّسَاءُ مِنَ الْحَيْضَةِ، ‏‏‏‏‏‏فَانْسَلَلْتُ مِنَ اللِّحَافِ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَنَفِسْتِ ؟ قُلْتُ:‏‏‏‏ وَجَدْتُ مَا تَجِدُ النِّسَاءُ مِنَ الْحَيْضَةِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ذَلِكِ مَا كَتَبَ اللَّهُ عَلَى بَنَاتِ آدَمَ ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ فَانْسَلَلْتُ فَأَصْلَحْتُ مِنْ شَأْنِي، ‏‏‏‏‏‏ثُمَّ رَجَعْتُ، ‏‏‏‏‏‏فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ تَعَالَيْ فَادْخُلِي مَعِي فِي اللِّحَافِ ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ فَدَخَلْتُ مَعَهُ."
      },
      {
        "id": 24992,
        "hadith_number": "638",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Tuntutan Wanita Haid Ketika Bersama Nabi SAW",
        "perawi_melayu": "Mu'awiyah bin Abu Sufyan",
        "english_text": "It was narrated from Mu'awiyah bin Abu Sufyan that : He asked Umm Habibah, the wife of the Prophet: What did you used to do with the Messenger of Allah when you were menstruating? She said: If it was at the beginning of the period when the bleeding is heavy, we would tie the waist-wrapper tightly around our thighs, then lie down with the Messenger of Allah.",
        "malay_translation": "Diceritakan daripada Mu'awiyah bin Abu Sufyan bahawa: Beliau bertanya kepada Umm Habibah, isteri Nabi SAW, \"Apakah yang kamu lakukan bersama Rasulullah SAW ketika kamu sedang haid?\"  Umm Habibah menjawab, \"Jika ia adalah pada permulaan haid, di mana pendarahan masih banyak, kami akan mengikat kain pinggang dengan erat di sekitar paha, kemudian berbaring bersama Rasulullah SAW.\"",
        "arabic_text": "حَدَّثَنَا الْخَلِيلُ بْنُ عَمْرٍو، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ سَلَمَةَ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ إِسْحَاق، ‏‏‏‏‏‏عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، ‏‏‏‏‏‏عَنْ سُوَيْدِ بْنِ قَيْسٍ، ‏‏‏‏‏‏عَنْ مُعَاوِيَةَ بْنِ حُدَيْجٍ، ‏‏‏‏‏‏عَنْ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ، ‏‏‏‏‏‏عَنْ أُمِّ حَبِيبَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ سَأَلْتُهَا كَيْفَ كُنْتِ تَصْنَعِينَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْحَيْضَةِ؟ قَالَتْ:‏‏‏‏ كَانَتْ إِحْدَانَا فِي فَوْرِهَا أَوَّلَ مَا تَحِيضُ تَشُدُّ عَلَيْهَا إِزَارًا إِلَى أَنْصَافِ فَخِذَيْهَا، ‏‏‏‏‏‏ثُمَّ تَضْطَجِعُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ."
      },
      {
        "id": 24993,
        "hadith_number": "639",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Berhubungan dengan Wanita Haid, Wanita dalam Keadaan Dhob, atau Peramal",
        "perawi_melayu": "Abu Hurairah r.a.",
        "english_text": "It was narrated that Abu Hurairah said: The Messenger of Allah said: 'Whoever has intercourse with a menstruating woman, or with a woman in her rear, or who goes to a fortuneteller and believes what he says, he has disbelieved in that which was revealed to Muhammad.'",
        "malay_translation": "Telah diriwayatkan bahawa Abu Hurairah r.a. berkata: Rasulullah SAW bersabda, 'Sesiapa yang melakukan hubungan seksual dengan wanita haid, atau dengan wanita dalam keadaan dhob, atau yang pergi kepada peramal dan mempercayai apa yang dikatakannya, maka sesungguhnya dia telah kafir terhadap wahyu yang diturunkan kepada Muhammad.'.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏ وَعَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏عَنْ حَكِيمٍ الْأَثْرَمِ، ‏‏‏‏‏‏عَنْ أَبِي تَمِيمَةَ الْهُجَيْمِيِّ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ أَتَى حَائِضًا، ‏‏‏‏‏‏أَوِ امْرَأَةً فِي دُبُرِهَا، ‏‏‏‏‏‏أَوْ كَاهِنًا فَصَدَّقَهُ بِمَا يَقُولُ، ‏‏‏‏‏‏فَقَدْ كَفَرَ بِمَا أُنْزِلَ عَلَى مُحَمَّدٍ ."
      },
      {
        "id": 24994,
        "hadith_number": "640",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kewajipan Sedekah Bagi Yang Berhubungan Dengan Wanita Haid",
        "perawi_melayu": "Ibn 'Abbas رضي الله عنهما",
        "english_text": "It was narrated from Ibn 'Abbas that: The Prophet said concerning one who has intercourse with a woman when she is menstruating: Let him give a Dinar or half a Dinar in charity.",
        "malay_translation": "Daripada Ibn 'Abbas رضي الله عنهما, telah diriwayatkan bahawa: Nabi SAW bersabda berkenaan seseorang yang melakukan hubungan intim dengan isterinya ketika dia dalam keadaan haid: Hendaklah dia bersedekah dengan satu dinar atau separuh dinar.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏ وَابْنُ أَبِي عَدِيٍّ، ‏‏‏‏‏‏عَنْ شُعْبَةَ، ‏‏‏‏‏‏عَنْ الْحَكَمِ، ‏‏‏‏‏‏عَنْ عَبْدِ الْحَمِيدِ، ‏‏‏‏‏‏عَنْ مِقْسَمٍ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الَّذِي يَأْتِي امْرَأَتَهُ وَهِيَ حَائِضٌ قَالَ:‏‏‏‏ يَتَصَدَّقُ بِدِينَارٍ، ‏‏‏‏‏‏أَوْ بِنِصْفِ دِينَارٍ ."
      },
      {
        "id": 24995,
        "hadith_number": "641",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Petunjuk mengenai Mandi Haid dan Cara Menyingkirkan Rambut",
        "perawi_melayu": "Aishah رضي الله عنها",
        "english_text": "It was narrated from 'Aishah that: The Prophet said to her, when she was menstruating: Undo your braids and bathe. (Sahih)(A narrator) 'Ali said in his narration: Undo your head.",
        "malay_translation": "Diriwayatkan daripada 'Aishah رضي الله عنها bahawa: Rasulullah SAW bersabda kepadanya ketika beliau sedang haid, \"Singkirkan rambut ikatan anda dan mandilah.\" (Sahih)(Perawi) 'Ali berkata dalam riwayatnya: \"Singkirkan rambut kepala anda.\"",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏ وَعَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهَا وَكَانَتْ حَائِضًا:‏‏‏‏ انْقُضِي شَعْرَكِ، ‏‏‏‏‏‏وَاغْتَسِلِي ، ‏‏‏‏‏‏قَالَ عَلِيٌّ فِي حَدِيثِهِ:‏‏‏‏ انْقُضِي رَأْسَكِ ."
      },
      {
        "id": 24996,
        "hadith_number": "642",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Tatacara Mandi bagi Wanita yang Haid dan Junub Menurut Hadis Nabi SAW",
        "perawi_melayu": "Daripada 'Aishah",
        "english_text": "It was narrated from 'Aishah that: Asma asked the Messenger of Allah about bathing after ones's period. He said: One of you should take her water and lote leaves, and purify herself well, or thoroughly. Then she should pour water over her head and rub it vigorously so that the water reaches the roots of her hair. Then she should take a piece of cotton perfumed with musk and purify herself with it. Asma said: How should I purify myself with it? He said: Subhan Allah! Purify yourself with it! 'Aishah said, as if whispering to her: Wipe away the traces of blood with it. Then she (Asma) asked him about bathing to cleanse oneself from sexual impurity. He said: One of you should take her water, and purify herself, and purify herself well, or thoroughly. She should pour water over her head and rub it so that the water reaches the roots of her hair, then she should pour water over her body. 'Aishah said: How good were the women of the Ansar! For they did not let shyness keep them from understanding their religion properly.",
        "malay_translation": "Daripada 'Aishah RA, bahawa Asma' bertanya kepada Rasulullah SAW tentang mandi junub. Baginda menjawab: \"Hendaklah seorang daripada kamu mengambil air dan daun sirih, kemudian bersuci dengan sebaik-baiknya. Kemudian, tuangkan air ke atas kepalanya dan gosok dengan kuat sehingga air sampai ke akar rambutnya. Kemudian, ambil sehelai kain kapas yang berbau wangi dengan kasturi dan sucikan diri dengannya. Asma' bertanya: Bagaimana saya hendak bersuci dengannya? Baginda menjawab: Subhanallah! Bersucilah dengannya! 'Aishah seolah-olah berbisik: Lapaskan kesan darah dengannya. Kemudian Asma' bertanya tentang mandi untuk membersihkan diri dari hadas besar. Baginda menjawab: \"Ambillah air dan sucikan diri dengan sebaik-baiknya atau dengan sebaik-baiknya. Kemudian, tuangkan air ke atas kepalanya dan gosok dengan kuat sehingga air sampai ke akar rambutnya, kemudian tuangkan air ke seluruh badannya. 'Aishah berkata: Sungguh baiknya kaum wanita Ansar, kerana mereka tidak membiarkan rasa malu menghalang mereka daripada memahami agama mereka dengan betul.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ صَفِيَّةَ تُحَدِّثُ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏أَنَّ أَسْمَاءَ سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْغُسْلِ مِنَ الْمَحِيضِ؟ فَقَالَ:‏‏‏‏ تَأْخُذُ إِحْدَاكُنَّ مَاءَهَا وَسِدْرَهَا فَتَطْهُرُ فَتُحْسِنُ الطُّهُورَ، ‏‏‏‏‏‏أَوْ تَبْلُغُ فِي الطُّهُورِ، ‏‏‏‏‏‏ثُمَّ تَصُبُّ عَلَى رَأْسِهَا فَتَدْلُكُهُ دَلْكًا شَدِيدًا حَتَّى تَبْلُغَ شُؤُونَ رَأْسِهَا، ‏‏‏‏‏‏ثُمَّ تَصُبُّ عَلَيْهَا الْمَاءَ، ‏‏‏‏‏‏ثُمَّ تَأْخُذُ فِرْصَةً مُمَسَّكَةً فَتَطْهُرُ بِهَا ، ‏‏‏‏‏‏قَالَتْ أَسْمَاءُ:‏‏‏‏ كَيْفَ أَتَطَهَّرُ بِهَا؟ قَالَ:‏‏‏‏ سُبْحَانَ اللَّهِ تَطَهَّرِي بِهَا ، ‏‏‏‏‏‏قَالَتْ عَائِشَةُ:‏‏‏‏ كَأَنَّهَا تُخْفِي ذَلِكَ، ‏‏‏‏‏‏تَتَبَّعِي بِهَا أَثَرَ الدَّمِ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ وَسَأَلَتْهُ عَنِ الْغُسْلِ مِنَ الْجَنَابَةِ؟ فَقَالَ:‏‏‏‏ تَأْخُذُ إِحْدَاكُنَّ مَاءَهَا فَتَطْهُرُ فَتُحْسِنُ الطُّهُورَ، ‏‏‏‏‏‏أَوْ تَبْلُغُ فِي الطُّهُورِ حَتَّى تَصُبَّ الْمَاءَ عَلَى رَأْسِهَا فَتَدْلُكُهُ حَتَّى تَبْلُغَ شُؤُونَ رَأْسِهَا، ‏‏‏‏‏‏ثُمَّ تُفِيضُ الْمَاءَ عَلَى جَسَدِهَا ، ‏‏‏‏‏‏فَقَالَتْ عَائِشَةُ:‏‏‏‏ نِعْمَ النِّسَاءُ نِسَاءُ الْأَنْصَارِ لَمْ يَمْنَعْهُنَّ الْحَيَاءُ أَنْ يَتَفَقَّهْنَ فِي الدِّينِ"
      },
      {
        "id": 24997,
        "hadith_number": "643",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Perbuatan Rasulullah SAW dengan Sahabatnya yang Mengandung Haid",
        "perawi_melayu": "Aishah رضي الله عنها",
        "english_text": "It was narrated that 'Aishah said: I used to eat the meat from a bone when I was menstruating, then the Messenger of Allah would take it and put his mouth where my mouth had been. And I would drink from a vessel, and the Messenger of Allah would take it and put his mouth where my mouth had been, and I was menstruating.",
        "malay_translation": "Diriwayatkan daripada 'Aishah رضي الله عنها bahawa: Aku pernah memakan daging dari tulang ketika aku sedang haid, lalu Rasulullah SAW mengambilnya dan meletakkan mulut baginda pada tempat mulutku. Aku juga pernah minum dari bekas, lalu Rasulullah SAW mengambilnya dan meletakkan mulut baginda pada tempat mulutku, dan ketika itu aku sedang haid.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنِ الْمِقْدَامِ بْنِ شُرَيْحِ بْنِ هَانِئٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْعَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كُنْتُ أَتَعَرَّقُ الْعَظْمَ وَأَنَا حَائِضٌ، ‏‏‏‏‏‏فَيَأْخُذُهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَضَعُ فَمَهُ حَيْثُ كَانَ فَمِي، ‏‏‏‏‏‏وَأَشْرَبُ مِنَ الْإِنَاءِ، ‏‏‏‏‏‏فَيَأْخُذُهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَضَعُ فَمَهُ حَيْثُ كَانَ فَمِي وَأَنَا حَائِضٌ ."
      },
      {
        "id": 24998,
        "hadith_number": "644",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Bergaul dengan Wanita Haid dalam Islam",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "It was narrated from Anas that: The Jews would not sit with a menstruating woman in a house, nor eat with her, nor drink with her. That was mentioned to the Messenger of Allah, then Allah revealed the words: They ask you concerning menstruation. Say: that is a harmful thing, therefore keep away from women during menses. The Messenger of Allah said: Do everything except sexual intercourse.",
        "malay_translation": "Telah diriwayatkan daripada Anas bahawa orang Yahudi tidak akan duduk bersama wanita haid di dalam rumah, tidak makan bersama mereka, dan tidak minum bersama mereka. Hal itu disampaikan kepada Rasulullah SAW, lalu Allah SWT menurunkan firman-Nya: Mereka bertanya kepadamu tentang haid. Katakanlah: Ia adalah perkara yang menyusahkan, maka jauhilah wanita ketika dalam haid. Rasulullah SAW bersabda: Lakukanlah segala perkara kecuali persetubuhan.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا أَبُو الْوَلِيدِ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏عَنْ ثَابِتٍ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏أَنَّ الْيَهُودَ كَانُوا لَا يَجْلِسُونَ مَعَ الْحَائِضِ فِي بَيْتٍ، ‏‏‏‏‏‏وَلَا يَأْكُلُونَ، ‏‏‏‏‏‏وَلَا يَشْرَبُونَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَذُكِرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَأَنْزَلَ اللَّهُ وَيَسْأَلُونَكَ عَنِ الْمَحِيضِ قُلْ هُوَ أَذًى فَاعْتَزِلُوا النِّسَاءَ فِي الْمَحِيضِ سورة البقرة آية 222، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اصْنَعُوا كُلَّ شَيْءٍ إِلَّا الْجِمَاعَ ."
      },
      {
        "id": 24999,
        "hadith_number": "645",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Masuk Masjid bagi yang Junub dan Haid",
        "perawi_melayu": "Umm Salamah r.a.",
        "english_text": "It was narrated that Jasrah said: Umm Salamah told me: 'The Messenger of Allah entered the courtyard of this mosque and called out at the top of his voice: 'The mosque is not permissible for anyone who is sexually impure or any woman who is menstruating.''",
        "malay_translation": "Diriwayatkan bahawa Jasrah berkata: Umm Salamah memberitahu saya, \"Pesuruh Allah masuk ke halaman masjid ini dan berseru dengan suara lantang, 'Masjid tidak dibenarkan bagi sesiapa yang junub atau wanita yang sedang haid.'",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا أَبُو نُعَيْمٍ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ أَبِي غَنِيَّةَ، ‏‏‏‏‏‏عَنْ أَبِي الْخَطَّابِ الْهَجَرِيِّ، ‏‏‏‏‏‏عَنْ مَحْدُوجٍ الذُّهْلِيِّ، ‏‏‏‏‏‏عَنْ جَسْرَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ أَخْبَرَتْنِي أُمُّ سَلَمَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَرْحَةَ هَذَا الْمَسْجِدِ فَنَادَى بِأَعْلَى صَوْتِهِ:‏‏‏‏ إِنَّ الْمَسْجِدَ لَا يَحِلُّ لِجُنُبٍ، ‏‏‏‏‏‏وَلَا لِحَائِضٍ ."
      },
      {
        "id": 25000,
        "hadith_number": "646",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Penjelasan Mengenai Keadaan Wanita yang Mengalami Pendarahan Setelah Bersuci",
        "perawi_melayu": "Umm Bakr",
        "english_text": "It was narrated from Umm Bakr that: She was told that 'Aishah said: The Messenger of Allah said concerning a woman who sees that which causes her doubt (i.e. some bleeding) after she becomes pure: 'That is a vein or veins.' (Da'if) What was meant by 'after becomes pure' is after having a bath (following the end of her period).",
        "malay_translation": "Diriwayatkan daripada Umm Bakr bahawa beliau diberitahu bahawa 'Aishah berkata: Rasulullah SAW bersabda tentang seorang wanita yang melihat sesuatu yang menimbulkan keraguan (iaitu pendarahan) selepas bersuci: 'Itu hanyalah urat atau beberapa urat.' (Da'if) Yang dimaksudkan dengan 'selepas bersuci' ialah selepas mandi wajib (selepas tempoh haidnya berakhir).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، ‏‏‏‏‏‏عَنْ شَيْبَانَ النَّحْوِيِّ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ أُمِّ بَكْرٍ، ‏‏‏‏‏‏أَنَّهَا أُخْبِرَتْ، ‏‏‏‏‏‏أَنَّ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَرْأَةِ تَرَى مَا يَرِيبُهَا بَعْدَ الطُّهْرِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنَّمَا هِيَ عِرْقٌ أَوْ عُرُوقٌ ، ‏‏‏‏‏‏قَالَ مُحَمَّدُ بْنُ يَحْيَى:‏‏‏‏ يُرِيدُ بَعْدَ الطُّهْرِ بَعْدَ الْغُسْلِ."
      },
      {
        "id": 25001,
        "hadith_number": "647",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Pendapat Tidak Menganggap Cairan Kuning atau Coklat sebagai Masalah",
        "perawi_melayu": "Umm 'Atiyyah r.a.",
        "english_text": "It was narrated that Umm 'Atiyyah said: We did not think anything of the yellowish or brownish discharge. (Sahih) (Another chain) It was narrated that Umm 'Atiyyah said: We did not think that the yellowish or brownish discharge counted for anything. Muhammad bin Yahya said: Wuhaib (who narrated the second version) is the better of them with this according to us.",
        "malay_translation": "Dikisahkan bahawa Umm 'Atiyyah r.a. berkata: Kami tidak menganggap lendir kekuningan atau kecoklatan itu sebagai sesuatu yang perlu dipertimbangkan. (Sahih) (Rangkaian lain) Dikisahkan juga bahawa Umm 'Atiyyah r.a. berkata: Kami tidak menganggap lendir kekuningan atau kecoklatan itu sebagai sesuatu yang perlu dipertimbangkan. Muhammad bin Yahya berkata: Wuhaib (yang meriwayatkan versi kedua) adalah lebih baik daripada mereka dalam hal ini menurut kami.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَنْبَأَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنْ أَيُّوبَ، ‏‏‏‏‏‏عَنِ ابْنِ سِيرِينَ، ‏‏‏‏‏‏عَنْ أُمِّ عَطِيَّةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ لَمْ نَكُنْ نَرَى الصُّفْرَةَ، ‏‏‏‏‏‏وَالْكُدْرَةَ شَيْئًا ."
      },
      {
        "id": 25002,
        "hadith_number": "648",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Tempoh Nifas dan Penggunaan Wars untuk Kecantikan",
        "perawi_melayu": "Diriwayatkan daripada Umm Salamah RA berkata:",
        "english_text": "It was narrated that Umm Salamah said: At the time of the Messenger of Allah, women in postnatal bleeding (after childbirth) used to wait for forty days, and we used to put Wars on our faces because of freckles.",
        "malay_translation": "Diriwayatkan bahawa Umm Salamah berkata: Pada zaman Rasulullah SAW, wanita yang berada dalam nifas (selepas bersalin) biasanya menunggu selama empat puluh hari, dan kami biasa memakai Wars pada wajah kami kerana masalah jeragat.",
        "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، ‏‏‏‏‏‏حَدَّثَنَا شُجَاعُ بْنُ الْوَلِيدِ، ‏‏‏‏‏‏عَنْ عَلِيِّ بْنِ عَبْدِ الْأَعْلَى، ‏‏‏‏‏‏عَنْ أَبِي سَهْلٍ، ‏‏‏‏‏‏عَنْ مُسَّةَ الْأَزْدِيَّةِ، ‏‏‏‏‏‏عَنْ أُمِّ سَلَمَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَتِ النُّفَسَاءُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَجْلِسُ أَرْبَعِينَ يَوْمًا، ‏‏‏‏‏‏وَكُنَّا نَطْلِي وُجُوهَنَا بِالْوَرْسِ مِنَ الْكَلَفِ ."
      },
      {
        "id": 25003,
        "hadith_number": "649",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Tempoh Bersuci Selepas Bersalin",
        "perawi_melayu": "Anas bin Malik رضي الله عنه",
        "english_text": "It was narrated that Anas said: The Messenger of Allah set the time for postnatal bleeding at forty days, except for one who becomes pure before that.",
        "malay_translation": "Telah diriwayatkan bahawa Anas berkata: Rasulullah SAW menetapkan tempoh untuk keluar darah nifas selama empat puluh hari, kecuali bagi mereka yang suci sebelum tempoh tersebut.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، ‏‏‏‏‏‏حَدَّثَنَا الْمُحَارِبِيُّ، ‏‏‏‏‏‏عَنْ سَلَّامِ بْنِ سُلَيْمٍ، ‏‏‏‏‏‏أَوْ سَلْمٍ شَكَّ أَبُو الْحَسَنِ وَأَظُنُّهُ هُوَ أَبُو الْأَحْوَصِ، ‏‏‏‏‏‏عَنْ حُمَيْدٍ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَّتَ لِلنُّفَسَاءِ أَرْبَعِينَ يَوْمًا إِلَّا أَنْ تَرَى الطُّهْرَ قَبْلَ ذَلِكَ ."
      },
      {
        "id": 25004,
        "hadith_number": "650",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kewajipan Bersedekah Jika Bersetubuh dengan Isteri yang Haid",
        "perawi_melayu": "Ibn 'Abbas r.a.",
        "english_text": "It was narrated that Ibn 'Abbas said: If a man had intercourse with his wife while she was menstruating, the Prophet commanded him to give half a Dinar in charity.",
        "malay_translation": "Diceritakan bahawa Ibn 'Abbas r.a. berkata: Jika seorang lelaki bersetubuh dengan isterinya ketika isterinya sedang haid, Nabi SAW memerintahkannya untuk bersedekah separuh dinar.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْجَرَّاحِ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو الْأَحْوَصِ، ‏‏‏‏‏‏عَنْ عَبْدِ الْكَرِيمِ، ‏‏‏‏‏‏عَنْ مِقْسَمٍ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ الرَّجُلُ إِذَا وَقَعَ عَلَى امْرَأَتِهِ وَهِيَ حَائِضٌ أَمَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَتَصَدَّقَ بِنِصْفِ دِينَارٍ ."
      },
      {
        "id": 25005,
        "hadith_number": "651",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Makan Bersama Wanita Haid",
        "perawi_melayu": "Abdullah bin Sa'd",
        "english_text": "It was narrated that 'Abdullah bin Sa'd said: I asked the Messenger of Allah about eating with a menstruating woman and he said: 'Eat with her.'",
        "malay_translation": "Telah diriwayatkan bahawa Abdullah bin Sa'd berkata: Saya bertanya kepada Rasulullah sallallahu alaihi wasallam tentang makan bersama wanita haid. Baginda bersabda: \"Makanlah bersama beliau.\"",
        "arabic_text": "حَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، ‏‏‏‏‏‏عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، ‏‏‏‏‏‏عَنِ الْعَلَاءِ بْنِ الْحَارِثِ، ‏‏‏‏‏‏عَنْ حَرَامِ بْنِ حَكِيمٍ، ‏‏‏‏‏‏عَنْ عَمِّهِ عَبْدِ اللَّهِ بْنِ سَعْدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ مُؤَاكَلَةِ الْحَائِضِ؟ فَقَالَ:‏‏‏‏ وَاكِلْهَا ."
      },
      {
        "id": 25006,
        "hadith_number": "652",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Rasulullah SAW Solat dengan Sahabat 'Aisyah RA semasa Haid",
        "perawi_melayu": "Ummu Al-Mukminin 'Aisyah RA",
        "english_text": "It was narrated that 'Aishah said: The Messenger of Allah was performing prayer, and I was by his side. I was menstruating, and I was wearing a wool cloak, and part of it was over him.",
        "malay_translation": "Dikisahkan bahawa 'Aisyah RA berkata: Rasulullah SAW sedang menunaikan solat, dan saya berada di sisinya. Saya sedang dalam keadaan haid, dan saya memakai selendang bulu, dan sebahagian darinya menutupi baginda.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنْ طَلْحَةَ بْنِ يَحْيَى، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، ‏‏‏‏‏‏عَنْعَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي وَأَنَا إِلَى جَنْبِهِ وَأَنَا حَائِضٌ، ‏‏‏‏‏‏وَعَلَيَّ مِرْطٌ لِي، ‏‏‏‏‏‏وَعَلَيْهِ بَعْضُهُ"
      },
      {
        "id": 25007,
        "hadith_number": "653",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Rasulullah SAW Solat dengan Jubah dan Sahabah Wanita yang Haid",
        "perawi_melayu": "Daripada Maimunah رضي الله عنها",
        "english_text": "It was narrated from Maimunah that: The Messenger of Allah performed prayer wearing a wool cloak. Part of it was over him and part was over her, and she was menstruating.",
        "malay_translation": "Telah diriwayatkan daripada Maimunah رضي الله عنها bahawa: Rasulullah SAW menunaikan solat dengan memakai jubah bulu. Sebahagiannya menutup baginda dan sebahagiannya menutupnya, dan beliau sedang dalam keadaan haid.",
        "arabic_text": "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏حَدَّثَنَا الشَّيْبَانِيُّ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ، ‏‏‏‏‏‏عَنْ مَيْمُونَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى وَعَلَيْهِ مِرْطٌ عَلَيْهِ بَعْضُهُ وَعَلَيْهَا بَعْضُهُ وَهِيَ حَائِضٌ ."
      },
      {
        "id": 25008,
        "hadith_number": "654",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Panduan Mengatasi Keadaan Haid Wanita yang Tersembunyi",
        "perawi_melayu": "Daripada 'Aishah رضي الله عنها",
        "english_text": "It was narrated from 'Aishah that: The Prophet entered upon her, and a freed slave girl of hers concealed herself. The Prophet asked: Have her periods begun? She said: Yes. He tore a piece of his turban and said: Cover your head with this.",
        "malay_translation": "Daripada 'Aishah رضي الله عنها, diceritakan bahawa baginda Nabi SAW telah masuk ke rumahnya, dan seorang hamba perempuannya yang telah dibebaskan telah menyembunyikan dirinya. Baginda Nabi SAW bertanya: \"Adakah dia telah mula haid?\" Jawabnya: \"Ya.\" Baginda Nabi SAW mengoyakkan secebis serbannya dan bersabda: \"Tutuplah kepalamu dengan ini.\"",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏ وَعَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏عَنْ عَبْدِ الْكَرِيمِ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ عَائِشَةَ:‏‏‏‏ أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا فَاخْتَبَأَتْ مَوْلَاةٌ لَهَا، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ حَاضَتْ؟ فَقَالَتْ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏ فَشَقَّ لَهَا مِنْ عِمَامَتِهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ اخْتَمِرِي بِهَذَا ."
      },
      {
        "id": 25009,
        "hadith_number": "655",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Ketidakterimaan Solat Wanita Haid Tanpa Tutup Kepala",
        "perawi_melayu": "Daripada 'Aishah رضي الله عنها",
        "english_text": "It was narrated from 'Aishah that: The Prophet said: Allah does not accept the prayer of a woman who menstruates (i.e., an adult woman) except with a head cover.",
        "malay_translation": "Daripada 'Aishah رضي الله عنها, bahawa Nabi SAW bersabda: Allah tidak menerima solat wanita yang haid kecuali dengan menutup kepala.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا أَبُو الْوَلِيدِ، ‏‏‏‏‏‏ وَأَبُو النُّعْمَانِ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ سِيرِينَ، ‏‏‏‏‏‏عَنْ صَفِيَّةَ بِنْتِ الْحَارِثِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا يَقْبَلُ اللَّهُ صَلَاةَ حَائِضٍ إِلَّا بِخِمَارٍ ."
      },
      {
        "id": 25010,
        "hadith_number": "656",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kebolehan Wanita Haid Memakai Pewarna Tangan Menurut Hadis Nabi SAW",
        "perawi_melayu": "Daripada Mu'adh",
        "english_text": "It was narrated from Mu'adh that: A woman asked 'Aishah: Can a woman who is menstruating, dye her hands? She said: We were with the Prophet and we used to dye our hands, and he did not tell us not to do that.",
        "malay_translation": "Dikisahkan oleh Mu'adh bahawa seorang wanita bertanya kepada 'Aisyah, \"Bolehkah wanita yang sedang haid memakai pewarna pada tangannya?\" Jawab 'Aisyah, \"Kami pernah bersama Nabi SAW, dan kami biasa mewarnakan tangan kami, dan baginda tidak melarang kami melakukannya.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا حَجَّاجٌ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏حَدَّثَنَا أَيُّوبُ، ‏‏‏‏‏‏عَنْ مُعَاذَةَ، ‏‏‏‏‏‏أَنَّ امْرَأَةً سَأَلَتْعَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ تَخْتَضِبُ الْحَائِضُ؟ فَقَالَتْ:‏‏‏‏ قَدْ كُنَّا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ نَخْتَضِبُ فَلَمْ يَكُنْ يَنْهَانَا عَنْهُ ."
      },
      {
        "id": 25011,
        "hadith_number": "657",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Petunjuk Nabi SAW Mengenai Pembalut Luka",
        "perawi_melayu": "Ali bin Abi Talib r.a.",
        "english_text": "It was narrated that 'Ali bin Abu Talib said: I broke one of my forearms and I asked the Prophet about that. He told me to wipe over the bandages. (Maudu') Another chain with similar meaning",
        "malay_translation": "Dikisahkan bahawa Ali bin Abi Talib r.a. berkata: \"Saya patah salah satu lengan saya dan saya bertanya kepada Nabi SAW tentang perkara itu. Baginda suruh saya mengusap ke atas pembalut luka tersebut.\" (Maudu')  Hadis lain dengan makna yang serupa.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبَانَ الْبَلْخِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَنْبَأَنَا إِسْرَائِيلُ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ خَالِدٍ، ‏‏‏‏‏‏عَنْ زَيْدِ بْنِ عَلِيٍّ، ‏‏‏‏‏‏عَنْأَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ انْكَسَرَتْ إِحْدَى زَنْدَيَّ، ‏‏‏‏‏‏فَسَأَلْتُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ فَأَمَرَنِي أَنْ أَمْسَحَ عَلَى الْجَبَائِرِ ."
      },
      {
        "id": 25012,
        "hadith_number": "658",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Nabi SAW Membawa Hasan bin Ali di Bahu dan Ludahnya Menetes",
        "perawi_melayu": "Abu Hurairah r.a. berkata",
        "english_text": "It was narrated that Abu Hurairah said: I saw the Prophet carrying Hasan bin 'Ali on his shoulder, and his saliva was dripping down on him.",
        "malay_translation": "Telah diriwayatkan bahawa Abu Hurairah r.a. berkata: \"Aku melihat Rasulullah SAW membawa Hasan bin Ali di atas bahunya, dan ludahnya menitik ke atasnya.\"",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنْ حَمَّادِ بْنِ سَلَمَةَ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ زِيَادٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَامِلَ الْحُسَيْنِ بْنِ عَلِيٍّ عَلَى عَاتِقِهِ وَلُعَابُهُ يَسِيلُ عَلَيْهِ ."
      },
      {
        "id": 25013,
        "hadith_number": "659",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Sabda Nabi SAW Mengenai Mencuci Mulut dan Hidung",
        "perawi_melayu": "Abdul Jabbar bin Wa'il",
        "english_text": "It was narrated from 'Abdul Jabbar bin Wa'il that his father said: A bucket was brought to the Prophet; he rinsed his mouth and spat into it, and it was like musk or better than musk, and he rinsed his nostrils outside the bucket.",
        "malay_translation": "Dikisahkan daripada Abdul Jabbar bin Wa'il bahawa bapanya berkata: Sebuah baldi dibawa kepada Nabi; baginda membilas mulut dan memuntahkan air ke dalam baldi itu, dan ia berbau seperti atau lebih harum daripada musk, dan baginda membilas hidungnya di luar baldi.",
        "arabic_text": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ مِسْعَرٍ . ح وحَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ بْنِ كَرَامَةَ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو أُسَامَةَ، ‏‏‏‏‏‏عَنْ مِسْعَرٍ، ‏‏‏‏‏‏عَنْ عَبْدِ الْجَبَّارِ بْنِ وَائِلٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِدَلْوٍ فَمَضْمَضَ مِنْهُ، ‏‏‏‏‏‏فَمَجَّ فِيهِ مِسْكًا، ‏‏‏‏‏‏أَوْ أَطْيَبَ مِنَ الْمِسْكِ، ‏‏‏‏‏‏وَاسْتَنْثَرَ خَارِجًا مِنَ الدَّلْوِ ."
      },
      {
        "id": 25014,
        "hadith_number": "660",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Nabi SAW Meludah ke Dalam Baldi dari Telaga Mereka",
        "perawi_melayu": "Daripada Mahmud bin Rabi' ",
        "english_text": "It was narrated from Zuhri that: Mahmud bin Rabi' remembered that the Prophet spat into a bucket from a well that belonged to them",
        "malay_translation": "Daripada Zuhri, Mahmud bin Rabi' meriwayatkan bahawa Nabi SAW telah meludah ke dalam baldi dari telaga kepunyaan mereka.",
        "arabic_text": "حَدَّثَنَا أَبُو مَرْوَانَ، ‏‏‏‏‏‏حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ مَحْمُودِ بْنِ الرَّبِيعِ، ‏‏‏‏‏‏ وَكَانَ قَدْ عَقَلَ مَجَّةً مَجَّهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي دَلْوٍ مِنْ بِئْرٍ لَهُمْ."
      },
      {
        "id": 25015,
        "hadith_number": "661",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Melihat Aurath antara Wanita dan Lelaki",
        "perawi_melayu": "Daripada Abdur-Rahman bin Abu Sa'eed Al-Khudri daripada bapanya.",
        "english_text": "It was narrated from 'Abdur-Rahman bin Abu Sa'eed Al-Khudri from his father that: The Messenger of Allah said: No woman should look at the nakedness of another woman, and no man should look at the nakedness of another man.",
        "malay_translation": "Diriwayatkan daripada Abdur-Rahman bin Abu Sa'id al-Khudri daripada bapanya, bahawa Rasulullah SAW bersabda: \"Janganlah seorang wanita melihat aurat wanita lain, dan janganlah seorang lelaki melihat aurat lelaki lain.\"",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، ‏‏‏‏‏‏عَنْ الضَّحَّاكِ بْنِ عُثْمَانَ، ‏‏‏‏‏‏حَدَّثَنَا زَيْدُ بْنُ أَسْلَمَ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا تَنْظُرِ الْمَرْأَةُ إِلَى عَوْرَةِ الْمَرْأَةِ، ‏‏‏‏‏‏وَلَا يَنْظُرِ الرَّجُلُ إِلَى عَوْرَةِ الرَّجُلِ ."
      },
      {
        "id": 25016,
        "hadith_number": "662",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Aisyah Tidak Pernah Melihat Aurat Rasulullah SAW",
        "perawi_melayu": "Diriwayatkan daripada seorang hamba yang dibebaskan oleh Aisyah RA bahawa",
        "english_text": "It was narrated from a freed slave of 'Aishah that: 'Aishah said: I never looked at (or I never saw) the private part of the Messenger of Allah. (Da'if)(One of the narrators) Abu Bakr (Ibn Abu Shaibah) said: Abu Nu'aim would say: '(From) a freed female slave of 'Aishah.'",
        "malay_translation": "Aisyah RA berkata: Aku tidak pernah melihat (atau aku tidak pernah nampak) aurat Rasulullah SAW. (Da'if)(Salah seorang perawi) Abu Bakr (Ibn Abu Shaibah) berkata: Abu Nu'aim akan berkata: '(Daripada) seorang hamba perempuan Aisyah yang dibebaskan.'",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏عَنْ مَنْصُورٍ، ‏‏‏‏‏‏عَنْ مُوسَى بْنِ عَبْدِ اللَّهِ بْنِ يَزِيدَ، ‏‏‏‏‏‏عَنْمَوْلًى لِعَائِشَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ مَا نَظَرْتُ أَوْ مَا رَأَيْتُ فَرْجَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَطُّ ، ‏‏‏‏‏‏قَالَ أَبُو بَكْرٍ:‏‏‏‏ كَانَ أَبُو نُعَيْمٍ يَقُولُ:‏‏‏‏ عَنْ مَوْلَاةٍ لِعَائِشَةَ."
      },
      {
        "id": 25017,
        "hadith_number": "663",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Cara Nabi SAW Membersihkan Diri Dari Najis Junub dan Mengatasi Titik Air yang Tertinggal",
        "perawi_melayu": "Ibnu Abbas رضي الله عنهما",
        "english_text": "It was narrated from Ibn 'Abbas: The Prophet bathed to cleanse himself from sexual impurity, then he saw a spot that the water did not reach. Then he motioned with the hair hanging over his shoulders and squeezed (the water from it) over that spot. (Da'if)In his narration, Ishaq said: So he wrung his hair over it.",
        "malay_translation": "Daripada Ibnu Abbas رضي الله عنهما: Nabi SAW mandi untuk membersihkan diri daripada najis junub, kemudian baginda melihat satu tempat yang air tidak sampai. Kemudian baginda menggerakkan rambut yang tergantung di bahunya dan memerah (air daripadanya) ke atas tempat tersebut. (Da'if) Dalam riwayatnya, Ishaq berkata: Maka baginda memerah rambutnya ke atasnya.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏ وَإِسْحَاق بْنُ مَنْصُورٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، ‏‏‏‏‏‏أَنْبَأَنَا مُسْتَلِمُ بْنُ سَعِيدٍ، ‏‏‏‏‏‏عَنْأَبِي عَلِيٍّ الرَّحَبِيِّ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اغْتَسَلَ مِنْ جَنَابَةٍ، ‏‏‏‏‏‏فَرَأَى لُمْعَةً لَمْ يُصِبْهَا الْمَاءُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ بِجُمَّتِهِ فَبَلَّهَا عَلَيْهَا ، ‏‏‏‏‏‏قَالَ إِسْحَاق فِي حَدِيثِهِ:‏‏‏‏ فَعَصَرَ شَعْرَهُ عَلَيْهَا ."
      },
      {
        "id": 25018,
        "hadith_number": "664",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Cara Membersihkan Najis Secara Lengkap",
        "perawi_melayu": "Ali bin Abi Talib r.a.",
        "english_text": "It was narrated that 'Ali said: A man came to the Prophet and said: 'I bathed to cleanse myself from sexual impurity, and I prayed Fajr, then I noticed a spot the size of a fingernail that the water did not reach.' The Messenger of Allah said: 'If you had wiped it that would have been sufficient for you.'",
        "malay_translation": "Diriwayatkan bahawa Ali r.a. berkata: Seorang lelaki datang kepada Nabi SAW dan berkata, 'Saya telah mandi junub dan menunaikan solat Subuh, kemudian saya dapati satu noda sebesar kuku jari yang tidak terkena air.' Rasulullah SAW bersabda, 'Sekiranya engkau mengesatnya, cukuplah bagimu.'",
        "arabic_text": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو الْأَحْوَصِ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ عُبَيْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ الْحَسَنِ بْنِ سَعْدٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَلِيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ:‏‏‏‏ إِنِّي اغْتَسَلْتُ مِنَ الْجَنَابَةِ وَصَلَّيْتُ الْفَجْرَ، ‏‏‏‏‏‏ثُمَّ أَصْبَحْتُ فَرَأَيْتُ قَدْرَ مَوْضِعِ الظُّفْرِ لَمْ يُصِبْهُ الْمَاءُ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَوْ كُنْتَ مَسَحْتَ عَلَيْهِ بِيَدِكَ أَجْزَأَكَ ."
      },
      {
        "id": 25019,
        "hadith_number": "665",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Keperluan Mengulangi Wuduk Jika Terlepas Titik Air Semasa Wuduk",
        "perawi_melayu": "Anas رضي الله عنه",
        "english_text": "It was narrated from Anas that: A man came to the Prophet; he had performed ablution and has missed a spot the size of a fingernail where water had not reached. The Prophet said to him: 'Go back and perform ablution properly.",
        "malay_translation": "Daripada Anas رضي الله عنه, diceritakan bahawa seorang lelaki datang menemui Rasulullah SAW. Dia telah berwuduk, tetapi ada satu tempat sebesar kuku yang tidak terkena air. Baginda Rasulullah SAW bersabda kepadanya, 'Kembalilah dan sempurnakan wudukmu.'",
        "arabic_text": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، ‏‏‏‏‏‏حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ أَنَسٍ:‏‏‏‏ أَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَقَدْ تَوَضَّأَ وَتَرَكَ مَوْضِعَ الظُّفْرِ لَمْ يُصِبْهُ الْمَاءُ، ‏‏‏‏‏‏فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ ارْجِعْ فَأَحْسِنْ وُضُوءَكَ ."
      },
      {
        "id": 25020,
        "hadith_number": "666",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Keperluan Mengulang Wudhu dan Solat Kerana Terlepas Sesuatu ketika Bersuci",
        "perawi_melayu": "Umar bin al-Khattab رضي الله عنه",
        "english_text": "It was narrated that 'Umar bin Khattab said: The Messenger of Allah saw a man performing ablution and he missed a spot the size of a fingernail on his foot. He commanded him to repeat the ablution and his prayer, so he did.",
        "malay_translation": "Diceritakan bahawa 'Umar bin al-Khattab رضي الله عنه berkata: Rasulullah SAW melihat seorang lelaki sedang berwudhuk dan beliau terlepas satu bahagian sebesar kuku jari di kakinya. Baginda memerintahkannya untuk mengulang wudhuk dan solatnya, maka dia melakukannya.",
        "arabic_text": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ وَهْبٍ . ح وحَدَّثَنَا ابْنُ حُمَيْدٍ، ‏‏‏‏‏‏حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا ابْنُ لَهِيعَةَ، ‏‏‏‏‏‏عَنْ أَبِي الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ جَابِرٍ، ‏‏‏‏‏‏عَنْ عُمَرَ بْنِ الْخَطَّابِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ رَأَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا تَوَضَّأَ فَتَرَكَ مَوْضِعَ الظُّفْرِ عَلَى قَدَمِهِ، ‏‏‏‏‏‏فَأَمَرَهُ أَنْ يُعِيدَ الْوُضُوءَ وَالصَّلَاةَ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَرَجَعَ."
      }
    ]
  }
}