{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 80,
    "data": [
      {
        "id": 26969,
        "hadith_number": "2615",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Perkara Pertama Diadili pada Hari Kiamat: Pertumpahan Darah",
        "perawi_melayu": "Abdullah (bin Mas'ud)",
        "english_text": "It was narrated from Abdullah that the Messenger of Allah (ﷺ) said: “The first matter concerning which judgment will be passed among the people on the Day of Resurrection will be bloodshed.”",
        "malay_translation": "Diriwayatkan daripada Abdullah bahawa Rasulullah (ﷺ) bersabda: \"Perkara pertama yang akan diadili di kalangan manusia pada Hari Kiamat adalah pertumpahan darah.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، ‏‏‏‏‏‏ وَعَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏حَدَّثَنَا الْأَعْمَشُ، ‏‏‏‏‏‏عَنْشَقِيقٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَوَّلُ مَا يُقْضَى بَيْنَ النَّاسِ يَوْمَ الْقِيَامَةِ فِي الدِّمَاءِ ."
      },
      {
        "id": 26970,
        "hadith_number": "2616",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Tanggungjawab ke atas Pembunuhan Tidak Adil",
        "perawi_melayu": "Abdullah bin Mas'ud (RA)",
        "english_text": "It was narrated from Abdullah that the Messenger of Allah (ﷺ) said: “No person is killed wrongfully, but a share of responsibility for his blood will be upon, the first son of Adam, because he was the first one to kill.”",
        "malay_translation": "Diriwayatkan daripada Abdullah bahawa Rasulullah (ﷺ) bersabda: “Tidaklah seorang pun dibunuh secara zalim, melainkan ada bahagian tanggungjawab ke atas darahnya kepada anak lelaki Adam yang pertama (Qabil), kerana dialah orang pertama yang melakukan pembunuhan.”",
        "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا عِيسَى بْنُ يُونُسَ، ‏‏‏‏‏‏حَدَّثَنَا الْأَعْمَشُ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، ‏‏‏‏‏‏عَنْ مَسْرُوقٍ، ‏‏‏‏‏‏عَنْعَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تُقْتَلُ نَفْسٌ ظُلْمًا إِلَّا كَانَ عَلَى ابْنِ آدَمَ الْأَوَّلِ كِفْلٌ مِنْ دَمِهَا لِأَنَّهُ أَوَّلُ مَنْ سَنَّ الْقَتْلَ ."
      },
      {
        "id": 26971,
        "hadith_number": "2617",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Perkara Pertama di Hari Kiamat: Pertumpahan Darah",
        "perawi_melayu": "Abdullah bin Mas'ud (رَضِيَ ٱللَّٰهُ عَنْهُ)",
        "english_text": "It was narrated from Abdullah that the Messenger of Allah (ﷺ) said: The first matter concerning which judgment will be passed among the people on the Day of Resurrection will be bloodshed.”",
        "malay_translation": "Diriwayatkan daripada Abdullah (r.a.) bahawa Rasulullah (ﷺ) bersabda: \"Perkara pertama yang akan diadili di antara manusia pada Hari Kiamat ialah tentang pertumpahan darah.\"",
        "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى بْنِ الْأَزْهَرِ الْوَاسِطِيُّ، ‏‏‏‏‏‏حَدَّثَنَا إِسْحَاق بْنُ يُوسُفَ الْأَزْرَقُ، ‏‏‏‏‏‏عَنْ شَرِيكٍ، ‏‏‏‏‏‏عَنْ عَاصِمٍ، ‏‏‏‏‏‏عَنْ أَبِي وَائِلٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَوَّلُ مَا يُقْضَى بَيْنَ النَّاسِ يَوْمَ الْقِيَامَةِ فِي الدِّمَاءِ ."
      },
      {
        "id": 26972,
        "hadith_number": "2618",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Syurga bagi yang Bertemu Allah tanpa Syirik dan Tidak Menumpahkan Darah Haram",
        "perawi_melayu": "Uqbah bin Amir Al-Juhani",
        "english_text": "It was narrated from Uqbah bin Amir Al-Juhani that the Messenger of Allah (ﷺ) said: “Whoever meets Allah (SWT) not associating anything in worship with him, and not having shed any blood unlawfully, will enter Paradise.”",
        "malay_translation": "Diriwayatkan daripada Uqbah bin Amir Al-Juhani bahawa Rasulullah (ﷺ) bersabda: “Sesiapa yang menemui Allah (SWT) dalam keadaan tidak menyekutukan-Nya dengan sesuatu pun dalam ibadah, dan tidak menumpahkan darah secara haram, maka dia akan masuk syurga.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏حَدَّثَنَا إِسْمَاعِيل بْنُ أَبِي خَالِدٍ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَائِذٍ، ‏‏‏‏‏‏عَنْعُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ لَقِيَ اللَّهَ لَا يُشْرِكُ بِهِ شَيْئًا، ‏‏‏‏‏‏لَمْ يَتَنَدَّ بِدَمٍ حَرَامٍ دَخَلَ الْجَنَّةَ ."
      },
      {
        "id": 26973,
        "hadith_number": "2619",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Dunia Lebih Ringan di Sisi Allah Berbanding Pembunuhan Seorang Mukmin",
        "perawi_melayu": "Bara' bin Azib",
        "english_text": "It was narrated from Bara' bin Azib that the Messenger of Allah (ﷺ) said: “If this world were to be destroyed, that would be less significant before Allah (SWT) than the unlawful killing of a believer.”",
        "malay_translation": "Diriwayatkan daripada al-Bara' bin Azib bahawa Rasulullah (ﷺ) bersabda: “Sekiranya dunia ini akan musnah, maka ia lebih ringan di sisi Allah (SWT) berbanding pembunuhan seorang mukmin tanpa hak.”",
        "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، ‏‏‏‏‏‏حَدَّثَنَا مَرْوَانُ بْنُ جَنَاحٍ، ‏‏‏‏‏‏عَنْ أَبِي الْجَهْمِ الْجُوزَجَانِيِّ، ‏‏‏‏‏‏عَنِ الْبَرَاءِ بْنِ عَازِبٍ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَزَوَالُ الدُّنْيَا أَهْوَنُ عَلَى اللَّهِ مِنْ قَتْلِ مُؤْمِنٍ بِغَيْرِ حَقٍّ ."
      },
      {
        "id": 26974,
        "hadith_number": "2620",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Ancaman Terhadap Pembunuh Mukmin",
        "perawi_melayu": "Daripada Abu Hurairah رضي الله عنه",
        "english_text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: “Whoever helps to kill a believer, even with half a world, he will meet Allah (SWT) with (the words) written between his eyes, 'He has no hope of the mercy of Allah (SWT).'",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah رضي الله عنه, bahawa Rasulullah ﷺ bersabda: “Sesiapa yang membantu membunuh seorang mukmin, walaupun dengan separuh kalimah, dia akan bertemu Allah (SWT) dengan (tulisan) yang tertulis di antara kedua matanya, 'Dia tidak mempunyai harapan terhadap rahmat Allah (SWT).'",
        "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، ‏‏‏‏‏‏حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ زِيَادٍ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ أَعَانَ عَلَى قَتْلِ مُؤْمِنٍ بِشَطْرِ كَلِمَةٍ، ‏‏‏‏‏‏لَقِيَ اللَّهَ عَزَّ وَجَلَّ مَكْتُوبٌ بَيْنَ عَيْنَيْهِ آيِسٌ مِنْ رَحْمَةِ اللَّهِ ."
      },
      {
        "id": 26975,
        "hadith_number": "2621",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukuman Pembunuh dan Korban di Hari Kiamat",
        "perawi_melayu": "Salim bin Abu Jad",
        "english_text": "It was narrated that Salim bin Abu Jad said: “Ibn Abbas was asked about one who kills a believer deliberately, then repents, believes, does righteous deeds and follows true guidance. He said: 'Woe to him can there be any guidance for him? I heard your Prophet (ﷺ) say: “The killer and his victim will be brought on the day of Resurrection, with slain holding onto the head of his killer, saying: 'O Lord, ask this one, why did he kill me?” By Allah (SWT), Allah (SWT) the Mighty and Sublime revealed it to your Prophet (ﷺ) then He did not abrogate it after He revealed it.”",
        "malay_translation": "Diriwayatkan daripada Salim bin Abu Jad, beliau berkata: “Ibn Abbas ditanya tentang seseorang yang membunuh seorang mukmin dengan sengaja, kemudian bertaubat, beriman, melakukan amalan soleh dan mengikut petunjuk yang benar. Beliau berkata: 'Celakalah dia! Adakah baginya sebarang petunjuk? Aku mendengar Nabi kamu (ﷺ) bersabda: “Pembunuh dan mangsanya akan dibawa pada hari Kiamat, dengan mangsa memegang kepala pembunuhnya, seraya berkata: 'Ya Tuhan, tanyakanlah kepada orang ini, mengapa dia membunuhku?” Demi Allah (SWT), Allah (SWT) Yang Maha Kuasa dan Maha Agung telah mewahyukan hal ini kepada Nabi kamu (ﷺ), kemudian Dia tidak membatalkannya setelah Dia mewahyukannya.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ عَمَّارٍ الدُّهْنِيِّ، ‏‏‏‏‏‏عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سُئِلَ ابْنُ عَبَّاسٍ عَمَّنْ قَتَلَ مُؤْمِنًا مُتَعَمِّدًا ثُمَّ تَابَ وَآمَنَ وَعَمِلَ صَالِحًا ثُمَّ اهْتَدَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَيْحَهُ وَأَنَّى لَهُ الْهُدَى، ‏‏‏‏‏‏سَمِعْتُ نَبِيَّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ يَجِيءُ الْقَاتِلُ وَالْمَقْتُولُ يَوْمَ الْقِيَامَةِ مُتَعَلِّقٌ بِرَأْسِ صَاحِبِهِ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ رَبِّ سَلْ هَذَا لِمَ قَتَلَنِي؟ ، ‏‏‏‏‏‏وَاللَّهِ لَقَدْ أَنْزَلَهَا اللَّهُ عَزَّ وَجَلَّ عَلَى نَبِيِّكُمْ ثُمَّ مَا نَسَخَهَا بَعْدَ مَا أَنْزَلَهَا ."
      },
      {
        "id": 26976,
        "hadith_number": "2622",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kisah Lelaki yang Membunuh Seratus Nyawa dan Taubatnya",
        "perawi_melayu": "Abu Sa'eed Al-Khudri رضي الله عنه",
        "english_text": "It was narrated that Abu Sa'eed Khudri said: “Shall I not tell you what I heard directly from the Messenger of Allah (ﷺ)? I heard it and memorized it: 'A man killed ninety-nine people, then the idea of repentance occurred to him. He asked who was the most knowledgeable of people on earth, and he was told of a man so he went to him and said: “I have killed ninety-nine people. Can I repent?” He said: “After ninety-nine people?!” He said: 'So he drew his sword and killed him, thus completing one hundred. Then the idea of repentance occurred to him (again), so he asked who was the most knowledgeable of people, and he was told of a man (so he went to him) and said: “I have killed one hundred people. Can I repent?” He said: “Woe to you, what is stopping you from repenting? Leave the evil town where you are living and go to a good town, such and such town and worship your Lord there” So he went out, heading for the good town, but death came to him on the road. The angels of mercy and angels of punishment argued over him. Iblis (Satan) said: “I have more right to him, for he never disobeyed me for a moment. “But the angels of mercy said: “He want out repenting.” (One of the narrators) Hammam said: “Humaid At-Tawil narrated to me from Bakr bin Abdullah that Abu Rafi said: 'So Allah (SWT) sent an angel to whom they referred (the case). He said: “Look and see which of the two towns was he closer, and put him with its people.” (One of the narrators) Qatadah said: “Hasan narrated to us: 'When death came to him he strove and drew closer to the good town, and farther away from the evil town, so they put him with the people of the good town.”",
        "malay_translation": "Diriwayatkan dari Abu Sa'eed Al-Khudri رضي الله عنه, beliau berkata: “Tidakkah patut aku ceritakan kepada kamu apa yang aku dengar secara langsung daripada Rasulullah (ﷺ)? Aku mendengarnya dan menghafalnya: 'Seorang lelaki membunuh sembilan puluh sembilan orang, kemudian timbul dalam fikirannya untuk bertaubat. Dia bertanya siapa orang yang paling berilmu di bumi, dan dia diberitahu tentang seorang lelaki, lalu dia pergi kepadanya dan berkata: “Aku telah membunuh sembilan puluh sembilan orang. Bolehkah aku bertaubat?” Lelaki itu berkata: “Selepas membunuh sembilan puluh sembilan orang?!” Lelaki itu berkata: 'Lalu dia menghunus pedangnya dan membunuhnya, dengan itu genaplah seratus orang. Kemudian timbul lagi dalam fikirannya untuk bertaubat, maka dia bertanya lagi siapa orang yang paling berilmu, dan dia diberitahu tentang seorang lelaki (lalu dia pergi kepadanya) dan berkata: “Aku telah membunuh seratus orang. Bolehkah aku bertaubat?” Lelaki itu berkata: “Celaka kamu, apa yang menghalang kamu daripada bertaubat? Tinggalkan kampung yang jahat tempat kamu tinggal dan pergilah ke kampung yang baik, kampung anu dan anu dan beribadatlah kepada Tuhanmu di sana.” Maka dia pun keluar, menuju ke kampung yang baik, tetapi kematian datang kepadanya di jalan. Para malaikat rahmat dan malaikat azab bertengkar tentang dirinya. Iblis (Syaitan) berkata: “Aku lebih berhak ke atasnya, kerana dia tidak pernah menderhaka kepadaku walau sesaat.” Tetapi para malaikat rahmat berkata: “Dia keluar dalam keadaan bertaubat.” (Salah seorang perawi) Hammam berkata: “Humaid At-Tawil meriwayatkan kepadaku daripada Bakr bin Abdullah bahawa Abu Rafi berkata: 'Maka Allah (SWT) mengutuskan seorang malaikat kepada mereka untuk merujuk (kes tersebut). Malaikat itu berkata: “Lihatlah dan perhatikan ke kampung mana dia lebih dekat, dan tempatkan dia bersama penduduknya.” (Salah seorang perawi) Qatadah berkata: “Hasan meriwayatkan kepada kami: 'Ketika kematian datang kepadanya, dia berusaha dan mendekatkan diri ke kampung yang baik, dan menjauhi kampung yang jahat, maka mereka menempatkannya bersama penduduk kampung yang baik.”",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، ‏‏‏‏‏‏أَنْبَأَنَا هَمَّامُ بْنُ يَحْيَى، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ أَبِي الصِّدِّيقِ النَّاجِيِّ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَلَا أُخْبِرُكُمْ بِمَا سَمِعْتُ مِنْ فِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعَتْهُ أُذُنَايَ وَوَعَاهُ قَلْبِي:‏‏‏‏ إِنَّ عَبْدًا قَتَلَ تِسْعَةً وَتِسْعِينَ نَفْسًا ثُمَّ عَرَضَتْ لَهُ التَّوْبَةُ، ‏‏‏‏‏‏فَسَأَلَ عَنْ أَعْلَمِ أَهْلِ الْأَرْضِ، ‏‏‏‏‏‏فَدُلَّ عَلَى رَجُلٍ فَأَتَاهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنِّي قَتَلْتُ تِسْعَةً وَتِسْعِينَ نَفْسًا، ‏‏‏‏‏‏فَهَلْ لِي مِنْ تَوْبَةٍ؟ قَالَ:‏‏‏‏ بَعْدَ تِسْعَةٍ وَتِسْعِينَ نَفْسًا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَانْتَضَى سَيْفَهُ فَقَتَلَهُ فَأَكْمَلَ بِهِ الْمِائَةَ، ‏‏‏‏‏‏ثُمَّ عَرَضَتْ لَهُ التَّوْبَةُ، ‏‏‏‏‏‏فَسَأَلَ عَنْ أَعْلَمِ أَهْلِ الْأَرْضِ، ‏‏‏‏‏‏فَدُلَّ عَلَى رَجُلٍ فَأَتَاهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنِّي قَتَلْتُ مِائَةَ نَفْسٍ، ‏‏‏‏‏‏فَهَلْ لِي مِنْ تَوْبَةٍ؟ فَقَالَ:‏‏‏‏ وَيْحَكَ! وَمَنْ يَحُولُ بَيْنَكَ وَبَيْنَ التَّوْبَةِ، ‏‏‏‏‏‏اخْرُجْ مِنَ الْقَرْيَةِ الْخَبِيثَةِ الَّتِي أَنْتَ فِيهَا إِلَى الْقَرْيَةِ الصَّالِحَةِ قَرْيَةِ كَذَا وَكَذَا، ‏‏‏‏‏‏فَاعْبُدْ رَبَّكَ فِيهَا، ‏‏‏‏‏‏فَخَرَجَ يُرِيدُ الْقَرْيَةَ الصَّالِحَةَ، ‏‏‏‏‏‏فَعَرَضَ لَهُ أَجَلُهُ فِي الطَّرِيقِ، ‏‏‏‏‏‏فَاخْتَصَمَتْ فِيهِ مَلَائِكَةُ الرَّحْمَةِ وَمَلَائِكَةُ الْعَذَابِ، ‏‏‏‏‏‏قَالَ إِبْلِيسُ:‏‏‏‏ أَنَا أَوْلَى بِهِ إِنَّهُ لَمْ يَعْصِنِي سَاعَةً قَطُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَقَالَتْ مَلَائِكَةُ الرَّحْمَةِ:‏‏‏‏ إِنَّهُ خَرَجَ تَائِبًا ، ‏‏‏‏‏‏قَالَ هَمَّامٌ:‏‏‏‏ فَحَدَّثَنِي حُمَيْدٌ الطَّوِيلُ، ‏‏‏‏‏‏عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْأَبِي رَافِعٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَبَعَثَ اللَّهُ عَزَّ وَجَلَّ مَلَكًا فَاخْتَصَمُوا إِلَيْهِ ثُمَّ رَجَعُوا فَقَالَ:‏‏‏‏ انْظُرُوا أَيَّ الْقَرْيَتَيْنِ كَانَتْ أَقْرَبَ فَأَلْحِقُوهُ بِأَهْلِهَا ، ‏‏‏‏‏‏قَالَ قَتَادَةُ:‏‏‏‏ فَحَدَّثَنَا الْحَسَنُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَمَّا حَضَرَهُ الْمَوْتُ احْتَفَزَ بِنَفْسِهِ فَقَرُبَ مِنَ الْقَرْيَةِ الصَّالِحَةِ، ‏‏‏‏‏‏وَبَاعَدَ مِنْهُ الْقَرْيَةَ الْخَبِيثَةَ فَأَلْحَقُوهُ بِأَهْلِ الْقَرْيَةِ الصَّالِحَةِ ."
      },
      {
        "id": 26977,
        "hadith_number": "2623",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Pilihan Bagi Mangsa Pembunuhan atau Kecederaan",
        "perawi_melayu": "Abu Sharaih Al-Khuzai رضي الله عنه",
        "english_text": "It was narrated from Abu Sharaih Al-Khuzai that the Messenger of Allah (ﷺ) said: “Whoever suffers from killing or wounding, has the choice of three things, and if he wants the fourth then restrain him. He may kill (the killer), or forgive him, or take the blood money. Whoever accepts any of these (options), then kills (the killer) after that will have the fire of hell to abide therein forever.”",
        "malay_translation": "Diriwayatkan daripada Abu Sharaih Al-Khuzai رضي الله عنه bahawa Rasulullah ﷺ bersabda: “Sesiapa yang ditimpa pembunuhan atau kecederaan, dia mempunyai pilihan tiga perkara, dan jika dia mahukan yang keempat, maka tahanlah dia. Dia boleh membunuh (pembunuh), atau memaafkannya, atau mengambil diyat (wang tebusan). Sesiapa yang menerima mana-mana pilihan ini, kemudian membunuh (pembunuh) selepas itu, maka baginya neraka Jahannam, kekal di dalamnya selama-lamanya.”",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ، ‏‏‏‏‏‏ وَأَبُو بَكْرٍ ابْنَا أَبِي شَيْبَةَ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ، ‏‏‏‏‏‏ح وَحَدَّثَنَا أبُو بَكْرٍ وَعُثْمَانُ ابْنَا أَبِي شَيْبَةَ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا جَرِيرٌ، ‏‏‏‏‏‏ وَعَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ جميعا، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ إِسْحَاق، ‏‏‏‏‏‏عَنِ الْحَارِثِ بْنِ فُضَيْلٍ، ‏‏‏‏‏‏أَظُنُّهُ عَنِ ابْنِ أَبِي الْعَوْجَاءِ وَاسْمُهُ سُفْيَانُ، ‏‏‏‏‏‏عَنْ أَبِي شُرَيْحٍ الْخُزَاعِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ أُصِيبَ بِدَمٍ أَوْ خَبْلٍ وَالْخَبْلُ الْجُرْحُ فَهُوَ بِالْخِيَارِ بَيْنَ إِحْدَى ثَلَاثٍ، ‏‏‏‏‏‏فَإِنْ أَرَادَ الرَّابِعَةَ فَخُذُوا عَلَى يَدَيْهِ:‏‏‏‏ أَنْ يَقْتُلَ أَوْ يَعْفُوَ أَوْ يَأْخُذَ الدِّيَةَ، ‏‏‏‏‏‏فَمَنْ فَعَلَ شَيْئًا مِنْ ذَلِكَ فَعَادَ، ‏‏‏‏‏‏فَإِنَّ لَهُ نَارَ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا ."
      },
      {
        "id": 26978,
        "hadith_number": "2624",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Pilihan Bagi Waris Mangsa Pembunuhan",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: “If a person's relative is killed, he has the choice of two things: He may either have the killer killed, or he may demand the blood money.”",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah رضي الله عنه bahawa Rasulullah ﷺ bersabda: “Sekiranya seseorang itu kehilangan saudara terdekatnya kerana dibunuh, dia mempunyai dua pilihan: Sama ada dia boleh menuntut supaya pembunuh itu dibunuh, atau dia boleh menuntut diyat (tebusan darah).”",
        "arabic_text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، ‏‏‏‏‏‏حَدَّثَنَا الْوَلِيدُ، ‏‏‏‏‏‏حَدَّثَنَا الْأَوْزَاعِيُّ، ‏‏‏‏‏‏حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ قُتِلَ لَهُ قَتِيلٌ فَهُوَ بِخَيْرِ النَّظَرَيْنِ:‏‏‏‏ إِمَّا أَنْ يَقْتُلَ وَإِمَّا أَنْ يُفْدَى ."
      },
      {
        "id": 26979,
        "hadith_number": "2625",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Penerimaan Diyat (Ganti Rugi) untuk Pembunuhan dalam Awal Islam",
        "perawi_melayu": "Ziyad bin Sa'd bin Dumairah (meriwayatkan)",
        "english_text": "It was narrated that Ziyad bin Sa'd bin Dumairah (said): “My father and my paternal uncle, who were present at Hunain with the Messenger of Allah (ﷺ) narrated to me: 'The Prophet (ﷺ) prayed Zuhr, then he sat beneath a tree. Aqra' bin Habis, who was the chief of Khindaf, came to him arguing in defense of Muhallim bin Jaththamah. Uyainah bin Hisn came to him demanding vengeance for 'Amir bin Adbat who was from the tribe of Ashja. The Prophet (ﷺ) said to them: “Will you accept the blood money?'” But they refused. Then a man from Banu Laith, whose name was Mukaital, stood up and said: 'O Messenger of Allah (ﷺ)! By Allah (SWT)! This man who was killed in the early days of Islam is like Sheep that come to drink but stones are thrown at them, so the last of them runs away (i.e. ,the murderer should be killed).' The Prophet (ﷺ) said: 'You will have fifty (camels) while we are traveling and fifty (camels) when we return.' So they accepted the blood money.”",
        "malay_translation": "Diriwayatkan bahawa Ziyad bin Sa'd bin Dumairah berkata: “Bapa saya dan bapa saudara sebelah bapa saya, yang hadir di Hunain bersama Rasulullah (ﷺ) meriwayatkan kepada saya: 'Nabi (ﷺ) menunaikan solat Zuhur, kemudian Baginda duduk di bawah sebatang pokok. Aqra' bin Habis, yang merupakan ketua Khindaf, datang kepada Baginda berhujah untuk membela Muhallim bin Jaththamah. 'Uyainah bin Hisn datang kepada Baginda menuntut bela atas kematian 'Amir bin Adbat yang berasal dari suku Ashja. Nabi (ﷺ) berkata kepada mereka: “Adakah kamu menerima diyat (ganti rugi)?” Tetapi mereka enggan. Kemudian seorang lelaki dari Bani Laith, yang bernama Mukaital, berdiri dan berkata: 'Wahai Rasulullah (ﷺ)! Demi Allah (SWT)! Lelaki yang terbunuh pada awal Islam ini adalah seperti kambing yang datang untuk minum tetapi dilempar batu kepada mereka, maka yang terakhir lari (iaitu, pembunuh harus dibunuh).' Nabi (ﷺ) berkata: 'Kamu akan mendapat lima puluh (unta) semasa kami dalam perjalanan dan lima puluh (unta) lagi apabila kami kembali.' Maka mereka menerima diyat (ganti rugi).",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ إِسْحَاق، ‏‏‏‏‏‏حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏عَنْ زَيْدِ بْنِ ضُمَيْرَةَ، ‏‏‏‏‏‏حَدَّثَنِي أَبِي وَعَمِّي وَكَانَا شَهِدَا حُنَيْنًا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ صَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ ثُمَّ جَلَسَ تَحْتَ شَجَرَةٍ، ‏‏‏‏‏‏فَقَامَ إِلَيْهِ الْأَقْرَعُ بْنُ حَابِسٍ وَهُوَ سَيِّدُ خِنْدِفٍ يَرُدُّ عَنْ دَمِ مُحَلِّمِ بْنِ جَثَّامَةَ وَقَامَ عُيَيْنَةُ بْنُ حِصْنٍ يَطْلُبُ بِدَمِ عَامِرِ بْنِ الْأَضْبَطِ وَكَانَ أَشْجَعِيًّا، ‏‏‏‏‏‏فَقَالَ لَهُمُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ تَقْبَلُونَ الدِّيَةَ ، ‏‏‏‏‏‏فَأَبَوْا، ‏‏‏‏‏‏فَقَامَ رَجُلٌ مِنْ بَنِي لَيْثٍ يُقَالُ لَهُ:‏‏‏‏ مُكَيْتِلٌ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏وَاللَّهِ مَا شَبَّهْتُ هَذَا الْقَتِيلَ فِي غُرَّةِ الْإِسْلَامِ إِلَّا كَغَنَمٍ وَرَدَتْ، ‏‏‏‏‏‏فَرُمِيَتْ أَوَّلُهَا فَنَفَرَ آخِرُهَا، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَكُمْ خَمْسُونَ فِي سَفَرِنَا، ‏‏‏‏‏‏وَخَمْسُونَ إِذَا رَجَعْنَا فَقَبِلُوا الدِّيَةَ."
      },
      {
        "id": 26980,
        "hadith_number": "2626",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukuman Pembunuhan Sengaja",
        "perawi_melayu": "'Amr bin Shu'aib, daripada bapanya, daripada datuknya",
        "english_text": "It was narrated from 'Amr bin Shu'aib, from this father, from his grandfather that the Messenger of Allah (ﷺ) said: “Whoever kills deliberately, he will be handed over to the heirs of the victim. If they want, they may kill him, or if they want, they may accept the blood money, which is thirty Hiqqah, thirty Jadha'ah and forty Khalifah. This is the blood money for deliberate slaying. Whatever is settled by reconciliation belongs to them, and that is a binding covenant.”",
        "malay_translation": "Diriwayatkan daripada 'Amr bin Shu'aib, daripada bapanya, daripada datuknya bahawa Rasulullah (ﷺ) bersabda: \"Sesiapa yang membunuh dengan sengaja, dia akan diserahkan kepada waris mangsa. Jika mereka mahu, mereka boleh membunuhnya, atau jika mereka mahu, mereka boleh menerima diyat (wang pampasan), iaitu tiga puluh Hiqqah, tiga puluh Jadha'ah dan empat puluh Khalifah. Ini adalah diyat bagi pembunuhan sengaja. Apa sahaja yang diputuskan melalui perdamaian adalah hak mereka, dan itu adalah perjanjian yang mengikat.\"",
        "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ الدِّمَشْقِيُّ، ‏‏‏‏‏‏حَدَّثَنَا أَبِي، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ رَاشِدٍ، ‏‏‏‏‏‏عَنْ سُلَيْمَانَ بْنِ مُوسَى، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ قَتَلَ عَمْدًا، ‏‏‏‏‏‏دُفِعَ إِلَى أَوْلِيَاءِ الْقَتِيلِ، ‏‏‏‏‏‏فَإِنْ شَاءُوا قَتَلُوا، ‏‏‏‏‏‏وَإِنْ شَاءُوا أَخَذُوا الدِّيَةَ، ‏‏‏‏‏‏وَذَلِكَ ثَلَاثُونَ حِقَّةً وَثَلَاثُونَ جَذَعَةً وَأَرْبَعُونَ خَلِفَةً، ‏‏‏‏‏‏وَذَلِكَ عَقْلُ الْعَمْدِ مَا صُولِحُوا عَلَيْهِ فَهُوَ لَهُمْ وَذَلِكَ تَشْدِيدُ الْعَقْلِ ."
      },
      {
        "id": 26981,
        "hadith_number": "2627",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Pembunuhan Tersilap: Denda Seratus Unta",
        "perawi_melayu": "Daripada Abdullah bin 'Amr",
        "english_text": "It was narrated from Abdullah bin 'Amr that the Prophet (ﷺ) said: “Killing by mistake that resembles intentionally, is killing with a whip or stick, for which the blood money is one hundred camels, of which forty should be pregnant she-camels in middle of their pregnancies, with their young in their wombs.”",
        "malay_translation": "Diriwayatkan daripada Abdullah bin 'Amr bahawa Nabi (ﷺ) bersabda: “Pembunuhan tersilap yang menyerupai pembunuhan yang disengajakan, adalah pembunuhan dengan cemeti atau tongkat, yang mana diyatnya (denda) adalah seratus ekor unta, yang mana empat puluh daripadanya adalah unta betina hamil pada pertengahan kehamilan, dengan anak-anak mereka di dalam perut mereka.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ أَيُّوبَ، ‏‏‏‏‏‏سَمِعْتُالْقَاسِمَ بْنَ رَبِيعَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ قَتِيلُ الْخَطَإِ شِبْهِ الْعَمْدِ قَتِيلُ السَّوْطِ وَالْعَصَا مِائَةٌ مِنَ الْإِبِلِ أَرْبَعُونَ مِنْهَا خَلِفَةً فِي بُطُونِهَا أَوْلَادُهَا ."
      },
      {
        "id": 26982,
        "hadith_number": "2628",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Khutbah Rasulullah (ﷺ) pada Hari Pembukaan Makkah",
        "perawi_melayu": "Daripada Ibnu Umar",
        "english_text": "It was narrated from Ibn Umar that : the Messenger of Allah (ﷺ) stood up on the Day of the conquest of Makkah, on the steps of the Ka'bah. He praised and glorified Allah (SWT), then he said: “Praise is to Allah (SWT) who has fulfilled His promise, granted victory to His slave and defeated the Confederates alone. The one who is killed by mistake is the one who is killed with a whip or a stick; for him the blood money is one hundred camels, of which forty should be pregnant she-camels with their youngs in their wombs. Every custom of Ignorance period, and every blood claim, is beneath these two feet of mine (i.e. is abolished), except for the custodianship of the Ka'bah and the provision of water for the pilgrims, which I confirm still belong to the people to whom they belonged before.”",
        "malay_translation": "Diriwayatkan daripada Ibnu Umar رضي الله عنه, bahawa Rasulullah (ﷺ) berdiri pada hari pembukaan Makkah di atas anak tangga Ka'bah. Baginda memuji dan mengagungkan Allah (SWT), kemudian baginda bersabda: “Segala puji bagi Allah (SWT) yang telah menunaikan janji-Nya, memberikan kemenangan kepada hamba-Nya dan mengalahkan golongan-golongan yang bersekutu seorang diri. Sesiapa yang terbunuh kerana tersilap adalah seperti dibunuh dengan cemeti atau tongkat; baginya diyat (denda darah) seratus ekor unta, yang mana empat puluh daripadanya adalah unta betina bunting yang anak-anaknya dalam kandungan. Setiap adat kebiasaan zaman Jahiliyyah, dan setiap tuntutan darah, adalah di bawah kedua-dua kaki aku (iaitu dibatalkan), kecuali penjagaan Ka'bah dan penyediaan air untuk para jemaah haji, yang mana aku tetapkan masih menjadi hak orang yang memilikinya sebelum ini.”",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الزُّهْرِيُّ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنِ ابْنِ جُدْعَانَ سَمِعَهُ مِنِ الْقَاسِمِ بْنِ رَبِيعَةَ، ‏‏‏‏‏‏عَنِابْنِ عُمَرَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ يَوْمَ فَتْحِ مَكَّةَ وَهُوَ عَلَى دَرَجِ الْكَعْبَةِ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ الْحَمْدُ لِلَّهِ الَّذِي صَدَقَ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الْأَحْزَابَ وَحْدَهُ، ‏‏‏‏‏‏أَلَا إِنَّ قَتِيلَ الْخَطَإِ قَتِيلَ السَّوْطِ وَالْعَصَا:‏‏‏‏ فِيهِ مِائَةٌ مِنَ الْإِبِلِ، ‏‏‏‏‏‏مِنْهَا أَرْبَعُونَ خَلِفَةً فِي بُطُونِهَا أَوْلَادُهَا، ‏‏‏‏‏‏أَلَا إِنَّ كُلَّ مَأْثُرَةٍ كَانَتْ فِي الْجَاهِلِيَّةِ، ‏‏‏‏‏‏وَدَمٍ تَحْتَ قَدَمَيَّ هَاتَيْنِ، ‏‏‏‏‏‏إِلَّا مَا كَانَ مِنْ سِدَانَةِ الْبَيْتِ وَسِقَايَةِ الْحَاجِّ، ‏‏‏‏‏‏أَلَا إِنِّي قَدْ أَمْضَيْتُهُمَا لِأَهْلِهِمَا كَمَا كَانَا ."
      },
      {
        "id": 26983,
        "hadith_number": "2629",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Jumlah Diyat (Ganti Rugi Darah) Sebanyak Dua Belas Ribu Dirham",
        "perawi_melayu": "Daripada Ibn 'Abbas",
        "english_text": "It was narrated from Ibn 'Abbas that : the Messenger of Allah (ﷺ) set the blood money at twelve thousand (Dirham).",
        "malay_translation": "Diriwayatkan daripada Ibn 'Abbas bahawa: Rasulullah (ﷺ) menetapkan diyat (ganti rugi darah) sebanyak dua belas ribu (Dirham).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا مُعَاذُ بْنُ هَانِئٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ مُسْلِمٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ دِينَارٍ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنِابْنِ عَبَّاسٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَنَّهُ جَعَلَ الدِّيَةَ اثْنَيْ عَشَرَ أَلْفًا ."
      },
      {
        "id": 26984,
        "hadith_number": "2630",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Diat Pembunuhan Tersilap dan Nilainya",
        "perawi_melayu": "'Amr bin Shu'aib, daripada bapanya, daripada datuknya",
        "english_text": "It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that the Messenger of Allah (ﷺ) said: “Whoever is killed by mistake, his blood money in camels is thirty Bint Makhad (a one-year-old she-camel), thirty Bint Labun (a two-year-old she-camel), thirty Hiqqah (a three-year-old she-camel) and ten Bani Labun (two-years-old male-camel).” The Messenger of Allah (ﷺ) used to fix the value (of the blood money for accidental killing) among town-dwellers at four hundred Dinar or the equivalent value in silver. When he calculated the price in terms of camels (for Bedouins), it would vary from one time to another. When prices roses, the value (in dinars) would rise: and when prices fell, the value (in Dinar) would fall. At the time of the Messenger of Allah (ﷺ) the value was between four hundred and eight hundred dinar, or the equivalent value in silver, eight thousand Dirham. And the Messenger of Allah (ﷺ) ruled that if a person's blood money was paid in cattle, among those who kept cattle, the amount was two hundred cows; and if person's blood money was paid in sheep, among those who kept sheep, the value was two thousand sheep. (Hasan).",
        "malay_translation": "Diriwayatkan daripada 'Amr bin Shu'aib, daripada bapanya, daripada datuknya, bahawa Rasulullah (ﷺ) bersabda: “Sesiapa yang terbunuh kerana tersilap, diyatnya dalam bentuk unta adalah tiga puluh Bint Makhad (unta betina berumur satu tahun), tiga puluh Bint Labun (unta betina berumur dua tahun), tiga puluh Hiqqah (unta betina berumur tiga tahun) dan sepuluh Bani Labun (unta jantan berumur dua tahun).” Rasulullah (ﷺ) menetapkan nilai (diyat bagi pembunuhan tidak sengaja) di kalangan penduduk bandar pada empat ratus Dinar atau nilai yang setara dalam perak. Apabila Baginda mengira harga dalam bentuk unta (untuk orang Badwi), ia akan berbeza dari satu masa ke masa lain. Apabila harga meningkat, nilai (dalam dinar) akan meningkat: dan apabila harga jatuh, nilai (dalam Dinar) akan jatuh. Pada zaman Rasulullah (ﷺ) nilai itu adalah antara empat ratus dan lapan ratus dinar, atau nilai yang setara dalam perak, lapan ribu Dirham. Dan Rasulullah (ﷺ) memutuskan bahawa jika diyat seseorang dibayar dalam bentuk ternakan, di kalangan mereka yang memelihara ternakan, jumlahnya adalah dua ratus ekor lembu; dan jika diyat seseorang dibayar dalam bentuk biri-biri, di kalangan mereka yang memelihara biri-biri, nilainya adalah dua ribu ekor biri-biri. (Hasan).",
        "arabic_text": "حَدَّثَنَا إِسْحَاق بْنُ مَنْصُورٍ الْمَرْوَزِيُّ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، ‏‏‏‏‏‏أَنْبَأَنَا مُحَمَّدُ بْنُ رَاشِدٍ، ‏‏‏‏‏‏عَنْ سُلَيْمَانَ بْنِ مُوسَى، ‏‏‏‏‏‏عَنْعَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ قُتِلَ خَطَأً، ‏‏‏‏‏‏فَدِيَتُهُ مِنَ الْإِبِلِ ثَلَاثُونَ بِنْتَ مَخَاضٍ وَثَلَاثُونَ بِنْتَ لَبُونٍ وَثَلَاثُونَ حِقَّةً وَعَشَرَةٌ بَنِي لَبُونٍ ، ‏‏‏‏‏‏وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَوِّمُهَا عَلَى أَهْلِ الْقُرَى أَرْبَعَ مِائَةِ دِينَارٍ أَوْ عَدْلَهَا مِنَ الْوَرِقِ، ‏‏‏‏‏‏وَيُقَوِّمُهَا عَلَى أَزْمَانِ الْإِبِلِ إِذَا غَلَتْ رَفَعَ ثَمَنَهَا، ‏‏‏‏‏‏وَإِذَا هَانَتْ نَقَصَ مِنْ ثَمَنِهَا عَلَى نَحْوِ الزَّمَانِ مَا كَانَ، ‏‏‏‏‏‏فَبَلَغَ قِيمَتُهَا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا بَيْنَ الْأَرْبَعِ مِائَةِ دِينَارٍ إِلَى ثَمَانِ مِائَةِ دِينَارٍ أَوْ عَدْلَهَا مِنَ الْوَرِقِ ثَمَانِيَةُ آلَافِ دِرْهَمٍ، ‏‏‏‏‏‏وَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَنَّ مَنْ كَانَ عَقْلُهُ فِي الْبَقَرِ عَلَى أَهْلِ الْبَقَرِ مِائَتَيْ بَقَرَةٍ وَمَنْ كَانَ عَقْلُهُ فِي الشَّاءِ عَلَى أَهْلِ الشَّاءِ أَلْفَيْ شَاةٍ ."
      },
      {
        "id": 26985,
        "hadith_number": "2631",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Diyat Kesilapan Pembunuhan",
        "perawi_melayu": "'Abdullah bin Mas'ud",
        "english_text": "It was narrated from 'Abdullah bin Masud that the Messenger of Allah (ﷺ) said: “The blood money of one who killed by mistake is twenty Hiqqah (three-year-old she camels), twenty Jadha'ah (four year old she camels), twenty Bint Makhad (one year old she camel), twenty Bint Labun (two year old she camels), and twenty Bani Makhad (one year old she camels).”",
        "malay_translation": "Diriwayatkan daripada 'Abdullah bin Mas'ud bahawa Rasulullah ﷺ bersabda: “Diyat bagi orang yang terbunuh secara tidak sengaja ialah dua puluh Hiqqah (unta betina berusia tiga tahun), dua puluh Jadha'ah (unta betina berusia empat tahun), dua puluh Bint Makhad (unta betina berusia satu tahun), dua puluh Bint Labun (unta betina berusia dua tahun), dan dua puluh Bani Makhad (unta betina berusia satu tahun).",
        "arabic_text": "حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ عَاصِمٍ، ‏‏‏‏‏‏حَدَّثَنَا الصَّبَّاحُ بْنُ مُحَارِبٍ، ‏‏‏‏‏‏حَدَّثَنَا حَجَّاجُ بْنُ أَرْطَاةَ، ‏‏‏‏‏‏حَدَّثَنَا زَيْدُ بْنُ جُبَيْرٍ، ‏‏‏‏‏‏عَنْخِشْفِ بْنِ مَالِكٍ الطَّائِيِّ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ فِي دِيَةِ الْخَطَإِ عِشْرُونَ حِقَّةً وَعِشْرُونَ جَذَعَةً وَعِشْرُونَ بِنْتَ مَخَاضٍ وَعِشْرُونَ بِنْتَ لَبُونٍ وَعِشْرُونَ بَنِي مَخَاضٍ ذُكُورٍ ."
      },
      {
        "id": 26986,
        "hadith_number": "2632",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Jumlah Diyat Sebanyak Dua Belas Ribu (Dirham)",
        "perawi_melayu": "Daripada 'Ikrimah, daripada Ibn 'Abbas",
        "english_text": "It was narrated from 'Ikrimah, from Ibn 'Abbas, that : the Prophet (ﷺ) set the blood money at twelve thousand (Dirham). He said: “This is what Allah says: 'And they could not find any cause to do so except that Allah and his Messenger (ﷺ) had enriched them of His bounty.'” He said: “By their taking the blood money.”",
        "malay_translation": "Diriwayatkan daripada 'Ikrimah, daripada Ibn 'Abbas, bahawa: Nabi (ﷺ) menetapkan diyat (denda darah) sebanyak dua belas ribu (Dirham). Baginda bersabda: “Inilah firman Allah: 'Dan mereka tidak mempunyai sebab untuk (membalas dendam) kecuali Allah dan Rasul-Nya telah mengkayakan mereka dari kurnia-Nya.'” Baginda bersabda: “Dengan mengambil diyat (denda darah) tersebut.”",
        "arabic_text": "حَدَّثَنَا الْعَبَّاسُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ مُسْلِمٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ دِينَارٍ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ جَعَلَ الدِّيَةَ اثْنَيْ عَشَرَ أَلْفًا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَذَلِكَ قَوْلُهُ وَمَا نَقَمُوا إِلا أَنْ أَغْنَاهُمُ اللَّهُ وَرَسُولُهُ مِنْ فَضْلِهِ سورة التوبة آية 74 قَالَ:‏‏‏‏ بِأَخْذِهِمُ الدِّيَةَ ."
      },
      {
        "id": 26987,
        "hadith_number": "2633",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kewajipan Membayar Diyat oleh 'Aqilah",
        "perawi_melayu": "Mughirah bin Shu'bah (Semoga Allah merahmatinya)",
        "english_text": "It was narrated that Mughirah bin Shu'bah said: “The Messenger of Allah (ﷺ) ruled that the blood money must be paid by the 'Aqilah.”",
        "malay_translation": "Diriwayatkan bahawa Mughirah bin Shu'bah berkata: \"Rasulullah (ﷺ) telah memutuskan bahawa diyat (pampasan darah) mesti dibayar oleh 'Aqilah.\"",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏حَدَّثَنَا أَبِي، ‏‏‏‏‏‏عَنْ مَنْصُورٍ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ عُبَيْدِ بْنِ نَضْلَةَ، ‏‏‏‏‏‏عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالدِّيَةِ عَلَى الْعَاقِلَةِ ."
      },
      {
        "id": 26988,
        "hadith_number": "2634",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Nabi ﷺ Pewaris Bagi Mereka yang Tiada Waris",
        "perawi_melayu": "Miqdam Ash-Shami",
        "english_text": "It was narrated from Miqdam Ash-Shami that the Messenger of Allah (ﷺ) said: “I am the heir of the one who has no heir, and I will pay blood money on his behalf and inherit from him, and the maternal uncle is the heir of the one who has no heir; he pays the blood money on his behalf and inherits from him.'\"",
        "malay_translation": "Diriwayatkan daripada Miqdam Ash-Shami bahawa Rasulullah ﷺ bersabda: “Aku adalah pewaris bagi sesiapa yang tiada waris, aku akan membayar diyat (wang pampasan) bagi pihaknya dan mewarisi daripadanya. Dan bapa saudara sebelah ibu adalah pewaris bagi sesiapa yang tiada waris; dia membayar diyat bagi pihaknya dan mewarisi daripadanya.”",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ دُرُسْتَ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، ‏‏‏‏‏‏عَنْ بُدَيْلِ بْنِ مَيْسَرَةَ، ‏‏‏‏‏‏عَنْ عَلِيِّ بْنِ أَبِي طَلْحَةَ، ‏‏‏‏‏‏عَنْ رَاشِدِ بْنِ سَعْدٍ، ‏‏‏‏‏‏عَنْ أَبِي عَامِرٍ الْهَوْزَنِيِّ، ‏‏‏‏‏‏عَنِ الْمِقْدَامِ الشَّامِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَنَا وَارِثُ مَنْ لَا وَارِثَ لَهُ أَعْقِلُ عَنْهُ وَأَرِثُهُ وَالْخَالُ وَارِثُ مَنْ لَا وَارِثَ لَهُ يَعْقِلُ عَنْهُ وَيَرِثُهُ ."
      },
      {
        "id": 26989,
        "hadith_number": "2635",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukuman bagi Pembunuhan Secara Tidak Sengaja dan Sengaja",
        "perawi_melayu": "Daripada Ibnu Abbas رضي الله عنه, yang meriwayatkannya daripada Nabi ﷺ",
        "english_text": "It was narrated from Ibn 'Abbas, who attributed it to the Prophet (ﷺ): “Whoever kills out of folly or for tribal motives, using a rock, a whip, or a stick; he must pay the blood money for killing by mistake. Whoever kills deliberately, he is to be killed in retaliation. Whoever tries to prevent that, upon him is the curse of Allah, the angels and all the people, and no change nor equitable exchange will be accepted from him.”",
        "malay_translation": "Diriwayatkan daripada Ibnu Abbas رضي الله عنه, yang meriwayatkannya daripada Nabi ﷺ: \"Sesiapa yang membunuh kerana kejahilan atau sebab puak, dengan menggunakan batu, cemeti, atau kayu; dia wajib membayar diyat (tebusan darah) bagi pembunuhan secara tersilap. Sesiapa yang membunuh dengan sengaja, dia akan dibunuh sebagai hukuman balas. Sesiapa yang cuba menghalang hukuman tersebut, ke atasnya laknat Allah, para malaikat dan seluruh manusia, dan tidak diterima daripadanya sebarang perubahan mahupun tebusan yang adil.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، ‏‏‏‏‏‏حَدَّثَنَا سُلَيْمَانُ بْنُ كَثِيرٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ دِينَارٍ، ‏‏‏‏‏‏عَنْ طَاوُسٍ، ‏‏‏‏‏‏عَنِابْنِ عَبَّاسٍ رَفَعَهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ قَتَلَ فِي عِمِّيَّةٍ أَوْ عَصَبِيَّةٍ بِحَجَرٍ أَوْ سَوْطٍ أَوْ عَصًا، ‏‏‏‏‏‏فَعَلَيْهِ عَقْلُ الْخَطَإِ، ‏‏‏‏‏‏وَمَنْ قَتَلَ عَمْدًا فَهُوَ قَوَدٌ وَمَنْ حَالَ بَيْنَهُ وَبَيْنَهُ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ لَا يُقْبَلُ مِنْهُ صَرْفٌ وَلَا عَدْلٌ ."
      },
      {
        "id": 26990,
        "hadith_number": "2636",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukuman Diyat dan Penolakan Qisas dalam Kes Cedera",
        "perawi_melayu": "Nimran bin Jariyah, daripada bapanya",
        "english_text": "Nimran bin Jariyah narrated from his father that : a man struck another man on the wrist with his sword and severed it, not at the joint. He appealed to the Prophet (ﷺ) who ordered that the Diyah be paid. The man said: “O Messenger of Allah (ﷺ), I want retaliation.” He said: “Take the compensation and may Allah bless you therein.” And he did not rule that he be allowed retaliation.",
        "malay_translation": "Nimran bin Jariyah meriwayatkan daripada bapanya bahawa: Seorang lelaki memukul lelaki lain pada pergelangan tangannya dengan pedang dan memotongnya, bukan pada sendi. Lelaki itu mengadu kepada Nabi (ﷺ) yang memerintahkan supaya Diyat dibayar. Lelaki itu berkata: “Wahai Rasulullah (ﷺ), saya mahu qisas.” Baginda bersabda: “Ambillah pampasan itu dan semoga Allah memberkati kamu di dalamnya.” Dan baginda tidak memutuskan bahawa lelaki itu dibenarkan untuk qisas.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، ‏‏‏‏‏‏ وَعَمَّارُ بْنُ خَالِدٍ الْوَاسِطِيُّ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، ‏‏‏‏‏‏عَنْ دَهْثَمِ بْنِ قُرَّانَ، ‏‏‏‏‏‏حَدَّثَنِينِمْرَانُ بْنُ جَارِيَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏أَنَّ رَجُلًا ضَرَبَ رَجُلًا عَلَى سَاعِدِهِ بِالسَّيْفِ فَقَطَعَهَا مِنْ غَيْرِ مَفْصِلٍ، ‏‏‏‏‏‏فَاسْتَعْدَى عَلَيْهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ لَهُ بِالدِّيَةِ فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِنِّي أُرِيدُ الْقِصَاصَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ خُذْ الدِّيَةَ بَارَكَ اللَّهُ لَكَ فِيهَا وَلَمْ يَقْضِ لَهُ بِالْقِصَاصِ."
      },
      {
        "id": 26991,
        "hadith_number": "2637",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Tiada Qisas bagi Luka Tertentu",
        "perawi_melayu": "'Abbas bin 'Abdul-Muttalib",
        "english_text": "It was narrated from 'Abbas bin 'Abdul-Muttalib that the Messenger of Allah (ﷺ) said: “There is no retaliation for a head wound that does not reach the brain, a spear wound that does not penetrate deeply, or a wound that dislocates a bone.”",
        "malay_translation": "Diriwayatkan daripada 'Abbas bin 'Abdul-Muttalib bahawa Rasulullah (ﷺ) bersabda: “Tiada qisas bagi luka di kepala yang tidak sampai ke otak, luka akibat tusukan lembing yang tidak menembusi dalam, atau luka yang menyebabkan tulang terkehel.”",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، ‏‏‏‏‏‏حَدَّثَنَا رِشْدِينُ بْنُ سَعْدٍ، ‏‏‏‏‏‏عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، ‏‏‏‏‏‏عَنْ مُعَاذِ بْنِ مُحَمَّدٍ الْأَنْصَارِيِّ، ‏‏‏‏‏‏عَنِ ابْنِ صُهْبَانَ، ‏‏‏‏‏‏عَنِ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا قَوَدَ فِي الْمَأْمُومَةِ وَلَا الْجَائِفَةِ وَلَا الْمُنَقِّلَةِ ."
      },
      {
        "id": 26992,
        "hadith_number": "2638",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kisah Abu Jahm dan Perjanjian Pihak yang Bertikai",
        "perawi_melayu": "'Aishah رضي الله عنها",
        "english_text": "It was narrated from 'Aishah that : the Messenger of Allah (ﷺ) sent Abu Jahm bin Hudhaifah to collect Sadaqah. A man disputed with him concerning his Sadaqah, and Abu Jahm struck him and wounded his head. They came to Prophet (ﷺ) and said: “Compensatory money, O Messenger of Allah (ﷺ)!” The Prophet (ﷺ) said: “You will have such and such,” but they did not accept that. He said: “You will have such and such,” and they agreed. Then the Prophet (ﷺ) said: “I am going to address the people and tell them that you agreed.” They said: “Yes.” So the Prophet (ﷺ) addressed (the people) and said: “These people of Laith came to me seeking compensatory money, and I have offered them such and such. Do you agree?” They said: “No.” The Emigrants wanted to attack them, but the Prophet (ﷺ) told them not to, so they refrained. Then he called them and offered them more and said: “Do you agree?” They said: “Yes.” He said: “I am going to address the people and tell them that you agreed.” They said: “Yes.” So the Prophet (ﷺ) addressed (the people) then said: “Do you Agree?” They said: “Yes.”",
        "malay_translation": "Diriwayatkan daripada 'Aishah رضي الله عنها bahawa: Rasulullah ﷺ mengutus Abu Jahm bin Hudhaifah untuk mengumpul Sadaqah. Seorang lelaki bertengkar dengannya mengenai Sadaqahnya, dan Abu Jahm memukulnya dan mencederakan kepalanya. Mereka datang kepada Nabi ﷺ dan berkata: “Wang pampasan, wahai Rasulullah ﷺ!” Nabi ﷺ bersabda: “Kamu akan mendapat begini dan begitu,” tetapi mereka tidak menerimanya. Baginda bersabda: “Kamu akan mendapat begini dan begitu,” dan mereka bersetuju. Kemudian Nabi ﷺ bersabda: “Aku akan berucap kepada orang ramai dan memberitahu mereka bahawa kamu telah bersetuju.” Mereka berkata: “Ya.” Maka Nabi ﷺ berucap (kepada orang ramai) dan bersabda: “Orang-orang Laith ini datang kepadaku meminta wang pampasan, dan aku telah menawarkan mereka begini dan begitu. Adakah kamu bersetuju?” Mereka berkata: “Tidak.” Kaum Muhajirin ingin menyerang mereka, tetapi Nabi ﷺ menyuruh mereka jangan berbuat demikian, maka mereka menahan diri. Kemudian baginda memanggil mereka dan menawarkan mereka lebih lagi dan bersabda: “Adakah kamu bersetuju?” Mereka berkata: “Ya.” Baginda bersabda: “Aku akan berucap kepada orang ramai dan memberitahu mereka bahawa kamu telah bersetuju.” Mereka berkata: “Ya.” Maka Nabi ﷺ berucap (kepada orang ramai) kemudian bersabda: “Adakah kamu bersetuju?” Mereka berkata: “Ya.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَنْبَأَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ أَبَا جَهْمِ بْنَ حُذَيْفَةَ مُصَدِّقًا فَلَاجَّهُ رَجُلٌ فِي صَدَقَتِهِ فَضَرَبَهُ أَبُو جَهْمٍ فَشَجَّهُ، ‏‏‏‏‏‏فَأَتَوْا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالُوا:‏‏‏‏ الْقَوَدَ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَكُمْ كَذَا وَكَذَا فَلَمْ يَرْضَوْا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ لَكُمْ كَذَا وَكَذَا فَرَضُوا، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنِّي خَاطِبٌ عَلَى النَّاسِ وَمُخْبِرُهُمْ بِرِضَاكُمْ ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏فَخَطَبَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ:‏‏‏‏ إِنَّ هَؤُلَاءِ اللَّيْثِيِّينَ أَتَوْنِي يُرِيدُونَ الْقَوَدَ، ‏‏‏‏‏‏فَعَرَضْتُ عَلَيْهِمْ كَذَا وَكَذَا أَرَضِيتُمْ ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ لَا، ‏‏‏‏‏‏فَهَمَّ بِهِمْ الْمُهَاجِرُونَ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَكُفُّوا فَكَفُّوا ثُمَّ دَعَاهُمْ فَزَادَهُمْ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَرَضِيتُمْ؟ قَالُوا:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنِّي خَاطِبٌ عَلَى النَّاسِ وَمُخْبِرُهُمْ بِرِضَاكُمْ ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏فَخَطَبَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ أَرَضِيتُمْ ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ نَعَمْ. قَالَ ابْن مَاجَةَ:‏‏‏‏ سَمِعْت مُحَمَّدَ بْنَ يَحْيَى يَقُولُ:‏‏‏‏ تَفَرَّدَ بِهَذَا مَعْمَرٌ لَا أَعْلَمُ رَوَاهُ غَيْرُهُ."
      },
      {
        "id": 26993,
        "hadith_number": "2639",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukum Rasulullah SAW Tentang Denda Bagi Janin",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "It was narrated that Abu Hurairah said: “The Messenger of Allah (ﷺ) ruled concerning a fetus that (the blood money) was a slave, male and female. The one against whom this verdict was passed said: ' Should we pay blood money for one who neither ate, drunk, shouted, nor cried, (at the moment of birth)? One such as this should be overlooked .' The Messenger of Allah (ﷺ) said: 'This man speaks like a poet. (But the blood money for a fetus is) a slave, male, or female.'\"",
        "malay_translation": "Diriwayatkan bahawa Abu Hurairah رضي الله عنه berkata: \"Rasulullah ﷺ telah memutuskan berkenaan janin bahawa (denda diyatnya) ialah seorang hamba lelaki atau perempuan. Orang yang dikenakan keputusan ini berkata: 'Patutkah kami membayar diyat bagi seseorang yang tidak makan, tidak minum, tidak menjerit, dan tidak menangis (pada saat kelahiran)? Orang seperti ini sepatutnya diabaikan.' Rasulullah ﷺ bersabda: 'Orang ini bercakap seperti seorang penyair. (Tetapi diyat bagi janin adalah) seorang hamba, lelaki atau perempuan.'",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ عَمْرٍو، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْجَنِينِ بِغُرَّةٍ عَبْدٍ أَوْ أَمَةٍ، ‏‏‏‏‏‏فَقَالَ الَّذِي قُضِيَ عَلَيْهِ:‏‏‏‏ أَنَعْقِلُ مَنْ لَا شَرِبَ وَلَا أَكَلَ وَلَا صَاحَ وَلَا اسْتَهَلَّ وَمِثْلُ ذَلِكَ يُطَلُّ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ هَذَا لَيَقُولُ بِقَوْلِ شَاعِرٍ فِيهِ غُرَّةٌ عَبْدٌ أَوْ أَمَةٌ ."
      },
      {
        "id": 26994,
        "hadith_number": "2640",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukum Diyat Ke Atas Keguguran: Kesaksian Mughirah bin Shu'bah dan Muhammad bin Maslamah",
        "perawi_melayu": "Miswar bin Makhramah",
        "english_text": "It was narrated that Miswar bin Makhramah said: “Umar bin Khattab consulted the people concerning a woman who had been caused to miscarry. Al-Mughirah bin Shu'bah said: 'I saw the messenger of Allah (ﷺ) rule that a slave, male or female, be given as blood money (for a fetus).' 'Umar said: 'Bring me someone who will testify alongside you. So he brought Muhammad bin Maslamah to testify along with him.'”",
        "malay_translation": "Diriwayatkan bahawa Miswar bin Makhramah berkata: “Umar bin Khattab telah berunding dengan orang ramai mengenai seorang wanita yang mengalami keguguran. Al-Mughirah bin Shu'bah berkata: 'Saya melihat Rasulullah (ﷺ) menetapkan bahawa seorang hamba, lelaki atau perempuan, diberikan sebagai diyat (ganti rugi) bagi janin.' 'Umar berkata: 'Bawalah seseorang yang akan memberi kesaksian bersama kamu.' Lalu, dia membawa Muhammad bin Maslamah untuk memberi kesaksian bersamanya.”",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏ وَعَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ اسْتَشَارَ عُمَرُ بْنُ الْخَطَّابِ النَّاسَ فِي إِمْلَاصِ الْمَرْأَةِ يَعْنِي سِقْطَهَا، ‏‏‏‏‏‏فَقَالَ الْمُغِيرَةُ بْنُ شُعْبَةَ:‏‏‏‏ شَهِدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى فِيهِ بِغُرَّةٍ عَبْدٍ أَوْ أَمَةٍ ، ‏‏‏‏‏‏فَقَالَ عُمَرُ:‏‏‏‏ ائْتِنِي بِمَنْ يَشْهَدُ مَعَكَ، ‏‏‏‏‏‏فَشَهِدَ مَعَهُ مُحَمَّدُ بْنُ مَسْلَمَةَ ."
      },
      {
        "id": 26995,
        "hadith_number": "2641",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukum Nabi (ﷺ) Berkaitan Fetus dan Pembunuhan",
        "perawi_melayu": "Umar bin Khattab (Semoga Allah meredhainya)",
        "english_text": "It was narrated from 'Umar bin Khattab that : he asked the people about the ruling of the Prophet (ﷺ) concerning that - concerning a fetus. Hamal bin Malik bin Nabighah stood up and said: “I was between my two wives and one of them struck the other with a tent-pole, killing her and a fetus. The Messenger of Allah (ﷺ) ruled that the blood money for the fetus was a slave, and that she would be killed in retaliation.”",
        "malay_translation": "Diriwayatkan daripada 'Umar bin Khattab bahawa: beliau bertanya kepada orang ramai tentang hukum Nabi (ﷺ) berkaitan perkara tersebut - berkaitan fetus. Hamal bin Malik bin Nabighah bangun dan berkata: “Saya berada di antara dua isteri saya dan salah seorang daripada mereka memukul yang lain dengan tiang khemah, membunuhnya dan fetusnya. Rasulullah (ﷺ) memutuskan bahawa diyat (pampasan darah) bagi fetus adalah seorang hamba, dan bahawa wanita itu akan dibunuh sebagai balasan.”",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو عَاصِمٍ، ‏‏‏‏‏‏أَخْبَرَنِي ابْنُ جُرَيْجٍ، ‏‏‏‏‏‏حَدَّثَنِي عَمْرُو بْنُ دِينَارٍ أَنَّهُ سَمِعَ طَاوُسًا، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏عَنْ عُمَرَ بْنِ الْخَطَّابِ أَنَّهُ نَشَدَ النَّاسَ قَضَاءَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ذَلِكَ يَعْنِي فِي الْجَنِينِ، ‏‏‏‏‏‏فَقَامَ حَمَلُ بْنُ مَالِكِ بْنِ النَّابِغَةِ فَقَالَ:‏‏‏‏ كُنْتُ بَيْنَ امْرَأَتَيْنِ لِي فَضَرَبَتْ إِحْدَاهُمَا الْأُخْرَى بِمِسْطَحٍ فَقَتَلَتْهَا وَقَتَلَتْ جَنِينَهَا:‏‏‏‏ فَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْجَنِينِ بِغُرَّةٍ عَبْدٍ وَأَنْ تُقْتَلَ بِهَا ."
      },
      {
        "id": 26996,
        "hadith_number": "2642",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Isteri Menerima Pusaka Diyat daripada Suaminya",
        "perawi_melayu": "Sa'eed bin Musayyab",
        "english_text": "It was narrated from Sa'eed bin Musayyab that 'Umar used to say: “The blood money is for the near male relatives from the father's side and the wife does not inherit anything from the blood money of her husband,” until Ad-Dahhak bin Sufyan wrote to him, and told him that the Prophet (ﷺ) ruled that the wife of Ashyam bin Dibabi should inherit from the blood money of her husband.",
        "malay_translation": "Diriwayatkan daripada Sa'eed bin Musayyab bahawa 'Umar radhiyallahu 'anhu pernah berkata: “Diyat (pampasan darah) adalah untuk kaum kerabat lelaki yang terdekat daripada pihak bapa dan isteri tidak mewarisi apa-apa daripada diyat suaminya,” sehinggalah Ad-Dahhak bin Sufyan menulis surat kepadanya, dan memberitahunya bahawa Nabi (ﷺ) telah memutuskan bahawa isteri Ashyam bin Dibabi berhak mewarisi diyat daripada suaminya.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بِنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، ‏‏‏‏‏‏أَنَّ عُمَرَ كَانَ يَقُولُ:‏‏‏‏ الدِّيَةُ لِلْعَاقِلَةِ، ‏‏‏‏‏‏وَلَا تَرِثُ الْمَرْأَةُ مِنْ دِيَةِ زَوْجِهَا شَيْئًا حَتَّى كَتَبَ إِلَيْهِ الضَّحَّاكُ بْنُ سُفْيَانَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَّثَ امْرَأَةَ أَشْيَمَ الضِّبَابِيِّ مِنْ دِيَةِ زَوْجِهَا ."
      },
      {
        "id": 26997,
        "hadith_number": "2643",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukum Nabi (ﷺ) tentang Warisan Suami yang Isterinya Dibunuh",
        "perawi_melayu": "'Ubadah bin Samit (رَضِيَ ٱللَّٰهُ عَنْهُ)",
        "english_text": "It was narrated from 'Ubadah bin Samit: That the Prophet (ﷺ) ruled that Hamal bin Malik Hudhali Al-Lihyani should inherit from his wife who was killed by his other wife.",
        "malay_translation": "Diriwayatkan daripada 'Ubadah bin Samit (رَضِيَ ٱللَّٰهُ عَنْهُ): Bahawa Nabi (ﷺ) telah memutuskan bahawa Hamal bin Malik Hudhali Al-Lihyani berhak mewarisi daripada isterinya yang dibunuh oleh isteri beliau yang lain.",
        "arabic_text": "حَدَّثَنَا عَبْدُ رَبِّهِ بْنُ خَالِدٍ النُّمَيْرِيُّ، ‏‏‏‏‏‏حَدَّثَنَا الْفُضَيْلُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، ‏‏‏‏‏‏عَنْ إِسْحَاق بْنِ يَحْيَى بْنِ الْوَلِيدِ، ‏‏‏‏‏‏عَنْ عُبَادَةَ بْنِ الصَّامِتِ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ قَضَى لِحَمَلِ بْنِ مَالِكٍ الْهُذَلِيِّ اللِّحْيَانِيِّ بِمِيرَاثِهِ مِنَ امْرَأَتِهِ الَّتِي قَتَلَتْهَا امْرَأَتُهُ الْأُخْرَى ."
      },
      {
        "id": 26998,
        "hadith_number": "2644",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Diyat Ahl al-Kitab Separuh daripada Diyat Muslimin",
        "perawi_melayu": "'Amr bin Shu'aib, daripada datuknya",
        "english_text": "It was narrated from 'Amr bin Shu'aib, from his grandfather, that : the Messenger of Allah (ﷺ) ruled that the blood money for the people of the book is half of that of the blood money for the Muslims, and they are the Jews and Christians.",
        "malay_translation": "Diriwayatkan daripada 'Amr bin Shu'aib, daripada datuknya, bahawa: Rasulullah (ﷺ) telah memutuskan bahawa diyat (pampasan darah) bagi Ahl al-Kitab (Ahli Kitab) adalah separuh daripada diyat bagi orang Islam, iaitu mereka adalah orang Yahudi dan Kristian.",
        "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيل، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَيَّاشٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْأَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ قَضَى أَنَّ عَقْلَ أَهْلِ الْكِتَابَيْنِ نِصْفُ عَقْلِ الْمُسْلِمِينَ وَهُمْ الْيَهُودُ وَالنَّصَارَى ."
      },
      {
        "id": 26999,
        "hadith_number": "2645",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Pembunuh Tidak Mewarisi",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "It was narrated from Abu Hurairah that : the Messenger of Allah (ﷺ) said: “The killer does not inherit.”",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah bahawa: Rasulullah (ﷺ) bersabda: “Pembunuh tidak mewarisi.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ، ‏‏‏‏‏‏أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، ‏‏‏‏‏‏عَنْ إِسْحَاق بْنِ أَبِي فَرْوَةَ، ‏‏‏‏‏‏عَنِ ابْنِ شِهَابٍ، ‏‏‏‏‏‏عَنْ حُمَيْدٍ، ‏‏‏‏‏‏عَنْأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ الْقَاتِلُ لَا يَرِثُ ."
      },
      {
        "id": 27000,
        "hadith_number": "2646",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Pembunuh Tidak Mewarisi Harta Pusaka",
        "perawi_melayu": "'Amr bin Shu'aib",
        "english_text": "It was narrated from 'Amr bin Shu'aib that : Abu Qatadah, a man from Banu Mudlij, killed his son, and 'Umar took one hundred camels from him, thirty Hiqqah, thirty Jadha'ah and forty Khalifah. Then he said: “Where is the brother of slain? I heard the Messenger of Allah (ﷺ) say: 'The killer does not inherit.'",
        "malay_translation": "Diriwayatkan daripada 'Amr bin Shu'aib bahawa: Abu Qatadah, seorang lelaki dari Bani Mudlij, membunuh anaknya, dan 'Umar mengambil seratus unta daripadanya, tiga puluh Hiqqah, tiga puluh Jadha'ah dan empat puluh Khalifah. Kemudian dia berkata: “Di manakah saudara lelaki si mati? Aku mendengar Rasulullah (ﷺ) bersabda: 'Pembunuh tidak mewarisi.' ",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، ‏‏‏‏‏‏ وَعَبْدُ اللَّهِ بْنُ سَعِيدٍ الْكِنْدِيُّ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏أَنَّ أَبَا قَتَادَةَ رَجُلٌ مِنْ بَنِي مُدْلِجٍ قَتَلَ ابْنَهُ، ‏‏‏‏‏‏فَأَخَذَ مِنْهُ عُمَرُ مِائَةً مِنَ الْإِبِلِ ثَلَاثِينَ حِقَّةً وَثَلَاثِينَ جَذَعَةً وَأَرْبَعِينَ خَلِفَةً، ‏‏‏‏‏‏فَقَالَ ابْنُ أَخِي الْمَقْتُولِ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ لَيْسَ لِقَاتِلٍ مِيرَاثٌ ."
      },
      {
        "id": 27001,
        "hadith_number": "2647",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kewajipan Membayar Diyat Wanita oleh Waris Lelakinya",
        "perawi_melayu": "'Amr bin Shu'aib, daripada bapanya, daripada datuknya",
        "english_text": "It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said: “The Messenger of Allah (ﷺ) ruled that a woman's blood money (if she kills someone) should be paid by her male relatives on her father's side, whoever they are, and they should not inherit anything from her, except what is left over after her heirs have been taken their shares. If she is killed than her blood money is to be shared among her heirs, since they are the ones who may kill the one who killed her.”",
        "malay_translation": "Diriwayatkan daripada 'Amr bin Shu'aib, daripada bapanya, bahawa datuknya berkata: “Rasulullah (ﷺ) telah memutuskan bahawa diyat seorang wanita (jika dia membunuh seseorang) hendaklah dibayar oleh waris lelaki daripada sebelah bapanya, sesiapa sahaja mereka, dan mereka tidak berhak mewarisi apa-apa daripada wanita tersebut, melainkan apa yang lebih selepas warisnya mengambil bahagian mereka. Sekiranya dia dibunuh, maka diyatnya hendaklah dibahagikan di kalangan warisnya, kerana merekalah yang boleh membunuh orang yang membunuhnya.”",
        "arabic_text": "حَدَّثَنَا إِسْحَاق بْنُ مَنْصُورٍ، ‏‏‏‏‏‏أَنْبَأَنَا يَزِيدُ بْنُ هَارُونَ، ‏‏‏‏‏‏أَنْبَأَنَا مُحَمَّدُ بْنُ رَاشِدٍ، ‏‏‏‏‏‏عَنْ سُلَيْمَانَ بْنِ مُوسَى، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَعْقِلَ الْمَرْأَةَ عَصَبَتُهَا مَنْ كَانُوا وَلَا يَرِثُوا مِنْهَا شَيْئًا إِلَّا مَا فَضَلَ عَنْ وَرَثَتِهَا وَإِنْ قُتِلَتْ فَعَقْلُهَا بَيْنَ وَرَثَتِهَا فَهُمْ يَقْتُلُونَ قَاتِلَهَا ."
      },
      {
        "id": 27002,
        "hadith_number": "2648",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukum Diyat dan Pusaka dalam Kes Pembunuhan",
        "perawi_melayu": "Jabir",
        "english_text": "It was narrated that Jabir said: “The Messenger of Allah (ﷺ) ruled that the blood money should be paid by the near male relations from the father's side of the killer, and the such relatives of slain woman said: 'O Messenger of Allah (ﷺ),her legacy is for us.' He said: 'No, her legacy is for her husband and children.”",
        "malay_translation": "Diriwayatkan daripada Jabir, beliau berkata: “Rasulullah (ﷺ) telah menetapkan bahawa diyat (pampasan darah) hendaklah dibayar oleh kaum lelaki yang terdekat dari sebelah bapa kepada pembunuh. Lalu keluarga si mati berkata: ‘Wahai Rasulullah (ﷺ), pusakanya adalah untuk kami.’ Baginda bersabda: ‘Tidak, pusakanya adalah untuk suami dan anak-anaknya.’”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا الْمُعَلَّى بْنُ أَسَدٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، ‏‏‏‏‏‏حَدَّثَنَا مُجَالِدٌ، ‏‏‏‏‏‏عَنِ الشَّعْبِيِّ، ‏‏‏‏‏‏عَنْجَابِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ جَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الدِّيَةَ عَلَى عَاقِلَةِ الْقَاتِلَةِ ، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ عَاقِلَةُ الْمَقْتُولَةِ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏مِيرَاثُهَا لَنَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا مِيرَاثُهَا لِزَوْجِهَا وَوَلَدِهَا ."
      },
      {
        "id": 27003,
        "hadith_number": "2649",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kisah Rubai dan Qisas",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "It was narrated that Anas said: “Rubai, the paternal aunt of Anas, broke the tooth of a girl and they (her family) asked (the girl's family) to let her off, but they refused. They offered to pay compensatory money, but they refused. So they came to Prophet (ﷺ) who ordered retaliation. Anas bin Nadr said: 'O Messenger of Allah (ﷺ), will the tooth of Rubai' be broken? By the One Who sent you with the truth, it will not be broken!' The Prophet (ﷺ) said: 'O Anas, what Allah has decreed is retaliation.' So the people accepted that and forgave her. The Messenger of Allah (ﷺ) said: 'there are among the slaves of Allah those who, if they swear by Allah, Allah fulfills their oath.”",
        "malay_translation": "Diriwayatkan daripada Anas, beliau berkata: \"Rubai', ibu saudara sebelah bapa Anas, telah memecahkan gigi seorang gadis. Keluarga gadis itu meminta agar Rubai' dimaafkan, tetapi mereka enggan. Mereka menawarkan wang pampasan, tetapi mereka enggan. Lalu mereka datang kepada Nabi (ﷺ) yang memerintahkan qisas (hukuman balas). Anas bin Nadr berkata: 'Wahai Rasulullah (ﷺ), adakah gigi Rubai' akan dipecahkan? Demi (Allah) yang mengutusmu dengan kebenaran, ia tidak akan dipecahkan!' Nabi (ﷺ) bersabda: 'Wahai Anas, apa yang Allah tetapkan adalah qisas.' Lalu kaum itu menerima dan memaafkannya. Rasulullah (ﷺ) bersabda: 'Sesungguhnya di antara hamba-hamba Allah ada orang yang jika mereka bersumpah atas nama Allah, Allah akan memenuhi sumpah mereka.'\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى أَبُو مُوسَى، ‏‏‏‏‏‏حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، ‏‏‏‏‏‏ وَابْنُ أَبِي عَدِيٍّ، ‏‏‏‏‏‏عَنْ حُمَيْدٍ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَسَرَتْ الرُّبَيِّعُ عَمَّةُ أَنَسٍ ثَنِيَّةَ جَارِيَةٍ، ‏‏‏‏‏‏فَطَلَبُوا الْعَفْوَ، ‏‏‏‏‏‏فَأَبَوْا فَعَرَضُوا عَلَيْهِمُ الْأَرْشَ، ‏‏‏‏‏‏فَأَبَوْا، ‏‏‏‏‏‏فَأَتَوُا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِالْقِصَاصِ، ‏‏‏‏‏‏فَقَالَ أَنَسُ بْنُ النَّضْرِ:‏‏‏‏ يَا رَسُولَ اللَّهِ تُكْسَرُ ثَنِيَّةُ الرُّبَيِّعِ وَالَّذِي بَعَثَكَ بِالْحَقِّ لَا تُكْسَرُ، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَا أَنَسُ كِتَابُ اللَّهِ الْقِصَاصُ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَرَضِيَ الْقَوْمُ فَعَفَوْا، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ مِنْ عِبَادِ اللَّهِ مَنْ لَوْ أَقْسَمَ عَلَى اللَّهِ لَأَبَرَّةُ ."
      },
      {
        "id": 27004,
        "hadith_number": "2650",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Semua Gigi Sama: Gigi Kacip dan Geraham",
        "perawi_melayu": "Daripada Ibnu Abbas",
        "english_text": "It was narrated from Ibn 'Abbas that the Messenger of Allah (ﷺ) said: “Teeth are all the same; the incisor and the molar are the same.”",
        "malay_translation": "Diriwayatkan daripada Ibnu Abbas bahawa Rasulullah (ﷺ) bersabda: “Semua gigi adalah sama; gigi kacip dan geraham adalah sama.”",
        "arabic_text": "حَدَّثَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، ‏‏‏‏‏‏حَدَّثَنِي شُعْبَةُ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْعِكْرِمَةَ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ الْأَسْنَانُ سَوَاءٌ الثَّنِيَّةُ، ‏‏‏‏‏‏وَالضِّرْسُ سَوَاءٌ ."
      },
      {
        "id": 27005,
        "hadith_number": "2651",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Ketetapan Nabi (ﷺ) Mengenai Diyat Gigi",
        "perawi_melayu": "Daripada Ibnu 'Abbas رضي الله عنه",
        "english_text": "It was narrated from Ibn 'Abbas that : the Prophet (ﷺ) ruled that (the compensatory money) for a tooth was five camels.",
        "malay_translation": "Diriwayatkan daripada Ibnu 'Abbas رضي الله عنه bahawa: Nabi (ﷺ) telah memutuskan bahawa (wang pampasan) untuk gigi ialah lima ekor unta.",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيل بْنُ إِبْرَاهِيمَ الْبَالِسِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ بْنِ شَقِيقٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو حَمْزَةَ الْمَرْوَزِيُّ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ النَّحْوِيُّ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَنَّهُ قَضَى فِي السِّنِّ خَمْسًا مِنَ الْإِبِلِ ."
      },
      {
        "id": 27006,
        "hadith_number": "2652",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Jari Kelengkeng, Jari Manis, dan Ibu Jari Sama (Perumpamaan)",
        "perawi_melayu": "Daripada Ibn 'Abbas",
        "english_text": "It was narrated from Ibn 'Abbas that the Prophet (ﷺ) said: “This and this are the same” - meaning the pinky finger, ring finger and thumb.",
        "malay_translation": "Diriwayatkan daripada Ibn 'Abbas bahawa Nabi (ﷺ) bersabda: “Ini dan ini adalah sama” – bermaksud jari kelengkeng, jari manis dan ibu jari.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏ح وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏ وَابْنُ أَبِي عَدِيٍّ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ هَذِهِ وَهَذِهِ سَوَاءٌ يَعْنِي الْخِنْصَرَ وَالْإِبْهَامَ ."
      },
      {
        "id": 27007,
        "hadith_number": "2653",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Nilai Denda bagi Jari yang Sama",
        "perawi_melayu": "Daripada 'Amr bin Shu'aib, daripada bapanya, daripada datuknya",
        "english_text": "It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that the Messenger of Allah (ﷺ) said: “The fingers are all same, and (the compensatory money) for each of them is ten camels.",
        "malay_translation": "Diriwayatkan daripada 'Amr bin Shu'aib, daripada bapanya, daripada datuknya, bahawa Rasulullah (ﷺ) bersabda: \"Jari-jari adalah sama (nilainya), dan (wang pampasan) bagi setiap satunya adalah sepuluh ekor unta.",
        "arabic_text": "حَدَّثَنَا جَمِيلُ بْنُ الْحَسَنِ الْعَتَكِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْأَعْلَى، ‏‏‏‏‏‏حَدَّثَنَا سَعِيدٌ، ‏‏‏‏‏‏عَنْ مَطَرٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ الْأَصَابِعُ سَوَاءٌ كُلُّهُنَّ فِيهِنَّ عَشْرٌ عَشْرٌ مِنَ الْإِبِلِ ."
      },
      {
        "id": 27008,
        "hadith_number": "2654",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Jari-jari Adalah Sama",
        "perawi_melayu": "Daripada Abu Musa Al-Ash'ari رضي الله عنه",
        "english_text": "It was narrated from Abu Musa Al-Ash'ari that the Messenger of Allah (ﷺ) said: “The fingers are the same.”",
        "malay_translation": "Diriwayatkan daripada Abu Musa Al-Ash'ari bahawa Rasulullah ﷺ bersabda: “Jari-jari adalah sama.”",
        "arabic_text": "حَدَّثَنَا رَجَاءُ بْنُ الْمُرَجَّى السَّمَرْقَنْدِيُّ، ‏‏‏‏‏‏حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ، ‏‏‏‏‏‏حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، ‏‏‏‏‏‏عَنْ غَالِبٍ التَّمَّارِ، ‏‏‏‏‏‏عَنْ حُمَيْدِ بْنِ هِلَالٍ، ‏‏‏‏‏‏عَنْ مَسْرُوقِ بْنِ أَوْسٍ، ‏‏‏‏‏‏عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ الْأَصَابِعُ سَوَاءٌ"
      },
      {
        "id": 27009,
        "hadith_number": "2655",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kompensasi Luka yang Membongkar Tulang",
        "perawi_melayu": "'Amr bin Shu'aib, dari bapanya, dari datuknya",
        "english_text": "It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that the Prophet (ﷺ) of said: “For a wound that exposes a bone, is five; (the compensation) is five camels.”",
        "malay_translation": "Diriwayatkan daripada 'Amr bin Shu'aib, daripada bapanya, daripada datuknya, bahawa Nabi (ﷺ) bersabda: “Bagi luka yang mendedahkan tulang, (pampasannya) adalah lima; (iaitu) lima ekor unta.”",
        "arabic_text": "حَدَّثَنَا جَمِيلُ بْنُ الْحَسَنِ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْأَعْلَى، ‏‏‏‏‏‏حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، ‏‏‏‏‏‏عَنْ مَطَرٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ فِي الْمَوَاضِحِ خَمْسٌ خَمْسٌ مِنَ الْإِبِلِ ."
      },
      {
        "id": 27010,
        "hadith_number": "2656",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Tiada Ganti Rugi untuk Gigitan Seperti Kuda Jantan",
        "perawi_melayu": "Ya'la dan Salamah, anak-anak Umayyah",
        "english_text": "It was narrated from Ya'la and Salamah the sons of Ummayah said: “We went out with the Messenger of Allah (ﷺ) on the military expedition of Tabuk, and with us was a friend of ours. He fought with another man while we were on the road. The man bit the hand on his opponent, who pulled away his hand and the man's tooth fell out. He came to Messenger of Allah (ﷺ) demanding compensatory money for his tooth, and the Messenger of Allah (ﷺ) said: 'Would anyone of you go and bite his brother like a stallion, then come demanding compensatory money? There is no compensatory for this.'” Hence, The Messenger of Allah (ﷺ) invalidated it (i.e compensatory in such case).",
        "malay_translation": "Diriwayatkan daripada Ya'la dan Salamah, anak-anak Umayyah, berkata: “Kami keluar bersama Rasulullah (ﷺ) dalam peperangan Tabuk, dan bersama kami ada seorang sahabat kami. Dia bergaduh dengan seorang lelaki lain semasa kami berada di jalan. Lelaki itu menggigit tangan lawannya, yang menarik tangannya dan gigi lelaki itu tercabut. Dia datang kepada Rasulullah (ﷺ) menuntut wang pampasan untuk giginya, dan Rasulullah (ﷺ) bersabda: 'Adakah seseorang daripada kamu pergi menggigit saudaranya seperti kuda jantan, kemudian datang menuntut wang pampasan? Tiada pampasan untuk ini.'“ Oleh itu, Rasulullah (ﷺ) membatalkannya (iaitu pampasan dalam kes sedemikian).",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ إِسْحَاق، ‏‏‏‏‏‏عَنْ عَطَاءٍ، ‏‏‏‏‏‏عَنْ صَفْوَانَ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ عَمَّيْهِ يَعْلَى وَسَلَمَةَ ابني أمية، ‏‏‏‏‏‏قَالَا:‏‏‏‏ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ تَبُوكَ وَمَعَنَا صَاحِبٌ لَنَا فَاقْتَتَلَ هُوَ وَرَجُلٌ آخَرُ وَنَحْنُ بِالطَّرِيقِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَعَضَّ الرَّجُلُ يَدَ صَاحِبِهِ فَجَذَبَ صَاحِبُهُ يَدَهُ مِنْ فِيهِ فَطَرَحَ ثَنِيَّتَهُ، ‏‏‏‏‏‏فَأَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَلْتَمِسُ عَقْلَ ثَنِيَّتِهِ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَعْمِدُ أَحَدُكُمْ إِلَى أَخِيهِ فَيَعَضُّهُ كَعِضَاضِ الْفَحْلِ، ‏‏‏‏‏‏ثُمَّ يَأْتِي يَلْتَمِسُ الْعَقْلَ لَا عَقْلَ لَهَا قَالَ:‏‏‏‏ فَأَبْطَلَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 27011,
        "hadith_number": "2657",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukum Gigitan yang Menyebabkan Kehilangan Gigi",
        "perawi_melayu": "'Imran bin Husain (RA)",
        "english_text": "It was narrated from 'Imran bin Husain that a : man bit another man on his forearm; he pulled away his arm away and the man’s tooth fell out. The matter was referred to Prophet (ﷺ) who invalidated it and said: 'Would one of you bite (another) like a stallion?'",
        "malay_translation": "Diriwayatkan daripada 'Imran bin Husain bahawa seorang lelaki menggigit lelaki lain pada lengan bawahnya; lelaki itu menarik lengannya dan gigi lelaki itu terjatuh. Perkara itu dirujuk kepada Nabi (ﷺ) yang membatalkannya dan bersabda: 'Adakah salah seorang daripada kamu menggigit (orang lain) seperti seekor kuda jantan?'",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ زُرَارَةَ بْنِ أَوْفَى، ‏‏‏‏‏‏عَنْعِمْرَانَ بْنِ حُصَيْنٍ، ‏‏‏‏‏‏أَنَّ رَجُلًا عَضَّ رَجُلًا عَلَى ذِرَاعِهِ فَنَزَعَ يَدَهُ، ‏‏‏‏‏‏فَوَقَعَتْ ثَنِيَّتُهُ فَرُفِعَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَبْطَلَهَا وَقَالَ:‏‏‏‏ يَقْضَمُ أَحَدُكُمْ كَمَا يَقْضَمُ الْفَحْلُ ."
      },
      {
        "id": 27012,
        "hadith_number": "2658",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Ilmu 'Ali bin Abi Talib dan Lembaran Keadilan",
        "perawi_melayu": "Abu Juhaifah",
        "english_text": "It was narrated that Abu Juhaifah said: “I said to 'Ali bin Abu Talib: 'Do you have any knowledge that the people do not have?' He said: 'No, by Allah, we only know what the people know, except that Allah may bless a man with understanding of Qur'an or what is in this sheet, in which are mentioned the rulings on blood money from the Messenger of Allah (ﷺ) and it says that a Muslim should not be killed in retaliation for the murder of disbeliever.’”",
        "malay_translation": "Diriwayatkan bahawa Abu Juhaifah berkata: “Aku bertanya kepada 'Ali bin Abu Talib: 'Adakah kamu mempunyai sebarang ilmu yang tidak dimiliki oleh orang lain?' Beliau menjawab: 'Tidak, demi Allah, kami hanya mengetahui apa yang diketahui oleh orang ramai, kecuali Allah boleh mengurniakan kepada seseorang itu kefahaman tentang Al-Qur'an atau apa yang ada dalam lembaran ini, yang menyebutkan hukum-hakam mengenai diyat (ganti rugi nyawa) daripada Rasulullah (ﷺ) dan menyatakan bahawa seorang Muslim tidak boleh dibunuh sebagai balasan kerana membunuh orang kafir.’”",
        "arabic_text": "حَدَّثَنَا عَلْقَمَةُ بْنُ عَمْرٍو الدَّارِمِيُّ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، ‏‏‏‏‏‏عَنْ مُطَرِّفٍ، ‏‏‏‏‏‏عَنِ الشَّعْبِيِّ، ‏‏‏‏‏‏عَنْ أَبِي جُحَيْفَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ لِعَلِيِّ بْنِ أَبِي طَالِبٍ هَلْ عِنْدَكُمْ شَيْءٌ مِنَ الْعِلْمِ لَيْسَ عِنْدَ النَّاسِ؟ قَالَ:‏‏‏‏ لَا، ‏‏‏‏‏‏وَاللَّهِ مَا عِنْدَنَا إِلَّا مَا عِنْدَ النَّاسِ، ‏‏‏‏‏‏إِلَّا أَنْ يَرْزُقَ اللَّهُ رَجُلًا فَهْمًا فِي الْقُرْآنِ، ‏‏‏‏‏‏أَوْ مَا فِي هَذِهِ الصَّحِيفَةِ فِيهَا الدِّيَاتُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَأَنْ لَا يُقْتَلَ مُسْلِمٌ بِكَافِرٍ ."
      },
      {
        "id": 27013,
        "hadith_number": "2659",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Seorang Muslim Tidak Boleh Dibunuh Kerana Membunuh Orang Kafir",
        "perawi_melayu": "'Amr bin Shu'aib, daripada bapanya, daripada datuknya",
        "english_text": "It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that the Messenger of Allah (ﷺ) said: “A Muslim should not be killed in retaliation for the murder of a disbeliever.”",
        "malay_translation": "Diriwayatkan daripada 'Amr bin Shu'aib, daripada bapanya, daripada datuknya, bahawa Rasulullah (ﷺ) bersabda: “Seorang Muslim tidak boleh dibunuh sebagai balasan atas pembunuhan seorang kafir.”",
        "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيل، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَيَّاشٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْأَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا يُقْتَلُ مُسْلِمٌ بِكَافِرٍ ."
      },
      {
        "id": 27014,
        "hadith_number": "2660",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Membunuh Orang Beriman Kerana Orang Kafir dan Orang yang Mempunyai Perjanjian",
        "perawi_melayu": "Daripada Ibn 'Abbas",
        "english_text": "It was narrated from Ibn 'Abbas that the Prophet (ﷺ) said: ”A believer should not be killed in retaliation for the murder of a disbeliever, and a person who has a treaty should not be killed during the time of the treaty.”",
        "malay_translation": "Diriwayatkan daripada Ibn 'Abbas bahawa Nabi (ﷺ) bersabda: \"Seorang mukmin tidak boleh dibunuh sebagai balasan terhadap pembunuhan seorang kafir, dan seseorang yang mempunyai perjanjian tidak boleh dibunuh semasa tempoh perjanjian.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ، ‏‏‏‏‏‏حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ حَنَشٍ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا يُقْتَلُ مُؤْمِنٌ بِكَافِرٍ وَلَا ذُو عَهْدٍ فِي عَهْدِهِ ."
      },
      {
        "id": 27015,
        "hadith_number": "2661",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Seorang Bapa Tidak Boleh Dibunuh Kerana Anaknya",
        "perawi_melayu": "Daripada Ibn 'Abbas",
        "english_text": "It was narrated from Ibn 'Abbas that the Messenger of Allah (ﷺ) said: “A father should not be killed for his son.”",
        "malay_translation": "Diriwayatkan daripada Ibn 'Abbas bahawa Rasulullah (ﷺ) bersabda: “Seorang bapa tidak boleh dibunuh kerana anaknya.”",
        "arabic_text": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، ‏‏‏‏‏‏حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، ‏‏‏‏‏‏عَنْ إِسْمَاعِيل بْنِ مُسْلِمٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ دِينَارٍ، ‏‏‏‏‏‏عَنْ طَاوُسٍ، ‏‏‏‏‏‏عَنِابْنِ عَبَّاسٍ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا يُقْتَلُ بِالْوَلَدِ الْوَالِدُ ."
      },
      {
        "id": 27016,
        "hadith_number": "2662",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Seorang Bapa Tidak Boleh Dibunuh Kerana Anaknya",
        "perawi_melayu": "'Umar bin Khattab (رضي الله عنه)",
        "english_text": "It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that 'Umar bin Khattab said: “I heard the Messenger of Allah (ﷺ) say: 'A father should not be killed for his son.’”",
        "malay_translation": "Diriwayatkan daripada 'Amr bin Shu'aib, daripada bapanya, daripada datuknya, bahawa 'Umar bin Khattab berkata: “Aku mendengar Rasulullah (ﷺ) bersabda: 'Seorang bapa tidak boleh dibunuh kerana anaknya.’”",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ، ‏‏‏‏‏‏عَنْ حَجَّاجٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏عَنْ عُمَرَ بْنِ الْخَطَّابِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ لَا يُقْتَلُ الْوَالِدُ بِالْوَلَدِ ."
      },
      {
        "id": 27017,
        "hadith_number": "2663",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukuman Pembunuh dan Pencedera Hamba",
        "perawi_melayu": "Samurah bin Jundab (Semoga Allah meredhainya)",
        "english_text": "It was narrated from Samurah bin Jundab that the Messenger of Allah (ﷺ) said: “Whoever kills his slave, we will kill him, and whoever mutilates (his slave) we will mutilate him.”",
        "malay_translation": "Diriwayatkan daripada Samurah bin Jundab (Semoga Allah meredhainya) bahawa Rasulullah (ﷺ) bersabda: \"Sesiapa yang membunuh hambanya, kami akan membunuhnya, dan sesiapa yang mencacatkan (hambanya) kami akan mencacatkannya.\"",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ الْحَسَنِ، ‏‏‏‏‏‏عَنْ سَمُرَةَ بْنِ جُنْدَبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ وَمَنْ جَدَعَهُ جَدَعْنَاهُ ."
      },
      {
        "id": 27018,
        "hadith_number": "2664",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukuman bagi Pembunuh Hamba Secara Sengaja",
        "perawi_melayu": "'Amr bin Shu'aib, dari bapanya, dari datuknya",
        "english_text": "It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said: “A man killed his slave deliberately and with malice aforethought, so the Messenger of Allah (ﷺ) gave him one hundred lashes, banished him for one year, and cancelled his share from among the Muslims.”",
        "malay_translation": "Diriwayatkan daripada 'Amr bin Shu'aib, daripada bapanya, daripada datuknya, bahawa seorang lelaki membunuh hambanya dengan sengaja dan penuh niat jahat. Maka Rasulullah (ﷺ) mencambuknya seratus kali, membuangnya selama satu tahun, dan membatalkan haknya daripada kalangan orang Islam.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ الطَّبَّاعِ، ‏‏‏‏‏‏حَدَّثَنَا إِسْمَاعِيل بْنُ عَيَّاشٍ، ‏‏‏‏‏‏عَنْ إِسْحَاق بْنِ عَبْدِ اللَّهِ بْنِ أَبِي فَرْوَةَ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ، ‏‏‏‏‏‏عَنْ عَلِيٍّ، ‏‏‏‏‏‏وَعَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ قَتَلَ رَجُلٌ عَبْدَهُ عَمْدًا مُتَعَمِّدًا، ‏‏‏‏‏‏فَجَلَدَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِائَةً، ‏‏‏‏‏‏وَنَفَاهُ سَنَةً وَمَحَا سَهْمَهُ مِنَ الْمُسْلِمِينَ ."
      },
      {
        "id": 27019,
        "hadith_number": "2665",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukuman Terhadap Orang Yahudi yang Membunuh Seorang Wanita",
        "perawi_melayu": "Anas bin Malik (r.a.)",
        "english_text": "It was narrated from Anas bin Malik that : a Jew crushed the head of a woman between two rocks and killed her, so the Messenger of Allah (ﷺ) crushed his head between two rocks.",
        "malay_translation": "Diriwayatkan daripada Anas bin Malik (r.a.) bahawa: seorang Yahudi telah menghancurkan kepala seorang wanita di antara dua batu dan membunuhnya, lalu Rasulullah (ﷺ) menghancurkan kepalanya di antara dua batu.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنْ هَمَّامِ بْنِ يَحْيَى، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ يَهُودِيًّا رَضَخَ رَأْسَ امْرَأَةٍ بَيْنَ حَجَرَيْنِ فَقَتَلَهَا، ‏‏‏‏‏‏فَرَضَخَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأْسَهُ بَيْنَ حَجَرَيْنِ ."
      },
      {
        "id": 27020,
        "hadith_number": "2666",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Seorang Yahudi Membunuh Seorang Gadis dan Dihukum oleh Rasulullah (ﷺ)",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "It was narrated from Anas bin Malik that : a Jew killed a girl for her jewelry. He asked her (as she was dying): “Did so-and-so kill you?” and she gestured with her head to say no. Then he asked her again, and she gestured with her head to say no. he asked her a third time and she gestured with her head to say yes. So the Messenger of Allah (ﷺ) killed him (by crushing his head) between two rocks.",
        "malay_translation": "Diriwayatkan daripada Anas bin Malik bahawa: seorang Yahudi membunuh seorang gadis kerana barang kemasnya. Dia bertanya kepada gadis itu (semasa dia nazak): “Adakah si fulan membunuhmu?” dan dia mengisyaratkan dengan kepalanya untuk mengatakan tidak. Kemudian dia bertanya lagi, dan dia mengisyaratkan dengan kepalanya untuk mengatakan tidak. Dia bertanya kepadanya kali ketiga dan dia mengisyaratkan dengan kepalanya untuk mengatakan ya. Maka Rasulullah (ﷺ) membunuhnya (dengan menghancurkan kepalanya) di antara dua batu.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏ح وَحَدَّثَنَا إِسْحَاق بْنُ مَنْصُورٍ، ‏‏‏‏‏‏حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ زَيْدٍ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ يَهُودِيًّا قَتَلَ جَارِيَةً عَلَى أَوْضَاحٍ لَهَا، ‏‏‏‏‏‏فَقَالَ لَهَا:‏‏‏‏ أَقَتَلَكِ فُلَانٌ؟ فَأَشَارَتْ بِرَأْسِهَا أَنْ لَا، ‏‏‏‏‏‏ثُمَّ سَأَلَهَا الثَّانِيَةَ فَأَشَارَتْ بِرَأْسِهَا أَنْ لَا، ‏‏‏‏‏‏ثُمَّ سَأَلَهَا الثَّالِثَةَ فَأَشَارَتْ بِرَأْسِهَا أَنْ نَعَمْ، ‏‏‏‏‏‏فَقَتَلَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ حَجَرَيْنِ ."
      },
      {
        "id": 27021,
        "hadith_number": "2667",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Tiada Qisas Melainkan dengan Pedang",
        "perawi_melayu": "Nu'man bin Bashir",
        "english_text": "It was narrated from Nu'man bin Bashir that the Messenger of Allah (ﷺ) said: “There is no retaliation with the sword.”",
        "malay_translation": "Diriwayatkan daripada Nu'man bin Bashir bahawa Rasulullah (ﷺ) bersabda: “Tiada qisas melainkan dengan pedang.”",
        "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُسْتَمِرِّ الْعُرُوقِيُّ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو عَاصِمٍ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏عَنْ جَابِرٍ، ‏‏‏‏‏‏عَنْ أَبِي عَازِبٍ، ‏‏‏‏‏‏عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا قَوَدَ إِلَّا بِالسَّيْفِ ."
      },
      {
        "id": 27022,
        "hadith_number": "2668",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukuman Qisas Hanya dengan Pedang",
        "perawi_melayu": "Abu Bakrah",
        "english_text": "It was narrated from Abu Bakrah that the Messenger of Allah (ﷺ) said: “There is no retaliation except with the sword.”",
        "malay_translation": "Diriwayatkan daripada Abu Bakrah bahawa Rasulullah (ﷺ) bersabda: “Tiada qisas kecuali dengan pedang.”",
        "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُسْتَمِرِّ، ‏‏‏‏‏‏حَدَّثَنَا الْحُرُّ بْنُ مَالِكٍ الْعَنْبَرِيُّ، ‏‏‏‏‏‏حَدَّثَنَا مُبَارَكُ بْنُ فَضَالَةَ، ‏‏‏‏‏‏عَنِ الْحَسَنِ، ‏‏‏‏‏‏عَنْ أَبِي بَكْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا قَوَدَ إِلَّا بِالسَّيْفِ ."
      },
      {
        "id": 27023,
        "hadith_number": "2669",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Setiap Orang Bertanggungjawab Atas Dosanya Sendiri",
        "perawi_melayu": "Sulaiman bin Amr bin Ahwas (daripada bapanya)",
        "english_text": "It was narrated from Sulaiman bin Amr bin Ahwas that his father said: I heard the Messenger of Allah (ﷺ) saying during the Farewell pilgrimage: “No criminal commits a crime but he brings. (the punishment for that) upon himself. No father can bring punishment upon his son by his crime, and no son can bring punishment upon his father.”",
        "malay_translation": "Diriwayatkan daripada Sulaiman bin Amr bin Ahwas bahawa bapanya berkata: Aku mendengar Rasulullah (ﷺ) bersabda semasa Haji Wada': “Tidak ada seorang penjenayah yang melakukan jenayah melainkan dia menanggung (hukuman bagi) dirinya sendiri. Tiada bapa yang boleh menanggung hukuman ke atas anaknya disebabkan jenayahnya, dan tiada anak yang boleh menanggung hukuman ke atas bapanya.”",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو الْأَحْوَصِ، ‏‏‏‏‏‏عَنْ شَبِيبِ بْنِ غَرْقَدَةَ، ‏‏‏‏‏‏عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الْأَحْوَصِ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي حَجَّةِ الْوَدَاعِ:‏‏‏‏ أَلَا لَا يَجْنِي جَانٍ إِلَّا عَلَى نَفْسِهِ، ‏‏‏‏‏‏لَا يَجْنِي وَالِدٌ عَلَى وَلَدِهِ وَلَا مَوْلُودٌ عَلَى وَالِدِهِ ."
      },
      {
        "id": 27024,
        "hadith_number": "2670",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Keadilan: Anak Tidak Boleh Dihukum Kerana Kesalahan Ibu",
        "perawi_melayu": "Tariq Al-Muharibi (رضي الله عنه)",
        "english_text": "It was narrated that Tariq Al-Muharibi said: “I saw the Messenger of Allah (ﷺ) raising his hands until I saw the whiteness of his armpits, saying: 'No child should be punished because of his mother's crime, no child should be punished because of his mother's crime.”",
        "malay_translation": "Diriwayatkan bahawa Tariq Al-Muharibi berkata: “Aku melihat Rasulullah (ﷺ) mengangkat kedua tangannya sehingga aku melihat keputihan ketiaknya, seraya bersabda: 'Tidaklah seorang anak dihukum kerana kesalahan ibunya, tidaklah seorang anak dihukum kerana kesalahan ibunya.”",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، ‏‏‏‏‏‏عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، ‏‏‏‏‏‏حَدَّثَنَا جَامِعُ بْنُ شَدَّادٍ، ‏‏‏‏‏‏عَنْطَارِقٍ الْمُحَارِبِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَرْفَعُ يَدَيْهِ حَتَّى رَأَيْتُ بَيَاضَ إِبْطَيْهِ يَقُولُ:‏‏‏‏ أَلَا لَا تَجْنِي أُمٌّ عَلَى وَلَدٍ أَلَا لَا تَجْنِي أُمٌّ عَلَى وَلَدٍ ."
      },
      {
        "id": 27025,
        "hadith_number": "2671",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Anak Tidak Bertanggungjawab Atas Kesalahan Bapa, Bapa Tidak Bertanggungjawab Atas Kesalahan Anak",
        "perawi_melayu": "Khashkhash Al-Anbari",
        "english_text": "It was narrated that Khashkhash Al-Anbari said: “I came to the Prophet (ﷺ) and my son was with me. He said: 'You will not be punished because of his crime and he will not be punished because of yours.'”",
        "malay_translation": "Diriwayatkan bahawa Khashkhash Al-Anbari berkata: “Saya datang kepada Nabi (ﷺ) dan anak saya bersama saya. Baginda bersabda: 'Kamu tidak akan dihukum kerana kesalahan anakmu dan dia tidak akan dihukum kerana kesalahanmu.'”",
        "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، ‏‏‏‏‏‏حَدَّثَنَا هُشَيْمٌ، ‏‏‏‏‏‏عَنْ يُونُسَ، ‏‏‏‏‏‏عَنْ حُصَيْنِ بْنِ أَبِي الْحُرِّ، ‏‏‏‏‏‏عَنِ الْخَشْخَاشِ الْعَنْبَرِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعِيَ ابْنِي فَقَالَ:‏‏‏‏ لَا تَجْنِي عَلَيْهِ وَلَا يَجْنِي عَلَيْكَ ."
      },
      {
        "id": 27026,
        "hadith_number": "2672",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Seseorang Tidak Akan Dihukum Atas Kesalahan Orang Lain",
        "perawi_melayu": "'Usamah bin Sharik (Semoga Allah meredhainya)",
        "english_text": "It was narrated from 'Usamah bin Sharik that the Messenger of Allah (ﷺ) said: “No person will be punished because of another's crime.”",
        "malay_translation": "Diriwayatkan daripada 'Usamah bin Sharik bahawa Rasulullah (ﷺ) bersabda: “Seseorang tidak akan dihukum kerana kesalahan orang lain.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عَقِيلٍ، ‏‏‏‏‏‏حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو الْعَوَّامِ الْقَطَّانُ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ جُحَادَةَ، ‏‏‏‏‏‏عَنْ زِيَادِ بْنِ عِلَاقَةَ، ‏‏‏‏‏‏عَنْ أُسَامَةَ بْنِ شَرِيكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تَجْنِي نَفْسٌ عَلَى أُخْرَى ."
      },
      {
        "id": 27027,
        "hadith_number": "2673",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kecederaan Akibat Haiwan, Perigi, dan Lombong: Tiada Liabiliti",
        "perawi_melayu": "Abu Hurairah (RA)",
        "english_text": "It was narrated from Abu Hurairah that the Allah's Messenger (ﷺ) said: “The injuries caused by the beast are without liability, and wells are without liability, and mines are without liability.”",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah bahawa Rasulullah (ﷺ) bersabda: “Kecederaan yang disebabkan oleh binatang adalah tidak ada liabiliti, perigi adalah tidak ada liabiliti, dan lombong adalah tidak ada liabiliti.”",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، ‏‏‏‏‏‏عن أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْعَجْمَاءُ جَرْحُهَا جُبَارٌ، ‏‏‏‏‏‏وَالْمَعْدِنُ جُبَارٌ، ‏‏‏‏‏‏وَالْبِئْرُ جُبَارٌ ."
      },
      {
        "id": 27028,
        "hadith_number": "2674",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kecederaan Akibat Haiwan dan Perlombongan: Tiada Liabiliti",
        "perawi_melayu": "Khathir bin 'Abdullah bin 'Amr bin 'Awf meriwayatkan bahawa datuknya berkata",
        "english_text": "Khathir bin 'Abdullah bin 'Amr bin 'Awf narrated that his grandfather said: “I heard the Messenger of Allah (ﷺ) say: 'The injuries cause by the beast are without liability, and mines are without liability.”",
        "malay_translation": "Khathir bin 'Abdullah bin 'Amr bin 'Awf meriwayatkan bahawa datuknya berkata: \"Saya mendengar Rasulullah (ﷺ) bersabda: 'Kecederaan yang disebabkan oleh binatang adalah tanpa liabiliti, dan perlombongan adalah tanpa liabiliti.\"",
        "arabic_text": "حَدَّثَنَا أَبو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، ‏‏‏‏‏‏حَدَّثَنَا كَثِيرُ بْنُ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عَوْفٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ الْعَجْمَاءُ جَرْحُهَا جُبَارٌ، ‏‏‏‏‏‏وَالْمَعْدِنُ جُبَارٌ ."
      },
      {
        "id": 27029,
        "hadith_number": "2675",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Tiada Tanggungan Kecederaan Akibat Terjatuh ke dalam Lombong atau Perigi",
        "perawi_melayu": "'Ubadah bin Samit",
        "english_text": "It was narrated that 'Ubadah bin Samit said: “The Messenger of Allah (ﷺ) ruled that there is no liability for injuries caused by falling into a mines or a well, nor those caused by a beast.”",
        "malay_translation": "Diriwayatkan bahawa 'Ubadah bin Samit berkata: “Rasulullah (ﷺ) telah memutuskan bahawa tiada liabiliti bagi kecederaan yang disebabkan oleh terjatuh ke dalam lombong atau perigi, mahupun yang disebabkan oleh binatang.”",
        "arabic_text": "حَدَّثَنَا عَبْدُ رَبِّهِ بْنُ خَالِدٍ النُّمَيْرِيُّ، ‏‏‏‏‏‏حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏حَدَّثَنِي مُوسَى بْنُ عُقْبَةَ، ‏‏‏‏‏‏حَدَّثَنِي إِسْحَاق بْنُ يَحْيَى بْنِ الْوَلِيدِ، ‏‏‏‏‏‏عَنْ عُبَادَةَ بْنِ الصَّامِتِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ الْمَعْدِنَ جُبَارٌ، ‏‏‏‏‏‏وَالْبِئْرَ جُبَارٌ، ‏‏‏‏‏‏وَالْعَجْمَاءَ جَرْحُهَا جُبَارٌ ، ‏‏‏‏‏‏وَالْعَجْمَاءُ:‏‏‏‏ الْبَهِيمَةُ مِنَ الْأَنْعَامِ وَغَيْرِهَا، ‏‏‏‏‏‏وَالْجُبَارُ:‏‏‏‏ هُوَ الْهَدْرُ الَّذِي لَا يُغَرَّمُ."
      },
      {
        "id": 27030,
        "hadith_number": "2676",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kerosakan Akibat Api dan Perigi",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: “(The injuries caused by) a fire are without liability, and by falling into a well.”",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah bahawa Rasulullah (ﷺ) bersabda: “Kerosakan yang disebabkan oleh api adalah tanpa tanggungan (tiada liabiliti), dan (kerosakan disebabkan) terjatuh ke dalam perigi (juga tanpa tanggungan).”",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ الْأَزْهَرِ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏عَنْ مَعْمَرٍ، ‏‏‏‏‏‏عَنْ هَمَّامٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ النَّارُ جُبَارٌ، ‏‏‏‏‏‏وَالْبِئْرُ جَبَارٌ ."
      },
      {
        "id": 27031,
        "hadith_number": "2677",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kisah Pembunuhan Abdullah bin Sahl di Khaibar dan Pembayaran Diyat",
        "perawi_melayu": "Sahl bin Abu Hathmah dari orang-orang tua kaumnya",
        "english_text": "It was narrated from Sahl bin Abu Hathmah from the elders of his people that : 'Abdullah bin Sahl and Muhayyishah set out for Khaibar because of some problem that had arisen. Someone came to Muhayyishah, and he told him that Abdullah bin Sahl had been killed and thrown into a pit or well in Khaibar. He came to the Jews and said: “By Allah, you killed him.” They said: “By Allah, we did not kill him.” Then he went back to his people and told them about that. Then he and his brother Huwayyisah, who was older than him, and 'Abdur-Rahman bin Sahl, came (to the Prophet (ﷺ)). Muhayyisah, who was the one who had been at Khaibar, went and he began to speak, but the Messenger of Allah (ﷺ) said: “Let the elder speak first.” So Huwayyisah spoke, then Muhayyisah spoke. The Messenger of Allah (ﷺ) said: “Either (the Jews) will pay the blood money for your companion, or war will be declared on them.” The Messenger of Allah (ﷺ) sent a letter to that effect (to the Jews) and they wrote back saying: “By Allah, we did not kill him.” The Messenger of Allah (ﷺ) said to Huwayyisah, Muhayyisah and Abdur-Rahman: “Will you swear an oath establishing your claim to the blood money of your companion?” They said: “No” He said: “Should the Jews swear an oath for you?” They said: “They are not Muslims.” So the Messenger of Allah (ﷺ) paid the blood money himself, and he sent one hundred she-camels to them and some of them entered the house. Sahl said: “A red she-camels from among them kicked me.”",
        "malay_translation": "Diriwayatkan daripada Sahl bin Abu Hathmah daripada orang-orang tua kaumnya bahawa: 'Abdullah bin Sahl dan Muhayyishah keluar ke Khaibar kerana sesuatu masalah yang timbul. Seseorang datang kepada Muhayyishah, dan dia memberitahunya bahawa Abdullah bin Sahl telah dibunuh dan dibuang ke dalam lubang atau perigi di Khaibar. Dia datang kepada orang Yahudi dan berkata: “Demi Allah, kamu telah membunuhnya.” Mereka berkata: “Demi Allah, kami tidak membunuhnya.” Kemudian dia kembali kepada kaumnya dan memberitahu mereka tentang hal itu. Kemudian dia dan saudaranya Huwayyisah, yang lebih tua daripadanya, dan 'Abdur-Rahman bin Sahl, datang (kepada Nabi (ﷺ)). Muhayyisah, yang merupakan orang yang berada di Khaibar, pergi dan dia mula bercakap, tetapi Rasulullah (ﷺ) bersabda: “Biarkan orang yang lebih tua bercakap dahulu.” Maka Huwayyisah bercakap, kemudian Muhayyishah bercakap. Rasulullah (ﷺ) bersabda: “Sama ada (orang Yahudi) akan membayar diyat untuk sahabatmu, atau perang akan diisytiharkan terhadap mereka.” Rasulullah (ﷺ) menghantar surat ke arah itu (kepada orang Yahudi) dan mereka menulis kembali dengan berkata: “Demi Allah, kami tidak membunuhnya.” Rasulullah (ﷺ) berkata kepada Huwayyisah, Muhayyishah dan Abdur-Rahman: “Adakah kamu akan bersumpah untuk mengesahkan tuntutan kamu terhadap diyat sahabatmu?” Mereka berkata: “Tidak.” Baginda bersabda: “Patutkah orang Yahudi bersumpah untuk kamu?” Mereka berkata: “Mereka bukan Muslim.” Maka Rasulullah (ﷺ) membayar diyat itu sendiri, dan baginda menghantar seratus unta betina kepada mereka dan sebahagian daripada mereka memasuki rumah. Sahl berkata: “Seekor unta betina merah daripada mereka menendang saya.”",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ، ‏‏‏‏‏‏حَدَّثَنَا بِشْرُ بْنُ عُمَرَ، ‏‏‏‏‏‏سَمِعْتُ مَالِكَ بْنَ أَنَسٍ، ‏‏‏‏‏‏حَدَّثَنِي أَبُو لَيْلَى بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَهْلٍ، ‏‏‏‏‏‏عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ أَنَّهُ أَخْبَرَهُ، ‏‏‏‏‏‏عَنْ رِجَالٍ مِنْ كُبَرَاءِ قَوْمِهِ، ‏‏‏‏‏‏أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ وَمُحَيِّصَةَ خَرَجَا إِلَى خَيْبَرَ مِنْ جَهْدٍ أَصَابَهُمْ فَأُتِيَ مُحَيِّصَةُ فَأُخْبِرَ أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ قَدْ قُتِلَ وَأُلْقِيَ فِي فَقِيرٍ أَوْ عَيْنٍ بِخَيْبَرَ فَأَتَى يَهُودَ فَقَالَ:‏‏‏‏ أَنْتُمْ وَاللَّهِ قَتَلْتُمُوهُ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ وَاللَّهِ مَا قَتَلْنَاهُ، ‏‏‏‏‏‏ثُمَّ أَقْبَلَ حَتَّى قَدِمَ عَلَى قَوْمِهِ، ‏‏‏‏‏‏فَذَكَرَ ذَلِكَ لَهُمْ ثُمَّ أَقْبَلَ هُوَ وَأَخُوهُ حُوَيِّصَةُ وَهُوَ أَكْبَرُ مِنْهُ وَعَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ فَذَهَبَ مُحَيِّصَةُ يَتَكَلَّمُ وَهُوَ الَّذِي كَانَ بِخَيْبَرَ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِمُحَيِّصَةَ:‏‏‏‏ كَبِّرْ، ‏‏‏‏‏‏كَبِّرْ يُرِيدُ السِّنَّ، ‏‏‏‏‏‏فَتَكَلَّمَ حُوَيِّصَةُ ثُمَّ تَكَلَّمَ مُحَيِّصَةُ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِمَّا أَنْ يَدُوا صَاحِبَكُمْ، ‏‏‏‏‏‏وَإِمَّا أَنْ يُؤْذَنُوا بِحَرْبٍ فَكَتَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيْهِمْ فِي ذَلِكَ، ‏‏‏‏‏‏فَكَتَبُوا:‏‏‏‏ إِنَّا وَاللَّهِ مَا قَتَلْنَاهُ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِحُوَيِّصَةَ:‏‏‏‏ وَمُحَيِّصَةَ وَعَبْدِ الرَّحْمَنِ:‏‏‏‏ تَحْلِفُونَ وَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ؟ قَالُوا:‏‏‏‏ لَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَتَحْلِفُ لَكُمْ يَهُودُ؟ قَالُوا:‏‏‏‏ لَيْسُوا بِمُسْلِمِينَ، ‏‏‏‏‏‏فَوَدَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عِنْدِهِ، ‏‏‏‏‏‏فَبَعَثَ إِلَيْهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِائَةَ نَاقَةٍ حَتَّى أُدْخِلَتْ عَلَيْهِمُ الدَّارَ. فَقَالَ سَهْلٌ:‏‏‏‏ فَلَقَدْ رَكَضَتْنِي مِنْهَا نَاقَةٌ حَمْرَاءُ"
      },
      {
        "id": 27032,
        "hadith_number": "2678",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Pembayaran Diyat (Ganti Rugi) oleh Rasulullah ﷺ",
        "perawi_melayu": "'Amr bin Shu'aib, daripada bapanya, daripada datuknya",
        "english_text": "It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that : Huwayyisah and Muhayyisah , the sons of Mas'ud, and 'Abdullah and 'Abdur-Rahman the sons of Sahl, went out to search for food in Khaibar. 'Abdullah was attacked and killed, and mention of that was made to the Messenger of Allah (ﷺ). He said: “Will you swear an oath and establish your right to blood money?” They said: “O Messenger of Allah (ﷺ), how can we swear an oath when we did not witness anything?” He said: “Do you want the Jews to swear that they are innocent?” They said: “O Messenger of Allah (ﷺ), then they will kill us too.” So the Messenger of Allah (ﷺ) paid the blood money himself.",
        "malay_translation": "Diriwayatkan daripada 'Amr bin Shu'aib, daripada bapanya, daripada datuknya, bahawa: Huwayyisah dan Muhayyisah, anak-anak lelaki Mas'ud, dan 'Abdullah dan 'Abdur-Rahman, anak-anak lelaki Sahl, keluar untuk mencari makanan di Khaibar. 'Abdullah telah diserang dan dibunuh, dan perkara itu disebut kepada Rasulullah ﷺ. Baginda bersabda: \"Adakah kamu akan bersumpah dan menetapkan hak kamu untuk diyat (ganti rugi darah)?\" Mereka berkata: \"Wahai Rasulullah ﷺ, bagaimana kami boleh bersumpah sedangkan kami tidak menyaksikan apa-apa?\" Baginda bersabda: \"Adakah kamu mahu orang Yahudi bersumpah bahawa mereka tidak bersalah?\" Mereka berkata: \"Wahai Rasulullah ﷺ, jika begitu, mereka akan membunuh kami juga.\" Lalu Rasulullah ﷺ membayar diyat (ganti rugi darah) itu sendiri.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ، ‏‏‏‏‏‏عَنْ حَجَّاجٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏أَنَّ حُوَيِّصَةَ وَمُحَيِّصَةَ ابْنَيْ مَسْعُودٍ، ‏‏‏‏‏‏وَعَبْدَ اللَّهِ وَعَبْدَ الرَّحْمَنِ ابْنَيْ سَهْلٍ خَرَجُوا يَمْتَارُونَ بِخَيْبَرَ فَعُدِيَ عَلَى عَبْدِ اللَّهِ فَقُتِلَ فَذُكِرَ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ:‏‏‏‏ تُقْسِمُونَ وَتَسْتَحِقُّونَ؟ ، ‏‏‏‏‏‏فَقَالُوا:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏كَيْفَ نُقْسِمُ وَلَمْ نَشْهَدْ؟ قَالَ:‏‏‏‏ فَتُبْرِئُكُمْ يَهُودُ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ يَا رَسُولَ اللَّهِ إِذًا تَقْتُلَنَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَوَدَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عِنْدِهِ ."
      },
      {
        "id": 27033,
        "hadith_number": "2679",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Pembebasan Hamba Akibat Pencederaan",
        "perawi_melayu": "Salamah bin Rawh bin Zinba' (Semoga Allah merahmatinya)",
        "english_text": "It was narrated from Salamah bin Rawh bin Zinba', that : his grandfather came to the Prophet (ﷺ) and he had castrated a slave of his. The Prophet (ﷺ) manumitted the slave in compensation for having been mutilated.",
        "malay_translation": "Diriwayatkan daripada Salamah bin Rawh bin Zinba', bahawa: datuknya datang kepada Nabi (ﷺ) dan dia telah mengkebiri seorang hambanya. Nabi (ﷺ) membebaskan hamba tersebut sebagai pampasan kerana telah dicederakan.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا إِسْحَاق بْنُ مَنْصُورٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ السَّلَامِ، ‏‏‏‏‏‏عَنْ إِسْحَاق بْنِ عَبْدِ اللَّهِ بْنِ أَبِي فَرْوَةَ، ‏‏‏‏‏‏عَنْ سَلَمَةَ بْنِ رَوْحِ بْنِ زِنْبَاعٍ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏أَنَّهُ قَدِمَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ خَصَى غُلَامًا لَهُ فَأَعْتَقَهُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْمُثْلَةِ."
      },
      {
        "id": 27034,
        "hadith_number": "2680",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kebebasan Hamba Selepas Dijebah Kemaluan",
        "perawi_melayu": "Amr bin Shu'aib daripada bapanya daripada datuknya",
        "english_text": "Amr bin Shu'aib narrated from his father that his grandfather said: “A man came to the Prophet (ﷺ) screaming. The Messenger of Allah (ﷺ) said to him: 'What is the matter with you?' He said: 'My master saw me kissing a slave woman of his, so he cut off my penis.' The Prophet (ﷺ) said: 'Take me to the man.' He was sought but could not be found, so the Messenger of Allah (ﷺ) said: 'Go, for you are free.' He said: 'Who will protect me, O Messenger of Allah (ﷺ)? What if my master enslaves me again?' The Messenger of Allah (ﷺ) said: 'Your protection will be (incumbent upon) every believer or Muslim.'",
        "malay_translation": "Amr bin Shu'aib meriwayatkan daripada bapanya bahawa datuknya berkata: “Seorang lelaki datang kepada Nabi (ﷺ) dalam keadaan menjerit. Rasulullah (ﷺ) bertanya kepadanya: 'Apakah yang berlaku kepadamu?' Lelaki itu berkata: 'Tuanku melihat saya mencium seorang hamba perempuannya, lalu dia memotong kemaluan saya.' Nabi (ﷺ) bersabda: 'Bawa saya kepada lelaki itu.' Dia dicari tetapi tidak dapat ditemui, maka Rasulullah (ﷺ) bersabda: 'Pergilah, sesungguhnya kamu bebas.' Lelaki itu berkata: 'Siapakah yang akan melindungi saya, wahai Rasulullah (ﷺ)? Bagaimana jika tuanku memperhambakan saya semula?' Rasulullah (ﷺ) bersabda: 'Perlindungan kamu adalah (kewajipan) ke atas setiap mukmin atau Muslim.'",
        "arabic_text": "حَدَّثَنَا رَجَاءُ بْنُ الْمُرَجَّى السَّمَرْقَنْدِيُّ، ‏‏‏‏‏‏حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو حَمْزَةَ الصَّيْرَفِيُّ، ‏‏‏‏‏‏حَدَّثَنِي عَمْرُو بْنُ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَارِخًا، ‏‏‏‏‏‏فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَا لَكَ؟ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَيِّدِي رَآنِي أُقَبِّلُ جَارِيَةً لَهُ، ‏‏‏‏‏‏فَجَبَّ مَذَاكِيرِي، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ عَلَيَّ بِالرَّجُلِ ، ‏‏‏‏‏‏فَطُلِبَ فَلَمْ يُقْدَرْ عَلَيْهِ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اذْهَبْ فَأَنْتَ حُرٌّ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ عَلَى مَنْ نُصْرَتِي يَا رَسُولَ اللَّهِ؟ قَالَ:‏‏‏‏ يَقُولُ:‏‏‏‏ أَرَأَيْتَ إِنِ اسْتَرَقَّنِي مَوْلَايَ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ عَلَى كُلِّ مُؤْمِنٍ أَوْ مُسْلِمٍ ."
      },
      {
        "id": 27035,
        "hadith_number": "2681",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Orang Beriman Paling Baik Dalam Membunuh",
        "perawi_melayu": "Abdullah",
        "english_text": "Abdullah said that the Messenger of Allah (ﷺ) said: “The most decent of the people in killing are the people of faith.”",
        "malay_translation": "Abdullah berkata bahawa Rasulullah (ﷺ) bersabda: “Orang yang paling baik dalam membunuh ialah orang yang beriman.”",
        "arabic_text": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، ‏‏‏‏‏‏حَدَّثَنَا هُشَيْمٌ، ‏‏‏‏‏‏عَنْ مُغِيرَةَ، ‏‏‏‏‏‏عَنْ شِبَاكٍ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ عَلْقَمَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَعَبْدُ اللَّهِ، ‏‏‏‏‏‏قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ مِنْ أَعَفِّ النَّاسِ قِتْلَةً أَهْلَ الْإِيمَانِ ."
      },
      {
        "id": 27036,
        "hadith_number": "2682",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Orang Beriman Paling Beradab dalam Pembunuhan",
        "perawi_melayu": "Daripada 'Abdullah",
        "english_text": "It was narrated that 'Abdullah that the Messenger of Allah (ﷺ) said: “The most decent people in killing are the people of faith.”",
        "malay_translation": "Diriwayatkan daripada 'Abdullah bahawa Rasulullah ﷺ bersabda: “Orang yang paling beradab dalam pembunuhan adalah orang yang beriman.”",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا غُنْدَرٌ، ‏‏‏‏‏‏عَنْ شُعْبَةَ، ‏‏‏‏‏‏عَنْ مُغِيرَةَ، ‏‏‏‏‏‏عَنْ شِبَاكٍ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ هُنَيِّ بْنِ نُوَيْرَةَ، ‏‏‏‏‏‏عَنْ عَلْقَمَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ أَعَفَّ النَّاسِ قِتْلَةً أَهْلُ الْإِيمَانِ ."
      },
      {
        "id": 27037,
        "hadith_number": "2683",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kesaksamaan Darah dan Perlindungan Sesama Muslim",
        "perawi_melayu": "Daripada Ibn 'Abbas",
        "english_text": "It was narrated from Ibn 'Abbas that the Prophet (ﷺ) said: “The blood of every Muslims is equal, they are one hand against others. The asylum offered by the lowest of them in status applies to them (all), and the return is granted to the farthest of them.”",
        "malay_translation": "Diriwayatkan daripada Ibn 'Abbas bahawa Nabi (ﷺ) bersabda: “Darah setiap Muslim adalah sama, mereka adalah satu tangan terhadap yang lain. Perlindungan yang ditawarkan oleh yang paling rendah kedudukannya adalah terpakai kepada mereka (semua), dan hak dipulangkan kepada yang paling jauh daripada mereka.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ، ‏‏‏‏‏‏حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ حَنَشٍ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنِابْنِ عَبَّاسٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ الْمُسْلِمُونَ تَتَكَافَأُ دِمَاؤُهُمْ وَهُمْ يَدٌ عَلَى مَنْ سِوَاهُمْ يَسْعَى بِذِمَّتِهِمْ أَدْنَاهُمْ وَيُرَدُّ عَلَى أَقْصَاهُمْ ."
      },
      {
        "id": 27038,
        "hadith_number": "2684",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Umat Islam Bersatu dan Sama Darah",
        "perawi_melayu": "Ma'qil bin Yasar",
        "english_text": "It was narrated from Ma'qil bin Yasar that the Messenger of Allah (ﷺ) said: “The Muslims are one hand against others, and their blood is equal.",
        "malay_translation": "Diriwayatkan daripada Ma'qil bin Yasar bahawa Rasulullah (ﷺ) bersabda: \"Orang-orang Islam adalah seperti satu tangan terhadap yang lain, dan darah mereka adalah sama (bernilai).\"",
        "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ، ‏‏‏‏‏‏حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ أَبُو ضَمْرَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ السَّلَامِ بْنِ أَبِي الْجَنُوبِ، ‏‏‏‏‏‏عَنِالْحَسَنِ، ‏‏‏‏‏‏عَنْ مَعْقِلِ بْنِ يَسَارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْمُسْلِمُونَ يَدٌ عَلَى مَنْ سِوَاهُمْ وَتَتَكَافَأُ دِمَاؤُهُمْ ."
      },
      {
        "id": 27039,
        "hadith_number": "2685",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hak-hak dan Tanggungjawab Bersama Umat Islam",
        "perawi_melayu": "'Amr bin Shu'aib, dari bapanya, dari datuknya",
        "english_text": "It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather that the Messenger of Allah (ﷺ) said: “The hand of the Muslims is over others, and their blood and wealth is equal in value. The (asylum granted by) the lowest of them applies to the Muslims, and the Muslims return (the spoils of war) to the farthest of them.”",
        "malay_translation": "Diriwayatkan daripada 'Amr bin Shu'aib, daripada bapanya, daripada datuknya bahawa Rasulullah (ﷺ) bersabda: \"Tangan umat Islam melindungi orang lain, dan darah serta harta mereka adalah sama nilainya. (Perlindungan yang diberikan oleh) orang yang paling rendah di kalangan mereka terpakai kepada umat Islam, dan umat Islam mengembalikan (harta rampasan perang) kepada orang yang paling jauh di kalangan mereka.\"",
        "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيل، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَيَّاشٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْأَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَدُ الْمُسْلِمِينَ عَلَى مَنْ سِوَاهُمْ تَتَكَافَأُ دِمَاؤُهُمْ وَأَمْوَالُهُمْ، ‏‏‏‏‏‏وَيُجِيرُ عَلَى الْمُسْلِمِينَ أَدْنَاهُمْ، ‏‏‏‏‏‏وَيَرُدُّ عَلَى الْمُسْلِمِينَ أَقْصَاهُمْ ."
      },
      {
        "id": 27040,
        "hadith_number": "2686",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Ancaman Terhadap Pembunuhan Mu'ahid",
        "perawi_melayu": "Abdullah bin 'Amr (Semoga Allah meredhainya)",
        "english_text": "It was narrated from 'Abdullah bin 'Amr that the Messenger of Allah (ﷺ) said: “Whoever kills a Mu'ahid, will not smell the fragrance of Paradise, even though its fragrance may be detected from a distance of forty years.”",
        "malay_translation": "Diriwayatkan daripada Abdullah bin 'Amr bahawa Rasulullah (ﷺ) bersabda: “Sesiapa yang membunuh seorang Mu'ahid, dia tidak akan dapat menghidu bau syurga, walaupun sesungguhnya bau syurga itu dapat dihidu dari jarak empat puluh tahun.”",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو مُعَاوِيَةَ، ‏‏‏‏‏‏عَنِ الْحَسَنِ بْنِ عَمْرٍو، ‏‏‏‏‏‏عَنْ مُجَاهِدٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ قَتَلَ مُعَاهَدًا لَمْ يَرَحْ رَائِحَةَ الْجَنَّةِ، ‏‏‏‏‏‏وَإِنَّ رِيحَهَا لَيُوجَدُ مِنْ مَسِيرَةِ أَرْبَعِينَ عَامًا ."
      },
      {
        "id": 27041,
        "hadith_number": "2687",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Ancaman Terhadap Pembunuhan Mu'ahid",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said: “Whoever kills a Mu'ahid who has the protection of Allah and the protection of his Messenger, will not smell the fragrance of Paradise, even though its fragrance may be detected from a distance of Seventy years.”",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah رضي الله عنه bahawa Nabi ﷺ bersabda: “Sesiapa yang membunuh seorang Mu'ahid yang mempunyai perlindungan daripada Allah dan perlindungan daripada Rasul-Nya, tidak akan dapat mencium bau syurga, walaupun baunya dapat dihidu dari jarak tujuh puluh tahun.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا مَعْدِيُّ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏أَنْبَأَنَا ابْنُ عَجْلَانَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ قَتَلَ مُعَاهَدًا لَهُ ذِمَّةُ اللَّهِ وَذِمَّةُ رَسُولِهِ لَمْ يَرَحْ رَائِحَةَ الْجَنَّةِ وَإِنَّ رِيحَهَا لَيُوجَدُ مِنْ مَسِيرَةِ سَبْعِينَ عَامًا ."
      },
      {
        "id": 27042,
        "hadith_number": "2688",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Akibat Mengkhianati Kepercayaan: Membunuh Orang yang Amanah",
        "perawi_melayu": "Rifa'ah bin Shaddad Al-Qitbani",
        "english_text": "It was narrated that Rifa'ah bin Shaddad Al-Qitbani said: “Were it not for a word that I heard from 'Amr bin Hamiq Khuza'i, I would have separated the head of Al-Mukhtar from his body. I heard him saying: “The Messenger of Allah (ﷺ) said: 'If a man trusts someone with his life then he kills him, he will carry a banner of treachery on the day of Resurrection.’”",
        "malay_translation": "Diriwayatkan bahawa Rifa'ah bin Shaddad Al-Qitbani berkata: “Jika bukan kerana satu perkataan yang aku dengar daripada 'Amr bin Hamiq Khuza'i, nescaya aku akan memisahkan kepala Al-Mukhtar daripada badannya. Aku mendengar beliau berkata: “Rasulullah (ﷺ) bersabda: 'Sesiapa yang memberi kepercayaan kepada seseorang atas nyawanya kemudian membunuhnya, maka dia akan membawa panji pengkhianatan pada hari Kiamat.'”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو عَوَانَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، ‏‏‏‏‏‏عَنْ رِفَاعَةَ بْنِ شَدَّادٍ الْقِتْبَانِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَوْلَا كَلِمَةٌ سَمِعْتُهَا مِنْ عَمْرِو بْنِ الْحَمِقِ الْخُزَاعِيِّ لَمَشَيْتُ فِيمَا بَيْنَ رَأْسِ الْمُخْتَارِ وَجَسَدِهِ، ‏‏‏‏‏‏سَمِعْتُهُ يَقُولُ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ أَمِنَ رَجُلًا عَلَى دَمِهِ فَقَتَلَهُ، ‏‏‏‏‏‏فَإِنَّهُ يَحْمِلُ لِوَاءَ غَدْرٍ يَوْمَ الْقِيَامَةِ ."
      },
      {
        "id": 27043,
        "hadith_number": "2689",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kepercayaan dan Larangan Membunuh",
        "perawi_melayu": "Rifa'ah",
        "english_text": "It was narrated that Rifa'ah said: “I entered upon Mukhtar in his palace and he said: 'Jibril has just left me.' Nothing stopped me from striking his neck (i.e, killing him) but a Hadith that I heard from Sulaiman bin Surad, according to which the Prophet (ﷺ) said: 'If a man trusts you with his life, then do not kill him.' That is what stopped me.”",
        "malay_translation": "Diriwayatkan bahawa Rifa'ah berkata: “Aku memasuki istana Mukhtar dan dia berkata: 'Jibril baru sahaja meninggalkan aku.' Tiada apa pun yang menghalangkanku daripada memenggal lehernya (iaitu, membunuhnya) melainkan sebuah Hadith yang aku dengar daripada Sulaiman bin Surad, yang mana Nabi (ﷺ) bersabda: 'Jika seseorang mempercayaimu dengan nyawanya, maka janganlah kamu membunuhnya.' Itulah yang menghalangkanku.”",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو لَيْلَى، ‏‏‏‏‏‏عَنْ أَبِي عُكَّاشَةَ، ‏‏‏‏‏‏عَنْ رِفَاعَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ دَخَلْتُ عَلَى الْمُخْتَارِ فِي قَصْرِهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ قَامَ جِبْرَائِيلُ مِنْ عِنْدِيَ السَّاعَةَ فَمَا مَنَعَنِي مِنْ ضَرْبِ عُنُقِهِ إِلَّا حَدِيثٌ سَمِعْتُهُ مِنْ سُلَيْمَانَ بْنِ صُرَدٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ:‏‏‏‏ إِذَا أَمِنَكَ الرَّجُلُ عَلَى دَمِهِ فَلَا تَقْتُلْهُ فَذَاكَ الَّذِي مَنَعَنِي مِنْهُ."
      },
      {
        "id": 27044,
        "hadith_number": "2690",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kisah Lelaki yang Membunuh Secara Tidak Sengaja",
        "perawi_melayu": "Abu Hurairah (رضي الله عنه)",
        "english_text": "It was narrated that Abu Hurairah said: “A man killed (another) during the time of the Messenger of Allah (ﷺ) and was referred to the Prophet (ﷺ). He handed him over to the victim's next of kin, but the killer said: 'O Messenger of Allah (ﷺ), by Allah I did not mean to kill him.' The Messenger of Allah (ﷺ) said to the next of kin, 'If he is telling the truth and you kill him, you will go to Hell.' So he let him go. He had been tied with a rope, and he went out dragging his rope, so he became known as Dhan-Nis'ah (the one with the rope).",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah (رضي الله عنه) berkata: “Seorang lelaki membunuh (seorang lagi) pada zaman Rasulullah (ﷺ) dan perkara itu dirujuk kepada Nabi (ﷺ). Baginda menyerahkannya kepada waris mangsa, tetapi si pembunuh berkata: 'Wahai Rasulullah (ﷺ), demi Allah, saya tidak berniat membunuhnya.' Rasulullah (ﷺ) bersabda kepada waris mangsa, 'Jika dia berkata benar dan kamu membunuhnya, kamu akan masuk neraka.' Lalu dia membebaskannya. Lelaki itu telah diikat dengan tali, dan dia keluar sambil menyeret talinya, maka dia dikenali sebagai Dhan-Nis'ah (si pemilik tali).",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏ وَعَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ‏‏‏‏‏‏عَنِ الْأَعْمَشِ، ‏‏‏‏‏‏عَنْ أَبِي صَالِحٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَتَلَ رَجُلٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَرُفِعَ ذَلِكَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَدَفَعَهُ إِلَى وَلِيِّ الْمَقْتُولِ، ‏‏‏‏‏‏فَقَالَ الْقَاتِلُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏وَاللَّهِ مَا أَرَدْتُ قَتْلَهُ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْوَلِيِّ:‏‏‏‏ أَمَا إِنَّهُ إِنْ كَانَ صَادِقًا ثُمَّ قَتَلْتَهُ دَخَلْتَ النَّارَ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَخَلَّى سَبِيلَهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَكَانَ مَكْتُوفًا بِنِسْعَةٍ، ‏‏‏‏‏‏فَخَرَجَ يَجُرُّ نِسْعَتَهُ، ‏‏‏‏‏‏فَسُمِّيَ ذَا النِّسْعَةِ."
      },
      {
        "id": 27045,
        "hadith_number": "2691",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Pengampunan dan Keadilan dalam Islam",
        "perawi_melayu": "Anas bin Malik رضي الله عنه",
        "english_text": "It was narrated that Anas bin Malik said: “A man brought the killer of his relative to the Messenger of Allah (ﷺ) and the Messenger of Allah (ﷺ) said: 'Pardon him,' but the refused. He said: 'Take the blood money,' but he refused. He said: 'Go and kill him, but then you will be like him.’ Someone caught up with him and reminded him that the Messenger of Allah (ﷺ) had said: 'Go and kill him, but then you will be like him.’ So he let him go.",
        "malay_translation": "Diriwayatkan bahawa Anas bin Malik رضي الله عنه berkata: “Seorang lelaki membawa pembunuh saudaranya kepada Rasulullah ﷺ. Rasulullah ﷺ bersabda: 'Maafkanlah dia,' tetapi dia enggan. Baginda bersabda: 'Ambillah diyat (wang darah),' tetapi dia enggan. Baginda bersabda: 'Pergilah dan bunuhlah dia, tetapi kamu akan menjadi seperti dia.’ Seseorang mengejarnya dan mengingatkannya bahawa Rasulullah ﷺ telah bersabda: 'Pergilah dan bunuhlah dia, tetapi kamu akan menjadi seperti dia.’ Lalu dia melepaskannya.",
        "arabic_text": "حَدَّثَنَا أَبُو عُمَيْرٍ عِيسَى بْنُ مُحَمَّدِ بْنِ النَّحَّاسِ، ‏‏‏‏‏‏ وَعِيسَى بْنُ يُونُسَ، ‏‏‏‏‏‏ وَالْحُسَيْنُ بْنُ أَبِي السَّرِيِّ العسقلاني، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ حَدَّثَنَا ضَمْرَةُ بْنُ رَبِيعَةَ، ‏‏‏‏‏‏عَنِ ابْنِ شَوْذَبٍ، ‏‏‏‏‏‏عَنْ ثَابِتٍ الْبُنَانِيِّ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَتَى رَجُلٌ بِقَاتِلِ وَلِيِّهِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اعْفُ فَأَبَى، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ خُذْ أَرْشَكَ ، ‏‏‏‏‏‏فَأَبَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ اذْهَبْ فَاقْتُلْهُ فَإِنَّكَ مِثْلُهُ قَالَ:‏‏‏‏ فَلُحِقَ بِهِ، ‏‏‏‏‏‏فَقِيلَ لَهُ:‏‏‏‏ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ قَالَ:‏‏‏‏ اقْتُلْهُ فَإِنَّكَ مِثْلُهُ ، ‏‏‏‏‏‏فَخَلَّى سَبِيلَهُ قَالَ:‏‏‏‏ فَرُئِيَ يَجُرُّ نِسْعَتَهُ ذَاهِبًا إِلَى أَهْلِهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَأَنَّهُ قَدْ كَانَ أَوْثَقَهُ، ‏‏‏‏‏‏قَالَ أَبُو عُمَيْرٍ فِي حَدِيثِهِ:‏‏‏‏ قَالَ ابْنُ شَوْذَبٍ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، ‏‏‏‏‏‏فَلَيْسَ لِأَحَدٍ بَعْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَقُولُ:‏‏‏‏ اقْتُلْهُ فَإِنَّكَ مِثْلُهُ ، ‏‏‏‏‏‏قَالَ ابْن مَاجَةَ:‏‏‏‏ هَذَا حَدِيثُ الرَّمْلِيِّينَ لَيْسَ إِلَّا عِنْدَهُمْ."
      },
      {
        "id": 27046,
        "hadith_number": "2692",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kemaafan dalam Kes-kes Qisas",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "It was narrated that 'Ata bin Abu Maimunah said: “I only know it from Anas bin Malik who said: 'No case involving retaliation was referred to the Messenger of Allah (ﷺ) but he enjoined forgiveness.”",
        "malay_translation": "Diriwayatkan bahawa 'Ata bin Abu Maimunah berkata: “Aku hanya mengetahuinya daripada Anas bin Malik yang berkata: 'Tidak ada kes yang melibatkan qisas dirujuk kepada Rasulullah (ﷺ) melainkan Baginda memerintahkan kemaafan.”",
        "arabic_text": "حَدَّثَنَا إِسْحَاق بْنُ مَنْصُورٍ، ‏‏‏‏‏‏أَنْبَأَنَا حَبَّانُ بْنُ هِلَالٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَكْرٍ الْمُزَنِيُّ، ‏‏‏‏‏‏عَنْ عَطَاءِ بْنِ أَبِي مَيْمُونَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا أَعْلَمُهُ إِلَّا عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَا رُفِعَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْءٌ فِيهِ الْقِصَاصُ إِلَّا أَمَرَ فِيهِ بِالْعَفْوِ ."
      },
      {
        "id": 27047,
        "hadith_number": "2693",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kelebihan Memaafkan dan Mengangkat Darjat",
        "perawi_melayu": "Abu Darda",
        "english_text": "Abu Darda said: “I heard the Messenger of Allah (ﷺ) say: 'There is no man who suffers some (injury) on his body and forgives (the perpetrator), but Allah (SWT) will raise him one degree in status thereby, or erase from him one sin.'My own ears heard it and my heart memorized it.”",
        "malay_translation": "Abu Darda berkata: “Saya mendengar Rasulullah (ﷺ) bersabda: 'Tidaklah seorang lelaki yang ditimpa sesuatu (kecederaan) pada tubuhnya lalu memaafkan (pelaku), melainkan Allah (SWT) akan mengangkat darjatnya satu darjat disebabkan itu, atau menghapuskan satu dosa daripadanya.' Kedua telingaku mendengarnya dan hatiku menghafalnya.”",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنْ يُونُسَ بْنِ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنْ أَبِي السَّفَرِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ أَبُو الدَّرْدَاءِ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ مَا مِنْ رَجُلٍ يُصَابُ بِشَيْءٍ مِنْ جَسَدِهِ فَيَتَصَدَّقُ بِهِ، ‏‏‏‏‏‏إِلَّا رَفَعَهُ اللَّهُ بِهِ دَرَجَةً أَوْ حَطَّ عَنْهُ بِهِ خَطِيئَةً سَمِعَتْهُ أُذُنَايَ وَوَعَاهُ قَلْبِي."
      },
      {
        "id": 27048,
        "hadith_number": "2694",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukuman Bagi Wanita yang Melakukan Pembunuhan atau Zina",
        "perawi_melayu": "Mu'adh bin Jabal, Abu Ubaidah bin Jararah, Ubadah bin Samit dan Shaddad bin Aws",
        "english_text": "Mu'adh bin Jabal, Abu Ubaidah bin Jararah, Ubadah bin Samit and Shaddad bin Aws narrated that the Messenger of Allah (ﷺ) said: “If a woman kills someone deliberately, she should not be killed until she delivers what is in her womb, if she is pregnant, and until the child's sponsorship is guaranteed. And if a woman commits illegal sex, she should not be stoned until she delivers what is in her womb and until her child's sponsorship is guaranteed.”",
        "malay_translation": "Mu'adh bin Jabal, Abu Ubaidah bin Jararah, Ubadah bin Samit dan Shaddad bin Aws meriwayatkan bahawa Rasulullah (ﷺ) bersabda: “Jika seorang wanita membunuh seseorang dengan sengaja, dia tidak boleh dibunuh sehingga dia melahirkan apa yang ada dalam kandungannya, jika dia hamil, dan sehingga jaminan anak itu dijamin. Dan jika seorang wanita melakukan hubungan seks haram, dia tidak boleh direjam sehingga dia melahirkan apa yang ada dalam kandungannya dan sehingga jaminan anaknya dijamin.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا أَبُو صَالِحٍ، ‏‏‏‏‏‏عَنِ ابْنِ لَهِيعَةَ، ‏‏‏‏‏‏عَنِ ابْنِ أَنْعُمَ، ‏‏‏‏‏‏عَنْ عُبَادَةَ بْنِ نُسَيٍّ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ، ‏‏‏‏‏‏حَدَّثَنَا مُعَاذُ بْنُ جَبَلٍ، ‏‏‏‏‏‏ وَأَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ، ‏‏‏‏‏‏ وَعُبَادَةُ بْنُ الصَّامِتِ، ‏‏‏‏‏‏ وَشَدَّادُ بْنُ أَوْسٍ، ‏‏‏‏‏‏أن رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ الْمَرْأَةُ إِذَا قَتَلَتْ عَمْدًا لَا تُقْتَلُ حَتَّى تَضَعَ مَا فِي بَطْنِهَا إِنْ كَانَتْ حَامِلًا، ‏‏‏‏‏‏وَحَتَّى تُكَفِّلَ وَلَدَهَا، ‏‏‏‏‏‏وَإِنْ زَنَتْ لَمْ تُرْجَمْ حَتَّى تَضَعَ مَا فِي بَطْنِهَا وَحَتَّى تُكَفِّلَ وَلَدَهَا ."
      }
    ]
  }
}