{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 39,
    "data": [
      {
        "id": 25021,
        "hadith_number": "667",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Waktu Solat dan Cara Menentukannya",
        "perawi_melayu": "Sulaiman bin Buraidah",
        "english_text": "It was narrated from Sulaiman bin Buraidah that his father said: A man came to the Prophet and asked him about the times of the prayer. He said: 'Pray with us for two days.' When the sun passed its zenith he commanded Bilal to call the Adhan, then he commanded him to give the Iqamah for Zuhr; then he commanded him to give the Iqamah for 'Asr when the sun was high and clearly white. Then he commanded him to give the Iqamah for Maghrib when the sun had set; then he commanded him to give the Iqamah for 'Isha' when the red afterglow had disappeared; then he commanded him to give the Iqamah for Fajr when dawn came. On the following day he commanded him to give the Adhan for Zuhr when the extreme heat had passed and it had cooled down; then he prayed 'Asr when the sun was still high, but he delayed it more than he had done the day before; then he prayed Maghrib before the red afterglow disappeared; he prayed 'Isha' when one-third of the night had passed; and he prayed Fajr at the time when it was already light. Then he said: 'Where is the one who was asking about the times of Prayer?' The man said: 'Here I am, O Messenger of Allah.' He said: 'The times of your prayer are between the times you have seen.'",
        "malay_translation": "Dikisahkan daripada Sulaiman bin Buraidah bahawa bapanya berkata: Seorang lelaki datang kepada Nabi dan bertanya tentang waktu solat. Baginda menjawab, 'Solatlah bersama kami selama dua hari.'  Apabila matahari telah berada di puncaknya, Baginda memerintahkan Bilal untuk mengumandangkan azan, kemudian memerintahkannya untuk iqamah solat Zohor; kemudian memerintahkannya untuk iqamah solat Asar ketika matahari berada di puncaknya dan berwarna putih terang. Kemudian memerintahkannya untuk iqamah solat Maghrib ketika matahari telah terbenam; kemudian memerintahkannya untuk iqamah solat Isyak ketika cahaya senja telah hilang; kemudian memerintahkannya untuk iqamah solat Fajar ketika subuh menjelang. Pada hari berikutnya, Baginda memerintahkannya untuk mengumandangkan azan untuk solat Zohor apabila panas terik telah berlalu dan cuaca mulai sejuk; kemudian Baginda menunaikan solat Asar ketika matahari masih tinggi, tetapi ditangguhkan lebih lama daripada hari sebelumnya; kemudian Baginda menunaikan solat Maghrib sebelum cahaya senja hilang; Baginda menunaikan solat Isyak ketika satu pertiga malam telah berlalu; dan Baginda menunaikan solat Fajar ketika waktu sudah terang. Kemudian Baginda bertanya, 'Di manakah orang yang bertanya tentang waktu solat?' Lelaki itu menjawab, 'Saya di sini, wahai Rasulullah.' Baginda menjawab, 'Waktu solat kamu adalah di antara waktu-waktu yang telah kamu lihat.'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، ‏‏‏‏‏‏ وَأَحْمَدُ بْنُ سِنَانٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا إِسْحَاق بْنُ يُوسُفَ الْأَزْرَقُ، ‏‏‏‏‏‏أَنْبَأَنَا سُفْيَانُ . ح وَحَدَّثَنَاعَلِيُّ بْنُ مَيْمُونٍ الرَّقِّيُّ، ‏‏‏‏‏‏حَدَّثَنَا مَخْلَدُ بْنُ يَزِيدَ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، ‏‏‏‏‏‏عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ عَنْ وَقْتِ الصَّلَاةِ؟ فَقَالَ:‏‏‏‏ صَلِّ مَعَنَا هَذَيْنِ الْيَوْمَيْنِ، ‏‏‏‏‏‏فَلَمَّا زَالَتِ الشَّمْسُ أَمَر َبِلالا فَأَذَّنَ، ‏‏‏‏‏‏ثُمَّ أَمَرَهُ فَأَقَامَ الظُّهْرَ، ‏‏‏‏‏‏ثُمَّ أَمَرَهُ فَأَقَامَ الْعَصْرَ وَالشَّمْسُ مُرْتَفِعَةٌ بَيْضَاءُ نَقِيَّةٌ، ‏‏‏‏‏‏ثُمَّ أَمَرَهُ فَأَقَامَ الْمَغْرِبَ حِينَ غَابَتِ الشَّمْسُ، ‏‏‏‏‏‏ثُمَّ أَمَرَهُ فَأَقَامَ الْعِشَاءَ حِينَ غَابَ الشَّفَقُ، ‏‏‏‏‏‏ثُمَّ أَمَرَهُ فَأَقَامَ الْفَجْرَ حِينَ طَلَعَ الْفَجْرُ، ‏‏‏‏‏‏فَلَمَّا كَانَ مِنَ الْيَوْمِ الثَّانِي أَمَرَهُ فَأَذَّنَ الظُّهْرَ فَأَبْرَدَ بِهَا وَأَنْعَمَ أَنْ يُبْرِدَ بِهَا، ‏‏‏‏‏‏ثُمَّ صَلَّى الْعَصْرَ وَالشَّمْسُ مُرْتَفِعَةٌ أَخَّرَهَا فَوْقَ الَّذِي كَانَ، ‏‏‏‏‏‏فَصَلَّى الْمَغْرِبَ قَبْلَ أَنْ يَغِيبَ الشَّفَقُ، ‏‏‏‏‏‏وَصَلَّى الْعِشَاءَ بَعْدَ مَا ذَهَبَ ثُلُثُ اللَّيْلِ، ‏‏‏‏‏‏وَصَلَّى الْفَجْرَ فَأَسْفَرَ بِهَا ، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ أَيْنَ السَّائِلُ عَنْ وَقْتِ الصَّلَاةِ؟ فَقَالَ الرَّجُلُ:‏‏‏‏ أَنَا يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَقْتُ صَلَاتِكُمْ بَيْنَ مَا رَأَيْتُمْ ."
      },
      {
        "id": 25022,
        "hadith_number": "668",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Penjelasan tentang Jibril Memimpin Solat Nabi SAW sebanyak Lima Kali",
        "perawi_melayu": "Ibn Shihab",
        "english_text": "It was narrated from Ibn Shihab that: He was sitting on the cushions of 'Umar bin 'Abdul-'Aziz when he was the leader over Al-Madinah, and with him was 'Urwah bin Zubair. umar delayed 'Asr somewhat, and 'Urwah said to him: Jibril came down and led the Messenger of Allah in prayer. 'Umar said to him: Know what you are saying, O 'Urwah! he said: I heard Bashir bin Abu Mas'ud saying, 'I heard Abu Mas'ud saying, I heard the Messenger of Allah saying, 'Jibril came down and led me in prayer, and I prayed with him, then I prayed with him, then I prayed with him, then I prayed with him, then I prayed with him,' and he counted five prayers on his fingers.",
        "malay_translation": "Telah diriwayatkan daripada Ibn Shihab bahawa: Beliau sedang duduk di atas bantal-bantal 'Umar bin 'Abdul-'Aziz ketika baginda menjadi pemimpin di Madinah, dan bersama beliau ada 'Urwah bin Zubair. 'Umar sedikit menunda solat Asar, dan 'Urwah berkata kepadanya: Jibril telah turun dan memimpin Rasulullah SAW dalam solat. 'Umar berkata kepadanya: Ketahuilah apa yang kau katakan wahai 'Urwah! Dia berkata: Aku mendengar Bashir bin Abu Mas'ud berkata, 'Aku mendengar Abu Mas'ud berkata, Aku mendengar Rasulullah SAW bersabda, 'Jibril telah turun dan memimpinku dalam solat, dan aku solat dengannya, kemudian aku solat dengannya, kemudian aku solat dengannya, kemudian aku solat dengannya, kemudian aku solat dengannya,' dan dia menghitung lima solat dengan jari-jarinya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ، ‏‏‏‏‏‏أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، ‏‏‏‏‏‏عَنِ ابْنِ شِهَابٍ، ‏‏‏‏‏‏أَنَّهُ كَانَ قَاعِدًا عَلَى مَيَاثِرِ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ فِي إِمَارَتِهِ عَلَى الْمَدِينَةِ، ‏‏‏‏‏‏وَمَعَهُ عُرْوَةُ بْنُ الزُّبَيْرِ، ‏‏‏‏‏‏فَأَخَّر عُمَرُ الْعَصْرَ شَيْئًا، ‏‏‏‏‏‏فَقَالَ لَهُ عُرْوَةُ:‏‏‏‏ أَمَا إِنَّ جِبْرِيلَ نَزَلَ فَصَلَّى إِمَامَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ لَهُ عُمَرُ:‏‏‏‏ اعْلَمْ مَا تَقُولُ يَا عُرْوَةُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ بَشِيرَ بْنَ أَبِي مَسْعُودٍ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ سَمِعْتُ أَبَا مَسْعُودٍ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ نَزَلَ جِبْرِيلُ فَأَمَّنِي فَصَلَّيْتُ مَعَهُ، ‏‏‏‏‏‏ثُمَّ صَلَّيْتَ مَعَهُ، ‏‏‏‏‏‏ثُمَّ صَلَّيْتُ مَعَهُ، ‏‏‏‏‏‏ثُمَّ صَلَّيْتَ مَعَهُ، ‏‏‏‏‏‏ثُمَّ صَلَّيْتُ مَعَهُ، ‏‏‏‏‏‏يَحْسُبُ بِأَصَابِعِهِ خَمْسَ صَلَوَاتٍ ."
      },
      {
        "id": 25023,
        "hadith_number": "669",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Wanita Mukminah Solat Subuh Bersama Nabi SAW dan Kegelapan Malam",
        "perawi_melayu": "Aishah r.a.",
        "english_text": "It was narrated that 'Aishah said: The believing women used to perform the Subh prayer with the Prophet, then they would go back to their families and no one would recognize them, meaning of the darkness",
        "malay_translation": "Telah diriwayatkan bahawa 'Aishah r.a. berkata: Wanita-wanita mukminah dahulu sering menunaikan solat Subuh bersama Nabi SAW, kemudian mereka pulang kepada keluarga masing-masing dan tiada seorang pun yang mengenali mereka, maksudnya adalah kegelapan.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ كُنَّ نِسَاءُ الْمُؤْمِنَاتِ يُصَلِّينَ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الصُّبْحِ، ‏‏‏‏‏‏ثُمَّ يَرْجِعْنَ إِلَى أَهْلِهِنَّ فَلَا يَعْرِفُهُنَّ أَحَدٌ تَعْنِي:‏‏‏‏ مِنَ الْغَلَسِ ."
      },
      {
        "id": 25024,
        "hadith_number": "670",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Keutamaan Membaca Al-Quran di Waktu Subuh",
        "perawi_melayu": "Abu Hurairah r.a.",
        "english_text": "It was narrated from Abu Hurairah that: The Messenger of Allah recited: And recite the Qur'an during the Fajr. Verily, the recitation of the Qur'an during Fajr is ever witnessed. He said: It is witnessed by the angels of the night and the day.",
        "malay_translation": "Telah diriwayatkan daripada Abu Hurairah bahawa: Rasulullah SAW pernah membaca, \"Dan bacalah Al-Quran di waktu subuh. Sesungguhnya, bacaan Al-Quran di waktu subuh itu disaksikan. Baginda bersabda: Ia disaksikan oleh malaikat-malaikat malam dan siang.",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ بْنُ أَسْبَاطِ بْنِ مُحَمَّدٍ الْقُرَشِيُّ، ‏‏‏‏‏‏حَدَّثَنَا أَبِي، ‏‏‏‏‏‏عَنِ الْأَعْمَشِ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ، ‏‏‏‏‏‏ وَالْأَعْمَشُ، ‏‏‏‏‏‏عَنْ أَبِي صَالِحٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ:‏‏‏‏ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقُرْءَانَ الْفَجْرِ إِنَّ قُرْءَانَ الْفَجْرِ كَانَ مَشْهُودًا سورة الإسراء آية 78، ‏‏‏‏‏‏قَالَ:‏‏‏‏ تَشْهَدُهُ مَلَائِكَةُ اللَّيْلِ وَالنَّهَارِ ."
      },
      {
        "id": 25025,
        "hadith_number": "671",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Cara Solat Subuh Nabi dan Khulafa' Ar-Rasyidin",
        "perawi_melayu": "Mughith bin Sumayi",
        "english_text": "Mughith bin Sumayi said: I prayed the Subh with 'Abdullah bin Zubair in the darkness, and when he said the Taslim, I turned to Ibn 'Umar and said: 'What is this prayer?' He said: 'This is how we prayed with the Messenger of Allah and with Abu Bakr and 'Umar. When 'Umar was stabbed, 'Uthman delayed it until there was light.'",
        "malay_translation": "Mughith bin Sumayi berkata: Aku menunaikan solat Subuh bersama Abdullah bin Zubair dalam keadaan gelap.  Apabila beliau mengucapkan salam, aku menghadap Ibn 'Umar dan bertanya, 'Apakah solat ini?' Beliau menjawab, 'Inilah cara kami menunaikan solat bersama Rasulullah SAW, Abu Bakar, dan Umar.  Apabila Umar ditikam, 'Uthman menangguhkannya sehingga terbit cahaya.' ",
        "arabic_text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، ‏‏‏‏‏‏حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، ‏‏‏‏‏‏حَدَّثَنَا الْأَوْزَاعِيُّ، ‏‏‏‏‏‏حَدَّثَنَا نَهِيكُ بْنُ يَرِيمَ الْأَوْزَاعِيُّ، ‏‏‏‏‏‏حَدَّثَنَا مُغِيثُ بْنُ سُمَيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ صَلَّيْتُ مَعَ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ الصُّبْحَ بِغَلَسٍ، ‏‏‏‏‏‏فَلَمَّا سَلَّمَ أَقْبَلْتُ عَلَى ابْنِ عُمَرَ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ مَا هَذِهِ الصَّلَاةُ؟ قَالَ:‏‏‏‏ هَذِهِ صَلَاتُنَا كَانَتْ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَأَبِي بَكْرٍ، ‏‏‏‏‏‏وَعُمَرَ فَلَمَّا طُعِنَ عُمَرُ أَسْفَرَ بِهَا عُثْمَانُ ."
      },
      {
        "id": 25026,
        "hadith_number": "672",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Keutamaan Solat Subuh",
        "perawi_melayu": "Daripada Rafi' bin Khadij",
        "english_text": "It was narrated from Rafi' bin Khadij that: The Prophet said: Pray the Subh early, for indeed its reward is greater or your reward.",
        "malay_translation": "Diriwayatkan daripada Rafi' bin Khadij bahawa: Rasulullah SAW bersabda: Lakukan solat Subuh di awal waktu, kerana ganjarannya sungguh lebih besar atau ganjaran bagimu.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، ‏‏‏‏‏‏أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنِ ابْنِ عَجْلَانَ، ‏‏‏‏‏‏سَمِعَ عَاصِمَ بْنَ عُمَرَ بْنِ قَتَادَةَ، ‏‏‏‏‏‏وَجَدُّهُ بَدْرِيٌّ يُخْبِرُ، ‏‏‏‏‏‏عَنْ مَحْمُودِ بْنِ لَبِيدٍ، ‏‏‏‏‏‏عَنْ رَافِعِ بْنِ خَدِيجٍ، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ أَصْبِحُوا بِالصُّبْحِ فَإِنَّهُ أَعْظَمُ لِلْأَجْرِ، ‏‏‏‏‏‏أَوْ لِأَجْرِكُمْ ."
      },
      {
        "id": 25027,
        "hadith_number": "673",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Waktu Solat Zuhur Nabi SAW",
        "perawi_melayu": "Daripada Jabir bin Samurah RA",
        "english_text": "It was narrated from Jabir bin Samurah that: The Prophet used to pray Zuhr when the sun had passed its zenith.",
        "malay_translation": "Daripada Jabir bin Samurah, telah diriwayatkan bahawa: Nabi SAW pernah menunaikan solat Zuhur apabila matahari telah melepasi zenitnya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ‏‏‏‏‏‏عَنْ شُعْبَةَ، ‏‏‏‏‏‏عَنْ سِمَاكِ بْنِ حَرْبٍ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ سَمُرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي الظُّهْرَ إِذَا دَحَضَتِ الشَّمْسُ ."
      },
      {
        "id": 25028,
        "hadith_number": "674",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Waktu Solat Zuhur Nabi SAW Mengikut Pergerakan Matahari",
        "perawi_melayu": "Abu Barzah al-Aslami RA berkata:",
        "english_text": "It was narrated that Abu Barzah Al-Aslami said: The Prophet used to pray the Hajir prayer, which you call 'Zuhr', when the sun had passed its zenith.",
        "malay_translation": "Telah diriwayatkan daripada Abu Barzah al-Aslami RA bahawa Baginda Rasulullah SAW  melaksanakan solat Hajir, yang kamu namakan \"Zuhur\", apabila matahari telah melintasi puncaknya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ‏‏‏‏‏‏عَنْ عَوْفِ بْنِ أَبِي جَمِيلَةَ، ‏‏‏‏‏‏عَنْ سَيَّارِ بْنِ سَلَامَةَ، ‏‏‏‏‏‏عَنْ أَبِي بَرْزَةَ الْأَسْلَمِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي صَلَاةَ الْهَجِيرِ الَّتِي تَدْعُونَهَا الظُّهْرَ، ‏‏‏‏‏‏إِذَا دَحَضَتِ الشَّمْسُ ."
      },
      {
        "id": 25029,
        "hadith_number": "675",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Ketidakpedulian Rasulullah SAW Terhadap Keluhan Sahabat Mengenai Panas",
        "perawi_melayu": "Khabbab radhiallahu 'anhu",
        "english_text": "It was narrated that Khabbab said: We complained to the Messenger of Allah about the heat of the sunbaked ground, but he did not respond to our complaint. (Sahih)Another chain with similar wording",
        "malay_translation": "Telah diriwayatkan bahawa Khabbab radhiallahu 'anhu berkata: Kami mengadu kepada Rasulullah SAW tentang kepanasan bumi yang terik, tetapi Baginda tidak mengendahkan aduan kami. (Sahih) Rantaian hadis yang lain dengan lafaz yang sama.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏حَدَّثَنَا الْأَعْمَشُ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنْ حَارِثَةَ بْنِ مُضَرِّبٍ الْعَبْدِيِّ، ‏‏‏‏‏‏عَنْخَبَّابٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ شَكَوْنَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَرَّ الرَّمْضَاءِ فَلَمْ يُشْكِنَا ."
      },
      {
        "id": 25030,
        "hadith_number": "676",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Menyampaikan Keluhan Tentang Kepanasan Tanah Pada Rasulullah SAW",
        "perawi_melayu": "Abdullah bin Mas'ud radhiallahu 'anhu berkata:",
        "english_text": "It was narrated that 'Abdullah bin Mas'ud said: We complained to the Messenger of Allah about the heat of the sunbaked ground, but he did not respond to our complaint.",
        "malay_translation": "Telah diriwayatkan bahawa Abdullah bin Mas'ud berkata: Kami mengadu kepada Rasulullah SAW tentang kepanasan tanah yang terik oleh matahari, tetapi baginda tidak memberi respons kepada aduan kami.",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، ‏‏‏‏‏‏حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏عَنْ زَيْدِ بْنِ جُبَيْرٍ، ‏‏‏‏‏‏عَنْ خِشْفِ بْنِ مَالِكٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ شَكَوْنَا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَرَّ الرَّمْضَاءِ فَلَمْ يُشْكِنَا ."
      },
      {
        "id": 25031,
        "hadith_number": "677",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Menunggu Panas Surut Sebelum Solat",
        "perawi_melayu": "Abu Hurairah r.a.",
        "english_text": "It was narrated that Abu Hurairah said: The Messenger of Allah said: 'When it is very hot, then wait for it to cool down before you pray, for intense heat is from the flaring up of the Hell-fire.'",
        "malay_translation": "Telah diriwayatkan bahawa Abu Hurairah r.a. berkata: Rasulullah SAW bersabda: 'Apabila panas melampau, maka tunggulah sehingga ia reda sebelum mengerjakan solat, kerana kepanasan yang terik itu adalah daripada tiupan api neraka.'",
        "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو الزِّنَادِ، ‏‏‏‏‏‏عَنِ الْأَعْرَجِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ، ‏‏‏‏‏‏قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا اشْتَدَّ الْحَرُّ فَأَبْرِدُوا بِالصَّلَاةِ، ‏‏‏‏‏‏فَإِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ ."
      },
      {
        "id": 25032,
        "hadith_number": "678",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Menunggu Panas Surut Sebelum Solat",
        "perawi_melayu": "Daripada Abu Hurairah رضي الله عنه",
        "english_text": "It was narrated from Abu Hurairah that: The Messenger of Allah said: When it is very hot, then wait for it to cool down before you pray, for intense heat is from the flaring up of the Hell-fire.",
        "malay_translation": "Daripada Abu Hurairah رضي الله عنه, diriwayatkan bahawa Rasulullah SAW bersabda: \"Apabila cuaca sangat panas, maka tunggulah ia menjadi sejuk sebelum menunaikan solat, kerana kepanasan yang melampau adalah daripada api neraka yang sedang menyala-nyala.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، ‏‏‏‏‏‏أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، ‏‏‏‏‏‏عَنِ ابْنِ شِهَابٍ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِذَا اشْتَدَّ الْحَرُّ فَأَبْرِدُوا بِالظُّهْرِ، ‏‏‏‏‏‏فَإِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ ."
      },
      {
        "id": 25033,
        "hadith_number": "679",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Menyejukkan Diri Sebelum Solat Waktu Zuhur",
        "perawi_melayu": "Abu Sa'eed Al-Khudri r.a. berkata",
        "english_text": "It was narrated that Abu Sa'eed said: The Messenger of Allah said: 'Wait for it to cool down before you pray, for intense heat is from the flaring up of the Hell-fire.'",
        "malay_translation": "Telah diriwayatkan bahawa Abu Sa'eed r.a. berkata: Rasulullah SAW bersabda: 'Sejukkanlah diri sebelum mengerjakan solat, kerana kepanasan yang terik itu dari kepulan api neraka.'",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو مُعَاوِيَةَ، ‏‏‏‏‏‏عَنِ الْأَعْمَشِ، ‏‏‏‏‏‏عَنْ أَبِي صَالِحٍ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ، ‏‏‏‏‏‏قَالَ، ‏‏‏‏‏‏قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَبْرِدُوا بِالظُّهْرِ، ‏‏‏‏‏‏فَإِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ ."
      },
      {
        "id": 25034,
        "hadith_number": "680",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Menunggu Sejukkan Semasa Solat Zuhur di Waktu Panas Terik",
        "perawi_melayu": "Mughirah bin Shu'bah رضي الله عنه",
        "english_text": "It was narrated that Mughirah bin Shu'bah said: We were praying Zuhr with the Messenger of Allah at the time of intense heat (i.e., midday when the sun has just passed its zenith) and he said to us, Wait for it to cool down before you pray, for intense heat is from the flaring up of the Hell-fire.",
        "malay_translation": "Diriwayatkan bahawa Mughirah bin Shu'bah رضي الله عنه berkata: Kami pernah menunaikan solat Zuhur bersama Rasulullah SAW pada waktu panas terik (iaitu tengah hari ketika matahari berada di puncaknya). Baginda bersabda kepada kami, \"Tunggulah sehingga panas reda sebelum kamu solat, kerana kepanasan yang terik itu berasal daripada api neraka yang membara.\"",
        "arabic_text": "حَدَّثَنَا تَمِيمُ بْنُ الْمُنْتَصِرِ الْوَاسِطِيُّ، ‏‏‏‏‏‏حَدَّثَنَا إِسْحَاق بْنُ يُوسُفَ، ‏‏‏‏‏‏عَنْ شَرِيكٍ، ‏‏‏‏‏‏عَنْ بَيَانٍ، ‏‏‏‏‏‏عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، ‏‏‏‏‏‏عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الظُّهْرِ بِالْهَاجِر، ‏‏‏‏‏‏فَقَالَ لَنَا:‏‏‏‏ أَبْرِدُوا بِالصَّلَاةِ، ‏‏‏‏‏‏فَإِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ ."
      },
      {
        "id": 25035,
        "hadith_number": "681",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Sabar Menyejukkan Minuman Sebelum Solat Zuhur",
        "perawi_melayu": "Ibnu 'Umar r.a.",
        "english_text": "It was narrated that Ibn 'Umar said: The Messenger of Allah said: 'Wait for it to cool down before you pray the Zuhr.'",
        "malay_translation": "Telah diriwayatkan bahawa Ibnu 'Umar r.a. berkata: Rasulullah s.a.w. bersabda: 'Sejukkanlah minuman sebelum anda menunaikan solat Zuhur.'",
        "arabic_text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عُمَرَ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَبْرِدُوا بِالظُّهْرِ ."
      },
      {
        "id": 25036,
        "hadith_number": "682",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Waktu Solat Asar Nabi SAW dan Perjalanan ke Luar Madinah",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "It was narrated from Anas bin Malik that: The Messenger of Allah used to pray 'Asr when the sun was still hot and high, and if a person were to go to the suburbs (of Al-Madinah) he would be able to reach it while the sun was still hot and high.",
        "malay_translation": "Telah diriwayatkan daripada Anas bin Malik bahawa Rasulullah SAW pernah menunaikan solat Asar ketika matahari masih tinggi dan terik. Jika seseorang pergi ke luar bandar (Madinah), dia akan sampai ke sana ketika matahari masih tinggi dan terik.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، ‏‏‏‏‏‏أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، ‏‏‏‏‏‏عَنِ ابْنِ شِهَابٍ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏أَنَّهُ أَخْبَرَهُ:‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَان يُصَلِّي الْعَصْرَ وَالشَّمْسُ مُرْتَفِعَةٌ حَيَّةٌ، ‏‏‏‏‏‏فَيَذْهَبُ الذَّاهِبُ إِلَى الْعَوَالِي، ‏‏‏‏‏‏وَالشَّمْسُ مُرْتَفِعَةٌ ."
      },
      {
        "id": 25037,
        "hadith_number": "683",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Nabi SAW Menunaikan Solat Asar Ketika Matahari Masuk Bilik 'Aishah Tanpa Bayangan",
        "perawi_melayu": "Ummu al-Mu'minin 'Aishah r.a. berkata:",
        "english_text": "It was narrated that 'Aishah said: The Prophet prayed the 'Asr when the sun was shining into my room and there were no shadows yet.",
        "malay_translation": "Telah diriwayatkan bahawa 'Aishah r.a. berkata: Nabi SAW menunaikan solat 'Asar ketika matahari bersinar ke dalam bilikku, dan belum wujud bayangan lagi.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ صَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَصْرَ وَالشَّمْسُ فِي حُجْرَتِي لَمْ يُظْهِرْهَا الْفَيْءُ بَعْدُ ."
      },
      {
        "id": 25038,
        "hadith_number": "684",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Laknat Allah atas Orang-orang yang Mengganggu Solat Tengah Hari",
        "perawi_melayu": "Dari 'Ali bin Abi Talib radhiallahu 'anhu",
        "english_text": "It was narrated from 'Ali bin Abu Talib that,: On the Day of Khandaq, the Messenger of Allah said: May Allah fill their houses and graves with fire, just as they distracted us from the middle prayer.",
        "malay_translation": "Daripada 'Ali bin Abi Talib RA, bahawa pada hari Khandaq, Rasulullah SAW bersabda: Semoga Allah menjadikan rumah dan kubur mereka penuh dengan api, sebagaimana mereka telah menghalang kita daripada solat tengah hari.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، ‏‏‏‏‏‏عَنْ عَاصِمِ بْنِ بَهْدَلَةَ، ‏‏‏‏‏‏عَنْ زِرِّ بْنِ حُبَيْشٍ، ‏‏‏‏‏‏عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَوْمَ الْخَنْدَقِ:‏‏‏‏ مَلَأَ اللَّهُ بُيُوتَهُمْ وَقُبُورَهُمْ نَارًا، ‏‏‏‏‏‏كَمَا شَغَلُونَا عَنِ الصَّلَاةِ الْوُسْطَى ."
      },
      {
        "id": 25039,
        "hadith_number": "685",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kehilangan Solat Asar Sama Dengan Kehilangan Keluarga dan Harta",
        "perawi_melayu": "Daripada Ibn 'Umar RA",
        "english_text": "It was narrated from Ibn 'Umar that: The Messenger of Allah said: The one who misses the 'Asr prayer, it is as if he has been cheated out of his family and wealth.",
        "malay_translation": "Telah diriwayatkan daripada Ibn 'Umar bahawa Rasulullah SAW bersabda: Sesiapa yang terlepas solat Asar, seolah-olah dia telah ditipu daripada keluarganya dan hartanya.",
        "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ سَالِمٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِنَّ الَّذِي تَفُوتُهُ صَلَاةُ الْعَصْرِ فَكَأَنَّمَا وُتِرَ أَهْلُهُ وَمَالُهُ ."
      },
      {
        "id": 25040,
        "hadith_number": "686",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Orang Musyrik Mencegah Nabi SAW Menunaikan Solat Asar",
        "perawi_melayu": "Abdullah bin Mas'ud رضي الله عنه",
        "english_text": "It was narrated that 'Abdullah said: The idolaters kept the Prophet from the 'Asr prayer until the sun had set. He said: 'They kept us from performing the middle prayer; may Allah fill their graves and their houses with fire.'",
        "malay_translation": "Dikisahkan bahawa 'Abdullah berkata: Orang-orang musyrik menghalang Nabi SAW daripada menunaikan solat Asar sehingga matahari terbenam. Baginda bersabda: 'Mereka menghalang kita daripada menunaikan solat tengah hari; semoga Allah memenuhi kubur dan rumah mereka dengan api.'",
        "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عَمْرٍو، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ . ح وحَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا مُحَمَّدُ بْنُ طَلْحَةَ، ‏‏‏‏‏‏عَنْ زُبَيْدٍ، ‏‏‏‏‏‏عَنْ مُرَّةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَبَسَ الْمُشْرِكُونَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَلَاةِ الْعَصْرِ حَتَّى غَابَتِ الشَّمْس، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ حَبَسُونَا عَنْ صَلَاةِ الْوُسْطَى، ‏‏‏‏‏‏مَلَأَ اللَّهُ قُبُورَهُمْ وَبُيُوتَهُمْ نَارًا ."
      },
      {
        "id": 25041,
        "hadith_number": "687",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Waktu Solat Maghrib pada Zaman Rasulullah SAW dan Kebolehan Melihat Sasaran Anak Panah",
        "perawi_melayu": "Rafi' bin Khadij",
        "english_text": "Abu Najashi said: I heard Rafi' bin Khadij say: 'We used to perform the Maghrib at the time of the Messenger of Allah, and one of us would be able to see the places where his arrows would land when shot from his bow.' (Sahih)Another chain with similar wording.",
        "malay_translation": "Abu Najashi berkata: Aku mendengar Rafi' bin Khadij berkata, 'Kami pernah menunaikan solat Maghrib pada zaman Rasulullah SAW, dan salah seorang daripada kami mampu melihat tempat panah beliau terkena sasaran ketika memanahnya.' (Sahih) Rangkaian hadis lain dengan perkataan yang serupa.",
        "arabic_text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، ‏‏‏‏‏‏حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، ‏‏‏‏‏‏حَدَّثَنَا الْأَوْزَاعِيُّ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو النَّجَاشِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ رَافِعَ بْنَ خَدِيجٍ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ كُنَّا نُصَلِّي الْمَغْرِبَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَنْصَرِفُ أَحَدُنَا، ‏‏‏‏‏‏وَإِنَّهُ لَيَنْظُرُ إِلَى مَوَاقِعِ نَبْلِهِ ."
      },
      {
        "id": 25042,
        "hadith_number": "688",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Solat Maghrib Bersama Rasulullah SAW",
        "perawi_melayu": "Salamah bin Akwa'",
        "english_text": "It was narrated from Salamah bin Akwa' that: He used to pray the Maghrib with the Messenger of Allah when the sun set.",
        "malay_translation": "Daripada Salamah bin Akwa', diriwayatkan bahawa beliau selalu menunaikan solat Maghrib bersama Rasulullah SAW apabila matahari terbenam.",
        "arabic_text": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، ‏‏‏‏‏‏حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، ‏‏‏‏‏‏عَنْ سَلَمَةَ بْنِ الْأَكْوَعِ أَنَّهُ كَانَ يُصَلِّي مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَغْرِبَ إِذَا تَوَارَتْ بِالْحِجَابِ ."
      },
      {
        "id": 25043,
        "hadith_number": "689",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Keteguhan Ummah Berpegang pada Fitrah Sehingga Menjelang Maghrib",
        "perawi_melayu": "Abbas bin Abdul-Muttalib",
        "english_text": "It was narrated that 'Abbas bin 'Abdul-Muttalib said: The Messenger of Allah said: 'My Ummah will continue to adhere to the Fitrah so long as they do not delay the Maghrib until the stars have come out. (Hasan)Abu 'Abdullah bin Majah said: I heard Muhammed bin Yahya saying: 'The people in Baghdad were confused in narrating this Hadith. Abu Bakr Al-A'yan and I went to 'Awwam bin 'Abbad bin 'Awwam and he brought out to us the book of his father, and this Hadith was in it.'",
        "malay_translation": "Dikisahkan bahawa 'Abbas bin 'Abdul-Muttalib berkata: Rasulullah SAW bersabda: 'Ummahku akan terus berpegang kepada fitrah selagi mereka tidak menangguhkan solat Maghrib sehingga bintang-bintang muncul.' (Hasan). Abu 'Abdullah bin Majah berkata: Aku mendengar Muhammad bin Yahya berkata: 'Orang ramai di Baghdad keliru dalam meriwayatkan hadis ini. Saya dan Abu Bakr Al-A'yan pergi kepada 'Awwam bin 'Abbad bin 'Awwam, lalu dia mengeluarkan kitab ayahnya, dan hadis ini terdapat di dalamnya.'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، ‏‏‏‏‏‏أَنْبَأَنَا عَبَّادُ بْنُ الْعَوَّامِ، ‏‏‏‏‏‏عَنْ عُمَرَ بْنِ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنِالْحَسَنِ، ‏‏‏‏‏‏عَنِ الْأَحْنَفِ بْنِ قَيْسٍ، ‏‏‏‏‏‏عَنِ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ، ‏‏‏‏‏‏قَالَ، ‏‏‏‏‏‏قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تَزَالُ أُمَّتِي عَلَى الْفِطْرَةِ مَا لَمْ يُؤَخِّرُوا الْمَغْرِبَ حَتَّى تَشْتَبِكَ النُّجُومُ ، ‏‏‏‏‏‏قَالَ أَبُو عَبْد اللَّهِ بْن مَاجَةَ:‏‏‏‏ سَمِعْت مُحَمَّدَ بْنَ يَحْيَى، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ اضْطَرَبَ النَّاسُ فِي هَذَا الْحَدِيثِ بِبَغْدَادَ، ‏‏‏‏‏‏فَذَهَبْتُ أَنَا وَأَبُو بَكْرٍ الْأَعْيَنُ، ‏‏‏‏‏‏إِلَى الْعَوَّامِ بْنِ عَبَّادِ بْنِ الْعَوَّامِ، ‏‏‏‏‏‏فَأَخْرَجَ إِلَيْنَا أَصْلَ أَبِيهِ، ‏‏‏‏‏‏فَإِذَا الْحَدِيثُ فِيهِ."
      },
      {
        "id": 25044,
        "hadith_number": "690",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Menunda Solat Isyak Kerana Kesukaran Umat",
        "perawi_melayu": "Daripada Abu Hurairah رضي الله عنه",
        "english_text": "It was narrated from Abu Hurairah that: The Messenger of Allah said: Were it not that it would be too difficult for my Ummah, I would have commanded them to delay the 'Isha'.",
        "malay_translation": "Telah diriwayatkan daripada Abu Hurairah رضي الله عنه bahawa Rasulullah SAW bersabda: Sekiranya tidak terlalu menyusahkan umatku, nescaya aku akan memerintahkan mereka untuk menangguhkan solat Isyak.",
        "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ أَبِي الزِّنَادِ، ‏‏‏‏‏‏عَنِ الْأَعْرَجِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَوْلَا أَنْ أَشُقَّ عَلَى أُمَّتِي لَأَمَرْتُهُمْ بِتَأْخِيرِ الْعِشَاءِ ."
      },
      {
        "id": 25045,
        "hadith_number": "691",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Keutamaan Menunda Solat Isyak",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "It was narrated that Abu Hurairah said: The Messenger of Allah said: 'Were it not that it would be too difficult for my Ummah, I would have delayed the 'Isha' prayer until one third or one half of the night had passed.'",
        "malay_translation": "Telah diriwayatkan bahawa Abu Hurairah r.a. berkata: Rasulullah SAW bersabda: 'Sekiranya tidak menyusahkan umatku, nescaya aku akan menangguhkan solat Isyak sehingga sepertiga atau separuh malam berlalu.'",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو أُسَامَةَ، ‏‏‏‏‏‏ وَعَبْدُ اللَّهِ بْنُ نُمَيْرٍ، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ، ‏‏‏‏‏‏قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَوْلَا أَنْ أَشُقَّ عَلَى أُمَّتِي لَأَخَّرْتُ صَلَاةَ الْعِشَاءِ إِلَى ثُلُثِ اللَّيْلِ أَوْ نِصْفِ اللَّيْلِ ."
      },
      {
        "id": 25046,
        "hadith_number": "692",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Perihal Nabi SAW Mempunyai Cincin dan Ketabahan dalam Solat",
        "perawi_melayu": "Humaid berkata:",
        "english_text": "Humaid said: Anas bin Malik was asked: 'Did the Prophet wear a ring?' He said: 'Yes.' One night he delayed the 'Isha' prayer until almost the middle of the night. When he had prayed, he turned to face us and said: 'The people have prayed and gone to sleep, but you will still be in a state of prayer so long as you are waiting for the (next) prayer.' (Sahih)Anas said: It was as if I can see the sparkle from his ring.'",
        "malay_translation": "Humaid meriwayatkan, Anas bin Malik ditanya, 'Adakah Nabi SAW memakai cincin?' Beliau menjawab, 'Ya.' Pada suatu malam, baginda menangguhkan solat Isyak hingga hampir ke pertengahan malam. Setelah selesai solat, baginda menoleh kepada kami dan bersabda, 'Sesungguhnya manusia telah menunaikan solat dan tidur, tetapi kamu sentiasa dalam keadaan solat selagi kamu menantikan solat yang berikutnya.' Anas berkata, 'Seakan-akan aku melihat kilauan cahaya pada cincin baginda.'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، ‏‏‏‏‏‏حَدَّثَنَا حُمَيْدٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سُئِلَ أَنَسُ بْنُ مَالِكٍ، ‏‏‏‏‏‏هَلِ اتَّخَذَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَاتَمًا؟ قَالَ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏أَخَّرَ لَيْلَةً صَلَاةَ الْعِشَاءِ الآخِرَةَ إِلَى قَرِيبٍ مِنْ شَطْرِ اللَّيْلِ، ‏‏‏‏‏‏فَلَمَّا صَلَّى أَقْبَلَ عَلَيْنَا بِوَجْهِهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنَّ النَّاسَ قَدْ صَلَّوْا وَنَامُوا، ‏‏‏‏‏‏وَإِنَّكُمْ لَنْ تَزَالُوا فِي صَلَاةٍ مَا انْتَظَرْتُمُ الصَّلَاةَ ، ‏‏‏‏‏‏قَالَ أَنَسٌ:‏‏‏‏ كَأَنِّي أَنْظُرُ إِلَى وَبِيصِ خَاتَمِهِ."
      },
      {
        "id": 25047,
        "hadith_number": "693",
        "status": "sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Keutamaan Menunggu Solat Malam",
        "perawi_melayu": "Abu Sa'eed al-Khudri RA",
        "english_text": "It was narrated that Abu Sa'eed said: The Messenger of Allah led us for the Maghrib prayer. Then he did not come out until half the night had passed. Then he came out and led them in prayer, then he said: The people have prayed and gone to sleep, but you are still in a state of prayer so long as you are waiting for the (next) prayer. Were it not for the weak and the sick, I wanted to delay this prayer until the middle of the night.",
        "malay_translation": "Telah diriwayatkan bahawa Abu Sa'eed berkata: Rasulullah SAW telah memimpin solat Maghrib untuk kami. Kemudian baginda tidak keluar sehingga separuh malam berlalu. Kemudian baginda keluar dan memimpin solat mereka, kemudian baginda bersabda: Sesungguhnya manusia telah solat dan tidur, namun kalian masih dalam keadaan solat selagi kalian menanti solat berikutnya. Sekiranya bukan kerana orang yang lemah dan sakit, aku ingin menangguhkan solat ini hingga separuh malam.",
        "arabic_text": "حَدَّثَنَا عِمْرَانُ بْنُ مُوسَى اللَّيْثِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، ‏‏‏‏‏‏حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ، ‏‏‏‏‏‏عَنْ أَبِي نَضْرَةَ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْمَغْرِبِ، ‏‏‏‏‏‏ثُمَّ لَمْ يَخْرُجْ حَتَّى ذَهَبَ شَطْرُ اللَّيْلِ، ‏‏‏‏‏‏فَخَرَجَ فَصَلَّى بِهِمْ، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ إِنَّ النَّاسَ قَدْ صَلَّوْا وَنَامُوا، ‏‏‏‏‏‏وَأَنْتُمْ لَمْ تَزَالُوا فِي صَلَاةٍ مَا انْتَظَرْتُمُ الصَّلَاةَ، ‏‏‏‏‏‏وَلَوْلَا الضَّعِيفُ وَالسَّقِيمُ، ‏‏‏‏‏‏أَحْبَبْتُ أَنْ أُؤَخِّرَ هَذِهِ الصَّلَاةَ إِلَى شَطْرِ اللَّيْلِ ."
      },
      {
        "id": 25048,
        "hadith_number": "694",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Pentingnya Menunaikan Solat Zuhur dan Solat-solat Lain pada Hari Berawan",
        "perawi_melayu": "Buraidah al-Aslami r.a.",
        "english_text": "It was narrated that Buraidah Al-Aslami said: We were with the Messenger of Allah on a campaign, and he said: 'Hasten to perform prayer on a cloudy day, for whoever misses the 'Asr prayer, all his good deeds will be in vain.'",
        "malay_translation": "Telah diriwayatkan bahawa Buraidah al-Aslami r.a. berkata: Kami bersama Rasulullah SAW dalam satu peperangan, dan baginda bersabda: \"Segerakanlah solat pada hari yang mendung, sesiapa yang terlepas solat Asar, maka terbatallah amalannya.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ الصَّبَّاحِ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، ‏‏‏‏‏‏حَدَّثَنَا الْأَوْزَاعِيُّ، ‏‏‏‏‏‏حَدَّثَنِييَحْيَى بْنُ أَبِي كَثِيرٍ، ‏‏‏‏‏‏عَنْ أَبِي قِلَابَةَ، ‏‏‏‏‏‏عَنْ أَبِي الْمُهَاجِرِ، ‏‏‏‏‏‏عَن بُرَيْدَةَ الْأَسْلَمِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةٍ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ بَكِّرُوا بِالصَّلَاةِ فِي الْيَوْمِ الْغَيْمِ، ‏‏‏‏‏‏فَإِنَّهُ مَنْ فَاتَتْهُ صَلَاةُ الْعَصْرِ حَبِطَ عَمَلُهُ ."
      },
      {
        "id": 25049,
        "hadith_number": "695",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Cara Menggantikan Solat Yang Terlupa atau Terlepas",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "It was narrated that Anas bin Malik said: 'The Prophet was asked about a man who forgets prayer or sleeps and misses it. He said: 'he performs it when he remembers it.'",
        "malay_translation": "Telah diriwayatkan bahawa Anas bin Malik berkata: 'Nabi sallallahu alaihi wasallam ditanya tentang seorang lelaki yang melupakan solat atau tertidur dan terlepas solatnya. Baginda bersabda: 'Dia menunaikannya apabila dia mengingatnya.'",
        "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، ‏‏‏‏‏‏حَدَّثَنَا حَجَّاجٌ، ‏‏‏‏‏‏حَدَّثَنَا قَتَادَةُ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الرَّجُلِ يَغْفُلُ عَنِ الصَّلَاةِ، ‏‏‏‏‏‏أَوْ يَرْقُدُ عَنْهَا؟ قَالَ:‏‏‏‏ يُصَلِّيهَا إِذَا ذَكَرَهَا ."
      },
      {
        "id": 25050,
        "hadith_number": "696",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Menunaikan Solat yang Dilupakan",
        "perawi_melayu": "Anas bin Malik radhiyallahu 'anhu",
        "english_text": "It was narrated that Anas bin Malik said: The Messenger of Allah said: 'Whoever forgets a prayer, let him perform it when he remembers it.'",
        "malay_translation": "Telah diriwayatkan bahawa Anas bin Malik berkata: Rasulullah SAW bersabda: \"Sesiapa yang melupakan solat, hendaklah dia menunaikannya apabila dia mengingatnya.\"",
        "arabic_text": "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو عَوَانَةَ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ، ‏‏‏‏‏‏قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ نَسِيَ صَلَاةً فَلْيُصَلِّهَا إِذَا ذَكَرَهَا ."
      },
      {
        "id": 25051,
        "hadith_number": "697",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Ketetapan Solat Ketika Terlupa Dan Kepentingan Menjaga Solat",
        "perawi_melayu": "Abu Hurairah radhiallahu 'anhu",
        "english_text": "It was narrated from Abu Hurairah that : When the Messenger of Allah was coming back from the battle of Khaibar, night came and he felt sleepy, so he made camp and said to Bilal: Keep watch for us tonight. Bilal prayed as much as Allah decreed for him, and the Messenger of Allah and his Companions went to sleep. When dawn was approaching, Bilal went to his mount, facing towards the east, watching for the dawn. Then Bilal's eyes grew heavy while he was leaning on his mount (and he slept). Neither Bilal nor any of his Companions woke until they felt the heat of the sun. The Messenger of Allah was the first one to wake up. The Messenger of Allah was startled and said: O Bilal! Bilal said: The same thing happened to me as happened to you. May my father and mother be ransomed for you, O Messenger of Allah! He said: Bring your mounts forward a little. So they brought their mounts forward a little (away from that place). Then the Messenger of Allah performed ablution and told Bilal to call the Iqamah for prayer, and he led them in the prayer. When the Prophet finished praying, he said: Whoever forgets a Salah, let him pray it when he remembers, for Allah says: And perform the prayer for My remembrance. [Ta-Ha: 14] He (one of the narrators) said: Ibn Shihab used to recite this Verse as meaning, 'when you remember'.",
        "malay_translation": "Daripada Abu Hurairah RA, diceritakan bahawa:  Ketika Rasulullah SAW pulang dari perang Khaibar, malam tiba dan baginda mengantuk, lalu baginda mendirikan khemah dan bersabda kepada Bilal: Jaga malam ini untuk kami. Bilal solat sebanyak yang Allah tetapkan untuknya, dan Rasulullah SAW serta para sahabat baginda pun tidur.  Apabila menjelang fajar, Bilal menaiki tunggangannya, menghadap ke arah timur, menunggu terbit fajar. Kemudian, mata Bilal menjadi berat sambil bersandar pada tunggangannya (dan dia tertidur).  Tidak ada seorang pun daripada Bilal atau sahabat-sahabatnya yang terjaga sehingga matahari terasa panas. Rasulullah SAW adalah orang pertama yang terjaga. Rasulullah SAW terkejut dan bertanya: Wahai Bilal! Bilal menjawab: Kejadian yang sama berlaku kepadaku seperti yang berlaku kepadamu. Semoga ayah dan ibuku menjadi tebusanmu, wahai Rasulullah! Baginda bersabda:  Pindahkan tunggangan kamu sedikit. Maka mereka memindahkan tunggangan mereka sedikit (menjauhi tempat itu). Kemudian Rasulullah SAW berwضو dan memerintahkan Bilal untuk mengumandangkan iqamah untuk solat, dan baginda memimpin mereka dalam solat subuh.  Apabila Nabi SAW selesai solat, baginda bersabda:  Sesiapa yang melupakan solat, hendaklah dia solat sebaik sahaja dia mengingatnya, kerana Allah berfirman: Dan laksanakanlah solat kerana mengingatiKu. [Ta-Ha: 14] Beliau (salah seorang perawi) berkata: Ibn Shihab biasa membacakan ayat ini sebagai bermakna, 'apabila kamu mengingatnya'.",
        "arabic_text": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، ‏‏‏‏‏‏حَدَّثَنَا يُونُسُ، ‏‏‏‏‏‏عَنْ ابْنِ شِهَابٍ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، ‏‏‏‏‏‏عَنْأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ قَفَلَ مِنْ غَزْوَةِ خَيْبَرَ، ‏‏‏‏‏‏فَسَارَ لَيْلَهُ حَتَّى إِذَا أَدْرَكَهُ الْكَرَى عَرَّسَ، ‏‏‏‏‏‏وَقَالَ لِبِلَالٍ:‏‏‏‏ اكْلَأْ لَنَا اللَّيْلَ ، ‏‏‏‏‏‏فَصَلَّى بِلَالٌ مَا قُدِّرَ لَهُ، ‏‏‏‏‏‏وَنَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابُهُ، ‏‏‏‏‏‏فَلَمَّا تَقَارَبَ الْفَجْرُ اسْتَنَدَ بِلَالٌ إِلَى رَاحِلَتِهِ مُوَاجِهَ الْفَجْرِ، ‏‏‏‏‏‏فَغَلَبَتْ بِلَالًا عَيْنَاهُ وَهُوَ مُسْتَنِدٌ إِلَى رَاحِلَتِهِ، ‏‏‏‏‏‏فَلَمْ يَسْتَيْقِظْ بِلَالٌ وَلَا أَحَدٌ مِنْ أَصْحَابِهِ حَتَّى ضَرَبَتْهُمُ الشَّمْسُ، ‏‏‏‏‏‏فَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوَّلَهُمُ اسْتِيقَاظًا، ‏‏‏‏‏‏فَفَزَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ:‏‏‏‏ أَيْ بِلَالُ ، ‏‏‏‏‏‏فَقَالَ بِلَالٌ:‏‏‏‏ أَخَذَ بِنَفْسِي الَّذِي أَخَذَ بِنَفْسِكَ، ‏‏‏‏‏‏بِأَبِي أَنْتَ وَأُمِّي يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ اقْتَادُوا ، ‏‏‏‏‏‏فَاقْتَادُوا رَوَاحِلَهُمْ شَيْئًا، ‏‏‏‏‏‏ثُمَّ تَوَضَّأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَأَمَرَ بِلَالًا فَأَقَامَ الصَّلَاةَ فَصَلَّى بِهِمُ الصُّبْحَ، ‏‏‏‏‏‏فَلَمَّا قَضَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّلَاةَ قَالَ:‏‏‏‏ مَنْ نَسِيَ صَلَاةً فَلْيُصَلِّهَا إِذَا ذَكَرَهَا، ‏‏‏‏‏‏فَإِنَّ اللَّهَ عَزَّ وَجَلَّ قَالَ:‏‏‏‏ وَأَقِمِ الصَّلاةَ لِذِكْرِي سورة طه آية 14 ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَكَانَ ابْنُ شِهَابٍ يَقْرَؤُهَا لِلذِّكْرَى."
      },
      {
        "id": 25052,
        "hadith_number": "698",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Ketidaktelitian dalam Keadaan Terjaga, Bukan Tidur",
        "perawi_melayu": "Abu Qatadah",
        "english_text": "Abdullah bin Rabah narrated that Abu Qatadah said: They mentioned negligence because of sleeping too much, and he said: 'They slept until the sun had risen. The Messenger of Allah said: There is no negligence when oneis sleeping, rather there is negligence when one is awake. If anyone of you forgets to pray, or sleeps and misses a prayer, then let him pray when he remembers, and during its time if it is a day after. (Sahih)'Abdullah bin Rabah said: Imran bin Husain heard me when I was narrating this Hadith and said: 'O young man, look at how you are narrating the Hadith. I was present at the time of this Hadith with the Messenger of Allah.' And he did not deny anything of the Hadith.",
        "malay_translation": "Abdullah bin Rabah meriwayatkan bahawa Abu Qatadah berkata: Mereka menyebut tentang kecuaian kerana terlalu banyak tidur, dan beliau berkata: 'Mereka tidur sehingga matahari terbit. Rasulullah SAW bersabda: Tiada kecuaian dalam keadaan tidur, sebaliknya kecuaian itu berlaku dalam keadaan terjaga. Jika salah seorang daripada kamu melupakan solat, atau tertidur dan terlepas solat, maka hendaklah dia menunaikan solat itu apabila mengingatnya, dan pada waktunya jika ia pada hari berikutnya. (Sahih)' Abdullah bin Rabah berkata: Imran bin Husain mendengar saya ketika saya meriwayatkan hadis ini dan berkata: 'Wahai pemuda, perhatikan bagaimana kamu meriwayatkan hadis ini. Aku hadir pada masa hadis ini bersama Rasulullah SAW.' Dan beliau tidak menafikan sebarang perkara daripada hadis tersebut.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ، ‏‏‏‏‏‏أَنْبَأَنَا حَمَّادُ بْنُ زَيْدٍ، ‏‏‏‏‏‏عَنْ ثَابِتٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ، ‏‏‏‏‏‏عَنْ أَبِي قَتَادَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ذَكَرُوا تَفْرِيطَهُمْ فِي النَّوْمِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ نَامُوا حَتَّى طَلَعَتِ الشَّمْسُ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَيْسَ فِي النَّوْمِ تَفْرِيطٌ، ‏‏‏‏‏‏إِنَّمَا التَّفْرِيطُ فِي الْيَقَظَةِ، ‏‏‏‏‏‏فَإِذَا نَسِيَ أَحَدُكُمْ صَلَاةً، ‏‏‏‏‏‏أَوْ نَامَ عَنْهَا فَلْيُصَلِّهَا إِذَا ذَكَرَهَا وَلِوَقْتِهَا مِنَ الْغَدِ ، ‏‏‏‏‏‏قَالَ عَبْدُ اللَّهِ بْنُ رَبَاحٍ:‏‏‏‏ فَسَمِعَنِي عِمْرَانُ بْنُ الْحُصَيْنِ وَأَنَا أُحَدِّثُ بِالْحَدِيثِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا فَتًى انْظُرْ كَيْفَ تُحَدِّثُ، ‏‏‏‏‏‏فَإِنِّي شَاهِدٌ لِلْحَدِيثِ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ فَمَا أَنْكَرَ مِنْ حَدِيثِهِ شَيْئًا."
      },
      {
        "id": 25053,
        "hadith_number": "699",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Keutamaan Menunaikan Solat 'Asar dan Subuh Sebelum Waktu Terbit dan Terbenam Matahari",
        "perawi_melayu": "Daripada Abu Hurairah r.a.",
        "english_text": "It was narrated from Abu Hurairah that: The Messenger of Allah said: Whoever catches one Rak'ah of the 'Asr before the sun sets, then he has caught it, and whoever catches one Rak'ah of the Subh before the sun rises, then he has caught it.",
        "malay_translation": "Daripada Abu Hurairah r.a. yang meriwayatkan bahawa Rasulullah SAW bersabda: “Sesiapa yang sempat menunaikan satu rakaat solat 'Asar sebelum matahari terbenam, maka dia telah menunaikannya. Dan sesiapa yang sempat menunaikan satu rakaat solat Subuh sebelum matahari terbit, maka dia telah menunaikannya.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ، ‏‏‏‏‏‏أَخْبَرَنِي زَيْدُ بْنُ أَسْلَمَ، ‏‏‏‏‏‏عَنْ عَطَاءِ بْنِ يَسَارٍ، ‏‏‏‏‏‏وَعَنْ بُسْرِ بْنِ سَعِيدٍ، ‏‏‏‏‏‏وَعَنِ الْأَعْرَجِ يُحَدِّثُونَهُ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَن رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ أَدْرَكَ مِنَ الْعَصْرِ رَكْعَةً قَبْلَ أَنْ تَغْرُبَ الشَّمْسُ فَقَدْ أَدْرَكَهَا، ‏‏‏‏‏‏وَمَنْ أَدْرَكَ مِنَ الصُّبْحِ رَكْعَةً قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ فَقَدْ أَدْرَكَهَا ."
      },
      {
        "id": 25054,
        "hadith_number": "700",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Keutamaan Solat Subuh dan Asar Sebelum Terbit dan Terbenam Matahari",
        "perawi_melayu": "Aishah r.a.",
        "english_text": "It was narrated from 'Aishah that: The Messeenger of Allah said: Whoever catches one Rak'ah of the Subh before the sun rises, then he has caught it, and whoever catches one Rak'ah of the 'Asr before the sun sets, then he has caught it. (Sahih)Another chain with similar wording.",
        "malay_translation": "Daripada 'Aishah r.a. yang meriwayatkan: Rasulullah SAW bersabda: Sesiapa yang dapat menunaikan satu rakaat solat Subuh sebelum matahari terbit, maka dia telah mendapatkannya, dan sesiapa yang dapat menunaikan satu rakaat solat 'Asar sebelum matahari terbenam, maka dia telah mendapatkannya. (Sahih)  Hadis ini turut diriwayatkan dengan lafaz yang sama.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، ‏‏‏‏‏‏ وَحَرْمَلَةُ بْنُ يَحْيَى الْمِصْرِيَّانِ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِييُونُسُ، ‏‏‏‏‏‏عَنِ ابْنِ شِهَابٍ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ أَدْرَكَ مِنَ الصُّبْحِ رَكْعَةً قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ فَقَدْ أَدْرَكَهَا، ‏‏‏‏‏‏وَمَنْ أَدْرَكَ مِنَ الْعَصْرِ رَكْعَةً قَبْلَ أَنْ تَغِيبَ الشَّمْسُ فَقَدْ أَدْرَكَهَا ، ‏‏‏‏‏‏حَدَّثَنَاجَمِيلُ بْنُ الْحَسَنِ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْأَعْلَى، ‏‏‏‏‏‏حَدَّثَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ فَذَكَرَ نَحْوَهُ."
      },
      {
        "id": 25055,
        "hadith_number": "701",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Keutamaan Menunda Solat Isyak dan Menjauhi Perbualan Selepasnya",
        "perawi_melayu": "Abu Barzah Al-Aslami r.a.",
        "english_text": "It was narrated that Abu Barzah Al-Aslami said: The Messenger of Allah used to like to delay the 'Isha', and he disliked sleeping before it, and engaging in conversation after it.",
        "malay_translation": "Telah diriwayatkan bahawa Abu Barzah Al-Aslami r.a. berkata: Rasulullah SAW suka menangguhkan solat Isyak, dan baginda tidak suka tidur sebelum solat itu, dan berbual-bual selepasnya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏ وَعَبْدُ الْوَهَّابِ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ حَدَّثَنَا عَوْفٌ، ‏‏‏‏‏‏عَنْ أَبِي الْمِنْهَالِ سَيَّارِ بْنِ سَلَامَةَ، ‏‏‏‏‏‏عَنْ أَبِي بَرْزَةَ الْأَسْلَمِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَحِبُّ أَنْ يُؤَخِّرَ الْعِشَاءَ، ‏‏‏‏‏‏وَكَانَ يَكْرَهُ النَّوْمَ قَبْلَهَا وَالْحَدِيثَ بَعْدَهَا ."
      },
      {
        "id": 25056,
        "hadith_number": "702",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Rasulullah SAW Tidak Tidur Sebelum Solat Isyak dan Tidak Berbincang Selepasnya",
        "perawi_melayu": "Aishah r.a.",
        "english_text": "It was narrated that 'Aishah said: The Messenger of Allah did not sleep before the 'Isha' nor stay up (talking) after it.",
        "malay_translation": "Dikisahkan bahawa 'Aishah r.a. berkata: Rasulullah SAW tidak tidur sebelum solat Isyak dan tidak berbincang (berbicara) selepasnya.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو نُعَيْمٍ . ح وحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو عَامِرٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ يَعْلَى الطَّائِفِيُّ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ مَا نَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْلَ الْعِشَاءِ وَلَا سَمَرَ بَعْدَهَا ."
      },
      {
        "id": 25057,
        "hadith_number": "703",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Rasulullah SAW Bersembang Selepas Solat Isyak",
        "perawi_melayu": "Abdullah bin Mas'ud radhiallahu 'anhu",
        "english_text": "It was narrated that 'Abdullah bin Mas'ud said: The Messenger of Allah rebuked us for staying up (talking) after the 'Isha'.",
        "malay_translation": "Telah diriwayatkan bahawa Abdullah bin Mas'ud berkata: Rasulullah SAW menegur kami kerana bersembang hingga lewat malam selepas solat Isyak.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، ‏‏‏‏‏‏ وَإِسْحَاق بْنُ إِبْرَاهِيمَ بْنِ حَبِيبٍ، ‏‏‏‏‏‏ وَعَلِيُّ بْنُ الْمُنْذِرِ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، ‏‏‏‏‏‏حَدَّثَنَا عَطَاءُ بْنُ السَّائِبِ، ‏‏‏‏‏‏عَنْ شَقِيقٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ جَدَبَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السَّمَرَ بَعْدَ الْعِشَاءِ ، ‏‏‏‏‏‏قَال ابْنُ مَاجَهْ:‏‏‏‏ يَعْنِى:‏‏‏‏ زَجَرَنَا عَنْهُ نَهَانَا عَنْهُ."
      },
      {
        "id": 25058,
        "hadith_number": "704",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Mengikut Kaum Badwi dalam Menentukan Waktu Solat Isyak",
        "perawi_melayu": "Ibn 'Umar رضي الله عنهما",
        "english_text": "It was narrated that Ibn 'Umar said: I heard the Messenger of Allah say: 'Do not let the Bedouin make you change the name of your prayer. It is the 'Isha', and they bring their camels in and milk them at nightfall.'",
        "malay_translation": "Dikisahkan bahawa Ibn 'Umar رضي الله عنهما berkata, \"Aku mendengar Rasulullah SAW bersabda, 'Janganlah kamu mengikut kaum Badwi dalam menamakan solat kamu. Ia adalah solat Isyak, dan mereka pastinya memuatkan unta-unta dan memerah susu unta-unta pada waktu malam.'\"",
        "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ الصَّبَّاحِ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ أَبِي لَبِيدٍ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ لَا تَغْلِبَنَّكُمْ الْأَعْرَابُ عَلَى اسْمِ صَلَاتِكُمْ، ‏‏‏‏‏‏فَإِنَّهَا الْعِشَاءُ، ‏‏‏‏‏‏وَإِنَّهُمْ لَيُعْتِمُونَ بِالْإِبِلِ ."
      },
      {
        "id": 25059,
        "hadith_number": "705",
        "status": "sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Jangan Biarkan Orang Badwi Mengubah Nama Solat Kamu",
        "perawi_melayu": "Abu Hurairah r.a.",
        "english_text": "It was narrated from Abu Hurairah that: The Prophet said: Do not let the Bedouins make you change the name of your prayer. Ibn Harmalah added: Rather it is the 'Isha', but they say the 'Atamah because they bring their camels in for milking at that time (when it is dark).",
        "malay_translation": "Telah diriwayatkan daripada Abu Hurairah bahawa: Rasulullah SAW bersabda: Janganlah kamu biarkan orang Badwi mengubah nama solat kamu. Ibn Harmalah menambah: Sebenarnya ia adalah solat Isya', tetapi mereka menyebutnya 'Atamah kerana mereka memasukkan unta mereka untuk memerah susu pada waktu itu (ketika gelap).",
        "arabic_text": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، ‏‏‏‏‏‏حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ عَجْلَانَ، ‏‏‏‏‏‏عَنْ الْمَقْبُرِيِّ، ‏‏‏‏‏‏عَنْأَبِي هُرَيْرَةَ . ح وحَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدٍ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ أَبِي حَازِمٍ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَرْمَلَةَ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا تَغْلِبَنَّكُمْ الْأَعْرَابُ عَلَى اسْمِ صَلَاتِكُمْ ، ‏‏‏‏‏‏زَادَ ابْنُ حَرْمَلَةَ، ‏‏‏‏‏‏ فَإِنَّمَا هِيَ الْعِشَاءُ، ‏‏‏‏‏‏وَإِنَّمَا يَقُولُونَ الْعَتَمَةُ لِإِعْتَامِهِمْ بِالْإِبِلِ ."
      }
    ]
  }
}