{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 21,
    "data": [
      {
        "id": 26866,
        "hadith_number": "2512",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Rasulullah (ﷺ) Menjual Mudabbar",
        "perawi_melayu": "Jabir (Semoga Allah meredhainya)",
        "english_text": "It was narrated from Jabir that: the Messenger of Allah (ﷺ) sold a Mudabbar.",
        "malay_translation": "Diriwayatkan daripada Jabir (Semoga Allah meredhainya), bahawa Rasulullah (ﷺ) telah menjual seorang Mudabbar.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، ‏‏‏‏‏‏ وَعَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏حَدَّثَنَا إِسْمَاعِيل بْنُ أَبِي خَالِدٍ، ‏‏‏‏‏‏عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، ‏‏‏‏‏‏عَنْ عَطَاءٍ، ‏‏‏‏‏‏عَنْ جَابِرٍ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ بَاعَ الْمُدَبَّرِ ."
      },
      {
        "id": 26867,
        "hadith_number": "2513",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Nabi ﷺ Menjual Hamba Yang Dijanjikan Kebebasan Selepas Kematian Tuannya",
        "perawi_melayu": "Jabir bin 'Abdullah",
        "english_text": "It was narrated that Jabir bin 'Abdullah said: “A man among us promised freedom to a slave after his death, and he did not have any property other than him (this slave). So the Prophet (ﷺ) sold him, and Ibn (Nahham), a man from Banu 'Adi, bought him.”",
        "malay_translation": "Diriwayatkan daripada Jabir bin 'Abdullah, beliau berkata: “Seorang lelaki daripada kalangan kami berjanji akan membebaskan seorang hamba selepas kematiannya, dan dia tidak mempunyai harta selain daripada hamba tersebut. Maka Nabi (ﷺ) menjual hamba tersebut, dan Ibn (Nahham), seorang lelaki daripada Bani 'Adi, membelinya.”",
        "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ دِينَارٍ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ دَبَّرَ رَجُلٌ مِنَّا غُلَامًا وَلَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُ، ‏‏‏‏‏‏فَبَاعَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَاشْتَرَاهُ ابْنُ النَّحَّامِ رَجُلٌ مِنْ بَنِي عَدِيٍّ ."
      },
      {
        "id": 26868,
        "hadith_number": "2514",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Mudabbar Adalah Sebahagian daripada Sepertiga Harta",
        "perawi_melayu": "Daripada Ibn 'Umar رضي الله عنه",
        "english_text": "It was narrated from Ibn`Umar that the Prophet (ﷺ) said: “The Mudabbar is part of the one third of the estate.”",
        "malay_translation": "Diriwayatkan daripada Ibn 'Umar رضي الله عنه bahawa Nabi ﷺ bersabda: “Mudabbar adalah sebahagian daripada sepertiga harta.”",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا عَلِيُّ بْنُ ظَبْيَانَ، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ الْمُدَبَّرُ مِنَ الثُّلُثِ ، ‏‏‏‏‏‏قَالَ ابْن مَاجَةَ:‏‏‏‏ سَمِعْتُ عُثْمَانَ يَعْنِي:‏‏‏‏ ابْنَ أَبِي شَيْبَةَ يَقُولُ:‏‏‏‏ هَذَا خَطَأٌ، ‏‏‏‏‏‏يَعْنِي:‏‏‏‏ حَدِيثَ:‏‏‏‏ الْمُدَبَّرُ مِنَ الثُّلُثِ ، ‏‏‏‏‏‏قَالَ أَبُو عَبْد اللَّهِ:‏‏‏‏ لَيْسَ لَهُ أَصْلٌ."
      },
      {
        "id": 26869,
        "hadith_number": "2515",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hamba Wanita Melahirkan Anak Lelaki: Kemerdekaan Selepas Kematian Tuan",
        "perawi_melayu": "Daripada Ibn`Abbas رضي الله عنه",
        "english_text": "It was narrated from Ibn`Abbas that the Messenger of Allah (ﷺ) said: “Any man whose slave won an bears him a child, she will be free after he dies.”",
        "malay_translation": "Diriwayatkan daripada Ibn 'Abbas رضي الله عنه bahawa Rasulullah ﷺ bersabda: “Mana-mana lelaki yang hamba wanitanya melahirkan anak lelaki daripadanya, maka dia akan merdeka selepas kematiannya.”",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ إِسْمَاعِيل، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏حَدَّثَنَا شَرِيكٌ، ‏‏‏‏‏‏عَنْ حُسَيْنِ بْنِ عَبْدِ اللَّهِ بْنِ عُبَيْدِ اللَّهِ بْنِ عَبَّاسٍ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَيُّمَا رَجُلٍ وَلَدَتْ أَمَتُهُ مِنْهُ فَهِيَ مُعْتَقَةٌ عَنْ دُبُرٍ مِنْهُ ."
      },
      {
        "id": 26870,
        "hadith_number": "2516",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Ibrahim membebaskan ibunya",
        "perawi_melayu": "Ibn`Abbas",
        "english_text": "It was narrated that Ibn`Abbas said: “Mention was made of the mother of Ibrahim in the presence of the Messenger of Allah (ﷺ), and he said: 'Her son set her free.'”",
        "malay_translation": "Diriwayatkan bahawa Ibn`Abbas berkata: “Disebutkan tentang ibu Ibrahim di hadapan Rasulullah (ﷺ), dan baginda bersabda: 'Anaknya membebaskannya.'”",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُوسُفَ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو عَاصِمٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو بَكْرٍ يَعْنِي النَّهْشَلِيَّ، ‏‏‏‏‏‏عَنِ الْحُسَيْنِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْعِكْرِمَةَ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ذُكِرَتْ أُمُّ إِبْرَاهِيمَ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ:‏‏‏‏ أَعْتَقَهَا وَلَدُهَا ."
      },
      {
        "id": 26871,
        "hadith_number": "2517",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Menjual Hamba Wanita dan Ibu Anak",
        "perawi_melayu": "Jabir bin `Abdullah",
        "english_text": "Jabir bin `Abdullah was heard to say: “We used to sell our slave women and the mothers of our children (Umahat Awaldina) when the Prophet (ﷺ) was still living among us, and we did not see anything wrong with that.”",
        "malay_translation": "Jabir bin `Abdullah رضي الله عنه berkata: “Kami dahulu menjual hamba wanita dan ibu kepada anak-anak kami (Umahat Awaldina) ketika Nabi ﷺ masih hidup bersama kami, dan kami tidak melihat sebarang kesalahan dalam hal itu.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏ وَإِسْحَاق بْنُ مَنْصُورٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏عَنِ ابْنِ جُرَيْجٍ، ‏‏‏‏‏‏أَخْبَرَنِي أَبُو الزُّبَيْرِ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ:‏‏‏‏ كُنَّا نَبِيعُ سَرَارِيَّنَا وَأُمَّهَاتِ أَوْلَادِنَا وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِينَا حَيٌّ لَا نَرَى بِذَلِكَ بَأْسًا ."
      },
      {
        "id": 26872,
        "hadith_number": "2518",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Tiga Golongan yang Berhak Mendapat Pertolongan Allah",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "The Messenger of Allah (ﷺ) said: \"There are three whom Allah has made it a duty to help: the one fighting in the cause of Allah, the mukatab who wants to pay off his contract, and the one who marries seeking to remain chaste.\"",
        "malay_translation": "Rasulullah ﷺ bersabda: \"Tiga golongan yang Allah wajibkan untuk membantu mereka: orang yang berperang di jalan Allah, *mukatab* yang ingin membayar kontraknya, dan orang yang menikah dengan tujuan menjaga kesucian diri.\"",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏ وَعَبْدُ اللَّهِ بْنُ سَعِيدٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ، ‏‏‏‏‏‏عَنْ ابْنِ عَجْلَانَ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ ثَلَاثَةٌ كُلُّهُمْ حَقٌّ عَلَى اللَّهِ عَوْنُهُ:‏‏‏‏ الْغَازِي فِي سَبِيلِ اللَّهِ، ‏‏‏‏‏‏وَالْمُكَاتَبُ الَّذِي يُرِيدُ الْأَدَاءَ، ‏‏‏‏‏‏وَالنَّاكِحُ الَّذِي يُرِيدُ التَّعَفُّفَ ."
      },
      {
        "id": 26873,
        "hadith_number": "2519",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hamba yang Membeli Kebebasan dan Baki Pembayaran",
        "perawi_melayu": "`Amr bin Shu'aib, daripada bapanya, daripada datuknya",
        "english_text": "It was narrated from `Amr bin Shu'aib , from his father, from his grandfather that the Messenger of Allah (ﷺ) said: “Any slave who has made a contract to buy his freedom for one hundread Uqiyyah and pays it all except ten Uqiyyah; he is still a slave.” (One Uqiyyah is equal to 40 Dirham.)",
        "malay_translation": "Diriwayatkan daripada `Amr bin Shu'aib, daripada bapanya, daripada datuknya bahawa Rasulullah (ﷺ) bersabda: “Mana-mana hamba yang membuat perjanjian untuk membeli kebebasannya dengan seratus Uqiyyah dan membayar kesemuanya kecuali sepuluh Uqiyyah; dia masih seorang hamba.” (Satu Uqiyyah bersamaan dengan 40 Dirham.)",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ فُضَيْلٍ، ‏‏‏‏‏‏عَنْ حَجَّاجٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَيُّمَا عَبْدٍ كُوتِبَ عَلَى مِائَةِ أُوقِيَّةٍ فَأَدَّاهَا إِلَّا عَشْرَ أُوقِيَّاتٍ فَهُوَ رَقِيقٌ ."
      },
      {
        "id": 26874,
        "hadith_number": "2520",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kewajipan Hijab Wanita Terhadap Mukatab yang Berkemampuan",
        "perawi_melayu": "Umm Salamah",
        "english_text": "It was narrated from Umm Salamah that the Prophet (ﷺ) said: “If anyone of you (women) has a Mukatab, and he has enough (wealth) to pay off (his contact of manumission), she must veil herself from him.”",
        "malay_translation": "Diriwayatkan daripada Umm Salamah bahawa Nabi (ﷺ) bersabda: “Jika sesiapa di antara kamu (wanita) mempunyai seorang Mukatab, dan dia mempunyai (kekayaan) yang mencukupi untuk membayar (kontrak pembebasannya), maka hendaklah dia berhijab daripadanya.”",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ نَبْهَانَ مَوْلَى أُمِّ سَلَمَةَ، ‏‏‏‏‏‏عَنْ أُمِّ سَلَمَةَ، ‏‏‏‏‏‏أَنَّهَا أَخْبَرَتْ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ:‏‏‏‏ إِذَا كَانَ لِإِحْدَاكُنَّ مُكَاتَبٌ وَكَانَ عِنْدَهُ مَا يُؤَدِّي فَلْتَحْتَجِبْ مِنْهُ ."
      },
      {
        "id": 26875,
        "hadith_number": "2521",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Syarat-syarat yang Tidak Sesuai dengan Kitab Allah (SWT)",
        "perawi_melayu": "Daripada Hisham bin 'Urwah, daripada bapanya, daripada 'Aishah isteri Nabi (ﷺ)",
        "english_text": "It was narrated from Hisham bin 'Urwah, from his father, about 'Aishah the wife of the Prophet (ﷺ) - : that Barirah came to her when she was came to her when she was Muktabah, and her masters had written a contract of manumission for nine Uqiyyah. She (`Aishah) said: “If your masters wish I will pay them that in one sum, and the right of inheritance will belong to me.” He said: “So she went to her masters and told them about that, but they insisted that the right of inheritance should belong to them. `Aishah mentioned that to the Prophet (ﷺ) and he said: 'Do it.' Then the Prophet (ﷺ) stood up and addressed the people. He praised and glorified Allah (SWT), then he said: 'What is the matter with some people who stipulated conditions that are not in the Book of Allah (SWT)? Every conditions that is not in the Book of Allah (SWT) is invalid, even if there are one hundred conditions. The Book of Allah(SWT) is more deserving of being followed and the conditions of Allah (SWT) are more binding. And the Wala belongs to the one who manumits (the slave).\"",
        "malay_translation": "Diriwayatkan daripada Hisham bin 'Urwah, daripada bapanya, mengenai 'Aishah isteri Nabi (ﷺ), bahawa Barirah datang kepadanya ketika dia dalam status Mukatabah, dan tuannya telah menulis perjanjian pembebasan dengan bayaran sembilan Uqiyyah. 'Aishah berkata: “Sekiranya tuanmu mahu, aku akan membayar mereka sekaligus, dan hak warisan akan menjadi milikku.” Perawi berkata: “Lalu dia pergi kepada tuannya dan memberitahu mereka tentang perkara itu, tetapi mereka berkeras bahawa hak warisan harus menjadi milik mereka. 'Aishah menceritakan perkara itu kepada Nabi (ﷺ) dan baginda bersabda: 'Lakukanlah.' Kemudian Nabi (ﷺ) berdiri dan berkhutbah kepada orang ramai. Baginda memuji dan mengagungkan Allah (SWT), kemudian baginda bersabda: 'Apakah yang terjadi kepada sesetengah orang yang membuat syarat yang tidak terdapat dalam Kitab Allah (SWT)? Setiap syarat yang tidak terdapat dalam Kitab Allah (SWT) adalah batal, walaupun terdapat seratus syarat. Kitab Allah (SWT) lebih berhak untuk diikuti dan syarat Allah (SWT) lebih mengikat. Dan Wala adalah milik orang yang membebaskan (hamba).”",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏ وَعَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَزَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ بَرِيرَةَ أَتَتْهَا وَهِيَ مُكَاتَبَةٌ قَدْ كَاتَبَهَا أَهْلُهَا عَلَى تِسْعِ أَوَاقٍ، ‏‏‏‏‏‏فَقَالَتْ لَهَا:‏‏‏‏ إِنْ شَاءَ أَهْلُكِ عَدَدْتُ لَهُمْ عَدَّةً وَاحِدَةً، ‏‏‏‏‏‏وَكَانَ الْوَلَاءُ لِي، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَأَتَتْ أَهْلَهَا، ‏‏‏‏‏‏فَذَكَرَتْ ذَلِكَ لَهُمْ، ‏‏‏‏‏‏فَأَبَوْا إِلَّا أَنْ تَشْتَرِطَ الْوَلَاءَ لَهُمْ، ‏‏‏‏‏‏فَذَكَرَتْ عَائِشَةُ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ:‏‏‏‏ افْعَلِي ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَطَبَ النَّاسَ، ‏‏‏‏‏‏فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ:‏‏‏‏ مَا بَالُ رِجَالٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ، ‏‏‏‏‏‏كُلُّ شَرْطٍ لَيْسَ فِي كِتَابِ اللَّهِ فَهُوَ بَاطِلٌ، ‏‏‏‏‏‏وَإِنْ كَانَ مِائَةَ شَرْطٍ كِتَابُ اللَّهِ أَحَقُّ وَشَرْطُ اللَّهِ أَوْثَقُ وَالْوَلَاءُ لِمَنْ أَعْتَقَ ."
      },
      {
        "id": 26876,
        "hadith_number": "2522",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Ganjaran Membebaskan Hamba Muslim",
        "perawi_melayu": "Shurahbil bin Simt",
        "english_text": "It was narrated that Shurahbil bin Simt said: I said to Ka'b bin Murrah, tell us a Hadith from the Messenger of Allah (ﷺ), but be careful. He said: I heard the Messenger of Allah (ﷺ) say: “Whoever frees a Muslim man, he will be his ransom from the Fire; each of his bones will suffice (as a ransom) for each of his bones. Whoever frees two Muslim women, they will be his ransom from the Fire; each of their two bones will suffice (as a ransom) for each of his bones.”",
        "malay_translation": "Diriwayatkan bahawa Shurahbil bin Simt berkata: Aku berkata kepada Ka'b bin Murrah, 'Ceritakan kepada kami sebuah Hadith daripada Rasulullah (ﷺ), tetapi berhati-hatilah.' Beliau berkata: Aku mendengar Rasulullah (ﷺ) bersabda: \"Sesiapa yang membebaskan seorang lelaki Muslim, maka dia akan menjadi penebusnya daripada api neraka; setiap tulang-tulangnya akan mencukupi (sebagai tebusan) bagi setiap tulangnya. Sesiapa yang membebaskan dua orang wanita Muslim, mereka akan menjadi penebusnya daripada api neraka; setiap dua tulang mereka akan mencukupi (sebagai tebusan) bagi setiap tulangnya.\"",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو مُعَاوِيَةَ، ‏‏‏‏‏‏عَنِ الأَعْمَشِ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ مُرَّةَ، ‏‏‏‏‏‏عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، ‏‏‏‏‏‏عَنْ شُرَحْبِيلَ بْنِ السِّمْطِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ لِكَعْبٍ:‏‏‏‏ يَا كَعْبَ بْنَ مُرَّةَ، ‏‏‏‏‏‏حَدِّثْنَا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاحْذَرْ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ مَنْ أَعْتَقَ امْرَأً مُسْلِمًا، ‏‏‏‏‏‏كَانَ فِكَاكَهُ مِنَ النَّارِ يُجْزِئُ بِكُلُّ عَظْمٍ مِنْهُ عَظْمٍ مِنْهُ، ‏‏‏‏‏‏وَمَنْ أَعْتَقَ امْرَأَتَيْنِ مُسْلِمَتَيْنِ، ‏‏‏‏‏‏كَانَتَا فِكَاكَهُ مِنَ النَّارِ يُجْزِئُ بِكُلِّ عَظْمَيْنِ مِنْهُمَا عَظْمٌ مِنْهُ ."
      },
      {
        "id": 26877,
        "hadith_number": "2523",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hamba yang Terbaik",
        "perawi_melayu": "Abu Dharr",
        "english_text": "It was narrated that Abu Dharr said: “I said: 'O Messenger of Allah (ﷺ), which slave is best?' He said: ‘The one who is most precious to his master and most valuable in price.' ”",
        "malay_translation": "Diriwayatkan bahawa Abu Dharr berkata: \"Saya bertanya: 'Wahai Rasulullah (ﷺ), hamba manakah yang terbaik?' Baginda bersabda: ‘Hamba yang paling berharga di sisi tuannya dan yang paling mahal harganya.' ”",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو مُعَاوِيَةَ، ‏‏‏‏‏‏حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أَبِي مُرَاوِحٍ، ‏‏‏‏‏‏عَنْ أَبِي ذَرٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏أَيُّ الرِّقَابِ أَفْضَلُ؟ قَالَ:‏‏‏‏ أَنْفَسُهَا عِنْدَ أَهْلِهَا وَأَغْلَاهَا ثَمَنًا ."
      },
      {
        "id": 26878,
        "hadith_number": "2524",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Membebaskan Saudara Mahram yang Dimiliki",
        "perawi_melayu": "Samurah bin Jundub",
        "english_text": "It was narrated from Samurah bin Jundub that the Prophet (ﷺ) said: “Whoever becomes the master of a Mahram relative (with whom marriage is not lawful), he becomes free.”",
        "malay_translation": "Diriwayatkan daripada Samurah bin Jundub bahawa Nabi (ﷺ) bersabda: \"Sesiapa yang menjadi tuan kepada saudara mahramnya (yang haram dikahwini), maka dia menjadi merdeka.\"",
        "arabic_text": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ، ‏‏‏‏‏‏ وَإِسْحَاق بْنُ مَنْصُورٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ، ‏‏‏‏‏‏عَنْ حَمَّادِ بْنِ سَلَمَةَ، ‏‏‏‏‏‏عَنْقَتَادَةَ وَعَاصِمٍ، ‏‏‏‏‏‏عَنِ الْحَسَنِ، ‏‏‏‏‏‏عَنْ سَمُرَةَ بْنِ جُنْدَبٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ مَلَكَ ذَا رَحِمٍ مَحْرَمٍ فَهُوَ حُرٌّ ."
      },
      {
        "id": 26879,
        "hadith_number": "2525",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Membebaskan Sanak Saudara Mahram",
        "perawi_melayu": "Daripada Ibn`Umar (RA)",
        "english_text": "It was narrated from Ibn`Umar that the Messenger of Allah (ﷺ) said: “Whoever becomes the master of a Mahram relative, he becomes free.”",
        "malay_translation": "Diriwayatkan daripada Ibn`Umar bahawa Rasulullah (ﷺ) bersabda: “Sesiapa yang menjadi tuan kepada sanak saudara mahramnya, maka dia menjadi merdeka.”",
        "arabic_text": "حَدَّثَنَا رَاشِدُ بْنُ سَعِيدٍ الرَّمْلِيُّ، ‏‏‏‏‏‏ وَعُبَيْدُ اللَّهِ بْنُ الْجَهْمِ الْأَنْمَاطِيُّ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا ضَمْرَةُ بْنُ رَبِيعَةَ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏عَنْعَبْدِ اللَّهِ بْنِ دِينَارٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ مَلَكَ ذَا رَحِمٍ مَحْرَمٍ فَهُوَ حُرٌّ ."
      },
      {
        "id": 26880,
        "hadith_number": "2526",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Pembebasan Safinah dan Khidmatnya kepada Nabi (ﷺ)",
        "perawi_melayu": "Safinah (Abu 'Abdur-Rahman)",
        "english_text": "It was narrated from that Safinah - Abu 'Abdur-Rahman-said : “Umm Salamah freed me but stipulated that I should serve the Prophet (ﷺ) as long he lived.”",
        "malay_translation": "Diriwayatkan daripada Safinah – Abu 'Abdur-Rahman – berkata: “Umm Salamah membebaskan aku tetapi menetapkan syarat aku berkhidmat kepada Nabi (ﷺ) selagi baginda hidup.”",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُعَاوِيَةَ الْجُمَحِيُّ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ جُمْهَانَ، ‏‏‏‏‏‏عَنْ سَفِينَةَ أَبِي عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَعْتَقَتْنِي أُمُّ سَلَمَةَ وَاشْتَرَطَتْ عَلَيَّ أَنْ أَخْدُمَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا عَاشَ ."
      },
      {
        "id": 26881,
        "hadith_number": "2527",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kebebasan Sebahagian Hamba",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: “Whoever frees his share of a slave or part of his share, must pay from his wealth if he has any wealth if he has any wealth (in order to buy the rest of the slave's freedom). If he does not have wealth, then the slave should be asked to work for the price (of his freedom), without that causing him too much hardship.”",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah رضي الله عنه bahawa Rasulullah ﷺ bersabda: “Sesiapa yang membebaskan sebahagian daripada hamba atau sebahagian daripada bahagiannya, maka wajiblah dia membayar daripada hartanya jika dia mempunyai harta (untuk membeli baki kebebasan hamba tersebut). Jika dia tidak mempunyai harta, maka hamba itu hendaklah diminta bekerja untuk membayar harganya (kebebasannya), tanpa membebankannya terlalu berat.”",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ بِشْرٍ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْالنَّضْرِ بْنِ أَنَسٍ، ‏‏‏‏‏‏عَنْ بَشِيرِ بْنِ نَهِيكٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ أَعْتَقَ نَصِيبًا لَهُ فِي مَمْلُوكٍ أَوْ شِقْصًا، ‏‏‏‏‏‏فَعَلَيْهِ خَلَاصُهُ مِنْ مَالِهِ إِنْ كَانَ لَهُ مَالٌ، ‏‏‏‏‏‏فَإِنْ لَمْ يَكُنْ لَهُ مَالٌ اسْتُسْعِيَ الْعَبْدُ فِي قِيمَتِهِ غَيْرَ مَشْقُوقٍ عَلَيْهِ ."
      },
      {
        "id": 26882,
        "hadith_number": "2528",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Membebaskan Sebahagian Hamba: Penilaian dan Pembayaran",
        "perawi_melayu": "Daripada Ibn`Umar",
        "english_text": "It was narrated from Ibn`Umar that the Messenger of Allah (ﷺ) said: “Whoever frees his share of a slave, the price of the slave should be fairly evaluated, and he (the partner who initiated this process) should free him (in full, by giving the rest of his price to the other co-owners), if he has enough wealth to do so. Otherwise, he will have freed whatever he freed.”",
        "malay_translation": "Diriwayatkan daripada Ibn 'Umar bahawa Rasulullah (ﷺ) bersabda: \"Sesiapa yang membebaskan bahagiannya daripada seorang hamba, harga hamba itu hendaklah dinilai dengan adil, dan dia (rakan kongsi yang memulakan proses ini) hendaklah membebaskannya (secara penuh, dengan memberikan baki harganya kepada rakan kongsi yang lain), jika dia mempunyai cukup harta untuk berbuat demikian. Jika tidak, dia telah membebaskan apa sahaja yang telah dibebaskannya.\"",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ، ‏‏‏‏‏‏حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، ‏‏‏‏‏‏حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ أَعْتَقَ شِرْكًا لَهُ فِي عَبْدٍ أُقِيمَ عَلَيْهِ بِقِيمَةِ عَدْلٍ، ‏‏‏‏‏‏فَأَعْطَى شُرَكَاءَهُ حِصَصَهُمْ إِنْ كَانَ لَهُ مِنَ الْمَالِ مَا يَبْلُغُ ثَمَنَهُ وَعَتَقَ عَلَيْهِ الْعَبْدُ وَإِلَّا فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ ."
      },
      {
        "id": 26883,
        "hadith_number": "2529",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Harta Hamba yang Dibebaskan",
        "perawi_melayu": "Daripada Ibn`Umar",
        "english_text": "It was narrated from Ibn`Umar that the Messenger of Allah (ﷺ) said: “Whoever frees a slave who has some wealth, the slave's wealth belongs to him, unless the master stipulates that it will belong to him.”",
        "malay_translation": "Diriwayatkan daripada Ibn`Umar bahawa Rasulullah (ﷺ) bersabda: “Sesiapa yang membebaskan seorang hamba yang mempunyai harta, maka harta hamba itu adalah miliknya, kecuali tuannya menetapkan bahawa ia akan menjadi miliknya.”",
        "arabic_text": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، ‏‏‏‏‏‏أَخْبَرَنِي ابْنُ لَهِيعَةَ، ‏‏‏‏‏‏ح وَحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، ‏‏‏‏‏‏أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ جَمِيعًا، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ، ‏‏‏‏‏‏عَنْ بُكَيْرِ بْنِ الْأَشَجِّ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنِابْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ أَعْتَقَ عَبْدًا وَلَهُ مَالٌ، ‏‏‏‏‏‏فَمَالُ الْعَبْدِ لَهُ إِلَّا أَنْ يَشْتَرِطَ السَّيِّدُ مَالَهُ فَيَكُونَ لَهُ ، ‏‏‏‏‏‏وَقَالَ ابْنُ لَهِيعَةَ:‏‏‏‏ إِلَّا أَنْ يَسْتَثْنِيَهُ السَّيِّدُ."
      },
      {
        "id": 26884,
        "hadith_number": "2530",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kebebasan Hamba dan Harta Milik",
        "perawi_melayu": "Daripada Ishaq bin Ibrahim, daripada datuknya 'Umair, bekas hamba Ibn Mas'ud",
        "english_text": "It was narrated from Ishaq bin Ibrahim, from his grandfather 'Umair, who was the freed slave of Ibn Mas'ud, that `Abdullah said to him: “O Umair, I have set you free in a good way. I heard the Messenger of Allah (ﷺ) say: 'Any man who frees a slave and does not say anything about his (the slave's) wealth, it belongs to him (the slave).' So tell me, how much wealth do you have?”",
        "malay_translation": "Diriwayatkan daripada Ishaq bin Ibrahim, daripada datuknya 'Umair, bekas hamba Ibn Mas'ud, bahawa `Abdullah berkata kepadanya: “Wahai Umair, sesungguhnya aku telah membebaskan kamu dengan cara yang baik. Aku mendengar Rasulullah (ﷺ) bersabda: 'Mana-mana lelaki yang membebaskan seorang hamba dan tidak menyebutkan apa-apa tentang hartanya (hamba itu), maka harta itu adalah miliknya (hamba itu).' Maka beritahu aku, berapa banyak harta yang kamu miliki?”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا سَعِيدُ بْنُ مُحَمَّدٍ الْجَرْمِيُّ، ‏‏‏‏‏‏حَدَّثَنَا الْمُطَّلِبُ بْنُ زِيَادٍ، ‏‏‏‏‏‏عَنْ إِسْحَاق بْنِ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ جَدِّهِ عُمَيْرٍ وَهُوَ مَوْلَى ابْنِ مَسْعُودٍ، ‏‏‏‏‏‏أَنَّ عَبْدَ اللَّهِ، ‏‏‏‏‏‏قَالَ لَهُ:‏‏‏‏ يَا عُمَيْرُ إِنِّي أُعِتِقُكَ عِتْقًا هَنِيئًا، ‏‏‏‏‏‏إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ أَيُّمَا رَجُلٍ أَعْتَقَ غُلَامًا وَلَمْ يُسَمِّ مَالَهُ فَالْمَالُ لَهُ فَأَخْبِرْنِي مَا مَالُكَ؟"
      },
      {
        "id": 26885,
        "hadith_number": "2531",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Keutamaan Jihad Berbanding Membebaskan Anak Haram",
        "perawi_melayu": "Maimunah bint Sa`d, hamba wanita yang dibebaskan oleh Nabi (ﷺ)",
        "english_text": "It was narrated from Maimunah bint Sa`d, the freed slave woman of the Prophet (ﷺ) that : the Messenger of Allah (ﷺ) was asked about illegitimate children. He said: “Two sandals in which I wage Jihad are better than freeing an illegitimate child.”",
        "malay_translation": "Diriwayatkan daripada Maimunah bint Sa`d, hamba wanita yang telah dibebaskan oleh Nabi (ﷺ) bahawa: Rasulullah (ﷺ) ditanya tentang anak luar nikah. Baginda bersabda: “Dua selipar yang aku berjihad dengannya adalah lebih baik daripada membebaskan anak luar nikah.”",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ، ‏‏‏‏‏‏حَدَّثَنَا إِسْرَائِيلُ، ‏‏‏‏‏‏عَنْ زَيْدِ بْنِ جُبَيْرٍ، ‏‏‏‏‏‏عَنْ أَبِي يَزِيدَ الضَّنيِّ، ‏‏‏‏‏‏عَنْ مَيْمُونَةَ بِنْتِ سَعْدٍ مَوْلَاةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ وَلَدِ الزِّنَا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ نَعْلَانِ أُجَاهِدُ فِيهِمَا خَيْرٌ مِنْ أَنْ أُعْتِقَ وَلَدَ الزِّنَا ."
      },
      {
        "id": 26886,
        "hadith_number": "2532",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Keutamaan Membebaskan Hamba Lelaki Terlebih Dahulu",
        "perawi_melayu": "Aisyah (رَضِيَ ٱللَّٰهُ عَنْهَا)",
        "english_text": "It was narrated that : `Aishah had a male slave and a female slave who were married. She said: “O Messenger of Allah (ﷺ), I want to free them both.” The Messenger of Allah (ﷺ) said: “If you free them, then start with the man before the woman.”",
        "malay_translation": "Diriwayatkan bahawa: Aisyah mempunyai seorang hamba lelaki dan seorang hamba perempuan yang telah berkahwin. Beliau berkata: “Wahai Rasulullah (ﷺ), saya ingin membebaskan mereka berdua.” Rasulullah (ﷺ) bersabda: “Jika kamu membebaskan mereka, maka mulakan dengan lelaki sebelum perempuan.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ، ‏‏‏‏‏‏ح وَحَدَّثَنَا مُحَمَّدُ بْنُ خَلَفٍ الْعَسْقَلَانِيُّ، ‏‏‏‏‏‏ وَإِسْحَاق بْنُ مَنْصُورٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ، ‏‏‏‏‏‏حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ مَوْهَبٍ، ‏‏‏‏‏‏عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، ‏‏‏‏‏‏عَنْعَائِشَةَ، ‏‏‏‏‏‏أَنَّهَا كَانَ لَهَا غُلَامٌ وَجَارِيَةٌ زَوْجٌ، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ يَا رَسُولَ اللَّهِ إِنِّي أُرِيدُ أَنْ أُعْتِقَهُمَا، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنْ أَعْتَقْتِهِمَا فَابْدَئِي بِالرَّجُلِ قَبْلَ الْمَرْأَةِ ."
      }
    ]
  }
}