{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 56,
    "data": [
      {
        "id": 26790,
        "hadith_number": "2436",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Nabi ﷺ Membeli Makanan dan Menggadai Baju Besinya",
        "perawi_melayu": "Daripada 'Aishah رضي الله عنها",
        "english_text": "It was narrated from 'Aisha that : the Messenger of Allah (ﷺ) bought some food from a Jew with payment to be made later, and he pawned his armor for that.",
        "malay_translation": "Diriwayatkan daripada 'Aishah رضي الله عنها, bahawa Rasulullah ﷺ membeli makanan daripada seorang Yahudi dengan pembayaran yang akan dibuat kemudian, dan baginda menggadai baju besinya.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، ‏‏‏‏‏‏عَنِ الْأَعْمَشِ، ‏‏‏‏‏‏عَنْ إِبْرَاهِيمَ، ‏‏‏‏‏‏حَدَّثَنِي الْأَسْوَدُ، ‏‏‏‏‏‏عَنْعَائِشَةَ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اشْتَرَى مِنْ يَهُودِيٍّ طَعَامًا إِلَى أَجَلٍ وَرَهَنَهُ دِرْعَهُ ."
      },
      {
        "id": 26791,
        "hadith_number": "2437",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Rasulullah (ﷺ) Menggadaikan Perisai kepada Orang Yahudi untuk Makanan Keluarga",
        "perawi_melayu": "Anas (RA)",
        "english_text": "It was narrated that Anas said: “The Messenger of Allah (ﷺ) pawned his armor to a jew in Al-Madinah, and took barely for his family in return.”",
        "malay_translation": "Diriwayatkan bahawa Anas berkata: “Rasulullah (ﷺ) menggadaikan perisai baginda kepada seorang Yahudi di Al-Madinah, dan mengambil gandum untuk keluarganya sebagai gantinya.”",
        "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، ‏‏‏‏‏‏حَدَّثَنِي أَبِي، ‏‏‏‏‏‏حَدَّثَنَا هِشَامٌ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَقَدْ رَهَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دِرْعَهُ عِنْدَ يَهُودِيٍّ بِالْمَدِينَةِ فَأَخَذَ لِأَهْلِهِ مِنْهُ شَعِيرًا ."
      },
      {
        "id": 26792,
        "hadith_number": "2438",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Nabi ﷺ Wafat dalam Keadaan Zirah Digadaikan",
        "perawi_melayu": "Asma' bin Yazid",
        "english_text": "It was narrated from Asma' bin Yazid that: the Prophet (ﷺ) died while his armor was pawned to a Jew for food.",
        "malay_translation": "Diriwayatkan daripada Asma' bin Yazid bahawa: Nabi (ﷺ) wafat sedangkan zirah baginda digadaikan kepada seorang Yahudi kerana makanan.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنْ عَبْدِ الْحَمِيدِ بْنِ بَهْرَامَ، ‏‏‏‏‏‏عَنْ شَهْرِ بْنِ حَوْشَبٍ، ‏‏‏‏‏‏عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ تُوُفِّيَ وَدِرْعُهُ مَرْهُونَةٌ عِنْدَ يَهُودِيٍّ بِطَعَامٍ ."
      },
      {
        "id": 26793,
        "hadith_number": "2439",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Rasulullah (ﷺ) Meninggal Dunia Dengan Baju Besinya Digadaikan",
        "perawi_melayu": "Daripada Ibn 'Abbas",
        "english_text": "It was narrated from Ibn 'Abbas that: the Messenger of Allah (ﷺ) died while his armor was pawned to a Jew for thirty Sa’s of barley.",
        "malay_translation": "Diriwayatkan daripada Ibn 'Abbas bahawa: Rasulullah (ﷺ) wafat ketika baju besinya digadaikan kepada seorang Yahudi dengan tiga puluh Sa’ gandum.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُعَاوِيَةَ الْجُمَحِيُّ، ‏‏‏‏‏‏حَدَّثَنَا ثَابِتُ بْنُ يَزِيدَ، ‏‏‏‏‏‏حَدَّثَنَا هِلَالُ بْنُ خَبَاب:‏‏‏‏، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَاتَ وَدِرْعُهُ رَهْنٌ عِنْدَ يَهُودِيٍّ بِثَلَاثِينَ صَاعًا مِنْ شَعِيرٍ ."
      },
      {
        "id": 26794,
        "hadith_number": "2440",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Penggunaan Haiwan yang Digadai",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: “A mount may be ridden when it is pawned, and its milk may be drunk when it is pawned, but the one who rides it or milks it must pay for its upkeep.' ”",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah رضي الله عنه bahawa Rasulullah ﷺ bersabda: “Haiwan tunggangan boleh ditunggangi apabila ia digadai, dan susunya boleh diminum apabila ia digadai, tetapi sesiapa yang menunggangnya atau memerah susunya hendaklah membayar kos penjagaannya.' ”",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنْ زَكَرِيَّا، ‏‏‏‏‏‏عَنِ الشَّعْبِيِّ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الظَّهْرُ يُرْكَبُ إِذَا كَانَ مَرْهُونًا، ‏‏‏‏‏‏وَلَبَنُ الدَّرِّ يُشْرَبُ إِذَا كَانَ مَرْهُونًا، ‏‏‏‏‏‏وَعَلَى الَّذِي يَرْكَبُ وَيَشْرَبُ، ‏‏‏‏‏‏نَفَقَتُهُ ."
      },
      {
        "id": 26795,
        "hadith_number": "2441",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Membatalkan Barang Gadaian",
        "perawi_melayu": "Abu Hurairah (Semoga Allah meredhainya)",
        "english_text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: “Do not forfeit items held in pledge.”",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah bahawa Rasulullah (ﷺ) bersabda: “Janganlah dibatalkan barang gadaian.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ، ‏‏‏‏‏‏حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُخْتَارِ، ‏‏‏‏‏‏عَنْ إِسْحَاق بْنِ رَاشِدٍ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا يَغْلَقُ الرَّهْنُ ."
      },
      {
        "id": 26796,
        "hadith_number": "2442",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Allah SWT Menentang Tiga Golongan pada Hari Kiamat",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: (Allah (SWT) says:) “I am the opponent of three on the Day of Resurrection, and if I am someone's opponent I will defeat him: A man who makes promises in My Name, then proves treacherous; a man who sells a free man and consumes his price; and a man who hires a worker, makes use to him, then does not give him his wages.”",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah رضي الله عنه, bahawa Rasulullah ﷺ bersabda: (Allah SWT berfirman:) “Aku akan menjadi musuh kepada tiga golongan pada Hari Kiamat, dan sesiapa yang Aku menjadi musuhnya, nescaya Aku akan mengalahkannya: Seorang lelaki yang membuat janji atas Nama-Ku, kemudian mengkhianatinya; seorang lelaki yang menjual orang merdeka dan memakan harganya; dan seorang lelaki yang mengupah pekerja, mengambil manfaat daripadanya, kemudian tidak membayar upahnya.”",
        "arabic_text": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، ‏‏‏‏‏‏حَدَّثَنَا يَحْيَى بْنُ سَلِيمٍ، ‏‏‏‏‏‏عَنْ إِسْمَاعِيل بْنِ أُمَيَّةَ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، ‏‏‏‏‏‏عَنْأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ ثَلَاثَةٌ أَنَا خَصْمُهُمْ يَوْمَ الْقِيَامَةِ وَمَنْ كُنْتُ خَصْمَهُ خَصَمْتُهُ يَوْمَ الْقِيَامَةِ:‏‏‏‏ رَجُلٌ أَعْطَى بِي ثُمَّ غَدَرَ، ‏‏‏‏‏‏وَرَجُلٌ بَاعَ حُرًّا فَأَكَلَ ثَمَنَهُ، ‏‏‏‏‏‏وَرَجُلٌ اسْتَأْجَرَ أَجِيرًا فَاسْتَوْفَى مِنْهُ وَلَمْ يُوفِهِ أَجْرَهُ ."
      },
      {
        "id": 26797,
        "hadith_number": "2443",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kewajipan Membayar Upah Sebelum Kering Peluh",
        "perawi_melayu": "Abdullah bin 'Umar",
        "english_text": "It was narrated from 'Abdullah bin 'Umar that the Messenger of Allah (ﷺ) said: “Give the worker his wages before his sweat dries.”",
        "malay_translation": "Diriwayatkan daripada 'Abdullah bin 'Umar bahawa Rasulullah (ﷺ) bersabda: \"Berikanlah upah kepada pekerja sebelum kering peluhnya.\" ",
        "arabic_text": "حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ الدِّمَشْقِيُّ، ‏‏‏‏‏‏حَدَّثَنَا وَهْبُ بْنُ سَعِيدِ بْنِ عَطِيَّةَ السَّلَمِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ زَيْدِ بْنِ أَسْلَمَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَعْطُوا الْأَجِيرَ أَجْرَهُ قَبْلَ أَنْ يَجِفَّ عَرَقُهُ ."
      },
      {
        "id": 26798,
        "hadith_number": "2444",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Musa (A.S) Menyewa Diri untuk Kehormatan dan Makanan",
        "perawi_melayu": "Utbah bin Nuddar (رَضِيَ اللَّهُ عَنْهُ)",
        "english_text": "It was narrated that 'Ali bin Rabah said: “I heard 'Utbah bin Nuddar say: 'We were with the Messenger of Allah (ﷺ) and he recited Ta-Sin. When he reached the story of Musa, he said: 'Musa (A.S) hired himself out for eight years, or ten, in return for his chastity and food in his stomach.' ”",
        "malay_translation": "Diriwayatkan bahawa Ali bin Rabah berkata: “Saya mendengar Utbah bin Nuddar berkata: 'Kami bersama Rasulullah (ﷺ) dan baginda membaca Ta-Sin. Apabila baginda sampai ke kisah Musa, baginda berkata: 'Musa (A.S) menyewa dirinya selama lapan tahun, atau sepuluh, sebagai ganjaran untuk kesucian dirinya dan makanan di dalam perutnya.' ”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ، ‏‏‏‏‏‏حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ، ‏‏‏‏‏‏عَنْ مَسْلَمَةَ بْنِ عَلِيٍّ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ أَبِي أَيُّوبَ، ‏‏‏‏‏‏عَنْالْحَارِثِ بْنِ يَزِيدَ، ‏‏‏‏‏‏عَنْ عُلَيِّ بْنِ رَبَاحٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ عُتْبَةَ بْنَ النُّدَّرِ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ كُنَّا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَرَأَ طسم حَتَّى إِذَا بَلَغَ قِصَّةَ مُوسَى قَالَ:‏‏‏‏ إِنَّ مُوسَى صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ آجَرَ نَفْسَهُ ثَمَانِيَ سِنِينَ أَوْ عَشْرًا عَلَى عِفَّةِ فَرْجِهِ وَطَعَامِ بَطْنِهِ ."
      },
      {
        "id": 26799,
        "hadith_number": "2445",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kisah Abu Hurairah: Kehidupan Awal yang Sederhana dan Peran dalam Agama",
        "perawi_melayu": "Salim bin Hayyan",
        "english_text": "Salim bin Hayyan said: I heard Abu Hurairah say: “I grew up an orphan, and I emigrated as a poor man, and I was hired by the daughter of Ghazwan in return for food and a turn riding the camel. I would gather firewood for them when they stopped to camp and urge their camels along for them by singing when they rode. Praise is to Allah (SWT) who has caused His religion to prevail and has made Abu Hurairah an Imam.”",
        "malay_translation": "Salim bin Hayyan berkata: Saya mendengar Abu Hurairah berkata: “Saya membesar sebagai seorang yatim, dan saya berhijrah sebagai seorang miskin, dan saya telah bekerja dengan anak perempuan Ghazwan sebagai ganjaran makanan dan giliran menunggang unta. Saya akan mengumpul kayu api untuk mereka apabila mereka berhenti berkhemah dan menggesa unta mereka dengan menyanyi untuk mereka ketika mereka menunggang. Segala puji bagi Allah (SWT) yang telah menjadikan agama-Nya berjaya dan telah menjadikan Abu Hurairah sebagai seorang Imam.”",
        "arabic_text": "حَدَّثَنَا أَبُو عُمَرَ حَفْصُ بْنُ عَمْرٍو، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، ‏‏‏‏‏‏حَدَّثَنَا سَلِيمُ بْنُ حَيَّانَ، ‏‏‏‏‏‏سَمِعْتُ أَبِي، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ سَمِعْتُ أَبَا هُرَيْرَةَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ نَشَأْتُ يَتِيمًا وَهَاجَرْتُ مِسْكِينًا وَكُنْتُ أَجِيرًا لِابْنَةِ غَزْوَانَ بِطَعَامِ بَطْنِي وَعُقْبَةِ رِجْلِي، ‏‏‏‏‏‏أَحْطِبُ لَهُمْ إِذَا نَزَلُوا وَأَحْدُو لَهُمْ إِذَا رَكِبُوا، ‏‏‏‏‏‏فَالْحَمْدُ لِلَّهِ الَّذِي جَعَلَ الدِّينَ قِوَامًا وَجَعَلَ أَبَا هُرَيْرَةَ إِمَامًا ."
      },
      {
        "id": 26800,
        "hadith_number": "2446",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kisah Ali Membantu Rasulullah (ﷺ) dengan Berkerja",
        "perawi_melayu": "Ibn 'Abbas",
        "english_text": "It was narrated that Ibn 'Abbas said: “The Prophet (ﷺ) was in need of food, and news of that reached 'Ali. He went out seeking work so that he could earn something to give to the Messenger of Allah (ﷺ). He came to a garden belonging to a Jewish man, and he drew seventeen buckets of water for him, each bucket for a date. The Jew gave him the option to take seventeen of his 'Ajwah dates (a high quality of dates) and he brought them to the Prophet of Allah (ﷺ).”",
        "malay_translation": "Diriwayatkan daripada Ibn 'Abbas bahawa beliau berkata: \"Nabi (ﷺ) memerlukan makanan, dan berita itu sampai kepada 'Ali. Beliau keluar mencari kerja supaya beliau dapat memperoleh sesuatu untuk diberikan kepada Rasulullah (ﷺ). Beliau pergi ke sebuah kebun kepunyaan seorang lelaki Yahudi, dan beliau menarik tujuh belas timba air untuknya, setiap timba dengan sebiji kurma. Orang Yahudi itu memberikan pilihan kepadanya untuk mengambil tujuh belas biji kurma 'Ajwah (kurma berkualiti tinggi) miliknya dan beliau membawanya kepada Nabi Allah (ﷺ).\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ، ‏‏‏‏‏‏حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ حَنَشٍ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنِابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَصَابَ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَصَاصَةٌ فَبَلَغَ ذَلِكَ عَلِيًّا فَخَرَجَ يَلْتَمِسُ عَمَلًا يُصِيبُ فِيهِ شَيْئًا لِيُغِيثَ بِهِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَأَتَى بُسْتَانًا لِرَجُلٍ مِنَ الْيَهُودِ، ‏‏‏‏‏‏فَاسْتَقَى لَهُ سَبْعَةَ عَشَرَ دَلْوًا كُلُّ دَلْوٍ بِتَمْرَةٍ فَخَيَّرَهُ الْيَهُودِيُّ مِنْ تَمْرِهِ سَبْعَ عَشَرَةَ عَجْوَةً فَجَاءَ بِهَا إِلَى نَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 26801,
        "hadith_number": "2447",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Ali (RA) Bekerja Mengeluarkan Air Demi Kurma Berkualiti",
        "perawi_melayu": "Ali (RA)",
        "english_text": "It was narrated that 'Ali said: “I used to draw water, one bucket for a date, and I stipulated that they should be good quality, dried dates.”",
        "malay_translation": "Diriwayatkan bahawa 'Ali berkata: “Aku dahulu menarik air, satu timba untuk satu biji kurma, dan aku menetapkan syarat bahawa kurma itu haruslah berkualiti baik, kurma kering.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّحْمَنِ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنْ أَبِي حَيَّةَ، ‏‏‏‏‏‏عَنْ عَلِيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنْتُ أَدْلُو الدَّلْوَ بِتَمْرَةٍ وَأَشْتَرِطُ أَنَّهَا جَلْدَةٌ ."
      },
      {
        "id": 26802,
        "hadith_number": "2448",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kisah Seorang Ansar dan Nabi (ﷺ) dalam Keadaan Kelaparan",
        "perawi_melayu": "Abu Hurairah (رَضِيَ اللَّهُ عَنْهُ)",
        "english_text": "It was narrated that Abu Hurairah said: “A man from among the Ansar Came and said: 'O Messenger of Allah (ﷺ), why do I see that your color has changed?' He said: 'Hunger.' So the Ansari went to his dwelling, but he did not find anything in his dwelling, so he went out looking, and he found a Jew watering his date-palm trees. The Ansari stipulated that he would not take any dates that were black (rotten), hard and dried out or inferior, and he would only take good quality dates. He earned nearly two Sa's (of dates), and he brought it to the Prophet (ﷺ).”",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah رَضِيَ اللَّهُ عَنْهُ, bahawa seorang lelaki daripada kalangan Ansar datang dan berkata: “Wahai Rasulullah (ﷺ), mengapakah aku melihat warna kulitmu berubah?” Baginda menjawab: “Kerana kelaparan.” Lalu, lelaki Ansar itu pun pergi ke rumahnya, tetapi dia tidak menjumpai apa-apa di rumahnya. Kemudian, dia keluar mencari rezeki dan menjumpai seorang Yahudi sedang menyiram pokok kurma. Lelaki Ansar itu meminta izin daripada Yahudi untuk membantunya menyiram pokok kurma dengan syarat dia hanya akan mengambil kurma yang berkualiti baik, bukan kurma yang hitam (busuk), keras dan kering, atau yang kurang baik. Dia mendapat hampir dua Sa' (kurma), lalu dia membawanya kepada Nabi (ﷺ).",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ الْمُنْذِرِ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ جَاءَ رَجُلٌ مِنَ الْأَنْصَارِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ مَا لِي أَرَى لَوْنَكَ مُنْكَفِئًا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ الْخَمْصُ فَانْطَلَقَ الْأَنْصَارِيُّ إِلَى رَحْلِهِ فَلَمْ يَجِدْ فِي رَحْلِهِ شَيْئًا فَخَرَجَ يَطْلُبُ فَإِذَا هُوَ بِيَهُودِيٍّ يَسْقِي نَخْلًا، ‏‏‏‏‏‏فَقَالَ الْأَنْصَارِيُّ لِلْيَهُودِيِّ:‏‏‏‏ أَسْقِي نَخْلَكَ؟ قَالَ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُلُّ دَلْوٍ بِتَمْرَةٍ. وَاشْتَرَطَ الْأَنْصَارِيُّ أَنْ لَا يَأْخُذَ خَدِرَةً وَلَا تَارِزَةً وَلَا حَشَفَةً، ‏‏‏‏‏‏وَلَا يَأْخُذَ إِلَّا جَلْدَةً، ‏‏‏‏‏‏فَاسْتَقَى بِنَحْوٍ مِنْ صَاعَيْنِ، ‏‏‏‏‏‏فَجَاءَ بِهِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 26803,
        "hadith_number": "2449",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Muhaqalah dan Muzabanah",
        "perawi_melayu": "Rafi 'bin Khadji (Semoga Allah meredhainya)",
        "english_text": "It was narrated that Rafi 'bin Khadji said: “The Messenger of Allah (ﷺ) forbade Muhaqalah and Muzabanah, and said: 'Only three may cultivate: A man who has land which he cultivates a man who was given some land and cultivates what he was given; and a man who takes land on lease for gold or silver.' ”",
        "malay_translation": "Diriwayatkan bahawa Rafi' bin Khadji berkata: \"Rasulullah (ﷺ) melarang Muhaqalah dan Muzabanah, dan bersabda: 'Hanya tiga golongan yang boleh bercucuk tanam: Seorang lelaki yang mempunyai tanah dan dia bercucuk tanam di atasnya, seorang lelaki yang diberi tanah dan bercucuk tanam apa yang diberikan kepadanya; dan seorang lelaki yang menyewa tanah dengan emas atau perak.'\"",
        "arabic_text": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو الْأَحْوَصِ، ‏‏‏‏‏‏عَنْ طَارِقِ بْنِ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، ‏‏‏‏‏‏عَنْ رَافِعِ بْنِ خَدِيجٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ إِنَّمَا يَزْرَعُ ثَلَاثَةٌ رَجُلٌ لَهُ أَرْضٌ فَهُوَ يَزْرَعُهَا وَرَجُلٌ مُنِحَ أَرْضًا فَهُوَ يَزْرَعُ مَا مُنِحَ وَرَجُلٌ اسْتَكْرَى أَرْضًا بِذَهَبٍ أَوْ فِضَّةٍ ."
      },
      {
        "id": 26804,
        "hadith_number": "2450",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Rasulullah ﷺ Terhadap Amalan Berkongsi Tanah untuk Penanaman",
        "perawi_melayu": "Telah diriwayatkan bahawa 'Amr bin Dinar berkata: “Saya mendengar Ibn 'Umar berkata: 'Kami pernah meminjamkan tanah untuk penanaman dengan balasan perkongsian hasil tanaman, dan kami tidak melihat sebarang kesalahan dalam hal itu, sehinggalah kami mendengar Rafi' bin Khadij berkata: “Rasulullah ﷺ melarangnya.” Kemudian kami berhenti kerana apa yang beliau katakan.' ”",
        "english_text": "It was narrated that 'Amr bin Dinar said: “I heard Ibn 'Umar say: 'We used to lend land for cultivation in return for a share of the harvest, and we did not see anything wrong with that, until we heard Rafi' bin Khadij say: “The Messenger of Allah (ﷺ) forbade it.” Then we stopped because of what he said.' ”",
        "malay_translation": "Diriwayatkan daripada 'Amr bin Dinar, beliau berkata: “Saya mendengar Ibn 'Umar berkata: 'Kami pernah meminjamkan tanah untuk penanaman dengan balasan perkongsian hasil tanaman, dan kami tidak melihat sebarang kesalahan dalam hal itu, sehinggalah kami mendengar Rafi' bin Khadij berkata: “Rasulullah ﷺ melarangnya.” Kemudian kami berhenti kerana apa yang beliau katakan.' ”",
        "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ الصَّبَّاحِ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ دِينَارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُابْنَ عُمَرَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ كُنَّا نُخَابِرُ وَلَا نَرَى بِذَلِكَ بَأْسًا حَتَّى سَمِعْنَا رَافِعَ بْنَ خَدِيجٍ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْهُ فَتَرَكْنَاهُ لِقَوْلِهِ ."
      },
      {
        "id": 26805,
        "hadith_number": "2451",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Anjuran Mengusahakan Tanah Sendiri atau Memberikannya kepada Saudara",
        "perawi_melayu": "Jabir bin Abdullah (Semoga Allah meredhai mereka)",
        "english_text": "Ata' said: “I heard Jabir bin 'Abdullah say: Some men among us had extra land which they would rent out for one third or one quarter (of the crop). The Prophet (ﷺ) said: “Whoever has extra land, let him cultivate it (himself) or let him give it to his brother (for free, to cultivate it), and if he does not want to do that, let him keep his land.”",
        "malay_translation": "Ata' berkata: \"Saya mendengar Jabir bin 'Abdullah berkata: Beberapa orang lelaki di kalangan kami mempunyai lebihan tanah yang mereka sewakan dengan bayaran satu pertiga atau satu perempat (hasil tanaman). Nabi (ﷺ) bersabda: \"Sesiapa yang mempunyai lebihan tanah, hendaklah dia mengusahakannya sendiri atau memberikannya kepada saudaranya (secara percuma, untuk diusahakan), dan jika dia tidak mahu berbuat demikian, hendaklah dia menyimpan tanahnya.\" ",
        "arabic_text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، ‏‏‏‏‏‏حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، ‏‏‏‏‏‏حَدَّثَنَا الْأَوْزَاعِيُّ، ‏‏‏‏‏‏حَدَّثَنِي عَطَاءٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُجَابِرَ بْنَ عَبْدِ اللَّهِ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ كَانَتْ لِرِجَالٍ مِنَّا فُضُولُ أَرَضِينَ يُؤَاجِرُونَهَا عَلَى الثُّلُثِ وَالرُّبُعِ، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ كَانَتْ لَهُ فُضُولُ أَرْضِينَ فَلْيَزْرَعْهَا أَوْ لِيُزْرِعْهَا أَخَاهُ فَإِنْ أَبَى فَلْيُمْسِكْ أَرْضَهُ ."
      },
      {
        "id": 26806,
        "hadith_number": "2452",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Galakkan Mengusahakan Tanah atau Memberikannya",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: “Whoever has land, let him cultivate it (himself) or let him give it to his brother (for free, to cultivate it), and if he does not want to do that, let him keep his land.”",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah رضي الله عنه bahawa Rasulullah ﷺ bersabda: “Sesiapa yang mempunyai tanah, hendaklah dia mengusahakannya (sendiri) atau memberikannya kepada saudaranya (secara percuma, untuk diusahakan), dan jika dia tidak mahu berbuat demikian, biarlah dia menyimpan tanahnya.”",
        "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو تَوْبَةَ الرَّبِيعُ بْنُ نَافِعٍ، ‏‏‏‏‏‏حَدَّثَنَا مُعَاوِيَةُ بْنُ سَلَّامٍ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ لِيَمْنَحْهَا أَخَاهُ فَإِنْ أَبَى فَلْيُمْسِكْ أَرْضَهُ."
      },
      {
        "id": 26807,
        "hadith_number": "2453",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Menyewakan Tanah untuk Pertanian",
        "perawi_melayu": "Ibn 'Umar",
        "english_text": "It was narrated from Ibn 'Umar that: he used to lease out some land that belonged to him, for cultivation. Then someone came to him and told him that Rafi' bin Khadij said that the Messenger of Allah (ﷺ) had forbidden leasing out land for cultivation. Ibn 'Umar went, and I went with him, until he met him in Balat, and asked him about that, and he told him that the Messenger of Allah (ﷺ) had forbidden leasing out land for cultivation. So 'Abdullah stopped lessening out land.",
        "malay_translation": "Diriwayatkan daripada Ibn 'Umar bahawa: beliau pernah menyewakan sebidang tanah miliknya untuk tujuan pertanian. Kemudian seseorang datang kepadanya dan memberitahunya bahawa Rafi' bin Khadij berkata bahawa Rasulullah (ﷺ) telah melarang menyewakan tanah untuk pertanian. Ibn 'Umar pergi, dan saya pergi bersamanya, sehingga beliau bertemu dengannya di Balat, dan bertanya kepadanya tentang perkara itu, dan dia memberitahunya bahawa Rasulullah (ﷺ) telah melarang menyewakan tanah untuk pertanian. Maka 'Abdullah berhenti menyewakan tanah.",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏ وَأَبُو أُسَامَةَ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ عُبَيْدٍ، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ أَوْ قَالَ عَبْدِ اللَّهِ بْنِ عُمَرَ:‏‏‏‏ عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏أَنَّهُ كَانَ يُكْرِي أَرْضًا لَهُ مَزَارِعًا فَأَتَاهُ إِنْسَانٌ فَأَخْبَرَهُ، ‏‏‏‏‏‏عَنْ رَافِعِ بْنِ خَدِيجٍ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ نَهَى عَنْ كِرَاءِ الْمَزَارِعِ ، ‏‏‏‏‏‏فَذَهَبَ ابْنُ عُمَرَ وَذَهَبْتُ مَعَهُ حَتَّى أَتَاهُ بِالْبَلَاطِ فَسَأَلَهُ عَنْ ذَلِكَ، ‏‏‏‏‏‏فَأَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ نَهَى عَنْ كِرَاءِ الْمَزَارِعِ فَتَرَكَ عَبْدُ اللَّهِ كِرَاءَهَا."
      },
      {
        "id": 26808,
        "hadith_number": "2454",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Perintah Rasulullah (ﷺ) tentang Mengusahakan Tanah",
        "perawi_melayu": "Jabir bin 'Abdullah (Semoga Allah meredhainya)",
        "english_text": "It was narrated that Jabir bin 'Abdullah said: “The Messenger of Allah (ﷺ) addressed us and said: 'Whoever has land, let him cultivate it or allow someone else to cultivate it, and not rent it out.' ”",
        "malay_translation": "Diriwayatkan daripada Jabir bin 'Abdullah, beliau berkata: “Rasulullah (ﷺ) telah berkhutbah kepada kami, baginda bersabda: 'Sesiapa yang mempunyai tanah, maka hendaklah dia mengusahakannya atau membenarkan orang lain mengusahakannya, dan janganlah dia menyewakannya.' ”",
        "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ، ‏‏‏‏‏‏حَدَّثَنَا ضَمْرَةُ بْنُ رَبِيعَةَ، ‏‏‏‏‏‏عَنْ ابْنِ شَوْذَبٍ، ‏‏‏‏‏‏عَنْمَطَرٍ، ‏‏‏‏‏‏عَنْ عَطَاءٍ، ‏‏‏‏‏‏عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ:‏‏‏‏ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ لِيُزْرِعْهَا وَلَا يُؤَاجِرْهَا ."
      },
      {
        "id": 26809,
        "hadith_number": "2455",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Muhaqlah (Menyewakan Tanah)",
        "perawi_melayu": "Abu Sufyan, hamba yang dimerdekakan oleh Ibn Abu Ahmad, meriwayatkan bahawa dia mendengar Abu Sa'eed Al-Khudri berkata:",
        "english_text": "It was narrated from Abu Sufyan, the freed slave of Ibn Abu Ahmad, that he told him that he heard Abu Sa'eed Al-Khudri say: “The Messenger of Allah (ﷺ) forbade Muhaqlah.” (Sahih)Muhaqlah means leasing out land",
        "malay_translation": "Diriwayatkan daripada Abu Sufyan, hamba yang dimerdekakan oleh Ibn Abu Ahmad, bahawa dia memberitahu bahawa dia mendengar Abu Sa'eed Al-Khudri berkata: “Rasulullah (ﷺ) melarang Muhaqlah.” (Sahih) Muhaqlah bermaksud menyewakan tanah.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا مُطَرِّفُ بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏حَدَّثَنَا مَالِكٌ، ‏‏‏‏‏‏عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، ‏‏‏‏‏‏عَنْ أَبِي سُفْيَانَ مَوْلَى ابْنِ أَبِي أَحْمَدَ أَنَّهُ أَخْبَرَهُ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْمُحَاقَلَةِ وَالْمُحَاقَلَةُ اسْتِكْرَاءُ الْأَرْضِ ."
      },
      {
        "id": 26810,
        "hadith_number": "2456",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Menyewakan Tanah: Nasihat Rasulullah (ﷺ)",
        "perawi_melayu": "Daripada Ibnu Abbas r.a.",
        "english_text": "It was narrated from Ibn 'Abbas that he heard that people were leasing out land more. He said: “Subhan-Allah, the Messenger of Allah (ﷺ) said: 'Why does not one of you lend it to his brother?' But he did not forbid leasing it out.' ”",
        "malay_translation": "Diriwayatkan daripada Ibnu Abbas r.a., bahawa dia mendengar orang ramai semakin menyewakan tanah. Beliau berkata: “Subhan-Allah, Rasulullah (ﷺ) bersabda: 'Mengapa tidak salah seorang daripada kamu meminjamkannya kepada saudaranya?' Tetapi Baginda tidak melarang menyewakannya.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، ‏‏‏‏‏‏أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، ‏‏‏‏‏‏عَنْ عَبْدِ الْمَلِكِ بْنِ عَبْدِ الْعَزِيزِ بْنِ جُرَيْجٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ دِينَارٍ، ‏‏‏‏‏‏عَنْ طَاوُسٍ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏أَنَّهُ لَمَّا سَمِعَ إِكْثَارَ النَّاسِ فِي كِرَاءِ الْأَرْضِ قَالَ:‏‏‏‏ سُبْحَانَ اللَّهِ، ‏‏‏‏‏‏إِنَّمَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَلَا مَنَحَهَا أَحَدُكُمْ أَخَاهُ وَلَمْ يَنْهَ عَنْ كِرَائِهَا ."
      },
      {
        "id": 26811,
        "hadith_number": "2457",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Keutamaan Memberi Pinjam Tanah",
        "perawi_melayu": "Daripada Ibn 'Abbas",
        "english_text": "It was narrated from Ibn 'Abbas that the Messenger of Allah (ﷺ) said: “If one of you were to lend his brother his land, it would be better for him than taking such and such rent for it.”",
        "malay_translation": "Diriwayatkan daripada Ibn 'Abbas bahawa Rasulullah ﷺ bersabda: \"Sekiranya seseorang daripada kamu meminjamkan tanahnya kepada saudaranya, itu adalah lebih baik baginya daripada mengambil sewa tertentu untuknya.\"",
        "arabic_text": "حَدَّثَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَنْبَأَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنْ ابْنِ طَاوُسٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَأَنْ يَمْنَحَ أَحَدُكُمْ أَخَاهُ أَرْضَهُ خَيْرٌ لَهُ مِنْ أَنْ يَأْخُذَ عَلَيْهَا كَذَا وَكَذَا لِشَيْءٍ مَعْلُومٍ. قَالَ ابْنُ عَبَّاسٍ:‏‏‏‏ هُوَ الْحَقْلُ وَهُوَ بِلِسَانِ الْأَنْصَارِ الْمُحَاقَلَةُ"
      },
      {
        "id": 26812,
        "hadith_number": "2458",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukum Menyewa Tanah: Larangan Perkongsian Hasil, Kebenaran Sewa dengan Wang",
        "perawi_melayu": "Hazalah bin Qais (radiallahu 'anhu)",
        "english_text": "It was narrated that Hazalah bin Qais said: “I asked Rafi' bin Khadij and he said: 'We used to lease out land on the basis that you would have what is produced by this piece of land, and I would have what is produced by this (other) piece of land, and we were forbidden to lease it out on the basis of crop-sharing but he did not forbid us to rent out land for silver.”",
        "malay_translation": "Diriwayatkan bahawa Hazalah bin Qais berkata: “Aku bertanya kepada Rafi' bin Khadij, dan dia berkata: 'Kami pernah menyewakan tanah dengan syarat kamu mendapat hasil daripada sebidang tanah ini, dan aku mendapat hasil daripada (sebidang) tanah yang lain, dan kami dilarang menyewakan tanah berdasarkan perkongsian hasil tanaman, tetapi dia tidak melarang kami menyewakan tanah dengan (bayaran) wang perak (silver)'.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ حَنْظَلَةَ بْنِ قَيْسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَأَلْتُ رَافِعَ بْنَ خَدِيجٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنَّا نُكْرِي الْأَرْضَ عَلَى أَنَّ لَكَ مَا أَخْرَجَتْ هَذِهِ وَلِي مَا أَخْرَجَتْ هَذِهِ فَنُهِينَا أَنْ نُكْرِيَهَا بِمَا أَخْرَجَتْ وَلَمْ نُنْهَ أَنْ نُكْرِيَ الْأَرْضَ بِالْوَرِقِ ."
      },
      {
        "id": 26813,
        "hadith_number": "2459",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Menyewa Tanah Pertanian",
        "perawi_melayu": "Rafi' bin Khadi'j",
        "english_text": "Rafi'bin Khadi'j narrated that his paternal uncle Zuhair said: “The Messenger of Allah (ﷺ) forbade us from doing something that was convenient for us.” I said: “What the Messenger of Allah (ﷺ) said is true.” He said that the Messenger of Allah (ﷺ) said: “What do you with your farms?” We said: “We rent them out for one third or one quarter of their yield, and a certain amount of wheat and barley.” He said: “Do not do that; cultivate them or let others cultivate them.”",
        "malay_translation": "Rafi' bin Khadi'j meriwayatkan bahawa bapa saudaranya, Zuhair berkata: \"Rasulullah (ﷺ) melarang kami daripada melakukan sesuatu yang memudahkan kami.\" Saya berkata: \"Apa yang Rasulullah (ﷺ) katakan adalah benar.\" Dia berkata bahawa Rasulullah (ﷺ) bersabda: \"Apakah yang kamu lakukan dengan ladang-ladang kamu?\" Kami berkata: \"Kami menyewakannya dengan satu pertiga atau satu perempat daripada hasil tanaman mereka, dan sejumlah gandum dan barli.\" Baginda bersabda: \"Jangan lakukan itu; tanamlah mereka atau biarkan orang lain menanamnya.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، ‏‏‏‏‏‏حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، ‏‏‏‏‏‏حَدَّثَنَا الْأَوْزَاعِيُّ، ‏‏‏‏‏‏حَدَّثَنِي أَبُو النَّجَاشِيِّ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ رَافِعَ بْنَ خَدِيجٍ يُحَدِّثُ، ‏‏‏‏‏‏عَنْ عَمِّهِ ظُهَيْرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ نَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَمْرٍ كَانَ لَنَا رَافِقًا، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ مَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهُوَ حَقٌّ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَا تَصْنَعُونَ بِمَحَاقِلِكُمْ ، ‏‏‏‏‏‏قُلْنَا نُؤَاجِرُهَا عَلَى الثُّلُثِ وَالرُّبُعِ وَالْأَوْسُقِ مِنَ الْبُرِّ وَالشَّعِيرِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ فَلَا تَفْعَلُوا ازْرَعُوهَا أَوْ أَزْرِعُوهَا ."
      },
      {
        "id": 26814,
        "hadith_number": "2460",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Rasulullah (ﷺ) Terhadap Amalan Berkongsi Tanah yang Memudaratkan",
        "perawi_melayu": "Usaid bin Zuhair, anak saudara lelaki kepada Rafi' bin Khdij",
        "english_text": "It was narrated from Usaid bin Zuhair, the paternal nephew of Rafi' bin Khdij, that Rafi' bin Khadij said: “If one of us did not need his land, he would give it (to someone else to cultivate) in return for one third, or one half of the yield , and he would stipulate (that the should receive) the produce grows on the banks of three streams, and the grains that remain in the ear after threshing, and the produce irrigated by a stream. Life at that time was hard, and he would work (the land) with iron and whatever Allah (SWT) willed, and he would benefit from it. Then Rafi bin Khadij came to us and said: ‘The Messenger of Allah (ﷺ) forbade you to do something that may seem beneficial to you, but obedience to Allah and obedience to His Messenger are more beneficial for you. The Messenger of Allah (ﷺ) forbade Haq for you, and he said: “Whoever has no need of his land, let him give it to his brother (to cultivate) or let him leave it (uncultivated).”",
        "malay_translation": "Diriwayatkan daripada Usaid bin Zuhair, anak saudara lelaki kepada Rafi' bin Khadij, bahawa Rafi' bin Khadij berkata: \"Apabila seseorang daripada kami tidak memerlukan tanahnya, dia akan memberikannya (kepada orang lain untuk diusahakan) dengan balasan satu pertiga, atau separuh daripada hasil, dan dia akan menetapkan (bahawa dia akan menerima) hasil yang tumbuh di tebing tiga sungai, dan bijirin yang tinggal dalam tangkai selepas mengirik, dan hasil yang diairi oleh sungai. Kehidupan pada masa itu adalah sukar, dan dia akan mengusahakan (tanah) dengan besi dan apa sahaja yang Allah (SWT) kehendaki, dan dia akan mendapat manfaat daripadanya. Kemudian Rafi' bin Khadij datang kepada kami dan berkata: 'Rasulullah (ﷺ) melarang kamu daripada melakukan sesuatu yang mungkin kelihatan bermanfaat bagi kamu, tetapi mentaati Allah dan mentaati Rasul-Nya adalah lebih bermanfaat bagi kamu. Rasulullah (ﷺ) melarang amalan Haq bagi kamu, dan baginda bersabda: 'Sesiapa yang tidak memerlukan tanahnya, biarlah dia memberikannya kepada saudaranya (untuk diusahakan) atau biarlah dia membiarkannya (tidak diusahakan).'\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَنْبَأَنَا الثَّوْرِيُّ، ‏‏‏‏‏‏عَنْ مَنْصُورٍ، ‏‏‏‏‏‏عَنْ مُجَاهِدٍ، ‏‏‏‏‏‏عَنْ أُسَيْدِ بْنِ ظُهَيْرٍ ابْن أَخِي رَافِعِ بْنِ خَدِيجٍ، ‏‏‏‏‏‏عَنْ رَافِعِ بْنِ خَدِيجٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ أَحَدُنَا إِذَا اسْتَغْنَى عَنْ أَرْضِهِ أَعْطَاهَا بِالثُّلُثِ وَالرُّبُعِ وَالنِّصْفِ وَاشْتَرَطَ ثَلَاثَ جَدَاوِلَ وَالْقُصَارَةَ وَمَا يَسْقِي الرَّبِيعُ، ‏‏‏‏‏‏وَكَانَ الْعَيْشُ إِذْ ذَاكَ شَدِيدًا، ‏‏‏‏‏‏وَكَانَ يَعْمَلُ فِيهَا بِالْحَدِيدِ وَبِمَا شَاءَ اللَّهُ وَيُصِيبُ مِنْهَا مَنْفَعَةً فَأَتَانَا رَافِعُ بْنُ خَدِيجٍ فَقَالَ:‏‏‏‏ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَاكُمْ عَنْ أَمْرٍ كَانَ لَكُمْ نَافِعًا، ‏‏‏‏‏‏وَطَاعَةُ اللَّهِ وَطَاعَةُ رَسُولِهِ أَنْفَعُ لَكُمْ، ‏‏‏‏‏‏إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَنْهَاكُمْ عَنِ الْحَقْلِ وَيَقُولُ:‏‏‏‏ مَنِ اسْتَغْنَى عَنْ أَرْضِهِ فَلْيَمْنَحْهَا أَخَاهُ أَوْ لِيَدَعْ ."
      },
      {
        "id": 26815,
        "hadith_number": "2461",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Zaid bin Thabit: Larangan Menyewa Ladang bagi Mereka yang Bertelingkah",
        "perawi_melayu": "Zaid bin Thabit",
        "english_text": "Zaid bin Thabit said: “May Allah (SWT) forgive Rafi' bin Khadij. By Allah (SWT)! I have more knowledge of Ahadith than he does. Two men who had quarreled came to the Prophet (ﷺ) and he said: 'If this is your situation, do not lease farms,' and what Rafi' bin khadij heard was 'Do not lease farms.' ”",
        "malay_translation": "Zaid bin Thabit berkata: “Semoga Allah (SWT) mengampuni Rafi' bin Khadij. Demi Allah (SWT)! Saya lebih mengetahui tentang Hadith daripada dia. Dua orang lelaki yang bertelingkah datang kepada Nabi (ﷺ) dan baginda bersabda: 'Jika ini keadaan kamu, janganlah menyewa ladang,' dan apa yang Rafi' bin Khadij dengar ialah 'Janganlah menyewa ladang.' ”",
        "arabic_text": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، ‏‏‏‏‏‏حَدَّثَنَا إِسْمَاعِيل ابْنُ عُلَيَّةَ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَاق، ‏‏‏‏‏‏حَدَّثَنِي أَبُو عُبَيْدَةَ بْنُ مُحَمَّدِ بْنِ عَمَّارِ بْنِ يَاسِرٍ، ‏‏‏‏‏‏عَنِ الْوَلِيدِ بْنِ أَبِي الْوَلِيدِ، ‏‏‏‏‏‏عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ زَيْدُ بْنُ ثَابِتٍ:‏‏‏‏ يَغْفِرُ اللَّهُ لِرَافِعِ بْنِ خَدِيجٍ، ‏‏‏‏‏‏أَنَا، ‏‏‏‏‏‏وَاللَّهِ!، ‏‏‏‏‏‏أَعْلَمُ بِالْحَدِيثِ مِنْهُ. إِنَّمَا أَتَى رَجُلَانِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدِ اقْتَتَلَا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنْ كَانَ هَذَا شَأْنُكُمْ فَلَا تُكْرُوا الْمَزَارِعَ ، ‏‏‏‏‏‏فَسَمِعَ رَافِعُ بْنُ خَدِيجٍ قَوْلَهُ:‏‏‏‏ فَلَا تُكْرُوا الْمَزَارِعَ ."
      },
      {
        "id": 26816,
        "hadith_number": "2462",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Keutamaan Memberi Tanah Daripada Menyewakannya",
        "perawi_melayu": "Amr bin Dinar",
        "english_text": "It was narrated that 'Amr bin Dinar said: I said to Tawus: “O Abu 'Abdur-Rahman, why do you not give up this Mukhabarah because they claim that the Messenger of Allah (ﷺ) forbade it.” He said: “O 'Amr, I help them by taking their land and cultivating it, and giving them something in return, and Mu`adh bin Jabal allowed people here to do that. The most knowledgeable of them - meaning Ibn`Abbas - told me that the Messenger of Allah (ﷺ) did not forbid it, rather he said: 'For one you to give (land) to his brother is better than if he were to take a set amount in rent for it.’”",
        "malay_translation": "Diriwayatkan bahawa 'Amr bin Dinar berkata: Saya berkata kepada Tawus: “Wahai Abu 'Abdur-Rahman, mengapa kamu tidak meninggalkan Mukhabarah ini kerana mereka mendakwa bahawa Rasulullah (ﷺ) melarangnya.” Dia berkata: “Wahai 'Amr, saya membantu mereka dengan mengambil tanah mereka dan mengusahakannya, dan memberi mereka sesuatu sebagai balasan, dan Mu`adh bin Jabal membenarkan orang ramai di sini melakukan itu. Orang yang paling berilmu di kalangan mereka - iaitu Ibn 'Abbas - memberitahu saya bahawa Rasulullah (ﷺ) tidak melarangnya, tetapi baginda bersabda: 'Untuk kamu memberi (tanah) kepada saudaramu adalah lebih baik daripada jika dia mengambil sejumlah wang sewa untuknya.’”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، ‏‏‏‏‏‏أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ دِينَارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ لِطَاوُسٍ:‏‏‏‏ يَا أَبَا عَبْدِ الرَّحْمَنِ لَوْ تَرَكْتَ هَذِهِ الْمُخَابَرَةَ فَإِنَّهُمْ يَزْعُمُونَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَيْ عَمْرُو إِنِّي أُعِينُهُمْ وَأُعْطِيهِمْ وَإِنَّ مُعَاذَ بْنَ جَبَلٍ أَخَذَ النَّاسَ عَلَيْهَا عِنْدَنَا، ‏‏‏‏‏‏وَإِنَّ أَعْلَمَهُمْ يَعْنِي ابْنَ عَبَّاسٍ أَخْبَرَنِي، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَنْهَ عَنْهَا وَلَكِنْ قَالَ:‏‏‏‏ لَأَنْ يَمْنَحَ أَحَدُكُمْ أَخَاهُ خَيْرٌ لَهُ مِنْ أَنْ يَأْخُذَ عَلَيْهَا أَجْرًا مَعْلُومًا ."
      },
      {
        "id": 26817,
        "hadith_number": "2463",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Mu`adh bin Jabal Menyewa Tanah",
        "perawi_melayu": "Tawus (Riwayat daripada)",
        "english_text": "It was narrated from Tawus that : Mu`adh bin Jabl leased some land during the time of the Messenger of Allah (ﷺ), Abu Bakr, 'Umar and 'Uthmah, in return for one third or one fourth (of the yield), and he was still doing that until this day of yours.",
        "malay_translation": "Diriwayatkan daripada Tawus bahawa: Mu`adh bin Jabal menyewakan sebidang tanah pada zaman Rasulullah (ﷺ), Abu Bakr, 'Umar dan 'Uthman, sebagai balasan satu pertiga atau satu perempat (daripada hasil), dan beliau masih berbuat demikian sehingga ke hari ini.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ ثَابِتٍ الْجَحْدَرِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْوَهَّابِ، ‏‏‏‏‏‏عَنْ خَالِدٍ، ‏‏‏‏‏‏عَنْ مُجَاهِدٍ، ‏‏‏‏‏‏عَنْ طَاوُسٍ، ‏‏‏‏‏‏أَنَّ مُعَاذَ بْنَ جَبَلٍأَكْرَى الْأَرْضَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَعُمَرَ وَعُثْمَانَ عَلَى الثُّلُثِ وَالرُّبُعِ فَهُوَ يُعْمَلُ بِهِ إِلَى يَوْمِكَ هَذَا."
      },
      {
        "id": 26818,
        "hadith_number": "2464",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Memberi Tanah kepada Saudara Lebih Baik Daripada Menerima Sewa",
        "perawi_melayu": "Telah diriwayatkan daripada Tawus bahawa Ibn `Abbas berkata",
        "english_text": "It was narrated from Tawus that Ibn`Abbas told that the Messenger of Allah (ﷺ) merely said: “For one of you to give (land) to his brother is better for him than if he were to take a set amount in rent for it.”",
        "malay_translation": "Diriwayatkan daripada Tawus bahawa Ibn`Abbas berkata bahawa Rasulullah (ﷺ) bersabda: \"Seseorang daripada kamu memberi (tanah) kepada saudaranya adalah lebih baik baginya daripada dia mengambil sejumlah tertentu sebagai sewa daripadanya.\"",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ، ‏‏‏‏‏‏ وَمُحَمَّدُ بْنُ إِسْمَاعِيل، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ دِينَارٍ، ‏‏‏‏‏‏عَنْ طَاوُسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ ابْنُ عَبَّاسٍ:‏‏‏‏ إِنَّمَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَأَنْ يَمْنَحَ أَحَدُكُمْ أَخَاهُ الْأَرْضَ خَيْرٌ لَهُ مِنْ أَنْ يَأْخُذَ خَرَاجًا مَعْلُومًا ."
      },
      {
        "id": 26819,
        "hadith_number": "2465",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Menyewakan Tanah dengan Makanan Tertentu",
        "perawi_melayu": "Rafi` bin Khadij (RA)",
        "english_text": "It was narrated that Rafi` bin khadij said: We used to give land in return for food at the time of the Messenger of Allah (ﷺ), and some of my paternal uncles came to them and said: “The Messenger of Allah (ﷺ) said: 'Whoever has land, he should not rent it out for a set amount of food.”",
        "malay_translation": "Diriwayatkan bahawa Rafi` bin Khadij berkata: Kami pernah memberikan tanah sebagai ganti makanan pada zaman Rasulullah (ﷺ). Beberapa bapa saudara sebelah bapa saya datang kepada mereka dan berkata: “Rasulullah (ﷺ) bersabda: 'Sesiapa yang mempunyai tanah, janganlah dia menyewakannya dengan jumlah makanan yang tertentu.”",
        "arabic_text": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، ‏‏‏‏‏‏حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، ‏‏‏‏‏‏حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، ‏‏‏‏‏‏عَنْ يَعْلَى بْنِ حَكِيمٍ، ‏‏‏‏‏‏عَنْسُلَيْمَانَ بْنِ يَسَارٍ، ‏‏‏‏‏‏عَنْ رَافِعِ بْنِ خَدِيجٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنَّا نُحَاقِلُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَزَعَمَ أَنَّ بَعْضَ عُمُومَتِهِ أَتَاهُمْ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ كَانَتْ لَهُ أَرْضٌ فَلَا يُكْرِيهَا بِطَعَامٍ مُسَمَّى ."
      },
      {
        "id": 26820,
        "hadith_number": "2466",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Menanam Tanaman di Tanah Orang Lain Tanpa Kebenaran",
        "perawi_melayu": "Rafi` bin Khadij",
        "english_text": "It was narrated that Rafi` bin Khadij said: “The Messenger of Allah (ﷺ) said: 'Whoever cultivates people`s land without their permission, he has no right to any produce, but he should be recompensed for his expenditure.' ”",
        "malay_translation": "Diriwayatkan bahawa Rafi` bin Khadij berkata: Rasulullah (ﷺ) bersabda: 'Sesiapa yang menanam tanaman di tanah orang lain tanpa kebenaran mereka, maka dia tidak berhak ke atas sebarang hasil tanaman, tetapi dia harus diberi ganti rugi atas perbelanjaannya.' ",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ زُرَارَةَ، ‏‏‏‏‏‏حَدَّثَنَا شَرِيكٌ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنْ عَطَاءٍ، ‏‏‏‏‏‏عَنْ رَافِعِ بْنِ خَدِيجٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ زَرَعَ فِي أَرْضِ قَوْمٍ بِغَيْرِ إِذْنِهِمْ فَلَيْسَ لَهُ مِنَ الزَّرْعِ شَيْءٌ وَتُرَدُّ عَلَيْهِ نَفَقَتُهُ ."
      },
      {
        "id": 26821,
        "hadith_number": "2467",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Perjanjian Rasulullah (ﷺ) dengan Penduduk Khaibar",
        "perawi_melayu": "Daripada Ibn `Umar",
        "english_text": "It was narrated from Ibn `Umar that : the Messenger of Allah (ﷺ) entered into a contract with the people of Khaibar for one half of the fruits or crops yielded.",
        "malay_translation": "Diriwayatkan daripada Ibn `Umar bahawa: Rasulullah (ﷺ) telah membuat perjanjian dengan penduduk Khaibar untuk mengambil separuh daripada buah-buahan atau hasil tanaman yang dikeluarkan.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، ‏‏‏‏‏‏ وَسَهْلُ بْنُ أَبِي سَهْلٍ، ‏‏‏‏‏‏ وإسحاق بن منصور، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، ‏‏‏‏‏‏عَنْعُبَيْدِ اللَّهِ بْنِ عُمَرَ، ‏‏‏‏‏‏عَنْ نَافِعٍ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ عَامَلَ أَهْلَ خَيْبَرَ بِالشَّطْرِ مِمَّا يَخْرُجُ مِنْ ثَمَرٍ أَوْ زَرْعٍ ."
      },
      {
        "id": 26822,
        "hadith_number": "2468",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Rasulullah (ﷺ) Memberi Khaibar kepada Penduduknya",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "It was narrated that Anas bin Malik said: “When the Messenger of Allah (ﷺ) gave Khaibar to its people in return of its palm trees and land.",
        "malay_translation": "Diriwayatkan daripada Anas bin Malik, beliau berkata: “Ketika Rasulullah (ﷺ) memberikan Khaibar kepada penduduknya sebagai ganti pokok kurma dan tanahnya.",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيل بْنُ تَوْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا هُشَيْمٌ، ‏‏‏‏‏‏عَنِ ابْنِ أَبِي لَيْلَى، ‏‏‏‏‏‏عَنِ الْحَكَمِ بْنِ عُتَيْبَةَ، ‏‏‏‏‏‏عَنْ مِقْسَمٍ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَعْطَى خَيْبَرَ أَهْلَهَا عَلَى النِّصْفِ نَخْلِهَا وَأَرْضِهَا ."
      },
      {
        "id": 26823,
        "hadith_number": "2469",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Khaibar Ditawan dan Pembahagian Hasil",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "It was narrated that Anas bin Malik said: “When the Messenger of Allah (ﷺ) conquered Khaibar, he gave it (to its people) in return for half (of its yield).\"",
        "malay_translation": "Diriwayatkan daripada Anas bin Malik bahawa beliau berkata: \"Ketika Rasulullah (ﷺ) menawan Khaibar, baginda memberikan (kepada penduduknya) sebagai balasan separuh (daripada hasilnya).\"",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ الْمُنْذِرِ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، ‏‏‏‏‏‏عَنْ مُسْلِمٍ الْأَعْوَرِ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَمَّا افْتَتَحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْبَرَ أَعْطَاهَا عَلَى النِّصْفِ ."
      },
      {
        "id": 26824,
        "hadith_number": "2470",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Pendapat Nabi (ﷺ) Mengenai Pendebungaan Kurma",
        "perawi_melayu": "Musa bin Talhah bin `Ubaidullah",
        "english_text": "It was narrated from Simak that the heard Musa bin Talhah bin `Ubaidullah narrating that his father said: “I passed by some palm trees with the Messenger of Allah (ﷺ) and he saw some people pollinating the trees. He said: 'What are these people doing?' They said: 'They are taking something from the male part (of the plant) and putting it in the female part.' He said: 'I do not think that this will do any good.' News of that reached them, so they stopped doing it, and their yield declined. News of that reached the Prophet (ﷺ) and he said: 'That was only my thought. If it will do any good, then do it. I am only a human being like you, and what I think may be right or wrong. But When I tell you: “Allah (SWT) says,” I will never tell lies about Allah (SWT).' ”",
        "malay_translation": "Diriwayatkan daripada Simak bahawa dia mendengar Musa bin Talhah bin `Ubaidullah meriwayatkan bahawa bapanya berkata: “Aku berjalan bersama Rasulullah (ﷺ) melalui beberapa pokok kurma dan baginda melihat beberapa orang sedang melakukan pendebungaan pada pokok-pokok tersebut. Baginda bertanya: 'Apakah yang sedang mereka lakukan?' Mereka menjawab: 'Mereka mengambil sesuatu daripada bahagian jantan (pokok) dan meletakkannya pada bahagian betina.' Baginda berkata: 'Aku tidak fikir perbuatan ini akan memberi sebarang kebaikan.' Berita itu sampai kepada mereka, lalu mereka berhenti melakukannya, dan hasil tuaian mereka merosot. Berita itu sampai kepada Nabi (ﷺ) dan baginda bersabda: 'Itu hanyalah sangkaanku. Jika ia memberi kebaikan, maka lakukanlah. Aku hanyalah seorang manusia seperti kamu, dan sangkaanku mungkin betul atau salah. Tetapi apabila aku berkata kepada kamu: “Allah (SWT) berfirman,” aku tidak akan pernah berdusta tentang Allah (SWT).' ”",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، ‏‏‏‏‏‏عَنْ إِسْرَائِيلَ، ‏‏‏‏‏‏عَنْ سِمَاكٍ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ مُوسَى بْنَ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ يُحَدِّثُ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَرَرْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَخْلٍ فَرَأَى قَوْمًا يُلَقِّحُونَ النَّخْلَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا يَصْنَعُ هَؤُلَاءِ؟، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ يَأْخُذُونَ مِنَ الذَّكَرِ فَيَجْعَلُونَهُ فِي الْأُنْثَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَا أَظُنُّ ذَلِكَ يُغْنِي شَيْئًا فَبَلَغَهُمْ، ‏‏‏‏‏‏فَتَرَكُوهُ فَنَزَلُوا عَنْهَا فَبَلَغَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنَّمَا هُوَ الظَّنُّ، ‏‏‏‏‏‏إِنْ كَانَ يُغْنِي شَيْئًا فَاصْنَعُوهُ فَإِنَّمَا أَنَا بَشَرٌ مِثْلُكُمْ وَإِنَّ الظَّنَّ يُخْطِئُ وَيُصِيبُ وَلَكِنْ مَا قُلْتُ لَكُمْ:‏‏‏‏ قَالَ اللَّهُ:‏‏‏‏ فَلَنْ أَكْذِبَ عَلَى اللَّهِ ."
      },
      {
        "id": 26825,
        "hadith_number": "2471",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Nasihat Nabi (ﷺ) tentang Pendebungaan Pokok Kurma",
        "perawi_melayu": "'Aisha (رَضِيَ اللَّهُ عَنْهَا)",
        "english_text": "It was narrated from 'Aisha that the Prophet (ﷺ) heard some sounds and said: “What is this noise?” They said: “Palm trees that are being pollinated.” He said: “If they did not do that it would be better.” So they did not pollinate them that year, and the dates did not mature properly. they mentioned that to the Prophet (ﷺ) and he said: “If it is one of the matters of your religion, then refer to me.”",
        "malay_translation": "Diriwayatkan dari 'Aisha (رَضِيَ اللَّهُ عَنْهَا) bahawa Nabi (ﷺ) mendengar beberapa bunyi dan bertanya: “Apakah bunyi ini?” Mereka menjawab: “Pokok kurma sedang didebungakan.” Baginda bersabda: “Jika mereka tidak melakukannya, itu lebih baik.” Maka mereka tidak melakukan pendebungaan pada tahun tersebut, dan buah kurma tidak masak dengan sempurna. Mereka menyebutkan hal itu kepada Nabi (ﷺ) dan baginda bersabda: “Jika ia adalah salah satu urusan agama kamu, maka rujuklah kepada aku.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا عَفَّانُ، ‏‏‏‏‏‏حَدَّثَنَا حَمَّادٌ، ‏‏‏‏‏‏حَدَّثَنَا ثَابِتٌ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏ وَهِشَامُ بْنُ عُرْوَةَ، ‏‏‏‏‏‏عَنْأَبِيهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعَ أَصْوَاتًا فَقَالَ:‏‏‏‏ مَا هَذَا الصَّوْتُ قَالُوا:‏‏‏‏ النَّخْلُ يُؤَبِّرُونَهَا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ لَوْ لَمْ يَفْعَلُوا لَصَلَحَ فَلَمْ يُؤَبِّرُوا عَامَئِذٍ فَصَارَ شِيصًا، ‏‏‏‏‏‏فَذَكَرُوا لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ:‏‏‏‏ إِنْ كَانَ شَيْئًا مِنْ أَمْرِ دُنْيَاكُمْ فَشَأْنُكُمْ بِهِ، ‏‏‏‏‏‏وَإِنْ كَانَ مِنْ أُمُورِ دِينِكُمْ فَإِلَيَّ ."
      },
      {
        "id": 26826,
        "hadith_number": "2472",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Muslimin Berkongsi dalam Tiga Perkara",
        "perawi_melayu": "Daripada Ibn 'Abbas رضي الله عنه",
        "english_text": "It was narrated from Ibn 'Abbas that the Messenger of Allah (ﷺ) said: “The Muslims are partners in three things: water, pasture and fire, and their price is unlawful.”",
        "malay_translation": "Diriwayatkan daripada Ibn 'Abbas رضي الله عنه bahawa Rasulullah ﷺ bersabda: “Orang Islam adalah rakan kongsi dalam tiga perkara: air, padang rumput dan api, dan harga mereka adalah haram.”",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ خِرَاشِ بْنِ حَوْشَبٍ الشَّيْبَانِيُّ، ‏‏‏‏‏‏عَنِ الْعَوَّامِ بْنِ حَوْشَبٍ، ‏‏‏‏‏‏عَنْ مُجَاهِدٍ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْمُسْلِمُونَ شُرَكَاءُ فِي ثَلَاثٍ:‏‏‏‏ فِي الْمَاءِ وَالْكَلَإِ وَالنَّارِ، ‏‏‏‏‏‏وَثَمَنُهُ حَرَامٌ ، ‏‏‏‏‏‏قَالَ أَبُو سَعِيدٍ:‏‏‏‏ يَعْنِي الْمَاءَ الْجَارِيَ."
      },
      {
        "id": 26827,
        "hadith_number": "2473",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Tiga Perkara yang Tidak Boleh Dihalang",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: “Three things cannot be denied to anyone: water, pasture and fire.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah رضي الله عنه bahawa Rasulullah (ﷺ) bersabda: “Tiga perkara tidak boleh dihalang daripada sesiapa: air, rumput dan api.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ أَبِي الزِّنَادِ، ‏‏‏‏‏‏عَنِ الْأَعْرَجِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ ثَلَاثٌ لَا يُمْنَعْنَ:‏‏‏‏ الْمَاءُ وَالْكَلَأُ وَالنَّارُ ."
      },
      {
        "id": 26828,
        "hadith_number": "2474",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kebaikan Memberi Air, Garam, dan Api",
        "perawi_melayu": "'Aishah (r.a)",
        "english_text": "It was narrated that 'Aishah said: “O Messenger of Allah (ﷺ), what are the things which are not permissible to withhold?” He said: “Water, salt and fire.” She said: “I said: 'O Messenger of Allah (ﷺ), we know what water is, but what about salt and fire?” He said: “O Humaira', whoever gives fire (to another), it is as if he has given in charity all the food that is cooked on that fire. And whoever gives salt, it is as if he has given in charity all that the salt makes good. And whoever gives a Muslim water to drink when water is available, it is as if he freed a slave; and whoever gives a Muslim water to drink when there is no water available, it is as if he brought him back to life.”",
        "malay_translation": "Diriwayatkan daripada 'Aishah رضي الله عنها, beliau berkata: “Wahai Rasulullah (ﷺ), apakah perkara yang tidak halal untuk ditahan?” Baginda bersabda: “Air, garam, dan api.” 'Aishah berkata: “Saya berkata: 'Wahai Rasulullah (ﷺ), kami tahu apakah air itu, tetapi bagaimana pula dengan garam dan api?” Baginda bersabda: “Wahai Humaira', sesiapa yang memberikan api (kepada orang lain), seolah-olah dia telah bersedekah dengan semua makanan yang dimasak dengan api tersebut. Dan sesiapa yang memberikan garam, seolah-olah dia telah bersedekah dengan semua yang diperbaiki oleh garam tersebut. Dan sesiapa yang memberi minum air kepada seorang Muslim ketika air itu ada, seolah-olah dia telah membebaskan seorang hamba; dan sesiapa yang memberi minum air kepada seorang Muslim ketika air tidak ada, seolah-olah dia telah menghidupkannya semula.”",
        "arabic_text": "حَدَّثَنَا عَمَّارُ بْنُ خَالِدٍ الْوَاسِطِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عَلِيُّ بْنُ غُرَابٍ، ‏‏‏‏‏‏عَنْ زُهَيْرِ بْنِ مَرْزُوقٍ، ‏‏‏‏‏‏عَنْ عَلِيِّ بْنِ زَيْدِ بْنِ جَدْعَانَ، ‏‏‏‏‏‏عَنْسَعِيدِ بْنِ الْمُسَيَّبِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏أَنَّهَا قَالَتْ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏مَا الشَّيْءُ الَّذِي لَا يَحِلُّ مَنْعُهُ؟ قَالَ:‏‏‏‏ الْمَاءُ وَالْمِلْحُ وَالنَّارُ ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ هَذَا الْمَاءُ قَدْ عَرَفْنَاهُ فَمَا بَالُ الْمِلْحِ وَالنَّارِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ يَا حُمَيْرَاءُ! مَنْ أَعْطَى نَارًا، ‏‏‏‏‏‏فَكَأَنَّمَا تَصَدَّقَ بِجَمِيعِ مَا أَنْضَجَتْ تِلْكَ النَّارُ، ‏‏‏‏‏‏وَمَنْ أَعْطَى مِلْحًا، ‏‏‏‏‏‏فَكَأَنَّمَا تَصَدَّقَ بِجَمِيعِ مَا طَيَّبَ ذَلِكَ الْمِلْحُ، ‏‏‏‏‏‏وَمَنْ سَقَى مُسْلِمًا شَرْبَةً مِنْ مَاءٍ حَيْثُ يُوجَدُ الْمَاءُ، ‏‏‏‏‏‏فَكَأَنَّمَا أَعْتَقَ رَقَبَةً، ‏‏‏‏‏‏وَمَنْ سَقَى مُسْلِمًا شَرْبَةً مِنْ مَاءٍ حَيْثُ لَا يُوجَدُ الْمَاءُ، ‏‏‏‏‏‏فَكَأَنَّمَا أَحْيَاهَا ."
      },
      {
        "id": 26829,
        "hadith_number": "2475",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Abyad bin Hammal dan Tanah Garam Sebagai Sedekah",
        "perawi_melayu": "Abyad bin Hammal",
        "english_text": "It was narrated from Abyad bin Hammal: That he asked for a salt flat called the Ma'rib Dam to be given to him, and it was given to him. Then Aqra bin Habis At-Tamimi came to the Messenger of Allah (ﷺ) and said: “O Messenger of Allah (ﷺ), I used to come to the salt flat during the Ignorance period and it was in a land in which there was no water, and whoever came to it took from it. It was (plentiful) like flowing water.” So the Messenger of Allah (ﷺ) asked Abyad bin Hammal to give back his share of the salt flat. He said: “I give it to you on the basis that you make it charity given by me.” The Messenger of Allah said: “It is a charity from you, and it is like flowing water, whoever comes to it may take from it.”(One of the narrators) Faraj said: “That is how it is today, whoever comes to it takes from it.” He said: “The Prophet (ﷺ) gave him land and palm trees in Jurf Murad instead, when he took back the salt flat from him.”",
        "malay_translation": "Diriwayatkan daripada Abyad bin Hammal: Bahawa dia meminta agar diberikan kepadanya kawasan garam yang dipanggil Empangan Ma'rib, dan ia telah diberikan kepadanya. Kemudian, Aqra bin Habis At-Tamimi datang kepada Rasulullah (ﷺ) dan berkata: “Wahai Rasulullah (ﷺ), saya pernah pergi ke kawasan garam itu pada zaman Jahiliyah dan ia terletak di tanah yang tidak ada air, dan sesiapa sahaja yang datang ke situ mengambil daripadanya. Ia (melimpah ruah) seperti air yang mengalir.” Maka Rasulullah (ﷺ) meminta Abyad bin Hammal untuk memulangkan bahagiannya daripada kawasan garam itu. Dia berkata: “Saya berikan kepada kamu dengan syarat kamu menjadikannya sebagai sedekah daripada saya.” Rasulullah bersabda: “Ia adalah sedekah daripada kamu, dan ia seperti air yang mengalir, sesiapa sahaja yang datang ke situ boleh mengambil daripadanya.” (Salah seorang perawi) Faraj berkata: “Begitulah keadaannya hari ini, sesiapa sahaja yang datang ke situ mengambil daripadanya.” Beliau berkata: “Nabi (ﷺ) memberi kepadanya tanah dan pokok kurma di Jurf Murad sebagai gantinya, apabila baginda mengambil balik kawasan garam itu daripadanya.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْعَدَنِيُّ، ‏‏‏‏‏‏حَدَّثَنَا فَرَجُ بْنُ سَعِيدِ بْنِ عَلْقَمَةَ بْنِ سَعِيدِ بْنِ أَبْيَضَ بْنِ حَمَّالٍ، ‏‏‏‏‏‏حَدَّثَنِي عَمِّيثَابِتُ بْنُ سَعِيدِ بْنِ أَبْيَضَ بْنِ حَمَّالٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ أَبْيَضَ بْنِ حَمَّالٍ، ‏‏‏‏‏‏أَنَّهُ اسْتَقْطَعَ الْمِلْحَ الَّذِي يُقَالُ لَهُ مِلْحُ سُدِّ مَأْرِبٍ فَأَقْطَعَهُ لَهُ، ‏‏‏‏‏‏ثُمَّ إِنَّ الْأَقْرَعَ بْنَ حَابِسٍ التَّمِيمِيَّ أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ إِنِّي قَدْ وَرَدْتُ الْمِلْحَ فِي الْجَاهِلِيَّةِ وَهُوَ بِأَرْضٍ لَيْسَ بِهَا مَاءٌ، ‏‏‏‏‏‏وَمَنْ وَرَدَهُ أَخَذَهُ، ‏‏‏‏‏‏وَهُوَ مِثْلُ الْمَاءِ الْعِدِّ، ‏‏‏‏‏‏فَاسْتَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبْيَضَ بْنَ حَمَّالٍ فِي قَطِيعَتِهِ فِي الْمِلْحِ فَقَالَ:‏‏‏‏ قَدْ أَقَلْتُكَ مِنْهُ عَلَى أَنْ تَجْعَلَهُ مِنِّي صَدَقَةً، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ هُوَ مِنْكَ صَدَقَةٌ، ‏‏‏‏‏‏وَهُوَ مِثْلُ الْمَاءِ الْعِدِّ مَنْ وَرَدَهُ أَخَذَهُ قَالَ فَرَجٌ:‏‏‏‏ وَهُوَ الْيَوْمَ عَلَى ذَلِكَ مَنْ وَرَدَهُ أَخَذَهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَقَطَعَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْضًا وَنَخْلًا بِالْجُرْفِ جُرْفِ مُرَادٍ مَكَانَهُ حِينَ أَقَالَهُ مِنْهُ."
      },
      {
        "id": 26830,
        "hadith_number": "2476",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Menjual Air",
        "perawi_melayu": "Abu Minhal (Semoga Allah merahmatinya)",
        "english_text": "It was narrated that Abu Minhal said: “I heard Iyas bin 'Abd Muzani say - when he saw people selling water: 'Do not sell water, for I heard the Messenger of Allah (ﷺ) forbidding selling of water.' ”",
        "malay_translation": "Diriwayatkan bahawa Abu Minhal berkata: “Aku mendengar Iyas bin 'Abd Muzani berkata - ketika dia melihat orang ramai menjual air: 'Janganlah kamu menjual air, kerana aku mendengar Rasulullah (ﷺ) melarang penjualan air.' ”",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ دِينَارٍ، ‏‏‏‏‏‏عَنْ أَبِي الْمِنْهَالِ، ‏‏‏‏‏‏سَمِعْتُ إِيَاسَ بْنَ عَبْدٍ الْمُزَنِيَّ، ‏‏‏‏‏‏وَرَأَى نَاسًا يَبِيعُونَ الْمَاءَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ لَا تَبِيعُوا الْمَاءَ، ‏‏‏‏‏‏سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ نَهَى أَنْ يُبَاعَ الْمَاءُ ."
      },
      {
        "id": 26831,
        "hadith_number": "2477",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Menjual Air Berlebihan",
        "perawi_melayu": "Jabir (Semoga Allah meredhainya)",
        "english_text": "It was narrated that Jabir said: “The Messenger of Allah (ﷺ) forbade selling surplus water.”",
        "malay_translation": "Diriwayatkan daripada Jabir (Semoga Allah meredhainya), bahawa Rasulullah (ﷺ) melarang daripada menjual lebihan air.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏ وَإِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ جُرَيْجٍ، ‏‏‏‏‏‏عَنْ أَبِي الزُّبَيْرِ، ‏‏‏‏‏‏عَنْجَابِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ فَضْلِ الْمَاءِ ."
      },
      {
        "id": 26832,
        "hadith_number": "2478",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Menahan Lebihan Air dan Rumput Umum",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said: “No one of you should withhold surplus water from common pastureland.”",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah radiallahuanhu, bahawa Nabi (ﷺ) bersabda: “Janganlah seorang pun daripada kamu menahan lebihan air daripada tanah ragut umum.”",
        "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ أَبِي الزِّنَادِ، ‏‏‏‏‏‏عَنِ الْأَعْرَجِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا يَمْنَعْ أَحَدُكُمْ فَضْلَ مَاءٍ لِيَمْنَعَ بِهِ الْكَلَأَ ."
      },
      {
        "id": 26833,
        "hadith_number": "2479",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Larangan Menahan Air Berlebihan dan Air Perigi",
        "perawi_melayu": "Aishah (R.A)",
        "english_text": "It was narrated from Aishah that the Messenger of Allah (ﷺ) said: “Surplus water should not be withheld, and neither should surplus water from a well.",
        "malay_translation": "Diriwayatkan daripada Aishah (R.A) bahawa Rasulullah (ﷺ) bersabda: \"Air lebihan tidak boleh ditahan, begitu juga air lebihan dari perigi.\" ",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏عَنْ حَارِثَةَ، ‏‏‏‏‏‏عَنْ عَمْرَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا يُمْنَعُ فَضْلُ الْمَاءِ وَلَا يُمْنَعُ نَقْعُ الْبِئْرِ ."
      },
      {
        "id": 26834,
        "hadith_number": "2480",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Keputusan Adil Rasulullah (ﷺ) dalam Perselisihan Air",
        "perawi_melayu": "'Abdullah bin Zubair رضي الله عنه",
        "english_text": "It was narrated from 'Abdullah bin Zubair that : a man from among the Ansar had a dispute with Zubair in the presence of the Messenger of Allah (ﷺ) concerning the streams of the Harrah with which he irrigated his palm trees. The Ansari said: “Let the water flow,” but he refused. So they referred their dispute to the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) said: “Irrigate (your trees) O Zubair, then let the water flow to your neighbor.” The Ansari became angry and said: “O Messenger of Allah (ﷺ), is it because he is your cousin (son of your paternal aunt)?” The expression of the Messenger of Allah (ﷺ) changed, then he said: “O Zubair, irrigate (your trees) then retain the water until it reaches the walls.” Zubair said: “I think this Verse was revealed concerning that: “But no, by your Lord, they make you (O Muhammad) judge in all disputes between them, and find in themselves no resistance against your decisions, and accept (them) with full submission [1].'” (Sahih) [1] An-Nisa 4.65",
        "malay_translation": "Diriwayatkan daripada 'Abdullah bin Zubair رضي الله عنه, bahawa: Seorang lelaki daripada kalangan Ansar telah berselisih dengan Zubair di hadapan Rasulullah (ﷺ) berkenaan aliran air di Harrah yang digunakan untuk mengairi pokok kurmanya. Orang Ansar itu berkata, “Biarkan air mengalir,” tetapi beliau enggan. Lalu mereka mengadukan perselisihan mereka kepada Rasulullah (ﷺ). Rasulullah (ﷺ) bersabda, “Siramlah (pokok-pokokmu) wahai Zubair, kemudian biarkanlah air mengalir kepada jiranmu.” Orang Ansar itu menjadi marah dan berkata, “Wahai Rasulullah (ﷺ), adakah kerana dia adalah sepupu anda (anak saudara sebelah bapa)?“ Riak wajah Rasulullah (ﷺ) berubah, kemudian baginda bersabda, “Wahai Zubair, siramlah (pokok-pokokmu) kemudian tahanlah air sehingga ia sampai ke tembok.” Zubair berkata, “Saya rasa ayat ini diturunkan berkenaan hal itu: “Tidak, demi Tuhanmu, mereka tidak beriman sehingga mereka menjadikanmu (wahai Muhammad) sebagai hakim dalam segala perselisihan antara mereka, kemudian mereka tidak merasa dalam hati mereka sesuatu keberatan terhadap keputusan yang kamu berikan, dan mereka menerima (keputusan itu) dengan penyerahan diri sepenuhnya [1].'” (Sahih) [1] An-Nisa 4:65",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، ‏‏‏‏‏‏أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، ‏‏‏‏‏‏عَنِ ابْنِ شِهَابٍ، ‏‏‏‏‏‏عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، ‏‏‏‏‏‏أَنَّ رَجُلًا مِنَ الْأَنْصَارِ خَاصَمَ الزُّبَيْرَ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي شِرَاجِ الْحَرَّةِ الَّتِي يَسْقُونَ بِهَا النَّخْلَ، ‏‏‏‏‏‏فَقَالَ الْأَنْصَارِيُّ:‏‏‏‏ سَرِّحْ الْمَاءَ يَمُرَّ، ‏‏‏‏‏‏فَأَبَى عَلَيْهِ، ‏‏‏‏‏‏فَاخْتَصَمَا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اسْقِ يَا زُبَيْرُ، ‏‏‏‏‏‏ثُمَّ أَرْسِلِ الْمَاءَ إِلَى جَارِكَ ، ‏‏‏‏‏‏فَغَضِبَ الْأَنْصَارِيُّ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ! أَنْ كَانَ ابْنَ عَمَّتِكَ؟ فَتَلَوَّنَ وَجْهُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ:‏‏‏‏ يَا زُبَيْرُ! اسْقِ، ‏‏‏‏‏‏ثُمَّ احْبِسْ الْمَاءَ حَتَّى يَرْجِعَ إِلَى الْجَدْرِ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَقَالَ الزُّبَيْرُ:‏‏‏‏ وَاللَّهِ إِنِّي لَأَحْسِبُ هَذِهِ الْآيَةَ نَزَلَتْ فِي ذَلِكَ فَلا وَرَبِّكَ لا يُؤْمِنُونَ حَتَّى يُحَكِّمُوكَ فِيمَا شَجَرَ بَيْنَهُمْ ثُمَّ لا يَجِدُوا فِي أَنْفُسِهِمْ حَرَجًا مِمَّا قَضَيْتَ وَيُسَلِّمُوا تَسْلِيمًا سورة النساء آية 65."
      },
      {
        "id": 26835,
        "hadith_number": "2481",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukum Rasulullah ﷺ Mengenai Pengairan Aliran Mahzur",
        "perawi_melayu": "Tha'labah bin Abu Malik",
        "english_text": "It was narrated that Tha'labah bin Abu Malik said: “The Messenger of Allah (ﷺ) ruled concerning the stream of Mahzur that the higher ground took precedence over the lower, so the higher ground should be irrigated until the water reached the ankles, then it should be released to those who were lower.",
        "malay_translation": "Diriwayatkan daripada Tha'labah bin Abu Malik, beliau berkata: “Rasulullah ﷺ telah memutuskan mengenai aliran Mahzur bahawa tanah yang lebih tinggi perlu diutamakan berbanding yang lebih rendah. Oleh itu, tanah yang lebih tinggi hendaklah diairi sehingga air sampai ke buku lali, kemudian air itu hendaklah dilepaskan kepada mereka yang berada di bawah.”",
        "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ، ‏‏‏‏‏‏حَدَّثَنَا زَكَرِيَّا بْنُ مَنْظُورِ بْنِ ثَعْلَبَةَ بْنِ أَبِي مَالِكٍ، ‏‏‏‏‏‏حَدَّثَنِي مُحَمَّدُ بْنُ عُقْبَةَ بْنِ أَبِي مَالِكٍ، ‏‏‏‏‏‏عَنْ عَمِّهِ ثَعْلَبَةَ بْنِ أَبِي مَالِكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَيْلِ مَهْزُورٍ الْأَعْلَى فَوْقَ الْأَسْفَلِ، ‏‏‏‏‏‏يَسْقِي الْأَعْلَى إِلَى الْكَعْبَيْنِ، ‏‏‏‏‏‏ثُمَّ يُرْسِلُ إِلَى مَنْ هُوَ أَسْفَلُ مِنْهُ ."
      },
      {
        "id": 26836,
        "hadith_number": "2482",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukum Rasulullah ﷺ Mengenai Aliran Air Mahzur",
        "perawi_melayu": "'Amr bin Shu`aib, daripada bapanya, daripada datuknya",
        "english_text": "It was narrated from 'Amr bin Shu`aib, from his father, from his grandfather, that : the Messenger of Allah (ﷺ) ruled concerning the stream of Mahzur that the water should be retained until it reached the ankles, then released.",
        "malay_translation": "Diriwayatkan daripada 'Amr bin Shu`aib, daripada bapanya, daripada datuknya, bahawa: Rasulullah (ﷺ) telah memutuskan berkenaan aliran Mahzur bahawa air tersebut harus ditahan sehingga mencapai buku lali, kemudian dilepaskan.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ، ‏‏‏‏‏‏أَنْبَأَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏حَدَّثَنِي أَبِي، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ شُعَيْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ قَضَى فِي سَيْلِ مَهْزُورٍ أَنْ يُمْسِكَ حَتَّى يَبْلُغَ الْكَعْبَيْنِ ثُمَّ يُرْسِلَ الْمَاءَ ."
      },
      {
        "id": 26837,
        "hadith_number": "2483",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hukum Rasulullah SAW Berkaitan Pengairan Pokok Kurma",
        "perawi_melayu": "Daripada 'Ubadah bin Samit (semoga Allah meredhainya)",
        "english_text": "It was narrated from 'Ubadah bin Samit that : the Messenger of Allah (ﷺ) ruled concerning the irrigation of palm trees from streams, that the higher ground should be irrigated before the lower, and that the water should be allowed to reach the ankles, then released to flow the nearest lower ground, and so on, until all the fields were watered or until the water ran out.",
        "malay_translation": "Diriwayatkan daripada 'Ubadah bin Samit (semoga Allah meredhainya) bahawa: Rasulullah (ﷺ) telah membuat keputusan berkaitan pengairan pokok kurma daripada sungai, bahawa tanah yang lebih tinggi hendaklah diairi dahulu sebelum yang lebih rendah, dan air itu hendaklah dibiarkan sampai ke buku lali, kemudian dilepaskan untuk mengalir ke tanah yang lebih rendah yang terdekat, dan seterusnya, sehingga semua kebun diairi atau sehingga air habis.",
        "arabic_text": "حَدَّثَنَا أَبُو الْمُغَلِّسِ، ‏‏‏‏‏‏حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، ‏‏‏‏‏‏عَنْ إِسْحَاق بْنِ يَحْيَى بْنِ الْوَلِيدِ، ‏‏‏‏‏‏عَنْعُبَادَةَ بْنِ الصَّامِتِ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ قَضَى فِي شُرْبِ النَّخْلِ مِنَ السَّيْلِ أَنَّ الْأَعْلَى فَالْأَعْلَى يَشْرَبُ قَبْلَ الْأَسْفَلِ وَيُتْرَكُ الْمَاءُ إِلَى الْكَعْبَيْنِ، ‏‏‏‏‏‏ثُمَّ يُرْسَلُ الْمَاءُ إِلَى الْأَسْفَلِ الَّذِي يَلِيهِ وَكَذَلِكَ حَتَّى تَنْقَضِيَ الْحَوَائِطُ أَوْ يَفْنَى الْمَاءُ ."
      },
      {
        "id": 26838,
        "hadith_number": "2484",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Memulakan Pemberian Air kepada Kuda Dahulu",
        "perawi_melayu": "Kathir bin 'Abdullah bin 'Amr bin 'Awf Al-Muzani, daripada bapanya, daripada datuknya",
        "english_text": "It was narrated from Kathir bin 'Abdullah bin 'Amr bin 'Awf Al-Muzani, from his father, that his grandfather said: “The Messenger of Allah (ﷺ) said: 'Start with the horses on the day that you bring (the animals to drink).' ”",
        "malay_translation": "Diriwayatkan daripada Kathir bin 'Abdullah bin 'Amr bin 'Awf Al-Muzani, daripada bapanya, bahawa datuknya berkata: \"Rasulullah (ﷺ) bersabda: 'Mulakan dengan kuda pada hari kamu membawa (haiwan untuk minum).'",
        "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ، ‏‏‏‏‏‏أَنْبَأَنَا أَبُو الْجَعْدِ عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ كَثِيرِ بْنِ عَبْدِ اللَّهِ بْنِ عَوْفٍ الْمُزَنِيِّ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يُبَدَّأُ بِالْخَيْلِ يَوْمَ وِرْدِهَا ."
      },
      {
        "id": 26839,
        "hadith_number": "2485",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Pembahagian Semasa Jahiliyah dan Islam",
        "perawi_melayu": "Daripada Ibn `Abbas",
        "english_text": "It was narrated from Ibn `Abbas that the Messenger of Allah (ﷺ) said: “Every division that was allocated according to (the rules of) the Ignorance days, stands as it is, and every division that was allocated according to (the rules of) Islam, stands according to the rules of Islam.”",
        "malay_translation": "Diriwayatkan daripada Ibn `Abbas bahawa Rasulullah (ﷺ) bersabda: “Setiap pembahagian yang dibuat pada zaman Jahiliyah, kekal seperti sedia ada, dan setiap pembahagian yang dibuat mengikut (peraturan) Islam, kekal mengikut peraturan Islam.”",
        "arabic_text": "حَدَّثَنَا الْعَبَّاسُ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏حَدَّثَنَا مُوسَى بْنُ دَاوُدَ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ مُسْلِمٍ الطَّائِفِيُّ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ دِينَارٍ، ‏‏‏‏‏‏عَنْ أَبِي الشَّعْثَاءِ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ كُلُّ قَسْمٍ قُسِمَ فِي الْجَاهِلِيَّةِ فَهُوَ عَلَى مَا قُسِمَ، ‏‏‏‏‏‏وَكُلُّ قَسْمٍ أَدْرَكَهُ الْإِسْلَامُ فَهُوَ عَلَى قَسْمِ الْإِسْلَامِ ."
      },
      {
        "id": 26840,
        "hadith_number": "2486",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Ganjaran Bagi Penggali Perigi",
        "perawi_melayu": "'Abdullah bin Mughaffal (Semoga Allah meredhainya)",
        "english_text": "It was narrated from 'Abdullah bin Mughaffal that the Prophet (ﷺ) said: “Whoever digs a well, is entitled to forty forearms' length surrounding it is as a resting place for his flocks.”",
        "malay_translation": "Diriwayatkan daripada 'Abdullah bin Mughaffal bahawa Nabi (ﷺ) bersabda: “Sesiapa yang menggali perigi, dia berhak mendapat empat puluh hasta panjang sekelilingnya sebagai tempat berehat bagi ternakannya.”",
        "arabic_text": "حَدَّثَنَا الْوَلِيدُ بْنُ عَمْرِو بْنِ سُكَيْنٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُثَنَّى، ‏‏‏‏‏‏ح وحَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدِ بْنِ الصَّبَّاحِ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَطَاءٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا إِسْمَاعِيل الْمَكِيُّ، ‏‏‏‏‏‏عَنِ الْحَسَنِ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ حَفَرَ بِئْرًا فَلَهُ أَرْبَعُونَ ذِرَاعًا عَطَنًا لِمَاشِيَتِهِ ."
      },
      {
        "id": 26841,
        "hadith_number": "2487",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hadis: Sempadan Sekeliling Perigi",
        "perawi_melayu": "Abu Sa'eed Al-Khudri",
        "english_text": "It was narrated from Abu Sa'eed Al-Khudri that the Messenger of Allah (ﷺ) said: “The land around a well (that is considered to be part of it) is the length of the well rope (in all directions).”",
        "malay_translation": "Diriwayatkan daripada Abu Sa'eed Al-Khudri bahawa Rasulullah (ﷺ) bersabda: “Tanah di sekeliling perigi (yang dianggap sebagai sebahagian daripadanya) adalah sepanjang tali perigi (ke semua arah).”",
        "arabic_text": "حَدَّثَنَا سَهْلُ بْنُ أَبِي الصُّغْدِيِّ، ‏‏‏‏‏‏حَدَّثَنَا مَنْصُورُ بْنُ صُقَيْرٍ، ‏‏‏‏‏‏حَدَّثَنَا ثَابِتُ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏عَنْ نَافِعٍ أَبِي غَالِبٍ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ حَرِيمُ الْبِئْرِ مَدُّ رِشَائِهَا ."
      },
      {
        "id": 26842,
        "hadith_number": "2488",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Ketetapan Rasulullah (ﷺ) Mengenai Hak Milik Pokok Kurma",
        "perawi_melayu": "'Ubadah bin Samit",
        "english_text": "It was narrated from 'Ubadah bin Samit that : the Messenger of Allah (ﷺ) ruled concerning one, two or three date palms belonging to a man among other palm trees - when they differ concerning entitlement to the surrounding land. He ruled that the land around each of those trees, as far as their leaves reach, measured from the bottom of the tree, belongs to the owner of the tree.",
        "malay_translation": "Diriwayatkan daripada 'Ubadah bin Samit bahawa: Rasulullah (ﷺ) telah membuat ketetapan mengenai satu, dua atau tiga pokok kurma kepunyaan seorang lelaki di antara pokok-pokok kurma yang lain - apabila mereka berselisih mengenai hak ke atas tanah sekelilingnya. Baginda memutuskan bahawa tanah di sekeliling setiap pokok tersebut, sejauh mana daunnya mencapai, diukur dari pangkal pokok, adalah hak milik pemilik pokok tersebut.",
        "arabic_text": "حَدَّثَنَا عَبْدُ رَبِّهِ بْنُ خَالِدٍ النُّمَيْرِيُّ أَبُو الْمُغَلِّسِ، ‏‏‏‏‏‏حَدَّثَنَا الْفُضَيْلُ بْنُ سُلَيْمَانَ، ‏‏‏‏‏‏حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، ‏‏‏‏‏‏أَخْبَرَنِيإِسْحَاق بْنُ يَحْيَى بْنِ الْوَلِيدِ، ‏‏‏‏‏‏عَنْ عُبَادَةَ بْنِ الصَّامِتِ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ قَضَى فِي النَّخْلَةِ وَالنَّخْلَتَيْنِ وَالثَّلَاثَةِ لِلرَّجُلِ فِي النَّخْلِ فَيَخْتَلِفُونَ فِي حُقُوقِ ذَلِكَ فَقَضَى أَنَّ لِكُلِّ نَخْلَةٍ مِنْ أُولَئِكَ مِنَ الْأَسْفَلِ مَبْلَغُ جَرِيدِهَا حَرِيمٌ لَهَا ."
      },
      {
        "id": 26843,
        "hadith_number": "2489",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Hak Milik Tanah Sekeliling Pokok Kurma",
        "perawi_melayu": "Daripada Ibn 'Umar",
        "english_text": "It was narrated from Ibn 'Umar that the Messenger of Allah Said: “The land around a date-palm tree, as far as its branches reach, belongs to the owner of the tree.”",
        "malay_translation": "Diriwayatkan daripada Ibn 'Umar bahawa Rasulullah SAW bersabda: “Tanah di sekeliling pokok kurma, sejauh mana rantingnya mencapai, adalah milik pemilik pokok tersebut.”",
        "arabic_text": "حَدَّثَنَا سَهْلُ بْنُ أَبِي الصُّغْدِيِّ، ‏‏‏‏‏‏حَدَّثَنَا مَنْصُورُ بْنُ صُقَيْرٍ، ‏‏‏‏‏‏حَدَّثَنَا ثَابِتُ بْنُ مُحَمَّدٍ الْعَبْدِيُّ، ‏‏‏‏‏‏عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ حَرِيمُ النَّخْلَةِ مَدُّ جَرِيدِهَا ."
      },
      {
        "id": 26844,
        "hadith_number": "2490",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Berkat Ke Atas Penjualan Rumah dan Harta",
        "perawi_melayu": "Sa'eed bin Huraith",
        "english_text": "It was narrated that Sa'eed bin Huraith said: “I heard the Messenger of Allah (ﷺ) said: 'Whoever sells a house or property and does not use the money for something similar, deserves not to be blessed therein.' ”",
        "malay_translation": "Diriwayatkan bahawa Sa'eed bin Huraith berkata: \"Aku mendengar Rasulullah (ﷺ) bersabda: 'Sesiapa yang menjual rumah atau harta dan tidak menggunakan wang tersebut untuk sesuatu yang serupa, maka dia tidak layak mendapat keberkatan daripadanya.'\"",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعٌ، ‏‏‏‏‏‏حَدَّثَنَا إِسْمَاعِيل بْنُ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ، ‏‏‏‏‏‏عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ حُرَيْثٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ مَنْ بَاعَ دَارًا أَوْ عَقَارًا فَلَمْ يَجْعَلْ ثَمَنَهُ فِي مِثْلِهِ كَانَ قَمِنًا أَنْ لَا يُبَارَكَ فِيهِ ."
      },
      {
        "id": 26845,
        "hadith_number": "2491",
        "status": "Sahih",
        "nama_buku": "Sunan Ibn-e-Majah",
        "penulis_buku": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
        "tajuk_hadith": "Kebaikan Menggunakan Wang Jualan Rumah untuk Pembelian Serupa",
        "perawi_melayu": "Hudhaifah bin Yaman",
        "english_text": "It was narrated from Hudhaifah bin Yaman that the Messenger of Allah (ﷺ) said: “Whoever sells a house and does not use the money for something similar, will not to be blessed therein.' ”",
        "malay_translation": "Diriwayatkan daripada Hudhaifah bin Yaman bahawa Rasulullah (ﷺ) bersabda: “Sesiapa yang menjual rumah dan tidak menggunakan wang tersebut untuk sesuatu yang serupa, maka dia tidak akan diberkati di dalamnya.”",
        "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، ‏‏‏‏‏‏ وَعَمْرُو بْنُ رَافِعٍ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو مَالِكٍ النَّخَعِيُّ، ‏‏‏‏‏‏عَنْ يُوسُفَ بْنِ مَيْمُونٍ، ‏‏‏‏‏‏عَنْ أَبِي عُبَيْدَةَ بْنِ حُذَيْفَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ حُذَيْفَةَ بْنِ الْيَمَانِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ بَاعَ دَارًا وَلَمْ يَجْعَلْ ثَمَنَهَا فِي مِثْلِهَا لَمْ يُبَارَكْ لَهُ فِيهَا ."
      }
    ]
  }
}