{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 97,
    "data": [
      {
        "id": 6968,
        "hadith_number": "7268",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hari Wahyu Ayat Penyempurnaan Agama Islam",
        "perawi_melayu": "Dari Tariq bin Shihab:",
        "english_text": "A Jew said to `Umar رضی اللہ عنہ , \"O Chief of the Believers, if this verse: 'This day I have perfected your religion for you, completed My favors upon you, and have chosen for you, Islam as your religion.' (5.3) had been revealed upon us, we would have taken that day as an `Id (festival) day.\" `Umar رضی اللہ عنہ said, \"I know definitely on what day this Verse was revealed; it was revealed on the day of `Arafat, on a Friday.\" Sufyan from Qais and Qais has heard it from Tariq bin Shibah.",
        "malay_translation": "Seorang Yahudi berkata kepada Umar bin al-Khattab, \"Wahai Pemimpin orang beriman, sekiranya ayat ini:  'Pada hari ini telah Aku sempurnakan untuk kamu agama kamu, dan telah Aku cukupkan nikmat-Ku kepada kamu, dan telah Aku redhai Islam itu menjadi agama bagi kamu.' (5:3) diturunkan kepada kami, nescaya kami akan menjadikan hari itu sebagai hari raya.\" Umar bin al-Khattab berkata, \"Aku tahu pasti pada hari apakah ayat ini diturunkan; ia diturunkan pada hari Arafah, iaitu hari Jumaat.\" Sufyan daripada Qais, dan Qais mendengarnya daripada Tariq bin Syihab.",
        "arabic_text": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ مِسْعَرٍ، وَغَيْرِهِ، عَنْ قَيْسِ بْنِ مُسْلِمٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، قَالَ قَالَ رَجُلٌ مِنَ الْيَهُودِ لِعُمَرَ يَا أَمِيرَ الْمُؤْمِنِينَ لَوْ أَنَّ عَلَيْنَا نَزَلَتْ هَذِهِ الآيَةُ ‏{‏ الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمُ الإِسْلاَمَ دِينًا‏}‏ لاَتَّخَذْنَا ذَلِكَ الْيَوْمَ عِيدًا‏.‏ فَقَالَ عُمَرُ إِنِّي لأَعْلَمُ أَىَّ يَوْمٍ نَزَلَتْ هَذِهِ الآيَةُ، نَزَلَتْ يَوْمَ عَرَفَةَ فِي يَوْمِ جُمُعَةٍ‏.‏ سَمِعَ سُفْيَانُ مِنْ مِسْعَرٍ وَمِسْعَرٌ قَيْسًا وَقَيْسٌ طَارِقًا‏.‏"
      },
      {
        "id": 6969,
        "hadith_number": "7269",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Umar Berkhutbah Selepas Wafatnya Nabi SAW",
        "perawi_melayu": "Anas bin Malik رضي الله عنه",
        "english_text": "He heard `Umar رضی اللہ عنہ speaking while standing on the pulpit of the Prophet (ﷺ) in the morning (following the death of the Prophet), when the people had sworn allegiance to Abu Bakr رضی اللہ عنہ . He said the Tashah-hud before Abu Bakr رضی اللہ عنہ , and said, \"Amma Ba'du (then after) Allah has chosen for his Apostle what is with Him (Paradise) rather than what is with you (the world). This is that Book (Qur'an) with which Allah guided your Apostle, so stick to it, for then you will be guided on the right path as Allah guided His Apostle with it.\"",
        "malay_translation": "Dia mendengar Umar رضي الله عنه berkhutbah sambil berdiri di mimbar Nabi ﷺ pada pagi hari (selepas kewafatan Nabi), ketika manusia telah menyatakan bai’ah kepada Abu Bakar رضي الله عنه. Baginda telah melafazkan Tashahhud sebelum Abu Bakar رضي الله عنه, dan berkata, \"أما بعد (Kemudian) Allah telah memilih untuk Rasul-Nya apa yang ada di sisi-Nya (Syurga) berbanding apa yang ada pada kamu (dunia). Inilah kitab (Al-Quran) yang dengannya Allah memberi petunjuk kepada Rasul kamu, maka berpegang teguhlah kepadanya, kerana dengannya kamu akan mendapat petunjuk ke jalan yang benar sebagaimana Allah memberi petunjuk kepada Rasul-Nya dengannya.\"",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّهُ سَمِعَ عُمَرَ الْغَدَ، حِينَ بَايَعَ الْمُسْلِمُونَ أَبَا بَكْرٍ، وَاسْتَوَى عَلَى مِنْبَرِ رَسُولِ اللَّهِ صلى الله عليه وسلم تَشَهَّدَ قَبْلَ أَبِي بَكْرٍ فَقَالَ أَمَّا بَعْدُ فَاخْتَارَ اللَّهُ لِرَسُولِهِ صلى الله عليه وسلم الَّذِي عِنْدَهُ عَلَى الَّذِي عِنْدَكُمْ، وَهَذَا الْكِتَابُ الَّذِي هَدَى اللَّهُ بِهِ رَسُولَكُمْ فَخُذُوا بِهِ تَهْتَدُوا وَإِنَّمَا هَدَى اللَّهُ بِهِ رَسُولَهُ‏.‏"
      },
      {
        "id": 6970,
        "hadith_number": "7270",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pelukan Nabi dan Doa untuk Penguasaan Al-Quran",
        "perawi_melayu": "Riwayat Ibnu Abbas رضي الله عنهما:",
        "english_text": "The Prophet (ﷺ) embraced me and said, \"O Allah! Teach him (the knowledge of) the Book (Qur'an).\"",
        "malay_translation": "Nabi SAW memelukku dan bersabda, \"Ya Allah! Ajarkanlah kepadanya (ilmu) Kitab (Al-Quran).\"",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، عَنْ خَالِدٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ ضَمَّنِي إِلَيْهِ النَّبِيُّ صلى الله عليه وسلم وَقَالَ ‏ \"‏ اللَّهُمَّ عَلِّمْهُ الْكِتَابَ ‏\"‏‏.‏"
      },
      {
        "id": 6971,
        "hadith_number": "7271",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kurnia Allah Melalui Islam dan Muhammad",
        "perawi_melayu": "Abu Barza رضي الله عنه",
        "english_text": "\"(O people!) Allah makes you self-sufficient or has raised you high with Islam and with Muhammad.\"",
        "malay_translation": "\"Wahai manusia! Allah telah menjadikan kamu cukup atau telah meninggikan darjat kamu dengan Islam dan dengan Muhammad.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَبَّاحٍ، حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ عَوْفًا، أَنَّ أَبَا الْمِنْهَالِ، حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا بَرْزَةَ، قَالَ إِنَّ اللَّهَ يُغْنِيكُمْ أَوْ نَغَشَكُمْ بِالإِسْلاَمِ وَبِمُحَمَّدٍ صلى الله عليه وسلم‏.‏ قَالَ أَبُو عَبْد اللَّهِ وَقَعَ هَاهُنَا يُغْنِيكُمْ وَإِنَّمَا هُوَ نَعَشَكُمْ يُنْظَرُ فِي أَصْلِ كِتَابِ الِاعْتِصَامِ."
      },
      {
        "id": 6972,
        "hadith_number": "7272",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Bai'ah Abdullah bin Umar kepada Abdul Malik bin Marwan",
        "perawi_melayu": "Riwayat Abdullah bin Umar رضي الله عنهما:",
        "english_text": "He wrote to `Abdul Malik bin Marwan, swearing allegiance to him: 'I swear allegiance to you in that I will listen and obey what is in accordance with the Laws of Allah and the Tradition of His Apostle as much as I can.'",
        "malay_translation": "Baginda menulis kepada Abdul Malik bin Marwan, menyatakan bai'ah kepadanya: 'Aku berbai'ah kepadamu bahawa aku akan mendengar dan mentaati apa yang selaras dengan Hukum-hukum Allah dan Sunnah Rasul-Nya seberapa banyak yang aku mampu.'",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَتَبَ إِلَى عَبْدِ الْمَلِكِ بْنِ مَرْوَانَ يُبَايِعُهُ، وَأُقِرُّ لَكَ بِالسَّمْعِ وَالطَّاعَةِ عَلَى سُنَّةِ اللَّهِ وَسُنَّةِ رَسُولِهِ، فِيمَا اسْتَطَعْتُ‏.‏"
      },
      {
        "id": 6973,
        "hadith_number": "7273",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW diutus dengan Gaya Bahasa yang Ringkas dan Kemenangan melalui Keagungan",
        "perawi_melayu": "Riwayat Abu Hurairah رضي الله عنه:",
        "english_text": "Allah's Messenger (ﷺ) said, \"I have been sent with 'Jawami-al-Kalim ' (the shortest expression with the widest meaning) and have been made victorious with awe (cast in my enemy's hearts), and while I was sleeping, I saw that the keys of the treasures of the world were placed in my hand.\" Abu Huraira رضي الله عنه added: Allah's Messenger (ﷺ) has gone, and you people are utilizing those treasures, or digging those treasures out.\" or said a similar sentence.",
        "malay_translation": "Rasulullah SAW bersabda, \"Aku diutus dengan 'Jawami' al-Kalim' (ungkapan yang paling ringkas dengan makna yang paling luas) dan aku telah diberikan kemenangan melalui keagungan (yang ditanamkan di hati musuh-musuhku), dan ketika aku tidur, aku melihat bahawa kunci-kunci khazanah dunia diletakkan di tanganku.\" Abu Hurairah رضي الله عنه menambah: \"Rasulullah SAW telah pergi, dan kamu sekalian kini menggunakan khazanah-khazanah itu, atau menggali khazanah-khazanah itu.\" atau bersabda dengan maksud yang hampir sama.",
        "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ بُعِثْتُ بِجَوَامِعِ الْكَلِمِ، وَنُصِرْتُ بِالرُّعْبِ، وَبَيْنَا أَنَا نَائِمٌ رَأَيْتُنِي أُتِيتُ بِمَفَاتِيحِ خَزَائِنِ الأَرْضِ، فَوُضِعَتْ فِي يَدِي ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ فَقَدْ ذَهَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنْتُمْ تَلْغَثُونَهَا أَوْ تَرْغَثُونَهَا، أَوْ كَلِمَةً تُشْبِهُهَا‏.‏"
      },
      {
        "id": 6974,
        "hadith_number": "7274",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kemuliaan Nabi Muhammad SAW dan Ummatnya",
        "perawi_melayu": "Riwayat Abu Hurairah رضي الله عنه:",
        "english_text": "The Prophet (ﷺ) said, \"There was no prophet among the prophets but was given miracles because of which people had security or had belief, but what I was given was the Divine Inspiration which Allah revealed to me. So I hope that my followers will be more than those of any other prophet on the Day of Resurrection.\"",
        "malay_translation": "Rasulullah SAW bersabda: \"Tiada seorang pun di kalangan para nabi melainkan telah diberikan mukjizat yang menyebabkan manusia merasa selamat atau beriman, tetapi apa yang diberikan kepadaku ialah wahyu yang Allah SWT wahyukan kepadaku. Oleh itu, aku berharap pengikutku akan lebih ramai daripada pengikut nabi-nabi yang lain pada hari kiamat.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا اللَّيْثُ، عَنْ سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَا مِنَ الأَنْبِيَاءِ نَبِيٌّ إِلاَّ أُعْطِيَ مِنَ الآيَاتِ مَا مِثْلُهُ أُومِنَ ـ أَوْ آمَنَ ـ عَلَيْهِ الْبَشَرُ، وَإِنَّمَا كَانَ الَّذِي أُوتِيتُ وَحْيًا أَوْحَاهُ اللَّهُ إِلَىَّ، فَأَرْجُو أَنِّي أَكْثَرُهُمْ تَابِعًا يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏"
      },
      {
        "id": 6975,
        "hadith_number": "7275",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keengganan Umar al-Khattab untuk Mengagihkan Harta Kaabah",
        "perawi_melayu": "Riwayat Abu Wail:",
        "english_text": "I sat with Shaiba in this Mosque (Al-Masjid-Al-Haram), and he said, \"`Umar رضی اللہ عنہ once sat beside me here as you are now sitting, and said, 'I feel like distributing all the gold and silver that are in it (i.e., the Ka`ba) among the Muslims'. I said, 'You cannot do that.' `Umar رضی اللہ عنہ said, 'Why?' I said, 'Your two (previous) companions (the Prophet (ﷺ) and Abu Bakr رضی اللہ عنہ ) did not do it. `Umar رضی اللہ عنہ said, 'They are the two persons whom one must follow.'\" (See Hadith No. 664, Vol. 2)",
        "malay_translation": "Aku duduk bersama Shaiba di Masjid ini (Al-Masjid Al-Haram), dan dia berkata, \"Umar bin al-Khattab pernah duduk di sisiku di sini seperti kamu duduk sekarang, dan berkata, 'Aku rasa ingin mengagihkan semua emas dan perak yang ada di dalamnya (iaitu, Kaabah) kepada orang Islam.' Aku berkata, 'Engkau tidak boleh berbuat demikian.' Umar bin al-Khattab berkata, 'Mengapa?' Aku berkata, 'Kedua-dua sahabatmu (Nabi ﷺ dan Abu Bakar bin al-Khattab) tidak melakukannya. Umar bin al-Khattab berkata, 'Mereka berdua adalah orang yang mesti diikuti.'",
        "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَبَّاسٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنْ وَاصِلٍ، عَنْ أَبِي وَائِلٍ، قَالَ جَلَسْتُ إِلَى شَيْبَةَ فِي هَذَا الْمَسْجِدِ قَالَ جَلَسَ إِلَىَّ عُمَرُ فِي مَجْلِسِكَ هَذَا فَقَالَ هَمَمْتُ أَنْ لاَ أَدَعَ فِيهَا صَفْرَاءَ وَلاَ بَيْضَاءَ إِلاَّ قَسَمْتُهَا بَيْنَ الْمُسْلِمِينَ‏.‏ قُلْتُ مَا أَنْتَ بِفَاعِلٍ‏.‏ قَالَ لِمَ‏.‏ قُلْتُ لَمْ يَفْعَلْهُ صَاحِبَاكَ قَالَ هُمَا الْمَرْآنِ يُقْتَدَى بِهِمَا‏.‏"
      },
      {
        "id": 6976,
        "hadith_number": "7276",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kejujuran dan Al-Quran serta Sunnah",
        "perawi_melayu": "Riwayat Hudhaifa ibnul Yaman",
        "english_text": "Allah's Messenger (ﷺ) said to us, \"Honesty descended from the Heavens and settled in the roots of the hearts of men (faithful believers), and then the Qur'an was revealed and the people read the Qur'an, (and learnt it from it) and also learnt it from the Sunna.\" Both Qur'an and Sunna strengthened their (the faithful believers') honesty. (See Hadith No. 208)",
        "malay_translation": "Rasulullah SAW bersabda kepada kami, \"Kejujuran turun dari langit dan menetap di dalam akar hati manusia (orang-orang beriman), kemudian Al-Quran diturunkan dan manusia membacanya, (dan mempelajarinya daripadanya) dan juga mempelajarinya daripada Sunnah.\"  Al-Quran dan Sunnah kedua-duanya menguatkan kejujuran mereka (orang-orang beriman). (Rujuk Hadis No. 208)",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ سَأَلْتُ الأَعْمَشَ فَقَالَ عَنْ زَيْدِ بْنِ وَهْبٍ، سَمِعْتُ حُذَيْفَةَ، يَقُولُ حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَنَّ الأَمَانَةَ نَزَلَتْ مِنَ السَّمَاءِ فِي جَذْرِ قُلُوبِ الرِّجَالِ، وَنَزَلَ الْقُرْآنُ فَقَرَءُوا الْقُرْآنَ وَعَلِمُوا مِنَ السُّنَّةِ ‏\"‏‏.‏"
      },
      {
        "id": 6977,
        "hadith_number": "7277",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perkataan Terbaik, Jalan Terbaik, dan Bid'ah",
        "perawi_melayu": "Riwayat Abdullah ibn Mas'ud",
        "english_text": "The best talk (speech) is Allah's Book 'Qur'an), and the best way is the way of Muhammad, and the worst matters are the heresies (those new things which are introduced into the religion); and whatever you have been promised will surely come to pass, and you cannot escape (it).",
        "malay_translation": "Perkataan yang terbaik ialah Al-Quran, dan jalan yang terbaik ialah jalan Muhammad.  Perkara yang paling buruk ialah bid'ah (perkara-perkara baru yang diperkenalkan dalam agama); dan apa sahaja yang telah dijanjikan kepada kamu pasti akan berlaku, dan kamu tidak dapat melepaskan diri daripadanya.",
        "arabic_text": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنَا عَمْرُو بْنُ مُرَّةَ، سَمِعْتُ مُرَّةَ الْهَمْدَانِيَّ، يَقُولُ قَالَ عَبْدُ اللَّهِ إِنَّ أَحْسَنَ الْحَدِيثِ كِتَابُ اللَّهِ، وَأَحْسَنَ الْهَدْىِ هَدْىُ مُحَمَّدٍ صلى الله عليه وسلم، وَشَرَّ الأُمُورِ مُحْدَثَاتُهَا، وَإِنَّ مَا تُوعَدُونَ لآتٍ، وَمَا أَنْتُمْ بِمُعْجِزِينَ‏.‏"
      },
      {
        "id": 6978,
        "hadith_number": "7278, 7279",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kehakiman Nabi SAW Berdasarkan Kitab Allah",
        "perawi_melayu": "Abu Hurairah dan Zaid bin Khalid رضي الله عنهما",
        "english_text": "We were with the Prophet (ﷺ) when he said (to two men), \"I shall judge between you according to Allah's Book (Laws).\"",
        "malay_translation": "Kami berada bersama Nabi ﷺ ketika baginda bersabda (kepada dua orang lelaki), \"Aku akan menghakimi di antara kamu berdua menurut Kitab Allah (hukum-hukumNya).\"",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الزُّهْرِيُّ، عَنْ عُبَيْدِ اللَّهِ، عَنْ أَبِي هُرَيْرَةَ، وَزَيْدِ بْنِ خَالِدٍ، قَالاَ كُنَّا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ لأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ ‏\"‏‏.‏"
      },
      {
        "id": 6979,
        "hadith_number": "7280",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Syarat Masuk Syurga: Ketaatan Kepada Rasulullah",
        "perawi_melayu": "Abu Hurairah رضي الله عنه :",
        "english_text": "Allah's Messenger (ﷺ) said, \"All my followers will enter Paradise except those who refuse.\" They said, \"O Allah's Messenger (ﷺ)! Who will refuse?\" He said, \"Whoever obeys me will enter Paradise, and whoever disobeys me is the one who refuses (to enter it).\"",
        "malay_translation": "Rasulullah SAW bersabda: \"Semua pengikutku akan masuk syurga kecuali mereka yang enggan.\" Mereka bertanya: \"Wahai Rasulullah SAW! Siapakah yang enggan?\" Baginda menjawab: \"Barangsiapa yang mentaatiku akan masuk syurga, dan barangsiapa yang menderhakaiku, dialah yang enggan (untuk masuk ke dalamnya).\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا فُلَيْحٌ، حَدَّثَنَا هِلاَلُ بْنُ عَلِيٍّ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ كُلُّ أُمَّتِي يَدْخُلُونَ الْجَنَّةَ، إِلاَّ مَنْ أَبَى ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَمَنْ يَأْبَى قَالَ ‏\"‏ مَنْ أَطَاعَنِي دَخَلَ الْجَنَّةَ، وَمَنْ عَصَانِي فَقَدْ أَبَى ‏\"‏‏.‏"
      },
      {
        "id": 6980,
        "hadith_number": "7281",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Misi Para Malaikat dan Perumpamaan Syurga",
        "perawi_melayu": "Jabir bin Abdullah رضي الله عنه",
        "english_text": "Some angels came to the Prophet (ﷺ) while he was sleeping. Some of them said, \"He is sleeping.\" Others said, \"His eyes are sleeping but his heart is awake.\" Then they said, \"There is an example for this companion of yours.\" One of them said, \"Then set forth an example for him.\" Some of them said, \"He is sleeping.\" The others said, \"His eyes are sleeping but his heart is awake.\" Then they said, \"His example is that of a man who has built a house and then offered therein a banquet and sent an inviter (messenger) to invite the people. So whoever accepted the invitation of the inviter, entered the house and ate of the banquet, and whoever did not accept the invitation of the inviter, did not enter the house, nor did he eat of the banquet.\" Then the angels said, \"Interpret this example to him so that he may understand it.\" Some of them said, \"He is sleeping.'' The others said, \"His eyes are sleeping but his heart is awake.\" And then they said, \"The houses stands for Paradise and the call maker is Muhammad; and whoever obeys Muhammad, obeys Allah; and whoever disobeys Muhammad, disobeys Allah. Muhammad separated the people (i.e., through his message, the good is distinguished from the bad, and the believers from the disbelievers). Similarly, Saeed bin Abu Hilal has reported from Hadrat Jabir that Allah Apostle ﷺ came to us.",
        "malay_translation": "Beberapa malaikat datang kepada Nabi ﷺ ketika baginda sedang tidur. Sebahagian daripada mereka berkata, \"Baginda sedang tidur.\"  Yang lain berkata, \"Mata baginda tidur, tetapi hati baginda jaga.\" Kemudian mereka berkata, \"Ada perumpamaan untuk sahabatmu ini.\" Seorang daripada mereka berkata, \"Maka sampaikanlah perumpamaan itu kepadanya.\" Sebahagian daripada mereka berkata, \"Baginda sedang tidur.\" Yang lain berkata, \"Mata baginda tidur, tetapi hati baginda jaga.\" Kemudian mereka berkata, \"Perumpamaannya seperti seorang lelaki yang telah membina sebuah rumah, kemudian menyediakan kenduri di dalamnya dan menghantar seorang penyambut tetamu untuk menjemput orang ramai.  Barangsiapa yang menerima jemputan penyambut tetamu itu, dia akan masuk ke rumah dan makan daripada kenduri itu, dan barangsiapa yang tidak menerima jemputan penyambut tetamu itu, dia tidak akan masuk ke rumah itu dan tidak akan makan daripada kenduri itu.\" Kemudian para malaikat berkata, \"Tafsirkan perumpamaan ini kepadanya supaya dia memahaminya.\" Sebahagian daripada mereka berkata, \"Baginda sedang tidur.\" Yang lain berkata, \"Mata baginda tidur, tetapi hati baginda jaga.\" Dan kemudian mereka berkata, \"Rumah itu melambangkan Syurga dan penyambut tetamu itu ialah Muhammad; dan barangsiapa yang mentaati Muhammad, dia mentaati Allah; dan barangsiapa yang menderhaka kepada Muhammad, dia menderhaka kepada Allah. Muhammad telah memisahkan manusia (iaitu, melalui risalahnya, yang baik dibezakan daripada yang buruk, dan orang beriman daripada orang kafir). Begitu juga, Saeed bin Abu Hilal telah meriwayatkan daripada Hadrat Jabir bahawa Rasulullah ﷺ telah datang kepada kami.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبَادَةَ، أَخْبَرَنَا يَزِيدُ، حَدَّثَنَا سَلِيمُ بْنُ حَيَّانَ ـ وَأَثْنَى عَلَيْهِ ـ حَدَّثَنَا سَعِيدُ بْنُ مِينَاءَ، حَدَّثَنَا أَوْ، سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ جَاءَتْ مَلاَئِكَةٌ إِلَى النَّبِيِّ صلى الله عليه وسلم وَهْوَ نَائِمٌ فَقَالَ بَعْضُهُمْ إِنَّهُ نَائِمٌ‏.‏ وَقَالَ بَعْضُهُمْ إِنَّ الْعَيْنَ نَائِمَةٌ وَالْقَلْبَ يَقْظَانُ‏.‏ فَقَالُوا إِنَّ لِصَاحِبِكُمْ هَذَا مَثَلاً فَاضْرِبُوا لَهُ مَثَلاً‏.‏ فَقَالَ بَعْضُهُمْ إِنَّهُ نَائِمٌ‏.‏ وَقَالَ بَعْضُهُمْ إِنَّ الْعَيْنَ نَائِمَةٌ وَالْقَلْبَ يَقْظَانُ‏.‏ فَقَالُوا مَثَلُهُ كَمَثَلِ رَجُلٍ بَنَى دَارًا، وَجَعَلَ فِيهَا مَأْدُبَةً وَبَعَثَ دَاعِيًا، فَمَنْ أَجَابَ الدَّاعِيَ دَخَلَ الدَّارَ وَأَكَلَ مِنَ الْمَأْدُبَةِ، وَمَنْ لَمْ يُجِبِ الدَّاعِيَ لَمْ يَدْخُلِ الدَّارَ وَلَمْ يَأْكُلْ مِنَ الْمَأْدُبَةِ‏.‏ فَقَالُوا أَوِّلُوهَا لَهُ يَفْقَهْهَا فَقَالَ بَعْضُهُمْ إِنَّهُ نَائِمٌ‏.‏ وَقَالَ بَعْضُهُمْ إِنَّ الْعَيْنَ نَائِمَةٌ وَالْقَلْبَ يَقْظَانُ‏.‏ فَقَالُوا فَالدَّارُ الْجَنَّةُ، وَالدَّاعِي مُحَمَّدٌ صلى الله عليه وسلم فَمَنْ أَطَاعَ مُحَمَّدًا صلى الله عليه وسلم فَقَدْ أَطَاعَ اللَّهَ، وَمَنْ عَصَى مُحَمَّدًا صلى الله عليه وسلم فَقَدْ عَصَى اللَّهَ، وَمُحَمَّدٌ صلى الله عليه وسلم فَرْقٌ بَيْنَ النَّاسِ‏.‏ تَابَعَهُ قُتَيْبَةُ عَنْ لَيْثٍ، عَنْ خَالِدٍ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ جَابِرٍ، خَرَجَ عَلَيْنَا النَّبِيُّ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 6981,
        "hadith_number": "7282",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Petunjuk Kepada Qurra'",
        "perawi_melayu": "Riwayat Hudhaifah رضي الله عنه :",
        "english_text": "\"O the Group of Al-Qurra! Follow the straight path, for then you have taken a great lead (and will be the leaders), but if you divert right or left, then you will go astray far away.\"",
        "malay_translation": "\"Wahai sekumpulan Qurra'! Ikutlah jalan yang lurus, kerana dengan itu kamu telah mengambil pimpinan yang besar (dan akan menjadi pemimpin), tetapi jika kamu menyimpang ke kanan atau ke kiri, maka kamu akan sesat jauh sekali.\"",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ هَمَّامٍ، عَنْ حُذَيْفَةَ، قَالَ يَا مَعْشَرَ الْقُرَّاءِ اسْتَقِيمُوا فَقَدْ سُبِقْتُمْ سَبْقًا بَعِيدًا فَإِنْ أَخَذْتُمْ يَمِينًا وَشِمَالاً، لَقَدْ ضَلَلْتُمْ ضَلاَلاً بَعِيدًا‏.‏"
      },
      {
        "id": 6982,
        "hadith_number": "7283",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Contoh Peringatan Nabi SAW dan Akibatnya",
        "perawi_melayu": "Abu Musa al-Ash'ari",
        "english_text": "The Prophet (ﷺ) said, \"My example and the example of what I have been sent with is that of a man who came to some people and said, 'O people! I have seen the enemy's army with my own eyes, and I am the naked warner; so protect yourselves!' Then a group of his people obeyed him and fled at night proceeding stealthily till they were safe, while another group of them disbelieved him and stayed at their places till morning when the army came upon them, and killed and ruined them completely So this is the example of that person who obeys me and follows what I have brought (the Qur'an and the Sunna), and the example of the one who disobeys me and disbelieves the truth I have brought.\"",
        "malay_translation": "Nabi SAW bersabda: \"Contohku dan contoh apa yang aku diutuskan dengannya adalah seperti seorang lelaki yang datang kepada suatu kaum dan berkata, 'Wahai manusia! Aku telah melihat tentera musuh dengan mataku sendiri, dan aku adalah pemberi amaran yang telanjang; maka lindungilah diri kamu!' Kemudian, sekelompok kaumnya mematuhinya dan melarikan diri pada waktu malam secara senyap-senyap sehingga mereka selamat, manakala sekelompok kaumnya yang lain mendustakannya dan tetap berada di tempat mereka sehingga pagi hari apabila tentera itu datang kepada mereka, lalu membunuh dan membinasakan mereka sama sekali.  Maka, inilah contoh orang yang mentaatiku dan mengikuti apa yang telah ku bawa (Al-Quran dan Sunnah), dan inilah contoh orang yang menderhakaiku dan mendustakan kebenaran yang telah kubawa.\"",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّمَا مَثَلِي وَمَثَلُ مَا بَعَثَنِي اللَّهُ بِهِ كَمَثَلِ رَجُلٍ أَتَى قَوْمًا فَقَالَ يَا قَوْمِ إِنِّي رَأَيْتُ الْجَيْشَ بِعَيْنَىَّ، وَإِنِّي أَنَا النَّذِيرُ الْعُرْيَانُ فَالنَّجَاءَ‏.‏ فَأَطَاعَهُ طَائِفَةٌ مِنْ قَوْمِهِ فَأَدْلَجُوا، فَانْطَلَقُوا عَلَى مَهَلِهِمْ فَنَجَوْا، وَكَذَّبَتْ طَائِفَةٌ مِنْهُمْ فَأَصْبَحُوا مَكَانَهُمْ، فَصَبَّحَهُمُ الْجَيْشُ، فَأَهْلَكَهُمْ وَاجْتَاحَهُمْ، فَذَلِكَ مَثَلُ مَنْ أَطَاعَنِي، فَاتَّبَعَ مَا جِئْتُ بِهِ، وَمَثَلُ مَنْ عَصَانِي وَكَذَّبَ بِمَا جِئْتُ بِهِ مِنَ الْحَقِّ ‏\"‏‏.‏"
      },
      {
        "id": 6983,
        "hadith_number": "7284, 7285",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Peperangan Riddah dan Sikap Abu Bakar",
        "perawi_melayu": "Riwayat Abu Hurairah رضي الله عنه :",
        "english_text": "When Allah's Messenger (ﷺ) died and Abu Bakr رضي الله عنه was elected as a Caliph after him, some of the Arabs reverted to disbelief, `Umar رضي الله عنه said to Abu Bakr رضي الله عنه , \"How dare you fight the people while Allah's Messenger (ﷺ) said, 'I have been ordered to fight the people till they say: None has the right to be worshipped but Allah. And whoever says: None has the right to be worshipped but Allah, saves his wealth and his life from me unless he deserves a legal punishment lusty, and his account will be with Allah.' \" Abu Bakr رضي الله عنه said, \"By Allah, I will fight him who discriminates between Zakat and prayers, for Zakat is the Compulsory right to be taken from the wealth By Allah, if they refuse to give me even a tying rope which they use to give to Allah's Messenger (ﷺ), I would fight them for withholding it.\" `Umar رضي الله عنه said, \"By Allah, It was nothing, except I saw that Allah had opened the chest of Abu Bakr رضي الله عنه to the fight, and I came to know for certain that was the truth.\" Abu Bakir and Abdullah bin Saleh called Layth  عنعقا (instead of ``Aqla'' meaning goat kid) and this is more correct.",
        "malay_translation": "Apabila Rasulullah ﷺ wafat dan Abu Bakar رضي الله عنه dilantik sebagai Khalifah selepas baginda, sebahagian daripada orang Arab kembali murtad. Umar رضي الله عنه berkata kepada Abu Bakar رضي الله عنه, \"Bagaimana berani engkau memerangi mereka sedangkan Rasulullah ﷺ bersabda, 'Aku telah di perintahkan untuk memerangi manusia sehingga mereka berkata: Tiada Tuhan yang berhak disembah melainkan Allah. Dan sesiapa yang berkata: Tiada Tuhan yang berhak disembah melainkan Allah, maka akan selamat hartanya dan nyawanya daripada ku, kecuali jika dia layak menerima hukuman yang di tetapkan oleh syarak, dan perhitungannya adalah bersama Allah.'\" Abu Bakar رضي الله عنه berkata, \"Demi Allah, aku akan memerangi sesiapa yang membezakan antara Zakat dan solat, kerana Zakat adalah hak wajib yang diambil daripada harta. Demi Allah, jika mereka enggan memberi aku walaupun tali yang mereka gunakan untuk memberi kepada Rasulullah ﷺ, nescaya aku akan memerangi mereka kerana menahannya.\" Umar رضي الله عنه berkata, \"Demi Allah, ia bukanlah apa-apa melainkan aku melihat bahawa Allah telah membuka dada Abu Bakar رضي الله عنه untuk berperang, dan aku mengetahui dengan pasti bahawa itulah kebenaran.\" Abu Bakar dan Abdullah bin Saleh memanggil Layth  عنعقا (bukan  ``Aqla'' yang bermaksud anak kambing) dan ini lebih tepat.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ عُقَيْلٍ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ لَمَّا تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَاسْتُخْلِفَ أَبُو بَكْرٍ بَعْدَهُ، وَكَفَرَ مَنْ كَفَرَ مِنَ الْعَرَبِ قَالَ عُمَرُ لأَبِي بَكْرٍ كَيْفَ تُقَاتِلُ النَّاسَ، وَقَدْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ فَمَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ عَصَمَ مِنِّي مَالَهُ وَنَفْسَهُ، إِلاَّ بِحَقِّهِ، وَحِسَابُهُ عَلَى اللَّهِ ‏\"‏‏.‏ فَقَالَ وَاللَّهِ لأُقَاتِلَنَّ مَنْ فَرَّقَ بَيْنَ الصَّلاَةِ وَالزَّكَاةِ، فَإِنَّ الزَّكَاةَ حَقُّ الْمَالِ، وَاللَّهِ لَوْ مَنَعُونِي عِقَالاً كَانُوا يُؤَدُّونَهُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم لَقَاتَلْتُهُمْ عَلَى مَنْعِهِ‏.‏ فَقَالَ عُمَرُ فَوَاللَّهِ مَا هُوَ إِلاَّ أَنْ رَأَيْتُ اللَّهَ قَدْ شَرَحَ صَدْرَ أَبِي بَكْرٍ لِلْقِتَالِ فَعَرَفْتُ أَنَّهُ الْحَقُّ‏.‏ قَالَ ابْنُ بُكَيْرٍ وَعَبْدُ اللَّهِ عَنِ اللَّيْثِ عَنَاقًا‏.‏ وَهْوَ أَصَحُّ‏.‏"
      },
      {
        "id": 6984,
        "hadith_number": "7286",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Umar bin al-Khattab dan Kesabarannya",
        "perawi_melayu": "Riwayat Abdullah bin Abbas رضي الله عنهما",
        "english_text": "Oyainah bin Hisn bin Hodhaifah visited Badr and stayed with his nephew Hur bin Qais bin Hisn, an intimate Companion of Hadrat Umer رضی اللہ عنہ, for the Quran reads old or young would enjoy would Hadrat Umer's company and were the memebers of his Advisory Committee. So, Oyainahsaid to his nephew: Do you have any access to the Believers' Chief? If it is so, get me the permission to meet him. He said: I will soon get you the permission. Hadrat Ibn-e-Abbas رضی اللہ عنہ states: Oyainah was granted the permission. When he entered,he said: O Ibn-e-Khattab! By Allah!you neither grant us wealth nor pass fair judgement in our affairs. Hadrat Umer رضی اللہ عنہ got so much infuriated that he even intended to pounce upon him but Hurr said: O the Believers' Chief! Allah said to the prophet : '(O Beloved!) Adopt forgiveness and bid to do good and turn away from the ignorant.' And undoubtedly, he is amongst the ignorants. The reporter says: By Allah! When he recited this verse, Hadrat Umer رضی اللہ عنہ did not transgress the command, and he would totally withdraw before Allah's Book.",
        "malay_translation": "Oyainah bin Hisn bin Hodhaifah telah mengunjungi Badar dan tinggal bersama anak saudaranya, Hur bin Qais bin Hisn, seorang sahabat karib Hadrat Umar رضي الله عنه.  Al-Quran menyebut bahawa orang tua mahupun muda akan menikmati persahabatan Hadrat Umar dan menjadi ahli Jawatankuasa Penasihatnya.  Maka, Oyainah berkata kepada anak saudaranya: “Adakah engkau mempunyai akses kepada Ketua Orang-orang Beriman? Jika ya, dapatkan kebenaran untukku bertemu dengannya.”  Jawabnya: “Aku akan segera mendapatkan kebenaran untukmu.” Hadrat Ibnu Abbas رضي الله عنه menyatakan: Oyainah diberi kebenaran.  Apabila dia masuk, dia berkata: “Wahai Ibnu Khattab! Demi Allah! Engkau tidak memberi kami kekayaan mahupun memberikan keadilan dalam urusan kami.” Hadrat Umar رضي الله عنه sangat marah sehingga dia ingin menyerang Oyainah, tetapi Hur berkata: “Wahai Ketua Orang-orang Beriman! Allah berfirman kepada Nabi: '(Wahai Kekasihku!) Bermaafanlah dan suruhlah berbuat baik dan berpalinglah daripada orang-orang jahil.' Dan sesungguhnya, dia adalah antara orang-orang jahil.”  Perawi berkata: Demi Allah! Apabila ayat ini dibacakan, Hadrat Umar رضي الله عنه tidak melanggar perintah itu, dan dia akan tunduk sepenuhnya kepada Kitab Allah.",
        "arabic_text": "حَدَّثَنِي إِسْمَاعِيلُ، حَدَّثَنِي ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَدِمَ عُيَيْنَةُ بْنُ حِصْنِ بْنِ حُذَيْفَةَ بْنِ بَدْرٍ فَنَزَلَ عَلَى ابْنِ أَخِيهِ الْحُرِّ بْنِ قَيْسِ بْنِ حِصْنٍ، وَكَانَ مِنَ النَّفَرِ الَّذِينَ يُدْنِيهِمْ عُمَرُ، وَكَانَ الْقُرَّاءُ أَصْحَابَ مَجْلِسِ عُمَرَ وَمُشَاوَرَتِهِ كُهُولاً كَانُوا أَوْ شُبَّانًا فَقَالَ عُيَيْنَةُ لاِبْنِ أَخِيهِ يَا ابْنَ أَخِي هَلْ لَكَ وَجْهٌ عِنْدَ هَذَا الأَمِيرِ فَتَسْتَأْذِنَ لِي عَلَيْهِ قَالَ سَأَسْتَأْذِنُ لَكَ عَلَيْهِ‏.‏ قَالَ ابْنُ عَبَّاسٍ فَاسْتَأْذَنَ لِعُيَيْنَةَ فَلَمَّا دَخَلَ قَالَ يَا ابْنَ الْخَطَّابِ وَاللَّهِ مَا تُعْطِينَا الْجَزْلَ، وَمَا تَحْكُمُ بَيْنَنَا بِالْعَدْلِ‏.‏ فَغَضِبَ عُمَرُ حَتَّى هَمَّ بِأَنْ يَقَعَ بِهِ فَقَالَ الْحُرُّ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّ اللَّهَ تَعَالَى قَالَ لِنَبِيِّهِ صلى الله عليه وسلم ‏{‏خُذِ الْعَفْوَ وَأْمُرْ بِالْعُرْفِ وَأَعْرِضْ عَنِ الْجَاهِلِينَ‏}‏ وَإِنَّ هَذَا مِنَ الْجَاهِلِينَ‏.‏ فَوَاللَّهِ مَا جَاوَزَهَا عُمَرُ حِينَ تَلاَهَا عَلَيْهِ، وَكَانَ وَقَّافًا عِنْدَ كِتَابِ اللَّهِ‏.‏"
      },
      {
        "id": 6985,
        "hadith_number": "7287",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_Hadith": "Ujian di Alam Kubur Semasa Gerhana Matahari",
        "perawi_melayu": "Daripada Asma' binti Abu Bakar رضي الله عنها :",
        "english_text": "I came to `Aisha رضی اللہ عنہا during the solar eclipse. The people were standing (offering prayer) and she too, was standing and offering prayer. I asked, \"What is wrong with the people?\" She pointed towards the sky with her hand and said, Subhan Allah!'' I asked her, \"Is there a sign?\" She nodded with her head meaning, yes. When Allah's Messenger (ﷺ) finished (the prayer), he glorified and praised Allah and said, \"There is not anything that I have not seen before but I have seen now at this place of mine, even Paradise and Hell. It has been revealed to me that you people will be put to trial nearly like the trial of Ad-Dajjal, in your graves. As for the true believer or a Muslim (the sub-narrator is not sure as to which of the two (words Asma' رضی اللہ عنہا had said) he will say, 'Muhammad came with clear signs from Allah, and we responded to him (accepted his teachings) and believed (what he said)' It will be said (to him) 'Sleep in peace; we have known that you were a true believer who believed with certainty.' As for a hypocrite or a doubtful person, (the sub-narrator is not sure as to which word Asma' رضی اللہ عنہا said) he will say, 'I do not know, but I heard the people saying something and so I said the same.' \"",
        "malay_translation": "Aku datang kepada Aisyah رضي الله عنها ketika gerhana matahari.  Orang ramai sedang berdiri (mengerjakan solat) dan beliau juga sedang berdiri dan mengerjakan solat. Aku bertanya, \"Apakah yang berlaku kepada orang ramai?\" Beliau menunjuk ke langit dengan tangannya dan berkata, Subhanallah! Aku bertanya kepadanya, \"Adakah ini satu tanda?\" Beliau mengangguk, bermakna ya. Apabila Rasulullah ﷺ selesai (solat), baginda memuji dan mengagungkan Allah dan berkata, \"Tiada sesuatu pun yang belum pernah aku lihat sebelum ini melainkan aku telah melihatnya sekarang di tempatku ini, bahkan Syurga dan Neraka. Telah diwahyukan kepadaku bahawa kamu akan diuji hampir seperti ujian Dajjal, di dalam kubur kamu.  Bagi orang yang beriman atau Muslim (perawi tidak pasti kata-kata mana yang diucapkan oleh Asma' رضي الله عنها), dia akan berkata, 'Muhammad datang dengan bukti-bukti yang jelas daripada Allah, dan kami telah menyambutnya (menerima ajarannya) dan beriman (kepada apa yang dikatakannya).' Akan dikatakan (kepadanya), 'Tidurlah dengan aman; kami telah mengetahui bahawa engkau adalah seorang mukmin yang beriman dengan penuh keyakinan.' Bagi orang munafik atau yang ragu-ragu (perawi tidak pasti kata-kata mana yang diucapkan oleh Asma' رضي الله عنها), dia akan berkata, 'Aku tidak tahu, tetapi aku mendengar orang ramai berkata sesuatu, maka aku pun berkata yang sama.'",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ، عَنْ أَسْمَاءَ ابْنَةِ أَبِي بَكْرٍ ـ رضى الله عنهما ـ أَنَّهَا قَالَتْ أَتَيْتُ عَائِشَةَ حِينَ خَسَفَتِ الشَّمْسُ، وَالنَّاسُ قِيَامٌ وَهْىَ قَائِمَةٌ تُصَلِّي فَقُلْتُ مَا لِلنَّاسِ فَأَشَارَتْ بِيَدِهَا نَحْوَ السَّمَاءِ فَقَالَتْ سُبْحَانَ اللَّهِ‏.‏ فَقُلْتُ آيَةٌ‏.‏ قَالَتْ بِرَأْسِهَا أَنْ نَعَمْ‏.‏ فَلَمَّا انْصَرَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏ \"‏ مَا مِنْ شَىْءٍ لَمْ أَرَهُ إِلاَّ وَقَدْ رَأَيْتُهُ فِي مَقَامِي، حَتَّى الْجَنَّةَ وَالنَّارَ، وَأُوحِيَ إِلَىَّ أَنَّكُمْ تُفْتَنُونَ فِي الْقُبُورِ قَرِيبًا مِنْ فِتْنَةِ الدَّجَّالِ، فَأَمَّا الْمُؤْمِنُ ـ أَوِ الْمُسْلِمُ لاَ أَدْرِي أَىَّ ذَلِكَ قَالَتْ أَسْمَاءُ ـ فَيَقُولُ مُحَمَّدٌ جَاءَنَا بِالْبَيِّنَاتِ فَأَجَبْنَا وَآمَنَّا‏.‏ فَيُقَالُ نَمْ صَالِحًا عَلِمْنَا أَنَّكَ مُوقِنٌ‏.‏ وَأَمَّا الْمُنَافِقُ ـ أَوِ الْمُرْتَابُ لاَ أَدْرِي أَىَّ ذَلِكَ قَالَتْ أَسْمَاءُ ـ فَيَقُولُ لاَ أَدْرِي سَمِعْتُ النَّاسَ يَقُولُونَ شَيْئًا فَقُلْتُهُ ‏\"‏‏.‏"
      },
      {
        "id": 6986,
        "hadith_number": "7288",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ikut Ajaran Nabi dan Tinggalkan Perkara Haram",
        "perawi_melayu": "Abu Hurairah رضي الله عنه:",
        "english_text": "The Prophet (ﷺ) said, \"Leave me as I leave you, for the people who were before you were ruined because of their questions and their differences over their prophets. So, if I forbid you to do something, then keep away from it. And if I order you to do something, then do of it as much as you can.\"",
        "malay_translation": "Rasulullah ﷺ bersabda: \"Tinggalkan aku sebagaimana aku meninggalkan kamu, kerana umat-umat sebelum kamu telah binasa disebabkan oleh persoalan-persoalan mereka dan perbezaan pendapat mereka tentang nabi-nabi mereka. Oleh itu, jika aku melarang kamu daripada melakukan sesuatu, maka jauhilah ia. Dan jika aku memerintahkan kamu melakukan sesuatu, maka lakukanlah seberapa banyak yang kamu mampu.\"",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ دَعُونِي مَا تَرَكْتُكُمْ، إِنَّمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ بِسُؤَالِهِمْ وَاخْتِلاَفِهِمْ عَلَى أَنْبِيَائِهِمْ، فَإِذَا نَهَيْتُكُمْ عَنْ شَىْءٍ فَاجْتَنِبُوهُ، وَإِذَا أَمَرْتُكُمْ بِأَمْرٍ فَأْتُوا مِنْهُ مَا اسْتَطَعْتُمْ ‏\"‏‏.‏"
      },
      {
        "id": 6987,
        "hadith_number": "7289",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Dosa Bertanya Mengenai Perkara Yang Belum Dilarang",
        "perawi_melayu": "Riwayat Sa'd bin Abi Waqqas:",
        "english_text": "The Prophet (ﷺ) said, \"The most sinful person among the Muslims is the one who asked about something which had not been prohibited, but was prohibited because of his asking.\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Orang yang paling berdosa di kalangan umat Islam ialah orang yang bertanya tentang sesuatu yang belum diharamkan, tetapi diharamkan disebabkan pertanyaannya.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ، حَدَّثَنَا سَعِيدٌ، حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ أَعْظَمَ الْمُسْلِمِينَ جُرْمًا مَنْ سَأَلَ عَنْ شَىْءٍ لَمْ يُحَرَّمْ، فَحُرِّمَ مِنْ أَجْلِ مَسْأَلَتِهِ ‏\"‏‏.‏"
      },
      {
        "id": 6988,
        "hadith_number": "7290",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Tarawih di Rumah",
        "perawi_melayu": "Riwayat Zaid bin Thabit رضي الله عنه :",
        "english_text": "The Prophet (ﷺ) took a room made of date palm leaves mats in the mosque. Allah's Messenger (ﷺ) prayed in it for a few nights till the people gathered (to pray the night prayer (Tarawih) (behind him.) Then on the 4th night the people did not hear his voice and they thought he had slept, so some of them started humming in order that he might come out. The Prophet (ﷺ) then said, \"You continued doing what I saw you doing till I was afraid that this (Tarawih prayer) might be enjoined on you, and if it were enjoined on you, you would not continue performing it. Therefore, O people! Perform your prayers at your homes, for the best prayer of a person is what is performed at his home except the compulsory congregational) prayer.\" (See Hadith No. 229,Vol. 3) (See Hadith No. 134, Vol. 8)",
        "malay_translation": "Nabi ﷺ mengambil sebuah bilik di masjid yang diperbuat daripada tikar daun kurma. Rasulullah ﷺ mendirikan solat di dalamnya selama beberapa malam sehingga orang ramai berkumpul (untuk mendirikan solat malam (Tarawih) di belakang baginda). Kemudian pada malam keempat, orang ramai tidak mendengar suara baginda dan mereka menyangka baginda telah tidur, lalu sebahagian daripada mereka mula bersenandung agar baginda keluar. Nabi ﷺ kemudian bersabda, \"Kamu terus melakukan apa yang aku lihat kamu lakukan sehingga aku bimbang bahawa solat Tarawih ini akan diwajibkan ke atas kamu, dan jika ia diwajibkan ke atas kamu, nescaya kamu tidak akan dapat meneruskannya. Oleh itu, wahai sekalian manusia! Dirikanlah solat kamu di rumah masing-masing, kerana solat yang paling baik bagi seseorang adalah solat yang dikerjakan di rumahnya kecuali solat fardu berjemaah.\" (Rujuk Hadis No. 229, Jilid 3) (Rujuk Hadis No. 134, Jilid 8)",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا عَفَّانُ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، سَمِعْتُ أَبَا النَّضْرِ، يُحَدِّثُ عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ زَيْدِ بْنِ ثَابِتٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم اتَّخَذَ حُجْرَةً فِي الْمَسْجِدِ مِنْ حَصِيرٍ، فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم فِيهَا لَيَالِيَ، حَتَّى اجْتَمَعَ إِلَيْهِ نَاسٌ، ثُمَّ فَقَدُوا صَوْتَهُ لَيْلَةً فَظَنُّوا أَنَّهُ قَدْ نَامَ، فَجَعَلَ بَعْضُهُمْ يَتَنَحْنَحُ لِيَخْرُجَ إِلَيْهِمْ فَقَالَ ‏ \"‏ مَا زَالَ بِكُمُ الَّذِي رَأَيْتُ مِنْ صَنِيعِكُمْ، حَتَّى خَشِيتُ أَنْ يُكْتَبَ عَلَيْكُمْ، وَلَوْ كُتِبَ عَلَيْكُمْ مَا قُمْتُمْ بِهِ فَصَلُّوا أَيُّهَا النَّاسُ فِي بُيُوتِكُمْ، فَإِنَّ أَفْضَلَ صَلاَةِ الْمَرْءِ فِي بَيْتِهِ، إِلاَّ الصَّلاَةَ الْمَكْتُوبَةَ ‏\"‏‏.‏"
      },
      {
        "id": 6989,
        "hadith_number": "7291",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menentukan Bapa Melalui Rasulullah SAW",
        "perawi_melayu": "Abu Musa Al-Ash'ari رضي الله عنه",
        "english_text": "Allah's Messenger (ﷺ) was asked about things which he disliked, and when the people asked too many questions, he became angry and said, \"Ask me (any question).\" A man got up and said, \"O Allah's Apostle! Who is my father?\" The Prophet (ﷺ) replied, \"Your father is Hudhaifa.\" Then another man got up and said, \"O Allah's Messenger (ﷺ)! Who is my father?\" The Prophet (ﷺ) said, \"Your father is Salim, Maula Shaiba.\" When `Umar saw the signs of anger on the face of Allah's Messenger (ﷺ), he said, \"We repent to Allah.\"",
        "malay_translation": "Rasulullah SAW ditanya tentang perkara-perkara yang baginda tidak suka, dan apabila orang ramai bertanya terlalu banyak soalan, baginda marah dan bersabda, \"Tanyalah aku (apa sahaja soalan).\"  Seorang lelaki bangun dan berkata, \"Wahai Rasulullah! Siapakah bapaku?\" Nabi SAW menjawab, \"Bapamu ialah Hudhaifa.\" Kemudian seorang lelaki lagi bangun dan berkata, \"Wahai Rasulullah! Siapakah bapaku?\" Nabi SAW bersabda, \"Bapamu ialah Salim, Maula Shaiba.\"  Apabila Umar melihat tanda-tanda kemarahan di wajah Rasulullah SAW, beliau berkata, \"Kami bertaubat kepada Allah.\"",
        "arabic_text": "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، قَالَ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَشْيَاءَ كَرِهَهَا، فَلَمَّا أَكْثَرُوا عَلَيْهِ الْمَسْأَلَةَ غَضِبَ وَقَالَ ‏\"‏ سَلُونِي ‏\"‏‏.‏ فَقَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ مَنْ أَبِي قَالَ ‏\"‏ أَبُوكَ حُذَافَةُ ‏\"‏‏.‏ ثُمَّ قَامَ آخَرُ فَقَالَ يَا رَسُولَ اللَّهِ مَنْ أَبِي فَقَالَ ‏\"‏ أَبُوكَ سَالِمٌ مَوْلَى شَيْبَةَ ‏\"‏‏.‏ فَلَمَّا رَأَى عُمَرُ مَا بِوَجْهِ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنَ الْغَضَبِ قَالَ إِنَّا نَتُوبُ إِلَى اللَّهِ عَزَّ وَجَلَّ‏.‏"
      },
      {
        "id": 6990,
        "hadith_number": "7292",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Doa Selepas Solat & Larangan Rasulullah",
        "perawi_melayu": "Riwayat Warrad:",
        "english_text": "(The clerk of Al-Mughira) Muawiya wrote to Al-Mughira رضي الله عنه 'Write to me what you have heard from Allah's Messenger (ﷺ).' So he (Al-Mughira) wrote to him: Allah's Prophet used to say at the end of each prayer: \"La ilaha illalla-h wahdahu la sharika lahu, lahul Mulku, wa lahul Hamdu wa hula ala kulli shai'in qadir. 'Allahumma la mani' a lima a'taita, wala mu'tiya lima mana'ta, wala yanfa'u dhuljadd minkal-jadd.\" He also wrote to him that the Prophet (ﷺ) used to forbid (1) Qil and Qal (idle useless talk or that you talk too much about others), (2) Asking too many questions (in disputed Religious matters); (3) And wasting one's wealth by extravagance; (4) and to be undutiful to one's mother (5) and to bury the daughters alive (6) and to prevent your favors (benevolence to others (i.e. not to pay the rights of others (7) And asking others for something (except when it is unavoidable).",
        "malay_translation": "Muawiyah (kerani Al-Mughirah) menulis kepada Al-Mughirah رضي الله عنه,  \"Tuliskan kepadaku apa yang engkau telah dengar daripada Rasulullah ﷺ.\" Maka Al-Mughirah menulis kepadanya: Rasulullah ﷺ biasa berdoa di akhir setiap solat:  \"La ilaha illallah wahdahu la sharika lahul mulku wa lahul hamdu wa huwa 'ala kulli syai'in qadir. Allahumma la mani'a lima a'taita wala mu'tiya lima mana'ta wala yanfa'u dhuljadd minkal-jadd.\"  Beliau juga menulis bahawa Nabi ﷺ melarang: (1) Qil dan Qal (cakap-cakap yang sia-sia atau terlalu banyak bercakap tentang orang lain), (2) Terlalu banyak bertanya (dalam perkara-perkara agama yang berselisih), (3) Membazirkan harta kekayaan dengan sikap berlebih-lebihan, (4) Derhaka kepada ibu, (5) Menguburkan anak perempuan hidup-hidup, (6) Menahan pemberian ihsan (tidak memberikan hak orang lain), dan (7) Meminta-minta kepada orang lain (kecuali jika sangat terpaksa).",
        "arabic_text": "حَدَّثَنَا مُوسَى، حَدَّثَنَا أَبُو عَوَانَةَ، حَدَّثَنَا عَبْدُ الْمَلِكِ، عَنْ وَرَّادٍ، كَاتِبِ الْمُغِيرَةِ قَالَ كَتَبَ مُعَاوِيَةُ إِلَى الْمُغِيرَةِ اكْتُبْ إِلَىَّ مَا سَمِعْتَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَكَتَبَ إِلَيْهِ إِنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم كَانَ يَقُولُ فِي دُبُرِ كُلِّ صَلاَةٍ ‏ \"‏ لاَ إِلَهَ إِلاَّ اللَّهُ، وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهْوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ، اللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ ‏\"‏‏.‏ وَكَتَبَ إِلَيْهِ إِنَّهُ كَانَ يَنْهَى عَنْ قِيلَ وَقَالَ، وَكَثْرَةِ السُّؤَالِ، وَإِضَاعَةِ الْمَالِ، وَكَانَ يَنْهَى عَنْ عُقُوقِ الأُمَّهَاتِ وَوَأْدِ الْبَنَاتِ وَمَنْعٍ وَهَاتِ‏.‏"
      },
      {
        "id": 6991,
        "hadith_number": "7293",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Melakukan Tugas Berat Melebihi Kemampuan",
        "perawi_melayu": "Anas رضي الله عنه :",
        "english_text": "We were with `Umar رضی اللہ عنہ and he said, \"We have been forbidden to undertake a difficult task beyond our capability (i.e. to exceed the religious limits e.g., to clean the inside of the eyes while doing ablution).",
        "malay_translation": "Kami berada bersama Umar رضي الله عنه, dan baginda berkata, \"Kita telah dilarang melakukan tugas yang berat melebihi kemampuan kita (iaitu, melampaui batas-batas agama, contohnya: membersihkan bahagian dalam mata ketika berwuduk).",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ كُنَّا عِنْدَ عُمَرَ فَقَالَ نُهِينَا عَنِ التَّكَلُّفِ‏.‏"
      },
      {
        "id": 6992,
        "hadith_number": "7294",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Soal Jawab dengan Rasulullah SAW sebelum Kiamat",
        "perawi_melayu": "Anas bin Malik رضي الله عنه :",
        "english_text": "The Prophet (ﷺ) came out after the sun had declined and offered the Zuhr prayer (in congregation). After finishing it with Taslim, he stood on the pulpit and mentioned the Hour and mentioned there would happen great events before it. Then he said, \"Whoever wants to ask me any question, may do so, for by Allah, you will not ask me about anything but I will inform you of its answer as long as I am at this place of mine.\" On this, the Ansar wept violently, and Allah's Messenger (ﷺ) kept on saying, \"Ask Me! \" Then a man got up and asked, ''Where will my entrance be, O Allah's Messenger (ﷺ)?\" The Prophet (ﷺ) said, \"(You will go to) the Fire.\" Then `Abdullah bin Hudhaifa got up and asked, \"Who is my father, O Allah's Messenger (ﷺ)?\" The Prophet (ﷺ) replied, \"Your father is Hudhaifa رضی اللہ عنہ .\" The Prophet (ﷺ) then kept on saying (angrily), \"Ask me! Ask me!\" `Umar رضی اللہ عنہ then knelt on his knees and said, \"We have accepted Allah as our Lord and Islam as our religion and Muhammad as an Apostle.\" Allah's Messenger (ﷺ) became quiet when `Umar رضی اللہ عنہ said that. Then Allah's Messenger (ﷺ) said, \"By Him in Whose Hand my life is, Paradise and Hell were displayed before me across this wall while I was praying, and I never saw such good and evil as I have seen today.\"",
        "malay_translation": "Rasulullah SAW keluar setelah matahari condong dan menunaikan solat Zohor secara berjemaah. Selepas selesai dengan memberi salam, baginda berdiri di atas mimbar dan menyebut tentang Hari Kiamat serta peristiwa-peristiwa besar yang akan berlaku sebelum kedatangannya. Kemudian baginda bersabda, \"Barangsiapa yang ingin bertanya sesuatu kepadaKu, bertanyalah, demi Allah, kamu tidak akan bertanya kepadaKu tentang sesuatu pun melainkan Aku akan memberimu jawapannya selagi Aku berada di tempatKu ini.\"  Mendengar ini, kaum Ansar menangis tersedu-sedu, dan Rasulullah SAW terus berkata, \"Bertanyalah kepadaKu!\" Kemudian seorang lelaki bangun dan bertanya, \"Ke manakah tempat masukku, wahai Rasulullah SAW?\" Rasulullah SAW menjawab, \"(Engkau akan masuk ke) Neraka.\" Kemudian Abdullah bin Hudhaifa bangun dan bertanya, \"Siapakah ayahku, wahai Rasulullah SAW?\" Rasulullah SAW menjawab, \"Ayahmu ialah Hudhaifa رضي الله عنه.\"  Rasulullah SAW kemudian terus berkata (dengan nada marah), \"Bertanyalah kepadaKu! Bertanyalah kepadaKu!\" Umar رضي الله عنه kemudian sujud dan berkata, \"Kami telah menerima Allah sebagai Tuhan kami dan Islam sebagai agama kami dan Muhammad sebagai Rasul.\" Rasulullah SAW menjadi tenang apabila Umar رضي الله عنه berkata demikian. Kemudian Rasulullah SAW bersabda, \"Demi Zat yang di tangan-Nya jiwaku berada, Syurga dan Neraka telah ditunjukkan kepadaku di seberang tembok ini ketika aku sedang solat, dan aku tidak pernah melihat kebaikan dan kejahatan seperti yang aku lihat pada hari ini.\"",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ،‏.‏ وَحَدَّثَنِي مَحْمُودٌ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه‏.‏ أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ حِينَ زَاغَتِ الشَّمْسُ فَصَلَّى الظُّهْرَ فَلَمَّا سَلَّمَ قَامَ عَلَى الْمِنْبَرِ فَذَكَرَ السَّاعَةَ، وَذَكَرَ أَنَّ بَيْنَ يَدَيْهَا أُمُورًا عِظَامًا ثُمَّ قَالَ ‏\"‏ مَنْ أَحَبَّ أَنْ يَسْأَلَ عَنْ شَىْءٍ فَلْيَسْأَلْ عَنْهُ، فَوَاللَّهِ لاَ تَسْأَلُونِي عَنْ شَىْءٍ إِلاَّ أَخْبَرْتُكُمْ بِهِ، مَا دُمْتُ فِي مَقَامِي هَذَا ‏\"‏‏.‏ قَالَ أَنَسٌ فَأَكْثَرَ النَّاسُ الْبُكَاءَ، وَأَكْثَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَقُولَ ‏\"‏ سَلُونِي ‏\"‏‏.‏ فَقَالَ أَنَسٌ فَقَامَ إِلَيْهِ رَجُلٌ فَقَالَ أَيْنَ مَدْخَلِي يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ النَّارُ ‏\"‏‏.‏ فَقَامَ عَبْدُ اللَّهِ بْنُ حُذَافَةَ فَقَالَ مَنْ أَبِي يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ أَبُوكَ حُذَافَةُ ‏\"‏‏.‏ قَالَ ثُمَّ أَكْثَرَ أَنْ يَقُولَ ‏\"‏ سَلُونِي سَلُونِي ‏\"‏‏.‏ فَبَرَكَ عُمَرُ عَلَى رُكْبَتَيْهِ فَقَالَ رَضِينَا بِاللَّهِ رَبًّا، وَبِالإِسْلاَمِ دِينًا، وَبِمُحَمَّدٍ صلى الله عليه وسلم رَسُولاً‏.‏ قَالَ فَسَكَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ قَالَ عُمَرُ ذَلِكَ، ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لَقَدْ عُرِضَتْ عَلَىَّ الْجَنَّةُ وَالنَّارُ آنِفًا فِي عُرْضِ هَذَا الْحَائِطِ وَأَنَا أُصَلِّي، فَلَمْ أَرَ كَالْيَوْمِ فِي الْخَيْرِ وَالشَّرِّ ‏\"‏‏.‏"
      },
      {
        "id": 6993,
        "hadith_number": "7295",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Mencari Identiti Bapa dan Arahkan kepada Ayat Al-Quran",
        "perawi_melayu": "Anas bin Malik رضي الله عنه",
        "english_text": "A man said, \"O Allah's Prophet! Who is my father?\" The Prophet (ﷺ) said, \"Your father is so-and-so.\" And then the Divine Verse:-- 'O you who believe! Ask not questions about things..(5.101)",
        "malay_translation": "Seorang lelaki berkata, \"Wahai Rasulullah! Siapakah bapa saya?\" Nabi ﷺ bersabda, \"Bapa kamu ialah si fulan.\" Kemudian turun ayat Allah SWT:  'Wahai orang-orang yang beriman! Janganlah kamu bertanya tentang perkara-perkara...' (5:101)",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنِي مُوسَى بْنُ أَنَسٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، قَالَ قَالَ رَجُلٌ يَا نَبِيَّ اللَّهِ مَنْ أَبِي قَالَ ‏\"‏ أَبُوكَ فُلاَنٌ ‏\"‏‏.‏ وَنَزَلَتْ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تَسْأَلُوا عَنْ أَشْيَاءَ‏}‏ الآيَةَ‏.‏"
      },
      {
        "id": 6994,
        "hadith_number": "7296",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Soalan Mengenai Pencipta Allah",
        "perawi_melayu": "Anas bin Malik رضي الله عنه",
        "english_text": "Allah's Messenger (ﷺ) said, \"People will not stop asking questions till they say, 'This is Allah, the Creator of everything, then who created Allah?' \"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Manusia tidak akan berhenti bertanya sehingga mereka berkata, 'Inilah Allah, Pencipta segala sesuatu, lalu siapakah yang menciptakan Allah?' \"",
        "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ صَبَّاحٍ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا وَرْقَاءُ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ، سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَنْ يَبْرَحَ النَّاسُ يَتَسَاءَلُونَ حَتَّى يَقُولُوا هَذَا اللَّهُ خَالِقُ كُلِّ شَىْءٍ فَمَنْ خَلَقَ اللَّهَ ‏\"‏‏.‏"
      },
      {
        "id": 6995,
        "hadith_number": "7297",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pertanyaan Mengenai Roh",
        "perawi_melayu": "Riwayat Ibnu Mas'ud رضي الله عنه:",
        "english_text": "I was with the Prophet (ﷺ) at one of the farms of Medina while he was leaning on a date palm leaf-stalk. He passed by a group of Jews and some of them said to the other, Ask him (the Prophet) about the spirit. Some others said, \"Do not ask him, lest he should tell you what you dislike\" But they went up to him and said, \"O Abal Qasim! Inform us bout the spirit.\" The Prophet (ﷺ) stood up for a while, waiting. I realized that he was being Divinely Inspired, so I kept away from him till the inspiration was over. Then the Prophet (ﷺ) said, \"(O Muhammad) they ask you regarding the spirit, Say: The spirit its knowledge is with my Lord (i.e., nobody has its knowledge except Allah)\" (17.85)",
        "malay_translation": "Aku berada bersama Nabi ﷺ di salah sebuah ladang di Madinah ketika baginda bersandar pada pelepah kurma. Baginda lalu berdekatan dengan sekumpulan Yahudi dan sebahagian daripada mereka berkata kepada yang lain, \"Tanya baginda (Nabi) tentang roh.\" Sebahagian yang lain berkata, \"Jangan tanya baginda, bimbang baginda memberitahu kamu apa yang kamu tidak sukai.\"  Tetapi mereka menghampiri baginda dan berkata, \"Wahai Abul Qasim! Beritakan kepada kami tentang roh.\" Nabi ﷺ berdiri seketika, menunggu. Aku sedar bahawa baginda sedang diilhamkan secara Ilahi, maka aku menjauhkan diri daripada baginda sehingga ilham itu selesai. Kemudian Nabi ﷺ bersabda, \"(Wahai Muhammad) mereka bertanya kepadamu tentang roh, katakanlah: Ilmu tentang roh itu hanya di sisi Tuhanku (iaitu, tiada siapa yang mengetahui tentangnya kecuali Allah)\" (17:85)",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ بْنِ مَيْمُونٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنِ ابْنِ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ كُنْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي حَرْثٍ بِالْمَدِينَةِ، وَهْوَ يَتَوَكَّأُ عَلَى عَسِيبٍ، فَمَرَّ بِنَفَرٍ مِنَ الْيَهُودِ فَقَالَ بَعْضُهُمْ سَلُوهُ عَنِ الرُّوحِ‏.‏ وَقَالَ بَعْضُهُمْ لاَ تَسْأَلُوهُ لاَ يُسْمِعْكُمْ مَا تَكْرَهُونَ‏.‏ فَقَامُوا إِلَيْهِ فَقَالُوا يَا أَبَا الْقَاسِمِ حَدِّثْنَا عَنِ الرُّوحِ‏.‏ فَقَامَ سَاعَةً يَنْظُرُ فَعَرَفْتُ أَنَّهُ يُوحَى إِلَيْهِ، فَتَأَخَّرْتُ عَنْهُ حَتَّى صَعِدَ الْوَحْىُ، ثُمَّ قَالَ ‏{‏وَيَسْأَلُونَكَ عَنِ الرُّوحِ قُلِ الرُّوحُ مِنْ أَمْرِ رَبِّي‏}‏‏.‏"
      },
      {
        "id": 6996,
        "hadith_number": "7298",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi SAW dan Cincin Emas",
        "perawi_melayu": "Riwayat Ibnu Umar رضي الله عنهما:",
        "english_text": "The Prophet (ﷺ) wore a gold ring and then the people followed him and wore gold rings too. Then the Prophet said, \"I had this golden ring made for myself. He then threw it away and said, \"I shall never put it on.\" Thereupon the people also threw their rings away.",
        "malay_translation": "Rasulullah SAW memakai cincin emas, lalu orang ramai mengikutinya dan turut memakai cincin emas. Kemudian Nabi SAW bersabda, \"Aku membuat cincin emas ini untuk diriku sendiri.\"  Lalu baginda membuangnya dan bersabda, \"Aku tidak akan memakainya lagi.\"  Maka, orang ramai juga membuang cincin mereka.",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ اتَّخَذَ النَّبِيُّ صلى الله عليه وسلم خَاتَمًا مِنْ ذَهَبٍ فَاتَّخَذَ النَّاسُ خَوَاتِيمَ مِنْ ذَهَبٍ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنِّي اتَّخَذْتُ خَاتَمًا مِنْ ذَهَبٍ ‏\"‏‏.‏ فَنَبَذَهُ وَقَالَ ‏\"‏ إِنِّي لَنْ أَلْبَسَهُ أَبَدًا ‏\"‏ فَنَبَذَ النَّاسُ خَوَاتِيمَهُمْ‏.‏"
      },
      {
        "id": 6997,
        "hadith_number": "7299",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Puasa Al-Wisal",
        "perawi_melayu": "Riwayat Abu Hurairah رضي الله عنه :",
        "english_text": "The Prophet (ﷺ) said (to his companions), \"Do not fast Al-Wisal.\" They said, \"But you fast Al-Wisail.\" He said, \"I am not like you, for at night my Lord feeds me and makes me drink.\" But the people did not give up Al-Wisal, so the Prophet (ﷺ) fasted Al-Wisal with them for two days or two nights, and then they saw the crescent whereupon the Prophet (ﷺ) said, \"If the crescent had delayed, I would have continued fasting (because of you),\" as if he wanted to vanquish them completely (because they had refused to give up Al Wisal).",
        "malay_translation": "Rasulullah SAW bersabda kepada para sahabatnya, \"Janganlah kamu berpuasa Al-Wisal.\" Mereka berkata, \"Tetapi, tuan berpuasa Al-Wisal.\" Baginda menjawab, \"Aku tidak seperti kamu, kerana pada waktu malam Tuhanku memberi aku makan dan minum.\"  Tetapi, mereka tidak meninggalkan puasa Al-Wisal, maka Rasulullah SAW berpuasa Al-Wisal bersama mereka selama dua hari atau dua malam, dan kemudian mereka melihat hilal, lalu Rasulullah SAW bersabda, \"Sekiranya hilal itu terlambat, nescaya aku akan terus berpuasa (kerana kamu),\" seolah-olah Baginda ingin memenangi mereka sepenuhnya (kerana mereka enggan meninggalkan puasa Al-Wisal).",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ تُوَاصِلُوا ‏\"‏‏.‏ قَالُوا إِنَّكَ تُوَاصِلُ‏.‏ قَالَ ‏\"‏ إِنِّي لَسْتُ مِثْلَكُمْ، إِنِّي أَبِيتُ يُطْعِمُنِي رَبِّي وَيَسْقِينِي ‏\"‏‏.‏ فَلَمْ يَنْتَهُوا عَنِ الْوِصَالِ ـ قَالَ ـ فَوَاصَلَ بِهِمُ النَّبِيُّ صلى الله عليه وسلم يَوْمَيْنِ أَوْ لَيْلَتَيْنِ، ثُمَّ رَأَوُا الْهِلاَلَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَوْ تَأَخَّرَ الْهِلاَلُ لَزِدْتُكُمْ ‏\"‏‏.‏ كَالْمُنَكِّلِ لَهُمْ‏.‏"
      },
      {
        "id": 6998,
        "hadith_number": "7300",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hadis Tentang Hukum di Madinah dan Pelanggaran Janji",
        "perawi_melayu": "Daripada bapa Ibrahim At Taimi:",
        "english_text": "`Ali رضي الله عنه addressed us while he was standing on a brick pulpit and carrying a sword from which was hanging a scroll He said \"By Allah, we have no book to read except Allah's Book and whatever is on this scroll,\" And then he unrolled it, and behold, in it was written what sort of camels were to be given as blood money, and there was also written in it: 'Medina is a sanctuary form 'Air (mountain) to such and such place so whoever innovates in it an heresy or commits a sin therein, he will incur the curse of Allah, the angels, and all the people and Allah will not accept his compulsory or optional good deeds.' There was also written in it: 'The asylum (pledge of protection) granted by any Muslims is one and the same, (even a Muslim of the lowest status is to be secured and respected by all the other Muslims, and whoever betrays a Muslim in this respect (by violating the pledge) will incur the curse of Allah, the angels, and all the people, and Allah will not accept his compulsory or optional good deeds.' There was also written in it: 'Whoever (freed slave) befriends (takes as masters) other than his real masters (manumitters) without their permission will incur the curse of Allah, the angels, and all the people, and Allah will not accept his compulsory or optional good deeds. ' (See Hadith No. 94, Vol. 3)",
        "malay_translation": "Ali رضي الله عنه menyampaikan kepada kami ketika baginda berdiri di atas mimbar bata sambil memegang pedang yang tergantung padanya sebuah gulungan. Baginda berkata, \"Demi Allah, kita tidak mempunyai kitab untuk dibaca kecuali Kitab Allah dan apa yang tertulis dalam gulungan ini.\" Kemudian baginda membukanya, dan rupa-rupanya di dalamnya tertulis jenis unta yang perlu diberikan sebagai diat (tebusan darah), dan juga tertulis di dalamnya: 'Madinah adalah kawasan suci dari 'Air (gunung) hingga ke tempat sedemikian rupa, maka sesiapa yang melakukan bidaah atau melakukan dosa di dalamnya, dia akan mendapat laknat Allah, malaikat, dan semua manusia, dan Allah tidak akan menerima amalan wajib atau sunatnya.'  Juga tertulis di dalamnya: 'Tempat perlindungan (janji perlindungan) yang diberikan oleh mana-mana Muslim adalah satu dan sama, (walaupun seorang Muslim yang paling rendah kedudukannya perlu dijamin dan dihormati oleh semua Muslim yang lain, dan sesiapa yang mengkhianati seorang Muslim dalam hal ini (dengan melanggar janji) akan mendapat laknat Allah, malaikat, dan semua manusia, dan Allah tidak akan menerima amalan wajib atau sunatnya.' Juga tertulis di dalamnya: 'Sesiapa (hamba yang dibebaskan) yang berkawan (mengambil sebagai tuan) selain daripada tuan sebenar mereka (yang membebaskannya) tanpa kebenaran mereka akan mendapat laknat Allah, malaikat, dan semua manusia, dan Allah tidak akan menerima amalan wajib atau sunatnya.' (Lihat Hadis No. 94, Jilid 3)",
        "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنِي إِبْرَاهِيمُ التَّيْمِيُّ، حَدَّثَنِي أَبِي قَالَ، خَطَبَنَا عَلِيٌّ ـ رضى الله عنه ـ عَلَى مِنْبَرٍ مِنْ آجُرٍّ، وَعَلَيْهِ سَيْفٌ فِيهِ صَحِيفَةٌ مُعَلَّقَةٌ فَقَالَ وَاللَّهِ مَا عِنْدَنَا مِنْ كِتَابٍ يُقْرَأُ إِلاَّ كِتَابُ اللَّهِ وَمَا فِي هَذِهِ الصَّحِيفَةِ‏.‏ فَنَشَرَهَا فَإِذَا فِيهَا أَسْنَانُ الإِبِلِ وَإِذَا فِيهَا ‏\"‏ الْمَدِينَةُ حَرَمٌ مِنْ عَيْرٍ إِلَى كَذَا، فَمَنْ أَحْدَثَ فِيهَا حَدَثًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يَقْبَلُ اللَّهُ مِنْهُ صَرْفًا وَلاَ عَدْلاً ‏\"‏‏.‏ وَإِذَا فِيهِ ‏\"‏ ذِمَّةُ الْمُسْلِمِينَ وَاحِدَةٌ يَسْعَى بِهَا أَدْنَاهُمْ، فَمَنْ أَخْفَرَ مُسْلِمًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يَقْبَلُ اللَّهُ مِنْهُ صَرْفًا وَلاَ عَدْلاً ‏\"‏‏.‏ وَإِذَا فِيهَا ‏\"‏ مَنْ وَالَى قَوْمًا بِغَيْرِ إِذْنِ مَوَالِيهِ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ لاَ يَقْبَلُ اللَّهُ مِنْهُ صَرْفًا وَلاَ عَدْلاً ‏\"‏‏.‏"
      },
      {
        "id": 6999,
        "hadith_number": "7301",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW dan Pengetahuan tentang Allah",
        "perawi_melayu": "Daripada Aisyah رضي الله عنها :",
        "english_text": "The Prophet (ﷺ) did something as it was allowed from the religious point of view but some people refrained from it. When the Prophet (ﷺ) heard of that, he, after glorifying and praising Allah, said, \"Why do some people refrain from doing something which I do? By Allah, I know Allah more than they.\"",
        "malay_translation": "Rasulullah SAW melakukan sesuatu yang dibolehkan dari sudut pandang agama, tetapi ada segelintir orang yang menjauhinya.  Apabila Rasulullah SAW mendengar hal itu, baginda, setelah memuji dan mensyukuri Allah SWT, bersabda:  \"Mengapa segelintir orang menjauhi sesuatu yang aku lakukan? Demi Allah, aku lebih mengetahui Allah daripada mereka.\"",
        "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا مُسْلِمٌ، عَنْ مَسْرُوقٍ، قَالَ قَالَتْ عَائِشَةُ ـ رَضِيَ الله عنها ـ صَنَعَ النَّبِيُّ صلى الله عليه وسلم شَيْئًا تَرَخَّصَ وَتَنَزَّهَ عَنْهُ قَوْمٌ، فَبَلَغَ ذَلِكَ النَّبِيَّ صلى الله عليه وسلم فَحَمِدَ اللَّهَ ثُمَّ قَالَ ‏ \"‏ مَا بَالُ أَقْوَامٍ يَتَنَزَّهُونَ عَنِ الشَّىْءِ أَصْنَعُهُ، فَوَاللَّهِ إِنِّي أَعْلَمُهُمْ بِاللَّهِ، وَأَشَدُّهُمْ لَهُ خَشْيَةً ‏\"‏‏.‏"
      },
      {
        "id": 7000,
        "hadith_number": "7302",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Menjerit di Hadapan Nabi SAW",
        "perawi_melayu": "Riwayat Ibn Abi Mulaika:",
        "english_text": "Once the two righteous men, i.e., Abu Bakr and `Umar رضی اللہ عنہما were on the verge of destruction (and that was because): When the delegate of Bani Tamim came to the Prophet, one of them (either Abu Bakr or `Umar رضی اللہ عنہما) recommended Al-Aqra' bin H`Abis at-Tamimi Al-Hanzali, the brother of Bani Majashi (to be appointed as their chief), while the other recommended somebody else. Abu Bakr  رضی اللہ عنہ said to `Umar رضی اللہ عنہ , \"You intended only to oppose me.\" `Umar رضی اللہ عنہ said, \"I did not intend to oppose you!\" Then their voices grew louder in front of the Prophet (ﷺ) whereupon there was revealed: 'O you who believe! Do not raise your voices above the voice of the Prophet..a great reward.' (49.2-3) Ibn Az-Zubair رضی اللہ عنہا said, 'Thence forward when `Umar رضی اللہ عنہ talked to the Prophet, he would talk like one who whispered a secret and would even fail to make the Prophet (ﷺ) hear him, in which case the Prophet (ﷺ) would ask him (to repeat his words).",
        "malay_translation": "Pada suatu ketika, dua orang sahabat yang mulia, iaitu Abu Bakar dan Umar رضي الله عنهما, hampir berlakunya perselisihan faham yang besar.  Hal ini berlaku apabila utusan Bani Tamim datang menghadap Nabi SAW.  Salah seorang daripada mereka (sama ada Abu Bakar atau Umar رضي الله عنهما) mencadangkan Al-Aqra' bin Habis at-Tamimi Al-Hanzali, saudara Bani Majashi, dilantik sebagai ketua mereka, manakala yang seorang lagi mencadangkan orang lain. Abu Bakar رضي الله عنه berkata kepada Umar رضي الله عنه, \"Engkau berniat untuk menentangku.\" Umar رضي الله عنه menjawab, \"Aku tidak berniat untuk menentangmu!\" Kemudian suara mereka meninggi di hadapan Nabi SAW, lalu turunlah ayat:  'Wahai orang-orang yang beriman! Janganlah kamu meninggikan suara kamu melebihi suara Nabi...' (Surah Al-Hujurat, 49:2-3). Ibn Az-Zubair رضي الله عنه berkata, 'Sejak itu, apabila Umar رضي الله عنه bercakap dengan Nabi SAW, beliau akan bercakap dengan suara perlahan seperti berbisik rahsia, bahkan sehingga Nabi SAW sukar mendengarnya.  Jika demikian, Nabi SAW akan meminta beliau mengulang perkataannya.'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا وَكِيعٌ، عَنْ نَافِعِ بْنِ عُمَرَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، قَالَ كَادَ الْخَيِّرَانِ أَنْ يَهْلِكَا أَبُو بَكْرٍ، وَعُمَرُ، لَمَّا قَدِمَ عَلَى النَّبِيِّ صلى الله عليه وسلم وَفْدُ بَنِي تَمِيمٍ، أَشَارَ أَحَدُهُمَا بِالأَقْرَعِ بْنِ حَابِسٍ الْحَنْظَلِيِّ أَخِي بَنِي مُجَاشِعٍ، وَأَشَارَ الآخَرُ بِغَيْرِهِ، فَقَالَ أَبُو بَكْرٍ لِعُمَرَ إِنَّمَا أَرَدْتَ خِلاَفِي‏.‏ فَقَالَ عُمَرُ مَا أَرَدْتُ خِلاَفَكَ‏.‏ فَارْتَفَعَتْ أَصْوَاتُهُمَا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَنَزَلَتْ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تَرْفَعُوا أَصْوَاتَكُمْ‏}‏ إِلَى قَوْلِهِ ‏{‏عَظِيمٌ‏}‏‏.‏ قَالَ ابْنُ أَبِي مُلَيْكَةَ قَالَ ابْنُ الزُّبَيْرِ فَكَانَ عُمَرُ بَعْدُ ـ وَلَمْ يَذْكُرْ ذَلِكَ عَنْ أَبِيهِ يَعْنِي أَبَا بَكْرٍ ـ إِذَا حَدَّثَ النَّبِيَّ صلى الله عليه وسلم بِحَدِيثٍ حَدَّثَهُ كَأَخِي السِّرَارِ، لَمْ يُسْمِعْهُ حَتَّى يَسْتَفْهِمَهُ‏.‏"
      },
      {
        "id": 7001,
        "hadith_number": "7303",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pelantikan Abu Bakar sebagai Imam Solat",
        "perawi_melayu": "Riwayat Aisyah (Ummul Mukminin)",
        "english_text": "Allah's Messenger (ﷺ) during his fatal ailment said, \"Order Abu Bakr رضي الله عنه to lead the people in prayer.\" I said, \"If Abu Bakr رضي الله عنه stood at your place (in prayers, the people will not be able to hear him because of his weeping, so order `Umar رضي الله عنه to lead the people in prayer.\" He again said, \"Order Abu Bakr رضي الله عنه to lead the people in prayer.\" Then I said to Hafsa رضي الله عنها, \"Will you say (to the Prophet), 'If Abu Bakr رضي الله عنه stood at your place, the people will not be able to hear him be cause of his weeping, so order `Umar   رضي الله عنه to lead the people in prayer?\" Hafsa رضي الله عنها did so, whereupon Allah's Messenger (ﷺ) said, \"You are like the companions of Joseph (See Qur'an, 12:30-32). Order Abu Bakr رضي الله عنه to lead the people in prayer.\" Hafsa رضي الله عنها then said to me, \"I have never received any good from you!\"",
        "malay_translation": "Rasulullah SAW ketika sakit keras baginda bersabda, \"Suruh Abu Bakar رضي الله عنه menjadi imam solat untuk umat.\"  Aku berkata, \"Jika Abu Bakar رضي الله عنه mengimamkan solat di tempat baginda, orang ramai tidak akan dapat mendengarnya kerana tangisannya yang kuat, maka suruhlah Umar رضي الله عنه menjadi imam solat untuk umat.\" Baginda sekali lagi bersabda, \"Suruh Abu Bakar رضي الله عنه menjadi imam solat untuk umat.\" Kemudian aku berkata kepada Hafsah رضي الله عنها, \"Adakah engkau akan menyampaikan (kepada Nabi), 'Jika Abu Bakar رضي الله عنه mengimamkan solat di tempat baginda, orang ramai tidak akan dapat mendengarnya kerana tangisannya yang kuat, maka suruhlah Umar رضي الله عنه menjadi imam solat untuk umat?'\" Hafsah رضي الله عنها berbuat demikian, lalu Rasulullah SAW bersabda, \"Kamu seperti sahabat-sahabat Yusuf (rujuk Surah Yusuf 12:30-32). Suruh Abu Bakar رضي الله عنه menjadi imam solat untuk umat.\" Hafsah رضي الله عنها kemudian berkata kepadaku, \"Aku tidak pernah menerima kebaikan sedikit pun daripada kamu!\"",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ فِي مَرَضِهِ ‏\"‏ مُرُوا أَبَا بَكْرٍ يُصَلِّي بِالنَّاسِ ‏\"‏‏.‏ قَالَتْ عَائِشَةُ قُلْتُ إِنَّ أَبَا بَكْرٍ إِذَا قَامَ فِي مَقَامِكَ لَمْ يُسْمِعِ النَّاسَ مِنَ الْبُكَاءِ، فَمُرْ عُمَرَ فَلْيُصَلِّ‏.‏ فَقَالَ ‏\"‏ مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ ‏\"‏‏.‏ فَقَالَتْ عَائِشَةُ فَقُلْتُ لِحَفْصَةَ قُولِي إِنَّ أَبَا بَكْرٍ إِذَا قَامَ فِي مَقَامِكَ لَمْ يُسْمِعِ النَّاسَ مِنَ الْبُكَاءِ، فَمُرْ عُمَرَ فَلْيُصَلِّ بِالنَّاسِ، فَفَعَلَتْ حَفْصَةُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّكُنَّ لأَنْتُنَّ صَوَاحِبُ يُوسُفَ، مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ لِلنَّاسِ ‏\"‏‏.‏ قَالَتْ حَفْصَةُ لِعَائِشَةَ مَا كُنْتُ لأُصِيبَ مِنْكِ خَيْرًا‏.‏"
      },
      {
        "id": 7002,
        "hadith_number": "7304",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Li'an Uwaimir al-Ajlani",
        "perawi_melayu": "Riwayat Sahl bin Sa`d As-Sa`idi",
        "english_text": "Uwaimir Al-`Ajlani came to `Asim bin `Adi and said, \"If a man found another man with his wife and killed him, would you sentence the husband to death (in Qisas,) i.e., equality in punishment)? O `Asim! Please ask Allah's Messenger (ﷺ) about this matter on my behalf.\" `Asim asked the Prophet (ﷺ) but the Prophet disliked the question and disapproved of it. `Asim رضي الله عنه returned and informed 'Uwaimir رضي الله عنه that the Prophet disliked that type of question. 'Uwaimir رضي الله عنه said, \"By Allah, I will go (personally) to the Prophet.\" 'Uwaimir رضي الله عنه came to the Prophet (ﷺ) when Allah had already revealed Qur'anic Verses (in that respect), after `Asim رضي الله عنه had left (the Prophet (ﷺ) ). So the Prophet (ﷺ) said to 'Uwaimir, \"Allah has revealed Qur'anic Verses regarding you and your wife.\" The Prophet (ﷺ) then called for them, and they came and carried out the order of Lian. Then 'Uwaimir رضي الله عنه said, \"O Allah's Messenger (ﷺ)! Now if I kept her with me, I would be accused of telling a lie.\" So 'Uwaimir رضي الله عنه divorced her although the Prophet (ﷺ) did not order him to do so. Later on this practice of divorcing became the tradition of couples involved in a case of Li'an. The Prophet (ﷺ) said (to the people). \"Wait for her! If she delivers a red short (small) child like a Wahra (a short red animal). then I will be of the opinion that he ('Uwaimir رضي الله عنه ) has told a lie but if she delivered a black big-eyed one with big buttocks, then I will be of the opinion that he has told the truth about her.\" 'Ultimately she gave birth to a child that proved the accusation. (See Hadith No. 269, Vol. 6)",
        "malay_translation": "Uwaimir Al-`Ajlani menemui `Asim bin `Adi dan berkata, \"Jika seorang lelaki mendapati lelaki lain bersama isterinya dan membunuhnya, adakah engkau akan menjatuhkan hukuman mati ke atas suami (dalam Qisas), iaitu, kesamarataan dalam hukuman? Wahai `Asim! Sila tanyakan kepada Rasulullah ﷺ tentang perkara ini bagi pihakku.\" `Asim bertanya kepada Nabi ﷺ, tetapi Nabi tidak menyukai soalan itu dan tidak menyetujuinya. `Asim رضي الله عنه kembali dan memberitahu 'Uwaimir رضي الله عنه bahawa Nabi tidak menyukai soalan sedemikian. 'Uwaimir رضي الله عنه berkata, \"Demi Allah, aku akan pergi (sendiri) kepada Nabi.\" 'Uwaimir رضي الله عنه datang kepada Nabi ﷺ ketika Allah telah menurunkan ayat-ayat al-Quran (mengenai hal itu), selepas `Asim رضي الله عنه meninggalkan (Nabi ﷺ). Maka Nabi ﷺ berkata kepada 'Uwaimir, \"Allah telah menurunkan ayat-ayat al-Quran mengenai kamu dan isterimu.\" Nabi ﷺ kemudian memanggil mereka, dan mereka datang dan melaksanakan perintah Lian. Kemudian 'Uwaimir رضي الله عنه berkata, \"Wahai Rasulullah ﷺ! Sekarang jika aku menyimpannya bersamaku, aku akan dituduh berbohong.\" Maka 'Uwaimir رضي الله عنه menceraikan isterinya walaupun Nabi ﷺ tidak menyuruhnya berbuat demikian. Kemudian amalan menceraikan ini menjadi tradisi pasangan yang terlibat dalam kes Li'an. Nabi ﷺ berkata (kepada orang ramai), \"Tunggulah dia! Jika dia melahirkan anak lelaki yang pendek dan merah seperti Wahra (sejenis haiwan kecil berwarna merah), maka aku akan berpendapat bahawa dia ('Uwaimir رضي الله عنه) telah berbohong, tetapi jika dia melahirkan anak lelaki yang berkulit hitam, bermata besar dan berbontot besar, maka aku akan berpendapat bahawa dia telah berkata benar tentang isterinya.\" Akhirnya, isterinya melahirkan anak yang membuktikan dakwaan tersebut. (Lihat Hadis No. 269, Jilid 6)",
        "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، حَدَّثَنَا الزُّهْرِيُّ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، قَالَ جَاءَ عُوَيْمِرٌ إِلَى عَاصِمِ بْنِ عَدِيٍّ فَقَالَ أَرَأَيْتَ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً فَيَقْتُلُهُ، أَتَقْتُلُونَهُ بِهِ سَلْ لِي يَا عَاصِمُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَسَأَلَهُ فَكَرِهَ النَّبِيُّ صلى الله عليه وسلم الْمَسَائِلَ وَعَابَ، فَرَجَعَ عَاصِمٌ فَأَخْبَرَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَرِهَ الْمَسَائِلَ فَقَالَ عُوَيْمِرٌ وَاللَّهِ لآتِيَنَّ النَّبِيَّ صلى الله عليه وسلم، فَجَاءَ وَقَدْ أَنْزَلَ اللَّهُ تَعَالَى الْقُرْآنَ خَلْفَ عَاصِمٍ فَقَالَ لَهُ ‏\"‏ قَدْ أَنْزَلَ اللَّهُ فِيكُمْ قُرْآنًا ‏\"‏‏.‏ فَدَعَا بِهِمَا فَتَقَدَّمَا فَتَلاَعَنَا، ثُمَّ قَالَ عُوَيْمِرٌ كَذَبْتُ عَلَيْهَا يَا رَسُولَ اللَّهِ، إِنْ أَمْسَكْتُهَا‏.‏ فَفَارَقَهَا وَلَمْ يَأْمُرْهُ النَّبِيُّ صلى الله عليه وسلم بِفِرَاقِهَا، فَجَرَتِ السُّنَّةُ فِي الْمُتَلاَعِنَيْنِ‏.‏ وَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ انْظُرُوهَا فَإِنْ جَاءَتْ بِهِ أَحْمَرَ قَصِيرًا مِثْلَ وَحَرَةٍ فَلاَ أُرَاهُ إِلاَّ قَدْ كَذَبَ، وَإِنْ جَاءَتْ بِهِ أَسْحَمَ أَعْيَنَ ذَا أَلْيَتَيْنِ فَلاَ أَحْسِبُ إِلاَّ قَدْ صَدَقَ عَلَيْهَا ‏\"‏‏.‏ فَجَاءَتْ بِهِ عَلَى الأَمْرِ الْمَكْرُوهِ‏.‏"
      },
      {
        "id": 7003,
        "hadith_number": "7305",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pengurusan Harta Pusaka Rasulullah SAW oleh Khulafa' Ar-Rasyidin",
        "perawi_melayu": "Malik bin Aus An-Nasri",
        "english_text": "Muhammad bin Jubair bin Mutim had already narrated to me so I came  to Maalik (bin Aus) and asked him, he, whereupon, said: I proceeded till I entered upon `Umar رضی اللہ عنہ (and while I was sitting there), his gate-keeper Yarfa came to him and said, \" `Uthman, `Abdur-Rahman, Az-Zubair and Sa`d ask your permission to come in.\" `Umar رضی اللہ عنہ allowed them. So they entered, greeted, and sat down. (After a while the gatekeeper came) and said, \"Shall I admit `Ali and `Abbas رضی اللہ عنہ ?'' `Umar  رضی اللہ عنہ allowed them to enter. Al-`Abbas رضی اللہ عنہ said \"O Chief of the believers! Judge between me and the oppressor (`Ali).\" Then there was a dispute (regarding the property of Bani Nadir) between them (`Abbas and `Ali). `Uthman رضی اللہ عنہ and his companions said, \"O Chief of the Believers! Judge between them and relieve one from the other.\" `Umar رضی اللہ عنہ said, \"Be patient! beseech you by Allah, with Whose permission the Heaven and the Earth Exist! Do you know that Allah's Messenger (ﷺ) said, 'Our property is not to be inherited, and whatever we leave is to be given in charity,' and by this Allah's Messenger (ﷺ) meant himself?\" On that the group said, \"He verily said so.\" `Umar رضی اللہ عنہ then faced `Ali and `Abbas رضی اللہ عنہ and said, \"I beseech you both by Allah, do you both know that Allah's Messenger (ﷺ) said so?\" They both replied, \"Yes\". `Umar رضی اللہ عنہ then said, \"Now I am talking to you about this matter (in detail) . Allah favored Allah's Messenger (ﷺ) with some of this wealth which He did not give to anybody else, as Allah said: 'What Allah bestowed as Fai (Booty on His Apostle for which you made no expedition... ' (59.6) So that property was totally meant for Allah's Messenger (ﷺ), yet he did not collect it and ignore you, nor did he withhold it with your exclusion, but he gave it to you and distributed it among you till this much of it was left behind, and the Prophet, used to spend of this as the yearly expenditures of his family and then take what remained of it and spent it as he did with (other) Allah's wealth. The Prophet (ﷺ) did so during all his lifetime, and I beseech you by Allah, do you know that?\" They replied, \"Yes.\" `Umar رضی اللہ عنہ then addressed `Ali and `Abbas رضی اللہ عنہ , saying, \"I beseech you both by Allah, do you know that?\" Both of them replied, \"Yes.\" `Umar رضی اللہ عنہ added, \"Then Allah took His Apostle unto Him. Abu Bakr رضی اللہ عنہ then said 'I am the successor of Allah's Messenger (ﷺ)' and took over all the Prophet's property and disposed of it in the same way as Allah's Messenger (ﷺ) used to do, and you were present then.\" Then he turned to `Ali رضی اللہ عنہ and `Abbas and said, \"You both claim that Abu Bakr رضی اللہ عنہ did so-and-so in managing the property, but Allah knows that Abu Bakr رضی اللہ عنہ was honest, righteous, intelligent, and a follower of what is right in managing it. Then Allah took Abu Bakr رضی اللہ عنہ unto Him, 'I said: I am the successor of Allah's Messenger (ﷺ) and Abu Bakr رضی اللہ عنہ .' So I took over the property for two years and managed it in the same way as Allah's Messenger (ﷺ), and Abu Bakr رضی اللہ عنہ used to do. Then you both (`Ali and `Abbas رضی اللہ عنہ ) came to me and asked for the same thing! (O `Abbas! You came to me to ask me for your share from nephew's property; and this (`Ali رضی اللہ عنہ ) came to me asking for his wives share from her father's property, and I said to you both, 'If you wish, I will place it in your custody on condition that you both will manage it in the same way as Allah's Messenger (ﷺ) and Abu Bakr رضی اللہ عنہ did and as I have been doing since I took charge of managing it; otherwise, do not speak to me anymore about it.' Then you both said, 'Give it to us on that (condition).' So I gave it to you on that condition. Now I beseech you by Allah, did I not give it to them on that condition?\" The group (whom he had been addressing) replied, \"Yes.\" `Umar رضی اللہ عنہ then addressed `Abbas رضی اللہ عنہ and `Ali saying, \"I beseech you both by Allah, didn't I give you all that property on that condition?\" They said, \"Yes.\" `Umar رضی اللہ عنہ then said, \"Are you now seeking a verdict from me other than that? By Him with Whose Permission the Heaven and the Earth exists I will not give any verdict other than that till the Hour is established; and if you both are unable to manage this property, then you can hand it back to me, and I will be sufficient for it on your behalf.\" (See, Hadith No. 326, Vol. 4)",
        "malay_translation": "Muhammad bin Jubair bin Mutim telah meriwayatkan kepadaku, maka aku datang kepada Malik (bin Aus) dan bertanya kepadanya.  Lalu dia berkata: Aku terus berjalan sehingga aku sampai kepada Umar رضي الله عنه. Ketika aku duduk di situ, pengawal pintu gerbangnya, Yarfa, datang kepadanya dan berkata, \"Uthman, Abdur-Rahman, Az-Zubair dan Saad memohon izin untuk masuk.\" Umar رضي الله عنه membenarkan mereka. Maka mereka masuk, memberi salam, dan duduk. (Selepas seketika, pengawal pintu gerbang datang) dan berkata, \"Adakah saya harus membenarkan Ali dan Abbas رضي الله عنه masuk?\" Umar رضي الله عنه membenarkan mereka masuk. Al-Abbas رضي الله عنه berkata, \"Wahai pemimpin orang beriman!  Putuskanlah di antara aku dan orang yang menzalimi aku (Ali).\" Kemudian berlakulah perselisihan (mengenai harta Bani Nadhir) di antara mereka (Abbas dan Ali). Uthman رضي الله عنه dan sahabat-sahabatnya berkata, \"Wahai pemimpin orang beriman! Putuskanlah di antara mereka dan bebaskanlah salah seorang daripada yang lain.\" Umar رضي الله عنه berkata, \"Bersabarlah! Aku bersumpah demi Allah, dengan izin-Nya langit dan bumi wujud!  Tahukah kamu bahawa Rasulullah ﷺ bersabda, 'Harta kita tidak diwarisi, dan apa sahaja yang kita tinggalkan akan disedekahkan,' dan dengan ini Rasulullah ﷺ merujuk kepada dirinya sendiri?\"  Maka kumpulan itu berkata, \"Sesungguhnya baginda telah bersabda demikian.\" Umar رضي الله عنه kemudian menghadap Ali dan Abbas رضي الله عنه dan berkata, \"Aku bersumpah demi Allah, adakah kamu berdua mengetahui bahawa Rasulullah ﷺ telah bersabda demikian?\" Mereka berdua menjawab, \"Ya.\" Umar رضي الله عنه kemudian berkata, \"Sekarang aku bercakap dengan kamu mengenai perkara ini (dengan terperinci). Allah telah memuliakan Rasulullah ﷺ dengan sebahagian daripada kekayaan ini yang tidak diberikan-Nya kepada sesiapa pun yang lain, sebagaimana firman Allah: 'Apa yang Allah berikan sebagai Fai (Ghanimah kepada Rasul-Nya yang kamu tidak ikut serta dalam usaha mencarinya...' (59:6). Maka harta itu sepenuhnya adalah untuk Rasulullah ﷺ, namun baginda tidak mengumpulkannya dan mengabaikan kamu, mahupun menahannya tanpa membiarkan kamu mendapat bahagian, tetapi baginda memberikannya kepada kamu dan mengagihkannya di kalangan kamu sehingga sebanyak ini yang tinggal, dan Nabi ﷺ membelanjakan sebahagian daripadanya sebagai perbelanjaan tahunan keluarganya dan kemudian mengambil baki dan membelanjakannya sebagaimana yang dilakukannya dengan harta Allah yang lain. Nabi ﷺ berbuat demikian sepanjang hayatnya, dan aku bersumpah demi Allah, adakah kamu tahu akan perkara itu?\" Mereka menjawab, \"Ya.\" Umar رضي الله عنه kemudian bercakap kepada Ali dan Abbas رضي الله عنه, sambil berkata, \"Aku bersumpah demi Allah, adakah kamu berdua tahu akan perkara itu?\" Mereka berdua menjawab, \"Ya.\" Umar رضي الله عنه menambah, \"Kemudian Allah mengambil Rasul-Nya kepada-Nya. Abu Bakar رضي الله عنه kemudian berkata, 'Akulah pengganti Rasulullah ﷺ' dan mengambil alih semua harta Nabi dan menguruskannya dengan cara yang sama seperti yang dilakukan oleh Rasulullah ﷺ, dan kamu berada di situ ketika itu.\" Kemudian beliau berpaling kepada Ali رضي الله عنه dan Abbas dan berkata, \"Kamu berdua mendakwa bahawa Abu Bakar رضي الله عنه berbuat demikian dan demikian dalam menguruskan harta itu, tetapi Allah mengetahui bahawa Abu Bakar رضي الله عنه adalah jujur, soleh, bijak, dan seorang yang mengikuti apa yang benar dalam menguruskannya. Kemudian Allah mengambil Abu Bakar رضي الله عنه kepada-Nya. Aku berkata: 'Akulah pengganti Rasulullah ﷺ dan Abu Bakar رضي الله عنه.' Maka aku mengambil alih harta itu selama dua tahun dan menguruskannya dengan cara yang sama seperti Rasulullah ﷺ dan Abu Bakar رضي الله عنه. Kemudian kamu berdua (Ali dan Abbas رضي الله عنه) datang kepadaku dan meminta perkara yang sama! (Wahai Abbas! Kamu datang kepadaku untuk meminta bahagianmu daripada harta anak saudara; dan ini (Ali رضي الله عنه) datang kepadaku untuk meminta bahagian isterinya daripada harta bapanya, dan aku berkata kepada kamu berdua, 'Jika kamu mahu, aku akan menyimpannya di bawah jagaan kamu dengan syarat kamu berdua akan menguruskannya dengan cara yang sama seperti Rasulullah ﷺ dan Abu Bakar رضي الله عنه, dan sebagaimana yang telah aku lakukan sejak aku mengambil alih pengurusan harta itu; jika tidak, jangan bercakap lagi dengan aku tentang hal ini.' Kemudian kamu berdua berkata, 'Berikan kepada kami dengan syarat itu.' Maka aku memberikannya kepada kamu dengan syarat itu. Sekarang aku bersumpah demi Allah, bukankah aku memberikannya kepada mereka dengan syarat itu?\" Kumpulan (yang ditanya olehnya) menjawab, \"Ya.\" Umar رضي الله عنه kemudian bercakap kepada Abbas رضي الله عنه dan Ali, sambil berkata, \"Aku bersumpah demi Allah, bukankah aku memberikan semua harta itu kepadamu dengan syarat itu?\" Mereka berkata, \"Ya.\" Umar رضي الله عنه kemudian berkata, \"Adakah kamu sekarang meminta keputusan daripada aku selain daripada itu? Demi Allah yang dengan izin-Nya langit dan bumi wujud, aku tidak akan memberikan keputusan selain daripada itu sehingga hari kiamat; dan jika kamu berdua tidak mampu menguruskan harta ini, maka kamu boleh mengembalikannya kepadaku, dan aku akan mencukupinya bagi pihak kamu.\" (Lihat, Hadis No. 326, Jilid 4)",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي مَالِكُ بْنُ أَوْسٍ النَّصْرِيُّ، وَكَانَ، مُحَمَّدُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍ ذَكَرَ لِي ذِكْرًا مِنْ ذَلِكَ فَدَخَلْتُ عَلَى مَالِكٍ فَسَأَلْتُهُ فَقَالَ انْطَلَقْتُ حَتَّى أَدْخُلَ عَلَى عُمَرَ أَتَاهُ حَاجِبُهُ يَرْفَا فَقَالَ هَلْ لَكَ فِي عُثْمَانَ وَعَبْدِ الرَّحْمَنِ وَالزُّبَيْرِ وَسَعْدٍ يَسْتَأْذِنُونَ‏.‏ قَالَ نَعَمْ‏.‏ فَدَخَلُوا فَسَلَّمُوا وَجَلَسُوا‏.‏ فَقَالَ هَلْ لَكَ فِي عَلِيٍّ وَعَبَّاسٍ‏.‏ فَأَذِنَ لَهُمَا‏.‏ قَالَ الْعَبَّاسُ يَا أَمِيرَ الْمُؤْمِنِينَ اقْضِ بَيْنِي وَبَيْنَ الظَّالِمِ‏.‏ اسْتَبَّا‏.‏ فَقَالَ الرَّهْطُ عُثْمَانُ وَأَصْحَابُهُ يَا أَمِيرَ الْمُؤْمِنِينَ اقْضِ بَيْنَهُمَا وَأَرِحْ أَحَدَهُمَا مِنَ الآخَرِ‏.‏ فَقَالَ اتَّئِدُوا أَنْشُدُكُمْ بِاللَّهِ الَّذِي بِإِذْنِهِ تَقُومُ السَّمَاءُ وَالأَرْضُ، هَلْ تَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ نُورَثُ مَا تَرَكْنَا صَدَقَةٌ ‏\"‏‏.‏ يُرِيدُ رَسُولُ اللَّهِ صلى الله عليه وسلم نَفْسَهُ‏.‏ قَالَ الرَّهْطُ قَدْ قَالَ ذَلِكَ‏.‏ فَأَقْبَلَ عُمَرُ عَلَى عَلِيٍّ وَعَبَّاسٍ فَقَالَ أَنْشُدُكُمَا بِاللَّهِ هَلْ تَعْلَمَانِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ذَلِكَ‏.‏ قَالاَ نَعَمْ‏.‏ قَالَ عُمَرُ فَإِنِّي مُحَدِّثُكُمْ عَنْ هَذَا الأَمْرِ، إِنَّ اللَّهَ كَانَ خَصَّ رَسُولَهُ صلى الله عليه وسلم فِي هَذَا الْمَالِ بِشَىْءٍ لَمْ يُعْطِهِ أَحَدًا غَيْرَهُ، فَإِنَّ اللَّهَ يَقُولُ ‏{‏مَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ مِنْهُمْ فَمَا أَوْجَفْتُمْ‏}‏ الآيَةَ، فَكَانَتْ هَذِهِ خَالِصَةً لِرَسُولِ اللَّهِ صلى الله عليه وسلم، ثُمَّ وَاللَّهِ مَا احْتَازَهَا دُونَكُمْ وَلاَ اسْتَأْثَرَ بِهَا عَلَيْكُمْ، وَقَدْ أَعْطَاكُمُوهَا وَبَثَّهَا فِيكُمْ، حَتَّى بَقِيَ مِنْهَا هَذَا الْمَالُ، وَكَانَ النَّبِيُّ صلى الله عليه وسلم يُنْفِقُ عَلَى أَهْلِهِ نَفَقَةَ سَنَتِهِمْ مِنْ هَذَا الْمَالِ، ثُمَّ يَأْخُذُ مَا بَقِيَ فَيَجْعَلُهُ مَجْعَلَ مَالِ اللَّهِ، فَعَمِلَ النَّبِيُّ صلى الله عليه وسلم بِذَلِكَ حَيَاتَهُ، أَنْشُدُكُمْ بِاللَّهِ هَلْ تَعْلَمُونَ ذَلِكَ فَقَالُوا نَعَمْ‏.‏ ثُمَّ قَالَ لِعَلِيٍّ وَعَبَّاسٍ أَنْشُدُكُمَا اللَّهَ هَلْ تَعْلَمَانِ ذَلِكَ قَالاَ نَعَمْ‏.‏ ثُمَّ تَوَفَّى اللَّهُ نَبِيَّهُ صلى الله عليه وسلم فَقَالَ أَبُو بَكْرٍ أَنَا وَلِيُّ رَسُولِ اللَّهِ صلى الله عليه وسلم، فَقَبَضَهَا أَبُو بَكْرٍ فَعَمِلَ فِيهَا بِمَا عَمِلَ فِيهَا رَسُولُ اللَّهِ صلى الله عليه وسلم، وَأَنْتُمَا حِينَئِذٍ ـ وَأَقْبَلَ عَلَى عَلِيٍّ وَعَبَّاسٍ ـ تَزْعُمَانِ أَنَّ أَبَا بَكْرٍ فِيهَا كَذَا، وَاللَّهُ يَعْلَمُ أَنَّهُ فِيهَا صَادِقٌ بَارٌّ رَاشِدٌ تَابِعٌ لِلْحَقِّ، ثُمَّ تَوَفَّى اللَّهُ أَبَا بَكْرٍ فَقُلْتُ أَنَا وَلِيُّ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَبِي بَكْرٍ‏.‏ فَقَبَضْتُهَا سَنَتَيْنِ أَعْمَلُ فِيهَا بِمَا عَمِلَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ، ثُمَّ جِئْتُمَانِي وَكَلِمَتُكُمَا عَلَى كَلِمَةٍ وَاحِدَةٍ وَأَمْرُكُمَا جَمِيعٌ، جِئْتَنِي تَسْأَلُنِي نَصِيبَكَ مِنِ ابْنِ أَخِيكَ، وَأَتَانِي هَذَا يَسْأَلُنِي نَصِيبَ امْرَأَتِهِ مِنْ أَبِيهَا فَقُلْتُ إِنْ شِئْتُمَا دَفَعْتُهَا إِلَيْكُمَا، عَلَى أَنَّ عَلَيْكُمَا عَهْدَ اللَّهِ وَمِيثَاقَهُ تَعْمَلاَنِ فِيهَا بِمَا عَمِلَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم وَبِمَا عَمِلَ فِيهَا أَبُو بَكْرٍ وَبِمَا عَمِلْتُ فِيهَا مُنْذُ وَلِيتُهَا، وَإِلاَّ فَلاَ تُكَلِّمَانِي فِيهَا‏.‏ فَقُلْتُمَا ادْفَعْهَا إِلَيْنَا بِذَلِكَ‏.‏ فَدَفَعْتُهَا إِلَيْكُمَا بِذَلِكَ، أَنْشُدُكُمْ بِاللَّهِ هَلْ دَفَعْتُهَا إِلَيْهِمَا بِذَلِكَ قَالَ الرَّهْطُ نَعَمْ‏.‏ فَأَقْبَلَ عَلَى عَلِيٍّ وَعَبَّاسٍ فَقَالَ أَنْشُدُكُمَا بِاللَّهِ هَلْ دَفَعْتُهَا إِلَيْكُمَا بِذَلِكَ‏.‏ قَالاَ نَعَمْ‏.‏ قَالَ أَفَتَلْتَمِسَانِ مِنِّي قَضَاءً غَيْرَ ذَلِكَ فَوَالَّذِي بِإِذْنِهِ تَقُومُ السَّمَاءُ وَالأَرْضُ لاَ أَقْضِي فِيهَا قَضَاءً غَيْرَ ذَلِكَ حَتَّى تَقُومَ السَّاعَةُ، فَإِنْ عَجَزْتُمَا عَنْهَا فَادْفَعَاهَا إِلَىَّ، فَأَنَا أَكْفِيكُمَاهَا‏.‏"
      },
      {
        "id": 7004,
        "hadith_number": "7306",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Madinah Sebagai Tempat Suci",
        "perawi_melayu": "Riwayat Asim:",
        "english_text": "I said to Anas رضی اللہ عنہ , \"Did Allah's Messenger (ﷺ) make Medina a sanctuary?\" He replied, \"Yes, (Medina is a sanctuary from such-and-such place to such-and-such place. It is forbidden to cut its trees, and whoever innovates an heresy in it or commits a sin therein, will incur the curse of Allah, the angels, and all the people.\" Then Musa bin Anas told me that Anas رضی اللہ عنہ added, \"..... or gives refuge to such an heretic or a sinner...\"",
        "malay_translation": "Saya bertanya kepada Anas bin Malik, \"Adakah Rasulullah ﷺ menjadikan Madinah sebagai tempat suci?\"  Jawabnya, \"Ya, (Madinah adalah tempat suci dari tempat begini hingga ke tempat begini). Dilarang menebang pokok-pokoknya, dan sesiapa yang melakukan bid'ah di dalamnya atau melakukan dosa di dalamnya, akan mendapat laknat Allah, malaikat, dan semua manusia.\" Kemudian Musa bin Anas memberitahu saya bahawa Anas bin Malik menambah, \"…atau memberi perlindungan kepada penganut bid'ah atau pendosa…\"",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا عَاصِمٌ، قَالَ قُلْتُ لأَنَسٍ أَحَرَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ‏.‏ قَالَ نَعَمْ مَا بَيْنَ كَذَا إِلَى كَذَا، لاَ يُقْطَعُ شَجَرُهَا، مَنْ أَحْدَثَ فِيهَا حَدَثًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ‏.‏ قَالَ عَاصِمٌ فَأَخْبَرَنِي مُوسَى بْنُ أَنَسٍ أَنَّهُ قَالَ أَوْ آوَى مُحْدِثًا‏.‏"
      },
      {
        "id": 7005,
        "hadith_number": "7307",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hilangnya Ilmu Melalui Kematian Ulama",
        "perawi_melayu": "Abdullah bin Amr رضي الله عنه",
        "english_text": "I heard the Prophet (ﷺ) saying, \"Allah will not deprive you of knowledge after he has given it to you, but it will be taken away through the death of the religious learned men with their knowledge. Then there will remain ignorant people who, when consulted, will give verdicts according to their opinions whereby they will mislead others and go astray.\" I then narrated this Hadith to Hadrat Aishah رضي الله عنها, the prophet's wife., when Hadrat Abdullah bin Umer performed the Hajj, Hadrat Aishah رضي الله عنها said: O my sister's son! You should go to Hadrat Abdullah and, for my sake, get this Hadrat endorsed by him which you have narrated to me. I went and asked him, he, whereupon, narrated the Hadith as I had narrated it. It then came to Hadrat Aishah رضي الله عنها and told her, so she in amazement, said: By Allah! Abdullah bin Umer رضي الله عنه has retained it.",
        "malay_translation": "Aku mendengar Rasulullah ﷺ bersabda, \"Allah tidak akan mencabut ilmu daripada kamu setelah Dia memberikannya kepadamu, tetapi ia akan diambil melalui kematian para ulama dengan ilmu mereka. Kemudian akan tinggal orang-orang jahil yang apabila diminta pendapat, mereka akan memberikan keputusan menurut pandangan mereka sendiri, lalu mereka menyesatkan orang lain dan sesat sendiri.\" Kemudian aku meriwayatkan hadis ini kepada Saidatina Aisyah رضي الله عنها, isteri Nabi. Ketika Saidina Abdullah bin Umar menunaikan haji, Saidatina Aisyah رضي الله عنها berkata: Wahai anak saudara perempuan saya! Pergilah kepada Saidina Abdullah dan, demi aku, dapatkan pengesahan hadis ini daripada beliau yang telah engkau ceritakan kepadaku. Aku pergi dan bertanya kepadanya, lalu dia meriwayatkan hadis tersebut sepertimana yang telah aku ceritakan. Kemudian ia sampai kepada Saidatina Aisyah رضي الله عنها dan menceritakan kepadanya, lalu beliau dengan kagum berkata: Demi Allah! Abdullah bin Umar رضي الله عنه telah mengingatnya.",
        "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ تَلِيدٍ، حَدَّثَنِي ابْنُ وَهْبٍ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ شُرَيْحٍ، وَغَيْرُهُ، عَنْ أَبِي الأَسْوَدِ، عَنْ عُرْوَةَ، قَالَ حَجَّ عَلَيْنَا عَبْدُ اللَّهِ بْنُ عَمْرٍو فَسَمِعْتُهُ يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنَّ اللَّهَ لاَ يَنْزِعُ الْعِلْمَ بَعْدَ أَنْ أَعْطَاهُمُوهُ انْتِزَاعًا، وَلَكِنْ يَنْتَزِعُهُ مِنْهُمْ مَعَ قَبْضِ الْعُلَمَاءِ بِعِلْمِهِمْ، فَيَبْقَى نَاسٌ جُهَّالٌ يُسْتَفْتَوْنَ فَيُفْتُونَ بِرَأْيِهِمْ، فَيُضِلُّونَ وَيَضِلُّونَ ‏\"‏‏.‏ فَحَدَّثْتُ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم ثُمَّ إِنَّ عَبْدَ اللَّهِ بْنَ عَمْرٍو حَجَّ بَعْدُ فَقَالَتْ يَا ابْنَ أُخْتِي انْطَلِقْ إِلَى عَبْدِ اللَّهِ فَاسْتَثْبِتْ لِي مِنْهُ الَّذِي حَدَّثْتَنِي عَنْهُ‏.‏ فَجِئْتُهُ فَسَأَلْتُهُ فَحَدَّثَنِي بِهِ كَنَحْوِ مَا حَدَّثَنِي، فَأَتَيْتُ عَائِشَةَ فَأَخْبَرْتُهَا فَعَجِبَتْ فَقَالَتْ وَاللَّهِ لَقَدْ حَفِظَ عَبْدُ اللَّهِ بْنُ عَمْرٍو‏.‏"
      },
      {
        "id": 7006,
        "hadith_number": "7308",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Peperangan Siffin:  Kesaksian Abu Wail dan Nasihat Sehl bin Hunaif",
        "perawi_melayu": "Riwayat Al-A`mash:",
        "english_text": "I asked Abu Wail, \"Did you participate in Siffeen war? He replied: Yes! I heard Sehl bin Honaif said: 'O people! Blame your personal opinions in your religion. No doubt, I remember myself on the day of Abi Jandal رضي الله عنه; if I had the power to refuse the order of Allah's Messenger (ﷺ), I would have refused it. We have never put our swords on our shoulders to get involved in a situation that might have been horrible for us, but those swords brought us to victory and peace, except this present situation.' \" Abu Wail said, \"I witnessed the battle of Siffin, and it was the worst lining up (for fight).",
        "malay_translation": "Aku bertanya kepada Abu Wail, \"Adakah engkau menyertai peperangan Siffin?\" Jawabnya: \"Ya! Aku mendengar Sehl bin Hunaif berkata: 'Wahai manusia! Salahkanlah pendapat peribadi kamu dalam agama kamu. Sesungguhnya, aku mengingati diriku pada hari Abi Jandal رضي الله عنه; sekiranya aku berkuasa untuk menolak perintah Rasulullah ﷺ, nescaya aku akan menolaknya. Kita tidak pernah mengangkat pedang ke bahu untuk terlibat dalam situasi yang mungkin buruk bagi kita, tetapi pedang-pedang itu membawa kita kepada kemenangan dan keamanan, kecuali situasi sekarang ini.'\"  Abu Wail berkata, \"Aku menyaksikan peperangan Siffin, dan ia merupakan perbarisan yang paling buruk (untuk berperang).\"",
        "arabic_text": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا أَبُو حَمْزَةَ، سَمِعْتُ الأَعْمَشَ، قَالَ سَأَلْتُ أَبَا وَائِلٍ هَلْ شَهِدْتَ صِفِّينَ قَالَ نَعَمْ‏.‏ فَسَمِعْتُ سَهْلَ بْنَ حُنَيْفٍ، يَقُولُ ح وَحَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، قَالَ قَالَ سَهْلُ بْنُ حُنَيْفٍ يَا أَيُّهَا النَّاسُ اتَّهِمُوا رَأْيَكُمْ عَلَى دِينِكُمْ، لَقَدْ رَأَيْتُنِي يَوْمَ أَبِي جَنْدَلٍ وَلَوْ أَسْتَطِيعُ أَنَّ أَرُدَّ أَمْرَ رَسُولِ اللَّهِ صلى الله عليه وسلم لَرَدَدْتُهُ، وَمَا وَضَعْنَا سُيُوفَنَا عَلَى عَوَاتِقِنَا إِلَى أَمْرٍ يُفْظِعُنَا إِلاَّ أَسْهَلْنَ بِنَا إِلَى أَمْرٍ نَعْرِفُهُ غَيْرَ هَذَا الأَمْرِ‏.‏ قَالَ وَقَالَ أَبُو وَائِلٍ شَهِدْتُ صِفِّينَ وَبِئْسَتْ صِفُّونَ‏.‏"
      },
      {
        "id": 7007,
        "hadith_number": "7309",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ziarah Rasulullah dan Pengurusan Harta",
        "perawi_melayu": "Jabir bin Abdullah:",
        "english_text": "I fell ill, Allah's Messenger (ﷺ) and Abu Bakr رضي الله عنه came to visit me on foot. The Prophet (ﷺ) came to me while I was unconscious. Allah's Messenger (ﷺ) performed ablution and poured the Remaining water of his ablution over me whereupon I became conscious and said, 'O Allah's Messenger (ﷺ)! How should I spend my wealth? Or how should I deal with my wealth?\" But the Prophet (ﷺ) did not give me any reply till the Verse of the laws of inheritance was revealed.",
        "malay_translation": "Saya jatuh sakit, Rasulullah ﷺ dan Abu Bakar رضي الله عنه datang melawat saya dengan berjalan kaki. Nabi ﷺ datang kepada saya ketika saya tidak sedarkan diri. Rasulullah ﷺ berwuduk dan menyiramkan air wuduknya yang tinggal ke atas saya lalu saya sedar dan berkata, 'Wahai Rasulullah ﷺ! Bagaimanakah saya perlu membelanjakan harta saya? Atau bagaimanakah saya perlu menguruskan harta saya?' Namun Nabi ﷺ tidak memberi sebarang jawapan sehingga ayat-ayat tentang hukum faraid diturunkan.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ ابْنَ الْمُنْكَدِرِ، يَقُولُ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ مَرِضْتُ فَجَاءَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم يَعُودُنِي وَأَبُو بَكْرٍ وَهُمَا مَاشِيَانِ، فَأَتَانِي وَقَدْ أُغْمِيَ عَلَىَّ فَتَوَضَّأَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَبَّ وَضُوءَهُ عَلَىَّ فَأَفَقْتُ فَقُلْتُ يَا رَسُولَ اللَّهِ ـ وَرُبَّمَا قَالَ سُفْيَانُ فَقُلْتُ أَىْ رَسُولَ اللَّهِ ـ كَيْفَ أَقْضِي فِي مَالِي كَيْفَ أَصْنَعُ فِي مَالِي قَالَ فَمَا أَجَابَنِي بِشَىْءٍ حَتَّى نَزَلَتْ آيَةُ الْمِيرَاثِ‏.‏"
      },
      {
        "id": 7008,
        "hadith_number": "7310",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keutamaan Wanita yang Kehilangan Anak",
        "perawi_melayu": "Riwayat Abu Sa`id al-Khudri:",
        "english_text": "A woman came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Men (only) benefit by your teachings, so please devote to us from (some of) your time, a day on which we may come to you so that you may teach us of what Allah has taught you.\" Allah's Messenger (ﷺ) said, \"Gather on such-and-such a day at such-and-such a place.\" They gathered and Allah's Messenger (ﷺ) came to them and taught them of what Allah had taught him. He then said, \"No woman among you who has lost her three children (died) but that they will screen her from the Fire.\" A woman among them said, \"O Allah's Messenger (ﷺ)! If she lost two children?\" She repeated her question twice, whereupon the Prophet (ﷺ) said, \"Even two, even two, even two!\" (See Hadith No. 341, Vol. 2)",
        "malay_translation": "Seorang wanita datang kepada Rasulullah ﷺ dan berkata, \"Wahai Rasulullah ﷺ! Hanya lelaki sahaja yang mendapat manfaat daripada pengajaran tuan, maka berilah kami sebahagian daripada masa tuan, satu hari di mana kami boleh datang kepada tuan supaya tuan dapat mengajar kami apa yang Allah telah ajar kepada tuan.\" Rasulullah ﷺ bersabda, \"Kumpulkan pada hari begini di tempat begini.\" Mereka berkumpul dan Rasulullah ﷺ datang kepada mereka dan mengajar mereka apa yang Allah telah ajar kepada Baginda. Kemudian Baginda bersabda, \"Tiada seorang pun wanita di kalangan kamu yang kehilangan tiga orang anaknya (mati) melainkan mereka akan menjadi perisai baginya daripada Api Neraka.\" Seorang wanita di kalangan mereka berkata, \"Wahai Rasulullah ﷺ! Bagaimana jika dia kehilangan dua orang anaknya?\"  Dia mengulangi soalannya sebanyak dua kali, lalu Nabi ﷺ bersabda, \"Walaupun dua, walaupun dua, walaupun dua!\" (Lihat Hadis No. 341, Jilid 2)",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَصْبَهَانِيِّ، عَنْ أَبِي صَالِحٍ، ذَكْوَانَ عَنْ أَبِي سَعِيدٍ، جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ ذَهَبَ الرِّجَالُ بِحَدِيثِكَ، فَاجْعَلْ لَنَا مِنْ نَفْسِكَ، يَوْمًا نَأْتِيكَ فِيهِ تُعَلِّمُنَا مِمَّا عَلَّمَكَ اللَّهُ‏.‏ فَقَالَ ‏\"‏ اجْتَمِعْنَ فِي يَوْمِ كَذَا وَكَذَا فِي مَكَانِ كَذَا وَكَذَا ‏\"‏‏.‏ فَاجْتَمَعْنَ فَأَتَاهُنَّ رَسُولُ اللَّهِ صلى الله عليه وسلم فَعَلَّمَهُنَّ مِمَّا عَلَّمَهُ اللَّهُ ثُمَّ قَالَ ‏\"‏ مَا مِنْكُنَّ امْرَأَةٌ تُقَدِّمُ بَيْنَ يَدَيْهَا مِنْ وَلَدِهَا ثَلاَثَةً، إِلاَّ كَانَ لَهَا حِجَابًا مِنَ النَّارِ ‏\"‏‏.‏ فَقَالَتِ امْرَأَةٌ مِنْهُنَّ يَا رَسُولَ اللَّهِ اثْنَيْنِ قَالَ فَأَعَادَتْهَا مَرَّتَيْنِ ثُمَّ قَالَ ‏\"‏ وَاثْنَيْنِ وَاثْنَيْنِ وَاثْنَيْنِ ‏\"‏‏.‏"
      },
      {
        "id": 7009,
        "hadith_number": "7311",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keunggulan Pengikut Nabi SAW Sehingga Hari Kiamat",
        "perawi_melayu": "Riwayat Al-Mughira bin Shu`ba رضي الله عنه :",
        "english_text": "The Prophet (ﷺ) said, \"A group of my followers will remain predominant (victorious) till Allah's Order (the Hour) comes upon them while they are still predominant (victorious).",
        "malay_translation": "Rasulullah SAW bersabda: \"Segolongan pengikutku akan tetap unggul (menang) sehingga datangnya perintah Allah (hari kiamat)  ketika mereka masih unggul (menang).\"",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَزَالُ طَائِفَةٌ مِنْ أُمَّتِي ظَاهِرِينَ حَتَّى يَأْتِيَهُمْ أَمْرُ اللَّهِ وَهُمْ ظَاهِرُونَ ‏\"‏‏.‏"
      },
      {
        "id": 7010,
        "hadith_number": "7312",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kefahaman Al-Quran dan Sunnah Sebagai Nikmat Allah",
        "perawi_melayu": "Riwayat Humaid:",
        "english_text": "I heard Muawiya bin Abi Sufyan رضی اللہ عنہ delivering a sermon. He said, \"I heard the Prophet (ﷺ) saying, \"If Allah wants to do a favor to somebody, He bestows on him, the gift of understanding the Qur'an and Sunna. I am but a distributor, and Allah is the Giver. The state of this nation will remain good till the Hour is established, or till Allah's Order comes.\"",
        "malay_translation": "Aku mendengar Muawiyah bin Abi Sufyan menyampaikan khutbah.  Beliau berkata, \"Aku mendengar Rasulullah ﷺ bersabda,  \"Jika Allah SWT hendak memberi kurnia kepada seseorang, Allah SWT akan menganugerahkan kepadanya kefahaman Al-Quran dan Sunnah. Aku hanyalah penyampai, dan Allah SWT jualah Yang Maha Pemberi. Keadaan umat ini akan tetap baik sehingga tiba hari kiamat, atau sehingga datang perintah Allah SWT.\"",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي حُمَيْدٌ، قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ، يَخْطُبُ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُفَقِّهْهُ فِي الدِّينِ، وَإِنَّمَا أَنَا قَاسِمٌ وَيُعْطِي اللَّهُ، وَلَنْ يَزَالَ أَمْرُ هَذِهِ الأُمَّةِ مُسْتَقِيمًا حَتَّى تَقُومَ السَّاعَةُ، أَوْ حَتَّى يَأْتِيَ أَمْرُ اللَّهِ ‏\"‏‏.‏"
      },
      {
        "id": 7011,
        "hadith_number": "7313",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Doa Rasulullah SAW Ketika Ayat Azab Diturunkan",
        "perawi_melayu": "Jabir bin Abdullah رضي الله عنهما",
        "english_text": "When the (following) Verse was revealed to Allah's Messenger (ﷺ): 'Say: He has power to send torment on you from above,'..(6.65) he said, \"O Allah! I seek refuge with Your Face (from that punishment).\" And when this was revealed: '..or from beneath your feet.' (6.65) he said, \"O Allah! I seek refuge with Your Face (from that).\" And when this Verse was revealed: '..or to cover you with confusion in partystrife, and make you to taste the violence of one another,'...(6.65) he said: \"These two warnings are easier (than the previous ones).",
        "malay_translation": "Apabila ayat berikut diturunkan kepada Rasulullah SAW:  'Katakanlah: Dia Maha Kuasa untuk menimpakan azab kepadamu dari atas...' (6:65), baginda bersabda, \"Ya Allah, aku berlindung dengan wajah-Mu (dari azab itu).\" Dan apabila ayat ini diturunkan:  '...atau dari bawah kakimu...' (6:65), baginda bersabda, \"Ya Allah, aku berlindung dengan wajah-Mu (dari azab itu).\" Dan apabila ayat ini diturunkan:  '...atau untuk menjerumuskan kamu ke dalam perselisihan dan permusuhan, serta saling memerangi antara satu sama lain...' (6:65), baginda bersabda: \"Kedua-dua peringatan ini lebih ringan (daripada peringatan sebelumnya).\"",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ عَمْرٌو سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ يَقُولُ لَمَّا نَزَلَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم ‏{‏قُلْ هُوَ الْقَادِرُ عَلَى أَنْ يَبْعَثَ عَلَيْكُمْ عَذَابًا مِنْ فَوْقِكُمْ‏}‏ قَالَ ‏\"‏ أَعُوذُ بِوَجْهِكَ ‏\"‏‏.‏ ‏{‏أَوْ مِنْ تَحْتِ أَرْجُلِكُمْ‏}‏ قَالَ ‏\"‏ أَعُوذُ بِوَجْهِكَ ‏\"‏‏.‏ فَلَمَّا نَزَلَتْ ‏{‏أَوْ يَلْبِسَكُمْ شِيَعًا وَيُذِيقَ بَعْضَكُمْ بَأْسَ بَعْضٍ‏}‏ قَالَ ‏\"‏ هَاتَانِ أَهْوَنُ أَوْ أَيْسَرُ ‏\"‏‏.‏"
      },
      {
        "id": 7012,
        "hadith_number": "7314",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Anak Berkulit Hitam dan Keturunan",
        "perawi_melayu": "Riwayat Abu Hurairah رضي الله عنه :",
        "english_text": "A bedouin came to Allah's Messenger (ﷺ) and said, \"My wife has delivered a black boy, and I suspect that he is not my child.\" Allah's Messenger (ﷺ) said to him, \"Have you got camels?\" The bedouin said, \"Yes.\" The Prophet said, \"What color are they?\" The bedouin said, \"They are red.\" The Prophet (ﷺ) said, \"Are any of them Grey?\" He said, \"There are Grey ones among them.\" The Prophet (ﷺ) said, \"Whence do you think this color came to them?\" The bedouin said, \"O Allah's Messenger (ﷺ)! It resulted from hereditary disposition.\" The Prophet (ﷺ) said, \"And this (i.e., your child) has inherited his color from his ancestors.\" The Prophet (ﷺ) did not allow him to deny his paternity of the child.",
        "malay_translation": "Seorang Badwi datang kepada Rasulullah ﷺ dan berkata, \"Isteriku telah melahirkan seorang anak lelaki berkulit hitam, dan aku mengesyaki bahawa dia bukan anakku.\" Rasulullah ﷺ bertanya kepadanya, \"Adakah engkau mempunyai unta?\" Badwi itu menjawab, \"Ya.\" Nabi ﷺ bertanya lagi, \"Apakah warna unta-untamu?\" Badwi itu berkata, \"Ia berwarna merah.\" Nabi ﷺ bertanya, \"Adakah di antaranya yang berwarna kelabu?\" Jawab Badwi itu, \"Ya, ada di antaranya yang berwarna kelabu.\" Nabi ﷺ bertanya, \"Dari manakah menurut pendapatmu warna itu datang kepada unta-untamu?\" Badwi itu menjawab, \"Wahai Rasulullah ﷺ! Ia disebabkan oleh keturunan.\" Nabi ﷺ bersabda, \"Dan anak ini (iaitu, anakmu) telah mewarisi warna kulitnya daripada nenek moyangnya.\" Nabi ﷺ tidak membenarkannya untuk menafikan bahawa anak itu adalah anaknya.",
        "arabic_text": "حَدَّثَنَا أَصْبَغُ بْنُ الْفَرَجِ، حَدَّثَنِي ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ أَعْرَابِيًّا، أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنَّ امْرَأَتِي وَلَدَتْ غُلاَمًا أَسْوَدَ، وَإِنِّي أَنْكَرْتُهُ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلْ لَكَ مِنْ إِبِلٍ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَمَا أَلْوَانُهَا ‏\"‏‏.‏ قَالَ حُمْرٌ‏.‏ قَالَ ‏\"‏ هَلْ فِيهَا مِنْ أَوْرَقَ ‏\"‏‏.‏ قَالَ إِنَّ فِيهَا لَوُرْقًا‏.‏ قَالَ ‏\"‏ فَأَنَّى تُرَى ذَلِكَ جَاءَهَا ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ عِرْقٌ نَزَعَهَا‏.‏ قَالَ ‏\"‏ وَلَعَلَّ هَذَا عِرْقٌ نَزَعَهُ ‏\"‏‏.‏ وَلَمْ يُرَخِّصْ لَهُ فِي الاِنْتِفَاءِ مِنْهُ‏.‏"
      },
      {
        "id": 7013,
        "hadith_number": "7315",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menunaikan Haji Bagi Pihak Ibu yang Meninggal",
        "perawi_melayu": "Riwayat Ibnu Abbas رضي الله عنهما:",
        "english_text": "A woman came to the Prophet (ﷺ) and said, \"My mother vowed to perform the Hajj but she died before performing it. Should I perform the Hajj on her behalf?\" He said, \"Yes! Perform the Hajj on her behalf. See, if your mother had been in debt, would you have paid her debt?\" She said, \"Yes.\" He said, \"So you should pay what is for Him as Allah has more right that one should fulfill one's obligations to Him. \"",
        "malay_translation": "Seorang wanita datang kepada Nabi SAW dan berkata, \"Ibu saya telah bernazar untuk menunaikan haji, tetapi beliau meninggal dunia sebelum sempat melakukannya. Patutkah saya menunaikan haji bagi pihak beliau?\" Baginda SAW bersabda, \"Ya! Tunaikanlah haji bagi pihak beliau. Lihatlah, jika ibumu berhutang, adakah kamu akan membayar hutangnya?\" Wanita itu menjawab, \"Ya.\" Baginda SAW bersabda, \"Oleh itu, kamu hendaklah menunaikan apa yang menjadi hak-Nya kerana Allah SWT lebih berhak untuk ditunaikan kewajipannya.\" ",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ امْرَأَةً، جَاءَتْ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ إِنَّ أُمِّي نَذَرَتْ أَنْ تَحُجَّ فَمَاتَتْ قَبْلَ أَنْ تَحُجَّ أَفَأَحُجَّ عَنْهَا قَالَ ‏\"‏ نَعَمْ حُجِّي عَنْهَا، أَرَأَيْتِ لَوْ كَانَ عَلَى أُمِّكِ دَيْنٌ أَكُنْتِ قَاضِيَتَهُ ‏\"‏‏.‏ قَالَتْ نَعَمْ‏.‏ فَقَالَ ‏\"‏ فَاقْضُوا الَّذِي لَهُ، فَإِنَّ اللَّهَ أَحَقُّ بِالْوَفَاءِ ‏\"‏‏.‏"
      },
      {
        "id": 7014,
        "hadith_number": "7316",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Jangan Berharap Menjadi Seperti Orang Lain Kecuali Dua Keadaan",
        "perawi_melayu": "Riwayat Abdullah bin Mas'ud",
        "english_text": "Allah's Messenger (ﷺ) said, \"Do not wish to be like anybody except in two cases: The case of a man whom Allah has given wealth and he spends it in the right way, and that of a man whom Allah has given religious wisdom (i.e., Qur'an and Sunna) and he gives his verdicts according to it and teaches it.\" (to others i.e., religious knowledge of Qur'an and Sunna (Prophet's Traditions)). ",
        "malay_translation": "Rasulullah SAW bersabda: \"Janganlah kamu menginginkan untuk menjadi seperti seseorang kecuali dalam dua keadaan: iaitu orang yang Allah berikan kepadanya kekayaan lalu dia membelanjakannya dengan cara yang betul, dan orang yang Allah berikan kepadanya kefahaman agama (iaitu al-Quran dan Sunnah) lalu dia memberi hukum berdasarkannya dan mengajarkannya (kepada orang lain iaitu ilmu agama al-Quran dan Sunnah (tradisi Nabi)).\"",
        "arabic_text": "حَدَّثَنَا شِهَابُ بْنُ عَبَّادٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ حُمَيْدٍ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ حَسَدَ إِلاَّ فِي اثْنَتَيْنِ رَجُلٌ آتَاهُ اللَّهُ مَالاً فَسُلِّطَ عَلَى هَلَكَتِهِ فِي الْحَقِّ، وَآخَرُ آتَاهُ اللَّهُ حِكْمَةً فَهْوَ يَقْضِي بِهَا وَيُعَلِّمُهَا ‏\"‏‏.‏"
      },
      {
        "id": 7015,
        "hadith_number": "7317, 7318",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Daya (Wang Tebusan) Bagi Kandungan yang Gugur Akibat Pukulan",
        "perawi_melayu": "Riwayat Al-Mughira bin Syu'bah:",
        "english_text": "`Umar bin Al-Khattab رضی اللہ عنہ  asked (the people) about the Imlas of a woman, i.e., a woman who has an abortion because of having been beaten on her `Abdomen, saying, \"Who among you has heard anything about it from the Prophet?\" I said, \"I did.\" He said, \"What is that?\" I said, \"I heard the Prophet saying, 'Its Diya (blood money) is either a male or a female slave.' \" `Umar رضی اللہ عنہ said, \"Do not leave till you present witness in support of your statement.\" So I went out, and found Muhammad bin Maslama رضی اللہ عنہ. I brought him, and he bore witness with me that he had heard the Prophet (ﷺ) saying, \"Its Diya (blood money) is either a male slave or a female slave.\" Similarly, Ibn-e-Abu Zinad, hisfather, Urwah bin Zubair has reported from Hadrat Mogheerah bin Shibah رضی اللہ عنہ.",
        "malay_translation": "Umar bin al-Khattab bertanya kepada orang ramai tentang imlas seorang wanita, iaitu seorang wanita yang keguguran akibat dipukul di bahagian perutnya, sambil berkata, \"Siapakah di antara kamu yang pernah mendengar sesuatu mengenainya daripada Nabi?\" Aku berkata, \"Aku pernah.\" Beliau bertanya, \"Apakah itu?\" Aku menjawab, \"Aku mendengar Nabi SAW bersabda, 'Daya (wang tebusan)nya ialah sama ada seorang hamba lelaki atau hamba perempuan.'\" Umar berkata, \"Janganlah kamu pergi sehingga kamu membawa saksi untuk menyokong kenyataan kamu.\" Maka aku keluar, dan menjumpai Muhammad bin Maslama. Aku membawanya, dan dia memberi keterangan bersamaku bahawa dia telah mendengar Nabi SAW bersabda, \"Daya (wang tebusannya) ialah sama ada seorang hamba lelaki atau hamba perempuan.\" Begitu juga, Ibnu Abu Zinad, bapanya, Urwah bin Zubair telah meriwayatkan daripada Mughirah bin Syabah.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ سَأَلَ عُمَرُ بْنُ الْخَطَّابِ عَنْ إِمْلاَصِ الْمَرْأَةِ ـ هِيَ الَّتِي يُضْرَبُ بَطْنُهَا فَتُلْقِي جَنِينًا ـ فَقَالَ أَيُّكُمْ سَمِعَ مِنَ النَّبِيِّ صلى الله عليه وسلم فِيهِ شَيْئًا فَقُلْتُ أَنَا‏.‏ فَقَالَ مَا هُوَ قُلْتُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏ فِيهِ غُرَّةٌ عَبْدٌ أَوْ أَمَةٌ ‏\"‏‏.‏ فَقَالَ لاَ تَبْرَحْ حَتَّى تَجِيئَنِي بِالْمَخْرَجِ فِيمَا قُلْتَ‏. فَخَرَجْتُ فَوَجَدْتُ مُحَمَّدَ بْنَ مَسْلَمَةَ فَجِئْتُ بِهِ، فَشَهِدَ مَعِي أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏ فِيهِ غُرَّةٌ عَبْدٌ أَوْ أَمَةٌ ‏\"‏‏.‏ تَابَعَهُ ابْنُ أَبِي الزِّنَادِ عَنْ أَبِيهِ عَنْ عُرْوَةَ عَنِ الْمُغِيرَةِ‏.‏"
      },
      {
        "id": 7016,
        "hadith_number": "7319",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Meniru Amalan Umat Terdahulu Sebelum Kiamat",
        "perawi_melayu": "Riwayat Abu Hurairah رضي الله عنه :",
        "english_text": "The Prophet (ﷺ) said, \"The Hour will not be established till my followers copy the deeds of the previous nations and follow them very closely, span by span, and cubit by cubit (i.e., inch by inch).\" It was said, \"O Allah's Messenger (ﷺ)! Do you mean by those (nations) the Persians and the Byzantines?\" The Prophet said, \"Who can it be other than they?\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Hari Kiamat tidak akan tiba sehingga pengikut-pengikutku meniru amalan umat-umat terdahulu dan mengikutinya dengan sangat teliti, sejengkal demi sejengkal, dan hasta demi hasta (iaitu, inci demi inci).\"  Kemudian ditanya, \"Wahai Rasulullah ﷺ! Adakah yang dimaksudkan dengan umat-umat itu ialah orang-orang Parsi dan Rom?\" Rasulullah ﷺ bersabda, \"Siapakah lagi selain daripada mereka?\"",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، رضى الله عنه عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تَأْخُذَ أُمَّتِي بِأَخْذِ الْقُرُونِ قَبْلَهَا، شِبْرًا بِشِبْرٍ وَذِرَاعًا بِذِرَاعٍ ‏\"‏‏.‏ فَقِيلَ يَا رَسُولَ اللَّهِ كَفَارِسَ وَالرُّومِ‏.‏ فَقَالَ ‏\"‏ وَمَنِ النَّاسُ إِلاَّ أُولَئِكَ ‏\"‏‏.‏"
      },
      {
        "id": 7017,
        "hadith_number": "7320",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Mengikuti Jejak Bangsa-Bangsa Sebelumnya",
        "perawi_melayu": "Riwayat Abu Sa`id Al-Khudri رضي الله عنه :",
        "english_text": "The Prophet (ﷺ) said, \"You will follow the ways of those nations who were before you, span by span and cubit by cubit (i.e., inch by inch) so much so that even if they entered a hole of a mastigure, you would follow them.\" We said, \"O Allah's Messenger (ﷺ)! (Do you mean) the Jews and the Christians?\" He said, \"Whom else?\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Kamu akan mengikuti jalan-jalan bangsa-bangsa sebelum kamu, sejengkal demi sejengkal dan sehasta demi sehasta (iaitu, inci demi inci) sehingga sekiranya mereka masuk ke dalam lubang biawak, nescaya kamu akan mengikutinya.\" Kami berkata, \"Wahai Rasulullah ﷺ! (Yang dimaksudkan) adakah Yahudi dan Nasrani?\" Baginda bersabda, \"Siapa lagi?\" ",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ، حَدَّثَنَا أَبُو عُمَرَ الصَّنْعَانِيُّ ـ مِنَ الْيَمَنِ ـ عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لَتَتْبَعُنَّ سَنَنَ مَنْ كَانَ قَبْلَكُمْ شِبْرًا شِبْرًا وَذِرَاعًا بِذِرَاعٍ، حَتَّى لَوْ دَخَلُوا جُحْرَ ضَبٍّ تَبِعْتُمُوهُمْ ‏\"‏‏.‏ قُلْنَا يَا رَسُولَ اللَّهِ الْيَهُودُ وَالنَّصَارَى قَالَ ‏\"‏ فَمَنْ ‏\"‏‏.‏"
      },
      {
        "id": 7018,
        "hadith_number": "7321",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Tanggungjawab  Ke Atas Pembunuhan Yang Zalim",
        "perawi_melayu": "Daripada Abdullah bin Al-Harith:",
        "english_text": "The Prophet (ﷺ) said, \"None is killed unjustly, but the first son of Adam will have a part of its burden.\" Sufyan said, \"..a part of its blood because he was the first to establish the tradition of murdering\"",
        "malay_translation": "Rasulullah SAW bersabda: \"Tidak seorang pun dibunuh secara zalim melainkan anak Adam yang pertama (Qabil) akan menanggung sebahagian daripada dosanya.\"  Sufyan berkata: \"… sebahagian daripada darahnya kerana dia adalah orang pertama yang memulakan tradisi pembunuhan.\"",
        "arabic_text": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الأَعْمَشُ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لَيْسَ مِنْ نَفْسٍ تُقْتَلُ ظُلْمًا إِلاَّ كَانَ عَلَى ابْنِ آدَمَ الأَوَّلِ كِفْلٌ مِنْهَا ـ وَرُبَّمَا قَالَ سُفْيَانُ مِنْ دَمِهَا ـ لأَنَّهُ أَوَّلُ مَنْ سَنَّ الْقَتْلَ أَوَّلاً ‏\"‏‏.‏"
      },
      {
        "id": 7019,
        "hadith_number": "7322",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Orang Badwi dan Bai'ah di Madinah",
        "perawi_melayu": "Jabir bin 'Abdullah As-Salami رضي الله عنه :",
        "english_text": "A bedouin gave the Pledge of allegiance for embracing Islam to Allah's Messenger (ﷺ), and then he got an attack of fever in Medina and came to Allah's Messenger (ﷺ): and said, \"O Allah's Messenger (ﷺ)! Cancel my pledge.\" Allah's Messenger (ﷺ) refused to do so. The bedouin came to him again and said, \"Cancel my pledge,\" but he refused again, and then again, the bedouin came to him and said, \"Cancel my pledge,\" and Allah's Messenger (ﷺ) refused. The bedouin finally went away, and Allah's Messenger (ﷺ) said, \"Medina is like a pair of bellows (furnace), it expels its impurities while it brightens and clears its good.'",
        "malay_translation": "Seorang Badwi memberi bai'ah (ikrar setia) untuk memeluk Islam kepada Rasulullah ﷺ, kemudian dia demam di Madinah dan datang kepada Rasulullah ﷺ lalu berkata, \"Wahai Rasulullah ﷺ! Batalkanlah bai'ahku.\" Rasulullah ﷺ enggan berbuat demikian. Orang Badwi itu datang lagi kepadanya dan berkata, \"Batalkanlah bai'ahku,\" tetapi Baginda enggan sekali lagi. Kemudian, sekali lagi orang Badwi itu datang kepadanya dan berkata, \"Batalkanlah bai'ahku,\" dan Rasulullah ﷺ enggan. Akhirnya, orang Badwi itu pergi, dan Rasulullah ﷺ bersabda, \"Madinah itu seperti alat tempa (tanur), ia mengeluarkan kekotorannya sementara ia mencerahkan dan membersihkan kebaikannya.\"",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ السَّلَمِيِّ، أَنَّ أَعْرَابِيًّا، بَايَعَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى الإِسْلاَمِ، فَأَصَابَ الأَعْرَابِيَّ وَعْكٌ بِالْمَدِينَةِ، فَجَاءَ الأَعْرَابِيُّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَقِلْنِي بَيْعَتِي‏.‏ فَأَبَى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ جَاءَهُ فَقَالَ أَقِلْنِي بَيْعَتِي‏.‏ فَأَبَى ثُمَّ جَاءَهُ فَقَالَ أَقِلْنِي بَيْعَتِي‏.‏ فَأَبَى فَخَرَجَ الأَعْرَابِيُّ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّمَا الْمَدِينَةُ كَالْكِيرِ، تَنْفِي خَبَثَهَا، وَيَنْصَعُ طِيبُهَا ‏\"‏‏.‏"
      },
      {
        "id": 7020,
        "hadith_number": "7323",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nasihat Ibnu Abbas kepada Umar bin al-Khattab",
        "perawi_melayu": "Riwayat Ibnu Abbas رضي الله عنهما:",
        "english_text": "I used to teach Qur'an to 'Abdur-Rahman bin Auf رضي الله عنه. When Umar رضي الله عنه performed his last Hajj, 'Abdur-Rahman said (to me) at Mina, \"Would that you had seen Chief of the believers today! A man came to him and said, \"So-and-so has said, \"If Chief of the Believers died, we will give the oath of allegiance to such-and-such person,' 'Umar رضي الله عنه said, 'I will get up tonight and warn those who want to usurp the people's rights.' I said, 'Do not do so, for the season (of Hajj) gathers the riffraff mob who will form the majority of your audience, and I am afraid that they will not understand (the meaning of) your saying properly and may spread (an incorrect statement) everywhere. You should wait till we reach Medina, the place of migration and the place of the Sunna (the Prophet's Traditions). There you will meet the companions of Allah's Messenger (ﷺ) from the Muhajirin and the Ansar who will understand your statement and place it in its proper position' 'Umar رضي الله عنه said, 'By Allah, I shall do so the first time I stand (to address the people) in Medina.' When we reached Medina, 'Umar رضي الله عنه (in a Friday Khutba-sermon) said, \"No doubt, Allah sent Muhammad with the Truth and revealed to him the Book (Quran), and among what was revealed, was the Verse of Ar-Rajm (stoning adulterers to death).'\" (See Hadith No. 817,Vol. 8)",
        "malay_translation": "Aku pernah mengajar al-Quran kepada Abdur Rahman bin Auf رضي الله عنه. Ketika Umar رضي الله عنه menunaikan haji terakhirnya, Abdur Rahman berkata (kepadaku) di Mina, \"Alangkah baiknya jika engkau melihat Khalifah al-Mukminin hari ini! Seorang lelaki datang kepadanya dan berkata, \"Fulan telah berkata, \"Jika Khalifah al-Mukminin meninggal dunia, kami akan memberikan bai'ah kepada si fulan,\" Umar رضي الله عنه berkata, \"Aku akan bangun malam ini dan memberi amaran kepada mereka yang ingin merampas hak rakyat.\" Aku berkata, \"Jangan lakukan demikian, kerana musim (haji) mengumpulkan orang ramai yang tidak beradab yang akan membentuk majoriti pendengarmu, dan aku bimbang mereka tidak akan memahami (maksud) ucapanmu dengan betul dan mungkin menyebarkan (kenyataan yang salah) di mana-mana. Engkau harus menunggu sehingga kita sampai ke Madinah, tempat hijrah dan tempat Sunnah (Tradisi Nabi). Di sana engkau akan bertemu dengan sahabat-sahabat Rasulullah ﷺ dari kalangan Muhajirin dan Ansar yang akan memahami ucapanmu dan meletakkannya pada kedudukan yang sepatutnya.\" Umar رضي الله عنه berkata, \"Demi Allah, aku akan berbuat demikian pada kali pertama aku berdiri (untuk berkhutbah) di Madinah.\" Apabila kami sampai ke Madinah, Umar رضي الله عنه (dalam khutbah Jumaat) berkata, \"Sesungguhnya, Allah telah mengutus Muhammad dengan kebenaran dan mewahyukan kepadanya Kitab (al-Quran), dan antara apa yang diwahyukan, ialah ayat al-Rajam (merajam penzina hingga mati).\" (Lihat Hadis No. 817, Jilid 8)",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كُنْتُ أُقْرِئُ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ، فَلَمَّا كَانَ آخِرَ حَجَّةٍ حَجَّهَا عُمَرُ فَقَالَ عَبْدُ الرَّحْمَنِ بِمِنًى، لَوْ شَهِدْتَ أَمِيرَ الْمُؤْمِنِينَ أَتَاهُ رَجُلٌ قَالَ إِنَّ فُلاَنًا يَقُولُ لَوْ مَاتَ أَمِيرُ الْمُؤْمِنِينَ لَبَايَعْنَا فُلاَنًا‏.‏ فَقَالَ عُمَرُ لأَقُومَنَّ الْعَشِيَّةَ فَأُحَذِّرَ هَؤُلاَءِ الرَّهْطَ الَّذِينَ يُرِيدُونَ أَنْ يَغْصِبُوهُمْ‏.‏ قُلْتُ لاَ تَفْعَلْ فَإِنَّ الْمَوْسِمَ يَجْمَعُ رَعَاعَ النَّاسِ يَغْلِبُونَ عَلَى مَجْلِسِكَ، فَأَخَافُ أَنْ لاَ يُنْزِلُوهَا عَلَى وَجْهِهَا فَيُطِيرُ بِهَا كُلُّ مُطِيرٍ، فَأَمْهِلْ حَتَّى تَقْدَمَ الْمَدِينَةَ دَارَ الْهِجْرَةِ وَدَارَ السُّنَّةِ، فَتَخْلُصُ بِأَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنَ الْمُهَاجِرِينَ وَالأَنْصَارِ فَيَحْفَظُوا مَقَالَتَكَ، وَيُنَزِّلُوهَا عَلَى وَجْهِهَا‏.‏ فَقَالَ وَاللَّهِ لأَقُومَنَّ بِهِ فِي أَوَّلِ مَقَامٍ أَقُومُهُ بِالْمَدِينَةِ‏.‏ قَالَ ابْنُ عَبَّاسٍ فَقَدِمْنَا الْمَدِينَةَ فَقَالَ إِنَّ اللَّهَ بَعَثَ مُحَمَّدًا صلى الله عليه وسلم بِالْحَقِّ وَأَنْزَلَ عَلَيْهِ الْكِتَابَ، فَكَانَ فِيمَا أُنْزِلَ آيَةُ الرَّجْمِ‏.‏"
      },
      {
        "id": 7021,
        "hadith_number": "7324",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kehidupan Sederhana Abu Hurairah",
        "perawi_melayu": "Riwayat Muhammad:",
        "english_text": "We were with Abu Huraira رضی اللہ عنہ کwhile he was wearing two linen garments dyed with red clay. He cleaned his nose with his garment, saying, \"Bravo! Bravo! Abu Huraira رضی اللہ عنہ is cleaning his nose with linen! There came a time when I would fall senseless between the pulpit of Allah's Messenger (ﷺ) and `Aisha's dwelling whereupon a passerby would come and put his foot on my neck, considering me a mad man, but in fact, I had no madness, I suffered nothing but hunger.",
        "malay_translation": "Kami berada bersama Abu Hurairah ketika beliau memakai dua helai pakaian linen yang diwarnakan dengan tanah liat merah. Beliau membersihkan hidungnya dengan pakaian tersebut sambil berkata, \"Bagus! Bagus! Abu Hurairah sedang membersihkan hidungnya dengan kain linen! Ada suatu ketika, aku akan pengsan di antara mimbar Rasulullah ﷺ dan kediaman Aisyah. Lalu orang yang lalu lalang akan memijak leherku, menyangka aku orang gila, tetapi sebenarnya aku tidak gila, aku hanya menderita kerana lapar.",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، قَالَ كُنَّا عِنْدَ أَبِي هُرَيْرَةَ وَعَلَيْهِ ثَوْبَانِ مُمَشَّقَانِ مِنْ كَتَّانٍ فَتَمَخَّطَ فَقَالَ بَخْ بَخْ أَبُو هُرَيْرَةَ يَتَمَخَّطُ فِي الْكَتَّانِ، لَقَدْ رَأَيْتُنِي وَإِنِّي لأَخِرُّ فِيمَا بَيْنَ مِنْبَرِ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى حُجْرَةِ عَائِشَةَ مَغْشِيًّا عَلَىَّ، فَيَجِيءُ الْجَائِي فَيَضَعُ رِجْلَهُ عَلَى عُنُقِي، وَيُرَى أَنِّي مَجْنُونٌ، وَمَا بِي مِنْ جُنُونٍ، مَا بِي إِلاَّ الْجُوعُ‏.‏"
      },
      {
        "id": 7022,
        "hadith_number": "7325",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Hari Raya Aidilfitri Bersama Nabi SAW",
        "perawi_melayu": "Riwayat Ibnu Abbas رضي الله عنهما:",
        "english_text": "\"Did you offer the Id prayer with the Prophet?\" He said, \"Yes, had it not been for my close relation to the Prophet, I would not have performed it (with him) because of my being too young The Prophet (ﷺ) came to the mark which is near the home of Kathir bin As-Salt and offered the Id prayer and then delivered the sermon. I do not remember if any Adhan or Iqama were pronounced for the prayer. Then the Prophet (ﷺ) ordered (the women) to give alms, and they started stretching out their hands towards their ears and throats (giving their ornaments in charity), and the Prophet (ﷺ) ordered Bilal رضي الله عنه to go to them (to collect the alms), and then Bilal رضي الله عنه returned to the Prophet.",
        "malay_translation": "\"Adakah kamu menunaikan solat Hari Raya bersama Nabi?\"  Beliau menjawab, \"Ya, sekiranya bukan kerana hubungan kekeluargaan yang rapat dengan Nabi, aku tidak akan menunaikannya (bersama baginda) kerana aku masih terlalu muda. Nabi ﷺ tiba di tempat yang berhampiran dengan rumah Kathir bin As-Salt dan menunaikan solat Hari Raya, kemudian menyampaikan khutbah. Aku tidak ingat sama ada azan atau iqamat telah dilaungkan untuk solat tersebut. Kemudian Nabi ﷺ memerintahkan (para wanita) untuk memberi sedekah, dan mereka mula menghulurkan tangan ke arah telinga dan leher mereka (memberi perhiasan sebagai sedekah), dan Nabi ﷺ memerintahkan Bilal رضي الله عنه pergi kepada mereka (untuk mengutip sedekah), dan kemudian Bilal رضي الله عنه kembali kepada Nabi.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ، قَالَ سُئِلَ ابْنُ عَبَّاسٍ أَشَهِدْتَ الْعِيدَ مَعَ النَّبِيِّ صلى الله عليه وسلم قَالَ نَعَمْ وَلَوْلاَ مَنْزِلَتِي مِنْهُ مَا شَهِدْتُهُ مِنَ الصِّغَرِ، فَأَتَى الْعَلَمَ الَّذِي عِنْدَ دَارِ كَثِيرِ بْنِ الصَّلْتِ فَصَلَّى ثُمَّ خَطَبَ، وَلَمْ يَذْكُرْ أَذَانًا وَلاَ إِقَامَةً، ثُمَّ أَمَرَ بِالصَّدَقَةِ فَجَعَلَ النِّسَاءُ يُشِرْنَ إِلَى آذَانِهِنَّ وَحُلُوقِهِنَّ، فَأَمَرَ بِلاَلاً فَأَتَاهُنَّ، ثُمَّ رَجَعَ إِلَى النَّبِيِّ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 7023,
        "hadith_number": "7326",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perjalanan Nabi SAW ke Masjid Quba'",
        "perawi_melayu": "Riwayat Ibnu Umar رضي الله عنهما:",
        "english_text": "The Prophet (ﷺ) used to go to the Quba' mosque, sometimes walking, sometimes riding.",
        "malay_translation": "Nabi SAW biasa pergi ke Masjid Quba', kadang-kadang berjalan kaki, kadang-kadang menunggang.",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَأْتِي قُبَاءً مَاشِيًا وَرَاكِبًا‏.‏"
      },
      {
        "id": 7024,
        "hadith_number": "7327, 7328",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Permintaan Abdullah bin Az-Zubair untuk Dikuburkan Bersama Para Isteri Nabi",
        "perawi_melayu": "Daripada Aisyah رضي الله عنها :",
        "english_text": "`Abdullah bin Az-Zubair رضي الله عنه berkata, \"Bury me with my female companions (i.e. the wives of the Prophet) and do not bury me with the Prophet (ﷺ) in the house, for I do not like to be regarded as sanctified (just for being buried there).\" Narrated Hisham's father: `Umar رضي الله عنه sent a message to `Aisha رضي الله عنها , saying, \"Will you allow me to be buried with my two companions (the Prophet (ﷺ) and Abu Bakr رضي الله عنه ) ?\" She said, \"Yes, by Allah.\" though it was her habit that if a man from among the companions (of the Prophet (ﷺ) ) sent her a message asking her to allow him to be buried there, she would say, \"No, by Allah, I will never give permission to anyone to be buried with them.\"",
        "malay_translation": "Abdullah bin Az-Zubair رضي الله عنه berkata, \"Kuburkanlah aku bersama para isteri Nabi ﷺ, dan janganlah kuburkan aku bersama Nabi ﷺ di dalam rumah itu, kerana aku tidak suka dianggap sebagai orang yang dimuliakan (hanya kerana dikuburkan di situ).\"  Bapa Hisham meriwayatkan: Umar رضي الله عنه menghantar pesanan kepada Aisyah رضي الله عنها,  bertanya, \"Adakah engkau membenarkan aku dikuburkan bersama dua sahabatku (Nabi ﷺ dan Abu Bakar رضي الله عنه)?\"  Aisyah menjawab, \"Ya, demi Allah.\" Walaupun kebiasaan beliau, sekiranya seorang lelaki daripada kalangan sahabat Nabi ﷺ menghantar pesanan kepadanya memohon izin untuk dikuburkan di situ, beliau akan berkata, \"Tidak, demi Allah, aku tidak akan sesekali memberi izin kepada sesiapa pun untuk dikuburkan bersama mereka.\"",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ لِعَبْدِ اللَّهِ بْنِ الزُّبَيْرِ ادْفِنِّي مَعَ صَوَاحِبِي وَلاَ تَدْفِنِّي مَعَ النَّبِيِّ صلى الله عليه وسلم فِي الْبَيْتِ، فَإِنِّي أَكْرَهُ أَنْ أُزَكَّى‏.وَعَنْ هِشَامٍ، عَنْ أَبِيهِ، أَنَّ عُمَرَ، أَرْسَلَ إِلَى عَائِشَةَ ائْذَنِي لِي أَنْ أُدْفَنَ مَعَ صَاحِبَىَّ فَقَالَتْ إِي وَاللَّهِ‏.‏ قَالَ وَكَانَ الرَّجُلُ إِذَا أَرْسَلَ إِلَيْهَا مِنَ الصَّحَابَةِ قَالَتْ لاَ وَاللَّهِ لاَ أُوثِرُهُمْ بِأَحَدٍ أَبَدًا‏.‏"
      },
      {
        "id": 7025,
        "hadith_number": "7329",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Waktu Solat Asar Rasulullah SAW",
        "perawi_melayu": "Anas bin Malik رضي الله عنه",
        "english_text": "Allah's Messenger (ﷺ) used to perform the `Asr prayer and then one could reach the `Awali (a place in the outskirts of Medina) while the sun was still quite high. Narrated Yunus: The distance of the `Awali (from Medina) was four or three miles.",
        "malay_translation": "Rasulullah SAW biasa menunaikan solat Asar, kemudian seseorang masih boleh sampai ke Awali (sebuah tempat di pinggir Madinah) sementara matahari masih agak tinggi. Riwayat Yunus: Jarak Awali (dari Madinah) ialah empat atau tiga batu.",
        "arabic_text": "حَدَّثَنَا أَيُّوبُ بْنُ سُلَيْمَانَ، حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي أُوَيْسٍ، عَنْ سُلَيْمَانَ بْنِ بِلاَلٍ، عَنْ صَالِحِ بْنِ كَيْسَانَ، قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي الْعَصْرَ فَيَأْتِي الْعَوَالِيَ وَالشَّمْسُ مُرْتَفِعَةٌ‏.‏ وَزَادَ اللَّيْثُ عَنْ يُونُسَ، وَبُعْدُ الْعَوَالِي أَرْبَعَةُ أَمْيَالٍ أَوْ ثَلاَثَةٌ‏.‏"
      },
      {
        "id": 7026,
        "hadith_number": "7330",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ukuran Sa’ pada Zaman Rasulullah SAW dan Perubahannya",
        "perawi_melayu": "Riwayat As-Sa’ib bin Yazid:",
        "english_text": "The Sa' (a kind of measure) during the lifetime of the Prophet (ﷺ) used to be equal to the one Mudd (another kind of measure) and one third of a Mudd which we use today, but the Sa' of today has become large.That is, during the time of Hazrat Umar bin Abdul Aziz, it became four mudd.",
        "malay_translation": "Ukuran Sa’ (sejenis sukatan) pada zaman Rasulullah SAW  sama dengan satu Mudd (sejenis sukatan lain) dan sepertiga Mudd yang kita gunakan pada hari ini, tetapi Sa’ pada hari ini telah menjadi lebih besar.  Iaitu, pada zaman Khalifah Umar bin Abdul Aziz, ia telah menjadi empat Mudd.",
        "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ زُرَارَةَ، حَدَّثَنَا الْقَاسِمُ بْنُ مَالِكٍ، عَنِ الْجُعَيْدِ، سَمِعْتُ السَّائِبَ بْنَ يَزِيدَ، يَقُولُ كَانَ الصَّاعُ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم مُدًّا وَثُلُثًا بِمُدِّكُمُ الْيَوْمَ، وَقَدْ زِيدَ فِيهِ‏.‏ سَمِعَ الْقَاسِمُ بْنُ مَالِكٍ الْجُعَيْدَ"
      },
      {
        "id": 7027,
        "hadith_number": "7331",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Doa Rasulullah untuk Penduduk Madinah",
        "perawi_melayu": "Anas bin Malik رضي الله عنه",
        "english_text": "Allah's Messenger (ﷺ) said, \"O Allah! Bestow Your Blessings on their measures, and bestow Your Blessings on their Sa' and Mudd.\" He meant those of the people of Medina.",
        "malay_translation": "Rasulullah SAW bersabda, \"Ya Allah, limpahkanlah keberkatan ke atas sukatan mereka, dan limpahkanlah keberkatan ke atas Sa' dan Mudd mereka.\" Baginda merujuk kepada penduduk Madinah.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ اللَّهُمَّ بَارِكْ لَهُمْ فِي مِكْيَالِهِمْ، وَبَارِكْ لَهُمْ فِي صَاعِهِمْ وَمُدِّهِمْ ‏\"‏ يَعْنِي أَهْلَ الْمَدِينَةِ‏.‏"
      },
      {
        "id": 7028,
        "hadith_number": "7332",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman Rajam Atas Zina",
        "perawi_melayu": "Riwayat Ibn Umar رضي الله عنهما:",
        "english_text": "The Jews brought a man and a woman who had committed illegal sexual intercourse, to the Prophet (ﷺ) and the Prophet (ﷺ) ordered them to be stoned to death, and they were stoned to death near the mosque where the biers used to be placed.",
        "malay_translation": "Orang-orang Yahudi membawa seorang lelaki dan seorang perempuan yang telah melakukan zina kepada Nabi ﷺ. Nabi ﷺ memerintahkan mereka dirajam sehingga mati, dan mereka dirajam sehingga mati berhampiran masjid di tempat keranda biasanya diletakkan.",
        "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَبُو ضَمْرَةَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ الْيَهُودَ، جَاءُوا إِلَى النَّبِيِّ صلى الله عليه وسلم بِرَجُلٍ وَامْرَأَةٍ زَنَيَا، فَأَمَرَ بِهِمَا فَرُجِمَا قَرِيبًا مِنْ حَيْثُ تُوضَعُ الْجَنَائِزُ عِنْدَ الْمَسْجِدِ‏.‏"
      },
      {
        "id": 7029,
        "hadith_number": "7333",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Gunung Uhud: Gunung yang Dicintai dan Mencintai",
        "perawi_melayu": "Anas bin Malik رضي الله عنه:",
        "english_text": "The Mountain of Uhud came in sight of Allah's Messenger (ﷺ) who then said, \"This is a mountain that loves us and is loved by us. O Allah! Abraham made Mecca a sanctuary and I make the area between its (Medina's) two mountains a sanctuary.\" Hadrat Sehl رضي الله عنه has also reported from the prophet ﷺ the same about mount Ohud.",
        "malay_translation": "Ketika Gunung Uhud muncul di pandangan Rasulullah ﷺ, baginda bersabda, \"Ini adalah gunung yang mencintai kita dan dicintai oleh kita. Ya Allah! Ibrahim telah menjadikan Mekah sebagai tempat suci dan Aku menjadikan kawasan di antara dua gunung ini (Madinah) sebagai tempat suci.\"  Sehl رضي الله عنه juga meriwayatkan daripada Nabi ﷺ yang sama tentang Gunung Uhud.",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ عَمْرٍو، مَوْلَى الْمُطَّلِبِ عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم طَلَعَ لَهُ أُحُدٌ فَقَالَ ‏ \"‏ هَذَا جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ، اللَّهُمَّ إِنَّ إِبْرَاهِيمَ حَرَّمَ مَكَّةَ، وَإِنِّي أُحَرِّمُ مَا بَيْنَ لاَبَتَيْهَا ‏\"‏‏.‏ تَابَعَهُ سَهْلٌ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي أُحُدٍ‏.‏"
      },
      {
        "id": 7030,
        "hadith_number": "7334",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Jarak Mimbar dan Dinding Masjid",
        "perawi_melayu": "Riwayat Sahl bin Sa'd",
        "english_text": "The distance between the pulpit and the wall of the mosque on the side of the Qibla was just sufficient for a sheep to pass through.",
        "malay_translation": "Jarak antara mimbar dan dinding masjid di sebelah kiblat hanya cukup untuk seekor kambing melaluinya.",
        "arabic_text": "حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلٍ، أَنَّهُ كَانَ بَيْنَ جِدَارِ الْمَسْجِدِ مِمَّا يَلِي الْقِبْلَةَ وَبَيْنَ الْمِنْبَرِ مَمَرُّ الشَّاةِ‏.‏"
      },
      {
        "id": 7031,
        "hadith_number": "7335",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Syurga di antara Rumah dan Mimbar Rasulullah",
        "perawi_melayu": "Riwayat Abu Hurairah رضي الله عنه :",
        "english_text": "Allah's Messenger (ﷺ) said, \"Between my house and my pulpit there is a garden from one of the gardens of Paradise, and my pulpit is over my Lake-Tank. (Kauthar);",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Di antara rumahku dan mimbarku terdapat sebuah taman daripada taman-taman syurga, dan mimbarku berada di atas telaga Kauthar.\"",
        "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا مَالِكٌ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَا بَيْنَ بَيْتِي وَمِنْبَرِي رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ، وَمِنْبَرِي عَلَى حَوْضِي ‏\"‏‏.‏"
      },
      {
        "id": 7032,
        "hadith_number": "7336",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perlumbaan Kuda Rasulullah SAW",
        "perawi_melayu": "Riwayat Abdullah bin Rabi'ah al-Ansari:",
        "english_text": "\"The Prophet (ﷺ) arranged for a horse race, and the prepared horses were given less food for a few days before the race to win the race, and were allowed to run from Al-Hafya to Thaniyat-al- Wada`, and the unprepared horses were allowed to run between Thaniyat-al-Wada` and the mosque of Bani Zuraiq,\" `Abdullah رضی اللہ عنہ was one of those who participated in the race.",
        "malay_translation": "Rasulullah SAW telah mengadakan perlumbaan kuda. Kuda-kuda yang telah disediakan diberi makan sedikit beberapa hari sebelum perlumbaan untuk memenangi perlumbaan, dan dibenarkan berlari dari Al-Hafya ke Thaniyat al-Wada', manakala kuda-kuda yang tidak disediakan dibenarkan berlari di antara Thaniyat al-Wada' dan masjid Bani Zuraiq. Abdullah bin Rabi'ah al-Ansari adalah antara mereka yang menyertai perlumbaan tersebut.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، قَالَ سَابَقَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ الْخَيْلِ، فَأُرْسِلَتِ الَّتِي ضُمِّرَتْ مِنْهَا وَأَمَدُهَا إِلَى الْحَفْيَاءِ إِلَى ثَنِيَّةِ الْوَدَاعِ، وَالَّتِي لَمْ تُضَمَّرْ أَمَدُهَا ثَنِيَّةُ الْوَدَاعِ إِلَى مَسْجِدِ بَنِي زُرَيْقٍ، وَأَنَّ عَبْدَ اللَّهِ كَانَ فِيمَنْ سَابَقَ‏.‏ حَدَّثَنَا قُتَيْبَةُ عَنْ لَيْثٍ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ‏.‏"
      },
      {
        "id": 7033,
        "hadith_number": "7337",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Umar bin al-Khattab Berkhutbah di Mimbar Nabi",
        "perawi_melayu": "Riwayat Ibn Umar رضي الله عنهما:",
        "english_text": "I heard `Umar رضی اللہ عنہ (delivering a sermon) on the pulpit of the Prophet.",
        "malay_translation": "Aku mendengar Umar رضي الله عنه menyampaikan khutbah di mimbar Nabi.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ عَنْ لَيْثٍ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ‏‏ ح. وَحَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا عِيسَى، وَابْنُ، إِدْرِيسَ وَابْنُ أَبِي غَنِيَّةَ عَنْ أَبِي حَيَّانَ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ عُمَرَ، عَلَى مِنْبَرِ النَّبِيِّ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 7034,
        "hadith_number": "7338",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Uthman bin Affan Berkhutbah di Mimbar Nabi",
        "perawi_melayu": "Daripada As-Sa'ib bin Yazid:",
        "english_text": "He heard `Uthman bin `Affan رضی اللہ عنہ delivering a sermon on the pulpit of the Prophet ﷺ.",
        "malay_translation": "Dia mendengar Uthman bin Affan menyampaikan khutbah di mimbar Nabi ﷺ.",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي السَّائِبُ بْنُ يَزِيدَ، سَمِعَ عُثْمَانَ بْنَ عَفَّانَ، خَطَبَنَا عَلَى مِنْبَرِ النَّبِيِّ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 7035,
        "hadith_number": "7339",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Bekas Tembaga Besar untuk Rasulullah dan Aisyah",
        "perawi_melayu": "Daripada Aisyah رضي الله عنها :",
        "english_text": "This big copper vessel used to be put for me and Allah's Messenger (ﷺ) and we would take water from it together (on taking a bath).",
        "malay_translation": "Bekas tembaga besar ini selalu diletakkan untukku dan Rasulullah ﷺ, dan kami akan mengambil air daripadanya bersama-sama (ketika mandi).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ، أَنَّ هِشَامَ بْنَ عُرْوَةَ، حَدَّثَهُ عَنْ أَبِيهِ، أَنَّ عَائِشَةَ، قَالَتْ كَانَ يُوضَعُ لِي وَلِرَسُولِ اللَّهِ صلى الله عليه وسلم هَذَا الْمِرْكَنُ فَنَشْرَعُ فِيهِ جَمِيعًا‏.‏"
      },
      {
        "id": 7036,
        "hadith_number": "7340, 7341",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perjanjian Ansar dan Quraisy serta Doa Nabi SAW untuk Bani Sulaim",
        "perawi_melayu": "Anas رضي الله عنه:",
        "english_text": "The Prophet (ﷺ) brought the Ansar and the Quraish people into alliance in my house at Medina, and he invoked Allah for one month against the tribe of Bani Sulaim in (the last rak`a of each compulsory) prayer.",
        "malay_translation": "Nabi SAW telah mengikat perjanjian antara kaum Ansar dan Quraisy di rumahku di Madinah, dan baginda berdoa kepada Allah selama sebulan lamanya terhadap puak Bani Sulaim dalam rakaat akhir setiap solat fardu.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ، حَدَّثَنَا عَاصِمٌ الأَحْوَلُ، عَنْ أَنَسٍ، قَالَ حَالَفَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ الأَنْصَارِ وَقُرَيْشٍ فِي دَارِي الَّتِي بِالْمَدِينَةِ‏.‏ وَقَنَتَ شَهْرًا يَدْعُو عَلَى أَحْيَاءٍ مِنْ بَنِي سُلَيْمٍ."
      },
      {
        "id": 7037,
        "hadith_number": "7342",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keramahan Abdullah bin Salam kepada Rasulullah",
        "perawi_melayu": "Riwayat Abu Burdah:",
        "english_text": "When I arrived at Medina, `Abdullah bin Salam رضی اللہ عنہ met me and said to me, \"Accompany me to my house so that I may make you drink from a bowl from which Allah's Messenger (ﷺ) used to drink, and that you may offer prayer in the mosque in which the Prophet (ﷺ) used to pray.\" I accompanied him, and he made me drink Sawiq and gave me dates to eat, and then I prayed in his mosque.",
        "malay_translation": "Apabila aku tiba di Madinah, Abdullah bin Salam  رضی اللہ عنہ telah menemui aku dan berkata kepadaku, \"Ikutlah aku ke rumahku supaya aku dapat memberimu minuman dari mangkuk yang pernah diminum oleh Rasulullah (ﷺ), dan supaya engkau dapat menunaikan solat di masjid di mana Nabi (ﷺ) pernah solat.\" Aku mengikutinya, dan dia memberiku minuman Sawiq dan kurma untuk dimakan, kemudian aku solat di masjidnya.",
        "arabic_text": "حَدَّثَنِي أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا بُرَيْدٌ، عَنْ أَبِي بُرْدَةَ، قَالَ قَدِمْتُ الْمَدِينَةَ فَلَقِيَنِي عَبْدُ اللَّهِ بْنُ سَلاَمٍ فَقَالَ لِي انْطَلِقْ إِلَى الْمَنْزِلِ فَأَسْقِيَكَ فِي قَدَحٍ شَرِبَ فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم، وَتُصَلِّي فِي مَسْجِدٍ صَلَّى فِيهِ النَّبِيُّ صلى الله عليه وسلم‏.‏ فَانْطَلَقْتُ مَعَهُ، فَسَقَانِي سَوِيقًا، وَأَطْعَمَنِي تَمْرًا، وَصَلَّيْتُ فِي مَسْجِدِهِ‏.‏"
      },
      {
        "id": 7038,
        "hadith_number": "7343",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat di Lembah 'Aqiq dan Doa Umrah dan Haji",
        "perawi_melayu": "Riwayat Umar bin al-Khattab:",
        "english_text": "The Prophet (ﷺ) said to me, \"Someone came to me tonight from my Lord while I was in the 'Aqiq (valley), and said to me, \"Offer prayer in this blessed valley and say: 'Labbaik' for the (performance of) `Umra and Hajj.\" Haroon bin Ismail states that Ali bin Mubarak has narrated to us the phrase: ''عُمْرَةٌ فِي حَجَّةٍ'' Umrah in Hajj.",
        "malay_translation": "Rasulullah ﷺ bersabda kepadaku, \"Seseorang datang kepadaku malam ini daripada Tuhanku ketika aku berada di lembah 'Aqiq, dan berkata kepadaku, \"Solatlah di lembah yang diberkati ini dan ucapkan: 'Labbaik' untuk mengerjakan Umrah dan Haji.\" Harun bin Ismail menyatakan bahawa Ali bin Mubarak telah meriwayatkan kepada kita frasa: ''عُمْرَةٌ فِي حَجَّةٍ'' iaitu Umrah dalam Haji.",
        "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ الرَّبِيعِ، حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، حَدَّثَنِي عِكْرِمَةُ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ عُمَرَ ـ رضى الله عنه ـ حَدَّثَهُ قَالَ حَدَّثَنِي النَّبِيُّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَتَانِي اللَّيْلَةَ آتٍ مِنْ رَبِّي وَهْوَ بِالْعَقِيقِ أَنْ صَلِّ فِي هَذَا الْوَادِي الْمُبَارَكِ وَقُلْ عُمْرَةٌ وَحَجَّةٌ ‏\"‏‏.‏ وَقَالَ هَارُونُ بْنُ إِسْمَاعِيلَ حَدَّثَنَا عَلِيٌّ عُمْرَةٌ فِي حَجَّةٍ‏.‏"
      },
      {
        "id": 7039,
        "hadith_number": "7344",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Miqat bagi Jemaah Haji dari Pelbagai Wilayah",
        "perawi_melayu": "Riwayat Ibnu Umar رضي الله عنهما:",
        "english_text": "\"The Prophet (ﷺ) fixed Qarn as the Miqat (for assuming the Ihram) for the people of Najd, and Al-Juhfa for the people of Sham, and Dhul-Hulaifa for the people of Medina.\" Ibn `Umar added, \"I heard this from the Prophet, and I have been informed that the Prophet (ﷺ) said, 'The Miqat for the Yemenites is Yalamlam.' \"When Iraq was mentioned, he said, \"At that time it was not a Muslim country.\"",
        "malay_translation": "“Nabi SAW menetapkan Qarn sebagai Miqat (untuk memakai ihram) bagi penduduk Najd, dan Al-Juhfa bagi penduduk Syam, dan Zul-Hulaifa bagi penduduk Madinah.” Ibnu Umar menambah, “Aku mendengar ini daripada Nabi SAW, dan aku telah dimaklumkan bahawa Nabi SAW bersabda, ‘Miqat bagi penduduk Yaman ialah Yalamlam.’ ” Apabila Iraq disebut, baginda berkata, “Pada ketika itu, ia bukanlah negara Islam.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، وَقَّتَ النَّبِيُّ صلى الله عليه وسلم قَرْنًا لأَهْلِ نَجْدٍ، وَالْجُحْفَةَ لأَهْلِ الشَّأْمِ، وَذَا الْحُلَيْفَةِ لأَهْلِ الْمَدِينَةِ‏.‏ قَالَ سَمِعْتُ هَذَا مِنَ النَّبِيِّ صلى الله عليه وسلم وَبَلَغَنِي أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ وَلأَهْلِ الْيَمَنِ يَلَمْلَمُ ‏\"‏‏.‏ وَذُكِرَ الْعِرَاقُ فَقَالَ لَمْ يَكُنْ عِرَاقٌ يَوْمَئِذٍ‏.‏"
      },
      {
        "id": 7040,
        "hadith_number": "7345",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Mimpi Nabi SAW di Zul Hulaifah",
        "perawi_melayu": "Riwayat Abdullah bin Umar رضي الله عنهما:",
        "english_text": "The Prophet (ﷺ) had a dream in the last portion of the night when he was sleeping at Dhul-Hulaifa. (I n the dream) it was said to him, \"You are in a blessed Batha' (i.e., valley).",
        "malay_translation": "Nabi Muhammad SAW bermimpi pada bahagian akhir malam ketika baginda tidur di Zul Hulaifah.  (Di dalam mimpi itu) baginda dikhabar, \"Engkau berada di lembah Batha' yang diberkati.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْمُبَارَكِ، حَدَّثَنَا الْفُضَيْلُ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ أُرِيَ وَهْوَ فِي مُعَرَّسِهِ بِذِي الْحُلَيْفَةِ فَقِيلَ لَهُ إِنَّكَ بِبَطْحَاءَ مُبَارَكَةٍ‏.‏"
      },
      {
        "id": 7041,
        "hadith_number": "7346",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Doa Nabi SAW Selepas Ruku' dan Laknat Terhadap Orang Zalim",
        "perawi_melayu": "Riwayat Ibnu Umar رضي الله عنهما:",
        "english_text": "He heard the Prophet, after raising his head from the bowing in morning prayer, saying, \"O Allah, our Lord! All the praises are for you.\" And in the last (rak`a) he said, \"O Allah! Curse so-and-so and so--and-so.\" And then Allah revealed:-- 'Not for you (O Muhammad) is the decision, (but for Allah), whether He turns in mercy to them or punish them, for they are indeed wrongdoers.' (3.128)",
        "malay_translation": "Baginda mendengar Nabi SAW, setelah mengangkat kepalanya daripada ruku' dalam solat Subuh, bersabda, \"Ya Allah, Tuhan kami! Segala puji bagi-Mu.\" Dan dalam rakaat yang terakhir, baginda bersabda, \"Ya Allah! Laknatilah si fulan dan si fulan.\" Kemudian Allah SWT menurunkan wahyu:  'Kepada engkau (wahai Muhammad) bukanlah urusan itu (tetapi kepada Allah), sama ada Dia akan memberi rahmat kepada mereka atau memberi azab kepada mereka; kerana sesungguhnya mereka adalah orang-orang yang melakukan kejahatan.' (3:128)",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ فِي صَلاَةِ الْفَجْرِ رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ قَالَ ‏\"‏ اللَّهُمَّ رَبَّنَا وَلَكَ الْحَمْدُ فِي الأَخِيرَةِ ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ اللَّهُمَّ الْعَنْ فُلاَنًا وَفُلاَنًا ‏\"‏‏.‏ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏لَيْسَ لَكَ مِنَ الأَمْرِ شَىْءٌ أَوْ يَتُوبَ عَلَيْهِمْ أَوْ يُعَذِّبَهُمْ فَإِنَّهُمْ ظَالِمُونَ‏}‏‏.‏"
      },
      {
        "id": 7042,
        "hadith_number": "7347",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Menziarahi Ali dan Fatimah",
        "perawi_melayu": "Riwayat Ali bin Abi Talib:",
        "english_text": "Allah's Messenger (ﷺ) came to him and Fatima the daughter of Allah's Messenger (ﷺ) at their house at night and said, \"Won't you pray?\" `Ali رضی اللہ عنہ replied, \"O Allah's Messenger (ﷺ)! Our souls are in the Hands of Allah and when he wants us to get up, He makes us get up.\" When `Ali رضی اللہ عنہ said that to him, Allah's Messenger (ﷺ) left without saying anything to him. While the Prophet (ﷺ) was leaving, `Ali heard him striking his thigh (with his hand) and saying, \"But man is quarrelsome more than anything else.\" (18.54) He (Imam Bukhari said) Who so comes to you at night is Tariq. Tariq is also a star. ''وَالثَّاقِبُ '' means: Luminous. It is said to the fire-maker ''أَثْقِبْ نَارَكَ'' i.e. make your fire.",
        "malay_translation": "Rasulullah SAW datang kepada Ali dan Fatimah, anak perempuan Rasulullah SAW, di rumah mereka pada waktu malam dan bersabda, \"Tidakkah kamu solat?\" Ali menjawab, \"Wahai Rasulullah SAW! Nyawa kami di tangan Allah SWT, dan apabila Dia menghendaki kami bangun, Dia akan membuat kami bangun.\" Setelah Ali berkata demikian, Rasulullah SAW pergi tanpa berkata apa-apa kepadanya. Ketika Rasulullah SAW sedang berlalu pergi, Ali mendengar baginda memukul pahanya (dengan tangan baginda) dan bersabda, \"Tetapi manusia itu lebih banyak bertengkar daripada apa-apa yang lain.\" (18.54)  (Imam Bukhari berkata) Sesiapa yang datang kepadamu pada waktu malam ialah Tariq. Tariq juga merupakan bintang.  ''وَالثَّاقِبُ '' bermaksud: Bercahaya. Ia dikatakan kepada pembuat api ''أَثْقِبْ نَارَكَ'' iaitu: Buatlah apimu.",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، ح حَدَّثَنِي مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا عَتَّابُ بْنُ بَشِيرٍ، عَنْ إِسْحَاقَ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي عَلِيُّ بْنُ حُسَيْنٍ، أَنَّ حُسَيْنَ بْنَ عَلِيٍّ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم طَرَقَهُ وَفَاطِمَةَ ـ عَلَيْهَا السَّلاَمُ ـ بِنْتَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لَهُمْ ‏\"‏ أَلاَ تُصَلُّونَ ‏\"‏‏.‏ فَقَالَ عَلِيٌّ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّمَا أَنْفُسُنَا بِيَدِ اللَّهِ، فَإِذَا شَاءَ أَنْ يَبْعَثَنَا بَعَثَنَا، فَانْصَرَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ قَالَ لَهُ ذَلِكَ وَلَمْ يَرْجِعْ إِلَيْهِ شَيْئًا، ثُمَّ سَمِعَهُ وَهْوَ مُدْبِرٌ يَضْرِبُ فَخِذَهُ وَهْوَ يَقُولُ ‏{‏وَكَانَ الإِنْسَانُ أَكْثَرَ شَىْءٍ جَدَلاً‏}‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ يُقَالُ مَا أَتَاكَ لَيْلاً فَهْوَ طَارِقٌ‏.‏ وَيُقَالُ الطَّارِقُ النَّجْمُ، وَالثَّاقِبُ الْمُضِيءُ، يُقَالُ أَثْقِبْ نَارَكَ لِلْمُوقِدِ‏.‏"
      },
      {
        "id": 7043,
        "hadith_number": "7348",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Seruan Nabi SAW Kepada Orang Yahudi",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "While we were in the mosque, Allah's Messenger (ﷺ) came out and said, \"Let us proceed to the Jews.\" So we went out with him till we came to Bait-al-Midras. The Prophet (ﷺ) stood up there and called them, saying, \"O assembly of Jews! Surrender to Allah (embrace Islam) and you will be safe!\" They said, \"You have conveyed Allah's message, O Aba-al-Qasim\" Allah's Messenger (ﷺ) then said to them, \"That is what I want; embrace Islam and you will be safe.\" They said, \"You have conveyed the message, O Aba-al- Qasim.\" Allah's Messenger (ﷺ) then said to them, \"That is what I want,\" and repeated his words for the third time and added, \"Know that the earth is for Allah and I want to exile you from this land, so whoever among you has property he should sell it, otherwise, know that the land is for Allah and His Apostle.\"",
        "malay_translation": "Ketika kami berada di masjid, Rasulullah ﷺ keluar dan bersabda, \"Marilah kita pergi kepada orang-orang Yahudi.\" Maka kami keluar bersama baginda sehingga sampai ke Bait al-Midras. Nabi ﷺ berdiri di situ dan memanggil mereka, seraya berkata, \"Wahai sekalian kaum Yahudi! Serahlah diri kamu kepada Allah (peluk Islam) nescaya kamu akan selamat!\" Mereka menjawab, \"Engkau telah menyampaikan risalah Allah, wahai Aba al-Qasim.\" Rasulullah ﷺ kemudian bersabda kepada mereka, \"Itulah yang aku inginkan; peluklah Islam nescaya kamu akan selamat.\" Mereka menjawab, \"Engkau telah menyampaikan risalah itu, wahai Aba al-Qasim.\" Rasulullah ﷺ kemudian bersabda kepada mereka, \"Itulah yang aku inginkan,\" dan mengulangi perkataan baginda buat kali ketiga dan menambah, \"Ketahuilah bahawa bumi ini adalah milik Allah dan aku ingin mengusir kamu dari tanah ini, oleh itu sesiapa di kalangan kamu yang mempunyai harta benda hendaklah menjualnya, jika tidak, ketahuilah bahawa tanah ini adalah milik Allah dan Rasul-Nya.\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ بَيْنَا نَحْنُ فِي الْمَسْجِدِ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ انْطَلِقُوا إِلَى يَهُودَ ‏\"‏‏.‏ فَخَرَجْنَا مَعَهُ حَتَّى جِئْنَا بَيْتَ الْمِدْرَاسِ فَقَامَ النَّبِيُّ صلى الله عليه وسلم فَنَادَاهُمْ فَقَالَ ‏\"‏ يَا مَعْشَرَ يَهُودَ أَسْلِمُوا تَسْلَمُوا ‏\"‏‏.‏ فَقَالُوا بَلَّغْتَ يَا أَبَا الْقَاسِمِ‏.‏ قَالَ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ذَلِكَ أُرِيدُ أَسْلِمُوا تَسْلَمُوا ‏\"‏‏.‏ فَقَالُوا قَدْ بَلَّغْتَ يَا أَبَا الْقَاسِمِ‏.‏ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ذَلِكَ أُرِيدُ ‏\"‏‏.‏ ثُمَّ قَالَهَا الثَّالِثَةَ فَقَالَ ‏\"‏ اعْلَمُوا أَنَّمَا الأَرْضُ لِلَّهِ وَرَسُولِهِ وَإِنِّي أُرِيدُ أَنْ أُجْلِيَكُمْ مِنْ هَذِهِ الأَرْضِ، فَمَنْ وَجَدَ مِنْكُمْ بِمَالِهِ شَيْئًا فَلْيَبِعْهُ، وَإِلاَّ فَاعْلَمُوا أَنَّمَا الأَرْضُ لِلَّهِ وَرَسُولِهِ ‏\"‏‏.‏"
      },
      {
        "id": 7044,
        "hadith_number": "7349",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Saksi Nabi Nuh di Hari Kiamat",
        "perawi_melayu": "Abu Said Al-Khudri رضي الله عنه",
        "english_text": "Allah's Messenger (ﷺ) said, \"Noah will be brought (before Allah) on the Day of Resurrection, and will be asked, 'Did you convey the message of Allah?\" He will reply, 'Yes, O Lord.' And then Noah's nation will be asked, 'Did he (Noah) convey Allah's message to you?' They will reply, 'No warner came to us.' Then Noah will be asked, 'Who are your witnesses?' He will reply. '(My witnesses are) Muhammad and his followers.' Thereupon you (Muslims) will be brought and you will bear witness.\" Then the Prophet (ﷺ) recited: 'And thus We have made of you (Muslims) a just and the best nation, that you might be witness over the nations, and the Apostle a witness over you.' (2.143). Hadrat Abu Saeed رضی اللہ عنہ  has reported similarly from the prophet ﷺ.",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Nuh akan dihadapkan (di hadapan Allah) pada Hari Kiamat, dan akan ditanya, 'Adakah engkau menyampaikan risalah Allah?' Dia akan menjawab, 'Ya, wahai Tuhanku.' Kemudian kaum Nuh akan ditanya, 'Adakah dia (Nuh) menyampaikan risalah Allah kepadamu?' Mereka akan menjawab, 'Tiada pemberi amaran datang kepada kami.' Kemudian Nuh akan ditanya, 'Siapakah saksi-saksimu?' Dia akan menjawab, '(Saksi-saksiku ialah) Muhammad dan pengikut-pengikutnya.'  Maka kamu (umat Islam) akan dihadapkan dan kamu akan memberi kesaksian.\" Kemudian Nabi ﷺ membaca: 'Dan demikianlah Kami telah menjadikan kamu (umat Islam) satu umat yang adil dan sebaik-baik umat, supaya kamu menjadi saksi ke atas manusia, dan Rasul menjadi saksi ke atas kamu.' (2:143).  Hadrat Abu Said رضي الله عنه turut meriwayatkan secara serupa daripada Nabi ﷺ.",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا أَبُو صَالِحٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يُجَاءُ بِنُوحٍ يَوْمَ الْقِيَامَةِ فَيُقَالُ لَهُ هَلْ بَلَّغْتَ فَيَقُولُ نَعَمْ يَا رَبِّ‏.‏ فَتُسْأَلُ أُمَّتُهُ هَلْ بَلَّغَكُمْ فَيَقُولُونَ مَا جَاءَنَا مِنْ نَذِيرٍ‏.‏ فَيَقُولُ مَنْ شُهُودُكَ فَيَقُولُ مُحَمَّدٌ وَأُمَّتُهُ‏.‏ فَيُجَاءُ بِكُمْ فَتَشْهَدُونَ ‏\"‏‏.‏ ثُمَّ قَرَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏{‏وَكَذَلِكَ جَعَلْنَاكُمْ أُمَّةً وَسَطًا‏}‏ قَالَ عَدْلاً ‏{‏لِتَكُونُوا شُهَدَاءَ عَلَى النَّاسِ وَيَكُونَ الرَّسُولُ عَلَيْكُمْ شَهِيدًا‏}‏ وَعَنْ جَعْفَرِ بْنِ عَوْنٍ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا‏.‏"
      },
      {
        "id": 7045,
        "hadith_number": "7350, 7351",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pertukaran Kurma di Khaibar",
        "perawi_melayu": "Dari Abu Sa`id Al-Khudri dan Abu Hurairah رضي الله عنهما :",
        "english_text": "Allah's Messenger (ﷺ) sent the brother of the tribe of Bani Adi Al-Ansari as governor of Khaibar. Then the man returned, bringing Janib (a good kind of date). Allah's Messenger (ﷺ) asked him, \"Are all the dates of Khaibar like that?\" He replied, \"No, by Allah, O Allah's Messenger (ﷺ)! We take one Sa' of these (good) dates for two Sas of mixed dates.\" Allah's Messenger (ﷺ) then said, \"Do not do so. You should either take one Sa' of this (kind) for one Sa' of the other; or sell one kind and then buy with its price the other kind (of dates), and you should do the same in weighing.\"",
        "malay_translation": "Rasulullah ﷺ telah mengutus seorang lelaki daripada kabilah Bani Adi Al-Ansari sebagai gabenor Khaibar.  Kemudian lelaki itu kembali membawa kurma jenis Janib (kurma yang baik). Rasulullah ﷺ bertanya kepadanya, \"Adakah semua kurma di Khaibar seperti ini?\" Lelaki itu menjawab, \"Tidak, demi Allah, wahai Rasulullah ﷺ! Kami mengambil satu Sa' kurma yang baik ini untuk dua Sa' kurma yang bercampur.\"  Rasulullah ﷺ kemudian bersabda, \"Janganlah kamu berbuat demikian.  Sama ada kamu mengambil satu Sa' kurma ini untuk satu Sa' kurma yang lain; atau jual salah satu jenis kurma itu kemudian beli jenis yang lain dengan harganya, dan hendaklah kamu berbuat demikian juga dalam penimbangan.\"",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَخِيهِ، عَنْ سُلَيْمَانَ بْنِ بِلاَلٍ، عَنْ عَبْدِ الْمَجِيدِ بْنِ سُهَيْلِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يُحَدِّثُ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ، وَأَبَا، هُرَيْرَةَ حَدَّثَاهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ أَخَا بَنِي عَدِيٍّ الأَنْصَارِيَّ وَاسْتَعْمَلَهُ عَلَى خَيْبَرَ، فَقَدِمَ بِتَمْرٍ جَنِيبٍ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَكُلُّ تَمْرِ خَيْبَرَ هَكَذَا ‏\"‏‏.‏ قَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ إِنَّا لَنَشْتَرِي الصَّاعَ بِالصَّاعَيْنِ مِنَ الْجَمْعِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَفْعَلُوا، وَلَكِنْ مِثْلاً بِمِثْلٍ، أَوْ بِيعُوا هَذَا وَاشْتَرُوا بِثَمَنِهِ مِنْ هَذَا وَكَذَلِكَ الْمِيزَانُ ‏\"‏‏."
      },
      {
        "id": 7046,
        "hadith_number": "7352",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ganjaran Hakim yang Mentafsir Hukum",
        "perawi_melayu": "Riwayat Amr bin Al-'As رضي الله عنه :",
        "english_text": "He heard Allah's Messenger (ﷺ) saying, \"If a judge gives a verdict according to the best of his knowledge and his verdict is correct (i.e. agrees with Allah and His Apostle's verdict) he will receive a double reward, and if he gives a verdict according to the best of his knowledge and his verdict is wrong, (i.e. against that of Allah and His Apostle) even then he will get a reward .\" Then I (Yazeed bin Abdullah) narrated this Hadith to Abu Bakr bin Hazim, so he said: Abu Salamah has reported it from Hadrat Abu Hurairah رضي الله عنه likewise. Hadrat Abu Salamah رضي الله عنه has reported from the prophet ﷺ like it.",
        "malay_translation": "Baginda mendengar Rasulullah ﷺ bersabda: \"Jika seorang hakim memberi keputusan menurut sebaik-baik pengetahuan dan keputusannya itu betul (iaitu, selaras dengan keputusan Allah dan Rasul-Nya), maka dia akan mendapat ganjaran dua kali ganda, dan jika dia memberi keputusan menurut sebaik-baik pengetahuannya dan keputusannya itu salah (iaitu, bercanggah dengan keputusan Allah dan Rasul-Nya), maka dia tetap akan mendapat ganjaran.\" Kemudian aku (Yazid bin Abdullah) meriwayatkan hadis ini kepada Abu Bakar bin Hazim, lalu dia berkata: Abu Salamah telah meriwayatkannya daripada Hadrat Abu Hurairah رضي الله عنه sedemikian juga. Hadrat Abu Salamah رضي الله عنه telah meriwayatkan daripada Nabi ﷺ seperti itu.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ، حَدَّثَنَا حَيْوَةُ، حَدَّثَنِي يَزِيدُ بْنُ عَبْدِ اللَّهِ بْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ أَبِي قَيْسٍ، مَوْلَى عَمْرِو بْنِ الْعَاصِ عَنْ عَمْرِو بْنِ الْعَاصِ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِذَا حَكَمَ الْحَاكِمُ فَاجْتَهَدَ ثُمَّ أَصَابَ فَلَهُ أَجْرَانِ، وَإِذَا حَكَمَ فَاجْتَهَدَ ثُمَّ أَخْطَأَ فَلَهُ أَجْرٌ ‏\"‏‏.‏ قَالَ فَحَدَّثْتُ بِهَذَا الْحَدِيثِ أَبَا بَكْرِ بْنَ عَمْرِو بْنِ حَزْمٍ فَقَالَ هَكَذَا حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ‏.‏ وَقَالَ عَبْدُ الْعَزِيزِ بْنُ الْمُطَّلِبِ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ أَبِي سَلَمَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ‏.‏"
      },
      {
        "id": 7047,
        "hadith_number": "7353",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Abu Musa dan Umar bin al-Khattab:  Petunjuk Nabi SAW",
        "perawi_melayu": "Riwayat Ubaid bin Umar",
        "english_text": "Abu Musa رضی اللہ عنہ asked permission to enter upon `Umar رضی اللہ عنہ , but seeing that he was busy, he went away. `Umar رضی اللہ عنہ then said, \"Didn't I hear the voice of `Abdullah bin Qais? Allow him to come in.\" He was called in and `Umar رضی اللہ عنہ said to him, \"What made you do what you did.\" He replied, \"We have been instructed thus by the Prophet\" `Umar رضی اللہ عنہ said, \"Bring proof (witness) for this, other wise I will do so-and-so to you.\" Then `Abdullah bin Qais went to a gathering of the Ansar who then said, \"None but the youngest of us will give the witness for it.\" So Abu Sa`id Al-Khudri  رضی اللہ عنہ got up and said, \"We used to be instructed thus (by the Prophet).\" `Umar رضی اللہ عنہ said, \"This tradition of the Prophet (ﷺ) remained hidden from me. Business in the market kept me busy.\"",
        "malay_translation": "Abu Musa al-Asy'ari meminta izin untuk masuk menghadap Umar bin al-Khattab, tetapi melihat baginda sibuk, beliau pun pergi. Umar kemudian berkata, \"Bukankah aku mendengar suara Abdullah bin Qais? Benarkan dia masuk.\"  Abdullah dipanggil masuk dan Umar bertanya kepadanya, \"Apakah yang mendorong engkau melakukan apa yang engkau lakukan?\"  Jawab Abdullah, \"Kami telah diperintahkan demikian oleh Nabi SAW.\" Umar berkata, \"Bawakan bukti (saksi) untuk ini, jika tidak, Aku akan melakukan begini dan begitu kepadamu.\" Kemudian Abdullah bin Qais pergi ke majlis kaum Ansar, dan mereka berkata, \"Tiada siapa melainkan yang termuda di antara kita akan memberikan kesaksian untuknya.\" Maka Abu Said al-Khudri bangun dan berkata, \"Kami pernah diperintahkan demikian (oleh Nabi SAW).\" Umar berkata, \"Tradisi Nabi SAW ini tersembunyi daripada saya. Kesibukan di pasar telah menyibukkan saya.\"",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنِ ابْنِ جُرَيْجٍ، حَدَّثَنِي عَطَاءٌ، عَنْ عُبَيْدِ بْنِ عُمَيْرٍ، قَالَ اسْتَأْذَنَ أَبُو مُوسَى عَلَى عُمَرَ فَكَأَنَّهُ وَجَدَهُ مَشْغُولاً فَرَجَعَ، فَقَالَ عُمَرُ أَلَمْ أَسْمَعْ صَوْتَ عَبْدِ اللَّهِ بْنِ قَيْسٍ، ائْذَنُوا لَهُ‏.‏ فَدُعِيَ لَهُ فَقَالَ مَا حَمَلَكَ عَلَى مَا صَنَعْتَ فَقَالَ إِنَّا كُنَّا نُؤْمَرُ بِهَذَا‏.‏ قَالَ فَأْتِنِي عَلَى هَذَا بِبَيِّنَةٍ أَوْ لأَفْعَلَنَّ بِكَ‏.‏ فَانْطَلَقَ إِلَى مَجْلِسٍ مِنَ الأَنْصَارِ فَقَالُوا لاَ يَشْهَدُ إِلاَّ أَصَاغِرُنَا‏.‏ فَقَامَ أَبُو سَعِيدٍ الْخُدْرِيُّ فَقَالَ قَدْ كُنَّا نُؤْمَرُ بِهَذَا‏.‏ فَقَالَ عُمَرُ خَفِيَ عَلَىَّ هَذَا مِنْ أَمْرِ النَّبِيِّ صلى الله عليه وسلم، أَلْهَانِي الصَّفْقُ بِالأَسْوَاقِ‏.‏"
      },
      {
        "id": 7048,
        "hadith_number": "7354",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ketelitian Abu Hurairah dalam Menghafal Hadis",
        "perawi_melayu": "Abu Hurairah رضي الله عنه:",
        "english_text": "\"You people claim that Abu Huraira رضی اللہ عنہ narrates many narrations of Allah's Messenger (ﷺ). (Anyhow) with Allah will be our appointment. I was a poor man, and used to stick to Allah's Messenger (ﷺ) contented with what will fill my stomach, and the Muhajirin (emigrants) used to be busy trading in the markets, and the Ansar used to be busy looking after their properties. One-day I heard Allah's Messenger (ﷺ) saying, 'Who will spread his Rida' (a garment covering the upper part of the body) till I finished my speech and then fold it, (i.e. wrap it over your body), in which case he will never forget anything he had heard from me.\" So I spread my garment which I was wearing; and by Him Who sent Muhammad with the Truth, ever since, I have never forgotten whatever I heard from him (the Prophet)\" (See, Hadith No. 119, Vol. 1)",
        "malay_translation": "“Ada di antara kamu yang mengatakan bahawa Abu Hurairah رضي الله عنه banyak meriwayatkan hadis daripada Rasulullah ﷺ.  (Walau bagaimanapun) janji kita adalah dengan Allah. Aku adalah seorang yang miskin, dan sentiasa berada di sisi Rasulullah ﷺ, merasa cukup dengan apa yang dapat mengisi perutku.  Para Muhajirin sibuk berniaga di pasar, dan para Ansar pula sibuk menguruskan harta benda mereka.  Suatu hari aku mendengar Rasulullah ﷺ bersabda, ‘Siapakah yang mahu membentangkan kainnya (rida) sehingga aku selesai berucap, kemudian melipatnya (iaitu: membalutkannya pada tubuhnya), maka dia tidak akan lupa apa sahaja yang didengarnya daripada aku.’  Maka aku bentangkan kain yang aku pakai; dan demi Allah yang telah mengutus Muhammad dengan kebenaran, sejak itu aku tidak pernah lupa apa sahaja yang aku dengar daripada baginda (Nabi).” (Rujuk Hadis No. 119, Jilid 1)",
        "arabic_text": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنِي الزُّهْرِيُّ، أَنَّهُ سَمِعَهُ مِنَ الأَعْرَجِ، يَقُولُ أَخْبَرَنِي أَبُو هُرَيْرَةَ، قَالَ إِنَّكُمْ تَزْعُمُونَ أَنَّ أَبَا هُرَيْرَةَ، يُكْثِرُ الْحَدِيثَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَاللَّهُ الْمَوْعِدُ، إِنِّي كُنْتُ امْرَأً مِسْكِينًا أَلْزَمُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى مِلْءِ بَطْنِي، وَكَانَ الْمُهَاجِرُونَ يَشْغَلُهُمُ الصَّفْقُ بِالأَسْوَاقِ، وَكَانَتِ الأَنْصَارُ يَشْغَلُهُمُ الْقِيَامُ عَلَى أَمْوَالِهِمْ، فَشَهِدْتُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ وَقَالَ ‏ \"‏ مَنْ يَبْسُطْ رِدَاءَهُ حَتَّى أَقْضِيَ مَقَالَتِي ثُمَّ يَقْبِضْهُ، فَلَنْ يَنْسَى شَيْئًا سَمِعَهُ مِنِّي ‏\"‏‏.‏ فَبَسَطْتُ بُرْدَةً كَانَتْ عَلَىَّ، فَوَالَّذِي بَعَثَهُ بِالْحَقِّ مَا نَسِيتُ شَيْئًا سَمِعْتُهُ مِنْهُ‏.‏"
      },
      {
        "id": 7049,
        "hadith_number": "7355",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Sumpah Jabir bin Abdullah tentang Dajjal",
        "perawi_melayu": "Riwayat Muhammad bin Al-Munkadir:",
        "english_text": "I saw Jabir bin `Abdullah رضی اللہ عنہ swearing by Allah that Ibn Sayyad was the Dajjal. I said to Jabir, \"How can you swear by Allah?\" Jabir said, \"I have heard `Umar رضی اللہ عنہ swearing by Allah regarding this matter in the presence of the Prophet (ﷺ) and the Prophet (ﷺ) did not disapprove of it.\"",
        "malay_translation": "Aku melihat Jabir bin Abdullah bersumpah dengan nama Allah bahawa Ibn Sayyad adalah Dajjal. Aku berkata kepada Jabir, \"Bagaimanakah engkau boleh bersumpah dengan nama Allah?\" Jabir menjawab, \"Aku pernah mendengar Umar bersumpah dengan nama Allah mengenai perkara ini di hadapan Rasulullah ﷺ, dan Rasulullah ﷺ tidak melarangnya.\"",
        "arabic_text": "حَدَّثَنَا حَمَّادُ بْنُ حُمَيْدٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، قَالَ رَأَيْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَحْلِفُ بِاللَّهِ أَنَّ ابْنَ الصَّائِدِ الدَّجَّالُ، قُلْتُ تَحْلِفُ بِاللَّهِ‏.‏ قَالَ إِنِّي سَمِعْتُ عُمَرَ يَحْلِفُ عَلَى ذَلِكَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَلَمْ يُنْكِرْهُ النَّبِيُّ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 7050,
        "hadith_number": "7356",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kegunaan Kuda: Pahala, Perlindungan, atau Dosa",
        "perawi_melayu": "Riwayat Abu Hurairah رضي الله عنه :",
        "english_text": "Allah's Messenger (ﷺ) said, \"Horses may be used for three purposes: For a man they may be a source of reward (in the Hereafter); for another, a means of protection; and for another, a source of sin. The man for whom they are a source of reward, is the one who keeps them for Allah's Cause and ties them with long ropes and lets them graze in a pasture or garden. Whatever those long ropes allow them to eat of that pasture or garden, will be written as good deeds for him and if they break their ropes and run one or two rounds, then all their footsteps and dung will be written as good deeds for him, and if they pass a river and drink from it though he has had no intention of watering them, even then, that will be written as good deeds for him. So such horses are a source of reward for that man. For the man who keeps horses for his livelihood in order not to ask others for help or beg his bread, and at the same time he does not forget Allah's right of what he earns through them and of their backs (that he presents it to be used in Allah's Cause), such horses are a shelter for him (from poverty). For the man who keeps them just out of pride and for showing off, they are a source of sin.\" Then Allah's Messenger (ﷺ) was asked about donkeys. He said, \"Allah has not revealed anything to me regarding them except this comprehensive Verse: \"Then anyone who has done good, equal to the weight of an atom (or a small ant) shall see it, and any one who has done evil, equal to the weight of an atom (or a small ant) shall see it.\" (99.7-8)",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Kuda boleh digunakan untuk tiga tujuan: Bagi seseorang, ia boleh menjadi sumber pahala (di akhirat); bagi yang lain, sebagai alat perlindungan; dan bagi yang lain pula, sumber dosa.  Seseorang yang mendapat pahala daripada kuda adalah mereka yang memeliharanya kerana Allah, mengikatnya dengan tali yang panjang dan membiarkannya meragut di padang rumput atau taman. Apa sahaja yang dimakan oleh kuda itu dalam lingkungan tali panjang tersebut di padang rumput atau taman, akan dicatat sebagai amalan baik baginya.  Jika kuda itu memutuskan tali dan berlari satu atau dua pusingan, maka semua tapak kakinya dan najisnya akan dicatat sebagai amalan baik baginya. Dan jika kuda itu melalui sungai dan minum darinya walaupun dia tidak berniat untuk memberi minum kepadanya, maka itu pun akan dicatat sebagai amalan baik baginya. Oleh itu, kuda sedemikian adalah sumber pahala bagi orang itu. Bagi seseorang yang memelihara kuda untuk mencari nafkah supaya tidak meminta pertolongan orang lain atau mengemis, dan pada masa yang sama tidak melupakan hak Allah daripada apa yang dihasilkannya melalui kuda-kuda itu dan daripada punggungnya (iaitu,  menawarkannya untuk digunakan dalam jalan Allah), maka kuda-kuda itu adalah perlindungan baginya (daripada kemiskinan). Bagi seseorang yang memelihara kuda hanya kerana kebanggaan dan untuk menunjuk-nunjuk, maka ia adalah sumber dosa.\" Kemudian, Rasulullah ﷺ ditanya tentang keldai. Baginda bersabda, \"Allah tidak mewahyukan apa-apa kepada ku mengenai keldai kecuali ayat yang menyeluruh ini:  \"Maka sesiapa yang mengerjakan kebaikan walaupun sebesar zarrah nescaya dia akan melihat (balasan)nya, dan sesiapa yang mengerjakan kejahatan walaupun sebesar zarrah nescaya dia akan melihat (balasan)nya.\" (99:7-8)",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الْخَيْلُ لِثَلاَثَةٍ لِرَجُلٍ أَجْرٌ، وَلِرَجُلٍ سِتْرٌ، وَعَلَى رَجُلٍ وِزْرٌ، فَأَمَّا الَّذِي لَهُ أَجْرٌ فَرَجُلٌ رَبَطَهَا فِي سَبِيلِ اللَّهِ فَأَطَالَ فِي مَرْجٍ أَوْ رَوْضَةٍ، فَمَا أَصَابَتْ فِي طِيَلِهَا ذَلِكَ الْمَرْجِ وَالرَّوْضَةِ كَانَ لَهُ حَسَنَاتٍ، وَلَوْ أَنَّهَا قَطَعَتْ طِيَلَهَا فَاسْتَنَّتْ شَرَفًا أَوْ شَرَفَيْنِ كَانَتْ آثَارُهَا وَأَرْوَاثُهَا حَسَنَاتٍ لَهُ، وَلَوْ أَنَّهَا مَرَّتْ بِنَهَرٍ فَشَرِبَتْ مِنْهُ وَلَمْ يُرِدْ أَنْ يَسْقِيَ بِهِ كَانَ ذَلِكَ حَسَنَاتٍ لَهُ، وَهِيَ لِذَلِكَ الرَّجُلِ أَجْرٌ، وَرَجُلٌ رَبَطَهَا تَغَنِّيًا وَتَعَفُّفًا وَلَمْ يَنْسَ حَقَّ اللَّهِ فِي رِقَابِهَا وَلاَ ظُهُورِهَا، فَهْىَ لَهُ سِتْرٌ، وَرَجُلٌ رَبَطَهَا فَخْرًا وَرِيَاءً، فَهِيَ عَلَى ذَلِكَ وِزْرٌ ‏\"‏‏.‏ وَسُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْحُمُرِ قَالَ ‏\"‏ مَا أَنْزَلَ اللَّهُ عَلَىَّ فِيهَا إِلاَّ هَذِهِ الآيَةَ الْفَاذَّةَ الْجَامِعَةَ ‏{‏فَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ * وَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ‏}‏‏\"‏"
      },
      {
        "id": 7051,
        "hadith_number": "7357",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Bersuci Selepas Haid",
        "perawi_melayu": "Daripada Aisyah رضي الله عنها",
        "english_text": "A woman asked the Prophet ﷺ. Hadrat Mansur bin Abdur Rehaman bin Shibah has reported from Hadrat `Aisha رضي الله عنها : A woman asked the Prophet (ﷺ) about the periods: How to take a bath after the periods. He said, \"Take a perfumed piece of cloth and clean yourself with it.\" She said,' \"How shall I clean myself with it, O Allah's Messenger (ﷺ)?\" The Prophet (ﷺ) said, \"Clean yourself\" She said again, \"How shall I clean myself, O Allah's Messenger (ﷺ)?\" The Prophet (ﷺ) said, \"Clean yourself with it.\" Then I knew what Allah's Messenger (ﷺ) meant. So I pulled her aside and explained it to her.",
        "malay_translation": "Seorang wanita bertanya kepada Nabi ﷺ. Hadrat Mansur bin Abdur Rahman bin Syabah telah meriwayatkan daripada Hadrat Aisyah رضي الله عنها: Seorang wanita bertanya kepada Nabi ﷺ tentang haid: Bagaimana cara mandi selepas haid. Baginda menjawab, \"Ambillah kain yang berbau harum dan bersihkanlah dirimu dengannya.\" Wanita itu berkata, \"Bagaimana saya hendak membersihkan diri dengannya, wahai Rasulullah ﷺ?\" Nabi ﷺ bersabda, \"Bersihkanlah dirimu.\" Wanita itu bertanya lagi, \"Bagaimana saya hendak membersihkan diri, wahai Rasulullah ﷺ?\" Nabi ﷺ bersabda, \"Bersihkanlah dirimu dengannya.\" Kemudian saya faham maksud Rasulullah ﷺ. Maka saya menariknya ke tepi dan menjelaskannya kepadanya.",
        "arabic_text": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ مَنْصُورِ بْنِ صَفِيَّةَ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ، أَنَّ امْرَأَةً، سَأَلَتِ النَّبِيَّ صلى الله عليه وسلم‏.‏ حَدَّثَنَا مُحَمَّدٌ ـ هُوَ ابْنُ عُقْبَةَ ـ حَدَّثَنَا الْفُضَيْلُ بْنُ سُلَيْمَانَ النُّمَيْرِيُّ الْبَصْرِيُّ حَدَّثَنَا مَنْصُورُ بْنُ عَبْدِ الرَّحْمَنِ ابْنُ شَيْبَةَ حَدَّثَتْنِي أُمِّي عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ امْرَأَةً سَأَلَتِ النَّبِيَّ صلى الله عليه وسلم عَنِ الْحَيْضِ كَيْفَ تَغْتَسِلُ مِنْهُ قَالَ ‏\"‏ تَأْخُذِينَ فِرْصَةً مُمَسَّكَةً فَتَوَضَّئِينَ بِهَا ‏\"‏‏.‏ قَالَتْ كَيْفَ أَتَوَضَّأُ بِهَا يَا رَسُولَ اللَّهِ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ تَوَضَّئِي ‏\"‏‏.‏ قَالَتْ كَيْفَ أَتَوَضَّأُ بِهَا يَا رَسُولَ اللَّهِ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ تَوَضَّئِينَ بِهَا ‏\"‏‏.‏ قَالَتْ عَائِشَةُ فَعَرَفْتُ الَّذِي يُرِيدُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَجَذَبْتُهَا إِلَىَّ فَعَلَّمْتُهَا‏.‏"
      },
      {
        "id": 7052,
        "hadith_number": "7358",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW dan Hidangan Susu Kambing",
        "perawi_melayu": "Riwayat Ibn Abbas رضي الله عنهما :",
        "english_text": "Um Hufaid bint Al-Harith bin Hazn presented the Prophet (ﷺ) with some butter, dried yoghurt (curd milk) and mastigures as a gift. The Prophet (ﷺ) then asked for a meal (mastigures etc. to be put) and it was eaten over his table cloth, but the Prophet (ﷺ) did not eat of it, as he had aversion to it. But if it had been illegal to eat, it would not have been eaten over his table cloth nor would he have ordered that (mastigures meat) to be eaten.",
        "malay_translation": "Um Hufaid binti Al-Harith bin Hazn mempersembahkan kepada Nabi SAW sedikit mentega, dadih kering (susu masam pekat) dan daging mastigures sebagai hadiah.  Nabi SAW kemudian menyuruh hidangan itu dihidangkan (daging mastigures dan lain-lain) dan ia dimakan di atas kain alas meja baginda, tetapi Nabi SAW sendiri tidak memakannya kerana baginda tidak menyukainya.  Namun, sekiranya ia haram dimakan, ia tidak akan dihidangkan di atas kain alas meja baginda dan baginda juga tidak akan menyuruhnya dimakan.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ أُمَّ حُفَيْدٍ بِنْتَ الْحَارِثِ بْنِ حَزْنٍ، أَهْدَتْ إِلَى النَّبِيِّ صلى الله عليه وسلم سَمْنًا وَأَقِطًا وَأَضُبًّا، فَدَعَا بِهِنَّ النَّبِيُّ صلى الله عليه وسلم فَأُكِلْنَ عَلَى مَائِدَتِهِ، فَتَرَكَهُنَّ النَّبِيُّ صلى الله عليه وسلم كَالْمُتَقَذِّرِ لَهُ، وَلَوْ كُنَّ حَرَامًا مَا أُكِلْنَ عَلَى مَائِدَتِهِ، وَلاَ أَمَرَ بِأَكْلِهِنَّ‏.‏"
      },
      {
        "id": 7053,
        "hadith_number": "7359",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menjauhi Masjid Selepas Makan Bawang Putih atau Bawang",
        "perawi_melayu": "Jabir bin Abdullah رضي الله عنه",
        "english_text": "The Prophet (ﷺ) said, \"Whoever has eaten garlic or onion, should keep away from us, or should keep away from our mosque and should stay at home.\" Ibn Wahb said, \"Once a plate full of cooked vegetables was brought to the Prophet (ﷺ) at Badr. Detecting a bad smell from it, he asked about the dish and was informed of the kinds of vegetables in contained. He then said, \"Bring it near,\" and so it was brought near to one of his companions who was with him. When the Prophet (ﷺ) saw it, he disliked eating it and said (to his companion), \"Eat, for I talk in secret to ones whom you do not talk to.\" Ibn-e-Ofair has reported from Ibn-e-Wahab: A  casserole containing vegetables. But Laith and Abu Sufyan did not mention casserole from Younus, so I don't know whether it is Zuhri's saying or a part of the Hadith.",
        "malay_translation": "Rasulullah SAW bersabda, \"Barangsiapa yang telah memakan bawang putih atau bawang, hendaklah dia menjauhi kami, atau hendaklah dia menjauhi masjid kami dan hendaklah dia tinggal di rumah.\" Ibn Wahb berkata, \"Pada suatu ketika, sebuah pinggan berisi sayur-sayuran yang dimasak dibawa kepada Rasulullah SAW di Badar. Setelah mengesan bau yang kurang menyenangkan daripadanya, baginda bertanya tentang hidangan itu dan diberitahu tentang jenis-jenis sayur yang terkandung di dalamnya. Baginda kemudiannya bersabda, \"Dekatkan ia,\" dan maka ia didekatkan kepada salah seorang sahabat baginda yang berada bersamanya. Apabila Rasulullah SAW melihatnya, baginda tidak suka untuk memakannya dan bersabda (kepada sahabatnya), \"Makanlah, kerana Aku bercakap secara rahsia dengan orang-orang yang kamu tidak bercakap dengan mereka.\" Ibn-e-Ofair telah meriwayatkan daripada Ibn-e-Wahab: Sebuah periuk berisi sayur-sayuran. Tetapi Laith dan Abu Sufyan tidak menyebut periuk daripada Yunus, maka aku tidak tahu sama ada ia merupakan perkataan Zuhri atau sebahagian daripada Hadis ini.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عَطَاءُ بْنُ أَبِي رَبَاحٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَنْ أَكَلَ ثُومًا أَوْ بَصَلاً، فَلْيَعْتَزِلْنَا أَوْ لِيَعْتَزِلْ مَسْجِدَنَا، وَلْيَقْعُدْ فِي بَيْتِهِ ‏\"‏‏.‏ وَإِنَّهُ أُتِيَ بِبَدْرٍ ـ قَالَ ابْنُ وَهْبٍ يَعْنِي طَبَقًا ـ فِيهِ خَضِرَاتٌ مِنْ بُقُولٍ، فَوَجَدَ لَهَا رِيحًا فَسَأَلَ عَنْهَا ـ أُخْبِرَ بِمَا فِيهَا مِنَ الْبُقُولِ ـ فَقَالَ قَرِّبُوهَا فَقَرَّبُوهَا إِلَى بَعْضِ أَصْحَابِهِ كَانَ مَعَهُ، فَلَمَّا رَآهُ كَرِهَ أَكْلَهَا قَالَ ‏\"‏ كُلْ، فَإِنِّي أُنَاجِي مَنْ لاَ تُنَاجِي ‏\"‏‏.‏ وَقَالَ ابْنُ عُفَيْرٍ عَنِ ابْنِ وَهْبٍ بِقِدْرٍ فِيهِ خَضِرَاتٌ‏.‏ وَلَمْ يَذْكُرِ اللَّيْثُ وَأَبُو صَفْوَانَ عَنْ يُونُسَ قِصَّةَ الْقِدْرِ، فَلاَ أَدْرِي هُوَ مِنْ قَوْلِ الزُّهْرِيِّ أَوْ فِي الْحَدِيثِ‏.‏"
      },
      {
        "id": 7054,
        "hadith_number": "7360",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Arahan Rasulullah SAW dan Nasihat Kepada Seorang Wanita",
        "perawi_melayu": "Riwayat Jubair bin Mut`im رضي الله عنه :",
        "english_text": "A lady came to Allah's Messenger (ﷺ) and she talked to him about something, and he gave her some order. She said, \"O Allah's Messenger (ﷺ)! If I should not find you?\" He said, \"If you should not find me, then go to Abu Bakr.\" Ibrahim bin Sa`d said, \"As if she meant the death (of the Prophet).",
        "malay_translation": "Seorang wanita datang kepada Rasulullah SAW dan dia bercakap dengan baginda tentang sesuatu, lalu baginda memberi arahan kepadanya. Wanita itu berkata, \"Wahai Rasulullah SAW! Jika saya tidak menemui tuan?\" Baginda menjawab, \"Jika engkau tidak menemui aku, pergilah kepada Abu Bakar.\" Ibrahim bin Sa`d berkata, \"Seolah-olah maksudnya ialah kematian (baginda Nabi).\"",
        "arabic_text": "حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي وَعَمِّي، قَالاَ حَدَّثَنَا أَبِي، عَنْ أَبِيهِ، أَخْبَرَنِي مُحَمَّدُ بْنُ جُبَيْرٍ، أَنَّ أَبَاهُ، جُبَيْرَ بْنَ مُطْعِمٍ أَخْبَرَهُ أَنَّ امْرَأَةً أَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَكَلَّمَتْهُ فِي شَىْءٍ، فَأَمَرَهَا بِأَمْرٍ فَقَالَتْ أَرَأَيْتَ يَا رَسُولَ اللَّهِ إِنْ لَمْ أَجِدْكَ قَالَ ‏ \"‏ إِنْ لَمْ تَجِدِينِي فَأْتِي أَبَا بَكْرٍ ‏\"‏‏.‏ زَادَ الْحُمَيْدِيُّ عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ كَأَنَّهَا تَعْنِي الْمَوْتَ‏.‏"
      },
      {
        "id": 7055,
        "hadith_number": "7361",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kejujuran Ka'b Al-Ashraf dan Kekurangan Maklumatnya",
        "perawi_melayu": "Riwayat Humaid bin 'Abdur-Rahman:",
        "english_text": "He heard Mu'awiya رضي الله عنه talking to a group of people from Quraish at Al-Madina, and on mentioning Ka'b Al-Ashbar, he said, \"He was one of the most truthful of those who used to talk about the people of the Scripture, yet we used to detect certain faults in his information.\"",
        "malay_translation": "Baginda mendengar Mu'awiya رضي الله عنه bercakap dengan sekumpulan orang Quraisy di Madinah.  Semasa menyebut Ka'b Al-Ashraf, baginda berkata, \"Dia adalah antara orang yang paling benar dalam kalangan mereka yang menceritakan tentang Ahli Kitab, namun kami pernah mengesan beberapa kekurangan dalam maklumatnya.\"",
        "arabic_text": "وَقَالَ أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، سَمِعَ مُعَاوِيَةَ، يُحَدِّثُ رَهْطًا مِنْ قُرَيْشٍ بِالْمَدِينَةِ، وَذَكَرَ كَعْبَ الأَحْبَارِ فَقَالَ إِنْ كَانَ مِنْ أَصْدَقِ هَؤُلاَءِ الْمُحَدِّثِينَ الَّذِينَ يُحَدِّثُونَ عَنْ أَهْلِ الْكِتَابِ، وَإِنْ كُنَّا مَعَ ذَلِكَ لَنَبْلُو عَلَيْهِ الْكَذِبَ‏.‏"
      },
      {
        "id": 7056,
        "hadith_number": "7362",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kepercayaan kepada Allah dan Kitab-kitab Suci",
        "perawi_melayu": "Riwayat Abu Hurairah رضي الله عنه :",
        "english_text": "The people of the Book used to read the Torah in Hebrew and then explain it in Arabic to the Muslims. Allah's Messenger (ﷺ) said (to the Muslims). \"Do not believe the people of the Book, nor disbelieve them, but say, 'We believe in Allah and whatever is revealed to us, and whatever is revealed to you.' \"",
        "malay_translation": "Ahl al-Kitab dahulu membaca Taurat dalam bahasa Ibrani dan kemudian menjelaskannya dalam bahasa Arab kepada umat Islam. Rasulullah ﷺ bersabda (kepada umat Islam), \"Janganlah kamu mempercayai sepenuhnya Ahl al-Kitab, dan jangan pula kamu mengingkari mereka sepenuhnya, tetapi katakanlah, 'Kami beriman kepada Allah dan apa yang telah diwahyukan kepada kami, dan apa yang telah diwahyukan kepada kamu.'\"",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، أَخْبَرَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ أَهْلُ الْكِتَابِ يَقْرَءُونَ التَّوْرَاةَ بِالْعِبْرَانِيَّةِ وَيُفَسِّرُونَهَا بِالْعَرَبِيَّةِ لأَهْلِ الإِسْلاَمِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تُصَدِّقُوا أَهْلَ الْكِتَابِ، وَلاَ تُكَذِّبُوهُمْ وَقُولُوا ‏{‏آمَنَّا بِاللَّهِ وَمَا أُنْزِلَ إِلَيْنَا وَمَا أُنْزِلَ إِلَيْكُمْ‏}‏ ‏\"‏‏.‏ الآيَةَ‏.‏"
      },
      {
        "id": 7057,
        "hadith_number": "7363",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Mengapakah Bertanya Kepada Ahli Kitab?",
        "perawi_melayu": "Riwayat Ibn Abbas رضي الله عنهما:",
        "english_text": "\"Why do you ask the people of the scripture about anything while your Book (Qur'an) which has been revealed to Allah's Messenger (ﷺ) is newer and the latest? You read it pure, undistorted and unchanged, and Allah has told you that the people of the scripture (Jews and Christians) changed their scripture and distorted it, and wrote the scripture with their own hands and said, 'It is from Allah,' to sell it for a little gain. Does not the knowledge which has come to you prevent you from asking them about anything? No, by Allah, we have never seen any man from them asking you regarding what has been revealed to you!\"",
        "malay_translation": "“Mengapa kamu bertanya kepada ahli kitab tentang sesuatu sedangkan kitabmu (Al-Quran) yang telah diturunkan kepada Rasulullah ﷺ adalah lebih baharu dan yang terakhir? Kamu membacanya secara suci, tidak diubah dan tidak dirosakkan, dan Allah telah memberitahu kamu bahawa ahli kitab (Yahudi dan Nasrani) telah mengubah kitab mereka dan merosakkannya, dan menulis kitab itu dengan tangan mereka sendiri dan berkata, ‘Ia adalah dari Allah,’ untuk menjualnya dengan sedikit keuntungan. Bukankah ilmu yang telah datang kepadamu menghalang kamu daripada bertanya kepada mereka tentang apa sahaja? Tidak, demi Allah, kami tidak pernah melihat sesiapa pun daripada mereka bertanya kepadamu mengenai apa yang telah diwahyukan kepadamu!”",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِبْرَاهِيمُ، أَخْبَرَنَا ابْنُ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ، أَنَّ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَيْفَ تَسْأَلُونَ أَهْلَ الْكِتَابِ عَنْ شَىْءٍ، وَكِتَابُكُمُ الَّذِي أُنْزِلَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَحْدَثُ، تَقْرَءُونَهُ مَحْضًا لَمْ يُشَبْ وَقَدْ حَدَّثَكُمْ أَنَّ أَهْلَ الْكِتَابِ بَدَّلُوا كِتَابَ اللَّهِ وَغَيَّرُوهُ وَكَتَبُوا بِأَيْدِيهِمُ الْكِتَابَ وَقَالُوا هُوَ مِنْ عِنْدِ اللَّهِ‏.‏ لِيَشْتَرُوا بِهِ ثَمَنًا قَلِيلاً، أَلاَ يَنْهَاكُمْ مَا جَاءَكُمْ مِنَ الْعِلْمِ عَنْ مَسْأَلَتِهِمْ، لاَ وَاللَّهِ مَا رَأَيْنَا مِنْهُمْ رَجُلاً يَسْأَلُكُمْ عَنِ الَّذِي أُنْزِلَ عَلَيْكُمْ‏.‏"
      },
      {
        "id": 7058,
        "hadith_number": "7364",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Mempelajari Al-Quran Berdasarkan Tafsir yang Disepakati",
        "perawi_melayu": "Riwayat Jundab bin Abdullah",
        "english_text": "Allah's Messenger (ﷺ) said, \"Recite (and study) the Qur'an as long as you are in agreement as to its interpretation and meanings, but when you have differences regarding its interpretation and meanings, then you should stop reciting it (for the time being.) (See Hadith No 581, Vol. 6)",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Bacalah (dan pelajarilah) Al-Quran selagi kamu bersepakat tentang tafsir dan maknanya, tetapi apabila kamu berbeza pendapat tentang tafsir dan maknanya, maka berhentilah membacanya (untuk sementara waktu). (Lihat Hadis No 581, Jilid 6)\"",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سَلاَّمِ بْنِ أَبِي مُطِيعٍ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ جُنْدَبِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ اقْرَءُوا الْقُرْآنَ مَا ائْتَلَفَتْ قُلُوبُكُمْ فَإِذَا اخْتَلَفْتُمْ فَقُومُوا عَنْهُ ‏\"‏‏.‏ قَالَ أَبُو عَبْد اللَّهِ سَمِعَ عَبْدُ الرَّحْمَنِ سَلَّامًا."
      },
      {
        "id": 7059,
        "hadith_number": "7365",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Mempelajari Al-Quran Dengan Persefahaman",
        "perawi_melayu": "Jundab bin Abdullah رضي الله عنه",
        "english_text": "Allah's Messenger (ﷺ) said, \"Recite (and study) the Qur'an as long as your hearts are in agreement as to its meanings, but if you have differences as regards its meaning, stop reading it then.\" Hadrat Jundab رضي الله عنه has reported it from prophet ﷺ.",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Bacalah (dan pelajarilah) Al-Quran selagi hati kamu bersepakat tentang maknanya, tetapi jika kamu berselisih faham tentang maknanya, maka hentikanlah pembacaannya.\"  Hadrat Jundab رضي الله عنه telah meriwayatkannya daripada Nabi ﷺ.",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ، عَنْ جُنْدَبِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ اقْرَءُوا الْقُرْآنَ مَا ائْتَلَفَتْ عَلَيْهِ قُلُوبُكُمْ، فَإِذَا اخْتَلَفْتُمْ فَقُومُوا عَنْهُ ‏\"‏‏.‏ وَقَالَ يَزِيدُ بْنُ هَارُونَ عَنْ هَارُونَ الأَعْوَرِ، حَدَّثَنَا أَبُو عِمْرَانَ، عَنْ جُنْدَبٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 7060,
        "hadith_number": "7366",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Nabi SAW menulis wasiat sebelum wafat",
        "perawi_melayu": "Riwayat Ibnu Abbas رضي الله عنهما:",
        "english_text": "When the time of the death of the Prophet (ﷺ) approached while there were some men in the house, and among them was `Umar bin Al-Khatttab رضي الله عنه, the Prophet (ﷺ) said, \"Come near let me write for you a writing after which you will never go astray.\" `Umar رضي الله عنه said, \"The Prophet (ﷺ) is seriously ill, and you have the Qur'an, so Allah's Book is sufficient for us.\" The people in the house differed and disputed. Some of them said, \"Come near so that Allah's Messenger (ﷺ) may write for you a writing after which you will not go astray,\" while some of them said what `Umar رضي الله عنه said. When they made much noise and differed greatly before the Prophet, he said to them, \"Go away and leave me.\" Ibn `Abbas رضي الله عنهما used to say, \"It was a great disaster that their difference and noise prevented Allah's Messenger (ﷺ) from writing that writing for them.",
        "malay_translation": "Apabila hampir waktu kewafatan Nabi SAW, ketika itu ada beberapa orang lelaki di rumahnya, antaranya Umar bin al-Khattab رضي الله عنه, Nabi SAW bersabda, \"Dekatilah aku, supaya aku menuliskan sesuatu untuk kamu, selepasnya kamu tidak akan sesat.\" Umar رضي الله عنه berkata, \"Nabi SAW sedang sakit tenat, dan kamu mempunyai al-Quran, maka Kitab Allah itu sudah memadai bagi kita.\"  Orang-orang yang berada di rumah itu berbeza pendapat dan bertelagah. Sebahagian daripada mereka berkata, \"Dekatilah supaya Rasulullah SAW menuliskan sesuatu untuk kamu, selepasnya kamu tidak akan sesat,\" manakala sebahagian yang lain pula berkata seperti apa yang dikatakan Umar رضي الله عنه.  Apabila mereka bertengkar dan berbeza pendapat dengan kuat di hadapan Nabi SAW, baginda bersabda kepada mereka, \"Pergilah dan tinggalkan aku.\" Ibnu Abbas رضي الله عنهما pernah berkata, \"Itu adalah satu musibah besar, kerana perselisihan dan kegaduhan mereka telah menghalang Rasulullah SAW daripada menuliskan sesuatu itu untuk mereka.",
        "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمَّا حُضِرَ النَّبِيُّ صلى الله عليه وسلم ـ قَالَ وَفِي الْبَيْتِ رِجَالٌ فِيهِمْ عُمَرُ بْنُ الْخَطَّابِ ـ قَالَ ‏\"‏ هَلُمَّ أَكْتُبْ لَكُمْ كِتَابًا لَنْ تَضِلُّوا بَعْدَهُ ‏\"‏‏.‏ قَالَ عُمَرُ إِنَّ النَّبِيَّ صلى الله عليه وسلم غَلَبَهُ الْوَجَعُ وَعِنْدَكُمُ الْقُرْآنُ، فَحَسْبُنَا كِتَابُ اللَّهِ‏.‏ وَاخْتَلَفَ أَهْلُ الْبَيْتِ وَاخْتَصَمُوا، فَمِنْهُمْ مَنْ يَقُولُ قَرِّبُوا يَكْتُبْ لَكُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم كِتَابًا لَنْ تَضِلُّوا بَعْدَهُ‏.‏ وَمِنْهُمْ مَنْ يَقُولُ مَا قَالَ عُمَرُ، فَلَمَّا أَكْثَرُوا اللَّغَطَ وَالاِخْتِلاَفَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ قُومُوا عَنِّي ‏\"‏‏.‏ قَالَ عُبَيْدُ اللَّهِ فَكَانَ ابْنُ عَبَّاسٍ يَقُولُ إِنَّ الرَّزِيَّةَ كُلَّ الرَّزِيَّةِ مَا حَالَ بَيْنَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَبَيْنَ أَنْ يَكْتُبَ لَهُمْ ذَلِكَ الْكِتَابَ مِنِ اخْتِلاَفِهِمْ وَلَغَطِهِمْ‏.‏"
      },
      {
        "id": 7061,
        "hadith_number": "7367",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ibadah Haji Tanpa Umrah dan Hukum Mencukur Rambut",
        "perawi_melayu": "Riwayat Ata'",
        "english_text": "I heard Jabir bin `Abdullah رضی اللہ عنہ in a gathering saying, \"We, the companions of Allah's Messenger (ﷺ) assumed the state of Ihram to perform only Hajj without `Umra.\" Jabir رضی اللہ عنہ added, \"The Prophet (ﷺ) arrived (at Mecca) on the fourth of Dhul-Hijja. And when we arrived (in Mecca) the Prophet (ﷺ) ordered us to finish the state of Ihram, saying, \"Finish your lhram and go to your wives (for sexual relation).\" Jabir رضی اللہ عنہ added, \"The Prophet did not oblige us (to go to our wives) but he only made that legal for us. Then he heard that we were saying, \"When there remains only five days between us and the Day of `Arafat he orders us to finish our Ihram by sleeping with our wives in which case we will proceed to `Arafat with our male organs dribbling with semen?' (Jabir رضی اللہ عنہ pointed out with his hand illustrating what he was saying). Allah's Messenger (ﷺ) stood up and said, 'You (People) know that I am the most Allah-fearing, the most truthful and the best doer of good deeds (pious) from among you. If I had not brought the Hadi with me, I would have finished my Ihram as you will do, so finish your Ihram. If I had formerly known what I came to know lately, I would not have brought the Hadi with me.' So we finished our Ihram and listened to the Prophet (ﷺ) and obeyed him.\" (See Hadith No. 713, Vol. 2)",
        "malay_translation": "Aku mendengar Jabir bin Abdullah r.a. di dalam satu majlis berkata, \"Kami, para sahabat Rasulullah ﷺ mengerjakan ihram hanya untuk menunaikan Haji tanpa Umrah.\" Jabir r.a. menambah, \"Baginda Rasulullah ﷺ tiba di Mekah pada tanggal empat Zulhijjah. Dan apabila kami tiba di Mekah, Baginda Rasulullah ﷺ memerintahkan kami untuk menyelesaikan ihram, dengan sabdanya, \"Selesaikan ihram kamu dan pergilah kepada isteri-isteri kamu (untuk melakukan hubungan suami isteri).\" Jabir r.a. menambah, \"Baginda Nabi tidak mewajibkan kami (pergi kepada isteri-isteri kami) tetapi Baginda hanya menghalalkan perkara itu untuk kami. Kemudian Baginda mendengar bahawa kami berkata, \"Apabila hanya tinggal lima hari antara kami dan hari Arafah, Baginda memerintahkan kami untuk menyelesaikan ihram dengan tidur bersama isteri-isteri kami, maka kami akan berangkat ke Arafah dengan alat sulit kami menitikkan mani?\" (Jabir r.a. menunjukkan dengan tangannya menggambarkan apa yang beliau katakan). Rasulullah ﷺ berdiri dan bersabda, 'Kamu sekalian tahu bahawa aku adalah orang yang paling takut kepada Allah, paling benar dan paling baik melakukan amal soleh daripada kalangan kamu. Sekiranya aku tidak membawa Hady bersamaku, nescaya aku akan menyelesaikan ihramku sepertimana kamu akan lakukan, maka selesaikanlah ihram kamu. Sekiranya aku telah mengetahui apa yang aku ketahui sekarang, nescaya aku tidak akan membawa Hady bersamaku.' Maka kami menyelesaikan ihram kami dan mendengar kata-kata Rasulullah ﷺ dan taat kepada Baginda.\" (Lihat Hadis No. 713, Jilid 2)",
        "arabic_text": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، عَنِ ابْنِ جُرَيْجٍ، قَالَ عَطَاءٌ قَالَ جَابِرٌ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ وَقَالَ مُحَمَّدُ بْنُ بَكْرٍ حَدَّثَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، فِي أُنَاسٍ مَعَهُ قَالَ أَهْلَلْنَا أَصْحَابَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الْحَجِّ خَالِصًا لَيْسَ مَعَهُ عُمْرَةٌ ـ قَالَ عَطَاءٌ قَالَ جَابِرٌ ـ فَقَدِمَ النَّبِيُّ صلى الله عليه وسلم صُبْحَ رَابِعَةٍ مَضَتْ مِنْ ذِي الْحِجَّةِ فَلَمَّا قَدِمْنَا أَمَرَنَا النَّبِيُّ صلى الله عليه وسلم أَنْ نَحِلَّ وَقَالَ ‏\"‏ أَحِلُّوا وَأَصِيبُوا مِنَ النِّسَاءِ ‏\"‏‏.‏ قَالَ عَطَاءٌ قَالَ جَابِرٌ وَلَمْ يَعْزِمْ عَلَيْهِمْ وَلَكِنْ أَحَلَّهُنَّ لَهُمْ فَبَلَغَهُ أَنَّا نَقُولُ لَمَّا لَمْ يَكُنْ بَيْنَنَا وَبَيْنَ عَرَفَةَ إِلاَّ خَمْسٌ أَمَرَنَا أَنْ نَحِلَّ إِلَى نِسَائِنَا فَنَأْتِي عَرَفَةَ تَقْطُرُ مَذَاكِيرُنَا الْمَذْىَ قَالَ وَيَقُولُ جَابِرٌ بِيَدِهِ هَكَذَا وَحَرَّكَهَا فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ قَدْ عَلِمْتُمْ أَنِّي أَتْقَاكُمْ لِلَّهِ وَأَصْدَقُكُمْ وَأَبَرُّكُمْ وَلَوْلاَ هَدْيِي لَحَلَلْتُ كَمَا تَحِلُّونَ فَحِلُّوا فَلَوِ اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ مَا أَهْدَيْتُ ‏\"‏‏.‏ فَحَلَلْنَا وَسَمِعْنَا وَأَطَعْنَا‏.‏"
      },
      {
        "id": 7062,
        "hadith_number": "7368",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Sunat Sebelum Maghrib",
        "perawi_melayu": "Riwayat Abdullah ibn Muzammil",
        "english_text": "The Prophet (ﷺ) said, \"Perform (an optional) prayer before Maghrib prayer.\" (He repeated it thrice) and the third time he said, \"Whoever wants to offer it can do so,\" lest the people should take it as a Sunna (tradition). (See Hadith No. 277, Vol. 2)",
        "malay_translation": "Rasulullah ﷺ bersabda: \"Solatlah (solat sunat) sebelum solat Maghrib.\" (Baginda mengulangi tiga kali) dan pada kali ketiga baginda bersabda: \"Barangsiapa yang mahu menunaikannya, bolehlah melakukannya,\" supaya umat tidak menganggapnya sebagai sunat (tradisi). (Lihat Hadis No. 277, Jilid 2)",
        "arabic_text": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنِ الْحُسَيْنِ، عَنِ ابْنِ بُرَيْدَةَ، حَدَّثَنِي عَبْدُ اللَّهِ الْمُزَنِيُّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ صَلُّوا قَبْلَ صَلاَةِ الْمَغْرِبِ ـ قَالَ فِي الثَّالِثَةِ ـ لِمَنْ شَاءَ ‏\"‏‏.‏ كَرَاهِيَةَ أَنْ يَتَّخِذَهَا النَّاسُ سُنَّةً‏.‏"
      },
      {
        "id": 7063,
        "hadith_number": "7369",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ketidakbersalahan Aisyah r.a.",
        "perawi_melayu": "Riwayat Aisyah r.a.:",
        "english_text": "After the slanderers had given a forged statement against her, Allah's Messenger (ﷺ) called `Ali bin Abi Talib and Usama bin Zaid رضي الله عنهما when the Divine Inspiration was delayed. He wanted to ask them and consult them about the question of divorcing me. Usama رضي الله عنه gave his evidence that was based on what he knew about my innocence, but `Ali رضي الله عنه said, \"Allah has not put restrictions on you and there are many women other than her. Furthermore you may ask the slave girl who will tell you the truth.\" So the Prophet (ﷺ) asked Barira (my salve girl), \"Have you seen anything that may arouse your suspicion?\" She replied, \"I have not seen anything more than that she is a little girl who sleeps, leaving the dough of her family (unguarded) that the domestic goats come and eat it.\" Then the Prophet (ﷺ) stood on the pulpit and said, \"O Muslims! Who will help me against the man who has harmed me by slandering my wife? By Allah, I know nothing about my family except good.\" The narrator added: Then the Prophet (ﷺ) mentioned the innocence of `Aisha رضي الله عنها . Abu Osama has also reported the same from Hisham.",
        "malay_translation": "Setelah para pemfitnah memberikan kenyataan palsu terhadapnya, Rasulullah SAW memanggil Ali bin Abi Talib dan Usama bin Zaid رضي الله عنهما ketika wahyu ditangguh. Baginda ingin bertanya dan berunding dengan mereka tentang persoalan menceraikan saya. Usama رضي الله عنه memberikan keterangannya berdasarkan apa yang diketahui tentang kejujuran saya, tetapi Ali رضي الله عنه berkata, \"Allah SWT tidak mengenakan sekatan ke atasmu dan terdapat ramai wanita lain selainnya. Tambahan pula, engkau boleh bertanya kepada hamba perempuan yang akan memberitahu kebenaran.\" Maka Rasulullah SAW bertanya kepada Barirah (hamba perempuan saya), \"Adakah engkau melihat sesuatu yang mungkin menimbulkan syak wasangka?\" Jawabnya, \"Saya tidak melihat apa-apa melainkan bahawa dia seorang gadis kecil yang tidur, meninggalkan adunan keluarganya (tanpa pengawasan) sehingga kambing-kambing peliharaan datang dan memakannya.\" Kemudian Rasulullah SAW berdiri di atas mimbar dan bersabda, \"Wahai kaum Muslimin! Siapakah yang akan menolongku terhadap orang yang telah memudaratkanku dengan memfitnah isteriku? Demi Allah, aku tidak mengetahui tentang keluargaku kecuali kebaikan.\" Perawi menambah: Kemudian Rasulullah SAW menyebut tentang kejujuran Aisyah رضي الله عنها. Abu Usamah juga meriwayatkan perkara yang sama daripada Hisyam.",
        "arabic_text": "حَدَّثَنَا الأُوَيْسِيُّ، حَدَّثَنَا إِبْرَاهِيمُ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عُرْوَةُ، وَابْنُ الْمُسَيَّبِ، وَعَلْقَمَةُ بْنُ وَقَّاصٍ، وَعُبَيْدُ اللَّهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ حِينَ قَالَ لَهَا أَهْلُ الإِفْكِ قَالَتْ وَدَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَلِيَّ بْنَ أَبِي طَالِبٍ وَأُسَامَةَ بْنَ زَيْدٍ حِينَ اسْتَلْبَثَ الْوَحْىُ يَسْأَلُهُمَا، وَهْوَ يَسْتَشِيرُهُمَا فِي فِرَاقِ أَهْلِهِ، فَأَمَّا أُسَامَةُ فَأَشَارَ بِالَّذِي يَعْلَمُ مِنْ بَرَاءَةِ أَهْلِهِ، وَأَمَّا عَلِيٌّ فَقَالَ لَمْ يُضَيِّقِ اللَّهُ عَلَيْكَ، وَالنِّسَاءُ سِوَاهَا كَثِيرٌ، وَسَلِ الْجَارِيَةَ تَصْدُقْكَ‏.‏ فَقَالَ ‏\"‏ هَلْ رَأَيْتِ مِنْ شَىْءٍ يَرِيبُكِ ‏\"‏‏.‏ قَالَتْ مَا رَأَيْتُ أَمْرًا أَكْثَرَ مِنْ أَنَّهَا جَارِيَةٌ حَدِيثَةُ السِّنِّ تَنَامُ عَنْ عَجِينِ أَهْلِهَا فَتَأْتِي الدَّاجِنُ فَتَأْكُلُهُ‏.‏ فَقَامَ عَلَى الْمِنْبَرِ فَقَالَ ‏\"‏ يَا مَعْشَرَ الْمُسْلِمِينَ مَنْ يَعْذِرُنِي مِنْ رَجُلٍ بَلَغَنِي أَذَاهُ فِي أَهْلِي، وَاللَّهِ مَا عَلِمْتُ عَلَى أَهْلِي إِلاَّ خَيْرًا ‏\"‏‏.‏ فَذَكَرَ بَرَاءَةَ عَائِشَةَ‏.‏ وَقَالَ أَبُو أُسَامَةَ عَنْ هِشَامٍ‏.‏"
      },
      {
        "id": 7064,
        "hadith_number": "7370",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Fitnah Terhadap Aisyah",
        "perawi_melayu": "Daripada Aisyah رضي الله عنها :",
        "english_text": "Allah's Messenger (ﷺ) addressed the people, and after praising and glorifying Allah, he said, \"What do you suggest me regarding those people who are abusing my wife? I have never known anything bad about her.\" The sub-narrator, `Urwa, said: When `Aisha رضی اللہ عنہا was told of the slander, she said, \"O Allah's Apostle! Will you allow me to go to my parents' home?\" He allowed her and sent a slave along with her. An Ansari man said, \"Subhanaka! It is not right for us to speak about this. Subhanaka! This is a great lie!\"",
        "malay_translation": "Rasulullah ﷺ bersabda kepada orang ramai, setelah memuji dan mengagungkan Allah, baginda berkata, \"Apakah cadangan kamu tentang orang-orang yang memfitnah isteriku? Aku tidak pernah mengetahui sebarang keburukan tentangnya.\"  Urwa meriwayatkan:  Apabila Aisyah رضي الله عنها diberitahu tentang fitnah tersebut, beliau berkata, \"Wahai Rasulullah! Adakah baginda membenarkan saya pulang ke rumah ibu bapa saya?\" Baginda membenarkannya dan menghantar seorang hamba bersamanya. Seorang lelaki Ansar berkata, \"Subhanaka! Tidak patut kita bercakap tentang perkara ini. Subhanaka! Ini adalah satu dusta yang besar!\"",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ أَبِي زَكَرِيَّاءَ الْغَسَّانِيُّ، عَنْ هِشَامٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَطَبَ النَّاسَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ وَقَالَ ‏ \"‏ مَا تُشِيرُونَ عَلَىَّ فِي قَوْمٍ يَسُبُّونَ أَهْلِي مَا عَلِمْتُ عَلَيْهِمْ مِنْ سُوءٍ قَطُّ ‏\"‏‏.‏ وَعَنْ عُرْوَةَ قَالَ لَمَّا أُخْبِرَتْ عَائِشَةُ بِالأَمْرِ قَالَتْ يَا رَسُولَ اللَّهِ أَتَأْذَنُ لِي أَنْ أَنْطَلِقَ إِلَى أَهْلِي‏.‏ فَأَذِنَ لَهَا وَأَرْسَلَ مَعَهَا الْغُلاَمَ‏.‏ وَقَالَ رَجُلٌ مِنَ الأَنْصَارِ سُبْحَانَكَ مَا يَكُونُ لَنَا أَنْ نَتَكَلَّمَ بِهَذَا، سُبْحَانَكَ هَذَا بُهْتَانٌ عَظِيمٌ‏.‏"
      }
    ]
  }
}