{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 45,
    "data": [
      {
        "id": 248,
        "hadith_number": "248",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Mandi Junub",
        "perawi_melayu": "Dikisahkan oleh `Aishah رضي الله عنها",
        "english_text": "Whenever the Prophet (ﷺ) took a bath after Janaba he started by washing his hands and then performed ablution like that for the prayer. After that he would put his fingers in water and move the roots of his hair with them, and then pour three handfuls of water over his head and then pour water all over his body.",
        "malay_translation": "Apabila Nabi SAW mandi junub, baginda akan mula dengan mencuci kedua-dua tangannya, kemudian melakukan wuduk seperti wuduk untuk solat. Selepas itu, baginda akan memasukkan jari-jarinya ke dalam air dan menggosok akar rambutnya dengannya, kemudian menuang tiga genggam air ke atas kepalanya, dan kemudian menuang air ke seluruh badannya.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا اغْتَسَلَ مِنَ الْجَنَابَةِ بَدَأَ فَغَسَلَ يَدَيْهِ، ثُمَّ يَتَوَضَّأُ كَمَا يَتَوَضَّأُ لِلصَّلاَةِ، ثُمَّ يُدْخِلُ أَصَابِعَهُ فِي الْمَاءِ، فَيُخَلِّلُ بِهَا أُصُولَ شَعَرِهِ ثُمَّ يَصُبُّ عَلَى رَأْسِهِ ثَلاَثَ غُرَفٍ بِيَدَيْهِ، ثُمَّ يُفِيضُ الْمَاءَ عَلَى جِلْدِهِ كُلِّهِ‏.‏"
      },
      {
        "id": 249,
        "hadith_number": "249",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Mandi Junub",
        "perawi_melayu": "Daripada Maimunah (isteri Nabi SAW):",
        "english_text": "Allah's Messenger (ﷺ) performed ablution like that for the prayer but did not wash his feet. He washed off the discharge from his private parts and then poured water over his body. He withdrew his feet from that place (the place where he took the bath) and then washed them. And that was his way of taking the bath of Janaba.",
        "malay_translation": "Rasulullah SAW telah mengambil wuduk seperti untuk solat, tetapi tidak membasuh kakinya. Baginda membasuh kotoran dari anggota sulitnya dan kemudian menuangkan air ke atas badannya. Baginda menarik kakinya dari tempat (tempat mandi) itu dan kemudian membasuh kakinya. Dan itulah cara Baginda mandi junub.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ تَوَضَّأَ رَسُولُ اللَّهِ صلى الله عليه وسلم وُضُوءَهُ لِلصَّلاَةِ غَيْرَ رِجْلَيْهِ، وَغَسَلَ فَرْجَهُ، وَمَا أَصَابَهُ مِنَ الأَذَى، ثُمَّ أَفَاضَ عَلَيْهِ الْمَاءَ، ثُمَّ نَحَّى رِجْلَيْهِ فَغَسَلَهُمَا، هَذِهِ غُسْلُهُ مِنَ الْجَنَابَةِ‏.‏"
      },
      {
        "id": 250,
        "hadith_number": "250",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Penggunaan Satu Periuk Mandi oleh Nabi SAW",
        "perawi_melayu": "Dikisahkan oleh 'Aishah r.a.",
        "english_text": "The Prophet (ﷺ) and I used to take a bath from a single pot called 'Faraq'.",
        "malay_translation": "Nabi SAW dan saya biasa mandi menggunakan satu periuk yang dikenali sebagai 'Faraq'.",
        "arabic_text": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أَغْتَسِلُ أَنَا وَالنَّبِيُّ، صلى الله عليه وسلم مِنْ إِنَاءٍ وَاحِدٍ مِنْ قَدَحٍ يُقَالُ لَهُ الْفَرَقُ‏.‏"
      },
      {
        "id": 251,
        "hadith_number": "251",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perihal Mandi Nabi SAW Menurut Aisyah R.A.",
        "perawi_melayu": "Diriwayatkan oleh Abu Salama:",
        "english_text": "`Aisha's brother and I went to `Aisha and he asked her about the bath of the Prophet. She brought a pot containing about a Sa` of water and took a bath and poured it over her head and at that time there was a screen between her and us.",
        "malay_translation": "Kakak `Aisyah dan saya pergi menemui `Aisyah r.a. dan dia bertanya tentang cara mandi Nabi SAW.  `Aisyah r.a. membawa periuk yang berisi lebih kurang satu sa` air dan mandi, mencurahkan air ke atas kepalanya. Ketika itu, terdapat tabir di antara `Aisyah r.a. dan kami.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنِي عَبْدُ الصَّمَدِ، قَالَ حَدَّثَنِي شُعْبَةُ، قَالَ حَدَّثَنِي أَبُو بَكْرِ بْنُ حَفْصٍ، قَالَ سَمِعْتُ أَبَا سَلَمَةَ، يَقُولُ دَخَلْتُ أَنَا وَأَخُو، عَائِشَةَ عَلَى عَائِشَةَ فَسَأَلَهَا أَخُوهَا عَنْ غُسْلِ النَّبِيِّ، صلى الله عليه وسلم فَدَعَتْ بِإِنَاءٍ نَحْوًا مِنْ صَاعٍ، فَاغْتَسَلَتْ وَأَفَاضَتْ عَلَى رَأْسِهَا، وَبَيْنَنَا وَبَيْنَهَا حِجَابٌ‏.‏ \r\nقَالَ أَبُو عَبْدِ اللَّهِ قَالَ يَزِيدُ بْنُ هَارُونَ وَبَهْزٌ وَالْجُدِّيُّ عَنْ شُعْبَةَ قَدْرِ صَاعٍ‏.‏"
      },
      {
        "id": 252,
        "hadith_number": "252",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keberkatan Satu Sa' Air Mandi dan Solat Jemaah",
        "perawi_melayu": "Dikisahkan oleh Abu Ja'far:",
        "english_text": "While I and my father were with Jabir bin `Abdullah, some people asked him about taking a bath. He replied, \"A Sa` of water is sufficient for you.\" A man said, \"A Sa` is not sufficient for me.\" Jabir said, \"A Sa` was sufficient for one who had more hair than you and was better than you (meaning the Prophet).\" And then Jabir (put on) his garment and led the prayer.",
        "malay_translation": "Ketika saya dan ayah saya bersama Jabir bin `Abdullah, ada beberapa orang bertanya kepadanya tentang mandi wajib. Beliau menjawab, \"Satu sa' air sudah cukup untuk kalian.\" Seorang lelaki berkata, \"Satu sa' tidak cukup untuk saya.\" Jabir berkata, \"Satu sa' sudah cukup untuk orang yang lebih banyak rambut daripada kamu dan lebih baik darimu (maksudnya Nabi SAW).\" Kemudian Jabir mengenakan pakaiannya dan memimpin solat.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، قَالَ حَدَّثَنَا زُهَيْرٌ، عَنْ أَبِي إِسْحَاقَ، قَالَ حَدَّثَنَا أَبُو جَعْفَرٍ، أَنَّهُ كَانَ عِنْدَ جَابِرِ بْنِ عَبْدِ اللَّهِ هُوَ وَأَبُوهُ، وَعِنْدَهُ قَوْمٌ فَسَأَلُوهُ عَنِ الْغُسْلِ،‏.‏ فَقَالَ يَكْفِيكَ صَاعٌ‏.‏ فَقَالَ رَجُلٌ مَا يَكْفِينِي‏.‏ فَقَالَ جَابِرٌ كَانَ يَكْفِي مَنْ هُوَ أَوْفَى مِنْكَ شَعَرًا، وَخَيْرٌ مِنْكَ، ثُمَّ أَمَّنَا فِي ثَوْبٍ‏.‏"
      },
      {
        "id": 253,
        "hadith_number": "253",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW dan Maimunah Mandi Bersama dari Satu Periuk",
        "perawi_melayu": "Dikisahkan oleh Ibn `Abbas:",
        "english_text": "The Prophet (ﷺ) and Maimuna used to take a bath from a single pot.",
        "malay_translation": "Rasulullah SAW dan Maimunah biasa mandi menggunakan satu periuk yang sama.",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ جَابِرِ بْنِ زَيْدٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم وَمَيْمُونَةَ كَانَا يَغْتَسِلاَنِ مِنْ إِنَاءٍ وَاحِدٍ‏.‏ \r\nقَالَ أَبُو عَبْدِ اللَّهِ كَانَ ابْنُ عُيَيْنَةَ يَقُولُ أَخِيرًا عَنِ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ، وَالصَّحِيحُ مَا رَوَى أَبُو نُعَيْمٍ‏.‏"
      },
      {
        "id": 254,
        "hadith_number": "254",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Membersihkan Kepala",
        "perawi_melayu": "Dikisahkan oleh Jubair bin Mut`im:",
        "english_text": "Allah's Messenger (ﷺ) said, \"As for me, I pour water three times on my head.\" And he pointed with both his hands.",
        "malay_translation": "Rasulullah SAW bersabda, \"Bagiku, aku menuangkan air tiga kali ke atas kepala.\"  Dan baginda menunjuk dengan kedua-dua tangannya.",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا زُهَيْرٌ، عَنْ أَبِي إِسْحَاقَ، قَالَ حَدَّثَنِي سُلَيْمَانُ بْنُ صُرَدٍ، قَالَ حَدَّثَنِي جُبَيْرُ بْنُ مُطْعِمٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَمَّا أَنَا فَأُفِيضُ عَلَى رَأْسِي ثَلاَثًا ‏\"‏‏.‏ وَأَشَارَ بِيَدَيْهِ كِلْتَيْهِمَا‏.‏"
      },
      {
        "id": 255,
        "hadith_number": "255",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Mengucurkan Air Ke Atas Kepalanya Tiga Kali",
        "perawi_melayu": "Dikisahkan oleh Jabir bin `Abdullah:",
        "english_text": "The Prophet (ﷺ) used to pour water three times on his head.",
        "malay_translation": "Nabi SAW biasa mencurahkan air ke atas kepalanya sebanyak tiga kali.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا غُنْدَرٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مِخْوَلِ بْنِ رَاشِدٍ، عَنْ مُحَمَّدِ بْنِ عَلِيٍّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُفْرِغُ عَلَى رَأْسِهِ ثَلاَثًا‏.‏"
      },
      {
        "id": 256,
        "hadith_number": "256",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Mandi Junub Nabi SAW Menurut Hadis Bukhari",
        "perawi_melayu": "Dikisahkan oleh Abu Ja`far:",
        "english_text": "Jabir bin `Abdullah berkata kepada saya, \"Adik sepupu anda (Hasan bin Muhammad bin Al-Hanafiya) datang menemui saya dan bertanya tentang mandi junub. Saya menjawab, 'Nabi (ﷺ) biasanya mengambil tiga genggam air, menuangkannya ke atas kepalanya dan kemudian menuangkan lagi air ke atas badannya.' Al-Hasan berkata kepada saya, 'Saya seorang lelaki berambut lebat.' Saya menjawab, 'Nabi (ﷺ) mempunyai rambut lebih banyak daripada anda'.\"",
        "malay_translation": "Jabir bin `Abdullah menceritakan, \"Adik sepupu anda, Hasan bin Muhammad bin Al-Hanafiya, datang menemui saya dan menanyakan cara mandi junub. Saya menjawab, 'Nabi (ﷺ) biasanya mengambil tiga genggam air, menuangkannya ke atas kepalanya, kemudian menuangkan lagi air ke atas badannya.'  Al-Hasan berkata, 'Saya seorang yang berambut lebat.' Saya menjawab, 'Nabi (ﷺ) mempunyai rambut yang lebih banyak daripada anda.'\"",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا مَعْمَرُ بْنُ يَحْيَى بْنِ سَامٍ، حَدَّثَنِي أَبُو جَعْفَرٍ، قَالَ قَالَ لِي جَابِرٌ أَتَانِي ابْنُ عَمِّكَ يُعَرِّضُ بِالْحَسَنِ بْنِ مُحَمَّدٍ ابْنِ الْحَنَفِيَّةِ قَالَ كَيْفَ الْغُسْلُ مِنَ الْجَنَابَةِ فَقُلْتُ كَانَ النَّبِيُّ صلى الله عليه وسلم يَأْخُذُ ثَلاَثَةَ أَكُفٍّ وَيُفِيضُهَا عَلَى رَأْسِهِ، ثُمَّ يُفِيضُ عَلَى سَائِرِ جَسَدِهِ‏.‏ فَقَالَ لِي الْحَسَنُ إِنِّي رَجُلٌ كَثِيرُ الشَّعَرِ‏.‏ فَقُلْتُ كَانَ النَّبِيُّ صلى الله عليه وسلم أَكْثَرَ مِنْكَ شَعَرًا‏.‏"
      },
      {
        "id": 257,
        "hadith_number": "257",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Mandi",
        "perawi_melayu": "Dikisahkan oleh Maimunah:",
        "english_text": "I placed water for the bath of the Prophet. He washed his hands twice or thrice and then poured water on his left hand and washed his private parts. He rubbed his hands over the earth (and cleaned them), rinsed his mouth, washed his nose by putting water in it and blowing it out, washed his face and both forearms and then poured water over his body. Then he withdrew from that place and washed his feet.",
        "malay_translation": "Aku menyediakan air untuk mandi Rasulullah SAW. Baginda membasuh kedua-dua tangannya dua atau tiga kali, kemudian menuang air ke tangan kiri dan membasuh anggota sulitnya. Baginda menggosok tangannya di atas tanah (dan membersihkannya), membilas mulutnya, membersihkan hidungnya dengan memasukkan air dan meniupnya keluar, membasuh mukanya dan kedua lengannya, kemudian menuang air ke seluruh badannya. Kemudian Baginda keluar dari tempat itu dan membasuh kedua kakinya.",
        "arabic_text": "حَدَّثَنَا مُوسَى، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، عَنِ الأَعْمَشِ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَتْ مَيْمُونَةُ وَضَعْتُ لِلنَّبِيِّ صلى الله عليه وسلم مَاءً لِلْغُسْلِ، فَغَسَلَ يَدَيْهِ مَرَّتَيْنِ أَوْ ثَلاَثًا، ثُمَّ أَفْرَغَ عَلَى شِمَالِهِ فَغَسَلَ مَذَاكِيرَهُ، ثُمَّ مَسَحَ يَدَهُ بِالأَرْضِ، ثُمَّ مَضْمَضَ وَاسْتَنْشَقَ وَغَسَلَ وَجْهَهُ وَيَدَيْهِ، ثُمَّ أَفَاضَ عَلَى جَسَدِهِ، ثُمَّ تَحَوَّلَ مِنْ مَكَانِهِ فَغَسَلَ قَدَمَيْهِ‏.‏"
      },
      {
        "id": 258,
        "hadith_number": "258",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Nabi SAW Mandi Janabah dan Menggunakan Hilab",
        "perawi_melayu": "Dikisahkan oleh `Aishah:",
        "english_text": "Whenever the Prophet (ﷺ) took the bath of Janaba (sexual relation or wet dream) he asked for the Hilab or some other scent. He used to take it in his hand, rub it first over the right side of his head and then over the left and then rub the middle of his head with both hands.",
        "malay_translation": "Apabila Rasulullah SAW mandi junub (mandi wajib selepas bersentuhan seksual atau mimpi basah), baginda akan meminta hilab atau wangian lain. Baginda akan mengambilnya di tangan, menggosokkannya terlebih dahulu di bahagian kanan kepala, kemudian di bahagian kiri dan seterusnya menggosok tengah kepala dengan kedua-dua tangan.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ حَنْظَلَةَ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا اغْتَسَلَ مِنَ الْجَنَابَةِ دَعَا بِشَىْءٍ نَحْوَ الْحِلاَبِ، فَأَخَذَ بِكَفِّهِ، فَبَدَأَ بِشِقِّ رَأْسِهِ الأَيْمَنِ ثُمَّ الأَيْسَرِ، فَقَالَ بِهِمَا عَلَى رَأْسِهِ‏.‏"
      },
      {
        "id": 259,
        "hadith_number": "259",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Mandi (bersuci)",
        "perawi_melayu": "Diriwayatkan oleh Maimunah",
        "english_text": "I placed water for the bath of the Prophet (ﷺ) and he poured water with his right hand on his left and washed them. Then he washed his private parts and rubbed his hands on the ground, washed them with water, rinsed his mouth and washed his nose by putting water in it and blowing it out, washed his face and poured water on his head. He withdrew from that place and washed his feet. A piece of cloth (towel) was given to him but he did not use it.",
        "malay_translation": "Saya menyediakan air untuk mandi Rasulullah SAW dan baginda menuang air dengan tangan kanan ke tangan kiri dan membasuh kedua-duanya. Kemudian baginda membasuh anggota sulitnya dan menggosok kedua tangannya ke tanah, membasuh kedua tangannya dengan air, membilas mulut dan membasuh hidung dengan memasukkan air dan meniupnya keluar, membasuh wajah dan menuangkan air ke atas kepalanya. Baginda beredar dari tempat tersebut dan membasuh kedua kakinya. Sepotong kain (tuala) diberikan kepadanya tetapi baginda tidak menggunakannya.",
        "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، قَالَ حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي سَالِمٌ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ حَدَّثَتْنَا مَيْمُونَةُ، قَالَتْ صَبَبْتُ لِلنَّبِيِّ صلى الله عليه وسلم غُسْلاً، فَأَفْرَغَ بِيَمِينِهِ عَلَى يَسَارِهِ فَغَسَلَهُمَا، ثُمَّ غَسَلَ فَرْجَهُ، ثُمَّ قَالَ بِيَدِهِ الأَرْضَ فَمَسَحَهَا بِالتُّرَابِ، ثُمَّ غَسَلَهَا، ثُمَّ تَمَضْمَضَ وَاسْتَنْشَقَ، ثُمَّ غَسَلَ وَجْهَهُ، وَأَفَاضَ عَلَى رَأْسِهِ، ثُمَّ تَنَحَّى فَغَسَلَ قَدَمَيْهِ، ثُمَّ أُتِيَ بِمِنْدِيلٍ، فَلَمْ يَنْفُضْ بِهَا‏.‏"
      },
      {
        "id": 260,
        "hadith_number": "260",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Mandi Junub dan Menguruskan Wudhuk",
        "perawi_melayu": "Dikisahkan oleh Maimuna:",
        "english_text": "The Prophet (ﷺ) took the bath of Janaba. (sexual relation or wet dream). He first cleaned his private parts with his hand, and then rubbed it (that hand) on the wall (earth) and washed it. Then he performed ablution like that for the prayer, and after the bath he washed his feet.",
        "malay_translation": "Nabi SAW mandi junub (mandi wajib selepas bersentuhan seksual atau mimpi basah). Baginda mula membersihkan anggota sulitnya dengan tangan, kemudian menggosok tangan tersebut pada dinding (atau tanah) dan membasuh tangannya. Selepas itu, Baginda melakukan wuduk seperti itu untuk solat, dan setelah mandi junub, Baginda membasuh kakinya.",
        "arabic_text": "حَدَّثَنَا الْحُمَيْدِيُّ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا الأَعْمَشُ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم اغْتَسَلَ مِنَ الْجَنَابَةِ، فَغَسَلَ فَرْجَهُ بِيَدِهِ، ثُمَّ دَلَكَ بِهَا الْحَائِطَ ثُمَّ غَسَلَهَا، ثُمَّ تَوَضَّأَ وُضُوءَهُ لِلصَّلاَةِ، فَلَمَّا فَرَغَ مِنْ غُسْلِهِ غَسَلَ رِجْلَيْهِ‏.‏"
      },
      {
        "id": 261,
        "hadith_number": "261",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW dan Saya Mandi Menggunakan Satu Periuk Air",
        "perawi_melayu": "Dikisahkan oleh Aisyah:",
        "english_text": "The Prophet (ﷺ) and I used to take a bath from a single pot of water and our hands used to go in the pot after each other in turn.",
        "malay_translation": "Nabi SAW dan saya dulu mandi menggunakan satu periuk air yang sama, dan kami akan mencelupkan tangan kami ke dalam periuk itu secara bergilir-gilir.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، أَخْبَرَنَا أَفْلَحُ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أَغْتَسِلُ أَنَا وَالنَّبِيُّ، صلى الله عليه وسلم مِنْ إِنَاءٍ وَاحِدٍ تَخْتَلِفُ أَيْدِينَا فِيهِ‏.‏"
      },
      {
        "id": 262,
        "hadith_number": "262",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Membersihkan Tangan Sebelum Mandi Junub",
        "perawi_melayu": "Disebutkan oleh `Aisha",
        "english_text": "Whenever Allah's Messenger (ﷺ) took a bath of Janaba, he washed his hands first.",
        "malay_translation": "Apabila Rasulullah SAW mandi junub, baginda akan membasuh tangannya terlebih dahulu.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا اغْتَسَلَ مِنَ الْجَنَابَةِ غَسَلَ يَدَهُ‏.‏"
      },
      {
        "id": 263,
        "hadith_number": "263",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Bersama Nabi SAW Menggunakan Satu Periuk Air untuk Mandi Janabat",
        "perawi_melayu": "Dikisahkan oleh `Aisha:",
        "english_text": "The Prophet (ﷺ) and I used to take a bath from a single pot of water after Janaba.",
        "malay_translation": "Nabi SAW dan saya biasa mandi menggunakan satu periuk air sahaja selepas junub.",
        "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بَكْرِ بْنِ حَفْصٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أَغْتَسِلُ أَنَا وَالنَّبِيُّ، صلى الله عليه وسلم مِنْ إِنَاءٍ وَاحِدٍ مِنْ جَنَابَةٍ‏.‏ وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ مِثْلَهُ‏.‏"
      },
      {
        "id": 264,
        "hadith_number": "264",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Penggunaan Satu Periuk Air untuk Mandi oleh Nabi dan Isterinya",
        "perawi_melayu": "Dikisahkan oleh Anas bin Malik:",
        "english_text": "The Prophet (ﷺ) and one of his wives used to take a bath from a single pot of water. (Shu`ba added to Anas' Statement \"After the Janaba\").",
        "malay_translation": "Nabi SAW dan salah seorang isterinya dulu mandi menggunakan satu periuk air yang sama. (Shu`ba menambah kepada perkataan Anas, \"selepas junub\").",
        "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ جَبْرٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم وَالْمَرْأَةُ مِنْ نِسَائِهِ يَغْتَسِلاَنِ مِنْ إِنَاءٍ وَاحِدٍ‏.‏ زَادَ مُسْلِمٌ وَوَهْبٌ عَنْ شُعْبَةَ مِنَ الْجَنَابَةِ‏.‏"
      },
      {
        "id": 265,
        "hadith_number": "265",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Mandi (Wudhuk dan Bersuci)",
        "perawi_melayu": "Dikisahkan oleh Maimuna:",
        "english_text": "I placed water for the bath of Allah's Messenger (ﷺ) and he poured water over his hands and washed them twice or thrice; then he poured water with his right hand over his left and washed his private parts (with his left hand). He rubbed his hand over the earth and rinsed his mouth and washed his nose by putting water in it and blowing it out. After that he washed his face, both fore arms and head thrice and then poured water over his body. He withdrew from that place and washed his feet.",
        "malay_translation": "Aku menyediakan air untuk mandi Rasulullah SAW, dan baginda menuang air ke atas kedua-dua tangannya dan mencucinya dua atau tiga kali; kemudian baginda menuang air dengan tangan kanan ke atas tangan kirinya dan membersihkan anggota sulitnya (dengan tangan kirinya). Baginda menggosok tangannya ke bumi dan membilas mulutnya serta mencuci hidungnya dengan memasukkan air ke dalam hidung dan meniupnya keluar. Selepas itu baginda mencuci muka, kedua-dua lengan dan kepala tiga kali, kemudian menuang air ke atas badannya. Baginda menarik diri dari tempat itu dan mencuci kedua-dua kakinya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مَحْبُوبٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ حَدَّثَنَا الأَعْمَشُ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَتْ مَيْمُونَةُ وَضَعْتُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم مَاءً يَغْتَسِلُ بِهِ، فَأَفْرَغَ عَلَى يَدَيْهِ، فَغَسَلَهُمَا مَرَّتَيْنِ مَرَّتَيْنِ أَوْ ثَلاَثًا، ثُمَّ أَفْرَغَ بِيَمِينِهِ عَلَى شِمَالِهِ، فَغَسَلَ مَذَاكِيرَهُ، ثُمَّ دَلَكَ يَدَهُ بِالأَرْضِ، ثُمَّ مَضْمَضَ وَاسْتَنْشَقَ، ثُمَّ غَسَلَ وَجْهَهُ وَيَدَيْهِ ثُمَّ غَسَلَ رَأْسَهُ ثَلاَثًا، ثُمَّ أَفْرَغَ عَلَى جَسَدِهِ، ثُمَّ تَنَحَّى مِنْ مَقَامِهِ فَغَسَلَ قَدَمَيْهِ‏.‏"
      },
      {
        "id": 266,
        "hadith_number": "266",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Mandi dan Wuduk",
        "perawi_melayu": "Maimuna binti Al-Harith",
        "english_text": "I placed water for the bath of Allah's Messenger (ﷺ) and put a screen. He poured water over his hands, and washed them once or twice. (The sub-narrator added that he did not remember if she had said thrice or not). Then he poured water with his right hand over his left one and washed his private parts. He rubbed his hand over the earth or the wall and washed it. He rinsed his mouth and washed his nose by putting water in it and blowing it out. He washed his face, forearms and head. He poured water over his body and then withdrew from that place and washed his feet. I presented him a piece of cloth (towel) and he pointed with his hand (that he does not want it) and did not take it.",
        "malay_translation": "Saya menyediakan air untuk mandi Rasulullah SAW dan meletakkan tabir. Baginda menuangkan air ke tangannya, dan membasuhnya sekali atau dua kali. (Perawi tambahan menyatakan dia tidak ingat sama ada dia menyebut tiga kali atau tidak). Kemudian Baginda menuangkan air dengan tangan kanannya ke tangan kirinya dan membasuh anggota sulitnya. Baginda menggosok tangannya ke tanah atau dinding dan membasuhnya. Baginda membilas mulutnya dan membasuh hidungnya dengan memasukkan air ke dalam hidung dan meniupnya keluar. Baginda membasuh wajah, lengan dan kepalanya. Baginda menuangkan air ke seluruh badannya dan kemudian meninggalkan tempat itu dan membasuh kakinya. Saya menawarkan sehelai kain kepadanya (tuala) dan Baginda menunjuk dengan tangannya (menunjukkan tidak mahu) dan tidak mengambilnya.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، حَدَّثَنَا الأَعْمَشُ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ بِنْتِ الْحَارِثِ، قَالَتْ وَضَعْتُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم غُسْلاً وَسَتَرْتُهُ، فَصَبَّ عَلَى يَدِهِ، فَغَسَلَهَا مَرَّةً أَوْ مَرَّتَيْنِ ـ قَالَ سُلَيْمَانُ لاَ أَدْرِي أَذَكَرَ الثَّالِثَةَ أَمْ لاَ ـ ثُمَّ أَفْرَغَ بِيَمِينِهِ عَلَى شِمَالِهِ، فَغَسَلَ فَرْجَهُ، ثُمَّ دَلَكَ يَدَهُ بِالأَرْضِ أَوْ بِالْحَائِطِ، ثُمَّ تَمَضْمَضَ وَاسْتَنْشَقَ، وَغَسَلَ وَجْهَهُ وَيَدَيْهِ، وَغَسَلَ رَأْسَهُ، ثُمَّ صَبَّ عَلَى جَسَدِهِ، ثُمَّ تَنَحَّى فَغَسَلَ قَدَمَيْهِ، فَنَاوَلْتُهُ خِرْقَةً، فَقَالَ بِيَدِهِ هَكَذَا، وَلَمْ يُرِدْهَا‏.‏"
      },
      {
        "id": 267,
        "hadith_number": "267",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keharuman Rasulullah SAW Selepas Penggunaan Wangi-Wangian",
        "perawi_melayu": "Muhammad bin Al-Muntathir meriwayatkan:",
        "english_text": "He mentioned it to Hadrat `Aisha رضی اللہ عنہا (about the Hadith of Ibn `Umar). She said, \"May Allah be Merciful to Abu `Abdur-Rahman. I used to put scent on Allah's Messenger (ﷺ) and he used to go round his wives, and in the morning he assumed the Ihram, and the fragrance of scent was still coming out from his body.\"",
        "malay_translation": "Beliau (Muhammad bin Al-Muntathir) menceritakannya kepada Hadrat `Aisha (tentang hadis Ibn `Umar). Beliau (Hadrat `Aisha) berkata, \"Semoga Allah merahmati Abu `Abdur-Rahman. Aku pernah menggunakan wangi-wangian pada Rasulullah SAW dan baginda sering mengunjungi para isteri baginda.  Pada pagi harinya, baginda memakai ihram, dan bau wangi-wangian masih tertinggal di tubuh baginda.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، وَيَحْيَى بْنُ سَعِيدٍ، عَنْ شُعْبَةَ، عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ، عَنْ أَبِيهِ، قَالَ ذَكَرْتُهُ لِعَائِشَةَ فَقَالَتْ يَرْحَمُ اللَّهُ أَبَا عَبْدِ الرَّحْمَنِ، كُنْتُ أُطَيِّبُ رَسُولَ اللَّهِ صلى الله عليه وسلم، فَيَطُوفُ عَلَى نِسَائِهِ، ثُمَّ يُصْبِحُ مُحْرِمًا يَنْضَخُ طِيبًا‏.‏"
      },
      {
        "id": 268,
        "hadith_number": "268",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keperihalan Nabi SAW Menziarahi Isteri-isterinya",
        "perawi_melayu": "Dikisahkan oleh Anas bin Malik:",
        "english_text": "\"The Prophet (ﷺ) used to visit all his wives in a round, during the day and night and they were eleven in number.\" I asked Anas, \"Had the Prophet (ﷺ) the strength for it?\" Anas replied, \"We used to say that the Prophet (ﷺ) was given the strength of thirty (men).\" And Sa`id said on the authority of Qatada that Anas had told him about nine wives only (not eleven).",
        "malay_translation": "\"Nabi SAW selalu melawat semua isterinya secara bergilir, siang dan malam, dan bilangannya adalah sebelas orang.\" Aku bertanya kepada Anas, \"Adakah Nabi SAW mempunyai kekuatan untuk itu?\" Jawab Anas, \"Kami selalu mengatakan bahawa Nabi SAW diberi kekuatan seperti tiga puluh orang lelaki.\" Dan Sa`id meriwayatkan dari Qatada, bahawa Anas telah memberitahunya mengenai sembilan isteri sahaja (bukan sebelas).\" ",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، قَالَ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَدُورُ عَلَى نِسَائِهِ فِي السَّاعَةِ الْوَاحِدَةِ مِنَ اللَّيْلِ وَالنَّهَارِ، وَهُنَّ إِحْدَى عَشْرَةَ‏.‏ قَالَ قُلْتُ لأَنَسٍ أَوَكَانَ يُطِيقُهُ قَالَ كُنَّا نَتَحَدَّثُ أَنَّهُ أُعْطِيَ قُوَّةَ ثَلاَثِينَ‏.‏\r\n\r\n وَقَالَ سَعِيدٌ عَنْ قَتَادَةَ إِنَّ أَنَسًا حَدَّثَهُمْ تِسْعُ نِسْوَةٍ‏.‏"
      },
      {
        "id": 269,
        "hadith_number": "269",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Mengatasi Pelepasan Air Mani yang Berlebihan",
        "perawi_melayu": "Dikisahkan oleh `Ali",
        "english_text": "I used to get emotional urethral discharge frequently. Being the son-in-law of the Prophet (ﷺ) I requested a man to ask him about it. So the man asked the Prophet (ﷺ) about it. The Prophet (ﷺ) replied, \"Perform ablution after washing your organ (penis).\"",
        "malay_translation": "Saya sering mengalami pelepasan air mani yang berlebihan.  Sebagai menantunya Nabi (ﷺ), saya meminta seorang lelaki untuk bertanya kepadanya tentang hal itu. Lalu lelaki itu bertanya kepada Nabi (ﷺ) tentangnya. Nabi (ﷺ) menjawab, \"Lakukan wuduk setelah membersihkan zakar anda.\"",
        "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا زَائِدَةُ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عَلِيٍّ، قَالَ كُنْتُ رَجُلاً مَذَّاءً فَأَمَرْتُ رَجُلاً أَنْ يَسْأَلَ النَّبِيَّ صلى الله عليه وسلم لِمَكَانِ ابْنَتِهِ فَسَأَلَ فَقَالَ ‏ \"‏ تَوَضَّأْ وَاغْسِلْ ذَكَرَكَ ‏\"‏‏.‏"
      },
      {
        "id": 270,
        "hadith_number": "270",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perbuatan Rasulullah SAW Mengenai Keharaman  Mencium Wangian Sebelum Ihram",
        "perawi_melayu": "Muhammad bin Al-Muntathir, meriwayatkan daripada bapanya yang bertanya kepada `Aisha tentang perkataan Ibn `Umar.",
        "english_text": "(i.e. he did not like to be a Muhrim while the smell of scent was still coming from his body). `Aisha said, \"I scented Allah's Messenger (ﷺ) and he went round (had sexual intercourse with) all his wives, and in the morning he was Muhrim (after taking a bath).\"",
        "malay_translation": "(iaitu baginda tidak suka menjadi Muhrim sementara bau wangi masih melekat di tubuhnya). `Aisha berkata, \"Aku pernah mencium Rasulullah SAW dan baginda melakukan hubungan dengan semua isteri baginda, dan pada pagi harinya baginda berihram (selepas mandi).\"",
        "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ، عَنْ أَبِيهِ، قَالَ سَأَلْتُ عَائِشَةَ فَذَكَرْتُ لَهَا قَوْلَ ابْنِ عُمَرَ مَا أُحِبُّ أَنْ أُصْبِحَ، مُحْرِمًا أَنْضَخُ طِيبًا‏.‏ فَقَالَتْ عَائِشَةُ أَنَا طَيَّبْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم ثُمَّ طَافَ فِي نِسَائِهِ ثُمَّ أَصْبَحَ مُحْرِمًا‏.‏"
      },
      {
        "id": 271,
        "hadith_number": "271",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Melihat Kemewahan Rambut Nabi SAW Ketika Berihram",
        "perawi_melayu": "Dikisahkan oleh 'Aishah:",
        "english_text": "It is as if I am just looking at the glitter of scent in the parting of the Prophet's head hair while he was a Muhrim.",
        "malay_translation": "Seakan-akan aku hanya melihat kilauan wewangian pada bahagian rambut Nabi SAW yang terbelah ketika baginda sedang dalam keadaan ihram.",
        "arabic_text": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا الْحَكَمُ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ كَأَنِّي أَنْظُرُ إِلَى وَبِيصِ الطِّيبِ فِي مَفْرِقِ النَّبِيِّ صلى الله عليه وسلم وَهْوَ مُحْرِمٌ‏.‏"
      },
      {
        "id": 272,
        "hadith_number": "272, 273",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Tatacara Mandi Junub Rasulullah SAW",
        "perawi_melayu": "Dikisahkan oleh `Aisha رضي الله عنها",
        "english_text": "\"Whenever Allah's Messenger (ﷺ) took the bath of Janaba, he cleaned his hands and performed ablution like that for prayer and then took a bath and rubbed his hair, till he felt that the whole skin of the head had become wet, then he would pour water thrice and wash the rest of the body.\" `Aisha further said, \"I and Allah's Messenger (ﷺ) used to take a bath from a single water container, from which we took water simultaneously.\"",
        "malay_translation": "\"Apabila Rasulullah SAW mandi junub, baginda membersihkan tangan dan melakukan wuduk seperti untuk solat, kemudian mandi dan menggosok rambutnya sehingga terasa seluruh kulit kepala basah, kemudian menuang air sebanyak tiga kali dan membasuh seluruh badan yang lain.\" `Aisha selanjutnya berkata, \"Saya dan Rasulullah SAW pernah mandi menggunakan bekas air yang sama, dan kami mengambil air secara serentak.\"",
        "arabic_text": "حَدَّثَنَا عَبْدَانُ ، قَالَ : أَخْبَرَنَا عَبْدُ اللَّهِ ، قَالَ : أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ ، عَنْ أَبِيهِ ، عَنْ عَائِشَةَ ، قَالَتْ : كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اغْتَسَلَ مِنَ الْجَنَابَةِ غَسَلَ يَدَيْهِ وَتَوَضَّأَ وُضُوءَهُ لِلصَّلَاةِ ، ثُمَّ اغْتَسَلَ ، ثُمَّ يُخَلِّلُ بِيَدِهِ شَعَرَهُ حَتَّى إِذَا ظَنَّ أَنَّهُ قَدْ أَرْوَى بَشَرَتَهُ أَفَاضَ عَلَيْهِ الْمَاءَ ثَلَاثَ مَرَّاتٍ ، ثُمَّ غَسَلَ سَائِرَ جَسَدِهِ.وَقَالَتْ كُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ، صلى الله عليه وسلم مِنْ إِنَاءٍ وَاحِدٍ نَغْرِفُ مِنْهُ جَمِيعًا‏.‏"
      },
      {
        "id": 273,
        "hadith_number": "274",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Mengamalkan Wudhuk Selepas Junub",
        "perawi_melayu": "Dikisahkan oleh Maimuna",
        "english_text": "Air diletakkan untuk wuduk Rasulullah SAW selepas janabah. Baginda menuang air dengan tangan kanan ke tangan kiri dua atau tiga kali, kemudian membasuh kemaluan dan menggosok tangan di atas tanah atau dinding dua atau tiga kali. Kemudian, Baginda membilas mulut, mencuci hidung dengan memasukkan air dan meniupnya keluar, mencuci muka, kedua lengan dan menuang air ke atas kepala, dan membasuh seluruh badan. Kemudian Baginda berpindah ke tempat lain dan membasuh kakinya. Saya membawakan sehelai kain, tetapi baginda tidak menerimanya dan menghilangkan sisa air dari badannya dengan tangannya sendiri.",
        "malay_translation": "Air diletakkan untuk wuduk Rasulullah SAW selepas janabah. Baginda menuang air dengan tangan kanan ke tangan kiri dua atau tiga kali, kemudian membasuh kemaluan dan menggosok tangan di atas tanah atau dinding dua atau tiga kali. Kemudian, Baginda membilas mulut, mencuci hidung dengan memasukkan air dan meniupnya keluar, mencuci muka, kedua lengan dan menuang air ke atas kepala, dan membasuh seluruh badan. Kemudian Baginda berpindah ke tempat lain dan membasuh kakinya. Saya membawakan sehelai kain, tetapi baginda tidak menerimanya dan menghilangkan sisa air dari badannya dengan tangannya sendiri.",
        "arabic_text": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى، قَالَ أَخْبَرَنَا الْفَضْلُ بْنُ مُوسَى، قَالَ أَخْبَرَنَا الأَعْمَشُ، عَنْ سَالِمٍ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، قَالَتْ وَضَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَضُوءًا لِجَنَابَةٍ فَأَكْفَأَ بِيَمِينِهِ عَلَى شِمَالِهِ مَرَّتَيْنِ، أَوْ ثَلاَثًا، ثُمَّ غَسَلَ فَرْجَهُ، ثُمَّ ضَرَبَ يَدَهُ بِالأَرْضِ ـ أَوِ الْحَائِطِ ـ مَرَّتَيْنِ أَوْ ثَلاَثًا، ثُمَّ مَضْمَضَ وَاسْتَنْشَقَ، وَغَسَلَ وَجْهَهُ وَذِرَاعَيْهِ، ثُمَّ أَفَاضَ عَلَى رَأْسِهِ الْمَاءَ، ثُمَّ غَسَلَ جَسَدَهُ، ثُمَّ تَنَحَّى فَغَسَلَ رِجْلَيْهِ‏.‏ قَالَتْ فَأَتَيْتُهُ بِخِرْقَةٍ، فَلَمْ يُرِدْهَا، فَجَعَلَ يَنْفُضُ بِيَدِهِ‏.‏"
      },
      {
        "id": 274,
        "hadith_number": "275",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Ingat Diri Junub Semasa Solat",
        "perawi_melayu": "Riwayat Abu Hurairah",
        "english_text": "Once the call (Iqama) for the prayer was announced and the rows were straightened. Allah's Messenger (ﷺ) came out; and when he stood up at his Musalla, he remembered that he was Junub. Then he ordered us to stay at our places and went to take a bath and then returned with water dropping from his head. He said, \"Allahu-Akbar\", and we all offered the prayer with him.",
        "malay_translation": "Apabila azan dikumandangkan dan saf-saf solat telah tersusun rapi, Rasulullah SAW keluar.  Apabila Baginda berdiri di mihrab solat Baginda, teringatlah Baginda bahawa Baginda dalam keadaan junub.  Lalu Baginda memerintahkan kita agar tetap di tempat masing-masing dan terus pergi mandi hadas. Selepas itu, Baginda kembali dengan air menitis dari kepalanya. Baginda melafazkan, \"Allahuakbar\", dan kami semua menunaikan solat bersama Baginda.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، قَالَ أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أُقِيمَتِ الصَّلاَةُ، وَعُدِّلَتِ الصُّفُوفُ قِيَامًا، فَخَرَجَ إِلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمَّا قَامَ فِي مُصَلاَّهُ ذَكَرَ أَنَّهُ جُنُبٌ فَقَالَ لَنَا ‏:‏ ‏ \"‏ مَكَانَكُمْ ‏\"‏‏.‏ ثُمَّ رَجَعَ فَاغْتَسَلَ، ثُمَّ خَرَجَ إِلَيْنَا وَرَأْسُهُ يَقْطُرُ، فَكَبَّرَ فَصَلَّيْنَا مَعَهُ‏.‏ تَابَعَهُ عَبْدُ الأَعْلَى عَنْ مَعْمَرٍ عَنِ الزُّهْرِيِّ‏.‏ وَرَوَاهُ الأَوْزَاعِيُّ عَنِ الزُّهْرِيِّ‏.‏"
      },
      {
        "id": 275,
        "hadith_number": "276",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Mandi dan Membasuh Anggota Tubuh",
        "perawi_melayu": "Dikisahkan oleh Maimuna",
        "english_text": "I placed water for the bath of the Prophet (ﷺ) and screened him with a garment. He poured water over his hands and washed them. After that he poured water with his right hand over his left and washed his private parts, rubbed his hands with earth and washed them, rinsed his mouth, washed his nose by putting water in it and then blowing it out and then washed his face and forearms. He poured water over his head and body. He then shifted from that place and washed his feet. I gave him a piece of cloth but he did not take it and came out removing the water (from his body) with both his hands.",
        "malay_translation": "Aku menyediakan air untuk mandi Nabi SAW dan menutupinya dengan kain. Baginda menuang air ke atas tangan dan membasuh kedua-duanya. Kemudian baginda menuang air dengan tangan kanan ke tangan kiri dan membasuh anggota sulit, menggosok tangan dengan tanah dan membasuhnya, membilas mulut, membasuh hidung dengan memasukkan air ke dalam hidung dan meniupnya keluar, kemudian membasuh wajah dan lengan. Baginda menuang air ke atas kepala dan badan. Kemudian baginda berpindah dari tempat itu dan membasuh kaki. Aku memberikan sehelai kain kepadanya, tetapi baginda tidak menerimanya dan keluar sambil mengeringkan air dari tubuhnya dengan kedua-dua tangan.",
        "arabic_text": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا أَبُو حَمْزَةَ، قَالَ سَمِعْتُ الأَعْمَشَ، عَنْ سَالِمٍ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَتْ مَيْمُونَةُ وَضَعْتُ لِلنَّبِيِّ صلى الله عليه وسلم غُسْلاً، فَسَتَرْتُهُ بِثَوْبٍ، وَصَبَّ عَلَى يَدَيْهِ فَغَسَلَهُمَا، ثُمَّ صَبَّ بِيَمِينِهِ عَلَى شِمَالِهِ، فَغَسَلَ فَرْجَهُ، فَضَرَبَ بِيَدِهِ الأَرْضَ فَمَسَحَهَا، ثُمَّ غَسَلَهَا فَمَضْمَضَ، وَاسْتَنْشَقَ، وَغَسَلَ وَجْهَهُ وَذِرَاعَيْهِ، ثُمَّ صَبَّ عَلَى رَأْسِهِ، وَأَفَاضَ عَلَى جَسَدِهِ، ثُمَّ تَنَحَّى فَغَسَلَ قَدَمَيْهِ، فَنَاوَلْتُهُ ثَوْبًا فَلَمْ يَأْخُذْهُ، فَانْطَلَقَ وَهْوَ يَنْفُضُ يَدَيْهِ‏.‏"
      },
      {
        "id": 276,
        "hadith_number": "277",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Membasuh Kepala Ketika Junub",
        "perawi_melayu": "Disebutkan oleh Aishah",
        "english_text": "Whenever any one of us was Junub, she poured water over her head thrice with both her hands and then rubbed the right side of her head with one hand and rubbed the left side of the head with the other hand.",
        "malay_translation": "Apabila sesiapa di antara kita dalam keadaan junub, dia menuang air ke atas kepalanya sebanyak tiga kali dengan kedua-dua tangannya, kemudian menggosok bahagian kanan kepalanya dengan satu tangan dan menggosok bahagian kiri kepalanya dengan tangan yang lain.",
        "arabic_text": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ نَافِعٍ، عَنِ الْحَسَنِ بْنِ مُسْلِمٍ، عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ، عَنْ عَائِشَةَ، قَالَتْ كُنَّا إِذَا أَصَابَتْ إِحْدَانَا جَنَابَةٌ، أَخَذَتْ بِيَدَيْهَا ثَلاَثًا فَوْقَ رَأْسِهَا، ثُمَّ تَأْخُذُ بِيَدِهَا عَلَى شِقِّهَا الأَيْمَنِ، وَبِيَدِهَا الأُخْرَى عَلَى شِقِّهَا الأَيْسَرِ‏.‏"
      },
      {
        "id": 277,
        "hadith_number": "278",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Nabi Musa dan Batu: Ibadat dan Keikhlasan",
        "perawi_melayu": "Dikisahkan oleh Abu Hurairah:",
        "english_text": "The Prophet (ﷺ) said, 'The (people of) Bani Israel used to take bath naked (all together) looking at each other. The Prophet (ﷺ) Moses used to take a bath alone. They said, 'By Allah! Nothing prevents Moses from taking a bath with us except that he has a scrotal hernia.' So once Moses went out to take a bath and put his clothes over a stone and then that stone ran away with his clothes. Moses followed that stone saying, \"My clothes, O stone! My clothes, O stone! till the people of Bani Israel saw him and said, 'By Allah, Moses has got no defect in his body. Moses took his clothes and began to beat the stone.\" Abu Huraira added, \"By Allah! There are still six or seven marks present on the stone from that excessive beating.\"",
        "malay_translation": "Rasulullah SAW bersabda, 'Kaum Bani Israel dahulu mandi secara telanjang bersama-sama, sambil saling memandang. Nabi Musa a.s. pula mandi secara bersendirian. Mereka berkata, 'Demi Allah! Tidak ada yang menghalang Musa mandi bersama kami selain ada penyakit (kecacatan) pada zakarnya.' Maka suatu ketika, Musa keluar untuk mandi dan meletakkan pakaiannya di atas sebuah batu. Kemudian, batu itu melarikan diri dengan pakaiannya. Musa mengejar batu itu sambil berkata, \"Pakaianku wahai batu! Pakaianku wahai batu!\" sehingga kaum Bani Israel melihatnya dan berkata, 'Demi Allah, Musa tidak mempunyai sebarang kecacatan pada tubuhnya.' Musa mengambil pakaiannya dan mula memukul batu itu.' Abu Hurairah menambah, 'Demi Allah! Masih ada enam atau tujuh kesan lebam pada batu itu daripada pukulan yang hebat itu.'",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ كَانَتْ بَنُو إِسْرَائِيلَ يَغْتَسِلُونَ عُرَاةً، يَنْظُرُ بَعْضُهُمْ إِلَى بَعْضٍ، وَكَانَ مُوسَى يَغْتَسِلُ وَحْدَهُ، فَقَالُوا وَاللَّهِ مَا يَمْنَعُ مُوسَى أَنْ يَغْتَسِلَ مَعَنَا إِلاَّ أَنَّهُ آدَرُ، فَذَهَبَ مَرَّةً يَغْتَسِلُ، فَوَضَعَ ثَوْبَهُ عَلَى حَجَرٍ، فَفَرَّ الْحَجَرُ بِثَوْبِهِ، فَخَرَجَ مُوسَى فِي إِثْرِهِ يَقُولُ ثَوْبِي يَا حَجَرُ‏.‏ حَتَّى نَظَرَتْ بَنُو إِسْرَائِيلَ إِلَى مُوسَى، فَقَالُوا وَاللَّهِ مَا بِمُوسَى مِنْ بَأْسٍ‏.‏ وَأَخَذَ ثَوْبَهُ، فَطَفِقَ بِالْحَجَرِ ضَرْبًا ‏\"‏‏.‏ فَقَالَ أَبُو هُرَيْرَةَ وَاللَّهِ إِنَّهُ لَنَدَبٌ بِالْحَجَرِ سِتَّةٌ أَوْ سَبْعَةٌ ضَرْبًا بِالْحَجَرِ‏.‏"
      },
      {
        "id": 278,
        "hadith_number": "279",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Nabi Ayub a.s. dan Belalang Emas",
        "perawi_melayu": "Dikisahkan oleh Abu Hurairah:",
        "english_text": "The Prophet (ﷺ) said, \"When the Prophet (ﷺ) Job (Aiyub) was taking a bath naked, golden locusts began to fall on him. Job started collecting them in his clothes. His Lord addressed him, 'O Job! Haven't I given you enough so that you are not in need of them.' Job replied, 'Yes!' By Your Honor (power)! But I cannot dispense with Your Blessings.' \"",
        "malay_translation": "Rasulullah saw bersabda, \"Ketika Nabi Ayub a.s. sedang mandi tanpa pakaian, belalang emas mula jatuh ke atasnya. Ayub mula mengumpulnya di dalam pakaiannya. Tuhannya memanggilnya, 'Wahai Ayub! Bukankah Aku telah memberikanmu cukup untuk engkau tidak memerlukannya?' Ayub menjawab, 'Ya!' Demi keagunganMu! Tetapi aku tidak dapat melepaskan berkat-berkatMu.'\"",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَا أَيُّوبُ يَغْتَسِلُ عُرْيَانًا فَخَرَّ عَلَيْهِ جَرَادٌ مِنْ ذَهَبٍ، فَجَعَلَ أَيُّوبُ يَحْتَثِي فِي ثَوْبِهِ، فَنَادَاهُ رَبُّهُ يَا أَيُّوبُ، أَلَمْ أَكُنْ أَغْنَيْتُكَ عَمَّا تَرَى قَالَ بَلَى وَعِزَّتِكَ وَلَكِنْ لاَ غِنَى بِي عَنْ بَرَكَتِكَ ‏\"‏‏.‏ وَرَوَاهُ إِبْرَاهِيمُ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ صَفْوَانَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَا أَيُّوبُ يَغْتَسِلُ عُرْيَانًا ‏\"‏‏.‏"
      },
      {
        "id": 279,
        "hadith_number": "280",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pengalaman Um Hani Ketika Rasulullah SAW Mandi",
        "perawi_melayu": "Um Hani binti Abi Talib meriwayatkan:",
        "english_text": "I went to Allah's Messenger (ﷺ) in the year of the conquest of Mecca and found him taking a bath while Fatima was screening him. The Prophet (ﷺ) asked, \"Who is it?\" I replied, \"I am Um-Hani.\"",
        "malay_translation": "Saya pergi menemui Rasulullah SAW pada tahun penaklukan Mekah dan mendapati baginda sedang mandi di waktu Fatimah menutupkan baginda.  Rasulullah SAW bertanya, \"Siapakah ini?\"  Saya menjawab, \"Saya Um Hani.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ أَنَّ أَبَا مُرَّةَ، مَوْلَى أُمِّ هَانِئٍ بِنْتِ أَبِي طَالِبٍ أَخْبَرَهُ أَنَّهُ، سَمِعَ أُمَّ هَانِئٍ بِنْتَ أَبِي طَالِبٍ، تَقُولُ ذَهَبْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ الْفَتْحِ، فَوَجَدْتُهُ يَغْتَسِلُ وَفَاطِمَةُ تَسْتُرُهُ فَقَالَ ‏ \"‏ مَنْ هَذِهِ ‏\"‏‏.‏ فَقُلْتُ أَنَا أُمُّ هَانِئٍ‏.‏"
      },
      {
        "id": 280,
        "hadith_number": "281",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Mandi Janabat dan Wuduk",
        "perawi_melayu": "Dikisahkan oleh Maimuna:",
        "english_text": "I screened the Prophet (ﷺ) while he was taking a bath of Janaba. He washed his hands, poured water from his right hand over his left and washed his private parts. Then he rubbed his hand over a wall or the earth, and performed ablution similar to that for the prayer but did not wash his feet. Then he poured water over his body, shifted from that place, and washed his feet.",
        "malay_translation": "Aku menyaksikan Rasulullah SAW ketika baginda mandi janabat. Baginda mencuci tangannya, kemudian menuang air dari tangan kanan ke tangan kiri dan mencuci anggota sulitnya. Kemudian, baginda menggosok tangannya ke dinding atau tanah, dan melakukan wuduk seperti wuduk solat tetapi tidak mencuci kakinya. Kemudian, baginda membasuh seluruh badannya, berpindah dari tempat tersebut, dan mencuci kakinya.",
        "arabic_text": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، قَالَتْ سَتَرْتُ النَّبِيَّ صلى الله عليه وسلم وَهُوَ يَغْتَسِلُ مِنَ الْجَنَابَةِ، فَغَسَلَ يَدَيْهِ ثُمَّ صَبَّ بِيَمِينِهِ عَلَى شِمَالِهِ، فَغَسَلَ فَرْجَهُ، وَمَا أَصَابَهُ، ثُمَّ مَسَحَ بِيَدِهِ عَلَى الْحَائِطِ أَوِ الأَرْضِ، ثُمَّ تَوَضَّأَ وُضُوءَهُ لِلصَّلاَةِ، غَيْرَ رِجْلَيْهِ، ثُمَّ أَفَاضَ عَلَى جَسَدِهِ الْمَاءَ، ثُمَّ تَنَحَّى فَغَسَلَ قَدَمَيْهِ‏.‏ تَابَعَهُ أَبُو عَوَانَةَ وَابْنُ فُضَيْلٍ فِي السَّتْرِ‏.‏"
      },
      {
        "id": 281,
        "hadith_number": "282",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keperluan Mandi Junub Wanita Selepas Mimpi Basah",
        "perawi_melayu": "Dikisahkan oleh Um Salamah (ibu para mukmin):",
        "english_text": "Um Sulaim, isteri Abu Talha, datang kepada Rasulullah SAW dan bertanya, \"Wahai Rasulullah SAW! Sesungguhnya Allah tidak malu untuk memberitahukan kebenaran. Adakah wajib bagi seorang wanita untuk mandi junub jika mengalami mimpi basah?\" Rasulullah SAW menjawab, \"Ya, jika dia melihat adanya keluar air mani.\"",
        "malay_translation": "Um Sulaim, isteri Abu Talha, datang kepada Rasulullah SAW dan bertanya, \"Wahai Rasulullah SAW! Sesungguhnya Allah tidak malu untuk memberitahukan kebenaran. Adakah wajib bagi seorang wanita untuk mandi junub jika mengalami mimpi basah?\" Rasulullah SAW menjawab, \"Ya, jika dia melihat adanya keluar air mani.\" ",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّهَا قَالَتْ جَاءَتْ أُمُّ سُلَيْمٍ امْرَأَةُ أَبِي طَلْحَةَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ، إِنَّ اللَّهَ لاَ يَسْتَحْيِي مِنَ الْحَقِّ، هَلْ عَلَى الْمَرْأَةِ مِنْ غُسْلٍ إِذَا هِيَ احْتَلَمَتْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ نَعَمْ إِذَا رَأَتِ الْمَاءَ ‏\"‏‏.‏"
      },
      {
        "id": 282,
        "hadith_number": "283",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kebersihan Orang Mukmin dan Menjauhi Perbuatan yang Menjijikkan",
        "perawi_melayu": "Dikisahkan oleh Abu Hurairah:",
        "english_text": "The Prophet (ﷺ) came across me in one of the streets of Medina and at that time I was Junub. So I slipped away from him and went to take a bath. On my return the Prophet (ﷺ) said, \"O Abu Huraira! Where have you been?\" I replied, \"I was Junub, so I disliked to sit in your company.\" The Prophet (ﷺ) said, \"Subhan Allah! A believer never becomes impure.",
        "malay_translation": "Nabi SAW bertemu dengan saya di salah sebuah jalan di Madinah ketika itu saya dalam keadaan junub. Oleh itu, saya menyingkir daripadanya dan pergi mandi. Setelah kembali, Nabi SAW bertanya, \"Wahai Abu Hurairah! Di mana engkau tadi?\" Jawabku, \"Saya dalam keadaan junub, maka aku tidak suka duduk bersamamu.\" Nabi SAW berkata, \"Subhanallah! Seorang mukmin tidak pernah menjadi najis.\"",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا حُمَيْدٌ، قَالَ حَدَّثَنَا بَكْرٌ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم لَقِيَهُ فِي بَعْضِ طَرِيقِ الْمَدِينَةِ وَهْوَ جُنُبٌ، فَانْخَنَسْتُ مِنْهُ، فَذَهَبَ فَاغْتَسَلَ، ثُمَّ جَاءَ فَقَالَ ‏\"‏ أَيْنَ كُنْتَ يَا أَبَا هُرَيْرَةَ ‏\"‏‏.‏ قَالَ كُنْتُ جُنُبًا، فَكَرِهْتُ أَنْ أُجَالِسَكَ وَأَنَا عَلَى غَيْرِ طَهَارَةٍ‏.‏ فَقَالَ ‏\"‏ سُبْحَانَ اللَّهِ، إِنَّ الْمُؤْمِنَ لاَ يَنْجُسُ ‏\"‏‏.‏"
      },
      {
        "id": 283,
        "hadith_number": "284",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Menziarahi Semua Isteri Dalam Satu Malam",
        "perawi_melayu": "Dikisahkan oleh Anas bin Malik:",
        "english_text": "The Prophet (ﷺ) used to visit all his wives in one night and he had nine wives at that time.",
        "malay_translation": "Nabi SAW pernah melawat semua isterinya dalam satu malam, dan pada masa itu baginda mempunyai sembilan orang isteri.",
        "arabic_text": "حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، أَنَّ أَنَسَ بْنَ مَالِكٍ، حَدَّثَهُمْ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم كَانَ يَطُوفُ عَلَى نِسَائِهِ فِي اللَّيْلَةِ الْوَاحِدَةِ، وَلَهُ يَوْمَئِذٍ تِسْعُ نِسْوَةٍ‏.‏"
      },
      {
        "id": 284,
        "hadith_number": "285",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kebersihan Seorang Mukmin dan Wajib Mandi Junub",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah",
        "english_text": "Allah's Messenger (ﷺ) came across me and I was Junub. He took my hand and I went along with him till he sat down I slipped away, went home and took a bath. When I came back, he was still sitting there. He then said to me, \"O Abu Huraira! Where have you been?' I told him about it. The Prophet (ﷺ) said, \"Subhan Allah! O Abu Huraira! A believer never becomes impure.",
        "malay_translation": "Rasulullah SAW bertemu dengan saya ketika saya dalam keadaan junub. Baginda memegang tangan saya dan saya mengikutnya hingga Baginda duduk. Saya kemudian mencuri pandang, pulang ke rumah dan mandi. Apabila saya kembali, Baginda masih duduk di situ. Baginda berkata, \"Wahai Abu Hurairah! Ke mana engkau pergi?\" Saya menceritakannya kepada Baginda. Baginda bersabda, \"Subhanallah! Wahai Abu Hurairah! Seorang mukmin tidak pernah menjadi najis.\" ",
        "arabic_text": "حَدَّثَنَا عَيَّاشٌ، قَالَ حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا حُمَيْدٌ، عَنْ بَكْرٍ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ لَقِيَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنَا جُنُبٌ، فَأَخَذَ بِيَدِي، فَمَشَيْتُ مَعَهُ حَتَّى قَعَدَ فَانْسَلَلْتُ، فَأَتَيْتُ الرَّحْلَ، فَاغْتَسَلْتُ ثُمَّ جِئْتُ وَهْوَ قَاعِدٌ فَقَالَ ‏\"‏ أَيْنَ كُنْتَ يَا أَبَا هِرٍّ ‏\"‏ فَقُلْتُ لَهُ‏.‏ فَقَالَ ‏\"‏ سُبْحَانَ اللَّهِ يَا أَبَا هِرٍّ إِنَّ الْمُؤْمِنَ لاَ يَنْجُسُ ‏\"‏‏.‏"
      },
      {
        "id": 285,
        "hadith_number": "286",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Bersenang-senang Ketika Junub",
        "perawi_melayu": "Dikisahkan oleh Abu Salama:",
        "english_text": "I asked `Aisha \"Did the Prophet (ﷺ) use to sleep while he was Junub?\" She replied, \"Yes, but he used to perform ablution (before going to bed).",
        "malay_translation": "Saya bertanya kepada `Aisha, \"Adakah Rasulullah SAW pernah tidur dalam keadaan Junub?\" Jawabnya, \"Ya, tetapi baginda selalu berwudhuk (sebelum tidur).",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا هِشَامٌ، وَشَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، قَالَ سَأَلْتُ عَائِشَةَ أَكَانَ النَّبِيُّ صلى الله عليه وسلم يَرْقُدُ وَهْوَ جُنُبٌ قَالَتْ نَعَمْ وَيَتَوَضَّأُ‏.‏"
      },
      {
        "id": 286,
        "hadith_number": "287",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Bolehkah Seseorang Tidur dalam Keadaan Junub?",
        "perawi_melayu": "Dikisahkan oleh `Umar bin Al-Khattab",
        "english_text": "I asked Allah's Messenger (ﷺ) \"Can any one of us sleep while he is Junub?\" He replied, \"Yes, if he performs ablution, he can sleep while he is Junub.\"",
        "malay_translation": "Saya bertanya kepada Rasulullah SAW, \"Adakah di antara kita yang boleh tidur dalam keadaan junub?\" Baginda menjawab, \"Ya, jika dia berwuduk, dia boleh tidur dalam keadaan junub.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَيَرْقُدُ أَحَدُنَا وَهْوَ جُنُبٌ قَالَ ‏ \"‏ نَعَمْ إِذَا تَوَضَّأَ أَحَدُكُمْ فَلْيَرْقُدْ وَهُوَ جُنُبٌ ‏\"‏‏.‏"
      },
      {
        "id": 287,
        "hadith_number": "288",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Membersihkan Diri Sebelum Tidur Dalam Keadaan Junub",
        "perawi_melayu": "Dikisahkan oleh `Aisha",
        "english_text": "Whenever the Prophet (ﷺ) intended to sleep while he was Junub, he used to wash his private parts and perform ablution like that for the prayer.",
        "malay_translation": "Apabila Nabi SAW hendak tidur dalam keadaan junub, Baginda akan membasuh anggota sulit dan melakukan wuduk seperti ketika hendak solat.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا أَرَادَ أَنْ يَنَامَ وَهْوَ جُنُبٌ، غَسَلَ فَرْجَهُ، وَتَوَضَّأَ لِلصَّلاَةِ‏.‏"
      },
      {
        "id": 288,
        "hadith_number": "289",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Bolehkah Seseorang Tidur dalam Keadaan Junub?",
        "perawi_melayu": "Dikisahkan oleh `Abdullah",
        "english_text": "`Umar asked the Prophet (ﷺ) \"Can anyone of us sleep while he is Junub?\" He replied, \"Yes, if he performs ablution.\"",
        "malay_translation": "`Umar bertanya kepada Nabi (ﷺ), \"Adakah seseorang di antara kita boleh tidur dalam keadaan Junub?\" Baginda menjawab, \"Ya, jika dia melakukan wuduk.\"",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، قَالَ اسْتَفْتَى عُمَرُ النَّبِيَّ صلى الله عليه وسلم أَيَنَامُ أَحَدُنَا وَهْوَ جُنُبٌ قَالَ ‏ \"‏ نَعَمْ، إِذَا تَوَضَّأَ ‏\"‏‏.‏"
      },
      {
        "id": 289,
        "hadith_number": "290",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Petunjuk Mengenai Wuduk Setelah Junub",
        "perawi_melayu": "Dikisahkan oleh Abdullah bin Umar:",
        "english_text": "`Umar bin Al-Khattab told Allah's Messenger (ﷺ), \"I became Junub at night.\" Allah's Messenger (ﷺ) replied, \"Perform ablution after washing your private parts and then sleep.\"",
        "malay_translation": "'Umar bin Al-Khattab menceritakan kepada Rasulullah SAW, \"Saya menjadi junub pada malam hari.\" Rasulullah SAW menjawab, \"Lakukan wuduk setelah membersihkan anggota sulit anda dan kemudian tidur.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ ذَكَرَ عُمَرُ بْنُ الْخَطَّابِ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ تُصِيبُهُ الْجَنَابَةُ مِنَ اللَّيْلِ، فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ تَوَضَّأْ وَاغْسِلْ ذَكَرَكَ ثُمَّ نَمْ ‏\"‏‏.‏"
      },
      {
        "id": 290,
        "hadith_number": "291",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keharusan Mandi Junub Jika Berhubungan Seksual di Antar Empat Bahagian Wanita",
        "perawi_melayu": "Dikisahkan oleh Abu Hurairah:",
        "english_text": "The Prophet (ﷺ) said, \"When a man sits in between the four parts of a woman and did the sexual intercourse with her, bath becomes compulsory.\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Apabila seorang lelaki duduk di antara empat bahagian wanita dan melakukan hubungan seksual dengannya, maka mandi wajib menjadi sunat.",
        "arabic_text": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، قَالَ حَدَّثَنَا هِشَامٌ، ح وَحَدَّثَنَا أَبُو نُعَيْمٍ، عَنْ هِشَامٍ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا جَلَسَ بَيْنَ شُعَبِهَا الأَرْبَعِ ثُمَّ جَهَدَهَا، فَقَدْ وَجَبَ الْغَسْلُ ‏\"‏‏.‏ تَابَعَهُ عَمْرُو بْنُ مَرْزُوقٍ عَنْ شُعْبَةَ مِثْلَهُ‏.‏ وَقَالَ مُوسَى حَدَّثَنَا أَبَانُ قَالَ حَدَّثَنَا قَتَادَةُ أَخْبَرَنَا الْحَسَنُ مِثْلَهُ‏.‏"
      },
      {
        "id": 291,
        "hadith_number": "292",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Tindakan Lelaki yang Tidak Mencapai Puncak dalam Hubungan Seksual dengan Isterinya",
        "perawi_melayu": "Dikisahkan oleh Zaid bin Khalid Al-Juhani:",
        "english_text": "I asked `Uthman bin `Affan about a man who engaged in the sexual intercourse with his wife but did not discharge. `Uthman replied, \"He should perform ablution like that for the prayer after washing his private parts.\" `Uthman added, \"I heard that from Allah's Messenger (ﷺ).\" I asked `Ali bin Abi Talib, Az- Zubair bin Al-`Awwam, Talha bin 'Ubaidullah and Ubai bin Ka`b and they gave the same reply.\r\n (Abu Aiyub said that he had heard that from Allah's Messenger (ﷺ) ) (This order was canceled later on so one \r\n  has to take a bath. See, Hadith No. 180).",
        "malay_translation": "Saya bertanya kepada `Uthman bin `Affan tentang seorang lelaki yang melakukan hubungan seksual dengan isterinya tetapi tidak mencapai puncak. `Uthman menjawab, \"Dia perlu melakukan wuduk seperti untuk solat setelah membersihkan anggota sulitnya.\" `Uthman menambahkan, \"Saya mendengarnya daripada Rasulullah SAW.\" Saya bertanya kepada `Ali bin Abi Talib, Az-Zubair bin Al-`Awwam, Talha bin 'Ubaidullah dan Ubai bin Ka`b dan mereka memberikan jawapan yang sama.\r\n(Abu Aiyub berkata bahawa beliau telah mendengarnya daripada Rasulullah SAW.) (Perintah ini dibatalkan kemudian, maka seseorang perlu mandi. Lihat, Hadis No. 180).",
        "arabic_text": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنِ الْحُسَيْنِ، قَالَ يَحْيَى وَأَخْبَرَنِي أَبُو سَلَمَةَ، أَنَّ عَطَاءَ بْنَ يَسَارٍ، أَخْبَرَهُ أَنَّ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ أَخْبَرَهُ أَنَّهُ، سَأَلَ عُثْمَانَ بْنَ عَفَّانَ فَقَالَ أَرَأَيْتَ إِذَا جَامَعَ الرَّجُلُ امْرَأَتَهُ فَلَمْ يُمْنِ‏.‏ قَالَ عُثْمَانُ يَتَوَضَّأُ كَمَا يَتَوَضَّأُ لِلصَّلاَةِ، وَيَغْسِلُ ذَكَرَهُ‏.‏ قَالَ عُثْمَانُ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَسَأَلْتُ عَنْ ذَلِكَ عَلِيَّ بْنَ أَبِي طَالِبٍ وَالزُّبَيْرَ بْنَ الْعَوَّامِ وَطَلْحَةَ بْنَ عُبَيْدِ اللَّهِ وَأُبَىَّ بْنَ كَعْبٍ ـ رضى الله عنهم ـ فَأَمَرُوهُ بِذَلِكَ‏.‏ قَالَ يَحْيَى وَأَخْبَرَنِي أَبُو سَلَمَةَ أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ أَخْبَرَهُ أَنَّ أَبَا أَيُّوبَ أَخْبَرَهُ أَنَّهُ سَمِعَ ذَلِكَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 292,
        "hadith_number": "293",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Panduan Mengenai Bersuci Selepas Persetubuhan Tanpa Pancutan Air Mani",
        "perawi_melayu": "Dikisahkan oleh Ubai bin Ka`b:",
        "english_text": "I asked Allah's Messenger (ﷺ) about a man who engages in sexual intercourse with his wife but does not discharge. He replied, \"He should wash the parts which comes in contact with the private parts of the woman, perform ablution and then pray.\" (Abu `Abdullah said, \"Taking a bath is safer and is the last order.\")",
        "malay_translation": "Saya bertanya kepada Rasulullah saw tentang seorang lelaki yang melakukan hubungan seksual dengan isterinya tetapi tidak mengeluarkan air mani. Baginda menjawab, \"Dia hendaklah membasuh bahagian-bahagian yang bersentuhan dengan anggota sulit isterinya, kemudian berwضو dan menunaikan solat.\" (Abu Abdullah berkata, \"Lebih selamat mandi dan itulah perintah terakhir.\")",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ هِشَامِ بْنِ عُرْوَةَ، قَالَ أَخْبَرَنِي أَبِي قَالَ، أَخْبَرَنِي أَبُو أَيُّوبَ، قَالَ أَخْبَرَنِي أُبَىُّ بْنُ كَعْبٍ، أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ إِذَا جَامَعَ الرَّجُلُ الْمَرْأَةَ فَلَمْ يُنْزِلْ قَالَ ‏ \"‏ يَغْسِلُ مَا مَسَّ الْمَرْأَةَ مِنْهُ، ثُمَّ يَتَوَضَّأُ وَيُصَلِّي ‏\"‏‏.‏ \r\n\r\nقَالَ أَبُو عَبْدِ اللَّهِ الْغَسْلُ أَحْوَطُ، وَذَاكَ الآخِرُ، وَإِنَّمَا بَيَّنَّا لاِخْتِلاَفِهِمْ‏.‏"
      }
    ]
  }
}