{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 113,
    "data": [
      {
        "id": 135,
        "hadith_number": "135",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Orang Yang Mengalami Hadats Tidak Diterima Sehingga Mandi",
        "perawi_melayu": "Dikisahkan oleh Abu Hurairah:",
        "english_text": "Allah's Messenger (ﷺ) said, \"The prayer of a person who does Hadath (passes urine, stool or wind) is not accepted till he performs the ablution.\" A person from Hadaramout asked Abu Huraira, \"What is 'Hadath'?\" Abu Huraira replied, \" 'Hadath' means the passing of wind.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Solat seseorang yang mengalami hadats (buang air kecil, besar, atau angin) tidak diterima sehingga dia melakukan wuduk.\" Seorang lelaki dari Hadhramaut bertanya kepada Abu Hurairah, \"Apakah maksud hadats?\" Abu Hurairah menjawab, \"Hadats bermaksud membuang angin.\"",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، قَالَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تُقْبَلُ صَلاَةُ مَنْ أَحْدَثَ حَتَّى يَتَوَضَّأَ ‏\"‏‏.‏ قَالَ رَجُلٌ مِنْ حَضْرَمَوْتَ مَا الْحَدَثُ يَا أَبَا هُرَيْرَةَ قَالَ فُسَاءٌ أَوْ ضُرَاطٌ‏.‏"
      },
      {
        "id": 136,
        "hadith_number": "136",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keistimewaan Wudhu dan Sinarnya Pada Hari Kiamat",
        "perawi_melayu": "Dikisahkan oleh Nu`am Al-Mujmir:",
        "english_text": "Once I went up the roof of the mosque, along with Abu Huraira. He perform ablution and said, \"I heard the Prophet (ﷺ) saying, \"On the Day of Resurrection, my followers will be called \"Al-Ghurr-ul- Muhajjalun\" from the trace of ablution and whoever can increase the area of his radiance should do so (i.e. by performing ablution regularly).' \"",
        "malay_translation": "Suatu ketika aku bersama Abu Hurairah menaiki bumbung masjid. Beliau kemudian melakukan wudhu dan berkata, \"Aku mendengar Rasulullah SAW bersabda, 'Pada Hari Kiamat, pengikutku akan dipanggil \"Al-Ghurr-ul-Muhajjalun\" (orang-orang yang bersinar) disebabkan bekas-bekas wudhu mereka. Dan sesiapa yang mampu menambah kecerahannya, hendaklah dia berbuat demikian (iaitu dengan melakukan wudhu dengan kerap).'\"",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ خَالِدٍ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ نُعَيْمٍ الْمُجْمِرِ، قَالَ رَقِيتُ مَعَ أَبِي هُرَيْرَةَ عَلَى ظَهْرِ الْمَسْجِدِ، فَتَوَضَّأَ فَقَالَ إِنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنَّ أُمَّتِي يُدْعَوْنَ يَوْمَ الْقِيَامَةِ غُرًّا مُحَجَّلِينَ مِنْ آثَارِ الْوُضُوءِ، فَمَنِ اسْتَطَاعَ مِنْكُمْ أَنْ يُطِيلَ غُرَّتَهُ فَلْيَفْعَلْ ‏\"‏‏.‏"
      },
      {
        "id": 137,
        "hadith_number": "137",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menangani Masalah Najis Semasa Solat",
        "perawi_melayu": "Dikisahkan oleh `Abbad bin Tamim daripada pakciknya:",
        "english_text": "He complained to the Allah's Messenger (ﷺ) about a person who imagined to have passed wind during the prayer. Allah' Apostle replied: \"He should not leave his prayers unless he hears sound or smells something.\"",
        "malay_translation": "Beliau mengadu kepada Rasulullah saw tentang seseorang yang menyangka telah membuang angin ketika solat. Rasulullah saw menjawab: \"Dia tidak perlu meninggalkan solatnya melainkan jika dia mendengar bunyi atau mencium bau sesuatu.\"",
        "arabic_text": "حَدَّثَنَا عَلِيٌّ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا الزُّهْرِيُّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَعَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَمِّهِ، أَنَّهُ شَكَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم الرَّجُلُ الَّذِي يُخَيَّلُ إِلَيْهِ أَنَّهُ يَجِدُ الشَّىْءَ فِي الصَّلاَةِ‏.‏ فَقَالَ ‏ \"‏ لاَ يَنْفَتِلْ ـ أَوْ لاَ يَنْصَرِفْ ـ حَتَّى يَسْمَعَ صَوْتًا أَوْ يَجِدَ رِيحًا ‏\"‏‏.‏"
      },
      {
        "id": 138,
        "hadith_number": "138",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keteladanan Nabi SAW dalam Solat dan Tidur",
        "perawi_melayu": "Kuraib",
        "english_text": "The prophet (ﷺ) went to sleep till he started snoring, then he performed prayer. Sometimes, he (ﷺ) said: He went to sleep till he started snoring then stood up and performed prayer. Then Sufyan reports a Hadith many a time from Amr, he reports from Kuraib that Hadrat Ibn-e-Abbas رضی اللہ عنہما said: I passed a night in the house of my  maternal aunt Hadrat Maimoonah and the prophet (ﷺ) stood up to perform prayer. When a part of night was left,  Allah’s Apostle (ﷺ) got up and performed a light ablution from a hanging water skin. Amr describes the quality of his light ablution (Ablution during which one should wash the limbs once and be economical in using water: Irfan) And he (ﷺ) stood up to perform prayer. I also performed an ablution similar to him and then stood up (on his left side): Sometime Sufyan said: Shimalhi (on the left side): So, he drew me to his right. Then he performed the prayer as Allah willed. Then he lay down and slept and started to snore. Thereafter, the proclaimer came and he called him for prayer. So, he (ﷺ) went along him to perform prayer and performed prayer but did not perform ablution. We said to Amr: People say: The eyes of Allah’s Apostle (ﷺ) sleep but his heart does not sleep. Amr says that he has heard Ubaid bin Umair saying: the dream of the prophet (ﷺ) is a divine revelation. Then he recites this verse: “ Undoubtedly, I saw in a dream that I slaughtered you.”(Assafat: 102)",
        "malay_translation": "Nabi SAW tidur hingga bersuara dengkuran, kemudian mendirikan solat. Kadangkala Baginda SAW bersabda: Beliau tidur hingga bersuara dengkuran, kemudian bangun dan mendirikan solat. Kemudian Sufyan meriwayatkan hadis berkali-kali daripada Amr, beliau meriwayatkan daripada Kuraib yang Hadrat Ibn Abbas berkata: Saya menginap semalam di rumah bibiku yang ibu, Hadrat Maimoonah dan Nabi SAW bangun untuk mendirikan solat. Ketika tinggal sebahagian kecil malam, Rasulullah SAW bangun dan melakukan wuduk ringan dari air yang digantung. Amr menjelaskan kualiti wuduk ringan ini (Wuduk ringan iaitu mencuci anggota wuduk sekali dan berhemat dalam menggunakan air: Irfan). Dan Baginda SAW bangun untuk mendirikan solat. Saya juga melakukan wuduk yang serupa dengan Baginda dan kemudian bangun (di sebelah kiri): Kadang-kadang Sufyan berkata: Shimalhi (di sebelah kiri): Oleh itu, beliau menarik saya ke sebelah kanannya. Kemudian beliau mendirikan solat menurut kehendak Allah. Kemudian beliau berbaring dan tidur serta bersuara dengkuran. Selepas itu, muazzin datang dan menyeru Baginda SAW untuk solat. Oleh itu, Baginda pergi bersama beliau untuk mendirikan solat tetapi tidak melakukan wuduk. Kami berkata kepada Amr: Orang-orang berkata: Mata Rasulullah SAW tidur tetapi hatinya tidak tidur. Amr berkata bahawa dia telah mendengar Ubaid bin Umair berkata: Mimpi Nabi SAW adalah wahyu Ilahi. Kemudian beliau membacakan ayat ini: \"Sesungguhnya aku bermimpi bahawa aku menyembelihmu.\" (As-Saffat: 102).",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، قَالَ أَخْبَرَنِي كُرَيْبٌ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَامَ حَتَّى نَفَخَ ثُمَّ صَلَّى ـ وَرُبَّمَا قَالَ اضْطَجَعَ حَتَّى نَفَخَ ـ ثُمَّ قَامَ فَصَلَّى‏.‏ ثُمَّ حَدَّثَنَا بِهِ سُفْيَانُ مَرَّةً بَعْدَ مَرَّةٍ عَنْ عَمْرٍو عَنْ كُرَيْبٍ عَنِ ابْنِ عَبَّاسٍ قَالَ بِتُّ عِنْدَ خَالَتِي مَيْمُونَةَ لَيْلَةً، فَقَامَ النَّبِيُّ صلى الله عليه وسلم مِنَ اللَّيْلِ، فَلَمَّا كَانَ فِي بَعْضِ اللَّيْلِ قَامَ النَّبِيُّ صلى الله عليه وسلم فَتَوَضَّأَ مِنْ شَنٍّ مُعَلَّقٍ وُضُوءًا خَفِيفًا ـ يُخَفِّفُهُ عَمْرٌو وَيُقَلِّلُهُ ـ وَقَامَ يُصَلِّي فَتَوَضَّأْتُ نَحْوًا مِمَّا تَوَضَّأَ، ثُمَّ جِئْتُ فَقُمْتُ عَنْ يَسَارِهِ ـ وَرُبَّمَا قَالَ سُفْيَانُ عَنْ شِمَالِهِ ـ فَحَوَّلَنِي فَجَعَلَنِي عَنْ يَمِينِهِ، ثُمَّ صَلَّى مَا شَاءَ اللَّهُ، ثُمَّ اضْطَجَعَ، فَنَامَ حَتَّى نَفَخَ، ثُمَّ أَتَاهُ الْمُنَادِي فَآذَنَهُ بِالصَّلاَةِ، فَقَامَ مَعَهُ إِلَى الصَّلاَةِ، فَصَلَّى وَلَمْ يَتَوَضَّأْ‏.‏ قُلْنَا لِعَمْرٍو إِنَّ نَاسًا يَقُولُونَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم تَنَامُ عَيْنُهُ وَلاَ يَنَامُ قَلْبُهُ‏.‏ قَالَ عَمْرٌو سَمِعْتُ عُبَيْدَ بْنَ عُمَيْرٍ يَقُولُ رُؤْيَا الأَنْبِيَاءِ وَحْىٌ، ثُمَّ قَرَأَ ‏{‏إِنِّي أَرَى فِي الْمَنَامِ أَنِّي أَذْبَحُكَ‏}‏‏.‏"
      },
      {
        "id": 139,
        "hadith_number": "139",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perintah Rasulullah SAW Mengenai Solat di Muzdalifah",
        "perawi_melayu": "Dikisahkan oleh Usamah bin Zaid:",
        "english_text": "Allah's Messenger (ﷺ) proceeded from `Arafat till when he reached the mountain pass, he dismounted, urinated and then performed ablution but not a perfect one. I said to him, (\"Is it the time for) the prayer, O Allah's Messenger (ﷺ)?\" He said, \"The (place of) prayer is ahead of you.\" He rode till when he reached Al-Muzdalifa, he dismounted and performed ablution and a perfect one, The (call for) Iqama was pronounced and he led the Maghrib prayer. Then everybody made his camel kneel down at its place. Then the Iqama was pronounced for the `Isha' prayer which the Prophet (ﷺ) led and no prayer was offered in between the two . prayers (`Isha' and Maghrib).",
        "malay_translation": "Utusan Allah (ﷺ) berangkat dari Arafah hingga sampai di celah gunung, lalu turun dari unta, buang air kecil, dan kemudian bersuci (wضوء) tetapi tidak sempurna. Aku bertanya kepadanya, \"Adakah waktu solat, wahai Utusan Allah (ﷺ)?\" Beliau menjawab, \"Tempat solat berada di hadapan kamu.\" Beliau menaiki unta hingga sampai ke Muzdalifah, lalu turun, bersuci dengan sempurna, dan dikumandangkan iqamah. Beliau memimpin solat Maghrib. Kemudian setiap orang menidurkan untanya di tempatnya. Kemudian iqamah dikumandangkan untuk solat Isyak yang dipimpin oleh Nabi (ﷺ), dan tidak ada solat yang ditunaikan di antara dua solat (Isyak dan Maghrib) tersebut.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنْ أُسَامَةَ بْنِ زَيْدٍ، أَنَّهُ سَمِعَهُ يَقُولُ دَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ عَرَفَةَ حَتَّى إِذَا كَانَ بِالشِّعْبِ نَزَلَ فَبَالَ، ثُمَّ تَوَضَّأَ وَلَمْ يُسْبِغِ الْوُضُوءَ‏.‏ فَقُلْتُ الصَّلاَةَ يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ ‏ \"‏ الصَّلاَةُ أَمَامَكَ ‏\"‏‏.‏ فَرَكِبَ، فَلَمَّا جَاءَ الْمُزْدَلِفَةَ نَزَلَ فَتَوَضَّأَ، فَأَسْبَغَ الْوُضُوءَ، ثُمَّ أُقِيمَتِ الصَّلاَةُ فَصَلَّى الْمَغْرِبَ، ثُمَّ أَنَاخَ كُلُّ إِنْسَانٍ بَعِيرَهُ فِي مَنْزِلِهِ، ثُمَّ أُقِيمَتِ الْعِشَاءُ فَصَلَّى وَلَمْ يُصَلِّ بَيْنَهُمَا‏.‏"
      },
      {
        "id": 140,
        "hadith_number": "140",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Berwضو'",
        "perawi_melayu": "Dikisahkan oleh `Ata' bin Yasar:",
        "english_text": "Ibn `Abbas melakukan wضو' dan membasuh wajahnya (dengan cara berikut): Beliau mengambil segenggam air, membilas mulut dan mencuci hidungnya dengan memasukkan air dan kemudian meniupnya keluar. Kemudian, beliau mengambil segenggam air lagi dan melakukan seperti ini (menunjukkan isyarat) menggabungkan kedua tangan, dan membasuh wajahnya, mengambil segenggam air lagi dan membasuh lengan kanannya. Beliau sekali lagi mengambil segenggam air dan membasuh lengan kirinya, dan mengusap kepalanya dengan tangan yang basah dan mengambil segenggam air lagi dan menuangkannya ke kaki kanannya (sampai ke buku lali) dan membasuhnya dengan teliti dan sama seperti itu mengambil segenggam air lagi dan membasuh kaki kirinya (sampai ke buku lali) dengan teliti dan berkata, \"Saya melihat Rasulullah SAW melakukan wضو' dengan cara ini.\"",
        "malay_translation": "Ibn `Abbas melakukan wضو' dan membasuh wajahnya (dengan cara berikut): Beliau mengambil segenggam air, membilas mulut dan mencuci hidungnya dengan memasukkan air dan kemudian meniupnya keluar. Kemudian, beliau mengambil segenggam air lagi dan melakukan seperti ini (menunjukkan isyarat) menggabungkan kedua tangan, dan membasuh wajahnya, mengambil segenggam air lagi dan membasuh lengan kanannya. Beliau sekali lagi mengambil segenggam air dan membasuh lengan kirinya, dan mengusap kepalanya dengan tangan yang basah dan mengambil segenggam air lagi dan menuangkannya ke kaki kanannya (sampai ke buku lali) dan membasuhnya dengan teliti dan sama seperti itu mengambil segenggam air lagi dan membasuh kaki kirinya (sampai ke buku lali) dengan teliti dan berkata, \"Saya melihat Rasulullah SAW melakukan wضو' dengan cara ini.\"  Ini merupakan sebuah riwayat yang sahih, di mana Ibn `Abbas menggambarkan cara Rasulullah SAW melakukan wضو'.  Perhatian khusus diberikan pada cara mengambil air dan membasuh anggota badan dengan teliti.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، قَالَ أَخْبَرَنَا أَبُو سَلَمَةَ الْخُزَاعِيُّ، مَنْصُورُ بْنُ سَلَمَةَ قَالَ أَخْبَرَنَا ابْنُ بِلاَلٍ ـ يَعْنِي سُلَيْمَانَ ـ عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ تَوَضَّأَ فَغَسَلَ وَجْهَهُ، ثُمَّ أَخَذَ غَرْفَةً مِنْ مَاءٍ، فَمَضْمَضَ بِهَا وَاسْتَنْشَقَ، ثُمَّ أَخَذَ غَرْفَةً مِنْ مَاءٍ، فَجَعَلَ بِهَا هَكَذَا، أَضَافَهَا إِلَى يَدِهِ الأُخْرَى، فَغَسَلَ بِهِمَا وَجْهَهُ، ثُمَّ أَخَذَ غَرْفَةً مِنْ مَاءٍ، فَغَسَلَ بِهَا يَدَهُ الْيُمْنَى، ثُمَّ أَخَذَ غَرْفَةً مِنْ مَاءٍ، فَغَسَلَ بِهَا يَدَهُ الْيُسْرَى، ثُمَّ مَسَحَ بِرَأْسِهِ، ثُمَّ أَخَذَ غَرْفَةً مِنْ مَاءٍ فَرَشَّ عَلَى رِجْلِهِ الْيُمْنَى حَتَّى غَسَلَهَا، ثُمَّ أَخَذَ غَرْفَةً أُخْرَى، فَغَسَلَ بِهَا رِجْلَهُ ـ يَعْنِي الْيُسْرَى ـ ثُمَّ قَالَ هَكَذَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَتَوَضَّأُ‏.‏"
      },
      {
        "id": 141,
        "hadith_number": "141",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Doa Sebelum Berhubungan Suami Isteri untuk Menjauhkan Gangguan Syaitan",
        "perawi_melayu": "Dikisahkan oleh Ibn `Abbas:",
        "english_text": "The Prophet (ﷺ) said, \"If anyone of you on having sexual relations with his wife said (and he must say it before starting) 'In the name of Allah. O Allah! Protect us from Satan and also protect what you bestow upon us (i.e. the coming offspring) from Satan, and if it is destined that they should have a child then, Satan will never be able to harm that offspring.\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Jika ada di antara kalian yang ingin melakukan hubungan seksual dengan isterinya, hendaklah ia mengucapkan (dan ia wajib mengucapkan sebelum memulakan) 'Dengan nama Allah. Ya Allah, lindungilah kami daripada syaitan dan lindungilah apa yang Engkau anugerahkan kepada kami (iaitu zuriat yang akan datang) daripada syaitan. Dan jika ditakdirkan mereka akan mempunyai anak, maka syaitan tidak akan mampu mencelakakan anak tersebut.\"",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ لَوْ أَنَّ أَحَدَكُمْ إِذَا أَتَى أَهْلَهُ قَالَ بِسْمِ اللَّهِ اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا‏.‏ فَقُضِيَ بَيْنَهُمَا وَلَدٌ، لَمْ يَضُرَّهُ ‏\"‏‏.‏"
      },
      {
        "id": 142,
        "hadith_number": "142",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perlindungan Daripada Keburukan Ketika Memenuhi Keperluan Alam",
        "perawi_melayu": "Dikisahkan oleh Anas:",
        "english_text": "Whenever the Prophet (ﷺ) went to answer the call of nature, he used to say, \"Allah-umma inni a`udhu bika minal khubuthi wal khaba'ith i.e. O Allah, I seek Refuge with You from all offensive and wicked things (evil deeds and evil spirits).",
        "malay_translation": "Setiap kali Nabi SAW memenuhi keperluan alam, baginda akan membaca, \"Allahumma inni a'udzu bika minal khubuthi wal khaba'ith. (Ya Allah, aku memohon perlindungan kepadaMu daripada segala perkara yang buruk dan kejahatan).\"",
        "arabic_text": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا دَخَلَ الْخَلاَءَ قَالَ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِثِ ‏\"‏‏.‏ تَابَعَهُ ابْنُ عَرْعَرَةَ عَنْ شُعْبَةَ‏.‏ وَقَالَ غُنْدَرٌ عَنْ شُعْبَةَ إِذَا أَتَى الْخَلاَءَ‏.‏ وَقَالَ مُوسَى عَنْ حَمَّادٍ إِذَا دَخَلَ‏.‏ وَقَالَ سَعِيدُ بْنُ زَيْدٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ إِذَا أَرَادَ أَنْ يَدْخُلَ‏.‏"
      },
      {
        "id": 143,
        "hadith_number": "143",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Doa Rasulullah SAW untuk Ibn 'Abbas Menjadi Seorang Ulama",
        "perawi_melayu": "Dikisahkan oleh Ibn 'Abbas:",
        "english_text": "Once the Prophet (ﷺ) entered a lavatory and I placed water for his ablution. He asked, \"Who placed it?\" He was informed accordingly and so he said, \"O Allah! Make him (Ibn `Abbas) a learned scholar in religion (Islam).",
        "malay_translation": "Suatu ketika Nabi (ﷺ) masuk ke tandas dan saya menyediakan air untuk wudhunya. Baginda bertanya, \"Siapakah yang meletakkan ini?\" Saya dimaklumkan dan Baginda bersabda, \"Ya Allah, jadikanlah dia (Ibn 'Abbas) seorang ulama yang alim dalam agama (Islam).\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، قَالَ حَدَّثَنَا وَرْقَاءُ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ الْخَلاَءَ، فَوَضَعْتُ لَهُ وَضُوءًا قَالَ ‏\"‏ مَنْ وَضَعَ هَذَا ‏\"‏‏.‏ فَأُخْبِرَ فَقَالَ ‏\"‏ اللَّهُمَّ فَقِّهْهُ فِي الدِّينِ ‏\"‏‏.‏"
      },
      {
        "id": 144,
        "hadith_number": "144",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Petunjuk Mengenai Menunaikan Kebutuhan Alam di Tempat Terbuka",
        "perawi_melayu": "Diriwayatkan oleh Abu Aiyub Al-Ansari",
        "english_text": "Allah's Messenger (ﷺ) said, \"If anyone of you goes to an open space for answering the call of nature he should neither face nor turn his back towards the Qibla; he should either face the east or the west.\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Jika ada di antara kamu yang pergi ke tempat terbuka untuk membuang air kecil, janganlah ia menghadap atau membelakangi kiblat; hendaklah ia menghadap ke arah timur atau barat.\"",
        "arabic_text": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، قَالَ حَدَّثَنَا الزُّهْرِيُّ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي أَيُّوبَ الأَنْصَارِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا أَتَى أَحَدُكُمُ الْغَائِطَ فَلاَ يَسْتَقْبِلِ الْقِبْلَةَ وَلاَ يُوَلِّهَا ظَهْرَهُ، شَرِّقُوا أَوْ غَرِّبُوا ‏\"‏‏.‏"
      },
      {
        "id": 145,
        "hadith_number": "145",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menghadap Kiblat atau Baitul Maqdis Ketika Buang Air Besar",
        "perawi_melayu": "Dikisahkan oleh `Abdullah bin `Umar:",
        "english_text": "People say, \"Whenever you sit for answering the call of nature, you should not face the Qibla or Baitul-Maqdis (Jerusalem).\" I told them. \"Once I went up the roof of our house and I saw Allah's Apostle answering the call of nature while sitting on two bricks facing Baitul-Maqdis (Jerusalem) (but there was a screen covering him. ' (Fath-al-Bari, Page 258, Vol. 1).",
        "malay_translation": "Orang-orang berkata, \"Apabila anda hendak membuang air besar, janganlah menghadap kiblat atau Baitul-Maqdis (Yerusalem).\" Saya katakan kepada mereka, \"Pada suatu ketika, saya naik ke bumbung rumah kami dan melihat Rasulullah SAW membuang air besar sambil duduk di atas dua batu bata menghadap Baitul-Maqdis (Yerusalem) (tetapi ada tabir yang menutupinya).\" (Fath-al-Bari, Muka Surat 258, Jilid 1).",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنْ عَمِّهِ، وَاسِعِ بْنِ حَبَّانَ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ يَقُولُ إِنَّ نَاسًا يَقُولُونَ إِذَا قَعَدْتَ عَلَى حَاجَتِكَ، فَلاَ تَسْتَقْبِلِ الْقِبْلَةَ وَلاَ بَيْتَ الْمَقْدِسِ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ لَقَدِ ارْتَقَيْتُ يَوْمًا عَلَى ظَهْرِ بَيْتٍ لَنَا، فَرَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى لَبِنَتَيْنِ مُسْتَقْبِلاً بَيْتَ الْمَقْدِسِ لِحَاجَتِهِ‏.‏ وَقَالَ لَعَلَّكَ مِنَ الَّذِينَ يُصَلُّونَ عَلَى أَوْرَاكِهِمْ، فَقُلْتُ لاَ أَدْرِي وَاللَّهِ‏.‏ قَالَ مَالِكٌ يَعْنِي الَّذِي يُصَلِّي وَلاَ يَرْتَفِعُ عَنِ الأَرْضِ، يَسْجُدُ وَهُوَ لاَصِقٌ بِالأَرْضِ‏.‏"
      },
      {
        "id": 146,
        "hadith_number": "146",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Penjelasan Mengenai Penggunaan Niqab dan Perintah Berhijab",
        "perawi_melayu": "Dikisahkan oleh `Aisha",
        "english_text": "The wives of the Prophet (ﷺ) used to go to Al-Manasi, a vast open place (near Baqi` at Medina) to answer the call of nature at night. `Umar used to say to the Prophet (ﷺ) \"Let your wives be veiled,\" but Allah's Apostle did not do so. One night Sauda bint Zam`a the wife of the Prophet (ﷺ) went out at `Isha' time and she was a tall lady. `Umar addressed her and said, \"I have recognized you, O Sauda.\" He said so, as he desired eagerly that the verses of Al-Hijab (the observing of veils by the Muslim women) may be revealed. So Allah revealed the verses of \"Al-Hijab\" (A complete body cover excluding the eyes).",
        "malay_translation": "Para isteri Nabi SAW dahulu sering pergi ke Al-Manasi, sebuah kawasan lapang yang luas (berhampiran Baqi' di Madinah) untuk membuang air kecil pada waktu malam. `Umar sering berkata kepada Nabi SAW, \"Selimutilah isteri-isteri engkau,\" tetapi Rasulullah SAW tidak melakukannya. Pada suatu malam, Sauda binti Zam'a, isteri Nabi SAW, keluar pada waktu Isyak dan beliau seorang wanita yang tinggi. `Umar menegurnya dan berkata, \"Aku mengenali engkau, wahai Sauda.\" Beliau berkata demikian kerana beliau berharap agar ayat-ayat Al-Hijab (mengenai penutup aurat wanita Muslimah) akan diturunkan. Maka Allah SWT menurunkan ayat-ayat \"Al-Hijab\" (perintah menutup aurat seluruh badan kecuali wajah dan kedua belah tangan).",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ أَزْوَاجَ النَّبِيِّ، صلى الله عليه وسلم كُنَّ يَخْرُجْنَ بِاللَّيْلِ إِذَا تَبَرَّزْنَ إِلَى الْمَنَاصِعِ ـ وَهُوَ صَعِيدٌ أَفْيَحُ ـ فَكَانَ عُمَرُ يَقُولُ لِلنَّبِيِّ صلى الله عليه وسلم احْجُبْ نِسَاءَكَ‏.‏ فَلَمْ يَكُنْ رَسُولُ اللَّهِ صلى الله عليه وسلم يَفْعَلُ، فَخَرَجَتْ سَوْدَةُ بِنْتُ زَمْعَةَ زَوْجُ النَّبِيِّ صلى الله عليه وسلم لَيْلَةً مِنَ اللَّيَالِي عِشَاءً، وَكَانَتِ امْرَأَةً طَوِيلَةً، فَنَادَاهَا عُمَرُ أَلاَ قَدْ عَرَفْنَاكِ يَا سَوْدَةُ‏.‏ حِرْصًا عَلَى أَنْ يَنْزِلَ الْحِجَابُ، فَأَنْزَلَ اللَّهُ آيَةَ الْحِجَابِ‏.‏"
      },
      {
        "id": 147,
        "hadith_number": "147",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keizinan Wanita Keluar Rumah untuk Membuang Air",
        "perawi_melayu": "Dikisahkan oleh `Aisyah:",
        "english_text": "The Prophet (ﷺ) said to his wives, \"You are allowed to go out to answer the call of nature.\"",
        "malay_translation": "Nabi (ﷺ) bersabda kepada para isterinya, \"Kamu diizinkan keluar rumah untuk membuang air kecil atau besar.\"",
        "arabic_text": "حَدَّثَنَا زَكَرِيَّاءُ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ قَدْ أُذِنَ أَنْ تَخْرُجْنَ فِي حَاجَتِكُنَّ ‏\"‏‏.‏ قَالَ هِشَامٌ يَعْنِي الْبَرَازَ‏.‏"
      },
      {
        "id": 148,
        "hadith_number": "148",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Menunaikan Hajat Menghadap ke arah Syam",
        "perawi_melayu": "Dikisahkan oleh Abdullah bin Umar",
        "english_text": "I went up to the roof of Hafsa's house for some job and I saw Allah's Messenger (ﷺ) answering the call of nature facing Sham (Syria, Jordan, Palestine and Lebanon regarded as one country) with his back towards the Qibla. (See Hadith No. 147).",
        "malay_translation": "Saya naik ke bumbung rumah Hafsah untuk urusan tertentu dan saya melihat Rasulullah SAW memenuhi keperluan semula jadi menghadap ke arah Syam (Syria, Jordan, Palestin dan Lubnan dianggap satu negara) dengan belakangnya menghadap kiblat. (Rujuk Hadis No. 147).",
        "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنْ وَاسِعِ بْنِ حَبَّانَ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ ارْتَقَيْتُ فَوْقَ ظَهْرِ بَيْتِ حَفْصَةَ لِبَعْضِ حَاجَتِي، فَرَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقْضِي حَاجَتَهُ مُسْتَدْبِرَ الْقِبْلَةِ مُسْتَقْبِلَ الشَّأْمِ‏.‏"
      },
      {
        "id": 149,
        "hadith_number": "149",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Menunaikan Kebutuhan Alam di Atap Rumah",
        "perawi_melayu": "Diceritakan oleh Abdullah bin Umar:",
        "english_text": "Once I went up the roof of our house and saw Allah's Messenger (ﷺ) answering the call of nature while sitting over two bricks facing Baitul-Maqdis (Jerusalem). (See Hadith No. 147).",
        "malay_translation": "Suatu ketika aku naik ke atas bumbung rumah kami dan melihat Rasulullah SAW menunaikan hajat sambil duduk di atas dua batu bata yang menghadap Baitul-Maqdis (Jerusalem). (Lihat Hadis No. 147).",
        "arabic_text": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، قَالَ أَخْبَرَنَا يَحْيَى، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، أَنَّ عَمَّهُ، وَاسِعَ بْنَ حَبَّانَ، أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ أَخْبَرَهُ قَالَ لَقَدْ ظَهَرْتُ ذَاتَ يَوْمٍ عَلَى ظَهْرِ بَيْتِنَا، فَرَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَاعِدًا عَلَى لَبِنَتَيْنِ مُسْتَقْبِلَ بَيْتِ الْمَقْدِسِ‏.‏"
      },
      {
        "id": 150,
        "hadith_number": "150",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pengiring Rasulullah SAW Semasa Beristinjak",
        "perawi_melayu": "Dikisahkan oleh Anas bin Malik:",
        "english_text": "Whenever Allah's Messenger (ﷺ) went to answer the call of nature, I along with another boy used to accompany him with a tumbler full of water. (Hisham commented, \"So that he might wash his private parts with it.)\"",
        "malay_translation": "Apabila Rasulullah SAW pergi ke tandas, aku bersama seorang budak lelaki lain akan menemani baginda dengan membawa gelas berisi air. (Hisham berkata, \"Supaya baginda boleh membersihkan anggota sulitnya dengan air itu.\")",
        "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، هِشَامُ بْنُ عَبْدِ الْمَلِكِ قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي مُعَاذٍ ـ وَاسْمُهُ عَطَاءُ بْنُ أَبِي مَيْمُونَةَ ـ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا خَرَجَ لِحَاجَتِهِ أَجِيءُ أَنَا وَغُلاَمٌ مَعَنَا إِدَاوَةٌ مِنْ مَاءٍ‏.‏ يَعْنِي يَسْتَنْجِي بِهِ‏.‏"
      },
      {
        "id": 151,
        "hadith_number": "151",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW dan Tabiat Menguruskan Kebutuhan Fizikal",
        "perawi_melayu": "Dikisahkan oleh Anas bin Malik:",
        "english_text": "Whenever Allah's Messenger (ﷺ) went to answer the call of nature, I along with another boy from us used to go behind him with a tumbler full of water.",
        "malay_translation": "Setiap kali Rasulullah SAW ingin membuang air kecil, saya bersama seorang budak lelaki lain dari kalangan kami akan mengikutinya di belakang sambil membawa cawan berisi air.",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي مُعَاذٍ ـ هُوَ عَطَاءُ بْنُ أَبِي مَيْمُونَةَ ـ قَالَ سَمِعْتُ أَنَسًا، يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا خَرَجَ لِحَاجَتِهِ تَبِعْتُهُ أَنَا وَغُلاَمٌ مِنَّا مَعَنَا إِدَاوَةٌ مِنْ مَاءٍ‏.‏"
      },
      {
        "id": 152,
        "hadith_number": "152",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kebersihan Rasulullah SAW Ketika Membuang Hajat",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik:",
        "english_text": "Whenever Allah's Messenger (ﷺ) went to answer the call of nature, I along with another boy used to carry a tumbler full of water (for cleaning the private parts) and a short spear (or stick).",
        "malay_translation": "Setiap kali Rasulullah SAW pergi untuk membuang hajat, saya bersama seorang budak lelaki lain akan membawa sebuah cawan berisi air (untuk membersihkan anggota sulit) dan sebatang kayu pendek (atau tongkat).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَطَاءِ بْنِ أَبِي مَيْمُونَةَ، سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدْخُلُ الْخَلاَءَ، فَأَحْمِلُ أَنَا وَغُلاَمٌ إِدَاوَةً مِنْ مَاءٍ، وَعَنَزَةً، يَسْتَنْجِي بِالْمَاءِ‏.‏ تَابَعَهُ النَّضْرُ وَشَاذَانُ عَنْ شُعْبَةَ‏.‏ الْعَنَزَةُ عَصًا عَلَيْهِ زُجٌّ‏.‏"
      },
      {
        "id": 153,
        "hadith_number": "153",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Menghembus Minuman dan Menggunakan Tangan Kanan dalam Kebersihan",
        "perawi_melayu": "Riwayat Abu Qatada",
        "english_text": "Allah's Messenger (ﷺ) said, \"Whenever anyone of you drinks water, he should not breathe in the drinking utensil, and whenever anyone of you goes to a lavatory, he should neither touch his penis nor clean his private parts with his right hand.\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Apabila salah seorang daripada kamu minum air, janganlah dia menghembus ke dalam bekas minuman itu. Dan apabila salah seorang daripada kamu pergi ke tandas, janganlah dia menyentuh zakarnya atau membersihkan bahagian sulitnya dengan tangan kanannya.\"",
        "arabic_text": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، قَالَ حَدَّثَنَا هِشَامٌ ـ هُوَ الدَّسْتَوَائِيُّ ـ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا شَرِبَ أَحَدُكُمْ فَلاَ يَتَنَفَّسْ فِي الإِنَاءِ، وَإِذَا أَتَى الْخَلاَءَ فَلاَ يَمَسَّ ذَكَرَهُ بِيَمِينِهِ، وَلاَ يَتَمَسَّحْ بِيَمِينِهِ ‏\"‏‏.‏"
      },
      {
        "id": 154,
        "hadith_number": "154",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Menggunakan Tangan Kanan untuk Membersihkan dan Menghirup Minuman dari Peralatan Minum",
        "perawi_melayu": "Dikisahkan oleh Abu Qatada:",
        "english_text": "The Prophet (ﷺ) said, \"Whenever anyone of you makes water he should not hold his penis or clean his private parts with his right hand. (And while drinking) one should not breathe in the drinking utensil .\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Apabila salah seorang daripada kamu membuang air kecil, janganlah dia memegang zakarnya atau membersihkan anggota sulitnya dengan tangan kanan. (Dan semasa minum), janganlah dia menghirup minuman daripada peralatan minum tersebut.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا بَالَ أَحَدُكُمْ فَلاَ يَأْخُذَنَّ ذَكَرَهُ بِيَمِينِهِ، وَلاَ يَسْتَنْجِي بِيَمِينِهِ، وَلاَ يَتَنَفَّسْ فِي الإِنَاءِ ‏\"‏‏.‏"
      },
      {
        "id": 155,
        "hadith_number": "155",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Nabi SAW Menguruskan Keperluan Diri",
        "perawi_melayu": "Dikisahkan oleh Abu Hurairah:",
        "english_text": "I followed the Prophet (ﷺ) while he was going out to answer the call of nature. He used not to look this way or that. So, when I approached near him he said to me, \"Fetch for me some stones for ' cleaning the privates parts (or said something similar), and do not bring a bone or a piece of dung.\" So I brought the stones in the corner of my garment and placed them by his side and I then went away from him. When he finished (from answering the call of nature) he used, them .",
        "malay_translation": "Aku mengikuti Nabi SAW ketika baginda keluar untuk membuang air kecil. Baginda tidak memandang ke kiri atau ke kanan.  Maka, ketika aku mendekatinya, baginda bersabda kepadaku, \"Ambilkan untukku beberapa batu untuk membersihkan diri, dan jangan bawa tulang atau kotoran.\"  Lalu aku mengambil batu-batu itu dan memasukkannya di sudut kain bajuku dan meletakkannya di sisinya, kemudian aku menyingkir.  Setelah baginda selesai, baginda menggunakannya.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ الْمَكِّيُّ، قَالَ حَدَّثَنَا عَمْرُو بْنُ يَحْيَى بْنِ سَعِيدِ بْنِ عَمْرٍو الْمَكِّيُّ، عَنْ جَدِّهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ اتَّبَعْتُ النَّبِيَّ صلى الله عليه وسلم وَخَرَجَ لِحَاجَتِهِ، فَكَانَ لاَ يَلْتَفِتُ فَدَنَوْتُ مِنْهُ فَقَالَ ‏ \"‏ ابْغِنِي أَحْجَارًا أَسْتَنْفِضْ بِهَا ـ أَوْ نَحْوَهُ ـ وَلاَ تَأْتِنِي بِعَظْمٍ وَلاَ رَوْثٍ ‏\"‏‏.‏ فَأَتَيْتُهُ بِأَحْجَارٍ بِطَرَفِ ثِيَابِي فَوَضَعْتُهَا إِلَى جَنْبِهِ وَأَعْرَضْتُ عَنْهُ، فَلَمَّا قَضَى أَتْبَعَهُ بِهِنَّ‏.‏"
      },
      {
        "id": 156,
        "hadith_number": "156",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Nabi SAW dan Batu serta Kotoran",
        "perawi_melayu": "Dikisahkan oleh `Abdullah",
        "english_text": "The Prophet (ﷺ) went out to answer the call of nature and asked me to bring three stones. I found two stones and searched for the third but could not find it. So took a dried piece of dung and brought it to him. He took the two stones and threw away the dung and said, \"This is a filthy thing.\"",
        "malay_translation": "Nabi SAW keluar untuk membuang hajat dan meminta saya membawa tiga batu. Saya mendapati dua batu dan mencari batu ketiga tetapi tidak dapat menemuinya. Oleh itu, saya mengambil seketul tahi kering dan membawanya kepadanya. Baginda mengambil dua batu tersebut dan membuang tahi kering itu dan bersabda, \"Ini adalah sesuatu yang kotor.\"",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا زُهَيْرٌ، عَنْ أَبِي إِسْحَاقَ، قَالَ لَيْسَ أَبُو عُبَيْدَةَ ذَكَرَهُ وَلَكِنْ عَبْدُ الرَّحْمَنِ بْنُ الأَسْوَدِ عَنْ أَبِيهِ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ، يَقُولُ أَتَى النَّبِيُّ صلى الله عليه وسلم الْغَائِطَ، فَأَمَرَنِي أَنْ آتِيَهُ بِثَلاَثَةِ أَحْجَارٍ، فَوَجَدْتُ حَجَرَيْنِ، وَالْتَمَسْتُ الثَّالِثَ فَلَمْ أَجِدْهُ، فَأَخَذْتُ رَوْثَةً، فَأَتَيْتُهُ بِهَا، فَأَخَذَ الْحَجَرَيْنِ وَأَلْقَى الرَّوْثَةَ وَقَالَ ‏ \"‏ هَذَا رِكْسٌ ‏\"‏‏.‏ وَقَالَ إِبْرَاهِيمُ بْنُ يُوسُفَ عَنْ أَبِيهِ عَنْ أَبِي إِسْحَاقَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ‏.‏"
      },
      {
        "id": 157,
        "hadith_number": "157",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi SAW Mencuci Anggota Tubuh Hanya Sekali Semasa Bersuci",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Abbas:",
        "english_text": "The Prophet (ﷺ) performed ablution by washing the body parts only once.",
        "malay_translation": "Nabi (ﷺ) telah melakukan wuduk dengan mencuci anggota badan hanya sekali.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ تَوَضَّأَ النَّبِيُّ صلى الله عليه وسلم مَرَّةً مَرَّةً‏.‏"
      },
      {
        "id": 158,
        "hadith_number": "158",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi SAW Mencuci Anggota Badan Dua Kali Ketika Bersuci",
        "perawi_melayu": "Dikisahkan oleh `Abdullah bin Zaid:",
        "english_text": "The Prophet (ﷺ) performed ablution by washing the body parts twice.",
        "malay_translation": "Nabi SAW (sallallahu alaihi wasallam) melakukan wuduk dengan mencuci setiap anggota badan sebanyak dua kali.",
        "arabic_text": "حَدَّثَنَا حُسَيْنُ بْنُ عِيسَى، قَالَ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم تَوَضَّأَ مَرَّتَيْنِ مَرَّتَيْنِ‏.‏"
      },
      {
        "id": 159,
        "hadith_number": "159",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Wudhu dan Doa Pengampunan Dosa",
        "perawi_melayu": "Dikisahkan oleh Humran",
        "english_text": "(the slave of 'Uthman) I saw 'Uthman bin 'Affan asking for a tumbler of water (and when it was brought) he poured water over his hands and washed them thrice and then put his right hand in the water container and rinsed his mouth, washed his nose by putting water in it and then blowing it out. then he washed his face and forearms up to the elbows thrice, passed his wet hands over his head and washed his feet up to the ankles thrice. Then he said, \"Allah's Messenger (ﷺ) said 'If anyone performs ablution like that of mine and offers a two-rak'at prayer during which he does not think of anything else (not related to the present prayer) then his past sins will be forgiven.' \"",
        "malay_translation": "(Hamba 'Uthman) Aku melihat 'Uthman bin 'Affan meminta sebuah cawan air. (Apabila dibawa) beliau menuang air ke tangannya dan membasuh tangannya tiga kali. Kemudian beliau memasukkan tangan kanannya ke dalam bekas air itu dan membilas mulutnya, membersihkan hidungnya dengan memasukkan air dan meniupnya keluar. Kemudian beliau membasuh mukanya dan lengannya hingga ke siku tiga kali, melalukan tangannya yang basah ke atas kepalanya dan membasuh kakinya hingga ke buku lali tiga kali. Kemudian beliau berkata, \"Rasulullah SAW bersabda, 'Sesiapa yang melakukan wuduk seperti wudukku dan menunaikan solat dua rakaat tanpa memikirkan perkara lain (yang bukan berkaitan solat ini), maka dosa-dosanya yang lalu akan diampunkan.'\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ الأُوَيْسِيُّ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عَطَاءَ بْنَ يَزِيدَ، أَخْبَرَهُ أَنَّ حُمْرَانَ مَوْلَى عُثْمَانَ أَخْبَرَهُ أَنَّهُ، رَأَى عُثْمَانَ بْنَ عَفَّانَ دَعَا بِإِنَاءٍ، فَأَفْرَغَ عَلَى كَفَّيْهِ ثَلاَثَ مِرَارٍ فَغَسَلَهُمَا، ثُمَّ أَدْخَلَ يَمِينَهُ فِي الإِنَاءِ فَمَضْمَضَ، وَاسْتَنْشَقَ، ثُمَّ غَسَلَ وَجْهَهُ ثَلاَثًا، وَيَدَيْهِ إِلَى الْمِرْفَقَيْنِ ثَلاَثَ مِرَارٍ، ثُمَّ مَسَحَ بِرَأْسِهِ، ثُمَّ غَسَلَ رِجْلَيْهِ ثَلاَثَ مِرَارٍ إِلَى الْكَعْبَيْنِ، ثُمَّ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ تَوَضَّأَ نَحْوَ وُضُوئِي هَذَا، ثُمَّ صَلَّى رَكْعَتَيْنِ، لاَ يُحَدِّثُ فِيهِمَا نَفْسَهُ، غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏‏.‏"
      },
      {
        "id": 160,
        "hadith_number": "160",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pengampunan Dosa Antara Dua Solat",
        "perawi_melayu": "Setelah selesai bersuci, Uthman berkata, \"Aku akan menyampaikan kepadamu satu hadis yang tidak akan aku sampaikan, jika aku tidak dipaksa oleh ayat suci tertentu (sub perawi 'Urwa berkata: ...\")",
        "english_text": "This verse is: \"Verily, those who conceal the clear signs and the guidance which we have sent down...)\" (2:159). I heard the Prophet (ﷺ) saying, 'If a man performs ablution perfectly and then offers the compulsory congregational prayer, Allah will forgive his sins committed between that (prayer) and the (next) prayer till he offers it.",
        "malay_translation": "Ayat ini bermaksud: \"Sesungguhnya orang-orang yang menyembunyikan tanda-tanda yang nyata dan petunjuk yang telah Kami turunkan...\" (2:159). Aku mendengar Rasulullah SAW bersabda, 'Jika seseorang melakukan wuduk dengan sempurna dan kemudian menunaikan solat fardhu berjemaah, Allah akan mengampuni dosa-dosanya yang dilakukan di antara solat tersebut dan solat berikutnya sehingga ia menunaikan solat tersebut.",
        "arabic_text": "وَعَنْ إِبْرَاهِيمَ، قَالَ قَالَ صَالِحُ بْنُ كَيْسَانَ قَالَ ابْنُ شِهَابٍ وَلَكِنْ عُرْوَةُ يُحَدِّثُ عَنْ حُمْرَانَ،، فَلَمَّا تَوَضَّأَ عُثْمَانُ قَالَ أَلاَ أُحَدِّثُكُمْ حَدِيثًا لَوْلاَ آيَةٌ مَا حَدَّثْتُكُمُوهُ، سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ يَتَوَضَّأُ رَجُلٌ فَيُحْسِنُ وُضُوءَهُ، وَيُصَلِّي الصَّلاَةَ إِلاَّ غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الصَّلاَةِ حَتَّى يُصَلِّيَهَا ‏\"‏‏.‏ قَالَ عُرْوَةُ الآيَةُ ‏{‏إِنَّ الَّذِينَ يَكْتُمُونَ مَا أَنْزَلْنَا مِنَ الْبَيِّنَاتِ‏}‏‏.‏"
      },
      {
        "id": 161,
        "hadith_number": "161",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Membersihkan Hidung dan Kemaluan dalam Wudhuk",
        "perawi_melayu": "Riwayat Abu Hurairah:",
        "english_text": "The Prophet (ﷺ) said, \"Whoever performs ablution should clean his nose with water by putting the water in it and then blowing it out, and whoever cleans his private parts with stones should do it with odd number of stones.\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Sesiapa yang melakukan wudhuk hendaklah membersihkan hidungnya dengan air dengan memasukkan air ke dalamnya dan kemudian meniupnya keluar. Dan sesiapa yang membersihkan anggota sulitnya dengan batu, hendaklah dia melakukannya dengan menggunakan bilangan batu ganjil.\"",
        "arabic_text": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو إِدْرِيسَ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ مَنْ تَوَضَّأَ فَلْيَسْتَنْثِرْ، وَمَنِ اسْتَجْمَرَ فَلْيُوتِرْ ‏\"‏‏.‏"
      },
      {
        "id": 162,
        "hadith_number": "162",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Tatacara Bersuci dan Kewaspadaan dalam Wudhuk",
        "perawi_melayu": "Riwayat daripada Abu Hurairah",
        "english_text": "Allah's Messenger (ﷺ) said, \"If anyone of you performs ablution he should put water in his nose and then blow it out and whoever cleans his private parts with stones should do so with odd numbers. And whoever wakes up from his sleep should wash his hands before putting them in the water for ablution, because nobody knows where his hands were during sleep.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Jika seseorang di antara kamu berwudhuk, hendaklah ia memasukkan air ke dalam hidungnya dan kemudian meniupkannya keluar. Dan sesiapa yang membersihkan anggota sulitnya dengan batu, hendaklah ia melakukannya dengan bilangan ganjil. Dan sesiapa yang terjaga dari tidurnya, hendaklah ia mencuci tangannya sebelum memasukkannya ke dalam air untuk berwudhuk, kerana tiada seorang pun yang tahu di mana tangannya berada semasa tidur.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا تَوَضَّأَ أَحَدُكُمْ فَلْيَجْعَلْ فِي أَنْفِهِ ثُمَّ لِيَنْثُرْ، وَمَنِ اسْتَجْمَرَ فَلْيُوتِرْ، وَإِذَا اسْتَيْقَظَ أَحَدُكُمْ مِنْ نَوْمِهِ فَلْيَغْسِلْ يَدَهُ قَبْلَ أَنْ يُدْخِلَهَا فِي وَضُوئِهِ، فَإِنَّ أَحَدَكُمْ لاَ يَدْرِي أَيْنَ بَاتَتْ يَدُهُ ‏\"‏‏.‏"
      },
      {
        "id": 163,
        "hadith_number": "163",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menjaga Tumit Dari Api Neraka",
        "perawi_melayu": "Dikisahkan oleh Abdullah bin 'Amr:",
        "english_text": "The Prophet (ﷺ) remained behind us on a journey. He joined us while we were performing ablution for the `Asr prayer which was overdue and we were just passing wet hands over our feet (not washing them thoroughly) so he addressed us in a loud voice saying twice , \"Save your heels from the fire.\"",
        "malay_translation": "Nabi (ﷺ) tertinggal di belakang kami dalam perjalanan. Baginda menyertai kami ketika kami sedang melakukan wuduk untuk solat Asar yang telah lewat dan kami hanya membasahkan kaki dengan tangan (tanpa mencucinya sepenuhnya), lalu Baginda menegur kami dengan suara lantang, sebanyak dua kali, \"Selamatkan tumit kamu dari api neraka.\"",
        "arabic_text": "حَدَّثَنَا مُوسَى، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ يُوسُفَ بْنِ مَاهَكَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ تَخَلَّفَ النَّبِيُّ صلى الله عليه وسلم عَنَّا فِي سَفْرَةٍ سَافَرْنَاهَا، فَأَدْرَكَنَا وَقَدْ أَرْهَقْنَا الْعَصْرَ، فَجَعَلْنَا نَتَوَضَّأُ وَنَمْسَحُ عَلَى أَرْجُلِنَا، فَنَادَى بِأَعْلَى صَوْتِهِ ‏ \"‏ وَيْلٌ لِلأَعْقَابِ مِنَ النَّارِ ‏\"‏‏.‏ مَرَّتَيْنِ أَوْ ثَلاَثًا‏.‏"
      },
      {
        "id": 164,
        "hadith_number": "164",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Melakukan Wudhu dan Keutamaan Solat Dua Rakaat dengan Khusyuk",
        "perawi_melayu": "Dikisahkan oleh Humran",
        "english_text": "(the freed slave of `Uthman bin `Affan) I saw `Uthman bin `Affan asking (for a tumbler of water) to perform ablution (and when it was brought) he poured water from it over his hands and washed them thrice and then put his right hand in the water container and rinsed his mouth and washed his nose by putting water in it and then blowing it out. Then he washed his face thrice and (then) forearms up to the elbows thrice, then passed his wet hands over his head and then washed each foot thrice. After that `Uthman said, \"I saw the Prophet (ﷺ) performing ablution like this of mine, and he said, 'If anyone performs ablution like that of mine and offers a two-rak`at prayer during which he does not think of anything else (not related to the present prayer) then his past sins will be forgiven. '",
        "malay_translation": " (Hamba yang dibebaskan oleh `Uthman bin `Affan) Saya melihat `Uthman bin `Affan meminta (segelas air) untuk melakukan wuduk. (Apabila dibawa) beliau menuang air ke atas tangannya dan membasuh tangannya tiga kali. Kemudian beliau memasukkan tangan kanannya ke dalam bekas air dan membilas mulutnya dan membasuh hidungnya dengan memasukkan air dan meniupnya keluar. Kemudian beliau membasuh mukanya tiga kali dan (kemudian) lengan hingga ke siku tiga kali, kemudian mengesat tangannya yang basah ke atas kepalanya dan kemudian membasuh setiap kaki tiga kali. Selepas itu `Uthman berkata, \"Saya melihat Nabi SAW melakukan wuduk seperti ini, dan Baginda bersabda, 'Jika seseorang melakukan wuduk sepertiku dan menunaikan solat dua rakaat di mana dia tidak memikirkan perkara lain (yang tidak berkaitan dengan solat sekarang), maka dosa-dosanya yang lalu akan diampunkan.'",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عَطَاءُ بْنُ يَزِيدَ، عَنْ حُمْرَانَ، مَوْلَى عُثْمَانَ بْنِ عَفَّانَ أَنَّهُ رَأَى عُثْمَانَ دَعَا بِوَضُوءٍ، فَأَفْرَغَ عَلَى يَدَيْهِ مِنْ إِنَائِهِ، فَغَسَلَهُمَا ثَلاَثَ مَرَّاتٍ، ثُمَّ أَدْخَلَ يَمِينَهُ فِي الْوَضُوءِ، ثُمَّ تَمَضْمَضَ، وَاسْتَنْشَقَ، وَاسْتَنْثَرَ، ثُمَّ غَسَلَ وَجْهَهُ ثَلاَثًا وَيَدَيْهِ إِلَى الْمِرْفَقَيْنِ ثَلاَثًا، ثُمَّ مَسَحَ بِرَأْسِهِ، ثُمَّ غَسَلَ كُلَّ رِجْلٍ ثَلاَثًا، ثُمَّ قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَتَوَضَّأُ نَحْوَ وُضُوئِي هَذَا وَقَالَ ‏ \"‏ مَنْ تَوَضَّأَ نَحْوَ وُضُوئِي هَذَا ثُمَّ صَلَّى رَكْعَتَيْنِ، لاَ يُحَدِّثُ فِيهِمَا نَفْسَهُ، غَفَرَ اللَّهُ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏‏.‏"
      },
      {
        "id": 165,
        "hadith_number": "165",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Amalan Wuduk yang Sempurna untuk Menjauhkan Diri dari Api Neraka",
        "perawi_melayu": "Dikisahkan oleh Abu Hurairah",
        "english_text": "He passed by us while the people were performing ablution from a utensil containing water, \"Perform ablution perfectly and thoroughly for Abul-Qasim (the Prophet) said, 'Save your heels from the Hell-fire.' \"",
        "malay_translation": "Baginda lalu di hadapan kami ketika orang ramai sedang berwuduk menggunakan bekas yang berisi air. Baginda bersabda, \"Lakukanlah wuduk dengan sempurna dan menyeluruh, kerana Rasulullah SAW pernah bersabda, 'Lindungilah tumit-tumit kamu daripada api neraka.'\"",
        "arabic_text": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ ـ وَكَانَ يَمُرُّ بِنَا وَالنَّاسُ يَتَوَضَّئُونَ مِنَ الْمِطْهَرَةِ ـ قَالَ أَسْبِغُوا الْوُضُوءَ فَإِنَّ أَبَا الْقَاسِمِ صلى الله عليه وسلم قَالَ ‏ \"‏ وَيْلٌ لِلأَعْقَابِ مِنَ النَّارِ ‏\"‏‏.‏"
      },
      {
        "id": 166,
        "hadith_number": "166",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perkara-perkara yang Diamati oleh Ibn Juraij Mengenai `Abdullah bin `Umar",
        "perawi_melayu": "Dikisahkan oleh `Abdullah bin `Umar:",
        "english_text": "\"O Abu `Abdur-Rahman! I saw you doing four things which I never saw being done by anyone of you companions?\" `Abdullah bin `Umar said, \"What are those, O Ibn Juraij?\" I said, \"I never saw you touching any corner of the Ka`ba except these (two) facing south (Yemen) and I saw you wearing shoes made of tanned leather and dyeing your hair with Hinna (a kind of red dye). I also noticed that whenever you were in Mecca, the people assume Ihram on seeing the new moon crescent (1st of Dhul-Hijja) while you did not assume the Ihlal (Ihram) -(Ihram is also called Ihlal which means 'Loud calling' because a Muhrim has to recite Talbiya aloud when assuming the state of Ihram) - till the 8th of Dhul-Hijja (Day of Tarwiya). `Abdullah replied, \"Regarding the corners of Ka`ba, I never saw Allah's Messenger (ﷺ) touching except those facing south (Yemen) and regarding the tanned leather shoes, no doubt I saw Allah's Messenger (ﷺ) wearing non-hairy shoes and he used to perform ablution while wearing the shoes (i.e. wash his feet and then put on the shoes). So I love to wear similar shoes. And about the dyeing of hair with Hinna; no doubt I saw Allah's Messenger (ﷺ) dyeing his hair with it and that is why I like to dye (my hair with it). Regarding Ihral, I did not see Allah's Messenger (ﷺ) assuming Ihral till he set out for Hajj (on the 8th of Dhul-Hijja).\"",
        "malay_translation": "\"Wahai Abu `Abdur-Rahman! Aku memerhatikan engkau melakukan empat perkara yang tidak pernah aku lihat dilakukan oleh sesiapa di kalangan sahabat-sahabatmu?\" `Abdullah bin `Umar bertanya, \"Apakah perkara-perkara itu, wahai Ibn Juraij?\" Aku menjawab, \"Aku tidak pernah melihat engkau menyentuh mana-mana penjuru Kaabah kecuali dua penjuru yang menghadap ke selatan (Yaman) dan aku melihat engkau memakai kasut daripada kulit yang telah diwarna dan mewarnakan rambutmu dengan pacar henna (sejenis pewarna merah). Aku juga memerhatikan bahawa setiap kali engkau berada di Mekah, orang ramai memakai ihram sebaik sahaja melihat bulan sabit (awal Dzulhijjah) manakala engkau tidak memakai ihram sehingga hari ke-8 Dzulhijjah (Hari Tarwiyah).\" `Abdullah menjawab, \"Mengenai penjuru Kaabah, aku tidak pernah melihat Rasulullah SAW menyentuh selain penjuru yang menghadap ke selatan (Yaman). Mengenai kasut daripada kulit yang telah diwarna, aku pasti melihat Rasulullah SAW memakai kasut bukan bulu dan beliau biasa melakukan wuduk sambil memakai kasut (iaitu membasuh kakinya dan kemudian memakai kasut). Oleh itu, aku suka memakai kasut yang sama. Dan mengenai pewarnaan rambut dengan henna; aku pasti melihat Rasulullah SAW mewarnakan rambutnya dengannya dan sebab itulah aku suka mewarna (rambutku dengannya). Mengenai ihram, aku tidak pernah melihat Rasulullah SAW memakai ihram sehingga beliau berangkat ke haji (pada hari ke-8 Dzulhijjah).",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ عُبَيْدِ بْنِ جُرَيْجٍ، أَنَّهُ قَالَ لِعَبْدِ اللَّهِ بْنِ عُمَرَ يَا أَبَا عَبْدِ الرَّحْمَنِ، رَأَيْتُكَ تَصْنَعُ أَرْبَعًا لَمْ أَرَ أَحَدًا مِنْ أَصْحَابِكَ يَصْنَعُهَا‏.‏ قَالَ وَمَا هِيَ يَا ابْنَ جُرَيْجٍ قَالَ رَأَيْتُكَ لاَ تَمَسُّ مِنَ الأَرْكَانِ إِلاَّ الْيَمَانِيَيْنِ، وَرَأَيْتُكَ تَلْبَسُ النِّعَالَ السِّبْتِيَّةَ، وَرَأَيْتُكَ تَصْبُغُ بِالصُّفْرَةِ، وَرَأَيْتُكَ إِذَا كُنْتَ بِمَكَّةَ أَهَلَّ النَّاسُ إِذَا رَأَوُا الْهِلاَلَ وَلَمْ تُهِلَّ أَنْتَ حَتَّى كَانَ يَوْمُ التَّرْوِيَةِ‏.‏ قَالَ عَبْدُ اللَّهِ أَمَّا الأَرْكَانُ فَإِنِّي لَمْ أَرَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَمَسُّ إِلاَّ الْيَمَانِيَيْنِ، وَأَمَّا النِّعَالُ السِّبْتِيَّةُ فَإِنِّي رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَلْبَسُ النَّعْلَ الَّتِي لَيْسَ فِيهَا شَعَرٌ وَيَتَوَضَّأُ فِيهَا، فَأَنَا أُحِبُّ أَنْ أَلْبَسَهَا، وَأَمَّا الصُّفْرَةُ فَإِنِّي رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَصْبُغُ بِهَا، فَأَنَا أُحِبُّ أَنْ أَصْبُغَ بِهَا، وَأَمَّا الإِهْلاَلُ فَإِنِّي لَمْ أَرَ رَسُولَ اللَّهِ صلى الله عليه وسلم يُهِلُّ حَتَّى تَنْبَعِثَ بِهِ رَاحِلَتُهُ‏.‏"
      },
      {
        "id": 167,
        "hadith_number": "167",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Petunjuk Rasulullah SAW Mengenai Mandi Jenazah Anak Perempuan Baginda",
        "perawi_melayu": "Dikisahkan oleh Um-`Atiya:",
        "english_text": "That the Prophet (ﷺ) at the time of washing his deceased daughter had said to them, \"Start from the right side beginning with those parts which are washed in ablution.\"",
        "malay_translation": "Bahwa Nabi SAW ketika memandikan putri beliau yang telah meninggal, telah bersabda kepada mereka, \"Mulailah dari sisi kanan, bermula dengan bagian-bagian yang dibasuh dalam wudhu.\"",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ قَالَ النَّبِيُّ صلى الله عليه وسلم لَهُنَّ فِي غُسْلِ ابْنَتِهِ ‏ \"‏ ابْدَأْنَ بِمَيَامِنِهَا وَمَوَاضِعِ الْوُضُوءِ مِنْهَا ‏\"‏‏.‏"
      },
      {
        "id": 168,
        "hadith_number": "168",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Selalu Meulakan Tindakan Dari Sebelah Kanan",
        "perawi_melayu": "Diriwayatkan oleh `Aisha",
        "english_text": "The Prophet (ﷺ) used to like to start from the right side on wearing shoes, combing his hair and cleaning or washing himself and on doing anything else.",
        "malay_translation": "Nabi SAW suka memulakan sesuatu daripada sebelah kanan, sama ada ketika memakai kasut, menyisir rambut, membersihkan atau membasuh diri, dan apa-apa tindakan yang lain.",
        "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي أَشْعَثُ بْنُ سُلَيْمٍ، قَالَ سَمِعْتُ أَبِي، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُعْجِبُهُ التَّيَمُّنُ فِي تَنَعُّلِهِ وَتَرَجُّلِهِ وَطُهُورِهِ وَفِي شَأْنِهِ كُلِّهِ‏.‏"
      },
      {
        "id": 169,
        "hadith_number": "169",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Penggunaan Air Mandi Oleh Rasulullah SAW Ketika Kehabisan Air",
        "perawi_melayu": "Riwayat Anas bin Malik",
        "english_text": "I saw Allah's Messenger (ﷺ) when the `Asr prayer was due and the people searched for water to perform ablution but they could not find it. Later on (a pot full of) water for ablution was brought to Allah's Apostle . He put his hand in that pot and ordered the people to perform ablution from it. I saw the water springing out from underneath his fingers till all of them performed the ablution (it was one of the miracles of the Prophet).",
        "malay_translation": "Aku melihat Rasulullah SAW ketika waktu solat Asar telah tiba dan orang ramai mencari air untuk bersuci, namun tidak menemui. Kemudian, air untuk bersuci dibawa kepada Rasulullah SAW. Baginda memasukkan tangannya ke dalam bekas air itu dan memerintahkan orang ramai untuk bersuci dengannya. Aku melihat air memancut keluar dari bawah jari-jari Baginda hingga semua mereka selesai bersuci (ini merupakan salah satu mukjizat Baginda SAW).",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَحَانَتْ صَلاَةُ الْعَصْرِ، فَالْتَمَسَ النَّاسُ الْوَضُوءَ فَلَمْ يَجِدُوهُ، فَأُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِوَضُوءٍ، فَوَضَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ذَلِكَ الإِنَاءِ يَدَهُ، وَأَمَرَ النَّاسَ أَنْ يَتَوَضَّئُوا مِنْهُ‏.‏ قَالَ فَرَأَيْتُ الْمَاءَ يَنْبُعُ مِنْ تَحْتِ أَصَابِعِهِ حَتَّى تَوَضَّئُوا مِنْ عِنْدِ آخِرِهِمْ‏.‏"
      },
      {
        "id": 170,
        "hadith_number": "170",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keberkatan Rambut Nabi SAW",
        "perawi_melayu": "Diceritakan oleh `Abida",
        "english_text": "\"Kami ada sebahagian daripada rambut Nabi (ﷺ) yang aku perolehi daripada Anas atau daripada keluarganya.\" Jawab `Abida. \"Tidak syak lagi, sekiranya aku memiliki sehelai rambutnya, ia lebih berharga bagiku daripada seluruh dunia dan apa yang ada padanya.\"",
        "malay_translation": "\"Kami ada sebahagian daripada rambut Nabi (ﷺ) yang aku perolehi daripada Anas atau daripada keluarganya.\" Jawab `Abida.  \"Tidak syak lagi, sekiranya aku memiliki sehelai rambutnya, ia lebih berharga bagiku daripada seluruh dunia dan apa yang ada di dalamnya.\"",
        "arabic_text": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا إِسْرَائِيلُ، عَنْ عَاصِمٍ، عَنِ ابْنِ سِيرِينَ، قَالَ قُلْتُ لِعَبِيدَةَ عِنْدَنَا مِنْ شَعَرِ النَّبِيِّ صلى الله عليه وسلم أَصَبْنَاهُ مِنْ قِبَلِ أَنَسٍ، أَوْ مِنْ قِبَلِ أَهْلِ أَنَسٍ فَقَالَ لأَنْ تَكُونَ عِنْدِي شَعَرَةٌ مِنْهُ أَحَبُّ إِلَىَّ مِنَ الدُّنْيَا وَمَا فِيهَا‏.‏"
      },
      {
        "id": 171,
        "hadith_number": "171",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Menggunting Rambut, Abu Talha Pertama Ambil Rambutnya",
        "perawi_melayu": "Dikisahkan oleh Anas:",
        "english_text": "When Allah's Messenger (ﷺ) got his head shaved, Abu- Talha was the first to take some of his hair.",
        "malay_translation": "Apabila Rasulullah SAW mencukur kepala baginda, Abu Talha adalah orang pertama yang mengambil sebahagian daripada rambut baginda.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، قَالَ أَخْبَرَنَا سَعِيدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا عَبَّادٌ، عَنِ ابْنِ عَوْنٍ، عَنِ ابْنِ سِيرِينَ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمَّا حَلَقَ رَأْسَهُ كَانَ أَبُو طَلْحَةَ أَوَّلَ مَنْ أَخَذَ مِنْ شَعَرِهِ‏.‏"
      },
      {
        "id": 172,
        "hadith_number": "172",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keperluan Membersihkan Bekas Minuman yang Disentuh Anjing",
        "perawi_melayu": "Riwayat Abu Hurairah",
        "english_text": "Allah's Messenger (ﷺ) said, \"If a dog drinks from the utensil of anyone of you it is essential to wash it seven times.\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Jika seekor anjing minum daripada bekas minuman sesiapa di antara kamu, maka perlulah bekas itu dibasuh sebanyak tujuh kali.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا شَرِبَ الْكَلْبُ فِي إِنَاءِ أَحَدِكُمْ فَلْيَغْسِلْهُ سَبْعًا ‏\"‏‏.‏"
      },
      {
        "id": 173,
        "hadith_number": "173",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kebaikan Seorang Lelaki Terhadap Seekor Anjing yang Dahaga",
        "perawi_melayu": "Riwayat Abu Hurairah:",
        "english_text": "The Prophet (ﷺ) said, \"A man saw a dog eating mud from (the severity of) thirst. So, that man took a shoe (and filled it) with water and kept on pouring the water for the dog till it quenched its thirst. So Allah approved of his deed and made him to enter Paradise.\"",
        "malay_translation": "Nabi (ﷺ) bersabda, \"Seorang lelaki melihat seekor anjing memakan tanah kerana dahaga yang amat sangat. Maka lelaki itu mengambil sepasang kasut (dan mengisinya) dengan air dan terus menuang air untuk anjing itu sehingga ia menghilangkan dahaganya. Maka Allah menerima amalannya dan memasukkannya ke dalam Syurga.\"",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ دِينَارٍ، سَمِعْتُ أَبِي، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏ \"‏ أَنَّ رَجُلاً رَأَى كَلْبًا يَأْكُلُ الثَّرَى مِنَ الْعَطَشِ، فَأَخَذَ الرَّجُلُ خُفَّهُ فَجَعَلَ يَغْرِفُ لَهُ بِهِ حَتَّى أَرْوَاهُ، فَشَكَرَ اللَّهُ لَهُ فَأَدْخَلَهُ الْجَنَّةَ ‏\"‏‏.‏"
      },
      {
        "id": 174,
        "hadith_number": "174",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keadaan Anjing di Masjid pada Zaman Rasulullah SAW",
        "perawi_melayu": "Diriwayatkan oleh Abdullah bin Umar",
        "english_text": "\"During the lifetime of Allah's Apostle, the dogs used to urinate, and pass through the mosques (come and go), nevertheless they never used to sprinkle water on it (urine of the dog.)\"",
        "malay_translation": "Pada zaman Rasulullah SAW, anjing-anjing biasa membuang air kecil dan lalu lalang di masjid, namun mereka tidak pernah menyiramnya (air kencing anjing).",
        "arabic_text": "وَقَالَ أَحْمَدُ بْنُ شَبِيبٍ حَدَّثَنَا أَبِي، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي حَمْزَةُ بْنُ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، قَالَ كَانَتِ الْكِلاَبُ تَبُولُ وَتُقْبِلُ وَتُدْبِرُ فِي الْمَسْجِدِ فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمْ يَكُونُوا يَرُشُّونَ شَيْئًا مِنْ ذَلِكَ‏.‏"
      },
      {
        "id": 175,
        "hadith_number": "175",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukum Memburu Dengan Anjing dan Makan Buruan",
        "perawi_melayu": "Dikisahkan oleh `Adi bin Hatim",
        "english_text": "I asked the Prophet (about the hunting dogs) and he replied, \"If you let loose (with Allah's name) your tamed dog after a game and it hunts it, you may eat it, but if the dog eats of (that game) then do not eat it because the dog has hunted it for itself.\" I further said, \"Sometimes I send my dog for hunting and find another dog with it. He said, \"Do not eat the game for you have mentioned Allah's name only on sending your dog and not the other dog.\"",
        "malay_translation": "Aku bertanya kepada Rasulullah (tentang anjing pemburu) dan beliau menjawab, \"Jika kamu melepaskan anjing peliharaanmu (dengan menyebut nama Allah) setelah seekor buruan dan anjing itu memburunya, kamu boleh memakannya. Namun, jika anjing itu yang memakan buruan tersebut, maka jangan memakannya kerana anjing itu telah memburunya untuk dirinya sendiri.\" Aku bertanya lagi, \"Kadang-kadang aku menghantar anjingku untuk memburu dan menemui anjing lain bersamanya. Beliau menjawab, \"Jangan makan buruan itu kerana engkau hanya menyebut nama Allah ketika menghantar anjingmu dan bukannya anjing yang lain.\"",
        "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ ابْنِ أَبِي السَّفَرِ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ إِذَا أَرْسَلْتَ كَلْبَكَ الْمُعَلَّمَ فَقَتَلَ فَكُلْ، وَإِذَا أَكَلَ فَلاَ تَأْكُلْ، فَإِنَّمَا أَمْسَكَهُ عَلَى نَفْسِهِ ‏\"‏‏.‏ قُلْتُ أُرْسِلُ كَلْبِي فَأَجِدُ مَعَهُ كَلْبًا آخَرَ قَالَ ‏\"‏ فَلاَ تَأْكُلْ، فَإِنَّمَا سَمَّيْتَ عَلَى كَلْبِكَ، وَلَمْ تُسَمِّ عَلَى كَلْبٍ آخَرَ ‏\"‏‏.‏"
      },
      {
        "id": 176,
        "hadith_number": "176",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keberadaan Solat Ketika Menunggu Solat di Masjid",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
        "english_text": "Allah's Messenger (ﷺ) said, \"A person is considered in prayer as long as he is waiting for the prayer in the mosque as long as he does not do Hadath.\" A non-Arab man asked, \"O Abu Huraira! What is Hadath?\" I replied, \"It is the passing of wind (from the anus) (that is one of the types of Hadath).\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Seseorang dianggap sedang bersembahyang selagi dia menunggu solat di masjid selagi dia tidak melakukan hadath.\" Seorang lelaki bukan Arab bertanya, \"Wahai Abu Hurairah! Apakah hadath itu?\" Aku menjawab, \"Ia adalah keluarnya angin (dari dubur) (yang merupakan salah satu jenis hadath).\"",
        "arabic_text": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ يَزَالُ الْعَبْدُ فِي صَلاَةٍ مَا كَانَ فِي الْمَسْجِدِ يَنْتَظِرُ الصَّلاَةَ، مَا لَمْ يُحْدِثْ ‏\"‏‏.‏ فَقَالَ رَجُلٌ أَعْجَمِيٌّ مَا الْحَدَثُ يَا أَبَا هُرَيْرَةَ قَالَ الصَّوْتُ‏.‏ يَعْنِي الضَّرْطَةَ‏.‏"
      },
      {
        "id": 177,
        "hadith_number": "177",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Meninggalkan Solat Kecuali Mendengar Bunyi atau Mencium Bau",
        "perawi_melayu": "Dikisahkan oleh `Abbad bin Tamim:",
        "english_text": "The Prophet (ﷺ) said, \"One should not leave his prayer unless he hears sound or smells something.\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Janganlah seseorang meninggalkan solatnya melainkan sekiranya dia mendengar bunyi atau mencium sesuatu bau.\"",
        "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَمِّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَنْصَرِفْ حَتَّى يَسْمَعَ صَوْتًا أَوْ يَجِدَ رِيحًا ‏\"‏‏.‏"
      },
      {
        "id": 178,
        "hadith_number": "178",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Menangani Pengeluaran Lendir Urethra",
        "perawi_melayu": "Dikisahkan oleh Ali bin Abi Talib",
        "english_text": "I used to get emotional urethral discharges frequently and felt shy to ask Allah's Messenger (ﷺ) about it. So I requested Al-Miqdad bin Al-Aswad to ask (the Prophet (ﷺ) ) about it. Al-Miqdad asked him and he replied, \"One has to perform ablution (after it).\"",
        "malay_translation": "Saya pernah mengalami pengeluaran lendir urethral yang kerap dan merasa malu untuk bertanya kepada Rasulullah SAW mengenainya. Maka saya meminta Al-Miqdad bin Al-Aswad untuk bertanya kepada baginda. Al-Miqdad bertanya dan baginda menjawab, \"Seseorang perlu melakukan wuduk (selepasnya).\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ مُنْذِرٍ أَبِي يَعْلَى الثَّوْرِيِّ، عَنْ مُحَمَّدٍ ابْنِ الْحَنَفِيَّةِ، قَالَ قَالَ عَلِيٌّ كُنْتُ رَجُلاً مَذَّاءً، فَاسْتَحْيَيْتُ أَنْ أَسْأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَمَرْتُ الْمِقْدَادَ بْنَ الأَسْوَدِ فَسَأَلَهُ فَقَالَ ‏ \"‏ فِيهِ الْوُضُوءُ ‏\"‏‏.‏ وَرَوَاهُ شُعْبَةُ عَنِ الأَعْمَشِ‏.‏"
      },
      {
        "id": 179,
        "hadith_number": "179",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukum Bersuci Orang Yang Bersetubuh Tanpa Membuang Air Mani",
        "perawi_melayu": "Dikisahkan oleh Zaid bin Khalid:",
        "english_text": "I asked `Uthman bin `Affan about a person who engaged in intercourse but did no discharge. `Uthman replied, \"He should perform ablution like the one for an ordinary prayer but he must wash his penis.\" `Uthman added, \"I heard it from Allah's Messenger (ﷺ).\" I asked `Ali Az-Zubair, Talha and Ubai bin Ka`b about it and they, too, gave the same reply. (This order was canceled later on and taking a bath became necessary for such cases).",
        "malay_translation": "Saya bertanya kepada `Uthman bin `Affan tentang seseorang yang melakukan persetubuhan namun tidak mengeluarkan air mani. `Uthman menjawab, \"Dia perlu melakukan wuduk seperti wuduk solat biasa tetapi dia mesti membasuh zakarnya.\" `Uthman menambah, \"Saya mendengarnya dari Rasulullah (ﷺ).\" Saya bertanya kepada `Ali Az-Zubair, Talha dan Ubai bin Ka`b tentang perkara ini dan mereka juga memberikan jawapan yang sama. (Peraturan ini dibatalkan kemudian dan mandi wajib bagi kes-kes sedemikian).",
        "arabic_text": "حَدَّثَنَا سَعْدُ بْنُ حَفْصٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، أَنَّ عَطَاءَ بْنَ يَسَارٍ، أَخْبَرَهُ أَنْ زَيْدَ بْنَ خَالِدٍ أَخْبَرَهُ أَنَّهُ، سَأَلَ عُثْمَانَ بْنَ عَفَّانَ ـ رضى الله عنه ـ قُلْتُ أَرَأَيْتَ إِذَا جَامَعَ فَلَمْ يُمْنِ قَالَ عُثْمَانُ يَتَوَضَّأُ كَمَا يَتَوَضَّأُ لِلصَّلاَةِ، وَيَغْسِلُ ذَكَرَهُ‏.‏ قَالَ عُثْمَانُ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَسَأَلْتُ عَنْ ذَلِكَ عَلِيًّا، وَالزُّبَيْرَ، وَطَلْحَةَ، وَأُبَىَّ بْنَ كَعْبٍ ـ رضى الله عنهم ـ فَأَمَرُوهُ بِذَلِكَ‏.‏"
      },
      {
        "id": 180,
        "hadith_number": "180",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perintah Mandi Berhubung Kelajuan Dalam Persetubuhan",
        "perawi_melayu": "Diriwayatkan oleh Abu Sa`id Al-Khudri:",
        "english_text": "Allah's Messenger (ﷺ) sent for a Ansari man who came with water dropping from his head. The Prophet (ﷺ) said, \"Perhaps we have forced you to hurry up, haven't we?\" The Ansari replied, \"Yes.\" Allah's Messenger (ﷺ) further said, \"If you are forced to hurry up (during intercourse) or you do not discharge then ablution is due on you (This order was canceled later on, i.e. one has to take a bath).",
        "malay_translation": "Utusan Allah (ﷺ) memanggil seorang lelaki Ansar yang datang dengan air menitis dari kepalanya. Rasulullah (ﷺ) bertanya, \"Adakah kita memaksa kamu untuk cepat, bukan?\" Lelaki Ansar itu menjawab, \"Ya.\" Utusan Allah (ﷺ) selanjutnya berkata, \"Jika kamu dipaksa untuk cepat (semasa persetubuhan) atau tidak mengeluarkan air mani, maka wuduk wajib ke atas kamu (Perintah ini telah dibatalkan kemudian, iaitu mandi wajib).\"",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ، قَالَ أَخْبَرَنَا النَّضْرُ، قَالَ أَخْبَرَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ ذَكْوَانَ أَبِي صَالِحٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَرْسَلَ إِلَى رَجُلٍ مِنَ الأَنْصَارِ فَجَاءَ وَرَأْسُهُ يَقْطُرُ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَعَلَّنَا أَعْجَلْنَاكَ ‏\"‏‏.‏ فَقَالَ نَعَمْ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا أُعْجِلْتَ أَوْ قُحِطْتَ، فَعَلَيْكَ الْوُضُوءُ ‏\"‏‏.‏ تَابَعَهُ وَهْبٌ قَالَ حَدَّثَنَا شُعْبَةُ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ وَلَمْ يَقُلْ غُنْدَرٌ وَيَحْيَى عَنْ شُعْبَةَ الْوُضُوءُ‏.‏"
      },
      {
        "id": 181,
        "hadith_number": "181",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Menunaikan Solat Di Arafah dan Muzdalifah",
        "perawi_melayu": "Dikisahkan oleh Usamah bin Zaid:",
        "english_text": "\"Ketika Rasulullah SAW berangkat dari Arafah, baginda menuju sebuah jalan gunung untuk membuang hajat. (Selepas selesai) aku menuangkan air dan baginda melakukan wuduk. Kemudian aku berkata kepada baginda, \"Wahai Rasulullah SAW! Adakah Baginda akan menunaikan solat?\" Baginda menjawab, \"Tempat sembahyang (Musalla) itu di hadapan kamu (di Muzdalifah).\"",
        "malay_translation": "\"Apabila Rasulullah SAW meninggalkan Arafah, baginda menuju ke satu lorong gunung untuk membuang hajat. Selepas itu, saya menuangkan air dan baginda melakukan wuduk. Kemudian saya bertanya kepada baginda, 'Wahai Rasulullah SAW, adakah Baginda akan menunaikan solat?' Baginda menjawab, 'Tempat sembahyang (Musalla) itu ada di hadapan kamu (di Muzdalifah).'",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ يَحْيَى، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنْ أُسَامَةَ بْنِ زَيْدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمَّا أَفَاضَ مِنْ عَرَفَةَ عَدَلَ إِلَى الشِّعْبِ، فَقَضَى حَاجَتَهُ‏.‏ قَالَ أُسَامَةُ بْنُ زَيْدٍ فَجَعَلْتُ أَصُبُّ عَلَيْهِ وَيَتَوَضَّأُ فَقُلْتُ يَا رَسُولَ اللَّهِ أَتُصَلِّي فَقَالَ ‏ \"‏ الْمُصَلَّى أَمَامَكَ ‏\"‏‏.‏"
      },
      {
        "id": 182,
        "hadith_number": "182",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Mandi dan Wudhuk Semasa Perjalanan",
        "perawi_melayu": "Al-Mughira bin Shu`ba meriwayatkan:",
        "english_text": "I was in the company of Allah's Messenger (ﷺ) on one of the journeys and he went out to answer the call of nature (and after he finished) I poured water and he performed ablution; he washed his face, forearms and passed his wet hand over his head and over the two Khuff (socks made from thick fabric or leather).",
        "malay_translation": "Saya bersama Rasulullah SAW dalam salah satu perjalanan dan baginda keluar untuk membuang air kecil (dan selepas selesai), saya menuang air dan baginda melakukan wudhuk; baginda membasuh wajah, kedua-dua lengan hingga ke siku dan melepasi tangannya yang basah ke atas kepalanya dan ke atas kedua-dua khuff (stokin daripada kain tebal atau kulit). ",
        "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، قَالَ أَخْبَرَنِي سَعْدُ بْنُ إِبْرَاهِيمَ، أَنَّ نَافِعَ بْنَ جُبَيْرِ بْنِ مُطْعِمٍ، أَخْبَرَهُ أَنَّهُ، سَمِعَ عُرْوَةَ بْنَ الْمُغِيرَةِ بْنِ شُعْبَةَ، يُحَدِّثُ عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، أَنَّهُ كَانَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي سَفَرٍ، وَأَنَّهُ ذَهَبَ لِحَاجَةٍ لَهُ، وَأَنَّ مُغِيرَةَ جَعَلَ يَصُبُّ الْمَاءَ عَلَيْهِ، وَهُوَ يَتَوَضَّأُ، فَغَسَلَ وَجْهَهُ وَيَدَيْهِ وَمَسَحَ بِرَأْسِهِ وَمَسَحَ عَلَى الْخُفَّيْنِ‏.‏"
      },
      {
        "id": 183,
        "hadith_number": "183",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pengalaman Malam di Rumah Maimunah, Isteri Rasulullah SAW dan Solat Nabi SAW",
        "perawi_melayu": "Dikisahkan oleh `Abdullah bin `Abbas",
        "english_text": "That he stayed overnight in the house of Maimuna the wife of the Prophet, his aunt. He added : I lay on the bed (cushion transversally) while Allah's Messenger (ﷺ) and his wife lay in the lengthwise direction of the cushion. Allah's Messenger (ﷺ) slept till the middle of the night, either a bit before or a bit after it and then woke up, rubbing the traces of sleep off his face with his hands. He then, recited the last ten verses of Sura Al-`Imran, got up and went to a hanging water-skin. He then Performed the ablution from it and it was a perfect ablution, and then stood up to offer the prayer. I, too, got up and did as the Prophet had done. Then I went and stood by his side. He placed his right hand on my head and caught my right ear and twisted it. He prayed two rak`at then two rak`at and two rak`at and then two rak`at and then two rak`at and then two rak`at (separately six times), and finally one rak`a (the witr). Then he lay down again in the bed till the Mu'adh-dhin came to him where upon the Prophet (ﷺ) got up, offered a two light rak`at prayer and went out and led the Fajr prayer.",
        "malay_translation": "Dikatakan bahawa beliau menginap di rumah Maimunah, isteri Nabi SAW dan juga bibinya. Beliau menambahkan, \"Saya berbaring di atas tilam (dengan posisi melintang), manakala Rasulullah SAW dan isterinya berbaring dengan arah tilam yang memanjang. Rasulullah SAW tidur hingga tengah malam, sedikit sebelum atau sedikit sesudahnya, lalu terbangun, mengusap sisa-sisa tidur dari wajahnya dengan tangannya. Kemudian, baginda membaca sepuluh ayat terakhir Surah Al-`Imran, bangun dan pergi ke tempat air minuman yang tergantung. Baginda kemudian mengambil wuduk daripadanya dan ia adalah wuduk yang sempurna, kemudian berdiri untuk solat. Saya pun turut bangun dan melakukan apa yang telah dilakukan oleh Nabi SAW. Kemudian saya berdiri di sisi baginda. Baginda meletakkan tangan kanannya di atas kepala saya dan memegang telinga kanan saya dan memutarnya. Baginda mendirikan solat dua rakaat, kemudian dua rakaat, dua rakaat, dua rakaat, dua rakaat, dan dua rakaat (enam kali secara berasingan), dan akhirnya satu rakaat (solat witir). Kemudian baginda kembali berbaring di atas tilam sehingga muadzin datang kepadanya, lalu Rasulullah SAW bangun, mendirikan solat dua rakaat ringan, dan keluar untuk mengetuai solat Subuh.",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّهُ، بَاتَ لَيْلَةً عِنْدَ مَيْمُونَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم وَهِيَ خَالَتُهُ فَاضْطَجَعْتُ فِي عَرْضِ الْوِسَادَةِ، وَاضْطَجَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَهْلُهُ فِي طُولِهَا، فَنَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى إِذَا انْتَصَفَ اللَّيْلُ، أَوْ قَبْلَهُ بِقَلِيلٍ أَوْ بَعْدَهُ بِقَلِيلٍ، اسْتَيْقَظَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَجَلَسَ يَمْسَحُ النَّوْمَ عَنْ وَجْهِهِ بِيَدِهِ، ثُمَّ قَرَأَ الْعَشْرَ الآيَاتِ الْخَوَاتِمَ مِنْ سُورَةِ آلِ عِمْرَانَ، ثُمَّ قَامَ إِلَى شَنٍّ مُعَلَّقَةٍ، فَتَوَضَّأَ مِنْهَا فَأَحْسَنَ وُضُوءَهُ، ثُمَّ قَامَ يُصَلِّي‏.‏ قَالَ ابْنُ عَبَّاسٍ فَقُمْتُ فَصَنَعْتُ مِثْلَ مَا صَنَعَ، ثُمَّ ذَهَبْتُ، فَقُمْتُ إِلَى جَنْبِهِ، فَوَضَعَ يَدَهُ الْيُمْنَى عَلَى رَأْسِي، وَأَخَذَ بِأُذُنِي الْيُمْنَى، يَفْتِلُهَا، فَصَلَّى رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ أَوْتَرَ، ثُمَّ اضْطَجَعَ، حَتَّى أَتَاهُ الْمُؤَذِّنُ، فَقَامَ، فَصَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ، ثُمَّ خَرَجَ فَصَلَّى الصُّبْحَ‏.‏"
      },
      {
        "id": 184,
        "hadith_number": "184",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pengalaman Gerhana Matahari dan Ujian di Kubur",
        "perawi_melayu": "Dikisahkan oleh Asma' binti Abu Bakar:",
        "english_text": "I came to `Aisha the wife of the Prophet (ﷺ) during the solar eclipse. The people were standing and offering the prayer and she was also praying. I asked her, \"What is wrong with the people?\" She beckoned with her hand towards the sky and said, \"Subhan Allah.\" I asked her, \"Is there a sign?\" She pointed out, \"Yes.\" So I, too, stood for the prayer till I fell unconscious and later on I poured water on my head. After the prayer, Allah's Messenger (ﷺ) praised and glorified Allah and said, \"Just now I have seen something which I never saw before at this place of mine, including Paradise and Hell. I have been inspired (and have understood) that you will be put to trials in your graves and these trials will be like the trials of Ad-Dajjal, or nearly like it (the sub narrator is not sure of what Asma' said). Angels will come to every one of you and ask, 'What do you know about this man?' A believer will reply, 'He is Muhammad, Allah's Messenger (ﷺ) , and he came to us with self-evident truth and guidance. So we accepted his teaching, believed and followed him.' Then the angels will say to him to sleep in peace as they have come to know that he was a believer. On the other hand a hypocrite or a doubtful person will reply, 'I do not know but heard the people saying something and so I said the same.' \"",
        "malay_translation": "Saya datang menemui `Aisha, isteri Nabi (ﷺ), ketika berlaku gerhana matahari. Orang ramai berdiri dan menunaikan solat, dan beliau juga sedang solat. Saya bertanya, \"Apa yang berlaku kepada orang ramai?\" Beliau mengisyaratkan dengan tangannya ke arah langit dan berkata, \"Subhanallah.\" Saya bertanya lagi, \"Adakah tanda?\" Beliau mengangguk, \"Ya.\" Oleh itu, saya turut berdiri untuk solat sehingga saya pengsan dan kemudiannya saya menyiram kepala dengan air. Setelah solat, Rasulullah (ﷺ) memuji dan memuliakan Allah dan berkata, \"Baru-baru ini, saya telah melihat sesuatu yang belum pernah saya lihat sebelum ini di tempatku ini, termasuk Syurga dan Neraka. Saya mendapat ilham (dan memahami) bahawa kamu akan diuji di kuburmu, dan ujian tersebut akan seperti ujian Ad-Dajjal, atau hampir seperti itu (pencerita tambahan tidak pasti akan apa yang dikatakan Asma'). Malaikat akan datang kepada setiap kamu dan bertanya, 'Apa yang kamu ketahui tentang lelaki ini?' Seorang Mukmin akan menjawab, 'Dia adalah Muhammad, Utusan Allah (ﷺ), dan dia datang kepada kita dengan kebenaran dan petunjuk yang nyata. Oleh itu, kita menerima ajarannya, beriman dan mengikutnya.' Kemudian malaikat akan memberitahunya untuk tidur dengan aman kerana mereka telah mengetahui bahawa dia seorang Mukmin. Sebaliknya, seorang munafik atau orang yang ragu-ragu akan menjawab, 'Saya tidak tahu, tetapi saya mendengar orang ramai berkata sesuatu dan oleh itu, saya berkata demikian juga.'.",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنِ امْرَأَتِهِ، فَاطِمَةَ عَنْ جَدَّتِهَا، أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ أَنَّهَا قَالَتْ أَتَيْتُ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم حِينَ خَسَفَتِ الشَّمْسُ، فَإِذَا النَّاسُ قِيَامٌ يُصَلُّونَ، وَإِذَا هِيَ قَائِمَةٌ تُصَلِّي فَقُلْتُ مَا لِلنَّاسِ فَأَشَارَتْ بِيَدِهَا نَحْوَ السَّمَاءِ وَقَالَتْ سُبْحَانَ اللَّهِ‏.‏ فَقُلْتُ آيَةٌ فَأَشَارَتْ أَىْ نَعَمْ‏.‏ فَقُمْتُ حَتَّى تَجَلاَّنِي الْغَشْىُ، وَجَعَلْتُ أَصُبُّ فَوْقَ رَأْسِي مَاءً، فَلَمَّا انْصَرَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ، ثُمَّ قَالَ ‏ \"‏ مَا مِنْ شَىْءٍ كُنْتُ لَمْ أَرَهُ إِلاَّ قَدْ رَأَيْتُهُ فِي مَقَامِي هَذَا حَتَّى الْجَنَّةِ وَالنَّارِ، وَلَقَدْ أُوحِيَ إِلَىَّ أَنَّكُمْ تُفْتَنُونَ فِي الْقُبُورِ مِثْلَ أَوْ قَرِيبًا مِنْ فِتْنَةِ الدَّجَّالِ ـ لاَ أَدْرِي أَىَّ ذَلِكَ قَالَتْ أَسْمَاءُ ـ يُؤْتَى أَحَدُكُمْ فَيُقَالُ مَا عِلْمُكَ بِهَذَا الرَّجُلِ فَأَمَّا الْمُؤْمِنُ ـ أَوِ الْمُوقِنُ لاَ أَدْرِي أَىَّ ذَلِكَ قَالَتْ أَسْمَاءُ ـ فَيَقُولُ هُوَ مُحَمَّدٌ رَسُولُ اللَّهِ، جَاءَنَا بِالْبَيِّنَاتِ وَالْهُدَى، فَأَجَبْنَا وَآمَنَّا وَاتَّبَعْنَا، فَيُقَالُ نَمْ صَالِحًا، فَقَدْ عَلِمْنَا إِنْ كُنْتَ لَمُؤْمِنًا، وَأَمَّا الْمُنَافِقُ ـ أَوِ الْمُرْتَابُ لاَ أَدْرِي أَىَّ ذَلِكَ قَالَتْ أَسْمَاءُ ـ فَيَقُولُ لاَ أَدْرِي، سَمِعْتُ النَّاسَ يَقُولُونَ شَيْئًا فَقُلْتُهُ ‏\"‏‏.‏"
      },
      {
        "id": 185,
        "hadith_number": "185",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Melakukan Wudhu",
        "perawi_melayu": "Dikisahkan oleh Yahya Al-Mazini:",
        "english_text": "A person asked `Abdullah bin Zaid رضی اللہ عنہ who was the grandfather of `Amr bin Yahya, \"Can you show me how Allah's Messenger (ﷺ) used to perform ablution?\" `Abdullah bin Zaid رضی اللہ عنہ replied in the affirmative and asked for water. He poured it on his hands and washed them twice, then he rinsed his mouth thrice and washed his nose with water thrice by putting water in it and blowing it out. He washed his face thrice and after that he washed his forearms up to the elbows twice and then passed his wet hands over his head from its front to its back and vice versa (beginning from the front and taking them to the back of his head up to the nape of the neck and then brought them to the front again from where he had started) and washed his feet (up to the ankles).",
        "malay_translation": "Seseorang bertanya kepada `Abdullah bin Zaid, yang merupakan datuk kepada `Amr bin Yahya, \"Bolehkah anda tunjukkan kepada saya bagaimana Rasulullah SAW melakukan wuduk?\" `Abdullah bin Zaid menjawab ya dan meminta air. Kemudian, beliau menuang air ke atas tangannya dan membasuhnya dua kali, kemudian membilas mulutnya tiga kali dan membasuh hidungnya tiga kali dengan memasukkan air ke dalam hidung dan meniupnya keluar. Beliau membasuh wajahnya tiga kali dan selepas itu, membasuh kedua-dua lengannya hingga ke siku dua kali. Kemudian, beliau mengusapkan tangannya yang basah ke atas kepalanya dari hadapan ke belakang dan sebaliknya (memulakan dari hadapan dan membawanya ke belakang kepala hingga ke tengkuk, kemudian membawanya ke hadapan semula dari mana ia bermula) dan membasuh kedua-dua kakinya (sehingga ke buku lali).",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ، عَنْ أَبِيهِ، أَنَّ رَجُلاً، قَالَ لِعَبْدِ اللَّهِ بْنِ زَيْدٍ ـ وَهُوَ جَدُّ عَمْرِو بْنِ يَحْيَى ـ أَتَسْتَطِيعُ أَنْ تُرِيَنِي، كَيْفَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَتَوَضَّأُ فَقَالَ عَبْدُ اللَّهِ بْنُ زَيْدٍ نَعَمْ‏.‏ فَدَعَا بِمَاءٍ، فَأَفْرَغَ عَلَى يَدَيْهِ فَغَسَلَ يَدَهُ مَرَّتَيْنِ، ثُمَّ مَضْمَضَ وَاسْتَنْثَرَ ثَلاَثًا، ثُمَّ غَسَلَ وَجْهَهُ ثَلاَثًا، ثُمَّ غَسَلَ يَدَيْهِ مَرَّتَيْنِ مَرَّتَيْنِ إِلَى الْمِرْفَقَيْنِ، ثُمَّ مَسَحَ رَأْسَهُ بِيَدَيْهِ، فَأَقْبَلَ بِهِمَا وَأَدْبَرَ، بَدَأَ بِمُقَدَّمِ رَأْسِهِ، حَتَّى ذَهَبَ بِهِمَا إِلَى قَفَاهُ، ثُمَّ رَدَّهُمَا إِلَى الْمَكَانِ الَّذِي بَدَأَ مِنْهُ، ثُمَّ غَسَلَ رِجْلَيْهِ‏.‏"
      },
      {
        "id": 186,
        "hadith_number": "186",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Mandi Wudhu",
        "perawi_melayu": "Diceritakan oleh `Amr:",
        "english_text": "My father saw `Amr bin Abi Hasan asking `Abdullah bin Zaid about the ablution of the Prophet. `Abdullah bin Zaid asked for earthenware pot containing water and in front of them performed ablution like that of the Prophet (ﷺ) . He poured water from the pot over his hand and washed his hands thrice and then he put his hands in the pot and rinsed his mouth and washed his nose by putting water in it and then blowing it out with three handfuls of water. Again he put his hand in the water and washed his face thrice and washed his forearms up to the elbows twice; and then put his hands in the water and then passed them over his head by bringing them to the front and then to the rear of the head once, and then he washed his feet up to the ankles.",
        "malay_translation": "Bapakku melihat `Amr bin Abi Hasan bertanya kepada `Abdullah bin Zaid tentang wudhu Rasulullah SAW. `Abdullah bin Zaid meminta periuk tanah liat berisi air, dan di hadapan mereka, beliau melakukan wudhu seperti yang dilakukan oleh Rasulullah SAW. Beliau menuangkan air dari periuk ke tangannya dan membasuh tangannya sebanyak tiga kali, kemudian memasukkan tangannya ke dalam periuk dan membilas mulutnya serta mencuci hidungnya dengan memasukkan air dan meniupnya keluar dengan tiga kali cetakan air. Kemudian beliau memasukkan tangannya ke dalam air dan membasuh mukanya sebanyak tiga kali dan membasuh kedua lengannya hingga siku sebanyak dua kali; dan kemudian memasukkan tangannya ke dalam air dan mengusapkannya ke atas kepalanya dengan melepaskannya ke hadapan dan ke belakang kepala sekali, dan kemudian beliau mencuci kakinya hingga buku lali.",
        "arabic_text": "حَدَّثَنَا مُوسَى، قَالَ حَدَّثَنَا وُهَيْبٌ، عَنْ عَمْرٍو، عَنْ أَبِيهِ، شَهِدْتُ عَمْرَو بْنَ أَبِي حَسَنٍ سَأَلَ عَبْدَ اللَّهِ بْنَ زَيْدٍ عَنْ وُضُوءِ النَّبِيِّ، صلى الله عليه وسلم فَدَعَا بِتَوْرٍ مِنْ مَاءٍ، فَتَوَضَّأَ لَهُمْ وُضُوءَ النَّبِيِّ صلى الله عليه وسلم فَأَكْفَأَ عَلَى يَدِهِ مِنَ التَّوْرِ، فَغَسَلَ يَدَيْهِ ثَلاَثًا، ثُمَّ أَدْخَلَ يَدَهُ فِي التَّوْرِ، فَمَضْمَضَ وَاسْتَنْشَقَ وَاسْتَنْثَرَ ثَلاَثَ غَرَفَاتٍ، ثُمَّ أَدْخَلَ يَدَهُ فَغَسَلَ وَجْهَهُ ثَلاَثًا، ثُمَّ أَدْخَلَ يَدَهُ فَغَسَلَ يَدَيْهِ مَرَّتَيْنِ إِلَى الْمِرْفَقَيْنِ مَرَّتَيْنِ، ثُمَّ أَدْخَلَ يَدَهُ فَمَسَحَ رَأْسَهُ، فَأَقْبَلَ بِهِمَا وَأَدْبَرَ مَرَّةً وَاحِدَةً، ثُمَّ غَسَلَ رِجْلَيْهِ إِلَى الْكَعْبَيْنِ‏.‏"
      },
      {
        "id": 187,
        "hadith_number": "187",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Menunaikan Solat Zuhur dan Asar di Waktu Siang dengan Penggunaan Air Wudhuk",
        "perawi_melayu": "Dikisahkan oleh Abu Juhaifa:",
        "english_text": "Allah's Messenger (ﷺ) came to us at noon and water for ablution was brought to him. After he had performed ablution, the remaining water was taken by the people and they started smearing their bodies with it (as a blessed thing). The Prophet (ﷺ) offered two rak`at of the Zuhr prayer and then two rak`at of the `Asr prayer while a short spear (or stick) was there (as a Sutra) in front of him.",
        "malay_translation": "Utusan Allah SAW datang kepada kita pada waktu tengah hari, dan air wuduk telah dibawa kepadanya. Selepas beliau selesai berwuduk, orang ramai mengambil air yang tinggal dan mula menggosokkan badan mereka dengannya (sebagai sesuatu yang diberkati). Nabi SAW menunaikan dua rakaat solat Zuhur dan kemudian dua rakaat solat Asar, sambil sebatang tombak kecil (atau kayu) diletakkan di hadapan baginda (sebagai sutrah).",
        "arabic_text": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا الْحَكَمُ، قَالَ سَمِعْتُ أَبَا جُحَيْفَةَ، يَقُولُ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْهَاجِرَةِ، فَأُتِيَ بِوَضُوءٍ فَتَوَضَّأَ، فَجَعَلَ النَّاسُ يَأْخُذُونَ مِنْ فَضْلِ وَضُوئِهِ فَيَتَمَسَّحُونَ بِهِ، فَصَلَّى النَّبِيُّ صلى الله عليه وسلم الظُّهْرَ رَكْعَتَيْنِ وَالْعَصْرَ رَكْعَتَيْنِ، وَبَيْنَ يَدَيْهِ عَنَزَةٌ‏.‏"
      },
      {
        "id": 188,
        "hadith_number": "188",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Petunjuk Nabi SAW Mengenai Penggunaan Air dalam Tumbler",
        "perawi_melayu": "Abu Musa berkata:",
        "english_text": "The Prophet asked for a tumbler containing water and washed both his hands and face in it and then threw a mouthful of water in the tumbler and said to both of us (Abu Musa and Bilal), \"Drink from the tumbler and pour some of its water on your faces and chests.\"",
        "malay_translation": "Nabi SAW meminta sebuah cawan berisi air dan membasuh kedua tangan dan mukanya dengannya. Kemudian, baginda memuntahkan sedikit air ke dalam cawan itu dan bersabda kepada kami berdua (Abu Musa dan Bilal), \"Minumlah dari cawan ini dan siramkan sedikit airnya ke muka dan dada kamu.\"",
        "arabic_text": "وَقَالَ أَبُو مُوسَى دَعَا النَّبِيُّ صلى الله عليه وسلم بِقَدَحٍ فِيهِ مَاءٌ، فَغَسَلَ يَدَيْهِ وَوَجْهَهُ فِيهِ، وَمَجَّ فِيهِ ثُمَّ قَالَ لَهُمَا اشْرَبَا مِنْهُ، وَأَفْرِغَا عَلَى وُجُوهِكُمَا وَنُحُورِكُمَا‏.‏"
      },
      {
        "id": 189,
        "hadith_number": "189",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keinginan Besar Para Sahabat Terhadap Air Wudhuk Nabi SAW",
        "perawi_melayu": "Dikisahkan oleh Ibn Shihab:",
        "english_text": "Mahmud bin Ar-Rabi` yang merupakan orang yang wajahnya terkena percikan air dari sumur keluarganya ketika Nabi SAW memuntahkan air dari mulutnya sewaktu dia masih kecil, dan `Urwa (berdasarkan keterangan Al-Miswar dan yang lain) yang saling menyaksikan, berkata, \"Setiap kali Nabi SAW berwudhuk, para sahabatnya hampir berkelahi untuk mendapatkan sisa air wudhuk.\"",
        "malay_translation": "Mahmud bin Ar-Rabi', yang wajahnya terkena percikan air dari sumur keluarganya ketika Baginda Nabi SAW memuntahkan air dari mulutnya sewaktu dia masih kecil, dan `Urwa (berdasarkan keterangan Al-Miswar dan lain-lain) yang saling menyaksikan, berkata, \"Setiap kali Nabi SAW berwudhuk, para sahabatnya hampir berkelahi untuk mendapatkan sisa air wudhuk.\"",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، قَالَ حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي مَحْمُودُ بْنُ الرَّبِيعِ، قَالَ وَهُوَ الَّذِي مَجَّ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي وَجْهِهِ وَهْوَ غُلاَمٌ مِنْ بِئْرِهِمْ‏.‏ وَقَالَ عُرْوَةُ عَنِ الْمِسْوَرِ وَغَيْرِهِ يُصَدِّقُ كُلُّ وَاحِدٍ مِنْهُمَا صَاحِبَهُ وَإِذَا تَوَضَّأَ النَّبِيُّ صلى الله عليه وسلم كَادُوا يَقْتَتِلُونَ عَلَى وَضُوئِهِ‏.‏"
      },
      {
        "id": 190,
        "hadith_number": "190",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Doa Nabi SAW Untuk Pesakit",
        "perawi_melayu": "As-Sa'ib bin Yazid meriwayatkan:",
        "english_text": "My aunt took me to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! This son of my sister has got a disease in his legs.\" So he passed his hands on my head and prayed for Allah's blessings for me; then he performed ablution and I drank from the remaining water. I stood behind him and saw the seal of Prophethood between his shoulders, and it was like the \"Zir-al-Hijla\" (means the button of a small tent, but some said 'egg of a partridge.' etc.)",
        "malay_translation": "Paman saya membawa saya kepada Nabi (ﷺ) dan berkata, \"Wahai Rasulullah (ﷺ)! Anak saudara perempuan saya ini menghidap penyakit pada kakinya.\" Maka baginda meletakkan kedua-dua tangannya ke atas kepala saya dan mendoakan keberkatan Allah untuk saya; kemudian baginda melakukan wuduk dan saya minum daripada air yang tinggal. Saya berdiri di belakang baginda dan melihat tanda kenabian di antara kedua-dua bahu baginda, dan ia menyerupai \"Zir-al-Hijla\" (yang bermaksud butang khemah kecil, tetapi ada yang mengatakan 'telur burung puyuh'. dan sebagainya).",
        "arabic_text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ يُونُسَ، قَالَ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنِ الْجَعْدِ، قَالَ سَمِعْتُ السَّائِبَ بْنَ يَزِيدَ، يَقُولُ ذَهَبَتْ بِي خَالَتِي إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ، إِنَّ ابْنَ أُخْتِي وَجِعٌ‏.‏ فَمَسَحَ رَأْسِي وَدَعَا لِي بِالْبَرَكَةِ، ثُمَّ تَوَضَّأَ فَشَرِبْتُ مِنْ وَضُوئِهِ، ثُمَّ قُمْتُ خَلْفَ ظَهْرِهِ، فَنَظَرْتُ إِلَى خَاتَمِ النُّبُوَّةِ بَيْنَ كَتِفَيْهِ مِثْلِ زِرِّ الْحَجَلَةِ‏.‏"
      },
      {
        "id": 191,
        "hadith_number": "191",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Mandi Wuduk Rasulullah SAW (Berdasarkan Riwayat Sahih Bukhari)",
        "perawi_melayu": "Diceritakan oleh bapa kepada `Amr bin Yahya",
        "english_text": "`Abdullah bin Zaid poured water on his hands from a utensil containing water and washed them and then with one handful of water he rinsed his mouth and cleaned his nose by putting water in it and then blowing it out. He repeated it thrice. He, then, washed his hands and forearms up to the elbows twice and passed wet hands over his head, both forwards and backwards, and washed his feet up to the ankles and said, \"This is the ablution of Allah's Messenger (ﷺ).\"",
        "malay_translation": "`Abdullah bin Zaid menuang air ke tangannya dari bekas yang berisi air dan membasuhnya. Kemudian dengan segenggam air, dia membilas mulutnya dan membersihkan hidungnya dengan memasukkan air ke dalamnya dan meniupnya keluar. Dia mengulanginya sebanyak tiga kali. Kemudian, dia membasuh tangan dan lengannya hingga siku sebanyak dua kali dan mengusap kepalanya dengan tangan yang basah, ke depan dan ke belakang. Kemudian dia membasuh kakinya hingga buku lali. Dia berkata, \"Inilah wuduk Rasulullah SAW.\"",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا عَمْرُو بْنُ يَحْيَى، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ، أَنَّهُ أَفْرَغَ مِنَ الإِنَاءِ عَلَى يَدَيْهِ فَغَسَلَهُمَا، ثُمَّ غَسَلَ أَوْ مَضْمَضَ، وَاسْتَنْشَقَ مِنْ كَفَّةٍ وَاحِدَةٍ، فَفَعَلَ ذَلِكَ ثَلاَثًا، فَغَسَلَ يَدَيْهِ إِلَى الْمِرْفَقَيْنِ مَرَّتَيْنِ مَرَّتَيْنِ، وَمَسَحَ بِرَأْسِهِ مَا أَقْبَلَ وَمَا أَدْبَرَ، وَغَسَلَ رِجْلَيْهِ إِلَى الْكَعْبَيْنِ، ثُمَّ قَالَ هَكَذَا وُضُوءُ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 192,
        "hadith_number": "192",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Melakukan Wuduk:  Penjelasan dari Abdullah bin Zaid",
        "perawi_melayu": "Dikisahkan oleh `Amr bin Yahya",
        "english_text": "My father said, \"I saw `Amr bin Abi Hasan asking `Abdullah bin Zaid about the ablution of the Prophet. `Abdullah bin Zaid asked for an earthenware pot containing water and performed ablution in front of them. He poured water over his hands and washed them thrice. Then he put his (right) hand in the pot and rinsed his mouth and washed his nose by putting water in it and then blowing it out thrice with three handfuls of water Again he put his hand in the water and washed his face thrice. After that he put his hand in the pot and washed his forearms up to the elbows twice and then again put his hand in the water and passed wet hands over his head by bringing them to the front and then to the back and once more he put his hand in the pot and washed his feet (up to the ankles.)\" Narrated Wuhaib: That he (the Prophet (ﷺ) in narration 191 above) had passed his wet hands on the head once only.",
        "malay_translation": "Ayahku berkata, \"Aku melihat `Amr bin Abi Hasan bertanya kepada `Abdullah bin Zaid tentang cara Rasulullah SAW berwuduk. `Abdullah bin Zaid meminta periuk tanah liat berisi air dan berwuduk di hadapan mereka. Beliau menuangkan air ke atas tangannya dan mencucinya tiga kali. Kemudian beliau memasukkan tangan kanannya ke dalam periuk dan membilas mulutnya serta mencuci hidungnya dengan memasukkan air ke dalam hidung dan meniupnya keluar sebanyak tiga kali dengan menggunakan tiga genggam air. Kemudian beliau memasukkan tangannya ke dalam air dan mencuci mukanya tiga kali. Selepas itu, beliau memasukkan tangannya ke dalam periuk dan mencuci lengannya hingga ke siku dua kali. Kemudian beliau memasukkan tangannya ke dalam air dan mengusapkan tangannya yang basah ke atas kepalanya dengan menggerakkannya ke depan dan ke belakang sekali. Dan sekali lagi beliau memasukkan tangannya ke dalam periuk dan mencuci kakinya hingga ke buku lali.\" Wuhaib meriwayatkan bahawa baginda (Rasulullah SAW dalam riwayat sebelumnya, hadis 191) hanya mengusapkan tangannya yang basah sekali sahaja ke atas kepalanya.",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا وُهَيْبٌ، قَالَ حَدَّثَنَا عَمْرُو بْنُ يَحْيَى، عَنْ أَبِيهِ، قَالَ شَهِدْتُ عَمْرَو بْنَ أَبِي حَسَنٍ سَأَلَ عَبْدَ اللَّهِ بْنَ زَيْدٍ عَنْ وُضُوءِ النَّبِيِّ، صلى الله عليه وسلم فَدَعَا بِتَوْرٍ مِنْ مَاءٍ، فَتَوَضَّأَ لَهُمْ، فَكَفَأَ عَلَى يَدَيْهِ فَغَسَلَهُمَا ثَلاَثًا، ثُمَّ أَدْخَلَ يَدَهُ فِي الإِنَاءِ، فَمَضْمَضَ وَاسْتَنْشَقَ، وَاسْتَنْثَرَ ثَلاَثًا بِثَلاَثِ غَرَفَاتٍ مِنْ مَاءٍ، ثُمَّ أَدْخَلَ يَدَهُ فِي الإِنَاءِ، فَغَسَلَ وَجْهَهُ ثَلاَثًا، ثُمَّ أَدْخَلَ يَدَهُ فِي الإِنَاءِ، فَغَسَلَ يَدَيْهِ إِلَى الْمِرْفَقَيْنِ مَرَّتَيْنِ مَرَّتَيْنِ، ثُمَّ أَدْخَلَ يَدَهُ فِي الإِنَاءِ، فَمَسَحَ بِرَأْسِهِ فَأَقْبَلَ بِيَدَيْهِ وَأَدْبَرَ بِهِمَا، ثُمَّ أَدْخَلَ يَدَهُ فِي الإِنَاءِ فَغَسَلَ رِجْلَيْهِ‏.‏ وَحَدَّثَنَا مُوسَى قَالَ حَدَّثَنَا وُهَيْبٌ قَالَ مَسَحَ رَأْسَهُ مَرَّةً‏.‏"
      },
      {
        "id": 193,
        "hadith_number": "193",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Wudhuk Bersama Lelaki dan Wanita pada Zaman Rasulullah SAW",
        "perawi_melayu": "Dikisahkan oleh Abdullah bin 'Umar:",
        "english_text": "\"During the lifetime of Allah's Messenger (ﷺ) men and women used to perform ablution together.\"",
        "malay_translation": "\"Pada zaman Rasulullah SAW, lelaki dan wanita biasa melakukan wuduk bersama-sama.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ كَانَ الرِّجَالُ وَالنِّسَاءُ يَتَوَضَّئُونَ فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم جَمِيعًا‏.‏"
      },
      {
        "id": 194,
        "hadith_number": "194",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pewarisan dalam Islam: Hadis Rasulullah SAW tentang Fara'id",
        "perawi_melayu": "Jabir bin Abdillah r.a.",
        "english_text": "Allah's Messenger (ﷺ) came to visit me while I was sick and unconscious. He performed ablution and sprinkled the remaining water on me and I became conscious and said, \"O Allah's Messenger (ﷺ)! To whom will my inheritance go as I have neither ascendants nor descendants?\" Then the Divine verses regarding Fara'id (inheritance) were revealed.",
        "malay_translation": "Utusan Allah (ﷺ) datang melawat saya ketika saya sakit dan tidak sedarkan diri. Baginda telah melakukan wuduk dan menyiramkan air wuduk yang tinggal ke atas saya dan saya sedar semula lalu berkata, \"Ya Utusan Allah (ﷺ), kepada siapa akan diwariskan harta saya, kerana saya tidak mempunyai nenek moyang atau keturunan?\" Kemudian ayat-ayat suci tentang Fara'id (pewarisan) diturunkan.",
        "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، قَالَ سَمِعْتُ جَابِرًا، يَقُولُ جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَعُودُنِي، وَأَنَا مَرِيضٌ لاَ أَعْقِلُ، فَتَوَضَّأَ وَصَبَّ عَلَىَّ مِنْ وَضُوئِهِ، فَعَقَلْتُ فَقُلْتُ يَا رَسُولَ اللَّهِ لِمَنِ الْمِيرَاثُ إِنَّمَا يَرِثُنِي كَلاَلَةٌ‏.‏ فَنَزَلَتْ آيَةُ الْفَرَائِضِ‏.‏"
      },
      {
        "id": 195,
        "hadith_number": "195",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menggunakan Periuk Kecil untuk Mandi Wudhuk",
        "perawi_melayu": "Dikisahkan oleh Anas:",
        "english_text": "It was the time for prayer, and those whose houses were near got up and went to their people (to perform ablution), and there remained some people (sitting). Then a painted stove pot (Mikhdab) containing water was brought to Allah's Messenger (ﷺ)s The pot was small, not broad enough for one to spread one's hand in; yet all the people performed ablution. (The sub narrator said, \"We asked Anas, 'How many persons were you?' Anas replied 'We were eighty or more\"). (It was one of the miracles of Allah's Messenger (ﷺ)).",
        "malay_translation": "Waktu solat tiba, orang-orang yang rumahnya berdekatan bangun dan pergi ke tempat mereka (untuk bersuci), dan tinggallah beberapa orang (duduk). Kemudian, sebuah periuk dapur (Mikhdab) bercat yang berisi air dibawa kepada Rasulullah SAW. Periuk itu kecil, tidak cukup luas untuk seseorang melebarkan tangannya di dalamnya; namun, semua orang melakukan wuduk. (Pewaris berkata, \"Kami bertanya kepada Anas, 'Berapakah jumlah kamu?' Anas menjawab, 'Kami berjumlah lapan puluh atau lebih'). (Itu merupakan salah satu mukjizat Rasulullah SAW).",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُنِيرٍ، سَمِعَ عَبْدَ اللَّهِ بْنَ بَكْرٍ، قَالَ حَدَّثَنَا حُمَيْدٌ، عَنْ أَنَسٍ، قَالَ حَضَرَتِ الصَّلاَةُ، فَقَامَ مَنْ كَانَ قَرِيبَ الدَّارِ إِلَى أَهْلِهِ، وَبَقِيَ قَوْمٌ، فَأُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمِخْضَبٍ مِنْ حِجَارَةٍ فِيهِ مَاءٌ، فَصَغُرَ الْمِخْضَبُ أَنْ يَبْسُطَ فِيهِ كَفَّهُ، فَتَوَضَّأَ الْقَوْمُ كُلُّهُمْ‏.‏ قُلْنَا كَمْ كُنْتُمْ قَالَ ثَمَانِينَ وَزِيَادَةً‏.‏"
      },
      {
        "id": 196,
        "hadith_number": "196",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Membasuh Muka dan Tangan Dengan Air di Dalam Cawan",
        "perawi_melayu": "Dikisahkan oleh Abu Musa:",
        "english_text": "Once the Prophet (ﷺ) asked for a tumbler containing water. He washed his hands and face in it and also threw a mouthful of water in it.",
        "malay_translation": "Suatu ketika Nabi SAW meminta sebuah cawan berisi air. Baginda membasuh tangan dan muka dengan air tersebut serta membuang sekerat air ke dalam cawan itu.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، أَنَّ النَّبِيَّ صلى الله عليه وسلم دَعَا بِقَدَحٍ فِيهِ مَاءٌ، فَغَسَلَ يَدَيْهِ وَوَجْهَهُ فِيهِ وَمَجَّ فِيهِ‏.‏"
      },
      {
        "id": 197,
        "hadith_number": "197",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Berwuduk (Menggunakan Tembaga)",
        "perawi_melayu": "Dikisahkan oleh `Abdullah bin Zaid:",
        "english_text": "Once Allah's Messenger (ﷺ) came to us and we brought out water for him in a brass pot. He performed ablution thus: He washed his face thrice, and his forearms to the elbows twice, then passed his wet hands lightly over the head from front to rear and brought them to front again and washed his feet (up to the ankles).",
        "malay_translation": "Suatu ketika Rasulullah SAW datang kepada kami dan kami menghidangkan air kepadanya dalam peri tembaga. Baginda SAW berwuduk dengan cara berikut: Baginda mencuci muka tiga kali, dan kedua lengan hingga ke siku dua kali, kemudian Baginda mengusapkan kedua tangannya yang basah di atas kepala dari depan ke belakang dan membawanya ke depan semula, dan mencuci kedua kaki (sehingga ke buku lali).",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ، قَالَ حَدَّثَنَا عَمْرُو بْنُ يَحْيَى، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ، قَالَ أَتَى رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَخْرَجْنَا لَهُ مَاءً فِي تَوْرٍ مِنْ صُفْرٍ فَتَوَضَّأَ، فَغَسَلَ وَجْهَهُ ثَلاَثًا وَيَدَيْهِ مَرَّتَيْنِ مَرَّتَيْنِ، وَمَسَحَ بِرَأْسِهِ فَأَقْبَلَ بِهِ وَأَدْبَرَ، وَغَسَلَ رِجْلَيْهِ‏.‏"
      },
      {
        "id": 198,
        "hadith_number": "198",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pengubatan Nabi SAW dan Nasihat Kepada Umat",
        "perawi_melayu": "Dikisahkan oleh 'Aisha:",
        "english_text": "When the ailment of the Prophet (ﷺ) became aggravated and his disease became severe, he asked his wives to permit him to be nursed (treated) in my house. So they gave him the permission. Then the Prophet came (to my house) with the support of two men, and his legs were dragging on the ground, between `Abbas, and another man.\" 'Ubaidullah (the sub narrator) said, \"I informed `Abdullah bin `Abbas of what `Aisha said. Ibn `Abbas said: 'Do you know who was the other man?' I replied in the negative. Ibn `Abbas said, 'He was `Ali (bin Abi Talib).\" `Aisha further said, \"When the Prophet (ﷺ) came to my house and his sickness became aggravated he ordered us to pour seven skins full of water on him, so that he might give some advice to the people. So he was seated in a Mikhdab (brass tub) belonging to Hafsa, the wife of the Prophet. Then, all of us started pouring water on him from the water skins till he beckoned to us to stop and that we have done (what he wanted us to do). After that he went out to the people.\"",
        "malay_translation": "Ketika penyakit Nabi SAW semakin parah dan uzurnya semakin berat, baginda meminta izin isteri-isterinya untuk dirawat di rumahku. Mereka mengizinkannya. Kemudian Nabi SAW datang (ke rumahku) dengan dibantu dua orang lelaki, dan kakinya terseret di atas tanah, di antara `Abbas dan seorang lelaki lain. `Ubaidullah (perawi tambahan) berkata, \"Aku memberitahu `Abdullah bin `Abbas tentang apa yang dikatakan oleh `Aisha. Ibn `Abbas berkata: 'Tahukah engkau siapakah lelaki yang lain itu?' Aku menjawab tidak tahu. Ibn `Abbas berkata, 'Dia adalah `Ali (bin Abi Talib).\" `Aisha selanjutnya berkata, \"Apabila Nabi SAW datang ke rumahku dan penyakitnya semakin teruk, baginda memerintahkan kami menuang tujuh kulit penuh air ke atasnya, supaya baginda dapat memberi nasihat kepada orang ramai. Baginda duduk di dalam sebuah Mikhdab (bakul tembaga) kepunyaan Hafsah, isteri Nabi SAW. Kemudian, kami semua mula menuang air ke atasnya dari kulit-kulit air itu sehingga baginda memberi isyarat supaya kami berhenti dan kami telah melakukannya (apa yang baginda suruh kami lakukan). Selepas itu baginda keluar bertemu dengan orang ramai.\"",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ عَائِشَةَ، قَالَتْ لَمَّا ثَقُلَ النَّبِيُّ صلى الله عليه وسلم وَاشْتَدَّ بِهِ وَجَعُهُ، اسْتَأْذَنَ أَزْوَاجَهُ فِي أَنْ يُمَرَّضَ فِي بَيْتِي، فَأَذِنَّ لَهُ، فَخَرَجَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ رَجُلَيْنِ تَخُطُّ رِجْلاَهُ فِي الأَرْضِ بَيْنَ عَبَّاسٍ وَرَجُلٍ آخَرَ‏.‏ قَالَ عُبَيْدُ اللَّهِ فَأَخْبَرْتُ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ فَقَالَ أَتَدْرِي مَنِ الرَّجُلُ الآخَرُ قُلْتُ لاَ‏.‏ قَالَ هُوَ عَلِيٌّ‏.‏ وَكَانَتْ عَائِشَةُ ـ رضى الله عنها ـ تُحَدِّثُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ بَعْدَ مَا دَخَلَ بَيْتَهُ وَاشْتَدَّ وَجَعُهُ ‏ \"‏ هَرِيقُوا عَلَىَّ مِنْ سَبْعِ قِرَبٍ، لَمْ تُحْلَلْ أَوْكِيَتُهُنَّ، لَعَلِّي أَعْهَدُ إِلَى النَّاسِ ‏\"‏‏.‏ وَأُجْلِسَ فِي مِخْضَبٍ لِحَفْصَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم، ثُمَّ طَفِقْنَا نَصُبُّ عَلَيْهِ تِلْكَ حَتَّى طَفِقَ يُشِيرُ إِلَيْنَا أَنْ قَدْ فَعَلْتُنَّ، ثُمَّ خَرَجَ إِلَى النَّاسِ‏.‏"
      },
      {
        "id": 199,
        "hadith_number": "199",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Mengamalkan Wuduk",
        "perawi_melayu": "Diceritakan oleh `Amr bin Yahya (berdasarkan perkataan bapanya):",
        "english_text": "My uncle used to perform ablution extravagantly and once he asked `Abdullah bin Zaid to tell him how he had seen the Prophet (ﷺ) performing ablution. He asked for an earthenware pot containing water, and poured water from it on his hands and washed them thrice, and then put his hand in the earthenware pot and rinsed his mouth and washed his nose by putting water in it and then blowing it out thrice with one handful of water; he again put his hand in the water and took a handful of water and washed his face thrice, then washed his hands up to the elbows twice, and took water with his hand, and passed it over his head from front to back and then from back to front, and then washed his feet (up to the ankles) and said, \"I saw the Prophet (ﷺ) performing ablution in that way.\"",
        "malay_translation": "Pakcik saya selalu mengamalkan wuduk dengan teliti. Suatu ketika, beliau meminta `Abdullah bin Zaid menceritakan bagaimana beliau melihat Nabi SAW mengamalkan wuduk. Beliau meminta periuk tanah liat yang berisi air, kemudian menuang air ke tangannya dan membasuh tangannya sebanyak tiga kali. Selepas itu, beliau memasukkan tangan ke dalam periuk dan membilas mulutnya serta membasuh hidungnya dengan memasukkan air ke dalam hidung dan meniupnya keluar sebanyak tiga kali dengan satu genggaman air. Kemudian beliau memasukkan tangan ke dalam air lagi dan mengambil segenggam air untuk membasuh mukanya sebanyak tiga kali, membasuh kedua-dua tangannya sehingga ke siku sebanyak dua kali, dan mengambil air dengan tangannya untuk mengusap kepalanya dari depan ke belakang, kemudian dari belakang ke depan. Kemudian beliau membasuh kedua-dua kakinya (sehingga ke buku lali) dan berkata, \"Saya melihat Nabi SAW mengamalkan wuduk dengan cara sedemikian.\"",
        "arabic_text": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، قَالَ حَدَّثَنَا سُلَيْمَانُ، قَالَ حَدَّثَنِي عَمْرُو بْنُ يَحْيَى، عَنْ أَبِيهِ، قَالَ كَانَ عَمِّي يُكْثِرُ مِنَ الْوُضُوءِ، قَالَ لِعَبْدِ اللَّهِ بْنِ زَيْدٍ أَخْبِرْنِي كَيْفَ رَأَيْتَ النَّبِيَّ صلى الله عليه وسلم يَتَوَضَّأُ فَدَعَا بِتَوْرٍ مِنْ مَاءٍ، فَكَفَأَ عَلَى يَدَيْهِ فَغَسَلَهُمَا ثَلاَثَ مِرَارٍ، ثُمَّ أَدْخَلَ يَدَهُ فِي التَّوْرِ، فَمَضْمَضَ وَاسْتَنْثَرَ ثَلاَثَ مَرَّاتٍ مِنْ غَرْفَةٍ وَاحِدَةٍ، ثُمَّ أَدْخَلَ يَدَهُ فَاغْتَرَفَ بِهَا فَغَسَلَ وَجْهَهُ ثَلاَثَ مَرَّاتٍ، ثُمَّ غَسَلَ يَدَيْهِ إِلَى الْمِرْفَقَيْنِ مَرَّتَيْنِ مَرَّتَيْنِ، ثُمَّ أَخَذَ بِيَدِهِ مَاءً، فَمَسَحَ رَأْسَهُ، فَأَدْبَرَ بِيَدَيْهِ وَأَقْبَلَ ثُمَّ غَسَلَ رِجْلَيْهِ، فَقَالَ هَكَذَا رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَتَوَضَّأُ‏.‏"
      },
      {
        "id": 200,
        "hadith_number": "200",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keistimewaan Air Wudhu Nabi SAW",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "\"The Prophet (ﷺ) asked for water and a tumbler with a broad base and no so deep, containing a small quantity of water, was brought to him whereby he put his fingers in it.\" Anas further said, ' noticed the water springing out from amongst his fingers.\" Anas رضی اللہ عنہ added, ' estimated that the people who performed ablution with it numbered between seventy to eighty.\"",
        "malay_translation": "\"Nabi SAW meminta air dan sebuah mangkuk berpinggir lebar serta tidak terlalu dalam, yang berisi sedikit air, dihidangkan kepadanya. Baginda memasukkan jari-jari ke dalam mangkuk itu.\" Anas selanjutnya berkata, 'Saya melihat air menitis keluar dari celah-celah jari Baginda.' Anas menambah, 'Saya menganggarkan kira-kira tujuh puluh hingga lapan puluh orang menggunakan air wuduk tersebut.' ",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم دَعَا بِإِنَاءٍ مِنْ مَاءٍ، فَأُتِيَ بِقَدَحٍ رَحْرَاحٍ فِيهِ شَىْءٌ مِنْ مَاءٍ، فَوَضَعَ أَصَابِعَهُ فِيهِ‏.‏ قَالَ أَنَسٌ فَجَعَلْتُ أَنْظُرُ إِلَى الْمَاءِ يَنْبُعُ مِنْ بَيْنِ أَصَابِعِهِ، قَالَ أَنَسٌ فَحَزَرْتُ مَنْ تَوَضَّأَ مَا بَيْنَ السَّبْعِينَ إِلَى الثَّمَانِينَ‏.‏"
      },
      {
        "id": 201,
        "hadith_number": "201",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Mandi dan Berwuduk",
        "perawi_melayu": "Dikisahkan oleh Anas",
        "english_text": "The Prophet (ﷺ) used to take a bath with one Sa` up to five Mudds (1 Sa` = [??] Mudds) of water and used to perform ablution with one Mudd of water.",
        "malay_translation": "Nabi SAW biasa mandi menggunakan air satu sa` hingga lima mudd (1 sa` = [??] mudd) dan berwuduk dengan satu mudd air.",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا مِسْعَرٌ، قَالَ حَدَّثَنِي ابْنُ جَبْرٍ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم يَغْسِلُ ـ أَوْ كَانَ يَغْتَسِلُ ـ بِالصَّاعِ إِلَى خَمْسَةِ أَمْدَادٍ، وَيَتَوَضَّأُ بِالْمُدِّ‏.‏"
      },
      {
        "id": 202,
        "hadith_number": "202",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Mengusap Kasutnya yang Basah",
        "perawi_melayu": "Dikisahkan oleh `Abdullah bin `Umar:",
        "english_text": "Sa`d bin Abi Waqqas berkata, \"Nabi SAW mengusap kedua tangannya yang basah ke atas Khufnya (kaus kaki tebal daripada kain atau kulit).\" `Abdullah bin `Umar bertanya kepada `Umar tentangnya. `Umar menjawab dengan anggukan dan menambah, \"Apabila Sa`d meriwayatkan hadis dari Nabi, tiada perlu bertanya kepada orang lain tentangnya.\"",
        "malay_translation": "Sa'd bin Abi Waqqas meriwayatkan, \"Nabi SAW mengusap kedua-dua tangannya yang basah ke atas kasut tebalnya (Khuf).\" `Abdullah bin `Umar bertanya kepada `Umar tentang hal itu. `Umar membenarkannya dan menambah, \"Apabila Sa'd meriwayatkan sebuah hadis daripada Nabi SAW, tiada perlu bertanya kepada sesiapa lagi; sudah memadai.\"",
        "arabic_text": "حَدَّثَنَا أَصْبَغُ بْنُ الْفَرَجِ الْمِصْرِيُّ، عَنِ ابْنِ وَهْبٍ، قَالَ حَدَّثَنِي عَمْرٌو، حَدَّثَنِي أَبُو النَّضْرِ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ مَسَحَ عَلَى الْخُفَّيْنِ‏.‏ وَأَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ سَأَلَ عُمَرَ عَنْ ذَلِكَ فَقَالَ نَعَمْ إِذَا حَدَّثَكَ شَيْئًا سَعْدٌ عَنِ النَّبِيِّ صلى الله عليه وسلم فَلاَ تَسْأَلْ عَنْهُ غَيْرَهُ‏.‏ وَقَالَ مُوسَى بْنُ عُقْبَةَ أَخْبَرَنِي أَبُو النَّضْرِ أَنَّ أَبَا سَلَمَةَ أَخْبَرَهُ أَنَّ سَعْدًا حَدَّثَهُ فَقَالَ عُمَرُ لِعَبْدِ اللَّهِ‏.‏ نَحْوَهُ‏.‏"
      },
      {
        "id": 203,
        "hadith_number": "203",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Membersihkan Kasut Semasa Bersuci",
        "perawi_melayu": "Al-Mughira bin Shu`ba",
        "english_text": "Once Allah's Messenger (ﷺ) went out to answer the call of nature and I followed him with a tumbler containing water, and when he finished, I poured water and he performed ablution and passed wet hands over his Khuffs (socks made from thick fabric or leather).",
        "malay_translation": "Suatu ketika Rasulullah SAW keluar untuk menjawab panggilan semula jadi dan saya mengikutnya dengan membawa sebuah gelas berisi air.  Apabila baginda selesai, saya menuang air dan baginda melakukan wuduk dan melepasi tangannya yang basah ke atas Khuffs (stokin tebal daripada kain atau kulit). ",
        "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ الْحَرَّانِيُّ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ نَافِعِ بْنِ جُبَيْرٍ، عَنْ عُرْوَةَ بْنِ الْمُغِيرَةِ، عَنْ أَبِيهِ الْمُغِيرَةِ بْنِ شُعْبَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ خَرَجَ لِحَاجَتِهِ فَاتَّبَعَهُ الْمُغِيرَةُ بِإِدَاوَةٍ فِيهَا مَاءٌ، فَصَبَّ عَلَيْهِ حِينَ فَرَغَ مِنْ حَاجَتِهِ، فَتَوَضَّأَ وَمَسَحَ عَلَى الْخُفَّيْنِ‏.‏"
      },
      {
        "id": 204,
        "hadith_number": "204",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Membasuh Kaki",
        "perawi_melayu": "Diceritakan oleh bapa Ja'far bin 'Amr bin Umaiya Ad-Damri, disahkan oleh Hadrat Harb dan Aban dari Yahya.",
        "english_text": "\"I saw the Prophet (ﷺ) passing wet hands over his Khuffs (socks made from thick fabric or leather).\"\r\nHadrat  Harb and Aban have corroborated him from Yahya.",
        "malay_translation": "\"Aku melihat Rasulullah SAW membasuh Khuff-Nya (kasut tebal daripada kain atau kulit) dengan tangan yang basah.\"\nHadrat Harb dan Aban telah mengesahkannya daripada Yahya.",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ، أَنَّ أَبَاهُ، أَخْبَرَهُ أَنَّهُ، رَأَى النَّبِيَّ صلى الله عليه وسلم يَمْسَحُ عَلَى الْخُفَّيْنِ‏.‏ وَتَابَعَهُ حَرْبُ بْنُ شَدَّادٍ وَأَبَانُ عَنْ يَحْيَى‏.‏"
      },
      {
        "id": 205,
        "hadith_number": "205",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Menyeka Kepalanya dan Kasutnya",
        "perawi_melayu": "Diriwayatkan oleh Ja`far bin `Amr, yang melaporkan bahawa bapanya berkata:",
        "english_text": "\"I saw the Prophet (ﷺ) passing wet hands over his turban and Khuffs (socks made from thick fabric or leather).\r\nMaamar, Yahya and Abu salamah corroborated him from Amr: I saw the prophet (ﷺ).\"",
        "malay_translation": "“Aku melihat Rasulullah SAW menyeka kepalanya dan kasutnya (khuff) dengan tangan yang basah.”\nMaamar, Yahya dan Abu Salamah mengesahkannya daripada Amr, “Aku melihat Nabi SAW.”",
        "arabic_text": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا الأَوْزَاعِيُّ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ جَعْفَرِ بْنِ عَمْرٍو، عَنْ أَبِيهِ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَمْسَحُ عَلَى عِمَامَتِهِ وَخُفَّيْهِ‏.‏ وَتَابَعَهُ مَعْمَرٌ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ عَمْرٍو قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 206,
        "hadith_number": "206",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menyimpan Kaus Kaki Nabi SAW Selepas Bersuci",
        "perawi_melayu": "Dikisahkan oleh bapa `Urwa bin Al-Mughira:",
        "english_text": "\"Once I was in the company of the Prophet (ﷺ) on a journey and I dashed to take off his Khuffs (socks made from thick fabric or leather). He ordered me to leave them as he had put them after performing ablution. So he passed wet hands over them.",
        "malay_translation": "Suatu ketika, aku berada bersama Rasulullah SAW dalam perjalanan. Aku tergesa-gesa ingin menanggalkan Khuff (kaus kaki tebal daripada kain atau kulit) baginda. Baginda memerintahkan aku agar meninggalkannya seperti sedia kala kerana baginda meletakkannya setelah bersuci. Baginda kemudian mengusap kedua-dua tangan yang basah ke atasnya.",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا زَكَرِيَّاءُ، عَنْ عَامِرٍ، عَنْ عُرْوَةَ بْنِ الْمُغِيرَةِ، عَنْ أَبِيهِ، قَالَ كُنْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي سَفَرٍ، فَأَهْوَيْتُ لأَنْزِعَ خُفَّيْهِ فَقَالَ ‏ \"‏ دَعْهُمَا، فَإِنِّي أَدْخَلْتُهُمَا طَاهِرَتَيْنِ ‏\"‏‏.‏ فَمَسَحَ عَلَيْهِمَا‏.‏"
      },
      {
        "id": 207,
        "hadith_number": "207",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Makan Daging Kambing Tanpa Mengulang Wudhu",
        "perawi_melayu": "Dikisahkan oleh Abdullah bin Abbas:",
        "english_text": "Allah's Messenger (ﷺ) ate a piece of cooked mutton from the shoulder region and prayed without repeating ablution.",
        "malay_translation": "Pesuruh Allah SWT memakan seketul daging kambing panggang dari bahagian bahu dan kemudian sembahyang tanpa mengulang wuduk.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ،‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَكَلَ كَتِفَ شَاةٍ، ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ‏.‏"
      },
      {
        "id": 208,
        "hadith_number": "208",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Makan Daging Kambing dan Solat Tanpa Berwudhuk Ulang",
        "perawi_melayu": "Dikisahkan oleh bapa Ja'far bin 'Amr bin Umaiya",
        "english_text": "\"I saw Allah's Messenger (ﷺ) taking a piece of (cooked) mutton from the shoulder region and then he was called for prayer. He put his knife down and prayed without repeating ablution.\"",
        "malay_translation": "\"Aku melihat Rasulullah SAW mengambil sekeping daging kambing dari bahagian bahu dan kemudian beliau dipanggil untuk solat. Baginda meletakkan pisau dan solat tanpa mengulangi wudhuk.\"",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي جَعْفَرُ بْنُ عَمْرِو بْنِ أُمَيَّةَ، أَنَّ أَبَاهُ، أَخْبَرَهُ أَنَّهُ، رَأَى رَسُولَ اللَّهِ صلى الله عليه وسلم يَحْتَزُّ مِنْ كَتِفِ شَاةٍ، فَدُعِيَ إِلَى الصَّلاَةِ فَأَلْقَى السِّكِّينَ فَصَلَّى وَلَمْ يَتَوَضَّأْ‏.‏"
      },
      {
        "id": 209,
        "hadith_number": "209",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kejadian Pada Hari Penaklukan Khaibar dan Solat Asar Nabi SAW",
        "perawi_melayu": "Suwaid bin Al-Nu`man",
        "english_text": "In the year of the conquest of Khaibar I went with Allah's Messenger (ﷺ) till we reached Sahba, a place near Khaibar, where Allah's Messenger (ﷺ) offered the `Asr prayer and asked for food. Nothing but saweeq was brought. He ordered it to be moistened with water. He and all of us ate it and the Prophet (ﷺ) got up for the evening prayer (Maghrib prayer), rinsed his mouth with water and we did the same, and he then prayed without repeating the ablution.",
        "malay_translation": "Pada tahun penaklukan Khaibar, saya bersama Rasulullah SAW sampai ke Sahba, sebuah tempat berdekatan Khaibar, di mana Rasulullah SAW menunaikan solat Asar dan meminta makanan. Hanya saweeq yang dibawa. Baginda memerintahkan ia direndam dengan air. Baginda dan kami semua memakannya, dan Nabi SAW bangun untuk solat Maghrib, membilas mulutnya dengan air dan kami pun berbuat demikian, dan baginda kemudian menunaikan solat tanpa mengulangi wudhuk.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، مَوْلَى بَنِي حَارِثَةَ أَنَّ سُوَيْدَ بْنَ النُّعْمَانِ، أَخْبَرَهُ‏.‏ أَنَّهُ، خَرَجَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ خَيْبَرَ، حَتَّى إِذَا كَانُوا بِالصَّهْبَاءِ ـ وَهِيَ أَدْنَى خَيْبَرَ ـ فَصَلَّى الْعَصْرَ، ثُمَّ دَعَا بِالأَزْوَادِ، فَلَمْ يُؤْتَ إِلاَّ بِالسَّوِيقِ، فَأَمَرَ بِهِ فَثُرِّيَ، فَأَكَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَكَلْنَا، ثُمَّ قَامَ إِلَى الْمَغْرِبِ، فَمَضْمَضَ وَمَضْمَضْنَا، ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ‏.‏"
      },
      {
        "id": 210,
        "hadith_number": "210",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi SAW Makan Daging Kambing Bahu dan Tidak Mengulangi Wuduk",
        "perawi_melayu": "Diriwayatkan oleh Maimuna:",
        "english_text": "The Prophet (ﷺ) ate (a piece of) mutton from the shoulder region and then prayed without repeating the ablution.",
        "malay_translation": "Nabi SAW memakan daging kambing dari bahagian bahu dan kemudian menunaikan solat tanpa mengulangi wuduk.",
        "arabic_text": "وَحَدَّثَنَا أَصْبَغُ، قَالَ أَخْبَرَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرٌو، عَنْ بُكَيْرٍ، عَنْ كُرَيْبٍ، عَنْ مَيْمُونَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَكَلَ عِنْدَهَا كَتِفًا، ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ‏.‏"
      },
      {
        "id": 211,
        "hadith_number": "211",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Minum Susu dan Membersihkan Mulutnya",
        "perawi_melayu": "Ibnu Abbas RA",
        "english_text": "Allah's Messenger (ﷺ) drank milk, rinsed his mouth and said, \"It has fat.\"\r\nyounus and Sualih bin Kaisan corroborated him from Zuhri.",
        "malay_translation": "Pesuruh Allah SAW minum susu, membilas mulutnya, dan bersabda, \"Susu ini berlemak.\"\r\nYunus dan Suwailih bin Kaisan menyaksikannya daripada Zuhri.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، وَقُتَيْبَةُ، قَالاَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم شَرِبَ لَبَنًا، فَمَضْمَضَ وَقَالَ ‏ \"‏ إِنَّ لَهُ دَسَمًا ‏\"‏‏.‏ تَابَعَهُ يُونُسُ وَصَالِحُ بْنُ كَيْسَانَ عَنِ الزُّهْرِيِّ‏.‏"
      },
      {
        "id": 212,
        "hadith_number": "212",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keadaan Mengantuk Ketika Solat",
        "perawi_melayu": "Riwayat `Aishah",
        "english_text": "Allah's Messenger (ﷺ) said, \"If anyone of you feels drowsy while praying he should go to bed (sleep) till his slumber is over because in praying while drowsy one does not know whether one is asking for forgiveness or for a bad thing for oneself.\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Jika seseorang di antara kamu merasa mengantuk ketika solat, maka hendaklah dia pergi tidur sehingga hilang rasa mengantuknya. Kerana dalam keadaan mengantuk ketika solat, seseorang tidak pasti sama ada dia sedang memohon keampunan atau sebaliknya memohon kemudaratan kepada dirinya sendiri.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا نَعَسَ أَحَدُكُمْ وَهُوَ يُصَلِّي فَلْيَرْقُدْ حَتَّى يَذْهَبَ عَنْهُ النَّوْمُ، فَإِنَّ أَحَدَكُمْ إِذَا صَلَّى وَهُوَ نَاعِسٌ لاَ يَدْرِي لَعَلَّهُ يَسْتَغْفِرُ فَيَسُبَّ نَفْسَهُ ‏\"‏‏.‏"
      },
      {
        "id": 213,
        "hadith_number": "213",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menasihat tentang Solat ketika Mengantuk",
        "perawi_melayu": "Dikisahkan oleh Anas:",
        "english_text": "The Prophet (ﷺ) said, \"If anyone of you feels drowsy while praying, he should sleep till he understands what he is saying (reciting).\"",
        "malay_translation": "Nabi (ﷺ) bersabda, \"Jika ada di antara kamu yang mengantuk ketika solat, hendaklah dia tidur sehingga dia memahami apa yang sedang dia ucapkan (baca).\"",
        "arabic_text": "حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا نَعَسَ أَحَدُكُمْ فِي الصَّلاَةِ فَلْيَنَمْ حَتَّى يَعْلَمَ مَا يَقْرَأُ ‏\"‏‏.‏"
      },
      {
        "id": 214,
        "hadith_number": "214",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Sunnah Nabi SAW dalam Wudhu Setiap Solat",
        "perawi_melayu": "Amr bin `Amir meriwayatkan:",
        "english_text": "Anas berkata, \"Nabi (ﷺ) selalu berwudhu untuk setiap solat.\" Aku bertanya kepada Anas, \"Apa yang kamu lakukan dulu?\" Anas menjawab, \"Kami bersembahyang dengan wudhu yang sama sehingga terputus dengan hadas.\"",
        "malay_translation": "Anas r.a. berkata, \"Nabi SAW selalu berwudhū untuk setiap solat. Aku bertanya kepada Anas, 'Apakah yang kamu lakukan dulu?' Anas menjawab, 'Kami solat dengan wudhū yang sama sehingga terputus dengan hadas.'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ عَامِرٍ، قَالَ سَمِعْتُ أَنَسًا، ح قَالَ وَحَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي عَمْرُو بْنُ عَامِرٍ، عَنْ أَنَسٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَتَوَضَّأُ عِنْدَ كُلِّ صَلاَةٍ‏.‏ قُلْتُ كَيْفَ كُنْتُمْ تَصْنَعُونَ قَالَ يُجْزِئُ أَحَدَنَا الْوُضُوءُ مَا لَمْ يُحْدِثْ‏.‏"
      },
      {
        "id": 215,
        "hadith_number": "215",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Asar dan Maghrib pada Penaklukan Khaibar",
        "perawi_melayu": "Disebutkan oleh Suwaid bin Nu`man:",
        "english_text": "In the year of the conquest of Khaibar I went with Allah's Messenger (ﷺ) till we reached As-Sahba' where Allah's Messenger (ﷺ) led the `Asr prayer and asked for the food. Nothing but saweeq was brought and we ate it and drank (water). The Prophet (ﷺ) got up for the (Maghrib) Prayer, rinsed his mouth with water and then led the prayer without repeating the ablution.",
        "malay_translation": "Pada tahun penaklukan Khaibar, aku pergi bersama Rasulullah (ﷺ) sehingga kami sampai ke As-Sahba'. Di situ, Rasulullah (ﷺ) memimpin solat Asar dan meminta makanan. Hanya saweeq yang dibawa, dan kami memakannya serta minum air. Baginda (ﷺ) bangun untuk solat Maghrib, membilas mulut dengan air dan kemudian memimpin solat tanpa mengulangi wuduk.",
        "arabic_text": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، قَالَ حَدَّثَنَا سُلَيْمَانُ، قَالَ حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ، قَالَ أَخْبَرَنِي بُشَيْرُ بْنُ يَسَارٍ، قَالَ أَخْبَرَنِي سُوَيْدُ بْنُ النُّعْمَانِ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ خَيْبَرَ، حَتَّى إِذَا كُنَّا بِالصَّهْبَاءِ، صَلَّى لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم الْعَصْرَ، فَلَمَّا صَلَّى دَعَا بِالأَطْعِمَةِ، فَلَمْ يُؤْتَ إِلاَّ بِالسَّوِيقِ، فَأَكَلْنَا وَشَرِبْنَا، ثُمَّ قَامَ النَّبِيُّ صلى الله عليه وسلم إِلَى الْمَغْرِبِ فَمَضْمَضَ، ثُمَّ صَلَّى لَنَا الْمَغْرِبَ وَلَمْ يَتَوَضَّأْ‏.‏"
      },
      {
        "id": 216,
        "hadith_number": "216",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Siksaan di Kubur dan Permohonan Pengurangan Azab",
        "perawi_melayu": "Riwayat Ibn 'Abbas:",
        "english_text": "Once the Prophet, while passing through one of the graveyards of Medina or Mecca heard the voices of two persons who were being tortured in their graves. The Prophet (ﷺ) said, \"These two persons are being tortured not for a major sin (to avoid).\" The Prophet (ﷺ) then added, \"Yes! (they are being tortured for a major sin). Indeed, one of them never saved himself from being soiled with his urine while the other used to go about with calumnies (to make enmity between friends). The Prophet (ﷺ) then asked for a green leaf of a date-palm tree, broke it into two pieces and put one on each grave. On being asked why he had done so, he replied, \"I hope that their torture might be lessened, till these get dried.\"",
        "malay_translation": "Suatu ketika Nabi SAW ketika melalui salah satu kubur di Madinah atau Mekah, mendengar suara dua orang yang sedang disiksa di kubur mereka. Nabi SAW bersabda, \"Dua orang ini disiksa bukan atas dosa besar (untuk mengelak).\" Kemudian Nabi SAW menambahkan, \"Ya! (mereka disiksa atas dosa besar). Sesungguhnya salah seorang daripada mereka tidak pernah menjaga dirinya daripada terkena najis kencing manakala yang lain pula suka menyebarkan fitnah (untuk menimbulkan permusuhan antara sahabat). Kemudian Nabi SAW meminta sehelai daun kurma yang hijau, mematahkannya menjadi dua dan meletakkan satu pada setiap kubur. Apabila ditanya mengapa baginda berbuat demikian, baginda menjawab, \"Semoga siksaan mereka berkurang, sehingga daun ini kering.\"",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ مَرَّ النَّبِيُّ صلى الله عليه وسلم بِحَائِطٍ مِنْ حِيطَانِ الْمَدِينَةِ أَوْ مَكَّةَ، فَسَمِعَ صَوْتَ إِنْسَانَيْنِ يُعَذَّبَانِ فِي قُبُورِهِمَا، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ يُعَذَّبَانِ، وَمَا يُعَذَّبَانِ فِي كَبِيرٍ ‏\"‏، ثُمَّ قَالَ ‏\"‏ بَلَى، كَانَ أَحَدُهُمَا لاَ يَسْتَتِرُ مِنْ بَوْلِهِ، وَكَانَ الآخَرُ يَمْشِي بِالنَّمِيمَةِ ‏\"‏‏.‏ ثُمَّ دَعَا بِجَرِيدَةٍ فَكَسَرَهَا كِسْرَتَيْنِ، فَوَضَعَ عَلَى كُلِّ قَبْرٍ مِنْهُمَا كِسْرَةً‏.‏ فَقِيلَ لَهُ يَا رَسُولَ اللَّهِ لِمَ فَعَلْتَ هَذَا قَالَ ‏\"‏ لَعَلَّهُ أَنْ يُخَفَّفَ عَنْهُمَا مَا لَمْ تَيْبَسَا أَوْ إِلَى أَنْ يَيْبَسَا ‏\"‏‏.‏"
      },
      {
        "id": 217,
        "hadith_number": "217",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Membersihkan Diri",
        "perawi_melayu": "Dikisahkan oleh Anas bin Malik:",
        "english_text": "Whenever the Prophet (ﷺ) went to answer the call of nature, I used to bring water with which he used to clean his private parts.",
        "malay_translation": "Setiap kali Nabi SAW pergi ke tandas, aku akan membawa air untuk digunakan baginda membersihkan anggota sulitnya.",
        "arabic_text": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنِي رَوْحُ بْنُ الْقَاسِمِ، قَالَ حَدَّثَنِي عَطَاءُ بْنُ أَبِي مَيْمُونَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا تَبَرَّزَ لِحَاجَتِهِ أَتَيْتُهُ بِمَاءٍ فَيَغْسِلُ بِهِ‏.‏"
      },
      {
        "id": 218,
        "hadith_number": "218",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Siksaan Dua Orang di Kubur dan Tindakan Nabi SAW",
        "perawi_melayu": "Dikisahkan oleh Ibn `Abbas:",
        "english_text": "The Prophet (ﷺ) once passed by two graves and said, \"These two persons are being tortured not for a major sin (to avoid). One of them never saved himself from being soiled with his urine, while the other used to go about with calumnies (to make enmity between friends).\" The Prophet (ﷺ) then took a green leaf of a date-palm tree, split it into (pieces) and fixed one on each grave. They said, \"O Allah's Apostle! Why have you done so?\" He replied, \"I hope that their punishment might be lessened till these (the pieces of the leaf) become dry.\" (See the footnote of Hadith 215).",
        "malay_translation": "Nabi SAW pernah melewati dua buah kubur dan bersabda, \"Kedua orang ini sedang disiksa, bukan kerana dosa besar (untuk dielakkan). Salah seorang dari mereka tidak pernah menjaga kebersihan dirinya daripada najis air kencingnya, dan yang lain pula gemar menyebarkan fitnah (untuk menimbulkan permusuhan di antara teman-teman).\" Kemudian, Nabi SAW mengambil sehelai daun kurma yang hijau, memisahkannya menjadi beberapa bahagian dan meletakkan sebahagiannya pada setiap kubur. Mereka bertanya, \"Wahai Rasulullah! Mengapa Engkau berbuat demikian?\" Baginda menjawab, \"Aku berharap supaya azab mereka berkurang sehingga daun-daun ini kering.\" (Lihat nota kaki Hadis 215).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ خَازِمٍ، قَالَ حَدَّثَنَا الأَعْمَشُ، عَنْ مُجَاهِدٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ مَرَّ النَّبِيُّ صلى الله عليه وسلم بِقَبْرَيْنِ فَقَالَ ‏\"‏ إِنَّهُمَا لَيُعَذَّبَانِ، وَمَا يُعَذَّبَانِ فِي كَبِيرٍ أَمَّا أَحَدُهُمَا فَكَانَ لاَ يَسْتَتِرُ مِنَ الْبَوْلِ، وَأَمَّا الآخَرُ فَكَانَ يَمْشِي بِالنَّمِيمَةِ ‏\"‏‏.‏ ثُمَّ أَخَذَ جَرِيدَةً رَطْبَةً، فَشَقَّهَا نِصْفَيْنِ، فَغَرَزَ فِي كُلِّ قَبْرٍ وَاحِدَةً‏.‏ قَالُوا يَا رَسُولَ اللَّهِ، لِمَ فَعَلْتَ هَذَا قَالَ ‏\"‏ لَعَلَّهُ يُخَفَّفُ عَنْهُمَا مَا لَمْ يَيْبَسَا ‏\"‏‏.‏ قَالَ ابْنُ الْمُثَنَّى وَحَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا الأَعْمَشُ قَالَ سَمِعْتُ مُجَاهِدًا مِثْلَهُ ‏\"‏ يَسْتَتِرُ مِنْ بَوْلِهِ ‏\"‏‏.‏"
      },
      {
        "id": 219,
        "hadith_number": "219",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Melihat Pengembara Berwuduk di Masjid",
        "perawi_melayu": "Dikisahkan oleh Anas bin Malik:",
        "english_text": "The Prophet (ﷺ) saw a Bedouin making water in the mosque and told the people not to disturb him. When he finished, the Prophet (ﷺ) asked for some water and poured it over (the urine).",
        "malay_translation": "Nabi SAW melihat seorang pengembara sedang membuang air kecil di masjid dan menyuruh orang ramai agar tidak mengganggu. Setelah selesai, Nabi SAW meminta sedikit air dan menuangkannya ke atas (air kencing tersebut).",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا هَمَّامٌ، أَخْبَرَنَا إِسْحَاقُ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى أَعْرَابِيًّا يَبُولُ فِي الْمَسْجِدِ فَقَالَ ‏ \"‏ دَعُوهُ ‏\"‏‏.‏ حَتَّى إِذَا فَرَغَ دَعَا بِمَاءٍ فَصَبَّهُ عَلَيْهِ‏.‏"
      },
      {
        "id": 220,
        "hadith_number": "220",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Mengutamakan Kemudahan dalam Pelaksanaan Syariat",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
        "english_text": "A Bedouin stood up and started making water in the mosque. The people caught him but the Prophet (ﷺ) ordered them to leave him and to pour a bucket or a tumbler of water over the place where he had passed the urine. The Prophet (ﷺ) then said, \"You have been sent to make things easy and not to make them difficult.\"",
        "malay_translation": "Seorang Badwi bangun dan mula membuang air kecil di dalam masjid. Orang ramai menangkapnya, tetapi Nabi (ﷺ) memerintahkan mereka untuk melepaskannya dan menuangkan satu baldi atau cawan air ke tempat di mana dia membuang air kecil. Kemudian Nabi (ﷺ) bersabda, \"Kamu diutuskan untuk memudahkan urusan, bukan untuk menyukarkannya.\"",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ قَامَ أَعْرَابِيٌّ فَبَالَ فِي الْمَسْجِدِ فَتَنَاوَلَهُ النَّاسُ، فَقَالَ لَهُمُ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ دَعُوهُ وَهَرِيقُوا عَلَى بَوْلِهِ سَجْلاً مِنْ مَاءٍ، أَوْ ذَنُوبًا مِنْ مَاءٍ، فَإِنَّمَا بُعِثْتُمْ مُيَسِّرِينَ، وَلَمْ تُبْعَثُوا مُعَسِّرِينَ ‏\"‏‏.‏"
      },
      {
        "id": 221,
        "hadith_number": "221",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Menahan Orang Dari Menyergah Seorang Badwi Di Masjid",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik:",
        "english_text": "The Prophet ﷺ, said as above (Hadith No 220).\r\nA Bedouin came and passed urine in one corner of the mosque. The people shouted at him but the Prophet stopped them till he finished urinating. The Prophet ordered them to spill a bucket of water over that place and they did so.",
        "malay_translation": "Nabi saw, seperti yang telah disebutkan di atas (Hadis No 220).\r\nSeorang Badwi datang dan kencing di satu sudut masjid. Orang ramai menjerit kepadanya, tetapi Nabi menghalang mereka sehingga dia selesai kencing. Baginda memerintahkan mereka untuk menumpahkan satu baldi air ke tempat itu dan mereka melakukannya.",
        "arabic_text": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏\r\nحَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا سُلَيْمَانُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، قَالَ جَاءَ أَعْرَابِيٌّ فَبَالَ فِي طَائِفَةِ الْمَسْجِدِ، فَزَجَرَهُ النَّاسُ، فَنَهَاهُمُ النَّبِيُّ صلى الله عليه وسلم، فَلَمَّا قَضَى بَوْلَهُ أَمَرَ النَّبِيُّ صلى الله عليه وسلم بِذَنُوبٍ مِنْ مَاءٍ، فَأُهْرِيقَ عَلَيْهِ‏.‏"
      },
      {
        "id": 222,
        "hadith_number": "222",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Mencuci Najis Anak Kecil",
        "perawi_melayu": "Diceritakan oleh `Aisyah (ibu orang-orang mukmin):",
        "english_text": "A child was brought to Allah's Messenger (ﷺ) and it urinated on the garment of the Prophet. The Prophet (ﷺ) asked for water and poured it over the soiled place.",
        "malay_translation": "Seorang kanak-kanak dibawa kepada Rasulullah SAW dan ia membuang air kecil di atas pakaian Baginda. Baginda Rasulullah SAW meminta air dan menuangkannya ke tempat yang kotor tersebut.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّهَا قَالَتْ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِصَبِيٍّ، فَبَالَ عَلَى ثَوْبِهِ، فَدَعَا بِمَاءٍ فَأَتْبَعَهُ إِيَّاهُ‏.‏"
      },
      {
        "id": 223,
        "hadith_number": "223",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hadis Mengenai Nabi Menguruskan Air Kencing Anak Kecil",
        "perawi_melayu": "Dikisahkan oleh Um Qais binti Mihsin:",
        "english_text": "I brought my young son, who had not started eating (ordinary food) to Allah's Messenger (ﷺ) who took him and made him sit in his lap. The child urinated on the garment of the Prophet, so he asked for water and poured it over the soiled (area) and did not wash it.",
        "malay_translation": "Saya membawa anak lelaki saya yang masih kecil, yang belum mula makan (makanan biasa) kepada Rasulullah SAW, yang mengambilnya dan dudukkannya di pangkuannya. Anak itu kencing di pakaian Nabi, maka baginda meminta air dan menuangkannya ke atas bahagian yang kotor itu dan tidak membasuhnya.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ، أَنَّهَا أَتَتْ بِابْنٍ لَهَا صَغِيرٍ، لَمْ يَأْكُلِ الطَّعَامَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم، فَأَجْلَسَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حِجْرِهِ، فَبَالَ عَلَى ثَوْبِهِ، فَدَعَا بِمَاءٍ فَنَضَحَهُ وَلَمْ يَغْسِلْهُ‏.‏"
      },
      {
        "id": 224,
        "hadith_number": "224",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Mencuci Diri di Tempat Pembuangan Sampah",
        "perawi_melayu": "Dikisahkan oleh Hudhaifa:",
        "english_text": "Once the Prophet (ﷺ) went to the dumps of some people and passed urine while standing. He then asked for water and so I brought it to him and he performed ablution.",
        "malay_translation": "Suatu ketika, Nabi SAW pergi ke tempat pembuangan sampah penduduk dan membuang air kecil sambil berdiri. Kemudian baginda meminta air, lalu aku membawanya kepada baginda dan baginda melakukan wuduk.",
        "arabic_text": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ، قَالَ أَتَى النَّبِيُّ صلى الله عليه وسلم سُبَاطَةَ قَوْمٍ فَبَالَ قَائِمًا، ثُمَّ دَعَا بِمَاءٍ، فَجِئْتُهُ بِمَاءٍ فَتَوَضَّأَ‏.‏"
      },
      {
        "id": 225,
        "hadith_number": "225",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW dan Mengeluarkan Air Kencing di Tempat Sampah",
        "perawi_melayu": "Dikisahkan oleh Hudhaifa':",
        "english_text": "The Prophet (ﷺ) and I walked till we reached the dumps of some people. He stood, as any one of you stands, behind a wall and urinated. I went away, but he beckoned me to come. So I approached him and stood near his back till he finished.",
        "malay_translation": "Nabi SAW dan saya berjalan hingga sampai ke tempat sampah sesetengah orang. Baginda berdiri, seperti mana sesiapa di antara kamu berdiri, di belakang tembok dan membuang air kecil. Saya pergi, tetapi baginda memberi isyarat supaya saya datang. Maka saya menghampirinya dan berdiri di belakangnya sehingga baginda selesai.",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ، قَالَ رَأَيْتُنِي أَنَا وَالنَّبِيُّ، صلى الله عليه وسلم نَتَمَاشَى، فَأَتَى سُبَاطَةَ قَوْمٍ خَلْفَ حَائِطٍ، فَقَامَ كَمَا يَقُومُ أَحَدُكُمْ فَبَالَ، فَانْتَبَذْتُ مِنْهُ، فَأَشَارَ إِلَىَّ فَجِئْتُهُ، فَقُمْتُ عِنْدَ عَقِبِهِ حَتَّى فَرَغَ‏.‏"
      },
      {
        "id": 226,
        "hadith_number": "226",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hadis tentang Cara Nabi SAW Menguruskan Hajat",
        "perawi_melayu": "Dikisahkan oleh Abu Wail:",
        "english_text": "Abu Musa Al-Ash`ari gemar menekankan perkara kencing dan dia biasa berkata, \"Sekiranya sesiapa daripada Bani Israel mencemarkan pakaiannya dengan air kencing, dia akan memotong bahagian yang tercemar itu.\" Mendengar itu, Hudhaifa berkata kepada Abu Wail, \"Semoga dia (Abu Musa) tidak menekankan perkara itu.\"\" Hudhaifa menambah, \"Pesuruhjaya Allah (ﷺ) pergi ke tempat pembuangan najis sesetengah orang dan membuang air kecil sambil berdiri.\"",
        "malay_translation": "Abu Musa Al-Ash`ari suka menekankan perkara kencing dan dia biasa berkata, \"Jika seseorang daripada Bani Israel mencemarkan pakaiannya dengan air kencing, dia akan memotong bahagian yang tercemar itu.\" Mendengar itu, Hudhaifa berkata kepada Abu Wail, \"Semoga dia (Abu Musa) tidak menekankan perkara itu. \"\" Hudhaifa menambah, \"Pesuruhjaya Allah (ﷺ) pergi ke tandas sesetengah orang dan membuang air kecil sambil berdiri.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، قَالَ كَانَ أَبُو مُوسَى الأَشْعَرِيُّ يُشَدِّدُ فِي الْبَوْلِ وَيَقُولُ إِنَّ بَنِي إِسْرَائِيلَ كَانَ إِذَا أَصَابَ ثَوْبَ أَحَدِهِمْ قَرَضَهُ‏.‏ فَقَالَ حُذَيْفَةُ لَيْتَهُ أَمْسَكَ، أَتَى رَسُولُ اللَّهِ صلى الله عليه وسلم سُبَاطَةَ قَوْمٍ فَبَالَ قَائِمًا‏.‏"
      },
      {
        "id": 227,
        "hadith_number": "227",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Panduan Wanita Mengatasi Najis Haid pada Pakaian",
        "perawi_melayu": "Dikisahkan oleh Asma':",
        "english_text": "A woman came to the Prophet (ﷺ) and said, \"If anyone of us gets menses in her clothes then what should she do?\" He replied, \"She should (take hold of the soiled place), rub it and put it in the water and rub it in order to remove the traces of blood and then pour water over it. Then she can pray in it.\"",
        "malay_translation": "Seorang wanita datang kepada Nabi (ﷺ) dan bertanya, \"Jika seseorang di antara kita terkena haid pada pakaiannya, apakah yang harus dilakukannya?\" Baginda menjawab, \"Hendaklah ia memegang (tempat yang terkena), menggosoknya dan memasukkannya ke dalam air serta menggosoknya untuk menghilangkan sisa darah lalu membasuhnya dengan air. Kemudian, dia boleh mengerjakan solat dengan pakaian tersebut.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، قَالَ حَدَّثَتْنِي فَاطِمَةُ، عَنْ أَسْمَاءَ، قَالَتْ جَاءَتِ امْرَأَةٌ النَّبِيَّ صلى الله عليه وسلم فَقَالَتْ أَرَأَيْتَ إِحْدَانَا تَحِيضُ فِي الثَّوْبِ كَيْفَ تَصْنَعُ قَالَ ‏ \"‏ تَحُتُّهُ، ثُمَّ تَقْرُصُهُ بِالْمَاءِ، وَتَنْضَحُهُ وَتُصَلِّي فِيهِ ‏\"‏‏.‏"
      },
      {
        "id": 228,
        "hadith_number": "228",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Peraturan Solat Bagi Wanita Yang Mengalami Pendarahan Tidak Haid",
        "perawi_melayu": "Dikisahkan oleh `Aishah",
        "english_text": "Fatima bint Abi Hubaish datang kepada Nabi (ﷺ) dan berkata, \"Wahai Rasulullah (ﷺ), saya mengalami pendarahan yang berterusan dari rahim dan tidak bersih. Adakah saya perlu berhenti solat?\" Rasulullah (ﷺ) menjawab, \"Tidak, kerana ia adalah daripada saluran darah dan bukan haid. Oleh itu, apabila haid sebenar anda bermula, berhentilah solat dan apabila selesai, mandilah dan tunaikan solat anda.\"\" Hisham (pencerita tambahan) meriwayatkan bahawa bapanya juga telah berkata (Nabi (ﷺ) memberitahunya): \"Lakukan wuduk untuk setiap solat sehingga datangnya tempoh haid yang seterusnya.\"",
        "malay_translation": "Fatimah binti Abi Hubaish datang kepada Nabi SAW dan berkata, \"Wahai Rasulullah SAW, saya mengalami pendarahan yang berterusan dari rahim dan tidak bersih. Adakah saya perlu berhenti solat?\" Rasulullah SAW menjawab, \"Tidak, kerana ia adalah daripada saluran darah dan bukan haid. Oleh itu, apabila haid sebenar anda bermula, berhentilah solat dan apabila selesai, mandilah dan tunaikan solat anda.\" Hisham (pencerita tambahan) meriwayatkan bahawa bapanya juga berkata (Nabi SAW memberitahunya): \"Lakukan wuduk untuk setiap solat sehingga datangnya tempoh haid yang seterusnya.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ جَاءَتْ فَاطِمَةُ ابْنَةُ أَبِي حُبَيْشٍ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي امْرَأَةٌ أُسْتَحَاضُ فَلاَ أَطْهُرُ، أَفَأَدَعُ الصَّلاَةَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ، إِنَّمَا ذَلِكِ عِرْقٌ، وَلَيْسَ بِحَيْضٍ، فَإِذَا أَقْبَلَتْ حَيْضَتُكِ فَدَعِي الصَّلاَةَ، وَإِذَا أَدْبَرَتْ فَاغْسِلِي عَنْكِ الدَّمَ ثُمَّ صَلِّي ‏\"‏‏.‏ قَالَ وَقَالَ أَبِي ‏\"‏ ثُمَّ تَوَضَّئِي لِكُلِّ صَلاَةٍ، حَتَّى يَجِيءَ ذَلِكَ الْوَقْتُ ‏\"‏‏.‏"
      },
      {
        "id": 229,
        "hadith_number": "229",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Membersihkan Noda Janabah dan Solat dengan Air yang Masih Tersisa di Pakaian",
        "perawi_melayu": "Dikisahkan oleh `Aishah",
        "english_text": "I used to wash the traces of Janaba (semen) from the clothes of the Prophet (ﷺ) and he used to go for prayers while traces of water were still on it (water spots were still visible).",
        "malay_translation": "Saya biasa membersihkan kesan janabah (mani) daripada pakaian Nabi SAW, dan baginda akan menunaikan solat walaupun terdapat kesan air (titik-titik air) yang masih kelihatan di atasnya.",
        "arabic_text": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا عَمْرُو بْنُ مَيْمُونٍ الْجَزَرِيُّ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أَغْسِلُ الْجَنَابَةَ مِنْ ثَوْبِ النَّبِيِّ صلى الله عليه وسلم، فَيَخْرُجُ إِلَى الصَّلاَةِ، وَإِنَّ بُقَعَ الْمَاءِ فِي ثَوْبِهِ‏.‏"
      },
      {
        "id": 230,
        "hadith_number": "230",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Menangani Pakaian yang Tercemar Air Mani",
        "perawi_melayu": "Diceritakan oleh Sulaiman bin Yasar:",
        "english_text": "I asked `Aisha about the clothes soiled with semen. She replied, \"I used to wash it off the clothes of Allah's Messenger (ﷺ) and he would go for the prayer while water spots were still visible. \"",
        "malay_translation": "Saya bertanya kepada `Aisha mengenai pakaian yang terkena najis mani. Beliau menjawab, \"Saya biasa membersihkan pakaian Rasulullah SAW yang terkena najis itu, dan baginda akan menunaikan solat sedangkan masih terdapat kesan air di atas pakaian tersebut.\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا يَزِيدُ، قَالَ حَدَّثَنَا عَمْرٌو، عَنْ سُلَيْمَانَ، قَالَ سَمِعْتُ عَائِشَةَ، ح وَحَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ حَدَّثَنَا عَمْرُو بْنُ مَيْمُونٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، قَالَ سَأَلْتُ عَائِشَةَ عَنِ الْمَنِيِّ، يُصِيبُ الثَّوْبَ فَقَالَتْ كُنْتُ أَغْسِلُهُ مِنْ ثَوْبِ رَسُولِ اللَّهِ صلى الله عليه وسلم، فَيَخْرُجُ إِلَى الصَّلاَةِ وَأَثَرُ الْغَسْلِ فِي ثَوْبِهِ بُقَعُ الْمَاءِ‏.‏"
      },
      {
        "id": 231,
        "hadith_number": "231",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Mencuci Baju yang Tercemar Air Mani",
        "perawi_melayu": "Dikisahkan oleh `Amr bin Maimun:",
        "english_text": "I heard Sulaiman bin Yasar talking about the clothes soiled with semen. He said that `Aisha had said, \"I used to wash it off the clothes of Allah's Messenger (ﷺ) and he would go for the prayers while water spots were still visible on them.",
        "malay_translation": "Saya mendengar Sulaiman bin Yasar menceritakan tentang pakaian yang terkena noda mani. Beliau berkata, `Aishah pernah berkata, \"Saya biasa membersihkan pakaian Rasulullah SAW yang terkena noda tersebut. Namun, beliau tetap mengerjakan solat walaupun masih terdapat kesan air pada pakaian tersebut.\"",
        "arabic_text": "حَدَّثَنَا مُوسَى، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ حَدَّثَنَا عَمْرُو بْنُ مَيْمُونٍ، قَالَ سَأَلْتُ سُلَيْمَانَ بْنَ يَسَارٍ فِي الثَّوْبِ تُصِيبُهُ الْجَنَابَةُ قَالَ قَالَتْ عَائِشَةُ كُنْتُ أَغْسِلُهُ مِنْ ثَوْبِ رَسُولِ اللَّهِ صلى الله عليه وسلم، ثُمَّ يَخْرُجُ إِلَى الصَّلاَةِ وَأَثَرُ الْغَسْلِ فِيهِ بُقَعُ الْمَاءِ‏.‏"
      },
      {
        "id": 232,
        "hadith_number": "232",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Membersihkan Mani dari Pakaian Nabi SAW",
        "perawi_melayu": "Dikisahkan oleh `Aishah:",
        "english_text": "I used to wash the semen off the clothes of the Prophet (ﷺ) and even then I used to notice one or more spots on them.",
        "malay_translation": "Saya biasa membersihkan mani dari pakaian Nabi SAW, dan walaupun begitu, saya masih melihat satu atau lebih noda di atasnya.",
        "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، قَالَ حَدَّثَنَا زُهَيْرٌ، قَالَ حَدَّثَنَا عَمْرُو بْنُ مَيْمُونِ بْنِ مِهْرَانَ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ عَائِشَةَ، أَنَّهَا كَانَتْ تَغْسِلُ الْمَنِيَّ مِنْ ثَوْبِ النَّبِيِّ صلى الله عليه وسلم، ثُمَّ أَرَاهُ فِيهِ بُقْعَةً أَوْ بُقَعًا‏.‏"
      },
      {
        "id": 233,
        "hadith_number": "233",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Orang-orang `Ukl dan `Uraina serta Hukuman Mereka",
        "perawi_melayu": "Diriwayatkan oleh Anas",
        "english_text": "\"Some people of `Ukl or `Uraina tribe came to Medina and its climate did not suit them. So the Prophet (ﷺ) ordered them to go to the herd of (Milch) camels and to drink their milk and urine (as a medicine). So they went as directed and after they became healthy, they killed the shepherd of the Prophet and drove away all the camels. The news reached the Prophet (ﷺ) early in the morning and he sent (men) in their pursuit and they were captured and brought at noon. He then ordered to cut their hands and feet (and it was done), and their eyes were branded with heated pieces of iron, They were put in 'Al-Harra' and when they asked for water, no water was given to them.\" Abu Qilaba said, \"Those people committed theft and murder, became infidels after embracing Islam and fought against Allah and His Apostle .\"",
        "malay_translation": "“Ada segolongan orang daripada suku `Ukl atau `Uraina datang ke Madinah dan iklimnya tidak sesuai dengan mereka. Maka Rasulullah SAW memerintahkan mereka pergi ke kawanan unta dan minum susu serta air kencingnya (sebagai ubat). Maka mereka pergi seperti yang diarahkan dan selepas mereka sihat, mereka membunuh gembala Rasulullah dan mengusir semua unta. Berita itu sampai ke Rasulullah SAW pada awal pagi dan baginda menghantar orang untuk mengejar mereka, dan mereka ditangkap serta dibawa pada tengah hari. Baginda kemudian memerintahkan untuk memotong tangan dan kaki mereka (dan ia dilakukan), dan mata mereka dibakar dengan kepingan besi panas. Mereka diletakkan di 'Al-Harra' dan apabila mereka meminta air, tiada air diberikan kepada mereka.” Abu Qilaba berkata, “Orang-orang itu melakukan pencurian dan pembunuhan, menjadi kafir setelah memeluk Islam dan memerangi Allah dan Rasul-Nya.”",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، قَالَ قَدِمَ أُنَاسٌ مِنْ عُكْلٍ أَوْ عُرَيْنَةَ، فَاجْتَوَوُا الْمَدِينَةَ، فَأَمَرَهُمُ النَّبِيُّ صلى الله عليه وسلم بِلِقَاحٍ، وَأَنْ يَشْرَبُوا مِنْ أَبْوَالِهَا وَأَلْبَانِهَا، فَانْطَلَقُوا، فَلَمَّا صَحُّوا قَتَلُوا رَاعِيَ النَّبِيِّ صلى الله عليه وسلم وَاسْتَاقُوا النَّعَمَ، فَجَاءَ الْخَبَرُ فِي أَوَّلِ النَّهَارِ، فَبَعَثَ فِي آثَارِهِمْ، فَلَمَّا ارْتَفَعَ النَّهَارُ جِيءَ بِهِمْ، فَأَمَرَ فَقَطَعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ، وَسُمِرَتْ أَعْيُنُهُمْ، وَأُلْقُوا فِي الْحَرَّةِ يَسْتَسْقُونَ فَلاَ يُسْقَوْنَ‏.‏ \r\nقَالَ أَبُو قِلاَبَةَ فَهَؤُلاَءِ سَرَقُوا وَقَتَلُوا وَكَفَرُوا بَعْدَ إِيمَانِهِمْ، وَحَارَبُوا اللَّهَ وَرَسُولَهُ‏.‏"
      },
      {
        "id": 234,
        "hadith_number": "234",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Nabi SAW Sebelum Pembinaan Masjid",
        "perawi_melayu": "Dikisahkan oleh Anas:",
        "english_text": "Prior to the construction of the mosque, the Prophet (ﷺ) offered the prayers at sheep-folds.",
        "malay_translation": "Sebelum pembinaan masjid, Nabi SAW menunaikan solat di kandang kambing.",
        "arabic_text": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنَا أَبُو التَّيَّاحِ، يَزِيدُ بْنُ حُمَيْدٍ عَنْ أَنَسٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي قَبْلَ أَنْ يُبْنَى الْمَسْجِدُ فِي مَرَابِضِ الْغَنَمِ‏.‏"
      },
      {
        "id": 235,
        "hadith_number": "235",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Mengatasi Minyak Sapi yang Tercemar Tikus",
        "perawi_melayu": "Dikisahkan oleh Maimuna:",
        "english_text": "Allah's Messenger (ﷺ) was asked regarding ghee (cooking butter) in which a mouse had fallen. He said, \"Take out the mouse and throw away the ghee around it and use the rest.\"",
        "malay_translation": "Rasulullah SAW ditanya mengenai minyak sapi (ghee) yang telah terkena seekor tikus. Baginda bersabda, \"Keluarkan tikus itu dan buang minyak sapi di sekitarnya, kemudian gunakan yang masih bersih.\"",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ عَنْ فَأْرَةٍ سَقَطَتْ فِي سَمْنٍ فَقَالَ ‏ \"‏ أَلْقُوهَا وَمَا حَوْلَهَا فَاطْرَحُوهُ‏.‏ وَكُلُوا سَمْنَكُمْ ‏\"‏‏.‏"
      },
      {
        "id": 236,
        "hadith_number": "236",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menyingkirkan Tikus dan Menggunakan Sedikit Lemak",
        "perawi_melayu": "Diriwayatkan oleh Maimuna:",
        "english_text": "The Prophet (ﷺ) was asked regarding ghee in which a mouse had fallen. He said, \"Take out the mouse and throw away the ghee around it (and use the rest.)\"",
        "malay_translation": "Nabi saw ditanya tentang mentega (ghee) yang telah jatuh seekor tikus ke dalamnya. Baginda bersabda, \"Keluarkan tikus itu dan buang mentega yang terkena tikus itu (dan gunakan yang lain).\" ",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا مَعْنٌ، قَالَ حَدَّثَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم سُئِلَ عَنْ فَأْرَةٍ سَقَطَتْ فِي سَمْنٍ فَقَالَ ‏ \"‏ خُذُوهَا وَمَا حَوْلَهَا فَاطْرَحُوهُ ‏\"‏‏.‏ قَالَ مَعْنٌ حَدَّثَنَا مَالِكٌ مَا لاَ أُحْصِيهِ يَقُولُ عَنِ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ‏.‏"
      },
      {
        "id": 237,
        "hadith_number": "237",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Luka Seorang Muslim dalam Jalan Allah di Hari Kebangkitan",
        "perawi_melayu": "Dikisahkan oleh Abu Hurairah:",
        "english_text": "The Prophet (ﷺ) said, \"A wound which a Muslim receives in Allah's cause will appear on the Day of Resurrection as it was at the time of infliction; blood will be flowing from the wound and its color will be that of the blood but will smell like musk.\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Luka seorang Muslim yang diperolehnya dalam perjuangan di jalan Allah akan muncul pada Hari Kiamat seperti ketika ia ditimpa; darah akan mengalir dari luka tersebut dan warnanya akan seperti warna darah, tetapi baunya seperti kasturi.\"",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ كُلُّ كَلْمٍ يُكْلَمُهُ الْمُسْلِمُ فِي سَبِيلِ اللَّهِ يَكُونُ يَوْمَ الْقِيَامَةِ كَهَيْئَتِهَا إِذْ طُعِنَتْ، تَفَجَّرُ دَمًا، اللَّوْنُ لَوْنُ الدَّمِ، وَالْعَرْفُ عَرْفُ الْمِسْكِ ‏\"‏‏.‏"
      },
      {
        "id": 238,
        "hadith_number": "238",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ummat Akhir Zaman Namun Mendahului pada Hari Kiamat",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
        "english_text": "Allah's Messenger (ﷺ) said, \"We (Muslims) are the last (people to come in the world) but (will be) the foremost (on the Day of Resurrection).\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Kami (umat Islam) adalah umat terakhir (yang datang ke dunia) tetapi akan menjadi yang terdahulu (pada Hari Kiamat).\"",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، قَالَ أَخْبَرَنَا أَبُو الزِّنَادِ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ هُرْمُزَ الأَعْرَجَ، حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ نَحْنُ الآخِرُونَ السَّابِقُونَ ‏\"‏‏.‏"
      },
      {
        "id": 239,
        "hadith_number": "239",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Kencing di Air Menggenang dan Kewajipan Mandi",
        "perawi_melayu": "Perawi yang sama meriwayatkan bahawa Nabi saw bersabda:",
        "english_text": "\"You should not pass urine in stagnant water which is not flowing then (you may need to) wash in it.\"",
        "malay_translation": "\"Jangan membuang air kecil di air yang tergenang dan tidak mengalir, kemudian (anda perlu) membersihkan diri di dalamnya.\"",
        "arabic_text": "وَبِإِسْنَادِهِ قَالَ ‏ \"‏ لاَ يَبُولَنَّ أَحَدُكُمْ فِي الْمَاءِ الدَّائِمِ الَّذِي لاَ يَجْرِي، ثُمَّ يَغْتَسِلُ فِيهِ ‏\"‏‏.‏"
      },
      {
        "id": 240,
        "hadith_number": "240",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Peristiwa Menyeksakan Nabi SAW dan Azab Allah Kepada Quraisy",
        "perawi_melayu": "Dikisahkan oleh `Abdullah bin Mas`ud:",
        "english_text": "Once the Prophet (ﷺ) was offering prayers at the Ka`ba. Abu Jahl was sitting with some of his companions. One of them said to the others, \"Who amongst you will bring the Abdominal contents (intestines, etc.) of a camel of Bani so and so and put it on the back of Muhammad, when he prostrates?\" The most unfortunate of them got up and brought it. He waited till the Prophet (ﷺ) prostrated and then placed it on his back between his shoulders. I was watching but could not do any thing. I wish I had some people with me to hold out against them. They started laughing and falling on one another. Allah's Messenger (ﷺ) was in prostration and he did not lift his head up till Fatima (Prophet's daughter) came and threw that (camel's Abdominal contents) away from his back. He raised his head and said thrice, \"O Allah! Punish Quraish.\" So it was hard for Abu Jahl and his companions when the Prophet invoked Allah against them as they had a conviction that the prayers and invocations were accepted in this city (Mecca). The Prophet (ﷺ) said, \"O Allah! Punish Abu Jahl, `Utba bin Rabi`a, Shaiba bin Rabi`a, Al-Walid bin `Utba, Umaiya bin Khalaf, and `Uqba bin Al Mu'it [??] (and he mentioned the seventh whose name I cannot recall). By Allah in Whose Hands my life is, I saw the dead bodies of those persons who were counted by Allah's Messenger (ﷺ) in the Qalib (one of the wells) of Badr.",
        "malay_translation": "Pada suatu ketika, Rasulullah SAW sedang menunaikan solat di Baitullah. Abu Jahal bersama beberapa sahabatnya sedang duduk. Salah seorang daripada mereka berkata kepada yang lain, \"Siapakah di antara kamu yang akan membawa isi perut (usus, dan sebagainya) unta Bani si fulan dan meletakkannya di atas punggung Muhammad semasa beliau sujud?\" Orang yang paling malang di antara mereka bangun dan membawanya. Ia menunggu sehingga Rasulullah SAW sujud, kemudian meletakkannya di atas punggung beliau di antara kedua bahu. Saya melihat tetapi tidak dapat berbuat apa-apa. Andainya ada orang bersama saya untuk menghalang mereka. Mereka mula tertawa dan saling terjatuh. Utusan Allah SAW dalam keadaan sujud dan tidak mengangkat kepala hingga Fatimah (puteri Nabi) datang dan membuang isi perut unta itu dari punggungnya. Beliau mengangkat kepala dan berdoa tiga kali, \"Ya Allah, azablah kaum Quraisy.\" Maka amat berat bagi Abu Jahal dan sahabatnya apabila Nabi SAW memohon azab Allah terhadap mereka kerana mereka yakin bahawa doa dan permohonan di kota ini (Mekah) akan dimakbulkan. Nabi SAW bersabda, \"Ya Allah, azablah Abu Jahal, `Utba bin Rabi`a, Shaiba bin Rabi`a, Al-Walid bin `Utba, Umaiya bin Khalaf, dan `Uqba bin Al Mu'it [??] (dan beliau menyebut nama yang ketujuh yang tidak saya ingat). Demi Allah yang jiwa saya di tangan-Nya, saya melihat mayat mereka yang disebut oleh Utusan Allah SAW di telaga Qalib di Badar.",
        "arabic_text": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنِي أَبِي، عَنْ شُعْبَةَ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، عَنْ عَبْدِ اللَّهِ، قَالَ بَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم سَاجِدٌ ح قَالَ وَحَدَّثَنِي أَحْمَدُ بْنُ عُثْمَانَ قَالَ حَدَّثَنَا شُرَيْحُ بْنُ مَسْلَمَةَ قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ يُوسُفَ عَنْ أَبِيهِ عَنْ أَبِي إِسْحَاقَ قَالَ حَدَّثَنِي عَمْرُو بْنُ مَيْمُونٍ أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ حَدَّثَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي عِنْدَ الْبَيْتِ، وَأَبُو جَهْلٍ وَأَصْحَابٌ لَهُ جُلُوسٌ، إِذْ قَالَ بَعْضُهُمْ لِبَعْضٍ أَيُّكُمْ يَجِيءُ بِسَلَى جَزُورِ بَنِي فُلاَنٍ فَيَضَعُهُ عَلَى ظَهْرِ مُحَمَّدٍ إِذَا سَجَدَ فَانْبَعَثَ أَشْقَى الْقَوْمِ فَجَاءَ بِهِ، فَنَظَرَ حَتَّى إِذَا سَجَدَ النَّبِيُّ صلى الله عليه وسلم وَضَعَهُ عَلَى ظَهْرِهِ بَيْنَ كَتِفَيْهِ وَأَنَا أَنْظُرُ، لاَ أُغَيِّرُ شَيْئًا، لَوْ كَانَ لِي مَنْعَةٌ‏.‏ قَالَ فَجَعَلُوا يَضْحَكُونَ وَيُحِيلُ بَعْضُهُمْ عَلَى بَعْضٍ، وَرَسُولُ اللَّهِ صلى الله عليه وسلم سَاجِدٌ لاَ يَرْفَعُ رَأْسَهُ، حَتَّى جَاءَتْهُ فَاطِمَةُ، فَطَرَحَتْ عَنْ ظَهْرِهِ، فَرَفَعَ رَأْسَهُ ثُمَّ قَالَ ‏\"‏ اللَّهُمَّ عَلَيْكَ بِقُرَيْشٍ ‏\"‏‏.‏ ثَلاَثَ مَرَّاتٍ، فَشَقَّ عَلَيْهِمْ إِذْ دَعَا عَلَيْهِمْ ـ قَالَ وَكَانُوا يُرَوْنَ أَنَّ الدَّعْوَةَ فِي ذَلِكَ الْبَلَدِ مُسْتَجَابَةٌ ـ ثُمَّ سَمَّى ‏\"‏ اللَّهُمَّ عَلَيْكَ بِأَبِي جَهْلٍ، وَعَلَيْكَ بِعُتْبَةَ بْنِ رَبِيعَةَ، وَشَيْبَةَ بْنِ رَبِيعَةَ، وَالْوَلِيدِ بْنِ عُتْبَةَ، وَأُمَيَّةَ بْنِ خَلَفٍ، وَعُقْبَةَ بْنِ أَبِي مُعَيْطٍ ‏\"‏‏.‏ وَعَدَّ السَّابِعَ فَلَمْ يَحْفَظْهُ قَالَ فَوَالَّذِي نَفْسِي بِيَدِهِ، لَقَدْ رَأَيْتُ الَّذِينَ عَدَّ رَسُولُ اللَّهِ صلى الله عليه وسلم صَرْعَى فِي الْقَلِيبِ قَلِيبِ بَدْرٍ‏.‏"
      },
      {
        "id": 241,
        "hadith_number": "241",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Meludah di Pakaiannya",
        "perawi_melayu": "Dikisahkan oleh Anas:",
        "english_text": "The Prophet (ﷺ) once spat in his clothes.",
        "malay_translation": "Rasulullah SAW pernah meludah di pakaiannya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ بَزَقَ النَّبِيُّ صلى الله عليه وسلم فِي ثَوْبِهِ‏.‏ طَوَّلَهُ ابْنُ أَبِي مَرْيَمَ قَالَ أَخْبَرَنَا يَحْيَى بْنُ أَيُّوبَ حَدَّثَنِي حُمَيْدٌ قَالَ سَمِعْتُ أَنَسًا عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 242,
        "hadith_number": "242",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Minuman Keras",
        "perawi_melayu": "Dikisahkan oleh Aisha رضی اللہ عنہا :",
        "english_text": "The Prophet (ﷺ) said, \"All drinks that produce intoxication are Haram (forbidden to drink).\"",
        "malay_translation": "Nabi SAW bersabda, \"Semua minuman yang memabukkan adalah haram untuk diminum.\"",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا الزُّهْرِيُّ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ كُلُّ شَرَابٍ أَسْكَرَ فَهُوَ حَرَامٌ ‏\"‏‏.‏"
      },
      {
        "id": 243,
        "hadith_number": "243",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rawatan Luka Baginda Rasulullah SAW",
        "perawi_melayu": "Dikisahkan oleh Abu Hazim:",
        "english_text": "Sahl bin Sa`d As-Sa`idi, ditanya oleh orang ramai, \"Dengan apa luka Nabi (ﷺ) dirawat?\" Sahl menjawab, \"Tidak ada orang yang hidup di antara kamu yang lebih mengetahuinya daripada aku. `Ali [??] biasa membawa air dalam perisainya dan Fatimah biasa membersihkan darah dari mukanya. Kemudian tikar jerami dibakar dan lukanya diisi dengannya.\"",
        "malay_translation": "Sahl bin Sa`d As-Sa`idi ditanya oleh orang ramai, \"Dengan apakah luka Baginda Nabi (ﷺ) dirawat?\" Sahl menjawab, \"Tidak ada orang yang hidup di antara kamu yang lebih mengetahui hal ini daripada aku. `Ali [??] biasa membawa air di dalam perisainya dan Fatimah biasa membersihkan darah dari wajah Baginda. Kemudian tikar jerami dibakar dan lukanya diisi dengan abu tersebut.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدٌ، قَالَ أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي حَازِمٍ، سَمِعَ سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ،، وَسَأَلَهُ النَّاسُ، وَمَا بَيْنِي وَبَيْنَهُ أَحَدٌ بِأَىِّ شَىْءٍ دُووِيَ جُرْحُ النَّبِيِّ صلى الله عليه وسلم فَقَالَ مَا بَقِيَ أَحَدٌ أَعْلَمُ بِهِ مِنِّي، كَانَ عَلِيٌّ يَجِيءُ بِتُرْسِهِ فِيهِ مَاءٌ، وَفَاطِمَةُ تَغْسِلُ عَنْ وَجْهِهِ الدَّمَ، فَأُخِذَ حَصِيرٌ فَأُحْرِقَ فَحُشِيَ بِهِ جُرْحُهُ‏.‏"
      },
      {
        "id": 244,
        "hadith_number": "244",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Penggunaan Siwak oleh Rasulullah SAW",
        "perawi_melayu": "Diceritakan oleh bapa Abu Burda (Abu Musa):",
        "english_text": "\"I came to the Prophet (ﷺ) and saw him carrying a Siwak in his hand and cleansing his teeth, saying, 'U' U',\" as if he was retching while the Siwak was in his mouth.\"",
        "malay_translation": "\"Aku datang kepada Rasulullah SAW dan melihat baginda memegang sebatang siwak di tangan dan membersihkan giginya sambil berkata, 'U' U',\" seakan-akan baginda muntah-muntah sementara siwak berada di dalam mulut.",
        "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ غَيْلاَنَ بْنِ جَرِيرٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَوَجَدْتُهُ يَسْتَنُّ بِسِوَاكٍ بِيَدِهِ يَقُولُ ‏ \"‏ أُعْ أُعْ ‏\"‏، وَالسِّوَاكُ فِي فِيهِ، كَأَنَّهُ يَتَهَوَّعُ‏.‏"
      },
      {
        "id": 245,
        "hadith_number": "245",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Petunjuk Nabi SAW Mengenai Membersihkan Mulut Dengan Siwak Pada Waktu Malam",
        "perawi_melayu": "Dikisahkan oleh Hudhaifa:",
        "english_text": "Whenever the Prophet (ﷺ) got up at night, he used to clean his mouth with Siwak.",
        "malay_translation": "Setiap kali Nabi (ﷺ) bangun pada waktu malam, baginda akan membersihkan mulutnya dengan siwak.",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا قَامَ مِنَ اللَّيْلِ يَشُوصُ فَاهُ بِالسِّوَاكِ‏.‏"
      },
      {
        "id": 246,
        "hadith_number": "246",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Mengimani Mimpi Membersihkan Gigi dengan Siwak",
        "perawi_melayu": "Dikisahkan oleh Ibn 'Umar:",
        "english_text": "The Prophet (ﷺ) said, \"I dreamt that I was cleaning my teeth with a Siwak and two persons came to me. One of them was older than the other and I gave the Siwak to the younger. I was told that I should give it to the older and so I did.\"",
        "malay_translation": "Baginda Rasulullah (ﷺ) bersabda, \"Aku bermimpi sedang membersihkan gigi dengan siwak dan dua orang mendatangiku. Salah seorang lebih tua dari yang lain, dan aku memberikan siwak itu kepada yang lebih muda. Aku diberitahu supaya memberikannya kepada yang lebih tua, dan aku pun melakukannya.\"",
        "arabic_text": "وَقَالَ عَفَّانُ حَدَّثَنَا صَخْرُ بْنُ جُوَيْرِيَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَرَانِي أَتَسَوَّكُ بِسِوَاكٍ، فَجَاءَنِي رَجُلاَنِ أَحَدُهُمَا أَكْبَرُ مِنَ الآخَرِ، فَنَاوَلْتُ السِّوَاكَ الأَصْغَرَ مِنْهُمَا، فَقِيلَ لِي كَبِّرْ‏.‏ فَدَفَعْتُهُ إِلَى الأَكْبَرِ مِنْهُمَا ‏\"‏‏.\r\n‏ قَالَ أَبُو عَبْدِ اللَّهِ اخْتَصَرَهُ نُعَيْمٌ عَنِ ابْنِ الْمُبَارَكِ عَنْ أُسَامَةَ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ‏.‏"
      },
      {
        "id": 247,
        "hadith_number": "247",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Petunjuk Tidur dengan Keimanan dan Keyakinan",
        "perawi_melayu": "Al-Bara' bin `Azib",
        "english_text": "The Prophet (ﷺ) said to me, \"Whenever you go to bed perform ablution like that for the prayer, lie or your right side and say, \"Allahumma aslamtu wajhi ilaika, wa fauwadtu `Amri ilaika, wa alja'tu Zahri ilaika raghbatan wa rahbatan ilaika. La Malja'a wa la manja minka illa ilaika. Allahumma amantu bikitabika-l-ladhi anzalta wa bina-biyika-l ladhi arsalta\" (O Allah! I surrender to You and entrust all my affairs to You and depend upon You for Your Blessings both with hope and fear of You. There is is no fleeing from You, and there is no place of protection and safety except with You O Allah! I believe in Your Book (the Qur'an) which You have revealed and in Your Prophet (Muhammad) whom You have sent). Then if you die on that very night, you will die with faith (i.e. or the religion of Islam). Let the aforesaid words be your last utterance (before sleep).\" I repeated it before the Prophet (ﷺ) and when I reached \"Allahumma amantu bikitabika-l-ladhi anzalta (O Allah I believe in Your Book which You have revealed).\" I said, \"Wa-rasulika (and your Apostle).\" The Prophet (ﷺ) said, \"No, (but say): 'Wanabiyika-l-ladhi arsalta (Your Prophet whom You have sent), instead.\"",
        "malay_translation": "Rasulullah SAW bersabda kepadaku, \"Apabila kamu hendak tidur, lakukan wuduk seperti untuk solat, baringlah di sebelah kanan dan ucapkan, \"Allahumma aslamtu wajhi ilaika, wa fauwadtu `Amri ilaika, wa alja'tu Zahri ilaika raghbatan wa rahbatan ilaika. La Malja'a wa la manja minka illa ilaika. Allahumma amantu bikitabika-l-ladhi anzalta wa bina-biyika-l ladhi arsalta\" (Ya Allah! Aku menyerahkan diriku kepadamu, dan aku menyerahkan segala urusanku kepadamu, dan aku mengharapkan keberkatanMu dengan penuh harapan dan takut kepadaMu. Tiada tempat berlindung dan keselamatan daripada Engkau melainkan kepada Engkau Ya Allah! Aku beriman kepada Kitab-Mu (al-Quran) yang Engkau turunkan dan kepada Nabi-Mu Muhammad yang Engkau utuskan). Jika kamu meninggal pada malam itu, kamu akan meninggal dalam keadaan beriman (iaitu dalam agama Islam). Jadikan perkataan di atas sebagai ucapan terakhir sebelum tidur.\"\" Aku mengulangi perkataan tersebut di hadapan Rasulullah SAW dan ketika aku sampai kepada \"Allahumma amantu bikitabika-l-ladhi anzalta (Ya Allah! Aku beriman kepada Kitab-Mu yang Engkau turunkan).\" aku berkata, \"Wa-rasulika (dan Rasul-Mu).\" Rasulullah SAW menjawab, \"Tidak, (tetapi ucapkan): 'Wanabiyika-l-ladhi arsalta (Nabi-Mu yang Engkau utuskan), sebagai gantinya.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِذَا أَتَيْتَ مَضْجَعَكَ فَتَوَضَّأْ وُضُوءَكَ لِلصَّلاَةِ، ثُمَّ اضْطَجِعْ عَلَى شِقِّكَ الأَيْمَنِ، ثُمَّ قُلِ اللَّهُمَّ أَسْلَمْتُ وَجْهِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لاَ مَلْجَأَ وَلاَ مَنْجَا مِنْكَ إِلاَّ إِلَيْكَ، اللَّهُمَّ آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ‏.‏ فَإِنْ مُتَّ مِنْ لَيْلَتِكَ فَأَنْتَ عَلَى الْفِطْرَةِ، وَاجْعَلْهُنَّ آخِرَ مَا تَتَكَلَّمُ بِهِ ‏\"‏‏.‏ قَالَ فَرَدَّدْتُهَا عَلَى النَّبِيِّ صلى الله عليه وسلم فَلَمَّا بَلَغْتُ ‏\"‏ اللَّهُمَّ آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ ‏\"‏‏.‏ قُلْتُ وَرَسُولِكَ‏.‏ قَالَ ‏\"‏ لاَ، وَنَبِيِّكَ الَّذِي أَرْسَلْتَ ‏\"‏‏.‏"
      }
    ]
  }
}