{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 81,
    "data": [
      {
        "id": 6356,
        "hadith_number": "6621",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Abu Bakr As-Siddiq tentang Pembatalan Sumpah dan Kifarah",
        "perawi_melayu": "Diriwayatkan daripada `Aisha رضي الله عنها :",
        "english_text": "Abu Bakr As-Siddiq رضی اللہ عنہ had never broken his oaths till Allah revealed the expiation for the oaths. Then he said, \"If I take an oath to do something and later on I find something else better than the first one, then I do what is better and make expiation for my oath.\"",
        "malay_translation": "Abu Bakr As-Siddiq رضي الله عنه tidak pernah memungkiri sumpah-sumpahnya sehinggalah Allah menurunkan kifarah (tebusan) bagi sumpah-sumpah tersebut. Kemudian dia berkata, \"Jika aku bersumpah untuk melakukan sesuatu dan kemudiannya aku mendapati ada perkara lain yang lebih baik daripada yang pertama, maka aku akan melakukan perkara yang lebih baik itu dan membayar kifarah bagi sumpahku.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ لَمْ يَكُنْ يَحْنَثُ فِي يَمِينٍ قَطُّ، حَتَّى أَنْزَلَ اللَّهُ كَفَّارَةَ الْيَمِينِ وَقَالَ لاَ أَحْلِفُ عَلَى يَمِينٍ فَرَأَيْتُ غَيْرَهَا خَيْرًا مِنْهَا، إِلاَّ أَتَيْتُ الَّذِي هُوَ خَيْرٌ، وَكَفَّرْتُ عَنْ يَمِينِي‏.‏"
      },
      {
        "id": 6357,
        "hadith_number": "6622",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nasihat Nabi ﷺ kepada 'Abdur-Rahman bin Samura tentang Kepimpinan dan Sumpah",
        "perawi_melayu": "Diriwayatkan daripada 'Abdur-Rahman bin Samura رضي الله عنه :",
        "english_text": "The Prophet (ﷺ) said, \"O `Abdur-Rahman bin Samura! Do not seek to be a ruler, because if you are given authority for it, then you will be held responsible for it, but if you are given it without asking for it, then you will be helped in it (by Allah): and whenever you take an oath to do something and later you find that something else is better than the first, then do the better one and make expiation for your oath.\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Wahai 'Abdur-Rahman bin Samura! Janganlah kamu berusaha untuk menjadi pemerintah, kerana jika kamu diberi kuasa untuk itu, maka kamu akan dipertanggungjawabkan mengenainya, tetapi jika kamu diberi tanpa memintanya, maka kamu akan dibantu di dalamnya (oleh Allah); dan apabila kamu bersumpah untuk melakukan sesuatu dan kemudian kamu mendapati bahawa sesuatu yang lain adalah lebih baik daripada yang pertama, maka lakukanlah yang lebih baik itu dan bayarlah kafarah sumpahmu.\"",
        "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ، مُحَمَّدُ بْنُ الْفَضْلِ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، حَدَّثَنَا الْحَسَنُ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَمُرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ يَا عَبْدَ الرَّحْمَنِ بْنَ سَمُرَةَ لاَ تَسْأَلِ الإِمَارَةَ، فَإِنَّكَ إِنْ أُوتِيتَهَا عَنْ مَسْأَلَةٍ وُكِلْتَ إِلَيْهَا، وَإِنْ أُوتِيتَهَا مِنْ غَيْرِ مَسْأَلَةٍ أُعِنْتَ عَلَيْهَا، وَإِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا، فَكَفِّرْ عَنْ يَمِينِكَ، وَأْتِ الَّذِي هُوَ خَيْرٌ ‏\"‏‏.‏"
      },
      {
        "id": 6358,
        "hadith_number": "6623",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Permohonan Tunggangan dan Kaffarah Sumpah",
        "perawi_melayu": "Diriwayatkan daripada bapa Abu Burdah (Hadrat Abu Musa Ashari) رضی اللہ عنہ :",
        "english_text": "I went to the Prophet (ﷺ) along with a group of Al-Ash`ariyin in order to request him to provide us with mounts. He said, \"By Allah, I will not provide you with mounts and I haven't got anything to mount you on.\" Then we stayed there as long as Allah wished us to stay, and then three very nice looking she-camels were brought to him and he made us ride them. When we left, we, or some of us, said, \"By Allah, we will not be blessed, as we came to the Prophet (ﷺ) asking him for mounts, and he swore that he would not give us any mounts but then he did give us. So let us go back to the Prophet (ﷺ) and remind him (of his oath).\" When we returned to him (and reminded him of the fact), he said, \"I did not give you mounts, but it is Allah Who gave you. By Allah, Allah willing, if I ever take an oath to do something and then I find something else than the first, I will make expiation for my oath and do the thing which is better (or do something which is better and give the expiation for my oath).\"",
        "malay_translation": "Saya pergi kepada Nabi (ﷺ) bersama-sama sekumpulan Al-Ash'ariyin untuk memohon kepada baginda agar menyediakan kami dengan tunggangan. Baginda bersabda, \"Demi Allah, aku tidak akan menyediakan kamu dengan tunggangan dan aku tidak mempunyai apa-apa untuk menunggang kamu.\" Kemudian kami tinggal di sana selama mana Allah menghendaki kami tinggal, dan kemudian tiga ekor unta betina yang sangat cantik dibawa kepada baginda dan baginda menyuruh kami menunggangnya. Apabila kami pergi, kami, atau sebahagian daripada kami, berkata, \"Demi Allah, kita tidak akan diberkati, kerana kita datang kepada Nabi (ﷺ) meminta baginda tunggangan, dan baginda bersumpah tidak akan memberi kami tunggangan tetapi kemudian baginda memberikannya kepada kami. Jadi, marilah kita kembali kepada Nabi (ﷺ) dan mengingatkannya (tentang sumpahnya).\" Apabila kami kembali kepadanya (dan mengingatkannya tentang fakta tersebut), baginda bersabda, \"Aku tidak memberi kamu tunggangan, tetapi Allah yang memberinya kepada kamu. Demi Allah, jika Allah menghendaki, jika aku pernah bersumpah untuk melakukan sesuatu dan kemudian aku dapati sesuatu yang lain daripada yang pertama, aku akan membayar kaffarah untuk sumpahku dan melakukan perkara yang lebih baik (atau melakukan sesuatu yang lebih baik dan memberi kaffarah untuk sumpahnya).",
        "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ غَيْلاَنَ بْنِ جَرِيرٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فِي رَهْطٍ مِنَ الأَشْعَرِيِّينَ أَسْتَحْمِلُهُ فَقَالَ ‏\"‏ وَاللَّهِ لاَ أَحْمِلُكُمْ، وَمَا عِنْدِي مَا أَحْمِلُكُمْ عَلَيْهِ ‏\"‏‏.‏ قَالَ ثُمَّ لَبِثْنَا مَا شَاءَ اللَّهُ أَنْ نَلْبَثَ، ثُمَّ أُتِيَ بِثَلاَثِ ذَوْدٍ غُرِّ الذُّرَى فَحَمَلَنَا عَلَيْهَا فَلَمَّا انْطَلَقْنَا قُلْنَا أَوْ قَالَ بَعْضُنَا وَاللَّهِ لاَ يُبَارَكُ لَنَا، أَتَيْنَا النَّبِيَّ صلى الله عليه وسلم نَسْتَحْمِلُهُ، فَحَلَفَ أَنْ لاَ يَحْمِلَنَا ثُمَّ حَمَلَنَا، فَارْجِعُوا بِنَا إِلَى النَّبِيِّ صلى الله عليه وسلم فَنُذَكِّرُهُ، فَأَتَيْنَاهُ فَقَالَ ‏\"‏ مَا أَنَا حَمَلْتُكُمْ، بَلِ اللَّهُ حَمَلَكُمْ، وَإِنِّي وَاللَّهِ إِنْ شَاءَ اللَّهُ لاَ أَحْلِفُ عَلَى يَمِينٍ فَأَرَى غَيْرَهَا خَيْرًا مِنْهَا، إِلاَّ كَفَّرْتُ عَنْ يَمِينِي، وَأَتَيْتُ الَّذِي هُوَ خَيْرٌ ‏\"‏‏.‏ أَوْ ‏\"‏ أَتَيْتُ الَّذِي هُوَ خَيْرٌ وَكَفَّرْتُ عَنْ يَمِينِي ‏\"‏‏.‏"
      },
      {
        "id": 6359,
        "hadith_number": "6624, 6625",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Umat Islam Terakhir di Dunia, Terawal di Hari Kiamat dan Pentingnya Memenuhi Sumpah",
        "perawi_melayu": "Diriwayatkan oleh Abu Huraira رضي اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) said, \"We (Muslims) are the last in the world, but will be foremost on the Day of Resurrection.\" Allah's Messenger (ﷺ) also said: \"By Allah, if anyone of you insists on fulfilling an oath by which he may harm his family, he commits a greater sin in Allah's sight than that of dissolving his oath and making expiation for it.\"",
        "malay_translation": "Nabi (ﷺ) bersabda, \"Kita (umat Islam) adalah yang terakhir di dunia, tetapi akan menjadi yang terawal pada Hari Kiamat.\" Rasulullah (ﷺ) juga bersabda: \"Demi Allah, jika sesiapa di antara kamu berkeras untuk memenuhi sumpah yang boleh memudaratkan keluarganya, dia melakukan dosa yang lebih besar di sisi Allah daripada membatalkan sumpahnya dan membayar kafarah untuknya.\"",
        "arabic_text": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ نَحْنُ الآخِرُونَ السَّابِقُونَ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ وَاللَّهِ لأَنْ يَلِجَّ أَحَدُكُمْ بِيَمِينِهِ فِي أَهْلِهِ آثَمُ لَهُ عِنْدَ اللَّهِ مِنْ أَنْ يُعْطِيَ كَفَّارَتَهُ الَّتِي افْتَرَضَ اللَّهُ عَلَيْهِ ‏\"‏‏.‏"
      },
      {
        "id": 6361,
        "hadith_number": "6626",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Dosa Lebih Besar Jika Bersumpah Menyusahkan Keluarga",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) said, \"Anyone who takes an oath through which his family may be harmed, and insists on keeping it, he surely commits a sin greater (than that of dissolving his oath). He should rather compensate for that oath by making expiation.\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Sesiapa yang bersumpah yang boleh memudaratkan keluarganya, dan berkeras untuk menunaikannya, sesungguhnya dia telah melakukan dosa yang lebih besar (daripada membatalkan sumpahnya). Sebaliknya, dia harus membayar kaffarah (denda) untuk sumpah tersebut.\"",
        "arabic_text": "حَدَّثَنِي إِسْحَاقُ يَعْنِي ابْنَ إِبْرَاهِيمَ، حَدَّثَنَا يَحْيَى بْنُ صَالِحٍ، حَدَّثَنَا مُعَاوِيَةُ، عَنْ يَحْيَى، عَنْ عِكْرِمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنِ اسْتَلَجَّ فِي أَهْلِهِ بِيَمِينٍ فَهْوَ أَعْظَمُ إِثْمًا، لِيَبَرَّ ‏\"‏‏.‏ يَعْنِي الْكَفَّارَةَ‏.‏"
      },
      {
        "id": 6362,
        "hadith_number": "6627",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kecintaan Nabi (ﷺ) kepada Usama bin Zaid dan Ayahnya",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Umar رضی اللہ عنہما :",
        "english_text": "Allah's Messenger (ﷺ) sent an army detachment and made Usama bin Zaid its commander. Some people criticized (spoke badly of) Usama's leadership. So Allah's Messenger (ﷺ) got up saying, \"If you people are criticizing Usama's leadership, you have already criticized the leadership of his father before. But Waaimullah (i.e., By Allah), he (i.e. Zaid رضی اللہ عنہ ) deserved the leadership, and he was one of the most beloved persons to me; and now this (his son Usama رضی اللہ عنہ ) is one of the dearest persons to me after him.\" (See Hadith No. 765, Vol. 5)",
        "malay_translation": "Rasulullah (ﷺ) mengutus satu pasukan tentera dan melantik Usama bin Zaid sebagai ketua mereka. Sebahagian orang mengkritik (bercakap buruk tentang) kepimpinan Usama. Maka Rasulullah (ﷺ) bangun dan bersabda, \"Jika kamu mengkritik kepimpinan Usama, sesungguhnya kamu telah mengkritik kepimpinan ayahnya dahulu. Tetapi Waaimullah (iaitu, Demi Allah), sesungguhnya dia (iaitu Zaid رضی اللہ عنہ ) layak memegang kepimpinan itu, dan dia adalah antara orang yang paling aku cintai; dan sekarang (anaknya Usama رضی اللہ عنہ ) adalah antara orang yang paling aku kasihi selepasnya.\" (Lihat Hadith No. 765, Jil. 5)",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ إِسْمَاعِيلَ بْنِ جَعْفَرٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَعْثًا وَأَمَّرَ عَلَيْهِمْ أُسَامَةَ بْنَ زَيْدٍ، فَطَعَنَ بَعْضُ النَّاسِ فِي إِمْرَتِهِ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ إِنْ كُنْتُمْ تَطْعَنُونَ فِي إِمْرَتِهِ فَقَدْ كُنْتُمْ تَطْعَنُونَ، فِي إِمْرَةِ أَبِيهِ مِنْ قَبْلُ، وَايْمُ اللَّهِ إِنْ كَانَ لَخَلِيقًا لِلإِمَارَةِ، وَإِنْ كَانَ لَمِنْ أَحَبِّ النَّاسِ إِلَىَّ، وَإِنَّ هَذَا لَمِنْ أَحَبِّ النَّاسِ إِلَىَّ بَعْدَهُ ‏\"‏‏.‏"
      },
      {
        "id": 6363,
        "hadith_number": "6628",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Sumpah Nabi ﷺ: 'Tidak, Demi Dia Yang Membolak-balikkan Hati'",
        "perawi_melayu": "Diriwayatkan oleh Ibnu 'Umar رضي الله عنهما",
        "english_text": "The oath of the Prophet (ﷺ) used to be: \"No, by Him who turns the hearts.\"",
        "malay_translation": "Sumpah Nabi ﷺ adalah: \"Tidak, demi Dia Yang Membolak-balikkan hati.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، عَنْ سُفْيَانَ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَتْ يَمِينُ النَّبِيِّ صلى الله عليه وسلم ‏ \"‏ لاَ وَمُقَلِّبِ الْقُلُوبِ ‏\"‏‏.‏"
      },
      {
        "id": 6364,
        "hadith_number": "6629",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ramalan Nabi tentang Keruntuhan Empayar dan Perbelanjaan Harta",
        "perawi_melayu": "Diriwayatkan oleh Jabir bin Samura رضي الله عنه:",
        "english_text": "The Prophet (ﷺ) said, \"If Caesar is ruined, there will be no Caesar after him; and if Khosrau is ruined, there will be no Khosrau, after him; and, by Him in Whose Hand my soul is, surely you will spend their treasures in Allah's Cause.\"",
        "malay_translation": "Nabi ﷺ bersabda, \"Jika Caesar binasa, tidak akan ada lagi Caesar selepasnya; dan jika Khosrau binasa, tidak akan ada lagi Khosrau selepasnya; dan demi Tuhan yang jiwaku berada di tangan-Nya, sesungguhnya kamu akan membelanjakan khazanah mereka di jalan Allah.\"",
        "arabic_text": "حَدَّثَنَا مُوسَى، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ، عَنْ جَابِرِ بْنِ سَمُرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا هَلَكَ قَيْصَرُ فَلاَ قَيْصَرَ بَعْدَهُ، وَإِذَا هَلَكَ كِسْرَى فَلاَ كِسْرَى بَعْدَهُ، وَالَّذِي نَفْسِي بِيَدِهِ لَتُنْفَقَنَّ كُنُوزُهُمَا فِي سَبِيلِ اللَّهِ ‏\"‏‏.‏"
      },
      {
        "id": 6365,
        "hadith_number": "6630",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kerosakan Khosrau dan Caesar serta Pembelanjaan Harta di Jalan Allah",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضي اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) said, \"If Khosrau is ruined, there will be no Khosrau after him; and if Caesar is ruined, there will be no Caesar after him. By Him in Whose Hand Muhammad's soul is, surely you will spend their treasures in Allah's Cause.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Apabila Khosrau binasa, tiada lagi Khosrau selepasnya; dan apabila Caesar binasa, tiada lagi Caesar selepasnya. Demi Tuhan yang jiwa Muhammad berada di tangan-Nya, sesungguhnya kamu akan membelanjakan harta mereka di jalan Allah.\"",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا هَلَكَ كِسْرَى فَلاَ كِسْرَى بَعْدَهُ، وَإِذَا هَلَكَ قَيْصَرُ فَلاَ قَيْصَرَ بَعْدَهُ، وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَتُنْفَقَنَّ كُنُوزُهُمَا فِي سَبِيلِ اللَّهِ ‏\"‏‏.‏"
      },
      {
        "id": 6366,
        "hadith_number": "6631",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Tangisan dan Ketawa: Pesanan Nabi Muhammad ﷺ",
        "perawi_melayu": "Riwayat daripada `Aisha رضي الله عنها :",
        "english_text": "The Prophet (ﷺ) said, \"O followers of Muhammad! By Allah, if you knew what I know, you would weep much and laugh little.\"",
        "malay_translation": "Nabi ﷺ bersabda, \"Wahai pengikut Muhammad! Demi Allah, sekiranya kamu mengetahui apa yang aku ketahui, nescaya kamu akan banyak menangis dan sedikit ketawa.\"",
        "arabic_text": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا عَبْدَةُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ يَا أُمَّةَ مُحَمَّدٍ وَاللَّهِ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَبَكَيْتُمْ كَثِيرًا، وَلَضَحِكْتُمْ قَلِيلاً ‏\"‏‏.‏"
      },
      {
        "id": 6367,
        "hadith_number": "6632",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kecintaan Terhadap Nabi ﷺ Melebihi Diri Sendiri",
        "perawi_melayu": "Diriwayatkan daripada `Abdullah bin Hisham:",
        "english_text": "We were with the Prophet (ﷺ) and he was holding the hand of `Umar bin Al-Khattab. `Umar said to Him, \"O Allah's Messenger (ﷺ)! You are dearer to me than everything except my own self.\" The Prophet (ﷺ) said, \"No, by Him in Whose Hand my soul is, (you will not have complete faith) till I am dearer to you than your own self.\" Then `Umar said to him, \"However, now, by Allah, you are dearer to me than my own self.\" The Prophet (ﷺ) said, \"Now, O `Umar, (now you are a believer).",
        "malay_translation": "Kami bersama Nabi ﷺ dan baginda memegang tangan `Umar bin Al-Khattab. `Umar berkata kepada baginda, \"Wahai Rasulullah ﷺ! Tuan lebih saya cintai daripada segala sesuatu kecuali diri saya sendiri.\" Nabi ﷺ bersabda, \"Tidak, demi Zat yang di tangan-Nya nyawaku berada, (kamu tidak akan memiliki keimanan yang sempurna) sehingga aku lebih kamu cintai daripada dirimu sendiri.\" Kemudian `Umar berkata kepada baginda, \"Namun, sekarang, demi Allah, Tuan lebih saya cintai daripada diri saya sendiri.\" Nabi ﷺ bersabda, \"Sekarang, wahai `Umar, (sekarang kamu seorang mukmin).\"",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي حَيْوَةُ، قَالَ حَدَّثَنِي أَبُو عَقِيلٍ، زُهْرَةُ بْنُ مَعْبَدٍ أَنَّهُ سَمِعَ جَدَّهُ عَبْدَ اللَّهِ بْنَ هِشَامٍ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم وَهْوَ آخِذٌ بِيَدِ عُمَرَ بْنِ الْخَطَّابِ فَقَالَ لَهُ عُمَرُ يَا رَسُولَ اللَّهِ لأَنْتَ أَحَبُّ إِلَىَّ مِنْ كُلِّ شَىْءٍ إِلاَّ مِنْ نَفْسِي‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ وَالَّذِي نَفْسِي بِيَدِهِ حَتَّى أَكُونَ أَحَبَّ إِلَيْكَ مِنْ نَفْسِكَ ‏\"‏‏.‏ فَقَالَ لَهُ عُمَرُ فَإِنَّهُ الآنَ وَاللَّهِ لأَنْتَ أَحَبُّ إِلَىَّ مِنْ نَفْسِي‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ الآنَ يَا عُمَرُ ‏\"‏‏.‏"
      },
      {
        "id": 6368,
        "hadith_number": "6633, 6634",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keputusan Nabi Muhammad (ﷺ) dalam Perselisihan (Kes Zina)",
        "perawi_melayu": "Diriwayatkan oleh Abu Huraira رضی اللہ عنہ dan Zaid bin Khalid رضی اللہ عنہ :",
        "english_text": "Two men had a dispute in the presence of Allah's Messenger (ﷺ). One of them said, \"O Allah's Messenger (ﷺ)! Judge between us according to Allah's Laws.\" The other who was wiser, said, \"Yes, O Allah's Apostle! Judge between us according to Allah's Laws and allow me to speak.\" The Prophet (ﷺ) said, \"Speak.\" He said, \"My son was a laborer serving this (person) and he committed illegal sexual intercourse with his wife, The people said that my son is to be stoned to death, but I ransomed him with one-hundred sheep and a slave girl. Then I asked the learned people, who informed me that my son should receive one hundred lashes and will be exiled for one year, and stoning will be the lot for the man's wife.\" Allah's Messenger (ﷺ) said, \"Indeed, by Him in Whose Hand my soul is, I will judge between you according to Allah's Laws: As for your sheep and slave girl, they are to be returned to you.\" Then he scourged his son one hundred lashes and exiled him for one year. Then Unais Al-Aslami was ordered to go to the wife of the second man, and if she confessed (the crime), then stone her to death. She did confess, so he stoned her to death.",
        "malay_translation": "Dua orang lelaki berselisih di hadapan Rasulullah (ﷺ). Seorang daripada mereka berkata, \"Wahai Rasulullah (ﷺ)! Hukumkanlah antara kami mengikut hukum Allah.\" Seorang lagi yang lebih bijak berkata, \"Ya, wahai Rasulullah! Hukumkanlah antara kami mengikut hukum Allah dan izinkan saya untuk bercakap.\" Nabi (ﷺ) berkata, \"Bercakaplah.\" Lelaki itu berkata, \"Anak saya adalah seorang pekerja yang berkhidmat dengan orang ini dan dia telah melakukan persetubuhan haram dengan isterinya. Orang ramai berkata bahawa anak saya patut direjam sampai mati, tetapi saya telah menebusnya dengan seratus ekor biri-biri dan seorang hamba perempuan. Kemudian saya bertanya kepada orang yang berilmu, yang memberitahu saya bahawa anak saya harus menerima seratus kali sebatan dan akan dibuang negeri selama setahun, dan rejam akan menjadi hukuman untuk isteri lelaki itu.\" Rasulullah (ﷺ) bersabda, \"Demi Dia yang di tangan-Nya jiwa saya, saya akan menghukum antara kamu mengikut hukum Allah: Adapun biri-biri dan hamba perempuan kamu, mereka harus dikembalikan kepada kamu.\" Kemudian baginda mencambuk anaknya seratus kali sebatan dan membuangnya negeri selama setahun. Kemudian Unais Al-Aslami diperintahkan untuk pergi kepada isteri lelaki kedua, dan jika dia mengaku (kesalahan itu), maka rejamlah dia sampai mati. Dia mengaku, jadi dia merejamnya sampai mati.",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ أَبِي هُرَيْرَةَ، وَزَيْدِ بْنِ خَالِدٍ، أَنَّهُمَا أَخْبَرَاهُ أَنَّ رَجُلَيْنِ اخْتَصَمَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ أَحَدُهُمَا اقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ‏.‏ وَقَالَ الآخَرُ وَهْوَ أَفْقَهُهُمَا أَجَلْ يَا رَسُولَ اللَّهِ فَاقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ، وَائْذَنْ لِي أَنْ أَتَكَلَّمَ‏.‏ قَالَ ‏\"‏ تَكَلَّمْ ‏\"‏‏.‏ قَالَ إِنَّ ابْنِي كَانَ عَسِيفًا عَلَى هَذَا ـ قَالَ مَالِكٌ وَالْعَسِيفُ الأَجِيرُ ـ زَنَى بِامْرَأَتِهِ، فَأَخْبَرُونِي أَنَّ عَلَى ابْنِي الرَّجْمَ، فَافْتَدَيْتُ مِنْهُ بِمِائَةِ شَاةٍ وَجَارِيَةٍ لِي، ثُمَّ إِنِّي سَأَلْتُ أَهْلَ الْعِلْمِ فَأَخْبَرُونِي أَنَّ مَا عَلَى ابْنِي جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ، وَإِنَّمَا الرَّجْمُ عَلَى امْرَأَتِهِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمَا وَالَّذِي نَفْسِي بِيَدِهِ لأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ، أَمَّا غَنَمُكَ وَجَارِيَتُكَ فَرَدٌّ عَلَيْكَ ‏\"‏‏.‏ وَجَلَدَ ابْنَهُ مِائَةً وَغَرَّبَهُ عَامًا، وَأُمِرَ أُنَيْسٌ الأَسْلَمِيُّ أَنْ يَأْتِيَ امْرَأَةَ الآخَرِ، فَإِنِ اعْتَرَفَتْ رَجَمَهَا، فَاعْتَرَفَتْ فَرَجَمَهَا‏.‏"
      },
      {
        "id": 6369,
        "hadith_number": "6635",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keutamaan Suku Aslam, Ghifar, Muzaina, dan Juhaina",
        "perawi_melayu": "Diriwayatkan oleh Abu Bakra:",
        "english_text": "The Prophet (ﷺ) said, \"Do you think if the tribes of Aslam, Ghifar, Muzaina and Juhaina are better than the tribes of Tamim, 'Amir bin Sa'sa'a, Ghatfan and Asad, they (the second group) are despairing and losing?\" They (the Prophet's companions) said, \"Yes, (they are).\" He said, \"By Him in Whose Hand my soul is, they (the first group) are better than them (the second group).\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Adakah kamu menyangka jika suku Aslam, Ghifar, Muzaina, dan Juhaina lebih baik daripada suku Tamim, 'Amir bin Sa'sa'a, Ghatfan, dan Asad, mereka (kumpulan kedua) berputus asa dan rugi?\" Mereka (para sahabat Nabi) berkata, \"Ya, (mereka berputus asa dan rugi).\" Baginda bersabda, \"Demi (Allah) yang jiwaku berada di tangan-Nya, mereka (kumpulan pertama) lebih baik daripada mereka (kumpulan kedua).\"",
        "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَهْبٌ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ أَبِي يَعْقُوبَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ أَرَأَيْتُمْ إِنْ كَانَ أَسْلَمُ وَغِفَارُ وَمُزَيْنَةُ وَجُهَيْنَةُ خَيْرًا مِنْ تَمِيمٍ وَعَامِرِ بْنِ صَعْصَعَةَ وَغَطَفَانَ وَأَسَدٍ، خَابُوا وَخَسِرُوا ‏\"‏‏.‏ قَالُوا نَعَمْ‏.‏ فَقَالَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّهُمْ خَيْرٌ مِنْهُمْ ‏\"‏‏.‏"
      },
      {
        "id": 6370,
        "hadith_number": "6636",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman Mencuri Zakat dan Mengambil Hadiah Sebagai Pekerja",
        "perawi_melayu": "Diriwayatkan oleh Abu Humaid As-Sa`idi رضی اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) employed an employee (to collect Zakat). The employee returned after completing his job and said, \"O Allah's Messenger (ﷺ)! This (amount of Zakat) is for you, and this (other amount) was given to me as a present.\" The Prophet (ﷺ) said to him, \"Why didn't you stay at your father's or mother's house and see if you would be given presents or not?\" Then Allah's Messenger (ﷺ) got up in the evening after the prayer, and having testified that none has the right to be worshipped but Allah and praised and glorified Allah as He deserved, he said, \"Now then ! What about an employee whom we employ and then he comes and says, 'This amount (of Zakat) is for you, and this (amount) was given to me as a present'? Why didn't he stay at the house of his father and mother to see if he would be given presents or not? By Him in Whose Hand Muhammad's soul is, none of you will steal anything of it (i.e. Zakat) but will bring it by carrying it over his neck on the Day of Resurrection. If it has been a camel, he will bring it (over his neck) while it will be grunting, and if it has been a cow, he will bring it (over his neck), while it will be mooing; and if it has been a sheep, he will bring it (over his neck) while it will be bleeding.\" The Prophet (ﷺ) added, \"I have preached you (Allah's Message).\" Abu Humaid said, \"Then Allah's Messenger (ﷺ) raised his hands so high that we saw the whiteness of his armpits.\" Hadrat Abu Humaid says: Hadrat Zaid bin Thabit رضی اللہ عنہ heard this Hadith from the prophet ﷺ along with me, you can also ask him about it.",
        "malay_translation": "Rasulullah (ﷺ) menggaji seorang pekerja (untuk mengumpul Zakat). Pekerja itu kembali setelah selesai kerjanya dan berkata, \"Wahai Rasulullah (ﷺ)! Ini (jumlah Zakat) adalah untukmu, dan ini (jumlah yang lain) diberikan kepada saya sebagai hadiah.\" Nabi (ﷺ) berkata kepadanya, \"Mengapa kamu tidak tinggal di rumah ayah atau ibumu dan lihat apakah kamu akan diberi hadiah atau tidak?\" Kemudian Rasulullah (ﷺ) bangun pada waktu malam selepas solat, dan setelah bersaksi bahawa tiada siapa yang berhak disembah selain Allah dan memuji dan mengagungkan Allah sebagaimana Dia berhak, baginda bersabda, \"Sekarang! Bagaimana pula dengan seorang pekerja yang kita gajikan kemudian dia datang dan berkata, 'Jumlah ini (Zakat) adalah untukmu, dan ini (jumlah) diberikan kepada saya sebagai hadiah'? Mengapa dia tidak tinggal di rumah ayah dan ibunya untuk melihat jika dia akan diberi hadiah atau tidak? Demi Dia yang di tangan-Nya jiwa Muhammad, tiada seorang pun daripada kamu akan mencuri sesuatu daripadanya (iaitu Zakat) melainkan akan membawanya dengan memikulnya di atas lehernya pada Hari Kiamat. Jika ia seekor unta, dia akan membawanya (di atas lehernya) sambil ia menggerutu, dan jika ia seekor lembu, dia akan membawanya (di atas lehernya), sambil ia mengembek; dan jika ia seekor kambing, dia akan membawanya (di atas lehernya) sambil ia berdarah.\" Nabi (ﷺ) menambah, \"Aku telah menyampaikan kepadamu (pesan Allah).\" Abu Humaid berkata, \"Kemudian Rasulullah (ﷺ) mengangkat kedua tangannya setinggi-tingginya sehingga kami melihat putih ketiaknya.\" Hadrat Abu Humaid berkata: Hadrat Zaid bin Thabit رضی اللہ عنہ mendengar Hadith ini daripada Nabi ﷺ bersama saya, anda juga boleh bertanya kepadanya mengenainya.",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ، عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ، أَنَّهُ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَعْمَلَ عَامِلاً فَجَاءَهُ الْعَامِلُ حِينَ فَرَغَ مِنْ عَمَلِهِ فَقَالَ يَا رَسُولَ اللَّهِ هَذَا لَكُمْ، وَهَذَا أُهْدِيَ لِي‏.‏ فَقَالَ لَهُ ‏\"‏ أَفَلاَ قَعَدْتَ فِي بَيْتِ أَبِيكَ وَأُمِّكَ فَنَظَرْتَ أَيُهْدَى لَكَ أَمْ لاَ ‏\"‏‏.‏ ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَشِيَّةً بَعْدَ الصَّلاَةِ فَتَشَهَّدَ وَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ، فَمَا بَالُ الْعَامِلِ نَسْتَعْمِلُهُ، فَيَأْتِينَا فَيَقُولُ هَذَا مِنْ عَمَلِكُمْ، وَهَذَا أُهْدِيَ لِي‏.‏ أَفَلاَ قَعَدَ فِي بَيْتِ أَبِيهِ وَأُمِّهِ فَنَظَرَ هَلْ يُهْدَى لَهُ أَمْ لاَ، فَوَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لاَ يَغُلُّ أَحَدُكُمْ مِنْهَا شَيْئًا، إِلاَّ جَاءَ بِهِ يَوْمَ الْقِيَامَةِ يَحْمِلُهُ عَلَى عُنُقِهِ، إِنْ كَانَ بَعِيرًا جَاءَ بِهِ لَهُ رُغَاءٌ، وَإِنْ كَانَتْ بَقَرَةً جَاءَ بِهَا لَهَا خُوَارٌ، وَإِنْ كَانَتْ شَاةً جَاءَ بِهَا تَيْعَرُ، فَقَدْ بَلَّغْتُ ‏\"‏‏.‏ فَقَالَ أَبُو حُمَيْدٍ ثُمَّ رَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ حَتَّى إِنَّا لَنَنْظُرُ إِلَى عُفْرَةِ إِبْطَيْهِ‏.‏ قَالَ أَبُو حُمَيْدٍ وَقَدْ سَمِعَ ذَلِكَ مَعِي زَيْدُ بْنُ ثَابِتٍ مِنَ النَّبِيِّ صلى الله عليه وسلم فَسَلُوهُ‏.‏"
      },
      {
        "id": 6371,
        "hadith_number": "6637",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perasaan Takut dan Kesedaran (Hadis Abu Hurairah)",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah رضي الله عنه :",
        "english_text": "Abu-l-Qasim (the Prophet) said, \"By Him in Whose Hand Muhammad's soul is, if you know that which I know, you would weep much and laugh little.\"",
        "malay_translation": "Abu-l-Qasim (Nabi) bersabda, \"Demi (Allah) yang di tangan-Nya jiwa Muhammad, sekiranya kamu mengetahui apa yang aku ketahui, nescaya kamu akan banyak menangis dan sedikit ketawa.\"",
        "arabic_text": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَام ٌ ـ هُوَ ابْنُ يُوسُفَ ـ عَنْ مَعْمَرٍ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ أَبُو الْقَاسِمِ صلى الله عليه وسلم ‏ \"‏ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَبَكَيْتُمْ كَثِيرًا، وَلَضَحِكْتُمْ قَلِيلاً ‏\"‏‏.‏"
      },
      {
        "id": 6372,
        "hadith_number": "6638",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Orang Kaya yang Rugi Kecuali yang Membelanjakan Hartanya di Jalan Allah",
        "perawi_melayu": "Diriwayatkan daripada Abu Dhar رضی اللہ عنہ :",
        "english_text": "I reached him (the Prophet (ﷺ) ) while in the shade of the Ka`ba; he was saying, \"They are the losers, by the Lord of the Ka`ba! They are the losers, by the Lord of the Ka`ba!\" I said (to myself ), \"What is wrong with me? Is anything improper detected in me? What is wrong with me? Then I sat beside him and he kept on saying his statement. I could not remain quiet, and Allah knows in what sorrowful state I was at that time. So I said, ' Who are they (the losers)? Let My father and mother be sacrificed for you, O Allah's Messenger (ﷺ)!\" He said, \"They are the wealthy people, except the one who does like this and like this and like this (i.e., spends of his wealth in Allah's Cause).",
        "malay_translation": "Saya berjumpa dengan Baginda (Nabi Muhammad (ﷺ) ) ketika berada di bawah naungan Ka`bah; Baginda bersabda, \"Sesungguhnya mereka adalah orang-orang yang rugi, demi Tuhan Ka`bah! Sesungguhnya mereka adalah orang-orang yang rugi, demi Tuhan Ka`bah!\" Saya berkata (di dalam hati), \"Apakah yang salah dengan saya? Adakah sesuatu yang tidak wajar dikesan pada diri saya? Apakah yang salah dengan saya?\" Kemudian saya duduk di sisi Baginda dan Baginda terus mengulang sabdanya. Saya tidak dapat berdiam diri, dan Allah Maha Mengetahui betapa sedihnya keadaan saya pada waktu itu. Lalu saya berkata, 'Siapakah mereka (orang-orang yang rugi) itu? Biarlah ayah dan ibu saya menjadi tebusan bagiMu, wahai Rasulullah (ﷺ)!\" Baginda bersabda, \"Mereka adalah orang-orang kaya, kecuali orang yang melakukan seperti ini dan seperti ini dan seperti ini (iaitu membelanjakan hartanya di jalan Allah).\"",
        "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنِ الْمَعْرُورِ، عَنْ أَبِي ذَرٍّ، قَالَ انْتَهَيْتُ إِلَيْهِ وَهُوَ يَقُولُ فِي ظِلِّ الْكَعْبَةِ ‏\"‏ هُمُ الأَخْسَرُونَ وَرَبِّ الْكَعْبَةِ، هُمُ الأَخْسَرُونَ وَرَبِّ الْكَعْبَةِ ‏\"‏ قُلْتُ مَا شَأْنِي أَيُرَى فِيَّ شَىْءٌ مَا شَأْنِي فَجَلَسْتُ إِلَيْهِ وَهْوَ يَقُولُ، فَمَا اسْتَطَعْتُ أَنْ أَسْكُتَ، وَتَغَشَّانِي مَا شَاءَ اللَّهُ، فَقُلْتُ مَنْ هُمْ بِأَبِي أَنْتَ وَأُمِّي يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الأَكْثَرُونَ أَمْوَالاً، إِلاَّ مَنْ قَالَ هَكَذَا وَهَكَذَا وَهَكَذَا ‏\"‏‏.‏"
      },
      {
        "id": 6373,
        "hadith_number": "6639",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Nabi Sulaiman dan Kelebihan Ucapan 'InsyaAllah'",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) said, \"(The Prophet) Solomon once said, 'Tonight I will sleep with ninety women, each of whom will bring forth a (would-be) cavalier who will fight in Allah's Cause.\" On this, his companion said to him, \"Say: Allah willing!\" But he did not say Allah willing. Solomon then slept with all the women, but none of them became pregnant but one woman who later delivered a halfman. By Him in Whose Hand Muhammad's soul is, if he (Solomon) had said, 'Allah willing' (all his wives would have brought forth boys) and they would have fought in Allah's Cause as cavaliers. \"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"(Nabi) Sulaiman pernah berkata, 'Malam ini aku akan bersama sembilan puluh orang wanita, masing-masing daripada mereka akan melahirkan seorang kesatria yang akan berjuang di jalan Allah.' Mendengar hal itu, sahabatnya berkata kepadanya, 'Ucapkanlah: InsyaAllah!' Tetapi dia tidak mengucapkan InsyaAllah. Kemudian Sulaiman bersama semua wanita itu, tetapi tiada seorang pun daripada mereka yang hamil kecuali seorang wanita yang kemudiannya melahirkan seorang bayi yang cacat. Demi (Allah) yang di tangan-Nya jiwa Muhammad, sekiranya dia (Sulaiman) mengucapkan 'InsyaAllah' (kesemua isterinya akan melahirkan anak lelaki) dan mereka akan berjuang di jalan Allah sebagai kesatria.\"",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ قَالَ سُلَيْمَانُ لأَطُوفَنَّ اللَّيْلَةَ عَلَى تِسْعِينَ امْرَأَةً، كُلُّهُنَّ تَأْتِي بِفَارِسٍ يُجَاهِدُ فِي سَبِيلِ اللَّهِ‏.‏ فَقَالَ لَهُ صَاحِبُهُ إِنْ شَاءَ اللَّهُ‏.‏ فَلَمْ يَقُلْ إِنْ شَاءَ اللَّهُ‏.‏ فَطَافَ عَلَيْهِنَّ جَمِيعًا، فَلَمْ تَحْمِلْ مِنْهُنَّ إِلاَّ امْرَأَةٌ وَاحِدَةٌ، جَاءَتْ بِشِقِّ رَجُلٍ، وَايْمُ الَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَوْ قَالَ إِنْ شَاءَ اللَّهُ‏.‏ لَجَاهَدُوا فِي سَبِيلِ اللَّهِ فُرْسَانًا أَجْمَعُونَ ‏\"‏‏.‏"
      },
      {
        "id": 6374,
        "hadith_number": "6640",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keindahan Kain Sutera di Syurga",
        "perawi_melayu": "Daripada Al-Bara 'bin `Azib رضی اللہ عنہ :",
        "english_text": "A piece of silken cloth was given to the Prophet (ﷺ) as a present and the people handed it over amongst themselves and were astonished at its beauty and softness. Allah's Messenger (ﷺ) said, \"Are you astonished at it?\" They said, \"Yes, O Allah's Messenger (ﷺ)!\" He said, \"By Him in Whose Hand my soul is, the handkerchiefs of Sa`d رضی اللہ عنہ  in Paradise are better than it.\" Shobah,s and Israil's reports from Abu Ishaq don't have ''‏ وَالَّذِي نَفْسِي بِيَدِهِ'' .",
        "malay_translation": "Sebuah kain sutera dihadiahkan kepada Nabi (ﷺ) dan orang ramai mengagih-agihkannya sesama mereka, serta terkejut dengan keindahan dan kelembutannya. Rasulullah (ﷺ) bersabda, \"Adakah kamu semua merasa hairan dengannya?\" Mereka menjawab, \"Ya, wahai Rasulullah (ﷺ)!\" Baginda bersabda, \"Demi Dia yang jiwaku berada di tangan-Nya, sapu tangan Sa`d رضی اللہ عنہ di dalam Syurga adalah lebih baik daripada itu.\" Riwayat daripada Shobah dan Israil daripada Abu Ishaq tidak mengandungi ''‏ وَالَّذِي نَفْسِي بِيَدِهِ''.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ أُهْدِيَ إِلَى النَّبِيِّ صلى الله عليه وسلم سَرَقَةٌ مِنْ حَرِيرٍ، فَجَعَلَ النَّاسُ يَتَدَاوَلُونَهَا بَيْنَهُمْ، وَيَعْجَبُونَ مِنْ حُسْنِهَا وَلِينِهَا، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَعْجَبُونَ مِنْهَا ‏\"‏‏.‏ قَالُوا نَعَمْ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لَمَنَادِيلُ سَعْدٍ فِي الْجَنَّةِ خَيْرٌ مِنْهَا ‏\"‏‏.‏ لَمْ يَقُلْ شُعْبَةُ وَإِسْرَائِيلُ عَنْ أَبِي إِسْحَاقَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ ‏\"‏‏.‏"
      },
      {
        "id": 6375,
        "hadith_number": "6641",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keikhlasan Hind Bint Utba dan Kebenaran Mengambil Harta Suami",
        "perawi_melayu": "Diriwayatkan daripada Aisyah رضي اللہ عنہا :",
        "english_text": "Hind bint `Utba bin Rabi`a said, \"O Allah 's Apostle! (Before I embraced Islam), there was no family on the surface of the earth, I wish to have degraded more than I did your family. But today there is no family whom I wish to have honored more than I did yours.\" Allah's Messenger (ﷺ) said, \"I thought similarly, by Him in Whose Hand Muhammad's soul is!\" Hind said, \"O Allah's Messenger (ﷺ)! (My husband) Abu Sufyan is a miser. Is it sinful of me to feed my children from his property?\" The Prophet said, \"No, unless you take it for your needs what is just and reasonable.\"",
        "malay_translation": "Hind bint `Utba bin Rabi`a berkata, \"Wahai Rasulullah! (Sebelum saya memeluk Islam), tiada satu keluarga pun di atas muka bumi ini yang saya inginkan kehinaan ke atas mereka melebihi keluarga kamu. Tetapi hari ini, tiada satu keluarga pun yang saya inginkan kemuliaan ke atas mereka melebihi keluarga kamu.\" Rasulullah (ﷺ) bersabda, \"Saya juga berfikir demikian, demi Dia yang di tangan-Nya nyawa Muhammad!\" Hind berkata, \"Wahai Rasulullah (ﷺ)! (Suami saya) Abu Sufyan seorang yang kedekut. Adakah berdosa bagi saya untuk memberi makan anak-anak saya daripada hartanya?\" Nabi bersabda, \"Tidak, melainkan kamu mengambilnya untuk keperluan kamu sekadar yang berpatutan dan munasabah.\"",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ إِنَّ هِنْدَ بِنْتَ عُتْبَةَ بْنِ رَبِيعَةَ قَالَتْ يَا رَسُولَ اللَّهِ مَا كَانَ مِمَّا عَلَى ظَهْرِ الأَرْضِ أَهْلُ أَخْبَاءٍ ـ أَوْ خِبَاءٍ ـ أَحَبَّ إِلَىَّ أَنْ يَذِلُّوا مِنْ أَهْلِ أَخْبَائِكَ ـ أَوْ خِبَائِكَ، شَكَّ يَحْيَى ـ ثُمَّ مَا أَصْبَحَ الْيَوْمَ أَهْلُ أَخْبَاءٍ ـ أَوْ خِبَاءٍ ـ أَحَبَّ إِلَىَّ مِنْ أَنْ يَعِزُّوا مِنْ أَهْلِ أَخْبَائِكَ أَوْ خِبَائِكَ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَأَيْضًا وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ ‏\"‏‏.‏ قَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أَبَا سُفْيَانَ رَجُلٌ مِسِّيكٌ، فَهَلْ عَلَىَّ حَرَجٌ أَنْ أُطْعِمَ مِنَ الَّذِي لَهُ قَالَ ‏\"‏ لاَ إِلاَّ بِالْمَعْرُوفِ ‏\"‏‏.‏"
      },
      {
        "id": 6376,
        "hadith_number": "6642",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pengharapan Rasulullah ﷺ terhadap Sahabat di Syurga",
        "perawi_melayu": "Diriwayatkan oleh Abdullah bin Mas'ud رضي الله عنه :",
        "english_text": "While Allah's Messenger (ﷺ) was sitting, reclining his back against a Yemenite leather tent he said to his companions, \"Will you be pleased to be one-fourth of the people of Paradise?\" They said, 'Yes.' He said \"Won't you be pleased to be one-third of the people of Paradise\" They said, \"Yes.\" He said, \"By Him in Whose Hand Muhammad's soul is, I hope that you will be one-half of the people of Paradise.\"",
        "malay_translation": "Ketika Rasulullah ﷺ sedang duduk bersandar pada khemah kulit Yaman, baginda bersabda kepada para sahabatnya, \"Adakah kamu suka jika kamu menjadi satu perempat daripada penduduk syurga?\" Mereka menjawab, 'Ya.' Baginda bersabda, \"Tidakkah kamu suka jika kamu menjadi satu pertiga daripada penduduk syurga?\" Mereka menjawab, \"Ya.\" Baginda bersabda, \"Demi Tuhan yang jiwa Muhammad berada di tangan-Nya, aku berharap kamu akan menjadi separuh daripada penduduk syurga.\"",
        "arabic_text": "حَدَّثَنِي أَحْمَدُ بْنُ عُثْمَانَ، حَدَّثَنَا شُرَيْحُ بْنُ مَسْلَمَةَ، حَدَّثَنَا إِبْرَاهِيمُ، عَنْ أَبِيهِ، عَنْ أَبِي إِسْحَاقَ، سَمِعْتُ عَمْرَو بْنَ مَيْمُونٍ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ بَيْنَمَا رَسُولُ اللَّهِ صلى الله عليه وسلم مُضِيفٌ ظَهْرَهُ إِلَى قُبَّةٍ مِنْ أَدَمٍ يَمَانٍ إِذْ قَالَ لأَصْحَابِهِ ‏\"‏ أَتَرْضَوْنَ أَنْ تَكُونُوا رُبُعَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ قَالُوا بَلَى‏.‏ قَالَ ‏\"‏ أَفَلَمْ تَرْضَوْا أَنْ تَكُونُوا ثُلُثَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ قَالُوا بَلَى‏.‏ قَالَ ‏\"‏ فَوَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ، إِنِّي لأَرْجُو أَنْ تَكُونُوا نِصْفَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏"
      },
      {
        "id": 6377,
        "hadith_number": "6643",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Surah Al-Ikhlas Menyamai Satu Pertiga Al-Quran",
        "perawi_melayu": "Diriwayatkan oleh Abu Sa`id Al-Khudri رضی اللہ عنہ :",
        "english_text": "A man heard another man reciting: Surat-ul-Ikhlas (The Unity) 'Say: He is Allah, the One (112) and he was repeating it. The next morning he came to Allah's Messenger (ﷺ) and mentioned the whole story to him as if he regarded the recitation of that Sura as insufficient On that, Allah's Messenger (ﷺ) said, \"By Him in Whose Hand my soul is! That (Sura No. 112) equals one-third of the Qur'an.\"",
        "malay_translation": "Seorang lelaki mendengar lelaki lain membaca: Surah Al-Ikhlas (The Unity) 'Katakanlah: Dialah Allah, Yang Maha Esa (112)' dan dia mengulanginya. Pada keesokan paginya, dia datang kepada Rasulullah (ﷺ) dan menceritakan keseluruhan kisah itu seolah-olah dia menganggap bacaan surah itu tidak mencukupi. Lalu, Rasulullah (ﷺ) bersabda, \"Demi Tuhan yang di tangan-Nya jiwaku! Surah itu (Surah No. 112) menyamai satu pertiga Al-Quran.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ، أَنَّ رَجُلاً، سَمِعَ رَجُلاً، يَقْرَأُ ‏{‏قُلْ هُوَ اللَّهُ أَحَدٌ‏}‏ يُرَدِّدُهَا، فَلَمَّا أَصْبَحَ جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ ذَلِكَ لَهُ، وَكَأَنَّ الرَّجُلَ يَتَقَالُّهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّهَا لَتَعْدِلُ ثُلُثَ الْقُرْآنِ ‏\"‏‏.‏"
      },
      {
        "id": 6379,
        "hadith_number": "6645",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kecintaan Nabi ﷺ kepada Wanita Ansar",
        "perawi_melayu": "Diriwayatkan daripada Anas bin Malik رضی اللہ عنہ :",
        "english_text": "An Ansari woman came to the Prophet (ﷺ) in the company of her children, and the Prophet (ﷺ) said to her, \"By Him in Whose Hand my soul is, you are the most beloved people to me!\" And he repeated the statement thrice.",
        "malay_translation": "Seorang wanita Ansar datang kepada Nabi ﷺ bersama anak-anaknya, lalu Nabi ﷺ bersabda kepadanya, \"Demi Allah yang jiwaku berada di tangan-Nya, kamu adalah orang yang paling aku cintai!\" Dan baginda mengulangi ucapan itu sebanyak tiga kali.",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، أَخْبَرَنَا شُعْبَةُ، عَنْ هِشَامِ بْنِ زَيْدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ امْرَأَةً، مِنَ الأَنْصَارِ أَتَتِ النَّبِيَّ صلى الله عليه وسلم مَعَهَا أَوْلاَدٌ لَهَا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّكُمْ لأَحَبُّ النَّاسِ إِلَىَّ ‏\"‏‏.‏ قَالَهَا ثَلاَثَ مِرَارٍ‏.‏"
      },
      {
        "id": 6380,
        "hadith_number": "6646",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Bersumpah Selain Nama Allah",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Umar رضی اللہ عنہما :",
        "english_text": "Allah's Messenger (ﷺ) met `Umar bin Al-Khattab while the latter was going with a group of camel-riders, and he was swearing by his father. The Prophet (ﷺ) said, \"Lo! Allah forbids you to swear by your fathers, so whoever has to take an oath, he should swear by Allah or keep quiet.\"",
        "malay_translation": "Rasulullah (ﷺ) bertemu dengan `Umar bin Al-Khattab ketika beliau sedang dalam perjalanan bersama sekumpulan penunggang unta, dan beliau sedang bersumpah dengan nama bapanya. Nabi (ﷺ) bersabda, \"Ketahuilah! Allah melarang kamu bersumpah dengan nama bapa-bapa kamu. Oleh itu, sesiapa yang perlu bersumpah, hendaklah dia bersumpah dengan nama Allah atau berdiam diri.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَدْرَكَ عُمَرَ بْنَ الْخَطَّابِ وَهْوَ يَسِيرُ فِي رَكْبٍ يَحْلِفُ بِأَبِيهِ فَقَالَ ‏ \"‏ أَلاَ إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ، مَنْ كَانَ حَالِفًا فَلْيَحْلِفْ بِاللَّهِ، أَوْ لِيَصْمُتْ ‏\"‏‏.‏"
      },
      {
        "id": 6381,
        "hadith_number": "6647",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Bersumpah dengan Nama Bapa",
        "perawi_melayu": "Diriwayatkan daripada `Umar رضی اللہ عنہ :",
        "english_text": "\"Allah's Messenger (ﷺ) said to me, 'Allah forbids you to swear by your fathers.\" `Umar رضی اللہ عنہ said, \"By Allah! Since I heard that from the Prophet (ﷺ) , I have not taken such an oath, neither intentionally, nor by reporting the oath of someone else.\" Hadrat Umer رضی اللہ عنہما  states: By Allah! Since I heard it from the prophet , I have never sworn such an oath himself or quoting from others. Mujahid says: ''أَوْ أَثَرَةٍ مِنْ عِلْمٍ'' means: To give the news of the former people. Oqail, Zubaidi and ishaq Kalbi have reported the same. Hadrat Ibn-e-Umer رضی اللہ عنہما states that the prophet ﷺ heard Hadrat Umer رضی اللہ عنہ taking an oath.",
        "malay_translation": "Rasulullah (ﷺ) bersabda kepadaku, 'Allah melarang kamu bersumpah dengan nama bapa-bapa kamu.' `Umar رضی اللہ عنہ berkata, 'Demi Allah! Sejak aku mendengar hal itu daripada Nabi (ﷺ), aku tidak pernah bersumpah dengan cara itu, sama ada dengan sengaja mahupun meriwayatkan sumpah orang lain.' Hadrat Umar رضی اللہ عنہما menyatakan: 'Demi Allah! Sejak aku mendengarnya daripada Nabi, aku tidak pernah bersumpah sedemikian, baik oleh diriku sendiri mahupun menukilkan dari orang lain.' Mujahid berkata: ''أَوْ أَثَرَةٍ مِنْ عِلْمٍ'' bermaksud: Memberi berita tentang orang-orang terdahulu. Oqail, Zubaidi dan Ishaq Kalbi telah meriwayatkan perkara yang sama. Hadrat Ibn-e-Umer رضی اللہ عنہما menyatakan bahawa Nabi ﷺ mendengar Hadrat Umar رضی اللہ عنہ bersumpah.",
        "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ قَالَ سَالِمٌ قَالَ ابْنُ عُمَرَ سَمِعْتُ عُمَرَ، يَقُولُ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ ‏\"‏‏.‏ قَالَ عُمَرُ فَوَاللَّهِ مَا حَلَفْتُ بِهَا مُنْذُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم ذَاكِرًا وَلاَ آثِرًا‏.‏ قَالَ مُجَاهِدٌ ‏{‏أَوْ أَثَرَةٍ مِنْ عِلْمٍ‏}‏ يَأْثُرُ عِلْمًا‏.‏ تَابَعَهُ عُقَيْلٌ وَالزُّبَيْدِيُّ وَإِسْحَاقُ الْكَلْبِيُّ عَنِ الزُّهْرِيِّ‏.‏ وَقَالَ ابْنُ عُيَيْنَةَ وَمَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ سَالِمٍ عَنِ ابْنِ عُمَرَ سَمِعَ النَّبِيُّ صلى الله عليه وسلم عُمَرَ‏.‏"
      },
      {
        "id": 6382,
        "hadith_number": "6648",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Bersumpah dengan Nama Bapa",
        "perawi_melayu": "Diriwayatkan oleh Abdullah bin Umar رضی اللہ عنہما :",
        "english_text": "Allah's Messenger (ﷺ) said, \"Do not swear by your fathers.\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Janganlah kamu bersumpah dengan nama bapa-bapa kamu.\"",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ قَالَ رَسُولُ اللَّهُ صلى الله عليه وسلم ‏ \"‏ لاَ تَحْلِفُوا بِآبَائِكُمْ ‏\"‏‏.‏"
      },
      {
        "id": 6383,
        "hadith_number": "6649",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Persahabatan dan Pengajaran tentang Sumpah",
        "perawi_melayu": "Diriwayatkan oleh Zahdam:",
        "english_text": "There was a relation of love and brotherhood between this tribe of Jarm and Al-Ash`ariyin. Once we were with Abu Musa Al-Ash`ari رضي اللہ عنہ , and then a meal containing chicken was brought to Abu Musa رضي اللہ عنہ , and there was present, a man from the tribe of Taimillah who was of red complexion as if he were from non-Arab freed slaves. Abu Musa رضي اللہ عنہ invited him to the meal. He said, \"I have seen chickens eating dirty things, so I deemed it filthy and took an oath that I would never eat chicken.\" On that, Abu Musa رضي اللہ عنہ said, \"Get up, I will narrate to you about that. Once a group of the Ash`ariyin and I went to Allah's Messenger (ﷺ) and asked him to provide us with mounts; he said, 'By Allah, I will never give you any mounts nor do I have anything to mount you on.' Then a few camels of war booty were brought to Allah's Messenger (ﷺ) , and he asked about us, saying, 'Where are the Ash-'ariyin?' He then ordered five nice camels to be given to us, and when we had departed, we said, 'What have we done? Allah's Messenger (ﷺ) had taken the oath not to give us any mounts, and that he had nothing to mount us on, and later he gave us that we might ride? Did we take advantage of the fact that Allah's Messenger (ﷺ) had forgotten his oath? By Allah, we will never succeed.' So we went back to him and said to him, 'We came to you to give us mounts, and you took an oath that you would not give us any mounts and that you had nothing to mount us on.' On that he said, 'I did not provide you with mounts, but Allah did. By Allah, if I take an oath to do something, and then find something else better than it, I do that which is better and make expiation for the dissolution of the oath.' \"",
        "malay_translation": "Terdapat hubungan kasih sayang dan persaudaraan antara kabilah Jarm dan Al-Ash'ariyin. Suatu ketika kami bersama Abu Musa Al-Ash'ari رضي اللہ عنہ , kemudian hidangan yang mengandungi ayam dibawa kepada Abu Musa رضي اللہ عنہ , dan terdapat seorang lelaki dari kabilah Taimillah yang berkulit merah seolah-olah dia daripada hamba abdi bukan Arab. Abu Musa رضي اللہ عنہ menjemputnya ke hidangan itu. Lelaki itu berkata, \"Saya telah melihat ayam makan benda-benda kotor, jadi saya menganggapnya jijik dan bersumpah bahawa saya tidak akan makan ayam.\" Atas hal itu, Abu Musa رضي اللہ عنہ berkata, \"Bangunlah, saya akan menceritakan kepada kamu tentang hal itu. Suatu ketika sekumpulan daripada Ash'ariyin dan saya pergi kepada Rasulullah (ﷺ) dan meminta baginda menyediakan kami tunggangan; baginda berkata, 'Demi Allah, aku tidak akan memberikan kamu sebarang tunggangan dan aku juga tidak mempunyai apa-apa untuk menunggangi kamu.' Kemudian beberapa ekor unta rampasan perang dibawa kepada Rasulullah (ﷺ) , dan baginda bertanya tentang kami, seraya berkata, 'Di manakah orang Ash-'ariyin?' Kemudian baginda memerintahkan lima ekor unta yang baik diberikan kepada kami, dan ketika kami telah berlepas, kami berkata, 'Apa yang telah kami lakukan? Rasulullah (ﷺ) telah bersumpah untuk tidak memberikan kami sebarang tunggangan, dan baginda tidak mempunyai apa-apa untuk kami tunggangi, dan kemudian baginda memberikan kami supaya kami boleh menunggang? Adakah kami mengambil kesempatan daripada fakta bahawa Rasulullah (ﷺ) telah melupakan sumpahnya? Demi Allah, kami tidak akan berjaya.' Lalu kami kembali kepada baginda dan berkata kepada baginda, 'Kami datang kepada kamu untuk memberikan kami tunggangan, dan kamu telah bersumpah bahawa kamu tidak akan memberikan kami sebarang tunggangan dan bahawa kamu tidak mempunyai apa-apa untuk kami tunggangi.' Atas hal itu baginda berkata, 'Aku tidak menyediakan kamu dengan tunggangan, tetapi Allah yang menyediakannya. Demi Allah, jika aku bersumpah untuk melakukan sesuatu, dan kemudian mendapati sesuatu yang lain lebih baik daripada itu, aku akan melakukan yang lebih baik dan membuat kaffarah (penebusan) untuk pembatalan sumpah itu.'\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، وَالْقَاسِمِ التَّمِيمِيِّ، عَنْ زَهْدَمٍ، قَالَ كَانَ بَيْنَ هَذَا الْحَىِّ مِنْ جَرْمٍ وَبَيْنَ الأَشْعَرِيِّينَ وُدٌّ وَإِخَاءٌ، فَكُنَّا عِنْدَ أَبِي مُوسَى الأَشْعَرِيِّ، فَقُرِّبَ إِلَيْهِ طَعَامٌ فِيهِ لَحْمُ دَجَاجٍ وَعِنْدَهُ رَجُلٌ مِنْ بَنِي تَيْمِ اللَّهِ أَحْمَرُ كَأَنَّهُ مِنَ الْمَوَالِي، فَدَعَاهُ إِلَى الطَّعَامِ فَقَالَ إِنِّي رَأَيْتُهُ يَأْكُلُ شَيْئًا فَقَذِرْتُهُ، فَحَلَفْتُ أَنْ لاَ آكُلَهُ‏.‏ فَقَالَ قُمْ فَلأُحَدِّثَنَّكَ عَنْ ذَاكَ، إِنِّي أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي نَفَرٍ مِنَ الأَشْعَرِيِّينَ نَسْتَحْمِلُهُ فَقَالَ ‏\"‏ وَاللَّهِ لاَ أَحْمِلُكُمْ، وَمَا عِنْدِي مَا أَحْمِلُكُمْ ‏\"‏‏.‏ فَأُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِنَهْبِ إِبِلٍ فَسَأَلَ عَنَّا‏.‏ فَقَالَ ‏\"‏ أَيْنَ النَّفَرُ الأَشْعَرِيُّونَ ‏\"‏‏.‏ فَأَمَرَ لَنَا بِخَمْسِ ذَوْدٍ غُرِّ الذُّرَى، فَلَمَّا انْطَلَقْنَا قُلْنَا مَا صَنَعْنَا حَلَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم لاَ يَحْمِلُنَا وَمَا عِنْدَهُ مَا يَحْمِلُنَا ثُمَّ حَمَلَنَا، تَغَفَّلْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم يَمِينَهُ، وَاللَّهِ لاَ نُفْلِحُ أَبَدًا، فَرَجَعْنَا إِلَيْهِ فَقُلْنَا لَهُ إِنَّا أَتَيْنَاكَ لِتَحْمِلَنَا فَحَلَفْتَ أَنْ لاَ تَحْمِلَنَا، وَمَا عِنْدَكَ مَا تَحْمِلُنَا‏.‏ فَقَالَ ‏\"‏ إِنِّي لَسْتُ أَنَا حَمَلْتُكُمْ، وَلَكِنَّ اللَّهَ حَمَلَكُمْ، وَاللَّهِ لاَ أَحْلِفُ عَلَى يَمِينٍ فَأَرَى غَيْرَهَا خَيْرًا مِنْهَا، إِلاَّ أَتَيْتُ الَّذِي هُوَ خَيْرٌ وَتَحَلَّلْتُهَا ‏\"‏‏.‏"
      },
      {
        "id": 6384,
        "hadith_number": "6650",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kewajipan Mengucap Kalimah Syahadah dan Sedekah",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) said, \"Whoever swears saying in his oath. 'By Al-Lat and Al-`Uzza,' should say, 'None has the right to be worshipped but Allah; and whoever says to his friend, 'Come, let me gamble with you,' should give something in charity.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Sesiapa yang bersumpah dengan menyebut 'Demi Al-Lat dan Al-`Uzza', hendaklah dia mengucapkan 'Tiada tuhan yang berhak disembah selain Allah'; dan sesiapa yang berkata kepada rakannya, 'Marilah, mari kita berjudi,' hendaklah dia bersedekah sesuatu.\"",
        "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ حَلَفَ فَقَالَ فِي حَلِفِهِ بِاللاَّتِ وَالْعُزَّى‏.‏ فَلْيَقُلْ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ وَمَنْ قَالَ لِصَاحِبِهِ تَعَالَ أُقَامِرْكَ‏.‏ فَلْيَتَصَدَّقْ ‏\"‏‏.‏"
      },
      {
        "id": 6385,
        "hadith_number": "6651",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Nabi SAW Menggunakan Cincin Emas",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Umar رضي الله عنهما :",
        "english_text": "Allah's Messenger (ﷺ) had a gold ring made for himself, and he used to wear it with the stone towards the inner part of his hand. Consequently, the people had similar rings made for themselves. Afterwards the Prophet; sat on the pulpit and took it off, saying, \"I used to wear this ring and keep its stone towards the palm of my hand.\" He then threw it away and said, \"By Allah, I will never wear it.\" Therefore all the people threw away their rings as well.",
        "malay_translation": "Rasulullah ﷺ telah membuat cincin emas untuk dirinya, dan baginda memakainya dengan batu cincin menghadap ke bahagian dalam tangannya. Akibatnya, orang ramai membuat cincin yang serupa untuk diri mereka sendiri. Selepas itu, Nabi ﷺ duduk di atas mimbar dan menanggalkannya, seraya berkata, \"Aku pernah memakai cincin ini dan meletakkan batunya menghadap ke tapak tangan.\" Kemudian baginda membuangnya dan berkata, \"Demi Allah, aku tidak akan memakainya lagi.\" Oleh itu, semua orang ramai turut membuang cincin mereka.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اصْطَنَعَ خَاتَمًا مِنْ ذَهَبٍ وَكَانَ يَلْبَسُهُ، فَيَجْعَلُ فَصَّهُ فِي بَاطِنِ كَفِّهِ، فَصَنَعَ النَّاسُ خَوَاتِيمَ ثُمَّ إِنَّهُ جَلَسَ عَلَى الْمِنْبَرِ فَنَزَعَهُ، فَقَالَ ‏\"‏ إِنِّي كُنْتُ أَلْبَسُ هَذَا الْخَاتِمَ وَأَجْعَلُ فَصَّهُ مِنْ دَاخِلٍ ‏\"‏‏.‏ فَرَمَى بِهِ ثُمَّ قَالَ ‏\"‏ وَاللَّهِ لاَ أَلْبَسُهُ أَبَدًا ‏\"‏‏.‏ فَنَبَذَ النَّاسُ خَوَاتِيمَهُمْ‏.‏"
      },
      {
        "id": 6387,
        "hadith_number": "6653",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ujian Allah terhadap Tiga Orang dari Bani Isra'il",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضي اللہ عنہ :",
        "english_text": "He heard the Prophet (ﷺ) saying, \"Allah decided to test three people from Bani Isra'il. So, He sent an angel who came first to the leper and said, '(I am a traveller) who has run short of all means of living, and I have nobody to help me except Allah, and then with your help.'\" Abu Hurairah then mentioned the complete narration.",
        "malay_translation": "Beliau mendengar Nabi (ﷺ) bersabda, \"Allah memutuskan untuk menguji tiga orang dari Bani Isra'il. Lalu, Dia mengutus seorang malaikat yang datang pertama kepada pengidap penyakit kusta dan berkata, '(Aku seorang musafir) yang kehabisan segala bekalan hidup, dan aku tidak mempunyai sesiapa untuk membantu aku kecuali Allah, dan kemudian dengan bantuanmu.'\" Abu Hurairah kemudian menyebutkan riwayat yang lengkap.",
        "arabic_text": "وَقَالَ عَمْرُو بْنُ عَاصِمٍ حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا إِسْحَاقُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَمْرَةَ، أَنَّ أَبَا هُرَيْرَةَ، حَدَّثَهُ أَنَّهُ، سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنَّ ثَلاَثَةً فِي بَنِي إِسْرَائِيلَ أَرَادَ اللَّهُ أَنْ يَبْتَلِيَهُمْ، فَبَعَثَ مَلَكًا فَأَتَى الأَبْرَصَ فَقَالَ تَقَطَّعَتْ بِي الْحِبَالُ، فَلاَ بَلاَغَ لِي إِلاَّ بِاللَّهِ، ثُمَّ بِكَ ‏\"‏‏.‏ فَذَكَرَ الْحَدِيثَ‏.‏"
      },
      {
        "id": 6388,
        "hadith_number": "6654",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perintah Nabi ﷺ untuk Membantu Memenuhi Sumpah",
        "perawi_melayu": "Al-Bara رضي الله عنه",
        "english_text": "The Prophet (ﷺ) ordered us to help others to fulfill the oaths.",
        "malay_translation": "Rasulullah ﷺ memerintahkan kami untuk membantu orang lain memenuhi sumpah.",
        "arabic_text": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ أَشْعَثَ، عَنْ مُعَاوِيَةَ بْنِ سُوَيْدِ بْنِ مُقَرِّنٍ، عَنِ الْبَرَاءِ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَحَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَشْعَثَ، عَنْ مُعَاوِيَةَ بْنِ سُوَيْدِ بْنِ مُقَرِّنٍ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ أَمَرَنَا النَّبِيُّ صلى الله عليه وسلم بِإِبْرَارِ الْمُقْسِمِ‏.‏"
      },
      {
        "id": 6389,
        "hadith_number": "6655",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Anak Nabi Muhammad SAW dan Rahmat Allah",
        "perawi_melayu": "Diriwayatkan oleh Usama:",
        "english_text": "Once a daughter of Allah's Messenger (ﷺ) sent a message to Allah's Messenger (ﷺ) while Usama, Sa`d, and my father or Ubai were (sitting there) with him. She said, (in the message); My child is going to die; please come to us.\" Allah's Messenger (ﷺ) returned the messenger and told him to convey his greetings to her, and say, \"Whatever Allah takes, is for Him and whatever He gives is for Him, and everything with Him has a limited fixed term (in this world): so she should be patient and hope for Allah's reward.\" Then she again sent for him swearing that he should come; so The Prophet (ﷺ) got up, and so did we. When he sat there (at the house of his daughter), the child was brought to him, and he took him into his lap while the child's breath was disturbed in his chest. The eyes of Allah's Messenger (ﷺ) started shedding tears. Sa`d  رضی اللہ عنہ said, \"What is this, O Allah's Messenger (ﷺ)?\" The Prophet (ﷺ) said, \"This is the mercy which Allah has lodged in the hearts of whoever He wants of His slaves, and verily Allah is merciful only to those of His slaves who are merciful (to others).'",
        "malay_translation": "Pada suatu ketika, seorang anak perempuan Rasulullah (ﷺ) mengirimkan pesan kepada Rasulullah (ﷺ) sementara Usama, Sa`d, dan ayahku atau Ubai sedang (duduk di sana) bersama baginda. Dia berkata, (dalam pesan); 'Anakku akan meninggal dunia; sila datang kepada kami.' Rasulullah (ﷺ) memulangkan utusan itu dan menyuruhnya menyampaikan salam baginda kepadanya, dan berkata, 'Apa sahaja yang Allah ambil, adalah hak-Nya dan apa sahaja yang Dia berikan adalah hak-Nya, dan segala sesuatu di sisi-Nya mempunyai tempoh yang ditetapkan (di dunia ini): maka hendaklah dia bersabar dan berharap akan ganjaran Allah.' Kemudian dia sekali lagi menghantarnya dengan bersumpah agar baginda datang; maka Nabi (ﷺ) bangun, dan kami pun begitu. Apabila baginda duduk di sana (di rumah anak perempuannya), kanak-kanak itu dibawa kepada baginda, dan baginda memangku kanak-kanak itu di ribaan baginda sementara nafas kanak-kanak itu terganggu di dadanya. Mata Rasulullah (ﷺ) mula mengeluarkan air mata. Sa`d  رضی اللہ عنہ berkata, 'Apakah ini, wahai Rasulullah (ﷺ)?' Nabi (ﷺ) bersabda, 'Ini adalah rahmat yang Allah letakkan di dalam hati sesiapa sahaja yang Dia kehendaki daripada hamba-hamba-Nya, dan sesungguhnya Allah hanya mengasihi hamba-hamba-Nya yang mengasihi (orang lain).'",
        "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنَا عَاصِمٌ الأَحْوَلُ، سَمِعْتُ أَبَا عُثْمَانَ، يُحَدِّثُ عَنْ أُسَامَةَ، أَنَّ ابْنَةً لِرَسُولِ اللَّهِ، صلى الله عليه وسلم أَرْسَلَتْ إِلَيْهِ وَمَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم أُسَامَةُ بْنُ زَيْدٍ وَسَعْدٌ وَأُبَىٌّ أَنَّ ابْنِي قَدِ احْتُضِرَ فَاشْهَدْنَا‏.‏ فَأَرْسَلَ يَقْرَأُ السَّلاَمَ وَيَقُولُ ‏\"‏ إِنَّ لِلَّهِ مَا أَخَذَ وَمَا أَعْطَى وَكُلُّ شَىْءٍ عِنْدَهُ مُسَمًّى فَلْتَصْبِرْ وَتَحْتَسِبْ ‏\"‏‏.‏ فَأَرْسَلَتْ إِلَيْهِ تُقْسِمُ عَلَيْهِ، فَقَامَ وَقُمْنَا مَعَهُ، فَلَمَّا قَعَدَ رُفِعَ إِلَيْهِ، فَأَقْعَدَهُ فِي حَجْرِهِ وَنَفْسُ الصَّبِيِّ تَقَعْقَعُ، فَفَاضَتْ عَيْنَا رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ سَعْدٌ مَا هَذَا يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ هَذَا رَحْمَةٌ يَضَعُهَا اللَّهُ فِي قُلُوبِ مَنْ يَشَاءُ مِنْ عِبَادِهِ، وَإِنَّمَا يَرْحَمُ اللَّهُ مِنْ عِبَادِهِ الرُّحَمَاءَ ‏\"‏‏.‏"
      },
      {
        "id": 6390,
        "hadith_number": "6656",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ganjaran Bagi Muslim yang Kehilangan Tiga Orang Anak",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضي اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) said, \"Any Muslim who has lost three of his children will not be touched by the Fire except that which will render Allah's oath fulfilled.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Mana-mana Muslim yang telah kehilangan tiga orang anaknya, dia tidak akan disentuh oleh api neraka kecuali (kesusahan) yang akan memenuhi sumpah Allah.\"",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَمُوتُ لأَحَدٍ مِنَ الْمُسْلِمِينَ ثَلاَثَةٌ مِنَ الْوَلَدِ، تَمَسُّهُ النَّارُ، إِلاَّ تَحِلَّةَ الْقَسَمِ ‏\"‏‏.‏"
      },
      {
        "id": 6391,
        "hadith_number": "6657",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Golongan Penghuni Syurga dan Neraka",
        "perawi_melayu": "Diriwayatkan daripada Haritha bin Wahb:",
        "english_text": "I heard the Prophet (ﷺ) saying, \"Shall I tell you of the people of Paradise? They comprise every poor humble person, and if he swears by Allah to do something, Allah will fulfill it; while the people of the fire comprise every violent, cruel arrogant person.\"",
        "malay_translation": "Saya mendengar Nabi (ﷺ) bersabda, \"Mahukah aku khabarkan kepada kamu tentang ahli syurga? Mereka adalah setiap orang miskin yang merendah diri, dan jika dia bersumpah dengan nama Allah untuk melakukan sesuatu, Allah akan menunaikannya; manakala ahli neraka pula terdiri daripada setiap orang yang ganas, kejam, dan sombong.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ مَعْبَدِ بْنِ خَالِدٍ، سَمِعْتُ حَارِثَةَ بْنَ وَهْبٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ أَلاَ أَدُلُّكُمْ عَلَى أَهْلِ الْجَنَّةِ، كُلُّ ضَعِيفٍ مُتَضَعَّفٍ، لَوْ أَقْسَمَ عَلَى اللَّهِ لأَبَرَّهُ، وَأَهْلِ النَّارِ كُلُّ جَوَّاظٍ عُتُلٍّ مُسْتَكْبِرٍ ‏\"‏‏.‏"
      },
      {
        "id": 6392,
        "hadith_number": "6658",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Generasi Terbaik dan Amaran Sumpah Palsu",
        "perawi_melayu": "Diriwayatkan oleh 'Abdullah رضي الله عنه :",
        "english_text": "The Prophet (ﷺ) was asked, \"Who are the best people?\" He replied: The people of my generation, and then those who will follow (come after) them, and then those who will come after the later; after that there will come some people whose witness will precede their oaths and their oaths will go ahead of their witness.\" Ibrahim (a sub-narrator) said, \"When we were young, our elder friends used to prohibit us from taking oaths by saying, 'I bear witness swearing by Allah, or by Allah's Covenant.'\"",
        "malay_translation": "Nabi (ﷺ) ditanya, \"Siapakah manusia yang terbaik?\" Baginda menjawab: \"Orang-orang pada generasiku, kemudian orang-orang yang mengikut (datang selepas) mereka, dan kemudian orang-orang yang datang selepas itu; selepas itu akan datang beberapa orang yang mana saksi mereka akan mendahului sumpah mereka dan sumpah mereka akan mendahului saksi mereka.\" Ibrahim (seorang sub-periwayat) berkata, \"Ketika kami masih muda, rakan-rakan kami yang lebih tua melarang kami daripada bersumpah dengan mengatakan, 'Saya bersaksi bersumpah demi Allah, atau demi Perjanjian Allah.'\"",
        "arabic_text": "حَدَّثَنَا سَعْدُ بْنُ حَفْصٍ، حَدَّثَنَا شَيْبَانُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَبِيدَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ سُئِلَ النَّبِيُّ صلى الله عليه وسلم أَىُّ النَّاسِ خَيْرٌ قَالَ ‏ \"‏ قَرْنِي، ثُمَّ الَّذِينَ يَلُونَهُمْ، ثُمَّ الَّذِينَ يَلُونَهُمْ، ثُمَّ يَجِيءُ قَوْمٌ تَسْبِقُ شَهَادَةُ أَحَدِهِمْ يَمِينَهُ، وَيَمِينُهُ شَهَادَتَهُ ‏\"‏‏.‏ قَالَ إِبْرَاهِيمُ وَكَانَ أَصْحَابُنَا يَنْهَوْنَا وَنَحْنُ غِلْمَانٌ أَنْ نَحْلِفَ بِالشَّهَادَةِ وَالْعَهْدِ‏.‏"
      },
      {
        "id": 6393,
        "hadith_number": "6659, 6660",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kemurkaan Allah Terhadap Orang yang Bersumpah Palsu untuk Merampas Harta",
        "perawi_melayu": "Diriwayatkan daripada Abdullah رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) said, \"Whoever swears falsely in order to grab the property of a Muslim (or of his brother), Allah will be angry with him when he meets Him.\" Allah then revealed in confirmation of the above statement:--'Verily those who purchase a small gain at the cost of Allah's Covenant and their own oaths.' (3.77)\r\nHadrat Solaiman has said in his report that Ash'ath bin Qais  رضی اللہ عنہ said: What was Hadrat Abdullah telling you? When the people had told, Al-Ash'ath رضی اللہ عنہ said, \"This Verse was revealed regarding me and a companion of mine when we had a dispute about a well.\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Sesiapa yang bersumpah palsu untuk merampas harta seorang Muslim (atau saudaranya), Allah akan murka kepadanya ketika dia menemui-Nya.\" Allah kemudian menurunkan wahyu untuk mengesahkan kenyataan di atas:--'Sesungguhnya orang-orang yang membeli keuntungan yang sedikit dengan menggadaikan janji Allah dan sumpah mereka sendiri.' (3:77)\r\nHadrat Solaiman berkata dalam laporannya bahawa Ash'ath bin Qais رضی اللہ عنہ berkata: Apakah yang Hadrat Abdullah beritahu kamu? Apabila orang ramai telah menceritakan, Al-Ash'ath رضی اللہ عنہ berkata, \"Ayat ini diturunkan mengenai saya dan seorang sahabat saya ketika kami berselisih tentang sebuah telaga.\"",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، وَمَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ حَلَفَ عَلَى يَمِينٍ كَاذِبَةٍ، لِيَقْتَطِعَ بِهَا مَالَ رَجُلٍ مُسْلِمٍ أَوْ قَالَ أَخِيهِ لَقِيَ اللَّهَ وَهْوَ عَلَيْهِ غَضْبَانُ ‏\"‏‏.‏ فَأَنْزَلَ اللَّهُ تَصْدِيقَهُ ‏{‏إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ‏}.\r\nقَالَ سُلَيْمَانُ فِي حَدِيثِهِ فَمَرَّ الأَشْعَثُ بْنُ قَيْسٍ فَقَالَ مَا يُحَدِّثُكُمْ عَبْدُ اللَّهِ قَالُوا لَهُ فَقَالَ الأَشْعَثُ نَزَلَتْ فِيَّ، وَفِي صَاحِبٍ لِي، فِي بِئْرٍ كَانَتْ بَيْنَنَا‏.‏"
      },
      {
        "id": 6394,
        "hadith_number": "6661",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Api Neraka Meminta Tambahan Penghuni Hingga Allah Meletakkan Kaki-Nya",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) said, \"The Hell Fire will keep on saying: 'Are there anymore (people to come)?' Till the Lord of Power and Honor will put His Foot over it and then it will say, 'Qat! Qat! (sufficient! sufficient!) by Your Power and Honor. And its various sides will come close to each other (i.e., it will contract). \" Shobah has also reported it from Qatadah.",
        "malay_translation": "Nabi ﷺ bersabda, \"Api Neraka akan terus berkata: 'Adakah lagi (orang yang akan datang)?' Sehingga Tuhan Yang Maha Kuasa dan Maha Mulia meletakkan Kaki-Nya ke atasnya, lalu ia akan berkata, 'Qat! Qat! (cukup! cukup!) demi Kekuasaan dan Kemuliaan-Mu.' Dan pelbagai sisinya akan menghampiri antara satu sama lain (iaitu, ia akan mengecut).\" Shobah juga telah meriwayatkannya daripada Qatadah.",
        "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شَيْبَانُ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ تَزَالُ جَهَنَّمُ تَقُولُ هَلْ مِنْ مَزِيدٍ حَتَّى يَضَعَ رَبُّ الْعِزَّةِ فِيهَا قَدَمَهُ فَتَقُولُ قَطْ قَطْ وَعِزَّتِكَ‏.‏ وَيُزْوَى بَعْضُهَا إِلَى بَعْضٍ ‏\"‏‏.‏ رَوَاهُ شُعْبَةُ عَنْ قَتَادَةَ‏.‏"
      },
      {
        "id": 6395,
        "hadith_number": "6662",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Fitnah ke Atas Aisyah (RA)",
        "perawi_melayu": "Diriwayatkan oleh Az-Zuhri:",
        "english_text": "I heard `Urwa bin Az-Zubair, Sa`id bin Al-Musaiyab, 'Alqama bin Waqqas and 'Ubaidullah bin `Abdullah رضی اللہ عنہما narrating from `Aisha رضی اللہ عنہا , the wife of the Prophet, the story about the liars who said what they said about her and how Allah revealed her innocence afterwards. Each one of the above four narrators narrated to me a portion of her narration. (It was said in it), \"The Prophet (ﷺ) stood up, saying, 'Is there anyone who can relieve me from `Abdullah bin Ubai?' On that, Usaid bin Hudair رضی اللہ عنہ got up and said to Sa`d bin 'Ubada رضی اللہ عنہ , La`Amrullahi (By the Eternity of Allah), we will kill him!' \"",
        "malay_translation": "Saya mendengar 'Urwa bin Az-Zubair, Sa`id bin Al-Musaiyab, 'Alqama bin Waqqas dan 'Ubaidullah bin `Abdullah رضي الله عنهم meriwayatkan daripada `Aisyah رضي الله عنها, isteri Nabi, kisah tentang orang-orang yang berdusta yang berkata tentangnya dan bagaimana Allah mendedahkan kesuciannya selepas itu. Setiap seorang daripada empat perawi di atas menceritakan kepada saya sebahagian daripada riwayatnya. (Dikatakan di dalamnya), \"Nabi (ﷺ) berdiri, sambil berkata, 'Adakah sesiapa yang boleh melegakan saya daripada `Abdullah bin Ubai?' Pada ketika itu, Usaid bin Hudair رضي الله عنه bangun dan berkata kepada Sa`d bin 'Ubada رضي الله عنه , La`Amrullahi (Demi Keabadian Allah), kami akan membunuhnya!\"",
        "arabic_text": "حَدَّثَنَا الأُوَيْسِيُّ، حَدَّثَنَا إِبْرَاهِيمُ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، ح وَحَدَّثَنَا حَجَّاجٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ النُّمَيْرِيُّ، حَدَّثَنَا يُونُسُ، قَالَ سَمِعْتُ الزُّهْرِيَّ، قَالَ سَمِعْتُ عُرْوَةَ بْنَ الزُّبَيْرِ، وَسَعِيدَ بْنَ الْمُسَيَّبِ، وَعَلْقَمَةَ بْنَ وَقَّاصٍ، وَعُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ، عَنْ حَدِيثِ، عَائِشَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم حِينَ قَالَ لَهَا أَهْلُ الإِفْكِ مَا قَالُوا، فَبَرَّأَهَا اللَّهُ، وَكُلٌّ حَدَّثَنِي طَائِفَةً مِنَ الْحَدِيثِ ـ فَقَامَ النَّبِيُّ صلى الله عليه وسلم فَاسْتَعْذَرَ مِنْ عَبْدِ اللَّهِ بْنِ أُبَىٍّ، فَقَامَ أُسَيْدُ بْنُ حُضَيْرٍ فَقَالَ لِسَعْدِ بْنِ عُبَادَةَ لَعَمْرُ اللَّهِ لَنَقْتُلَنَّهُ‏.‏"
      },
      {
        "id": 6396,
        "hadith_number": "6663",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ayat Mengenai Sumpah yang Tidak Sengaja",
        "perawi_melayu": "Diriwayatkan oleh `Aisha رضي الله عنها :",
        "english_text": "The verse: ''Allah does not call you to account for your such oaths as they come out of your tongues unintentionally'' . of chapter Al-Baqarah has been revealed about taking oaths by saying: ''لاَ ,وَاللَّهِ ,  بَلَى وَاللَّهِ''",
        "malay_translation": "Ayat: ''Allah tidak menghukum kamu disebabkan sumpah-sumpahmu yang tidak disengaja keluar dari mulutmu'' dari surah Al-Baqarah telah diturunkan berkenaan dengan bersumpah dengan berkata: ''لاَ ,وَاللَّهِ ,  بَلَى وَاللَّهِ''",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ‏{‏لاَ يُؤَاخِذُكُمُ اللَّهُ بِاللَّغْوِ‏}‏ قَالَ قَالَتْ أُنْزِلَتْ فِي قَوْلِهِ لاَ، وَاللَّهِ بَلَى وَاللَّهِ‏.‏"
      },
      {
        "id": 6397,
        "hadith_number": "6664",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kemaafan Allah Terhadap Bisikan Jiwa Selagi Tidak Dilakukan atau Dikatakan",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) said, \"Allah forgives my followers those (evil deeds) their souls may whisper or suggest to them as long as they do not act (on it) or speak.\"",
        "malay_translation": "Nabi ﷺ bersabda, \"Allah mengampuni umatku atas bisikan (perbuatan jahat) yang mungkin dibisikkan atau disarankan oleh jiwa mereka selagi mereka tidak melakukannya atau mengatakannya.\"",
        "arabic_text": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، حَدَّثَنَا مِسْعَرٌ، حَدَّثَنَا قَتَادَةُ، حَدَّثَنَا زُرَارَةُ بْنُ أَوْفَى، عَنْ أَبِي هُرَيْرَةَ، يَرْفَعُهُ قَالَ ‏ \"‏ إِنَّ اللَّهَ تَجَاوَزَ لأُمَّتِي عَمَّا وَسْوَسَتْ أَوْ حَدَّثَتْ بِهِ أَنْفُسَهَا، مَا لَمْ تَعْمَلْ بِهِ أَوْ تَكَلَّمْ ‏\"‏‏.‏"
      },
      {
        "id": 6398,
        "hadith_number": "6665",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kebenaran dalam Pelaksanaan Haji pada Hari Nahr",
        "perawi_melayu": "Diriwayatkan oleh Abdullah bin Amr bin Al-As:",
        "english_text": "While the Prophet (ﷺ) was delivering a sermon on the Day of Nahr (i.e., 10th Dhul-Hijja-Day of slaughtering the sacrifice), a man got up saying, \"I thought, O Allah's Messenger (ﷺ), such-and-such a thing was to be done before such-and-such a thing.\" Another man got up, saying, \"O Allah's Messenger (ﷺ)! As regards these three (acts of Hajj), thought so-and-so.\" The Prophet (ﷺ) said, \"Do, and there is no harm,\" concerning all those matters on that day. And so, on that day, whatever question he was asked, he said, \"Do it, do it, and there is no harm therein.\"",
        "malay_translation": "Semasa Nabi (ﷺ) menyampaikan khutbah pada Hari Nahr (iaitu, 10 Dhul-Hijjah - Hari penyembelihan korban), seorang lelaki bangun berkata, \"Saya menyangka, wahai Rasulullah (ﷺ), perkara begini dan begini sepatutnya dilakukan sebelum perkara begini dan begini.\" Seorang lagi lelaki bangun, berkata, \"Wahai Rasulullah (ﷺ)! Berkenaan tiga (amalan haji) ini, saya menyangka begini dan begini.\" Nabi (ﷺ) bersabda, \"Lakukanlah, dan tidak ada salahnya,\" berkenaan semua perkara tersebut pada hari itu. Maka, pada hari itu, apa sahaja soalan yang ditanya kepada Baginda, Baginda bersabda, \"Lakukanlah, lakukanlah, dan tidak ada salahnya di dalamnya.\"",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ الْهَيْثَمِ، أَوْ مُحَمَّدٌ عَنْهُ عَنِ ابْنِ جُرَيْجٍ، قَالَ سَمِعْتُ ابْنَ شِهَابٍ، يَقُولُ حَدَّثَنِي عِيسَى بْنُ طَلْحَةَ، أَنَّ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ، حَدَّثَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم بَيْنَمَا هُوَ يَخْطُبُ يَوْمَ النَّحْرِ إِذْ قَامَ إِلَيْهِ رَجُلٌ فَقَالَ كُنْتُ أَحْسِبُ يَا رَسُولَ اللَّهِ كَذَا وَكَذَا قَبْلَ كَذَا وَكَذَا‏.‏ ثُمَّ قَامَ آخَرُ فَقَالَ يَا رَسُولَ اللَّهِ كُنْتُ أَحْسِبُ كَذَا وَكَذَا لِهَؤُلاَءِ الثَّلاَثِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ افْعَلْ وَلاَ حَرَجَ ‏\"‏ لَهُنَّ كُلِّهِنَّ يَوْمَئِذٍ، فَمَا سُئِلَ يَوْمَئِذٍ عَنْ شَىْءٍ إِلاَّ قَالَ ‏\"‏ افْعَلْ وَلاَ حَرَجَ ‏\"‏‏.‏"
      },
      {
        "id": 6399,
        "hadith_number": "6666",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Tiada Masalah dalam Pelaksanaan Rukun Haji yang Tertukar",
        "perawi_melayu": "Diriwayatkan oleh Ibnu Abbas رضي الله عنهما :",
        "english_text": "A man said to the Prophet (while he was delivering a sermon on the Day of Nahr), \"I have performed the Tawaf round the Ka`ba before the Rami (throwing pebbles) at the Jamra.\" The Prophet (ﷺ) said, \"There is no harm (therein).\" Another man said, \"I had my head shaved before slaughtering (the sacrifice).\" The Prophet (ﷺ) said, \"There is no harm.\" A third said, \"I have slaughtered (the sacrifice) before the Rami (throwing pebbles) at the Jamra.\" The Prophet (ﷺ) said, \"There is no harm.\"",
        "malay_translation": "Seorang lelaki berkata kepada Nabi ﷺ (semasa baginda menyampaikan khutbah pada Hari Nahr), \"Saya telah melakukan Tawaf mengelilingi Ka`bah sebelum Rami (melontar anak batu) di Jamrah.\" Nabi ﷺ bersabda, \"Tiada masalah (di dalamnya).\" Seorang lelaki lain berkata, \"Saya telah mencukur kepala saya sebelum menyembelih (sembelihan).\" Nabi ﷺ bersabda, \"Tiada masalah.\" Seorang lagi berkata, \"Saya telah menyembelih (sembelihan) sebelum Rami (melontar anak batu) di Jamrah.\" Nabi ﷺ bersabda, \"Tiada masalah.\"",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا أَبُو بَكْرٍ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ رَجُلٌ لِلنَّبِيِّ صلى الله عليه وسلم زُرْتُ قَبْلَ أَنْ أَرْمِيَ‏.‏ قَالَ ‏\"‏ لاَ حَرَجَ ‏\"‏‏.‏ قَالَ آخَرُ حَلَقْتُ قَبْلَ أَنْ أَذْبَحَ‏.‏ قَالَ ‏\"‏ لاَ حَرَجَ ‏\"‏‏.‏ قَالَ آخَرُ ذَبَحْتُ قَبْلَ أَنْ أَرْمِيَ‏.‏ قَالَ ‏\"‏ لاَ حَرَجَ ‏\"‏‏.‏"
      },
      {
        "id": 6400,
        "hadith_number": "6667",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Solat yang Betul",
        "perawi_melayu": "Diriwayatkan oleh Abu Huraira:",
        "english_text": "A man entered the mosque and started praying while Allah's Messenger (ﷺ) was sitting somewhere in the mosque. Then (after finishing the prayer) the man came to the Prophet (ﷺ) and greeted him. The Prophet (ﷺ) said to him, \"Go back and pray, for you have not prayed. The man went back, and having prayed, he came and greeted the Prophet. The Prophet (ﷺ) after returning his greetings said, \"Go back and pray, for you did not pray.\" On the third time the man said, \"(O Allah's Messenger (ﷺ)!) teach me (how to pray).\" The Prophet said, \"When you get up for the prayer, perform the ablution properly and then face the Qibla and say Takbir (Allahu Akbar), and then recite of what you know of the Qur'an, and then bow, and remain in this state till you feel at rest in bowing, and then raise your head and stand straight; and then prostrate till you feel at rest in prostration, and then sit up till you feel at rest while sitting; and then prostrate again till you feel at rest in prostration; and then get up and stand straight, and do all this in all your prayers.\"",
        "malay_translation": "Seorang lelaki masuk ke dalam masjid dan mula bersolat sedangkan Rasulullah (ﷺ) sedang duduk di suatu tempat di dalam masjid. Kemudian (selepas selesai solat) lelaki itu datang kepada Nabi (ﷺ) dan memberi salam kepada baginda. Nabi (ﷺ) bersabda kepadanya, \"Kembalilah dan solatlah, kerana sesungguhnya engkau belum bersolat.\" Lelaki itu kembali, dan setelah bersolat, dia datang dan memberi salam kepada Nabi. Nabi (ﷺ) setelah membalas salamnya bersabda, \"Kembalilah dan solatlah, kerana sesungguhnya engkau belum bersolat.\" Pada kali ketiga lelaki itu berkata, \"(Wahai Rasulullah (ﷺ)!) ajarkanlah aku (bagaimana cara solat).\" Nabi bersabda, \"Apabila engkau bangun untuk solat, berwudhulah dengan sempurna, kemudian menghadaplah ke arah kiblat dan ucapkan takbir (Allahu Akbar), kemudian bacalah apa yang engkau ketahui daripada al-Quran, kemudian rukuklah, dan kekallah dalam keadaan ini sehingga engkau merasa tenang dalam rukuk, kemudian angkatlah kepalamu dan berdirilah tegak; kemudian sujudlah sehingga engkau merasa tenang dalam sujud, kemudian duduklah sehingga engkau merasa tenang semasa duduk; kemudian sujudlah sekali lagi sehingga engkau merasa tenang dalam sujud; kemudian bangunlah dan berdirilah tegak, dan lakukanlah semua ini dalam semua solatmu.\"",
        "arabic_text": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً، دَخَلَ الْمَسْجِدَ يُصَلِّي وَرَسُولُ اللَّهِ صلى الله عليه وسلم فِي نَاحِيَةِ الْمَسْجِدِ، فَجَاءَ فَسَلَّمَ عَلَيْهِ فَقَالَ لَهُ ‏\"‏ ارْجِعْ فَصَلِّ، فَإِنَّكَ لَمْ تُصَلِّ ‏\"‏‏.‏ فَرَجَعَ فَصَلَّى، ثُمَّ سَلَّمَ فَقَالَ ‏\"‏ وَعَلَيْكَ، ارْجِعْ فَصَلِّ، فَإِنَّكَ لَمْ تُصَلِّ ‏\"‏‏.‏ قَالَ فِي الثَّالِثَةِ فَأَعْلِمْنِي‏.‏ قَالَ ‏\"‏ إِذَا قُمْتَ إِلَى الصَّلاَةِ فَأَسْبِغِ الْوُضُوءَ، ثُمَّ اسْتَقْبِلِ الْقِبْلَةَ فَكَبِّرْ، وَاقْرَأْ بِمَا تَيَسَّرَ مَعَكَ مِنَ الْقُرْآنِ، ثُمَّ ارْكَعْ حَتَّى تَطْمَئِنَّ رَاكِعًا، ثُمَّ ارْفَعْ رَأْسَكَ حَتَّى تَعْتَدِلَ قَائِمًا، ثُمَّ اسْجُدْ حَتَّى تَطْمَئِنَّ، سَاجِدًا ثُمَّ ارْفَعْ حَتَّى تَسْتَوِيَ وَتَطْمَئِنَّ جَالِسًا، ثُمَّ اسْجُدْ حَتَّى تَطْمَئِنَّ سَاجِدًا، ثُمَّ ارْفَعْ حَتَّى تَسْتَوِيَ قَائِمًا، ثُمَّ افْعَلْ ذَلِكَ فِي صَلاَتِكَ كُلِّهَا ‏\"‏‏.‏"
      },
      {
        "id": 6401,
        "hadith_number": "6668",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Hudzaifah bin Al-Yaman semasa Perang Uhud",
        "perawi_melayu": "Diriwayatkan oleh `Aisha رضی اللہ عنہا :",
        "english_text": "When the pagans were defeated during the (first stage) of the battle of Uhud, Satan shouted, \"O Allah's slaves! Beware of what is behind you!\" So the front files of the Muslims attacked their own back files. Hudhaifa bin Al-Yaman رضی اللہ عنہ looked and on seeing his father he shouted: \"My father! My father!\" By Allah! The people did not stop till they killed his father. Hudhaifa رضی اللہ عنہ then said, \"May Allah forgive you.\" `Urwa (the sub-narrator) added, \"Hudhaifa رضی اللہ عنہ continued asking Allah forgiveness for the killers of his father till he met Allah (till he died).",
        "malay_translation": "Ketika orang-orang kafir dikalahkan semasa (peringkat pertama) dalam peperangan Uhud, Syaitan berteriak, \"Wahai hamba-hamba Allah! Berhati-hatilah dengan apa yang ada di belakang kamu!\" Maka barisan hadapan umat Islam menyerang barisan belakang mereka sendiri. Hudzaifah bin Al-Yaman رضی اللہ عنہ melihat dan apabila melihat ayahnya, dia berteriak: \"Ayahku! Ayahku!\" Demi Allah! Orang ramai tidak berhenti sehingga mereka membunuh ayahnya. Hudzaifah رضی اللہ عنہ kemudian berkata, \"Semoga Allah mengampuni kamu.\" `Urwa (perawi tambahan) menambah, \"Hudzaifah رضی اللہ عنہ terus memohon keampunan Allah untuk pembunuh ayahnya sehingga dia menemui Allah (sehingga dia meninggal dunia).",
        "arabic_text": "حَدَّثَنَا فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ هُزِمَ الْمُشْرِكُونَ يَوْمَ أُحُدٍ هَزِيمَةً تُعْرَفُ فِيهِمْ، فَصَرَخَ إِبْلِيسُ أَىْ عِبَادَ اللَّهِ أُخْرَاكُمْ، فَرَجَعَتْ أُولاَهُمْ فَاجْتَلَدَتْ هِيَ وَأُخْرَاهُمْ، فَنَظَرَ حُذَيْفَةُ بْنُ الْيَمَانِ فَإِذَا هُوَ بِأَبِيهِ فَقَالَ أَبِي أَبِي‏.‏ قَالَتْ فَوَاللَّهِ مَا انْحَجَزُوا حَتَّى قَتَلُوهُ، فَقَالَ حُذَيْفَةُ غَفَرَ اللَّهُ لَكُمْ‏.‏ قَالَ عُرْوَةُ فَوَاللَّهِ مَا زَالَتْ فِي حُذَيْفَةَ مِنْهَا بَقِيَّةٌ حَتَّى لَقِيَ اللَّهَ‏.‏"
      },
      {
        "id": 6402,
        "hadith_number": "6669",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Orang Berpuasa Makan atau Minum Lupa",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) said, \"If somebody eats something forgetfully while he is fasting, then he should complete his fast, for Allah has made him eat and drink.\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Jika seseorang makan sesuatu kerana terlupa sedangkan dia sedang berpuasa, maka hendaklah dia menyempurnakan puasanya kerana Allah telah memberinya makan dan minum.\"",
        "arabic_text": "حَدَّثَنِي يُوسُفُ بْنُ مُوسَى، حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ حَدَّثَنِي عَوْفٌ، عَنْ خِلاَسٍ، وَمُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَنْ أَكَلَ نَاسِيًا وَهْوَ صَائِمٌ فَلْيُتِمَّ صَوْمَهُ، فَإِنَّمَا أَطْعَمَهُ اللَّهُ وَسَقَاهُ ‏\"‏‏.‏"
      },
      {
        "id": 6403,
        "hadith_number": "6670",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah ﷺ Sujud Sahwi Selepas Terlupa Dalam Solat",
        "perawi_melayu": "Diriwayatkan oleh Abdullah bin Buhaina رضى الله عنه :",
        "english_text": "Once Allah's Messenger (ﷺ) led us in prayer, and after finishing the first two rak`at, got up (instead of sitting for at-Tahiyyat) and then carried on with the prayer. When he had finished his prayer, the people were waiting for him to say Taslim, but before saying Tasiim, he said Takbir and prostrated; then he raised his head, and saying Takbir, he prostrated (SAHU) and then raised his head and finished his prayer with Taslim.",
        "malay_translation": "Suatu ketika Rasulullah ﷺ mengimami kami dalam solat, dan setelah selesai dua rakaat pertama, baginda bangun (sebagai ganti duduk untuk tahiyat) dan meneruskan solat. Apabila baginda selesai solat, orang ramai menunggu baginda mengucapkan Taslim, tetapi sebelum mengucapkan Taslim, baginda bertakbir dan sujud; kemudian baginda mengangkat kepala, dan mengucapkan Takbir, baginda sujud (SAHU) dan kemudian mengangkat kepalanya dan mengakhiri solatnya dengan Taslim.",
        "arabic_text": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنِ الأَعْرَجِ، عَنْ عَبْدِ اللَّهِ ابْنِ بُحَيْنَةَ، قَالَ صَلَّى بِنَا النَّبِيُّ صلى الله عليه وسلم فَقَامَ فِي الرَّكْعَتَيْنِ الأُولَيَيْنِ قَبْلَ أَنْ يَجْلِسَ، فَمَضَى فِي صَلاَتِهِ، فَلَمَّا قَضَى صَلاَتَهُ انْتَظَرَ النَّاسُ تَسْلِيمَهُ، وَسَجَدَ قَبْلَ أَنْ يُسَلِّمَ، ثُمَّ رَفَعَ رَأْسَهُ، ثُمَّ كَبَّرَ وَسَجَدَ، ثُمَّ رَفَعَ رَأْسَهُ وَسَلَّمَ‏.‏"
      },
      {
        "id": 6404,
        "hadith_number": "6671",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Sujud Sahwi: Nabi memimpin solat Zuhur dan melakukan sujud tambahan",
        "perawi_melayu": "Diriwayatkan oleh Ibnu Mas`ud رضی اللہ عنہ :",
        "english_text": "that Allah's Prophet led them in the Zuhr prayer and he offered either more or less rak`at, and it was said to him, \"O Allah's Messenger (ﷺ) ! Has the prayer been reduced, or have you forgotten?\" He asked, \"What is that?\" They said, \"You have prayed so many rak`at.\" So he performed with them two more prostrations and said, \"These two prostrations are to be performed by the person who does not know whether he has prayed more or less (rak`at) in which case he should seek to follow what is right. And then complete the rest (of the prayer) and perform two extra prostrations.\"",
        "malay_translation": "Bahawa Nabi Allah memimpin mereka dalam solat Zuhur dan baginda menawarkan sama ada lebih atau kurang rakaat. Lalu dikatakan kepada baginda, \"Wahai Rasulullah (ﷺ) ! Adakah solat itu telah dikurangkan, atau adakah engkau terlupa?\" Baginda bertanya, \"Apakah itu?\" Mereka berkata, \"Engkau telah menunaikan solat sebanyak ini rakaat.\" Kemudian baginda melakukan bersama mereka dua sujud lagi dan bersabda, \"Dua sujud ini hendaklah dilakukan oleh orang yang tidak tahu sama ada dia telah menunaikan solat lebih atau kurang (rakaat), dalam hal ini dia hendaklah berusaha mengikut apa yang betul. Kemudian sempurnakanlah selebihnya (solat) dan lakukanlah dua sujud tambahan.\"",
        "arabic_text": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ، سَمِعَ عَبْدَ الْعَزِيزِ بْنَ عَبْدِ الصَّمَدِ، حَدَّثَنَا مَنْصُورٌ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنِ ابْنِ مَسْعُودٍ ـ رضى الله عنه أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم صَلَّى بِهِمْ صَلاَةَ الظُّهْرِ، فَزَادَ أَوْ نَقَصَ مِنْهَا ـ قَالَ مَنْصُورٌ لاَ أَدْرِي إِبْرَاهِيمُ وَهِمَ أَمْ عَلْقَمَةُ ـ قَالَ قِيلَ يَا رَسُولَ اللَّهِ أَقَصُرَتِ الصَّلاَةُ أَمْ نَسِيتَ قَالَ ‏\"‏ وَمَا ذَاكَ ‏\"‏‏.‏ قَالُوا صَلَّيْتَ كَذَا وَكَذَا‏.‏ قَالَ فَسَجَدَ بِهِمْ سَجْدَتَيْنِ ثُمَّ قَالَ ‏\"‏ هَاتَانِ السَّجْدَتَانِ لِمَنْ لاَ يَدْرِي، زَادَ فِي صَلاَتِهِ أَمْ نَقَصَ، فَيَتَحَرَّى الصَّوَابَ، فَيُتِمُّ مَا بَقِيَ، ثُمَّ يَسْجُدُ سَجْدَتَيْنِ ‏\"‏‏.‏"
      },
      {
        "id": 6405,
        "hadith_number": "6672",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Alasan Pertama Nabi Musa (AS) : Lupa",
        "perawi_melayu": "Diriwayatkan oleh Ubai bin Ka'b رضی اللہ عنہ :",
        "english_text": "He heard Allah's Messenger (ﷺ) saying, \"(Moses) said, 'Call me not to account for what I forget and be not hard upon me for my affair (with you)' (18.73) the first excuse of Moses was his forgetfulness.\"",
        "malay_translation": "Beliau mendengar Rasulullah (ﷺ) bersabda, \"(Musa) berkata, 'Janganlah engkau menghukumku disebabkan apa yang aku lupa dan janganlah engkau memberati aku dalam urusanku (denganmu)' (18:73) Alasan pertama Musa adalah kelupaannya.\"",
        "arabic_text": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، أَخْبَرَنِي سَعِيدُ بْنُ جُبَيْرٍ، قَالَ قُلْتُ لاِبْنِ عَبَّاسٍ فَقَالَ حَدَّثَنَا أُبَىُّ بْنُ كَعْبٍ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏{‏لاَ تُؤَاخِذْنِي بِمَا نَسِيتُ وَلاَ تُرْهِقْنِي مِنْ أَمْرِي عُسْرًا‏}‏ قَالَ ‏\"‏ كَانَتِ الأُولَى مِنْ مُوسَى نِسْيَانًا ‏\"‏‏.‏"
      },
      {
        "id": 6406,
        "hadith_number": "6673",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menyembelih Korban Sebelum Solat 'Id kerana Tetamu",
        "perawi_melayu": "Diriwayatkan oleh Al-Bara bin Azib رضی اللہ عنہ :",
        "english_text": "Once he had a guest, so he told his family (on the Day of Id-ul-Adha) that they should slaughter the animal for sacrifice before he returned from the ('Id) prayer in order that their guest could take his meal. So his family slaughtered (the animal ) before the prayer. Then they mentioned that event to the Prophet who ordered Al-Bara رضی اللہ عنہ to slaughter another sacrifice. Al-Bara' رضی اللہ عنہ said to the Prophet (ﷺ) , \"I have a young milch she-goat which is better than two sheep for slaughtering.\" (The sub-narrator, Ibn 'Aun used to say, \"I don't know whether the permission (to slaughter a she-goat as a sacrifice) was especially given to Al-Bara' رضی اللہ عنہ or if it was in general for all the Muslims.\") Ayyub, Ibn-e-Sireen, Hadrat Anas رضی اللہ عنہ reported it from the prophet ﷺ.",
        "malay_translation": "Suatu ketika, baginda mempunyai tetamu, lalu baginda memberitahu keluarga baginda (pada Hari Raya Aidiladha) supaya mereka menyembelih haiwan korban sebelum baginda pulang daripada solat ('Id) supaya tetamu mereka dapat makan. Lalu keluarga baginda menyembelih (haiwan) sebelum solat. Kemudian, mereka menyebut peristiwa itu kepada Nabi yang memerintahkan Al-Bara رضی اللہ عنہ untuk menyembelih korban yang lain. Al-Bara' رضی اللہ عنہ berkata kepada Nabi (ﷺ), \"Saya mempunyai seekor kambing betina muda yang lebih baik daripada dua ekor kambing biri-biri untuk disembelih.\" (Perawi tambahan, Ibn 'Aun selalu berkata, \"Saya tidak tahu sama ada keizinan (untuk menyembelih seekor kambing betina sebagai korban) diberikan khas kepada Al-Bara' رضی اللہ عنہ atau jika ia adalah secara umum untuk semua umat Islam.\") Ayyub, Ibn-e-Sireen, Hadrat Anas رضی اللہ عنہ meriwayatkannya daripada Nabi ﷺ.",
        "arabic_text": "قَالَ أَبُو عَبْدِ اللَّهِ كَتَبَ إِلَىَّ مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنِ الشَّعْبِيِّ، قَالَ قَالَ الْبَرَاءُ بْنُ عَازِبٍ وَكَانَ عِنْدَهُمْ ضَيْفٌ لَهُمْ فَأَمَرَ أَهْلَهُ أَنْ يَذْبَحُوا قَبْلَ أَنْ يَرْجِعَ، لِيَأْكُلَ ضَيْفُهُمْ، فَذَبَحُوا قَبْلَ الصَّلاَةِ، فَذَكَرُوا ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَأَمَرَهُ أَنْ يُعِيدَ الذَّبْحَ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ عِنْدِي عَنَاقٌ جَذَعٌ، عَنَاقُ لَبَنٍ هِيَ خَيْرٌ مِنْ شَاتَىْ لَحْمٍ‏.‏ فَكَانَ ابْنُ عَوْنٍ يَقِفُ فِي هَذَا الْمَكَانِ عَنْ حَدِيثِ الشَّعْبِيِّ، وَيُحَدِّثُ عَنْ مُحَمَّدِ بْنِ سِيرِينَ بِمِثْلِ هَذَا الْحَدِيثِ، وَيَقِفُ فِي هَذَا الْمَكَانِ وَيَقُولُ لاَ أَدْرِي أَبَلَغَتِ الرُّخْصَةُ غَيْرَهُ أَمْ لاَ‏.‏ رَوَاهُ أَيُّوبُ عَنِ ابْنِ سِيرِينَ عَنْ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 6407,
        "hadith_number": "6674",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kewajipan Menyembelih Korban Selepas Solat 'Id",
        "perawi_melayu": "Diriwayatkan oleh Jundub رضی اللہ عنہ :",
        "english_text": "I witnessed the Prophet (ﷺ) offering the `Id prayer (and after finishing it) he delivered a sermon and said, \"Whoever has slaughtered his sacrifice (before the prayer) should make up for it (i.e. slaughter another animal) and whoever has not slaughtered his sacrifice yet, should slaughter it by mentioning Allah's Name over it.\"",
        "malay_translation": "Saya menyaksikan Nabi (ﷺ) menunaikan solat 'Id (dan selepas selesai) Baginda menyampaikan khutbah dan bersabda, \"Sesiapa yang telah menyembelih korbannya (sebelum solat) hendaklah menggantikannya (iaitu menyembelih binatang lain) dan sesiapa yang belum menyembelih korbannya, hendaklah menyembelihnya dengan menyebut nama Allah ke atasnya.\"",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَسْوَدِ بْنِ قَيْسٍ، قَالَ سَمِعْتُ جُنْدَبًا، قَالَ شَهِدْتُ النَّبِيَّ صلى الله عليه وسلم صَلَّى يَوْمَ عِيدٍ ثُمَّ خَطَبَ ثُمَّ قَالَ ‏ \"‏ مَنْ ذَبَحَ فَلْيُبَدِّلْ مَكَانَهَا، وَمَنْ لَمْ يَكُنْ ذَبَحَ فَلْيَذْبَحْ بِاسْمِ اللَّهِ ‏\"‏‏.‏"
      },
      {
        "id": 6408,
        "hadith_number": "6675",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Dosa-dosa Besar",
        "perawi_melayu": "Diriwayatkan oleh Abdullah bin Amr",
        "english_text": "The Prophet (ﷺ) said, \"The biggest sins are: To join others in worship with Allah; to be undutiful to one's parents; to kill somebody unlawfully; and to take an oath Al-Ghamus.",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Dosa-dosa yang paling besar ialah: Menyekutukan Allah; menderhakai ibu bapa; membunuh seseorang tanpa hak; dan bersumpah Al-Ghamus.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا النَّضْرُ، أَخْبَرَنَا شُعْبَةُ، حَدَّثَنَا فِرَاسٌ، قَالَ سَمِعْتُ الشَّعْبِيَّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْكَبَائِرُ الإِشْرَاكُ بِاللَّهِ، وَعُقُوقُ الْوَالِدَيْنِ، وَقَتْلُ النَّفْسِ، وَالْيَمِينُ الْغَمُوسُ ‏\"‏‏.‏"
      },
      {
        "id": 6409,
        "hadith_number": "6676, 6677",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Sumpah Palsu Merampas Harta Orang Islam",
        "perawi_melayu": "Diriwayatkan daripada Abdullah رضی اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) said, \"If somebody is ordered (by the ruler or the judge) to take an oath, and he takes a false oath in order to grab the property of a Muslim, then he will incur Allah's Wrath when he will meet Him.\" And Allah revealed in its confirmation: 'Verily! Those who purchase a small gain at the cost of Allah's covenants and their own oaths.' (3.77) (The sub-narrator added:) Al-Ash'ath bin Qais entered, saying, \"What did Abu `Abdur-Rahman narrate to you?\" They said, \"So-and-so,\" Al-Ash'ath said, \"This verse was revealed in my connection. I had a well on the land of my cousin (and we had a dispute about it). I reported him to Allah 's Apostle who said (to me). \"You should give evidence (i.e. witness) otherwise the oath of your opponent will render your claim invalid.\" I said, \"Then he (my opponent) will take the oath, O Allah's Messenger (ﷺ).\" Allah's Messenger (ﷺ) said, \"Whoever is ordered (by the ruler or the judge) to give an oath, and he takes a false oath in order to grab the property of a Muslim, then he will incur Allah's Wrath when he meets Him on the Day of Resurrection.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Sesiapa yang diperintah (oleh pemerintah atau hakim) untuk bersumpah, dan dia bersumpah palsu untuk merampas harta seorang Muslim, maka dia akan ditimpa kemurkaan Allah ketika dia bertemu-Nya.\" Dan Allah menurunkan dalam pengesahannya: 'Sesungguhnya orang-orang yang membeli keuntungan kecil dengan harga perjanjian Allah dan sumpah mereka sendiri.' (3:77) (Perawi tambahan berkata:) Al-Ash'ath bin Qais masuk dan berkata, \"Apakah yang Abu `Abdur-Rahman riwayatkan kepada kamu?\" Mereka berkata, \"Begini dan begitu,\" Al-Ash'ath berkata, \"Ayat ini diturunkan berkenaan dengan saya. Saya mempunyai telaga di tanah sepupu saya (dan kami mempunyai pertikaian mengenainya). Saya melaporkannya kepada Rasulullah yang berkata (kepada saya). \"Kamu harus memberi bukti (iaitu saksi) jika tidak sumpah lawan kamu akan menjadikan tuntutan kamu tidak sah.\" Saya berkata, \"Kemudian dia (lawan saya) akan bersumpah, Ya Rasulullah (ﷺ).\" Rasulullah (ﷺ) bersabda, \"Sesiapa yang diperintah (oleh pemerintah atau hakim) untuk bersumpah, dan dia bersumpah palsu untuk merampas harta seorang Muslim, maka dia akan ditimpa kemurkaan Allah ketika dia bertemu-Nya pada Hari Kiamat.\"",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ حَلَفَ عَلَى يَمِينِ صَبْرٍ، يَقْتَطِعُ بِهَا مَالَ امْرِئٍ مُسْلِمٍ، لَقِيَ اللَّهَ وَهْوَ عَلَيْهِ غَضْبَانُ ‏\"‏‏.‏ فَأَنْزَلَ اللَّهُ تَصْدِيقَ ذَلِكَ ‏{‏إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلاً‏}‏ إِلَى آخِرِ الآيَةِ‏. فَدَخَلَ الأَشْعَثُ بْنُ قَيْسٍ فَقَالَ مَا حَدَّثَكُمْ أَبُو عَبْدِ الرَّحْمَنِ، فَقَالُوا كَذَا وَكَذَا‏.‏ قَالَ فِيَّ أُنْزِلَتْ، كَانَتْ لِي بِئْرٌ فِي أَرْضِ ابْنِ عَمٍّ لِي فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ بَيِّنَتُكَ أَوْ يَمِينُهُ ‏\"‏‏.‏ قُلْتُ إِذًا يَحْلِفُ عَلَيْهَا يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ حَلَفَ عَلَى يَمِينِ صَبْرٍ، وَهْوَ فِيهَا فَاجِرٌ، يَقْتَطِعُ بِهَا مَالَ امْرِئٍ مُسْلِمٍ، لَقِيَ اللَّهَ يَوْمَ الْقِيَامَةِ، وَهْوَ عَلَيْهِ غَضْبَانُ ‏\"‏‏.‏"
      },
      {
        "id": 6410,
        "hadith_number": "6678",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi SAW Berjanji Memberi Kenderaan",
        "perawi_melayu": "Diriwayatkan oleh Abu Musa رضی اللہ عنہ :",
        "english_text": "My companions sent me to the Prophet (ﷺ) to ask him for some mounts. He said, \"By Allah! I will not mount you on anything!\" When I met him, he was in an angry mood, but when I met him (again), he said, \"Tell your companions that Allah or Allah's Messenger (ﷺ) will provide you with mounts.\"",
        "malay_translation": "Sahabat-sahabatku mengutusku kepada Nabi (ﷺ) untuk meminta kenderaan kepada Baginda. Baginda bersabda, \"Demi Allah! Aku tidak akan memberi kamu menunggang apa-apa!\" Apabila aku bertemu dengannya, Baginda dalam keadaan marah, tetapi apabila aku bertemu dengannya (lagi), Baginda bersabda, \"Katakan kepada sahabat-sahabatmu bahawa Allah atau Rasulullah (ﷺ) akan memberi kamu kenderaan.\"",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ أَرْسَلَنِي أَصْحَابِي إِلَى النَّبِيِّ صلى الله عليه وسلم أَسْأَلُهُ الْحُمْلاَنَ فَقَالَ ‏\"‏ وَاللَّهِ لاَ أَحْمِلُكُمْ عَلَى شَىْءٍ ‏\"‏‏.‏ وَوَافَقْتُهُ وَهْوَ غَضْبَانُ فَلَمَّا أَتَيْتُهُ قَالَ ‏\"‏ انْطَلِقْ إِلَى أَصْحَابِكَ فَقُلْ إِنَّ اللَّهَ ـ أَوْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ـ يَحْمِلُكُمْ ‏\"‏‏.‏"
      },
      {
        "id": 6411,
        "hadith_number": "6679",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Fitnah Terhadap Aisyah رضي الله عنها dan Wahyu Pembelaannya",
        "perawi_melayu": "Diriwayatkan oleh Az-Zuhri:",
        "english_text": "I heard `Urwa bin Az-Zubair, Sa`id bin Al-Musaiyab, 'Alqama bin Waqqas and 'Ubaidullah bin `Abdullah bin `Uqba relating from `Aisha رضی اللہ عنہا , the wife of the Prophet (ﷺ) the narration of the people (i.e. the liars) who spread the slander against her and they said what they said, and how Allah revealed her innocence. Each of them related to me a portion of that narration. (They said that `Aisha رضی اللہ عنہا said), ''Then Allah revealed the ten Verses starting with:--'Verily! Those who spread the slander..' (24.11-21) All these verses were in proof of my innocence. Abu Bakr As-Siddiq رضی اللہ عنہ who used to provide for Mistah some financial aid because of his relation to him, said, \"By Allah, I will never give anything (in charity) to Mistah, after what he has said about `Aisha رضی اللہ عنہا \" Then Allah revealed:-- 'And let not those among you who are good and are wealthy swear not to give (any sort of help) to their kins men....' (24.22) On that, Abu Bakr رضی اللہ عنہ said, \"Yes, by Allah, I like that Allah should forgive me.\" and then resumed giving Mistah the aid he used to give him and said, \"By Allah! I will never withhold it from him.\"",
        "malay_translation": "Saya mendengar `Urwa bin Az-Zubair, Sa`id bin Al-Musaiyab, 'Alqama bin Waqqas dan 'Ubaidullah bin `Abdullah bin `Uqba meriwayatkan daripada `Aisyah رضي الله عنها, isteri Nabi ﷺ, kisah orang-orang (yakni pembohong) yang menyebarkan fitnah terhadapnya dan apa yang mereka katakan, serta bagaimana Allah menurunkan wahyu yang membuktikan kesuciannya. Setiap daripada mereka menceritakan kepada saya sebahagian daripada kisah tersebut. (Mereka berkata bahawa `Aisyah رضي الله عنها berkata), ''Kemudian Allah menurunkan sepuluh ayat yang bermula dengan:--'Sesungguhnya orang-orang yang menyebarkan berita bohong itu...'(24:11-21) Semua ayat ini membuktikan kesucianku. Abu Bakr As-Siddiq رضي الله عنه yang biasa memberikan bantuan kewangan kepada Mistah kerana hubungan kekeluargaannya, berkata, \"Demi Allah, aku tidak akan memberikan apa-apa (sedekah) kepada Mistah, selepas apa yang dia katakan tentang `Aisyah رضي الله عنها.\" Kemudian Allah menurunkan:-- 'Dan janganlah orang-orang yang mempunyai kelebihan dan kelapangan di antara kamu bersumpah tidak akan memberi (bantuan) kepada kaum kerabatnya...' (24:22) Atas hal itu, Abu Bakr رضي الله عنه berkata, \"Ya, demi Allah, aku suka jika Allah mengampuniku.\" dan kemudian kembali memberikan bantuan kepada Mistah seperti yang biasa dia lakukan dan berkata, \"Demi Allah! Aku tidak akan menahannya daripadanya.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ، حَدَّثَنَا إِبْرَاهِيمُ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، ح وَحَدَّثَنَا الْحَجَّاجُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ النُّمَيْرِيُّ، حَدَّثَنَا يُونُسُ بْنُ يَزِيدَ الأَيْلِيُّ، قَالَ سَمِعْتُ الزُّهْرِيَّ، قَالَ سَمِعْتُ عُرْوَةَ بْنَ الزُّبَيْرِ، وَسَعِيدَ بْنَ الْمُسَيَّبِ، وَعَلْقَمَةَ بْنَ وَقَّاصٍ، وَعُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ حَدِيثِ، عَائِشَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم حِينَ قَالَ لَهَا أَهْلُ الإِفْكِ مَا قَالُوا، فَبَرَّأَهَا اللَّهُ مِمَّا قَالُوا ـ كُلٌّ حَدَّثَنِي طَائِفَةً مِنَ الْحَدِيثِ ـ فَأَنْزَلَ اللَّهُ ‏{‏إِنَّ الَّذِينَ جَاءُوا بِالإِفْكِ‏}‏ الْعَشْرَ الآيَاتِ كُلَّهَا فِي بَرَاءَتِي‏.‏ فَقَالَ أَبُو بَكْرٍ الصِّدِّيقُ ـ وَكَانَ يُنْفِقُ عَلَى مِسْطَحٍ لِقَرَابَتِهِ مِنْهُ ـ وَاللَّهِ لاَ أُنْفِقُ عَلَى مِسْطَحٍ شَيْئًا أَبَدًا، بَعْدَ الَّذِي قَالَ لِعَائِشَةَ‏.‏ فَأَنْزَلَ اللَّهُ ‏{‏وَلاَ يَأْتَلِ أُولُو الْفَضْلِ مِنْكُمْ وَالسَّعَةِ أَنْ يُؤْتُوا أُولِي الْقُرْبَى‏}‏ الآيَةَ‏.‏ قَالَ أَبُو بَكْرٍ بَلَى وَاللَّهِ إِنِّي لأُحِبُّ أَنْ يَغْفِرَ اللَّهُ لِي‏.‏ فَرَجَعَ إِلَى مِسْطَحٍ النَّفَقَةَ الَّتِي كَانَ يُنْفِقُ عَلَيْهِ وَقَالَ وَاللَّهِ لاَ أَنْزِعُهَا عَنْهُ أَبَدًا‏.‏"
      },
      {
        "id": 6412,
        "hadith_number": "6680",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Sumpah Nabi Muhammad SAW dan Kifarahnya",
        "perawi_melayu": "Diriwayatkan oleh Abu Musa Al-Ash`ari رضی اللہ عنہ :",
        "english_text": "I went along with some men from the Ash-ariyin to Allah's Messenger (ﷺ) and it happened that I met him while he was in an angry mood. We asked him to provide us with mounts, but he swore that he would not give us any. Later on he said, \"By Allah, Allah willing, if ever I take an oath (to do something) and later on I find something else better than the first, then I do the better one and give expiation for the dissolution of my oath.\"",
        "malay_translation": "Aku pergi bersama beberapa orang dari kalangan kaum Ash'ariyin kepada Rasulullah SAW dan aku bertemu dengan Baginda dalam keadaan marah. Kami meminta Baginda untuk menyediakan tunggangan untuk kami, tetapi Baginda bersumpah tidak akan memberikan kami sebarang tunggangan. Kemudian Baginda bersabda, \"Demi Allah, insya-Allah, jika aku bersumpah (untuk melakukan sesuatu) dan kemudian aku mendapati sesuatu yang lebih baik daripada yang pertama, maka aku akan melakukan yang lebih baik itu dan membayar kifarah kerana membatalkan sumpahku.\"",
        "arabic_text": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ، عَنِ الْقَاسِمِ، عَنْ زَهْدَمٍ، قَالَ كُنَّا عِنْدَ أَبِي مُوسَى الأَشْعَرِيِّ قَالَ أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي نَفَرٍ مِنَ الأَشْعَرِيِّينَ، فَوَافَقْتُهُ وَهْوَ غَضْبَانُ فَاسْتَحْمَلْنَاهُ، فَحَلَفَ أَنْ لاَ يَحْمِلَنَا ثُمَّ قَالَ ‏ \"‏ وَاللَّهِ إِنْ شَاءَ اللَّهُ لاَ أَحْلِفُ عَلَى يَمِينٍ فَأَرَى غَيْرَهَا خَيْرًا مِنْهَا، إِلاَّ أَتَيْتُ الَّذِي هُوَ خَيْرٌ وَتَحَلَّلْتُهَا ‏\"‏‏.‏"
      },
      {
        "id": 6413,
        "hadith_number": "6681",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Permintaan Rasulullah ﷺ kepada Abu Talib Menjelang Kematiannya",
        "perawi_melayu": "Diriwayatkan daripada Al-Musaiyab رضى الله عنه :",
        "english_text": "When the death of Abu Talib approached, Allah's Messenger (ﷺ) came to him and said, \"Say: La ilaha illallah, a word with which I will be able to defend you before Allah.\"",
        "malay_translation": "Ketika kematian Abu Talib hampir tiba, Rasulullah ﷺ datang kepadanya dan bersabda, \"Ucapkan: La ilaha illallah, satu kalimah yang dengannya aku akan dapat membela kamu di hadapan Allah.\"",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، عَنْ أَبِيهِ، قَالَ لَمَّا حَضَرَتْ أَبَا طَالِبٍ الْوَفَاةُ جَاءَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ قُلْ لاَ إِلَهَ إِلاَّ اللَّهُ كَلِمَةً‏.‏ أُحَاجُّ لَكَ بِهَا عِنْدَ اللَّهِ ‏\"‏‏.‏"
      },
      {
        "id": 6414,
        "hadith_number": "6682",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Dua Kalimah Ringan di Lidah, Berat di Neraca",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضي اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) said, \"(The following are) two words (sentences or utterances) that are very easy for the tongue to say, and very heavy in the balance (of reward), and most beloved to the Gracious Almighty (And they are): Subhan Allahi wa bi-hamdihi; Subhan Allahi-l-'Adhim,\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"(Berikut adalah) dua kalimah (ayat atau ucapan) yang sangat ringan diucapkan oleh lidah, sangat berat dalam neraca (pahala), dan paling disukai oleh Allah Yang Maha Pemurah (dan ia adalah): Subhan Allahi wa bi-hamdihi; Subhan Allahi-l-'Adhim,\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، حَدَّثَنَا عُمَارَةُ بْنُ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كَلِمَتَانِ خَفِيفَتَانِ عَلَى اللِّسَانِ، ثَقِيلَتَانِ فِي الْمِيزَانِ، حَبِيبَتَانِ إِلَى الرَّحْمَنِ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ، سُبْحَانَ اللَّهِ الْعَظِيمِ ‏\"‏‏.‏"
      },
      {
        "id": 6415,
        "hadith_number": "6683",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Balasan Bagi Mereka yang Menyembah Selain Allah dan Mereka yang Tidak Menyembah",
        "perawi_melayu": "Diriwayatkan oleh 'Abdullah رضی اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) said a sentence and I said another. He said, \"Whoever dies while he is setting up rivals along with Allah (i.e. worshipping others along with Allah) shall be admitted into the (Hell) Fire.\" And I said the other: \"Whoever dies while he is not setting up rivals along with Allah (i.e. worshipping none except Allah) shall be admitted into Paradise.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda suatu kalimat dan aku pula berkata kalimat yang lain. Baginda bersabda, \"Sesiapa yang mati dalam keadaan menyekutukan Allah (iaitu menyembah selain Allah), maka dia akan dimasukkan ke dalam (Neraka) Api.\" Dan aku pula berkata: \"Sesiapa yang mati dalam keadaan tidak menyekutukan Allah (iaitu tidak menyembah selain Allah), maka dia akan dimasukkan ke dalam Syurga.\"",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الأَعْمَشُ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم كَلِمَةً وَقُلْتُ أُخْرَى ‏ \"‏ مَنْ مَاتَ يَجْعَلُ لِلَّهِ نِدًّا أُدْخِلَ النَّارَ ‏\"‏‏.‏ وَقُلْتُ أُخْرَى مَنْ مَاتَ لاَ يَجْعَلُ لِلَّهِ نِدًّا أُدْخِلَ الْجَنَّةَ‏.‏"
      },
      {
        "id": 6416,
        "hadith_number": "6684",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Sumpah Nabi (ﷺ) untuk Menjauhi Isterinya dan Penjelasan Bulan Qamari",
        "perawi_melayu": "Diriwayatkan oleh Anas رضی اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) took an oath for abstention from his wives (for one month), and during those days he had a sprain in his foot. He stayed in a Mashrubah (an upper room) for twenty-nine nights and then came down. Then the people said, \"O Allah's Messenger (ﷺ)! You took an oath for abstention (from your wives) for one month.\" On that he said, \"A (lunar) month can be of twenty-nine days.\"",
        "malay_translation": "Rasulullah (ﷺ) bersumpah untuk menjauhi isteri-isterinya (selama sebulan), dan pada masa itu baginda mengalami terseliuh di kakinya. Baginda tinggal di Mashrubah (bilik atas) selama dua puluh sembilan malam kemudian turun. Kemudian orang ramai berkata, \"Wahai Rasulullah (ﷺ)! Tuan bersumpah untuk menjauhi (isteri-isteri Tuan) selama sebulan.\" Baginda menjawab, \"Sebulan (qamari) boleh jadi dua puluh sembilan hari.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ آلَى رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ نِسَائِهِ، وَكَانَتِ انْفَكَّتْ رِجْلُهُ، فَأَقَامَ فِي مَشْرُبَةٍ تِسْعًا وَعِشْرِينَ لَيْلَةً، ثُمَّ نَزَلَ فَقَالُوا يَا رَسُولَ اللَّهِ آلَيْتَ شَهْرًا‏.‏ فَقَالَ ‏{‏إِنَّ الشَّهْرَ يَكُونُ تِسْعًا وَعِشْرِينَ‏}‏"
      },
      {
        "id": 6417,
        "hadith_number": "6685",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perkahwinan Abu Usaid dan Jamuan Nabi (SAW)",
        "perawi_melayu": "Diriwayatkan oleh Sahl bin Sa`d رضی اللہ عنہ :",
        "english_text": "\"Abu Usaid, رضی اللہ عنہ the companion of the Prophet, got married, so he invited the Prophet (ﷺ) to his wedding party, and the bride herself served them. Sahl رضی اللہ عنہ said to the People, 'Do you know what drink she served him with? She infused some dates in a pot at night and the next morning she served him with the infusion.\"",
        "malay_translation": "\"Abu Usaid, رضی اللہ عنہ, sahabat Nabi, berkahwin. Beliau kemudian menjemput Nabi (ﷺ) ke majlis perkahwinannya, dan pengantin perempuan sendiri melayan mereka. Sahl رضی اللہ عنہ berkata kepada orang ramai, 'Tahukah kamu minuman apa yang dihidangkannya kepada baginda? Beliau merendam beberapa biji kurma di dalam periuk pada waktu malam dan keesokan paginya, beliau menghidangkan air rendaman itu kepada baginda.\"",
        "arabic_text": "حَدَّثَنِي عَلِيٌّ، سَمِعَ عَبْدَ الْعَزِيزِ بْنَ أَبِي حَازِمٍ، أَخْبَرَنِي أَبِي، عَنْ سَهْلِ بْنِ سَعْدٍ، أَنَّ أَبَا أُسَيْدٍ، صَاحِبَ النَّبِيِّ صلى الله عليه وسلم أَعْرَسَ فَدَعَا النَّبِيَّ صلى الله عليه وسلم لِعُرْسِهِ، فَكَانَتِ الْعَرُوسُ خَادِمَهُمْ‏.‏ فَقَالَ سَهْلٌ لِلْقَوْمِ هَلْ تَدْرُونَ مَا سَقَتْهُ قَالَ أَنْقَعَتْ لَهُ تَمْرًا فِي تَوْرٍ مِنَ اللَّيْلِ، حَتَّى أَصْبَحَ عَلَيْهِ فَسَقَتْهُ إِيَّاهُ‏.‏"
      },
      {
        "id": 6418,
        "hadith_number": "6686",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Penggunaan Kulit Kambing yang Telah Disamak",
        "perawi_melayu": "Diriwayatkan oleh Sauda (isteri Nabi) رضی اللہ عنہا :",
        "english_text": "One of our sheep died and we tanned its skin and kept on infusing dates in it till it was a worn out water skin.",
        "malay_translation": "Seekor daripada kambing kami mati, lalu kami menyamak kulitnya dan terus merendamkan kurma di dalamnya sehingga ia menjadi bekas air yang usang.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، عَنِ الشَّعْبِيِّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنْ سَوْدَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ مَاتَتْ لَنَا شَاةٌ فَدَبَغْنَا مَسْكَهَا ثُمَّ مَا زِلْنَا نَنْبِذُ فِيهِ حَتَّى صَارَتْ شَنًّا‏.‏"
      },
      {
        "id": 6419,
        "hadith_number": "6687",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keluarga Nabi Muhammad (SAW) Tidak Pernah Makan Roti Gandum dengan Daging Berturut-turut",
        "perawi_melayu": "Diriwayatkan oleh 'Aishah رضی اللہ عنہا",
        "english_text": "The family of (the Prophet) Muhammad never ate wheat-bread with meat for three consecutive days to their fill, till he met Allah. His Hadrat Abdur Rehman father Hadrat Aabis رضی اللہ عنہ said to Hadrat Aishah  رضی اللہ عنہا the same.",
        "malay_translation": "Keluarga Nabi Muhammad ﷺ tidak pernah makan roti gandum bersama daging sehingga kenyang selama tiga hari berturut-turut, sehinggalah baginda bertemu Allah. Hadrat Abdur Rehman, ayah Hadrat Aabis رضی اللہ عنہ berkata kepada Hadrat Aishah رضی اللہ عنہا, perkara yang sama.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا شَبِعَ آلُ مُحَمَّدٍ صلى الله عليه وسلم مِنْ خُبْزِ بُرٍّ مَأْدُومٍ ثَلاَثَةَ أَيَّامٍ حَتَّى لَحِقَ بِاللَّهِ‏.‏ وَقَالَ ابْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ أَبِيهِ، أَنَّهُ قَالَ لِعَائِشَةَ بِهَذَا‏.‏"
      },
      {
        "id": 6420,
        "hadith_number": "6688",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Keajaiban Makanan: Rasulullah SAW dan Para Sahabat yang Lapar",
        "perawi_melayu": "Diriwayatkan daripada Anas bin Malik رضي الله عنه :",
        "english_text": "Abu Talha رضی اللہ عنہ said to Um Sulaim رضی اللہ عنہا , \"I heard the voice of Allah's Messenger (ﷺ) rather weak, and I knew that it was because of hunger. Have you anything (to present to the Prophet)?\" She said, \"Yes.\" Then she took out a few loaves of barley bread and took a veil of hers and wrapped the bread with a part of it and sent me to Allah's Messenger (ﷺ). I went and found Allah's Messenger (ﷺ) sitting in the mosque with some people. I stood up before him. Allah's Messenger (ﷺ) said to me, \"Has Abu Talha  رضی اللہ عنہا sent you?\" I said, ' Yes. Then Allah's Messenger (ﷺ) said to those who were with him. \"Get up and proceed.\" I went ahead of them (as their forerunner) and came to Abu Talha and informed him about it. Abu Talha رضی اللہ عنہا said, \"O Um Sulaim! Allah's Messenger (ﷺ) has come and we have no food to feed them.\" Um Sulaim رضی اللہ عنہا said, \"Allah and His Apostle know best.\" So Abu Talha went out (to receive them) till he met Allah's Messenger (ﷺ). Allah's Messenger (ﷺ) came in company with Abu Talha and they entered the house. Allah's Messenger (ﷺ) said, \"O Um Sulaim! Bring whatever you have.\" So she brought that (barley) bread and Allah's Messenger (ﷺ) ordered that bread to be broken into small pieces, and then Um Sulaim poured over it some butter from a leather butter container, and then Allah's Messenger (ﷺ) said what Allah wanted him to say, (i.e. blessing the food). Allah's Messenger (ﷺ) then said, \"Admit ten men.\" Abu Talha رضی اللہ عنہا admitted them and they ate to their fill and went out. He again said, \"Admit ten men.\" He admitted them, and in this way all the people ate to their fill, and they were seventy or eighty men.",
        "malay_translation": "Abu Talha رضي الله عنه berkata kepada Um Sulaim رضي الله عنها, \"Aku mendengar suara Rasulullah SAW agak lemah, dan aku tahu ia disebabkan oleh kelaparan. Adakah kamu mempunyai apa-apa (untuk dipersembahkan kepada Nabi)?\" Dia berkata, \"Ya.\" Kemudian dia mengeluarkan beberapa roti barli dan mengambil sehelai kain tudungnya dan membungkus roti itu dengan sebahagian daripadanya dan menghantarku kepada Rasulullah SAW. Aku pergi dan mendapati Rasulullah SAW sedang duduk di masjid bersama beberapa orang. Aku berdiri di hadapannya. Rasulullah SAW berkata kepadaku, \"Adakah Abu Talha رضي الله عنه menghantarmu?\" Aku berkata, 'Ya.' Kemudian Rasulullah SAW berkata kepada mereka yang bersamanya, \"Bangun dan pergilah.\" Aku pergi ke hadapan mereka (sebagai pelopor mereka) dan datang kepada Abu Talha dan memaklumkan kepadanya tentang hal itu. Abu Talha رضي الله عنه berkata, \"Wahai Um Sulaim! Rasulullah SAW telah datang dan kita tidak mempunyai makanan untuk memberi mereka makan.\" Um Sulaim رضي الله عنها berkata, \"Allah dan Rasul-Nya lebih mengetahui.\" Maka Abu Talha keluar (untuk menyambut mereka) sehingga dia bertemu Rasulullah SAW. Rasulullah SAW datang bersama Abu Talha dan mereka memasuki rumah. Rasulullah SAW berkata, \"Wahai Um Sulaim! Bawalah apa sahaja yang kamu ada.\" Jadi dia membawa roti (barli) itu dan Rasulullah SAW memerintahkan roti itu dipotong kecil-kecil, dan kemudian Um Sulaim menuangkan sedikit mentega dari bekas mentega kulit, dan kemudian Rasulullah SAW berkata apa yang Allah mahu dia katakan, (iaitu memberkati makanan). Rasulullah SAW kemudian berkata, \"Masukkan sepuluh orang.\" Abu Talha رضي الله عنه memasukkan mereka dan mereka makan sehingga kenyang dan keluar. Dia berkata lagi, \"Masukkan sepuluh orang.\" Dia memasukkan mereka, dan dengan cara ini semua orang makan sehingga kenyang, dan mereka adalah tujuh puluh atau lapan puluh orang.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، قَالَ قَالَ أَبُو طَلْحَةَ لأُمِّ سُلَيْمٍ لَقَدْ سَمِعْتُ صَوْتَ، رَسُولِ اللَّهِ صلى الله عليه وسلم ضَعِيفًا أَعْرِفُ فِيهِ الْجُوعَ، فَهَلْ عِنْدَكِ مِنْ شَىْءٍ فَقَالَتْ نَعَمْ‏.‏ فَأَخْرَجَتْ أَقْرَاصًا مِنْ شَعِيرٍ، ثُمَّ أَخَذَتْ خِمَارًا لَهَا، فَلَفَّتِ الْخُبْزَ بِبَعْضِهِ، ثُمَّ أَرْسَلَتْنِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَهَبْتُ فَوَجَدْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي الْمَسْجِدِ وَمَعَهُ النَّاسُ، فَقُمْتُ عَلَيْهِمْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَرْسَلَكَ أَبُو طَلْحَةَ ‏\"‏‏.‏ فَقُلْتُ نَعَمْ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِمَنْ مَعَهُ ‏\"‏ قُومُوا ‏\"‏‏.‏ فَانْطَلَقُوا، وَانْطَلَقْتُ بَيْنَ أَيْدِيهِمْ حَتَّى جِئْتُ أَبَا طَلْحَةَ فَأَخْبَرْتُهُ‏.‏ فَقَالَ أَبُو طَلْحَةَ يَا أُمَّ سُلَيْمٍ قَدْ جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَلَيْسَ عِنْدَنَا مِنَ الطَّعَامِ مَا نُطْعِمُهُمْ‏.‏ فَقَالَتِ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ فَانْطَلَقَ أَبُو طَلْحَةَ حَتَّى لَقِيَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَقْبَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو طَلْحَةَ حَتَّى دَخَلاَ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلُمِّي يَا أُمَّ سُلَيْمٍ مَا عِنْدَكِ ‏\"‏‏.‏ فَأَتَتْ بِذَلِكَ الْخُبْزِ ـ قَالَ ـ فَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِذَلِكَ الْخُبْزِ فَفُتَّ، وَعَصَرَتْ أُمُّ سُلَيْمٍ عُكَّةً لَهَا فَأَدَمَتْهُ، ثُمَّ قَالَ فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم مَا شَاءَ اللَّهُ أَنْ يَقُولَ، ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ ‏\"‏‏.‏ فَأَذِنَ لَهُمْ فَأَكَلُوا حَتَّى شَبِعُوا، ثُمَّ خَرَجُوا، ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ ‏\"‏‏.‏ فَأَذِنَ لَهُمْ، فَأَكَلَ الْقَوْمُ كُلُّهُمْ وَشَبِعُوا، وَالْقَوْمُ سَبْعُونَ أَوْ ثَمَانُونَ رَجُلاً‏.‏"
      },
      {
        "id": 6421,
        "hadith_number": "6689",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Niat Menentukan Ganjaran Amalan",
        "perawi_melayu": "Diriwayatkan daripada 'Umar bin Al-Khattab رضی اللہ عنہ :",
        "english_text": "I heard Allah's Messenger (ﷺ) saying, \"The (reward of) deeds, depend upon the intentions and every person will get the reward according to what he has intended. So whoever emigrated for the sake of Allah and His Apostle, then his emigration will be considered to be for Allah and His Apostle, and whoever emigrated for the sake of worldly gain or for a woman to marry, then his emigration will be considered to be for what he emigrated for.\"",
        "malay_translation": "Saya mendengar Rasulullah (ﷺ) bersabda, \"Sesungguhnya (ganjaran) amalan itu bergantung pada niat, dan setiap orang akan mendapat ganjaran sesuai dengan apa yang diniatkannya. Maka sesiapa yang berhijrah kerana Allah dan Rasul-Nya, maka hijrahnya akan dianggap kerana Allah dan Rasul-Nya. Dan sesiapa yang berhijrah kerana (mencari) keuntungan duniawi atau kerana (ingin mengahwini) seorang wanita, maka hijrahnya akan dianggap kerana apa yang dia berhijrah kerana-Nya.\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، يَقُولُ أَخْبَرَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ، أَنَّهُ سَمِعَ عَلْقَمَةَ بْنَ وَقَّاصٍ اللَّيْثِيَّ، يَقُولُ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنَّمَا الأَعْمَالُ بِالنِّيَّةِ، وَإِنَّمَا لاِمْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ، وَمَنْ كَانَتْ هِجْرَتُهُ إِلَى دُنْيَا يُصِيبُهَا أَوِ امْرَأَةٍ يَتَزَوَّجُهَا، فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ ‏\"‏‏.‏"
      },
      {
        "id": 6422,
        "hadith_number": "6690",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Taubat Ka'b bin Malik dan Saranan Rasulullah ﷺ",
        "perawi_melayu": "Diriwayatkan oleh Ka`b bin Malik:",
        "english_text": "Hadrat Kab's sons would lead his father when he turned blind told him that Hadrat Ka'b bin Maalik told him of the story about which Allah has said: ''The three who were left behind'' . At the end of the story, he said: As an act of gratitude at the acceptance of my repentance, I give all my property in Allah's and His Apostle's ﷺ way as alms and thus dissociate myself from it. The prophet , thereupon, said: Keep some of your property with you as it is better for you.",
        "malay_translation": "Anak-anak Hadrat Kab akan memimpin bapanya ketika dia menjadi buta, menceritakan kepadanya bahawa Hadrat Ka'b bin Maalik menceritakan kisah tentangnya Allah telah berfirman: ''Tiga orang yang ditinggalkan''. Pada akhir cerita, dia berkata: Sebagai tanda syukur atas diterimanya taubatku, aku sedekahkan seluruh hartaku di jalan Allah dan Rasul-Nya ﷺ dan dengan demikian melepaskan diri daripadanya. Nabi ﷺ kemudiannya bersabda: Simpanlah sebahagian daripada hartamu, kerana itu lebih baik bagimu.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عَبْدُ الرَّحْمَنِ، عَنْ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ، وَكَانَ، قَائِدَ كَعْبٍ مِنْ بَنِيهِ حِينَ عَمِيَ ـ قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ، فِي حَدِيثِهِ ‏{‏َعَلَى الثَّلاَثَةِ الَّذِينَ خُلِّفُوا‏}‏ َقَالَ فِي آخِرِ حَدِيثِهِ إِنَّ مِنْ تَوْبَتِي أَنِّي أَنْخَلِعُ مِنْ مَالِي صَدَقَةً إِلَى اللَّهِ وَرَسُولِهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَمْسِكْ عَلَيْكَ بَعْضَ مَالِكَ فَهْوَ خَيْرٌ لَكَ ‏\"‏‏.‏"
      },
      {
        "id": 6423,
        "hadith_number": "6691",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Madu dan Ayat Surah At-Tahrim",
        "perawi_melayu": "Diriwayatkan daripada 'Aishah رضی اللہ عنہا :",
        "english_text": "The Prophet (ﷺ) used to stay (for a period) in the house of Zainab bint Jahsh رضی اللہ عنہا (one of the wives of the Prophet ) and he used to drink honey in her house. Hafsa رضی اللہ عنہا and I decided that when the Prophet (ﷺ) entered upon either of us, she would say, \"I smell in you the bad smell of Maghafir (a bad smelling raisin). Have you eaten Maghafir?\" When he entered upon one of us, she said that to him. He replied (to her), \"No, but I have drunk honey in the house of Zainab bint Jahsh, and I will never drink it again.\" Then the following verse was revealed: 'O Prophet ! Why do you ban (for you) that which Allah has made lawful for you?. ..(up to) If you two (wives of the Prophet (ﷺ) turn in repentance to Allah.' (66.1-4) The two were `Aisha and Hafsa رضی اللہ عنہا And also the Statement of Allah: 'And (Remember) when the Prophet (ﷺ) disclosed a matter in confidence to one of his wives!' (66.3) i.e., his saying, \"But I have drunk honey.\" Hisham said: It also meant his saying, \"I will not drink anymore, and I have taken an oath, so do not inform anybody of that.\"",
        "malay_translation": "Rasulullah (ﷺ) pernah tinggal (untuk suatu tempoh) di rumah Zainab binti Jahsh رضی اللہ عنہا (salah seorang isteri Nabi) dan baginda minum madu di rumahnya. Hafsah رضی اللہ عنہا dan saya memutuskan bahawa apabila Rasulullah (ﷺ) masuk menemui salah seorang daripada kami, dia akan berkata, \"Saya terhidu bau yang tidak menyenangkan daripada Maghafir (sejenis kismis yang berbau busuk). Adakah kamu memakan Maghafir?\" Apabila baginda masuk menemui salah seorang daripada kami, dia berkata demikian kepada baginda. Baginda menjawab, \"Tidak, tetapi aku telah minum madu di rumah Zainab binti Jahsh, dan aku tidak akan meminumnya lagi.\" Kemudian ayat berikut diturunkan: 'Wahai Nabi! Mengapa engkau mengharamkan (bagi dirimu) apa yang Allah halalkan bagimu?. ..(sehingga) Jika kamu berdua (isteri Nabi (ﷺ) bertaubat kepada Allah.' (66:1-4) Kedua-duanya ialah 'Aishah dan Hafsah رضی اللہ عنہا. Dan juga Firman Allah: 'Dan (Ingatlah) ketika Nabi (ﷺ) membocorkan rahsia kepada salah seorang daripada isterinya!' (66:3) iaitu, sabda baginda, \"Tetapi aku telah minum madu.\" Hisyam berkata: Ia juga bermaksud sabdanya, \"Aku tidak akan minum lagi, dan aku telah bersumpah, jadi jangan beritahu sesiapa pun tentang itu.\"",
        "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدٍ، حَدَّثَنَا الْحَجَّاجُ، عَنِ ابْنِ جُرَيْجٍ، قَالَ زَعَمَ عَطَاءٌ أَنَّهُ سَمِعَ عُبَيْدَ بْنَ عُمَيْرٍ، يَقُولُ سَمِعْتُ عَائِشَةَ، تَزْعُمُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَمْكُثُ عِنْدَ زَيْنَبَ بِنْتِ جَحْشٍ، وَيَشْرَبُ عِنْدَهَا عَسَلاً، فَتَوَاصَيْتُ أَنَا وَحَفْصَةُ أَنَّ أَيَّتَنَا دَخَلَ عَلَيْهَا النَّبِيُّ صلى الله عليه وسلم فَلْتَقُلْ إِنِّي أَجِدُ مِنْكَ رِيحَ مَغَافِيرَ، أَكَلْتَ مَغَافِيرَ فَدَخَلَ عَلَى إِحْدَاهُمَا فَقَالَتْ ذَلِكَ لَهُ‏.‏ فَقَالَ ‏\"‏ لاَ بَلْ شَرِبْتُ عَسَلاً عِنْدَ زَيْنَبَ بِنْتِ جَحْشٍ، وَلَنْ أَعُودَ لَهُ ‏\"‏‏.‏ فَنَزَلَتْ ‏{‏يَا أَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَا أَحَلَّ اللَّهُ لَكَ‏}‏، ‏{‏إِنْ تَتُوبَا إِلَى اللَّهِ‏}‏، لِعَائِشَةَ وَحَفْصَةَ، ‏{‏وَإِذْ أَسَرَّ النَّبِيُّ إِلَى بَعْضِ أَزْوَاجِهِ حَدِيثًا‏}‏ لِقَوْلِهِ ‏\"‏ بَلْ شَرِبْتُ عَسَلاً ‏\"‏‏.‏ وَقَالَ لِي إِبْرَاهِيمُ بْنُ مُوسَى عَنْ هِشَامٍ، ‏\"‏ وَلَنْ أَعُودَ لَهُ، وَقَدْ حَلَفْتُ، فَلاَ تُخْبِرِي بِذَلِكَ أَحَدًا ‏\"‏‏.‏"
      },
      {
        "id": 6424,
        "hadith_number": "6692",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Sumpah Tidak Mempercepatkan atau Melambatkan Sesuatu",
        "perawi_melayu": "Diriwayatkan oleh Ibnu `Umar رضی اللہ عنہما :",
        "english_text": "\"Weren't people forbidden to make vows?\" The Prophet (ﷺ) said, 'A vow neither hastens nor delays anything, but by the making of vows, some of the wealth of a miser is taken out.\"",
        "malay_translation": "\"Bukankah orang dilarang membuat nazar?\" Nabi (ﷺ) bersabda, 'Nazar itu tidak mempercepatkan atau melambatkan sesuatu, tetapi dengan membuat nazar, sebahagian daripada harta orang yang bakhil diambil.\"",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ صَالِحٍ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، حَدَّثَنَا سَعِيدُ بْنُ الْحَارِثِ، أَنَّهُ سَمِعَ ابْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ أَوَلَمْ يُنْهَوْا عَنِ النَّذْرِ إِنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ النَّذْرَ لاَ يُقَدِّمُ شَيْئًا، وَلاَ يُؤَخِّرُ، وَإِنَّمَا يُسْتَخْرَجُ بِالنَّذْرِ مِنَ الْبَخِيلِ ‏\"‏‏.‏"
      },
      {
        "id": 6425,
        "hadith_number": "6693",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi SAW Melarang Membuat Nazar",
        "perawi_melayu": "Diriwayatkan oleh Abdullah bin Umar رضي الله عنهما :",
        "english_text": "The Prophet (ﷺ) forbade the making of vows and said, \"It (a vow) does not prevent anything (that has to take place), but the property of a miser is spent (taken out) with it.\"",
        "malay_translation": "Nabi SAW melarang membuat nazar dan bersabda, \"Sesungguhnya (nazar) itu tidak menghalang sesuatu (yang telah ditetapkan), tetapi harta orang yang kedekut akan dibelanjakan (dikeluarkan) dengannya.\"",
        "arabic_text": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُرَّةَ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، نَهَى النَّبِيُّ صلى الله عليه وسلم عَنِ النَّذْرِ وَقَالَ ‏ \"‏ إِنَّهُ لاَ يَرُدُّ شَيْئًا، وَلَكِنَّهُ يُسْتَخْرَجُ بِهِ مِنَ الْبَخِيلِ ‏\"‏‏.‏"
      },
      {
        "id": 6426,
        "hadith_number": "6694",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ketetapan Takdir dan Pengaruh Nazar",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah رضي اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) said, \"Allah says, 'The vow, does not bring about for the son of Adam anything I have not decreed for him, but his vow may coincide with what has been decided for him, and by this way I cause a miser to spend of his wealth. So he gives Me (spends in charity) for the fulfillment of what has been decreed for him what he would not give Me before but for his vow.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Allah berfirman, 'Nazar itu tidak membawa kepada anak Adam apa-apa yang tidak Aku tetapkan baginya, tetapi nazarnya itu mungkin bertepatan dengan apa yang telah ditetapkan baginya, dan dengan cara ini Aku menyebabkan orang yang bakhil membelanjakan hartanya. Maka dia memberi Aku (membelanjakan dalam sedekah) untuk memenuhi apa yang telah ditetapkan baginya apa yang tidak akan dia berikan kepada Aku sebelum ini melainkan kerana nazarnya.\"",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ يَأْتِي ابْنَ آدَمَ النَّذْرُ بِشَىْءٍ لَمْ يَكُنْ قُدِّرَ لَهُ، وَلَكِنْ يُلْقِيهِ النَّذْرُ إِلَى الْقَدَرِ قَدْ قُدِّرَ لَهُ، فَيَسْتَخْرِجُ اللَّهُ بِهِ مِنَ الْبَخِيلِ، فَيُؤْتِي عَلَيْهِ مَا لَمْ يَكُنْ يُؤْتِي عَلَيْهِ مِنْ قَبْلُ ‏\"‏‏.‏"
      },
      {
        "id": 6427,
        "hadith_number": "6695",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Generasi Terbaik dan Ciri-ciri Generasi Akhir Zaman",
        "perawi_melayu": "Diriwayatkan oleh Zahdam bin Mudarrab:",
        "english_text": "`Imran bin Hussain said, \"The Prophet (ﷺ) said, 'The best of you (people) are my generation, and the second best will be those who will follow them, and then those who will follow the second generation.\" `Imran added, \"I do not remember whether he mentioned two or three (generations) after his generation. He added, 'Then will come some people who will make vows but will not fulfill them; and they will be dishonest and will not be trustworthy, and they will give their witness without being asked to give their witness, and fatness will appear among them.' \"",
        "malay_translation": "`Imran bin Hussain berkata, \"Rasulullah (ﷺ) bersabda, 'Sebaik-baik kamu (manusia) adalah generasiku, kemudian yang kedua adalah mereka yang mengikuti mereka, dan kemudian mereka yang mengikuti generasi kedua.' `Imran menambah, \"Aku tidak ingat sama ada baginda menyebut dua atau tiga (generasi) selepas generasinya. Baginda menambah, 'Kemudian akan datang beberapa orang yang membuat sumpah tetapi tidak menunaikannya; dan mereka akan tidak jujur dan tidak boleh dipercayai, dan mereka akan memberi kesaksian mereka tanpa diminta untuk memberi kesaksian, dan kegemukan akan muncul di kalangan mereka.'\"",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، عَنْ يَحْيَى، عَنْ شُعْبَةَ، قَالَ حَدَّثَنِي أَبُو جَمْرَةَ، حَدَّثَنَا زَهْدَمُ بْنُ مُضَرِّبٍ، قَالَ سَمِعْتُ عِمْرَانَ بْنَ حُصَيْنٍ، يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ خَيْرُكُمْ قَرْنِي، ثُمَّ الَّذِينَ يَلُونَهُمْ، ثُمَّ الَّذِينَ يَلُونَهُمْ ـ قَالَ عِمْرَانُ لاَ أَدْرِي ذَكَرَ ثِنْتَيْنِ أَوْ ثَلاَثًا بَعْدَ قَرْنِهِ ـ ثُمَّ يَجِيءُ قَوْمٌ يَنْذُرُونَ وَلاَ يَفُونَ، وَيَخُونُونَ وَلاَ يُؤْتَمَنُونَ، وَيَشْهَدُونَ وَلاَ يُسْتَشْهَدُونَ، وَيَظْهَرُ فِيهِمُ السِّمَنُ ‏\"‏‏.‏"
      },
      {
        "id": 6428,
        "hadith_number": "6696",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kewajipan Menunaikan Janji Taat kepada Allah",
        "perawi_melayu": "Diriwayatkan daripada `Aisha رضی اللہ عنہا :",
        "english_text": "The Prophet (ﷺ) said, \"Whoever vows that he will be obedient to Allah, should remain obedient to Him; and whoever made a vow that he will disobey Allah, should not disobey Him.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Sesiapa yang bernazar untuk taat kepada Allah, hendaklah dia terus taat kepada-Nya; dan sesiapa yang bernazar untuk menderhakai Allah, janganlah dia menderhakai-Nya.\"",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مَالِكٌ، عَنْ طَلْحَةَ بْنِ عَبْدِ الْمَلِكِ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ نَذَرَ أَنْ يُطِيعَ اللَّهَ فَلْيُطِعْهُ، وَمَنْ نَذَرَ أَنْ يَعْصِيَهُ فَلاَ يَعْصِهِ ‏\"‏‏.‏"
      },
      {
        "id": 6429,
        "hadith_number": "6697",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menunaikan Nazar I'tikaf di Masjidil Haram",
        "perawi_melayu": "Diriwayatkan oleh Ibnu Umar رضي اللہ عنهما :",
        "english_text": "`Umar رضی اللہ عنہ said \"O Allah's Messenger (ﷺ)! I vowed to perform I`tikaf for one night in Al-Masjid-al-Haram, during the Pre-Islamic Period of ignorance (before embracing Islam). \"The Prophet (ﷺ) said, \"Fulfill your vow.\"",
        "malay_translation": "Umar رضی اللہ عنہ berkata, \"Wahai Rasulullah (ﷺ)! Saya bernazar untuk beri'tikaf selama satu malam di Al-Masjid-al-Haram, pada zaman Jahiliah (sebelum memeluk Islam).\" Nabi (ﷺ) bersabda, \"Tunaikanlah nazarmu.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عُمَرَ، قَالَ يَا رَسُولَ اللَّهِ إِنِّي نَذَرْتُ فِي الْجَاهِلِيَّةِ أَنْ أَعْتَكِفَ لَيْلَةً فِي الْمَسْجِدِ الْحَرَامِ‏.‏ قَالَ ‏ \"‏ أَوْفِ بِنَذْرِكَ ‏\"‏‏.‏"
      },
      {
        "id": 6430,
        "hadith_number": "6698",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menunaikan Nazar Ibu yang Meninggal Dunia",
        "perawi_melayu": "Diriwayatkan oleh Sa`d bin 'Ubada Al-Ansari رضی اللہ عنہ :",
        "english_text": "He consulted the Prophet (ﷺ) about a vow that had been made by his mother who died without fulfilling it. The Prophet (ﷺ) gave his verdict that he should fulfill it on her behalf. The verdict became Sunna (i.e. the Prophet's tradition).",
        "malay_translation": "Beliau merujuk kepada Nabi (ﷺ) tentang nazar yang telah dibuat oleh ibunya yang meninggal dunia tanpa melaksanakannya. Nabi (ﷺ) memberi keputusan bahawa dia harus melaksanakannya bagi pihaknya. Keputusan itu menjadi Sunnah (iaitu tradisi Nabi).",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّ سَعْدَ بْنَ عُبَادَةَ الأَنْصَارِيَّ اسْتَفْتَى النَّبِيَّ صلى الله عليه وسلم فِي نَذْرٍ كَانَ عَلَى أُمِّهِ، فَتُوُفِّيَتْ قَبْلَ أَنْ تَقْضِيَهُ‏.‏ فَأَفْتَاهُ أَنْ يَقْضِيَهُ عَنْهَا، فَكَانَتْ سُنَّةً بَعْدُ‏.‏"
      },
      {
        "id": 6431,
        "hadith_number": "6699",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menunaikan Haji bagi Puan yang Meninggal Dunia",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Abbas رضی اللہ عنہما :",
        "english_text": "A man came to the Prophet (ﷺ) and said to him, \"My sister vowed to perform the Hajj, but she died (before fulfilling it).\" The Prophet (ﷺ) said, \"Would you not have paid her debts if she had any?\" The man said, \"Yes.\" The Prophet (ﷺ) said, \"So pay Allah's Rights, as He is more entitled to receive His rights.\"",
        "malay_translation": "Seorang lelaki datang kepada Nabi (ﷺ) dan berkata kepada baginda, \"Kakak saya bernazar untuk menunaikan haji, tetapi dia meninggal dunia (sebelum menunaikannya).\" Nabi (ﷺ) bersabda, \"Tidakkah kamu akan membayar hutangnya jika dia mempunyai hutang?\" Lelaki itu berkata, \"Ya.\" Nabi (ﷺ) bersabda, \"Maka tunaikanlah hak Allah, kerana Dia lebih berhak menerima hak-Nya.\"",
        "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ أَتَى رَجُلٌ النَّبِيَّ صلى الله عليه وسلم فَقَالَ لَهُ إِنَّ أُخْتِي نَذَرَتْ أَنْ تَحُجَّ وَإِنَّهَا مَاتَتْ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَوْ كَانَ عَلَيْهَا دَيْنٌ أَكُنْتَ قَاضِيَهُ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَاقْضِ اللَّهَ، فَهْوَ أَحَقُّ بِالْقَضَاءِ ‏\"‏‏.‏"
      },
      {
        "id": 6432,
        "hadith_number": "6700",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kewajipan Memenuhi Janji Ketaatan kepada Allah",
        "perawi_melayu": "Diriwayatkan daripada `Aisha رضي الله عنها :",
        "english_text": "The Prophet (ﷺ) said, \"Whoever vowed to be obedient to Allah, must be obedient to Him; and whoever vowed to be disobedient to Allah, should not be disobedient to Him.\"",
        "malay_translation": "Rasulullah ﷺ bersabda: \"Sesiapa yang bernazar untuk taat kepada Allah, maka hendaklah dia taat kepada-Nya; dan sesiapa yang bernazar untuk menderhakai Allah, maka janganlah dia menderhakai-Nya.\"",
        "arabic_text": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ مَالِكٍ، عَنْ طَلْحَةَ بْنِ عَبْدِ الْمَلِكِ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَنْ نَذَرَ أَنْ يُطِيعَ اللَّهَ فَلْيُطِعْهُ، وَمَنْ نَذَرَ أَنْ يَعْصِيَهُ فَلاَ يَعْصِهِ ‏\"‏‏.‏"
      },
      {
        "id": 6433,
        "hadith_number": "6701",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Allah Tidak Berkaitan dengan Mereka yang Menyiksa Diri Sendiri",
        "perawi_melayu": "Diriwayatkan daripada Anas رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) said: Allah has nothing to do with his torturing himself and he saw him walking between his two sons (supported by them).Thabit has reported it from Hadrat Anas رضی اللہ عنہ .",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Allah tidak ada kaitan dengan orang yang menyiksa dirinya sendiri. Dan baginda melihatnya berjalan di antara kedua orang anaknya (dengan dipapah oleh mereka). Thabit meriwayatkannya daripada Hadrat Anas رضی اللہ عنہ .",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ حُمَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ اللَّهَ لَغَنِيٌّ عَنْ تَعْذِيبِ هَذَا نَفْسَهُ ‏\"‏‏.‏ وَرَآهُ يَمْشِي بَيْنَ ابْنَيْهِ‏.‏ وَقَالَ الْفَزَارِيُّ عَنْ حُمَيْدٍ حَدَّثَنِي ثَابِتٌ عَنْ أَنَسٍ"
      },
      {
        "id": 6434,
        "hadith_number": "6702",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi ﷺ Memutuskan Tali Semasa Tawaf",
        "perawi_melayu": "Diriwayatkan oleh Ibnu 'Abbas رضي الله عنهما :",
        "english_text": "The Prophet (ﷺ) saw a man performing Tawaf around the Ka`ba, tied with a rope or something else (while another person was holding him). The Prophet (ﷺ) cut that rope off.",
        "malay_translation": "Nabi ﷺ melihat seorang lelaki sedang melakukan Tawaf mengelilingi Ka'bah, diikat dengan tali atau sesuatu yang lain (sementara orang lain memegangnya). Nabi ﷺ memotong tali itu.",
        "arabic_text": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ سُلَيْمَانَ الأَحْوَلِ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى رَجُلاً يَطُوفُ بِالْكَعْبَةِ بِزِمَامٍ أَوْ غَيْرِهِ، فَقَطَعَهُ‏.‏"
      },
      {
        "id": 6435,
        "hadith_number": "6703",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi ﷺ Memotong Tali Hidung Orang Semasa Tawaf",
        "perawi_melayu": "Diriwayatkan oleh Ibnu Abbas رضي الله عنهما :",
        "english_text": "While performing the Tawaf around the Ka`ba, the Prophet (ﷺ) passed by a person leading another person by a hair-rope nose-ring in his nose. The Prophet (ﷺ) cut the hair-rope nose-ring off with his hand and ordered the man to lead him by the hand.",
        "malay_translation": "Semasa melakukan Tawaf mengelilingi Ka'bah, Nabi ﷺ melalui seseorang yang sedang memimpin orang lain dengan tali hidung yang diperbuat daripada rambut. Nabi ﷺ memotong tali hidung itu dengan tangan baginda dan memerintahkan lelaki itu memimpin orang tersebut dengan tangannya.",
        "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي سُلَيْمَانُ الأَحْوَلُ، أَنَّ طَاوُسًا، أَخْبَرَهُ عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم مَرَّ وَهْوَ يَطُوفُ بِالْكَعْبَةِ بِإِنْسَانٍ يَقُودُ إِنْسَانًا بِخِزَامَةٍ فِي أَنْفِهِ، فَقَطَعَهَا النَّبِيُّ صلى الله عليه وسلم بِيَدِهِ، ثُمَّ أَمَرَهُ أَنْ يَقُودَهُ بِيَدِهِ"
      },
      {
        "id": 6436,
        "hadith_number": "6704",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Arahan Nabi SAW: Menghentikan Amalan Berlebihan Abu Israil",
        "perawi_melayu": "Diriwayatkan oleh Ibnu Abbas رضي اللہ عنہما :",
        "english_text": "While the Prophet (ﷺ) was delivering a sermon, he saw a man standing, so he asked about that man. They (the people) said, \"It is Abu Israil who has vowed that he will stand and never sit down, and he will never come in the shade, nor speak to anybody, and will fast.'' The Prophet (ﷺ) said, \"Order him to speak and let him come in the shade, and make him sit down, but let him complete his fast.\" Ikrimah has reported from the prophet ﷺ the same.",
        "malay_translation": "Ketika Nabi Muhammad SAW sedang menyampaikan khutbah, baginda melihat seorang lelaki berdiri, lalu baginda bertanya tentang lelaki itu. Mereka (orang ramai) berkata, \"Dia adalah Abu Israil yang telah bernazar bahawa dia akan berdiri dan tidak akan duduk, tidak akan berteduh, tidak akan bercakap dengan sesiapa pun, dan akan berpuasa.\" Nabi SAW bersabda, \"Perintahkan dia untuk bercakap dan biarkan dia berteduh, dan suruh dia duduk, tetapi biarkan dia menyempurnakan puasanya.\" Ikrimah telah meriwayatkan daripada Nabi SAW perkara yang sama.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ بَيْنَا النَّبِيُّ صلى الله عليه وسلم يَخْطُبُ إِذَا هُوَ بِرَجُلٍ قَائِمٍ فَسَأَلَ عَنْهُ فَقَالُوا أَبُو إِسْرَائِيلَ نَذَرَ أَنْ يَقُومَ وَلاَ يَقْعُدَ وَلاَ يَسْتَظِلَّ وَلاَ يَتَكَلَّمَ وَيَصُومَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مُرْهُ فَلْيَتَكَلَّمْ وَلْيَسْتَظِلَّ وَلْيَقْعُدْ وَلْيُتِمَّ صَوْمَهُ ‏\"‏‏.‏ قَالَ عَبْدُ الْوَهَّابِ حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 6437,
        "hadith_number": "6705",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukum Puasa Pada Hari Raya",
        "perawi_melayu": "Diriwayatkan oleh Abdullah bin `Umar رضی اللہ عنہما:",
        "english_text": "He was asked about a man who had vowed that he would fast all the days of his life then the day of `Id al Adha or `Id-al-Fitr came. `Abdullah bin `Umar رضی اللہ عنہما said: You have indeed a good example in Allah's Messenger (ﷺ). He did not fast on the day of `Id al Adha or the day of `Id-al-Fitr, and we do not intend fasting on these two days.",
        "malay_translation": "Beliau ditanya tentang seorang lelaki yang bernazar akan berpuasa sepanjang hidupnya, kemudian tiba hari `Id al Adha atau `Id-al-Fitr. `Abdullah bin `Umar رضی اللہ عنہما berkata: Sesungguhnya kamu mempunyai contoh yang baik pada Rasulullah (ﷺ). Baginda tidak berpuasa pada hari `Id al Adha atau hari `Id-al-Fitr, dan kami tidak berniat untuk berpuasa pada kedua-dua hari tersebut.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، حَدَّثَنَا حَكِيمُ بْنُ أَبِي حُرَّةَ الأَسْلَمِيُّ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ سُئِلَ عَنْ رَجُلٍ، نَذَرَ أَنْ لاَ، يَأْتِيَ عَلَيْهِ يَوْمٌ إِلاَّ صَامَ، فَوَافَقَ يَوْمَ أَضْحًى أَوْ فِطْرٍ‏.‏ فَقَالَ لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ، لَمْ يَكُنْ يَصُومُ يَوْمَ الأَضْحَى وَالْفِطْرِ، وَلاَ يَرَى صِيَامَهُمَا‏.‏"
      },
      {
        "id": 6438,
        "hadith_number": "6706",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukum Berpuasa pada Hari Raya Aidiladha",
        "perawi_melayu": "Diriwayatkan oleh Ziyad bin Jubair:",
        "english_text": "I was with Ibn `Umar when a man asked him, \"I have vowed to fast every Tuesday or Wednesday throughout my life and if the day of my fasting coincided with the day of Nahr (the first day of `Id-al- Adha), (What shall I do?)\" Ibn `Umar رضی اللہ عنہما said, \"Allah has ordered the vows to be fulfilled, and we are forbidden to fast on the day of Nahr.\" The man repeated his question and Ibn `Umar repeated his former answer, adding nothing more.",
        "malay_translation": "Saya bersama Ibn `Umar ketika seorang lelaki bertanya kepadanya, \"Saya telah bernazar untuk berpuasa setiap hari Selasa atau Rabu sepanjang hidup saya dan jika hari puasa saya bertepatan dengan hari Nahr (hari pertama `Id-al- Adha), (Apa yang perlu saya lakukan?)\" Ibn `Umar رضی اللہ عنہما berkata, \"Allah telah memerintahkan nazar untuk ditunaikan, dan kita dilarang berpuasa pada hari Nahr.\" Lelaki itu mengulangi soalannya dan Ibn `Umar mengulangi jawapan sebelumnya, tanpa menambah apa-apa lagi.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ يُونُسَ، عَنْ زِيَادِ بْنِ جُبَيْرٍ، قَالَ كُنْتُ مَعَ ابْنِ عُمَرَ فَسَأَلَهُ رَجُلٌ فَقَالَ نَذَرْتُ أَنْ أَصُومَ كُلَّ يَوْمِ ثَلاَثَاءَ أَوْ أَرْبِعَاءَ مَا عِشْتُ، فَوَافَقْتُ هَذَا الْيَوْمَ يَوْمَ النَّحْرِ‏.‏ فَقَالَ أَمَرَ اللَّهُ بِوَفَاءِ النَّذْرِ، وَنُهِينَا أَنْ نَصُومَ يَوْمَ النَّحْرِ‏.‏ فَأَعَادَ عَلَيْهِ فَقَالَ مِثْلَهُ، لاَ يَزِيدُ عَلَيْهِ‏.‏"
      },
      {
        "id": 6439,
        "hadith_number": "6707",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman bagi Pencurian dalam Perang Khaibar",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضي الله عنه :",
        "english_text": "We went out in the company of Allah's Messenger (ﷺ) on the day of (the battle of) Khaibar, and we did not get any gold or silver as war booty, but we got property in the form of things and clothes. Then a man called Rifa`a bin Zaid, from the tribe of Bani Ad-Dubaib, presented a slave named Mid`am to Allah's Apostle. Allah's Messenger (ﷺ) headed towards the valley of Al-Qura, and when he was in the valley of Al- Qura an arrow was thrown by an unidentified person, struck and killed Mid`am who was making a she-camel of Allah's Messenger (ﷺ) kneel down. The people said, \"Congratulations to him (the slave) for gaining Paradise.\" Allah's Messenger (ﷺ) said, \"No! By Him in Whose Hand my soul is, for the sheet which he stole from the war booty before its distribution on the day of Khaibar, is now burning over him.\" When the people heard that, a man brought one or two Shiraks (leather straps of shoes) to the Prophet. The Prophet (ﷺ) said, \"A Shirak of fire, or two Shiraks of fire.\"",
        "malay_translation": "Kami keluar bersama Rasulullah ﷺ pada hari (peperangan) Khaibar, dan kami tidak mendapat sebarang emas atau perak sebagai harta rampasan perang, tetapi kami mendapat harta dalam bentuk barang-barang dan pakaian. Kemudian seorang lelaki bernama Rifa`a bin Zaid, dari suku Bani Ad-Dubaib, menghadiahkan seorang hamba bernama Mid`am kepada Rasulullah ﷺ. Rasulullah ﷺ menuju ke lembah Al-Qura, dan ketika baginda berada di lembah Al-Qura, sebatang anak panah telah dilempar oleh seseorang yang tidak dikenali, terkena dan membunuh Mid`am yang sedang melututkan unta betina Rasulullah ﷺ. Orang ramai berkata, \"Tahniah kepadanya (hamba itu) kerana mendapat syurga.\" Rasulullah ﷺ bersabda, \"Tidak! Demi Dia yang di tangan-Nya nyawaku berada, sesungguhnya kain yang dia curi dari harta rampasan perang sebelum pembahagiannya pada hari Khaibar, kini sedang membara ke atasnya.\" Apabila orang ramai mendengar hal itu, seorang lelaki membawa satu atau dua Shiraks (tali kulit kasut) kepada Nabi. Nabi ﷺ bersabda, \"Satu Shirak api, atau dua Shiraks api.\"",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ، عَنْ أَبِي الْغَيْثِ، مَوْلَى ابْنِ مُطِيعٍ عَنْ أَبِي هُرَيْرَةَ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ خَيْبَرَ فَلَمْ نَغْنَمْ ذَهَبًا وَلاَ فِضَّةً إِلاَّ الأَمْوَالَ وَالثِّيَابَ وَالْمَتَاعَ، فَأَهْدَى رَجُلٌ مِنْ بَنِي الضُّبَيْبِ يُقَالُ لَهُ رِفَاعَةُ بْنُ زَيْدٍ لِرَسُولِ اللَّهِ صلى الله عليه وسلم غُلاَمًا يُقَالُ لَهُ مِدْعَمٌ، فَوَجَّهَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى وَادِي الْقُرَى حَتَّى إِذَا كَانَ بِوَادِي الْقُرَى بَيْنَمَا مِدْعَمٌ يَحُطُّ رَحْلاً لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِذَا سَهْمٌ عَائِرٌ فَقَتَلَهُ، فَقَالَ النَّاسُ هَنِيئًا لَهُ الْجَنَّةُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَلاَّ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّ الشَّمْلَةَ الَّتِي أَخَذَهَا يَوْمَ خَيْبَرَ مِنَ الْمَغَانِمِ، لَمْ تُصِبْهَا الْمَقَاسِمُ، لَتَشْتَعِلُ عَلَيْهِ نَارًا ‏\"‏‏.‏ فَلَمَّا سَمِعَ ذَلِكَ النَّاسُ جَاءَ رَجُلٌ بِشِرَاكٍ أَوْ شِرَاكَيْنِ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ شِرَاكٌ مِنْ نَارٍ ـ أَوْ ـ شِرَاكَانِ مِنْ نَارٍ ‏\"‏‏.‏"
      }
    ]
  }
}