{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 76,
    "data": [
      {
        "id": 59,
        "hadith_number": "59",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kehilangan Kejujuran Sebagai Tanda Ketibaan Hari Kiamat",
        "perawi_melayu": "Dikisahkan oleh Abu Hurairah:",
        "english_text": "While the Prophet (ﷺ) was saying something in a gathering, a Bedouin came and asked him, \"When would the Hour (Doomsday) take place?\" Allah's Messenger (ﷺ) continued his talk, so some people said that Allah's Messenger (ﷺ) had heard the question, but did not like what that Bedouin had asked. Some of them said that Allah's Messenger (ﷺ) had not heard it. When the Prophet (ﷺ) finished his speech, he said, \"Where is the questioner, who inquired about the Hour (Doomsday)?\" The Bedouin said, \"I am here, O Allah's Apostle .\" Then the Prophet (ﷺ) said, \"When honesty is lost, then wait for the Hour (Doomsday).\" The Bedouin said, \"How will that be lost?\" The Prophet (ﷺ) said, \"When the power or authority comes in the hands of unfit persons, then wait for the Hour (Doomsday.)\"",
        "malay_translation": "Ketika Nabi (ﷺ) sedang berucap di suatu majlis, seorang Badwi datang dan bertanya, \"Bilakah Hari Kiamat akan berlaku?\" Rasulullah (ﷺ) meneruskan ceramahnya, lalu ada yang berkata bahawa Rasulullah (ﷺ) telah mendengar soalan tersebut, tetapi tidak menyukai soalan Badwi itu. Sebahagian lagi berkata bahawa Rasulullah (ﷺ) tidak mendengarnya. Apabila Nabi (ﷺ) selesai bercakap, baginda bersabda, \"Di manakah si penanya yang bertanya tentang Hari Kiamat?\" Badwi itu berkata, \"Saya di sini, wahai Rasulullah.\" Kemudian Nabi (ﷺ) bersabda, \"Apabila kejujuran hilang, maka tunggulah Hari Kiamat.\" Badwi itu bertanya, \"Bagaimanakah ia akan hilang?\" Nabi (ﷺ) bersabda, \"Apabila kuasa atau pemerintahan berada di tangan orang yang tidak layak, maka tunggulah Hari Kiamat.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، قَالَ حَدَّثَنَا فُلَيْحٌ، ح وَحَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ فُلَيْحٍ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي هِلاَلُ بْنُ عَلِيٍّ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ بَيْنَمَا النَّبِيُّ صلى الله عليه وسلم فِي مَجْلِسٍ يُحَدِّثُ الْقَوْمَ جَاءَهُ أَعْرَابِيٌّ فَقَالَ مَتَى السَّاعَةُ فَمَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم يُحَدِّثُ، فَقَالَ بَعْضُ الْقَوْمِ سَمِعَ مَا قَالَ، فَكَرِهَ مَا قَالَ، وَقَالَ بَعْضُهُمْ بَلْ لَمْ يَسْمَعْ، حَتَّى إِذَا قَضَى حَدِيثَهُ قَالَ ‏\"‏ أَيْنَ ـ أُرَاهُ ـ السَّائِلُ عَنِ السَّاعَةِ ‏\"‏‏.‏ قَالَ هَا أَنَا يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ فَإِذَا ضُيِّعَتِ الأَمَانَةُ فَانْتَظِرِ السَّاعَةَ ‏\"‏‏.‏ قَالَ كَيْفَ إِضَاعَتُهَا قَالَ ‏\"‏ إِذَا وُسِّدَ الأَمْرُ إِلَى غَيْرِ أَهْلِهِ فَانْتَظِرِ السَّاعَةَ ‏\"‏‏.‏"
      },
      {
        "id": 60,
        "hadith_number": "60",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menjaga Tumit Dari Api Neraka",
        "perawi_melayu": "Diceritakan oleh Abdullah bin 'Amr:",
        "english_text": "Once the Prophet (ﷺ) remained behind us in a journey. He joined us while we were performing ablution for the prayer which was over-due. We were just passing wet hands over our feet (and not washing them properly) so the Prophet (ﷺ) addressed us in a loud voice and said twice or thrice: \"Save your heels from the fire.\"",
        "malay_translation": "Suatu ketika Rasulullah SAW ketinggalan di dalam perjalanan kami. Baginda menyertai kami ketika kami sedang melakukan wuduk untuk solat yang sudah lewat. Kami hanya menghalakan tangan yang basah ke kaki (tanpa mencucinya dengan sempurna), lalu Rasulullah SAW menegur kami dengan suara yang lantang dan berulang kali bersabda, \"Lindungilah tumit kamu dari api neraka.\"",
        "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ، عَارِمُ بْنُ الْفَضْلِ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ يُوسُفَ بْنِ مَاهَكَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ تَخَلَّفَ عَنَّا النَّبِيُّ صلى الله عليه وسلم فِي سَفْرَةٍ سَافَرْنَاهَا، فَأَدْرَكَنَا وَقَدْ أَرْهَقَتْنَا الصَّلاَةُ وَنَحْنُ نَتَوَضَّأُ، فَجَعَلْنَا نَمْسَحُ عَلَى أَرْجُلِنَا، فَنَادَى بِأَعْلَى صَوْتِهِ ‏ \"‏ وَيْلٌ لِلأَعْقَابِ مِنَ النَّارِ ‏\"‏‏.‏ مَرَّتَيْنِ أَوْ ثَلاَثًا‏.‏"
      },
      {
        "id": 61,
        "hadith_number": "61",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perihal Pohon Kurma dan Perumpamaan Seorang Muslim",
        "perawi_melayu": "Dikisahkan oleh Ibn `Umar:",
        "english_text": "Allah's Messenger (ﷺ) said, \"Amongst the trees, there is a tree, the leaves of which do not fall and is like a Muslim. Tell me the name of that tree.\" Everybody started thinking about the trees of the desert areas. And I thought of the date-palm tree but felt shy to answer the others then asked, \"What is that tree, O Allah's Messenger (ﷺ) ?\" He replied, \"It is the date-palm tree.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Di antara pokok-pokok, terdapat sebatang pokok yang daunnya tidak gugur dan ibarat seorang Muslim. Beritahu aku nama pokok itu.\" Semua orang mula memikirkan pokok-pokok di kawasan gurun. Dan aku terfikirkan pokok kurma tetapi merasa segan untuk menjawab orang lain, lalu bertanya, \"Apakah pokok itu, wahai Rasulullah (ﷺ)?\" Baginda menjawab, \"Ianya pokok kurma.\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنَ الشَّجَرِ شَجَرَةً لاَ يَسْقُطُ وَرَقُهَا، وَإِنَّهَا مَثَلُ الْمُسْلِمِ، فَحَدِّثُونِي مَا هِيَ ‏\"‏‏.‏ فَوَقَعَ النَّاسُ فِي شَجَرِ الْبَوَادِي‏.‏ قَالَ عَبْدُ اللَّهِ وَوَقَعَ فِي نَفْسِي أَنَّهَا النَّخْلَةُ، فَاسْتَحْيَيْتُ ثُمَّ قَالُوا حَدِّثْنَا مَا هِيَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ هِيَ النَّخْلَةُ ‏\"‏‏.‏"
      },
      {
        "id": 62,
        "hadith_number": "62",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pokok Kurma Sebagai Metafora Orang Islam",
        "perawi_melayu": "Diriwayatkan oleh Ibnu Umar",
        "english_text": "The Prophet (ﷺ) said, \"Amongst the trees, there is a tree, the leaves of which do not fall and is like a Muslim. Tell me the name of that tree.\" Everybody started thinking about the trees of the desert areas. And I thought of the date-palm tree. The others then asked, \"Please inform us what is that tree, O Allah's Messenger (ﷺ)?\" He replied, \"It is the date-palm tree.\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Di antara pokok-pokok, terdapat sebuah pokok yang daunnya tidak gugur dan menyerupai seorang Muslim. Beritahu aku nama pokok itu.\" Semua orang mula memikirkan pokok-pokok di kawasan gurun. Dan aku teringat kepada pokok kurma. Kemudian orang lain bertanya, \"Ya Rasulullah, apa pokok itu?\" Baginda menjawab, \"Itulah pokok kurma.\"",
        "arabic_text": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ مِنَ الشَّجَرِ شَجَرَةً لاَ يَسْقُطُ وَرَقُهَا، وَإِنَّهَا مَثَلُ الْمُسْلِمِ، حَدِّثُونِي مَا هِيَ ‏\"‏‏.‏ قَالَ فَوَقَعَ النَّاسُ فِي شَجَرِ الْبَوَادِي‏.‏ قَالَ عَبْدُ اللَّهِ فَوَقَعَ فِي نَفْسِي أَنَّهَا النَّخْلَةُ، ثُمَّ قَالُوا حَدِّثْنَا مَا هِيَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ هِيَ النَّخْلَةُ ‏\"‏‏.‏"
      },
      {
        "id": 63,
        "hadith_number": "63",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Lelaki yang Menanyakan Ajaran Nabi Muhammad SAW",
        "perawi_melayu": "Dikisahkan oleh Anas bin Malik:",
        "english_text": "While we were sitting with the Prophet (ﷺ) in the mosque, a man came riding on a camel. He made his camel kneel down in the mosque, tied its foreleg and then said: \"Who amongst you is Muhammad?\" At that time the Prophet (ﷺ) was sitting amongst us (his companions) leaning on his arm. We replied, \"This white man reclining on his arm.\" The man then addressed him, \"O Son of `Abdul Muttalib.\" The Prophet (ﷺ) said, \"I am here to answer your questions.\" The man said to the Prophet, \"I want to ask you something and will be hard in questioning. So do not get angry.\" The Prophet (ﷺ) said, \"Ask whatever you want.\" The man said, \"I ask you by your Lord, and the Lord of those who were before you, has Allah sent you as an Apostle to all the mankind?\" The Prophet (ﷺ) replied, \"By Allah, yes.\" The man further said, \"I ask you by Allah. Has Allah ordered you to offer five prayers in a day and night (24 hours).? He replied, \"By Allah, Yes.\" The man further said, \"I ask you by Allah! Has Allah ordered you to observe fasts during this month of the year (i.e. Ramadan)?\" He replied, \"By Allah, Yes.\" The man further said, \"I ask you by Allah. Has Allah ordered you to take Zakat (obligatory charity) from our rich people and distribute it amongst our poor people?\" The Prophet (ﷺ) replied, \"By Allah, yes.\" Thereupon that man said, \"I have believed in all that with which you have been sent, and I have been sent by my people as a messenger, and I am Dimam bin Tha`laba from the brothers of Bani Sa`d bin Bakr.\"",
        "malay_translation": "Ketika kami duduk bersama Rasulullah SAW di masjid, seorang lelaki datang menunggang unta. Beliau menundukkan untanya di dalam masjid, mengikat kaki depannya dan bertanya, \"Siapakah di antara kalian Muhammad?\" Ketika itu, Rasulullah SAW sedang duduk di tengah-tengah kami (para sahabat) sambil bersandar pada lengannya. Kami menjawab, \"Orang kulit putih yang sedang bersandar pada lengannya itu.\" Lelaki itu kemudian memanggilnya, \"Wahai anak Abdul Muttalib.\" Rasulullah SAW menjawab, \"Saya di sini untuk menjawab pertanyaanmu.\" Lelaki itu berkata kepada Rasulullah, \"Saya ingin bertanya sesuatu dan soalannya agak keras, jadi janganlah marah.\" Rasulullah SAW berkata, \"Tanya apa saja yang ingin engkau tanyakan.\" Lelaki itu berkata, \"Aku bertanya kepadamu dengan izin Tuhanmu, dan Tuhan orang-orang sebelummu, adakah Allah mengutusmu sebagai Rasul kepada seluruh umat manusia?\" Rasulullah SAW menjawab, \"Demi Allah, ya.\" Lelaki itu bertanya lagi, \"Aku bertanya kepadamu dengan izin Allah, adakah Allah memerintahkanmu untuk mendirikan lima waktu solat dalam sehari semalam?\" Baginda menjawab, \"Demi Allah, ya.\" Lelaki itu bertanya lagi, \"Aku bertanya kepadamu dengan izin Allah! Adakah Allah memerintahkanmu untuk berpuasa pada bulan ini (Ramadhan)?\" Baginda menjawab, \"Demi Allah, ya.\" Lelaki itu bertanya lagi, \"Aku bertanya kepadamu dengan izin Allah, adakah Allah memerintahkanmu untuk mengambil zakat (sedekah wajib) daripada orang kaya kita dan membagikannya kepada orang miskin kita?\" Rasulullah SAW menjawab, \"Demi Allah, ya.\" Lalu lelaki itu berkata, \"Aku telah beriman kepada semua yang telah kau bawa, dan aku diutus oleh kaumku sebagai utusan, dan aku adalah Dimam bin Tha'laba dari kaum Bani Sa'd bin Bakar.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ سَعِيدٍ ـ هُوَ الْمَقْبُرِيُّ ـ عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ بَيْنَمَا نَحْنُ جُلُوسٌ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي الْمَسْجِدِ، دَخَلَ رَجُلٌ عَلَى جَمَلٍ فَأَنَاخَهُ فِي الْمَسْجِدِ، ثُمَّ عَقَلَهُ، ثُمَّ قَالَ لَهُمْ أَيُّكُمْ مُحَمَّدٌ وَالنَّبِيُّ صلى الله عليه وسلم مُتَّكِئٌ بَيْنَ ظَهْرَانَيْهِمْ‏.‏ فَقُلْنَا هَذَا الرَّجُلُ الأَبْيَضُ الْمُتَّكِئُ‏.‏ فَقَالَ لَهُ الرَّجُلُ ابْنَ عَبْدِ الْمُطَّلِبِ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ قَدْ أَجَبْتُكَ ‏\"‏‏.‏ فَقَالَ الرَّجُلُ لِلنَّبِيِّ صلى الله عليه وسلم إِنِّي سَائِلُكَ فَمُشَدِّدٌ عَلَيْكَ فِي الْمَسْأَلَةِ فَلاَ تَجِدْ عَلَىَّ فِي نَفْسِكَ‏.‏ فَقَالَ ‏\"‏ سَلْ عَمَّا بَدَا لَكَ ‏\"‏‏.‏ فَقَالَ أَسْأَلُكَ بِرَبِّكَ وَرَبِّ مَنْ قَبْلَكَ، آللَّهُ أَرْسَلَكَ إِلَى النَّاسِ كُلِّهِمْ فَقَالَ ‏\"‏ اللَّهُمَّ نَعَمْ ‏\"‏‏.‏ قَالَ أَنْشُدُكَ بِاللَّهِ، آللَّهُ أَمَرَكَ أَنْ نُصَلِّيَ الصَّلَوَاتِ الْخَمْسَ فِي الْيَوْمِ وَاللَّيْلَةِ قَالَ ‏\"‏ اللَّهُمَّ نَعَمْ ‏\"‏‏.‏ قَالَ أَنْشُدُكَ بِاللَّهِ، آللَّهُ أَمَرَكَ أَنْ نَصُومَ هَذَا الشَّهْرَ مِنَ السَّنَةِ قَالَ ‏\"‏ اللَّهُمَّ نَعَمْ ‏\"‏‏.‏ قَالَ أَنْشُدُكَ بِاللَّهِ، آللَّهُ أَمَرَكَ أَنْ تَأْخُذَ هَذِهِ الصَّدَقَةَ مِنْ أَغْنِيَائِنَا فَتَقْسِمَهَا عَلَى فُقَرَائِنَا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ نَعَمْ ‏\"‏‏.‏ فَقَالَ الرَّجُلُ آمَنْتُ بِمَا جِئْتَ بِهِ، وَأَنَا رَسُولُ مَنْ وَرَائِي مِنْ قَوْمِي، وَأَنَا ضِمَامُ بْنُ ثَعْلَبَةَ أَخُو بَنِي سَعْدِ بْنِ بَكْرٍ‏.‏ رَوَاهُ مُوسَى وَعَلِيُّ بْنُ عَبْدِ الْحَمِيدِ عَنْ سُلَيْمَانَ عَنْ ثَابِتٍ عَنْ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا‏.‏"
      },
      {
        "id": 64,
        "hadith_number": "64",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Mendoakan Kebinasaan Orang Yang Menghancurkan Suratnya",
        "perawi_melayu": "`Abdullah bin `Abbas meriwayatkan",
        "english_text": "Once Allah's Messenger (ﷺ) gave a letter to a person and ordered him to go and deliver it to the Governor of Bahrain. (He did so) and the Governor of Bahrain sent it to Chousroes, who read that letter and then tore it to pieces. (The sub-narrator (Ibn Shihab) thinks that Ibn Al-Musaiyab said that Allah's Messenger (ﷺ) invoked Allah against them (saying), \"May Allah tear them into pieces, and disperse them all totally.)\"",
        "malay_translation": "Suatu ketika, Rasulullah SAW memberikan sepucuk surat kepada seseorang dan memerintahkannya untuk menyampaikannya kepada Gabenor Bahrain. (Dia melakukannya) dan Gabenor Bahrain menghantar surat itu kepada Chosroes, yang membacanya dan kemudian merobeknya. (Menurut perawi tambahan (Ibn Shihab), Ibn Al-Musaiyab menyatakan bahawa Rasulullah SAW memohon kepada Allah agar menghancurkan mereka (dengan berkata), \"Semoga Allah merobek-robek mereka dan mencerai-beraikan mereka sepenuhnya.\")",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ بِكِتَابِهِ رَجُلاً، وَأَمَرَهُ أَنْ يَدْفَعَهُ إِلَى عَظِيمِ الْبَحْرَيْنِ، فَدَفَعَهُ عَظِيمُ الْبَحْرَيْنِ إِلَى كِسْرَى، فَلَمَّا قَرَأَهُ مَزَّقَهُ‏.‏ فَحَسِبْتُ أَنَّ ابْنَ الْمُسَيَّبِ قَالَ فَدَعَا عَلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُمَزَّقُوا كُلَّ مُمَزَّقٍ‏.‏"
      },
      {
        "id": 65,
        "hadith_number": "65",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perutusan Nabi SAW dan Penggunaan Mohor Perak",
        "perawi_melayu": "Dikisahkan oleh Anas bin Malik:",
        "english_text": "Once the Prophet (ﷺ) wrote a letter or had an idea of writing a letter. The Prophet (ﷺ) was told that they (rulers) would not read letters unless they were sealed. So the Prophet (ﷺ) got a silver ring made with \"Muhammad Allah's Messenger (ﷺ)\" engraved on it. As if I were just observing its white glitter in the hand of the Prophet.",
        "malay_translation": "Suatu ketika Nabi SAW menulis surat atau bercadang untuk menulis surat. Nabi SAW diberitahu bahawa mereka (para pemerintah) tidak akan membaca surat kecuali jika ia disahkan dengan meterai. Oleh itu, Nabi SAW membuat cincin perak dengan tulisan \"Muhammad Rasulullah\" terukir di atasnya. Seakan-akan aku hanya memerhatikan kilauan putihnya di tangan Nabi SAW.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَتَبَ النَّبِيُّ صلى الله عليه وسلم كِتَابًا ـ أَوْ أَرَادَ أَنْ يَكْتُبَ ـ فَقِيلَ لَهُ إِنَّهُمْ لاَ يَقْرَءُونَ كِتَابًا إِلاَّ مَخْتُومًا‏.‏ فَاتَّخَذَ خَاتَمًا مِنْ فِضَّةٍ نَقْشُهُ مُحَمَّدٌ رَسُولُ اللَّهِ‏.‏ كَأَنِّي أَنْظُرُ إِلَى بَيَاضِهِ فِي يَدِهِ‏.‏ فَقُلْتُ لِقَتَادَةَ مَنْ قَالَ نَقْشُهُ مُحَمَّدٌ رَسُولُ اللَّهِ قَالَ أَنَسٌ‏.‏"
      },
      {
        "id": 66,
        "hadith_number": "66",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Tiga Orang Lelaki dan Reaksi Rasulullah SAW",
        "perawi_melayu": "Dikisahkan oleh Abu Waqid Al-Laithi:",
        "english_text": "While Allah's Messenger (ﷺ) was sitting in the mosque with some people, three men came. Two of them came in front of Allah's Messenger (ﷺ) and the third one went away. The two persons kept on standing before Allah's Messenger (ﷺ) for a while and then one of them found a place in the circle and sat there while the other sat behind the gathering, and the third one went away. When Allah's Messenger (ﷺ) finished his preaching, he said, \"Shall I tell you about these three persons? One of them betook himself to Allah, so Allah took him into His grace and mercy and accommodated him, the second felt shy from Allah, so Allah sheltered Him in His mercy (and did not punish him), while the third turned his face from Allah and went away, so Allah turned His face from him likewise. \"",
        "malay_translation": "Ketika Rasulullah SAW sedang duduk di masjid bersama beberapa orang, tiga orang lelaki datang. Dua dari mereka datang ke hadapan Rasulullah SAW, dan seorang lagi pergi. Kedua orang itu terus berdiri di hadapan Rasulullah SAW seketika, kemudian salah seorang dari mereka mencari tempat di dalam kumpulan itu dan duduk di situ, manakala yang lain duduk di belakang kumpulan tersebut. Sementara itu, orang ketiga pergi.  Apabila Rasulullah SAW selesai menyampaikan khutbahnya, baginda bersabda, \"Inginkah aku beritahu kalian tentang ketiga-tiga orang ini? Salah seorang dari mereka menghadap kepada Allah, maka Allah menerima dan mengasihinya dan menaruh rahmat-Nya kepadanya. Yang kedua merasa segan kepada Allah, maka Allah memelihara dan melindungi dengan rahmat-Nya (dan tidak menghukumnya).  Sedangkan orang ketiga berpaling dari Allah dan pergi, maka Allah pun berpaling daripada dia juga.\"",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّ أَبَا مُرَّةَ، مَوْلَى عَقِيلِ بْنِ أَبِي طَالِبٍ أَخْبَرَهُ عَنْ أَبِي وَاقِدٍ اللَّيْثِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَيْنَمَا هُوَ جَالِسٌ فِي الْمَسْجِدِ وَالنَّاسُ مَعَهُ، إِذْ أَقْبَلَ ثَلاَثَةُ نَفَرٍ، فَأَقْبَلَ اثْنَانِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَذَهَبَ وَاحِدٌ، قَالَ فَوَقَفَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَمَّا أَحَدُهُمَا فَرَأَى فُرْجَةً فِي الْحَلْقَةِ فَجَلَسَ فِيهَا، وَأَمَّا الآخَرُ فَجَلَسَ خَلْفَهُمْ، وَأَمَّا الثَّالِثُ فَأَدْبَرَ ذَاهِبًا، فَلَمَّا فَرَغَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ أَلاَ أُخْبِرُكُمْ عَنِ النَّفَرِ الثَّلاَثَةِ أَمَّا أَحَدُهُمْ فَأَوَى إِلَى اللَّهِ، فَآوَاهُ اللَّهُ، وَأَمَّا الآخَرُ فَاسْتَحْيَا، فَاسْتَحْيَا اللَّهُ مِنْهُ، وَأَمَّا الآخَرُ فَأَعْرَضَ، فَأَعْرَضَ اللَّهُ عَنْهُ ‏\"‏‏.‏"
      },
      {
        "id": 67,
        "hadith_number": "67",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ketetapan Kesucian Darah, Harta dan Kehormatan dalam Islam",
        "perawi_melayu": "Dikisahkan oleh bapa Abdur-Rahman bin Abi Bakra",
        "english_text": "Once the Prophet (ﷺ) was riding his camel and a man was holding its rein. The Prophet (ﷺ) asked, \"What is the day today?\" We kept quiet, thinking that he might give that day another name. He said, \"Isn't it the day of Nahr (slaughtering of the animals of sacrifice)\" We replied, \"Yes.\" He further asked, \"Which month is this?\" We again kept quiet, thinking that he might give it another name. Then he said, \"Isn't it the month of Dhul-Hijja?\" We replied, \"Yes.\" He said, \"Verily! Your blood, property and honor are sacred to one another (i.e. Muslims) like the sanctity of this day of yours, in this month of yours and in this city of yours. It is incumbent upon those who are present to inform those who are absent because those who are absent might comprehend (what I have said) better than the present audience.\"",
        "malay_translation": "Suatu ketika Nabi SAW sedang menunggang unta dan seorang lelaki memegang tali kekangnya. Baginda SAW bertanya, \"Hari apakah hari ini?\" Kami diam, mengira Baginda mungkin memberi nama lain untuk hari itu. Baginda SAW bersabda, \"Bukankah hari ini hari Nahr (penyembelihan binatang korban)?\" Kami menjawab, \"Ya.\" Baginda SAW bertanya lagi, \"Bulan apakah ini?\" Kami diam lagi, mengira Baginda mungkin memberi nama lain untuk bulan itu. Kemudian Baginda SAW bersabda, \"Bukankah ini bulan Zulhijjah?\" Kami menjawab, \"Ya.\" Baginda SAW bersabda, \"Sesungguhnya darah, harta, dan kehormatan kamu adalah suci antara satu sama lain (iaitu umat Islam) sama seperti kesucian hari ini, bulan ini dan kota ini.  Wajiblah bagi yang hadir untuk menyampaikan kepada yang tidak hadir kerana yang tidak hadir mungkin lebih mudah memahami (apa yang aku katakan) daripada yang hadir.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا بِشْرٌ، قَالَ حَدَّثَنَا ابْنُ عَوْنٍ، عَنِ ابْنِ سِيرِينَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، ذَكَرَ النَّبِيَّ صلى الله عليه وسلم قَعَدَ عَلَى بَعِيرِهِ، وَأَمْسَكَ إِنْسَانٌ بِخِطَامِهِ ـ أَوْ بِزِمَامِهِ ـ قَالَ ‏\"‏ أَىُّ يَوْمٍ هَذَا ‏\"‏‏.‏ فَسَكَتْنَا حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ سِوَى اسْمِهِ‏.‏ قَالَ ‏\"‏ أَلَيْسَ يَوْمَ النَّحْرِ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ فَأَىُّ شَهْرٍ هَذَا ‏\"‏‏.‏ فَسَكَتْنَا حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ‏.‏ فَقَالَ ‏\"‏ أَلَيْسَ بِذِي الْحِجَّةِ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ فَإِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ وَأَعْرَاضَكُمْ بَيْنَكُمْ حَرَامٌ كَحُرْمَةِ يَوْمِكُمْ هَذَا، فِي شَهْرِكُمْ هَذَا، فِي بَلَدِكُمْ هَذَا‏.‏ لِيُبَلِّغِ الشَّاهِدُ الْغَائِبَ، فَإِنَّ الشَّاهِدَ عَسَى أَنْ يُبَلِّغَ مَنْ هُوَ أَوْعَى لَهُ مِنْهُ ‏\"‏‏.‏"
      },
      {
        "id": 68,
        "hadith_number": "68",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ketetapan Waktu Dakwah Nabi SAW untuk Menjauhkan Rasa Bosan",
        "perawi_melayu": "Dikisahkan oleh Ibn Mas`ud:",
        "english_text": "The Prophet (ﷺ) used to take care of us in preaching by selecting a suitable time, so that we might not get bored. (He abstained from pestering us with sermons and knowledge all the time).",
        "malay_translation": "Nabi SAW dahulu sentiasa menjaga kita dalam menyampaikan dakwah dengan memilih waktu yang sesuai, supaya kita tidak merasa bosan. (Baginda menjauhkan diri daripada mengusik kita dengan khutbah dan ilmu pengetahuan sepanjang masa).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنِ ابْنِ مَسْعُودٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَتَخَوَّلُنَا بِالْمَوْعِظَةِ فِي الأَيَّامِ، كَرَاهَةَ السَّآمَةِ عَلَيْنَا‏.‏"
      },
      {
        "id": 69,
        "hadith_number": "69",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Memudahkan Urusan Agama dan Memberi Khabar Gembira Kepada Manusia",
        "perawi_melayu": "Dikisahkan oleh Anas bin Malik:",
        "english_text": "The Prophet (ﷺ) said, \"Facilitate things to people (concerning religious matters), and do not make it hard for them and give them good tidings and do not make them run away (from Islam).",
        "malay_translation": "Rasulullah SAW bersabda, \"Mudahkanlah urusan orang ramai (berkaitan perkara agama), dan janganlah kamu menyusahkan mereka. Beri mereka khabar gembira dan janganlah kamu menakutkan mereka (daripada Islam).\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنِي أَبُو التَّيَّاحِ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ يَسِّرُوا وَلاَ تُعَسِّرُوا، وَبَشِّرُوا وَلاَ تُنَفِّرُوا ‏\"‏‏.‏"
      },
      {
        "id": 70,
        "hadith_number": "70",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Penjelasan Abdullah tentang Penyampaian Dakwah yang Tepat",
        "perawi_melayu": "Dikisahkan oleh Abu Wail:",
        "english_text": "`Abdullah used to give a religious talk to the people on every Thursday. Once a man said, \"O Aba `Abdur-Rahman! (By Allah) I wish if you could preach us daily.\" He replied, \"The only thing which prevents me from doing so, is that I hate to bore you, and no doubt I take care of you in preaching by selecting a suitable time just as the Prophet (ﷺ) used to do with us, for fear of making us bored.\"",
        "malay_translation": "`Abdullah biasa menyampaikan ceramah keagamaan kepada orang ramai setiap hari Khamis. Suatu ketika, seorang lelaki berkata, \"Wahai Abu `Abdur-Rahman! Demi Allah, saya ingin sekiranya anda dapat menyampaikan khutbah kepada kami setiap hari.\" Dia menjawab, \"Satu-satunya perkara yang menghalang saya daripada berbuat demikian ialah saya tidak suka membosankan kamu, dan sudah tentu saya menjaga kamu dalam menyampaikan khutbah dengan memilih waktu yang sesuai sama seperti Nabi (ﷺ) lakukan dengan kita, kerana takut membosankan kita.\"",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، قَالَ كَانَ عَبْدُ اللَّهِ يُذَكِّرُ النَّاسَ فِي كُلِّ خَمِيسٍ، فَقَالَ لَهُ رَجُلٌ يَا أَبَا عَبْدِ الرَّحْمَنِ لَوَدِدْتُ أَنَّكَ ذَكَّرْتَنَا كُلَّ يَوْمٍ‏.‏ قَالَ أَمَا إِنَّهُ يَمْنَعُنِي مِنْ ذَلِكَ أَنِّي أَكْرَهُ أَنْ أُمِلَّكُمْ، وَإِنِّي أَتَخَوَّلُكُمْ بِالْمَوْعِظَةِ كَمَا كَانَ النَّبِيُّ صلى الله عليه وسلم يَتَخَوَّلُنَا بِهَا، مَخَافَةَ السَّآمَةِ عَلَيْنَا‏.‏"
      },
      {
        "id": 71,
        "hadith_number": "71",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Allah Memberi Pemahaman Agama Kepada Orang Yang Baik",
        "perawi_melayu": "Dikisahkan oleh Muawiya:",
        "english_text": "I heard Allah's Messenger (ﷺ) saying, \"If Allah wants to do good to a person, He makes him comprehend the religion. I am just a distributor, but the grant is from Allah. (And remember) that this nation (true Muslims) will keep on following Allah's teachings strictly and they will not be harmed by any one going on a different path till Allah's order (Day of Judgment) is established.\"",
        "malay_translation": "Aku mendengar Rasulullah SAW bersabda, \"Jika Allah menghendaki kebaikan kepada seseorang, Dia akan memberikan pemahaman agama kepadanya. Aku hanyalah pemberi, tetapi pemberian itu daripada Allah. Dan ingatlah bahawa umat ini (orang Islam yang benar) akan terus mengikuti ajaran Allah dengan teguh, dan mereka tidak akan teraniaya oleh sesiapa yang mengikuti jalan yang berbeza sehingga perintah Allah (Hari Kiamat) ditegakkan.\"",
        "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ قَالَ حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ سَمِعْتُ مُعَاوِيَةَ، خَطِيبًا يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُفَقِّهْهُ فِي الدِّينِ، وَإِنَّمَا أَنَا قَاسِمٌ وَاللَّهُ يُعْطِي، وَلَنْ تَزَالَ هَذِهِ الأُمَّةُ قَائِمَةً عَلَى أَمْرِ اللَّهِ لاَ يَضُرُّهُمْ مَنْ خَالَفَهُمْ حَتَّى يَأْتِيَ أَمْرُ اللَّهِ ‏\"‏‏.‏"
      },
      {
        "id": 72,
        "hadith_number": "72",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Tentang Pokok Kurma dan Persamaan dengan Muslim",
        "perawi_melayu": "Riwayat Ibn `Umar",
        "english_text": "We were with the Prophet (ﷺ) and fresh dates of a palm tree were brought to him. On that he said, \"Amongst the trees, there is a tree which resembles a Muslim.\" I wanted to say that it was the datepalm tree but as I was the youngest of all (of them) I kept quiet. And then the Prophet (ﷺ) said, \"It is the date-palm tree.\"",
        "malay_translation": "Kami berada bersama Nabi (ﷺ) dan beberapa kurma segar dari pohon kurma dihidangkan kepadanya. Baginda bersabda, \"Di antara pokok-pokok, terdapat satu pokok yang menyerupai seorang Muslim.\" Saya ingin berkata ia pokok kurma, tetapi kerana saya paling muda di antara mereka, saya diam. Kemudian Nabi (ﷺ) bersabda, \"Ia adalah pokok kurma.\"",
        "arabic_text": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، قَالَ قَالَ لِي ابْنُ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ، قَالَ صَحِبْتُ ابْنَ عُمَرَ إِلَى الْمَدِينَةِ فَلَمْ أَسْمَعْهُ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلاَّ حَدِيثًا وَاحِدًا، قَالَ كُنَّا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَأُتِيَ بِجُمَّارٍ فَقَالَ ‏\"‏ إِنَّ مِنَ الشَّجَرِ شَجَرَةً مَثَلُهَا كَمَثَلِ الْمُسْلِمِ ‏\"‏‏.‏ فَأَرَدْتُ أَنْ أَقُولَ هِيَ النَّخْلَةُ، فَإِذَا أَنَا أَصْغَرُ الْقَوْمِ فَسَكَتُّ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هِيَ النَّخْلَةُ ‏\"‏‏.‏"
      },
      {
        "id": 73,
        "hadith_number": "73",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Jangan Ingin Menyerupai Seseorang Kecuali dalam Dua Keadaan",
        "perawi_melayu": "Dikisahkan oleh `Abdullah bin Mas`ud:",
        "english_text": "The Prophet (ﷺ) said, \"Do not wish to be like anyone except in two cases. (The first is) A person, whom Allah has given wealth and he spends it righteously; (the second is) the one whom Allah has given wisdom (the Holy Qur'an) and he acts according to it and teaches it to others.\" (Fath-al-Bari page 177 Vol. 1)",
        "malay_translation": "Rasulullah SAW bersabda, \"Janganlah engkau iri hati kepada seseorang kecuali dalam dua perkara. Pertama, orang yang Allah berikan kekayaan dan dia membelanjakannya dengan cara yang benar; kedua, orang yang Allah berikan hikmah (Al-Quran) dan dia mengamalkannya serta mengajarkannya kepada orang lain.\" (Fath-al-Bari halaman 177 Jilid 1)",
        "arabic_text": "حَدَّثَنَا الْحُمَيْدِيُّ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، عَلَى غَيْرِ مَا حَدَّثَنَاهُ الزُّهْرِيُّ، قَالَ سَمِعْتُ قَيْسَ بْنَ أَبِي حَازِمٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ حَسَدَ إِلاَّ فِي اثْنَتَيْنِ رَجُلٌ آتَاهُ اللَّهُ مَالاً فَسُلِّطَ عَلَى هَلَكَتِهِ فِي الْحَقِّ، وَرَجُلٌ آتَاهُ اللَّهُ الْحِكْمَةَ، فَهْوَ يَقْضِي بِهَا وَيُعَلِّمُهَا ‏\"‏‏.‏"
      },
      {
        "id": 74,
        "hadith_number": "74",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perbezaan Pendapat Mengenai Sahabat Nabi Musa a.s. dan Pertemuan dengan Al-Khadir",
        "perawi_melayu": "Dikisahkan oleh Ibn `Abbas:",
        "english_text": "That he differed with Hur bin Qais bin Hisn Al-Fazari regarding the companion of (the Prophet) Moses. Ibn `Abbas said that he was Al Khadir. Meanwhile, Ubai bin Ka`b passed by them and Ibn `Abbas called him, saying \"My friend (Hur) and I have differed regarding Moses' companion, whom Moses asked the way to meet. Have you heard the Prophet (ﷺ) mentioning something about him? He said, \"Yes. I heard Allah's Messenger (ﷺ) saying, \"While Moses was sitting in the company of some Israelites, a man came and asked him. \"Do you know anyone who is more learned than you? Moses replied: \"No.\" So Allah sent the Divine Inspiration to Moses: 'Yes, Our slave Khadir (is more learned than you.)' Moses asked (Allah) how to meet him (Khadir). So Allah made the fish as a sign for him and he was told that when the fish was lost, he should return (to the place where he had lost it) and there he would meet him (Al-Khadir). So Moses went on looking for the sign of the fish in the sea. The servant-boy of Moses said to him: Do you remember when we betook ourselves to the rock, I indeed forgot the fish, none but Satan made me forget to remember it. On that Moses said: 'That is what we have been seeking? (18.64) So they went back retracing their footsteps, and found Khadir. (And) what happened further to them is narrated in the Holy Qur'an by Allah. (18.54 up to 18.82)",
        "malay_translation": "Diceritakan bahawa beliau berbeza pendapat dengan Hur bin Qais bin Hisn Al-Fazari mengenai sahabat Nabi Musa a.s. Ibn `Abbas berkata bahawa beliau adalah Al-Khadir. Sementara itu, Ubai bin Ka`b melewati mereka dan Ibn `Abbas memanggilnya, sambil berkata, \"Aku dan sahabatku (Hur) berselisih pendapat mengenai sahabat Musa a.s., yang mana Musa bertanya cara untuk bertemu. Adakah engkau mendengar Rasulullah menyebutkan sesuatu mengenainya? Dia menjawab, \"Ya. Aku mendengar Rasulullah SAW bersabda, \"Ketika Musa a.s. duduk bersama beberapa orang Bani Israel, seorang lelaki datang dan bertanya kepadanya. \"Adakah engkau mengetahui seseorang yang lebih alim daripadamu?\" Musa menjawab: \"Tidak.\" Maka Allah mengutus wahyu kepada Musa: 'Ya, hamba Kami Al-Khadir lebih alim daripada engkau.' Musa bertanya (kepada Allah) bagaimana cara bertemu dengannya (Al-Khadir). Maka Allah menjadikan ikan sebagai tanda untuknya dan diberitahu bahawa apabila ikan itu hilang, dia harus kembali (ke tempat dia kehilangannya) dan di situ dia akan bertemu dengannya (Al-Khadir). Maka Musa terus mencari tanda ikan di laut. Anak buah Musa berkata kepadanya: Ingatkah engkau ketika kita menuju ke batu, aku benar-benar melupakan ikan itu, tiada siapa selain Syaitan yang membuatku melupakannya. Maka Musa berkata: 'Inilah yang kita cari? (18.64) Maka mereka kembali menjejaki langkah mereka, dan menemui Al-Khadir. Dan apa yang berlaku selanjutnya kepada mereka diceritakan dalam Al-Quran oleh Allah. (18.54 hingga 18.82)",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ غُرَيْرٍ الزُّهْرِيُّ، قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنِي أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، حَدَّثَ أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ أَخْبَرَهُ عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ تَمَارَى هُوَ وَالْحُرُّ بْنُ قَيْسِ بْنِ حِصْنٍ الْفَزَارِيُّ فِي صَاحِبِ مُوسَى قَالَ ابْنُ عَبَّاسٍ هُوَ خَضِرٌ‏.‏ فَمَرَّ بِهِمَا أُبَىُّ بْنُ كَعْبٍ، فَدَعَاهُ ابْنُ عَبَّاسٍ فَقَالَ إِنِّي تَمَارَيْتُ أَنَا وَصَاحِبِي، هَذَا فِي صَاحِبِ مُوسَى الَّذِي سَأَلَ مُوسَى السَّبِيلَ إِلَى لُقِيِّهِ، هَلْ سَمِعْتَ النَّبِيَّ صلى الله عليه وسلم يَذْكُرُ شَأْنَهُ قَالَ نَعَمْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ بَيْنَمَا مُوسَى فِي مَلإٍ مِنْ بَنِي إِسْرَائِيلَ، جَاءَهُ رَجُلٌ فَقَالَ هَلْ تَعْلَمُ أَحَدًا أَعْلَمَ مِنْكَ قَالَ مُوسَى لاَ‏.‏ فَأَوْحَى اللَّهُ إِلَى مُوسَى بَلَى، عَبْدُنَا خَضِرٌ، فَسَأَلَ مُوسَى السَّبِيلَ إِلَيْهِ، فَجَعَلَ اللَّهُ لَهُ الْحُوتَ آيَةً، وَقِيلَ لَهُ إِذَا فَقَدْتَ الْحُوتَ فَارْجِعْ، فَإِنَّكَ سَتَلْقَاهُ، وَكَانَ يَتَّبِعُ أَثَرَ الْحُوتِ فِي الْبَحْرِ، فَقَالَ لِمُوسَى فَتَاهُ أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ فَإِنِّي نَسِيتُ الْحُوتَ، وَمَا أَنْسَانِيهِ إِلاَّ الشَّيْطَانُ أَنْ أَذْكُرَهُ‏.‏ قَالَ ذَلِكَ مَا كُنَّا نَبْغِي، فَارْتَدَّا عَلَى آثَارِهِمَا قَصَصًا، فَوَجَدَا خَضِرًا‏.‏ فَكَانَ مِنْ شَأْنِهِمَا الَّذِي قَصَّ اللَّهُ ـ عَزَّ وَجَلَّ ـ فِي كِتَابِهِ ‏\"‏‏.‏"
      },
      {
        "id": 75,
        "hadith_number": "75",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi SAW Merangkul dan Mendoakan Ilmu Al-Quran",
        "perawi_melayu": "Dikisahkan oleh Ibnu 'Abbas:",
        "english_text": "Once the Prophet (ﷺ) embraced me and said, \"O Allah! Bestow on him the knowledge of the Book (Qur'an).\"",
        "malay_translation": "Suatu ketika Nabi SAW merangkul saya dan bersabda, \"Ya Allah, limpahkanlah ilmu Al-Quran kepadanya.\"",
        "arabic_text": "حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ ضَمَّنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏ \"‏ اللَّهُمَّ عَلِّمْهُ الْكِتَابَ ‏\"‏‏.‏"
      },
      {
        "id": 76,
        "hadith_number": "76",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Melakukan Solat di Mina dan Membiarkan Unta Meragut",
        "perawi_melayu": "Ibnu Abbas meriwayatkan:",
        "english_text": "Sekali aku datang menunggang seekor keldai betina dan telah mencapai usia baligh. Rasulullah SAW sedang menunaikan solat di Mina. Tiada dinding di hadapan baginda dan aku melalui beberapa saf semasa mereka sedang menunaikan solat. Di situ aku melepaskan keldai betina itu untuk meragut rumput dan masuk ke dalam saf, dan tiada seorang pun yang keberatan dengannya.",
        "malay_translation": "Suatu ketika aku datang menunggang seekor keldai betina dan telah mencapai usia baligh. Rasulullah SAW sedang menunaikan solat di Mina. Tiada dinding di hadapan baginda dan aku melintas di antara beberapa saf semasa mereka sedang menunaikan solat. Di situ aku melepaskan keldai betina itu untuk meragut rumput dan masuk ke dalam saf, dan tiada seorang pun yang keberatan dengannya.",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، قَالَ أَقْبَلْتُ رَاكِبًا عَلَى حِمَارٍ أَتَانٍ، وَأَنَا يَوْمَئِذٍ قَدْ نَاهَزْتُ الاِحْتِلاَمَ، وَرَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي بِمِنًى إِلَى غَيْرِ جِدَارٍ، فَمَرَرْتُ بَيْنَ يَدَىْ بَعْضِ الصَّفِّ وَأَرْسَلْتُ الأَتَانَ تَرْتَعُ، فَدَخَلْتُ فِي الصَّفِّ، فَلَمْ يُنْكَرْ ذَلِكَ عَلَىَّ‏.‏"
      },
      {
        "id": 77,
        "hadith_number": "77",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi SAW Mencuci Muka Kanak-kanak dengan Air dari Timba",
        "perawi_melayu": "Dikisahkan oleh Mahmud bin Rabi`a:",
        "english_text": "When I was a boy of five, I remember, the Prophet (ﷺ) took water from a bucket (used for getting water out of a well) with his mouth and threw it on my face.",
        "malay_translation": "Ketika saya masih kanak-kanak berusia lima tahun, saya teringat, Nabi SAW mengambil air dari timba (yang digunakan untuk mengambil air dari telaga) dengan mulut baginda dan menyiramkan air itu ke muka saya.",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا أَبُو مُسْهِرٍ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ حَرْبٍ، حَدَّثَنِي الزُّبَيْدِيُّ، عَنِ الزُّهْرِيِّ، عَنْ مَحْمُودِ بْنِ الرَّبِيعِ، قَالَ عَقَلْتُ مِنَ النَّبِيِّ صلى الله عليه وسلم مَجَّةً مَجَّهَا فِي وَجْهِي وَأَنَا ابْنُ خَمْسِ سِنِينَ مِنْ دَلْوٍ‏.‏"
      },
      {
        "id": 78,
        "hadith_number": "78",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perselisihan Mengenai Sahabat Nabi (ﷺ) Musa dan Pertemuan dengan Al-Khadir",
        "perawi_melayu": "Dikisahkan oleh Ibn `Abbas:",
        "english_text": "That he differed with Hur bin Qais bin Hisn Al-Fazari regarding the companion of the Prophet (ﷺ) Moses. Meanwhile, Ubai bin Ka`b passed by them and Ibn `Abbas called him saying, \"My friend (Hur) and I have differed regarding Moses' companion whom Moses asked the way to meet. Have you heard Allah's Messenger (ﷺ) mentioning something about him? Ubai bin Ka`b said: \"Yes, I heard the Prophet (ﷺ) mentioning something about him (saying) while Moses was sitting in the company of some Israelites, a man came and asked him: \"Do you know anyone who is more learned than you? Moses replied: \"No.\" So Allah sent the Divine Inspiration to Moses: '--Yes, Our slave Khadir is more learned than you. Moses asked Allah how to meet him (Al-Khadir). So Allah made the fish a sign for him and he was told when the fish was lost, he should return (to the place where he had lost it) and there he would meet him (Al-Khadir). So Moses went on looking for the sign of the fish in the sea. The servant-boy of Moses said: 'Do you remember when we betook ourselves to the rock, I indeed forgot the fish, none but Satan made me forget to remember it. On that Moses said, 'That is what we have been seeking.' So they went back retracing their footsteps, and found Khadir. (and) what happened further about them is narrated in the Holy Qur'an by Allah.\" (18.54 up to 18.82)",
        "malay_translation": "Dikatakan bahawa beliau berselisih faham dengan Hur bin Qais bin Hisn Al-Fazari mengenai sahabat Nabi (ﷺ) Musa. Sementara itu, Ubai bin Ka`b lalu di hadapan mereka dan Ibn `Abbas memanggilnya, \"Teman saya (Hur) dan saya berselisih pendapat mengenai sahabat Musa yang mana Musa bertanya jalan untuk menemuinya. Adakah engkau telah mendengar Rasulullah (ﷺ) menceritakan sesuatu tentangnya?\" Ubai bin Ka`b berkata, \"Ya, saya mendengar Rasulullah (ﷺ) menceritakan sesuatu tentangnya (dengan berkata) ketika Musa sedang duduk bersama beberapa orang Bani Israil, seorang lelaki datang dan bertanya kepadanya, \"Adakah engkau mengetahui sesiapa yang lebih alim daripada engkau?\" Musa menjawab, \"Tidak.\" Maka Allah menurunkan wahyu kepada Musa: '--Ya, hamba Kami Khadir lebih alim daripada engkau.' Musa meminta Allah bagaimana untuk menemuinya (Al-Khadir). Maka Allah menjadikan ikan sebagai tanda baginya dan diberitahu bahawa apabila ikan itu hilang, dia perlu kembali (ke tempat dia kehilangannya) dan di situ dia akan bertemu dengannya (Al-Khadir). Maka Musa terus mencari tanda ikan di laut. Anak buah Musa berkata, 'Ingatkah kamu ketika kita menuju ke batu itu, aku sesungguhnya telah melupakan ikan itu, tiada siapa melainkan syaitan yang membuat aku melupakan untuk mengingatnya.' Maka kata Musa, 'Itulah yang kita cari.' Maka mereka kembali menjejak langkah mereka, dan mendapati Khadir. (Dan) apa yang berlaku selanjutnya mengenai mereka diceritakan dalam Al-Quran oleh Allah.",
        "arabic_text": "حَدَّثَنَا أَبُو الْقَاسِمِ، خَالِدُ بْنُ خَلِيٍّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، قَالَ قَالَ الأَوْزَاعِيُّ أَخْبَرَنَا الزُّهْرِيُّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ تَمَارَى هُوَ وَالْحُرُّ بْنُ قَيْسِ بْنِ حِصْنٍ الْفَزَارِيُّ فِي صَاحِبِ مُوسَى، فَمَرَّ بِهِمَا أُبَىُّ بْنُ كَعْبٍ، فَدَعَاهُ ابْنُ عَبَّاسٍ فَقَالَ إِنِّي تَمَارَيْتُ أَنَا وَصَاحِبِي هَذَا فِي صَاحِبِ مُوسَى الَّذِي سَأَلَ السَّبِيلَ إِلَى لُقِيِّهِ، هَلْ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَذْكُرُ شَأْنَهُ فَقَالَ أُبَىٌّ نَعَمْ، سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَذْكُرُ شَأْنَهُ يَقُولُ ‏ \"‏ بَيْنَمَا مُوسَى فِي مَلإٍ مِنْ بَنِي إِسْرَائِيلَ، إِذْ جَاءَهُ رَجُلٌ فَقَالَ أَتَعْلَمُ أَحَدًا أَعْلَمَ مِنْكَ قَالَ مُوسَى لاَ‏.‏ فَأَوْحَى اللَّهُ عَزَّ وَجَلَّ إِلَى مُوسَى بَلَى، عَبْدُنَا خَضِرٌ، فَسَأَلَ السَّبِيلَ إِلَى لُقِيِّهِ، فَجَعَلَ اللَّهُ لَهُ الْحُوتَ آيَةً، وَقِيلَ لَهُ إِذَا فَقَدْتَ الْحُوتَ فَارْجِعْ، فَإِنَّكَ سَتَلْقَاهُ، فَكَانَ مُوسَى صلى الله عليه وسلم يَتَّبِعُ أَثَرَ الْحُوتِ فِي الْبَحْرِ‏.‏ فَقَالَ فَتَى مُوسَى لِمُوسَى أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ فَإِنِّي نَسِيتُ الْحُوتَ، وَمَا أَنْسَانِيهِ إِلاَّ الشَّيْطَانُ أَنْ أَذْكُرَهُ‏.‏ قَالَ مُوسَى ذَلِكَ مَا كُنَّا نَبْغِي‏.‏ فَارْتَدَّا عَلَى آثَارِهِمَا قَصَصًا، فَوَجَدَا خَضِرًا، فَكَانَ مِنْ شَأْنِهِمَا مَا قَصَّ اللَّهُ فِي كِتَابِهِ ‏\"‏‏.‏"
      },
      {
        "id": 79,
        "hadith_number": "79",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perumpamaan Petunjuk dan Ilmu yang Dibawa Rasulullah SAW",
        "perawi_melayu": "Dikisahkan oleh Abu Musa",
        "english_text": "The Prophet (ﷺ) said, \"The example of guidance and knowledge with which Allah has sent me is like abundant rain falling on the earth, some of which was fertile soil that absorbed rain water and brought forth vegetation and grass in abundance. (And) another portion of it was hard and held the rain water and Allah benefited the people with it and they utilized it for drinking, making their animals drink from it and for irrigation of the land for cultivation. (And) a portion of it was barren which could neither hold the water nor bring forth vegetation (then that land gave no benefits). The first is the example of the person who comprehends Allah's religion and gets benefit (from the knowledge) which Allah has revealed through me (the Prophets and learns and then teaches others. The last example is that of a person who does not care for it and does not take Allah's guidance revealed through me (He is like that barren land.)\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Perumpamaan petunjuk dan ilmu yang Allah SWT telah utus melalui aku adalah seperti hujan lebat yang turun ke bumi. Sebagian bumi itu subur, menyerap air hujan dan menumbuhkan tumbuh-tumbuhan dan rumput dengan banyak. Sebagian lagi keras dan menahan air hujan, dan Allah memberikan manfaat kepada manusia melalui air itu, dan mereka menggunakannya untuk minum, menyirami binatang ternak mereka, dan mengairi tanah untuk pertanian. Sebagian lagi adalah tanah tandus yang tidak dapat menahan air dan tidak dapat menumbuhkan tumbuhan (maka tanah itu tidak memberikan manfaat). Contoh yang pertama adalah orang yang memahami agama Allah dan mendapatkan manfaat (dari ilmu) yang Allah telah wahyukan melalui aku (para Nabi) dan mempelajari serta kemudian mengajarkan kepada orang lain. Contoh terakhir adalah orang yang tidak peduli dan tidak menerima petunjuk Allah yang diwahyukan melalui aku (Dia seperti tanah tandus itu).\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَثَلُ مَا بَعَثَنِي اللَّهُ بِهِ مِنَ الْهُدَى وَالْعِلْمِ كَمَثَلِ الْغَيْثِ الْكَثِيرِ أَصَابَ أَرْضًا، فَكَانَ مِنْهَا نَقِيَّةٌ قَبِلَتِ الْمَاءَ، فَأَنْبَتَتِ الْكَلأَ وَالْعُشْبَ الْكَثِيرَ، وَكَانَتْ مِنْهَا أَجَادِبُ أَمْسَكَتِ الْمَاءَ، فَنَفَعَ اللَّهُ بِهَا النَّاسَ، فَشَرِبُوا وَسَقَوْا وَزَرَعُوا، وَأَصَابَتْ مِنْهَا طَائِفَةً أُخْرَى، إِنَّمَا هِيَ قِيعَانٌ لاَ تُمْسِكُ مَاءً، وَلاَ تُنْبِتُ كَلأً، فَذَلِكَ مَثَلُ مَنْ فَقِهَ فِي دِينِ اللَّهِ وَنَفَعَهُ مَا بَعَثَنِي اللَّهُ بِهِ، فَعَلِمَ وَعَلَّمَ، وَمَثَلُ مَنْ لَمْ يَرْفَعْ بِذَلِكَ رَأْسًا، وَلَمْ يَقْبَلْ هُدَى اللَّهِ الَّذِي أُرْسِلْتُ بِهِ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ قَالَ إِسْحَاقُ وَكَانَ مِنْهَا طَائِفَةٌ قَيَّلَتِ الْمَاءَ‏.‏ قَاعٌ يَعْلُوهُ الْمَاءُ، وَالصَّفْصَفُ الْمُسْتَوِي مِنَ الأَرْضِ‏.‏"
      },
      {
        "id": 80,
        "hadith_number": "80",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Tanda-tanda Kiamat: Hilangnya Ilmu Agama dan Berkembangnya Kezaliman",
        "perawi_melayu": "Dikisahkan oleh Anas:",
        "english_text": "Allah's Messenger (ﷺ) said, \"From among the portents of the Hour are (the following): \r\n1. Religious knowledge will be taken away (by the death of Religious learned men). \r\n2. (Religious) ignorance will prevail.\r\n3. Drinking of Alcoholic drinks (will be very common).\r\n4. There will be prevalence of open illegal sexual intercourse.",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Di antara tanda-tanda berakhirnya dunia (kiamat) ialah: \r\n1. Ilmu agama akan dihilangkan (oleh kematian ulama). \r\n2. Kebodohan (berkaitan agama) akan merata.\r\n3. Minuman keras akan menjadi meluas.\r\n4. Perzinaan terbuka akan berleluasa.",
        "arabic_text": "حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ أَبِي التَّيَّاحِ، عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ يُرْفَعَ الْعِلْمُ، وَيَثْبُتَ الْجَهْلُ، وَيُشْرَبَ الْخَمْرُ، وَيَظْهَرَ الزِّنَا ‏\"‏‏.‏"
      },
      {
        "id": 81,
        "hadith_number": "81",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Tanda-tanda Kiamat: Kemerosotan Ilmu dan Pertambahan Wanita",
        "perawi_melayu": "Dikisahkan oleh Anas:",
        "english_text": "I will narrate to you a Hadith and none other than I will tell you about after it. I heard Allah's Messenger (ﷺ) saying: From among the portents of the Hour are (the following): \r\n1. Religious knowledge will decrease (by the death of religious learned men). \r\n2. Religious ignorance will prevail. \r\n3. There will be prevalence of open illegal sexual intercourse. \r\n4. Women will increase in number and men will decrease in number so much so that fifty women will be looked after by one man.",
        "malay_translation": "Aku akan meriwayatkan sebuah Hadith kepadamu dan tiada yang lain akan aku ceritakan selainnya. Aku mendengar Rasulullah SAW bersabda: Di antara tanda-tanda Hari Kiamat adalah: \r\n1. Ilmu agama akan berkurang (kerana kematian ulama). \r\n2. Kejahilan agama akan tersebar luas. \r\n3. Perbuatan zina terbuka akan merajalela. \r\n4. Wanita akan bertambah banyak dan lelaki akan berkurang sehingga lima puluh wanita dijaga oleh seorang lelaki.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ لأُحَدِّثَنَّكُمْ حَدِيثًا لاَ يُحَدِّثُكُمْ أَحَدٌ بَعْدِي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ يَقِلَّ الْعِلْمُ، وَيَظْهَرَ الْجَهْلُ، وَيَظْهَرَ الزِّنَا، وَتَكْثُرَ النِّسَاءُ وَيَقِلَّ الرِّجَالُ، حَتَّى يَكُونَ لِخَمْسِينَ امْرَأَةً الْقَيِّمُ الْوَاحِدُ ‏\"‏‏.‏"
      },
      {
        "id": 82,
        "hadith_number": "82",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Tafsir Mimpi Susu dan Ilmu",
        "perawi_melayu": "Dikisahkan oleh Ibn `Umar:",
        "english_text": "Allah's Messenger (ﷺ) said, \"While I was sleeping, I saw that a cup full of milk was brought to me and I drank my fill till I noticed (the milk) its wetness coming out of my nails. Then I gave the remaining milk to `Umar Ibn Al-Khattab\" The companions of the Prophet (ﷺ) asked, \"What have you interpreted (about this dream)? \"O Allah's Messenger (ﷺ) ,!\" he replied, \"(It is religious) knowledge.\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Ketika aku tidur, aku melihat sebuah cawan berisi susu dihidangkan kepadaku dan aku meminumnya hingga aku melihat kelembapan susu itu sampai ke kuku-kuku tanganku. Kemudian aku memberikan sisa susu itu kepada `Umar ibn Al-Khattab.\" Para sahabat bertanya, \"Apa tafsiran mimpi ini, wahai Rasulullah SAW?\" Beliau menjawab, \"(Ia melambangkan) ilmu agama.",
        "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، عَنْ حَمْزَةَ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ ابْنَ عُمَرَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَا أَنَا نَائِمٌ أُتِيتُ بِقَدَحِ لَبَنٍ، فَشَرِبْتُ حَتَّى إِنِّي لأَرَى الرِّيَّ يَخْرُجُ فِي أَظْفَارِي، ثُمَّ أَعْطَيْتُ فَضْلِي عُمَرَ بْنَ الْخَطَّابِ ‏\"‏‏.‏ قَالُوا فَمَا أَوَّلْتَهُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الْعِلْمَ ‏\"‏‏.‏"
      },
      {
        "id": 83,
        "hadith_number": "83",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukum Menjalankan Ibadah Haji Jika Tersilap Waktu",
        "perawi_melayu": "Dikisahkan oleh `Abdullah bin `Amr bin Al `Aas",
        "english_text": "Allah's Messenger (ﷺ) stopped (for a while near the Jimar) at Mina during his last Hajj for the people and they were asking him questions. A man came and said, \"I forgot and got my head shaved before slaughtering the Hadi (sacrificing animal).\" The Prophet (ﷺ) said, \"There is no harm, go and do the slaughtering now.\" Then another person came and said, \"I forgot and slaughtered (the camel) before Rami (throwing of the pebbles) at the Jamra.\" The Prophet (ﷺ) said, \"Do the Rami now and there is no harm.\" The narrator added: So on that day, when the Prophet (ﷺ) was asked about anything (as regards the ceremonies of Hajj) performed before or after its due time, his reply was: \"Do it (now) and there is no harm.\"",
        "malay_translation": "Utusan Allah (ﷺ) berhenti sebentar di Mina ketika mengerjakan Haji terakhirnya untuk menjawab pertanyaan orang ramai. Seorang lelaki datang dan berkata, \"Saya lupa dan telah mencukur kepala sebelum menyembelih Hadi (hewan korban).\" Nabi (ﷺ) menjawab, \"Tidak mengapa, pergilah dan sembelih sekarang.\" Kemudian, orang lain datang dan berkata, \"Saya lupa dan menyembelih (unta) sebelum Rami (melempar batu) ke Jamrah.\" Nabi (ﷺ) bersabda, \"Lakukan Rami sekarang dan tidak mengapa.\" Perawi menambahkan: Oleh itu, pada hari itu, apabila Nabi (ﷺ) ditanya mengenai sebarang amalan haji yang dilakukan sebelum atau selepas waktunya, jawapan baginda adalah: \"Lakukan sekarang dan tidak mengapa.\"",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عِيسَى بْنِ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَقَفَ فِي حَجَّةِ الْوَدَاعِ بِمِنًى لِلنَّاسِ يَسْأَلُونَهُ، فَجَاءَهُ رَجُلٌ فَقَالَ لَمْ أَشْعُرْ فَحَلَقْتُ قَبْلَ أَنْ أَذْبَحَ‏.‏ فَقَالَ ‏\"‏ اذْبَحْ وَلاَ حَرَجَ ‏\"‏‏.‏ فَجَاءَ آخَرُ فَقَالَ لَمْ أَشْعُرْ، فَنَحَرْتُ قَبْلَ أَنْ أَرْمِيَ‏.‏ قَالَ ‏\"‏ ارْمِ وَلاَ حَرَجَ ‏\"‏‏.‏ فَمَا سُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنْ شَىْءٍ قُدِّمَ وَلاَ أُخِّرَ إِلاَّ قَالَ افْعَلْ وَلاَ حَرَجَ‏.‏"
      },
      {
        "id": 84,
        "hadith_number": "84",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Tidak Dilarang Menyembelih Sebelum Melakukan Rami dan Menggunting Rambut Sebelum Sembelihan",
        "perawi_melayu": "Dikisahkan oleh Ibn `Abbas:",
        "english_text": "Somebody said to the Prophet (during his last Hajj), \"I did the slaughtering before doing the Rami.' The Prophet (ﷺ) beckoned with his hand and said, \"There is no harm in that.\" Then another person said. \"I got my head shaved before offering the sacrifice.\" The Prophet (ﷺ) beckoned with his hand saying, \"There is no harm in that.\"",
        "malay_translation": "Seseorang bertanya kepada Nabi (sewaktu Haji terakhirnya), \"Saya menyembelih sebelum melakukan Rami.\" Nabi (ﷺ) memberi isyarat dengan tangannya dan bersabda, \"Tidak mengapa.\" Kemudian orang lain berkata, \"Saya mencukur kepala sebelum sembelihan.\" Nabi (ﷺ) memberi isyarat dengan tangannya dan bersabda, \"Tidak mengapa.\"",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا وُهَيْبٌ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم سُئِلَ فِي حَجَّتِهِ فَقَالَ ذَبَحْتُ قَبْلَ أَنْ أَرْمِيَ، فَأَوْمَأَ بِيَدِهِ قَالَ وَلاَ حَرَجَ‏.‏ قَالَ حَلَقْتُ قَبْلَ أَنْ أَذْبَحَ‏.‏ فَأَوْمَأَ بِيَدِهِ وَلاَ حَرَجَ‏.‏"
      },
      {
        "id": 85,
        "hadith_number": "85",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hilangnya Ilmu dan Bertambahnya Kezaliman",
        "perawi_melayu": "Daripada Abu Hurairah:",
        "english_text": "The Prophet (ﷺ) said, \"(Religious) knowledge will be taken away (by the death of religious scholars) ignorance (in religion) and afflictions will appear; and Harj will increase.\" It was asked, \"What is Harj, O Allah's Messenger (ﷺ)?\" He replied by beckoning with his hand indicating \"killing.\" (Fath-al-Bari Page 192, Vol. 1)",
        "malay_translation": "Nabi (ﷺ) bersabda, \"Ilmu akan dicabut (dengan kematian ulama) dan kebodohan (dalam agama) serta bala bencana akan muncul; dan Harj akan bertambah.\"  Ditanya, \"Apakah Harj, wahai Rasulullah (ﷺ)?\" Baginda menjawab dengan isyarat tangan yang bermakna 'pembunuhan.' (Fath-al-Bari Page 192, Jilid 1)",
        "arabic_text": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، قَالَ أَخْبَرَنَا حَنْظَلَةُ بْنُ أَبِي سُفْيَانَ، عَنْ سَالِمٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ يُقْبَضُ الْعِلْمُ، وَيَظْهَرُ الْجَهْلُ وَالْفِتَنُ، وَيَكْثُرُ الْهَرْجُ ‏\"‏‏.‏ قِيلَ يَا رَسُولَ اللَّهِ وَمَا الْهَرْجُ فَقَالَ هَكَذَا بِيَدِهِ، فَحَرَّفَهَا، كَأَنَّهُ يُرِيدُ الْقَتْلَ‏.‏"
      },
      {
        "id": 86,
        "hadith_number": "86",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Penglihatan Keadaan Akhirat dalam Doa Gerhana dan Ujian di Kubur",
        "perawi_melayu": "Dikisahkan oleh Asma':",
        "english_text": "I came to `Aisha while she was praying, and said to her, \"What has happened to the people?\" She pointed out towards the sky. (I looked towards the mosque), and saw the people offering the prayer. Aisha said, \"Subhan Allah.\" I said to her, \"Is there a sign?\" She nodded with her head meaning, \"Yes.\" I, too, then stood (for the prayer of eclipse) till I became (nearly) unconscious and later on I poured water on my head. After the prayer, the Prophet (ﷺ) praised and glorified Allah and then said, \"Just now at this place I have seen what I have never seen before, including Paradise and Hell. No doubt it has been inspired to me that you will be put to trials in your graves and these trials will be like the trials of Masih-ad-Dajjal or nearly like it (the sub narrator is not sure which expression Asma' used). You will be asked, 'What do you know about this man (the Prophet (ﷺ) Muhammad)?' Then the faithful believer (or Asma' said a similar word) will reply, 'He is Muhammad Allah's Messenger (ﷺ) who had come to us with clear evidences and guidance and so we accepted his teachings and followed him. And he is Muhammad.' And he will repeat it thrice. Then the angels will say to him, 'Sleep in peace as we have come to know that you were a faithful believer.' On the hand, a hypocrite or a doubtful person will reply, 'I do not know, but I heard the people saying something and so I said it.' (the same). \"",
        "malay_translation": "Aku datang kepada `Aisha ketika dia sedang bersembahyang, dan bertanya kepadanya, \"Apa yang telah terjadi pada orang ramai?\" Dia menunjuk ke arah langit. (Aku memandang ke arah masjid), dan melihat orang ramai menunaikan solat. Aisha berkata, \"Subhanallah.\" Aku bertanya kepadanya, \"Adakah tanda?\" Dia mengangguk kepalanya yang bermaksud, \"Ya.\" Aku juga kemudian berdiri (untuk solat gerhana) sehingga hampir tidak sedarkan diri, dan kemudian mencurahkan air ke kepala. Selepas solat, Nabi (ﷺ) memuji dan mengagungkan Allah dan kemudian bersabda, \"Baru-baru ini di tempat ini aku telah melihat sesuatu yang tidak pernah aku lihat sebelumnya, termasuk Syurga dan Neraka. Sesungguhnya aku telah diilhamkan bahawa kamu akan diuji di kuburmu, dan ujian itu akan seperti ujian Masih al-Dajjal atau hampir sama (pencerita kedua tidak pasti ungkapan yang digunakan oleh Asma'). Kamu akan ditanya, 'Apa yang kamu ketahui tentang orang ini (Nabi (ﷺ) Muhammad)?' Maka orang yang beriman akan menjawab, 'Beliau adalah Muhammad, Pesuruh Allah (ﷺ) yang datang kepada kita dengan bukti dan petunjuk yang jelas, dan oleh itu kita menerima ajarannya dan mengikutinya. Dan beliau adalah Muhammad.' Dan dia akan mengulangi tiga kali. Kemudian para malaikat akan berkata kepadanya, 'Tidurlah dengan aman, kerana kita telah mengetahui bahawa engkau adalah orang yang beriman.' Sebaliknya, orang munafik atau orang yang ragu akan menjawab, 'Aku tidak tahu, tetapi aku mendengar orang ramai berkata sesuatu dan oleh itu aku mengatakannya.' (sama).",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا وُهَيْبٌ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ فَاطِمَةَ، عَنْ أَسْمَاءَ، قَالَتْ أَتَيْتُ عَائِشَةَ وَهِيَ تُصَلِّي فَقُلْتُ مَا شَأْنُ النَّاسِ فَأَشَارَتْ إِلَى السَّمَاءِ، فَإِذَا النَّاسُ قِيَامٌ، فَقَالَتْ سُبْحَانَ اللَّهِ‏.‏ قُلْتُ آيَةٌ فَأَشَارَتْ بِرَأْسِهَا، أَىْ نَعَمْ، فَقُمْتُ حَتَّى تَجَلاَّنِي الْغَشْىُ، فَجَعَلْتُ أَصُبُّ عَلَى رَأْسِي الْمَاءَ، فَحَمِدَ اللَّهَ عَزَّ وَجَلَّ النَّبِيُّ صلى الله عليه وسلم وَأَثْنَى عَلَيْهِ، ثُمَّ قَالَ ‏ \"‏ مَا مِنْ شَىْءٍ لَمْ أَكُنْ أُرِيتُهُ إِلاَّ رَأَيْتُهُ فِي مَقَامِي حَتَّى الْجَنَّةَ وَالنَّارَ، فَأُوحِيَ إِلَىَّ أَنَّكُمْ تُفْتَنُونَ فِي قُبُورِكُمْ، مِثْلَ ـ أَوْ قَرِيبًا لاَ أَدْرِي أَىَّ ذَلِكَ قَالَتْ أَسْمَاءُ ـ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، يُقَالُ مَا عِلْمُكَ بِهَذَا الرَّجُلِ فَأَمَّا الْمُؤْمِنُ ـ أَوِ الْمُوقِنُ لاَ أَدْرِي بِأَيِّهِمَا قَالَتْ أَسْمَاءُ ـ فَيَقُولُ هُوَ مُحَمَّدٌ رَسُولُ اللَّهِ جَاءَنَا بِالْبَيِّنَاتِ وَالْهُدَى، فَأَجَبْنَا وَاتَّبَعْنَا، هُوَ مُحَمَّدٌ‏.‏ ثَلاَثًا، فَيُقَالُ نَمْ صَالِحًا، قَدْ عَلِمْنَا إِنْ كُنْتَ لَمُوقِنًا بِهِ، وَأَمَّا الْمُنَافِقُ ـ أَوِ الْمُرْتَابُ لاَ أَدْرِي أَىَّ ذَلِكَ قَالَتْ أَسْمَاءُ ـ فَيَقُولُ لاَ أَدْرِي، سَمِعْتُ النَّاسَ يَقُولُونَ شَيْئًا فَقُلْتُهُ ‏\"‏‏.‏"
      },
      {
        "id": 87,
        "hadith_number": "87",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Penerimaan Delegasi Qais dan Nasihat Nabi SAW",
        "perawi_melayu": "Dikisahkan oleh Abu Jamra",
        "english_text": "I was an interpreter between the people and Ibn `Abbas. Once Ibn `Abbas said that a delegation of the tribe of `Abdul Qais came to the Prophet (ﷺ) who asked them, \"Who are the people (i.e. you)? (Or) who are the delegates?\" They replied, \"We are from the tribe of Rabi`a.\" Then the Prophet (ﷺ) said to them, \"Welcome, O people (or said, \"O delegation (of `Abdul Qais).\") Neither will you have disgrace nor will you regret.\" They said, \"We have come to you from a distant place and there is the tribe of the infidels of Mudar intervening between you and us and we cannot come to you except in the sacred month. So please order us to do something good (religious deeds) and that we may also inform our people whom we have left behind (at home) and that we may enter Paradise (by acting on them.)\" The Prophet ordered them to do four things, and forbade them from four things. He ordered them to believe in Allah Alone, the Honorable the Majestic and said to them, \"Do you know what is meant by believing in Allah Alone?\" They replied, \"Allah and His Apostle know better.\" Thereupon the Prophet (ﷺ) said, \"(That means to testify that none has the right to be worshipped but Allah and that Muhammad is His Apostle, to offer prayers perfectly, to pay Zakat, to observe fasts during the month of Ramadan, (and) to pay Al-Khumus (one fifth of the booty to be given in Allah's cause).\" Then he forbade them four things, namely Ad-Dubba.' Hantam, Muzaffat (and) An-Naqir or Muqaiyar (These were the names of pots in which alcoholic drinks used to be prepared). The Prophet (ﷺ) further said, \"Memorize them (these instructions) and tell them to the people whom you have left behind.\"",
        "malay_translation": "Saya pernah menjadi penterjemah antara masyarakat dan Ibn `Abbas.  Suatu ketika Ibn `Abbas menceritakan bahawa satu delegasi daripada puak `Abdul Qais datang menemui Nabi SAW. Nabi bertanya, \"Siapakah kalian?\" Atau, \"Siapakah delegasi ini?\" Mereka menjawab, \"Kami dari puak Rabi`a.\"  Kemudian Nabi SAW berkata kepada mereka, \"Selamat datang wahai kaum (atau, wahai delegasi `Abdul Qais).  Semoga kamu tidak dihina dan tidak menyesal.\" Mereka berkata, \"Kami datang dari jauh. Puak kafir Mudar berada di antara kita dan kalian, dan kami hanya dapat datang pada bulan-bulan suci. Oleh itu, perintahkan kami beberapa amalan kebaikan (amal ibadah) agar kami dapat menyampaikannya kepada kaum kami yang ditinggalkan dan agar kami masuk Syurga menerusi amalan tersebut.\" Nabi SAW memerintahkan mereka empat perkara dan mengharamkan empat perkara. Beliau memerintahkan mereka beriman kepada Allah Yang Maha Esa, Yang Maha Mulia dan bertanya, \"Tahukah kamu apa maksud beriman kepada Allah Yang Maha Esa?\" Mereka menjawab, \"Allah dan Rasul-Nya lebih mengetahui.\" Maka Nabi SAW menerangkan, \"(Maksudnya bersaksi tiada Tuhan yang berhak disembah melainkan Allah dan Muhammad adalah Rasul-Nya, mendirikan solat dengan sempurna, membayar zakat, berpuasa di bulan Ramadan, dan membayar khums (satu perlima rampasan perang yang wajib dihulurkan untuk Allah).\"  Kemudian baginda melarang mereka empat perkara, iaitu Ad-Dubba', Hantam, Muzaffat, dan An-Naqir atau Muqaiyar (iaitu nama-nama periuk untuk membuat minuman keras).  Nabi SAW selanjutnya bersabda, \"Hafal dan sampaikan (arahan ini) kepada kaum kamu yang ditinggalkan.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا غُنْدَرٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي جَمْرَةَ، قَالَ كُنْتُ أُتَرْجِمُ بَيْنَ ابْنِ عَبَّاسٍ وَبَيْنَ النَّاسِ فَقَالَ إِنَّ وَفْدَ عَبْدِ الْقَيْسِ أَتَوُا النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَنِ الْوَفْدُ ـ أَوْ مَنِ الْقَوْمُ ‏\"‏‏.‏ قَالُوا رَبِيعَةُ‏.‏ فَقَالَ ‏\"‏ مَرْحَبًا بِالْقَوْمِ ـ أَوْ بِالْوَفْدِ ـ غَيْرَ خَزَايَا وَلاَ نَدَامَى ‏\"‏‏.‏ قَالُوا إِنَّا نَأْتِيكَ مِنْ شُقَّةٍ بَعِيدَةٍ، وَبَيْنَنَا وَبَيْنَكَ هَذَا الْحَىُّ مِنْ كُفَّارِ مُضَرَ، وَلاَ نَسْتَطِيعُ أَنْ نَأْتِيَكَ إِلاَّ فِي شَهْرٍ حَرَامٍ فَمُرْنَا بِأَمْرٍ نُخْبِرْ بِهِ مَنْ وَرَاءَنَا، نَدْخُلُ بِهِ الْجَنَّةَ‏.‏ فَأَمَرَهُمْ بِأَرْبَعٍ، وَنَهَاهُمْ عَنْ أَرْبَعٍ أَمَرَهُمْ بِالإِيمَانِ بِاللَّهِ عَزَّ وَجَلَّ وَحْدَهُ‏.‏ قَالَ ‏\"‏ هَلْ تَدْرُونَ مَا الإِيمَانُ بِاللَّهِ وَحْدَهُ ‏\"‏‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ شَهَادَةُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَإِقَامُ الصَّلاَةِ، وَإِيتَاءُ الزَّكَاةِ، وَصَوْمُ رَمَضَانَ، وَتُعْطُوا الْخُمُسَ مِنَ الْمَغْنَمِ ‏\"‏‏.‏ وَنَهَاهُمْ عَنِ الدُّبَّاءِ وَالْحَنْتَمِ وَالْمُزَفَّتِ‏.‏ قَالَ شُعْبَةُ رُبَّمَا قَالَ النَّقِيرِ، وَرُبَّمَا قَالَ الْمُقَيَّرِ‏.‏ قَالَ ‏\"‏ احْفَظُوهُ وَأَخْبِرُوهُ مَنْ وَرَاءَكُمْ ‏\"‏‏.‏"
      },
      {
        "id": 88,
        "hadith_number": "88",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukum Perkahwinan dengan Susu Ibu",
        "perawi_melayu": "Dikisahkan oleh `Abdullah bin Abi Mulaika:",
        "english_text": "`Uqba bin Al-Harith said that he had married the daughter of Abi Ihab bin `Aziz. Later on a woman came to him and said, \"I have suckled (nursed) `Uqba and the woman whom he married (his wife) at my breast.\" `Uqba said to her, \"Neither I knew that you have suckled (nursed) me nor did you tell me.\" Then he rode over to see Allah's Messenger (ﷺ) at Medina, and asked him about it. Allah's Messenger (ﷺ) said, \"How can you keep her as a wife when it has been said (that she is your foster-sister)?\" Then `Uqba divorced her, and she married another man.",
        "malay_translation": "`Uqba bin Al-Harith menceritakan bahawa beliau telah mengahwini anak perempuan Abi Ihab bin `Aziz. Kemudian, seorang wanita datang kepadanya dan berkata, \"Aku telah menyusu `Uqba dan wanita yang dikahwininya (isterinya) di dadaku.\" `Uqba berkata kepadanya, \"Aku tidak tahu bahawa engkau telah menyusu aku dan engkau juga tidak memberitahuku.\" Kemudian, beliau pergi menemui Rasulullah SAW di Madinah dan bertanya tentang perkara ini. Rasulullah SAW bersabda, \"Bagaimanakah engkau dapat mengekalkannya sebagai isteri sedangkan dikatakan (bahawa dia adalah saudara susuanmu)?\" Kemudian `Uqba menceraikannya, dan wanita itu mengahwini lelaki lain.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا عُمَرُ بْنُ سَعِيدِ بْنِ أَبِي حُسَيْنٍ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي مُلَيْكَةَ، عَنْ عُقْبَةَ بْنِ الْحَارِثِ، أَنَّهُ تَزَوَّجَ ابْنَةً لأَبِي إِهَابِ بْنِ عَزِيزٍ، فَأَتَتْهُ امْرَأَةٌ فَقَالَتْ إِنِّي قَدْ أَرْضَعْتُ عُقْبَةَ وَالَّتِي تَزَوَّجَ بِهَا‏.‏ فَقَالَ لَهَا عُقْبَةُ مَا أَعْلَمُ أَنَّكِ أَرْضَعْتِنِي وَلاَ أَخْبَرْتِنِي‏.‏ فَرَكِبَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِالْمَدِينَةِ فَسَأَلَهُ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كَيْفَ وَقَدْ قِيلَ ‏\"‏‏.‏ فَفَارَقَهَا عُقْبَةُ، وَنَكَحَتْ زَوْجًا غَيْرَهُ‏.‏"
      },
      {
        "id": 89,
        "hadith_number": "89",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Tetangga Ansari dan Berita Wahyu Nabi SAW",
        "perawi_melayu": "Dikisahkan oleh `Umar",
        "english_text": "My Ansari neighbor from Bani Umaiya bin Zaid who used to live at `Awali Al-Medina and used to visit the Prophet (ﷺ) by turns. He used to go one day and I another day. When I went I used to bring the news of that day regarding the Divine Inspiration and other things, and when he went, he used to do the same for me. Once my Ansari friend, in his turn (on returning from the Prophet), knocked violently at my door and asked if I was there.\" I became horrified and came out to him. He said, \"Today a great thing has happened.\" I then went to Hafsa and saw her weeping. I asked her, \"Did Allah's Messenger (ﷺ) divorce you all?\" She replied, \"I do not know.\" Then, I entered upon the Prophet (ﷺ) and said while standing, \"Have you divorced your wives?\" The Prophet (ﷺ) replied in the negative. On that I said, \"Allahu-Akbar (Allah is Greater).\" (See Hadith No. 119, Vol. 3 for details)",
        "malay_translation": "Jiran saya yang Ansari dari Bani Umaiya bin Zaid yang tinggal di `Awali Al-Madinah dan sering mengunjungi Nabi SAW secara bergilir. Dia pergi sehari, dan saya sehari berikutnya. Apabila saya pergi, saya membawa berita dari hari tersebut tentang Wahyu Ilahi dan perkara lain, dan apabila dia pergi, dia melakukan perkara yang sama bagi saya. Suatu ketika, kawan Ansari saya, dalam gilirannya (setelah pulang dari Nabi SAW), mengetuk pintu saya dengan kuat dan bertanya sama ada saya ada di rumah. Saya menjadi sangat takut dan keluar menemui beliau. Beliau berkata, \"Hari ini sesuatu perkara besar telah berlaku.\" Kemudian saya pergi ke Hafsa dan mendapati beliau menangis. Saya bertanya kepadanya, \"Adakah Rasulullah SAW menceraikan semua isteri Baginda?\" Beliau menjawab, \"Saya tidak tahu.\" Kemudian, saya masuk menemui Nabi SAW dan berkata sambil berdiri, \"Adakah Baginda telah menceraikan isteri-isteri Baginda?\" Nabi SAW menjawab tidak. Maka, saya berkata, \"Allahu-Akbar (Allah Maha Besar).\" (Rujuk Hadis No. 119, Jilid 3 untuk keterangan lanjut)",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، ح قَالَ أَبُو عَبْدِ اللَّهِ وَقَالَ ابْنُ وَهْبٍ أَخْبَرَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي ثَوْرٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، عَنْ عُمَرَ، قَالَ كُنْتُ أَنَا وَجَارٌ، لِي مِنَ الأَنْصَارِ فِي بَنِي أُمَيَّةَ بْنِ زَيْدٍ، وَهْىَ مِنْ عَوَالِي الْمَدِينَةِ، وَكُنَّا نَتَنَاوَبُ النُّزُولَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم يَنْزِلُ يَوْمًا وَأَنْزِلُ يَوْمًا، فَإِذَا نَزَلْتُ جِئْتُهُ بِخَبَرِ ذَلِكَ الْيَوْمِ مِنَ الْوَحْىِ وَغَيْرِهِ، وَإِذَا نَزَلَ فَعَلَ مِثْلَ ذَلِكَ، فَنَزَلَ صَاحِبِي الأَنْصَارِيُّ يَوْمَ نَوْبَتِهِ، فَضَرَبَ بَابِي ضَرْبًا شَدِيدًا‏.‏ فَقَالَ أَثَمَّ هُوَ فَفَزِعْتُ فَخَرَجْتُ إِلَيْهِ فَقَالَ قَدْ حَدَثَ أَمْرٌ عَظِيمٌ‏.‏ قَالَ فَدَخَلْتُ عَلَى حَفْصَةَ فَإِذَا هِيَ تَبْكِي فَقُلْتُ طَلَّقَكُنَّ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَتْ لاَ أَدْرِي‏.‏ ثُمَّ دَخَلْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقُلْتُ وَأَنَا قَائِمٌ أَطَلَّقْتَ نِسَاءَكَ قَالَ ‏ \"‏ لاَ ‏\"‏‏.‏ فَقُلْتُ اللَّهُ أَكْبَرُ‏.‏"
      },
      {
        "id": 90,
        "hadith_number": "90",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kepentingan Menyingkatkan Solat Jemaah",
        "perawi_melayu": "Dikisahkan oleh Abu Mas'ud Al-Ansari",
        "english_text": "Once a man said to Allah's Messenger (ﷺ) \"O Allah's Messenger (ﷺ)! I may not attend the (compulsory congregational) prayer because so and so (the Imam) prolongs the prayer when he leads us for it. The narrator added: \"I never saw the Prophet (ﷺ) more furious in giving advice than he was on that day. The Prophet said, \"O people! Some of you make others dislike good deeds (the prayers). So whoever leads the people in prayer should shorten it because among them there are the sick the weak and the needy (having some jobs to do).",
        "malay_translation": "Suatu ketika, seorang lelaki berkata kepada Rasulullah SAW, \"Wahai Rasulullah! Saya mungkin tidak dapat menunaikan solat fardhu berjemaah kerana si fulan (imam) memanjangkan solat ketika memimpin kita. Perawi menambah, \"Saya tidak pernah melihat Rasulullah SAW lebih marah dalam memberi nasihat daripada hari itu. Baginda bersabda, \"Wahai manusia! Sebahagian dari kamu membuat orang lain tidak menyukai amalan kebaikan (solat). Oleh itu, sesiapa yang memimpin solat jemaah hendaklah memendekkannya kerana di antara mereka ada orang yang sakit, lemah dan memerlukan (mempunyai urusan duniawi).\" ",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ أَخْبَرَنَا سُفْيَانُ، عَنِ ابْنِ أَبِي خَالِدٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ، قَالَ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ، لاَ أَكَادُ أُدْرِكُ الصَّلاَةَ مِمَّا يُطَوِّلُ بِنَا فُلاَنٌ، فَمَا رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم فِي مَوْعِظَةٍ أَشَدَّ غَضَبًا مِنْ يَوْمِئِذٍ فَقَالَ ‏ \"‏ أَيُّهَا النَّاسُ، إِنَّكُمْ مُنَفِّرُونَ، فَمَنْ صَلَّى بِالنَّاسِ فَلْيُخَفِّفْ، فَإِنَّ فِيهِمُ الْمَرِيضَ وَالضَّعِيفَ وَذَا الْحَاجَةِ ‏\"‏‏.‏"
      },
      {
        "id": 91,
        "hadith_number": "91",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Panduan Mengurus Barang Hilang dan Binatang Terlepas",
        "perawi_melayu": "Dikisahkan oleh Zaid bin Khalid Al-Juhani:",
        "english_text": "A man asked the Prophet (ﷺ) about the picking up of a \"Luqata\" (fallen lost thing). The Prophet (ﷺ) replied, \"Recognize and remember its tying material and its container, and make public announcement (about it) for one year, then utilize it but give it to its owner if he comes.\" Then the person asked about the lost camel. On that, the Prophet (ﷺ) got angry and his cheeks or his Face became red and he said, \"You have no concern with it as it has its water container, and its feet and it will reach water, and eat (the leaves) of trees till its owner finds it.\" The man then asked about the lost sheep. The Prophet (ﷺ) replied, \"It is either for you, for your brother (another person) or for the wolf.\"",
        "malay_translation": "Seorang lelaki bertanya kepada Nabi (ﷺ) tentang mengambil barang yang hilang (\"Luqata\"). Nabi (ﷺ) menjawab, \"Kenal pasti dan ingat tali pengikat dan bekasnya, dan umumkan (tentang barang itu) selama setahun, kemudian gunakannya tetapi berikan kepada pemiliknya jika dia datang.\" Kemudian orang itu bertanya tentang unta yang hilang.  Lalu, Nabi (ﷺ) menjadi marah dan pipinya atau mukanya memerah dan bersabda, \"Kamu tidak perlu bimbang mengenainya kerana ia memiliki bekas air, kakinya sendiri, dan ia akan mencari air, dan memakan daun-daun pokok sehingga pemiliknya menemuinya.\" Kemudian orang itu bertanya tentang kambing yang hilang. Nabi (ﷺ) menjawab, \"Ia mungkin kepunyaanmu, saudaramu (orang lain) atau untuk serigala.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا أَبُو عَامِرٍ، قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ الْمَدِينِيُّ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ يَزِيدَ، مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم سَأَلَهُ رَجُلٌ عَنِ اللُّقَطَةِ فَقَالَ ‏\"‏ اعْرِفْ وِكَاءَهَا ـ أَوْ قَالَ وِعَاءَهَا ـ وَعِفَاصَهَا، ثُمَّ عَرِّفْهَا سَنَةً، ثُمَّ اسْتَمْتِعْ بِهَا، فَإِنْ جَاءَ رَبُّهَا فَأَدِّهَا إِلَيْهِ ‏\"‏‏.‏ قَالَ فَضَالَّةُ الإِبِلِ فَغَضِبَ حَتَّى احْمَرَّتْ وَجْنَتَاهُ ـ أَوْ قَالَ احْمَرَّ وَجْهُهُ ـ فَقَالَ ‏\"‏ وَمَا لَكَ وَلَهَا مَعَهَا سِقَاؤُهَا وَحِذَاؤُهَا، تَرِدُ الْمَاءَ، وَتَرْعَى الشَّجَرَ، فَذَرْهَا حَتَّى يَلْقَاهَا رَبُّهَا ‏\"‏‏.‏ قَالَ فَضَالَّةُ الْغَنَمِ قَالَ ‏\"‏ لَكَ أَوْ لأَخِيكَ أَوْ لِلذِّئْبِ ‏\"‏‏.‏"
      },
      {
        "id": 92,
        "hadith_number": "92",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Jawapan Nabi SAW Mengenai Bapa dan Pengampunan",
        "perawi_melayu": "Dikisahkan oleh Abu Musa",
        "english_text": "The Prophet (ﷺ) was asked about things which he did not like, but when the questioners insisted, the Prophet got angry. He then said to the people, \"Ask me anything you like.\" A man asked, \"Who is my father?\" The Prophet (ﷺ) replied, \"Your father is Hudhafa.\" Then another man got up and said, \"Who is my father, O Allah's Messenger (ﷺ) ?\" He replied, \"Your father is Salim, Maula (the freed slave) of Shaiba.\" So when `Umar saw that (the anger) on the face of the Prophet (ﷺ) he said, \"O Allah's Messenger (ﷺ)! We repent to Allah (Our offending you).",
        "malay_translation": "Nabi SAW ditanya tentang perkara yang tidak disukainya, namun apabila para penanya bersikeras, Nabi SAW menjadi marah. Kemudian baginda bersabda kepada orang ramai, \"Tanya aku apa sahaja yang kalian mahu.\" Seorang lelaki bertanya, \"Siapakah bapa saya?\" Nabi SAW menjawab, \"Bapakmu adalah Hudhafa.\" Kemudian seorang lelaki lain bangun dan bertanya, \"Siapakah bapa saya, Wahai Rasulullah SAW?\" Baginda menjawab, \"Bapakmu adalah Salim, Maula (hamba yang dibebaskan) daripada Shaiba.\"  Maka apabila `Umar melihat kemarahan di wajah Nabi SAW, beliau berkata, \"Wahai Rasulullah SAW! Kami bertaubat kepada Allah (atas kesalahan kami terhadapmu).\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ سُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنْ أَشْيَاءَ كَرِهَهَا، فَلَمَّا أُكْثِرَ عَلَيْهِ غَضِبَ، ثُمَّ قَالَ لِلنَّاسِ ‏\"‏ سَلُونِي عَمَّا شِئْتُمْ ‏\"‏‏.‏ قَالَ رَجُلٌ مَنْ أَبِي قَالَ ‏\"‏ أَبُوكَ حُذَافَةُ ‏\"‏‏.‏ فَقَامَ آخَرُ فَقَالَ مَنْ أَبِي يَا رَسُولَ اللَّهِ فَقَالَ ‏\"‏ أَبُوكَ سَالِمٌ مَوْلَى شَيْبَةَ ‏\"‏‏.‏ فَلَمَّا رَأَى عُمَرُ مَا فِي وَجْهِهِ قَالَ يَا رَسُولَ اللَّهِ، إِنَّا نَتُوبُ إِلَى اللَّهِ عَزَّ وَجَلَّ‏.‏"
      },
      {
        "id": 93,
        "hadith_number": "93",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Identiti Bapa dan Ikrar Iman",
        "perawi_melayu": "Dikisahkan oleh Anas bin Malik:",
        "english_text": "One day Allah's Messenger (ﷺ) came out (before the people) and `Abdullah bin Hudhafa stood up and asked (him) \"Who is my father?\" The Prophet (ﷺ) replied, \"Your father is Hudhafa.\" The Prophet (ﷺ) told them repeatedly (in anger) to ask him anything they liked. `Umar knelt down before the Prophet (ﷺ) and said thrice, \"We accept Allah as (our) Lord and Islam as (our) religion and Muhammad as (our) Prophet.\" After that the Prophet (ﷺ) became silent.",
        "malay_translation": "Suatu hari Rasulullah SAW keluar (di hadapan orang ramai) dan `Abdullah bin Hudhafa bangun dan bertanya, \"Siapakah bapaku?\" Baginda SAW menjawab, \"Bapamu ialah Hudhafa.\" Rasulullah SAW berulang kali (dengan perasaan marah) menyuruh mereka bertanya apa sahaja yang mereka inginkan. `Umar rukuk di hadapan Rasulullah SAW dan tiga kali mengucapkan, \"Kami mengakui Allah sebagai Tuhan kami dan Islam sebagai agama kami dan Muhammad sebagai Nabi kami.\" Selepas itu, Rasulullah SAW diam.",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ، فَقَامَ عَبْدُ اللَّهِ بْنُ حُذَافَةَ فَقَالَ مَنْ أَبِي فَقَالَ ‏\"‏ أَبُوكَ حُذَافَةُ ‏\"‏‏.‏ ثُمَّ أَكْثَرَ أَنْ يَقُولَ ‏\"‏ سَلُونِي ‏\"‏‏.‏ فَبَرَكَ عُمَرُ عَلَى رُكْبَتَيْهِ فَقَالَ رَضِينَا بِاللَّهِ رَبًّا، وَبِالإِسْلاَمِ دِينًا، وَبِمُحَمَّدٍ صلى الله عليه وسلم نَبِيًّا، فَسَكَتَ‏.‏"
      },
      {
        "id": 94,
        "hadith_number": "94",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Petunjuk Rasulullah SAW dalam Berinteraksi: Mengetuk Pintu dan Mengulangi Ucapan",
        "perawi_melayu": "Dikisahkan oleh Anas:",
        "english_text": "Whenever the Prophet (ﷺ) asked permission to enter, he knocked the door thrice with greeting and whenever he spoke a sentence (said a thing) he used to repeat it thrice. (See Hadith No. 261, Vol. 8).",
        "malay_translation": "Apabila Nabi SAW meminta izin untuk masuk, baginda akan mengetuk pintu tiga kali dengan salam. Dan setiap kali baginda berkata sesuatu, baginda akan mengulanginya sebanyak tiga kali. (Rujuk Hadis No. 261, Jilid 8).",
        "arabic_text": "حَدَّثَنَا عَبْدَةُ، قَالَ حَدَّثَنَا عَبْدُ الصَّمَدِ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا ثُمَامَةُ بْنُ عَبْدِ اللَّهِ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ إِذَا سَلَّمَ سَلَّمَ ثَلاَثًا، وَإِذَا تَكَلَّمَ بِكَلِمَةٍ أَعَادَهَا ثَلاَثًا‏.‏"
      },
      {
        "id": 95,
        "hadith_number": "95",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ketiga-tiga Ulangan Perkataan Nabi SAW dan Tukul Tiga Kali",
        "perawi_melayu": "Dikisahkan oleh Anas:",
        "english_text": "Whenever the Prophet (ﷺ) spoke a sentence (said a thing), he used to repeat it thrice so that the people could understand it properly from him and whenever he asked permission to enter, (he knocked the door) thrice with greeting.",
        "malay_translation": "Apabila Nabi SAW menyebut sesuatu perkataan, baginda akan mengulanginya sebanyak tiga kali supaya orang ramai dapat memahaminya dengan lebih baik. Dan apabila baginda meminta izin untuk masuk ke sesuatu tempat, baginda akan mengetuk pintu sebanyak tiga kali bersama salam.",
        "arabic_text": "حَدَّثَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا عَبْدُ الصَّمَدِ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا ثُمَامَةُ بْنُ عَبْدِ اللَّهِ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ إِذَا تَكَلَّمَ بِكَلِمَةٍ أَعَادَهَا ثَلاَثًا حَتَّى تُفْهَمَ عَنْهُ، وَإِذَا أَتَى عَلَى قَوْمٍ فَسَلَّمَ عَلَيْهِمْ سَلَّمَ عَلَيْهِمْ ثَلاَثًا‏.‏"
      },
      {
        "id": 96,
        "hadith_number": "96",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menjaga Tumit Dari Api Neraka",
        "perawi_melayu": "Dikisahkan oleh Abdullah bin 'Amr",
        "english_text": "Once Allah's Messenger (ﷺ) remained behind us in a journey. He joined us while we were performing ablution for the `Asr prayer which was over-due. We were just passing wet hands over our feet (not washing them properly) so the Prophet (ﷺ) addressed us in a loud voice and said twice or thrice, \"Save your heels from the fire.\"",
        "malay_translation": "Suatu ketika Rasulullah SAW tertinggal di belakang rombongan dalam perjalanan. Baginda kemudian menyusul kami ketika kami sedang berwuduk untuk solat Asar yang telah lewat. Kami hanya membasahkan kaki dengan tangan tanpa mencucinya dengan sempurna. Maka, Nabi SAW menegur kami dengan suara lantang dan berulang kali bersabda, \"Selamatkan tumitmu dari api neraka.\"",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ يُوسُفَ بْنِ مَاهَكَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ تَخَلَّفَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي سَفَرٍ سَافَرْنَاهُ فَأَدْرَكَنَا وَقَدْ أَرْهَقْنَا الصَّلاَةَ صَلاَةَ الْعَصْرِ وَنَحْنُ نَتَوَضَّأُ، فَجَعَلْنَا نَمْسَحُ عَلَى أَرْجُلِنَا، فَنَادَى بِأَعْلَى صَوْتِهِ ‏ \"‏ وَيْلٌ لِلأَعْقَابِ مِنَ النَّارِ ‏\"‏‏.‏ مَرَّتَيْنِ أَوْ ثَلاَثًا‏.‏"
      },
      {
        "id": 97,
        "hadith_number": "97",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ganjaran Ganda bagi Tiga Golongan",
        "perawi_melayu": "Dikisahkan oleh bapa Abu Burda:",
        "english_text": "Allah's Messenger (ﷺ) said \"Three persons will have a double reward: \r\n1. A Person from the people of the scriptures who believed in his prophet (Jesus or Moses) and then believed in the Prophet (ﷺ) \r\nMuhammad (i .e. has embraced Islam). \r\n2. A slave who discharges his duties to Allah and his master. \r\n3. A master of a woman-slave who teaches her good manners and educates her in the best possible way (the religion) and \r\n manumits her and then marries her.\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Tiga golongan akan mendapat ganjaran berganda:\r\n1. Seseorang daripada ahli kitab yang beriman kepada nabi mereka (Isa atau Musa) dan kemudian beriman kepada Nabi Muhammad SAW (iaitu telah memeluk Islam).\r\n2. Seorang hamba yang menunaikan tanggungjawab kepada Allah dan tuannya.\r\n3. Seorang tuan kepada hamba perempuan yang mengajarnya adab dan mendidiknya dengan sebaik-baiknya (agama) dan kemudian membebaskannya dan berkahwin dengannya.\"",
        "arabic_text": "أَخْبَرَنَا مُحَمَّدٌ ـ هُوَ ابْنُ سَلاَمٍ ـ حَدَّثَنَا الْمُحَارِبِيُّ، قَالَ حَدَّثَنَا صَالِحُ بْنُ حَيَّانَ، قَالَ قَالَ عَامِرٌ الشَّعْبِيُّ حَدَّثَنِي أَبُو بُرْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ ثَلاَثَةٌ لَهُمْ أَجْرَانِ رَجُلٌ مِنْ أَهْلِ الْكِتَابِ آمَنَ بِنَبِيِّهِ، وَآمَنَ بِمُحَمَّدٍ صلى الله عليه وسلم وَالْعَبْدُ الْمَمْلُوكُ إِذَا أَدَّى حَقَّ اللَّهِ وَحَقَّ مَوَالِيهِ، وَرَجُلٌ كَانَتْ عِنْدَهُ أَمَةٌ ‏{‏يَطَؤُهَا‏}‏ فَأَدَّبَهَا، فَأَحْسَنَ تَأْدِيبَهَا، وَعَلَّمَهَا فَأَحْسَنَ تَعْلِيمَهَا، ثُمَّ أَعْتَقَهَا فَتَزَوَّجَهَا، فَلَهُ أَجْرَانِ ‏\"‏‏.‏ ثُمَّ قَالَ عَامِرٌ أَعْطَيْنَاكَهَا بِغَيْرِ شَىْءٍ، قَدْ كَانَ يُرْكَبُ فِيمَا دُونَهَا إِلَى الْمَدِينَةِ‏.‏"
      },
      {
        "id": 98,
        "hadith_number": "98",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Memberi Ceramah Kepada Wanita dan Mereka Menunaikan Zakat",
        "perawi_melayu": "Dikisahkan oleh Ibn 'Abbas:",
        "english_text": "Once Allah's Messenger (ﷺ) came out while Bilal was accompanying him. He went towards the women thinking that they had not heard him (i.e. his sermon). So he preached them and ordered them to pay alms. (Hearing that) the women started giving alms; some donated their ear-rings, some gave their rings and Bilal was collecting them in the corner of his garment.",
        "malay_translation": "Suatu ketika, Rasulullah SAW keluar sedang Bilal diiringinya. Baginda menuju ke arah kaum wanita, mengandaikan mereka tidak mendengar khutbah Baginda. Maka Baginda menyampaikan khutbah dan memerintahkan mereka untuk membayar zakat. Mendengar perintah itu, kaum wanita mula memberi zakat; ada yang menderma anting-anting mereka, ada yang memberikan cincin mereka dan Bilal mengumpulkannya di sudut pakaiannya.",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَيُّوبَ، قَالَ سَمِعْتُ عَطَاءً، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، قَالَ أَشْهَدُ عَلَى النَّبِيِّ صلى الله عليه وسلم ـ أَوْ قَالَ عَطَاءٌ أَشْهَدُ عَلَى ابْنِ عَبَّاسٍ ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ وَمَعَهُ بِلاَلٌ، فَظَنَّ أَنَّهُ لَمْ يُسْمِعِ النِّسَاءَ فَوَعَظَهُنَّ، وَأَمَرَهُنَّ بِالصَّدَقَةِ، فَجَعَلَتِ الْمَرْأَةُ تُلْقِي الْقُرْطَ وَالْخَاتَمَ، وَبِلاَلٌ يَأْخُذُ فِي طَرَفِ ثَوْبِهِ‏.‏ وَقَالَ إِسْمَاعِيلُ عَنْ أَيُّوبَ عَنْ عَطَاءٍ وَقَالَ عَنِ ابْنِ عَبَّاسٍ أَشْهَدُ عَلَى النَّبِيِّ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 99,
        "hadith_number": "99",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Orang Yang Paling Beruntung Mendapat Syafaat Nabi pada Hari Kiamat",
        "perawi_melayu": "Dikisahkan oleh Abu Hurairah:",
        "english_text": "I said: \"O Allah's Messenger (ﷺ)! Who will be the luckiest person, who will gain your intercession on the Day of Resurrection?\" Allah's Messenger (ﷺ) said: O Abu Huraira! \"I have thought that none will ask me about it before you as I know your longing for the (learning of) Hadiths. The luckiest person who will have my intercession on the Day of Resurrection will be the one who said sincerely from the bottom of his heart \"None has the right to be worshipped but Allah.\"",
        "malay_translation": "Aku bertanya, \"Wahai Rasulullah! Siapakah orang yang paling beruntung, yang akan mendapatkan syafaatmu pada Hari Kiamat?\" Rasulullah SAW bersabda, \"Wahai Abu Hurairah, aku telah mendapati bahawa tidak ada yang menanyakannya sebelummu, kerana aku tahu kerinduanmu terhadap Hadis. Orang yang paling beruntung yang akan mendapatkan syafaatku pada Hari Kiamat adalah orang yang mengucapkan dengan ikhlas dari lubuk hatinya, 'Tidak ada Tuhan yang berhak disembah melainkan Allah.'\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي سُلَيْمَانُ، عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ قِيلَ يَا رَسُولَ اللَّهِ، مَنْ أَسْعَدُ النَّاسِ بِشَفَاعَتِكَ يَوْمَ الْقِيَامَةِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَقَدْ ظَنَنْتُ يَا أَبَا هُرَيْرَةَ أَنْ لاَ يَسْأَلَنِي عَنْ هَذَا الْحَدِيثِ أَحَدٌ أَوَّلُ مِنْكَ، لِمَا رَأَيْتُ مِنْ حِرْصِكَ عَلَى الْحَدِيثِ، أَسْعَدُ النَّاسِ بِشَفَاعَتِي يَوْمَ الْقِيَامَةِ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ، خَالِصًا مِنْ قَلْبِهِ أَوْ نَفْسِهِ ‏\"‏‏.‏"
      },
      {
        "id": 100,
        "hadith_number": "100",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kehilangan Ilmu dan Kemunculan Pemimpin Yang Tidak Berilmu",
        "perawi_melayu": "Dikisahkan oleh `Abdullah bin `Amr bin Al-`As:",
        "english_text": "I heard Allah's Messenger (ﷺ) saying, \"Allah does not take away the knowledge, by taking it away from (the hearts of) the people, but takes it away by the death of the religious learned men till when none of the (religious learned men) remains, people will take as their leaders ignorant persons who when consulted will give their verdict without knowledge. So they will go astray and will lead the people astray.\"",
        "malay_translation": "Aku mendengar Rasulullah SAW bersabda, \"Allah tidak menghilangkan ilmu dengan cara mengambilnya daripada hati manusia, tetapi Dia menghilangkannya melalui kematian para ulama sehingga apabila tidak ada lagi ulama yang tinggal, manusia akan mengambil pemimpin yang jahil sebagai pemimpin mereka. Mereka akan memberi fatwa tanpa ilmu. Maka mereka sesat dan menyesatkan orang lain.",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنَّ اللَّهَ لاَ يَقْبِضُ الْعِلْمَ انْتِزَاعًا، يَنْتَزِعُهُ مِنَ الْعِبَادِ، وَلَكِنْ يَقْبِضُ الْعِلْمَ بِقَبْضِ الْعُلَمَاءِ، حَتَّى إِذَا لَمْ يُبْقِ عَالِمًا، اتَّخَذَ النَّاسُ رُءُوسًا جُهَّالاً فَسُئِلُوا، فَأَفْتَوْا بِغَيْرِ عِلْمٍ، فَضَلُّوا وَأَضَلُّوا ‏\"‏‏. قَالَ الْفِرَبْرِيُّ حَدَّثَنَا عَبَّاسٌ قَالَ حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا جَرِيرٌ عَنْ هِشَامٍ نَحْوَهُ‏.‏"
      },
      {
        "id": 101,
        "hadith_number": "101",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keistimewaan Wanita dan Perlindungan Anak-anak",
        "perawi_melayu": "Dikisahkan oleh Abu Sa`id Al-Khudri:",
        "english_text": "Some women requested the Prophet (ﷺ) to fix a day for them as the men were taking all his time. On that he promised them one day for religious lessons and commandments. Once during such a lesson the Prophet said, \"A woman whose three children die will be shielded by them from the Hell fire.\" On that a woman asked, \"If only two die?\" He replied, \"Even two (will shield her from the Hell-fire).",
        "malay_translation": "Sesetengah wanita memohon kepada Rasulullah SAW untuk menetapkan hari khusus untuk mereka kerana lelaki mengambil terlalu banyak masa baginda. Baginda berjanji memberi satu hari khusus untuk pengajaran dan perintah agama. Pada satu pengajaran tersebut, Rasulullah SAW bersabda, \"Seorang wanita yang kehilangan tiga anaknya akan dilindungi oleh mereka daripada api neraka.\"  Lalu seorang wanita bertanya, \"Bagaimana jika hanya dua yang meninggal?\" Baginda menjawab, \"Bahkan dua anak pun (akan melindunginya dari api neraka).\"",
        "arabic_text": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنِي ابْنُ الأَصْبَهَانِيِّ، قَالَ سَمِعْتُ أَبَا صَالِحٍ، ذَكْوَانَ يُحَدِّثُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،‏.‏ قَالَتِ النِّسَاءُ لِلنَّبِيِّ صلى الله عليه وسلم غَلَبَنَا عَلَيْكَ الرِّجَالُ، فَاجْعَلْ لَنَا يَوْمًا مِنْ نَفْسِكَ‏.‏ فَوَعَدَهُنَّ يَوْمًا لَقِيَهُنَّ فِيهِ، فَوَعَظَهُنَّ وَأَمَرَهُنَّ، فَكَانَ فِيمَا قَالَ لَهُنَّ ‏\"‏ مَا مِنْكُنَّ امْرَأَةٌ تُقَدِّمُ ثَلاَثَةً مِنْ وَلَدِهَا إِلاَّ كَانَ لَهَا حِجَابًا مِنَ النَّارِ ‏\"‏‏.‏ فَقَالَتِ امْرَأَةٌ وَاثْنَيْنِ فَقَالَ ‏\"‏ وَاثْنَيْنِ ‏\"‏‏.‏"
      },
      {
        "id": 102,
        "hadith_number": "102",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hadis tentang Tuntutan Ketiga Anak di Bawah Umur",
        "perawi_melayu": "Dikisahkan oleh Abu Sa`id Al-Khudri:",
        "english_text": "as above (the sub narrators are different). Abu Huraira qualified the three children referred to in the above mentioned Hadith as not having reached the age of committing sins (i.e. age of puberty) .",
        "malay_translation": "Seperti di atas (para perawi bawahan berbeza). Abu Hurairah menjelaskan bahawa ketiga-tiga anak yang disebut dalam hadis di atas belum mencapai usia baligh, iaitu belum mencapai umur untuk melakukan dosa.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا غُنْدَرٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَصْبَهَانِيِّ، عَنْ ذَكْوَانَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا‏.‏ وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَصْبَهَانِيِّ، قَالَ سَمِعْتُ أَبَا حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ ‏ \"‏ ثَلاَثَةً لَمْ يَبْلُغُوا الْحِنْثَ ‏\"‏‏.‏"
      },
      {
        "id": 103,
        "hadith_number": "103",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Penjelasan Tentang Perhitungan Akhirat dan Hukuman",
        "perawi_melayu": "Dikisahkan oleh Ibn Abu Mulaika:",
        "english_text": "Whenever `Aisha (the wife of the Prophet) heard anything which she did not understand, she used to ask again till she understood it completely. Aisha said: \"Once the Prophet (ﷺ) said, \"Whoever will be called to account (about his deeds on the Day of Resurrection) will surely be punished.\" I said, \"Doesn't Allah say: \"He surely will receive an easy reckoning.\" (84.8) The Prophet (ﷺ) replied, \"This means only the presentation of the accounts but whoever will be argued about his account, will certainly be ruined.\"",
        "malay_translation": "Apabila `Aisha (isteri Nabi) mendengar sesuatu yang tidak difahaminya, dia akan bertanya berulang kali sehingga dia memahaminya sepenuhnya. `Aisha berkata: \"Suatu ketika Nabi SAW bersabda, \"Barangsiapa yang akan diadili (tentang amalnya di Hari Kiamat) pasti akan dihukum.\" Aku berkata, \"Bukankah Allah berfirman: \"Sesungguhnya dia akan menerima perhitungan yang mudah?\" (84.8) Nabi SAW menjawab, \"Ini bermaksud hanya penyampaian perhitungan itu, tetapi barangsiapa yang perhitungannya diperdebatkan, pasti akan binasa.\"",
        "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ أَخْبَرَنَا نَافِعُ بْنُ عُمَرَ، قَالَ حَدَّثَنِي ابْنُ أَبِي مُلَيْكَةَ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَانَتْ لاَ تَسْمَعُ شَيْئًا لاَ تَعْرِفُهُ إِلاَّ رَاجَعَتْ فِيهِ حَتَّى تَعْرِفَهُ، وَأَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ حُوسِبَ عُذِّبَ ‏\"‏‏.‏ قَالَتْ عَائِشَةُ فَقُلْتُ أَوَ لَيْسَ يَقُولُ اللَّهُ تَعَالَى ‏{‏فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا‏}‏ قَالَتْ فَقَالَ ‏\"‏ إِنَّمَا ذَلِكَ الْعَرْضُ، وَلَكِنْ مَنْ نُوقِشَ الْحِسَابَ يَهْلِكْ ‏\"‏‏.‏"
      },
      {
        "id": 104,
        "hadith_number": "104",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keutamaan dan Kedudukan Mekah Sebagai Tanah Suci",
        "perawi_melayu": "Diceritakan oleh Sa`id:",
        "english_text": "Abu Shuraih berkata, \"Ketika `Amr bin Sa`id menghantar tentera ke Mekah (untuk memerangi `Abdullah bin Az-Zubair), aku berkata kepadanya, 'Wahai pemimpin! Izinkan aku menceritakan apa yang Rasulullah (ﷺ) katakan pada hari yang berikutnya selepas penaklukan Mekah. Telingaku mendengar, hatiku memahami, dan aku melihatnya dengan mataku sendiri, ketika baginda bersabda. Baginda memuji dan memuliakan Allah, kemudian bersabda, \"Allah, bukan manusia, telah menjadikan Mekah sebagai tanah suci. Oleh itu, sesiapa yang beriman kepada Allah dan Hari Akhirat (iaitu seorang Muslim) tidak boleh menumpahkan darah di dalamnya atau menebang pokok-pokoknya. Jika sesiapa berhujah bahawa peperangan dibenarkan di Mekah seperti yang dilakukan oleh Rasulullah (ﷺ) (di Mekah), katakanlah kepadanya bahawa Allah memberi izin kepada Rasul-Nya, tetapi Dia tidak memberikannya kepada kamu. Nabi (ﷺ) menambah: Allah mengizinkan aku (hanya) untuk beberapa saat pada hari (penaklukan) itu dan hari ini (sekarang) kesuciannya adalah sama (sah) seperti sebelumnya. Oleh itu, menjadi tanggungjawab orang yang hadir untuk menyampaikannya (maklumat ini) kepada mereka yang tidak hadir.\" Abu Shuraih ditanya, \"Apakah jawapan `Amr?\" Beliau menjawab, `Amr berkata, \"Wahai Abu Shuraih! Aku lebih tahu daripada kamu (dalam hal ini). Mekah tidak memberikan perlindungan kepada orang yang menderhaka (kepada Allah) atau yang memburu pembunuhan, atau mencuri (dan mencari perlindungan di Mekah).\"",
        "malay_translation": "Abu Shuraih meriwayatkan, \"Ketika `Amr bin Sa`id mengirim pasukan ke Mekah (untuk memerangi `Abdullah bin Az-Zubair), aku berkata kepadanya, 'Wahai pemimpin! Izinkanlah aku menceritakan apa yang Rasulullah ﷺ katakan pada hari berikutnya setelah penaklukan Mekah. Telingaku mendengar, hatiku memahami, dan aku melihatnya dengan mataku sendiri, ketika baginda bersabda. Baginda memuji dan memuliakan Allah, kemudian bersabda, 'Allah, bukan manusia, telah menjadikan Mekah sebagai tanah suci. Oleh itu, sesiapa yang beriman kepada Allah dan Hari Akhirat (iaitu seorang Muslim) tidak boleh menumpahkan darah di dalamnya atau menebang pokok-pokoknya. Jika sesiapa berhujah bahawa peperangan dibenarkan di Mekah sebagaimana yang dilakukan oleh Rasulullah ﷺ (di Mekah), katakanlah kepadanya bahawa Allah mengizinkan Rasul-Nya, tetapi tidak mengizinkan kamu. Nabi ﷺ menambah: Allah mengizinkan aku (hanya) untuk beberapa saat pada hari (penaklukan) itu dan hari ini (sekarang) kesuciannya adalah sama (sah) seperti sebelumnya. Oleh itu, menjadi kewajipan orang yang hadir untuk menyampaikan maklumat ini kepada mereka yang tidak hadir.' Abu Shuraih ditanya, 'Apakah jawapan `Amr?' Beliau menjawab, `Amr berkata, 'Wahai Abu Shuraih! Aku lebih mengetahui daripada kamu (dalam perkara ini). Mekah tidak memberikan perlindungan kepada orang yang menderhaka (kepada Allah) atau yang memburu pembunuhan, atau pencurian (dan mencari perlindungan di Mekah).'",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي سَعِيدٌ، عَنْ أَبِي شُرَيْحٍ، أَنَّهُ قَالَ لِعَمْرِو بْنِ سَعِيدٍ وَهْوَ يَبْعَثُ الْبُعُوثَ إِلَى مَكَّةَ ائْذَنْ لِي أَيُّهَا الأَمِيرُ أُحَدِّثْكَ قَوْلاً قَامَ بِهِ النَّبِيُّ صلى الله عليه وسلم الْغَدَ مِنْ يَوْمِ الْفَتْحِ، سَمِعَتْهُ أُذُنَاىَ وَوَعَاهُ قَلْبِي، وَأَبْصَرَتْهُ عَيْنَاىَ، حِينَ تَكَلَّمَ بِهِ، حَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏ \"‏ إِنَّ مَكَّةَ حَرَّمَهَا اللَّهُ، وَلَمْ يُحَرِّمْهَا النَّاسُ، فَلاَ يَحِلُّ لاِمْرِئٍ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ يَسْفِكَ بِهَا دَمًا، وَلاَ يَعْضِدَ بِهَا شَجَرَةً، فَإِنْ أَحَدٌ تَرَخَّصَ لِقِتَالِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِيهَا فَقُولُوا إِنَّ اللَّهَ قَدْ أَذِنَ لِرَسُولِهِ، وَلَمْ يَأْذَنْ لَكُمْ‏.‏ وَإِنَّمَا أَذِنَ لِي فِيهَا سَاعَةً مِنْ نَهَارٍ، ثُمَّ عَادَتْ حُرْمَتُهَا الْيَوْمَ كَحُرْمَتِهَا بِالأَمْسِ، وَلْيُبَلِّغِ الشَّاهِدُ الْغَائِبَ ‏\"‏‏.‏ فَقِيلَ لأَبِي شُرَيْحٍ مَا قَالَ عَمْرٌو قَالَ أَنَا أَعْلَمُ مِنْكَ يَا أَبَا شُرَيْحٍ، لاَ يُعِيذُ عَاصِيًا، وَلاَ فَارًّا بِدَمٍ، وَلاَ فَارًّا بِخَرْبَةٍ‏.‏"
      },
      {
        "id": 105,
        "hadith_number": "105",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kehormatan Darah, Harta, dan Kehormatan Diri yang Dimuliakan",
        "perawi_melayu": "Dikisahkan oleh Abu Bakar:",
        "english_text": "The Prophet (ﷺ) said. No doubt your blood, property, the sub-narrator Muhammad thought that Abu Bakra had also mentioned and your honor (chastity), are sacred to one another as is the sanctity of this day of yours in this month of yours. It is incumbent on those who are present to inform those who are absent.\" (Muhammad the Sub-narrator used to say, \"Allah's Messenger (ﷺ) told the truth.\") The Prophet (ﷺ) repeated twice: \"No doubt! Haven't I conveyed Allah's message to you.",
        "malay_translation": "Rasulullah SAW bersabda, \"Sesungguhnya darah, harta benda, dan kehormatan kalian adalah suci antara satu sama lain sebagaimana kesucian hari-hari kalian di bulan ini.  Wajib bagi yang hadir untuk menyampaikan kepada yang tidak hadir.\" (Muhammad, perawi, pernah berkata, \"Sesungguhnya Rasulullah SAW telah menyampaikan kebenaran.\")  Rasulullah SAW mengulangi dua kali, \"Tidak syak lagi! Bukankah aku telah menyampaikan risalah Allah kepada kalian?",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنِ ابْنِ أَبِي بَكْرَةَ، عَنْ أَبِي بَكْرَةَ، ذُكِرَ النَّبِيُّ صلى الله عليه وسلم قَالَ ‏\"‏ فَإِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ ـ قَالَ مُحَمَّدٌ وَأَحْسِبُهُ قَالَ وَأَعْرَاضَكُمْ ـ عَلَيْكُمْ حَرَامٌ كَحُرْمَةِ يَوْمِكُمْ هَذَا فِي شَهْرِكُمْ هَذَا، أَلاَ لِيُبَلِّغِ الشَّاهِدُ مِنْكُمُ الْغَائِبَ ‏\"‏‏.‏ وَكَانَ مُحَمَّدٌ يَقُولُ صَدَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم كَانَ ذَلِكَ ‏\"‏ أَلاَ هَلْ بَلَّغْتُ ‏\"‏ مَرَّتَيْنِ‏.‏"
      },
      {
        "id": 106,
        "hadith_number": "106",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Berdusta Mengenai Nabi SAW",
        "perawi_melayu": "Dikisahkan oleh `Ali:",
        "english_text": "The Prophet (ﷺ) said, \"Do not tell a lie against me for whoever tells a lie against me (intentionally) then he will surely enter the Hell-fire.\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Janganlah kalian berdusta tentangku. Barangsiapa yang berdusta tentangku dengan sengaja, maka dia pasti akan masuk neraka.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، قَالَ أَخْبَرَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي مَنْصُورٌ، قَالَ سَمِعْتُ رِبْعِيَّ بْنَ حِرَاشٍ، يَقُولُ سَمِعْتُ عَلِيًّا، يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ تَكْذِبُوا عَلَىَّ، فَإِنَّهُ مَنْ كَذَبَ عَلَىَّ فَلْيَلِجِ النَّارَ ‏\"‏‏.‏"
      },
      {
        "id": 107,
        "hadith_number": "107",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Berdusta Mengenai Rasulullah SAW",
        "perawi_melayu": "Diceritakan oleh `Abdullah bin Az-Zubair:",
        "english_text": "I said to my father, 'I do not hear from you any narration (Hadith) of Allah s Apostle as I hear (his narration) from so and so?\" Az-Zubair replied. l was always with him (the Prophet) and I heard him saying \"Whoever tells a lie against me (intentionally) then (surely) let him occupy, his seat in Hellfire.",
        "malay_translation": "Aku berkata kepada ayahku, 'Aku tidak mendengar sebarang hadis dari Rasulullah SAW daripadamu seperti yang aku dengar dari si fulan.' Az-Zubair menjawab, 'Aku sentiasa bersama baginda dan aku mendengar baginda bersabda, \"Barangsiapa yang berdusta terhadapku (dengan sengaja), maka hendaklah dia menempati tempatnya di neraka.\" ",
        "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ جَامِعِ بْنِ شَدَّادٍ، عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ أَبِيهِ، قَالَ قُلْتُ لِلزُّبَيْرِ إِنِّي لاَ أَسْمَعُكَ تُحَدِّثُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم كَمَا يُحَدِّثُ فُلاَنٌ وَفُلاَنٌ‏.‏ قَالَ أَمَا إِنِّي لَمْ أُفَارِقْهُ وَلَكِنْ سَمِعْتُهُ يَقُولُ ‏ \"‏ مَنْ كَذَبَ عَلَىَّ فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ ‏\"‏‏.‏"
      },
      {
        "id": 108,
        "hadith_number": "108",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Berdusta Mengenai Rasulullah SAW",
        "perawi_melayu": "Dikisahkan oleh Anas:",
        "english_text": "The fact which stops me from narrating a great number of Hadiths to you is that the Prophet (ﷺ) said: \"Whoever tells a lie against me intentionally, then (surely) let him occupy his seat in Hell-fire.\"",
        "malay_translation": "Faktor yang menghalang saya daripada menyampaikan banyak hadis kepada kalian adalah sabda Rasulullah SAW, \"Barangsiapa yang sengaja berdusta tentangku, maka (pasti) hendaklah dia menempati tempatnya di neraka.\" ",
        "arabic_text": "حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ، قَالَ أَنَسٌ إِنَّهُ لَيَمْنَعُنِي أَنْ أُحَدِّثَكُمْ حَدِيثًا كَثِيرًا أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ تَعَمَّدَ عَلَىَّ كَذِبًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ ‏\"‏‏.‏"
      },
      {
        "id": 109,
        "hadith_number": "109",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Mengada-ada Hadis Nabi SAW",
        "perawi_melayu": "Salama meriwayatkan",
        "english_text": "I heard the Prophet (ﷺ) saying, \"Whoever (intentionally) ascribes to me what I have not said then (surely) let him occupy his seat in Hell-fire.\"",
        "malay_translation": "Aku mendengar Rasulullah SAW bersabda, \"Barangsiapa yang sengaja mengada-ada hadis dariku (dengan sengaja mengatakan bahwa aku telah berkata sesuatu padahal aku tidak pernah berkata demikian), maka hendaklah ia menempati tempatnya di neraka.",
        "arabic_text": "حَدَّثَنَا مَكِّيُّ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ يَقُلْ عَلَىَّ مَا لَمْ أَقُلْ فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ ‏\"‏‏.‏"
      },
      {
        "id": 110,
        "hadith_number": "110",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Menggunakan Gelaran Nabi dan Peringatan Terhadap Pendusta",
        "perawi_melayu": "Dikisahkan oleh Abu Hurairah:",
        "english_text": "The Prophet (ﷺ) said, \"Name yourselves with my name (use my name) but do not name yourselves with my Kunya name (i.e. Abul Qasim). And whoever sees me in a dream then surely he has seen me for Satan cannot impersonate me. And whoever tells a lie against me (intentionally), then (surely) let him occupy his seat in Hell-fire.\"",
        "malay_translation": "Nabi (ﷺ) bersabda, \"Panggil diri kamu dengan namaku (gunakan namaku) tetapi jangan panggil diri kamu dengan gelaran kunyahu (misalnya Abul Qasim). Dan sesiapa yang melihat aku dalam mimpinya, maka sesungguhnya dia telah melihatku kerana Syaitan tidak mampu meniru aku. Dan sesiapa yang berdusta tentangku (dengan sengaja), maka (pasti) hendaklah dia menduduki tempatnya di Neraka.",
        "arabic_text": "حَدَّثَنَا مُوسَى، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ تَسَمَّوْا بِاسْمِي وَلاَ تَكْتَنُوا بِكُنْيَتِي، وَمَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي، فَإِنَّ الشَّيْطَانَ لاَ يَتَمَثَّلُ فِي صُورَتِي، وَمَنْ كَذَبَ عَلَىَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ ‏\"‏‏.‏"
      },
      {
        "id": 111,
        "hadith_number": "111",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Penjelasan Mengenai Hukum-hukum Diyya, Tebusan, dan Qisas",
        "perawi_melayu": "Dikisahkan oleh Ash-Shu`bi:",
        "english_text": "Abu Juhaifa berkata, \"Saya bertanya kepada `Ali, 'Adakah engkau mempunyai sebarang kitab (yang telah diwahyukan kepada Nabi صلى الله عليه وسلم) selain daripada Al-Quran?' `Ali menjawab, 'Tidak, kecuali Kitab Allah atau keupayaan memahami yang telah dianugerahkan (oleh Allah) kepada seorang Muslim atau apa yang (tertulis) dalam helaian kertas ini (bersamaku).' Abu Juhaifa berkata, \"Saya bertanya, 'Apakah yang (tertulis) dalam helaian kertas ini?' `Ali menjawab, ia berkaitan dengan Diyya (denda darah yang dibayar oleh pembunuh kepada keluarga mangsa), tebusan untuk membebaskan tawanan dari tangan musuh, dan hukum bahawa tiada seorang Muslim pun harus dibunuh dalam Qisas (hukuman setimpal) atas pembunuhan (orang kafir).\"",
        "malay_translation": "Abu Juhaifa berkata, \"Saya bertanya kepada `Ali, 'Adakah engkau mempunyai sebarang kitab (yang telah diwahyukan kepada Nabi صلى الله عليه وسلم) selain daripada Al-Quran?' `Ali menjawab, 'Tidak, kecuali Kitab Allah atau keupayaan memahami yang telah dianugerahkan (oleh Allah) kepada seorang Muslim atau apa yang (tertulis) dalam helaian kertas ini (bersamaku).' Abu Juhaifa berkata, \"Saya bertanya, 'Apakah yang (tertulis) dalam helaian kertas ini?' `Ali menjawab, ia berkaitan dengan Diyya (denda darah yang dibayar oleh pembunuh kepada keluarga mangsa), tebusan untuk membebaskan tawanan dari tangan musuh, dan hukum bahawa tiada seorang Muslim pun harus dibunuh dalam Qisas (hukuman setimpal) atas pembunuhan (orang kafir).\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ أَخْبَرَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ مُطَرِّفٍ، عَنِ الشَّعْبِيِّ، عَنْ أَبِي جُحَيْفَةَ، قَالَ قُلْتُ لِعَلِيٍّ هَلْ عِنْدَكُمْ كِتَابٌ قَالَ لاَ، إِلاَّ كِتَابُ اللَّهِ، أَوْ فَهْمٌ أُعْطِيَهُ رَجُلٌ مُسْلِمٌ، أَوْ مَا فِي هَذِهِ الصَّحِيفَةِ‏.‏ قَالَ قُلْتُ فَمَا فِي هَذِهِ الصَّحِيفَةِ قَالَ الْعَقْلُ، وَفَكَاكُ الأَسِيرِ، وَلاَ يُقْتَلُ مُسْلِمٌ بِكَافِرٍ‏.‏"
      },
      {
        "id": 112,
        "hadith_number": "112",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Pertempuran dan Kewajipan di Tanah Haram Mekah",
        "perawi_melayu": "Dikisahkan oleh Abu Hurairah",
        "english_text": "In the year of the Conquest of Mecca, the tribe of Khuza`a killed a man from the tribe of Bani Laith in revenge for a killed person, belonging to them. They informed the Prophet (ﷺ) about it. So he rode his Rahila (she-camel for riding) and addressed the people saying, \"Allah held back the killing from Mecca. (The sub-narrator is in doubt whether the Prophet (ﷺ) said \"elephant or killing,\" as the Arabic words standing for these words have great similarity in shape), but He (Allah) let His Apostle and the believers over power the infidels of Mecca. Beware! (Mecca is a sanctuary) Verily! Fighting in Mecca was not permitted for anyone before me nor will it be permitted for anyone after me. It (war) in it was made legal for me for few hours or so on that day. No doubt it is at this moment a sanctuary, it is not allowed to uproot its thorny shrubs or to uproot its trees or to pick up its Luqat (fallen things) except by a person who will look for its owner (announce it publicly). And if somebody is killed, then his closest relative has the right to choose one of the two-- the blood money (Diyya) or retaliation having the killer killed. In the meantime a man from Yemen came and said, \"O Allah's Messenger (ﷺ)! Get that written for me.\" The Prophet (ﷺ) ordered his companions to write that for him. Then a man from Quraish said, \"Except Al-Idhkhir (a type of grass that has good smell) O Allah's Messenger (ﷺ), as we use it in our houses and graves.\" The Prophet (ﷺ) said, \"Except Al-Idhkhir i.e. Al-Idhkhir is allowed to be plucked.\"",
        "malay_translation": "Pada tahun Penaklukan Mekah, puak Khuza`a membunuh seorang lelaki dari puak Bani Laith sebagai pembalasan atas pembunuhan ahli mereka. Mereka memberitahu Rasulullah (ﷺ) tentang kejadian itu. Baginda kemudian menunggang Rahila (unta betina tunggangan) dan berkhutbah kepada orang ramai, \"Allah telah menghalang pembunuhan di Mekah. (Pereka ialah ragu-ragu sama ada Rasulullah (ﷺ) menyebut \"gajah\" atau \"pembunuhan\", kerana perkataan Arab bagi kedua-duanya mempunyai persamaan bentuk), tetapi Allah telah mengizinkan Rasul-Nya dan orang-orang beriman untuk mengalahkan orang-orang kafir Mekah. Ingatlah! (Mekah adalah tanah haram.) Sesungguhnya, peperangan di Mekah tidak dibenarkan bagi sesiapa sebelumku dan tidak akan dibenarkan untuk sesiapa selepasku. Peperangan di dalamnya diizinkan kepadaku selama beberapa jam pada hari itu.  Sudah tentu Mekah adalah tanah haram pada masa itu, tidak dibenarkan mencabut semak belukar atau pokoknya atau mengambil Luqat (benda-benda yang jatuh) kecuali oleh orang yang mencari pemiliknya (memberitahu orang ramai). Dan jika seseorang terbunuh, saudara terdekatnya berhak memilih salah satu daripada dua pilihan:  denda (Diyya) atau qisas (pembalasan). Sementara itu, seorang lelaki dari Yaman datang dan berkata, \"Wahai Rasulullah (ﷺ), catatkan ini untukku.\" Rasulullah (ﷺ) memerintahkan para sahabatnya untuk menuliskannya untuknya. Kemudian seorang lelaki dari Quraisy berkata, \"Kecuali Al-Idhkhir (sejenis rumput yang harum wanginya), wahai Rasulullah (ﷺ), kerana kami menggunakannya di rumah dan kubur kami.\" Rasulullah (ﷺ) menjawab, \"Kecuali Al-Idhkhir, iaitu Al-Idhkhir dibenarkan dicabut.\"",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ الْفَضْلُ بْنُ دُكَيْنٍ، قَالَ حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ خُزَاعَةَ، قَتَلُوا رَجُلاً مِنْ بَنِي لَيْثٍ عَامَ فَتْحِ مَكَّةَ بِقَتِيلٍ مِنْهُمْ قَتَلُوهُ، فَأُخْبِرَ بِذَلِكَ النَّبِيُّ صلى الله عليه وسلم فَرَكِبَ رَاحِلَتَهُ، فَخَطَبَ فَقَالَ ‏\"‏ إِنَّ اللَّهَ حَبَسَ عَنْ مَكَّةَ الْقَتْلَ ـ أَوِ الْفِيلَ شَكَّ أَبُو عَبْدِ اللَّهِ ـ وَسَلَّطَ عَلَيْهِمْ رَسُولَ اللَّهِ صلى الله عليه وسلم وَالْمُؤْمِنِينَ، أَلاَ وَإِنَّهَا لَمْ تَحِلَّ لأَحَدٍ قَبْلِي، وَلاَ تَحِلُّ لأَحَدٍ بَعْدِي أَلاَ وَإِنَّهَا حَلَّتْ لِي سَاعَةً مِنْ نَهَارٍ، أَلاَ وَإِنَّهَا سَاعَتِي هَذِهِ حَرَامٌ، لاَ يُخْتَلَى شَوْكُهَا، وَلاَ يُعْضَدُ شَجَرُهَا، وَلاَ تُلْتَقَطُ سَاقِطَتُهَا إِلاَّ لِمُنْشِدٍ، فَمَنْ قُتِلَ فَهُوَ بِخَيْرِ النَّظَرَيْنِ إِمَّا أَنْ يُعْقَلَ، وَإِمَّا أَنْ يُقَادَ أَهْلُ الْقَتِيلِ ‏\"‏‏.‏ فَجَاءَ رَجُلٌ مِنْ أَهْلِ الْيَمَنِ فَقَالَ اكْتُبْ لِي يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ ‏\"‏ اكْتُبُوا لأَبِي فُلاَنٍ ‏\"‏‏.‏ فَقَالَ رَجُلٌ مِنْ قُرَيْشٍ إِلاَّ الإِذْخِرَ يَا رَسُولَ اللَّهِ، فَإِنَّا نَجْعَلُهُ فِي بُيُوتِنَا وَقُبُورِنَا‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِلاَّ الإِذْخِرَ، إِلاَّ الإِذْخِرَ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ يُقَالُ يُقَادُ بِالْقَافِ‏.‏ فَقِيلَ لأَبِي عَبْدِ اللَّهِ أَىُّ شَىْءٍ كَتَبَ لَهُ قَالَ كَتَبَ لَهُ هَذِهِ الْخُطْبَةَ‏.‏"
      },
      {
        "id": 113,
        "hadith_number": "113",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keunggulan Hadis Diriwayatkan Abu Hurairah",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
        "english_text": "There is none among the companions of the Prophet (ﷺ) who has narrated more Hadiths than I except `Abdullah bin `Amr (bin Al-`As) who used to write them and I never did the same.",
        "malay_translation": "Tidak ada di antara sahabat Rasulullah SAW yang meriwayatkan lebih banyak Hadis daripada aku kecuali `Abdullah bin `Amr (bin Al-`As) yang biasa menulisnya, dan aku tidak pernah melakukannya.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا عَمْرٌو، قَالَ أَخْبَرَنِي وَهْبُ بْنُ مُنَبِّهٍ، عَنْ أَخِيهِ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ مَا مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم أَحَدٌ أَكْثَرَ حَدِيثًا عَنْهُ مِنِّي، إِلاَّ مَا كَانَ مِنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو فَإِنَّهُ كَانَ يَكْتُبُ وَلاَ أَكْتُبُ‏.‏ تَابَعَهُ مَعْمَرٌ عَنْ هَمَّامٍ عَنْ أَبِي هُرَيْرَةَ‏.‏"
      },
      {
        "id": 114,
        "hadith_number": "114",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ketetapan Nabi SAW Menentang Perselisihan Pendapat tentang Penulisan Wasiat",
        "perawi_melayu": "'Ubaidullah bin `Abdullah",
        "english_text": "Ibn `Abbas berkata, \"Ketika penyakit Nabi (ﷺ) semakin parah, baginda bersabda, 'Bawakan kertas dan tinta untukku, agar aku dapat menulis wasiat untuk kamu, supaya kamu tidak sesat.' Tetapi `Umar berkata, 'Nabi sedang sakit tenat, dan kita mempunyai Kitab Allah yang cukup untuk kita.' Para sahabat Nabi (ﷺ) berbeza pendapat tentang hal ini, dan berlaku kegaduhan. Lalu Nabi (ﷺ) bersabda kepada mereka, 'Pergi dari sini dan tinggalkan aku. Tidak elok jika kalian bertengkar di hadapanku.'\" Ibn `Abbas keluar sambil berkata, \"Sungguh amat malang (bencana besar) bahawa Rasulullah (ﷺ) tidak dapat menulis wasiat itu untuk mereka disebabkan perselisihan dan kegaduhan mereka. (Catatan: Terlihat dari hadis ini bahawa Ibn `Abbas telah menyaksikan peristiwa tersebut dan berkata demikian. Sebenarnya, Ibn `Abbas biasa berkata demikian ketika meriwayatkan hadis, dan dia tidak menyaksikan peristiwa itu sendiri. Lihat Fath Al-Bari Jilid 1, muka surat 220 nota kaki.) (Lihat Hadis No. 228, Jilid 4).",
        "malay_translation": "Ibn `Abbas meriwayatkan, \"Apabila penyakit Nabi SAW semakin parah, baginda bersabda, 'Bawakan kertas dan tinta kepadaku, agar aku dapat menulis wasiat untuk kamu, supaya kamu tidak sesat.'  Tetapi `Umar berkata, 'Nabi sedang sakit tenat, dan Kitab Allah cukup untuk kita.' Para sahabat Nabi SAW berbeza pendapat tentang hal ini, lalu timbul pergaduhan dan kekecohan. Maka, Nabi SAW bersabda kepada mereka, 'Tinggalkan aku dan pergilah. Tidak elok jika kamu bertengkar di hadapan-Ku.'\" Ibn `Abbas keluar sambil berkata, \"Sungguh malang dan merupakan bencana besar bahawa Rasulullah SAW tidak dapat menulis wasiat itu untuk mereka kerana perselisihan dan kekecohan mereka. (Catatan: Terlihat dari hadis ini bahawa Ibn `Abbas seolah-olah menyaksikan peristiwa tersebut dan mengungkapkannya demikian. Namun, hakikatnya Ibn `Abbas sering menyatakan hal ini ketika meriwayatkan hadis, dan beliau tidak menyaksikan peristiwa itu sendiri. Lihat Fath Al-Bari, Jilid 1, muka surat 220, nota kaki). (Lihat Hadis No. 228, Jilid 4).",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمَّا اشْتَدَّ بِالنَّبِيِّ صلى الله عليه وسلم وَجَعُهُ قَالَ ‏\"‏ ائْتُونِي بِكِتَابٍ أَكْتُبُ لَكُمْ كِتَابًا لاَ تَضِلُّوا بَعْدَهُ ‏\"‏‏.‏ قَالَ عُمَرُ إِنَّ النَّبِيَّ صلى الله عليه وسلم غَلَبَهُ الْوَجَعُ وَعِنْدَنَا كِتَابُ اللَّهِ حَسْبُنَا فَاخْتَلَفُوا وَكَثُرَ اللَّغَطُ‏.‏ قَالَ ‏\"‏ قُومُوا عَنِّي، وَلاَ يَنْبَغِي عِنْدِي التَّنَازُعُ ‏\"‏‏.‏ فَخَرَجَ ابْنُ عَبَّاسٍ يَقُولُ إِنَّ الرَّزِيَّةَ كُلَّ الرَّزِيَّةِ مَا حَالَ بَيْنَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَبَيْنَ كِتَابِهِ‏.‏"
      },
      {
        "id": 115,
        "hadith_number": "115",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pengisytiharan Kekayaan dan Kebajikan Malam Hari",
        "perawi_melayu": "Um Salama meriwayatkan:",
        "english_text": "One night Allah's Messenger (ﷺ) got up and said, \"Subhan Allah! How many afflictions have been descended tonight and how many treasures have been disclosed! Go and wake the sleeping lady occupants of these dwellings (his wives) up (for prayers). A well-dressed (soul) in this world may be naked in the Hereafter.",
        "malay_translation": "Pada suatu malam, Rasulullah SAW bangun dan berkata, \"Subhanallah! Betapa banyak musibah yang telah turun malam ini dan betapa banyak khazanah yang telah didedahkan! Pergilah dan bangunkah para wanita penghuni rumah (isteri-isterinya) yang sedang tidur (untuk solat). Seseorang yang berpakaian indah di dunia ini mungkin akan telanjang di Akhirat.",
        "arabic_text": "حَدَّثَنَا صَدَقَةُ، أَخْبَرَنَا ابْنُ عُيَيْنَةَ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ هِنْدٍ، عَنْ أُمِّ سَلَمَةَ، وَعَمْرٍو، وَيَحْيَى بْنِ سَعِيدٍ، عَنِ الزُّهْرِيِّ، عَنْ هِنْدٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتِ اسْتَيْقَظَ النَّبِيُّ صلى الله عليه وسلم ذَاتَ لَيْلَةٍ فَقَالَ ‏ \"‏ سُبْحَانَ اللَّهِ مَاذَا أُنْزِلَ اللَّيْلَةَ مِنَ الْفِتَنِ وَمَاذَا فُتِحَ مِنَ الْخَزَائِنِ أَيْقِظُوا صَوَاحِبَاتِ الْحُجَرِ، فَرُبَّ كَاسِيَةٍ فِي الدُّنْيَا عَارِيَةٍ فِي الآخِرَةِ ‏\"‏‏.‏"
      },
      {
        "id": 116,
        "hadith_number": "116",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Malam Kepentingan: Tidak Akan Ada yang Hidup Seratus Tahun Selepas Malam Ini",
        "perawi_melayu": "Dikisahkan oleh Abdullah bin Umar",
        "english_text": "Once the Prophet (ﷺ) led us in the `Isha' prayer during the last days of his life and after finishing it (the prayer) (with Taslim) he said: \"Do you realize (the importance of) this night?\" Nobody present on the surface of the earth tonight will be living after the completion of one hundred years from this night.",
        "malay_translation": "Suatu ketika Nabi SAW memimpin solat Isyak pada akhir hayatnya, dan selepas selesai solat (dengan salam), baginda bersabda: \"Tahukah kamu betapa pentingnya malam ini?\" Tiada seorang pun yang hadir di muka bumi malam ini akan hidup melepasi tempoh seratus tahun dari malam ini.",
        "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، وَأَبِي، بَكْرِ بْنِ سُلَيْمَانَ بْنِ أَبِي حَثْمَةَ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ صَلَّى بِنَا النَّبِيُّ صلى الله عليه وسلم الْعِشَاءَ فِي آخِرِ حَيَاتِهِ، فَلَمَّا سَلَّمَ قَامَ فَقَالَ ‏ \"‏ أَرَأَيْتَكُمْ لَيْلَتَكُمْ هَذِهِ، فَإِنَّ رَأْسَ مِائَةِ سَنَةٍ مِنْهَا لاَ يَبْقَى مِمَّنْ هُوَ عَلَى ظَهْرِ الأَرْضِ أَحَدٌ ‏\"‏‏.‏"
      },
      {
        "id": 117,
        "hadith_number": "117",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keutamaan Solat Malam dan Perhatian Rasulullah SAW Kepada Anak-anak",
        "perawi_melayu": "Dikisahkan oleh Ibn `Abbas:",
        "english_text": "I stayed overnight in the house of my aunt Maimuna bint Al-Harith (the wife of the Prophet (ﷺ) ) while the Prophet (ﷺ) was there with her during her night turn. The Prophet (ﷺ) offered the `Isha' prayer (in the mosque), returned home and after having prayed four rak`at, he slept. Later on he got up at night and then asked whether the boy (or he used a similar word) had slept? Then he got up for the prayer and I stood up by his left side but he made me stand to his right and offered five rak`at followed by two more rak`at. Then he slept and I heard him snoring and then (after a while) he left for the (Fajr) prayer.",
        "malay_translation": "Aku menginap di rumah bibiku, Maimuna binti Al-Harith (isteri Nabi SAW) ketika baginda berada di sana semasa giliran malamnya. Nabi SAW menunaikan solat Isyak (di masjid), pulang ke rumah dan selepas menunaikan empat rakaat solat, baginda tidur. Kemudian baginda bangun pada waktu malam dan bertanya sama ada anak lelaki (atau baginda menggunakan perkataan yang serupa) sudah tidur. Kemudian baginda bangun untuk solat dan aku berdiri di sebelah kirinya tetapi baginda memerintahkan aku berdiri di sebelah kanannya dan baginda menunaikan lima rakaat diikuti dengan dua rakaat lagi. Kemudian baginda tidur dan aku mendengar bunyi dengkurannya lalu (setelah beberapa ketika) baginda pergi untuk solat subuh.",
        "arabic_text": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا الْحَكَمُ، قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ بِتُّ فِي بَيْتِ خَالَتِي مَيْمُونَةَ بِنْتِ الْحَارِثِ زَوْجِ النَّبِيِّ صلى الله عليه وسلم وَكَانَ النَّبِيُّ صلى الله عليه وسلم عِنْدَهَا فِي لَيْلَتِهَا، فَصَلَّى النَّبِيُّ صلى الله عليه وسلم الْعِشَاءَ، ثُمَّ جَاءَ إِلَى مَنْزِلِهِ، فَصَلَّى أَرْبَعَ رَكَعَاتٍ، ثُمَّ نَامَ، ثُمَّ قَامَ، ثُمَّ قَالَ ‏ \"‏ نَامَ الْغُلَيِّمُ ‏\"‏‏.‏ أَوْ كَلِمَةً تُشْبِهُهَا، ثُمَّ قَامَ فَقُمْتُ عَنْ يَسَارِهِ، فَجَعَلَنِي عَنْ يَمِينِهِ، فَصَلَّى خَمْسَ رَكَعَاتٍ ثُمَّ صَلَّى رَكْعَتَيْنِ، ثُمَّ نَامَ حَتَّى سَمِعْتُ غَطِيطَهُ ـ أَوْ خَطِيطَهُ ـ ثُمَّ خَرَجَ إِلَى الصَّلاَةِ‏.‏"
      },
      {
        "id": 118,
        "hadith_number": "118",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keikhlasan Hadits dan Kepentingan Mengamalkan Ilmu",
        "perawi_melayu": "Dikisahkan oleh Abu Hurairah:",
        "english_text": "People say that I have narrated many Hadiths (The Prophet's narration). Had it not been for two verses in the Qur'an, I would not have narrated a single Hadith, and the verses are: \"Verily those who conceal the clear sign and the guidance which We have sent down . . . (up to) Most Merciful.\" (2:159-160). And no doubt our Muhajir (emigrant) brothers used to be busy in the market with their business (bargains) and our Ansari brothers used to be busy with their property (agriculture). But I (Abu Huraira) used to stick to Allah's Messenger (ﷺ) contented with what will fill my stomach and I used to attend that which they used not to attend and I used to memorize that which they used not to memorize.",
        "malay_translation": "Orang ramai berkata bahawa saya telah meriwayatkan banyak hadis (perkataan dan perbuatan Rasulullah). Sekiranya bukan kerana dua ayat di dalam Al-Quran, saya tidak akan meriwayatkan satu hadis pun, dan ayat-ayat tersebut ialah: \"Sesungguhnya orang yang menyembunyikan keterangan yang nyata dan petunjuk yang telah Kami turunkan... (sehingga) Yang Maha Pemurah.\" (2:159-160). Dan sudah tentu saudara-saudara Muhajirin kami dahulu sibuk di pasar dengan urusan perniagaan (tawar-menawar) dan saudara-saudara Ansar kami sibuk dengan harta benda mereka (pertanian). Tetapi saya (Abu Hurairah) tetap berpegang kepada Rasulullah SAW dengan redha apa yang mencukupi perut saya dan saya menghadiri perkara yang mereka tidak hadiri dan menghafal perkara yang mereka tidak hafal.",
        "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ إِنَّ النَّاسَ يَقُولُونَ أَكْثَرَ أَبُو هُرَيْرَةَ، وَلَوْلاَ آيَتَانِ فِي كِتَابِ اللَّهِ مَا حَدَّثْتُ حَدِيثًا، ثُمَّ يَتْلُو ‏{‏إِنَّ الَّذِينَ يَكْتُمُونَ مَا أَنْزَلْنَا مِنَ الْبَيِّنَاتِ‏}‏ إِلَى قَوْلِهِ ‏{‏الرَّحِيمُ‏}‏ إِنَّ إِخْوَانَنَا مِنَ الْمُهَاجِرِينَ كَانَ يَشْغَلُهُمُ الصَّفْقُ بِالأَسْوَاقِ، وِإِنَّ إِخْوَانَنَا مِنَ الأَنْصَارِ كَانَ يَشْغَلُهُمُ الْعَمَلُ فِي أَمْوَالِهِمْ، وَإِنَّ أَبَا هُرَيْرَةَ كَانَ يَلْزَمُ رَسُولَ اللَّهِ صلى الله عليه وسلم بِشِبَعِ بَطْنِهِ وَيَحْضُرُ مَا لاَ يَحْضُرُونَ، وَيَحْفَظُ مَا لاَ يَحْفَظُونَ‏.‏"
      },
      {
        "id": 119,
        "hadith_number": "119",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Menguatkan Ingatan terhadap Hadis",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "I said to Allah's Messenger (ﷺ) \"I hear many narrations (Hadiths) from you but I forget them.\" Allah's Apostle said, \"Spread your Rida' (garment).\" I did accordingly and then he moved his hands as if filling them with something (and emptied them in my Rida') and then said, \"Take and wrap this sheet over your body.\" I did it and after that I never forgot any thing. Narrated Ibrahim bin Al-Mundhir: Ibn Abi Fudaik narrated the same as above (Hadith...119) but added that the Prophet (ﷺ) had moved his hands as if filling them with something and then he emptied them in the Rida' of Abu Huraira.",
        "malay_translation": "Saya berkata kepada Rasulullah SAW, \"Saya mendengar banyak riwayat (Hadis) daripada Anda, tetapi saya sering lupa.\" Rasulullah SAW bersabda, \"Bentangkan rida' (pakaian) anda.\" Saya melakukannya, dan kemudian baginda menggerakkan tangannya seolah-olah mengisi sesuatu (dan mengosongkannya ke dalam rida' saya), lalu bersabda, \"Ambillah dan balut kain ini di badan anda.\" Saya melakukannya, dan selepas itu saya tidak pernah melupakan apa-apa lagi. Diriwayatkan oleh Ibrahim bin Al-Mundhir: Ibnu Abi Fudaik meriwayatkan sama seperti di atas (Hadis...119) tetapi menambahkan bahawa Nabi SAW menggerakkan tangannya seolah-olah mengisi sesuatu dan kemudian mengosongkannya ke dalam rida' Abu Hurairah.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي بَكْرٍ أَبُو مُصْعَبٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ بْنِ دِينَارٍ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ، إِنِّي أَسْمَعُ مِنْكَ حَدِيثًا كَثِيرًا أَنْسَاهُ‏.‏ قَالَ ‏\"‏ ابْسُطْ رِدَاءَكَ ‏\"‏ فَبَسَطْتُهُ‏.‏ قَالَ فَغَرَفَ بِيَدَيْهِ ثُمَّ قَالَ ‏\"‏ ضُمُّهُ ‏\"‏ فَضَمَمْتُهُ فَمَا نَسِيتُ شَيْئًا بَعْدَهُ‏. حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ قَالَ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ بِهَذَا أَوْ قَالَ غَرَفَ بِيَدِهِ فِيهِ‏.‏"
      },
      {
        "id": 120,
        "hadith_number": "120",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hadis Mengenai Pengetahuan yang Diwarisi dan Dikuatirkan",
        "perawi_melayu": "Daripada Abu Hurairah:",
        "english_text": "I have memorized two kinds of knowledge from Allah's Messenger (ﷺ) . I have propagated one of them to you and if I propagated the second, then my pharynx (throat) would be cut (i.e. killed).",
        "malay_translation": "Aku telah menghafal dua jenis ilmu dari Rasulullah (ﷺ). Aku telah menyampaikan salah satunya kepada kalian, dan sekiranya aku menyampaikan yang kedua, maka tenggorokanku akan dipotong (iaitu dibunuh).",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي أَخِي، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ حَفِظْتُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وِعَاءَيْنِ، فَأَمَّا أَحَدُهُمَا فَبَثَثْتُهُ، وَأَمَّا الآخَرُ فَلَوْ بَثَثْتُهُ قُطِعَ هَذَا الْبُلْعُومُ‏.‏"
      },
      {
        "id": 121,
        "hadith_number": "121",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Berperang dan Membunuh Sesama Muslim",
        "perawi_melayu": "Diceritakan oleh Jarir:",
        "english_text": "The Prophet (ﷺ) said to me during Hajjat-al-Wida`: Let the people keep quiet and listen. Then he said (addressing the people), \"Do not (become infidels) revert to disbelief after me by striking the necks (cutting the throats) of one another (killing each other).\"",
        "malay_translation": "Rasulullah SAW bersabda kepadaku semasa Haji Wida`: Suruhlah orang ramai diam dan mendengar. Kemudian baginda bersabda (kepada orang ramai), \"Jangan kembali kufur setelahku dengan saling membunuh sesama kalian.\"",
        "arabic_text": "حَدَّثَنَا حَجَّاجٌ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَلِيُّ بْنُ مُدْرِكٍ، عَنْ أَبِي زُرْعَةَ، عَنْ جَرِيرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لَهُ فِي حَجَّةِ الْوَدَاعِ ‏\"‏ اسْتَنْصِتِ النَّاسَ ‏\"‏ فَقَالَ ‏\"‏ لاَ تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ ‏\"‏‏.‏"
      },
      {
        "id": 122,
        "hadith_number": "122",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Musa dan Al-Khaidir - Pengajaran Sabar dan Ilmu Ilahi",
        "perawi_melayu": "Disampaikan oleh Sa`id bin Jubair",
        "english_text": "I said to Ibn `Abbas, \"Nauf-Al-Bakali claims that Moses (the companion of Khadir) was not the Moses of Bani Israel but he was another Moses.\" Ibn `Abbas remarked that the enemy of Allah (Nauf) was a liar. Narrated Ubai bin Ka`b: The Prophet (ﷺ) said, \"Once the Prophet (ﷺ) Moses stood up and addressed Bani Israel. He was asked, \"Who is the most learned man amongst the people. He said, \"I am the most learned.\" Allah admonished Moses as he did not attribute absolute knowledge to Him (Allah). So Allah inspired to him \"At the junction of the two seas there is a slave amongst my slaves who is more learned than you.\" Moses said, \"O my Lord! How can I meet him?\" Allah said: Take a fish in a large basket (and proceed) and you will find him at the place where you will lose the fish. So Moses set out along with his (servant) boy, Yusha` bin Noon and carried a fish in a large basket till they reached a rock, where they laid their heads (i.e. lay down) and slept. The fish came out of the basket and it took its way into the sea as in a tunnel. So it was an amazing thing for both Moses and his (servant) boy. They proceeded for the rest of that night and the following day. When the day broke, Moses said to his (servant) boy: \"Bring us our early meal. No doubt, we have suffered much fatigue in this journey.\" Moses did not get tired till he passed the place about which he was told. There the (servant) boy told Moses, \"Do you remember when we betook ourselves to the rock, I indeed forgot the fish.\" Moses remarked, \"That is what we have been seeking. So they went back retracing their footsteps, till they reached the rock. There they saw a man covered with a garment (or covering himself with his own garment). Moses greeted him. Al-Khadir replied saying, \"How do people greet each other in your land?\" Moses said, \"I am Moses.\" He asked, \"The Moses of Bani Israel?\" Moses replied in the affirmative and added, \"May I follow you so that you teach me of that knowledge which you have been taught.\" Al-Khadir replied, \"Verily! You will not be able to remain patient with me, O Moses! I have some of the knowledge of Allah which He has taught me and which you do not know, while you have some knowledge which Allah has taught you which I do not know.\" Moses said, \"Allah willing, you will find me patient and I will disobey no order of yours. So both of them set out walking along the seashore, as they did not have a boat. In the meantime a boat passed by them and they requested the crew of the boat to take them on board. The crew recognized Al-Khadir and took them on board without fare. Then a sparrow came and stood on the edge of the boat and dipped its beak once or twice in the sea. Al-Khadir said: \"O Moses! My knowledge and your knowledge have not decreased Allah's knowledge except as much as this sparrow has decreased the water of the sea with its beak.\" Al- Khadir went to one of the planks of the boat and plucked it out. Moses said, \"These people gave us a free lift but you have broken their boat and scuttled it so as to drown its people.\" Al-Khadir replied, \"Didn't I tell you that you will not be able to remain patient with me.\" Moses said, \"Call me not to account for what I forgot.\" The first (excuse) of Moses was that he had forgotten. Then they proceeded further and found a boy playing with other boys. Al-Khadir took hold of the boy's head from the top and plucked it out with his hands (i.e. killed him). Moses said, \"Have you killed an innocent soul who has killed none.\" Al-Khadir replied, \"Did I not tell you that you cannot remain patient with me?\" Then they both proceeded till when they came to the people of a town, they asked them for food, but they refused to entertain them. Then they found there a wall on the point of collapsing. Al-Khadir repaired it with his own hands. Moses said, \"If you had wished, surely you could have taken wages for it.\" Al-Khadir replied, \"This is the parting between you and me.\" The Prophet added, \"May Allah be Merciful to Moses! Would that he could have been more patient to learn more about his story with Al-Khadir. \"",
        "malay_translation": "Saya bertanya kepada Ibn `Abbas, \"Nauf-Al-Bakali mendakwa bahawa Musa (sahabat Khaidir) bukanlah Musa dari Bani Israel, tetapi Musa yang lain.\" Ibn `Abbas berkata bahawa musuh Allah (Nauf) adalah pendusta.  Dikatakan oleh Ubai bin Ka`b: Nabi saw. bersabda, \"Pada suatu ketika, Nabi Musa berdiri dan berkhutbah kepada Bani Israel. Dia ditanya, \"Siapakah orang yang paling alim di antara manusia?\" Dia menjawab, \"Akulah yang paling alim.\" Allah menegur Musa kerana tidak menisbatkan ilmu mutlak kepada-Nya (Allah). Lalu Allah mewahyukan kepadanya, \"Di pertemuan dua laut terdapat seorang hamba di antara hambaku yang lebih alim daripada kamu.\" Musa berkata, \"Ya Tuhanku, bagaimana aku dapat menemuinya?\" Allah berfirman: Ambillah seekor ikan dalam bakul besar (dan teruskan perjalanan) dan engkau akan menemuinya di tempat engkau kehilangan ikan itu.  Maka Musa berangkat bersama budaknya, Yusha` bin Nun dan membawa ikan dalam bakul besar sehingga mereka sampai ke sebuah batu, di mana mereka meletakkan kepala mereka (iaitu berbaring) dan tidur. Ikan itu keluar dari bakul dan masuk ke laut seperti terowong. Sungguh mengagumkan bagi Musa dan budaknya. Mereka meneruskan perjalanan sepanjang malam dan keesokan harinya.  Ketika matahari terbit, Musa berkata kepada budaknya, \"Bawakan kami makanan pagi.  Sesungguhnya, kami telah mengalami kepenatan dalam perjalanan ini.\" Musa tidak letih sehingga dia sampai ke tempat yang dijanjikan kepadanya. Di situ, budaknya berkata kepada Musa, \"Ingatkah ketika kita pergi ke batu itu, aku benar-benar lupa ikan itu.\" Musa berkata, \"Itulah yang kita cari.\" Lalu mereka kembali menyusuri jejak langkah mereka, sehingga sampai ke batu itu. Di sana mereka melihat seorang lelaki yang menutupi dirinya dengan kain. Musa memberi salam kepadanya. Al-Khadir menjawab, \"Bagaimana orang memberi salam di negeri kamu?\" Musa berkata, \"Aku adalah Musa.\" Dia bertanya, \"Musa dari Bani Israel?\" Musa membenarkan dan menambahkan, \"Bolehkah aku mengikut engkau agar engkau mengajarkan kepadaku ilmu yang telah engkau diajarkan?\" Al-Khadir menjawab, \"Sesungguhnya, engkau tidak akan mampu bersabar dengan aku, wahai Musa! Aku memiliki sebahagian ilmu Allah yang telah Dia ajarkan kepadaku dan yang tidak engkau ketahui, sementara engkau memiliki sebahagian ilmu yang Allah telah ajarkan kepadamu yang tidak aku ketahui.\" Musa berkata, \"Insya Allah, engkau akan mendapati aku bersabar dan aku tidak akan melanggar perintahmu. Maka kedua-duanya berjalan di tepi pantai, kerana mereka tidak mempunyai bot. Sementara itu, sebuah bot lalu dan mereka meminta anak kapal untuk membawa mereka ke dalam bot tersebut. Anak kapal mengenali Al-Khadir dan membawa mereka ke dalam bot tanpa bayaran. Kemudian seekor burung datang dan hinggap di tepi bot dan mencelup paruhnya sekali atau dua kali ke dalam laut. Al-Khadir berkata, \"Wahai Musa!  Ilmuku dan ilmumu tidak mengurangi ilmu Allah melainkan sebanyak burung ini telah mengurangi air laut dengan paruhnya.\" Al-Khadir pergi ke salah satu papan bot dan mencabutnya. Musa berkata, \"Orang-orang ini memberi kami tumpangan percuma, tetapi engkau telah menghancurkan bot mereka dan menenggelamkannya supaya menenggelamkan orang-orangnya.\" Al-Khadir menjawab, \"Bukankah aku telah memberitahu engkau bahawa engkau tidak akan mampu bersabar denganku?\" Musa berkata, \"Janganlah engkau menghukumku atas apa yang telah aku lupakan.\" Alasan pertama Musa adalah dia lupa. Kemudian mereka meneruskan perjalanan dan mendapati seorang budak bermain dengan budak-budak lain. Al-Khadir memegang kepala budak itu dari atas dan mencabutnya dengan tangannya (iaitu membunuhnya). Musa berkata, \"Adakah engkau membunuh seorang jiwa yang tidak membunuh sesiapa?\" Al-Khadir menjawab, \"Bukankah aku telah memberitahu engkau bahawa engkau tidak dapat bersabar denganku?\" Kemudian mereka berdua meneruskan perjalanan sehingga apabila mereka sampai ke penduduk suatu kota, mereka meminta makanan, tetapi mereka enggan menerima mereka. Kemudian mereka mendapati di sana sebuah dinding yang hampir roboh. Al-Khadir membaiki dinding itu dengan tangannya sendiri. Musa berkata, \"Sekiranya engkau mahu, pasti engkau boleh mengambil upah untuknya.\" Al-Khadir menjawab, \"Inilah perpisahan antara kita berdua.\" Nabi menambah, \"Semoga Allah merahmati Musa! Sekiranya dia lebih bersabar untuk mempelajari lebih lanjut tentang kisahnya dengan Al-Khadir.\" ",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا عَمْرٌو، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ جُبَيْرٍ، قَالَ قُلْتُ لاِبْنِ عَبَّاسٍ إِنَّ نَوْفًا الْبِكَالِيَّ يَزْعُمُ أَنَّ مُوسَى لَيْسَ بِمُوسَى بَنِي إِسْرَائِيلَ، إِنَّمَا هُوَ مُوسَى آخَرُ‏.‏ فَقَالَ كَذَبَ عَدُوُّ اللَّهِ، حَدَّثَنَا أُبَىُّ بْنُ كَعْبٍ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ قَامَ مُوسَى النَّبِيُّ خَطِيبًا فِي بَنِي إِسْرَائِيلَ، فَسُئِلَ أَىُّ النَّاسِ أَعْلَمُ فَقَالَ أَنَا أَعْلَمُ‏.‏ فَعَتَبَ اللَّهُ عَلَيْهِ، إِذْ لَمْ يَرُدَّ الْعِلْمَ إِلَيْهِ، فَأَوْحَى اللَّهُ إِلَيْهِ أَنَّ عَبْدًا مِنْ عِبَادِي بِمَجْمَعِ الْبَحْرَيْنِ هُوَ أَعْلَمُ مِنْكَ‏.‏ قَالَ يَا رَبِّ وَكَيْفَ بِهِ فَقِيلَ لَهُ احْمِلْ حُوتًا فِي مِكْتَلٍ فَإِذَا فَقَدْتَهُ فَهْوَ ثَمَّ، فَانْطَلَقَ وَانْطَلَقَ بِفَتَاهُ يُوشَعَ بْنِ نُونٍ، وَحَمَلاَ حُوتًا فِي مِكْتَلٍ، حَتَّى كَانَا عِنْدَ الصَّخْرَةِ وَضَعَا رُءُوسَهُمَا وَنَامَا فَانْسَلَّ الْحُوتُ مِنَ الْمِكْتَلِ فَاتَّخَذَ سَبِيلَهُ فِي الْبَحْرِ سَرَبًا، وَكَانَ لِمُوسَى وَفَتَاهُ عَجَبًا، فَانْطَلَقَا بَقِيَّةَ لَيْلَتِهِمَا وَيَوْمِهِمَا فَلَمَّا أَصْبَحَ قَالَ مُوسَى لِفَتَاهُ آتِنَا غَدَاءَنَا، لَقَدْ لَقِينَا مِنْ سَفَرِنَا هَذَا نَصَبًا، وَلَمْ يَجِدْ مُوسَى مَسًّا مِنَ النَّصَبِ حَتَّى جَاوَزَ الْمَكَانَ الَّذِي أُمِرَ بِهِ‏.‏ فَقَالَ لَهُ فَتَاهُ أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ فَإِنِّي نَسِيتُ الْحُوتَ، قَالَ مُوسَى ذَلِكَ مَا كُنَّا نَبْغِي، فَارْتَدَّا عَلَى آثَارِهِمَا قَصَصًا، فَلَمَّا انْتَهَيَا إِلَى الصَّخْرَةِ إِذَا رَجُلٌ مُسَجًّى بِثَوْبٍ ـ أَوْ قَالَ تَسَجَّى بِثَوْبِهِ ـ فَسَلَّمَ مُوسَى‏.‏ فَقَالَ الْخَضِرُ وَأَنَّى بِأَرْضِكَ السَّلاَمُ فَقَالَ أَنَا مُوسَى‏.‏ فَقَالَ مُوسَى بَنِي إِسْرَائِيلَ قَالَ نَعَمْ‏.‏ قَالَ هَلْ أَتَّبِعُكَ عَلَى أَنْ تُعَلِّمَنِي مِمَّا عُلِّمْتَ رَشَدًا قَالَ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا، يَا مُوسَى إِنِّي عَلَى عِلْمٍ مِنْ عِلْمِ اللَّهِ عَلَّمَنِيهِ لاَ تَعْلَمُهُ أَنْتَ، وَأَنْتَ عَلَى عِلْمٍ عَلَّمَكَهُ لاَ أَعْلَمُهُ‏.‏ قَالَ سَتَجِدُنِي إِنْ شَاءَ اللَّهُ صَابِرًا، وَلاَ أَعْصِي لَكَ أَمْرًا، فَانْطَلَقَا يَمْشِيَانِ عَلَى سَاحِلِ الْبَحْرِ لَيْسَ لَهُمَا سَفِينَةٌ، فَمَرَّتْ بِهِمَا سَفِينَةٌ، فَكَلَّمُوهُمْ أَنْ يَحْمِلُوهُمَا، فَعُرِفَ الْخَضِرُ، فَحَمَلُوهُمَا بِغَيْرِ نَوْلٍ، فَجَاءَ عُصْفُورٌ فَوَقَعَ عَلَى حَرْفِ السَّفِينَةِ، فَنَقَرَ نَقْرَةً أَوْ نَقْرَتَيْنِ فِي الْبَحْرِ‏.‏ فَقَالَ الْخَضِرُ يَا مُوسَى، مَا نَقَصَ عِلْمِي وَعِلْمُكَ مِنْ عِلْمِ اللَّهِ إِلاَّ كَنَقْرَةِ هَذَا الْعُصْفُورِ فِي الْبَحْرِ‏.‏ فَعَمَدَ الْخَضِرُ إِلَى لَوْحٍ مِنْ أَلْوَاحِ السَّفِينَةِ فَنَزَعَهُ‏.‏ فَقَالَ مُوسَى قَوْمٌ حَمَلُونَا بِغَيْرِ نَوْلٍ، عَمَدْتَ إِلَى سَفِينَتِهِمْ فَخَرَقْتَهَا لِتُغْرِقَ أَهْلَهَا قَالَ أَلَمْ أَقُلْ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا قَالَ لاَ تُؤَاخِذْنِي بِمَا نَسِيتُ‏.‏ فَكَانَتِ الأُولَى مِنْ مُوسَى نِسْيَانًا‏.‏ فَانْطَلَقَا فَإِذَا غُلاَمٌ يَلْعَبُ مَعَ الْغِلْمَانِ، فَأَخَذَ الْخَضِرُ بِرَأْسِهِ مِنْ أَعْلاَهُ فَاقْتَلَعَ رَأْسَهُ بِيَدِهِ‏.‏ فَقَالَ مُوسَى أَقَتَلْتَ نَفْسًا زَكِيَّةً بِغَيْرِ نَفْسٍ قَالَ أَلَمْ أَقُلْ لَكَ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا ـ قَالَ ابْنُ عُيَيْنَةَ وَهَذَا أَوْكَدُ ـ فَانْطَلَقَا حَتَّى إِذَا أَتَيَا أَهْلَ قَرْيَةٍ اسْتَطْعَمَا أَهْلَهَا، فَأَبَوْا أَنْ يُضَيِّفُوهُمَا، فَوَجَدَا فِيهَا جِدَارًا يُرِيدُ أَنْ يَنْقَضَّ فَأَقَامَهُ‏.‏ قَالَ الْخَضِرُ بِيَدِهِ فَأَقَامَهُ‏.‏ فَقَالَ لَهُ مُوسَى لَوْ شِئْتَ لاَتَّخَذْتَ عَلَيْهِ أَجْرًا‏.‏ قَالَ هَذَا فِرَاقُ بَيْنِي وَبَيْنِكَ ‏\"‏‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ يَرْحَمُ اللَّهُ مُوسَى، لَوَدِدْنَا لَوْ صَبَرَ حَتَّى يُقَصَّ عَلَيْنَا مِنْ أَمْرِهِمَا ‏\"‏‏.‏"
      },
      {
        "id": 123,
        "hadith_number": "123",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perjuangan Di Jalan Allah dan Motifnya",
        "perawi_melayu": "Dikisahkan oleh Abu Musa:",
        "english_text": "A man came to the Prophet (ﷺ) and asked, \"O Allah's Messenger (ﷺ)! What kind of fighting is in Allah's cause? (I ask this), for some of us fight because of being enraged and angry and some for the sake of his pride and haughtiness.\" The Prophet (ﷺ) raised his head (as the questioner was standing) and said, \"He who fights so that Allah's Word (Islam) should be superior, then he fights in Allah's cause.\"",
        "malay_translation": "Seorang lelaki datang kepada Nabi (ﷺ) dan bertanya, \"Wahai Rasulullah (ﷺ)! Apakah jenis peperangan di jalan Allah? (Saya bertanya ini), kerana di antara kita ada yang berperang disebabkan kemarahan dan kebencian dan ada yang kerana kesombongan dan keangkuhan mereka.\" Nabi (ﷺ) mengangkat kepalanya (sementara si penanya berdiri) dan bersabda, \"Barangsiapa yang berperang supaya Kalam Allah (Islam) menjadi yang tertinggi, maka dia berperang di jalan Allah.\"",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ، قَالَ أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مُوسَى، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ، مَا الْقِتَالُ فِي سَبِيلِ اللَّهِ فَإِنَّ أَحَدَنَا يُقَاتِلُ غَضَبًا، وَيُقَاتِلُ حَمِيَّةً‏.‏ فَرَفَعَ إِلَيْهِ رَأْسَهُ ـ قَالَ وَمَا رَفَعَ إِلَيْهِ رَأْسَهُ إِلاَّ أَنَّهُ كَانَ قَائِمًا ـ فَقَالَ ‏ \"‏ مَنْ قَاتَلَ لِتَكُونَ كَلِمَةُ اللَّهِ هِيَ الْعُلْيَا فَهُوَ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ ‏\"‏‏.‏"
      },
      {
        "id": 124,
        "hadith_number": "124",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kebolehan Melakukan Ibadah Haji Walaupun Tidak Tepat Waktu",
        "perawi_melayu": "Dikisahkan oleh `Abdullah",
        "english_text": "I saw the Prophet (ﷺ) near the Jamra and the people were asking him questions (about religious problems). A man asked, \"O Allah's Messenger (ﷺ)! I have slaughtered the Hadi (animal) before doing the Rami.\" The Prophet (ﷺ) replied, \"Do the Rami (now) and there is no harm.\" Another person asked, \"O Allah's Messenger (ﷺ)! I got my head shaved before slaughtering the animal.\" The Prophet (ﷺ) replied, \"Do the slaughtering (now) and there is no harm.\" So on that day, when the Prophet (ﷺ) was asked about anything as regards the ceremonies of Hajj performed before or after its due time his reply was, \"Do it (now) and there is no harm.\"",
        "malay_translation": "Saya melihat Nabi (ﷺ) berhampiran Jamrah dan orang ramai bertanya kepadanya mengenai masalah agama. Seorang lelaki bertanya, \"Wahai Rasulullah (ﷺ)! Saya telah menyembelih Hadi (haiwan) sebelum melakukan Rami.\" Nabi (ﷺ) menjawab, \"Lakukan Rami (sekarang) dan tiada salahnya.\"  Seseorang yang lain bertanya, \"Wahai Rasulullah (ﷺ)! Saya telah mencukur kepala saya sebelum menyembelih haiwan tersebut.\" Nabi (ﷺ) menjawab, \"Lakukan penyembelihan (sekarang) dan tiada salahnya.\"  Oleh itu, pada hari itu, apabila Nabi (ﷺ) ditanya mengenai sebarang amalan haji yang dilakukan sebelum atau selepas waktunya, jawapan Baginda adalah, \"Lakukan sekarang dan tiada salahnya.\"",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ، عَنِ الزُّهْرِيِّ، عَنْ عِيسَى بْنِ طَلْحَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم عِنْدَ الْجَمْرَةِ وَهُوَ يُسْأَلُ، فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ نَحَرْتُ قَبْلَ أَنْ أَرْمِيَ‏.‏ قَالَ ‏\"‏ ارْمِ وَلاَ حَرَجَ ‏\"‏‏.‏ قَالَ آخَرُ يَا رَسُولَ اللَّهِ حَلَقْتُ قَبْلَ أَنْ أَنْحَرَ‏.‏ قَالَ ‏\"‏ انْحَرْ وَلاَ حَرَجَ ‏\"‏‏.‏ فَمَا سُئِلَ عَنْ شَىْءٍ قُدِّمَ وَلاَ أُخِّرَ إِلاَّ قَالَ افْعَلْ وَلاَ حَرَجَ‏.‏"
      },
      {
        "id": 125,
        "hadith_number": "125",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pertanyaan Mengenai Roh dan Jawapan Nabi SAW",
        "perawi_melayu": "Dikisahkan oleh Abdullah",
        "english_text": "While I was going with the Prophet (ﷺ) through the ruins of Medina and he was reclining on a date-palm leaf stalk, some Jews passed by. Some of them said to the others: Ask him (the Prophet) about the spirit. Some of them said that they should not ask him that question as he might give a reply which would displease them. But some of them insisted on asking, and so one of them stood up and asked, \"O Abul-Qasim ! What is the spirit?\" The Prophet (ﷺ) remained quiet. I thought he was being inspired Divinely. So I stayed till that state of the Prophet (while being inspired) was over. The Prophet (ﷺ) then said, \"And they ask you (O Muhammad) concerning the spirit --Say: The spirit -- its knowledge is with my Lord. And of knowledge you (mankind) have been given only a little).\" (17.85)",
        "malay_translation": "Ketika aku berjalan bersama Nabi SAW melewati reruntuhan Madinah dan baginda bersandar pada pelepah kurma, beberapa orang Yahudi lalu. Sebagian dari mereka berkata kepada yang lain: Tanya beliau (Nabi) tentang roh. Sebagian lagi berkata jangan bertanya hal itu kerana mungkin beliau akan menjawab dengan sesuatu yang tidak disenangi. Namun sebagian lagi bersikeras untuk bertanya, dan salah seorang dari mereka berdiri dan bertanya, \"Wahai Abul-Qasim! Apakah itu roh?\" Nabi SAW diam. Aku mengira baginda sedang menerima wahyu. Maka aku menunggu hingga keadaan tersebut berakhir. Kemudian Nabi SAW bersabda, \"Dan mereka bertanya kepadamu (wahai Muhammad) tentang roh - Katakanlah: Roh itu - Pengetahuannya adalah pada Tuhanku. Dan kamu (manusia) hanya diberi sedikit ilmu.\"(17.85)",
        "arabic_text": "حَدَّثَنَا قَيْسُ بْنُ حَفْصٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ حَدَّثَنَا الأَعْمَشُ، سُلَيْمَانُ عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ بَيْنَا أَنَا أَمْشِي، مَعَ النَّبِيِّ صلى الله عليه وسلم فِي خَرِبِ الْمَدِينَةِ، وَهُوَ يَتَوَكَّأُ عَلَى عَسِيبٍ مَعَهُ، فَمَرَّ بِنَفَرٍ مِنَ الْيَهُودِ، فَقَالَ بَعْضُهُمْ لِبَعْضٍ سَلُوهُ عَنِ الرُّوحِ‏.‏ وَقَالَ بَعْضُهُمْ لاَ تَسْأَلُوهُ لاَ يَجِيءُ فِيهِ بِشَىْءٍ تَكْرَهُونَهُ‏.‏ فَقَالَ بَعْضُهُمْ لَنَسْأَلَنَّهُ‏.‏ فَقَامَ رَجُلٌ مِنْهُمْ فَقَالَ يَا أَبَا الْقَاسِمِ، مَا الرُّوحُ فَسَكَتَ‏.‏ فَقُلْتُ إِنَّهُ يُوحَى إِلَيْهِ‏.‏ فَقُمْتُ، فَلَمَّا انْجَلَى عَنْهُ، قَالَ ‏{‏وَيَسْأَلُونَكَ عَنِ الرُّوحِ قُلِ الرُّوحُ مِنْ أَمْرِ رَبِّي وَمَا أُوتُيتُمْ مِنَ الْعِلْمِ إِلاَّ قَلِيلاً‏}‏‏.‏ قَالَ الأَعْمَشُ هَكَذَا فِي قِرَاءَتِنَا‏.‏"
      },
      {
        "id": 126,
        "hadith_number": "126",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Sabda Nabi SAW Tentang Pembongkaran Kaabah dan Pembuatan Pintu-Pintu",
        "perawi_melayu": "Diriwayatkan oleh Aswad",
        "english_text": "Ibn Az-Zubair said to me, \"Aisha used to tell you secretly a number of things. What did she tell you about the Ka`ba?\" I replied, \"She told me that once the Prophet (ﷺ) said, 'O `Aisha! Had not your people been still close to the pre-Islamic period of ignorance (infidelity)! I would have dismantled the Ka`ba and would have made two doors in it; one for entrance and the other for exit.\" Later on Ibn Az-Zubair did the same.",
        "malay_translation": "Ibn Az-Zubair berkata kepadaku, \"Aisha sering memberitahumu beberapa perkara secara rahsia. Apakah yang dia ceritakan tentang Kaabah?\" Aku menjawab, \"Dia memberitahuku bahawa suatu ketika Nabi SAW bersabda, 'Wahai `Aisha! Sekiranya kaummu masih dekat dengan zaman jahiliah! Pasti aku akan membongkar Kaabah dan membuat dua pintu padanya; satu untuk masuk dan satu lagi untuk keluar.\" Kemudian Ibn Az-Zubair melakukan perkara yang sama.",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ، قَالَ قَالَ لِي ابْنُ الزُّبَيْرِ كَانَتْ عَائِشَةُ تُسِرُّ إِلَيْكَ كَثِيرًا فَمَا حَدَّثَتْكَ فِي الْكَعْبَةِ قُلْتُ قَالَتْ لِي قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ يَا عَائِشَةُ، لَوْلاَ قَوْمُكِ حَدِيثٌ عَهْدُهُمْ ـ قَالَ ابْنُ الزُّبَيْرِ بِكُفْرٍ ـ لَنَقَضْتُ الْكَعْبَةَ فَجَعَلْتُ لَهَا بَابَيْنِ باب يَدْخُلُ النَّاسُ، وَبَابٌ يَخْرُجُونَ ‏\"‏‏.‏ فَفَعَلَهُ ابْنُ الزُّبَيْرِ‏.‏"
      },
      {
        "id": 127,
        "hadith_number": "127",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pernyataan Ali",
        "perawi_melayu": "Dikisahkan oleh Abu at-Tufail:",
        "english_text": "The above mentioned Statement of `Ali.",
        "malay_translation": "Perkataan `Ali yang disebutkan di atas.",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ مَعْرُوفِ بْنِ خَرَّبُوذٍ عَنْ أَبِي الطُّفَيْلِ عَنْ عَلِيٍّ بِذَلِكَ‏.‏"
      },
      {
        "id": 128,
        "hadith_number": "128",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ketetapan Allah Bagi Orang Yang Bersaksi Keesaan Allah dan Kenabian Muhammad",
        "perawi_melayu": "Dikisahkan oleh Anas bin Malik",
        "english_text": "\"Once Mu`adh was along with Allah's Messenger (ﷺ) as a companion rider. Allah's Messenger (ﷺ) said, \"O Mu`adh bin Jabal.\" Mu`adh replied, \"Labbaik and Sa`daik. O Allah's Messenger (ﷺ)!\" Again the Prophet (ﷺ) said, \"O Mu`adh!\" Mu`adh said thrice, \"Labbaik and Sa`daik, O Allah's Messenger (ﷺ)!\" Allah's Messenger (ﷺ) said, \"There is none who testifies sincerely that none has the right to be worshipped but Allah and Muhammad is his Apostle, except that Allah, will save him from the Hell-fire.\" Mu`adh said, \"O Allah's Messenger (ﷺ) ! Should I not inform the people about it so that they may have glad tidings?\" He replied, \"When the people hear about it, they will solely depend on it.\" Then Mu`adh narrated the above-mentioned Hadith just before his death, being afraid of committing sin (by not telling the knowledge).\"",
        "malay_translation": "\"Pada suatu ketika, Mu`adh bersama Rasulullah SAW sebagai penumpang tunggangan yang sama. Rasulullah SAW bersabda, \"Wahai Mu`adh bin Jabal.\" Mu`adh menjawab, \"Labbaik dan Sa`daik, wahai Rasulullah SAW!\"  Rasulullah SAW kembali bersabda, \"Wahai Mu`adh!\" Mu`adh menjawab tiga kali, \"Labbaik dan Sa`daik, wahai Rasulullah SAW!\" Rasulullah SAW bersabda, \"Tidaklah seseorang yang bersaksi dengan ikhlas bahawa tiada Tuhan yang berhak disembah melainkan Allah dan Muhammad adalah utusan-Nya, melainkan Allah akan menyelamatkannya dari api neraka.\" Mu`adh bertanya, \"Wahai Rasulullah SAW! Adakah saya tidak perlu memberitahu perkara ini kepada orang ramai agar mereka mendapat kabar gembira?\" Baginda menjawab, \"Apabila orang ramai mendengarnya, mereka akan terlalu bergantung kepada perkara itu saja.\" Kemudian Mu`adh meriwayatkan hadis ini, tepat sebelum kematiannya, disebabkan khuatir berdosa (kerana tidak menyampaikan ilmu itu).\"",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، قَالَ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم وَمُعَاذٌ رَدِيفُهُ عَلَى الرَّحْلِ قَالَ ‏\"‏ يَا مُعَاذُ بْنَ جَبَلٍ ‏\"‏‏.‏ قَالَ لَبَّيْكَ يَا رَسُولَ اللَّهِ وَسَعْدَيْكَ‏.‏ قَالَ ‏\"‏ يَا مُعَاذُ ‏\"‏‏.‏ قَالَ لَبَّيْكَ يَا رَسُولَ اللَّهِ وَسَعْدَيْكَ‏.‏ ثَلاَثًا‏.‏ قَالَ ‏\"‏ مَا مِنْ أَحَدٍ يَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ صِدْقًا مِنْ قَلْبِهِ إِلاَّ حَرَّمَهُ اللَّهُ عَلَى النَّارِ ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ، أَفَلاَ أُخْبِرُ بِهِ النَّاسَ فَيَسْتَبْشِرُوا قَالَ ‏\"‏ إِذًا يَتَّكِلُوا ‏\"‏‏.‏ وَأَخْبَرَ بِهَا مُعَاذٌ عِنْدَ مَوْتِهِ تَأَثُّمًا ‏.‏"
      },
      {
        "id": 129,
        "hadith_number": "129",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Janji Syurga Kepada Orang Yang Menyerah Diri Kepada Allah Tanpa Syirik",
        "perawi_melayu": "Dikisahkan oleh Anas:",
        "english_text": "I was informed that the Prophet (ﷺ) had said to Mu`adh, \"Whosoever will meet Allah without associating anything in worship with Him will go to Paradise.\" Mu`adh asked the Prophet, \"Should I not inform the people of this good news?\" The Prophet (ﷺ) replied, \"No, I am afraid, lest they should depend upon it (absolutely).\"",
        "malay_translation": "Saya diberitahu bahawa Nabi (ﷺ) telah bersabda kepada Mu`adh, \"Sesiapa yang bertemu dengan Allah tanpa menyekutukan-Nya dalam ibadah akan masuk syurga.\" Mu`adh bertanya kepada Nabi, \"Tidakkah patut saya sampaikan berita gembira ini kepada orang ramai?\" Nabi (ﷺ) menjawab, \"Tidak, saya khuatir mereka akan terlalu bergantung kepada berita ini (sepenuhnya).\" ",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ أَبِي قَالَ، سَمِعْتُ أَنَسًا، قَالَ ذُكِرَ لِي أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لِمُعَاذٍ ‏\"‏ مَنْ لَقِيَ اللَّهَ لاَ يُشْرِكُ بِهِ شَيْئًا دَخَلَ الْجَنَّةَ ‏\"‏‏.‏ قَالَ أَلاَ أُبَشِّرُ النَّاسَ قَالَ ‏\"‏ لاَ، إِنِّي أَخَافُ أَنْ يَتَّكِلُوا ‏\"‏‏.‏"
      },
      {
        "id": 130,
        "hadith_number": "130",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keharusan Mandi Junub bagi Wanita dan Kemiripan Anak dengan Ibu",
        "perawi_melayu": "Daripada Um Salamah:",
        "english_text": "Um-Sulaim datang kepada Rasulullah (ﷺ) dan berkata, \"Sesungguhnya Allah tidak malu untuk memberitahukan kebenaran. Adakah wajib bagi seorang wanita untuk mandi junub setelah mengalami mimpi basah?\" Nabi menjawab, \"Ya, jika dia melihat keluarnya air mani.\" Um Salamah menutup mukanya dan bertanya, \"Wahai Rasulullah (ﷺ)! Adakah seorang wanita mengalami keluarnya air mani?\" Baginda menjawab, \"Ya, jadilah tangan kananmu dalam debu (Ungkapan Arab yang bermaksud, 'Engkau tidak akan mencapai kebaikan'), dan itulah sebabnya anak menyerupai ibunya.\"",
        "malay_translation": "Um Sulaim datang kepada Rasulullah (ﷺ) dan bertanya, \"Sesungguhnya Allah tidak malu untuk memberitahu kebenaran. Adakah wajib bagi wanita untuk mandi junub setelah mimpi basah?\" Rasulullah menjawab, \"Ya, jika dia melihat keluarnya air mani.\" Um Salamah menutupi mukanya dan bertanya, \"Wahai Rasulullah (ﷺ), adakah wanita mengalami keluarnya air mani?\" Baginda menjawab, \"Ya. Jadilah tangan kananmu dalam debu (ungkapan Arab yang bermaksud, engkau tidak akan mencapai kebaikan), dan itulah sebabnya anak menyerupai ibunya.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ أَخْبَرَنَا أَبُو مُعَاوِيَةَ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ ابْنَةِ أُمِّ سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ جَاءَتْ أُمُّ سُلَيْمٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ لاَ يَسْتَحْيِي مِنَ الْحَقِّ، فَهَلْ عَلَى الْمَرْأَةِ مِنْ غُسْلٍ إِذَا احْتَلَمَتْ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِذَا رَأَتِ الْمَاءَ ‏\"‏‏.‏ فَغَطَّتْ أُمُّ سَلَمَةَ ـ تَعْنِي وَجْهَهَا ـ وَقَالَتْ يَا رَسُولَ اللَّهِ وَتَحْتَلِمُ الْمَرْأَةُ قَالَ ‏\"‏ نَعَمْ تَرِبَتْ يَمِينُكِ فَبِمَ يُشْبِهُهَا وَلَدُهَا ‏\"‏‏.‏"
      },
      {
        "id": 131,
        "hadith_number": "131",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pokok Kurma: Simbol Ketabahan Umat Islam",
        "perawi_melayu": "Dikisahkan oleh `Abdullah bin `Umar:",
        "english_text": "Once Allah's Messenger (ﷺ) said, \"Amongst the trees there is a tree, the leaves of which do not fall and is like a Muslim, tell me the name of that tree.\" Everybody started thinking about the trees of the desert areas and I thought of the date-palm tree but felt shy (to answer). The others asked, \"O Allah's Apostle! inform us of it.\" He replied, \"it is the date-palm tree.\" I told my father what had come to my mind and on that he said, \"Had you said it I would have preferred it to such and such a thing that I might possess.\"",
        "malay_translation": "Suatu ketika Rasulullah saw bersabda, \"Di antara pokok-pokokan terdapat sejenis pokok yang daunnya tidak gugur, dan ia seperti seorang Muslim. Beritahu aku nama pokok itu.\" Semua orang mula memikirkan pokok-pokok di kawasan gurun, dan aku terfikirkan pokok kurma, tetapi aku merasa segan untuk menjawab. Orang lain bertanya, \"Ya Rasulullah! Beritahu kami tentangnya.\" Baginda menjawab, \"Ia ialah pokok kurma.\"  Aku menceritakan kepada ayahku apa yang terlintas di fikiran aku, dan dia berkata, \"Sekiranya engkau menyebutnya, aku lebih suka ia daripada benda-benda yang aku miliki itu.\"",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ مِنَ الشَّجَرِ شَجَرَةً لاَ يَسْقُطُ وَرَقُهَا، وَهِيَ مَثَلُ الْمُسْلِمِ، حَدِّثُونِي مَا هِيَ ‏\"‏‏.‏ فَوَقَعَ النَّاسُ فِي شَجَرِ الْبَادِيَةِ، وَوَقَعَ فِي نَفْسِي أَنَّهَا النَّخْلَةُ‏.‏ قَالَ عَبْدُ اللَّهِ فَاسْتَحْيَيْتُ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ، أَخْبِرْنَا بِهَا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هِيَ النَّخْلَةُ ‏\"‏‏.‏ قَالَ عَبْدُ اللَّهِ فَحَدَّثْتُ أَبِي بِمَا وَقَعَ فِي نَفْسِي فَقَالَ لأَنْ تَكُونَ قُلْتَهَا أَحَبُّ إِلَىَّ مِنْ أَنْ يَكُونَ لِي كَذَا وَكَذَا‏.‏"
      },
      {
        "id": 132,
        "hadith_number": "132",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Membersihkan Diri Selepas Kencing Nanah",
        "perawi_melayu": "Dikisahkan oleh `Ali",
        "english_text": "I used to get the emotional urethral discharge frequently so I requested Al-Miqdad to ask the Prophet (ﷺ) about it. Al-Miqdad asked him and he replied, \"One has to perform ablution (after it).\" (See Hadith No. 269).",
        "malay_translation": "Saya sering mengalami keluarnya cairan nanah dari uretra. Oleh itu, saya meminta Al-Miqdad bertanya kepada Rasulullah SAW mengenainya. Al-Miqdad bertanya dan Baginda menjawab, \"Seseorang perlu mandi hadas (setelahnya).\" (Lihat Hadis No. 269).",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ، عَنِ الأَعْمَشِ، عَنْ مُنْذِرٍ الثَّوْرِيِّ، عَنْ مُحَمَّدٍ ابْنِ الْحَنَفِيَّةِ، عَنْ عَلِيٍّ، قَالَ كُنْتُ رَجُلاً مَذَّاءً فَأَمَرْتُ الْمِقْدَادَ أَنْ يَسْأَلَ النَّبِيَّ صلى الله عليه وسلم فَسَأَلَهُ فَقَالَ ‏ \"‏ فِيهِ الْوُضُوءُ ‏\"‏‏.‏"
      },
      {
        "id": 133,
        "hadith_number": "133",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ketetapan Tempat Mengikhlaskan Ihram bagi Jemaah Haji",
        "perawi_melayu": "Diceritakan oleh Abdullah bin `Umar",
        "english_text": "\"A man got up in the mosque and said: O Allah's Messenger (ﷺ) 'At which place you order us that we should assume the Ihram?' Allah's Messenger (ﷺ) replied, 'The residents of Medina should assure the Ihram from Dhil-Hulaifa, the people of Syria from Al-Juhfa and the people of Najd from Qarn.\" Ibn `Umar further said, \"The people consider that Allah's Messenger (ﷺ) had also said, 'The residents of Yemen should assume Ihram from Yalamlam.' \" Ibn `Umar used to say, \"I do not: remember whether Allah's Messenger (ﷺ) had said the last statement or not?\"",
        "malay_translation": "“Seseorang berdiri di masjid dan bertanya: Wahai Rasulullah, di manakah tempat yang Baginda suruh kita mengikhlaskan ihram? Rasulullah SAW menjawab, ‘Orang-orang Madinah hendaklah mengikhlaskan ihram mereka dari Dhil-Hulaifa, penduduk Syria dari Al-Juhfa, dan penduduk Najd dari Qarn.’” Ibn `Umar kemudian berkata, “Orang ramai beranggapan bahawa Rasulullah SAW juga telah bersabda, ‘Penduduk Yaman hendaklah mengikhlaskan ihram mereka dari Yalamlam.’” Ibn `Umar sering berkata, “Saya tidak pasti sama ada Rasulullah SAW telah bersabda demikian atau tidak.”",
        "arabic_text": "حَدَّثَنِي قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ، قَالَ حَدَّثَنَا نَافِعٌ، مَوْلَى عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ،‏.‏ أَنَّ رَجُلاً، قَامَ فِي الْمَسْجِدِ فَقَالَ يَا رَسُولَ اللَّهِ، مِنْ أَيْنَ تَأْمُرُنَا أَنْ نُهِلَّ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يُهِلُّ أَهْلُ الْمَدِينَةِ مِنْ ذِي الْحُلَيْفَةِ، وَيُهِلُّ أَهْلُ الشَّأْمِ مِنَ الْجُحْفَةِ، وَيُهِلُّ أَهْلُ نَجْدٍ مِنْ قَرْنٍ ‏\"‏‏.‏ وَقَالَ ابْنُ عُمَرَ وَيَزْعُمُونَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ وَيُهِلُّ أَهْلُ الْيَمَنِ مِنْ يَلَمْلَمَ ‏\"‏‏.‏ وَكَانَ ابْنُ عُمَرَ يَقُولُ لَمْ أَفْقَهْ هَذِهِ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 134,
        "hadith_number": "134",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pakaian Muhrim (Orang yang Berniat Umrah atau Haji)",
        "perawi_melayu": "Diriwayatkan oleh Ibn Umar",
        "english_text": "A man asked the Prophet (ﷺ) : \"What (kinds of clothes) should a Muhrim (a Muslim intending to perform `Umra or Hajj) wear? He replied, \"He should not wear a shirt, a turban, trousers, a head cloak or garment scented with saffron or Wars (kinds of perfumes). And if he has no slippers, then he can use Khuffs (socks made from thick fabric or leather) but the socks should be cut short so as to make the ankles bare.\" (See Hadith No. 615, Vol. 2).",
        "malay_translation": "Seorang lelaki bertanya kepada Rasulullah SAW, \"Apakah pakaian yang sepatutnya dipakai oleh seorang Muhrim (orang Islam yang berniat untuk menunaikan Umrah atau Haji)?\" Baginda menjawab, \"Dia tidak sepatutnya memakai baju kemeja, serban, seluar panjang, penutup kepala, atau pakaian yang berbau safron atau Wars (jenis minyak wangi). Dan jika dia tidak mempunyai kasut, dia boleh menggunakan Khuffs (stokin tebal daripada kain atau kulit) tetapi stokin itu hendaklah dipotong pendek supaya buku lali kelihatan.\" (Lihat Hadis No. 615, Jilid 2).",
        "arabic_text": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَعَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَجُلاً سَأَلَهُ مَا يَلْبَسُ الْمُحْرِمُ فَقَالَ ‏ \"‏ لاَ يَلْبَسِ الْقَمِيصَ وَلاَ الْعِمَامَةَ وَلاَ السَّرَاوِيلَ وَلاَ الْبُرْنُسَ وَلاَ ثَوْبًا مَسَّهُ الْوَرْسُ أَوِ الزَّعْفَرَانُ، فَإِنْ لَمْ يَجِدِ النَّعْلَيْنِ فَلْيَلْبَسِ الْخُفَّيْنِ وَلْيَقْطَعْهُمَا حَتَّى يَكُونَا تَحْتَ الْكَعْبَيْنِ ‏\"‏‏.‏"
      }
    ]
  }
}