{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 47,
    "data": [
      {
        "id": 6455,
        "hadith_number": "6723",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah (ﷺ) Melawat Sahabat yang Sakit dan Pewahyuan Mengenai Pusaka",
        "perawi_melayu": "Diriwayatkan daripada Jabir bin `Abdullah رضی اللہ عنہما :",
        "english_text": "I became sick so Allah's Messenger (ﷺ) and Abu Bakr رضی اللہ عنہ came on foot to pay me a visit. When they came, I was unconscious. Allah's Messenger (ﷺ) performed ablution and he poured over me the water (of his ablution) and I came to my senses and said, \"O Allah's Messenger (ﷺ)! What shall I do regarding my property? How shall I distribute it?\" The Prophet (ﷺ) did not reply till the Divine Verses of inheritance were revealed .",
        "malay_translation": "Saya jatuh sakit lalu Rasulullah (ﷺ) dan Abu Bakar رضی اللہ عنہ datang berjalan kaki untuk melawat saya. Apabila mereka tiba, saya tidak sedarkan diri. Rasulullah (ﷺ) berwudhu' dan Baginda menuangkan air (wudhu') ke atas saya, lalu saya sedar dan berkata, \"Wahai Rasulullah (ﷺ)! Apa yang harus saya lakukan mengenai harta saya? Bagaimana saya harus mengagihkannya?\" Nabi (ﷺ) tidak menjawab sehingga ayat-ayat pewarisan diwahyukan.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ يَقُولُ مَرِضْتُ فَعَادَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ وَهُمَا مَاشِيَانِ، فَأَتَانِي وَقَدْ أُغْمِيَ عَلَىَّ فَتَوَضَّأَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَبَّ عَلَىَّ وَضُوءَهُ فَأَفَقْتُ‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ كَيْفَ أَصْنَعُ فِي مَالِي، كَيْفَ أَقْضِي فِي مَالِي فَلَمْ يُجِبْنِي بِشَىْءٍ حَتَّى نَزَلَتْ آيَةُ الْمَوَارِيثِ‏.‏"
      },
      {
        "id": 6456,
        "hadith_number": "6724",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Peringatan Rasulullah (ﷺ) tentang Prasangka Buruk dan Persaudaraan",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضي الله عنه :",
        "english_text": "Allah's Messenger (ﷺ) said, 'Beware of suspicion, for it is the worst of false tales and don't look for the other's faults and don't spy and don't hate each other, and don't desert (cut your relations with) one another O Allah's slaves, be brothers!\" (See Hadith No. 90)",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Jauhilah prasangka buruk, kerana ia adalah seburuk-buruk dusta. Janganlah mencari-cari kesalahan orang lain, janganlah mengintip, janganlah saling membenci, dan janganlah saling meninggalkan (memutuskan hubungan) sesama kamu. Wahai hamba-hamba Allah, jadilah kamu bersaudara!\" (Lihat Hadith No. 90)",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِيَّاكُمْ وَالظَّنَّ فَإِنَّ الظَّنَّ أَكْذَبُ الْحَدِيثِ، وَلاَ تَحَسَّسُوا، وَلاَ تَجَسَّسُوا، وَلاَ تَبَاغَضُوا، وَلاَ تَدَابَرُوا، وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا ‏\"‏‏.‏"
      },
      {
        "id": 6457,
        "hadith_number": "6725, 6726",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Fatima dan Al-`Abbas Meminta Hak Mereka dari Harta Nabi ﷺ",
        "perawi_melayu": "Diriwayatkan oleh `Aisha رضي الله عنها:",
        "english_text": "Fatima and Al-`Abbas came to Abu Bakr رضی اللہ عنہ , seeking their share from the property of Allah's Messenger (ﷺ) and at that time, they were asking for their land at Fadak and their share from Khaibar. Abu Bakr رضی اللہ عنہ said to them, \" I have heard from Allah's Messenger (ﷺ) saying, 'Our property cannot be inherited, and whatever we leave is to be spent in charity, but the family of Muhammad may take their provisions from this property.\" Abu Bakr رضی اللہ عنہ added, \"By Allah, I will not leave the procedure I saw Allah's Messenger (ﷺ) following during his lifetime concerning this property.\" Therefore Fatima رضی اللہ عنها left Abu Bakr رضی اللہ عنه and did not speak to him till she died.",
        "malay_translation": "Fatima dan Al-`Abbas datang kepada Abu Bakar رضي الله عنه, meminta bahagian mereka daripada harta Rasulullah ﷺ. Pada masa itu, mereka meminta tanah mereka di Fadak dan bahagian mereka dari Khaibar. Abu Bakar رضي الله عنه berkata kepada mereka, \"Saya telah mendengar daripada Rasulullah ﷺ bersabda, 'Harta kami tidak boleh diwarisi, dan apa sahaja yang kami tinggalkan adalah untuk disedekahkan, tetapi keluarga Muhammad boleh mengambil bekalan mereka daripada harta ini.\" Abu Bakar رضي الله عنه menambah, \"Demi Allah, saya tidak akan meninggalkan prosedur yang saya lihat Rasulullah ﷺ amalkan semasa hayatnya berkenaan harta ini.\" Oleh itu, Fatima رضي الله عنها meninggalkan Abu Bakar رضي الله عنه dan tidak bercakap dengannya sehingga dia meninggal dunia.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ فَاطِمَةَ، وَالْعَبَّاسَ ـ عَلَيْهِمَا السَّلاَمُ ـ أَتَيَا أَبَا بَكْرٍ يَلْتَمِسَانِ مِيرَاثَهُمَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُمَا حِينَئِذٍ يَطْلُبَانِ أَرْضَيْهِمَا مِنْ فَدَكَ، وَسَهْمَهُمَا مِنْ خَيْبَرَ‏. فَقَالَ لَهُمَا أَبُو بَكْرٍ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ نُورَثُ، مَا تَرَكْنَا صَدَقَةٌ، إِنَّمَا يَأْكُلُ آلُ مُحَمَّدٍ مِنْ هَذَا الْمَالِ ‏\"‏‏.‏ قَالَ أَبُو بَكْرٍ وَاللَّهِ لاَ أَدَعُ أَمْرًا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَصْنَعُهُ فِيهِ إِلاَّ صَنَعْتُهُ‏.‏ قَالَ فَهَجَرَتْهُ فَاطِمَةُ، فَلَمْ تُكَلِّمْهُ حَتَّى مَاتَتْ‏.‏"
      },
      {
        "id": 6458,
        "hadith_number": "6727",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Harta Nabi (ﷺ) Tidak Diwarisi, Digunakan untuk Sedekah",
        "perawi_melayu": "Diriwayatkan oleh `Aisha رضی اللہ عنہا :",
        "english_text": "The Prophet (ﷺ) said, \"Our (Apostles') property should not be inherited, and whatever we leave, is to be spent in charity.\"",
        "malay_translation": "Nabi (ﷺ) bersabda, \"Harta kami (Nabi-nabi) tidak boleh diwarisi, dan apa sahaja yang kami tinggalkan, hendaklah dibelanjakan untuk sedekah.\"",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبَانَ، أَخْبَرَنَا ابْنُ الْمُبَارَكِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ نُورَثُ مَا تَرَكْنَا صَدَقَةٌ ‏\"‏‏.‏"
      },
      {
        "id": 6459,
        "hadith_number": "6728",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hak Pengurusan Harta Nabi SAW Selepas Wafatnya",
        "perawi_melayu": "Malik bin Aus",
        "english_text": "I went and entered upon `Umar, his doorman, Yarfa came saying `Uthman, `Abdur-Rahman, Az- Zubair and Sa`d are asking your permission (to see you). May I admit them? `Umar رضی اللہ عنہ said, 'Yes.' So he admitted them Then he came again and said, 'May I admit `Ali رضی اللہ عنہ and `Abbas رضی اللہ عنہ ?' He said, 'Yes.' `Abbas رضی اللہ عنہ said, 'O, chief of the believers! Judge between me and this man (Ali ). `Umar رضی اللہ عنہ said, 'I beseech you by Allah by Whose permission both the heaven and the earth exist, do you know that Allah's Messenger (ﷺ) said, 'Our (the Apostles') property will not be inherited, and whatever we leave (after our death) is to be spent in charity?' And by that Allah's Messenger (ﷺ) meant himself.' The group said, '(No doubt), he said so.' `Umar رضی اللہ عنہ then faced `Ali and `Abbas and said, 'Do you both know that Allah's Messenger (ﷺ) said that رضی اللہ عنہما?' They replied, '(No doubt), he said so.' `Umar رضی اللہ عنہ said, 'So let me talk to you about this matter. Allah favored His Apostle with something of this Fai' (i.e. booty won by the Muslims at war without fighting) which He did not give to anybody else; Allah said:-- 'And what Allah gave to His Apostle ( Fai' Booty) .........to do all things....(59.6) And so that property was only for Allah's Messenger (ﷺ) . Yet, by Allah, he neither gathered that property for himself nor withheld it from you, but he gave its income to you, and distributed it among you till there remained the present property out of which the Prophet (ﷺ) used to spend the yearly maintenance for his family, and whatever used to remain, he used to spend it where Allah's property is spent (i.e. in charity etc.). Allah's Messenger (ﷺ) followed that throughout his life. Now I beseech you by Allah, do you know all that?' They said, 'Yes.' `Umar رضی اللہ عنہ then said to `Ali and `Abbas, 'I beseech you by Allah, do you know that?' Both of them said, 'Yes.' `Umar رضی اللہ عنہ added, 'And when the Prophet (ﷺ) died, Abu Bakr said, ' I am the successor of Allah's Messenger (ﷺ), and took charge of that property and managed it in the same way as Allah's Messenger (ﷺ) did. Then I took charge of this property for two years during which I managed it as Allah's Messenger (ﷺ) and Abu Bakr did. Then you both (`Ali and `Abbas) came to talk to me, bearing the same claim and presenting the same case. (O `Abbas!) You came to me asking for your share from the property of your nephew, and this man (Ali) came to me, asking for the share of h is wife from the property of her father. I said, 'If you both wish, I will give that to you on that condition (i.e. that you would follow the way of the Prophet (ﷺ) and Abu Bakr رضی اللہ عنہ and as I (`Umar رضی اللہ عنہ ) have done in man aging it).' Now both of you seek of me a verdict other than that? Lo! By Allah, by Whose permission both the heaven and the earth exist, I will not give any verdict other than that till the Hour is established. If you are unable to manage it, then return it to me, and I will be sufficient to manage it on your behalf.' \"",
        "malay_translation": "Aku masuk menemui `Umar, dan pengawalnya, Yarfa, datang sambil berkata, \"`Uthman, `Abdur-Rahman, Az-Zubair, dan Sa`d meminta izin (untuk bertemu denganmu). Bolehkah aku membenarkan mereka masuk?\" `Umar رضی اللہ عنہ menjawab, \"Ya.\" Lalu dia membenarkan mereka masuk. Kemudian dia datang lagi dan berkata, \"Bolehkah aku membenarkan `Ali رضی اللہ عنہ dan `Abbas رضی اللہ عنہ masuk?\" Dia menjawab, \"Ya.\" `Abbas رضی اللہ عنہ berkata, \"Wahai ketua orang-orang beriman! Hukumkanlah antara aku dan lelaki ini (`Ali).\" `Umar رضی اللہ عنہ berkata, \"Aku bersumpah kepadamu demi Allah yang dengan izin-Nya langit dan bumi ada, adakah kamu tahu bahawa Rasulullah SAW bersabda, 'Harta kami (para Rasul) tidak diwarisi, dan apa sahaja yang kami tinggalkan (selepas kematian kami) adalah untuk dibelanjakan dalam sedekah?' Dan dengan itu Rasulullah SAW bermaksud dirinya.\" Kumpulan itu berkata, \"(Tidak syak lagi), baginda bersabda demikian.\" `Umar رضی اللہ عنہ kemudian menghadap `Ali dan `Abbas dan berkata, \"Adakah kamu berdua tahu bahawa Rasulullah SAW bersabda demikian رضی اللہ عنہ?\" Mereka menjawab, \"(Tidak syak lagi), baginda bersabda demikian.\" `Umar رضی اللہ عنہ berkata, \"Maka biarlah aku bercakap kepadamu mengenai perkara ini. Allah telah memuliakan Rasul-Nya dengan sesuatu daripada Fai' ini (iaitu harta rampasan perang yang dimenangi oleh umat Islam tanpa berperang) yang Dia tidak berikan kepada sesiapa pun; Allah berfirman:-- 'Dan apa yang Allah berikan kepada Rasul-Nya (Fai' Booty) .........untuk melakukan segala perkara....(59:6) Dan harta itu hanya untuk Rasulullah SAW. Namun, demi Allah, baginda tidak mengumpul harta itu untuk dirinya sendiri atau menahannya daripada kamu, tetapi baginda memberikan pendapatannya kepada kamu, dan mengagihkannya di kalangan kamu sehingga tinggal harta sekarang yang mana Nabi SAW menggunakannya untuk perbelanjaan tahunan keluarganya, dan apa sahaja yang tinggal, baginda menggunakannya di tempat harta Allah dibelanjakan (iaitu dalam sedekah dll.). Rasulullah SAW mengikutinya sepanjang hayat baginda. Sekarang aku bersumpah kepadamu demi Allah, adakah kamu tahu semua itu?\" Mereka berkata, \"Ya.\" `Umar رضی اللہ عنہ kemudian berkata kepada `Ali dan `Abbas, \"Aku bersumpah kepadamu demi Allah, adakah kamu tahu itu?\" Kedua-duanya berkata, \"Ya.\" `Umar رضی اللہ عنہ menambah, \"Dan apabila Nabi SAW wafat, Abu Bakr berkata, 'Aku adalah pengganti Rasulullah SAW, dan mengambil alih harta itu dan menguruskannya dengan cara yang sama seperti yang dilakukan oleh Rasulullah SAW. Kemudian aku mengambil alih harta ini selama dua tahun yang mana aku menguruskannya seperti yang dilakukan oleh Rasulullah SAW dan Abu Bakr. Kemudian kamu berdua (`Ali dan `Abbas) datang bercakap dengan aku, membawa tuntutan yang sama dan mengemukakan kes yang sama. (Wahai `Abbas!) Kamu datang kepadaku meminta bahagianmu daripada harta anak saudaramu, dan lelaki ini (Ali) datang kepadaku, meminta bahagian isterinya daripada harta bapanya. Aku berkata, 'Jika kamu berdua mahu, aku akan memberikannya kepada kamu dengan syarat itu (iaitu bahawa kamu akan mengikuti jalan Nabi SAW dan Abu Bakr رضی اللہ عنہ dan seperti yang aku (`Umar رضی اللہ عنہ) telah lakukan dalam menguruskannya).' Sekarang kamu berdua meminta daripadaku keputusan selain daripada itu? Demi Allah, dengan izin-Nya langit dan bumi ada, aku tidak akan memberikan sebarang keputusan selain daripada itu sehingga Hari Kiamat tiba. Jika kamu tidak dapat menguruskannya, maka kembalikanlah ia kepadaku, dan aku akan mencukupi untuk menguruskannya bagi pihak kamu.\" ",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي مَالِكُ بْنُ أَوْسِ بْنِ الْحَدَثَانِ،، وَكَانَ، مُحَمَّدُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍ ذَكَرَ لِي مِنْ حَدِيثِهِ ذَلِكَ، فَانْطَلَقْتُ حَتَّى دَخَلْتُ عَلَيْهِ فَسَأَلْتُهُ فَقَالَ انْطَلَقْتُ حَتَّى أَدْخُلَ عَلَى عُمَرَ فَأَتَاهُ حَاجِبُهُ يَرْفَأُ فَقَالَ هَلْ لَكَ فِي عُثْمَانَ وَعَبْدِ الرَّحْمَنِ وَالزُّبَيْرِ وَسَعْدٍ قَالَ نَعَمْ‏.‏ فَأَذِنَ لَهُمْ، ثُمَّ قَالَ هَلْ لَكَ فِي عَلِيٍّ وَعَبَّاسٍ قَالَ نَعَمْ‏.‏ قَالَ عَبَّاسٌ يَا أَمِيرَ الْمُؤْمِنِينَ اقْضِ بَيْنِي وَبَيْنَ هَذَا‏.‏ قَالَ أَنْشُدُكُمْ بِاللَّهِ الَّذِي بِإِذْنِهِ تَقُومُ السَّمَاءُ وَالأَرْضُ هَلْ تَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ نُورَثُ مَا تَرَكْنَا صَدَقَةٌ ‏\"‏‏.‏ يُرِيدُ رَسُولُ اللَّهِ صلى الله عليه وسلم نَفْسَهُ‏.‏ فَقَالَ الرَّهْطُ قَدْ قَالَ ذَلِكَ‏.‏ فَأَقْبَلَ عَلَى عَلِيٍّ وَعَبَّاسٍ فَقَالَ هَلْ تَعْلَمَانِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ذَلِكَ قَالاَ قَدْ قَالَ ذَلِكَ‏.‏ قَالَ عُمَرُ فَإِنِّي أُحَدِّثُكُمْ عَنْ هَذَا الأَمْرِ، إِنَّ اللَّهَ قَدْ كَانَ خَصَّ رَسُولَهُ صلى الله عليه وسلم فِي هَذَا الْفَىْءِ بِشَىْءٍ لَمْ يُعْطِهِ أَحَدًا غَيْرَهُ، فَقَالَ عَزَّ وَجَلَّ ‏{‏مَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ‏}‏ إِلَى قَوْلِهِ ‏{‏قَدِيرٌ‏}‏ فَكَانَتْ خَالِصَةً لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَاللَّهِ مَا احْتَازَهَا دُونَكُمْ، وَلاَ اسْتَأْثَرَ بِهَا عَلَيْكُمْ، لَقَدْ أَعْطَاكُمُوهُ وَبَثَّهَا فِيكُمْ، حَتَّى بَقِيَ مِنْهَا هَذَا الْمَالُ، فَكَانَ النَّبِيُّ صلى الله عليه وسلم يُنْفِقُ عَلَى أَهْلِهِ مِنْ هَذَا الْمَالِ نَفَقَةَ سَنَتِهِ، ثُمَّ يَأْخُذُ مَا بَقِيَ فَيَجْعَلُهُ مَجْعَلَ مَالِ اللَّهِ، فَعَمِلَ بِذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَيَاتَهُ، أَنْشُدُكُمْ بِاللَّهِ هَلْ تَعْلَمُونَ ذَلِكَ قَالُوا نَعَمْ‏.‏ ثُمَّ قَالَ لِعَلِيٍّ وَعَبَّاسٍ أَنْشُدُكُمَا بِاللَّهِ هَلْ تَعْلَمَانِ ذَلِكَ قَالاَ نَعَمْ‏.‏ فَتَوَفَّى اللَّهُ نَبِيَّهُ صلى الله عليه وسلم فَقَالَ أَبُو بَكْرٍ أَنَا وَلِيُّ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَبَضَهَا فَعَمِلَ بِمَا عَمِلَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ تَوَفَّى اللَّهُ أَبَا بَكْرٍ فَقُلْتُ أَنَا وَلِيُّ وَلِيِّ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَبَضْتُهَا سَنَتَيْنِ أَعْمَلُ فِيهَا مَا عَمِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ، ثُمَّ جِئْتُمَانِي وَكَلِمَتُكُمَا وَاحِدَةٌ، وَأَمْرُكُمَا جَمِيعٌ، جِئْتَنِي تَسْأَلُنِي نَصِيبَكَ مِنِ ابْنِ أَخِيكَ، وَأَتَانِي هَذَا يَسْأَلُنِي نَصِيبَ امْرَأَتِهِ مِنْ أَبِيهَا فَقُلْتُ إِنْ شِئْتُمَا دَفَعْتُهَا إِلَيْكُمَا بِذَلِكَ، فَتَلْتَمِسَانِ مِنِّي قَضَاءً غَيْرَ ذَلِكَ، فَوَاللَّهِ الَّذِي بِإِذْنِهِ تَقُومُ السَّمَاءُ وَالأَرْضُ، لاَ أَقْضِي فِيهَا قَضَاءً غَيْرَ ذَلِكَ حَتَّى تَقُومَ السَّاعَةُ، فَإِنْ عَجَزْتُمَا فَادْفَعَاهَا إِلَىَّ، فَأَنَا أَكْفِيكُمَاهَا‏.‏"
      },
      {
        "id": 6460,
        "hadith_number": "6729",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Harta Rasulullah (ﷺ) untuk Sedekah",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضي الله عنه:",
        "english_text": "Allah's Messenger (ﷺ) said, \"Not even a single Dinar of my property should be distributed (after my deaths to my inheritors, but whatever I leave excluding the provision for my wives and my servants, should be spent in charity.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Tidak ada walau satu Dinar pun daripada harta ku yang harus dibahagikan (selepas kematianku) kepada waris-warisku, tetapi apa sahaja yang aku tinggalkan kecuali nafkah untuk isteri-isteriku dan hamba-hambaku, hendaklah dibelanjakan untuk sedekah.\"",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَقْتَسِمُ وَرَثَتِي دِينَارًا، مَا تَرَكْتُ بَعْدَ نَفَقَةِ نِسَائِي وَمُؤْنَةِ عَامِلِي فَهْوَ صَدَقَةٌ ‏\"‏‏.‏"
      },
      {
        "id": 6461,
        "hadith_number": "6730",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Harta Nabi (ﷺ) Tidak Diwarisi",
        "perawi_melayu": "Riwayat 'Aishah رضي الله عنها :",
        "english_text": "\"When Allah's Messenger (ﷺ) died, his wives intended to send `Uthman رضی اللہ عنہ to Abu Bakr رضی اللہ عنہ asking him for their share of the inheritance.\" Then `Aisha رضی اللہ عنہاsaid to them, \"Didn't Allah's Messenger (ﷺ) say, 'Our (Apostles') property is not to be inherited, and whatever we leave is to be spent in charity?'\"",
        "malay_translation": "Ketika Rasulullah (ﷺ) wafat, isteri-isteri baginda berhasrat untuk menghantar 'Uthman رضي الله عنه kepada Abu Bakr رضي الله عنه meminta bahagian mereka daripada harta pusaka. Kemudian 'Aishah رضي الله عنها berkata kepada mereka, \"Bukankah Rasulullah (ﷺ) bersabda, 'Harta kami (para Rasul) tidak diwarisi, dan apa sahaja yang kami tinggalkan adalah untuk disedekahkan?'\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ أَزْوَاجَ، النَّبِيِّ صلى الله عليه وسلم حِينَ تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَرَدْنَ أَنْ يَبْعَثْنَ عُثْمَانَ إِلَى أَبِي بَكْرٍ يَسْأَلْنَهُ مِيرَاثَهُنَّ‏.‏ فَقَالَتْ عَائِشَةُ أَلَيْسَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ نُورَثُ مَا تَرَكْنَا صَدَقَةٌ ‏\"‏‏.‏"
      },
      {
        "id": 6462,
        "hadith_number": "6731",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi ﷺ Lebih Dekat kepada Orang Beriman daripada Diri Mereka Sendiri",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah رضي الله عنه :",
        "english_text": "The Prophet (ﷺ) said, \"I am more closer to the believers than their own selves, so whoever (of them) dies while being in debt and leaves nothing for its repayment, then we are to pay his debts on his behalf and whoever (among the believers) dies leaving some property, then that property is for his heirs.\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Aku lebih dekat kepada orang-orang beriman daripada diri mereka sendiri. Sesiapa (daripada mereka) meninggal dunia dalam keadaan berhutang dan tidak meninggalkan apa-apa untuk membayarnya, maka kami akan membayar hutangnya bagi pihaknya. Dan sesiapa (daripada orang-orang beriman) meninggal dunia meninggalkan harta, maka harta itu adalah untuk warisnya.\"",
        "arabic_text": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي أَبُو سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَنَا أَوْلَى، بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ، فَمَنْ مَاتَ وَعَلَيْهِ دَيْنٌ، وَلَمْ يَتْرُكْ وَفَاءً، فَعَلَيْنَا قَضَاؤُهُ، وَمَنْ تَرَكَ مَالاً فَلِوَرَثَتِهِ ‏\"‏‏.‏"
      },
      {
        "id": 6463,
        "hadith_number": "6732",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pembahagian Fara'id dan Harta Pusaka",
        "perawi_melayu": "Diriwayatkan oleh Ibnu `Abbas:",
        "english_text": "The Prophet (ﷺ) said, \"Give the Fara'id (the shares of the inheritance that are prescribed in the Qur'an) to those who are entitled to receive it. Then whatever remains, should be given to the closest male relative of the deceased .\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Berikan Fara'id (bahagian pusaka yang ditetapkan dalam Al-Quran) kepada mereka yang berhak menerimanya. Kemudian, apa sahaja yang selebihnya, hendaklah diberikan kepada waris lelaki terdekat si mati.\"",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا، فَمَا بَقِيَ فَهْوَ لأَوْلَى رَجُلٍ ذَكَرٍ ‏\"‏‏.‏"
      },
      {
        "id": 6464,
        "hadith_number": "6733",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nasihat Nabi ﷺ tentang Sedekah dan Meninggalkan Warisan yang Cukup",
        "perawi_melayu": "Riwayat Sa`d bin Abi Waqqas:",
        "english_text": "I was stricken by an ailment that led me to the verge of death. The Prophet (ﷺ) came to pay me a visit. I said, \"O Allah's Messenger (ﷺ)! I have much property and no heir except my single daughter. Shall I give two-thirds of my property in charity?\" He said, \"No.\" I said, \"Half of it?\" He said, \"No.\" I said, \"Onethird of it?\" He said, \"You may do so) though one-third is also to a much, for it is better for you to leave your off-spring wealthy than to leave them poor, asking others for help. And whatever you spend (for Allah's sake) you will be rewarded for it, even for a morsel of food which you may put in the mouth of your wife.\" I said, \"O Allah's Messenger (ﷺ)! Will I remain behind and fail to complete my emigration?\" The Prophet (ﷺ) said, \"If you are left behind after me, whatever good deeds you will do for Allah's sake, that will upgrade you and raise you high. May be you will have long life so that some people may benefit by you and others (the enemies) be harmed by you.\" But Allah's Messenger (ﷺ) felt sorry for Sa`d bin Khaula as he died in Mecca. (Sufyan, a sub-narrator said that Sa`d bin Khaula رضی اللہ عنہwas a man from the tribe of Bani 'Amir bin Lu'ai.)",
        "malay_translation": "Saya ditimpa penyakit yang membawa saya ke ambang kematian. Nabi ﷺ datang melawat saya. Saya berkata, \"Wahai Rasulullah ﷺ! Saya mempunyai banyak harta dan tidak mempunyai waris melainkan anak perempuan saya seorang. Bolehkah saya memberikan dua pertiga daripada harta saya untuk sedekah?\" Baginda bersabda, \"Tidak.\" Saya berkata, \"Separuh daripadanya?\" Baginda bersabda, \"Tidak.\" Saya berkata, \"Satu pertiga daripadanya?\" Baginda bersabda, \"Boleh, walaupun satu pertiga juga sudah banyak, kerana adalah lebih baik bagi kamu meninggalkan zuriat kamu dalam keadaan kaya daripada meninggalkan mereka dalam keadaan miskin, meminta bantuan daripada orang lain. Dan apa sahaja yang kamu belanjakan (kerana Allah), kamu akan diberi ganjaran, walaupun untuk suapan makanan yang kamu masukkan ke dalam mulut isteri kamu.\" Saya berkata, \"Wahai Rasulullah ﷺ! Adakah saya akan ketinggalan dan gagal untuk menyempurnakan penghijrahan saya?\" Nabi ﷺ bersabda, \"Jika kamu ditinggalkan selepasku, apa sahaja amal kebaikan yang akan kamu lakukan kerana Allah, itu akan meningkatkan kamu dan mengangkat kamu tinggi. Mungkin kamu akan berumur panjang supaya ada orang yang mendapat manfaat daripada kamu dan orang lain (musuh) akan teraniaya oleh kamu.\" Tetapi Rasulullah ﷺ berasa sedih atas kematian Sa`d bin Khaula di Mekah. (Sufyan, seorang perawi tambahan berkata bahawa Sa`d bin Khaula رضي الله عنه adalah seorang lelaki daripada suku Bani 'Amir bin Lu'ai.)",
        "arabic_text": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الزُّهْرِيُّ، قَالَ أَخْبَرَنِي عَامِرُ بْنُ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِيهِ، قَالَ مَرِضْتُ بِمَكَّةَ مَرَضًا، فَأَشْفَيْتُ مِنْهُ عَلَى الْمَوْتِ، فَأَتَانِي النَّبِيُّ صلى الله عليه وسلم يَعُودُنِي فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ لِي مَالاً كَثِيرًا، وَلَيْسَ يَرِثُنِي إِلاَّ ابْنَتِي، أَفَأَتَصَدَّقُ بِثُلُثَىْ مَالِي قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قَالَ قُلْتُ فَالشَّطْرُ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ الثُّلُثُ قَالَ ‏\"‏ الثُّلُثُ كَبِيرٌ إِنَّكَ إِنْ تَرَكْتَ وَلَدَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَتْرُكَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ، وَإِنَّكَ لَنْ تُنْفِقَ نَفَقَةً إِلاَّ أُجِرْتَ عَلَيْهَا، حَتَّى اللُّقْمَةَ تَرْفَعُهَا إِلَى فِي امْرَأَتِكَ ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ أَأُخَلَّفُ عَنْ هِجْرَتِي فَقَالَ ‏\"‏ لَنْ تُخَلَّفَ بَعْدِي فَتَعْمَلَ عَمَلاً تُرِيدُ بِهِ وَجْهَ اللَّهِ، إِلاَّ ازْدَدْتَ بِهِ رِفْعَةً وَدَرَجَةً، وَلَعَلَّ أَنْ تُخَلَّفَ بَعْدِي حَتَّى يَنْتَفِعَ بِكَ أَقْوَامٌ وَيُضَرَّ بِكَ آخَرُونَ، لَكِنِ الْبَائِسُ سَعْدُ ابْنُ خَوْلَةَ يَرْثِي لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ مَاتَ بِمَكَّةَ ‏\"‏‏.‏ قَالَ سُفْيَانُ وَسَعْدُ بْنُ خَوْلَةَ رَجُلٌ مِنْ بَنِي عَامِرِ بْنِ لُؤَىٍّ‏.‏"
      },
      {
        "id": 6465,
        "hadith_number": "6734",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pembahagian Harta Pusaka: Anak Perempuan dan Saudara Perempuan",
        "perawi_melayu": "Diriwayatkan oleh Al-Aswad bin Yazid:",
        "english_text": "Mu`adh bin Jabal رضی اللہ عنہ came to us in Yemen as a tutor and a ruler, and we (the people of Yemen) asked him about (the distribution of the property of ) a man who had died leaving a daughter and a sister. Mu`adh gave the daughter one-half of the property and gave the sister the other half.",
        "malay_translation": "Mu`adh bin Jabal رضي الله عنه datang kepada kami di Yaman sebagai seorang pengajar dan pemerintah, dan kami (penduduk Yaman) bertanya kepadanya tentang (pembahagian harta) seorang lelaki yang meninggal dunia meninggalkan seorang anak perempuan dan seorang saudara perempuan. Mu`adh memberikan separuh daripada harta kepada anak perempuan itu dan separuh lagi kepada saudara perempuannya.",
        "arabic_text": "حَدَّثَنِي مَحْمُودٌ، حَدَّثَنَا أَبُو النَّضْرِ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، شَيْبَانُ عَنْ أَشْعَثَ، عَنِ الأَسْوَدِ بْنِ يَزِيدَ، قَالَ أَتَانَا مُعَاذُ بْنُ جَبَلٍ بِالْيَمَنِ مُعَلِّمًا وَأَمِيرًا، فَسَأَلْنَاهُ عَنْ رَجُلٍ، تُوُفِّيَ وَتَرَكَ ابْنَتَهُ وَأُخْتَهُ، فَأَعْطَى الاِبْنَةَ النِّصْفَ وَالأُخْتَ النِّصْفَ‏.‏"
      },
      {
        "id": 6466,
        "hadith_number": "6735",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pembahagian Fara'id dan Harta Peninggalan",
        "perawi_melayu": "Diriwayatkan oleh Ibnu Abbas",
        "english_text": "Allah's Messenger (ﷺ) said, \"Give the Fara'id (shares prescribed in the Qur'an) to those who are entitled to receive it; and whatever remains, should be given to the closest male relative of the deceased.'",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Berikanlah Fara'id (bahagian-bahagian yang ditetapkan dalam Al-Quran) kepada mereka yang berhak menerimanya; dan apa sahaja yang berbaki, hendaklah diberikan kepada kaum kerabat lelaki terdekat si mati.\"",
        "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا فَمَا بَقِيَ فَهْوَ لأَوْلَى رَجُلٍ ذَكَرٍ ‏\"‏‏.‏"
      },
      {
        "id": 6467,
        "hadith_number": "6736",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pembahagian Harta Pusaka: Anak Perempuan, Cucu Lelaki, dan Saudara Perempuan",
        "perawi_melayu": "Diriwayatkan oleh Huzail bin Shirahbil:",
        "english_text": "Abu Musa رضی اللہ عنہ was asked regarding (the inheritance of) a daughter, a son's daughter, and a sister. He said, \"The daughter will take one-half and the sister will take one-half. If you go to Ibn Mas`ud رضی اللہ عنہما , he will tell you the same.\" Ibn Mas`ud رضی اللہ عنہما was asked and was told of Abu Musa's verdict. Ibn Mas`ud then said, \"If I give the same verdict, I would stray and would not be of the rightly-guided. The verdict I will give in this case, will be the same as the Prophet (ﷺ) did, i.e. one-half is for daughter, and one-sixth for the son's daughter, i.e. both shares make two-thirds of the total property; and the rest is for the sister.\" Afterwards we cams to Abu Musa رضی اللہ عنہ and informed him of Ibn Mas`ud's verdict, whereupon he said, \"So, do not ask me for verdicts, as long as this learned man is among you.\"",
        "malay_translation": "Abu Musa رضي الله عنه ditanya mengenai (warisan) anak perempuan, cucu perempuan daripada anak lelaki, dan saudara perempuan. Beliau berkata, \"Anak perempuan akan mengambil satu setengah (daripada harta) dan saudara perempuan akan mengambil satu setengah. Sekiranya kamu pergi kepada Ibn Mas`ud رضي الله عنهما, beliau akan memberitahu kamu perkara yang sama.\" Ibn Mas`ud رضي الله عنهما ditanya dan diberitahu mengenai keputusan Abu Musa. Ibn Mas`ud kemudian berkata, \"Jika aku memberikan keputusan yang sama, aku akan tersesat dan tidak akan termasuk dalam golongan yang mendapat petunjuk. Keputusan yang akan aku berikan dalam kes ini, adalah sama seperti yang dilakukan oleh Nabi ﷺ, iaitu satu setengah (daripada harta) adalah untuk anak perempuan, dan satu perenam (daripada harta) untuk cucu perempuan daripada anak lelaki, iaitu kedua-dua bahagian menjadikan dua pertiga daripada jumlah harta; dan bakinya adalah untuk saudara perempuan.\" Selepas itu kami datang kepada Abu Musa رضي الله عنه dan memberitahunya mengenai keputusan Ibn Mas`ud, lalu beliau berkata, \"Oleh itu, janganlah bertanya kepada saya mengenai keputusan, selagi orang yang berilmu ini ada di kalangan kamu.\"",
        "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا أَبُو قَيْسٍ، سَمِعْتُ هُزَيْلَ بْنَ شُرَحْبِيلَ، قَالَ سُئِلَ أَبُو مُوسَى عَنِ ابْنَةٍ وَابْنَةِ ابْنٍ وَأُخْتٍ، فَقَالَ لِلاِبْنَةِ النِّصْفُ وَلِلأُخْتِ النِّصْفُ، وَأْتِ ابْنَ مَسْعُودٍ فَسَيُتَابِعُنِي‏.‏ فَسُئِلَ ابْنُ مَسْعُودٍ وَأُخْبِرَ بِقَوْلِ أَبِي مُوسَى، فَقَالَ لَقَدْ ضَلَلْتُ إِذًا وَمَا أَنَا مِنَ الْمُهْتَدِينَ،، أَقْضِي فِيهَا بِمَا قَضَى النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لِلاِبْنَةِ النِّصْفُ، وَلاِبْنَةِ ابْنٍ السُّدُسُ تَكْمِلَةَ الثُّلُثَيْنِ، وَمَا بَقِيَ فَلِلأُخْتِ ‏\"‏‏.‏ فَأَتَيْنَا أَبَا مُوسَى فَأَخْبَرْنَاهُ بِقَوْلِ ابْنِ مَسْعُودٍ، فَقَالَ لاَ تَسْأَلُونِي مَا دَامَ هَذَا الْحَبْرُ فِيكُمْ‏.‏"
      },
      {
        "id": 6468,
        "hadith_number": "6737",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pembahagian Fara'id dan Harta Pusaka",
        "perawi_melayu": "Diriwayatkan oleh Ibnu 'Abbas رضی اللہ عنہما :",
        "english_text": "The Prophet (ﷺ) said, \"Give the Fara'id, (the shares prescribed in the Qur'an) to those who are entitled to receive it, and then whatever remains, should be given to the closest male relative of the deceased.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Berikanlah Fara'id (bahagian yang ditetapkan dalam Al-Quran) kepada mereka yang berhak menerimanya, dan kemudian apa sahaja yang tinggal, hendaklah diberikan kepada saudara lelaki terdekat si mati.\"",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا وُهَيْبٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا فَمَا بَقِيَ فَلأَوْلَى رَجُلٍ ذَكَرٍ ‏\"‏‏.‏"
      },
      {
        "id": 6469,
        "hadith_number": "6738",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kecintaan Rasulullah ﷺ kepada Abu Bakr dan Persaudaraan Islam",
        "perawi_melayu": "Diriwayatkan oleh Ibnu Abbas رضي الله عنهما:",
        "english_text": "The person about whom Allah's Messenger (ﷺ) said, \"If I were to take a Khalil from this nation (my followers), then I would have taken him (i.e., Abu Bakr رضی اللہ عنہ), but the Islamic Brotherhood is better (or said: good),\" regarded a grandfather as the father himself (in inheritance).",
        "malay_translation": "Orang yang Rasulullah ﷺ bersabda tentangnya, \"Sekiranya aku mengambil seorang khalil daripada umat ini (pengikutku), nescaya aku akan mengambilnya (iaitu Abu Bakar رضي الله عنه), tetapi persaudaraan Islam adalah lebih baik (atau berkata: baik),\" menganggap datuk sebagai bapa sendiri (dalam pewarisan).",
        "arabic_text": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أَمَّا الَّذِي قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ كُنْتُ مُتَّخِذًا مِنْ هَذِهِ الأُمَّةِ خَلِيلاً لاَتَّخَذْتُهُ، وَلَكِنْ خُلَّةُ الإِسْلاَمِ أَفْضَلُ ‏\"‏‏.‏ أَوْ قَالَ ‏\"‏ خَيْرٌ ‏\"‏‏.‏ فَإِنَّهُ أَنْزَلَهُ أَبًا‏.‏ أَوْ قَالَ قَضَاهُ أَبًا‏.‏"
      },
      {
        "id": 6470,
        "hadith_number": "6739",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perubahan Pembahagian Harta Pusaka dalam Islam",
        "perawi_melayu": "Daripada Ibnu Abbas رضي الله عنهما:",
        "english_text": "(During the early days of Islam), the inheritance used to be given to one's offspring and legacy used to be bequeathed to the parents, then Allah cancelled what He wished from that order and decreed that the male should be given the equivalent of the portion of two females, and for the parents one-sixth for each of them, and for one's wife one-eighth (if the deceased has children) and one-fourth (if he has no children), for one's husband one-half (if the deceased has no children) and one-fourth (if she has children).",
        "malay_translation": "Pada zaman awal Islam, harta pusaka diberikan kepada anak-anak dan wasiat diberikan kepada ibu bapa. Kemudian Allah membatalkan apa yang Dia kehendaki daripada perintah itu dan menetapkan bahawa lelaki diberi bahagian yang setara dengan bahagian dua perempuan, dan untuk ibu bapa satu perenam untuk setiap daripada mereka, dan untuk isteri seseorang satu per lapan (jika si mati mempunyai anak) dan satu per empat (jika dia tidak mempunyai anak), untuk suami seseorang satu per dua (jika si mati tidak mempunyai anak) dan satu per empat (jika dia mempunyai anak).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، عَنْ وَرْقَاءَ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ الْمَالُ لِلْوَلَدِ، وَكَانَتِ الْوَصِيَّةُ لِلْوَالِدَيْنِ، فَنَسَخَ اللَّهُ مِنْ ذَلِكَ مَا أَحَبَّ، فَجَعَلَ لِلذَّكَرِ مِثْلَ حَظِّ الأُنْثَيَيْنِ، وَجَعَلَ لِلأَبَوَيْنِ لِكُلِّ وَاحِدٍ مِنْهُمَا السُّدُسُ، وَجَعَلَ لِلْمَرْأَةِ الثُّمُنَ وَالرُّبُعَ، وَلِلزَّوْجِ الشَّطْرَ وَالرُّبُعَ‏.‏"
      },
      {
        "id": 6471,
        "hadith_number": "6740",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman Qisas untuk Pengguguran dan Pembahagian Harta",
        "perawi_melayu": "Diriwayatkan oleh Abu Huraira رضي اللہ عنه :",
        "english_text": "Allah's Messenger (ﷺ) gave the judgment that a male or female slave should be given in Qisas for an abortion case of a woman from the tribe of Bani Lihyan (as blood money for the fetus) but the lady on whom the penalty had been imposed died, so the Prophets ordered that her property be inherited by her offspring and her husband and that the penalty be paid by her Asaba.",
        "malay_translation": "Rasulullah (ﷺ) telah memutuskan bahawa seorang hamba lelaki atau perempuan harus diberikan dalam Qisas untuk kes pengguguran seorang wanita dari suku Bani Lihyan (sebagai diyat untuk janin), tetapi wanita yang dikenakan hukuman itu meninggal dunia, maka Nabi memerintahkan agar hartanya diwarisi oleh anak-anaknya dan suaminya, dan bahawa denda itu harus dibayar oleh Asabahnya.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي جَنِينِ امْرَأَةٍ مِنْ بَنِي لَحْيَانَ سَقَطَ مَيِّتًا بِغُرَّةٍ عَبْدٍ أَوْ أَمَةٍ‏.‏ ثُمَّ إِنَّ الْمَرْأَةَ الَّتِي قَضَى عَلَيْهَا بِالْغُرَّةِ تُوُفِّيَتْ، فَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ بِأَنَّ مِيرَاثَهَا لِبَنِيهَا وَزَوْجِهَا، وَأَنَّ الْعَقْلَ عَلَى عَصَبَتِهَا ‏\"‏‏.‏"
      },
      {
        "id": 6472,
        "hadith_number": "6741",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pembahagian Pusaka: Anak Perempuan dan Saudara Perempuan",
        "perawi_melayu": "Diriwayatkan oleh Al-Aswad:",
        "english_text": "Mu`adh bin Jabal رضی اللہ عنہ gave this verdict for us in the lifetime of Allah's Messenger (ﷺ). One-half of the inheritance is to be given to the daughter and the other half to the sister. Sulaiman said: Mu`adh gave a verdict for us, but he did not mention that it was so in the lifetime of Allah's Messenger (ﷺ).",
        "malay_translation": "Mu`adh bin Jabal رضي الله عنه memberikan keputusan ini kepada kami pada zaman Rasulullah ﷺ. Separuh daripada harta pusaka diberikan kepada anak perempuan dan separuh lagi kepada saudara perempuan. Sulaiman berkata: Mu`adh memberikan keputusan kepada kami, tetapi dia tidak menyebutkan bahawa ia adalah demikian pada zaman Rasulullah ﷺ.",
        "arabic_text": "حَدَّثَنَا بِشْرُ بْنُ خَالِدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، قَالَ قَضَى فِينَا مُعَاذُ بْنُ جَبَلٍ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم النِّصْفُ لِلاِبْنَةِ وَالنِّصْفُ لِلأُخْتِ‏.‏ ثُمَّ قَالَ سُلَيْمَانُ قَضَى فِينَا‏.‏ وَلَمْ يَذْكُرْ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 6473,
        "hadith_number": "6742",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pembahagian Harta Pusaka: Anak Perempuan, Cucu Perempuan, dan Saudara Perempuan",
        "perawi_melayu": "Diriwayatkan oleh 'Abdullah رضی اللہ عنہما :",
        "english_text": "\"The judgment I will give in this matter will be like the judgment of the Prophet, i.e. one-half is for the daughter and one-sixth for the son's daughter and the rest of the inheritance for the sister.\"",
        "malay_translation": "\"Keputusan yang akan saya berikan dalam hal ini adalah seperti keputusan Nabi, iaitu separuh (harta) adalah untuk anak perempuan dan satu per enam (harta) untuk cucu perempuan (daripada anak lelaki) dan selebihnya daripada pusaka adalah untuk saudara perempuan.\"",
        "arabic_text": "حَدَّثَنِي عَمْرُو بْنُ عَبَّاسٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي قَيْسٍ، عَنْ هُزَيْلٍ، قَالَ قَالَ عَبْدُ اللَّهِ لأَقْضِيَنَّ فِيهَا بِقَضَاءِ النَّبِيِّ صلى الله عليه وسلم لِلاِبْنَةِ النِّصْفُ، وَلاِبْنَةِ الاِبْنِ السُّدُسُ، وَمَا بَقِيَ فَلِلأُخْتِ‏.‏"
      },
      {
        "id": 6474,
        "hadith_number": "6743",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi (ﷺ) Memercikkan Air Wuduk ke Atas Jabir (r.a.) Ketika Sakit",
        "perawi_melayu": "Diriwayatkan oleh Jabir رضی اللہ عنہ :",
        "english_text": "While I was sick, the Prophet (ﷺ) entered upon me and asked for some water to perform ablution, and after he had finished his ablution, he sprinkled some water of his ablution over me, whereupon I became conscious and said, \"O Allah's Messenger (ﷺ)! I have sisters.\" Then the Divine Verses regarding the laws of inheritance were revealed.",
        "malay_translation": "Ketika saya sakit, Nabi (ﷺ) masuk menemui saya dan meminta sedikit air untuk berwuduk. Setelah selesai berwuduk, baginda memercikkan sedikit air wuduk ke atas saya. Kemudian saya sedar dan berkata, \"Wahai Rasulullah (ﷺ)! Saya mempunyai saudara perempuan.\" Kemudian ayat-ayat Ilahi tentang hukum faraid (pembahagian harta pusaka) diturunkan.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، قَالَ سَمِعْتُ جَابِرًا ـ رضى الله عنه ـ قَالَ دَخَلَ عَلَىَّ النَّبِيُّ صلى الله عليه وسلم وَأَنَا مَرِيضٌ، فَدَعَا بِوَضُوءٍ فَتَوَضَّأَ، ثُمَّ نَضَحَ عَلَىَّ مِنْ وَضُوئِهِ فَأَفَقْتُ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّمَا لِي أَخَوَاتٌ‏.‏ فَنَزَلَتْ آيَةُ الْفَرَائِضِ‏.‏"
      },
      {
        "id": 6475,
        "hadith_number": "6744",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ayat Terakhir Al-Quran yang Diturunkan (Surah An-Nisa)",
        "perawi_melayu": "Diriwayatkan oleh Al-Bara رضی اللہ عنہ :",
        "english_text": "The last Qur'anic Verse that was revealed (to the Prophet) was the final Verse of Surat-an-Nisa, i.e., 'They ask you for a legal verdict Say: Allah directs (thus) About those who leave No descendants or ascendants as heirs....' (4.176)",
        "malay_translation": "Ayat Al-Quran terakhir yang diturunkan (kepada Nabi) adalah ayat terakhir Surah An-Nisa, iaitu, 'Mereka meminta fatwa daripadamu. Katakanlah: Allah memberi fatwa kepadamu tentang (hak waris) kalalah (iaitu) jika seorang mati yang tidak mempunyai anak dan tidak pula bapa, sedang ia mempunyai seorang saudara perempuan, maka bagi saudara perempuan itu separuh dari harta yang ditinggalkannya; dan ia (saudara perempuan itu) mewarisi (semua harta) jika ia tidak mempunyai anak…' (4:176)",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ آخِرُ آيَةٍ نَزَلَتْ خَاتِمَةُ سُورَةِ النِّسَاءِ ‏{‏يَسْتَفْتُونَكَ قُلِ اللَّهُ يُفْتِيكُمْ فِي الْكَلاَلَةِ‏}‏"
      },
      {
        "id": 6476,
        "hadith_number": "6745",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah ﷺ Lebih Dekat dengan Orang Beriman",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضي الله عنه:",
        "english_text": "Allah's Messenger (ﷺ) said, \"I am more closer to the believers than their ownselves, so whoever (among them) dies leaving some inheritance, his inheritance will be given to his 'Asaba, and whoever dies leaving a debt or dependants or destitute children, then I am their supporter.\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Aku lebih dekat kepada orang-orang beriman daripada diri mereka sendiri. Sesiapa (di antara mereka) yang meninggal dunia dan meninggalkan harta pusaka, maka harta pusakanya akan diberikan kepada 'Asabahnya. Dan sesiapa yang meninggal dunia dan meninggalkan hutang, atau tanggungan, atau anak-anak yang tidak berkemampuan, maka akulah penolong mereka.\"",
        "arabic_text": "حَدَّثَنَا مَحْمُودٌ، أَخْبَرَنَا عُبَيْدُ اللَّهِ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَنَا أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ، فَمَنْ مَاتَ وَتَرَكَ مَالاً فَمَالُهُ لِمَوَالِي الْعَصَبَةِ، وَمَنْ تَرَكَ كَلاًّ أَوْ ضَيَاعًا، فَأَنَا وَلِيُّهُ فَلأُدْعَى لَهُ ‏\"‏‏.‏ لكل: العيال"
      },
      {
        "id": 6477,
        "hadith_number": "6746",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pembahagian Fara'id dan Warisan",
        "perawi_melayu": "Diriwayatkan oleh Ibnu Abbas رضی اللہ عنہما :",
        "english_text": "The Prophet (ﷺ) said, \"Give the Fara'id (the shares of the inheritance that are prescribed in the Qur'an) to those who are entitled to receive it; and whatever is left should be given to the closest male relative of the deceased.\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Berikan Fara'id (bahagian warisan yang ditetapkan dalam Al-Quran) kepada mereka yang berhak menerimanya; dan apa sahaja yang tinggal hendaklah diberikan kepada saudara lelaki terdekat si mati.\"",
        "arabic_text": "حَدَّثَنَا أُمَيَّةُ بْنُ بِسْطَامٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ رَوْحٍ، عَنْ عَبْدِ اللَّهِ بْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا، فَمَا تَرَكَتِ الْفَرَائِضُ فَلأَوْلَى رَجُلٍ ذَكَرٍ ‏\"‏‏.‏"
      },
      {
        "id": 6478,
        "hadith_number": "6747",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ayat Mengenai Warisan dan Persaudaraan dalam Islam",
        "perawi_melayu": "Diriwayatkan oleh Ibnu Abbas رضي الله عنهما :",
        "english_text": "Regarding the Holy Verse: ''‏وَلِكُلٍّ جَعَلْنَا مَوَالِيَ'' (Al-Nisa:33) and the verse ''‏وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ'' (Al-Nisa:33) that when the emigrants came to Madinah Munawarrah, the Helpers, on account of the bond of fraternity established by the prophet ﷺ between them, would inherit the Emigrants though they did no have any womb ties with one another. When the verse ''‏جَعَلْنَا مَوَالِيَ‏'' was revealed it revoked the ''‏وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ''",
        "malay_translation": "Berkaitan dengan Ayat Suci: ''وَلِكُلٍّ جَعَلْنَا مَوَالِيَ'' (An-Nisa:33) dan ayat ''وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ'' (An-Nisa:33). Ketika para Muhajirin tiba di Madinah Munawwarah, kaum Ansar, disebabkan ikatan persaudaraan yang ditetapkan oleh Nabi ﷺ antara mereka, akan mewarisi harta pusaka Muhajirin meskipun mereka tidak mempunyai hubungan kekeluargaan. Apabila ayat ''وَلِكُلٍّ جَعَلْنَا مَوَالِيَ'' diturunkan, ia membatalkan ''وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ''.",
        "arabic_text": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ قُلْتُ لأَبِي أُسَامَةَ حَدَّثَكُمْ إِدْرِيسُ، حَدَّثَنَا طَلْحَةُ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، ‏{‏وَلِكُلٍّ جَعَلْنَا مَوَالِيَ‏}‏ ‏{‏وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ‏}‏ قَالَ كَانَ الْمُهَاجِرُونَ حِينَ قَدِمُوا الْمَدِينَةَ يَرِثُ الأَنْصَارِيُّ الْمُهَاجِرِيَّ دُونَ ذَوِي رَحِمِهِ لِلأُخُوَّةِ الَّتِي آخَى النَّبِيُّ صلى الله عليه وسلم بَيْنَهُمْ فَلَمَّا نَزَلَتْ ‏{‏جَعَلْنَا مَوَالِيَ‏}‏ قَالَ نَسَخَتْهَا ‏{‏وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ‏}‏"
      },
      {
        "id": 6479,
        "hadith_number": "6748",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kes Lian (Mula'ana) dan Keputusan Nabi (ﷺ)",
        "perawi_melayu": "Diriwayatkan oleh Ibnu `Umar رضی اللہ عنہما :",
        "english_text": "A man and his wife had a case of Lian (or Mula'ana) during the lifetime of the Prophet (ﷺ) and the man denied the paternity of her child. The Prophet (ﷺ) gave his verdict for their separation (divorce) and then the child was regarded as belonging to the wife only.",
        "malay_translation": "Seorang lelaki dan isterinya menghadapi kes Lian (atau Mula'ana) pada zaman Nabi (ﷺ), dan lelaki itu menafikan bapa kepada anaknya. Nabi (ﷺ) memutuskan perpisahan (perceraian) mereka, dan kemudian anak itu dianggap sebagai milik isteri sahaja.",
        "arabic_text": "حَدَّثَنِي يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما أَنَّ رَجُلاً، لاَعَنَ امْرَأَتَهُ فِي زَمَنِ النَّبِيِّ صلى الله عليه وسلم وَانْتَفَى مِنْ وَلَدِهَا فَفَرَّقَ النَّبِيُّ صلى الله عليه وسلم بَيْنَهُمَا، وَأَلْحَقَ الْوَلَدَ بِالْمَرْأَةِ‏.‏"
      },
      {
        "id": 6480,
        "hadith_number": "6749",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Penjagaan Anak dan Hubungan Nasab",
        "perawi_melayu": "Diriwayatkan oleh Aisyah رضی اللہ عنہا :",
        "english_text": "`Utba (bin Abi Waqqas) رضی اللہ عنہ said to his brother Sa`d رضی اللہ عنہ , \"The son of the slave girl of Zam`a is my son, so be his custodian.\" So when it was the year of the Conquest of Mecca, Sa`d took that child and said, \"He is my nephew, and my brother told me to be his custodian.\" On that, 'Abu bin Zam`a رضی اللہ عنہ got up and said, 'but the child is my brother, and the son of my father's slave girl as he was born on his bed.\" So they both went to the Prophet. Sa`d رضی اللہ عنہ said, \"O Allah's Messenger (ﷺ)! (This is) the son of my brother and he told me to be his custodian.\" Then 'Abd bin Zam`a said, \"(But he is) my brother and the son of the slave girl of my father, born on his bed.\" The Prophet (ﷺ) said, \"This child is for you. O 'Abu bin Zam`a, as the child is for the owner of the bed, and the adulterer receives the stones.\" He then ordered (his wife) Sauda bint Zam`a رضی اللہ عنہا to cover herself before that boy as he noticed the boy's resemblance to `Utba. Since then the boy had never seen Sauda till he died.",
        "malay_translation": "Utba (bin Abi Waqqas) رضی اللہ عنہ berkata kepada saudaranya Sa`d رضی اللہ عنہ, \"Anak lelaki daripada hamba perempuan Zam`a adalah anakku, jadi jadilah penjaganya.\" Maka ketika tahun Pembukaan Mekah, Sa`d mengambil anak itu dan berkata, \"Dia adalah anak saudara saya, dan saudara saya menyuruh saya menjadi penjaganya.\" Atas hal itu, 'Abu bin Zam`a رضی اللہ عنہ bangun dan berkata, 'Tetapi anak itu adalah saudara saya, dan anak lelaki daripada hamba perempuan ayah saya kerana dia dilahirkan di atas katilnya.\" Lalu mereka berdua pergi kepada Nabi. Sa`d رضی اللہ عنہ berkata, \"Wahai Rasulullah (ﷺ)! (Ini adalah) anak lelaki saudara saya dan dia menyuruh saya menjadi penjaganya.\" Kemudian 'Abd bin Zam`a berkata, \"(Tetapi dia adalah) saudara saya dan anak lelaki daripada hamba perempuan ayah saya, dilahirkan di atas katilnya.\" Nabi (ﷺ) bersabda, \"Anak ini adalah milikmu, wahai 'Abu bin Zam`a, kerana anak itu adalah milik pemilik katil, dan penzina menerima hukuman.\" Kemudian baginda memerintahkan (isterinya) Sauda bint Zam`a رضی اللہ عنہا untuk menutup dirinya di hadapan budak lelaki itu kerana baginda perasan budak lelaki itu menyerupai `Utba. Sejak itu budak lelaki itu tidak pernah melihat Sauda sehingga dia meninggal dunia.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ عُتْبَةُ عَهِدَ إِلَى أَخِيهِ سَعْدٍ أَنَّ ابْنَ وَلِيدَةِ زَمْعَةَ مِنِّي، فَاقْبِضْهُ إِلَيْكَ‏.‏ فَلَمَّا كَانَ عَامَ الْفَتْحِ أَخَذَهُ سَعْدٌ فَقَالَ ابْنُ أَخِي عَهِدَ إِلَىَّ فِيهِ‏.‏ فَقَامَ عَبْدُ بْنُ زَمْعَةَ فَقَالَ أَخِي وَابْنُ وَلِيدَةِ أَبِي، وُلِدَ عَلَى فِرَاشِهِ‏.‏ فَتَسَاوَقَا إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ سَعْدٌ يَا رَسُولَ اللَّهِ ابْنُ أَخِي قَدْ كَانَ عَهِدَ إِلَىَّ فِيهِ‏.‏ فَقَالَ عَبْدُ بْنُ زَمْعَةَ أَخِي وَابْنُ وَلِيدَةِ أَبِي، وُلِدَ عَلَى فِرَاشِهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هُوَ لَكَ يَا عَبْدُ بْنَ زَمْعَةَ، الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ ‏\"‏‏.‏ ثُمَّ قَالَ لِسَوْدَةَ بِنْتِ زَمْعَةَ ‏\"‏ احْتَجِبِي مِنْهُ ‏\"‏‏.‏ لِمَا رَأَى مِنْ شَبَهِهِ بِعُتْبَةَ، فَمَا رَآهَا حَتَّى لَقِيَ اللَّهَ‏.‏"
      },
      {
        "id": 6481,
        "hadith_number": "6750",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Anak Milik Pemilik Katil",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) said, \"The boy is for the owner of the bed.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Anak itu adalah milik pemilik katil.\"",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، عَنْ يَحْيَى، عَنْ شُعْبَةَ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْوَلَدُ لِصَاحِبِ الْفِرَاشِ ‏\"‏‏.‏"
      },
      {
        "id": 6482,
        "hadith_number": "6751",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pembelian Barira dan Hukum Wala'",
        "perawi_melayu": "Diriwayatkan oleh Aishah رضی اللہ عنہا :",
        "english_text": "I bought Barira رضی اللہ عنہ (a female slave). The Prophet (ﷺ) said (to me), \"Buy her as the Wala' is for the manumitted.\" Once she was given a sheep (in charity). The Prophet (ﷺ) said, \"It (the sheep) is a charitable gift for her (Barira رضی اللہ عنہ) and a gift for us.\" Al-Hakam said, \"Barira's husband was a free man.\" Ibn `Abbas رضی اللہ عنہما said, 'When I saw him, he was a slave.'",
        "malay_translation": "Aku membeli Barira رضی اللہ عنہ (seorang hamba perempuan). Nabi (ﷺ) bersabda (kepadaku), \"Belilah dia kerana Wala' adalah bagi orang yang dimerdekakan.\" Suatu ketika, dia diberi seekor kambing (sebagai sedekah). Nabi (ﷺ) bersabda, \"Ia (kambing itu) adalah hadiah sedekah untuknya (Barira رضی اللہ عنہ) dan hadiah untuk kami.\" Al-Hakam berkata, \"Suami Barira adalah seorang lelaki merdeka.\" Ibn `Abbas رضی اللہ عنہما berkata, 'Ketika aku melihatnya, dia adalah seorang hamba.'",
        "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتِ اشْتَرَيْتُ بَرِيرَةَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اشْتَرِيهَا، فَإِنَّ الْوَلاَءَ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ وَأُهْدِيَ لَهَا شَاةٌ فَقَالَ ‏\"‏ هُوَ لَهَا صَدَقَةٌ، وَلَنَا هَدِيَّةٌ ‏\"‏‏.‏ قَالَ الْحَكَمُ وَكَانَ زَوْجُهَا حُرًّا، وَقَوْلُ الْحَكَمِ مُرْسَلٌ‏.‏ وَقَالَ ابْنُ عَبَّاسٍ رَأَيْتُهُ عَبْدًا‏.‏"
      },
      {
        "id": 6483,
        "hadith_number": "6752",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Wala' Adalah Hak Orang yang Dimerdekakan",
        "perawi_melayu": "Diriwayatkan oleh Ibnu 'Umar رضی اللہ عنہما :",
        "english_text": "The Prophet (ﷺ) said, \"The Wala' is for the manumitted (of the slave).",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Wala' adalah hak orang yang dimerdekakan (daripada hamba).\"",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏"
      },
      {
        "id": 6484,
        "hadith_number": "6753",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Orang Islam Tidak Membebaskan Hamba Seperti Amalan Jahiliyyah",
        "perawi_melayu": "Diriwayatkan oleh `Abdullah رضي الله عنه :",
        "english_text": "The Muslims did not free slaves as Sa'iba, but the People of the Pre-lslamic Period of Ignorance used to do so.",
        "malay_translation": "Umat Islam tidak membebaskan hamba seperti Sa'iba, tetapi orang-orang pada Zaman Jahiliyyah melakukannya.",
        "arabic_text": "حَدَّثَنَا قَبِيصَةُ بْنُ عُقْبَةَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي قَيْسٍ، عَنْ هُزَيْلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ إِنَّ أَهْلَ الإِسْلاَمِ لا يُسَيِّبُونَ، وَإِنَّ أَهْلَ الْجَاهِلِيَّةِ كَانُوا يُسَيِّبُونَ‏.‏"
      },
      {
        "id": 6485,
        "hadith_number": "6754",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pembebasan Barira dan Hak Wala'",
        "perawi_melayu": "Diriwayatkan daripada `Aisha رضی اللہ عنہا:",
        "english_text": "`Aisha رضی اللہ عنہا bought Barira in order to manumit her, but her masters stipulated that her Wala' (after her death) would be for them. `Aisha رضی اللہ عنہا said, \"O Allah's Messenger (ﷺ)! I have bought Barira in order to manumit her, but her masters stipulated that her Wala' will be for them.\" The Prophet (ﷺ) said, \"Manumit her as the Wala is for the one who manumits (the slave),\" or said, \"The one who pays her price.\" Then `Aisha رضی اللہ عنہا bought and manumitted her. After that, Barira was given the choice (by the Prophet) (to stay with her husband or leave him). She said, \"If he gave me so much and so much (money) I would not stay with him.\" (Al-Aswad added: Her husband was a free man.) The sub-narrator added: The series of the narrators of Al-Aswad's statement is incomplete. The statement of Ibn `Abbas رضی اللہ عنہما , i.e., when I saw him he was a slave, is more authentic.",
        "malay_translation": "`Aishah رضی اللہ عنہا membeli Barirah dengan tujuan untuk membebaskannya, tetapi tuannya menetapkan bahawa Wala' (selepas kematiannya) akan menjadi milik mereka. `Aishah رضی اللہ عنہا berkata, \"Wahai Rasulullah (ﷺ)! Saya telah membeli Barirah untuk membebaskannya, tetapi tuannya menetapkan bahawa Wala'nya akan menjadi milik mereka.\" Nabi (ﷺ) bersabda, \"Bebaskan dia kerana Wala' adalah hak orang yang membebaskan (hamba),\" atau bersabda, \"Orang yang membayar harga tebusannya.\" Kemudian `Aishah رضی اللہ عنہا membeli dan membebaskannya. Selepas itu, Barirah diberi pilihan (oleh Nabi) (untuk tinggal bersama suaminya atau meninggalkannya). Dia berkata, \"Sekiranya dia memberi saya begitu banyak (wang), saya tidak akan tinggal bersamanya.\" (Al-Aswad menambah: Suaminya adalah seorang lelaki merdeka.) Perawi tambahan menambah: Rantaian perawi daripada kenyataan Al-Aswad adalah tidak lengkap. Kenyataan Ibn `Abbas رضی اللہ عنہما, iaitu, ketika saya melihatnya, dia adalah seorang hamba, adalah lebih sahih.",
        "arabic_text": "حَدَّثَنَا مُوسَى، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ اشْتَرَتْ بَرِيرَةَ، لِتُعْتِقَهَا، وَاشْتَرَطَ أَهْلُهَا وَلاَءَهَا فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي اشْتَرَيْتُ بَرِيرَةَ لأُعْتِقَهَا، وَإِنَّ أَهْلَهَا يَشْتَرِطُونَ وَلاَءَهَا‏.‏ فَقَالَ ‏\"‏ أَعْتِقِيهَا فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ أَوْ قَالَ ‏\"‏ أَعْطَى الثَّمَنَ ‏\"‏‏.‏ قَالَ فَاشْتَرَتْهَا فَأَعْتَقَتْهَا‏.‏ قَالَ وَخُيِّرَتْ فَاخْتَارَتْ نَفْسَهَا وَقَالَتْ لَوْ أُعْطِيتُ كَذَا وَكَذَا مَا كُنْتُ مَعَهُ‏.‏ قَالَ الأَسْوَدُ وَكَانَ زَوْجُهَا حُرًّا‏.‏ قَوْلُ الأَسْوَدِ مُنْقَطِعٌ، وَقَوْلُ ابْنِ عَبَّاسٍ رَأَيْتُهُ عَبْدًا‏.‏ أَصَحُّ‏.‏"
      },
      {
        "id": 6486,
        "hadith_number": "6755",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keistimewaan Kota Madinah dan Larangan Berbuat Dosa di Sana",
        "perawi_melayu": "Diriwayatkan daripada `Ali رضي الله عنه :",
        "english_text": "We have no Book to recite except the Book of Allah (Qur'an) and this paper. Then `Ali took out the paper, and behold ! There was written in it, legal verdicts about the retaliation for wounds, the ages of the camels (to be paid as Zakat or as blood money). In it was also written: 'Medina is a sanctuary from Air (mountain) to Thaur (mountain). So whoever innovates in it an heresy (something new in religion) or commits a crime in it or gives shelter to such an innovator, will incur the curse of Allah, the angels and all the people, and none of his compulsory or optional good deeds will be accepted on the Day of Resurrection. And whoever (a freed slave) takes as his master (i.e. be-friends) some people other than hi real masters without the permission of his real masters, will incur the curse of Allah, the angels and all the people, and none of his compulsory, or optional good deeds will be accepted on the Day of Resurrection. And the asylum granted by any Muslim is to be secured by all the Muslims, even if it is granted by one of the lowest social status among them; and whoever betrays a Muslim, in this respect will incur the curse of Allah, the angels, and all the people, and none of his Compulsory or optional good deeds will be accepted on the Day of Resurrection.'",
        "malay_translation": "Kami tidak mempunyai Kitab untuk dibaca melainkan Kitab Allah (Al-Qur'an) dan kertas ini. Kemudian `Ali mengeluarkan kertas itu, dan lihatlah! Terdapat tulisan di dalamnya, keputusan perundangan tentang hukuman balas terhadap luka, umur unta (yang perlu dibayar sebagai Zakat atau sebagai diyat). Di dalamnya juga tertulis: 'Madinah adalah tanah suci dari Air (gunung) ke Thaur (gunung). Sesiapa sahaja yang melakukan bidaah (sesuatu yang baru dalam agama) di dalamnya atau melakukan jenayah di dalamnya atau memberikan perlindungan kepada pembidaah seperti itu, akan mendapat laknat daripada Allah, para malaikat dan seluruh manusia, dan tiada amal solehnya yang wajib mahupun sunat akan diterima pada Hari Kiamat. Dan sesiapa sahaja (seorang hamba yang dibebaskan) mengambil orang lain selain daripada tuannya yang sebenar sebagai tuannya (iaitu berkawan dengannya) tanpa kebenaran daripada tuannya yang sebenar, akan mendapat laknat daripada Allah, para malaikat dan seluruh manusia, dan tiada amal solehnya yang wajib mahupun sunat akan diterima pada Hari Kiamat. Dan perlindungan yang diberikan oleh mana-mana Muslim mesti dijamin oleh semua umat Islam, walaupun ia diberikan oleh seseorang yang berstatus sosial yang paling rendah di antara mereka; dan sesiapa sahaja yang mengkhianati seorang Muslim, dalam hal ini akan mendapat laknat daripada Allah, para malaikat, dan seluruh manusia, dan tiada amal solehnya yang Wajib atau sunat akan diterima pada Hari Kiamat.'",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ، قَالَ قَالَ عَلِيٌّ ـ رضى الله عنه مَا عِنْدَنَا كِتَابٌ نَقْرَؤُهُ إِلاَّ كِتَابُ اللَّهِ، غَيْرَ هَذِهِ الصَّحِيفَةِ‏.‏ قَالَ فَأَخْرَجَهَا فَإِذَا فِيهَا أَشْيَاءُ مِنَ الْجِرَاحَاتِ وَأَسْنَانِ الإِبِلِ‏.‏ قَالَ وَفِيهَا الْمَدِينَةُ حَرَمٌ مَا بَيْنَ عَيْرٍ إِلَى ثَوْرٍ، فَمَنْ أَحْدَثَ فِيهَا حَدَثًا، أَوْ آوَى مُحْدِثًا، فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يُقْبَلُ مِنْهُ يَوْمَ الْقِيَامَةِ صَرْفٌ وَلاَ عَدْلٌ، وَمَنْ وَالَى قَوْمًا بِغَيْرِ إِذْنِ مَوَالِيهِ، فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يُقْبَلُ مِنْهُ يَوْمَ الْقِيَامَةِ صَرْفٌ وَلاَ عَدْلٌ، وَذِمَّةُ الْمُسْلِمِينَ وَاحِدَةٌ، يَسْعَى بِهَا أَدْنَاهُمْ فَمَنْ أَخْفَرَ مُسْلِمًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يُقْبَلُ مِنْهُ يَوْمَ الْقِيَامَةِ صَرْفٌ وَلاَ عَدْلٌ‏.‏"
      },
      {
        "id": 6487,
        "hadith_number": "6756",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Menjual atau Memberi Wala' (Pembebasan Hamba)",
        "perawi_melayu": "Diriwayatkan oleh Ibnu 'Umar رضی اللہ عنہما :",
        "english_text": "The Prophet (ﷺ) forbade the selling of the Wala' (of slaves) or giving it as a present.",
        "malay_translation": "Nabi (ﷺ) melarang penjualan Wala' (hak perwalian hamba) atau memberikannya sebagai hadiah.",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ بَيْعِ الْوَلاَءِ وَعَنْ هِبَتِهِ‏.‏"
      },
      {
        "id": 6488,
        "hadith_number": "6757",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hak Wala Bagi Orang yang Membebaskan Hamba",
        "perawi_melayu": "Diriwayatkan oleh Ibnu `Umar رضی اللہ عنہما :",
        "english_text": "That Aisha رضی اللہ عنہا , the mother of the Believers, intended to buy a slave girl in order to manumit her. The slave girl's master said, \"We are ready to sell her to you on the condition that her Wala should be for us.\" Aisha mentioned that to Allah's Messenger (ﷺ) who said, \"This (condition) should not prevent you from buying her, for the Wala is for the one who manumits (the slave).\"",
        "malay_translation": "Bahawa Aisyah رضی اللہ عنہا , ibu orang-orang yang beriman, berniat untuk membeli seorang hamba perempuan dengan tujuan untuk membebaskannya. Tuan hamba perempuan itu berkata, \"Kami bersedia menjualnya kepada kamu dengan syarat Wala-nya adalah untuk kami.\" Aisyah menyebutkan hal itu kepada Rasulullah (ﷺ) yang bersabda, \"(Syarat) ini tidak boleh menghalangimu daripada membelinya, kerana Wala adalah untuk orang yang membebaskannya (hamba tersebut).\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ، أَرَادَتْ أَنْ تَشْتَرِيَ جَارِيَةً تُعْتِقُهَا فَقَالَ أَهْلُهَا نَبِيعُكِهَا عَلَى أَنَّ وَلاَءَهَا لَنَا‏.‏ فَذَكَرَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ لاَ يَمْنَعُكِ ذَلِكِ، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏"
      },
      {
        "id": 6489,
        "hadith_number": "6758",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pembebasan Barirah dan Pilihannya",
        "perawi_melayu": "Diriwayatkan oleh Aisyah رضی اللہ عنہا :",
        "english_text": "\"I bought Barira and her masters stipulated that the Wala would be for them.\" Aisha mentioned that to the Prophet (ﷺ) and he said, \"Manumit her, as the Wala is for the one who gives the silver (i.e. pays the price for freeing the slave).\" Aisha رضی اللہ عنہا added, \"So I manumitted her. After that, the Prophet caller her (Barira) and gave her the choice to go back to her husband or not. She said, \"If he gave me so much and so much (money) I would not stay with him.\" So she selected her ownself (i.e. refused to go back to her husband).\"",
        "malay_translation": "“Aku membeli Barirah dan tuan-tuannya menetapkan bahawa Wala (hak warisan) adalah untuk mereka.” Aisyah menyebutkan hal itu kepada Nabi ﷺ, lalu baginda bersabda, “Merdekakanlah dia, kerana Wala adalah hak bagi orang yang membayar perak (iaitu membayar harga untuk membebaskan hamba). ” Aisyah رضی اللہ عنہا menambah, “Maka aku memerdekakannya. Setelah itu, Nabi ﷺ memanggilnya (Barirah) dan memberinya pilihan sama ada untuk kembali kepada suaminya atau tidak. Dia berkata, “Sekiranya dia memberi aku begitu banyak dan begitu banyak (wang) aku tidak akan tinggal dengannya.” Maka dia memilih dirinya sendiri (iaitu menolak untuk kembali kepada suaminya).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتِ اشْتَرَيْتُ بَرِيرَةَ فَاشْتَرَطَ أَهْلُهَا وَلاَءَهَا، فَذَكَرَتْ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ أَعْتِقِيهَا فَإِنَّ الْوَلاَءَ لِمَنْ أَعْطَى الْوَرِقَ ‏\"‏‏.‏ قَالَتْ فَأَعْتَقْتُهَا ـ قَالَتْ ـ فَدَعَاهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَخَيَّرَهَا مِنْ زَوْجِهَا فَقَالَتْ لَوْ أَعْطَانِي كَذَا وَكَذَا مَا بِتُّ عِنْدَهُ‏.‏ فَاخْتَارَتْ نَفْسَهَا‏.‏"
      },
      {
        "id": 6490,
        "hadith_number": "6759",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukum Wala Bagi Orang yang Memerdekakan",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Umar رضی اللہ عنہما :",
        "english_text": "When Aisha رضی اللہ عنہا intended to buy Barira رضی اللہ عنہا , she said to the Prophet, \"Barira's masters stipulated that they will have the Wala.\" The Prophet (ﷺ) said (to Aisha), \"Buy her, as the Wala is for the one who manumits.\"",
        "malay_translation": "Ketika Aisyah رضی اللہ عنہا bercadang untuk membeli Barirah رضی اللہ عنہا, dia berkata kepada Nabi, \"Tuan-tuan Barirah telah menetapkan bahawa mereka akan memiliki Wala.\" Nabi (ﷺ) bersabda (kepada Aisyah), \"Belilah dia, kerana Wala adalah untuk orang yang memerdekakannya.\"",
        "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا هَمَّامٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ أَرَادَتْ عَائِشَةُ أَنْ تَشْتَرِيَ بَرِيرَةَ فَقَالَتْ لِلنَّبِيِّ صلى الله عليه وسلم إِنَّهُمْ يَشْتَرِطُونَ الْوَلاَءَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ اشْتَرِيهَا، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏"
      },
      {
        "id": 6491,
        "hadith_number": "6760",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hak Wala: Bagi Pemberi Perak dan Kebaikan",
        "perawi_melayu": "Diriwayatkan oleh Aisyah رضی اللہ عنہا :",
        "english_text": "Allah's Messenger (ﷺ) said, \"The wala is for the one who gives the silver (pays the price) and does the favor (of manumission after paying the price).",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Wala adalah hak bagi orang yang memberikan perak (membayar harga) dan melakukan kebaikan (pembebasan selepas membayar harga).\"",
        "arabic_text": "حَدَّثَنَا ابْنُ سَلاَمٍ، أَخْبَرَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الْوَلاَءُ لِمَنْ أَعْطَى الْوَرِقَ، وَوَلِيَ النِّعْمَةَ ‏\"‏‏.‏"
      },
      {
        "id": 6492,
        "hadith_number": "6761",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hamba yang Dibebaskan Menjadi Milik Orang yang Membebaskannya",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik رضي اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) said, \"The freed slave belongs to the people who have freed him,\" or said something similar.",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Hamba yang dibebaskan adalah milik orang yang membebaskannya,\" atau sabda yang seumpamanya.",
        "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا مُعَاوِيَةُ بْنُ قُرَّةَ، وَقَتَادَةُ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَوْلَى الْقَوْمِ مِنْ أَنْفُسِهِمْ ‏\"‏‏.‏ أَوْ كَمَا قَالَ‏.‏"
      },
      {
        "id": 6493,
        "hadith_number": "6762",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Anak Saudara Perempuan Dianggap Sebahagian Daripada Keluarga",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik رضي اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) said, \"The son of the sister of some people is from them or from their own selves.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Anak lelaki saudara perempuan sesetengah kaum adalah daripada kalangan mereka, atau daripada diri mereka sendiri.\"",
        "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ ابْنُ أُخْتِ الْقَوْمِ مِنْهُمْ ‏\"‏‏.‏ أَوْ ‏\"‏ مِنْ أَنْفُسِهِمْ ‏\"‏‏.‏"
      },
      {
        "id": 6494,
        "hadith_number": "6763",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Harta Pusaka dan Tanggungjawab Terhadap Mereka yang Meninggal Dunia",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) said, \" If somebody dies (among the Muslims) leaving some property, the property will go to his heirs; and if he leaves a debt or dependants, we will take care of them.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Jika seseorang meninggal dunia (di kalangan umat Islam) meninggalkan harta, maka harta itu akan diberikan kepada warisnya; dan jika dia meninggalkan hutang atau tanggungan, kami akan menguruskannya.\"",
        "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيٍّ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ تَرَكَ مَالاً فَلِوَرَثَتِهِ، وَمَنْ تَرَكَ كَلاًّ فَإِلَيْنَا ‏\"‏‏.‏"
      },
      {
        "id": 6495,
        "hadith_number": "6764",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Seorang Muslim Tidak Mewarisi Orang Kafir",
        "perawi_melayu": "Diriwayatkan oleh Usama bin Zaid رضی اللہ عنہما :",
        "english_text": "The Prophet (ﷺ) said, \"A Muslim cannot be the heir of a disbeliever, nor can a disbeliever be the heir of a Muslim.\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Seorang Muslim tidak boleh menjadi waris kepada orang kafir, dan orang kafir juga tidak boleh menjadi waris kepada seorang Muslim.\"",
        "arabic_text": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، عَنْ عَمْرِو بْنِ عُثْمَانَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَرِثُ الْمُسْلِمُ الْكَافِرَ، وَلاَ الْكَافِرُ الْمُسْلِمَ ‏\"‏‏.‏"
      },
      {
        "id": 6496,
        "hadith_number": "6765",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pertikaian Sa`d bin Abi Waqqas dan 'Abu bin Zam`a tentang Seorang Kanak-kanak",
        "perawi_melayu": "Diriwayatkan oleh `Aisha رضی اللہ عنہا :",
        "english_text": "Sa`d bin Abi Waqqas and 'Abu bin Zam`a رضی اللہ عنہا had a dispute over a boy. Sa`d رضی اللہ عنہ said, \"O Allah's Messenger (ﷺ)! This (boy) is the son of my brother, `Utba bin Abi Waqqas who told me to be his custodian as he was his son. Please notice to whom he bears affinity.\" And 'Abu bin Zam`a said, \"This is my brother, O Allah's Messenger (ﷺ)! He was born on my father's bed by his slave girl.\" Then the Prophet (ﷺ) looked at the boy and noticed evident resemblance between him and `Utba, so he said, \"He (the toy) is for you, O 'Abu bin Zam`a, for the boy is for the owner of the bed, and the stone is for the adulterer. Screen yourself before the boy, O Sauda bint Zam`a.\" `Aisha رضی اللہ عنہا added: Since then he had never seen Sauda.",
        "malay_translation": "Sa`d bin Abi Waqqas dan 'Abu bin Zam`a رضی اللہ عنہا bertengkar mengenai seorang kanak-kanak. Sa`d رضی اللہ عنہ berkata, \"Wahai Rasulullah (ﷺ)! (Kanak-kanak) ini adalah anak saudara lelaki saya, `Utba bin Abi Waqqas yang memberitahu saya untuk menjadi penjaganya kerana dia adalah anaknya. Sila perhatikan kepada siapa dia mempunyai pertalian.\" Dan 'Abu bin Zam`a berkata, \"Ini adalah saudara lelaki saya, wahai Rasulullah (ﷺ)! Dia dilahirkan di atas katil ayah saya oleh hamba perempuannya.\" Kemudian Nabi (ﷺ) memandang kanak-kanak itu dan melihat persamaan yang jelas antara dia dan `Utba, lalu baginda bersabda, \"Dia (kanak-kanak itu) adalah untukmu, wahai 'Abu bin Zam`a, kerana kanak-kanak itu adalah untuk pemilik katil, dan batu itu adalah untuk penzina. Lindungi dirimu di hadapan kanak-kanak itu, wahai Sauda bint Zam`a.\" `Aisha رضی اللہ عنہا menambah: Sejak itu, dia tidak pernah melihat Sauda.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتِ اخْتَصَمَ سَعْدُ بْنُ أَبِي وَقَّاصٍ وَعَبْدُ بْنُ زَمْعَةَ فِي غُلاَمٍ فَقَالَ سَعْدٌ هَذَا يَا رَسُولَ اللَّهِ ابْنُ أَخِي عُتْبَةَ بْنِ أَبِي وَقَّاصٍ عَهِدَ إِلَىَّ أَنَّهُ ابْنُهُ، انْظُرْ إِلَى شَبَهِهِ‏.‏ وَقَالَ عَبْدُ بْنُ زَمْعَةَ هَذَا أَخِي يَا رَسُولَ اللَّهِ، وُلِدَ عَلَى فِرَاشِ أَبِي مِنْ وَلِيدَتِهِ‏.‏ فَنَظَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى شَبَهِهِ فَرَأَى شَبَهًا بَيِّنًا بِعُتْبَةَ فَقَالَ ‏ \"‏ هُوَ لَكَ يَا عَبْدُ، الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ، وَاحْتَجِبِي مِنْهُ يَا سَوْدَةُ بِنْتَ زَمْعَةَ ‏\"‏‏.‏ قَالَتْ فَلَمْ يَرَ سَوْدَةَ قَطُّ‏.‏"
      },
      {
        "id": 6497,
        "hadith_number": "6766, 6767",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Haramnya Syurga Bagi Mereka yang Mengaku Anak Selain daripada Bapanya",
        "perawi_melayu": "Diriwayatkan oleh Sa`d رضی اللہ عنہ :",
        "english_text": "I heard the Prophet (ﷺ) saying, \"Whoever claims to be the son of a person other than his father, and he knows that person is not his father, then Paradise will be forbidden for him.\" I mentioned that to Abu Bakra رضی اللہ عنہ , and he said, \"My ears heard that and my heart memorized it from Allah's Messenger (ﷺ).",
        "malay_translation": "Saya mendengar Nabi (ﷺ) bersabda, \"Sesiapa yang mengaku sebagai anak kepada selain daripada bapanya, sedangkan dia tahu orang itu bukan bapanya, maka syurga haram baginya.\" Saya menyebutkan hal itu kepada Abu Bakra رضی اللہ عنہ , dan dia berkata, \"Telingaku mendengar dan hatiku menghafalnya daripada Rasulullah (ﷺ).",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا خَالِدٌ ـ هُوَ ابْنُ عَبْدِ اللَّهِ ـ حَدَّثَنَا خَالِدٌ، عَنْ أَبِي عُثْمَانَ، عَنْ سَعْدٍ ـ رضى الله عنه ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنِ ادَّعَى إِلَى غَيْرِ أَبِيهِ، وَهْوَ يَعْلَمُ أَنَّهُ غَيْرُ أَبِيهِ، فَالْجَنَّةُ عَلَيْهِ حَرَامٌ ‏\"‏‏.فَذَكَرْتُهُ لأَبِي بَكْرَةَ فَقَالَ وَأَنَا سَمِعَتْهُ أُذُنَاىَ، وَوَعَاهُ، قَلْبِي مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 6498,
        "hadith_number": "6768",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Mengingkari Bapa Kandung",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضي اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) said, \"Do not deny your fathers (i.e. claim to be the sons of persons other than your fathers), and whoever denies his father, is charged with disbelief.\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Janganlah kamu mengingkari bapa-bapa kamu (iaitu mengaku sebagai anak kepada orang selain daripada bapa kandung kamu), dan sesiapa yang mengingkari bapanya, maka dia telah melakukan kekufuran.\"",
        "arabic_text": "حَدَّثَنَا أَصْبَغُ بْنُ الْفَرَجِ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنْ عِرَاكٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَرْغَبُوا عَنْ آبَائِكُمْ، فَمَنْ رَغِبَ عَنْ أَبِيهِ فَهُوَ كُفْرٌ ‏\"‏‏.‏"
      },
      {
        "id": 6499,
        "hadith_number": "6769",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Dua Wanita dan Anak Mereka dalam Penghakiman Nabi Daud dan Sulaiman",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ عنہ:",
        "english_text": "Allah's Messenger (ﷺ) said, \"There were two women with whom there were their two sons. A wolf came and took away the son of one of them. That lady said to her companion, 'The wolf has taken your son.' The other said, 'But it has taken your son.' So both of them sought the judgment of (the Prophet) David who judged that the boy should be given to the older lady. Then both of them went to (the Prophet) Solomon, son of David and informed him of the case. Solomon said, 'Give me a knife so that I may cut the child into two portions and give one half to each of you.' The younger lady said, 'Do not do so; may Allah bless you ! He is her child.' On that, he gave the child to the younger lady.\" Abu Huraira رضی اللہ عنہ added: By Allah! I had never heard the word 'Sakkin' as meaning knife, except on that day, for we used to call it \"Mudya\".",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Ada dua orang wanita bersama dua orang anak lelaki mereka. Seekor serigala datang dan mengambil anak lelaki salah seorang daripada mereka. Wanita itu berkata kepada rakannya, 'Serigala telah mengambil anak lelaki kamu.' Yang seorang lagi berkata, 'Tetapi ia telah mengambil anak lelaki kamu.' Lalu kedua-duanya meminta penghakiman (Nabi) Daud yang memutuskan bahawa kanak-kanak itu harus diberikan kepada wanita yang lebih tua. Kemudian kedua-duanya pergi kepada (Nabi) Sulaiman, anak Nabi Daud dan memaklumkan kepadanya tentang kes tersebut. Sulaiman berkata, 'Berikan saya pisau supaya saya boleh membelah kanak-kanak itu kepada dua bahagian dan memberikan separuh kepada kamu masing-masing.' Wanita yang lebih muda berkata, 'Jangan lakukan demikian; semoga Allah memberkati kamu! Dia adalah anaknya.' Atas dasar itu, baginda memberikan kanak-kanak itu kepada wanita yang lebih muda.\" Abu Hurairah رضی اللہ عنہ menambah: Demi Allah! Saya tidak pernah mendengar perkataan 'Sakkin' yang bermaksud pisau, kecuali pada hari itu, kerana kami memanggilnya \"Mudya\".",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، قَالَ حَدَّثَنَا أَبُو الزِّنَادِ، عَنْ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ كَانَتِ امْرَأَتَانِ مَعَهُمَا ابْنَاهُمَا، جَاءَ الذِّئْبُ فَذَهَبَ بِابْنِ إِحْدَاهُمَا فَقَالَتْ لِصَاحِبَتِهَا إِنَّمَا ذَهَبَ بِابْنِكِ‏.‏ وَقَالَتِ الأُخْرَى إِنَّمَا ذَهَبَ بِابْنِكِ‏.‏ فَتَحَاكَمَتَا إِلَى دَاوُدَ ـ عَلَيْهِ السَّلاَمُ ـ فَقَضَى بِهِ لِلْكُبْرَى، فَخَرَجَتَا عَلَى سُلَيْمَانَ بْنِ دَاوُدَ ـ عَلَيْهِمَا السَّلاَمُ ـ فَأَخْبَرَتَاهُ فَقَالَ ائْتُونِي بِالسِّكِّينِ أَشُقُّهُ بَيْنَهُمَا‏.‏ فَقَالَتِ الصُّغْرَى لاَ تَفْعَلْ يَرْحَمُكَ اللَّهُ‏.‏ هُوَ ابْنُهَا‏.‏ فَقَضَى بِهِ لِلصُّغْرَى ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ وَاللَّهِ إِنْ سَمِعْتُ بِالسِّكِّينِ قَطُّ إِلاَّ يَوْمَئِذٍ، وَمَا كُنَّا نَقُولُ إِلاَّ الْمُدْيَةَ‏.‏"
      },
      {
        "id": 6500,
        "hadith_number": "6770",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keriangan Nabi SAW Melihat Mujazziz Mengenali Zaid dan Usama",
        "perawi_melayu": "Diriwayatkan daripada 'Aisha رضی اللہ عنہا :",
        "english_text": "Allah's Messenger (ﷺ) once entered upon me in a very happy mood, with his features glittering with joy, and said, \"O `Aisha! won't you see that Mujazziz (a Qa'if) looked just now at Zaid bin Haritha and Usama bin Zaid رضی اللہ عنہما and said, 'These feet (of Usama and his father) belong to each other.\" (See Hadith No. 755, Vol. 4)",
        "malay_translation": "Rasulullah SAW pernah masuk menemuiku dalam keadaan yang sangat gembira, dengan wajahnya bersinar-sinar kegembiraan, dan bersabda, \"Wahai `Aisha! Tidakkah engkau melihat Mujazziz (seorang Qa'if) baru sahaja memandang kepada Zaid bin Haritha dan Usama bin Zaid رضی اللہ عنہما dan berkata, 'Kaki-kaki (Usama dan bapanya) ini adalah daripada satu keturunan.'\" (Lihat Hadith No. 755, Jil. 4)",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ عَلَىَّ مَسْرُورًا تَبْرُقُ أَسَارِيرُ وَجْهِهِ فَقَالَ ‏ \"‏ أَلَمْ تَرَىْ أَنَّ مُجَزِّزًا نَظَرَ آنِفًا إِلَى زَيْدِ بْنِ حَارِثَةَ وَأُسَامَةَ بْنِ زَيْدٍ، فَقَالَ إِنَّ هَذِهِ الأَقْدَامَ بَعْضُهَا مِنْ بَعْضٍ ‏\"‏‏.‏"
      },
      {
        "id": 6501,
        "hadith_number": "6771",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Mujazziz Al-Mudliji dan Keserasian Usama dan Zaid",
        "perawi_melayu": "Diriwayatkan oleh `Aisha رضی اللہ عنہا :",
        "english_text": "Once Allah's Messenger (ﷺ) entered upon me and he was in a very happy mood and said, \"O `Aisha: Don't you know that Mujazziz Al-Mudliji entered and saw Usama and Zaid رضی اللہ عنہما with a velvet covering on them and their heads were covered while their feet were uncovered. He said, 'These feet belong to each other.'\"",
        "malay_translation": "Pada suatu ketika, Rasulullah (ﷺ) masuk menemui saya dalam keadaan yang sangat gembira dan bersabda, \"Wahai `Aisha: Tidakkah kamu tahu bahawa Mujazziz Al-Mudliji telah masuk dan melihat Usama dan Zaid رضی اللہ عنہما dengan penutup baldu pada mereka, kepala mereka ditutup sementara kaki mereka tidak tertutup. Dia berkata, 'Kaki-kaki ini adalah serupa.'\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ وَهْوَ مَسْرُورٌ فَقَالَ ‏ \"‏ يَا عَائِشَةُ أَلَمْ تَرَىْ أَنَّ مُجَزِّزًا الْمُدْلِجِيَّ دَخَلَ فَرَأَى أُسَامَةَ وَزَيْدًا وَعَلَيْهِمَا قَطِيفَةٌ، قَدْ غَطَّيَا رُءُوسَهُمَا وَبَدَتْ أَقْدَامُهُمَا، فَقَالَ إِنَّ هَذِهِ الأَقْدَامَ بَعْضُهَا مِنْ بَعْضٍ ‏\"‏‏.‏"
      }
    ]
  }
}