{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 50,
    "data": [
      {
        "id": 2521,
        "hadith_number": "2637",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah `Aisha dan Perkara yang Dikatakan Orang tentangnya",
        "perawi_melayu": "Dikisahkan oleh `Urwa bin Al-Musaiyab, Alqama bin Waqqas dan Ubaidullah bin `Abdullah",
        "english_text": "About the story of `Aisha and their narrations were similar attesting each other, when the liars said what they invented about `Aisha, and the Divine Inspiration was delayed, Allah's Messenger (ﷺ) sent for `Ali and Usama to consult them in divorcing his wife (i.e. `Aisha). Usama said, \"Keep your wife, as we know nothing about her except good.\" Buraira said, \"I cannot accuse her of any defect except that she is still a young girl who sleeps, neglecting her family's dough which the domestic goats come to eat (i.e. she was too simpleminded to deceive her husband).\" Allah's Messenger (ﷺ) said, \"Who can help me to take revenge over the man who has harmed me by defaming the reputation of my family? By Allah, I have not known about my family-anything except good, and they mentioned (i.e. accused) a man about whom I did not know anything except good.\"",
        "malay_translation": "Perihal kisah `Aisha dan mereka saling mengesahkan cerita mereka. Ketika pendusta mengatakan perkara yang mereka reka tentang `Aisha, dan wahyu daripada Allah ditangguhkan, Rasulullah (ﷺ) memanggil `Ali dan Usama untuk berunding tentang perceraian isterinya (iaitu `Aisha). Usama berkata, \"Jaga isteri anda, kerana kami tidak mengetahui apa-apa tentangnya melainkan kebaikan.\" Burairah berkata, \"Saya tidak boleh menuduhnya melakukan kesalahan apa-apa kecuali dia masih seorang gadis muda yang tidur, lalai terhadap adunan keluarganya yang dimakan kambing peliharaan (iaitu dia terlalu mudah untuk ditipu dan tidak dapat menipu suaminya).\" Rasulullah (ﷺ) bersabda, \"Siapakah yang dapat menolongku membalas dendam terhadap orang yang telah menzalimiku dengan mencemarkan maruah keluargaku? Demi Allah, aku tidak mengetahui apa-apa tentang keluargaku melainkan kebaikan, dan mereka menyebut (iaitu menuduh) seorang lelaki yang tidak aku ketahui melainkan kebaikannya.",
        "arabic_text": "حَدَّثَنَا حَجَّاجٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ النُّمَيْرِيُّ، حَدَّثَنَا يُونُسُ،‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ، وَابْنُ الْمُسَيَّبِ، وَعَلْقَمَةُ بْنُ وَقَّاصٍ، وَعُبَيْدُ اللَّهِ، عَنْ حَدِيثِ، عَائِشَةَ ـ رضى الله عنها ـ وَبَعْضُ حَدِيثِهِمْ يُصَدِّقُ بَعْضًا، حِينَ قَالَ لَهَا أَهْلُ الإِفْكِ، فَدَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَلِيًّا وَأُسَامَةَ حِينَ اسْتَلْبَثَ الْوَحْىُ يَسْتَأْمِرُهُمَا فِي فِرَاقِ أَهْلِهِ، فَأَمَّا أُسَامَةُ فَقَالَ أَهْلُكَ وَلاَ نَعْلَمُ إِلاَّ خَيْرًا‏.‏ وَقَالَتْ بَرِيرَةُ إِنْ رَأَيْتُ عَلَيْهَا أَمْرًا أَغْمِصُهُ أَكْثَرَ مِنْ أَنَّهَا جَارِيَةٌ حَدِيثَةُ السِّنِّ تَنَامُ عَنْ عَجِينِ أَهْلِهَا، فَتَأْتِي الدَّاجِنُ فَتَأْكُلُهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ يَعْذِرُنَا مِنْ رَجُلٍ بَلَغَنِي أَذَاهُ فِي أَهْلِ بَيْتِي فَوَاللَّهِ مَا عَلِمْتُ مِنْ أَهْلِي إِلاَّ خَيْرًا، وَلَقَدْ ذَكَرُوا رَجُلاً مَا عَلِمْتُ عَلَيْهِ إِلاَّ خَيْرًا ‏\"‏‏.‏"
      },
      {
        "id": 2522,
        "hadith_number": "2638",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Menyembunyikan Diri di Taman Ibn Saiyad",
        "perawi_melayu": "Dikisahkan oleh Abdullah bin Umar",
        "english_text": "Allah's Messenger (ﷺ) and Ubai bin Ka`b Al-Ansari رضی اللہ عنہ went to the garden where Ibn Saiyad used to live. When Allah's Messenger (ﷺ) entered (the garden), he (i.e. Allah's Messenger (ﷺ) ) started hiding himself behind the date108 palms as he wanted to hear secretly the talk of Ibn Saiyad before the latter saw him. Ibn Saiyad wrapped with a soft decorated sheet was lying on his bed murmuring. Ibn Saiyad's mother saw the Prophet hiding behind the stems of the date-palms. She addressed Ibn Saiyad saying, \"O Saf, this is Muhammad.\" Hearing that Ibn Saiyad stopped murmuring (or got cautious), the Prophet (ﷺ) said, \"If she had left him undisturbed, he would have revealed his reality.\" (See Hadith No. 290, Vol 4 for details)",
        "malay_translation": "Rasulullah SAW dan Ubai bin Ka`b Al-Ansari pergi ke taman tempat Ibn Saiyad tinggal.  Apabila Rasulullah SAW memasuki taman itu, Baginda menyembunyikan diri di belakang pokok kurma untuk mendengar perbualan Ibn Saiyad tanpa diketahui.  Ibn Saiyad sedang berbaring di atas katilnya, dibalut dengan kain sutera yang indah, dan sedang bergumam.  Ibu Ibn Saiyad melihat Rasulullah SAW yang tersembunyi di sebalik batang pokok kurma.  Beliau memanggil Ibn Saiyad, \"Wahai Saf, ini Muhammad.\" Mendengar itu, Ibn Saiyad berhenti bergumam (atau menjadi berhati-hati).  Rasulullah SAW berkata, \"Sekiranya ibu kamu tidak mengganggu dia, Ibn Saiyad akan mendedahkan hakikat dirinya.\" (Lihat Hadis No. 290, Jilid 4 untuk keterangan lanjut).",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ سَالِمٌ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ انْطَلَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأُبَىُّ بْنُ كَعْبٍ الأَنْصَارِيُّ يَؤُمَّانِ النَّخْلَ الَّتِي فِيهَا ابْنُ صَيَّادٍ حَتَّى إِذَا دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم طَفِقَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَتَّقِي بِجُذُوعِ النَّخْلِ، وَهْوَ يَخْتِلُ أَنْ يَسْمَعَ مِنِ ابْنِ صَيَّادٍ شَيْئًا قَبْلَ أَنْ يَرَاهُ، وَابْنُ صَيَّادٍ مُضْطَجِعٌ عَلَى فِرَاشِهِ فِي قَطِيفَةٍ لَهُ فِيهَا رَمْرَمَةٌ ـ أَوْ زَمْزَمَةٌ ـ فَرَأَتْ أُمُّ ابْنِ صَيَّادٍ النَّبِيَّ صلى الله عليه وسلم وَهْوَ يَتَّقِي بِجُذُوعِ النَّخْلِ، فَقَالَتْ لاِبْنِ صَيَّادِ أَىْ صَافِ، هَذَا مُحَمَّدٌ‏.‏ فَتَنَاهَى ابْنُ صَيَّادٍ، قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَوْ تَرَكَتْهُ بَيَّنَ ‏\"‏‏.‏"
      },
      {
        "id": 2523,
        "hadith_number": "2639",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perkahwinan Semula dan Ketidaksuburan",
        "perawi_melayu": "Dikisahkan oleh Aisha",
        "english_text": "The wife of Rifa`a Al-Qurazi came to the Prophet (ﷺ) and said, \"I was Rifa`a's wife, but he divorced me and it was a final irrevocable divorce. Then I married `Abdur-Rahman bin Az-Zubair but he is impotent.\" The Prophet (ﷺ) asked her 'Do you want to remarry Rifa`a? You cannot unless you had a complete sexual relation with your present husband.\" Abu Bakr رضی اللہ عنہ was sitting with Allah's Messenger (ﷺ) and Khalid bin Sa`id bin Al-`As was at the door waiting to be admitted. He said, \"O Abu Bakr! Do you hear what this (woman) is revealing frankly before the Prophet (ﷺ) ?\"",
        "malay_translation": "Isteri Rifa`a Al-Qurazi datang menemui Nabi (ﷺ) dan berkata, \"Saya isteri Rifa`a, tetapi dia menceraikan saya dengan talak tiga. Kemudian saya berkahwin dengan `Abdur-Rahman bin Az-Zubair, tetapi dia mandul.\" Nabi (ﷺ) bertanya kepadanya, 'Engkau mahu berkahwin semula dengan Rifa`a? Tidak boleh kecuali jika engkau telah melakukan hubungan seksual sepenuhnya dengan suami engkau yang sekarang.' Abu Bakr رضی اللہ عنہ sedang duduk bersama Rasulullah (ﷺ), dan Khalid bin Sa`id bin Al-`As berada di pintu menunggu untuk diizinkan masuk. Dia berkata, \"Wahai Abu Bakr! Engkau dengar apa yang wanita ini nyatakan secara jujur di hadapan Rasulullah (ﷺ)?\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ جَاءَتِ امْرَأَةُ رِفَاعَةَ الْقُرَظِيِّ النَّبِيَّ صلى الله عليه وسلم فَقَالَتْ كُنْتُ عِنْدَ رِفَاعَةَ فَطَلَّقَنِي فَأَبَتَّ طَلاَقِي، فَتَزَوَّجْتُ عَبْدَ الرَّحْمَنِ بْنَ الزَّبِيرِ، إِنَّمَا مَعَهُ مِثْلُ هُدْبَةِ الثَّوْبِ‏.‏ فَقَالَ ‏ \"‏ أَتُرِيدِينَ أَنْ تَرْجِعِي إِلَى رِفَاعَةَ لاَ حَتَّى تَذُوقِي عُسَيْلَتَهُ وَيَذُوقَ عُسَيْلَتَكِ ‏\"‏‏.‏ وَأَبُو بَكْرٍ جَالِسٌ عِنْدَهُ وَخَالِدُ بْنُ سَعِيدِ بْنِ الْعَاصِ بِالْبَابِ يَنْتَظِرُ أَنْ يُؤْذَنَ لَهُ، فَقَالَ يَا أَبَا بَكْرٍ، أَلاَ تَسْمَعُ إِلَى هَذِهِ مَا تَجْهَرُ بِهِ عِنْدَ النَّبِيِّ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 2524,
        "hadith_number": "2640",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perceraian kerana Persusuan yang Tidak Diketahui",
        "perawi_melayu": "Dikisahkan oleh `Abdullah bin Abu Mulaika daripada `Uqba bin Al-Harith",
        "english_text": "`Uqba رضی اللہ عنہ married the daughter of Abu Ihab bin `Aziz, and then a woman came and said, \"I suckled `Uqba رضی اللہ عنہ and his wife.\" `Uqba رضی اللہ عنہ said to her, \"I do not know that you have suckled me, and you did not inform me.\" He then sent someone to the house of Abu Ihab to inquire about that but they did not know that she had suckled their daughter. Then `Uqba        رضی اللہ عنہ went to the Prophet (ﷺ) in Medina and asked him about it. The Prophet (ﷺ) said to him, \"How (can you keep your wife) after it has been said (that both of you were suckled by the same woman)?\" So, he divorced her and she was married to another (husband).",
        "malay_translation": "`Uqba telah mengahwini anak perempuan Abu Ihab bin `Aziz. Kemudian, seorang wanita datang dan berkata, \"Saya menyusu `Uqba dan isterinya.\" `Uqba berkata kepadanya, \"Saya tidak tahu anda menyusu saya dan anda tidak memberitahu saya.\" Kemudian dia menghantar seseorang ke rumah Abu Ihab untuk menanyakan perkara itu, tetapi mereka tidak tahu bahawa wanita itu telah menyusu anak perempuan mereka. Kemudian `Uqba pergi ke Rasulullah SAW di Madinah dan bertanya tentang perkara tersebut. Baginda bersabda, \"Bagaimana engkau boleh terus beristeri dengannya setelah dikatakan bahawa kamu berdua disusukan oleh wanita yang sama?\" Oleh itu, dia menceraikan isterinya dan wanita itu berkahwin dengan lelaki lain.",
        "arabic_text": "حَدَّثَنَا حِبَّانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا عُمَرُ بْنُ سَعِيدِ بْنِ أَبِي حُسَيْنٍ، قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ أَبِي مُلَيْكَةَ، عَنْ عُقْبَةَ بْنِ الْحَارِثِ، أَنَّهُ تَزَوَّجَ ابْنَةً لأَبِي إِهَابِ بْنِ عَزِيزٍ، فَأَتَتْهُ امْرَأَةٌ فَقَالَتْ قَدْ أَرْضَعْتُ عُقْبَةَ وَالَّتِي تَزَوَّجَ‏.‏ فَقَالَ لَهَا عُقْبَةُ مَا أَعْلَمُ أَنَّكِ أَرْضَعْتِنِي وَلاَ أَخْبَرْتِنِي‏.‏ فَأَرْسَلَ إِلَى آلِ أَبِي إِهَابٍ يَسْأَلُهُمْ فَقَالُوا مَا عَلِمْنَا أَرْضَعَتْ صَاحِبَتَنَا‏.‏ فَرَكِبَ إِلَى النَّبِيِّ صلى الله عليه وسلم بِالْمَدِينَةِ فَسَأَلَهُ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كَيْفَ وَقَدْ قِيلَ ‏\"‏‏.‏ فَفَارَقَهَا، وَنَكَحَتْ زَوْجًا غَيْرَهُ‏.‏"
      },
      {
        "id": 2525,
        "hadith_number": "2641",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kriteria Pertimbangan dan Penilaian Amalan pada Zaman Sekarang",
        "perawi_melayu": "Dikisahkan oleh `Umar bin Al-Khattab",
        "english_text": "People were (sometimes) judged by the revealing of a Divine Inspiration during the lifetime of Allah's Apostle but now there is no longer any more (new revelation). Now we judge you by the deeds you practice publicly, so we will trust and favor the one who does good deeds in front of us, and we will not call him to account about what he is really doing in secret, for Allah will judge him for that; but we will not trust or believe the one who presents to us with an evil deed even if he claims that his intentions were good.",
        "malay_translation": "Pada zaman Rasulullah SAW, manusia terkadang dinilai berdasarkan wahyu Ilahi. Namun kini, tidak ada lagi wahyu baru. Sekarang, kita menilai kalian berdasarkan amalan yang diperlihatkan kepada kita.  Maka, kita akan mempercayai dan memihak kepada orang yang melakukan amalan kebaikan di depan mata kita, dan kita tidak akan mempersoalkan apa yang dilakukannya secara rahsia, kerana Allah akan menghisabnya. Namun, kita tidak akan mempercayai atau membenarkan orang yang memperlihatkan amalan buruk kepada kita, walaupun dia mendakwa niatnya baik.",
        "arabic_text": "حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُتْبَةَ، قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ يَقُولُ إِنَّ أُنَاسًا كَانُوا يُؤْخَذُونَ بِالْوَحْىِ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم، وَإِنَّ الْوَحْىَ قَدِ انْقَطَعَ، وَإِنَّمَا نَأْخُذُكُمُ الآنَ بِمَا ظَهَرَ لَنَا مِنْ أَعْمَالِكُمْ، فَمَنْ أَظْهَرَ لَنَا خَيْرًا أَمِنَّاهُ وَقَرَّبْنَاهُ، وَلَيْسَ إِلَيْنَا مِنْ سَرِيرَتِهِ شَىْءٌ، اللَّهُ يُحَاسِبُهُ فِي سَرِيرَتِهِ، وَمَنْ أَظْهَرَ لَنَا سُوءًا لَمْ نَأْمَنْهُ وَلَمْ نُصَدِّقْهُ، وَإِنْ قَالَ إِنَّ سَرِيرَتَهُ حَسَنَةٌ‏.‏"
      },
      {
        "id": 2526,
        "hadith_number": "2642",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Peristiwa Jenazah dan Keadilan Allah",
        "perawi_melayu": "Dikisahkan oleh Anas",
        "english_text": "A funeral procession passed in front of the Prophet (ﷺ) and the people praised the deceased. The Prophet (ﷺ) said, \"It has been affirmed (Paradise).\" Then another funeral procession passed by and the people talked badly of the deceased. The Prophet (ﷺ) said, \"It has been affirmed (Hell).\" Allah's Messenger (ﷺ) was asked, \"O Allah's Messenger (ﷺ)! You said it has been affirmed for both?\" The Prophet (ﷺ) said, \"The testimony of the people (is accepted), (for) the believer are Allah's witnesses on the earth.\"",
        "malay_translation": "Sebuah rombongan jenazah melintasi hadapan Nabi SAW dan orang ramai memuji si mati. Baginda SAW bersabda, \"(Syurga) telah ditetapkan baginya.\" Kemudian rombongan jenazah lain melintasi dan orang ramai memperkatakan keburukan si mati. Baginda SAW bersabda, \"(Neraka) telah ditetapkan baginya.\" Para sahabat bertanya kepada Rasulullah SAW, \"Wahai Rasulullah! Engkau katakan telah ditetapkan bagi kedua-duanya?\" Baginda SAW menjawab, \"Saksi-saksi manusia (diterima), (kerana) orang beriman adalah saksi-saksi Allah di muka bumi.",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ مُرَّ عَلَى النَّبِيِّ صلى الله عليه وسلم بِجَنَازَةٍ، فَأَثْنَوْا عَلَيْهَا خَيْرًا فَقَالَ ‏\"‏ وَجَبَتْ ‏\"‏‏.‏ ثُمَّ مُرَّ بِأُخْرَى فَأَثْنَوْا عَلَيْهَا شَرًّا ـ أَوْ قَالَ غَيْرَ ذَلِكَ ـ فَقَالَ ‏\"‏ وَجَبَتْ ‏\"‏‏.‏ فَقِيلَ يَا رَسُولَ اللَّهِ، قُلْتَ لِهَذَا وَجَبَتْ، وَلِهَذَا وَجَبَتْ، قَالَ ‏\"‏ شَهَادَةُ الْقَوْمِ، الْمُؤْمِنُونَ شُهَدَاءُ اللَّهِ فِي الأَرْضِ ‏\"‏‏.‏"
      },
      {
        "id": 2527,
        "hadith_number": "2643",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kepastian Syurga dan Neraka Berdasarkan Kesihatan dan Perkataan Orang Lain",
        "perawi_melayu": "Dikisahkan oleh Abu Al-Aswad:",
        "english_text": "Once I went to Medina where there was an outbreak of disease and the people were dying rapidly. I was sitting with `Umar رضی اللہ عنہ and a funeral procession passed by. The people praised the deceased. `Umar رضی اللہ عنہ said, \"It has been affirmed\" (Paradise). Then another funeral procession passed by. The people praised the deceased. `Umar رضی اللہ عنہ said, \"It has been affirmed.\" (Paradise). Then another funeral procession passed by. The people praised the deceased. `Umar رضی اللہ عنہ said, \"It has been affirmed (Paradise).\" Then a third funeral procession passed by and the people talked badly of the deceased. `Umar رضی اللہ عنہ said, \"It has been affirmed (Hell).\" I asked `Umar رضی اللہ عنہ , \"O chief of the believers! What has been affirmed?\" He said, \"I have said what the Prophet (ﷺ) said. He said, 'Allah will admit into paradise any Muslim whose good character is attested by four persons.' We asked the Prophet, 'If there were three witnesses only?' He said, 'Even three.' We asked, 'If there were two only?' He said, 'Even two.' But we did not ask him about one witness.\"",
        "malay_translation": "Pada suatu ketika, aku pergi ke Madinah ketika wabak penyakit melanda dan penduduknya meninggal dunia dengan pantas. Aku duduk bersama `Umar al-Khattab, dan suatu perarakan jenazah lalu. Orang ramai memuji si mati. `Umar al-Khattab berkata, \"Sudah ditentukan (Syurga).\" Kemudian perarakan jenazah lain lalu. Orang ramai memuji si mati. `Umar al-Khattab berkata, \"Sudah ditentukan (Syurga).\" Kemudian perarakan jenazah lain lalu. Orang ramai memuji si mati. `Umar al-Khattab berkata, \"Sudah ditentukan (Syurga).\" Kemudian, perarakan jenazah ketiga lalu, dan orang ramai memperkatakan buruk tentang si mati. `Umar al-Khattab berkata, \"Sudah ditentukan (Neraka).\" Aku bertanya kepada `Umar al-Khattab, \"Wahai ketua orang yang beriman! Apakah yang telah ditentukan?\" Dia menjawab, \"Aku telah mengucapkan apa yang Nabi (ﷺ) telah katakan. Baginda bersabda, 'Allah akan memasukkan ke dalam syurga sesiapa sahaja Muslim yang akhlaknya baik disahkan oleh empat orang.' Kami bertanya kepada Nabi, 'Jika hanya ada tiga saksi?' Baginda menjawab, 'Meskipun hanya tiga.' Kami bertanya, 'Jika hanya ada dua?' Baginda menjawab, 'Meskipun hanya dua.' Namun, kami tidak bertanya kepada baginda tentang satu saksi.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا دَاوُدُ بْنُ أَبِي الْفُرَاتِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، عَنْ أَبِي الأَسْوَدِ، قَالَ أَتَيْتُ الْمَدِينَةَ وَقَدْ وَقَعَ بِهَا مَرَضٌ، وَهُمْ يَمُوتُونَ مَوْتًا ذَرِيعًا، فَجَلَسْتُ إِلَى عُمَرَ ـ رضى الله عنه ـ فَمَرَّتْ جِنَازَةٌ فَأُثْنِيَ خَيْرٌ فَقَالَ عُمَرُ وَجَبَتْ‏.‏ ثُمَّ مُرَّ بِأُخْرَى فَأُثْنِيَ خَيْرًا فَقَالَ وَجَبَتْ‏.‏ ثُمَّ مُرَّ بِالثَّالِثَةِ فَأُثْنِيَ شَرًّا، فَقَالَ وَجَبَتْ‏.‏ فَقُلْتُ مَا وَجَبَتْ يَا أَمِيرَ الْمُؤْمِنِينَ قَالَ قُلْتُ كَمَا قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَيُّمَا مُسْلِمٍ شَهِدَ لَهُ أَرْبَعَةٌ بِخَيْرٍ أَدْخَلَهُ اللَّهُ الْجَنَّةَ ‏\"‏‏.‏ قُلْنَا وَثَلاَثَةٌ قَالَ ‏\"‏ وَثَلاَثَةٌ ‏\"‏‏.‏ قُلْتُ وَاثْنَانِ قَالَ ‏\"‏ وَاثْنَانِ ‏\"‏‏.‏ ثُمَّ لَمْ نَسْأَلْهُ عَنِ الْوَاحِدِ‏.‏"
      },
      {
        "id": 2528,
        "hadith_number": "2644",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Permohonan Lawatan Aflah dan Penjelasan Rasulullah SAW",
        "perawi_melayu": "Diriwayatkan oleh 'Aishah r.a.",
        "english_text": "Aflah رضی اللہ عنہ asked the permission to visit me but I did not allow him. He said, \"Do you veil yourself before me although I am your uncle?\" `Aisha رضی اللہ عنہا said, \"How is that?\" Aflah replied, \"You were suckled by my brother's wife with my brother's milk.\" I asked Allah's Messenger (ﷺ) about it, and he said, \"Aflah is right, so permit him to visit you.\"",
        "malay_translation": "Aflah meminta izin untuk melawat saya, tetapi saya menolaknya. Beliau berkata, \"Apakah engkau menutup diri dariku padahal aku adalah pakcikmu?\" 'Aishah r.a. bertanya, \"Bagaimana maksudnya?\" Aflah menjawab, \"Engkau menyusu dari isteri saudaraku dengan susu saudaraku.\" Saya bertanya kepada Rasulullah SAW tentang hal ini, dan Baginda bersabda, \"Aflah benar, maka izinkanlah dia melawat engkau.\"",
        "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنَا الْحَكَمُ، عَنْ عِرَاكِ بْنِ مَالِكٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتِ اسْتَأْذَنَ عَلَىَّ أَفْلَحُ فَلَمْ آذَنْ لَهُ، فَقَالَ أَتَحْتَجِبِينَ مِنِّي وَأَنَا عَمُّكِ فَقُلْتُ وَكَيْفَ ذَلِكَ قَالَ أَرْضَعَتْكِ امْرَأَةُ أَخِي بِلَبَنِ أَخِي‏.‏ فَقَالَتْ سَأَلْتُ عَنْ ذَلِكَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ صَدَقَ أَفْلَحُ، ائْذَنِي لَهُ ‏\"‏‏.‏"
      },
      {
        "id": 2529,
        "hadith_number": "2645",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Mengahwini Anak Perempuan Saudara Susuan",
        "perawi_melayu": "Diceritakan oleh Ibn `Abbas",
        "english_text": "The Prophet (ﷺ) said about Hamza's daughter, \"I am not legally permitted to marry her, as foster relations are treated like blood relations (in marital affairs). She is the daughter of my foster brother.\"",
        "malay_translation": "Rasulullah SAW bersabda tentang anak perempuan Hamzah, \"Aku tidak dibenarkan secara syarak untuk menikahinya, kerana hubungan susuan dianggap sama seperti hubungan darah dalam hal perkahwinan. Dia adalah anak perempuan saudara susuan ku.\"",
        "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ جَابِرِ بْنِ زَيْدٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم فِي بِنْتِ حَمْزَةَ ‏ \"‏ لاَ تَحِلُّ لِي، يَحْرُمُ مِنَ الرَّضَاعِ مَا يَحْرُمُ مِنَ النَّسَبِ، هِيَ بِنْتُ أَخِي مِنَ الرَّضَاعَةِ ‏\"‏‏.‏"
      },
      {
        "id": 2530,
        "hadith_number": "2646",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Peraturan Perhubungan Kekeluargaan Angkat dalam Kehidupan Rasulullah SAW",
        "perawi_melayu": "Dikisahkan oleh `Aisha رضي الله عنها, isteri Nabi SAW :",
        "english_text": "While the Prophet (ﷺ) was in her house, she heard a man asking Hafsa's permission to enter her house. `Aisha رضي الله عنها said, \"I said, 'O Allah's Messenger (ﷺ)! I think the man is Hafsa's foster uncle.' \" `Aisha رضي الله عنها added, \"O Allah's Messenger (ﷺ)! There is a man asking the permission to enter your house.\" Allah's Messenger (ﷺ) replied, \"I think the man is Hafsa's foster uncle.\" `Aisha رضي الله عنها said, \"If so-and-so were living (i.e. her foster uncle) would he be allowed to visit me?\" Allah's Apostle said, \"Yes, he would, as the foster relations are treated like blood relations (in marital affairs).\"",
        "malay_translation": "Ketika Rasulullah SAW berada di rumahnya, beliau mendengar seorang lelaki meminta izin Hafsah untuk masuk ke rumahnya. `Aisha رضي الله عنها berkata, \"Saya berkata, 'Wahai Rasulullah SAW! Saya fikir lelaki itu adalah saudara angkat Hafsah.'\" `Aisha رضي الله عنها menambah, \"Wahai Rasulullah SAW! Ada seorang lelaki yang meminta izin untuk masuk ke rumahmu.\" Rasulullah SAW menjawab, \"Saya fikir lelaki itu adalah saudara angkat Hafsah.\" `Aisha رضي الله عنها bertanya, \"Jika saudara angkat itu masih hidup, adakah dia dibenarkan melawatku?\" Rasulullah SAW bersabda, \"Ya, dia dibenarkan, kerana hubungan pertalian angkat dianggap sama seperti hubungan darah (dalam hal perkahwinan).\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ عِنْدَهَا، وَأَنَّهَا سَمِعَتْ صَوْتَ رَجُلٍ يَسْتَأْذِنُ فِي بَيْتِ حَفْصَةَ‏.‏ قَالَتْ عَائِشَةُ فَقُلْتُ يَا رَسُولَ اللَّهِ أُرَاهُ فُلاَنًا‏.‏ لِعَمِّ حَفْصَةَ مِنَ الرَّضَاعَةِ‏.‏ فَقَالَتْ عَائِشَةُ يَا رَسُولَ اللَّهِ، هَذَا رَجُلٌ يَسْتَأْذِنُ فِي بَيْتِكَ‏.‏ قَالَتْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أُرَاهُ فُلاَنًا ‏\"‏‏.‏ لِعَمِّ حَفْصَةَ مِنَ الرَّضَاعَةِ‏.‏ فَقَالَتْ عَائِشَةُ لَوْ كَانَ فُلاَنٌ حَيًّا ـ لِعَمِّهَا مِنَ الرَّضَاعَةِ ـ دَخَلَ عَلَىَّ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَعَمْ، إِنَّ الرَّضَاعَةَ تُحَرِّمُ مَا يَحْرُمُ مِنَ الْوِلاَدَةِ ‏\"‏‏.‏"
      },
      {
        "id": 2531,
        "hadith_number": "2647",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kepastian Mengenai Persaudaraan Susuan",
        "perawi_melayu": "Dikisahkan oleh `Aisha رضي الله عنها",
        "english_text": "Once the Prophet (ﷺ) came to me while a man was in my house. He said, \"O `Aisha! Who is this (man)?\" I replied, \"My foster brothers\" He said, \"O `Aisha  رضی اللہ عنہا ! Be sure about your foster brothers, as fostership is only valid if it takes place in the suckling period (before two years of age). Ibn-e-Mahdi corroborated him from Sufyan.",
        "malay_translation": "Suatu ketika Rasulullah SAW datang menemui saya ketika ada seorang lelaki di rumah saya. Baginda bertanya, \"Wahai `Aisha, siapakah lelaki ini?\" Saya menjawab, \"Mereka adalah saudara susuan saya.\" Baginda bersabda, \"Wahai `Aisha رضي الله عنها, pastikan persaudaraan susuan itu sahih, kerana persaudaraan susuan hanya sah jika berlaku dalam tempoh menyusu (sebelum dua tahun).\" Ibn-e-Mahdi mengesahkan keterangan tersebut dari Sufyan.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ، عَنْ أَبِيهِ، عَنْ مَسْرُوقٍ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ دَخَلَ عَلَىَّ النَّبِيُّ صلى الله عليه وسلم وَعِنْدِي رَجُلٌ، قَالَ ‏\"‏ يَا عَائِشَةُ مَنْ هَذَا ‏\"‏‏.‏ قُلْتُ أَخِي مِنَ الرَّضَاعَةِ‏.‏ قَالَ ‏\"‏ يَا عَائِشَةُ، انْظُرْنَ مَنْ إِخْوَانُكُنَّ، فَإِنَّمَا الرَّضَاعَةُ مِنَ الْمَجَاعَةِ ‏\"‏‏.‏ تَابَعَهُ ابْنُ مَهْدِيٍّ عَنْ سُفْيَانَ‏.‏"
      },
      {
        "id": 2532,
        "hadith_number": "2648",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pemotongan Tangan Wanita Pencuri di Perang Fathul Mekah dan Taubatnya",
        "perawi_melayu": "Dikisahkan oleh `Urwa bin Az-Zubair",
        "english_text": "A woman committed theft in the Ghazwa of the Conquest (of Mecca) and she was taken to the Prophet who ordered her hand to be cut off. `Aisha رضی اللہ عنہا said, \"Her repentance was perfect and she was married (later) and used to come to me (after that) and I would present her needs to Allah's Messenger (ﷺ).\"",
        "malay_translation": "Seorang wanita melakukan pencurian dalam Perang Fathul Mekah dan dibawa kepada Nabi yang memerintahkan tangannya dipotong. `Aisha r.a. berkata, \"Taubatnya sempurna dan dia kemudian berkahwin serta sering datang kepadaku. Aku akan menyampaikan keperluannya kepada Rasulullah SAW.\"",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، عَنْ يُونُسَ،‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ امْرَأَةً، سَرَقَتْ فِي غَزْوَةِ الْفَتْحِ، فَأُتِيَ بِهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ أَمَرَ فَقُطِعَتْ يَدُهَا‏.‏ قَالَتْ عَائِشَةُ فَحَسُنَتْ تَوْبَتُهَا وَتَزَوَّجَتْ، وَكَانَتْ تَأْتِي بَعْدَ ذَلِكَ فَأَرْفَعُ حَاجَتَهَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 2533,
        "hadith_number": "2649",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman Bagi Lelaki Bujang yang Melakukan Zina dan Pengusirannya",
        "perawi_melayu": "Dikisahkan oleh Zaid bin Khalid",
        "english_text": "Allah's Messenger (ﷺ) ordered that an unmarried man who committed illegal sexual intercourse be scourged one hundred lashes and sent into exile for one year.",
        "malay_translation": "Rasulullah SAW memerintahkan agar lelaki bujang yang melakukan perzinaan dihukum seksa dengan seratus sebatan dan diasingkan selama setahun.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ زَيْدِ بْنِ خَالِدٍ ـ رضى الله عنه ـ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ أَمَرَ فِيمَنْ زَنَى وَلَمْ يُحْصِنْ بِجَلْدِ مِائَةٍ وَتَغْرِيبِ عَامٍ‏.‏"
      },
      {
        "id": 2534,
        "hadith_number": "2650",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Menjadi Saksi dalam Kezaliman",
        "perawi_melayu": "Dikisahkan oleh An-Nu`man bin Bashir:",
        "english_text": "My mother asked my father to present me a gift from his property; and he gave it to me after some hesitation. My mother said that she would not be satisfied unless the Prophet (ﷺ) was made a witness to it. I being a young boy, my father held me by the hand and took me to the Prophet (ﷺ) . He said to the Prophet, \"His mother, bint Rawaha, requested me to give this boy a gift.\" The Prophet (ﷺ) said, \"Do you have other sons besides him?\" He said, \"Yes.\" The Prophet (ﷺ) said, \"Do not make me a witness for injustice.\" Narrated Ash-Shu`bi that the Prophet (ﷺ) said, \"I will not become a witness for injustice.\"",
        "malay_translation": "Ibuku meminta ayahku untuk memberikan hadiah dari harta miliknya kepadaku; dan dia memberikannya kepadaku setelah sedikit ragu-ragu. Ibuku berkata bahawa dia tidak akan berpuas hati kecuali jika Nabi SAW dijadikan saksi atas hal itu. Aku masih kanak-kanak, ayahku memegang tanganku dan membawaku kepada Nabi SAW. Dia berkata kepada Nabi, \"Ibunya, bint Rawaha, memintaku untuk memberikan hadiah ini kepada anak ini.\" Nabi SAW bertanya, \"Apakah kamu ada anak lelaki lain selain dia?\" Dia menjawab, \"Ya.\" Nabi SAW bersabda, \"Jangan jadikan aku saksi atas ketidakadilan.\" Dikisahkan oleh Ash-Shu`bi bahawa Nabi SAW bersabda, \"Aku tidak akan menjadi saksi atas ketidakadilan.\"",
        "arabic_text": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا أَبُو حَيَّانَ التَّيْمِيُّ، عَنِ الشَّعْبِيِّ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ ـ رضى الله عنهما ـ قَالَ سَأَلَتْ أُمِّي أَبِي بَعْضَ الْمَوْهِبَةِ لِي مِنْ مَالِهِ، ثُمَّ بَدَا لَهُ فَوَهَبَهَا لِي فَقَالَتْ لاَ أَرْضَى حَتَّى تُشْهِدَ النَّبِيَّ صلى الله عليه وسلم‏.‏ فَأَخَذَ بِيَدِي وَأَنَا غُلاَمٌ، فَأَتَى بِيَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ إِنَّ أُمَّهُ بِنْتَ رَوَاحَةَ سَأَلَتْنِي بَعْضَ الْمَوْهِبَةِ لِهَذَا، قَالَ ‏\"‏ أَلَكَ وَلَدٌ سِوَاهُ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ فَأُرَاهُ قَالَ ‏\"‏ لاَ تُشْهِدْنِي عَلَى جَوْرٍ ‏\"‏‏.‏ وَقَالَ أَبُو حَرِيزٍ عَنِ الشَّعْبِيِّ ‏\"‏ لاَ أَشْهَدُ عَلَى جَوْرٍ ‏\"‏‏.‏"
      },
      {
        "id": 2535,
        "hadith_number": "2651",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keutamaan Generasi Sahabat Nabi dan Umat Islam Kemudiannya",
        "perawi_melayu": "Dikisahkan oleh `Imran bin Husain رضي الله عنه",
        "english_text": "\"The Prophet (ﷺ) said, 'The best people are those living in my generation, then those coming after them, and then those coming after (the second generation).\" `Imran said \"I do not know whether the Prophet (ﷺ) mentioned two or three generations after your present generation. The Prophet (ﷺ) added, 'There will be some people after you, who will be dishonest and will not be trustworthy and will give witness (evidences) without being asked to give witness, and will vow but will not fulfill their vows, and obesity will appear among them.\"",
        "malay_translation": "Nabi saw bersabda, ‘Sebaik-baik manusia ialah mereka yang hidup pada zaman saya, kemudian yang datang selepas mereka, dan kemudian yang datang selepas (generasi kedua).’ `Imran berkata, “Saya tidak pasti sama ada Nabi saw menyebut dua atau tiga generasi selepas generasi kamu sekarang. Nabi saw menambah, ‘Akan ada beberapa orang selepas kamu yang tidak jujur, tidak dipercayai, dan akan memberikan kesaksian (bukti) tanpa diminta, dan akan bersumpah tetapi tidak menunaikan sumpah mereka, dan kegemukan akan muncul di antara mereka.’”",
        "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا أَبُو جَمْرَةَ، قَالَ سَمِعْتُ زَهْدَمَ بْنَ مُضَرِّبٍ، قَالَ سَمِعْتُ عِمْرَانَ بْنَ حُصَيْنٍ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ خَيْرُكُمْ قَرْنِي، ثُمَّ الَّذِينَ يَلُونَهُمْ، ثُمَّ الَّذِينَ يَلُونَهُمْ ‏\"‏‏.‏ قَالَ عِمْرَانُ لاَ أَدْرِي أَذَكَرَ النَّبِيُّ صلى الله عليه وسلم بَعْدُ قَرْنَيْنِ أَوْ ثَلاَثَةً‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ بَعْدَكُمْ قَوْمًا يَخُونُونَ وَلاَ يُؤْتَمَنُونَ، وَيَشْهَدُونَ، وَلاَ يُسْتَشْهَدُونَ وَيَنْذِرُونَ وَلاَ يَفُونَ، وَيَظْهَرُ فِيهِمُ السِّمَنُ ‏\"‏‏.‏"
      },
      {
        "id": 2536,
        "hadith_number": "2652",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keunggulan Generasi Sahabat dan Generasi Selepasnya",
        "perawi_melayu": "Dikisahkan oleh `Abdullah رضی اللہ عنہ",
        "english_text": "The Prophet (ﷺ) said, \"The people of my generation are the best, then those who follow them, and then those who follow the latter. After that there will come some people whose witness will go ahead of their oaths, and their oaths will go ahead of their witness.\" Ibrahim (a sub-narrator) said, \"We used to be beaten for taking oaths by saying, 'I bear witness by the Name of Allah or by the Covenant of Allah.\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Generasi saya adalah yang terbaik, kemudian mereka yang mengikuti mereka, dan kemudian mereka yang mengikuti yang terakhir. Setelah itu, akan datang beberapa orang di mana kesaksian mereka mendahului sumpah mereka, dan sumpah mereka mendahului kesaksian mereka.\" Ibrahim (seorang perawi tambahan) berkata, \"Kami dahulu dipukul kerana bersumpah dengan mengatakan, 'Aku bersaksi dengan nama Allah atau dengan perjanjian Allah.'\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَبِيدَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ خَيْرُ النَّاسِ قَرْنِي، ثُمَّ الَّذِينَ يَلُونَهُمْ، ثُمَّ الَّذِينَ يَلُونَهُمْ، ثُمَّ يَجِيءُ أَقْوَامٌ تَسْبِقُ شَهَادَةُ أَحَدِهِمْ يَمِينَهُ، وَيَمِينُهُ شَهَادَتَهُ ‏\"‏‏.‏ قَالَ إِبْرَاهِيمُ وَكَانُوا يَضْرِبُونَنَا عَلَى الشَّهَادَةِ وَالْعَهْدِ‏.‏"
      },
      {
        "id": 2537,
        "hadith_number": "2653",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Dosa-dosa Besar",
        "perawi_melayu": "Dikisahkan oleh Anas r.a.",
        "english_text": "The Prophet (ﷺ) was asked about the great sins He said, \"They are:-- (1 ) To join others in worship with Allah, (2) To be undutiful to one's parents. (3) To kill a person (which Allah has forbidden to kill) (i.e. to commit the crime of murdering). (4) And to give a false witness.\" Asbagh corroborated him from Ibn-e-Wahab, Younun and Ibn-e-Shihab.",
        "malay_translation": "Nabi SAW ditanya tentang dosa-dosa besar. Baginda menjawab, \"Mereka adalah: (1) Syirik, (2) Durhaka kepada ibu bapa, (3) Membunuh nyawa manusia (yang Allah haramkan) (iaitu melakukan jenayah pembunuhan), dan (4) Memberi kesaksian palsu.\"  Asbagh menguatkan perkataan baginda daripada Ibn-e-Wahab, Younun dan Ibn-e-Shihab.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُنِيرٍ، سَمِعَ وَهْبَ بْنَ جَرِيرٍ، وَعَبْدَ الْمَلِكِ بْنَ إِبْرَاهِيمَ، قَالاَ حَدَّثَنَا شُعْبَةُ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ أَنَسٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ سُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنِ الْكَبَائِرِ قَالَ ‏ \"‏ الإِشْرَاكُ بِاللَّهِ، وَعُقُوقُ الْوَالِدَيْنِ، وَقَتْلُ النَّفْسِ، وَشَهَادَةُ الزُّورِ ‏\"‏‏.‏ تَابَعَهُ غُنْدَرٌ وَأَبُو عَامِرٍ وَبَهْزٌ وَعَبْدُ الصَّمَدِ عَنْ شُعْبَةَ‏.‏"
      },
      {
        "id": 2538,
        "hadith_number": "2654",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Dosa Besar dan Sumpah Palsu",
        "perawi_melayu": "Daripada Abu Bakarah",
        "english_text": "The Prophet (ﷺ) said thrice, \"Should I inform you out the greatest of the great sins?\" They said, \"Yes, O Allah's Messenger (ﷺ)!\" He said, \"To join others in worship with Allah and to be undutiful to one's parents.\" The Prophet (ﷺ) then sat up after he had been reclining (on a pillow) and said, \"And I warn you against giving a false witness, and he kept on saying that warning till we thought he would not stop. (See Hadith No. 7, Vol. 8). Ismaeel bin Ibrahim, Jurairi reported from Abdur Rehman the same.",
        "malay_translation": "Nabi (ﷺ) telah bersabda sebanyak tiga kali, \"Adakah aku hendak memberitahu kamu dosa terbesar yang paling besar?\" Mereka menjawab, \"Ya, wahai Rasulullah (ﷺ)!\" Baginda bersabda, \"Menyekutukan Allah dan durhaka kepada kedua ibu bapa.\" Kemudian Nabi (ﷺ) bangun tegak setelah bersandar (di atas bantal) dan bersabda, \"Dan aku memberi amaran kepada kamu tentang memberikan kesaksian palsu, dan baginda terus mengulangi amaran itu sehingga kami berasa seolah-olah baginda tidak akan berhenti. (Rujuk Hadis No. 7, Jilid 8). Ismaeel bin Ibrahim, Jurairi meriwayatkan daripada Abdur Rehman yang sama.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا الْجُرَيْرِيُّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَلاَ أُنَبِّئُكُمْ بِأَكْبَرِ الْكَبَائِرِ ‏\"‏‏.‏ ثَلاَثًا‏.‏ قَالُوا بَلَى يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ الإِشْرَاكُ بِاللَّهِ، وَعُقُوقُ الْوَالِدَيْنِ ‏\"‏‏.‏ وَجَلَسَ وَكَانَ مُتَّكِئًا فَقَالَ ‏\"‏ أَلاَ وَقَوْلُ الزُّورِ ‏\"‏‏.‏ قَالَ فَمَا زَالَ يُكَرِّرُهَا حَتَّى قُلْنَا لَيْتَهُ سَكَتَ‏.‏ وَقَالَ إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا الْجُرَيْرِيُّ حَدَّثَنَا عَبْدُ الرَّحْمَنِ‏.‏"
      },
      {
        "id": 2539,
        "hadith_number": "2655",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Mendengar Seorang Membaca Al-Quran di Masjid dan Mengingatkan Ayat yang Terlupa",
        "perawi_melayu": "Dikisahkan oleh 'Aisha r.a.",
        "english_text": "The Prophet (ﷺ) heard a man (reciting Qur'an) in the Mosque, and he said, \"May Allah bestow His Mercy upon him. No doubt, he made me remember such-and such Verses of such-and-such Sura which I dropped (from my memory). Narrated Aisha رضی اللہ عنہا : The Prophet (ﷺ) performed the Tahajjud prayer in my house, and then he heard the voice of `Abbad رضی اللہ عنہ who was praying in the Mosque, and said, \"O `Aisha! Is this `Abbad's voice?\" I said, \"Yes.\" He said, \"O Allah! Be merciful to `Abbad!\"",
        "malay_translation": "Nabi SAW mendengar seorang lelaki sedang membaca Al-Quran di masjid, lalu baginda bersabda, \"Semoga Allah merahmati dia. Tidak syak lagi, dia telah mengingatkan aku akan beberapa ayat surah tertentu yang aku lupakan.\" Dikisahkan oleh 'Aishah r.a.: Nabi SAW menunaikan solat tahajud di rumahku, kemudian baginda mendengar suara 'Abbad r.a. yang sedang berdoa di masjid, lalu baginda bertanya, \"Wahai 'Aishah, adakah suara 'Abbad ini?\" Aku menjawab, \"Ya.\" Baginda bersabda, \"Ya Allah, berilah rahmat kepada 'Abbad!\".",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ بْنِ مَيْمُونٍ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ سَمِعَ النَّبِيُّ صلى الله عليه وسلم رَجُلاً يَقْرَأُ فِي الْمَسْجِدِ فَقَالَ ‏\"‏ رَحِمَهُ اللَّهُ، لَقَدْ أَذْكَرَنِي كَذَا وَكَذَا آيَةً، أَسْقَطْتُهُنَّ مِنْ سُورَةِ كَذَا وَكَذَا ‏\"‏‏.‏ وَزَادَ عَبَّادُ بْنُ عَبْدِ اللَّهِ عَنْ عَائِشَةَ تَهَجَّدَ النَّبِيُّ صلى الله عليه وسلم فِي بَيْتِي فَسَمِعَ صَوْتَ عَبَّادٍ يُصَلِّي فِي الْمَسْجِدِ فَقَالَ ‏\"‏ يَا عَائِشَةُ، أَصَوْتُ عَبَّادٍ هَذَا ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ اللَّهُمَّ ارْحَمْ عَبَّادًا ‏\"‏‏.‏"
      },
      {
        "id": 2540,
        "hadith_number": "2656",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Waktu Makan dan Minum Sebelum Subuh",
        "perawi_melayu": "Diceritakan oleh Abdullah bin Umar",
        "english_text": "The Prophet (ﷺ) said, \"Bilal رضی اللہ عنہ pronounces the Adhan when it is still night (before dawn), so eat and drink till the next Adhan is pronounced (or till you hear Ibn Um Maktum's Adhan).\" Ibn Um Maktum رضی اللہ عنہ was a blind man who would not pronounce the Adhan till he was told that it was dawn.",
        "malay_translation": "Rasulullah SAW bersabda, \"Bilal mengumandangkan azan ketika masih malam (sebelum subuh), maka makan dan minumlah sehingga azan seterusnya diumandangkan (atau sehingga kamu mendengar azan Ibn Um Maktum).\" Ibn Um Maktum adalah seorang yang buta yang tidak akan mengumandangkan azan sehingga diberitahu bahawa waktu telah subuh.",
        "arabic_text": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ، أَخْبَرَنَا ابْنُ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّ بِلاَلاً يُؤَذِّنُ بِلَيْلٍ فَكُلُوا وَاشْرَبُوا حَتَّى يُؤَذِّنَ ـ أَوْ قَالَ حَتَّى تَسْمَعُوا ـ أَذَانَ ابْنِ أُمِّ مَكْتُومٍ ‏\"‏‏.‏ وَكَانَ ابْنُ أُمِّ مَكْتُومٍ رَجُلاً أَعْمَى، لاَ يُؤَذِّنُ حَتَّى يَقُولَ لَهُ النَّاسُ أَصْبَحْتَ‏.‏"
      },
      {
        "id": 2541,
        "hadith_number": "2657",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi (ﷺ) Memberikan Pakaian Kepada Bapa Pengcerita",
        "perawi_melayu": "Dikisahkan oleh Al-Miswar bin Makhrama",
        "english_text": "Some outer garments were received the Prophet (ﷺ) and my father (Makhrama) said to me, \"Let us go to the Prophet (ﷺ) so that he may give us something from the garments.\" So, my father stood at the door and spoke. The Prophet (ﷺ) recognized his voice and came out carrying a garment and telling Makhrama the good qualities of that garment, adding, \"I have kept this for you, I have sent this for you.\"",
        "malay_translation": "Beberapa pakaian luar telah diterima oleh Nabi (ﷺ). Bapa saya (Makhrama) berkata kepada saya, \"Mari kita pergi kepada Nabi (ﷺ) supaya baginda memberikan kita sesuatu daripada pakaian itu.\" Maka, bapa saya berdiri di pintu dan berkata-kata. Nabi (ﷺ) mengenali suaranya dan keluar membawa pakaian serta menceritakan kebaikan pakaian itu kepada Makhrama, sambil menambah, \"Aku telah menyimpan ini untukmu, Aku telah menghantar ini untukmu.\"",
        "arabic_text": "حَدَّثَنَا زِيَادُ بْنُ يَحْيَى، حَدَّثَنَا حَاتِمُ بْنُ وَرْدَانَ، حَدَّثَنَا أَيُّوبُ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ ـ رضى الله عنهما ـ قَالَ قَدِمَتْ عَلَى النَّبِيِّ صلى الله عليه وسلم أَقْبِيَةٌ فَقَالَ لِي أَبِي مَخْرَمَةُ انْطَلِقْ بِنَا إِلَيْهِ عَسَى أَنْ يُعْطِيَنَا مِنْهَا شَيْئًا‏.‏ فَقَامَ أَبِي عَلَى الْبَابِ فَتَكَلَّمَ، فَعَرَفَ النَّبِيُّ صلى الله عليه وسلم صَوْتَهُ فَخَرَجَ النَّبِيُّ صلى الله عليه وسلم وَمَعَهُ قَبَاءٌ وَهُوَ يُرِيهِ مَحَاسِنَهُ وَهُوَ يَقُولَ ‏ \"‏ خَبَأْتُ هَذَا لَكَ، خَبَأْتُ هَذَا لَكَ ‏\"‏‏.‏"
      },
      {
        "id": 2542,
        "hadith_number": "2658",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keadilan Saksi Wanita dan Kekurangan Daya Fikirannya",
        "perawi_melayu": "Dikisahkan oleh Abu Sa`id Al-Khudri",
        "english_text": "The Prophet (ﷺ) said, \"Isn't the witness of a woman equal to half of that of a man?\" The women said, \"Yes.\" He said, \"This is because of the deficiency of a woman's mind.\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Bukankah kesaksian seorang wanita setara dengan separuh kesaksian seorang lelaki?\" Para wanita menjawab, \"Ya.\" Baginda bersabda, \"Ini kerana kekurangan daya fikiran wanita.\"",
        "arabic_text": "حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ أَخْبَرَنِي زَيْدٌ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ أَلَيْسَ شَهَادَةُ الْمَرْأَةِ مِثْلَ نِصْفِ شَهَادَةِ الرَّجُلِ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ فَذَلِكَ مِنْ نُقْصَانِ عَقْلِهَا ‏\"‏‏.‏"
      },
      {
        "id": 2543,
        "hadith_number": "2659",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Perkahwinan dengan Wanita yang Mengaku Menyusukan Kedua Pasangan",
        "perawi_melayu": "Dikisahkan oleh `Uqba bin Al-Harith",
        "english_text": "That he had married Um Yahya bint Abu Ihab. He said. \"A black slave-lady came and said, 'I suckled you both.' I then mentioned that to the Prophet (ﷺ) who turned his face aside.\" `Uqba further said, \"I went to the other side and told the Prophet (ﷺ) about it. He said, 'How can you (keep her as your wife) when the lady has said that she suckled both of you (i.e. you and your wife?)\" So, the Prophet (ﷺ) ordered him to divorce her.",
        "malay_translation": "Bahwa beliau telah mengahwini Um Yahya binti Abu Ihab. Beliau berkata, \"Seorang wanita hamba sahaya berkulit hitam datang dan berkata, 'Aku menyusu kamu berdua.' Kemudian aku menceritakan hal ini kepada Nabi (ﷺ) yang lalu memalingkan wajahnya.\" `Uqba selanjutnya berkata, \"Aku pergi ke sisi lain dan menceritakan hal ini kepada Nabi (ﷺ). Beliau bersabda, 'Bagaimana kamu (dapat mempertahankan perkahwinan dengannya) sedangkan wanita itu telah mengatakan bahwa dia menyusu kamu berdua (yakni kamu dan isterimu)?' Maka, Nabi (ﷺ) memerintahkannya untuk menceraikannya.",
        "arabic_text": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عُقْبَةَ بْنِ الْحَارِثِ،‏.‏ وَحَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ سَمِعْتُ ابْنَ أَبِي مُلَيْكَةَ، قَالَ حَدَّثَنِي عُقْبَةُ بْنُ الْحَارِثِ، أَوْ سَمِعْتُهُ مِنْهُ، أَنَّهُ تَزَوَّجَ أُمَّ يَحْيَى بِنْتَ أَبِي إِهَابٍ قَالَ فَجَاءَتْ أَمَةٌ سَوْدَاءُ فَقَالَتْ قَدْ أَرْضَعْتُكُمَا‏.‏ فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَأَعْرَضَ عَنِّي، قَالَ فَتَنَحَّيْتُ فَذَكَرْتُ ذَلِكَ لَهُ قَالَ ‏ \"‏ وَكَيْفَ وَقَدْ زَعَمَتْ أَنْ قَدْ أَرْضَعَتْكُمَا ‏\"‏‏.‏ فَنَهَاهُ عَنْهَا‏.‏"
      },
      {
        "id": 2544,
        "hadith_number": "2660",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perceraian Jika Terdapat Hubungan Susuan",
        "perawi_melayu": "Dikisahkan oleh `Uqba bin Al-Harith",
        "english_text": "I married a woman and later on a woman came and said, \"I suckled you both.\" So, I went to the Prophet (to ask him about it). He said, \"How can you (keep her as a wife) when it has been said (that you were foster brother and sister)? Leave (divorce) her.",
        "malay_translation": "Saya mengahwini seorang wanita, dan kemudian datang seorang wanita yang berkata, \"Saya menyusu kamu berdua.\" Oleh itu, saya pergi kepada Nabi (untuk bertanya kepadanya tentang hal ini). Baginda bersabda, \"Bagaimana kamu boleh (terus mengahwininya) sedangkan sudah dikatakan (kamu adalah saudara susuan)? Ceraikanlah dia.",
        "arabic_text": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ عُمَرَ بْنِ سَعِيدٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عُقْبَةَ بْنِ الْحَارِثِ، قَالَ تَزَوَّجْتُ امْرَأَةً فَجَاءَتِ امْرَأَةٌ فَقَالَتْ إِنِّي قَدْ أَرْضَعْتُكُمَا‏.‏ فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ وَكَيْفَ وَقَدْ قِيلَ دَعْهَا عَنْكَ ‏\"‏ أَوْ نَحْوَهُ‏.‏"
      },
      {
        "id": 2545,
        "hadith_number": "2661",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Fitnah dan Pembelaan Siti Aisyah r.a.",
        "perawi_melayu": "Diceritakan oleh Siti Aisyah r.a (isteri Rasulullah SAW).",
        "english_text": "When the slanderer affixed calumny to her and Allah exonerated her from it. Zuhri says: Everyone narrates one part of the Hadith and some of them are blessed with more retaining power and are more trustworthy in narrating it and I have retained the Hadith narrated by everyone of them which they have reported from Hadrat Aishah رضی اللہ عنہا and their statements attest one and other's statement. The thought that Hadrat Aishah رضی اللہ عنہا said: \"Whenever Allah's Messenger (ﷺ) intended to go on a journey, he would draw lots amongst his wives and would take with him the one upon whom the lot fell. During a Ghazwa of his, he drew lots amongst us and the lot fell upon me, and I proceeded with him after Allah had decreed the use of the veil by women. I was carried in a Howdah (on the camel) and dismounted while still in it. When Allah's Messenger (ﷺ) was through with his Ghazwa and returned home, and we approached the city of Medina, Allah's Messenger (ﷺ) ordered us to proceed at night. When the order of setting off was given, I walked till I was past the army to answer the call of nature. After finishing I returned (to the camp) to depart (with the others) and suddenly realized that my necklace over my chest was missing. So, I returned to look for it and was delayed because of that. The people who used to carry me on the camel, came to my Howdah and put it on the back of the camel, thinking that I was in it, as, at that time, women were light in weight, and thin and lean, and did not use to eat much. So, those people did not feel the difference in the heaviness of the Howdah while lifting it, and they put it over the camel. At that time I was a young lady. They set the camel moving and proceeded on. I found my necklace after the army had gone, and came to their camp to find nobody. So, I went to the place where I used to stay, thinking that they would discover my absence and come back in my search. While in that state, I felt sleepy and slept. Safwan bin Mu'attal As-Sulami Adh-Dhakwani was behind the army and reached my abode in the morning. When he saw a sleeping person, he came to me, and he used to see me before veiling. So, I got up when I heard him saying, \"Inna lil-lah-wa inn a ilaihi rajiun (We are for Allah, and we will return to Him).\" He made his camel knell down. He got down from his camel, and put his leg on the front legs of the camel and then I rode and sat over it. Safwan set out walking, leading the camel by the rope till we reached the army who had halted to take rest at midday. Then whoever was meant for destruction, fell into destruction, (some people accused me falsely) and the leader of the false accusers was `Abdullah bin Ubai bin Salul. After that we returned to Medina, and I became ill for one month while the people were spreading the forged statements of the false accusers. I was feeling during my ailment as if I were not receiving the usual kindness from the Prophet (ﷺ) which I used to receive from him when I got sick. But he would come, greet and say, 'How is that (girl)?' I did not know anything of what was going on till I recovered from my ailment and went out with Um Mistah to the Manasi where we used to answer the call of nature, and we used not to go to answer the call of nature except from night to night and that was before we had lavatories near to our houses. And this habit of ours was similar to the habit of the old 'Arabs in the open country (or away from houses). So. I and Um Mistah bint Ruhm went out walking. Um Mistah stumbled because of her long dress and on that she said, 'Let Mistah be ruined.' I said, 'You are saying a bad word. Why are you abusing a man who took part in (the battle of) Badr?' She said, 'O Hanata (you there) didn't you hear what they said?' Then she told me the rumors of the false accusers. My sickness was aggravated, and when I returned home, Allah's Messenger (ﷺ) came to me, and after greeting he said, 'How is that (girl)?' I requested him to allow me to go to my parents. I wanted then to be sure of the news through them I Allah's Messenger (ﷺ) allowed me, and I went to my parents and asked my mother, 'What are the people talking about?' She said, 'O my daughter! Don't worry much about this matter. By Allah, never is there a charming woman loved by her husband who has other wives, but the women would forge false news about her.' I said, 'Glorified be Allah! Are the people really taking of this matter?' That night I kept on weeping and could not sleep till morning. In the morning Allah's Messenger (ﷺ) called `Ali bin Abu Talib and Usama bin Zaid when he saw the Divine Inspiration delayed, to consul them about divorcing his wife (i.e. `Aisyah). Usama bin Zaid said what he knew of the good reputation of his wives and added, 'O Allah's Messenger (ﷺ)! Keep you wife, for, by Allah, we know nothing about her but good.' `Ali bin Abu Talib said, 'O Allah's Messenger (ﷺ)! Allah has no imposed restrictions on you, and there are many women other than she, yet you may ask the woman-servant who will tell you the truth.' On that Allah's Messenger (ﷺ) called Buraira and said, 'O Burair. Did you ever see anything which roused your suspicions about her?' Buraira said, 'No, by Allah Who has sent you with the Truth, I have never seen in her anything faulty except that she is a girl of immature age, who sometimes sleeps and leaves the dough for the goats to eat.' On that day Allah's Messenger (ﷺ) ascended the pulpit and requested that somebody support him in punishing `Abdullah bin Ubai bin Salul. Allah's Apostle said, 'Who will support me to punish that person (`Abdullah bin Ubai bin Salul) who has hurt me by slandering the reputation of my family? By Allah, I know nothing about my family but good, and they have accused a person about whom I know nothing except good, and he never entered my house except in my company.' Sa`d bin Mu`adh got up and said, 'O Allah's Messenger (ﷺ)! by Allah, I will relieve you from him. If that man is from the tribe of the Aus, then we will chop his head off, and if he is from our brothers, the Khazraj, then order us, and we will fulfill your order.' On that Sa`d bin 'Ubada, the chief of the Khazraj and before this incident, he had been a pious man, got up, motivated by his zeal for his tribe and said, 'By Allah, you have told a lie; you cannot kill him, and you will never be able to kill him.' On that Usaid bin Al-Hadir got up and said (to Sa`d bin 'Ubada), 'By Allah! you are a liar. By Allah, we will kill him; and you are a hypocrite, defending the hypocrites.' On this the two tribes of Aus and Khazraj got excited and were about to fight each other, while Allah's Messenger (ﷺ) was standing on the pulpit. He got down and quieted them till they became silent and he kept quiet. On that day I kept on weeping so much so that neither did my tears stop, nor could I sleep. In the morning my parents were with me and I had wept for two nights and a day, till I thought my liver would burst from weeping. While they were sitting with me and I was weeping, an Ansari woman asked my permission to enter, and I allowed her to come in. She sat down and started weeping with me. While we were in this state, Allah's Messenger (ﷺ) came and sat down and he had never sat with me since the day they forged the accusation. No revelation regarding my case came to him for a month. He recited Tashah-hud (i.e. None has the right to be worshipped but Allah and Muhammad is His Apostle) and then said, 'O `Aisha! I have been informed such-and-such about you; if you are innocent, then Allah will soon reveal your innocence, and if you have committed a sin, then repent to Allah and ask Him to forgive you, for when a person confesses his sin and asks Allah for forgiveness, Allah accepts his repentance.' When Allah's Messenger (ﷺ) finished his speech my tears ceased completely and there remained not even a single drop of it. I requested my father to reply to Allah's Messenger (ﷺ) on my behalf. My father said, By Allah, I do not know what to say to Allah's Messenger (ﷺ).' I said to my mother, 'Talk to Allah's Messenger (ﷺ) on my behalf.' She said, 'By Allah, I do not know what to say to Allah's Apostle. I was a young girl and did not have much knowledge of the Qur'an. I said. 'I know, by Allah, that you have listened to what people are saying and that has been planted in your minds and you have taken it as a truth. Now, if I told you that I am innocent and Allah knows that I am innocent, you would not believe me and if I confessed to you falsely that I am guilty, and Allah knows that I am innocent you would believe me. By Allah, I don't compare my situation with you except to the situation of Joseph's father (i.e. Jacob) who said, 'So (for me) patience is most fitting against that which you assert and it is Allah (Alone) whose help can be sought.' Then I turned to the other side of my bed hoping that Allah would prove my innocence. By Allah I never thought that Allah would reveal Divine Inspiration in my case, as I considered myself too inferior to be talked of in the Holy Qur'an. I had hoped that Allah's Messenger (ﷺ) might have a dream in which Allah would prove my innocence. By Allah, Allah's Apostle had not got up and nobody had left the house before the Divine Inspiration came to Allah's Apostle. So, there overtook him the same state which used to overtake him, (when he used to have, on being inspired divinely). He was sweating so much so that the drops of the sweat were dropping like pearls though it was a (cold) wintry day. When that state of Allah's Messenger (ﷺ) was over, he was smiling and the first word he said, `Aisha! Thank Allah, for Allah has declared your innocence.' My mother told me to go to Allah's Messenger (ﷺ) . I replied, 'By Allah I will not go to him and will not thank but Allah.' So Allah revealed: \"Verily! They who spread the slander are a gang among you . . .\" (24.11) When Allah gave the declaration of my Innocence, Abu Bakr, who used to provide for Mistah bin Uthatha for he was his relative, said, 'By Allah, I will never provide Mistah with anything because of what he said about Aisha.' But Allah later revealed: -- \"And let not those who are good and wealthy among you swear not to help their kinsmen, those in need and those who left their homes in Allah's Cause. Let them forgive and overlook. Do you not wish that Allah should forgive you? Verily! Allah is Oft-forgiving, Most Merciful.\" (24.22) After that Abu Bakr رضی اللہ عنہ said, 'Yes ! By Allah! I like that Allah should forgive me,' and resumed helping Mistah whom he used to help before. Allah's Messenger (ﷺ) also asked Zainab bint Jahsh رضی اللہ عنہا (i.e. the Prophet's wife about me saying, 'What do you know and what did you see?' She replied, 'O Allah's Messenger (ﷺ)! I refrain to claim hearing or seeing what I have not heard or seen. By Allah, I know nothing except goodness about Aisha رضی اللہ عنہا .\" Aisha رضی اللہ عنہا further added \"Zainab was competing with me (in her beauty and the Prophet's love), yet Allah protected her (from being malicious), for she had piety.\" Hisham bin Urwah from Hadrat Aishah رضی اللہ عنہا and Abdullah bin Zubair رضی اللہ عنہم has repoted likewise. Folaih, Rabiah bin Abu Abdur Rehman and Yahya bin Saeed has reported from Qasim bin MUhammad bin Abu Bakr in the same way.",
        "malay_translation": "Kisah ini menceritakan tentang fitnah yang menimpa Siti Aisyah r.a. dan bagaimana Allah SWT membersihkan nama baik baginda.  Zuhri meriwayatkan bahawa setiap perawi meriwayatkan sebahagian hadis dan ada di antara mereka yang lebih kuat hafalan dan lebih terpercaya dalam meriwayatkannya.  Hadis ini telah dikumpulkan daripada perawi-perawi tersebut yang meriwayatkannya daripada Hadrat Aisyah r.a. dan perkataan mereka saling mengesahkan antara satu sama lain.  Kisah ini memaparkan bagaimana pada suatu perjalanan, Rasulullah SAW  mendapatkan Aisyah r.a. melalui undian.  Peristiwa yang melibatkan penggunaan kenderaan unta (Howdah) dan  penemuan barang kemas Aisyah r.a., dan bagaimana fitnah terhadap Aisyah r.a. menyebar, dan bagaimana Rasulullah SAW menyelesaikan konflik tersebut menerusi pandangan para sahabat, dan akhirnya wahyu Allah SWT datang membersihkan nama baik Aisyah r.a.",
        "arabic_text": "حَدَّثَنَا أَبُو الرَّبِيعِ، سُلَيْمَانُ بْنُ دَاوُدَ وَأَفْهَمَنِي بَعْضَهُ أَحْمَدُ حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، عَنِ ابْنِ شِهَابٍ الزُّهْرِيِّ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، وَسَعِيدِ بْنِ الْمُسَيَّبِ، وَعَلْقَمَةَ بْنِ وَقَّاصٍ اللَّيْثِيِّ، وَعُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم حِينَ قَالَ لَهَا أَهْلُ الإِفْكِ مَا قَالُوا، فَبَرَّأَهَا اللَّهُ مِنْهُ، قَالَ الزُّهْرِيُّ، وَكُلُّهُمْ حَدَّثَنِي طَائِفَةً مِنْ حَدِيثِهَا وَبَعْضُهُمْ أَوْعَى مِنْ بَعْضٍ، وَأَثْبَتُ لَهُ اقْتِصَاصًا، وَقَدْ وَعَيْتُ عَنْ كُلِّ وَاحِدٍ مِنْهُمُ الْحَدِيثَ الَّذِي حَدَّثَنِي عَنْ عَائِشَةَ، وَبَعْضُ حَدِيثِهِمْ يُصَدِّقُ بَعْضًا‏.‏ زَعَمُوا أَنَّ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَرَادَ أَنْ يَخْرُجَ سَفَرًا أَقْرَعَ بَيْنَ أَزْوَاجِهِ، فَأَيَّتُهُنَّ خَرَجَ سَهْمُهَا خَرَجَ بِهَا مَعَهُ، فَأَقْرَعَ بَيْنَنَا فِي غَزَاةٍ غَزَاهَا فَخَرَجَ سَهْمِي، فَخَرَجْتُ مَعَهُ بَعْدَ مَا أُنْزِلَ الْحِجَابُ، فَأَنَا أُحْمَلُ فِي هَوْدَجٍ وَأُنْزَلُ فِيهِ، فَسِرْنَا حَتَّى إِذَا فَرَغَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ غَزْوَتِهِ تِلْكَ، وَقَفَلَ وَدَنَوْنَا مِنَ الْمَدِينَةِ، آذَنَ لَيْلَةً بِالرَّحِيلِ، فَقُمْتُ حِينَ آذَنُوا بِالرَّحِيلِ، فَمَشَيْتُ حَتَّى جَاوَزْتُ الْجَيْشَ، فَلَمَّا قَضَيْتُ شَأْنِي أَقْبَلْتُ إِلَى الرَّحْلِ، فَلَمَسْتُ صَدْرِي، فَإِذَا عِقْدٌ لِي مِنْ جَزْعِ أَظْفَارٍ قَدِ انْقَطَعَ، فَرَجَعْتُ فَالْتَمَسْتُ عِقْدِي، فَحَبَسَنِي ابْتِغَاؤُهُ، فَأَقْبَلَ الَّذِينَ يَرْحَلُونَ لِي، فَاحْتَمَلُوا هَوْدَجِي فَرَحَلُوهُ عَلَى بَعِيرِي الَّذِي كُنْتُ أَرْكَبُ، وَهُمْ يَحْسِبُونَ أَنِّي فِيهِ، وَكَانَ النِّسَاءُ إِذْ ذَاكَ خِفَافًا لَمْ يَثْقُلْنَ وَلَمْ يَغْشَهُنَّ اللَّحْمُ، وَإِنَّمَا يَأْكُلْنَ الْعُلْقَةَ مِنَ الطَّعَامِ، فَلَمْ يَسْتَنْكِرِ الْقَوْمُ حِينَ رَفَعُوهُ ثِقَلَ الْهَوْدَجِ فَاحْتَمَلُوهُ وَكُنْتُ جَارِيَةً حَدِيثَةَ السِّنِّ، فَبَعَثُوا الْجَمَلَ وَسَارُوا، فَوَجَدْتُ عِقْدِي بَعْدَ مَا اسْتَمَرَّ الْجَيْشُ، فَجِئْتُ مَنْزِلَهُمْ وَلَيْسَ فِيهِ أَحَدٌ، فَأَمَمْتُ مَنْزِلِي الَّذِي كُنْتُ بِهِ فَظَنَنْتُ أَنَّهُمْ سَيَفْقِدُونِي فَيَرْجِعُونَ إِلَىَّ، فَبَيْنَا أَنَا جَالِسَةٌ غَلَبَتْنِي عَيْنَاىَ فَنِمْتُ، وَكَانَ صَفْوَانُ بْنُ الْمُعَطَّلِ السُّلَمِيُّ ثُمَّ الذَّكْوَانِيُّ مِنْ وَرَاءِ الْجَيْشِ، فَأَصْبَحَ عِنْدَ مَنْزِلِي فَرَأَى سَوَادَ إِنْسَانٍ نَائِمٍ فَأَتَانِي، وَكَانَ يَرَانِي قَبْلَ الْحِجَابِ فَاسْتَيْقَظْتُ بِاسْتِرْجَاعِهِ حِينَ أَنَاخَ رَاحِلَتَهُ، فَوَطِئَ يَدَهَا فَرَكِبْتُهَا فَانْطَلَقَ يَقُودُ بِي الرَّاحِلَةَ، حَتَّى أَتَيْنَا الْجَيْشَ بَعْدَ مَا نَزَلُوا مُعَرِّسِينَ فِي نَحْرِ الظَّهِيرَةِ، فَهَلَكَ مَنْ هَلَكَ، وَكَانَ الَّذِي تَوَلَّى الإِفْكَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ ابْنُ سَلُولَ، فَقَدِمْنَا الْمَدِينَةَ فَاشْتَكَيْتُ بِهَا شَهْرًا، يُفِيضُونَ مِنْ قَوْلِ أَصْحَابِ الإِفْكِ، وَيَرِيبُنِي فِي وَجَعِي أَنِّي لاَ أَرَى مِنَ النَّبِيِّ صلى الله عليه وسلم اللُّطْفَ الَّذِي كُنْتُ أَرَى مِنْهُ حِينَ أَمْرَضُ، إِنَّمَا يَدْخُلُ فَيُسَلِّمُ ثُمَّ يَقُولُ ‏\"‏ كَيْفَ تِيكُمْ ‏\"‏‏.‏ لاَ أَشْعُرُ بِشَىْءٍ مِنْ ذَلِكَ حَتَّى نَقَهْتُ، فَخَرَجْتُ أَنَا وَأُمُّ مِسْطَحٍ قِبَلَ الْمَنَاصِعِ مُتَبَرَّزُنَا، لاَ نَخْرُجُ إِلاَّ لَيْلاً إِلَى لَيْلٍ، وَذَلِكَ قَبْلَ أَنْ نَتَّخِذَ الْكُنُفَ قَرِيبًا مِنْ بُيُوتِنَا، وَأَمْرُنَا أَمْرُ الْعَرَبِ الأُوَلِ فِي الْبَرِّيَّةِ أَوْ فِي التَّنَزُّهِ، فَأَقْبَلْتُ أَنَا وَأُمُّ مِسْطَحٍ بِنْتُ أَبِي رُهْمٍ نَمْشِي، فَعَثُرَتْ فِي مِرْطِهَا فَقَالَتْ تَعِسَ مِسْطَحٌ، فَقُلْتُ لَهَا بِئْسَ مَا قُلْتِ، أَتَسُبِّينَ رَجُلاً شَهِدَ بَدْرًا فَقَالَتْ يَا هَنْتَاهْ أَلَمْ تَسْمَعِي مَا قَالُوا فَأَخْبَرَتْنِي بِقَوْلِ أَهْلِ الإِفْكِ، فَازْدَدْتُ مَرَضًا إِلَى مَرَضِي، فَلَمَّا رَجَعْتُ إِلَى بَيْتِي دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَلَّمَ فَقَالَ ‏\"‏ كَيْفَ تِيكُمْ ‏\"‏‏.‏ فَقُلْتُ ائْذَنْ لِي إِلَى أَبَوَىَّ‏.‏ قَالَتْ وَأَنَا حِينَئِذٍ أُرِيدُ أَنْ أَسْتَيْقِنَ الْخَبَرَ مِنْ قِبَلِهِمَا، فَأَذِنَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَتَيْتُ أَبَوَىَّ فَقُلْتُ لأُمِّي مَا يَتَحَدَّثُ بِهِ النَّاسُ فَقَالَتْ يَا بُنَيَّةُ هَوِّنِي عَلَى نَفْسِكِ الشَّأْنَ، فَوَاللَّهِ لَقَلَّمَا كَانَتِ امْرَأَةٌ قَطُّ وَضِيئَةٌ عِنْدَ رَجُلٍ يُحِبُّهَا وَلَهَا ضَرَائِرُ إِلاَّ أَكْثَرْنَ عَلَيْهَا‏.‏ فَقُلْتُ سُبْحَانَ اللَّهِ وَلَقَدْ يَتَحَدَّثُ النَّاسُ بِهَذَا قَالَتْ فَبِتُّ تِلْكَ اللَّيْلَةَ حَتَّى أَصْبَحْتُ لاَ يَرْقَأُ لِي دَمْعٌ وَلاَ أَكْتَحِلُ بِنَوْمٍ، ثُمَّ أَصْبَحْتُ فَدَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَلِيَّ بْنَ أَبِي طَالِبٍ وَأُسَامَةَ بْنَ زَيْدٍ حِينَ اسْتَلْبَثَ الْوَحْىُ، يَسْتَشِيرُهُمَا فِي فِرَاقِ أَهْلِهِ، فَأَمَّا أُسَامَةُ فَأَشَارَ عَلَيْهِ بِالَّذِي يَعْلَمُ فِي نَفْسِهِ مِنَ الْوُدِّ لَهُمْ، فَقَالَ أُسَامَةُ أَهْلُكَ يَا رَسُولَ اللَّهِ وَلاَ نَعْلَمُ وَاللَّهِ إِلاَّ خَيْرًا، وَأَمَّا عَلِيُّ بْنُ أَبِي طَالِبٍ فَقَالَ يَا رَسُولَ اللَّهِ لَمْ يُضَيِّقِ اللَّهُ عَلَيْكَ وَالنِّسَاءُ سِوَاهَا كَثِيرٌ، وَسَلِ الْجَارِيَةَ تَصْدُقْكَ‏.‏ فَدَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم بَرِيرَةَ فَقَالَ ‏\"‏ يَا بَرِيرَةُ هَلْ رَأَيْتِ فِيهَا شَيْئًا يَرِيبُكِ ‏\"‏‏.‏ فَقَالَتْ بَرِيرَةُ لاَ وَالَّذِي بَعَثَكَ بِالْحَقِّ، إِنْ رَأَيْتُ مِنْهَا أَمْرًا أَغْمِصُهُ عَلَيْهَا أَكْثَرَ مِنْ أَنَّهَا جَارِيَةٌ حَدِيثَةُ السِّنِّ تَنَامُ عَنِ الْعَجِينَ فَتَأْتِي الدَّاجِنُ فَتَأْكُلُهُ‏.‏ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ يَوْمِهِ، فَاسْتَعْذَرَ مِنْ عَبْدِ اللَّهِ بْنِ أُبَىٍّ ابْنِ سَلُولَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ يَعْذِرُنِي مِنْ رَجُلٍ بَلَغَنِي أَذَاهُ فِي أَهْلِي، فَوَاللَّهِ مَا عَلِمْتُ عَلَى أَهْلِي إِلاَّ خَيْرًا، وَقَدْ ذَكَرُوا رَجُلاً مَا عَلِمْتُ عَلَيْهِ إِلاَّ خَيْرًا، وَمَا كَانَ يَدْخُلُ عَلَى أَهْلِي إِلاَّ مَعِي ‏\"‏‏.‏ فَقَامَ سَعْدُ بْنُ مُعَاذٍ فَقَالَ يَا رَسُولَ اللَّهِ أَنَا وَاللَّهِ أَعْذِرُكَ مِنْهُ، إِنْ كَانَ مِنَ الأَوْسِ ضَرَبْنَا عُنُقَهُ، وَإِنْ كَانَ مِنْ إِخْوَانِنَا مِنَ الْخَزْرَجِ أَمَرْتَنَا فَفَعَلْنَا فِيهِ أَمْرَكَ‏.‏ فَقَامَ سَعْدُ بْنُ عُبَادَةَ وَهُوَ سَيِّدُ الْخَزْرَجِ، وَكَانَ قَبْلَ ذَلِكَ رَجُلاً صَالِحًا وَلَكِنِ احْتَمَلَتْهُ الْحَمِيَّةُ فَقَالَ كَذَبْتَ لَعَمْرُ اللَّهِ، لاَ تَقْتُلُهُ وَلاَ تَقْدِرُ عَلَى ذَلِكَ، فَقَامَ أُسَيْدُ بْنُ الْحُضَيْرِ فَقَالَ كَذَبْتَ لَعَمْرُ اللَّهِ، وَاللَّهِ لَنَقْتُلَنَّهُ، فَإِنَّكَ مُنَافِقٌ تُجَادِلُ عَنِ الْمُنَافِقِينَ‏.‏ فَثَارَ الْحَيَّانِ الأَوْسُ وَالْخَزْرَجُ حَتَّى هَمُّوا، وَرَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الْمِنْبَرِ فَنَزَلَ فَخَفَّضَهُمْ حَتَّى سَكَتُوا وَسَكَتَ، وَبَكَيْتُ يَوْمِي لاَ يَرْقَأُ لِي دَمْعٌ وَلاَ أَكْتَحِلُ بِنَوْمٍ، فَأَصْبَحَ عِنْدِي أَبَوَاىَ، قَدْ بَكَيْتُ لَيْلَتَيْنِ وَيَوْمًا حَتَّى أَظُنُّ أَنَّ الْبُكَاءَ فَالِقٌ كَبِدِي ـ قَالَتْ ـ فَبَيْنَا هُمَا جَالِسَانِ عِنْدِي وَأَنَا أَبْكِي إِذِ اسْتَأْذَنَتِ امْرَأَةٌ مِنَ الأَنْصَارِ فَأَذِنْتُ لَهَا، فَجَلَسَتْ تَبْكِي مَعِي، فَبَيْنَا نَحْنُ كَذَلِكَ إِذْ دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَجَلَسَ، وَلَمْ يَجْلِسْ عِنْدِي مِنْ يَوْمِ قِيلَ فِيَّ مَا قِيلَ قَبْلَهَا، وَقَدْ مَكُثَ شَهْرًا لاَ يُوحَى إِلَيْهِ فِي شَأْنِي شَىْءٌ ـ قَالَتْ ـ فَتَشَهَّدَ ثُمَّ قَالَ ‏\"‏ يَا عَائِشَةُ فَإِنَّهُ بَلَغَنِي عَنْكِ كَذَا وَكَذَا، فَإِنْ كُنْتِ بَرِيئَةً فَسَيُبَرِّئُكِ اللَّهُ، وَإِنْ كُنْتِ أَلْمَمْتِ فَاسْتَغْفِرِي اللَّهَ وَتُوبِي إِلَيْهِ، فَإِنَّ الْعَبْدَ إِذَا اعْتَرَفَ بِذَنْبِهِ ثُمَّ تَابَ تَابَ اللَّهُ عَلَيْهِ ‏\"‏‏.‏ فَلَمَّا قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم مَقَالَتَهُ قَلَصَ دَمْعِي حَتَّى مَا أُحِسُّ مِنْهُ قَطْرَةً وَقُلْتُ لأَبِي أَجِبْ عَنِّي رَسُولَ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَ وَاللَّهِ مَا أَدْرِي مَا أَقُولُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَقُلْتُ لأُمِّي أَجِيبِي عَنِّي رَسُولَ اللَّهِ صلى الله عليه وسلم فِيمَا قَالَ‏.‏ قَالَتْ وَاللَّهِ مَا أَدْرِي مَا أَقُولُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَتْ وَأَنَا جَارِيَةٌ حَدِيثَةُ السِّنِّ لاَ أَقْرَأُ كَثِيرًا مِنَ الْقُرْآنِ فَقُلْتُ إِنِّي وَاللَّهِ لَقَدْ عَلِمْتُ أَنَّكُمْ سَمِعْتُمْ مَا يَتَحَدَّثُ بِهِ النَّاسُ، وَوَقَرَ فِي أَنْفُسِكُمْ وَصَدَّقْتُمْ بِهِ، وَلَئِنْ قُلْتُ لَكُمْ إِنِّي بَرِيئَةٌ‏.‏ وَاللَّهُ يَعْلَمُ إِنِّي لَبَرِيئَةٌ لاَ تُصَدِّقُونِي بِذَلِكَ، وَلَئِنِ اعْتَرَفْتُ لَكُمْ بِأَمْرٍ، وَاللَّهُ يَعْلَمُ أَنِّي بَرِيئَةٌ لَتُصَدِّقُنِّي وَاللَّهِ مَا أَجِدُ لِي وَلَكُمْ مَثَلاً إِلاَّ أَبَا يُوسُفَ إِذْ قَالَ ‏{‏فَصَبْرٌ جَمِيلٌ وَاللَّهُ الْمُسْتَعَانُ عَلَى مَا تَصِفُونَ‏}‏ ثُمَّ تَحَوَّلْتُ عَلَى فِرَاشِي، وَأَنَا أَرْجُو أَنْ يُبَرِّئَنِي اللَّهُ، وَلَكِنْ وَاللَّهِ مَا ظَنَنْتُ أَنْ يُنْزِلَ فِي شَأْنِي وَحْيًا، وَلأَنَا أَحْقَرُ فِي نَفْسِي مِنْ أَنْ يُتَكَلَّمَ بِالْقُرْآنِ فِي أَمْرِي، وَلَكِنِّي كُنْتُ أَرْجُو أَنْ يَرَى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي النَّوْمِ رُؤْيَا يُبَرِّئُنِي اللَّهُ، فَوَاللَّهِ مَا رَامَ مَجْلِسَهُ وَلاَ خَرَجَ أَحَدٌ مِنْ أَهْلِ الْبَيْتِ حَتَّى أُنْزِلَ عَلَيْهِ، فَأَخَذَهُ مَا كَانَ يَأْخُذُهُ مِنَ الْبُرَحَاءِ، حَتَّى إِنَّهُ لَيَتَحَدَّرُ مِنْهُ مِثْلُ الْجُمَانِ مِنَ الْعَرَقِ فِي يَوْمٍ شَاتٍ، فَلَمَّا سُرِّيَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ يَضْحَكُ، فَكَانَ أَوَّلَ كَلِمَةٍ تَكَلَّمَ بِهَا أَنْ قَالَ لِي ‏\"‏ يَا عَائِشَةُ، احْمَدِي اللَّهَ فَقَدْ بَرَّأَكِ اللَّهُ ‏\"‏‏.‏ فَقَالَتْ لِي أُمِّي قُومِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَقُلْتُ لاَ وَاللَّهِ، لاَ أَقُومُ إِلَيْهِ، وَلاَ أَحْمَدُ إِلاَّ اللَّهَ فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏إِنَّ الَّذِينَ جَاءُوا بِالإِفْكِ عُصْبَةٌ مِنْكُمْ‏}‏ الآيَاتِ، فَلَمَّا أَنْزَلَ اللَّهُ هَذَا فِي بَرَاءَتِي قَالَ أَبُو بَكْرٍ الصِّدِّيقُ ـ رضى الله عنه ـ وَكَانَ يُنْفِقُ عَلَى مِسْطَحِ بْنِ أُثَاثَةَ لِقَرَابَتِهِ مِنْهُ وَاللَّهِ لاَ أُنْفِقُ عَلَى مِسْطَحٍ شَيْئًا أَبَدًا بَعْدَ مَا قَالَ لِعَائِشَةَ‏.‏ فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏وَلاَ يَأْتَلِ أُولُو الْفَضْلِ مِنْكُمْ وَالسَّعَةِ‏}‏ إِلَى قَوْلِهِ ‏{‏غَفُورٌ رَحِيمٌ‏}‏ فَقَالَ أَبُو بَكْرٍ بَلَى، وَاللَّهِ إِنِّي لأُحِبُّ أَنْ يَغْفِرَ اللَّهُ لِي، فَرَجَعَ إِلَى مِسْطَحٍ الَّذِي كَانَ يُجْرِي عَلَيْهِ‏.‏ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَسْأَلُ زَيْنَبَ بِنْتَ جَحْشٍ عَنْ أَمْرِي، فَقَالَ ‏\"‏ يَا زَيْنَبُ، مَا عَلِمْتِ مَا رَأَيْتِ ‏\"‏‏.‏ فَقَالَتْ يَا رَسُولَ اللَّهِ، أَحْمِي سَمْعِي وَبَصَرِي، وَاللَّهِ مَا عَلِمْتُ عَلَيْهَا إِلاَّ خَيْرًا، قَالَتْ وَهْىَ الَّتِي كَانَتْ تُسَامِينِي، فَعَصَمَهَا اللَّهُ بِالْوَرَعِ‏.‏ قَالَ وَحَدَّثَنَا فُلَيْحٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، وَعَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، مِثْلَهُ‏.‏ قَالَ وَحَدَّثَنَا فُلَيْحٌ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، وَيَحْيَى بْنِ سَعِيدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدِ بْنِ أَبِي بَكْرٍ، مِثْلَهُ‏.‏"
      },
      {
        "id": 2546,
        "hadith_number": "2662",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Memberi Pujian Berlebih-lebihan Kepada Seseorang",
        "perawi_melayu": "Dikisahkan oleh Abu Bakar:",
        "english_text": "A man praised another man in front of the Prophet (ﷺ) . The Prophet (ﷺ) said to him, \"Woe to you, you have cut off your companion's neck, you have cut off your companion's neck,\" repeating it several times and then added, \"Whoever amongst you has to praise his brother should say, 'I think that he is so and so, and Allah knows exactly the truth, and I do not confirm anybody's good conduct before Allah, but I think him so and so,' if he really knows what he says about him.\"",
        "malay_translation": "Seorang lelaki memuji seorang lelaki lain di hadapan Rasulullah SAW. Rasulullah SAW bersabda kepadanya, \"Celakalah kamu, kamu telah memutuskan leher saudaramu, kamu telah memutuskan leher saudaramu,\"  diulang beberapa kali, kemudian tambahnya, \"Barangsiapa di antara kamu yang perlu memuji saudaranya hendaklah ia berkata, 'Aku fikir dia adalah begini dan begitu, dan Allah Maha Mengetahui kebenarannya, dan aku tidak mengesahkan kebaikan sesiapa di sisi Allah, tetapi aku fikir dia begini dan begitu,' jika dia benar-benar tahu apa yang dikatakannya tentang orang itu.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلَامٍ أَخْبَرَنَا عَبْدُ الْوَهَّابِ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ عَنْ أَبِيهِ قَالَ أَثْنَى رَجُلٌ عَلَى رَجُلٍ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ وَيْلَكَ قَطَعْتَ عُنُقَ صَاحِبِكَ قَطَعْتَ عُنُقَ صَاحِبِكَ مِرَارًا ثُمَّ قَالَ مَنْ كَانَ مِنْكُمْ مَادِحًا أَخَاهُ لَا مَحَالَةَ فَلْيَقُلْ أَحْسِبُ فُلَانًا وَاللَّهُ حَسِيبُهُ وَلَا أُزَكِّي عَلَى اللَّهِ أَحَدًا أَحْسِبُهُ كَذَا وَكَذَا إِنْ كَانَ يَعْلَمُ ذَلِكَ مِنْهُ"
      },
      {
        "id": 2547,
        "hadith_number": "2663",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nasihat Nabi SAW Mengenai Pujian yang Berlebih-lebihan",
        "perawi_melayu": "Dikisahkan oleh Abu Musa Al-Ash`ari",
        "english_text": "The Prophet (ﷺ) heard someone praising another and exaggerating in his praise. The Prophet (ﷺ) said, \"You have ruined or cut the man's back (by praising him so much).\"",
        "malay_translation": "Nabi SAW mendengar seseorang memuji orang lain dengan pujian yang berlebihan. Baginda Nabi SAW bersabda, \"Kamu telah merosakkan atau memotong punggung (orang yang dipuji) dengan pujian yang berlebih-lebihan itu.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ صَبَّاحٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّاءَ، حَدَّثَنَا بُرَيْدُ بْنُ عَبْدِ اللَّهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ سَمِعَ النَّبِيُّ صلى الله عليه وسلم رَجُلاً يُثْنِي عَلَى رَجُلٍ، وَيُطْرِيهِ فِي مَدْحِهِ فَقَالَ ‏ \"‏ أَهْلَكْتُمْ ـ أَوْ قَطَعْتُمْ ـ ظَهْرَ الرَّجُلِ ‏\"‏‏.‏"
      },
      {
        "id": 2548,
        "hadith_number": "2664",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hadis Tentang Had Batas Usia Dewasa",
        "perawi_melayu": "Ibn `Umar",
        "english_text": "Allah's Messenger (ﷺ) called me to present myself in front of him or the eve of the battle of Uhud, while I was fourteen years of age at that time, and he did not allow me to take part in that battle, but he called me in front of him on the eve of the battle of the Trench when I was fifteen years old, and he allowed me (to join the battle).\" Nafi` said, \"I went to `Umar bin `Abdul `Aziz who was Caliph at that time and related the above narration to him, He said, \"This age (fifteen) is the limit between childhood and manhood,\" and wrote to his governors to give salaries to those who reached the age of fifteen.",
        "malay_translation": "Rasulullah SAW memanggil saya untuk hadir di hadapan baginda pada malam sebelum Perang Uhud, ketika umur saya 14 tahun. Baginda tidak membenarkan saya menyertai perang itu. Namun, baginda memanggil saya pada malam sebelum Perang Khandaq, ketika umur saya 15 tahun, dan membenarkan saya menyertai perang tersebut. Nafi’ berkata, \"Saya menemui `Umar bin `Abdul `Aziz, yang merupakan Khalifah pada masa itu, dan menceritakan kisah ini kepadanya. Khalifah berkata, \"Usia 15 tahun adalah sempadan antara kanak-kanak dan dewasa.\" Kemudian beliau menulis surat kepada gabenornya untuk memberi gaji kepada mereka yang mencapai usia 15 tahun.",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ حَدَّثَنِي عُبَيْدُ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، قَالَ حَدَّثَنِي ابْنُ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم عَرَضَهُ يَوْمَ أُحُدٍ وَهْوَ ابْنُ أَرْبَعَ عَشْرَةَ سَنَةً، فَلَمْ يُجِزْنِي، ثُمَّ عَرَضَنِي يَوْمَ الْخَنْدَقِ وَأَنَا ابْنُ خَمْسَ عَشْرَةَ فَأَجَازَنِي‏.‏ قَالَ نَافِعٌ فَقَدِمْتُ عَلَى عُمَرَ بْنِ عَبْدِ الْعَزِيزِ وَهْوَ خَلِيفَةٌ، فَحَدَّثْتُهُ هَذَا الْحَدِيثَ، فَقَالَ إِنَّ هَذَا لَحَدٌّ بَيْنَ الصَّغِيرِ وَالْكَبِيرِ‏.‏ وَكَتَبَ إِلَى عُمَّالِهِ أَنْ يَفْرِضُوا لِمَنْ بَلَغَ خَمْسَ عَشْرَةَ‏.‏"
      },
      {
        "id": 2549,
        "hadith_number": "2665",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Wajib Mandi pada Hari Jumaat Bagi Dewasa",
        "perawi_melayu": "Dikisahkan oleh Abu Sa`id Al-Khudri",
        "english_text": "The Prophet (ﷺ) said, \"Bath on Friday is compulsory for those who have attained the age of puberty.\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Mandi pada hari Jumaat adalah wajib bagi mereka yang telah baligh.\"",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا صَفْوَانُ بْنُ سُلَيْمٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ غُسْلُ يَوْمِ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ ‏\"‏‏.‏"
      },
      {
        "id": 2550,
        "hadith_number": "2666, 2667",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Sumpah Palsu untuk Mendapatkan Harta Muslimin",
        "perawi_melayu": "Dikisahkan oleh `Abdullah رضی اللہ عنہ",
        "english_text": "Allah's Messenger (ﷺ) said, \"If somebody takes a false oath in order to get the property of a Muslim (unjustly) by that oath, then Allah will be angry with him when he will meet Him.\" Al-Ash'ath informed me, \"By Allah! This was said regarding me. There was a dispute about a piece of land between me and a man from the Jews who denied my right. I took him to the Prophet. Allah's Messenger (ﷺ) asked me, 'Do you have an evidence?' I replied in the negative. He said to the Jew, 'Take an oath.' I said, 'O Allah's Messenger (ﷺ)! He will surely take an oath and take my property unjustly.\" So, Allah revealed: \"Verily! Those who purchase a little gain at the cost of Allah's covenant and their oaths . . . \" (3.77)",
        "malay_translation": "Rasulullah SAW bersabda, \"Sekiranya seseorang bersumpah palsu untuk mendapatkan harta seorang Muslim (dengan cara yang tidak adil) melalui sumpah tersebut, maka Allah SWT akan murka kepadanya ketika dia bertemu dengan-Nya.\" Al-Ash'ath memberitahu saya, \"Demi Allah! Ini mengenai saya. Terdapat perselisihan tentang sebidang tanah antara saya dan seorang lelaki Yahudi yang menafikan hak saya. Saya membawanya kepada Nabi SAW. Rasulullah SAW bertanya kepada saya, 'Adakah anda mempunyai bukti?' Saya menjawab tidak. Baginda bersabda kepada orang Yahudi itu, 'Bersumpahlah.' Saya berkata, 'Wahai Rasulullah SAW! Pasti dia akan bersumpah dan mengambil harta saya secara zalim.' Oleh itu, Allah SWT menurunkan firman-Nya: \"Sesungguhnya orang-orang yang membeli sedikit keuntungan dengan mengorbankan perjanjian Allah dan sumpah mereka...\" (3.77)",
        "arabic_text": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ حَلَفَ عَلَى يَمِينٍ وَهْوَ فِيهَا فَاجِرٌ، لِيَقْتَطِعَ بِهَا مَالَ امْرِئٍ مُسْلِمٍ، لَقِيَ اللَّهَ وَهْوَ عَلَيْهِ غَضْبَانُ ‏\"‏‏.‏ قَالَ فَقَالَ الأَشْعَثُ بْنُ قَيْسٍ فِيَّ وَاللَّهِ كَانَ ذَلِكَ، كَانَ بَيْنِي وَبَيْنَ رَجُلٍ مِنَ الْيَهُودِ أَرْضٌ فَجَحَدَنِي، فَقَدَّمْتُهُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَلَكَ بَيِّنَةٌ ‏\"‏‏.‏ قَالَ قُلْتُ لاَ‏.‏ قَالَ فَقَالَ لِلْيَهُودِيِّ ‏\"‏ احْلِفْ ‏\"‏‏.‏ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِذًا يَحْلِفَ وَيَذْهَبَ بِمَالِي‏.‏ قَالَ فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلاً‏}‏ إِلَى آخِرِ الآيَةِ‏.‏"
      },
      {
        "id": 2551,
        "hadith_number": "2668",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keputusan Nabi Berdasarkan Sumpah Tertuduh",
        "perawi_melayu": "Dikisahkan oleh Ibn Abu Mulaika:",
        "english_text": "Ibn `Abbas رضی اللہ عنہما wrote that the Prophet (ﷺ) gave his verdict on the basis of the defendant's oath.",
        "malay_translation": "Ibn `Abbas رضی اللہ عنہما meriwayatkan bahawa Nabi (ﷺ) memberikan keputusan berdasarkan sumpah tertuduh.",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا نَافِعُ بْنُ عُمَرَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، قَالَ كَتَبَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَضَى بِالْيَمِينِ عَلَى الْمُدَّعَى عَلَيْهِ‏.‏"
      },
      {
        "id": 2552,
        "hadith_number": "2669, 2670",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Sumpah Palsu untuk Mendapatkan Harta",
        "perawi_melayu": "Abu Wail",
        "english_text": "`Abdullah (bin Mas`ud) رضی اللہ عنہ said, \"Whoever takes a (false) oath in order to grab some property (unjustly), Allah will be angry with him when he will meet Him. Allah confirmed that through His Divine Revelation: \"Verily! Those who purchase a little gain at the cost of Allah's covenant and their oaths . . . they will have a painful punishment.\" (3.77) Al-Ash'ath bin Qais came to us and asked, 'What is Abu `Abdur-Rahman (i.e. `Abdullah) telling you? 'We told him what he was narrating to us. He said, 'He was telling the truth; this Divine Verse was revealed in connection with me. There was a dispute between me and another man about something and the case was filed before Allah's Messenger (ﷺ) who said, 'Produce your two witnesses or else the defendant is to take an oath.' I said, The defendant will surely take a (false) oath caring for nothing.' The Prophet (ﷺ) said, 'Whoever takes a false oath in order to grab (other's) property, then Allah will be angry with him when he will meet Him.' Then Allah revealed its confirmation. Al-Ash'ath then recited the above Divine Verse.\" (3.77)",
        "malay_translation": "‘Abdullah bin Mas’ud r.a. berkata, \"Sesiapa yang bersumpah palsu untuk mendapatkan harta secara tidak adil, Allah SWT akan murka kepadanya apabila dia bertemu dengan-Nya. Allah SWT telah mengesahkannya melalui wahyu-Nya: \"Sesungguhnya orang-orang yang membeli sedikit keuntungan dengan mengorbankan perjanjian Allah dan sumpah mereka... mereka akan mendapat azab yang pedih.\" (3.77) Al-Ash'ath bin Qais datang kepada kami dan bertanya, 'Apakah yang diceritakan oleh Abu Abdur-Rahman (iaitu ‘Abdullah) kepada kamu?' Kami memberitahunya apa yang diceritakannya kepada kami. Beliau berkata, 'Dia berkata benar; ayat suci ini diturunkan berkaitan dengan diriku. Terdapat perselisihan antara aku dan seorang lelaki tentang sesuatu perkara dan kes itu dibawa kepada Rasulullah SAW yang berkata, 'Datangkan dua saksi kamu atau jika tidak, tertuduh perlu bersumpah.' Aku berkata, 'Tertuduh pasti akan bersumpah palsu tanpa mempedulikannya.' Rasulullah SAW bersabda, 'Sesiapa yang bersumpah palsu untuk mendapatkan harta orang lain, Allah SWT akan murka kepadanya apabila dia bertemu dengan-Nya.' Kemudian Allah SWT mengesahkannya. Al-Ash'ath kemudian membacakan ayat suci di atas.\"(3.77)",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، قَالَ قَالَ عَبْدُ اللَّهِ مَنْ حَلَفَ عَلَى يَمِينٍ يَسْتَحِقُّ بِهَا مَالاً لَقِيَ اللَّهَ وَهْوَ عَلَيْهِ غَضْبَانُ، ثُمَّ أَنْزَلَ اللَّهُ تَصْدِيقَ ذَلِكَ ‏{‏إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ‏}‏ إِلَى ‏{‏عَذَابٌ أَلِيمٌ‏}‏‏.‏ ثُمَّ إِنَّ الأَشْعَثَ بْنَ قَيْسٍ خَرَجَ إِلَيْنَا فَقَالَ مَا يُحَدِّثُكُمْ أَبُو عَبْدِ الرَّحْمَنِ فَحَدَّثْنَاهُ بِمَا، قَالَ، فَقَالَ صَدَقَ لَفِيَّ أُنْزِلَتْ، كَانَ بَيْنِي وَبَيْنَ رَجُلٍ خُصُومَةٌ فِي شَىْءٍ، فَاخْتَصَمْنَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ شَاهِدَاكَ أَوْ يَمِينُهُ ‏\"‏‏.‏ فَقُلْتُ لَهُ إِنَّهُ إِذًا يَحْلِفُ وَلاَ يُبَالِي‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَنْ حَلَفَ عَلَى يَمِينٍ يَسْتَحِقُّ بِهَا مَالاً وَهْوَ فِيهَا فَاجِرٌ لَقِيَ اللَّهَ وَهْوَ عَلَيْهِ غَضْبَانُ ‏\"‏‏.‏ فَأَنْزَلَ اللَّهُ تَصْدِيقَ ذَلِكَ، ثُمَّ اقْتَرَأَ هَذِهِ الآيَةَ‏.‏"
      },
      {
        "id": 2553,
        "hadith_number": "2671",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hikmah Hukum Lian dan Kesalahan Tuduhan Zinah",
        "perawi_melayu": "Dikisahkan oleh Ibn `Abbas",
        "english_text": "Hilal bin Umaiya رضی اللہ عنہ accused his wife before the Prophet (ﷺ) of committing illegal sexual intercourse with Sharik bin Sahma.' The Prophet (ﷺ) said, \"Produce a proof, or else you would get the legal punishment (by being lashed) on your back.\" Hilal said, \"O Allah's Messenger (ﷺ)! If anyone of us saw another man over his wife, would he go to search for a proof.\" The Prophet (ﷺ) went on saying, \"Produce a proof or else you would get the legal punishment (by being lashed) on your back.\" The Prophet (ﷺ) then mentioned the narration of Lian (as in the Holy Book). (Surat-al-Nur: 24)",
        "malay_translation": "Hilal bin Umaiya menuduh isterinya di hadapan Nabi SAW melakukan perzinaan dengan Sharik bin Sahma. Nabi SAW bersabda, \"Kumpulkan bukti, atau kamu akan dihukum dera.\" Hilal berkata, \"Wahai Rasulullah SAW, sekiranya seseorang melihat lelaki lain bersama isterinya, adakah dia akan mencari bukti?\" Nabi SAW menegaskan, \"Kumpulkan bukti, atau kamu akan dihukum dera.\" Kemudian, Nabi SAW menyebut tentang hukum Lian (seperti yang terdapat dalam Al-Quran) (Surah An-Nur: 24).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ هِشَامٍ، حَدَّثَنَا عِكْرِمَةُ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ هِلاَلَ بْنَ أُمَيَّةَ، قَذَفَ امْرَأَتَهُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم بِشَرِيكِ بْنِ سَحْمَاءَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ الْبَيِّنَةُ أَوْ حَدٌّ فِي ظَهْرِكَ ‏\"‏‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ إِذَا رَأَى أَحَدُنَا عَلَى امْرَأَتِهِ رَجُلاً يَنْطَلِقُ يَلْتَمِسُ الْبَيِّنَةَ فَجَعَلَ يَقُولُ ‏\"‏ الْبَيِّنَةَ وَإِلاَّ حَدٌّ فِي ظَهْرِكَ ‏\"‏‏.‏ فَذَكَرَ حَدِيثَ اللِّعَانِ‏.‏"
      },
      {
        "id": 2554,
        "hadith_number": "2672",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Tiga Golongan yang Allah Tidak Bicara dan Tidak Melihatnya",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Allah's Messenger (ﷺ) said, \"There are three persons whom Allah will neither talk to nor look at, nor purify from (the sins), and they will have a painful punishment. (They are): \r\n(1)  A man possessed superfluous water on a way and he withheld it from the travelers. \r\n(2) a man who gives a pledge of allegiance to a Muslim ruler and gives it only for worldly gains. If the ruler gives \r\n       him what he wants, he remains obedient to It, otherwise he does not abide by it, and \r\n(3) a man bargains with another man after the `Asr prayer and the latter takes a false oath in the Name of \r\n       Allah) claiming that he has been offered so much for the thing and the former (believes him and) buys it.\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Ada tiga golongan yang Allah tidak akan berbicara dengan mereka, tidak melihat mereka, dan tidak akan membersihkan mereka (dari dosa), dan mereka akan menerima azab yang pedih. Mereka adalah:\r\n(1) Orang yang memiliki air berlebihan di perjalanan dan menahannya dari para musafir.\r\n(2) Orang yang memberi bai'ah kepada pemimpin Muslim hanya untuk keuntungan duniawi. Jika pemimpin itu memberikan apa yang dia inginkan, dia tetap patuh kepadanya, jika tidak, dia tidak akan menepati janjinya,\ndan\r\n(3) Orang yang berjual beli dengan orang lain setelah solat 'Asr dan yang terakhir bersumpah palsu dengan nama Allah) mengklaim bahwa dia telah ditawari begitu banyak untuk barang tersebut dan yang pertama (percaya padanya dan) membelinya.\"",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ ثَلاَثَةٌ لاَ يُكَلِّمُهُمُ اللَّهُ، وَلاَ يَنْظُرُ إِلَيْهِمْ وَلاَ يُزَكِّيهِمْ، وَلَهُمْ عَذَابٌ أَلِيمٌ رَجُلٌ عَلَى فَضْلِ مَاءٍ بِطَرِيقٍ يَمْنَعُ مِنْهُ ابْنَ السَّبِيلِ، وَرَجُلٌ بَايَعَ رَجُلاً لاَ يُبَايِعُهُ إِلاَّ لِلدُّنْيَا، فَإِنْ أَعْطَاهُ مَا يُرِيدُ وَفَى لَهُ، وَإِلاَّ لَمْ يَفِ لَهُ، وَرَجُلٌ سَاوَمَ رَجُلاً بِسِلْعَةٍ بَعْدَ الْعَصْرِ، فَحَلَفَ بِاللَّهِ لَقَدْ أُعْطِيَ بِهِ كَذَا وَكَذَا، فَأَخَذَهَا ‏\"‏‏.‏"
      },
      {
        "id": 2555,
        "hadith_number": "2673",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Bersumpah Palsu Demi Memperoleh Harta",
        "perawi_melayu": "Dikisahkan oleh Ibn Mas'ud",
        "english_text": "The Prophet (ﷺ) said, \"Whoever takes a (false) oath in order to grab (others) property, then Allah will be angry with him when he will meet Him.\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Barangsiapa yang bersumpah palsu dengan tujuan untuk merampas harta orang lain, maka Allah SWT akan murka kepadanya apabila mereka bertemu di hadapan-Nya.\"",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنِ ابْنِ مَسْعُودٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ حَلَفَ عَلَى يَمِينٍ لِيَقْتَطِعَ بِهَا مَالاً لَقِيَ اللَّهَ وَهْوَ عَلَيْهِ غَضْبَانُ ‏\"‏‏.‏"
      },
      {
        "id": 2556,
        "hadith_number": "2674",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pengundian untuk Mengambil Sumpah",
        "perawi_melayu": "Dikisahkan oleh Abu Hurairah:",
        "english_text": "The Prophet (ﷺ) asked some people to take an oath, and they hurried for it. The Prophet (ﷺ) ordered that lots should be drawn amongst them as to who would take an oath first.",
        "malay_translation": "Nabi (ﷺ) meminta beberapa orang untuk bersumpah, dan mereka berlumba-lumba untuk melakukannya. Nabi (ﷺ) memerintahkan agar قرعة (undian) diadakan di antara mereka untuk menentukan siapakah yang akan bersumpah terlebih dahulu.",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ نَصْرٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم عَرَضَ عَلَى قَوْمٍ الْيَمِينَ فَأَسْرَعُوا، فَأَمَرَ أَنْ يُسْهَمَ بَيْنَهُمْ فِي الْيَمِينِ أَيُّهُمْ يَحْلِفُ‏.‏"
      },
      {
        "id": 2557,
        "hadith_number": "2675",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Sumpah Palsu dan Akibatnya dalam Perdagangan",
        "perawi_melayu": "Diceritakan oleh Abdullah bin Abu `Aufa",
        "english_text": "A man displayed some goods in the market and took a false oath that he had been offered so much for them though he was not offered that amount Then the following Divine Verse was revealed:-- \"Verily! Those who purchase a little gain at the cost of Allah's covenant and their oaths . . . Will get painful punishment.\" (3.77) Ibn Abu `Aufa رضی اللہ عنہ added, \"Such person as described above is a treacherous Riba eater (i.e. eater of usury).",
        "malay_translation": "Seorang lelaki memaparkan barang dagangannya di pasar dan bersumpah palsu bahawa dia telah ditawarkan sejumlah wang yang banyak padahal dia tidak ditawarkan sejumlah itu. Kemudian ayat suci berikut diturunkan: \"Sesungguhnya orang yang membeli sedikit keuntungan dengan mengorbankan perjanjian Allah dan sumpah mereka... akan mendapat azab yang pedih.\" (3.77) Ibn Abu `Aufa menambah, \"Orang sedemikian itu adalah seorang yang khianat dan memakan riba (riba'ah).\" ",
        "arabic_text": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا الْعَوَّامُ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ أَبُو إِسْمَاعِيلَ السَّكْسَكِيُّ، سَمِعَ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى ـ رضى الله عنهما ـ يَقُولُ أَقَامَ رَجُلٌ سِلْعَتَهُ فَحَلَفَ بِاللَّهِ لَقَدْ أُعْطِيَ بِهَا مَا لَمْ يُعْطَهَا فَنَزَلَتْ ‏{‏إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلاً‏}‏ وَقَالَ ابْنُ أَبِي أَوْفَى النَّاجِشُ آكِلُ رِبًا خَائِنٌ‏.‏"
      },
      {
        "id": 2558,
        "hadith_number": "2676, 2677",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Sumpah Palsu Demi Memperoleh Harta Orang Lain",
        "perawi_melayu": "Diceritakan oleh Abu Wail daripada `Abdullah رضی اللہ عنہ",
        "english_text": "The Prophet (ﷺ) said, \"Whoever takes a false oath in order to grab another man's (or his brother's) property, then Allah will be angry with him when he will meet him.\" Then Allah confirmed this by revealing the Divine Verse: \"Verily! Those who purchase a little gain at the cost of Allah's Covenant and their oaths . . . Will get painful punishment.\" (3.77) Al-Ash'ath met me and asked, \"What did `Abdullah رضی اللہ عنہما tell you today?\" I said, \"So and so.\" He said, \"The Verse was revealed regarding my case.\"",
        "malay_translation": "Nabi SAW bersabda, \"Sesiapa yang bersumpah palsu untuk mendapatkan harta orang lain (atau saudaranya), maka Allah akan murka kepadanya ketika mereka bertemu.\" Kemudian Allah mengesahkannya dengan wahyu ayat suci: \"Sesungguhnya orang-orang yang membeli sedikit keuntungan dengan mengorbankan perjanjian Allah dan sumpah mereka... akan mendapat azab yang pedih.\" (3.77) Al-Ash'ath menemui saya dan bertanya, \"Apakah yang diberitahu `Abdullah رضی اللہ عنہما kepada kamu hari ini?\" Saya berkata, \"Begini dan begitu.\" Beliau berkata, \"Ayat itu diturunkan berkenaan dengan kes saya.\"",
        "arabic_text": "حَدَّثَنَا بِشْرُ بْنُ خَالِدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ حَلَفَ عَلَى يَمِينٍ كَاذِبًا لِيَقْتَطِعَ مَالَ رَجُلٍ ـ أَوْ قَالَ أَخِيهِ ـ لَقِيَ اللَّهَ وَهْوَ عَلَيْهِ غَضْبَانُ ‏\"‏‏.‏ وَأَنْزَلَ اللَّهُ تَصْدِيقَ ذَلِكَ فِي الْقُرْآنِ ‏{‏إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلاً‏}‏ الآيَةَ‏.‏ فَلَقِيَنِي الأَشْعَثُ فَقَالَ مَا حَدَّثَكُمْ عَبْدُ اللَّهِ الْيَوْمَ، قُلْتُ كَذَا وَكَذَا‏.‏ قَالَ فِيَّ أُنْزِلَتْ‏.‏"
      },
      {
        "id": 2559,
        "hadith_number": "2678",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Panduan Ibadah dan Kewajipan dalam Islam",
        "perawi_melayu": "Diceritakan oleh Talha bin 'Ubaidullah",
        "english_text": "A man came to Allah's Messenger (ﷺ) asking him about Islam, Allah's Messenger (ﷺ) said, \"You have to offer five compulsory prayers in a day and a night (24 hours).\" The man asked, \"Is there any more compulsory prayers for me?\" Allah's Messenger (ﷺ) said, \"No, unless you like to offer Nawafil (i.e. optional prayers).\" Allah's Messenger (ﷺ) then added, \"You have to observe fasts during the month of Ramadan.\" The man said, \"Am I to fast any other days?' Allah's Messenger (ﷺ) said, \"No, unless you wish to observe the optional fast voluntarily.\" Then Allah's Messenger (ﷺ) told him about the compulsory Zakat. The man asked, \"Do I have to give anything besides?\" Allah's Messenger (ﷺ) said, \"No, unless you wish to give in charity voluntarily.\" So, the man departed saying, \"By Allah I will neither do more nor less than that.\" Allah's Messenger (ﷺ) said, \"If he has said the truth he will be successful.\"",
        "malay_translation": "Seorang lelaki datang kepada Rasulullah SAW bertanya tentang Islam. Baginda SAW menjawab, \"Engkau wajib menunaikan lima solat fardhu dalam sehari semalam (24 jam).\" Lelaki itu bertanya, \"Adakah lagi solat fardhu yang wajib saya tunaikan?\" Baginda SAW menjawab, \"Tidak, melainkan jika engkau ingin mengerjakan solat sunat (nawafil).\" Baginda SAW kemudian menambah, \"Engkau wajib berpuasa pada bulan Ramadan.\" Lelaki itu bertanya, \"Adakah saya perlu berpuasa pada hari-hari lain?\" Baginda SAW menjawab, \"Tidak, melainkan jika engkau ingin berpuasa sunat secara sukarela.\" Kemudian Baginda SAW memberitahunya tentang kewajipan zakat. Lelaki itu bertanya, \"Adakah saya perlu memberi selain daripada itu?\" Baginda SAW menjawab, \"Tidak, melainkan jika engkau ingin memberi sedekah secara sukarela.\" Maka lelaki itu berangkat sambil berkata, \"Demi Allah, aku tidak akan melakukan lebih atau kurang dari itu.\" Baginda SAW bersabda, \"Jika dia berkata benar, dia akan berjaya.\"",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ عَمِّهِ أَبِي سُهَيْلٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ طَلْحَةَ بْنَ عُبَيْدِ اللَّهِ، يَقُولُ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَإِذَا هُوَ يَسْأَلُهُ عَنِ الإِسْلاَمِ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ خَمْسُ صَلَوَاتٍ فِي الْيَوْمِ وَاللَّيْلَةِ ‏\"‏‏.‏ فَقَالَ هَلْ عَلَىَّ غَيْرُهَا قَالَ ‏\"‏ لاَ، إِلاَّ أَنْ تَطَّوَّعَ ‏\"‏‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَصِيَامُ رَمَضَانَ ‏\"‏‏.‏ قَالَ هَلْ عَلَىَّ غَيْرُهُ قَالَ ‏\"‏ لاَ، إِلاَّ أَنْ تَطَّوَّعَ ‏\"‏‏.‏ قَالَ وَذَكَرَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم الزَّكَاةَ‏.‏ قَالَ هَلْ عَلَىَّ غَيْرُهَا قَالَ ‏\"‏ لاَ، إِلاَّ أَنْ تَطَّوَّعَ ‏\"‏‏.‏ فَأَدْبَرَ الرَّجُلُ وَهْوَ يَقُولُ وَاللَّهِ لاَ أَزِيدُ عَلَى هَذَا وَلاَ أَنْقُصُ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَفْلَحَ إِنْ صَدَقَ ‏\"‏‏.‏"
      },
      {
        "id": 2560,
        "hadith_number": "2679",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perintah Menjauhi Sumpah Selain Allah",
        "perawi_melayu": "Dikisahkan oleh Abdullah رضی اللہ عنہما",
        "english_text": "The Prophet (ﷺ) said, \"Whoever has to take an oath should swear by Allah or remain silent.\" (i.e. He should not swear by other than Allah.)",
        "malay_translation": "Nabi SAW bersabda, \"Barangsiapa yang perlu bersumpah, maka hendaklah ia bersumpah dengan Allah atau diam. (Maksudnya, dia tidak sepatutnya bersumpah dengan selain Allah.)\"",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جُوَيْرِيَةُ، قَالَ ذَكَرَ نَافِعٌ عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ كَانَ حَالِفًا فَلْيَحْلِفْ بِاللَّهِ أَوْ لِيَصْمُتْ ‏\"‏‏.‏"
      },
      {
        "id": 2561,
        "hadith_number": "2680",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Jangan Terima Kebenaran Berdasarkan Kemahiran Berhujah yang Memaksa",
        "perawi_melayu": "Dikisahkan oleh Um Salamah",
        "english_text": "Once Allah's Messenger (ﷺ) said, \"You people present your cases to me and some of you may be more eloquent and persuasive in presenting their argument. So, if I give some one's right to another (wrongly) because of the latter's (tricky) presentation of the case, I am really giving him a piece of fire; so he should not take it.\"",
        "malay_translation": "Rasulullah s.a.w. pernah bersabda, \"Kamu semua membawa perkara-perkara kamu kepadaKu, dan ada di antara kamu yang lebih fasih dan berkesan dalam membentangkan hujah mereka. Oleh itu, jika Aku memberi hak seseorang kepada orang lain (dengan salah) disebabkan cara pembentangan hujah yang licik itu, sesungguhnya Aku telah memberikan sebahagian api kepadanya; maka dia tidak seharusnya menerimanya.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ، عَنْ أُمِّ سَلَمَةَ ـ رضى الله عنها ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّكُمْ تَخْتَصِمُونَ إِلَىَّ، وَلَعَلَّ بَعْضَكُمْ أَلْحَنُ بِحُجَّتِهِ مِنْ بَعْضٍ، فَمَنْ قَضَيْتُ لَهُ بِحَقِّ أَخِيهِ شَيْئًا بِقَوْلِهِ، فَإِنَّمَا أَقْطَعُ لَهُ قِطْعَةً مِنَ النَّارِ فَلاَ يَأْخُذْهَا ‏\"‏‏.‏"
      },
      {
        "id": 2562,
        "hadith_number": "2681",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ciri-Ciri Nabi yang Diakui oleh Maharaja Heraclius",
        "perawi_melayu": "Dikisahkan oleh Abu Sufyan",
        "english_text": "Heraclius berkata kepadanya, \"Apabila aku bertanya kepadamu apa yang diperintahkan Muhammad kepadamu, engkau menjawab bahawa beliau memerintahkanmu untuk mendirikan solat, berkata benar, memelihara kesucian, menepati janji dan mengembalikan amanah.\" Kemudian Heraclius menambah, \"Ini memang sifat-sifat seorang nabi.\"",
        "malay_translation": "Heraclius berkata kepadanya, \"Apabila aku bertanya kepadamu tentang apa yang diperintahkan Muhammad kepadamu, engkau menjawab bahawa beliau memerintahkanmu untuk mendirikan solat, berkata benar, memelihara kesucian, menepati janji dan mengembalikan amanah. Kemudian Heraclius berkata, 'Sesungguhnya ini adalah sifat-sifat seorang nabi.'\" ",
        "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ ـ رضى الله عنهما ـ أَخْبَرَهُ قَالَ أَخْبَرَنِي أَبُو سُفْيَانَ، أَنَّ هِرَقْلَ، قَالَ لَهُ سَأَلْتُكَ مَاذَا يَأْمُرُكُمْ فَزَعَمْتَ أَنَّهُ أَمَرَكُمْ بِالصَّلاَةِ وَالصِّدْقِ وَالْعَفَافِ وَالْوَفَاءِ بِالْعَهْدِ وَأَدَاءِ الأَمَانَةِ‏.‏ قَالَ وَهَذِهِ صِفَةُ نَبِيٍّ‏.‏"
      },
      {
        "id": 2563,
        "hadith_number": "2682",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ciri-ciri Munafik (Pendusta)",
        "perawi_melayu": "Dikisahkan oleh Abu Hurairah",
        "english_text": "Allah's Messenger (ﷺ) said, \"The signs of a hypocrite are three: \r\n(1) whenever he speaks, he tells a lie, \r\n(2) whenever he is entrusted, he proves to be dishonest, \r\n(3) whenever he promises, he breaks his promise.",
        "malay_translation": "Rasulullah SAW bersabda, \"Tanda-tanda seorang munafik ada tiga: \r\n(1) Apabila dia berbicara, dia berdusta, \r\n(2) Apabila dia dipercayakan, dia terbukti tidak jujur, \r\n(3) Apabila dia berjanji, dia mengingkari janjinya.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ أَبِي سُهَيْلٍ، نَافِعِ بْنِ مَالِكِ بْنِ أَبِي عَامِرٍ عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ آيَةُ الْمُنَافِقِ ثَلاَثٌ إِذَا حَدَّثَ كَذَبَ، وَإِذَا اؤْتُمِنَ خَانَ، وَإِذَا وَعَدَ أَخَلَفَ ‏\"‏‏.‏"
      },
      {
        "id": 2564,
        "hadith_number": "2683",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pengurusan Harta Nabi SAW dan Bayaran Janji",
        "perawi_melayu": "Jabir bin `Abdullah",
        "english_text": "\"When the Prophet (ﷺ) died, Abu Bakr رضی اللہ عنہ received some property from Al-`Ala bin Al-Hadrami. Abu Bakr رضی اللہ عنہ said to the people, \"Whoever has a money claim on the Prophet, or was promised something by him, should come to us (so that we may pay him his right).\" Jabir رضی اللہ عنہ added, \"I said (to Abu Bakr), Allah's Messenger (ﷺ) promised me that he would give me this much, and this much, and this much (spreading his hands three times).\" Jabir رضی اللہ عنہ added, \"Abu Bakr رضی اللہ عنہ counted for me and handed me five-hundred (gold pieces), and then five-hundred, and then five-hundred.\"",
        "malay_translation": "Ketika Rasulullah SAW wafat, Abu Bakar mendapat beberapa harta dari Al-`Ala bin Al-Hadrami. Abu Bakar menyeru kepada orang ramai, \"Sesiapa yang mempunyai tuntutan wang terhadap Nabi SAW, atau dijanjikan sesuatu oleh baginda, hendaklah datang kepada kami (supaya kami membayar haknya).\" Jabir menambah, \"Saya berkata (kepada Abu Bakar), Rasulullah SAW telah menjanjikan saya sejumlah ini, dan sejumlah ini, dan sejumlah ini (mengangkat kedua-dua tangan sebanyak tiga kali).\" Jabir menambah lagi, \"Abu Bakar mengira dan menyerahkan kepada saya lima ratus (keping emas), kemudian lima ratus, dan kemudian lima ratus lagi.\" ",
        "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، عَنْ مُحَمَّدِ بْنِ عَلِيٍّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، رضى الله عنهم قَالَ لَمَّا مَاتَ النَّبِيُّ صلى الله عليه وسلم جَاءَ أَبَا بَكْرٍ مَالٌ مِنْ قِبَلِ الْعَلاَءِ بْنِ الْحَضْرَمِيِّ، فَقَالَ أَبُو بَكْرٍ مَنْ كَانَ لَهُ عَلَى النَّبِيِّ صلى الله عليه وسلم دَيْنٌ، أَوْ كَانَتْ لَهُ قِبَلَهُ عِدَةٌ، فَلْيَأْتِنَا‏.‏ قَالَ جَابِرٌ فَقُلْتُ وَعَدَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُعْطِيَنِي هَكَذَا وَهَكَذَا وَهَكَذَا، فَبَسَطَ يَدَيْهِ ثَلاَثَ مَرَّاتٍ، قَالَ جَابِرٌ فَعَدَّ فِي يَدِي خَمْسَمِائَةٍ، ثُمَّ خَمْسَمِائَةٍ، ثُمَّ خَمْسَمِائَةٍ‏.‏"
      },
      {
        "id": 2565,
        "hadith_number": "2684",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Jawapan Mengenai Masa Nabi Musa a.s.",
        "perawi_melayu": "Dikisahkan oleh Sa`id bin Jubair:",
        "english_text": "A Jew from Hira asked me which one of the two periods Musa (i.e. Prophet Moses) completed. I said, \"I don't know, (but wait) till I see the most learned 'Arab and inquire him about it.\" So, I went to Ibn `Abbas رضی اللہ عنہما and asked him. He replied, \"Moses completed the longer and better period.\" Ibn `Abbas added, \"No doubt, an apostle of Allah always does what he says.\"",
        "malay_translation": "Seorang Yahudi dari Hira bertanya kepadaku tentang mana satu daripada dua tempoh yang telah diselesaikan oleh Musa (iaitu Nabi Musa a.s.). Aku menjawab, \"Aku tidak tahu, (tetapi tunggu) sehingga aku menemui seorang Arab yang paling alim dan menanyakan kepadanya.\" Oleh itu, aku pergi kepada Ibn `Abbas dan bertanya kepadanya. Beliau menjawab, \"Musa telah menyelesaikan tempoh yang lebih panjang dan lebih baik.\" Ibn `Abbas menambah, \"Tidak syak lagi, seorang rasul Allah sentiasa melakukan apa yang dia katakan.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، أَخْبَرَنَا سَعِيدُ بْنُ سُلَيْمَانَ، حَدَّثَنَا مَرْوَانُ بْنُ شُجَاعٍ، عَنْ سَالِمٍ الأَفْطَسِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ سَأَلَنِي يَهُودِيٌّ مِنْ أَهْلِ الْحِيرَةِ أَىَّ الأَجَلَيْنِ قَضَى مُوسَى قُلْتُ لاَ أَدْرِي حَتَّى أَقْدَمَ عَلَى حَبْرِ الْعَرَبِ فَأَسْأَلَهُ‏.‏ فَقَدِمْتُ، فَسَأَلْتُ ابْنَ عَبَّاسٍ فَقَالَ قَضَى أَكْثَرَهُمَا وَأَطْيَبَهُمَا، إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم إِذَا قَالَ فَعَلَ‏.‏"
      },
      {
        "id": 2566,
        "hadith_number": "2685",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Peringatan Kepada Umat Islam Tentang Mengajukan Pertanyaan Kepada Ahli Kitab",
        "perawi_melayu": "Dikisahkan oleh Ubaidullah bin `Abdullah bin `Utba",
        "english_text": "Ibn `Abbas رضی اللہ عنہما said, \"O Muslims? How do you ask the people of the Scriptures, though your Book (i.e. the Qur'an) which was revealed to His Prophet is the most recent information from Allah and you recite it, the Book that has not been distorted? Allah has revealed to you that the people of the scriptures have changed with their own hands what was revealed to them and they have said (as regards their changed Scriptures): This is from Allah, in order to get some worldly benefit thereby.\" Ibn `Abbas added: \"Isn't the knowledge revealed to you sufficient to prevent you from asking them? By Allah I have never seen any one of them asking (Muslims) about what has been revealed to you.\"",
        "malay_translation": "Ibn `Abbas berkata, \"Wahai umat Islam, mengapakah kamu bertanya kepada ahli kitab, padahal kitabmu (iaitu al-Quran) yang diturunkan kepada Nabi-Nya adalah wahyu Allah yang paling baru dan kamu membacanya, kitab yang tidak diubah-ubah? Allah telah memberitahu kamu bahawa ahli kitab telah mengubah sendiri apa yang diturunkan kepada mereka, dan mereka mengatakan (berhubung dengan kitab mereka yang telah diubah): Ini daripada Allah, untuk mendapatkan manfaat duniawi. \" Ibn `Abbas menambah, \"Bukankah ilmu yang telah diturunkan kepadamu cukup untuk menghalangmu daripada bertanya kepada mereka? Demi Allah, aku tidak pernah melihat sesiapa pun di antara mereka bertanya (kepada umat Islam) tentang apa yang telah diturunkan kepadamu.\"",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ يَا مَعْشَرَ الْمُسْلِمِينَ، كَيْفَ تَسْأَلُونَ أَهْلَ الْكِتَابِ، وَكِتَابُكُمُ الَّذِي أُنْزِلَ عَلَى نَبِيِّهِ صلى الله عليه وسلم أَحْدَثُ الأَخْبَارِ بِاللَّهِ، تَقْرَءُونَهُ لَمْ يُشَبْ، وَقَدْ حَدَّثَكُمُ اللَّهُ أَنَّ أَهْلَ الْكِتَابِ بَدَّلُوا مَا كَتَبَ اللَّهُ وَغَيَّرُوا بِأَيْدِيهِمُ الْكِتَابَ، فَقَالُوا هُوَ مِنْ عِنْدِ اللَّهِ، لِيَشْتَرُوا بِهِ ثَمَنًا قَلِيلاً أَفَلاَ يَنْهَاكُمْ مَا جَاءَكُمْ مِنَ الْعِلْمِ عَنْ مُسَاءَلَتِهِمْ، وَلاَ وَاللَّهِ مَا رَأَيْنَا مِنْهُمْ رَجُلاً قَطُّ يَسْأَلُكُمْ عَنِ الَّذِي أُنْزِلَ عَلَيْكُمْ‏.‏"
      },
      {
        "id": 2567,
        "hadith_number": "2686",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perumpamaan Orang yang Taat dan Orang yang Durhaka",
        "perawi_melayu": "Dikisahkan oleh An-Nu`man bin Bashir",
        "english_text": "The Prophet (ﷺ) said, \"The example of the person abiding by Allah's orders and limits (or the one who abides by the limits and regulations prescribed by Allah) in comparison to the one who do wrong and violate Allah's limits and orders is like the example of people drawing lots for seats in a boat. Some of them got seats in the upper part while the others in the lower part ; those in the, lower part have to pass by those in the upper one to get water, and that troubled the latter. One of them (i.e. the people in the lower part) took an ax and started making a hole in the bottom of the boat. The people of the upper part came and asked him, (saying), 'What is wrong with you?' He replied, \"You have been troubled much by my (coming up to you), and I have to get water.' Now if they prevent him from doing that they will save him and themselves, but if they leave him (to do what he wants), they will destroy him and themselves.\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Perumpamaan orang yang taat kepada perintah dan larangan Allah SWT berbanding dengan orang yang melakukan kejahatan dan melanggar perintah-Nya adalah seperti orang-orang yang bertukar-tukar tempat duduk di atas sebuah perahu. Sebahagian daripada mereka berada di bahagian atas, manakala yang lain di bahagian bawah. Mereka yang di bahagian bawah perlu melalui mereka yang di atas untuk mendapatkan air, dan ini menyusahkan mereka yang di atas. Salah seorang daripada mereka yang di bahagian bawah mengambil kapak dan mula membuat lubang di bahagian bawah perahu. Orang-orang di bahagian atas datang dan bertanya kepadanya, 'Apakah yang salah denganmu?' Dia menjawab, 'Kamu telah banyak diganggu oleh kedatangan saya, dan saya perlu mendapatkan air.' Jika mereka menghalang perbuatannya, mereka akan menyelamatkan dirinya dan diri mereka sendiri, tetapi jika mereka membiarkannya (berbuat demikian), mereka akan membinasakan dirinya dan diri mereka sendiri.\"",
        "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي الشَّعْبِيُّ، أَنَّهُ سَمِعَ النُّعْمَانَ بْنَ بَشِيرٍ ـ رضى الله عنهما ـ يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَثَلُ الْمُدْهِنِ فِي حُدُودِ اللَّهِ وَالْوَاقِعِ فِيهَا مَثَلُ قَوْمٍ اسْتَهَمُوا سَفِينَةً، فَصَارَ بَعْضُهُمْ فِي أَسْفَلِهَا وَصَارَ بَعْضُهُمْ فِي أَعْلاَهَا، فَكَانَ الَّذِي فِي أَسْفَلِهَا يَمُرُّونَ بِالْمَاءِ عَلَى الَّذِينَ فِي أَعْلاَهَا، فَتَأَذَّوْا بِهِ، فَأَخَذَ فَأْسًا، فَجَعَلَ يَنْقُرُ أَسْفَلَ السَّفِينَةِ، فَأَتَوْهُ فَقَالُوا مَا لَكَ قَالَ تَأَذَّيْتُمْ بِي، وَلاَ بُدَّ لِي مِنَ الْمَاءِ، فَإِنْ أَخَذُوا عَلَى يَدَيْهِ أَنْجَوْهُ وَنَجَّوْا أَنْفُسَهُمْ، وَإِنْ تَرَكُوهُ أَهْلَكُوهُ وَأَهْلَكُوا أَنْفُسَهُمْ ‏\"‏‏.‏"
      },
      {
        "id": 2568,
        "hadith_number": "2687",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Uthman bin Mazun dan Kasih Sayang Rasulullah SAW",
        "perawi_melayu": "Dikisahkan oleh Kharijah bin Zaid:",
        "english_text": "Umm-ul-Ala, yang termasuk dalam kalangan wanita keluarganya dan telah memberi bai'ah kepada Nabi (ﷺ), menceritakan: ketika orang Ansar mengadakan undian untuk menentukan mana antara para Muhajirin yang akan tinggal bersama mereka, nama `Uthman bin Mazun رضی اللہ عنہ muncul (sebagai orang yang akan tinggal dengan mereka). Um Al-Ala رضی اللہ عنہا selanjutnya berkata, \"Uthman tinggal bersama kami, dan kami merawatnya ketika sakit, namun dia meninggal. Kami mengkafankan dia dengan pakaiannya, dan Rasulullah SAW datang ke rumah kami. Lalu aku berkata (kepada Uthman yang sudah meninggal), 'Wahai Abu As-Sa'ib! Semoga Allah merahmati engkau. Aku bersaksi bahawa Allah telah memberkatimu.' Rasulullah SAW berkata kepadaku, \"Bagaimana engkau tahu bahawa Allah telah memberkatinya?\" Aku menjawab, 'Aku tidak tahu ya Rasulullah SAW! Semoga kedua ibu bapaku menjadi tebusanmu.' Rasulullah SAW berkata, 'Adapun Uthman, demi Allah dia telah meninggal dan aku benar-benar mendoakan segala kebaikan untuknya, namun, demi Allah, meskipun aku adalah Rasulullah SAW, aku tidak tahu apa yang akan terjadi kepadanya.' Um Al-Ala رضی اللہ عنہا menambahkan, 'Demi Allah aku tidak akan pernah menguji ketakwaan sesiapapun selepasnya. Dan apa yang dikatakan Rasulullah SAW itu membuatku bersedih.\" Um Al-Ala selanjutnya berkata, \"Suatu ketika aku tidur dan bermimpi melihat sungai yang mengalir untuk `Uthman رضی اللہ عنہ. Maka aku pergi menemui Rasulullah SAW dan menceritakan mimpiku kepadanya, beliau menjawab, 'Itulah (lambang) amalannya.'\"",
        "malay_translation": "Ummul-Ala, yang merupakan salah seorang wanita keluarga Nabi SAW dan telah memberi bai'ah kepada Baginda, menceritakan peristiwa berikut: Apabila orang Ansar mengadakan undian untuk menentukan mana antara para Muhajirin yang akan tinggal bersama mereka, nama `Uthman bin Mazun telah ditentukan. Um Al-Ala kemudiannya berkata, \"`Uthman tinggal bersama kami, dan kami merawatnya dengan penuh kasih sayang ketika sakit. Namun, dia meninggal dunia. Kami mengkafankannya dengan pakaiannya sendiri, dan Rasulullah SAW datang ke rumah kami.  Lalu aku berkata (kepada `Uthman yang sudah meninggal), 'Wahai Abu As-Sa'ib, semoga Allah merahmati engkau. Aku bersaksi bahawa Allah telah memberkatimu.' Rasulullah SAW bertanya, \"Bagaimana engkau tahu bahawa Allah telah memberkatinya?\" Aku menjawab, 'Aku tidak tahu ya Rasulullah! Semoga ibu bapaku menjadi tebusanmu.' Rasulullah SAW menjawab, 'Adapun `Uthman, demi Allah dia telah meninggal dan aku benar-benar mendoakan segala kebaikan untuknya. Namun, demi Allah, walau aku adalah Rasul-Nya, aku tidak mengetahui apa yang akan terjadi kepadanya.' Um Al-Ala menambahkan, 'Demi Allah, aku tidak akan pernah lagi menilai ketakwaan sesiapa selepasnya. Kata-kata Rasulullah SAW itu membuatku bersedih.\" Um Al-Ala kemudian berkata, \"Pada suatu malam, aku bermimpi melihat sungai yang mengalir untuk `Uthman. Maka, aku mendatangi Rasulullah SAW dan menceritakan mimpiku itu, lalu Baginda bersabda, 'Itulah simbol amalannya.'\"",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي خَارِجَةُ بْنُ زَيْدٍ الأَنْصَارِيُّ، أَنَّ أُمَّ الْعَلاَءِ، امْرَأَةً مِنْ نِسَائِهِمْ قَدْ بَايَعَتِ النَّبِيَّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّ عُثْمَانَ بْنَ مَظْعُونٍ طَارَ لَهُ سَهْمُهُ فِي السُّكْنَى حِينَ أَقْرَعَتِ الأَنْصَارُ سُكْنَى الْمُهَاجِرِينَ‏.‏ قَالَتْ أُمُّ الْعَلاَءِ فَسَكَنَ عِنْدَنَا عُثْمَانُ بْنُ مَظْعُونٍ، فَاشْتَكَى، فَمَرَّضْنَاهُ حَتَّى إِذَا تُوُفِّيَ وَجَعَلْنَاهُ فِي ثِيَابِهِ دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقُلْتُ رَحْمَةُ اللَّهِ عَلَيْكَ أَبَا السَّائِبِ، فَشَهَادَتِي عَلَيْكَ لَقَدْ أَكْرَمَكَ اللَّهُ‏.‏ فَقَالَ لِي النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَمَا يُدْرِيكِ أَنَّ اللَّهَ أَكْرَمَهُ ‏\"‏‏.‏ فَقُلْتُ لاَ أَدْرِي بِأَبِي أَنْتَ وَأُمِّي يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمَّا عُثْمَانُ فَقَدْ جَاءَهُ ـ وَاللَّهِ ـ الْيَقِينُ وَإِنِّي لأَرْجُو لَهُ الْخَيْرَ، وَاللَّهِ مَا أَدْرِي وَأَنَا رَسُولُ اللَّهِ مَا يُفْعَلُ بِي ‏\"‏‏.‏ قَالَتْ فَوَاللَّهِ لاَ أُزَكِّي أَحَدًا بَعْدَهُ أَبَدًا، وَأَحْزَنَنِي ذَلِكَ قَالَتْ فَنِمْتُ فَأُرِيتُ لِعُثْمَانَ عَيْنًا تَجْرِي، فَجِئْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرْتُهُ فَقَالَ ‏\"‏ ذَلِكَ عَمَلُهُ ‏\"‏‏.‏"
      },
      {
        "id": 2569,
        "hadith_number": "2688",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Memilih Isteri untuk Perjalanan",
        "perawi_melayu": "Dikisahkan oleh Aisha رضي الله عنها",
        "english_text": "Whenever Allah's Messenger (ﷺ) intended to go on a journey, he used to draw lots among his wives and would take with him the one on whom the lot fell. He also used to fix for everyone of his wives a day and a night, but Sauda bint Zam`a gave her day and night to `Aisha رضی اللہ عنہ , the wife of the Prophet (ﷺ) intending thereby to please Allah's Messenger (ﷺ).",
        "malay_translation": "Apabila Rasulullah SAW ingin melakukan perjalanan, baginda akan mengundi nasib di antara isteri-isterinya dan akan membawa isteri yang terpilih. Baginda juga menetapkan sehari semalam untuk setiap isteri, namun Saudah binti Zam'ah telah memberikan hari dan malamnya kepada Aisyah رضي الله عنها, isteri Nabi SAW, dengan niat untuk menyenangkan Rasulullah SAW.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَرَادَ سَفَرًا أَقْرَعَ بَيْنَ نِسَائِهِ، فَأَيَّتُهُنَّ خَرَجَ سَهْمُهَا خَرَجَ بِهَا مَعَهُ، وَكَانَ يَقْسِمُ لِكُلِّ امْرَأَةٍ مِنْهُنَّ يَوْمَهَا وَلَيْلَتَهَا، غَيْرَ أَنَّ سَوْدَةَ بِنْتَ زَمْعَةَ وَهَبَتْ يَوْمَهَا وَلَيْلَتَهَا لِعَائِشَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم، تَبْتَغِي بِذَلِكَ رِضَا رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 2570,
        "hadith_number": "2689",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keutamaan Solat Berjemaah dan Keistimewaan Barisan Depan",
        "perawi_melayu": "Riwayat Abu Hurairah رضي الله عنه",
        "english_text": "Allah's Messenger (ﷺ) said, \"If the people knew what is the reward of making the call (for the prayer) and (of being in) the first row (in the prayer), and if they found no other way to get this privilege except by casting lots, they would certainly cast lots for it. If they knew the reward of the noon prayer, they would race for it, and if they knew the reward of the morning (i.e. Fajr) and `Isha prayers, they would present themselves for the prayer even if they had to crawl to reach there.",
        "malay_translation": "Rasulullah SAW bersabda, \"Sekiranya umat manusia mengetahui ganjaran yang besar bagi menyeru (mengangkat suara) azan dan untuk berada di barisan hadapan dalam solat berjemaah, dan jika mereka tidak menemui cara lain untuk mendapatkan keistimewaan ini melainkan dengan undian, nescaya mereka akan berundi untuknya. Sekiranya mereka mengetahui ganjaran solat Zuhur, mereka akan berlumba-lumba untuk mengerjakannya, dan sekiranya mereka mengetahui ganjaran solat Subuh dan Isyak, mereka akan hadir untuk menunaikan solat itu walaupun mereka perlu merangkak untuk sampai ke masjid.\"",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لَوْ يَعْلَمُ النَّاسُ مَا فِي النِّدَاءِ وَالصَّفِّ الأَوَّلِ، ثُمَّ لَمْ يَجِدُوا إِلاَّ أَنْ يَسْتَهِمُوا عَلَيْهِ لاَسْتَهَمُوا، وَلَوْ يَعْلَمُونَ مَا فِي التَّهْجِيرِ لاَسْتَبَقُوا إِلَيْهِ، وَلَوْ يَعْلَمُونَ مَا فِي الْعَتَمَةِ وَالصُّبْحِ لأَتَوْهُمَا وَلَوْ حَبْوًا ‏\"‏‏.‏"
      }
    ]
  }
}