{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 22,
    "data": [
      {
        "id": 2376,
        "hadith_number": "2483",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Tentera Kehabisan Bekalan Makanan dan Penemuan Ikan Besar",
        "perawi_melayu": "Diriwayatkan oleh Jabir bin `Abdullah رضی اللہ عنہ :",
        "english_text": "\"Allah's Messenger (ﷺ) sent an army towards the east coast and appointed Abu 'Ubaida bin Al-Jarrah رضی اللۀ عنۀ as their chief, and the army consisted of three-hundred men including myself. We marched on till we reached a place where our food was about to finish. Abu- 'Ubaida رضی اللۀ عنۀ ordered us to collect all the journey food and it was collected. My (our) journey food was dates. Abu 'Ubaida رضی اللۀ عنۀ kept on giving us our daily ration in small amounts from it, till it was exhausted. The share of everyone of us used to be one date only.\" I said, \"How could one date benefit you?\" Jabir رضی اللۀ عنۀ replied, \"We came to know its value when even that too finished.\" Jabir رضی اللۀ عنۀ added, \"When we reached the sea-shore, we saw a huge fish which was like a small mountain. The army ate from it for eighteen days. Then Abu 'Ubaida رضی اللۀ عنۀ ordered that two of its ribs be fixed and they were fixed in the ground. Then he ordered that a she-camel be ridden and it passed under the two ribs (forming an arch) without touching them.\"",
        "malay_translation": "\"Rasulullah (ﷺ) menghantar satu pasukan tentera ke arah pantai timur dan melantik Abu 'Ubaida bin Al-Jarrah رضی اللۀ عنۀ sebagai ketua mereka, dan pasukan tentera itu terdiri daripada tiga ratus orang termasuk saya sendiri. Kami bergerak sehingga kami tiba di suatu tempat di mana makanan kami hampir habis. Abu 'Ubaida رضی اللۀ عنۀ memerintahkan kami untuk mengumpulkan semua bekalan makanan perjalanan dan ia dikumpulkan. Bekalan makanan perjalanan saya (kami) adalah kurma. Abu 'Ubaida رضی اللۀ عنۀ terus memberi kami catuan harian kami dalam jumlah yang kecil daripadanya, sehingga ia habis. Bahagian setiap seorang daripada kami adalah sebiji kurma sahaja.\" Saya berkata, \"Bagaimana sebiji kurma boleh memberi manfaat kepada kamu?\" Jabir رضی اللۀ عنۀ menjawab, \"Kami mengetahui nilainya apabila walaupun itu juga habis.\" Jabir رضی اللۀ عنۀ menambah, \"Apabila kami tiba di pantai laut, kami melihat seekor ikan besar yang seperti gunung kecil. Pasukan tentera makan daripadanya selama lapan belas hari. Kemudian Abu 'Ubaida رضی اللۀ عنۀ memerintahkan agar dua tulang rusuknya ditegakkan dan ia ditegakkan di tanah. Kemudian beliau memerintahkan agar seekor unta betina ditunggang dan ia lalu di bawah dua tulang rusuk itu (membentuk gerbang) tanpa menyentuhnya.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ وَهْبِ بْنِ كَيْسَانَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّهُ قَالَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَعْثًا قِبَلَ السَّاحِلِ، فَأَمَّرَ عَلَيْهِمْ أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ وَهُمْ ثَلاَثُمِائَةٍ وَأَنَا فِيهِمْ، فَخَرَجْنَا حَتَّى إِذَا كُنَّا بِبَعْضِ الطَّرِيقِ فَنِيَ الزَّادُ، فَأَمَرَ أَبُو عُبَيْدَةَ بِأَزْوَادِ ذَلِكَ الْجَيْشِ فَجُمِعَ ذَلِكَ كُلُّهُ فَكَانَ مِزْوَدَىْ تَمْرٍ، فَكَانَ يُقَوِّتُنَا كُلَّ يَوْمٍ قَلِيلاً قَلِيلاً، حَتَّى فَنِيَ فَلَمْ يَكُنْ يُصِيبُنَا إِلاَّ تَمْرَةٌ تَمْرَةٌ‏.‏ فَقُلْتُ وَمَا تُغْنِي تَمْرَةٌ فَقَالَ لَقَدْ وَجَدْنَا فَقْدَهَا حِينَ فَنِيَتْ‏.‏ قَالَ ثُمَّ انْتَهَيْنَا إِلَى الْبَحْرِ فَإِذَا حُوتٌ مِثْلُ الظَّرِبِ، فَأَكَلَ مِنْهُ ذَلِكَ الْجَيْشُ ثَمَانِيَ عَشْرَةَ لَيْلَةً، ثُمَّ أَمَرَ أَبُو عُبَيْدَةَ بِضِلَعَيْنِ مِنْ أَضْلاَعِهِ فَنُصِبَا، ثُمَّ أَمَرَ بِرَاحِلَةٍ فَرُحِلَتْ ثُمَّ مَرَّتْ تَحْتَهُمَا فَلَمْ تُصِبْهُمَا‏.‏"
      },
      {
        "id": 2377,
        "hadith_number": "2484",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Mukjizat Makanan Diberkati Ketika Kehabisan Bekalan",
        "perawi_melayu": "Diriwayatkan oleh Salama رضی اللہ عنۈ :",
        "english_text": "Once (on a journey) our provisions diminished and the people were reduced to poverty. They went to the Prophet (ﷺ) and asked his permission to slaughter their camels, and he agreed. `Umar رضی اللۈ عنۈ met them and they told him about it, and he said, \"How would you survive after slaughtering your camels?\" Then he went to the Prophet and said, \"O Allah's Messenger (ﷺ)! How would they survive after slaughtering their camels?\" Allah's Messenger (ﷺ) ordered `Umar, \"Call upon the people to bring what has remained of their food.\" A leather sheet was spread and all the food was collected and heaped over it. Allah's Messenger (ﷺ) stood up and invoked Allah to bless it, and then directed all the people to come with their utensils, and they started taking from it till all of them got what was sufficient for them. Allah's Messenger (ﷺ) then said, \"I testify that None has the right to be worshipped but Allah, and I am His Messenger.\"",
        "malay_translation": "Pada suatu ketika (dalam perjalanan), bekalan kami berkurangan dan orang ramai menjadi miskin. Mereka pergi kepada Nabi (ﷺ) dan meminta izin baginda untuk menyembelih unta mereka, dan baginda bersetuju. Umar رضی اللۈ عنۈ bertemu mereka dan mereka memberitahunya tentang hal itu, dan beliau berkata, \"Bagaimana kamu akan bertahan hidup selepas menyembelih unta kamu?\" Kemudian beliau pergi kepada Nabi dan berkata, \"Wahai Rasulullah (ﷺ)! Bagaimana mereka akan bertahan hidup selepas menyembelih unta mereka?\" Rasulullah (ﷺ) memerintahkan Umar, \"Serulah orang ramai untuk membawa apa yang masih tinggal dari makanan mereka.\" Sehelai kulit (sebagai alas) dibentangkan dan semua makanan dikumpulkan dan ditimbun di atasnya. Rasulullah (ﷺ) berdiri dan berdoa kepada Allah untuk memberkatinya, dan kemudian mengarahkan semua orang untuk datang dengan bekas mereka, dan mereka mula mengambil daripadanya sehingga mereka semua mendapat apa yang mencukupi untuk mereka. Rasulullah (ﷺ) kemudian bersabda, \"Aku bersaksi bahawa tiada Tuhan yang berhak disembah melainkan Allah, dan aku adalah Rasul-Nya.\"",
        "arabic_text": "حَدَّثَنَا بِشْرُ بْنُ مَرْحُومٍ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ ـ رضى الله عنه ـ قَالَ خَفَّتْ أَزْوَادُ الْقَوْمِ وَأَمْلَقُوا، فَأَتَوُا النَّبِيَّ صلى الله عليه وسلم فِي نَحْرِ إِبِلِهِمْ فَأَذِنَ لَهُمْ، فَلَقِيَهُمْ عُمَرُ فَأَخْبَرُوهُ فَقَالَ مَا بَقَاؤُكُمْ بَعْدَ إِبِلِكُمْ، فَدَخَلَ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ مَا بَقَاؤُهُمْ بَعْدَ إِبِلِهِمْ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَادِ فِي النَّاسِ فَيَأْتُونَ بِفَضْلِ أَزْوَادِهِمْ ‏\"‏‏.‏ فَبُسِطَ لِذَلِكَ نِطَعٌ، وَجَعَلُوهُ عَلَى النِّطَعِ‏.‏ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَدَعَا وَبَرَّكَ عَلَيْهِ ثُمَّ دَعَاهُمْ بِأَوْعِيَتِهِمْ فَاحْتَثَى النَّاسُ حَتَّى فَرَغُوا، ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنِّي رَسُولُ اللَّهِ ‏\"‏‏.‏"
      },
      {
        "id": 2378,
        "hadith_number": "2485",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Asar Bersama Nabi dan Makan Daging Sebelum Matahari Terbenam",
        "perawi_melayu": "Rafi' bin Khadij RA",
        "english_text": "We used to offer the `Asr prayer with the Prophet (ﷺ) and slaughter a camel, the meat of which would be divided in ten parts. We would eat the cooked meat before sunset.",
        "malay_translation": "Kami biasa menunaikan solat Asar bersama Nabi (ﷺ) dan menyembelih seekor unta, yang dagingnya akan dibahagikan kepada sepuluh bahagian. Kami akan makan daging yang dimasak sebelum matahari terbenam.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا الأَوْزَاعِيُّ، حَدَّثَنَا أَبُو النَّجَاشِيِّ، قَالَ سَمِعْتُ رَافِعَ بْنَ خَدِيجٍ ـ رضى الله عنه ـ قَالَ كُنَّا نُصَلِّي مَعَ النَّبِيِّ صلى الله عليه وسلم الْعَصْرَ فَنَنْحَرُ جَزُورًا، فَتُقْسَمُ عَشْرَ قِسَمٍ، فَنَأْكُلُ لَحْمًا نَضِيجًا قَبْلَ أَنْ تَغْرُبَ الشَّمْسُ‏.‏"
      },
      {
        "id": 2379,
        "hadith_number": "2486",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Sifat Pemurah dan Kerjasama Suku Asy'ari",
        "perawi_melayu": "Diriwayatkan oleh Abu Musa Radiyallahu 'anhu:",
        "english_text": "The Prophet (ﷺ) said, \"When the people of Ash`ari tribe ran short of food during the holy battles, or the food of their families in Medina ran short, they would collect all their remaining food in one sheet and then distribute it among themselves equally by measuring it with a bowl. So, these people are from me, and I am from them.\"",
        "malay_translation": "Nabi Muhammad ﷺ bersabda, \"Apabila penduduk suku Asy'ari kekurangan makanan semasa peperangan suci, atau makanan keluarga mereka di Madinah berkurangan, mereka akan mengumpulkan semua makanan yang tinggal di atas satu kain dan kemudian mengagihkannya sesama mereka secara sama rata dengan menyukatnya dengan mangkuk. Maka, orang-orang ini adalah daripada ku, dan aku daripada mereka.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا حَمَّادُ بْنُ أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّ الأَشْعَرِيِّينَ إِذَا أَرْمَلُوا فِي الْغَزْوِ، أَوْ قَلَّ طَعَامُ عِيَالِهِمْ بِالْمَدِينَةِ جَمَعُوا مَا كَانَ عِنْدَهُمْ فِي ثَوْبٍ وَاحِدٍ، ثُمَّ اقْتَسَمُوهُ بَيْنَهُمْ فِي إِنَاءٍ وَاحِدٍ بِالسَّوِيَّةِ، فَهُمْ مِنِّي وَأَنَا مِنْهُمْ ‏\"‏‏.‏"
      },
      {
        "id": 2380,
        "hadith_number": "2487",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kewajipan Zakat ke atas Harta Perkongsian",
        "perawi_melayu": "Diriwayatkan oleh Anas RA:",
        "english_text": "Abu Bakr As-Siddiq رضی اللہ عنہ wrote to him the law of Zakat which was made obligatory by Allah's Apostle. He wrote: 'Partners possessing joint property (sheep) have to pay its Zakat equally.",
        "malay_translation": "Abu Bakr As-Siddiq RA telah menulis kepadanya hukum Zakat yang telah diwajibkan oleh Rasulullah SAW. Beliau menulis: 'Rakan kongsi yang memiliki harta bersama (kambing) wajib membayar Zakatnya secara sama rata.'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُثَنَّى، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي ثُمَامَةُ بْنُ عَبْدِ اللَّهِ بْنِ أَنَسٍ، أَنَّ أَنَسًا، حَدَّثَهُ أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ كَتَبَ لَهُ فَرِيضَةَ الصَّدَقَةِ الَّتِي فَرَضَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ وَمَا كَانَ مِنْ خَلِيطَيْنِ فَإِنَّهُمَا يَتَرَاجَعَانِ بَيْنَهُمَا بِالسَّوِيَّةِ ‏\"‏‏.‏"
      },
      {
        "id": 2381,
        "hadith_number": "2488",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukum Menyembelih Haiwan dengan Buluh dan Menembak Haiwan Buruan yang Melarikan Diri",
        "perawi_melayu": "Diriwayatkan oleh 'Abaya bin Rafa'a bin Raft' bin Khadij Radiyallahu 'anhu:",
        "english_text": "\"We were in the company of the Prophet (ﷺ) at Dhul-Hulaifa. The people felt hungry and captured some camels and sheep (as booty). The Prophet (ﷺ) was behind the people. They hurried and slaughtered the animals and put their meat in pots and started cooking it. (When the Prophet came) he ordered the pots to be upset and then he distributed the animals (of the booty), regarding ten sheep as equal to one camel. One of the camels fled and the people ran after it till they were exhausted. At that time there were few horses. A man threw an arrow at the camel, and Allah stopped the camel with it. The Prophet (ﷺ) said, \"Some of these animals are like wild animals, so if you lose control over one of these animals, treat it in this way (i.e. shoot it with an arrow).\" Before distributing them among the soldiers my grandfather said, \"We may meet the enemies in the future and have no knives; can we slaughter the animals with reeds?\" The Prophet (ﷺ) said, \"Use whatever causes blood to flow, and eat the animals if the name of Allah has been mentioned on slaughtering them. Do not slaughter with teeth or fingernails and I will tell you why: It is because teeth are bones (i.e. cannot cut properly) and fingernails are the tools used by the Ethiopians (whom we should not imitate for they are infidels).",
        "malay_translation": "Kami bersama Nabi (ﷺ) di Zul-Hulaifa. Orang ramai merasa lapar dan menangkap beberapa unta dan kambing (sebagai harta rampasan). Nabi (ﷺ) berada di belakang orang ramai. Mereka bergegas dan menyembelih haiwan-haiwan itu dan meletakkan daging mereka di dalam periuk dan mula memasaknya. (Ketika Nabi datang) baginda memerintahkan periuk-periuk itu diterbalikkan dan kemudian baginda mengagihkan haiwan-haiwan itu (dari harta rampasan), menganggap sepuluh kambing sama dengan satu unta. Salah satu unta melarikan diri dan orang ramai mengejarnya sehingga mereka keletihan. Pada masa itu terdapat sedikit kuda. Seorang lelaki melemparkan anak panah ke unta itu, dan Allah menghentikan unta itu dengannya. Nabi (ﷺ) bersabda, \"Sesetengah haiwan ini seperti haiwan liar, jadi jika kamu kehilangan kawalan ke atas salah satu haiwan ini, layanlah ia dengan cara ini (iaitu tembaklah ia dengan anak panah).\" Sebelum mengagihkan mereka di kalangan tentera datuk saya berkata, \"Kita mungkin bertemu musuh pada masa akan datang dan tidak mempunyai pisau; bolehkah kita menyembelih haiwan dengan buluh?\" Nabi (ﷺ) bersabda, \"Gunakan apa sahaja yang menyebabkan darah mengalir, dan makanlah haiwan-haiwan itu jika nama Allah telah disebut ketika menyembelihnya. Jangan menyembelih dengan gigi atau kuku dan saya akan memberitahu kamu mengapa: Ini kerana gigi adalah tulang (iaitu tidak dapat memotong dengan betul) dan kuku adalah alat yang digunakan oleh orang Habsyah (yang tidak patut kita tiru kerana mereka adalah orang kafir).",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ الْحَكَمِ الأَنْصَارِيُّ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سَعِيدِ بْنِ مَسْرُوقٍ، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعِ بْنِ خَدِيجٍ، عَنْ جَدِّهِ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم بِذِي الْحُلَيْفَةِ فَأَصَابَ النَّاسَ جُوعٌ فَأَصَابُوا إِبِلاً وَغَنَمًا‏.‏ قَالَ وَكَانَ النَّبِيُّ صلى الله عليه وسلم فِي أُخْرَيَاتِ الْقَوْمِ فَعَجِلُوا وَذَبَحُوا وَنَصَبُوا الْقُدُورَ، فَأَمَرَ النَّبِيُّ صلى الله عليه وسلم بِالْقُدُورِ فَأُكْفِئَتْ، ثُمَّ قَسَمَ فَعَدَلَ عَشْرَةً مِنَ الْغَنَمِ بِبَعِيرٍ فَنَدَّ مِنْهَا بَعِيرٌ، فَطَلَبُوهُ فَأَعْيَاهُمْ، وَكَانَ فِي الْقَوْمِ خَيْلٌ يَسِيرَةٌ فَأَهْوَى رَجُلٌ مِنْهُمْ بِسَهْمٍ فَحَبَسَهُ اللَّهُ ثُمَّ قَالَ ‏\"‏ إِنَّ لِهَذِهِ الْبَهَائِمِ أَوَابِدَ كَأَوَابِدِ الْوَحْشِ فَمَا غَلَبَكُمْ مِنْهَا فَاصْنَعُوا بِهِ هَكَذَا ‏\"‏‏.‏ فَقَالَ جَدِّي إِنَّا نَرْجُو ـ أَوْ نَخَافُ ـ الْعَدُوَّ غَدًا، وَلَيْسَتْ مَعَنَا مُدًى أَفَنَذْبَحُ بِالْقَصَبِ‏.‏ قَالَ ‏\"‏ مَا أَنْهَرَ الدَّمَ وَذُكِرَ اسْمُ اللَّهِ عَلَيْهِ، فَكُلُوهُ، لَيْسَ السِّنَّ وَالظُّفُرَ، وَسَأُحَدِّثُكُمْ عَنْ ذَلِكَ، أَمَّا السِّنُّ فَعَظْمٌ وَأَمَّا الظُّفُرُ فَمُدَى الْحَبَشَةِ ‏\"‏‏.‏"
      },
      {
        "id": 2382,
        "hadith_number": "2489",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Makan Dua Kurma Serentak Kecuali dengan Izin Rakan",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Umar رضی اللہ عنهما :",
        "english_text": "The Prophet (ﷺ) decreed that one should not eat two dates together at a time unless he gets the permission from his companions (sharing the meal with him).",
        "malay_translation": "Rasulullah (ﷺ) telah menetapkan bahawa seseorang tidak boleh makan dua biji kurma sekaligus melainkan dia mendapat izin daripada sahabat-sahabatnya (yang berkongsi hidangan dengannya).",
        "arabic_text": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا جَبَلَةُ بْنُ سُحَيْمٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ يَقْرُنَ الرَّجُلُ بَيْنَ التَّمْرَتَيْنِ جَمِيعًا، حَتَّى يَسْتَأْذِنَ أَصْحَابَهُ‏.‏"
      },
      {
        "id": 2383,
        "hadith_number": "2490",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Adab Makan Kurma dalam Majlis",
        "perawi_melayu": "Diriwayatkan oleh Jabala:",
        "english_text": "\"While at Medina we were struck with famine. Ibn Az-Zubair used to provide us with dates as our food. Ibn `Umar رضی اللہ عنۅما used to pass by us and say, \"Don't eat two dates together at a time as the Prophet (ﷺ) has forbidden eating two dates together at a time (in a gathering) unless one takes the permission of one's companion brother.\"",
        "malay_translation": "Ketika kami berada di Madinah, kami dilanda kelaparan. Ibn Az-Zubair biasanya membekalkan kami dengan kurma sebagai makanan kami. Ibn Umar رضي الله عنهما biasanya melewati kami dan berkata, \"Jangan makan dua biji kurma sekaligus kerana Nabi ﷺ telah melarang makan dua biji kurma sekaligus (dalam suatu majlis) kecuali seseorang itu meminta izin daripada saudaranya (dalam majlis tersebut).\"",
        "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ جَبَلَةَ، قَالَ كُنَّا بِالْمَدِينَةِ فَأَصَابَتْنَا سَنَةٌ، فَكَانَ ابْنُ الزُّبَيْرِ يَرْزُقُنَا التَّمْرَ، وَكَانَ ابْنُ عُمَرَ يَمُرُّ بِنَا فَيَقُولُ لاَ تَقْرُنُوا فَإِنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ الإِقْرَانِ، إِلاَّ أَنْ يَسْتَأْذِنَ الرَّجُلُ مِنْكُمْ أَخَاهُ‏.‏"
      },
      {
        "id": 2384,
        "hadith_number": "2491",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Memerdekakan Hamba yang Dimiliki Bersama",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Umar رضی اللہ عنهما :",
        "english_text": "\"Allah's Messenger (ﷺ) said, 'If one manumits his share of a jointly possessed slave, and can afford the price of the other shares according to the adequate price of the slave, the slave will be completely manumitted; otherwise he will be partially manumitted.' \" (Aiyub, a sub-narrator is not sure whether the saying \" ... otherwise he will be partially manumitted\" was said by Nafi` or the Prophet.)",
        "malay_translation": "Rasulullah (ﷺ) bersabda, 'Jika seseorang memerdekakan bahagiannya dalam seorang hamba yang dimiliki bersama, dan mampu membayar harga bahagian-bahagian lain mengikut harga yang wajar bagi hamba tersebut, maka hamba itu akan dimerdekakan sepenuhnya; jika tidak, dia akan dimerdekakan sebahagian sahaja.' \" (Aiyub, seorang sub-periwayat tidak pasti sama ada perkataan \" ... jika tidak, dia akan dimerdekakan sebahagian sahaja\" dikatakan oleh Nafi` atau Nabi.)",
        "arabic_text": "حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ أَعْتَقَ شِقْصًا لَهُ مِنْ عَبْدٍ ـ أَوْ شِرْكًا أَوْ قَالَ نَصِيبًا ـ وَكَانَ لَهُ مَا يَبْلُغُ ثَمَنَهُ بِقِيمَةِ الْعَدْلِ، فَهْوَ عَتِيقٌ، وَإِلاَّ فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ ‏\"‏‏.‏ قَالَ لاَ أَدْرِي قَوْلُهُ عَتَقَ مِنْهُ مَا عَتَقَ‏.‏ قَوْلٌ مِنْ نَافِعٍ أَوْ فِي الْحَدِيثِ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 2385,
        "hadith_number": "2492",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Memerdekakan Hamba yang Dimiliki Bersama",
        "perawi_melayu": "Diriwayatkan oleh Abu Huraira:",
        "english_text": "The Prophet (ﷺ) said, \"Whoever manumits his share of a jointly possessed slave, it is imperative for him to get that slave manumitted completely by paying the remaining price, and if he does not have sufficient money to manumit him, then the price of the slave should be estimated justly, and he is to be allowed to work and earn the amount that will manumit him (without overburdening him)\".",
        "malay_translation": "Nabi (ﷺ) bersabda, \"Sesiapa yang memerdekakan bahagiannya dalam seorang hamba yang dimiliki bersama, maka wajib baginya untuk memerdekakan hamba tersebut sepenuhnya dengan membayar harga yang selebihnya. Jika dia tidak mempunyai wang yang mencukupi untuk memerdekakannya, maka harga hamba itu hendaklah dianggarkan dengan adil, dan dia dibenarkan untuk bekerja dan mendapatkan jumlah yang akan memerdekakannya (tanpa membebankannya)\".",
        "arabic_text": "حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَعْتَقَ شَقِيصًا مِنْ مَمْلُوكِهِ فَعَلَيْهِ خَلاَصُهُ فِي مَالِهِ، فَإِنْ لَمْ يَكُنْ لَهُ مَالٌ قُوِّمَ الْمَمْلُوكُ، قِيمَةَ عَدْلٍ ثُمَّ اسْتُسْعِيَ غَيْرَ مَشْقُوقٍ عَلَيْهِ ‏\"‏‏.‏"
      },
      {
        "id": 2386,
        "hadith_number": "2493",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perumpamaan Orang yang Mematuhi Perintah Allah dan Orang yang Melanggarnya",
        "perawi_melayu": "Diriwayatkan oleh An-Nu'man bin Bashir رضي الله عنه :",
        "english_text": "The Prophet (ﷺ) said, \"The example of the person abiding by Allah's order and restrictions in comparison to those who violate them is like the example of those persons who drew lots for their seats in a boat. Some of them got seats in the upper part, and the others in the lower. When the latter needed water, they had to go up to bring water (and that troubled the others), so they said, 'Let us make a hole in our share of the ship (and get water) saving those who are above us from troubling them. So, if the people in the upper part left the others do what they had suggested, all the people of the ship would be destroyed, but if they prevented them, both parties would be safe.\"",
        "malay_translation": "Nabi Muhammad ﷺ bersabda, \"Perbandingan antara orang yang menjaga perintah Allah dan batasan-batasan-Nya dengan orang yang melanggarnya adalah seperti sekumpulan orang yang melakukan undian untuk menentukan tempat duduk mereka di dalam sebuah kapal. Sebahagian mendapat tempat di bahagian atas kapal, dan sebahagian lagi di bahagian bawah. Apabila orang-orang di bahagian bawah memerlukan air, mereka perlu naik ke bahagian atas untuk mengambil air, yang mana ini menyusahkan orang-orang di atas. Lalu mereka berkata, 'Mari kita tebuk lubang di bahagian kita kapal ini supaya kita boleh mendapatkan air dan tidak menyusahkan orang-orang di atas.' Sekiranya orang-orang di bahagian atas membiarkan mereka melakukan cadangan tersebut, nescaya semua orang di dalam kapal itu akan binasa. Tetapi sekiranya mereka menghalang perbuatan tersebut, maka semua akan selamat.\"",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا زَكَرِيَّاءُ، قَالَ سَمِعْتُ عَامِرًا، يَقُولُ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَثَلُ الْقَائِمِ عَلَى حُدُودِ اللَّهِ وَالْوَاقِعِ فِيهَا كَمَثَلِ قَوْمٍ اسْتَهَمُوا عَلَى سَفِينَةٍ، فَأَصَابَ بَعْضُهُمْ أَعْلاَهَا وَبَعْضُهُمْ أَسْفَلَهَا، فَكَانَ الَّذِينَ فِي أَسْفَلِهَا إِذَا اسْتَقَوْا مِنَ الْمَاءِ مَرُّوا عَلَى مَنْ فَوْقَهُمْ فَقَالُوا لَوْ أَنَّا خَرَقْنَا فِي نَصِيبِنَا خَرْقًا، وَلَمْ نُؤْذِ مَنْ فَوْقَنَا‏.‏ فَإِنْ يَتْرُكُوهُمْ وَمَا أَرَادُوا هَلَكُوا جَمِيعًا، وَإِنْ أَخَذُوا عَلَى أَيْدِيهِمْ نَجَوْا وَنَجَوْا جَمِيعًا ‏\"‏‏.‏"
      },
      {
        "id": 2387,
        "hadith_number": "2494",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Penjelasan Aisyah tentang Ayat Al-Quran mengenai Perkahwinan dengan Anak Yatim Perempuan dan Keadilan",
        "perawi_melayu": "Diriwayatkan oleh Urwa bin Zubair:",
        "english_text": "He had asked `Aisha about the meaning of the Statement of Allah: \"If you fear that you shall not Be able to deal justly With the orphan girls, then Marry (Other) women of your choice Two or three or four.\" (4.3) She said, \"O my nephew! This is about the orphan girl who lives with her guardian and shares his property. Her wealth and beauty may tempt him to marry her without giving her an adequate Mahr (bridal-money) which might have been given by another suitor. So, such guardians were forbidden to marry such orphan girls unless they treated them justly and gave them the most suitable Mahr; otherwise they were ordered to marry any other woman.\" `Aisha further said, \"After that verse the people again asked the Prophet (about the marriage with orphan 'girls), so Allah revealed the following verses:-- 'They ask your instruction Concerning the women. Say: Allah Instructs you about them And about what is Recited unto you In the Book, concerning The orphan girls to whom You give not the prescribed portions and yet whom you Desire to marry...\" (4.127) What is meant by Allah's Saying:-- 'And about what is Recited unto you is the former verse which goes:-- 'If you fear that you shall not Be able to deal justly With the orphan girls, then Marry (other) women of your choice.' (4.3) `Aisha said, \"Allah's saying in the other verse:--'Yet whom you desire to marry' (4.127) means the desire of the guardian to marry an orphan girl under his supervision when she has not much property or beauty (in which case he should treat her justly). The guardians were forbidden to marry their orphan girls possessing property and beauty without being just to them, as they generally refrain from marrying them (when they are neither beautiful nor wealthy).",
        "malay_translation": "Beliau bertanya kepada Aisyah mengenai makna Firman Allah: \"Dan jika kamu takut tidak akan dapat berlaku adil terhadap perempuan-perempuan yatim (apabila kamu mengahwini mereka), maka kahwinilah perempuan-perempuan lain yang kamu senangi; dua, tiga atau empat.\" (4:3). Aisyah berkata, \"Wahai anak saudaraku! Ini adalah mengenai anak yatim perempuan yang tinggal bersama walinya dan berkongsi hartanya. Kekayaan dan kecantikannya mungkin menggoda walinya untuk menikahinya tanpa memberikan mahar yang sepatutnya yang mungkin telah diberikan oleh peminang lain. Oleh itu, wali-wali seperti itu dilarang untuk menikahi anak yatim perempuan seperti itu kecuali jika mereka memperlakukan mereka dengan adil dan memberikan mereka mahar yang paling sesuai; jika tidak, mereka diperintahkan untuk menikahi wanita lain.\" Aisyah selanjutnya berkata, \"Setelah ayat itu, orang-orang bertanya lagi kepada Nabi (mengenai perkahwinan dengan anak yatim perempuan), maka Allah menurunkan ayat-ayat berikut:-- 'Dan mereka meminta fatwa kepadamu mengenai perempuan. Katakanlah: Allah memberi fatwa kepadamu mengenai mereka dan apa yang dibacakan kepadamu dalam Kitab mengenai perempuan-perempuan yatim yang kamu tidak memberikan kepada mereka bahagian yang ditetapkan dan kamu ingin menikahi mereka...\" (4:127). Apa yang dimaksudkan dengan Firman Allah:-- 'Dan apa yang dibacakan kepadamu adalah ayat terdahulu yang berbunyi:-- 'Dan jika kamu takut tidak akan dapat berlaku adil terhadap perempuan-perempuan yatim, maka kahwinilah perempuan-perempuan lain yang kamu senangi.' (4:3). Aisyah berkata, \"Firman Allah dalam ayat yang lain:-- 'Namun kamu ingin menikahi mereka' (4:127) bermaksud keinginan wali untuk menikahi anak yatim perempuan di bawah pengawasannya ketika dia tidak memiliki banyak harta atau kecantikan (dalam hal ini dia harus memperlakukannya dengan adil). Para wali dilarang menikahi anak yatim perempuan mereka yang memiliki harta dan kecantikan tanpa berlaku adil kepada mereka, kerana mereka umumnya menahan diri dari menikahi mereka (ketika mereka tidak cantik mahupun kaya).\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ الْعَامِرِيُّ الأُوَيْسِيُّ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُرْوَةُ، أَنَّهُ سَأَلَ عَائِشَةَ ـ رضى الله عنها ـ وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ عَنِ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّهُ سَأَلَ عَائِشَةَ ـ رضى الله عنها ـ عَنْ قَوْلِ اللَّهِ تَعَالَى ‏{‏وَإِنْ خِفْتُمْ‏}‏ إِلَى ‏{‏وَرُبَاعَ‏}‏‏.‏ فَقَالَتْ يَا ابْنَ أُخْتِي هِيَ الْيَتِيمَةُ تَكُونُ فِي حَجْرِ وَلِيِّهَا تُشَارِكُهُ فِي مَالِهِ، فَيُعْجِبُهُ مَالُهَا وَجَمَالُهَا، فَيُرِيدُ وَلِيُّهَا أَنْ يَتَزَوَّجَهَا بِغَيْرِ أَنْ يُقْسِطَ فِي صَدَاقِهَا، فَيُعْطِيهَا مِثْلَ مَا يُعْطِيهَا غَيْرُهُ، فَنُهُوا أَنْ يَنْكِحُوهُنَّ إِلاَّ أَنْ يُقْسِطُوا لَهُنَّ وَيَبْلُغُوا بِهِنَّ أَعْلَى سُنَّتِهِنَّ مِنَ الصَّدَاقِ، وَأُمِرُوا أَنْ يَنْكِحُوا مَا طَابَ لَهُمْ مِنَ النِّسَاءِ سِوَاهُنَّ‏.‏ قَالَ عُرْوَةُ قَالَتْ عَائِشَةُ ثُمَّ إِنَّ النَّاسَ اسْتَفْتَوْا رَسُولَ اللَّهِ صلى الله عليه وسلم بَعْدَ هَذِهِ الآيَةِ فَأَنْزَلَ اللَّهُ ‏{‏وَيَسْتَفْتُونَكَ فِي النِّسَاءِ‏}‏ إِلَى قَوْلِهِ ‏{‏وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ‏}‏ وَالَّذِي ذَكَرَ اللَّهُ أَنَّهُ يُتْلَى عَلَيْكُمْ فِي الْكِتَابِ الآيَةُ الأُولَى الَّتِي قَالَ فِيهَا ‏{‏وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ‏}‏ قَالَتْ عَائِشَةُ وَقَوْلُ اللَّهِ فِي الآيَةِ الأُخْرَى ‏{‏وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ‏}‏ يَعْنِي هِيَ رَغْبَةُ أَحَدِكُمْ لِيَتِيمَتِهِ الَّتِي تَكُونُ فِي حَجْرِهِ، حِينَ تَكُونُ قَلِيلَةَ الْمَالِ وَالْجَمَالِ، فَنُهُوا أَنْ يَنْكِحُوا مَا رَغِبُوا فِي مَالِهَا وَجَمَالِهَا مِنْ يَتَامَى النِّسَاءِ إِلاَّ بِالْقِسْطِ مِنْ، أَجْلِ رَغْبَتِهِمْ عَنْهُنَّ‏.‏"
      },
      {
        "id": 2388,
        "hadith_number": "2495",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hak Keutamaan dalam Harta Bersama",
        "perawi_melayu": "Diriwayatkan oleh Jabir bin `Abdullah رضی اللہ عنهما :",
        "english_text": "The Prophet (ﷺ) established the right of Shu'fa (i.e. Preemption) in joint properties; but when the land is divided and the ways are demarcated, then there is no pre-emption.",
        "malay_translation": "Nabi Muhammad (ﷺ) menetapkan hak Syuf'ah (iaitu hak keutamaan) dalam harta perkongsian; tetapi apabila tanah itu telah dibahagikan dan jalan-jalan telah ditentukan, maka tidak ada lagi hak keutamaan.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ إِنَّمَا جَعَلَ النَّبِيُّ صلى الله عليه وسلم الشُّفْعَةَ فِي كُلِّ مَا لَمْ يُقْسَمْ، فَإِذَا وَقَعَتِ الْحُدُودُ وَصُرِّفَتِ الطُّرُقُ فَلاَ شُفْعَةَ‏.‏"
      },
      {
        "id": 2389,
        "hadith_number": "2496",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hak Keutamaan dalam Harta Perkongsian dan Batasannya",
        "perawi_melayu": "Diriwayatkan oleh Jabir bin `Abdullah رضی اللۈه عنهما :",
        "english_text": "The Prophet (ﷺ) said, \"The right of preemption is valid in every joint property, but when the land is divided and the way is demarcated, then there is no right of pre-emption.\"",
        "malay_translation": "Nabi Muhammad (ﷺ) bersabda, \"Hak keutamaan adalah sah dalam setiap harta perkongsian, tetapi apabila tanah itu dibahagikan dan jalan telah ditentukan, maka tidak ada lagi hak keutamaan.\"",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ قَضَى النَّبِيُّ صلى الله عليه وسلم بِالشُّفْعَةِ فِي كُلِّ مَا لَمْ يُقْسَمْ، فَإِذَا وَقَعَتِ الْحُدُودُ وَصُرِّفَتِ الطُّرُقُ فَلاَ شُفْعَةَ‏.‏"
      },
      {
        "id": 2390,
        "hadith_number": "2497, 2498",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukum Pertukaran Tunai dan Kredit",
        "perawi_melayu": "Diriwayatkan oleh Sulaiman bin Abu Muslim:",
        "english_text": "I asked Abu Minhal about money exchange from hand to hand. He said, \"I and a partner of mine bought something partly in cash and partly on credit.\" Al-Bara' bin `Azib passed by us and we asked about it. He replied, \"I and my partner Zaid bin Al-Arqam رضی اللہ عنۈ did the same and then went to the Prophet (ﷺ) and asked him about it. He said, 'Take what was from hand to hand and leave what was on credit.' \"",
        "malay_translation": "Saya bertanya kepada Abu Minhal tentang pertukaran wang secara tunai. Beliau berkata, \"Saya dan rakan kongsi saya membeli sesuatu sebahagian secara tunai dan sebahagian lagi secara kredit.\" Al-Bara' bin `Azib melalui kami dan kami bertanya tentang hal itu. Beliau menjawab, \"Saya dan rakan kongsi saya Zaid bin Al-Arqam RA melakukan perkara yang sama dan kemudian pergi kepada Nabi SAW dan bertanya tentang hal itu. Baginda bersabda, 'Ambillah yang tunai dan tinggalkan yang kredit.' \"",
        "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ عُثْمَانَ يَعْنِي ابْنَ الأَسْوَدِ، قَالَ أَخْبَرَنِي سُلَيْمَانُ بْنُ أَبِي مُسْلِمٍ، قَالَ سَأَلْتُ أَبَا الْمِنْهَالِ عَنِ الصَّرْفِ، يَدًا بِيَدٍ فَقَالَ اشْتَرَيْتُ أَنَا وَشَرِيكٌ، لِي شَيْئًا يَدًا بِيَدٍ وَنَسِيئَةً، فَجَاءَنَا الْبَرَاءُ بْنُ عَازِبٍ فَسَأَلْنَاهُ، فَقَالَ فَعَلْتُ أَنَا وَشَرِيكِي زَيْدُ بْنُ أَرْقَمَ، وَسَأَلْنَا النَّبِيَّ صلى الله عليه وسلم عَنْ ذَلِكَ فَقَالَ ‏ \"‏ مَا كَانَ يَدًا بِيَدٍ فَخُذُوهُ، وَمَا كَانَ نَسِيئَةً فَذَرُوهُ ‏\"‏‏.‏"
      },
      {
        "id": 2391,
        "hadith_number": "2499",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Penyewaan Tanah Khaibar kepada Yahudi dengan Pembahagian Hasil",
        "perawi_melayu": "Diriwayatkan dari Abdullah رضی اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) rented the land of Khaibar to the Jews on the condition that they would work on it and cultivate it and take half of its yield.",
        "malay_translation": "Rasulullah (ﷺ) menyewakan tanah Khaibar kepada orang Yahudi dengan syarat mereka akan mengerjakan dan mengusahakannya serta mengambil separuh dari hasilnya.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ أَعْطَى رَسُولُ اللَّهِ صلى الله عليه وسلم خَيْبَرَ الْيَهُودَ أَنْ يَعْمَلُوهَا وَيَزْرَعُوهَا وَلَهُمْ شَطْرُ مَا يَخْرُجُ مِنْهَا‏.‏"
      },
      {
        "id": 2392,
        "hadith_number": "2500",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perintah Mengorbankan Anak Kambing yang Tertinggal",
        "perawi_melayu": "Diriwayatkan daripada `Uqba bin 'Amir رضی اللہ عنۀ :",
        "english_text": "Allah's Messenger (ﷺ) gave him some sheep to distribute among his companions in order to sacrifice them and a kid was left. He told the Prophet (ﷺ) about it and the Prophet (ﷺ) said to him, \"Sacrifice it on your behalf.\"",
        "malay_translation": "Rasulullah (ﷺ) memberikan kepadanya beberapa ekor kambing untuk diagihkan kepada sahabat-sahabatnya untuk dikorbankan dan seekor anak kambing tertinggal. Beliau memberitahu Nabi (ﷺ) tentang hal itu dan Nabi (ﷺ) bersabda kepadanya, \"Korbankanlah ia bagi pihak kamu.\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَعْطَاهُ غَنَمًا يَقْسِمُهَا عَلَى صَحَابَتِهِ ضَحَايَا، فَبَقِيَ عَتُودٌ فَذَكَرَهُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ ضَحِّ بِهِ أَنْتَ ‏\"‏‏.‏"
      },
      {
        "id": 2393,
        "hadith_number": "2501, 2502",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Berkat Doa Nabi SAW untuk Abdullah bin Hisham Ketika Kecil",
        "perawi_melayu": "`Abdullah bin Hisham رضی اللہ عنۈ",
        "english_text": "His mother Zainab bint Humaid took him to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Take the pledge of allegiance from him.\" But he said, \"He is still too young for the pledge,\" and passed his hand on his (i.e. `Abdullah's) head and invoked for Allah's blessing for him. Zuhra bin Ma`bad stated that he used to go with his grandfather, `Abdullah bin Hisham رضی اللہ عنۈ , to the market to buy foodstuff. Ibn `Umar and Ibn Az-Zubair رضی اللۈ عنهم would meet him and say to him, \"Be our partner, as the Prophet (ﷺ) invoked Allah to bless you.\" So, he would be their partner, and very often he would win a camel's load and send it home.",
        "malay_translation": "Ibunya, Zainab binti Humaid, membawa beliau kepada Nabi (ﷺ) dan berkata, \"Wahai Rasulullah (ﷺ)! Terimalah baiah daripadanya.\" Tetapi baginda bersabda, \"Dia masih terlalu muda untuk baiah,\" dan baginda mengusap tangannya di atas kepala Abdullah dan mendoakan keberkatan Allah untuknya. Zuhra bin Ma'bad menyatakan bahawa beliau sering pergi bersama datuknya, Abdullah bin Hisham رضی اللۈ عنهم, ke pasar untuk membeli barang makanan. Ibn Umar dan Ibn Az-Zubair رضی اللۈ عنهم akan bertemu dengannya dan berkata kepadanya, \"Jadilah rakan kongsi kami, kerana Nabi (ﷺ) telah mendoakan keberkatan Allah untukmu.\" Maka, beliau akan menjadi rakan kongsi mereka, dan sangat sering beliau akan mendapat muatan unta dan menghantarnya pulang.",
        "arabic_text": "حَدَّثَنَا أَصْبَغُ بْنُ الْفَرَجِ، قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ وَهْبٍ، قَالَ أَخْبَرَنِي سَعِيدٌ، عَنْ زُهْرَةَ بْنِ مَعْبَدٍ، عَنْ جَدِّهِ عَبْدِ اللَّهِ بْنِ هِشَامٍ ـ وَكَانَ قَدْ أَدْرَكَ النَّبِيَّ صلى الله عليه وسلم ـ وَذَهَبَتْ بِهِ أُمُّهُ زَيْنَبُ بِنْتُ حُمَيْدٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ بَايِعْهُ‏.‏ فَقَالَ ‏ \"‏ هُوَ صَغِيرٌ ‏\"‏‏.‏ فَمَسَحَ رَأْسَهُ وَدَعَا لَهُ‏.‏ وَعَنْ زُهْرَةَ بْنِ مَعْبَدٍ، أَنَّهُ كَانَ يَخْرُجُ بِهِ جَدُّهُ عَبْدُ اللَّهِ بْنُ هِشَامٍ إِلَى السُّوقِ فَيَشْتَرِي الطَّعَامَ فَيَلْقَاهُ ابْنُ عُمَرَ وَابْنُ الزُّبَيْرِ ـ رضى الله عنهم ـ فَيَقُولاَنِ لَهُ أَشْرِكْنَا، فَإِنَّ النَّبِيَّ صلى الله عليه وسلم قَدْ دَعَا لَكَ بِالْبَرَكَةِ فَيَشْرَكُهُمْ، فَرُبَّمَا أَصَابَ الرَّاحِلَةَ كَمَا هِيَ، فَيَبْعَثُ بِهَا إِلَى الْمَنْزِلِ‏.‏"
      },
      {
        "id": 2394,
        "hadith_number": "2503",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kewajipan Memerdekakan Hamba Sahaya Milik Bersama",
        "perawi_melayu": "Diriwayatkan oleh Ibn Umar رضي الله عنهما:",
        "english_text": "The Prophet (ﷺ) said, \"Whoever manumits his share o a jointly possessed slave, it is imperative on him to manumit the slave completely if he has sufficient money to pay the rest of its price which is to be estimated justly. He should pay his partners their shares and release him (the freed one).",
        "malay_translation": "Nabi (ﷺ) bersabda, \"Sesiapa yang memerdekakan bahagiannya dalam hamba sahaya yang dimiliki bersama, maka wajib ke atasnya untuk memerdekakan hamba itu sepenuhnya jika dia mempunyai wang yang mencukupi untuk membayar baki harga hamba itu yang akan dianggarkan dengan adil. Dia hendaklah membayar bahagian rakan-rakannya dan membebaskannya (hamba yang dibebaskan itu).\"",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَعْتَقَ شِرْكًا لَهُ فِي مَمْلُوكٍ وَجَبَ عَلَيْهِ أَنْ يُعْتِقَ كُلَّهُ، إِنْ كَانَ لَهُ مَالٌ قَدْرَ ثَمَنِهِ يُقَامُ قِيمَةَ عَدْلٍ وَيُعْطَى شُرَكَاؤُهُ حِصَّتَهُمْ وَيُخَلَّى سَبِيلُ الْمُعْتَقِ ‏\"‏‏.‏"
      },
      {
        "id": 2395,
        "hadith_number": "2504",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kewajipan Memerdekakan Hamba yang Dimiliki Bersama",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) said, \"Whoever manumits his share of a jointly possessed slave, it is essential for him to manumit the slave completely if he has sufficient money. Otherwise he should look for some work for the slave (to earn what would enable him to emancipate himself), without overburdening him with work.\"",
        "malay_translation": "Nabi (ﷺ) bersabda, \"Sesiapa yang memerdekakan bahagiannya dalam seorang hamba yang dimiliki bersama, adalah penting baginya untuk memerdekakan hamba itu sepenuhnya jika dia mempunyai wang yang mencukupi. Jika tidak, dia hendaklah mencari pekerjaan untuk hamba itu (untuk mendapatkan apa yang membolehkannya membebaskan dirinya sendiri), tanpa membebaninya dengan pekerjaan.\"",
        "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، عَنْ قَتَادَةَ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَعْتَقَ شِقْصًا لَهُ فِي عَبْدٍ، أُعْتِقَ كُلُّهُ إِنْ كَانَ لَهُ مَالٌ، وَإِلاَّ يُسْتَسْعَ غَيْرَ مَشْقُوقٍ عَلَيْهِ ‏\"‏‏.‏"
      },
      {
        "id": 2396,
        "hadith_number": "2505, 2506",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perintah Menukar Niat Ihram Haji kepada Umrah dan Kebenaran Menyelesaikan Ihram Selepas Umrah",
        "perawi_melayu": "Diriwayatkan oleh Ibn Abbas RA:",
        "english_text": "The Prophet (along with his companions) reached Mecca in the morning of the fourth of Dhul-Hijja assuming Ihram for Hajj only. So when we arrived at Mecca, the Prophet (ﷺ) ordered us to change our intentions of the Ihram for `Umra and that we could finish our Ihram after performing the `Umra and could go to our wives (for sexual intercourse). The people began talking about that. Jabir said surprisingly, \"Shall we go to Mina while semen is dribbling from our male organs?\" Jabir moved his hand while saying so. When this news reached the Prophet (ﷺ) he delivered a sermon and said, \"I have been informed that some peoples were saying so and so; By Allah I fear Allah more than you do, and am more obedient to Him than you. If I had known what I know now, I would not have brought the Hadi (sacrifice) with me and had the Hadi not been with me, I would have finished the Ihram.\" At that Suraqa bin Malik stood up and asked \"O Allah's Messenger (ﷺ)! Is this permission for us only or is it forever?\" The Prophet (ﷺ) replied, \"It is forever.\" In the meantime `Ali bin Abu Talib came from Yemen and was saying Labbaik for what the Prophet (ﷺ) has intended. (According to another man, `Ali was saying Labbaik for Hajj similar to Allah's Messenger (ﷺ)'s). The Prophet (ﷺ) told him to keep on the Ihram and let him share the Hadi with him.",
        "malay_translation": "Nabi (bersama para sahabatnya) tiba di Mekah pada pagi hari keempat Zulhijjah dengan berniat ihram untuk Haji sahaja. Maka ketika kami tiba di Mekah, Nabi (ﷺ) memerintahkan kami untuk menukar niat ihram kami menjadi Umrah dan bahawa kami boleh menyelesaikan ihram kami setelah melaksanakan Umrah dan boleh pergi kepada isteri-isteri kami (untuk hubungan kelamin). Orang ramai mula bercakap tentang perkara itu. Jabir berkata dengan hairan, \"Adakah kita akan pergi ke Mina sementara air mani masih menitik dari alat kelamin lelaki kita?\" Jabir menggerakkan tangannya sambil berkata demikian. Apabila berita ini sampai kepada Nabi (ﷺ), baginda menyampaikan khutbah dan bersabda, \"Telah sampai kepada aku bahawa sesetengah orang berkata begini dan begini; Demi Allah, aku lebih takut kepada Allah daripada kamu, dan lebih taat kepada-Nya daripada kamu. Jika aku tahu apa yang aku tahu sekarang, aku tidak akan membawa Hadi (haiwan korban) bersamaku dan jika Hadi tidak bersamaku, aku pasti telah menyelesaikan ihram.\" Pada ketika itu Suraqa bin Malik berdiri dan bertanya, \"Wahai Rasulullah (ﷺ)! Adakah keizinan ini untuk kami sahaja atau untuk selama-lamanya?\" Nabi (ﷺ) menjawab, \"Ia adalah untuk selama-lamanya.\" Sementara itu, Ali bin Abu Talib datang dari Yaman dan mengucapkan Labbaik untuk apa yang diniatkan oleh Nabi (ﷺ). (Menurut seorang lelaki lain, Ali mengucapkan Labbaik untuk Haji serupa dengan Rasulullah (ﷺ)). Nabi (ﷺ) memberitahunya untuk terus berada dalam ihram dan membiarkannya berkongsi Hadi dengannya.",
        "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ‏.‏وَعَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهم ـ قَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم صُبْحَ رَابِعَةٍ مِنْ ذِي الْحَجَّةِ مُهِلِّينَ بِالْحَجِّ، لاَ يَخْلِطُهُمْ شَىْءٌ، فَلَمَّا قَدِمْنَا أَمَرَنَا فَجَعَلْنَاهَا عُمْرَةً، وَأَنْ نَحِلَّ إِلَى نِسَائِنَا، فَفَشَتْ فِي ذَلِكَ الْقَالَةُ‏.‏ قَالَ عَطَاءٌ فَقَالَ جَابِرٌ فَيَرُوحُ أَحَدُنَا إِلَى مِنًى وَذَكَرُهُ يَقْطُرُ مَنِيًّا‏.‏ فَقَالَ جَابِرٌ بِكَفِّهِ، فَبَلَغَ النَّبِيَّ صلى الله عليه وسلم فَقَامَ خَطِيبًا فَقَالَ ‏\"‏ بَلَغَنِي أَنَّ أَقْوَامًا يَقُولُونَ كَذَا وَكَذَا، وَاللَّهِ لأَنَا أَبَرُّ وَأَتْقَى لِلَّهِ مِنْهُمْ، وَلَوْ أَنِّي اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ مَا أَهْدَيْتُ، وَلَوْلاَ أَنَّ مَعِي الْهَدْىَ لأَحْلَلْتُ ‏\"‏‏.‏ فَقَامَ سُرَاقَةُ بْنُ مَالِكِ بْنِ جُعْشُمٍ فَقَالَ يَا رَسُولَ اللَّهِ هِيَ لَنَا أَوْ لِلأَبَدِ فَقَالَ ‏\"‏ لاَ بَلْ لِلأَبَدِ ‏\"‏‏.‏ قَالَ وَجَاءَ عَلِيُّ بْنُ أَبِي طَالِبٍ ـ فَقَالَ أَحَدُهُمَا يَقُولُ لَبَّيْكَ بِمَا أَهَلَّ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ وَقَالَ وَقَالَ الآخَرُ لَبَّيْكَ بِحَجَّةِ رَسُولِ اللَّهِ صلى الله عليه وسلم ـ فَأَمَرَ النَّبِيُّ صلى الله عليه وسلم أَنْ يُقِيمَ عَلَى إِحْرَامِهِ، وَأَشْرَكَهُ فِي الْهَدْىِ‏.‏"
      },
      {
        "id": 2397,
        "hadith_number": "2507",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Memasak Daging Haiwan Rampasan Sebelum Pembahagian dan Kebenaran Menyembelih dengan Buluh dan Seumpamanya",
        "perawi_melayu": "Diriwayatkan oleh Rafi` bin Khadij رضی اللہ عنہ :",
        "english_text": "\"We were in the valley of Dhul-Hulaifa of Tuhama in the company of the Prophet (ﷺ) and had some camels and sheep (of the booty). The people hurried (in slaughtering the animals) and put their meat in the pots and started cooking. Allah's Messenger (ﷺ) came and ordered them to upset the pots, and distributed the booty considering one camel as equal to ten sheep. One of the camels fled and the people had only a few horses, so they got worried. (The camel was chased and) a man slopped the camel by throwing an arrow at it. Allah's Messenger (ﷺ) said, 'Some of these animals are untamed like wild animals, so if anyone of them went out of your control, then you should treat it as you have done now.' \" My grandfather said, \"O Allah's Messenger (ﷺ)! We fear that we may meet our enemy tomorrow and we have no knives, could we slaughter the animals with reeds?\" The Prophet (ﷺ) said, \"Yes, or you can use what would make blood flow (slaughter) and you can eat what is slaughtered and the Name of Allah is mentioned at the time of slaughtering. But don't use teeth or fingernails (in slaughtering). I will tell you why, as for teeth, they are bones, and fingernails are used by Ethiopians for slaughtering. (See Hadith 668)",
        "malay_translation": "\"Kami berada di lembah Dhul-Hulaifa Tuhama bersama Nabi (ﷺ) dan mempunyai beberapa unta dan kambing (dari harta rampasan perang). Orang ramai tergesa-gesa (dalam menyembelih haiwan) dan meletakkan daging mereka di dalam periuk dan mula memasak. Rasulullah (ﷺ) datang dan memerintahkan mereka untuk menunggangbalikkan periuk-periuk itu, dan membahagikan harta rampasan perang dengan menganggap seekor unta sama dengan sepuluh ekor kambing. Seekor unta melarikan diri dan orang ramai hanya mempunyai beberapa ekor kuda, jadi mereka menjadi bimbang. (Unta itu dikejar dan) seorang lelaki melumpuhkan unta itu dengan melemparkan anak panah kepadanya. Rasulullah (ﷺ) bersabda, 'Sesetengah haiwan ini liar seperti haiwan liar, jadi jika ada di antara mereka yang terlepas kawalan kamu, maka kamu harus memperlakukannya seperti yang kamu lakukan sekarang.' \" Datuk saya berkata, \"Wahai Rasulullah (ﷺ)! Kami bimbang kami akan bertemu musuh kami esok dan kami tidak mempunyai pisau, bolehkah kami menyembelih haiwan dengan buluh?\" Nabi (ﷺ) bersabda, \"Ya, atau kamu boleh menggunakan apa sahaja yang boleh mengalirkan darah (sembelihan) dan kamu boleh makan apa yang disembelih dan Nama Allah disebut ketika menyembelih. Tetapi jangan gunakan gigi atau kuku (dalam menyembelih). Saya akan memberitahu kamu mengapa, adapun gigi, ia adalah tulang, dan kuku digunakan oleh orang Habsyah untuk menyembelih. (Lihat Hadith 668)",
        "arabic_text": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ أَبِيهِ، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ، عَنْ جَدِّهِ، رَافِعِ بْنِ خَدِيجٍ ـ رضى الله عنه ـ قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم بِذِي الْحُلَيْفَةِ مِنْ تِهَامَةَ، فَأَصَبْنَا غَنَمًا وَإِبِلاً، فَعَجِلَ الْقَوْمُ، فَأَغْلَوْا بِهَا الْقُدُورَ، فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَمَرَ بِهَا فَأُكْفِئَتْ، ثُمَّ عَدَلَ عَشْرًا مِنَ الْغَنَمِ بِجَزُورٍ، ثُمَّ إِنَّ بَعِيرًا نَدَّ وَلَيْسَ فِي الْقَوْمِ إِلاَّ خَيْلٌ يَسِيرَةٌ فَرَمَاهُ رَجُلٌ فَحَبَسَهُ بِسَهْمٍ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ لِهَذِهِ الْبَهَائِمِ أَوَابِدَ كَأَوَابِدِ الْوَحْشِ، فَمَا غَلَبَكُمْ مِنْهَا فَاصْنَعُوا بِهِ هَكَذَا ‏\"‏‏.‏ قَالَ قَالَ جَدِّي يَا رَسُولَ اللَّهِ إِنَّا نَرْجُو ـ أَوْ نَخَافُ ـ أَنْ نَلْقَى الْعَدُوَّ غَدًا وَلَيْسَ مَعَنَا مُدًى، فَنَذْبَحُ بِالْقَصَبِ فَقَالَ ‏\"‏ اعْجَلْ أَوْ أَرْنِي، مَا أَنْهَرَ الدَّمَ وَذُكِرَ اسْمُ اللَّهِ عَلَيْهِ فَكُلُوا، لَيْسَ السِّنَّ وَالظُّفُرَ، وَسَأُحَدِّثُكُمْ عَنْ ذَلِكَ، أَمَّا السِّنُّ فَعَظْمٌ، وَأَمَّا الظُّفُرُ فَمُدَى الْحَبَشَةِ ‏\"‏‏.‏"
      }
    ]
  }
}