{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 184,
    "data": [
      {
        "id": 5534,
        "hadith_number": "5783",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Allah Tidak Akan Memandang Orang yang Memanjangkan Pakaiannya Kerana Sombong",
        "perawi_melayu": "Diriwayatkan oleh Abdullah bin Umar رضی اللہ عنہما :",
        "english_text": "Allah's Messenger (ﷺ) said, 'Allah will not look at the person who drags his garment (behind him) out of conceit.''",
        "malay_translation": "Rasulullah ﷺ bersabda, 'Allah tidak akan memandang (dengan rahmat-Nya) orang yang menyeret pakaiannya (di belakangnya) kerana sombong.'",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، وَعَبْدِ اللَّهِ بْنِ دِينَارٍ، وَزَيْدِ بْنِ أَسْلَمَ، يُخْبِرُونَهُ عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَنْظُرُ اللَّهُ إِلَى مَنْ جَرَّ ثَوْبَهُ خُيَلاَءَ ‏\"‏‏.‏"
      },
      {
        "id": 5535,
        "hadith_number": "5784",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Sesiapa yang Mengheret Pakaiannya dengan Sombong",
        "perawi_melayu": "Diriwayatkan daripada `Abdullah bin `Umar:",
        "english_text": "The Prophet (ﷺ) said Allah will not look, on the Day of Resurrection at the person who drags his garment (behind him) out of conceit. On that Abu Bakr رضی اللہ عنہ said, \"O Allah's Messenger (ﷺ)! One side of my Izar hangs low if I do not take care of it.\" The Prophet (ﷺ) said, 'You are not one of those who do that out of conceit.'",
        "malay_translation": "Rasulullah (ﷺ) bersabda: Allah tidak akan memandang pada Hari Kiamat kepada orang yang mengheret pakaiannya (di belakangnya) kerana sombong. Mendengar hal itu, Abu Bakr رضی اللہ عنہ berkata, \"Wahai Rasulullah (ﷺ)! Sebelah bawah kainku (izar) akan terjuntai jika aku tidak berhati-hati.\" Nabi (ﷺ) bersabda, 'Kamu bukanlah termasuk golongan yang melakukannya kerana sombong.'",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ جَرَّ ثَوْبَهُ خُيَلاَءَ لَمْ يَنْظُرِ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏ قَالَ أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ إِنَّ أَحَدَ شِقَّىْ إِزَارِي يَسْتَرْخِي، إِلاَّ أَنْ أَتَعَاهَدَ ذَلِكَ مِنْهُ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَسْتَ مِمَّنْ يَصْنَعُهُ خُيَلاَءَ ‏\"‏‏.‏"
      },
      {
        "id": 5536,
        "hadith_number": "5785",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Gerhana Matahari dan Doa Ketika Gerhana",
        "perawi_melayu": "Diriwayatkan oleh Abu Bakra رضی اللہ عنہ :",
        "english_text": "The solar eclipse occurred while we were sitting with the Prophet (ﷺ) He got up dragging his garment (on the ground) hurriedly till he reached the mosque The people turned (to the mosque) and he offered a two-rak`at prayer whereupon the eclipse was over and he traced us and said, \"The sun and the moon are two signs among the signs of Allah, so if you see a thing like this (eclipse) then offer the prayer and invoke Allah till He remove that state.\"",
        "malay_translation": "Gerhana matahari berlaku ketika kami sedang duduk bersama Nabi (ﷺ). Baginda bangun dengan tergesa-gesa menarik pakaiannya (di tanah) sehingga baginda sampai ke masjid. Orang ramai berpaling (ke masjid) dan baginda menunaikan solat dua rakaat, selepas itu gerhana berakhir dan baginda memberi khutbah kepada kami dan bersabda, \"Matahari dan bulan adalah dua tanda di antara tanda-tanda Allah, jadi jika kamu melihat sesuatu seperti ini (gerhana) maka dirikanlah solat dan berdoalah kepada Allah sehingga Dia menghapuskan keadaan itu.\"",
        "arabic_text": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا عَبْدُ الأَعْلَى، عَنْ يُونُسَ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ ـ رضى الله عنه ـ قَالَ خَسَفَتِ الشَّمْسُ وَنَحْنُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَامَ يَجُرُّ ثَوْبَهُ مُسْتَعْجِلاً، حَتَّى أَتَى الْمَسْجِدَ وَثَابَ النَّاسُ فَصَلَّى رَكْعَتَيْنِ، فَجُلِّيَ عَنْهَا، ثُمَّ أَقْبَلَ عَلَيْنَا وَقَالَ ‏ \"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ، فَإِذَا رَأَيْتُمْ مِنْهَا شَيْئًا فَصَلُّوا وَادْعُوا اللَّهَ حَتَّى يَكْشِفَهَا ‏\"‏‏.‏"
      },
      {
        "id": 5537,
        "hadith_number": "5786",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Bilal r.a. Memacak Tombak Kecil untuk Solat",
        "perawi_melayu": "Diriwayatkan oleh Abu Juhaifa رضی اللہ عنہ :",
        "english_text": "I saw Bilal رضی اللہ عنہ bringing a short spear (or stick) and fixing it in the ground, and then he proclaimed the Iqama of the prayer, and I saw Allah's Messenger (ﷺ) coming out, wearing a cloak with its sleeves rolled up. He then offered a two-rak`at prayer while facing the stick, and I saw the people and animals passing in front of him beyond the stick.",
        "malay_translation": "Saya melihat Bilal رضی اللہ عنہ membawa tombak pendek (atau tongkat) dan memacaknya ke tanah, kemudian dia mengumandangkan iqamat solat, dan saya melihat Rasulullah (ﷺ) keluar, mengenakan jubah dengan lengan yang digulung. Baginda kemudian menunaikan solat dua rakaat dengan menghadap tongkat itu, dan saya melihat orang ramai dan haiwan lalu di hadapan Baginda di sebalik tongkat itu.",
        "arabic_text": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا ابْنُ شُمَيْلٍ، أَخْبَرَنَا عُمَرُ بْنُ أَبِي زَائِدَةَ، أَخْبَرَنَا عَوْنُ بْنُ أَبِي جُحَيْفَةَ، عَنْ أَبِيهِ أَبِي جُحَيْفَةَ، قَالَ فَرَأَيْتُ بِلاَلاً جَاءَ بِعَنَزَةٍ فَرَكَزَهَا، ثُمَّ أَقَامَ الصَّلاَةَ، فَرَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ فِي حُلَّةٍ مُشَمِّرًا، فَصَلَّى رَكْعَتَيْنِ إِلَى الْعَنَزَةِ، وَرَأَيْتُ النَّاسَ وَالدَّوَابَّ يَمُرُّونَ بَيْنَ يَدَيْهِ مِنْ وَرَاءِ الْعَنَزَةِ‏.‏"
      },
      {
        "id": 5538,
        "hadith_number": "5787",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Bahagian Izar di Bawah Buku Lali di Neraka",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) said, \"The part of an Izar which hangs below the ankles is in the Fire.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Bahagian kain izar yang tergantung di bawah buku lali adalah di dalam Neraka.\"",
        "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي سَعِيدٍ الْمَقْبُرِيُّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَا أَسْفَلَ مِنَ الْكَعْبَيْنِ مِنَ الإِزَارِ فَفِي النَّارِ ‏\"‏‏.‏"
      },
      {
        "id": 5539,
        "hadith_number": "5788",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Allah Tidak Akan Memandang Orang yang Berlagak dengan Kainnya",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah رضي اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ), \"Allah will not look, on the Day of Resurrection, at a person who drags his Izar (behind him) out of pride and arrogance.",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Allah tidak akan memandang pada Hari Kiamat kepada orang yang menyeret kainnya (di belakangnya) kerana sombong dan takbur.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَنْظُرُ اللَّهُ يَوْمَ الْقِيَامَةِ إِلَى مَنْ جَرَّ إِزَارَهُ بَطَرًا ‏\"‏‏.‏"
      },
      {
        "id": 5540,
        "hadith_number": "5789",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Azab Allah Terhadap Orang yang Sombong",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah رضی اللہ عنہ :",
        "english_text": "The Prophet (or 'Abul Qasim) said, \"While a man was walking, clad in a two-piece garment and proud of himself with his hair well-combed, suddenly Allah made him sink into the earth and he will go on sinking into it till the Day of Resurrection.",
        "malay_translation": "Nabi (atau 'Abul Qasim) bersabda, \"Ketika seorang lelaki sedang berjalan, memakai pakaian dua helai dan berbangga diri dengan rambutnya yang tersisir rapi, tiba-tiba Allah membuatnya tenggelam ke dalam bumi dan dia akan terus tenggelam ke dalamnya hingga Hari Kiamat.",
        "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ النَّبِيُّ ـ أَوْ قَالَ أَبُو الْقَاسِمِ ـ صلى الله عليه وسلم ‏ \"‏ بَيْنَمَا رَجُلٌ يَمْشِي فِي حُلَّةٍ، تُعْجِبُهُ نَفْسُهُ مُرَجِّلٌ جُمَّتَهُ، إِذْ خَسَفَ اللَّهُ بِهِ، فَهْوَ يَتَجَلَّلُ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏‏.‏"
      },
      {
        "id": 5541,
        "hadith_number": "5790",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman Allah Bagi Lelaki yang Menyeret Izar",
        "perawi_melayu": "Diriwayatkan oleh Abdullah bin `Umar رضی اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) said, \"While a man was dragging his Izar on the ground (behind him), suddenly Allah made him sink into the earth and he will go on sinking into it till the Day of Resurrection.\" Hadrat Jareer bin Zaid narrates that he, accompanied by Saalim bin Abdullah bin Umer, was at his housedoor, so he said: I from Hadrat Abu Huraira رضی اللہ عنہ and that he heard it from the Prophet ﷺ.",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Ketika seorang lelaki menyeret kain izar (di belakangnya) di atas tanah, tiba-tiba Allah menjadikannya tenggelam ke dalam bumi, dan dia akan terus tenggelam ke dalamnya hingga Hari Kiamat.\" Hadrat Jareer bin Zaid meriwayatkan bahawa dia, bersama Saalim bin Abdullah bin Umer, berada di depan pintu rumahnya, lalu dia berkata: Saya dari Hadrat Abu Huraira رضی اللہ عنہ dan bahawa dia mendengarnya daripada Nabi ﷺ.",
        "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ أَبَاهُ، حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ بَيْنَا رَجُلٌ يَجُرُّ إِزَارَهُ، خُسِفَ بِهِ، فَهْوَ يَتَجَلَّلُ فِي الأَرْضِ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏‏.‏ تَابَعَهُ يُونُسُ عَنِ الزُّهْرِيِّ‏.‏ وَلَمْ يَرْفَعْهُ شُعَيْبٌ عَنِ الزُّهْرِيِّ‏.‏ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، أَخْبَرَنَا أَبِي، عَنْ عَمِّهِ، جَرِيرِ بْنِ زَيْدٍ قَالَ كُنْتُ مَعَ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَلَى باب دَارِهِ فَقَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، سَمِعَ النَّبِيَّ صلى الله عليه وسلم نَحْوَهُ‏.‏"
      },
      {
        "id": 5542,
        "hadith_number": "5791",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman Bagi Orang yang Memanjangkan Pakaian Kerana Sombong",
        "perawi_melayu": "Diriwayatkan daripada `Abdullah bin `Umar رضی اللہ عنہما :",
        "english_text": "Allah's Messenger (ﷺ) said, \"Whoever drags his clothes (on the ground) out of pride and arrogance, Allah will not look at him on the Day of Resurrection.\" I asked Muharib: Did he mention wrapper? He said: There is no specifications of wrapper or shirt. Jabalah bin Sohaim, Zaid bin Aslam and Zaid bin Abdullah from Hadrat Ibn-e-Umer and he has reported like-wise from the prophet ﷺ. Laith, Nafi'o has reported like-wise from Hadrat Ibn-e-Umer رضی اللہ عنہما. Hadrat Ibn-e-Umer رضی اللہ عنہما reported from the prophet ﷺ ''Who so drags his garment.''",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Sesiapa yang menyeret pakaiannya (di tanah) kerana sombong dan angkuh, Allah tidak akan memandangnya pada Hari Kiamat.\" Saya bertanya kepada Muharib: Adakah dia menyebut selendang? Dia berkata: Tiada spesifikasi selendang atau baju. Jabalah bin Sohaim, Zaid bin Aslam dan Zaid bin Abdullah daripada Hadrat Ibn-e-Umer dan beliau telah meriwayatkan seperti ini daripada Nabi ﷺ. Laith, Nafi'o telah meriwayatkan seperti ini daripada Hadrat Ibn-e-Umer رضی اللہ عنہما. Hadrat Ibn-e-Umer رضی اللہ عنہما meriwayatkan daripada Nabi ﷺ ''Sesiapa yang menyeret pakaiannya.'' ",
        "arabic_text": "حَدَّثَنَا مَطَرُ بْنُ الْفَضْلِ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا شُعْبَةُ، قَالَ لَقِيتُ مُحَارِبَ بْنَ دِثَارٍ عَلَى فَرَسٍ وَهْوَ يَأْتِي مَكَانَهُ الَّذِي يَقْضِي فِيهِ فَسَأَلْتُهُ عَنْ هَذَا الْحَدِيثِ فَحَدَّثَنِي فَقَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ جَرَّ ثَوْبَهُ مَخِيلَةً، لَمْ يَنْظُرِ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏ فَقُلْتُ لِمُحَارِبٍ أَذَكَرَ إِزَارَهُ قَالَ مَا خَصَّ إِزَارًا وَلاَ قَمِيصًا‏.‏ تَابَعَهُ جَبَلَةُ بْنُ سُحَيْمٍ وَزَيْدُ بْنُ أَسْلَمَ وَزَيْدُ بْنُ عَبْدِ اللَّهِ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ اللَّيْثُ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ مِثْلَهُ‏.‏ وَتَابَعَهُ مُوسَى بْنُ عُقْبَةَ وَعُمَرُ بْنُ مُحَمَّدٍ وَقُدَامَةُ بْنُ مُوسَى عَنْ سَالِمٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ مَنْ جَرَّ ثَوْبَهُ ‏\"‏‏.‏"
      },
      {
        "id": 5543,
        "hadith_number": "5792",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Isteri Rifa'a Al-Qurazi dan Keputusan Rasulullah ﷺ",
        "perawi_melayu": "Diriwayatkan oleh 'Aisha (isteri Nabi) رضي الله عنها :",
        "english_text": "The wife of Rifa`a Al-Qurazi رضی اللہ عنہ came to Allah's Messenger (ﷺ) while I was sitting, and Abu Bakr رضی اللہ عنہ was also there. She said, 'O Allah s Apostle! I was the wife of Rifa`a and he divorced me irrevocably. Then I married `Abdur Rahman bin Az-Zubair رضی اللہ عنہ who, by Allah, O Allah's Messenger (ﷺ), has only something like a fringe of a garment, Showing the fringe of her veil. Khalid bin Sa`id رضی اللہ عنہ , who was standing at the door, for he had not been admitted, heard her statement and said, \"O Abu Bakr! Why do you not stop this lady from saying such things openly before Allah's Messenger (ﷺ)?\" No, by Allah, Allah's Messenger (ﷺ) did nothing but smiled. Then he said to the lady, \"Perhaps you want to return to Rifa`a? That is impossible unless `Abdur-Rahman رضی اللہ عنہ consummates his marriage with you.\" That became the tradition after him.",
        "malay_translation": "Isteri Rifa'a Al-Qurazi رضي الله عنها datang menemui Rasulullah ﷺ ketika aku sedang duduk, dan Abu Bakr رضي الله عنه juga berada di situ. Dia berkata, 'Wahai Rasulullah! Aku adalah isteri Rifa'a dan dia telah menceraikan aku dengan talak yang tidak boleh dirujuk. Kemudian aku berkahwin dengan 'Abdur Rahman bin Az-Zubair رضي الله عنه yang, demi Allah, wahai Rasulullah ﷺ, hanya memiliki sesuatu seperti pinggir pakaian, sambil menunjukkan pinggir tudungnya. Khalid bin Sa`id رضي الله عنه, yang berdiri di pintu, kerana dia belum diizinkan masuk, mendengar kata-katanya dan berkata, \"Wahai Abu Bakr! Mengapa kamu tidak menghalang wanita ini daripada berkata sedemikian secara terbuka di hadapan Rasulullah ﷺ?\" Tidak, demi Allah, Rasulullah ﷺ hanya tersenyum. Kemudian baginda berkata kepada wanita itu, \"Mungkin kamu ingin kembali kepada Rifa'a? Itu tidak mungkin kecuali jika 'Abdur-Rahman رضي الله عنه menyempurnakan perkahwinannya denganmu.\" Itulah yang menjadi tradisi selepas itu.",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ جَاءَتِ امْرَأَةُ رِفَاعَةَ الْقُرَظِيِّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَأَنَا جَالِسَةٌ وَعِنْدَهُ أَبُو بَكْرٍ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي كُنْتُ تَحْتَ رِفَاعَةَ فَطَلَّقَنِي فَبَتَّ طَلاَقِي، فَتَزَوَّجْتُ بَعْدَهُ عَبْدَ الرَّحْمَنِ بْنَ الزَّبِيرِ، وَإِنَّهُ وَاللَّهِ مَا مَعَهُ يَا رَسُولَ اللَّهِ إِلاَّ مِثْلُ هَذِهِ الْهُدْبَةِ‏.‏ وَأَخَذَتْ هُدْبَةً مِنْ جِلْبَابِهَا، فَسَمِعَ خَالِدُ بْنُ سَعِيدٍ قَوْلَهَا وَهْوَ بِالْبَابِ لَمْ يُؤْذَنْ لَهُ، قَالَتْ فَقَالَ خَالِدٌ يَا أَبَا بَكْرٍ أَلاَ تَنْهَى هَذِهِ عَمَّا تَجْهَرُ بِهِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلاَ وَاللَّهِ مَا يَزِيدُ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى التَّبَسُّمِ، فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَعَلَّكِ تُرِيدِينَ أَنْ تَرْجِعِي إِلَى رِفَاعَةَ، لاَ، حَتَّى يَذُوقَ عُسَيْلَتَكِ وَتَذُوقِي عُسَيْلَتَهُ ‏\"‏‏.‏ فَصَارَ سُنَّةً بَعْدُ‏.‏"
      },
      {
        "id": 5544,
        "hadith_number": "5793",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi ﷺ Meminta Rida dan Mengunjungi Rumah Hamza",
        "perawi_melayu": "Diriwayatkan oleh `Ali رضي الله عنه :",
        "english_text": "The Prophet (ﷺ) asked for his Rida, put it on and set out walking. Zaid bin Haritha رضی اللہ عنہ and I followed him till he reached the house where Hamza (bin `Abdul Muttalib) was present and asked for permission to enter, and they gave us permission.",
        "malay_translation": "Nabi ﷺ meminta Rida-Nya, memakainya dan berjalan. Zaid bin Haritha رضي الله عنه dan saya mengikutinya sehingga baginda sampai ke rumah tempat Hamza (bin `Abdul Muttalib) berada dan meminta izin untuk masuk, dan mereka memberikan kami izin.",
        "arabic_text": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي عَلِيُّ بْنُ حُسَيْنٍ، أَنَّ حُسَيْنَ بْنَ عَلِيٍّ، أَخْبَرَهُ أَنَّ عَلِيًّا ـ رضى الله عنه ـ قَالَ فَدَعَا النَّبِيُّ صلى الله عليه وسلم بِرِدَائِهِ، ثُمَّ انْطَلَقَ يَمْشِي، وَاتَّبَعْتُهُ أَنَا وَزَيْدُ بْنُ حَارِثَةَ، حَتَّى جَاءَ الْبَيْتَ الَّذِي فِيهِ حَمْزَةُ، فَاسْتَأْذَنَ فَأَذِنُوا لَهُمْ‏.‏"
      },
      {
        "id": 5545,
        "hadith_number": "5794",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pakaian Ihram yang Dibenarkan",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Umar رضی اللہ عنہما :",
        "english_text": "A man asked, \"O Allah s Apostle What kind of clothes should a Muhrim wear?\" The Prophet, said, \"A Muhrim should not wear a shirt, trousers a hooded cloak, or Khuffs (socks made from thick fabric or leather) unless he cannot get sandals, in which case he should cut the part (of the Khuff) that covers the ankles.\"",
        "malay_translation": "Seorang lelaki bertanya, \"Wahai Rasulullah! Apakah jenis pakaian yang harus dipakai oleh seorang Muhrim?\" Nabi ﷺ bersabda, \"Seorang Muhrim tidak boleh memakai baju, seluar, jubah berhud, atau Khuffs (stokin yang diperbuat daripada kain tebal atau kulit) kecuali jika dia tidak dapat mendapatkan selipar, dalam hal ini dia harus memotong bahagian (Khuff) yang menutup buku lali.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَجُلاً، قَالَ يَا رَسُولَ اللَّهِ مَا يَلْبَسُ الْمُحْرِمُ مِنَ الثِّيَابِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ يَلْبَسُ الْمُحْرِمُ الْقَمِيصَ، وَلاَ السَّرَاوِيلَ، وَلاَ الْبُرْنُسَ، وَلاَ الْخُفَّيْنِ، إِلاَّ أَنْ لاَ يَجِدَ النَّعْلَيْنِ، فَلْيَلْبَسْ مَا هُوَ أَسْفَلُ مِنَ الْكَعْبَيْنِ ‏\"‏‏.‏"
      },
      {
        "id": 5546,
        "hadith_number": "5795",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi ﷺ Melawat Abdullah bin Ubai Selepas Pengebumian",
        "perawi_melayu": "Diriwayatkan oleh Jabir bin `Abdullah رضي الله عنهما :",
        "english_text": "The Prophet (ﷺ) came to visit `Abdullah bin Ubai (bin Salul) after he had been put in his grave. The Prophet (ﷺ) ordered that `Abdullah be taken out. He was taken out and was placed on the knees of the Prophet, who blew his (blessed) breath on him and dressed the body with his own shirt. And Allah knows better.",
        "malay_translation": "Nabi ﷺ datang melawat `Abdullah bin Ubai (bin Salul) setelah dia dikebumikan. Nabi ﷺ memerintahkan agar `Abdullah dikeluarkan. Dia dikeluarkan dan diletakkan di atas lutut Nabi, yang menghembuskan nafasnya (yang diberkati) ke atasnya dan memakaikan jasadnya dengan baju baginda sendiri. Dan Allah lebih mengetahui.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، أَخْبَرَنَا ابْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ أَتَى النَّبِيُّ صلى الله عليه وسلم عَبْدَ اللَّهِ بْنَ أُبَىٍّ بَعْدَ مَا أُدْخِلَ قَبْرَهُ، فَأَمَرَ بِهِ فَأُخْرِجَ، وَوُضِعَ عَلَى رُكْبَتَيْهِ، وَنَفَثَ عَلَيْهِ مِنْ رِيقِهِ، وَأَلْبَسَهُ قَمِيصَهُ، وَاللَّهُ أَعْلَمُ‏.‏"
      },
      {
        "id": 5547,
        "hadith_number": "5796",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi SAW Berhenti Mendoakan Orang Munafik Selepas Turun Wahyu",
        "perawi_melayu": "Diriwayatkan daripada Abdullah bin Umar رضی اللہ عنہما :",
        "english_text": "When `Abdullah bin Ubdi (bin Salul) died, his son came to Allah's Messenger (ﷺ) and said ' O Allah's Apostle, give me your shirt so that I may shroud my fathers body in it. And please offer a funeral prayer for him and invoke Allah for his forgiveness.\" The Prophet (ﷺ) gave him his shirt and said to him 'Inform us when you finish (and the funeral procession is ready) call us. When he had finished he told the Prophet (ﷺ) and the Prophet (ﷺ) proceeded to order his funeral prayers but `Umar رضی اللہ عنہ stopped him and said, \"Didn't Allah forbid you to offer the funeral prayer for the hypocrites when He said: \"Whether you (O Muhammad) ask forgiveness for them or ask not forgiveness for them: (and even) if you ask forgiveness for them seventy times. Allah will not forgive them.\" (9.80) Then there was revealed: \"And never (O Muhammad) pray for any of them that dies, nor stand at his grave.\" (9.34) Thenceforth the Prophet (ﷺ) did not offer funeral prayers for the hypocrites.",
        "malay_translation": "Ketika `Abdullah bin Ubdi (bin Salul) meninggal dunia, anaknya datang kepada Rasulullah SAW dan berkata, 'Wahai Rasulullah, berikanlah kepada saya jubahmu supaya saya dapat mengafankan jenazah ayahku dengannya. Dan mohonkanlah doa ke atasnya dan mintalah ampun kepada Allah untuknya.' Nabi SAW memberikan jubahnya dan berkata kepadanya, 'Beritahu kami apabila kamu telah selesai (dan urusan pengebumian telah selesai).' Apabila dia telah selesai, dia memberitahu Nabi SAW dan Nabi SAW pun bersiap sedia untuk mengimamkan solat jenazah. Namun, `Umar رضی اللہ عنہ menghentikannya dan berkata, 'Bukankah Allah telah melarangmu untuk mensolatkan jenazah orang munafik ketika Dia berfirman: 'Sama ada kamu (wahai Muhammad) meminta ampun bagi mereka atau tidak meminta ampun bagi mereka; (dan jika) kamu meminta ampun bagi mereka tujuh puluh kali, Allah sekali-kali tidak akan mengampuni mereka.' (9.80) Kemudian turunlah wahyu: 'Dan janganlah sekali-kali kamu (wahai Muhammad) mensolatkan jenazah seorang pun daripada mereka yang mati, dan janganlah kamu berdiri di kuburnya.' (9.34) Sejak saat itu, Nabi SAW tidak lagi mensolatkan jenazah orang-orang munafik.",
        "arabic_text": "حَدَّثَنَا صَدَقَةُ، أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، قَالَ أَخْبَرَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ، قَالَ لَمَّا تُوُفِّيَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ جَاءَ ابْنُهُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَعْطِنِي قَمِيصَكَ أُكَفِّنْهُ فِيهِ، وَصَلِّ عَلَيْهِ، وَاسْتَغْفِرْ لَهُ، فَأَعْطَاهُ قَمِيصَهُ، وَقَالَ ‏\"‏ إِذَا فَرَغْتَ فَآذِنَّا ‏\"‏‏.‏ فَلَمَّا فَرَغَ آذَنَهُ، فَجَاءَ لِيُصَلِّيَ عَلَيْهِ، فَجَذَبَهُ عُمَرُ فَقَالَ أَلَيْسَ قَدْ نَهَاكَ اللَّهُ أَنْ تُصَلِّيَ عَلَى الْمُنَافِقِينَ فَقَالَ ‏{‏اسْتَغْفِرْ لَهُمْ أَوْ لاَ تَسْتَغْفِرْ لَهُمْ إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَنْ يَغْفِرَ اللَّهُ لَهُمْ‏}‏‏.‏ فَنَزَلَتْ ‏{‏وَلاَ تُصَلِّ عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا‏}‏ فَتَرَكَ الصَّلاَةَ عَلَيْهِمْ‏.‏"
      },
      {
        "id": 5548,
        "hadith_number": "5797",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perumpamaan Orang Kedekut dan Orang Dermawan",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) has set forth an example for a miser and a charitable person by comparing them to two men wearing two iron cloaks and their hands are raised to their breasts and necks. Whenever the charitable man tries to give a charitable gift, his iron cloak expands till it becomes so wide that it will cover his fingertips and obliterate his tracks And, whenever the miser wants to give a charitable gift, his cloak becomes very tight over him and every ring gets stuck to its place Abu Huraira رضی اللہ عنہ added; I saw Allah's Messenger (ﷺ) putting his finger in the (chest) pocket of his shirt like that If you but saw him trying to widen (the opening of his shirt) but it did not widen. Abu Zinad reporting from Aaraj said: ''Fill Jubbataan''. Jafar with reference to Aaraj said: ''Jubbataan''.",
        "malay_translation": "Rasulullah ﷺ telah memberikan perumpamaan bagi orang yang bakhil (kedekut) dan orang yang dermawan dengan membandingkan mereka dengan dua orang lelaki yang memakai dua jubah besi dan tangan mereka diangkat ke dada dan leher mereka. Setiap kali orang yang dermawan itu cuba memberikan sedekah, jubah besinya membesar sehingga menjadi sangat luas sehingga ia akan menutupi hujung jarinya dan menghapuskan jejaknya. Dan, setiap kali orang yang bakhil itu ingin memberikan sedekah, jubahnya menjadi sangat ketat ke atasnya dan setiap gelang melekat pada tempatnya. Abu Hurairah رضی اللہ عنہ menambah; Saya melihat Rasulullah ﷺ meletakkan jarinya di dalam poket (dada) bajunya seperti itu. Jika kamu melihatnya cuba melebarkan (bukaan bajunya) tetapi ia tidak melebar. Abu Zinad meriwayatkan daripada Aaraj berkata: ''Penuhi Jubbataan''. Ja'far dengan rujukan kepada Aaraj berkata: ''Jubbataan''.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو عَامِرٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ نَافِعٍ، عَنِ الْحَسَنِ، عَنْ طَاوُسٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ ضَرَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَثَلَ الْبَخِيلِ وَالْمُتَصَدِّقِ، كَمَثَلِ رَجُلَيْنِ عَلَيْهِمَا جُبَّتَانِ مِنْ حَدِيدٍ، قَدِ اضْطُرَّتْ أَيْدِيهِمَا إِلَى ثُدِيِّهِمَا وَتَرَاقِيهِمَا، فَجَعَلَ الْمُتَصَدِّقُ كُلَّمَا تَصَدَّقَ بِصَدَقَةٍ انْبَسَطَتْ عَنْهُ حَتَّى تَغْشَى أَنَامِلَهُ وَتَعْفُوَ أَثَرَهُ، وَجَعَلَ الْبَخِيلُ كُلَّمَا هَمَّ بِصَدَقَةٍ قَلَصَتْ، وَأَخَذَتْ كُلُّ حَلْقَةٍ بِمَكَانِهَا‏.‏ قَالَ أَبُو هُرَيْرَةَ فَأَنَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ بِإِصْبَعِهِ هَكَذَا فِي جَيْبِهِ، فَلَوْ رَأَيْتَهُ يُوَسِّعُهَا وَلاَ تَتَوَسَّعُ‏.‏ تَابَعَهُ ابْنُ طَاوُسٍ عَنْ أَبِيهِ وَأَبُو الزِّنَادِ عَنِ الأَعْرَجِ فِي الْجُبَّتَيْنِ‏.‏ وَقَالَ حَنْظَلَةُ سَمِعْتُ طَاوُسًا سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ جُبَّتَانِ‏.‏ وَقَالَ جَعْفَرٌ عَنِ الأَعْرَجِ جُبَّتَانِ‏.‏"
      },
      {
        "id": 5549,
        "hadith_number": "5798",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah ﷺ Berwudhu'",
        "perawi_melayu": "Diriwayatkan oleh Al-Mughira bin Shu`ba رضى الله عنه",
        "english_text": "The Prophet (ﷺ) went to answer the call of nature, and when he returned, I met him with water and he performed the ablution while he was wearing a Sham, cloak. He rinsed his mouth, put the water in his nose and blew it out, washed his face and tried to take his hands out of his sleeves, but they were too narrow, so he took out his hands from under his chest and washed them and then passed his wet hands over his head and Khuffs (socks made from thick fabric or leather).",
        "malay_translation": "Nabi ﷺ pergi untuk membuang air, dan ketika baginda kembali, saya menemui baginda dengan air. Baginda berwudhu' semasa memakai Sham, sejenis jubah. Baginda berkumur-kumur, memasukkan air ke dalam hidung dan menghembuskannya keluar, membasuh muka baginda, dan cuba mengeluarkan tangan daripada lengan baju baginda, tetapi ia terlalu sempit. Lalu baginda mengeluarkan tangan dari bawah dada baginda dan membasuhnya, kemudian menyapu kepala baginda dengan tangan yang basah dan Khuffs (stokin yang diperbuat daripada kain tebal atau kulit).",
        "arabic_text": "حَدَّثَنَا قَيْسُ بْنُ حَفْصٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي أَبُو الضُّحَى، قَالَ حَدَّثَنِي مَسْرُوقٌ، قَالَ حَدَّثَنِي الْمُغِيرَةُ بْنُ شُعْبَةَ، قَالَ انْطَلَقَ النَّبِيُّ صلى الله عليه وسلم لِحَاجَتِهِ ثُمَّ أَقْبَلَ، فَتَلَقَّيْتُهُ بِمَاءٍ، فَتَوَضَّأَ وَعَلَيْهِ جُبَّةٌ شَأْمِيَّةٌ، فَمَضْمَضَ وَاسْتَنْشَقَ وَغَسَلَ وَجْهَهُ، فَذَهَبَ يُخْرِجُ يَدَيْهِ مِنْ كُمَّيْهِ فَكَانَا ضَيِّقَيْنِ، فَأَخْرَجَ يَدَيْهِ مِنْ تَحْتِ الْجُبَّةِ، فَغَسَلَهُمَا وَمَسَحَ بِرَأْسِهِ وَعَلَى خُفَّيْهِ‏.‏"
      },
      {
        "id": 5550,
        "hadith_number": "5799",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi ﷺ Melakukan Wuduk Semasa Bermusafir",
        "perawi_melayu": "Diriwayatkan oleh Al-Mughira رضى الله عنه :",
        "english_text": "One night I was with the Prophet (ﷺ) on a journey. He asked (me), \"Have you got water with you?\" I replied, \"Yes\" So he got down from his she-camel and went away till he disappeared in the darkness of the night. Then he came back and I poured water for him from the pot (for the ablution). He washed his face and hands while he was wearing a woollen cloak (the sleeves of which were narrow), so he could not take his arms out of it. So he took them out from underneath the cloak. Then he washed his forearms and passed his wet hands over his head. Then I tried to take off his Khuffs (socks made from thick fabric or leather), but he said, \"Leave them, for I have performed ablution before putting them on.\" And so he passed his wet hands over them.",
        "malay_translation": "Pada suatu malam, saya bersama Nabi ﷺ dalam suatu perjalanan. Baginda bertanya kepada saya, \"Adakah kamu mempunyai air?\" Saya menjawab, \"Ya.\" Lalu baginda turun dari unta betinanya dan pergi sehingga hilang dalam kegelapan malam. Kemudian baginda kembali dan saya menuangkan air untuk baginda dari bekas (untuk berwuduk). Baginda membasuh muka dan tangan baginda semasa memakai jubah bulu (yang lengan bajunya sempit), jadi baginda tidak dapat mengeluarkan lengan baginda dari jubah itu. Oleh itu, baginda mengeluarkannya dari bawah jubah. Kemudian baginda membasuh lengan bawah baginda dan menyapu tangan yang basah ke atas kepala baginda. Kemudian saya cuba menanggalkan Khuff (stokin yang diperbuat daripada kain tebal atau kulit) baginda, tetapi baginda berkata, \"Biarkan ia, kerana saya telah berwuduk sebelum memakainya.\" Dan baginda pun menyapu tangan yang basah ke atasnya.",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا زَكَرِيَّاءُ، عَنْ عَامِرٍ، عَنْ عُرْوَةَ بْنِ الْمُغِيرَةِ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ كُنْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم ذَاتَ لَيْلَةٍ فِي سَفَرٍ فَقَالَ ‏\"‏ أَمَعَكَ مَاءٌ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ فَنَزَلَ عَنْ رَاحِلَتِهِ، فَمَشَى حَتَّى تَوَارَى عَنِّي فِي سَوَادِ اللَّيْلِ، ثُمَّ جَاءَ فَأَفْرَغْتُ عَلَيْهِ الإِدَاوَةَ، فَغَسَلَ وَجْهَهُ وَيَدَيْهِ، وَعَلَيْهِ جُبَّةٌ مِنْ صُوفٍ، فَلَمْ يَسْتَطِعْ أَنْ يُخْرِجَ ذِرَاعَيْهِ مِنْهَا حَتَّى أَخْرَجَهُمَا مِنْ أَسْفَلِ الْجُبَّةِ، فَغَسَلَ ذِرَاعَيْهِ، ثُمَّ مَسَحَ بِرَأْسِهِ، ثُمَّ أَهْوَيْتُ لأَنْزِعَ خُفَّيْهِ فَقَالَ ‏\"‏ دَعْهُمَا، فَإِنِّي أَدْخَلْتُهُمَا طَاهِرَتَيْنِ، فَمَسَحَ عَلَيْهِمَا ‏\"‏‏.‏"
      },
      {
        "id": 5551,
        "hadith_number": "5800",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah (ﷺ) Memberi Kaba Kepada Makhrama (رضی اللہ عنہ)",
        "perawi_melayu": "Diriwayatkan oleh Al-Miswar bin Makhrama (رضی اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) distributed some Qaba's but he did not give anything to Makhrama رضی اللہ عنہ . Makhrama رضی اللہ عنہ said (to me), \"O my son! Let us go to Allah's Messenger (ﷺ).\" So I proceeded with him and he said, \"Go in and call him 'or me.\" So I called the Prophet (ﷺ) for him The Prophet (ﷺ) came out to him, wearing one of those Qaba's and said, (to Makhrama رضی اللہ عنہ ), \"I have kept this for you \" Makhrama رضی اللہ عنہ looked at it and said, \"Makhrama is satisfied now.\"",
        "malay_translation": "Rasulullah (ﷺ) mengagihkan beberapa helai Qaba, tetapi baginda tidak memberikan apa-apa kepada Makhrama رضی اللہ عنہ . Makhrama رضی اللہ عنہ berkata (kepada saya), \"Wahai anakku! Marilah kita pergi kepada Rasulullah (ﷺ).\" Lalu saya pergi bersamanya dan dia berkata, \"Masuklah dan panggil dia 'atau saya.\" Lalu saya memanggil Nabi (ﷺ) untuknya. Nabi (ﷺ) keluar menemuinya, memakai salah satu daripada Qaba' itu dan berkata, (kepada Makhrama رضی اللہ عنہ ), \"Aku telah menyimpan ini untukmu.\" Makhrama رضی اللہ عنہ memandangnya dan berkata, \"Makhrama berpuas hati sekarang.\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، قَالَ قَسَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَقْبِيَةً، وَلَمْ يُعْطِ مَخْرَمَةَ شَيْئًا فَقَالَ مَخْرَمَةُ يَا بُنَىَّ انْطَلِقْ بِنَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَانْطَلَقْتُ مَعَهُ فَقَالَ ادْخُلْ فَادْعُهُ لِي‏.‏ قَالَ فَدَعَوْتُهُ لَهُ، فَخَرَجَ إِلَيْهِ وَعَلَيْهِ قَبَاءٌ مِنْهَا فَقَالَ ‏ \"‏ خَبَأْتُ هَذَا لَكَ ‏\"‏‏.‏ قَالَ فَنَظَرَ إِلَيْهِ فَقَالَ رَضِيَ مَخْرَمَةُ‏.‏"
      },
      {
        "id": 5552,
        "hadith_number": "5801",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Memakai Pakaian Sutera bagi Orang yang Bertaqwa",
        "perawi_melayu": "Diriwayatkan oleh `Uqba bin 'Amir رضي اللہ عنہ :",
        "english_text": "A silken Farruj was presented to Allah's Messenger (ﷺ) and he put it on and offered the prayer in it. When he finished the prayer, he took it off violently as if he disliked it and said, \"This (garment) does not befit those who fear Allah!\" Similarly, Obaidullah bin Yousuf has corroborated him from Laith and the other people said: Silken robe.",
        "malay_translation": "Sehelai Farruj sutera dihadiahkan kepada Rasulullah (ﷺ), lalu baginda memakainya dan menunaikan solat dengannya. Setelah selesai solat, baginda menanggalkannya dengan kasar seolah-olah baginda tidak menyukainya dan bersabda, \"Pakaian ini tidak layak bagi orang yang bertaqwa!\" Begitu juga, `Ubaidullah bin Yousuf telah mengesahkannya dari Laith dan orang lain berkata: Jubah sutera.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ ـ رضى الله عنه ـ أَنَّهُ قَالَ أُهْدِيَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَرُّوجُ حَرِيرٍ، فَلَبِسَهُ، ثُمَّ صَلَّى فِيهِ، ثُمَّ انْصَرَفَ فَنَزَعَهُ نَزْعًا شَدِيدًا كَالْكَارِهِ لَهُ ثُمَّ قَالَ ‏ \"‏ لاَ يَنْبَغِي هَذَا لِلْمُتَّقِينَ ‏\"‏‏.‏ تَابَعَهُ عَبْدُ اللَّهِ بْنُ يُوسُفَ عَنِ اللَّيْثِ، وَقَالَ غَيْرُهُ فَرُّوجٌ حَرِيرٌ‏.‏"
      },
      {
        "id": 5553,
        "hadith_number": "5802",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Anas memakai jubah kuning berhud Khazz",
        "perawi_melayu": "Diriwayatkan oleh bapa Mu'tamir:",
        "english_text": "\"I saw Anas رضی اللہ عنہ wearing a yellow hooded cloak of Khazz.\"",
        "malay_translation": "Saya melihat Anas رضی اللہ عنہ memakai jubah kuning berhud daripada Khazz.",
        "arabic_text": "وَقَالَ لِي مُسَدَّدٌ حَدَّثَنَا مُعْتَمِرٌ، سَمِعْتُ أَبِي قَالَ، رَأَيْتُ عَلَى أَنَسٍ بُرْنُسًا أَصْفَرَ مِنْ خَزٍّ‏.‏"
      },
      {
        "id": 5554,
        "hadith_number": "5803",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pakaian Yang Dilarang Bagi Muhrim",
        "perawi_melayu": "Diriwayatkan oleh `Abdullah bin `Umar رضی اللہ عنہما :",
        "english_text": "A man said, \"O Allah's Messenger (ﷺ). What type of clothes should a Muhrim wear Allah's Messenger (ﷺ) replied, 'Do not wear shirts, turbans trousers hooded cloaks or Khuffs (socks made from thick fabric or leather); but if someone cannot get sandals, then he can wear Khuffs after cutting them short below the ankles. Do not wear clothes touched by saffon or wars (two kinds of perfumes).",
        "malay_translation": "Seorang lelaki bertanya, \"Wahai Rasulullah (ﷺ), apakah jenis pakaian yang harus dipakai oleh seorang Muhrim? Rasulullah (ﷺ) menjawab, 'Jangan memakai baju, serban, seluar, jubah berhood atau Khuffs (stokin yang diperbuat daripada kain tebal atau kulit); tetapi jika seseorang tidak dapat mendapatkan sandal, maka dia boleh memakai Khuffs setelah memotongnya pendek di bawah buku lali. Jangan memakai pakaian yang terkena safron atau wars (dua jenis minyak wangi).",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَجُلاً، قَالَ يَا رَسُولَ اللَّهِ مَا يَلْبَسُ الْمُحْرِمُ مِنَ الثِّيَابِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَلْبَسُوا الْقُمُصَ، وَلاَ الْعَمَائِمَ، وَلاَ السَّرَاوِيلاَتِ، وَلاَ الْبَرَانِسَ، وَلاَ الْخِفَافَ، إِلاَّ أَحَدٌ لاَ يَجِدُ النَّعْلَيْنِ، فَلْيَلْبَسْ خُفَّيْنِ، وَلْيَقْطَعْهُمَا أَسْفَلَ مِنَ الْكَعْبَيْنِ، وَلاَ تَلْبَسُوا مِنَ الثِّيَابِ شَيْئًا مَسَّهُ زَعْفَرَانٌ وَلاَ الْوَرْسُ ‏\"‏‏.‏"
      },
      {
        "id": 5555,
        "hadith_number": "5804",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pakaian Alternatif Bagi Mereka yang Tidak Memiliki Izar atau Sandal",
        "perawi_melayu": "Diriwayatkan oleh Ibnu Abbas رضی اللہ عنہما :",
        "english_text": "The Prophet (ﷺ) said, \"Whoever cannot get an Izar, can wear trousers, and whoever cannot wear sandals can wear Khuffs (socks made from thick fabric or leather).\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Sesiapa yang tidak dapat memakai Izar, maka boleh memakai seluar, dan sesiapa yang tidak dapat memakai sandal, maka boleh memakai Khuffs (stokin yang diperbuat daripada kain tebal atau kulit).\"",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ جَابِرِ بْنِ زَيْدٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ لَمْ يَجِدْ إِزَارًا فَلْيَلْبَسْ سَرَاوِيلَ، وَمَنْ لَمْ يَجِدْ نَعْلَيْنِ فَلْيَلْبَسْ خُفَّيْنِ ‏\"‏‏.‏"
      },
      {
        "id": 5556,
        "hadith_number": "5805",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Pakaian Ihram",
        "perawi_melayu": "Diriwayatkan oleh `Abdullah:",
        "english_text": "A man got up and said, O Allah's Messenger (ﷺ)! What do you order us to wear when we assume the state of Ihram?\" The Prophet (ﷺ) replied, \"Do not wear shirts, trousers, turbans, hooded cloaks or Khuffs (socks made from thick fabric or leather), but if a man has no sandals, he can wear Khuffs after cutting them short below the ankles; and do not wear clothes touched with (perfumes) of saffron or wars.\"",
        "malay_translation": "Seorang lelaki bangun dan berkata, “Wahai Rasulullah (ﷺ)! Apakah yang engkau perintahkan kepada kami untuk dipakai semasa kami dalam ihram?” Nabi (ﷺ) menjawab, “Janganlah memakai baju, seluar, serban, jubah berhood atau Khuffs (stokin yang diperbuat daripada kain tebal atau kulit), tetapi jika seseorang lelaki tidak mempunyai sandal, dia boleh memakai Khuffs setelah memotongnya pendek di bawah buku lali; dan janganlah memakai pakaian yang terkena (wangian) safron atau wars.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ مَا تَأْمُرُنَا أَنْ نَلْبَسَ إِذَا أَحْرَمْنَا‏.‏ قَالَ ‏ \"‏ لاَ تَلْبَسُوا الْقَمِيصَ، وَالسَّرَاوِيلَ، وَالْعَمَائِمَ وَالْبَرَانِسَ، وَالْخِفَافَ، إِلاَّ أَنْ يَكُونَ رَجُلٌ لَيْسَ لَهُ نَعْلاَنِ، فَلْيَلْبَسِ الْخُفَّيْنِ أَسْفَلَ مِنَ الْكَعْبَيْنِ، وَلاَ تَلْبَسُوا شَيْئًا مِنَ الثِّيَابِ مَسَّهُ زَعْفَرَانٌ وَلاَ وَرْسٌ ‏\"‏‏.‏"
      },
      {
        "id": 5557,
        "hadith_number": "5806",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Pakaian Ihram",
        "perawi_melayu": "Daripada Abdullah bin Umar رضی اللہ عنہما :",
        "english_text": "The Prophet (ﷺ) said, \"A Muhrim should not wear a shirt, a turban, trousers, hooded cloaks, a garment touched with (perfumes) of saffron or wars, or Khuffs (socks made from thick fabric or leather) except if one has no sandals in which case he should cut short the Khuffs below the ankles.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Seorang Muhrim tidak boleh memakai baju, serban, seluar, jubah berhud, pakaian yang terkena (wangian) safron atau wars, atau Khuffs (stokin yang diperbuat daripada kain tebal atau kulit) kecuali jika seseorang itu tidak mempunyai sandal, dalam hal ini dia hendaklah memotong Khuffs di bawah buku lali.\"",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ الزُّهْرِيَّ، قَالَ أَخْبَرَنِي سَالِمٌ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَلْبَسُ الْمُحْرِمُ الْقَمِيصَ، وَلاَ الْعِمَامَةَ، وَلاَ السَّرَاوِيلَ، وَلاَ الْبُرْنُسَ، وَلاَ ثَوْبًا مَسَّهُ زَعْفَرَانٌ، وَلاَ وَرْسٌ، وَلاَ الْخُفَّيْنِ، إِلاَّ لِمَنْ لَمْ يَجِدِ النَّعْلَيْنِ، فَإِنْ لَمْ يَجِدْهُمَا فَلْيَقْطَعْهُمَا أَسْفَلَ مِنَ الْكَعْبَيْنِ ‏\"‏‏.‏"
      },
      {
        "id": 5558,
        "hadith_number": "5807",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Penghijrahan Nabi SAW bersama Abu Bakr RA ke Madinah",
        "perawi_melayu": "Diriwayatkan oleh `Aisha رضی اللہ عنہا :",
        "english_text": "Some Muslim men emigrated to Ethiopia whereupon Abu Bakr رضی اللہ عنہ also prepared himself for the emigration, but the Prophet (ﷺ) said (to him), \"Wait, for I hope that Allah will allow me also to emigrate.\" Abu Bakr رضی اللہ عنہ said, \"Let my father and mother be sacrificed for you. Do you hope that (emigration)?\" The Prophet said, 'Yes.\" So Abu Bakr رضی اللہ عنہ waited to accompany the Prophet (ﷺ) and fed two she-camels he had on the leaves of As-Samur tree regularly for four months One day while we were sitting in our house at midday, someone said to Abu Bakr رضی اللہ عنہ , \"Here is Allah's Messenger (ﷺ), coming with his head and a part of his face covered with a cloth-covering at an hour he never used to come to us.\" Abu Bakr رضی اللہ عنہ said, \"Let my father and mother be sacrificed for you, (O Prophet)! An urgent matter must have brought you here at this hour.\" The Prophet (ﷺ) came and asked the permission to enter, and he was allowed. The Prophet (ﷺ) entered and said to Abu Bakr رضی اللہ عنہ , \"Let those who are with you, go out.\" Abu Bakr رضی اللہ عنہ replied, \"(There is no stranger); they are your family. Let my father be sacrificed for you, O Allah's Apostle!\" The Prophet (ﷺ) said, \"I have been allowed to leave (Mecca).\" Abu Bakr رضی اللہ عنہ said, \" I shall accompany you, O Allah's Messenger (ﷺ), Let my father be sacrificed for you!\" The Prophet (ﷺ) said, \"Yes,\" Abu Bakr رضی اللہ عنہ  said, 'O Allah's Messenger (ﷺ)s! Let my father be sacrificed for you. Take one of these two shecamels of mine\" The Prophet (ﷺ) said. I will take it only after paying its price.\" So we prepared their baggage and put their journey food In a leather bag. And Asma' bint Abu Bakr cut a piece of her girdle and tied the mouth of the leather bag with it. That is why she was called Dhatan- Nitaqaln. Then the Prophet (ﷺ) and Abu Bakr رضی اللہ عنہ went to a cave in a mountain called Thour and remained there for three nights. `Abdullah bin Abu Bakr رضی اللہ عنہ . who was a young intelligent man. used to stay with them at night and leave before dawn so that in the morning, he would he with the Quraish at Mecca as if he had spent the night among them. If he heard of any plot contrived by the Quraish against the Prophet and Abu Bakr رضی اللہ عنہ , he would understand it and (return to) inform them of it when it became dark. 'Amir bin Fuhaira رضی اللہ عنہ , the freed slave of Abu Bakr رضی اللہ عنہ used to graze a flock of milch sheep for them and he used to take those sheep to them when an hour had passed after the `Isha prayer. They would sleep soundly till 'Amir bin Fuhaira رضی اللہ عنہ awakened them when it was still dark. He used to do that in each of those three nights.",
        "malay_translation": "Beberapa orang lelaki Muslim berhijrah ke Habsyah. Kemudian, Abu Bakr bersiap sedia untuk berhijrah, tetapi Nabi SAW berkata, “Tunggulah, kerana aku berharap Allah akan mengizinkan aku juga untuk berhijrah.” Abu Bakr berkata, “Semoga ayah dan ibuku menjadi tebusanmu. Adakah kamu mengharapkan (penghijrahan)?” Nabi SAW menjawab, “Ya.” Abu Bakr menunggu untuk mengiringi Nabi SAW dan memberi makan dua ekor unta betina dengan daun pokok As-Samur selama empat bulan. Pada suatu hari, ketika kami sedang duduk di rumah pada waktu tengah hari, seseorang berkata kepada Abu Bakr, “Ini adalah Rasulullah SAW, datang dengan kepala dan sebahagian wajahnya ditutupi kain pada waktu yang tidak pernah datang kepada kami.” Abu Bakr berkata, “Semoga ayah dan ibuku menjadi tebusanmu, (Wahai Nabi)! Suatu perkara yang mendesak pasti telah membawamu ke sini pada waktu ini.” Nabi SAW datang dan meminta izin untuk masuk, lalu diizinkan. Nabi SAW masuk dan berkata kepada Abu Bakr, “Biarkan mereka yang bersamamu, keluar.” Abu Bakr menjawab, “(Tidak ada orang asing); mereka adalah keluargamu. Semoga ayahku menjadi tebusanmu, Wahai Rasulullah!” Nabi SAW berkata, “Aku telah diizinkan untuk meninggalkan (Mekah).” Abu Bakr berkata, “Aku akan menemanimu, Wahai Rasulullah SAW, Semoga ayahku menjadi tebusanmu!” Nabi SAW menjawab, “Ya.” Abu Bakr berkata, “Wahai Rasulullah SAW! Semoga ayahku menjadi tebusanmu. Ambillah salah satu daripada dua ekor unta betina milikku ini.” Nabi SAW berkata, “Aku akan mengambilnya setelah membayar harganya.” Kami menyediakan bekalan dan makanan perjalanan mereka di dalam beg kulit. Asma’ bint Abu Bakr memotong sehelai tali pinggangnya dan mengikat mulut beg kulit itu. Itulah sebabnya dia dipanggil Dhatan-Nitaqaln. Kemudian, Nabi SAW dan Abu Bakr pergi ke gua di gunung bernama Thour dan tinggal di sana selama tiga malam. Abdullah bin Abu Bakr, seorang lelaki muda yang bijak, akan tinggal bersama mereka pada waktu malam dan pergi sebelum subuh agar pada waktu pagi, dia bersama kaum Quraisy di Mekah seolah-olah dia menghabiskan malam bersama mereka. Jika dia mendengar sebarang rancangan oleh kaum Quraisy terhadap Nabi SAW dan Abu Bakr, dia akan memahaminya dan memaklumkannya apabila ia menjadi gelap. Amir bin Fuhaira, hamba yang dibebaskan oleh Abu Bakr, menggembalakan sekumpulan biri-biri perahan susu untuk mereka dan membawa biri-biri itu kepada mereka selepas solat Isyak. Mereka tidur nyenyak sehingga Amir bin Fuhaira membangunkan mereka ketika masih gelap. Dia melakukan itu dalam setiap tiga malam tersebut.",
        "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ هَاجَرَ إِلَى الْحَبَشَةِ نَاسٌ مِنَ الْمُسْلِمِينَ، وَتَجَهَّزَ أَبُو بَكْرٍ مُهَاجِرًا، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ عَلَى رِسْلِكَ، فَإِنِّي أَرْجُو أَنْ يُؤْذَنَ لِي ‏\"‏‏.‏ فَقَالَ أَبُو بَكْرٍ أَوَ تَرْجُوهُ بِأَبِي أَنْتَ قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ فَحَبَسَ أَبُو بَكْرٍ نَفْسَهُ عَلَى النَّبِيِّ صلى الله عليه وسلم لِصُحْبَتِهِ، وَعَلَفَ رَاحِلَتَيْنِ كَانَتَا عِنْدَهُ وَرَقَ السَّمُرِ أَرْبَعَةَ أَشْهُرٍ‏.‏ قَالَ عُرْوَةُ قَالَتْ عَائِشَةُ فَبَيْنَا نَحْنُ يَوْمًا جُلُوسٌ فِي بَيْتِنَا فِي نَحْرِ الظَّهِيرَةِ فَقَالَ قَائِلٌ لأَبِي بَكْرٍ هَذَا رَسُولُ اللَّهِ صلى الله عليه وسلم مُقْبِلاً مُتَقَنِّعًا، فِي سَاعَةٍ لَمْ يَكُنْ يَأْتِينَا فِيهَا‏.‏ قَالَ أَبُو بَكْرٍ فِدًا لَهُ بِأَبِي وَأُمِّي، وَاللَّهِ إِنْ جَاءَ بِهِ فِي هَذِهِ السَّاعَةِ إِلاَّ لأَمْرٍ‏.‏ فَجَاءَ النَّبِيُّ صلى الله عليه وسلم فَاسْتَأْذَنَ، فَأَذِنَ لَهُ فَدَخَلَ، فَقَالَ حِينَ دَخَلَ لأَبِي بَكْرٍ ‏\"‏ أَخْرِجْ مَنْ عِنْدَكَ ‏\"‏‏.‏ قَالَ إِنَّمَا هُمْ أَهْلُكَ بِأَبِي أَنْتَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ فَإِنِّي قَدْ أُذِنَ لِي فِي الْخُرُوجِ ‏\"‏‏.‏ قَالَ فَالصُّحْبَةُ بِأَبِي أَنْتَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ قَالَ فَخُذْ بِأَبِي أَنْتَ يَا رَسُولَ اللَّهِ إِحْدَى رَاحِلَتَىَّ هَاتَيْنِ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ بِالثَّمَنِ ‏\"‏‏.‏ قَالَتْ فَجَهَّزْنَاهُمَا أَحَثَّ الْجِهَازِ، وَضَعْنَا لَهُمَا سُفْرَةً فِي جِرَابٍ، فَقَطَعَتْ أَسْمَاءُ بِنْتُ أَبِي بَكْرٍ قِطْعَةً مِنْ نِطَاقِهَا، فَأَوْكَتْ بِهِ الْجِرَابَ، وَلِذَلِكَ كَانَتْ تُسَمَّى ذَاتَ النِّطَاقِ، ثُمَّ لَحِقَ النَّبِيُّ صلى الله عليه وسلم وَأَبُو بَكْرٍ بِغَارٍ فِي جَبَلٍ يُقَالُ لَهُ ثَوْرٌ، فَمَكُثَ فِيهِ ثَلاَثَ لَيَالٍ يَبِيتُ عِنْدَهُمَا عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ، وَهْوَ غُلاَمٌ شَابٌّ لَقِنٌ ثَقِفٌ، فَيَرْحَلُ مِنْ عِنْدِهِمَا سَحَرًا، فَيُصْبِحُ مَعَ قُرَيْشٍ بِمَكَّةَ كَبَائِتٍ، فَلاَ يَسْمَعُ أَمْرًا يُكَادَانِ بِهِ إِلاَّ وَعَاهُ، حَتَّى يَأْتِيَهُمَا بِخَبَرِ ذَلِكَ حِينَ يَخْتَلِطُ الظَّلاَمُ، وَيَرْعَى عَلَيْهِمَا عَامِرُ بْنُ فُهَيْرَةَ مَوْلَى أَبِي بَكْرٍ مِنْحَةً مِنْ غَنَمٍ، فَيُرِيحُهَا عَلَيْهِمَا حِينَ تَذْهَبُ سَاعَةٌ مِنَ الْعِشَاءِ، فَيَبِيتَانِ فِي رِسْلِهَا حَتَّى يَنْعِقَ بِهَا عَامِرُ بْنُ فُهَيْرَةَ بِغَلَسٍ، يَفْعَلُ ذَلِكَ كُلَّ لَيْلَةٍ مِنْ تِلْكَ اللَّيَالِي الثَّلاَثِ‏.‏"
      },
      {
        "id": 5559,
        "hadith_number": "5808",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah (ﷺ) Memasuki Mekah dengan Memakai Helmet",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik رضی اللہ عنہ :",
        "english_text": "In the year of the conquest of Mecca the Prophet (ﷺ) entered Mecca, wearing a helmet on his head.",
        "malay_translation": "Pada tahun pembukaan Kota Mekah, Nabi (ﷺ) memasuki Mekah dengan memakai helmet di kepalanya.",
        "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا مَالِكٌ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ مَكَّةَ عَامَ الْفَتْحِ وَعَلَى رَأْسِهِ الْمِغْفَرُ‏.‏"
      },
      {
        "id": 5560,
        "hadith_number": "5809",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Sifat Pemurah Rasulullah ﷺ",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik رضي الله عنه :",
        "english_text": "Once I was walking with Allah's Messenger (ﷺ) and he was wearing a Najram Burd with thick margin. A bedouin followed him and pulled his Burd so violently that I noticed the side of the shoulder of Allah's Messenger (ﷺ) affected by the margin of the Burd because of that violent pull. The Bedouin said, \"O Muhammad! Give me some of Allah's wealth which is with you.\" Allah's Messenger (ﷺ) turned and looked at him, and smiling, 'he ordered that he be given something.",
        "malay_translation": "Suatu ketika, aku sedang berjalan bersama Rasulullah ﷺ dan Baginda memakai burd Najrani yang tebal tepinya. Seorang Badwi mengejarnya dan menarik burd Baginda dengan kuat sekali sehingga aku melihat kesan tepi burd itu pada bahu Rasulullah ﷺ kerana tarikan yang kuat itu. Badwi itu berkata, \"Wahai Muhammad! Berilah aku sedikit daripada harta Allah yang ada padamu.\" Rasulullah ﷺ berpaling dan memandangnya sambil tersenyum, lalu Baginda memerintahkan agar dia diberi sesuatu.",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كُنْتُ أَمْشِي مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَعَلَيْهِ بُرْدٌ نَجْرَانِيٌّ غَلِيظُ الْحَاشِيَةِ، فَأَدْرَكَهُ أَعْرَابِيٌّ فَجَبَذَهُ بِرِدَائِهِ جَبْذَةً شَدِيدَةً، حَتَّى نَظَرْتُ إِلَى صَفْحَةِ عَاتِقِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَدْ أَثَّرَتْ بِهَا حَاشِيَةُ الْبُرْدِ مِنْ شِدَّةِ جَبْذَتِهِ، ثُمَّ قَالَ يَا مُحَمَّدُ مُرْ لِي مِنْ مَالِ اللَّهِ الَّذِي عِنْدَكَ‏.‏ فَالْتَفَتَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ ضَحِكَ ثُمَّ أَمَرَ لَهُ بِعَطَاءٍ‏.‏"
      },
      {
        "id": 5561,
        "hadith_number": "5810",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Wanita Memberi Burda kepada Nabi ﷺ",
        "perawi_melayu": "Riwayat Sahl bin Sa`d رضی اللہ عنہ :",
        "english_text": "\"A lady came with a Burda. Sahl then asked (the people), \"Do you know what Burda is?\" Somebody said, \"Yes. it is a Shamla with a woven border.\" Sahl added, \"The lady said, 'O Allah's Messenger (ﷺ)! I have knitted this (Burda) with my own hands for you to wear it.\" Allah's Messenger (ﷺ) took it and he was in need of it. Allah's Messenger (ﷺ) came out to us and he was wearing it as an Izar. A man from the people felt it and said, 'O Allah's Messenger (ﷺ)! Give it to me to wear.' The Prophet (ﷺ) s said, 'Yes.' Then he sat there for some time (and when he went to his house), he folded it and sent it to him. The people said to that man, 'You have not done a right thing. You asked him for it, though you know that he does not put down anybody's request.' The man said, 'By Allah! I have only asked him so that it may be my shroud when I die.\" Sahl رضی اللہ عنہ added, \"Late it was his shroud.\"",
        "malay_translation": "Seorang wanita datang dengan membawa sehelai Burda. Sahl kemudian bertanya kepada orang ramai, \"Adakah kamu tahu apa itu Burda?\" Seseorang berkata, \"Ya, ia adalah Shamla yang bertepi tenunan.\" Sahl menambah, \"Wanita itu berkata, 'Wahai Rasulullah ﷺ! Aku telah menjahit (Burda) ini dengan tanganku sendiri untuk engkau pakai.' Rasulullah ﷺ mengambilnya dan baginda memang memerlukannya. Rasulullah ﷺ keluar menemui kami dan baginda memakainya sebagai Izar. Seorang lelaki daripada kalangan orang ramai merasainya dan berkata, 'Wahai Rasulullah ﷺ! Berikanlah ia kepadaku untuk aku pakai.' Nabi ﷺ bersabda, 'Baiklah.' Kemudian baginda duduk di situ untuk beberapa ketika (dan apabila baginda pulang ke rumah), baginda melipatnya dan menghantarnya kepadanya. Orang ramai berkata kepada lelaki itu, 'Kamu tidak melakukan perkara yang betul. Kamu memintanya daripada baginda, sedangkan kamu tahu bahawa baginda tidak menolak permintaan sesiapa.' Lelaki itu berkata, 'Demi Allah! Aku memintanya hanya supaya ia menjadi kain kafanku apabila aku mati.' Sahl رضی اللہ عنہ menambah, \"Akhirnya ia menjadi kain kafannya.\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ جَاءَتِ امْرَأَةٌ بِبُرْدَةٍ ـ قَالَ سَهْلٌ هَلْ تَدْرِي مَا الْبُرْدَةُ قَالَ نَعَمْ هِيَ الشَّمْلَةُ، مَنْسُوجٌ فِي حَاشِيَتِهَا ـ قَالَتْ يَا رَسُولَ اللَّهِ إِنِّي نَسَجْتُ هَذِهِ بِيَدِي أَكْسُوكَهَا‏.‏ فَأَخَذَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم مُحْتَاجًا إِلَيْهَا، فَخَرَجَ إِلَيْنَا وَإِنَّهَا لإِزَارُهُ، فَجَسَّهَا رَجُلٌ مِنَ الْقَوْمِ فَقَالَ يَا رَسُولَ اللَّهِ اكْسُنِيهَا‏.‏ قَالَ ‏ \"‏ نَعَمْ ‏\"‏‏.‏ فَجَلَسَ مَا شَاءَ اللَّهُ فِي الْمَجْلِسِ، ثُمَّ رَجَعَ، فَطَوَاهَا ثُمَّ أَرْسَلَ بِهَا إِلَيْهِ‏.‏ فَقَالَ لَهُ الْقَوْمُ مَا أَحْسَنْتَ، سَأَلْتَهَا إِيَّاهُ وَقَدْ عَرَفْتَ أَنَّهُ لاَ يَرُدُّ سَائِلاً‏.‏ فَقَالَ الرَّجُلُ وَاللَّهِ مَا سَأَلْتُهَا إِلاَّ لِتَكُونَ كَفَنِي يَوْمَ أَمُوتُ‏.‏ قَالَ سَهْلٌ فَكَانَتْ كَفَنَهُ‏.‏"
      },
      {
        "id": 5562,
        "hadith_number": "5811",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Golongan yang Masuk Syurga Tanpa Hisab",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ عنہ :",
        "english_text": "I heard Allah's Messenger (ﷺ) saying \"From among my followers, a group (o 70,000) will enter Paradise without being asked for their accounts, Their faces will be shining like the moon.\" 'Ukasha bin Muhsin Al-Asadi رضی اللہ عنہ got up, lifting his covering sheet and said, \"O Allah's Messenger (ﷺ) Invoke Allah for me that He may include me with them.\" The Prophet (ﷺ) said! \"O Allah! Make him from them.\" Then another man from Al-Ansar got up and said, \"O Allah's Messenger (ﷺ)! Invoke Allah for me that He may include me with them.\" On that Allah's Messenger (ﷺ) said, \"'Ukasha has anticipated you.\"",
        "malay_translation": "Saya mendengar Rasulullah (ﷺ) bersabda: \"Daripada kalangan umatku, satu golongan (lebih kurang 70,000) akan masuk syurga tanpa dihisab, wajah mereka bersinar seperti bulan.\" 'Ukasha bin Muhsin Al-Asadi رضی اللہ عنہ bangun, mengangkat selimutnya dan berkata, \"Wahai Rasulullah (ﷺ)! Doakanlah kepada Allah untukku agar Dia memasukkan aku bersama mereka.\" Nabi (ﷺ) bersabda: \"Ya Allah! Jadikanlah dia daripada kalangan mereka.\" Kemudian seorang lelaki lain daripada kalangan Al-Ansar bangun dan berkata, \"Wahai Rasulullah (ﷺ)! Doakanlah kepada Allah untukku agar Dia memasukkan aku bersama mereka.\" Mendengar itu, Rasulullah (ﷺ) bersabda, \"'Ukasha telah mendahului kamu.\"",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ يَدْخُلُ الْجَنَّةَ مِنْ أُمَّتِي زُمْرَةٌ هِيَ سَبْعُونَ أَلْفًا، تُضِيءُ وُجُوهُهُمْ إِضَاءَةَ الْقَمَرِ ‏\"‏‏.‏ فَقَامَ عُكَاشَةُ بْنُ مِحْصَنٍ الأَسَدِيُّ يَرْفَعُ نَمِرَةً عَلَيْهِ قَالَ ادْعُ اللَّهَ لِي يَا رَسُولَ اللَّهِ أَنْ يَجْعَلَنِي مِنْهُمْ‏.‏ فَقَالَ ‏\"‏ اللَّهُمَّ اجْعَلْهُ مِنْهُمْ ‏\"‏‏.‏ ثُمَّ قَامَ رَجُلٌ مِنَ الأَنْصَارِ فَقَالَ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ‏.‏ فَقَالَ رَسُولُ اللَّهِ ‏\"‏ سَبَقَكَ عُكَاشَةُ ‏\"‏‏.‏"
      },
      {
        "id": 5563,
        "hadith_number": "5812",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pakaian Kegemaran Nabi ﷺ",
        "perawi_melayu": "Diriwayatkan daripada Qatada Anas رضي الله عنه:",
        "english_text": "\"What kind of clothes was most beloved to the Prophet?\" He replied, \"The Hibra (a kind of Yemenese cloth).",
        "malay_translation": "\"Apakah jenis pakaian yang paling disukai oleh Nabi?\" Beliau menjawab, \"Al-Hibra (sejenis kain Yaman).\"",
        "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ قُلْتُ لَهُ أَىُّ الثِّيَابِ كَانَ أَحَبَّ إِلَى النَّبِيِّ صلى الله عليه وسلم قَالَ الْحِبَرَةُ‏.‏"
      },
      {
        "id": 5564,
        "hadith_number": "5813",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pakaian Kegemaran Nabi ﷺ",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik رضی اللہ عنہ :",
        "english_text": "The most beloved garment to the Prophet (ﷺ) to wear was the Hibra (a kind of Yemenese cloth).",
        "malay_translation": "Pakaian yang paling disukai oleh Nabi ﷺ untuk dipakai ialah Hibra (sejenis kain Yaman).",
        "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي الأَسْوَدِ، حَدَّثَنَا مُعَاذٌ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، رضى الله عنه ـ قَالَ كَانَ أَحَبُّ الثِّيَابِ إِلَى النَّبِيِّ صلى الله عليه وسلم أَنْ يَلْبَسَهَا الْحِبَرَةَ‏.‏"
      },
      {
        "id": 5565,
        "hadith_number": "5814",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kematian Rasulullah ﷺ dan Kain Penutup",
        "perawi_melayu": "Diriwayatkan oleh 'Aishah (isteri Nabi) رضي اللہ عنہا :",
        "english_text": "When Allah's Messenger (ﷺ) died, he was covered with a Hibra Burd (green square decorated garment).",
        "malay_translation": "Ketika Rasulullah ﷺ wafat, baginda ditutup dengan sehelai Hibra Burd (sehelai pakaian segi empat berwarna hijau yang dihiasi).",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حِينَ تُوُفِّيَ سُجِّيَ بِبُرْدٍ حِبَرَةٍ‏.‏"
      },
      {
        "id": 5566,
        "hadith_number": "5815, 5816",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi SAW Mengingatkan Umat tentang Perbuatan Orang Yahudi dan Kristian",
        "perawi_melayu": "Diriwayatkan oleh `Aisha dan `Abdullah bin `Abbas رضی اللہ عنہم :",
        "english_text": "When the disease of Allah's Messenger (ﷺ) got aggravated, he covered his face with a Khamisa, but when he became short of breath, he would remove it from his face and say, \"It is like that! May Allah curse the Jews Christians because they took the graves of their prophets as places of worship.\" By that he warned his follower of imitating them, by doing that which they did.",
        "malay_translation": "Ketika penyakit Rasulullah (ﷺ) semakin teruk, baginda menutup wajahnya dengan Khamisa, tetapi apabila baginda sesak nafas, baginda akan menanggalkannya dari wajahnya dan berkata, \"Adalah seperti itu! Semoga Allah melaknat orang Yahudi dan Kristian kerana mereka menjadikan kubur nabi-nabi mereka sebagai tempat ibadat.\" Dengan itu, baginda memberi amaran kepada pengikutnya agar tidak meniru mereka, dengan melakukan apa yang mereka lakukan.",
        "arabic_text": "حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ عَائِشَةَ، وَعَبْدَ اللَّهِ بْنَ عَبَّاسٍ، رضى الله عنهم قَالاَ لَمَّا نَزَلَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم طَفِقَ يَطْرَحُ خَمِيصَةً لَهُ عَلَى وَجْهِهِ، فَإِذَا اغْتَمَّ كَشَفَهَا عَنْ وَجْهِهِ، فَقَالَ وَهْوَ كَذَلِكَ ‏ \"‏ لَعْنَةُ اللَّهِ عَلَى الْيَهُودِ وَالنَّصَارَى اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ ‏\"‏‏.‏ يُحَذِّرُ مَا صَنَعُوا‏.‏"
      },
      {
        "id": 5567,
        "hadith_number": "5817",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi ﷺ Menanggalkan Khamisa Berukir Kerana Mengganggu Solat",
        "perawi_melayu": "Diriwayatkan daripada Aisyah رضي الله عنها:",
        "english_text": "Allah's Messenger (ﷺ) offered prayer while he was wearing a Khamisa of his that had printed marks. He looked at its marks and when he finished prayer, he said, \"Take this Khamisa of mine to Abu Jahm, for it has just now diverted my attention from my prayer, and bring to me the Anbijania (a plain thick sheet) of Abu Jahm bin Hudhaifa bin Ghanim who belonged to Bani Adi bin Ka`b.\"",
        "malay_translation": "Rasulullah ﷺ menunaikan solat sambil memakai Khamisa miliknya yang mempunyai tanda bercetak. Baginda melihat tanda tersebut dan apabila selesai solat, baginda bersabda, \"Ambil Khamisa ini kepada Abu Jahm, kerana ia baru sahaja mengganggu tumpuan ku daripada solat, dan bawakan kepadaku Anbijania (sehelai kain tebal yang kosong) milik Abu Jahm bin Hudhaifa bin Ghanim yang berasal dari Bani Adi bin Ka`b.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي خَمِيصَةٍ لَهُ لَهَا أَعْلاَمٌ، فَنَظَرَ إِلَى أَعْلاَمِهَا نَظْرَةً، فَلَمَّا سَلَّمَ قَالَ ‏ \"‏ اذْهَبُوا بِخَمِيصَتِي هَذِهِ إِلَى أَبِي جَهْمٍ، فَإِنَّهَا أَلْهَتْنِي آنِفًا عَنْ صَلاَتِي، وَائْتُونِي بِأَنْبِجَانِيَّةِ أَبِي جَهْمِ بْنِ حُذَيْفَةَ بْنِ غَانِمٍ مِنْ بَنِي عَدِيِّ بْنِ كَعْبٍ ‏\"‏‏.‏"
      },
      {
        "id": 5568,
        "hadith_number": "5818",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kematian Nabi (ﷺ) dalam Pakaian",
        "perawi_melayu": "Diriwayatkan oleh Abu Burda:",
        "english_text": "Aisha رضی اللہ عنہا brought out to us a Kisa and an Izar and said, \"The Prophet (ﷺ) died while wearing these two.\" (Kisa, a square black piece of woolen cloth. Izar, a sheet cloth garment covering the lower half of the body).",
        "malay_translation": "Aishah رضی اللہ عنہا mengeluarkan kepada kami sehelai Kisa dan sehelai Izar lalu berkata, \"Nabi (ﷺ) wafat semasa memakai kedua-dua pakaian ini.\" (Kisa, sehelai kain bulu hitam berbentuk segi empat. Izar, sehelai kain yang menutupi bahagian bawah badan).",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا أَيُّوبُ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ أَبِي بُرْدَةَ، قَالَ أَخْرَجَتْ إِلَيْنَا عَائِشَةُ كِسَاءً وَإِزَارًا غَلِيظًا فَقَالَتْ قُبِضَ رُوحُ النَّبِيِّ صلى الله عليه وسلم فِي هَذَيْنِ‏.‏"
      },
      {
        "id": 5569,
        "hadith_number": "5819",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Nabi (ﷺ) terhadap beberapa urusan dan amalan",
        "perawi_melayu": "Riwayat daripada Abu Hurairah رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) had forbidden: (A) the Mulamasa and Munabadha (bargains), (B) the offering of two prayers, one after the morning compulsory prayer till the sun rises, and the others, after the `Asr prayer till the sun sets (C) He also forbade that one should sit wearing one garment, nothing of which covers his private parts (D) and prevent them from exposure to the sky; (E) he also forbade Ishtimalas- Samma'.",
        "malay_translation": "Rasulullah (ﷺ) telah melarang: (A) Mu'alamasah dan Munabadzah (urusniaga), (B) menunaikan dua solat, satu selepas solat fardhu Subuh sehingga matahari terbit, dan satu lagi selepas solat 'Asar sehingga matahari terbenam, (C) Baginda juga melarang seseorang itu duduk dengan hanya memakai sehelai pakaian yang tidak menutup auratnya (D) dan menghalang daripada terdedah kepada langit; (E) Baginda juga melarang Ishtimalas- Samma'.",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ خُبَيْبٍ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنِ الْمُلاَمَسَةِ، وَالْمُنَابَذَةِ، وَعَنْ صَلاَتَيْنِ بَعْدَ الْفَجْرِ حَتَّى تَرْتَفِعَ الشَّمْسُ، وَبَعْدَ الْعَصْرِ حَتَّى تَغِيبَ، وَأَنْ يَحْتَبِيَ بِالثَّوْبِ الْوَاحِدِ، لَيْسَ عَلَى فَرْجِهِ مِنْهُ شَىْءٌ بَيْنَهُ وَبَيْنَ السَّمَاءِ، وَأَنْ يَشْتَمِلَ الصَّمَّاءَ‏.‏"
      },
      {
        "id": 5570,
        "hadith_number": "5820",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Dua Cara Berpakaian dan Urusan Jual Beli Tertentu",
        "perawi_melayu": "Diriwayatkan oleh Abu Sa`id Al-Khudri رضی اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) forbade two ways of wearing clothes and two kinds of dealings. (A) He forbade the dealings of the Mulamasa and the Munabadha. In the Mulamasa transaction the buyer just touches the garment he wants to buy at night or by daytime, and that touch would oblige him to buy it. In the Munabadha, one man throws his garment at another and the latter throws his at the former and the barter is complete and valid without examining the two objects or being satisfied with them (B) The two ways of wearing clothes were Ishtimal-as-Samma, i e., to cover one's shoulder with one's garment and leave the other bare: and the other way was to wrap oneself with a garment while one was sitting in such a way that nothing of that garment would cover one's private part.",
        "malay_translation": "Rasulullah (ﷺ) melarang dua cara berpakaian dan dua jenis urusan. (A) Baginda melarang urusan Mulamasa dan Munabadha. Dalam urusan Mulamasa, pembeli hanya menyentuh pakaian yang ingin dibelinya pada waktu malam atau siang hari, dan sentuhan itu akan mewajibkannya untuk membelinya. Dalam Munabadha, seseorang melemparkan pakaiannya kepada orang lain dan orang yang terakhir melemparkannya kepada yang pertama dan urusniaga itu selesai dan sah tanpa memeriksa kedua-dua objek atau berpuas hati dengan mereka. (B) Dua cara berpakaian itu ialah Ishtimal-as-Samma, iaitu menutup bahu dengan pakaian dan membiarkan yang lain terdedah: dan cara yang lain ialah membungkus diri dengan pakaian semasa seseorang itu duduk sedemikian rupa sehingga tiada apa pun daripada pakaian itu akan menutup auratnya.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عَامِرُ بْنُ سَعْدٍ، أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ لِبْسَتَيْنِ وَعَنْ بَيْعَتَيْنِ، نَهَى عَنِ الْمُلاَمَسَةِ وَالْمُنَابَذَةِ فِي الْبَيْعِ، وَالْمُلاَمَسَةُ لَمْسُ الرَّجُلِ ثَوْبَ الآخَرِ بِيَدِهِ بِاللَّيْلِ أَوْ بِالنَّهَارِ، وَلاَ يُقَلِّبُهُ إِلاَّ بِذَلِكَ، وَالْمُنَابَذَةُ أَنْ يَنْبِذَ الرَّجُلُ إِلَى الرَّجُلِ بِثَوْبِهِ، وَيَنْبِذَ الآخَرُ ثَوْبَهُ، وَيَكُونَ ذَلِكَ بَيْعَهُمَا، عَنْ غَيْرِ نَظَرٍ وَلاَ تَرَاضٍ، وَاللِّبْسَتَيْنِ اشْتِمَالُ الصَّمَّاءِ، وَالصَّمَّاءُ أَنْ يَجْعَلَ ثَوْبَهُ عَلَى أَحَدِ عَاتِقَيْهِ، فَيَبْدُو أَحَدُ شِقَّيْهِ لَيْسَ عَلَيْهِ ثَوْبٌ، وَاللِّبْسَةُ الأُخْرَى احْتِبَاؤُهُ بِثَوْبِهِ وَهْوَ جَالِسٌ، لَيْسَ عَلَى فَرْجِهِ مِنْهُ شَىْءٌ‏.‏"
      },
      {
        "id": 5571,
        "hadith_number": "5821",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Rasulullah SAW Terhadap Pakaian Tertentu",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah رضي اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) forbade two types of dresses: (A) To sit in an Ihtiba' posture in one garment nothing of which covers his private parts. (B) to cover one side of his body with one garment and leave the other side bare The Prophet (ﷺ) also forbade the Mulamasa and Munabadha.",
        "malay_translation": "Rasulullah SAW melarang dua jenis pakaian: (A) Duduk dalam keadaan 'Ihtiba' dengan hanya sehelai pakaian yang tidak menutup auratnya. (B) Menutupi satu sisi tubuhnya dengan sehelai pakaian dan membiarkan sisi yang lain terdedah. Nabi SAW juga melarang Mulamasa dan Munabadha.",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ لِبْسَتَيْنِ أَنْ يَحْتَبِيَ الرَّجُلُ فِي الثَّوْبِ الْوَاحِدِ لَيْسَ عَلَى فَرْجِهِ مِنْهُ شَىْءٌ، وَأَنْ يَشْتَمِلَ بِالثَّوْبِ الْوَاحِدِ، لَيْسَ عَلَى أَحَدِ شِقَّيْهِ، وَعَنِ الْمُلاَمَسَةِ وَالْمُنَابَذَةِ‏.‏"
      },
      {
        "id": 5572,
        "hadith_number": "5822",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Ishtimal-as-Samma' dan Duduk Ihtiba' dalam Satu Pakaian",
        "perawi_melayu": "Diriwayatkan oleh Abu Sa`id Al-Khudri رضي الله عنه :",
        "english_text": "The Prophet (ﷺ) forbade Ishtimal-as-Samma' and that a man should sit in an Ihtiba' posture in one garment, nothing of which covers his private parts.",
        "malay_translation": "Nabi ﷺ melarang Ishtimal-as-Samma' dan seorang lelaki duduk dalam keadaan Ihtiba' (mengumpulkan kedua lutut ke dada) dengan hanya memakai satu pakaian, yang mana tidak menutupi auratnya.",
        "arabic_text": "حَدَّثَنِي مُحَمَّدٌ، قَالَ أَخْبَرَنِي مَخْلَدٌ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي ابْنُ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ اشْتِمَالِ الصَّمَّاءِ، وَأَنْ يَحْتَبِيَ الرَّجُلُ فِي ثَوْبٍ وَاحِدٍ، لَيْسَ عَلَى فَرْجِهِ مِنْهُ شَىْءٌ‏.‏"
      },
      {
        "id": 5573,
        "hadith_number": "5823",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi (ﷺ) Memberi Pakaian kepada Ummu Khalid",
        "perawi_melayu": "Diriwayatkan oleh Ummu Khalid binti Khalid رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) was given some clothes including a black Khamisa. The Prophet (ﷺ) said, \"To whom shall we give this to wear?\" The people kept silent whereupon the Prophet (ﷺ) said, \"Fetch Um Khalid for me.\" I (Um Khalid) was brought carried (as I was small girl at that time). The Prophet (ﷺ) took the Khamisa in his hands and made me wear it and said, \"May you live so long that your dress will wear out and you will mend it many times.\" On the Khamisa there were some green or pale designs (The Prophet (ﷺ) saw these designs) and said, \"O Um Khalid! This is Sanah.\" (Sanah in a Ethiopian word meaning beautiful).",
        "malay_translation": "Nabi (ﷺ) diberi beberapa pakaian termasuk Khamisa hitam. Nabi (ﷺ) berkata, \"Kepada siapakah akan kita berikan pakaian ini?\" Orang ramai berdiam diri, kemudian Nabi (ﷺ) berkata, \"Bawalah Ummu Khalid kepadaku.\" Saya (Ummu Khalid) dibawa dalam keadaan diusung (kerana saya masih kecil pada waktu itu). Nabi (ﷺ) mengambil Khamisa di tangannya dan memakaikannya kepada saya sambil berkata, \"Semoga kamu hidup lama sehingga pakaianmu lusuh dan kamu akan membaikinya berkali-kali.\" Pada Khamisa itu terdapat beberapa reka bentuk berwarna hijau atau pudar (Nabi (ﷺ) melihat reka bentuk ini) dan berkata, \"Wahai Ummu Khalid! Ini adalah Sanah.\" (Sanah dalam bahasa Ethiopia bermaksud cantik).",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا إِسْحَاقُ بْنُ سَعِيدٍ، عَنْ أَبِيهِ، سَعِيدِ بْنِ فُلاَنٍ ـ هُوَ عَمْرُو بْنُ سَعِيدِ بْنِ الْعَاصِ ـ عَنْ أُمِّ خَالِدٍ بِنْتِ خَالِدٍ، أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِثِيَابٍ فِيهَا خَمِيصَةٌ سَوْدَاءُ صَغِيرَةٌ فَقَالَ ‏\"‏ مَنْ تَرَوْنَ نَكْسُو هَذِهِ ‏\"‏‏.‏ فَسَكَتَ الْقَوْمُ قَالَ ‏\"‏ ائْتُونِي بِأُمِّ خَالِدٍ ‏\"‏‏.‏ فَأُتِيَ بِهَا تُحْمَلُ فَأَخَذَ الْخَمِيصَةَ بِيَدِهِ فَأَلْبَسَهَا وَقَالَ ‏\"‏ أَبْلِي وَأَخْلِقِي ‏\"‏‏.‏ وَكَانَ فِيهَا عَلَمٌ أَخْضَرُ أَوْ أَصْفَرُ فَقَالَ ‏\"‏ يَا أُمَّ خَالِدٍ هَذَا سَنَاهْ ‏\"‏‏.‏ وَسَنَاهْ بِالْحَبَشِيَّةِ حَسَنٌ‏.‏"
      },
      {
        "id": 5574,
        "hadith_number": "5824",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Tahnik Bayi oleh Nabi Muhammad ﷺ",
        "perawi_melayu": "Diriwayatkan oleh Anas رضي الله عنه :",
        "english_text": "When Um Sulaim رضی اللہ عنہا gave birth to a child. she said to me, \"O Anas! Watch this boy carefully and do not give him anything to eat or drink until you have taken him to the Prophet (ﷺ) tomorrow morning for the Tahnik.\" So the next morning I took the child to the Prophet (ﷺ) who was sitting in a garden and was wearing a Huraithiya Khamisa and was branding the she-camel on which he had come during the Conquest of Mecca.",
        "malay_translation": "Ketika Ummu Sulaim رضي الله عنها melahirkan seorang anak, dia berkata kepada saya, \"Wahai Anas! Jaga anak lelaki ini baik-baik dan jangan berikan dia apa-apa untuk dimakan atau diminum sehingga kamu membawanya kepada Nabi ﷺ esok pagi untuk Tahnik.\" Keesokan paginya, saya membawa anak itu kepada Nabi ﷺ yang sedang duduk di kebun dan memakai Huraithiya Khamisa dan sedang menandai unta betina yang ditungganginya semasa Pembukaan Mekah.",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنِي ابْنُ أَبِي عَدِيٍّ، عَنِ ابْنِ عَوْنٍ، عَنْ مُحَمَّدٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ لَمَّا وَلَدَتْ أُمُّ سُلَيْمٍ قَالَتْ لِي يَا أَنَسُ انْظُرْ هَذَا الْغُلاَمَ فَلاَ يُصِيبَنَّ شَيْئًا حَتَّى تَغْدُوَ بِهِ إِلَى النَّبِيِّ صلى الله عليه وسلم يُحَنِّكُهُ‏.‏ فَغَدَوْتُ بِهِ، فَإِذَا هُوَ فِي حَائِطٍ وَعَلَيْهِ خَمِيصَةٌ حُرَيْثِيَّةٌ، وَهْوَ يَسِمُ الظَّهْرَ الَّذِي قَدِمَ عَلَيْهِ فِي الْفَتْحِ‏.‏"
      },
      {
        "id": 5575,
        "hadith_number": "5825",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukum Perkahwinan Semula Selepas Perceraian: Kisah Rifa`a dan Isterinya",
        "perawi_melayu": "Diriwayatkan oleh `Ikrima رضى الله عنه:",
        "english_text": "Rifa`a رضی اللہ عنہ divorced his wife whereupon `Abdur Rahman bin Az-Zubair Al-Qurazi رضی اللہ عنہ married her. `Aisha رضی اللہ عنہا said that the lady (came), wearing a green veil (and complained to her (Aisha رضی اللہ عنہا ) of her husband and showed her a green spot on her skin caused by beating). It was the habit of ladies to support each other, so when Allah's Messenger (ﷺ) came, `Aisha رضی اللہ عنہا said, \"I have not seen any woman suffering as much as the believing women. Look! Her skin is greener than her clothes!\" When `Abdur Rahman heard that his wife had gone to the Prophet, he came with his two sons from another wife. She said, \"By Allah! I have done no wrong to him but he is impotent and is as useless to me as this,\" holding and showing the fringe of her garment, `Abdur-Rahman said, \"By Allah, O Allah's Messenger (ﷺ)! She has told a lie! I am very strong and can satisfy her but she is disobedient and wants to go back to Rifa`a.\" Allah's Messenger (ﷺ) said, to her, \"If that is your intention, then know that it is unlawful for you to remarry Rifa`a unless `Abdur-Rahman has had sexual intercourse with you.\" Then the Prophet (ﷺ) saw two boys with `Abdur- Rahman and asked (him), \"Are these your sons?\" On that `Abdur Rahman said, \"Yes.\" The Prophet (ﷺ) said, \"You claim what you claim (i.e.. that he is impotent)? But by Allah, these boys resemble him as a crow resembles a crow,\"",
        "malay_translation": "Rifa`a رضى الله عنه menceraikan isterinya, lalu `Abdur Rahman bin Az-Zubair Al-Qurazi رضى الله عنه mengahwininya. `Aisha رضى الله عنها berkata bahawa wanita itu (datang), memakai selendang hijau (dan mengadu kepada beliau (Aisha رضى الله عنها) tentang suaminya dan menunjukkan kesan hijau pada kulitnya akibat dipukul). Adalah menjadi kebiasaan wanita untuk saling menyokong, jadi apabila Rasulullah ﷺ datang, `Aisha رضى الله عنها berkata, \"Saya tidak pernah melihat mana-mana wanita menderita seperti wanita yang beriman. Lihatlah! Kulitnya lebih hijau daripada pakaiannya!\" Apabila `Abdur Rahman mendengar bahawa isterinya telah pergi kepada Nabi, dia datang bersama dua orang anaknya dari isteri yang lain. Dia berkata, \"Demi Allah! Saya tidak melakukan kesalahan terhadapnya tetapi dia tidak berupaya dan tidak berguna bagi saya seperti ini,\" sambil memegang dan menunjukkan hujung pakaiannya, `Abdur-Rahman berkata, \"Demi Allah, wahai Rasulullah ﷺ! Dia telah berdusta! Saya sangat kuat dan dapat memuaskannya tetapi dia tidak taat dan mahu kembali kepada Rifa`a.\" Rasulullah ﷺ berkata kepadanya, \"Jika itu niatmu, maka ketahuilah bahawa haram bagimu untuk berkahwin semula dengan Rifa`a melainkan `Abdur-Rahman telah melakukan persetubuhan denganmu.\" Kemudian Nabi ﷺ melihat dua orang budak lelaki bersama `Abdur-Rahman dan bertanya (kepadanya), \"Adakah ini anak-anakmu?\"  Mengenai perkara itu `Abdur Rahman berkata, \"Ya.\" Nabi ﷺ berkata, \"Kamu mendakwa apa yang kamu dakwa (iaitu dia tidak berupaya)? Tetapi demi Allah, anak-anak lelaki ini menyerupainya seperti burung gagak menyerupai burung gagak.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، أَخْبَرَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، أَنَّ رِفَاعَةَ، طَلَّقَ امْرَأَتَهُ، فَتَزَوَّجَهَا عَبْدُ الرَّحْمَنِ بْنُ الزَّبِيرِ الْقُرَظِيُّ، قَالَتْ عَائِشَةُ وَعَلَيْهَا خِمَارٌ أَخْضَرُ‏.‏ فَشَكَتْ إِلَيْهَا، وَأَرَتْهَا خُضْرَةً بِجِلْدِهَا، فَلَمَّا جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالنِّسَاءُ يَنْصُرُ بَعْضُهُنَّ بَعْضًا قَالَتْ عَائِشَةُ مَا رَأَيْتُ مِثْلَ مَا يَلْقَى الْمُؤْمِنَاتُ، لَجِلْدُهَا أَشَدُّ خُضْرَةً مِنْ ثَوْبِهَا‏.‏ قَالَ وَسَمِعَ أَنَّهَا قَدْ أَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَجَاءَ وَمَعَهُ ابْنَانِ لَهُ مِنْ غَيْرِهَا‏.‏ قَالَتْ وَاللَّهِ مَا لِي إِلَيْهِ مِنْ ذَنْبٍ، إِلاَّ أَنَّ مَا مَعَهُ لَيْسَ بِأَغْنَى عَنِّي مِنْ هَذِهِ‏.‏ وَأَخَذَتْ هُدْبَةً مِنْ ثَوْبِهَا، فَقَالَ كَذَبَتْ وَاللَّهِ يَا رَسُولَ اللَّهِ، إِنِّي لأَنْفُضُهَا نَفْضَ الأَدِيمِ، وَلَكِنَّهَا نَاشِزٌ تُرِيدُ رِفَاعَةَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَإِنْ كَانَ ذَلِكَ لَمْ تَحِلِّي لَهُ ـ أَوْ لَمْ تَصْلُحِي لَهُ ـ حَتَّى يَذُوقَ مِنْ عُسَيْلَتِكِ ‏\"‏‏.‏ قَالَ وَأَبْصَرَ مَعَهُ ابْنَيْنِ فَقَالَ ‏\"‏ بَنُوكَ هَؤُلاَءِ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ هَذَا الَّذِي تَزْعُمِينَ مَا تَزْعُمِينَ، فَوَاللَّهِ لَهُمْ أَشْبَهُ بِهِ مِنَ الْغُرَابِ بِالْغُرَابِ ‏\"‏‏.‏"
      },
      {
        "id": 5576,
        "hadith_number": "5826",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Dua Lelaki Berpakaian Putih di Perang Uhud",
        "perawi_melayu": "Diriwayatkan oleh Sa`d رضی اللہ عنہ :",
        "english_text": "On the day of the battle of Uhud, on the right and on the left of the Prophet (ﷺ) were two men wearing white clothes, and I had neither seen them before, nor did I see them afterwards.",
        "malay_translation": "Pada hari peperangan Uhud, di sebelah kanan dan kiri Nabi (ﷺ) terdapat dua orang lelaki yang memakai pakaian putih, dan aku tidak pernah melihat mereka sebelum itu, mahupun selepasnya.",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا مِسْعَرٌ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِيهِ، عَنْ سَعْدٍ، قَالَ رَأَيْتُ بِشِمَالِ النَّبِيِّ صلى الله عليه وسلم وَبِيَمِينِهِ رَجُلَيْنِ عَلَيْهِمَا ثِيَابٌ بِيضٌ يَوْمَ أُحُدٍ، مَا رَأَيْتُهُمَا قَبْلُ وَلاَ بَعْدُ‏.‏"
      },
      {
        "id": 5577,
        "hadith_number": "5827",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Syahadat dan Jaminan Syurga",
        "perawi_melayu": "Diriwayatkan daripada Abu Dharr رضی اللہ عنہ :",
        "english_text": "I came to the Prophet (ﷺ) while he was wearing white clothes and sleeping. Then I went back to him again after he had got up from his sleep. He said, \"Nobody says: 'None has the right to be worshipped but Allah' and then later on he dies while believing in that, except that he will enter Paradise.\" I said, \"Even if he had committed illegal sexual intercourse and theft?\" He said. 'Even if he had committed illegal sexual intercourse and theft.\" I said, \"Even if he had committed illegal sexual intercourse and theft?\" He said. 'Even if he had committed illegal sexual intercourse and theft.\" I said, 'Even it he had committed illegal sexual intercourse and theft?' He said, \"Even if he had committed illegal sexual intercourse and theft, inspite of the Abu Dharr's dislike. Abu `Abdullah said, \"This is at the time of death or before it if one repents and regrets and says \"None has the right to be worshipped but Allah. He will be forgiven his sins.\"",
        "malay_translation": "Saya datang kepada Nabi (ﷺ) ketika baginda sedang memakai pakaian putih dan sedang tidur. Kemudian saya kembali semula kepada baginda setelah baginda bangun dari tidurnya. Baginda bersabda, \"Tidaklah seorang pun yang mengucapkan: 'Tiada Tuhan yang berhak disembah selain Allah' kemudian dia meninggal dunia dalam keadaan beriman dengan kalimah itu, melainkan dia akan masuk ke dalam syurga.\" Saya bertanya, \"Walaupun dia telah melakukan zina dan mencuri?\" Baginda menjawab, 'Walaupun dia telah melakukan zina dan mencuri.\" Saya bertanya lagi, \"Walaupun dia telah melakukan zina dan mencuri?\" Baginda menjawab, 'Walaupun dia telah melakukan zina dan mencuri.\" Saya bertanya lagi, 'Walaupun dia telah melakukan zina dan mencuri?' Baginda menjawab, \"Walaupun dia telah melakukan zina dan mencuri, meskipun Abu Dharr tidak menyukainya. Abu `Abdullah berkata, \"Ini berlaku pada saat kematian atau sebelum itu jika seseorang bertaubat dan menyesal serta mengucapkan 'Tiada Tuhan yang berhak disembah selain Allah. Dia akan diampuni dosa-dosanya.\"",
        "arabic_text": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنِ الْحُسَيْنِ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ يَحْيَى بْنِ يَعْمَرَ، حَدَّثَهُ أَنَّ أَبَا الأَسْوَدِ الدِّيلِيَّ حَدَّثَهُ أَنَّ أَبَا ذَرٍّ ـ رضى الله عنه ـ حَدَّثَهُ قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم وَعَلَيْهِ ثَوْبٌ أَبْيَضُ وَهْوَ نَائِمٌ، ثُمَّ أَتَيْتُهُ وَقَدِ اسْتَيْقَظَ فَقَالَ ‏\"‏ مَا مِنْ عَبْدٍ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ ثُمَّ مَاتَ عَلَى ذَلِكَ، إِلاَّ دَخَلَ الْجَنَّةَ ‏\"‏‏.‏ قُلْتُ وَإِنْ زَنَى وَإِنْ سَرَقَ قَالَ ‏\"‏ وَإِنْ زَنَى وَإِنْ سَرَقَ ‏\"‏‏.‏ قُلْتُ وَإِنْ زَنَى وَإِنْ سَرَقَ قَالَ ‏\"‏ وَإِنْ زَنَى وَإِنْ سَرَقَ ‏\"‏‏.‏ قُلْتُ وَإِنْ زَنَى وَإِنْ سَرَقَ قَالَ ‏\"‏ وَإِنْ زَنَى وَإِنْ سَرَقَ عَلَى رَغْمِ أَنْفِ أَبِي ذَرٍّ ‏\"‏‏.‏ وَكَانَ أَبُو ذَرٍّ إِذَا حَدَّثَ بِهَذَا قَالَ وَإِنْ رَغِمَ أَنْفُ أَبِي ذَرٍّ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ هَذَا عِنْدَ الْمَوْتِ أَوْ قَبْلَهُ، إِذَا تَابَ وَنَدِمَ وَقَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ غُفِرَ لَهُ‏.‏"
      },
      {
        "id": 5578,
        "hadith_number": "5828",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pengharaman Sutera (Kecuali Sebilangan)",
        "perawi_melayu": "Diriwayatkan oleh Aba `Uthman An-Nahdi:",
        "english_text": "While we were with `Utba bin Farqad at Adharbijan رضی اللہ عنہ , there came `Umar's letter indicating that Allah's Apostle had forbidden the use of silk except this much, then he pointed with his index and middle fingers. To our knowledge, by that he meant embroidery.",
        "malay_translation": "Ketika kami bersama `Utba bin Farqad di Adharbijan رضی اللہ عنہ, datang surat daripada `Umar yang menunjukkan bahawa Rasulullah ﷺ telah melarang penggunaan sutera kecuali sekadar ini, kemudian baginda menunjuk dengan jari telunjuk dan jari tengahnya. Setahu kami, dengan itu baginda bermaksud sulaman.",
        "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا قَتَادَةُ، قَالَ سَمِعْتُ أَبَا عُثْمَانَ النَّهْدِيَّ، أَتَانَا كِتَابُ عُمَرَ وَنَحْنُ مَعَ عُتْبَةَ بْنِ فَرْقَدٍ بِأَذْرَبِيجَانَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْحَرِيرِ، إِلاَّ هَكَذَا، وَأَشَارَ بِإِصْبَعَيْهِ اللَّتَيْنِ تَلِيَانِ الإِبْهَامَ قَالَ فِيمَا عَلِمْنَا أَنَّهُ يَعْنِي الأَعْلاَمَ‏.‏"
      },
      {
        "id": 5579,
        "hadith_number": "5829",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Memakai Sutera Kecuali Seukuran Jari",
        "perawi_melayu": "Diriwayatkan daripada Abu `Uthman:",
        "english_text": "While we were at Adharbijan, `Umar رضی اللہ عنہ wrote to us: 'Allah's Messenger (ﷺ) forbade wearing silk except this much. Then the Prophet (ﷺ) approximated his two fingers (index and middle fingers) (to illustrate that) to us.' Zuhair (the sub-narrator) raised up his middle and index fingers.",
        "malay_translation": "Semasa kami berada di Adharbijan, `Umar رضی اللہ عنہ menulis kepada kami: 'Rasulullah (ﷺ) melarang memakai sutera kecuali sebegini.' Kemudian Nabi (ﷺ) menghampirkan dua jarinya (jari telunjuk dan jari tengah) (untuk mengilustrasikan perkara itu) kepada kami.' Zuhair (perawi tambahan) mengangkat jari tengah dan jari telunjuknya.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا عَاصِمٌ، عَنْ أَبِي عُثْمَانَ، قَالَ كَتَبَ إِلَيْنَا عُمَرُ وَنَحْنُ بِأَذْرَبِيجَانَ أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ لُبْسِ الْحَرِيرِ إِلاَّ هَكَذَا، وَصَفَّ لَنَا النَّبِيُّ صلى الله عليه وسلم إِصْبَعَيْهِ‏.‏ وَرَفَعَ زُهَيْرٌ الْوُسْطَى وَالسَّبَّابَةَ‏.‏"
      },
      {
        "id": 5580,
        "hadith_number": "5830",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman Memakai Sutera di Akhirat",
        "perawi_melayu": "Diriwayatkan daripada Abu `Uthman:",
        "english_text": "While we were with `Utba رضی اللہ عنہ . `Umar رضی اللہ عنہ wrote to us: The Prophet (ﷺ) said, \"There is none who wears silk in this world except that he will wear nothing of it in the Hereafter.\" ' Abu `Uthman pointed out with his middle and index fingers. This hadith has also been narrated by Abu `Uthman.",
        "malay_translation": "Semasa kami bersama dengan `Utba رضي الله عنه, `Umar رضي الله عنه menulis kepada kami: Nabi ﷺ bersabda, \"Tidak ada seorang pun yang memakai sutera di dunia ini melainkan dia tidak akan memakainya di Akhirat.\" Abu `Uthman menunjukkan dengan jari tengah dan jari telunjuknya. Hadith ini juga diriwayatkan oleh Abu `Uthman.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنِ التَّيْمِيِّ، عَنْ أَبِي عُثْمَانَ، قَالَ كُنَّا مَعَ عُتْبَةَ فَكَتَبَ إِلَيْهِ عُمَرُ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يُلْبَسُ الْحَرِيرُ فِي الدُّنْيَا، إِلاَّ لَمْ يُلْبَسْ فِي الآخِرَةِ مِنْهُ ‏\"‏‏.‏ حَدَّثَنَا الْحَسَنُ بْنُ عُمَرَ، حَدَّثَنَا مُعْتَمِرٌ، حَدَّثَنَا أَبِي، حَدَّثَنَا أَبُو عُثْمَانَ،، وَأَشَارَ أَبُو عُثْمَانَ، بِإِصْبَعَيْهِ الْمُسَبِّحَةِ وَالْوُسْطَى‏.‏"
      },
      {
        "id": 5581,
        "hadith_number": "5831",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Harta Duniawi: Emas, Perak, Sutera untuk Orang Kafir",
        "perawi_melayu": "Diriwayatkan oleh Ibn Abi Laila",
        "english_text": "While Hudhaifa رضی اللہ عنہ was at Al-Madain, he asked for water whereupon the chief of the village brought him water in a silver cup. Hudhaifa threw it at him and said, \"I have thrown it only because I have forbidden him to use it, but he does not stop using it. Allah's Messenger (ﷺ) said, 'Gold, silver, silk and Dibaj (a kind of silk) are for them (unbelievers) in this world and for you (Muslims) in the hereafter.'",
        "malay_translation": "Ketika Hudhaifa رضی اللہ عنہ berada di Al-Madain, dia meminta air, lalu ketua kampung membawakan air kepadanya dalam cawan perak. Hudhaifa melemparkannya dan berkata, \"Aku melemparkannya hanya kerana aku telah melarangnya daripada menggunakannya, tetapi dia tidak berhenti menggunakannya. Rasulullah (ﷺ) bersabda, 'Emas, perak, sutera, dan Dibaj (sejenis sutera) adalah untuk mereka (orang kafir) di dunia ini dan untuk kamu (orang Islam) di akhirat.'",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنِ ابْنِ أَبِي لَيْلَى، قَالَ كَانَ حُذَيْفَةُ بِالْمَدَايِنِ فَاسْتَسْقَى، فَأَتَاهُ دِهْقَانٌ بِمَاءٍ فِي إِنَاءٍ مِنْ فِضَّةٍ فَرَمَاهُ بِهِ وَقَالَ إِنِّي لَمْ أَرْمِهِ إِلاَّ أَنِّي نَهَيْتُهُ فَلَمْ يَنْتَهِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الذَّهَبُ وَالْفِضَّةُ وَالْحَرِيرُ وَالدِّيبَاجُ هِيَ لَهُمْ فِي الدُّنْيَا، وَلَكُمْ فِي الآخِرَةِ ‏\"‏‏.‏"
      },
      {
        "id": 5582,
        "hadith_number": "5832",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Memakai Sutera di Akhirat",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) said, Whoever wears silk in this world shall not wear it in the Hereafter.\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Sesiapa yang memakai sutera di dunia ini, maka tidak akan memakainya di Akhirat.\"",
        "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ ـ قَالَ شُعْبَةُ فَقُلْتُ أَعَنِ النَّبِيِّ صلى الله عليه وسلم فَقَالَ شَدِيدًا عَنِ النَّبِيِّ صلى الله عليه وسلم ـ فَقَالَ ‏ \"‏ مَنْ لَبِسَ الْحَرِيرَ فِي الدُّنْيَا فَلَنْ يَلْبَسَهُ فِي الآخِرَةِ ‏\"‏‏.‏"
      },
      {
        "id": 5583,
        "hadith_number": "5833",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Memakai Sutera di Akhirat",
        "perawi_melayu": "Diriwayatkan oleh Ibnu Az-Zubair رضی اللہ عنہ :",
        "english_text": "\"Muhammad said, 'Whoever wears silk in this world, shall not wear it in the Hereafter.\"",
        "malay_translation": "\"Sabda Nabi Muhammad SAW: 'Sesiapa yang memakai sutera di dunia ini, tidak akan memakainya di akhirat kelak.'\"",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، قَالَ سَمِعْتُ ابْنَ الزُّبَيْرِ، يَخْطُبُ يَقُولُ قَالَ مُحَمَّدٌ صلى الله عليه وسلم ‏ \"‏ مَنْ لَبِسَ الْحَرِيرَ فِي الدُّنْيَا لَمْ يَلْبَسْهُ فِي الآخِرَةِ ‏\"‏‏.‏"
      },
      {
        "id": 5584,
        "hadith_number": "5834",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Memakai Sutera di Dunia dan Akhirat",
        "perawi_melayu": "Diriwayatkan oleh `Umar رضی اللہ عنہ :",
        "english_text": "\"The Prophet (ﷺ) said, 'Whoever wears silk in this world, shall not wear it in the Hereafter.\" Abu Mamar, Abdul Warith, Yazeed, Muadhah, Umm-e-Amr, the daughter of Abdullah, Abdullah bin Zubair رضی اللہ عنہما , Hadrat Umer has reported it from the prophet ﷺ.",
        "malay_translation": "Rasulullah ﷺ bersabda, 'Sesiapa yang memakai sutera di dunia, tidak akan memakainya di Akhirat.' Abu Mamar, Abdul Warith, Yazeed, Muadhah, Umm-e-Amr, anak perempuan Abdullah, Abdullah bin Zubair رضی اللہ عنہما , Hadrat Umer telah meriwayatkannya daripada Nabi ﷺ.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، أَخْبَرَنَا شُعْبَةُ، عَنْ أَبِي ذُبْيَانَ، خَلِيفَةَ بْنِ كَعْبٍ قَالَ سَمِعْتُ ابْنَ الزُّبَيْرِ، يَقُولُ سَمِعْتُ عُمَرَ، يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَنْ لَبِسَ الْحَرِيرَ فِي الدُّنْيَا لَمْ يَلْبَسْهُ فِي الآخِرَةِ ‏\"‏‏.‏ وَقَالَ لَنَا أَبُو مَعْمَرٍ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ يَزِيدَ، قَالَتْ مُعَاذَةُ أَخْبَرَتْنِي أُمُّ عَمْرٍو بِنْتُ عَبْدِ اللَّهِ، سَمِعْتُ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ، سَمِعَ عُمَرَ، سَمِعَ النَّبِيَّ صلى الله عليه وسلم‏ نَحْوَهُ."
      },
      {
        "id": 5585,
        "hadith_number": "5835",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Sesiapa Memakai Sutera di Dunia, Tiada Bahagian di Akhirat",
        "perawi_melayu": "Diriwayatkan daripada 'Umar bin Al-Khattab رضی اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) said, \"None wears silk in this world, but he who will have no share in the Hereafter.\" I said: He has spoken the truth and Abu Hafs has not ascribed a lie to Allah's Apostle ﷺ. Imran has reported this Hadith in the same way from Abdullah bin Raja, Jareer and Yahya.",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Tiada sesiapa memakai sutera di dunia ini, melainkan dia tidak akan mendapat bahagian di Akhirat.\" Aku berkata: Baginda telah berkata benar dan Abu Hafs tidak pernah berdusta kepada Rasulullah ﷺ. Imran meriwayatkan Hadith ini dengan cara yang sama daripada Abdullah bin Raja, Jareer dan Yahya.",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عِمْرَانَ بْنِ حِطَّانَ، قَالَ سَأَلْتُ عَائِشَةَ عَنِ الْحَرِيرِ، فَقَالَتِ ائْتِ ابْنَ عَبَّاسٍ فَسَلْهُ‏.‏ قَالَ فَسَأَلْتُهُ فَقَالَ سَلِ ابْنَ عُمَرَ‏.‏ قَالَ فَسَأَلْتُ ابْنَ عُمَرَ فَقَالَ أَخْبَرَنِي أَبُو حَفْصٍ ـ يَعْنِي عُمَرَ بْنَ الْخَطَّابِ ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّمَا يَلْبَسُ الْحَرِيرَ فِي الدُّنْيَا مَنْ لاَ خَلاَقَ لَهُ فِي الآخِرَةِ ‏\"‏‏.‏ فَقُلْتُ صَدَقَ وَمَا كَذَبَ أَبُو حَفْصٍ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ وَقَالَ عَبْدُ اللَّهِ بْنُ رَجَاءٍ حَدَّثَنَا حَرْبٌ عَنْ يَحْيَى حَدَّثَنِي عِمْرَانُ‏.‏ وَقَصَّ الْحَدِيثَ‏.‏"
      },
      {
        "id": 5586,
        "hadith_number": "5836",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kain Sutera di Syurga Lebih Baik",
        "perawi_melayu": "Diriwayatkan oleh Al-Bara رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) was given a silk garment as a gift and we started touching it with our hands and admiring it. On that the Prophet (ﷺ) said, \"Do you wonder at this?\" We said, \"Yes.\" He said, \"The handkerchiefs of Sa`d bin Mu`adh in Paradise are better than this.\"",
        "malay_translation": "Nabi (ﷺ) telah diberikan sehelai pakaian sutera sebagai hadiah dan kami mula menyentuhnya dengan tangan kami dan mengaguminya. Lalu Nabi (ﷺ) bersabda, \"Adakah kamu merasa hairan dengan ini?\" Kami menjawab, \"Ya.\" Baginda bersabda, \"Sapu tangan Sa`d bin Mu`adh di Syurga lebih baik daripada ini.\"",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ أُهْدِيَ لِلنَّبِيِّ صلى الله عليه وسلم ثَوْبُ حَرِيرٍ، فَجَعَلْنَا نَلْمُسُهُ، وَنَتَعَجَّبُ مِنْهُ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَتَعْجَبُونَ مِنْ هَذَا ‏\"‏‏.‏ قُلْنَا نَعَمْ‏.‏ قَالَ ‏\"‏ مَنَادِيلُ سَعْدِ بْنِ مُعَاذٍ فِي الْجَنَّةِ خَيْرٌ مِنْ هَذَا ‏\"‏‏.‏"
      },
      {
        "id": 5587,
        "hadith_number": "5837",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Menggunakan Bekas Emas dan Perak serta Sutera",
        "perawi_melayu": "Diriwayatkan oleh Hudhaifa رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) forbade us to drink out of gold and silver vessels, or eat in it, Ann also forbade the wearing of silk and Dibaj or sitting on it.",
        "malay_translation": "Rasulullah (ﷺ) melarang kami daripada minum daripada bekas emas dan perak, atau makan daripadanya. Baginda juga melarang pemakaian sutera dan Dibaj atau duduk di atasnya.",
        "arabic_text": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي قَالَ، سَمِعْتُ ابْنَ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ حُذَيْفَةَ ـ رضى الله عنه ـ قَالَ نَهَانَا النَّبِيُّ صلى الله عليه وسلم أَنْ نَشْرَبَ فِي آنِيَةِ الذَّهَبِ وَالْفِضَّةِ، وَأَنْ نَأْكُلَ فِيهَا، وَعَنْ لُبْسِ الْحَرِيرِ وَالدِّيبَاجِ، وَأَنْ نَجْلِسَ عَلَيْهِ‏.‏"
      },
      {
        "id": 5588,
        "hadith_number": "5838",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Nabi SAW Menggunakan Mayathir Merah dan Al-Qassiy",
        "perawi_melayu": "Diriwayatkan oleh Ibnu Azib رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) forbade us to use the red Mayathir and to use Al-Qassiy.",
        "malay_translation": "Nabi (ﷺ) melarang kami daripada menggunakan Mayathir merah dan menggunakan Al-Qassiy.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا سُفْيَانُ، عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ، حَدَّثَنَا مُعَاوِيَةُ بْنُ سُوَيْدِ بْنِ مُقَرِّنٍ، عَنِ ابْنِ عَازِبٍ، قَالَ نَهَانَا النَّبِيُّ صلى الله عليه وسلم عَنِ الْمَيَاثِرِ الْحُمْرِ وَالْقَسِّيِّ‏.‏"
      },
      {
        "id": 5589,
        "hadith_number": "5839",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kebenaran Memakai Sutera Kerana Sakit",
        "perawi_melayu": "Diriwayatkan daripada Anas رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) allowed Az-Zubair and `Abdur-Rahman رضی اللہ عنہما to wear silk because they were suffering from an itch.",
        "malay_translation": "Nabi ﷺ membenarkan Az-Zubair dan `Abdur-Rahman رضی اللہ عنہما memakai sutera kerana mereka menderita gatal-gatal.",
        "arabic_text": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا وَكِيعٌ، أَخْبَرَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ رَخَّصَ النَّبِيُّ صلى الله عليه وسلم لِلزُّبَيْرِ وَعَبْدِ الرَّحْمَنِ فِي لُبْسِ الْحَرِيرِ لِحِكَّةٍ بِهِمَا‏.‏"
      },
      {
        "id": 5590,
        "hadith_number": "5840",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Tindakan Ali RA Membahagikan Pakaian Sutera",
        "perawi_melayu": "Diriwayatkan daripada `Ali bin Abi Talib رضي الله عنه :",
        "english_text": "The Prophet (ﷺ) gave me a silk suit. I went out wearing it, but seeing the signs of anger on his face, I tore it and distributed it among my wives.",
        "malay_translation": "Nabi ﷺ memberikan saya sehelai pakaian sutera. Saya keluar memakainya, tetapi setelah melihat tanda-tanda kemarahan di wajahnya, saya merobeknya dan membahagikannya di kalangan isteri-isteri saya.",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ بْنِ مَيْسَرَةَ، عَنْ زَيْدِ بْنِ وَهْبٍ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ كَسَانِي النَّبِيُّ صلى الله عليه وسلم حُلَّةً سِيَرَاءَ، فَخَرَجْتُ فِيهَا، فَرَأَيْتُ الْغَضَبَ فِي وَجْهِهِ، فَشَقَّقْتُهَا بَيْنَ نِسَائِي‏.‏"
      },
      {
        "id": 5591,
        "hadith_number": "5841",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Memakai Sutera dan Tujuan Hadiah",
        "perawi_melayu": "Diriwayatkan oleh `Abdullah bin `Umar رضی اللہ عنہما",
        "english_text": "`Umar رضی اللہ عنہ saw a silk suit being sold, so he said, \"O Allah's Messenger (ﷺ)! Why don't you buy it so that you may wear it when delegates come to you, and also on Fridays?\" The Prophet (ﷺ) said, \"This is worn only by him who has no share in the Hereafter.\" Afterwards the Prophet (ﷺ) sent to `Umar رضی اللہ عنہ a silk suit suitable for wearing. `Umar رضی اللہ عنہ said to the Prophet, \"You have given it to me to wear, yet I have heard you saying about it what you said?\" The Prophet (ﷺ) said, \"I sent it to you so that you might either sell it or give it to somebody else to wear.\"",
        "malay_translation": "`Umar رضی اللہ عنہ melihat sutera sedang dijual, lalu dia berkata, \"Wahai Rasulullah (ﷺ)! Mengapa tidak Tuan membelinya supaya Tuan memakainya apabila delegasi datang kepada Tuan, dan juga pada hari Jumaat?\" Nabi (ﷺ) bersabda, \"Ini hanya dipakai oleh orang yang tidak mempunyai bahagian di Akhirat.\" Selepas itu Nabi (ﷺ) menghantar kepada `Umar رضی اللہ عنہ sutera yang sesuai untuk dipakai. `Umar رضی اللہ عنہ berkata kepada Nabi, \"Tuan telah memberikannya kepada saya untuk dipakai, tetapi saya telah mendengar Tuan mengatakan tentangnya apa yang Tuan katakan?\" Nabi (ﷺ) bersabda, \"Saya menghantarnya kepada kamu supaya kamu boleh menjualnya atau memberikannya kepada orang lain untuk dipakai.\"",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنِي جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، أَنَّ عُمَرَ ـ رضى الله عنه ـ رَأَى حُلَّةً سِيَرَاءَ تُبَاعُ فَقَالَ يَا رَسُولَ اللَّهِ لَوِ ابْتَعْتَهَا، تَلْبَسُهَا لِلْوَفْدِ إِذَا أَتَوْكَ وَالْجُمُعَةِ‏.‏ قَالَ ‏\"‏ إِنَّمَا يَلْبَسُ هَذِهِ مَنْ لاَ خَلاَقَ لَهُ ‏\"‏‏.‏ وَأَنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَ بَعْدَ ذَلِكَ إِلَى عُمَرَ حُلَّةَ سِيَرَاءَ حَرِيرٍ، كَسَاهَا إِيَّاهُ فَقَالَ عُمَرُ كَسَوْتَنِيهَا وَقَدْ سَمِعْتُكَ تَقُولُ فِيهَا مَا قُلْتَ فَقَالَ ‏\"‏ إِنَّمَا بَعَثْتُ إِلَيْكَ لِتَبِيعَهَا أَوْ تَكْسُوَهَا ‏\"‏‏.‏"
      },
      {
        "id": 5592,
        "hadith_number": "5842",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Um Kulthum Memakai Pakaian Sutera Merah",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik رضی اللہ عنہ :",
        "english_text": "He had seen Um Kulthum رضی اللہ عنہا , the daughter of Allah's Messenger (ﷺ) , wearing a red silk garment.",
        "malay_translation": "Beliau telah melihat Um Kulthum رضی اللہ عنہا, puteri Rasulullah (ﷺ), memakai sehelai pakaian sutera merah.",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّهُ رَأَى عَلَى أُمِّ كُلْثُومٍ ـ عَلَيْهَا السَّلاَمُ ـ بِنْتِ رَسُولِ اللَّهِ صلى الله عليه وسلم بُرْدَ حَرِيرٍ سِيَرَاءَ‏.‏"
      },
      {
        "id": 5593,
        "hadith_number": "5843",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Penceraian Isteri-Isteri Nabi (ﷺ) dan Peranan Sahabat",
        "perawi_melayu": "Diriwayatkan oleh Ibnu Abbas رضي الله عنهما",
        "english_text": "For one year I wanted to ask `Umar رضی اللہ عنہ about the two women who helped each other against the Prophet (ﷺ) but I was afraid of him. One day he dismounted his riding animal and went among the trees of Arak to answer the call of nature, and when he returned, I asked him and he said, \"(They were) `Aisha and Hafsa رضی اللہ عنہما .\" Then he added, \"We never used to give significance to ladies in the days of the Pre-lslamic period of ignorance, but when Islam came and Allah mentioned their rights, we used to give them their rights but did not allow them to interfere in our affairs. Once there was some dispute between me and my wife and she answered me back in a loud voice. I said to her, 'Strange! You can retort in this way?' She said, 'Yes. Do you say this to me while your daughter troubles Allah's Messenger (ﷺ)?' So I went to Hafsa and said to her, 'I warn you not to disobey Allah and His Apostle.' I first went to Hafsa and then to Um Salama and told her the same. She said to me, 'O `Umar! It surprises me that you interfere in our affairs so much that you would poke your nose even into the affairs of Allah's Messenger (ﷺ) and his wives.' So she rejected my advice. There was an Ansari man; whenever he was absent from Allah's Messenger (ﷺ) and I was present there, I used to convey to him what had happened (on that day), and when I was absent and he was present there, he used to convey to me what had happened as regards news from Allah's Messenger (ﷺ) . During that time all the rulers of the nearby lands had surrendered to Allah's Messenger (ﷺ) except the king of Ghassan in Sham, and we were afraid that he might attack us. All of a sudden the Ansari came and said, 'A great event has happened!' I asked him, 'What is it? Has the Ghassani (king) come?' He said, 'Greater than that! Allah's Messenger (ﷺ) has divorced his wives! I went to them and found all of them weeping in their dwellings, and the Prophet (ﷺ) had ascended to an upper room of his. At the door of the room there was a slave to whom I went and said, \"Ask the permission for me to enter.\" He admitted me and I entered to see the Prophet (ﷺ) lying on a mat that had left its imprint on his side. Under his head there was a leather pillow stuffed with palm fires. Behold! There were some hides hanging there and some grass for tanning. Then I mentioned what I had said to Hafsa and Um Salama and what reply Um Salama had given me. Allah's Messenger (ﷺ) smiled and stayed there for twenty nine days and then came down.\" (See Hadith No. 648, Vol. 3 for details)",
        "malay_translation": "Selama setahun, saya ingin bertanya kepada `Umar رضي الله عنه tentang dua wanita yang saling membantu menentang Nabi (ﷺ), tetapi saya takut kepadanya. Pada suatu hari, dia turun dari tunggangannya dan pergi ke antara pokok-pokok Arak untuk membuang hajat, dan apabila dia kembali, saya bertanya kepadanya dan dia berkata, \"(Mereka ialah) `Aisha dan Hafsa رضي الله عنهما.\" Kemudian dia menambah, \"Kami tidak pernah memberi kepentingan kepada wanita pada zaman jahiliah, tetapi apabila Islam datang dan Allah menyebut hak-hak mereka, kami memberi mereka hak mereka tetapi tidak membenarkan mereka campur tangan dalam urusan kami. Pernah berlaku pertikaian antara saya dan isteri saya dan dia menjawab saya dengan suara yang kuat. Saya berkata kepadanya, 'Aneh! Kamu boleh menjawab dengan cara ini?' Dia berkata, 'Ya. Adakah kamu berkata begitu kepada saya sedangkan anak perempuanmu menyusahkan Rasulullah (ﷺ)?' Jadi saya pergi kepada Hafsa dan berkata kepadanya, 'Saya memberi amaran kepada kamu supaya tidak menderhakai Allah dan Rasul-Nya.' Saya mula-mula pergi kepada Hafsa dan kemudian kepada Um Salama dan memberitahunya perkara yang sama. Dia berkata kepada saya, 'Wahai `Umar! Saya terkejut bahawa kamu terlalu campur tangan dalam urusan kami sehingga kamu akan mencampuri urusan Rasulullah (ﷺ) dan isteri-isterinya.' Jadi dia menolak nasihat saya. Ada seorang lelaki Ansar; setiap kali dia tidak hadir dari Rasulullah (ﷺ) dan saya hadir di sana, saya akan menyampaikan kepadanya apa yang telah berlaku (pada hari itu), dan apabila saya tidak hadir dan dia hadir di sana, dia akan menyampaikan kepada saya apa yang telah berlaku mengenai berita daripada Rasulullah (ﷺ). Pada masa itu semua pemerintah negara jiran telah menyerah diri kepada Rasulullah (ﷺ) kecuali raja Ghassan di Sham, dan kami takut dia akan menyerang kami. Tiba-tiba orang Ansar itu datang dan berkata, 'Peristiwa besar telah berlaku!' Saya bertanya kepadanya, 'Apa itu? Adakah raja Ghassani datang?' Dia berkata, 'Lebih besar daripada itu! Rasulullah (ﷺ) telah menceraikan isteri-isterinya!' Saya pergi kepada mereka dan mendapati mereka semua menangis di kediaman mereka, dan Nabi (ﷺ) telah naik ke bilik atasnya. Di pintu bilik itu ada seorang hamba yang saya pergi dan berkata, \"Minta izin untuk saya masuk.\" Dia memasukkan saya dan saya masuk untuk melihat Nabi (ﷺ) berbaring di atas tikar yang telah meninggalkan kesan di sisinya. Di bawah kepalanya ada bantal kulit yang diisi dengan serat kurma. Lihatlah! Terdapat beberapa kulit yang tergantung di sana dan rumput untuk penyamakan. Kemudian saya menyebutkan apa yang saya katakan kepada Hafsa dan Um Salama dan apa jawapan yang telah diberikan Um Salama kepada saya. Rasulullah (ﷺ) tersenyum dan tinggal di sana selama dua puluh sembilan hari dan kemudian turun.\"",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عُبَيْدِ بْنِ حُنَيْنٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَبِثْتُ سَنَةً وَأَنَا أُرِيدُ أَنْ أَسْأَلَ عُمَرَ عَنِ الْمَرْأَتَيْنِ اللَّتَيْنِ تَظَاهَرَتَا عَلَى النَّبِيِّ صلى الله عليه وسلم فَجَعَلْتُ أَهَابُهُ، فَنَزَلَ يَوْمًا مَنْزِلاً فَدَخَلَ الأَرَاكَ، فَلَمَّا خَرَجَ سَأَلْتُهُ فَقَالَ عَائِشَةُ وَحَفْصَةُ ـ ثُمَّ قَالَ ـ كُنَّا فِي الْجَاهِلِيَّةِ لاَ نَعُدُّ النِّسَاءَ شَيْئًا، فَلَمَّا جَاءَ الإِسْلاَمُ وَذَكَرَهُنَّ اللَّهُ، رَأَيْنَا لَهُنَّ بِذَلِكَ عَلَيْنَا حَقًّا، مِنْ غَيْرِ أَنْ نُدْخِلَهُنَّ فِي شَىْءٍ مِنْ أُمُورِنَا، وَكَانَ بَيْنِي وَبَيْنَ امْرَأَتِي كَلاَمٌ فَأَغْلَظَتْ لِي فَقُلْتُ لَهَا وَإِنَّكِ لَهُنَاكِ‏.‏ قَالَتْ تَقُولُ هَذَا لِي وَابْنَتُكَ تُؤْذِي النَّبِيَّ صلى الله عليه وسلم فَأَتَيْتُ حَفْصَةَ فَقُلْتُ لَهَا إِنِّي أُحَذِّرُكِ أَنْ تَعْصِي اللَّهَ وَرَسُولَهُ‏.‏ وَتَقَدَّمْتُ إِلَيْهَا فِي أَذَاهُ، فَأَتَيْتُ أُمَّ سَلَمَةَ فَقُلْتُ لَهَا‏.‏ فَقَالَتْ أَعْجَبُ مِنْكَ يَا عُمَرُ قَدْ دَخَلْتَ فِي أُمُورِنَا، فَلَمْ يَبْقَ إِلاَّ أَنْ تَدْخُلَ بَيْنَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَزْوَاجِهِ، فَرَدَّدَتْ، وَكَانَ رَجُلٌ مِنَ الأَنْصَارِ إِذَا غَابَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَشَهِدْتُهُ أَتَيْتُهُ بِمَا يَكُونُ، وَإِذَا غِبْتُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَشَهِدَ أَتَانِي بِمَا يَكُونُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَكَانَ مَنْ حَوْلَ رَسُولِ اللَّهِ صلى الله عليه وسلم قَدِ اسْتَقَامَ لَهُ، فَلَمْ يَبْقَ إِلاَّ مَلِكُ غَسَّانَ بِالشَّأْمِ، كُنَّا نَخَافُ أَنْ يَأْتِيَنَا، فَمَا شَعَرْتُ إِلاَّ بِالأَنْصَارِيِّ وَهْوَ يَقُولُ إِنَّهُ قَدْ حَدَثَ أَمْرٌ‏.‏ قُلْتُ لَهُ وَمَا هُوَ أَجَاءَ الْغَسَّانِيُّ قَالَ أَعْظَمُ مِنْ ذَاكَ، طَلَّقَ رَسُولُ اللَّهِ صلى الله عليه وسلم نِسَاءَهُ‏.‏ فَجِئْتُ فَإِذَا الْبُكَاءُ مِنْ حُجَرِهَا كُلِّهَا، وَإِذَا النَّبِيُّ صلى الله عليه وسلم قَدْ صَعِدَ فِي مَشْرُبَةٍ لَهُ، وَعَلَى باب الْمَشْرُبَةِ وَصِيفٌ فَأَتَيْتُهُ فَقُلْتُ اسْتَأْذِنْ لِي‏.‏ فَدَخَلْتُ فَإِذَا النَّبِيُّ صلى الله عليه وسلم عَلَى حَصِيرٍ قَدْ أَثَّرَ فِي جَنْبِهِ، وَتَحْتَ رَأْسِهِ مِرْفَقَةٌ مِنْ أَدَمٍ، حَشْوُهَا لِيفٌ، وَإِذَا أُهُبٌ مُعَلَّقَةٌ وَقَرَظٌ، فَذَكَرْتُ الَّذِي قُلْتُ لِحَفْصَةَ وَأُمِّ سَلَمَةَ، وَالَّذِي رَدَّتْ عَلَىَّ أُمُّ سَلَمَةَ، فَضَحِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَبِثَ تِسْعًا وَعِشْرِينَ لَيْلَةً، ثُمَّ نَزَلَ‏.‏"
      },
      {
        "id": 5594,
        "hadith_number": "5844",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Nabi ﷺ Bangun di Malam Hari dan Peringatan Hari Kiamat",
        "perawi_melayu": "Diriwayatkan oleh Ummu Salamah رضي اللہ عنہا :",
        "english_text": "One night the Prophet (ﷺ) woke up, saying, \"None has the right to be worshipped but Allah! How many afflictions have been sent down tonight, and how many treasures have been sent down (disclosed)! Who will go and wake up (for prayers) the lady dwellers of these rooms? Many well dressed soul (people) in this world, will be naked on the Day of Resurrection.\" Zuhri says: There were buttons among the fingers on the sleeves of Hinds.",
        "malay_translation": "Pada suatu malam, Nabi ﷺ terjaga lalu bersabda, \"Tiada tuhan yang berhak disembah melainkan Allah! Alangkah banyak musibah yang telah diturunkan malam ini, dan alangkah banyak perbendaharaan yang telah diturunkan (dinyatakan)! Siapakah yang akan pergi membangunkan (untuk solat) penghuni wanita di bilik-bilik ini? Ramai jiwa (orang) yang berpakaian indah di dunia ini, akan telanjang pada Hari Kiamat.\" Az-Zuhri berkata: Terdapat butang di antara jari-jari pada lengan baju Hind.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَتْنِي هِنْدُ بِنْتُ الْحَارِثِ، عَنْ أُمِّ سَلَمَةَ، قَالَتِ اسْتَيْقَظَ النَّبِيُّ صلى الله عليه وسلم مِنَ اللَّيْلِ وَهْوَ يَقُولُ ‏ \"‏ لاَ إِلَهَ إِلاَّ اللَّهُ، مَاذَا أُنْزِلَ اللَّيْلَةَ مِنَ الْفِتْنَةِ، مَاذَا أُنْزِلَ مِنَ الْخَزَائِنِ، مَنْ يُوقِظُ صَوَاحِبَ الْحُجُرَاتِ، كَمْ مِنْ كَاسِيَةٍ فِي الدُّنْيَا عَارِيَةٍ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏ قَالَ الزُّهْرِيُّ وَكَانَتْ هِنْدٌ لَهَا أَزْرَارٌ فِي كُمَّيْهَا بَيْنَ أَصَابِعِهَا‏.‏"
      },
      {
        "id": 5595,
        "hadith_number": "5845",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hadiah Khamisa dan Pujian kepada Ummu Khalid",
        "perawi_melayu": "Diriwayatkan oleh Ummu Khalid binti Khalid رضی اللہ عنہا :",
        "english_text": "Some clothes were presented to Allah's Messenger (ﷺ) as a gift and there was a black Khamisa with it. The Prophet asked (his companions), \"To whom do you suggest we give this Khamisa?\" The people kept quiet. Then he said, \"Bring me Um Khalid,\" So I was brought to him and he dressed me with it with his own hands and said twice, \"May you live so long that you will wear out many garments.\" He then started looking at the embroidery of that Khamisa and said, \"O Um Khalid! This is Sana!\" (Sana in Ethiopian language means beautiful.) 'Is-haq, a sub-narrator, said: A woman of my family had told me that she had seen the Khamisa worn by Um Khalid رضی اللہ عنہا .",
        "malay_translation": "Beberapa helai pakaian dihadiahkan kepada Rasulullah ﷺ dan ada sehelai Khamisa berwarna hitam bersamanya. Nabi bertanya kepada sahabat-sahabatnya, \"Kepada siapakah kamu cadangkan kita berikan Khamisa ini?\" Orang ramai berdiam diri. Kemudian baginda bersabda, \"Bawalah Ummu Khalid kepadaku.\" Maka aku dibawa kepada baginda dan baginda memakaikannya kepadaku dengan tangan baginda sendiri dan bersabda dua kali, \"Semoga kamu dipanjangkan umur sehingga kamu memakai banyak pakaian.\" Kemudian baginda mula melihat sulaman Khamisa itu dan bersabda, \"Wahai Ummu Khalid! Ini Sana!\" (Sana dalam bahasa Ethiopia bermaksud cantik.) 'Is-haq, seorang perawi kecil, berkata: Seorang wanita daripada keluargaku telah memberitahuku bahawa dia telah melihat Khamisa yang dipakai oleh Ummu Khalid رضی اللہ عنہا .",
        "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا إِسْحَاقُ بْنُ سَعِيدِ بْنِ عَمْرِو بْنِ سَعِيدِ بْنِ الْعَاصِ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَتْنِي أُمُّ خَالِدٍ بِنْتُ خَالِدٍ، قَالَتْ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِثِيَابٍ فِيهَا خَمِيصَةٌ سَوْدَاءُ قَالَ ‏\"‏ مَنْ تَرَوْنَ نَكْسُوهَا هَذِهِ الْخَمِيصَةَ ‏\"‏‏.‏ فَأُسْكِتَ الْقَوْمُ‏.‏ قَالَ ‏\"‏ ائْتُونِي بِأُمِّ خَالِدٍ ‏\"‏‏.‏ فَأُتِيَ بِي النَّبِيُّ صلى الله عليه وسلم فَأَلْبَسَهَا بِيَدِهِ وَقَالَ ‏\"‏ أَبْلِي وَأَخْلِقِي ‏\"‏‏.‏ مَرَّتَيْنِ فَجَعَلَ يَنْظُرُ إِلَى عَلَمِ الْخَمِيصَةِ، وَيُشِيرُ بِيَدِهِ إِلَىَّ وَيَقُولُ ‏\"‏ يَا أُمَّ خَالِدٍ هَذَا سَنَا ‏\"‏‏.‏ وَالسَّنَا بِلِسَانِ الْحَبَشِيَّةِ الْحَسَنُ‏.‏ قَالَ إِسْحَاقُ حَدَّثَتْنِي امْرَأَةٌ مِنْ أَهْلِي أَنَّهَا رَأَتْهُ عَلَى أُمِّ خَالِدٍ‏.‏"
      },
      {
        "id": 5596,
        "hadith_number": "5846",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Nabi ﷺ Menggunakan Safran untuk Lelaki",
        "perawi_melayu": "Diriwayatkan daripada Anas رضي الله عنه:",
        "english_text": "The Prophet (ﷺ) forbade men to use saffron.",
        "malay_translation": "Nabi ﷺ melarang lelaki menggunakan safran.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ، قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ يَتَزَعْفَرَ الرَّجُلُ‏.‏"
      },
      {
        "id": 5597,
        "hadith_number": "5847",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Memakai Pakaian Berwarna Wars atau Saffron bagi Muhrim",
        "perawi_melayu": "Diriwayatkan oleh Ibnu 'Umar رضي اللہ عنہما :",
        "english_text": "The Prophet (ﷺ) forbade Muhrims to wear clothes dyed with Wars or saffron.",
        "malay_translation": "Nabi (ﷺ) melarang orang yang sedang berihram (Muhrim) memakai pakaian yang dicelup dengan warna Wars atau saffron.",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ يَلْبَسَ الْمُحْرِمُ ثَوْبًا مَصْبُوغًا بِوَرْسٍ أَوْ بِزَعْفَرَانٍ‏.‏"
      },
      {
        "id": 5598,
        "hadith_number": "5848",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ketinggian Nabi (ﷺ) dan Pakaian Merah",
        "perawi_melayu": "Diriwayatkan oleh Al-Bara رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) was of a modest height. I saw him wearing a red suit, and I did not see anything better than him.",
        "malay_translation": "Rasulullah (ﷺ) adalah seorang yang sederhana ketinggiannya. Aku melihat baginda memakai pakaian merah, dan aku tidak pernah melihat sesuatu yang lebih baik daripada baginda.",
        "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، سَمِعَ الْبَرَاءَ ـ رضى الله عنه ـ يَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم مَرْبُوعًا، وَقَدْ رَأَيْتُهُ فِي حُلَّةٍ حَمْرَاءَ مَا رَأَيْتُ شَيْئًا أَحْسَنَ مِنْهُ‏.‏"
      },
      {
        "id": 5599,
        "hadith_number": "5849",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perintah Nabi ﷺ tentang Beberapa Perkara dan Larangan Mengenai Pakaian Sutera",
        "perawi_melayu": "Diriwayatkan oleh Al-Bara رضي الله عنه :",
        "english_text": "The Prophet (ﷺ) ordered us to observe seven things: To visit the sick; follow funeral processions; say 'May Allah bestow His Mercy on you', to the sneezer if he says, 'Praise be to Allah!; He forbade us to wear silk, Dibaj, Qassiy and Istibarq (various kinds of silken clothes); or to use red Mayathir (silkcushions). (See Hadith No. 253 A, Vol. 8).",
        "malay_translation": "Nabi ﷺ memerintahkan kami untuk melaksanakan tujuh perkara: Menziarahi orang sakit; mengikuti jenazah; mengucapkan 'Semoga Allah merahmati kamu' kepada orang yang bersin jika dia mengucapkan 'Alhamdulillah!'; Baginda melarang kami memakai sutera, Dibaj, Qassiy dan Istibarq (berbagai jenis pakaian sutera); atau menggunakan Mayathir merah (bantal sutera). (Lihat Hadith No. 253 A, Jil. 8).",
        "arabic_text": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ أَشْعَثَ، عَنْ مُعَاوِيَةَ بْنِ سُوَيْدِ بْنِ مُقَرِّنٍ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ أَمَرَنَا النَّبِيُّ صلى الله عليه وسلم بِسَبْعٍ عِيَادَةِ الْمَرِيضِ، وَاتِّبَاعِ الْجَنَائِزِ، وَتَشْمِيتِ الْعَاطِسِ، وَنَهَانَا عَنْ لُبْسِ الْحَرِيرِ، وَالدِّيبَاجِ، وَالْقَسِّيِّ، وَالإِسْتَبْرَقِ، وَمَيَاثِرِ الْحُمْرِ‏.‏"
      },
      {
        "id": 5600,
        "hadith_number": "5850",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi (ﷺ) Solat Memakai Kasut",
        "perawi_melayu": "Diriwayatkan daripada Anas bin Malik رضی اللہ عنہ :",
        "english_text": "\"Did the Prophet (ﷺ) use to offer the prayers with his shoes on?\" He said, \"Yes.\"",
        "malay_translation": "\"Adakah Nabi (ﷺ) pernah menunaikan solat dengan memakai kasut?\" Beliau menjawab, \"Ya.\"",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ سَعِيدٍ أَبِي مَسْلَمَةَ، قَالَ سَأَلْتُ أَنَسًا أَكَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي فِي نَعْلَيْهِ قَالَ نَعَمْ‏.‏"
      },
      {
        "id": 5601,
        "hadith_number": "5851",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perbuatan Ibn `Umar yang Berbeza dari Rakan-rakannya",
        "perawi_melayu": "Diriwayatkan oleh `Abdullah Ibn-e-Umar رضی اللہ عنہما :",
        "english_text": "\"I see you doing four things which are not done by your friends.\" Ibn `Umar رضی اللہ عنہما said, \"What are they, O Ibn Juraij?\" He said, \"I see that you do not touch except the two Yemenite corners of the Ka`ba (while performing the Tawaf): and I see you wearing the Sabtiyya shoes; and I see you dyeing (your hair) with Sufra; and I see that when you are in Mecca, the people assume the state of Ihram on seeing the crescent (on the first day of Dhul-Hijja) while you do not assume the state of Ihram till the Day of Tarwiya (8th Dhul Hijja).\" `Abdullah bin `Umar رضی اللہ عنہما said to him, \"As for the corners of the Ka`ba, I have not seen Allah's Messenger (ﷺ) touching except the two Yemenite corners, As for the Sabtiyya shoes, I saw Allah's Messenger (ﷺ) wearing leather shoes that had no hair, and he used to perform the ablution while wearing them. Therefore, I like to wear such shoes. As regards dyeing with Sufra, I saw Allah's Messenger (ﷺ) dyeing his hair with it, so I like to dye (my hair) with it. As regards the crescent (of Dhul-Hijja), I have not seen Allah's Messenger (ﷺ) assuming the state of Ihram till his she-camel set out (on the 8th of Dhul-Hijja).\"",
        "malay_translation": "\"Saya melihat kamu melakukan empat perkara yang tidak dilakukan oleh rakan-rakanmu.\" Ibn `Umar رضی اللہ عنہما berkata, \"Apakah ia, wahai Ibn Juraij?\" Dia berkata, \"Saya melihat kamu tidak menyentuh melainkan dua sudut Yaman Ka`bah (semasa melakukan Tawaf): dan saya melihat kamu memakai kasut Sabtiyya; dan saya melihat kamu mewarnai (rambutmu) dengan Sufra; dan saya melihat bahawa apabila kamu berada di Mekah, orang ramai menganggap keadaan Ihram pada melihat anak bulan (pada hari pertama Zulhijjah) sedangkan kamu tidak menganggap keadaan Ihram sehingga Hari Tarwiyah (8 Zulhijjah).\" `Abdullah bin `Umar رضی اللہ عنہما berkata kepadanya, \"Adapun sudut-sudut Ka`bah, saya tidak pernah melihat Rasulullah (ﷺ) menyentuh melainkan dua sudut Yaman. Adapun kasut Sabtiyya, saya melihat Rasulullah (ﷺ) memakai kasut kulit yang tidak berbulu, dan baginda pernah berwuduk sambil memakainya. Oleh itu, saya suka memakai kasut seperti itu. Berkenaan mewarnai dengan Sufra, saya melihat Rasulullah (ﷺ) mewarnai rambut baginda dengannya, jadi saya suka mewarnai (rambut saya) dengannya. Berkenaan anak bulan (Zulhijjah), saya tidak melihat Rasulullah (ﷺ) menganggap keadaan Ihram sehingga unta betina baginda keluar (pada 8 Zulhijjah).",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ عُبَيْدِ بْنِ جُرَيْجٍ، أَنَّهُ قَالَ لِعَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ رَأَيْتُكَ تَصْنَعُ أَرْبَعًا لَمْ أَرَ أَحَدًا مِنْ أَصْحَابِكَ يَصْنَعُهَا‏.‏ قَالَ مَا هِيَ يَا ابْنَ جُرَيْجٍ قَالَ رَأَيْتُكَ لاَ تَمَسُّ مِنَ الأَرْكَانِ إِلاَّ الْيَمَانِيَيْنِ، وَرَأَيْتُكَ تَلْبَسُ النِّعَالَ السِّبْتِيَّةَ، وَرَأَيْتُكَ تَصْبُغُ بِالصُّفْرَةِ، وَرَأَيْتُكَ إِذَا كُنْتَ بِمَكَّةَ أَهَلَّ النَّاسُ إِذَا رَأَوُا الْهِلاَلَ، وَلَمْ تُهِلَّ أَنْتَ حَتَّى كَانَ يَوْمَ التَّرْوِيَةِ‏.‏ فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ عُمَرَ أَمَّا الأَرْكَانُ فَإِنِّي لَمْ أَرَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَمَسُّ إِلاَّ الْيَمَانِيَيْنِ، وَأَمَّا النِّعَالُ السِّبْتِيَّةُ فَإِنِّي رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَلْبَسُ النِّعَالَ الَّتِي لَيْسَ فِيهَا شَعَرٌ وَيَتَوَضَّأُ فِيهَا فَأَنَا أُحِبُّ أَنْ أَلْبَسَهَا، وَأَمَّا الصُّفْرَةُ فَإِنِّي رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَصْبُغُ بِهَا، فَأَنَا أُحِبُّ أَنْ أَصْبُغَ بِهَا وَأَمَّا الإِهْلاَلُ فَإِنِّي لَمْ أَرَ رَسُولَ اللَّهِ صلى الله عليه وسلم يُهِلُّ حَتَّى تَنْبَعِثَ بِهِ رَاحِلَتُهُ‏.‏"
      },
      {
        "id": 5602,
        "hadith_number": "5852",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Memakai Pakaian Berwarna Saffron atau Wars semasa Ihram",
        "perawi_melayu": "Diriwayatkan oleh Ibnu Umar رضي اللہ عنہما :",
        "english_text": "Allah's Messenger (ﷺ) forbade that a Muhrim should wear clothes dyed with Saffron or Wars, and said, \"Whoever has no shoes can put on Khuffs (socks made from thick fabric or leather) after cutting it below the ankles.\"",
        "malay_translation": "Rasulullah (ﷺ) melarang seorang Muhrim memakai pakaian yang dicelup dengan Saffron atau Wars, dan bersabda, \"Sesiapa yang tidak mempunyai kasut, boleh memakai Khuffs (stokin yang diperbuat daripada kain tebal atau kulit) setelah dipotong di bawah buku lali.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَلْبَسَ الْمُحْرِمُ ثَوْبًا مَصْبُوغًا بِزَعْفَرَانٍ أَوْ وَرْسٍ، وَقَالَ ‏ \"‏ مَنْ لَمْ يَجِدْ نَعْلَيْنِ فَلْيَلْبَسْ خُفَّيْنِ، وَلْيَقْطَعْهُمَا أَسْفَلَ مِنَ الْكَعْبَيْنِ ‏\"‏‏.‏"
      },
      {
        "id": 5603,
        "hadith_number": "5853",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pakaian Ganti Bagi Mereka yang Tiada Pakaian Asal",
        "perawi_melayu": "Diriwayatkan oleh Ibnu `Abbas رضی اللہ عنہما :",
        "english_text": "The Prophet (ﷺ) said, \"Whoever has no Izar (waist sheet), can wear trousers; and whoever has no sandals, can wear Khuffs (socks made from thick fabric or leather, but cut them short below the ankles).\"",
        "malay_translation": "Nabi ﷺ bersabda, \"Sesiapa yang tidak mempunyai Izar (kain selendang pinggang), boleh memakai seluar; dan sesiapa yang tidak mempunyai sandal, boleh memakai Khuffs (stokin yang diperbuat daripada kain tebal atau kulit, tetapi dipotong pendek di bawah buku lali).\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرِ بْنِ زَيْدٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَنْ لَمْ يَكُنْ لَهُ إِزَارٌ فَلْيَلْبَسِ السَّرَاوِيلَ، وَمَنْ لَمْ يَكُنْ لَهُ نَعْلاَنِ فَلْيَلْبَسْ خُفَّيْنِ ‏\"‏‏.‏"
      },
      {
        "id": 5604,
        "hadith_number": "5854",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi (ﷺ) Suka Memulakan dengan Kanan",
        "perawi_melayu": "Diriwayatkan oleh 'Aishah رضی اللہ عنہا :",
        "english_text": "The Prophet (ﷺ) used to like starting from the right in performing ablution, combing his hair and putting on his shoes.",
        "malay_translation": "Rasulullah (ﷺ) suka memulakan dari sebelah kanan ketika berwudhu', menyikat rambutnya dan memakai kasutnya.",
        "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي أَشْعَثُ بْنُ سُلَيْمٍ، سَمِعْتُ أَبِي يُحَدِّثُ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُحِبُّ التَّيَمُّنَ فِي طُهُورِهِ وَتَرَجُّلِهِ وَتَنَعُّلِهِ‏.‏"
      },
      {
        "id": 5605,
        "hadith_number": "5855",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Adab Memakai dan Menanggalkan Kasut",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضي اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) said, \"If you want to put on your shoes, put on the right shoe first; and if you want to take them off, take the left one first. Let the right shoe be the first to be put on and the last to be taken off.\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Apabila kamu hendak memakai kasut, mulakan dengan kasut kanan dahulu; dan apabila kamu hendak menanggalkannya, tanggalkan kasut kiri dahulu. Hendaklah kasut kanan menjadi yang pertama dipakai dan yang terakhir ditanggalkan.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا انْتَعَلَ أَحَدُكُمْ فَلْيَبْدَأْ بِالْيَمِينِ وَإِذَا نَزَعَ فَلْيَبْدَأْ بِالشِّمَالِ، لِتَكُنِ الْيُمْنَى أَوَّلَهُمَا تُنْعَلُ وَآخِرَهُمَا تُنْزَعُ ‏\"‏‏.‏"
      },
      {
        "id": 5606,
        "hadith_number": "5856",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Berjalan dengan Hanya Satu Kasut",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضي اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) said, \"None of you should walk, wearing one shoe only; he should either put on both shoes or put on no shoes whatsoever.\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Janganlah seseorang daripada kamu berjalan dengan hanya memakai sebelah kasut; hendaklah dia memakai kedua-dua kasut atau tidak memakai kasut langsung.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَمْشِي أَحَدُكُمْ فِي نَعْلٍ وَاحِدَةٍ لِيُحْفِهِمَا جَمِيعًا، أَوْ لِيَنْعَلْهُمَا جَمِيعًا ‏\"‏‏.‏"
      },
      {
        "id": 5607,
        "hadith_number": "5857",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Sandal Nabi ﷺ Mempunyai Dua Tali",
        "perawi_melayu": "Diriwayatkan oleh Anas رضي اللہ عنہ :",
        "english_text": "The sandal of the Prophet (ﷺ) had two straps.",
        "malay_translation": "Sandal Nabi ﷺ mempunyai dua tali.",
        "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسٌ ـ رضى الله عنه ـ أَنَّ نَعْلَ، النَّبِيِّ صلى الله عليه وسلم كَانَ لَهَا قِبَالاَنِ‏.‏"
      },
      {
        "id": 5608,
        "hadith_number": "5858",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Sandal Nabi SAW",
        "perawi_melayu": "Diriwayatkan daripada Isaa bin Tahman رضی اللہ عنہ :",
        "english_text": "Anas bin Malik  رضی اللہ عنہ brought out for us, two sandals having two straps. Thabit Al-Banani said, \"These were the sandals of the Prophet (ﷺ) .\"",
        "malay_translation": "Anas bin Malik رضی اللہ عنہ mengeluarkan untuk kami, dua sandal yang mempunyai dua tali. Thabit Al-Banani berkata, \"Ini adalah sandal Nabi (ﷺ) .\"",
        "arabic_text": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا عِيسَى بْنُ طَهْمَانَ، قَالَ خَرَجَ إِلَيْنَا أَنَسُ بْنُ مَالِكٍ بِنَعْلَيْنِ لَهُمَا قِبَالاَنِ، فَقَالَ ثَابِتٌ الْبُنَانِيُّ هَذِهِ نَعْلُ النَّبِيِّ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 5609,
        "hadith_number": "5859",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Orang Ramai Mengambil Berkat daripada Air Wuduk Nabi ﷺ",
        "perawi_melayu": "Diriwayatkan oleh Abu Juhaifa :",
        "english_text": "I came to the Prophet (ﷺ) while he was inside a red leather tent, and I saw Bilal taking the remaining water of the ablution of the Prophet, and the people were taking of that water and rubbing it on their faces; and whoever could not get anything of it, would share the moisture of the hand of his companion (and then rub it on his face).",
        "malay_translation": "Aku datang kepada Nabi ﷺ ketika baginda berada di dalam khemah kulit berwarna merah, dan aku melihat Bilal mengambil baki air wuduk Nabi, dan orang ramai mengambil air tersebut dan menyapunya ke wajah mereka; dan sesiapa yang tidak dapat mengambil air tersebut, akan berkongsi kelembapan tangan sahabatnya (lalu menyapunya ke wajah).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ، قَالَ حَدَّثَنِي عُمَرُ بْنُ أَبِي زَائِدَةَ، عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ، عَنْ أَبِيهِ، قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم وَهْوَ فِي قُبَّةٍ حَمْرَاءَ مِنْ أَدَمٍ، وَرَأَيْتُ بِلاَلاً أَخَذَ وَضُوءَ النَّبِيِّ صلى الله عليه وسلم وَالنَّاسُ يَبْتَدِرُونَ الْوَضُوءَ، فَمَنْ أَصَابَ مِنْهُ شَيْئًا تَمَسَّحَ بِهِ، وَمَنْ لَمْ يُصِبْ مِنْهُ شَيْئًا أَخَذَ مِنْ بَلَلِ يَدِ صَاحِبِهِ‏.‏"
      },
      {
        "id": 5610,
        "hadith_number": "5860",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi (ﷺ) Memanggil dan Mengumpulkan Kaum Ansar",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) called for the Ansar and gathered them in a leather tent.",
        "malay_translation": "Nabi (ﷺ) memanggil kaum Ansar dan mengumpulkan mereka di dalam khemah kulit.",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، ح وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ قَالَ أَرْسَلَ النَّبِيُّ صلى الله عليه وسلم إِلَى الأَنْصَارِ، وَجَمَعَهُمْ فِي قُبَّةٍ مِنْ أَدَمٍ‏.‏"
      },
      {
        "id": 5611,
        "hadith_number": "5861",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Amalan yang Berterusan Walaupun Sedikit",
        "perawi_melayu": "Diriwayatkan daripada 'Aisha رضی اللہ عنہا :",
        "english_text": "The Prophet (ﷺ) used to construct a loom with a Hasir at night m order to pray therein, and during the day he used to spread it out and sit on it. The people started coming to the Prophet (ﷺ) at night to offer the prayer behind him When their number increased, the Prophet (ﷺ) faced them and said. O people! Do only those good deeds which you can do, for Allah does not get tired (of giving reward) till you get tired, and the best deeds to Allah are the incessant ones though they were few.",
        "malay_translation": "Rasulullah (ﷺ) membina alat tenun dengan tikar Hasir pada waktu malam untuk bersolat di dalamnya, dan pada waktu siang baginda membentangkannya dan duduk di atasnya. Orang ramai mula datang kepada Rasulullah (ﷺ) pada waktu malam untuk menunaikan solat di belakang baginda. Apabila bilangan mereka bertambah, Rasulullah (ﷺ) menghadap mereka dan bersabda, \"Wahai manusia! Lakukanlah hanya amalan baik yang kamu mampu lakukan, kerana Allah tidak berasa letih (dalam memberi ganjaran) sehingga kamu berasa letih, dan amalan yang paling baik di sisi Allah adalah amalan yang berterusan walaupun sedikit.\"",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرٍ، حَدَّثَنَا مُعْتَمِرٌ، عَنْ عُبَيْدِ اللَّهِ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَحْتَجِرُ حَصِيرًا بِاللَّيْلِ فَيُصَلِّي، وَيَبْسُطُهُ بِالنَّهَارِ فَيَجْلِسُ عَلَيْهِ، فَجَعَلَ النَّاسُ يَثُوبُونَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَيُصَلُّونَ بِصَلاَتِهِ حَتَّى كَثُرُوا فَأَقْبَلَ فَقَالَ ‏ \"‏ يَا أَيُّهَا النَّاسُ خُذُوا مِنَ الأَعْمَالِ مَا تُطِيقُونَ، فَإِنَّ اللَّهَ لاَ يَمَلُّ حَتَّى تَمَلُّوا، وَإِنَّ أَحَبَّ الأَعْمَالِ إِلَى اللَّهِ مَا دَامَ وَإِنْ قَلَّ ‏\"‏‏.‏"
      },
      {
        "id": 5612,
        "hadith_number": "5862",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi (ﷺ) Memberi Jubah kepada Makhrama",
        "perawi_melayu": "Diriwayatkan oleh Al-Miswar bin Makhrama رضی اللہ عنہ :",
        "english_text": "My father, Makhrama said to me, \"I have come to know that some cloaks have come to the Prophet (ﷺ) and he is distributing them. So O my son! take me to him.\" We went to the Prophet (ﷺ) and found him in the house. My father said to me, \"O my son! Call the Prophet (ﷺ) for me.\" I found it hard to do so, so I said surprisingly, \"Shall I call Allah's Messenger (ﷺ) for you ?\" My father said, \"O mu son! He is not a tyrant.\" So I called him and he came out wearing a Dibaj cloak having gold buttons, and said: \"O Makhrama, I kept this for you.\" The Prophet (ﷺ) then gave it to him.",
        "malay_translation": "Ayahku, Makhrama berkata kepadaku, \"Aku telah mendapat tahu bahawa beberapa jubah telah sampai kepada Nabi (ﷺ) dan baginda sedang mengagihkannya. Maka, wahai anakku! bawa aku kepadanya.\" Kami pergi kepada Nabi (ﷺ) dan mendapati baginda di dalam rumah. Ayahku berkata kepadaku, \"Wahai anakku! Panggillah Nabi (ﷺ) untukku.\" Aku berasa sukar untuk berbuat demikian, lalu aku berkata dengan hairan, \"Patutkah aku memanggil Rasulullah (ﷺ) untukmu?\" Ayahku berkata, \"Wahai anakku! Baginda bukanlah seorang yang zalim.\" Lalu aku memanggilnya dan baginda keluar memakai jubah Dibaj yang mempunyai butang emas, dan berkata: \"Wahai Makhrama, aku simpan ini untukmu.\" Kemudian Nabi (ﷺ) memberikannya kepada beliau.",
        "arabic_text": "وَقَالَ اللَّيْثُ حَدَّثَنِي ابْنُ أَبِي مُلَيْكَةَ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، أَنَّ أَبَاهُ، مَخْرَمَةَ قَالَ لَهُ يَا بُنَىَّ إِنَّهُ بَلَغَنِي أَنَّ النَّبِيَّ صلى الله عليه وسلم قَدِمَتْ عَلَيْهِ أَقْبِيَةٌ فَهْوَ يَقْسِمُهَا، فَاذْهَبْ بِنَا إِلَيْهِ، فَذَهَبْنَا فَوَجَدْنَا النَّبِيَّ صلى الله عليه وسلم فِي مَنْزِلِهِ، فَقَالَ لِي يَا بُنَىَّ ادْعُ لِي النَّبِيَّ صلى الله عليه وسلم فَأَعْظَمْتُ ذَلِكَ‏.‏ فَقُلْتُ أَدْعُو لَكَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا بُنَىَّ إِنَّهُ لَيْسَ بِجَبَّارٍ‏.‏ فَدَعَوْتُهُ فَخَرَجَ وَعَلَيْهِ قَبَاءٌ مِنْ دِيبَاجٍ مُزَرَّرٌ بِالذَّهَبِ، فَقَالَ ‏ \"‏ يَا مَخْرَمَةُ هَذَا خَبَأْنَاهُ لَكَ ‏\"‏‏.‏ فَأَعْطَاهُ إِيَّاهُ‏.‏"
      },
      {
        "id": 5613,
        "hadith_number": "5863",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perkara yang Dilarang dan Perintah Nabi ﷺ",
        "perawi_melayu": "Diriwayatkan oleh Al-Bara' bin `Azib رضي الله عنه :",
        "english_text": "The Prophet (ﷺ) forbade us to use seven things: He forbade using gold rings, silk, Istabraq, Dibaj, red Mayathir, Al-Qassiy, and silver utensils. He ordered us to do seven other things. To pay a visit to the sick; to follow funeral processions; to say, \"May Allah be merciful to you\" to a sneezer if he says \"Praise be to Allah\"; to return greetings, to accept invitations; to help others to fulfil their oaths and to help the oppressed ones.",
        "malay_translation": "Nabi ﷺ melarang kami menggunakan tujuh perkara: Baginda melarang penggunaan cincin emas, sutera, Istabraq, Dibaj, Mayathir merah, Al-Qassiy, dan perkakas perak. Baginda memerintahkan kami melakukan tujuh perkara lain: Menziarahi orang sakit; mengiringi jenazah; mengucapkan, \"Semoga Allah merahmati kamu\" kepada orang yang bersin jika dia mengucapkan \"Alhamdulillah\"; membalas salam; menerima undangan; membantu orang lain memenuhi sumpah mereka dan membantu orang yang tertindas.",
        "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا أَشْعَثُ بْنُ سُلَيْمٍ، قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ سُوَيْدِ بْنِ مُقَرِّنٍ، قَالَ سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ ـ رضى الله عنهما ـ يَقُولُ نَهَانَا النَّبِيُّ صلى الله عليه وسلم عَنْ سَبْعٍ نَهَى عَنْ خَاتَمِ الذَّهَبِ ـ أَوْ قَالَ حَلْقَةِ الذَّهَبِ ـ وَعَنِ الْحَرِيرِ، وَالإِسْتَبْرَقِ، وَالدِّيبَاجِ، وَالْمِيثَرَةِ الْحَمْرَاءِ، وَالْقَسِّيِّ، وَآنِيَةِ الْفِضَّةِ، وَأَمَرَنَا بِسَبْعٍ بِعِيَادَةِ الْمَرِيضِ، وَاتِّبَاعِ الْجَنَائِزِ، وَتَشْمِيتِ الْعَاطِسِ، وَرَدِّ السَّلاَمِ، وَإِجَابَةِ الدَّاعِي، وَإِبْرَارِ الْمُقْسِمِ، وَنَصْرِ الْمَظْلُومِ‏.‏"
      },
      {
        "id": 5614,
        "hadith_number": "5864",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Memakai Cincin Emas",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) forbade the wearing of a gold ring. Amr, Shobah, Qqatadah, reported same from Basheer bin Naheek.",
        "malay_translation": "Rasulullah (ﷺ) melarang daripada memakai cincin emas. Amr, Shobah, dan Qqatadah meriwayatkan hadis yang sama daripada Basheer bin Naheek.",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ نَهَى عَنْ خَاتَمِ الذَّهَبِ‏.‏ وَقَالَ عَمْرٌو أَخْبَرَنَا شُعْبَةُ عَنْ قَتَادَةَ سَمِعَ النَّضْرَ سَمِعَ بَشِيرًا مِثْلَهُ‏.‏"
      },
      {
        "id": 5615,
        "hadith_number": "5865",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah (ﷺ) Memakai Cincin Emas Kemudian Beralih ke Perak",
        "perawi_melayu": "Diriwayatkan oleh Abdullah رضی اللہ عنہما :",
        "english_text": "Allah's Messenger (ﷺ) wore a gold or silver .. ring and placed its stone towards the palm of his hand. The people also started wearing gold rings like it, but when the Prophet (ﷺ) saw them wearing such rings, he threw away that golden ring and then wore a silver ring.",
        "malay_translation": "Rasulullah (ﷺ) memakai cincin emas atau perak dan meletakkan batu cincin tersebut menghadap ke telapak tangannya. Orang ramai juga mula memakai cincin emas seperti baginda, tetapi apabila Nabi (ﷺ) melihat mereka memakai cincin sedemikian, baginda membuang cincin emas itu dan kemudian memakai cincin perak.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اتَّخَذَ خَاتَمًا مِنْ ذَهَبٍ، وَجَعَلَ فَصَّهُ مِمَّا يَلِي كَفَّهُ، فَاتَّخَذَهُ النَّاسُ، فَرَمَى بِهِ، وَاتَّخَذَ خَاتَمًا مِنْ وَرِقٍ أَوْ فِضَّةٍ‏.‏"
      },
      {
        "id": 5616,
        "hadith_number": "5866",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Memakai Cincin Emas dan Sejarah Cincin Nabi Muhammad ﷺ",
        "perawi_melayu": "Diriwayatkan oleh Ibnu `Umar رضی اللہ عنہما:",
        "english_text": "Allah's Messenger (ﷺ) wore a gold ring or a silver ring and placed its stone towards the palm of his hand and had the name 'Muhammad, the Messenger of Allah' engraved on it. The people also started wearing gold rings like it, but when the Prophet (ﷺ) saw them wearing such rings, he threw away his own ring and said. \"I will never wear it,\" and then wore a silver ring, whereupon the people too started wearing silver rings. Ibn `Umar رضی اللہ عنہما added: After the Prophet (ﷺ) Abu Bakr رضی اللہ عنہ wore the ring, and then `Umar رضی اللہ عنہ and then `Uthman wore it till it fell in the Aris well from `Uthman رضی اللہ عنہ .",
        "malay_translation": "Rasulullah ﷺ memakai cincin emas atau cincin perak dan meletakkan batu cincin itu ke arah tapak tangannya dan mengukir nama 'Muhammad, Rasulullah' padanya. Orang ramai juga mula memakai cincin emas seperti itu, tetapi apabila Nabi ﷺ melihat mereka memakai cincin seperti itu, baginda membuang cincinnya sendiri dan berkata, \"Aku tidak akan memakainya lagi,\" dan kemudian memakai cincin perak, maka orang ramai juga mula memakai cincin perak. Ibnu `Umar رضی اللہ عنہما menambah: Selepas Nabi ﷺ, Abu Bakr رضی اللہ عنہ memakai cincin itu, kemudian `Umar رضی اللہ عنہ dan kemudian `Uthman memakainya sehingga ia terjatuh ke dalam telaga Aris daripada `Uthman رضی اللہ عنہ .",
        "arabic_text": "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اتَّخَذَ خَاتَمًا مِنْ ذَهَبٍ أَوْ فِضَّةٍ، وَجَعَلَ فَصَّهُ مِمَّا يَلِي كَفَّهُ، وَنَقَشَ فِيهِ مُحَمَّدٌ رَسُولُ اللَّهِ‏.‏ فَاتَّخَذَ النَّاسُ مِثْلَهُ، فَلَمَّا رَآهُمْ قَدِ اتَّخَذُوهَا رَمَى بِهِ، وَقَالَ ‏ \"‏ لاَ أَلْبَسُهُ أَبَدًا ‏\"‏‏.‏ ثُمَّ اتَّخَذَ خَاتَمًا مِنْ فِضَّةٍ، فَاتَّخَذَ النَّاسُ خَوَاتِيمَ الْفِضَّةِ‏.‏ قَالَ ابْنُ عُمَرَ فَلَبِسَ الْخَاتَمَ بَعْدَ النَّبِيِّ صلى الله عليه وسلم أَبُو بَكْرٍ ثُمَّ عُمَرُ ثُمَّ عُثْمَانُ، حَتَّى وَقَعَ مِنْ عُثْمَانَ فِي بِئْرِ أَرِيسَ‏.‏"
      },
      {
        "id": 5617,
        "hadith_number": "5867",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Membuang Cincin Emas",
        "perawi_melayu": "Diriwayatkan oleh Abdullah bin `Umar رضی اللہ عنہما :",
        "english_text": "Allah's Messenger (ﷺ) wore a gold ring, then he threw it and said, \"I will never wear it.\" The people also threw their (gold) rings.",
        "malay_translation": "Rasulullah SAW memakai cincin emas, kemudian baginda membuangnya dan bersabda, \"Aku tidak akan memakainya lagi.\" Orang ramai juga membuang cincin-cincin (emas) mereka.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَلْبَسُ خَاتَمًا مِنْ ذَهَبٍ فَنَبَذَهُ فَقَالَ ‏ \"‏ لاَ أَلْبَسُهُ أَبَدًا ‏\"‏‏.‏ فَنَبَذَ النَّاسُ خَوَاتِيمَهُمْ‏.‏"
      },
      {
        "id": 5618,
        "hadith_number": "5868",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Memakai Cincin Perak",
        "perawi_melayu": "Diriwayatkan daripada Anas bin Malik رضی اللہ عنہ :",
        "english_text": "He saw a silver ring on the hand of Allah's Messenger (ﷺ) for one day only. Then the people had silver rings made for themselves and wore it. On that, Allah's Messenger (ﷺ) threw away their rings as well. (For the details of this Hadith, see Fath-ul-Bari). Similarly, Ibrahim bin Sa'd, Ziyad, and Shobah reported from Zuhri. And Ibn-e-Mussafir has reported from Zuhri: I saw silver ring.",
        "malay_translation": "Beliau melihat cincin perak pada tangan Rasulullah (ﷺ) hanya untuk satu hari sahaja. Kemudian, orang ramai membuat cincin perak untuk diri mereka sendiri dan memakainya. Setelah itu, Rasulullah (ﷺ) membuang cincin mereka juga. (Untuk perincian Hadith ini, lihat Fath-ul-Bari). Begitu juga, Ibrahim bin Sa'd, Ziyad, dan Shobah meriwayatkan daripada Zuhri. Dan Ibn-e-Mussafir telah meriwayatkan daripada Zuhri: Saya melihat cincin perak.",
        "arabic_text": "حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ أَنَّهُ رَأَى فِي يَدِ رَسُولِ اللَّهِ صلى الله عليه وسلم خَاتَمًا مِنْ وَرِقٍ يَوْمًا وَاحِدًا، ثُمَّ إِنَّ النَّاسَ اصْطَنَعُوا الْخَوَاتِيمَ مِنْ وَرِقٍ وَلَبِسُوهَا، فَطَرَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم خَاتَمَهُ، فَطَرَحَ النَّاسُ خَوَاتِيمَهُمْ‏.‏ تَابَعَهُ إِبْرَاهِيمُ بْنُ سَعْدٍ وَزِيَادٌ وَشُعَيْبٌ عَنِ الزُّهْرِيِّ‏.‏ وَقَالَ ابْنُ مُسَافِرٍ عَنِ الزُّهْرِيِّ أَرَى خَاتَمًا مِنْ وَرِقٍ‏.‏"
      },
      {
        "id": 5619,
        "hadith_number": "5869",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi (ﷺ) Memakai Cincin dan Solat Isyak Lewat",
        "perawi_melayu": "Diriwayatkan oleh Anas رضی اللہ عنہ :",
        "english_text": "\"Did the Prophet (ﷺ) wear a ring?\" Anas said, \"Once he delayed the: `Isha' prayer till midnight. Then he came, facing us ..... as if l am now Looking at the glitter of his ring ..... and said, \"The people have offered their prayers and slept but you have been in prayer as you have been waiting for it.\"",
        "malay_translation": "\"Adakah Nabi (ﷺ) memakai cincin?\" Anas berkata, \"Suatu ketika Baginda melewatkan solat Isyak sehingga tengah malam. Kemudian Baginda datang menghadap kami ..... seolah-olah saya sekarang melihat kilauan cincin Baginda ..... dan bersabda, \"Orang ramai telah menunaikan solat mereka dan telah tidur, tetapi kamu terus berada dalam solat kerana kamu telah menunggunya.\"",
        "arabic_text": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا يَزِيدُ بْنُ زُرَيْعٍ، أَخْبَرَنَا حُمَيْدٌ، قَالَ سُئِلَ أَنَسٌ هَلِ اتَّخَذَ النَّبِيُّ صلى الله عليه وسلم خَاتَمًا قَالَ أَخَّرَ لَيْلَةً صَلاَةَ الْعِشَاءِ إِلَى شَطْرِ اللَّيْلِ، ثُمَّ أَقْبَلَ عَلَيْنَا بِوَجْهِهِ، فَكَأَنِّي أَنْظُرُ إِلَى وَبِيصِ خَاتَمِهِ‏.‏ قَالَ ‏ \"‏ إِنَّ النَّاسَ قَدْ صَلَّوْا وَنَامُوا، وَإِنَّكُمْ لَمْ تَزَالُوا فِي صَلاَةٍ مَا انْتَظَرْتُمُوهَا ‏\"‏‏.‏"
      },
      {
        "id": 5620,
        "hadith_number": "5870",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cincin Rasulullah ﷺ dan Batu Peraknya",
        "perawi_melayu": "Diriwayatkan oleh Anas رضي الله عنه :",
        "english_text": "The ring of the Prophet (ﷺ) was of silver, and its stone was of silver too. Yahya, Ayyub, Humaid, Hadrat Anas رضی اللہ عنہ reported it.",
        "malay_translation": "Cincin Nabi ﷺ adalah daripada perak, dan batunya juga daripada perak. Yahya, Ayyub, Humaid, Hadrat Anas رضي الله عنه meriwayatkannya.",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ حُمَيْدًا، يُحَدِّثُ عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ خَاتَمُهُ مِنْ فِضَّةٍ وَكَانَ فَصُّهُ مِنْهُ‏.‏ وَقَالَ يَحْيَى بْنُ أَيُّوبَ حَدَّثَنِي حُمَيْدٌ سَمِعَ أَنَسًا عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 5621,
        "hadith_number": "5871",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Wanita Meminta Dinikahi dan Mahar Berdasarkan Hafalan Al-Quran",
        "perawi_melayu": "Diriwayatkan oleh Sahl رضی اللہ عنہ :",
        "english_text": "A woman came to the Prophet (ﷺ) and said, \"I have come to present myself to you (for marriage).\" She kept standing for a long period during which period the Prophet (ﷺ) looked at her carefully. When she stayed for a Long period, a man said to the Prophet (ﷺ) \"If you are not in need of her, then marry her to me.\" The Prophet (ﷺ) said, \"Have you got anything to give her (as Mahr)?\" The man said, \"No.\" The Prophet said, \"Go (to your house) and search for something.\" The man went and came back to say, \"By Allah, I could not find anything.\" The Prophet (ﷺ) said, \"Go again and search for something, even if it be an iron ring.\" He went again and came back saying, \"No, by Allah, I could not get even an iron ring.\" The man had only an Izar and had no Rida' (upper garment). He said, \"I will give her my Izar as Mahr.\" On that the Prophet (ﷺ) said, \"Your Izar? If she wears it, nothing of it will remain on you, and if you wear it nothing of it will be on her\" The man went aside and sat down When the Prophet (ﷺ) saw him leaving (after a while), he called back and asked. \"How much Qur'an do you know (by heart)? He said, 'I know such and such Suras,\" naming some Suras. The Prophet (ﷺ) said, \"I marry her to you for the amount of Qur'an you know (by heart).",
        "malay_translation": "Seorang wanita datang kepada Nabi (ﷺ) dan berkata, \"Saya datang untuk menawarkan diri kepada anda (untuk berkahwin).\" Dia terus berdiri untuk jangka masa yang lama, di mana Nabi (ﷺ) memandangnya dengan teliti. Apabila dia berdiri untuk jangka masa yang panjang, seorang lelaki berkata kepada Nabi (ﷺ), \"Jika anda tidak memerlukannya, maka kahwinkan dia dengan saya.\" Nabi (ﷺ) bertanya, \"Adakah kamu mempunyai apa-apa untuk diberikan kepadanya (sebagai mahar)?\" Lelaki itu menjawab, \"Tidak.\" Nabi bersabda, \"Pergi (ke rumah kamu) dan cari sesuatu.\" Lelaki itu pergi dan kembali dan berkata, \"Demi Allah, saya tidak dapat mencari apa-apa.\" Nabi (ﷺ) bersabda, \"Pergi lagi dan cari sesuatu, walaupun hanya sebentuk cincin besi.\" Dia pergi lagi dan kembali dan berkata, \"Tidak, demi Allah, saya tidak mendapat walau sebentuk cincin besi.\" Lelaki itu hanya mempunyai Izar dan tidak mempunyai Rida' (pakaian atas). Dia berkata, \"Saya akan memberikannya Izar saya sebagai mahar.\" Mengenai hal itu Nabi (ﷺ) bersabda, \"Izar kamu? Jika dia memakainya, tiada apa pun akan tinggal pada kamu, dan jika kamu memakainya, tiada apa pun akan ada padanya\" Lelaki itu pergi ke tepi dan duduk. Apabila Nabi (ﷺ) melihat dia pergi (selepas beberapa ketika), baginda memanggilnya kembali dan bertanya, \"Berapa banyak Al-Quran yang kamu hafal?\" Lelaki itu berkata, 'Saya tahu surah-surah tertentu,\" sambil menyebut beberapa surah. Nabi (ﷺ) bersabda, \"Saya mengahwinkannya dengan kamu dengan mahar sebanyak Al-Quran yang kamu hafal.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ سَهْلاً، يَقُولُ جَاءَتِ امْرَأَةٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ جِئْتُ أَهَبُ نَفْسِي‏.‏ فَقَامَتْ طَوِيلاً فَنَظَرَ وَصَوَّبَ، فَلَمَّا طَالَ مُقَامُهَا فَقَالَ رَجُلٌ زَوِّجْنِيهَا، إِنْ لَمْ تَكُنْ لَكَ بِهَا حَاجَةٌ‏.‏ قَالَ ‏\"‏ عِنْدَكَ شَىْءٌ تُصْدِقُهَا ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ انْظُرْ ‏\"‏‏.‏ فَذَهَبَ ثُمَّ رَجَعَ فَقَالَ وَاللَّهِ إِنْ وَجَدْتُ شَيْئًا‏.‏ قَالَ ‏\"‏ اذْهَبْ فَالْتَمِسْ وَلَوْ خَاتَمًا مِنْ حَدِيدٍ ‏\"‏‏.‏ فَذَهَبَ ثُمَّ رَجَعَ قَالَ لاَ وَاللَّهِ وَلاَ خَاتَمًا مِنْ حَدِيدٍ‏.‏ وَعَلَيْهِ إِزَارٌ مَا عَلَيْهِ رِدَاءٌ‏.‏ فَقَالَ أُصْدِقُهَا إِزَارِي فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِزَارُكَ إِنْ لَبِسَتْهُ لَمْ يَكُنْ عَلَيْكَ مِنْهُ شَىْءٌ، وَإِنْ لَبِسْتَهُ لَمَ يَكُنْ عَلَيْهَا مِنْهُ شَىْءٌ ‏\"‏‏.‏ فَتَنَحَّى الرَّجُلُ فَجَلَسَ فَرَآهُ النَّبِيُّ صلى الله عليه وسلم مُوَلِّيًا فَأَمَرَ بِهِ فَدُعِيَ فَقَالَ ‏\"‏ مَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏ قَالَ سُورَةُ كَذَا وَكَذَا لِسُوَرٍ عَدَّدَهَا‏.‏ قَالَ ‏\"‏ قَدْ مَلَّكْتُكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏"
      },
      {
        "id": 5622,
        "hadith_number": "5872",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi ﷺ Memerintahkan Membuat Cincin untuk Surat",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik رضي الله عنه :",
        "english_text": "Allah's Messenger (ﷺ) wanted to write a letter to a group of people or some non-Arabs. It was said to him, \"They do not accept any letter unless it is stamped.\" So the Prophet (ﷺ) had a silver ring made for himself, and on it was engraved: 'Muhammad, the Messenger of Allah'. .. as if I am now looking at the glitter of the ring on the finger (or in the palm) of the Prophet (ﷺ) .",
        "malay_translation": "Rasulullah ﷺ ingin menulis surat kepada sekumpulan orang atau beberapa orang bukan Arab. Dikatakan kepada baginda, \"Mereka tidak menerima sebarang surat melainkan jika ia dicap.\" Maka Nabi ﷺ membuat cincin perak untuk dirinya sendiri, dan padanya terukir: 'Muhammad, Rasulullah'. ... seolah-olah saya sedang melihat kilauan cincin di jari (atau di tapak tangan) Nabi ﷺ.",
        "arabic_text": "حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم أَرَادَ أَنْ يَكْتُبَ إِلَى رَهْطٍ أَوْ أُنَاسٍ مِنَ الأَعَاجِمِ، فَقِيلَ لَهُ إِنَّهُمْ لاَ يَقْبَلُونَ كِتَابًا إِلاَّ عَلَيْهِ خَاتَمٌ، فَاتَّخَذَ النَّبِيُّ صلى الله عليه وسلم خَاتَمًا مِنْ فِضَّةٍ نَقْشُهُ مُحَمَّدٌ رَسُولُ اللَّهِ فَكَأَنِّي بِوَبِيصِ أَوْ بِبَصِيصِ الْخَاتَمِ فِي إِصْبَعِ النَّبِيِّ صلى الله عليه وسلم أَوْ فِي كَفِّهِ‏.‏"
      },
      {
        "id": 5623,
        "hadith_number": "5873",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cincin Perak Rasulullah (ﷺ) dan Para Khalifah",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Umar رضی اللہ عنہما :",
        "english_text": "Allah's Messenger (ﷺ) had a silver ring made for himself and it was worn by him on his hand. Afterwards it was worn by Abu Bakr رضی اللہ عنہ , and then by `Umar رضی اللہ عنہ , and then by `Uthman رضی اللہ عنہ till it fell in the Aris well. (On that ring) was engraved: 'Muhammad, the Messenger of Allah.\"",
        "malay_translation": "Rasulullah (ﷺ) membuat cincin perak untuk dirinya sendiri dan memakainya di tangannya. Kemudian, cincin itu dipakai oleh Abu Bakr رضی اللہ عنہ, kemudian oleh `Umar رضی اللہ عنہ, dan kemudian oleh `Uthman رضی اللہ عنہ sehingga terjatuh ke dalam perigi Aris. (Pada cincin itu) terukir: 'Muhammad, Rasul Allah.'",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ اتَّخَذَ رَسُولُ اللَّهِ صلى الله عليه وسلم خَاتَمًا مِنْ وَرِقٍ، وَكَانَ فِي يَدِهِ، ثُمَّ كَانَ بَعْدُ فِي يَدِ أَبِي بَكْرٍ، ثُمَّ كَانَ بَعْدُ فِي يَدِ عُمَرَ، ثُمَّ كَانَ بَعْدُ فِي يَدِ عُثْمَانَ، حَتَّى وَقَعَ بَعْدُ فِي بِئْرِ أَرِيسَ، نَقْشُهُ مُحَمَّدٌ رَسُولُ اللَّهِ‏.‏"
      },
      {
        "id": 5624,
        "hadith_number": "5874",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi (ﷺ) Membuat Cincin dan Larangan Mengukir Seperti Itu",
        "perawi_melayu": "Diriwayatkan oleh Anas رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) got a ring made for himself and said, \"I have got a ring made (for myself) and engraved a certain engraving on it so none of you should get such an engraving on his ring.\" I saw the glitter of the ring on his little finger.",
        "malay_translation": "Nabi (ﷺ) membuat cincin untuk dirinya sendiri dan bersabda, \"Aku telah membuat cincin (untuk diriku) dan mengukir ukiran tertentu padanya, maka janganlah seorang pun dari kalian membuat ukiran seperti itu pada cincinnya.\" Aku melihat kilauan cincin itu pada jari kelingking baginda.",
        "arabic_text": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ صَنَعَ النَّبِيُّ صلى الله عليه وسلم خَاتَمًا قَالَ ‏ \"‏ إِنَّا اتَّخَذْنَا خَاتَمًا، وَنَقَشْنَا فِيهِ نَقْشًا، فَلاَ يَنْقُشْ عَلَيْهِ أَحَدٌ ‏\"‏‏.‏ قَالَ فَإِنِّي لأَرَى بَرِيقَهُ فِي خِنْصَرِهِ‏.‏"
      },
      {
        "id": 5625,
        "hadith_number": "5875",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi (ﷺ) Menggunakan Cincin untuk Surat kepada Bangsa Byzantine",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik رضی اللہ عنہ :",
        "english_text": "When the Prophet (ﷺ) intended to write to the Byzantines, it was said to him, \"Those people do not read your letter unless it is stamped.\" So the Prophet (ﷺ) took a silver ring and got 'Muhammad, the Apostle of Allah' engraved on it .... as if I am now looking at its glitter in his hand.",
        "malay_translation": "Ketika Nabi (ﷺ) berhasrat untuk menulis surat kepada bangsa Byzantine, dikatakan kepada baginda, \"Orang-orang itu tidak membaca suratmu melainkan ia dicop.\" Maka Nabi (ﷺ) mengambil cincin perak dan mengukir 'Muhammad, Rasulullah' padanya .... seolah-olah aku sedang melihat kilauannya di tangannya.",
        "arabic_text": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ لَمَّا أَرَادَ النَّبِيُّ صلى الله عليه وسلم أَنْ يَكْتُبَ إِلَى الرُّومِ قِيلَ لَهُ إِنَّهُمْ لَنْ يَقْرَءُوا كِتَابَكَ إِذَا لَمْ يَكُنْ مَخْتُومًا‏.‏ فَاتَّخَذَ خَاتَمًا مِنْ فِضَّةٍ، وَنَقْشُهُ مُحَمَّدٌ رَسُولُ اللَّهِ‏.‏ فَكَأَنَّمَا أَنْظُرُ إِلَى بَيَاضِهِ فِي يَدِهِ‏.‏"
      },
      {
        "id": 5626,
        "hadith_number": "5876",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi (ﷺ) Membuang Cincin Emasnya dan Para Sahabat Mengikutinya",
        "perawi_melayu": "Diriwayatkan oleh Abdullah رضي الله عنهما :",
        "english_text": "The Prophet (ﷺ) had a golden ring made for himself, and when he wore it. he used to turn its stone toward the palm of his! hand. So the people too had gold made for themselves. The Prophet (ﷺ) then ascended the pulpit, and after glorifying and praising Allah, he said, \"I had it made for me, but now I will never wear it again.\" He threw it away, and then the people threw away their rings too. (Juwairiya, a subnarrator, said: I think Anas said that the Prophet (ﷺ) was wearing the ring in his right hand.)",
        "malay_translation": "Nabi (ﷺ) membuat cincin emas untuk dirinya sendiri, dan apabila baginda memakainya, baginda memalingkan batu cincin itu ke arah tapak tangan baginda. Kemudian orang ramai juga membuat cincin emas untuk diri mereka sendiri. Nabi (ﷺ) kemudian naik ke mimbar, dan setelah memuji dan menyanjung Allah, baginda bersabda, \"Aku membuatnya untukku, tetapi sekarang aku tidak akan memakainya lagi.\" Baginda membuangnya, dan kemudian orang ramai juga membuang cincin mereka. (Juwairiya, seorang perawi tambahan, berkata: Saya fikir Anas berkata bahawa Nabi (ﷺ) memakai cincin itu di tangan kanannya.)",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ، حَدَّثَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم اصْطَنَعَ خَاتَمًا مِنْ ذَهَبٍ، جَعَلَ فَصَّهُ فِي بَطْنِ كَفِّهِ إِذَا لَبِسَهُ، فَاصْطَنَعَ النَّاسُ خَوَاتِيمَ مِنْ ذَهَبٍ، فَرَقِيَ الْمِنْبَرَ، فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ فَقَالَ ‏ \"‏ إِنِّي كُنْتُ اصْطَنَعْتُهُ، وَإِنِّي لاَ أَلْبَسُهُ ‏\"‏‏.‏ فَنَبَذَهُ فَنَبَذَ النَّاسُ‏.‏ قَالَ جُوَيْرِيَةُ وَلاَ أَحْسِبُهُ إِلاَّ قَالَ فِي يَدِهِ الْيُمْنَى‏.‏"
      },
      {
        "id": 5627,
        "hadith_number": "5877",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah ﷺ Memakai Cincin Perak dan Larangan Mengukir Kalimah yang Sama",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik رضی اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) took a silver ring and had 'Muhammad, the Apostle' of Allah' engraved on it. The Prophet then said (to us), 'I have a silver ring with 'Muhammad, the Messenger of Allah engraved on it, so none of you should have the same engraving on his ring.'",
        "malay_translation": "Rasulullah ﷺ mengambil cincin perak dan mengukir padanya 'Muhammad, Rasul Allah'. Kemudian Nabi bersabda (kepada kami), 'Aku mempunyai cincin perak dengan 'Muhammad, Rasul Allah' terukir padanya, maka janganlah sekali-kali ada di antara kamu yang mengukir ukiran yang sama pada cincinnya.'",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادٌ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اتَّخَذَ خَاتَمًا مِنْ فِضَّةٍ، وَنَقَشَ فِيهِ، مُحَمَّدٌ رَسُولُ اللَّهِ‏.‏ وَقَالَ ‏ \"‏ إِنِّي اتَّخَذْتُ خَاتَمًا مِنْ وَرِقٍ، وَنَقَشْتُ فِيهِ، مُحَمَّدٌ رَسُولُ اللَّهِ‏.‏ فَلاَ يَنْقُشَنَّ أَحَدٌ عَلَى نَقْشِهِ ‏\"‏‏.‏"
      },
      {
        "id": 5628,
        "hadith_number": "5878",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ukiran Cincin Nabi Muhammad SAW oleh Abu Bakar RA",
        "perawi_melayu": "Diriwayatkan oleh Anas رضی اللہ عنہ :",
        "english_text": "When Abu Bakr رضی اللہ عنہ became the Caliph, he wrote a letter to him (and stamped it with the Prophet's ring) and the engraving of the ring was in three lines: Muhammad in one line, 'Apostle' in another line, and 'Allah' in a third line.",
        "malay_translation": "Ketika Abu Bakr رضی اللہ عنہ menjadi Khalifah, beliau menulis surat kepadanya (dan mencopnya dengan cincin Nabi) dan ukiran cincin itu adalah dalam tiga baris: Muhammad pada satu baris, 'Rasul' pada baris lain, dan 'Allah' pada baris ketiga.",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ، قَالَ حَدَّثَنِي أَبِي، عَنْ ثُمَامَةَ، عَنْ أَنَسٍ، أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ لَمَّا اسْتُخْلِفَ كَتَبَ لَهُ، وَكَانَ نَقْشُ الْخَاتَمِ ثَلاَثَةَ أَسْطُرٍ‏.‏ مُحَمَّدٌ سَطْرٌ، وَرَسُولُ سَطْرٌ، وَاللَّهِ سَطْرٌ‏.‏"
      },
      {
        "id": 5629,
        "hadith_number": "5879",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cincin Nabi (ﷺ) dan Kehilangannya di Telaga Aris",
        "perawi_melayu": "Anas berkata:",
        "english_text": "The ring of the Prophet (ﷺ) was in his hand, and after him, in Abu Bakr's hand, and then in `Umar's hand after Abu Bakr. When `Uthman was the Caliph, once he was sitting at the well of Aris. He removed the ring from his hand and while he was trifling with it, dropped into the well. We kept on going to the well with `Uthman for three days looking for the ring, and finally the well was drained, but the ring was not found.",
        "malay_translation": "Cincin Rasulullah (ﷺ) berada di tangannya, dan selepasnya, di tangan Abu Bakr, kemudian di tangan `Umar selepas Abu Bakr. Ketika `Uthman menjadi Khalifah, suatu ketika dia sedang duduk di telaga Aris. Dia menanggalkan cincin dari tangannya dan semasa dia bermain-main dengannya, cincin itu terjatuh ke dalam telaga. Kami terus pergi ke telaga bersama `Uthman selama tiga hari mencari cincin itu, dan akhirnya telaga itu dikeringkan, tetapi cincin itu tidak dijumpai.",
        "arabic_text": "وَزَادَنِي أَحْمَدُ حَدَّثَنَا الأَنْصَارِيُّ، قَالَ حَدَّثَنِي أَبِي، عَنْ ثُمَامَةَ، عَنْ أَنَسٍ، قَالَ كَانَ خَاتَمُ النَّبِيِّ صلى الله عليه وسلم فِي يَدِهِ، وَفِي يَدِ أَبِي بَكْرٍ بَعْدَهُ، وَفِي يَدِ عُمَرَ بَعْدَ أَبِي بَكْرٍ، فَلَمَّا كَانَ عُثْمَانُ جَلَسَ عَلَى بِئْرِ أَرِيسَ ـ قَالَ ـ فَأَخْرَجَ الْخَاتَمَ، فَجَعَلَ يَعْبَثُ بِهِ فَسَقَطَ قَالَ فَاخْتَلَفْنَا ثَلاَثَةَ أَيَّامٍ مَعَ عُثْمَانَ فَنَنْزَحُ الْبِئْرَ فَلَمْ نَجِدْهُ‏.‏"
      },
      {
        "id": 5630,
        "hadith_number": "5880",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Aidilfitri dan Sedekah Wanita",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Abbas رضی اللہ عنہما :",
        "english_text": "I offered the `Id prayer with the Prophet (ﷺ) and he offered prayer before the Khutba (sermon). Ibn Wahb added: After the prayer the Prophet (ﷺ) came towards (the rows of) the women and ordered them to give alms, and the women started putting their big and small rings in the garment of Bilal رضی اللہ عنہ.",
        "malay_translation": "Saya menunaikan solat `Id bersama Nabi (ﷺ) dan baginda menunaikan solat sebelum Khutbah (khutbah). Ibn Wahb menambah: Selepas solat, Nabi (ﷺ) datang menghadap (barisan) wanita dan memerintahkan mereka untuk bersedekah, dan wanita mula memasukkan cincin besar dan kecil mereka ke dalam pakaian Bilal رضی اللہ عنہ.",
        "arabic_text": "حَدَّثَنَا أَبُو عَاصِمٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنَا الْحَسَنُ بْنُ مُسْلِمٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ شَهِدْتُ الْعِيدَ مَعَ النَّبِيِّ صلى الله عليه وسلم فَصَلَّى قَبْلَ الْخُطْبَةِ‏.‏ وَزَادَ ابْنُ وَهْبٍ عَنِ ابْنِ جُرَيْجٍ فَأَتَى النِّسَاءَ فَجَعَلْنَ يُلْقِينَ الْفَتَخَ وَالْخَوَاتِيمَ فِي ثَوْبِ بِلاَلٍ‏.‏"
      },
      {
        "id": 5631,
        "hadith_number": "5881",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi ﷺ Menunaikan Solat Sunat Aidilfitri dan Sedekah Wanita",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Abbas رضي الله عنهما:",
        "english_text": "The Prophet (ﷺ) came out on the day of `Id and offered a two-rak`at prayer, and he did not pray any rak`a before it, nor after it. Then he went towards the women and ordered them to give alms. The women started donating their earring and necklaces.",
        "malay_translation": "Nabi ﷺ keluar pada hari `Id dan menunaikan solat dua rakaat. Baginda tidak menunaikan sebarang rakaat sebelum atau selepasnya. Kemudian, baginda pergi kepada kaum wanita dan memerintahkan mereka untuk bersedekah. Kaum wanita mula menderma anting-anting dan rantai mereka.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ عِيدٍ فَصَلَّى رَكْعَتَيْنِ، لَمْ يُصَلِّ قَبْلُ وَلاَ بَعْدُ، ثُمَّ أَتَى النِّسَاءَ فَأَمَرَهُنَّ بِالصَّدَقَةِ، فَجَعَلَتِ الْمَرْأَةُ تَصَدَّقُ بِخُرْصِهَا وَسِخَابِهَا‏.‏"
      },
      {
        "id": 5632,
        "hadith_number": "5882",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kehilangan Rantai Asma' dan Ayat Tayammum",
        "perawi_melayu": "Diriwayatkan oleh 'Aisha رضی اللہ عنہا",
        "english_text": "A necklace belonging to Asma' رضی اللہ عنہا was lost, and the Prophet (ﷺ) sent men in its search. The time for the prayer became due and they were without ablution and they could not find water; therefore they prayed without ablution, They mentioned that to the Prophet (ﷺ) . Then Allah revealed the Verse of Tayammum. (`Aisha رضی اللہ عنہا added: that she had borrowed (the necklace) from Asma').",
        "malay_translation": "Satu rantai kepunyaan Asma' رضی اللہ عنہا telah hilang, dan Nabi (ﷺ) mengutus orang untuk mencarinya. Waktu solat telah tiba dan mereka tidak berwudhuk dan tidak menjumpai air; oleh itu mereka solat tanpa wudhuk. Mereka menceritakan hal itu kepada Nabi (ﷺ). Kemudian Allah menurunkan Ayat Tayammum. ('Aisha رضی اللہ عنہا menambah: bahawa dia meminjam (rantai) itu daripada Asma').",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا عَبْدَةُ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ هَلَكَتْ قِلاَدَةٌ لأَسْمَاءَ، فَبَعَثَ النَّبِيُّ صلى الله عليه وسلم فِي طَلَبِهَا رِجَالاً، فَحَضَرَتِ الصَّلاَةُ وَلَيْسُوا عَلَى وُضُوءٍ وَلَمْ يَجِدُوا مَاءً، فَصَلَّوْا وَهُمْ عَلَى غَيْرِ وُضُوءٍ، فَذَكَرُوا ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَأَنْزَلَ اللَّهُ آيَةَ التَّيَمُّمِ‏.‏ زَادَ ابْنُ نُمَيْرٍ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ اسْتَعَارَتْ مِنْ أَسْمَاءَ‏.‏"
      },
      {
        "id": 5633,
        "hadith_number": "5883",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Dua Rakaat pada Hari Raya dan Zakat Wanita",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Abbas رضی اللہ عنہما :",
        "english_text": "\"The Prophet (ﷺ) offered a two-rak`at prayer on `Id day and he did not offer any (Nawafil prayer) before or after it. He then went towards the women, and Bilal رضی اللہ عنہ was accompanying him, and ordered them to give alms. And so the women started giving their earrings (etc .).",
        "malay_translation": "Rasulullah (ﷺ) menunaikan solat dua rakaat pada hari 'Id dan baginda tidak menunaikan sebarang solat sunat sebelum atau selepasnya. Kemudian baginda pergi ke arah kaum wanita, dan Bilal رضی اللہ عنہ mengiringi baginda, dan baginda memerintahkan mereka untuk memberi sedekah. Maka kaum wanita mula memberikan subang (dan sebagainya).",
        "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَدِيٌّ، قَالَ سَمِعْتُ سَعِيدًا، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى يَوْمَ الْعِيدِ رَكْعَتَيْنِ، لَمْ يُصَلِّ قَبْلَهَا وَلاَ بَعْدَهَا ثُمَّ أَتَى النِّسَاءَ وَمَعَهُ بِلاَلٌ فَأَمَرَهُنَّ بِالصَّدَقَةِ، فَجَعَلَتِ الْمَرْأَةُ تُلْقِي قُرْطَهَا‏.‏"
      },
      {
        "id": 5634,
        "hadith_number": "5884",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kecintaan Nabi ﷺ kepada Hasan bin Ali رضي الله عنه",
        "perawi_melayu": "Diriwayatkan oleh Abu Huraira رضي الله عنه:",
        "english_text": "I was with Allah's Messenger (ﷺ) in one of the Markets of Medina. He left (the market) and so did I. Then he asked thrice, \"Where is the small (child)?\" Then he said, \"Call Al-Hasan bin `Ali.\" So Al-Hasan bin `Ali رضی اللہ عنہما got up and started walking with a necklace (of beads) around his neck. The Prophet (ﷺ) stretched his hand out like this, and Al-Hasan رضی اللہ عنہ did the same. The Prophet (ﷺ) embraced him and said, \"0 Allah! l love him, so please love him and love those who love him.\" Since Allah's Messenger (ﷺ) said that. nothing has been dearer to me than Al-Hasan رضی اللہ عنہما .",
        "malay_translation": "Aku bersama Rasulullah ﷺ di salah satu Pasar Madinah. Baginda beredar (dari pasar) dan aku pun beredar. Kemudian baginda bertanya tiga kali, \"Di manakah anak kecil itu?\" Kemudian baginda bersabda, \"Panggillah Al-Hasan bin `Ali.\" Maka Al-Hasan bin `Ali رضي الله عنه pun bangun dan berjalan dengan kalung (manik-manik) di lehernya. Nabi ﷺ menghulurkan tangannya seperti ini, dan Al-Hasan رضي الله عنه melakukan yang sama. Nabi ﷺ memeluknya dan bersabda, \"Ya Allah! Aku mencintainya, maka cintailah dia dan cintailah orang yang mencintainya.\" Sejak Rasulullah ﷺ bersabda demikian, tiada yang lebih aku cintai daripada Al-Hasan رضي الله عنه.",
        "arabic_text": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا وَرْقَاءُ بْنُ عُمَرَ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ، عَنْ نَافِعِ بْنِ جُبَيْرٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ كُنْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي سُوقٍ مِنْ أَسْوَاقِ الْمَدِينَةِ فَانْصَرَفَ فَانْصَرَفْتُ فَقَالَ ‏\"‏ أَيْنَ لُكَعُ ـ ثَلاَثًا ـ ادْعُ الْحَسَنَ بْنَ عَلِيٍّ ‏\"‏‏.‏ فَقَامَ الْحَسَنُ بْنُ عَلِيٍّ يَمْشِي وَفِي عُنُقِهِ السِّخَابُ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم بِيَدِهِ هَكَذَا، فَقَالَ الْحَسَنُ بِيَدِهِ، هَكَذَا فَالْتَزَمَهُ فَقَالَ ‏\"‏ اللَّهُمَّ إِنِّي أُحِبُّهُ، فَأَحِبَّهُ، وَأَحِبَّ مَنْ يُحِبُّهُ ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ فَمَا كَانَ أَحَدٌ أَحَبَّ إِلَىَّ مِنَ الْحَسَنِ بْنِ عَلِيٍّ بَعْدَ مَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَا قَالَ‏.‏"
      },
      {
        "id": 5635,
        "hadith_number": "5885",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah ﷺ Melaknat Lelaki dan Wanita yang Meniru Jantina Berlawanan",
        "perawi_melayu": "Diriwayatkan oleh Ibnu Abbas رضي الله عنهما:",
        "english_text": "Allah's Messenger (ﷺ) cursed those men who are in the similitude (assume the manners) of women and those women who are in the similitude (assume the manners) of men. Amr (bin Marzooq) has reported that Shuba has apprised us.",
        "malay_translation": "Rasulullah ﷺ melaknat lelaki yang menyerupai (mengambil tingkah laku) wanita, dan wanita yang menyerupai (mengambil tingkah laku) lelaki. Amr (bin Marzooq) meriwayatkan bahawa Syu'bah telah memberitahu kami.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمُتَشَبِّهِينَ مِنَ الرِّجَالِ بِالنِّسَاءِ، وَالْمُتَشَبِّهَاتِ مِنَ النِّسَاءِ بِالرِّجَالِ‏.‏ تَابَعَهُ عَمْرٌو أَخْبَرَنَا شُعْبَةُ‏.‏"
      },
      {
        "id": 5636,
        "hadith_number": "5886",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Nabi ﷺ Terhadap Lelaki Kewanitaan dan Wanita Kelelakian",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Abbas رضي الله عنهما :",
        "english_text": "The Prophet (ﷺ) cursed effeminate men (those men who are in the similitude (assume the manners of women) and those women who assume the manners of men, and he said, \"Turn them out of your houses .\" The Prophet (ﷺ) turned out such-and-such man, and `Umar رضی اللہ عنہ turned out such-and-such woman.",
        "malay_translation": "Nabi ﷺ melaknat lelaki kewanitaan (lelaki yang menyerupai wanita) dan wanita kelelakian, dan baginda bersabda, \"Usirlah mereka dari rumah-rumah kamu.\" Nabi ﷺ mengusir lelaki tersebut, dan `Umar رضي الله عنه turut mengusir wanita tersebut.",
        "arabic_text": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَعَنَ النَّبِيُّ صلى الله عليه وسلم الْمُخَنَّثِينَ مِنَ الرِّجَالِ، وَالْمُتَرَجِّلاَتِ مِنَ النِّسَاءِ وَقَالَ ‏ \"‏ أَخْرِجُوهُمْ مِنْ بُيُوتِكُمْ ‏\"‏‏.‏ قَالَ فَأَخْرَجَ النَّبِيُّ صلى الله عليه وسلم فُلاَنًا، وَأَخْرَجَ عُمَرُ فُلاَنًا‏.‏"
      },
      {
        "id": 5637,
        "hadith_number": "5887",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Rasulullah SAW Terhadap Lelaki Lemah Lembut dan Komen Imam Bukhari",
        "perawi_melayu": "Diriwayatkan daripada Ummu Salamah رضي اللہ عنہ :",
        "english_text": "Once the Prophet (ﷺ) was in her house, and an effeminate man was there too. The effeminate man said to `Abdullah رضی اللہ عنہ , (Um Salama's brother) \"0 `Abdullah! If Ta'if should be conquered tomorrow, I recommend you the daughter of Ghailan, for she is so fat that she has four curves in the front (of her belly) and eight at the back.\" So the Prophet (ﷺ) said (to his wives) \"These effeminate (men) should not enter upon you (your houses). Imam Bukhari says: ''Tudbirru Bi Thamanin: mean the edges of those folds which cover the both sides until they meet. That's why it is said: ''Thaman'' not ''Thamaniyah'' and the singular of ''Atraaf'' is masculine that's why it is not said: Thamaniya-ta-Atraafin.''",
        "malay_translation": "Pada suatu ketika, Nabi ﷺ berada di rumahnya, dan seorang lelaki yang lemah lembut juga ada di sana. Lelaki yang lemah lembut itu berkata kepada `Abdullah رضی اللہ عنہ , (saudara lelaki Ummu Salamah), \"Wahai `Abdullah! Jika Ta'if ditakluki esok hari, aku mengesyorkan kamu anak perempuan Ghailan, kerana dia sangat gemuk sehingga dia mempunyai empat lekuk di hadapan (perutnya) dan lapan di belakang.\" Maka Nabi ﷺ bersabda (kepada isteri-isterinya), \"Lelaki-lelaki yang lemah lembut ini tidak boleh masuk ke tempat kamu (rumah-rumah kamu).\" Imam Bukhari berkata: ''Tudbirru Bi Thamanin: bermakna tepi-tepi lipatan yang menutupi kedua-dua belah sisi sehingga mereka bertemu. Itulah sebabnya dikatakan: ''Thaman'' bukan ''Thamaniyah'' dan kata tunggal ''Atraaf'' adalah maskulin, itulah sebabnya tidak dikatakan: Thamaniya-ta-Atraafin.'' ",
        "arabic_text": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، أَنَّ عُرْوَةَ، أَخْبَرَهُ أَنَّ زَيْنَبَ ابْنَةَ أَبِي سَلَمَةَ أَخْبَرَتْهُ أَنَّ أُمَّ سَلَمَةَ أَخْبَرَتْهَا أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ عِنْدَهَا وَفِي الْبَيْتِ مُخَنَّثٌ، فَقَالَ لِعَبْدِ اللَّهِ أَخِي أُمِّ سَلَمَةَ يَا عَبْدَ اللَّهِ إِنْ فُتِحَ لَكُمْ غَدًا الطَّائِفُ، فَإِنِّي أَدُلُّكَ عَلَى بِنْتِ غَيْلاَنَ، فَإِنَّهَا تُقْبِلُ بِأَرْبَعٍ وَتُدْبِرُ بِثَمَانٍ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ يَدْخُلَنَّ هَؤُلاَءِ عَلَيْكُنَّ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ تُقْبِلُ بِأَرْبَعٍ وَتُدْبِرُ بِثَمَانٍ يَعْنِي أَرْبَعَ عُكَنِ بَطْنِهَا، فَهْىَ تُقْبِلُ بِهِنَّ، وَقَوْلُهُ وَتُدْبِرُ بِثَمَانٍ‏.‏ يَعْنِي أَطْرَافَ هَذِهِ الْعُكَنِ الأَرْبَعِ، لأَنَّهَا مُحِيطَةٌ بِالْجَنْبَيْنِ حَتَّى لَحِقَتْ وَإِنَّمَا قَالَ بِثَمَانٍ‏.‏ وَلَمْ يَقُلْ بِثَمَانِيَةٍ‏.‏ وَوَاحِدُ الأَطْرَافِ وَهْوَ ذَكَرٌ، لأَنَّهُ لَمْ يَقُلْ ثَمَانِيَةَ أَطْرَافٍ‏.‏"
      },
      {
        "id": 5638,
        "hadith_number": "5888",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Memendekkan Misai adalah Sunnah Fitrah",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Umar رضی اللہ عنہما :",
        "english_text": "The Prophet (ﷺ) said, \"To get the moustaches cut 'short is characteristic of the Fitra.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Memendekkan misai adalah sebahagian daripada fitrah.\"",
        "arabic_text": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، عَنْ حَنْظَلَةَ، عَنْ نَافِعٍ، قَالَ أَصْحَابُنَا عَنِ الْمَكِّيِّ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مِنَ الْفِطْرَةِ قَصُّ الشَّارِبِ ‏\"‏‏.‏"
      },
      {
        "id": 5639,
        "hadith_number": "5889",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Amalan Fitrah",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضي اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) said, \"Five practices are characteristics of the Fitra: circumcision, shaving the pubic region, clipping the nails and cutting the moustaches short.\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Lima perkara adalah ciri-ciri fitrah: berkhatan, mencukur bulu ari-ari, memotong kuku dan memendekkan misai.\"",
        "arabic_text": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، قَالَ الزُّهْرِيُّ حَدَّثَنَا عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، رِوَايَةً ‏ \"‏ الْفِطْرَةُ خَمْسٌ ـ أَوْ خَمْسٌ مِنَ الْفِطْرَةِ ـ الْخِتَانُ، وَالاِسْتِحْدَادُ، وَنَتْفُ الإِبْطِ، وَتَقْلِيمُ الأَظْفَارِ، وَقَصُّ الشَّارِبِ ‏\"‏‏.‏"
      },
      {
        "id": 5640,
        "hadith_number": "5890",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Amalan Fitrah: Mencukur Bulu Kemaluan, Memotong Kuku, dan Merapikan Kumis",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Umar رضی اللہ عنہما :",
        "english_text": "Allah's Messenger (ﷺ) said, \"To shave the pubic hair. to clip the nails and to cut the moustaches short, are characteristics of the Fitra.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Mencukur bulu kemaluan, memotong kuku, dan merapikan kumis adalah sebahagian daripada ciri-ciri Fitrah.\"",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي رَجَاءٍ، حَدَّثَنَا إِسْحَاقُ بْنُ سُلَيْمَانَ، قَالَ سَمِعْتُ حَنْظَلَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مِنَ الْفِطْرَةِ حَلْقُ الْعَانَةِ، وَتَقْلِيمُ الأَظْفَارِ، وَقَصُّ الشَّارِبِ ‏\"‏‏.‏"
      },
      {
        "id": 5641,
        "hadith_number": "5891",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Lima Amalan Fitrah",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ عنہ :",
        "english_text": "I heard the Prophet (ﷺ) saying. \"Five practices are characteristics of the Fitra: circumcision, shaving the pubic hair, cutting the moustaches short, clipping the nails, and depilating the hair of the armpits.\"",
        "malay_translation": "Saya mendengar Nabi (ﷺ) bersabda: \"Lima amalan adalah ciri-ciri fitrah: berkhatan, mencukur bulu ari-ari, memendekkan misai, memotong kuku, dan mencabut bulu ketiak.\"",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ الْفِطْرَةُ خَمْسٌ الْخِتَانُ، وَالاِسْتِحْدَادُ، وَقَصُّ الشَّارِبِ، وَتَقْلِيمُ الأَظْفَارِ، وَنَتْفُ الآبَاطِ ‏\"‏‏.‏"
      },
      {
        "id": 5642,
        "hadith_number": "5892",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Sunnah Nabi (ﷺ) tentang Janggut dan Misai",
        "perawi_melayu": "Diriwayatkan oleh Ibnu Umar رضي الله عنهما :",
        "english_text": "The Prophet (ﷺ) said, 'Do the opposite of what the pagans do. Keep the beards and cut the moustaches short.' Whenever Ibn `Umar رضی اللہ عنہما performed the Hajj or `Umra, he used to hold his beard with his hand and cut whatever remained outside his hold.",
        "malay_translation": "Nabi (ﷺ) bersabda, 'Lakukanlah yang berlawanan dengan apa yang dilakukan oleh orang-orang kafir. Panjangkan janggut dan pendekkan misai.' Apabila Ibnu `Umar رضي الله عنهما mengerjakan haji atau `Umrah, beliau memegang janggutnya dengan tangan dan memotong apa sahaja yang melebihi genggamannya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مِنْهَالٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا عُمَرُ بْنُ مُحَمَّدِ بْنِ زَيْدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ خَالِفُوا الْمُشْرِكِينَ، وَفِّرُوا اللِّحَى، وَأَحْفُوا الشَّوَارِبَ ‏\"‏‏.‏ وَكَانَ ابْنُ عُمَرَ إِذَا حَجَّ أَوِ اعْتَمَرَ قَبَضَ عَلَى لِحْيَتِهِ، فَمَا فَضَلَ أَخَذَهُ‏.‏"
      },
      {
        "id": 5643,
        "hadith_number": "5893",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Memendekkan Misai dan Memelihara Janggut",
        "perawi_melayu": "Diriwayatkan oleh Ibnu `Umar رضی اللہ عنہما :",
        "english_text": "Allah's Messenger (ﷺ) said, \"Cut the moustaches short and leave the beard (as it is).\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Pendekkan misai dan biarkan janggut (seperti adanya).\"",
        "arabic_text": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا عَبْدَةُ، أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ انْهَكُوا الشَّوَارِبَ، وَأَعْفُوا اللِّحَى ‏\"‏‏.‏"
      },
      {
        "id": 5644,
        "hadith_number": "5894",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi ﷺ dan Rambut Beruban",
        "perawi_melayu": "Diriwayatkan oleh Muhammad bin Seereen:",
        "english_text": "I asked Anas رضی اللہ عنہ , \"Did the Prophet (ﷺ) dye his hair?\" Anas replied, \"The Prophet (ﷺ) did not have except a few grey hairs.\"",
        "malay_translation": "Saya bertanya kepada Anas رضي الله عنه, \"Adakah Nabi ﷺ mewarnai rambutnya?\" Anas menjawab, \"Nabi ﷺ tidak mempunyai kecuali beberapa helai rambut beruban.\"",
        "arabic_text": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا وُهَيْبٌ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، قَالَ سَأَلْتُ أَنَسًا أَخَضَبَ النَّبِيُّ صلى الله عليه وسلم قَالَ لَمْ يَبْلُغِ الشَّيْبَ إِلاَّ قَلِيلاً‏.‏"
      },
      {
        "id": 5645,
        "hadith_number": "5895",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi SAW Tidak Menggunakan Pewarna Rambut",
        "perawi_melayu": "Diriwayatkan oleh Thabit:",
        "english_text": "Anas رضی اللہ عنہ was asked whether the Prophet (ﷺ) used a a hair dye or not. He replied, \"The Prophet (ﷺ) did not have enough grey hair to dye, (such that) if I wanted to count the fading hairs in his beard (I could have).\"",
        "malay_translation": "Anas رضي الله عنه ditanya sama ada Nabi ﷺ menggunakan pewarna rambut atau tidak. Beliau menjawab, \"Nabi ﷺ tidak mempunyai uban yang cukup untuk diwarnakan, (sehingga) jika aku ingin mengira rambut yang memudar dalam janggutnya (aku boleh melakukannya).\"",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، قَالَ سُئِلَ أَنَسٌ عَنْ خِضَابِ النَّبِيِّ، صلى الله عليه وسلم فَقَالَ إِنَّهُ لَمْ يَبْلُغْ مَا يَخْضِبُ، لَوْ شِئْتُ أَنْ أَعُدَّ شَمَطَاتِهِ فِي لِحْيَتِهِ‏.‏"
      },
      {
        "id": 5646,
        "hadith_number": "5896",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Air Dari Ummu Salamah untuk Penyembuhan",
        "perawi_melayu": "Diriwayatkan daripada Uthman bin Abdullah bin Mauhab",
        "english_text": "\"My people sent me with a bowl of water to Um Salama رضی اللہ عنہا .\" Isra'il approximated three fingers ('indicating the small size of the container in which there was some hair of the Prophet. `Uthman added, \"If any person suffered from evil eye or some other disease, he would send a vessel (containing water) to Um Salama رضی اللہ عنہا . I looked into the container (that held the hair of the Prophet) and saw a few red hairs in it,\"",
        "malay_translation": "\"Kaumku mengirimkan aku dengan semangkuk air kepada Ummu Salamah رضی اللہ عنہا.\" Isra'il menganggarkan tiga jari ('menunjukkan saiz kecil bekas yang berisi beberapa helai rambut Nabi. `Uthman menambah, \"Jika sesiapa menderita penyakit mata jahat atau penyakit lain, dia akan mengirimkan bekas (berisi air) kepada Ummu Salamah رضی اللہ عنہا. Aku melihat ke dalam bekas (yang berisi rambut Nabi) dan melihat beberapa helai rambut berwarna merah di dalamnya,\"",
        "arabic_text": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ، قَالَ أَرْسَلَنِي أَهْلِي إِلَى أُمِّ سَلَمَةَ بِقَدَحٍ مِنْ مَاءٍ ـ وَقَبَضَ إِسْرَائِيلُ ثَلاَثَ أَصَابِعَ ـ مِنْ فِضَّةٍ فِيهِ شَعَرٌ مِنْ شَعَرِ النَّبِيِّ صلى الله عليه وسلم وَكَانَ إِذَا أَصَابَ الإِنْسَانَ عَيْنٌ أَوْ شَىْءٌ بَعَثَ إِلَيْهَا مِخْضَبَهُ، فَاطَّلَعْتُ فِي الْجُلْجُلِ فَرَأَيْتُ شَعَرَاتٍ حُمْرًا‏.‏"
      },
      {
        "id": 5647,
        "hadith_number": "5897",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rambut Nabi yang Telah Diwarnai (Dari Ummu Salamah)",
        "perawi_melayu": "Diriwayatkan oleh Uthman bin Abdullah bin Mauhab:",
        "english_text": "I went to Um Salama رضی اللہ عنہا and she brought out for us some of the dyed hair of the Prophet.",
        "malay_translation": "Saya pergi kepada Ummu Salamah رضی اللہ عنہا dan beliau mengeluarkan untuk kami sebahagian daripada rambut Nabi yang telah diwarnai.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا سَلاَّمٌ، عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ، قَالَ دَخَلْتُ عَلَى أُمِّ سَلَمَةَ فَأَخْرَجَتْ إِلَيْنَا شَعَرًا مِنْ شَعَرِ النَّبِيِّ صلى الله عليه وسلم مَخْضُوبًا‏.‏"
      },
      {
        "id": 5648,
        "hadith_number": "5898",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rambut Merah Nabi SAW",
        "perawi_melayu": "Diriwayatkan oleh Ibnu Mauhab:",
        "english_text": "Um Salama رضی اللہ عنہا had shown him the red hair of the Prophet.",
        "malay_translation": "Ummu Salamah رضي الله عنها telah menunjukkan kepadanya rambut merah Nabi ﷺ.",
        "arabic_text": "وَقَالَ لَنَا أَبُو نُعَيْمٍ حَدَّثَنَا نُصَيْرُ بْنُ أَبِي الأَشْعَثِ، عَنِ ابْنِ مَوْهَبٍ، أَنَّ أُمَّ سَلَمَةَ، أَرَتْهُ شَعَرَ النَّبِيِّ صلى الله عليه وسلم أَحْمَرَ‏.‏"
      },
      {
        "id": 5649,
        "hadith_number": "5899",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perbezaan dengan Yahudi dan Nasrani dalam Mewarnai Rambut",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) said, \"Jews and Christians do not dye their hair so you should do the opposite of what they do.",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Orang Yahudi dan Nasrani tidak mewarnai rambut mereka, maka hendaklah kamu melakukan yang sebaliknya daripada apa yang mereka lakukan.\"",
        "arabic_text": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الزُّهْرِيُّ، عَنْ أَبِي سَلَمَةَ، وَسُلَيْمَانَ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّ الْيَهُودَ وَالنَّصَارَى لاَ يَصْبُغُونَ فَخَالِفُوهُمْ ‏\"‏‏.‏"
      },
      {
        "id": 5650,
        "hadith_number": "5900",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Sifat Fizikal Nabi Muhammad (ﷺ)",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik رضي الله عنه :",
        "english_text": "The Prophet (ﷺ) was neither conspicuously tall, nor short; neither, very white, nor tawny. His hair was neither much curled, nor very straight. Allah sent him (as an Apostle) at the age of forty (and after that) he stayed for ten years in Mecca, and for ten more years in Medina. Allah took him unto Him at the age of sixty, and he scarcely had twenty white hairs on his head and in his beard.",
        "malay_translation": "Nabi (ﷺ) tidaklah terlalu tinggi, mahupun pendek; tidaklah terlalu putih, mahupun sawo matang. Rambut baginda tidaklah terlalu kerinting, mahupun terlalu lurus. Allah mengutus baginda (sebagai Rasul) pada usia empat puluh tahun (dan selepas itu) baginda tinggal selama sepuluh tahun di Mekah, dan sepuluh tahun lagi di Madinah. Allah mengambil baginda kepada-Nya pada usia enam puluh tahun, dan baginda hampir tidak mempunyai dua puluh helai rambut putih di kepala dan janggut baginda.",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكُ بْنُ أَنَسٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّهُ سَمِعَهُ يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيْسَ بِالطَّوِيلِ الْبَائِنِ، وَلاَ بِالْقَصِيرِ، وَلَيْسَ بِالأَبْيَضِ الأَمْهَقِ، وَلَيْسَ بِالآدَمِ، وَلَيْسَ بِالْجَعْدِ الْقَطَطِ، وَلاَ بِالسَّبْطِ، بَعَثَهُ اللَّهُ عَلَى رَأْسِ أَرْبَعِينَ سَنَةً، فَأَقَامَ بِمَكَّةَ عَشْرَ سِنِينَ، وَبِالْمَدِينَةِ عَشْرَ سِنِينَ، وَتَوَفَّاهُ اللَّهُ عَلَى رَأْسِ سِتِّينَ سَنَةً، وَلَيْسَ فِي رَأْسِهِ وَلِحْيَتِهِ عِشْرُونَ شَعَرَةً بَيْضَاءَ‏.‏"
      },
      {
        "id": 5651,
        "hadith_number": "5901",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kecantikan Nabi Muhammad SAW dan Perihal Rambut Baginda",
        "perawi_melayu": "Al-Bara' رضی اللہ عنہ meriwayatkan:",
        "english_text": "I did not see anybody in a red cloak looking more handsome than the Prophet. Narrated Malik: The hair of the Prophet (ﷺ) used to hang near his shoulders. Abu Ishaq said, \"I heard him relate it more than once. He always laughed when he related it.\" Narrated Shu`ba: The hair of the Prophet (ﷺ) used to hang down to the earlobes.",
        "malay_translation": "Saya tidak pernah melihat sesiapa pun yang memakai jubah merah lebih tampan daripada Nabi. Diriwayatkan oleh Malik: Rambut Nabi (ﷺ) selalu mencecah hampir ke bahu baginda. Abu Ishaq berkata, \"Saya mendengar beliau menceritakannya lebih daripada sekali. Beliau sentiasa ketawa apabila menceritakannya.\" Diriwayatkan oleh Shu`ba: Rambut Nabi (ﷺ) selalu mencecah hingga ke cuping telinga.",
        "arabic_text": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، سَمِعْتُ الْبَرَاءَ، يَقُولُ مَا رَأَيْتُ أَحَدًا أَحْسَنَ فِي حُلَّةٍ حَمْرَاءَ مِنَ النَّبِيِّ صلى الله عليه وسلم‏.‏ قَالَ بَعْضُ أَصْحَابِي عَنْ مَالِكٍ إِنَّ جُمَّتَهُ لَتَضْرِبُ قَرِيبًا مِنْ مَنْكِبَيْهِ‏.‏ قَالَ أَبُو إِسْحَاقَ سَمِعْتُهُ يُحَدِّثُهُ غَيْرَ مَرَّةٍ، مَا حَدَّثَ بِهِ قَطُّ إِلاَّ ضَحِكَ‏.‏ تَابَعَهُ شُعْبَةُ شَعَرُهُ يَبْلُغُ شَحْمَةَ أُذُنَيْهِ‏.‏"
      },
      {
        "id": 5652,
        "hadith_number": "5902",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Mimpi Rasulullah ﷺ tentang Nabi Isa dan Dajjal",
        "perawi_melayu": "Diriwayatkan oleh Abdullah bin Umar رضی اللہ عنہما :",
        "english_text": "Allah's Messenger (ﷺ) said, \"Today I saw myself in a dream near the Ka`ba. I saw a whitish brown man, the handsomest of all brown men you might ever see. He had the most beautiful Limma (hair hanging down to the earlobes) you might ever see. He had combed it and it was dripping water; and he was performing the Tawaf around the Ka`ba leaning on two men or on the shoulders of two men. l asked, \"Who is this?\" It was said. \"Messiah, the son of Mary.\" Suddenly I saw a curly-haired man, blind in the right eye which looked like a protruding out grape. I asked, \"Who is this?\" It was said, \"He is Masiah Ad-Dajjal.\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Hari ini aku bermimpi melihat diriku dekat Ka`bah. Aku melihat seorang lelaki berwarna perang keputihan, yang paling tampan di antara semua lelaki perang yang pernah kamu lihat. Dia mempunyai Limma (rambut yang menjuntai ke cuping telinga) yang paling indah yang mungkin pernah kamu lihat. Rambutnya telah disisir dan menitiskan air; dan dia sedang melakukan Tawaf mengelilingi Ka`bah bersandar pada dua orang lelaki atau di bahu dua orang lelaki. Aku bertanya, \"Siapakah ini?\" Dijawab, \"Dia adalah Al-Masih, putera Maryam.\" Tiba-tiba aku melihat seorang lelaki berambut keriting, buta sebelah mata kanan yang kelihatan seperti buah anggur yang terkeluar. Aku bertanya, \"Siapakah ini?\" Dijawab, \"Dia adalah Masih Ad-Dajjal.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ أُرَانِي اللَّيْلَةَ عِنْدَ الْكَعْبَةِ، فَرَأَيْتُ رَجُلاً آدَمَ كَأَحْسَنِ مَا أَنْتَ رَاءٍ مِنْ أُدْمِ الرِّجَالِ، لَهُ لِمَّةٌ كَأَحْسَنِ مَا أَنْتَ رَاءٍ مِنَ اللِّمَمِ، قَدْ رَجَّلَهَا، فَهْىَ تَقْطُرُ مَاءً مُتَّكِئًا عَلَى رَجُلَيْنِ، أَوْ عَلَى عَوَاتِقِ رَجُلَيْنِ، يَطُوفُ بِالْبَيْتِ فَسَأَلْتُ مَنْ هَذَا فَقِيلَ الْمَسِيحُ ابْنُ مَرْيَمَ‏.‏ وَإِذَا أَنَا بِرَجُلٍ جَعْدٍ، قَطَطٍ، أَعْوَرِ الْعَيْنِ الْيُمْنَى كَأَنَّهَا عِنَبَةٌ طَافِيَةٌ، فَسَأَلْتُ مَنْ هَذَا فَقِيلَ الْمَسِيحُ الدَّجَّالُ ‏\"‏‏.‏"
      },
      {
        "id": 5653,
        "hadith_number": "5903",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rambut Nabi ﷺ Hingga ke Bahu",
        "perawi_melayu": "Diriwayatkan daripada Anas رضي الله عنه :",
        "english_text": "The hair of the Prophet (ﷺ) used to hang down up to his shoulders.",
        "malay_translation": "Rambut Nabi ﷺ pernah mencecah sehingga ke bahu baginda.",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا حَبَّانُ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، حَدَّثَنَا أَنَسٌ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَضْرِبُ شَعَرُهُ مَنْكِبَيْهِ‏.‏"
      },
      {
        "id": 5654,
        "hadith_number": "5904",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rambut Nabi ﷺ Sampai ke Bahu",
        "perawi_melayu": "Diriwayatkan oleh Anas رضي الله عنه :",
        "english_text": "The head-hair of the Prophet (ﷺ) used to hang down to his shoulders.",
        "malay_translation": "Rambut kepala Nabi ﷺ dahulu sampai ke bahu Baginda.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، كَانَ يَضْرِبُ شَعَرُ النَّبِيِّ صلى الله عليه وسلم مَنْكِبَيْهِ‏.‏"
      },
      {
        "id": 5655,
        "hadith_number": "5905",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rambut Rasulullah ﷺ",
        "perawi_melayu": "Diriwayatkan oleh Qatada",
        "english_text": "l asked Anas bin Malik رضی اللہ عنہ about the hair of Allah's Messenger (ﷺ). He said, \"The hair of Allah's Messenger (ﷺ) was neither much straight, nor much curly, and it used to hang down till between his shoulders and his earlobes.",
        "malay_translation": "Saya bertanya kepada Anas bin Malik رضي الله عنه tentang rambut Rasulullah ﷺ. Beliau berkata, \"Rambut Rasulullah ﷺ tidaklah lurus sangat, tidak pula kerinting sangat, dan ianya tergantung sehingga di antara bahu dan cuping telinga baginda.",
        "arabic_text": "حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ عَنْ شَعَرِ، رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ كَانَ شَعَرُ رَسُولِ اللَّهِ صلى الله عليه وسلم رَجِلاً، لَيْسَ بِالسَّبِطِ، وَلاَ الْجَعْدِ، بَيْنَ أُذُنَيْهِ وَعَاتِقِهِ‏.‏"
      },
      {
        "id": 5656,
        "hadith_number": "5906",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Sifat Fizikal Nabi Muhammad (ﷺ)",
        "perawi_melayu": "Diriwayatkan oleh Anas رضي الله عنه :",
        "english_text": "The Prophet (ﷺ) had big hands, and I have never seen anybody like him after him. The hair of the Prophet was wavy, neither curly nor straight.",
        "malay_translation": "Nabi (ﷺ) mempunyai tangan yang besar, dan aku tidak pernah melihat sesiapa pun seperti baginda selepasnya. Rambut Nabi adalah beralun, tidak kerinting mahupun lurus.",
        "arabic_text": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا جَرِيرٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم ضَخْمَ الْيَدَيْنِ، لَمْ أَرَ بَعْدَهُ مِثْلَهُ، وَكَانَ شَعَرُ النَّبِيِّ صلى الله عليه وسلم رَجِلاً، لاَ جَعْدَ، وَلاَ سَبِطَ‏.‏"
      },
      {
        "id": 5657,
        "hadith_number": "5907",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Sifat Fizikal Nabi Muhammad SAW",
        "perawi_melayu": "Diriwayatkan oleh Anas رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) had big hands and feet, and I have not seen anybody like him, neither before nor after him, and his palms were soft.",
        "malay_translation": "Nabi (ﷺ) mempunyai tangan dan kaki yang besar, dan aku tidak pernah melihat sesiapa pun seperti baginda, sama ada sebelum atau selepasnya, dan tapak tangan baginda lembut.",
        "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم ضَخْمَ الْيَدَيْنِ وَالْقَدَمَيْنِ حَسَنَ الْوَجْهِ، لَمْ أَرَ بَعْدَهُ وَلاَ قَبْلَهُ مِثْلَهُ، وَكَانَ بَسِطَ الْكَفَّيْنِ‏.‏"
      },
      {
        "id": 5658,
        "hadith_number": "5908, 5909",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keterangan Sifat Nabi Muhammad SAW",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) had big feet and a good-looking face and l have not seen anybody like him after him.",
        "malay_translation": "Nabi SAW mempunyai kaki yang besar dan wajah yang tampan. Aku tidak pernah melihat sesiapa pun seperti baginda selepasnya.",
        "arabic_text": "حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا مُعَاذُ بْنُ هَانِئٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسِ بْنِ مَالِكٍ،‏.‏ أَوْ عَنْ رَجُلٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم ضَخْمَ الْقَدَمَيْنِ، حَسَنَ الْوَجْهِ، لَمْ أَرَ بَعْدَهُ مِثْلَهُ‏."
      },
      {
        "id": 5659,
        "hadith_number": "5910",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ciri-ciri Fizikal Nabi Muhammad (ﷺ)",
        "perawi_melayu": "Diriwayatkan oleh Anas رضي الله عنه :",
        "english_text": "The Prophet (ﷺ) had big feet and hands.",
        "malay_translation": "Nabi (ﷺ) mempunyai kaki dan tangan yang besar.",
        "arabic_text": "وَقَالَ هِشَامٌ عَنْ مَعْمَرٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، كَانَ النَّبِيُّ صلى الله عليه وسلم شَثْنَ الْقَدَمَيْنِ وَالْكَفَّيْنِ‏.‏"
      },
      {
        "id": 5660,
        "hadith_number": "5911, 5912",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keterangan Sifat Nabi Muhammad SAW",
        "perawi_melayu": "Diriwayatkan oleh Anas رضي اللہ عنہ atau Jabir bin `Abdullah رضي اللہ عنہما :",
        "english_text": "The Prophet (ﷺ) had big hands and feet and I have not seen anybody like him after him.",
        "malay_translation": "Nabi ﷺ mempunyai tangan dan kaki yang besar dan aku tidak pernah melihat sesiapa pun seperti baginda selepasnya.",
        "arabic_text": "وَقَالَ أَبُو هِلاَلٍ حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ،‏.‏ أَوْ جَابِرِ بْنِ عَبْدِ اللَّهِ كَانَ النَّبِيُّ صلى الله عليه وسلم ضَخْمَ الْكَفَّيْنِ وَالْقَدَمَيْنِ، لَمْ أَرَ بَعْدَهُ شَبَهًا لَهُ‏.‏"
      },
      {
        "id": 5661,
        "hadith_number": "5913",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perbualan Mengenai Ad-Dajjal dan Rupa Nabi Ibrahim dan Nabi Musa",
        "perawi_melayu": "Diriwayatkan oleh Mujahid:",
        "english_text": "We were with Ibn `Abbas رضی اللہ عنہما and the people mentioned Ad-Dajjal. Someone said, \"The word 'Kafir' (unbeliever) is written in between his (Ad-Dajjal's) eyes.\" Ibn `Abbas رضی اللہ عنہما said, \"I have not heard the Prophet saying this, but he said, 'As regards Abraham, he looks like your companion (i.e. the Prophet, Muhammad), and as regards Moses, he is a brown curly haired man riding a camel and reigned with a strong jute rope, as if I am now looking at him getting down in the valley and saying, \"Labbaik\".'\"",
        "malay_translation": "Kami bersama Ibnu Abbas رضی اللہ عنہما dan orang ramai menyebut tentang Ad-Dajjal. Seseorang berkata, \"Perkataan 'Kafir' (orang yang tidak beriman) tertulis di antara matanya (Ad-Dajjal).\" Ibnu Abbas رضی اللہ عنہما berkata, \"Aku tidak pernah mendengar Nabi SAW bersabda demikian, tetapi baginda bersabda, 'Berkaitan dengan Nabi Ibrahim, rupa beliau seperti sahabat kamu (iaitu Nabi Muhammad SAW), dan berkaitan dengan Nabi Musa, baginda adalah seorang lelaki yang berkulit coklat, berambut kerinting menunggang unta dan mengawal dengan tali guni yang kuat, seolah-olah aku sedang melihat baginda turun di lembah dan berkata, \"Labbaik\".'\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنِي ابْنُ أَبِي عَدِيٍّ، عَنِ ابْنِ عَوْنٍ، عَنْ مُجَاهِدٍ، قَالَ كُنَّا عِنْدَ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ فَذَكَرُوا الدَّجَّالَ فَقَالَ إِنَّهُ مَكْتُوبٌ بَيْنَ عَيْنَيْهِ كَافِرٌ‏.‏ وَقَالَ ابْنُ عَبَّاسٍ لَمْ أَسْمَعْهُ قَالَ ذَاكَ وَلَكِنَّهُ قَالَ ‏ \"‏ أَمَّا إِبْرَاهِيمُ فَانْظُرُوا إِلَى صَاحِبِكُمْ، وَأَمَّا مُوسَى فَرَجُلٌ آدَمُ جَعْدٌ، عَلَى جَمَلٍ أَحْمَرَ مَخْطُومٍ بِخُلْبَةٍ، كَأَنِّي أَنْظُرُ إِلَيْهِ إِذِ انْحَدَرَ فِي الْوَادِي يُلَبِّي ‏\"‏‏.‏"
      },
      {
        "id": 5662,
        "hadith_number": "5914",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukum Mencukur Rambut Selepas Ihram",
        "perawi_melayu": "Diriwayatkan daripada Abdullah bin `Umar رضی اللہ عنہما :",
        "english_text": "I heard `Umar رضی اللہ عنہ saying, \"Whoever braids his hair should shave it (on finishing lhram). You'd better not do, something like Talbid.\" Ibn `Umar رضی اللہ عنہما used to say: \"I saw Allah's Messenger (ﷺ) with his hair stuck together with gum.\"",
        "malay_translation": "Saya mendengar `Umar رضی اللہ عنہ berkata, \"Sesiapa yang mengikat rambutnya hendaklah mencukurnya (selepas selesai ihram). Sebaiknya jangan lakukan, seperti Talbid.\" Ibn `Umar رضی اللہ عنہما pernah berkata: \"Saya melihat Rasulullah (ﷺ) rambutnya melekat antara satu sama lain dengan gam.\"",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ سَمِعْتُ عُمَرَ ـ رضى الله عنه ـ يَقُولُ مَنْ ضَفَّرَ فَلْيَحْلِقْ، وَلاَ تَشَبَّهُوا بِالتَّلْبِيدِ‏.‏ وَكَانَ ابْنُ عُمَرَ يَقُولُ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم مُلَبِّدًا‏.‏"
      },
      {
        "id": 5663,
        "hadith_number": "5915",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Talbiyah Nabi SAW dalam Keadaan Ihram",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Umar رضی اللہ عنہما :",
        "english_text": "I heard Allah's Messenger (ﷺ), while he was in the state of lhram and his hair was stuck together with gum, saying, \"Labbaik, Allahumma Labbaik, Labbaik La Sharika laka Labbaik. Inn-al-Hamda Wan-Ni'mata Laka wal-Mulk, La Sharika Lak.\" He did not add anything to those words.",
        "malay_translation": "Saya mendengar Rasulullah SAW ketika baginda dalam keadaan ihram dan rambut baginda melekat dengan gam, bersabda, \"Labbaik, Allahumma Labbaik, Labbaik La Sharika laka Labbaik. Inn-al-Hamda Wan-Ni'mata Laka wal-Mulk, La Sharika Lak.\" Baginda tidak menambah apa-apa pada kata-kata tersebut.",
        "arabic_text": "حَدَّثَنِي حِبَّانُ بْنُ مُوسَى، وَأَحْمَدُ بْنُ مُحَمَّدٍ، قَالاَ أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُهِلُّ مُلَبِّدًا يَقُولُ ‏ \"‏ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لاَ شَرِيكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ لاَ شَرِيكَ لَكَ ‏\"‏‏.‏ لاَ يَزِيدُ عَلَى هَؤُلاَءِ الْكَلِمَاتِ‏.‏"
      },
      {
        "id": 5664,
        "hadith_number": "5916",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Sebab Nabi SAW Tidak Selesaikan Ihram Selepas Umrah",
        "perawi_melayu": "Diriwayatkan oleh Hafsa (isteri Nabi) رضی اللہ عنہا :",
        "english_text": "I said, \"O Allah's Messenger (ﷺ)! Why have the people finished their Ihram after performing the `Umra while you have not finished your lhram after your `Umra?\" He said, \"I have done Talbid (of my hair) and have decorated my Hadis with garlands, so I shall not finish my lhram till l have slaughtered my Hadi (animal for sacrifice).",
        "malay_translation": "Saya berkata, \"Wahai Rasulullah (ﷺ)! Mengapakah orang ramai telah menyelesaikan Ihram mereka selepas mengerjakan `Umrah sedangkan engkau belum menyelesaikan Ihram engkau selepas `Umrah?\" Baginda bersabda, \"Aku telah melakukan Talbid (rambutku) dan telah menghiasi Hadi-ku dengan kalungan, maka aku tidak akan menyelesaikan Ihramku sehingga aku telah menyembelih Hadi (binatang korban)ku.",
        "arabic_text": "حَدَّثَنِي إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ حَفْصَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ مَا شَأْنُ النَّاسِ حَلُّوا بِعُمْرَةٍ، وَلَمْ تَحْلِلْ أَنْتَ مِنْ عُمْرَتِكَ قَالَ ‏ \"‏ إِنِّي لَبَّدْتُ رَأْسِي، وَقَلَّدْتُ هَدْيِي، فَلاَ أَحِلُّ حَتَّى أَنْحَرَ ‏\"‏‏.‏"
      },
      {
        "id": 5665,
        "hadith_number": "5917",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi (ﷺ) Mengikuti Amalan Ahli Kitab (Pada Permulaan)",
        "perawi_melayu": "Diriwayatkan oleh Ibnu Abbas رضی اللہ عنہما :",
        "english_text": "The Prophet (ﷺ) used to copy the people of the Scriptures in matters in which there was no order from Allah. The people of the Scripture used to let their hair hang down while the pagans used to part their hair. So the Prophet (ﷺ) let his hair hang down first, but later on he parted it.",
        "malay_translation": "Nabi (ﷺ) dahulu mencontohi amalan Ahli Kitab dalam perkara yang tiada perintah daripada Allah. Ahli Kitab membiarkan rambut mereka terurai, manakala orang-orang kafir membelah rambut mereka. Maka, Nabi (ﷺ) membiarkan rambutnya terurai dahulu, tetapi kemudian baginda membelahnya.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُحِبُّ مُوَافَقَةَ أَهْلِ الْكِتَابِ فِيمَا لَمْ يُؤْمَرْ فِيهِ، وَكَانَ أَهْلُ الْكِتَابِ يَسْدِلُونَ أَشْعَارَهُمْ، وَكَانَ الْمُشْرِكُونَ يَفْرُقُونَ رُءُوسَهُمْ، فَسَدَلَ النَّبِيُّ صلى الله عليه وسلم نَاصِيَتَهُ، ثُمَّ فَرَقَ بَعْدُ‏.‏"
      },
      {
        "id": 5666,
        "hadith_number": "5918",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rambut Nabi SAW ketika dalam Ihram",
        "perawi_melayu": "Diriwayatkan daripada `Aisha رضى الله عنها :",
        "english_text": "As if I am now looking at the shine of the hair parting of the Prophet (ﷺ) while he was in the state of lhram. Abdullah bin Raja said: ''Mafriqin Nabiyy''.",
        "malay_translation": "Seolah-olah aku sedang melihat kilauan belahan rambut Nabi ﷺ ketika baginda dalam keadaan ihram. Abdullah bin Raja berkata: ''Mafriqin Nabiyy''.",
        "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، وَعَبْدُ اللَّهِ بْنُ رَجَاءٍ، قَالاَ حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَأَنِّي أَنْظُرُ إِلَى وَبِيصِ الطِّيبِ فِي مَفَارِقِ النَّبِيِّ صلى الله عليه وسلم وَهْوَ مُحْرِمٌ‏.‏ قَالَ عَبْدُ اللَّهِ فِي مَفْرِقِ النَّبِيِّ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 5667,
        "hadith_number": "5919",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi SAW Solat Malam Bersama Ibn Abbas",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Abbas رضی اللہ عنہما :",
        "english_text": "Once I stayed overnight in the house of my aunt Maimuna bint Al-Harith رضی اللہ عنہا and Allah's Messenger (ﷺ) was with her as it was her turn. Allah's Messenger (ﷺ) got up to offer the night prayer. I stood on his left but he took hold of my two locks of hair and made me stand on his right. Narrated Abu Bishr: (the above Hadith) but he quoted: Ibn `Abbas رضی اللہ عنہما said, (took hold of) my two braids on my head.\"",
        "malay_translation": "Pada suatu malam, saya bermalam di rumah mak cik saya, Maimuna bint Al-Harith رضی اللہ عنہا, dan Rasulullah SAW berada bersama beliau kerana giliran beliau. Rasulullah SAW bangun untuk menunaikan solat malam. Saya berdiri di sebelah kirinya, tetapi baginda memegang kedua-dua sanggul rambut saya dan membuatkan saya berdiri di sebelah kanannya. Diriwayatkan oleh Abu Bishr: (Hadis di atas) tetapi beliau memetik: Ibn `Abbas رضی اللہ عنہما berkata, (memegang) dua tocang di kepala saya.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا الْفَضْلُ بْنُ عَنْبَسَةَ، أَخْبَرَنَا هُشَيْمٌ، أَخْبَرَنَا أَبُو بِشْرٍ، ح وَحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا هُشَيْمٌ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ بِتُّ لَيْلَةً عِنْدَ مَيْمُونَةَ بِنْتِ الْحَارِثِ خَالَتِي، وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم عِنْدَهَا فِي لَيْلَتِهَا ـ قَالَ ـ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي مِنَ اللَّيْلِ، فَقُمْتُ عَنْ يَسَارِهِ ـ قَالَ ـ فَأَخَذَ بِذُؤَابَتِي فَجَعَلَنِي عَنْ يَمِينِهِ‏.‏ حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا أَبُو بِشْرٍ، بِهَذَا، وَقَالَ بِذُؤَابَتِي أَوْ بِرَأْسِي‏.‏"
      },
      {
        "id": 5668,
        "hadith_number": "5920",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Al-Qaza' (Mencukur Sebagian Rambut Kepala)",
        "perawi_melayu": "Diriwayatkan daripada `Umar رضی اللہ عنہما :",
        "english_text": "\"I heard Allah's Apostle forbidding Al-Qaza'.\" 'Ubaidullah added: I said, \"What is Al-Qaza'?\" 'Ubaidullah pointed (towards his head) to show us and added, \"Nafi` said, 'It is when a boy has his head shaved leaving a tuft of hair here and a tuft of hair there.\" Ubaidullah pointed towards his forehead and the sides of his head. 'Ubaidullah was asked, \"Does this apply to both girls and boys?\" He said, \"I don't know, but Nafi` said, 'The boy.'\" 'Ubaidullah added, \"I asked Nafi` again, and he said, 'As for leaving hair on the temples and the back part of the boy's head, there is no harm, but Al-Qaza' is to leave a tuft of hair on his forehead unshaved while there is no hair on the rest of his head, and also to leave hair on either side of his head.'\"",
        "malay_translation": "Aku mendengar Rasulullah SAW melarang Al-Qaza'. 'Ubaidullah menambah: Aku bertanya, \"Apakah Al-Qaza'?\" 'Ubaidullah menunjuk (ke arah kepalanya) untuk menunjukkan kepada kami dan menambah, \"Nafi` berkata, 'Iaitu apabila seorang budak lelaki mencukur kepalanya dengan membiarkan sedikit rambut di sini dan sedikit rambut di sana.\" 'Ubaidullah menunjuk ke arah dahinya dan sisi kepalanya. 'Ubaidullah ditanya, \"Adakah ini terpakai untuk kedua-dua anak perempuan dan anak lelaki?\" Dia berkata, \"Aku tidak tahu, tetapi Nafi` berkata, 'Anak lelaki.'\" 'Ubaidullah menambah, \"Aku bertanya kepada Nafi` lagi, dan dia berkata, 'Adapun membiarkan rambut di pelipis dan bahagian belakang kepala budak lelaki, tidak mengapa, tetapi Al-Qaza' ialah membiarkan sedikit rambut di dahinya tidak dicukur sedangkan tidak ada rambut di bahagian lain kepalanya, dan juga membiarkan rambut di kedua-dua sisi kepalanya.'\"",
        "arabic_text": "حَدَّثَنِي مُحَمَّدٌ، قَالَ أَخْبَرَنِي مَخْلَدٌ، قَالَ أَخْبَرَنِي ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ حَفْصٍ، أَنَّ عُمَرَ بْنَ نَافِعٍ، أَخْبَرَهُ عَنْ نَافِعٍ، مَوْلَى عَبْدِ اللَّهِ أَنَّهُ سَمِعَ ابْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَنْهَى عَنِ الْقَزَعِ‏.‏ قَالَ عُبَيْدُ اللَّهِ قُلْتُ وَمَا الْقَزَعُ فَأَشَارَ لَنَا عُبَيْدُ اللَّهِ قَالَ إِذَا حَلَقَ الصَّبِيَّ وَتَرَكَ هَا هُنَا شَعَرَةً وَهَا هُنَا وَهَا هُنَا‏.‏ فَأَشَارَ لَنَا عُبَيْدُ اللَّهِ إِلَى نَاصِيَتِهِ وَجَانِبَىْ رَأْسِهِ‏.‏ قِيلَ لِعُبَيْدِ اللَّهِ فَالْجَارِيَةُ وَالْغُلاَمُ قَالَ لاَ أَدْرِي هَكَذَا قَالَ الصَّبِيِّ‏.‏ قَالَ عُبَيْدُ اللَّهِ وَعَاوَدْتُهُ فَقَالَ أَمَّا الْقُصَّةُ وَالْقَفَا لِلْغُلاَمِ فَلاَ بَأْسَ بِهِمَا وَلَكِنَّ الْقَزَعَ أَنْ يُتْرَكَ بِنَاصِيَتِهِ شَعَرٌ، وَلَيْسَ فِي رَأْسِهِ غَيْرُهُ، وَكَذَلِكَ شَقُّ رَأْسِهِ هَذَا وَهَذَا‏.‏"
      },
      {
        "id": 5669,
        "hadith_number": "5921",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Al-Qaza' oleh Rasulullah ﷺ",
        "perawi_melayu": "Diriwayatkan oleh (Abdullah) bin `Umar رضی اللہ عنہما :",
        "english_text": "Allah's Messenger (ﷺ) forbade Al-Qaza' (leaving a tuft of hair here and there after shaving one's head.)",
        "malay_translation": "Rasulullah ﷺ melarang Al-Qaza' (meninggalkan sedikit rambut di sana sini selepas mencukur kepala seseorang.)",
        "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُثَنَّى بْنِ عَبْدِ اللَّهِ بْنِ أَنَسِ بْنِ مَالِكٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْقَزَعِ‏.‏"
      },
      {
        "id": 5670,
        "hadith_number": "5922",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Minyak Wangi untuk Ihram dan Tawaf-al-Ifada",
        "perawi_melayu": "Diriwayatkan daripada `Aisha رضي الله عنها :",
        "english_text": "I applied perfume to the Prophet (ﷺ) with my own hands when he wanted to assume the state of Ihram, and I also perfumed him at Mina before he departed from there (to perform Tawaf-al-Ifada).",
        "malay_translation": "Saya menyapu minyak wangi kepada Nabi ﷺ dengan tangan saya sendiri ketika Baginda ingin memulakan Ihram, dan saya juga meminyaki Baginda di Mina sebelum Baginda berangkat dari sana (untuk melaksanakan Tawaf-al-Ifada).",
        "arabic_text": "حَدَّثَنِي أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ، أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ طَيَّبْتُ النَّبِيَّ صلى الله عليه وسلم بِيَدِي لِحُرْمِهِ، وَطَيَّبْتُهُ بِمِنًى قَبْلَ أَنْ يُفِيضَ‏.‏"
      },
      {
        "id": 5671,
        "hadith_number": "5923",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Wangi-wangian Terbaik untuk Rasulullah ﷺ",
        "perawi_melayu": "Diriwayatkan daripada `Aisha رضی اللہ عنہا :",
        "english_text": "I used to perfume Allah's Messenger (ﷺ) with the best scent available till I saw the shine of the scent on his head and shine beard.",
        "malay_translation": "Saya pernah mewangikan Rasulullah ﷺ dengan wangian terbaik yang ada sehingga saya melihat kilauan wangian itu pada kepala dan janggut baginda yang bersinar.",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ نَصْرٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَسْوَدِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أُطَيِّبُ النَّبِيَّ صلى الله عليه وسلم بِأَطْيَبِ مَا يَجِدُ، حَتَّى أَجِدَ وَبِيصَ الطِّيبِ فِي رَأْسِهِ وَلِحْيَتِهِ‏.‏"
      },
      {
        "id": 5672,
        "hadith_number": "5924",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Mengintip dan Kepentingan Meminta Izin",
        "perawi_melayu": "Diriwayatkan daripada Sa`d رضي الله عنه :",
        "english_text": "A man peeped into the house of the Prophet (ﷺ) through a hole while the Prophet (ﷺ) was scratching his head with a Midrai (a certain kind of comb). On that the Prophet (ﷺ) said (to him), \"If I had known you had been looking, then I would have pierced your eye with that instrument, because the asking of permission has been ordained so that one would not see things unlawfully.\"",
        "malay_translation": "Seorang lelaki mengintai ke dalam rumah Nabi ﷺ melalui lubang ketika Nabi ﷺ sedang menggaru kepalanya dengan Midrai (sejenis sikat). Lalu Nabi ﷺ bersabda kepadanya, \"Sekiranya aku tahu kamu sedang mengintai, nescaya aku akan cucuk matamu dengan alat itu, kerana meminta izin telah diwajibkan supaya seseorang itu tidak melihat perkara yang haram.\"",
        "arabic_text": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنْ سَهْلِ بْنِ سَعْدٍ، أَنَّ رَجُلاً، اطَّلَعَ مِنْ جُحْرٍ فِي دَارِ النَّبِيِّ صلى الله عليه وسلم وَالنَّبِيُّ صلى الله عليه وسلم يَحُكُّ رَأْسَهُ بِالْمِدْرَى فَقَالَ ‏ \"‏ لَوْ عَلِمْتُ أَنَّكَ تَنْظُرُ لَطَعَنْتُ بِهَا فِي عَيْنِكَ، إِنَّمَا جُعِلَ الإِذْنُ مِنْ قِبَلِ الأَبْصَارِ ‏\"‏‏.‏"
      },
      {
        "id": 5673,
        "hadith_number": "5925",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menyikat Rambut Nabi semasa Haid",
        "perawi_melayu": "Diriwayatkan daripada 'Aishah رضی اللہ عنہا :",
        "english_text": "I used to comb the hair of Allah's Messenger (ﷺ) during my periods. \r\nHadrat  Abdullah bin Zubair has reported from Aishah رضی اللہ عنہا as per aforementioned Hadith.",
        "malay_translation": "Saya pernah menyikat rambut Rasulullah (ﷺ) semasa haid. \r\nHadrat Abdullah bin Zubair meriwayatkan daripada Aishah رضی اللہ عنہا seperti hadis yang disebutkan.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كُنْتُ أُرَجِّلُ رَأْسَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَنَا حَائِضٌ‏.‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، مِثْلَهُ‏.‏"
      },
      {
        "id": 5674,
        "hadith_number": "5926",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kecenderungan Nabi (ﷺ) untuk Memulakan dari Sebelah Kanan",
        "perawi_melayu": "Diriwayatkan daripada 'Aisha رضی اللہ عنہا :",
        "english_text": "The Prophet (ﷺ) used to like to start from the right side as far as possible in combing and in performing ablution.",
        "malay_translation": "Nabi (ﷺ) gemar memulakan dari sebelah kanan seberapa yang boleh dalam menyikat rambut dan dalam berwudhu.",
        "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ أَشْعَثَ بْنِ سُلَيْمٍ، عَنْ أَبِيهِ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ يُعْجِبُهُ التَّيَمُّنُ مَا اسْتَطَاعَ فِي تَرَجُّلِهِ وَوُضُوئِهِ‏.‏"
      },
      {
        "id": 5675,
        "hadith_number": "5927",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keutamaan Puasa dan Ganjaran daripada Allah",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضي اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) said, \"(Allah said), 'Every good deed of Adam's son is for him except fasting; it is for Me. and I shall reward (the fasting person) for it.' Verily, the smell of the mouth of a fasting person is better to Allah than the smell of musk.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"(Allah berfirman), 'Setiap amalan baik anak Adam adalah untuknya kecuali puasa; ia adalah untuk-Ku. Dan Aku akan membalas (orang yang berpuasa) dengannya.' Sesungguhnya, bau mulut orang yang berpuasa adalah lebih baik di sisi Allah daripada bau kasturi.",
        "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ كُلُّ عَمَلِ ابْنِ آدَمَ لَهُ، إِلاَّ الصَّوْمَ فَإِنَّهُ لِي، وَأَنَا أَجْزِي بِهِ، وَلَخَلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ ‏\"‏‏.‏"
      },
      {
        "id": 5676,
        "hadith_number": "5928",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Aisyah r.a. Meminyaki Nabi sebelum Ihram",
        "perawi_melayu": "Diriwayatkan oleh `Aisha رضی اللہ عنہا :",
        "english_text": "I used to perfume the Prophet (ﷺ) before his assuming the state of with the best scent available.",
        "malay_translation": "Saya biasa meminyaki Nabi ﷺ dengan minyak wangi terbaik yang ada sebelum baginda memasuki ihram.",
        "arabic_text": "حَدَّثَنَا مُوسَى، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا هِشَامٌ، عَنْ عُثْمَانَ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كُنْتُ أُطَيِّبُ النَّبِيَّ صلى الله عليه وسلم عِنْدَ إِحْرَامِهِ بِأَطْيَبِ مَا أَجِدُ‏.‏"
      },
      {
        "id": 5677,
        "hadith_number": "5929",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi ﷺ Tidak Pernah Menolak Haruman",
        "perawi_melayu": "Diriwayatkan daripada Anas رضي الله عنه :",
        "english_text": "He never used to refuse (a gift of) scent and used to say that the Prophet (ﷺ) never used to refuse (a gift of) scent.",
        "malay_translation": "Baginda tidak pernah menolak (pemberian) haruman dan selalu berkata bahawa Nabi ﷺ tidak pernah menolak (pemberian) haruman.",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عَزْرَةُ بْنُ ثَابِتٍ الأَنْصَارِيُّ، قَالَ حَدَّثَنِي ثُمَامَةُ بْنُ عَبْدِ اللَّهِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّهُ كَانَ لاَ يَرُدُّ الطِّيبَ، وَزَعَمَ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ لاَ يَرُدُّ الطِّيبَ‏.‏"
      },
      {
        "id": 5678,
        "hadith_number": "5930",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Aisyah meminyaki Rasulullah (ﷺ) dengan Dharira semasa Haji Wada'",
        "perawi_melayu": "Diriwayatkan daripada `Aisyah رضي الله عنها:",
        "english_text": "During Hajjat-al-Wada`, I perfumed Allah's Messenger (ﷺ) with Dharira with my own hands, both on his assuming Ihram and on finishing it.",
        "malay_translation": "Semasa Haji Wada', aku meminyaki Rasulullah (ﷺ) dengan Dharira dengan tanganku sendiri, baik semasa baginda memakai Ihram mahupun setelah selesai.",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ الْهَيْثَمِ، أَوْ مُحَمَّدٌ عَنْهُ عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي عُمَرُ بْنُ عَبْدِ اللَّهِ بْنِ عُرْوَةَ، سَمِعَ عُرْوَةَ، وَالْقَاسِمَ، يُخْبِرَانِ عَنْ عَائِشَةَ، قَالَتْ طَيَّبْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم بِيَدَىَّ بِذَرِيرَةٍ فِي حَجَّةِ الْوَدَاعِ، لِلْحِلِّ وَالإِحْرَامِ‏.‏"
      },
      {
        "id": 5679,
        "hadith_number": "5931",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Laknat Allah ke atas wanita yang membuat tatu dan mengubah ciptaan-Nya",
        "perawi_melayu": "Diriwayatkan oleh Abdullah رضي الله عنهما :",
        "english_text": "Allah has cursed those women who practise tattooing and those who get themselves tattooed, and those who remove their face hairs, and those who create a space between their teeth artificially to look beautiful, and such women as change the features created by Allah. Why then should I not curse those whom the Prophet (ﷺ) has cursed? And that is in Allah's Book. i.e. His Saying: 'And what the Apostle gives you take it and what he forbids you abstain (from it).' (59.7)",
        "malay_translation": "Allah melaknat wanita yang membuat tatu dan yang meminta ditatu, wanita yang mencabut bulu muka, wanita yang mengikir gigi untuk kelihatan cantik, dan wanita yang mengubah ciptaan Allah. Mengapa pula aku tidak melaknat orang yang telah dilaknat oleh Nabi (ﷺ)? Dan yang demikian itu terdapat dalam Kitab Allah, iaitu firman-Nya: 'Dan apa yang diberikan Rasul kepadamu, maka terimalah. Dan apa yang dilarangnya bagimu, maka tinggalkanlah'. (59:7)",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، لَعَنَ اللَّهُ الْوَاشِمَاتِ، وَالْمُسْتَوْشِمَاتِ، وَالْمُتَنَمِّصَاتِ وَالْمُتَفَلِّجَاتِ لِلْحُسْنِ، الْمُغَيِّرَاتِ خَلْقَ اللَّهِ تَعَالَى، مَالِي لاَ أَلْعَنُ مَنْ لَعَنَ النَّبِيُّ صلى الله عليه وسلم وَهْوَ فِي كِتَابِ اللَّهِ ‏{‏وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ‏}‏‏.‏"
      },
      {
        "id": 5680,
        "hadith_number": "5932",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Haramnya Menyambung Rambut (Palsu)",
        "perawi_melayu": "Diriwayatkan oleh Humaid bin `Abdur-Rahman bin `Auf:",
        "english_text": "In the year he performed Hajj. he heard Mu'awiya bin Abi Sufyan رضی اللہ عنہ , who was on the pulpit and was taking a tuft of hair from one of his guards, saying, \"Where are your religious learned men? I heard Allah's Messenger (ﷺ) forbidding this (false hair) and saying, 'The children of Israel were destroyed when their women started using this.'\"",
        "malay_translation": "Pada tahun dia mengerjakan Haji, dia mendengar Mu'awiya bin Abi Sufyan رضی اللہ عنہ, yang berada di mimbar dan mengambil segumpal rambut daripada salah seorang pengawalnya, berkata, \"Di manakah ulama agama kamu? Aku mendengar Rasulullah (ﷺ) melarang perbuatan ini (rambut palsu) dan bersabda, 'Kanak-kanak Israel telah dibinasakan apabila wanita mereka mula menggunakan perkara ini.'\"",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّهُ سَمِعَ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ، عَامَ حَجَّ وَهْوَ عَلَى الْمِنْبَرِ، وَهْوَ يَقُولُ ـ وَتَنَاوَلَ قُصَّةً مِنْ شَعَرٍ كَانَتْ بِيَدِ حَرَسِيٍّ ـ أَيْنَ عُلَمَاؤُكُمْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَنْهَى عَنْ مِثْلِ هَذِهِ وَيَقُولُ ‏ \"‏ إِنَّمَا هَلَكَتْ بَنُو إِسْرَائِيلَ حِينَ اتَّخَذَ هَذِهِ نِسَاؤُهُمْ ‏\"‏‏.‏"
      },
      {
        "id": 5681,
        "hadith_number": "5933",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Allah Melaknat Wanita yang Memanjangkan Rambut dan Membuat Tato",
        "perawi_melayu": "Diriwayatkan oleh Abu Huraira رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) said, \"Allah has cursed the lady who artificially lengthens (her or someone else's) hair and the one who gets her hair lengthened and the One who tattoos (herself or someone else) and the one who gets herself tattooed\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Allah melaknat wanita yang memanjangkan rambut (sendiri atau orang lain) secara buatan, wanita yang rambutnya dipanjangkan, wanita yang membuat tato (sendiri atau orang lain) dan wanita yang ditato.\"",
        "arabic_text": "وَقَالَ ابْنُ أَبِي شَيْبَةَ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا فُلَيْحٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لَعَنَ اللَّهُ الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ، وَالْوَاشِمَةَ وَالْمُسْتَوْشِمَةَ ‏\"‏‏.‏"
      },
      {
        "id": 5682,
        "hadith_number": "5934",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Menyambung Rambut",
        "perawi_melayu": "Daripada 'Aishah رضی اللہ عنہا :",
        "english_text": "An Ansari girl was married and she became sick and all her hair fell out intending to provide her with false hair. They asked the Prophet (ﷺ) who said, \"Allah has cursed the lady who artificially lengthens (her or someone else's) hair and also the one who gets her hair lengthened.\" Similarly, Ibn-e-Ishaq Aban bin Sualih, Hasan, Safiyyah reported from Hadrat Aishah رضی اللہ عنہا .",
        "malay_translation": "Seorang gadis Ansar berkahwin dan dia jatuh sakit sehingga semua rambutnya gugur. Dia berniat untuk menggunakan rambut palsu. Mereka bertanya kepada Nabi (ﷺ), yang bersabda, \"Allah melaknat wanita yang memanjangkan rambutnya (atau rambut orang lain) secara buatan, dan juga wanita yang meminta rambutnya dipanjangkan.\" Begitu juga, diriwayatkan daripada Ibn-e-Ishaq Aban bin Sualih, Hasan, Safiyyah daripada Hadrat Aishah رضی اللہ عنہا .",
        "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، قَالَ سَمِعْتُ الْحَسَنَ بْنَ مُسْلِمِ بْنِ يَنَّاقٍ، يُحَدِّثُ عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ جَارِيَةً، مِنَ الأَنْصَارِ تَزَوَّجَتْ، وَأَنَّهَا مَرِضَتْ فَتَمَعَّطَ شَعَرُهَا، فَأَرَادُوا أَنْ يَصِلُوهَا فَسَأَلُوا النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ لَعَنَ اللَّهُ الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ ‏\"‏‏.‏ تَابَعَهُ ابْنُ إِسْحَاقَ عَنْ أَبَانَ بْنِ صَالِحٍ عَنِ الْحَسَنِ عَنْ صَفِيَّةَ عَنْ عَائِشَةَ‏.‏"
      },
      {
        "id": 5683,
        "hadith_number": "5935",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukum Menyambung Rambut",
        "perawi_melayu": "Diriwayatkan oleh Asma (anak perempuan Abu Bakr) رضی اللہ عنہما :",
        "english_text": "A woman came to Allah's Messenger (ﷺ) and said, \"I married my daughter to someone, but she became sick and all her hair fell out, and (because of that) her husband does not like her. May I let her use false hair?\" On that the Prophet (ﷺ) cursed such a lady as artificially lengthening (her or someone else's) hair or got her hair lengthened artificially.",
        "malay_translation": "Seorang wanita datang kepada Rasulullah (ﷺ) dan berkata, \"Saya mengahwinkan anak perempuan saya kepada seseorang, tetapi dia sakit dan semua rambutnya gugur, dan (kerana itu) suaminya tidak menyukainya. Bolehkah saya membiarkannya menggunakan rambut palsu?\" Lalu Nabi (ﷺ) melaknat wanita yang menyambung (rambutnya atau rambut orang lain) secara buatan atau meminta rambutnya disambung secara buatan.",
        "arabic_text": "حَدَّثَنِي أَحْمَدُ بْنُ الْمِقْدَامِ، حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنَا مَنْصُورُ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَتْنِي أُمِّي، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ ـ رضى الله عنهما ـ أَنَّ امْرَأَةً، جَاءَتْ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ إِنِّي أَنْكَحْتُ ابْنَتِي، ثُمَّ أَصَابَهَا شَكْوَى فَتَمَرَّقَ رَأْسُهَا، وَزَوْجُهَا يَسْتَحِثُّنِي بِهَا أَفَأَصِلُ رَأْسَهَا فَسَبَّ رَسُولُ اللَّهِ صلى الله عليه وسلم الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ‏.‏"
      },
      {
        "id": 5684,
        "hadith_number": "5936",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Laknat ke Atas Wanita yang Mengubah Panjang Rambutnya",
        "perawi_melayu": "Diriwayatkan oleh Asma (anak perempuan Abu Bakr) رضی اللہ عنہما :",
        "english_text": "Allah's Messenger (ﷺ) has cursed such a lady as artificially lengthening (her or someone else's) hair or gets her hair lengthened.",
        "malay_translation": "Rasulullah (ﷺ) telah melaknat wanita yang memanjangkan rambut (sendiri atau orang lain) secara buatan atau yang meminta rambutnya dipanjangkan.",
        "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنِ امْرَأَتِهِ، فَاطِمَةَ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، قَالَتْ لَعَنَ النَّبِيُّ صلى الله عليه وسلم الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ‏.‏"
      },
      {
        "id": 5685,
        "hadith_number": "5937",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Laknat Allah ke atas Wanita yang Memanjangkan Rambut dan Membuat Tatu",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Umar رضی اللہ عنہما :",
        "english_text": "Allah's Messenger (ﷺ) said, \"Allah has cursed such a lady as lengthens (her or someone else's) hair artificially or gets it lengthened, and also a lady who tattoos (herself or someone else) or gets herself tattooed. Nafi'o says: alasham is sometimes connected with the gums.",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Allah melaknat wanita yang memanjangkan rambut (sendiri atau orang lain) secara buatan atau meminta rambutnya dipanjangkan, dan juga wanita yang membuat tatu (pada dirinya sendiri atau orang lain) atau meminta dirinya ditatu. Nafi'o berkata: alasham kadangkala berkaitan dengan gusi.",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لَعَنَ اللَّهُ الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ، وَالْوَاشِمَةَ وَالْمُسْتَوْشِمَةَ ‏\"‏‏.‏ قَالَ نَافِعٌ الْوَشْمُ فِي اللِّثَةِ‏.‏"
      },
      {
        "id": 5686,
        "hadith_number": "5938",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Mu'awiya tentang Penggunaan Rambut Palsu dan Penipuan",
        "perawi_melayu": "Diriwayatkan oleh Sa`id bin Al-Musaiyab:",
        "english_text": "Mu'awiya رضی اللہ عنہ came to Medina for the last time and delivered a sermon. He took out a tuft of hair and said, \"I thought that none used to do this (i.e. use false hair) except Jews. The Prophet (ﷺ) labelled such practice, (i.e. the use of false hair), as cheating.",
        "malay_translation": "Mu'awiya رضي الله عنه datang ke Madinah buat kali terakhir dan menyampaikan khutbah. Beliau mengeluarkan seikat rambut dan berkata, \"Aku menyangka tiada siapa yang melakukan perkara ini (iaitu menggunakan rambut palsu) melainkan orang Yahudi. Nabi ﷺ melabelkan amalan sedemikian (iaitu penggunaan rambut palsu) sebagai penipuan.",
        "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَمْرُو بْنُ مُرَّةَ، سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، قَالَ قَدِمَ مُعَاوِيَةُ الْمَدِينَةَ آخِرَ قَدْمَةٍ قَدِمَهَا، فَخَطَبَنَا فَأَخْرَجَ كُبَّةً مِنْ شَعَرٍ قَالَ مَا كُنْتُ أَرَى أَحَدًا يَفْعَلُ هَذَا غَيْرَ الْيَهُودِ، إِنَّ النَّبِيَّ صلى الله عليه وسلم سَمَّاهُ الزُّورَ‏.‏ يَعْنِي الْوَاصِلَةَ فِي الشَّعَرِ‏.‏"
      },
      {
        "id": 5687,
        "hadith_number": "5939",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Wanita yang Mengubah Ciptaan Allah",
        "perawi_melayu": "Diriwayatkan oleh 'Alqama",
        "english_text": "`Abdullah رضی اللہ عنہما cursed those women who practiced tattooing and those who removed hair from their faces and those who created spaces between their teeth artificially to look beautiful, such ladies as changed what Allah has created. Um Ya'qub said, \"What is that?\" `Abdullah رضی اللہ عنہما said, \"Why should I not curse those who were cursed by Allah's Messenger (ﷺ) and are referred to in Allah's Book?\" She said to him \"By Allah, I have read the whole Qur'an but I have not found such a thing. `Abdullah رضی اللہ عنہما said, \"By Allah, if you had read it (carefully) you would have found it. (Allah says:) 'And what the Apostle gives you take it and what he forbids you abstain (from it).' (59.7)",
        "malay_translation": "Abdullah رضي الله عنه mengutuk wanita yang membuat tatu, wanita yang mencabut bulu dari muka mereka, dan wanita yang membuat ruang antara gigi mereka secara buatan untuk kelihatan cantik, wanita yang mengubah apa yang Allah ciptakan. Um Ya'qub berkata, \"Apakah itu?\" Abdullah رضي الله عنه berkata, \"Mengapa saya tidak mengutuk orang yang dilaknat oleh Rasulullah (ﷺ) dan disebut dalam Kitab Allah?\" Dia berkata kepadanya, \"Demi Allah, saya telah membaca seluruh Al-Quran tetapi saya tidak menemui perkara seperti itu.\" Abdullah رضي الله عنه berkata, \"Demi Allah, jika kamu membacanya (dengan teliti) kamu akan menemuinya. (Allah berfirman:) 'Dan apa sahaja yang diberikan Rasul kepadamu, maka terimalah, dan apa sahaja yang dilarangnya, maka tinggalkanlah.' (59:7)",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، قَالَ لَعَنَ عَبْدُ اللَّهِ الْوَاشِمَاتِ، وَالْمُتَنَمِّصَاتِ، وَالْمُتَفَلِّجَاتِ لِلْحُسْنِ، الْمُغَيِّرَاتِ خَلْقَ اللَّهِ‏.‏ فَقَالَتْ أُمُّ يَعْقُوبَ مَا هَذَا قَالَ عَبْدُ اللَّهِ وَمَا لِيَ لاَ أَلْعَنُ مَنْ لَعَنَ رَسُولُ اللَّهِ، وَفِي كِتَابِ اللَّهِ‏.‏ قَالَتْ وَاللَّهِ لَقَدْ قَرَأْتُ مَا بَيْنَ اللَّوْحَيْنِ فَمَا وَجَدْتُهُ‏.‏ قَالَ وَاللَّهِ لَئِنْ قَرَأْتِيهِ لَقَدْ وَجَدْتِيهِ ‏{‏وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانْتَهُوا‏}‏‏.‏"
      },
      {
        "id": 5688,
        "hadith_number": "5940",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Nabi SAW terhadap Menyambung Rambut dan Membuat Tatu",
        "perawi_melayu": "Diriwayatkan oleh Ibnu `Umar رضی اللہ عنہما :",
        "english_text": "The Prophet (ﷺ) has cursed the lady who lengthens her hair artificially and the one who gets her hair lengthened, and also the lady who tattoos (herself or others) and the one who gets herself tattooed.",
        "malay_translation": "Nabi ﷺ telah melaknat wanita yang memanjangkan rambutnya secara buatan dan wanita yang meminta rambutnya dipanjangkan, dan juga wanita yang membuat tatu (ke atas dirinya atau orang lain) dan wanita yang membuat dirinya ditatu.",
        "arabic_text": "حَدَّثَنِي مُحَمَّدٌ، حَدَّثَنَا عَبْدَةُ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ لَعَنَ النَّبِيُّ صلى الله عليه وسلم الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ، وَالْوَاشِمَةَ وَالْمُسْتَوْشِمَةَ‏.‏"
      },
      {
        "id": 5689,
        "hadith_number": "5941",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukum Menggunakan Rambut Palsu",
        "perawi_melayu": "Diriwayatkan oleh Asma رضی اللہ عنہما :",
        "english_text": "A woman asked the Prophet (ﷺ) saying, \"0 Allah's Messenger (ﷺ)! My daughter got measles and her hair fell out. Now that I got her married, may I let her use false hair?\" He said (to her), \"Allah has cursed the lady who lengthens hair artificially and the one who gets her hair lengthened artificially.\"",
        "malay_translation": "Seorang wanita bertanya kepada Nabi (ﷺ) seraya berkata, \"Wahai Rasulullah (ﷺ)! Anak perempuan saya terkena penyakit campak dan rambutnya gugur. Sekarang setelah saya mengahwinkannya, bolehkah saya membiarkannya menggunakan rambut palsu?\" Baginda bersabda (kepadanya), \"Allah melaknat wanita yang memanjangkan rambut secara buatan dan wanita yang meminta rambutnya dipanjangkan secara buatan.\"",
        "arabic_text": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا هِشَامٌ، أَنَّهُ سَمِعَ فَاطِمَةَ بِنْتَ الْمُنْذِرِ، تَقُولُ سَمِعْتُ أَسْمَاءَ، قَالَتْ سَأَلَتِ امْرَأَةٌ النَّبِيَّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ ابْنَتِي أَصَابَتْهَا الْحَصْبَةُ، فَامَّرَقَ شَعَرُهَا، وَإِنِّي زَوَّجْتُهَا أَفَأَصِلُ فِيهِ فَقَالَ ‏ \"‏ لَعَنَ اللَّهُ الْوَاصِلَةَ وَالْمَوْصُولَةَ ‏\"‏‏.‏"
      },
      {
        "id": 5690,
        "hadith_number": "5942",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Laknat Allah ke atas wanita yang membuat dan meminta tatu serta menyambung rambut",
        "perawi_melayu": "Diriwayatkan oleh Ibnu `Umar رضی اللہ عنہما :",
        "english_text": "I heard the Prophet (ﷺ) saying, (or the Prophet (ﷺ) said), \"Allah has cursed the lady who practices tattooing and that who gets it done for herself, and also the lady who lengthens hair artificially and that who gets her hair lengthened artificially.\" The Prophet (ﷺ) has cursed such ladies.",
        "malay_translation": "Saya mendengar Nabi (ﷺ) bersabda (atau Nabi (ﷺ) berkata), \"Allah melaknat wanita yang membuat tatu dan yang meminta dibuatkan tatu untuk dirinya, dan juga wanita yang memanjangkan rambut secara buatan dan yang meminta rambutnya dipanjangkan secara buatan.\" Nabi (ﷺ) melaknat wanita-wanita sedemikian.",
        "arabic_text": "حَدَّثَنِي يُوسُفُ بْنُ مُوسَى، حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ، حَدَّثَنَا صَخْرُ بْنُ جُوَيْرِيَةَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم أَوْ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ الْوَاشِمَةُ وَالْمُوتَشِمَةُ، وَالْوَاصِلَةُ وَالْمُسْتَوْصِلَةُ ‏\"‏‏.‏ يَعْنِي لَعَنَ النَّبِيُّ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 5691,
        "hadith_number": "5943",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Allah Melaknat Wanita yang Mengubah Ciptaan Allah",
        "perawi_melayu": "Diriwayatkan daripada Ibnu Mas'ud رضی اللہ عنہما:",
        "english_text": "Allah has cursed those women who practise tattooing or get it done for themselves, and those who remove hair from their faces, and those who create spaces between their teeth artificially to look beautiful, such ladies as change the features created by Allah. Why then shall I not curse those whom Allah's Messenger (ﷺ) has cursed and who are cursed in Allah's Book too?",
        "malay_translation": "Allah melaknat wanita yang membuat tatu atau meminta orang lain membuat tatu untuk mereka, wanita yang mencabut bulu dari muka mereka, dan wanita yang membuat jarak antara gigi mereka secara buatan supaya kelihatan cantik, wanita-wanita yang mengubah ciptaan Allah. Mengapa aku tidak melaknat mereka yang telah dilaknat oleh Rasulullah (ﷺ) dan yang juga dilaknat dalam Kitab Allah?",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنِ ابْنِ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ لَعَنَ اللَّهُ الْوَاشِمَاتِ، وَالْمُسْتَوْشِمَاتِ، وَالْمُتَنَمِّصَاتِ وَالْمُتَفَلِّجَاتِ لِلْحُسْنِ، الْمُغَيِّرَاتِ خَلْقَ اللَّهِ، مَا لِي لاَ أَلْعَنُ مَنْ لَعَنَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهْوَ فِي كِتَابِ اللَّهِ‏.‏"
      },
      {
        "id": 5692,
        "hadith_number": "5944",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Mata Jahat dan Larangan Membuat Tatu",
        "perawi_melayu": "Diriwayatkan oleh Abu Huraira رضی اللہ عنہ",
        "english_text": "Allah's Messenger (ﷺ) said, \"The evil eye is a fact,\" and he forbade tattooing.\r\n Hadrat Sufyan narrates that he narrated to Abdur Rehman bin Abis the Hadith which Alqamah has reported from Hadrat Abdullah bin Masoud, he said: I, like Mansur's Hadith, have heard it from Umm-e-Yaqub and she from Hadrat Abdullah bin Masoud.",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Mata jahat itu adalah benar,\" dan baginda melarang membuat tatu.\r\n Hadrat Sufyan meriwayatkan bahawa dia meriwayatkan kepada Abdur Rehman bin Abis hadis yang Alqamah telah laporkan daripada Hadrat Abdullah bin Masoud, dia berkata: Saya, seperti hadis Mansur, telah mendengarnya daripada Umm-e-Yaqub dan dia daripada Hadrat Abdullah bin Masoud.",
        "arabic_text": "حَدَّثَنِي يَحْيَى ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ ، عَنْ مَعْمَرٍ ، عَنْ هَمَّامٍ ، عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : الْعَيْنُ حَقٌّ ، وَنَهَى عَنِ الْوَشْمِ.\r\nحَدَّثَنِي ابْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، قَالَ ذَكَرْتُ لِعَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ حَدِيثَ مَنْصُورٍ عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ،، فَقَالَ سَمِعْتُهُ مِنْ أُمِّ يَعْقُوبَ، عَنْ عَبْدِ اللَّهِ، مِثْلَ حَدِيثِ مَنْصُورٍ‏.‏"
      },
      {
        "id": 5693,
        "hadith_number": "5945",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Nabi (ﷺ) Terhadap Harga Darah, Anjing, Riba, dan Amalan Tertentu",
        "perawi_melayu": "Diriwayatkan oleh Abu Juhaifa رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) forbade the use of the price of blood and the price of a dog, the one who takes (eats) usury the one who gives usury, the woman who practises tattooing and the woman who gets herself tattooed.",
        "malay_translation": "Nabi (ﷺ) melarang penggunaan harga darah dan harga anjing, orang yang mengambil (makan) riba, orang yang memberi riba, wanita yang mengamalkan tatu dan wanita yang membuat dirinya ditatu.",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ، قَالَ رَأَيْتُ أَبِي فَقَالَ إِنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ ثَمَنِ الدَّمِ، وَثَمَنِ الْكَلْبِ، وَآكِلِ الرِّبَا وَمُوكِلِهِ، وَالْوَاشِمَةِ وَالْمُسْتَوْشِمَةِ‏.‏"
      },
      {
        "id": 5694,
        "hadith_number": "5946",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Haramnya Menatu dan Mentatu",
        "perawi_melayu": "Diriwayatkan daripada Abu Huraira رضی اللہ عنہ :",
        "english_text": "A woman who used to practise tattooing was brought to `Umar رضی اللہ عنہ . `Umar رضی اللہ عنہ got up and said, \"I beseech you by Allah, which of you heard the Prophet (ﷺ) saying something about tattooing?\" l got up and said, \"O chief of the Believers! l heard something.\" He said, \"What did you hear?\" I said, \"I heard the Prophet (addressing the ladies), saying, 'Do not practise tattooing and do not get yourselves tattooed.'\"",
        "malay_translation": "Seorang wanita yang mengamalkan menatu dibawa kepada `Umar رضی اللہ عنہ. `Umar رضی اللہ عنہ bangun dan berkata, \"Aku bersumpah kepada Allah, siapakah di antara kamu yang mendengar Nabi (ﷺ) berkata tentang menatu?\" Aku bangun dan berkata, \"Wahai ketua orang-orang beriman! Aku mendengar sesuatu.\" Dia berkata, \"Apa yang kamu dengar?\" Aku berkata, \"Aku mendengar Nabi (berkata kepada para wanita), bersabda, 'Janganlah kamu mengamalkan menatu dan janganlah kamu mentatu diri kamu sendiri.'\"",
        "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عُمَارَةَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أُتِيَ عُمَرُ بِامْرَأَةٍ تَشِمُ فَقَامَ فَقَالَ أَنْشُدُكُمْ بِاللَّهِ مَنْ سَمِعَ مِنَ النَّبِيِّ صلى الله عليه وسلم فِي الْوَشْمِ فَقَالَ أَبُو هُرَيْرَةَ فَقُمْتُ فَقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ أَنَا سَمِعْتُ‏.‏ قَالَ مَا سَمِعْتَ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ تَشِمْنَ وَلاَ تَسْتَوْشِمْنَ ‏\"‏‏.‏"
      },
      {
        "id": 5695,
        "hadith_number": "5947",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Laknat ke atas wanita yang menyambung rambut dan membuat tatu",
        "perawi_melayu": "Diriwayatkan oleh Ibnu `Umar رضي اللہ عنہما :",
        "english_text": "The Prophet (ﷺ) has cursed the lady who lengthens hair artificially and that who gets her hair lengthened in such away, and the lady who practises tattooing and that who gets it done for herself.",
        "malay_translation": "Nabi ﷺ telah melaknat wanita yang menyambung rambut secara buatan dan wanita yang meminta rambutnya disambung dengan cara sedemikian, dan wanita yang melakukan tatu serta wanita yang meminta tatu dibuat untuk dirinya.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، قَالَ لَعَنَ النَّبِيُّ صلى الله عليه وسلم الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ، وَالْوَاشِمَةَ وَالْمُسْتَوْشِمَةَ‏.‏"
      },
      {
        "id": 5696,
        "hadith_number": "5948",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kutukan Allah Terhadap Mereka yang Mengubah Ciptaan-Nya",
        "perawi_melayu": "Diriwayatkan oleh `Abdullah رضی اللہ عنہما :",
        "english_text": "Allah has cursed those women who practise tattooing and those who get it done for themselves, and those who remove hair from their faces, and those who artificially create spaces between their teeth to look beautiful, such women as alter the features created by Allah. Why should I not then curse those whom Allah's Messenger (ﷺ) has cursed and that is in Allah's Book?",
        "malay_translation": "Allah melaknat wanita-wanita yang mengamalkan tatu dan mereka yang membuat tatu untuk diri mereka sendiri, dan mereka yang mencabut bulu dari muka mereka, dan mereka yang mencipta ruang di antara gigi mereka secara buatan untuk kelihatan cantik, wanita-wanita yang mengubah rupa yang dicipta oleh Allah. Mengapakah aku tidak melaknat mereka yang telah dilaknat oleh Rasulullah (ﷺ) dan itu ada di dalam Kitab Allah?",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ لَعَنَ اللَّهُ الْوَاشِمَاتِ وَالْمُسْتَوْشِمَاتِ، وَالْمُتَنَمِّصَاتِ وَالْمُتَفَلِّجَاتِ لِلْحُسْنِ، الْمُغَيِّرَاتِ خَلْقَ اللَّهِ‏.‏ مَا لِي لاَ أَلْعَنُ مَنْ لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهْوَ فِي كِتَابِ اللَّهِ‏.‏"
      },
      {
        "id": 5697,
        "hadith_number": "5949",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Malaikat Tidak Memasuki Rumah yang Mengandungi Anjing atau Gambar",
        "perawi_melayu": "Diriwayatkan oleh Abu Talha رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) said, \"Angels do not enter a house in which there is a dog or there are pictures.\" Laith, Younus, Ibn-e-Shihab, Obaidullah, Ibn-e-Abbas رضی اللہ عنہما , Hadrat Abu Talha heard the same from the prophet ﷺ.",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Malaikat tidak memasuki rumah yang ada anjing atau gambar.\" Laith, Younus, Ibn-e-Shihab, Obaidullah, Ibn-e-Abbas رضی اللہ عنہما , Hadrat Abu Talha mendengar perkara yang sama daripada Nabi ﷺ.",
        "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنْ أَبِي طَلْحَةَ ـ رضى الله عنهم ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ تَدْخُلُ الْمَلاَئِكَةُ بَيْتًا فِيهِ كَلْبٌ وَلاَ تَصَاوِيرُ ‏\"‏‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُبَيْدُ اللَّهِ، سَمِعَ ابْنَ عَبَّاسٍ، سَمِعْتُ أَبَا طَلْحَةَ، سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 5698,
        "hadith_number": "5950",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman Terhadap Pembuat Gambar",
        "perawi_melayu": "Diriwayatkan oleh Muslim:",
        "english_text": "We were with Masruq at the house of Yasar bin Numair. Masruq saw pictures on his terrace and said, \"I heard `Abdullah saying that he heard the Prophet (ﷺ) saying, \"The people who will receive the severest punishment from Allah will be the picture makers.'\"",
        "malay_translation": "Kami bersama Masruq di rumah Yasar bin Numair. Masruq melihat gambar-gambar di teras rumahnya lalu berkata, \"Saya mendengar Abdullah berkata bahawa dia mendengar Nabi ﷺ bersabda: 'Sesungguhnya orang yang paling berat azabnya di sisi Allah pada hari Kiamat ialah orang-orang yang membuat gambar.'\"",
        "arabic_text": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الأَعْمَشُ، عَنْ مُسْلِمٍ، قَالَ كُنَّا مَعَ مَسْرُوقٍ فِي دَارِ يَسَارِ بْنِ نُمَيْرٍ، فَرَأَى فِي صُفَّتِهِ تَمَاثِيلَ فَقَالَ سَمِعْتُ عَبْدَ اللَّهِ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنَّ أَشَدَّ النَّاسِ عَذَابًا عِنْدَ اللَّهِ يَوْمَ الْقِيَامَةِ الْمُصَوِّرُونَ ‏\"‏‏.‏"
      },
      {
        "id": 5699,
        "hadith_number": "5951",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman Bagi Pembuat Gambar",
        "perawi_melayu": "Diriwayatkan oleh Abdullah bin 'Umar رضی اللہ عنہما :",
        "english_text": "Allah's Messenger (ﷺ) said, \"Those who make these pictures will be punished on the Day of Resurrection, and it will be said to them. 'Make alive what you have created.'\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Sesungguhnya mereka yang membuat gambar-gambar ini akan diseksa pada Hari Kiamat, dan akan dikatakan kepada mereka, 'Hidupkanlah apa yang telah kamu ciptakan.'\"",
        "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ الَّذِينَ يَصْنَعُونَ هَذِهِ الصُّوَرَ يُعَذَّبُونَ يَوْمَ الْقِيَامَةِ يُقَالُ لَهُمْ أَحْيُوا مَا خَلَقْتُمْ ‏\"‏‏.‏"
      },
      {
        "id": 5700,
        "hadith_number": "5952",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi SAW Menghapuskan Gambar dan Salib",
        "perawi_melayu": "Diriwayatkan oleh 'Aisha رضی اللہ عنہا:",
        "english_text": "I never used to leave in the Prophet (ﷺ) house anything carrying images or crosses but he obliterated it.",
        "malay_translation": "Aku tidak pernah membiarkan di rumah Nabi (ﷺ) sesuatu yang membawa gambar atau salib melainkan baginda menghapuskannya.",
        "arabic_text": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ عِمْرَانَ بْنِ حِطَّانَ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ حَدَّثَتْهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم لَمْ يَكُنْ يَتْرُكُ فِي بَيْتِهِ شَيْئًا فِيهِ تَصَالِيبُ إِلاَّ نَقَضَهُ‏.‏"
      },
      {
        "id": 5701,
        "hadith_number": "5953",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Membuat Gambar-Gambar Makhluk Hidup",
        "perawi_melayu": "Diriwayatkan oleh Abu Zur'a:",
        "english_text": "l entered a house in Medina with Abu Huraira رضی اللہ عنہ , and he saw a man making pictures at the top of the house. Abu Huraira said, \"I heard Allah's Messenger (ﷺ) saying that Allah said, 'Who would be more unjust than the one who tries to create the like of My creatures? Let them create a grain: let them create a gnat.' \"Abu Huraira then asked for a water container and washed his arms up to his armpits. I said, \"0 Abu i Huraira! Is this something you have heard I from Allah's Messenger (ﷺ)?\" He said, I wash the arms to the extent of wearing ornaments.",
        "malay_translation": "Saya memasuki sebuah rumah di Madinah bersama Abu Hurairah رضی اللہ عنہ, dan beliau melihat seorang lelaki sedang membuat gambar di atas rumah. Abu Hurairah berkata, \"Saya mendengar Rasulullah (ﷺ) bersabda bahawa Allah berfirman, 'Siapakah yang lebih zalim daripada orang yang cuba mencipta seperti ciptaan-Ku? Biar mereka mencipta sebutir biji; biar mereka mencipta seekor agas.' \"Abu Hurairah kemudian meminta bekas air dan membasuh lengannya sehingga ke ketiaknya. Saya berkata, \"Wahai Abu Hurairah! Adakah ini sesuatu yang kamu dengar daripada Rasulullah (ﷺ)?\" Beliau berkata, 'Saya membasuh lengan sehingga ke tahap memakai perhiasan.'",
        "arabic_text": "حَدَّثَنَا مُوسَى، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا عُمَارَةُ، حَدَّثَنَا أَبُو زُرْعَةَ، قَالَ دَخَلْتُ مَعَ أَبِي هُرَيْرَةَ دَارًا بِالْمَدِينَةِ فَرَأَى أَعْلاَهَا مُصَوِّرًا يُصَوِّرُ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ وَمَنْ أَظْلَمُ مِمَّنْ ذَهَبَ يَخْلُقُ كَخَلْقِي، فَلْيَخْلُقُوا حَبَّةً، وَلْيَخْلُقُوا ذَرَّةً ‏\"‏‏.‏ ثُمَّ دَعَا بِتَوْرٍ مِنْ مَاءٍ فَغَسَلَ يَدَيْهِ حَتَّى بَلَغَ إِبْطَهُ فَقُلْتُ يَا أَبَا هُرَيْرَةَ أَشَىْءٌ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ مُنْتَهَى الْحِلْيَةِ‏.‏"
      },
      {
        "id": 5702,
        "hadith_number": "5954",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman Paling Berat Bagi Pembuat Gambar",
        "perawi_melayu": "Diriwayatkan daripada `Aisha رضی اللہ عنہا :",
        "english_text": "Allah's Messenger (ﷺ) returned from a journey when I had placed a curtain of mine having pictures over (the door of) a chamber of mine. When Allah's Messenger (ﷺ) saw it, he tore it and said, \"The people who will receive the severest punishment on the Day of Resurrection will be those who try to make the like of Allah's creations.\" So we turned it (i.e., the curtain) into one or two cushions.",
        "malay_translation": "Rasulullah (ﷺ) pulang daripada suatu perjalanan, ketika itu aku telah meletakkan sehelai langsir kepunyaanku yang bergambar di atas (pintu) sebuah bilikku. Apabila Rasulullah (ﷺ) melihatnya, baginda merobeknya dan bersabda, \"Sesungguhnya orang yang akan menerima azab paling berat pada Hari Kiamat ialah mereka yang berusaha membuat (gambar) seperti ciptaan Allah.\" Lalu kami mengubahnya (iaitu langsir itu) menjadi satu atau dua buah bantal.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ ـ وَمَا بِالْمَدِينَةِ يَوْمَئِذٍ أَفْضَلُ مِنْهُ ـ قَالَ سَمِعْتُ أَبِي قَالَ سَمِعْتُ عَائِشَةَ ـ رضى الله عنها ـ قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ سَفَرٍ وَقَدْ سَتَرْتُ بِقِرَامٍ لِي عَلَى سَهْوَةٍ لِي فِيهَا تَمَاثِيلُ، فَلَمَّا رَآهُ رَسُولُ اللَّهِ صلى الله عليه وسلم هَتَكَهُ وَقَالَ ‏ \"‏ أَشَدُّ النَّاسِ عَذَابًا يَوْمَ الْقِيَامَةِ الَّذِينَ يُضَاهُونَ بِخَلْقِ اللَّهِ ‏\"‏‏.‏ قَالَتْ فَجَعَلْنَاهُ وِسَادَةً أَوْ وِسَادَتَيْنِ‏.‏"
      },
      {
        "id": 5703,
        "hadith_number": "5955",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perintah Nabi (ﷺ) untuk Menanggalkan Langsir Bergambar",
        "perawi_melayu": "Diriwayatkan oleh Aisyah رضی اللہ عنہا :",
        "english_text": "The Prophet (ﷺ) returned from a journey when I had hung a thick curtain having pictures (in front of a door). He ordered me to remove it and I removed it.",
        "malay_translation": "Nabi (ﷺ) pulang dari musafir ketika saya telah menggantungkan langsir tebal yang bergambar (di hadapan pintu). Baginda memerintahkan saya menanggalkannya dan saya pun menanggalkannya.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ قَدِمَ النَّبِيُّ صلى الله عليه وسلم مِنْ سَفَرٍ، وَعَلَّقْتُ دُرْنُوكًا فِيهِ تَمَاثِيلُ، فَأَمَرَنِي أَنْ أَنْزِعَهُ، فَنَزَعْتُهُ‏.‏"
      },
      {
        "id": 5704,
        "hadith_number": "5956",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Mandi Bersama dari Satu Bekas",
        "perawi_melayu": "Diriwayatkan oleh Aisyah رضی اللہ عنہا :",
        "english_text": "The Prophet (ﷺ) and I used to take a bath from one container (of water).",
        "malay_translation": "Nabi (ﷺ) dan saya pernah mandi dari satu bekas (air).",
        "arabic_text": "وَكُنْتُ أَغْتَسِلُ أَنَا وَالنَّبِيُّ، صلى الله عليه وسلم مِنْ إِنَاءٍ وَاحِدٍ‏.‏"
      },
      {
        "id": 5705,
        "hadith_number": "5957",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman bagi Pembuat Gambar dan Larangan Malaikat",
        "perawi_melayu": "Diriwayatkan daripada 'Aisha رضى الله عنها :",
        "english_text": "I purchased a cushion with pictures on it. The Prophet (came and) stood at the door but did not enter. I said (to him), \"I repent to Allah for what (the guilt) I have done.\" He said, \"What is this cushion?\" I said, \"It is for you to sit on and recline on.\" He said, \"The makers of these pictures will be punished on the Day of Resurrection and it will be said to them, 'Make alive what you have created.' Moreover, the angels do not enter a house where there are pictures.'\"",
        "malay_translation": "Saya membeli sebuah bantal dengan gambar-gambar di atasnya. Nabi ﷺ (datang dan) berdiri di pintu tetapi tidak masuk. Saya berkata (kepada Baginda), \"Saya bertaubat kepada Allah atas apa (kesalahan) yang telah saya lakukan.\" Baginda bersabda, \"Apakah bantal ini?\" Saya berkata, \"Ia untuk Tuan duduk dan bersandar di atasnya.\" Baginda bersabda, \"Sesungguhnya pembuat gambar-gambar ini akan dihukum pada Hari Kiamat dan akan dikatakan kepada mereka, 'Hidupkanlah apa yang telah kamu ciptakan.' Tambahan pula, para malaikat tidak memasuki rumah yang ada gambar di dalamnya.'",
        "arabic_text": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا اشْتَرَتْ نُمْرُقَةً فِيهَا تَصَاوِيرُ، فَقَامَ النَّبِيُّ صلى الله عليه وسلم بِالْبَابِ فَلَمْ يَدْخُلْ‏.‏ فَقُلْتُ أَتُوبُ إِلَى اللَّهِ مِمَّا أَذْنَبْتُ‏.‏ قَالَ ‏\"‏ مَا هَذِهِ النُّمْرُقَةُ ‏\"‏‏.‏ قُلْتُ لِتَجْلِسَ عَلَيْهَا وَتَوَسَّدَهَا‏.‏ قَالَ ‏\"‏ إِنَّ أَصْحَابَ هَذِهِ الصُّوَرِ يُعَذَّبُونَ يَوْمَ الْقِيَامَةِ، يُقَالُ لَهُمْ أَحْيُوا مَا خَلَقْتُمْ‏.‏ وَإِنَّ الْمَلاَئِكَةَ لاَ تَدْخُلُ بَيْتًا فِيهِ الصُّورَةُ ‏\"‏‏.‏"
      },
      {
        "id": 5706,
        "hadith_number": "5958",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Malaikat Tidak Memasuki Rumah yang Mengandungi Gambar",
        "perawi_melayu": "Diriwayatkan daripada Abu Talha رضی اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) said, \"Angels (of mercy) do not enter a house where there are pictures.'\" The sub narrator Busr added: \"Then Zaid رضی اللہ عنہ fell ill and we paid him a visit. Behold! There was, hanging at his door, a curtain decorated with a picture. I said to 'Ubaidullah Al-Khaulani, the step son of Maimuna رضی اللہ عنہا , the wife of the Prophet (ﷺ) , \"Didn't Zaid tell us about the picture the day before yesterday?\" 'Ubaidullah said, \"Didn't you hear him saying: 'except a design in a garment'?\" Ibn-e-Wahab, Hadrat Abu Talha رضی اللہ عنہ reported likewise from the prophet ﷺ.",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Malaikat (rahmat) tidak memasuki rumah yang terdapat gambar.\" Perawi tambahan Busr menambah: \"Kemudian Zaid رضی اللہ عنہ jatuh sakit dan kami melawatnya. Lihatlah! Terdapat, tergantung di pintunya, langsir yang dihiasi dengan gambar. Saya berkata kepada 'Ubaidullah Al-Khaulani, anak tiri Maimuna رضی اللہ عنہا , isteri Nabi (ﷺ) , \"Bukankah Zaid memberitahu kami tentang gambar itu sehari sebelum semalam?\" 'Ubaidullah berkata, \"Tidakkah kamu mendengar dia berkata: 'kecuali reka bentuk pada pakaian'?\" Ibn-e-Wahab, Hadrat Abu Talha رضی اللہ عنہ meriwayatkan perkara yang sama daripada Nabi ﷺ.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ بُكَيْرٍ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ زَيْدِ بْنِ خَالِدٍ، عَنْ أَبِي طَلْحَةَ، صَاحِبِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ الْمَلاَئِكَةَ لاَ تَدْخُلُ بَيْتًا فِيهِ الصُّورَةُ ‏\"‏‏.‏ قَالَ بُسْرٌ ثُمَّ اشْتَكَى زَيْدٌ فَعُدْنَاهُ، فَإِذَا عَلَى بَابِهِ سِتْرٌ فِيهِ صُورَةٌ فَقُلْتُ لِعُبَيْدِ اللَّهِ رَبِيبِ مَيْمُونَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَلَمْ يُخْبِرْنَا زَيْدٌ عَنِ الصُّوَرِ يَوْمَ الأَوَّلِ‏.‏ فَقَالَ عُبَيْدُ اللَّهِ أَلَمْ تَسْمَعْهُ حِينَ قَالَ إِلاَّ رَقْمًا فِي ثَوْبٍ‏.‏ وَقَالَ ابْنُ وَهْبٍ أَخْبَرَنَا عَمْرٌو ـ هُوَ ابْنُ الْحَارِثِ ـ حَدَّثَهُ بُكَيْرٌ، حَدَّثَهُ بُسْرٌ، حَدَّثَهُ زَيْدٌ، حَدَّثَهُ أَبُو طَلْحَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 5707,
        "hadith_number": "5959",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Menghalang Solat Kerana Gambar",
        "perawi_melayu": "Diriwayatkan daripada Anas رضی اللہ عنہ :",
        "english_text": "Aisha رضی اللہ عنہا had a thick curtain (having pictures on it) and she screened the side of her i house with it. The Prophet (ﷺ) said to her, \"Remove it from my sight, for its pictures are still coming to my mind in my prayers.\"",
        "malay_translation": "Aisyah رضی اللہ عنہا mempunyai langsir tebal (yang mempunyai gambar di atasnya) dan dia menutup sisi rumahnya dengannya. Nabi (ﷺ) berkata kepadanya, \"Singkirkannya daripada pandanganku, kerana gambar-gambar itu masih terbayang di dalam fikiranku semasa solat.\"",
        "arabic_text": "حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كَانَ قِرَاَمٌ لِعَائِشَةَ سَتَرَتْ بِهِ جَانِبَ بَيْتِهَا، فَقَالَ لَهَا النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ أَمِيطِي عَنِّي، فَإِنَّهُ لاَ تَزَالُ تَصَاوِيرُهُ تَعْرِضُ لِي فِي صَلاَتِي ‏\"‏‏.‏"
      },
      {
        "id": 5708,
        "hadith_number": "5960",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Malaikat Jibril Tidak Memasuki Rumah yang Ada Gambar atau Anjing",
        "perawi_melayu": "Diriwayatkan daripada bapa Salim:",
        "english_text": "Once Gabriel promised to visit the Prophet (ﷺ) but he delayed and the Prophet (ﷺ) got worried about that. At last he came out and found Gabriel and complained to him of his grief (for his delay). Gabriel said to him, \"We do not enter a place in which there is a picture or a dog.\"",
        "malay_translation": "Pada suatu ketika, Jibril pernah berjanji untuk mengunjungi Nabi (ﷺ), tetapi beliau terlambat dan Nabi (ﷺ) berasa bimbang tentang hal itu. Akhirnya baginda keluar dan mendapati Jibril, lalu mengadu kepada Jibril tentang kesedihannya (kerana kelewatan itu). Jibril berkata kepada baginda, \"Kami tidak memasuki tempat yang terdapat gambar atau anjing.\"",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ حَدَّثَنِي عُمَرُ ـ هُوَ ابْنُ مُحَمَّدٍ ـ عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ وَعَدَ النَّبِيَّ صلى الله عليه وسلم جِبْرِيلُ فَرَاثَ عَلَيْهِ حَتَّى اشْتَدَّ عَلَى النَّبِيِّ صلى الله عليه وسلم فَخَرَجَ النَّبِيُّ صلى الله عليه وسلم فَلَقِيَهُ، فَشَكَا إِلَيْهِ مَا وَجَدَ، فَقَالَ لَهُ ‏ \"‏ إِنَّا لاَ نَدْخُلُ بَيْتًا فِيهِ صُورَةٌ وَلاَ كَلْبٌ ‏\"‏‏.‏"
      },
      {
        "id": 5709,
        "hadith_number": "5961",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman ke atas Pembuat Gambar dan Larangan Malaikat",
        "perawi_melayu": "Diriwayatkan oleh `Aisha (isteri Nabi) رضی اللہ عنہا :",
        "english_text": "I bought a cushion having pictures on it. When Allah's Messenger (ﷺ) saw it, he stopped at the gate and did not enter. I noticed the signs of hatred (for that) on his face! I said, \"O Allah's Messenger (ﷺ)! I turn to Allah and His Apostle in repentance! What sin have I committed?\" He said, \"What about this cushion?\" I said, 'I bought it for you to sit on and recline on.\" Allah's Messenger (ﷺ) said, \"The makers of these pictures will be punished (severely) on the Day of Resurrection and it will be said to them, 'Make alive what you have created.'\" He added, \"Angels do not enter a house in which there are pictures.\"",
        "malay_translation": "Saya telah membeli bantal yang mempunyai gambar di atasnya. Apabila Rasulullah (ﷺ) melihatnya, baginda berhenti di pintu dan tidak masuk. Saya perasan tanda-tanda kebencian (terhadap perkara itu) pada wajah baginda! Saya berkata, \"Wahai Rasulullah (ﷺ)! Saya bertaubat kepada Allah dan Rasul-Nya! Apakah dosa yang telah saya lakukan?\" Baginda bersabda, \"Bagaimana dengan bantal ini?\" Saya berkata, 'Saya membelinya untuk anda duduk dan bersandar padanya.\" Rasulullah (ﷺ) bersabda, \"Pembuat gambar-gambar ini akan dihukum (dengan teruk) pada Hari Kiamat dan akan dikatakan kepada mereka, 'Hidupkanlah apa yang telah kamu ciptakan.'\" Baginda menambah, \"Malaikat tidak memasuki rumah yang di dalamnya terdapat gambar.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا أَخْبَرَتْهُ أَنَّهَا اشْتَرَتْ نُمْرُقَةً فِيهَا تَصَاوِيرُ، فَلَمَّا رَآهَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَامَ عَلَى الْبَابِ فَلَمْ يَدْخُلْ، فَعَرَفَتْ فِي وَجْهِهِ الْكَرَاهِيَةَ قَالَتْ يَا رَسُولَ اللَّهِ أَتُوبُ إِلَى اللَّهِ وَإِلَى رَسُولِهِ، مَاذَا أَذْنَبْتُ قَالَ ‏\"‏ مَا بَالُ هَذِهِ النُّمْرُقَةِ ‏\"‏‏.‏ فَقَالَتِ اشْتَرَيْتُهَا لِتَقْعُدَ عَلَيْهَا وَتَوَسَّدَهَا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ أَصْحَابَ هَذِهِ الصُّوَرِ يُعَذَّبُونَ يَوْمَ الْقِيَامَةِ، وَيُقَالُ لَهُمْ أَحْيُوا مَا خَلَقْتُمْ ـ وَقَالَ ـ إِنَّ الْبَيْتَ الَّذِي فِيهِ الصُّوَرُ لاَ تَدْخُلُهُ الْمَلاَئِكَةُ ‏\"‏‏.‏"
      },
      {
        "id": 5710,
        "hadith_number": "5962",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Haramnya Harga Darah, Anjing, dan Upah Pelacur serta Riba, Tato, dan Pengukir Gambar",
        "perawi_melayu": "Diriwayatkan oleh Abu Juhaifa:",
        "english_text": "He had bought a slave whose profession was cupping. The Prophet (ﷺ) forbade taking the price of blood and the price of a dog and the earnings of a prostitute, and cursed the one who took or gave (Riba') usury, and the lady who tattooed others or got herself tattooed, and the picture-maker.",
        "malay_translation": "Beliau telah membeli seorang hamba yang pekerjaannya adalah bekam. Nabi (ﷺ) melarang mengambil harga darah dan harga anjing dan pendapatan pelacur, dan mengutuk orang yang mengambil atau memberi (Riba') riba, dan wanita yang mentato orang lain atau mentato dirinya sendiri, dan pembuat gambar.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنِي غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ، عَنْ أَبِيهِ، أَنَّهُ اشْتَرَى غُلاَمًا حَجَّامًا فَقَالَ إِنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ ثَمَنِ الدَّمِ، وَثَمَنِ الْكَلْبِ، وَكَسْبِ الْبَغِيِّ، وَلَعَنَ آكِلَ الرِّبَا وَمُوكِلَهُ وَالْوَاشِمَةَ وَالْمُسْتَوْشِمَةَ وَالْمُصَوِّرَ‏.‏"
      },
      {
        "id": 5711,
        "hadith_number": "5963",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman Pembuat Gambar pada Hari Kiamat",
        "perawi_melayu": "Diriwayatkan oleh Qatadah:",
        "english_text": "While he was in the company of Hadrat Ibn-e-Abbas رضی اللہ عنہما , the people were asking him questions and he was giving answers without mentioning the prophet ﷺ. He meanwhile was asked about the precept of pictures, he, thereupon, said: I heard Muhammad saying, \"Whoever makes a picture in this world will be asked to put life into it on the Day of Resurrection, but he will not be able to do so.\"",
        "malay_translation": "Semasa beliau berada di sisi Hadrat Ibn-e-Abbas رضی اللہ عنہما, orang ramai bertanya kepada beliau dan beliau memberikan jawapan tanpa menyebut Nabi ﷺ. Pada masa yang sama, beliau ditanya tentang hukum membuat gambar. Beliau lalu berkata: Aku mendengar Muhammad bersabda, \"Sesiapa yang membuat gambar di dunia ini akan diminta untuk meniupkan roh ke dalamnya pada Hari Kiamat, tetapi dia tidak akan mampu melakukannya.\"",
        "arabic_text": "حَدَّثَنَا عَيَّاشُ بْنُ الْوَلِيدِ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدٌ، قَالَ سَمِعْتُ النَّضْرَ بْنَ أَنَسِ بْنِ مَالِكٍ، يُحَدِّثُ قَتَادَةَ قَالَ كُنْتُ عِنْدَ ابْنِ عَبَّاسٍ وَهُمْ يَسْأَلُونَهُ وَلاَ يَذْكُرُ النَّبِيَّ صلى الله عليه وسلم حَتَّى سُئِلَ فَقَالَ سَمِعْتُ مُحَمَّدًا صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ صَوَّرَ صُورَةً فِي الدُّنْيَا كُلِّفَ يَوْمَ الْقِيَامَةِ أَنْ يَنْفُخَ فِيهَا الرُّوحَ، وَلَيْسَ بِنَافِخٍ ‏\"‏‏.‏"
      },
      {
        "id": 5712,
        "hadith_number": "5964",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah ﷺ Menunggang Keldai dan Membonceng Usama bin Zaid",
        "perawi_melayu": "Diriwayatkan oleh Usama bin Zaid رضى الله عنهما:",
        "english_text": "Allah's Messenger (ﷺ) rode a donkey saddled with a saddle covered with a Fadakiyya velvet sheet, and he made me ride behind him.",
        "malay_translation": "Rasulullah ﷺ menunggang seekor keldai yang dipasangkan dengan pelana yang ditutupi dengan helaian baldu Fadakiyya, dan baginda menjadikan aku membonceng di belakangnya.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو صَفْوَانَ، عَنْ يُونُسَ بْنِ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَكِبَ عَلَى حِمَارٍ، عَلَى إِكَافٍ عَلَيْهِ قَطِيفَةٌ فَدَكِيَّةٌ، وَأَرْدَفَ أُسَامَةَ وَرَاءَهُ‏.‏"
      },
      {
        "id": 5713,
        "hadith_number": "5965",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kedatangan Nabi Muhammad SAW ke Mekah dan Sambutan Bani Abdul Muttalib",
        "perawi_melayu": "Diriwayatkan oleh Ibnu Abbas رضی اللہ عنہما :",
        "english_text": "When the Prophet (ﷺ) arrived at Mecca, the children of Bani `Abdul Muttalib received him. He then mounted one of them in front of him and the other behind him.",
        "malay_translation": "Ketika Nabi (ﷺ) tiba di Mekah, anak-anak Bani `Abdul Muttalib menyambut baginda. Kemudian baginda menunggang salah seorang daripada mereka di hadapan baginda dan seorang lagi di belakang baginda.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا قَدِمَ النَّبِيُّ صلى الله عليه وسلم مَكَّةَ اسْتَقْبَلَهُ أُغَيْلِمَةُ بَنِي عَبْدِ الْمُطَّلِبِ، فَحَمَلَ وَاحِدًا بَيْنَ يَدَيْهِ وَالآخَرَ خَلْفَهُ‏.‏"
      },
      {
        "id": 5714,
        "hadith_number": "5966",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Nabi SAW Menunggang Bersama Semasa Pembukaan Mekah",
        "perawi_melayu": "Diriwayatkan oleh Aiyub:",
        "english_text": "The worst of three (persons riding one, animal) was mentioned in `Ikrima's presence `Ikrima said, \"Ibn `Abbas رضی اللہ عنہما said, '(In the year of the conquest of Mecca) the Prophet (ﷺ) came and mounted Qutham in front of him and Al-Fadl behind him, or Qutham behind him and Al-Fadl in front of him.' Now which of them was the worst off and which was the best?",
        "malay_translation": "Keburukan bagi tiga orang (menaiki seekor haiwan) telah disebut di hadapan `Ikrima. `Ikrima berkata, \"Ibn `Abbas رضی اللہ عنہما berkata, '(Pada tahun pembukaan Mekah) Nabi (ﷺ) datang dan menunggang Qutham di hadapan baginda dan Al-Fadl di belakangnya, atau Qutham di belakang baginda dan Al-Fadl di hadapannya.' Sekarang siapakah di antara mereka yang paling buruk dan siapakah yang terbaik?",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا أَيُّوبُ، ذُكِرَ الأَشَرُّ الثَّلاَثَةُ عِنْدَ عِكْرِمَةَ فَقَالَ قَالَ ابْنُ عَبَّاسٍ أَتَى رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَدْ حَمَلَ قُثَمَ بَيْنَ يَدَيْهِ، وَالْفَضْلَ خَلْفَهُ، أَوْ قُثَمَ خَلْفَهُ، وَالْفَضْلَ بَيْنَ يَدَيْهِ، فَأَيُّهُمْ شَرٌّ أَوْ أَيُّهُمْ خَيْرٌ‏.‏"
      },
      {
        "id": 5715,
        "hadith_number": "5967",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hak Allah dan Hak Hamba-Nya",
        "perawi_melayu": "Riwayat Mu`adh bin Jabal:",
        "english_text": "While I was riding behind the Prophet (ﷺ) and between me and him and between me and him there was only the back of the saddle, he said, \"0 Mu`adh!\" I replied, \"Labbaik, 0 Allah's Messenger (ﷺ), and Sa`daik!\" he said, \"Do you know what is Allah's right upon his slave?\" I said, \"Allah and His Apostle know best\" He said \"Allah's right upon his slaves is that they should worship Him alone and not worship anything else besides Him.\" Then he proceeded for a while and then said, \"O Mu`adh bin Jabal!\" I replied, \"Labbaik, O Allah's Messenger (ﷺ):, Sa`daik!' He said, \"Do you know what is the right of the slaves upon Allah if they do that?\" I replied, \"Allah and His Apostle know best.\" He said, \"The right of the slaves upon Allah is that He will not punish them (if they do that).\"",
        "malay_translation": "Semasa aku menunggang di belakang Nabi (ﷺ) dan antara aku dan Baginda serta antara aku dan Baginda hanya terdapat belakang pelana, Baginda bersabda, \"Wahai Mu`adh!\" Aku menjawab, \"Labbaik, wahai Rasulullah (ﷺ), dan Sa`daik!\" Baginda bersabda, \"Adakah kamu tahu apakah hak Allah ke atas hamba-Nya?\" Aku berkata, \"Allah dan Rasul-Nya lebih mengetahui.\" Baginda bersabda, \"Hak Allah ke atas hamba-Nya ialah mereka hendaklah menyembah-Nya sahaja dan tidak menyembah sesuatu yang lain selain daripada-Nya.\" Kemudian Baginda berjalan seketika lalu bersabda, \"Wahai Mu`adh bin Jabal!\" Aku menjawab, \"Labbaik, wahai Rasulullah (ﷺ):, Sa`daik!\" Baginda bersabda, \"Adakah kamu tahu apakah hak hamba ke atas Allah jika mereka berbuat demikian?\" Aku menjawab, \"Allah dan Rasul-Nya lebih mengetahui.\" Baginda bersabda, \"Hak hamba ke atas Allah ialah Dia tidak akan mengazab mereka (jika mereka berbuat demikian).",
        "arabic_text": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، عَنْ مُعَاذِ بْنِ جَبَلٍ ـ رضى الله عنه ـ قَالَ بَيْنَا أَنَا رَدِيفُ النَّبِيِّ، صلى الله عليه وسلم لَيْسَ بَيْنِي وَبَيْنَهُ إِلاَّ أَخِرَةُ الرَّحْلِ فَقَالَ ‏\"‏ يَا مُعَاذُ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ رَسُولَ اللَّهِ وَسَعْدَيْكَ‏.‏ ثُمَّ سَارَ سَاعَةً ثُمَّ قَالَ ‏\"‏ يَا مُعَاذُ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ رَسُولَ اللَّهِ وَسَعْدَيْكَ‏.‏ ثُمَّ سَارَ سَاعَةً ثُمَّ قَالَ ‏\"‏ يَا مُعَاذُ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ رَسُولَ اللَّهِ وَسَعْدَيْكَ‏.‏ قَالَ ‏\"‏ هَلْ تَدْرِي مَا حَقُّ اللَّهِ عَلَى عِبَادِهِ ‏\"‏‏.‏ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ حَقُّ اللَّهِ عَلَى عِبَادِهِ أَنْ يَعْبُدُوهُ وَلاَ يُشْرِكُوا بِهِ شَيْئًا ‏\"‏‏.‏ ثُمَّ سَارَ سَاعَةً ثُمَّ قَالَ ‏\"‏ يَا مُعَاذُ بْنَ جَبَلٍ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ رَسُولَ اللَّهِ وَسَعْدَيْكَ‏.‏ فَقَالَ ‏\"‏ هَلْ تَدْرِي مَا حَقُّ الْعِبَادِ عَلَى اللَّهِ إِذَا فَعَلُوهُ ‏\"‏‏.‏ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ حَقُّ الْعِبَادِ عَلَى اللَّهِ أَنْ لاَ يُعَذِّبَهُمْ ‏\"‏‏.‏"
      },
      {
        "id": 5716,
        "hadith_number": "5968",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ucapan Nabi SAW Ketika Mendekati Madinah",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik رضي اللہ عنه :",
        "english_text": "We were coming from Khaibar along with Allah's Messenger (ﷺ) while l was riding behind Abu Talha رضی اللہ عنہ and he was proceeding. While one of the wives of Allah's Messenger (ﷺ) was riding behind Allah's Messenger (ﷺ), suddenly the foot of the camel Slipped and I said, \"The woman!\" and alighted (hurriedly). Allah's Apostle said, \"She is your mother.\" Sol resaddled the she-camel and Allah's Messenger (ﷺ) mounted it. When he approached or saw Medina, he said, \"Ayibun, ta'ibun, 'abidun, li-Rabbina hami-dun.\"",
        "malay_translation": "Kami datang dari Khaibar bersama Rasulullah (ﷺ) sementara aku menunggang di belakang Abu Talha رضی اللہ عنه dan dia sedang berjalan. Sementara salah seorang isteri Rasulullah (ﷺ) menunggang di belakang Rasulullah (ﷺ), tiba-tiba kaki unta tergelincir dan aku berkata, \"Wanita itu!\" dan turun (dengan cepat). Rasulullah bersabda, \"Dia adalah ibumu.\" Aku pun memasang semula pelana unta betina itu dan Rasulullah (ﷺ) menungganginya. Ketika baginda mendekati atau melihat Madinah, baginda bersabda, \"Ayibun, ta'ibun, 'abidun, li-Rabbina hami-dun.\"",
        "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدِ بْنِ صَبَّاحٍ، حَدَّثَنَا يَحْيَى بْنُ عَبَّادٍ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنِي يَحْيَى بْنُ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ قَالَ أَقْبَلْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ خَيْبَرَ، وَإِنِّي لَرَدِيفُ أَبِي طَلْحَةَ وَهْوَ يَسِيرُ وَبَعْضُ نِسَاءِ رَسُولِ اللَّهِ صلى الله عليه وسلم رَدِيفُ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ عَثَرَتِ النَّاقَةُ فَقُلْتُ الْمَرْأَةَ‏.‏ فَنَزَلْتُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّهَا أُمُّكُمْ ‏\"‏‏.‏ فَشَدَدْتُ الرَّحْلَ وَرَكِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمَّا دَنَا أَوْ رَأَى الْمَدِينَةَ قَالَ ‏\"‏ آيِبُونَ تَائِبُونَ، عَابِدُونَ لِرَبِّنَا، حَامِدُونَ ‏\"‏‏.‏"
      },
      {
        "id": 5717,
        "hadith_number": "5969",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi (ﷺ) Berbaring di Masjid",
        "perawi_melayu": "Diriwayatkan daripada bapa saudara `Abbad bin Tamim:",
        "english_text": "I saw the Prophet (ﷺ) lying-down in the mosque and placing one leg on the other.",
        "malay_translation": "Saya melihat Nabi (ﷺ) berbaring di dalam masjid sambil meletakkan satu kaki di atas kaki yang lain.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَمِّهِ، أَنَّهُ أَبْصَرَ النَّبِيَّ صلى الله عليه وسلم يَضْطَجِعُ فِي الْمَسْجِدِ، رَافِعًا إِحْدَى رِجْلَيْهِ عَلَى الأُخْرَى‏.‏"
      }
    ]
  }
}