{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 39,
    "data": [
      {
        "id": 1046,
        "hadith_number": "1080",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Qasar Semasa Bermusafir: Tempoh Masa yang Dibenarkan",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Abbas رضي الله عنهما:",
        "english_text": "The Prophet (ﷺ) once stayed for nineteen days and prayed shortened prayers. So when we travel led (and stayed) for nineteen days, we used to shorten the prayer but if we traveled (and stayed) for a longer period we used to offer the full prayer.",
        "malay_translation": "Nabi Muhammad (ﷺ) pernah menetap selama sembilan belas hari dan menunaikan solat qasar. Oleh itu, apabila kami bermusafir (dan menetap) selama sembilan belas hari, kami biasa mengqasarkan solat. Tetapi jika kami bermusafir (dan menetap) untuk tempoh yang lebih lama, kami akan menunaikan solat secara penuh.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَاصِمٍ، وَحُصَيْنٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ أَقَامَ النَّبِيُّ صلى الله عليه وسلم تِسْعَةَ عَشَرَ يَقْصُرُ، فَنَحْنُ إِذَا سَافَرْنَا تِسْعَةَ عَشَرَ قَصَرْنَا، وَإِنْ زِدْنَا أَتْمَمْنَا‏.‏"
      },
      {
        "id": 1047,
        "hadith_number": "1081",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Dua Rakaat Semasa Musafir dari Madinah ke Mekah",
        "perawi_melayu": "Diriwayatkan oleh Anas RA:",
        "english_text": "\"We traveled with the Prophet (ﷺ) from Medina to Mecca and offered two rak`at (for every prayer) till we returned to Medina.\" I said, \"Did you stay for a while in Mecca?\" He replied, \"We stayed in Mecca for ten days.\"",
        "malay_translation": "\"Kami bermusafir bersama Nabi Muhammad SAW dari Madinah ke Mekah dan menunaikan solat dua rakaat (bagi setiap solat) sehingga kami kembali ke Madinah.\" Saya bertanya, \"Adakah kamu tinggal lama di Mekah?\" Beliau menjawab, \"Kami tinggal di Mekah selama sepuluh hari.\"",
        "arabic_text": "حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم مِنَ الْمَدِينَةِ إِلَى مَكَّةَ، فَكَانَ يُصَلِّي رَكْعَتَيْنِ رَكْعَتَيْنِ حَتَّى رَجَعْنَا إِلَى الْمَدِينَةِ‏.‏ قُلْتُ أَقَمْتُمْ بِمَكَّةَ شَيْئًا قَالَ أَقَمْنَا بِهَا عَشْرًا‏.‏"
      },
      {
        "id": 1048,
        "hadith_number": "1082",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat di Mina Bersama Nabi Muhammad SAW dan Para Khulafa ar-Rasyidin",
        "perawi_melayu": "Diriwayatkan oleh Abdullah RA:",
        "english_text": "I offered the prayer with the Prophet, Abu Bakr and `Umar رضی اللہ عنہما at Mina and it was of two rak`at. `Uthman  رضی اللہ عنہ in the early days of his caliphate did the same, but later on he started praying the full prayer.",
        "malay_translation": "Saya menunaikan solat bersama Nabi Muhammad SAW, Abu Bakar RA dan Umar RA di Mina dan ia adalah dua rakaat. Uthman RA pada awal pemerintahannya melakukan perkara yang sama, tetapi kemudiannya beliau mula menunaikan solat secara penuh.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ أَخْبَرَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم بِمِنًى رَكْعَتَيْنِ، وَأَبِي بَكْرٍ وَعُمَرَ، وَمَعَ عُثْمَانَ صَدْرًا مِنْ إِمَارَتِهِ ثُمَّ أَتَمَّهَا‏.‏"
      },
      {
        "id": 1049,
        "hadith_number": "1083",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat di Mina Semasa Zaman Aman",
        "perawi_melayu": "Diriwayatkan oleh Haritha bin Wahab RA:",
        "english_text": "The Prophet (ﷺ) I led us in the prayer at Mina during the peace period by offering two rak`at.",
        "malay_translation": "Nabi Muhammad SAW mengimami kami dalam solat di Mina semasa zaman aman dengan menunaikan dua rakaat.",
        "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا شُعْبَةُ، أَنْبَأَنَا أَبُو إِسْحَاقَ، قَالَ سَمِعْتُ حَارِثَةَ بْنَ وَهْبٍ، قَالَ صَلَّى بِنَا النَّبِيُّ صلى الله عليه وسلم آمَنَ مَا كَانَ بِمِنًى رَكْعَتَيْنِ‏.‏"
      },
      {
        "id": 1050,
        "hadith_number": "1084",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Empat Rakaat di Mina dan Amaran Ibn Mas'ud",
        "perawi_melayu": "Diriwayatkan oleh `Abdur Rahman bin Yazid:",
        "english_text": "We offered a four rak`at prayer at Mina behind Ibn `Affan . `Abdullah bin Mas`ud was informed about it. He said sadly, \"Truly to Allah we belong and truly to Him we shall return.\" And added, \"I prayed two rak`at with Allah's Messenger (ﷺ) at Mina and similarly with Abu Bakr رضی اللہ عنہ and with `Umar رضی اللہ عنہ (during their caliphates).\" He further said, \"May I be lucky enough to have two of the four rak`at accepted (by Allah).\"",
        "malay_translation": "Kami menunaikan solat empat rakaat di Mina di belakang Ibn `Affan. `Abdullah bin Mas'ud dimaklumkan tentang perkara ini. Beliau berkata dengan sedih, \"Sesungguhnya kami adalah kepunyaan Allah dan kepada-Nya kami akan kembali.\" Dan beliau menambah, \"Saya solat dua rakaat bersama Rasulullah (ﷺ) di Mina dan begitu juga bersama Abu Bakr رضی اللہ عنہ dan bersama `Umar رضی اللہ عنہ (semasa pemerintahan mereka).\" Beliau selanjutnya berkata, \"Semoga saya bernasib baik untuk dua daripada empat rakaat diterima (oleh Allah).\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، عَنِ الأَعْمَشِ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ يَزِيدَ، يَقُولُ صَلَّى بِنَا عُثْمَانُ بْنُ عَفَّانَ ـ رضى الله عنه ـ بِمِنًى أَرْبَعَ رَكَعَاتٍ، فَقِيلَ ذَلِكَ لِعَبْدِ اللَّهِ بْنِ مَسْعُودٍ ـ رضى الله عنه ـ فَاسْتَرْجَعَ ثُمَّ قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِمِنًى رَكْعَتَيْنِ، وَصَلَّيْتُ مَعَ أَبِي بَكْرٍ ـ رضى الله عنه ـ بِمِنًى رَكْعَتَيْنِ، وَصَلَّيْتُ مَعَ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنه ـ بِمِنًى رَكْعَتَيْنِ، فَلَيْتَ حَظِّي مِنْ أَرْبَعِ رَكَعَاتٍ رَكْعَتَانِ مُتَقَبَّلَتَانِ‏.‏"
      },
      {
        "id": 1051,
        "hadith_number": "1085",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ketibaan Nabi Muhammad SAW di Mekah dan Arahan untuk Umrah",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Abbas RA:",
        "english_text": "The Prophet (ﷺ) and his companions reached Mecca in the morning of the 4th Dhul-Hijja reciting Talbiya (O Allah! We are obedient to your orders, we respond 4 to your call) . . . intending to perform Hajj. The Prophet (ﷺ) ordered his companions to assume the lhram for Umra instead of Hajj, excepting those who had Hadi (sacrifice) with them.\r\nAtaa corroborated him from Hadrat Jabir.",
        "malay_translation": "Nabi Muhammad SAW dan para sahabatnya tiba di Mekah pada pagi 4 Zulhijjah sambil melafazkan Talbiyah (Ya Allah! Kami patuh pada perintah-Mu, kami menyahut panggilan-Mu). Mereka berniat untuk mengerjakan Haji. Nabi Muhammad SAW memerintahkan para sahabatnya untuk berniat ihram untuk Umrah dan bukan Haji, kecuali mereka yang membawa binatang korban (Hadi) bersama mereka.\r\nAtaa menguatkan riwayat ini daripada Hadrat Jabir.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا وُهَيْبٌ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي الْعَالِيَةِ الْبَرَّاءِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم وَأَصْحَابُهُ لِصُبْحِ رَابِعَةٍ يُلَبُّونَ بِالْحَجِّ، فَأَمَرَهُمْ أَنْ يَجْعَلُوهَا عُمْرَةً إِلاَّ مَنْ مَعَهُ الْهَدْىُ‏.‏ تَابَعَهُ عَطَاءٌ عَنْ جَابِرٍ‏.‏"
      },
      {
        "id": 1052,
        "hadith_number": "1086",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Wanita Bermusafir Lebih Tiga Hari Tanpa Mahram",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Umar رضی اللہ عنہما :",
        "english_text": "The Prophet (ﷺ) said, \"A woman should not travel for more than three days except with a Dhi-Mahram (i.e. a male with whom she cannot marry at all, e.g. her brother, father, grandfather, etc.) or her own husband.)\"",
        "malay_translation": "Nabi Muhammad (ﷺ) bersabda, \"Seorang wanita tidak boleh bermusafir lebih dari tiga hari kecuali dengan Dhi-Mahram (iaitu lelaki yang tidak boleh dinikahinya sama sekali, contohnya abangnya, ayahnya, datuknya, dan lain-lain) atau suaminya sendiri.\"",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، قَالَ قُلْتُ لأَبِي أُسَامَةَ حَدَّثَكُمْ عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تُسَافِرِ الْمَرْأَةُ ثَلاَثَةَ أَيَّامٍ إِلاَّ مَعَ ذِي مَحْرَمٍ ‏\"‏‏.‏"
      },
      {
        "id": 1053,
        "hadith_number": "1087",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Musafir Bagi Wanita Tanpa Mahram Lebih Dari Tiga Hari",
        "perawi_melayu": "Diriwayatkan dari Ibn `Umar رضی اللہ عنہما :",
        "english_text": "The Prophet (ﷺ) said, \"A woman should not travel for more than three days except with a Dhi-Mahram.\"\r\nAhmad corroborated him from Ibn-e-Mubarak, he from Obaidullah and he from Nafi'i that Hadrat Ibn-e-e Umer رضی اللہ عنہما reported it from the prophet (ﷺ).",
        "malay_translation": "Nabi Muhammad (ﷺ) bersabda, \"Seorang wanita tidak boleh bermusafir lebih dari tiga hari kecuali dengan seorang Dhi-Mahram.\"\r\nAhmad menguatkannya dari Ibn-e-Mubarak, dia dari Obaidullah dan dia dari Nafi'i bahawa Hadrat Ibn-e-e Umer رضی اللہ عنہما meriwayatkannya dari Nabi (ﷺ).",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تُسَافِرِ الْمَرْأَةُ ثَلاَثًا إِلاَّ مَعَ ذِي مَحْرَمٍ ‏\"‏‏.‏ تَابَعَهُ أَحْمَدُ عَنِ ابْنِ الْمُبَارَكِ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 1054,
        "hadith_number": "1088",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Wanita Bermusafir Tanpa Mahram",
        "perawi_melayu": "Diriwayatkan dari Abu Hurairah RA:",
        "english_text": "The Prophet (ﷺ) said, \"It is not permissible for a woman who believes in Allah and the Last Day to travel for one day and night except with a Mahram.\"\r\nYahya bin Abu Katheer and Sohail and Imam Malik corroborated him from Maqburi and he from Hadrat Abu Hurairah رضی اللہ عنہ .",
        "malay_translation": "Nabi SAW bersabda, \"Tidak dibenarkan bagi seorang wanita yang beriman kepada Allah dan Hari Akhirat untuk bermusafir selama sehari semalam kecuali dengan seorang Mahram.\"\r\nYahya bin Abu Kathir dan Sohail dan Imam Malik menguatkan riwayat ini daripada Maqburi dan beliau daripada Hadrat Abu Hurairah RA.",
        "arabic_text": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، قَالَ حَدَّثَنَا سَعِيدٌ الْمَقْبُرِيُّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ تُسَافِرَ مَسِيرَةَ يَوْمٍ وَلَيْلَةٍ لَيْسَ مَعَهَا حُرْمَةٌ ‏\"‏‏.‏ تَابَعَهُ يَحْيَى بْنُ أَبِي كَثِيرٍ وَسُهَيْلٌ وَمَالِكٌ عَنِ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه‏.‏"
      },
      {
        "id": 1055,
        "hadith_number": "1089",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Zuhur dan Asar Dipendekkan Semasa Perjalanan",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik RA:",
        "english_text": "I offered four rak`at of Zuhr prayer with the Prophet (ﷺ) at Medina and two rak`at at Dhul-Hulaifa. (i.e. shortened the `Asr prayer).",
        "malay_translation": "Saya menunaikan empat rakaat solat Zuhur bersama Nabi SAW di Madinah dan dua rakaat di Dhul-Hulaifa (iaitu memendekkan solat Asar).",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، وَإِبْرَاهِيمَ بْنِ مَيْسَرَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ صَلَّيْتُ الظُّهْرَ مَعَ النَّبِيِّ صلى الله عليه وسلم بِالْمَدِينَةِ أَرْبَعًا، وَبِذِي الْحُلَيْفَةِ رَكْعَتَيْنِ‏.‏"
      },
      {
        "id": 1056,
        "hadith_number": "1090",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Dua Rakaat pada Awalnya dan Penyempurnaannya Kemudian",
        "perawi_melayu": "Diriwayatkan daripada `Aisha رضي الله عنها:",
        "english_text": "\"When the prayers were first enjoined they were of two rak`at each. Later the prayer in a journey was kept as it was but the prayers for non-travelers were completed.\" Az-Zuhri said, \"I asked `Urwa what made Aisha رضی اللہ عنہا pray the full prayers (in journey).\" He replied, \"She did the same as `Uthman رضی اللہ عنہ did.\"",
        "malay_translation": "\"Ketika solat pertama kali diwajibkan, ia adalah dua rakaat setiap satu. Kemudian solat dalam perjalanan dikekalkan seperti itu, tetapi solat bagi mereka yang tidak bermusafir disempurnakan.\" Az-Zuhri berkata, \"Saya bertanya kepada `Urwa apa yang menyebabkan `Aisha رضي الله عنها menunaikan solat penuh (dalam perjalanan).\" Beliau menjawab, \"Beliau melakukan perkara yang sama seperti yang dilakukan oleh `Uthman رضي الله عنه.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتِ الصَّلاَةُ أَوَّلُ مَا فُرِضَتْ رَكْعَتَيْنِ فَأُقِرَّتْ صَلاَةُ السَّفَرِ، وَأُتِمَّتْ صَلاَةُ الْحَضَرِ‏.‏ قَالَ الزُّهْرِيُّ فَقُلْتُ لِعُرْوَةَ مَا بَالُ عَائِشَةَ تُتِمُّ قَالَ تَأَوَّلَتْ مَا تَأَوَّلَ عُثْمَانُ‏.‏"
      },
      {
        "id": 1057,
        "hadith_number": "1091, 1092",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menangguhkan Solat Maghrib Ketika Bermusafir dan Menghimpunkannya dengan Isyak",
        "perawi_melayu": "Diriwayatkan oleh `Abdullah bin `Uma رضی اللہ عنہما :",
        "english_text": "\"I saw Allah's Messenger (ﷺ) delaying the Maghrib prayer till he offered it along with the `Isha' prayer whenever he was in a hurry during the journey.\" Salim narrated, \"Ibn `Umar رضی اللہ عنہما used to do the same whenever he was in a hurry during the journey.\" And Salim added, \"Ibn `Umar used to pray the Maghrib and `Isha' prayers together in Al-Muzdalifa.\" Salim said, \"Ibn `Umar delayed the Maghrib prayer because at that time he heard the news of the death of his wife Safiya bint Abi `Ubaid. I said to him, 'The prayer (is due).' He said, 'Go on.' Again I said, 'The prayer (is due).' He said, 'Go on,' till we covered two or three miles. Then he got down, prayed and said, 'I saw the Prophet (ﷺ) praying in this way, whenever he was in a hurry during the journey.' `Abdullah (bin `Umar) added, \"Whenever the Prophet was in a hurry, he used to delay the Maghrib prayer and then offer three rak`at (of the Maghrib) and perform Taslim, and after waiting for a short while, Iqama used to be pronounced for the `Isha' prayer when he would offer two rak`at and perform Taslim. He would never offer any optional prayer till the middle of the night (when he used to pray the Tahajjud).\"",
        "malay_translation": "\"Saya melihat Rasulullah (ﷺ) menangguhkan solat Maghrib sehingga baginda menunaikannya bersama dengan solat Isyak apabila baginda tergesa-gesa semasa dalam perjalanan.\" Salim meriwayatkan, \"Ibn `Umar رضی اللہ عنہما juga melakukan perkara yang sama apabila beliau tergesa-gesa semasa dalam perjalanan.\" Dan Salim menambah, \"Ibn `Umar biasanya menunaikan solat Maghrib dan Isyak bersama-sama di Al-Muzdalifa.\" Salim berkata, \"Ibn `Umar menangguhkan solat Maghrib kerana pada waktu itu beliau mendengar berita tentang kematian isterinya, Safiya bint Abi `Ubaid. Saya berkata kepadanya, 'Waktu solat (sudah tiba).' Beliau berkata, 'Teruskan.' Saya berkata lagi, 'Waktu solat (sudah tiba).' Beliau berkata, 'Teruskan,' sehingga kami merentasi dua atau tiga batu. Kemudian beliau turun, solat dan berkata, 'Saya melihat Nabi (ﷺ) solat seperti ini, apabila baginda tergesa-gesa semasa dalam perjalanan.' `Abdullah (bin `Umar) menambah, \"Setiap kali Nabi tergesa-gesa, baginda akan menangguhkan solat Maghrib dan kemudian menunaikan tiga rakaat (solat Maghrib) dan melakukan Taslim, dan setelah menunggu seketika, Iqama akan dilaungkan untuk solat Isyak apabila baginda akan menunaikan dua rakaat dan melakukan Taslim. Baginda tidak pernah menunaikan solat sunat sehingga tengah malam (ketika baginda menunaikan solat Tahajjud).\"",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمٌ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم إِذَا أَعْجَلَهُ السَّيْرُ فِي السَّفَرِ يُؤَخِّرُ الْمَغْرِبَ حَتَّى يَجْمَعَ بَيْنَهَا وَبَيْنَ الْعِشَاءِ‏.‏ قَالَ سَالِمٌ وَكَانَ عَبْدُ اللَّهِ يَفْعَلُهُ إِذَا أَعْجَلَهُ السَّيْرُ‏. وَزَادَ اللَّيْثُ قَالَ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ سَالِمٌ كَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ يَجْمَعُ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ بِالْمُزْدَلِفَةِ‏.‏ قَالَ سَالِمٌ وَأَخَّرَ ابْنُ عُمَرَ الْمَغْرِبَ، وَكَانَ اسْتُصْرِخَ عَلَى امْرَأَتِهِ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ فَقُلْتُ لَهُ الصَّلاَةُ‏.‏ فَقَالَ سِرْ‏.‏ فَقُلْتُ الصَّلاَةُ‏.‏ فَقَالَ سِرْ‏.‏ حَتَّى سَارَ مِيلَيْنِ أَوْ ثَلاَثَةً ثُمَّ نَزَلَ فَصَلَّى ثُمَّ قَالَ هَكَذَا رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يُصَلِّي إِذَا أَعْجَلَهُ السَّيْرُ‏.‏ وَقَالَ عَبْدُ اللَّهِ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم إِذَا أَعْجَلَهُ السَّيْرُ يُؤَخِّرُ الْمَغْرِبَ، فَيُصَلِّيهَا ثَلاَثًا ثُمَّ يُسَلِّمُ، ثُمَّ قَلَّمَا يَلْبَثُ حَتَّى يُقِيمَ الْعِشَاءَ فَيُصَلِّيَهَا رَكْعَتَيْنِ ثُمَّ يُسَلِّمُ، وَلاَ يُسَبِّحُ بَعْدَ الْعِشَاءِ حَتَّى يَقُومَ مِنْ جَوْفِ اللَّيْلِ‏.‏"
      },
      {
        "id": 1058,
        "hadith_number": "1093",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi ﷺ Solat di Atas Kenderaan",
        "perawi_melayu": "Diriwayatkan daripada Abdullah bin 'Amir daripada bapanya yang berkata:",
        "english_text": "I saw the Prophet (ﷺ) offering the prayer on his mount (Rahila) whatever direction it took.",
        "malay_translation": "Saya melihat Nabi ﷺ menunaikan solat di atas kenderaannya (Rahila) ke arah mana sahaja kenderaan itu menghadap.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا عَبْدُ الأَعْلَى، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَامِرٍ، عَنْ أَبِيهِ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يُصَلِّي عَلَى رَاحِلَتِهِ حَيْثُ تَوَجَّهَتْ بِهِ‏.‏"
      },
      {
        "id": 1059,
        "hadith_number": "1094",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi ﷺ Menunaikan Solat Sunat di Atas Kenderaan Menghadap Selain Qiblat",
        "perawi_melayu": "Diriwayatkan oleh Jabir bin `Abdullah رضي الله عنهما:",
        "english_text": "The Prophet (ﷺ) used to offer the Nawafil, while riding, facing a direction other than that of the Qibla.",
        "malay_translation": "Nabi ﷺ pernah menunaikan solat-solat sunat (Nawafil) sambil menunggang kenderaan, menghadap ke arah selain daripada arah Qiblat.",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ، أَخْبَرَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي التَّطَوُّعَ وَهْوَ رَاكِبٌ فِي غَيْرِ الْقِبْلَةِ‏.‏"
      },
      {
        "id": 1060,
        "hadith_number": "1095",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Sunat dan Witir di Atas Kenderaan Semasa Musafir",
        "perawi_melayu": "Diriwayatkan oleh Nafi':",
        "english_text": "Ibn `Umar رضی اللہ عنہما (while on a journey) used to offer the prayer and the witr on his mount (Rahila). He said that the Prophet (ﷺ) used to do so.",
        "malay_translation": "Ibnu Umar رضی اللہ عنہما (semasa dalam perjalanan) selalu menunaikan solat sunat dan witir di atas kenderaannya (Rahila). Beliau berkata bahawa Nabi Muhammad (ﷺ) juga melakukan sedemikian.",
        "arabic_text": "حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، قَالَ حَدَّثَنَا وُهَيْبٌ، قَالَ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، قَالَ وَكَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ يُصَلِّي عَلَى رَاحِلَتِهِ وَيُوتِرُ عَلَيْهَا، وَيُخْبِرُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَفْعَلُهُ‏.‏"
      },
      {
        "id": 1061,
        "hadith_number": "1096",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Sunat di Atas Kenderaan Semasa Musafir",
        "perawi_melayu": "Diriwayatkan daripada Abdullah bin Dinar:",
        "english_text": "On traveling, `Abdullah bin `Umar رضی اللہ عنہما used to offer the prayer on his Mount by signs whatever direction it took. `Abdullah said that the Prophet (ﷺ) used to do so.",
        "malay_translation": "Ketika bermusafir, Abdullah bin Umar رضی اللہ عنہما biasanya menunaikan solat di atas kenderaannya dengan isyarat, ke arah mana sahaja kenderaan itu menghadap. Abdullah berkata bahawa Nabi (ﷺ) juga melakukan sedemikian.",
        "arabic_text": "حَدَّثَنَا مُوسَى، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، قَالَ كَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ ـ رضى الله عنهما ـ يُصَلِّي فِي السَّفَرِ عَلَى رَاحِلَتِهِ، أَيْنَمَا تَوَجَّهَتْ يُومِئُ‏.‏ وَذَكَرَ عَبْدُ اللَّهِ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَفْعَلُهُ‏.‏"
      },
      {
        "id": 1062,
        "hadith_number": "1097",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi Muhammad SAW Menunaikan Solat Sunat di atas Kenderaan dengan Isyarat Kepala",
        "perawi_melayu": "Diriwayatkan daripada 'Amir bin Rabi`a:",
        "english_text": "I saw the Prophet (ﷺ) on his Mount praying Nawafil by nodding his head, whatever direction he faced, but Allah's Messenger (ﷺ) never did the same in offering the compulsory prayers.",
        "malay_translation": "Aku melihat Nabi Muhammad SAW di atas kenderaannya menunaikan solat-solat sunat dengan menganggukkan kepalanya ke arah mana sahaja beliau menghadap, tetapi Rasulullah SAW tidak pernah melakukan yang demikian dalam menunaikan solat fardhu.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ، أَنَّ عَامِرَ بْنَ رَبِيعَةَ، أَخْبَرَهُ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهْوَ عَلَى الرَّاحِلَةِ يُسَبِّحُ، يُومِئُ بِرَأْسِهِ قِبَلَ أَىِّ وَجْهٍ تَوَجَّهَ، وَلَمْ يَكُنْ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصْنَعُ ذَلِكَ فِي الصَّلاَةِ الْمَكْتُوبَةِ‏.‏"
      },
      {
        "id": 1063,
        "hadith_number": "1098",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Sunat dan Witir di Atas Kenderaan dalam Perjalanan",
        "perawi_melayu": "Diriwayatkan oleh Salim:",
        "english_text": "At night `Abdullah bin `Umar رضی اللہ عنۄما used to offer the prayer on the back of his animal during the journey and never cared about the direction he faced. Ibn `Umar رضی اللہ عنۄما said, \"Allah's Messenger (ﷺ) used to offer the optional prayer on the back of his Mount facing any direction and also used to pray the witr on it but never offered the compulsory prayer on it.\"",
        "malay_translation": "Pada waktu malam, Abdullah bin Umar رضی اللہ عنۄما biasanya menunaikan solat di atas belakang haiwannya semasa dalam perjalanan dan tidak mengambil berat arah mana yang dihadapinya. Ibn `Umar رضی اللہ عنۄما berkata, \"Rasulullah (ﷺ) biasanya menunaikan solat sunat di atas belakang kenderaannya menghadap ke mana-mana arah dan juga menunaikan solat witir di atasnya, tetapi tidak pernah menunaikan solat fardhu di atasnya.\"",
        "arabic_text": "وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ قَالَ سَالِمٌ كَانَ عَبْدُ اللَّهِ يُصَلِّي عَلَى دَابَّتِهِ مِنَ اللَّيْلِ وَهْوَ مُسَافِرٌ، مَا يُبَالِي حَيْثُ مَا كَانَ وَجْهُهُ‏.‏ قَالَ ابْنُ عُمَرَ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُسَبِّحُ عَلَى الرَّاحِلَةِ قِبَلَ أَىِّ وَجْهٍ تَوَجَّهَ، وَيُوتِرُ عَلَيْهَا، غَيْرَ أَنَّهُ لاَ يُصَلِّي عَلَيْهَا الْمَكْتُوبَةَ‏.‏"
      },
      {
        "id": 1064,
        "hadith_number": "1099",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi ﷺ Menunaikan Solat Sunat di Atas Kenderaan dan Menghadap Kiblat Ketika Solat Fardhu",
        "perawi_melayu": "Diriwayatkan oleh Jabir bin `Abdullah رضي الله عنهما:",
        "english_text": "The Prophet (ﷺ) used to pray (the Nawafil) on his Mount facing east and whenever he wanted to offer the compulsory prayer, he used to dismount and face the Qibla.",
        "malay_translation": "Nabi ﷺ biasa menunaikan solat sunat di atas kenderaannya menghadap ke timur, dan setiap kali baginda ingin menunaikan solat fardhu, baginda akan turun dari kenderaan dan menghadap ke arah Kiblat.",
        "arabic_text": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ، قَالَ حَدَّثَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي عَلَى رَاحِلَتِهِ نَحْوَ الْمَشْرِقِ فَإِذَا أَرَادَ أَنْ يُصَلِّيَ الْمَكْتُوبَةَ نَزَلَ فَاسْتَقْبَلَ الْقِبْلَةَ‏.‏"
      },
      {
        "id": 1065,
        "hadith_number": "1100",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Sunat di Atas Kenderaan Menghadap Selain Kiblat",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Seereen:",
        "english_text": "We went to receive Anas bin Malik رضی اللہ عنہ when he returned from Sham and met him at a place called 'Ainat- Tamr. I saw him praying riding the donkey, with his face to this direction, i.e. to the left of the Qibla. I said to him, \"I have seen you offering the prayer in a direction other than that of the Qibla.\" He replied, \"If I had not seen Allah's Messenger (ﷺ) doing it, I would not have done it.\"\r\nIbn-e- Tahman reported it from Hajjaj, he from Anas bin sireen, he from Hadrat Anas رضی اللہ عنہ and he from the prophet (ﷺ).",
        "malay_translation": "Kami pergi untuk menyambut Anas bin Malik رضی اللہ عنہ ketika beliau pulang dari Sham dan bertemu dengannya di suatu tempat bernama 'Ainat-Tamr. Saya melihat beliau solat di atas keldai, dengan wajahnya menghadap ke arah ini, iaitu ke kiri Kiblat. Saya berkata kepadanya, \"Saya melihat anda menunaikan solat ke arah selain daripada arah Kiblat.\" Beliau menjawab, \"Jika saya tidak melihat Rasulullah (ﷺ) melakukannya, saya tidak akan melakukannya.\"\r\nIbn-e- Tahman meriwayatkannya daripada Hajjaj, beliau daripada Anas bin Sireen, beliau daripada Hadrat Anas رضی اللہ عنہ dan beliau daripada Nabi (ﷺ).",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا حَبَّانُ، قَالَ حَدَّثَنَا هَمَّامٌ، قَالَ حَدَّثَنَا أَنَسُ بْنُ سِيرِينَ، قَالَ اسْتَقْبَلْنَا أَنَسًا حِينَ قَدِمَ مِنَ الشَّأْمِ، فَلَقِينَاهُ بِعَيْنِ التَّمْرِ، فَرَأَيْتُهُ يُصَلِّي عَلَى حِمَارٍ وَوَجْهُهُ مِنْ ذَا الْجَانِبِ، يَعْنِي عَنْ يَسَارِ الْقِبْلَةِ‏.‏ فَقُلْتُ رَأَيْتُكَ تُصَلِّي لِغَيْرِ الْقِبْلَةِ‏.‏ فَقَالَ لَوْلاَ أَنِّي رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَعَلَهُ لَمْ أَفْعَلْهُ‏.‏ رَوَاهُ ابْنُ طَهْمَانَ عَنْ حَجَّاجٍ عَنْ أَنَسِ بْنِ سِيرِينَ عَنْ أَنَسٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 1066,
        "hadith_number": "1101",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah ﷺ Tidak Menunaikan Solat Sunat Semasa Musafir",
        "perawi_melayu": "Diriwayatkan oleh Hafs bin `Asim:",
        "english_text": "Ibn `Umar رضی اللہ عنہما went on a journey and said, \"I accompanied the Prophet (ﷺ) and he did not offer optional prayers during the journey, and Allah says: 'Verily! In Allah's Messenger (ﷺ) you have a good example to follow.' \" (33.21)",
        "malay_translation": "Ibnu Umar رضي الله عنهما telah pergi dalam perjalanan dan berkata, \"Saya menemani Nabi ﷺ dan baginda tidak menunaikan solat sunat semasa perjalanan, dan Allah berfirman: 'Sesungguhnya! Pada Rasulullah ﷺ itu terdapat suri teladan yang baik untuk kamu ikuti.'\" (33:21)",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ حَدَّثَنِي عُمَرُ بْنُ مُحَمَّدٍ، أَنَّ حَفْصَ بْنَ عَاصِمٍ، حَدَّثَهُ قَالَ سَافَرَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ فَقَالَ صَحِبْتُ النَّبِيَّ صلى الله عليه وسلم فَلَمْ أَرَهُ يُسَبِّحُ فِي السَّفَرِ، وَقَالَ اللَّهُ جَلَّ ذِكْرُهُ ‏{‏لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ‏}‏‏.‏"
      },
      {
        "id": 1067,
        "hadith_number": "1102",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Mengerjakan Dua Rakaat Semasa Musafir",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Umar RA:",
        "english_text": "I accompanied Allah's Messenger (ﷺ) and he never offered more than two rak`at during the journey. Abu Bakr, `Umar and `Uthman رضی اللہ عنہم used to do the same.",
        "malay_translation": "Aku menemani Rasulullah SAW dan baginda tidak pernah mengerjakan lebih daripada dua rakaat semasa dalam perjalanan (musafir). Abu Bakr, Umar dan Uthman RA juga melakukan perkara yang sama.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عِيسَى بْنِ حَفْصِ بْنِ عَاصِمٍ، قَالَ حَدَّثَنِي أَبِي أَنَّهُ، سَمِعَ ابْنَ عُمَرَ، يَقُولُ صَحِبْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَكَانَ لاَ يَزِيدُ فِي السَّفَرِ عَلَى رَكْعَتَيْنِ، وَأَبَا بَكْرٍ وَعُمَرَ وَعُثْمَانَ كَذَلِكَ ـ رضى الله عنهم‏.‏"
      },
      {
        "id": 1068,
        "hadith_number": "1103",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Dhuha Nabi Muhammad SAW pada Hari Pembukaan Kota Mekah",
        "perawi_melayu": "Diriwayatkan oleh Ibn Abu Laila:",
        "english_text": "Only Um Hani رضی اللہ عنہا told us that she had seen the Prophet (ﷺ) offering the Duha (forenoon prayer). She said, \"On the day of the conquest of Mecca, the Prophet (ﷺ) took a bath in my house and offered eight rak`at. I never saw him praying such a light prayer but he performed perfect prostration and bowing.",
        "malay_translation": "Hanya Um Hani رضی اللہ عنہا memberitahu kami bahawa beliau telah melihat Nabi Muhammad SAW menunaikan solat Dhuha. Beliau berkata, \"Pada hari pembukaan Kota Mekah, Nabi Muhammad SAW mandi di rumahku dan menunaikan lapan rakaat. Aku tidak pernah melihat baginda menunaikan solat seringan itu, tetapi baginda melakukan sujud dan rukuk dengan sempurna.",
        "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرٍو، عَنِ ابْنِ أَبِي لَيْلَى، قَالَ مَا أَنْبَأَ أَحَدٌ، أَنَّهُ رَأَى النَّبِيَّ صلى الله عليه وسلم صَلَّى الضُّحَى غَيْرُ أُمِّ هَانِئٍ ذَكَرَتْ أَنَّ النَّبِيَّ صلى الله عليه وسلم يَوْمَ فَتْحِ مَكَّةَ اغْتَسَلَ فِي بَيْتِهَا، فَصَلَّى ثَمَانِ رَكَعَاتٍ، فَمَا رَأَيْتُهُ صَلَّى صَلاَةً أَخَفَّ مِنْهَا، غَيْرَ أَنَّهُ يُتِمُّ الرُّكُوعَ وَالسُّجُودَ‏.‏"
      },
      {
        "id": 1069,
        "hadith_number": "1104",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi Muhammad ﷺ Solat Sunat di Atas Kenderaan Semasa Perjalanan",
        "perawi_melayu": "Diriwayatkan daripada 'Abdullah bin Amir bahawa bapanya telah memberitahunya bahawa:",
        "english_text": "He had seen the Prophet (ﷺ) praying Nawafil at night on the back of his Mount on a journey, facing whatever direction it took.",
        "malay_translation": "Beliau telah melihat Nabi Muhammad ﷺ menunaikan solat-solat sunat (Nawafil) pada waktu malam di atas belakang kenderaannya semasa dalam perjalanan, menghadap ke mana sahaja kenderaan itu menghala.",
        "arabic_text": "وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَامِرٍ، أَنَّ أَبَاهُ، أَخْبَرَهُ أَنَّهُ، رَأَى النَّبِيَّ صلى الله عليه وسلم صَلَّى السُّبْحَةَ بِاللَّيْلِ فِي السَّفَرِ عَلَى ظَهْرِ رَاحِلَتِهِ حَيْثُ تَوَجَّهَتْ بِهِ‏.‏"
      },
      {
        "id": 1070,
        "hadith_number": "1105",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Sunat di Atas Kenderaan",
        "perawi_melayu": "Diriwayatkan oleh Salim bin `Abdullah Ibn `Umar رضی اللہ عنہما :",
        "english_text": "\"Allah's Messenger (ﷺ) used to pray the Nawafil on the back of his Mount (carriage) by signs facing any direction.\" Ibn `Umar رضی اللہ عنہما used to do the same.",
        "malay_translation": "\"Rasulullah (ﷺ) biasa menunaikan solat-solat sunat di atas kenderaannya dengan isyarat menghadap ke mana sahaja arahnya.\" Ibn `Umar رضی اللہ عنہما juga melakukan perkara yang sama.",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُسَبِّحُ عَلَى ظَهْرِ رَاحِلَتِهِ حَيْثُ كَانَ وَجْهُهُ، يُومِئُ بِرَأْسِهِ، وَكَانَ ابْنُ عُمَرَ يَفْعَلُهُ‏.‏"
      },
      {
        "id": 1071,
        "hadith_number": "1106",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi ﷺ Menunaikan Solat Maghrib dan Isyak Bersama Semasa dalam Perjalanan",
        "perawi_melayu": "Diriwayatkan daripada bapa Salim:",
        "english_text": "The Prophet (ﷺ) used to offer the Maghrib and `Isha' prayers together whenever he was in a hurry on a journey.",
        "malay_translation": "Nabi ﷺ biasanya menunaikan solat Maghrib dan Isyak bersama-sama apabila baginda tergesa-gesa dalam perjalanan.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ الزُّهْرِيَّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَجْمَعُ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ إِذَا جَدَّ بِهِ السَّيْرُ‏.‏"
      },
      {
        "id": 1072,
        "hadith_number": "1107",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menjamak Solat Zohor dan Asar serta Maghrib dan Isyak dalam Perjalanan",
        "perawi_melayu": "Diriwayatkan daripada Ibn `Abbas RA:",
        "english_text": "Allah's Messenger (ﷺ) used to offer the Zuhr and `Asr prayers together on journeys, and also used to offer the Maghrib and `Isha' prayers together.",
        "malay_translation": "Rasulullah SAW pernah menjamak solat Zohor dan Asar ketika dalam perjalanan, dan juga menjamak solat Maghrib dan Isyak.",
        "arabic_text": "وَقَالَ إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنِ الْحُسَيْنِ الْمُعَلِّمِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَجْمَعُ بَيْنَ صَلاَةِ الظُّهْرِ وَالْعَصْرِ إِذَا كَانَ عَلَى ظَهْرِ سَيْرٍ، وَيَجْمَعُ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ‏.‏"
      },
      {
        "id": 1073,
        "hadith_number": "1108",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menggabungkan Solat Maghrib dan Isyak Ketika Musafir",
        "perawi_melayu": "Diriwayatkan oleh Anas RA:",
        "english_text": "Allah's Messenger (ﷺ) used to offer these two prayers together on journeys i.e. the Maghrib and the `Isha'.\r\nAli bin Mubarak corroborated him. Harb, Yahya, Hafs, Hadrat Anas رضی اللہ عنہ report: The prophet (ﷺ) combined (two prayers).",
        "malay_translation": "Rasulullah SAW biasa mengerjakan dua solat ini bersama-sama ketika dalam perjalanan, iaitu solat Maghrib dan Isyak.\r\nAli bin Mubarak menguatkan riwayat ini. Harb, Yahya, Hafs, Hadrat Anas RA meriwayatkan: Nabi SAW menggabungkan (dua solat).",
        "arabic_text": "وَعَنْ حُسَيْنٍ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ حَفْصِ بْنِ عُبَيْدِ اللَّهِ بْنِ أَنَسٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَجْمَعُ بَيْنَ صَلاَةِ الْمَغْرِبِ وَالْعِشَاءِ فِي السَّفَرِ‏.‏ وَتَابَعَهُ عَلِيُّ بْنُ الْمُبَارَكِ وَحَرْبٌ عَنْ يَحْيَى عَنْ حَفْصٍ عَنْ أَنَسٍ جَمَعَ النَّبِيُّ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 1074,
        "hadith_number": "1109",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menangguhkan Solat Maghrib dan Menunaikannya Bersama Isyak Semasa Bermusafir",
        "perawi_melayu": "Diriwayatkan daripada `Abdullah bin `Umar رضی اللہ عنہما :",
        "english_text": "'I saw Allah's Messenger (ﷺ) delaying the Maghrib prayer till he offered it along with the `Isha prayer whenever he was in a hurry during the journey.' \" Salim said, \"Abdullah bin `Umar رضی اللہ عنہما used to do the same whenever he was in a hurry during the journey. After making the call for Iqama, for the Maghrib prayer he used to offer three rak`at and then perform Taslim. After waiting for a short while, he would pronounce the Iqama for the `Isha' prayer and offer two rak`at and perform Taslim. He never prayed any Nawafil in between the two prayers or after the `Isha' prayers till he got up in the middle of the night (for Tahajjud prayer).\"",
        "malay_translation": "'Saya melihat Rasulullah (ﷺ) menangguhkan solat Maghrib sehingga baginda menunaikannya bersama solat Isyak setiap kali baginda tergesa-gesa semasa dalam perjalanan.' Salim berkata, \"Abdullah bin `Umar رضی اللہ عنہما juga melakukan perkara yang sama setiap kali beliau tergesa-gesa semasa dalam perjalanan. Selepas melakukan panggilan untuk Iqama, untuk solat Maghrib beliau akan menunaikan tiga rakaat dan kemudian melakukan Taslim. Selepas menunggu seketika, beliau akan menyebut Iqama untuk solat Isyak dan menunaikan dua rakaat dan melakukan Taslim. Beliau tidak pernah menunaikan solat Nawafil di antara kedua-dua solat atau selepas solat Isyak sehingga beliau bangun di tengah malam (untuk solat Tahajjud).\"",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمٌ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم إِذَا أَعْجَلَهُ السَّيْرُ فِي السَّفَرِ يُؤَخِّرُ صَلاَةَ الْمَغْرِبِ، حَتَّى يَجْمَعَ بَيْنَهَا وَبَيْنَ الْعِشَاءِ‏.‏ قَالَ سَالِمٌ وَكَانَ عَبْدُ اللَّهِ يَفْعَلُهُ إِذَا أَعْجَلَهُ السَّيْرُ، وَيُقِيمُ الْمَغْرِبَ فَيُصَلِّيهَا ثَلاَثًا، ثُمَّ يُسَلِّمُ، ثُمَّ قَلَّمَا يَلْبَثُ حَتَّى يُقِيمَ الْعِشَاءَ، فَيُصَلِّيهَا رَكْعَتَيْنِ، ثُمَّ يُسَلِّمُ وَلاَ يُسَبِّحُ بَيْنَهَا بِرَكْعَةٍ، وَلاَ بَعْدَ الْعِشَاءِ بِسَجْدَةٍ حَتَّى يَقُومَ مِنْ جَوْفِ اللَّيْلِ‏.‏"
      },
      {
        "id": 1075,
        "hadith_number": "1110",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menggabungkan Solat Maghrib dan Isyak dalam Perjalanan",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik RA:",
        "english_text": "During a journey, the Prophet (ﷺ) would combine both these prayers i.e the Maghrib and the Isha.",
        "malay_translation": "Ketika dalam perjalanan, Nabi SAW menggabungkan kedua-dua solat ini iaitu Maghrib dan Isyak.",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا حَرْبٌ، حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنِي حَفْصُ بْنُ عُبَيْدِ اللَّهِ بْنِ أَنَسٍ، أَنَّ أَنَسًا ـ رضى الله عنه ـ حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَجْمَعُ بَيْنَ هَاتَيْنِ الصَّلاَتَيْنِ فِي السَّفَرِ‏.‏ يَعْنِي الْمَغْرِبَ وَالْعِشَاءَ‏.‏"
      },
      {
        "id": 1076,
        "hadith_number": "1111",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menunda Solat Zuhur Ketika Dalam Perjalanan",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik RA:",
        "english_text": "Whenever the Prophet (ﷺ) started the journey before noon, he used to delay the Zuhr prayer till the time for the `Asr prayer and then he would dismount and pray them together; and whenever the sun declined before he started the journey he used to offer the Zuhr prayer and then ride (for the journey).",
        "malay_translation": "Setiap kali Nabi SAW memulakan perjalanan sebelum tengah hari, baginda akan menunda solat Zuhur sehingga waktu solat Asar, kemudian baginda akan turun dan menunaikan kedua-duanya bersama-sama; dan setiap kali matahari tergelincir sebelum baginda memulakan perjalanan, baginda akan menunaikan solat Zuhur terlebih dahulu dan kemudian menunggang (untuk perjalanan).",
        "arabic_text": "حَدَّثَنَا حَسَّانُ الْوَاسِطِيُّ، قَالَ حَدَّثَنَا الْمُفَضَّلُ بْنُ فَضَالَةَ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا ارْتَحَلَ قَبْلَ أَنْ تَزِيغَ الشَّمْسُ أَخَّرَ الظُّهْرَ إِلَى وَقْتِ الْعَصْرِ، ثُمَّ يَجْمَعُ بَيْنَهُمَا، وَإِذَا زَاغَتْ صَلَّى الظُّهْرَ ثُمَّ رَكِبَ‏.‏"
      },
      {
        "id": 1077,
        "hadith_number": "1112",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menangguhkan Solat Zuhur Ketika Bermusafir",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik RA:",
        "english_text": "Whenever the Prophet (ﷺ) started on a journey before noon, he used to delay the Zuhr prayers till the time for the 'Asr prayer and then he would dismount and offer them together; and whenever the sun declined before he started on a journey he used to offer the Zuhr prayers and then ride (for journey).",
        "malay_translation": "Setiap kali Nabi SAW memulakan perjalanan sebelum tengah hari, baginda akan menangguhkan solat Zuhur sehingga waktu Asar, kemudian baginda akan turun dan menunaikan kedua-duanya bersama-sama. Dan setiap kali matahari tergelincir sebelum baginda memulakan perjalanan, baginda akan menunaikan solat Zuhur terlebih dahulu kemudian menunggang (untuk meneruskan perjalanan).",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا الْمُفَضَّلُ بْنُ فَضَالَةَ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا ارْتَحَلَ قَبْلَ أَنْ تَزِيغَ الشَّمْسُ أَخَّرَ الظُّهْرَ إِلَى وَقْتِ الْعَصْرِ، ثُمَّ نَزَلَ فَجَمَعَ بَيْنَهُمَا، فَإِنْ زَاغَتِ الشَّمْسُ قَبْلَ أَنْ يَرْتَحِلَ صَلَّى الظُّهْرَ ثُمَّ رَكِبَ‏.‏"
      },
      {
        "id": 1078,
        "hadith_number": "1113",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Imam Ketika Sakit dan Makmum Mengikutinya",
        "perawi_melayu": "Diriwayatkan daripada `Aisha رضی اللہ عنہا :",
        "english_text": "Allah's Messenger (ﷺ) prayed in his house while sitting during his illness and the people prayed behind him standing and he pointed to them to sit down. When he had finished the prayer, he said, \"The Imam is to be followed and so when he bows you should bow; and when he lifts his head you should also do the same.\"",
        "malay_translation": "Rasulullah (ﷺ) solat di rumahnya sambil duduk ketika sakit, dan orang ramai solat di belakangnya dalam keadaan berdiri, lalu Baginda memberi isyarat kepada mereka untuk duduk. Apabila Baginda selesai solat, Baginda bersabda, \"Imam itu untuk diikuti, maka apabila dia rukuk, hendaklah kamu rukuk; dan apabila dia mengangkat kepalanya (iktidal), hendaklah kamu juga melakukan yang sama.\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتْ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي بَيْتِهِ وَهْوَ شَاكٍ، فَصَلَّى جَالِسًا وَصَلَّى وَرَاءَهُ قَوْمٌ قِيَامًا، فَأَشَارَ إِلَيْهِمْ أَنِ اجْلِسُوا، فَلَمَّا انْصَرَفَ قَالَ ‏ \"‏ إِنَّمَا جُعِلَ الإِمَامُ لِيُؤْتَمَّ بِهِ، فَإِذَا رَكَعَ فَارْكَعُوا، وَإِذَا رَفَعَ فَارْفَعُوا ‏\"‏‏.‏"
      },
      {
        "id": 1079,
        "hadith_number": "1114",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Jatuh dari Kuda dan Solat Duduk",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik RA:",
        "english_text": "Allah's Messenger (ﷺ)  fell down from a horse and his right side was either injured or scratched, so we went to inquire about his health. The time for the prayer became due and he offered the prayer while sitting and we prayed while standing. He said, \"The Imam is to be followed; so if he says Takbir, you should also say Takbir, and if he bows you should also bow; and when he lifts his head you should also do the same and if he says: Sami`a l-lahu liman hamidah (Allah hears whoever sends his praises to Him) you should say: Rabbana walakal-Hamd (O our Lord! All the praises are for You.\") (See Hadith No. 656 Vol. 1).",
        "malay_translation": "Rasulullah SAW jatuh dari seekor kuda dan bahagian kanan baginda sama ada cedera atau tercalar, jadi kami pergi bertanya tentang kesihatan baginda. Apabila tiba waktu solat, baginda solat dengan duduk dan kami solat dengan berdiri. Baginda bersabda, \"Imam itu untuk diikuti; jadi jika dia mengucapkan Takbir, kamu juga harus mengucapkan Takbir, dan jika dia rukuk kamu juga harus rukuk; dan apabila dia mengangkat kepalanya kamu juga harus melakukan perkara yang sama dan jika dia berkata: Sami`a l-lahu liman hamidah (Allah mendengar sesiapa yang memuji-Nya) kamu harus berkata: Rabbana walakal-Hamd (Ya Tuhan kami! Segala puji hanya untuk-Mu).\") (Lihat Hadith No. 656 Jilid 1).",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ سَقَطَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ فَرَسٍ فَخُدِشَ ـ أَوْ فَجُحِشَ ـ شِقُّهُ الأَيْمَنُ، فَدَخَلْنَا عَلَيْهِ نَعُودُهُ، فَحَضَرَتِ الصَّلاَةُ فَصَلَّى قَاعِدًا فَصَلَّيْنَا قُعُودًا وَقَالَ ‏ \"‏ إِنَّمَا جُعِلَ الإِمَامُ لِيُؤْتَمَّ بِهِ، فَإِذَا كَبَّرَ فَكَبِّرُوا وَإِذَا رَكَعَ فَارْكَعُوا، وَإِذَا رَفَعَ فَارْفَعُوا، وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ‏.‏ فَقُولُوا رَبَّنَا وَلَكَ الْحَمْدُ ‏\"‏‏.‏"
      },
      {
        "id": 1080,
        "hadith_number": "1115",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keutamaan Solat Berdiri, Duduk dan Berbaring",
        "perawi_melayu": "Diriwayatkan daripada `Imran bin Husain رضی اللہ عنہما:",
        "english_text": "(who had piles) I asked Allah's Messenger (ﷺ) about the praying of a man while sitting. He said, \"If he prays while standing it is better and he who prays while sitting gets half the reward of that who prays standing; and whoever prays while Lying gets half the reward of that who prays while sitting.\"",
        "malay_translation": "(yang menghidap buasir) Saya bertanya kepada Rasulullah (ﷺ) tentang solat seorang lelaki sambil duduk. Baginda bersabda, \"Jika dia solat sambil berdiri, itu lebih baik, dan sesiapa yang solat sambil duduk mendapat separuh ganjaran orang yang solat berdiri; dan sesiapa yang solat sambil berbaring mendapat separuh ganjaran orang yang solat sambil duduk.\"",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، أَخْبَرَنَا حُسَيْنٌ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ ـ رضى الله عنه ـ أَنَّهُ سَأَلَ نَبِيَّ اللَّهِ صلى الله عليه وسلم‏.‏ أَخْبَرَنَا إِسْحَاقُ قَالَ أَخْبَرَنَا عَبْدُ الصَّمَدِ قَالَ سَمِعْتُ أَبِي قَالَ حَدَّثَنَا الْحُسَيْنُ عَنِ ابْنِ بُرَيْدَةَ قَالَ حَدَّثَنِي عِمْرَانُ بْنُ حُصَيْنٍ ـ وَكَانَ مَبْسُورًا ـ قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ صَلاَةِ الرَّجُلِ قَاعِدًا فَقَالَ ‏ \"‏ إِنْ صَلَّى قَائِمًا فَهْوَ أَفْضَلُ، وَمَنْ صَلَّى قَاعِدًا فَلَهُ نِصْفُ أَجْرِ الْقَائِمِ، وَمَنْ صَلَّى نَائِمًا فَلَهُ نِصْفُ أَجْرِ الْقَاعِدِ ‏\"‏‏.‏"
      },
      {
        "id": 1081,
        "hadith_number": "1116",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keutamaan Solat Berdiri, Duduk dan Berbaring",
        "perawi_melayu": "Diriwayatkan daripada `Abdullah bin Buraida:",
        "english_text": "\"I asked the Prophet (ﷺ) about the prayer of a person while sitting. He said, 'It is better for one to pray standing; and whoever prays sitting gets half the reward of that who prays while standing; and whoever prays while Lying gets half the reward of that who prays while sitting.' \"\r\nAbu Abdullah Bukhari said: In my views, here  \"نَائِمًا\" means to lie down.",
        "malay_translation": "\"Saya bertanya kepada Nabi (ﷺ) tentang solat seseorang ketika duduk. Baginda bersabda, 'Adalah lebih baik bagi seseorang untuk solat berdiri; dan sesiapa yang solat sambil duduk akan mendapat separuh pahala daripada orang yang solat sambil berdiri; dan sesiapa yang solat sambil berbaring akan mendapat separuh pahala daripada orang yang solat sambil duduk.' \"\r\nAbu Abdullah Bukhari berkata: Pada pendapat saya, di sini \"نَائِمًا\" bermaksud berbaring.",
        "arabic_text": "حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، أَنَّ عِمْرَانَ بْنَ حُصَيْنٍ ـ وَكَانَ رَجُلاً مَبْسُورًا ـ وَقَالَ أَبُو مَعْمَرٍ مَرَّةً عَنْ عِمْرَانَ، قَالَ سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم عَنْ صَلاَةِ الرَّجُلِ وَهْوَ قَاعِدٌ فَقَالَ ‏ \"‏ مَنْ صَلَّى قَائِمًا فَهْوَ أَفْضَلُ، وَمَنْ صَلَّى قَاعِدًا فَلَهُ نِصْفُ أَجْرِ الْقَائِمِ، وَمَنْ صَلَّى نَائِمًا فَلَهُ نِصْفُ أَجْرِ الْقَاعِدِ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ نَائِمًا عِنْدِي مُضْطَجِعًا هَا هُنَا‏.‏"
      },
      {
        "id": 1082,
        "hadith_number": "1117",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Solat Bagi Orang yang Sakit Buasir",
        "perawi_melayu": "Diriwayatkan daripada `Imran bin Husain RA:",
        "english_text": "I had piles, so I asked the Prophet (ﷺ) about the prayer. He said, \"Pray while standing and if you can't, pray while sitting and if you cannot do even that, then pray Lying on your side.\"",
        "malay_translation": "Aku menghidap buasir, jadi aku bertanya kepada Nabi SAW tentang solat. Baginda bersabda, \"Solatlah sambil berdiri, dan jika kamu tidak mampu, solatlah sambil duduk, dan jika kamu tidak mampu melakukan itu juga, maka solatlah dengan berbaring mengiring.\"",
        "arabic_text": "حَدَّثَنَا عَبْدَانُ، عَنْ عَبْدِ اللَّهِ، عَنْ إِبْرَاهِيمَ بْنِ طَهْمَانَ، قَالَ حَدَّثَنِي الْحُسَيْنُ الْمُكْتِبُ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ ـ رضى الله عنه ـ قَالَ كَانَتْ بِي بَوَاسِيرُ فَسَأَلْتُ النَّبِيَّ صلى الله عليه وسلم عَنِ الصَّلاَةِ فَقَالَ ‏ \"‏ صَلِّ قَائِمًا، فَإِنْ لَمْ تَسْتَطِعْ فَقَاعِدًا، فَإِنْ لَمْ تَسْتَطِعْ فَعَلَى جَنْبٍ ‏\"‏‏.‏"
      },
      {
        "id": 1083,
        "hadith_number": "1118",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah S.A.W. Menunaikan Solat Malam Dalam Keadaan Duduk Ketika Tua",
        "perawi_melayu": "Diriwayatkan oleh Aisyah, Ummul Mukminin R.A.:",
        "english_text": "I never saw Allah's Messenger (ﷺ) offering the night prayer while sitting except in his old age and then he used to recite while sitting and whenever he wanted to bow he would get up and recite thirty or forty verses (while standing) and then bow.",
        "malay_translation": "Aku tidak pernah melihat Rasulullah S.A.W. menunaikan solat malam dalam keadaan duduk kecuali ketika baginda sudah tua. Baginda S.A.W. membaca (Al-Quran) sambil duduk, dan setiap kali hendak rukuk, baginda akan bangun dan membaca tiga puluh atau empat puluh ayat (sambil berdiri) kemudian barulah rukuk.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أُمِّ الْمُؤْمِنِينَ أَنَّهَا أَخْبَرَتْهُ أَنَّهَا لَمْ تَرَ رَسُولَ اللَّهِ صلى الله عليه وسلم يُصَلِّي صَلاَةَ اللَّيْلِ قَاعِدًا قَطُّ حَتَّى أَسَنَّ، فَكَانَ يَقْرَأُ قَاعِدًا حَتَّى إِذَا أَرَادَ أَنْ يَرْكَعَ قَامَ، فَقَرَأَ نَحْوًا مِنْ ثَلاَثِينَ آيَةً أَوْ أَرْبَعِينَ آيَةً، ثُمَّ رَكَعَ‏.‏"
      },
      {
        "id": 1084,
        "hadith_number": "1119",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah S.A.W. Solat Duduk di Akhir Hayatnya",
        "perawi_melayu": "Diriwayatkan daripada `Aisha, ibu kaum mukminin R.A.:",
        "english_text": "Allah's Messenger (ﷺ) (in his last days) used to pray sitting. He would recite while sitting, and when thirty or forty verses remained from the recitation he would get up and recite them while standing and then he would bow and prostrate. He used to do the same in the second rak`a. After finishing the Prayer he used to look at me and if I was awake he would talk to me and if I was asleep, he would lie down.",
        "malay_translation": "Rasulullah S.A.W. (pada hari-hari terakhirnya) biasanya solat dengan duduk. Baginda membaca (Al-Quran) sambil duduk, dan apabila tinggal tiga puluh atau empat puluh ayat daripada bacaan itu, baginda akan bangun dan membacanya sambil berdiri, kemudian baginda akan rukuk dan sujud. Baginda melakukan perkara yang sama pada rakaat kedua. Selepas selesai solat, baginda akan melihat kepada saya, dan jika saya berjaga, baginda akan bercakap dengan saya, dan jika saya tidur, baginda akan berbaring.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، وَأَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ ـ رضى الله عنها ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي جَالِسًا فَيَقْرَأُ وَهْوَ جَالِسٌ، فَإِذَا بَقِيَ مِنْ قِرَاءَتِهِ نَحْوٌ مِنْ ثَلاَثِينَ أَوْ أَرْبَعِينَ آيَةً قَامَ فَقَرَأَهَا وَهْوَ قَائِمٌ، ثُمَّ يَرْكَعُ ثُمَّ يَسْجُدُ، يَفْعَلُ فِي الرَّكْعَةِ الثَّانِيَةِ مِثْلَ ذَلِكَ، فَإِذَا قَضَى صَلاَتَهُ نَظَرَ، فَإِنْ كُنْتُ يَقْظَى تَحَدَّثَ مَعِي، وَإِنْ كُنْتُ نَائِمَةً اضْطَجَعَ‏.‏"
      }
    ]
  }
}