{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 6,
    "data": [
      {
        "id": 2447,
        "hadith_number": "2560",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Barirah, 'Aishah, dan Hukum Wala'",
        "perawi_melayu": "Diriwayatkan oleh 'Aishah رضي الله عنها :",
        "english_text": "Barira رضی اللۀا came to seek her help writing of emancipation and she had to pay five Uqiya (of gold) by five yearly installments. 'Aishah رضی اللۀا said to her, \"Do you think that if I pay the whole sum at once, your masters will sell you to me, and I will free you and your Wala' will be for me.\" Barira رضی اللۀا went to her masters and told them about that offer. They said that they would not agree to it unless her Wala' would be for them. 'Aishah رضی اللۀا further said, \"I went to Allah's Messenger (ﷺ) and told him about it.\" Allah Messenger (ﷺ) said to her, \"Buy Barira رضی اللۀا and manumit her and the Wala' will be for the liberator.\" Allah's Messenger (ﷺ) then got up and said, \"What about those people who stipulate conditions that are not present in Allah's Laws? If anybody stipulates a condition which is not in Allah's Laws, then what he stipulates is invalid. Allah's Condition (Laws) are the truth and are more solid.\"",
        "malay_translation": "Barira رضي الله عنها datang untuk mencari bantuan bagi penulisan pembebasannya dan dia harus membayar lima Uqiya (emas) secara ansuran tahunan selama lima tahun. 'Aishah رضي الله عنها berkata kepadanya, \"Adakah kamu fikir jika saya membayar keseluruhan jumlah sekaligus, tuan kamu akan menjual kamu kepada saya, dan saya akan membebaskan kamu dan Wala' kamu akan menjadi milik saya.\" Barira رضي الله عنها pergi kepada tuannya dan memberitahu mereka tentang tawaran itu. Mereka berkata bahawa mereka tidak akan bersetuju kecuali Wala'nya akan menjadi milik mereka. 'Aishah رضي الله عنها selanjutnya berkata, \"Saya pergi kepada Rasulullah (ﷺ) dan memberitahunya tentang hal itu.\" Rasulullah (ﷺ) bersabda kepadanya, \"Beli Barira رضي الله عنها dan bebaskan dia dan Wala' akan menjadi milik orang yang membebaskan.\" Rasulullah (ﷺ) kemudian berdiri dan bersabda, \"Bagaimana dengan orang-orang yang menetapkan syarat-syarat yang tidak ada dalam Hukum Allah? Jika seseorang menetapkan syarat yang tidak ada dalam Hukum Allah, maka apa yang dia tetapkan adalah tidak sah. Syarat (Hukum) Allah adalah kebenaran dan lebih kukuh.\"",
        "arabic_text": "وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ عُرْوَةُ قَالَتْ عَائِشَةُ ـ رضى الله عنها ـ إِنَّ بَرِيرَةَ دَخَلَتْ عَلَيْهَا تَسْتَعِينُهَا فِي كِتَابَتِهَا وَعَلَيْهَا خَمْسَةُ أَوَاقٍ، نُجِّمَتْ عَلَيْهَا فِي خَمْسِ سِنِينَ، فَقَالَتْ لَهَا عَائِشَةُ وَنَفِسَتْ فِيهَا أَرَأَيْتِ إِنْ عَدَدْتُ لَهُمْ عَدَّةً وَاحِدَةً، أَيَبِيعُكِ أَهْلُكِ، فَأُعْتِقَكِ، فَيَكُونَ وَلاَؤُكِ لِي فَذَهَبَتْ بَرِيرَةُ إِلَى أَهْلِهَا، فَعَرَضَتْ ذَلِكَ عَلَيْهِمْ فَقَالُوا لاَ إِلاَّ أَنْ يَكُونَ لَنَا الْوَلاَءُ‏.‏ قَالَتْ عَائِشَةُ فَدَخَلْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرْتُ ذَلِكَ لَهُ‏.‏ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اشْتَرِيهَا فَأَعْتِقِيهَا، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا بَالُ رِجَالٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ، مَنِ اشْتَرَطَ شَرْطًا لَيْسَ فِي كِتَابِ اللَّهِ فَهْوَ بَاطِلٌ، شَرْطُ اللَّهِ أَحَقُّ وَأَوْثَقُ ‏\"‏‏.‏"
      },
      {
        "id": 2448,
        "hadith_number": "2561",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pembelian dan Pembebasan Buraidah serta Isu Wala'",
        "perawi_melayu": "Diriwayatkan oleh Aisyah رضي الله عنها :",
        "english_text": "Buraira رضی اللہ عنها came to seek her help in her writing of emancipation (for a certain sum) and that time she had not paid anything of it. `Aisha رضی اللہ عنها said to her, \"Go back to your masters, and if they agree that I will pay the amount of your writing of emancipation and get your Wala', I will do so.\" Buraira رضی اللہ عنها informed her masters of that but they refused and said, \"If she (i.e. `Aisha رضی اللہ عنها) is seeking Allah's reward, then she can do so, but your Wala' will be for us.\" `Aisha رضی اللہ عنها mentioned that to Allah's Apostle who said to her, \"Buy and manumit her, as the Wala' is for the liberator.\" Allah's Messenger (ﷺ) then got up and said, \"What about the people who stipulate conditions which are not present in Allah's Laws? Whoever imposes conditions which are not present in Allah's Laws, then those conditions will be invalid, even if he imposed these conditions a hundred times. Allah's conditions (Laws) are the truth and are more solid.\"",
        "malay_translation": "Buraidah رضي الله عنها datang menemui Aisyah رضي الله عنها untuk meminta bantuan dalam urusan penebusan dirinya (mukatabah) dengan sejumlah wang, dan pada ketika itu dia belum membayar apa-apa pun daripadanya. Aisyah رضي الله عنها berkata kepadanya, \"Kembalilah kepada tuanmu, dan jika mereka bersetuju agar aku membayar jumlah penebusan dirimu dan mendapatkan hak wala' kamu, aku akan melakukannya.\" Buraidah رضي الله عنها memaklumkan perkara itu kepada tuannya, tetapi mereka menolak dan berkata, \"Jika dia (iaitu Aisyah رضي الله عنها) mencari pahala Allah, maka dia boleh melakukannya, tetapi hak wala' kamu tetap menjadi milik kami.\" Aisyah رضي الله عنها menyebutkan perkara itu kepada Rasulullah ﷺ, lalu Baginda bersabda kepadanya, \"Belilah dan bebaskan dia, kerana hak wala' adalah bagi orang yang membebaskan.\" Rasulullah ﷺ kemudian berdiri dan bersabda, \"Apa halnya dengan orang-orang yang membuat syarat-syarat yang tidak ada dalam hukum Allah? Sesiapa yang membuat syarat-syarat yang tidak ada dalam hukum Allah, maka syarat-syarat itu adalah batil, walaupun dia membuat syarat-syarat itu seratus kali. Hukum-hukum Allah adalah kebenaran dan lebih teguh.\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ أَخْبَرَتْهُ أَنَّ بَرِيرَةَ جَاءَتْ تَسْتَعِينُهَا فِي كِتَابَتِهَا، وَلَمْ تَكُنْ قَضَتْ مِنْ كِتَابَتِهَا شَيْئًا، قَالَتْ لَهَا عَائِشَةُ ارْجِعِي إِلَى أَهْلِكِ، فَإِنْ أَحَبُّوا أَنْ أَقْضِيَ عَنْكِ كِتَابَتَكِ، وَيَكُونَ وَلاَؤُكِ لِي فَعَلْتُ‏.‏ فَذَكَرَتْ ذَلِكَ بَرِيرَةُ لأَهْلِهَا فَأَبَوْا وَقَالُوا إِنْ شَاءَتْ أَنْ تَحْتَسِبَ عَلَيْكِ فَلْتَفْعَلْ، وَيَكُونَ وَلاَؤُكِ لَنَا، فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ابْتَاعِي فَأَعْتِقِي، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ قَالَ ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا بَالُ أُنَاسٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ مَنِ اشْتَرَطَ شَرْطًا لَيْسَ فِي كِتَابِ اللَّهِ فَلَيْسَ لَهُ، وَإِنْ شَرَطَ مِائَةَ مَرَّةٍ، شَرْطُ اللَّهِ أَحَقُّ وَأَوْثَقُ ‏\"‏‏.‏"
      },
      {
        "id": 2449,
        "hadith_number": "2562",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Wala' Adalah untuk Orang yang Memerdekakan",
        "perawi_melayu": "Diriwayatkan oleh Abdullah bin Umar RA:",
        "english_text": "Aisha رضی اللہ عنها wanted to buy a slave-girl in order to manumit her. The girl's masters stipulated that her Wala' would be for them. Allah's Messenger (ﷺ) said (to `Aisha رضی اللہ عنها), \"What they stipulate should not stop you, for the Wala' is for the liberator.\"",
        "malay_translation": "Aisyah RA ingin membeli seorang hamba perempuan untuk memerdekakannya. Tuan-tuan perempuan itu menetapkan bahawa Wala' hamba perempuan itu adalah untuk mereka. Rasulullah SAW bersabda (kepada Aisyah RA), \"Apa yang mereka tetapkan tidak seharusnya menghalang kamu, kerana Wala' adalah untuk orang yang memerdekakan.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ أَرَادَتْ عَائِشَةُ أُمُّ الْمُؤْمِنِينَ أَنْ تَشْتَرِيَ جَارِيَةً لِتُعْتِقَهَا، فَقَالَ أَهْلُهَا عَلَى أَنَّ وَلاَءَهَا لَنَا‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يَمْنَعُكِ ذَلِكِ، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏"
      },
      {
        "id": 2450,
        "hadith_number": "2563",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Wala' adalah Hak Orang yang Membebaskan Hamba",
        "perawi_melayu": "Diriwayatkan oleh Aisyah RA:",
        "english_text": "Buraira رضی اللہ عنۈا came (to `Aisha رضی اللہ عنۈا) and said, \"I have made a contract of emancipation with my masters for nine Uqiyas (of gold) to be paid in yearly installments. Therefore, I seek your help.\" `Aisha رضی اللہ عنۈا said, \"If your masters agree, I will pay them the sum at once and free you on condition that your Wala' will be for me.\" Buraira رضی اللہ عنۈا went to her masters but they refused that offer. She (came back) and said, \"I presented to them the offer but they refused, unless the Wala' was for them.\" Allah's Messenger (ﷺ) heard of that and asked me about it, and I told him about it. On that he said, \"Buy and manumit her and stipulate that the Wala' should be for you, as Wala' is for the liberator.\" `Aisha رضی اللہ عنۈا added, \"Allah's Messenger (ﷺ) then got up amongst the people, Glorified and Praised Allah, and said, 'Then after: What about some people who impose conditions which are not present in Allah's Laws? So, any condition which is not present in Allah's Laws is invalid even if they were one-hundred conditions. Allah's ordinance is the truth, and Allah's condition is stronger and more solid. Why do some men from you say, O so-and-so! manumit the slave but the Wala will be for me? Verily, the Wala is for the liberator.\"",
        "malay_translation": "Buraidah RA datang kepada Aisyah RA dan berkata, \"Saya telah membuat perjanjian penebusan dengan tuan-tuan saya untuk sembilan Uqiyah (emas) yang akan dibayar secara ansuran tahunan. Oleh itu, saya memohon bantuan anda.\" Aisyah RA berkata, \"Jika tuan-tuanmu setuju, saya akan membayar jumlah itu sekaligus dan membebaskanmu dengan syarat wala'mu adalah untukku.\" Buraidah RA pergi kepada tuan-tuannya tetapi mereka menolak tawaran itu. Dia (kembali) dan berkata, \"Saya telah menyampaikan tawaran itu kepada mereka tetapi mereka menolak, kecuali wala' itu untuk mereka.\" Rasulullah SAW mendengar tentang hal itu dan bertanya kepada saya mengenainya, dan saya memberitahunya tentang hal itu. Kemudian baginda bersabda, \"Belilah dan bebaskan dia dan tetapkan syarat bahawa wala' itu adalah untukmu, kerana wala' adalah untuk orang yang membebaskan.\" Aisyah RA menambah, \"Kemudian Rasulullah SAW berdiri di kalangan orang ramai, memuji dan mengagungkan Allah, dan bersabda, 'Kemudian daripada itu: Bagaimana dengan beberapa orang yang mengenakan syarat-syarat yang tidak ada dalam Hukum-hukum Allah? Maka, setiap syarat yang tidak ada dalam Hukum-hukum Allah adalah batal walaupun ia seratus syarat. Ketetapan Allah adalah kebenaran, dan syarat Allah lebih kuat dan lebih kukuh. Mengapa ada beberapa orang dari kalangan kamu berkata, Wahai fulan! bebaskan hamba tetapi wala' itu untukku? Sesungguhnya, wala' adalah untuk orang yang membebaskan.\"",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ جَاءَتْ بَرِيرَةُ فَقَالَتْ إِنِّي كَاتَبْتُ أَهْلِي عَلَى تِسْعِ أَوَاقٍ، فِي كُلِّ عَامٍ وَقِيَّةٌ، فَأَعِينِينِي‏.‏ فَقَالَتْ عَائِشَةُ إِنْ أَحَبَّ أَهْلُكِ أَنْ أَعُدَّهَا لَهُمْ عَدَّةً وَاحِدَةً، وَأُعْتِقَكِ فَعَلْتُ، وَيَكُونَ وَلاَؤُكِ لِي‏.‏ فَذَهَبَتْ إِلَى أَهْلِهَا، فَأَبَوْا ذَلِكَ عَلَيْهَا، فَقَالَتْ إِنِّي قَدْ عَرَضْتُ ذَلِكَ عَلَيْهِمْ، فَأَبَوْا إِلاَّ أَنْ يَكُونَ الْوَلاَءُ لَهُمْ‏.‏ فَسَمِعَ بِذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَأَلَنِي فَأَخْبَرْتُهُ، فَقَالَ ‏\"‏ خُذِيهَا، فَأَعْتِقِيهَا، وَاشْتَرِطِي لَهُمُ الْوَلاَءَ، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ قَالَتْ عَائِشَةُ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي النَّاسِ، فَحَمِدَ اللَّهَ، وَأَثْنَى عَلَيْهِ، ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ، فَمَا بَالُ رِجَالٍ مِنْكُمْ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ فَأَيُّمَا شَرْطٍ لَيْسَ فِي كِتَابِ اللَّهِ فَهْوَ بَاطِلٌ، وَإِنْ كَانَ مِائَةَ شَرْطٍ، فَقَضَاءُ اللَّهِ أَحَقُّ، وَشَرْطُ اللَّهِ أَوْثَقُ، مَا بَالُ رِجَالٍ مِنْكُمْ يَقُولُ أَحَدُهُمْ أَعْتِقْ يَا فُلاَنُ وَلِيَ الْوَلاَءُ إِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏"
      },
      {
        "id": 2451,
        "hadith_number": "2564",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Wala' adalah Hak Orang yang Membebaskan Hamba",
        "perawi_melayu": "Diriwayatkan oleh `Amra bint `Abdur-Rahman:",
        "english_text": "Buraira رضی اللہ عنہا went to Aisha رضی اللہ عنہا , the mother of the faithful believers to seek her help in her emancipation Aisha رضی اللہ عنہا said to her, \"If your masters agree, I will pay them your price in a lump sum and manumit you.\" Buraira رضی اللہ عنہا mentioned that offer to her masters but they refused to sell her unless the Wala' was for them. `Aisha رضی اللہ عنہا told Allah's Messenger (ﷺ) about it. He said, \"Buy and manumit her as the Wala' is for the liberator.\"",
        "malay_translation": "Buraidah رضي الله عنها pergi kepada Aisyah رضي الله عنها, ibu orang-orang mukmin untuk meminta bantuannya dalam pembebasannya. Aisyah رضي الله عنها berkata kepadanya, \"Jika tuanmu setuju, saya akan membayar harga kamu secara sekaligus dan membebaskan kamu.\" Buraidah رضي الله عنها menyebutkan tawaran itu kepada tuannya tetapi mereka menolak untuk menjualnya kecuali Wala' adalah untuk mereka. Aisyah رضي الله عنها memberitahu Rasulullah ﷺ tentang hal itu. Baginda bersabda, \"Belilah dan bebaskan dia kerana Wala' adalah hak orang yang membebaskan.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّ بَرِيرَةَ، جَاءَتْ تَسْتَعِينُ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ ـ رضى الله عنها ـ فَقَالَتْ لَهَا إِنْ أَحَبَّ أَهْلُكِ أَنْ أَصُبَّ لَهُمْ ثَمَنَكِ صَبَّةً وَاحِدَةً فَأُعْتِقَكِ فَعَلْتُ‏.‏ فَذَكَرَتْ بَرِيرَةُ ذَلِكَ لأَهْلِهَا، فَقَالُوا لاَ‏.‏ إِلاَّ أَنْ يَكُونَ وَلاَؤُكِ لَنَا‏.‏ قَالَ مَالِكٌ قَالَ يَحْيَى فَزَعَمَتْ عَمْرَةُ أَنَّ عَائِشَةَ ذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ اشْتَرِيهَا وَأَعْتِقِيهَا، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏"
      },
      {
        "id": 2452,
        "hadith_number": "2565",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Wala' adalah Hak Orang yang Memerdekakan Hamba",
        "perawi_melayu": "Diriwayatkan oleh `Abdul Wahid bin Aiman رضي الله عنه:",
        "english_text": "I went to `Aisha رضی اللہ عنۈا and said, \"I was the slave of `Utba bin Abu Lahab. \"Utba died and his sons became my masters who sold me to Ibn Abu `Amr who manumitted me. The sons of `Utba stipulated that my Wala' should be for them.\" `Aisha رضی اللہ عنۈا said, \"Buraira رضی اللہ عنۈا came to me and she was given the writing of emancipation by her masters and she asked me to buy and manumit her. I agreed to it, but Buraira رضی اللہ عنۈا told me that her masters would not sell her unless her Wala' was for them.\" `Aisha رضی اللہ عنۈا said, \"I am not in need of that.\" When the Prophet (ﷺ) heard that, or he was told about it, he asked `Aisha رضی اللہ عنۈا about it. `Aisha رضی اللہ عنۈا mentioned what Buraira رضی اللہ عنۈا had told her. The Prophet (ﷺ) said, \"Buy and manumit her and let them stipulate whatever they like.\" So, `Aisha رضی اللہ عنۈا bought and manumitted her and her masters stipulated that her Wala' should be for them.\" The Prophet;, said, \"The Wala' will be for the liberator even if they stipulated a hundred conditions.\"",
        "malay_translation": "Saya pergi kepada Aisyah رضي الله عنها dan berkata, \"Saya adalah hamba kepada Utba bin Abu Lahab.\" Utba meninggal dunia dan anak-anak lelakinya menjadi tuan saya yang menjual saya kepada Ibn Abu `Amr yang memerdekakan saya. Anak-anak lelaki Utba menetapkan bahawa Wala' saya adalah untuk mereka.\" Aisyah رضي الله عنها berkata, \"Buraira رضي الله عنها datang kepada saya dan dia diberikan surat pembebasan oleh tuan-tuannya dan dia meminta saya untuk membeli dan memerdekakannya. Saya bersetuju dengannya, tetapi Buraira رضي الله عنها memberitahu saya bahawa tuan-tuannya tidak akan menjualnya kecuali Wala'nya adalah untuk mereka.\" Aisyah رضي الله عنها berkata, \"Saya tidak memerlukan itu.\" Apabila Nabi ﷺ mendengar itu, atau diberitahu mengenainya, baginda bertanya kepada Aisyah رضي الله عنها tentangnya. Aisyah رضي الله عنها menyebutkan apa yang Buraira رضي الله عنها telah beritahu kepadanya. Nabi ﷺ bersabda, \"Beli dan merdekakannya dan biarkan mereka menetapkan apa sahaja yang mereka suka.\" Jadi, Aisyah رضي الله عنها membeli dan memerdekakannya dan tuan-tuannya menetapkan bahawa Wala'nya adalah untuk mereka.\" Nabi ﷺ bersabda, \"Wala' adalah untuk orang yang memerdekakan walaupun mereka menetapkan seratus syarat.\"",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ أَيْمَنَ، قَالَ حَدَّثَنِي أَبِي أَيْمَنُ، قَالَ دَخَلْتُ عَلَى عَائِشَةَ ـ رضى الله عنها ـ فَقُلْتُ كُنْتُ غُلاَمًا لِعُتْبَةَ بْنِ أَبِي لَهَبٍ، وَمَاتَ وَوَرِثَنِي بَنُوهُ، وَإِنَّهُمْ بَاعُونِي مِنَ ابْنِ أَبِي عَمْرٍو، فَأَعْتَقَنِي ابْنُ أَبِي عَمْرٍو، وَاشْتَرَطَ بَنُو عُتْبَةَ الْوَلاَءَ‏.‏ فَقَالَتْ دَخَلَتْ بَرِيرَةُ وَهْىَ مُكَاتَبَةٌ فَقَالَتِ اشْتَرِينِي وَأَعْتِقِينِي‏.‏ قَالَتْ نَعَمْ‏.‏ قَالَتْ لاَ يَبِيعُونِي حَتَّى يَشْتَرِطُوا وَلاَئِي‏.‏ فَقَالَتْ لاَ حَاجَةَ لِي بِذَلِكَ‏.‏ فَسَمِعَ بِذَلِكَ النَّبِيُّ صلى الله عليه وسلم أَوْ بَلَغَهُ، فَذَكَرَ لِعَائِشَةَ، فَذَكَرَتْ عَائِشَةُ مَا قَالَتْ لَهَا، فَقَالَ ‏\"‏ اشْتَرِيهَا وَأَعْتِقِيهَا، وَدَعِيهِمْ يَشْتَرِطُونَ مَا شَاءُوا ‏\"‏‏.‏ فَاشْتَرَتْهَا عَائِشَةُ فَأَعْتَقَتْهَا وَاشْتَرَطَ أَهْلُهَا الْوَلاَءَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ الْوَلاَءُ لِمَنْ أَعْتَقَ، وَإِنِ اشْتَرَطُوا مِائَةَ شَرْطٍ ‏\"‏‏.‏"
      }
    ]
  }
}