{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 79,
    "data": [
      {
        "id": 511,
        "hadith_number": "521, 522",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Penangguhan Solat dan Contoh Jibril Menunaikan Solat bersama Rasulullah ﷺ",
        "perawi_melayu": "Diriwayatkan oleh Ibn Shihab:",
        "english_text": "Once `Umar bin `Abdul `Aziz delayed the prayer and `Urwa bin Az-Zubair رضی اللہ عنہ went to him and said, \"Once in 'Iraq, Al-Mughira bin Shu`ba delayed his prayers and Abi Mas`ud Al-Ansari went to him and said, 'O Mughira! What is this? Don't you know that once Gabriel came and offered the prayer (Fajr prayer) and Allah's Messenger (ﷺ) prayed too, then he prayed again (Zuhr prayer) and so did Allah's Apostle and again he prayed (`Asr prayers and Allah's Messenger (ﷺ) did the same; again he prayed (Maghrib-prayer) and so did Allah's Messenger (ﷺ) and again prayed (`Isha prayer) and so did Allah's Apostle and (Gabriel) said, 'I was ordered to do so (to demonstrate the prayers prescribed to you)?'\" `Umar (bin `Abdul `Aziz) said to `Urwa, \"Be sure of what you Say. Did Gabriel lead Allah's Messenger (ﷺ) at the stated times of the prayers?\" `Urwa replied, \"Bashir bin Abi Mas`ud رضی اللہ عنہ narrated like this on the authority of his father.\" `Urwa added, \"Aisha told me that Allah's Messenger (ﷺ) used to pray `Asr prayer when the sunshine was still inside her residence (during the early time of `Asr).",
        "malay_translation": "Pada suatu ketika, Umar bin Abdul Aziz melambatkan solat, lalu Urwa bin Az-Zubair RA pergi kepadanya dan berkata, \"Suatu ketika di Iraq, Al-Mughira bin Shu'ba melambatkan solatnya, lalu Abi Mas'ud Al-Ansari pergi kepadanya dan berkata, 'Wahai Mughira! Apa ini? Tidakkah kamu tahu bahawa pernah Jibril datang dan menunaikan solat (solat Subuh) dan Rasulullah ﷺ turut solat, kemudian dia solat lagi (solat Zohor) dan begitu juga Rasulullah dan dia solat lagi (solat Asar) dan Rasulullah ﷺ melakukan yang sama; dia solat lagi (solat Maghrib) dan begitu juga Rasulullah ﷺ dan dia solat lagi (solat Isyak) dan begitu juga Rasulullah dan (Jibril) berkata, 'Aku diperintahkan untuk berbuat demikian (untuk menunjukkan solat-solat yang ditetapkan kepadamu)?'\" Umar (bin Abdul Aziz) berkata kepada Urwa, \"Pastikan apa yang kamu katakan. Adakah Jibril memimpin Rasulullah ﷺ pada waktu-waktu solat yang ditetapkan?\" Urwa menjawab, \"Bashir bin Abi Mas'ud RA meriwayatkan seperti ini daripada ayahnya.\" Urwa menambah, \"Aisyah memberitahuku bahawa Rasulullah ﷺ biasanya menunaikan solat Asar ketika cahaya matahari masih berada di dalam kediamannya (pada awal waktu Asar).\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، أَخَّرَ الصَّلاَةَ يَوْمًا، فَدَخَلَ عَلَيْهِ عُرْوَةُ بْنُ الزُّبَيْرِ، فَأَخْبَرَهُ أَنَّ الْمُغِيرَةَ بْنَ شُعْبَةَ أَخَّرَ الصَّلاَةَ يَوْمًا وَهْوَ بِالْعِرَاقِ، فَدَخَلَ عَلَيْهِ أَبُو مَسْعُودٍ الأَنْصَارِيُّ فَقَالَ مَا هَذَا يَا مُغِيرَةُ أَلَيْسَ قَدْ عَلِمْتَ أَنَّ جِبْرِيلَ نَزَلَ فَصَلَّى، فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ ‏ \"‏ بِهَذَا أُمِرْتُ ‏\"‏‏.‏ فَقَالَ عُمَرُ لِعُرْوَةَ اعْلَمْ مَا تُحَدِّثُ أَوَإِنَّ جِبْرِيلَ هُوَ أَقَامَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَقْتَ الصَّلاَةِ‏.‏ قَالَ عُرْوَةُ كَذَلِكَ كَانَ بَشِيرُ بْنُ أَبِي مَسْعُودٍ يُحَدِّثُ عَنْ أَبِيهِ‏.‏قَالَ عُرْوَةُ وَلَقَدْ حَدَّثَتْنِي عَائِشَةُ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي الْعَصْرَ، وَالشَّمْسُ فِي حُجْرَتِهَا قَبْلَ أَنْ تَظْهَرَ‏.‏"
      },
      {
        "id": 512,
        "hadith_number": "523",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perutusan Abdul Qais dan Perintah Nabi Muhammad SAW",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Abbas RA:",
        "english_text": "\"Once a delegation of `Abdul Qais came to Allah's Messenger (ﷺ) and said, \"We belong to such and such branch of the tribe of Rab'a [??] and we can only come to you in the sacred months. Order us to do something good so that we may (carry out) take it from you and also invite to it our people whom we have left behind (at home).\" The Prophet (ﷺ) said, \" I order you to do four things and forbid you from four things. (The first four are as follows): \r\n1. To believe in Allah. (And then he: explained it to them i.e.) to testify that none has the right to be worshipped but Allah and (Muhammad) am Allah's Messenger (ﷺ) \r\n2. To offer prayers perfectly (at the stated times):\r\n3. To pay Zakat (obligatory charity) \r\n4. To give me Khumus (The other four things which are forbidden are as follows):\r\n1. Dubba \r\n2. Hantam \r\n3. Muqaiyat [??] \r\n4. Naqir (all these are utensils used for the preparation of alcoholic drinks).",
        "malay_translation": "Suatu ketika, satu perutusan daripada Abdul Qais datang kepada Rasulullah SAW dan berkata, \"Kami berasal daripada cabang suku Rab'a dan kami hanya boleh datang kepada anda pada bulan-bulan suci. Perintahkan kami untuk melakukan sesuatu yang baik supaya kami dapat mengambilnya daripada anda dan juga mengajak kaum kami yang telah kami tinggalkan (di rumah).\" Nabi SAW bersabda, \"Aku memerintahkan kamu untuk melakukan empat perkara dan melarang kamu daripada empat perkara. (Empat perkara yang pertama adalah seperti berikut):\r\n1. Beriman kepada Allah. (Kemudian baginda SAW menjelaskan kepada mereka iaitu) untuk bersaksi bahawa tiada Tuhan yang berhak disembah melainkan Allah dan (Muhammad) adalah Rasulullah SAW.\r\n2. Menunaikan solat dengan sempurna (pada waktu yang ditetapkan):\r\n3. Membayar Zakat (sedekah wajib)\r\n4. Memberikan saya Khumus (Empat perkara lain yang dilarang adalah seperti berikut):\r\n1. Dubba\r\n2. Hantam\r\n3. Muqaiyat\r\n4. Naqir (semua ini adalah perkakas yang digunakan untuk membuat minuman beralkohol).",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا عَبَّادٌ ـ هُوَ ابْنُ عَبَّادٍ ـ عَنْ أَبِي جَمْرَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَدِمَ وَفْدُ عَبْدِ الْقَيْسِ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالُوا إِنَّا مِنْ هَذَا الْحَىِّ مِنْ رَبِيعَةَ، وَلَسْنَا نَصِلُ إِلَيْكَ إِلاَّ فِي الشَّهْرِ الْحَرَامِ، فَمُرْنَا بِشَىْءٍ نَأْخُذْهُ عَنْكَ، وَنَدْعُو إِلَيْهِ مَنْ وَرَاءَنَا‏.‏ فَقَالَ ‏ \"‏ آمُرُكُمْ بِأَرْبَعٍ، وَأَنْهَاكُمْ عَنْ أَرْبَعٍ الإِيمَانِ بِاللَّهِ ـ ثُمَّ فَسَّرَهَا لَهُمْ شَهَادَةُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ، وَأَنِّي رَسُولُ اللَّهِ، وَإِقَامُ الصَّلاَةِ، وَإِيتَاءُ الزَّكَاةِ، وَأَنْ تُؤَدُّوا إِلَىَّ خُمُسَ مَا غَنِمْتُمْ، وَأَنْهَى عَنِ الدُّبَّاءِ وَالْحَنْتَمِ وَالْمُقَيَّرِ وَالنَّقِيرِ ‏\"‏‏.‏"
      },
      {
        "id": 513,
        "hadith_number": "524",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Janji Setia untuk Solat, Zakat, dan Nasihat yang Baik",
        "perawi_melayu": "Diriwayatkan oleh Jarir bin `Abdullah رضی اللہ عنہ:",
        "english_text": "I gave the pledge of allegiance to Allah's Messenger (ﷺ) for to offer prayers perfectly, to pay Zakat regularly, and to give good advice to every Muslim.",
        "malay_translation": "Aku telah memberikan bai'ah (janji setia) kepada Rasulullah (ﷺ) untuk menunaikan solat dengan sempurna, membayar zakat secara teratur, dan memberikan nasihat yang baik kepada setiap Muslim.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنَا قَيْسٌ، عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ، قَالَ بَايَعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى إِقَامِ الصَّلاَةِ، وَإِيتَاءِ الزَّكَاةِ، وَالنُّصْحِ لِكُلِّ مُسْلِمٍ‏.‏"
      },
      {
        "id": 514,
        "hadith_number": "525",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Fitnah dan Penebusan Dosa Melalui Ibadah",
        "perawi_melayu": "Diriwayatkan oleh Hudhaifa رضی اللہ عنہ:",
        "english_text": "\"Once I was sitting with `Umar رضی اللہ عنہ and he said, 'Who amongst you remembers the statement of Allah's Messenger (ﷺ) about the afflictions?' I said, 'I know it as the Prophet (ﷺ) had said it.' `Umar said, 'No doubt you are bold.' I said, 'The afflictions caused for a man by his wife, money, children and neighbor are expiated by his prayers, fasting, charity and by enjoining (what is good) and forbidding (what is evil).' `Umar said, 'I did not mean that but I asked about that affliction which will spread like the waves of the sea.' I (Hudhaifa) said, 'O leader of the faithful believers! You need not be afraid of it as there is a closed door between you and it.' `Umar asked, Will the door be broken or opened?' I replied, 'It will be broken.' `Umar said, 'Then it will never be closed again.' I was asked whether `Umar knew that door. I replied that he knew it as one knows that there will be night before the tomorrow morning. I narrated a Hadith that was free from any misstatement\" The subnarrator added that they deputized Masruq to ask Hudhaifa (about the door). Hudhaifa said, \"The door was `Umar himself.\"",
        "malay_translation": "\"Pada suatu ketika saya sedang duduk bersama `Umar رضی اللہ عنہ dan beliau berkata, 'Siapakah di antara kamu yang mengingati sabda Rasulullah (ﷺ) tentang fitnah?' Saya berkata, 'Saya mengetahuinya sebagaimana Nabi (ﷺ) telah bersabda.' `Umar berkata, 'Tidak syak lagi kamu berani.' Saya berkata, 'Fitnah yang menimpa seseorang disebabkan oleh isterinya, hartanya, anak-anaknya dan jirannya ditebus dengan solatnya, puasanya, sedekahnya dan dengan menyuruh (kepada kebaikan) dan mencegah (kemungkaran).' `Umar berkata, 'Bukan itu yang saya maksudkan, tetapi saya bertanya tentang fitnah yang akan merebak seperti ombak laut.' Saya (Hudhaifa) berkata, 'Wahai pemimpin orang-orang mukmin! Anda tidak perlu takut kepadanya kerana ada pintu tertutup antara anda dengannya.' `Umar bertanya, 'Adakah pintu itu akan dipecahkan atau dibuka?' Saya menjawab, 'Ia akan dipecahkan.' `Umar berkata, 'Jika begitu, ia tidak akan tertutup lagi.' Saya ditanya adakah `Umar mengetahui pintu itu. Saya menjawab bahawa beliau mengetahuinya seperti mana seseorang mengetahui bahawa akan ada malam sebelum pagi esok. Saya meriwayatkan sebuah Hadith yang bebas daripada sebarang kesilapan.\" Sub-perawi menambah bahawa mereka mewakilkan Masruq untuk bertanya kepada Hudhaifa (tentang pintu itu). Hudhaifa berkata, \"Pintu itu adalah `Umar sendiri.\"",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنِ الأَعْمَشِ، قَالَ حَدَّثَنِي شَقِيقٌ، قَالَ سَمِعْتُ حُذَيْفَةَ، قَالَ كُنَّا جُلُوسًا عِنْدَ عُمَرَ ـ رضى الله عنه ـ فَقَالَ أَيُّكُمْ يَحْفَظُ قَوْلَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الْفِتْنَةِ قُلْتُ أَنَا، كَمَا قَالَهُ‏.‏ قَالَ إِنَّكَ عَلَيْهِ ـ أَوْ عَلَيْهَا ـ لَجَرِيءٌ‏.‏ قُلْتُ ‏ \"‏ فِتْنَةُ الرَّجُلِ فِي أَهْلِهِ وَمَالِهِ وَوَلَدِهِ وَجَارِهِ تُكَفِّرُهَا الصَّلاَةُ وَالصَّوْمُ وَالصَّدَقَةُ وَالأَمْرُ وَالنَّهْىُ ‏\"‏‏.‏ قَالَ لَيْسَ هَذَا أُرِيدُ، وَلَكِنِ الْفِتْنَةُ الَّتِي تَمُوجُ كَمَا يَمُوجُ الْبَحْرُ‏.‏ قَالَ لَيْسَ عَلَيْكَ مِنْهَا بَأْسٌ يَا أَمِيرَ الْمُؤْمِنِينَ، إِنَّ بَيْنَكَ وَبَيْنَهَا بَابًا مُغْلَقًا‏.‏ قَالَ أَيُكْسَرُ أَمْ يُفْتَحُ قَالَ يُكْسَرُ‏.‏ قَالَ إِذًا لاَ يُغْلَقَ أَبَدًا‏.‏ قُلْنَا أَكَانَ عُمَرُ يَعْلَمُ الْبَابَ قَالَ نَعَمْ، كَمَا أَنَّ دُونَ الْغَدِ اللَّيْلَةَ، إِنِّي حَدَّثْتُهُ بِحَدِيثٍ لَيْسَ بِالأَغَالِيطِ‏.‏ فَهِبْنَا أَنْ نَسْأَلَ حُذَيْفَةَ، فَأَمَرْنَا مَسْرُوقًا فَسَأَلَهُ فَقَالَ الْبَابُ عُمَرُ‏.‏"
      },
      {
        "id": 515,
        "hadith_number": "526",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kebaikan Menghapuskan Kejahatan: Solat Sebagai Penghapus Dosa Kecil",
        "perawi_melayu": "Diriwayatkan daripada Ibn Mas'ud رضی اللہ عنہ:",
        "english_text": "A man kissed a woman (unlawfully) and then went to the Prophet (ﷺ) and informed him. Allah revealed: And offer prayers perfectly At the two ends of the day And in some hours of the night (i.e. the five compulsory prayers). Verily! good deeds remove (annul) the evil deeds (small sins) (11.114). The man asked Allah's Messenger (ﷺ), \"Is it for me?\" He said, \"It is for all my followers.\"",
        "malay_translation": "Seorang lelaki mencium seorang wanita (secara tidak sah) dan kemudian pergi kepada Nabi (ﷺ) dan memberitahunya. Allah menurunkan wahyu: Dan dirikanlah solat dengan sempurna pada kedua hujung siang (pagi dan petang) dan pada beberapa bahagian malam (iaitu lima solat fardu). Sesungguhnya perbuatan-perbuatan baik itu menghapuskan (membatalkan) perbuatan-perbuatan jahat (dosa-dosa kecil) (11:114). Lelaki itu bertanya kepada Rasulullah (ﷺ), \"Adakah ini untuk saya?\" Baginda bersabda, \"Ia adalah untuk semua pengikutku.\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنِ ابْنِ مَسْعُودٍ، أَنَّ رَجُلاً، أَصَابَ مِنَ امْرَأَةٍ قُبْلَةً، فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَأَخْبَرَهُ، فَأَنْزَلَ اللَّهُ ‏{‏أَقِمِ الصَّلاَةَ طَرَفَىِ النَّهَارِ وَزُلَفًا مِنَ اللَّيْلِ إِنَّ الْحَسَنَاتِ يُذْهِبْنَ السَّيِّئَاتِ‏}‏‏.‏ فَقَالَ الرَّجُلُ يَا رَسُولَ اللَّهِ أَلِي هَذَا قَالَ ‏\"‏ لِجَمِيعِ أُمَّتِي كُلِّهِمْ ‏\"‏‏.‏"
      },
      {
        "id": 516,
        "hadith_number": "527",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Amalan yang Paling Disukai Allah: Solat Tepat pada Waktu, Berbakti kepada Ibu Bapa, dan Jihad",
        "perawi_melayu": "Diriwayatkan oleh `Abdullah رضی اللہ عنہ:",
        "english_text": "I asked the Prophet (ﷺ) \"Which deed is the dearest to Allah?\" He replied, \"To offer the prayers at their early stated fixed times.\" I asked, \"What is the next (in goodness)?\" He replied, \"To be good and dutiful to your parents\" I again asked, \"What is the next (in goodness)?\" He replied, 'To participate in Jihad (religious fighting) in Allah's cause.\" `Abdullah added, \"I asked only that much and if I had asked more, the Prophet (ﷺ) would have told me more.\"",
        "malay_translation": "Saya bertanya kepada Nabi (ﷺ): \"Amalan apakah yang paling disukai Allah?\" Baginda menjawab, \"Mendirikan solat pada awal waktu yang telah ditetapkan.\" Saya bertanya, \"Kemudian apa (dalam kebaikan)?\" Baginda menjawab, \"Berbuat baik dan berbakti kepada kedua ibu bapa.\" Saya bertanya lagi, \"Kemudian apa (dalam kebaikan)?\" Baginda menjawab, \"Berjihad (perjuangan agama) di jalan Allah.\" `Abdullah menambah, \"Saya hanya bertanya sebanyak itu dan jika saya bertanya lebih banyak, Nabi (ﷺ) pasti akan memberitahu saya lebih banyak.\"",
        "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، هِشَامُ بْنُ عَبْدِ الْمَلِكِ قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ الْوَلِيدُ بْنُ الْعَيْزَارِ أَخْبَرَنِي قَالَ سَمِعْتُ أَبَا عَمْرٍو الشَّيْبَانِيَّ، يَقُولُ حَدَّثَنَا صَاحِبُ، هَذِهِ الدَّارِ وَأَشَارَ إِلَى دَارِ عَبْدِ اللَّهِ قَالَ سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم أَىُّ الْعَمَلِ أَحَبُّ إِلَى اللَّهِ قَالَ ‏\"‏ الصَّلاَةُ عَلَى وَقْتِهَا ‏\"‏‏.‏ قَالَ ثُمَّ أَىُّ قَالَ ‏\"‏ ثُمَّ بِرُّ الْوَالِدَيْنِ ‏\"‏‏.‏ قَالَ ثُمَّ أَىُّ قَالَ ‏\"‏ الْجِهَادُ فِي سَبِيلِ اللَّهِ ‏\"‏‏.‏ قَالَ حَدَّثَنِي بِهِنَّ وَلَوِ اسْتَزَدْتُهُ لَزَادَنِي‏.‏"
      },
      {
        "id": 517,
        "hadith_number": "528",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perumpamaan Solat Lima Waktu Menghapuskan Dosa",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ عنہ, bahawa beliau mendengar Rasulullah ﷺ bersabda:",
        "english_text": "Allah's Messenger (ﷺ) saying, \"If there was a river at the door of anyone of you and he took a bath in it five times a day would you notice any dirt on him?\" They said, \"Not a trace of dirt would be left.\" The Prophet (ﷺ) added, \"That is the example of the five prayers with which Allah blots out (annuls) evil deeds.\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Sekiranya ada sungai di depan pintu rumah salah seorang daripada kamu dan dia mandi di dalamnya lima kali sehari, adakah kamu melihat sebarang kotoran padanya?\" Mereka berkata, \"Tidak ada kesan kotoran yang akan tertinggal.\" Nabi ﷺ menambah, \"Itulah perumpamaan solat lima waktu yang dengannya Allah menghapuskan (membatalkan) perbuatan jahat.\"",
        "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ، قَالَ حَدَّثَنِي ابْنُ أَبِي حَازِمٍ، وَالدَّرَاوَرْدِيُّ، عَنْ يَزِيدَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ أَرَأَيْتُمْ لَوْ أَنَّ نَهَرًا بِبَابِ أَحَدِكُمْ، يَغْتَسِلُ فِيهِ كُلَّ يَوْمٍ خَمْسًا، مَا تَقُولُ ذَلِكَ يُبْقِي مِنْ دَرَنِهِ ‏\"‏‏.‏ قَالُوا لاَ يُبْقِي مِنْ دَرَنِهِ شَيْئًا‏.‏ قَالَ ‏\"‏ فَذَلِكَ مِثْلُ الصَّلَوَاتِ الْخَمْسِ، يَمْحُو اللَّهُ بِهَا الْخَطَايَا ‏\"‏‏.‏"
      },
      {
        "id": 518,
        "hadith_number": "529",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perubahan Amalan Berbanding Zaman Nabi SAW",
        "perawi_melayu": "Diriwayatkan oleh Anas RA:",
        "english_text": "\"I do not find (now-a-days) things as they were (practiced) at the time of the Prophet.\" Somebody said \"The prayer (is as it was.)\" Anas said, \"Have you not done in the prayer what you have done?",
        "malay_translation": "\"Aku tidak mendapati (pada masa kini) perkara-perkara sebagaimana yang diamalkan pada zaman Nabi SAW.\" Seseorang berkata, \"Solat (masih seperti dahulu).\" Anas berkata, \"Tidakkah kamu telah melakukan dalam solat apa yang telah kamu lakukan?\"",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا مَهْدِيٌّ، عَنْ غَيْلاَنَ، عَنْ أَنَسٍ، قَالَ مَا أَعْرِفُ شَيْئًا مِمَّا كَانَ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم‏.‏ قِيلَ الصَّلاَةُ‏.‏ قَالَ أَلَيْسَ ضَيَّعْتُمْ مَا ضَيَّعْتُمْ فِيهَا‏.‏"
      },
      {
        "id": 519,
        "hadith_number": "530",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Tangisan Anas bin Malik atas Kehilangan Solat yang Sebenar",
        "perawi_melayu": "Diriwayatkan oleh Az-Zuhri bahawa:",
        "english_text": "He visited Anas bin Malik at Damascus and found him weeping and asked him why he was weeping. He replied, \"I do not know anything which I used to know during the life-time of Allah's Apostle except this prayer which is being lost (not offered as it should be).\"",
        "malay_translation": "Beliau mengunjungi Anas bin Malik di Damsyik dan mendapati beliau sedang menangis, lalu bertanya mengapa beliau menangis. Beliau menjawab, \"Aku tidak mengetahui apa-apa pun yang dahulunya aku ketahui semasa hayat Rasulullah SAW, kecuali solat ini yang kini semakin hilang (tidak ditunaikan sebagaimana sepatutnya).\"",
        "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ زُرَارَةَ، قَالَ أَخْبَرَنَا عَبْدُ الْوَاحِدِ بْنُ وَاصِلٍ أَبُو عُبَيْدَةَ الْحَدَّادُ، عَنْ عُثْمَانَ بْنِ أَبِي رَوَّادٍ، أَخِي عَبْدِ الْعَزِيزِ قَالَ سَمِعْتُ الزُّهْرِيَّ، يَقُولُ دَخَلْتُ عَلَى أَنَسِ بْنِ مَالِكٍ بِدِمَشْقَ وَهُوَ يَبْكِي فَقُلْتُ مَا يُبْكِيكَ فَقَالَ لاَ أَعْرِفُ شَيْئًا مِمَّا أَدْرَكْتُ إِلاَّ هَذِهِ الصَّلاَةَ، وَهَذِهِ الصَّلاَةُ قَدْ ضُيِّعَتْ‏.‏ وَقَالَ بَكْرٌ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ أَخْبَرَنَا عُثْمَانُ بْنُ أَبِي رَوَّادٍ نَحْوَهُ‏.‏"
      },
      {
        "id": 520,
        "hadith_number": "531",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Meludah ke Arah Kanan atau Kiblat Semasa Solat",
        "perawi_melayu": "Diriwayatkan oleh Anas RA:",
        "english_text": "The Prophet (ﷺ) said, \"Whenever anyone of you offers his prayer he is speaking in private to his Lord. So he should not spit to his right but under his left foot.\" Qatada said, \"He should not spit in front of him but to his left or under his feet.\" And Shu`ba said, \"He should not spit in front of him, nor to his right but to his left or under his foot.\" Anas said: The Prophet (ﷺ) said, \"He should neither spit in the direction of his Qibla nor to his right but to his left or under his foot.\"",
        "malay_translation": "Nabi Muhammad SAW bersabda, \"Sesungguhnya, apabila seseorang kamu menunaikan solat, dia sedang berbicara secara peribadi dengan Tuhannya. Oleh itu, janganlah dia meludah ke sebelah kanannya, tetapi di bawah kaki kirinya.\" Qatada berkata, \"Janganlah dia meludah di hadapannya, tetapi ke sebelah kirinya atau di bawah kakinya.\" Dan Shu'ba berkata, \"Janganlah dia meludah di hadapannya, mahupun ke sebelah kanannya, tetapi ke sebelah kirinya atau di bawah kakinya.\" Anas berkata: Nabi Muhammad SAW bersabda, \"Janganlah dia meludah ke arah kiblat mahupun ke sebelah kanannya, tetapi ke sebelah kirinya atau di bawah kakinya.\"",
        "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ أَحَدَكُمْ إِذَا صَلَّى يُنَاجِي رَبَّهُ فَلاَ يَتْفِلَنَّ عَنْ يَمِينِهِ، وَلَكِنْ تَحْتَ قَدَمِهِ الْيُسْرَى ‏\"‏‏.‏ وَقَالَ سَعِيدٌ عَنْ قَتَادَةَ لاَ يَتْفِلُ قُدَّامَهُ أَوْ بَيْنَ يَدَيْهِ، وَلَكِنْ عَنْ يَسَارِهِ أَوْ تَحْتَ قَدَمَيْهِ‏.‏ وَقَالَ شُعْبَةُ لاَ يَبْزُقُ بَيْنَ يَدَيْهِ وَلاَ عَنْ يَمِينِهِ، وَلَكِنْ عَنْ يَسَارِهِ أَوْ تَحْتَ قَدَمِهِ‏.‏ وَقَالَ حُمَيْدٌ عَنْ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ لاَ يَبْزُقْ فِي الْقِبْلَةِ وَلاَ عَنْ يَمِينِهِ، وَلَكِنْ عَنْ يَسَارِهِ أَوْ تَحْتَ قَدَمِهِ ‏\"‏‏.‏"
      },
      {
        "id": 521,
        "hadith_number": "532",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Menyerupai Anjing dalam Sujud dan Adab Meludah dalam Solat",
        "perawi_melayu": "Diriwayatkan oleh Anas RA:",
        "english_text": "The Prophet (ﷺ) said, \"Do the prostration properly and do not put your forearms flat with elbows touching the ground like a dog. And if you want to spit, do not spit in front, nor to the right for the person in prayer is speaking in private to his Lord.\"",
        "malay_translation": "Nabi SAW bersabda, \"Sempurnakanlah sujud dan janganlah kamu menghamparkan kedua lenganmu seperti anjing. Dan jika kamu hendak meludah, janganlah meludah ke arah depan, mahupun ke arah kanan, kerana sesungguhnya orang yang sedang solat itu sedang berbisik secara peribadi kepada Tuhannya.\"",
        "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ اعْتَدِلُوا فِي السُّجُودِ، وَلاَ يَبْسُطْ ذِرَاعَيْهِ كَالْكَلْبِ، وَإِذَا بَزَقَ فَلاَ يَبْزُقَنَّ بَيْنَ يَدَيْهِ وَلاَ عَنْ يَمِينِهِ، فَإِنَّهُ يُنَاجِي رَبَّهُ ‏\"‏‏.‏"
      },
      {
        "id": 522,
        "hadith_number": "533, 534",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Zuhur Ketika Cuaca Panas Terik",
        "perawi_melayu": "Diriwayatkan oleh Abu Huraira RA dan Abdullah bin Umar RA:",
        "english_text": "Allah's Messenger (ﷺ) said, \"If it is very hot, then pray the Zuhr prayer when it becomes (a bit) cooler, as the severity of the heat is from the raging of the Hell-fire.\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Jika cuaca sangat panas, maka solat Zuhur hendaklah ditunaikan ketika ia menjadi (agak) sejuk, kerana panas yang terik itu adalah dari bahang neraka Jahanam.\"",
        "arabic_text": "حَدَّثَنَا أَيُّوبُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا أَبُو بَكْرٍ، عَنْ سُلَيْمَانَ، قَالَ صَالِحُ بْنُ كَيْسَانَ حَدَّثَنَا الأَعْرَجُ عَبْدُ الرَّحْمَنِ، وَغَيْرُهُ، عَنْ أَبِي هُرَيْرَةَ‏.‏وَنَافِعٌ مَوْلَى عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُمَا حَدَّثَاهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ إِذَا اشْتَدَّ الْحَرُّ فَأَبْرِدُوا عَنِ الصَّلاَةِ، فَإِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ ‏\"‏‏.‏"
      },
      {
        "id": 523,
        "hadith_number": "535",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menangguhkan Solat Zuhur Ketika Cuaca Panas Terik",
        "perawi_melayu": "Diriwayatkan oleh Abu Dzar RA:",
        "english_text": "The Mu'adh-dhin (call-maker) of the Prophet (ﷺ) pronounced the Adhan (call) for the Zuhr prayer but the Prophet said, \"Let it be cooler, let it be cooler.\" Or said, 'Wait, wait, because the severity of heat is from the raging of the Hell-fire. In severe hot weather, pray when it becomes (a bit) cooler and the shadows of hillocks appear.\"",
        "malay_translation": "Muazzin (tukang azan) Nabi (SAW) telah melaungkan azan untuk solat Zuhur, tetapi Nabi bersabda, \"Biarkan ia menjadi lebih sejuk, biarkan ia menjadi lebih sejuk.\" Atau bersabda, \"Tunggu, tunggu, kerana teriknya panas adalah dari kobaran api neraka. Dalam cuaca panas yang teruk, solatlah ketika ia menjadi (sedikit) lebih sejuk dan bayang-bayang bukit kecil kelihatan.\"",
        "arabic_text": "حَدَّثَنَا ابْنُ بَشَّارٍ، قَالَ حَدَّثَنَا غُنْدَرٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الْمُهَاجِرِ أَبِي الْحَسَنِ، سَمِعَ زَيْدَ بْنَ وَهْبٍ، عَنْ أَبِي ذَرٍّ، قَالَ أَذَّنَ مُؤَذِّنُ النَّبِيِّ صلى الله عليه وسلم الظُّهْرَ فَقَالَ ‏\"‏ أَبْرِدْ أَبْرِدْ ـ أَوْ قَالَ ـ انْتَظِرِ انْتَظِرْ ‏\"‏‏.‏ وَقَالَ ‏\"‏ شِدَّةُ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ، فَإِذَا اشْتَدَّ الْحَرُّ فَأَبْرِدُوا عَنِ الصَّلاَةِ ‏\"‏‏.‏ حَتَّى رَأَيْنَا فَىْءَ التُّلُولِ‏.‏"
      },
      {
        "id": 524,
        "hadith_number": "536, 537",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menangguhkan Solat Zohor Ketika Cuaca Sangat Panas",
        "perawi_melayu": "Diriwayatkan oleh Abu Huraira RA:",
        "english_text": "The Prophet (ﷺ) said, \"In very hot weather delay the Zuhr prayer till it becomes (a bit) cooler because the severity of heat is from the raging of the Hell-fire.\r\n The Hell-fire of Hell complained to its Lord saying: O Lord! My parts are eating (destroying) one another. So Allah allowed it to take two breaths, one in the winter and the other in the summer. The breath in the summer is at the time when you feel the severest heat and the breath in the winter is at the time when you feel the severest cold.\"",
        "malay_translation": "Nabi SAW bersabda, \"Apabila cuaca sangat panas, tangguhkanlah solat Zohor sehingga menjadi (sedikit) lebih sejuk kerana teriknya panas itu adalah dari kepanasan neraka Jahanam.\r\nNeraka Jahanam mengadu kepada Tuhannya: Ya Tuhan! Bahagian-bahagianku saling memakan (memusnahkan) satu sama lain. Maka Allah mengizinkannya untuk mengambil dua nafas, satu di musim sejuk dan satu lagi di musim panas. Nafas di musim panas adalah pada waktu kamu merasakan panas yang paling teruk dan nafas di musim sejuk adalah pada waktu kamu merasakan sejuk yang paling teruk.\"",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَفِظْنَاهُ مِنَ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا اشْتَدَّ الْحَرُّ فَأَبْرِدُوا بِالصَّلاَةِ، فَإِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ ‏\"‏‏.‏‏\"‏ وَاشْتَكَتِ النَّارُ إِلَى رَبِّهَا فَقَالَتْ يَا رَبِّ أَكَلَ بَعْضِي بَعْضًا‏.‏ فَأَذِنَ لَهَا بِنَفَسَيْنِ نَفَسٍ فِي الشِّتَاءِ، وَنَفَسٍ فِي الصَّيْفِ، فَهُوَ أَشَدُّ مَا تَجِدُونَ مِنَ الْحَرِّ، وَأَشَدُّ مَا تَجِدُونَ مِنَ الزَّمْهَرِيرِ ‏\"‏‏.‏"
      },
      {
        "id": 525,
        "hadith_number": "538",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Anjuran Melewatkan Solat Zohor Ketika Cuaca Panas",
        "perawi_melayu": "Diriwayatkan oleh Abu Sa`id RA:",
        "english_text": "Allah's Messenger (ﷺ) said, \"Pray Zuhr prayer when it becomes (a bit) cooler as the severity of heat is from the raging of the Hell-fire.\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Solat Zohorlah ketika cuaca menjadi (sedikit) sejuk kerana kepanasan yang melampau itu adalah dari bahang neraka Jahanam.\"",
        "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا أَبُو صَالِحٍ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَبْرِدُوا بِالظُّهْرِ، فَإِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ ‏\"‏‏.‏ تَابَعَهُ سُفْيَانُ وَيَحْيَى وَأَبُو عَوَانَةَ عَنِ الأَعْمَشِ‏.‏"
      },
      {
        "id": 526,
        "hadith_number": "539",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menangguhkan Solat Zuhur Ketika Cuaca Panas",
        "perawi_melayu": "Diriwayatkan oleh Abu Dzar Al-Ghifari RA:",
        "english_text": "We were with the Prophet (ﷺ) on a journey and the Mu'adh-dhin (call maker for the prayer) wanted to pronounce the Adhan (call) for the Zuhr prayer. The Prophet (ﷺ) said, 'Let it become cooler.\" He again (after a while) wanted to pronounce the Adhan but the Prophet (ﷺ) said to him, \"Let it become cooler till we see the shadows of hillocks.\" The Prophet (ﷺ) added, \"The severity of heat is from the raging of the Hell-fire, and in very hot weather pray (Zuhr) when it becomes cooler.\"",
        "malay_translation": "Kami bersama Nabi SAW dalam suatu perjalanan, dan Muazin (tukang azan) ingin melaungkan azan untuk solat Zuhur. Nabi SAW bersabda, \"Biarkan ia menjadi lebih sejuk.\" Dia (selepas beberapa ketika) ingin melaungkan azan lagi, tetapi Nabi SAW bersabda kepadanya, \"Biarkan ia menjadi lebih sejuk sehingga kita melihat bayang-bayang bukit.\" Nabi SAW menambah, \"Kepanasan yang teruk adalah dari bahang neraka, dan ketika cuaca sangat panas, solatlah Zuhur apabila ia menjadi lebih sejuk.\"",
        "arabic_text": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا مُهَاجِرٌ أَبُو الْحَسَنِ، مَوْلًى لِبَنِي تَيْمِ اللَّهِ قَالَ سَمِعْتُ زَيْدَ بْنَ وَهْبٍ، عَنْ أَبِي ذَرٍّ الْغِفَارِيِّ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي سَفَرٍ، فَأَرَادَ الْمُؤَذِّنُ أَنْ يُؤَذِّنَ لِلظُّهْرِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَبْرِدْ ‏\"‏‏.‏ ثُمَّ أَرَادَ أَنْ يُؤَذِّنَ فَقَالَ لَهُ ‏\"‏ أَبْرِدْ ‏\"‏‏.‏ حَتَّى رَأَيْنَا فَىْءَ التُّلُولِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ، فَإِذَا اشْتَدَّ الْحَرُّ فَأَبْرِدُوا بِالصَّلاَةِ ‏\"‏‏.‏ وَقَالَ ابْنُ عَبَّاسٍ تَتَفَيَّأُ تَتَمَيَّلُ‏.‏"
      },
      {
        "id": 527,
        "hadith_number": "540",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah ﷺ Menerangkan Perihal Hari Kiamat dan Galakan Bertanya",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik RA:",
        "english_text": "Allah's Messenger (ﷺ) came out as the sun declined at midday and offered the Zuhr prayer. He then stood on the pulpit and spoke about the Hour (Day of Judgment) and said that in it there would be tremendous things. He then said, \"Whoever likes to ask me about anything he can do so and I shall reply as long as I am at this place of mine. Most of the people wept and the Prophet (ﷺ) said repeatedly, \"Ask me.\" `Abdullah bin Hudhafa As-Sahmi stood up and said, \"Who is my father?\" The Prophet (ﷺ) said, \"Your father is Hudhafa.\" The Prophet (ﷺ) repeatedly said, \"Ask me.\" Then `Umar knelt before him and said, \"We are pleased with Allah as our Lord, Islam as our religion, and Muhammad as our Prophet.\" The Prophet then became quiet and said, \"Paradise and Hell-fire were displayed in front of me on this wall just now and I have never seen a better thing (than the former) and a worse thing (than the latter).",
        "malay_translation": "Rasulullah ﷺ keluar ketika matahari tergelincir pada tengah hari dan menunaikan solat Zuhur. Kemudian Baginda berdiri di atas mimbar dan berbicara tentang Hari Kiamat dan menyatakan bahawa di dalamnya akan terjadi perkara-perkara yang dahsyat. Baginda kemudian bersabda, \"Sesiapa yang ingin bertanya kepadaku tentang apa sahaja, boleh berbuat demikian dan aku akan menjawab selagi aku berada di tempat ini.\" Kebanyakan orang menangis dan Nabi ﷺ berulang kali bersabda, \"Bertanyalah kepadaku.\" Abdullah bin Hudhafa As-Sahmi berdiri dan bertanya, \"Siapakah ayahku?\" Nabi ﷺ bersabda, \"Ayahmu adalah Hudhafa.\" Nabi ﷺ berulang kali bersabda, \"Bertanyalah kepadaku.\" Kemudian Umar RA berlutut di hadapan Baginda dan berkata, \"Kami redha Allah sebagai Tuhan kami, Islam sebagai agama kami, dan Muhammad sebagai Nabi kami.\" Kemudian Nabi ﷺ berdiam diri dan bersabda, \"Syurga dan Neraka telah diperlihatkan di hadapanku di dinding ini sekarang dan aku tidak pernah melihat sesuatu yang lebih baik (daripada yang pertama) dan sesuatu yang lebih buruk (daripada yang kedua).",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ حِينَ زَاغَتِ الشَّمْسُ فَصَلَّى الظُّهْرَ، فَقَامَ عَلَى الْمِنْبَرِ، فَذَكَرَ السَّاعَةَ، فَذَكَرَ أَنَّ فِيهَا أُمُورًا عِظَامًا ثُمَّ قَالَ ‏\"‏ مَنْ أَحَبَّ أَنْ يَسْأَلَ عَنْ شَىْءٍ فَلْيَسْأَلْ، فَلاَ تَسْأَلُونِي عَنْ شَىْءٍ إِلاَّ أَخْبَرْتُكُمْ مَا دُمْتُ فِي مَقَامِي هَذَا ‏\"‏‏.‏ فَأَكْثَرَ النَّاسُ فِي الْبُكَاءِ، وَأَكْثَرَ أَنْ يَقُولَ ‏\"‏ سَلُونِي ‏\"‏‏.‏ فَقَامَ عَبْدُ اللَّهِ بْنُ حُذَافَةَ السَّهْمِيُّ فَقَالَ مَنْ أَبِي قَالَ ‏\"‏ أَبُوكَ حُذَافَةُ ‏\"‏‏.‏ ثُمَّ أَكْثَرَ أَنْ يَقُولَ ‏\"‏ سَلُونِي ‏\"‏‏.‏ فَبَرَكَ عُمَرُ عَلَى رُكْبَتَيْهِ فَقَالَ رَضِينَا بِاللَّهِ رَبًّا، وَبِالإِسْلاَمِ دِينًا، وَبِمُحَمَّدٍ نَبِيًّا‏.‏ فَسَكَتَ ثُمَّ قَالَ ‏\"‏ عُرِضَتْ عَلَىَّ الْجَنَّةُ وَالنَّارُ آنِفًا فِي عُرْضِ هَذَا الْحَائِطِ فَلَمْ أَرَ كَالْخَيْرِ وَالشَّرِّ ‏\"‏‏.‏"
      },
      {
        "id": 528,
        "hadith_number": "541",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Waktu Solat Nabi Muhammad ﷺ: Subuh, Zohor, Asar dan Isyak",
        "perawi_melayu": "Diriwayatkan oleh Abu Barza رضي الله عنه :",
        "english_text": "\"The Prophet (ﷺ) used to offer the Fajr (prayer) when one could recognize the person sitting by him (after the prayer) and he used to recite between 60 to 100 Ayat (verses) of the Qur'an. He used to offer the Zuhr prayer as soon as the sun declined (at noon) and the `Asr at a time when a man might go and return from the farthest place in Medina and find the sun still hot. (The sub-narrator forgot what was said about the Maghrib). He did not mind delaying the `Isha prayer to one third of the night or the middle of the night.\"",
        "malay_translation": "\"Nabi ﷺ biasanya menunaikan solat Subuh ketika seseorang dapat mengenali orang yang duduk di sisinya (selepas solat) dan Baginda membaca antara 60 hingga 100 ayat al-Quran. Baginda menunaikan solat Zohor sebaik sahaja matahari tergelincir (pada tengah hari) dan solat Asar pada waktu seorang lelaki boleh pergi dan kembali dari tempat terjauh di Madinah dan mendapati matahari masih panas. (Perawi lupa apa yang dikatakan tentang Maghrib). Baginda tidak keberatan melewatkan solat Isyak hingga sepertiga malam atau pertengahan malam.\"",
        "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي الْمِنْهَالِ، عَنْ أَبِي بَرْزَةَ، كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي الصُّبْحَ وَأَحَدُنَا يَعْرِفُ جَلِيسَهُ، وَيَقْرَأُ فِيهَا مَا بَيْنَ السِّتِّينَ إِلَى الْمِائَةِ، وَيُصَلِّي الظُّهْرَ إِذَا زَالَتِ الشَّمْسُ، وَالْعَصْرَ وَأَحَدُنَا يَذْهَبُ إِلَى أَقْصَى الْمَدِينَةِ ثُمَّ يَرْجِعُ وَالشَّمْسُ حَيَّةٌ، وَنَسِيتُ مَا قَالَ فِي الْمَغْرِبِ، وَلاَ يُبَالِي بِتَأْخِيرِ الْعِشَاءِ إِلَى ثُلُثِ اللَّيْلِ‏.‏ ثُمَّ قَالَ إِلَى شَطْرِ اللَّيْلِ‏.‏ وَقَالَ مُعَاذٌ قَالَ شُعْبَةُ ثُمَّ لَقِيتُهُ مَرَّةً فَقَالَ أَوْ ثُلُثِ اللَّيْلِ‏.‏"
      },
      {
        "id": 529,
        "hadith_number": "542",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Bersujud di Atas Pakaian Ketika Solat Zohor Kerana Panas",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik رضی اللہ عنہ :",
        "english_text": "When we offered the Zuhr prayers behind Allah's Messenger (ﷺ) we used to prostrate on our clothes to protect ourselves from the heat.",
        "malay_translation": "Ketika kami menunaikan solat Zohor di belakang Rasulullah SAW, kami biasanya bersujud di atas pakaian kami untuk melindungi diri daripada panas.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدٌ ـ يَعْنِي ابْنَ مُقَاتِلٍ ـ قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ الرَّحْمَنِ، حَدَّثَنِي غَالِبٌ الْقَطَّانُ، عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ الْمُزَنِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كُنَّا إِذَا صَلَّيْنَا خَلْفَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِالظَّهَائِرِ فَسَجَدْنَا عَلَى ثِيَابِنَا اتِّقَاءَ الْحَرِّ‏.‏"
      },
      {
        "id": 530,
        "hadith_number": "543",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah ﷺ Menunaikan Solat Zuhur dan Asar Lapan Rakaat, Maghrib dan Isyak Tujuh Rakaat di Madinah",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Abbas رضي الله عنهما:",
        "english_text": "\"The Prophet (ﷺ) prayed eight rak`at for the Zuhr and `Asr, and seven for the Maghrib and `Isha prayers in Medina.\" Ayyub said, \"Perhaps those were rainy nights.\" He (Jabir bin Zaid) said: \"May be.\"",
        "malay_translation": "\"Nabi ﷺ menunaikan solat lapan rakaat bagi solat Zuhur dan Asar, dan tujuh rakaat bagi solat Maghrib dan Isyak di Madinah.\" Ayyub berkata, \"Mungkin malam-malam itu adalah malam hujan.\" Dia (Jabir bin Zaid) berkata: \"Mungkin.\"",
        "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ حَدَّثَنَا حَمَّادٌ ـ هُوَ ابْنُ زَيْدٍ ـ عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرِ بْنِ زَيْدٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى بِالْمَدِينَةِ سَبْعًا وَثَمَانِيًا الظُّهْرَ وَالْعَصْرَ، وَالْمَغْرِبَ وَالْعِشَاءَ‏.‏ فَقَالَ أَيُّوبُ لَعَلَّهُ فِي لَيْلَةٍ مَطِيرَةٍ‏.‏ قَالَ عَسَى‏.‏"
      },
      {
        "id": 531,
        "hadith_number": "544",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Waktu Solat Asar Nabi Muhammad ﷺ",
        "perawi_melayu": "Diriwayatkan oleh Aisyah RA:",
        "english_text": "Allah's Messenger (ﷺ) used to offer the `Asr prayer when the sunshine had not disappeared from my chamber.",
        "malay_translation": "Rasulullah ﷺ biasa menunaikan solat Asar ketika cahaya matahari belum hilang dari bilikku.",
        "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، أَنَّ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي الْعَصْرَ وَالشَّمْسُ لَمْ تَخْرُجْ مِنْ حُجْرَتِهَا‏.‏ وَقَالَ أَبُو أُسَامَةَ عَنْ هِشَامٍ مِنْ قَعْرِ حُجْرَتِهَا‏.‏"
      },
      {
        "id": 532,
        "hadith_number": "545",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Waktu Solat Asar Mengikut Sunnah Nabi Muhammad SAW",
        "perawi_melayu": "Diriwayatkan daripada `Aisha R.A:",
        "english_text": "Allah's Messenger (ﷺ) used to offer the `Asr prayers at a time when the sunshine was still inside my chamber and no shadow had yet appeared in it.",
        "malay_translation": "Rasulullah SAW biasanya menunaikan solat Asar ketika cahaya matahari masih berada di dalam bilikku dan belum ada bayangan yang muncul di dalamnya.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى الْعَصْرَ وَالشَّمْسُ فِي حُجْرَتِهَا، لَمْ يَظْهَرِ الْفَىْءُ مِنْ حُجْرَتِهَا‏.‏"
      },
      {
        "id": 533,
        "hadith_number": "546",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Waktu Solat Asar Ketika Matahari Masih Terang",
        "perawi_melayu": "Diriwayatkan oleh Aisyah RA:",
        "english_text": "The Prophet (ﷺ) used to pray the `Asr prayers at a time when the sunshine was still inside my chamber and no shadow had yet appeared in it.",
        "malay_translation": "Nabi SAW biasanya menunaikan solat Asar ketika cahaya matahari masih berada di dalam bilikku dan belum ada bayang-bayang yang muncul di dalamnya.",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ أَخْبَرَنَا ابْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي صَلاَةَ الْعَصْرِ وَالشَّمْسُ طَالِعَةٌ فِي حُجْرَتِي لَمْ يَظْهَرِ الْفَىْءُ بَعْدُ‏.‏ وَقَالَ مَالِكٌ وَيَحْيَى بْنُ سَعِيدٍ وَشُعَيْبٌ وَابْنُ أَبِي حَفْصَةَ وَالشَّمْسُ قَبْلَ أَنْ تَظْهَرَ‏.‏"
      },
      {
        "id": 534,
        "hadith_number": "547",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Waktu Solat Fardhu Berjemaah Nabi Muhammad SAW",
        "perawi_melayu": "Diriwayatkan oleh Saiyar bin Salama:",
        "english_text": "I along with my father went to Abu- Barza Al-Aslami رضی اللہ عنہ and my father asked him, \"How Allah's Messenger (ﷺ) used to offer the five compulsory congregational prayers?\" Abu- Barza said, \"The Prophet (ﷺ) used to pray the Zuhr prayer which you (people) call the first one at midday when the sun had just declined The `Asr prayer at a time when after the prayer, a man could go to the house at the farthest place in Medina (and arrive) while the sun was still hot. (I forgot about the Maghrib prayer). The Prophet (ﷺ) Loved to delay the `Isha which you call Al- `Atama and he disliked sleeping before it and speaking after it. After the Fajr prayer he used to leave when a man could recognize the one sitting beside him and he used to recite between 60 to 100 Ayat (in the Fajr prayer) .",
        "malay_translation": "Saya bersama ayah saya pergi menemui Abu-Barza Al-Aslami RA. Ayah saya bertanya kepadanya, \"Bagaimanakah Rasulullah SAW menunaikan solat fardhu lima waktu secara berjemaah?\" Abu-Barza berkata, \"Nabi SAW biasanya menunaikan solat Zohor, yang kamu (orang ramai) panggil yang pertama, pada tengah hari apabila matahari baru sahaja tergelincir. Solat Asar pula ditunaikan pada waktu apabila selepas solat, seseorang boleh pergi ke rumah di tempat yang paling jauh di Madinah (dan tiba) sementara matahari masih panas. (Saya terlupa tentang solat Maghrib). Nabi SAW suka melewatkan solat Isyak yang kamu panggil Al-'Atama dan baginda tidak suka tidur sebelum menunaikannya dan bercakap selepasnya. Selepas solat Subuh, baginda biasanya pergi apabila seseorang boleh mengenali orang yang duduk di sebelahnya dan baginda biasanya membaca antara 60 hingga 100 ayat (dalam solat Subuh).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا عَوْفٌ، عَنْ سَيَّارِ بْنِ سَلاَمَةَ، قَالَ دَخَلْتُ أَنَا وَأَبِي، عَلَى أَبِي بَرْزَةَ الأَسْلَمِيِّ، فَقَالَ لَهُ أَبِي كَيْفَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي الْمَكْتُوبَةَ فَقَالَ كَانَ يُصَلِّي الْهَجِيرَ الَّتِي تَدْعُونَهَا الأُولَى حِينَ تَدْحَضُ الشَّمْسُ، وَيُصَلِّي الْعَصْرَ، ثُمَّ يَرْجِعُ أَحَدُنَا إِلَى رَحْلِهِ فِي أَقْصَى الْمَدِينَةِ وَالشَّمْسُ حَيَّةٌ ـ وَنَسِيتُ مَا قَالَ فِي الْمَغْرِبِ ـ وَكَانَ يَسْتَحِبُّ أَنْ يُؤَخِّرَ الْعِشَاءَ الَّتِي تَدْعُونَهَا الْعَتَمَةَ، وَكَانَ يَكْرَهُ النَّوْمَ قَبْلَهَا وَالْحَدِيثَ بَعْدَهَا، وَكَانَ يَنْفَتِلُ مِنْ صَلاَةِ الْغَدَاةِ حِينَ يَعْرِفُ الرَّجُلُ جَلِيسَهُ، وَيَقْرَأُ بِالسِّتِّينَ إِلَى الْمِائَةِ‏.‏"
      },
      {
        "id": 535,
        "hadith_number": "548",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menunaikan Solat Asar dan Keadaan Bani Amr bin Auf",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik RA:",
        "english_text": "We used to pray the `Asr prayer and after that if someone happened to go to the tribe of Bani `Amr bin `Auf, he would find them still praying the `Asr (prayer).",
        "malay_translation": "Kami biasanya menunaikan solat Asar dan selepas itu jika seseorang pergi ke perkampungan Bani 'Amr bin 'Auf, dia akan mendapati mereka masih lagi menunaikan solat Asar.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كُنَّا نُصَلِّي الْعَصْرَ ثُمَّ يَخْرُجُ الإِنْسَانُ إِلَى بَنِي عَمْرِو بْنِ عَوْفٍ فَنَجِدُهُمْ يُصَلُّونَ الْعَصْرَ‏.‏"
      },
      {
        "id": 536,
        "hadith_number": "549",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menunaikan Solat Asar pada Waktunya Seperti yang Dilakukan oleh Rasulullah SAW",
        "perawi_melayu": "Diriwayatkan oleh Abu Bakr bin `Uthman bin Sahl bin Hunaif bahawa beliau mendengar Abu Umama berkata:",
        "english_text": "We prayed the Zuhr prayer with `Umar bin `Abdul `Aziz and then went to Anas bin Malik رضی اللہ عنہ and found him offering the `Asr prayer. I asked him, \"O uncle! Which prayer have you offered?\" He said 'The `Asr and this is (the time of) the prayer of Allah s Apostle which we used to pray with him.'",
        "malay_translation": "Kami menunaikan solat Zohor bersama `Umar bin `Abdul `Aziz kemudian pergi kepada Anas bin Malik RA dan mendapati beliau sedang menunaikan solat Asar. Aku bertanya kepadanya, \"Wahai pakcik! Solat apakah yang telah kamu tunaikan?\" Beliau menjawab, 'Solat Asar dan inilah (waktu) solat Rasulullah SAW yang biasa kami tunaikan bersama baginda.'",
        "arabic_text": "حَدَّثَنَا ابْنُ مُقَاتِلٍ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا أَبُو بَكْرِ بْنُ عُثْمَانَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، قَالَ سَمِعْتُ أَبَا أُمَامَةَ، يَقُولُ صَلَّيْنَا مَعَ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ الظُّهْرَ، ثُمَّ خَرَجْنَا حَتَّى دَخَلْنَا عَلَى أَنَسِ بْنِ مَالِكٍ فَوَجَدْنَاهُ يُصَلِّي الْعَصْرَ فَقُلْتُ يَا عَمِّ، مَا هَذِهِ الصَّلاَةُ الَّتِي صَلَّيْتَ قَالَ الْعَصْرُ، وَهَذِهِ صَلاَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم الَّتِي كُنَّا نُصَلِّي مَعَهُ‏.‏"
      },
      {
        "id": 537,
        "hadith_number": "550",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Waktu Solat Asar Ketika Matahari Masih Terik",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik رضی اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) used to offer the `Asr prayer at a time when the sun was still hot and high and if a person went to Al-`Awali (a place) of Medina, he would reach there when the sun was still high. Some of Al-`Awali of Medina were about four miles or so from the town.",
        "malay_translation": "Rasulullah (ﷺ) biasa menunaikan solat Asar ketika matahari masih terik dan tinggi. Jika seseorang pergi ke Al-`Awali (suatu tempat) di Madinah, dia akan sampai di sana ketika matahari masih tinggi. Sebahagian Al-`Awali di Madinah berjarak kira-kira empat batu atau lebih dari kota itu.",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي الْعَصْرَ وَالشَّمْسُ مُرْتَفِعَةٌ حَيَّةٌ، فَيَذْهَبُ الذَّاهِبُ إِلَى الْعَوَالِي فَيَأْتِيهِمْ وَالشَّمْسُ مُرْتَفِعَةٌ، وَبَعْضُ الْعَوَالِي مِنَ الْمَدِينَةِ عَلَى أَرْبَعَةِ أَمْيَالٍ أَوْ نَحْوِهِ‏.‏"
      },
      {
        "id": 538,
        "hadith_number": "551",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Waktu Solat Asar dan Perjalanan ke Quba'",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik RA:",
        "english_text": "We used to pray the `Asr and after that if one of US went to Quba' he would arrive there while the sun was still high.",
        "malay_translation": "Kami biasa menunaikan solat Asar dan selepas itu jika salah seorang daripada kami pergi ke Quba', dia akan tiba di sana ketika matahari masih tinggi.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كُنَّا نُصَلِّي الْعَصْرَ ثُمَّ يَذْهَبُ الذَّاهِبُ مِنَّا إِلَى قُبَاءٍ، فَيَأْتِيهِمْ وَالشَّمْسُ مُرْتَفِعَةٌ‏.‏"
      },
      {
        "id": 539,
        "hadith_number": "552",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ancaman Bagi Sesiapa yang Meninggalkan Solat Asar",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Umar رضی اللہ عنہما:",
        "english_text": "Allah's Messenger (ﷺ) said, \"Whoever misses the `Asr prayer (intentionally) then it is as if he lost his family and property.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Sesiapa yang tertinggal solat Asar (dengan sengaja), maka seolah-olah dia telah kehilangan keluarga dan hartanya.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الَّذِي تَفُوتُهُ صَلاَةُ الْعَصْرِ كَأَنَّمَا وُتِرَ أَهْلَهُ وَمَالَهُ ‏\"‏‏.‏"
      },
      {
        "id": 540,
        "hadith_number": "553",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kepentingan Menjaga Solat Asar dan Akibat Meninggalkannya",
        "perawi_melayu": "Diriwayatkan oleh Abu Al-Malih:",
        "english_text": "We were with Buraida رضی اللہ عنہ in a battle on a cloudy day and he said, \"Offer the `Asr prayer early as the Prophet said, \"Whoever leaves the `Asr prayer, all his (good) deeds will be annulled.\"",
        "malay_translation": "Kami bersama Buraida رضی اللہ عنہ dalam sebuah peperangan pada hari yang mendung, dan beliau berkata, \"Laksanakan solat Asar di awal waktu kerana Nabi bersabda, \"Sesiapa yang meninggalkan solat Asar, maka terhapuslah segala amalannya.\"",
        "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا هِشَامٌ، قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الْمَلِيحِ، قَالَ كُنَّا مَعَ بُرَيْدَةَ فِي غَزْوَةٍ فِي يَوْمٍ ذِي غَيْمٍ فَقَالَ بَكِّرُوا بِصَلاَةِ الْعَصْرِ فَإِنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ تَرَكَ صَلاَةَ الْعَصْرِ فَقَدْ حَبِطَ عَمَلُهُ ‏\"‏‏.‏"
      },
      {
        "id": 541,
        "hadith_number": "554",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Melihat Allah SWT di Akhirat Seperti Melihat Bulan Purnama",
        "perawi_melayu": "Diriwayatkan oleh Jarir:",
        "english_text": "\"We were with the Prophet (ﷺ) and he looked at the moon--full-moon--and said, 'Certainly you will see your Lord as you see this moon and you will have no trouble in seeing Him. So if you can avoid missing (through sleep or business, etc.) a prayer before the sunrise (Fajr) and a prayer before sunset (`Asr), you must do so.' He then recited Allah's Statement: \r\n  ___And celebrate the praises Of your Lord before the rising of the sun and before (its) setting.\" (50.39)\r\n           Isma`il said, \"Offer those prayers and do not miss them.\"",
        "malay_translation": "\"Kami bersama Nabi Muhammad SAW dan baginda melihat bulan--bulan purnama--dan bersabda, 'Sesungguhnya kamu akan melihat Tuhan kamu sebagaimana kamu melihat bulan ini dan kamu tidak akan mengalami kesukaran dalam melihat-Nya.  Oleh itu, jika kamu mampu untuk tidak meninggalkan (kerana tidur atau urusan dunia, dll.) solat sebelum terbit matahari (Fajr) dan solat sebelum terbenam matahari (Asar), maka lakukanlah.' Kemudian baginda membaca firman Allah:  'Dan bertasbihlah dengan memuji Tuhanmu sebelum terbit matahari dan sebelum terbenamnya.' (Qaf 50:39)  Isma'il berkata, 'Dirikanlah solat-solat tersebut dan janganlah kamu meninggalkannya.'\"",
        "arabic_text": "حَدَّثَنَا الْحُمَيْدِيُّ، قَالَ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ قَيْسٍ، عَنْ جَرِيرٍ، قَالَ كُنَّا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَنَظَرَ إِلَى الْقَمَرِ لَيْلَةً ـ يَعْنِي الْبَدْرَ ـ فَقَالَ ‏\"‏ إِنَّكُمْ سَتَرَوْنَ رَبَّكُمْ كَمَا تَرَوْنَ هَذَا الْقَمَرَ لاَ تُضَامُّونَ فِي رُؤْيَتِهِ، فَإِنِ اسْتَطَعْتُمْ أَنْ لاَ تُغْلَبُوا عَلَى صَلاَةٍ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ غُرُوبِهَا فَافْعَلُوا ‏\"‏‏.‏ ثُمَّ قَرَأَ ‏{‏وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ الْغُرُوبِ‏}‏‏.‏ قَالَ إِسْمَاعِيلُ افْعَلُوا لاَ تَفُوتَنَّكُمْ‏.‏"
      },
      {
        "id": 542,
        "hadith_number": "555",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Malaikat Bertugas Secara Bergilir pada Waktu Subuh dan Asar",
        "perawi_melayu": "Diriwayatkan oleh Abu Huraira رضی اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) said, \"Angels come to you in succession by night and day and all of them get together at the time of the Fajr and `Asr prayers. Those who have passed the night with you (or stayed with you) ascend (to the Heaven) and Allah asks them, though He knows everything about you, well, \"In what state did you leave my slaves?\" The angels reply: \"When we left them they were praying and when we reached them, they were praying.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Malaikat datang kepada kamu secara bergilir pada waktu malam dan siang, dan kesemuanya berkumpul pada waktu solat Subuh dan Asar. Malaikat yang telah bermalam dengan kamu (atau tinggal bersama kamu) naik (ke langit) dan Allah bertanya kepada mereka, walaupun Dia mengetahui segala-galanya tentang kamu, \"Dalam keadaan apa kamu meninggalkan hamba-hamba-Ku?\" Para malaikat menjawab: \"Ketika kami meninggalkan mereka, mereka sedang solat dan ketika kami sampai kepada mereka, mereka sedang solat.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ يَتَعَاقَبُونَ فِيكُمْ مَلاَئِكَةٌ بِاللَّيْلِ وَمَلاَئِكَةٌ بِالنَّهَارِ، وَيَجْتَمِعُونَ فِي صَلاَةِ الْفَجْرِ وَصَلاَةِ الْعَصْرِ، ثُمَّ يَعْرُجُ الَّذِينَ بَاتُوا فِيكُمْ، فَيَسْأَلُهُمْ وَهْوَ أَعْلَمُ بِهِمْ كَيْفَ تَرَكْتُمْ عِبَادِي فَيَقُولُونَ تَرَكْنَاهُمْ وَهُمْ يُصَلُّونَ، وَأَتَيْنَاهُمْ وَهُمْ يُصَلُّونَ ‏\"‏‏.‏"
      },
      {
        "id": 543,
        "hadith_number": "556",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menyempurnakan Solat Asar dan Subuh Jika Mendapati Satu Rakaat Sebelum Matahari Terbenam atau Terbit",
        "perawi_melayu": "Diriwayatkan oleh Abu Huraira RA:",
        "english_text": "Allah's Messenger (ﷺ) said, \"If anyone of you can get one rak`a of the `Asr prayer before sunset, he should complete his prayer. If any of you can get one rak`a of the Fajr prayer before sunrise, he should complete his prayer.\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Jika sesiapa di antara kamu sempat mendapat satu rakaat solat Asar sebelum matahari terbenam, maka hendaklah dia menyempurnakan solatnya. Jika sesiapa di antara kamu sempat mendapat satu rakaat solat Subuh sebelum matahari terbit, maka hendaklah dia menyempurnakan solatnya.\"",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا أَدْرَكَ أَحَدُكُمْ سَجْدَةً مِنْ صَلاَةِ الْعَصْرِ قَبْلَ أَنْ تَغْرُبَ الشَّمْسُ فَلْيُتِمَّ صَلاَتَهُ، وَإِذَا أَدْرَكَ سَجْدَةً مِنْ صَلاَةِ الصُّبْحِ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ فَلْيُتِمَّ صَلاَتَهُ ‏\"‏‏.‏"
      },
      {
        "id": 544,
        "hadith_number": "557",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perbandingan Tempoh Umat Muhammad dengan Umat Terdahulu",
        "perawi_melayu": "Diriwayatkan oleh Salim bin `Abdullah:",
        "english_text": "My father said, \"I heard Allah's Messenger (ﷺ) saying, 'The period of your stay as compared to the previous nations is like the period equal to the time between the `Asr prayer and sunset. The people of the Torah were given the Torah and they acted (upon it) till midday then they were exhausted and were given one Qirat (of gold) each. And then the people of the Gospel were given the Gospel and they acted (upon it) till the `Asr prayer then they were exhausted and were! given one Qirat each. And then we were given the Qur'an and we acted (upon it) till sunset and we were given two Qirats each. On that the people of both the scriptures said, 'O our Lord! You have given them two Qirats and given us one Qirat, though we have worked more than they.' Allah said, 'Have I usurped some of your right?' They said, 'No.' Allah said: \"That is my blessing I bestow upon whomsoever I wish.\"",
        "malay_translation": "Bapaku berkata, \"Aku mendengar Rasulullah (ﷺ) bersabda, 'Tempoh kamu tinggal (di dunia) berbanding dengan umat-umat terdahulu adalah seperti tempoh antara solat Asar dan matahari terbenam. Ahli Taurat diberikan Taurat dan mereka beramal dengannya sehingga tengah hari, kemudian mereka penat dan diberikan satu Qirat (emas) setiap seorang. Kemudian ahli Injil diberikan Injil dan mereka beramal dengannya sehingga solat Asar, kemudian mereka penat dan diberikan satu Qirat setiap seorang. Kemudian kita diberikan al-Quran dan kita beramal dengannya sehingga matahari terbenam dan kita diberikan dua Qirat setiap seorang.' Maka berkatalah ahli kedua-dua kitab itu, 'Wahai Tuhan kami! Engkau telah memberikan mereka dua Qirat dan memberikan kami satu Qirat, walaupun kami telah bekerja lebih daripada mereka.' Allah berfirman, 'Adakah Aku telah mengambil hak kamu?' Mereka berkata, 'Tidak.' Allah berfirman: \"Itulah kurniaan-Ku yang Aku berikan kepada sesiapa yang Aku kehendaki.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، أَنَّهُ أَخْبَرَهُ أَنَّهُ، سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنَّمَا بَقَاؤُكُمْ فِيمَا سَلَفَ قَبْلَكُمْ مِنَ الأُمَمِ كَمَا بَيْنَ صَلاَةِ الْعَصْرِ إِلَى غُرُوبِ الشَّمْسِ، أُوتِيَ أَهْلُ التَّوْرَاةِ التَّوْرَاةَ فَعَمِلُوا حَتَّى إِذَا انْتَصَفَ النَّهَارُ عَجَزُوا، فَأُعْطُوا قِيرَاطًا قِيرَاطًا، ثُمَّ أُوتِيَ أَهْلُ الإِنْجِيلِ الإِنْجِيلَ فَعَمِلُوا إِلَى صَلاَةِ الْعَصْرِ، ثُمَّ عَجَزُوا، فَأُعْطُوا قِيرَاطًا قِيرَاطًا، ثُمَّ أُوتِينَا الْقُرْآنَ فَعَمِلْنَا إِلَى غُرُوبِ الشَّمْسِ، فَأُعْطِينَا قِيرَاطَيْنِ قِيرَاطَيْنِ، فَقَالَ أَهْلُ الْكِتَابَيْنِ أَىْ رَبَّنَا أَعْطَيْتَ هَؤُلاَءِ قِيرَاطَيْنِ قِيرَاطَيْنِ، وَأَعْطَيْتَنَا قِيرَاطًا قِيرَاطًا، وَنَحْنُ كُنَّا أَكْثَرَ عَمَلاً، قَالَ قَالَ اللَّهُ عَزَّ وَجَلَّ هَلْ ظَلَمْتُكُمْ مِنْ أَجْرِكُمْ مِنْ شَىْءٍ قَالُوا لاَ، قَالَ فَهْوَ فَضْلِي أُوتِيهِ مَنْ أَشَاءُ ‏\"‏‏.‏"
      },
      {
        "id": 545,
        "hadith_number": "558",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perumpamaan Umat Islam, Yahudi dan Nasrani",
        "perawi_melayu": "Diriwayatkan oleh Abu Musa RA:",
        "english_text": "The Prophet (ﷺ) said, \"The example of Muslims, Jews and Christians is like the example of a man who employed laborers to work for him from morning till night. They worked till midday and they said, 'We are not in need of your reward.' So the man employed another batch and said to them, 'Complete the rest of the day and yours will be the wages I had fixed (for the first batch). They worked until the time of the `Asr prayer and said, 'Whatever we have done is for you.' He employed another batch. They worked for the rest of the day till sunset, and they received the wages of the two former batches.\"",
        "malay_translation": "Nabi Muhammad SAW bersabda, \"Perumpamaan umat Islam, Yahudi dan Nasrani adalah seperti seorang lelaki yang mengupah pekerja untuk bekerja untuknya dari pagi hingga malam. Mereka bekerja sehingga tengah hari dan mereka berkata, 'Kami tidak memerlukan ganjaranmu.' Maka lelaki itu mengupah kumpulan lain dan berkata kepada mereka, 'Selesaikan baki hari ini dan upah kamu adalah upah yang telah aku tetapkan (untuk kumpulan pertama).' Mereka bekerja sehingga waktu solat Asar dan berkata, 'Apa sahaja yang telah kami lakukan adalah untukmu.' Dia mengupah satu lagi kumpulan. Mereka bekerja sepanjang baki hari itu sehingga matahari terbenam, dan mereka menerima upah dua kumpulan yang sebelumnya.\"",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏ \"‏ مَثَلُ الْمُسْلِمِينَ وَالْيَهُودِ وَالنَّصَارَى كَمَثَلِ رَجُلٍ اسْتَأْجَرَ قَوْمًا يَعْمَلُونَ لَهُ عَمَلاً إِلَى اللَّيْلِ، فَعَمِلُوا إِلَى نِصْفِ النَّهَارِ، فَقَالُوا لاَ حَاجَةَ لَنَا إِلَى أَجْرِكَ، فَاسْتَأْجَرَ آخَرِينَ فَقَالَ أَكْمِلُوا بَقِيَّةَ يَوْمِكُمْ، وَلَكُمُ الَّذِي شَرَطْتُ، فَعَمِلُوا حَتَّى إِذَا كَانَ حِينَ صَلاَةِ الْعَصْرِ قَالُوا لَكَ مَا عَمِلْنَا‏.‏ فَاسْتَأْجَرَ قَوْمًا فَعَمِلُوا بَقِيَّةَ يَوْمِهِمْ حَتَّى غَابَتِ الشَّمْسُ، وَاسْتَكْمَلُوا أَجْرَ الْفَرِيقَيْنِ ‏\"‏‏.‏"
      },
      {
        "id": 546,
        "hadith_number": "559",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menunaikan Solat Maghrib Bersama Nabi ﷺ dan Jarak Penglihatan Selepasnya",
        "perawi_melayu": "Diriwayatkan oleh Rafi' bin Khadij رضي الله عنه :",
        "english_text": "We used to offer the Maghrib prayer with the Prophet (ﷺ) and after finishing the prayer one of us may go away and could still see as Par as the spots where one's arrow might reach when shot by a bow.",
        "malay_translation": "Kami dahulunya menunaikan solat Maghrib bersama Nabi ﷺ, dan setelah selesai solat, salah seorang dari kami boleh pergi dan masih dapat melihat sejauh tempat anak panah yang boleh dicapai apabila dipanah dengan busur.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ، قَالَ حَدَّثَنَا الْوَلِيدُ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنَا أَبُو النَّجَاشِيِّ، صُهَيْبٌ مَوْلَى رَافِعِ بْنِ خَدِيجٍ قَالَ سَمِعْتُ رَافِعَ بْنَ خَدِيجٍ، يَقُولُ كُنَّا نُصَلِّي الْمَغْرِبَ مَعَ النَّبِيِّ صلى الله عليه وسلم فَيَنْصَرِفُ أَحَدُنَا وَإِنَّهُ لَيُبْصِرُ مَوَاقِعَ نَبْلِهِ‏.‏"
      },
      {
        "id": 547,
        "hadith_number": "560",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Waktu Solat di Zaman Hajjaj dan Amalan Nabi Muhammad SAW",
        "perawi_melayu": "Diriwayatkan oleh Muhammad bin Amr bin Hasan bin Ali:",
        "english_text": "The era of the Hajjaj came (and he used to lead the prayer late, so) we asked Hazrat Jabir bin `Abdullah about it, and he said: \"The Prophet (ﷺ) used to pray the Zuhr at midday, and the `Asr at a time when the sun was still bright, the Maghrib after sunset (at its stated time) and the `Isha at a variable time. Whenever he saw the people assembled (for `Isha' prayer) he would pray earlier and if the people delayed, he would delay the prayer. And they or the Prophet (ﷺ) used to offer the Fajr Prayers when it still dark.\"",
        "malay_translation": "Pada zaman Hajjaj (beliau sering melambatkan solat, jadi) kami bertanya kepada Hazrat Jabir bin `Abdullah mengenainya, dan beliau berkata: \"Nabi Muhammad SAW biasanya menunaikan solat Zuhur pada tengah hari, dan solat Asar ketika matahari masih terang, solat Maghrib selepas matahari terbenam (pada waktunya yang ditetapkan) dan solat Isyak pada waktu yang berbeza-beza. Setiap kali baginda melihat orang ramai berkumpul (untuk solat Isyak), baginda akan menunaikannya lebih awal dan jika orang ramai melambatkan, baginda akan melambatkan solat. Dan mereka atau Nabi Muhammad SAW biasanya menunaikan solat Subuh ketika masih gelap.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدٍ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ الْحَسَنِ بْنِ عَلِيٍّ، قَالَ قَدِمَ الْحَجَّاجُ فَسَأَلْنَا جَابِرَ بْنَ عَبْدِ اللَّهِ فَقَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي الظُّهْرَ بِالْهَاجِرَةِ، وَالْعَصْرَ وَالشَّمْسُ نَقِيَّةٌ، وَالْمَغْرِبَ إِذَا وَجَبَتْ، وَالْعِشَاءَ أَحْيَانًا وَأَحْيَانًا، إِذَا رَآهُمُ اجْتَمَعُوا عَجَّلَ، وَإِذَا رَآهُمْ أَبْطَوْا أَخَّرَ، وَالصُّبْحَ كَانُوا ـ أَوْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّيهَا بِغَلَسٍ‏.‏"
      },
      {
        "id": 548,
        "hadith_number": "561",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menunaikan Solat Maghrib Bersama Nabi ﷺ Sebaik Sahaja Matahari Hilang dari Ufuk",
        "perawi_melayu": "Diriwayatkan oleh Salama RA:",
        "english_text": "We used to pray the Maghrib prayer with the Prophet (ﷺ) when the sun disappeared from the horizon.",
        "malay_translation": "Kami pernah menunaikan solat Maghrib bersama Nabi ﷺ apabila matahari hilang dari ufuk.",
        "arabic_text": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ، قَالَ كُنَّا نُصَلِّي مَعَ النَّبِيِّ صلى الله عليه وسلم الْمَغْرِبَ إِذَا تَوَارَتْ بِالْحِجَابِ‏.‏"
      },
      {
        "id": 549,
        "hadith_number": "562",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi Muhammad ﷺ Menunaikan Solat Tujuh Rakaat dan Lapan Rakaat Secara Bersama",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Abbas RA:",
        "english_text": "The Prophet (ﷺ) prayed seven rak`at together and eight rak`at together.",
        "malay_translation": "Nabi Muhammad ﷺ menunaikan solat tujuh rakaat secara bersama dan lapan rakaat secara bersama.",
        "arabic_text": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، قَالَ سَمِعْتُ جَابِرَ بْنَ زَيْدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ صَلَّى النَّبِيُّ صلى الله عليه وسلم سَبْعًا جَمِيعًا وَثَمَانِيًا جَمِيعًا‏.‏"
      },
      {
        "id": 550,
        "hadith_number": "563",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Terpengaruh dengan Orang Badwi dalam Menyebut Nama Solat Maghrib",
        "perawi_melayu": "Diriwayatkan oleh Abdullah Al-Muzani رضی اللہ عنہ:",
        "english_text": "The Prophet (ﷺ) said, \"Do not be influenced by bedouins regarding the name of your Maghrib prayer which is called `Isha' by them.\"",
        "malay_translation": "Nabi Muhammad (ﷺ) bersabda, \"Janganlah kamu terpengaruh dengan orang-orang Badwi mengenai nama solat Maghrib kamu yang mereka sebut sebagai 'Isyak.\"",
        "arabic_text": "حَدَّثَنَا أَبُو مَعْمَرٍ ـ هُوَ عَبْدُ اللَّهِ بْنُ عَمْرٍو ـ قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنِ الْحُسَيْنِ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ الْمُزَنِيُّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَغْلِبَنَّكُمُ الأَعْرَابُ عَلَى اسْمِ صَلاَتِكُمُ الْمَغْرِبِ ‏\"‏‏.‏ قَالَ الأَعْرَابُ وَتَقُولُ هِيَ الْعِشَاءُ‏.‏"
      },
      {
        "id": 551,
        "hadith_number": "564",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pentingnya Malam dan Jangka Hayat Manusia",
        "perawi_melayu": "`Abdullah رضی اللہ عنہما",
        "english_text": "\"One night Allah's Messenger (ﷺ) led us in the `Isha' prayer and that is the one called Al-`Atma [??] by the people. After the completion of the prayer, he faced us and said, \"Do you know the importance of this night? Nobody present on the surface of the earth tonight will be living after one hundred years from this night.\" (See Hadith No. 575).",
        "malay_translation": "\"Pada suatu malam, Rasulullah (ﷺ) mengimami kami dalam solat Isyak dan itulah yang dipanggil Al-`Atma [??] oleh orang ramai. Setelah selesai solat, baginda menghadap kami dan bersabda, \"Adakah kamu tahu kepentingan malam ini? Tiada seorang pun yang berada di muka bumi pada malam ini akan hidup selepas seratus tahun dari malam ini.\" (Lihat Hadis No. 575).\"",
        "arabic_text": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ سَالِمٌ أَخْبَرَنِي عَبْدُ اللَّهِ، قَالَ صَلَّى لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم لَيْلَةً صَلاَةَ الْعِشَاءِ ـ وَهْىَ الَّتِي يَدْعُو النَّاسُ الْعَتَمَةَ ـ ثُمَّ انْصَرَفَ فَأَقْبَلَ عَلَيْنَا فَقَالَ ‏ \"‏ أَرَأَيْتُمْ لَيْلَتَكُمْ هَذِهِ فَإِنَّ رَأْسَ مِائَةِ سَنَةٍ مِنْهَا لاَ يَبْقَى مِمَّنْ هُوَ عَلَى ظَهْرِ الأَرْضِ أَحَدٌ ‏\"‏‏.‏"
      },
      {
        "id": 552,
        "hadith_number": "565",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Waktu Solat Nabi Muhammad ﷺ",
        "perawi_melayu": "Diriwayatkan oleh Muhammad bin `Amr:",
        "english_text": "We asked Jabir bin `Abdullah about the prayers of the Prophet (ﷺ) . He said, \"He used to pray Zuhr prayer at midday, the `Asr when the sun was still hot, and the Maghrib after sunset (at its stated time). The `Isha was offered early if the people gathered, and used to be delayed if their number was less; and the morning prayer was offered when it was still dark. \"",
        "malay_translation": "Kami bertanya kepada Jabir bin `Abdullah mengenai solat-solat Nabi ﷺ. Beliau berkata, \"Baginda ﷺ biasa menunaikan solat Zuhur pada tengah hari, solat Asar ketika matahari masih panas, dan solat Maghrib selepas matahari terbenam (pada waktunya yang ditetapkan). Solat Isyak ditunaikan awal jika orang ramai berkumpul, dan dilewatkan jika bilangan mereka kurang; dan solat Subuh ditunaikan ketika masih gelap.\"",
        "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو ـ هُوَ ابْنُ الْحَسَنِ بْنِ عَلِيٍّ ـ قَالَ سَأَلْنَا جَابِرَ بْنَ عَبْدِ اللَّهِ عَنْ صَلاَةِ النَّبِيِّ، صلى الله عليه وسلم فَقَالَ كَانَ يُصَلِّي الظُّهْرَ بِالْهَاجِرَةِ، وَالْعَصْرَ وَالشَّمْسُ حَيَّةٌ، وَالْمَغْرِبَ إِذَا وَجَبَتْ، وَالْعِشَاءَ إِذَا كَثُرَ النَّاسُ عَجَّلَ، وَإِذَا قَلُّوا أَخَّرَ، وَالصُّبْحَ بِغَلَسٍ‏.‏"
      },
      {
        "id": 553,
        "hadith_number": "566",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menangguhkan Solat Isyak dan Keadaan Umat Islam Ketika Itu",
        "perawi_melayu": "Diriwayatkan daripada `Aisha رضی اللہ عنہا :",
        "english_text": "Allah's Messenger (ﷺ) once delayed the `Isha' prayer and that was during the days when Islam still had not spread. The Prophet (ﷺ) did not come out till `Umar رضی اللہ عنہ informed him that the women and children had slept. Then he came out and said to the people of the mosque: \"None amongst the dwellers of the earth has been waiting for it (`Isha prayer) except you.\"",
        "malay_translation": "Rasulullah (ﷺ) pernah menangguhkan solat Isyak, dan itu berlaku pada zaman ketika Islam masih belum tersebar luas. Nabi (ﷺ) tidak keluar sehingga `Umar رضی اللہ عنہ memberitahu baginda bahawa wanita dan kanak-kanak telah tidur. Kemudian baginda keluar dan bersabda kepada orang-orang di masjid: \"Tidak ada seorang pun di antara penduduk bumi yang menunggu solat ini (solat Isyak) kecuali kamu.\"",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ قَالَتْ، أَعْتَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيْلَةً بِالْعِشَاءِ، وَذَلِكَ قَبْلَ أَنْ يَفْشُوَ الإِسْلاَمُ، فَلَمْ يَخْرُجْ حَتَّى قَالَ عُمَرُ نَامَ النِّسَاءُ وَالصِّبْيَانُ‏.‏ فَخَرَجَ فَقَالَ لأَهْلِ الْمَسْجِدِ ‏ \"‏ مَا يَنْتَظِرُهَا أَحَدٌ مِنْ أَهْلِ الأَرْضِ غَيْرُكُمْ ‏\"‏‏.‏"
      },
      {
        "id": 554,
        "hadith_number": "567",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keutamaan Solat Isyak yang Dilewatkan dan Kegembiraan Para Sahabat",
        "perawi_melayu": "Diriwayatkan oleh Abu Musa رضی اللہ عنہ :",
        "english_text": "My companions, who came with me in the boat and I landed at a place called Baqi [??] Buthan [??] . The Prophet (ﷺ) was in Medina at that time. One of us used to go to the Prophet (ﷺ) by turns every night at the time of the `Isha prayer. Once I along with my companions went to the Prophet (ﷺ) and he was busy in some of his affairs, so the `Isha' prayer was delayed to the middle of the night He then came out and led the people (in prayer). After finishing from the prayer, he addressed the people present there saying, \"Be patient! Don't go away. Have the glad tiding. It is from the blessing of Allah upon you that none amongst mankind has prayed at this time save you.\" Or said, \"None except you has prayed at this time.\" Abu Musa added, 'So we returned happily after what we heard from Allah's Messenger (ﷺ) .'",
        "malay_translation": "Sahabat-sahabatku, yang datang bersamaku di dalam perahu dan aku mendarat di suatu tempat bernama Baqi' Buthan. Nabi (ﷺ) berada di Madinah pada waktu itu. Salah seorang daripada kami biasa pergi kepada Nabi (ﷺ) secara bergilir-gilir setiap malam pada waktu solat Isyak. Pada suatu ketika, aku bersama sahabat-sahabatku pergi kepada Nabi (ﷺ) dan baginda sedang sibuk dengan beberapa urusannya, maka solat Isyak dilewatkan hingga tengah malam. Kemudian baginda keluar dan mengimami orang ramai (dalam solat). Setelah selesai solat, baginda berucap kepada orang-orang yang hadir di situ, \"Bersabarlah! Jangan pergi. Bergembiralah. Ini adalah daripada keberkatan Allah ke atas kamu bahawa tidak ada seorang pun di antara manusia yang solat pada waktu ini kecuali kamu.\" Atau baginda bersabda, \"Tidak ada seorang pun kecuali kamu yang solat pada waktu ini.\" Abu Musa menambah, 'Maka kami kembali dengan gembira setelah apa yang kami dengar daripada Rasulullah (ﷺ).'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ أَخْبَرَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ كُنْتُ أَنَا وَأَصْحَابِي الَّذِينَ، قَدِمُوا مَعِي فِي السَّفِينَةِ نُزُولاً فِي بَقِيعِ بُطْحَانَ، وَالنَّبِيُّ صلى الله عليه وسلم بِالْمَدِينَةِ، فَكَانَ يَتَنَاوَبُ النَّبِيَّ صلى الله عليه وسلم عِنْدَ صَلاَةِ الْعِشَاءِ كُلَّ لَيْلَةٍ نَفَرٌ مِنْهُمْ، فَوَافَقْنَا النَّبِيَّ ـ عليه السلام ـ أَنَا وَأَصْحَابِي وَلَهُ بَعْضُ الشُّغْلِ فِي بَعْضِ أَمْرِهِ فَأَعْتَمَ بِالصَّلاَةِ حَتَّى ابْهَارَّ اللَّيْلُ، ثُمَّ خَرَجَ النَّبِيُّ صلى الله عليه وسلم فَصَلَّى بِهِمْ، فَلَمَّا قَضَى صَلاَتَهُ قَالَ لِمَنْ حَضَرَهُ ‏\"‏ عَلَى رِسْلِكُمْ، أَبْشِرُوا إِنَّ مِنْ نِعْمَةِ اللَّهِ عَلَيْكُمْ أَنَّهُ لَيْسَ أَحَدٌ مِنَ النَّاسِ يُصَلِّي هَذِهِ السَّاعَةَ غَيْرُكُمْ ‏\"‏‏.‏ أَوْ قَالَ ‏\"‏ مَا صَلَّى هَذِهِ السَّاعَةَ أَحَدٌ غَيْرُكُمْ ‏\"‏‏.‏ لاَ يَدْرِي أَىَّ الْكَلِمَتَيْنِ قَالَ‏.‏ قَالَ أَبُو مُوسَى فَرَجَعْنَا فَفَرِحْنَا بِمَا سَمِعْنَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 555,
        "hadith_number": "568",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Tidur Sebelum Solat Isyak dan Berbual Selepasnya",
        "perawi_melayu": "Diriwayatkan oleh Abu Barza رضی اللہ عنہ:",
        "english_text": "Allah's Messenger (ﷺ) disliked to sleep before the `Isha' prayer and to talk after it.",
        "malay_translation": "Rasulullah (ﷺ) tidak menyukai tidur sebelum solat Isyak dan berbual-bual selepasnya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ أَخْبَرَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، قَالَ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنْ أَبِي الْمِنْهَالِ، عَنْ أَبِي بَرْزَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَكْرَهُ النَّوْمَ قَبْلَ الْعِشَاءِ وَالْحَدِيثَ بَعْدَهَا‏.‏"
      },
      {
        "id": 556,
        "hadith_number": "569",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Penangguhan Solat Isyak dan Keutamaannya di Madinah",
        "perawi_melayu": "Diriwayatkan daripada `Aisha رضی اللہ عنہا :",
        "english_text": "\"Once Allah's Messenger (ﷺ) delayed the `Isha' prayer till `Umar رضی اللہ عنہ reminded him by saying, \"The prayer!\" The women and children have slept. Then the Prophet (ﷺ) came out and said, 'None amongst the dwellers of the earth has been waiting for it (the prayer) except you.\" `Urwa said, \"Nowhere except in Medina the prayer used to be offered (in those days).\" He further said, \"The Prophet (ﷺ) used to offer the `Isha' prayer in the period between the disappearance of the twilight and the end of the first third of the night.\"",
        "malay_translation": "Rasulullah (ﷺ) pernah melambatkan solat Isyak sehingga `Umar رضی اللہ عنہ mengingatkannya dengan berkata, \"Solat!\" Wanita dan anak-anak telah tidur. Kemudian Nabi (ﷺ) keluar dan bersabda, 'Tidak ada seorang pun di antara penduduk bumi yang menunggu solat ini (Isyak) kecuali kamu.' `Urwa berkata, \"Tidak ada tempat lain kecuali di Madinah solat ditawarkan (pada masa itu).\" Dia selanjutnya berkata, \"Nabi (ﷺ) biasa menawarkan solat Isyak dalam tempoh antara hilangnya senja dan berakhirnya sepertiga pertama malam.\"",
        "arabic_text": "حَدَّثَنَا أَيُّوبُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي أَبُو بَكْرٍ، عَنْ سُلَيْمَانَ، قَالَ صَالِحُ بْنُ كَيْسَانَ أَخْبَرَنِي ابْنُ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ، قَالَتْ أَعْتَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْعِشَاءِ حَتَّى نَادَاهُ عُمَرُ الصَّلاَةَ، نَامَ النِّسَاءُ وَالصِّبْيَانُ‏.‏ فَخَرَجَ فَقَالَ ‏ \"‏ مَا يَنْتَظِرُهَا أَحَدٌ مِنْ أَهْلِ الأَرْضِ غَيْرُكُمْ ‏\"‏‏.‏ قَالَ وَلاَ يُصَلَّى يَوْمَئِذٍ إِلاَّ بِالْمَدِينَةِ، وَكَانُوا يُصَلُّونَ فِيمَا بَيْنَ أَنْ يَغِيبَ الشَّفَقُ إِلَى ثُلُثِ اللَّيْلِ الأَوَّلِ‏.‏"
      },
      {
        "id": 557,
        "hadith_number": "570, 571",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menangguhkan Solat Isyak dan Keadaan Nabi Muhammad SAW",
        "perawi_melayu": "Diriwayatkan oleh `Abdullah bin `Umar RA:",
        "english_text": "\"Once Allah's Messenger (ﷺ) was busy (at the time of the `Isha'), so the prayer was delayed so much so that we slept and woke up and slept and woke up again. The Prophet (ﷺ) came out and said, 'None amongst the dwellers of the earth but you have been waiting for the prayer.\" Ibn `Umar رضی اللہ عنہما did not find any harm in praying it earlier or in delaying it unless he was afraid that sleep might overwhelm him and he might miss the prayer, and sometimes he used to sleep before the `Isha' prayer. Ibn Juraij said, \"I said to `Ata' , 'I heard Ibn `Abbas saying: Once Allah's Messenger (ﷺ) delayed the `Isha' prayer to such an extent that the people slept and got up and slept again and got up again. Then `Umar bin Al-Khattab I, stood up and reminded the Prophet (ﷺ) I of the prayer.' `Ata' said, 'Ibn `Abbas said: The Prophet came out as if I was looking at him at this time, and water was trickling from his head and he was putting his hand on his head and then said, 'Hadn't I thought it hard for my followers, I would have ordered them to pray (`Isha' prayer) at this time.' I asked `Ata' for further information, how the Prophet had kept his hand on his head as he was told by Ibn `Abbas رضی اللہ عنہما . `Ata' separated his fingers slightly and put their tips on the side of the head, brought the fingers downwards approximating them till the thumb touched the lobe of the ear at the side of the temple and the beard on the face. He neither slowed nor hurried in this action but he acted like that. The Prophet (ﷺ) said: \"Hadn't I thought it hard for my followers I would have ordered them to pray at this time.\"",
        "malay_translation": "Pada suatu ketika, Rasulullah SAW sibuk (pada waktu Isyak), sehingga solat itu ditangguhkan begitu lama sehingga kami tidur dan bangun, kemudian tidur dan bangun lagi. Nabi SAW keluar dan bersabda, 'Tidak ada seorang pun di antara penduduk bumi kecuali kamu yang menunggu solat ini.' Ibn `Umar RA tidak mendapati ada mudaratnya untuk menunaikannya lebih awal atau menangguhkannya kecuali jika dia takut tidur akan menguasainya dan dia mungkin terlepas solat itu, dan kadang-kadang dia tidur sebelum solat Isyak. Ibn Juraij berkata, 'Saya berkata kepada `Ata', 'Saya mendengar Ibn `Abbas berkata: Pada suatu ketika Rasulullah SAW menangguhkan solat Isyak sehingga orang ramai tidur dan bangun, kemudian tidur lagi dan bangun lagi. Kemudian `Umar bin Al-Khattab RA berdiri dan mengingatkan Nabi SAW tentang solat itu.' `Ata' berkata, 'Ibn `Abbas berkata: Nabi SAW keluar seolah-olah saya sedang melihat baginda pada waktu ini, dan air menitis dari kepalanya dan baginda meletakkan tangannya di atas kepalanya dan kemudian bersabda, 'Seandainya aku tidak fikir ia akan menyusahkan umatku, nescaya aku akan memerintahkan mereka untuk solat (Isyak) pada waktu ini.' Saya bertanya kepada `Ata' untuk maklumat lanjut, bagaimana Nabi SAW meletakkan tangannya di atas kepalanya seperti yang diberitahu oleh Ibn `Abbas RA. `Ata' merenggangkan jarinya sedikit dan meletakkan hujung jarinya di sisi kepala, membawa jari-jari ke bawah mendekatinya sehingga ibu jari menyentuh cuping telinga di sisi pelipis dan janggut di muka. Dia tidak memperlahankan atau mempercepatkan tindakan ini tetapi dia bertindak seperti itu. Nabi SAW bersabda: 'Seandainya aku tidak fikir ia akan menyusahkan umatku, nescaya aku akan memerintahkan mereka untuk solat pada waktu ini.'",
        "arabic_text": "حَدَّثَنَا مَحْمُودٌ، قَالَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَخْبَرَنِي ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي نَافِعٌ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم شُغِلَ عَنْهَا لَيْلَةً، فَأَخَّرَهَا حَتَّى رَقَدْنَا فِي الْمَسْجِدِ، ثُمَّ اسْتَيْقَظْنَا ثُمَّ رَقَدْنَا ثُمَّ اسْتَيْقَظْنَا، ثُمَّ خَرَجَ عَلَيْنَا النَّبِيُّ صلى الله عليه وسلم ثُمَّ قَالَ ‏\"‏ لَيْسَ أَحَدٌ مِنْ أَهْلِ الأَرْضِ يَنْتَظِرُ الصَّلاَةَ غَيْرُكُمْ ‏\"‏‏.‏ وَكَانَ ابْنُ عُمَرَ لاَ يُبَالِي أَقَدَّمَهَا أَمْ أَخَّرَهَا إِذَا كَانَ لاَ يَخْشَى أَنْ يَغْلِبَهُ النَّوْمُ عَنْ وَقْتِهَا، وَكَانَ يَرْقُدُ قَبْلَهَا‏.‏ قَالَ ابْنُ جُرَيْجٍ قُلْتُ لِعَطَاءٍ وَقَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ أَعْتَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيْلَةً بِالْعِشَاءِ حَتَّى رَقَدَ النَّاسُ وَاسْتَيْقَظُوا، وَرَقَدُوا وَاسْتَيْقَظُوا، فَقَامَ عُمَرُ بْنُ الْخَطَّابِ فَقَالَ الصَّلاَةَ‏.‏ قَالَ عَطَاءٌ قَالَ ابْنُ عَبَّاسٍ فَخَرَجَ نَبِيُّ اللَّهِ صلى الله عليه وسلم كَأَنِّي أَنْظُرُ إِلَيْهِ الآنَ، يَقْطُرُ رَأْسُهُ مَاءً، وَاضِعًا يَدَهُ عَلَى رَأْسِهِ فَقَالَ ‏\"‏ لَوْلاَ أَنْ أَشُقَّ عَلَى أُمَّتِي لأَمَرْتُهُمْ أَنْ يُصَلُّوهَا هَكَذَا ‏\"‏‏.‏ فَاسْتَثْبَتُّ عَطَاءً كَيْفَ وَضَعَ النَّبِيُّ صلى الله عليه وسلم عَلَى رَأْسِهِ يَدَهُ كَمَا أَنْبَأَهُ ابْنُ عَبَّاسٍ، فَبَدَّدَ لِي عَطَاءٌ بَيْنَ أَصَابِعِهِ شَيْئًا مِنْ تَبْدِيدٍ، ثُمَّ وَضَعَ أَطْرَافَ أَصَابِعِهِ عَلَى قَرْنِ الرَّأْسِ ثُمَّ ضَمَّهَا، يُمِرُّهَا كَذَلِكَ عَلَى الرَّأْسِ حَتَّى مَسَّتْ إِبْهَامُهُ طَرَفَ الأُذُنِ مِمَّا يَلِي الْوَجْهَ عَلَى الصُّدْغِ، وَنَاحِيَةِ اللِّحْيَةِ، لاَ يُقَصِّرُ وَلاَ يَبْطُشُ إِلاَّ كَذَلِكَ وَقَالَ ‏\"‏ لَوْلاَ أَنْ أَشُقَّ عَلَى أُمَّتِي لأَمَرْتُهُمْ أَنْ يُصَلُّوا هَكَذَا."
      },
      {
        "id": 558,
        "hadith_number": "572",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menangguhkan Solat Isyak Hingga Tengah Malam",
        "perawi_melayu": "Diriwayatkan oleh Anas RA:",
        "english_text": "The Prophet (ﷺ) delayed the `Isha' prayer till midnight and then he offered the prayer and said, \"The people prayed and slept but you have been in prayer as long as you have been waiting for it (the prayer).\" \r\nAnas added: As if I am looking now at the glitter of the ring of the Prophet (ﷺ) on that night.",
        "malay_translation": "Nabi Muhammad SAW menangguhkan solat Isyak sehingga tengah malam, kemudian baginda menunaikan solat dan bersabda, \"Orang ramai telah solat dan tidur, tetapi kamu tetap dalam solat selagi mana kamu menunggu untuknya (solat).\" Anas menambah: Seolah-olah aku sedang melihat kilauan cincin Nabi SAW pada malam itu.",
        "arabic_text": "حَدَّثَنَا عَبْدُ الرَّحِيمِ الْمُحَارِبِيُّ، قَالَ حَدَّثَنَا زَائِدَةُ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسٍ، قَالَ أَخَّرَ النَّبِيُّ صلى الله عليه وسلم صَلاَةَ الْعِشَاءِ إِلَى نِصْفِ اللَّيْلِ، ثُمَّ صَلَّى ثُمَّ قَالَ ‏ \"‏ قَدْ صَلَّى النَّاسُ وَنَامُوا، أَمَا إِنَّكُمْ فِي صَلاَةٍ مَا انْتَظَرْتُمُوهَا ‏\"‏‏.‏ وَزَادَ ابْنُ أَبِي مَرْيَمَ أَخْبَرَنَا يَحْيَى بْنُ أَيُّوبَ حَدَّثَنِي حُمَيْدٌ سَمِعَ أَنَسًا كَأَنِّي أَنْظُرُ إِلَى وَبِيصِ خَاتَمِهِ لَيْلَتَئِذٍ‏.‏"
      },
      {
        "id": 559,
        "hadith_number": "573",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Melihat Allah pada Hari Kiamat dan Keutamaan Solat Subuh dan Asar",
        "perawi_melayu": "Diriwayatkan oleh Jarir bin `Abdullah:",
        "english_text": "We were with the Prophet (ﷺ) on a full moon night. He looked at the moon and said, \"You will certainly see your Lord as you see this moon, and there will be no trouble in seeing Him. So if you can avoid missing (through sleep, business, etc.) a prayer before the rising of the sun (Fajr) and before its setting (`Asr) you must do so. \r\nHe (the Prophet (ﷺ) ) then recited the following verse: \r\n   ''. . . And celebrate the praises Of Your Lord before The rising of the sun And before (its) setting.\" (50.39)",
        "malay_translation": "Kami bersama Nabi Muhammad (ﷺ) pada malam bulan purnama. Baginda melihat bulan dan bersabda, \"Sesungguhnya kamu akan melihat Tuhan kamu sebagaimana kamu melihat bulan ini, dan tidak ada kesulitan dalam melihat-Nya. Oleh itu, jika kamu mampu untuk tidak meninggalkan (kerana tidur, urusan perniagaan, dan lain-lain) solat sebelum terbit matahari (Fajr) dan sebelum terbenamnya (`Asar), maka lakukanlah.\"\r\nKemudian Baginda (Nabi Muhammad (ﷺ)) membaca ayat berikut:\r\n\"...Dan bertasbihlah dengan memuji Tuhanmu sebelum terbit matahari dan sebelum terbenam(nya).\" (50:39)",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ، حَدَّثَنَا قَيْسٌ، قَالَ لِي جَرِيرُ بْنُ عَبْدِ اللَّهِ كُنَّا عِنْدَ النَّبِيِّ صلى الله عليه وسلم إِذْ نَظَرَ إِلَى الْقَمَرِ لَيْلَةَ الْبَدْرِ فَقَالَ ‏\"‏ أَمَا إِنَّكُمْ سَتَرَوْنَ رَبَّكُمْ كَمَا تَرَوْنَ هَذَا، لاَ تُضَامُّونَ ـ أَوْ لاَ تُضَاهُونَ ـ فِي رُؤْيَتِهِ، فَإِنِ اسْتَطَعْتُمْ أَنْ لاَ تُغْلَبُوا عَلَى صَلاَةٍ قَبْلَ طُلُوعِ الشَّمْسِ، وَقَبْلَ غُرُوبِهَا فَافْعَلُوا ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ فَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ غُرُوبِهَا ‏\"‏‏.‏"
      },
      {
        "id": 560,
        "hadith_number": "574",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keutamaan Solat Asar dan Subuh: Jaminan Syurga",
        "perawi_melayu": "Diriwayatkan oleh Abu Bakr bin Abi Musa:",
        "english_text": "My father said, \"Allah's Messenger (ﷺ) said, 'Whoever prays the two cool prayers (`Asr and Fajr) will go to Paradise.' \"",
        "malay_translation": "Bapa saya berkata, \"Rasulullah (ﷺ) bersabda, 'Sesiapa yang menunaikan dua solat yang sejuk (Asar dan Subuh) akan masuk syurga.' \"",
        "arabic_text": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا هَمَّامٌ، حَدَّثَنِي أَبُو جَمْرَةَ، عَنْ أَبِي بَكْرِ بْنِ أَبِي مُوسَى، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ صَلَّى الْبَرْدَيْنِ دَخَلَ الْجَنَّةَ ‏\"‏‏.‏ وَقَالَ ابْنُ رَجَاءٍ حَدَّثَنَا هَمَّامٌ عَنْ أَبِي جَمْرَةَ أَنَّ أَبَا بَكْرِ بْنَ عَبْدِ اللَّهِ بْنِ قَيْسٍ أَخْبَرَهُ بِهَذَا‏.‏ حَدَّثَنَا إِسْحَاقُ، عَنْ حَبَّانَ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا أَبُو جَمْرَةَ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ‏.‏"
      },
      {
        "id": 561,
        "hadith_number": "575",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Jarak Masa Antara Sahur dan Solat Subuh",
        "perawi_melayu": "Diriwayatkan oleh Zaid bin Thabit رضی اللہ عنہ:",
        "english_text": "\"We took the \"Suhur\" (the meal taken before dawn while fasting is observed) with the Prophet (ﷺ) and then stood up for the (morning) prayer.\" I asked him how long the interval between the two (Suhur and prayer) was. He replied, 'The interval between the two was just sufficient to recite fifty to Sixth 'Ayat.\"",
        "malay_translation": "\"Kami bersahur bersama Nabi (ﷺ) kemudian kami berdiri untuk solat (Subuh).\" Saya bertanya kepadanya berapa lama jarak antara keduanya (sahur dan solat). Beliau menjawab, 'Jarak antara keduanya adalah cukup untuk membaca lima puluh hingga enam puluh ayat.'",
        "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ، قَالَ حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ زَيْدَ بْنَ ثَابِتٍ، حَدَّثَهُ أَنَّهُمْ، تَسَحَّرُوا مَعَ النَّبِيِّ صلى الله عليه وسلم ثُمَّ قَامُوا إِلَى الصَّلاَةِ‏.‏ قُلْتُ كَمْ بَيْنَهُمَا قَالَ قَدْرُ خَمْسِينَ أَوْ سِتِّينَ ـ يَعْنِي آيَةً ـ ح‏.‏"
      },
      {
        "id": 562,
        "hadith_number": "576",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Jarak Masa Antara Sahur dan Solat Subuh",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik رضی اللہ عنہ:",
        "english_text": "\"The Prophet (ﷺ) and Zaid bin Thabit took the 'Suhur' together and after finishing the meal, the Prophet (ﷺ) stood up and prayed (Fajr prayer).\" I asked Anas رضی اللہ عنہ , \"How long was the interval between finishing their 'Suhur' and starting the prayer?\" He replied, \"The interval between the two was just sufficient to recite fifty 'Ayat.\" (Verses of the Qur'an).",
        "malay_translation": "\"Nabi (ﷺ) dan Zaid bin Thabit bersahur bersama-sama, dan setelah selesai makan, Nabi (ﷺ) berdiri dan menunaikan solat (Solat Subuh).\" Saya bertanya kepada Anas رضی اللہ عنہ, \"Berapa lamakah jarak masa antara selesai bersahur dan memulakan solat?\" Beliau menjawab, \"Jarak antara keduanya hanyalah sekadar mencukupi untuk membaca lima puluh Ayat.\" (Ayat-ayat al-Qur'an).",
        "arabic_text": "حَدَّثَنَا حَسَنُ بْنُ صَبَّاحٍ، سَمِعَ رَوْحًا، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم وَزَيْدَ بْنَ ثَابِتٍ تَسَحَّرَا، فَلَمَّا فَرَغَا مِنْ سَحُورِهِمَا قَامَ نَبِيُّ اللَّهِ صلى الله عليه وسلم إِلَى الصَّلاَةِ فَصَلَّى‏.‏ قُلْنَا لأَنَسٍ كَمْ كَانَ بَيْنَ فَرَاغِهِمَا مِنْ سَحُورِهِمَا وَدُخُولِهِمَا فِي الصَّلاَةِ قَالَ قَدْرُ مَا يَقْرَأُ الرَّجُلُ خَمْسِينَ آيَةً‏.‏"
      },
      {
        "id": 563,
        "hadith_number": "577",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Mengambil Sahur dan Menyegerakan Solat Subuh Bersama Rasulullah ﷺ",
        "perawi_melayu": "Diriwayatkan oleh Sahl bin Sa`d رضي الله عنه :",
        "english_text": "I used to take the \"Suhur\" meal with my family and hasten so as to catch the Fajr (morning prayer) with Allah's Messenger (ﷺ).",
        "malay_translation": "Saya biasa mengambil makanan \"Sahur\" bersama keluarga saya dan bergegas agar dapat menunaikan solat Subuh (Fajr) bersama Rasulullah ﷺ.",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، عَنْ أَخِيهِ، عَنْ سُلَيْمَانَ، عَنْ أَبِي حَازِمٍ، أَنَّهُ سَمِعَ سَهْلَ بْنَ سَعْدٍ، يَقُولُ كُنْتُ أَتَسَحَّرُ فِي أَهْلِي ثُمَّ يَكُونُ سُرْعَةٌ بِي أَنْ أُدْرِكَ صَلاَةَ الْفَجْرِ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 564,
        "hadith_number": "578",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Wanita Beriman Menghadiri Solat Subuh dengan Bertelekung",
        "perawi_melayu": "Diriwayatkan daripada `Aisha رضي الله عنها :",
        "english_text": "The believing women covered with their veiling sheets used to attend the Fajr prayer with Allah's Apostle, and after finishing the prayer they would return to their home and nobody could recognize them because of darkness.",
        "malay_translation": "Para wanita beriman yang menutup diri dengan telekung mereka biasanya menghadiri solat Subuh bersama Rasulullah SAW, dan setelah selesai solat, mereka akan kembali ke rumah mereka dan tidak ada seorang pun yang dapat mengenali mereka kerana kegelapan.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ أَخْبَرَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ قَالَتْ، كُنَّ نِسَاءُ الْمُؤْمِنَاتِ يَشْهَدْنَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم صَلاَةَ الْفَجْرِ مُتَلَفِّعَاتٍ بِمُرُوطِهِنَّ، ثُمَّ يَنْقَلِبْنَ إِلَى بُيُوتِهِنَّ حِينَ يَقْضِينَ الصَّلاَةَ، لاَ يَعْرِفُهُنَّ أَحَدٌ مِنَ الْغَلَسِ‏.‏"
      },
      {
        "id": 565,
        "hadith_number": "579",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Mendapatkan Satu Rakaat Sebelum Matahari Terbit atau Terbenam",
        "perawi_melayu": "Diriwayatkan oleh Abu Huraira RA:",
        "english_text": "Allah's Messenger (ﷺ) said, \"Whoever could get one rak`a (of the Fajr prayer) before sunrise, he has got the (morning) prayer and whoever could get one rak`a of the `Asr prayer before sunset, he has got the (`Asr) prayer.\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Sesiapa yang sempat mendapatkan satu rakaat (solat Subuh) sebelum matahari terbit, maka dia telah mendapatkan (solat) Subuh. Dan sesiapa yang sempat mendapatkan satu rakaat solat Asar sebelum matahari terbenam, maka dia telah mendapatkan solat Asar.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، وَعَنْ بُسْرِ بْنِ سَعِيدٍ، وَعَنِ الأَعْرَجِ، يُحَدِّثُونَهُ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَدْرَكَ مِنَ الصُّبْحِ رَكْعَةً قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ فَقَدْ أَدْرَكَ الصُّبْحَ، وَمَنْ أَدْرَكَ رَكْعَةً مِنَ الْعَصْرِ قَبْلَ أَنْ تَغْرُبَ الشَّمْسُ فَقَدْ أَدْرَكَ الْعَصْرَ ‏\"‏‏.‏"
      },
      {
        "id": 566,
        "hadith_number": "580",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Mendapatkan Satu Rakaat Solat Bererti Mendapatkan Solat Itu",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ عنہ:",
        "english_text": "Allah's Messenger (ﷺ) said, \"Whoever could get one rak`a of a prayer, (in its proper time) he has got the prayer.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Sesiapa yang sempat mendapatkan satu rakaat solat (dalam waktunya yang betul), maka dia telah mendapatkan solat itu.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَدْرَكَ رَكْعَةً مِنَ الصَّلاَةِ فَقَدْ أَدْرَكَ الصَّلاَةَ ‏\"‏‏.‏"
      },
      {
        "id": 567,
        "hadith_number": "581",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Solat Sunat Selepas Subuh dan Asar",
        "perawi_melayu": "Diriwayatkan daripada `Umar:",
        "english_text": "\"The Prophet (ﷺ) forbade praying after the Fajr prayer till the sun rises and after the `Asr prayer till the sun sets.\" Narrated Ibn `Abbas: Some people told me the same narration (as above).",
        "malay_translation": "\"Nabi Muhammad (ﷺ) melarang solat sunat selepas solat Subuh sehingga matahari terbit dan selepas solat Asar sehingga matahari terbenam.\" Diriwayatkan daripada Ibn `Abbas: Beberapa orang menyampaikan riwayat yang sama kepadaku (seperti di atas).",
        "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ ، قَالَ : حَدَّثَنَا هِشَامٌ ، عَنْ قَتَادَةَ ، عَنْ أَبِي الْعَالِيَةِ ، عَنِ ابْنِ عَبَّاسٍ ، قَالَ : شَهِدَ عِنْدِي رِجَالٌ مَرْضِيُّونَ وَأَرْضَاهُمْ عِنْدِي عُمَرُ ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الصَّلَاةِ بَعْدَ الصُّبْحِ حَتَّى تَشْرُقَ الشَّمْسُ ، وَبَعْدَ الْعَصْرِ حَتَّى تَغْرُبَ ، حَدَّثَنَا مُسَدَّدٌ ، قَالَ : حَدَّثَنَا يَحْيَى ، عَنْ شُعْبَةَ ، عَنْ قَتَادَةَ ، سَمِعْتُ أَبَا الْعَالِيَةِ ، عَنِ ابْنِ عَبَّاسٍ ، قَالَ : حَدَّثَنِي نَاسٌ بِهَذَا."
      },
      {
        "id": 568,
        "hadith_number": "583",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menangguhkan Solat Ketika Matahari Terbit dan Terbenam",
        "perawi_melayu": "Diriwayatkan dari Ibn `Umar",
        "english_text": "Ibn `Umar said, \"Allah's Messenger (ﷺ) said, 'If the edge of the sun appears (above the horizon) delay the prayer till it becomes high, and if the edge of the sun disappears, delay the prayer till it sets (disappears completely).' \"",
        "malay_translation": "Ibn `Umar berkata, \"Rasulullah (ﷺ) bersabda, 'Jika hujung matahari muncul (di atas ufuk), tangguhkan solat sehingga ia tinggi, dan jika hujung matahari menghilang, tangguhkan solat sehingga ia terbenam (hilang sepenuhnya).'",
        "arabic_text": "وَقَالَ حَدَّثَنِي ابْنُ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا طَلَعَ حَاجِبُ الشَّمْسِ فَأَخِّرُوا الصَّلاَةَ حَتَّى تَرْتَفِعَ، وَإِذَا غَابَ حَاجِبُ الشَّمْسِ فَأَخِّرُوا الصَّلاَةَ حَتَّى تَغِيبَ ‏\"‏‏.‏ تَابَعَهُ عَبْدَةُ‏.‏"
      },
      {
        "id": 569,
        "hadith_number": "584",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan dalam Jual Beli, Pakaian, dan Solat",
        "perawi_melayu": "Diriwayatkan oleh Abu Huraira رضی اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) forbade two kinds of sales, two kinds of dresses, and two prayers. He forbade offering prayers after the Fajr prayer till the rising of the sun and after the `Asr prayer till its setting. He also forbade \"Ishtimal-Assama [??] \" and \"al-Ihtiba\" in one garment in such a way that one's private parts are exposed towards the sky. He also forbade the sales called \"Munabadha\" and \"Mulamasa.\" (See Hadith No. 354 and 355 Vol. 3).",
        "malay_translation": "Rasulullah (ﷺ) melarang dua jenis jual beli, dua jenis pakaian, dan dua solat. Baginda melarang mengerjakan solat setelah solat Subuh hingga terbit matahari dan setelah solat Asar hingga terbenam matahari. Baginda juga melarang \"Ishtimal-Assama [??] \" dan \"al-Ihtiba\" dengan satu pakaian sehingga menampakkan aurat ke arah langit. Baginda juga melarang jual beli yang disebut \"Munabadha\" dan \"Mulamasa.\" (Lihat Hadis No. 354 dan 355 Jilid 3).",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، عَنْ أَبِي أُسَامَةَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعَتَيْنِ وَعَنْ لِبْسَتَيْنِ وَعَنْ صَلاَتَيْنِ نَهَى عَنِ الصَّلاَةِ بَعْدَ الْفَجْرِ حَتَّى تَطْلُعَ الشَّمْسُ، وَبَعْدَ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ، وَعَنِ اشْتِمَالِ الصَّمَّاءِ وَعَنْ الاِحْتِبَاءِ فِي ثَوْبٍ وَاحِدٍ يُفْضِي بِفَرْجِهِ إِلَى السَّمَاءِ، وَعَنِ الْمُنَابَذَةِ وَالْمُلاَمَسَةِ‏.‏"
      },
      {
        "id": 570,
        "hadith_number": "585",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Solat Ketika Matahari Terbit atau Terbenam",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Umar رضی اللہ عنہما :",
        "english_text": "Allah's Messenger (ﷺ) said, \"None of you should try to pray at sunrise or sunset.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Janganlah seorang pun di antara kamu cuba untuk solat ketika matahari terbit atau terbenam.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَتَحَرَّى أَحَدُكُمْ فَيُصَلِّي عِنْدَ طُلُوعِ الشَّمْسِ وَلاَ عِنْدَ غُرُوبِهَا ‏\"‏‏.‏"
      },
      {
        "id": 571,
        "hadith_number": "586",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Solat Selepas Subuh dan Asar",
        "perawi_melayu": "Diriwayatkan oleh Abu Sa'id Al-Khudri رضی اللہ عنہ:",
        "english_text": "I heard Allah's Messenger (ﷺ) saying, \"There is no prayer after the morning prayer till the sun rises, and there is no prayer after the `Asr prayer till the sun sets.\"",
        "malay_translation": "Aku mendengar Rasulullah (ﷺ) bersabda, \"Tidak ada solat setelah solat Subuh sehingga matahari terbit, dan tidak ada solat setelah solat Asar sehingga matahari terbenam.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عَطَاءُ بْنُ يَزِيدَ الْجُنْدَعِيُّ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ صَلاَةَ بَعْدَ الصُّبْحِ حَتَّى تَرْتَفِعَ الشَّمْسُ، وَلاَ صَلاَةَ بَعْدَ الْعَصْرِ حَتَّى تَغِيبَ الشَّمْسُ ‏\"‏‏.‏"
      },
      {
        "id": 572,
        "hadith_number": "587",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Solat Sunat Selepas Asar yang Tidak Dilihat Dilakukan oleh Rasulullah SAW",
        "perawi_melayu": "Diriwayatkan oleh Muawiyah RA:",
        "english_text": "You offer a prayer which I did not see being offered by Allah's Messenger (ﷺ) when we were in his company and he certainly had forbidden it (i.e. two rak`at after the `Asr prayer).",
        "malay_translation": "Kamu menunaikan solat yang tidak pernah saya lihat ditunaikan oleh Rasulullah SAW ketika kami bersama baginda, dan sesungguhnya baginda telah melarangnya (iaitu dua rakaat selepas solat Asar).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبَانَ، قَالَ حَدَّثَنَا غُنْدَرٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي التَّيَّاحِ، قَالَ سَمِعْتُ حُمْرَانَ بْنَ أَبَانَ، يُحَدِّثُ عَنْ مُعَاوِيَةَ، قَالَ إِنَّكُمْ لَتُصَلُّونَ صَلاَةً، لَقَدْ صَحِبْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَمَا رَأَيْنَاهُ يُصَلِّيهَا، وَلَقَدْ نَهَى عَنْهُمَا، يَعْنِي الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ‏.‏"
      },
      {
        "id": 573,
        "hadith_number": "588",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Solat Sunat Selepas Subuh dan Asar",
        "perawi_melayu": "Diriwayatkan oleh Abu Huraira رضی اللہ عنہ:",
        "english_text": "Allah's Messenger (ﷺ) forbade the offering of two prayers:\r\n1. after the morning prayer till the sunrises. \r\n2. after the `Asr prayer till the sun sets.",
        "malay_translation": "Rasulullah (ﷺ) melarang mengerjakan dua solat:\r\n1. Selepas solat Subuh sehingga matahari terbit.\r\n2. Selepas solat Asar sehingga matahari terbenam.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ حَدَّثَنَا عَبْدَةُ، عَنْ عُبَيْدِ اللَّهِ، عَنْ خُبَيْبٍ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ صَلاَتَيْنِ بَعْدَ الْفَجْرِ حَتَّى تَطْلُعَ الشَّمْسُ، وَبَعْدَ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ‏.‏"
      },
      {
        "id": 574,
        "hadith_number": "589",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Seperti yang Dilihat Sahabat Melaksanakan",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Umar رضی اللہ عنهما:",
        "english_text": "I pray as I saw my companions praying. I do not forbid praying at any time during the day or night except at sunset and sunrise.",
        "malay_translation": "Aku solat sebagaimana aku melihat para sahabatku solat. Aku tidak melarang solat pada bila-bila masa siang atau malam kecuali ketika matahari terbenam dan terbit.",
        "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ أُصَلِّي كَمَا رَأَيْتُ أَصْحَابِي يُصَلُّونَ، لاَ أَنْهَى أَحَدًا يُصَلِّي بِلَيْلٍ وَلاَ نَهَارٍ مَا شَاءَ، غَيْرَ أَنْ لاَ تَحَرَّوْا طُلُوعَ الشَّمْسِ وَلاَ غُرُوبَهَا‏.‏"
      },
      {
        "id": 575,
        "hadith_number": "590",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi Muhammad SAW Tidak Pernah Meninggalkan Dua Rakaat Selepas Solat Asar",
        "perawi_melayu": "Diriwayatkan daripada `Aisha R.A.:",
        "english_text": "By Allah, Who took away the Prophet. The Prophet (ﷺ) never missed them (two rak`at) after the `Asr prayer till he met Allah and he did not meet Allah till it became heavy for him to pray while standing so he used to offer most of the prayers while sitting. (She meant the two rak`at after `Asr) He used to pray them in the house and never prayed them in the mosque lest it might be hard for his followers and he loved what was easy for them .",
        "malay_translation": "Demi Allah, yang telah mengambil Nabi. Nabi Muhammad SAW tidak pernah meninggalkan dua rakaat (solat sunat) selepas solat Asar sehingga baginda bertemu Allah. Dan baginda tidak bertemu Allah sehingga menjadi berat bagi baginda untuk solat sambil berdiri, maka baginda sering menunaikan kebanyakan solat dengan duduk. (Yang dimaksudkannya ialah dua rakaat selepas Asar). Baginda sering menunaikannya di rumah dan tidak pernah menunaikannya di masjid kerana khuatir ia akan menyukarkan pengikutnya, dan baginda menyukai apa yang mudah bagi mereka.",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ أَيْمَنَ، قَالَ حَدَّثَنِي أَبِي أَنَّهُ، سَمِعَ عَائِشَةَ، قَالَتْ وَالَّذِي ذَهَبَ بِهِ مَا تَرَكَهُمَا حَتَّى لَقِيَ اللَّهَ، وَمَا لَقِيَ اللَّهَ تَعَالَى حَتَّى ثَقُلَ عَنِ الصَّلاَةِ، وَكَانَ يُصَلِّي كَثِيرًا مِنْ صَلاَتِهِ قَاعِدًا ـ تَعْنِي الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ ـ وَكَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّيهِمَا، وَلاَ يُصَلِّيهِمَا فِي الْمَسْجِدِ مَخَافَةَ أَنْ يُثَقِّلَ عَلَى أُمَّتِهِ، وَكَانَ يُحِبُّ مَا يُخَفَّفُ عَنْهُمْ‏.‏"
      },
      {
        "id": 576,
        "hadith_number": "591",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi Muhammad SAW Tidak Pernah Meninggalkan Dua Rakaat Selepas Solat Asar",
        "perawi_melayu": "Diriwayatkan daripada Aisyah R.A:",
        "english_text": "\"O son of my sister! The Prophet (ﷺ) never missed two prostrations (i.e. rak`at) after the `Asr prayer in my house.\"",
        "malay_translation": "\"Wahai anak saudara perempuanku! Nabi Muhammad SAW tidak pernah meninggalkan dua sujud (iaitu rakaat) selepas solat Asar di rumahku.\"",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا هِشَامٌ، قَالَ أَخْبَرَنِي أَبِي قَالَتْ، عَائِشَةُ ابْنَ أُخْتِي مَا تَرَكَ النَّبِيُّ صلى الله عليه وسلم السَّجْدَتَيْنِ بَعْدَ الْعَصْرِ عِنْدِي قَطُّ‏.‏"
      },
      {
        "id": 577,
        "hadith_number": "592",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Tidak Pernah Meninggalkan Dua Rakaat Sebelum Subuh dan Selepas Asar",
        "perawi_melayu": "Diriwayatkan daripada `Aisha R.A.:",
        "english_text": "Allah's Messenger (ﷺ) never missed two rak`at before the Fajr prayer and after the `Asr prayer openly and secretly.",
        "malay_translation": "Rasulullah SAW tidak pernah meninggalkan dua rakaat sebelum solat Subuh dan selepas solat Asar, secara terang-terangan mahupun sembunyi.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ حَدَّثَنَا الشَّيْبَانِيُّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الأَسْوَدِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ رَكْعَتَانِ لَمْ يَكُنْ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَعُهُمَا سِرًّا وَلاَ عَلاَنِيَةً رَكْعَتَانِ قَبْلَ صَلاَةِ الصُّبْحِ، وَرَكْعَتَانِ بَعْدَ الْعَصْرِ‏.‏"
      },
      {
        "id": 578,
        "hadith_number": "593",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi Muhammad ﷺ Menunaikan Solat Dua Rakaat Selepas Asar",
        "perawi_melayu": "Diriwayatkan oleh Aisyah:",
        "english_text": "Whenever the Prophet (ﷺ) come to me after the `Asr prayer, he always prayed two rak`at.",
        "malay_translation": "Setiap kali Nabi Muhammad ﷺ datang kepada saya selepas solat Asar, baginda sentiasa menunaikan solat dua rakaat.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ رَأَيْتُ الأَسْوَدَ وَمَسْرُوقًا شَهِدَا عَلَى عَائِشَةَ قَالَتْ مَا كَانَ النَّبِيُّ صلى الله عليه وسلم يَأْتِينِي فِي يَوْمٍ بَعْدَ الْعَصْرِ إِلاَّ صَلَّى رَكْعَتَيْنِ‏.‏"
      },
      {
        "id": 579,
        "hadith_number": "594",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Anjuran Menyegerakan Solat Asar dan Akibat Meninggalkannya",
        "perawi_melayu": "Diriwayatkan oleh Ibn Abu Malih [??]:",
        "english_text": "I was with Buraida on a cloudy day and he said, \"Offer the `Asr prayer earlier as the Prophet (ﷺ) said, 'Whoever leaves the `Asr prayer will have all his (good) deeds annulled.\" (See Hadith No. 527 and 528)",
        "malay_translation": "Saya bersama Buraida pada hari yang mendung, dan dia berkata, \"Lakukan solat Asar lebih awal kerana Nabi Muhammad (ﷺ) bersabda, 'Sesiapa yang meninggalkan solat Asar, maka terhapuslah segala amalannya.'\" (Lihat Hadith No. 527 dan 528)",
        "arabic_text": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى ـ هُوَ ابْنُ أَبِي كَثِيرٍ ـ عَنْ أَبِي قِلاَبَةَ، أَنَّ أَبَا الْمَلِيحِ، حَدَّثَهُ قَالَ كُنَّا مَعَ بُرَيْدَةَ فِي يَوْمٍ ذِي غَيْمٍ فَقَالَ بَكِّرُوا بِالصَّلاَةِ فَإِنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ تَرَكَ صَلاَةَ الْعَصْرِ حَبِطَ عَمَلُهُ ‏\"‏‏.‏"
      },
      {
        "id": 580,
        "hadith_number": "595",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kelewatan Solat Subuh Ketika Musafir dan Tindakan Nabi Muhammad SAW",
        "perawi_melayu": "Diriwayatkan daripada `Abdullah bin Abi Qatada:",
        "english_text": "\"One night we were traveling with the Prophet (ﷺ) and some people said, 'We wish that Allah's Messenger (ﷺ) would take a rest along with us during the last hours of the night.' He said, 'I am afraid that you will sleep and miss the (Fajr) prayer.' Bilal said, 'I will make you get up.' So all slept and Bilal rested his back against his Rahila and he too was overwhelmed (by sleep) and slept. The Prophet (ﷺ) got up when the edge of the sun had risen and said, 'O Bilal! What about your statement?' He replied, 'I have never slept such a sleep.' The Prophet (ﷺ) said, 'Allah captured your souls when He wished, and released them when He wished. O Bilal! Get up and pronounce the Adhan for the prayer.' The Prophet (ﷺ) performed ablution and when the sun came up and became bright, he stood up and prayed.\"",
        "malay_translation": "\"Pada suatu malam, kami sedang bermusafir bersama Nabi (ﷺ) dan beberapa orang berkata, 'Kami berharap Rasulullah (ﷺ) dapat berehat bersama kami pada waktu-waktu terakhir malam.' Baginda bersabda, 'Aku khuatir kamu akan tidur dan terlepas solat (Subuh).' Bilal berkata, 'Saya akan membangunkan kamu.' Maka semua pun tidur, dan Bilal menyandarkan belakangnya pada Rahilanya, dan dia juga dikuasai (oleh tidur) dan tertidur. Nabi (ﷺ) bangun ketika hujung matahari telah terbit dan bersabda, 'Wahai Bilal! Bagaimana dengan kata-katamu?' Dia menjawab, 'Saya tidak pernah tidur seperti ini.' Nabi (ﷺ) bersabda, 'Allah telah mengambil roh kamu ketika Dia menghendaki, dan melepaskannya ketika Dia menghendaki. Wahai Bilal! Bangun dan laungkan azan untuk solat.' Nabi (ﷺ) berwuduk dan ketika matahari terbit dan menjadi terang, baginda berdiri dan solat.\"",
        "arabic_text": "حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، قَالَ حَدَّثَنَا حُصَيْنٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، قَالَ سِرْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم لَيْلَةً فَقَالَ بَعْضُ الْقَوْمِ لَوْ عَرَّسْتَ بِنَا يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ أَخَافُ أَنْ تَنَامُوا عَنِ الصَّلاَةِ ‏\"‏‏.‏ قَالَ بِلاَلٌ أَنَا أُوقِظُكُمْ‏.‏ فَاضْطَجَعُوا وَأَسْنَدَ بِلاَلٌ ظَهْرَهُ إِلَى رَاحِلَتِهِ، فَغَلَبَتْهُ عَيْنَاهُ فَنَامَ، فَاسْتَيْقَظَ النَّبِيُّ صلى الله عليه وسلم وَقَدْ طَلَعَ حَاجِبُ الشَّمْسِ فَقَالَ ‏\"‏ يَا بِلاَلُ أَيْنَ مَا قُلْتَ ‏\"‏‏.‏ قَالَ مَا أُلْقِيَتْ عَلَىَّ نَوْمَةٌ مِثْلُهَا قَطُّ‏.‏ قَالَ ‏\"‏ إِنَّ اللَّهَ قَبَضَ أَرْوَاحَكُمْ حِينَ شَاءَ، وَرَدَّهَا عَلَيْكُمْ حِينَ شَاءَ، يَا بِلاَلُ قُمْ فَأَذِّنْ بِالنَّاسِ بِالصَّلاَةِ ‏\"‏‏.‏ فَتَوَضَّأَ فَلَمَّا ارْتَفَعَتِ الشَّمْسُ وَابْيَاضَّتْ قَامَ فَصَلَّى‏.‏"
      },
      {
        "id": 581,
        "hadith_number": "596",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kelewatan Solat Asar Semasa Peperangan Khandaq",
        "perawi_melayu": "Diriwayatkan oleh Jabir bin `Abdullah رضی اللہ عنہما :",
        "english_text": "On the day of Al-Khandaq (the battle of trench.) `Umar bin Al-Khattab رضی اللہ عنہ came cursing the disbelievers of Quraish after the sun had set and said, \"O Allah's Messenger (ﷺ) I could not offer the `Asr prayer till the sun had set.\" The Prophet (ﷺ) said, \"By Allah! I, too, have not prayed.\" So we turned towards Buthan, and the Prophet (ﷺ) performed ablution and we too performed ablution and offered the `Asr prayer after the sun had set, and then he offered the Maghrib prayer.",
        "malay_translation": "Pada hari Al-Khandaq (peperangan parit), `Umar bin Al-Khattab رضی اللہ عنہ datang sambil mengutuk kaum kafir Quraisy setelah matahari terbenam dan berkata, \"Wahai Rasulullah (ﷺ), aku tidak dapat menunaikan solat Asar sehingga matahari terbenam.\" Nabi (ﷺ) bersabda, \"Demi Allah! Aku juga belum solat.\" Maka kami berpaling ke Buthan, dan Nabi (ﷺ) berwuduk dan kami juga berwuduk dan menunaikan solat Asar setelah matahari terbenam, dan kemudian baginda menunaikan solat Maghrib.",
        "arabic_text": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، جَاءَ يَوْمَ الْخَنْدَقِ بَعْدَ مَا غَرَبَتِ الشَّمْسُ، فَجَعَلَ يَسُبُّ كُفَّارَ قُرَيْشٍ قَالَ يَا رَسُولَ اللَّهِ مَا كِدْتُ أُصَلِّي الْعَصْرَ حَتَّى كَادَتِ الشَّمْسُ تَغْرُبُ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ وَاللَّهِ مَا صَلَّيْتُهَا ‏\"‏‏.‏ فَقُمْنَا إِلَى بُطْحَانَ، فَتَوَضَّأَ لِلصَّلاَةِ، وَتَوَضَّأْنَا لَهَا فَصَلَّى الْعَصْرَ بَعْدَ مَا غَرَبَتِ الشَّمْسُ، ثُمَّ صَلَّى بَعْدَهَا الْمَغْرِبَ‏.‏"
      },
      {
        "id": 582,
        "hadith_number": "597",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menunaikan Solat yang Terlupa",
        "perawi_melayu": "Diriwayatkan oleh Anas RA:",
        "english_text": "The Prophet (ﷺ) said, \"If anyone forgets a prayer he should pray that prayer when he remembers it. There is no expiation except to pray the same.\" Then he recited: \"Establish prayer for My (i.e. Allah's) remembrance.\" (20.14).",
        "malay_translation": "Nabi SAW bersabda, \"Jika seseorang terlupa solat, hendaklah dia solat apabila dia mengingatinya. Tidak ada penebusan dosa (kaffarah) kecuali dengan menunaikan solat yang sama.\" Kemudian baginda membaca: \"Dirikanlah solat untuk mengingati-Ku.\" (20:14).",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، وَمُوسَى بْنُ إِسْمَاعِيلَ، قَالاَ حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ نَسِيَ صَلاَةً فَلْيُصَلِّ إِذَا ذَكَرَهَا، لاَ كَفَّارَةَ لَهَا إِلاَّ ذَلِكَ ‏\"‏‏.‏ ‏{‏وَأَقِمِ الصَّلاَةَ لِذِكْرِي‏}‏ قَالَ مُوسَى قَالَ هَمَّامٌ سَمِعْتُهُ يَقُولُ بَعْدُ ‏{‏وَأَقِمِ الصَّلاَةَ لِذِكْرِي‏}‏‏.‏وَقَالَ حَبَّانُ حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، حَدَّثَنَا أَنَسٌ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ‏.‏"
      },
      {
        "id": 583,
        "hadith_number": "598",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kelewatan Solat Asar pada Hari Peperangan Khandaq",
        "perawi_melayu": "Diriwayatkan oleh Jabir RA:",
        "english_text": "`Umar رضی اللہ عنه came cursing the disbelievers (of Quraish) on the day of Al-Khandaq (the battle of Trench) and said, \"I could not offer the `Asr prayer till the sun had set. Then we went to Buthan and he offered the (`Asr) prayer after sunset and then he offered the Maghrib prayer.",
        "malay_translation": "Umar RA datang sambil mencela kaum kafir (Quraisy) pada hari peperangan Khandaq dan berkata, \"Aku tidak dapat menunaikan solat Asar sehingga matahari terbenam. Kemudian kami pergi ke Buthan dan beliau menunaikan solat Asar setelah matahari terbenam, dan kemudian beliau menunaikan solat Maghrib.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، قَالَ حَدَّثَنَا يَحْيَى ـ هُوَ ابْنُ أَبِي كَثِيرٍ ـ عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرٍ، قَالَ جَعَلَ عُمَرُ يَوْمَ الْخَنْدَقِ يَسُبُّ كُفَّارَهُمْ وَقَالَ مَا كِدْتُ أُصَلِّي الْعَصْرَ حَتَّى غَرَبَتْ‏.‏ قَالَ فَنَزَلْنَا بُطْحَانَ، فَصَلَّى بَعْدَ مَا غَرَبَتِ الشَّمْسُ، ثُمَّ صَلَّى الْمَغْرِبَ‏.‏"
      },
      {
        "id": 584,
        "hadith_number": "599",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Waktu Solat Fardhu Berjemaah Menurut Abi Barza Al-Aslami",
        "perawi_melayu": "Diriwayatkan oleh Abu-l-Minhal:",
        "english_text": "My father and I went to Abi Barza Al-Aslami رضی اللہ عنہ and my father said to him, \"Tell us how Allah's Messenger (ﷺ) used to offer the compulsory congregational prayers.\" He said, \"He used to pray the Zuhr prayer, which you call the first prayer, as the sun declined at noon, the `Asr at a time when one of US could go to his family at the farthest place in Medina while the sun was still hot. (The narrator forgot what Abu Barza had said about the Maghrib prayer), and the Prophet (ﷺ) preferred to pray the `Isha' late and disliked to sleep before it or talk after it. And he used to return after finishing the morning prayer at such a time when it was possible for one to recognize the person sitting by his side and he (the Prophet) used to recite 60 to 100 'Ayat' (verses) of the Qur'an in it.\"",
        "malay_translation": "Saya dan ayah saya pergi menemui Abi Barza Al-Aslami رضی اللہ عنہ dan ayah saya berkata kepadanya, \"Beritahu kami bagaimana Rasulullah (ﷺ) menunaikan solat fardhu berjemaah.\" Dia berkata, \"Baginda menunaikan solat Zohor, yang kamu panggil solat pertama, apabila matahari condong pada tengah hari, solat Asar pada waktu seseorang daripada kami boleh pergi ke keluarganya di tempat paling jauh di Madinah ketika matahari masih panas. (Perawi terlupa apa yang Abu Barza katakan tentang solat Maghrib), dan Nabi (ﷺ) lebih suka menunaikan solat Isyak lewat dan tidak suka tidur atau bercakap selepasnya. Dan baginda pulang selepas menunaikan solat Subuh pada waktu yang membolehkan seseorang mengenali orang yang duduk di sisinya dan baginda (Nabi) membaca 60 hingga 100 'Ayat' (ayat) Al-Quran di dalamnya.\"",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا عَوْفٌ، قَالَ حَدَّثَنَا أَبُو الْمِنْهَالِ، قَالَ انْطَلَقْتُ مَعَ أَبِي إِلَى أَبِي بَرْزَةَ الأَسْلَمِيِّ فَقَالَ لَهُ أَبِي حَدِّثْنَا كَيْفَ، كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي الْمَكْتُوبَةَ قَالَ كَانَ يُصَلِّي الْهَجِيرَ وَهْىَ الَّتِي تَدْعُونَهَا الأُولَى حِينَ تَدْحَضُ الشَّمْسُ، وَيُصَلِّي الْعَصْرَ، ثُمَّ يَرْجِعُ أَحَدُنَا إِلَى أَهْلِهِ فِي أَقْصَى الْمَدِينَةِ وَالشَّمْسُ حَيَّةٌ، وَنَسِيتُ مَا قَالَ فِي الْمَغْرِبِ‏.‏ قَالَ وَكَانَ يَسْتَحِبُّ أَنْ يُؤَخِّرَ الْعِشَاءَ‏.‏ قَالَ وَكَانَ يَكْرَهُ النَّوْمَ قَبْلَهَا وَالْحَدِيثَ بَعْدَهَا، وَكَانَ يَنْفَتِلُ مِنْ صَلاَةِ الْغَدَاةِ حِينَ يَعْرِفُ أَحَدُنَا جَلِيسَهُ، وَيَقْرَأُ مِنَ السِّتِّينَ إِلَى الْمِائَةِ‏.‏"
      },
      {
        "id": 585,
        "hadith_number": "600",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keutamaan Menunggu Solat dan Melakukan Kebaikan",
        "perawi_melayu": "Diriwayatkan oleh Qurra bin Khalid:",
        "english_text": "Once he waited for Al-Hasan and he did not show up till it was about the usual time for him to start his speech; then he came and apologized saying, \"Our neighbors invited us.\" Then he added, \"Narrated Anas, 'Once we waited for the Prophet (ﷺ) till it was midnight or about midnight. He came and led the prayer, and after finishing it, he addressed us and said, 'All the people prayed and then slept and you had been in prayer as long as you were waiting for it.\" Al-Hasan said, \"The people are regarded as performing good deeds as long as they are waiting for doing good deeds.\" Al-Hasan's statement is a portion of Anas's [??] Hadith from the Prophet (ﷺ) .",
        "malay_translation": "Pernah sekali beliau menunggu Al-Hasan dan beliau tidak muncul sehingga tiba waktu lazimnya untuk beliau memulakan ucapannya; kemudian beliau datang dan meminta maaf dengan berkata, \"Jiran-jiran kami menjemput kami.\" Kemudian beliau menambah, \"Diriwayatkan oleh Anas, 'Pernah kami menunggu Nabi (ﷺ) sehingga tengah malam atau sekitar tengah malam. Baginda datang dan mengimamkan solat, dan setelah menyelesaikannya, baginda berucap kepada kami dan bersabda, 'Semua orang telah solat dan kemudian tidur, dan kamu semua berada dalam solat selama mana kamu menunggu untuknya.'\" Al-Hasan berkata, \"Orang ramai dianggap melakukan perbuatan baik selagi mereka menunggu untuk melakukan perbuatan baik.\" Kenyataan Al-Hasan adalah sebahagian daripada Hadith Anas [??] daripada Nabi (ﷺ).",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الصَّبَّاحِ، قَالَ حَدَّثَنَا أَبُو عَلِيٍّ الْحَنَفِيُّ، حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ، قَالَ انْتَظَرْنَا الْحَسَنَ وَرَاثَ عَلَيْنَا حَتَّى قَرُبْنَا مِنْ وَقْتِ قِيَامِهِ، فَجَاءَ فَقَالَ دَعَانَا جِيرَانُنَا هَؤُلاَءِ‏.‏ ثُمَّ قَالَ قَالَ أَنَسٌ نَظَرْنَا النَّبِيَّ صلى الله عليه وسلم ذَاتَ لَيْلَةٍ حَتَّى كَانَ شَطْرُ اللَّيْلِ يَبْلُغُهُ، فَجَاءَ فَصَلَّى لَنَا، ثُمَّ خَطَبَنَا فَقَالَ ‏ \"‏ أَلاَ إِنَّ النَّاسَ قَدْ صَلَّوْا ثُمَّ رَقَدُوا، وَإِنَّكُمْ لَمْ تَزَالُوا فِي صَلاَةٍ مَا انْتَظَرْتُمُ الصَّلاَةَ ‏\"‏‏.‏ قَالَ الْحَسَنُ وَإِنَّ الْقَوْمَ لاَ يَزَالُونَ بِخَيْرٍ مَا انْتَظَرُوا الْخَيْرَ‏.‏ قَالَ قُرَّةُ هُوَ مِنْ حَدِيثِ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 586,
        "hadith_number": "601",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kewafatan Generasi Selepas Seratus Tahun",
        "perawi_melayu": "Diriwayatkan oleh `Abdullah bin `Umar رضی اللہ عنہما :",
        "english_text": "The Prophet (ﷺ) prayed one of the `Isha' prayer in his last days and after finishing it with Taslim, he stood up and said, \"Do you realize (the importance of) this night? Nobody present on the surface of the earth tonight would be living after the completion of one hundred years from this night.\" The people made a mistake in grasping the meaning of this statement of Allah's Messenger (ﷺ) and they indulged in those things which are said about these narrators (i.e. some said that the Day of Resurrection will be established after 100 years etc.) But the Prophet (ﷺ) said, \"Nobody present on the surface of earth tonight would be living after the completion of 100 years from this night\"; he meant \"When that century (people of that century) would pass away.\"",
        "malay_translation": "Nabi (ﷺ) telah menunaikan salah satu solat Isyak pada hari-hari terakhirnya dan setelah selesai dengan Taslim, baginda berdiri dan bersabda, \"Adakah kamu menyedari (kepentingan) malam ini? Tiada seorang pun yang berada di permukaan bumi pada malam ini akan hidup selepas seratus tahun dari malam ini.\" Orang ramai telah tersilap dalam memahami maksud kenyataan Rasulullah (ﷺ) ini dan mereka terlibat dalam perkara-perkara yang dikatakan mengenai para perawi ini (iaitu ada yang mengatakan bahawa Hari Kiamat akan berlaku selepas 100 tahun dan lain-lain). Tetapi Nabi (ﷺ) bersabda, \"Tiada seorang pun yang berada di permukaan bumi pada malam ini akan hidup selepas seratus tahun dari malam ini\"; maksud baginda adalah \"Apabila abad itu (orang-orang pada abad itu) akan berlalu.\"",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ، وَأَبُو بَكْرِ بْنُ أَبِي حَثْمَةَ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ صَلَّى النَّبِيُّ صلى الله عليه وسلم صَلاَةَ الْعِشَاءِ فِي آخِرِ حَيَاتِهِ، فَلَمَّا سَلَّمَ قَامَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَرَأَيْتَكُمْ لَيْلَتَكُمْ هَذِهِ فَإِنَّ رَأْسَ مِائَةٍ لاَ يَبْقَى مِمَّنْ هُوَ الْيَوْمَ عَلَى ظَهْرِ الأَرْضِ أَحَدٌ ‏\"‏‏.‏ فَوَهِلَ النَّاسُ فِي مَقَالَةِ رَسُولِ اللَّهِ ـ عَلَيْهِ السَّلاَمُ ـ إِلَى مَا يَتَحَدَّثُونَ مِنْ هَذِهِ الأَحَادِيثِ عَنْ مِائَةِ سَنَةٍ، وَإِنَّمَا قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ يَبْقَى مِمَّنْ هُوَ الْيَوْمَ عَلَى ظَهْرِ الأَرْضِ ‏\"‏ يُرِيدُ بِذَلِكَ أَنَّهَا تَخْرِمُ ذَلِكَ الْقَرْنَ‏.‏"
      },
      {
        "id": 587,
        "hadith_number": "602",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keutamaan Memberi Makan kepada Sahabat Suffa dan Keberkatan Makanan",
        "perawi_melayu": "Diriwayatkan oleh Abu `Abdur Rahman bin Abi Bakr رضی اللہ عنہما :",
        "english_text": "\"The Suffa Companions were poor people and the Prophet (ﷺ) said, 'Whoever has food for two persons should take a third one from them (Suffa companions). And whosoever has food for four persons he should take one or two from them' Abu Bakr took three men and the Prophet (ﷺ) took ten of them.\" `Abdur Rahman added, my father my mother and I were there (in the house). (The sub-narrator is in doubt whether `Abdur Rahman also said, 'My wife and our servant who was common for both my house and Abu Bakr's house). Abu Bakr took his supper with the Prophet (ﷺ) and remained there till the `Isha' prayer was offered. Abu Bakr went back and stayed with the Prophet (ﷺ) till the Prophet (ﷺ) took his meal and then Abu Bakr returned to his house after a long portion of the night had passed. Abu Bakr's wife said, 'What detained you from your guests (or guest)?' He said, 'Have you not served them yet?' She said, 'They refused to eat until you come. The food was served for them but they refused.\" `Abdur Rahman added, \"I went away and hid myself (being afraid of Abu Bakr) and in the meantime he (Abu Bakr) called me, 'O Ghunthar (a harsh word)!' and also called me bad names and abused me and then said (to his family), 'Eat. No welcome for you.' Then (the supper was served). Abu Bakr took an oath that he would not eat that food. The narrator added: By Allah, whenever any one of us (myself and the guests of Suffa companions) took anything from the food, it increased from underneath. We all ate to our fill and the food was more than it was before its serving. Abu Bakr looked at it (the food) and found it as it was before serving or even more than that. He addressed his wife (saying) 'O the sister of Bani Firas! What is this?' She said, 'O the pleasure of my eyes! The food is now three times more than it was before.' Abu Bakr ate from it, and said, 'That (oath) was from Satan' meaning his oath (not to eat). Then he again took a morsel (mouthful) from it and then took the rest of it to the Prophet. So that meal was with the Prophet. There was a treaty between us and some people, and when the period of that treaty had elapsed the Prophet (ﷺ) divided us into twelve (groups) (the Prophet's companions) each being headed by a man. Allah knows how many men were under the command of each (leader). So all of them (12 groups of men) ate of that meal.\"",
        "malay_translation": "\"Sahabat Suffa adalah orang-orang miskin dan Nabi (ﷺ) bersabda, 'Sesiapa yang mempunyai makanan untuk dua orang, hendaklah dia membawa seorang lagi daripada mereka (sahabat Suffa). Dan sesiapa yang mempunyai makanan untuk empat orang, hendaklah dia membawa seorang atau dua orang daripada mereka.' Abu Bakr membawa tiga orang dan Nabi (ﷺ) membawa sepuluh orang daripada mereka.\" `Abdur Rahman menambah, ayah saya, ibu saya dan saya berada di sana (di rumah itu). (Sub-periwayat ragu-ragu sama ada `Abdur Rahman juga berkata, 'Isteri saya dan pembantu kami yang digunakan bersama oleh rumah saya dan rumah Abu Bakr). Abu Bakr makan malamnya bersama Nabi (ﷺ) dan kekal di sana sehingga solat Isyak ditunaikan. Abu Bakr pulang dan tinggal bersama Nabi (ﷺ) sehingga Nabi (ﷺ) mengambil makanannya dan kemudian Abu Bakr kembali ke rumahnya selepas sebahagian besar malam telah berlalu. Isteri Abu Bakr berkata, 'Apa yang menahan kamu daripada tetamu-tetamu kamu?' Dia berkata, 'Belumkah kamu menghidangkan mereka?' Dia berkata, 'Mereka enggan makan sehingga kamu datang. Makanan telah dihidangkan untuk mereka tetapi mereka enggan.\" `Abdur Rahman menambah, \"Saya pergi dan menyembunyikan diri saya (kerana takut kepada Abu Bakr) dan dalam pada itu dia (Abu Bakr) memanggil saya, 'Wahai Ghunthar (perkataan yang kasar)!' dan juga memanggil saya dengan nama-nama yang buruk dan memaki saya dan kemudian berkata (kepada keluarganya), 'Makanlah. Tiada sambutan untuk kamu.' Kemudian (makan malam dihidangkan). Abu Bakr bersumpah bahawa dia tidak akan makan makanan itu. Periwayat menambah: Demi Allah, setiap kali sesiapa sahaja daripada kami (saya sendiri dan tetamu-tetamu sahabat Suffa) mengambil sesuatu daripada makanan itu, ia bertambah dari bawah. Kami semua makan sehingga kenyang dan makanan itu lebih banyak daripada sebelumnya. Abu Bakr melihatnya (makanan itu) dan mendapatinya seperti sebelumnya atau bahkan lebih banyak daripada itu. Dia bertanya kepada isterinya (berkata) 'Wahai saudara perempuan Bani Firas! Apa ini?' Dia berkata, 'Wahai penyejuk mataku! Makanan itu kini tiga kali ganda lebih banyak daripada sebelumnya.' Abu Bakr makan daripadanya, dan berkata, 'Itu (sumpah) adalah daripada Syaitan' bermaksud sumpahnya (untuk tidak makan). Kemudian dia mengambil lagi sesuap (mulut) daripadanya dan kemudian membawa selebihnya kepada Nabi. Jadi makanan itu bersama Nabi. Terdapat perjanjian antara kami dan beberapa orang, dan apabila tempoh perjanjian itu telah berlalu, Nabi (ﷺ) membahagikan kami kepada dua belas (kumpulan) (sahabat-sahabat Nabi) setiap satu diketuai oleh seorang lelaki. Allah mengetahui berapa ramai lelaki yang berada di bawah perintah setiap (pemimpin). Jadi mereka semua (12 kumpulan lelaki) makan daripada makanan itu.\"",
        "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا أَبِي، حَدَّثَنَا أَبُو عُثْمَانَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ، أَنَّ أَصْحَابَ الصُّفَّةِ، كَانُوا أُنَاسًا فُقَرَاءَ، وَأَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ كَانَ عِنْدَهُ طَعَامُ اثْنَيْنِ فَلْيَذْهَبْ بِثَالِثٍ، وَإِنْ أَرْبَعٌ فَخَامِسٌ أَوْ سَادِسٌ ‏\"‏‏.‏ وَأَنَّ أَبَا بَكْرٍ جَاءَ بِثَلاَثَةٍ فَانْطَلَقَ النَّبِيُّ صلى الله عليه وسلم بِعَشَرَةٍ، قَالَ فَهْوَ أَنَا وَأَبِي وَأُمِّي، فَلاَ أَدْرِي قَالَ وَامْرَأَتِي وَخَادِمٌ بَيْنَنَا وَبَيْنَ بَيْتِ أَبِي بَكْرٍ‏.‏ وَإِنَّ أَبَا بَكْرٍ تَعَشَّى عِنْدَ النَّبِيِّ صلى الله عليه وسلم ثُمَّ لَبِثَ حَيْثُ صُلِّيَتِ الْعِشَاءُ، ثُمَّ رَجَعَ فَلَبِثَ حَتَّى تَعَشَّى النَّبِيُّ صلى الله عليه وسلم فَجَاءَ بَعْدَ مَا مَضَى مِنَ اللَّيْلِ مَا شَاءَ اللَّهُ، قَالَتْ لَهُ امْرَأَتُهُ وَمَا حَبَسَكَ عَنْ أَضْيَافِكَ ـ أَوْ قَالَتْ ضَيْفِكَ ـ قَالَ أَوَمَا عَشَّيْتِيهِمْ قَالَتْ أَبَوْا حَتَّى تَجِيءَ، قَدْ عُرِضُوا فَأَبَوْا‏.‏ قَالَ فَذَهَبْتُ أَنَا فَاخْتَبَأْتُ فَقَالَ يَا غُنْثَرُ، فَجَدَّعَ وَسَبَّ، وَقَالَ كُلُوا لاَ هَنِيئًا‏.‏ فَقَالَ وَاللَّهِ لاَ أَطْعَمُهُ أَبَدًا، وَايْمُ اللَّهِ مَا كُنَّا نَأْخُذُ مِنْ لُقْمَةٍ إِلاَّ رَبَا مِنْ أَسْفَلِهَا أَكْثَرُ مِنْهَا‏.‏ قَالَ يَعْنِي حَتَّى شَبِعُوا وَصَارَتْ أَكْثَرَ مِمَّا كَانَتْ قَبْلَ ذَلِكَ، فَنَظَرَ إِلَيْهَا أَبُو بَكْرٍ فَإِذَا هِيَ كَمَا هِيَ أَوْ أَكْثَرُ مِنْهَا‏.‏ فَقَالَ لاِمْرَأَتِهِ يَا أُخْتَ بَنِي فِرَاسٍ مَا هَذَا قَالَتْ لاَ وَقُرَّةِ عَيْنِي لَهِيَ الآنَ أَكْثَرُ مِنْهَا قَبْلَ ذَلِكَ بِثَلاَثِ مَرَّاتٍ‏.‏ فَأَكَلَ مِنْهَا أَبُو بَكْرٍ وَقَالَ إِنَّمَا كَانَ ذَلِكَ مِنَ الشَّيْطَانِ ـ يَعْنِي يَمِينَهُ ـ ثُمَّ أَكَلَ مِنْهَا لُقْمَةً، ثُمَّ حَمَلَهَا إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَصْبَحَتْ عِنْدَهُ، وَكَانَ بَيْنَنَا وَبَيْنَ قَوْمٍ عَقْدٌ، فَمَضَى الأَجَلُ، فَفَرَّقَنَا اثْنَا عَشَرَ رَجُلاً، مَعَ كُلِّ رَجُلٍ مِنْهُمْ أُنَاسٌ، اللَّهُ أَعْلَمُ كَمْ مَعَ كُلِّ رَجُلٍ فَأَكَلُوا مِنْهَا أَجْمَعُونَ، أَوْ كَمَا قَالَ‏.‏"
      },
      {
        "id": 7265,
        "hadith_number": "537",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Neraka Mengadu kepada Allah tentang Bahangnya",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "The Hell-fire of Hell complained to its Lord saying: O Lord! My parts are eating (destroying) one another. So Allah allowed it to take two breaths, one in the winter and the other in the summer. The breath in the summer is at the time when you feel the severest heat and the breath in the winter is at the time when you feel the severest cold.\"",
        "malay_translation": "Neraka Jahanam mengadu kepada Tuhannya, katanya: Wahai Tuhan! Bahagian-bahagianku saling memakan (memusnahkan) satu sama lain. Maka Allah mengizinkannya untuk menarik dua nafas, satu di musim sejuk dan satu lagi di musim panas. Nafas di musim panas adalah pada waktu kamu merasakan bahang yang paling teruk dan nafas di musim sejuk adalah pada waktu kamu merasakan kesejukan yang paling teruk.",
        "arabic_text": "وَاشْتَكَتِ النَّارُ إِلَى رَبِّهَا فَقَالَتْ يَا رَبِّ أَكَلَ بَعْضِي بَعْضًا‏.‏ فَأَذِنَ لَهَا بِنَفَسَيْنِ نَفَسٍ فِي الشِّتَاءِ، وَنَفَسٍ فِي الصَّيْفِ، فَهُوَ أَشَدُّ مَا تَجِدُونَ مِنَ الْحَرِّ، وَأَشَدُّ مَا تَجِدُونَ مِنَ الزَّمْهَرِيرِ ‏\"‏‏.‏"
      },
      {
        "id": 7267,
        "hadith_number": "582",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Solat Ketika Matahari Terbit dan Terbenam",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Umar رضي الله عنهما:",
        "english_text": "\"Allah's Messenger (ﷺ) said, 'Do not pray at the time of sunrise and at the time of sunset.'",
        "malay_translation": "Rasulullah ﷺ bersabda, 'Janganlah kamu solat ketika matahari terbit dan ketika matahari terbenam.'",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي قَالَ، أَخْبَرَنِي ابْنُ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَحَرَّوْا بِصَلاَتِكُمْ طُلُوعَ الشَّمْسِ وَلاَ غُرُوبَهَا ‏\"‏‏."
      }
    ]
  }
}