{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 37,
    "data": [
      {
        "id": 293,
        "hadith_number": "294",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukum Wanita Haid Semasa Haji",
        "perawi_melayu": "Dikisahkan oleh `Aisha رضي الله عنها",
        "english_text": "\"We set out with the sole intention of performing Hajj and when we reached Sarif, (a place six miles from Mecca) I got my menses. Allah's Messenger (ﷺ) came to me while I was weeping. He said 'What is the matter with you? Have you got your menses?' I replied, 'Yes.' He said, 'This is a thing which Allah has ordained for the daughters of Adam. So do what all the pilgrims do with the exception of the Tawaf (Circumambulation) round the Ka`ba.\" `Aisha رضي الله عنها added, \"Allah's Messenger (ﷺ) sacrificed cows on behalf of his wives.\"",
        "malay_translation": "\"Kami berangkat dengan niat menunaikan haji dan ketika sampai di Sarif (lokasi enam batu dari Mekah), saya mengalami haid. Rasulullah SAW datang menemui saya ketika saya sedang menangis. Baginda bertanya, 'Apa yang terjadi? Adakah kamu mengalami haid?' Saya menjawab, 'Ya.' Baginda bersabda, 'Ini adalah ketentuan Allah bagi anak perempuan Adam. Lakukanlah semua amalan jemaah haji kecuali tawaf di Kaabah.' `Aisha رضي الله عنها menambah, 'Rasulullah SAW menyembelih lembu bagi pihak isteri-isterinya.'\"",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ، قَالَ سَمِعْتُ الْقَاسِمَ، يَقُولُ سَمِعْتُ عَائِشَةَ، تَقُولُ خَرَجْنَا لاَ نَرَى إِلاَّ الْحَجَّ، فَلَمَّا كُنَّا بِسَرِفَ حِضْتُ، فَدَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنَا أَبْكِي قَالَ ‏\"‏ مَا لَكِ أَنُفِسْتِ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ إِنَّ هَذَا أَمْرٌ كَتَبَهُ اللَّهُ عَلَى بَنَاتِ آدَمَ، فَاقْضِي مَا يَقْضِي الْحَاجُّ، غَيْرَ أَنْ لاَ تَطُوفِي بِالْبَيْتِ ‏\"‏‏.‏ قَالَتْ وَضَحَّى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ نِسَائِهِ بِالْبَقَرِ‏.‏"
      },
      {
        "id": 294,
        "hadith_number": "295",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menggunakan Sisir Rambut Sewaktu Haid",
        "perawi_melayu": "Dikisahkan oleh `Aishah:",
        "english_text": "While in menses, I used to comb the hair of Allah's Messenger (ﷺ).",
        "malay_translation": "Ketika dalam keadaan haid, aku biasa menyisir rambut Rasulullah SAW.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أُرَجِّلُ رَأْسَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَنَا حَائِضٌ‏.‏"
      },
      {
        "id": 295,
        "hadith_number": "296",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perkhidmatan Wanita Haid dan Junub",
        "perawi_melayu": "Dikisahkan oleh `Urwa",
        "english_text": "A person asked me, \"Can a woman in menses serve me? And can a Junub woman come close to me?\" I replied, \"All this is easy for me. All of them can serve me, and there is no harm for any other person to do the same. `Aisha told me that she used to comb the hair of Allah's Messenger (ﷺ) while she was in her menses, and he was in I`tikaf (in the mosque). He would bring his head near her in her room and she would comb his hair, while she used to be in her menses.\"",
        "malay_translation": "Seseorang bertanya kepada saya, \"Bolehkah seorang wanita dalam haid melayani saya? Dan bolehkah seorang wanita junub mendekati saya?\" Saya menjawab, \"Semua ini mudah bagi saya. Semua mereka boleh melayani saya, dan tiada mudarat bagi orang lain untuk berbuat demikian. `Aisha memberitahu saya bahawa dia biasa menyisir rambut Rasulullah SAW ketika dia dalam haid, dan baginda sedang beriktikaf (di masjid). Baginda akan mendekatkan kepala baginda kepadanya di dalam biliknya dan dia akan menyisir rambut baginda, ketika dia dalam haid.\"",
        "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، قَالَ أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي هِشَامٌ، عَنْ عُرْوَةَ، أَنَّهُ سُئِلَ أَتَخْدُمُنِي الْحَائِضُ أَوْ تَدْنُو مِنِّي الْمَرْأَةُ وَهْىَ جُنُبٌ فَقَالَ عُرْوَةُ كُلُّ ذَلِكَ عَلَىَّ هَيِّنٌ، وَكُلُّ ذَلِكَ تَخْدُمُنِي، وَلَيْسَ عَلَى أَحَدٍ فِي ذَلِكَ بَأْسٌ، أَخْبَرَتْنِي عَائِشَةُ أَنَّهَا كَانَتْ تُرَجِّلُ ـ تَعْنِي ـ رَأْسَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهِيَ حَائِضٌ، وَرَسُولُ اللَّهِ صلى الله عليه وسلم حِينَئِذٍ مُجَاوِرٌ فِي الْمَسْجِدِ، يُدْنِي لَهَا رَأْسَهُ وَهْىَ فِي حُجْرَتِهَا، فَتُرَجِّلُهُ وَهْىَ حَائِضٌ‏.‏"
      },
      {
        "id": 296,
        "hadith_number": "297",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi SAW Bersandar di Paha Ketika Haid dan Membaca Al-Quran",
        "perawi_melayu": "Dikisahkan oleh 'Aishah r.a.",
        "english_text": "The Prophet (ﷺ) used to lean on my lap and recite Qur'an while I was in menses.",
        "malay_translation": "Nabi SAW  biasa bersandar di pangkuan saya dan membaca Al-Quran semasa saya dalam keadaan haid.",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ الْفَضْلُ بْنُ دُكَيْنٍ، سَمِعَ زُهَيْرًا، عَنْ مَنْصُورٍ ابْنِ صَفِيَّةَ، أَنَّ أُمَّهُ، حَدَّثَتْهُ أَنَّ عَائِشَةَ حَدَّثَتْهَا أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَتَّكِئُ فِي حَجْرِي وَأَنَا حَائِضٌ، ثُمَّ يَقْرَأُ الْقُرْآنَ‏.‏"
      },
      {
        "id": 297,
        "hadith_number": "298",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pengalaman Haid di Samping Rasulullah SAW",
        "perawi_melayu": "Dikisahkan oleh Um Salama:",
        "english_text": "While I was laying with the Prophet (ﷺ) under a single woolen sheet, I got the menses. I slipped away and put on the clothes for menses. He said, \"Have you got \"Nifas\" (menses)?\" I replied, \"Yes.\" He then called me and made me lie with him under the same sheet.",
        "malay_translation": "Ketika aku berbaring bersama Rasulullah SAW di bawah sehelai selimut bulu biri-biri, aku mengalami haid. Aku segera menyingkir dan mengenakan pakaian haid. Baginda bertanya, \"Apakah engkau mengalami haid?\" Aku menjawab, \"Ya.\" Kemudian Baginda memanggilku dan menyuruhku berbaring bersamanya di bawah selimut yang sama.",
        "arabic_text": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، أَنَّ زَيْنَبَ ابْنَةَ أُمِّ سَلَمَةَ، حَدَّثَتْهُ أَنَّ أُمَّ سَلَمَةَ حَدَّثَتْهَا قَالَتْ، بَيْنَا أَنَا مَعَ النَّبِيِّ، صلى الله عليه وسلم مُضْطَجِعَةً فِي خَمِيصَةٍ إِذْ حِضْتُ، فَانْسَلَلْتُ فَأَخَذْتُ ثِيَابَ حِيضَتِي قَالَ ‏ \"‏ أَنُفِسْتِ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ فَدَعَانِي فَاضْطَجَعْتُ مَعَهُ فِي الْخَمِيلَةِ‏.‏"
      },
      {
        "id": 298,
        "hadith_number": "299, 300, 301",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kebersihan dan Kedekatan Nabi SAW dengan Para Isteri Ketika Haid",
        "perawi_melayu": "Dikisahkan oleh `Aisyah رضي الله عنها",
        "english_text": "The Prophet (ﷺ) and I used to take a bath from a single pot while we were Junub. During the menses, he used to order me to put on an Izar (dress worn below the waist) and used to fondle me. While in I`tikaf, he used to bring his head near me and I would wash it while I used to be in my periods (menses).",
        "malay_translation": "Nabi SAW dan saya biasa mandi dengan satu periuk yang sama ketika junub.  Ketika saya dalam keadaan haid, baginda akan suruh saya memakai izar (pakaian yang dipakai di bawah pinggang) dan menyentuh saya. Ketika baginda ber`itikaf, baginda akan mendekatkan kepala baginda kepada saya dan saya akan membasuh rambut baginda ketika saya sedang haid.",
        "arabic_text": "حَدَّثَنَا قَبِيصَةُ ، قَالَ : حَدَّثَنَا سُفْيَانُ ، عَنْ مَنْصُورٍ ، عَنْ إِبْرَاهِيمَ ، عَنِ الْأَسْوَدِ ، عَنْ عَائِشَةَ ، قَالَتْ : كُنْتُ أَغْتَسِلُ أَنَا وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ إِنَاءٍ وَاحِدٍ كِلَانَا جُنُبٌ.وَكَانَ يَأْمُرُنِي فَأَتَّزِرُ، فَيُبَاشِرُنِي وَأَنَا حَائِضٌ‏.‏ وَكَانَ يُخْرِجُ رَأْسَهُ إِلَىَّ وَهُوَ مُعْتَكِفٌ، فَأَغْسِلُهُ وَأَنَا حَائِضٌ‏.‏"
      },
      {
        "id": 299,
        "hadith_number": "302",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Berlaku Ketika Menghampiri Wanita Haid",
        "perawi_melayu": "Dikisahkan oleh `Abdur-Rahman bin Al-Aswad (berdasarkan pengakuan bapanya): `Aisha berkata:",
        "english_text": "\"Whenever Allah's Messenger (ﷺ) wanted to fondle anyone of us during her periods (menses), he used to order her to put on an Izar and start fondling her.\" `Aisha added, \"None of you could control his sexual desires as the Prophet (ﷺ) could.\"",
        "malay_translation": "“Apabila Rasulullah SAW ingin menyentuh mana-mana daripada kita ketika dia sedang haid, baginda akan menyuruhnya memakai Izar dan kemudian menyentuhnya.” `Aisha menambah, “Tiada seorang pun di antara kamu yang mampu mengawal nafsunya seperti yang Rasulullah SAW mampu.”",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ خَلِيلٍ، قَالَ أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ، قَالَ أَخْبَرَنَا أَبُو إِسْحَاقَ ـ هُوَ الشَّيْبَانِيُّ ـ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَسْوَدِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَتْ إِحْدَانَا إِذَا كَانَتْ حَائِضًا، فَأَرَادَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُبَاشِرَهَا، أَمَرَهَا أَنْ تَتَّزِرَ فِي فَوْرِ حَيْضَتِهَا ثُمَّ يُبَاشِرُهَا‏.‏ قَالَتْ وَأَيُّكُمْ يَمْلِكُ إِرْبَهُ كَمَا كَانَ النَّبِيُّ صلى الله عليه وسلم يَمْلِكُ إِرْبَهُ‏.‏ تَابَعَهُ خَالِدٌ وَجَرِيرٌ عَنِ الشَّيْبَانِيِّ‏.‏"
      },
      {
        "id": 300,
        "hadith_number": "303",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Rasulullah SAW Mengendalikan Hubungan Dengan Isteri Ketika Haid",
        "perawi_melayu": "Dikisahkan oleh Maimuna:",
        "english_text": "When ever Allah's Messenger (ﷺ) wanted to fondle any of his wives during the periods (menses), he used to ask her to wear an Izar.",
        "malay_translation": "Apabila Rasulullah SAW ingin bermanja dengan mana-mana isterinya ketika dalam tempoh haid, baginda akan meminta isterinya memakai kain Izar.",
        "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ حَدَّثَنَا الشَّيْبَانِيُّ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ شَدَّادٍ، قَالَ سَمِعْتُ مَيْمُونَةَ، كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَرَادَ أَنْ يُبَاشِرَ امْرَأَةً مِنْ نِسَائِهِ أَمَرَهَا فَاتَّزَرَتْ وَهْىَ حَائِضٌ‏.‏ وَرَوَاهُ سُفْيَانُ عَنِ الشَّيْبَانِيِّ‏.‏"
      },
      {
        "id": 301,
        "hadith_number": "304",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan dan Nasihat kepada Wanita dalam Islam",
        "perawi_melayu": "Daripada Abu Sa`id Al-Khudri",
        "english_text": "Once Allah's Messenger (ﷺ) went out to the Musalla (to offer the prayer) of `Id-al-Adha or Al-Fitr prayer. Then he passed by the women and said, \"O women! Give alms, as I have seen that the majority of the dwellers of Hell-fire were you (women).\" They asked, \"Why is it so, O Allah's Messenger (ﷺ) ?\" He replied, \"You curse frequently and are ungrateful to your husbands. I have not seen anyone more deficient in intelligence and religion than you. A cautious sensible man could be led astray by some of you.\" The women asked, \"O Allah's Messenger (ﷺ)! What is deficient in our intelligence and religion?\" He said, \"Is not the evidence of two women equal to the witness of one man?\" They replied in the affirmative. He said, \"This is the deficiency in her intelligence. Isn't it true that a woman can neither pray nor fast during her menses?\" The women replied in the affirmative. He said, \"This is the deficiency in her religion.\"",
        "malay_translation": "Suatu ketika Rasulullah SAW keluar ke Musalla untuk menunaikan solat Aidil Adha atau Aidilfitri. Kemudian baginda lalu di hadapan para wanita dan bersabda, \"Wahai wanita! Bersedekahlah, kerana aku telah melihat bahawa kebanyakan penghuni neraka adalah kamu (wanita).\" Mereka bertanya, \"Mengapa demikian, wahai Rasulullah SAW?\" Baginda menjawab, \"Kamu sering mengumpat dan tidak mengenang budi kepada suami kamu. Aku tidak melihat sesiapa yang lebih kurang cerdas dan kurang beragama daripada kamu. Lelaki yang berhati-hati dan bijaksana pun boleh sesat dek kerana sebahagian daripada kamu.\" Para wanita bertanya, \"Wahai Rasulullah SAW! Apakah kekurangan kecerdasan dan agama kita?\" Baginda bersabda, \"Bukankah saksi dua wanita sama dengan saksi seorang lelaki?\" Mereka menjawab, 'Benar'. Baginda bersabda, \"Inilah kekurangan kecerdasan wanita. Bukankah benar wanita tidak boleh solat dan berpuasa ketika haid?\" Para wanita menjawab, 'Benar'. Baginda bersabda, \"Inilah kekurangan agama wanita.\"",
        "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ أَخْبَرَنِي زَيْدٌ ـ هُوَ ابْنُ أَسْلَمَ ـ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي أَضْحًى ـ أَوْ فِطْرٍ ـ إِلَى الْمُصَلَّى، فَمَرَّ عَلَى النِّسَاءِ فَقَالَ ‏\"‏ يَا مَعْشَرَ النِّسَاءِ تَصَدَّقْنَ، فَإِنِّي أُرِيتُكُنَّ أَكْثَرَ أَهْلِ النَّارِ ‏\"‏‏.‏ فَقُلْنَ وَبِمَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ تُكْثِرْنَ اللَّعْنَ، وَتَكْفُرْنَ الْعَشِيرَ، مَا رَأَيْتُ مِنْ نَاقِصَاتِ عَقْلٍ وَدِينٍ أَذْهَبَ لِلُبِّ الرَّجُلِ الْحَازِمِ مِنْ إِحْدَاكُنَّ ‏\"‏‏.‏ قُلْنَ وَمَا نُقْصَانُ دِينِنَا وَعَقْلِنَا يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ أَلَيْسَ شَهَادَةُ الْمَرْأَةِ مِثْلَ نِصْفِ شَهَادَةِ الرَّجُلِ ‏\"‏‏.‏ قُلْنَ بَلَى‏.‏ قَالَ ‏\"‏ فَذَلِكَ مِنْ نُقْصَانِ عَقْلِهَا، أَلَيْسَ إِذَا حَاضَتْ لَمْ تُصَلِّ وَلَمْ تَصُمْ ‏\"‏‏.‏ قُلْنَ بَلَى‏.‏ قَالَ ‏\"‏ فَذَلِكَ مِنْ نُقْصَانِ دِينِهَا ‏\"‏‏.‏"
      },
      {
        "id": 302,
        "hadith_number": "305",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukum Wanita Haid Semasa Haji",
        "perawi_melayu": "Dikisahkan oleh 'Aishah:",
        "english_text": "We set out with the Prophet (ﷺ) for Hajj and when we reached Sarif I got my menses. When the Prophet (ﷺ) came to me, I was weeping. He asked, \"Why are you weeping?\" I said, \"I wish if I had not performed Hajj this year.\" He asked, \"May be that you got your menses?\" I replied, \"Yes.\" He then said, \"This is the thing which Allah has ordained for all the daughters of Adam. So do what all the pilgrims do except that you do not perform the Tawaf round the Ka`ba till you are clean.\"",
        "malay_translation": "Kami berangkat bersama Nabi (ﷺ) untuk menunaikan haji, dan ketika sampai di Sarif, saya mengalami haid. Ketika Nabi (ﷺ) datang kepada saya, saya menangis. Beliau bertanya, \"Mengapa engkau menangis?\" Saya menjawab, \"Andai saja saya tidak menunaikan haji tahun ini.\" Beliau bertanya, \"Mungkin engkau mengalami haid?\" Saya menjawab, \"Ya.\" Kemudian beliau bersabda, \"Inilah yang telah ditetapkan Allah bagi semua wanita keturunan Adam. Lakukanlah seperti jemaah haji yang lain, kecuali engkau tidak melakukan Tawaf di Kaabah sehingga engkau suci.\" ",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، قَالَتْ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم لاَ نَذْكُرُ إِلاَّ الْحَجَّ، فَلَمَّا جِئْنَا سَرِفَ طَمِثْتُ، فَدَخَلَ عَلَىَّ النَّبِيُّ صلى الله عليه وسلم وَأَنَا أَبْكِي فَقَالَ ‏{‏مَا يُبْكِيكِ‏}‏‏.‏ قُلْتُ لَوَدِدْتُ وَاللَّهِ أَنِّي لَمْ أَحُجَّ الْعَامَ‏.‏ قَالَ ‏{‏لَعَلَّكِ نُفِسْتِ‏}‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏ \"‏ فَإِنَّ ذَلِكَ شَىْءٌ كَتَبَهُ اللَّهُ عَلَى بَنَاتِ آدَمَ، فَافْعَلِي مَا يَفْعَلُ الْحَاجُّ، غَيْرَ أَنْ لاَ تَطُوفِي بِالْبَيْتِ حَتَّى تَطْهُرِي ‏\"‏‏.‏"
      },
      {
        "id": 303,
        "hadith_number": "306",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Panduan Solat Wanita Semasa Haid",
        "perawi_melayu": "Dikisahkan oleh `Aisha",
        "english_text": "Fatima bint Abi Hubaish berkata kepada Rasulullah (ﷺ), \"Wahai Rasulullah (ﷺ)! Saya tidak suci (dari pendarahan). Adakah saya perlu berhenti solat?\" Rasulullah (ﷺ) menjawab, \"Tidak, kerana ia daripada saluran darah dan bukan haid. Oleh itu, apabila haid sebenar datang, berhentilah solat dan apabila ia (tempoh haid) berakhir, bersihkan darah dari badan anda (mandi wajib) dan laksanakan solat.\"",
        "malay_translation": "Fatima binti Abi Hubaish berkata kepada Rasulullah (ﷺ), \"Wahai Rasulullah (ﷺ), saya tidak suci (dari pendarahan). Adakah saya perlu berhenti solat?\" Rasulullah (ﷺ) menjawab, \"Tidak, kerana ia daripada saluran darah dan bukan haid. Oleh itu, apabila haid sebenar datang, berhentilah solat dan apabila ia (tempoh haid) berakhir, bersihkan darah dari badan anda (mandi wajib) dan laksanakan solat.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ قَالَتْ فَاطِمَةُ بِنْتُ أَبِي حُبَيْشٍ لِرَسُولِ اللَّهِ صلى الله عليه وسلم يَا رَسُولَ اللَّهِ إِنِّي لاَ أَطْهُرُ، أَفَأَدَعُ الصَّلاَةَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّمَا ذَلِكِ عِرْقٌ وَلَيْسَ بِالْحَيْضَةِ، فَإِذَا أَقْبَلَتِ الْحَيْضَةُ فَاتْرُكِي الصَّلاَةَ، فَإِذَا ذَهَبَ قَدْرُهَا فَاغْسِلِي عَنْكِ الدَّمَ وَصَلِّي ‏\"‏‏.‏"
      },
      {
        "id": 304,
        "hadith_number": "307",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Tindakan Jika Darah Haid Menimpa Pakaian",
        "perawi_melayu": "Dikisahkan oleh Asma' binti Abi Bakr:",
        "english_text": "A woman asked Allah's Messenger (ﷺ), \"O Allah's Messenger (ﷺ)! What should we do, if the blood of menses falls on our clothes?\" Allah's Messenger (ﷺ) replied, \"If the blood of menses falls on the garment of anyone of you, she must take hold of the blood spot, rub it, and wash it with water and then pray in (with it).\"",
        "malay_translation": "Seorang wanita bertanya kepada Rasulullah SAW, \"Wahai Rasulullah SAW! Apakah yang harus kami lakukan jika darah haid terkena pakaian kami?\" Rasulullah SAW menjawab, \"Jika darah haid terkena pakaian salah seorang di antara kamu, hendaklah dia memegang tempat darah tersebut, gosokkannya, dan basuh dengan air, kemudian solat dengan (pakaian tersebut).\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامٍ، عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، أَنَّهَا قَالَتْ سَأَلَتِ امْرَأَةٌ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ، أَرَأَيْتَ إِحْدَانَا إِذَا أَصَابَ ثَوْبَهَا الدَّمُ مِنَ الْحَيْضَةِ، كَيْفَ تَصْنَعُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا أَصَابَ ثَوْبَ إِحْدَاكُنَّ الدَّمُ مِنَ الْحَيْضَةِ، فَلْتَقْرُصْهُ ثُمَّ لِتَنْضَحْهُ بِمَاءٍ، ثُمَّ لِتُصَلِّي فِيهِ ‏\"‏‏.‏"
      },
      {
        "id": 305,
        "hadith_number": "308",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Wanita Membersihkan Diri Selepas Haid dan Solat Dengan Pakaian yang Terkena Darah",
        "perawi_melayu": "Dikisahkan oleh `Aisha",
        "english_text": "Whenever anyone of us got her menses, she, on becoming clean, used to take hold of the blood spot and rub the blood off her garment, and pour water over it and wash that portion thoroughly and sprinkle water over the rest of the garment. After that she would pray in (with) it.",
        "malay_translation": "Apabila mana-mana di antara kita mengalami haid, setelah suci, dia akan mengambil kesan darah dan menggosoknya keluar dari pakaiannya, kemudian menuangkan air ke atasnya dan membasuh bahagian itu dengan teliti, dan menyiramkan air ke atas bahagian lain pakaian tersebut. Selepas itu, dia akan solat dengan menggunakan pakaian tersebut.",
        "arabic_text": "حَدَّثَنَا أَصْبَغُ، قَالَ أَخْبَرَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، حَدَّثَهُ عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَتْ إِحْدَانَا تَحِيضُ، ثُمَّ تَقْتَرِصُ الدَّمَ مِنْ ثَوْبِهَا عِنْدَ طُهْرِهَا فَتَغْسِلُهُ، وَتَنْضَحُ عَلَى سَائِرِهِ، ثُمَّ تُصَلِّي فِيهِ‏.‏"
      },
      {
        "id": 306,
        "hadith_number": "309",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perihal I'tikaf Seorang Isteri Nabi SAW dan Perdarahan Haid",
        "perawi_melayu": "Dikisahkan oleh `Aisha:",
        "english_text": "Once one of the wives of the Prophet (ﷺ) did I`tikaf along with him and she was getting bleeding in between her periods. She used to see the blood (from her private parts) and she would perhaps put a dish under her for the blood. (The sub-narrator `Ikrima added, `Aisha once saw the liquid of safflower and said, \"It looks like what so and so used to have.\")",
        "malay_translation": "Suatu ketika, salah seorang isteri Nabi SAW (ﷺ) melakukan i'tikaf bersama Baginda dan beliau mengalami pendarahan di antara haid. Beliau melihat darah (dari bahagian sulitnya) dan mungkin meletakkan pinggan di bawahnya untuk menampung darah tersebut. (Perawi tambahan, `Ikrima, menceritakan lagi, `Aisha pernah melihat cecair bunga safir dan berkata, \"Ia seakan-akan seperti yang dimiliki oleh si fulan.\") ",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ، قَالَ حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ خَالِدٍ، عَنْ عِكْرِمَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم اعْتَكَفَ مَعَهُ بَعْضُ نِسَائِهِ وَهْىَ مُسْتَحَاضَةٌ تَرَى الدَّمَ، فَرُبَّمَا وَضَعَتِ الطَّسْتَ تَحْتَهَا مِنَ الدَّمِ‏.‏ وَزَعَمَ أَنَّ عَائِشَةَ رَأَتْ مَاءَ الْعُصْفُرِ فَقَالَتْ كَأَنَّ هَذَا شَىْءٌ كَانَتْ فُلاَنَةُ تَجِدُهُ‏.‏"
      },
      {
        "id": 307,
        "hadith_number": "310",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "I`tikaf Seorang Istri Nabi SAW dan Pengalamannya dengan Perdarahan",
        "perawi_melayu": "Diriwayatkan oleh `Aisha",
        "english_text": "\"One of the wives of Allah's Messenger (ﷺ) joined him in I`tikaf and she noticed blood and yellowish discharge (from her private parts) and put a dish under her when she prayed.\"",
        "malay_translation": "\"Salah seorang isteri Rasulullah SAW turut serta dalam I`tikaf bersamanya dan dia mendapati keluar darah dan cairan kuning (dari bahagian sulit) dan meletakkan dulang di bawahnya ketika dia sembahyang.\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ خَالِدٍ، عَنْ عِكْرِمَةَ، عَنْ عَائِشَةَ، قَالَتِ اعْتَكَفَتْ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم امْرَأَةٌ مِنْ أَزْوَاجِهِ، فَكَانَتْ تَرَى الدَّمَ وَالصُّفْرَةَ، وَالطَّسْتُ تَحْتَهَا وَهْىَ تُصَلِّي‏.‏"
      },
      {
        "id": 308,
        "hadith_number": "311",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "I`tikaf Seorang Ibu Yang Solehah Ketika Haid",
        "perawi_melayu": "Dikisahkan oleh `Aishah:",
        "english_text": "One of the mothers of the faithful believers (i.e. the wives of the Prophet (ﷺ) ) did I`tikaf while she was having bleeding in between her periods.",
        "malay_translation": "Salah seorang ibu kepada orang-orang yang beriman (iaitu isteri-isteri Nabi SAW) melakukan i'tikaf ketika sedang mengalami pendarahan di antara haid.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا مُعْتَمِرٌ، عَنْ خَالِدٍ، عَنْ عِكْرِمَةَ، عَنْ عَائِشَةَ، أَنَّ بَعْضَ، أُمَّهَاتِ الْمُؤْمِنِينَ اعْتَكَفَتْ وَهْىَ مُسْتَحَاضَةٌ‏.‏"
      },
      {
        "id": 309,
        "hadith_number": "312",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menggunakan Air Liur untuk Membersihkan Darah Haid",
        "perawi_melayu": "Dikisahkan oleh `Aisha:",
        "english_text": "None of us had more than a single garment and we used to have our menses while wearing it. Whenever it got soiled with blood of menses we used to apply saliva to the blood spot and rub off the blood with our nails.",
        "malay_translation": "Tidak seorang pun dari kita memiliki lebih daripada sehelai pakaian dan kita sering mengalami haid ketika mengenakannya.  Apabila pakaian terkena darah haid, kita akan menggunakan air liur untuk melembutkan noda tersebut dan mengikis darah dengan kuku.",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ نَافِعٍ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، قَالَ قَالَتْ عَائِشَةُ مَا كَانَ لإِحْدَانَا إِلاَّ ثَوْبٌ وَاحِدٌ تَحِيضُ فِيهِ، فَإِذَا أَصَابَهُ شَىْءٌ مِنْ دَمٍ، قَالَتْ بِرِيقِهَا فَقَصَعَتْهُ بِظُفْرِهَا‏.‏"
      },
      {
        "id": 310,
        "hadith_number": "313",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hadis tentang Batasan Tangisan dan Perhiasan Semasa Berkabung",
        "perawi_melayu": "Dikisahkan oleh Um-`Atiya:",
        "english_text": "We were forbidden to mourn for a dead person for more than three days except in the case of a husband for whom mourning was allowed for four months and ten days. (During that time) we were not allowed to put kohl (Antimony eye power) in our eyes or to use perfumes or to put on colored clothes except a dress made of `Asr (a kind of Yemen cloth, very coarse and rough). We were allowed very light perfumes at the time of taking a bath after menses and also we were forbidden to go with the funeral procession .",
        "malay_translation": "Kami dilarang berkabung melebihi tiga hari untuk orang yang meninggal dunia, kecuali dalam kes suami yang dibenarkan berkabung selama empat bulan sepuluh hari. (Pada masa itu) kami dilarang memakai kohl (ubat mata antimony), menggunakan minyak wangi atau mengenakan pakaian berwarna, kecuali pakaian daripada kain `Asr (sejenis kain Yaman yang kasar). Penggunaan minyak wangi yang ringan dibenarkan semasa mandi selepas haid. Kami juga dilarang mengikuti perarakan jenazah.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ حَفْصَةَ ـ قَالَ أَبُو عَبْدِ اللَّهِ أَوْ هِشَامِ بْنِ حَسَّانَ عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ ـ قَالَتْ كُنَّا نُنْهَى أَنْ نُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثٍ، إِلاَّ عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا، وَلاَ نَكْتَحِلَ وَلاَ نَتَطَيَّبَ وَلاَ نَلْبَسَ ثَوْبًا مَصْبُوغًا إِلاَّ ثَوْبَ عَصْبٍ، وَقَدْ رُخِّصَ لَنَا عِنْدَ الطُّهْرِ إِذَا اغْتَسَلَتْ إِحْدَانَا مِنْ مَحِيضِهَا فِي نُبْذَةٍ مِنْ كُسْتِ أَظْفَارٍ، وَكُنَّا نُنْهَى عَنِ اتِّبَاعِ الْجَنَائِزِ‏.‏ قَالَ رَوَاهُ هِشَامُ بْنُ حَسَّانَ عَنْ حَفْصَةَ عَنْ أُمِّ عَطِيَّةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 311,
        "hadith_number": "314",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Bersuci Wanita Selepas Haid",
        "perawi_melayu": "Dikisahkan oleh 'Aishah:",
        "english_text": "A woman asked the Prophet (ﷺ) about the bath which is taken after finishing from the menses. The Prophet (ﷺ) told her what to do and said, \"Purify yourself with a piece of cloth scented with musk.\" The woman asked, \"How shall I purify myself with it\" He said, \"Subhan Allah! Purify yourself (with it).\" I pulled her to myself and said, \"Rub the place soiled with blood with it.\"",
        "malay_translation": "Seorang wanita bertanya kepada Nabi (ﷺ) tentang cara bersuci selepas haid. Baginda Nabi (ﷺ) memberitahu apa yang perlu dilakukan dan bersabda, \"Bersihkan dirimu dengan kain yang berbau wangi.\" Wanita itu bertanya, \"Bagaimana saya membersihkan diri dengannya?\" Baginda menjawab, \"Subhanallah! Bersihkan dirimu dengannya.\" Aku menariknya ke sisiku dan berkata, \"Gosoklah tempat yang terkena darah dengannya.\"",
        "arabic_text": "حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ مَنْصُورِ ابْنِ صَفِيَّةَ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ، أَنَّ امْرَأَةً، سَأَلَتِ النَّبِيَّ صلى الله عليه وسلم عَنْ غُسْلِهَا مِنَ الْمَحِيضِ، فَأَمَرَهَا كَيْفَ تَغْتَسِلُ قَالَ ‏\"‏ خُذِي فِرْصَةً مِنْ مِسْكٍ فَتَطَهَّرِي بِهَا ‏\"‏‏.‏ قَالَتْ كَيْفَ أَتَطَهَّرُ قَالَ ‏\"‏ تَطَهَّرِي بِهَا ‏\"‏‏.‏ قَالَتْ كَيْفَ قَالَ ‏\"‏ سُبْحَانَ اللَّهِ تَطَهَّرِي ‏\"‏‏.‏ فَاجْتَبَذْتُهَا إِلَىَّ فَقُلْتُ تَتَبَّعِي بِهَا أَثَرَ الدَّمِ‏.‏"
      },
      {
        "id": 312,
        "hadith_number": "315",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Mandi Haid Wanita Ansar",
        "perawi_melayu": "Diriwayatkan oleh `Aisha",
        "english_text": "An Ansari woman asked the Prophet (ﷺ) how to take a bath after finishing from the menses. He replied, \"Take a piece a cloth perfumed with musk and clean the private parts with it thrice.\" The Prophet (ﷺ) felt shy and turned his face. So I pulled her to me and told her what the Prophet (ﷺ) meant.",
        "malay_translation": "Seorang wanita Ansar bertanya kepada Nabi (ﷺ) bagaimana cara mandi selepas selesai haid. Baginda menjawab, \"Ambillah sehelai kain yang berbau wangi musk dan bersihkan bahagian sulit dengannya sebanyak tiga kali.\" Nabi (ﷺ) merasa malu dan memalingkan wajahnya. Maka aku menariknya kepadaku dan menjelaskannya maksud Nabi (ﷺ). (Hadis ini berkaitan dengan cara membersihkan diri selepas haid).",
        "arabic_text": "حَدَّثَنَا مُسْلِمٌ، قَالَ حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا مَنْصُورٌ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ، أَنَّ امْرَأَةً، مِنَ الأَنْصَارِ قَالَتْ لِلنَّبِيِّ صلى الله عليه وسلم كَيْفَ أَغْتَسِلُ مِنَ الْمَحِيضِ قَالَ ‏\"‏ خُذِي فِرْصَةً مُمَسَّكَةً، فَتَوَضَّئِي ثَلاَثًا ‏\"‏‏.‏ ثُمَّ إِنَّ النَّبِيَّ صلى الله عليه وسلم اسْتَحْيَا فَأَعْرَضَ بِوَجْهِهِ أَوْ قَالَ ‏\"‏ تَوَضَّئِي بِهَا ‏\"‏ فَأَخَذْتُهَا فَجَذَبْتُهَا فَأَخْبَرْتُهَا بِمَا يُرِيدُ النَّبِيُّ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 313,
        "hadith_number": "316",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Mengisi Haji Tamattu' dan Menunda Umrah",
        "perawi_melayu": "Dikisahkan oleh `Aishah:",
        "english_text": "In the last Hajj of Allah's Messenger (ﷺ) I assumed the Ihram for Hajj along with Allah Apostle. I was one of those who intended Tamattu` (to perform Hajj and `Umra) and did not take the Hadi (animal for sacrifice) with me. I got my menses and was not clean till the night of `Arafa I said, \"O Allah's Apostle! It is the night of the day of `Arafat and I intended to perform the Hajj Tamattu` with `Umra. Allah's Messenger (ﷺ) told me to undo my hair and comb it and to postpone the `Umra. I did the same and completed the Hajj. On the night of Al-Hasba (i.e. place outside Mecca where the pilgrims go after finishing all the ceremonies of Hajj at Mina) he (the Prophet) ordered `Abdur Rahman (`Aisha's brother) to take me to at-Tan`im to assume the lhram for `Umra in lieu of that of Hajj-at-Tamattu` which I had intended to perform.",
        "malay_translation": "Dalam haji terakhir Rasulullah SAW, saya berihram untuk haji bersama Rasulullah. Saya termasuk di antara mereka yang berniat haji Tamattu' (menjalankan haji dan umrah) dan tidak membawa hadya (haiwan korban). Saya mengalami haid dan tidak suci hingga malam Arafah. Saya berkata, \"Wahai Rasulullah! Malam ini adalah malam Arafah, dan saya berniat untuk melakukan haji Tamattu' bersama umrah.\" Rasulullah SAW menyuruh saya untuk melepaskan ikatan rambut saya, menyisirnya, dan menangguhkan umrah. Saya melakukannya, dan menyelesaikan haji. Pada malam Al-Hasba (iaitu tempat di luar Mekah yang didatangi jemaah haji selepas menunaikan semua upacara haji di Mina), baginda (Nabi) memerintahkan `Abdul Rahman (`adik perempuan `Aishah) untuk membawa saya ke At-Tan'im untuk berihram untuk umrah sebagai pengganti ihram haji Tamattu' yang saya niatkan.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِبْرَاهِيمُ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ، قَالَتْ أَهْلَلْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ، فَكُنْتُ مِمَّنْ تَمَتَّعَ، وَلَمْ يَسُقِ الْهَدْىَ، فَزَعَمَتْ أَنَّهَا حَاضَتْ، وَلَمْ تَطْهُرْ حَتَّى دَخَلَتْ لَيْلَةُ عَرَفَةَ فَقَالَتْ يَا رَسُولَ اللَّهِ، هَذِهِ لَيْلَةُ عَرَفَةَ، وَإِنَّمَا كُنْتُ تَمَتَّعْتُ بِعُمْرَةٍ‏.‏ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ انْقُضِي رَأْسَكِ، وَامْتَشِطِي، وَأَمْسِكِي عَنْ عُمْرَتِكِ ‏\"‏‏.‏ فَفَعَلْتُ، فَلَمَّا قَضَيْتُ الْحَجَّ أَمَرَ عَبْدَ الرَّحْمَنِ لَيْلَةَ الْحَصْبَةِ فَأَعْمَرَنِي مِنَ التَّنْعِيمِ مَكَانَ عُمْرَتِي الَّتِي نَسَكْتُ‏.‏"
      },
      {
        "id": 314,
        "hadith_number": "317",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pelaksanaan Umrah dan Haji Menurut Rasulullah SAW",
        "perawi_melayu": "Dikisahkan oleh `Aisha",
        "english_text": "On the 1st of Dhul-Hijja we set out with the intention of performing Hajj. Allah's Messenger (ﷺ) said, \"Any one who likes to assume the Ihram for `Umra he can do so. Had I not brought the Hadi with me, I would have assumed the Ihram for `Umra. \"Some of us assumed the Ihram for `Umra while the others assumed the Ihram for Hajj. I was one of those who assumed the Ihram for `Umra. I got menses and kept on menstruating until the day of `Arafat and complained of that to the Prophet. He told me to postpone my `Umra, undo and comb my hair, and to assume the Ihram of Hajj and I did so. On the night of Hasba, he sent my brother `Abdur-Rahman bin Abi Bakr with me to at-Tan`im, where I assumed the Ihram for `Umra in lieu of the previous one. Hisham said, \"For that (`Umra) no Hadi, fasting or alms were required.",
        "malay_translation": "Pada hari pertama Zulhijjah, kami berangkat dengan niat menunaikan haji. Rasulullah SAW bersabda, \"Barangsiapa yang ingin mengenakan ihram untuk umrah, dia boleh melakukannya. Sekiranya aku tidak membawa hadyah, aku akan mengenakan ihram untuk umrah.\" Sebahagian daripada kami mengenakan ihram untuk umrah, manakala yang lain mengenakan ihram untuk haji. Aku antara mereka yang mengenakan ihram untuk umrah. Aku mengalami haid dan terus haid sehingga hari Arafah, lalu aku mengadu hal itu kepada Rasulullah. Baginda menyuruhku menangguhkan umrahku, mengurai dan menyisir rambutku, dan mengenakan ihram haji, dan aku melakukannya. Pada malam Hasba, Baginda mengutus saudaraku `Abdul Rahman bin Abi Bakr bersamaku ke At-Tan'im, di mana aku mengenakan ihram untuk umrah sebagai pengganti umrah yang sebelumnya. Hisyam berkata, \"Untuk umrah itu (yang telah digantikan), tidak diwajibkan hadyah, puasa atau sedekah.",
        "arabic_text": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ خَرَجْنَا مُوَافِينَ لِهِلاَلِ ذِي الْحِجَّةِ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَحَبَّ أَنْ يُهِلَّ بِعُمْرَةٍ فَلْيُهْلِلْ، فَإِنِّي لَوْلاَ أَنِّي أَهْدَيْتُ لأَهْلَلْتُ بِعُمْرَةٍ ‏\"‏‏.‏ فَأَهَلَّ بَعْضُهُمْ بِعُمْرَةٍ، وَأَهَلَّ بَعْضُهُمْ بِحَجٍّ، وَكُنْتُ أَنَا مِمَّنْ أَهَلَّ بِعُمْرَةٍ، فَأَدْرَكَنِي يَوْمُ عَرَفَةَ وَأَنَا حَائِضٌ، فَشَكَوْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ دَعِي عُمْرَتَكِ، وَانْقُضِي رَأْسَكِ وَامْتَشِطِي، وَأَهِلِّي بِحَجٍّ ‏\"‏‏.‏ فَفَعَلْتُ حَتَّى إِذَا كَانَ لَيْلَةُ الْحَصْبَةِ أَرْسَلَ مَعِي أَخِي عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ، فَخَرَجْتُ إِلَى التَّنْعِيمِ، فَأَهْلَلْتُ بِعُمْرَةٍ مَكَانَ عُمْرَتِي‏.‏ قَالَ هِشَامٌ وَلَمْ يَكُنْ فِي شَىْءٍ مِنْ ذَلِكَ هَدْىٌ وَلاَ صَوْمٌ وَلاَ صَدَقَةٌ‏.‏"
      },
      {
        "id": 315,
        "hadith_number": "318",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Penentuan Nasib Janin dalam Kandungan",
        "perawi_melayu": "Dikisahkan oleh Anas bin Malik:",
        "english_text": "The Prophet (ﷺ) said, \"At every womb Allah appoints an angel who says, 'O Lord! A drop of semen, O Lord! A clot. O Lord! A little lump of flesh.\" Then if Allah wishes (to complete) its creation, the angel asks, (O Lord!) Will it be a male or female, a wretched or a blessed, and how much will his provision be? And what will his age be?' So all that is written while the child is still in the mother's womb.\"",
        "malay_translation": "Rasulullah SAW bersabda, \"Pada setiap rahim, Allah melantik seorang malaikat yang berkata, 'Ya Tuhan! Setitis air mani, Ya Tuhan! Gumpalan darah, Ya Tuhan! Gumpalan daging kecil.' Kemudian, jika Allah menghendaki untuk menyempurnakan penciptaannya, malaikat itu bertanya, (Ya Tuhan!) Adakah ia lelaki atau perempuan, sengsara atau berbahagia, dan berapa banyak rezekinya? Dan berapa usianya?' Maka semua itu telah ditentukan ketika anak itu masih dalam kandungan ibunya.\"",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ اللَّهَ ـ عَزَّ وَجَلَّ ـ وَكَّلَ بِالرَّحِمِ مَلَكًا يَقُولُ يَا رَبِّ نُطْفَةٌ، يَا رَبِّ عَلَقَةٌ، يَا رَبِّ مُضْغَةٌ‏.‏ فَإِذَا أَرَادَ أَنْ يَقْضِيَ خَلْقَهُ قَالَ أَذَكَرٌ أَمْ أُنْثَى شَقِيٌّ أَمْ سَعِيدٌ فَمَا الرِّزْقُ وَالأَجَلُ فَيُكْتَبُ فِي بَطْنِ أُمِّهِ ‏\"‏‏.‏"
      },
      {
        "id": 316,
        "hadith_number": "319",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perintah Rasulullah SAW Mengenai Ihram Umrah dan Haji",
        "perawi_melayu": "Diriwayatkan oleh 'Aishah رضي الله عنها",
        "english_text": "She said, \"We set out with the Prophet (ﷺ) in his last Hajj. Some of us intended to perform `Umra while others Hajj. When we reached Mecca, Allah's Messenger (ﷺ) said, 'Those who had assumed the lhram for `Umra and had not brought the Hadi should finish his lhram and whoever had assumed the Ihram for `Umra and brought the Hadi should not finish the Ihram till he has slaughtered his Hadi and whoever had assumed the lhram for Hajj should complete his Hajj.\" `Aisha further said, \"I got my periods (menses) and kept on menstruating till the day of `Arafat, and I had assumed the Ihram for `Umra only (Tamattu`). The Prophet (ﷺ) ordered me to undo and comb my head hair and assume the lhram for Hajj only and leave the `Umra. I did the same till I completed the Hajj. Then the Prophet (ﷺ) sent `Abdur Rahman bin Abi Bakr with me and ordered me to perform `Umra from at-Tan`im in lieu of the missed `Umra.\"",
        "malay_translation": "Beliau berkata, \"Kami berangkat bersama Rasulullah SAW dalam haji terakhir beliau. Sebahagian kami berniat untuk melaksanakan umrah, sementara yang lain haji. Ketika kami sampai di Mekah, Rasulullah SAW bersabda, 'Barangsiapa yang telah berihram untuk umrah dan tidak membawa hady, hendaklah dia menyelesaikan ihramnya. Dan barangsiapa yang telah berihram untuk umrah dan membawa hady, janganlah dia menyelesaikan ihramnya sehingga dia menyembelih hadynya. Dan barangsiapa yang telah berihram untuk haji, hendaklah dia menyelesaikan hajinya.' 'Aishah selanjutnya berkata, \"Saya mengalami haid dan terus mengalami haid sehingga hari Arafah, dan saya telah berihram untuk umrah sahaja (Tamattu). Rasulullah SAW memerintahkan saya untuk melepaskan dan menyisir rambut kepala saya serta berihram untuk haji sahaja dan meninggalkan umrah. Saya melakukannya sehingga saya menyelesaikan haji. Kemudian Rasulullah SAW menghantar 'Abd al-Rahman bin Abi Bakar bersama saya dan memerintahkannya untuk melaksanakan umrah dari at-Tan'im sebagai ganti umrah yang ditinggalkan.\"",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ، فَمِنَّا مَنْ أَهَلَّ بِعُمْرَةٍ، وَمِنَّا مَنْ أَهَلَّ بِحَجٍّ، فَقَدِمْنَا مَكَّةَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ أَحْرَمَ بِعُمْرَةٍ وَلَمْ يُهْدِ فَلْيُحْلِلْ، وَمَنْ أَحْرَمَ بِعُمْرَةٍ وَأَهْدَى فَلاَ يَحِلُّ حَتَّى يَحِلَّ بِنَحْرِ هَدْيِهِ، وَمَنْ أَهَلَّ بِحَجٍّ فَلْيُتِمَّ حَجَّهُ ‏\"‏‏.‏ قَالَتْ فَحِضْتُ فَلَمْ أَزَلْ حَائِضًا حَتَّى كَانَ يَوْمُ عَرَفَةَ، وَلَمْ أُهْلِلْ إِلاَّ بِعُمْرَةٍ، فَأَمَرَنِي النَّبِيُّ صلى الله عليه وسلم أَنْ أَنْقُضَ رَأْسِي وَأَمْتَشِطَ، وَأُهِلَّ بِحَجٍّ، وَأَتْرُكَ الْعُمْرَةَ، فَفَعَلْتُ ذَلِكَ حَتَّى قَضَيْتُ حَجِّي، فَبَعَثَ مَعِي عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ، وَأَمَرَنِي أَنْ أَعْتَمِرَ مَكَانَ عُمْرَتِي مِنَ التَّنْعِيمِ‏.‏"
      },
      {
        "id": 317,
        "hadith_number": "320",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukum Pendarahan Di Antara Haid",
        "perawi_melayu": "Dikisahkan oleh 'Aishah",
        "english_text": "Fatima bint Abi Hubaish used to have bleeding in between the periods, so she asked the Prophet (ﷺ) about it. He replied, \"The bleeding is from a blood vessel and not the menses. So give up the prayers when the (real) menses begins and when it has finished, take a bath and start praying.\"",
        "malay_translation": "Fatimah binti Abi Hubaish pernah mengalami pendarahan di antara tempoh haid, lalu dia bertanya kepada Rasulullah saw tentangnya. Baginda menjawab, \"Pendarahan itu datang daripada saluran darah, bukan haid. Oleh itu, tinggalkan solat apabila haid sebenar memulakan tempohnya, dan apabila ia tamat, mandilah dan mulakan solat semula.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ فَاطِمَةَ بِنْتَ أَبِي حُبَيْشٍ، كَانَتْ تُسْتَحَاضُ فَسَأَلَتِ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ ذَلِكِ عِرْقٌ، وَلَيْسَتْ بِالْحَيْضَةِ، فَإِذَا أَقْبَلَتِ الْحَيْضَةُ فَدَعِي الصَّلاَةَ، وَإِذَا أَدْبَرَتْ فَاغْتَسِلِي وَصَلِّي ‏\"‏‏.‏"
      },
      {
        "id": 318,
        "hadith_number": "321",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Wanita semasa Haid: Tidak Wajib Mengulangi",
        "perawi_melayu": "Dikisahkan oleh Mu`adha:",
        "english_text": "A woman asked `Aisha, \"Should I offer the prayers that which I did not offer because of menses\" `Aisha said, \"Are you from the Huraura' (a town in Iraq?) We were with the Prophet (ﷺ) and used to get our periods but he never ordered us to offer them (the Prayers missed during menses).\" `Aisha perhaps said, \"We did not offer them.\"",
        "malay_translation": "Seorang wanita bertanya kepada `Aisha, \"Adakah saya perlu menunaikan solat yang tertinggal akibat haid?\" `Aisha menjawab, \"Adakah kamu dari Huraura? Kami pernah bersama Nabi (ﷺ) dan mengalami haid, namun baginda tidak pernah memerintahkan kami untuk menunaikan solat-solat yang tertinggal ketika haid.\" `Aisha mungkin berkata, \"Kami tidak pernah melakukannya.\" ",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا هَمَّامٌ، قَالَ حَدَّثَنَا قَتَادَةُ، قَالَ حَدَّثَتْنِي مُعَاذَةُ، أَنَّ امْرَأَةً، قَالَتْ لِعَائِشَةَ أَتَجْزِي إِحْدَانَا صَلاَتَهَا إِذَا طَهُرَتْ فَقَالَتْ أَحَرُورِيَّةٌ أَنْتِ كُنَّا نَحِيضُ مَعَ النَّبِيِّ صلى الله عليه وسلم فَلاَ يَأْمُرُنَا بِهِ‏.‏ أَوْ قَالَتْ فَلاَ نَفْعَلُهُ‏.‏"
      },
      {
        "id": 319,
        "hadith_number": "322",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kebersihan dan Kehidupan Nabi SAW bersama isterinya",
        "perawi_melayu": "Dikisahkan oleh Zainab binti Abi Salama",
        "english_text": "Um-Salama berkata, \"Aku mengalami haid ketika aku sedang berbaring dengan Rasulullah SAW di bawah sehelai selimut bulu. Maka aku diam-diam, mengambil pakaian haid dan memakainya. Rasulullah SAW bertanya, 'Apakah engkau mengalami haid?' Aku menjawab, 'Ya.' Kemudian beliau memanggilku dan membawaku bersama beliau di bawah selimut bulu itu.\" Um Salama selanjutnya berkata, \"Nabi SAW sering menciumku ketika sedang berpuasa. Nabi SAW dan aku sering mandi junub dari satu periuk yang sama.\"",
        "malay_translation": "Um Salama meriwayatkan, \"Aku mengalami haid ketika aku berbaring bersama Rasulullah SAW di bawah sehelai kain selimut bulu.  Maka aku diam-diam, mengambil pakaian haid dan memakainya.  Rasulullah SAW bertanya, 'Engkau mengalami haid?' Jawabku, 'Ya.' Kemudian beliau memanggilku dan membawaku bersama beliau di bawah selimut bulu itu.\" Um Salama menambahkan, \"Rasulullah SAW sering menciumku ketika sedang berpuasa.  Beliau dan aku sering mandi junub menggunakan periuk yang sama.\"",
        "arabic_text": "حَدَّثَنَا سَعْدُ بْنُ حَفْصٍ، قَالَ حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ زَيْنَبَ ابْنَةِ أَبِي سَلَمَةَ، حَدَّثَتْهُ أَنَّ أُمَّ سَلَمَةَ قَالَتْ حِضْتُ وَأَنَا مَعَ النَّبِيِّ، صلى الله عليه وسلم فِي الْخَمِيلَةِ، فَانْسَلَلْتُ فَخَرَجْتُ مِنْهَا، فَأَخَذْتُ ثِيَابَ حِيضَتِي فَلَبِسْتُهَا، فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَنُفِسْتِ ‏\"‏‏.‏ قُلْتُ نَعَمْ، فَدَعَانِي فَأَدْخَلَنِي مَعَهُ فِي الْخَمِيلَةِ‏.‏ قَالَتْ وَحَدَّثَتْنِي أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُقَبِّلُهَا وَهُوَ صَائِمٌ، وَكُنْتُ أَغْتَسِلُ أَنَا وَالنَّبِيُّ صلى الله عليه وسلم مِنْ إِنَاءٍ وَاحِدٍ مِنَ الْجَنَابَةِ‏.‏"
      },
      {
        "id": 320,
        "hadith_number": "323",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menstruasi dan Kehidupan Bersama Rasulullah SAW",
        "perawi_melayu": "Dikisahkan oleh Um Salama",
        "english_text": "While I was lying with the Prophet (ﷺ) under a woolen sheet, I got my menses. I slipped away and put on the clothes for menses. The Prophet (ﷺ) said, \"Have you got your menses?\" I replied, \"Yes.\" He called me and I slept with him under the woolen sheet.",
        "malay_translation": "Ketika aku sedang berbaring bersama Rasulullah SAW di bawah selimut bulu biri-biri, tiba-tiba datang haidku. Aku diam-diam pergi dan memakai pakaian haid. Rasulullah SAW bertanya, \"Adakah engkau mengalami haid?\" Aku menjawab, \"Ya.\" Baginda memanggilku, dan aku kembali tidur bersamanya di bawah selimut bulu biri-biri.",
        "arabic_text": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ زَيْنَبَ ابْنَةِ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ بَيْنَا أَنَا مَعَ النَّبِيِّ، صلى الله عليه وسلم مُضْطَجِعَةً فِي خَمِيلَةٍ حِضْتُ، فَانْسَلَلْتُ فَأَخَذْتُ ثِيَابَ حِيضَتِي فَقَالَ ‏ \"‏ أَنُفِسْتِ ‏\"‏‏.‏ فَقُلْتُ نَعَمْ‏.‏ فَدَعَانِي فَاضْطَجَعْتُ مَعَهُ فِي الْخَمِيلَةِ‏.‏"
      },
      {
        "id": 321,
        "hadith_number": "324",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keizinan Wanita yang Tidak Berhijab dan Wanita Haid Menghadiri Majlis Agama",
        "perawi_melayu": "Hafsah meriwayatkan:",
        "english_text": "She said, 'We used to forbid our young women to go out for the two `Id prayers. A woman came and stayed at the palace of Bani Khalaf and she narrated about her sister whose husband took part in twelve holy battles along with the Prophet (ﷺ) and her sister was with her husband in six (out of these twelve). She (the woman's sister) said, \"We used to treat the wounded, look after the patients and once I asked the Prophet, 'Is there any harm for any of us to stay at home if she doesn't have a veil?' He said, 'She should cover herself with the veil of her companion and should participate in the good deeds and in the religious gathering of the Muslims.' When Um `Atiya came I asked her whether she had heard it from the Prophet. She replied, \"Yes. May my father be sacrificed for him (the Prophet)! (Whenever she mentioned the Prophet (ﷺ) she used to say, 'May my father be sacrificed for him) I have heard the Prophet (ﷺ) saying, 'The unmarried young virgins and the mature girl who stay often screened or the young unmarried virgins who often stay screened and the menstruating women should come out and participate in the good deeds as well as the religious gathering of the faithful believers but the menstruating women should keep away from the Musalla (praying place).' \" Hafsa asked Um `Atiya surprisingly, \"Do you say the menstruating women?\" She replied, \"Doesn't a menstruating woman attend `Arafat (Hajj) and such and such (other deeds)?\"",
        "malay_translation": "Dia berkata, 'Kami dulu melarang wanita muda kami keluar untuk solat dua hari raya. Seorang wanita datang dan tinggal di istana Bani Khalaf, dan dia menceritakan tentang adik perempuannya yang suaminya turut serta dalam dua belas peperangan suci bersama Nabi SAW dan adik perempuannya berada bersamanya dalam enam (dari dua belas peperangan itu). Adik perempuannya berkata, \"Kami biasa merawat yang cedera, menjaga pesakit, dan sekali aku bertanya kepada Nabi SAW, 'Adakah salah bagi kita tinggal di rumah jika dia tidak bertudung?' Baginda bersabda, 'Hendaklah dia menutup dirinya dengan tudung kawannya dan hendaklah dia menyertai amalan kebaikan dan majlis agama umat Islam.' Ketika Um `Atiya datang, aku bertanya kepadanya sama ada dia mendengarnya dari Nabi SAW. Dia menjawab, \"Ya. Semoga bapaku dikorbankan untuknya (Nabi SAW)! (Setiap kali dia menyebut Nabi SAW, dia akan berkata, 'Semoga bapaku dikorbankan untuknya). Aku telah mendengar Nabi SAW bersabda, 'Gadis perawan yang belum berkahwin dan gadis dewasa yang sentiasa bertudung atau gadis perawan yang belum berkahwin yang sentiasa bertudung dan wanita haid hendaklah keluar dan menyertai amalan kebaikan serta majlis agama orang beriman, tetapi wanita haid hendaklah menjauhi Musalla (tempat solat).\" Hafsah bertanya kepada Um `Atiya dengan hairan, \"Engkau berkata tentang wanita haid?\" Dia menjawab, \"Bukankah wanita haid boleh menghadiri `Arafah (haji) dan sebagainya (amalan-amalan lain)?\" ",
        "arabic_text": "حَدَّثَنَا مُحَمَّدٌ ـ هُوَ ابْنُ سَلاَمٍ ـ قَالَ أَخْبَرَنَا عَبْدُ الْوَهَّابِ، عَنْ أَيُّوبَ، عَنْ حَفْصَةَ، قَالَتْ كُنَّا نَمْنَعُ عَوَاتِقَنَا أَنْ يَخْرُجْنَ فِي الْعِيدَيْنِ، فَقَدِمَتِ امْرَأَةٌ فَنَزَلَتْ قَصْرَ بَنِي خَلَفٍ، فَحَدَّثَتْ عَنْ أُخْتِهَا، وَكَانَ زَوْجُ أُخْتِهَا غَزَا مَعَ النَّبِيِّ صلى الله عليه وسلم ثِنْتَىْ عَشَرَةَ، وَكَانَتْ أُخْتِي مَعَهُ فِي سِتٍّ‏.‏ قَالَتْ كُنَّا نُدَاوِي الْكَلْمَى، وَنَقُومُ عَلَى الْمَرْضَى، فَسَأَلَتْ أُخْتِي النَّبِيَّ صلى الله عليه وسلم أَعَلَى إِحْدَانَا بَأْسٌ إِذَا لَمْ يَكُنْ لَهَا جِلْبَابٌ أَنْ لاَ تَخْرُجَ قَالَ ‏\"‏ لِتُلْبِسْهَا صَاحِبَتُهَا مِنْ جِلْبَابِهَا، وَلْتَشْهَدِ الْخَيْرَ وَدَعْوَةَ الْمُسْلِمِينَ ‏\"‏‏.‏ فَلَمَّا قَدِمَتْ أُمُّ عَطِيَّةَ سَأَلْتُهَا أَسَمِعْتِ النَّبِيَّ صلى الله عليه وسلم قَالَتْ بِأَبِي نَعَمْ ـ وَكَانَتْ لاَ تَذْكُرُهُ إِلاَّ قَالَتْ بِأَبِي ـ سَمِعْتُهُ يَقُولُ ‏\"‏ يَخْرُجُ الْعَوَاتِقُ وَذَوَاتُ الْخُدُورِ، أَوِ الْعَوَاتِقُ ذَوَاتُ الْخُدُورِ وَالْحُيَّضُ، وَلْيَشْهَدْنَ الْخَيْرَ وَدَعْوَةَ الْمُؤْمِنِينَ، وَيَعْتَزِلُ الْحُيَّضُ الْمُصَلَّى ‏\"‏‏.‏ قَالَتْ حَفْصَةُ فَقُلْتُ الْحُيَّضُ فَقَالَتْ أَلَيْسَ تَشْهَدُ عَرَفَةَ وَكَذَا وَكَذَا"
      },
      {
        "id": 322,
        "hadith_number": "325",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Panduan Solat Ketika Mengalami Pendarahan Di Antara Haid",
        "perawi_melayu": "Dikisahkan oleh 'Aisha",
        "english_text": "Fatima bint Abi Hubaish bertanya kepada Nabi, \"Saya mengalami pendarahan yang berterusan (di antara tempoh haid) dan tidak bersih. Adakah saya perlu berhenti solat?\" Baginda menjawab, \"Tidak, ini datang dari saluran darah. Berhenti solat hanya pada hari-hari anda biasanya mengalami haid, kemudian mandi dan solat.\"",
        "malay_translation": "Fatimah binti Abi Hubaish bertanya kepada Nabi, \"Saya mengalami pendarahan yang berterusan (di antara tempoh haid) dan tidak bersih. Adakah saya perlu berhenti solat?\" Baginda menjawab, \"Tidak, ini datang dari saluran darah. Berhenti solat hanya pada hari-hari anda biasanya mengalami haid, kemudian mandi dan solat.\" ",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي رَجَاءٍ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ سَمِعْتُ هِشَامَ بْنَ عُرْوَةَ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ،‏.‏ أَنَّ فَاطِمَةَ بِنْتَ أَبِي حُبَيْشٍ، سَأَلَتِ النَّبِيَّ صلى الله عليه وسلم قَالَتْ إِنِّي أُسْتَحَاضُ فَلاَ أَطْهُرُ، أَفَأَدَعُ الصَّلاَةَ فَقَالَ ‏ \"‏ لاَ، إِنَّ ذَلِكِ عِرْقٌ، وَلَكِنْ دَعِي الصَّلاَةَ قَدْرَ الأَيَّامِ الَّتِي كُنْتِ تَحِيضِينَ فِيهَا، ثُمَّ اغْتَسِلِي وَصَلِّي ‏\"‏‏.‏"
      },
      {
        "id": 323,
        "hadith_number": "326",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Penghakisan Pelepasan Kuning Tidak Dianggap Penting",
        "perawi_melayu": "Diceritakan oleh Um `Atiya:",
        "english_text": "We never considered yellowish discharge as a thing of importance (as menses).",
        "malay_translation": "Kami tidak pernah menganggap lendir berwarna kekuningan sebagai sesuatu yang penting (seperti haid).",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ كُنَّا لاَ نَعُدُّ الْكُدْرَةَ وَالصُّفْرَةَ شَيْئًا‏.‏"
      },
      {
        "id": 324,
        "hadith_number": "327",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perihal Pendarahan Tidak Biasa Umm Habibah dan Hukum Mandi",
        "perawi_melayu": "Dikisahkan oleh `Aisha (isteri Nabi):",
        "english_text": "Um Habiba mengalami pendarahan di antara haid selama tujuh tahun. Beliau bertanya kepada Rasulullah SAW tentangnya. Baginda memerintahkannya untuk mandi (selepas tempoh haid sebenar) dan menyatakan bahawa ia datang dari saluran darah. Oleh itu, beliau mandi untuk setiap solat.",
        "malay_translation": "Umm Habibah mengalami pendarahan di antara haid selama tujuh tahun. Beliau bertanya kepada Rasulullah SAW mengenainya. Baginda memerintahkannya untuk mandi (selepas tempoh haid sebenar) dan menyatakan bahawa ia datang dari saluran darah. Oleh itu, beliau mandi untuk setiap solat.",
        "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنَا مَعْنٌ، قَالَ حَدَّثَنِي ابْنُ أَبِي ذِئْبٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، وَعَنْ عَمْرَةَ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ أُمَّ حَبِيبَةَ اسْتُحِيضَتْ سَبْعَ سِنِينَ، فَسَأَلَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ، فَأَمَرَهَا أَنْ تَغْتَسِلَ فَقَالَ ‏ \"‏ هَذَا عِرْقٌ ‏\"‏‏.‏ فَكَانَتْ تَغْتَسِلُ لِكُلِّ صَلاَةٍ‏.‏"
      },
      {
        "id": 325,
        "hadith_number": "328",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Petunjuk Nabi Mengenai Haid dan Tawaf",
        "perawi_melayu": "Diriwayatkan oleh 'Aisyah (isteri Nabi):",
        "english_text": "I told Allah's Messenger (ﷺ) that Safiya bint Huyai had got her menses. He said, \"She will probably delay us. Did she perform Tawaf (Al-Ifada) with you?\" We replied, \"Yes.\" On that the Prophet (ﷺ) told her to depart.",
        "malay_translation": "Saya memberitahu Rasulullah SAW bahawa Safiyyah binti Huyai telah mengalami haid. Baginda bersabda, \"Dia mungkin akan melambatkan kita. Adakah dia melakukan Tawaf (Al-Ifada) bersama kamu?\" Kami menjawab, \"Ya.\"  Lalu Rasulullah SAW menyuruhnya berangkat.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ أَبِيهِ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم يَا رَسُولَ اللَّهِ، إِنَّ صَفِيَّةَ بِنْتَ حُيَىٍّ قَدْ حَاضَتْ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَعَلَّهَا تَحْبِسُنَا، أَلَمْ تَكُنْ طَافَتْ مَعَكُنَّ ‏\"‏‏.‏ فَقَالُوا بَلَى‏.‏ قَالَ ‏\"‏ فَاخْرُجِي ‏\"‏‏.‏"
      },
      {
        "id": 326,
        "hadith_number": "329, 330",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keizinan Wanita Meninggalkan Tawaf Jika Mengalami Haid",
        "perawi_melayu": "Riwayat Ibn `Abbas",
        "english_text": "A woman is allowed to leave (go back home) if she gets menses (after Tawaf-Al-Ifada).\r\nIbn `Umar formerly used to say that she should not leave but later on I heard him saying, \"She may leave, since Allah's Messenger (ﷺ) gave them the permission to leave (after Tawaf-Al-Ifada).\"",
        "malay_translation": "Seorang wanita dibenarkan pulang jika mengalami haid (selepas Tawaf-Al-Ifada).\r\nIbn `Umar dahulu mengatakan dia tidak boleh pulang, tetapi kemudian aku mendengarnya berkata, \"Dia dibenarkan pulang, kerana Rasulullah saw telah memberi izin untuk pulang (selepas Tawaf-Al-Ifada).\"",
        "arabic_text": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ ، قَالَ : حَدَّثَنَا وُهَيْبٌ ، عَنْ عَبْدِ اللَّهِ بْنِ طَاوُسٍ ، عَنْ أَبِيهِ ، عَنِ ابْنِ عَبَّاسٍ ، قَالَ : رُخِّصَ لِلْحَائِضِ أَنْ تَنْفِرَ إِذَا حَاضَتْ.\r\nوَكَانَ ابْنُ عُمَرَ يَقُولُ فِي أَوَّلِ أَمْرِهِ إِنَّهَا لاَ تَنْفِرُ‏.‏ ثُمَّ سَمِعْتُهُ يَقُولُ تَنْفِرُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَخَّصَ لَهُنَّ‏.‏"
      },
      {
        "id": 327,
        "hadith_number": "331",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Arahan Mengenai Solat Semasa Haid",
        "perawi_melayu": "Dikisahkan oleh `Aishah",
        "english_text": "The Prophet (ﷺ) said to me, \"Give up the prayer when your menses begin and when it has finished, wash the blood off your body (take a bath) and start praying.\"",
        "malay_translation": "Rasulullah SAW bersabda kepadaku, \"Hentikan solat apabila haid datang dan apabila ia selesai, bersihkanlah darah daripada tubuh anda (mandi wajib) dan mulakan solat kembali.\"",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، عَنْ زُهَيْرٍ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِذَا أَقْبَلَتِ الْحَيْضَةُ فَدَعِي الصَّلاَةَ، وَإِذَا أَدْبَرَتْ فَاغْسِلِي عَنْكِ الدَّمَ وَصَلِّي ‏\"‏‏.‏"
      },
      {
        "id": 328,
        "hadith_number": "332",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi SAW Mengimamkan Solat Jenazah Wanita Meninggal Dunia Semasa Bersalin",
        "perawi_melayu": "Dikisahkan oleh Samura bin Jundub:",
        "english_text": "The Prophet (ﷺ) offered the funeral prayer for the dead body of a woman who died during delivery (i.e. childbirth) and he stood by the middle of her body.",
        "malay_translation": "Nabi SAW menunaikan solat jenazah bagi mayat seorang wanita yang meninggal dunia ketika bersalin, dan baginda berdiri di tengah-tengah badannya.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي سُرَيْجٍ، قَالَ أَخْبَرَنَا شَبَابَةُ، قَالَ أَخْبَرَنَا شُعْبَةُ، عَنْ حُسَيْنٍ الْمُعَلِّمِ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ سَمُرَةَ بْنِ جُنْدُبٍ، أَنَّ امْرَأَةً، مَاتَتْ فِي بَطْنٍ، فَصَلَّى عَلَيْهَا النَّبِيُّ صلى الله عليه وسلم فَقَامَ وَسَطَهَا‏.‏"
      },
      {
        "id": 329,
        "hadith_number": "333",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pengalaman Rasulullah SAW semasa Haid dan Solat",
        "perawi_melayu": "Dikisahkan oleh Maimunah (isteri Nabi SAW):",
        "english_text": "During my menses, I never prayed, but used to sit on the mat beside the mosque of Allah's Messenger (ﷺ). He used to offer the prayer on his sheet and in prostration some of his clothes used to touch me.",
        "malay_translation": "Semasa haid, saya tidak pernah menunaikan solat, tetapi duduk di atas tikar di sebelah masjid Rasulullah SAW. Baginda solat di atas kainnya dan ketika sujud, sesetengah pakaiannya tersentuh saya.",
        "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ مُدْرِكٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ، قَالَ أَخْبَرَنَا أَبُو عَوَانَةَ ـ اسْمُهُ الْوَضَّاحُ ـ مِنْ كِتَابِهِ قَالَ أَخْبَرَنَا سُلَيْمَانُ الشَّيْبَانِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ، قَالَ سَمِعْتُ خَالَتِي، مَيْمُونَةَ ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا كَانَتْ تَكُونُ حَائِضًا لاَ تُصَلِّي، وَهْىَ مُفْتَرِشَةٌ بِحِذَاءِ مَسْجِدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهْوَ يُصَلِّي عَلَى خُمْرَتِهِ، إِذَا سَجَدَ أَصَابَنِي بَعْضُ ثَوْبِهِ‏.‏"
      }
    ]
  }
}