{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 30,
    "data": [
      {
        "id": 1700,
        "hadith_number": "1773",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ganjaran Umrah dan Haji Mabrur",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) said, \"(The performance of) `Umra is an expiation for the sins committed (between it and the previous one). And the reward of Hajj Mabrur (the one accepted by Allah) is nothing except Paradise.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"(Pelaksanaan) Umrah adalah penghapus dosa-dosa yang dilakukan (di antara umrah ini dan umrah sebelumnya). Dan ganjaran bagi Haji Mabrur (haji yang diterima oleh Allah) tidak lain hanyalah Syurga.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الْعُمْرَةُ إِلَى الْعُمْرَةِ كَفَّارَةٌ لِمَا بَيْنَهُمَا، وَالْحَجُّ الْمَبْرُورُ لَيْسَ لَهُ جَزَاءٌ إِلاَّ الْجَنَّةُ ‏\"‏‏.‏"
      },
      {
        "id": 1701,
        "hadith_number": "1774",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kebolehan Melakukan Umrah Sebelum Haji",
        "perawi_melayu": "Diriwayatkan oleh Ibn Juraij:",
        "english_text": "`Ikrima bin Khalid asked Ibn `Umar رضی اللہ عنہما about performing `Umra before Hajj. Ibn `Umar replied, \"There is no harm in it.\" `Ikrima said, \"Ibn `Umar رضی اللہ عنہما also said, 'The Prophet (ﷺ) had performed `Umra رضی اللہ عنہما before performing Hajj.'\" Narrated `Ikrima bin Khalid: I asked Ibn `Umar the same (as above). It is reported from Hadrat `Ikrima bin Khalid with another authority: I askek Hadrat Ibn-e-Umer رضی اللہ عنہما in the same way.",
        "malay_translation": "`Ikrimah bin Khalid bertanya kepada Ibn Umar mengenai melakukan Umrah sebelum Haji. Ibn Umar menjawab, \"Tidak mengapa melakukannya.\" Ikrimah berkata, \"Ibn Umar juga berkata, 'Nabi (ﷺ) telah melakukan Umrah sebelum melakukan Haji.'\" Diriwayatkan daripada Ikrimah bin Khalid: Saya bertanya kepada Ibn Umar perkara yang sama (seperti di atas). Diriwayatkan daripada Hadrat Ikrimah bin Khalid dengan jalur periwayatan lain: Saya bertanya kepada Hadrat Ibn-e-Umer dengan cara yang sama.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ ، أَخْبَرَنَا عَبْدُ اللَّهِ ، أَخْبَرَنَا ابْنُ جُرَيْجٍ ، أَنَّ عِكْرِمَةَ بْنَ خَالِدٍ ، سَأَلَ ابْنَ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا عَنِ الْعُمْرَةِ قَبْلَ الْحَجِّ ، فَقَالَ : لَا بَأْسَ ، قَالَ عِكْرِمَةُ , قَالَ ابْنُ عُمَرَ اعْتَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْلَ أَنْ يَحُجَّ , وَقَالَ إِبْرَاهِيمُ بْنُ سَعْدٍ : عَنْ ابْنِ إِسْحَاقَ ، حَدَّثَنِي عِكْرِمَةُ بْنُ خَالِدٍ ، سَأَلْتُ ابْنَ عُمَرَ مِثْلَهُ ، حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ ، حَدَّثَنَا أَبُو عَاصِمٍ ، أَخْبَرَنَا ابْنُ جُرَيْجٍ ، قَالَ عِكْرِمَةُ بْنُ خَالِدٍ : سَأَلْتُ ابْنَ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا مِثْلَهُ."
      },
      {
        "id": 1702,
        "hadith_number": "1775, 1776",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Umrah Nabi: Bantahan Aisyah tentang Umrah Rajab",
        "perawi_melayu": "Diriwayatkan oleh Mujahid:",
        "english_text": "`Urwa bin Az-Zubair and I entered the Mosque (of the Prophet) and saw `Abdullah bin `Umar رضی اللہ عنۈا sitting near the dwelling place of Aisha رضی اللہ عنۈا and some people were offering the Duha prayer. We asked him about their prayer and he replied that it was a heresy. He (Urwa) then asked him how many times the Prophet (ﷺ) had performed `Umra. He replied, \"Four times; one of them was in the month of Rajab.\" We disliked to contradict him.\r\nThen we heard `Aisha رضی اللہ عنۈا , the Mother of faithful believers cleaning her teeth with Siwak in the dwelling place. 'Urwa said, \"O Mother! O Mother of the believers! Don't you hear what Abu `Abdur Rahman is saying?\" She said, \"What does he say?\" 'Urwa said, \"He says that Allah's Messenger (ﷺ) performed four `Umra and one of them was in the month of Rajab.\" `Aisha رضی اللہ عنۈا said, \"May Allah be merciful to Abu `Abdur Rahman! The Prophet (ﷺ) did not perform any `Umra except that he was with him, and he never performed any `Umra in Rajab.\"",
        "malay_translation": "`Urwa bin Az-Zubair dan saya masuk ke Masjid (Nabi) dan melihat Abdullah bin Umar رضي الله عنهما sedang duduk berdekatan tempat tinggal Aisyah رضي الله عنها, dan beberapa orang sedang menunaikan solat Duha. Kami bertanya kepadanya tentang solat mereka, dan beliau menjawab bahawa ia adalah bidaah. Kemudian Urwa bertanya kepadanya berapa kali Rasulullah (ﷺ) telah mengerjakan umrah. Beliau menjawab, \"Empat kali; salah satunya adalah dalam bulan Rajab.\" Kami tidak ingin membantah beliau.\r\nKemudian kami terdengar Aisyah رضي الله عنها, Ummul Mukminin sedang membersihkan gigi dengan Siwak di tempat tinggal. Urwa berkata, \"Wahai Ibu! Wahai Ummul Mukminin! Tidakkah ibu mendengar apa yang Abu Abdur Rahman katakan?\" Beliau bertanya, \"Apa yang beliau katakan?\" Urwa berkata, \"Beliau mengatakan bahawa Rasulullah (ﷺ) telah mengerjakan empat umrah dan salah satunya adalah dalam bulan Rajab.\" Aisyah رضي الله عنها berkata, \"Semoga Allah merahmati Abu Abdur Rahman! Rasulullah (ﷺ) tidak mengerjakan umrah kecuali beliau bersama dengannya, dan baginda tidak pernah mengerjakan umrah dalam bulan Rajab.\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، قَالَ دَخَلْتُ أَنَا وَعُرْوَةُ بْنُ الزُّبَيْرِ الْمَسْجِدَ،، فَإِذَا عَبْدُ اللَّهِ بْنُ عُمَرَ ـ رضى الله عنهما ـ جَالِسٌ إِلَى حُجْرَةِ عَائِشَةَ، وَإِذَا نَاسٌ يُصَلُّونَ فِي الْمَسْجِدِ صَلاَةَ الضُّحَى‏.‏ قَالَ فَسَأَلْنَاهُ عَنْ صَلاَتِهِمْ‏.‏ فَقَالَ بِدْعَةٌ‏.‏ ثُمَّ قَالَ لَهُ كَمِ اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ أَرْبَعً إِحْدَاهُنَّ فِي رَجَبٍ، فَكَرِهْنَا أَنْ نَرُدَّ عَلَيْهِ‏. قَالَ وَسَمِعْنَا اسْتِنَانَ، عَائِشَةَ أُمِّ الْمُؤْمِنِينَ فِي الْحُجْرَةِ، فَقَالَ عُرْوَةُ يَا أُمَّاهُ، يَا أُمَّ الْمُؤْمِنِينَ‏.‏ أَلاَ تَسْمَعِينَ مَا يَقُولُ أَبُو عَبْدِ الرَّحْمَنِ‏.‏ قَالَتْ مَا يَقُولُ قَالَ يَقُولُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اعْتَمَرَ أَرْبَعَ عُمَرَاتٍ إِحْدَاهُنَّ فِي رَجَبٍ‏.‏ قَالَتْ يَرْحَمُ اللَّهُ أَبَا عَبْدِ الرَّحْمَنِ، مَا اعْتَمَرَ عُمْرَةً إِلاَّ وَهُوَ شَاهِدُهُ، وَمَا اعْتَمَرَ فِي رَجَبٍ قَطُّ‏.‏"
      },
      {
        "id": 1703,
        "hadith_number": "1777",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi SAW Tidak Melakukan Umrah dalam Bulan Rejab",
        "perawi_melayu": "Diriwayatkan oleh Urwa bin Az-Zubair RA:",
        "english_text": "I asked `Aisha رضی اللہ عنہا(whether the Prophet (ﷺ) had performed `Umra in Rajab). She replied, \"Allah's Messenger (ﷺ) never performed any `Umra in Rajab.\"",
        "malay_translation": "Saya bertanya kepada Aisyah RA (adakah Nabi SAW pernah melakukan Umrah dalam bulan Rejab?). Beliau menjawab, \"Rasulullah SAW tidak pernah melakukan Umrah dalam bulan Rejab.\"",
        "arabic_text": "حَدَّثَنَا أَبُو عَاصِمٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، قَالَ سَأَلْتُ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي رَجَبٍ‏.‏"
      },
      {
        "id": 1704,
        "hadith_number": "1778",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Bilangan Umrah dan Haji Nabi SAW Menurut Anas RA",
        "perawi_melayu": "Diriwayatkan oleh Qatada:",
        "english_text": "I asked Anas رضی اللہ عنہ how many times the Prophet (ﷺ) had performed `Umra. He replied, \"Four times. 1. `Umra of Hudaibiya in Dhi-l-Qa'da when the pagans hindered him; 2. `Umra in the following year in Dhi-l- Qa'da after the peace treaty with them (the pagans); 3. `Umra from Al-Ja'rana where he distributed the war booty.\" I think he meant the booty (of the battle) of Hunain. I asked, \"How many times did he perform Hajj?\" He (Anas) replied, \"Once. \"",
        "malay_translation": "Saya bertanya kepada Anas RA berapa kali Nabi SAW telah mengerjakan Umrah. Beliau menjawab, \"Empat kali. 1. Umrah Hudaibiyah pada bulan Dzulkaedah ketika orang-orang musyrik menghalanginya; 2. Umrah pada tahun berikutnya pada bulan Dzulkaedah setelah perjanjian damai dengan mereka (orang-orang musyrik); 3. Umrah dari Ja'ranah di mana beliau membahagikan harta rampasan perang.\" Saya rasa beliau maksudkan harta rampasan (perang) Hunain. Saya bertanya, \"Berapa kali beliau mengerjakan Haji?\" Beliau (Anas) menjawab, \"Sekali.\"",
        "arabic_text": "حَدَّثَنَا حَسَّانُ بْنُ حَسَّانٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، سَأَلْتُ أَنَسًا ـ رضى الله عنه ـ كَمِ اعْتَمَرَ النَّبِيُّ صلى الله عليه وسلم قَالَ أَرْبَعٌ عُمْرَةُ الْحُدَيْبِيَةِ فِي ذِي الْقَعْدَةِ، حَيْثُ صَدَّهُ الْمُشْرِكُونَ، وَعُمْرَةٌ مِنَ الْعَامِ الْمُقْبِلِ فِي ذِي الْقَعْدَةِ، حَيْثُ صَالَحَهُمْ، وَعُمْرَةُ الْجِعْرَانَةِ إِذْ قَسَمَ غَنِيمَةَ أُرَاهُ حُنَيْنٍ‏.‏ قُلْتُ كَمْ حَجَّ قَالَ وَاحِدَةً‏.‏"
      },
      {
        "id": 1705,
        "hadith_number": "1779",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Umrah-Umrah Nabi Muhammad ﷺ",
        "perawi_melayu": "Diriwayatkan oleh Qatada:",
        "english_text": "I asked Anas رضی اللہ عنہ (about the Prophet's `Umra) and he replied, \"The Prophet (ﷺ) performed `Umra when the pagans made him return, and Umra of al-Hudaibiya (the next year), and another `Umra in Dhi-l-Qa'da, and another `Umra in combination with his Hajj.\"",
        "malay_translation": "Saya bertanya kepada Anas رضي الله عنه (tentang Umrah Nabi) dan beliau menjawab, \"Nabi ﷺ melakukan Umrah ketika orang-orang musyrik menghalang baginda untuk meneruskan, dan Umrah Hudaibiyah (tahun berikutnya), dan Umrah lain dalam bulan Zulkaedah, dan Umrah lain bersama dengan Haji baginda.\"",
        "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، هِشَامُ بْنُ عَبْدِ الْمَلِكِ حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، قَالَ سَأَلْتُ أَنَسًا ـ رضى الله عنه ـ فَقَالَ اعْتَمَرَ النَّبِيُّ صلى الله عليه وسلم حَيْثُ رَدُّوهُ، وَمِنَ الْقَابِلِ عُمْرَةَ الْحُدَيْبِيَةِ، وَعُمْرَةً فِي ذِي الْقَعْدَةِ وَعُمْرَةً مَعَ حَجَّتِهِ‏.‏"
      },
      {
        "id": 1706,
        "hadith_number": "1780",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Umrah-Umrah Nabi Muhammad SAW",
        "perawi_melayu": "Diriwayatkan oleh Hammam:",
        "english_text": "The Prophet (ﷺ) performed four `Umra (three) in Dhi-l-Qa'da except the (one) `Umra which he performed with his Hajj: His `Umra from Al-hudaibiya, and the one of the following year, and the one from Al- Jr'rana where he distributed the booty (of the battle) of Hunain, and another `Umra with his Hajj.",
        "malay_translation": "Nabi (ﷺ) melakukan empat `Umrah (tiga) dalam bulan Zulkaedah kecuali satu `Umrah yang baginda lakukan bersama Haji baginda: `Umrah baginda dari Hudaibiyah, dan yang pada tahun berikutnya, dan yang dari Ji'ranah di mana baginda mengagihkan harta rampasan (perang) Hunain, dan satu lagi `Umrah bersama Haji baginda.",
        "arabic_text": "حَدَّثَنَا هُدْبَةُ، حَدَّثَنَا هَمَّامٌ، وَقَالَ، اعْتَمَرَ أَرْبَعَ عُمَرٍ فِي ذِي الْقَعْدَةِ إِلاَّ الَّتِي اعْتَمَرَ مَعَ حَجَّتِهِ عُمْرَتَهُ مِنَ الْحُدَيْبِيَةِ، وَمِنَ الْعَامِ الْمُقْبِلِ، وَمِنَ الْجِعْرَانَةِ، حَيْثُ قَسَمَ غَنَائِمَ حُنَيْنٍ، وَعُمْرَةً مَعَ حَجَّتِهِ‏.‏"
      },
      {
        "id": 1707,
        "hadith_number": "1781",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Umrah Rasulullah SAW Sebelum Haji",
        "perawi_melayu": "Diriwayatkan daripada Abu 'Is-haq bahawa beliau bertanya kepada Masruq, 'Ata' dan Mujahid, lalu mereka berkata:",
        "english_text": "\"Allah's Messenger (ﷺ) had performed `Umra in Dhi-l-Qa'da before he performed Hajj.\" I heard Al-Bara' bin `Azib رضی اللہ عنہ saying, \"Allah's Messenger (ﷺ) had performed `Umra in Dhi-l-Qa'da twice before he performed Hajj.\"",
        "malay_translation": "\"Rasulullah SAW telah melaksanakan Umrah dalam bulan Dzulkaedah sebelum baginda melaksanakan Haji.\" Saya mendengar Al-Bara' bin 'Azib RA berkata, \"Rasulullah SAW telah melaksanakan Umrah dalam bulan Dzulkaedah sebanyak dua kali sebelum baginda melaksanakan Haji.\"",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ، حَدَّثَنَا شُرَيْحُ بْنُ مَسْلَمَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ يُوسُفَ، عَنْ أَبِيهِ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَأَلْتُ مَسْرُوقًا وَعَطَاءً وَمُجَاهِدًا‏.‏ فَقَالُوا اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ذِي الْقَعْدَةِ قَبْلَ أَنْ يَحُجَّ‏.‏ وَقَالَ سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ ـ رضى الله عنهما ـ يَقُولُ اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ذِي الْقَعْدَةِ، قَبْلَ أَنْ يَحُجَّ مَرَّتَيْنِ‏.‏"
      },
      {
        "id": 1708,
        "hadith_number": "1782",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Umrah di Bulan Ramadan Menyamai Pahala Haji",
        "perawi_melayu": "Diriwayatkan daripada Ibn `Abbas رضی اللہ عنهما :",
        "english_text": "\"Allah's Messenger (ﷺ) asked an Ansari woman (Ibn `Abbas رضی اللہ عنهما named her but `Ata' forgot her name), 'What prevented you from performing Hajj with us?' She replied, 'We have a camel and the father of so-and-so and his son (i.e. her husband and her son) rode it and left one camel for us to use for irrigation.' He said (to her), 'Perform `Umra when Ramadan comes, for `Umra in Ramadan is equal to Hajj (in reward),' or said something similar.\"",
        "malay_translation": "\"Rasulullah (ﷺ) bertanya seorang wanita Ansar (Ibn `Abbas رضی اللہ عنهما menyebut namanya tetapi `Ata' terlupa namanya), 'Apakah yang menghalang kamu daripada menunaikan haji bersama kami?' Wanita itu menjawab, 'Kami mempunyai seekor unta, dan bapa si fulan dan anaknya (iaitu suami dan anaknya) telah menunggangnya dan meninggalkan seekor unta untuk kami gunakan bagi pengairan.' Baginda bersabda (kepadanya), 'Lakukanlah umrah apabila tiba bulan Ramadan, kerana umrah di bulan Ramadan menyamai haji (dari segi pahala),' atau berkata sesuatu yang serupa.\"",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ يُخْبِرُنَا يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لاِمْرَأَةٍ مِنَ الأَنْصَارِ سَمَّاهَا ابْنُ عَبَّاسٍ، فَنَسِيتُ اسْمَهَا ‏\"‏ مَا مَنَعَكِ أَنْ تَحُجِّي مَعَنَا ‏\"‏‏.‏ قَالَتْ كَانَ لَنَا نَاضِحٌ فَرَكِبَهُ أَبُو فُلاَنٍ وَابْنُهُ ـ لِزَوْجِهَا وَابْنِهَا ـ وَتَرَكَ نَاضِحًا نَنْضَحُ عَلَيْهِ قَالَ ‏\"‏ فَإِذَا كَانَ رَمَضَانُ اعْتَمِرِي فِيهِ فَإِنَّ عُمْرَةً فِي رَمَضَانَ حَجَّةٌ ‏\"‏‏.‏ أَوْ نَحْوًا مِمَّا قَالَ‏.‏"
      },
      {
        "id": 1709,
        "hadith_number": "1783",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Berihram untuk Haji dan Umrah serta Keadaan Haid",
        "perawi_melayu": "Diriwayatkan oleh Aisyah رضی اللۈ عنها :",
        "english_text": "We set out along with Allah's Messenger (ﷺ) shortly before the appearance of the new moon (crescent) of the month of Dhi-l-Hijja and he said to us, \"Whoever wants to assume Ihram for Hajj may do so; and whoever wants to assume Ihram for `Umra may do so. Hadn't I brought the Hadi (animal for sacrificing) (with me), I would have assumed Ihram for `Umra.\" (`Aisha added رضی اللۈ عنها ): So some of us assumed Ihram for `Umra while the others for Hajj. I was amongst those who assumed Ihram for `Umra. The day of `Arafat approached and I was still menstruating. I complained to the Prophet (ﷺ) (about that) and he said, \"Abandon your `Umra, undo and comb your hair, and assume Ihram for Hajj;.\" When it was the night of Hasba, he sent `Abdur Rahman with me to at-Tan`im and I assumed Ihram for `Umra (and performed it) in lieu of my missed `Umra.",
        "malay_translation": "Kami keluar bersama Rasulullah (ﷺ) tidak lama sebelum kelihatan anak bulan (hilal) bulan Dzulhijjah dan baginda bersabda kepada kami, \"Sesiapa yang ingin berihram untuk Haji, boleh melakukannya; dan sesiapa yang ingin berihram untuk Umrah, boleh melakukannya. Sekiranya aku tidak membawa al-Hadi (binatang korban) (bersamaku), nescaya aku akan berihram untuk Umrah.\" (`Aisyah menambah رضی اللۈ عنها ): Maka sebahagian daripada kami berihram untuk Umrah manakala yang lain untuk Haji. Aku adalah antara mereka yang berihram untuk Umrah. Hari Arafah menghampiri dan aku masih dalam keadaan haid. Aku mengadu kepada Nabi (ﷺ) (tentang hal itu) dan baginda bersabda, \"Tinggalkan Umrah kamu, uraikan dan sikat rambutmu, dan berihramlah untuk Haji.\" Apabila tiba malam Hasbah, baginda mengutus Abdur Rahman bersamaku ke at-Tan'im dan aku berihram untuk Umrah (dan melakukannya) sebagai ganti Umrahku yang terlepas.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم مُوَافِينَ لِهِلاَلِ ذِي الْحَجَّةِ فَقَالَ لَنَا ‏\"‏ مَنْ أَحَبَّ مِنْكُمْ أَنْ يُهِلَّ بِالْحَجِّ فَلْيُهِلَّ وَمَنْ أَحَبَّ أَنْ يُهِلَّ بِعُمْرَةٍ فَلْيُهِلَّ بِعُمْرَةٍ، فَلَوْلاَ أَنِّي أَهْدَيْتُ لأَهْلَلْتُ بِعُمْرَةٍ ‏\"‏‏.‏ قَالَتْ فَمِنَّا مَنْ أَهَلَّ بِعُمْرَةٍ، وَمِنَّا مَنْ أَهَلَّ بِحَجٍّ، وَكُنْتُ مِمَّنْ أَهَلَّ بِعُمْرَةٍ، فَأَظَلَّنِي يَوْمُ عَرَفَةَ، وَأَنَا حَائِضٌ، فَشَكَوْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ ارْفُضِي عُمْرَتَكِ، وَانْقُضِي رَأْسَكِ وَامْتَشِطِي، وَأَهِلِّي بِالْحَجِّ ‏\"‏‏.‏ فَلَمَّا كَانَ لَيْلَةُ الْحَصْبَةِ أَرْسَلَ مَعِي عَبْدَ الرَّحْمَنِ إِلَى التَّنْعِيمِ، فَأَهْلَلْتُ بِعُمْرَةٍ مَكَانَ عُمْرَتِي‏.‏"
      },
      {
        "id": 1710,
        "hadith_number": "1784",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perintah Nabi ﷺ untuk Membonceng Aisyah dan Melakukan Umrah dari Tan'im",
        "perawi_melayu": "Diriwayatkan oleh Abu Bakr RA:",
        "english_text": "The Prophet (ﷺ) had ordered him to let `Aisha ride behind him and to make her perform `Umra from at-Tan`im. Sufyan states: I heard once rather many times from Amr.",
        "malay_translation": "Nabi ﷺ telah memerintahkannya untuk membonceng Aisyah di belakangnya dan menyuruhnya mengerjakan Umrah dari Tan'im. Sufyan menyatakan: Saya mendengar sekali dan beberapa kali dari Amr.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، سَمِعَ عَمْرَو بْنَ أَوْسٍ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَهُ أَنْ يُرْدِفَ عَائِشَةَ، وَيُعْمِرَهَا مِنَ التَّنْعِيمِ‏.‏ قَالَ سُفْيَانُ مَرَّةً سَمِعْتُ عَمْرًا، كَمْ سَمِعْتُهُ مِنْ عَمْرٍو‏.‏"
      },
      {
        "id": 1711,
        "hadith_number": "1785",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Niat Ihram untuk Haji dan Umrah serta Kebolehan Melakukan Umrah Sebelum Haji",
        "perawi_melayu": "Diriwayatkan oleh Jabir bin `Abdullah رضی اللۀ عنۀما :",
        "english_text": "The Prophet (ﷺ) and his companions assumed Ihram for Hajj and none except the Prophet (ﷺ) and Talha رضی اللۀ عنۀ had the Hadi with them. `Ali رضی اللۀ عنۀ had come from Yemen and he had the Hadi with him. He (`Ali) said, \"I have assumed Ihram with an intention like that of Allah's Messenger (ﷺ) has assumed it.\" The Prophet (ﷺ) ordered his companions to intend the Ihram with which they had come for `Umra, to perform the Tawaf of the Ka`ba (and between Safa and Marwa), to get their hair cut short and then to finish their Ihram with the exception of those who had the Hadi with them. They asked, \"Shall we go to Mina and the private organs of some of us are dribbling (if we finish Ihram and have sexual relations with our wives)?\" The Prophet heard that and said, \"Had I known what I know now, I would not have brought the Hadi. If I did not have the Hadi with me I would have finished my Ihram.\" `Aisha رضی اللۀ عنۀا got her menses and performed all the ceremonies (of Hajj) except the Tawaf . So when she became clean from her menses, and she had performed the Tawaf of the Ka`ba, she said, \"O Allah's Messenger (ﷺ)! You (people) are returning with both Hajj and `Umra and I am returning only with Hajj!\" So, he ordered `Abdur Rahman bin Abu Bakr رضی اللۀ عنۀا to go with her to at-Tan`im. Thus she performed `Umra after the Hajj in the month of Dhi-l-Hijja. Suraqa bin Malik bin Ju'sham met the Prophet (ﷺ) at Al-`Aqaba (Jamrat-ul 'Aqaba) while the latter was stoning it and said, \"O Allah's Messenger (ﷺ)! Is this permissible only for you?\" The Prophet replied, \"No, it is for ever (i.e. it is permissible for all Muslims to perform `Umra before Hajj.\"",
        "malay_translation": "Nabi Muhammad (ﷺ) dan para sahabatnya berniat Ihram untuk Haji dan tidak ada seorang pun kecuali Nabi Muhammad (ﷺ) dan Talha رضی اللۀ عنۀ yang membawa Hadi bersama mereka. `Ali رضی اللۀ عنۀ telah datang dari Yaman dan beliau membawa Hadi bersamanya. Beliau (`Ali) berkata, \"Saya telah berniat Ihram dengan niat seperti yang diniatkan oleh Rasulullah (ﷺ).\" Nabi Muhammad (ﷺ) memerintahkan para sahabatnya untuk meniatkan Ihram yang mereka datang dengannya untuk Umrah, untuk melakukan Tawaf Kaabah (dan antara Safa dan Marwa), untuk memendekkan rambut mereka dan kemudian untuk menyelesaikan Ihram mereka kecuali mereka yang membawa Hadi bersama mereka. Mereka bertanya, \"Adakah kami akan pergi ke Mina dan kemaluan beberapa dari kami menitis (jika kami menyelesaikan Ihram dan melakukan hubungan seksual dengan isteri-isteri kami)?\" Nabi Muhammad mendengar itu dan bersabda, \"Sekiranya aku tahu apa yang aku tahu sekarang, aku tidak akan membawa Hadi. Sekiranya aku tidak membawa Hadi bersamaku, aku akan menyelesaikan Ihramku.\" `Aisha رضی اللۀ عنۀا mendapat haid dan melakukan semua upacara (Haji) kecuali Tawaf. Maka ketika beliau suci dari haidnya, dan beliau telah melakukan Tawaf Kaabah, beliau berkata, \"Wahai Rasulullah (ﷺ)! Kamu (orang ramai) kembali dengan Haji dan Umrah dan saya kembali hanya dengan Haji!\" Maka, beliau memerintahkan `Abdur Rahman bin Abu Bakr رضی اللۀ عنۀا untuk pergi bersamanya ke at-Tan`im. Maka beliau melakukan Umrah setelah Haji pada bulan Dzulhijjah. Suraqa bin Malik bin Ju'sham bertemu dengan Nabi Muhammad (ﷺ) di Al-`Aqaba (Jamratul Aqaba) ketika baginda sedang merejamnya dan berkata, \"Wahai Rasulullah (ﷺ)! Adakah ini dibolehkan hanya untukmu?\" Nabi Muhammad menjawab, \"Tidak, ia adalah untuk selama-lamanya (iaitu ia dibolehkan untuk semua Muslim untuk melakukan Umrah sebelum Haji).\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْمَجِيدِ، عَنْ حَبِيبٍ الْمُعَلِّمِ، عَنْ عَطَاءٍ، حَدَّثَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَهَلَّ وَأَصْحَابُهُ بِالْحَجِّ وَلَيْسَ مَعَ أَحَدٍ مِنْهُمْ هَدْىٌ، غَيْرَ النَّبِيِّ صلى الله عليه وسلم وَطَلْحَةَ، وَكَانَ عَلِيٌّ قَدِمَ مِنَ الْيَمَنِ، وَمَعَهُ الْهَدْىُ فَقَالَ أَهْلَلْتُ بِمَا أَهَلَّ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ وَإِنَّ النَّبِيَّ صلى الله عليه وسلم أَذِنَ لأَصْحَابِهِ أَنْ يَجْعَلُوهَا عُمْرَةً، يَطُوفُوا بِالْبَيْتِ، ثُمَّ يُقَصِّرُوا وَيَحِلُّوا، إِلاَّ مَنْ مَعَهُ الْهَدْىُ، فَقَالُوا نَنْطَلِقُ إِلَى مِنًى وَذَكَرُ أَحَدِنَا يَقْطُرُ فَبَلَغَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ لَوِ اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ مَا أَهْدَيْتُ، وَلَوْلاَ أَنَّ مَعِي الْهَدْىَ لأَحْلَلْتُ ‏\"‏‏.‏ وَأَنَّ عَائِشَةَ حَاضَتْ فَنَسَكَتِ الْمَنَاسِكَ كُلَّهَا، غَيْرَ أَنَّهَا لَمْ تَطُفْ بِالْبَيْتِ قَالَ فَلَمَّا طَهُرَتْ وَطَافَتْ، قَالَتْ يَا رَسُولَ اللَّهِ أَتَنْطَلِقُونَ بِعُمْرَةٍ وَحَجَّةٍ، وَأَنْطَلِقُ بِالْحَجِّ فَأَمَرَ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ أَنْ يَخْرُجَ مَعَهَا إِلَى التَّنْعِيمِ، فَاعْتَمَرَتْ بَعْدَ الْحَجِّ فِي ذِي الْحَجَّةِ، وَأَنَّ سُرَاقَةَ بْنَ مَالِكِ بْنِ جُعْشُمٍ لَقِيَ النَّبِيَّ صلى الله عليه وسلم وَهُوَ بِالْعَقَبَةِ، وَهُوَ يَرْمِيهَا، فَقَالَ أَلَكُمْ هَذِهِ خَاصَّةً، يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ لاَ، بَلْ لِلأَبَدِ ‏\"‏‏.‏"
      },
      {
        "id": 1712,
        "hadith_number": "1786",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Haid Menghalang Umrah, Beralih kepada Haji dan Umrah Gantian",
        "perawi_melayu": "Diriwayatkan daripada Aisyah رضي الله عنها:",
        "english_text": "We set out with Allah's Messenger (ﷺ) shortly before the appearance of the new moon of Dhi-l-Hijja and he said, \"Whoever wants to assume Ihram for `Umra may do so, and whoever wants to assume Ihram for Hajj may do so. Had not I brought the Hadi with me, I would have assumed Ihram for `Umra.\" Some of the people assumed Ihram for `Umra while others for Hajj. I was amongst those who had assumed Ihram for `Umra. I got my menses before entering Mecca, and was menstruating till the day of `Arafat. I complained to Allah's Messenger (ﷺ) about it, he said, \"Abandon your `Umra, undo and comb your hair, and assume Ihram for Hajj.\" So, I did that accordingly. When it was the night of Hasba (day of departure from Mina), the Prophet (ﷺ) sent `Abdur Rahman with me to at-Tan`im. The sub-narrator adds: He (`Abdur-Rahman) let her ride behind him. And she assumed Ihram for `Umra in lieu of the abandoned one. Aisha completed her Hajj and `Umra, and no Hadi, Sadaqa (charity), or fasting was obligatory for her.",
        "malay_translation": "Kami keluar bersama Rasulullah ﷺ tidak lama sebelum munculnya anak bulan Zulhijjah dan baginda bersabda, \"Sesiapa yang ingin berniat ihram untuk umrah boleh melakukannya, dan sesiapa yang ingin berniat ihram untuk haji boleh melakukannya. Kalaulah tidak kerana saya membawa al-Hadi bersama saya, nescaya saya akan berniat ihram untuk umrah.\" Sebahagian orang berniat ihram untuk umrah manakala yang lain untuk haji. Saya adalah antara mereka yang telah berniat ihram untuk umrah. Saya mendapat haid sebelum memasuki Mekah, dan berhaid sehingga hari Arafah. Saya mengadu kepada Rasulullah ﷺ tentang hal itu, baginda bersabda, \"Tinggalkan umrah kamu, uraikan dan sikat rambutmu, dan berniat ihram untuk haji.\" Maka, saya lakukan sedemikian. Apabila tiba malam Hasbah (hari keberangkatan dari Mina), Nabi ﷺ menghantar Abdur Rahman bersama saya ke at-Tan'im. Sub-periwayat menambah: Dia (Abdur-Rahman) memboncengkannya di belakangnya. Dan dia berniat ihram untuk umrah sebagai ganti umrah yang ditinggalkan. Aisyah menyempurnakan haji dan umrahnya, dan tidak ada al-Hadi, sedekah, atau puasa yang wajib baginya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، حَدَّثَنَا هِشَامٌ، قَالَ أَخْبَرَنِي أَبِي قَالَ، أَخْبَرَتْنِي عَائِشَةُ ـ رضى الله عنها ـ قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم مُوَافِينَ لِهِلاَلِ ذِي الْحَجَّةِ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَحَبَّ أَنْ يُهِلَّ بِعُمْرَةٍ فَلْيُهِلَّ، وَمَنْ أَحَبَّ أَنْ يُهِلَّ بِحَجَّةِ فَلْيُهِلَّ، وَلَوْلاَ أَنِّي أَهْدَيْتُ لأَهْلَلْتُ بِعُمْرَةٍ ‏\"‏‏.‏ فَمِنْهُمْ مَنْ أَهَلَّ بِعُمْرَةٍ، وَمِنْهُمْ مِنْ أَهَلَّ بِحَجَّةٍ، وَكُنْتُ مِمَّنْ أَهَلَّ بِعُمْرَةٍ، فَحِضْتُ قَبْلَ أَنْ أَدْخُلَ مَكَّةَ، فَأَدْرَكَنِي يَوْمُ عَرَفَةَ، وَأَنَا حَائِضٌ، فَشَكَوْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ دَعِي عُمْرَتَكِ، وَانْقُضِي رَأْسَكِ وَامْتَشِطِي، وَأَهِلِّي بِالْحَجِّ ‏\"‏‏.‏ فَفَعَلْتُ، فَلَمَّا كَانَتْ لَيْلَةُ الْحَصْبَةِ أَرْسَلَ مَعِي عَبْدَ الرَّحْمَنِ إِلَى التَّنْعِيمِ، فَأَرْدَفَهَا، فَأَهَلَّتْ بِعُمْرَةٍ مَكَانَ عُمْرَتِهَا، فَقَضَى اللَّهُ حَجَّهَا وَعُمْرَتَهَا، وَلَمْ يَكُنْ فِي شَىْءٍ مِنْ ذَلِكَ هَدْىٌ، وَلاَ صَدَقَةٌ، وَلاَ صَوْمٌ‏.‏"
      },
      {
        "id": 1713,
        "hadith_number": "1787",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Anjuran Menunggu Suci Haid dan Berihram dari Tan'im untuk Mendapatkan Pahala Umrah",
        "perawi_melayu": "Diriwayatkan oleh Al-Aswad:",
        "english_text": "That `Aisha رضی اللہ عنہا said, \"O Allah's Messenger (ﷺ)! The people are returning after performing the two Nusuks (i.e. Hajj and `Umra) but I am returning with one only?\" He said, \"Wait till you become clean from your menses and then go to at-Tan`im, assume Ihram (and after performing `Umra) join us at such-andsuch a place. But it (i.e. the reward if `Umra) is according to your expenses or the hardship (which you will undergo while performing it).",
        "malay_translation": "Daripada 'Aisyah رضي الله عنها berkata, \"Wahai Rasulullah ﷺ! Orang ramai pulang selepas mengerjakan dua Nusuk (iaitu Haji dan 'Umrah) tetapi saya pulang dengan satu sahaja?\" Baginda bersabda, \"Tunggu sehingga kamu suci daripada haid kamu dan kemudian pergi ke at-Tan'im, berihram (dan selepas mengerjakan 'Umrah) sertai kami di tempat yang tertentu. Tetapi ia (iaitu pahala 'Umrah) adalah mengikut perbelanjaan kamu atau kesukaran (yang akan kamu alami ketika mengerjakannya).",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، وَعَنِ ابْنِ عَوْنٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، قَالاَ قَالَتْ عَائِشَةُ ـ رضى الله عنها ـ يَا رَسُولَ اللَّهِ يَصْدُرُ النَّاسُ بِنُسُكَيْنِ وَأَصْدُرُ بِنُسُكٍ فَقِيلَ لَهَا ‏ \"‏ انْتَظِرِي، فَإِذَا طَهُرْتِ فَاخْرُجِي إِلَى التَّنْعِيمِ، فَأَهِلِّي ثُمَّ ائْتِينَا بِمَكَانِ كَذَا، وَلَكِنَّهَا عَلَى قَدْرِ نَفَقَتِكِ، أَوْ نَصَبِكِ ‏\"‏‏.‏"
      },
      {
        "id": 1714,
        "hadith_number": "1788",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Arahan Nabi ﷺ kepada Aisyah tentang Umrah Semasa Haid",
        "perawi_melayu": "Diriwayatkan oleh Aisyah رضي الله عنها :",
        "english_text": "The Prophet (ﷺ) came to me while I was weeping. He asked me the reason for it. I replied, \"I have heard of what you have said to your companions and I cannot do the `Umra.\" He asked me, \"What is the matter with you?\" I replied, \"I am not praying.\" He said, \"There is no harm in it as you are one of the daughters of Adam and the same is written for you as for others. So, you should perform Hajj and I hope that Allah will enable you to perform the `Umra as well.\" So, I carried on till we departed from Mina and halted at Al-Mahassab. The Prophet (ﷺ) called `Abdur- Rahman and said, \"Go out of the sanctuary with your sister and let her assume Ihram for `Umra, and after both of you have finished the Tawaf I will be waiting for you at this place.\" We came back at midnight and the Prophet (ﷺ) asked us, \"Have you finished?\" I replied in the affirmative. He announced the departure and the people set out for the journey and some of them had performed the Tawaf of the Ka`ba before the morning prayer, and after that the Prophet (ﷺ) set out for Medina.",
        "malay_translation": "Nabi ﷺ datang kepada saya ketika saya sedang menangis. Baginda bertanya kepada saya sebabnya. Saya menjawab, \"Saya telah mendengar apa yang telah kamu katakan kepada sahabat-sahabat kamu dan saya tidak dapat melakukan Umrah.\" Baginda bertanya kepada saya, \"Apa yang berlaku kepada kamu?\" Saya menjawab, \"Saya tidak solat.\" Baginda bersabda, \"Tidak mengapa kerana kamu adalah salah seorang anak perempuan Adam dan perkara yang sama telah ditetapkan untuk kamu seperti untuk orang lain. Oleh itu, kamu hendaklah mengerjakan Haji dan saya berharap Allah akan membolehkan kamu mengerjakan Umrah juga.\" Oleh itu, saya meneruskan sehingga kami bertolak dari Mina dan berhenti di Al-Mahassab. Nabi ﷺ memanggil Abdur-Rahman dan bersabda, \"Keluarlah dari tanah haram bersama saudara perempuanmu dan biarkan dia berihram untuk Umrah, dan setelah kamu berdua selesai Tawaf, saya akan menunggu kamu di tempat ini.\" Kami kembali pada tengah malam dan Nabi ﷺ bertanya kepada kami, \"Sudahkah kamu selesai?\" Saya menjawab ya. Baginda mengumumkan keberangkatan dan orang ramai berangkat untuk perjalanan dan sebahagian daripada mereka telah melakukan Tawaf Kaabah sebelum solat subuh, dan selepas itu Nabi ﷺ berangkat ke Madinah.",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا أَفْلَحُ بْنُ حُمَيْدٍ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ خَرَجْنَا مُهِلِّينَ بِالْحَجِّ فِي أَشْهُرِ الْحَجِّ، وَحُرُمِ الْحَجِّ، فَنَزَلْنَا سَرِفَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم لأَصْحَابِهِ ‏\"‏ مَنْ لَمْ يَكُنْ مَعَهُ هَدْىٌ، فَأَحَبَّ أَنْ يَجْعَلَهَا عُمْرَةً، فَلْيَفْعَلْ وَمَنْ كَانَ مَعَهُ هَدْىٌ فَلاَ ‏\"‏‏.‏ وَكَانَ مَعَ النَّبِيِّ صلى الله عليه وسلم وَرِجَالٍ مِنْ أَصْحَابِهِ ذَوِي قُوَّةٍ الْهَدْىُ، فَلَمْ تَكُنْ لَهُمْ عُمْرَةً، فَدَخَلَ عَلَىَّ النَّبِيُّ صلى الله عليه وسلم وَأَنَا أَبْكِي فَقَالَ ‏\"‏ مَا يُبْكِيكِ ‏\"‏‏.‏ قُلْتُ سَمِعْتُكَ تَقُولُ لأَصْحَابِكَ مَا قُلْتَ فَمُنِعْتُ الْعُمْرَةَ‏.‏ قَالَ ‏\"‏ وَمَا شَأْنُكِ ‏\"‏‏.‏ قُلْتُ لاَ أُصَلِّي‏.‏ قَالَ ‏\"‏ فَلاَ يَضُرَّكِ أَنْتِ مِنْ بَنَاتِ آدَمَ، كُتِبَ عَلَيْكِ مَا كُتِبَ عَلَيْهِنَّ، فَكُونِي فِي حَجَّتِكِ عَسَى اللَّهُ أَنْ يَرْزُقَكِهَا ‏\"‏‏.‏ قَالَتْ فَكُنْتُ حَتَّى نَفَرْنَا مِنْ مِنًى، فَنَزَلْنَا الْمُحَصَّبَ فَدَعَا عَبْدَ الرَّحْمَنِ، فَقَالَ ‏\"‏ اخْرُجْ بِأُخْتِكَ الْحَرَمَ، فَلْتُهِلَّ بِعُمْرَةٍ، ثُمَّ افْرُغَا مِنْ طَوَافِكُمَا، أَنْتَظِرْكُمَا هَا هُنَا ‏\"‏‏.‏ فَأَتَيْنَا فِي جَوْفِ اللَّيْلِ‏.‏ فَقَالَ ‏\"‏ فَرَغْتُمَا ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ فَنَادَى بِالرَّحِيلِ فِي أَصْحَابِهِ، فَارْتَحَلَ النَّاسُ، وَمَنْ طَافَ بِالْبَيْتِ، قَبْلَ صَلاَةِ الصُّبْحِ، ثُمَّ خَرَجَ مُوَجِّهًا إِلَى الْمَدِينَةِ‏.‏"
      },
      {
        "id": 1715,
        "hadith_number": "1789",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Arahan Mengenai Cara Melaksanakan Umrah dan Menanggalkan Wangian",
        "perawi_melayu": "Diriwayatkan oleh Safwan bin Ya'la bin Umaiya daripada ayahnya yang berkata:",
        "english_text": "\"A man came to the Prophet (ﷺ) while he was at Ji'rana. The man was wearing a cloak which had traces of Khaluq or Sufra (a kind of perfume). The man asked (the Prophet (ﷺ) ), 'What do you order me to perform in my `Umra?' So, Allah inspired the Prophet (ﷺ) divinely and he was screened by a place of cloth. I wished to see the Prophet (ﷺ) being divinely inspired. `Umar said to me, 'Come! Will you be pleased to look at the Prophet (ﷺ) while Allah is inspiring him?' I replied in the affirmative. `Umar lifted one corner of the cloth and I looked at the Prophet (ﷺ) who was snoring. (The sub-narrator thought that he said: The snoring was like that of a camel). When that state was over, the Prophet (ﷺ) asked, \"Where is the questioner who asked about `Umra? Put off your cloak and wash away the traces of Khaluq from your body and clean the Sufra (yellow color) and perform in your Umra what you perform in your Hajj (i.e. the Tawaf round the Ka`ba and the Sa`i between Safa and Marwa). \"",
        "malay_translation": "\"Seorang lelaki datang kepada Nabi (ﷺ) ketika baginda berada di Ji'rana. Lelaki itu memakai jubah yang mempunyai kesan Khaluq atau Sufra (sejenis minyak wangi). Lelaki itu bertanya (kepada Nabi (ﷺ)), 'Apakah yang engkau perintahkan kepadaku untuk dilakukan dalam `Umrahku?' Maka, Allah memberi wahyu kepada Nabi (ﷺ) secara ilahi dan baginda dilindungi oleh sehelai kain. Saya ingin melihat Nabi (ﷺ) ketika diwahyukan. `Umar berkata kepada saya, 'Mari! Adakah kamu gembira untuk melihat Nabi (ﷺ) ketika Allah sedang mewahyukan kepadanya?' Saya menjawab ya. `Umar mengangkat satu sudut kain dan saya melihat Nabi (ﷺ) yang sedang berdengkur. (Sub-periwayat menyangka bahawa dia berkata: Dengkurannya seperti dengkuran unta). Apabila keadaan itu berakhir, Nabi (ﷺ) bertanya, \"Di mana orang yang bertanya tentang `Umrah? Tanggalkan jubahmu dan basuhlah kesan Khaluq dari badanmu dan bersihkan Sufra (warna kuning) dan lakukan dalam Umrahmu apa yang kamu lakukan dalam Haji (iaitu Tawaf di sekeliling Ka`bah dan Sa`i antara Safa dan Marwa). \"",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا عَطَاءٌ، قَالَ حَدَّثَنِي صَفْوَانُ بْنُ يَعْلَى بْنِ أُمَيَّةَ يَعْنِي، عَنْ أَبِيهِ، أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم وَهُوَ بِالْجِعْرَانَةِ وَعَلَيْهِ جُبَّةٌ وَعَلَيْهِ أَثَرُ الْخَلُوقِ أَوْ قَالَ صُفْرَةٍ فَقَالَ كَيْفَ تَأْمُرُنِي أَنْ أَصْنَعَ فِي عُمْرَتِي فَأَنْزَلَ اللَّهُ عَلَى النَّبِيِّ صلى الله عليه وسلم، فَسُتِرَ بِثَوْبٍ وَوَدِدْتُ أَنِّي قَدْ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَقَدْ أُنْزِلَ عَلَيْهِ الْوَحْىُ‏.‏ فَقَالَ عُمَرُ تَعَالَ أَيَسُرُّكَ أَنْ تَنْظُرَ إِلَى النَّبِيِّ صلى الله عليه وسلم وَقَدْ أَنْزَلَ اللَّهُ الْوَحْىَ قُلْتُ نَعَمْ‏.‏ فَرَفَعَ طَرَفَ الثَّوْبِ، فَنَظَرْتُ إِلَيْهِ لَهُ غَطِيطٌ وَأَحْسِبُهُ قَالَ كَغَطِيطِ الْبَكْرِ‏.‏ فَلَمَّا سُرِّيَ عَنْهُ قَالَ ‏ \"‏ أَيْنَ السَّائِلُ عَنِ الْعُمْرَةِ اخْلَعْ عَنْكَ الْجُبَّةَ وَاغْسِلْ أَثَرَ الْخَلُوقِ عَنْكَ، وَأَنْقِ الصُّفْرَةَ، وَاصْنَعْ فِي عُمْرَتِكَ كَمَا تَصْنَعُ فِي حَجِّكِ ‏\"‏‏.‏"
      },
      {
        "id": 1716,
        "hadith_number": "1790",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kewajipan Sa'i Antara Safa dan Marwa",
        "perawi_melayu": "Diriwayatkan oleh Hisham Ibn `Urwa daripada bapanya yang berkata:",
        "english_text": "While I was a youngster, I asked `Aisha رضی اللہ عنہا the wife of the Prophet. \"What about the meaning of the Statement of Allah; \"Verily! (the mountains) As-Safa and Al Marwa, are among the symbols of Allah. So, it is not harmful if those who perform Hajj or `Umra of the House (Ka`ba at Mecca) to perform the going (Tawaf) between them? (2.158) I understand (from that) that there is no harm if somebody does not perform the Tawaf between them.\" `Aisha replied, \"No, for if it were as you are saying, then the recitation would have been like this: 'It is not harmful not to perform Tawaf between them.' This verse was revealed in connection with the Ansar who used to assume the Ihram for the idol Manat which was put beside a place called Qudaid and those people thought it not right to perform the Tawaf of As- Safa and Al-Marwa. When Islam came, they asked Allah's Messenger (ﷺ) about that, and Allah revealed:-- \"Verily! (the mountains) As-Safa and Al-Marwa Are among the symbols of Allah. So, it is not harmful of those who perform Hajj or `Umra of the House (Ka`ba at Mecca) to perform the going (Tawaf) between them.\" (2.158) Sufyan and Abu Muawiya added from Hisham (from `Aisha): \"The Hajj or `Umra of the person who does not perform the going (Tawaf) between As-Safa and Al-Marwa is incomplete in Allah's sight.",
        "malay_translation": "Ketika saya masih muda, saya bertanya kepada `Aisha رضی اللہ عنہا isteri Nabi. \"Bagaimana dengan makna Firman Allah; \"Sesungguhnya! (bukit) As-Safa dan Al Marwa, adalah sebahagian daripada syiar Allah. Maka, tidak mengapa bagi mereka yang mengerjakan Haji atau `Umrah di Baitullah (Ka`bah di Mekah) untuk melakukan perjalanan (Tawaf) di antara keduanya? (2:158) Saya faham (dari itu) bahawa tidak mengapa jika seseorang tidak melakukan Tawaf di antara keduanya.\" `Aisha menjawab, \"Tidak, kerana jika ia seperti yang kamu katakan, maka bacaannya sepatutnya seperti ini: 'Tidak mengapa untuk tidak melakukan Tawaf di antara keduanya.' Ayat ini diturunkan berkaitan dengan Ansar yang biasa berniat Ihram untuk berhala Manat yang diletakkan di tepi tempat bernama Qudaid dan orang-orang itu beranggapan tidak betul untuk melakukan Tawaf di As-Safa dan Al-Marwa. Ketika Islam datang, mereka bertanya kepada Rasulullah (ﷺ) tentang hal itu, dan Allah menurunkan:-- \"Sesungguhnya! (bukit) As-Safa dan Al-Marwa Adalah sebahagian daripada syiar Allah. Maka, tidak mengapa bagi mereka yang mengerjakan Haji atau `Umrah di Baitullah (Ka`bah di Mekah) untuk melakukan perjalanan (Tawaf) di antara keduanya.\" (2:158) Sufyan dan Abu Muawiya menambah daripada Hisham (daripada `Aisha): \"Haji atau `Umrah seseorang yang tidak melakukan perjalanan (Tawaf) antara As-Safa dan Al-Marwa adalah tidak sempurna di sisi Allah.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ قُلْتُ لِعَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم وَأَنَا يَوْمَئِذٍ حَدِيثُ السِّنِّ أَرَأَيْتِ قَوْلَ اللَّهِ تَبَارَكَ وَتَعَالَى ‏{‏إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلاَ جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا‏}‏ فَلاَ أُرَى عَلَى أَحَدٍ شَيْئًا أَنْ لاَ يَطَّوَّفَ بِهِمَا‏.‏ فَقَالَتْ عَائِشَةُ كَلاَّ، لَوْ كَانَتْ كَمَا تَقُولُ كَانَتْ فَلاَ جُنَاحَ عَلَيْهِ أَنْ لاَ يَطَّوَّفَ بِهِمَا‏.‏ إِنَّمَا أُنْزِلَتْ هَذِهِ الآيَةُ فِي الأَنْصَارِ كَانُوا يُهِلُّونَ لِمَنَاةَ، وَكَانَتْ مَنَاةُ حَذْوَ قُدَيْدٍ، وَكَانُوا يَتَحَرَّجُونَ أَنْ يَطُوفُوا بَيْنَ الصَّفَا وَالْمَرْوَةِ، فَلَمَّا جَاءَ الإِسْلاَمُ سَأَلُوا رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ، فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلاَ جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا‏}‏‏.‏ زَادَ سُفْيَانُ وَأَبُو مُعَاوِيَةَ عَنْ هِشَامٍ مَا أَتَمَّ اللَّهُ حَجَّ امْرِئٍ وَلاَ عُمْرَتَهُ لَمْ يَطُفْ بَيْنَ الصَّفَا وَالْمَرْوَةِ‏.‏"
      },
      {
        "id": 1717,
        "hadith_number": "1791, 1792",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Menunaikan Umrah dan Berita Gembira untuk Khadijah RA dengan Istana di Syurga",
        "perawi_melayu": "Diriwayatkan oleh Abdullah bin Abu Aufa:",
        "english_text": "\"Allah's Messenger (ﷺ) performed `Umra and we too performed `Umra along with him. When he entered Mecca he performed the Tawaf (of Ka`ba) and we too performed it along with him, and then he came to the As-Safa and Al-Marwa (i.e. performed the Sai) and we also came to them along with him. We were shielding him from the people of Mecca lest they may hit him with an arrow.\" A friend of his asked him (i.e. `Abdullah bin `Aufa), \"Did the Prophet (ﷺ) enter the Ka`ba (during that `Umra)?\" He replied in the negative.\r\nThen he said, \"What did he (the Prophet (ﷺ)) say about Khadija رضی اللہ عنۈا ?\" He (Abdullah bin `Aufa) said, \"(He said) 'Give Khadija the good tidings that she will have a palace made of Qasab in Paradise and there will be neither noise nor any trouble in it.'\"",
        "malay_translation": "\"Rasulullah ﷺ menunaikan umrah dan kami juga menunaikan umrah bersama baginda. Apabila baginda memasuki Mekah, baginda melakukan Tawaf (Kaabah) dan kami juga melakukannya bersama baginda, dan kemudian baginda datang ke As-Safa dan Al-Marwa (iaitu melakukan Sa'i) dan kami juga datang ke sana bersama baginda. Kami melindungi baginda daripada penduduk Mekah supaya mereka tidak memanah baginda.\" Seorang sahabatnya bertanya kepadanya (iaitu Abdullah bin Aufa), \"Adakah Nabi ﷺ memasuki Kaabah (semasa umrah itu)?\" Beliau menjawab tidak.\r\nKemudian dia berkata, \"Apakah yang baginda (Nabi ﷺ) katakan tentang Khadijah رضي الله عنها?\" Beliau (Abdullah bin Aufa) berkata, \"(Baginda bersabda), 'Berikanlah khabar gembira kepada Khadijah bahawa dia akan memiliki sebuah istana yang diperbuat daripada Qasab di Syurga dan tidak akan ada kebisingan atau kesusahan di dalamnya.'\"",
        "arabic_text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، عَنْ جَرِيرٍ، عَنْ إِسْمَاعِيلَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى، قَالَ اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَاعْتَمَرْنَا مَعَهُ فَلَمَّا دَخَلَ مَكَّةَ طَافَ وَطُفْنَا مَعَهُ، وَأَتَى الصَّفَا وَالْمَرْوَةَ وَأَتَيْنَاهَا مَعَهُ، وَكُنَّا نَسْتُرُهُ مِنْ أَهْلِ مَكَّةَ أَنْ يَرْمِيَهُ أَحَدٌ‏.‏ فَقَالَ لَهُ صَاحِبٌ لِي أَكَانَ دَخَلَ الْكَعْبَةَ قَالَ لاَ‏.‏ قَالَ فَحَدِّثْنَا مَا، قَالَ لِخَدِيجَةَ‏.‏ قَالَ ‏ \"‏ بَشِّرُوا خَدِيجَةَ بِبَيْتٍ فِي الْجَنَّةِ مِنْ قَصَبٍ لاَ صَخَبَ فِيهِ وَلاَ نَصَبَ ‏\"‏‏.‏"
      },
      {
        "id": 1718,
        "hadith_number": "1793, 1794",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Hubungan Intim Sebelum Selesai Sa'i",
        "perawi_melayu": "Diriwayatkan oleh `Amr bin Dinar:",
        "english_text": "We asked Ibn `Umar رضی اللہ عنہما whether a man who had performed the Tawaf of the Ka`ba but had not performed the Tawaf between As-Safa and Al-Marwa yet, was permitted to have sexual relation with his wife. He replied, \"The Prophet (ﷺ) arrived (at Mecca) and circumambulated the Ka`ba seven times and then offered a two rak`at prayer behind Maqam-lbrahim and then performed the going (Tawaf) between As-Safa and Al-Marwa (seven times) (and verily, in Allah's Messenger (ﷺ) you have a good example.\"\r\nAnd we asked Jabir bin `Abdullahرضی اللہ عنہما (the same question) and he replied, \"He should not go near her till he has finished the going (Tawaf) between As-Safa and Al-Marwa.\"",
        "malay_translation": "Kami bertanya kepada Ibn Umar رضي الله عنهما adakah seorang lelaki yang telah melakukan Tawaf Kaabah tetapi belum melakukan sa'i antara Safa dan Marwah, dibenarkan untuk melakukan hubungan kelamin dengan isterinya? Beliau menjawab, \"Nabi ﷺ tiba (di Mekah) dan bertawaf di Kaabah sebanyak tujuh kali, kemudian menunaikan solat dua rakaat di belakang Maqam Ibrahim, dan kemudian melakukan sa'i (Tawaf) antara Safa dan Marwah (sebanyak tujuh kali) (dan sesungguhnya, pada diri Rasulullah ﷺ terdapat contoh teladan yang baik bagi kamu.)\"\r\nDan kami bertanya kepada Jabir bin `Abdullah رضي الله عنهما (soalan yang sama) dan beliau menjawab, \"Dia tidak boleh mendekati isterinya sehingga dia selesai melakukan sa'i (Tawaf) antara Safa dan Marwah.\"",
        "arabic_text": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، قَالَ سَأَلْنَا ابْنَ عُمَرَ ـ رضى الله عنهما ـ عَنْ رَجُلٍ، طَافَ بِالْبَيْتِ فِي عُمْرَةٍ، وَلَمْ يَطُفْ بَيْنَ الصَّفَا وَالْمَرْوَةِ، أَيَأْتِي امْرَأَتَهُ فَقَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم فَطَافَ بِالْبَيْتِ سَبْعًا، وَصَلَّى خَلْفَ الْمَقَامِ رَكْعَتَيْنِ، وَطَافَ بَيْنَ الصَّفَا وَالْمَرْوَةِ سَبْعًا، وَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ‏.‏ قَالَ وَسَأَلْنَا جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ فَقَالَ لاَ يَقْرَبَنَّهَا حَتَّى يَطُوفَ بَيْنَ الصَّفَا وَالْمَرْوَةِ‏."
      },
      {
        "id": 1719,
        "hadith_number": "1795",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Niat Ihram Seperti Nabi dan Arahan untuk Menyelesaikan Ihram",
        "perawi_melayu": "Diriwayatkan oleh Abu Musa Al-Ash`ari:",
        "english_text": "I came to the Prophet (ﷺ) at Al-Batha' while his camel was kneeling down and he asked me, \"Have you intended to perform the Hajj?\" I replied in the affirmative. He asked me, 'With what intention have you assumed Ihram?\" I replied, \"I have assumed Ihram with the same intention as that of the Prophet. He said, \"You have done well. Perform the Tawaf of the Ka`ba and (the Sai) between As-Safa and Al- Marwa and then finish the Ihram.\" So, I performed the Tawaf around the Ka`ba and the Sai) between As-Safa and Al-Marwa and then went to a woman of the tribe of Qais who cleaned my head from lice. Later I assumed the Ihram for Hajj. I used to give the verdict of doing the same till the caliphate of `Umar who said, \"If you follow the Holy Book then it orders you to remain in the state of Ihram till you finish from Hajj, if you follow the Prophet (ﷺ) then he did not finish his Ihram till the Hadi (sacrifice) had reached its place of slaughtering (Hajj-al-Qiran).",
        "malay_translation": "Aku datang kepada Nabi (ﷺ) di Al-Batha' ketika unta baginda sedang berlutut, lalu baginda bertanya kepadaku, \"Adakah kamu berniat untuk menunaikan haji?\" Aku menjawab, \"Ya.\" Baginda bertanya lagi, \"Dengan niat apa kamu berihram?\" Aku menjawab, \"Aku berihram dengan niat yang sama seperti Nabi.\" Baginda bersabda, \"Bagus. Lakukan tawaf di Kaabah dan sa'i antara Safa dan Marwah, kemudian selesaikan ihram.\" Maka, aku melakukan tawaf di Kaabah dan sa'i antara Safa dan Marwah, kemudian pergi kepada seorang wanita dari suku Qais yang membersihkan kepalaku daripada kutu. Kemudian aku berihram untuk haji. Aku terus memberikan fatwa yang sama sehingga zaman pemerintahan Umar, yang berkata, \"Jika kamu mengikuti Kitab Suci, maka ia memerintahkan kamu untuk kekal dalam keadaan ihram sehingga kamu selesai haji. Jika kamu mengikuti Nabi (ﷺ), maka baginda tidak menyelesaikan ihramnya sehingga hadyu (haiwan korban) sampai ke tempat penyembelihannya (Haji Qiran).\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ قَيْسِ بْنِ مُسْلِمٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ ـ رضى الله عنه ـ قَالَ قَدِمْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم بِالْبَطْحَاءِ وَهُوَ مُنِيخٌ فَقَالَ ‏\"‏ أَحَجَجْتَ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ بِمَا أَهْلَلْتَ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ بِإِهْلاَلٍ كَإِهْلاَلِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ أَحْسَنْتَ‏.‏ طُفْ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ ثُمَّ أَحِلَّ ‏\"‏‏.‏ فَطُفْتُ بِالْبَيْتِ، وَبِالصَّفَا وَالْمَرْوَةِ، ثُمَّ أَتَيْتُ امْرَأَةً مِنْ قَيْسٍ، فَفَلَتْ رَأْسِي، ثُمَّ أَهْلَلْتُ بِالْحَجِّ‏.‏ فَكُنْتُ أُفْتِي بِهِ، حَتَّى كَانَ فِي خِلاَفَةِ عُمَرَ فَقَالَ إِنْ أَخَذْنَا بِكِتَابِ اللَّهِ فَإِنَّهُ يَأْمُرُنَا بِالتَّمَامِ، وَإِنْ أَخَذْنَا بِقَوْلِ النَّبِيِّ صلى الله عليه وسلم فَإِنَّهُ لَمْ يَحِلَّ حَتَّى يَبْلُغَ الْهَدْىُ مَحِلَّهُ‏.‏"
      },
      {
        "id": 1720,
        "hadith_number": "1796",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Doa Asma' binti Abu Bakar di Al-Hajun dan Kisah Umrah dan Haji",
        "perawi_melayu": "Riwayat Al-Aswad:",
        "english_text": "`Abdullah the slave of Asma bint Abu Bakr رضی اللہ عنہا , told me that he used to hear Asma' رضی اللہ عنہا, whenever she passed by Al-Hajun, saying, \"May Allah bless His Apostle Muhammad. Once we dismounted here with him, and at that time we were traveling with light luggage; we had a few riding animals and a little food ration. I, my sister, `Aisha رضی اللہ عنہا , Az-Zubair رضی اللہ عنہم and such and such persons performed `Umra, and when we had passed our hands over the Ka`ba (i.e. performed Tawaf round the Ka`ba and between As-Safa and Al- Marwa) we finished our lhram. Later on we assumed Ihram for Hajj the same evening.\"",
        "malay_translation": "Abdullah, hamba Asma' binti Abu Bakar رضي الله عنها, memberitahu saya bahawa beliau biasa mendengar Asma' رضي الله عنها, setiap kali melalui Al-Hajun, berdoa, \"Semoga Allah merahmati Rasul-Nya Muhammad.\"  Pada suatu ketika kami berhenti di sini bersama baginda, ketika itu kami melakukan perjalanan dengan bekalan yang ringan; kami hanya mempunyai beberapa ekor binatang tunggangan dan sedikit bekalan makanan. Saya, saudari saya, Aishah رضي الله عنها, Az-Zubair رضي الله عنه dan beberapa orang lagi menunaikan Umrah, dan setelah kami melakukan tawaf mengelilingi Kaabah dan antara Safa dan Marwa, kami pun selesai ihram. Kemudiannya kami berihram untuk Haji pada malam yang sama.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عِيسَى، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنَا عَمْرٌو، عَنْ أَبِي الأَسْوَدِ، أَنَّ عَبْدَ اللَّهِ، مَوْلَى أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ حَدَّثَهُ أَنَّهُ، كَانَ يَسْمَعُ أَسْمَاءَ تَقُولُ كُلَّمَا مَرَّتْ بِالْحَجُونِ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ لَقَدْ نَزَلْنَا مَعَهُ هَا هُنَا، وَنَحْنُ يَوْمَئِذٍ خِفَافٌ، قَلِيلٌ ظَهْرُنَا، قَلِيلَةٌ أَزْوَادُنَا، فَاعْتَمَرْتُ أَنَا وَأُخْتِي عَائِشَةُ وَالزُّبَيْرُ وَفُلاَنٌ وَفُلاَنٌ، فَلَمَّا مَسَحْنَا الْبَيْتَ أَحْلَلْنَا، ثُمَّ أَهْلَلْنَا مِنَ الْعَشِيِّ بِالْحَجِّ‏.‏"
      },
      {
        "id": 1721,
        "hadith_number": "1797",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Zikir Rasulullah SAW Ketika Pulang dari Peperangan, Haji atau Umrah",
        "perawi_melayu": "Diriwayatkan oleh Abdullah bin `Umar رضی اللہ عنۈما :",
        "english_text": "Whenever Allah's Messenger (ﷺ) returned from a Ghazwa, Hajj or `Umra, he used to say Takbir thrice at every elevation of the ground and then would say, \"None has the right to be worshipped but Allah; He is One and has no partner. All the kingdoms is for Him, and all the praises are for Him, and He is Omnipotent. We are returning with repentance, worshipping, prostrating, and praising our Lord. He has kept up His promise and made His slave victorious, and He Alone defeated all the clans of (nonbelievers).\"",
        "malay_translation": "Setiap kali Rasulullah (ﷺ) pulang dari peperangan (Ghazwa), haji atau umrah, baginda akan bertakbir tiga kali setiap kali mendaki tempat yang tinggi, kemudian baginda bersabda, \"Tiada Tuhan yang berhak disembah melainkan Allah; Dia Esa dan tiada sekutu bagi-Nya.  Kerajaan dan pujian hanya milik-Nya, dan Dia Maha Kuasa atas segala sesuatu. Kami kembali dengan bertaubat, beribadah, bersujud, dan memuji Tuhan kami. Dia telah menepati janji-Nya, memenangkan hamba-Nya, dan Dia sendiri yang mengalahkan semua golongan (orang kafir).\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا قَفَلَ مِنْ غَزْوٍ أَوْ حَجٍّ أَوْ عُمْرَةٍ يُكَبِّرُ عَلَى كُلِّ شَرَفٍ مِنَ الأَرْضِ ثَلاَثَ تَكْبِيرَاتٍ، ثُمَّ يَقُولُ ‏ \"‏ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ، آيِبُونَ تَائِبُونَ عَابِدُونَ سَاجِدُونَ لِرَبِّنَا حَامِدُونَ، صَدَقَ اللَّهُ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الأَحْزَابَ وَحْدَهُ ‏\"‏‏.‏"
      },
      {
        "id": 1722,
        "hadith_number": "1798",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi Membonceng Kanak-kanak Semasa di Mekah",
        "perawi_melayu": "Diriwayatkan oleh Ibn Abbas رضی اللہ عنۀما :",
        "english_text": "When the Prophet (ﷺ) arrived at Mecca, some boys of the tribe of Bani `Abdul Muttalib went to receive him, and the Prophet (ﷺ) made one of them ride in front of him and the other behind him.",
        "malay_translation": "Ketika Nabi Muhammad (ﷺ) tiba di Mekah, beberapa budak lelaki dari suku Bani Abdul Muttalib pergi untuk menyambut baginda, dan Nabi Muhammad (ﷺ) memboncengkan seorang daripada mereka di hadapan baginda dan seorang lagi di belakang baginda.",
        "arabic_text": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا قَدِمَ النَّبِيُّ صلى الله عليه وسلم مَكَّةَ اسْتَقْبَلَتْهُ أُغَيْلِمَةُ بَنِي عَبْدِ الْمُطَّلِبِ، فَحَمَلَ وَاحِدًا بَيْنَ يَدَيْهِ وَآخَرَ خَلْفَهُ‏.‏"
      },
      {
        "id": 1723,
        "hadith_number": "1799",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Solat di Masjid Asy-Syajrah dan Lembah Dzul-Hulaifah Ketika Pergi dan Balik dari Mekah",
        "perawi_melayu": "Diriwayatkan oleh Ibn Umar رضی اللہ عنه:",
        "english_text": "Whenever Allah's Messenger (ﷺ) left for Mecca, he used to pray in the mosque of Ash-Shajra, and when he returned (to Medina), he used to pray in the middle of the valley of Dhul-Hulaifa and used to pass the night there till morning.",
        "malay_translation": "Setiap kali Rasulullah (ﷺ) berangkat ke Mekah, baginda biasa solat di masjid Asy-Syajrah, dan apabila baginda kembali (ke Madinah), baginda biasa solat di tengah lembah Dzul-Hulaifah dan biasa bermalam di sana hingga pagi.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ الْحَجَّاجِ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا خَرَجَ إِلَى مَكَّةَ يُصَلِّي فِي مَسْجِدِ الشَّجَرَةِ، وَإِذَا رَجَعَ صَلَّى بِذِي الْحُلَيْفَةِ بِبَطْنِ الْوَادِي وَبَاتَ حَتَّى يُصْبِحَ‏.‏"
      },
      {
        "id": 1724,
        "hadith_number": "1800",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi SAW Tidak Pulang dari Musafir pada Waktu Malam",
        "perawi_melayu": "Diriwayatkan oleh Anas RA:",
        "english_text": "The Prophet (ﷺ) never returned to his family from a journey at night. He used to return either in the morning or in the afternoon.",
        "malay_translation": "Nabi Muhammad (ﷺ) tidak pernah pulang ke keluarganya dari perjalanan pada waktu malam. Baginda biasanya pulang sama ada pada waktu pagi atau petang.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا هَمَّامٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم لاَ يَطْرُقُ أَهْلَهُ، كَانَ لاَ يَدْخُلُ إِلاَّ غُدْوَةً أَوْ عَشِيَّةً‏.‏"
      },
      {
        "id": 1725,
        "hadith_number": "1801",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Pulang ke Pangkuan Keluarga pada Waktu Malam Ketika Tiba dari Perjalanan",
        "perawi_melayu": "Diriwayatkan dari Jabir رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) forbade going to one's family at night (on arrival from a journey).",
        "malay_translation": "Nabi (ﷺ) melarang seseorang pulang ke pangkuan keluarganya pada waktu malam (ketika tiba dari perjalanan).",
        "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَارِبٍ، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ يَطْرُقَ أَهْلَهُ لَيْلاً‏.‏"
      },
      {
        "id": 1726,
        "hadith_number": "1802",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kegembiraan Rasulullah SAW Kembali ke Madinah",
        "perawi_melayu": "Diriwayatkan oleh Anas رضي الله عنه :",
        "english_text": "\"Whenever Allah's Messenger (ﷺ) returned from a journey, he, on seeing the high places of Medina, would make his she-camel proceed faster; and if it were another animal, even then he used to make it proceed faster.\" Narrated Humaid that the Prophet (ﷺ) used to make it proceed faster out of his love for Medina. Narrated Anas: As above, but mentioned the walls of Medina instead of the high places of Medina. Al-Harith bin `Umar agrees with Anas.",
        "malay_translation": "\"Setiap kali Rasulullah ﷺ kembali dari perjalanan, apabila melihat tempat-tempat tinggi di Madinah, baginda akan mempercepatkan unta betina baginda; dan jika ia adalah haiwan lain, baginda tetap akan mempercepatkannya.\" Diriwayatkan oleh Humaid bahawa Nabi ﷺ biasanya mempercepatkannya kerana cintanya kepada Madinah. Diriwayatkan oleh Anas: Sama seperti di atas, tetapi menyebut dinding-dinding Madinah dan bukannya tempat-tempat tinggi di Madinah. Al-Harith bin `Umar bersetuju dengan Anas.",
        "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ، قَالَ : أَخْبَرَنِي حُمَيْدٌ ، أَنَّهُ سَمِعَ أَنَسًا رَضِيَ اللَّهُ عَنْهُ ، يَقُولُ : كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَدِمَ مِنْ سَفَرٍ فَأَبْصَرَ دَرَجَاتِ الْمَدِينَةِ أَوْضَعَ نَاقَتَهُ ، وَإِنْ كَانَتْ دَابَّةً حَرَّكَهَا , قَالَ أَبُو عَبْد اللَّهِ : زَادَ الْحَارِثُ بْنُ عُمَيْرٍ ، عَنْ حُمَيْدٍحَرَّكَهَا مِنْ حُبِّهَا ، حَدَّثَنَا قُتَيْبَةُ ، حَدَّثَنَا إِسْمَاعِيلُ ، عَنْ حُمَيْدٍ ، عَنْ أَنَسٍ ، قَالَ جُدُرَاتِ : تَابَعَهُ الْحَارِثُ بْنُ عُمَيْرٍ."
      },
      {
        "id": 1727,
        "hadith_number": "1803",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ayat Ini Diturunkan Mengenai Kebiasaan Ansar dan Adab Masuk Rumah yang Betul",
        "perawi_melayu": "Diriwayatkan oleh Al-Bara RA:",
        "english_text": "\"The above Verse was revealed regarding us, for the Ansar on returning from Hajj never entered their houses through the proper doors but from behind. One of the Ansar came and entered through the door and he was taunted for it. Therefore, the following was revealed: -- \"It is not righteousness That you enter the houses from the back, But the righteous man is He who fears Allah, Obeys His order and keeps away from What He has forbidden So, enter houses through the proper doors.\" (2.189)",
        "malay_translation": "\"Ayat di atas diturunkan berkenaan kami, kerana kaum Ansar apabila pulang dari Haji tidak pernah memasuki rumah mereka melalui pintu yang sepatutnya tetapi dari belakang. Salah seorang dari kaum Ansar datang dan masuk melalui pintu dan dia dicemuh kerana perbuatannya itu. Oleh itu, yang berikut telah diturunkan: -- \"Bukanlah kebajikan kamu memasuki rumah dari belakang, tetapi orang yang benar adalah orang yang takut kepada Allah, mematuhi perintah-Nya dan menjauhi apa yang telah Dia haramkan. Maka, masuklah rumah melalui pintu yang sepatutnya.\" (2:189)",
        "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ ـ رضى الله عنه ـ يَقُولُ نَزَلَتْ هَذِهِ الآيَةُ فِينَا، كَانَتِ الأَنْصَارُ إِذَا حَجُّوا فَجَاءُوا لَمْ يَدْخُلُوا مِنْ قِبَلِ أَبْوَابِ بُيُوتِهِمْ، وَلَكِنْ مِنْ ظُهُورِهَا، فَجَاءَ رَجُلٌ مِنَ الأَنْصَارِ، فَدَخَلَ مِنْ قِبَلِ بَابِهِ، فَكَأَنَّهُ عُيِّرَ بِذَلِكَ، فَنَزَلَتْ ‏{‏وَلَيْسَ الْبِرُّ بِأَنْ تَأْتُوا الْبُيُوتَ مِنْ ظُهُورِهَا وَلَكِنَّ الْبِرَّ مَنِ اتَّقَى وَأْتُوا الْبُيُوتَ مِنْ أَبْوَابِهَا‏}‏‏.‏"
      },
      {
        "id": 1728,
        "hadith_number": "1804",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kesusahan Musafir dan Anjuran Kembali Segera",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah RA:",
        "english_text": "The Prophet (ﷺ) said, \"Traveling is a kind of torture as it prevents one from eating, drinking and sleeping properly. So, when one's needs are fulfilled, one should return quickly to one's family.\"",
        "malay_translation": "Nabi (ﷺ) bersabda, \"Perjalanan adalah sejenis seksaan kerana ia menghalang seseorang daripada makan, minum dan tidur dengan betul. Oleh itu, apabila keperluan seseorang dipenuhi, hendaklah dia segera kembali kepada keluarganya.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا مَالِكٌ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ السَّفَرُ قِطْعَةٌ مِنَ الْعَذَابِ، يَمْنَعُ أَحَدَكُمْ طَعَامَهُ وَشَرَابَهُ وَنَوْمَهُ، فَإِذَا قَضَى نَهْمَتَهُ فَلْيُعَجِّلْ إِلَى أَهْلِهِ ‏\"‏‏.‏"
      },
      {
        "id": 1729,
        "hadith_number": "1805",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Menggabungkan Solat Maghrib dan Isyak Ketika Musafir",
        "perawi_melayu": "Diriwayatkan oleh Zaid bin Aslam daripada bapanya:",
        "english_text": "I was with Ibn `Umar رضی اللہ عنهما on the way to Mecca, and he got the news that Safiya bint Abu Ubaid was seriously ill. So, he hastened his pace, and when the twilight disappeared, he dismounted and offered the Maghrib and `Isha' prayers together. Then he said, \"I saw that whenever the Prophet (ﷺ) had to hasten when traveling, he would delay the Maghrib prayer and join them together (i.e. offer the Maghrib and the `Isha prayers together).",
        "malay_translation": "Saya bersama Ibn `Umar رضي الله عنهما dalam perjalanan ke Mekah, dan beliau mendapat berita bahawa Safiya bint Abu Ubaid sedang sakit parah. Oleh itu, beliau mempercepatkan langkahnya, dan apabila senja hilang, beliau turun dari kenderaannya dan menunaikan solat Maghrib dan Isyak bersama-sama. Kemudian beliau berkata, \"Saya melihat bahawa setiap kali Nabi (ﷺ) perlu bergegas ketika dalam perjalanan, baginda akan melewatkan solat Maghrib dan menggabungkannya bersama (iaitu menunaikan solat Maghrib dan Isyak bersama-sama).\"",
        "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ أَخْبَرَنِي زَيْدُ بْنُ أَسْلَمَ، عَنْ أَبِيهِ، قَالَ كُنْتُ مَعَ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ بِطَرِيقِ مَكَّةَ، فَبَلَغَهُ عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ شِدَّةُ وَجَعٍ فَأَسْرَعَ السَّيْرَ، حَتَّى كَانَ بَعْدَ غُرُوبِ الشَّفَقِ نَزَلَ، فَصَلَّى الْمَغْرِبَ وَالْعَتَمَةَ، جَمَعَ بَيْنَهُمَا، ثُمَّ قَالَ إِنِّي رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم إِذَا جَدَّ بِهِ السَّيْرُ أَخَّرَ الْمَغْرِبَ، وَجَمَعَ بَيْنَهُمَا‏.‏"
      }
    ]
  }
}