{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 94,
    "data": [
      {
        "id": 5138,
        "hadith_number": "5373",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Memberi Makan kepada yang Lapar, Menziarahi Orang Sakit, dan Membebaskan Tawanan",
        "perawi_melayu": "Diriwayatkan oleh Abu Musa Al-Ash`ari رضی اللہ عنہ:",
        "english_text": "The Prophet (ﷺ) said, \"Give food to the hungry, pay a visit to the sick and release (set free) the one in captivity (by paying his ransom). Sufyan says: ''وَالْعَانِي'' means capative.",
        "malay_translation": "Nabi Muhammad (ﷺ) bersabda, \"Berilah makan kepada orang yang lapar, ziarahilah orang yang sakit dan bebaskanlah (lepaskan) tawanan (dengan membayar tebusannya). Sufyan berkata: ''وَالْعَانِي'' bermaksud tawanan.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مُوسَى الأَشْعَرِي ِّ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَطْعِمُوا الْجَائِعَ، وَعُودُوا الْمَرِيضَ، وَفُكُّوا الْعَانِيَ ‏\"‏‏.‏ قَالَ سُفْيَانُ وَالْعَانِي الأَسِيرُ‏.‏"
      },
      {
        "id": 5139,
        "hadith_number": "5374",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keluarga Nabi Muhammad SAW Tidak Pernah Kenyang Tiga Hari Berturut-turut Sehingga Wafat",
        "perawi_melayu": "Diriwayatkan oleh Abu Huraira RA:",
        "english_text": "The family of Muhammad did not eat their fill for three successive days till he died.",
        "malay_translation": "Keluarga Muhammad SAW tidak pernah makan sampai kenyang selama tiga hari berturut-turut sehingga baginda wafat.",
        "arabic_text": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ مَا شَبِعَ آلُ مُحَمَّدٍ صلى الله عليه وسلم مِنْ طَعَامٍ ثَلاَثَةَ أَيَّامٍ حَتَّى قُبِضَ‏.‏"
      },
      {
        "id": 5140,
        "hadith_number": "5375",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keadaan Abu Hurairah yang Kelaparan dan Pertemuan dengan Rasulullah SAW",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah:",
        "english_text": "Once while I was in a state of fatigue (because of severe hunger), I met 'Umar bin Al-Khattab, so I asked him to recite a verse from Allah's Book to me. He entered his house and interpreted it to me. (Then I went out and) after walking for a short distance, I fell on my face because of fatigue and severe hunger. Suddenly I saw Allah's Apostle standing by my head. He said, \"O Abu Huraira!\" I replied, \"Labbaik, O Allah's Messenger (ﷺ), and Sadaik!\" Then he held me by the hand, and made me get up. Then he came to know what I was suffering from. He took me to his house, and ordered a big bowl of milk for me. I drank thereof and he said, \"Drink more, O Abu Hirr!\" So I drank again, whereupon he again said, \"Drink more.\" So I drank more till my belly became full and looked like a bowl. Afterwards I met 'Umar and mentioned to him what had happened to me, and said to him, \"Somebody, who had more right than you, O 'Umar, took over the case. By Allah, I asked you to recite a Verse to me while I knew it better than you.\" On that Umar said to me, \"By Allah, if I admitted and entertained you, it would have been dearer to me than having nice red camels.",
        "malay_translation": "Pernah ketika saya dalam keadaan keletihan yang amat sangat (disebabkan kelaparan yang teruk), saya bertemu dengan 'Umar bin Al-Khattab, lalu saya meminta beliau untuk membacakan satu ayat daripada Kitab Allah kepada saya. Beliau masuk ke rumahnya dan mentafsirkannya untuk saya. (Kemudian saya keluar dan) setelah berjalan tidak jauh, saya jatuh tersungkur kerana keletihan dan kelaparan yang amat sangat. Tiba-tiba, saya melihat Rasulullah SAW berdiri di sisi kepala saya. Baginda bersabda, \"Wahai Abu Hurairah!\" Saya menjawab, \"Labbaik, ya Rasulullah (ﷺ), wa Sa'daik!\" Kemudian baginda memegang tangan saya, dan membangunkan saya. Kemudian baginda mengetahui apa yang saya alami. Baginda membawa saya ke rumahnya, dan memerintahkan agar disediakan semangkuk besar susu untuk saya. Saya minum daripadanya dan baginda bersabda, \"Minumlah lagi, wahai Abu Hirr!\" Saya minum lagi, dan baginda bersabda lagi, \"Minumlah lagi.\" Saya terus minum sehingga perut saya penuh dan kelihatan seperti mangkuk. Selepas itu, saya bertemu 'Umar dan menceritakan kepadanya apa yang telah berlaku kepada saya, dan berkata kepadanya, \"Seseorang yang lebih berhak daripada anda, wahai 'Umar, telah mengambil alih urusan ini.\" Demi Allah, saya meminta anda membacakan satu ayat kepada saya padahal saya lebih mengetahuinya daripada anda.\" Mendengar itu, 'Umar berkata kepada saya, \"Demi Allah, sekiranya saya menerima dan menjamu kamu ketika itu, ia pasti lebih saya sukai daripada memiliki unta merah yang terbaik.\"",
        "arabic_text": "وَعَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، أَصَابَنِي جَهْدٌ شَدِيدٌ فَلَقِيتُ عُمَرَ بْنَ الْخَطَّابِ، فَاسْتَقْرَأْتُهُ آيَةً مِنْ كِتَابِ اللَّهِ، فَدَخَلَ دَارَهُ وَفَتَحَهَا عَلَىَّ، فَمَشَيْتُ غَيْرَ بَعِيدٍ، فَخَرَرْتُ لِوَجْهِي مِنَ الْجَهْدِ وَالْجُوعِ فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَائِمٌ عَلَى رَأْسِي فَقَالَ ‏\"‏ يَا أَبَا هُرَيْرَةَ ‏\"‏‏.‏ فَقُلْتُ لَبَّيْكَ رَسُولَ اللَّهِ وَسَعْدَيْكَ‏.‏ فَأَخَذَ بِيَدِي فَأَقَامَنِي، وَعَرَفَ الَّذِي بِي، فَانْطَلَقَ بِي إِلَى رَحْلِهِ، فَأَمَرَ لِي بِعُسٍّ مِنْ لَبَنٍ فَشَرِبْتُ مِنْهُ، ثُمَّ قَالَ ‏\"‏ عُدْ يَا أَبَا هِرٍّ ‏\"‏‏.‏ فَعُدْتُ فَشَرِبْتُ، ثُمَّ قَالَ ‏\"‏ عُدْ ‏\"‏‏.‏ فَعُدْتُ فَشَرِبْتُ حَتَّى اسْتَوَى بَطْنِي فَصَارَ كَالْقِدْحِ ـ قَالَ ـ فَلَقِيتُ عُمَرَ وَذَكَرْتُ لَهُ الَّذِي كَانَ مِنْ أَمْرِي وَقُلْتُ لَهُ تَوَلَّى اللَّهُ ذَلِكَ مَنْ كَانَ أَحَقَّ بِهِ مِنْكَ يَا عُمَرُ، وَاللَّهِ لَقَدِ اسْتَقْرَأْتُكَ الآيَةَ وَلأَنَا أَقْرَأُ لَهَا مِنْكَ‏.‏ قَالَ عُمَرُ وَاللَّهِ لأَنْ أَكُونَ أَدْخَلْتُكَ أَحَبُّ إِلَىَّ مِنْ أَنْ يَكُونَ لِي مِثْلُ حُمْرِ النَّعَمِ‏.‏"
      },
      {
        "id": 5141,
        "hadith_number": "5376",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Adab Makan: Mengingati Nama Allah dan Menggunakan Tangan Kanan",
        "perawi_melayu": "Diriwayatkan daripada `Umar bin Abi Salama رضی اللہ عنہ :",
        "english_text": "I was a boy under the care of Allah's Messenger (ﷺ) and my hand used to go around the dish while I was eating. So Allah's Messenger (ﷺ) said to me, 'O boy! Mention the Name of Allah and eat with your right hand, and eat of the dish what is nearer to you.\" Since then I have applied those instructions when eating.",
        "malay_translation": "Saya seorang budak di bawah jagaan Rasulullah (ﷺ) dan tangan saya selalu mengelilingi hidangan semasa saya makan. Lalu Rasulullah (ﷺ) bersabda kepada saya, 'Wahai anak! Sebutlah nama Allah dan makanlah dengan tangan kananmu, dan makanlah dari hidangan apa yang dekat denganmu.' Sejak itu, saya telah mengamalkan arahan tersebut ketika makan.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، أَخْبَرَنَا سُفْيَانُ، قَالَ الْوَلِيدُ بْنُ كَثِيرٍ أَخْبَرَنِي أَنَّهُ، سَمِعَ وَهْبَ بْنَ كَيْسَانَ، أَنَّهُ سَمِعَ عُمَرَ بْنَ أَبِي سَلَمَةَ، يَقُولُ كُنْتُ غُلاَمًا فِي حَجْرِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَكَانَتْ يَدِي تَطِيشُ فِي الصَّحْفَةِ فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يَا غُلاَمُ سَمِّ اللَّهَ، وَكُلْ بِيَمِينِكَ وَكُلْ مِمَّا يَلِيكَ ‏\"‏‏.‏ فَمَا زَالَتْ تِلْكَ طِعْمَتِي بَعْدُ‏.‏"
      },
      {
        "id": 5142,
        "hadith_number": "5377",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Adab Makan Bersama Rasulullah (ﷺ)",
        "perawi_melayu": "Diriwayatkan oleh Siapa yang merupakan anak Ummu Salamah رضي الله عنها, isteri Nabi:",
        "english_text": "Once I ate a meal with Allah's Messenger (ﷺ) and I was eating from all sides of the dish. So Allah's Messenger (ﷺ) said to me, \"Eat of the dish what is nearer to you.\"",
        "malay_translation": "Suatu ketika aku makan bersama Rasulullah (ﷺ) dan aku makan dari segenap penjuru hidangan. Maka Rasulullah (ﷺ) bersabda kepadaku, \"Makanlah dari hidangan apa yang dekat denganmu.\"",
        "arabic_text": "حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ الدِّيلِيِّ، عَنْ وَهْبِ بْنِ كَيْسَانَ أَبِي نُعَيْمٍ، عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ ـ وَهْوَ ابْنُ أُمِّ سَلَمَةَ ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَ أَكَلْتُ يَوْمًا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم طَعَامًا فَجَعَلْتُ آكُلُ مِنْ نَوَاحِي الصَّحْفَةِ فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كُلْ مِمَّا يَلِيكَ ‏\"‏‏.‏"
      },
      {
        "id": 5143,
        "hadith_number": "5378",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Adab Makan: Membaca Bismillah dan Makan dari Depan",
        "perawi_melayu": "Diriwayatkan oleh Wahb bin Kaisan Abi Nu'aim:",
        "english_text": "A meal was brought to Allah's Messenger (ﷺ) while his step-son, `Umar bin Abi Salama رضی اللہ عنہ was with him. Allah's Messenger (ﷺ) said to him, \"Mention the Name of Allah and eat of the dish what is nearer to you.\"",
        "malay_translation": "Satu hidangan makanan dihidangkan kepada Rasulullah (ﷺ) ketika bersama anak tirinya, `Umar bin Abi Salama رضی اللہ عنہ. Rasulullah (ﷺ) bersabda kepadanya, \"Sebutlah nama Allah dan makanlah dari hidangan yang paling dekat denganmu.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ وَهْبِ بْنِ كَيْسَانَ أَبِي نُعَيْمٍ، قَالَ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِطَعَامٍ وَمَعَهُ رَبِيبُهُ عُمَرُ بْنُ أَبِي سَلَمَةَ فَقَالَ ‏ \"‏ سَمِّ اللَّهَ، وَكُلْ مِمَّا يَلِيكَ ‏\"‏‏.‏"
      },
      {
        "id": 5144,
        "hadith_number": "5379",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Menghadiri Jemputan Tukang Jahit dan Adab Makan",
        "perawi_melayu": "Diriwayatkan daripada Anas bin Malik رضی اللہ عنہ :",
        "english_text": "A tailor invited Allah's Messenger (ﷺ) to a meal which he had prepared. Hadrat Anas رضی اللہ عنہ says that I went along with Allah's Messenger (ﷺ) and saw him seeking to eat the pieces of gourd from the various sides of the dish. Since that day I have liked to eat gourd. `Umar bin Abi Salama said: The Prophet, said to me, \"Eat with your right hand.\"",
        "malay_translation": "Seorang tukang jahit menjemput Rasulullah ﷺ ke suatu jamuan makan yang telah disediakan. Hadrat Anas رضی اللہ عنہ berkata bahawa aku pergi bersama Rasulullah ﷺ dan melihat baginda mengambil dan makan kepingan labu dari pelbagai sisi hidangan tersebut. Sejak hari itu, aku suka makan labu. `Umar bin Abi Salama berkata: Nabi SAW bersabda kepada aku, \"Makanlah dengan tangan kananmu.\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ إِنَّ خَيَّاطًا دَعَا رَسُولَ اللَّهِ صلى الله عليه وسلم لِطَعَامٍ صَنَعَهُ ـ قَالَ أَنَسٌ ـ فَذَهَبْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَرَأَيْتُهُ يَتَتَبَّعُ الدُّبَّاءَ مِنْ حَوَالَىِ الْقَصْعَةِ ـ قَالَ ـ فَلَمْ أَزَلْ أُحِبُّ الدُّبَّاءَ مِنْ يَوْمِئِذٍ‏.‏"
      },
      {
        "id": 5145,
        "hadith_number": "5380",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kecintaan Nabi ﷺ Memulakan Perkara dari Sebelah Kanan",
        "perawi_melayu": "Diriwayatkan oleh `Aisha رضي الله عنها :",
        "english_text": "The Prophet (ﷺ) used to love to start doing things from the right side whenever possible, in performing ablution, putting on his shoes, and combing his hair. (Al-Ash'ath said: The Prophet (ﷺ) used to do so in all his affairs.)",
        "malay_translation": "Nabi ﷺ amat gemar memulakan sesuatu dari sebelah kanan bila berupaya, seperti ketika berwudhu', memakai kasut, dan menyisir rambut. (Al-Ash'ath berkata: Nabi ﷺ melakukannya dalam semua urusannya.)",
        "arabic_text": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا شُعْبَةُ، عَنْ أَشْعَثَ، عَنْ أَبِيهِ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُحِبُّ التَّيَمُّنَ مَا اسْتَطَاعَ فِي طُهُورِهِ وَتَنَعُّلِهِ وَتَرَجُّلِهِ‏.‏ وَكَانَ قَالَ بِوَاسِطٍ قَبْلَ هَذَا فِي شَأْنِهِ كُلِّهِ‏.‏"
      },
      {
        "id": 5146,
        "hadith_number": "5381",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Pemberian Makan oleh Nabi SAW kepada 80 Orang",
        "perawi_melayu": "Diriwayatkan daripada Anas bin Malik رضي الله عنه:",
        "english_text": "Abu Talha رضی اللہ عنہ said to Um Sulaim رضی اللہ عنہا , \"I have heard the voice of Allah's Messenger (ﷺ) which was feeble, and I think that he is hungry. Have you got something (to eat)?\" She took out some loaves of barley bread, then took her face-covering sheet and wrapped the bread in part of it, and pushed it under my garment and turned the rest of it around my body and sent me to Allah's Messenger (ﷺ) . I went with that, and found Allah's Messenger (ﷺ) in the mosque with some people. I stood up near them, and Allah's Messenger (ﷺ) asked me, \"Have you been sent by Abu Talha رضی اللہ عنہا ?\" I said, \"Yes.\" He asked, \"With some food (for us)?\" I said, \"Yes.\" Then Allah's Messenger (ﷺ) said to all those who were with him, \"Get up!\" He set out (and all the people accompanied him) and I proceeded ahead of them till I came to Abu Talha رضی اللہ عنہا . Abu Talha رضی اللہ عنہا  then said, \"O Um Sulaim! Allah's Messenger (ﷺ) has arrived along with the people, and we do not have food enough to feed them all.\" She said, \"Allah and His Apostle know better.\" So Abu Talha رضی اللہ عنہا went out till he met Allah's Messenger (ﷺ). Then Abu Talha رضی اللہ عنہا and Allah's Messenger (ﷺ) came and entered the house. Allah's Apostle said, \"Um Sulaim! Bring whatever you have.\" She brought that very bread. The Prophet (ﷺ) ordered that it be crushed into small pieces, and Um Sulaim رضی اللہ عنہا pressed a skin of butter on it. Then Allah's Apostle said whatever Allah wished him to say (to bless the food) and then added, \"Admit ten (men).\" So they were admitted, ate their fill and went out. The Prophet (ﷺ) then said, \"Admit ten (more).\" They were admitted, ate their full, and went out. He then again said, \"Admit ten more!\" They were admitted, ate their fill, and went out. He admitted ten more, and so all those people ate their fill, and they were eighty men.",
        "malay_translation": "Abu Talha رضي الله عنه berkata kepada Ummu Sulaim رضي الله عنها, \"Saya mendengar suara Rasulullah ﷺ lemah, dan saya rasa baginda lapar. Adakah kamu mempunyai sesuatu (untuk dimakan)?\" Beliau mengeluarkan beberapa roti barli, kemudian mengambil kain penutup muka beliau dan membalut roti itu dengan sebahagian daripadanya, dan menyelitkannya di bawah pakaian saya serta membalut selebihnya di sekeliling badan saya dan menghantar saya kepada Rasulullah ﷺ. Saya pergi dengan itu, dan mendapati Rasulullah ﷺ di masjid bersama beberapa orang. Saya berdiri berhampiran dengan mereka, dan Rasulullah ﷺ bertanya kepada saya, \"Adakah kamu diutus oleh Abu Talha رضي الله عنه?\" Saya berkata, \"Ya.\" Baginda bertanya, \"Dengan sedikit makanan (untuk kami)?\" Saya berkata, \"Ya.\" Kemudian Rasulullah ﷺ berkata kepada semua orang yang bersama baginda, \"Bangunlah!\" Baginda berangkat (dan semua orang mengiringi baginda) dan saya berjalan di hadapan mereka sehingga saya sampai kepada Abu Talha رضي الله عنه. Abu Talha رضي الله عنه kemudian berkata, \"Wahai Ummu Sulaim! Rasulullah ﷺ telah tiba bersama orang ramai, dan kita tidak mempunyai makanan yang cukup untuk memberi makan kepada mereka semua.\" Beliau berkata, \"Allah dan Rasul-Nya lebih mengetahui.\" Maka Abu Talha رضي الله عنه keluar sehingga beliau bertemu Rasulullah ﷺ. Kemudian Abu Talha رضي الله عنه dan Rasulullah ﷺ datang dan masuk ke dalam rumah. Rasulullah ﷺ berkata, \"Ummu Sulaim! Bawalah apa sahaja yang kamu ada.\" Beliau membawa roti itu. Nabi ﷺ memerintahkan supaya roti itu dihancurkan kepada kepingan kecil, dan Ummu Sulaim رضي الله عنها menekan kulit mentega di atasnya. Kemudian Rasulullah ﷺ mengucapkan apa sahaja yang Allah kehendaki baginda ucapkan (untuk memberkati makanan) dan kemudian menambah, \"Jemput sepuluh (orang).\" Jadi mereka dijemput, makan hingga kenyang dan keluar. Nabi ﷺ kemudian berkata, \"Jemput sepuluh (lagi).\" Mereka dijemput, makan hingga kenyang, dan keluar. Baginda kemudian berkata lagi, \"Jemput sepuluh lagi!\" Mereka dijemput, makan hingga kenyang, dan keluar. Baginda menjemput sepuluh lagi, dan dengan itu semua orang itu makan hingga kenyang, dan mereka berjumlah lapan puluh orang.",
        "writerName": "Imam Bukhari",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ أَبُو طَلْحَةَ لأُمِّ سُلَيْمٍ لَقَدْ سَمِعْتُ صَوْتَ، رَسُولِ اللَّهِ صلى الله عليه وسلم ضَعِيفًا أَعْرِفُ فِيهِ الْجُوعَ، فَهَلْ عِنْدَكِ مِنْ شَىْءٍ فَأَخْرَجَتْ أَقْرَاصًا مِنْ شَعِيرٍ، ثُمَّ أَخْرَجَتْ خِمَارًا لَهَا فَلَفَّتِ الْخُبْزَ بِبَعْضِهِ، ثُمَّ دَسَّتْهُ تَحْتَ ثَوْبِي وَرَدَّتْنِي بِبَعْضِهِ، ثُمَّ أَرْسَلَتْنِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ فَذَهَبْتُ بِهِ فَوَجَدْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي الْمَسْجِدِ وَمَعَهُ النَّاسُ، فَقُمْتُ عَلَيْهِمْ فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَرْسَلَكَ أَبُو طَلْحَةَ ‏\"‏‏.‏ فَقُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ بِطَعَامٍ ‏\"‏‏.‏ قَالَ فَقُلْتُ نَعَمْ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِمَنْ مَعَهُ ‏\"‏ قُومُوا ‏\"‏‏.‏ فَانْطَلَقَ وَانْطَلَقْتُ بَيْنَ أَيْدِيهِمْ حَتَّى جِئْتُ أَبَا طَلْحَةَ، فَقَالَ أَبُو طَلْحَةَ يَا أُمَّ سُلَيْمٍ قَدْ جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالنَّاسِ، وَلَيْسَ عِنْدَنَا مِنَ الطَّعَامِ مَا نُطْعِمُهُمْ‏.‏ فَقَالَتِ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ فَانْطَلَقَ أَبُو طَلْحَةَ حَتَّى لَقِيَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَقْبَلَ أَبُو طَلْحَةَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى دَخَلاَ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلُمِّي يَا أُمَّ سُلَيْمٍ مَا عِنْدَكِ ‏\"‏‏.‏ فَأَتَتْ بِذَلِكَ الْخُبْزِ فَأَمَرَ بِهِ فَفُتَّ وَعَصَرَتْ أُمُّ سُلَيْمٍ عُكَّةً لَهَا فَأَدَمَتْهُ، ثُمَّ قَالَ فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم مَا شَاءَ اللَّهُ أَنْ يَقُولَ ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ ‏\"‏‏.‏ فَأَذِنَ لَهُمْ، فَأَكَلُوا حَتَّى شَبِعُوا، ثُمَّ خَرَجُوا، ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ ‏\"‏‏.‏ فَأَذِنَ لَهُمْ فَأَكَلُوا حَتَّى شَبِعُوا، ثُمَّ خَرَجُوا، ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ ‏\"‏‏.‏ فَأَذِنَ لَهُمْ فَأَكَلُوا حَتَّى شَبِعُوا ثُمَّ خَرَجُوا، ثُمَّ أَذِنَ لِعَشَرَةٍ، فَأَكَلَ الْقَوْمُ كُلُّهُمْ وَشَبِعُوا، وَالْقَوْمُ ثَمَانُونَ رَجُلاً‏.‏"
      },
      {
        "id": 5147,
        "hadith_number": "5382",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Nabi ﷺ dan Seratus Tiga Puluh Sahabat",
        "perawi_melayu": "Diriwayatkan oleh 'Abdur-Rahman bin Abu Bakr رضي الله عنهما:",
        "english_text": "We were one hundred and thirty men sitting with the Prophet. The Prophet (ﷺ) said, \"Have anyone of you any food with him?\" It happened that one man had one Sa of wheat flour (or so) which was turned into dough then. After a while a tall lanky pagan came, driving some sheep. The Prophet (ﷺ) asked, 'Will you sell us (a sheep), or give (it to) us as a gift?\" The pagan said, \"No, but I will sell it \" So the Prophet bought from him a sheep which was slaughtered, and then the Prophet (ﷺ) ordered that the liver, the kidneys, lungs and heart, etc., of that sheep be roasted. By Allah, none of those one hundred and thirty men but had his share of those things. The Prophet (ﷺ) gave to those who were present, and also kept a share for those who were absent He then served that cooked sheep in two big trays and we all ate together our fill; yet there remained a part of it in those two trays which I carried on the camel.",
        "malay_translation": "Kami seramai seratus tiga puluh orang lelaki sedang duduk bersama Nabi ﷺ. Nabi ﷺ bersabda, \"Adakah sesiapa antara kamu mempunyai makanan?\" Kebetulan ada seorang lelaki mempunyai satu *Sa'* tepung gandum (atau lebih kurang) yang kemudiannya dijadikan doh. Tidak lama kemudian datang seorang lelaki kafir yang tinggi dan kurus, sedang menggembala beberapa ekor kambing. Nabi ﷺ bertanya, 'Adakah kamu mahu menjual (seekor kambing) kepada kami, atau memberikannya sebagai hadiah?\" Lelaki kafir itu berkata, \"Tidak, tetapi saya akan menjualnya.\" Maka Nabi ﷺ membeli daripadanya seekor kambing yang kemudiannya disembelih, dan kemudian Nabi ﷺ memerintahkan agar hati, buah pinggang, paru-paru dan jantung, dan lain-lain daripada kambing itu dipanggang. Demi Allah, tidak seorang pun daripada seratus tiga puluh orang lelaki itu melainkan mendapat bahagiannya daripada perkara-perkara tersebut. Nabi ﷺ memberi kepada mereka yang hadir, dan juga menyimpan bahagian untuk mereka yang tidak hadir. Kemudian baginda menghidangkan kambing yang dimasak itu dalam dua dulang besar dan kami semua makan bersama-sama sehingga kenyang; namun masih ada sebahagian daripadanya yang tinggal dalam kedua-dua dulang itu yang saya bawa di atas unta.",
        "arabic_text": "حَدَّثَنَا مُوسَى، حَدَّثَنَا مُعْتَمِرٌ، عَنْ أَبِيهِ، قَالَ وَحَدَّثَ أَبُو عُثْمَانَ، أَيْضًا عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ ـ رضى الله عنهما ـ قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم ثَلاَثِينَ وَمِائَةً، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هَلْ مَعَ أَحَدٍ مِنْكُمْ طَعَامٌ ‏\"‏‏.‏ فَإِذَا مَعَ رَجُلٍ صَاعٌ مِنْ طَعَامٍ أَوْ نَحْوُهُ، فَعُجِنَ، ثُمَّ جَاءَ رَجُلٌ مُشْرِكٌ مُشْعَانٌّ طَوِيلٌ بِغَنَمٍ يَسُوقُهَا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَبَيْعٌ أَمْ عَطِيَّةٌ أَوْ ـ قَالَ ـ هِبَةٌ ‏\"‏‏.‏ قَالَ لاَ بَلْ بَيْعٌ‏.‏ قَالَ فَاشْتَرَى مِنْهُ شَاةً فَصُنِعَتْ، فَأَمَرَ نَبِيُّ اللَّهِ صلى الله عليه وسلم بِسَوَادِ الْبَطْنِ يُشْوَى، وَايْمُ اللَّهِ مَا مِنَ الثَّلاَثِينَ وَمِائَةٍ إِلاَّ قَدْ حَزَّ لَهُ حُزَّةً مِنْ سَوَادِ بَطْنِهَا، إِنْ كَانَ شَاهِدًا أَعْطَاهَا إِيَّاهُ، وَإِنْ كَانَ غَائِبًا خَبَأَهَا لَهُ، ثُمَّ جَعَلَ فِيهَا قَصْعَتَيْنِ فَأَكَلْنَا أَجْمَعُونَ وَشَبِعْنَا، وَفَضَلَ فِي الْقَصْعَتَيْنِ، فَحَمَلْتُهُ عَلَى الْبَعِيرِ‏.‏ أَوْ كَمَا قَالَ‏.‏"
      },
      {
        "id": 5148,
        "hadith_number": "5383",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi (ﷺ) Wafat ketika Kami Kenyang dengan Dua Perkara Hitam",
        "perawi_melayu": "Diriwayatkan daripada `Aishah رضی اللہ عنہا :",
        "english_text": "The Prophet (ﷺ) died when we had satisfied our hunger with the two black things, i.e. dates and water.",
        "malay_translation": "Nabi (ﷺ) wafat ketika kami telah menghilangkan rasa lapar dengan dua perkara hitam, iaitu kurma dan air.",
        "arabic_text": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا مَنْصُورٌ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ تُوُفِّيَ النَّبِيُّ صلى الله عليه وسلم حِينَ شَبِعْنَا مِنَ الأَسْوَدَيْنِ التَّمْرِ وَالْمَاءِ‏.‏"
      },
      {
        "id": 5149,
        "hadith_number": "5384",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perjalanan ke Khaibar dan Solat Maghrib tanpa Wudhu",
        "perawi_melayu": "Diriwayatkan oleh Suwaid bin An-Nu`man رضی اللہ عنہ :",
        "english_text": "We went out with Allah's Messenger (ﷺ) to Khaibar, and when we were at As-Sahba', (Yahya, a sub-narrator said, \"As-Sahba' is a place at a distance of one day's journey to Khaibar).\" Allah's Messenger (ﷺ) asked the people to bring their food, but there was nothing with the people except Sawiq. So we all chewed and ate of it. Then the Prophet (ﷺ) asked for some water and he rinsed his mouth, and we too, rinsed our mouths. Then he led us in the Maghrib prayer without performing ablution (again). Sufyan, the transmitter, says that he heard this Hadith from Yahya from start to the end.",
        "malay_translation": "Kami keluar bersama Rasulullah (ﷺ) ke Khaibar, dan ketika kami berada di As-Sahba', (Yahya, seorang perawi tambahan berkata, \"As-Sahba' adalah tempat yang jaraknya perjalanan sehari ke Khaibar.\") Rasulullah (ﷺ) meminta orang ramai membawa makanan mereka, tetapi tiada apa-apa dengan orang ramai melainkan Sawiq. Jadi, kami semua mengunyah dan memakannya. Kemudian Nabi (ﷺ) meminta sedikit air dan baginda berkumur, dan kami juga berkumur. Kemudian baginda memimpin kami dalam solat Maghrib tanpa berwudhu (lagi). Sufyan, perawi, berkata bahawa dia mendengar Hadith ini daripada Yahya dari awal hingga akhir.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ يَحْيَى بْنُ سَعِيدٍ سَمِعْتُ بُشَيْرَ بْنَ يَسَارٍ، يَقُولُ حَدَّثَنَا سُوَيْدُ بْنُ النُّعْمَانِ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى خَيْبَرَ، فَلَمَّا كُنَّا بِالصَّهْبَاءِ ـ قَالَ يَحْيَى وَهْىَ مِنْ خَيْبَرَ عَلَى رَوْحَةٍ ـ دَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِطَعَامٍ، فَمَا أُتِيَ إِلاَّ بِسَوِيقٍ، فَلُكْنَاهُ فَأَكَلْنَا مِنْهُ، ثُمَّ دَعَا بِمَاءٍ فَمَضْمَضَ وَمَضْمَضْنَا، فَصَلَّى بِنَا الْمَغْرِبَ وَلَمْ يَتَوَضَّأْ‏.‏ قَالَ سُفْيَانُ سَمِعْتُهُ مِنْهُ عَوْدًا وَبَدْءًا‏.‏"
      },
      {
        "id": 5150,
        "hadith_number": "5385",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi ﷺ Tidak Memakan Roti Tipis dan Kambing Panggang",
        "perawi_melayu": "Diriwayatkan oleh Qatada:",
        "english_text": "We were in the company of Anas رضی اللہ عنہ whose baker was with him. Anas said, The Prophet (ﷺ) did not eat thin bread, or a roasted sheep till he met Allah (died).",
        "malay_translation": "Kami berada dalam kalangan Anas رضي الله عنه yang tukang roti bersamanya. Anas berkata, Nabi ﷺ tidak memakan roti tipis, atau kambing panggang sehinggalah baginda bertemu Allah (wafat).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، قَالَ كُنَّا عِنْدَ أَنَسٍ وَعِنْدَهُ خَبَّازٌ لَهُ فَقَالَ مَا أَكَلَ النَّبِيُّ صلى الله عليه وسلم خُبْزًا مُرَقَّقًا وَلاَ شَاةً مَسْمُوطَةً حَتَّى لَقِيَ اللَّهَ‏.‏"
      },
      {
        "id": 5151,
        "hadith_number": "5386",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Makan Nabi ﷺ",
        "perawi_melayu": "Diriwayatkan oleh Anas رضي الله عنه :",
        "english_text": "To the best of my knowledge, the Prophet (ﷺ) did not take his meals in a big tray at all, nor did he ever eat well-baked thin bread, nor did he ever eat at a dining table.",
        "malay_translation": "Setahu saya, Nabi ﷺ tidak pernah makan hidangan dalam dulang besar sama sekali, tidak juga pernah makan roti nipis yang dibakar dengan baik, dan tidak juga pernah makan di meja makan.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ يُونُسَ ـ قَالَ عَلِيٌّ هُوَ الإِسْكَافُ ـ عَنْ قَتَادَةَ، عَنْ أَنَسٍ، رضى الله عنه قَالَ مَا عَلِمْتُ النَّبِيَّ صلى الله عليه وسلم أَكَلَ عَلَى سُكُرُّجَةٍ قَطُّ، وَلاَ خُبِزَ لَهُ مُرَقَّقٌ قَطُّ، وَلاَ أَكَلَ عَلَى خِوَانٍ‏.‏ قِيلَ لِقَتَادَةَ فَعَلَى مَا كَانُوا يَأْكُلُونَ قَالَ عَلَى السُّفَرِ‏.‏"
      },
      {
        "id": 5152,
        "hadith_number": "5387",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perkahwinan Nabi (ﷺ) dengan Safiyya dan Walimatul Urus",
        "perawi_melayu": "Diriwayatkan daripada Anas رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) had consummate his marriage with Safiyya رضی اللہ عنہا . I invited the Muslims to his wedding banquet. He ordered that leather dining sheets be spread. Then dates, dried yoghurt and butter were put on those sheets. Anas رضی اللہ عنہ added: The Prophet (ﷺ) consummated his marriage with Safiyya رضی اللہ عنہا (during a journey) whereupon Hais (sweet dish) was served on a leather dining sheet.",
        "malay_translation": "Nabi (ﷺ) telah menyempurnakan perkahwinan baginda dengan Safiyya رضی اللہ عنہا. Aku menjemput kaum Muslimin ke majlis walimatul urusnya. Baginda memerintahkan agar hamparan kulit dihidangkan. Kemudian, kurma, dadih kering dan mentega diletakkan di atas hamparan itu. Anas رضی اللہ عنہ menambah: Nabi (ﷺ) menyempurnakan perkahwinan baginda dengan Safiyya رضی اللہ عنہا (semasa dalam perjalanan) lalu Hais (sejenis hidangan manis) dihidangkan di atas hamparan kulit.",
        "arabic_text": "حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، أَخْبَرَنِي حُمَيْدٌ، أَنَّهُ سَمِعَ أَنَسًا، يَقُولُ قَامَ النَّبِيُّ صلى الله عليه وسلم يَبْنِي بِصَفِيَّةَ فَدَعَوْتُ الْمُسْلِمِينَ إِلَى وَلِيمَتِهِ أَمَرَ بِالأَنْطَاعِ فَبُسِطَتْ فَأُلْقِيَ عَلَيْهَا التَّمْرُ وَالأَقِطُ وَالسَّمْنُ‏.‏ وَقَالَ عَمْرٌو عَنْ أَنَسٍ بَنَى بِهَا النَّبِيُّ صلى الله عليه وسلم ثُمَّ صَنَعَ حَيْسًا فِي نِطَعٍ‏.‏"
      },
      {
        "id": 5153,
        "hadith_number": "5388",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keberanian Abdullah bin Az-Zubair Menghadapi Ejekan",
        "perawi_melayu": "Diriwayatkan oleh Wahb bin Kaisan:",
        "english_text": "The People of Sham taunted `Abdullah bin Az-Zubair رضي اللہ عنہما by calling him \"The son of Dhatin-Nataqain\" (the woman who has two waist-belts). (His mother) (Asma رضي اللہ عنہا , said to him, \"O my son! They taunt you with \"Nataqain\". Do you know what the Nataqain were? That was my waist-belt which I divided in two parts. I tied the water skin of Allah's Messenger (ﷺ) with one part, and with the other part I tied his food container.\" (So the prophet ﷺ styled me with it) The reporter says that henceforth when the Syrian taunted Hadrat Abdullah about the two drawstrings, he would say: By Allah! They are true but what they taunt me about me about is a matter of pride for me.",
        "malay_translation": "Penduduk Syam mengejek `Abdullah bin Az-Zubair رضي اللہ عنہما dengan memanggilnya \"Anak Dhatin-Nataqain\" (wanita yang mempunyai dua tali pinggang). (Ibunya) (Asma رضي اللہ عنہا , berkata kepadanya, \"Wahai anakku! Mereka mengejekmu dengan \"Nataqain\". Tahukah kamu apakah Nataqain itu? Itu adalah tali pinggangku yang aku bahagikan kepada dua bahagian. Aku mengikat bekas air Rasulullah (ﷺ) dengan satu bahagian, dan dengan bahagian yang lain aku mengikat bekas makanannya.\" (Maka Nabi ﷺ memanggilku dengan panggilan itu) Perawi berkata bahawa selepas itu apabila orang Syria mengejek Hadrat Abdullah tentang dua tali pinggang itu, dia akan berkata: Demi Allah! Mereka adalah benar tetapi apa yang mereka ejek tentangku adalah satu kebanggaan bagiku.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، وَعَنْ وَهْبِ بْنِ كَيْسَانَ، قَالَ كَانَ أَهْلُ الشَّأْمِ يُعَيِّرُونَ ابْنَ الزُّبَيْرِ يَقُولُونَ يَا ابْنَ ذَاتِ النِّطَاقَيْنِ‏.‏ فَقَالَتْ لَهُ أَسْمَاءُ يَا بُنَىَّ إِنَّهُمْ يُعَيِّرُونَكَ بِالنِّطَاقَيْنِ، هَلْ تَدْرِي مَا كَانَ النِّطَاقَانِ إِنَّمَا كَانَ نِطَاقِي شَقَقْتُهُ نِصْفَيْنِ، فَأَوْكَيْتُ قِرْبَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِأَحَدِهِمَا، وَجَعَلْتُ فِي سُفْرَتِهِ آخَرَ، قَالَ فَكَانَ أَهْلُ الشَّأْمِ إِذَا عَيَّرُوهُ بِالنِّطَاقَيْنِ يَقُولُ إِيهًا وَالإِلَهْ‏.‏ تِلْكَ شَكَاةٌ ظَاهِرٌ عَنْكَ عَارُهَا‏.‏"
      },
      {
        "id": 5154,
        "hadith_number": "5389",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi SAW Menolak Mastigures yang Dihidangkan",
        "perawi_melayu": "Diriwayatkan oleh Ibnu `Abbas رضی اللہ عنہما :",
        "english_text": "His aunt, Um Hufaid bint Al-Harith bin Hazn رضی اللہ عنہا , presented to the Prophet (ﷺ) butter, dried yoghurt and mastigures. The Prophet (ﷺ) invited the people to those mastigures and they were eaten on his dining sheet, but the Prophet (ﷺ) did not eat of it, as if he disliked it. Nevertheless. if it was unlawful to eat that, the people would not have eaten it on the dining sheet of the Prophet (ﷺ) nor would he have ordered that they be eaten.",
        "malay_translation": "Mak saudaranya, Um Hufaid bint Al-Harith bin Hazn رضی اللہ عنہا , menghidangkan kepada Nabi (ﷺ) mentega, yogurt kering, dan mastigures. Nabi (ﷺ) menjemput orang ramai kepada mastigures tersebut dan mereka memakannya di atas hamparannya, tetapi Nabi (ﷺ) tidak memakannya, seolah-olah baginda tidak menyukainya. Walau bagaimanapun, jika haram untuk memakannya, orang ramai tidak akan memakannya di atas hamparan Nabi (ﷺ) dan baginda juga tidak akan memerintahkan mereka untuk memakannya.",
        "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ أُمَّ حُفَيْدٍ بِنْتَ الْحَارِثِ بْنِ حَزْن ٍ ـ خَالَةَ ابْنِ عَبَّاسٍ ـ أَهْدَتْ إِلَى النَّبِيِّ صلى الله عليه وسلم سَمْنًا وَأَقِطًا وَأَضُبًّا، فَدَعَا بِهِنَّ فَأُكِلْنَ عَلَى مَائِدَتِهِ، وَتَرَكَهُنَّ النَّبِيُّ صلى الله عليه وسلم كَالْمُسْتَقْذِرِ لَهُنَّ، وَلَوْ كُنَّ حَرَامًا مَا أُكِلْنَ عَلَى مَائِدَةِ النَّبِيِّ صلى الله عليه وسلم وَلاَ أَمَرَ بِأَكْلِهِنَّ‏.‏"
      },
      {
        "id": 5155,
        "hadith_number": "5390",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi ﷺ Bersolat Maghrib Selepas Makan Sawiq Tanpa Berwudhu' Semula",
        "perawi_melayu": "Diriwayatkan oleh Suwaid bin An-Nu`man رضی اللہ عنہ :",
        "english_text": "While they were with the Prophet (ﷺ) at As-Sahba' which was at a distance of one day's journey from Khaibar the prayer became due, and the Prophet (ﷺ) asked the people for food but there was nothing with the people except Sawiq. He ate of it and we ate along with him, and then he asked for water and rinsed his mouth (with it), and then offered the (Maghrib) prayer and we too offered the prayer but the Prophet did not perform ablution (again after eating the Sawiq.).",
        "malay_translation": "Ketika mereka bersama Nabi ﷺ di As-Sahba', yang jaraknya sehari perjalanan dari Khaibar, waktu solat telah tiba. Nabi ﷺ meminta makanan daripada orang ramai, tetapi tiada apa-apa makanan bersama mereka kecuali Sawiq. Baginda memakannya dan kami juga makan bersamanya. Kemudian, baginda meminta air dan berkumur (dengannya), lalu menunaikan solat (Maghrib) dan kami juga menunaikan solat, tetapi Nabi tidak berwudhu' (semula selepas makan Sawiq).",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ يَحْيَى، عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ سُوَيْدِ بْنِ النُّعْمَانِ، أَنَّهُ أَخْبَرَهُ أَنَّهُمْ، كَانُوا مَعَ النَّبِيِّ صلى الله عليه وسلم بِالصَّهْبَاءِ ـ وَهْىَ عَلَى رَوْحَةٍ مِنْ خَيْبَرَ ـ فَحَضَرَتِ الصَّلاَةُ، فَدَعَا بِطَعَامٍ فَلَمْ يَجِدْهُ إِلاَّ سَوِيقًا، فَلاَكَ مِنْهُ فَلُكْنَا مَعَهُ، ثُمَّ دَعَا بِمَاءٍ فَمَضْمَضَ، ثُمَّ صَلَّى وَصَلَّيْنَا، وَلَمْ يَتَوَضَّأْ‏.‏"
      },
      {
        "id": 5156,
        "hadith_number": "5391",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Rasulullah (ﷺ) dan Dhab (Mastigure)",
        "perawi_melayu": "Diriwayatkan oleh Khalid bin Al-Walid رضی اللہ عنہ :",
        "english_text": "He went with Allah's Messenger (ﷺ) to the house of Maimuna رضی اللہ عنہا , who was his and Ibn `Abbas' رضی اللہ عنہما aunt. He found with her a roasted mastigure which her sister Hufaida bint Al-Harith  رضی اللہ عنہا had brought from Najd. Maimuna presented the mastigure before Allah's Messenger (ﷺ) who rarely started eating any (unfamiliar) food before it was described and named for him. (But that time) Allah's Messenger (ﷺ) stretched his hand towards the (meat of the) mastigure whereupon a lady from among those who were present, said, \"You should inform Allah's Messenger (ﷺ) of what you have presented to him. O Allah's Messenger (ﷺ)! It is the meat of a mastigure.\" (On learning that) Allah's Messenger (ﷺ) withdrew his hand from the meat of the mastigure. Khalid bin Al-Walid رضی اللہ عنہ said, \"O Allah's Messenger (ﷺ)! Is this unlawful to eat?\" Allah's Messenger (ﷺ) replied, \"No, but it is not found in the land of my people, so I do not like it.\" Khalid رضی اللہ عنہ said, \"Then I pulled the mastigure (meat) towards me and ate it while Allah's Messenger (ﷺ) was looking at me.",
        "malay_translation": "Beliau pergi bersama Rasulullah (ﷺ) ke rumah Maimuna رضی اللہ عنہا , yang merupakan ibu saudara beliau dan Ibn `Abbas رضی اللہ عنہما . Beliau mendapati bersamanya seekor dhab (mastigure) yang telah dipanggang yang dibawa oleh saudaranya Hufaida bint Al-Harith  رضی اللہ عنہا dari Najd. Maimuna menghidangkan dhab tersebut di hadapan Rasulullah (ﷺ) yang jarang memulakan makan apa-apa makanan (yang tidak dikenali) sebelum ia diterangkan dan dinamakan kepadanya. (Tetapi pada waktu itu) Rasulullah (ﷺ) menghulurkan tangan ke arah (daging) dhab itu, kemudian seorang wanita dari kalangan mereka yang hadir berkata, \"Hendaklah kamu memberitahu Rasulullah (ﷺ) tentang apa yang telah kamu hidangkan kepadanya. Wahai Rasulullah (ﷺ)! Ia adalah daging dhab.\" (Setelah mengetahuinya) Rasulullah (ﷺ) menarik tangannya dari daging dhab itu. Khalid bin Al-Walid رضی اللہ عنہ berkata, \"Wahai Rasulullah (ﷺ)! Adakah ini haram untuk dimakan?\" Rasulullah (ﷺ) menjawab, \"Tidak, tetapi ia tidak terdapat di tanah kaumku, oleh itu aku tidak menyukainya.\" Khalid رضی اللہ عنہ berkata, \"Kemudian saya menarik dhab (daging) itu ke arah saya dan memakannya sementara Rasulullah (ﷺ) sedang melihat saya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو أُمَامَةَ بْنُ سَهْلِ بْنِ حُنَيْفٍ الأَنْصَارِيُّ، أَنَّ ابْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّ خَالِدَ بْنَ الْوَلِيدِ الَّذِي يُقَالُ لَهُ سَيْفُ اللَّهِ أَخْبَرَهُ أَنَّهُ، دَخَلَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى مَيْمُونَةَ ـ وَهْىَ خَالَتُهُ وَخَالَةُ ابْنِ عَبَّاسٍ ـ فَوَجَدَ عِنْدَهَا ضَبًّا مَحْنُوذًا، قَدِمَتْ بِهِ أُخْتُهَا حُفَيْدَةُ بِنْتُ الْحَارِثِ مِنْ نَجْدٍ، فَقَدَّمَتِ الضَّبَّ لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَكَانَ قَلَّمَا يُقَدِّمُ يَدَهُ لِطَعَامٍ حَتَّى يُحَدَّثَ بِهِ وَيُسَمَّى لَهُ، فَأَهْوَى رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ إِلَى الضَّبِّ، فَقَالَتِ امْرَأَةٌ مِنَ النِّسْوَةِ الْحُضُورِ أَخْبِرْنَ رَسُولَ اللَّهِ صلى الله عليه وسلم مَا قَدَّمْتُنَّ لَهُ، هُوَ الضَّبُّ يَا رَسُولَ اللَّهِ‏.‏ فَرَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ عَنِ الضَّبِّ، فَقَالَ خَالِدُ بْنُ الْوَلِيدِ أَحَرَامٌ الضَّبُّ يَا رَسُولَ اللَّهِ قَالَ ‏ \"‏ لاَ وَلَكِنْ لَمْ يَكُنْ بِأَرْضِ قَوْمِي فَأَجِدُنِي أَعَافُهُ ‏\"‏‏.‏ قَالَ خَالِدٌ فَاجْتَرَرْتُهُ فَأَكَلْتُهُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَنْظُرُ إِلَىَّ‏.‏"
      },
      {
        "id": 5157,
        "hadith_number": "5392",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rezeki yang Mencukupi: Makanan untuk Beberapa Orang",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضي اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) said, \"The food for two persons is sufficient for three, and the food of three persons is sufficient for four persons.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Makanan untuk dua orang mencukupi untuk tiga orang, dan makanan tiga orang mencukupi untuk empat orang.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، وَحَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ طَعَامُ الاِثْنَيْنِ كَافِي الثَّلاَثَةِ، وَطَعَامُ الثَّلاَثَةِ كَافِي الأَرْبَعَةِ ‏\"‏‏.‏"
      },
      {
        "id": 5158,
        "hadith_number": "5393",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Seorang Mukmin Makan dengan Satu Usus, Kafir dengan Tujuh Usus",
        "perawi_melayu": "Diriwayatkan oleh Nafi`:",
        "english_text": "Ibn `Umar رضی اللہ عنہما never used to take his meal unless a poor man was called to eat with him. One day I brought a poor man to eat with him, the man ate too much, whereupon Ibn `Umar رضی اللہ عنہما said, \"O Nafi`! Don't let this man enter my house, for I heard the Prophet (ﷺ) saying, \"A believer eats in one intestine (is satisfied with a little food), and a kafir (unbeliever) eats in seven intestines (eats much food).",
        "malay_translation": "Ibn `Umar رضی اللہ عنہما tidak pernah menjamu selera melainkan seorang miskin dipanggil untuk makan bersamanya. Pada suatu hari, saya membawa seorang miskin untuk makan bersamanya, orang itu makan terlalu banyak. Kemudian Ibn `Umar رضی اللہ عنہما berkata, \"Wahai Nafi`! Jangan biarkan orang ini masuk ke rumahku, kerana aku mendengar Nabi (ﷺ) bersabda, \"Seorang mukmin makan dengan satu usus (berpuas hati dengan sedikit makanan), dan seorang kafir (orang yang tidak beriman) makan dengan tujuh usus (makan banyak makanan).\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا شُعْبَةُ، عَنْ وَاقِدِ بْنِ مُحَمَّدٍ، عَنْ نَافِعٍ، قَالَ كَانَ ابْنُ عُمَرَ لاَ يَأْكُلُ حَتَّى يُؤْتَى بِمِسْكِينٍ يَأْكُلُ مَعَهُ، فَأَدْخَلْتُ رَجُلاً يَأْكُلُ مَعَهُ فَأَكَلَ كَثِيرًا فَقَالَ يَا نَافِعُ لاَ تُدْخِلْ هَذَا عَلَىَّ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ الْمُؤْمِنُ يَأْكُلُ فِي مِعًى وَاحِدٍ وَالْكَافِرُ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ ‏\"‏‏.‏"
      },
      {
        "id": 5159,
        "hadith_number": "5394",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Mukmin Makan dengan Satu Usus, Kafir dan Munafik dengan Tujuh",
        "perawi_melayu": "Diriwayatkan daripada Ibnu Umar رضی اللہ عنہما :",
        "english_text": "Allah's Messenger (ﷺ) said, \"A believer eats in one intestine (is satisfied with a little food), and a kafir (unbeliever) or a hypocrite eats in seven intestines (eats too much). Ibn Bakir, the reporter, says that he has not remembered which of the words Obaidullah uttered. Uttered Ibn-e-Bokair, Maalik, Nafi'o, Hadrat Ibn-e-Umer رضی اللہ عنہما has reported from the prophet ﷺ the same.",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Seorang mukmin makan dengan satu usus (berasa cukup dengan sedikit makanan), manakala seorang kafir (orang yang tidak beriman) atau munafik makan dengan tujuh usus (makan terlalu banyak).\" Perawi, Ibn Bakir, berkata bahawa dia tidak ingat yang mana satu daripada kata-kata Obaidullah yang diucapkannya. Diriwayatkan oleh Ibn-e-Bokair, Maalik, Nafi'o, Hadrat Ibn-e-Umer رضی اللہ عنہما daripada Nabi ﷺ perkara yang sama.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا عَبْدَةُ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ الْمُؤْمِنَ يَأْكُلُ فِي مِعًى وَاحِدٍ، وَإِنَّ الْكَافِرَ ـ أَوِ الْمُنَافِقَ فَلاَ أَدْرِي أَيَّهُمَا قَالَ عُبَيْدُ اللَّهِ ـ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ ‏\"‏‏.‏ وَقَالَ ابْنُ بُكَيْرٍ حَدَّثَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ‏.‏"
      },
      {
        "id": 5160,
        "hadith_number": "5395",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perumpamaan Orang Kafir (Tidak Beriman) Makan Banyak",
        "perawi_melayu": "Diriwayatkan oleh `Amr:",
        "english_text": "Abu Nahik was avaricious eater. Ibn `Umar رضی اللہ عنہما said to him, \"Allah's Messenger (ﷺ) said, \"A Kafir (unbeliever) eats in seven intestines (eats much).\" On that Abu Nahik said, \"But I believe in Allah and His Apostle .\"",
        "malay_translation": "Abu Nahik seorang yang makan tamak. Ibn `Umar رضی اللہ عنہما berkata kepadanya, \"Rasulullah (ﷺ) bersabda, \"Seorang Kafir (tidak beriman) makan dalam tujuh usus (makan dengan banyak).\" Mendengar itu, Abu Nahik berkata, \"Tetapi aku beriman kepada Allah dan Rasul-Nya.\"",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، قَالَ كَانَ أَبُو نَهِيكٍ رَجُلاً أَكُولاً فَقَالَ لَهُ ابْنُ عُمَرَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ الْكَافِرَ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ ‏\"‏‏.‏ فَقَالَ فَأَنَا أُومِنُ بِاللَّهِ وَرَسُولِهِ‏.‏"
      },
      {
        "id": 5161,
        "hadith_number": "5396",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perbezaan Pemakanan Muslim dan Kafir",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) said, \"A Muslim eats in one intestine (i.e. he is satisfied with a little food) while a Kafir (unbeliever) eats in seven intestines (eats much).",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Seorang Muslim makan dalam satu usus (iaitu, dia berpuas hati dengan sedikit makanan) manakala seorang Kafir (orang yang tidak beriman) makan dalam tujuh usus (makan banyak).\"",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يَأْكُلُ الْمُسْلِمُ فِي مِعًى وَاحِدٍ، وَالْكَافِرُ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ ‏\"‏‏.‏"
      },
      {
        "id": 5162,
        "hadith_number": "5397",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Seorang Mukmin Makan Sedikit, Orang Kafir Makan Banyak",
        "perawi_melayu": "Diriwayatkan oleh Abu Huraira رضی اللہ عنہ :",
        "english_text": "A man used to eat much, but when he embraced Islam, he started eating less. That was mentioned to the Prophet (ﷺ) who then said, \"A believer eats in one intestine (is satisfied with a little food) and a Kafir eats in seven intestines (eats much). \"",
        "malay_translation": "Seorang lelaki dahulunya makan dengan banyak, tetapi apabila dia memeluk Islam, dia mula makan dengan sedikit. Perkara itu diceritakan kepada Nabi (ﷺ), lalu baginda bersabda, \"Seorang mukmin makan dalam satu usus (berpuas hati dengan sedikit makanan) dan seorang kafir makan dalam tujuh usus (makan banyak).\"",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً، كَانَ يَأْكُلُ أَكْلاً كَثِيرًا، فَأَسْلَمَ فَكَانَ يَأْكُلُ أَكْلاً قَلِيلاً، فَذُكِرَ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ إِنَّ الْمُؤْمِنَ يَأْكُلُ فِي مِعًى وَاحِدٍ، وَالْكَافِرَ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ ‏\"‏‏.‏"
      },
      {
        "id": 5163,
        "hadith_number": "5398",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Tidak Makan Sambil Bersandar",
        "perawi_melayu": "Diriwayatkan oleh Abu Juhaifa رضی اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) said, \"I do not take my meals while leaning (against something).",
        "malay_translation": "Rasulullah SAW bersabda, \"Aku tidak makan sambil bersandar (pada sesuatu).\"",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مِسْعَرٌ، عَنْ عَلِيِّ بْنِ الأَقْمَرِ، سَمِعْتُ أَبَا جُحَيْفَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ آكُلُ مُتَّكِئًا ‏\"‏‏.‏"
      },
      {
        "id": 5164,
        "hadith_number": "5399",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi SAW Tidak Makan Sambil Bersandar",
        "perawi_melayu": "Diriwayatkan oleh Abu Juhaifa رضی اللہ عنہ :",
        "english_text": "While I was with the Prophet (ﷺ) he said to a man who was with him, \"I do not take my meals while leaning.\"",
        "malay_translation": "Semasa aku bersama Nabi (ﷺ) baginda bersabda kepada seorang lelaki yang bersama baginda, \"Aku tidak makan sambil bersandar.\"",
        "arabic_text": "حَدَّثَنِي عُثْمَانُ بْنُ أَبِي شَيْبَةَ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ عَلِيِّ بْنِ الأَقْمَرِ، عَنْ أَبِي جُحَيْفَةَ، قَالَ كُنْتُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ لِرَجُلٍ عِنْدَهُ ‏ \"‏ لاَ آكُلُ وَأَنَا مُتَّكِئٌ ‏\"‏‏.‏"
      },
      {
        "id": 5165,
        "hadith_number": "5400",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi SAW dan Mastigure",
        "perawi_melayu": "Diriwayatkan daripada Khalid bin Al-Walid رضی اللہ عنہ :",
        "english_text": "\"A roasted mastigure was brought to the Prophet (ﷺ) who stretched his hand towards it to eat it. But it was said to him, \"It is a mastigure.\" So he withdrew his hand. Khalid رضی اللہ عنہ asked, \"Is it unlawful to eat?\" the Prophet said, \"No, but it is not found in the land of my people and that is why I do not like eating it.\" So Khalid رضی اللہ عنہ started eating (it) while Allah's Messenger (ﷺ) was looking at him. Imam Malik has reported '' بِضَبٍّ مَحْنُوذٍ‏'' from Ibn-e-Shihab.",
        "malay_translation": "Satu hidangan mastigure panggang dibawa kepada Nabi (ﷺ), lalu Baginda menghulurkan tangan untuk memakannya. Tetapi, dikatakan kepada Baginda, \"Itu adalah mastigure.\" Maka, Baginda menarik balik tangan. Khalid رضی اللہ عنہ bertanya, \"Adakah ia haram dimakan?\" Nabi bersabda, \"Tidak, tetapi ia tidak ditemui di tanah kaumku, sebab itu aku tidak suka memakannya.\" Lalu Khalid رضی اللہ عنہ mula memakannya sementara Rasulullah (ﷺ) melihatnya. Imam Malik meriwayatkan '' بِضَبٍّ مَحْنُوذٍ‏'' daripada Ibn-e-Shihab.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ خَالِدِ بْنِ الْوَلِيدِ، قَالَ أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِضَبٍّ مَشْوِيٍّ، فَأَهْوَى إِلَيْهِ لِيَأْكُلَ فَقِيلَ لَهُ إِنَّهُ ضَبٌّ، فَأَمْسَكَ يَدَهُ، فَقَالَ خَالِدٌ أَحَرَامٌ هُوَ قَالَ ‏ \"‏ لاَ، وَلَكِنَّهُ لاَ يَكُونُ بِأَرْضِ قَوْمِي، فَأَجِدُنِي أَعَافُهُ ‏\"‏‏.‏ فَأَكَلَ خَالِدٌ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَنْظُرُ‏.‏ قَالَ مَالِكٌ عَنِ ابْنِ شِهَابٍ بِضَبٍّ مَحْنُوذٍ‏.‏"
      },
      {
        "id": 5166,
        "hadith_number": "5401",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi ﷺ Solat di Rumah 'Utban bin Malik",
        "perawi_melayu": "Diriwayatkan oleh 'Utban bin Malik رضی اللہ عنہ :",
        "english_text": "who attended the Badr battle and was from the Ansar, that he came to the Prophet (ﷺ) and said, \"O Allah's Apostle! I have lost my eyesight and I lead my people in the prayer (as an Imam). When it rains, the valley which is between me and my people, flows with water, and then I cannot go to their mosque to lead them in the prayer. O Allah's Messenger (ﷺ)! I wish that you could come and pray in my house so that I may take it as a praying place. The Prophet (ﷺ) said, \"Allah willing, I will do that.\" The next morning, soon after the sun had risen, Allah's Messenger (ﷺ) came with Abu Bakr رضی اللہ عنہ . The Prophet (ﷺ) asked for the permission to enter and I admitted him. The Prophet (ﷺ) had not sat till he had entered the house and said to me, \"Where do you like me to pray in your house?\" I pointed at a place in my house whereupon he stood and said, \"Allahu Akbar.\" We lined behind him and he prayed two rak`at and finished it with Taslim. We then requested him to stay for a special meal of Khazira which we had prepared. A large number of men from the adjoining area gathered in the house. One of them said, \"Where is Malik bin Ad-Dukhshun رضی اللہ عنہ ?\" Another man said, \"He is a hypocrite and does not love Allah and His Apostle.\" The Prophet said, \"Do not say so. Do you not think that he has said: \"None has the right to be worshipped but Allah,\" seeking Allah's pleasure? The man said, \"Allah and His Apostle know better, but we have always seen him mixing with hypocrites and giving them advice.\" The Prophet (ﷺ) said, \"Allah has forbidden the (Hell) Fire for those who testify that none has the right to be worshipped but Allah, seeking Allah's pleasure. \" Ibn-e-Shihab states: I, then, inquired of Husain bin Muhammad Ansari, a member of Banu Salim and their chief, about this Hadith and he also testified it.",
        "malay_translation": "Sesiapa yang menghadiri peperangan Badar dan dari kalangan Ansar, bahawa dia datang kepada Nabi ﷺ dan berkata, \"Wahai Rasulullah! Penglihatan saya telah hilang dan saya memimpin kaum saya dalam solat (sebagai Imam). Apabila hujan, lembah yang terletak di antara saya dan kaum saya, dipenuhi air, dan kemudian saya tidak dapat pergi ke masjid mereka untuk memimpin mereka dalam solat. Wahai Rasulullah ﷺ! Saya berharap agar anda dapat datang dan solat di rumah saya supaya saya boleh menjadikannya sebagai tempat solat. Nabi ﷺ bersabda, \"InsyaAllah, saya akan lakukan itu.\" Pada pagi berikutnya, tidak lama selepas matahari terbit, Rasulullah ﷺ datang bersama Abu Bakr رضی اللہ عنہ . Nabi ﷺ meminta izin untuk masuk dan saya mengizinkannya. Nabi ﷺ belum duduk sehingga dia memasuki rumah dan berkata kepada saya, \"Di mana anda mahu saya solat di rumah anda?\" Saya menunjukkan tempat di rumah saya dan baginda berdiri dan berkata, \"Allahu Akbar.\" Kami berbaris di belakangnya dan baginda solat dua rakaat dan menyelesaikannya dengan Taslim. Kemudian kami meminta baginda untuk tinggal untuk hidangan istimewa Khazira yang telah kami sediakan. Sebilangan besar lelaki dari kawasan sekeliling berkumpul di rumah itu. Salah seorang daripada mereka berkata, \"Di mana Malik bin Ad-Dukhshun رضی اللہ عنہ ?\" Seorang lelaki lain berkata, \"Dia seorang munafik dan tidak mencintai Allah dan Rasul-Nya.\" Nabi bersabda, \"Jangan berkata begitu. Tidakkah kamu berfikir bahawa dia telah berkata: 'Tiada tuhan yang berhak disembah melainkan Allah,' dengan mencari keredhaan Allah?\" Lelaki itu berkata, \"Allah dan Rasul-Nya lebih mengetahui, tetapi kami selalu melihatnya bergaul dengan orang munafik dan memberi mereka nasihat.\" Nabi ﷺ bersabda, \"Allah telah mengharamkan (Neraka) Api bagi mereka yang bersaksi bahawa tiada tuhan yang berhak disembah melainkan Allah, dengan mencari keredhaan Allah.\" Ibn-e-Shihab menyatakan: Kemudian, saya bertanya kepada Husain bin Muhammad Ansari, seorang anggota Banu Salim dan ketua mereka, tentang Hadith ini dan dia juga mengesahkannya.",
        "arabic_text": "حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي مَحْمُودُ بْنُ الرَّبِيعِ الأَنْصَارِيُّ، أَنَّ عِتْبَانَ بْنَ مَالِكٍ ـ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم مِمَّنْ شَهِدَ بَدْرًا مِنَ الأَنْصَارِ ـ أَنَّهُ أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَنْكَرْتُ بَصَرِي وَأَنَا أُصَلِّي لِقَوْمِي، فَإِذَا كَانَتِ الأَمْطَارُ سَالَ الْوَادِي الَّذِي بَيْنِي وَبَيْنَهُمْ، لَمْ أَسْتَطِعْ أَنْ آتِيَ مَسْجِدَهُمْ فَأُصَلِّيَ لَهُمْ، فَوَدِدْتُ يَا رَسُولَ اللَّهِ أَنَّكَ تَأْتِي فَتُصَلِّي فِي بَيْتِي، فَأَتَّخِذُهُ مُصَلًّى‏.‏ فَقَالَ ‏\"‏ سَأَفْعَلُ إِنْ شَاءَ اللَّهُ ‏\"‏‏.‏ قَالَ عِتْبَانُ فَغَدَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ حِينَ ارْتَفَعَ النَّهَارُ، فَاسْتَأْذَنَ النَّبِيُّ صلى الله عليه وسلم فَأَذِنْتُ لَهُ فَلَمْ يَجْلِسْ حَتَّى دَخَلَ الْبَيْتَ، ثُمَّ قَالَ لِي ‏\"‏ أَيْنَ تُحِبُّ أَنْ أُصَلِّيَ مِنْ بَيْتِكَ ‏\"‏‏.‏ فَأَشَرْتُ إِلَى نَاحِيَةٍ مِنَ الْبَيْتِ فَقَامَ النَّبِيُّ صلى الله عليه وسلم فَكَبَّرَ، فَصَفَفْنَا، فَصَلَّى رَكْعَتَيْنِ، ثُمَّ سَلَّمَ وَحَبَسْنَاهُ عَلَى خَزِيرٍ صَنَعْنَاهُ، فَثَابَ فِي الْبَيْتِ رِجَالٌ مِنْ أَهْلِ الدَّارِ ذَوُو عَدَدٍ فَاجْتَمَعُوا، فَقَالَ قَائِلٌ مِنْهُمْ أَيْنَ مَالِكُ بْنُ الدُّخْشُنِ فَقَالَ بَعْضُهُمْ ذَلِكَ مُنَافِقٌ لاَ يُحِبُّ اللَّهَ وَرَسُولَهُ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ تَقُلْ، أَلاَ تَرَاهُ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ يُرِيدُ بِذَلِكَ وَجْهَ اللَّهِ ‏\"‏‏.‏ قَالَ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ قُلْنَا فَإِنَّا نَرَى وَجْهَهُ وَنَصِيحَتَهُ إِلَى الْمُنَافِقِينَ‏.‏ فَقَالَ ‏\"‏ فَإِنَّ اللَّهَ حَرَّمَ عَلَى النَّارِ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ يَبْتَغِي بِذَلِكَ وَجْهَ اللَّهِ ‏\"‏‏.‏ قَالَ ابْنُ شِهَابٍ ثُمَّ سَأَلْتُ الْحُصَيْنَ بْنَ مُحَمَّدٍ الأَنْصَارِيَّ أَحَدَ بَنِي سَالِمٍ وَكَانَ مِنْ سَرَاتِهِمْ عَنْ حَدِيثِ مَحْمُودٍ فَصَدَّقَهُ‏.‏"
      },
      {
        "id": 5167,
        "hadith_number": "5402",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Makanan yang Dihidangkan kepada Nabi Muhammad SAW",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Abbas رضی اللہ عنہما :",
        "english_text": "My aunt presented (roasted) mastigures, Iqt and milk to the Prophet (ﷺ) . The mastigures were put on his dining sheet, and if it was unlawful to eat, it would not have been put there. The Prophet (ﷺ) drank the milk and ate the Iqt only.",
        "malay_translation": "Makcikku menghidangkan (panggang) mastigures, Iqt dan susu kepada Nabi (ﷺ). Mastigures diletakkan di atas hamparan hidangan baginda, dan sekiranya haram untuk dimakan, ia tidak akan diletakkan di situ. Nabi (ﷺ) meminum susu dan memakan Iqt sahaja.",
        "arabic_text": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ أَهْدَتْ خَالَتِي إِلَى النَّبِيِّ صلى الله عليه وسلم ضِبَابًا وَأَقِطًا وَلَبَنًا، فَوُضِعَ الضَّبُّ عَلَى مَائِدَتِهِ، فَلَوْ كَانَ حَرَامًا لَمْ يُوضَعْ وَشَرِبَ اللَّبَنَ، وَأَكَلَ الأَقِطَ‏.‏"
      },
      {
        "id": 5168,
        "hadith_number": "5403",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kegembiraan di Hari Jumaat dengan Hidangan Silq",
        "perawi_melayu": "Diriwayatkan oleh Sahl bin Sa`d رضى الله عنه :",
        "english_text": "We used to be happy on Fridays, for there was an old lady who used to pull out the roots of Silq and put it in a cooking pot with some barley. When we had finished the prayer, we would visit her and she would present that dish before us. So we used to be happy on Fridays because of that, and we never used to take our meals or have a mid-day nap except after the Friday prayer. By Allah, that meal contained no fat.",
        "malay_translation": "Kami dahulu gembira pada hari Jumaat, kerana ada seorang wanita tua yang selalu mencabut akar Silq dan memasukkannya ke dalam periuk memasak bersama sedikit barli. Apabila kami selesai solat, kami akan melawatnya dan dia akan menghidangkan hidangan itu kepada kami. Oleh itu, kami selalu gembira pada hari Jumaat kerana perkara itu, dan kami tidak pernah makan atau tidur tengah hari kecuali selepas solat Jumaat. Demi Allah, hidangan itu tidak mengandungi lemak.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ إِنْ كُنَّا لَنَفْرَحُ بِيَوْمِ الْجُمُعَةِ، كَانَتْ لَنَا عَجُوزٌ تَأْخُذُ أُصُولَ السِّلْقِ، فَتَجْعَلُهُ فِي قِدْرٍ لَهَا، فَتَجْعَلُ فِيهِ حَبَّاتٍ مِنْ شَعِيرٍ، إِذَا صَلَّيْنَا زُرْنَاهَا فَقَرَّبَتْهُ إِلَيْنَا، وَكُنَّا نَفْرَحُ بِيَوْمِ الْجُمُعَةِ مِنْ أَجْلِ ذَلِكَ، وَمَا كُنَّا نَتَغَدَّى وَلاَ نَقِيلُ إِلاَّ بَعْدَ الْجُمُعَةِ، وَاللَّهِ مَا فِيهِ شَحْمٌ وَلاَ وَدَكٌ‏.‏"
      },
      {
        "id": 5169,
        "hadith_number": "5404",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi ﷺ Makan Daging Bahu dan Solat Tanpa Wuduk Semula",
        "perawi_melayu": "Diriwayatkan oleh Ibn 'Abbas رضي الله عنهما :",
        "english_text": "The Prophet (ﷺ) ate of the meat of a shoulder (by cutting the meat with his teeth), and then got up and offered the prayer without performing the ablution anew.",
        "malay_translation": "Nabi ﷺ memakan daging bahu (dengan memotong daging dengan giginya), kemudian bangun dan menunaikan solat tanpa memperbaharui wuduk.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ تَعَرَّقَ رَسُولُ اللَّهِ صلى الله عليه وسلم كَتِفًا، ثُمَّ قَامَ فَصَلَّى، وَلَمْ يَتَوَضَّأْ‏.‏"
      },
      {
        "id": 5170,
        "hadith_number": "5405",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi ﷺ Makan Daging dan Mendirikan Solat Tanpa Berwuduk Semula",
        "perawi_melayu": "Diriwayatkan oleh Ibnu Abbas رضي الله عنهما :",
        "english_text": "The Prophet (ﷺ) took out a bone with meat on it from a cooking pot and ate of it, and then offered the prayer without performing ablution anew.",
        "malay_translation": "Nabi ﷺ mengeluarkan tulang yang masih ada daging daripadanya dari periuk dan memakannya, kemudian menunaikan solat tanpa mengambil wuduk semula.",
        "arabic_text": "وَعَنْ أَيُّوبَ، وَعَاصِمٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ انْتَشَلَ النَّبِيُّ صلى الله عليه وسلم عَرْقًا مِنْ قِدْرٍ فَأَكَلَ، ثُمَّ صَلَّى، وَلَمْ يَتَوَضَّأْ‏.‏"
      },
      {
        "id": 5171,
        "hadith_number": "5406",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Berangkat ke Makkah Bersama Nabi ﷺ",
        "perawi_melayu": "Diriwayatkan oleh Abu Qatada:",
        "english_text": "We went out towards Mecca with the Prophet ﷺ.",
        "malay_translation": "Kami keluar menuju ke Makkah bersama Nabi ﷺ.",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنِي عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا فُلَيْحٌ، حَدَّثَنَا أَبُو حَازِمٍ الْمَدَنِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، قَالَ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم نَحْوَ مَكَّةَ‏.‏"
      },
      {
        "id": 5172,
        "hadith_number": "5407",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Abu Qatadah: Pemburuan Onager Semasa Ihram",
        "perawi_melayu": "Diriwayatkan oleh Abu Qatada al-Salami رضی اللہ عنہ :",
        "english_text": "Once, while I was sitting with the companions of the Prophet (ﷺ) at a station on the road to Mecca and Allah's Messenger (ﷺ) was stationing ahead of us and all the people were assuming Ihram while I was not. My companion, saw an onager while I was busy Mending my shoes. They did not Inform me of the onager but they wished that I would see it Suddenly I looked and saw the onager Then I headed towards my horse, saddled it and rode, but I forgot to take the lash and the spear. So I said to them my companions), \"Give me the lash and the spear.\" But they said, \"No, by Allah we will not help you in any way to hunt it ' I got angry, dismounted, took it the spear and the lash), rode (the horse chased the onager and wounded it Then I brought it when it had dyed. My companions started eating of its (cooked) meat, but they suspected that it might be unlawful to eat of its meat while they were in a state of Ihram Then I proceeded further and I kept one of its forelegs with me. When we met Allah's Apostle we asked him about that. He said, \"Have you some of its meat with you?\" I gave him that foreleg and he ate the meat till he stripped the bone of its flesh although he was in a state of Ihram. Ataa bin Yasar has also reported similarly from Hadrat Abu Qatadah رضی اللہ عنہ .",
        "malay_translation": "Pada suatu ketika, semasa aku sedang duduk bersama para sahabat Nabi (ﷺ) di sebuah perhentian di jalan ke Mekah, dan Rasulullah (ﷺ) berada di hadapan kami, dan semua orang sedang dalam ihram sedangkan aku tidak. Sahabatku terlihat seekor onager ketika aku sibuk membaiki kasutku. Mereka tidak memberitahuku tentang onager itu, tetapi mereka berharap agar aku melihatnya. Tiba-tiba aku melihat dan ternampak onager itu. Kemudian aku menuju ke arah kudaku, memasangnya pelana dan menunggangnya, tetapi aku terlupa mengambil cemeti dan lembing. Lalu aku berkata kepada mereka (sahabat-sahabatku), \"Berikan aku cemeti dan lembing itu.\" Tetapi mereka berkata, \"Tidak, demi Allah, kami tidak akan membantumu dalam apa jua cara untuk memburunya.\" Aku menjadi marah, turun dari kuda, mengambilnya (lembing dan cemeti), menunggang kuda (kuda itu mengejar onager dan mencederakannya). Kemudian aku membawanya apabila ia telah mati. Sahabat-sahabatku mula makan dagingnya (yang telah dimasak), tetapi mereka mengesyaki bahawa ia mungkin haram untuk memakan dagingnya semasa mereka dalam keadaan ihram. Kemudian aku meneruskan perjalanan dan aku menyimpan satu daripada kaki depannya bersamaku. Apabila kami bertemu dengan Rasulullah, kami bertanya kepadanya tentang hal itu. Baginda berkata, \"Adakah kamu mempunyai sedikit dagingnya bersama kamu?\" Aku memberikan kaki depan itu kepadanya dan baginda memakan daging itu sehingga baginda membersihkan tulang daripada dagingnya walaupun baginda dalam keadaan ihram. 'Ata' bin Yasar juga telah meriwayatkan perkara yang serupa daripada Hadrat Abu Qatadah رضی اللہ عنہ .",
        "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ أَبِي حَازِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ السَّلَمِيِّ، عَنْ أَبِيهِ، أَنَّهُ قَالَ كُنْتُ يَوْمًا جَالِسًا مَعَ رِجَالٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فِي مَنْزِلٍ فِي طَرِيقِ مَكَّةَ، وَرَسُولُ اللَّهِ صلى الله عليه وسلم نَازِلٌ أَمَامَنَا، وَالْقَوْمُ مُحْرِمُونَ وَأَنَا غَيْرُ مُحْرِمٍ، فَأَبْصَرُوا حِمَارًا وَحْشِيًّا وَأَنَا مَشْغُولٌ أَخْصِفُ نَعْلِي، فَلَمْ يُؤْذِنُونِي لَهُ، وَأَحَبُّوا لَوْ أَنِّي أَبْصَرْتُهُ، فَالْتَفَتُّ فَأَبْصَرْتُهُ فَقُمْتُ إِلَى الْفَرَسِ فَأَسْرَجْتُهُ‏.‏ ثُمَّ رَكِبْتُ وَنَسِيتُ السَّوْطَ وَالرُّمْحَ فَقُلْتُ لَهُمْ نَاوِلُونِي السَّوْطَ وَالرُّمْحَ‏.‏ فَقَالُوا لاَ وَاللَّهِ لاَ نُعِينُكَ عَلَيْهِ بِشَىْءٍ‏.‏ فَغَضِبْتُ فَنَزَلْتُ فَأَخَذْتُهُمَا، ثُمَّ رَكِبْتُ فَشَدَدْتُ عَلَى الْحِمَارِ فَعَقَرْتُهُ، ثُمَّ جِئْتُ بِهِ وَقَدْ مَاتَ فَوَقَعُوا فِيهِ يَأْكُلُونَهُ، ثُمَّ إِنَّهُمْ شَكُّوا فِي أَكْلِهِمْ إِيَّاهُ وَهُمْ حُرُمٌ، فَرُحْنَا وَخَبَأْتُ الْعَضُدَ مَعِي، فَأَدْرَكْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَسَأَلْنَاهُ عَنْ ذَلِكَ فَقَالَ ‏ \"‏ مَعَكُمْ مِنْهُ شَىْءٌ ‏\"‏‏.‏ فَنَاوَلْتُهُ الْعَضُدَ فَأَكَلَهَا حَتَّى تَعَرَّقَهَا، وَهْوَ مُحْرِمٌ‏.‏ قَالَ ابْنُ جَعْفَرٍ وَحَدَّثَنِي زَيْدُ بْنُ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي قَتَادَةَ مِثْلَهُ‏.‏"
      },
      {
        "id": 5173,
        "hadith_number": "5408",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi SAW Berhenti Solat Walaupun Sedang Memegang Daging",
        "perawi_melayu": "Diriwayatkan oleh `Amr bin Umaiyya رضي اللہ عنہ :",
        "english_text": "He saw the Prophet (ﷺ) holding a shoulder piece of mutton in his hand and cutting part of it with a knife. Then he was called for the prayer whereupon he put down the shoulder piece and the knife with which he was cutting it, and then stood for prayer without performing ablution again.",
        "malay_translation": "Beliau melihat Nabi (ﷺ) memegang sepotong bahu kambing dalam tangannya dan memotong sebahagian daripadanya dengan pisau. Kemudian beliau dipanggil untuk solat, lalu baginda meletakkan potongan bahu kambing dan pisau yang digunakan untuk memotong, kemudian berdiri untuk solat tanpa berwuduk semula.",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي جَعْفَرُ بْنُ عَمْرِو بْنِ أُمَيَّةَ، أَنَّ أَبَاهُ، عَمْرَو بْنَ أُمَيَّةَ أَخْبَرَهُ أَنَّهُ، رَأَى النَّبِيَّ صلى الله عليه وسلم يَحْتَزُّ مِنْ كَتِفِ شَاةٍ فِي يَدِهِ، فَدُعِيَ إِلَى الصَّلاَةِ فَأَلْقَاهَا وَالسِّكِّينَ الَّتِي يَحْتَزُّ بِهَا، ثُمَّ قَامَ فَصَلَّى، وَلَمْ يَتَوَضَّأْ‏.‏"
      },
      {
        "id": 5174,
        "hadith_number": "5409",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Sikap Nabi terhadap Makanan",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضي اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) never criticized any food (he was invited to) but he used to eat if he liked the food, and leave it if he disliked it.",
        "malay_translation": "Nabi ﷺ tidak pernah mengkritik sebarang makanan (yang dijemputnya), tetapi Baginda makan jika menyukai makanan tersebut, dan meninggalkannya jika tidak menyukainya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ مَا عَابَ النَّبِيُّ صلى الله عليه وسلم طَعَامًا قَطُّ، إِنِ اشْتَهَاهُ أَكَلَهُ، وَإِنْ كَرِهَهُ تَرَكَهُ‏.‏"
      },
      {
        "id": 5175,
        "hadith_number": "5410",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Penggunaan Tepung Semasa Zaman Nabi ﷺ",
        "perawi_melayu": "Diriwayatkan oleh Sahl رضي الله عنه :",
        "english_text": "\"Did you use white flour during the lifetime of the Prophet (ﷺ) ?\" Sahl replied, \"No. Hazim asked, \"Did you use to sift barley flour?\" He said, \"No, but we used to blow off the husk (of the barley).",
        "malay_translation": "\"Adakah kamu menggunakan tepung putih semasa zaman Nabi ﷺ?\" Sahl menjawab, \"Tidak.\" Hazim bertanya, \"Adakah kamu selalu mengayak tepung barli?\" Beliau berkata, \"Tidak, tetapi kami meniup buih (barli).\"",
        "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، أَنَّهُ سَأَلَ سَهْلاً هَلْ رَأَيْتُمْ فِي زَمَانِ النَّبِيِّ صلى الله عليه وسلم النَّقِيَّ قَالَ لاَ‏.‏ فَقُلْتُ فَهَلْ كُنْتُمْ تَنْخُلُونَ الشَّعِيرَ قَالَ لاَ وَلَكِنْ كُنَّا نَنْفُخُهُ‏.‏"
      },
      {
        "id": 5176,
        "hadith_number": "5411",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Nabi SAW Memberi Kurma",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضي اللہ عنہ :",
        "english_text": "Once the Prophet (ﷺ) distributed dates among his companions and gave each one seven dates. He gave me seven dates too, one of which was dry and hard, but none of the other dates was more liked by me than that one, for it prolonged my chewing it.",
        "malay_translation": "Suatu ketika, Nabi SAW mengagihkan buah kurma kepada sahabat-sahabatnya dan memberi setiap orang tujuh biji kurma. Baginda juga memberi saya tujuh biji kurma, yang mana sebiji daripadanya kering dan keras, tetapi tiada satu pun daripada kurma yang lain lebih saya sukai daripada yang itu, kerana ia memanjangkan masa saya mengunyahnya.",
        "arabic_text": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَبَّاسٍ الْجُرَيْرِيِّ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَسَمَ النَّبِيُّ صلى الله عليه وسلم يَوْمًا بَيْنَ أَصْحَابِهِ تَمْرًا، فَأَعْطَى كُلَّ إِنْسَانٍ سَبْعَ تَمَرَاتٍ، فَأَعْطَانِي سَبْعَ تَمَرَاتٍ إِحْدَاهُنَّ حَشَفَةٌ، فَلَمْ يَكُنْ فِيهِنَّ تَمْرَةٌ أَعْجَبَ إِلَىَّ مِنْهَا، شَدَّتْ فِي مَضَاغِي‏.‏"
      },
      {
        "id": 5177,
        "hadith_number": "5412",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pengalaman Awal Kehidupan Bersama Rasulullah ﷺ",
        "perawi_melayu": "Riwayat Sa`d رضي الله عنه :",
        "english_text": "I was one of (the first) seven (who had embraced Islam) with Allah's Messenger (ﷺ) and we had nothing to eat then, except the leaves of the Habala or Hubula tree, so that our stool used to be similar to that of sheep. Now the tribe of Bani Asad wants to teach me Islam; I would be a loser and all my efforts would be in vain (if I learn Islam anew from them).",
        "malay_translation": "Saya adalah salah seorang daripada (tujuh orang pertama) yang memeluk Islam bersama Rasulullah ﷺ dan pada masa itu kami tidak mempunyai apa-apa untuk dimakan kecuali daun pokok Habala atau Hubula, sehingga najis kami serupa dengan najis kambing. Sekarang, kabilah Bani Asad mahu mengajar saya tentang Islam; saya akan menjadi orang yang rugi dan segala usaha saya akan sia-sia (jika saya mempelajari Islam semula daripada mereka).",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، عَنْ سَعْدٍ، قَالَ رَأَيْتُنِي سَابِعَ سَبْعَةٍ مَعَ النَّبِيِّ صلى الله عليه وسلم مَا لَنَا طَعَامٌ إِلاَّ وَرَقُ الْحُبْلَةِ ـ أَوِ الْحَبَلَةِ ـ حَتَّى يَضَعَ أَحَدُنَا مَا تَضَعُ الشَّاةُ، ثُمَّ أَصْبَحَتْ بَنُو أَسَدٍ تُعَزِّرُنِي عَلَى الإِسْلاَمِ، خَسِرْتُ إِذًا وَضَلَّ سَعْيِي‏.‏"
      },
      {
        "id": 5178,
        "hadith_number": "5413",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi ﷺ Tidak Pernah Makan Tepung Gandum Putih",
        "perawi_melayu": "Diriwayatkan oleh Abu Hazim",
        "english_text": "I asked Sahl bin Sa`d رضی اللہ عنہ , \"Did Allah's Messenger (ﷺ) ever eat white flour?\" Sahl said, \"Allah's Messenger (ﷺ) never saw white flour since Allah sent him as an Apostle till He took him unto Him.\" I asked, \"Did the people have (use) sieves during the lifetime of Allah's Messenger (ﷺ)?\" Sahl said, \"Allah's Messenger (ﷺ) never saw (used) a sieve since Allah sent him as an Apostle until He took him unto Him,\" I said, \"How could you eat barley unsifted?\" he said, \"We used to grind it and then blow off its husk, and after the husk flew away, we used to prepare the dough (bake) and eat it.\"",
        "malay_translation": "Saya bertanya kepada Sahl bin Sa`d رضی اللہ عنہ, \"Adakah Rasulullah ﷺ pernah makan tepung gandum putih?\" Sahl menjawab, \"Rasulullah ﷺ tidak pernah melihat tepung gandum putih sejak Allah mengutusnya sebagai Rasul sehingga Allah mengambilnya (mewafatkannya).\" Saya bertanya lagi, \"Adakah orang ramai menggunakan ayak (sieve) pada zaman Rasulullah ﷺ?\" Sahl berkata, \"Rasulullah ﷺ tidak pernah melihat (menggunakan) ayak sejak Allah mengutusnya sebagai Rasul sehingga Allah mengambilnya.\" Saya berkata, \"Bagaimana kamu makan barli yang tidak diayak?\" Dia menjawab, \"Kami menggilingnya, kemudian meniup hampasnya. Setelah hampas itu terbang, kami menyediakan doh (bakar) dan memakannya.\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، عَنْ أَبِي حَازِمٍ، قَالَ سَأَلْتُ سَهْلَ بْنَ سَعْدٍ فَقُلْتُ هَلْ أَكَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم النَّقِيَّ فَقَالَ سَهْلٌ مَا رَأَى رَسُولُ اللَّهِ صلى الله عليه وسلم النَّقِيَّ مِنْ حِينَ ابْتَعَثَهُ اللَّهُ حَتَّى قَبَضَهُ اللَّهُ‏.‏ قَالَ فَقُلْتُ هَلْ كَانَتْ لَكُمْ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم مَنَاخِلُ قَالَ مَا رَأَى رَسُولُ اللَّهِ صلى الله عليه وسلم مُنْخُلاً مِنْ حِينَ ابْتَعَثَهُ اللَّهُ حَتَّى قَبَضَهُ‏.‏ قَالَ قُلْتُ كَيْفَ كُنْتُمْ تَأْكُلُونَ الشَّعِيرَ غَيْرَ مَنْخُولٍ قَالَ كُنَّا نَطْحَنُهُ وَنَنْفُخُهُ، فَيَطِيرُ مَا طَارَ وَمَا بَقِيَ ثَرَّيْنَاهُ فَأَكَلْنَاهُ‏.‏"
      },
      {
        "id": 5179,
        "hadith_number": "5414",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah ﷺ Meninggal Dunia Tanpa Memenuhi Perutnya",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضي الله عنه :",
        "english_text": "that he passed by a group of people in front of whom there was a roasted sheep. They invited him but he refused to eat and said, \"Allah's Messenger (ﷺ) left this world without satisfying his hunger even with barley bread.\"",
        "malay_translation": "Bahawa dia melalui sekumpulan orang di hadapan mereka terdapat seekor kambing panggang. Mereka menjemputnya tetapi dia enggan makan dan berkata, \"Rasulullah ﷺ meninggalkan dunia ini tanpa memuaskan rasa laparnya walaupun dengan roti barli.\"",
        "arabic_text": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ مَرَّ بِقَوْمٍ بَيْنَ أَيْدِيهِمْ شَاةٌ مَصْلِيَّةٌ، فَدَعَوْهُ فَأَبَى أَنْ يَأْكُلَ قَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنَ الدُّنْيَا وَلَمْ يَشْبَعْ مِنَ الْخُبْزِ الشَّعِيرِ‏.‏"
      },
      {
        "id": 5180,
        "hadith_number": "5415",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Cara Nabi ﷺ Makan",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) never took his meals at a dining table, nor in small plates, and he never ate thin wellbaked bread. (The sub-narrator asked Qatada, \"Over what did they use to take their meals?\" Qatada said, \"On leather dining sheets.\"",
        "malay_translation": "Nabi ﷺ tidak pernah makan di meja makan, mahupun di dalam pinggan kecil, dan Baginda tidak pernah memakan roti yang nipis dan dibakar dengan baik. (Perawi bawahan bertanya kepada Qatada, \"Di atas apa mereka makan?\" Qatada berkata, \"Di atas hamparan kulit untuk makan.\")",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي الأَسْوَدِ، حَدَّثَنَا مُعَاذٌ، حَدَّثَنِي أَبِي، عَنْ يُونُسَ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ مَا أَكَلَ النَّبِيُّ صلى الله عليه وسلم عَلَى خِوَانٍ، وَلاَ فِي سُكْرُجَةٍ، وَلاَ خُبِزَ لَهُ مُرَقَّقٌ‏.‏ قُلْتُ لِقَتَادَةَ عَلَى مَا يَأْكُلُونَ قَالَ عَلَى السُّفَرِ‏.‏"
      },
      {
        "id": 5181,
        "hadith_number": "5416",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kehidupan Keluarga Nabi Muhammad (SAW)",
        "perawi_melayu": "Diriwayatkan daripada `Aisha رضي الله عنها :",
        "english_text": "The family of Muhammad had not eaten wheat bread to their satisfaction for three consecutive days since his arrival at Medina till he died.",
        "malay_translation": "Keluarga Muhammad tidak pernah makan roti gandum sehingga kenyang selama tiga hari berturut-turut sejak kedatangan baginda di Madinah sehinggalah baginda wafat.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا شَبِعَ آلُ مُحَمَّدٍ صلى الله عليه وسلم مُنْذُ قَدِمَ الْمَدِينَةَ مِنْ طَعَامِ الْبُرِّ ثَلاَثَ لَيَالٍ تِبَاعًا، حَتَّى قُبِضَ‏.‏"
      },
      {
        "id": 5182,
        "hadith_number": "5417",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Talbina: Penawar Duka dan Penenang Hati",
        "perawi_melayu": "Diriwayatkan daripada 'Aishah رضي الله عنها (isteri Nabi ﷺ):",
        "english_text": "whenever one of her relatives died, the women assembled and then dispersed (returned to their houses) except her relatives and close friends. She would order that a pot of Talbina be cooked. Then Tharid (a dish prepared from meat and bread) would be prepared and the Talbina would be poured on it. `Aisha رضی اللہ عنہا would say (to the women),\"Eat of it, for I heard Allah's Messenger (ﷺ) saying, 'The Talbina soothes the heart of the patient and relieves him from some of his sadness.' \"",
        "malay_translation": "Apabila salah seorang daripada kaum kerabatnya meninggal dunia, kaum wanita akan berkumpul kemudian bersurai (pulang ke rumah mereka) kecuali kaum kerabat dan sahabat karibnya. Beliau akan memerintahkan agar periuk Talbina dimasak. Kemudian, Tharid (sejenis hidangan yang disediakan daripada daging dan roti) akan disediakan dan Talbina akan dituang ke atasnya. 'Aishah رضي الله عنها akan berkata (kepada kaum wanita), \"Makanlah ia, kerana aku mendengar Rasulullah ﷺ bersabda, 'Talbina dapat menenangkan hati orang yang sakit dan menghilangkan sebahagian daripada kesedihannya.' \"",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا كَانَتْ إِذَا مَاتَ الْمَيِّتُ مِنْ أَهْلِهَا فَاجْتَمَعَ لِذَلِكَ النِّسَاءُ، ثُمَّ تَفَرَّقْنَ، إِلاَّ أَهْلَهَا وَخَاصَّتَهَا، أَمَرَتْ بِبُرْمَةٍ مِنْ تَلْبِينَةٍ فَطُبِخَتْ، ثُمَّ صُنِعَ ثَرِيدٌ فَصُبَّتِ التَّلْبِينَةُ عَلَيْهَا ثُمَّ قَالَتْ كُلْنَ مِنْهَا فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ التَّلْبِينَةُ مَجَمَّةٌ لِفُؤَادِ الْمَرِيضِ، تَذْهَبُ بِبَعْضِ الْحُزْنِ ‏\"‏‏.‏"
      },
      {
        "id": 5183,
        "hadith_number": "5418",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keutamaan Maryam dan Asiah serta Kelebihan Aisyah",
        "perawi_melayu": "Diriwayatkan oleh Abu Musa Al-Ash`ari رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) said, \"Many men reached perfection but none among the women reached perfection except Mary, the daughter of ' `Imran, and Asia رضی اللہ عنہا , Pharoah's wife. And the superiority of `Aisha رضی اللہ عنہا to other women is like the superiority of Tharid to other kinds of food.",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Ramai lelaki mencapai kesempurnaan, tetapi tiada seorang pun dari kalangan wanita yang mencapai kesempurnaan melainkan Maryam, puteri 'Imran, dan Asiah رضی اللہ عنہا , isteri Firaun. Dan kelebihan `Aisyah رضی اللہ عنہا ke atas wanita lain adalah seperti kelebihan Tharid ke atas jenis makanan lain.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ الْجَمَلِيِّ، عَنْ مُرَّةَ الْهَمْدَانِيِّ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ كَمَلَ مِنَ الرِّجَالِ كَثِيرٌ، وَلَمْ يَكْمُلْ مِنَ النِّسَاءِ إِلاَّ مَرْيَمُ بِنْتُ عِمْرَانَ وَآسِيَةُ امْرَأَةُ فِرْعَوْنَ، وَفَضْلُ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ ‏\"‏‏.‏"
      },
      {
        "id": 5184,
        "hadith_number": "5419",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keutamaan Aisyah (RA) seperti Keutamaan Tharid",
        "perawi_melayu": "Diriwayatkan oleh Anas",
        "english_text": "The Prophet (ﷺ) said, \"The superiority of `Aisha رضی اللہ عنہا to other women is like the superiority of Tharid to other kinds of food . \"",
        "malay_translation": "Nabi (ﷺ) bersabda, \"Keutamaan Aisyah رضی اللہ عنہا ke atas wanita lain adalah seperti keutamaan Tharid ke atas jenis makanan yang lain.\"",
        "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ أَبِي طُوَالَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ فَضْلُ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ ‏\"‏‏.‏"
      },
      {
        "id": 5185,
        "hadith_number": "5420",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kecintaan Terhadap Labu Kerana Nabi Muhammad ﷺ",
        "perawi_melayu": "Diriwayatkan oleh Anas رضي الله عنه :",
        "english_text": "I went along with the Prophet (ﷺ) to the house of a young tailor of his. The tailor presented a dish of Tharid to the Prophet (ﷺ) and resumed his work. The Prophet (ﷺ) started picking the pieces of gourd and I too, started picking them and putting it before him. Since then I have always loved (to eat) gourd.",
        "malay_translation": "Saya pergi bersama Nabi ﷺ ke rumah seorang tukang jahit muda. Tukang jahit itu menghidangkan hidangan Tharid kepada Nabi ﷺ dan menyambung kerjanya. Nabi ﷺ mula mengambil kepingan labu dan saya juga, mula mengambilnya dan meletakkannya di hadapan Baginda. Sejak itu saya sentiasa menyukai (makan) labu.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُنِيرٍ، سَمِعَ أَبَا حَاتِمٍ الأَشْهَلَ بْنَ حَاتِمٍ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ ثُمَامَةَ بْنِ أَنَسٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ دَخَلْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم عَلَى غُلاَمٍ لَهُ خَيَّاطٍ، فَقَدَّمَ إِلَيْهِ قَصْعَةً فِيهَا ثَرِيدٌ ـ قَالَ ـ وَأَقْبَلَ عَلَى عَمَلِهِ ـ قَالَ ـ فَجَعَلَ النَّبِيُّ صلى الله عليه وسلم يَتَتَبَّعُ الدُّبَّاءَ ـ قَالَ ـ فَجَعَلْتُ أَتَتَبَّعُهُ فَأَضَعُهُ بَيْنَ يَدَيْهِ ـ قَالَ ـ فَمَا زِلْتُ بَعْدُ أُحِبُّ الدُّبَّاءَ‏.‏"
      },
      {
        "id": 5186,
        "hadith_number": "5421",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Anas bin Malik tentang Nabi tidak pernah menikmati roti yang baik",
        "perawi_melayu": "Diriwayatkan oleh Qatada:",
        "english_text": "We used to visit Anas bin Malik رضي اللہ عنہ while his baker was standing (and baking). Anas would say, \"Eat! I do not know that the Prophet (ﷺ) had ever seen well-baked bread till he met Allah, nor had he ever seen a roasted sheep with his own eyes.\"",
        "malay_translation": "Kami sering melawat Anas bin Malik رضي اللہ عنہ ketika tukang roti beliau sedang berdiri (dan membakar roti). Anas akan berkata, \"Makanlah! Aku tidak tahu bahawa Nabi (ﷺ) pernah melihat roti yang dibakar dengan baik sehinggalah baginda bertemu Allah, dan baginda juga tidak pernah melihat seekor kambing panggang dengan mata baginda sendiri.\"",
        "arabic_text": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى، عَنْ قَتَادَةَ، قَالَ كُنَّا نَأْتِي أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ وَخَبَّازُهُ قَائِمٌ قَالَ كُلُوا فَمَا أَعْلَمُ النَّبِيَّ صلى الله عليه وسلم رَأَى رَغِيفًا مُرَقَّقًا حَتَّى لَحِقَ بِاللَّهِ، وَلاَ رَأَى شَاةً سَمِيطًا بِعَيْنِهِ قَطُّ‏.‏"
      },
      {
        "id": 5187,
        "hadith_number": "5422",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah ﷺ Memakan Daging Kambing dan Solat Tanpa Wuduk Baru",
        "perawi_melayu": "Diriwayatkan oleh `Amr bin Umaiyay Ad-Damri:",
        "english_text": "I saw Allah's Messenger (ﷺ) cutting part of the shoulder of mutton with a knife. He ate of it and then was called for prayer whereupon he got up and put down the knife and offered the prayer without performing new ablution.",
        "malay_translation": "Saya melihat Rasulullah ﷺ memotong sebahagian daripada bahu kambing dengan pisau. Baginda memakannya, kemudian dipanggil untuk solat, lalu baginda bangun dan meletakkan pisau, dan menunaikan solat tanpa berwuduk baru.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ، عَنْ أَبِيهِ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَحْتَزُّ مِنْ كَتِفِ شَاةٍ، فَأَكَلَ مِنْهَا، فَدُعِيَ إِلَى الصَّلاَةِ، فَقَامَ فَطَرَحَ السِّكِّينَ فَصَلَّى، وَلَمْ يَتَوَضَّأْ‏.‏"
      },
      {
        "id": 5188,
        "hadith_number": "5423",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Makan Daging Korban Lebih Tiga Hari dan Keadaan Keluarga Nabi",
        "perawi_melayu": "Diriwayatkan daripada `Abis:",
        "english_text": "I asked `Aisha رضی اللہ عنہا \"Did the Prophet (ﷺ) forbid eating the meat of sacrifices offered on `Id-ul-Adha for more than three days\" She said, \"The Prophet (ﷺ) did not do this except in the year when the people were hungry, so he wanted the rich to feed the poor. But later we used to store even a trotter of a sheep to eat it fifteen days later.\" She was asked, \"What compelled you to do so?\" She smiled and said, \"The family of Muhammad did not eat to their satisfaction white bread with meat soup for three successive days till he met Allah.\" Ibn-e-Kastheer with reference to Sufyan Abdur Rehman bin Abis.",
        "malay_translation": "Saya bertanya kepada `Aishah رضی اللہ عنہا: \"Adakah Nabi (ﷺ) melarang memakan daging korban yang disembelih pada `Id-ul-Adha lebih daripada tiga hari?\" Beliau berkata, \"Nabi (ﷺ) tidak berbuat demikian kecuali pada tahun ketika orang ramai dalam keadaan kelaparan, maka baginda ingin orang kaya memberi makan kepada orang miskin. Tetapi selepas itu, kami menyimpan walaupun kaki kambing untuk memakannya lima belas hari kemudian.\" Beliau ditanya, \"Apakah yang mendorong kamu berbuat demikian?\" Beliau tersenyum dan berkata, \"Keluarga Muhammad tidak makan sehingga kenyang roti putih dengan sup daging selama tiga hari berturut-turut sehingga baginda menemui Allah.\" Ibn-e-Kastheer merujuk kepada Sufyan Abdur Rehman bin Abis.",
        "arabic_text": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ، عَنْ أَبِيهِ، قَالَ قُلْتُ لِعَائِشَةَ أَنَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ تُؤْكَلَ لُحُومُ الأَضَاحِيِّ فَوْقَ ثَلاَثٍ قَالَتْ مَا فَعَلَهُ إِلاَّ فِي عَامٍ جَاعَ النَّاسُ فِيهِ، فَأَرَادَ أَنْ يُطْعِمَ الْغَنِيُّ الْفَقِيرَ، وَإِنْ كُنَّا لَنَرْفَعُ الْكُرَاعَ فَنَأْكُلُهُ بَعْدَ خَمْسَ عَشْرَةَ‏.‏ قِيلَ مَا اضْطَرَّكُمْ إِلَيْهِ فَضَحِكَتْ قَالَتْ مَا شَبِعَ آلُ مُحَمَّدٍ صلى الله عليه وسلم مِنْ خُبْزِ بُرٍّ مَأْدُومٍ ثَلاَثَةَ أَيَّامٍ حَتَّى لَحِقَ بِاللَّهِ‏.‏ وَقَالَ ابْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَابِسٍ بِهَذَا‏.‏"
      },
      {
        "id": 5189,
        "hadith_number": "5424",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Membawa Daging Korban ke Madinah",
        "perawi_melayu": "Diriwayatkan oleh Jabir رضی اللہ عنہ :",
        "english_text": "We used to carry the meat of the Hadis (sacrificed animals) to Medina during the life-time of the Prophet . Ibn-e-Juraij inquired of Ataa whether Hadrat Jabir رضی اللہ عنہ said: ''Until we reached Madinah Munawwarah'', he said: No!",
        "malay_translation": "Kami dahulu membawa daging *Hadis* (haiwan korban) ke Madinah semasa hayat Nabi ﷺ. Ibn-e-Juraij bertanya kepada Ataa sama ada Hadrat Jabir رضی اللہ عنہ berkata: ''Sehingga kami sampai ke Madinah Munawwarah'', dia berkata: Tidak!",
        "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ كُنَّا نَتَزَوَّدُ لُحُومَ الْهَدْىِ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم إِلَى الْمَدِينَةِ‏.‏ تَابَعَهُ مُحَمَّدٌ عَنِ ابْنِ عُيَيْنَةَ‏.‏ وَقَالَ ابْنُ جُرَيْجٍ قُلْتُ لِعَطَاءٍ أَقَالَ حَتَّى جِئْنَا الْمَدِينَةَ قَالَ لاَ‏.‏"
      },
      {
        "id": 5190,
        "hadith_number": "5425",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Doa Rasulullah (ﷺ) dan Perkahwinan Safiyya",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik رضی اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) said to Abu Talha رضی اللہ عنہ , \"Seek one of your boys to serve me.\" Abu Talha رضی اللہ عنہ mounted me behind him (on his riding animal) and took me (to the Prophet (ﷺ) ). So I used to serve Allah's Messenger (ﷺ) whenever he dismounted (to stay somewhere). I used to hear him saying very often, \"O Allah! I seek refuge with You from, having worries sadness, helplessness, laziness, miserliness, cowardice, from being heavily in debt and from being overpowered by other persons unjustly.\" I kept on serving till we -returned from the battle of Khaibar. The Prophet (ﷺ) then brought Safiyya bint Huyai رضی اللہ عنہ whom he had won from the war booty. I saw him folding up a gown or a garment for her to sit on behind him (on his shecamel). When he reached As-Sahba', he prepared Hais and placed it on a dining sheet. Then he sent me to invite men, who (came and) ate; and that was his and Safiyya's wedding banquet. Then the Prophet proceeded, and when he saw (noticed) the mountain of Uhud, he said, \"This mountain loves us, and we love it.\" When we approached Medina, he said, \"O Allah! I make the area between its two mountains a sanctuary as Abraham has made Mecca a sanctuary. O Allah! Bless their Mudd and Sa (special kinds of measure).\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda kepada Abu Talha رضی اللہ عنہ, \"Carilah salah seorang anak lelaki kamu untuk berkhidmat kepada-Ku.\" Abu Talha رضی اللہ عنہ memboncengkan saya di belakangnya (di atas haiwan tunggangannya) dan membawa saya (kepada Nabi (ﷺ)). Oleh itu, saya berkhidmat kepada Rasulullah (ﷺ) setiap kali baginda turun (untuk berhenti di sesuatu tempat). Saya sering mendengar baginda berdoa, \"Ya Allah! Aku berlindung dengan-Mu daripada kebimbangan, kesedihan, kelemahan, kemalasan, kekikiran, pengecut, daripada terlilit hutang yang berat dan daripada dikuasai oleh orang lain secara zalim.\" Saya terus berkhidmat sehingga kami pulang dari peperangan Khaibar. Kemudian Nabi (ﷺ) membawa Safiyya bint Huyai رضی اللہ عنہ yang baginda perolehi daripada harta rampasan perang. Saya melihat baginda melipat jubah atau pakaian untuk dia duduk di belakang baginda (di atas unta betinanya). Apabila baginda sampai di As-Sahba', baginda menyediakan Hais dan meletakkannya di atas hamparan hidangan. Kemudian baginda mengutus saya untuk menjemput orang ramai, yang (datang dan) makan; dan itulah jamuan perkahwinan baginda dan Safiyya. Kemudian Nabi meneruskan perjalanan, dan apabila baginda melihat (perasan) gunung Uhud, baginda bersabda, \"Gunung ini mencintai kita, dan kita mencintainya.\" Apabila kami menghampiri Madinah, baginda bersabda, \"Ya Allah! Aku jadikan kawasan antara dua gunungnya sebagai tempat suci sebagaimana Ibrahim menjadikan Mekah sebagai tempat suci. Ya Allah! Berkatilah Mudd dan Sa (jenis sukatan khas) mereka.\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو، مَوْلَى الْمُطَّلِبِ بْنِ عَبْدِ اللَّهِ بْنِ حَنْطَبٍ أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لأَبِي طَلْحَةَ ‏\"‏ الْتَمِسْ غُلاَمًا مِنْ غِلْمَانِكُمْ يَخْدُمُنِي ‏\"‏‏.‏ فَخَرَجَ بِي أَبُو طَلْحَةَ، يُرْدِفُنِي وَرَاءَهُ، فَكُنْتُ أَخْدُمُ رَسُولَ اللَّهِ صلى الله عليه وسلم كُلَّمَا نَزَلَ، فَكُنْتُ أَسْمَعُهُ يُكْثِرُ أَنْ يَقُولَ ‏\"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ وَضَلَعِ الدَّيْنِ، وَغَلَبَةِ الرِّجَالِ ‏\"‏‏.‏ فَلَمْ أَزَلْ أَخْدُمُهُ حَتَّى أَقْبَلْنَا مِنْ خَيْبَرَ، وَأَقْبَلَ بِصَفِيَّةَ بِنْتِ حُيَىٍّ قَدْ حَازَهَا، فَكُنْتُ أَرَاهُ يُحَوِّي وَرَاءَهُ بِعَبَاءَةٍ أَوْ بِكِسَاءٍ، ثُمَّ يُرْدِفُهَا وَرَاءَهُ، حَتَّى إِذَا كُنَّا بِالصَّهْبَاءِ صَنَعَ حَيْسًا فِي نِطَعٍ، ثُمَّ أَرْسَلَنِي فَدَعَوْتُ رِجَالاً فَأَكَلُوا، وَكَانَ ذَلِكَ بِنَاءَهُ بِهَا، ثُمَّ أَقْبَلَ حَتَّى إِذَا بَدَا لَهُ أُحُدٌ قَالَ ‏\"‏ هَذَا جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ ‏\"‏‏.‏ فَلَمَّا أَشْرَفَ عَلَى الْمَدِينَةِ قَالَ ‏\"‏ اللَّهُمَّ إِنِّي أُحَرِّمُ مَا بَيْنَ جَبَلَيْهَا مِثْلَ مَا حَرَّمَ بِهِ إِبْرَاهِيمُ مَكَّةَ، اللَّهُمَّ بَارِكْ لَهُمْ فِي مُدِّهِمْ وَصَاعِهِمْ ‏\"‏‏.‏"
      },
      {
        "id": 5191,
        "hadith_number": "5426",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Menggunakan Sutera, Dibaja, dan Bejana Emas/Perak",
        "perawi_melayu": "Diriwayatkan oleh `Abdur-Rahman bin Abi Laila:",
        "english_text": "We were sitting in the company of Hudhaifa رضی اللہ عنہ who asked for water and a Magian brought him water. But when he placed the cup in his hand, he threw it at him and said, \"Had I not forbidden him to do so more than once or twice?\" He wanted to say, \"I would not have done so,\" adding, \"but I heard the Prophet saying, \"Do not wear silk or Dibaja, and do not drink in silver or golden vessels, and do not eat in plates of such metals, for such things are for the unbelievers in this worldly life and for us in the Hereafter.\"",
        "malay_translation": "Kami sedang duduk dalam majlis Hudhaifa رضی اللہ عنہ yang meminta air dan seorang Majusi membawanya air. Tetapi apabila dia meletakkan cawan di tangannya, Hudhaifa membalingnya ke arah orang Majusi itu dan berkata, \"Bukankah aku telah melarangnya daripada berbuat demikian lebih daripada sekali atau dua kali?\" Hudhaifa ingin berkata, \"Saya tidak akan berbuat demikian,\" sambil menambah, \"tetapi saya mendengar Nabi bersabda, \"Janganlah memakai sutera atau Dibaja, dan janganlah minum dalam bekas perak atau emas, dan janganlah makan di atas pinggan yang diperbuat daripada logam sedemikian, kerana perkara sedemikian adalah untuk orang kafir di dunia ini dan untuk kita di Akhirat.\"",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سَيْفُ بْنُ أَبِي سُلَيْمَانَ، قَالَ سَمِعْتُ مُجَاهِدًا، يَقُولُ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي لَيْلَى، أَنَّهُمْ كَانُوا عِنْدَ حُذَيْفَةَ فَاسْتَسْقَى فَسَقَاهُ مَجُوسِيٌّ‏.‏ فَلَمَّا وَضَعَ الْقَدَحَ فِي يَدِهِ رَمَاهُ بِهِ وَقَالَ لَوْلاَ أَنِّي نَهَيْتُهُ غَيْرَ مَرَّةٍ وَلاَ مَرَّتَيْنِ‏.‏ كَأَنَّهُ يَقُولُ لَمْ أَفْعَلْ هَذَا، وَلَكِنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ تَلْبَسُوا الْحَرِيرَ وَلاَ الدِّيبَاجَ وَلاَ تَشْرَبُوا فِي آنِيَةِ الذَّهَبِ وَالْفِضَّةِ، وَلاَ تَأْكُلُوا فِي صِحَافِهَا، فَإِنَّهَا لَهُمْ فِي الدُّنْيَا وَلَنَا فِي الآخِرَةِ ‏\"‏‏.‏"
      },
      {
        "id": 5192,
        "hadith_number": "5427",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perumpamaan Orang Beriman yang Membaca dan Tidak Membaca Al-Quran",
        "perawi_melayu": "Diriwayatkan oleh Abu Musa Al-Ash`ari رضی اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) said, \"The example of a Believer who recites the Qur'an, is that of a citron which smells good and tastes good; And the example of a Believer who does not recite the Qur'an, is that of a date which has no smell but tastes sweet; and the example of a hypocrite who recites the Qur'an, is that of an aromatic plant which smells good but tastes bitter; and the example of a hypocrite who does not recite the Qur'an, is that of a colocynth plant which has no smell and is bitter in taste.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Perumpamaan orang beriman yang membaca Al-Quran adalah seperti buah limau yang baunya harum dan rasanya sedap; Dan perumpamaan orang beriman yang tidak membaca Al-Quran adalah seperti buah kurma yang tidak berbau tetapi rasanya manis; dan perumpamaan orang munafik yang membaca Al-Quran adalah seperti tumbuhan yang harum baunya tetapi rasanya pahit; dan perumpamaan orang munafik yang tidak membaca Al-Quran adalah seperti buah colocynth yang tidak berbau dan pahit rasanya.\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏مَثَلُ الْمُؤْمِنِ الَّذِي يَقْرَأُ الْقُرْآنَ كَمَثَلِ الأُتْرُجَّةِ، رِيحُهَا طَيِّبٌ وَطَعْمُهَا طَيِّبٌ، وَمَثَلُ الْمُؤْمِنِ الَّذِي لاَ يَقْرَأُ الْقُرْآنَ كَمَثَلِ التَّمْرَةِ لاَ رِيحَ لَهَا وَطَعْمُهَا حُلْوٌ، وَمَثَلُ الْمُنَافِقِ الَّذِي يَقْرَأُ الْقُرْآنَ مَثَلُ الرَّيْحَانَةِ، رِيحُهَا طَيِّبٌ وَطَعْمُهَا مُرٌّ، وَمَثَلُ الْمُنَافِقِ الَّذِي لاَ يَقْرَأُ الْقُرْآنَ كَمَثَلِ الْحَنْظَلَةِ، لَيْسَ لَهَا رِيحٌ وَطَعْمُهَا مُرٌّ ‏\"‏‏.‏"
      },
      {
        "id": 5193,
        "hadith_number": "5428",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keutamaan Aisyah (ra) seperti Keutamaan Tharid",
        "perawi_melayu": "Diriwayatkan daripada Anas رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) said, \"The superiority of `Aisha رضی اللہ عنہا to other ladies is like the superiority of Tharid to other kinds of food.\"",
        "malay_translation": "Nabi (ﷺ) bersabda, \"Keutamaan `Aisyah رضی اللہ عنہ ke atas wanita-wanita lain adalah seperti keutamaan Tharid ke atas jenis-jenis makanan yang lain.\"",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا خَالِدٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ فَضْلُ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ ‏\"‏‏.‏"
      },
      {
        "id": 5194,
        "hadith_number": "5429",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Musafir Itu Satu Azab dan Hendaklah Cepat Kembali ke Keluarga",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah رضي اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) said, \"Traveling is a kind of torture, as it prevents one from sleeping and eating! So when one has finished his job, he should return quickly to his family.\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Musafir itu adalah satu jenis azab, kerana ia menghalang seseorang daripada tidur dan makan! Oleh itu, apabila seseorang telah selesai urusannya, hendaklah dia segera kembali kepada keluarganya.\"",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مَالِكٌ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ السَّفَرُ قِطْعَةٌ مِنَ الْعَذَابِ، يَمْنَعُ أَحَدَكُمْ نَوْمَهُ وَطَعَامَهُ، فَإِذَا قَضَى نَهْمَتَهُ مِنْ وَجْهِهِ فَلْيُعَجِّلْ إِلَى أَهْلِهِ ‏\"‏‏.‏"
      },
      {
        "id": 5195,
        "hadith_number": "5430",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Tiga Perkara Berkaitan Barirah",
        "perawi_melayu": "Diriwayatkan oleh Qasim bin Muhammad",
        "english_text": "Three traditions have been established because of Barira رضی اللہ عنہا : `Aisha رضی اللہ عنہا intended to buy her and set her free, but Barira's masters said, \"Her wala' will be for us.\" `Aisha رضی اللہ عنہا mentioned that to Allah's Messenger (ﷺ) who said, \"You could accept their condition if you wished, for the wala is for the one who manumits the slave.\" Barira رضی اللہ عنہا was manumitted, then she was given the choice either to stay with her husband or leave him; One day Allah's Messenger (ﷺ) entered `Aisha's house while there was a cooking pot of food boiling on the fire. The Prophet (ﷺ) asked for lunch, and he was presented with bread and some extra food from the home-made Udm (e.g. soup). He asked, \"Don't I see meat (being cooked)?\" They said, \"Yes, O Allah's Apostle! But it is the meat that has been given to Barira رضی اللہ عنہا in charity and she has given it to us as a present.\" He said, \"For Barira رضی اللہ عنہا it is alms, but for us it is a present.\"",
        "malay_translation": "Tiga perkara telah ditetapkan disebabkan oleh Barirah رضی اللہ عنہا : `Aisyah رضی اللہ عنہا berhasrat untuk membelinya dan memerdekakannya, tetapi tuan Barirah berkata, \"Wala'nya adalah untuk kami.\" `Aisyah رضی اللہ عنہا menceritakan hal itu kepada Rasulullah (ﷺ) yang bersabda, \"Kamu boleh menerima syarat mereka jika kamu mahu, kerana wala' adalah untuk orang yang memerdekakan hamba.\" Barirah رضی اللہ عنہا telah dimerdekakan, kemudian dia diberi pilihan sama ada untuk tinggal bersama suaminya atau meninggalkannya; Pada suatu hari, Rasulullah (ﷺ) memasuki rumah `Aisyah ketika terdapat periuk makanan sedang mendidih di atas api. Nabi (ﷺ) meminta makan tengah hari, dan beliau dihidangkan dengan roti dan sedikit makanan tambahan dari Udm (cth. sup) buatan sendiri. Beliau bertanya, \"Tidakkah aku melihat daging (sedang dimasak)?\" Mereka berkata, \"Ya, wahai Rasulullah! Tetapi ia adalah daging yang telah diberikan kepada Barirah رضی اللہ عنہا dalam sedekah dan dia telah memberikannya kepada kami sebagai hadiah.\" Beliau bersabda, \"Bagi Barirah رضی اللہ عنہا ia adalah sedekah, tetapi bagi kami ia adalah hadiah.\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ رَبِيعَةَ، أَنَّهُ سَمِعَ الْقَاسِمَ بْنَ مُحَمَّدٍ، يَقُولُ كَانَ فِي بَرِيرَةَ ثَلاَثُ سُنَنٍ، أَرَادَتْ عَائِشَةُ أَنْ تَشْتَرِيَهَا فَتُعْتِقَهَا، فَقَالَ أَهْلُهَا، وَلَنَا الْوَلاَءُ، فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ لَوْ شِئْتِ شَرَطْتِيهِ لَهُمْ، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ قَالَ وَأُعْتِقَتْ فَخُيِّرَتْ فِي أَنْ تَقِرَّ تَحْتَ زَوْجِهَا أَوْ تُفَارِقَهُ، وَدَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمًا بَيْتَ عَائِشَةَ وَعَلَى النَّارِ بُرْمَةٌ تَفُورُ، فَدَعَا بِالْغَدَاءِ فَأُتِيَ بِخُبْزٍ وَأُدْمٍ مِنْ أُدْمِ الْبَيْتِ فَقَالَ ‏\"‏ أَلَمْ أَرَ لَحْمًا ‏\"‏‏.‏ قَالُوا بَلَى يَا رَسُولَ اللَّهِ، وَلَكِنَّهُ لَحْمٌ تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ، فَأَهْدَتْهُ لَنَا‏.‏ فَقَالَ‏\"‏ هُوَ صَدَقَةٌ عَلَيْهَا، وَهَدِيَّةٌ لَنَا ‏\"‏‏.‏"
      },
      {
        "id": 5196,
        "hadith_number": "5431",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kecintaan Rasulullah (ﷺ) kepada Makanan Manis dan Madu",
        "perawi_melayu": "Diriwayatkan daripada 'Aisha رضي الله عنها:",
        "english_text": "Allah's Messenger (ﷺ) used to love sweet edible things and honey.",
        "malay_translation": "Rasulullah (ﷺ) amat menyukai makanan manis dan madu.",
        "arabic_text": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، عَنْ أَبِي أُسَامَةَ، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُحِبُّ الْحَلْوَاءَ وَالْعَسَلَ‏.‏"
      },
      {
        "id": 5197,
        "hadith_number": "5432",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Abu Hurairah: Menemani Rasulullah (ﷺ) dalam Kehidupan Sederhana",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ عنہ :",
        "english_text": "I used to accompany Allah's Messenger (ﷺ) to fill my stomach; and that was when I did not eat baked bread, nor wear silk. Neither a male nor a female slave used to serve me, and I used to bind stones over my belly and ask somebody to recite a Qur'anic Verse for me though I knew it, so that he might take me to his house and feed me. Ja`far bin Abi Talib رضی اللہ عنہ was very kind to the poor, and he used to take us and feed us with what ever was available in his house, (and if nothing was available), he used to give us the empty (honey or butter) skin which we would tear and lick whatever was in it.",
        "malay_translation": "Dahulu saya sering menemani Rasulullah ﷺ untuk mengisi perut saya; dan ketika itu saya tidak makan roti yang dibakar, mahupun memakai sutera. Tidak ada hamba lelaki mahupun perempuan yang melayani saya, dan saya biasa mengikat batu di perut saya dan meminta seseorang membacakan ayat al-Quran untuk saya walaupun saya mengetahuinya, supaya dia dapat membawa saya ke rumahnya dan memberi makan kepada saya. Ja`far bin Abi Talib رضی اللہ عنہ sangat baik hati kepada orang miskin, dan dia selalu membawa kami dan memberi makan kepada kami dengan apa sahaja yang ada di rumahnya, (dan jika tiada apa-apa), dia memberi kami kulit (madu atau mentega) yang kosong yang kami akan koyak dan jilat apa sahaja yang ada di dalamnya.",
        "arabic_text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ شَيْبَةَ، قَالَ أَخْبَرَنِي ابْنُ أَبِي الْفُدَيْكِ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنِ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كُنْتُ أَلْزَمُ النَّبِيَّ صلى الله عليه وسلم لِشِبَعِ بَطْنِي حِينَ لاَ آكُلُ الْخَمِيرَ، وَلاَ أَلْبَسُ الْحَرِيرَ، وَلاَ يَخْدُمُنِي فُلاَنٌ وَلاَ فُلاَنَةُ، وَأُلْصِقُ بَطْنِي بِالْحَصْبَاءِ، وَأَسْتَقْرِئُ الرَّجُلَ الآيَةَ وَهْىَ مَعِي كَىْ يَنْقَلِبَ بِي فَيُطْعِمَنِي، وَخَيْرُ النَّاسِ لِلْمَسَاكِينِ جَعْفَرُ بْنُ أَبِي طَالِبٍ، يَنْقَلِبُ بِنَا فَيُطْعِمُنَا مَا كَانَ فِي بَيْتِهِ، حَتَّى إِنْ كَانَ لَيُخْرِجُ إِلَيْنَا الْعُكَّةَ لَيْسَ فِيهَا شَىْءٌ، فَنَشْتَقُّهَا فَنَلْعَقُ مَا فِيهَا‏.‏"
      },
      {
        "id": 5198,
        "hadith_number": "5433",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah ﷺ dan Kegemaran Makan Labu",
        "perawi_melayu": "Diriwayatkan oleh Anas رضي الله عنه:",
        "english_text": "Allah's Messenger (ﷺ) went to (the house of) his slave tailor, and he was offered (a dish of) gourd of which he started eating. I have loved to eat gourd since I saw Allah's Messenger (ﷺ) eating it.",
        "malay_translation": "Rasulullah ﷺ pergi ke rumah tukang jahit hambanya, dan baginda dihidangkan dengan (hidangan) labu yang baginda mula makan. Saya sangat suka makan labu sejak saya melihat Rasulullah ﷺ memakannya.",
        "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا أَزْهَرُ بْنُ سَعْدٍ، عَنِ ابْنِ عَوْنٍ، عَنْ ثُمَامَةَ بْنِ أَنَسٍ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَتَى مَوْلًى لَهُ خَيَّاطًا، فَأُتِيَ بِدُبَّاءٍ، فَجَعَلَ يَأْكُلُهُ، فَلَمْ أَزَلْ أُحِبُّهُ مُنْذُ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْكُلُهُ‏.‏"
      },
      {
        "id": 5199,
        "hadith_number": "5434",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Adab Menjamu Tetamu dan Perihal Tambahan Tetamu",
        "perawi_melayu": "Diriwayatkan daripada Abu Mas`ud Al-Ansari رضی اللہ عنہ :",
        "english_text": "There was a man called Abu Shu'aib, and he had a slave who was a butcher. He said (to his slave), \"Prepare a meal to which I may invite Allah's Messenger (ﷺ) along with four other men.\" So he invited Allah's Messenger (ﷺ) and four other men, but another man followed them whereupon the Prophet (ﷺ) said, \"You have invited me as one of five guests, but now another man has followed us. If you wish you can admit him, and if you wish you can refuse him.\" On that the host said, \"But I admit him.\" Narrated Muhammad bin Isma`il: If guests are sitting at a dining table, they do not have the right to carry food from other tables to theirs, but they can pass on food from their own table to each other; otherwise they should leave it.",
        "malay_translation": "Ada seorang lelaki bernama Abu Shu'aib, dan dia mempunyai seorang hamba yang merupakan seorang tukang daging. Dia berkata (kepada hambanya), \"Sediakanlah hidangan untukku menjemput Rasulullah (ﷺ) bersama empat orang lelaki yang lain.\" Lalu dia menjemput Rasulullah (ﷺ) dan empat orang lelaki yang lain, tetapi seorang lagi lelaki mengikuti mereka. Maka Nabi (ﷺ) bersabda, \"Kamu telah menjemputku sebagai salah seorang daripada lima orang tetamu, tetapi sekarang ada seorang lagi lelaki mengikuti kita. Jika kamu mahu, kamu boleh menerimanya, dan jika kamu mahu, kamu boleh menolaknya.\" Mendengar itu, tuan rumah berkata, \"Tetapi saya menerimanya.\" Diriwayatkan oleh Muhammad bin Isma`il: Jika para tetamu sedang duduk di meja makan, mereka tidak berhak mengambil makanan daripada meja lain ke meja mereka, tetapi mereka boleh menghulurkan makanan dari meja mereka sendiri kepada satu sama lain; jika tidak, mereka harus meninggalkannya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ، قَالَ كَانَ مِنَ الأَنْصَارِ رَجُلٌ يُقَالُ لَهُ أَبُو شُعَيْبٍ، وَكَانَ لَهُ غُلاَمٌ لَحَّامٌ فَقَالَ اصْنَعْ لِي طَعَامًا أَدْعُو رَسُولَ اللَّهِ صلى الله عليه وسلم خَامِسَ خَمْسَةٍ، فَدَعَا رَسُولَ اللَّهِ صلى الله عليه وسلم خَامِسَ خَمْسَةٍ، فَتَبِعَهُمْ رَجُلٌ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّكَ دَعَوْتَنَا خَامِسَ خَمْسَةٍ وَهَذَا رَجُلٌ قَدْ تَبِعَنَا، فَإِنْ شِئْتَ أَذِنْتَ لَهُ، وَإِنْ شِئْتَ تَرَكْتَهُ ‏\"‏‏.‏ قَالَ بَلْ أَذِنْتُ لَهُ‏.‏ قَالَ مُحَمَّدُ بْنُ يُوسُفَ سَمِعْتُ مُحَمَّدَ بْنَ إِسْمَاعِيْلَ يَقُولُ إِذَا كَانَ الْقَوْمُ عَلَى الْمَائِدَةِ لَيْسَ لَهُمْ أَنْ يُنَاوِلُوا مِنْ مَائِدَةٍ إِلَى مَائِدَةٍ أُخْرَى وَلَكِنْ يُنَاوِلُ بَعْضُهُمْ بَعْضًا فِي تِلْكَ الْمَائِدَةِ أَوْ يَدَعُ"
      },
      {
        "id": 5200,
        "hadith_number": "5435",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kecintaan Anas terhadap Labu",
        "perawi_melayu": "Diriwayatkan daripada Anas رضی اللہ عنہ :",
        "english_text": "I was a young boy when I once was walking with Allah's Messenger (ﷺ) . Allah's Messenger (ﷺ) entered the house of his slave tailor and the latter brought a dish filled with food covered with pieces of gourd. Allah's Apostle started picking and eating the gourd. When I saw that, I started collecting and placing the gourd before him. Then the slave returned to his work. Anas رضی اللہ عنہ added: I have kept on loving gourd since I saw Allah's Messenger (ﷺ) doing what he was doing.",
        "malay_translation": "Saya masih kanak-kanak ketika suatu ketika saya berjalan bersama Rasulullah (ﷺ). Rasulullah (ﷺ) memasuki rumah tukang jahit hambanya, dan yang terakhir membawa hidangan yang dipenuhi dengan makanan yang ditutup dengan potongan labu. Rasulullah mula memungut dan memakan labu itu. Apabila saya melihat itu, saya mula mengumpul dan meletakkan labu di hadapannya. Kemudian hamba itu kembali bekerja. Anas رضی اللہ عنہ menambah: Saya terus menyukai labu sejak saya melihat Rasulullah (ﷺ) melakukan apa yang dia lakukan.",
        "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُنِيرٍ، سَمِعَ النَّضْرَ، أَخْبَرَنَا ابْنُ عَوْنٍ، قَالَ أَخْبَرَنِي ثُمَامَةُ بْنُ عَبْدِ اللَّهِ بْنِ أَنَسٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كُنْتُ غُلاَمًا أَمْشِي مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَدَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى غُلاَمٍ لَهُ خَيَّاطٍ، فَأَتَاهُ بِقَصْعَةٍ فِيهَا طَعَامٌ وَعَلَيْهِ دُبَّاءٌ، فَجَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَتَتَبَّعُ الدُّبَّاءَ ـ قَالَ ـ فَلَمَّا رَأَيْتُ ذَلِكَ جَعَلْتُ أَجْمَعُهُ بَيْنَ يَدَيْهِ ـ قَالَ ـ فَأَقْبَلَ الْغُلاَمُ عَلَى عَمَلِهِ‏.‏ قَالَ أَنَسٌ لاَ أَزَالُ أُحِبُّ الدُّبَّاءَ بَعْدَ مَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم صَنَعَ مَا صَنَعَ‏.‏"
      },
      {
        "id": 5201,
        "hadith_number": "5436",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah ﷺ Menerima Jemputan Tukang Jahit dan Kegemaran Labu",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik رضي الله عنه:",
        "english_text": "A tailor invited the Prophet (ﷺ) to a meal which he had prepared, and I went along with the Prophet (ﷺ) . The tailor presented barley bread and soup containing gourd and cured meat. I saw the Prophet (ﷺ) picking the pieces of gourd from around the dish, and since then I have kept on liking gourd.",
        "malay_translation": "Seorang tukang jahit menjemput Nabi ﷺ ke suatu jamuan yang telah disediakan, dan aku pergi bersama Nabi ﷺ. Tukang jahit itu menghidangkan roti barli dan sup yang mengandungi labu dan daging yang telah diawet. Aku melihat Nabi ﷺ memilih potongan labu dari sekeliling hidangan itu, dan sejak itu aku terus menyukai labu.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، أَنَّ خَيَّاطًا، دَعَا النَّبِيَّ صلى الله عليه وسلم لِطَعَامٍ صَنَعَهُ، فَذَهَبْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم فَقَرَّبَ خُبْزَ شَعِيرٍ وَمَرَقًا فِيهِ دُبَّاءٌ وَقَدِيدٌ، فَرَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَتَتَبَّعُ الدُّبَّاءَ مِنْ حَوَالَىِ الْقَصْعَةِ، فَلَمْ أَزَلْ أُحِبُّ الدُّبَّاءَ بَعْدَ يَوْمِئِذٍ‏.‏"
      },
      {
        "id": 5202,
        "hadith_number": "5437",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Makan Labu dalam Sup",
        "perawi_melayu": "Diriwayatkan daripada Anas رضي اللہ عنہ :",
        "english_text": "I saw the Prophet (ﷺ) being served with soup and containing gourd and cured meat, and I saw him picking and eating the pieces of gourd.",
        "malay_translation": "Saya melihat Nabi (ﷺ) dihidangkan dengan sup yang mengandungi labu dan daging kering, dan saya melihat baginda memilih dan memakan kepingan labu tersebut.",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم أُتِيَ بِمَرَقَةٍ فِيهَا دُبَّاءٌ وَقَدِيدٌ، فَرَأَيْتُهُ يَتَتَبَّعُ الدُّبَّاءَ يَأْكُلُهَا‏.‏"
      },
      {
        "id": 5203,
        "hadith_number": "5438",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Menyimpan Daging Korban dan Kehidupan Keluarga Nabi ﷺ",
        "perawi_melayu": "Diriwayatkan daripada 'Aishah رضي الله عنها :",
        "english_text": "The Prophet (ﷺ) did not do that (i.e., forbade the storage of the meat of sacrifices for three days) except (he did so) so that the rich would feed the poor. But later we used to keep even trotters to cook, fifteen days later. The family of Muhammad did not eat wheat bread with meat or soup to their satisfaction for three successive days.",
        "malay_translation": "Nabi ﷺ tidak melakukan hal itu (iaitu, melarang penyimpanan daging korban selama tiga hari) kecuali (baginda berbuat demikian) supaya orang kaya dapat memberi makan kepada orang miskin. Tetapi kemudian kami pernah menyimpan juga kaki (kambing/lembu) untuk dimasak, lima belas hari kemudian. Keluarga Muhammad tidak pernah makan roti gandum dengan daging atau sup sehingga puas selama tiga hari berturut-turut.",
        "arabic_text": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا فَعَلَهُ إِلاَّ فِي عَامٍ جَاعَ النَّاسُ، أَرَادَ أَنْ يُطْعِمَ الْغَنِيُّ الْفَقِيرَ، وَإِنْ كُنَّا لَنَرْفَعُ الْكُرَاعَ بَعْدَ خَمْسَ عَشْرَةَ، وَمَا شَبِعَ آلُ مُحَمَّدٍ صلى الله عليه وسلم مَنْ خُبْزِ بُرٍّ مَأْدُومٍ ثَلاَثًا‏.‏"
      },
      {
        "id": 5204,
        "hadith_number": "5439",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah ﷺ Menerima Jemputan Tukang Jahit dan Kegemaran Labu",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik رضي اللہ عنہ :",
        "english_text": "A tailor invited Allah's Messenger (ﷺ) to a meal which he had prepared. I went with Allah's Messenger (ﷺ) to that meal, and the tailor served the Prophet (ﷺ) with barley bread and soup of gourd and cured meat. I saw Allah's Messenger (ﷺ) picking the pieces of gourd from around the dish, and since then I have kept on liking gourd.",
        "malay_translation": "Seorang tukang jahit menjemput Rasulullah ﷺ ke suatu jamuan yang telah disediakan olehnya. Aku turut bersama Rasulullah ﷺ ke jamuan tersebut, dan tukang jahit itu menghidangkan kepada Nabi ﷺ roti barli dan sup labu serta daging yang diawet. Aku melihat Rasulullah ﷺ mengambil kepingan labu dari sekeliling hidangan itu, dan sejak itu aku terus menyukai labu.",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ إِنَّ خَيَّاطًا دَعَا رَسُولَ اللَّهِ صلى الله عليه وسلم لِطَعَامٍ صَنَعَهُ ـ قَالَ أَنَسٌ ـ فَذَهَبْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى ذَلِكَ الطَّعَامِ، فَقَرَّبَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم خُبْزًا مِنْ شَعِيرٍ وَمَرَقًا فِيهِ دُبَّاءٌ وَقَدِيدٌ ـ قَالَ أَنَسٌ ـ فَرَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَتَتَبَّعُ الدُّبَّاءَ مِنْ حَوْلِ الصَّحْفَةِ، فَلَمْ أَزَلْ أُحِبُّ الدُّبَّاءَ مِنْ يَوْمِئِذٍ‏.‏ وَقَالَ ثُمَامَةُ عَنْ أَنَسٍ، فَجَعَلْتُ أَجْمَعُ الدُّبَّاءَ بَيْنَ يَدَيْهِ‏.‏"
      },
      {
        "id": 5205,
        "hadith_number": "5440",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah SAW Memakan Kurma Segar Bersama Timun Ular",
        "perawi_melayu": "Diriwayatkan oleh Abdullah bin Ja`far bin Abi Talib رضی اللہ عنہما :",
        "english_text": "I saw Allah's Messenger (ﷺ) eating fresh dates with snake cucumber.",
        "malay_translation": "Saya melihat Rasulullah (ﷺ) memakan buah kurma segar bersama timun ular.",
        "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرِ بْنِ أَبِي طَالِبٍ ـ رضى الله عنهما ـ قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَأْكُلُ الرُّطَبَ بِالْقِثَّاءِ‏.‏"
      },
      {
        "id": 5206,
        "hadith_number": "5441",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Abu Hurairah dan Solat Malam Bergilir-gilir",
        "perawi_melayu": "Diriwayatkan oleh Abu `Uthman",
        "english_text": "I was a guest of Abu Huraira رضی اللہ عنہ for seven days. Abu Huraira رضی اللہ عنہ , his wife and his slave used to get up and remain awake for one-third of the night by turns. Each would offer the night prayer and then awaken the other. I heard Abu Huraira رضی اللہ عنہ saying, \"Allah's Messenger (ﷺ) distributed dates among his companions and my share was seven dates, one of which was a Hashafa (a date which dried on the tree before it was fully ripe).\r\n Abu Huraira رضی اللہ عنہ : The Prophet (ﷺ) distributed dates among us, and my share was five dates, four of which were good, and one was a ,Hashafa, and I found the Hashafa the hardest for my teeth.",
        "malay_translation": "Saya menjadi tetamu Abu Hurairah رضی اللہ عنہ selama tujuh hari. Abu Hurairah رضی اللہ عنہ, isteri beliau dan hambanya bangun dan berjaga bergilir-gilir selama satu pertiga malam. Masing-masing akan menunaikan solat malam dan kemudiannya mengejutkan yang lain. Saya mendengar Abu Hurairah رضی اللہ عنہ berkata, \"Rasulullah (ﷺ) mengagihkan kurma kepada para sahabatnya dan bahagian saya adalah tujuh biji kurma, salah satunya adalah Hashafa (kurma yang kering di pokok sebelum ia masak sepenuhnya).\r\n Abu Hurairah رضی اللہ عنہ : Nabi (ﷺ) mengagihkan kurma di kalangan kami, dan bahagian saya adalah lima biji kurma, empat daripadanya baik, dan satu lagi adalah Hashafa, dan saya mendapati Hashafa paling sukar untuk digigit.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ ، عَنْ عَبَّاسٍ الْجُرَيْرِيِّ ، عَنْ أَبِي عُثْمَانَ ، قَالَ : تَضَيَّفْتُ أَبَا هُرَيْرَةَ سَبْعًا فَكَانَ هُوَ وَامْرَأَتُهُ وَخَادِمُهُ يَعْتَقِبُونَ اللَّيْلَ أَثْلَاثًا ، يُصَلِّي هَذَا ثُمَّ يُوقِظُ هَذَا ، وَسَمِعْتُهُ يَقُولُ : قَسَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ أَصْحَابهِ تَمْرًا ، فَأَصَابَنِي سَبْعُ تَمَرَاتٍ إِحْدَاهُنَّ حَشَفَةٌ. \r\nحَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّاءَ، عَنْ عَاصِمٍ، عَنْ أَبِي عُثْمَانَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَسَمَ النَّبِيُّ صلى الله عليه وسلم بَيْنَنَا تَمْرًا فَأَصَابَنِي مِنْهُ خَمْسٌ أَرْبَعُ تَمَرَاتٍ وَحَشَفَةٌ، ثُمَّ رَأَيْتُ الْحَشَفَةَ هِيَ أَشَدُّهُنَّ لِضِرْسِي‏.‏"
      },
      {
        "id": 5207,
        "hadith_number": "5442",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kecukupan dengan Kurma dan Air Selepas Kewafatan Rasulullah (ﷺ)",
        "perawi_melayu": "Diriwayatkan daripada Aishah رضی اللہ عنہا :",
        "english_text": "\"When Allah's Messenger (ﷺ) died, we had been satisfied by the two black things, i.e., dates and water.\"",
        "malay_translation": "Ketika Rasulullah (ﷺ) wafat, kami merasa cukup dengan dua perkara yang hitam, iaitu kurma dan air.",
        "arabic_text": "وَقَالَ مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ، عَنْ مَنْصُورِ ابْنِ صَفِيَّةَ، حَدَّثَتْنِي أُمِّي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَدْ شَبِعْنَا مِنَ الأَسْوَدَيْنِ التَّمْرِ وَالْمَاءِ‏.‏"
      },
      {
        "id": 5208,
        "hadith_number": "5443",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Jabir dan Pinjaman daripada Orang Yahudi",
        "perawi_melayu": "Riwayat Jabir bin `Abdullah رضی اللہ عنہ :",
        "english_text": "There was a Jew in Medina who used to lend me money up to the season of plucking dates. (Jabir رضی اللہ عنہ had a piece of land which was on the way to Ruma). That year the land was not promising, so the payment of the debt was delayed one year. The Jew came to me at the time of plucking, but gathered nothing from my land. I asked him to give me one year respite, but he refused. This news reached the Prophet (ﷺ) whereupon he said to his companions, \"Let us go and ask the Jew for respite for Jabir رضی اللہ عنہ .\" All of them came to me in my garden, and the Prophet (ﷺ) started speaking to the Jew, but he Jew said, \"O Abu Qasim! I will not grant him respite.\" When the Prophet (ﷺ) saw the Jew's attitude, he stood up and walked all around the garden and came again and talked to the Jew, but the Jew refused his request. I got up and brought some ripe fresh dates and put it in front of the Prophet. He ate and then said to me, \"Where is your hut, O Jabir?\" I informed him, and he said, \"Spread out a bed for me in it.\" I spread out a bed, and he entered and slept. When he woke up, I brought some dates to him again and he ate of it and then got up and talked to the Jew again, but the Jew again refused his request. Then the Prophet (ﷺ) got up for the second time amidst the palm trees loaded with fresh dates, and said, \"O Jabir! Pluck dates to repay your debt.\" The Jew remained with me while I was plucking the dates, till I paid him all his right, yet there remained extra quantity of dates. So I went out and proceeded till I reached the Prophet and informed him of the good news, whereupon he said, \"I testify that I am Allah's Messenger (ﷺ).\"",
        "malay_translation": "Terdapat seorang Yahudi di Madinah yang sering meminjamkan wang kepada saya sehingga musim memetik kurma. (Jabir رضی اللہ عنہ mempunyai sebidang tanah yang terletak di jalan ke Ruma). Pada tahun itu, tanah tersebut tidak memberi hasil yang baik, maka pembayaran hutang ditangguhkan selama setahun. Orang Yahudi itu datang kepada saya pada waktu memetik, tetapi tidak mendapat apa-apa dari tanah saya. Saya meminta kepadanya agar memberi tempoh setahun lagi, tetapi dia enggan. Berita ini sampai kepada Nabi (ﷺ) lalu Baginda berkata kepada para sahabatnya, \"Marilah kita pergi dan meminta orang Yahudi itu memberi tempoh kepada Jabir رضی اللہ عنہ.\" Mereka semua datang kepada saya di kebun saya, dan Nabi (ﷺ) mula bercakap dengan orang Yahudi itu, tetapi orang Yahudi itu berkata, \"Wahai Abu Qasim! Saya tidak akan memberinya tempoh.\" Apabila Nabi (ﷺ) melihat sikap orang Yahudi itu, Baginda bangun dan berjalan mengelilingi kebun itu dan datang lagi dan bercakap dengan orang Yahudi itu, tetapi orang Yahudi itu menolak permintaannya. Saya bangun dan membawa beberapa buah kurma segar yang masak dan meletakkannya di hadapan Nabi. Baginda makan dan kemudian berkata kepada saya, \"Di manakah pondokmu, wahai Jabir?\" Saya memberitahunya, dan dia berkata, \"Bentangkanlah sebuah katil untukku di dalamnya.\" Saya membentangkan sebuah katil, dan dia masuk dan tidur. Apabila dia bangun, saya membawa beberapa buah kurma kepadanya lagi dan dia memakannya dan kemudian bangun dan bercakap dengan orang Yahudi itu lagi, tetapi orang Yahudi itu sekali lagi menolak permintaannya. Kemudian Nabi (ﷺ) bangun untuk kali kedua di tengah-tengah pokok kurma yang sarat dengan kurma segar, dan berkata, \"Wahai Jabir! Petiklah kurma untuk membayar hutangmu.\" Orang Yahudi itu tinggal bersama saya semasa saya memetik kurma, sehingga saya membayarnya semua haknya, namun masih terdapat lebihan kurma. Jadi saya keluar dan berjalan sehingga saya sampai kepada Nabi dan memberitahunya tentang berita gembira itu, lalu dia berkata, \"Saya bersaksi bahawa saya adalah Rasul Allah (ﷺ).\"",
        "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي رَبِيعَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، رضى الله عنهما قَالَ كَانَ بِالْمَدِينَةِ يَهُودِيٌّ وَكَانَ يُسْلِفُنِي فِي تَمْرِي إِلَى الْجِدَادِ، وَكَانَتْ لِجَابِرٍ الأَرْضُ الَّتِي بِطَرِيقِ رُومَةَ فَجَلَسَتْ، فَخَلاَ عَامًا فَجَاءَنِي الْيَهُودِيُّ عِنْدَ الْجَدَادِ، وَلَمْ أَجُدَّ مِنْهَا شَيْئًا، فَجَعَلْتُ أَسْتَنْظِرُهُ إِلَى قَابِلٍ فَيَأْبَى، فَأُخْبِرَ بِذَلِكَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ لأَصْحَابِهِ ‏\"‏ امْشُوا نَسْتَنْظِرْ لِجَابِرٍ مِنَ الْيَهُودِيِّ ‏\"‏‏.‏ فَجَاءُونِي فِي نَخْلِي فَجَعَلَ النَّبِيُّ صلى الله عليه وسلم يُكَلِّمُ الْيَهُودِيَّ فَيَقُولُ أَبَا الْقَاسِمِ لاَ أُنْظِرُهُ‏.‏ فَلَمَّا رَأَى النَّبِيُّ صلى الله عليه وسلم قَامَ فَطَافَ فِي النَّخْلِ، ثُمَّ جَاءَهُ فَكَلَّمَهُ فَأَبَى فَقُمْتُ فَجِئْتُ بِقَلِيلِ رُطَبٍ فَوَضَعْتُهُ بَيْنَ يَدَىِ النَّبِيِّ صلى الله عليه وسلم فَأَكَلَ ثُمَّ قَالَ ‏\"‏ أَيْنَ عَرِيشُكَ يَا جَابِرُ ‏\"‏‏.‏ فَأَخْبَرْتُهُ فَقَالَ ‏\"‏ افْرُشْ لِي فِيهِ ‏\"‏‏.‏ فَفَرَشْتُهُ فَدَخَلَ فَرَقَدَ، ثُمَّ اسْتَيْقَظَ فَجِئْتُهُ بِقَبْضَةٍ أُخْرَى فَأَكَلَ مِنْهَا، ثُمَّ قَامَ فَكَلَّمَ الْيَهُودِيَّ فَأَبَى عَلَيْهِ فَقَامَ فِي الرِّطَابِ فِي النَّخْلِ الثَّانِيَةَ ثُمَّ قَالَ ‏\"‏ يَا جَابِرُ جُدَّ وَاقْضِ ‏\"‏‏.‏ فَوَقَفَ فِي الْجَدَادِ فَجَدَدْتُ مِنْهَا مَا قَضَيْتُهُ وَفَضَلَ مِنْهُ فَخَرَجْتُ حَتَّى جِئْتُ النَّبِيَّ صلى الله عليه وسلم فَبَشَّرْتُهُ فَقَالَ ‏\"‏ أَشْهَدُ أَنِّي رَسُولُ اللَّهِ ‏\"‏‏.‏"
      },
      {
        "id": 5209,
        "hadith_number": "5444",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pokok Kurma: Pokok yang Diberkati Seperti Seorang Muslim",
        "perawi_melayu": "Diriwayatkan daripada Abdullah bin `Umar رضی اللہ عنہما :",
        "english_text": "While we were sitting with the Prophet, fresh dates were brought to him. The Prophet (ﷺ) said, \"There is a tree among the trees which is as blessed as a Muslim\" I thought that it was the date palm tree and intended to say, \"It is the date-palm tree, O Allah's Messenger (ﷺ)!\" but I looked behind to see that I was the tenth and youngest of ten men present there, so I kept quiet' Then the Prophet (ﷺ) said, \"It is the datepalm tree.\"",
        "malay_translation": "Semasa kami duduk bersama Nabi, kurma segar dibawa kepada baginda. Nabi (ﷺ) bersabda, \"Sesungguhnya ada sebatang pokok di kalangan pokok-pokok yang diberkati seperti seorang Muslim.\" Saya menyangka ia adalah pokok kurma dan berniat untuk berkata, \"Ia adalah pokok kurma, wahai Rasulullah (ﷺ)!\" tetapi saya melihat ke belakang untuk melihat bahawa saya adalah orang kesepuluh dan yang termuda daripada sepuluh orang lelaki yang hadir di situ, jadi saya berdiam diri. Kemudian Nabi (ﷺ) bersabda, \"Ia adalah pokok kurma.\"",
        "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي مُجَاهِدٌ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ بَيْنَا نَحْنُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم جُلُوسٌ إِذْ أُتِيَ بِجُمَّارِ نَخْلَةٍ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنَ الشَّجَرِ لَمَا بَرَكَتُهُ كَبَرَكَةِ الْمُسْلِمِ ‏\"‏‏.‏ فَظَنَنْتُ أَنَّهُ يَعْنِي النَّخْلَةَ، فَأَرَدْتُ أَنْ أَقُولَ هِيَ النَّخْلَةُ يَا رَسُولَ اللَّهِ‏.‏ ثُمَّ الْتَفَتُّ فَإِذَا أَنَا عَاشِرُ عَشَرَةٍ أَنَا أَحْدَثُهُمْ فَسَكَتُّ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هِيَ النَّخْلَةُ ‏\"‏‏.‏"
      },
      {
        "id": 5210,
        "hadith_number": "5445",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keutamaan Makan Tujuh Biji Kurma 'Ajwa Setiap Pagi",
        "perawi_melayu": "Diriwayatkan oleh Sa`d رضی اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) said, \"He who eats seven 'Ajwa dates every morning, will not be affected by poison or magic on the day he eats them.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Sesiapa yang memakan tujuh biji kurma 'Ajwa setiap pagi, dia tidak akan terkena racun atau sihir pada hari dia memakannya.\"",
        "arabic_text": "حَدَّثَنَا جُمْعَةُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مَرْوَانُ، أَخْبَرَنَا هَاشِمُ بْنُ هَاشِمٍ، أَخْبَرَنَا عَامِرُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ تَصَبَّحَ كُلَّ يَوْمٍ سَبْعَ تَمَرَاتٍ عَجْوَةً لَمْ يَضُرُّهُ فِي ذَلِكَ الْيَوْمِ سُمٌّ وَلاَ سِحْرٌ ‏\"‏‏.‏"
      },
      {
        "id": 5211,
        "hadith_number": "5446",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Memakan Dua Biji Kurma Sekaligus (Kecuali dengan Kebenaran)",
        "perawi_melayu": "Diriwayatkan oleh Jabala bin Suhaim.",
        "english_text": "At the time of Ibn Az-Zubair رضي اللہ عنہما , we were struck with famine, and he provided us with dates for our food. `Abdullah bin `Umar used to pass by us while we were eating, and say, \"Do not eat two dates together at a time, for the Prophet (ﷺ) forbade the taking of two dates together at a time (in a gathering).\" Ibn `Umar رضی اللہ عنہما used to add, \"Unless one takes the permission of one's companions.\" Shobah narrates: ''permission'' is said by Hadrat Ibn-e-Umer رضی اللہ عنہما .",
        "malay_translation": "Pada zaman Ibn Az-Zubair رضي اللہ عنہما, kami dilanda kebuluran, dan beliau menyediakan kurma untuk makanan kami. Abdullah bin Umar pernah melalui kami ketika kami sedang makan, lalu berkata, \"Jangan makan dua biji kurma sekaligus, kerana Nabi (ﷺ) melarang memakan dua biji kurma sekaligus (dalam satu majlis).\" Ibn Umar رضي اللہ عنہما  biasa menambah, \"Kecuali jika seseorang mendapat keizinan daripada rakan-rakannya.\" Shobah meriwayatkan: ''keizinan'' dikatakan oleh Hadrat Ibn-e-Umer رضي اللہ عنہما.",
        "arabic_text": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا جَبَلَةُ بْنُ سُحَيْمٍ، قَالَ أَصَابَنَا عَامُ سَنَةٍ مَعَ ابْنِ الزُّبَيْرِ فَرَزَقَنَا تَمْرًا، فَكَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ يَمُرُّ بِنَا وَنَحْنُ نَأْكُلُ وَيَقُولُ لاَ تُقَارِنُوا فَإِنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ الْقِرَانِ‏.‏ ثُمَّ يَقُولُ إِلاَّ أَنْ يَسْتَأْذِنَ الرَّجُلُ أَخَاهُ‏.‏ قَالَ شُعْبَةُ الإِذْنُ مِنْ قَوْلِ ابْنِ عُمَرَ‏.‏"
      },
      {
        "id": 5212,
        "hadith_number": "5447",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi (ﷺ) Makan Kurma Segar Bersama Timun Ular",
        "perawi_melayu": "Diriwayatkan daripada Abdullah bin Ja`far رضی اللہ عنہ :",
        "english_text": "I saw the Prophet (ﷺ) eating fresh dates with snake cucumbers.",
        "malay_translation": "Aku melihat Nabi (ﷺ) memakan kurma segar bersama timun ular.",
        "arabic_text": "حَدَّثَنِي إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ جَعْفَرٍ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَأْكُلُ الرُّطَبَ بِالْقِثَّاءِ‏.‏"
      },
      {
        "id": 5213,
        "hadith_number": "5448",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pokok Kurma: Gambaran Seorang Muslim yang Baik",
        "perawi_melayu": "Diriwayatkan oleh Ibnu Umar رضی اللہ عنہما :",
        "english_text": "The Prophet (ﷺ) said, \"There is a tree among the trees which is similar to a Muslim (in goodness), and that is the date palm tree.\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Sesungguhnya di antara pokok ada satu pokok yang (dalam kebaikan) menyerupai seorang Muslim, iaitu pokok kurma.\"",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مُحَمَّدُ بْنُ طَلْحَةَ، عَنْ زُبَيْدٍ، عَنْ مُجَاهِدٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏مِنَ الشَّجَرِ شَجَرَةٌ تَكُونُ مِثْلَ الْمُسْلِمِ، وَهْىَ النَّخْلَةُ ‏\"‏‏.‏"
      },
      {
        "id": 5214,
        "hadith_number": "5449",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah ﷺ Makan Kurma Segar Bersama Timun Ular",
        "perawi_melayu": "Diriwayatkan daripada Abdullah bin Ja`far رضي الله عنهما :",
        "english_text": "I saw Allah's Messenger (ﷺ) eating fresh dates with snake cucumbers.",
        "malay_translation": "Saya melihat Rasulullah ﷺ makan kurma segar bersama timun ular.",
        "arabic_text": "حَدَّثَنَا ابْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ ـ رضى الله عنهما ـ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْكُلُ الرُّطَبَ بِالْقِثَّاءِ‏.‏"
      },
      {
        "id": 5215,
        "hadith_number": "5450",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Makanan Rasulullah SAW Bersama Sahabat",
        "perawi_melayu": "Diriwayatkan oleh Anas رضی اللہ عنہ :",
        "english_text": "My mother, Um Sulaim رضی اللہ عنہا , took a Mudd of barley grain, ground it and made porridge from it, and pressed (over it), a butter skin she had with her. Then she sent me to the Prophet, and I reached him while he was sitting with his companions. I invited him, whereupon he said, \"And those who are with me?' I returned and said, \"He says, 'And those who are with me?\" Abu Talha went out to him and said, \"O Allah's Messenger (ﷺ)! It is just a meal prepared by Um Sulaim.\" The Prophet (ﷺ) entered and the food was brought to him. He said, \"Let ten persons enter upon me.\" Those ten entered and ate their fill. Again he said, 'Let ten (more) enter upon me.\" Those ten entered and ate their fill. Then he said, \"Let ten (more) enter upon me.\" He called forty persons in all Then Allah's Messenger (ﷺ) ate and got up. I started looking (at the food) to see if it decreased or not.",
        "malay_translation": "Ibuku, Um Sulaim رضی اللہ عنہا , mengambil satu *Mudd* daripada biji-bijian barli, menggilingnya dan membuat bubur daripadanya, dan menekan (di atasnya) kulit mentega yang dia miliki. Kemudian dia menghantarku kepada Nabi, dan aku sampai kepadanya ketika dia sedang duduk bersama para sahabatnya. Aku mengundangnya, lalu dia berkata, \"Dan mereka yang bersamaku?\" Aku kembali dan berkata, \"Dia berkata, 'Dan mereka yang bersamaku?\" Abu Talha pergi kepadanya dan berkata, \"Wahai Rasulullah (ﷺ)! Ia hanyalah hidangan yang disediakan oleh Um Sulaim.\" Nabi (ﷺ) masuk dan makanan itu dibawa kepadanya. Dia berkata, \"Biarlah sepuluh orang masuk kepadaku.\" Sepuluh orang itu masuk dan makan hingga kenyang. Sekali lagi dia berkata, 'Biarlah sepuluh (lagi) masuk kepadaku.\" Sepuluh orang itu masuk dan makan hingga kenyang. Kemudian dia berkata, \"Biarlah sepuluh (lagi) masuk kepadaku.\" Dia memanggil empat puluh orang semuanya. Kemudian Rasulullah (ﷺ) makan dan bangun. Aku mula melihat (makanan) untuk melihat sama ada ia berkurang atau tidak.",
        "arabic_text": "حَدَّثَنَا الصَّلْتُ بْنُ مُحَمَّدٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنِ الْجَعْدِ أَبِي عُثْمَانَ، عَنْ أَنَسٍ،‏.‏ وَعَنْ هِشَامٍ، عَنْ مُحَمَّدٍ، عَنْ أَنَسٍ،‏.‏ وَعَنْ سِنَانٍ أَبِي رَبِيعَةَ، عَنْ أَنَسٍ، أَنَّ أُمَّ سُلَيْمٍ، أُمَّهُ عَمَدَتْ إِلَى مُدٍّ مِنْ شَعِيرٍ، جَشَّتْهُ وَجَعَلَتْ مِنْهُ خَطِيفَةً، وَعَصَرَتْ عُكَّةً عِنْدَهَا، ثُمَّ بَعَثَتْنِي إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَتَيْتُهُ وَهْوَ فِي أَصْحَابِهِ فَدَعَوْتُهُ قَالَ ‏\"‏ وَمَنْ مَعِي ‏\"‏‏.‏ فَجِئْتُ فَقُلْتُ إِنَّهُ يَقُولُ، وَمَنْ مَعِي، فَخَرَجَ إِلَيْهِ أَبُو طَلْحَةَ قَالَ يَا رَسُولَ اللَّهِ إِنَّمَا هُوَ شَىْءٌ صَنَعَتْهُ أُمُّ سُلَيْمٍ، فَدَخَلَ فَجِيءَ بِهِ وَقَالَ ‏\"‏ أَدْخِلْ عَلَىَّ عَشَرَةً ‏\"‏‏.‏ فَدَخَلُوا فَأَكَلُوا حَتَّى شَبِعُوا، ثُمَّ قَالَ ‏\"‏ أَدْخِلْ عَلَىَّ عَشَرَةً ‏\"‏‏.‏ فَدَخَلُوا فَأَكَلُوا حَتَّى شَبِعُوا، ثُمَّ قَالَ ‏\"‏ أَدْخِلْ عَلَىَّ عَشَرَةً ‏\"‏‏.‏ حَتَّى عَدَّ أَرْبَعِينَ، ثُمَّ أَكَلَ النَّبِيُّ صلى الله عليه وسلم ثُمَّ قَامَ، فَجَعَلْتُ أَنْظُرُ هَلْ نَقَصَ مِنْهَا شَىْءٌ‏.‏"
      },
      {
        "id": 5216,
        "hadith_number": "5451",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Mendekati Masjid Setelah Makan Bawang Putih",
        "perawi_melayu": "Diriwayatkan daripada `Abdul `Aziz:",
        "english_text": "It was said to Anas رضی اللہ عنہ \"What did you hear the Prophet (ﷺ) saying about garlic?\" Anas replied, \"Whoever has eaten (garlic) should not approach our mosque.\"",
        "malay_translation": "Dikatakan kepada Anas رضی اللہ عنہ, \"Apakah yang engkau dengar Nabi (ﷺ) bersabda mengenai bawang putih?\" Anas menjawab, \"Sesiapa yang telah makan (bawang putih) tidak boleh mendekati masjid kami.\"",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ، قَالَ قِيلَ لأَنَسٍ مَا سَمِعْتَ النَّبِيَّ صلى الله عليه وسلم فِي الثُّومِ فَقَالَ ‏ \"‏ مَنْ أَكَلَ فَلاَ يَقْرَبَنَّ مَسْجِدَنَا ‏\"‏‏.‏"
      },
      {
        "id": 5217,
        "hadith_number": "5452",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Memakan Bawang Putih atau Bawang Merah Sebelum Ke Masjid",
        "perawi_melayu": "Diriwayatkan oleh Jabir bin `Abdullah رضی اللہ عنہما :",
        "english_text": "The Prophet (ﷺ) said, \"Whoever has eaten garlic or onion should keep away from us (or should keep away from our mosque).'",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Sesiapa yang telah memakan bawang putih atau bawang merah, hendaklah dia menjauhkan diri daripada kami (atau menjauhkan diri daripada masjid kami).\"",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا أَبُو صَفْوَانَ عَبْدُ اللَّهِ بْنُ سَعِيدٍ، أَخْبَرَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي عَطَاءٌ، أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ زَعَمَ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَكَلَ ثُومًا أَوْ بَصَلاً فَلْيَعْتَزِلْنَا، أَوْ لِيَعْتَزِلْ مَسْجِدَنَا ‏\"‏‏.‏"
      },
      {
        "id": 5218,
        "hadith_number": "5453",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kelebihan Mengumpul Al-Kabath dan Pengalaman Nabi Menggembala Kambing",
        "perawi_melayu": "Diriwayatkan oleh Jabir bin `Abdullah رضی اللہ عنہما:",
        "english_text": "We were with Allah's Messenger (ﷺ) collecting Al-Kabath at Mar-Az-Zahran. The Prophet (ﷺ) said, \"Collect the black ones, for they are better.\" Somebody said, (O Allah's Messenger (ﷺ)!) Have you ever shepherded sheep?\" He said, \"There has been no prophet but has shepherded them. \"",
        "malay_translation": "Kami bersama Rasulullah (ﷺ) sedang mengumpul Al-Kabath di Mar-Az-Zahran. Nabi (ﷺ) bersabda, \"Kumpul yang berwarna hitam, kerana ia lebih baik.\" Seseorang bertanya, (Wahai Rasulullah (ﷺ)!) Adakah kamu pernah menggembala kambing?\" Baginda menjawab, \"Tidak ada seorang nabi pun melainkan pernah menggembalakannya.\"",
        "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، قَالَ أَخْبَرَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِمَرِّ الظَّهْرَانِ نَجْنِي الْكَبَاثَ فَقَالَ ‏\"‏ عَلَيْكُمْ بِالأَسْوَدِ مِنْهُ، فَإِنَّهُ أَيْطَبُ ‏\"‏‏.‏ فَقَالَ أَكُنْتَ تَرْعَى الْغَنَمَ قَالَ ‏\"‏ نَعَمْ، وَهَلْ مِنْ نَبِيٍّ إِلاَّ رَعَاهَا ‏\"‏‏.‏"
      },
      {
        "id": 5219,
        "hadith_number": "5454",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perjalanan ke Khaibar dan Wudhuk Selepas Makan Sawiq",
        "perawi_melayu": "Diriwayatkan oleh Suwaid bin An Nu`man:",
        "english_text": "We went out with Allah's Messenger (ﷺ) to Khaibar, and when we reached As-Sahba', the Prophet (ﷺ) asked for food, and he was offered nothing but Sawiq. We ate, and then Allah's Messenger (ﷺ) stood up for the prayer. He rinsed his mouth with water, and we too, rinsed our mouths.",
        "malay_translation": "Kami keluar bersama Rasulullah (ﷺ) ke Khaibar, dan apabila kami sampai ke As-Sahba', Nabi (ﷺ) meminta makanan, dan baginda tidak ditawarkan kecuali Sawiq. Kami makan, dan kemudian Rasulullah (ﷺ) bangun untuk solat. Baginda berkumur dengan air, dan kami juga, berkumur.",
        "arabic_text": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ سُوَيْدِ بْنِ النُّعْمَانِ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى خَيْبَرَ، فَلَمَّا كُنَّا بِالصَّهْبَاءِ دَعَا بِطَعَامٍ فَمَا أُتِيَ إِلاَّ بِسَوِيقٍ، فَأَكَلْنَا فَقَامَ إِلَى الصَّلاَةِ، فَتَمَضْمَضَ وَمَضْمَضْنَا‏.‏"
      },
      {
        "id": 5220,
        "hadith_number": "5455",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Nabi SAW dan Para Sahabat di Khaibar",
        "perawi_melayu": "Diriwayatkan oleh Suwaid رضی اللہ عنہ :",
        "english_text": "We went out with Allah's Messenger (ﷺ) to Khaibar. and when we reached As-Sahba', which (Yahya says) is one day' journey from Khaibar, the Prophet (ﷺ) asked for food, and he was offered nothing but Sawiq which we chewed and ate. Then the Prophet (ﷺ) asked for water and rinsed his mouth, and we too, rinsed our mouths along with him. He then led us in the Maghrib prayer without performing ablution again. Sufyan, the reporter says: It is as if you were hearing it from Yahya.",
        "malay_translation": "Kami keluar bersama Rasulullah SAW ke Khaibar. Apabila kami tiba di As-Sahba', yang (Yahya berkata) adalah perjalanan sehari dari Khaibar, Nabi SAW meminta makanan, dan baginda tidak dihidangkan melainkan Sawiq yang kami kunyah dan makan. Kemudian Nabi SAW meminta air dan berkumur, dan kami juga berkumur bersama baginda. Kemudian baginda mengimamkan solat Maghrib tanpa mengambil wuduk semula. Sufyan, perawi berkata: Seolah-olah kamu mendengarnya daripada Yahya.",
        "arabic_text": "قَالَ يَحْيَى سَمِعْتُ بُشَيْرًا، يَقُولُ حَدَّثَنَا سُوَيْدٌ، خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى خَيْبَرَ، فَلَمَّا كُنَّا بِالصَّهْبَاءِ ـ قَالَ يَحْيَى وَهْىَ مِنْ خَيْبَرَ عَلَى رَوْحَةٍ ـ دَعَا بِطَعَامٍ فَمَا أُتِيَ إِلاَّ بِسَوِيقٍ، فَلُكْنَاهُ فَأَكَلْنَا مَعَهُ، ثُمَّ دَعَا بِمَاءٍ فَمَضْمَضَ وَمَضْمَضْنَا مَعَهُ، ثُمَّ صَلَّى بِنَا الْمَغْرِبَ وَلَمْ يَتَوَضَّأْ‏.‏ وَقَالَ سُفْيَانُ كَأَنَّكَ تَسْمَعُهُ مِنْ يَحْيَى‏.‏"
      },
      {
        "id": 5221,
        "hadith_number": "5456",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Adab Makan: Jangan Mengelap Tangan Sebelum Dijilat",
        "perawi_melayu": "Diriwayatkan oleh Ibn `Abbas رضی اللہ عنہما :",
        "english_text": "The Prophet (ﷺ) said, 'When you eat, do not wipe your hands till you have licked it, or had it licked by somebody else.'",
        "malay_translation": "Rasulullah (ﷺ) bersabda, 'Apabila kamu makan, janganlah kamu mengelap tanganmu sehingga kamu menjilatnya atau dijilat oleh orang lain.'",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا أَكَلَ أَحَدُكُمْ فَلاَ يَمْسَحْ يَدَهُ حَتَّى يَلْعَقَهَا أَوْ يُلْعِقَهَا ‏\"‏‏.‏"
      },
      {
        "id": 5222,
        "hadith_number": "5457",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Tidak Wajib Berwudhu' Selepas Makan Makanan Dimasak",
        "perawi_melayu": "Diriwayatkan oleh Sa`id bin Al-Harith:",
        "english_text": "He asked Jabir bin `Abdullah رضی اللہ عنہ about performing ablution after taking a cooked meal. He replied, \"It is not essential,\" and added, \"We never used to get such kind of food during the lifetime of the Prophet except rarely; and if at all we got such a dish, we did not have any handkerchiefs to wipe our hands with except the palms of our hands, our forearms and our feet. We would perform the prayer thereafter with-out performing new ablution.\"",
        "malay_translation": "Beliau bertanya kepada Jabir bin `Abdullah رضي الله عنه tentang berwudhu' selepas makan makanan yang dimasak. Beliau menjawab, \"Ia tidak wajib,\" dan menambah, \"Kami tidak pernah mendapatkan makanan seperti itu semasa hayat Nabi ﷺ kecuali jarang sekali; dan jika ada, kami tidak mempunyai sapu tangan untuk mengelap tangan kami kecuali telapak tangan kami, lengan bawah kami, dan kaki kami. Kami akan mendirikan solat selepas itu tanpa berwudhu' baharu.",
        "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ فُلَيْحٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ سَعِيدِ بْنِ الْحَارِثِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّهُ سَأَلَهُ عَنِ الْوُضُوءِ مِمَّا مَسَّتِ النَّارُ، فَقَالَ لاَ قَدْ كُنَّا زَمَانَ النَّبِيِّ صلى الله عليه وسلم لاَ نَجِدُ مِثْلَ ذَلِكَ مِنَ الطَّعَامِ إِلاَّ قَلِيلاً، فَإِذَا نَحْنُ وَجَدْنَاهُ لَمْ يَكُنْ لَنَا مَنَادِيلُ، إِلاَّ أَكُفَّنَا وَسَوَاعِدَنَا وَأَقْدَامَنَا، ثُمَّ نُصَلِّي وَلاَ نَتَوَضَّأُ‏.‏"
      },
      {
        "id": 5223,
        "hadith_number": "5458",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ucapan Selepas Makan Rasulullah SAW",
        "perawi_melayu": "Diriwayatkan daripada Abu Umama رضی اللہ عنہ :",
        "english_text": "Whenever the dining sheet of the Prophet (ﷺ) was taken away (i.e., whenever he finished his meal), he used to say: \"Al-hamdu li l-lah kathiran taiyiban mubarakan fihi ghaira makfiy wala muWada` wala mustaghna'anhu Rabbuna.\"",
        "malay_translation": "Apabila hamparan makan Nabi (ﷺ) diangkat (iaitu, apabila Baginda selesai makan), Baginda selalu mengucapkan: \"Al-hamdu li l-lah kathiran taiyiban mubarakan fihi ghaira makfiy wala muWada` wala mustaghna'anhu Rabbuna.\" (Segala puji bagi Allah, pujian yang banyak, yang baik, yang diberkati padanya, yang tidak cukup, tidak ditinggalkan, dan tidak dapat ditinggalkan, Tuhan kami).",
        "arabic_text": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ ثَوْرٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ أَبِي أُمَامَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا رَفَعَ مَائِدَتَهُ قَالَ ‏ \"‏ الْحَمْدُ لِلَّهِ كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ، غَيْرَ مَكْفِيٍّ، وَلاَ مُوَدَّعٍ وَلاَ مُسْتَغْنًى عَنْهُ، رَبَّنَا ‏\"‏‏.‏"
      },
      {
        "id": 5224,
        "hadith_number": "5459",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Doa Selepas Makan Nabi Muhammad (ﷺ)",
        "perawi_melayu": "Diriwayatkan oleh Abu Umama رضي الله عنه :",
        "english_text": "Whenever the Prophet (ﷺ) finished his meals (or when his dining sheet was taken away), he used to say. \"Praise be to Allah Who has satisfied our needs and quenched our thirst. Your favor cannot by compensated or denied.\" Once he said, upraise be to You, O our Lord! Your favor cannot be compensated, nor can be left, nor can be dispensed with, O our Lord!\"",
        "malay_translation": "Apabila Nabi (ﷺ) selesai makan (atau apabila alas makanannya diangkat), baginda selalu mengucapkan: \"Segala puji bagi Allah yang telah memenuhi keperluan kami dan menghilangkan dahaga kami. Kebaikan-Mu tidak dapat ditukar ganti atau dinafikan.\" Pernah baginda bersabda, \"Segala puji bagi-Mu, Ya Tuhan kami! Kebaikan-Mu tidak dapat ditukar ganti, tidak boleh ditinggalkan, dan tidak boleh ditinggalkan, Ya Tuhan kami!\"",
        "arabic_text": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ ثَوْرِ بْنِ يَزِيدَ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ أَبِي أُمَامَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا فَرَغَ مِنْ طَعَامِهِ ـ وَقَالَ مَرَّةً إِذَا رَفَعَ مَائِدَتَهُ ـ قَالَ ‏ \"‏ الْحَمْدُ لِلَّهِ الَّذِي كَفَانَا وَأَرْوَانَا، غَيْرَ مَكْفِيٍّ، وَلاَ مَكْفُورٍ ـ وَقَالَ مَرَّةً الْحَمْدُ لِلَّهِ رَبِّنَا، غَيْرَ مَكْفِيٍّ، وَلاَ مُوَدَّعٍ ـ وَلاَ مُسْتَغْنًى، رَبَّنَا ‏\"‏‏.‏"
      },
      {
        "id": 5225,
        "hadith_number": "5460",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Galakan Memberi Makanan kepada Pembantu",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضي الله عنه :",
        "english_text": "The Prophet (ﷺ) said, \"When your servant brings your food to you, if you do not ask him to join you, then at least ask him to take one or two handfuls, for he has suffered from its heat (while cooking it) and has taken pains to cook it nicely.\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Apabila pembantu kamu membawakan makanan kepadamu, jika kamu tidak mengajaknya makan bersama, maka mintalah dia mengambil satu atau dua genggam (makanan), kerana dia telah kepanasan (semasa memasaknya) dan telah bersusah payah memasaknya dengan elok.\"",
        "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدٍ ـ هُوَ ابْنُ زِيَادٍ ـ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا أَتَى أَحَدَكُمْ خَادِمُهُ بِطَعَامِهِ، فَإِنْ لَمْ يُجْلِسْهُ مَعَهُ فَلْيُنَاوِلْهُ أُكْلَةً أَوْ أُكْلَتَيْنِ، أَوْ لُقْمَةً أَوْ لُقْمَتَيْنِ، فَإِنَّهُ وَلِيَ حَرَّهُ وَعِلاَجَهُ ‏\"‏‏.‏"
      },
      {
        "id": 5226,
        "hadith_number": "5461",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Abu Shu'aib dan Jemputan Makan Nabi ﷺ",
        "perawi_melayu": "Diriwayatkan oleh Abu Mas`ud Al-Ansari رضی اللہ عنہ :",
        "english_text": "There was an Ansari man nicknamed, Abu Shu'aib رضی اللہ عنہ , who had a slave who was a butcher. He came to the Prophet (ﷺ) while he was sitting with his companions and noticed the signs of hunger on the face of the Prophet (ﷺ) . So he went to his butcher slave and said, \"Prepare for me a meal sufficient for five persons so that I may invite the Prophet (ﷺ) along with four other men.\" He had the meal prepared for him and invited him. A (sixth) man followed them. The Prophet (ﷺ) said, \"O Abu Shu'aib! Another man has followed us. If you wish, you may invite him; and if you wish, you may refuse him.\" Abu Shu'aib رضی اللہ عنہ said, \"No, I will admit him.\"",
        "malay_translation": "Ada seorang lelaki Ansar yang bernama Abu Shu'aib رضی اللہ عنہ , yang mempunyai seorang hamba yang seorang tukang daging. Dia datang kepada Nabi ﷺ ketika baginda sedang duduk bersama para sahabat baginda dan melihat tanda-tanda kelaparan di wajah Nabi ﷺ. Lalu dia pergi kepada hambanya yang tukang daging itu dan berkata, \"Sediakan untukku makanan yang cukup untuk lima orang supaya aku dapat menjemput Nabi ﷺ bersama empat orang lelaki yang lain.\" Dia menyediakan makanan untuknya dan menjemput baginda. Seorang lelaki (keenam) mengikuti mereka. Nabi ﷺ bersabda, \"Wahai Abu Shu'aib! Seorang lagi lelaki telah mengikuti kita. Jika kamu mahu, kamu boleh menjemputnya; dan jika kamu mahu, kamu boleh menolaknya.\" Abu Shu'aib رضی اللہ عنہ berkata, \"Tidak, aku akan menerimanya.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي الأَسْوَدِ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا شَقِيقٌ، حَدَّثَنَا أَبُو مَسْعُودٍ الأَنْصَارِيُّ، قَالَ كَانَ رَجُلٌ مِنَ الأَنْصَارِ يُكْنَى أَبَا شُعَيْبٍ، وَكَانَ لَهُ غُلاَمٌ لَحَّامٌ، فَأَتَى النَّبِيَّ صلى الله عليه وسلم وَهْوَ فِي أَصْحَابِهِ، فَعَرَفَ الْجُوعَ فِي وَجْهِ النَّبِيِّ صلى الله عليه وسلم فَذَهَبَ إِلَى غُلاَمِهِ اللَّحَّامِ فَقَالَ اصْنَعْ لِي طَعَامًا يَكْفِي خَمْسَةً، لَعَلِّي أَدْعُو النَّبِيَّ صلى الله عليه وسلم خَامِسَ خَمْسَةٍ‏.‏ فَصَنَعَ لَهُ طُعَيِّمًا، ثُمَّ أَتَاهُ فَدَعَاهُ، فَتَبِعَهُمْ رَجُلٌ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ يَا أَبَا شُعَيْبٍ إِنَّ رَجُلاً تَبِعَنَا فَإِنْ شِئْتَ أَذِنْتَ لَهُ، وَإِنْ شِئْتَ تَرَكْتَهُ ‏\"‏‏.‏ قَالَ لاَ بَلْ أَذِنْتُ لَهُ‏.‏"
      },
      {
        "id": 5227,
        "hadith_number": "5462",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Rasulullah ﷺ Memotong Daging Kambing dan Solat Tanpa Wuduk Semula",
        "perawi_melayu": "Diriwayatkan oleh `Amr bin Umaiyya:",
        "english_text": "That he saw Allah's Messenger (ﷺ) cutting a piece of mutton from its shoulder part he was carrying in his hand. When he was called for prayer, he put it down and the knife with which he was cutting it. Then he stood up and offered the prayer without performing new ablution.",
        "malay_translation": "Bahawa dia melihat Rasulullah ﷺ memotong sepotong daging kambing dari bahagian bahunya yang dibawanya di tangannya. Apabila beliau dipanggil untuk solat, beliau meletakkannya dan pisau yang digunakannya untuk memotong. Kemudian beliau bangun dan menunaikan solat tanpa mengambil wuduk baharu.",
        "arabic_text": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ،‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي جَعْفَرُ بْنُ عَمْرِو بْنِ أُمَيَّةَ، أَنَّ أَبَاهُ، عَمْرَو بْنَ أُمَيَّةَ أَخْبَرَهُ أَنَّهُ، رَأَى رَسُولَ اللَّهِ صلى الله عليه وسلم يَحْتَزُّ مِنْ كَتِفِ شَاةٍ فِي يَدِهِ، فَدُعِيَ إِلَى الصَّلاَةِ فَأَلْقَاهَا وَالسِّكِّينَ الَّتِي كَانَ يَحْتَزُّ بِهَا، ثُمَّ قَامَ فَصَلَّى، وَلَمْ يَتَوَضَّأْ‏.‏"
      },
      {
        "id": 5228,
        "hadith_number": "5463",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Mendahulukan Makan Malam daripada Solat Isyak",
        "perawi_melayu": "Diriwayatkan daripada Anas bin Malik رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) said, If supper is served and the Iqama for (Isha) prayer is proclaimed, start with you supper first.\" Hadrat Ibn-e-Umer رضی اللہ عنہما has also reported likewise from the prophet ﷺ.",
        "malay_translation": "Rasulullah ﷺ bersabda: \"Jika makan malam dihidangkan dan iqamat untuk solat (Isyak) telah dilaungkan, mulakan dengan makan malammu dahulu.\" Hadrat Ibn-e-Umer رضی اللہ عنہما juga telah meriwayatkan perkara yang serupa daripada Nabi ﷺ.",
        "arabic_text": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا وُهَيْبٌ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا وُضِعَ الْعَشَاءُ وَأُقِيمَتِ الصَّلاَةُ فَابْدَءُوا بِالْعَشَاءِ ‏\"‏‏.‏"
      },
      {
        "id": 5229,
        "hadith_number": "5464",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ibnu Umar Mendengar Bacaan Imam Semasa Makan Malam",
        "perawi_melayu": "Diriwayatkan oleh Nafi'",
        "english_text": "Once Ibn Umar رضی اللہ عنہما was taking his supper while he was listening to the recitation of (Quran by) the Imam (in the Isha prayer).",
        "malay_translation": "Dahulu Ibnu Umar رضی اللہ عنہما sedang makan malam sambil mendengar bacaan (Al-Quran oleh) Imam (dalam solat Isyak).",
        "arabic_text": "وَعَنْ أَيُّوبَ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ‏.‏ وَعَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ تَعَشَّى مَرَّةً وَهْوَ يَسْمَعُ قِرَاءَةَ الإِمَامِ‏.‏"
      },
      {
        "id": 5230,
        "hadith_number": "5465",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Makan Malam Dahulu Sebelum Solat Isyak Jika Iqamat Dilaungkan",
        "perawi_melayu": "Diriwayatkan oleh Aisyah رضي الله عنها :",
        "english_text": "The Prophet (ﷺ) said, \"If the Iqama for (`Isha') prayer is proclaimed and supper is served, take your supper first.\" Wohaib and Yahya bin Saeed said: In Hisham's report, there is ''Supper is placed'' in place of ''Supper is ready''.",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Jika iqamat untuk solat Isyak dilaungkan dan makan malam telah dihidangkan, maka makanlah makan malam dahulu.\" Wohaib dan Yahya bin Saeed berkata: Dalam riwayat Hisham, terdapat perkataan ''Makan malam dihidangkan'' sebagai ganti kepada ''Makan malam sudah tersedia''.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا أُقِيمَتِ الصَّلاَةُ وَحَضَرَ الْعَشَاءُ فَابْدَءُوا بِالْعَشَاءِ ‏\"‏‏.‏ قَالَ وُهَيْبٌ وَيَحْيَى بْنُ سَعِيدٍ عَنْ هِشَامٍ ‏\"‏ إِذَا وُضِعَ الْعَشَاءُ ‏\"‏‏.‏"
      },
      {
        "id": 5231,
        "hadith_number": "5466",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Di Sebalik Pensyariatan Hijab",
        "perawi_melayu": "Diriwayatkan oleh Anas رضی اللہ عنہ :",
        "english_text": "I know (about) the Hijab (the order of veiling of women) more than anybody else. Ubai bin Ka`b رضی اللہ عنہ used to ask me about it. Allah's Messenger (ﷺ) became the bridegroom of Zainab bint Jahsh رضی اللہ عنہا whom he married at Medina. After the sun had risen high in the sky, the Prophet (ﷺ) invited the people to a meal. Allah's Apostle remained sitting and some people remained sitting with him after the other guests had left. Then Allah's Messenger (ﷺ) got up and went away, and I too, followed him till he reached the door of `Aisha's room. Then he thought that the people must have left the place by then, so he returned and I also returned with him. Behold, the people were still sitting at their places. So he went back again for the second time, and I went along with him too. When we reached the door of `Aisha's room, he returned and I also returned with him to see that the people had left. Thereupon the Prophet (ﷺ) hung a curtain between me and him and the Verse regarding the order for (veiling of women) Hijab was revealed.",
        "malay_translation": "Saya lebih mengetahui (tentang) Hijab (perintah menutup aurat wanita) daripada sesiapa sahaja. Ubai bin Ka`b رضی اللہ عنہ selalu bertanya kepada saya tentangnya. Rasulullah (ﷺ) menjadi pengantin lelaki bagi Zainab bint Jahsh رضی اللہ عنہا yang dinikahinya di Madinah. Setelah matahari naik tinggi di langit, Nabi (ﷺ) menjemput orang ramai ke suatu jamuan makan. Rasulullah (ﷺ) terus duduk dan beberapa orang masih duduk bersamanya setelah tetamu lain telah pulang. Kemudian Rasulullah (ﷺ) bangun dan pergi, dan saya juga mengikutinya sehingga dia sampai di pintu bilik `Aisha. Kemudian dia menyangka bahawa orang ramai pasti telah meninggalkan tempat itu, jadi dia kembali dan saya juga kembali bersamanya. Lihatlah, orang ramai masih duduk di tempat masing-masing. Maka dia kembali lagi untuk kali kedua, dan saya juga ikut bersamanya. Ketika kami sampai di pintu bilik `Aisha, dia kembali dan saya juga kembali bersamanya untuk melihat bahawa orang ramai telah pergi. Selepas itu Nabi (ﷺ) menggantung tirai antara saya dan dia dan ayat mengenai perintah (menutup aurat wanita) Hijab telah diturunkan.",
        "arabic_text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنِي أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ أَنَسًا، قَالَ أَنَا أَعْلَمُ النَّاسِ، بِالْحِجَابِ كَانَ أُبَىُّ بْنُ كَعْبٍ يَسْأَلُنِي عَنْهُ، أَصْبَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَرُوسًا بِزَيْنَبَ ابْنَةِ جَحْشٍ وَكَانَ تَزَوَّجَهَا بِالْمَدِينَةِ، فَدَعَا النَّاسَ لِلطَّعَامِ بَعْدَ ارْتِفَاعِ النَّهَارِ، فَجَلَسَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَجَلَسَ مَعَهُ رِجَالٌ بَعْدَ مَا قَامَ الْقَوْمُ، حَتَّى قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَمَشَى وَمَشَيْتُ مَعَهُ، حَتَّى بَلَغَ باب حُجْرَةِ عَائِشَةَ، ثُمَّ ظَنَّ أَنَّهُمْ خَرَجُوا فَرَجَعْتُ مَعَهُ، فَإِذَا هُمْ جُلُوسٌ مَكَانَهُمْ، فَرَجَعَ وَرَجَعْتُ مَعَهُ الثَّانِيَةَ، حَتَّى بَلَغَ باب حُجْرَةِ عَائِشَةَ فَرَجَعَ وَرَجَعْتُ مَعَهُ، فَإِذَا هُمْ قَامُوا، فَضَرَبَ بَيْنِي وَبَيْنَهُ سِتْرًا، وَأُنْزِلَ الْحِجَابُ‏.‏"
      }
    ]
  }
}