{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 21,
    "data": [
      {
        "id": 6947,
        "hadith_number": "7246",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kembali kepada Keluarga dan Mengajar Agama",
        "perawi_melayu": "Malik bin al-Huwairis",
        "english_text": "We came to the Prophet (ﷺ) and we were young men nearly of equal ages and we stayed with him for twenty nights. Allah's Messenger (ﷺ) was a very kind man and when he realized our longing for our families, he asked us about those whom we had left behind. When we informed him, he said, \"Go back to your families and stay with them and teach them (religion) and order them (to do good deeds). The Prophet (ﷺ) mentioned things some of which I remembered and some I did not. Then he said, \"Pray as you have seen me praying, and when it is the time of prayer, one of you should pronounce the call (Adhan) for the prayer and the eldest of you should lead the prayer. \"",
        "malay_translation": "Kami datang kepada Nabi ﷺ, ketika itu kami masih muda belia dan seusia, dan kami tinggal bersama baginda selama dua puluh malam. Rasulullah ﷺ adalah seorang yang sangat baik hati, dan apabila baginda menyedari kerinduan kami kepada keluarga, baginda bertanya kepada kami tentang mereka yang kami tinggalkan. Setelah kami memaklumkan kepada baginda, baginda bersabda, \"Kembalilah kepada keluarga kamu, dan tinggal bersama mereka, ajarlah mereka agama dan suruhlah mereka berbuat kebaikan.\"  Nabi ﷺ menyebut beberapa perkara, sebahagiannya aku ingat dan sebahagiannya aku lupa. Kemudian baginda bersabda, \"Solatlah sebagaimana kamu telah melihat aku solat, dan apabila tiba waktu solat, seorang daripada kamu hendaklah melaungkan azan dan yang tertua di antara kamu hendaklah menjadi imam solat.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلاَبَةَ، حَدَّثَنَا مَالِكٌ، قَالَ أَتَيْنَا النَّبِيَّ صلى الله عليه وسلم وَنَحْنُ شَبَبَةٌ مُتَقَارِبُونَ، فَأَقَمْنَا عِنْدَهُ عِشْرِينَ لَيْلَةً، وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَفِيقًا، فَلَمَّا ظَنَّ أَنَّا قَدِ اشْتَهَيْنَا أَهْلَنَا أَوْ قَدِ اشْتَقْنَا سَأَلَنَا عَمَّنْ تَرَكْنَا بَعْدَنَا فَأَخْبَرْنَاهُ قَالَ ‏ \"‏ ارْجِعُوا إِلَى أَهْلِيكُمْ، فَأَقِيمُوا فِيهِمْ، وَعَلِّمُوهُمْ، وَمُرُوهُمْ ـ وَذَكَرَ أَشْيَاءَ أَحْفَظُهَا أَوْ لاَ أَحْفَظُهَا ـ وَصَلُّوا كَمَا رَأَيْتُمُونِي أُصَلِّي، فَإِذَا حَضَرَتِ الصَّلاَةُ فَلْيُؤَذِّنْ لَكُمْ أَحَدُكُمْ، وَلْيَؤُمَّكُمْ أَكْبَرُكُمْ ‏\"‏‏.‏"
      },
      {
        "id": 6948,
        "hadith_number": "7247",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Azan Bilal dan Makan Sahur",
        "perawi_melayu": "Riwayat Ibn Mas'ud رضي الله عنه :",
        "english_text": "Allah's Messenger (ﷺ) said, \"The (call for prayer) Adhan of Bilal رضی اللہ عنہ should not stop anyone of you from taking his Suhur for he pronounces the Adhan in order that whoever among you is praying the night prayer, may return (to eat his Suhur) and whoever among you is sleeping, may get up, for it is not yet dawn (when it is like this).\" (Yahya, the sub-narrator stretched his two index fingers side ways).",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Azan Bilal رضي الله عنه tidak menghalang sesiapa pun di antara kamu daripada mengambil sahur.  Sebab dia melaungkan azan supaya sesiapa di antara kamu yang sedang menunaikan solat malam, boleh kembali (untuk makan sahur) dan sesiapa di antara kamu yang sedang tidur, boleh bangun, kerana waktu fajar belum lagi tiba (pada ketika itu).\" (Yahya, perawi perantaraan, menghulurkan kedua-dua jari telunjuknya ke sisi).",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، عَنْ يَحْيَى، عَنِ التَّيْمِيِّ، عَنْ أَبِي عُثْمَانَ، عَنِ ابْنِ مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يَمْنَعَنَّ أَحَدَكُمْ أَذَانُ بِلاَلٍ مِنْ سَحُورِهِ، فَإِنَّهُ يُؤَذِّنُ ـ أَوْ قَالَ يُنَادِي ـ لِيَرْجِعَ قَائِمَكُمْ، وَيُنَبِّهَ نَائِمَكُمْ، وَلَيْسَ الْفَجْرُ أَنْ يَقُولَ هَكَذَا ـ وَجَمَعَ يَحْيَى كَفَّيْهِ ـ حَتَّى يَقُولَ هَكَذَا ‏\"‏‏.‏ وَمَدَّ يَحْيَى إِصْبَعَيْهِ السَّبَّابَتَيْنِ‏.‏"
      },
      {
        "id": 6949,
        "hadith_number": "7248",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Waktu Makan dan Minum Sebelum Subuh",
        "perawi_melayu": "Riwayat Abdullah bin Umar رضي الله عنهما :",
        "english_text": "The Prophet (ﷺ) said, \"Bilal رضي الله عنه pronounces the Adhan at night so that you may eat and drink till Ibn Um Maktum pronounces the Adhan (for the Fajr prayer).",
        "malay_translation": "Rasulullah SAW bersabda: \"Bilal رضي الله عنه melaungkan azan pada waktu malam supaya kamu semua makan dan minum sehingga Ibn Um Maktum melaungkan azan (untuk solat Subuh).\"",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ بِلاَلاً يُنَادِي بِلَيْلٍ، فَكُلُوا وَاشْرَبُوا حَتَّى يُنَادِيَ ابْنُ أُمِّ مَكْتُومٍ ‏\"‏‏.‏"
      },
      {
        "id": 6950,
        "hadith_number": "7249",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Zuhur Lima Rakaat dan Sujud Sahu",
        "perawi_melayu": "Riwayat Abdullah bin al-Harith al-`Anzari:",
        "english_text": "The Prophet (ﷺ) led us in Zuhr prayer and prayer five rak`at. Somebody asked him whether the prayer had been increased.\" He (the Prophet (ﷺ) ) said, \"And what is that?\" They (the people) replied, \"You have prayed five rak`at.\" Then the Prophet (ﷺ) offered two prostrations (of Sahu) after he had finished his prayer with the Taslim.",
        "malay_translation": "Nabi Muhammad SAW telah mengetuai kami solat Zuhur sebanyak lima rakaat.  Seseorang bertanya kepada baginda sama ada bilangan rakaat solat telah ditambah. Baginda bertanya, \"Apakah itu?\" Mereka menjawab, \"Anda telah menunaikan solat lima rakaat.\" Kemudian, Nabi SAW melakukan dua kali sujud sahwi selepas menamatkan solat dengan salam.",
        "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ صَلَّى بِنَا النَّبِيُّ صلى الله عليه وسلم الظُّهْرَ خَمْسًا فَقِيلَ أَزِيدَ فِي الصَّلاَةِ قَالَ ‏ \"‏ وَمَا ذَاكَ ‏\"‏‏.‏ قَالُوا صَلَّيْتَ خَمْسًا‏.‏ فَسَجَدَ سَجْدَتَيْنِ بَعْدَ مَا سَلَّمَ‏.‏"
      },
      {
        "id": 6951,
        "hadith_number": "7250",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Solat Dua Rakaat dan Sujud Sahw",
        "perawi_melayu": "Riwayat Abu Hurairah رضي الله عنه:",
        "english_text": "Allah's Messenger (ﷺ) finished his prayer after offerings two rak`at only. Dhul-Yaddain asked him whether the prayer had been reduced, or you had forgotten?\" The Prophet (ﷺ) said, \"Is Dhul-Yaddain رضی اللہ عنہ speaking the truth?\" The people said, \"Yes.\" Then Allah's Messenger (ﷺ) stood up and performed another two rak`at and then finished prayer with Taslim, and then said the Takbir and performed a prostration similar to or longer than his ordinary prostrations; then he raised his head, said Takbir and prostrated and then raised his head (Sahu prostrations).",
        "malay_translation": "Rasulullah ﷺ menamatkan solatnya setelah menunaikan hanya dua rakaat.  Dzul-Yaddain bertanya kepada baginda sama ada solat itu dipendekkan, atau baginda telah lupa? Rasulullah ﷺ bersabda, \"Adakah Dzul-Yaddain رضي الله عنه berkata benar?\"  Orang ramai menjawab, \"Ya.\" Kemudian Rasulullah ﷺ berdiri dan menunaikan lagi dua rakaat, lalu menamatkan solat dengan salam, kemudian menyebut takbir dan melakukan sujud yang sama atau lebih lama daripada sujud biasa baginda; kemudian baginda mengangkat kepalanya, menyebut takbir dan sujud, lalu mengangkat kepalanya (sujud sahwi).",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم انْصَرَفَ مِنِ اثْنَتَيْنِ فَقَالَ لَهُ ذُو الْيَدَيْنِ أَقَصُرَتِ الصَّلاَةُ يَا رَسُولَ اللَّهِ، أَمْ نَسِيتَ فَقَالَ ‏ \"‏ أَصَدَقَ ذُو الْيَدَيْنِ ‏\"‏‏.‏ فَقَالَ النَّاسُ نَعَمْ‏.‏ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى رَكْعَتَيْنِ أُخْرَيَيْنِ، ثُمَّ سَلَّمَ، ثُمَّ كَبَّرَ، ثُمَّ سَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ، ثُمَّ رَفَعَ، ثُمَّ كَبَّرَ، فَسَجَدَ مِثْلَ سُجُودِهِ، ثُمَّ رَفَعَ‏.‏"
      },
      {
        "id": 6952,
        "hadith_number": "7251",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perubahan Kiblat ke Kaabah",
        "perawi_melayu": "Riwayat Abdullah bin Umar رضي الله عنهما:",
        "english_text": "While the people were at Quba offering the morning prayer, suddenly a person came to them saying, \"Tonight Divine Inspiration has been revealed to Allah's Messenger (ﷺ) and he has been ordered to face the Ka`ba (in prayers): therefore you people should face it.\" There faces were towards Sham, so they turned their faces towards the Ka`ba (at Mecca).",
        "malay_translation": "Ketika orang ramai berada di Quba menunaikan solat Subuh, tiba-tiba seorang lelaki datang kepada mereka sambil berkata, \"Malam ini wahyu telah diturunkan kepada Rasulullah ﷺ dan baginda telah diperintahkan untuk menghadap Kaabah (dalam solat): oleh itu, patuhilah arahan ini.\" Ketika itu, mereka menghadap ke arah Syam, maka mereka pun menoleh wajah mereka ke arah Kaabah (di Mekah).",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ بَيْنَا النَّاسُ بِقُبَاءٍ فِي صَلاَةِ الصُّبْحِ إِذْ جَاءَهُمْ آتٍ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ أُنْزِلَ عَلَيْهِ اللَّيْلَةَ قُرْآنٌ، وَقَدْ أُمِرَ أَنْ يَسْتَقْبِلَ الْكَعْبَةَ فَاسْتَقْبِلُوهَا‏.‏ وَكَانَتْ وُجُوهُهُمْ إِلَى الشَّأْمِ فَاسْتَدَارُوا إِلَى الْكَعْبَةِ‏.‏"
      },
      {
        "id": 6953,
        "hadith_number": "7252",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perubahan Kiblat ke Kaabah",
        "perawi_melayu": "Riwayat Al-Bara' بن عازب",
        "english_text": "When Allah's Messenger (ﷺ) arrived at Medina, he prayed facing Jerusalem for sixteen or seventeen months but he wished that he would be ordered to face the Ka`ba. So Allah revealed: -- 'Verily! We have seen the turning of your face towards the heaven; surely we shall turn you to a prayer direction (Qibla) that shall please you.' (2.144) Thus he was directed towards the Ka`ba. A man prayed the `Asr prayer with the Prophet (ﷺ) and then went out, and passing by some people from the Ansar, he said, \"I testify. that I have prayed with the Prophet (ﷺ) and he (the Prophet) has prayed facing the Ka`ba.\" Thereupon they, who were bowing in the `Asr prayer, turned towards the Ka`ba.",
        "malay_translation": "Apabila Rasulullah ﷺ tiba di Madinah, baginda menunaikan solat menghadap Baitulmaqdis selama enam belas atau tujuh belas bulan, tetapi baginda menginginkan agar baginda diperintahkan untuk menghadap Kaabah. Maka Allah SWT menurunkan wahyu: –  'Sesungguhnya Kami telah melihat pusingan mukamu ke langit, maka sesungguhnya Kami akan memalingkan kamu ke kiblat yang engkau redhai.' (2:144)  Dengan demikian baginda diarahkan untuk menghadap Kaabah. Seorang lelaki menunaikan solat Asar bersama Nabi ﷺ kemudian keluar, lalu ketika melalui beberapa orang Ansar, dia berkata, \"Aku bersaksi bahawa aku telah menunaikan solat bersama Nabi ﷺ dan baginda telah menunaikan solat menghadap Kaabah.\"  Maka mereka yang ketika itu sedang rukuk dalam solat Asar, pun menoleh menghadap Kaabah.",
        "arabic_text": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا وَكِيعٌ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ لَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ صَلَّى نَحْوَ بَيْتِ الْمَقْدِسِ سِتَّةَ عَشَرَ، أَوْ سَبْعَةَ عَشَرَ شَهْرًا، وَكَانَ يُحِبُّ أَنْ يُوَجَّهَ إِلَى الْكَعْبَةِ فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏قَدْ نَرَى تَقَلُّبَ وَجْهِكَ فِي السَّمَاءِ فَلَنُوَلِّيَنَّكَ قِبْلَةً تَرْضَاهَا‏}‏ فَوُجِّهَ نَحْوَ الْكَعْبَةِ، وَصَلَّى مَعَهُ رَجُلٌ الْعَصْرَ، ثُمَّ خَرَجَ فَمَرَّ عَلَى قَوْمٍ مِنَ الأَنْصَارِ فَقَالَ هُوَ يَشْهَدُ أَنَّهُ صَلَّى مَعَ النَّبِيِّ صلى الله عليه وسلم وَأَنَّهُ قَدْ وُجِّهَ إِلَى الْكَعْبَةِ‏.‏ فَانْحَرَفُوا وَهُمْ رُكُوعٌ فِي صَلاَةِ الْعَصْرِ‏.‏"
      },
      {
        "id": 6954,
        "hadith_number": "7253",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Minuman Keras dan Pemusnahan Tempayan",
        "perawi_melayu": "Anas bin Malik رضي الله عنه",
        "english_text": "I used to offer drinks prepared from infused dates to Abu Talha Al-Ansari, Abu 'Ubada bin Al Jarrah and Ubai bin Ka`b رضي الله عنهم . Then a person came to them and said, \"All alcoholic drinks have been prohibited.\" Abii Talha رضي الله عنه then said, \"O Anas! Get up and break all these jars.\" So I got up and took a mortar belonging to us, and hit the jars with its lower part till they broke.",
        "malay_translation": "Aku biasa menghidangkan minuman yang diperbuat daripada kurma yang ditapai kepada Abu Talhah Al-Ansari, Abu Ubaidah bin Al-Jarrah dan Ubai bin Ka'ab رضي الله عنهم. Kemudian, datanglah seseorang kepada mereka dan berkata, \"Segala minuman yang memabukkan telah diharamkan.\" Abu Talhah رضي الله عنه kemudian berkata, \"Wahai Anas! Bangun dan pecahkan semua tempayan ini.\" Maka aku bangun dan mengambil lesung milik kami, lalu memukul tempayan-tempayan itu dengan bahagian bawahnya sehingga pecah.",
        "arabic_text": "حَدَّثَنِي يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنِي مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ كُنْتُ أَسْقِي أَبَا طَلْحَةَ الأَنْصَارِيَّ وَأَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ وَأُبَىَّ بْنَ كَعْبٍ شَرَابًا مِنْ فَضِيخٍ وَهْوَ تَمْرٌ فَجَاءَهُمْ آتٍ فَقَالَ إِنَّ الْخَمْرَ قَدْ حُرِّمَتْ‏.‏ فَقَالَ أَبُو طَلْحَةَ يَا أَنَسُ قُمْ إِلَى هَذِهِ الْجِرَارِ فَاكْسِرْهَا، قَالَ أَنَسٌ فَقُمْتُ إِلَى مِهْرَاسٍ لَنَا فَضَرَبْتُهَا بِأَسْفَلِهِ حَتَّى انْكَسَرَتْ‏.‏"
      },
      {
        "id": 6955,
        "hadith_number": "7254",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kejujuran Abu Ubaidah",
        "perawi_melayu": "Riwayat Hudhaifah ibn al-Yaman:",
        "english_text": "The Prophet (ﷺ) said to the people of Najran, \"I will send to you an honest person who is really trustworthy.\" The Companion, of the Prophet (ﷺ) each desired to be that person, but the Prophet (ﷺ) sent Abu 'Ubaida ibn al-Jarrah.",
        "malay_translation": "Rasulullah ﷺ bersabda kepada penduduk Najran, \"Aku akan mengutus seorang yang jujur dan benar-benar amanah kepadamu.\" Para sahabat Rasulullah ﷺ masing-masing menginginkan untuk menjadi orang tersebut, tetapi Rasulullah ﷺ mengutus Abu Ubaidah ibn al-Jarrah.",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنْ صِلَةَ، عَنْ حُذَيْفَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لأَهْلِ نَجْرَانَ ‏ \"‏ لأَبْعَثَنَّ إِلَيْكُمْ رَجُلاً أَمِينًا حَقَّ أَمِينٍ ‏\"‏‏.‏ فَاسْتَشْرَفَ لَهَا أَصْحَابُ النَّبِيِّ صلى الله عليه وسلم فَبَعَثَ أَبَا عُبَيْدَةَ‏.‏"
      },
      {
        "id": 6956,
        "hadith_number": "7255",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Abu Ubaidah al-Jarrah, Orang Yang Amanah Bangsa Ini",
        "perawi_melayu": "Riwayat Anas bin Malik:",
        "english_text": "The Prophet (ﷺ) said, \"For every nation there is an Amin (honest, trustworthy person) and the Amin of this nation is Abu 'Ubaida رضي الله عنه .\"",
        "malay_translation": "Rasulullah SAW bersabda: \"Setiap umat mempunyai seorang yang amanah, dan orang yang amanah bagi umat ini ialah Abu Ubaidah رضي الله عنه.\"",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ خَالِدٍ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لِكُلِّ أُمَّةٍ أَمِينٌ، وَأَمِينُ هَذِهِ الأُمَّةِ أَبُو عُبَيْدَةَ ‏\"‏‏.‏"
      },
      {
        "id": 6957,
        "hadith_number": "7256",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perkongsian Hadis Antara Dua Sahabat",
        "perawi_melayu": "Umar ibn al-Khattab",
        "english_text": "There was a man from the Ansar (who was a friend of mine). If he was not present in the company of Allah's Messenger (ﷺ) I used to be present with Allah's Messenger (ﷺ), I would tell him what I used to hear from Allah's Messenger (ﷺ), and when I was absent from Allah's Messenger (ﷺ) he used to be present with him, and he would tell me what he used to hear from Allah's Messenger (ﷺ).",
        "malay_translation": "Ada seorang lelaki dari kalangan Ansar (yang merupakan sahabatku). Jika dia tidak hadir bersama Rasulullah ﷺ, aku akan berada bersama Rasulullah ﷺ, dan aku akan menceritakan kepadanya apa yang aku dengar daripada Rasulullah ﷺ. Dan apabila aku tidak bersama Rasulullah ﷺ, dia akan berada bersama Baginda, dan dia akan menceritakan kepadaku apa yang didengarnya daripada Rasulullah ﷺ.",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عُبَيْدِ بْنِ حُنَيْنٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ عُمَرَ ـ رضى الله عنهم ـ قَالَ وَكَانَ رَجُلٌ مِنَ الأَنْصَارِ إِذَا غَابَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَشَهِدْتُهُ أَتَيْتُهُ بِمَا يَكُونُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَإِذَا غِبْتُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَشَهِدَ أَتَانِي بِمَا يَكُونُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏"
      },
      {
        "id": 6958,
        "hadith_number": "7257",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ketaatan Hanya dalam Kebaikan",
        "perawi_melayu": "Riwayat Ali رضي الله عنه :",
        "english_text": "The Prophet (ﷺ) , sent an army and appointed some man their commander The man made a fire and then said (to the soldiers), \"Enter it.\" Some of them intended to enter it while some others said, 'We have run away from it (i.e., embraced Islam to save ourselves from the 'fire').\" They mentioned that to the Prophet, and he said about people who had intended to enter the fire. ''If they had entered it, they would have remained In it till the Day of Resurrection.'' Then he said to others, \"No obedience for evil deeds, obedience is required only in what is good .\"",
        "malay_translation": "Nabi ﷺ telah menghantar sebuah tentera dan melantik seorang lelaki sebagai komander mereka. Lelaki itu membuat api lalu berkata (kepada tentera), \"Masuklah ke dalamnya.\" Sebahagian daripada mereka berniat untuk memasukinya, manakala sebahagian yang lain berkata, 'Kami telah lari daripadanya (iaitu, memeluk Islam untuk menyelamatkan diri daripada 'api').' Mereka menceritakan perkara itu kepada Nabi, dan baginda bersabda tentang orang-orang yang berniat untuk memasuki api itu, ''Sekiranya mereka memasukinya, nescaya mereka akan kekal di dalamnya sehingga Hari Kiamat.'' Kemudian baginda bersabda kepada yang lain, \"Tiada ketaatan dalam kejahatan, ketaatan hanya dituntut dalam kebaikan.\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ زُبَيْدٍ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَ جَيْشًا وَأَمَّرَ عَلَيْهِمْ رَجُلاً، فَأَوْقَدَ نَارًا وَقَالَ ادْخُلُوهَا‏.‏ فَأَرَادُوا أَنْ يَدْخُلُوهَا، وَقَالَ آخَرُونَ إِنَّمَا فَرَرْنَا مِنْهَا، فَذَكَرُوا لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ لِلَّذِينَ أَرَادُوا أَنْ يَدْخُلُوهَا ‏\"‏ لَوْ دَخَلُوهَا لَمْ يَزَالُوا فِيهَا إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏‏.‏ وَقَالَ لِلآخَرِينَ ‏\"‏ لاَ طَاعَةَ فِي مَعْصِيَةٍ، إِنَّمَا الطَّاعَةُ فِي الْمَعْرُوفِ ‏\"‏‏.‏"
      },
      {
        "id": 6959,
        "hadith_number": "7258, 7259",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Perselisihan Dua Lelaki di Hadapan Nabi SAW",
        "perawi_melayu": "Abu Hurairah dan Zaid bin Khalid رضي الله عنهما",
        "english_text": "Two men sued each other before the Prophet (ﷺ).",
        "malay_translation": "Dua orang lelaki saling mendakwa antara satu sama lain di hadapan Nabi SAW.",
        "arabic_text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ، أَخْبَرَهُ أَنَّ أَبَا هُرَيْرَةَ وَزَيْدَ بْنَ خَالِدٍ أَخْبَرَاهُ أَنَّ رَجُلَيْنِ اخْتَصَمَا إِلَى النَّبِيِّ صلى الله عليه وسلم‏."
      },
      {
        "id": 6960,
        "hadith_number": "7260",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukum Zina:  Pengadilan Rasullullah SAW",
        "perawi_melayu": "Abu Hurairah رضي الله عنه :",
        "english_text": "While we were with Allah's Messenger (ﷺ) a bedouin got up and said, \"O Allah's Messenger (ﷺ)! Settle my case according to Allah's Book (Laws).\" Then his opponent got up and said, \"O Allah's Messenger (ﷺ)! He has said the truth! Settle his case according to Allah's Book (Laws.) and allow me to speak,\" He said, \"My son was a laborer for this man and he committed illegal sexual intercourse with his wife. The people told me that my son should be stoned to death but I ransomed him with one-hundred sheep and a slave girl. Then I asked the religious learned people and they told me that his wife should be stoned to death and my son should receive one-hundred lashes and be sentenced to one year of exile.' The Prophet (ﷺ) said, \"By Him in Whose Hands my life is, I will judge between you according to Allah's Book (Laws): As for the slave girl and the sheep, they are to be returned; and as for your son, he shall receive onehundred lashes and will be exiled for one year. You, O Unais!\" addressing a man from Bani Aslam, \"Go tomorrow morning to the wife of this (man) and if she confesses, then stone her to death.\" The next morning Unais رضي الله عنه went to the wife and she confessed, and he stoned her to death.",
        "malay_translation": "Ketika kami bersama Rasulullah SAW, seorang Badwi bangun dan berkata, \"Wahai Rasulullah SAW! Putuskanlah kes saya mengikut Kitabullah (Hukum Allah).\" Kemudian lawannya bangun dan berkata, \"Wahai Rasulullah SAW! Dia telah berkata benar! Putuskanlah kesnya mengikut Kitabullah (Hukum Allah) dan izinkan saya untuk bercakap.\" Dia berkata, \"Anak lelaki saya bekerja sebagai buruh untuk lelaki ini dan dia telah melakukan zina dengan isterinya. Orang ramai memberitahu saya bahawa anak lelaki saya patut direjam sehingga mati, tetapi saya telah menebusnya dengan seratus ekor kambing dan seorang hamba perempuan. Kemudian saya bertanya kepada para ulama, dan mereka memberitahu saya bahawa isterinya patut direjam sehingga mati dan anak lelaki saya patut disebat seratus kali dan dihukum buang negeri selama setahun.\" Nabi SAW bersabda, \"Demi Allah yang memegang jiwaku, Aku akan menghakimi di antara kamu mengikut Kitabullah (Hukum Allah):  Hamba perempuan dan kambing itu hendaklah dikembalikan; dan bagi anakmu, dia akan disebat seratus kali dan dibuang negeri selama setahun. Kamu, wahai Unais!\" sambil menyebut seorang lelaki dari Bani Aslam, \"Pergilah esok pagi kepada isteri lelaki ini, dan jika dia mengaku, maka rejamlah dia sehingga mati.\" Keesokan paginya, Unais رضي الله عنه pergi kepada isteri itu dan dia mengaku, lalu dia merejamnya sehingga mati.",
        "arabic_text": "وَحَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ بَيْنَمَا نَحْنُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ قَامَ رَجُلٌ مِنَ الأَعْرَابِ فَقَالَ يَا رَسُولَ اللَّهِ اقْضِ لِي بِكِتَابِ اللَّهِ‏.‏ فَقَامَ خَصْمُهُ فَقَالَ صَدَقَ يَا رَسُولَ اللَّهِ، اقْضِ لَهُ بِكِتَابِ اللَّهِ، وَأْذَنْ لِي‏.‏ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ قُلْ ‏\"‏‏.‏ فَقَالَ إِنَّ ابْنِي كَانَ عَسِيفًا عَلَى هَذَا ـ وَالْعَسِيفُ الأَجِيرُ ـ فَزَنَى بِامْرَأَتِهِ فَأَخْبَرُونِي أَنَّ عَلَى ابْنِي الرَّجْمَ، فَافْتَدَيْتُ مِنْهُ بِمِائَةٍ مِنَ الْغَنَمِ وَوَلِيدَةٍ، ثُمَّ سَأَلْتُ أَهْلَ الْعِلْمِ فَأَخْبَرُونِي أَنَّ عَلَى امْرَأَتِهِ الرَّجْمَ، وَأَنَّمَا عَلَى ابْنِي جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ‏.‏ فَقَالَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ، أَمَّا الْوَلِيدَةُ وَالْغَنَمُ فَرُدُّوهَا، وَأَمَّا ابْنُكَ فَعَلَيْهِ جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ، وَأَمَّا أَنْتَ يَا أُنَيْسُ ـ لِرَجُلٍ مِنْ أَسْلَمَ ـ فَاغْدُ عَلَى امْرَأَةِ هَذَا، فَإِنِ اعْتَرَفَتْ فَارْجُمْهَا ‏\"‏‏.‏ فَغَدَا عَلَيْهَا أُنَيْسٌ فَاعْتَرَفَتْ فَرَجَمَهَا‏.‏"
      },
      {
        "id": 6961,
        "hadith_number": "7261",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Az-Zubair sebagai Pembantu Nabi SAW",
        "perawi_melayu": "Jabir bin Abdullah رضي الله عنه",
        "english_text": "On the day of (the battle of) the Trench, the Prophet (ﷺ) called the people (to bring news about the enemy). Az-Zubair رضی اللہ عنہ responded to his call. He called them again and Az-Zubair responded to his call again; then he called them for the third time and again Az-Zubair رضی اللہ عنہ responded to his call whereupon the Prophet said, \"Every prophet has his Hawairi (helper), and Az-Zubair رضی اللہ عنہ is my Hawari.\" Sufyan, the transmitter says: I have memorized it from Ibn-e-Al-Munkadir, and Ayyub said to him: O Abu Bakr! you may narrate to him Hadith-e-Jabir رضی اللہ عنہ , for people like your reporting from Hadrat Jabir رضی اللہ عنہ . He then in that very meeting said: I heard from Hadrat Jabir رضی اللہ عنہ , then narrating many Ahadith he said: I have heard it from Hadrat Jabir رضی اللہ عنہ . I said to Sufyan that Thauri said: That was the Quraizah Day. He, thereupon, said: I have memorized the word ''Trench'' as you are sitting here. Sufyan said smiling: Both are the same.",
        "malay_translation": "Pada hari Pertempuran Parit, Nabi SAW memanggil orang ramai (untuk mendapatkan berita tentang musuh). Az-Zubair رضي الله عنه menjawab panggilan baginda. Baginda memanggil mereka sekali lagi dan Az-Zubair menjawab panggilan baginda sekali lagi; kemudian baginda memanggil mereka buat kali ketiga dan sekali lagi Az-Zubair رضي الله عنه menjawab panggilan baginda, lalu Nabi SAW bersabda, \"Setiap nabi mempunyai pembantunya (Hawairi), dan Az-Zubair رضي الله عنه adalah pembantuku (Hawari).\" Sufyan, perawi tersebut berkata: Saya telah menghafalnya daripada Ibn-e-Al-Munkadir, dan Ayyub berkata kepadanya: Wahai Abu Bakar! Kamu boleh menceritakan kepada beliau Hadis Jabir رضي الله عنه, kerana orang ramai menyukai laporan kamu daripada Hadrat Jabir رضي الله عنه. Kemudian dalam pertemuan itu juga beliau berkata: Saya telah mendengar daripada Hadrat Jabir رضي الله عنه, kemudian setelah menceritakan banyak Hadis beliau berkata: Saya telah mendengarnya daripada Hadrat Jabir رضي الله عنه. Saya berkata kepada Sufyan bahawa Thauri berkata: Itu adalah Hari Quraizah. Kemudian, beliau berkata: Saya telah menghafal perkataan \"Parit\" sebagaimana kamu duduk di sini. Sufyan berkata sambil tersenyum: Kedua-duanya adalah sama.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا ابْنُ الْمُنْكَدِرِ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، قَالَ نَدَبَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ الْخَنْدَقِ فَانْتَدَبَ الزُّبَيْرُ، ثُمَّ نَدَبَهُمْ فَانْتَدَبَ الزُّبَيْرُ، ثُمَّ نَدَبَهُمْ فَانْتَدَبَ الزُّبَيْرُ فَقَالَ ‏ \"‏ لِكُلِّ نَبِيٍّ حَوَارِيٌّ وَحَوَارِيِّ الزُّبَيْرُ ‏\"‏‏.‏ قَالَ سُفْيَانُ حَفِظْتُهُ مِنِ ابْنِ الْمُنْكَدِرِ‏.‏ وَقَالَ لَهُ أَيُّوبُ يَا أَبَا بَكْرٍ حَدِّثْهُمْ عَنْ جَابِرٍ، فَإِنَّ الْقَوْمَ يُعْجِبُهُمْ أَنْ تُحَدِّثَهُمْ عَنْ جَابِرٍ‏.‏ فَقَالَ فِي ذَلِكَ الْمَجْلِسِ سَمِعْتُ جَابِرًا فَتَابَعَ بَيْنَ أَحَادِيثَ سَمِعْتُ جِابِرًا، قُلْتُ لِسُفْيَانَ فَإِنَّ الثَّوْرِيَّ يَقُولُ يَوْمَ قُرَيْظَةَ فَقَالَ كَذَا حَفِظْتُهُ كَمَا أَنَّكَ جَالِسٌ يَوْمَ الْخَنْدَقِ‏.‏ قَالَ سُفْيَانُ هُوَ يَوْمٌ وَاحِدٌ‏.‏ وَتَبَسَّمَ سُفْيَانُ‏.‏"
      },
      {
        "id": 6962,
        "hadith_number": "7262",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ketiga Khulafa' Ar-Rasyidin Masuk Syurga",
        "perawi_melayu": "Abu Musa al-Asy'ari",
        "english_text": "The Prophet (ﷺ) entered a garden and told me to guard its gate. Then a man came and asked permission to enter. The Prophet, said, \"Permit him and give him the good news that he will enter Paradise.\" Behold! It was Abu Bakr رضي الله عنه. Then `Umar رضي الله عنه came, and the Prophet (ﷺ) said, \"Admit him and give him the good news that he will enter Paradise.\" Then `Uthman رضي الله عنه came and the Prophet (ﷺ) said, \"Admit him and give him the good news that he will enter Paradise. \"",
        "malay_translation": "Nabi SAW masuk ke sebuah taman dan menyuruhku menjaga pintu gerbangnya. Kemudian datang seorang lelaki meminta izin untuk masuk. Nabi SAW bersabda, \"Benarkan dia masuk dan sampaikan khabar gembira kepadanya bahawa dia akan masuk Syurga.\"  Rupayanya, dia ialah Abu Bakar رضي الله عنه. Kemudian Umar رضي الله عنه datang, dan Nabi SAW bersabda, \"Benarkan dia masuk dan sampaikan khabar gembira kepadanya bahawa dia akan masuk Syurga.\" Kemudian Uthman رضي الله عنه datang dan Nabi SAW bersabda, \"Benarkan dia masuk dan sampaikan khabar gembira kepadanya bahawa dia akan masuk Syurga.\"",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ أَبِي عُثْمَانَ، عَنْ أَبِي مُوسَى، أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ حَائِطًا وَأَمَرَنِي بِحِفْظِ الْبَابِ فَجَاءَ رَجُلٌ يَسْتَأْذِنُ فَقَالَ ‏\"‏ ائْذَنْ لَهُ، وَبَشِّرْهُ بِالْجَنَّةِ ‏\"‏‏.‏ فَإِذَا أَبُو بَكْرٍ، ثُمَّ جَاءَ عُمَرُ فَقَالَ ‏\"‏ ائْذَنْ لَهُ، وَبَشِّرْهُ بِالْجَنَّةِ ‏\"‏‏.‏ ثُمَّ جَاءَ عُثْمَانُ فَقَالَ ‏\"‏ ائْذَنْ لَهُ، وَبَشِّرْهُ بِالْجَنَّةِ ‏\"‏‏.‏"
      },
      {
        "id": 6963,
        "hadith_number": "7263",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Umar bin al-Khattab Mendapatkan Keizinan Berjumpa Rasulullah",
        "perawi_melayu": "Umar bin al-Khattab :",
        "english_text": "I came and behold, Allah's Messenger (ﷺ) was staying on a Mashroba (attic room) and a black slave of Allah's Messenger (ﷺ) was at the top if its stairs. I said to him, \"(Tell the Prophet) that here is `Umar bin Al- Khattab رضي الله عنه (asking for permission to enter).\" Then he admitted me.",
        "malay_translation": "Aku datang dan lihatlah, Rasulullah ﷺ berada di atas mashroba (bilik loteng) dan seorang hamba hitam Rasulullah ﷺ berada di bahagian atas tangga. Aku berkata kepadanya, \"(Sampaikan kepada Nabi) bahawa di sini adalah Umar bin al-Khattab رضي الله عنه (meminta izin untuk masuk).\" Kemudian dia membenarkan aku masuk.",
        "arabic_text": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ يَحْيَى، عَنْ عُبَيْدِ بْنِ حُنَيْنٍ، سَمِعَ ابْنَ عَبَّاسٍ، عَنْ عُمَرَ ـ رضى الله عنهم ـ قَالَ جِئْتُ فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي مَشْرُبَةٍ لَهُ، وَغُلاَمٌ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَسْوَدُ عَلَى رَأْسِ الدَّرَجَةِ فَقُلْتُ قُلْ هَذَا عُمَرُ بْنُ الْخَطَّابِ فَأَذِنَ لِي‏.‏"
      },
      {
        "id": 6964,
        "hadith_number": "7264",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Surat Rasulullah SAW kepada Kisra dan Azab yang Menimpanya",
        "perawi_melayu": "Riwayat Abdullah bin Abbas رضي الله عنهما :",
        "english_text": "Allah's Messenger (ﷺ) dispatched Kisra a letter and advised him to deliver it to the ruler of Behrain and the ruler of Behrain mat deliver it to Kisra. When Kisra read it, he tore it to pieces, so Allah Apostle ﷺ invoked against him that they may be torn (disintegrated) like it totally.",
        "malay_translation": "Rasulullah SAW mengirim surat kepada Kisra dan mengarahkan agar ia menyampaikannya kepada pemerintah Bahrain, dan pemerintah Bahrain pula menyampaikannya kepada Kisra.  Apabila Kisra membacanya, dia mengoyakkan surat itu. Maka Rasulullah SAW mendoakan agar kerajaannya hancur luluh seperti surat tersebut.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنِي اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ بِكِتَابِهِ إِلَى كِسْرَى، فَأَمَرَهُ أَنْ يَدْفَعَهُ إِلَى عَظِيمِ الْبَحْرَيْنِ، يَدْفَعُهُ عَظِيمُ الْبَحْرَيْنِ إِلَى كِسْرَى، فَلَمَّا قَرَأَهُ كِسْرَى مَزَّقَهُ، فَحَسِبْتُ أَنَّ ابْنَ الْمُسَيَّبِ قَالَ فَدَعَا عَلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُمَزَّقُوا كُلَّ مُمَزَّقٍ‏.‏"
      },
      {
        "id": 6965,
        "hadith_number": "7265",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Amalan Puasa pada Hari Asyura",
        "perawi_melayu": "Riwayat Salama bin Al-Akwa` رحمه الله عليه",
        "english_text": "Allah's Messenger (ﷺ) said to a man from the tribe of Al-Aslam, \"Proclaim among your people (or the people) on the day of 'Ashura' (tenth of Muharram), 'Whosoever has eaten anything should fast for the rest of the day; and whoever has not eaten anything, should complete his fast.' \"",
        "malay_translation": "Rasulullah SAW bersabda kepada seorang lelaki daripada kabilah Al-Aslam, \"Sampaikan kepada kaummu pada hari Asyura (sepuluh Muharam), 'Barangsiapa yang telah makan sesuatu hendaklah berpuasa sepanjang hari yang selebihnya; dan barangsiapa yang belum makan sesuatu, hendaklah menyempurnakan puasanya.' \"",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، حَدَّثَنَا سَلَمَةُ بْنُ الأَكْوَعِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لِرَجُلٍ مِنْ أَسْلَمَ ‏ \"‏ أَذِّنْ فِي قَوْمِكَ ـ أَوْ فِي النَّاسِ ـ يَوْمَ عَاشُورَاءَ أَنَّ مَنْ أَكَلَ فَلْيُتِمَّ بَقِيَّةَ يَوْمِهِ، وَمَنْ لَمْ يَكُنْ أَكَلَ فَلْيَصُمْ ‏\"‏‏.‏"
      },
      {
        "id": 6966,
        "hadith_number": "7266",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Amanat Rasul Kepada Utusan Abd Al-Qais",
        "perawi_melayu": "Riwayat Ibnu Abbas رضي الله عنهما",
        "english_text": "When the delegate of `Abd Al-Qais came to Allah's Messenger (ﷺ), he said, \"Who are the delegate?\" They said, \"The delegate are from the tribe of Rabi`a.\" The Prophet (ﷺ) said, \"Welcome, O the delegate, and welcome! O people! Neither you will have any disgrace nor will you regret.\" They said, \"O Allah's Apostle! Between you and us there are the infidels of the tribe of Mudar, so please order us to do something good (religious deeds) that by acting on them we may enter Paradise, and that we may inform (our people) whom we have left behind, about it.\" They also asked (the Prophet) about drinks. He forbade them from four things and ordered them to do four things. He ordered them to believe in Allah, and asked them, \"Do you know what is meant by belief in Allah?\" They said, \"Allah and His Apostle know best.\" He said, ''To testify that none has the right to be worshipped except Allah, the One, Who has no partners with Him, and that Muhammad is Allah's Messenger (ﷺ); and to offer prayers perfectly and to pay Zakat.\" (the narrator thinks that fasting in Ramadan is included), \"and to give one-fifth of the war booty (to the state).\" Then he forbade four (drinking utensils): Ad-Duba', Al56 Hantam, Al-Mazaffat and An-Naqir, or probably, Al-Muqaiyar. And then the Prophet (ﷺ) said, \"Remember all these things by heart and preach it to those whom you have left behind.\"",
        "malay_translation": "Apabila utusan Abd Al-Qais menghadap Rasulullah ﷺ, baginda bertanya, \"Siapakah kamu?\" Mereka menjawab, \"Kami adalah utusan daripada kabilah Rabi'ah.\" Nabi ﷺ bersabda, \"Selamat datang wahai utusan, dan selamat datang! Wahai sekalian manusia! Kamu tidak akan mendapat kehinaan dan tidak akan menyesal.\" Mereka berkata, \"Wahai Rasulullah! Di antara kami dan tuan terdapat orang-orang kafir dari kabilah Mudar, oleh itu, berilah kami perintah untuk melakukan sesuatu kebaikan (amal ibadah) supaya dengannya kami dapat memasuki syurga dan kami dapat menyampaikan (kepada kaum kami) yang telah kami tinggalkan.\" Mereka juga bertanya (kepada Nabi) tentang minuman. Baginda melarang mereka dari empat perkara dan memerintahkan mereka melakukan empat perkara. Baginda memerintahkan mereka beriman kepada Allah, dan bertanya kepada mereka, \"Adakah kamu tahu apa yang dimaksudkan dengan beriman kepada Allah?\" Mereka berkata, \"Allah dan RasulNya lebih mengetahui.\" Baginda bersabda, \"Mengesakan Allah dan tidak menyekutukanNya dengan sesuatu apa pun dan memperakui bahawa Muhammad adalah utusan Allah ﷺ; mendirikan solat dengan sempurna; menunaikan zakat (dan puasa Ramadan – menurut pendapat perawi); dan mengeluarkan sebahagian daripada ganjaran perang (sebahagian daripada rampasan perang kepada Baitulmal).\" Kemudian baginda melarang empat (bejana minuman): Ad-Duba', Al-Hantam, Al-Mazaffat dan An-Naqir, atau mungkin, Al-Muqaiyar. Dan kemudian Nabi ﷺ bersabda, \"Ingatlah semua perkara ini dan sampaikan kepada mereka yang telah kamu tinggalkan.\"",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، أَخْبَرَنَا شُعْبَةُ،‏.‏ وَحَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا النَّضْرُ، أَخْبَرَنَا شُعْبَةُ، عَنْ أَبِي جَمْرَةَ، قَالَ كَانَ ابْنُ عَبَّاسٍ يُقْعِدُنِي عَلَى سَرِيرِهِ فَقَالَ إِنَّ وَفْدَ عَبْدِ الْقَيْسِ لَمَّا أَتَوْا رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنِ الْوَفْدُ ‏\"‏‏.‏ قَالُوا رَبِيعَةُ‏.‏ قَالَ ‏\"‏ مَرْحَبًا بِالْوَفْدِ وَالْقَوْمِ، غَيْرَ خَزَايَا وَلاَ نَدَامَى ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ إِنَّ بَيْنَنَا وَبَيْنَكَ كُفَّارَ مُضَرَ، فَمُرْنَا بِأَمْرٍ نَدْخُلُ بِهِ الْجَنَّةَ، وَنُخْبِرُ بِهِ مَنْ وَرَاءَنَا فَسَأَلُوا عَنِ الأَشْرِبَةِ، فَنَهَاهُمْ عَنْ أَرْبَعٍ وَأَمَرَهُمْ بِأَرْبَعٍ أَمَرَهُمْ بِالإِيمَانِ بِاللَّهِ قَالَ ‏\"‏ هَلْ تَدْرُونَ مَا الإِيمَانُ بِاللَّهِ ‏\"‏‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ شَهَادَةُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَإِقَامُ الصَّلاَةِ، وَإِيتَاءُ الزَّكَاةِ ـ وَأَظُنُّ فِيهِ ـ صِيَامُ رَمَضَانَ، وَتُؤْتُوا مِنَ الْمَغَانِمِ الْخُمُسَ ‏\"‏‏.‏ وَنَهَاهُمْ عَنِ الدُّبَّاءِ، وَالْحَنْتَمِ، وَالْمُزَفَّتِ، وَالنَّقِيرِ، وَرُبَّمَا قَالَ الْمُقَيَّرِ‏.‏ قَالَ ‏\"‏ احْفَظُوهُنَّ، وَأَبْلِغُوهُنَّ مَنْ وَرَاءَكُمْ ‏\"‏‏.‏"
      },
      {
        "id": 6967,
        "hadith_number": "7267",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kehalalan Daging Mastigure",
        "perawi_melayu": "Riwayat Tauba Al-`Anbari:",
        "english_text": "Ash-'Shu`bi asked me, \"Did you notice how Al-Hasan used to narrate Hadiths from the Prophets? I stayed with Ibn `Umar رضی اللہ عنہ for about two or one-and-half years and I did not hear him narrating any thing from the Prophet (ﷺ) except his (Hadith): He (Ibn `Umar) said, \"Some of the companions of the Prophet (ﷺ) including Sa`d رضی اللہ عنہ , were going to eat meat, but one of the wives of the Prophet (ﷺ) called them, saying, 'It is the meat of a Mastigure.' The people then stopped eating it. On that Allah's Messenger (ﷺ) said, 'Carry on eating, for it is lawful.' Or said, 'There is no harm in eating it, but it is not from my meals.\"",
        "malay_translation": "Asy-Syu'bi bertanya kepadaku, \"Pernahkah kamu perhatikan bagaimana Al-Hasan meriwayatkan Hadis daripada Nabi? Aku tinggal bersama Ibnu Umar رضی اللہ عنہ selama kira-kira dua atau satu setengah tahun dan aku tidak pernah mendengarnya meriwayatkan apa-apa daripada Nabi SAW kecuali Hadisnya: Dia (Ibnu Umar) berkata, \"Beberapa sahabat Nabi SAW termasuk Sa'd رضی اللہ عنہ, hendak memakan daging, tetapi salah seorang isteri Nabi SAW memanggil mereka, sambil berkata, 'Ini adalah daging Mastigure.'  Lalu mereka berhenti memakannya.  Atas perkara itu, Rasulullah SAW bersabda, 'Teruskan makan, kerana ia halal.' Atau baginda bersabda, 'Tiada apa-apa mudarat untuk memakannya, tetapi ia bukan daripada hidangan aku.'\"",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْوَلِيدِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ تَوْبَةَ الْعَنْبَرِيِّ، قَالَ قَالَ لِي الشَّعْبِيُّ أَرَأَيْتَ حَدِيثَ الْحَسَنِ عَنِ النَّبِيِّ صلى الله عليه وسلم وَقَاعَدْتُ ابْنَ عُمَرَ قَرِيبًا مِنْ سَنَتَيْنِ أَوْ سَنَةٍ وَنِصْفٍ فَلَمْ أَسْمَعْهُ يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم غَيْرَ هَذَا قَالَ كَانَ نَاسٌ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فِيهِمْ سَعْدٌ فَذَهَبُوا يَأْكُلُونَ مِنْ لَحْمٍ، فَنَادَتْهُمُ امْرَأَةٌ مِنْ بَعْضِ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم إِنَّهُ لَحْمُ ضَبٍّ فَأَمْسَكُوا، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كُلُوا ـ أَوِ اطْعَمُوا ـ فَإِنَّهُ حَلاَلٌ ـ أَوْ قَالَ لاَ بَأْسَ بِهِ‏.‏ شَكَّ فِيهِ ـ وَلَكِنَّهُ لَيْسَ مِنْ طَعَامِي ‏\"‏‏.‏"
      }
    ]
  }
}