{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 30,
    "data": [
      {
        "id": 6502,
        "hadith_number": "6772",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kehilangan Keimanan Sementara ketika Melakukan Dosa",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ عنہ :",
        "english_text": "Allah's Messenger (ﷺ) said, \"When an adulterer commits illegal sexual intercourse, then he is not a believer at the time he is doing it; and when somebody drinks an alcoholic drink, then he is not believer at the time of drinking, and when a thief steals, he is not a believer at the time when he is stealing; and when a robber robs and the people look at him, then he is not a believer at the time of doing it.\" Abu Huraira رضی اللہ عنہ  in another narration, narrated the same from the Prophet (ﷺ) with the exclusion of robbery.",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Apabila penzina melakukan persetubuhan haram, maka dia bukanlah seorang mukmin pada waktu dia melakukannya; dan apabila seseorang meminum minuman keras, maka dia bukanlah seorang mukmin pada waktu dia meminumnya; dan apabila seorang pencuri mencuri, maka dia bukanlah seorang mukmin pada waktu dia mencuri; dan apabila seorang perompak merompak dan orang ramai melihatnya, maka dia bukanlah seorang mukmin pada waktu dia melakukannya.\" Abu Hurairah رضی اللہ عنہ dalam riwayat lain, meriwayatkan hal yang sama dari Nabi (ﷺ) dengan pengecualian rompakan.",
        "arabic_text": "حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَزْنِي الزَّانِي حِينَ يَزْنِي وَهْوَ مُؤْمِنٌ، وَلاَ يَشْرَبُ الْخَمْرَ حِينَ يَشْرَبُ وَهْوَ مُؤْمِنٌ، وَلاَ يَسْرِقُ حِينَ يَسْرِقُ وَهْوَ مُؤْمِنٌ، وَلاَ يَنْتَهِبُ نُهْبَةً يَرْفَعُ النَّاسُ إِلَيْهِ فِيهَا أَبْصَارَهُمْ وَهْوَ مُؤْمِنٌ ‏\"‏‏.‏ وَعَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ، إِلاَّ النُّهْبَةَ‏.‏"
      },
      {
        "id": 6503,
        "hadith_number": "6773",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman Ke Atas Pemabuk",
        "perawi_melayu": "Diriwayatkan oleh Anas bin Malik رضي اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) beat a drunk with palm-leaf stalks and shoes. And Abu Bakr رضی اللہ عنہ gave (such a sinner) forty lashes.",
        "malay_translation": "Nabi (ﷺ) memukul seorang pemabuk dengan pelepah kurma dan kasut. Dan Abu Bakr رضی اللہ عنہ memberikan (kepada pesalah seperti itu) empat puluh kali sebatan.",
        "arabic_text": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا هِشَامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم ح حَدَّثَنَا آدَمُ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم ضَرَبَ فِي الْخَمْرِ بِالْجَرِيدِ وَالنِّعَالِ، وَجَلَدَ أَبُو بَكْرٍ أَرْبَعِينَ‏.‏"
      },
      {
        "id": 6504,
        "hadith_number": "6774",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman Ke Atas Orang yang Mabuk",
        "perawi_melayu": "Diriwayatkan oleh `Uqba bin Al-Harith رضي اللہ عنہ :",
        "english_text": "An-Nu`man or the son of An-Nu`man was brought to the Prophet (ﷺ) on a charge of drunkenness. So the Prophet ordered all the men present in the house, to beat him. So all of them beat him, and I was also one of them who beat him with shoes.",
        "malay_translation": "An-Nu`man atau anak lelaki An-Nu`man dibawa kepada Nabi (ﷺ) kerana tuduhan mabuk. Maka Nabi memerintahkan semua lelaki yang hadir di rumah itu, untuk memukulnya. Lalu semua mereka memukulnya, dan saya juga salah seorang daripada mereka yang memukulnya dengan kasut.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، عَنْ أَيُّوبَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عُقْبَةَ بْنِ الْحَارِثِ، قَالَ جِيءَ بِالنُّعَيْمَانِ أَوْ بِابْنِ النُّعَيْمَانِ شَارِبًا، فَأَمَرَ النَّبِيُّ صلى الله عليه وسلم مَنْ كَانَ بِالْبَيْتِ أَنْ يَضْرِبُوهُ‏.‏ قَالَ فَضَرَبُوهُ، فَكُنْتُ أَنَا فِيمَنْ ضَرَبَهُ بِالنِّعَالِ‏.‏"
      },
      {
        "id": 6505,
        "hadith_number": "6775",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman Ke Atas Orang Mabuk",
        "perawi_melayu": "Diriwayatkan oleh `Uqba bin Al-Harith رضی اللہ عنہ :",
        "english_text": "An-Nu`man or the son of An-Nu`man was brought to the Prophet (ﷺ) in a state of intoxication. The Prophet felt it hard (was angry) and ordered all those who were present in the house, to beat him. And they beat him, using palm-leaf stalks and shoes, and I was among those who beat him.",
        "malay_translation": "An-Nu`man atau anak lelaki An-Nu`man dibawa kepada Nabi (ﷺ) dalam keadaan mabuk. Nabi berasa berat (marah) dan memerintahkan semua yang hadir di rumah itu, supaya memukulnya. Lalu mereka memukulnya, menggunakan pelepah kurma dan kasut, dan saya adalah antara mereka yang memukulnya.",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا وُهَيْبُ بْنُ خَالِدٍ، عَنْ أَيُّوبَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، عَنْ عُقْبَةَ بْنِ الْحَارِثِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أُتِيَ بِنُعَيْمَانَ أَوْ بِابْنِ نُعَيْمَانَ وَهْوَ سَكْرَانُ فَشَقَّ عَلَيْهِ، وَأَمَرَ مَنْ فِي الْبَيْتِ أَنْ يَضْرِبُوهُ، فَضَرَبُوهُ بِالْجَرِيدِ وَالنِّعَالِ، وَكُنْتُ فِيمَنْ ضَرَبَهُ‏.‏"
      },
      {
        "id": 6506,
        "hadith_number": "6776",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman Terhadap Pemabuk",
        "perawi_melayu": "Diriwayatkan oleh Anas رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) lashed a drunk with dateleaf stalks and shoes. And Abu Bakr رضی اللہ عنہ gave a drunk forty lashes.",
        "malay_translation": "Nabi (ﷺ) telah merotan seorang pemabuk dengan pelepah kurma dan kasut. Dan Abu Bakr رضی اللہ عنہ telah merotan seorang pemabuk sebanyak empat puluh kali.",
        "arabic_text": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ، قَالَ جَلَدَ النَّبِيُّ صلى الله عليه وسلم فِي الْخَمْرِ بِالْجَرِيدِ وَالنِّعَالِ، وَجَلَدَ أَبُو بَكْرٍ أَرْبَعِينَ‏.‏"
      },
      {
        "id": 6507,
        "hadith_number": "6777",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman Ke Atas Peminum Arak dan Larangan Mencela",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ عنہ :",
        "english_text": "\"A man who drank wine was brought to the Prophet. The Prophet (ﷺ) said, 'Beat him!\" Abu Huraira رضی اللہ عنہ added, \"So some of us beat him with our hands, and some with their shoes, and some with their garments (by twisting it) like a lash, and then when we finished, someone said to him, 'May Allah disgrace you!' On that the Prophet (ﷺ) said, 'Do not say so, for you are helping Satan to overpower him.' \"",
        "malay_translation": "Seorang lelaki yang meminum arak dibawa kepada Nabi. Nabi (ﷺ) bersabda, 'Pukul dia!' Abu Hurairah رضی اللہ عنہ menambah, \"Maka sebahagian daripada kami memukulnya dengan tangan kami, sebahagian dengan kasut kami, dan sebahagian dengan pakaian mereka (dengan memulasnya) seperti cemeti, dan kemudian apabila kami selesai, seseorang berkata kepadanya, 'Semoga Allah memburukkan engkau!' Mendengar itu, Nabi (ﷺ) bersabda, 'Janganlah kamu berkata demikian, kerana kamu membantu Syaitan untuk menguasainya.'\"",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو ضَمْرَةَ، أَنَسٌ عَنْ يَزِيدَ بْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِرَجُلٍ قَدْ شَرِبَ قَالَ ‏\"‏ اضْرِبُوهُ ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ فَمِنَّا الضَّارِبُ بِيَدِهِ، وَالضَّارِبُ بِنَعْلِهِ، وَالضَّارِبُ بِثَوْبِهِ، فَلَمَّا انْصَرَفَ قَالَ بَعْضُ الْقَوْمِ أَخْزَاكَ اللَّهُ‏.‏ قَالَ ‏\"‏ لاَ تَقُولُوا هَكَذَا لاَ تُعِينُوا عَلَيْهِ الشَّيْطَانَ ‏\"‏‏.‏"
      },
      {
        "id": 6508,
        "hadith_number": "6778",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Tidak Bersedih dengan Kematian dalam Hukuman Sah Melainkan Pemabuk",
        "perawi_melayu": "Diriwayatkan oleh `Ali bin Abi Talib رضی اللہ عنہ :",
        "english_text": "I would not feel sorry for one who dies because of receiving a legal punishment, except the drunk, for if he should die (when being punished), I would give blood money to his family because no fixed punishment has been ordered by Allah's Messenger (ﷺ) for the drunk.",
        "malay_translation": "Aku tidak akan bersedih bagi sesiapa yang meninggal dunia kerana menerima hukuman yang sah, kecuali pemabuk, kerana jika dia meninggal dunia (ketika dihukum), aku akan membayar diyat (wang darah) kepada keluarganya kerana tiada hukuman yang tetap diperintahkan oleh Rasulullah (ﷺ) untuk pemabuk.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا أَبُو حَصِينٍ، سَمِعْتُ عُمَيْرَ بْنَ سَعِيدٍ النَّخَعِيَّ، قَالَ سَمِعْتُ عَلِيَّ بْنَ أَبِي طَالِبٍ ـ رضى الله عنه ـ قَالَ مَا كُنْتُ لأُقِيمَ حَدًّا عَلَى أَحَدٍ فَيَمُوتَ، فَأَجِدَ فِي نَفْسِي، إِلاَّ صَاحِبَ الْخَمْرِ، فَإِنَّهُ لَوْ مَاتَ وَدَيْتُهُ، وَذَلِكَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يَسُنَّهُ‏.‏"
      },
      {
        "id": 6509,
        "hadith_number": "6779",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman Terhadap Pemabuk pada Zaman Nabi dan Khalifah",
        "perawi_melayu": "Diriwayatkan oleh As-Sa'ib bin Yazid:",
        "english_text": "We used to strike the drunks with our hands, shoes, clothes (by twisting it into the shape of lashes) during the lifetime of the Prophet, Abu Bakr رضی اللہ عنہ and the early part of `Umar's caliphate. But during the last period of `Umar's caliphate, he used to give the drunk forty lashes; and when drunks became mischievous and disobedient, he used to scourge them eighty lashes.",
        "malay_translation": "Kami dahulu memukul orang-orang mabuk dengan tangan kami, kasut, pakaian (dengan memulasnya menjadi seperti sebatan) semasa hayat Nabi, Abu Bakr رضی اللہ عنہ dan pada awal pemerintahan Khalifah `Umar. Tetapi pada zaman akhir pemerintahan Khalifah `Umar, beliau memberikan empat puluh kali sebatan kepada orang mabuk; dan apabila orang mabuk menjadi nakal dan tidak taat, beliau menyebat mereka lapan puluh kali.",
        "arabic_text": "حَدَّثَنَا مَكِّيُّ بْنُ إِبْرَاهِيمَ، عَنِ الْجُعَيْدِ، عَنْ يَزِيدَ بْنِ خُصَيْفَةَ، عَنِ السَّائِبِ بْنِ يَزِيدَ، قَالَ كُنَّا نُؤْتَى بِالشَّارِبِ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَإِمْرَةِ أَبِي بَكْرٍ وَصَدْرًا مِنْ خِلاَفَةِ عُمَرَ، فَنَقُومُ إِلَيْهِ بِأَيْدِينَا وَنِعَالِنَا وَأَرْدِيَتِنَا، حَتَّى كَانَ آخِرُ إِمْرَةِ عُمَرَ، فَجَلَدَ أَرْبَعِينَ، حَتَّى إِذَا عَتَوْا وَفَسَقُوا جَلَدَ ثَمَانِينَ‏.‏"
      },
      {
        "id": 6510,
        "hadith_number": "6780",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kisah Abdullah 'Donkey' dan Kecintaan kepada Allah dan Rasul-Nya",
        "perawi_melayu": "Diriwayatkan oleh 'Umar bin Al-Khattab رضی اللہ عنہ :",
        "english_text": "During the lifetime of the Prophet (ﷺ) there was a man called `Abdullah whose nickname was Donkey, and he used to make Allah's Messenger (ﷺ) laugh. The Prophet (ﷺ) lashed him because of drinking (alcohol). And one-day he was brought to the Prophet (ﷺ) on the same charge and was lashed. On that, a man among the people said, \"O Allah, curse him ! How frequently he has been brought (to the Prophet (ﷺ) on such a charge)!\" The Prophet (ﷺ) said, \"Do not curse him, for by Allah, I know for he loves Allah and His Apostle.\"",
        "malay_translation": "Semasa hayat Nabi (ﷺ) ada seorang lelaki bernama `Abdullah yang digelar Donkey (Keldai), dan dia selalu membuat Rasulullah (ﷺ) ketawa. Nabi (ﷺ) mencambuknya kerana meminum (alkohol). Dan pada suatu hari, dia dibawa kepada Nabi (ﷺ) atas tuduhan yang sama dan dicambuk. Pada ketika itu, seorang lelaki di kalangan orang ramai berkata, \"Ya Allah, laknatilah dia! Betapa kerapnya dia dibawa (kepada Nabi (ﷺ) atas tuduhan seperti itu)!\" Nabi (ﷺ) bersabda, \"Janganlah kamu melaknatnya, kerana demi Allah, sesungguhnya aku tahu dia mencintai Allah dan Rasul-Nya.\"",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي خَالِدُ بْنُ يَزِيدَ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، أَنَّ رَجُلاً، عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم كَانَ اسْمُهُ عَبْدَ اللَّهِ، وَكَانَ يُلَقَّبُ حِمَارًا، وَكَانَ يُضْحِكُ رَسُولَ اللَّهِ صلى الله عليه وسلم، وَكَانَ النَّبِيُّ صلى الله عليه وسلم قَدْ جَلَدَهُ فِي الشَّرَابِ، فَأُتِيَ بِهِ يَوْمًا فَأَمَرَ بِهِ فَجُلِدَ، فَقَالَ رَجُلٌ مِنَ الْقَوْمِ اللَّهُمَّ الْعَنْهُ مَا أَكْثَرَ مَا يُؤْتَى بِهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ تَلْعَنُوهُ، فَوَاللَّهِ مَا عَلِمْتُ أَنَّهُ يُحِبُّ اللَّهَ وَرَسُولَهُ ‏\"‏‏.‏"
      },
      {
        "id": 6511,
        "hadith_number": "6781",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Larangan Membantu Syaitan terhadap Saudara Muslim",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ عنہ :",
        "english_text": "A drunk was brought to the Prophet (ﷺ) and he ordered him to be beaten (lashed). Some of us beat him with our hands, and some with their shoes, and some with their garments (twisted in the form of a lash). When that drunk had left, a man said, \"What is wrong with him? May Allah disgrace him!\" Allah's Messenger (ﷺ) said, \"Do not help Satan against your (Muslim) brother.\"",
        "malay_translation": "Seorang pemabuk dibawa kepada Nabi (ﷺ) dan baginda memerintahkannya supaya dipukul (dirotan). Sebahagian daripada kami memukulnya dengan tangan kami, dan sebahagian dengan kasut mereka, dan sebahagian dengan pakaian mereka (dipintal dalam bentuk rotan). Apabila pemabuk itu telah pergi, seorang lelaki berkata, \"Apakah yang salah dengannya? Semoga Allah menghinakannya!\" Rasulullah (ﷺ) bersabda, \"Janganlah kamu membantu Syaitan terhadap saudaramu (Muslim).\"",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، حَدَّثَنَا ابْنُ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِسَكْرَانَ، فَأَمَرَ بِضَرْبِهِ، فَمِنَّا مَنْ يَضْرِبُهُ بِيَدِهِ، وَمِنَّا مَنْ يَضْرِبُهُ بِنَعْلِهِ، وَمِنَّا مَنْ يَضْرِبُهُ بِثَوْبِهِ، فَلَمَّا انْصَرَفَ قَالَ رَجُلٌ مَالَهُ أَخْزَاهُ اللَّهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَكُونُوا عَوْنَ الشَّيْطَانِ عَلَى أَخِيكُمْ ‏\"‏‏.‏"
      },
      {
        "id": 6512,
        "hadith_number": "6782",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Orang Berzina dan Pencuri Bukan Mukmin Ketika Melakukan Perbuatan Itu",
        "perawi_melayu": "Diriwayatkan oleh Ibnu Abbas رضی اللہ عنہما :",
        "english_text": "The Prophet (ﷺ) said, \"When (a person) an adulterer commits illegal sexual intercourse then he is not a believer at the time he is doing it; and when somebody steals, then he is not a believer at the time he is stealing.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Apabila (seseorang) penzina melakukan persetubuhan haram, maka dia bukanlah seorang mukmin pada waktu dia melakukannya; dan apabila seseorang mencuri, maka dia bukanlah seorang mukmin pada waktu dia mencuri.\"",
        "arabic_text": "حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ، حَدَّثَنَا فُضَيْلُ بْنُ غَزْوَانَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَزْنِي الزَّانِي حِينَ يَزْنِي وَهْوَ مُؤْمِنٌ، وَلاَ يَسْرِقُ حِينَ يَسْرِقُ وَهْوَ مُؤْمِنٌ ‏\"‏‏.‏"
      },
      {
        "id": 6513,
        "hadith_number": "6783",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Allah Melaknat Pencuri Telur dan Tali",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) said, \"Allah curses a man who steals an egg and gets his hand cut off, or steals a rope and gets his hands cut off.\" Al-A`mash said, \"People used to interpret the Baida as an iron helmet, and they used to think that the rope may cost a few dirhams.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Allah melaknat seorang lelaki yang mencuri telur lalu dipotong tangannya, atau mencuri tali lalu dipotong tangannya.\" Al-A'mash berkata, \"Orang ramai dahulu mentafsirkan Baida sebagai topi besi, dan mereka berpendapat bahawa tali itu mungkin berharga beberapa dirham.",
        "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنِي أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ سَمِعْتُ أَبَا صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لَعَنَ اللَّهُ السَّارِقَ، يَسْرِقُ الْبَيْضَةَ فَتُقْطَعُ يَدُهُ، وَيَسْرِقُ الْحَبْلَ فَتُقْطَعُ يَدُهُ ‏\"‏‏.‏ قَالَ الأَعْمَشُ كَانُوا يَرَوْنَ أَنَّهُ بَيْضُ الْحَدِيدِ، وَالْحَبْلُ كَانُوا يَرَوْنَ أَنَّهُ مِنْهَا مَا يَسْوَى دَرَاهِمَ‏.‏"
      },
      {
        "id": 6514,
        "hadith_number": "6784",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ikrar Kesetiaan dan Janji kepada Allah",
        "perawi_melayu": "Diriwayatkan daripada 'Ubada bin As-Samit رضی اللہ عنہ :",
        "english_text": "We were with the Prophet (ﷺ) in a gathering and he said, 'Swear allegiance to me that you will not worship anything besides Allah, Will not steal, and will not commit illegal sexual intercourse.\" And then (the Prophet) recited the whole Verse (i.e. 60:12). The Prophet (ﷺ) added, 'And whoever among you fulfills his pledge, his reward is with Allah; and whoever commits something of such sins and receives the legal punishment for it, that will be considered as the expiation for that sin, and whoever commits something of such sins and Allah screens him, it is up to Allah whether to excuse or punish him.\"",
        "malay_translation": "Kami bersama Nabi (ﷺ) dalam satu perhimpunan dan Baginda bersabda, 'Berilah bai'ah (ikrar kesetiaan) kepadaku bahawa kamu tidak akan menyembah sesuatu selain Allah, tidak akan mencuri, dan tidak akan melakukan persetubuhan haram.' Kemudian (Nabi) membacakan keseluruhan Ayat (iaitu 60:12). Nabi (ﷺ) menambah, 'Sesiapa di antara kamu yang menunaikan janjinya, maka ganjarannya adalah di sisi Allah; dan sesiapa yang melakukan dosa sedemikian dan menerima hukuman syar'i untuknya, maka itu akan dianggap sebagai penebus dosa tersebut, dan sesiapa yang melakukan dosa sedemikian dan Allah menutup aibnya, maka terserah kepada Allah sama ada untuk mengampuni atau menghukumnya.'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ ـ رضى الله عنه ـ قَالَ كُنَّا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فِي مَجْلِسٍ فَقَالَ ‏\"‏ بَايِعُونِي عَلَى أَنْ لاَ تُشْرِكُوا بِاللَّهِ شَيْئًا وَلاَ تَسْرِقُوا، وَلاَ تَزْنُوا ‏\"‏‏.‏ وَقَرَأَ هَذِهِ الآيَةَ كُلَّهَا ‏\"‏ فَمَنْ وَفَى مِنْكُمْ فَأَجْرُهُ عَلَى اللَّهِ وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا فَعُوقِبَ بِهِ، فَهْوَ كَفَّارَتُهُ، وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا، فَسَتَرَهُ اللَّهُ عَلَيْهِ، إِنْ شَاءَ غَفَرَ لَهُ، وَإِنْ شَاءَ عَذَّبَهُ ‏\"‏‏.‏"
      },
      {
        "id": 6515,
        "hadith_number": "6785",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Kesucian Bulan, Kota, dan Hari di Haji Wada'",
        "perawi_melayu": "Diriwayatkan oleh Abdullah رضي اللہ عنہ :",
        "english_text": "Allah Apostle said in Hajjat-al-Wada`, \"Which month (of the year) do you think is most sacred?\" The people said, \"This current month of ours (the month of Dhull-Hijja).\" He said, \"Which town (country) do you think is the most sacred?\" They said, \"This city of ours (Mecca).\" He said, \"Which day do you think is the most sacred?\" The people said, \"This day of ours.\" He then said, \"Allah, the Blessed, the Supreme, has made your blood, your property and your honor as sacred as this day of yours in this town of yours, in this month of yours (and such protection cannot be slighted) except rightfully.\" He then said thrice, \"Have I conveyed Allah's Message (to you)?\" The people answered him each time saying, 'Yes.\" The Prophet (ﷺ) added, 'May Allah be merciful to you (or, woe on you)! Do not revert to disbelief after me by cutting the necks of each other.'",
        "malay_translation": "Rasulullah ﷺ bersabda dalam Haji Wada', \"Bulan (tahun) manakah yang kamu fikir paling suci?\" Para sahabat menjawab, \"Bulan kita ini (bulan Zulhijjah).\" Baginda bertanya, \"Negeri (negara) manakah yang kamu fikir paling suci?\" Mereka menjawab, \"Kota kita ini (Mekah).\" Baginda bertanya, \"Hari manakah yang kamu fikir paling suci?\" Mereka menjawab, \"Hari kita ini.\" Kemudian Baginda bersabda, \"Sesungguhnya Allah, Yang Maha Memberkati, Yang Maha Agung, telah menjadikan darah kamu, harta kamu dan kehormatan kamu suci seperti hari kamu ini di kota kamu ini, di bulan kamu ini (dan perlindungan seperti ini tidak boleh diabaikan) kecuali dengan hak.\" Kemudian Baginda bersabda tiga kali, \"Adakah aku telah menyampaikan Risalah Allah (kepada kamu)?\" Para sahabat menjawab setiap kali dengan berkata, 'Ya.\" Nabi ﷺ menambahkan, 'Semoga Allah merahmati kamu (atau, celakalah kamu)! Janganlah kembali kepada kekufuran selepasku dengan saling memenggal leher antara satu sama lain.'",
        "arabic_text": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا عَاصِمُ بْنُ عَلِيٍّ، حَدَّثَنَا عَاصِمُ بْنُ مُحَمَّدٍ، عَنْ وَاقِدِ بْنِ مُحَمَّدٍ، سَمِعْتُ أَبِي قَالَ عَبْدُ اللَّهِ، قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ ‏\"‏ أَلاَ أَىُّ شَهْرٍ تَعْلَمُونَهُ أَعْظَمُ حُرْمَةً ‏\"‏‏.‏ قَالُوا أَلاَ شَهْرُنَا هَذَا‏.‏ قَالَ ‏\"‏ أَلاَ أَىُّ بَلَدٍ تَعْلَمُونَهُ أَعْظَمُ حُرْمَةً ‏\"‏‏.‏ قَالُوا أَلاَ بَلَدُنَا هَذَا‏.‏ قَالَ ‏\"‏ أَلاَ أَىُّ يَوْمٍ تَعْلَمُونَهُ أَعْظَمُ حُرْمَةً ‏\"‏‏.‏ قَالُوا أَلاَ يَوْمُنَا هَذَا‏.‏ قَالَ ‏\"‏ فَإِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَدْ حَرَّمَ دِمَاءَكُمْ وَأَمْوَالَكُمْ وَأَعْرَاضَكُمْ، إِلاَّ بِحَقِّهَا، كَحُرْمَةِ يَوْمِكُمْ هَذَا، فِي بَلَدِكُمْ هَذَا، فِي شَهْرِكُمْ هَذَا، أَلاَ هَلْ بَلَّغْتُ ‏\"‏‏.‏ ـ ثَلاَثًا كُلُّ ذَلِكَ يُجِيبُونَهُ أَلاَ نَعَمْ ـ قَالَ ‏\"‏ وَيْحَكُمْ ـ أَوْ وَيْلَكُمْ ـ لاَ تَرْجِعُنَّ بَعْدِي كُفَّارًا، يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ ‏\"‏‏.‏"
      },
      {
        "id": 6516,
        "hadith_number": "6786",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Pilihan Nabi ﷺ Dalam Urusan Dunia dan Agama",
        "perawi_melayu": "Diriwayatkan oleh Aisyah رضي الله عنها :",
        "english_text": "Whenever the Prophet (ﷺ) was given an option between two things, he used to select the easier of the tow as long as it was not sinful; but if it was sinful, he would remain far from it. By Allah, he never took revenge for himself concerning any matter that was presented to him, but when Allah's Limits were transgressed, he would take revenge for Allah's Sake.",
        "malay_translation": "Apabila Nabi ﷺ diberi pilihan antara dua perkara, baginda akan memilih yang lebih mudah selagi ia tidak berdosa; tetapi jika ia berdosa, baginda akan menjauhinya. Demi Allah, baginda tidak pernah membalas dendam untuk diri sendiri mengenai sebarang perkara yang dikemukakan kepada baginda, tetapi apabila batasan Allah dilanggar, baginda akan membalas dendam kerana Allah.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا خُيِّرَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ أَمْرَيْنِ إِلاَّ اخْتَارَ أَيْسَرَهُمَا، مَا لَمْ يَأْثَمْ، فَإِذَا كَانَ الإِثْمُ كَانَ أَبْعَدَهُمَا مِنْهُ، وَاللَّهِ مَا انْتَقَمَ لِنَفْسِهِ فِي شَىْءٍ يُؤْتَى إِلَيْهِ قَطُّ، حَتَّى تُنْتَهَكَ حُرُمَاتُ اللَّهِ، فَيَنْتَقِمُ لِلَّهِ‏.‏"
      },
      {
        "id": 6517,
        "hadith_number": "6787",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keadilan dan Hukuman dalam Islam",
        "perawi_melayu": "Diriwayatkan daripada `Aisha رضی اللہ عنہا :",
        "english_text": "Usama رضی اللہ عنہ approached the Prophet (ﷺ) on behalf of a woman (who had committed theft). The Prophet (ﷺ) said, \"The people before you were destroyed because they used to inflict the legal punishments on the poor and forgive the rich. By Him in Whose Hand my soul is! If Fatima رضی اللہ عنہا (the daughter of the Prophet (ﷺ) ) did that (i.e. stole), I would cut off her hand.\"",
        "malay_translation": "Usama رضی اللہ عنہ telah menemui Nabi (ﷺ) bagi pihak seorang wanita (yang telah melakukan kecurian). Nabi (ﷺ) bersabda, \"Sesungguhnya umat sebelum kamu telah binasa kerana mereka mengenakan hukuman ke atas orang miskin dan memaafkan orang kaya. Demi Allah yang jiwaku di tangan-Nya! Sekiranya Fatimah رضی اللہ عنہا (puteri Nabi (ﷺ) ) melakukan perkara itu (iaitu mencuri), nescaya aku akan memotong tangannya.\"",
        "arabic_text": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ أُسَامَةَ، كَلَّمَ النَّبِيَّ صلى الله عليه وسلم فِي امْرَأَةٍ فَقَالَ ‏ \"‏ إِنَّمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ أَنَّهُمْ كَانُوا يُقِيمُونَ الْحَدَّ عَلَى الْوَضِيعِ، وَيَتْرُكُونَ الشَّرِيفَ، وَالَّذِي نَفْسِي بِيَدِهِ لَوْ فَاطِمَةُ فَعَلَتْ ذَلِكَ لَقَطَعْتُ يَدَهَا ‏\"‏‏.‏"
      },
      {
        "id": 6518,
        "hadith_number": "6788",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Keadilan dalam Menegakkan Hukum: Kisah Wanita Makhzumiya yang Mencuri",
        "perawi_melayu": "Diriwayatkan daripada `Aisha رضی اللہ عنہا :",
        "english_text": "The Quraish people became very worried about the Makhzumiya lady who had committed theft. They said, \"Nobody can speak (in favor of the lady) to Allah's Messenger (ﷺ) and nobody dares do that except Usama رضی اللہ عنہ who is the favorite of Allah's Messenger (ﷺ). \" When Usama رضی اللہ عنہ spoke to Allah's Messenger (ﷺ) about that matter, Allah's Messenger (ﷺ) said, \"Do you intercede (with me) to violate one of the legal punishment of Allah?\" Then he got up and addressed the people, saying, \"O people! The nations before you went astray because if a noble person committed theft, they used to leave him, but if a weak person among them committed theft, they used to inflict the legal punishment on him. By Allah, if Fatima, the daughter of Muhammad committed theft, Muhammad will cut off her hand.!\"",
        "malay_translation": "Kaum Quraisy menjadi sangat bimbang tentang wanita Makhzumiya yang telah melakukan kecurian. Mereka berkata, \"Tiada siapa boleh bercakap (memihak kepada wanita itu) kepada Rasulullah ﷺ dan tiada siapa berani berbuat demikian kecuali Usama رضی اللہ عنہ yang merupakan kesayangan Rasulullah ﷺ.\" Apabila Usama رضی اللہ عنہ berbicara kepada Rasulullah ﷺ tentang perkara itu, Rasulullah ﷺ bersabda, \"Adakah kamu meminta syafaat (kepada aku) untuk melanggar salah satu hukuman Allah?\" Kemudian baginda bangun dan berucap kepada orang ramai, seraya bersabda, \"Wahai manusia! Sesungguhnya umat sebelum kamu telah sesat kerana jika seorang yang mulia mencuri, mereka membiarkannya, tetapi jika orang yang lemah di antara mereka mencuri, mereka akan melaksanakan hukuman ke atasnya. Demi Allah, sekiranya Fatimah, anak perempuan Muhammad mencuri, Muhammad akan memotong tangannya!\"",
        "arabic_text": "حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ قُرَيْشًا، أَهَمَّتْهُمُ الْمَرْأَةُ الْمَخْزُومِيَّةُ الَّتِي سَرَقَتْ فَقَالُوا مَنْ يُكَلِّمُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَمَنْ يَجْتَرِئُ عَلَيْهِ إِلاَّ أُسَامَةُ حِبُّ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَكَلَّمَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَتَشْفَعُ فِي حَدٍّ مِنْ حُدُودِ اللَّهِ ‏\"‏‏.‏ ثُمَّ قَامَ فَخَطَبَ قَالَ ‏\"‏ يَا أَيُّهَا النَّاسُ إِنَّمَا ضَلَّ مَنْ قَبْلَكُمْ أَنَّهُمْ كَانُوا إِذَا سَرَقَ الشَّرِيفُ تَرَكُوهُ، وَإِذَا سَرَقَ الضَّعِيفُ فِيهِمْ أَقَامُوا عَلَيْهِ الْحَدَّ، وَايْمُ اللَّهِ لَوْ أَنَّ فَاطِمَةَ بِنْتَ مُحَمَّدٍ سَرَقَتْ لَقَطَعَ مُحَمَّدٌ يَدَهَا ‏\"‏‏.‏"
      },
      {
        "id": 6519,
        "hadith_number": "6789",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Potong Tangan Bagi Pencuri",
        "perawi_melayu": "Diriwayatkan daripada 'Aisha رضی اللہ عنہا :",
        "english_text": "The Prophet (ﷺ) said, \"The hand should be cut off for stealing something that is worth a quarter of a Dinar or more.\" Similarly, Abdur Rehman bin Khalid and Zuhri's nephew and Mamar reported from Zuhri.",
        "malay_translation": "Nabi (ﷺ) bersabda, \"Tangan hendaklah dipotong bagi mencuri sesuatu yang bernilai suku Dinar atau lebih.\" Demikian juga Abdur Rehman bin Khalid dan anak saudara Zuhri serta Mamar meriwayatkan daripada Zuhri.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ تُقْطَعُ الْيَدُ فِي رُبُعِ دِينَارٍ فَصَاعِدًا ‏\"‏‏.‏ تَابَعَهُ عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ وَابْنُ أَخِي الزُّهْرِيِّ وَمَعْمَرٌ عَنِ الزُّهْرِيِّ‏.‏"
      },
      {
        "id": 6520,
        "hadith_number": "6790",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman Memotong Tangan Pencuri",
        "perawi_melayu": "Diriwayatkan daripada 'Aisha رضی اللہ عنہا :",
        "english_text": "The Prophet (ﷺ) said, \"The hand of a thief should be cut off for stealing a quarter of a Dinar.\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Tangan pencuri hendaklah dipotong kerana mencuri suku Dinar.\"",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، عَنِ ابْنِ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، وَعَمْرَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ تُقْطَعُ يَدُ السَّارِقِ فِي رُبُعِ دِينَارٍ ‏\"‏‏.‏"
      },
      {
        "id": 6521,
        "hadith_number": "6791",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman Memotong Tangan Bagi Pencuri",
        "perawi_melayu": "Diriwayatkan daripada `Aisha رضی اللہ عنہا :",
        "english_text": "The Prophet (ﷺ) said, \"The hand should be cut off for stealing a quarter of a Dinar.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda, \"Tangan hendaklah dipotong kerana mencuri suku daripada Dinar.\"",
        "arabic_text": "حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا الْحُسَيْنُ، عَنْ يَحْيَى، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ الأَنْصَارِيِّ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، حَدَّثَتْهُ أَنَّ عَائِشَةَ ـ رضى الله عنها ـ حَدَّثَتْهُمْ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ يُقْطَعُ فِي رُبُعِ دِينَارٍ ‏\"‏‏.‏"
      },
      {
        "id": 6522,
        "hadith_number": "6792",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman Potong Tangan Pencuri",
        "perawi_melayu": "Diriwayatkan daripada `Aisha رضی اللہ عنہا :",
        "english_text": "The hand of a thief was not cut off during the lifetime of the Prophet (ﷺ) except for stealing something equal to a shield in value. A similar hadith is narrated from `Aisha رضی اللہ عنہا through another chain.",
        "malay_translation": "Tangan pencuri tidak dipotong pada zaman Nabi (ﷺ) kecuali mencuri sesuatu yang nilainya sama dengan nilai perisai. Hadis yang serupa diriwayatkan daripada `Aisha رضی اللہ عنہا melalui sanad yang lain.",
        "arabic_text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا عَبْدَةُ ، عَنْ هِشَامِ بْنِ عُرْوَةَ ، عَنْ أَبِيهِ ، قَالَ : أَخْبَرَتْنِي عَائِشَةُ أَنَّ يَدَ السَّارِقِ لَمْ تُقْطَعْ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، إِلَّا فِي ثَمَنِ مِجَنٍّ حَجَفَةٍ أَوْ تُرْسٍ ، حَدَّثَنَا عُثْمَانُ ، حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ ، حَدَّثَنَا هِشَامٌ ، عَنْ أَبِيهِ ، عَنْ عَائِشَةَ : مِثْلَهُ."
      },
      {
        "id": 6523,
        "hadith_number": "6793",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman Potong Tangan Pencuri dan Nilai Barang",
        "perawi_melayu": "Diriwayatkan daripada `Aisha رضی اللہ عنہا :",
        "english_text": "A thief's hand was not cut off for stealing something cheaper than a Hajafa or a Turs (two kinds of shields), each of which was worth a (respectable) price. Waki and Ibn-e-Idrees from Hisham, and reported it from his father in a Mursal way.",
        "malay_translation": "Tangan pencuri tidak dipotong kerana mencuri sesuatu yang lebih murah daripada Hajafa atau Turs (dua jenis perisai), yang mana setiap satunya bernilai harga yang (terhormat). Waki dan Ibn-e-Idrees daripada Hisham, dan meriwayatkannya daripada bapanya dalam cara Mursal.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ لَمْ تَكُنْ تُقْطَعُ يَدُ السَّارِقِ فِي أَدْنَى مِنْ حَجَفَةٍ أَوْ تُرْسٍ، كُلُّ وَاحِدٍ مِنْهُمَا ذُو ثَمَنٍ‏.‏ رَوَاهُ وَكِيعٌ وَابْنُ إِدْرِيسَ عَنْ هِشَامٍ عَنْ أَبِيهِ مُرْسَلاً‏.‏"
      },
      {
        "id": 6524,
        "hadith_number": "6794",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman Potong Tangan Bagi Pencuri",
        "perawi_melayu": "Diriwayatkan daripada 'Aisha رضي الله عنها :",
        "english_text": "A thief's hand was not cut off for stealing something worth less than the price of a shield, whether a Turs or Hajafa (two kinds of shields), each of which was worth a (respectable) price.",
        "malay_translation": "Tangan seorang pencuri tidak dipotong kerana mencuri sesuatu yang nilainya kurang daripada harga sebuah perisai, sama ada Turs atau Hajafa (dua jenis perisai), yang masing-masing bernilai harga yang (bermaruah).",
        "arabic_text": "حَدَّثَنِي يُوسُفُ بْنُ مُوسَى، حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ هِشَامُ بْنُ عُرْوَةَ أَخْبَرَنَا عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَمْ تُقْطَعْ يَدُ سَارِقٍ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم فِي أَدْنَى مِنْ ثَمَنِ الْمِجَنِّ، تُرْسٍ أَوْ حَجَفَةٍ، وَكَانَ كُلُّ وَاحِدٍ مِنْهُمَا ذَا ثَمَنٍ‏.‏"
      },
      {
        "id": 6525,
        "hadith_number": "6795",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman Memotong Tangan Pencuri",
        "perawi_melayu": "Diriwayatkan oleh Ibnu Umar رضی اللہ عنہما :",
        "english_text": "Allah's Messenger (ﷺ) cut off the hand of a thief for stealing a shield that was worth three Dirhams.",
        "malay_translation": "Rasulullah (ﷺ) memotong tangan seorang pencuri kerana mencuri perisai yang bernilai tiga Dirham.",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكُ بْنُ أَنَسٍ، عَنْ نَافِعٍ، مَوْلَى عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَطَعَ فِي مِجَنٍّ ثَمَنُهُ ثَلاَثَةُ دَرَاهِمَ‏.‏ تَابَعَهُ مُحَمَّدُ بْنُ إِسْحَاقَ وَقَالَ اللَّيْثُ حَدَّثَنِي نَافِعٌ قِيمَتُهُ"
      },
      {
        "id": 6526,
        "hadith_number": "6796",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman Memotong Tangan Pencuri",
        "perawi_melayu": "Diriwayatkan oleh Ibnu Umar رضی اللہ عنہما :",
        "english_text": "The Prophet (ﷺ) cut off the hand of a thief for stealing a shield that was worth three Dirhams.",
        "malay_translation": "Nabi (ﷺ) memotong tangan seorang pencuri kerana mencuri perisai yang bernilai tiga Dirham.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَطَعَ النَّبِيُّ صلى الله عليه وسلم فِي مِجَنٍّ ثَمَنُهُ ثَلاَثَةُ دَرَاهِمَ‏.‏"
      },
      {
        "id": 6527,
        "hadith_number": "6797",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Hukuman Memotong Tangan Pencuri",
        "perawi_melayu": "Diriwayatkan oleh Abdullah bin `Umar رضی اللہ عنہ :",
        "english_text": "The Prophet (ﷺ) cut off the hand of a thief for stealing a shield that was worth three Dirhams.",
        "malay_translation": "Nabi (ﷺ) memotong tangan seorang pencuri kerana mencuri perisai yang bernilai tiga Dirham.",
        "arabic_text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ، قَالَ قَطَعَ النَّبِيُّ صلى الله عليه وسلم فِي مِجَنٍّ ثَمَنُهُ ثَلاَثَةُ دَرَاهِمَ‏.‏"
      },
      {
        "id": 6528,
        "hadith_number": "6798",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Potong Tangan Pencuri Kerana Mencuri Perisai",
        "perawi_melayu": "Diriwayatkan daripada Abdullah bin Umar رضي الله عنهما :",
        "english_text": "The Prophet (ﷺ) cutoff the hand of a thief for stealing a shield that was worth three Dirhams. Likewise Muhammad bin Ishaq has reported. And Laith has reported the word ''قِيمَتُهُ '' from Nafi'o.",
        "malay_translation": "Nabi ﷺ memotong tangan seorang pencuri kerana mencuri sebuah perisai yang bernilai tiga Dirham. Demikian juga diriwayatkan oleh Muhammad bin Ishaq. Dan Laith telah meriwayatkan perkataan ''قِيمَتُهُ'' daripada Nafi'.",
        "arabic_text": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَبُو ضَمْرَةَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَطَعَ النَّبِيُّ صلى الله عليه وسلم يَدَ سَارِقٍ فِي مِجَنٍّ ثَمَنُهُ ثَلاَثَةُ دَرَاهِمَ‏.‏ تَابَعَهُ مُحَمَّدُ بْنُ إِسْحَاقَ، وَقَالَ اللَّيْثُ حَدَّثَنِي نَافِعٌ ‏ \"‏ قِيمَتُهُ ‏\"‏‏.‏"
      },
      {
        "id": 6529,
        "hadith_number": "6799",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Laknat Allah ke atas Pencuri Telur dan Tali",
        "perawi_melayu": "Diriwayatkan oleh Abu Hurairah رضی اللہ عنہ :",
        "english_text": "Allah 's Apostle said, \"Allah curses the thief who steals an egg (or a helmet) for which his hand is to be cut off, or steals a rope, for which his hand is to be cut off.\"",
        "malay_translation": "Rasulullah ﷺ bersabda, \"Allah melaknat pencuri yang mencuri telur (atau topi keledar) yang menyebabkan tangannya dipotong, atau mencuri tali yang menyebabkan tangannya dipotong.\"",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الأَعْمَشُ، قَالَ سَمِعْتُ أَبَا صَالِحٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَعَنَ اللَّهُ السَّارِقَ، يَسْرِقُ الْبَيْضَةَ فَتُقْطَعُ يَدُهُ، وَيَسْرِقُ الْحَبْلَ فَتُقْطَعُ يَدُهُ ‏\"‏‏.‏"
      },
      {
        "id": 6530,
        "hadith_number": "6800",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Wanita yang Tangan Dipotong dan Taubatnya yang Ikhlas",
        "perawi_melayu": "Riwayat `Aisha رضی اللہ عنہا :",
        "english_text": "The Prophet (ﷺ) cut off the hand of a lady, and that lady used to come to me, and I used to convey her message to the Prophet (ﷺ) and she repented, and her repentance was sincere.",
        "malay_translation": "Nabi (ﷺ) memotong tangan seorang wanita, dan wanita itu selalu datang kepada saya, dan saya menyampaikan pesannya kepada Nabi (ﷺ), dan dia bertaubat, dan taubatnya itu ikhlas.",
        "arabic_text": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَطَعَ يَدَ امْرَأَةٍ‏.‏ قَالَتْ عَائِشَةُ وَكَانَتْ تَأْتِي بَعْدَ ذَلِكَ، فَأَرْفَعُ حَاجَتَهَا إِلَى النَّبِيِّ صلى الله عليه وسلم فَتَابَتْ وَحَسُنَتْ تَوْبَتُهَا‏.‏"
      },
      {
        "id": 6531,
        "hadith_number": "6801",
        "status": "Sahih",
        "nama_buku": "Sahih Bukhari",
        "penulis_buku": "Imam Bukhari",
        "tajuk_hadith": "Ikrar Taat Setia kepada Nabi (ﷺ) dan Balasan bagi Pelanggar",
        "perawi_melayu": "Diriwayatkan daripada Ubada bin As-Samit رضي الله عنه :",
        "english_text": "I gave the pledge of allegiance to the Prophet (ﷺ) with a group of people, and he said, \"I take your pledge that you will not worship anything besides Allah, will not steal, will not commit infanticide, will not slander others by forging false statements and spreading it, and will not disobey me in anything good. And whoever among you fulfill all these (obligations of the pledge), his reward is with Allah. And whoever commits any of the above crimes and receives his legal punishment in this world, that will be his expiation and purification. But if Allah screens his sin, it will be up to Allah, Who will either punish or forgive him according to His wish.\" Abu `Abdullah said: \"If a thief repents after his hand has been cut off, the his witness well be accepted. Similarly, if any person upon whom any legal punishment has been inflicted, repents, his witness will be accepted.\"",
        "malay_translation": "Aku memberi ikrar taat setia kepada Nabi (ﷺ) bersama sekumpulan orang, dan baginda bersabda, \"Aku menerima ikrar kamu bahawa kamu tidak akan menyembah selain Allah, tidak akan mencuri, tidak akan membunuh anak, tidak akan memfitnah orang lain dengan membuat pernyataan palsu dan menyebarkannya, dan tidak akan menderhakai aku dalam perkara yang baik. Dan sesiapa di antara kamu yang memenuhi semua (kewajipan ikrar) ini, maka ganjarannya ada pada Allah. Dan sesiapa yang melakukan mana-mana jenayah di atas dan menerima hukuman sahnya di dunia ini, maka itulah penebusan dan penyuciannya. Tetapi jika Allah menutup dosanya, maka terpulang kepada Allah, yang akan menghukum atau mengampuninya sesuai dengan kehendak-Nya.\" Abu `Abdullah berkata: \"Jika pencuri bertaubat selepas tangannya dipotong, maka kesaksiannya akan diterima. Begitu juga, jika sesiapa yang dikenakan hukuman sah, bertaubat, maka kesaksiannya akan diterima.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْجُعْفِيُّ، حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي إِدْرِيسَ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ ـ رضى الله عنه ـ قَالَ بَايَعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي رَهْطٍ، فَقَالَ ‏ \"‏ أُبَايِعُكُمْ عَلَى أَنْ لاَ تُشْرِكُوا بِاللَّهِ شَيْئًا، وَلاَ تَسْرِقُوا، وَلاَ تَقْتُلُوا أَوْلاَدَكُمْ، وَلاَ تَأْتُوا بِبُهْتَانٍ تَفْتَرُونَهُ بَيْنَ أَيْدِيكُمْ وَأَرْجُلِكُمْ، وَلاَ تَعْصُونِي فِي مَعْرُوفٍ، فَمَنْ وَفَى مِنْكُمْ فَأَجْرُهُ عَلَى اللَّهِ، وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا فَأُخِذَ بِهِ فِي الدُّنْيَا فَهْوَ كَفَّارَةٌ لَهُ وَطَهُورٌ، وَمَنْ سَتَرَهُ اللَّهُ فَذَلِكَ إِلَى اللَّهِ، إِنْ شَاءَ عَذَّبَهُ وَإِنْ شَاءَ غَفَرَ لَهُ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ إِذَا تَابَ السَّارِقُ بَعْدَ مَا قُطِعَ يَدُهُ، قُبِلَتْ شَهَادَتُهُ، وَكُلُّ مَحْدُودٍ كَذَلِكَ إِذَا تَابَ قُبِلَتْ شَهَادَتُهُ‏.‏"
      }
    ]
  }
}