{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 153,
    "data": [
      {
        "id": 30650,
        "hadith_number": "1956",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Dibukanya Pintu-Pintu Syurga di Bulan Ramadhan",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "Upon the authority of Abu Hurairah (may Allah be pleased with him), who said: The Messenger of Allah (peace and blessings of Allah be upon him) said, \"When the month of Ramadan comes, the gates of Paradise are opened.\" In another narration: \"The gates of Paradise are opened, the gates of Hell are closed, and the devils are chained.\" In another narration: \"The gates of mercy are opened.\"",
        "malay_translation": "Daripada Abu Hurairah رضي الله عنه, beliau berkata: Rasulullah صلى الله عليه وسلم bersabda, \"Apabila masuk bulan Ramadhan, pintu-pintu syurga dibuka.\" Dalam riwayat lain: \"Pintu-pintu syurga dibuka, pintu-pintu neraka ditutup, dan syaitan-syaitan dirantai.\" Dalam riwayat lain: \"Pintu-pintu rahmat dibuka.\"",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِذا دخل شهر رَمَضَانُ فُتِحَتْ أَبْوَابُ السَّمَاءِ» . وَفِي رِوَايَةٍ: «فُتِّحَتْ أَبْوَابُ الْجَنَّةِ وَغُلِّقَتْ أَبْوَابُ جَهَنَّمَ وَسُلْسِلَتِ الشَّيَاطِينُ» . وَفِي رِوَايَةٍ: «فُتِحَتْ أَبْوَابُ الرَّحْمَةِ»"
      },
      {
        "id": 30651,
        "hadith_number": "1957",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pintu Ar-Rayyan di Syurga untuk Orang yang Berpuasa",
        "perawi_melayu": "Sahal bin Sa'ad",
        "english_text": "وعن سهل بن سعد قال: قال رسول الله صلى الله عليه وسلم: في الجنة ثمانية أبواب منها: باب يسمى الريان لا يدخله إلا الصائمون",
        "malay_translation": "Daripada Sahal bin Sa'ad RA, beliau berkata: Rasulullah SAW bersabda: “Di dalam syurga terdapat lapan buah pintu, antaranya: pintu yang dinamakan Ar-Rayyan, tidak akan memasukinya kecuali orang-orang yang berpuasa.”",
        "arabic_text": "وَعَنْ سَهْلِ بْنِ سَعْدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: فِي الْجَنَّةِ ثَمَانِيَةُ أَبْوَابٍ مِنْهَا: بَابٌ يُسَمَّى الرَّيَّانَ لَا يدْخلهُ إِلَّا الصائمون"
      },
      {
        "id": 30652,
        "hadith_number": "1958",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Puasa, Qiyam Ramadan, dan Lailatul Qadar",
        "perawi_melayu": "Tidak Tersedia",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: “Barangsiapa berpuasa Ramadan dengan penuh keimanan dan mengharapkan ganjaran (daripada Allah), akan diampuni dosa-dosanya yang telah lalu. Dan barangsiapa yang mendirikan (solat) malam Ramadan dengan penuh keimanan dan mengharapkan ganjaran (daripada Allah), akan diampuni dosa-dosanya yang telah lalu. Dan barangsiapa yang mendirikan (solat) pada malam Lailatul Qadar dengan penuh keimanan dan mengharapkan ganjaran (daripada Allah), akan diampuni dosa-dosanya yang telah lalu.”",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ صَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ. وَمَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ. وَمَنْ قَامَ لَيْلَةَ الْقَدْرِ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ»"
      },
      {
        "id": 30653,
        "hadith_number": "1959",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Puasa: Ganjaran Berlipat Ganda dan Keharuman di Sisi Allah",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: Setiap amalan anak Adam akan dilipatgandakan, satu kebaikan (dibalas) dengan sepuluh kali ganda hingga tujuh ratus kali ganda. Allah Taala berfirman: Kecuali puasa, sesungguhnya ia adalah untuk-Ku dan Aku sendiri yang akan membalasnya. Dia (orang yang berpuasa) meninggalkan syahwat dan makanannya kerana Aku. Bagi orang yang berpuasa ada dua kegembiraan: kegembiraan ketika berbuka dan kegembiraan ketika bertemu dengan Tuhannya. Sesungguhnya bau mulut orang yang berpuasa lebih harum di sisi Allah daripada bau kasturi. Puasa adalah perisai. Apabila salah seorang daripada kamu berpuasa, maka janganlah dia berkata keji dan janganlah dia berteriak-teriak. Jika seseorang mencercanya atau mengajaknya bergaduh, maka hendaklah dia berkata: Sesungguhnya aku sedang berpuasa.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: كُلُّ عَمَلِ ابْنِ آدَمَ يُضَاعَفُ الْحَسَنَةُ بِعَشْرِ أَمْثَالِهَا إِلَى سَبْعِمِائَةِ ضِعْفٍ قَالَ اللَّهُ تَعَالَى: إِلَّا الصَّوْمَ فَإِنَّهُ لِي وَأَنَا أَجْزِي بِهِ يَدَعُ شَهْوَتَهُ وَطَعَامَهُ مِنْ أَجْلِي لِلصَّائِمِ فَرْحَتَانِ: فَرْحَةٌ عِنْدَ فِطْرِهِ وَفَرْحَةٌ عِنْدَ لِقَاءِ رَبِّهِ وَلَخُلُوفِ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ وَالصِّيَامُ جُنَّةٌ وَإِذَا كَانَ يَوْمُ صَوْمِ أَحَدِكُمْ فَلَا يَرْفُثْ وَلَا يصخب وفإن سَابَّهُ أَحَدٌ أَوْ قَاتَلَهُ فَلْيَقُلْ إِنِّي امْرُؤٌ صَائِم"
      },
      {
        "id": 30654,
        "hadith_number": "1960",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Bulan Ramadan: Syaitan Dibelenggu dan Pintu Syurga Dibuka",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: Apabila tiba malam pertama bulan Ramadan, syaitan-syaitan dan jin-jin yang derhaka dibelenggu, pintu-pintu neraka ditutup sehingga tidak ada satu pun yang dibuka, dan pintu-pintu syurga dibuka sehingga tidak ada satu pun yang ditutup. Seorang penyeru menyeru: Wahai pencari kebaikan, datanglah! Wahai pencari keburukan, berhentilah! Dan Allah memiliki orang-orang yang dibebaskan daripada api neraka, dan itu berlaku setiap malam. (Riwayat at-Tirmizi dan Ibnu Majah)",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا كَانَ أَوَّلُ لَيْلَةٍ مِنْ شَهْرِ رَمَضَانَ صُفِّدَتِ الشَّيَاطِينُ وَمَرَدَةُ الْجِنِّ وَغُلِّقَتْ أَبْوَابُ النَّارِ فَلم يفتح مِنْهَا بَاب الْجَنَّةِ فَلَمْ يُغْلَقْ مِنْهَا بَابٌ وَيُنَادِي مُنَادٍ: يَا بَاغِيَ الْخَيْرِ أَقْبِلْ وَيَا بَاغِيَ الشَّرِّ أقصر ن وَلِلَّهِ عُتَقَاءُ مِنَ النَّارِ وَذَلِكَ كُلَّ لَيْلَةٍ . رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه"
      },
      {
        "id": 30655,
        "hadith_number": "1961",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadith Sahih Berkaitan Perawi",
        "perawi_melayu": "Diriwayatkan oleh seorang lelaki (lelaki yang tidak dikenali)",
        "english_text": "The narrator is a man (unidentified)",
        "malay_translation": "Perawi adalah seorang lelaki (tidak dikenali)",
        "arabic_text": "وَرَوَاهُ أَحْمد عَن رجل وَقَالَ التِّرْمِذِيّ هَذَا حَدِيث غَرِيب"
      },
      {
        "id": 30656,
        "hadith_number": "1962",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keistimewaan Bulan Ramadhan",
        "perawi_melayu": "Daripada Abu Hurairah radhiyallahu 'anhu",
        "english_text": "Narrated Abu Hurairah: The Messenger of Allah (ﷺ) said: \"There has come to you the month of Ramadan, a blessed month. Allah has obligated you to fast during it. In it, the gates of the heavens are opened, the gates of Hell are closed, and the devils are chained. In it is a night that is better than a thousand months. Whoever is deprived of its good, then he has indeed been deprived.\" (Reported by Ahmad and An-Nasa'i)",
        "malay_translation": "Daripada Abu Hurairah radhiyallahu 'anhu berkata: Rasulullah ﷺ bersabda: \"Telah datang kepada kamu bulan Ramadhan, bulan yang penuh berkat. Allah telah mewajibkan ke atas kamu berpuasa di dalamnya. Dibuka pintu-pintu langit, ditutup pintu-pintu neraka, dan syaitan-syaitan dibelenggu. Di dalamnya ada satu malam yang lebih baik daripada seribu bulan. Sesiapa yang terhalang daripada kebaikannya, maka sesungguhnya dia telah terhalang.\" (Riwayat Ahmad dan An-Nasa'i)",
        "arabic_text": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَتَاكُمْ رَمَضَانُ شَهْرٌ مُبَارَكٌ فَرَضَ اللَّهُ عَلَيْكُمْ صِيَامَهُ تُفْتَحُ فِيهِ أَبْوَابُ السَّمَاءِ وَتُغْلَقُ فِيهِ أَبْوَابُ الْجَحِيمِ وَتُغَلُّ فِيهِ مَرَدَةُ الشَّيَاطِينِ لِلَّهِ فِيهِ لَيْلَةٌ خَيْرٌ مِنْ أَلْفِ شَهْرٍ مَنْ حُرِمَ خَيْرَهَا فَقَدْ حُرِمَ» . رَوَاهُ أَحْمَدُ وَالنَّسَائِيُّ"
      },
      {
        "id": 30657,
        "hadith_number": "1963",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Syafaat Puasa dan Al-Quran pada Hari Kiamat",
        "perawi_melayu": "Diriwayatkan daripada Abdullah bin 'Amr R.A.",
        "english_text": "وعن عبد الله بن عمرو: أن رسول الله صلى الله عليه وسلم قال: الصيام والقرآن يشفعان للعبد يقول الصيام: أي رب إني منعته الطعام والشهوات بالنهار فشفعني فيه ويقول القرآن: منعته النوم بالليل فشفعني فيه فيشفعان . رواه البيهقي في شعب الإيمان",
        "malay_translation": "Daripada Abdullah bin 'Amr R.A., bahawa Rasulullah SAW bersabda: “Puasa dan Al-Quran akan memberi syafaat kepada seorang hamba pada hari kiamat. Puasa berkata: 'Wahai Tuhanku, aku telah menghalangnya daripada makan dan syahwat di siang hari, maka terimalah syafaatku untuknya.' Dan Al-Quran berkata: 'Aku telah menghalangnya daripada tidur di malam hari, maka terimalah syafaatku untuknya.' Maka kedua-duanya (puasa dan Al-Quran) memberi syafaat.” Riwayat al-Baihaqi dalam Syu'ab al-Iman.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: الصِّيَامُ وَالْقُرْآنُ يَشْفَعَانِ لِلْعَبْدِ يَقُولُ الصِّيَامُ: أَيْ رَبِّ إِنِّي مَنَعْتُهُ الطَّعَامَ وَالشَّهَوَاتِ بِالنَّهَارِ فَشَفِّعْنِي فِيهِ وَيَقُولُ الْقُرْآنُ: مَنَعْتُهُ النُّوْمَ بِاللَّيْلِ فَشَفِّعْنِي فِيهِ فيشفعان . رَوَاهُ الْبَيْهَقِيّ فِي شعب الْإِيمَان"
      },
      {
        "id": 30658,
        "hadith_number": "1964",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Malam Lailatul Qadar di Bulan Ramadan",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "Not Available",
        "malay_translation": "Daripada Anas bin Malik RA, beliau berkata: Ramadan telah tiba, lalu Rasulullah SAW bersabda: \"Sesungguhnya bulan ini telah hadir kepada kamu, dan di dalamnya terdapat satu malam yang lebih baik daripada seribu bulan. Sesiapa yang diharamkan (kebaikan) daripadanya, maka sesungguhnya dia telah diharamkan seluruh kebaikan. Dan tidak diharamkan kebaikannya melainkan orang yang benar-benar diharamkan (daripada kebaikan).\" (Riwayat Ibnu Majah)",
        "arabic_text": "وَعَنْ أَنَسِ بْنِ مَالِكٍ قَالَ: دَخَلَ رَمَضَانُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ هَذَا الشَّهْرَ قَدْ حَضَرَكُمْ وَفِيهِ لَيْلَةٌ خَيْرٌ مَنْ أَلْفِ شَهْرٍ مَنْ حُرِمَهَا فَقَدْ حُرِمَ الْخَيْرَ كُلَّهُ وَلَا يُحْرَمُ خَيْرَهَا إِلَّا كل محروم» . رَوَاهُ ابْن مَاجَه"
      },
      {
        "id": 30659,
        "hadith_number": "1965",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Bulan Ramadan",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Salman, beliau berkata: Rasulullah SAW berkhutbah kepada kami pada hari terakhir bulan Sya'ban, lalu bersabda: \"Wahai manusia, sesungguhnya telah datang kepada kamu bulan yang agung dan penuh berkat, bulan yang di dalamnya terdapat malam yang lebih baik daripada seribu bulan. Allah SWT telah menjadikan puasa di bulan itu sebagai suatu fardhu dan menghidupkan malamnya sebagai suatu amalan sunat. Sesiapa yang mendekatkan diri kepada Allah dengan satu kebaikan di dalamnya, maka ia seolah-olah telah menunaikan satu fardhu di bulan yang lain. Dan sesiapa yang menunaikan satu fardhu di dalamnya, maka ia seolah-olah telah menunaikan tujuh puluh fardhu di bulan yang lain. Ia adalah bulan kesabaran, dan kesabaran ganjarannya adalah syurga. Ia juga bulan saling membantu, dan bulan yang rezeki orang mukmin ditambah di dalamnya. Sesiapa yang memberi makan orang yang berpuasa di dalamnya, maka ia akan mendapat keampunan dosa-dosanya dan dibebaskan dari api neraka, dan ia akan mendapat pahala seperti pahala orang yang berpuasa itu tanpa dikurangkan sedikit pun daripada pahalanya.\" Kami berkata: \"Wahai Rasulullah, tidak semua kami mempunyai sesuatu untuk memberi makan orang yang berpuasa.\" Rasulullah SAW bersabda: \"Allah memberikan pahala ini kepada sesiapa yang memberi makan orang yang berpuasa walaupun hanya dengan seteguk susu, sebiji kurma, atau seteguk air. Dan sesiapa yang mengenyangkan orang yang berpuasa, Allah akan memberinya minum dari telagaku dengan satu tegukan yang dia tidak akan dahaga lagi sehingga dia masuk syurga. Ia adalah bulan yang permulaannya rahmat, pertengahannya keampunan, dan akhirnya pembebasan dari api neraka. Dan sesiapa yang meringankan beban hambanya di dalamnya, Allah akan mengampuninya dan membebaskannya dari api neraka.\" (Riwayat al-Baihaqi)",
        "arabic_text": "وَعَن سلمَان قَالَ: خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي آخِرِ يَوْمٍ مِنْ شَعْبَانَ فَقَالَ: «يَا أَيُّهَا النَّاسُ قَدْ أَظَلَّكُمْ شَهْرٌ عَظِيمٌ مُبَارَكٌ شَهْرٌ فِيهِ لَيْلَةٌ خَيْرٌ مَنْ أَلْفِ شهر جعل الله تَعَالَى صِيَامَهُ فَرِيضَةً وَقِيَامَ لَيْلِهِ تَطَوُّعًا مَنْ تَقَرَّبَ فِيهِ بخصلة من الْخَيْرِ كَانَ كَمَنْ أَدَّى فَرِيضَةً فِيمَا سِوَاهُ وَمَنْ أَدَّى فَرِيضَةً فِيهِ كَانَ كَمَنْ أَدَّى سَبْعِينَ فَرِيضَةً فِيمَا سِوَاهُ وَهُوَ شَهْرُ الصَّبْرِ وَالصَّبْر ثَوَابه الْجنَّة وَشهر الْمُوَاسَاة وَشهر يزْدَاد فِيهِ رِزْقُ الْمُؤْمِنِ مَنْ فَطَّرَ فِيهِ صَائِمًا كَانَ لَهُ مَغْفِرَةً لِذُنُوبِهِ وَعِتْقَ رَقَبَتِهِ مِنَ النَّارِ وَكَانَ لَهُ مِثْلُ أَجْرِهِ مِنْ غَيْرِ أَنْ يَنْقُصَ مِنْ أَجْرِهِ شَيْءٌ» قُلْنَا: يَا رَسُولَ اللَّهِ لَيْسَ كلنا يجد مَا نُفَطِّرُ بِهِ الصَّائِمَ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يُعْطِي اللَّهُ هَذَا الثَّوَابَ مَنْ فَطَّرَ صَائِمًا عَلَى مَذْقَةِ لَبَنٍ أَوْ تَمْرَةٍ أَوْ شَرْبَةٍ مِنْ مَاءٍ وَمَنْ أَشْبَعَ صَائِمًا سَقَاهُ اللَّهُ مِنْ حَوْضِي شَرْبَةً لَا يَظْمَأُ حَتَّى يَدْخُلَ الْجَنَّةَ وَهُوَ شَهْرٌ أَوَّلُهُ رَحْمَةٌ وَأَوْسَطُهُ مَغْفِرَةٌ وَآخِرُهُ عِتْقٌ مِنَ النَّارِ وَمَنْ خَفَّفَ عَنْ مَمْلُوكِهِ فِيهِ غَفَرَ الله لَهُ وَأعْتقهُ من النَّار» . رَوَاهُ الْبَيْهَقِيّ"
      },
      {
        "id": 30660,
        "hadith_number": "1966",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kedermawanan Nabi Muhammad SAW di Bulan Ramadan",
        "perawi_melayu": "Diriwayatkan daripada Ibnu Abbas RA",
        "english_text": "And Ibn Abbas reported: The Messenger of Allah (peace and blessings be upon him) used to release every prisoner and give to every beggar when the month of Ramadan entered. Related by al-Bayhaqi",
        "malay_translation": "Diriwayatkan daripada Ibnu Abbas RA, beliau berkata: “Rasulullah SAW apabila masuk bulan Ramadan, baginda membebaskan setiap tawanan dan memberi kepada setiap peminta-minta.”  (Riwayat al-Baihaqi)",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ شَهْرُ رَمَضَانَ أَطْلَقَ كُلَّ أَسِيرٍ وَأَعْطَى كُلَّ سَائِلٍ. رَوَاهُ الْبَيْهَقِيّ"
      },
      {
        "id": 30661,
        "hadith_number": "1967",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Syurga Dihiasi untuk Ramadhan",
        "perawi_melayu": "Ibnu Umar (r.a.)",
        "english_text": "The Prophet (ﷺ) said: 'Verily, Paradise is adorned for Ramadan from the beginning of the year until the following year.' When the first day of Ramadan comes, a wind blows from beneath the Throne from the leaves of Paradise to the Houris, and they say: 'O Lord, make for us from Your servants, husbands, that our eyes may be comforted by them, and their eyes may be comforted by us.'",
        "malay_translation": "Rasulullah (ﷺ) bersabda: \"Sesungguhnya syurga dihiasi untuk Ramadhan dari awal tahun hingga tahun berikutnya.\" Apabila tiba hari pertama Ramadhan, berhembuslah angin dari bawah Arasy dari dedaunan syurga ke atas bidadari, lalu mereka berkata: \"Wahai Tuhan, jadikanlah untuk kami dari kalangan hamba-Mu, suami-suami, yang dapat menyenangkan hati kami, dan hati mereka juga senang dengan kami.\"",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الْجَنَّةَ تُزَخْرَفُ لِرَمَضَانَ مِنْ رَأْسِ الْحَوْلِ إِلَى حَوْلِ قَابِلٍ» . قَالَ: فَإِذَا كَانَ أَوَّلُ يَوْمٍ مِنْ رَمَضَانَ هَبَّتْ رِيحٌ تَحْتَ الْعَرْشِ مِنْ وَرَقِ الْجَنَّةِ عَلَى الْحُورِ الْعِينِ فَيَقُلْنَ: يَا رَبِّ اجْعَلْ لَنَا مِنْ عِبَادِكَ أَزْوَاجًا تَقَرَّ بِهِمْ أَعْيُنُنَا وَتَقَرَّ أَعْيُنُهُمْ بِنَا . رَوَى الْبَيْهَقِيُّ الْأَحَادِيثَ الثَّلَاثَةَ فِي شُعَبِ الْإِيمَانِ"
      },
      {
        "id": 30662,
        "hadith_number": "1968",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pengampunan di Akhir Malam Ramadan",
        "perawi_melayu": "Abu Hurairah (RA)",
        "english_text": "The Prophet (ﷺ) said: \"His (Ummah) is forgiven at the end of the night in Ramadan.\" He (the companions) said: \"O Messenger of Allah, is it the Night of Decree?\" He said: \"No, but the worker is only paid his wage when he has finished his work.\"",
        "malay_translation": "Sabda Nabi Muhammad ﷺ: \"Umatnya diampuni pada penghujung malam Ramadan.\" Sahabat bertanya: \"Wahai Rasulullah, adakah itu Lailatul Qadar?\" Baginda menjawab: \"Tidak, tetapi seorang pekerja hanya menerima upahnya apabila dia telah menyelesaikan pekerjaannya.\"",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «يُغْفَرُ لِأُمَّتِهِ فِي آخِرِ لَيْلَةٍ فِي رَمَضَانَ» . قِيلَ: يَا رَسُولَ اللَّهِ أَهِيَ لَيْلَةُ الْقَدْرِ؟ قَالَ: «لَا وَلَكِنَّ الْعَامِلَ إِنَّمَا يُوَفَّى أجره إِذا قضى عمله» . رَوَاهُ أَحْمد"
      },
      {
        "id": 30663,
        "hadith_number": "1969",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Arahan Berkenaan Puasa dan Melihat Anak Bulan",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Umar R.A berkata: Rasulullah SAW bersabda: “Janganlah kamu berpuasa sehingga kamu melihat anak bulan, dan janganlah kamu berbuka sehingga kamu melihatnya. Jika ia terlindung dari kamu, maka takdirkanlah ia.” Dalam riwayat lain, baginda bersabda: “Sebulan itu adalah dua puluh sembilan malam. Janganlah kamu berpuasa sehingga kamu melihatnya. Jika ia terlindung dari kamu, maka sempurnakanlah bilangan menjadi tiga puluh.”",
        "arabic_text": "عَنْ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَصُومُوا حَتَّى تَرَوُا الْهِلَالَ وَلَا تُفْطِرُوا حَتَّى تَرَوْهُ فَإِنْ غُمَّ عَلَيْكُمْ فَاقْدِرُوا لَهُ» . وَفِي رِوَايَةٍ قَالَ: «الشَّهْرُ تِسْعٌ وَعِشْرُونَ لَيْلَةً فَلَا تَصُومُوا حَتَّى تَرَوْهُ فَإِنْ غُمَّ عَلَيْكُمْ فَأَكْمِلُوا الْعِدَّةَ ثَلَاثِينَ»"
      },
      {
        "id": 30664,
        "hadith_number": "1970",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Puasa dan Berbuka Mengikut Ru'yah (Kelihatan Anak Bulan)",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA",
        "english_text": "Narrated by Abu Hurairah (may Allah be pleased with him): The Messenger of Allah (peace and blessings of Allah be upon him) said: \"Fast when you see it (the new moon) and break your fast when you see it. If it is obscured from you, then complete the number of days of Sha'ban as thirty.\"",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: \"Berpuasalah kamu apabila kamu melihatnya (anak bulan) dan berbukalah kamu apabila kamu melihatnya. Sekiranya ia terlindung daripada kamu, maka sempurnakanlah bilangan hari Sya'ban menjadi tiga puluh.\"",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «صُومُوا لِرُؤْيَتِهِ وَأَفْطِرُوا لِرُؤْيَتِهِ فَإِنْ غم عَلَيْكُم فَأَكْمِلُوا عِدَّةَ شَعْبَانَ ثَلَاثِينَ»"
      },
      {
        "id": 30665,
        "hadith_number": "1971",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Umat yang Ummi Tidak Menulis dan Tidak Menghitung",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Umar RA, beliau berkata: Rasulullah SAW bersabda: “Kita adalah umat yang ummi, tidak menulis dan tidak menghitung. Bulan itu adalah begini, begini, dan begini.” Baginda menggenggam ibu jari pada kali ketiga. Kemudian Baginda bersabda: “Bulan itu adalah begini, begini, dan begini.” Yakni sempurna tiga puluh hari, yakni sekali dua puluh sembilan hari dan sekali tiga puluh hari.",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَنَا أمة أُميَّة لَا تكْتب وَلَا تحسب الشَّهْرُ هَكَذَا وَهَكَذَا وَهَكَذَا» . وَعَقَدَ الْإِبْهَامَ فِي الثَّالِثَةِ. ثُمَّ قَالَ: «الشَّهْرُ هَكَذَا وَهَكَذَا وَهَكَذَا» . يَعْنِي تَمَامَ الثَّلَاثِينَ يَعْنِي مَرَّةً تِسْعًا وَعِشْرِينَ وَمرَّة ثَلَاثِينَ"
      },
      {
        "id": 30666,
        "hadith_number": "1972",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Bulan Ramadan dan Zulhijjah",
        "perawi_melayu": "Diriwayatkan daripada Abu Bakrah RA, bahawa Rasulullah SAW bersabda:",
        "english_text": "Narrated Abu Bakra: The Messenger of Allah (peace and blessings of Allah be upon him) said: \"The two months of Eid do not decrease: Ramadan and Dhu'l-Hijjah.\"",
        "malay_translation": "\"Dua bulan perayaan tidak berkurang: Ramadan dan Zulhijjah.\"",
        "arabic_text": "وَعَنْ أَبِي بَكْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: شَهْرَا عِيدٍ لَا يَنْقُصَانِ: رَمَضَانُ وَذُو الْحِجَّةِ"
      },
      {
        "id": 30667,
        "hadith_number": "1973",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mendahului Ramadhan dengan Berpuasa Satu atau Dua Hari, Kecuali Bagi yang Sudah Terbiasa Berpuasa",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA berkata: Rasulullah SAW bersabda:",
        "english_text": "Narrated Abu Hurairah (may Allah be pleased with him): The Messenger of Allah (peace and blessings of Allah be upon him) said: “None of you should precede Ramadhan by fasting a day or two, unless a man is accustomed to fasting; let him fast that day.”",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: “Janganlah seorang pun di antara kamu mendahului Ramadhan dengan berpuasa satu atau dua hari, kecuali seseorang yang sudah terbiasa berpuasa, maka hendaklah dia berpuasa pada hari itu.”",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَتَقَدَّمَنَّ أَحَدُكُمْ رَمَضَانَ بِصَوْمِ يَوْمٍ أَوْ يَوْمَيْنِ إِلَّا أَنْ يَكُونَ رَجُلٌ كَانَ يَصُوم صوما فليصم ذَلِك الْيَوْم»"
      },
      {
        "id": 30668,
        "hadith_number": "1974",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Berpuasa Selepas Pertengahan Syaaban",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "Narrated Abu Hurairah (RA): The Messenger of Allah (ﷺ) said, \"When Sha'ban is half over, do not fast.\" (Related by Abu Dawud, at-Tirmidhi, Ibn Majah, and ad-Darimi)",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah رضي الله عنه, beliau berkata: Rasulullah ﷺ bersabda, \"Apabila Syaaban telah berlalu separuh, maka janganlah kamu berpuasa.\" (Riwayat Abu Dawud, at-Tirmidzi, Ibnu Majah, dan ad-Darimi)",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا انْتَصَفَ شَعْبَانُ فَلَا تَصُومُوا» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ"
      },
      {
        "id": 30669,
        "hadith_number": "1975",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perintah Menghitung Hilal Sya'ban untuk Ramadan",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "Narrated Abu Hurairah: The Messenger of Allah (ﷺ) said: \"Count the crescent of Sha'ban for Ramadan.\" (Tirmidhi)",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah رضي الله عنه, beliau berkata: Rasulullah ﷺ bersabda: \"Hitunglah hilal Sya'ban untuk Ramadan.\" (Riwayat at-Tirmizi)",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أحصوا هِلَال شعْبَان لرمضان» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 30670,
        "hadith_number": "1976",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Puasa Nabi SAW dalam Bulan Sya'ban dan Ramadhan",
        "perawi_melayu": "Ummu Salamah (RA)",
        "english_text": "Narrated Umm Salamah (RA): I never saw the Prophet (ﷺ) fasting for two consecutive months except for Shaban and Ramadan. [Abu Dawud, Tirmidhi, Nasa'i, and Ibn Majah]",
        "malay_translation": "Diriwayatkan daripada Ummu Salamah (RA): Aku tidak pernah melihat Nabi (ﷺ) berpuasa selama dua bulan berturut-turut melainkan dalam bulan Sya'ban dan Ramadhan. [Riwayat Abu Dawud, Tirmidzi, Nasa'i, dan Ibnu Majah]",
        "arabic_text": "وَعَن أم سَلمَة قَالَتْ: مَا رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ شَهْرَيْنِ مُتَتَابِعَيْنِ إِلَّا شَعْبَانَ وَرَمَضَانَ. رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ"
      },
      {
        "id": 30671,
        "hadith_number": "1977",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Berpuasa Pada Hari Syak (Ragu)",
        "perawi_melayu": "Ammaar bin Yaasir رضي الله عنه",
        "english_text": "The text of this Hadith is in Arabic.",
        "malay_translation": "Daripada Ammaar bin Yaasir رضي الله عنه, beliau berkata: \"Barangsiapa yang berpuasa pada hari yang diragui (iaitu hari yang tidak pasti sama ada sudah masuk bulan Ramadhan atau belum), maka sesungguhnya dia telah menderhakai Abu al-Qaasim صلى الله عليه وسلم\". (Riwayat Abu Dawud, At-Tirmidzi, An-Nasa'i, Ibnu Majah dan Ad-Darimi)",
        "arabic_text": "وَعَنْ عَمَّارِ بْنِ يَاسِرٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: «مَنْ صَامَ الْيَوْمَ الَّذِي يُشَكُّ فِيهِ فَقَدَ عَصَى أَبَا الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ والدارمي"
      },
      {
        "id": 30672,
        "hadith_number": "1978",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pengisytiharan Awal Ramadan Berdasarkan Kesaksian",
        "perawi_melayu": "Ibnu Abbas",
        "english_text": "Hadith narration provided in Arabic.",
        "malay_translation": "Daripada Ibnu Abbas RA, beliau berkata: Seorang Arab Badwi datang kepada Nabi SAW lalu berkata: \"Sesungguhnya aku telah melihat anak bulan (iaitu anak bulan Ramadan).\" Nabi SAW bertanya: \"Adakah kamu bersaksi bahawa tiada Tuhan selain Allah?\" Jawabnya: \"Ya.\" Nabi SAW bertanya: \"Adakah kamu bersaksi bahawa Muhammad itu Rasulullah?\" Jawabnya: \"Ya.\" Nabi SAW bersabda: \"Wahai Bilal, serulah kepada manusia agar mereka berpuasa esok hari.\" (Riwayat Abu Daud, At-Tirmizi, An-Nasa'i, Ibnu Majah dan Ad-Darimi)",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: إِنِّي رَأَيْتُ الْهِلَالَ يَعْنِي هِلَالَ رَمَضَانَ فَقَالَ: «أَتَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ؟» قَالَ: نَعَمْ قَالَ: «أَتَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ؟» قَالَ: نَعَمْ. قَالَ: «يَا بِلَالُ أَذِّنْ فِي النَّاسِ أَن يَصُومُوا غَدا» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ والدارمي"
      },
      {
        "id": 30673,
        "hadith_number": "1979",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penglihatan Hilal dan Arahan Berpuasa",
        "perawi_melayu": "Diriwayatkan daripada Ibn Umar RA",
        "english_text": "Narrated Ibn Umar: The people were looking for the new moon, and I informed the Messenger of Allah (ﷺ) that I had seen it, so he fasted and commanded the people to fast.",
        "malay_translation": "Diriwayatkan daripada Ibn Umar RA: Orang ramai sedang mencari anak bulan (hilal). Aku memberitahu Rasulullah SAW bahawa aku telah melihatnya. Baginda lalu berpuasa dan memerintahkan orang ramai untuk berpuasa.",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ قَالَ: تَرَاءَى النَّاسُ الْهِلَالَ فَأَخْبَرْتُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي رَأَيْتُهُ فَصَامَ وَأَمَرَ النَّاسَ بِصِيَامِهِ. رَوَاهُ أَبُو دَاوُد والدارمي"
      },
      {
        "id": 30674,
        "hadith_number": "1980",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Bulan Sya'ban dan Cara Rasulullah SAW Berpuasa",
        "perawi_melayu": "Diriwayatkan daripada Aisyah RA",
        "english_text": "Narrated by Aisha RA: The Messenger of Allah (peace and blessings of Allah be upon him) was more observant in observing the month of Sha'ban than in observing other months. Then he would fast when Ramadan was sighted; but if it was cloudy, he would count thirty days and then fast. Related by Abu Dawood.",
        "malay_translation": "Diriwayatkan daripada Aisyah RA: Rasulullah SAW sangat menjaga (memerhatikan) bulan Sya'ban lebih daripada bulan-bulan lain. Kemudian baginda berpuasa apabila melihat anak bulan Ramadhan; tetapi jika keadaan mendung, baginda akan mengira tiga puluh hari kemudian berpuasa. (Riwayat Abu Daud).",
        "arabic_text": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَحَفَّظُ مِنْ شَعْبَانَ مَالَا يَتَحَفَّظُ مِنْ غَيْرِهِ. ثُمَّ يَصُومُ لِرُؤْيَةِ رَمَضَانَ فَإِنْ غُمَّ عَلَيْهِ عَدَّ ثَلَاثِينَ يَوْمًا ثُمَّ صَامَ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 30675,
        "hadith_number": "1981",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penentuan Anak Bulan (Hilal) dan Kesaksian Ibnu Abbas",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abul Bakhtari, beliau berkata: Kami keluar untuk umrah. Ketika kami tiba di Batnu Nakhlah, kami melihat anak bulan. Sebahagian orang berkata: “Ia anak bulan tiga hari.” Sebahagian yang lain berkata: “Ia anak bulan dua malam.” Kemudian kami bertemu Ibnu Abbas dan kami berkata: “Kami telah melihat anak bulan.” Sebahagian orang berkata: “Ia anak bulan tiga hari,” dan sebahagian yang lain berkata: “Ia anak bulan dua malam.” Ibnu Abbas bertanya: “Pada malam apa kamu melihatnya?” Kami menjawab: “Pada malam itu dan itu.” Ibnu Abbas berkata: “Sesungguhnya Rasulullah SAW melanjutkan (tempoh) untuk melihatnya, maka ia (sah) untuk malam kamu melihatnya.” Dalam riwayat lain daripadanya, beliau berkata: “Kami melihat anak bulan Ramadhan ketika kami berada di Zat ‘Irq. Kami menghantar seorang lelaki kepada Ibnu Abbas untuk bertanya kepadanya. Ibnu Abbas berkata: Rasulullah SAW bersabda: ‘Sesungguhnya Allah Ta’ala telah melanjutkan (tempoh) untuk penglihatannya. Jika ia tersembunyi daripada kamu, maka sempurnakanlah bilangan (hari).’” (Riwayat Muslim)",
        "arabic_text": "وَعَنْ أَبِي الْبَخْتَرِيِّ قَالَ: خَرَجْنَا لِلْعُمْرَةِ فَلَمَّا نَزَلْنَا بِبَطْنِ نَخْلَةَ تَرَاءَيْنَا الْهِلَالَ. فَقَالَ بَعْضُ الْقَوْمِ: هُوَ ابْنُ ثَلَاثٍ. وَقَالَ بَعْضُ الْقَوْمِ: هُوَ ابْنُ لَيْلَتَيْنِ فَلَقِينَا ابْنَ عَبَّاسٍ فَقُلْنَا: إِنَّا رَأَيْنَا الْهِلَالَ فَقَالَ بَعْضُ الْقَوْمِ: هُوَ ابْنُ ثَلَاثٍ وَقَالَ بَعْضُ الْقَوْمِ: هُوَ ابْنُ لَيْلَتَيْنِ. فَقَالَ: أَيُّ لَيْلَةٍ رَأَيْتُمُوهُ؟ قُلْنَا: لَيْلَةَ كَذَا وَكَذَا. فَقَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَدَّهُ لِلرُّؤْيَةِ فَهُوَ لِلَيْلَةِ رَأَيْتُمُوهُ وَفِي رِوَايَةٍ عَنْهُ. قَالَ: أَهَلَلْنَا رَمَضَانَ وَنَحْنُ بِذَاتِ عِرْقٍ فَأَرْسَلْنَا رَجُلًا إِلَى ابْنِ عَبَّاسٍ يَسْأَلُهُ فَقَالَ ابْنُ عَبَّاسٍ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِن الله تَعَالَى قد أَمَدَّهُ لِرُؤْيَتِهِ فَإِنْ أُغْمِيَ عَلَيْكُمْ فَأَكْمِلُوا الْعِدَّةَ» . رَوَاهُ مُسلم"
      },
      {
        "id": 30676,
        "hadith_number": "1982",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keberkatan dalam Bersahur",
        "perawi_melayu": "Diriwayatkan daripada Anas RA, bahawa Rasulullah SAW bersabda:",
        "english_text": "Narrated Anas: The Messenger of Allah (peace and blessings of Allah be upon him) said: 'Take Suhoor as there is blessing in it.'",
        "malay_translation": "Diriwayatkan daripada Anas RA, bahawa Rasulullah SAW bersabda: 'Bersahurlah kamu, kerana sesungguhnya pada sahur itu ada keberkatan.'",
        "arabic_text": "عَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَسَحَّرُوا فَإِنَّ فِي السَّحُورِ بركَة»"
      },
      {
        "id": 30677,
        "hadith_number": "1983",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perbezaan Puasa Kita dengan Ahli Kitab",
        "perawi_melayu": "Diriwayatkan daripada 'Amr bin al-'As, beliau berkata: Rasulullah SAW bersabda:",
        "english_text": "Not Available",
        "malay_translation": "Diriwayatkan daripada 'Amr bin al-'As, beliau berkata: Rasulullah SAW bersabda: \"Perbezaan antara puasa kita dengan puasa Ahli Kitab adalah makan sahur.\" Riwayat Muslim.",
        "arabic_text": "وَعَنْ عَمْرِو بْنِ الْعَاصِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «فَصْلُ مَا بَيْنَ صِيَامِنَا وَصِيَامِ أَهْلِ الْكِتَابِ أَكْلَةُ السَّحَرِ» . رَوَاهُ مُسلم"
      },
      {
        "id": 30678,
        "hadith_number": "1984",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Menyegerakan Berbuka Puasa",
        "perawi_melayu": "Diriwayatkan daripada Sahl RA",
        "english_text": "Narrated Sahl: The Messenger of Allah (peace and blessings of Allah be upon him) said: \"People will continue to be in good condition so long as they hasten the breaking of the fast.\"",
        "malay_translation": "Diriwayatkan daripada Sahl RA, Rasulullah SAW bersabda: \"Umat manusia akan sentiasa berada dalam kebaikan selagi mereka menyegerakan berbuka puasa.\"",
        "arabic_text": "وَعَنْ سَهْلٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَزَالُ النَّاسُ بِخَيْرٍ مَا عَجَّلُوا الْفِطْرَ»"
      },
      {
        "id": 30679,
        "hadith_number": "1985",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Waktu Berbuka Puasa",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Umar RA, beliau berkata: Rasulullah SAW bersabda: \"Apabila malam menjelma dari sini, dan siang menghilang dari sini, dan matahari terbenam, maka sungguh orang yang berpuasa telah berbuka.\"",
        "arabic_text": "وَعَنْ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَقْبَلَ اللَّيْل من هَهُنَا وَأدبر النَّهَار من هَهُنَا وَغَرَبَتِ الشَّمْسُ فَقَدْ أَفْطَرَ الصَّائِمُ»"
      },
      {
        "id": 30680,
        "hadith_number": "1986",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Berpuasa Wishal (Berterusan Tanpa Berbuka)",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah RA berkata: Rasulullah SAW melarang daripada berpuasa wishal (berterusan tanpa berbuka). Seorang lelaki bertanya kepada baginda: Sesungguhnya engkau berpuasa wishal wahai Rasulullah SAW? Baginda bersabda: Siapakah antara kamu yang seperti aku? Sesungguhnya aku bermalam dalam keadaan Tuhanku memberi makan dan minum kepadaku.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْوِصَالِ فِي الصَّوْمِ. فَقَالَ لَهُ رجل: إِنَّك تواصل يَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: وَأَيُّكُمْ مِثْلِي إِنِّي أَبَيْتُ يُطْعِمُنِي رَبِّي ويسقيني"
      },
      {
        "id": 30681,
        "hadith_number": "1987",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Niat Puasa Sebelum Fajar",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Hafsah RA, beliau berkata: Rasulullah SAW bersabda: \"Sesiapa yang tidak berniat puasa sebelum fajar, maka tidak sah puasanya.\" Riwayat Tirmidzi, Abu Daud, Nasai, dan Darimi. Abu Daud berkata: Ma'mar, Zubaidi, Ibnu Uyainah, dan Yunus al-Aili semuanya meriwayatkan dari az-Zuhri bahawa ia mauquf kepada Hafsah.",
        "arabic_text": "عَن حَفْصَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ لَمْ يَجْمَعِ الصِّيَامَ قَبْلَ الْفَجْرِ فَلَا صِيَامَ لَهُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَالدَّارِمَيُّ وَقَالَ أَبُو دَاوُد: وَقفه على حَفْصَة معمر والزبيدي وَابْنُ عُيَيْنَةَ وَيُونُسُ الَأَيْلِيُّ كُلُّهُمْ عَنِ الزُّهْرِيِّ"
      },
      {
        "id": 30682,
        "hadith_number": "1988",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Jangan Letak Bekas Sebelum Selesai Keperluan Setelah Mendengar Azan",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "Narrated Abu Hurairah: The Prophet (ﷺ) said: “When one of you hears the call to prayer and the vessel is in his hand, he should not put it down until he has satisfied his need from it.”",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah رضي الله عنه, berkata: Rasulullah ﷺ bersabda: “Apabila seseorang daripada kamu mendengar azan dan bekas masih berada di tangannya, maka janganlah dia meletakkannya sehingga dia menyelesaikan keperluannya daripadanya.”",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا سَمِعَ النِّدَاءَ أَحَدُكُمْ وَالْإِنَاءُ فِي يَدِهِ فَلَا يَضَعْهُ حَتَّى يَقْضِيَ حَاجَتَهُ مِنْهُ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 30683,
        "hadith_number": "1989",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Allah Mencintai Hamba yang Cepat Berbuka Puasa",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "Allah said: \"The most beloved of My servants to Me are those who hasten to break their fast.\"",
        "malay_translation": "Allah berfirman: \"Hamba-Ku yang paling Aku cintai adalah mereka yang menyegerakan berbuka puasa.\"",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: قَالَ اللَّهُ تَعَالَى: أَحَبُّ عِبَادِي إِلَيَّ أَعْجَلُهُمْ فطرا . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 30684,
        "hadith_number": "1990",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Disunatkan Berbuka Puasa dengan Kurma atau Air",
        "perawi_melayu": "Salman bin 'Amir (رَضِيَ اللَّهُ عَنْهُ)",
        "english_text": "Narrated by Salman bin 'Amir, the Messenger of Allah (ﷺ) said: 'When one of you breaks his fast, let him break it with dates, for they are blessed. If he does not find dates, then with water, for it is purifying.' [Reported by Ahmad, At-Tirmidhi, Abu Dawud, Ibn Majah, and Ad-Darimi]. Only At-Tirmidhi mentioned: 'For they are blessed.'",
        "malay_translation": "Daripada Salman bin 'Amir (رَضِيَ اللَّهُ عَنْهُ), Rasulullah (ﷺ) bersabda: “Apabila salah seorang daripada kamu berbuka puasa, hendaklah dia berbuka dengan kurma, kerana ia berkat. Jika dia tidak mendapati kurma, maka (berbukalah) dengan air, kerana ia suci.” [Riwayat Ahmad, At-Tirmizi, Abu Daud, Ibnu Majah, dan Ad-Darimi]. Hanya At-Tirmizi yang menyebut: “Kerana ia berkat.”",
        "arabic_text": "وَعَنْ سَلْمَانَ بْنِ عَامِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَفْطَرَ أَحَدُكُمْ فَلْيُفْطِرْ عَلَى تَمْرٍ فَإِنَّهُ بَرَكَةٌ فَإِنْ لَمْ يَجِدْ فَلْيُفْطِرْ عَلَى مَاءٍ فَإِنَّهُ طَهُورٌ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ. وَلَمْ يَذْكُرْ: «فَإِنَّهُ بَرَكَةٌ» غَيْرُ التِّرْمِذِيِّ"
      },
      {
        "id": 30685,
        "hadith_number": "1991",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi ﷺ Berbuka Puasa dengan Kurma atau Air Sebelum Solat",
        "perawi_melayu": "Anas رضي الله عنه",
        "english_text": "Narrated Anas: The Prophet (ﷺ) used to break his fast before praying with some fresh dates; if fresh dates were not available, then with some dry dates; if dry dates were not available, he used to take some mouthfuls of water.",
        "malay_translation": "Diriwayatkan daripada Anas رضي الله عنه: Adalah Nabi ﷺ berbuka puasa sebelum solat dengan beberapa biji tamar segar; jika tamar segar tidak ada, maka dengan beberapa biji tamar kering; jika tamar kering tidak ada, Baginda ﷺ mengambil beberapa teguk air.",
        "arabic_text": "وَعَنْ أَنَسٍ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُفْطِرُ قَبْلَ أَنْ يُصَلِّيَ عَلَى رطبات فَإِن لم تكن فتميرات فإنلم تكن تُمَيْرَات حسى حَسَوَاتٍ مِنْ مَاءٍ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ. وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ غَرِيب"
      },
      {
        "id": 30686,
        "hadith_number": "1992",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ganjaran Memberi Makan Orang Berpuasa dan Membekali Pejuang",
        "perawi_melayu": "Zaid bin Khalid (رَضِيَ اللَّهُ عَنْهُ)",
        "english_text": "N/A",
        "malay_translation": "Daripada Zaid bin Khalid (رَضِيَ اللَّهُ عَنْهُ) berkata: Rasulullah ﷺ bersabda: \"Sesiapa yang memberi makan kepada orang yang berpuasa atau membekali pejuang, maka baginya ganjaran seperti pahala orang tersebut.\" Diriwayatkan oleh al-Baihaqi dalam Syu'ab al-Iman dan Muhyi al-Sunnah dalam Syarh al-Sunnah, dan beliau berkata sahih.",
        "arabic_text": "وَعَنْ زَيْدِ بْنِ خَالِدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «من فَطَّرَ صَائِمًا أَوْ جَهَّزَ غَازِيًا فَلَهُ مِثْلُ أَجْرِهِ» . رَوَاهُ الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ وَمُحْيِي السّنة فِي شرح السّنة وَقَالَ صَحِيح"
      },
      {
        "id": 30687,
        "hadith_number": "1993",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Doa Ketika Berbuka Puasa",
        "perawi_melayu": "Diriwayatkan dari Ibnu Umar RA, bahawa Nabi SAW apabila berbuka puasa, Baginda bersabda:",
        "english_text": "Narrated Ibn Umar: When the Prophet (ﷺ) broke his fast, he would say: \"The thirst has gone, the veins are moistened and the reward is confirmed, if Allah wills.\"",
        "malay_translation": "\"Dahaganya telah hilang, urat-urat telah basah, dan pahala telah ditetapkan, InsyaAllah.\"",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَفْطَرَ قَالَ: «ذَهَبَ الظَّمَأُ وَابْتَلَّتِ الْعُرُوقُ وَثَبَتَ الْأَجْرُ إِنْ شَاءَ الله» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 30688,
        "hadith_number": "1994",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Doa Ketika Berbuka Puasa",
        "perawi_melayu": "Mu'az bin Zuhrah",
        "english_text": "وعن معاذ بن زهرة قال: إن النبي صلى الله عليه وسلم كان إذا أفطر قال: «اللهم لك صمت وعلى رزقك أفطرت» . رواه أبو داود مرسلا",
        "malay_translation": "Daripada Mu'az bin Zuhrah RA berkata: Sesungguhnya Nabi SAW apabila berbuka puasa, baginda membaca: “Ya Allah, keranaMu aku berpuasa dan dengan rezekiMu aku berbuka.”  Riwayat Abu Daud secara mursal.",
        "arabic_text": "وَعَنْ مُعَاذٍ بْنِ زُهْرَةَ قَالَ: إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَفْطَرَ قَالَ: «اللَّهُمَّ لَكَ صَمْتُ وَعَلَى رِزْقِكَ أَفْطَرْتُ» . رَوَاهُ أَبُو دَاوُد مُرْسلا"
      },
      {
        "id": 30689,
        "hadith_number": "1995",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Menyegerakan Berbuka Puasa",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA",
        "english_text": "Not Available",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah RA berkata: Rasulullah SAW bersabda: \"Agama ini akan sentiasa zahir selagi mana manusia menyegerakan berbuka puasa, kerana sesungguhnya Yahudi dan Nasrani melambatkannya.\" Riwayat Abu Daud dan Ibnu Majah.",
        "arabic_text": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَزَالُ الدِّينُ ظَاهِرًا مَا عَجَّلَ النَّاسُ الْفِطْرَ لِأَنَّ الْيَهُودَ وَالنَّصَارَى يُؤَخِّرُونَ» . رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه"
      },
      {
        "id": 30690,
        "hadith_number": "1996",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menyegerakan Berbuka Puasa dan Solat",
        "perawi_melayu": "Tidak tersedia",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Atiyyah, beliau berkata: Saya dan Masruq masuk menemui Aisyah, lalu kami berkata: Wahai Ummul Mukminin, dua orang lelaki daripada sahabat Muhammad SAW, salah seorang daripada mereka menyegerakan berbuka puasa dan menyegerakan solat, dan yang seorang lagi melambatkan berbuka puasa dan melambatkan solat. Aisyah bertanya: Siapakah antara mereka yang menyegerakan berbuka puasa dan menyegerakan solat? Kami menjawab: Abdullah bin Mas'ud. Aisyah berkata: Beginilah yang dilakukan oleh Rasulullah SAW. Dan yang seorang lagi adalah Abu Musa. (Riwayat Muslim)",
        "arabic_text": "وَعَنْ أَبِي عَطِيَّةَ قَالَ: دَخَلْتُ أَنَا وَمَسْرُوقٌ عَلَى عَائِشَةَ فَقُلْنَا: يَا أُمَّ الْمُؤْمِنِينَ رَجُلَانِ مِنْ أَصْحَابِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَدُهُمَا يُعَجِّلُ الْإِفْطَارَ وَيُعَجِّلُ الصَّلَاةَ وَالْآخَرُ: يُؤَخِّرُ الْإِفْطَارَ وَيُؤَخِّرُ الصَّلَاةَ. قَالَتْ: أَيُّهُمَا يُعَجِّلُ الْإِفْطَارَ وَيُعَجِّلُ الصَّلَاةَ؟ قُلْنَا عَبْدُ اللَّهِ بْنُ مَسْعُودٍ. قَالَتْ: هَكَذَا صَنَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْآخَرُ أَبُو مُوسَى. رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 30691,
        "hadith_number": "1997",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Mengajak Sahur di Bulan Ramadan",
        "perawi_melayu": "Al-Irbad bin Sariyah",
        "english_text": "Narrated by Al-Irbad bin Sariyah: The Messenger of Allah (peace be upon him) invited me for the Suhoor in Ramadan and said, \"Come to the blessed meal.\" (Abu Dawud & An-Nasai)",
        "malay_translation": "Diriwayatkan daripada Al-Irbad bin Sariyah: Rasulullah SAW mengajakku untuk bersahur di bulan Ramadan dan bersabda, “Marilah ke hidangan yang diberkati.” (Riwayat Abu Dawud & An-Nasai)",
        "arabic_text": "وَعَنِ الْعِرْبَاضِ بْنِ سَارِيَةَ قَالَ: دَعَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى السَّحُورِ فِي رَمَضَانَ فَقَالَ: «هَلُمَّ إِلَى الْغَدَاءِ الْمُبَارَكِ» . رَوَاهُ أَبُو دَاوُد والسنائي"
      },
      {
        "id": 30692,
        "hadith_number": "1998",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kurma: Sebaik-baik Sahur bagi Seorang Mukmin",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA, katanya: Rasulullah SAW bersabda: \"Sebaik-baik makanan sahur bagi seorang mukmin adalah kurma.\"",
        "english_text": "Abu Hurairah (RA) reported: The Messenger of Allah (peace and blessings of Allah be upon him) said, \"The best sahur (pre-dawn meal in Ramadan) for a believer is dates.\"",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah RA, katanya: Rasulullah SAW bersabda: \"Sebaik-baik makanan sahur bagi seorang mukmin adalah kurma.\"",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نِعْمَ سَحُورُ الْمُؤْمِنَ التَّمْرُ» . رَوَاهُ أَبُو دَاوُدَ"
      },
      {
        "id": 30693,
        "hadith_number": "1999",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pentingnya Menjauhi Perkataan dan Perbuatan Dusta Semasa Berpuasa",
        "perawi_melayu": "Abu Hurairah RA",
        "english_text": "Narrated Abu Hurairah: The Messenger of Allah (ﷺ) said: \"Whoever does not give up forged speech and evil actions, Allah is not in need of his giving up his food and drink.\" (Bukhari)",
        "malay_translation": "Daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: \"Sesiapa yang tidak meninggalkan perkataan dusta dan perbuatan jahat, maka Allah tidak berhajat kepada dia meninggalkan makanan dan minumannya.\" (Riwayat al-Bukhari)",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ لَمْ يَدَعْ قَوْلَ الزُّورِ وَالْعَمَلَ بِهِ فَلَيْسَ لِلَّهِ حَاجَةٌ فِي أَنْ يَدَعَ طَعَامَهُ وَشَرَابه» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 30694,
        "hadith_number": "2000",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah S.A.W. Mencium dan Menyentuh Isterinya Ketika Berpuasa",
        "perawi_melayu": "Aisyah R.A.",
        "english_text": "Aisyah R.A. berkata: Rasulullah SAW mencium dan menyentuh isterinya ketika berpuasa, dan baginda adalah orang yang paling mampu mengawal nafsunya di antara kamu.",
        "malay_translation": "Daripada Aisyah R.A., beliau berkata: Rasulullah S.A.W. pernah mencium dan menyentuh (isterinya) ketika sedang berpuasa, dan baginda adalah orang yang paling mampu mengawal syahwatnya di antara kamu.",
        "arabic_text": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَبِّلُ وَيُبَاشِرُ وَهُوَ صَائِمٌ وَكَانَ أَمْلَكَكُمْ لأربه"
      },
      {
        "id": 30695,
        "hadith_number": "2001",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Berpuasa dalam Keadaan Junub di Bulan Ramadhan",
        "perawi_melayu": "Aisyah RA",
        "english_text": "Narrated Aishah (RA): The Messenger of Allah (ﷺ) would be overtaken by Fajr in Ramadan while he was junub from other than a dream, so he would take a bath and fast.",
        "malay_translation": "Daripada Aisyah RA berkata: Rasulullah SAW pernah mendapati waktu fajar di bulan Ramadhan dalam keadaan junub bukan kerana mimpi, kemudian baginda mandi dan berpuasa.",
        "arabic_text": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُدْرِكُهُ الْفَجْرُ فِي رَمَضَانَ وَهُوَ جُنُبٌ مِنْ غَيْرِ حُلْمٍ فَيَغْتَسِلُ وَيَصُومُ"
      },
      {
        "id": 30696,
        "hadith_number": "2002",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi Muhammad S.A.W. Berbekam Semasa Ihram dan Berpuasa",
        "perawi_melayu": "Ibnu Abbas",
        "english_text": "Ibn Abbas reported that the Prophet (peace and blessings be upon him) was cupped while in ihram and he was cupped while fasting.",
        "malay_translation": "Daripada Ibnu Abbas RA, beliau berkata: Sesungguhnya Nabi SAW berbekam ketika sedang berihram dan berbekam ketika sedang berpuasa.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ وَهُوَ مُحْرِمٌ وَاحْتَجَمَ وَهُوَ صَائِمٌ"
      },
      {
        "id": 30697,
        "hadith_number": "2003",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Sesiapa Yang Terlupa Makan Atau Minum Ketika Berpuasa",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah R.A.",
        "english_text": "Narrated by Abu Hurairah R.A.: The Messenger of Allah (peace and blessings of Allah be upon him) said: 'Whoever forgets while he is fasting and eats or drinks, let him complete his fast, for it was Allah who fed him and gave him to drink.'",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah R.A., beliau berkata: Rasulullah SAW bersabda: “Sesiapa yang terlupa ketika sedang berpuasa lalu dia makan atau minum, maka hendaklah dia menyempurnakan puasanya, kerana sesungguhnya Allah yang memberinya makan dan minum itu.”",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «من نسي وَهُوَ صَائِم فأل أَوْ شَرِبَ فَلْيُتِمَّ صَوْمَهُ فَإِنَّمَا أَطْعَمَهُ اللَّهُ وسقاه»"
      },
      {
        "id": 30698,
        "hadith_number": "2004",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kafarah bagi Hubungan Intim ketika Berpuasa",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah RA berkata: Ketika kami sedang duduk bersama Nabi SAW, tiba-tiba datang seorang lelaki kepada baginda dan berkata: “Wahai Rasulullah, aku telah binasa!” Baginda bertanya: “Apakah masalahmu?” Dia menjawab: “Aku telah melakukan hubungan intim dengan isteriku ketika aku sedang berpuasa.” Rasulullah SAW bersabda: “Adakah kamu mampu memerdekakan seorang hamba?” Dia menjawab: “Tidak.” Baginda bertanya: “Adakah kamu mampu berpuasa dua bulan berturut-turut?” Dia menjawab: “Tidak.” Baginda bertanya: “Adakah kamu mampu memberi makan enam puluh orang miskin?” Dia menjawab: “Tidak.” Baginda bersabda: “Duduklah.” Nabi SAW menunggu, dan ketika kami sedang dalam keadaan demikian, Nabi SAW didatangi dengan satu bekas besar berisi tamar (kurma). Baginda bertanya: “Di mana orang yang bertanya tadi?” Dia menjawab: “Saya.” Baginda bersabda: “Ambillah ini dan bersedekahlah dengannya.” Lelaki itu berkata: “Adakah kepada orang yang lebih fakir daripadaku, wahai Rasulullah? Demi Allah, tidak ada di antara dua Labah (kawasan berbatu hitam) - yang dia maksudkan dua Harrah (kawasan berbatu) - sebuah keluarga yang lebih fakir daripada keluargaku.” Nabi SAW tertawa sehingga kelihatan gigi gerahamnya, kemudian bersabda: “Berilah makan kepada keluargamu.”",
        "arabic_text": "وَعَن أبي هُرَيْرَة قَالَ: بَيْنَمَا نَحْنُ جُلُوسٌ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ جَاءَهُ رَجُلٌ فَقَالَ: يَا رَسُول الله هَلَكت. قَالَ: «مَالك؟» قَالَ: وَقَعْتُ عَلَى امْرَأَتِي وَأَنَا صَائِمٌ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَلْ تَجِدُ رَقَبَةً تُعْتِقُهَا؟» . قَالَ: لَا قَالَ: «فَهَلْ تَسْتَطِيعُ أَنْ تَصُومَ شَهْرَيْنِ مُتَتَابِعَيْنِ؟» قَالَ: لَا. قَالَ: «هَلْ تَجِدُ إِطْعَامَ سِتِّينَ مِسْكِينًا؟» قَالَ: لَا. قَالَ: «اجْلِسْ» وَمَكَثَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسلم فَبينا نَحْنُ عَلَى ذَلِكَ أُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرَقٍ فِيهِ تَمْرٌ وَالْعَرَقُ الْمِكْتَلُ الضَّخْمُ قَالَ: «أَيْنَ السَّائِلُ؟» قَالَ: أَنَا. قَالَ: «خُذْ هَذَا فَتَصَدَّقْ بِهِ» . فَقَالَ الرَّجُلُ: أَعَلَى أَفْقَرَ مِنِّي يَا رَسُولَ اللَّهِ؟ فَوَاللَّهِ مَا بَيْنَ لَابَتَيْهَا يُرِيدُ الْحَرَّتَيْنِ أَهْلُ بَيْتِ أَفْقَرُ م أَهْلِ بَيْتِي. فَضَحِكَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى بَدَتْ أَنْيَابُهُ ثُمَّ قَالَ: «أَطْعِمْهُ أهلك»"
      },
      {
        "id": 30699,
        "hadith_number": "2005",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Mencium dan Menghisap Lidah Isterinya Ketika Berpuasa",
        "perawi_melayu": "Diriwayatkan dari Aisyah R.A.",
        "english_text": "Narrated from Aisyah: That the Prophet (peace and blessings of Allah be upon him) used to kiss her while he was fasting and suck her tongue. Narrated by Abu Dawood.",
        "malay_translation": "Diriwayatkan daripada Aisyah R.A.: Bahawa Nabi SAW pernah menciumnya ketika baginda sedang berpuasa dan menghisap lidahnya. Riwayat Abu Daud.",
        "arabic_text": "عَن عَائِشَة: أَن الني صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: كَانَ يُقَبِّلُهَا وَهُوَ صَائِم ويمص لسنانها. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 30700,
        "hadith_number": "2006",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Bersentuhan Bagi Orang Berpuasa",
        "perawi_melayu": "Abu Hurairah (RA)",
        "english_text": "A man asked the Prophet (peace and blessings of Allah be upon him) about touching a woman while fasting, so he gave him permission. Another man came and asked him, so he forbade him. The one to whom he gave permission was an old man, and the one he forbade was a young man. Narrated by Abu Dawud.",
        "malay_translation": "Daripada Abu Hurairah (RA), sesungguhnya seorang lelaki bertanya kepada Nabi SAW tentang bersentuhan bagi orang yang berpuasa, lalu Baginda memberi keringanan kepadanya. Kemudian datang seorang lagi dan bertanya kepada Baginda, lalu Baginda melarangnya. Orang yang diberi keringanan itu adalah seorang lelaki tua, manakala orang yang dilarang itu adalah seorang lelaki muda. Riwayat Abu Dawud.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ إِنَّ رَجُلًا سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُبَاشَرَةِ لِلصَّائِمِ فَرخص لَهُ. وَأَتَاهُ آخَرُ فَسَأَلَهُ فَنَهَاهُ فَإِذَا الَّذِي رَخَّصَ لَهُ شَيْخٌ وَإِذَا الَّذِي نَهَاهُ شَابٌّ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 30701,
        "hadith_number": "2007",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Muntah Ketika Berpuasa",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah R.A.",
        "english_text": "Dari Abu Hurairah R.A., beliau berkata: Rasulullah S.A.W bersabda: 'Sesiapa yang tidak sengaja muntah ketika berpuasa, maka tidak wajib baginya untuk menggantikan puasanya (qada). Sesiapa yang sengaja muntah, maka wajib baginya untuk menggantikan puasanya.'  Riwayat Tirmidzi, Abu Daud, Ibnu Majah, dan Darimi. Tirmidzi berkata: Hadis ini adalah hadis gharib, kami tidak mengetahuinya kecuali dari hadis Isa bin Yunus. Muhammad (yakni Bukhari) berkata: Saya tidak melihatnya sebagai hadis yang terpelihara.",
        "malay_translation": "Daripada Abu Hurairah R.A., beliau berkata: Rasulullah S.A.W. bersabda: 'Sesiapa yang tidak sengaja muntah ketika berpuasa, maka tidak wajib baginya untuk menggantikan puasanya (qada). Dan sesiapa yang sengaja muntah, maka wajib baginya untuk menggantikan puasanya.'  Riwayat Tirmidzi, Abu Daud, Ibnu Majah, dan Darimi. Tirmidzi berkata: Hadis ini adalah hadis gharib, kami tidak mengetahuinya kecuali dari hadis Isa bin Yunus. Muhammad (yakni Bukhari) berkata: Saya tidak melihatnya sebagai hadis yang terpelihara.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم: «من ذرعه الْقَيْء وَهُوَ صَائِمٌ فَلَيْسَ عَلَيْهِ قَضَاءٌ وَمَنِ اسْتَقَاءَ عَمْدًا فَلْيَقْضِ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ. وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ عِيسَى بْنِ يُونُس. وَقَالَ مُحَمَّد يَعْنِي البُخَارِيّ لَا أرَاهُ مَحْفُوظًا"
      },
      {
        "id": 30702,
        "hadith_number": "2008",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Muntah dan Membatalkan Puasa",
        "perawi_melayu": "Ma'dan bin Talhah meriwayatkan bahawa Abu Darda' menceritakan kepadanya bahawa Rasulullah SAW telah muntah lalu berbuka puasa. Beliau berkata: Saya bertemu dengan Thauban di masjid Damsyik lalu saya berkata: Sesungguhnya Abu Darda' telah menceritakan kepadaku bahawa Rasulullah SAW telah muntah lalu berbuka puasa. Beliau berkata: Benar, dan saya yang menuangkan air wudhuk untuk baginda.",
        "english_text": "وعن معدان بن طلحة أن أبا الدرداء حدثه أن رسول الله صلى الله عليه وسلم قاء فأفطر. قال: فلقيت ثوبان في مسجد دمشق فقلت: إن أبا الدرداء حدثني أن رسول الله صلى الله عليه وسلم قاء فأفطر. قال: صدق وأنا صببت له وضوءه. رواه أبو داود والترمذي والدارمي",
        "malay_translation": "Daripada Ma'dan bin Talhah, bahawa Abu Darda' meriwayatkan kepadanya bahawa Rasulullah SAW telah muntah lalu baginda berbuka puasa. Ma'dan berkata: Aku bertemu dengan Thauban di masjid Damsyik, lalu aku berkata: Sesungguhnya Abu Darda' telah meriwayatkan kepadaku bahawa Rasulullah SAW telah muntah lalu baginda berbuka puasa. Thauban berkata: Benar, dan aku yang menuangkan air wudhuk untuk baginda.  (Riwayat Abu Daud, Tirmizi dan Darimi)",
        "arabic_text": "وَعَنْ مَعْدَانَ بْنِ طَلْحَةَ أَنَّ أَبَا الدَّرْدَاءِ حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَاءَ فَأَفْطَرَ. قَالَ: فَلَقِيتُ ثَوْبَانَ فِي مَسْجِدِ دِمَشْقَ فَقُلْتُ: إِنَّ أَبَا الدَّرْدَاءِ حَدَّثَنِي أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَاءَ فَأَفْطَرَ. قَالَ: صَدَقَ وَأَنَا صَبَبْتُ لَهُ وضوءه. رَوَاهُ أَبُو دَاوُد وَالتِّرْمِذِيّ والدارمي"
      },
      {
        "id": 30703,
        "hadith_number": "2009",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Bersugi (Menggosok Gigi) Ketika Berpuasa",
        "perawi_melayu": "Diriwayatkan daripada Amir bin Rabi'ah, beliau berkata: Aku telah melihat Nabi SAW berkali-kali bersugi (menggosok gigi) sedangkan baginda sedang berpuasa.",
        "english_text": "Concerning ‘Amir bin Rabi’ah, he said: I saw the Prophet, may Allah bless him and grant him peace, countless times using the siwak while fasting. Related by al-Tirmidhi and Abu Dawud.",
        "malay_translation": "Diriwayatkan daripada Amir bin Rabi'ah RA, beliau berkata: “Aku telah melihat Nabi SAW (Sallallahu Alaihi Wasallam) tidak terhitung banyaknya kali bersugi (menggosok gigi) sedangkan baginda sedang berpuasa.” (Riwayat Tirmizi dan Abu Daud)",
        "arabic_text": "وَعَنْ عَامِرِ بْنِ رَبِيعَةَ قَالَ: رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا لَا أُحْصِي يَتَسَوَّكُ وَهُوَ صَائِمٌ . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ"
      },
      {
        "id": 30704,
        "hadith_number": "2010",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Bercelak Mata Ketika Berpuasa",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Anas RA, beliau berkata: Seorang lelaki datang kepada Nabi SAW dan berkata: \"Saya sakit mata, bolehkah saya bercelak sedangkan saya berpuasa?\" Baginda bersabda: \"Ya.\" (Riwayat Tirmidzi) Beliau berkata: Sanadnya tidak kuat, dan Abu Atikah, perawi hadis ini, dianggap lemah.",
        "arabic_text": "وَعَنْ أَنَسٍ قَالَ: جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: اشتكيت عَيْني أَفَأَكْتَحِلُ وَأَنَا صَائِمٌ؟ قَالَ: «نَعَمْ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: لَيْسَ إِسْنَادُهُ بِالْقَوِيِّ وَأَبُو عَاتِكَةَ الرَّاوِي يضعف"
      },
      {
        "id": 30705,
        "hadith_number": "2011",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi Muhammad SAW Menyiram Air ke Kepala Ketika Berpuasa",
        "perawi_melayu": "Daripada Beberapa Sahabat Nabi SAW",
        "english_text": "Narrated from some of the companions of the Prophet (peace and blessings of Allah be upon him): I saw the Prophet (peace and blessings of Allah be upon him) at al-'Arj pouring water over his head while he was fasting, due to thirst or heat. Related by Malik.",
        "malay_translation": "Diriwayatkan daripada beberapa orang sahabat Nabi SAW, katanya: Sesungguhnya aku melihat Nabi SAW di Al-'Arj sedang menuangkan air ke atas kepalanya dalam keadaan baginda berpuasa, disebabkan dahaga atau kepanasan. Diriwayatkan oleh Malik.",
        "arabic_text": "وَعَنْ بَعْضِ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَقَدْ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْعَرْجِ يَصُبُّ عَلَى رَأْسِهِ الْمَاءَ وَهُوَ صَائِمٌ مِنَ الْعَطَشِ أَوْ مِنَ الْحَرِّ. رَوَاهُ مَالك"
      },
      {
        "id": 30706,
        "hadith_number": "2012",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Berbekam (Hijama) semasa Berpuasa",
        "perawi_melayu": "Shaddad bin Aus",
        "english_text": "Not Available",
        "malay_translation": "Daripada Shaddad bin Aus: Bahawa Rasulullah SAW mendatangi seorang lelaki di Baqi' yang sedang berbekam, dan baginda SAW memegang tanganku pada lapan belas hari yang lalu dari bulan Ramadan, lalu bersabda: \"Telah berbuka orang yang membekam dan orang yang dibekam.\" Diriwayatkan oleh Abu Daud, Ibnu Majah dan Darimi. Sheikh Imam Muhiyyi as-Sunnah rahimahullah berkata: Sebahagian orang yang memberi keringanan dalam berbekam mentafsirkannya: Iaitu terdedah kepada berbuka: orang yang dibekam kerana lemah dan orang yang membekam kerana dia tidak aman daripada sampai sesuatu ke rongganya kerana menghisap pelazim (alat).",
        "arabic_text": "وَعَنْ شَدَّادِ بْنِ أَوْسٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى رَجُلًا بِالْبَقِيعِ وَهُوَ يَحْتَجِمُ وَهُوَ آخِذٌ بِيَدِي لِثَمَانِيَ عَشْرَةَ خَلَتْ مِنْ رَمَضَانَ فَقَالَ: «أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ» . رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ. قَالَ الشَّيْخُ الْإِمَامُ مُحْيِي السُّنَّةِ رَحِمَهُ اللَّهُ عَلَيْهِ: وَتَأَوَّلَهُ بَعْضُ مَنْ رَخَّصَ فِي الْحِجَامَةِ: أَيْ تَعَرُّضًا لِلْإِفْطَارِ: الْمَحْجُومُ لِلضَّعْفِ وَالْحَاجِمُ لِأَنَّهُ لَا يَأْمَنُ مِنْ أَنْ يَصِلَ شَيْءٌ إِلَى جَوْفِهِ بمص الملازم"
      },
      {
        "id": 30707,
        "hadith_number": "2013",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kefardhuan Menggantikan Puasa Ramadan yang Ditinggalkan",
        "perawi_melayu": "Diriwayatkan dari Abu Hurairah RA",
        "english_text": "Dari Abu Hurairah RA berkata: Rasulullah SAW bersabda: 'Barangsiapa yang berbuka pada satu hari di bulan Ramadan tanpa keringanan (rukhsah) atau sakit, maka tidak akan dapat diganti dengan puasa sepanjang masa, walaupun dia berpuasa'. Riwayat Ahmad, Tirmidzi, Abu Daud, Ibnu Majah, Darimi, dan Bukhari dalam terjemahan bab. Tirmidzi berkata: Saya mendengar Muhammad (yaitu Bukhari) berkata. Abu al-Tus perawi, saya tidak tahu hadits lain selain ini.",
        "malay_translation": "Daripada Abu Hurairah RA berkata: Rasulullah SAW bersabda: 'Sesiapa yang berbuka pada satu hari di bulan Ramadan tanpa sebarang keringanan (rukhsah) yang dibenarkan syarak dan bukan disebabkan sakit, maka dia tidak akan dapat menggantikannya walaupun dengan berpuasa sepanjang hayat.' Riwayat Ahmad, Tirmidzi, Abu Daud, Ibnu Majah, Darimi, dan Bukhari dalam terjemahan bab. Tirmidzi berkata: Saya mendengar Muhammad (iaitu Bukhari) berkata. Abu al-Tus sebagai perawi, saya tidak mengetahui hadis lain daripadanya selain daripada hadis ini.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَفْطَرَ يَوْمًا مِنْ رَمَضَانَ مِنْ غَيْرِ رُخْصَةٍ وَلَا مَرَضٍ لَمْ يَقْضِ عَنْهُ صَوْمُ الدَّهْرِ كُلِّهِ وَإِنْ صَامَهُ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ وَالْبُخَارِيُّ فِي تَرْجَمَةِ بَابٍ وَقَالَ التِّرْمِذِيُّ: سَمِعْتُ مُحَمَّدًا يَعْنِي البُخَارِيّ يَقُول. أَبُو الطوس الرَّاوِي لَا أَعْرِفُ لَهُ غَيْرَ هَذَا الْحَدِيثِ"
      },
      {
        "id": 30708,
        "hadith_number": "2014",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Berapa Ramai Orang Berpuasa Tidak Mendapat Apa-apa Kecuali Dahaga dan Berapa Ramai Orang Solat Malam Tidak Mendapat Apa-apa Kecuali berjaga Malam",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: \"Berapa ramai orang yang berpuasa tidak mendapat apa-apa daripada puasanya kecuali dahaga, dan berapa ramai orang yang bangun (solat malam) tidak mendapat apa-apa daripada bangunnya kecuali berjaga malam.\" Riwayat ad-Darimi.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كَمْ مِنْ صَائِمٍ لَيْسَ لَهُ مِنْ صِيَامِهِ إِلَّا الظَّمَأُ وَكَمْ مِنْ قَائِمٍ لَيْسَ لَهُ من قِيَامه إِلَّا السهر» . رَوَاهُ الدَّارمِيّ"
      },
      {
        "id": 30709,
        "hadith_number": "2015",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tiga Perkara yang Tidak Membatalkan Puasa",
        "perawi_melayu": "Diriwayatkan daripada Abu Sa'id",
        "english_text": "Dari Abu Sa'id, dia berkata: Rasulullah SAW bersabda: \"Tiga perkara yang tidak membatalkan puasa: berbekam, muntah dan ihtilam (mimpi basah).\" Diriwayatkan oleh Tirmidzi dan dia berkata: Hadis ini tidak terpelihara dan Abdurrahman bin Zaid perawi hadis ini dianggap lemah.",
        "malay_translation": "Diriwayatkan daripada Abu Sa'id, beliau berkata: Rasulullah SAW bersabda: \"Tiga perkara tidak membatalkan puasa: berbekam, muntah, dan ihtilam (mimpi basah).\"  Diriwayatkan oleh Tirmidzi dan beliau berkata: Hadis ini *ghairu mahfuzh* (tidak terpelihara) dan Abdurrahman bin Zaid, perawi hadis ini, dianggap lemah dalam hadis.",
        "arabic_text": "عَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «ثَلَاثٌ لَا يُفْطِرْنَ الصَّائِمَ الْحِجَامَةُ وَالْقَيْءُ وَالِاحْتِلَامُ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَيْرُ مَحْفُوظٍ وَعَبْدُ الرَّحْمَنِ بْنُ زيد الرَّاوِي يضعف فِي الحَدِيث"
      },
      {
        "id": 30710,
        "hadith_number": "2016",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Berbekam bagi Orang yang Berpuasa",
        "perawi_melayu": "Diriwayatkan daripada Thabit al-Bunani, beliau berkata: Anas bin Malik ditanya: Adakah kamu membenci berbekam bagi orang yang berpuasa pada zaman Rasulullah SAW? Beliau menjawab: Tidak, kecuali kerana kelemahan (yang disebabkan olehnya).",
        "english_text": "Narrated from Thabit al-Bunani, he said: Anas bin Malik was asked: Did you dislike cupping for the fasting person at the time of the Messenger of Allah, peace and blessings be upon him? He said: No, except because of weakness (caused by it). Reported by Bukhari.",
        "malay_translation": "Diriwayatkan daripada Thabit al-Bunani, beliau berkata: Anas bin Malik ditanya: Adakah kamu membenci berbekam bagi orang yang berpuasa pada zaman Rasulullah SAW? Beliau menjawab: Tidak, kecuali kerana kelemahan (yang disebabkan olehnya). Diriwayatkan oleh Bukhari.",
        "arabic_text": "وَعَنْ ثَابِتٍ الْبُنَانِيِّ قَالَ: سُئِلَ أَنَسُ بْنُ مَالِكٍ: كُنْتُمْ تَكْرَهُونَ الْحِجَامَةَ لِلصَّائِمِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: لَا إِلَّا مِنْ أَجْلِ الضَّعْفِ. رَوَاهُ الْبُخَارِيُّ"
      },
      {
        "id": 30711,
        "hadith_number": "2017",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ibnu Umar Berbekam Ketika Berpuasa dan Kemudian Meninggalkannya",
        "perawi_melayu": "Al-Bukhari meriwayatkan secara ta'liq (mu'allaq): Ibnu Umar berbekam ketika berpuasa, kemudian beliau meninggalkannya dan berbekam pada waktu malam.",
        "english_text": "وعن البخاري تعليقا قال: كان ابن عمر يحتجم وهو صائم ثم تركه فكان يحتجم بالليل",
        "malay_translation": "Diriwayatkan dari Al-Bukhari secara ta'liq (mu'allaq), beliau berkata: Ibnu Umar pernah berbekam ketika beliau berpuasa, kemudian beliau meninggalkannya dan beliau berbekam pada waktu malam.",
        "arabic_text": "وَعَنِ الْبُخَارِيِّ تَعْلِيقًا قَالَ: كَانَ ابْنُ عُمَرَ يَحْتَجِمُ وَهُوَ صَائِمٌ ثُمَّ تَرَكَهُ فَكَانَ يَحْتَجِمُ بِاللَّيْلِ"
      },
      {
        "id": 30712,
        "hadith_number": "2018",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Berkumur dan Menelan Air Liur Semasa Berpuasa",
        "perawi_melayu": "Diriwayatkan daripada 'Ata': \"Sesungguhnya jika seseorang berkumur kemudian membuang air dari mulutnya, tidak mengapa jika dia menelan air liurnya atau apa yang tertinggal di dalam mulutnya. Dan janganlah dia mengunyah gam. Jika dia menelan air liur gam, aku tidak mengatakan ia membatalkan puasa, tetapi dia dilarang daripadanya.\" Riwayat al-Bukhari dalam terjemahan bab.",
        "english_text": "وعن عَطاء قَالَ: إِن مضمض ثُمَّ أَفْرَغَ مَا فِي فِيهِ مِنَ الْمَاءِ لَا يضيره أَنْ يَزْدَرِدَ رِيقَهُ وَمَا بَقِيَ فِي فِيهِ وَلَا يَمْضُغُ الْعِلْكَ فَإِنِ ازْدَرَدَ رِيقَ الْعِلْكَ لَا أَقُولُ: إِنَّهُ يُفْطِرُ وَلَكِنْ يُنْهَى عَنْهُ. رَوَاهُ الْبُخَارِيُّ فِي تَرْجَمَةِ بَابٍ",
        "malay_translation": "Diriwayatkan daripada 'Ata': \"Sesungguhnya jika seseorang berkumur kemudian membuang air dari mulutnya, tidak mengapa jika dia menelan air liurnya atau apa yang tertinggal di dalam mulutnya. Dan janganlah dia mengunyah gam. Jika dia menelan air liur gam, aku tidak mengatakan ia membatalkan puasa, tetapi dia dilarang daripadanya.\" Riwayat al-Bukhari dalam terjemahan bab.",
        "arabic_text": "وَعَن عَطاء قَالَ: إِن مضمض ثُمَّ أَفْرَغَ مَا فِي فِيهِ مِنَ الْمَاءِ لَا يضيره أَنْ يَزْدَرِدَ رِيقَهُ وَمَا بَقِيَ فِي فِيهِ وَلَا يَمْضُغُ الْعِلْكَ فَإِنِ ازْدَرَدَ رِيقَ الْعِلْكَ لَا أَقُولُ: إِنَّهُ يُفْطِرُ وَلَكِنْ يُنْهَى عَنْهُ. رَوَاهُ الْبُخَارِيُّ فِي تَرْجَمَةِ بَابٍ"
      },
      {
        "id": 30713,
        "hadith_number": "2019",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pilihan Berpuasa atau Tidak Ketika Musafir",
        "perawi_melayu": "Diriwayatkan daripada Aisyah R.A.",
        "english_text": "Aisyah (RA) reported: Hamza bin 'Amr al-Aslami said to the Prophet (PBUH): 'Should I observe fasting while travelling?' He used to observe fasting very often. The Prophet (PBUH) said: 'If you wish, observe fasting, and if you wish, do not observe fasting.'",
        "malay_translation": "Daripada Aisyah R.A., beliau berkata: Sesungguhnya Hamzah bin 'Amr al-Aslami bertanya kepada Nabi SAW: 'Adakah aku patut berpuasa ketika bermusafir?' Beliau sering berpuasa. Maka Nabi SAW bersabda: 'Jika kamu mahu, berpuasalah, dan jika kamu mahu, janganlah berpuasa.'",
        "arabic_text": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: إِنَّ حَمْزَةَ بْنَ عَمْرٍو الْأَسْلَمِيَّ قَالَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصُومُ فِي السَّفَرِ وَكَانَ كَثِيرَ الصِّيَامِ. فَقَالَ: «إِنْ شِئْتَ فَصم وَإِن شِئْت فَأفْطر»"
      },
      {
        "id": 30714,
        "hadith_number": "2020",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tidak Mencela Orang yang Berpuasa atau Berbuka dalam Peperangan",
        "perawi_melayu": "Abu Sa'id al-Khudri",
        "english_text": "The Prophet (ﷺ) was in a battle. Some of them fasted and some broke their fast. Those who fasted did not criticize those who broke their fast, and those who broke their fast did not criticize those who fasted. ",
        "malay_translation": "Daripada Abu Sa'id al-Khudri, katanya: Kami berperang bersama Rasulullah SAW pada enam belas hari yang telah berlalu dari bulan Ramadan. Di antara kami ada yang berpuasa dan ada yang berbuka. Maka, orang yang berpuasa tidak mencela orang yang berbuka, dan orang yang berbuka tidak mencela orang yang berpuasa.",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: غَزَوْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَسِتَّ عَشْرَةَ مَضَتْ مِنْ شَهْرِ رَمَضَانَ فَمِنَّا مَنْ صَامَ وَمِنَّا مَنْ أَفْطَرَ فَلَمْ يَعِبِ الصَّائِمُ عَلَى الْمُفْطِرِ وَلَا الْمُفْطِرُ عَلَى الصَّائِمِ. رَوَاهُ مُسلم"
      },
      {
        "id": 30715,
        "hadith_number": "2021",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Puasa Ketika Musafir: Bukanlah Suatu Kebajikan Jika Memberatkan",
        "perawi_melayu": "Diriwayatkan dari Jabir RA",
        "english_text": " وعن جابر قال: كان رسول الله صلى الله عليه وسلم في سفر فرأى زحاما ورجلا قد ظلل عليه فقال: «ما هذا؟» قالوا: صائم. فقال: «ليس من البر الصوم في السفر»",
        "malay_translation": "Dari Jabir RA, beliau berkata: Rasulullah SAW berada dalam musafir, lalu baginda melihat orang ramai berkerumun dan seorang lelaki yang diteduhkan. Baginda bertanya: \"Apa ini?\" Mereka menjawab: \"Orang yang berpuasa.\" Maka baginda bersabda: \"Bukanlah suatu kebajikan berpuasa dalam musafir (jika memberatkan).\"",
        "arabic_text": "وَعَنْ جَابِرٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَرَأَى زِحَامًا وَرَجُلًا قَدْ ظُلِّلَ عَلَيْهِ فَقَالَ: «مَا هَذَا؟» قَالُوا: صَائِمٌ. فَقَالَ: «لَيْسَ مِنَ الْبِرِّ الصَّوْمُ فِي السَّفَرِ»"
      },
      {
        "id": 30716,
        "hadith_number": "2022",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ganjaran Bagi Mereka yang Tidak Berpuasa Ketika Musafir Apabila Keperluan Timbul",
        "perawi_melayu": "Diriwayatkan daripada Anas RA:",
        "english_text": "Narrated Anas: We were with the Prophet (peace and blessings of Allah be upon him) on a journey, some of us were fasting and some of us were not. We stopped at a place on a hot day, and the fasting people collapsed, while those who were not fasting got up and set up the tents and watered the animals. The Messenger of Allah (peace and blessings of Allah be upon him) said: 'Those who did not fast have taken away the reward today.'",
        "malay_translation": "Diriwayatkan daripada Anas RA: Kami bersama Nabi SAW dalam suatu perjalanan, sebahagian kami berpuasa dan sebahagian lagi tidak. Kami berhenti di suatu tempat pada hari yang panas terik, lalu orang-orang yang berpuasa rebah (kerana kepenatan), manakala orang-orang yang tidak berpuasa bangun mendirikan khemah dan memberi minum kepada haiwan tunggangan. Rasulullah SAW bersabda: 'Orang-orang yang tidak berpuasa telah meraih pahala pada hari ini.'",
        "arabic_text": "وَعَنْ أَنَسٍ قَالَ: كُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي السَّفَرِ فَمِنَّا الصَّائِمُ وَمِنَّا الْمُفْطِرُ فَنَزَلْنَا مَنْزِلًا فِي وم حَارٍّ فَسَقَطَ الصَّوَّامُونَ وَقَامَ الْمُفْطِرُونَ فَضَرَبُوا الْأَبْنِيَةَ وَسَقَوُا الرِّكَابَ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «ذَهَبَ الْمُفْطِرُونَ الْيَوْمَ بِالْأَجْرِ»"
      },
      {
        "id": 30717,
        "hadith_number": "2023",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Berpuasa dan Berbuka Puasa dalam Perjalanan ke Mekah pada Bulan Ramadhan",
        "perawi_melayu": "Diriwayatkan dari Ibnu Abbas RA",
        "english_text": "Narrated Ibn Abbas: The Messenger of Allah (peace and blessings of Allah be upon him) went out from Madinah to Makkah and fasted until he reached 'Usfan. Then he called for water and raised it to his hand so that the people could see him, and he broke his fast until he arrived in Makkah, and that was in Ramadan. Ibn Abbas used to say: The Messenger of Allah (peace and blessings of Allah be upon him) fasted and broke his fast. So whoever wishes, let him fast, and whoever wishes, let him break his fast.",
        "malay_translation": "Diriwayatkan dari Ibnu Abbas RA: Rasulullah SAW keluar dari Madinah menuju Mekah dan berpuasa sehingga tiba di 'Usfan. Kemudian baginda meminta air dan mengangkatnya ke tangannya agar orang ramai dapat melihatnya, lalu baginda berbuka puasa sehingga tiba di Mekah, dan peristiwa itu berlaku pada bulan Ramadhan. Ibnu Abbas RA berkata: Rasulullah SAW pernah berpuasa dan berbuka puasa. Maka sesiapa yang ingin berpuasa, silakan, dan sesiapa yang ingin berbuka, silakan.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ الْمَدِينَةِ إِلَى مَكَّةَ فَصَامَ حَتَّى بَلَغَ عُسْفَانَ ثُمَّ دَعَا بِمَاءٍ فَرَفَعَهُ إِلَى يَدِهِ لِيَرَاهُ النَّاسُ فَأَفْطَرَ حَتَّى قَدِمَ مَكَّةَ وَذَلِكَ فِي رَمَضَانَ. فَكَانَ ابْنُ عَبَّاسٍ يَقُولُ: قَدْ صَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَفْطَرَ. فَمن شَاءَ صَامَ وَمن شَاءَ أفطر"
      },
      {
        "id": 30718,
        "hadith_number": "2024",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Jabir Minum Selepas Waktu Asar",
        "perawi_melayu": "Tiada perawi dinyatakan (Rujuk kepada riwayat Muslim)",
        "english_text": "No English Text Available",
        "malay_translation": "Dalam riwayat Muslim daripada Jabir رَضِيَ اللَّهُ عَنْهُ, sesungguhnya beliau minum selepas waktu Asar.",
        "arabic_text": "وَفِي رِوَايَة لمُسلم عَن جَابر رَضِي الله عَنهُ أَنه شرب بعد الْعَصْر"
      },
      {
        "id": 30719,
        "hadith_number": "2025",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keringanan Solat dan Puasa Bagi Musafir, Wanita Menyusu, dan Hamil",
        "perawi_melayu": "Anas bin Malik Al-Ka'bi",
        "english_text": " ",
        "malay_translation": "Daripada Anas bin Malik Al-Ka'bi berkata: Rasulullah SAW bersabda: \"Sesungguhnya Allah telah menggugurkan daripada musafir (separuh daripada) solat dan puasa daripada musafir, wanita yang menyusui dan wanita hamil.\" (Riwayat Abu Daud, At-Tirmizi, An-Nasai dan Ibnu Majah)",
        "arabic_text": "عَنْ أَنَسِ بْنِ مَالِكٍ الْكَعْبِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِن اللَّهَ وَضَعَ عَنِ الْمُسَافِرِ شَطْرَ الصَّلَاةِ وَالصَّوْمَ عَنِ الْمُسَافِرِ وَعَنِ الْمُرْضِعِ وَالْحُبْلَى» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ"
      },
      {
        "id": 30720,
        "hadith_number": "2026",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kewajipan Berpuasa Ramadan Bagi yang Mampu",
        "perawi_melayu": "Diriwayatkan daripada Salamah bin al-Muhabbak, Rasulullah SAW bersabda:",
        "english_text": "Not Available",
        "malay_translation": "\"Sesiapa yang mempunyai bekalan makanan yang mencukupi untuk dirinya dan keluarganya, maka hendaklah dia berpuasa Ramadan di mana sahaja dia berada.\"",
        "catatan": "Hadis riwayat Abu Daud.",
        "arabic_text": "وَعَنْ سَلَمَةَ بْنِ الْمُحَبَّقِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَانَ لَهُ حَمُولَةٌ تَأْوِي إِلَى شِبْعٍ فَلْيَصُمْ رَمَضَانَ من حَيْثُ أدْركهُ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 30721,
        "hadith_number": "2027",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah Berbuka Puasa dalam Perjalanan di Bulan Ramadan dan Teguran Terhadap yang Masih Berpuasa",
        "perawi_melayu": "Diriwayatkan dari Jabir RA:",
        "english_text": "Narrated Jabir: The Messenger of Allah (peace and blessings of Allah be upon him) went out in the year of the Conquest to Mecca in Ramadan and fasted until he reached Kura' al-Ghamim. The people fasted, then he called for a cup of water and raised it until the people looked at it, then he drank. After that it was said to him that some people had fasted. He said: 'Those are the disobedient ones, those are the disobedient ones.' Reported by Muslim.",
        "malay_translation": "Diriwayatkan daripada Jabir RA: Sesungguhnya Rasulullah SAW keluar pada tahun pembukaan Kota Mekah pada bulan Ramadan. Baginda berpuasa sehingga tiba di Kura' al-Ghamim. Orang ramai turut berpuasa. Kemudian, Baginda meminta secawan air lalu mengangkatnya tinggi sehingga dilihat oleh orang ramai, kemudian Baginda meminumnya. Setelah itu, dikatakan kepada Baginda bahawa sebahagian orang masih berpuasa. Baginda bersabda: 'Mereka itulah orang-orang yang derhaka, mereka itulah orang-orang yang derhaka.' (Riwayat Muslim)",
        "arabic_text": "عَنْ جَابِرٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ عَامَ الْفَتْحِ إِلَى مَكَّةَ فِي رَمَضَانَ فَصَامَ حَتَّى بَلَغَ كُرَاعَ الْغَمِيمِ فَصَامَ النَّاسُ ثُمَّ دَعَا بِقَدَحٍ مِنْ مَاءٍ فَرَفَعَهُ حَتَّى نَظَرَ النَّاسُ إِلَيْهِ ثُمَّ شَرِبَ فَقِيلَ لَهُ بَعْدَ ذَلِكَ إِنَّ بَعْضَ النَّاسِ قَدْ صَامَ. فَقَالَ: «أُولَئِكَ الْعُصَاةُ أُولَئِكَ الْعُصَاةُ» . رَوَاهُ مُسلم"
      },
      {
        "id": 30722,
        "hadith_number": "2028",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Puasa Ramadan dalam Musafir Sama Seperti Berbuka di Rumah",
        "perawi_melayu": "Abd al-Rahman bin Auf",
        "english_text": "The Prophet (ﷺ) said: \"The fasting person in Ramadan while traveling is like the one who breaks his fast when at home.\"",
        "malay_translation": "Rasulullah ﷺ bersabda: \"Orang yang berpuasa di bulan Ramadan semasa bermusafir adalah seperti orang yang berbuka puasa semasa berada di rumah.\"",
        "arabic_text": "وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «صَائِمُ رَمَضَانَ فِي السَّفَرِ كَالْمُفْطِرِ فِي الْحَضَرِ» . رَوَاهُ ابْن مَاجَه"
      },
      {
        "id": 30723,
        "hadith_number": "2029",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keringanan Berpuasa dalam Musafir",
        "perawi_melayu": "Hamzah bin Amru As-Salami",
        "english_text": "Not Available",
        "malay_translation": "Daripada Hamzah bin Amru As-Salami RA, beliau berkata: “Wahai Rasulullah, sesungguhnya aku dapati diriku kuat untuk berpuasa dalam musafir, adakah berdosa jika aku berbuat demikian?” Baginda SAW bersabda: “Itu adalah keringanan (rukhsah) daripada Allah ‘Azza wa Jalla. Sesiapa yang mengambilnya, maka itu adalah baik. Dan sesiapa yang suka untuk berpuasa, maka tidak ada dosa baginya.” (Riwayat Muslim)",
        "arabic_text": "وَعَن حَمْزَة بن عَمْرو السّلمِيّ أَنَّهُ قَالَ: يَا رَسُولَ اللَّهِ إِنِّي أَجِدُ بِي قُوَّةً عَلَى الصِّيَامِ فِي السَّفَرِ فَهَلْ عَلَيَّ جُنَاحٌ؟ قَالَ: «هِيَ رُخْصَةٌ مِنَ اللَّهِ عَزَّ وَجَلَّ فَمَنْ أَخَذَ بِهَا فَحَسَنٌ وَمَنْ أَحَبَّ أَنْ يَصُومَ فَلَا جُنَاحَ عَلَيْهِ» . رَوَاهُ مُسلم"
      },
      {
        "id": 30724,
        "hadith_number": "2030",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mengqadha Puasa Ramadan di Bulan Sya'ban",
        "perawi_melayu": "Aisyah RA",
        "english_text": "Narrated from Aishah who said: I would have fasting to make up from Ramadan, and I would not be able to do so until Sha'ban. Yahya bin Sa'eed said: Meaning the work from the Prophet, or with the Prophet, peace and blessings be upon him.",
        "malay_translation": "Diriwayatkan daripada Aisyah RA berkata: Aku mempunyai (tanggungan) puasa (qadha) dari Ramadan, dan aku tidak dapat mengqadhanya kecuali pada bulan Sya'ban. Yahya bin Sa'eed berkata: Maksudnya adalah kesibukan dengan Nabi SAW atau bersama Nabi SAW.",
        "arabic_text": "عَنْ عَائِشَةَ قَالَتْ: كَانَ يَكُونُ عَلَيَّ الصَّوْمُ مِنْ رَمَضَانَ فَمَا أَسْتَطِيعُ أَنْ أَقْضِيَ إِلَّا فِي شَعْبَانَ. قَالَ يَحْيَى بْنُ سَعِيدٍ: تَعْنِي الشّغل من النَّبِي أَو بِالنَّبِيِّ صلى الله عَلَيْهِ وَسلم"
      },
      {
        "id": 30725,
        "hadith_number": "2031",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Berpuasa Sunat dan Membenarkan Masuk Rumah Tanpa Izin Suami",
        "perawi_melayu": "Diriwayatkan dari Abu Hurairah RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: “Tidak halal bagi seorang wanita untuk berpuasa (sunat) sedangkan suaminya ada (tidak bermusafir) kecuali dengan izinnya, dan tidak boleh dia membenarkan seseorang masuk ke rumahnya kecuali dengan izinnya.” (Riwayat Muslim)",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَحِلُّ لِلْمَرْأَةِ أَنْ تَصُومَ وَزَوْجُهَا شَاهِدٌ إِلَّا بِإِذْنِهِ وَلَا تَأْذَنَ فِي بَيْتِهِ إِلَّا بِإِذْنِهِ» . رَوَاهُ مُسلم"
      },
      {
        "id": 30726,
        "hadith_number": "2032",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mengqadha Puasa Bagi Wanita Haid dan Tidak Mengqadha Solat",
        "perawi_melayu": "Diriwayatkan daripada Muazah al-Adawiyah bahawa dia bertanya kepada Aisyah: \"Kenapa wanita haid mengqadha puasa dan tidak mengqadha solat?\" Aisyah menjawab: \"Kami mengalami hal itu, lalu kami diperintahkan untuk mengqadha puasa dan tidak diperintahkan untuk mengqadha solat.\" Riwayat Muslim.",
        "english_text": "Mu'adha al-'Adawiyya reported that she asked 'A'isha: Why should a woman who menstruates make good the fasts but not make good the prayers? 'A'isha said: That is what used to happen to us, and we were ordered to make good the fasts but were not ordered to make good the prayers. (Muslim)",
        "malay_translation": "Muazah al-Adawiyah meriwayatkan bahawa dia bertanya kepada Aisyah: \"Mengapa wanita yang haid perlu mengganti puasa tetapi tidak perlu mengganti solat?\" Aisyah menjawab: \"Itulah yang berlaku kepada kami (pada zaman Nabi), dan kami diperintahkan untuk mengganti puasa tetapi tidak diperintahkan untuk mengganti solat.\" (Riwayat Muslim)",
        "arabic_text": "وَعَنْ مُعَاذَةَ الْعَدَوِيَّةِ أَنَّهَا قَالَتْ لِعَائِشَةَ: مَا بَالُ الْحَائِضِ تَقْضِي الصَّوْمَ وَلَا تَقْضِي الصَّلَاةَ؟ قَالَتْ عَائِشَةُ: كَانَ يُصِيبُنَا ذَلِكَ فَنُؤْمَرُ بِقَضَاءِ الصَّوْمِ وَلَا نُؤْمَرُ بِقَضَاءِ الصَّلَاةِ. رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 30727,
        "hadith_number": "2033",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menunaikan Puasa Bagi Pihak Si Mati",
        "perawi_melayu": "Diriwayatkan daripada Aisyah R.A.,",
        "english_text": "وعن عائشة رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: «من مات وعليه صوم صام عنه وليه»",
        "malay_translation": "Daripada Aisyah R.A., beliau berkata: Rasulullah S.A.W. bersabda: “Sesiapa yang mati dan masih mempunyai tanggungan puasa, maka walinya hendaklah berpuasa bagi pihaknya.”",
        "arabic_text": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ مَاتَ وَعَلَيْهِ صَوْمٌ صَامَ عَنْهُ وليه»"
      },
      {
        "id": 30728,
        "hadith_number": "2034",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Fidyah Puasa Ramadan Bagi Si Mati",
        "perawi_melayu": "Daripada Nafi' daripada Ibnu Umar daripada Nabi SAW bersabda:",
        "english_text": "From Nafi' from Ibn Umar from the Prophet, peace and blessings be upon him, who said: “Whoever dies with obligatory fasting of Ramadan, let him feed in his place a poor person for every day.”  Reported by al-Tirmidhi, who said: It is more correct that it is stopped to Ibn Umar.",
        "malay_translation": "\"Sesiapa yang mati dengan kewajipan puasa Ramadan (yang belum ditunaikan), maka hendaklah diberi makan bagi pihaknya seorang miskin untuk setiap hari (yang ditinggalkan).\" Diriwayatkan oleh al-Tirmizi, dan beliau berkata: Yang lebih sahih, ia adalah mauquf (terhenti) kepada Ibnu Umar.",
        "arabic_text": "عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ مَاتَ وَعَلَيْهِ صِيَامُ شَهْرِ رَمَضَانَ فَلْيُطْعَمْ عَنْهُ مَكَانَ كُلِّ يَوْمٍ مِسْكِينٌ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: وَالصَّحِيحُ أَنه مَوْقُوف على ابْن عمر"
      },
      {
        "id": 30729,
        "hadith_number": "2035",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tidak Boleh Berpuasa atau Solat Bagi Pihak Orang Lain",
        "perawi_melayu": "Malik meriwayatkan bahawa Ibnu Umar pernah ditanya: \"Adakah seseorang boleh berpuasa bagi pihak orang lain atau solat bagi pihak orang lain?\" Ibnu Umar menjawab: \"Tidak, seseorang tidak boleh berpuasa bagi pihak orang lain dan tidak boleh solat bagi pihak orang lain.\"",
        "english_text": "Narrated Malik: It has been reported to me that Ibn Umar was asked: Can anyone fast on behalf of another or pray on behalf of another? He said: No one can fast on behalf of another, and no one can pray on behalf of another. (Related in Al-Muwatta)",
        "malay_translation": "Malik meriwayatkan: Telah sampai kepadaku bahawa Ibnu Umar pernah ditanya: Adakah seseorang boleh berpuasa bagi pihak orang lain atau solat bagi pihak orang lain? Beliau menjawab: Tidak, seseorang tidak boleh berpuasa bagi pihak orang lain, dan tidak boleh solat bagi pihak orang lain. (Diriwayatkan dalam Al-Muwatta).",
        "arabic_text": "عَنْ مَالِكٍ بَلَغَهُ أَنَّ ابْنَ عُمَرَ كَانَ يُسْأَلُ: هَلْ يَصُومُ أَحَدٌ عَنْ أَحَدٍ أَوْ يُصَلِّي أَحَدٌ عَنْ أَحَدٍ؟ فَيَقُولُ: لَا يَصُومُ أَحَدٌ عَنْ أَحَدٍ. وَلَا يُصَلِّي أَحَدٌ عَنْ أحد. رَوَاهُ فِي الْمُوَطَّأ"
      },
      {
        "id": 30730,
        "hadith_number": "2036",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Amalan Puasa Rasulullah SAW pada Bulan Sya'ban",
        "perawi_melayu": "Aisyah RA",
        "english_text": "From Aisha who said: The Messenger of Allah (PBUH) used to fast until we said: He will not break his fast, and he would break his fast until we said: He will not fast. And I never saw the Messenger of Allah (PBUH) complete a month of fasting except for Ramadan, and I never saw him in a month more than he fasted in Sha'ban. And in one narration she said: He used to fast all of Sha'ban, and he used to fast Sha'ban except for a little.",
        "malay_translation": "Daripada Aisyah RA berkata: Rasulullah SAW biasa berpuasa sehingga kami berkata: Baginda tidak akan berbuka, dan baginda berbuka sehingga kami berkata: Baginda tidak akan berpuasa. Dan aku tidak pernah melihat Rasulullah SAW menyempurnakan puasa sebulan penuh kecuali bulan Ramadan, dan aku tidak pernah melihat baginda dalam sebulan yang lebih banyak berpuasa daripada bulan Sya'ban. Dan dalam satu riwayat, beliau berkata: Baginda biasa berpuasa sepanjang bulan Sya'ban, dan baginda biasa berpuasa Sya'ban kecuali sedikit sahaja.",
        "arabic_text": "عَنْ عَائِشَةَ قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ حَتَّى نَقُولَ: لَا يُفْطِرُ وَيُفْطِرُ حَتَّى نَقُولَ: لَا يَصُومُ وَمَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتكْمل صِيَام شهر قطّ إِلَّا رَمَضَانَ وَمَا رَأَيْتُهُ فِي شَهْرٍ أَكْثَرَ مِنْهُ صِيَامًا فِي شَعْبَانَ وَفِي رِوَايَةٍ قَالَتْ: كَانَ يَصُوم شعْبَان كُله وَكن يَصُوم شعْبَان إِلَّا قَلِيلا"
      },
      {
        "id": 30731,
        "hadith_number": "2037",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Puasa Sunnah Rasulullah SAW Selain Ramadhan",
        "perawi_melayu": "Diriwayatkan daripada Abdullah bin Shaqiq, beliau berkata: Aku bertanya kepada Aisyah: Adakah Nabi SAW berpuasa sebulan penuh? Aisyah menjawab: Aku tidak tahu baginda berpuasa sebulan penuh kecuali Ramadhan, dan baginda tidak pernah tidak berpuasa sebulan penuh sehingga baginda wafat. ",
        "english_text": "Narrated from Abdullah bin Shaqiq, he said: I said to Aishah: Did the Prophet PBUH fast a whole month? She said: I did not know that he fasted a whole month except Ramadan, and he never did not fast a whole month until he passed away.",
        "malay_translation": "Diriwayatkan daripada Abdullah bin Shaqiq, beliau berkata: Aku bertanya kepada Aisyah: Adakah Nabi SAW berpuasa sebulan penuh? Aisyah menjawab: Aku tidak tahu baginda berpuasa sebulan penuh kecuali Ramadhan, dan baginda tidak pernah tidak berpuasa sebulan penuh sehingga baginda wafat. Riwayat Muslim.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ قَالَ: قُلْتُ لِعَائِشَةَ: أَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُوم شهرا كُله؟ قَالَ: مَا عَلِمْتُهُ صَامَ شَهْرًا كُلَّهُ إِلَّا رَمَضَانَ وَلَا أَفْطَرَهُ كُلَّهُ حَتَّى يَصُومَ مِنْهُ حَتَّى مضى لسبيله. رَوَاهُ مُسلم"
      },
      {
        "id": 30732,
        "hadith_number": "2038",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Puasa Ganti di Bulan Sya'ban",
        "perawi_melayu": "Riwayat daripada Imran bin Husain RA",
        "english_text": "From Imran bin Husain, from the Prophet (peace and blessings of Allah be upon him): He asked him, or asked a man while Imran was listening, and said: 'O Abu Fulan, did you not fast any of the days of Sha'ban?' He said: No. He said: 'When you have broken your fast, then fast two days.'",
        "malay_translation": "Daripada Imran bin Husain RA, daripada Nabi SAW: Baginda bertanya kepadanya, atau bertanya kepada seorang lelaki sementara Imran sedang mendengar, dan bersabda: 'Wahai Abu Fulan, tidakkah engkau berpuasa pada hari-hari Sya'ban?' Dia berkata: Tidak. Baginda bersabda: 'Apabila engkau telah berbuka, maka berpuasalah dua hari.'",
        "arabic_text": "وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَنَّهُ سَأَلَهُ أَوْ سَأَلَ رَجُلًا وَعِمْرَانَ يَسْمَعُ فَقَالَ: «يَا أَبَا فُلَانٍ أَمَا صُمْتَ مِنْ سَرَرِ شَعْبَانَ؟» قَالَ: لَا قَالَ: «فَإِذَا أَفْطَرْتَ فَصُمْ يَوْمَيْنِ»"
      },
      {
        "id": 30733,
        "hadith_number": "2039",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Puasa Sunat Muharram dan Solat Malam",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: 'Sebaik-baik puasa selepas Ramadan adalah bulan Allah, Muharram. Dan sebaik-baik solat selepas solat fardhu adalah solat malam.' (Riwayat Muslim)",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَفْضَلُ الصِّيَامِ بَعْدَ رَمَضَانَ شَهْرُ اللَّهِ الْمُحَرَّمِ وَأَفْضَلُ الصَّلَاةِ بَعْدَ الْفَرِيضَةِ صَلَاةُ اللَّيْلِ» . رَوَاهُ مُسلم"
      },
      {
        "id": 30734,
        "hadith_number": "2040",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Puasa Hari Asyura dan Bulan Ramadan",
        "perawi_melayu": "Ibnu Abbas",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Abbas RA, beliau berkata: Aku tidak pernah melihat Nabi SAW bersungguh-sungguh berpuasa pada suatu hari yang dilebihkan dari hari lainnya kecuali pada hari ini, yaitu hari Asyura, dan bulan ini, yaitu bulan Ramadan.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: مَا رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَحَرَّى صِيَامَ يَوْمٍ فَضَّلَهُ عَلَى غَيْرِهِ إِلَّا هَذَا الْيَوْمَ: يَوْمَ عَاشُورَاءَ وَهَذَا الشَّهْرُ يَعْنِي شَهْرَ رَمَضَان"
      },
      {
        "id": 30735,
        "hadith_number": "2041",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Niat Rasulullah SAW untuk Berpuasa pada Hari Kesembilan Muharram (Tasu'a) bersama 'Asyura'",
        "perawi_melayu": "Diriwayatkan daripada Ibnu Abbas RA, beliau berkata: Ketika Rasulullah SAW berpuasa pada hari Asyura dan memerintahkan untuk berpuasa padanya, mereka (para sahabat) berkata: Wahai Rasulullah, sesungguhnya ia adalah hari yang diagungkan oleh Yahudi dan Nasrani. Maka Rasulullah SAW bersabda: \"Jika aku masih hidup hingga tahun depan, nescaya aku akan berpuasa pada hari kesembilan (Muharram).\" (Riwayat Muslim)",
        "english_text": "Narrated by Ibn Abbas: When the Messenger of Allah (peace and blessings of Allah be upon him) fasted on the day of Ashura and commanded that it be fasted, they said: O Messenger of Allah, it is a day that is venerated by the Jews and Christians. So the Messenger of Allah (peace and blessings of Allah be upon him) said: If I live until next year, I will fast on the ninth (of Muharram). Narrated by Muslim.",
        "malay_translation": "Diriwayatkan daripada Ibnu Abbas RA: Ketika Rasulullah SAW berpuasa pada hari Asyura dan memerintahkan untuk berpuasa padanya, mereka (para sahabat) berkata: Wahai Rasulullah, sesungguhnya ia adalah hari yang diagungkan oleh Yahudi dan Nasrani. Maka Rasulullah SAW bersabda: \"Jika aku masih hidup hingga tahun depan, nescaya aku akan berpuasa pada hari kesembilan (Muharram).\" Riwayat Muslim.",
        "arabic_text": "وَعَن ابْنِ عَبَّاسٍ قَالَ: حِينَ صَامَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ عَاشُورَاءَ وَأَمَرَ بِصِيَامِهِ قَالُوا: يَا رَسُولَ اللَّهِ إِنَّهُ يَوْمٌ يُعَظِّمُهُ الْيَهُودُ وَالنَّصَارَى. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَئِنْ بَقِيتُ إِلَى قَابِلٍ لأصومن التَّاسِع» . رَوَاهُ مُسلم"
      },
      {
        "id": 30736,
        "hadith_number": "2042",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi Muhammad SAW Tidak Berpuasa pada Hari Arafah",
        "perawi_melayu": "Umm al-Fadl binti al-Harith",
        "english_text": "Not Available",
        "malay_translation": "Daripada Umm al-Fadl binti al-Harith: Bahawa beberapa orang berselisih pendapat di hadapannya pada hari Arafah mengenai puasa Rasulullah SAW. Sebahagian mereka berkata: Baginda berpuasa, dan sebahagian lain berkata: Baginda tidak berpuasa. Lalu aku menghantar kepadanya satu bekas susu, dan baginda sedang berdiri di atas untanya di Arafah, lalu baginda meminumnya.",
        "arabic_text": "وَعَنْ أُمِّ الْفَضْلِ بِنْتِ الْحَارِثِ: أَنَّ نَاسًا تَمَارَوْا عِنْدَهَا يَوْمَ عَرَفَةَ فِي صِيَامِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ بَعْضُهُمْ: هُوَ صَائِمٌ وَقَالَ بَعْضُهُمْ: لَيْسَ بِصَائِمٍ فَأَرْسَلْتُ إِلَيْهِ بقدح لبن وَهُوَ وَاقِف عل بعيره بِعَرَفَة فشربه"
      },
      {
        "id": 30737,
        "hadith_number": "2043",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah ﷺ Tidak Berpuasa pada Sepuluh Hari Pertama Zulhijjah",
        "perawi_melayu": "Aisyah RA",
        "english_text": "Narrated Aishah RA: I never saw the Messenger of Allah (peace and blessings of Allah be upon him) fasting in the (first) ten days (of Dhul Hijjah). Narrated by Muslim.",
        "malay_translation": "Diriwayatkan daripada Aisyah RA: Aku tidak pernah melihat Rasulullah ﷺ berpuasa pada sepuluh hari pertama (bulan Zulhijjah). Riwayat Muslim.",
        "arabic_text": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: مَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَائِما فِي الْعشْر قطّ. رَوَاهُ مُسلم"
      },
      {
        "id": 30738,
        "hadith_number": "2044",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Cara Berpuasa dan Keutamaan Puasa 'Arafah dan 'Asyura",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Qatadah RA: Sesungguhnya seorang lelaki datang kepada Nabi SAW dan bertanya, 'Bagaimana kamu berpuasa?' Rasulullah SAW marah dengan soalannya. Ketika Umar RA melihat kemarahan Baginda, beliau berkata, 'Kami redha Allah sebagai Tuhan kami, Islam sebagai agama kami, dan Muhammad sebagai Nabi kami. Kami berlindung kepada Allah daripada kemurkaan Allah dan kemurkaan Rasul-Nya.' Umar RA terus mengulangi kata-kata ini sehingga kemarahan Baginda reda. Umar bertanya, 'Wahai Rasulullah, bagaimana pula dengan orang yang berpuasa sepanjang tahun?' Baginda bersabda, 'Dia tidak berpuasa dan tidak berbuka.' Atau Baginda bersabda, 'Dia tidak berpuasa dan tidak berbuka.' Dia bertanya, 'Bagaimana pula dengan orang yang berpuasa dua hari dan berbuka sehari?' Baginda bersabda, 'Adakah sesiapa yang mampu melakukan demikian?' Dia bertanya, 'Bagaimana pula dengan orang yang berpuasa sehari dan berbuka sehari?' Baginda bersabda, 'Itu adalah puasa Daud AS.' Dia bertanya, 'Bagaimana pula dengan orang yang berpuasa sehari dan berbuka dua hari?' Baginda bersabda, 'Aku ingin aku mampu melakukan demikian.' Kemudian Rasulullah SAW bersabda, 'Tiga hari setiap bulan dan Ramadhan ke Ramadhan, maka itu adalah puasa sepanjang tahun. Puasa hari 'Arafah, aku berharap kepada Allah agar menghapuskan dosa setahun sebelumnya dan setahun selepasnya. Dan puasa hari 'Asyura, aku berharap kepada Allah agar menghapuskan dosa setahun sebelumnya.' Riwayat Muslim",
        "arabic_text": "وَعَنْ أَبِي قَتَادَةَ: أَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ كَيْفَ تَصُومُ فَغَضِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَوْله. فَلَمَّا رأى عمر رَضِي الله عَنْهُم غَضَبَهُ قَالَ رَضِينَا بِاللَّهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ نَبِيًّا نَعُوذُ بِاللَّهِ مِنْ غَضَبِ اللَّهِ وَغَضب رَسُوله فَجعل عمر رَضِي الله عَنْهُم يُرَدِّدُ هَذَا الْكَلَامَ حَتَّى سَكَنَ غَضَبُهُ فَقَالَ عمر يَا رَسُول الله كَيفَ بِمن يَصُومُ الدَّهْرَ كُلَّهُ قَالَ: «لَا صَامَ وَلَا أَفْطَرَ» . أَوْ قَالَ: «لَمْ يَصُمْ وَلَمْ يُفْطِرْ» . قَالَ كَيْفَ مَنْ يَصُومُ يَوْمَيْنِ وَيُفْطِرُ يَوْمًا قَالَ: «وَيُطِيقُ ذَلِكَ أَحَدٌ» . قَالَ كَيْفَ مَنْ يَصُوم يَوْمًا وَيفْطر يَوْمًا قَالَ: «ذَاك صَوْم دَاوُد عَلَيْهِ السَّلَام» قَالَ كَيْفَ مَنْ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمَيْنِ قَالَ: «وَدِدْتُ أَنِّي طُوِّقْتُ ذَلِكَ» . ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «ثَلَاث مِنْ كُلِّ شَهْرٍ وَرَمَضَانُ إِلَى رَمَضَانَ فَهَذَا صِيَامُ الدَّهْرِ كُلِّهِ صِيَامُ يَوْمِ عَرَفَةَ أَحْتَسِبُ عَلَى اللَّهِ أَنْ يُكَفِّرَ السَّنَةَ الَّتِي قَبْلَهُ وَالسَّنَةَ الَّتِي بَعْدَهُ وَصِيَامُ يَوْمِ عَاشُورَاءَ أَحْتَسِبُ عَلَى اللَّهِ أَنْ يُكَفِّرَ السَّنَةَ الَّتِي قَبْلَهُ» . رَوَاهُ مُسلم"
      },
      {
        "id": 30739,
        "hadith_number": "2045",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Puasa Hari Isnin",
        "perawi_melayu": "Diriwayatkan dari Abu Qatadah RA",
        "english_text": "Narrated Abu Qatada: The Messenger of Allah (peace and blessings of Allah be upon him) was asked about fasting on Mondays and he said, 'On that day I was born, and on that day Revelation came to me.' Related by Muslim.",
        "malay_translation": "Diriwayatkan daripada Abu Qatadah RA, beliau berkata: Rasulullah SAW ditanya mengenai puasa pada hari Isnin, lalu Baginda bersabda: 'Pada hari itu aku dilahirkan, dan pada hari itu wahyu diturunkan kepadaku.'  Riwayat Muslim.",
        "arabic_text": "وَعَن أَبِي قَتَادَةَ قَالَ: سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَوْمِ الِاثْنَيْنِ فَقَالَ: «فِيهِ وُلِدْتُ وَفِيهِ أُنْزِلَ عَلَيَّ» . رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 30740,
        "hadith_number": "2046",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Puasa Tiga Hari Setiap Bulan: Tidak Dipilih Hari Tertentu",
        "perawi_melayu": "Diriwayatkan daripada Mu'azah al-Adawiyah bahawa dia bertanya kepada Aisyah: Adakah Rasulullah SAW berpuasa tiga hari setiap bulan? Aisyah menjawab: Ya. Aku bertanya kepadanya: Pada hari apa dalam bulan itu baginda berpuasa? Aisyah menjawab: Baginda tidak memilih hari tertentu dalam bulan untuk berpuasa. Riwayat Muslim.",
        "english_text": "Not Available",
        "malay_translation": "Diriwayatkan daripada Mu'azah al-Adawiyah bahawa dia bertanya kepada Aisyah: \"Adakah Rasulullah SAW berpuasa tiga hari setiap bulan?\" Aisyah menjawab: \"Ya.\" Aku bertanya kepadanya: \"Pada hari apa dalam bulan itu baginda berpuasa?\" Aisyah menjawab: \"Baginda tidak memilih hari tertentu dalam bulan untuk berpuasa.\" (Riwayat Muslim)",
        "arabic_text": "وَعَنْ مُعَاذَةَ الْعَدَوِيَّةِ أَنَّهَا سَأَلَتْ عَائِشَةَ: أَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ مِنْ كُلِّ شَهْرٍ ثَلَاثَةَ أَيَّامٍ؟ قَالَتْ: نَعَمْ فَقُلْتُ لَهَا: مِنْ أَيِّ أَيَّامِ الشَّهْرِ كَانَ يَصُومُ؟ قَالَتْ: لَمْ يَكُنْ يُبَالِي مِنْ أَيِّ أَيَّام الشَّهْر يَصُوم. رَوَاهُ مُسلم"
      },
      {
        "id": 30741,
        "hadith_number": "2047",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Puasa Enam Hari di Bulan Syawal",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Ayyub al-Ansari bahawa Rasulullah SAW bersabda: 'Sesiapa yang berpuasa Ramadhan kemudian diikuti dengan enam hari dari Syawal, (pahalanya) adalah seperti berpuasa sepanjang tahun.' Riwayat Muslim.",
        "arabic_text": "وَعَنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّ أَنَّهُ حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ صَامَ رَمَضَانَ ثُمَّ أَتْبَعَهُ سِتًّا مِنْ شَوَّال كَانَ كصيام الدَّهْر» . رَوَاهُ مُسلم"
      },
      {
        "id": 30742,
        "hadith_number": "2048",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Berpuasa pada Hari Raya Fitri dan Adha",
        "perawi_melayu": "Diriwayatkan daripada Abu Sa'id al-Khudri",
        "english_text": "Abu Sa'id al-Khudri reported: The Messenger of Allah (peace and blessings of Allah be upon him) forbade fasting on the day of Fitr and the day of Sacrifice (al-Adha).",
        "malay_translation": "Diriwayatkan daripada Abu Sa'id al-Khudri RA, beliau berkata: Rasulullah SAW melarang berpuasa pada hari Fitri (Aidilfitri) dan hari Nahr (Aidiladha).",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَوْمِ يَوْمِ الْفِطْرِ وَالنَّحْرِ"
      },
      {
        "id": 30743,
        "hadith_number": "2049",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Berpuasa pada Dua Hari Raya",
        "perawi_melayu": "Diriwayatkan daripada Abu Sa'id al-Khudri",
        "english_text": "Narrated from Abu Sa'id al-Khudri: The Messenger of Allah (peace and blessings of Allah be upon him) said: 'There is no fasting on two days: Eid al-Fitr and Eid al-Adha.'",
        "malay_translation": "Diriwayatkan daripada Abu Sa'id al-Khudri: Rasulullah SAW bersabda: 'Tidak boleh berpuasa pada dua hari: Hari Raya Aidilfitri dan Hari Raya Aidiladha.'",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا صَوْم فِي يَوْمَيْنِ: الْفطر وَالضُّحَى"
      },
      {
        "id": 30744,
        "hadith_number": "2050",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hari-Hari Tasyrik adalah Hari Makan, Minum dan Mengingati Allah",
        "perawi_melayu": "Diriwayatkan daripada Nubaishah Al-Huzali, beliau berkata: Rasulullah SAW bersabda: \"Hari-hari Tasyrik adalah hari makan, minum dan mengingati Allah.\"",
        "english_text": "Not Available",
        "malay_translation": "Daripada Nubaishah Al-Huzali RA, beliau berkata: Rasulullah SAW bersabda: \"Hari-hari Tasyrik adalah hari makan, minum dan mengingati Allah.\" [Riwayat Muslim]",
        "arabic_text": "وَعَنْ نُبَيْشَةَ الْهُذَلِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَيَّامُ التَّشْرِيقِ أَيَّامُ أكل وَشرب وَذكر الله» . رَوَاهُ مُسلم"
      },
      {
        "id": 30745,
        "hadith_number": "2051",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Berpuasa Pada Hari Jumaat Secara Bersendirian",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "No English text available.",
        "malay_translation": "Daripada Abu Hurairah رضي الله عنه, berkata: Rasulullah ﷺ bersabda: \"Janganlah salah seorang daripada kamu berpuasa pada hari Jumaat kecuali berpuasa sebelum atau sesudahnya.\"",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَصُومُ أَحَدُكُمْ يَوْمَ الْجُمُعَةِ إِلَّا أَن بِصَوْم قبله أَو بِصَوْم بعده»"
      },
      {
        "id": 30746,
        "hadith_number": "2052",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mengkhususkan Malam Jumaat untuk Solat dan Hari Jumaat untuk Puasa (Kecuali Jika Sudah Menjadi Kebiasaan)",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: “Janganlah kamu mengkhususkan malam Jumaat dengan melakukan qiyam (solat malam) di antara malam-malam yang lain, dan janganlah kamu mengkhususkan hari Jumaat dengan berpuasa di antara hari-hari yang lain, kecuali jika puasa itu merupakan puasa yang biasa dilakukan oleh salah seorang di antara kamu.” Riwayat Muslim.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَخْتَصُّوا لَيْلَةَ الْجُمُعَةِ بِقِيَامٍ مِنْ بَيْنِ اللَّيَالِي وَلَا تَخْتَصُّوا يَوْمَ الْجُمُعَةِ بِصِيَامٍ مِنْ بَيْنِ الْأَيَّامِ إِلَّا أَنْ يَكُونَ فِي صَوْمٍ يَصُومهُ أحدكُم» . رَوَاهُ مُسلم"
      },
      {
        "id": 30747,
        "hadith_number": "2053",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Berpuasa di Jalan Allah",
        "perawi_melayu": "Diriwayatkan daripada Abu Sa'id al-Khudri",
        "english_text": "Narrated by Abu Sa'id al-Khudri: The Messenger of Allah (peace and blessings of Allah be upon him) said: 'Whoever fasts one day in the cause of Allah, Allah will keep his face away from the Fire for seventy years.'",
        "malay_translation": "Diriwayatkan daripada Abu Sa'id al-Khudri: Rasulullah SAW bersabda: 'Sesiapa yang berpuasa satu hari di jalan Allah, Allah akan menjauhkan wajahnya dari api neraka selama tujuh puluh tahun.'",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ بَعَّدَ اللَّهُ وَجْهَهُ عَنِ النَّارِ سَبْعِينَ خَرِيفًا»"
      },
      {
        "id": 30748,
        "hadith_number": "2054",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hak Tubuh Badan dan Isteri: Nasihat Rasulullah SAW kepada Abdullah bin Amr",
        "perawi_melayu": "Abdullah bin Amr bin Al-As",
        "english_text": "Narrated 'Abdullah bin 'Amr bin al-'As: The Messenger of Allah (ﷺ) said, \"O 'Abdullah! Have I not been informed that you fast all day and stand in prayer all night?\" I said, \"Yes, O Messenger of Allah.\" He said, \"Do not do that. Fast, and break your fast; pray, and sleep. For your body has a right over you, your eye has a right over you, your wife has a right over you, and your guest has a right over you. He who fasts all his life does not fast. Fast for three days every month, for the reward of that is equal to the fasting of the whole life.\" I said, \"I can do more than that.\" He said, \"Then fast the most excellent fasting, the fasting of David: He used to fast one day and break his fast another; and recite the Qur'an once every seven days, and do not increase on that.\"",
        "malay_translation": "Diriwayatkan daripada Abdullah bin Amr bin Al-As, beliau berkata: Rasulullah SAW bersabda: \"Wahai Abdullah! Bukankah aku telah mendapat tahu bahawa engkau berpuasa pada siang hari dan bangun solat pada malam hari?\" Aku menjawab: \"Benar, wahai Rasulullah.\" Baginda bersabda: \"Janganlah engkau berbuat demikian. Berpuasalah dan berbukalah, solatlah dan tidurlah. Sesungguhnya tubuh badanmu mempunyai hak ke atasmu, matamu mempunyai hak ke atasmu, isterimu mempunyai hak ke atasmu, dan tetamumu mempunyai hak ke atasmu. Tidak berpuasa orang yang berpuasa sepanjang masa. Puasa tiga hari setiap bulan adalah seperti puasa sepanjang masa. Berpuasalah tiga hari setiap bulan dan bacalah Al-Quran setiap bulan.\" Aku berkata: \"Sesungguhnya aku mampu melakukan lebih daripada itu.\" Baginda bersabda: \"Berpuasalah puasa yang paling afdal, puasa Daud: iaitu berpuasa sehari dan berbuka sehari; dan bacalah Al-Quran sekali dalam setiap tujuh malam, dan janganlah menambah daripada itu.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو بْنِ الْعَاصِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا عَبْدَ اللَّهِ أَلَمْ أُخْبَرْ أَنَّكَ تَصُومُ النَّهَارَ وَتَقُومُ اللَّيْلَ؟» فَقُلْتُ: بَلَى يَا رَسُولَ اللَّهِ. قَالَ: «فَلَا تَفْعَلْ صُمْ وَأَفْطِرْ وَقُمْ وَنَمْ فَإِنَّ لِجَسَدِكَ عَلَيْكَ حَقًّا وَإِنَّ لِعَيْنِكَ عَلَيْكَ حَقًّا وَإِنَّ لِزَوْجِكَ عَلَيْكَ حَقًّا وَإِنَّ لِزَوْرِكَ عَلَيْكَ حَقًّا. لَا صَامَ مَنْ صَامَ الدَّهْرَ. صَوْمُ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ صَوْمُ الدَّهْرِ كُلِّهِ. صُمْ كُلَّ شَهْرٍ ثَلَاثَةَ أَيَّامٍ وَاقْرَأِ الْقُرْآنَ فِي كُلِّ شَهْرٍ» . قُلْتُ: إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ. قَالَ: صُمْ أَفْضَلَ الصَّوْمِ صَوْمَ دَاوُدَ: صِيَامُ يَوْمٍ وَإِفْطَارُ يَوْمٍ. وَاقْرَأْ فِي كُلِّ سَبْعِ لَيَالٍ مَرَّةً وَلَا تَزِدْ عَلَى ذَلِكَ"
      },
      {
        "id": 30749,
        "hadith_number": "2055",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Berpuasa Pada Hari Isnin dan Khamis",
        "perawi_melayu": "Aisyah RA",
        "english_text": "Narrated by Aisha (RA): The Messenger of Allah (peace and blessings of Allah be upon him) used to fast on Mondays and Thursdays. [Reported by At-Tirmidhi and An-Nasa'i]",
        "malay_translation": "Diriwayatkan oleh Aisyah RA: Rasulullah SAW berpuasa pada hari Isnin dan Khamis. [Diriwayatkan oleh At-Tirmizi dan An-Nasa'i]",
        "arabic_text": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ الِاثْنَيْنِ وَالْخَمِيس. رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ"
      },
      {
        "id": 30750,
        "hadith_number": "2056",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Amalan Diperlihatkan pada Hari Isnin dan Khamis",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA",
        "english_text": "وعن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: «تعرض الأعمال يوم الاثنين والخميس فأحب أن يعرض عملي وأنا صائم» . رواه الترمذي",
        "malay_translation": "Daripada Abu Hurairah RA berkata: Rasulullah SAW bersabda: “Amalan diperlihatkan pada hari Isnin dan Khamis, maka aku suka amalanku diperlihatkan sedang aku berpuasa.” Riwayat Tirmizi.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تُعْرَضُ الْأَعْمَالُ يَوْمَ الِاثْنَيْنِ وَالْخَمِيسِ فَأُحِبُّ أَنْ يُعْرَضَ عَمَلِي وَأَنَا صَائِمٌ» . رَوَاهُ التِّرْمِذِيُّ"
      },
      {
        "id": 30751,
        "hadith_number": "2057",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Puasa Tiga Hari Setiap Bulan: Hari ke-13, 14, dan 15",
        "perawi_melayu": "Abu Zar r.a.",
        "english_text": "The narration lacks an English translation. The Arabic text focuses on the practice of fasting three days a month, specifically the 13th, 14th, and 15th days.",
        "malay_translation": "Daripada Abu Zar r.a. berkata: Rasulullah SAW bersabda: \"Wahai Abu Zar, apabila engkau berpuasa tiga hari sebulan, maka berpuasalah pada hari ke-13, 14, dan 15.\" (Riwayat At-Tirmizi dan An-Nasa'i)",
        "arabic_text": "وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا أَبَا ذَرٍّ إِذَا صُمْتَ مِنَ الشَّهْرِ ثَلَاثَةَ أَيَّامٍ فَصُمْ ثَلَاثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ» . رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ"
      },
      {
        "id": 30752,
        "hadith_number": "2058",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Amalan Puasa Tiga Hari Setiap Bulan dan Keutamaan Hari Jumaat",
        "perawi_melayu": "Riwayat daripada Abdullah bin Mas'ud",
        "english_text": "Narrated Abdullah bin Mas'ud: The Messenger of Allah (peace and blessings of Allah be upon him) used to fast three days from the beginning of every month, and he seldom did not fast on Friday. Related by al-Tirmidhi and al-Nasa'i, and Abu Dawud related it to three days.",
        "malay_translation": "Diriwayatkan daripada Abdullah bin Mas'ud RA, beliau berkata: Rasulullah SAW biasanya berpuasa tiga hari pada setiap awal bulan, dan jarang sekali baginda tidak berpuasa pada hari Jumaat.  (Riwayat Tirmizi dan Nasa'i, dan Abu Daud meriwayatkan sehingga tiga hari).",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ مِنْ غُرَّةِ كُلِّ شَهْرٍ ثَلَاثَةَ أَيَّامٍ وَقَلَّمَا كَانَ يفْطر يَوْم الْجُمُعَةَ. رَوَاهُ التِّرْمِذِيُّ وَالنَّسَائِيُّ وَرَوَاهُ أَبُو دَاوُدَ إِلَى ثَلَاثَة أَيَّام"
      },
      {
        "id": 30753,
        "hadith_number": "2059",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Amalan Puasa Sunat Rasulullah SAW pada Hari Sabtu, Ahad, Isnin, Selasa, Rabu dan Khamis",
        "perawi_melayu": "Diriwayatkan daripada Aisyah RA, katanya:",
        "english_text": "Narrated Aishah (RA): The Messenger of Allah (peace and blessings of Allah be upon him) used to fast on Saturday, Sunday and Monday of the month, and on Tuesday, Wednesday and Thursday of the following month. Related by Tirmidhi.",
        "malay_translation": "Diriwayatkan daripada Aisyah RA: Rasulullah SAW biasanya berpuasa pada hari Sabtu, Ahad dan Isnin dalam suatu bulan, dan pada hari Selasa, Rabu dan Khamis pada bulan berikutnya. (Riwayat Tirmizi)",
        "arabic_text": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ مِنَ الشَّهْرِ السَّبْتَ وَالْأَحَدَ وَالِاثْنَيْنِ وَمِنَ الشَّهْرِ الآخر الثُّلَاثَاء وَالْأَرْبِعَاء وَالْخَمِيس. رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 30754,
        "hadith_number": "2060",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Anjuran Berpuasa Tiga Hari Setiap Bulan",
        "perawi_melayu": "Diriwayatkan daripada Ummu Salamah R.A.",
        "english_text": "From Ummu Salama who said: The Messenger of Allah (peace and blessings of Allah be upon him) used to command me to fast three days of every month, the first of which were Mondays and Thursdays. Narrated by Abu Dawood and An-Nasa'i",
        "malay_translation": "Daripada Ummu Salamah R.A. berkata: Rasulullah SAW menyuruhku berpuasa tiga hari setiap bulan, iaitu hari Isnin dan Khamis yang pertama (dalam bulan tersebut). Riwayat Abu Daud dan An-Nasa'i.",
        "arabic_text": "وَعَنْ أُمِّ سَلَمَةَ قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُنِي أَنْ أَصُومَ ثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ أَوَّلُهَا الِاثْنَيْنِ وَالْخَمِيس. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ"
      },
      {
        "id": 30755,
        "hadith_number": "2061",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hak Keluarga dan Anjuran Berpuasa Sunat",
        "perawi_melayu": "Muslim al-Qurashi meriwayatkan:",
        "english_text": "Not Available",
        "malay_translation": "Muslim al-Qurashi berkata: Saya bertanya atau Rasulullah SAW ditanya mengenai puasa sepanjang tahun. Baginda bersabda: “Sesungguhnya keluargamu mempunyai hak ke atasmu. Berpuasalah di bulan Ramadan dan bulan yang menyusulnya, serta setiap hari Rabu dan Khamis. Maka dengan itu, engkau telah berpuasa sepanjang tahun.” Riwayat Abu Daud dan at-Tirmizi.",
        "arabic_text": "وَعَن مُسلم الْقرشِي قَالَ: سَأَلت أَوْ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَن صِيَام الدَّهْر فَقَالَ: «إِنَّ لِأَهْلِكَ عَلَيْكَ حَقًّا صُمْ رَمَضَانَ وَالَّذِي يَلِيهِ وَكُلَّ أَرْبِعَاءَ وَخَمِيسٍ فَإِذًا أَنْتَ قَدْ صُمْتَ الدَّهْرَ كُلَّهُ» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ"
      },
      {
        "id": 30756,
        "hadith_number": "2062",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Berpuasa pada Hari Arafah di Arafah",
        "perawi_melayu": "Diriwayatkan dari Abu Hurairah RA bahawa Rasulullah SAW melarang berpuasa pada hari Arafah di Arafah.",
        "english_text": "Narrated from Abu Hurairah (RA) that the Messenger of Allah (peace and blessings of Allah be upon him) forbade fasting on the day of Arafah in Arafah. Related by Abu Dawood.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah RA bahawa Rasulullah SAW melarang berpuasa pada hari Arafah di Arafah. Diriwayatkan oleh Abu Dawood.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: نَهَى عَنْ صَوْمِ يَوْمِ عَرَفَةَ بِعَرَفَةَ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 30757,
        "hadith_number": "2063",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Berpuasa pada Hari Sabtu Kecuali Puasa Wajib",
        "perawi_melayu": "Tiada maklumat perawi (Dalam Bahasa Arab)",
        "english_text": "No English translation available.",
        "malay_translation": "Daripada Abdullah bin Busr daripada saudara perempuannya As-Samma', sesungguhnya Rasulullah SAW bersabda: “Janganlah kamu berpuasa pada hari Sabtu kecuali puasa yang diwajibkan ke atas kamu. Sekiranya seseorang daripada kamu tidak mendapat kecuali kulit anggur atau ranting kayu, maka hendaklah dia mengunyahnya.” (Riwayat Ahmad, Abu Daud, At-Tirmizi, Ibnu Majah dan Ad-Darimi)",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ عَنْ أُخْتِهِ الصَّمَّاءِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَصُومُوا يَوْمَ السَّبْتِ إِلَّا فِيمَا افْتُرِضَ عَلَيْكُمْ فَإِنْ لَمْ يَجِدْ أَحَدُكُمْ إِلَّا لِحَاءَ عِنَبَةٍ أَوْ عُودَ شَجَرَةٍ فَلْيَمْضُغْهُ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ والدارمي"
      },
      {
        "id": 30758,
        "hadith_number": "2064",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Berpuasa di Jalan Allah",
        "perawi_melayu": "Diriwayatkan dari Abu Umamah R.A.",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Umamah R.A., beliau berkata: Rasulullah SAW bersabda: \"Sesiapa yang berpuasa sehari di jalan Allah, Allah akan menjadikan parit (khandaq) antara dia dan api neraka, sejauh antara langit dan bumi.\" Riwayat at-Tirmidzi.",
        "arabic_text": "وَعَنْ أَبِي أُمَامَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ جَعَلَ اللَّهُ بَيْنَهُ وَبَيْنَ النَّارِ خَنْدَقًا كَمَا بَيْنَ السَّمَاءِ وَالْأَرْضِ» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 30759,
        "hadith_number": "2065",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ganjaran Amal yang Dilakukan dengan Ikhlas",
        "perawi_melayu": "Aamir bin Mas'ud",
        "english_text": "Aamir bin Mas'ud reported: The Messenger of Allah (peace be upon him) said: \"The reward (of a good deed) is like the coolness of winter.\" (Reported by Ahmad and At-Tirmidhi).",
        "malay_translation": "Daripada Aamir bin Mas'ud, beliau berkata: Rasulullah SAW bersabda: \"Ganjaran (amal soleh) itu seperti kesejukan di musim sejuk.\" (Riwayat Ahmad dan At-Tirmidzi).",
        "arabic_text": "وَعَنْ عَامِرِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْغَنِيمَةُ الْبَارِدَةُ الشِّتَاءِ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ مُرْسل"
      },
      {
        "id": 30760,
        "hadith_number": "2066",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kelebihan Hari-Hari Tertentu dalam Ibadah Korban",
        "perawi_melayu": "Abu Hurairah (seperti disebut dalam hadis)",
        "english_text": "The narrator of this hadith is Abu Hurairah.",
        "malay_translation": "Perawi hadis ini ialah Abu Hurairah.",
        "arabic_text": "وَذَكَرَ حَدِيثَ أَبِي هُرَيْرَةَ: «مَا مِنْ أَيَّامٍ أحب إِلَى الله» فِي بَاب الْأُضْحِية"
      },
      {
        "id": 30761,
        "hadith_number": "2067",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kelebihan Puasa Hari 'Asyura",
        "perawi_melayu": "Ibnu Abbas",
        "english_text": "Narrated by Ibn 'Abbas: The Prophet (ﷺ) came to Medina and found the Jews fasting on the day of 'Ashura'. The Prophet (ﷺ) said to them: \"What is this day that you are fasting?\" They said: \"This is a great day; Allah delivered Moses and his people in it, and drowned Pharaoh and his people. Moses fasted on it, (so) we fast on it also.\" The Prophet (ﷺ) said: \"We have more right to Moses than you.\" So the Prophet (ﷺ) fasted on it and commanded (the Muslims) to fast on it.",
        "malay_translation": "Daripada Ibnu Abbas, bahawa Rasulullah SAW tiba di Madinah lalu mendapati orang Yahudi berpuasa pada hari 'Asyura. Lalu Rasulullah SAW bertanya kepada mereka: \"Apakah hari yang kamu berpuasa ini?\" Mereka menjawab: \"Ini adalah hari yang agung; Allah menyelamatkan Musa dan kaumnya pada hari itu, dan menenggelamkan Firaun dan kaumnya. Musa berpuasa pada hari itu, maka kami juga berpuasa.\" Rasulullah SAW bersabda: \"Kami lebih berhak terhadap Musa daripada kamu.\" Maka Rasulullah SAW berpuasa pada hari itu dan memerintahkan (umat Islam) supaya berpuasa padanya.",
        "arabic_text": "عَنِ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدِمَ الْمَدِينَةِ فَوَجَدَ الْيَهُودَ صِيَامًا يَوْمَ عَاشُورَاءَ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا هَذَا الْيَوْمُ الَّذِي تَصُومُونَهُ؟» فَقَالُوا: هَذَا يَوْمٌ عَظِيمٌ: أَنْجَى اللَّهُ فِيهِ مُوسَى وَقَوْمَهُ وَغَرَّقَ فِرْعَوْنَ وَقَوْمَهُ فَصَامَهُ مُوسَى شُكْرًا فَنَحْنُ نَصُومُهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «فَنَحْنُ أَحَقُّ وَأَوْلَى بِمُوسَى مِنْكُمْ» فَصَامَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَمَرَ بصيامه"
      },
      {
        "id": 30762,
        "hadith_number": "2068",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Berpuasa pada Hari Sabtu dan Ahad Kerana Menyelisihi Perayaan Musyrikin",
        "perawi_melayu": "Not Available",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ummu Salamah RA, beliau berkata: Rasulullah SAW berpuasa pada hari Sabtu dan hari Ahad lebih banyak daripada hari-hari lain. Baginda bersabda: \"Sesungguhnya kedua-dua hari itu adalah hari perayaan bagi orang-orang musyrik, maka aku suka untuk menyelisihi mereka.\" (Riwayat Ahmad)",
        "arabic_text": "وَعَنْ أُمِّ سَلَمَةَ قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ يَوْمَ السَّبْتِ وَيَوْمَ الْأَحَدِ أَكْثَرَ مَا يَصُومُ مِنَ الْأَيَّامِ وَيَقُولُ: «إِنَّهُمَا يَوْمَا عِيدٍ لِلْمُشْرِكِينَ فَأَنَا أُحِبُّ أَن أخالفهم» . رَوَاهُ أَحْمد"
      },
      {
        "id": 30763,
        "hadith_number": "2069",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Anjuran Berpuasa pada Hari Asyura dan Hukumnya Setelah Difardhukan Ramadan",
        "perawi_melayu": "Diriwayatkan daripada Jabir bin Samurah RA, beliau berkata:",
        "english_text": "Not Available",
        "malay_translation": "\"Rasulullah SAW memerintahkan kami untuk berpuasa pada hari Asyura, menggalakkan kami melakukannya, dan sentiasa mengingatkan kami tentangnya.  Namun, setelah difardhukan Ramadan, baginda tidak lagi memerintahkan kami, tidak melarang kami daripadanya, dan tidak lagi mengingatkan kami tentangnya.\" (Riwayat Muslim)",
        "arabic_text": "وَعَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُ بِصِيَامِ يَوْمِ عَاشُورَاءَ وَيَحُثُّنَا عَلَيْهِ وَيَتَعَاهَدُنَا عِنْدَهُ فَلَمَّا فُرِضَ رَمَضَانُ لَمْ يَأْمُرْنَا وَلَمْ يَنْهَنَا عَنْهُ وَلم يتعاهدنا عِنْده. رَوَاهُ مُسلم"
      },
      {
        "id": 30764,
        "hadith_number": "2070",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Amalan Sunnah Nabi SAW: Puasa Asyura, Sepuluh Awal Zulhijjah, dan Solat Sunat",
        "perawi_melayu": "Hafsah (RA)",
        "english_text": "Narrated from Hafsah (RA): 'Four practices the Prophet (ﷺ) never abandoned: fasting on the day of Ashura, observing the first ten days of Dhul-Hijjah, fasting three days each month, and offering two Rak'ah before the Fajr prayer.'",
        "malay_translation": "Diriwayatkan dari Hafsah (RA): 'Empat amalan yang tidak pernah ditinggalkan oleh Nabi (ﷺ): berpuasa pada hari Asyura, beramal pada sepuluh hari pertama bulan Zulhijjah, berpuasa tiga hari setiap bulan, dan mendirikan dua rakaat sebelum solat Subuh.' ",
        "arabic_text": "وَعَنْ حَفْصَةَ قَالَتْ: أَرْبَعٌ لَمْ يَكُنْ يَدَعُهُنَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «صِيَامُ عَاشُورَاءَ وَالْعَشْرِ وَثَلَاثَةُ أَيَّامٍ مِنْ كُلِّ شَهْرٍ وَرَكْعَتَانِ قبل الْفجْر» . رَوَاهُ النَّسَائِيّ"
      },
      {
        "id": 30765,
        "hadith_number": "2071",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Tidak Pernah Tidak Berpuasa pada Hari-Hari Putih (Ayyamul Bidh)",
        "perawi_melayu": "Diriwayatkan daripada Ibnu Abbas RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Abbas RA berkata: Rasulullah SAW tidak pernah tidak berpuasa pada hari-hari putih (Ayyamul Bidh) sama ada ketika bermukim atau dalam perjalanan. (Riwayat An-Nasai)",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُفْطِرُ أَيَّامَ الْبيض فِي حضر وَلَا فِي سفر. رَوَاهُ النَّسَائِيّ"
      },
      {
        "id": 30766,
        "hadith_number": "2072",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Zakat Bagi Segala Sesuatu dan Zakat Jasad adalah Puasa",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: \"Setiap sesuatu ada zakatnya, dan zakat jasad adalah puasa.\" (Riwayat Ibn Majah)",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لِكُلِّ شَيْءٍ زَكَاةٌ وَزَكَاةُ الْجَسَدِ الصَّوْمُ» . رَوَاهُ ابْن مَاجَه"
      },
      {
        "id": 30767,
        "hadith_number": "2073",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Puasa Nabi ﷺ pada Hari Isnin dan Khamis",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "Narrated Abu Hurairah (May Allah be pleased with him): The Prophet (peace be upon him) used to fast on Mondays and Thursdays. It was said to him: 'O Messenger of Allah, you fast on Mondays and Thursdays?' He replied: 'The deeds are presented on Mondays and Thursdays. Allah forgives every Muslim, or every believer, except those who are in a state of Hijaar (hostility). He says: 'Leave them (without forgiveness)'. (Reported by Ahmad and Ibn Majah)",
        "malay_translation": "Daripada Abu Hurairah رضي الله عنه, sesungguhnya Nabi ﷺ berpuasa pada hari Isnin dan Khamis. Lalu ditanyakan kepada Baginda: 'Wahai Rasulullah, sesungguhnya engkau berpuasa pada hari Isnin dan Khamis?' Baginda menjawab: 'Sesungguhnya amalan-amalan itu diangkat (kepada Allah) pada hari Isnin dan Khamis. Maka Allah mengampunkan bagi setiap Muslim, atau setiap orang beriman, kecuali dua orang yang dalam keadaan Hijaar (bermusuhan). Lalu Allah berfirman: 'Biarkanlah mereka (tanpa pengampunan)'. (Riwayat Ahmad dan Ibn Majah)",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: كَانَ يَصُومُ يَوْمَ الِاثْنَيْنِ وَالْخَمِيسِ. فَقِيلَ: يَا رَسُولَ اللَّهِ إِنَّكَ تَصُومُ يَوْمَ الِاثْنَيْنِ وَالْخَمِيسِ. فَقَالَ: إِنَّ يَوْمَ الِاثْنَيْنِ وَالْخَمِيسِ يَغْفِرُ اللَّهُ فِيهِمَا لِكُلِّ مُسْلِمٍ إِلَّا ذَا هَاجِرَيْنِ يَقُولُ: دَعْهُمَا حَتَّى يصطلحا . رَوَاهُ أَحْمد وَابْن مَاجَه"
      },
      {
        "id": 30768,
        "hadith_number": "2074",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Puasa kerana Allah: Dijauhkan dari Neraka",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah RA berkata: Rasulullah SAW bersabda: \"Sesiapa yang berpuasa sehari kerana mengharapkan wajah Allah, Allah akan menjauhkannya daripada neraka sejauh burung gagak terbang ketika ia masih anak sehingga mati tua.\" Riwayat Ahmad.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ صَامَ يَوْمًا ابْتِغَاءَ وَجْهِ اللَّهِ بَعَّدَهُ اللَّهُ مِنْ جَهَنَّمَ كَبُعْدِ غُرَابٍ طَائِرٍ وَهُوَ فرخ حَتَّى مَاتَ هرما» . رَوَاهُ أَحْمد"
      },
      {
        "id": 30769,
        "hadith_number": "2075",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Riwayat daripada Salamah bin Qais dalam Syu'ab al-Iman",
        "perawi_melayu": "Salamah bin Qais (seperti yang diriwayatkan oleh Baihaqi)",
        "english_text": "Baihaqi narrated in Shu'ab al-Iman from Salamah bin Qais",
        "malay_translation": "Baihaqi meriwayatkan dalam Syu'ab al-Iman daripada Salamah bin Qais.",
        "arabic_text": "وَرَوَى الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ عَنْ سَلَمَةَ بن قيس"
      },
      {
        "id": 30770,
        "hadith_number": "2076",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Niat Puasa dan Membatalkan Puasa Sunat",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Aisyah RA, beliau berkata: Nabi SAW masuk menemuiku pada suatu hari dan bertanya: \"Adakah kamu mempunyai apa-apa (makanan)?\" Kami menjawab: \"Tidak.\" Baginda bersabda: \"Jika demikian, aku akan berpuasa.\" Kemudian baginda datang kepada kami pada hari yang lain, lalu kami berkata: \"Wahai Rasulullah, kami telah dihadiahkan *hais* (sejenis manisan).\" Baginda bersabda: \"Tunjukkan ia kepadaku, sesungguhnya aku telah berpuasa,\" lalu baginda makan.",
        "arabic_text": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: دَخَلَ عَلَيَّ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ فَقَالَ: «هَلْ عِنْدَكُمْ شَيْءٌ؟» فَقُلْنَا: لَا قَالَ: «فَإِنِّي إِذًا صَائِمٌ» . ثُمَّ أَتَانَا يَوْمًا آخَرَ فَقُلْنَا: يَا رَسُولَ اللَّهِ أُهْدِيَ لَنَا حَيْسٌ فَقَالَ: «أَرِينِيهِ فَلَقَدْ أَصْبَحْتُ صَائِمًا» فَأَكَلَ. رَوَاهُ مُسلم"
      },
      {
        "id": 30771,
        "hadith_number": "2077",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi ﷺ Berpuasa dan Mendoakan Keluarga Ummu Sulaim",
        "perawi_melayu": "Anas (RA)",
        "english_text": "The Prophet (ﷺ) entered upon Umm Sulaim, and she brought him dates and clarified butter. He said: \"Put your clarified butter back in its container and your dates in their receptacle, for I am fasting.\" Then he went to a corner of the house and offered a prayer other than the obligatory one, and he invoked Allah for Umm Sulaim and the members of her household.",
        "malay_translation": "Nabi ﷺ masuk ke rumah Ummu Sulaim, dan dia menghidangkan baginda dengan kurma dan minyak sapi. Baginda bersabda: \"Kembalikan minyak sapi kamu ke dalam bekasnya dan kurma kamu ke dalam wadahnya, kerana aku sedang berpuasa.\" Kemudian baginda pergi ke sudut rumah dan menunaikan solat sunat, dan baginda berdoa untuk Ummu Sulaim dan ahli keluarganya.",
        "arabic_text": "وَعَنْ أَنَسٍ قَالَ: دَخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أُمِّ سُلَيْمٍ فَأَتَتْهُ بِتَمْرٍ وَسَمْنٍ فَقَالَ: «أَعِيدُوا سَمْنَكُمْ فِي سِقَائِهِ وَتَمْرَكُمْ فِي وِعَائِهِ فَإِنِّي صَائِمٌ» . ثُمَّ قَامَ إِلَى نَاحِيَةٍ مِنَ الْبَيْتِ فَصَلَّى غَيْرَ الْمَكْتُوبَةِ فَدَعَا لأم سليم وَأهل بَيتهَا. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 30772,
        "hadith_number": "2078",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Adab Menjawab Jemputan Ketika Berpuasa",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "N/A (Hadith in Arabic only)",
        "malay_translation": "Daripada Abu Hurairah رضي الله عنه berkata: Rasulullah صلى الله عليه وسلم bersabda: \"Apabila salah seorang di antara kamu dijemput ke majlis makan, sedangkan dia sedang berpuasa, hendaklah dia berkata: 'Sesungguhnya aku sedang berpuasa'. Dan dalam riwayat lain: \"Apabila salah seorang di antara kamu dijemput, hendaklah dia memenuhi jemputan itu. Jika dia sedang berpuasa, hendaklah dia mendoakan (keberkatan) dan jika dia tidak berpuasa, hendaklah dia makan.\" (Riwayat Muslim)",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا دُعِيَ أَحَدُكُمْ إِلَى طَعَامٍ وَهُوَ صَائِمٌ فَلْيَقُلْ: إِنِّي صَائِمٌ . وَفِي رِوَايَةٍ قَالَ: «إِذَا دُعِيَ أَحَدُكُمْ فَلْيُجِبْ فَإِنْ كَانَ صَائِمًا فَلْيُصَلِّ وَإِن كَانَ مُفطرا فيطعم» . رَوَاهُ مُسلم"
      },
      {
        "id": 30773,
        "hadith_number": "2079",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Membatalkan Puasa Sunat",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ummu Hani' RA, beliau berkata: Ketika hari pembukaan Kota Mekah, Fatimah datang lalu duduk di sebelah kiri Rasulullah SAW, dan Ummu Hani' di sebelah kanannya. Kemudian datang seorang anak perempuan dengan membawa bekas berisi minuman, lalu dia menghulurkannya kepada Rasulullah SAW. Baginda meminumnya, kemudian menghulurkannya kepada Ummu Hani', lalu dia meminumnya. Ummu Hani' berkata: Wahai Rasulullah, sesungguhnya aku telah berbuka, padahal aku sedang berpuasa. Baginda bersabda kepadanya: 'Adakah kamu sedang mengqadha' sesuatu?' Dia menjawab: Tidak. Baginda bersabda: 'Jika itu puasa sunat, maka tidak mengapa bagimu.' Riwayat Abu Daud, Tirmizi, dan Darimi. Dalam riwayat Ahmad dan Tirmizi yang serupa, di dalamnya disebutkan: Ummu Hani' berkata: Wahai Rasulullah, sesungguhnya aku sedang berpuasa. Baginda bersabda: 'Orang yang berpuasa adalah pemimpin dirinya sendiri; jika dia mahu, dia boleh berpuasa, dan jika dia mahu, dia boleh berbuka.'",
        "arabic_text": "عَنْ أُمِّ هَانِئٍ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: لَمَّا كَانَ يَوْمُ الْفَتْحِ فَتْحِ مَكَّةَ جَاءَتْ فَاطِمَةُ فَجَلَسَتْ عَلَى يَسَارِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَمُّ هَانِئٍ عَنْ يَمِينِهِ فَجَاءَتِ الْوَلِيدَةُ بِإِنَاءٍ فِيهِ شَرَابٌ فَنَاوَلَتْهُ فَشَرِبَ مِنْهُ ثُمَّ نَاوَلَهُ أُمَّ هَانِئٍ فَشَرِبَتْ مِنْهُ فَقَالَتْ: يَا رَسُولَ اللَّهِ لَقَدْ أَفْطَرْتُ وَكُنْتُ صَائِمَةً فَقَالَ لَهَا: «أَكُنْتِ تَقْضِينَ شَيْئًا؟» قَالَتْ: لَا. قَالَ: «فَلَا يَضُرُّكِ إِنْ كَانَ تَطَوُّعًا» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَالدَّارِمِيُّ وَفِي رِوَايَةٍ لِأَحْمَدَ وَالتِّرْمِذِيِّ نَحْوُهُ وَفِيهِ فَقَالَتْ: يَا رَسُولَ اللَّهِ أَمَا إِنِّي كُنْتُ صَائِمَةً فَقَالَ: «الصَّائِم أَمِيرُ نَفْسِهِ إِنْ شَاءَ صَامَ وَإِنْ شَاءَ أفطر»"
      },
      {
        "id": 30774,
        "hadith_number": "2080",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ganti Puasa yang Terbatal",
        "perawi_melayu": "Daripada Aisyah (RA)",
        "english_text": "Narrated from Al-Zuhri, from 'Urwa, from 'Aishah (RA) who said: I and Hafsah were fasting, then some food was presented to us, which we desired, so we ate from it. Hafsah said: O Messenger of Allah, we were fasting, then food was presented to us which we desired, so we ate from it. He said: “Make up another day in its place.” [At-Tirmidhi]. Some of the memorizers narrated from Al-Zuhri, from 'Aishah, mursal, without mentioning 'Urwah in it, and this is more authentic. Abu Dawud also narrated it from Zumail, the freed slave of 'Urwah, from 'Urwah, from 'Aishah.",
        "malay_translation": "Diriwayatkan daripada Az-Zuhri, daripada Urwah, daripada Aisyah (RA) berkata: Aku dan Hafsah sedang berpuasa, kemudian makanan dihidangkan kepada kami, kami menginginkannya, lalu kami memakannya. Hafsah berkata: Wahai Rasulullah, sesungguhnya kami sedang berpuasa, kemudian makanan dihidangkan kepada kami, kami menginginkannya, lalu kami memakannya. Baginda bersabda: “Gantilah puasa sehari yang lain sebagai gantinya.” [Riwayat At-Tirmizi]. Segolongan hafiz meriwayatkan daripada Az-Zuhri, daripada Aisyah secara mursal, tanpa menyebut Urwah di dalamnya, dan ini lebih sahih. Abu Daud juga meriwayatkannya daripada Zumail, hamba yang dimerdekakan Urwah, daripada Urwah, daripada Aisyah.",
        "arabic_text": "وَعَنِ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ: كُنْتُ أَنَا وَحَفْصَةُ صَائِمَتَيْنِ فَعَرَضَ لَنَا طَعَامٌ اشْتَهَيْنَاهُ فَأَكَلَنَا مِنْهُ فَقَالَتْ حَفْصَةُ: يَا رَسُولَ اللَّهِ إِنَّا كُنَّا صَائِمَتَيْنِ فَعُرِضَ لَنَا طَعَامٌ اشْتَهَيْنَاهُ فَأَكَلَنَا مِنْهُ. قَالَ: «اقْضِيَا يَوْمًا آخَرَ مَكَانَهُ» . رَوَاهُ التِّرْمِذِيُّ وَذَكَرَ جَمَاعَةً مِنَ الْحُفَّاظِ رَوَوْا عَنِ الزُّهْرِيِّ عَنْ عَائِشَةَ مُرْسَلًا وَلَمْ يذكرُوا فِيهِ عَن عُرْوَة وَهَذَا أصح وَرَوَاهُ أَبُو دَاوُدَ عَنْ زُمَيْلٍ مَوْلَى عُرْوَةَ عَن عُرْوَة عَن عَائِشَة"
      },
      {
        "id": 30775,
        "hadith_number": "2081",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Malaikat Berselawat ke Atas Orang Berpuasa yang Makan Bersama",
        "perawi_melayu": "Tiada maklumat perawi dalam data yang diberikan.",
        "english_text": "No English text provided.",
        "malay_translation": "Daripada Ummu 'Ammarah binti Ka'ab, sesungguhnya Nabi ﷺ masuk menemuinya, lalu dia menghidangkan makanan untuk baginda. Baginda bersabda kepadanya: \"Makanlah.\" Dia menjawab: \"Sesungguhnya saya berpuasa.\" Maka Nabi ﷺ bersabda: \"Sesungguhnya orang yang berpuasa, apabila makanan dimakan di sisinya, maka para malaikat berselawat ke atasnya sehingga mereka selesai.\" (Diriwayatkan oleh Ahmad, At-Tirmizi, Ibnu Majah dan Ad-Darimi)",
        "arabic_text": "وَعَن أم عمَارَة بنت كَعْب إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا فَدَعَتْ لَهُ بِطَعَامٍ فَقَالَ لَهَا: «كُلِي» . فَقَالَتْ: إِنِّي صَائِمَةٌ. فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الصَّائِمَ إِذَا أُكِلَ عِنْدَهُ صَلَّتْ عَلَيْهِ الْمَلَائِكَةُ حَتَّى يَفْرَغُوا» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيّ وَابْن مَاجَه والدارمي"
      },
      {
        "id": 30776,
        "hadith_number": "2082",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Berpuasa dan Keberkatan Makanan di Sisi Orang yang Berpuasa",
        "perawi_melayu": "Tidak Tersedia",
        "english_text": "Not Available",
        "malay_translation": "Daripada Buraidah RA berkata: Bilal masuk menemui Rasulullah SAW ketika baginda sedang bersarapan. Rasulullah SAW bersabda: \"Sarapanlah wahai Bilal.\" Bilal berkata: \"Sesungguhnya saya sedang berpuasa wahai Rasulullah.\" Rasulullah SAW bersabda: \"Kita makan rezeki kita, dan kelebihan rezeki Bilal di syurga. Adakah kamu tahu wahai Bilal bahawa orang yang berpuasa, tulang-tulangnya bertasbih dan para malaikat memohon ampun untuknya selagi ada makanan di sisinya?\" Riwayat al-Baihaqi dalam Syu'ab al-Iman.",
        "arabic_text": "عَن بُرَيْدَة قَالَ: دَخَلَ بِلَالٌ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَتَغَدَّى فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْغَدَاءَ يَا بِلَالُ» . قَالَ: إِنِّي صَائِمٌ يَا رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نَأْكُلُ رِزْقَنَا وَفَضْلُ رِزْقِ بِلَالٍ فِي الْجَنَّةِ أشعرت يَا بِلَال أَن الصَّائِم نُسَبِّح عِظَامه وَتَسْتَغْفِر لَهُ الْمَلَائِكَةُ مَا أَكَلَ عِنْدَهُ؟» . رَوَاهُ الْبَيْهَقِيُّ فِي شعب الْإِيمَان"
      },
      {
        "id": 30777,
        "hadith_number": "2083",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mencari Lailatul Qadar pada Malam Ganjil Sepuluh Terakhir Ramadan",
        "perawi_melayu": "Aisyah r.a.",
        "english_text": "Aishah (R.A.) reported: The Messenger of Allah (peace be upon him) said, \"Seek Lailatul Qadr in the odd nights of the last ten days of Ramadan.\" (Bukhari)",
        "malay_translation": "Daripada Aisyah r.a. berkata: Rasulullah SAW bersabda, \"Carilah Lailatul Qadar pada malam-malam ganjil sepuluh malam terakhir daripada bulan Ramadan.\" (Riwayat al-Bukhari)",
        "arabic_text": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَحَرَّوْا لَيْلَةَ الْقَدْرِ فِي الْوِتْرِ مِنَ الْعَشْرِ الْأَوَاخِرِ من رَمَضَان» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 30778,
        "hadith_number": "2084",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Malam Lailatul Qadar dalam Sepuluh Malam Terakhir Ramadhan",
        "perawi_melayu": "Ibnu 'Umar (Radiyallahu 'Anhu)",
        "english_text": "Narrated from Ibn 'Umar: A man from the Companions of the Prophet (peace and blessings of Allah be upon him) was shown the Night of Decree (Laylatul Qadr) in a dream during the last seven nights (of Ramadan). The Messenger of Allah (peace and blessings of Allah be upon him) said: 'I see that your dreams agree that it is in the last seven (nights). So whoever seeks it, let him seek it in the last seven.'",
        "malay_translation": "Diriwayatkan daripada Ibnu 'Umar (Radiyallahu 'Anhu): Seorang lelaki daripada kalangan sahabat Nabi (Sallallahu 'Alaihi Wasallam) telah diperlihatkan Malam Lailatul Qadar di dalam mimpi pada tujuh malam terakhir (Ramadhan). Rasulullah (Sallallahu 'Alaihi Wasallam) bersabda: 'Aku melihat bahawa mimpi-mimpi kamu semua telah bersetuju ia berada pada tujuh malam terakhir. Maka sesiapa yang ingin mencarinya, hendaklah dia mencarinya pada tujuh malam terakhir.'",
        "arabic_text": "وَعَن ابْن عمر قَالَ: أَنَّ رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُرُوا لَيْلَةَ الْقَدْرِ فِي الْمَنَامِ فِي السَّبْعِ الْأَوَاخِرِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَرَى رُؤْيَاكُمْ قَدْ تَوَاطَأَتْ فِي السَّبْعِ الْأَوَاخِرِ فَمَنْ كَانَ مُتَحَرِّيهَا فَلْيَتَحَرَّهَا فِي السَّبْعِ الْأَوَاخِر»"
      },
      {
        "id": 30779,
        "hadith_number": "2085",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mencari Lailatulqadar pada Sepuluh Malam Terakhir Ramadan",
        "perawi_melayu": "Ibnu Abbas RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Abbas RA, Nabi SAW bersabda: 'Carilah Lailatulqadar pada sepuluh malam terakhir Ramadan, (terutamanya) pada malam kesembilan yang masih berbaki, pada malam ketujuh yang masih berbaki, dan pada malam kelima yang masih berbaki.' (Riwayat al-Bukhari)",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: الْتَمِسُوهَا فِي الْعَشْرِ الْأَوَاخِرِ مِنْ رَمَضَانَ لَيْلَةَ الْقَدْرِ: فِي تَاسِعَةٍ تَبْقَى فِي سَابِعَةٍ تَبْقَى فِي خَامِسَةٍ تَبْقَى. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 30780,
        "hadith_number": "2086",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Beriktikaf dan Mencari Malam Lailatulqadar",
        "perawi_melayu": "Diriwayatkan daripada Abu Sa'id al-Khudri RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Sa'id al-Khudri RA, bahawa Rasulullah SAW beriktikaf pada sepuluh hari pertama bulan Ramadan, kemudian beriktikaf pada sepuluh hari pertengahan di dalam sebuah kubah Turki, kemudian Baginda menjenguk kepalanya dan bersabda: \"Sesungguhnya aku beriktikaf pada sepuluh hari pertama untuk mencari malam ini (Lailatulqadar), kemudian aku beriktikaf pada sepuluh hari pertengahan, kemudian aku didatangi dan dikatakan kepadaku bahawa ia (Lailatulqadar) berada pada sepuluh hari terakhir. Maka sesiapa yang beriktikaf bersamaku, hendaklah dia beriktikaf pada sepuluh hari terakhir. Sesungguhnya aku telah diperlihatkan malam ini, kemudian aku dilupakan mengenainya, dan aku melihat diriku sujud di dalam air dan tanah pada pagi harinya. Maka carilah ia pada sepuluh hari terakhir dan carilah ia pada setiap malam ganjil.\" Abu Sa'id berkata: Maka hujan turun pada malam itu dan masjid itu beratap pelepah, maka masjid itu menitiskan air. Maka kedua mataku melihat Rasulullah SAW dan di dahinya terdapat kesan air dan tanah, dan air itu dari pagi hari ke-21. Muttafaq 'alaih dari segi makna dan lafaz bagi Muslim hingga perkataannya: 'Dikatakan kepadaku: Sesungguhnya ia berada pada sepuluh hari terakhir.' Baki riwayat adalah daripada Bukhari.",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُمْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اعْتَكَفَ الْعَشْرَ الْأَوَّلَ مِنْ رَمَضَانَ ثُمَّ اعْتَكَفَ الْعَشْرَ الْأَوْسَطَ فِي قُبَّةٍ تُرْكِيَّةٍ ثُمَّ أَطْلَعَ رَأسه. فَقَالَ: «إِنِّي اعتكفت الْعشْر الأول ألتمس هَذِه اللَّيْلَة ثمَّ اعتكفت الْعَشْرَ الْأَوْسَطَ ثُمَّ أُتِيتُ فَقِيلَ لِي إِنَّهَا فِي الْعشْر الْأَوَاخِر فَمن اعْتَكَفْ مَعِي فَلْيَعْتَكِفِ الْعَشْرَ الْأَوَاخِرَ فَقَدْ أُرِيتُ هَذِهِ اللَّيْلَةَ ثُمَّ أُنْسِيتُهَا وَقَدْ رَأَيْتُنِي أَسْجُدُ فِي مَاءٍ وَطِينٍ مِنْ صَبِيحَتِهَا فَالْتَمِسُوهَا فِي الْعَشْرِ الْأَوَاخِرِ وَالْتَمِسُوهَا فِي كُلِّ وِتْرٍ» . قَالَ: فَمَطَرَتِ السَّمَاءُ تِلْكَ اللَّيْلَةَ وَكَانَ الْمَسْجِدُ عَلَى عَرِيشٍ فَوَكَفَ الْمَسْجِدُ فَبَصُرَتْ عَيْنَايَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَى جَبْهَتِهِ أَثَرُ المَاء والطين وَالْمَاء مِنْ صَبِيحَةِ إِحْدَى وَعِشْرِينَ. مُتَّفَقٌ عَلَيْهِ فِي الْمَعْنَى وَاللَّفْظُ لِمُسْلِمٍ إِلَى قَوْلِهِ: فَقِيلَ لِي: إِنَّهَا فِي الْعشْر الْأَوَاخِر . وَالْبَاقِي للْبُخَارِيّ"
      },
      {
        "id": 30781,
        "hadith_number": "2087",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Malam Lailatul Qadar: Riwayat Abdullah bin Unais",
        "perawi_melayu": "Tiada maklumat",
        "english_text": "Tiada maklumat",
        "malay_translation": "Dalam riwayat Abdullah bin Unais, beliau berkata: \"Malam dua puluh tiga\". Diriwayatkan oleh Muslim.",
        "arabic_text": "وَفِي رِوَايَةِ عَبْدِ اللَّهِ بْنِ أُنَيْسٍ قَالَ: «لَيْلَة ثَلَاث وَعشْرين» . رَوَاهُ مُسلم"
      },
      {
        "id": 30782,
        "hadith_number": "2088",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penjelasan tentang Malam Al-Qadar dan Tandanya",
        "perawi_melayu": "Diriwayatkan dari Zirr bin Hubaish",
        "english_text": "Not Available",
        "malay_translation": "Daripada Zirr bin Hubaish, beliau berkata: Saya bertanya kepada Ubay bin Ka'ab dan berkata: Sesungguhnya saudaramu, Ibnu Mas'ud, berkata: Sesiapa yang mendirikan (solat) sepanjang tahun, dia akan menemui Lailatul Qadar. Maka Ubay berkata: Dia (Ibnu Mas'ud) bermaksud agar orang ramai tidak bersandar (hanya pada satu malam). Ketahuilah bahawa dia (Ibnu Mas'ud) telah mengetahui bahawa ia (Lailatul Qadar) berada di bulan Ramadhan, dan ia berada di sepuluh malam terakhir, dan ia adalah malam ke-27. Kemudian beliau bersumpah tanpa pengecualian bahawa ia adalah malam ke-27. Saya bertanya: Dengan apa engkau mengatakan demikian, wahai Abu al-Munzir? Beliau menjawab: Dengan tanda atau ayat yang telah diberitahukan oleh Rasulullah SAW kepada kami, bahawa matahari terbit pada hari itu tanpa pancaran (sinar). (Riwayat Muslim)",
        "arabic_text": "وَعَنْ زِرِّ بْنِ حُبَيْشٍ قَالَ: سَأَلْتُ أُبَيَّ بْنَ كَعْبٍ فَقُلْتُ إِنَّ أَخَاكَ ابْنَ مَسْعُودٍ يَقُولُ: مَنْ يَقُمِ الْحَوْلَ يُصِبْ لَيْلَةَ الْقَدْرِ. فَقَالَ C أَرَادَ أَنْ لَا يَتَّكِلَ النَّاسُ أَمَا إِنَّهُ قَدْ عَلِمَ أَنَّهَا فِي رَمَضَانَ وَأَنَّهَا فِي الْعَشْرِ الْأَوَاخِرِ وَأَنَّهَا لَيْلَةُ سَبْعٍ وَعِشْرِينَ ثُمَّ حَلَفَ لَا يَسْتَثْنِي أَنَّهَا لَيْلَةُ سَبْعٍ وَعِشْرِينَ. فَقُلْتُ: بِأَيِّ شَيْءٍ تَقُولُ ذَلِكَ يَا أَبَا الْمُنْذِرِ؟ قَالَ: بِالْعَلَامَةِ أَوْ بِالْآيَةِ الَّتِي أَخْبَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهَا تَطْلُعُ يَوْمَئِذٍ لَا شُعَاعَ لَهَا. رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 30783,
        "hadith_number": "2089",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah S.A.W. Meningkatkan Ibadah di Sepuluh Malam Terakhir Ramadan",
        "perawi_melayu": "Aisyah R.A.",
        "english_text": " وعن عائشة رضي الله عنها قالت: كان رسول الله صلى الله عليه وسلم يجتهد في العشر الأواخر ما لا يجتهد في غيره. رواه مسلم",
        "malay_translation": "Daripada Aisyah R.A., beliau berkata: Rasulullah S.A.W. bersungguh-sungguh (beribadah) pada sepuluh malam terakhir (Ramadan) melebihi kesungguhan baginda pada waktu yang lain. Riwayat Muslim.",
        "arabic_text": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَجْتَهِدُ فِي الْعَشْرِ الْأَوَاخِرِ مَا لَا يَجْتَهِدُ فِي غَيره. رَوَاهُ مُسلم"
      },
      {
        "id": 30784,
        "hadith_number": "2090",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW bersungguh-sungguh di Sepuluh Malam Terakhir Ramadhan",
        "perawi_melayu": "Not Available",
        "english_text": "Not Available",
        "malay_translation": "Daripada Aisyah RA, beliau berkata: Apabila masuk sepuluh (malam terakhir Ramadhan), Rasulullah SAW mengencangkan kainnya (bersungguh-sungguh dalam ibadah), menghidupkan malamnya (dengan ibadah), dan membangunkan keluarganya.",
        "arabic_text": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ الْعَشْرُ شَدَّ مِئْزَرَهُ وَأَحْيَا ليله وَأَيْقَظَ أَهله"
      },
      {
        "id": 30785,
        "hadith_number": "2091",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Doa yang Dibaca pada Malam Lailatulqadar",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Aisyah RA, beliau berkata: Aku bertanya: Wahai Rasulullah, bagaimana pendapatmu jika aku tahu malam Lailatulqadar, apakah yang patut aku ucapkan padanya? Baginda bersabda: Ucapkanlah: 'Ya Allah, sesungguhnya Engkau Maha Pemaaf, Engkau sukakan pengampunan, maka ampunilah aku.' (Riwayat Ahmad, Ibnu Majah, dan Tirmidzi, dan beliau mensahihkannya)",
        "arabic_text": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قُلْتُ: يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ عَلِمْتُ أَيُّ لَيْلَةٍ الْقَدْرِ مَا أَقُولُ فِيهَا؟ قَالَ: قُولِي: اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعَفُ عَنِّي . رَوَاهُ أَحْمد وَابْن مَاجَه وَالتِّرْمِذِيّ وَصَححهُ"
      },
      {
        "id": 30786,
        "hadith_number": "2092",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mencari Lailatulqadar pada Malam-Malam Ganjil Terakhir Ramadan",
        "perawi_melayu": "Diriwayatkan daripada Abu Bakrah RA, beliau berkata: Aku mendengar Rasulullah SAW bersabda: \"Carilah ia (yakni Lailatulqadar) pada sembilan malam yang tersisa, atau pada tujuh malam yang tersisa, atau pada lima malam yang tersisa, atau tiga malam, atau malam terakhir.\"",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Bakrah RA, beliau berkata: Aku mendengar Rasulullah SAW bersabda: \"Carilah ia (yakni Lailatulqadar) pada sembilan malam yang tersisa, atau pada tujuh malam yang tersisa, atau pada lima malam yang tersisa, atau tiga malam, atau malam terakhir.\" (Riwayat Tirmidzi)",
        "arabic_text": "وَعَنْ أَبِي بَكْرَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «الْتَمِسُوهَا يَعْنَى لَيْلَة الْقدر فِي تسع بَقينَ أَو فِي سبع بَقينَ أَو فِي خمس بَقينَ أَوْ ثَلَاثٍ أَوْ آخِرِ لَيْلَةٍ» . رَوَاهُ التِّرْمِذِيُّ"
      },
      {
        "id": 30787,
        "hadith_number": "2093",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keberadaan Lailatul Qadar Setiap Ramadan",
        "perawi_melayu": "Ibnu Umar",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Umar RA, beliau berkata: Rasulullah SAW ditanya tentang Lailatul Qadar, lalu Baginda bersabda: “Ia (Lailatul Qadar) berada pada setiap Ramadan.”  Riwayat Abu Daud. Beliau berkata: Sufyan dan Syu'bah meriwayatkannya daripada Abu Ishaq sebagai mauquf kepada Ibnu Umar.",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ قَالَ: سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لَيْلَةِ الْقَدْرِ فَقَالَ: «هِيَ فِي كُلِّ رَمَضَانَ» . رَوَاهُ أَبُو دَاوُد وَقَالَ: رَوَاهُ سُفْيَان وَشعْبَة عَن أبي إِسْحَق مَوْقُوفا على ابْن عمر"
      },
      {
        "id": 30788,
        "hadith_number": "2094",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Anjuran Rasulullah SAW untuk Menghidupkan Malam 23 Ramadhan di Masjid",
        "perawi_melayu": "Abdullah bin Unais (RA)",
        "english_text": "The Hadith text is in Arabic, and there is no direct English translation provided. Therefore, the malay_translation will be a translation of the Arabic text.",
        "malay_translation": "Daripada Abdullah bin Unais (RA) berkata: “Aku berkata: “Wahai Rasulullah! Sesungguhnya aku berada di kawasan pedalaman, dan aku bersolat di sana. Oleh itu, perintahkanlah aku pada suatu malam untuk aku turun ke masjid ini.” Baginda bersabda: “Turunlah pada malam 23 (Ramadhan).” Dikatakan kepada anak lelaki Abdullah: “Bagaimanakah ayahmu melakukannya?” Dia menjawab: “Ayahku masuk ke dalam masjid selepas solat Asar, dan dia tidak keluar daripadanya kerana keperluan sehingga dia menunaikan solat Subuh. Apabila dia menunaikan solat Subuh, dia mendapati haiwannya (untuk tunggangan) di pintu masjid, lalu dia menungganginya dan kembali ke pedalamannya.” Diriwayatkan oleh Abu Daud.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ أُنَيْسٍ قَالَ: قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ لِي بَادِيَةً أَكُونُ فِيهَا وَأَنا أُصَلِّي فِيهَا بِحَمْد الله فَمُرْنِي بِلَيْلَةٍ أَنْزِلُهَا إِلَى هَذَا الْمَسْجِدِ فَقَالَ: «انْزِلْ لَيْلَة ثَلَاث وَعشْرين» . قيل لِابْنِهِ: كَيْفَ كَانَ أَبُوكَ يَصْنَعُ؟ قَالَ: كَانَ يَدْخُلُ الْمَسْجِدَ إِذَا صَلَّى الْعَصْرَ فَلَا يَخْرُجُ مِنْهُ لِحَاجَةٍ حَتَّى يُصَلِّيَ الصُّبْحَ فَإِذَا صَلَّى الصُّبْحَ وَجَدَ دَابَّتَهُ عَلَى بَابِ الْمَسْجِدِ فَجَلَسَ عَلَيْهَا وَلحق بباديته. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 30789,
        "hadith_number": "2095",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kehilangan Pengetahuan Malam Lailatul Qadar Disebabkan Pertelingkahan",
        "perawi_melayu": "Ubadah bin As-Samit",
        "english_text": "The Prophet (peace be upon him) came out to inform us about the Night of Decree, but two Muslims were quarreling. He said, \"I came out to inform you about the Night of Decree, but such and such persons were quarreling, so its knowledge was taken away (from me). Perhaps it is better for you. Seek it on the ninth, seventh and fifth (nights).\" (Bukhari)",
        "malay_translation": "Daripada Ubadah bin As-Samit, beliau berkata: Nabi ﷺ keluar untuk memberitahu kami tentang malam Lailatul Qadar, tetapi dua orang lelaki Muslim bertengkar. Baginda bersabda: \"Aku keluar untuk memberitahu kamu tentang malam Lailatul Qadar, tetapi si fulan dan si fulan telah bertengkar, lalu pengetahuan mengenainya diangkat (dariku). Mungkin ia lebih baik untuk kamu. Carilah ia pada malam kesembilan, ketujuh dan kelima (dari sepuluh malam terakhir Ramadhan).\" (Riwayat Bukhari)",
        "arabic_text": "عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ: خَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيُخْبِرَنَا بِلَيْلَةِ الْقَدْرِ فَتَلَاحَى رَجُلَانِ مِنَ الْمُسْلِمِينَ فَقَالَ: «خَرَجْتُ لِأُخْبِرَكُمْ بِلَيْلَةِ الْقَدْرِ فَتَلَاحَى فُلَانٌ وَفُلَانٌ فَرُفِعَتْ وَعَسَى أَنْ يَكُونَ خَيْرًا لَكُمْ فَالْتَمِسُوهَا فِي التَّاسِعَةِ وَالسَّابِعَة وَالْخَامِسَة» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 30790,
        "hadith_number": "2096",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Malam Al-Qadar dan Ganjaran Hari Raya",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Anas RA, Rasulullah SAW bersabda: Apabila tiba Malam Al-Qadar, Jibril AS turun bersama sekumpulan malaikat, mereka berselawat ke atas setiap hamba yang berdiri atau duduk mengingati Allah 'Azza wa Jalla. Apabila tiba hari raya mereka, iaitu hari fitrah mereka, Allah membanggakan mereka kepada para malaikat-Nya, lalu berfirman: Wahai malaikat-Ku, apakah balasan bagi seorang pekerja yang telah menyempurnakan pekerjaannya? Mereka berkata: Wahai Tuhan kami, balasannya adalah agar disempurnakan pahalanya. Allah berfirman: Malaikat-Ku, hamba-hamba-Ku (lelaki dan perempuan) telah menunaikan kewajipan-Ku ke atas mereka, kemudian mereka keluar untuk berdoa. Demi kemuliaan, keagungan, kemurahan, ketinggian dan kedudukan-Ku yang tinggi, Aku pasti akan mengabulkan doa mereka. Lalu Allah berfirman: Kembalilah, sesungguhnya Aku telah mengampunkan kamu dan menukarkan keburukan kamu menjadi kebaikan. Anas berkata: Maka mereka kembali dalam keadaan telah diampunkan. (Riwayat al-Baihaqi dalam Syu'ab al-Iman)",
        "arabic_text": "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا كَانَ لَيْلَةُ الْقَدْرِ نزل جِبْرِيل عَلَيْهِ السَّلَام فِي كُبْكُبَةٍ مِنَ الْمَلَائِكَةِ يُصَلُّونَ عَلَى كُلِّ عَبْدٍ قَائِمٍ أَوْ قَاعِدٍ يَذْكُرُ اللَّهَ عَزَّ وَجَلَّ فَإِذَا كَانَ يَوْمُ عِيدِهِمْ يَعْنِي يَوْمَ فِطْرِهِمْ بَاهَى بِهِمْ مَلَائِكَتَهُ فَقَالَ: يَا مَلَائِكَتِي مَا جَزَاءُ أَجِيرٍ وَفَّى عَمَلَهُ؟ قَالُوا: رَبَّنَا جَزَاؤُهُ أَنْ يُوَفَّى أَجْرَهُ. قَالَ: مَلَائِكَتِي عَبِيدِي وَإِمَائِي قَضَوْا فَرِيضَتِي عَلَيْهِمْ ثُمَّ خَرَجُوا يَعُجُّونَ إِلَى الدُّعَاءِ وَعِزَّتِي وَجَلَالِي وَكَرَمِي وَعُلُوِّي وَارْتِفَاعِ مَكَاني لأجيبنهم. فَيَقُول: ارْجعُوا فقد غَفَرْتُ لَكُمْ وَبَدَّلْتُ سَيِّئَاتِكُمْ حَسَنَاتٍ. قَالَ: فَيَرْجِعُونَ مَغْفُورًا لَهُمْ . رَوَاهُ الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ"
      },
      {
        "id": 30791,
        "hadith_number": "2097",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Amalan Iktikaf Nabi Muhammad SAW pada Sepuluh Hari Terakhir Ramadan",
        "perawi_melayu": "Diriwayatkan daripada Aisyah R.A.",
        "english_text": "Narrated from Aisha: The Prophet (peace and blessings of Allah be upon him) used to perform I'tikaf in the last ten days of Ramadan until Allah caused him to die, then his wives performed I'tikaf after him.",
        "malay_translation": "Diriwayatkan daripada Aisyah R.A.: Sesungguhnya Nabi Muhammad SAW beri'tikaf pada sepuluh hari terakhir bulan Ramadan sehingga Allah SWT mewafatkan baginda. Kemudian, isteri-isteri baginda beri'tikaf selepas kewafatan baginda.",
        "arabic_text": "وَعَنْ عَائِشَةَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَعْتَكِفُ الْعَشْرَ الْأَوَاخِرَ مِنْ رَمَضَانَ حَتَّى تَوَفَّاهُ اللَّهُ ثُمَّ اعْتَكَفَ أَزْوَاجُهُ مِنْ بعده"
      },
      {
        "id": 30792,
        "hadith_number": "2098",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kedermawanan Rasulullah SAW di Bulan Ramadan",
        "perawi_melayu": "Diriwayatkan dari Ibnu Abbas RA",
        "english_text": " وعن ابن عباس قال: كان رسول الله صلى الله عليه وسلم أجود الناس بالخير وكان أجود ما يكون في رمضان وكان جبريل يلقاه كل ليلة في رمضان يعرض عليه النبي صلى الله عليه وسلم القرآن فإذا لقيه جبريل كان أجود بالخير من الريح المرسلة",
        "malay_translation": "Diriwayatkan daripada Ibnu Abbas RA, beliau berkata: Rasulullah SAW adalah orang yang paling dermawan dalam melakukan kebaikan, dan baginda menjadi lebih dermawan lagi di bulan Ramadan. Jibril AS menemui baginda setiap malam di bulan Ramadan untuk bertadarus Al-Quran bersama Nabi SAW. Apabila Jibril AS menemui baginda, baginda menjadi lebih dermawan dalam kebaikan daripada angin yang bertiup kencang.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَجْوَدَ النَّاسِ بِالْخَيْرِ وَكَانَ أَجْوَدَ مَا يَكُونُ فِي رَمَضَان وَكَانَ جِبْرِيلُ يَلْقَاهُ كُلَّ لَيْلَةٍ فِي رَمَضَانَ يَعْرِضُ عَلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْقُرْآنَ فَإِذَا لَقِيَهُ جِبْرِيلُ كَانَ أَجْوَدُ بِالْخَيْرِ مِنَ الرّيح الْمُرْسلَة"
      },
      {
        "id": 30793,
        "hadith_number": "2099",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah S.A.W. Menyemak Al-Quran Setiap Tahun dan Iktikaf Lebih Lama Sebelum Wafat",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah R.A.",
        "english_text": "Narrated by Abu Hurairah: The Prophet (peace and blessings of Allah be upon him) used to have the Quran recited to him once every year, but it was recited to him twice in the year in which he died. He used to seclude himself in the mosque for ten days every year, but in the year in which he died he secluded himself for twenty days. Related by Bukhari.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah R.A.: Nabi S.A.W. biasanya memperdengarkan bacaan Al-Quran kepadanya sekali setiap tahun, tetapi ia diperdengarkan kepadanya dua kali pada tahun baginda wafat. Baginda S.A.W. biasanya beriktikaf di masjid selama sepuluh hari setiap tahun, tetapi pada tahun baginda wafat, baginda beriktikaf selama dua puluh hari. (Riwayat Bukhari).",
        "arabic_text": "وَعَن أبي هُرَيْرَة قَالَ: كَانَ يعرض على النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْقُرْآنَ كُلَّ عَامٍ مَرَّةً فَعَرَضَ عَلَيْهِ مَرَّتَيْنِ فِي الْعَامِ الَّذِي قُبِضَ وَكَانَ يَعْتَكِفُ كُلَّ عَامٍ عَشْرًا فَاعْتَكَفَ عِشْرِينَ فِي الْعَامِ الَّذِي قُبِضَ. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 30794,
        "hadith_number": "2100",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Mendekatkan Kepala Ketika Beriktikaf untuk Disisir",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Aisyah R.A berkata: Adalah Rasulullah SAW apabila beriktikaf, baginda mendekatkan kepalanya kepadaku ketika berada di dalam masjid, lalu aku menyisirnya. Dan baginda tidak masuk ke rumah kecuali untuk hajat manusia (buang air).",
        "arabic_text": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اعْتَكَفَ أَدْنَى إِلَيَّ رَأَسَهِ وَهُوَ فِي الْمَسْجِدِ فَأُرَجِّلُهُ وَكَانَ لَا يَدْخُلُ الْبَيْتَ إِلَّا لحَاجَة الْإِنْسَان"
      },
      {
        "id": 30795,
        "hadith_number": "2101",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Umar Memenuhi Nazar I'tikaf di Masjidil Haram",
        "perawi_melayu": "Ibnu Umar",
        "english_text": "Narrated from Ibn 'Umar: 'Umar asked the Prophet (peace and blessings of Allah be upon him): 'I had vowed in the time of ignorance to perform I'tikaf for a night in the Sacred Mosque.' He (the Prophet) said: 'Fulfill your vow.'",
        "malay_translation": "Diriwayatkan daripada Ibnu Umar: Umar bertanya kepada Nabi (s.a.w): 'Saya pernah bernazar pada zaman jahiliah untuk beri'tikaf semalam di Masjidil Haram.' Baginda (Nabi) bersabda: 'Penuhilah nazarmu.'",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ: أَنَّ عُمَرَ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: كُنْتُ نَذَرْتُ فِي الْجَاهِلِيَّةِ أَنْ أَعْتَكِفَ لَيْلَةً فِي الْمَسْجِد الْحَرَام؟ قَالَ: «فأوف بِنَذْرِك»"
      },
      {
        "id": 30796,
        "hadith_number": "2102",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi ﷺ Beriktikaf pada Sepuluh Hari Terakhir Ramadan dan Menggantikannya",
        "perawi_melayu": "Anas meriwayatkan",
        "english_text": "Narrated Anas: The Prophet ﷺ used to observe I'tikaf in the last ten days of Ramadan, but he did not observe I'tikaf one year. So when the following year came, he observed twenty.",
        "malay_translation": "Daripada Anas RA, beliau berkata: Nabi ﷺ biasa beriktikaf pada sepuluh hari terakhir bulan Ramadan. Pada suatu tahun, baginda tidak beriktikaf. Maka, pada tahun berikutnya, baginda beriktikaf selama dua puluh hari. (Riwayat Tirmizi)",
        "arabic_text": "عَنْ أَنَسٍ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْتَكِفُ فِي الْعَشْرِ الْأَوَاخِرِ مِنْ رَمَضَانَ فَلَمْ يَعْتَكِفْ عَامًا. فَلَمَّا كَانَ الْعَامُ الْمقبل اعْتكف عشْرين. رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 30797,
        "hadith_number": "2103",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis Riwayat Abu Daud dan Ibnu Majah dari Abi bin Ka'b",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Riwayat oleh Abu Daud dan Ibnu Majah dari Abi bin Ka'b",
        "malay_translation": "Diriwayatkan oleh Abu Daud dan Ibnu Majah daripada Abi bin Ka'b.",
        "arabic_text": "وَرَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ عَنْ أَبِي بن كَعْب"
      },
      {
        "id": 30798,
        "hadith_number": "2104",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Memulakan I'tikaf Selepas Solat Subuh",
        "perawi_melayu": "Diriwayatkan daripada Aisyah RA, beliau berkata:",
        "english_text": "وعن عائشة رضي الله عنها قالت: كان رسول الله صلى الله عليه وسلم إذا أراد أن يعتكف صلى الفجر ثم دخل في معتكفه. رواه أبو داود وابن ماجه",
        "malay_translation": "Daripada Aisyah RA, beliau berkata: \"Rasulullah SAW apabila hendak beri'tikaf, Baginda solat Subuh kemudian masuk ke tempat i'tikafnya.\" (Riwayat Abu Daud dan Ibnu Majah)",
        "arabic_text": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ أَنْ يَعْتَكِفَ صَلَّى الْفَجْرَ ثُمَّ دَخَلَ فِي مُعْتَكَفِهِ. رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ"
      },
      {
        "id": 30799,
        "hadith_number": "2105",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menziarahi Orang Sakit Semasa I'tikaf",
        "perawi_melayu": "Aisyah R.A.",
        "english_text": "Not Available",
        "malay_translation": "Daripada Aisyah R.A., beliau berkata: Nabi SAW menziarahi orang sakit ketika sedang beriktikaf. Baginda akan lalu sahaja tanpa berhenti untuk bertanya khabar.",
        "arabic_text": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعُودُ الْمَرِيضَ وَهُوَ مُعْتَكِفٌ فَيَمُرُّ كَمَا هُوَ فَلَا يُعَرِّجُ يَسْأَلُ عَنْهُ. رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ"
      },
      {
        "id": 30800,
        "hadith_number": "2106",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Sunnah Bagi Orang yang Beriktikaf",
        "perawi_melayu": "Aishah (رَضِيَ اللَّهُ عَنْهَا)",
        "english_text": "Aishah (RA) reported: The Sunnah for one observing I'tikaf is not to visit the sick, not to attend a funeral, not to touch a woman, not to have sexual intercourse with her, and not to go out for any need except for that which is absolutely necessary. There is no I'tikaf except with fasting, and there is no I'tikaf except in a congregational mosque. (Abu Dawood)",
        "malay_translation": "Daripada Aishah (رَضِيَ اللَّهُ عَنْهَا) berkata: Sunnah bagi orang yang beriktikaf ialah tidak menziarahi orang sakit, tidak menghadiri jenazah, tidak menyentuh perempuan, tidak melakukan persetubuhan dengannya, dan tidak keluar untuk sebarang keperluan melainkan apa yang sangat perlu. Tiada i'tikaf melainkan dengan puasa, dan tiada i'tikaf melainkan di masjid jami'. (Riwayat Abu Daud)",
        "arabic_text": "وَعَن عَائِشَة رَضِي الله عَنْهَا قَالَتْ: السُّنَّةُ عَلَى الْمُعْتَكِفِ أَنْ لَا يَعُودَ مَرِيضًا وَلَا يَشْهَدُ جِنَازَةً وَلَا يَمَسُّ الْمَرْأَةَ وَلَا يُبَاشِرُهَا وَلَا يَخْرُجُ لِحَاجَةٍ إِلَّا لِمَا لابد مِنْهُ وَلَا اعْتِكَافَ إِلَّا بِصَوْمٍ وَلَا اعْتِكَافَ إِلَّا فِي مَسْجِدٍ جَامِعٍ. رَوَاهُ أَبُو دَاوُدَ"
      },
      {
        "id": 30801,
        "hadith_number": "2107",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Beriktikaf: Tempat Tidur Baginda di Belakang Tiang Taubat",
        "perawi_melayu": "Diriwayatkan daripada Ibnu Umar RA, daripada Nabi SAW bahawasanya apabila Baginda beriktikaf, dihamparkan untuk Baginda tempat tidurnya atau diletakkan untuk Baginda katilnya di belakang tiang taubat.  Riwayat Ibnu Majah.",
        "english_text": "Narrated Ibn Umar: The Prophet (peace and blessings of Allah be upon him) used to have his bed spread out for him or his bed placed behind the Pillar of Repentance when he observed i'tikaf. Narrated by Ibn Majah.",
        "malay_translation": "Diriwayatkan daripada Ibnu Umar RA: Nabi SAW biasanya dihamparkan tempat tidurnya atau diletakkan katilnya di belakang Tiang Taubat ketika Baginda melakukan i'tikaf. Riwayat Ibnu Majah.",
        "arabic_text": "عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ إِذَا اعْتَكَفَ طُرِحَ لَهُ فِرَاشُهُ أَوْ يُوضَعُ لَهُ سَرِيرُهُ وَرَاءَ أسطوانه التَّوْبَة. رَوَاهُ ابْن مَاجَه"
      },
      {
        "id": 30802,
        "hadith_number": "2108",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pahala I'tikaf: Mengurangkan Dosa, Menggandakan Pahala",
        "perawi_melayu": "Ibnu Abbas",
        "english_text": "The Prophet (peace be upon him) said about the one observing I'tikaf: 'He detaches himself from sins, and for him are recorded good deeds as if he has performed all of them'.",
        "malay_translation": "Rasulullah ﷺ bersabda mengenai orang yang beriktikaf: 'Dia menjauhi diri daripada dosa-dosa, dan dicatatkan baginya ganjaran kebaikan seolah-olah dia telah melakukan semua kebaikan'. (Riwayat Ibnu Majah)",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْمُعْتَكَفِ: «هُوَ يَعْتَكِفُ الذُّنُوبَ وَيُجْرَى لَهُ مِنَ الْحَسَنَاتِ كَعَامِلِ الْحَسَنَات كلهَا» . رَوَاهُ ابْن مَاجَه"
      }
    ]
  }
}