{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 109,
    "data": [
      {
        "id": 32140,
        "hadith_number": "3446",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keharaman Mengambil Nyawa Muslim",
        "perawi_melayu": "Abdullah bin Mas'ud",
        "english_text": "From Abdullah ibn Mas'ud, who said: The Messenger of Allah (peace and blessings be upon him) said: \"It is not permissible to take the life of a Muslim who bears witness that there is no god but Allah and that I am the Messenger of Allah, except in one of three cases: the life for a life, the married person who commits adultery, and the one who abandons his religion and leaves the community.\"",
        "malay_translation": "Daripada Abdullah bin Mas'ud, katanya: Rasulullah SAW bersabda:  \"Tidak halal membunuh seorang Muslim yang bersaksi bahawa tiada Tuhan melainkan Allah dan bahawa aku adalah utusan Allah, melainkan dalam tiga keadaan sahaja: nyawa dibalas dengan nyawa, orang yang berzina yang telah berkahwin, dan orang yang murtad daripada agamanya serta meninggalkan jamaah.\"",
        "arabic_text": "عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنِّي رَسُولُ اللَّهِ إِلَّا بِإِحْدَى ثَلَاثٍ: النَّفْسُ بِالنَّفْسِ وَالثَّيِّبُ الزَّانِي وَالْمَارِقُ لدينِهِ التَّارِكُ للجماعةِ"
      },
      {
        "id": 32141,
        "hadith_number": "3447",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kebebasan dalam Agama Orang Mukmin",
        "perawi_melayu": "Ibn Umar",
        "english_text": "From Ibn Umar, he said: The Messenger of Allah (peace and blessings be upon him) said: \"The believer will remain in the spaciousness of his religion as long as he does not shed unlawful blood.\"",
        "malay_translation": "Daripada Ibnu Umar, beliau berkata: Rasulullah SAW bersabda:  \"Seseorang mukmin akan sentiasa berada dalam keluasan agamanya selagi dia tidak menumpahkan darah yang haram.\"",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَنْ يَزَالَ الْمُؤْمِنُ فِي فُسْحَةٍ مِنْ دِينِهِ مَا لَمْ يُصِبْ دَمًا حَرَامًا» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32142,
        "hadith_number": "3448",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hisab Pertama di Hari Kiamat: Darah",
        "perawi_melayu": "Abdullah bin Mas'ud",
        "english_text": "From Abdullah ibn Mas'ud, who said: The Messenger of Allah (ﷺ) said: \"The first thing that will be judged between people on the Day of Resurrection is blood.\"",
        "malay_translation": "Daripada Abdullah bin Mas'ud, yang berkata: Rasulullah SAW bersabda:  \"Perkara pertama yang akan dihisab di antara manusia pada hari kiamat ialah darah.\"",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَوَّلُ مَا يُقْضَى بَيْنَ النَّاسِ يَوْمَ الْقِيَامَةِ فِي الدِّمَاء»"
      },
      {
        "id": 32143,
        "hadith_number": "3449",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan membunuh musuh yang mengucap kalimah syahadah",
        "perawi_melayu": "Al-Miqdad bin Al-Aswad",
        "english_text": "And from Al-Miqdad bin Al-Aswad, that he said: O Messenger of Allah, if I meet a man from the disbelievers and we fight, and he strikes one of my hands with a sword and cuts it off, then he seeks refuge with a tree, and says: I bear witness that there is no god but Allah. In another narration: When I was about to kill him, he said: There is no god but Allah. Should I kill him after he said that? He said: Do not kill him. He said: O Messenger of Allah, he cut off one of my hands. The Messenger of Allah (ﷺ) said: Do not kill him, for if you kill him, then he is at your level before you killed him, and you are at his level before he said the words that he said.",
        "malay_translation": "Daripada Al-Miqdad bin Al-Aswad, bahawa baginda berkata: Wahai Rasulullah, jika aku bertemu dengan seorang lelaki daripada golongan kafir lalu kami berperang, dan dia memukul salah satu tanganku dengan pedang lalu memutuskan tangan tersebut, kemudian dia berlindung di sebatang pokok dan berkata: Aku bersaksi bahawa tiada Tuhan melainkan Allah. Dalam riwayat lain: Ketika aku hendak membunuhnya, dia berkata: Tiada Tuhan melainkan Allah. Patutkah aku membunuhnya setelah dia mengucapkannya? Baginda berkata: Jangan bunuh dia. Dia berkata: Wahai Rasulullah, dia telah memutuskan salah satu tanganku. Rasulullah SAW bersabda: Jangan bunuh dia, kerana jika engkau membunuhnya, maka dia berada di tahap seperti engkau sebelum engkau membunuhnya, dan engkau berada di tahap seperti dia sebelum dia mengucapkan kalimah yang diucapkannya itu.",
        "arabic_text": "وَعَنِ الْمِقْدَادِ بْنِ الْأَسْوَدِ أَنَّهُ قَالَ: يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ لَقِيتُ رَجُلًا مِنَ الْكُفَّارِ فَاقْتَتَلْنَا فَضَرَبَ إِحْدَى يَدَيَّ بِالسَّيْفِ فقطعهما ثُمَّ لَاذَ مِنِّي بِشَجَرَةٍ فَقَالَ: أَسْلَمْتُ لِلَّهِ وَفِي رِوَايَةٍ: فَلَمَّا أَهْوَيْتُ لِأَقْتُلَهُ قَالَ: لَا إِلَهَ إِلَّا اللَّهُ أَأَقْتُلُهُ بَعْدَ أَنْ قَالَهَا؟ قَالَ: «لَا تَقْتُلْهُ» فَقَالَ: يَا رَسُولَ اللَّهِ إِنَّهُ قَطَعَ إِحْدَى يَدَيَّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَقْتُلْهُ فَإِنْ قَتَلْتَهُ فَإِنَّهُ بِمَنْزِلَتِكَ قَبْلَ أَنْ تَقْتُلَهُ وَإِنَّكَ بِمَنْزِلَتِهِ قَبْلَ أَنْ يَقُولَ كَلِمَتَهُ الَّتِي قَالَ»"
      },
      {
        "id": 32144,
        "hadith_number": "3450",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Membunuh Orang Yang Mengaku La ilaha illa Allah",
        "perawi_melayu": "Usamah bin Zaid",
        "english_text": "And from Usamah bin Zaid, he said: The Messenger of Allah ﷺ sent us to some people from Juhaina. I came upon one of them, and I went to stab him, and he said: La ilaha illa Allah (There is no god but Allah). So I stabbed him and killed him. Then I came to the Prophet ﷺ and informed him. He said: “Did you kill him while he was witnessing that there is no god but Allah?” I said: O Messenger of Allah, he only did that for protection. He said: “Then why didn’t you split open his chest to see?”",
        "malay_translation": "Daripada Usamah bin Zaid, beliau berkata: Rasulullah ﷺ telah menghantar kami kepada sebilangan kaum dari Juhaina. Aku telah menemui seorang lelaki daripada mereka, lalu aku ingin menikamnya, dan dia berkata: La ilaha illa Allah (Tiada tuhan melainkan Allah). Maka aku menikamnya lalu membunuhnya. Kemudian aku datang kepada Nabi ﷺ dan memberitahukannya. Baginda bertanya: “Adakah engkau membunuhnya sedangkan dia telah bersaksi bahawa tiada tuhan melainkan Allah?” Aku menjawab: Wahai Rasulullah, dia hanya melakukan demikian sebagai perlindungan. Baginda berkata: “Kalau begitu, mengapakah engkau tidak memeriksa hatinya (dengan membelah dadanya)?”",
        "arabic_text": "وَعَنْ أُسَامَةَ بْنِ زَيْدٍ قَالَ: بَعَثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى أُنَاسٍ مِنْ جُهَيْنَةَ فَأَتَيْتُ عَلَى رَجُلٍ مِنْهُمْ فَذَهَبْتُ أَطْعَنُهُ فَقَالَ: لَا إِلَهَ إِلَّا اللَّهُ فَطَعَنْتُهُ فَقَتَلْتُهُ فَجِئْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرْتُهُ فَقَالَ: «أقَتلتَه وقدْ شَهِدَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ؟» قُلْتُ: يَا رَسُولَ اللَّهِ إِنَّمَا فَعَلَ ذَلِكَ تَعَوُّذًا قَالَ: «فهَلاَّ شقَقتَ عَن قلبه؟»"
      },
      {
        "id": 32145,
        "hadith_number": "3451",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pengakuan La ilaha illa Allah di Hari Kiamat",
        "perawi_melayu": "Junḍub bin ʿAbdillah al-Bajalī",
        "english_text": "And in the narration of Jundub ibn Abdullah al-Bajali, that the Messenger of Allah (peace and blessings of Allah be upon him) said: “How will you fare with ‘La ilaha illa Allah’ when the Day of Resurrection comes?” He said it repeatedly.",
        "malay_translation": "Dan di dalam riwayat Junḍub bin ʿAbdillah al-Bajalī, bahawa Rasulullah SAW bersabda:  “Bagaimanakah keadaan kamu dengan kalimah ‘La ilaha illa Allah’ apabila tibanya Hari Kiamat?” Baginda mengulang-ulang kalimah tersebut.",
        "arabic_text": "وَفِي رِوَايَةِ جُنْدُبِ بْنِ عَبْدِ اللَّهِ الْبَجَلِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كَيْفَ تَصْنَعُ بِلَا إِلَهَ إِلَّا اللَّهُ إِذَا جَاءَتْ يَوْمَ الْقِيَامَةِ؟» . قَالَهُ مِرَارًا. رَوَاهُ مُسلم"
      },
      {
        "id": 32146,
        "hadith_number": "3452",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Membunuh Mu'ahid dan Akibatnya",
        "perawi_melayu": "Abdullah bin 'Amr",
        "english_text": "Narrated Abdullah bin 'Amr (RA): The Messenger of Allah (peace and blessings of Allah be upon him) said: \"Whoever killed a Mu'ahid (a person who is granted security by the Muslims) shall not smell the fragrance of Paradise, and its fragrance can be found at a distance of forty years.\"",
        "malay_translation": "Daripada Abdullah bin 'Amr RA berkata: Rasulullah SAW bersabda: \"Sesiapa yang membunuh *mu'ahid* (orang bukan Islam yang terikat perjanjian damai dengan umat Islam), dia tidak akan mencium bau syurga, dan sesungguhnya baunya dapat ditemui dari jarak perjalanan empat puluh tahun.\" Riwayat al-Bukhari.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَتَلَ مُعَاهِدًا لَمْ يَرَحْ رَائِحَةَ الْجَنَّةِ وَإِنَّ رِيحَهَا تُوجَدُ مِنْ مَسِيرَةِ أربعينَ خَرِيفًا» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32147,
        "hadith_number": "3453",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Membunuh Diri dan Balasannya di Neraka Jahanam",
        "perawi_melayu": "Abu Hurairah RA",
        "english_text": "Abu Hurairah reported: The Messenger of Allah (peace and blessings of Allah be upon him) said, \"Whoever deliberately throws himself from a mountain and kills himself will be in the Fire of Hell, falling down into it forever and ever. Whoever deliberately drinks poison and kills himself will have his poison in his hand, drinking it in the Fire of Hell forever and ever. And whoever kills himself with iron, his iron will be in his hand, stabbing himself in the stomach with it in the Fire of Hell forever and ever.\"",
        "malay_translation": "Daripada Abu Hurairah RA berkata: Rasulullah SAW bersabda, \"Sesiapa yang sengaja menjatuhkan dirinya dari gunung lalu membunuh diri, maka dia akan berada di dalam Neraka Jahanam, jatuh ke dalamnya selama-lamanya. Sesiapa yang sengaja meminum racun lalu membunuh diri, maka racunnya akan berada di tangannya, dia akan meminumnya di dalam Neraka Jahanam selama-lamanya. Dan sesiapa yang membunuh diri dengan besi, maka besinya akan berada di tangannya, dia akan menikam perutnya dengan besi itu di dalam Neraka Jahanam selama-lamanya.\"",
        "arabic_text": "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ تَرَدَّى مِنْ جَبَلٍ فَقَتَلَ نَفْسَهُ فَهُوَ فِي نَارِ جَهَنَّمَ يَتَرَدَّى فِيهَا خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا وَمَنْ تَحَسَّى سُمًّا فَقَتَلَ نَفْسَهُ فَسُمُّهُ فِي يَدِهِ يَتَحَسَّاهُ فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا وَمَنْ قَتَلَ نَفْسَهُ بِحَدِيدَةٍ فَحَدِيدَتُهُ فِي يَدِهِ يَتَوَجَّأُ بِهَا فِي بَطْنِهِ فِي نَارِ جهنَّمَ خَالِدا مخلَّداً فِيهَا أبدا»"
      },
      {
        "id": 32148,
        "hadith_number": "3454",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Azab Bagi Mereka Yang Mencederakan Diri Sendiri",
        "perawi_melayu": "Daripada riwayat Bukhari",
        "english_text": "Not Available",
        "malay_translation": "Daripada hadis yang diriwayatkan, Rasulullah SAW bersabda:  “Barangsiapa mencekik dirinya sendiri, nescaya Allah akan mencekiknya di dalam neraka. Dan barangsiapa menikam dirinya sendiri, nescaya Allah akan menikamnya di dalam neraka.”",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الَّذِي يَخْنُقُ نَفْسَهُ يَخْنُقُهَا فِي النَّارِ وَالَّذِي يَطْعَنُهَا يَطْعَنُهَا فِي النَّارِ» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32149,
        "hadith_number": "3455",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mempercepatkan Kematian Sendiri Kerana Tidak Sabar",
        "perawi_melayu": "Jundub bin Abdullah",
        "english_text": "On the authority of Jundub ibn Abdullah, who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: \"Among those who were before you was a man who had a wound and he panicked, so he took a knife and cut his hand with it, and the blood did not stop until he died.\" Allah the Almighty said: \"My slave hastened to bring about his own death, so I have forbidden Paradise for him.\"",
        "malay_translation": "Daripada Jundub bin Abdullah, beliau berkata: Rasulullah ﷺ bersabda: \"Dahulu ada seorang lelaki dalam kalangan umat sebelum kamu yang mengalami luka, lalu dia menjadi tidak sabar. Dia mengambil pisau dan memotong tangannya dengan pisau itu, dan darah tidak berhenti mengalir sehingga dia mati.\" Allah Ta'ala berfirman: \"Hamba-Ku telah mendahului-Ku (dalam menentukan ajalnya sendiri), maka Aku haramkan baginya syurga.\"",
        "arabic_text": "وَعَنْ جُنْدُبِ بْنِ عَبْدُ اللَّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: كَانَ فِيمَنْ كَانَ قَبْلَكُمْ رَجُلٌ بِهِ جُرْحٌ فجزِعَ فأخذَ سكيّناً فحزَّ بِهَا يَدَهُ فَمَا رَقَأَ الدَّمُ حَتَّى مَاتَ قَالَ اللَّهُ تَعَالَى: بَادَرَنِي عَبْدِي بِنَفْسِهِ فَحَرَّمْتُ عَلَيْهِ الْجنَّة"
      },
      {
        "id": 32150,
        "hadith_number": "3456",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pengampunan Allah SWT kepada Seorang Muhajir",
        "perawi_melayu": "Jabir",
        "english_text": "Not Available",
        "malay_translation": "Dari Jabir r.a., bahawa Tufail bin Amru Ad-Dausi ketika Nabi SAW hijrah ke Madinah, dia juga turut berhijrah bersama seorang lelaki dari kaumnya.  Lelaki itu jatuh sakit, lalu dia sangat gelisah.  Dia mengambil pisau dan memotong urat nadinya lalu kedua-dua tangannya luka sehingga dia meninggal dunia. Tufail bin Amru melihatnya dalam mimpi, dengan rupa yang baik dan kedua tangannya ditutup.  Lalu dia bertanya: “Apakah yang telah dilakukan oleh Tuhanmu kepadamu?” Lelaki itu menjawab: “Dia mengampuniku kerana aku berhijrah kepada Nabi-Nya SAW.” Tufail bertanya lagi: “Mengapa aku melihat kedua-dua tanganmu ditutupi?” Lelaki itu menjawab: “Dikatakan kepadaku bahawa apa yang telah aku rosakkan tidak akan pulih.”  Tufail menceritakan hal ini kepada Rasulullah SAW, lalu baginda bersabda:  “Ya Allah, ampunilah kedua tangannya.” Riwayat Muslim.",
        "arabic_text": "وَعَنْ جَابِرٍ: أَنَّ الطُّفَيْلَ بْنَ عَمْرٍو الدَّوْسِيَّ لَمَّا هَاجَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْمَدِينَةِ هَاجَرَ إِلَيْهِ وَهَاجَرَ مَعَهُ رَجُلٌ مِنْ قَوْمِهِ فَمَرِضَ فَجَزِعَ فَأَخَذَ مَشَاقِصَ لَهُ فَقَطَعَ بِهَا بَرَاجِمَهُ فَشَخَبَتْ يَدَاهُ حَتَّى مَاتَ فَرَآهُ الطُّفَيْلُ بْنُ عَمْرٍو فِي مَنَامِهِ وَهَيْئَتُهُ حسنةٌ ورآهُ مغطيّاً يدَيْهِ فَقَالَ لَهُ: مَا صنع بِكُل رَبُّكَ؟ فَقَالَ: غَفَرَ لِي بِهِجْرَتِي إِلَى نَبِيِّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: مَا لِي أَرَاكَ مُغَطِّيًا يَدَيْكَ؟ قَالَ: قِيلَ لِي: لَنْ تصلح مِنْكَ مَا أَفْسَدْتَ فَقَصَّهَا الطُّفَيْلُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اللَّهُمَّ وَلِيَدَيْهِ فَاغْفِر» . رَوَاهُ مُسلم"
      },
      {
        "id": 32151,
        "hadith_number": "3457",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hak Ahli Waris Mangsa Bunuh",
        "perawi_melayu": "Abu Syuraih Al-Ka'bi daripada Rasulullah SAW",
        "english_text": "From Abu Shuraih Al-Ka'bi from the Messenger of Allah (peace and blessings be upon him) who said: Then you, O Khuza'ah, have killed this man from Hudhail, and by Allah, I am the one who will take revenge for whoever kills after him.  His family has two choices: either they accept the killer's blood money, or if they wish, they can take his life in retaliation.",
        "malay_translation": "Daripada Abu Syuraih Al-Ka'bi daripada Rasulullah SAW, baginda bersabda:  Kemudian kamu wahai Khuza'ah, telah membunuh orang ini daripada Hudhail, dan demi Allah, sesiapa yang membunuh selepas ini, Akulah yang akan membalasnya. Maka keluarga mangsa mempunyai dua pilihan: sama ada mereka menerima diyat (wang ganti rugi) daripada pembunuh, atau jika mereka mahu, mereka boleh mengambil nyawa pembunuh sebagai balasan.",
        "arabic_text": "وَعَن أبي شُرَيحٍ الكعبيِّ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: ثُمَّ أَنْتُمْ يَا خُزَاعَةُ قَدْ قَتَلْتُمْ هَذَا الْقَتِيلَ مِنْ هُذَيْلٍ وَأَنَا وَاللَّهِ عَاقِلُهُ مَنْ قَتَلَ بَعْدَهُ قَتِيلًا فَأَهْلُهُ بَيْنَ خِيرَتَيْنِ: عَن أَحبُّوا قتلوا وَإِن أَحبُّوا أخذا العقلَ . رَوَاهُ الترمذيُّ وَالشَّافِعِيّ. وَفِي شرح السنَّة بإِسنادِه وَصَرَّحَ: بِأَنَّهُ لَيْسَ فِي الصَّحِيحَيْنِ عَنْ أَبِي شُرَيْح وَقَالَ:"
      },
      {
        "id": 32152,
        "hadith_number": "3458",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Riwayat daripada Abu Hurairah dalam Mishkat Al-Masabih",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "And they (Al-Bukhari and Muslim) narrated it from the narration of Abu Hurairah, meaning with its meaning.",
        "malay_translation": "Dan mereka (Al-Bukhari dan Muslim) meriwayatkannya daripada riwayat Abu Hurairah, iaitu dengan maknanya.",
        "arabic_text": "وَأَخْرَجَاهُ مِنْ رِوَايَةِ أَبِي هُرَيْرَةَ يَعْنِي بِمَعْنَاهُ"
      },
      {
        "id": 32153,
        "hadith_number": "3459",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Balasan Kekejaman: Kisah Seorang Yahudi",
        "perawi_melayu": "Anas r.a.",
        "english_text": "From Anas: That a Jew crushed the head of a maidservant between two stones.  She was asked: Who did this to you? So-and-so? until the Jew was named. She nodded her head. The Jew was brought and he confessed. So the Messenger of Allah (ﷺ) ordered that his head be crushed with stones.",
        "malay_translation": "Dari Anas: bahawa seorang Yahudi telah menghancurkan kepala seorang hamba perempuan di antara dua batu.  Dia ditanya: Siapa yang melakukan ini kepadamu? Si fulan? sehingga Yahudi itu disebut namanya.  Dia mengangguk kepalanya.  Yahudi itu dibawa dan dia mengaku. Maka Rasulullah SAW memerintahkan supaya kepalanya dihancurkan dengan batu.",
        "arabic_text": "وَعَنْ أَنَسٍ: أَنَّ يَهُودِيًّا رَضَّ رَأْسَ جَارِيَةٍ بَيْنَ حَجَرَيْنِ فَقِيلَ لَهَا: مَنْ فَعَلَ بِكِ هَذَا؟ أَفُلَانٌ؟ حَتَّى سُمِّيَ الْيَهُودِيُّ فَأَوْمَأَتْ بِرَأْسِهَا فَجِيءَ بِالْيَهُودِيِّ فَاعْتَرَفَ فَأَمَرَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرُضَّ رَأْسُهُ بِالْحِجَارَةِ"
      },
      {
        "id": 32154,
        "hadith_number": "3460",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kisah Qisas Gigi yang Patah",
        "perawi_melayu": "Tidak dinyatakan dalam data asal.",
        "english_text": "Not Available",
        "malay_translation": "Daripada hadis ini diriwayatkan bahawa Rubai’ah, iaitu perempuan saudara Anas bin Malik telah mematahkan gigi seorang hamba perempuan daripada kalangan Ansar.  Mereka pun datang kepada Nabi SAW lalu baginda memerintahkan qisas (balasan).  Anas bin Nadhr, iaitu bapa saudara Anas bin Malik berkata, “Tidak, demi Allah, janganlah digigit giginya, wahai Rasulullah.”  Lalu Rasulullah SAW bersabda:  “Wahai Anas, kitab Allah adalah qisas.”  Maka, kaum itu redha dan menerima keputusan itu.  Kemudian Rasulullah SAW bersabda:  “Sesungguhnya di antara hamba Allah ada orang yang sekiranya bersumpah atas nama Allah, nescaya Dia akan menepati sumpahnya.”",
        "arabic_text": "وَعَنْهُ قَالَ: كَسَرَتِ الرُّبَيِّعُ وَهِيَ عَمَّةُ أَنَسِ بْنِ مَالِكٍ ثَنِيَّةَ جَارِيَةٍ مِنَ الْأَنْصَارِ فَأَتَوُا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِالْقِصَاصِ فَقَالَ أَنَسُ بْنُ النَّضْرِ عَمُّ أَنَسِ بْنِ مَالِكٍ لَا وَاللَّهِ لَا تُكْسَرُ ثَنِيَّتُهَا يَا رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا أَنَسُ كِتَابُ اللَّهِ الْقِصَاصُ» فَرَضِيَ الْقَوْمُ وَقَبِلُوا الْأَرْشَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ مِنْ عِبَادِ اللَّهِ مَنْ لَوْ أَقْسَمَ عَلَى الله لَأَبَره»"
      },
      {
        "id": 32155,
        "hadith_number": "3461",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tiada Ilmu Selain Al-Quran Kecuali Kefahaman dan Apa yang Tertulis dalam Sahifah",
        "perawi_melayu": "Abu Juhaifah (RA)",
        "english_text": "From Abu Juhaifah RA, he said: I asked Ali RA, 'Do you have anything besides what is in the Quran?' Ali RA replied, 'By the One who splits the grain and created the soul, we have nothing except what is in the Quran, except for understanding that is given to a man about His Book, and what is in the scripture (sahifah).' I asked, 'What is the scripture?' Ali RA replied, 'Reason, freeing captives, and not killing a Muslim for a disbeliever.' Narrated by Bukhari and mentioned the hadith of Ibn Mas'ud: 'No soul is killed unjustly' in 'Book of Knowledge'.",
        "malay_translation": "Daripada Abu Juhaifah RA berkata: Aku bertanya kepada Ali RA, 'Adakah kamu mempunyai sesuatu yang tidak ada dalam Al-Quran?' Ali RA menjawab: 'Demi Zat yang membelah biji dan menciptakan jiwa, kami tidak memiliki apa pun kecuali apa yang ada dalam Al-Quran, kecuali pemahaman yang diberikan kepada seseorang tentang kitab-Nya, dan apa yang ada dalam sahifah.' Aku bertanya: 'Apakah sahifah itu?' Ali RA menjawab: 'Akal, pembebasan tawanan, dan tidak membunuh seorang Muslim kerana seorang kafir.' Riwayat Bukhari dan menyebutkan hadis Ibnu Mas'ud: 'Tidak dibunuh jiwa secara zalim' dalam 'Kitab Ilmu'.",
        "arabic_text": "وَعَن أبي جُحيفةَ قَالَ: سَأَلْتُ عَلِيًّا رَضِيَ اللَّهُ عَنْهُ هَلْ عِنْدَكُمْ شَيْءٌ لَيْسَ فِي الْقُرْآنِ؟ فَقَالَ: وَالَّذِي فَلَقَ الْحَبَّةَ وَبَرَأَ النَّسَمَةَ مَا عِنْدَنَا إِلَّا مَا فِي الْقُرْآنِ إِلَّا فَهْمًا يُعْطَى رَجُلٌ فِي كِتَابِهِ وَمَا فِي الصَّحِيفَةِ قُلْتُ: وَمَا فِي الصَّحِيفَةِ؟ قَالَ: الْعَقْلُ وَفِكَاكُ الْأَسِيرِ وَأَنْ لَا يُقْتَلَ مُسْلِمٌ بِكَافِرٍ. رَوَاهُ الْبُخَارِيُّ وَذَكَرَ حَدِيثَ ابْنِ مَسْعُودٍ: «لَا تُقْتَلُ نَفْسٌ ظُلْمًا» فِي «كتاب الْعلم»"
      },
      {
        "id": 32156,
        "hadith_number": "3462",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kehancuran Dunia Lebih Ringan di Sisi Allah daripada Pembunuhan Seorang Muslim",
        "perawi_melayu": "Abdullah bin Amr",
        "english_text": "From Abdullah bin Amr, that the Prophet (peace and blessings of Allah be upon him) said: \"The destruction of the world is easier for Allah than the killing of a Muslim man.\"",
        "malay_translation": "Daripada Abdullah bin Amr, bahawa Nabi Muhammad SAW bersabda:  \"Kehancuran dunia lebih ringan di sisi Allah daripada membunuh seorang lelaki Muslim.\"",
        "arabic_text": "عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَزَوَالُ الدُّنْيَا أَهْوَنُ عَلَى اللَّهِ مِنْ قَتْلِ رَجُلٍ مُسْلِمٍ» . رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ ووقفَه بعضُهم وَهُوَ الْأَصَح"
      },
      {
        "id": 32157,
        "hadith_number": "3463",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadith daripada Ibnu Majah melalui Al-Bara' bin Azib",
        "perawi_melayu": "Ibnu Majah melalui Al-Bara' bin Azib",
        "english_text": "Not Available",
        "malay_translation": "Hadith ini diriwayatkan oleh Ibnu Majah daripada Al-Bara' bin Azib.",
        "arabic_text": "وَرَوَاهُ ابْنُ مَاجَهْ عَنِ الْبَرَاءِ بْنِ عَازِبٍ"
      },
      {
        "id": 32158,
        "hadith_number": "3464",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kesalahan Besar Menumpahkan Darah Seorang Mukmin",
        "perawi_melayu": "Abu Said dan Abu Hurairah",
        "english_text": "And from Abu Said and Abu Hurairah from the Messenger of Allah (peace and blessings be upon him) who said: \"If the people of the heavens and the earth were to share in the blood of a believer, Allah would cast them all into the Fire.\"",
        "malay_translation": "Daripada Abu Said dan Abu Hurairah daripada Rasulullah SAW, Baginda bersabda:  \"Sekiranya penduduk langit dan bumi berkongsi dalam darah seorang mukmin, nescaya Allah akan memasukkan mereka semua ke dalam neraka.\"  Hadis ini diriwayatkan oleh Imam Tirmizi dan beliau menyatakan hadis ini adalah hadis gharib.",
        "arabic_text": "وَعَن أبي سعيدٍ وَأبي هريرةَ عَن رسولِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَوْ أَنَّ أَهْلَ السَّمَاءِ وَالْأَرْضِ اشْتَرَكُوا فِي دَمِ مُؤْمِنٍ لَأَكَبَّهُمُ اللَّهُ فِي النَّارِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ"
      },
      {
        "id": 32159,
        "hadith_number": "3465",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pembalasan Orang Yang Di Bunuh Pada Hari Kiamat",
        "perawi_melayu": "Ibn Abbas dari Nabi SAW",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Abbas daripada Nabi Muhammad SAW, Baginda bersabda: \"Orang yang dibunuh akan datang kepada pembunuhnya pada hari kiamat dengan memegang rambut kepala dan kepalanya, sementara lehernya berlumuran darah. Dia akan berkata, 'Ya Tuhan, dia telah membunuhku!' sehingga dia didekatkan kepada Arasy.\"  (Riwayat Tirmizi, Nasai dan Ibnu Majah)",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: يَجِيءُ الْمَقْتُولُ بِالْقَاتِلِ يَوْمَ الْقِيَامَةِ نَاصِيَتُهُ وَرَأْسُهُ بِيَدِهِ وَأَوْدَاجُهُ تَشْخُبُ دَمًا يَقُولُ: يَا رَبِّ قَتَلَنِي حَتَّى يُدْنِيَهُ مِنَ العرشِ . رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ وَابْن مَاجَه"
      },
      {
        "id": 32160,
        "hadith_number": "3466",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keharaman Menumpahkan Darah Muslim",
        "perawi_melayu": "Abu Umamah bin Sahl bin Hunayf",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Umamah bin Sahl bin Hunayf, bahawa Usman bin Affan رضي الله عنه  berkata ketika di Dar (Madinah): Aku bersumpah demi Allah, adakah kamu mengetahui bahawa Rasulullah ﷺ  bersabda:  \"Tidak halal menumpahkan darah seorang Muslim melainkan dengan salah satu daripada tiga perkara: Zina selepas bernikah, murtad selepas memeluk Islam, atau membunuh seseorang tanpa hak.\" Maka aku dibunuh. Demi Allah, aku tidak pernah berzina sama ada pada zaman jahiliah mahupun zaman Islam, dan aku tidak pernah murtad sejak aku memberi bai'ah kepada Rasulullah ﷺ, dan aku tidak pernah membunuh seseorang yang diharamkan Allah.  Maka, atas apa kamu membunuhku? (Riwayat Tirmizi, Nasai, Ibnu Majah dan Darimi dengan lafaz yang sedikit berbeza).",
        "arabic_text": "وَعَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ أَنَّ عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ أَشْرَفَ يَوْمَ الدَّارِ فَقَالَ: أَنْشُدُكُمْ بِاللَّهِ أَتَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلَّا بِإِحْدَى ثلاثٍ: زِنىً بَعْدَ إِحْصَانٍ أَوْ كُفْرٌ بَعْدَ إِسْلَامٍ أَوْ قتْلِ نفْسٍ بِغَيْر حق فَقتل بِهِ ؟ فو الله مَا زَنَيْتُ فِي جَاهِلِيَّةٍ وَلَا إِسْلَامٍ وَلَا ارْتَدَدْتُ مُنْذُ بَايَعْتُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا قَتَلْتُ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ فَبِمَ تَقْتُلُونَنِي؟ رَوَاهُ التِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَه وللدارمي لفظ الحَدِيث"
      },
      {
        "id": 32161,
        "hadith_number": "3467",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keimanan Orang Mukmin dan Darah Haram",
        "perawi_melayu": "Abu Darda' daripada Rasulullah SAW",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Darda', daripada Rasulullah SAW, Baginda bersabda:  \"Seorang mukmin sentiasa dalam keadaan baik sehingga dia menumpahkan darah haram.  Apabila dia menumpahkan darah haram, nescaya dia akan binasa.\"  (Riwayat Abu Daud)",
        "arabic_text": "وَعَنْ أَبِي الدَّرْدَاءِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَزَالُ الْمُؤْمِنُ مُعْنِقًا صَالِحًا مَا لَمْ يُصِبْ دَمًا حَرَامًا فَإِذَا أَصَابَ دَمًا حَرَامًا بَلَّحَ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32162,
        "hadith_number": "3468",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pengampunan Allah bagi Semua Dosa Kecuali Syirik dan Membunuh Mukmin dengan Sengaja",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Tiada teks Bahasa Inggeris",
        "malay_translation": "Dan daripadanya (Abu Hurairah), daripada Rasulullah ﷺ bersabda: \"Setiap dosa, diharapkan Allah akan mengampuninya, kecuali bagi sesiapa yang mati dalam keadaan syirik atau sesiapa yang membunuh seorang mukmin dengan sengaja.\" Riwayat Abu Daud.",
        "arabic_text": "وَعَنْهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كُلُّ ذَنْبٍ عَسَى اللَّهُ أَنْ يَغْفِرَهُ إِلَّا مَنْ مَاتَ مُشْرِكًا أَوْ مَنْ يقتُلُ مُؤمنا مُتَعَمدا» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32163,
        "hadith_number": "3469",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Periwayat Hadis",
        "perawi_melayu": "Tidak dinyatakan dalam teks asal.",
        "english_text": "Not Available",
        "malay_translation": "Hadis ini diriwayatkan oleh al-Nasa'i daripada Muawiyah.",
        "arabic_text": "وَرَوَاهُ النَّسَائِيّ عَن مُعَاوِيَة"
      },
      {
        "id": 32164,
        "hadith_number": "3470",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Hukuman dan Membawa Orang Tua ke Mahkamah",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "From Ibn Abbas, who said: The Messenger of Allah (peace and blessings be upon him) said: \"Hudood (punishments) should not be carried out in mosques, nor should a parent be brought to court by their child.\"",
        "malay_translation": "Daripada Ibnu Abbas, beliau berkata: Rasulullah SAW bersabda:  \"Tidak boleh dilaksanakan hukuman hudud di masjid, dan tidak boleh juga seorang anak membawa ibu bapanya ke mahkamah.\"",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تُقَامُ الْحُدُودُ فِي الْمَسَاجِدِ وَلَا يُقَادُ بِالْوَلَدِ الْوَالِدُ» . رَوَاهُ التِّرْمِذِيّ والدارمي"
      },
      {
        "id": 32165,
        "hadith_number": "3471",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Doa untuk Anak dan Perkaitannya dengan Perubatan",
        "perawi_melayu": "Abu Rimtha",
        "english_text": "Abu Rimtha reported: I came to the Messenger of Allah (ﷺ) with my father. He (ﷺ) said: “Who is this with you?” I said: “My son.” He (ﷺ) said: “I bear witness to him. Verily, he will not harm you, and you will not harm him.” Abu Dawud and An-Nasa’i narrated it.  In Sharh as-Sunnah it is added at the beginning: I entered with my father upon the Messenger of Allah (ﷺ) and my father saw something on the back of the Messenger of Allah (ﷺ). He said: “Allow me to treat what is on your back, for I am a physician.” He (ﷺ) said: “You are a companion, and Allah is the physician.”",
        "malay_translation": "Abu Rimtha meriwayatkan: Aku datang kepada Rasulullah SAW bersama ayahku. Baginda SAW bertanya: “Siapakah ini yang bersamamu?” Aku menjawab: “Anakku.” Baginda SAW bersabda: “Aku menjadi saksi baginya. Sesungguhnya, dia tidak akan memudaratkanmu, dan engkau pun tidak akan memudaratkannya.” Abu Daud dan An-Nasai meriwayatkannya. Dalam Syarah As-Sunnah,  ditambahkan di awal: Aku masuk bersama ayahku mengadap Rasulullah SAW, dan ayahku melihat sesuatu di belakang Rasulullah SAW. Lalu ayahku berkata: “Izinkan aku merawat apa yang ada di belakangmu, kerana aku seorang doktor.” Baginda SAW bersabda: “Engkau adalah sahabatku, dan Allah jualah doktornya.”",
        "arabic_text": "وَعَن أبي رِمْثَةَ قَالَ: أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَ أبي فقالَ: «مَنْ هَذَا الَّذِي مَعَكَ؟» قَالَ: ابْنِي أَشْهَدُ بِهِ قَالَ: «أَمَا إِنَّهُ لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ وَزَادَ فِي «شَرْحِ السُّنَّةِ» فِي أَوَّلِهِ قَالَ: دَخَلْتُ مَعَ أَبِي عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَأَى أَبِي الَّذِي بِظَهْرِ رَسُول الله صلى الله عَلَيْهِ وَسلم فَقَالَ: دَعْنِي أُعَالِجُ الَّذِي بِظَهْرِكِ فَإِنِّي طَبِيبٌ. فَقَالَ: «أَنْتَ رفيقٌ واللَّهُ الطبيبُ»"
      },
      {
        "id": 32166,
        "hadith_number": "3472",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Bapa Bertanggungjawab, Bukan Anak",
        "perawi_melayu": "Amru bin Shu'aib daripada bapanya daripada datuknya daripada Suraqah bin Malik",
        "english_text": "From Amr ibn Shu'aib from his father from his grandfather from Suraqah ibn Malik, who said: I was present with the Messenger of Allah (ﷺ) who bound the father for his son but did not bind the son for his father.",
        "malay_translation": "Daripada Amru bin Shu'aib daripada bapanya daripada datuknya daripada Suraqah bin Malik, yang berkata: Aku telah berada di sisi Rasulullah SAW ketika baginda mengikat (bertanggungjawab) bapa untuk anaknya, tetapi tidak mengikat (bertanggungjawab) anak untuk bapanya.",
        "arabic_text": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جدِّهِ عَن سُراقةَ بنِ مالكٍ قَالَ: حَضَرْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقِيدُ الْأَبَ مِنِ ابْنِهِ وَلَا يُقِيدُ الِابْنَ من أَبِيه. رَوَاهُ التِّرْمِذِيّ (لم تتمّ دراسته) وَضَعفه"
      },
      {
        "id": 32167,
        "hadith_number": "3473",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Balasan bagi Mencederakan Hamba",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Rujuk kepada teks arab",
        "malay_translation": "Daripada Al-Hasan, daripada Samurah RA berkata: Rasulullah SAW bersabda: 'Sesiapa yang membunuh hambanya, kami akan membunuhnya, dan sesiapa yang memotong anggota badan hambanya, kami akan memotong anggota badannya.' Riwayat Tirmidzi, Abu Daud, Ibnu Majah, dan Darimi. An-Nasa'i menambah dalam riwayat lain: 'Dan sesiapa yang mengembiri hambanya, kami akan mengembirinya.'",
        "arabic_text": "وَعَن الْحسن عَن سَمُرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ وَمَنْ جَدَعَ عَبْدَهُ جَدَعْنَاهُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ وَزَادَ النَّسَائِيُّ فِي رِوَايَةٍ أُخْرَى: «وَمن خصى عَبده خصيناه»"
      },
      {
        "id": 32168,
        "hadith_number": "3474",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Pembunuhan Sengaja",
        "perawi_melayu": "Amru bin Shu'aib daripada bapanya daripada datuknya",
        "english_text": "From Amr ibn Shu'aib from his father from his grandfather that the Messenger of Allah (ﷺ) said: “Whoever kills intentionally, he will be handed over to the relatives of the murdered person.  If they wish, they may kill him; and if they wish, they may accept the compensation (diya).  The compensation (diya) is thirty camels, thirty she-camels, and forty ewes, and whatever they agree upon is theirs.”  Narrated by Tirmidhi",
        "malay_translation": "Daripada Amru bin Shu'aib daripada bapanya daripada datuknya bahawa Rasulullah SAW bersabda:  \"Barangsiapa membunuh dengan sengaja, maka dia akan diserahkan kepada keluarga si terbunuh. Jika mereka mahu, mereka boleh membunuhnya; dan jika mereka mahu, mereka boleh menerima diyat. Diyat itu ialah tiga puluh ekor unta, tiga puluh ekor unta betina, dan empat puluh ekor biri-biri, dan apa sahaja yang mereka sepakati adalah hak mereka.\" Riwayat Tirmizi.",
        "arabic_text": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: مَنْ قَتَلَ مُتَعَمِّدًا دُفِعَ إِلَى أولياءِ المقتولِ فإِنْ شاؤوا قَتَلوا وإِنْ شَاؤوا أَخَذُوا الدِّيَةَ: وَهِيَ ثَلَاثُونَ حِقَّةً وَثَلَاثُونَ جَذَعَةً وَأَرْبَعُونَ خَلِفَةً وَمَا صَالَحُوا عَلَيْهِ فَهُوَ لَهُمْ . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 32169,
        "hadith_number": "3475",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kesamarataan Darah dan Perlindungan dalam Islam",
        "perawi_melayu": "Ali r.a. daripada Nabi SAW",
        "english_text": "From Ali (RA) from the Prophet (PBUH) who said: \"The blood of Muslims is equal; the nearest of them is responsible for the protection of all, and the furthest should support the others. They are a single entity towards those who are not Muslims.  No Muslim should be killed by a non-Muslim, and no one under a treaty (of peace) should be attacked while the treaty is in effect.\"",
        "malay_translation": "Daripada Ali r.a., daripada Nabi SAW, baginda bersabda:  \"Darah orang Islam adalah sama nilainya; yang terdekat di antara mereka bertanggungjawab untuk melindungi semua, dan yang terjauh perlu menyokong yang lain. Mereka adalah satu entiti terhadap mereka yang bukan Islam.  Tiada seorang Muslim pun harus dibunuh oleh seorang bukan Islam, dan tiada sesiapa yang berada di bawah perjanjian (damai) harus diserang selagi perjanjian itu masih berkuatkuasa.\"",
        "arabic_text": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْمُسْلِمُونَ تَتَكَافَأُ دِمَاؤُهُمْ وَيَسْعَى بِذِمَّتِهِمْ أَدْنَاهُمْ وَيَرُدُّ عَلَيْهِمْ أَقْصَاهُمْ وَهُمْ يَدٌ عَلَى مَنْ سِوَاهُمْ أَلَا لَا يُقْتَلُ مُسْلِمٌ بِكَافِرٍ وَلَا ذُو عَهْدٍ فِي عَهْدِه» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ"
      },
      {
        "id": 32170,
        "hadith_number": "3476",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis Riwayat Ibn Majah dari Ibn Abbas",
        "perawi_melayu": "Tidak diketahui perawi",
        "english_text": "Tiada Teks Bahasa Inggeris",
        "malay_translation": "Tiada Terjemahan Melayu",
        "arabic_text": "وَرَوَاهُ ابْن مَاجَه عَن ابْن عَبَّاس"
      },
      {
        "id": 32171,
        "hadith_number": "3477",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pilihan bagi Mangsa Kecederaan: Balasan, Memaafkan, atau Diat",
        "perawi_melayu": "Abu Shuraih Al-Khuza'i",
        "english_text": "Hadith ini tidak mempunyai teks Bahasa Inggeris yang disediakan.",
        "malay_translation": "Daripada Abu Shuraih Al-Khuza'i, beliau berkata: Saya mendengar Rasulullah SAW bersabda: 'Sesiapa yang ditimpa kecederaan berdarah atau luka (dan 'khabl' bermaksud luka), maka dia mempunyai pilihan antara salah satu daripada tiga perkara: jika dia mahukan yang keempat, maka halanglah dia: sama ada membalas (qisas), atau memaafkan, atau mengambil diat (wang tebusan). Jika dia mengambil sesuatu daripada itu, kemudian melampaui batas selepas itu, maka baginya Neraka, kekal di dalamnya selama-lamanya.' Riwayat Ad-Darimi.",
        "arabic_text": "وَعَن أبي شُريحِ الخُزاعيِّ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: مَنْ أُصِيبَ بِدَمٍ أَوْ خَبْلٍ وَالْخَبْلُ: الْجُرْحُ فَهُوَ بِالْخِيَارِ بَيْنَ إِحْدَى ثَلَاثٍ: فَإِنْ أَرَادَ الرَّابِعَةَ فَخُذُوا عَلَى يَدَيْهِ: بَيْنَ أَنْ يَقْتَصَّ أَوْ يَعْفُوَ أَوْ يَأْخُذَ الْعَقْلَ فَإِنْ أَخَذَ مِنْ ذَلِكَ شَيْئًا ثُمَّ عَدَا بَعْدَ ذَلِكَ فَلَهُ النَّارُ خَالِدًا فِيهَا مُخَلَّدًا أبدا . رَوَاهُ الدَّارمِيّ"
      },
      {
        "id": 32172,
        "hadith_number": "3478",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Pembunuhan dalam Pergaduhan",
        "perawi_melayu": "Daripada Tawus daripada Ibnu Abbas daripada Rasulullah SAW",
        "english_text": "Not Available",
        "malay_translation": "Daripada Tawus daripada Ibnu Abbas daripada Rasulullah SAW, baginda bersabda:  \"Barang siapa yang terbunuh dalam pertengkaran yang melibatkan lemparan batu, atau sebatan dengan rotan, atau pukulan dengan kayu, maka ia adalah kerana kesilapan. Dan barang siapa yang membunuh dengan sengaja, maka ia adalah pembunuh. Dan barang siapa yang menghalang (daripada menghukum pembunuh), maka ke atasnya laknat Allah dan murka-Nya, tidak diterima darinya sebarang tebusan dan tidak juga ganti rugi.\"  (Riwayat Abu Daud dan Nasai)",
        "arabic_text": "وَعَن طَاوُوس عَنِ ابْنِ عَبَّاسٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قُتِلَ فِي عِمِّيَّةٍ فِي رَمْيٍ يَكُونُ بَيْنَهُمْ بِالْحِجَارَةِ أَوْ جَلْدٍ بِالسِّيَاطِ أَوْ ضَرْبٍ بِعَصًا فَهُوَ خَطَأٌ عقله الْخَطَأِ وَمَنْ قَتَلَ عَمْدًا فَهُوَ قَوَدٌ وَمَنْ حَالَ دُونَهُ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَغَضَبُهُ لَا يُقْبَلُ مِنْهُ صَرْفٌ وَلَا عَدْلٌ» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ"
      },
      {
        "id": 32173,
        "hadith_number": "3479",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tidak Memaafkan Pembunuh Selepas Menerima Diyat",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Teks Bahasa Inggeris kosong.",
        "malay_translation": "Daripada Jabir RA berkata: Rasulullah SAW bersabda: 'Aku tidak akan memaafkan sesiapa yang membunuh selepas menerima diyat.' Riwayat Abu Daud.",
        "arabic_text": "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا أُعْفِي مَنْ قَتَلَ بعدَ أَخذ الديةِ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32174,
        "hadith_number": "3480",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Sabar Menghadapi Musibah Pada Badan",
        "perawi_melayu": "Abu Darda' RA",
        "english_text": "Abu Darda' reported: I heard the Messenger of Allah (peace and blessings be upon him) say, 'There is no man who is afflicted with something in his body and is patient with it, except that Allah will raise him a degree and remove a sin from him.'",
        "malay_translation": "Daripada Abu Darda' RA, beliau berkata: Aku mendengar Rasulullah SAW bersabda: \"Tidaklah seorang lelaki yang ditimpa musibah pada tubuhnya, lalu dia bersabar menghadapinya, melainkan Allah akan mengangkat darjatnya dan menghapuskan dosa-dosanya.\" Diriwayatkan oleh Tirmizi dan Ibnu Majah.",
        "arabic_text": "وَعَنْ أَبِي الدَّرْدَاءِ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَا مِنْ رَجُلٍ يُصَابُ بِشَيْءٍ فِي جَسَدِهِ فَتَصَدَّقَ بِهِ إِلَّا رَفَعَهُ اللَّهُ بِهِ دَرَجَةً وَحَطَّ عَنْهُ خَطِيئَة» . رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه"
      },
      {
        "id": 32175,
        "hadith_number": "3481",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Umar bin al-Khattab membalas pembunuhan",
        "perawi_melayu": "Said bin al-Musayyab",
        "english_text": "From Sa'id bin al-Musayyab: That Umar bin al-Khattab killed five or seven people for one man whom they had killed by treachery. And Umar said: \"If the people of Sana'a had conspired against him, I would have killed them all.\"",
        "malay_translation": "Daripada Said bin al-Musayyab: Bahawa Umar bin al-Khattab telah membunuh lima atau tujuh orang kerana seorang lelaki yang telah mereka bunuh secara khianat. Dan Umar berkata: \"Sekiranya penduduk Sana'a telah bersekongkol terhadapnya, nescaya aku akan membunuh mereka semua.\"",
        "arabic_text": "عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ: أَنَّ عُمَرَ بْنَ الْخطاب قَتَلَ نَفَرًا خَمْسَةً أَوْ سَبْعَةً بِرَجُلٍ وَاحِدٍ قَتَلُوهُ قَتْلَ غِيلَةٍ وَقَالَ عُمَرُ: لَوْ تَمَالَأَ عَلَيْهِ أَهْلُ صَنْعَاءَ لَقَتَلْتُهُمْ جَمِيعًا. رَوَاهُ مَالِكٌ"
      },
      {
        "id": 32176,
        "hadith_number": "3482",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Riwayat Bukhari daripada Ibnu Umar",
        "perawi_melayu": "Ibnu Umar (dilaporkan oleh Bukhari)",
        "english_text": "Narrated by Bukhari from Ibn Umar, something similar.",
        "malay_translation": "Daripada Ibnu Umar,  sesuatu yang hampir sama (diriwayatkan oleh Bukhari).",
        "arabic_text": "وروى البُخَارِيّ عَن ابْن عمر نَحوه"
      },
      {
        "id": 32177,
        "hadith_number": "3483",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Balas Dendam di Hari Kiamat",
        "perawi_melayu": "Jun­dub",
        "english_text": "Not Available",
        "malay_translation": "Daripada Jun­dub, beliau berkata: “Seorang lelaki memberitahu aku bahawa Rasulullah SAW bersabda: ‘Orang yang dibunuh akan datang bersama pembunuhnya pada hari kiamat, lalu berkata: ‘Tanya dia mengapa dia membunuhku?’  Lalu pembunuhnya akan berkata: ‘Aku membunuhnya kerana berebut harta milik si fulan.’ Jun­dub berkata: ‘Maka bertakwalah kamu (daripada membunuh).’” Riwayat an-Nasai.",
        "arabic_text": "وَعَن جُنْدبٍ قَالَ: حَدَّثَنِي فُلَانٌ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: يَجِيءُ الْمَقْتُولُ بِقَاتِلِهِ يَوْمَ الْقِيَامَةِ فَيَقُولُ: سَلْ هَذَا فِيمَ قَتَلَنِي؟ فَيَقُولُ: قَتَلْتُهُ عَلَى مُلْكِ فُلَانٍ . قَالَ جُنْدُبٌ: فاتَّقِها. رَوَاهُ النَّسَائِيّ"
      },
      {
        "id": 32178,
        "hadith_number": "3484",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Bantuan dalam Pembunuhan Seorang Mukmin",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "From Abu Hurairah (RA) who said: The Messenger of Allah (ﷺ) said: “Whoever helps in the killing of a believer even with a word, will meet Allah with it written between his eyes that he is hopeless of Allah’s Mercy.”",
        "malay_translation": "Dari Abu Hurairah r.a. berkata: Rasulullah SAW bersabda: “Barang siapa yang membantu dalam pembunuhan seorang mukmin, walaupun hanya dengan sepatah kata, nescaya dia akan menemui Allah SWT dengan perkataan itu tertulis di antara kedua matanya bahawa dia telah hilang harapan daripada rahmat Allah SWT.”",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَعَانَ عَلَى قَتْلِ مُؤْمِنٍ شَطْرَ كَلِمَةٍ لَقِيَ اللَّهَ مَكْتُوبٌ بينَ عينيهِ آيسٌ من رَحْمَة الله» . رَوَاهُ ابْن مَاجَه"
      },
      {
        "id": 32179,
        "hadith_number": "3485",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman dalam Kes Pembunuhan dengan Bantuan",
        "perawi_melayu": "Ibnu Umar R.A.",
        "english_text": "On the authority of Ibn Umar RA, from the Prophet SAW who said: 'If a man restrains another man, and another kills him, then the killer is killed, and the restrainer is imprisoned.'",
        "malay_translation": "Daripada Ibnu Umar R.A., daripada Nabi SAW bersabda: 'Apabila seseorang lelaki menahan seorang lelaki (lain), dan orang lain membunuhnya, maka dibunuh orang yang membunuh, dan ditahan orang yang menahan.' Riwayat Daruqutni.",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا أَمْسَكَ الرَّجُلُ الرَّجُلَ وَقَتَلَهُ الْآخَرُ يُقْتَلُ الَّذِي قتَل ويُحبسُ الَّذِي أمْسَكَ» . رَوَاهُ الدَّارَقُطْنِيّ"
      },
      {
        "id": 32180,
        "hadith_number": "3486",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kesamaan Jari Kelingking dan Ibu Jari",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "Narrated Ibn Abbas: from the Prophet PBUH who said: «This and this are the same.» Meaning the little finger and the thumb. Narrated by Bukhari.",
        "malay_translation": "Daripada Ibn Abbas RA, daripada Nabi SAW bersabda: «Ini dan ini adalah sama.» Iaitu jari kelingking dan ibu jari. Riwayat al-Bukhari.",
        "arabic_text": "عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «هَذِهِ وَهَذِهِ سَوَاءٌ» يَعْنِي الخِنصرُ والإبهامَ. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32181,
        "hadith_number": "3487",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Pusaka Janin yang Gugur",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "From Abu Hurairah: The Messenger of Allah ﷺ ruled on the case of a fetus of a woman from Bani Lihyan that fell dead: that it is an heir (a slave boy or slave girl).  Then, the woman on whom the ruling on the fetus was made passed away. So, the Messenger of Allah ﷺ ruled that her inheritance is for her children and husband according to the shares of her inheritors.",
        "malay_translation": "Dari Abu Hurairah: Rasulullah SAW telah membuat keputusan mengenai kes janin seorang wanita daripada Bani Lihyan yang gugur mati: bahawa ia adalah seorang pewaris (seorang hamba lelaki atau hamba perempuan). Kemudian, wanita yang telah diputuskan hukumnya mengenai janin tersebut meninggal dunia. Maka, Rasulullah SAW memutuskan bahawa pusakanya adalah untuk anak-anak dan suaminya mengikut bahagian-bahagian ahli warisnya.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَنِينِ امْرَأَةٍ مَنْ بَنِي لِحْيَانَ سَقَطَ مَيِّتًا بِغُرَّةِ: عَبْدٍ أَوْ أَمَةٍ ثُمَّ إِنَّ الْمَرْأَةَ الَّتِي قُضِيَ عَلَيْهَا بِالْغُرَّةِ تُوُفِّيَتْ فَقَضَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَنْ مِيرَاثَهَا لبنيها وَزوجهَا الْعقل على عصبتها"
      },
      {
        "id": 32182,
        "hadith_number": "3488",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Diah Wanita Hamil yang dibunuh dan Janinnya",
        "perawi_melayu": "Tidak dinyatakan dalam data asal.",
        "english_text": "Not Available",
        "malay_translation": "Daripada hadis yang diriwayatkan, baginda berkata: Dua orang wanita daripada puak Hudhail bergaduh. Seorang daripada mereka telah membaling yang lain dengan batu sehingga mati bersama janin dalam kandungannya. Rasulullah SAW telah memutuskan bahawa diat janinnya ialah seorang hamba lelaki atau perempuan, dan diat wanita itu dibayar oleh keluarga terdekatnya. Anak dan warisnya juga menerima bahagian warisan.",
        "arabic_text": "وَعَنْهُ قَالَ: اقْتَتَلَتِ امْرَأَتَانِ مِنْ هُذَيْلٍ فَرَمَتْ إِحْدَاهُمَا الْأُخْرَى بِحَجَرٍ فَقَتَلَتْهَا وَمَا فِي بَطْنِهَا فَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ دِيَةَ جَنِينِهَا غُرَّةٌ: عَبْدٌ أَوْ وَلِيدَةٌ وَقَضَى بِدِيَةِ الْمَرْأَةِ عَلَى عَاقِلَتِهَا وورَّثَها ولدَها وَمن مَعَهم"
      },
      {
        "id": 32183,
        "hadith_number": "3489",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Daya atas Janin yang Gugur Akibat Keganasan",
        "perawi_melayu": "Al-Mughirah bin Syu'bah",
        "english_text": "Not Available",
        "malay_translation": "Daripada al-Mughirah bin Syu'bah: bahawa dua orang perempuan yang merupakan dua isteri kepada seorang suami, salah seorang daripadanya telah membaling yang lain dengan batu atau tiang khemah sehingga menggugurkan kandungannya. Maka Rasulullah SAW telah menetapkan diyat (ganti rugi) bagi janin tersebut sebagai seorang hamba lelaki atau perempuan, dan diyat itu dipertanggungjawabkan kepada keluarga wanita tersebut. Ini adalah riwayat Imam Tirmizi. Manakala dalam riwayat Imam Muslim: Baginda SAW bersabda: Seorang perempuan telah memukul isteri seibu bapanya dengan tiang khemah ketika mengandung lalu menyebabkan keguguran. Baginda SAW juga menyatakan salah seorang daripadanya adalah perempuan dari kalangan Bani Lihyan. Baginda SAW menetapkan diyat bagi yang terkorban dipertanggungjawabkan kepada keluarga pembunuh dan juga diyat bagi kandungannya.",
        "arabic_text": "وَعَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ: أَنَّ امْرَأَتَيْنِ كَانَتَا ضَرَّتَيْنِ فَرَمَتْ إِحْدَاهُمَا الْأُخْرَى بِحَجَرٍ أَوْ عَمُودِ فُسْطَاطٍ فَأَلْقَتْ جَنِينَهَا فَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الجَنينِ غُرَّةً: عبْداً أَوْ أَمَةٌ وَجَعَلَهُ عَلَى عَصَبَةِ الْمَرْأَةِ هَذِهِ رِوَايَةُ التِّرْمِذِيِّ وَفِي رِوَايَةِ مُسْلِمٍ: قَالَ: ضَرَبَتِ امْرَأَةٌ ضَرَّتَهَا بِعَمُودِ فُسْطَاطٍ وَهِيَ حُبْلَى فَقَتَلَتْهَا قَالَ: وَإِحْدَاهُمَا لِحْيَانَيَّةٌ قَالَ: فَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دِيَة الْمَقْتُول عَلَى عَصَبَةِ الْقَاتِلَةِ وَغُرَّةً لِمَا فِي بَطْنِهَا"
      },
      {
        "id": 32184,
        "hadith_number": "3490",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Denda Kesalahan Serupa Dengan Kesengajaan",
        "perawi_melayu": "Abdullah bin Amr",
        "english_text": "From Abdullah ibn Amr, that the Messenger of Allah (ﷺ) said: \"Indeed, the compensation for a mistake similar to intention, whether with a whip or a stick, is one hundred camels; forty of them with their young in their bellies.\"",
        "malay_translation": "Daripada Abdullah bin Amr, bahawa Rasulullah SAW bersabda:  \"Sesungguhnya, diyat (tebusan) bagi kesalahan yang serupa dengan kesengajaan, sama ada dengan rotan atau kayu, ialah seratus ekor unta; empat puluh daripadanya mengandungi anak dalam perutnya.\" ",
        "arabic_text": "عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: أَلَا إِنَّ دِيَةَ الْخَطَأِ شِبْهِ الْعَمْدِ مَا كَانَ بِالسَّوْطِ وَالْعَصَا مِائَةٌ مِنَ الإِبلِ: مِنْهَا أربعونَ فِي بطونِها أولادُها . رَوَاهُ النسائيُّ وَابْن مَاجَه والدارمي"
      },
      {
        "id": 32185,
        "hadith_number": "3491",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis Riwayat Abu Daud, Ibnu Majah, dan dari Ibnu Umar",
        "perawi_melayu": "Tiada perawi dinyatakan",
        "english_text": "Tiada teks Inggeris disediakan",
        "malay_translation": "Dan diriwayatkan oleh Abu Daud daripadanya dan Ibnu Majah dan dari Ibnu Umar. Dan dalam «Syarh as-Sunnah» lafaz «al-Masabih» dari Ibnu Umar.",
        "arabic_text": "وَرَوَاهُ أَبُو دَاوُد عَنهُ وَابْن مَاجَه وَعَن ابْن عمر. وَفِي «شَرْحِ السُّنَّةِ» لَفْظُ «الْمَصَابِيحِ» عَنِ ابْنِ عمر"
      },
      {
        "id": 32186,
        "hadith_number": "3492",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Diat (Denda)  Ke Atas Kecederaan Badan Menurut Hukum Islam",
        "perawi_melayu": "Abu Bakar bin Muhammad bin Amr bin Hazm daripada bapanya daripada datuknya",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Bakar bin Muhammad bin Amr bin Hazm daripada bapanya daripada datuknya, bahawa Rasulullah SAW telah menulis kepada penduduk Yaman. Di dalam surat tersebut ada menyebut: “Barang siapa yang membunuh seorang mukmin secara sengaja, maka ia adalah seperti yang memotong tangannya sendiri, kecuali jika mendapat kerelaan daripada keluarga si mati.”  Juga di dalam surat tersebut: “Seorang lelaki boleh dibunuh kerana perempuan.”  Di dalam surat tersebut juga menyebut tentang diat (denda):  “Bagi nyawa, diatnya ialah seratus ekor unta, dan bagi orang yang berkemampuan, seribu dinar.  Bagi hidung jika dipotong, diatnya ialah seratus ekor unta.  Dan bagi gigi, terdapat diat; dan bagi bibir, terdapat diat; dan bagi mata, terdapat diat; dan bagi zakar, terdapat diat; dan bagi tulang punggung, terdapat diat; dan bagi kedua-dua mata, terdapat diat; dan bagi satu kaki, separuh diat; dan bagi lutut, sepertiga diat; dan bagi tulang kering, sepertiga diat; dan bagi tulang belikat, lima belas ekor unta; dan bagi setiap jari tangan dan kaki, sepuluh ekor unta; dan bagi gigi taring, lima ekor unta.” Riwayat al-Nasai dan al-Darimi.  Dalam riwayat Malik: “Dan bagi mata, lima puluh; dan bagi tangan, lima puluh; dan bagi kaki, lima puluh; dan bagi tulang rusuk, lima.”",
        "arabic_text": "وَعَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى أَهْلِ الْيَمَنِ وَكَانَ فِي كِتَابِهِ: «أَنَّ مَنِ اعْتَبَطَ مُؤْمِنًا قَتْلًا فَإِنَّهُ قَوَدُ يَدِهِ إِلَّا أَنْ يَرْضَى أَوْلِيَاءُ الْمَقْتُولِ» وَفِيهِ: «أَنَّ الرَّجُلَ يُقْتَلُ بِالْمَرْأَةِ» وَفِيهِ: «فِي النَّفْسِ الدِّيَةُ مِائَةٌ مِنَ الْإِبِلِ وَعَلَى أَهْلِ الذَّهَبِ أَلْفُ دِينَارٍ وَفِي الْأَنْفِ إِذَا أُوعِبَ جَدْعُهُ الدِّيَةُ مِائَةٌ مِنَ الْإِبِلِ وَفِي الْأَسْنَانِ الدِّيَةُ وَفِي الشفتين الدِّيَة وَفِي البيضين الدِّيةُ وَفِي الذَّكرِ الدِّيةُ وَفِي الصُّلبِ الدِّيَةُ وَفِي الْعَيْنَيْنِ الدِّيَةُ وَفِي الرِّجْلِ الْوَاحِدَةِ نِصْفُ الدِّيَةِ وَفِي الْمَأْمُومَةِ ثُلُثُ الدِّيَةِ وَفِي الجائفَةِ ثلث الدِّيَة وَفِي المنقلة خمس عشر مِنَ الْإِبِلِ وَفِي كُلِّ أُصْبُعٍ مِنْ أَصَابِعِ الْيَدِ وَالرِّجْلِ عَشْرٌ مِنَ الْإِبِلِ وَفِي السِّنِّ خَمْسٌ مِنَ الْإِبِلِ» . رَوَاهُ النَّسَائِيُّ وَالدَّارِمِيُّ وَفِي رِوَايَةِ مَالِكٍ: «وَفِي الْعَيْنِ خَمْسُونَ وَفِي الْيَدِ خَمْسُونَ وَفِي الرِّجْلِ خَمْسُونَ وَفِي الْمُوضِحَةِ خَمْسٌ»"
      },
      {
        "id": 32187,
        "hadith_number": "3493",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman Bagi Yang Mencuri Kambing atau Unta",
        "perawi_melayu": "Amr bin Shu'aib daripada bapanya daripada datuknya",
        "english_text": "From Amr ibn Shu'aib from his father from his grandfather, who said: The Messenger of Allah (peace and blessings of Allah be upon him) prescribed five camels as compensation for stealing a young camel and five camels as compensation for stealing a mature camel.",
        "malay_translation": "Daripada Amr bin Shu'aib daripada bapanya daripada datuknya, yang berkata: Rasulullah SAW telah menetapkan hukuman lima ekor unta sebagai ganti rugi bagi mencuri anak unta dan lima ekor unta sebagai ganti rugi bagi mencuri unta dewasa.",
        "arabic_text": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَوَاضِحِ خَمْسًا خَمْسًا مِنَ الْإِبِلِ وَفِي الْأَسْنَانِ خَمْسًا خَمْسًا مِنَ الْإِبِلِ. رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ وَالدَّارِمِيُّ وَرَوَى التِّرْمِذِيُّ وابنُ مَاجَه الْفَصْل الأول"
      },
      {
        "id": 32188,
        "hadith_number": "3494",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kesamaan Jari Tangan dan Kaki",
        "perawi_melayu": "Ibnu Abbas R.A.",
        "english_text": "Teks Bahasa Inggeris tiada",
        "malay_translation": "Daripada Ibnu Abbas R.A. berkata: Rasulullah SAW menjadikan jari-jari tangan dan kaki sama (panjang/kedudukan semasa solat). Riwayat Abu Daud dan Tirmizi.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: جَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصَابِعَ الْيَدَيْنِ وَالرِّجْلَيْنِ سَوَاء. رَوَاهُ أَبُو دَاوُد وَالتِّرْمِذِيّ"
      },
      {
        "id": 32189,
        "hadith_number": "3495",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kesamaan Jari dan Gigi",
        "perawi_melayu": "Abu Daud",
        "english_text": "Not Available",
        "malay_translation": "Daripada baginda SAW,  baginda bersabda: “Jari-jari adalah sama, dan gigi-gigi adalah sama; gigi taring dan gigi geraham adalah sama; ini dan ini adalah sama.” Riwayat Abu Daud.",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «الأصابعُ سواءٌ والأسنانُ سواءٌ الثَنِيَّةُ وَالضِّرْسُ سَوَاءٌ هَذِهِ وَهَذِهِ سَوَاءٌ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32190,
        "hadith_number": "3496",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ketiadaan Perjanjian dalam Islam dan Hukum Diyyah",
        "perawi_melayu": "Amru bin Syuayb daripada bapanya daripada datuknya",
        "english_text": "Not Available",
        "malay_translation": "Daripada Amru bin Syuayb daripada bapanya daripada datuknya, katanya: Rasulullah SAW telah menyampaikan khutbah pada tahun Fathu Mekah, kemudian baginda bersabda: \"Wahai manusia, sesungguhnya tidak ada perjanjian dalam Islam, dan apa sahaja perjanjian yang ada pada zaman jahiliyyah, maka Islam tidak akan menambah melainkan kekuatan. Orang-orang beriman adalah satu tangan yang melindungi antara satu sama lain. Orang yang paling lemah di antara mereka akan memberikan perlindungan kepada mereka, dan orang yang paling kuat akan memulangkan mereka ke tempat asal. Tidak dibenarkan membunuh seorang mukmin dengan seorang kafir. Diyyah bagi kafir adalah separuh daripada diyyah seorang Muslim. Tiada jalab (mengharamkan sesuatu) dan janab (mengharamkan sesuatu), dan zakat mereka tidak akan diambil melainkan di rumah mereka.\"  Dalam satu riwayat yang lain, baginda bersabda: \"Diyyah bagi orang yang mempunyai perjanjian (mu'ahid) adalah separuh daripada diyyah orang merdeka.\"  (Riwayat Abu Daud)",
        "arabic_text": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: خَطَبَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الفتحِ ثمَّ قَالَ: «أَيُّهَا النَّاسُ إِنَّهُ لَا حِلْفَ فِي الْإِسْلَامِ وَمَا كَانَ مِنْ حِلْفٍ فِي الْجَاهِلِيَّةِ فَإِنَّ الْإِسْلَامَ لَا يَزِيدُهُ إِلَّا شِدَّةً الْمُؤْمِنُونَ يَدٌ عَلَى مَنْ سِوَاهُمْ يُجِيرُ عَلَيْهِمْ أَدْنَاهُمْ وَيَرُدُّ عليهِم أقْصاهم يَردُّ سراياهم على قعيدتِهم لَا يُقْتَلُ مُؤْمِنٌ بِكَافِرٍ دِيَةُ الْكَافِرِ نِصْفُ دِيَةِ الْمُسْلِمِ لَا جَلَبَ وَلَا جَنَبَ وَلَا تُؤْخَذُ صَدَقَاتُهُمْ إِلَّا فِي دُورِهِمْ» . وَفِي رِوَايَةٍ قَالَ: «دِيَةُ الْمُعَاهِدِ نِصْفُ دِيَةِ الْحُرِّ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32191,
        "hadith_number": "3497",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Daya Ke Atas Kesilapan",
        "perawi_melayu": "Khishif bin Malik daripada Ibnu Mas'ud",
        "english_text": "Not Available",
        "malay_translation": "Daripada Khishif bin Malik daripada Ibnu Mas'ud r.a, katanya: Rasulullah SAW telah menetapkan diyat bagi kesalahan sebanyak 20 ekor anak unta betina yang telah melahirkan, 20 ekor anak unta jantan yang telah melahirkan, 20 ekor anak unta betina yang menyusu, 20 ekor anak unta yang masih kecil dan 20 ekor anak unta yang telah disapih.  Riwayat Tirmizi, Abu Daud, Nasai.  Hadis ini sahih tetapi hanya sampai kepada Ibnu Mas'ud, manakala Khishif adalah seorang yang tidak dikenali kecuali melalui hadis ini.  Diriwayatkan dalam Syarah Sunnah bahawa Nabi SAW telah membayar diyat orang yang terbunuh di Khaibar dengan 100 ekor unta zakat.  Di dalam unta zakat tidak terdapat anak unta yang telah melahirkan, sebaliknya hanya terdapat anak unta yang menyusu.",
        "arabic_text": "وَعَنْ خِشْفِ بْنِ مَالِكٍ عَنِ ابْنِ مَسْعُودٍ قَالَ: قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي دِيَةِ الْخَطَأِ عِشْرِينَ بِنْتَ مَخَاضٍ وَعِشْرِينَ ابْنَ مَخَاضٍ ذُكُورٍ وَعِشْرِينَ بِنْتَ لَبُونٍ وَعِشْرِينَ جَذَعَةً وَعِشْرِينَ حِقَّةً . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَالصَّحِيحُ أَنَّهُ مَوْقُوفٌ عَلَى ابْنِ مَسْعُودٍ وَخِشْفٌ مَجْهُولٌ لَا يُعْرَفُ إِلَّا بِهَذَا الْحَدِيثِ وَرُوِيَ فِي شَرْحِ السُّنَّةِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَدَى قَتِيلَ خَيْبَرَ بِمِائَةٍ مِنْ إِبِلِ الصَّدَقَةِ وَلَيْسَ فِي أَسْنَانِ إِبِلِ الصَّدَقَةِ ابْنُ مَخَاضٍ إِنَّمَا فِيهَا ابْنُ لبون"
      },
      {
        "id": 32192,
        "hadith_number": "3498",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nilai Diat pada Zaman Rasulullah SAW dan Khalifah Umar",
        "perawi_melayu": "Amru bin Syuayb daripada bapanya daripada datuknya",
        "english_text": "Not Available",
        "malay_translation": "Daripada Amru bin Syuayb daripada bapanya daripada datuknya, beliau berkata: \"Nilai diat pada zaman Rasulullah SAW ialah lapan ratus dinar atau lapan ribu dirham. Diat Ahli Kitab ketika itu ialah separuh daripada diat orang Islam.  Kemudian, semasa pemerintahan Khalifah Umar RA, diat bagi mereka yang membayar dengan emas ialah seribu dinar, dan bagi mereka yang membayar dengan perak ialah dua belas ribu dirham, dan bagi mereka yang membayar dengan lembu ialah dua ratus ekor lembu, dan bagi mereka yang membayar dengan kambing ialah dua ribu ekor kambing, dan bagi mereka yang membayar dengan kain ialah dua ratus helai kain. Beliau (Umar) mengekalkan diat bagi Ahli Zimmah sepertimana sebelumnya, tanpa menaikkannya.\" Riwayat Abu Daud.",
        "arabic_text": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: كَانَتْ قِيمَةُ الدِّيَةِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَمَانِمِائَةِ دِينَارٍ أَوْ ثَمَانِيَةَ آلَافِ دِرْهَمٍ وَدِيَةُ أَهْلِ الْكِتَابِ يَوْمَئِذٍ النِّصْفُ مِنْ دِيَةِ الْمُسْلِمِينَ قَالَ: فَكَانَ كَذَلِكَ حَتَّى اسْتُخْلِفَ عُمَرُ رَضِيَ اللَّهُ عَنهُ عَلَى أَهْلِ الذَّهَبِ أَلْفَ دِينَارٍ وَعَلَى أَهْلِ الْوَرِقِ اثْنَيْ عَشَرَ أَلْفًا وَعَلَى أَهْلِ الْبَقَرِ مِائَتَيْ بَقَرَةٍ وَعَلَى أَهْلِ الشَّاءِ أَلْفَيْ شَاةٍ وَعَلَى أَهْلِ الْحُلَلِ مِائَتَيْ حُلَّةٍ قَالَ: وَتَرَكَ دِيَةَ أَهْلِ الذِّمَّةِ لَمْ يَرْفَعْهَا فِيمَا رَفَعَ من الدِّيَة. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32193,
        "hadith_number": "3499",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Diah Sebesar Dua Belas Ribu",
        "perawi_melayu": "Ibn Abbas daripada Nabi SAW",
        "english_text": "And from Ibn Abbas from the Prophet (ﷺ) that he made the Diya twelve thousand.",
        "malay_translation": "Daripada Ibnu Abbas daripada Nabi Muhammad SAW bahawa Baginda menetapkan diyat sebanyak dua belas ribu.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ جَعَلَ الدِّيَةَ اثْنَيْ عَشَرَ أَلْفًا. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَالدَّارِمِيُّ"
      },
      {
        "id": 32194,
        "hadith_number": "3500",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Diat Kesilapan dan Hukumnya",
        "perawi_melayu": "Amru bin Syu'aib daripada bapanya daripada datuknya",
        "english_text": "From Amru ibn Shu'aib from his father from his grandfather, who said: The Messenger of Allah (peace and blessings be upon him) used to assess the diyat for a mistake committed by the people of the villages as four hundred dinars or its equivalent in silver, and he would assess it based on the prices of camels. If the price went up, he would increase it and if the price went down, he would reduce it. It reached, during the time of the Messenger of Allah (peace and blessings be upon him), between four hundred dinars to eight hundred dinars, and its equivalent in silver was eight thousand dirhams. He said: And the Messenger of Allah (peace and blessings be upon him) judged that the diyat for the people of cows was two hundred cows, and for the people of sheep, two thousand sheep. And the Messenger of Allah (peace and blessings be upon him) said: “Indeed, the diyat is an inheritance among the heirs of the slain.” And the Messenger of Allah (peace and blessings be upon him) judged that the diyat of a woman is among her relatives, and the killer does not inherit anything.",
        "malay_translation": "Daripada Amru bin Syu'aib daripada bapanya daripada datuknya, berkata: Rasulullah SAW menetapkan diat bagi kesalahan yang dilakukan oleh penduduk kampung sebanyak empat ratus dinar atau nilainya dalam perak, dan baginda akan menetapkannya berdasarkan harga unta. Jika harga naik, baginda akan menaikkannya dan jika harga turun, baginda akan mengurangkannya. Ia mencecah, pada zaman Rasulullah SAW, antara empat ratus dinar hingga lapan ratus dinar, dan nilainya dalam perak ialah lapan ribu dirham. Baginda berkata: Dan Rasulullah SAW menetapkan diat bagi penduduk lembu ialah dua ratus ekor lembu, dan bagi penduduk biri-biri, dua ribu ekor biri-biri. Dan Rasulullah SAW bersabda:  “Sesungguhnya diat adalah pusaka di antara waris orang yang terbunuh.” Dan Rasulullah SAW menetapkan bahawa diat wanita adalah di kalangan kaum kerabatnya, dan pembunuh tidak mewarisi apa-apa.",
        "arabic_text": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَوِّمُ دِيَةَ الْخَطَأِ عَلَى أَهْلِ الْقُرَى أَرْبَعَمِائَةِ دِينَارٍ أَوْ عِدْلَهَا مِنَ الْوَرِقِ وَيُقَوِّمُهَا عَلَى أَثْمَانِ الْإِبِلِ فَإِذَا غَلَتْ رَفَعَ فِي قيمتِها وإِذا هاجَتْ رُخصٌ نَقَصَ مِنْ قِيمَتِهَا وَبَلَغَتْ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا بَيْنَ أَرْبَعِمِائَةِ دِينَارٍ إِلَى ثَمَانِمِائَةِ دِينَارٍ وَعِدْلُهَا مِنَ الْوَرِقِ ثَمَانِيَةُ آلَافِ دِرْهَمٍ قَالَ: وَقَضَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أَهْلِ الْبَقَرِ مِائَتَيْ بَقَرَةٍ وَعَلَى أَهْلِ الشَّاءِ أَلْفَيْ شَاةٍ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الْعَقْلَ مِيرَاثٌ بَيْنَ وَرَثَةِ الْقَتِيلِ» وَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ عَقْلَ الْمَرْأَةِ بَيْنَ عَصَبَتِهَا وَلَا يَرِثُ القاتلُ شَيْئا. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ"
      },
      {
        "id": 32195,
        "hadith_number": "3501",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman bagi Kesilapan yang Disengajakan dan Tidak Disengajakan",
        "perawi_melayu": "Sanad hadith ini diriwayatkan oleh Abu Daud daripada bapanya, daripada datuknya.",
        "english_text": "Not Available",
        "malay_translation": "Daripada baginda, daripada bapanya, daripada datuknya, bahawa Nabi SAW bersabda:  \"Kesilapan yang hampir sama dengan kesengajaan adalah sama berat hukumannya seperti kesengajaan, tetapi pelakunya tidak dibunuh.\" Riwayat Abu Daud.",
        "arabic_text": "وَعَنْهُ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «عَقْلُ شِبْهِ الْعَمْدِ مُغَلَّظٌ مِثْلُ عَقْلِ الْعَمْدِ وَلَا يُقْتَلُ صاحبُه» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32196,
        "hadith_number": "3502",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Denda Kecederaan Mata",
        "perawi_melayu": "Riwayat Abu Daud dan Nasai",
        "english_text": "And from him, from his father, from his grandfather, it was said: The Messenger of Allah (ﷺ) ruled that for a standing eye, the compensation is one-third of the Diya.",
        "malay_translation": "Daripada baginda, daripada bapanya, daripada datuknya, telah diriwayatkan bahawa Rasulullah SAW telah menetapkan hukuman bagi kecederaan mata yang masih berfungsi ialah satu pertiga daripada diyat.",
        "arabic_text": "وَعَنْهُ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْعَيْنِ الْقَائِمَةِ السَّادَّةِ لِمَكَانِهَا بِثُلْثِ الدِّيَةِ. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ"
      },
      {
        "id": 32197,
        "hadith_number": "3503",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Menggugurkan Kandungan",
        "perawi_melayu": "Muhammad bin Amr, daripada Abu Salamah, daripada Abu Hurairah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Muhammad bin Amr, daripada Abu Salamah, daripada Abu Hurairah r.a. bahawa Rasulullah SAW telah menetapkan hukum bagi kandungan (janin) sama ada hamba lelaki atau hamba perempuan, atau kuda, atau keldai.",
        "arabic_text": "وَعَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ: قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الجَنينِ بغُرَّةٍ: عَبْدٍ أَوْ أَمَةٍ أَوْ فَرَسٍ أَوْ بَغْلٍ. رَوَاهُ أَبُو دَاوُدَ وَقَالَ: رَوَى هَذَا الْحَدِيثَ حَمَّادُ بْنُ سَلَمَةَ وَخَالِدٌ الْوَاسِطِيُّ عَنْ مُحَمَّدِ بْنِ عَمْرٍو وَلَمْ يَذْكُرْ: أَوْ فَرَسٍ أَوْ بغل"
      },
      {
        "id": 32198,
        "hadith_number": "3504",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keharusan Menjaga Wangian Diri",
        "perawi_melayu": "Amru bin Syu'aib daripada bapanya daripada datuknya",
        "english_text": "Not Available",
        "malay_translation": "Daripada Amru bin Syu'aib daripada bapanya daripada datuknya, bahawa Rasulullah SAW bersabda:  \"Barangsiapa yang menggunakan wangian dan tidak diketahui wangian itu darinya, maka dia adalah penanggungjawabnya.\"  Riwayat Abu Daud dan an-Nasaie.",
        "arabic_text": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «من تطيب وَلَمْ يُعْلَمْ مِنْهُ طِبٌّ فَهُوَ ضَامِنٌ» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ"
      },
      {
        "id": 32199,
        "hadith_number": "3505",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keadilan Nabi SAW Terhadap Orang Miskin",
        "perawi_melayu": "Imran bin Husain",
        "english_text": "From Imran bin Husain: That a boy belonging to poor people cut the ear of a boy belonging to wealthy people. So the parents of the injured boy came to the Prophet (peace and blessings of Allah be upon him) and said: We are poor people. So he did not impose anything on them.",
        "malay_translation": "Daripada Imran bin Husain: bahawa seorang budak daripada kalangan orang miskin telah memotong telinga seorang budak daripada kalangan orang kaya. Maka datanglah ibu bapa budak yang cedera itu kepada Nabi SAW dan berkata: Kami adalah orang miskin. Maka baginda tidak mengenakan sebarang hukuman ke atas mereka.",
        "arabic_text": "وَعَن عِمْران بن حُصَينٍ: أَنَّ غُلَامًا لِأُنَاسٍ فُقَرَاءَ قَطَعَ أُذُنَ غُلَامٍ لِأُنَاسٍ أَغْنِيَاءَ فَأَتَى أَهْلُهُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا: إِنَّا أُنَاسٌ فُقَرَاءُ فَلَمْ يَجْعَلْ عَلَيْهِمْ شَيْئًا. رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ"
      },
      {
        "id": 32200,
        "hadith_number": "3506",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Daya Shubah Al-'Amd",
        "perawi_melayu": "Ali r.a.",
        "english_text": "From Ali (May Allah be pleased with him) that he said: The diya of Shibh al-'amd is thirty-three for a wound, thirty-three for a broken tooth and thirty-four for a broken bone. This applies to all years. In another narration: He said: In mistake, one-fourth is given as diya: twenty-five for a wound, twenty-five for a broken tooth, twenty-five for a broken bone. Abu Dawud narrated it.",
        "malay_translation": "Daripada Ali r.a. bahawa baginda berkata: Dhiya bagi kesalahan yang hampir kepada sengaja (syubah al-'amd) ialah tiga puluh tiga untuk luka, tiga puluh tiga untuk gigi patah dan tiga puluh empat untuk tulang patah. Ini meliputi semua tahun.  Dalam riwayat lain: Baginda berkata: Bagi kesalahan, seperempat diberikan sebagai dhiya: dua puluh lima untuk luka, dua puluh lima untuk gigi patah, dua puluh lima untuk tulang patah. Riwayat Abu Daud.",
        "arabic_text": "عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ قَالَ: دِيَةُ شِبْهِ الْعَمْدِ أَثْلَاثًا ثَلَاثٌ وَثَلَاثُونَ حِقَّةً وَثَلَاثٌ وَثَلَاثُونَ جَذَعَةً وَأَرْبَعٌ وَثَلَاثُونَ ثَنِيَّةً إِلَى بَازِلِ عَامِهَا كُلُّهَا خَلِفَاتٌ وَفِي رِوَايَةٍ: قَالَ: فِي الْخَطَأ أَربَاعًا: خَمْسَة وَعِشْرُونَ حِقَّةً وَخَمْسٌ وَعِشْرُونَ جَذَعَةً وَخَمْسٌ وَعِشْرُونَ بَنَاتِ لَبُونٍ وَخَمْسٌ وَعِشْرُونَ بَنَاتِ مَخَاضٍ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32201,
        "hadith_number": "3507",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keputusan Umar r.a. Mengenai Diyat dalam Kesalahan Syibh al-'Amd",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Teks Bahasa Inggeris tidak disediakan.",
        "malay_translation": "Daripada Mujahid berkata: 'Umar r.a. telah memutuskan mengenai *syibh al-'amd* (pembunuhan tidak sengaja yang menyerupai pembunuhan sengaja) dengan tiga puluh *Hiqqah*, tiga puluh *Jadha'ah*, dan empat puluh *Khalifah*, iaitu antara *Thaniyyah* dan *Bazil* pada tahun tersebut. Diriwayatkan oleh Abu Daud.",
        "arabic_text": "وَعَن مُجاهدٍ قَالَ: قَضَى عُمَرُ رَضِيَ اللَّهُ عَنْهُ فِي شِبْهِ الْعَمْدِ ثَلَاثِينَ حِقَّةً وَثَلَاثِينَ جَذَعَةً وَأَرْبَعِينَ خَلِفَةً مَا بَيْنَ ثَنِيَّةٍ إِلَى بَازِلِ عَامِهَا. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32202,
        "hadith_number": "3508",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Menggugurkan Kandungan",
        "perawi_melayu": "Sa'id bin al-Musayyab",
        "english_text": "From Sa'id bin al-Musayyab: That the Messenger of Allah ﷺ judged concerning a fetus that is killed in the womb of its mother, with the blood-money of a slave or a female slave.",
        "malay_translation": "Daripada Sa'id bin al-Musayyab: bahawa Rasulullah SAW telah menetapkan hukum bagi janin yang dibunuh di dalam rahim ibunya, dengan diyat (tebusan nyawa) seorang hamba atau hamba perempuan.",
        "arabic_text": "وَعَن سَعِيدِ بْنِ الْمُسَيَّبِ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى فِي الْجَنِينِ يُقْتَلُ فِي بَطْنِ أُمِّهِ بِغُرَّةِ عَبْدٍ أَوْ وَلِيدَةٍ. فَقَالَ الَّذِي قُضِيَ عليهِ: كيفَ أَغْرَمُ مَنْ لَا شَرِبَ وَلَا أَكَلَ وَلَا نَطَقَ وَلَا اسْتَهَلَّ وَمِثْلُ ذَلِكَ يُطَلُّ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّمَا هَذَا مِنْ إِخْوَانِ الْكُهَّانِ» . رَوَاهُ مالكٌ وَالنَّسَائِيّ مُرْسلا"
      },
      {
        "id": 32203,
        "hadith_number": "3509",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis daripada Abu Hurairah diriwayatkan oleh Abu Daud secara bersambung",
        "perawi_melayu": "Tidak dinyatakan perawi",
        "english_text": "The English text for this Hadith is not available.",
        "malay_translation": "Dan diriwayatkan oleh Abu Daud daripadanya daripada Abu Hurairah secara bersambung.",
        "arabic_text": "وَرَوَاهُ أَبُو دَاوُدَ عَنْهُ عَنْ أَبِي هُرَيْرَةَ مُتَّصِلا"
      },
      {
        "id": 32204,
        "hadith_number": "3510",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman bagi Kecederaan yang Disebabkan oleh Haiwan, Lombong, dan Perigi",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Teks Bahasa Inggeris tiada",
        "malay_translation": "Daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: 'Kecederaan yang disebabkan oleh haiwan adalah sia-sia (tidak dikenakan ganti rugi), lombong adalah sia-sia (tidak dikenakan ganti rugi), dan perigi adalah sia-sia (tidak dikenakan ganti rugi).'",
        "arabic_text": "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْعَجْمَاءُ جَرْحُهَا جُبَارٌ وَالْمَعْدِنُ جُبَارٌ وَالْبِئْرُ جُبَارٌ»"
      },
      {
        "id": 32205,
        "hadith_number": "3511",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Gigi Patah dalam Pertengkaran dan Pembelaan Diri",
        "perawi_melayu": "Tidak dinyatakan dalam teks ini",
        "english_text": "No English text provided for this Hadith.",
        "malay_translation": "Daripada Ya'la bin Umayyah RA berkata: \"Aku berperang bersama Rasulullah SAW dalam pasukan al-'Usrah (kesukaran). Aku mempunyai seorang pekerja upahan, lalu dia bergaduh dengan seseorang. Salah seorang daripada mereka menggigit yang lain. Orang yang digigit menarik tangannya dari mulut orang yang menggigit, lalu menyebabkan gigi seri orang yang menggigit itu patah dan jatuh. Dia (orang yang menggigit) pergi kepada Nabi SAW, lalu baginda membatalkan ganti rugi giginya dan bersabda: \"Adakah dia (orang yang digigit) membiarkan tangannya di dalam mulutmu untuk kamu menggigitnya seperti unta jantan?\"\"",
        "arabic_text": "وَعَنْ يَعْلَى بْنِ أُمَيَّةَ قَالَ: غَزَوْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَيْشَ الْعُسْرَةِ وَكَانَ لِي أَجِيرٌ فقاتلَ إِنساناً فعض أَحدهمَا الْآخَرِ فَانْتَزَعَ الْمَعْضُوضُ يَدَهُ مِنْ فِي الْعَاضِّ فَأَنْدَرَ ثَنِيَّتَهُ فَسَقَطَتْ فَانْطَلَقَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَهْدَرَ ثَنِيَّتَهُ وَقَالَ: «أَيَدَعُ يَدَهُ فِي فِيكَ تَقْضِمُهَا كَالْفَحْلِ»"
      },
      {
        "id": 32206,
        "hadith_number": "3512",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Syahid Kerana Mempertahankan Harta",
        "perawi_melayu": "Abdullah bin Amr",
        "english_text": "From Abdullah ibn Amr, he said: I heard the Messenger of Allah (peace and blessings be upon him) say: “Whoever is killed in defense of his property is a martyr.”",
        "malay_translation": "Daripada Abdullah bin Amr, beliau berkata: Saya mendengar Rasulullah SAW bersabda:  “Sesiapa yang terbunuh mempertahankan hartanya, maka dia adalah syahid.”",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شهيدٌ»"
      },
      {
        "id": 32207,
        "hadith_number": "3513",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pertahanan Diri dan Hukuman Pembunuhan",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "And from Abu Hurairah (RA) who said: A man came and said: O Messenger of Allah, what if a man comes wanting to take my wealth? He said: \"Then do not give him your wealth.\" He said: What if he fights me? He said: \"Fight him.\" He said: What if he kills me? He said: \"Then you are a martyr.\" He said: What if I kill him? He said: \"He is in the Fire.\"",
        "malay_translation": "Daripada Abu Hurairah r.a. berkata: Seorang lelaki datang dan bertanya: Wahai Rasulullah, bagaimana jika seseorang datang ingin mengambil harta benda saya? Baginda menjawab:  \"Maka jangan berikan hartamu kepadanya.\" Lelaki itu bertanya lagi: Bagaimana jika dia menyerang saya? Baginda menjawab: \"Lawanlah dia.\" Lelaki itu bertanya lagi: Bagaimana jika dia membunuh saya? Baginda menjawab:  \"Maka engkau adalah syahid.\" Lelaki itu bertanya lagi: Bagaimana jika saya membunuhnya? Baginda menjawab: \"Dia berada di dalam neraka.\" Riwayat Muslim.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: جَاءَ رَجُلٌ فَقَالَ: يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ جَاءَ رَجُلٌ يُرِيدُ أَخْذَ مَالِي؟ قَالَ: «فَلَا تُعْطِهِ مَالَكَ» قَالَ: أَرَأَيْتَ إِنْ قَاتَلَنِي؟ قَالَ: «قَاتِلْهُ» قَالَ: أَرَأَيْتَ إِنْ قَتَلَنِي؟ قَالَ: «فَأَنْتَ شَهِيدٌ» . قَالَ: أَرَأَيْتَ إِنْ قَتَلْتُهُ؟ قَالَ: «هُوَ فِي النَّارِ» . رَوَاهُ مُسلم"
      },
      {
        "id": 32208,
        "hadith_number": "3514",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tiada Dosa Jika Mencederakan Penceroboh",
        "perawi_melayu": "Riwayat yang sahih,  namun perawi spesifik tidak dinyatakan dalam data.",
        "english_text": "Not Available",
        "malay_translation": "Daripada sebuah riwayat, bahawa Rasulullah SAW bersabda:  “Sekiranya seseorang menceroboh rumahmu tanpa izin dan engkau mencederakannya dengan sebiji batu sehingga menyebabkan matanya buta, engkau tidak berdosa.”",
        "arabic_text": "وَعَنْهُ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَوِ اطَّلَعَ فِي بَيْتِكَ أحدٌ ولمْ تَأذن لَهُ فخذفته بحصاة ففتأت عَيْنَهُ مَا كَانَ عَلَيْكَ مِنْ جُنَاحٍ»"
      },
      {
        "id": 32209,
        "hadith_number": "3515",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tujuan Disyariatkan Meminta Izin Masuk Rumah",
        "perawi_melayu": "(Tidak dinyatakan)",
        "english_text": "See Malay Translation",
        "malay_translation": "Daripada Sahl bin Saad RA: Sesungguhnya seorang lelaki mengintai melalui lubang di pintu rumah Rasulullah SAW. Pada ketika itu, Rasulullah SAW sedang memegang sisir besi dan menggaru kepalanya. Baginda bersabda, 'Jika aku tahu kamu sedang mengintai, nescaya aku akan mencucuk matamu dengan sisir ini. Sesungguhnya, tujuan meminta izin masuk adalah untuk menjaga pandangan.'",
        "arabic_text": "وَعَن سهل بنِ سعد: أَنَّ رَجُلًا اطَّلَعَ فِي جُحْرٍ فِي بَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِدْرًى يَحُكُّ بِهِ رَأْسَهُ فَقَالَ: «لَوْ أَعْلَمُ أَنَّكَ تنظُرُني لطَعَنْتُ بهِ فِي عَيْنَيْكَ إِنَّمَا جُعِلَ الِاسْتِئْذَانُ مِنْ أَجْلِ الْبَصَرِ»"
      },
      {
        "id": 32210,
        "hadith_number": "3516",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Melempar Batu",
        "perawi_melayu": "Abdullah bin Mughaffal",
        "english_text": "From Abdullah bin Mughaffal, that he saw a man throwing stones, and he said: \"Do not throw stones, for the Messenger of Allah (ﷺ) forbade throwing stones, and said: \"Verily, with it no game is hunted, nor is an enemy wounded with it, but it may break a tooth or put out an eye.\"",
        "malay_translation": "Daripada Abdullah bin Mughaffal, bahawa beliau melihat seorang lelaki sedang melontar batu, lalu beliau berkata: \"Jangan melontar batu, kerana Rasulullah SAW melarang melontar batu, dan baginda bersabda:  \"Sesungguhnya dengannya tiada binatang buruan dapat diburu, dan musuh pun tidak dapat dilukai dengannya, tetapi ia boleh mematahkan gigi atau membutakan mata.\"",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ أَنَّهُ رَأَى رَجُلًا يَخْذِفُ فَقَالَ: لَا تَخْذِفْ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الْخَذْفِ وَقَالَ: «إِنَّهُ لَا يُصَادُ بِهِ صَيْدٌ وَلَا يُنْكَأُ بِهِ عَدُوٌّ وَلَكِنَّهَا قَدْ تَكْسِرُ السِّنَّ وَتَفْقَأُ الْعَيْنَ»"
      },
      {
        "id": 32211,
        "hadith_number": "3517",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Berhati-hati dengan Anak Panah di Masjid dan Pasar",
        "perawi_melayu": "Abu Musa",
        "english_text": "Daripada Abu Musa RA berkata: Rasulullah SAW bersabda: “Apabila salah seorang daripada kamu melalui masjid kami atau pasar kami dengan membawa anak panah, maka hendaklah dia memegang mata panahnya, jangan sampai ia mengenai seorang pun dari kaum Muslimin dengan sesuatu daripadanya.”",
        "malay_translation": "Daripada Abu Musa RA, beliau berkata: Rasulullah SAW bersabda: “Apabila salah seorang daripada kamu melalui masjid kami atau pasar kami dengan membawa anak panah, maka hendaklah dia memegang mata panahnya, jangan sampai ia mengenai seorang pun dari kaum Muslimin dengan sesuatu daripadanya.”",
        "arabic_text": "وَعَنْ أَبِي مُوسَى قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا مَرَّ أَحَدُكُمْ فِي مَسْجِدِنَا وَفِي سُوقِنَا وَمَعَهُ نَبْلٌ فَلْيُمْسِكْ عَلَى نِصَالِهَا أَنْ يُصِيبَ أَحَدًا مِنَ الْمُسْلِمِينَ مِنْهَا بِشَيْءٍ»"
      },
      {
        "id": 32212,
        "hadith_number": "3518",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menunjuk dengan Senjata",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "And from Abu Hurairah, he said: The Messenger of Allah (peace and blessings of Allah be upon him) said: “None of you should point his weapon at his brother, for he does not know but that Satan may cause it to slip from his hand and he may fall into a pit of Fire.”",
        "malay_translation": "Daripada Abu Hurairah, katanya: Rasulullah SAW bersabda:  “Janganlah sesiapa di antara kamu menghala senjata ke arah saudaranya, kerana dia tidak tahu, mungkin syaitan akan menyebabkan senjata itu tergelincir dari tangannya lalu dia jatuh ke dalam neraka.”",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يُشِيرُ أَحَدُكُمْ عَلَى أَخِيهِ بِالسِّلَاحِ فَإِنَّهُ لَا يَدْرِي لَعَلَّ الشَّيْطَانَ يَنْزِعُ فِي يَدِهِ فَيَقَعُ فِي حُفْرَة من النَّار»"
      },
      {
        "id": 32213,
        "hadith_number": "3519",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mengacukan Senjata kepada Saudara",
        "perawi_melayu": "Bukhari",
        "english_text": "On the authority of Abu Hurairah (may Allah be pleased with him) who said: The Messenger of Allah (peace and blessings of Allah be upon him) said, \"Whoever points a weapon at his brother, the angels curse him until he puts it down, even if he is his brother from the same father and mother.\" Narrated by Bukhari.",
        "malay_translation": "Daripada Abu Hurairah RA berkata: Rasulullah SAW bersabda, \"Sesiapa yang mengacukan senjata tajam kepada saudaranya, maka malaikat akan melaknatinya sehingga dia meletakkannya, walaupun dia adalah saudara kandungnya sendiri.\" Riwayat Bukhari.",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَشَارَ إِلَى أَخِيهِ بِحَدِيدَةٍ فَإِنَّ الْمَلَائِكَةَ تَلْعَنُهُ حَتَّى يَضَعَهَا وَإِنْ كَانَ أخاهُ لأبيهِ وَأمه» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32214,
        "hadith_number": "3520",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mereka yang Membawa Senjata Terhadap Kita Bukan dari Kalangan Kita",
        "perawi_melayu": "Ibn Umar dan Abu Hurairah r.a.",
        "english_text": "From Ibn Umar and Abu Hurairah (may Allah be pleased with them) from the Prophet (peace and blessings of Allah be upon him), who said: “Whoever bears arms against us is not of us.” Bukhari narrated it, and Muslim added: “And whoever deceives us is not of us.”",
        "malay_translation": "Daripada Ibn Umar dan Abu Hurairah r.a., daripada Nabi SAW, baginda bersabda:  “Barangsiapa mengangkat senjata terhadap kita, maka dia bukanlah daripada kalangan kita.”  Riwayat Bukhari. Muslim menambah: “Dan barangsiapa menipu kita, maka dia bukanlah daripada kalangan kita.”",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ وَأَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُمْ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ حَمَلَ عَلَيْنَا السِّلَاحَ فَلَيْسَ مِنَّا» . رَوَاهُ البُخَارِيّ وزادَ مُسلم: «ومنْ غشَّنا فليسَ منَّا»"
      },
      {
        "id": 32215,
        "hadith_number": "3521",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Bukan dari Golongan Kami Jika Menghunus Pedang",
        "perawi_melayu": "Salamah ibn al-Akwa'",
        "english_text": "Teks Bahasa Inggeris Kosong",
        "malay_translation": "Daripada Salamah ibn al-Akwa' RA berkata: Rasulullah SAW bersabda: “Sesiapa yang menghunus pedang terhadap kita, maka dia bukan daripada golongan kita.” Riwayat Muslim",
        "arabic_text": "وَعَنْ سَلَمَةَ بْنِ الْأَكْوَعِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ سَلَّ علينا السَّيفَ فليسَ منَّا» . رَوَاهُ مُسلم"
      },
      {
        "id": 32216,
        "hadith_number": "3522",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Azab Allah ke atas Mereka yang Menyeksa Orang Lain",
        "perawi_melayu": "Hisham bin Urwah daripada bapanya",
        "english_text": "Not Available",
        "malay_translation": "Daripada Hisyam bin Urwah daripada bapanya, bahawa Hisyam bin Hakim melalui Syam dan melihat sekumpulan orang Nabati yang sedang didedahkan kepada cahaya matahari dan minyak dituangkan ke atas kepala mereka.  Maka dia bertanya, \"Apakah ini?\"  Dikatakan, \"Mereka diseksa kerana cukai.\"  Maka Hisyam berkata, \"Aku bersaksi bahawa aku telah mendengar Rasulullah SAW bersabda:  \"Sesungguhnya Allah SWT menyeksa orang-orang yang menyeksa manusia di dunia.\"  (Riwayat Muslim)",
        "arabic_text": "وَعَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ أَنَّ هشامَ بنَ حكيمٍ مَرَّ بِالشَّامِ عَلَى أُنَاسٍ مِنَ الْأَنْبَاطِ وَقَدْ أُقِيموا فِي الشَّمسِ وصُبَّ على رُؤوسِهِمُ الزَّيْتُ فَقَالَ: مَا هَذَا؟ قِيلَ: يُعَذَّبُونَ فِي الخَراجِ فَقَالَ هِشَامٌ: أَشْهَدُ لَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ اللَّهَ يُعَذِّبُ الَّذِينَ يُعذبونَ النَّاسَ فِي الدُّنْيَا» . رَوَاهُ مُسلم"
      },
      {
        "id": 32217,
        "hadith_number": "3523",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Orang yang Memegang Kekuasaan dengan Zalim dan Mendapat Kemurkaan Allah",
        "perawi_melayu": "Abu Hurairah RA",
        "english_text": "On the authority of Abu Hurairah who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: 'Soon, if you live for a long time, you will see people in whose hands are like the tails of cows, who go out in the wrath of Allah and return in the displeasure of Allah.' And in a narration: 'And return in the curse of Allah.' Related by Muslim.",
        "malay_translation": "Daripada Abu Hurairah RA berkata: Rasulullah SAW bersabda: 'Hampir tiba masanya jika umurmu panjang, kamu akan melihat kaum yang di tangan mereka seperti ekor lembu, mereka pergi pada waktu pagi dalam kemurkaan Allah dan kembali pada waktu petang dalam kemarahan Allah.' Dalam riwayat lain: 'Dan kembali pada waktu petang dalam laknat Allah.' Riwayat Muslim.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يُوشِكُ إِنْ طَالَتْ بك مُدَّة أَن ترى أَقْوَامًا فِي أَيْدِيهِمْ مِثْلُ أَذْنَابِ الْبَقَرِ يَغْدُونَ فِي غَضَبِ اللَّهِ وَيَرُوحُونَ فِي سَخَطِ اللَّهِ» . وَفِي رِوَايَةٍ: «وَيَرُوحُونَ فِي لَعْنَةِ اللَّهِ» . رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 32218,
        "hadith_number": "3524",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Dua Golongan Ahli Neraka",
        "perawi_melayu": "Riwayat Muslim",
        "english_text": "Not Available",
        "malay_translation": "Daripada baginda SAW, baginda bersabda:  \"Dua golongan daripada ahli neraka yang aku tidak pernah melihatnya:  Segolongan lelaki yang membawa cambuk seperti ekor lembu, mereka memukul manusia dengannya, dan segolongan wanita yang berpakaian tetapi bertelanjang, mereka mengayun-ayunkan badan mereka (berlenggok-lenggok), kepala mereka seperti bonggol unta yang condong. Mereka tidak akan masuk syurga dan tidak akan mencium baunya, padahal sesungguhnya baunya dihidu dari jarak sekian-sekian.\" Riwayat Muslim",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: صِنْفَانِ مِنْ أَهْلِ النَّارِ لَمْ أَرَهُمَا: قَوْمٌ مَعَهُمْ سِيَاطٌ كَأَذْنَابِ الْبَقَرِ يَضْرِبُونَ بِهَا النَّاسَ وَنِسَاءٌ كَاسِيَاتٌ عَارِيَاتٌ مُمِيلَاتٌ مَائِلَاتٌ رؤوسهم كَأَسْنِمَةِ الْبُخْتِ الْمَائِلَةِ لَا يَدْخُلْنَ الْجَنَّةَ وَلَا يَجِدْنَ رِيحَهَا وَإِنَّ رِيحَهَا لَتُوجَدُ مِنْ مَسِيرَةِ كَذَا وَكَذَا . رَوَاهُ مُسلم"
      },
      {
        "id": 32219,
        "hadith_number": "3525",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menghindari Muka Semasa Bertarung",
        "perawi_melayu": "Tidak dinyatakan dalam data asal.",
        "english_text": "Not Available",
        "malay_translation": "Daripada baginda ﷺ diriwayatkan bahawa Rasulullah SAW bersabda:  “Apabila seseorang di antara kamu berperang, maka hendaklah dia mengelakkan daripada menyerang muka. Sesungguhnya Allah SWT telah menciptakan Adam a.s.  berdasarkan rupa-Nya.”",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا قَاتَلَ أَحَدُكُمْ فَلْيَجْتَنِبِ الْوَجْهَ فَإِنَّ اللَّهَ خَلَقَ آدَمَ عَلَى صُورَتِهِ»"
      },
      {
        "id": 32220,
        "hadith_number": "3526",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Mengintai ke Dalam Rumah Tanpa Izin",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Abu Dharr reported: The Messenger of Allah (peace and blessings be upon him) said, “Whoever uncovers a screen and casts his gaze into a house before he is given permission and sees the private parts of its inhabitants, then he has committed a transgression that is not lawful for him to commit. If when he cast his gaze, a man met him and gouged out his eye, I would not blame him. If a man passes by a door with no screen that is not closed, and he looks, there is no sin upon him. Verily, sin is upon the inhabitants of the house.” Tirmidhi narrated it and said: This is a gharib hadith.",
        "malay_translation": "Daripada Abu Dharr RA berkata: Rasulullah SAW bersabda, “Sesiapa yang membuka tirai dan melemparkan pandangannya ke dalam rumah sebelum diizinkan baginya, lalu dia melihat aurat ahli rumah tersebut, maka sesungguhnya dia telah melakukan suatu pelanggaran yang tidak halal baginya untuk melakukannya. Sekiranya ketika dia melemparkan pandangannya, seorang lelaki menemuinya lalu mencungkil matanya, nescaya aku tidak akan mencelanya. Dan sekiranya seorang lelaki melalui pintu yang tidak bertirai dan tidak tertutup, lalu dia melihat, maka tidak ada dosa baginya. Sesungguhnya dosa itu atas ahli rumah.” Riwayat Tirmizi dan beliau berkata: Hadis ini adalah hadis gharib.",
        "arabic_text": "عَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَشَفَ سِتْرًا فَأَدْخَلَ بَصَرَهُ فِي الْبَيْتِ قَبْلَ أَنْ يُؤْذَنَ لَهُ فَرَأَى عَوْرَةَ أَهْلِهِ فَقَدْ أَتَى حَدًّا لَا يَحِلُّ لَهُ أَنْ يَأْتِيَهُ وَلَوْ أَنَّهُ حِينَ أَدْخَلَ بَصَرَهُ فَاسْتَقْبَلَهُ رَجُلٌ فَفَقَأَ عَيْنَهُ مَا عَيَّرْتُ عَلَيْهِ وَإِنْ مَرَّ الرَّجُلُ عَلَى بَابٍ لَا سِتْرَ لَهُ غَيْرِ مُغْلَقٍ فَنَظَرَ فَلَا خَطِيئَةَ عَلَيْهِ إِنَّمَا الْخَطِيئَةُ عَلَى أَهْلِ الْبَيْتِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيب"
      },
      {
        "id": 32221,
        "hadith_number": "3527",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mengacukan Pedang",
        "perawi_melayu": "Jabir",
        "english_text": "From Jabir, he said: The Messenger of Allah (peace and blessings be upon him) forbade the drawing of the unsheathed sword.",
        "malay_translation": "Dari Jabir, katanya: Rasulullah SAW melarang daripada mencabut pedang yang belum diasah.",
        "arabic_text": "وَعَنْ جَابِرٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُتَعَاطَى السَّيْفُ مَسْلُولًا. رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد"
      },
      {
        "id": 32222,
        "hadith_number": "3528",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menggunting Rambut Di Antara Dua Jari",
        "perawi_melayu": "Hasan daripada Samurah",
        "english_text": "From Hasan from Samurah that the Messenger of Allah (peace and blessings of Allah be upon him) forbade cutting hair between two fingers.",
        "malay_translation": "Daripada Hasan daripada Samurah bahawa Rasulullah SAW melarang menggunting rambut di antara dua jari.",
        "arabic_text": "وَعَن الحسنِ عَنْ سَمُرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُقَدَّ السَّيْرُ بَيْنَ أُصبعَينِ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32223,
        "hadith_number": "3529",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Syahid Kerana Mempertahankan Agama, Darah, Harta dan Keluarga",
        "perawi_melayu": "Said bin Zaid",
        "english_text": "Not Available",
        "malay_translation": "Daripada Said bin Zaid, bahawa Rasulullah SAW bersabda: \"Sesiapa yang terbunuh mempertahankan agamanya, maka dia adalah syahid. Dan sesiapa yang terbunuh mempertahankan darahnya, maka dia adalah syahid. Dan sesiapa yang terbunuh mempertahankan hartanya, maka dia adalah syahid. Dan sesiapa yang terbunuh mempertahankan keluarganya, maka dia adalah syahid.\" Riwayat Tirmizi, Abu Daud dan Nasai.",
        "arabic_text": "وَعَن سعيدِ بنِ زيدٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قُتِلَ دُونَ دِينِهِ فَهُوَ شَهِيدٌ وَمَنْ قُتِلَ دُونَ دَمِهِ فَهُوَ شَهِيدٌ وَمَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ وَمَنْ قُتِلَ دُونَ أَهْلِهِ فَهُوَ شَهِيدٌ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ"
      },
      {
        "id": 32224,
        "hadith_number": "3530",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tujuh Pintu Neraka: Pedang Terhadap Umat Nabi",
        "perawi_melayu": "Ibn Umar",
        "english_text": "From Ibn Umar (may Allah be pleased with them both) from the Prophet (peace and blessings of Allah be upon him), who said: \"For Hellfire there are seven gates: one of them is for those who draw the sword against my Ummah or said: against the Ummah of Muhammad.\"",
        "malay_translation": "Daripada Ibnu Umar رضي الله عنهما, daripada Nabi SAW, baginda bersabda:  \"Sesungguhnya neraka jahanam mempunyai tujuh pintu.  Salah satu daripadanya adalah untuk orang yang menghunus pedang ke atas umatku atau (beliau juga bersabda): ke atas umat Muhammad.\"  Hadis ini diriwayatkan oleh Imam Tirmizi dan beliau menyebutnya sebagai hadis yang gharib. Hadis Abu Hurairah:  \"Lelaki yang sombong/derhaka\" disebut dalam Bab Kemarahan. Bab ini tidak terdapat dalam bahagian ketiga.",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: لِجَهَنَّمَ سَبْعَةُ أَبْوَابٍ: بَابٌ مِنْهَا لِمَنْ سَلَّ السَّيْفَ عَلَى أُمَّتِي أَوْ قَالَ: عَلَى أُمَّةِ مُحَمَّدٍ . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ وَحَدِيثُ أَبِي هُرَيْرَةَ: «الرِّجْلُ جُبَارٌ» ذُكِرَ فِي «بَابِ الْغَضَب» هَذَا الْبَاب خَال من الْفَصْل الثَّالِث"
      },
      {
        "id": 32225,
        "hadith_number": "3531",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Fidyah bagi sahabat yang terkorban di Khaibar",
        "perawi_melayu": "Rafi' bin Khadij dan Sahal bin Abi Hatsmah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Rafi' bin Khadij dan Sahal bin Abi Hatsmah, mereka berdua meriwayatkan bahawa Abdullah bin Sahal dan Muhaysah bin Mas'ud pergi ke Khaibar. Kemudian mereka berpecah di antara pokok kurma. Lalu Abdullah bin Sahal terbunuh.  Maka datanglah Abdur Rahman bin Sahal, Huwaisah dan Muhaysah anak-anak Mas'ud kepada Nabi SAW, lalu mereka menceritakan tentang sahabat mereka yang terbunuh. Abdur Rahman yang paling muda di antara mereka mula bersuara. Nabi SAW bersabda: “Biarkan orang yang lebih tua yang berbicara.” Kemudian mereka menceritakan hal tersebut. Nabi SAW bersabda:  «Tetapkanlah hak ganti rugi bagi sahabat kamu yang terbunuh dengan sumpah lima puluh orang di antara kamu.» Mereka berkata: “Wahai Rasulullah, ini adalah perkara yang belum pernah kami lihat.” Baginda bersabda: “Maka, adakah orang Yahudi akan membebaskan kamu dengan sumpah lima puluh orang di antara mereka?” Mereka menjawab: “Wahai Rasulullah, mereka adalah kaum kafir.” Maka Rasulullah SAW menebus sahabat mereka itu daripada pihak baginda sendiri. Dalam satu riwayat lain: «Kamu bersumpah sebanyak lima puluh kali dan  kamu akan mendapat ganti rugi bagi sahabatmu yang terbunuh». Maka Rasulullah SAW menebusnya daripada pihak baginda sendiri dengan seratus ekor unta. Bab ini tidak mempunyai bahagian kedua.",
        "arabic_text": "عَنْ رَافِعِ بْنِ خَدِيجٍ وَسَهْلِ بْنِ أَبِي حَثْمة أَنَّهُمَا حَدَّثَا أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ وَمُحَيِّصَةَ بْنَ مَسْعُودٍ أَتَيَا خَيْبَرَ فَتَفَرَّقَا فِي النَّخْلِ فَقُتِلَ عَبْدُ اللَّهِ بْنُ سَهْلٍ فَجَاءَ عَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ وَحُوَيِّصَةُ وَمُحَيِّصَةُ ابْنَا مَسْعُودٍ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَكَلَّمُوا فِي أَمْرِ صَاحِبِهِمْ فَبَدَأَ عَبْدُ الرَّحْمَنِ وَكَانَ أَصْغَر الْقَوْم فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: كبر الْكبر قَالَ يحيى بن سعد: يَعْنِي لِيَلِيَ الْكَلَامَ الْأَكْبَرُ فَتَكَلَّمُوا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اسْتَحِقُّوا قَتِيلَكُمْ أَوْ قَالَ صَاحِبَكُمْ بِأَيْمَانِ خَمْسِينَ مِنْكُمْ» . قَالُوا: يَا رَسُولَ اللَّهِ أَمْرٌ لَمْ نَرَهُ قَالَ: فَتُبَرِّئُكُمْ يَهُودُ فِي أَيْمَانِ خَمْسِينَ مِنْهُمْ؟ قَالُوا: يَا رَسُولَ اللَّهِ قَوْمٌ كُفَّارٌ فَفَدَاهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ قِبَلِهِ. وَفِي رِوَايَةٍ: «تَحْلِفُونَ خَمْسِينَ يَمِينًا وَتَسْتَحِقُّونَ قَاتِلَكُمْ أَوْ صَاحِبَكُمْ» فَوَدَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ عِنْده بِمِائَة نَاقَة وَهَذَا الْبَاب خَال من الْفَصْل الثَّانِي"
      },
      {
        "id": 32226,
        "hadith_number": "3532",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pembayaran Diyat dari Rasulullah SAW bagi Pembunuhan di Khaibar",
        "perawi_melayu": "Rafi' bin Khadij",
        "english_text": "From Rafi' bin Khadij RA said: A man from the Ansar was found murdered in Khaibar. Then his heirs went to the Prophet SAW and informed him of the matter. The Prophet asked: 'Do you have two witnesses who can testify against the killer of your companion?' They replied: 'O Messenger of Allah, there was no Muslim there, indeed they are Jews and they dare to do greater than this.' The Prophet said: 'Choose fifty people from them and have them swear an oath.' They refused to swear, so the Messenger of Allah SAW paid the diyat (blood money) for him from his own property. Narrated by Abu Dawood.",
        "malay_translation": "Daripada Rafi' bin Khadij RA berkata: Seorang lelaki dari kalangan Ansar ditemui mati dibunuh di Khaibar.  Maka, waris-warisnya pergi kepada Nabi SAW dan memaklumkan perkara tersebut kepada baginda. Baginda bertanya: \"Adakah kamu mempunyai dua orang saksi yang boleh bersaksi terhadap pembunuh sahabat kamu?\" Mereka menjawab: \"Wahai Rasulullah, tidak ada seorang pun Muslim di sana, sesungguhnya mereka adalah Yahudi dan mereka berani melakukan perkara yang lebih besar daripada ini.\" Baginda bersabda: \"Pilihlah lima puluh orang daripada mereka dan suruh mereka bersumpah.\" Mereka enggan bersumpah, lalu Rasulullah SAW membayar diyat (pampasan) untuknya dari harta baginda sendiri. Riwayat Abu Daud.",
        "arabic_text": "عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ: أَصْبَحَ رَجُلٌ مِنَ الْأَنْصَارِ مَقْتُولًا بِخَيْبَرَ فَانْطَلَقَ أَوْلِيَاؤُهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرُوا ذَلِكَ لَهُ فَقَالَ: «أَلَكُمْ شَاهِدَانِ يَشْهَدَانِ عَلَى قَاتِلِ صَاحِبِكُمْ؟» قَالُوا: يَا رَسُولَ اللَّهِ لَمْ يَكُنْ ثَمَّ أحدٌ من المسلمينَ وإِنما هُوَ يهود وَقد يجترئون عَلَى أَعْظَمَ مِنْ هَذَا قَالَ: «فَاخْتَارُوا مِنْهُمْ خَمْسِينَ فَاسْتَحْلِفُوهُمْ» . فَأَبَوْا فَوَدَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عِنْدِهِ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32227,
        "hadith_number": "3533",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ali dan Hukuman terhadap Zindiq",
        "perawi_melayu": "Uqbah bin Abi Muzahim al-Ansari",
        "english_text": "It was narrated from Ikrimah that Ali ibn Abi Talib burned some Zanadiqa. This reached Ibn Abbas, who said: \"If I had been in his place, I would not have burned them, because of the Messenger of Allah (ﷺ)'s prohibition: 'Do not punish with the punishment of Allah.' Rather, I would have killed them, because of the saying of the Messenger of Allah (ﷺ): 'Whoever changes his religion, kill him.'",
        "malay_translation": "Daripada Ikrimah, beliau berkata: Ali bin Abi Talib telah membakar sesetengah zanadiqa. Perkara ini sampai kepada Ibnu Abbas, lalu beliau berkata: \"Sekiranya aku berada di tempatnya, aku tidak akan membakar mereka, kerana larangan Rasulullah SAW: 'Janganlah kamu menjatuhkan hukuman seksa Allah SWT.' Sebaliknya, aku akan membunuh mereka, berdasarkan sabda Rasulullah SAW: 'Barangsiapa yang menukar agamanya, bunuhlah dia.'",
        "arabic_text": "عَنْ عِكْرِمَةَ قَالَ: أُتِيَ عَلِيٌّ بِزَنَادِقَةٍ فَأَحْرَقَهُمْ فَبَلَغَ ذَلِكَ ابْنَ عَبَّاسٍ فَقَالَ: لَوْ كُنْتُ أَنَا لَمْ أُحْرِقْهُمْ لِنَهْيِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تُعَذِّبُوا بِعَذَابِ اللَّهِ» وَلَقَتَلْتُهُمْ لِقَوْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ بَدَّلَ دِينَهُ فَاقْتُلُوهُ» . رَوَاهُ الْبُخَارِيُّ"
      },
      {
        "id": 32228,
        "hadith_number": "3534",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Allah SWT Sahaja Yang Menyeksa di Neraka",
        "perawi_melayu": "Abdullah bin Abbas",
        "english_text": "From Abdullah ibn Abbas, who said: The Messenger of Allah (ﷺ) said: \"Verily, none but Allah will punish in the Fire.\"",
        "malay_translation": "Daripada Abdullah bin Abbas, yang berkata: Rasulullah SAW bersabda:  \"Sesungguhnya, tiada melainkan Allah sahaja yang akan menyeksa di dalam neraka.\"",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِن النَّارَ لَا يُعَذِّبُ بِهَا إِلَّا اللَّهُ» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32229,
        "hadith_number": "3535",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ciri-ciri Golongan Sesat di Akhir Zaman",
        "perawi_melayu": "Ali RA",
        "english_text": "On the authority of Ali (RA) who said: I heard the Messenger of Allah (ﷺ) say: \"There will emerge in the last days (of the world) a people who will be young in age and foolish, they will use (to quote) the best word of the creation (Quran), but their faith will not go beyond their throats (i.e., they will have no faith), and they will pass through (out of) (profess) Islam as an arrow passes through the game, so wherever you find them, kill them, for whoever kills them there would be reward for him on the Day of Resurrection.\"",
        "malay_translation": "Daripada Ali RA berkata: Aku mendengar Rasulullah SAW bersabda: \"Akan muncul suatu kaum di akhir zaman, yang muda usia dan bodoh akal, mereka berkata dari sebaik-baik perkataan manusia (Al-Quran), iman mereka tidak melampaui kerongkongan mereka, mereka keluar dari agama seperti anak panah melesat dari busurnya, maka di mana saja kamu menemui mereka, bunuhlah mereka, kerana sesungguhnya dalam membunuh mereka ada pahala bagi yang membunuh mereka pada hari kiamat.\"",
        "arabic_text": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «سَيَخْرُجُ قَوْمٌ فِي آخِرِ الزَّمَانِ حُدَّاثُ الْأَسْنَانِ سُفَهَاءُ الْأَحْلَامِ يَقُولُونَ مِنْ خَيْرِ قَوْلِ الْبَرِيَّةِ لَا يُجَاوِزُ إِيمَانُهُمْ حَنَاجِرَهُمْ يَمْرُقُونَ مِنَ الدِّينِ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ فَأَيْنَمَا لَقِيتُمُوهُمْ فَاقْتُلُوهُمْ فَإِنَّ فِي قَتْلِهِمْ أَجْرًا لمن قَتلهمْ يَوْم الْقِيَامَة»"
      },
      {
        "id": 32230,
        "hadith_number": "3536",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Dua Puak dalam Ummat Nabi SAW dan Kemunculan Puak yang Murtad",
        "perawi_melayu": "Abu Said al-Khudri",
        "english_text": "And from Abu Said al-Khudri, it has been narrated that the Messenger of Allah (ﷺ) said: “My ummah will be divided into two groups, and from among them will emerge a group of rebels who will kill those who are nearest to the truth.” Narrated by Muslim",
        "malay_translation": "Daripada Abu Said al-Khudri, diriwayatkan bahawa Rasulullah SAW bersabda:  “Ummatku akan terbahagi kepada dua puak, dan daripada kalangan mereka akan muncul sekumpulan pemberontak yang akan membunuh mereka yang paling hampir dengan kebenaran.” Riwayat Muslim.",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَكُونُ أُمَّتِي فِرْقَتَيْنِ فَيَخْرُجُ مِنْ بَيْنِهِمَا مَارِقَةٌ يَلِي قَتْلَهُمْ أولاهم بِالْحَقِّ» . رَوَاهُ مُسلم"
      },
      {
        "id": 32231,
        "hadith_number": "3537",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Kembali Kufur dan Membunuh Sesama Muslim Selepas Kewafatan Nabi",
        "perawi_melayu": "Jarir",
        "english_text": "Narrated Jarir: The Messenger of Allah (ﷺ) said during the Farewell Pilgrimage: \"Do not revert to disbelief after me by striking the necks of one another.\"",
        "malay_translation": "Daripada Jarir RA, beliau berkata: Rasulullah ﷺ bersabda dalam Haji Wada': \"Janganlah kamu kembali menjadi kafir selepas aku (wafat) dengan sebahagian kamu memukul leher sebahagian yang lain.\"",
        "arabic_text": "وَعَنْ جَرِيرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ: «لَا تَرْجِعُنَّ بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَاب بعض»"
      },
      {
        "id": 32232,
        "hadith_number": "3538",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Bermusuhan sesama Muslim",
        "perawi_melayu": "Abu Bakrah",
        "english_text": "From Abi Bakrah from the Prophet (peace and blessings of Allah be upon him) who said: “If two Muslims fight with each other, then one of them attacks the other with a weapon, both of them are in the ditch of Hellfire. And if one of them kills the other, then both will enter Hellfire.” In another narration from him, he said: “If two Muslims fight with swords, then both the killer and the killed are in the fire.” I said: “This is the killer, but what about the killed?” He said: “Indeed, he desired to kill his companion.”",
        "malay_translation": "Daripada Abu Bakrah daripada Nabi SAW, baginda bersabda:  “Jika dua orang Muslim bertelagah, lalu seorang daripada mereka menyerang saudaranya dengan senjata, maka keduanya berada di jurang neraka Jahanam. Dan jika seorang daripada mereka membunuh yang lain, maka keduanya akan masuk ke neraka Jahanam.” Dalam riwayat lain daripada baginda, sabdanya: “Jika dua orang Muslim bertempur dengan pedang, maka pembunuh dan yang terbunuh berada di dalam api.” Aku bertanya: “Ini pembunuh, tetapi bagaimana pula dengan yang terbunuh?” Baginda menjawab:  “Sesungguhnya, dia juga berhasrat untuk membunuh temannya.”",
        "arabic_text": "وَعَنْ أَبِي بَكْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا الْتَقَى الْمُسْلِمَانِ حَمَلَ أَحَدُهُمَا عَلَى أَخِيهِ السِّلَاحَ فَهُمَا فِي جُرُفِ جَهَنَّمَ فَإِذَا قَتَلَ أَحَدُهُمَا صَاحِبَهُ دَخَلَاهَا جَمِيعًا» . وَفِي رِوَايَةٍ عَنْهُ: قَالَ: «إِذَا الْتَقَى الْمُسْلِمَانِ بسيفهما فَالْقَاتِلُ وَالْمَقْتُولُ فِي النَّارِ» قُلْتُ: هَذَا الْقَاتِلُ فَمَا بَالُ الْمَقْتُولِ؟ قَالَ: «إِنَّهُ كَانَ حَرِيصًا عَلَى قَتْلِ صَاحِبِهِ»"
      },
      {
        "id": 32233,
        "hadith_number": "3539",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Orang-orang Ukul yang Murtad",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "Not Available",
        "malay_translation": "Dari Anas r.a., beliau berkata:  Sekaumpulan orang daripada suku Ukul datang kepada Nabi SAW dan memeluk Islam. Mereka menetap di Madinah. Baginda memerintahkan mereka untuk meminum air kencing dan susu unta zakat. Mereka melakukannya, lalu sembuh daripada penyakit mereka. Kemudian mereka murtad, membunuh penggembala unta dan merampas unta-unta tersebut. Baginda SAW kemudian menghantar orang untuk mengejar mereka. Setelah ditangkap, tangan dan kaki mereka dipotong, dan mata mereka dibutakan. Kemudian mereka dibiarkan sehingga mati.  Dalam riwayat lain: Mata mereka dipaku.  Dalam riwayat lain lagi: Baginda memerintahkan paku dipanaskan, kemudian digunakan untuk membutakan mata mereka dan mereka dibuang di tempat yang panas (Harrah) tanpa diberi air sehingga mati.",
        "arabic_text": "وَعَن أَنَسٍ قَالَ: قَدِمَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَفَرٌ مِنْ عُكْلٍ فَأَسْلَمُوا فَاجْتَوَوُا الْمَدِينَةَ فَأَمَرَهُمْ أَنْ يَأْتُوا إِبِلَ الصَّدَقَةِ فَيَشْرَبُوا مِنْ أَبْوَالِهَا وَأَلْبَانِهَا فَفَعَلُوا فَصَحُّوا فَارْتَدُّوا وَقَتَلُوا رُعَاتَهَا وَاسْتَاقُوا الْإِبِلَ فَبَعَثَ فِي آثَارِهِمْ فَأُتِيَ بِهِمْ فَقَطَعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ وَسَمَلَ أَعْيُنَهُمْ ثُمَّ لَمْ يَحْسِمْهُمْ حَتَّى مَاتُوا . وَفِي رِوَايَةٍ: فَسَمَّرُوا أَعْيُنَهُمْ وَفِي رِوَايَةٍ: أَمَرَ بِمَسَامِيرَ فَأُحْمِيَتْ فَكَحَّلَهُمْ بِهَا وَطَرَحَهُمْ بِالْحَرَّةِ يَسْتَسْقُونَ فَمَا يُسْقَوْنَ حَتَّى مَاتُوا"
      },
      {
        "id": 32234,
        "hadith_number": "3540",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Galakan Bersedekah dan Larangan Mutilasi",
        "perawi_melayu": "Imran bin Husain",
        "english_text": "Teks Bahasa Inggeris Tiada Disediakan",
        "malay_translation": "Daripada Imran bin Husain berkata: Rasulullah SAW sentiasa menggalakkan kami untuk bersedekah dan melarang kami daripada melakukan muthlah (mencacatkan mayat atau anggota badan). Riwayat Abu Daud.",
        "arabic_text": "عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحُثُّنَا عَلَى الصَّدَقَةِ وَيَنْهَانَا عَنِ الْمُثْلَةِ. رَوَاهُ أَبُو دَاوُدَ"
      },
      {
        "id": 32235,
        "hadith_number": "3541",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadith Riwayat An-Nasa'i dari Anas",
        "perawi_melayu": "Anas",
        "english_text": "Narrated by An-Nasa'i from Anas.",
        "malay_translation": "Diriwayatkan oleh An-Nasa'i dari Anas.",
        "arabic_text": "وَرَوَاهُ النَّسَائِيّ عَن أنس"
      },
      {
        "id": 32236,
        "hadith_number": "3542",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rahmat Rasulullah terhadap Haiwan",
        "perawi_melayu": "Abd al-Rahman bin Abd Allah daripada bapanya",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abd al-Rahman bin Abd Allah daripada bapanya, dia berkata:  Kami bersama Rasulullah SAW dalam perjalanan.  Baginda pergi ke suatu tempat untuk urusan baginda.  Kami terlihat seekor burung camar bersama anak-anaknya.  Kami mengambil anak-anaknya.  Burung camar itu datang lalu menunjukkan kesedihannya.  Kemudian datanglah Nabi SAW dan bersabda:  \"Siapakah yang memisahkan burung ini daripada anaknya? Kembalikan anaknya kepadanya.\"  Baginda juga melihat sebuah sarang semut yang telah kami bakar.  Baginda bertanya: \"Siapakah yang membakar ini?\" Kami menjawab: \"Kami.\" Baginda bersabda:  \"Sesungguhnya tidak sepatutnya melainkan Tuhan api yang menyeksa dengan api.\" Riwayat Abu Daud.",
        "arabic_text": "وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَ: كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَانْطَلَقَ لِحَاجَتِهِ فَرَأَيْنَا حُمْرَةً مَعَهَا فَرْخَانِ فَأَخَذْنَا فَرْخَيْهَا فَجَاءَتِ الْحُمْرَةُ فَجَعَلَتْ تَفْرُشُ فَجَاءَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «مَنْ فَجَعَ هَذِهِ بِوَلَدِهَا؟ رُدُّوا وَلَدَهَا إِلَيْهَا» . وَرَأَى قَرْيَةَ نَمْلٍ قَدْ حَرَّقْنَاهَا قَالَ: «مَنْ حَرَّقَ هَذِهِ؟» فَقُلْنَا: نَحْنُ قَالَ: «إِنَّهُ لَا يَنْبَغِي أَنْ يُعَذِّبَ بِالنَّارِ إِلاَّ ربُّ النَّار» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32237,
        "hadith_number": "3543",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perpecahan dan Kumpulan Sesat dalam Ummah",
        "perawi_melayu": "Abu Said al-Khudri dan Anas bin Malik",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Said al-Khudri dan Anas bin Malik daripada Rasulullah SAW, baginda bersabda:  \"Akan terdapat perselisihan dan perpecahan dalam umatku.  Sebuah kumpulan yang baik perkataannya tetapi buruk amalannya. Mereka membaca al-Quran tetapi tidak melebihi kerongkong mereka. Mereka keluar daripada agama seperti anak panah yang dilepaskan, tidak akan kembali sehingga anak panah itu kembali ke tempat asalnya. Mereka adalah makhluk yang paling jahat.  Celakalah bagi sesiapa yang membunuh mereka dan mereka membunuh sesiapa sahaja. Mereka menyeru kepada Kitab Allah tetapi mereka bukanlah dari kalangan kami. Sesiapa yang memerangi mereka adalah lebih utama di sisi Allah daripada mereka.\"  Para sahabat bertanya:  \"Wahai Rasulullah, apakah tanda-tanda mereka?\" Baginda menjawab:  \"Mata yang juling.\" (Riwayat Abu Daud)",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ وَأَنَسِ بْنِ مَالِكٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: سَيَكُونُ فِي أُمَّتِي اخْتِلَافٌ وَفُرْقَةٌ قَوْمٌ يُحسِنونَ القيلَ ويُسيئونَ الفِعلَ يقرؤون الْقُرْآنَ لَا يُجَاوِزُ تَرَاقِيَهُمْ يَمْرُقُونَ مِنَ الدِّينِ مُروقَ السَّهمِ فِي الرَّمِيَّةِ لَا يَرْجِعُونَ حَتَّى يَرْتَدَّ السَّهْمُ عَلَى فُوقِهِ هُمْ شَرُّ الْخَلْقِ وَالْخَلِيقَةِ طُوبَى لِمَنْ قَتَلَهُمْ وَقَتَلُوهُ يَدْعُونَ إِلَى كِتَابِ اللَّهِ وَلَيْسُوا منَّا فِي شيءٍ مَنْ قاتلَهم كَانَ أَوْلَى بِاللَّهِ مِنْهُمْ قَالُوا: يَا رَسُولَ اللَّهِ مَا سِيمَاهُمْ؟ قَالَ: «التَّحْلِيقُ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32238,
        "hadith_number": "3544",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keharaman Menumpahkan Darah Muslim",
        "perawi_melayu": "Aisyah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Aisyah, dia berkata: Rasulullah SAW bersabda: \"Tidak halal menumpahkan darah seorang muslim yang mengakui tiada Tuhan melainkan Allah dan Muhammad adalah utusan Allah kecuali atas tiga perkara: Zina setelah berkahwin (maka dia dirajam), orang yang keluar memberontak terhadap Allah dan Rasul-Nya (maka dia dibunuh, disalib, atau dibuang negeri), atau membunuh seseorang (maka dia dibunuh sebagai balasan).\" Riwayat Abu Daud.",
        "arabic_text": "وَعَنْ عَائِشَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ إِلَّا بِإِحْدَى ثَلَاثٍ زِنا بعدَ إِحْصانٍ فإِنَّهُ يُرجَمُ ورجلٌ خرَجَ مُحارِباً للَّهِ وَرَسُولِهِ فَإِنَّهُ يُقْتَلُ أَوْ يُصْلَبُ أَوْ يُنْفَى مِنَ الْأَرْضِ أَوْ يَقْتُلُ نَفْسًا فَيُقْتَلُ بِهَا» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32239,
        "hadith_number": "3545",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tidak Halal Menggerunkan Seorang Muslim",
        "perawi_melayu": "Ibnu Abi Laila",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Abi Laila, katanya:  Para sahabat Muhammad ﷺ menceritakan bahawa mereka pernah berjalan bersama Rasulullah ﷺ, maka seorang lelaki di antara mereka tertidur.  Lalu sebahagian daripada mereka pergi mengambil tali yang ada pada lelaki itu, lalu menariknya sehingga lelaki itu terkejut.  Maka Rasulullah ﷺ bersabda:  “Tidak halal bagi seorang Muslim untuk menakutkan Muslim yang lain.” Riwayat Abu Daud.",
        "arabic_text": "وَعَنِ ابْنِ أَبِي لَيْلَى قَالَ: حَدَّثَنَا أَصْحَابُ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُمْ كَانُوا يَسِيرُونَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَامَ رَجُلٌ مِنْهُمْ فَانْطَلَقَ بَعْضُهُمْ إِلَى حَبْلٍ مَعَه فَأَخذه فَفَزعَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَحِلُّ لِمُسْلِمٍ أَنْ يُرَوِّعَ مُسْلِمًا» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32240,
        "hadith_number": "3546",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kehilangan Hijrah dan Memungkiri Islam",
        "perawi_melayu": "Abu Darda'",
        "english_text": "From Abu ad-Darda' from the Messenger of Allah (peace be upon him) who said: \"Whoever takes land with its Jizya (tax), has indeed made his Hijrah (migration) steadfast, and whoever takes the minor tax from a kafir's neck and puts it around his own neck has turned his back on Islam.\"",
        "malay_translation": "Daripada Abu Darda' daripada Rasulullah SAW, sabda baginda:  \"Sesiapa yang mengambil tanah dengan jizyahnya, maka sesungguhnya dia telah meneguhkan hijrahnya. Dan sesiapa yang mengambil cukai kecil daripada leher seorang kafir lalu meletakkannya di lehernya sendiri, maka sesungguhnya dia telah berpaling daripada Islam.\" Riwayat Abu Daud",
        "arabic_text": "وَعَنْ أَبِي الدَّرْدَاءِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَخَذَ أَرْضًا بِجِزْيَتِهَا فَقَدِ اسْتَقَالَ هِجْرَتَهُ وَمَنْ نَزَعَ صَغَارَ كَافِرٍ مِنْ عُنُقِهِ فَجَعَلَهُ فِي عُنُقِهِ فَقَدْ وَلّى الإِسلامَ ظهرَه» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32241,
        "hadith_number": "3547",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Bermastautin dikalangan Musyrik",
        "perawi_melayu": "Jarir bin Abdullah",
        "english_text": "It is narrated on the authority of Jarir b. Abdullah that the Messenger of Allah (ﷺ) sent an expedition to Khath'am. Some of them clung to prostration, and they were killed quickly. This was reported to the Prophet (ﷺ), whereupon he ordered that half of the compensation be paid to them and said: \"I am free from any Muslim who resides among the polytheists.\" They said: \"O Messenger of Allah, why?\" He said: \"Lest they should see their fire.\"",
        "malay_translation": "Daripada Jarir bin Abdullah, katanya: Rasulullah SAW telah menghantar satu pasukan tentera ke Khath’am.  Sebahagian daripada mereka berpegang teguh kepada sujud (sembahyang) sehingga mereka terbunuh dengan pantas. Perkara ini sampai kepada Nabi SAW, lalu baginda memerintahkan agar separuh daripada diyat (ganti rugi) dibayar kepada mereka dan bersabda:  “Aku berlepas diri daripada sesiapa sahaja yang beragama Islam yang menetap di kalangan orang musyrik.” Mereka bertanya: “Wahai Rasulullah, mengapa?” Baginda menjawab: “Supaya mereka tidak melihat api neraka mereka.”",
        "arabic_text": "وَعَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ قَالَ: بَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَرِيَّةً إِلَى خَثْعَمَ فَاعْتَصَمَ نَاسٌ مِنْهُمْ بِالسُّجُودِ فَأَسْرَعَ فِيهِمُ الْقَتْلَ فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ لَهُمْ بِنِصْفِ الْعَقْلِ وَقَالَ: «أَنَا بَرِيءٌ مِنْ كُلِّ مُسْلِمٍ مُقِيمٍ بَيْنَ أَظْهُرِ الْمُشْرِكِينَ» قَالُوا: يَا رَسُولَ اللَّهِ لِمَ؟ قَالَ: «لَا تَتَرَاءَى نَارَاهُمَا» . رَوَاهُ أَبُو دَاوُدَ"
      },
      {
        "id": 32242,
        "hadith_number": "3548",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Iman Mencegah Pengkhianatan",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Tiada teks Bahasa Inggeris.",
        "malay_translation": "Daripada Abu Hurairah RA, daripada Nabi SAW bersabda: 'Iman adalah penghalang kepada pengkhianatan; seorang mukmin tidak akan mengkhianati.' Riwayat Abu Daud.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْإِيمَانُ قَيَّدَ الْفَتْكَ لَا يفتِكُ مُؤمنٌ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32243,
        "hadith_number": "3549",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Darah Seorang Hamba yang Murtad",
        "perawi_melayu": "Jarir daripada Nabi SAW",
        "english_text": "Not Available",
        "malay_translation": "Daripada Jarir daripada Nabi Muhammad SAW, Baginda bersabda:  \"Sekiranya seorang hamba melarikan diri kepada syirik, maka halal darahnya.\"  Riwayat Abu Daud.",
        "arabic_text": "وَعَنْ جَرِيرٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا أَبَقَ الْعَبْدُ إِلَى الشِّرْكِ فقد حلَّ دَمه» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32244,
        "hadith_number": "3550",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kesalahan Membunuh Wanita Yahudi yang Mencaci Nabi",
        "perawi_melayu": "Ali r.a.",
        "english_text": "From Ali (may Allah be pleased with him), that a Jewess used to insult the Prophet (peace and blessings be upon him) and to slander him, so a man strangled her until she died. Then the Prophet (peace and blessings be upon him) declared his action void.",
        "malay_translation": "Daripada Ali r.a., bahawa seorang wanita Yahudi selalu menghina Nabi SAW dan mencerca Baginda.  Lalu seorang lelaki mencekiknya sehingga mati. Kemudian Nabi SAW membatalkan hukuman darahnya.",
        "arabic_text": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ أَنَّ يَهُودِيَّةً كَانَتْ تَشْتِمُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَتَقَعُ فِيهِ فَخَنَقَهَا رَجُلٌ حَتَّى مَاتَتْ فَأَبْطَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَمَهَا. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32245,
        "hadith_number": "3551",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman Ahli Sihir",
        "perawi_melayu": "Junjub",
        "english_text": "From Jundub, he said: The Messenger of Allah (peace and blessings be upon him) said: \"The limit for the sorcerer is that he should be killed with a sword.\"",
        "malay_translation": "Dari Junjub, beliau berkata: Rasulullah SAW bersabda:  \"Hukuman bagi ahli sihir ialah dibunuh dengan pedang.\"",
        "arabic_text": "وَعَنْ جُنْدُبٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «حَدُّ السَّاحِرِ ضَرْبُهُ بِالسَّيْفِ» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 32246,
        "hadith_number": "3552",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": " Hukuman Bagi Mereka Yang Memecah Belahkan Umat",
        "perawi_melayu": "Usamah bin Syarik",
        "english_text": "From Usamah ibn Sharik, he said: The Messenger of Allah (peace and blessings be upon him) said: \"Whoever goes out to divide my Ummah, then strike his neck.\"",
        "malay_translation": "Daripada Usamah bin Syarik, beliau berkata: Rasulullah SAW bersabda:  \"Barangsiapa yang keluar untuk memecah belahkan umatku, maka bunuhlah dia.\"",
        "arabic_text": "عَن أُسَامَةَ بْنِ شَرِيكٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَيُّمَا رَجُلٍ خَرَجَ يُفَرِّقُ بَيْنَ أُمَّتِي فَاضْرِبُوا عُنُقَهُ» . رَوَاهُ النَّسَائِيُّ"
      },
      {
        "id": 32247,
        "hadith_number": "3553",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi SAW Mengenai Khawarij dan Kemunculan Mereka di Akhir Zaman",
        "perawi_melayu": "Syarik bin Syihab",
        "english_text": "Not Available",
        "malay_translation": "Daripada Syarik bin Syihab, katanya: Aku sentiasa berharap dapat bertemu dengan seseorang daripada sahabat Nabi SAW untuk bertanya kepadanya tentang Khawarij.  Maka aku bertemu dengan Abu Barzah pada hari raya bersama beberapa orang sahabatnya.  Lalu aku bertanya kepadanya, \"Adakah engkau pernah mendengar Rasulullah SAW menyebut tentang Khawarij?\"  Jawabnya, \"Ya, aku mendengar Rasulullah SAW dengan kedua telingaku dan melihatnya dengan kedua mataku.  Rasulullah SAW didatangi dengan harta, lalu baginda membahagikannya. Baginda memberi kepada orang yang berada di kanan dan kirinya, tetapi tidak memberi apa-apa kepada orang yang berada di belakangnya.  Maka bangunlah seorang lelaki di belakang baginda lalu berkata, \"Wahai Muhammad, engkau tidak adil dalam pembahagian.\" Lelaki itu berkulit hitam, rambutnya kerinting, dan memakai dua helai pakaian putih.  Maka Rasulullah SAW sangat marah dan bersabda: \"Demi Allah, kamu tidak akan mendapati sesiapa yang lebih adil daripada aku.\" Kemudian baginda bersabda:  \"Akan muncul pada akhir zaman satu puak, seakan-akan seperti orang ini. Mereka membaca al-Quran tetapi ia tidak melepasi kerongkong mereka. Mereka keluar daripada Islam sebagaimana anak panah keluar daripada tempat panahan. Ciri-ciri mereka adalah mencukur janggut. Mereka akan terus keluar sehingga keluar yang terakhir bersama Dajjal. Maka jika kamu bertemu dengan mereka, merekalah makhluk yang paling jahat.\" Riwayat al-Nasai.",
        "arabic_text": "وَعَنْ شَرِيكِ بْنِ شِهَابٍ قَالَ: كُنْتُ أَتَمَنَّى أَنْ أَلْقَى رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْأَلُهُ عَنِ الْخَوَارِجِ فَلَقِيْتُ أَبَا بَرْزَةَ فِي يَوْمِ عِيدٍ فِي نَفَرٍ مِنْ أَصْحَابِهِ فَقُلْتُ لَهُ: هَلْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَذْكُرُ الْخَوَارِجَ؟ قَالَ: نعمْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأُذُنَيَّ وَرَأَيْتُهُ بِعَيْنَيَّ: أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَالٍ فَقَسَمَهُ فَأَعْطَى مَنْ عَنْ يَمِينِهِ وَمَنْ عَنْ شِمَالِهِ وَلَمْ يُعْطِ مَنْ وَرَاءَهُ شَيْئًا. فَقَامَ رَجُلٌ مِنْ وَرَائِهِ فَقَالَ: يَا مُحَمَّدُ مَا عَدَلْتَ فِي الْقِسْمَةِ رَجُلٌ أَسْوَدُ مَطْمُومُ الشَّعْرِ عَلَيْهِ ثَوْبَانِ أَبْيَضَانِ فَغَضِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَضَبًا شَدِيدًا وَقَالَ: «وَاللَّهِ لَا تَجِدُونَ بَعْدِي رَجُلًا هُوَ أَعْدَلُ مِنِّي» ثُمَّ قَالَ: «يخرُجُ فِي آخرِ الزَّمانِ قومٌ كأنَّ هَذَا مِنْهُم يقرؤون الْقُرْآنَ لَا يُجَاوِزُ تَرَاقِيَهُمْ يَمْرُقُونَ مِنَ الْإِسْلَامِ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ سِيمَاهُمُ التَّحْلِيقُ لَا يَزَالُونَ يَخْرُجُونَ حَتَّى يَخْرُجَ آخِرُهُمْ مَعَ الْمَسِيحِ الدَّجَّالِ فَإِذَا لَقِيتُمُوهُمْ هُمْ شَرُّ الْخَلْقِ والخليقة» . رَوَاهُ النَّسَائِيّ"
      },
      {
        "id": 32248,
        "hadith_number": "3554",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Anjing-anjing Neraka dan Pembunuhan",
        "perawi_melayu": "Abu Ghalib",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Ghalib, bahawa Abu Umamah melihat beberapa kepala yang dipenggal di tangga Damsyik. Maka Abu Umamah berkata:  \"Anjing-anjing neraka merupakan pembunuhan yang paling teruk di bawah langit ini, dan orang yang terbaik yang dibunuh adalah mereka yang membunuh mereka.\" Kemudian beliau membaca ayat:  \"(Pada hari ketika beberapa wajah menjadi putih dan beberapa wajah menjadi hitam)\".  Lalu ditanya kepada Abu Umamah: \"Adakah engkau mendengarnya daripada Rasulullah SAW?\"  Beliau menjawab: \"Sekalipun aku hanya mendengarnya sekali atau dua kali, atau tiga kali sehingga tujuh kali, aku tetap akan menceritakannya kepada kamu.\"  Riwayat Tirmizi dan Ibnu Majah.  Tirmizi berkata:  \"Hadis ini adalah hadis hasan.\"",
        "arabic_text": "وَعَن أبي غالبٍ رأى أَبُو أُمامةَ رؤوساً مَنْصُوبَةً عَلَى دَرَجِ دِمَشْقَ فَقَالَ أَبُو أُمَامَةَ: «كِلَابُ النَّارِ شَرُّ قَتْلَى تَحْتَ أَدِيمِ السَّمَاءِ خَيْرُ قَتْلَى مَنْ قَتَلُوهُ» ثُمَّ قَرَأَ (يَوْمَ تبيَضُّ وُجوهٌ وتَسوَدُّ وُجوهٌ) الْآيَةَ قِيلَ لِأَبِي أُمَامَةَ: أَنْتَ سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: لَوْ لَمْ أَسْمَعْهُ إِلَّا مَرَّةً أَوْ مَرَّتَيْنِ أوْ ثَلَاثًا حَتَّى عَدَّ سَبْعًا مَا حَدَّثْتُكُمُوهُ. رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ"
      }
    ]
  }
}