{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 92,
    "data": [
      {
        "id": 33208,
        "hadith_number": "4514",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tidak Turun Penyakit Melainkan Turun Ubatnya",
        "perawi_melayu": "Abi Hurairah",
        "english_text": "Daripada Abu Hurairah, dia berkata: Rasulullah SAW bersabda, \"Allah tidak menurunkan sebarang penyakit melainkan menurunkan ubat baginya.\"",
        "malay_translation": "Daripada Abu Hurairah, beliau berkata: Rasulullah SAW bersabda, \"Allah tidak menurunkan sebarang penyakit melainkan Dia menurunkan ubat untuknya.\"  Riwayat Bukhari.",
        "arabic_text": "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا أَنْزَلَ اللَّهُ دَاء إِلا أنزل لَهُ دَوَاء» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 33209,
        "hadith_number": "4515",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Setiap Penyakit Mempunyai Ubat",
        "perawi_melayu": "Jabir",
        "english_text": "From Jabir, he said: The Messenger of Allah (peace and blessings be upon him) said: \"Every ailment has a cure. If a cure for an ailment is applied, it will be healed, by Allah's permission.\"",
        "malay_translation": "Daripada Jabir, dia berkata: Rasulullah SAW bersabda: \"Setiap penyakit mempunyai ubat. Jika ubat bagi suatu penyakit itu digunakan, ia akan sembuh dengan izin Allah.\"",
        "arabic_text": "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لِكُلِّ دَاءٍ دَوَاءٌ فَإِذَا أُصِيبَ دَوَاءٌ الدَّاءَ بَرَأَ بِإِذْنِ اللَّهِ» . رَوَاهُ مُسلم"
      },
      {
        "id": 33210,
        "hadith_number": "4516",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penyembuhan Melalui Tiga Cara: Berbekam, Madu, dan Kay (Pembakaran)",
        "perawi_melayu": "Diriwayatkan dari Ibnu Abbas RA, Rasulullah SAW bersabda:",
        "english_text": "Not Available",
        "malay_translation": "\"Penyembuhan itu ada pada tiga perkara: dalam sayatan alat bekam, atau minuman madu, atau kay dengan api. Dan aku melarang umatku dari kay.\"",
        "catatan": "Kay merujuk kepada rawatan membakar bahagian tubuh yang sakit.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الشِّفَاءُ فِي ثَلَاثٍ: فِي شَرْطَةِ مِحْجَمٍ أَوْ شَرْبَةِ عَسَلٍ أَوْ كَيَّةٍ بِنَارٍ وَأَنَا أَنْهَى أُمَّتِي عَنِ الْكَيِّ . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 33211,
        "hadith_number": "4517",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pengalaman Abu Jabir di Perang Ahzab dan Rawatan Nabi SAW",
        "perawi_melayu": "Jabir",
        "english_text": "And from Jabir, he said: My father was shot during the Battle of the Confederates (Ahzab) on his eye.  The Messenger of Allah (ﷺ) cauterized it.  Narrated by Muslim",
        "malay_translation": "Dan daripada Jabir, beliau berkata: Bapa saya telah ditembak pada Perang Ahzab di matanya. Rasulullah SAW telah membakar lukanya. Diriwayatkan oleh Imam Muslim.",
        "arabic_text": "وَعَن جابرٍ قَالَ: رُمِيَ أَبِي يَوْمَ الْأَحْزَابِ عَلَى أَكْحَلِهِ فَكَوَاهُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. رَوَاهُ مُسلم"
      },
      {
        "id": 33212,
        "hadith_number": "4518",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rawatan Nabi SAW terhadap Sa'ad bin Mu'az yang Terluka",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada beliau (Sa'ad bin Mu'az) RA, beliau berkata: Sa'ad bin Mu'az telah terkena panah pada urat akalnya (akhal). Nabi SAW kemudian mengubatinya dengan tangannya menggunakan anak panah (mishqas). Kemudian (luka tersebut) membengkak, lalu Baginda mengubatinya untuk kali kedua. (Riwayat Muslim)",
        "arabic_text": "وَعَنْهُ قَالَ: رُمِيَ سَعْدُ بْنُ مُعَاذٍ فِي أكحله فحمسه النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ بِمِشْقَصٍ ثمَّ ورمت فحمسه الثَّانِيَة. رَوَاهُ مُسلم"
      },
      {
        "id": 33213,
        "hadith_number": "4519",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rawatan Perubatan pada Zaman Nabi: Ubay bin Ka'b Dirawat oleh Doktor yang Dihantar oleh Rasulullah SAW",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada beliau (Ubay bin Ka'b) berkata: Rasulullah SAW telah menghantar seorang doktor kepada Ubay bin Ka'b, lalu doktor tersebut memotong urat daripadanya kemudian membakarnya di atasnya (tempat potongan tersebut). Riwayat Muslim.",
        "arabic_text": "وَعَنْهُ قَالَ: بَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى أُبيِّ بن كَعْب طَبِيبا فَقَطَعَ مِنْهُ عِرْقًا ثُمَّ كَوَاهُ عَلَيْهِ. رَوَاهُ مُسلم"
      },
      {
        "id": 33214,
        "hadith_number": "4520",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Khasiat Habbatussauda (Jintan Hitam) sebagai Penawar Penyakit",
        "perawi_melayu": "Diriwayatkan dari Abu Hurairah RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah RA, beliau mendengar Rasulullah SAW bersabda: \"Pada Habbatussauda (jintan hitam) terdapat penawar bagi segala penyakit kecuali As-Sam.\" Ibnu Syihab berkata: As-Sam ialah kematian, dan Habbatussauda ialah Syuniz.",
        "arabic_text": "وَعَن أَبِي هُرَيْرَةَ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «فِي الْحَبَّةِ السَّوْدَاءِ شِفَاءٌ مِنْ كُلِّ دَاءٍ إِلَّا السَّامَ» . قَالَ ابْنُ شِهَابٍ: السَّامُ: الْمَوْتُ وَالْحَبَّةُ السَّوْدَاءُ: الشُّونِيزُ"
      },
      {
        "id": 33215,
        "hadith_number": "4521",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rawatan Menggunakan Madu bagi Masalah Perut",
        "perawi_melayu": "Abu Said al-Khudri",
        "english_text": "And from Abu Sa'id al-Khudri, he said: A man came to the Prophet ﷺ and said, \"My brother's stomach is distended.\" The Messenger of Allah ﷺ said, \"Give him honey to drink.\" So he gave him honey to drink, then he came again and said, \"I gave him to drink, but it did not improve his condition except for further distension.\" He did it three times. Then he came the fourth time and said, \"Give him honey to drink.\" He said, \"I gave him to drink, but it did not improve his condition except for further distension.\" The Messenger of Allah ﷺ said, \"Allah is truthful, and the stomach of your brother is lying.\" Then he gave him honey to drink, and he was healed.",
        "malay_translation": "Dan daripada Abu Sa'id al-Khudri, beliau berkata: Seorang lelaki datang kepada Rasulullah ﷺ dan berkata, \"Perut adik saya membengkak.\" Rasulullah ﷺ bersabda, \"Berikan dia madu untuk diminum.\" Maka dia memberikan madu untuk diminum, kemudian dia datang lagi dan berkata, \"Saya telah memberikannya minum, tetapi keadaannya tidak bertambah baik melainkan semakin membengkak.\" Beliau melakukannya sebanyak tiga kali. Kemudian dia datang kali keempat dan berkata, \"Berikan dia madu untuk diminum.\" Dia berkata, \"Saya telah memberikannya minum, tetapi keadaannya tidak bertambah baik melainkan semakin membengkak.\" Rasulullah ﷺ bersabda, \"Allah adalah benar, dan perut adik kamu berdusta.\" Kemudian dia memberikannya madu untuk diminum, dan dia sembuh.",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: أَخِي اسْتَطْلَقَ بَطْنُهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اسقيه عسَلاً» فَسَقَاهُ ثُمَّ جَاءَ فَقَالَ: سَقَيْتُهُ فَلَمْ يَزِدْهُ إِلَّا اسْتِطْلَاقًا فَقَالَ لَهُ ثَلَاثَ مَرَّاتٍ. ثُمَّ جَاءَ الرَّابِعَةَ فَقَالَ: «اسْقِهِ عَسَلًا» . فَقَالَ: لَقَدْ سَقَيْتُهُ فَلَمْ يَزِدْهُ إِلَّا اسْتِطْلَاقًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «صَدَقَ اللَّهُ وَكَذَبَ بَطْنُ أَخِيكَ» . فَسَقَاهُ فَبَرَأَ"
      },
      {
        "id": 33216,
        "hadith_number": "4522",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kaedah Perubatan Terbaik: Berbekam dan Qust al-Bahri",
        "perawi_melayu": "Diriwayatkan daripada Anas RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Anas RA, Rasulullah SAW bersabda: “Sesungguhnya sebaik-baik cara kamu berubat adalah dengan berbekam dan Qust al-Bahri.”",
        "arabic_text": "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَمْثَلَ مَا تَدَاوَيْتُمْ بِهِ الْحجامَة والقُسْط البحري»"
      },
      {
        "id": 33217,
        "hadith_number": "4523",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Jangan Menyiksa Anak-Anak dengan Perbuatan Menyakitkan Hati",
        "perawi_melayu": null,
        "english_text": "And from him, he said: The Messenger of Allah, may Allah bless him and grant him peace, said, \"Do not torment your children with hurtful gestures. Be just to them.\"",
        "malay_translation": "Daripadanya, beliau berkata: Rasulullah SAW bersabda, \"Janganlah kamu menyeksa anak-anak kamu dengan isyarat-isyarat yang menyakitkan hati. Berlaku adillah kepada mereka.\"",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تُعَذِّبُوا صِبْيَانَكُمْ بِالْغَمْزِ مِنَ الْعُذْرَةِ عَلَيْكُمْ بِالْقُسْطِ»"
      },
      {
        "id": 33218,
        "hadith_number": "4524",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Khasiat Kayu Gaharu India sebagai Ubat",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ummu Qais, beliau berkata: Rasulullah SAW bersabda: \"Kenapa kamu mengurut anak-anak kamu dengan 'Alaq ini? Gunakanlah kayu Gaharu India ini, kerana padanya terdapat tujuh penawar, antaranya ialah penyakit radang selaput dada. Ia digunakan sebagai sedutan untuk penyakit 'Udhrah dan diberi minum untuk penyakit radang selaput dada.\"",
        "arabic_text": "وَعَن أُمِّ قَيْسٍ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «على مَ تَدْغَرْنَ أَوْلَادَكُنَّ بِهَذَا الْعِلَاقِ؟ عَلَيْكُنَّ بِهَذَا الْعُودِ الْهِنْدِيِّ فَإِنَّ فِيهِ سَبْعَةَ أَشْفِيَةٍ مِنْهَا ذَاتُ الْجَنْبِ يُسْعَطُ مِنَ الْعُذْرَةِ وَيُلَدُّ مِنْ ذَاتِ الْجنب»"
      },
      {
        "id": 33219,
        "hadith_number": "4525",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menggunakan Air untuk Mendinginkan Demam",
        "perawi_melayu": "Aisyah dan Raf'i bin Khadijah",
        "english_text": "Dari Aisyah dan Raf'i bin Khadijah daripada Nabi SAW, baginda bersabda, \"Demam itu daripada api neraka, maka dinginkanlah ia dengan air.\"",
        "malay_translation": "Daripada Aisyah dan Raf'i bin Khadijah daripada Nabi SAW, baginda bersabda, \"Demam itu daripada api neraka, maka dinginkanlah ia dengan air.\"  (Ini menunjukkan bahawa mengurangkan demam dengan air adalah cara yang sesuai dan disarankan. Ia menggambarkan kehebatan kuasa penciptaan dan kebertentangan antara panas dan sejuk.",
        "arabic_text": "وَعَنْ عَائِشَةَ وَرَافِعِ بْنِ خَدِيجٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْحمى من فيج جَهَنَّم فَأَبْرِدُوهَا بِالْمَاءِ»"
      },
      {
        "id": 33220,
        "hadith_number": "4526",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kebolehan Mengubat Penyakit Mata, Demam, dan Sengatan Semut",
        "perawi_melayu": null,
        "english_text": "Dari Anas, katanya: Rasulullah SAW memberi keringanan (membenarkan)  berbuat rukyah (perawatan) untuk penyakit mata, demam, dan sengatan semut. Riwayat Muslim.",
        "malay_translation": "Daripada Anas, katanya: Rasulullah SAW telah memberikan keringanan (mengakui kebolehan) berbuat rukyah (perawatan) untuk penyakit mata, demam, dan sengatan semut.  Riwayat Muslim.",
        "arabic_text": "وَعَن أنسٍ قَالَ: رَخَّصَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الرُّقْيَةِ مِنَ الْعَيْنِ وَالْحُمَّةِ وَالنَّمْلَةِ. رَوَاهُ مُسلم"
      },
      {
        "id": 33221,
        "hadith_number": "4527",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mengubati Penyakit Mata dengan Cara Isti'raq",
        "perawi_melayu": "Aisyah radhiallahuanha",
        "english_text": "Daripada Aisyah RA, beliau berkata: Rasulullah SAW telah memerintahkan agar kita menggunakan cara isti'raq untuk mengubati penyakit mata.",
        "malay_translation": "Daripada Aisyah رضي الله عنها, baginda berkata: Rasulullah SAW telah memerintahkan supaya kita menggunakan cara isti'raq untuk mengubati penyakit mata.",
        "arabic_text": "وَعَن عَائِشَة قَالَتْ: أَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَسْتَرْقِيَ مِنَ الْعَيْنِ"
      },
      {
        "id": 33222,
        "hadith_number": "4528",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Anjuran untuk Meruqyah (Menyembuhkan) Anak Perempuan yang Sakit",
        "perawi_melayu": "Not Available",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ummu Salamah RA, bahawa Nabi SAW melihat di rumahnya seorang hamba perempuan yang di wajahnya ada *saf'ah* (bermakna kekuningan). Baginda bersabda: \"Ruqyahlah dia, kerana sesungguhnya dia terkena *nazrah* (ain).\"",
        "arabic_text": "وَعَنْ أُمِّ سَلَمَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى فِي بَيْتِهَا جَارِيَةً فِي وجهِها سفعة يَعْنِي صُفْرَةً فَقَالَ: «اسْتَرْقُوا لَهَا فَإِنَّ بِهَا النَّظْرَةَ»"
      },
      {
        "id": 33223,
        "hadith_number": "4529",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Ruqyah dan Pengecualiannya",
        "perawi_melayu": "Jabir",
        "english_text": "And from Jabir, he said: The Messenger of Allah, peace and blessings be upon him, forbade ruqyah (spiritual healing). Then the family of Amr ibn Hazm came and said, 'O Messenger of Allah, there was a ruqyah among us with which we treated scorpion bites. And you have forbidden ruqyah. They presented it to him, and he said, 'I do not see any harm in it. Whoever among you is able to benefit his brother, let him benefit him.' Narrated by Muslim.",
        "malay_translation": "Dan daripada Jabir, dia berkata: Rasulullah SAW telah melarang ruqyah (rawatan spiritual). Kemudian keluarga Amr bin Hazm datang dan berkata, 'Wahai Rasulullah, di antara kami ada ruqyah yang kami gunakan untuk merawat sengatan kala jengking. Dan engkau telah melarang ruqyah. Mereka membawakannya kepada baginda, lalu baginda bersabda, 'Aku tidak melihat sebarang keburukan padanya. Sesiapa di antara kamu yang mampu memberi manfaat kepada saudaranya, maka hendaklah dia memberi manfaat kepadanya.' Diriwayatkan oleh Muslim.",
        "arabic_text": "وَعَنْ جَابِرٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الرُّقَى فَجَاءَ آلُ عَمْرِو بْنِ حَزْمٍ فَقَالُوا: يَا رَسُولَ اللَّهِ إِنَّهُ كَانَتْ عِنْدَنَا رُقْيَةٌ نَرْقِي بِهَا مِنَ الْعَقْرَبِ وَأَنْتَ نَهَيْتَ عَنِ الرُّقَى فَعَرَضُوهَا عَلَيْهِ فَقَالَ: «مَا أَرَى بِهَا بَأْسًا مَنِ اسْتَطَاعَ مِنْكُمْ أَنْ يَنْفَعَ أَخَاهُ فَلْيَنْفَعْهُ» . رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 33224,
        "hadith_number": "4530",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kebolehan Rawatan Ruqyah dan Larangan Syirik",
        "perawi_melayu": "Uthman bin Malik al-Asyja'i",
        "english_text": "Daripada Uthman bin Malik al-Asyja'i, beliau berkata: \"Kami biasa melakukan rawatan ruqyah semasa zaman Jahiliyyah.  Kami bertanya, Wahai Rasulullah, bagaimana pandangan Baginda tentang perkara ini? Baginda menjawab: \"Tunjukkan kepada saya ruqyah kamu. Tidak mengapa dengan ruqyah selagi ia tidak mengandungi unsur syirik.\"",
        "malay_translation": "Daripada Uthman bin Malik al-Asyja’i, beliau berkata: \"Kami biasa melakukan rawatan ruqyah pada zaman Jahiliyyah. Kami bertanya kepada Rasulullah, \"Wahai Rasulullah, bagaimana pandangan Baginda tentang perkara ini?\" Baginda menjawab: \"Tunjukkan kepada saya ruqyah kamu. Tidak mengapa dengan ruqyah selagi ia tidak mengandungi unsur syirik.\"  (Hadis riwayat Muslim)",
        "arabic_text": "وَعَن عوفِ بن مَالك الْأَشْجَعِيّ قَالَ: كُنَّا نَرْقِي فِي الْجَاهِلِيَّةِ فَقُلْنَا: يَا رَسُولَ اللَّهِ كَيْفَ تَرَى فِي ذَلِكَ؟ فَقَالَ: «اعْرِضُوا عَلَيَّ رُقَاكُمْ لَا بَأْسَ بِالرُّقَى مَا لم يكن فِيهِ شرك» . رَوَاهُ مُسلم"
      },
      {
        "id": 33225,
        "hadith_number": "4531",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kebenaran Mata dan Pengaruh Takdir",
        "perawi_melayu": "Ibnu Abbas r.a.",
        "english_text": "Daripada Ibn Abbas r.a. daripada Nabi saw, Baginda bersabda: \"Mata itu hak, sekiranya sesuatu perkara mendahului takdir, maka mata itu mendahulinya. Dan apabila kamu bersuci, maka basuhlah (anggota badan).\" Diriwayatkan oleh Muslim.",
        "malay_translation": "Daripada Ibnu Abbas r.a. daripada Nabi saw, Baginda bersabda: \"Mata adalah hak dan benar. Sekiranya sesuatu perkara mendahului ketentuan takdir, maka mata (keinginan, niat) itu akan mendahulunya. Dan apabila kamu bersuci, maka basuhlah (anggota badan).\"  Hadis ini diriwayatkan oleh Imam Muslim.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْعَيْنُ حَقٌّ فَلَوْ كَانَ شَيْءٌ سَابَقَ الْقَدَرِ سَبَقَتْهُ الْعَيْنُ وَإِذَا اسْتُغْسِلْتُمْ فاغسِلوا» . رَوَاهُ مُسلم"
      },
      {
        "id": 33226,
        "hadith_number": "4532",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kebolehan Mengubati Penyakit dan Kesihatan",
        "perawi_melayu": "Usamah bin Syarik",
        "english_text": "Daripada Usamah bin Syarik, beliau berkata: Mereka bertanya, Wahai Rasulullah, adakah kita dibenarkan untuk berubat? Baginda bersabda: “Ya, wahai hamba Allah, berubatanlah, sesungguhnya Allah tidak menjadikan sebarang penyakit melainkan Dia telah menyediakan ubat untuknya, kecuali penyakit tua.” Diriwayatkan oleh Imam Ahmad, Imam al-Tirmizi dan Imam Abu Daud.",
        "malay_translation": "Daripada Usamah bin Syarik, beliau berkata: Mereka bertanya, Wahai Rasulullah, adakah dibenarkan kita untuk berubat? Baginda menjawab, “Ya, wahai hamba Allah, berubatanlah. Sesungguhnya Allah tidak mencipta sebarang penyakit melainkan Dia telah menyediakan penawar untuknya, kecuali penyakit tua.”  Riwayat Imam Ahmad, Imam al-Tirmizi dan Imam Abu Daud.",
        "arabic_text": "عَنْ أُسَامَةَ بْنِ شَرِيكٍ قَالَ: قَالُوا: يَا رَسُول الله أفنتداوى؟ قَالَ: «نعم يَا عبد اللَّهِ تَدَاوَوْا فَإِنَّ اللَّهَ لَمْ يَضَعْ دَاءً إِلَّا وَضَعَ لَهُ شِفَاءً غَيْرَ دَاءٍ وَاحِدٍ الْهَرم» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ وَأَبُو دَاوُد"
      },
      {
        "id": 33227,
        "hadith_number": "4533",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Memerksa Orang Sakit Berkenaan Makanan",
        "perawi_melayu": "Uqbah bin Amir",
        "english_text": "Daripada Uqbah bin Amir, dia berkata: Rasulullah SAW bersabda: \"Jangan paksa orang sakit makan. Sesungguhnya Allah akan memberinya makanan dan minuman.\"",
        "malay_translation": "Daripada Uqbah bin Amir, dia berkata: Rasulullah SAW bersabda, \"Jangan paksa orang yang sakit untuk makan. Sesungguhnya Allah akan memberinya makanan dan minuman.\"  Hadis ini diriwayatkan oleh al-Tirmidzi dan Ibn Majah, dan al-Tirmidzi mengkategorikannya sebagai hadis gharib.",
        "arabic_text": "وَعَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تُكْرِهُوا مَرْضَاكُمْ عَلَى الطَّعَامِ فَإِنَّ اللَّهَ يُطْعِمُهُمْ وَيَسْقِيهِمْ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيث غَرِيب"
      },
      {
        "id": 33228,
        "hadith_number": "4534",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi ﷺ Menggunakan Besi Panas untuk Merawat As'ad bin Zurarah",
        "perawi_melayu": "Diriwayatkan daripada Anas r.a.",
        "english_text": "Not Available",
        "malay_translation": "Daripada Anas r.a., bahawa Nabi ﷺ membakar (dengan besi panas) As'ad bin Zurarah kerana penyakit *shawkah* (sejenis penyakit radang atau bengkak).  Riwayat Tirmizi dan beliau berkata: Hadith ini adalah *Gharib* (asing).",
        "arabic_text": "وَعَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَوَى أَسْعَدَ بْنَ زُرَارَةَ مِنَ الشَّوْكَةِ. رَوَاهُ التِّرْمِذِيّ وَقَالَ: هَذَا حَدِيث غَرِيب"
      },
      {
        "id": 33229,
        "hadith_number": "4535",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rawatan untuk Penyakit Radang Selaput Dada ( ذات الجنب ) dengan Qust Al-Bahri dan Minyak Zaitun",
        "perawi_melayu": "Diriwayatkan daripada Zaid bin Arqam RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Zaid bin Arqam RA berkata: Rasulullah SAW memerintahkan kami untuk berubat daripada penyakit radang selaput dada ( ذات الجنب ) dengan Qust Al-Bahri dan minyak zaitun. (Riwayat Tirmizi)",
        "arabic_text": "وَعَن زيد بن أَرقم قَالَ: أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَتَدَاوَى مِنْ ذَاتِ الْجَنْبِ بِالْقُسْطِ البحريِّ وَالزَّيْت. رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 33230,
        "hadith_number": "4536",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penjelasan Nabi SAW Mengenai Penggunaan Minyak dan Pewarna dari Sisi Badan",
        "perawi_melayu": null,
        "english_text": "And from him he said: The Prophet صلى الله عليه وسلم used to apply oil and dye from the side of the body.",
        "malay_translation": "Daripadanya, beliau berkata: Rasulullah SAW biasa menggunakan minyak dan pewarna dari sisi badan.",
        "arabic_text": "وَعَنْهُ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْعَتُ الزَّيْتَ وَالْوَرْسَ مِنْ ذَاتِ الْجَنْبِ. رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 33231,
        "hadith_number": "4537",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Khasiat Sanna sebagai Ubat",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Asma' binti Umais RA, bahawa Nabi SAW bertanya kepadanya: “Dengan apa engkau berubat?” Dia menjawab: “Dengan Shubrum.” Baginda bersabda: “Ianya panas, ianya panas.” Dia berkata: “Kemudian aku berubat dengan Sanna.” Maka Nabi SAW bersabda: “Sekiranya ada sesuatu yang mempunyai penawar daripada kematian, nescaya ia ada pada Sanna.” Riwayat Tirmizi dan Ibnu Majah. Tirmizi berkata: Hadis ini hasan gharib.",
        "arabic_text": "وَعَن أَسْمَاءَ بِنْتِ عُمَيْسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَأَلَهَا: «بمَ تستَمشِينَ؟» قَالَت: بالشُّبْرمِ قَالَ: «حارٌّ حارٌّ» . قَالَتْ: ثُمَّ اسْتَمْشَيْتُ بِالسَّنَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَوْ أَنَّ شَيْئًا كَانَ فِيهِ الشِّفَاءُ مِنَ الْمَوْتِ لَكَانَ فِي السَّنَا» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيث حسن غَرِيب"
      },
      {
        "id": 33232,
        "hadith_number": "4538",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Allah Menurunkan Penyakit dan Ubat; Berubatlah, Jangan dengan yang Haram",
        "perawi_melayu": "Diriwayatkan daripada Abu Darda' (R.A.)",
        "english_text": "Not Available",
        "malay_translation": "Bahagian pertama adalah Sahih. Daripada Abu Darda' (R.A.), beliau berkata: Rasulullah SAW bersabda: “Sesungguhnya Allah menurunkan penyakit dan ubat, dan menjadikan bagi setiap penyakit itu ubatnya. Maka berubatlah kamu, dan janganlah kamu berubat dengan sesuatu yang haram.” [Riwayat Abu Daud]",
        "arabic_text": "وشطره الأول (صَحِيحٌ) وَعَنْ أَبِي الدَّرْدَاءِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ أَنْزَلَ الدَّاءَ وَالدَّوَاءَ وَجَعَلَ لِكُلِّ دَاءٍ دَوَاءً فَتَدَاوُوا وَلَا تداوَوْا بحرامٍ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33233,
        "hadith_number": "4539",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Penggunaan Ubat Berbahaya",
        "perawi_melayu": null,
        "english_text": "And from Abu Hurairah, he said: The Messenger of Allah, peace and blessings be upon him, forbade the use of harmful medicine. Ahmad, Abu Dawud, al-Tirmidhi, and Ibn Majah narrated it.",
        "malay_translation": "Dan daripada Abu Hurairah, dia berkata: Rasulullah SAW telah melarang penggunaan ubat yang berbahaya. Ahmad, Abu Dawud, al-Tirmidhi, dan Ibn Majah meriwayatkannya.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الدَّوَاءِ الْخَبِيثِ. رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ"
      },
      {
        "id": 33234,
        "hadith_number": "4540",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Petua Rawatan Sakit Kepala dan Kaki Nabi SAW",
        "perawi_melayu": "Salma, pembantu Nabi SAW",
        "english_text": "From Salma, the servant of the Prophet SAW, she said: None complained to the Messenger of Allah SAW of pain in their head, except that he said, \"Have yourself cupped.\" Nor a pain in their feet, except that he said, \"Rub them with something.\"",
        "malay_translation": "Daripada Salma, pembantu Nabi SAW, beliau berkata: Tidak ada seorang pun yang mengadu kepada Rasulullah SAW tentang sakit kepala melainkan baginda bersabda, \"Lakukan bekam.\" Dan juga tidak ada yang mengadu tentang sakit kaki melainkan baginda bersabda, \"Gosoklah kedua kaki itu dengan sesuatu.",
        "arabic_text": "وَعَنْ سَلْمَى خَادِمَةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ: مَا كَانَ أَحَدٌ يَشْتَكِي إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَعًا فِي رَأْسِهِ إِلَّا قَالَ: «احْتَجِمْ» وَلَا وَجَعًا فِي رِجْلَيْهِ إِلَّا قَالَ: «اخْتَضِبْهُمَا» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33235,
        "hadith_number": "4541",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Anjuran Menggunakan Inai untuk Luka dan Kecederaan",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Aisyah R.A., beliau berkata: Tidaklah Rasulullah SAW mengalami luka atau kecederaan, melainkan baginda menyuruhku meletakkan inai di atasnya. (Riwayat Tirmidzi)",
        "arabic_text": "وعنها قَالَت: مَا كَانَ يَكُونَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُرْحَةٌ وَلَا نَكْبَةٌ إِلَّا أَمَرَنِي أَنْ أَضَعَ عَلَيْهَا الْحِنَّاء. رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 33236,
        "hadith_number": "4542",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Sunnah Rasulullah SAW Mengenai Pengambilan Darah (Hentam)",
        "perawi_melayu": "Abi Kabsyah Al-Anmari",
        "english_text": "Daripada Abi Kabsyah Al-Anmari: Bahawa Rasulullah SAW biasa mengambil darah pada bahagian ubun-ubun dan di antara kedua telapak tangannya sambil membaca, \"Barangsiapa yang mengeluarkan darah dari tempat-tempat tersebut, maka tidak akan merugikannya untuk tidak mendapatkan rawatan untuk apa-apa pun.\"  Riwayat Abu Daud dan Ibn Majah.",
        "malay_translation": "Daripada Abi Kabsyah Al-Anmari, bahawa Rasulullah SAW pernah melakukan pengambilan darah (hijama) di ubun-ubun dan di antara kedua telapak tangannya sambil membaca, \"Barangsiapa yang mengeluarkan darah dari tempat-tempat tersebut, maka tidak akan membahayakannya untuk tidak mendapatkan rawatan apa-apa.\"  Diriwayatkan oleh Imam Abu Daud dan Imam Ibn Majah.",
        "arabic_text": "وَعَن أبي كَبْشَة الْأَنْمَارِيِّ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يحتجم على هامته وَبَين كفيه وَهُوَ يَقُولُ: «مَنْ أَهْرَاقَ مِنْ هَذِهِ الدِّمَاءِ فَلَا يَضُرُّهُ أَنْ لَا يَتَدَاوَى بِشَيْءٍ لِشَيْءٍ» . رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه"
      },
      {
        "id": 33237,
        "hadith_number": "4543",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi SAW Mengalirkan Darah Pada Pinggul Kerana Sakit",
        "perawi_melayu": "Jabir",
        "english_text": "Daripada Jabir: Bahawa Nabi SAW telah mengalirkan darah pada pinggul baginda kerana sakit yang ada padanya. Diriwayatkan oleh Imam Abu Daud.",
        "malay_translation": "Daripada Jabir, bahawa Nabi SAW mengurutkan darah pada pinggul baginda kerana kesakitan yang baginda alami.  Riwayat ini telah diriwayatkan oleh Imam Abu Daud.",
        "arabic_text": "وَعَنْ جَابِرٌ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ عَلَى وَرِكِهِ مِنْ وَثْءٍ كَانَ بِهِ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33238,
        "hadith_number": "4544",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Petunjuk Nabi SAW Mengenai Sunat Berhijam",
        "perawi_melayu": "Ibnu Mas'ud",
        "english_text": "And from Ibn Mas'ud, he said: The Messenger of Allah (peace and blessings be upon him) narrated on the night of the Mi'raj (ascension): That he did not pass by any assembly of angels except that they commanded him, 'Command your Ummah to practice hijama (bloodletting).'  Tirmidhi and Ibn Majah narrated it. And Tirmidhi said: This is a good and rare Hadith.",
        "malay_translation": "Dan daripada Ibnu Mas'ud, beliau berkata: Rasulullah SAW menceritakan pada malam Mi'raj: bahawa baginda tidak melewati satu pun kumpulan malaikat melainkan mereka menyuruhnya, 'Suruhlah umatmu melakukan hijama (pengaliran darah).'  Tirmizi dan Ibnu Majah meriwayatkannya. Dan Tirmizi berkata: Hadis ini adalah hadis yang hasan dan gharib.",
        "arabic_text": "وَعَن ابنِ مَسْعُود قَالَ: حَدَّثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ علن لَيْلَةَ أُسَرِيَ بِهِ: أَنَّهُ لَمْ يَمُرَّ عَلَى مَلَأٍ مِنَ الْمَلَائِكَةِ إِلَّا أَمَرُوهُ: «مُرْ أُمَّتَكَ بِالْحِجَامَةِ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيث حسن غَرِيب"
      },
      {
        "id": 33239,
        "hadith_number": "4545",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Membunuh Katak dalam Ubat",
        "perawi_melayu": "Abdul Rahman bin Usman",
        "english_text": "And from Abdurrahman bin Usman: Indeed, a physician asked the Prophet, peace be upon him, about a toad to be placed in a medicine, and the Prophet, peace be upon him, forbade him from killing it. Narrated by Abu Dawud",
        "malay_translation": "Dan daripada Abdurrahman bin Usman: Sesungguhnya seorang pakar perubatan bertanya kepada Rasulullah SAW tentang seekor katak yang ingin diletakkan dalam ubat. Baginda SAW melarangnya daripada membunuhnya. Diriwayatkan oleh Abu Dawud.",
        "arabic_text": "وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ: إِنَّ طَبِيبًا سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ضِفْدَعٍ يَجْعَلُهَا فِي دَوَاءٍ فَنَهَاهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَتْلِهَا. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33240,
        "hadith_number": "4546",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah S.A.W. Berbekam pada Akhdain dan Kahil",
        "perawi_melayu": "Diriwayatkan daripada Anas R.A.",
        "english_text": "Not Available",
        "malay_translation": "Daripada Anas R.A., beliau berkata: Rasulullah S.A.W. berbekam pada *akhdain* (dua urat darah di leher) dan *kahil* (bahagian atas belakang antara dua bahu). Riwayat Abu Daud, dan At-Tirmizi serta Ibnu Majah menambahkan: Dan baginda berbekam pada hari ke-17, ke-19, dan ke-21 (bulan Hijrah).",
        "arabic_text": "وَعَنْ أَنَسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحْتَجِمُ فِي الْأَخْدَعَيْنِ وَالْكَاهِلِ. رَوَاهُ أَبُو دَاوُدَ وَزَادَ التِّرْمِذِيُّ وَابْنُ مَاجَهْ: وَكَانَ يحتجمُ سبعَ عشرَة وتسع عشرَة وَإِحْدَى وَعشْرين"
      },
      {
        "id": 33241,
        "hadith_number": "4547",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Mengamalkan Hijama",
        "perawi_melayu": "Ibn Abbas رضي الله عنهما",
        "english_text": "Daripada Ibn Abbas رضي الله عنهما bahawa Nabi SAW suka melakukan hijama pada hari ke-17, 19, dan 21.",
        "malay_translation": "Daripada Ibn Abbas رضي الله عنهما bahawa Nabi SAW suka melakukan hijama pada hari ke-17, 19, dan 21. Dikeluarkan dalam Syarah Sunnah.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَسْتَحِبُّ الْحِجَامَةَ لِسَبْعَ عَشْرَةَ وَتِسْعَ عَشْرَةَ وَإِحْدَى وَعِشْرِينَ. رَوَاهُ فِي شرح السّنة"
      },
      {
        "id": 33242,
        "hadith_number": "4548",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keberkatan Menghijam pada Hari-Hari Tertentu untuk Penyembuhan",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "From Abu Hurairah, from the Messenger of Allah (peace and blessings be upon him), who said: \"Whoever has bloodletting done on the 17th, 19th, or 21st, will find healing from every disease.\"  Narrated by Abu Dawud",
        "malay_translation": "Daripada Abu Hurairah, daripada Rasulullah SAW, baginda bersabda: \"Sesiapa yang menjalani proses perdarahan (hijam) pada hari ke-17, ke-19, atau ke-21, nescaya dia akan mendapat kesembuhan daripada segala penyakit.\" Diriwayatkan oleh Imam Abu Dawud",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنِ احْتَجَمَ لِسَبْعَ عَشْرَةَ وَتِسْعَ عَشْرَةَ وَإِحْدَى وَعِشْرِينَ كَانَ شِفَاءً لَهُ مِنْ كُلِّ دَاء» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33243,
        "hadith_number": "4549",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Hirak Darah pada Hari Selasa",
        "perawi_melayu": "Kabsah binti Abi Bakr",
        "english_text": "Narrated from Kabshah bint Abi Bakr that her father used to forbid his household from bloodletting on Tuesdays, claiming it from the Messenger of Allah (ﷺ): \"Tuesday is a day of blood, and there is a time on it that does not clot.\"",
        "malay_translation": "Daripada Kabshah binti Abi Bakr, dia menceritakan bahawa bapanya pernah melarang ahli keluarganya daripada melakukan hijama pada hari Selasa, sambil mendakwa daripada Rasulullah SAW: \"Hari Selasa adalah hari darah, dan pada hari itu terdapat satu masa yang darah tidak membeku.\"",
        "arabic_text": "وَعَن كبشةَ بنت أبي بكرةَ: أَنَّ أَبَاهَا كَانَ يُنْهِي أَهْلَهُ عَنِ الْحِجَامَةِ يَوْمَ الثُّلَاثَاءِ وَيَزْعُمُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَنَّ يَوْمَ الثُّلَاثَاءِ يَوْمُ الدَّمِ وَفِيهِ سَاعَةٌ لَا يَرْقَأُ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33244,
        "hadith_number": "4550",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis tentang Hukum Menghijam pada Hari Rabu atau Sabtu",
        "perawi_melayu": "Al-Zuhri",
        "english_text": "Daripada Zuhri, secara mursal daripada Nabi SAW, \"Jika seseorang yang berhijam pada hari Rabu atau hari Sabtu dan mendapat kesan yang baik, maka tidak ada yang patut dipersalahkan melainkan dirinya sendiri.\"",
        "malay_translation": "Daripada Al-Zuhri, secara mursal daripada Nabi SAW,  “Jika seseorang yang melakukan penghijam pada hari Rabu atau hari Sabtu dan mendapat kesan yang baik, maka janganlah dia menyalahkan selain dirinya sendiri.”  (Diriwayatkan oleh Imam Ahmad dan Abu Daud, dan ia disandarkan tetapi tidak sahih.)",
        "arabic_text": "وَعَنِ الزُّهْرِيِّ مُرْسَلًا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مِنْ احْتَجَمَ يَوْمَ الْأَرْبِعَاءِ أَوْ يَوْمَ السَّبْتِ فَأَصَابَهُ وَضَحٌ فَلَا يَلُومَنَّ إِلَّا نَفْسَهُ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَقَالَ: وَقَدْ أسْند وَلَا يَصح"
      },
      {
        "id": 33245,
        "hadith_number": "4551",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menyalahkan Orang Lain Jika Menghijam atau Mengurut pada Hari Sabtu atau Rabu",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Daripadanya, secara mursal, Rasulullah SAW bersabda: \"Barangsiapa yang berhijam atau mengurut pada hari Sabtu atau hari Rabu, maka janganlah dia menyalahkan melainkan dirinya sendiri pada waktu siang hari.\"",
        "malay_translation": "Daripadanya, secara mursal, Rasulullah SAW bersabda: \"Barangsiapa yang melakukan perhijaman atau urutan pada hari Sabtu atau hari Rabu, maka janganlah dia menyalahkan orang lain melainkan dirinya sendiri pada waktu siang hari.\" Diriwayatkan dalam kitab Syarh as-Sunnah.",
        "arabic_text": "وَعَنْهُ مُرْسَلًا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ احْتَجَمَ أَوِ اطَّلَى يَوْمَ السَّبْتِ أَوِ الْأَرْبِعَاءِ فَلَا يَلُومَنَّ إِلَّا نَفْسَهُ فِي الوَضَحِ» . رَوَاهُ فِي شرح السّنة"
      },
      {
        "id": 33246,
        "hadith_number": "4552",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Tatacara Perubatan dan Amalan Sihir",
        "perawi_melayu": "Zainab binti Abdullah bin Mas'ud",
        "english_text": "Not Available",
        "malay_translation": "Daripada Zainab, isteri Abdullah bin Mas'ud, bahawa Abdullah melihat benang pada lehernya lalu bertanya, \"Apakah ini?\" Zainab menjawab, \"Benang ini untuk perubatan (ruqyah).\" Abdullah mengambil benang itu lalu memotongnya sambil berkata, \"Wahai keluarga Abdullah, jauhkanlah diri daripada syirik. Aku mendengar Rasulullah SAW bersabda, 'Sesungguhnya ruqyah, ta'aim dan tiwalah adalah syirik.'\" Zainab bertanya, \"Mengapa engkau berkata sedemikian?  Mataku pernah sakit dan aku selalu pergi berjumpa seorang Yahudi untuk dirawat, dan apabila dirawat, sakitku hilang.\" Abdullah berkata, \"Sesungguhnya itu perbuatan syaitan yang mencelakakannya dengan tangannya sendiri. Apabila diruqyah, ia berhenti. Cukuplah bagimu untuk membaca apa yang dibaca Rasulullah SAW, 'Semoga penyakit ini hilang. Ya Tuhan sekalian alam, ubatlah penyakitnya. Engkaulah yang menyembuh. Tiada kesembuhan melainkan kesembuhanmu, kesembuhan yang tidak meninggalkan penyakit.'\"  (Hadis riwayat Imam Abu Daud).",
        "arabic_text": "وَعَنْ زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ أَنَّ عَبْدَ اللَّهِ رَأَى فِي عُنُقِي خَيْطًا فَقَالَ: مَا هَذَا؟ فَقُلْتُ: خَيْطٌ رُقِيَ لِي فِيهِ قَالَتْ: فَأَخَذَهُ فَقَطَعَهُ ثُمَّ قَالَ: أَنْتُمْ آلَ عَبْدَ اللَّهِ لَأَغْنِيَاءٌ عَنِ الشِّرْكِ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُول: «إِنَّ الرُّقَى وَالتَّمَائِمَ وَالتِّوَلَةَ شِرْكٌ» فَقُلْتُ: لِمَ تَقُولُ هَكَذَا؟ لَقَدْ كَانَتْ عَيْنِي تُقْذَفُ وَكُنْتُ أَخْتَلِفُ إِلَى فُلَانٍ الْيَهُودِيِّ فَإِذَا رَقَاهَا سَكَنَتْ فَقَالَ عَبْدُ اللَّهِ: إِنَّمَا ذَلِكِ عَمَلُ الشَّيْطَانِ كَانَ يَنْخَسُهَا بِيَدِهِ فَإِذَا رُقِيَ كُفَّ عَنْهَا إِنَّمَا كَانَ يَكْفِيكِ أَنْ تَقُولِي كَمَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «أَذْهِبِ الْبَاسَ رَبَّ النَّاسِ وَاشْفِ أَنْتَ الشَّافِي لَا شِفَاءَ إِلَّا شِفَاؤُكَ شِفَاءٌ لَا يُغَادِرُ سقما» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33247,
        "hadith_number": "4553",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menggunakan Nushrah (Jampi) Kerana Ia Perbuatan Syaitan",
        "perawi_melayu": "Diriwayatkan daripada Jabir R.A.",
        "english_text": "Not Available",
        "malay_translation": "Daripada Jabir R.A., beliau berkata: Nabi SAW ditanya tentang Nushrah (jampi), lalu baginda bersabda: \"Ia adalah daripada perbuatan syaitan.\" (Riwayat Abu Daud)",
        "arabic_text": "وَعَن جَابر قَالَ: سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ النُّشْرَةِ فَقَالَ: «هُوَ مِنْ عَمَلِ الشَّيْطَانِ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33248,
        "hadith_number": "4554",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penjelasan Mengenai Tidak Perlu Minum Ubat atau Menggunakan Azimat",
        "perawi_melayu": "Abdullah bin Umar",
        "english_text": "Daripada Abdullah bin Umar, katanya: Saya mendengar Rasulullah SAW bersabda: \"Aku tidak peduli apa yang aku lakukan jika aku minum ubat penawar, atau menggantung azimat, atau berpuisi atas kehendakku sendiri.\"",
        "malay_translation": "Daripada Abdullah bin Umar, katanya: Aku mendengar Rasulullah SAW bersabda, “Aku tidak peduli apa yang aku lakukan, jika aku minum ubat penawar atau menggantung azimat, atau berpuisi atas kehendakku sendiri.” Hadis ini diriwayatkan oleh Imam Abu Dawud.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَا أُبَالِي مَا أَتَيْتُ إِنْ أَنَا شَرِبْتُ تِرْيَاقًا أَوْ تَعَلَّقْتُ تَمِيمَةً أَوْ قُلْتُ الشِّعْرَ مِنْ قِبَلِ نَفْسِي» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33249,
        "hadith_number": "4555",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Meninggalkan Tawakal Melalui Menggunakan Sihir atau Minuman Ajaib",
        "perawi_melayu": "Mughirah bin Syubah",
        "english_text": "From Mughirah bin Syubah, he said: The Prophet, peace and blessings be upon him, said, \"Whoever seeks protection or uses magic has relinquished tawakkul.\" Narrated by Ahmad, at-Tirmidhi, and Ibn Majah.",
        "malay_translation": "Daripada Mughirah bin Syubah, beliau berkata: Rasulullah SAW bersabda, \"Sesiapa yang meminta perlindungan atau menggunakan sihir, maka dia telah meninggalkan tawakkal.\" Diriwayatkan oleh Imam Ahmad, al-Tirmizi, dan Imam Ibn Majah.",
        "arabic_text": "وَعَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ اكْتَوَى أَوِ اسْتَرْقَى فَقَدْ بَرِئَ مِنَ التَّوَكُّلِ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيّ وَابْن مَاجَه"
      },
      {
        "id": 33250,
        "hadith_number": "4556",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menggantungkan Sesuatu yang Dipercayai Dapat Menolak Musibah",
        "perawi_melayu": "Isa bin Hamza",
        "english_text": "And from 'Isa bin Hamza, he said: I entered upon 'Abdullah bin 'Ukaim and he was suffering from a fever. I said: \"Should you not hang an amulet?\" He said: \"We seek refuge in Allah from that.\" The Messenger of Allah, peace and blessings be upon him, said: \"Whoever hangs something, it is entrusted to him.\"",
        "malay_translation": "Dan daripada 'Isa bin Hamza, beliau berkata: Aku melawat 'Abdullah bin 'Ukaim dan beliau sedang demam. Aku berkata: \"Bukankah engkau patut menggantung jimat?\" Beliau menjawab: \"Kami memohon perlindungan kepada Allah daripada perkara itu.\" Rasulullah SAW bersabda: \"Barangsiapa yang menggantung sesuatu, ia akan dipercayakan kepadanya.\"",
        "arabic_text": "وَعَنْ عِيسَى بْنِ حَمْزَةَ قَالَ: دَخَلْتُ عَلَى عبدِ الله بن عُكيم وَبِهِ حُمْرَةٌ فَقُلْتُ: أَلَا تُعَلِّقُ تَمِيمَةً؟ فَقَالَ: نَعُوذُ بِاللَّهِ مِنْ ذَلِكَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ تَعَلَّقَ شَيْئًا وُكِلَ إِليهِ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33251,
        "hadith_number": "4557",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Pengobatan Selain Kerana Penyakit Mata atau Sengatan",
        "perawi_melayu": null,
        "english_text": "And it was narrated from Imran ibn Husain that the Messenger of Allah, peace and blessings be upon him, said, \"There is no treatment except for an eye or a burn.\"",
        "malay_translation": "Dan daripada Imran bin Husain, bahawa Rasulullah SAW bersabda, \"Tidak ada rawatan kecuali untuk penyakit mata atau sengatan.\"",
        "arabic_text": "وَعَن عِمْرَانَ بْنِ حُصَيْنٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا رُقْيَةَ إِلَّا مِنْ عَيْنٍ أَوْ حُمَةٍ» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ وَأَبُو دَاوُد"
      },
      {
        "id": 33252,
        "hadith_number": "4558",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis berkaitan riwayat daripada Buraidah",
        "perawi_melayu": "Ibn Majah",
        "english_text": "Tidak ada teks Inggeris yang disediakan.",
        "malay_translation": "Dan ia diriwayatkan oleh Ibn Majah daripada Buraidah.",
        "arabic_text": "وَرَوَاهُ ابْن مَاجَه عَن بُرَيْدَة"
      },
      {
        "id": 33253,
        "hadith_number": "4559",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Penggunaan Ruqyah Kecuali Bagi Penyakit Mata, Sengatan, atau Darah",
        "perawi_melayu": "Anas",
        "english_text": "And from Anas, he said: The Messenger of Allah, peace and blessings be upon him, said: \"There is no ruqyah (spiritual healing) except for (problems caused by) an evil eye, or a sting, or blood.\" Reported by Abu Dawud.",
        "malay_translation": "Dan daripada Anas, beliau berkata: Rasulullah SAW bersabda: \"Tidak ada ruqyah (rawatan kerohanian) melainkan (bagi masalah yang disebabkan oleh) mata jahat, atau sengatan, atau darah.\" Diriwayatkan oleh Abu Dawud.",
        "arabic_text": "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا رُقْيَةَ إِلَّا مِنْ عَيْنٍ أَوْ حُمَةٍ أَوْ دَمٍ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33254,
        "hadith_number": "4560",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Memohon Perlindungan dari Mata Jahat terhadap Anak",
        "perawi_melayu": "Asma' binti 'Ummais",
        "english_text": "Daripada Asma' binti 'Ummais, dia berkata: Wahai Rasulullah, anak lelaki Ja'far itu cepat-cepat mendapatkan perhatian orang lain. Adakah patut aku memohon perlindungan dari mata jahat baginya? Baginda bersabda: Ya. Kerana sekiranya ada sesuatu yang telah ditentukan nasibnya, nescaya mata telah lebih dahulu menimpanya.",
        "malay_translation": "Daripada Asma' binti 'Ummais, beliau berkata, \"Wahai Rasulullah, anak Ja'far cepat-cepat mendapatkan perhatian orang lain. Adakah perlu saya memohon perlindungan daripada mata jahat baginya?\" Baginda SAW bersabda: Ya. Kerana sekiranya sesuatu sudah ditentukan nasibnya, pasti mata telah lebih dahulu menimpanya.",
        "arabic_text": "وَعَن أَسمَاء بنت عُميس قَالَتْ: يَا رَسُولَ اللَّهِ إِنَّ وَلَدَ جَعْفَرٍ تُسْرِعُ إِلَيْهِمُ الْعَيْنُ أَفَأَسْتَرْقِي لَهُمْ؟ قَالَ: «نَعَمْ فَإِنَّهُ لَوْ كَانَ شَيْءٌ سَابِقُ الْقَدَرِ لَسَبَقَتْهُ العينُ» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ وَابْن مَاجَه"
      },
      {
        "id": 33255,
        "hadith_number": "4561",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Petunjuk Rasulullah SAW Mengenai Perubatan Tradisional (Rawatan Semut)",
        "perawi_melayu": "Ummul Khairah binti Abdullah",
        "english_text": "And from Syafa' binti Abdullah, she said: The Messenger of Allah, peace and blessings be upon him, entered while I was with Hafsah, and said, \"Why don't you teach this remedy (perawatan) of ants, as you taught her writing?\"  Narrated by Abu Dawud.",
        "malay_translation": "Dan daripada Syafa' binti Abdullah, beliau berkata: Rasulullah SAW masuk ketika aku bersama Hafsah, dan baginda bersabda, \"Mengapa engkau tidak mengajar rawatan semut ini sebagaimana engkau telah mengajarnya menulis?\" Diriwayatkan oleh Abu Dawud.",
        "arabic_text": "وَعَن الشَّفاءِ بنت عبد الله قَالَتْ: دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا عِنْدَ حَفْصَةَ فَقَالَ: «أَلَا تُعَلِّمِينَ هَذِهِ رُقْيَةَ النَّمْلَةِ كَمَا عَلَّمْتِيهَا الْكِتَابَةَ؟» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33256,
        "hadith_number": "4562",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penyakit 'Ain dan Cara Mengubatinya",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Umamah bin Sahl bin Hunaif RA, beliau berkata: 'Amir bin Rabi'ah melihat Sahl bin Hunaif sedang mandi, lalu dia berkata: 'Demi Allah, aku tidak pernah melihat seperti hari ini, tidak juga kulit wanita pingitan.' Sahl kemudiannya rebah. Lalu mereka datang kepada Rasulullah SAW dan berkata: 'Wahai Rasulullah, adakah anda tahu tentang Sahl bin Hunaif? Demi Allah, dia tidak dapat mengangkat kepalanya.' Baginda bersabda: 'Adakah kamu mengesyaki seseorang?' Mereka berkata: 'Kami mengesyaki 'Amir bin Rabi'ah.' Rasulullah SAW memanggil 'Amir dan menegurnya dengan keras dan bersabda: 'Kenapa salah seorang daripada kamu membunuh saudaranya? Tidakkah kamu memberkati (dengan menyebut 'MashaAllah')? Mandilah untuknya.' Lalu 'Amir membasuh mukanya, kedua tangannya, kedua sikunya, kedua lututnya, hujung kedua kakinya dan bahagian dalam kainnya di dalam sebuah bekas, kemudian air itu dituang ke atas Sahl, lalu dia kembali sihat bersama orang ramai dan tidak ada apa-apa yang menimpanya.' Diriwayatkan dalam Syarah as-Sunnah. Malik meriwayatkannya dan dalam riwayatnya: Baginda bersabda: 'Sesungguhnya 'ain itu benar, berwudhuklah untuknya.'",
        "arabic_text": "وَعَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ قَالَ: رَأَى عَامِرُ بْنُ رَبِيعَةَ سَهْلَ بْنَ حُنَيْفٍ يَغْتَسِلُ فَقَالَ: وَاللَّهِ مَا رَأَيْتُ كَالْيَوْمِ وَلَا جِلْدَ مُخَبَّأَةٍ قَالَ: فَلُبِطَ سَهْلٌ فَأَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقِيلَ لَهُ: يَا رَسُولَ اللَّهِ هَلْ لَكَ فِي سَهْلِ بْنِ حُنَيْفٍ؟ وَاللَّهِ مَا يَرْفَعُ رَأْسَهُ فَقَالَ: «هَلْ تَتَّهِمُونَ لَهُ أَحَدًا؟» فَقَالُوا: نَتَّهِمُ عَامِرَ بْنَ رَبِيعَةَ قَالَ: فَدَعَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامِرًا فَتُغُلِّظَ عَلَيْهِ وَقَالَ: «عَلَامَ يَقْتُلُ أَحَدُكُمْ أَخَاهُ؟ أَلَا بَرَّكْتَ؟ اغْتَسِلْ لَهُ» . فَغَسَلَ لَهُ عَامِرٌ وَجْهَهُ وَيَدَيْهِ وَمِرْفَقَيْهِ وَرُكْبَتَيْهِ وَأَطْرَافَ رِجْلَيْهِ وَدَاخِلَةَ إِزَارِهِ فِي قَدَحٍ ثُمَّ صُبَّ عَلَيْهِ فَرَاحَ مَعَ النَّاسِ لَيْسَ لَهُ بَأْس. رَوَاهُ فِي شَرْحِ السُّنَّةِ وَرَوَاهُ مَالِكٌ وَفِي رِوَايَتِهِ: قَالَ: «إِن الْعين حق تَوَضَّأ لَهُ»"
      },
      {
        "id": 33257,
        "hadith_number": "4563",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perlindungan Nabi SAW daripada Jin dan Mata Jahat Manusia",
        "perawi_melayu": "Abu Sa'id al-Khudri",
        "english_text": "And from Abu Sa'id al-Khudri, he said: The Messenger of Allah, peace and blessings be upon him, used to seek refuge from the jinn and the evil eye of man until the two verses of protection were revealed.  So when they were revealed, he took refuge in them and left other forms of protection.  Narrated by at-Tirmidhi and Ibn Majah. And at-Tirmidhi said: This is a good and strange hadith.",
        "malay_translation": "Dan daripada Abu Sa'id al-Khudri, beliau berkata: Rasulullah SAW dahulu selalu memohon perlindungan daripada jin dan mata jahat manusia sehingga diturunkan dua ayat perlindungan. Maka setelah diturunkan, baginda memohon perlindungan dengannya dan meninggalkan cara-cara perlindungan yang lain. Diriwayatkan oleh at-Tirmidhi dan Ibn Majah. Dan at-Tirmidhi berkata: Hadis ini adalah hadis hasan dan gharib.",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَعَوَّذُ مِنَ الْجَانِّ وَعَيْنِ الْإِنْسَانِ حَتَّى نَزَلَتِ الْمُعَوِّذَتَانِ فَلَمَّا نزلت أَخذ بهما وَترك سِوَاهُمَا. رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيث حسن غَرِيب"
      },
      {
        "id": 33258,
        "hadith_number": "4564",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perihal Orang-orang Yang Terpengaruh Jin",
        "perawi_melayu": "Aisyah",
        "english_text": "And from Aisyah, she said: The Messenger of Allah, peace and blessings be upon him, said to me, \"Have the 'Mugarriboon' been seen amongst you?\" I said, \"And what are the 'Mugarriboon'?\" He said, \"Those in whom jinn share.\" Narrated by Abu Dawud.",
        "malay_translation": "Daripada Aisyah, dia berkata: Rasulullah SAW bersabda kepadaku, \"Adakah 'Mugarriboon' dilihat di kalangan kamu?\" Aku bertanya, \"Apakah 'Mugarriboon' itu?\" Baginda menjawab, \"Mereka yang jinn berkongsi dengannya.\"",
        "arabic_text": "وَعَنْ عَائِشَةَ قَالَتْ: قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَلْ رُئِيَ فِيكُمُ الْمُغَرِّبُونَ؟» قُلْتُ: وَمَا الْمُغَرِّبُونَ؟ قَالَ: «الَّذِينَ يَشْتَرِكُ فِيهِمُ الْجِنُّ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33259,
        "hadith_number": "4565",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis Pilihan Ubat yang Terbaik",
        "perawi_melayu": null,
        "english_text": "The Hadith of Ibn Abbas was mentioned: \"The best of what you treat yourselves with\", in the chapter of \"Treatment\".",
        "malay_translation": "Hadis Ibn Abbas telah disebut: \"Perubatan terbaik yang kamu amalkan\", dalam bab \"Pengobatan.\"",
        "arabic_text": "وذُكر حديثُ ابْن عباسٍ: «خيرَ مَا تداويتم» فِي «بَاب التَّرَجُّل»"
      },
      {
        "id": 33260,
        "hadith_number": "4566",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perut Sebagai Sumber Kesihatan dan Penyakit",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Daripada Abu Hurairah RA, Baginda SAW bersabda, \"Perut adalah kolam badan, dan urat-urat menuju kepadanya. Jika perut sihat, urat-urat akan mengeluarkan kesihatan. Jika perut rosak, urat-urat akan mengeluarkan penyakit.\"",
        "malay_translation": "Daripada Abu Hurairah r.a., Baginda Rasulullah SAW bersabda, \"Perut adalah kolam tubuh, dan urat-urat menuju kepadanya. Jika perut sihat, urat-urat akan mengeluarkan kesihatan. Jika perut rosak, urat-urat akan mengeluarkan penyakit.\"",
        "arabic_text": "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْمَعِدَةُ حَوْضُ الْبَدَنِ وَالْعُرُوقُ إِلَيْهَا وَارِدَةٌ فَإِذَا صَحَّتِ الْمَعِدَةُ صَدَرَتِ الْعُرُوقُ بِالصِّحَّةِ وَإِذَا فَسَدَتِ الْمَعِدَةُ صَدَرَتِ الْعُرُوقُ بِالسقمِ»"
      },
      {
        "id": 33261,
        "hadith_number": "4567",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Diligari Labah-Labah dan Doa Kesembuhan",
        "perawi_melayu": null,
        "english_text": "Narrated Ali (may Allah be pleased with him):  The Messenger of Allah (peace and blessings of Allah be upon him) was praying one night. He placed his hand on the ground, and a scorpion stung him. The Messenger of Allah (peace and blessings of Allah be upon him) crushed the scorpion with his sandal.  Upon returning, he said, \"May Allah curse the scorpion; it does not leave any one praying, or otherwise, nor a Prophet or anyone else.\" Then, he took some salt and water, mixing them in a vessel and poured it over the finger where he was stung, wiping it and reciting the two protective verses (Ayat al-Kursi).  Al-Bayhaqi narrated in his book Shua'b al-Iman.",
        "malay_translation": "Daripada Ali r.a.:  Pada suatu malam, Rasulullah SAW sedang menunaikan solat. Baginda meletakkan tangannya di atas tanah, lalu seekor lipas menyengat Baginda. Rasulullah SAW menghancurkan lipas itu dengan kasutnya.  Apabila Baginda kembali, Baginda bersabda, \"Semoga Allah melaknat lipas itu; ia tidak meninggalkan sesiapa yang sedang menunaikan solat, atau yang lain, mahupun Nabi atau yang lain.\" Kemudian, Baginda mengambil sedikit garam dan air, mencampurkannya dalam bekas, dan menuangkannya ke atas jari Baginda yang disengat, menggosoknya dan membaca dua ayat perlindungan (Ayat Kursi).  Al-Bayhaqi meriwayatkan dalam kitab beliau, Shua'b al-Iman.",
        "arabic_text": "وَعَن عَليّ قَالَ: بَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ يُصَلِّي فَوَضَعَ يَدَهُ عَلَى الْأَرْضِ فَلَدَغَتْهُ عَقْرَبٌ فَنَاوَلَهَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَعْلِهِ فَقَتَلَهَا فَلَمَّا انْصَرَفَ قَالَ: «لَعَنَ اللَّهُ الْعَقْرَبَ مَا تَدَعُ مُصَلِّيًا وَلَا غَيْرَهُ أَوْ نَبِيًّا وَغَيْرَهُ» ثُمَّ دَعَا بملحٍ وماءٍ فَجعله فِي إِناءٍ ثمَّ جَعَلَ يَصُبُّهُ عَلَى أُصْبُعِهِ حَيْثُ لَدَغَتْهُ وَيَمْسَحُهَا وَيُعَوِّذُهَا بِالْمُعَوِّذَتَيْنِ. رَوَاهُمَا الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ"
      },
      {
        "id": 33262,
        "hadith_number": "4568",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mengubati Penyakit Mata dengan Rambut Nabi SAW",
        "perawi_melayu": "Uthman bin Abdullah bin Mawhab",
        "english_text": "Not Available",
        "malay_translation": "Daripada Uthman bin Abdullah bin Mawhab, dia berkata: Keluargaku mengutusku kepada Umm Salamah dengan sebuah cawan air.  Jika seseorang terkena penyakit mata atau sesuatu yang serupa, mereka akan mengutuskan kepada Umm Salamah rambut Nabi SAW. Umm Salamah akan mengeluarkan rambut Rasulullah SAW, dan menyimpannya dalam bekas perak. Kemudian beliau akan menggosoknya dalam air.  Nabi SAW akan meminumnya.  Aku melihat ke dalam bekas perak tersebut dan melihat beberapa helai rambut berwarna merah.  Hadis ini diriwayatkan oleh al-Bukhari.",
        "arabic_text": "وَعَن عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ قَالَ: أَرْسَلَنِي أَهْلِي إِلَى أُمِّ سَلَمَةَ بِقَدَحٍ مِنْ مَاءٍ وَكَانَ إِذَا أَصَابَ الْإِنْسَانَ عَيْنٌ أَوْ شَيْءٌ بَعَثَ إِلَيْهَا مِخْضَبَهُ فَأَخْرَجَتْ مِنْ شَعْرُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَتْ تُمْسِكُهُ فِي جُلْجُلٍ مِنْ فِضَّةٍ فَخَضْخَضَتْهُ لَهُ فَشَرِبَ مِنْهُ قَالَ: فَاطَّلَعْتُ فِي الْجُلْجُلِ فَرَأَيْت شَعرَات حَمْرَاء. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 33263,
        "hadith_number": "4569",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keistimewaan Buah Kemأة dan Khasiatnya untuk Mata",
        "perawi_melayu": "Abu Hurairah",
        "english_text": null,
        "malay_translation": "Daripada Abu Hurairah رضي الله عنه, bahawa ada segolongan sahabat Rasulullah SAW bertanya kepada Baginda SAW, \"Adakah buah kemأة ini merupakan buah dari bumi yang berpenyakit?\". Maka Rasulullah SAW menjawab, \"Buah kemأة itu adalah daripada nikmat Allah dan airnya adalah penawar untuk penyakit mata. Manakala buah ajwa pula adalah daripada syurga dan ia penawar daripada racun.\". Abu Hurairah berkata, \"Lalu aku mengambil tiga atau lima atau tujuh buah kemأة, aku memerahnya dan memasukkan airnya ke dalam botol. Kemudian aku gunakan air itu untuk mengubati mata seorang gadisku yang bermasalah. Dan gadis itu telah sembuh.\".  Riwayat Imam Tirmizi dan beliau berkata, \"Hadis ini adalah hasan.\"",
        "arabic_text": "وَعَن أبي هريرةَ إِنَّ نَاسًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالُوا لرسولِ الله: الْكَمْأَةُ جُدَرِيُّ الْأَرْضِ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْكَمْأَةُ مِنَ الْمَنِّ وَمَاؤُهَا شِفَاءٌ لِلْعَيْنِ وَالْعَجْوَةُ مِنَ الْجَنَّةِ وَهِيَ شِفَاءٌ مِنَ السُّمِّ» . قَالَ أَبُو هُرَيْرَةَ: فَأَخَذْتُ ثَلَاثَةَ أَكْمُؤٍ أَوْ خَمْسًا أَوْ سَبْعًا فَعَصَرْتُهُنَّ وَجَعَلْتُ مَاءَهُنَّ فِي قَارُورَةٍ وَكَحَّلْتُ بِهِ جَارِيَةً لِي عَمْشَاءَ فَبَرَأَتْ. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حسن"
      },
      {
        "id": 33264,
        "hadith_number": "4570",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keistimewaan Madu untuk Mencegah Musibah Besar",
        "perawi_melayu": null,
        "english_text": "Daripada baginda, baginda bersabda: \"Barangsiapa menjilat madu tiga pagi dalam setiap bulan, maka tidak akan menimpa dirinya musibah besar.\"",
        "malay_translation": "Daripadanya, baginda berkata: Bersabda Rasulullah SAW: \"Barangsiapa menjilat madu tiga kali pada pagi hari dalam setiap bulan, maka tidak akan menimpa dirinya bala bencana yang besar.\" ",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ لَعِقَ الْعَسَلَ ثَلَاثَ غَدَوَاتٍ فِي كلِّ شهر لم يصبهُ عَظِيم الْبلَاء»"
      },
      {
        "id": 33265,
        "hadith_number": "4571",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kebaikan Madu dan Al-Quran",
        "perawi_melayu": "Abdullah bin Mas'ud",
        "english_text": "Daripada Abdullah bin Mas'ud, katanya: Rasulullah SAW bersabda: \"Hendaklah kamu mengambil dua penawar (ubat): madu dan Al-Quran.\"",
        "malay_translation": "Daripada Abdullah bin Mas'ud, katanya: Rasulullah SAW bersabda, \"Hendaklah kamu mengambil dua penawar (ubat): madu dan Al-Quran.\"  Dikatakan bahawa hadis ini diriwayatkan oleh Ibn Majah dan Al-Baihaqi dalam kitab Syu'ab al-iman, dan dikatakan bahawa yang terakhir adalah riwayat daripada Ibn Mas'ud.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: عَلَيْكُمْ بِالشِّفَاءَيْنِ: الْعَسَلِ وَالْقُرْآنِ . رَوَاهُمَا ابْنُ مَاجَهْ وَالْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ وَقَالَ: وَالصَّحِيحُ أَنَّ الْأَخِيرَ مَوْقُوفٌ عَلَى ابْنِ مَسْعُودٍ"
      },
      {
        "id": 33266,
        "hadith_number": "4572",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penggunaan Pembekuan Darah (Hijama) dengan Hewan yang Teracuni",
        "perawi_melayu": "Abi Kabsyah al-Anmari",
        "english_text": "And from Abi Kabsyah al-Anmari, that the Messenger of Allah, peace and blessings be upon him, had bloodletting on his neck from a poisoned sheep. Ma'mar said, \"I had bloodletting on myself from a non-poisonous one, similarly, on my face, and my good memory left me until I would be taught the opening chapter of the Book (Fatihah) in prayer.\"",
        "malay_translation": "Dan daripada Abi Kabsyah al-Anmari, bahawa Rasulullah SAW telah melakukan hijama pada leher baginda daripada seekor kambing yang beracun. Ma'mar berkata, \"Saya melakukan hijama pada diri saya daripada binatang yang tidak beracun, secara serupa, pada wajah saya, dan ingatan baik saya telah hilang sehingga saya diajar ayat pembukaan Al-Quran (Surah Al-Fatihah) dalam solat.",
        "arabic_text": "وَعَن أبي كَبْشَة الْأَنْمَارِيِّ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ عَلَى هَامَتِهِ مِنَ الشَّاةِ الْمَسْمُومَةِ قَالَ مَعْمَرٌ: فَاحْتَجَمْتُ أَنَا مِنْ غَيْرِ سُمٍّ كَذَلِكَ فِي يَافُوخِي فَذَهَبَ حُسْنُ الْحِفْظِ عَنِّي حَتَّى كُنْتُ أُلَقَّنُ فَاتِحَةَ الْكِتَابِ فِي الصَّلَاةِ. رَوَاهُ رزين"
      },
      {
        "id": 33267,
        "hadith_number": "4573",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan dan Masa yang Tepat untuk Melakukan Penghijamatan",
        "perawi_melayu": "Nafi' bin Umar",
        "english_text": "Narrated by Nafi' that Ibn 'Umar said: O Nafi', I need bloodletting. Bring me a bloodletter, and let him be a young man; do not make him old or a boy. Ibn 'Umar said, I heard the Messenger of Allah (peace and blessings be upon him) say: \"Bloodletting with a cup of water is best, and it increases intelligence and memory, and increases the memorizer's memorization. Whoever is going to undergo bloodletting, then do so on Thursday in the name of Allah. Avoid bloodletting on Friday, Saturday, and Sunday. Do bloodletting on Monday and Tuesday, and avoid bloodletting on Wednesday, because it is the day on which Job was afflicted with hardship. And no leprosy or vitiligo appears except on Wednesday or on Wednesday night.\"",
        "malay_translation": "Daripada Nafi', bahawa Ibnu Umar berkata: Wahai Nafi', aku memerlukan penghijamatan. Bawakan aku seorang tukang hijama, dan biarlah dia seorang yang muda; jangan yang tua atau kecil. Ibnu Umar berkata, Aku mendengar Rasulullah SAW bersabda: \"Penghijamatan dengan cawan air adalah yang terbaik, dan ia menambahkan kecerdasan dan ingatan, serta menambah ingatan orang yang menghafal. Barangsiapa yang ingin melakukan penghijamatan, lakukan pada hari Khamis dengan menyebut nama Allah. Elakkan daripada penghijamatan pada hari Jumaat, Sabtu dan Ahad. Lakukan penghijamatan pada hari Isnin dan Selasa, dan elakkan pada hari Rabu kerana ia adalah hari di mana Nabi Ayub ditimpa kesusahan. Dan tiada penyakit kusta atau penyakit kulit lain yang muncul melainkan pada hari Rabu atau malam Rabu.\"",
        "arabic_text": "وَعَن نافعٍ قَالَ: قَالَ ابنُ عمر: يَا نَافِع يَنْبغ بِي الدَّمُ فَأْتِنِي بِحَجَّامٍ وَاجْعَلْهُ شَابًّا وَلَا تَجْعَلهُ شَيخا وَلَا صَبيا. وَقَالَ ابْنِ عُمَرُ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «الْحِجَامَةُ عَلَى الرِّيقِ أَمْثَلُ وَهِيَ تُزِيدُ فِي الْعَقْلِ وَتُزِيدُ فِي الْحِفْظِ وَتُزِيدُ الْحَافِظَ حِفْظًا فَمَنْ كَانَ مُحْتَجِمًا فَيَوْمَ الْخَمِيسِ عَلَى اسْمِ اللَّهِ تَعَالَى وَاجْتَنِبُوا الْحِجَامَةَ يَوْمَ الْجُمُعَةِ وَيَوْمَ السَّبْتِ وَيَوْمَ الْأَحَدِ فَاحْتَجِمُوا يَوْمَ الِاثْنَيْنِ وَيَوْمَ الثُّلَاثَاءِ وَاجْتَنِبُوا الْحِجَامَةَ يَوْمَ الْأَرْبِعَاءِ فَإِنَّهُ الْيَوْمُ الَّذِي أُصِيبَ بِهِ أَيُّوبُ فِي الْبَلَاءِ. وَمَا يَبْدُو جُذَامٌ وَلَا بَرَصٌ إِلَّا فِي يَوْمِ الْأَرْبِعَاءِ أَوْ لَيْلَةِ الأربعاءِ» . رَوَاهُ ابنُ مَاجَه"
      },
      {
        "id": 33268,
        "hadith_number": "4574",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Berbekam pada Hari Selasa Tanggal 17 Bulan Hijriah adalah Ubat",
        "perawi_melayu": "Ma'qil bin Yasar",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ma'qil bin Yasar RA, beliau berkata: Rasulullah SAW bersabda: \"Berbekam pada hari Selasa tanggal 17 (bulan Hijriah) adalah ubat untuk penyakit setahun.\" Riwayat Harb bin Ismail al-Kirmani, sahabat Ahmad, dan sanadnya tidak begitu kuat. Beginilah yang terdapat dalam al-Muntaqa.",
        "arabic_text": "وَعَنْ مَعْقِلِ بْنِ يَسَارٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْحِجَامَةُ يَوْمُ الثُّلَاثَاءِ لِسَبْعَ عَشْرَةَ مِنَ الشَّهْرِ دَوَاءٌ لِدَاءِ السَّنَةِ» . رَوَاهُ حَرْبُ بْنُ إِسْمَاعِيلَ الْكِرْمَانِيُّ صَاحِبُ أَحْمَدَ وَلَيْسَ إِسْنَادُهُ بِذَاكَ هَكَذَا فِي الْمُنْتَقى"
      },
      {
        "id": 33269,
        "hadith_number": "4575",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis Mengenai Rujukan Perawi Rizin",
        "perawi_melayu": "Rizin",
        "english_text": "Daripada Abu Hurairah.",
        "malay_translation": "Dan telah diriwayatkan oleh Rizin dengan cara yang serupa daripada Abu Hurairah.",
        "arabic_text": "وروى رزين نَحوه عَن أبي هُرَيْرَة"
      },
      {
        "id": 33270,
        "hadith_number": "4576",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tidak Ada Nasib Buruk, dan Yang Terbaik Adalah Perkara Baik",
        "perawi_melayu": "Abi Hurairah",
        "english_text": "Dari Abu Hurairah, beliau berkata: Aku mendengar Rasulullah SAW bersabda: \"Tidak ada nasib malang, dan yang terbaik daripadanya adalah isyarat baik.\" Mereka bertanya: \"Apakah isyarat baik itu?\" Baginda menjawab: \"Perkataan baik yang didengar oleh seseorang dari kamu.",
        "malay_translation": "Daripada Abu Hurairah, beliau berkata, \"Saya mendengar Rasulullah SAW bersabda, 'Tidak ada burung (yang membawa nasib malang). Yang terbaik adalah firasat yang baik.' Mereka bertanya, 'Apakah firasat yang baik itu?' Baginda menjawab, 'Perkataan baik yang didengar oleh seseorang daripada kamu.'\" ",
        "arabic_text": "عَنْ أَبِي هُرَيْرَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا طِيَرَةَ وَخَيْرُهَا الْفَأْلُ» قَالُوا: وَمَا الْفَأْلُ؟ قَالَ: «الْكَلِمَةُ الصَّالِحَة يسْمعهَا أحدكُم»"
      },
      {
        "id": 33271,
        "hadith_number": "4577",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penjelasan tentang Tidak Ada Penyakit Berjangkit, Tidak ada Kepercayaan terhadap Burung dan Tidak Ada Penyakitan  Khusus",
        "perawi_melayu": null,
        "english_text": "And from him, he said: The Messenger of Allah, may Allah bless him and grant him peace, said: \"There is no contagion, no bad omen, no harm from a particular animal, nor a hawk, and the leper flees as one flees from a lion.\"",
        "malay_translation": "Dan daripada beliau, beliau berkata: Rasulullah SAW bersabda: \"Tidak ada penyakit berjangkit, tidak ada pertanda buruk, tidak ada penyakitan khusus, tidak ada burung hantu, dan orang kusta melarikan diri seperti seseorang melarikan diri dari singa.\" ",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا عَدْوَى وَلَا طِيَرَةَ وَلَا هَامة وَلَا صقر وفر الْمَجْذُومِ كَمَا تَفِرُّ مِنَ الْأَسَدِ» . رَوَاهُ الْبُخَارِيُّ"
      },
      {
        "id": 33272,
        "hadith_number": "4578",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tidak Terdapat Penyakit Berjangkit, Tidak Ada Sihir, dan Tidak Ada Penyakit Berjangkit",
        "perawi_melayu": null,
        "english_text": null,
        "malay_translation": "Dan daripadanya beliau berkata, \"Rasulullah SAW bersabda, 'Tidak ada penyakit berjangkit, tidak ada sihir, dan tidak ada penyakit berjangkit.'  Lalu seorang Arab Badwi bertanya, 'Wahai Rasulullah, bagaimana dengan unta di padang pasir yang kelihatan seperti rusa, tetapi unta yang sakit akan menulari unta yang sihat?'. Rasulullah SAW menjawab, 'Maka siapa yang menjadikan penyakit itu (berjangkit) pada mulanya?'  Hadis ini diriwayatkan oleh al-Bukhari.",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا عَدْوَى وَلَا هَامَةَ وَلَا صفر» . فَقَالَ أَعْرَابِي: يَا رَسُول فَمَا بَالُ الْإِبِلِ تَكُونُ فِي الرَّمْلِ لَكَأَنَّهَا الظباء فيخالها الْبَعِير الأجرب فيجر بِهَا؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «فَمن أعدى الأول» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 33273,
        "hadith_number": "4579",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tidak Ada Penyakit yang Menular dan Tidak Ada Sihir",
        "perawi_melayu": null,
        "english_text": null,
        "malay_translation": "Dan daripadanya (iaitu Nabi SAW), beliau bersabda: \"Tidak ada penyakit yang menular, dan tidak ada sihir, dan tidak ada nujum (ramalan), dan tidak ada penyakit yang disebabkan oleh sebab-sebab seperti itu.\".  Riwayat Imam Muslim.",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا عَدْوَى وَلَا هَامَةَ وَلَا نَوْءَ وَلَا صفر» . رَوَاهُ مُسلم"
      },
      {
        "id": 33274,
        "hadith_number": "4580",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tidak Ada Penyakit Berjangkit (Wabak) dan Tidak Ada Roh Jahat",
        "perawi_melayu": "Jabir",
        "english_text": "Daripada Jabir, katanya: \"Aku mendengar Rasulullah SAW bersabda: 'Tidak ada penyakit berjangkit, tidak ada penyakit kuning (safar), dan tidak ada makhluk halus jahat (ghul).'\". Riwayat Muslim",
        "malay_translation": "Daripada Jabir, katanya: \"Aku mendengar Rasulullah SAW bersabda: 'Tidak ada penyakit berjangkit, tidak ada penyakit kuning (safar), dan tidak ada makhluk halus jahat (ghul).'\".  Hadis ini diriwayatkan oleh Imam Muslim.",
        "arabic_text": "وَعَنْ جَابِرٍ قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا عَدْوَى وَلَا صَفَرَ وَلَا غُولَ» . رَوَاهُ مُسلم"
      },
      {
        "id": 33275,
        "hadith_number": "4581",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perjanjian dan Kembalian Utusan Thaqif",
        "perawi_melayu": "Amru bin al-Syaarid daripada bapanya",
        "english_text": "Dari Amru bin asy-Syaarid daripada bapanya, katanya: Dalam rombongan Thaqif ada seorang yang berpenyakit kusta. Maka Rasulullah SAW menghantar utusan kepadanya: \"Sesungguhnya kami telah berjanji setia dengan engkau, maka kembalilah.\"",
        "malay_translation": "Dari Amru bin al-Syaarid daripada bapanya, katanya: Dalam rombongan Thaqif terdapat seorang lelaki yang menghidap penyakit kusta. Maka, Rasulullah SAW mengutuskan pesanan kepadanya, \"Sesungguhnya kami telah berjanji dengan kamu, maka kembalilah.\"  (Riwayat Muslim)",
        "arabic_text": "وَعَنْ عَمْرِو بْنِ الشَّرِيدِ عَنْ أَبِيهِ قَالَ: كَانَ فِي وَفْدِ ثَقِيفٍ رَجُلٌ مَجْذُومٌ فَأَرْسَلَ إِلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّا قد بايعناك فَارْجِع» . رَوَاهُ مُسلم"
      },
      {
        "id": 33276,
        "hadith_number": "4582",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Berdoa dan Menjauhi Tathayur (Menyiasat Buruk)",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "Daripada Ibnu Abbas r.a., baginda berkata: Rasulullah SAW suka berdoa dengan baik dan tidak percaya dengan tathayur (percaya perkara buruk). Baginda juga menyukai nama-nama yang baik. Riwayat ini terdapat dalam Syarah as-Sunnah.",
        "malay_translation": "Daripada Ibnu Abbas r.a., baginda berkata: Rasulullah SAW suka berdoa dengan baik dan tidak mempercayai perkara buruk atau tathayur. Baginda juga menyukai nama-nama yang baik. Hadis ini terdapat dalam Syarah as-Sunnah.",
        "arabic_text": "عَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَفَاءَلُ وَلَا يَتَطَيَّرُ وَكَانَ يُحِبُّ الِاسْمَ الْحَسَنَ. رَوَاهُ فِي شَرْحِ السّنة"
      },
      {
        "id": 33277,
        "hadith_number": "4583",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ketahuilah, Kepercayaan Takhayul dan Sihir (Jibti) Termasuk Perkara yang Dilarang",
        "perawi_melayu": "Qatthan bin Qabishah daripada bapanya",
        "english_text": "Dari Qatthan bin Qabishah dari bapanya, bahawa Nabi SAW bersabda, \"Perkara yang berkaitan dengan meramal masa hadapan, mengetuk-ngetuk sesuatu dan kepercayaan kepada pertanda buruk adalah dari syaitan/jin (jibti).\" Diriwayatkan oleh Imam Abu Dawud.",
        "malay_translation": "Daripada Qatthan bin Qabishah daripada bapanya, bahawa Nabi SAW bersabda, \"Peramal masa hadapan, mengetuk-ngetuk sesuatu dan kepercayaan kepada pertanda buruk adalah daripada syaitan (jibti).\"  Riwayat Imam Abu Dawud.",
        "arabic_text": "وَعَن قَطن بن قَبيصةَ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْعِيَافَةُ وَالطَّرْقُ وَالطِّيَرَةُ مِنَ الْجِبْتِ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33278,
        "hadith_number": "4584",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tiru-Tiru Adalah Syirik",
        "perawi_melayu": "Abdullah bin Mas'ud",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abdullah bin Mas'ud daripada Rasulullah SAW, baginda bersabda: \"Tiru-tiru adalah syirik.\" Baginda mengulanginya sebanyak tiga kali. Dan tidak ada seorang pun di antara kita melainkan Allah akan menghilangkannya dengan tawakal. Diriwayatkan oleh Imam Abu Dawud dan Imam At-Tirmizi. Dan beliau mendengar Muhammad bin Ismail berkata: Sulaiman bin Harb berkata dalam hadis ini: \"Dan tidak ada seorang pun di antara kita melainkan Allah akan menghilangkannya dengan tawakal.\" Ini adalah menurut pendapat Ibn Mas'ud.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الطِّيَرَةُ شِرْكٌ» قَالَهُ ثَلَاثًا وَمَا مِنَّا إِلَّا وَلَكِنَّ اللَّهَ يُذْهِبُهُ بِالتَّوَكُّلِ. رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَقَالَ: سَمِعْتُ مُحَمَّدَ بْنَ إِسْمَاعِيلَ يَقُولُ: كَانَ سُلَيْمَانُ بْنُ حَرْبٍ يَقُولُ فِي هَذَا الْحَدِيثِ: «وَمَا مِنَّا إِلَّا وَلَكِنَّ اللَّهَ يُذْهِبُهُ بِالتَّوَكُّلِ» . هَذَا عِنْدِي قَوْلُ ابْنِ مَسْعُودٍ"
      },
      {
        "id": 33279,
        "hadith_number": "4585",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menggandeng Orang Kusta dan Nasihat Keyakinan Kepada Allah",
        "perawi_melayu": null,
        "english_text": "Jabir meriwayatkan bahawa Rasulullah SAW memegang tangan seorang yang kusta, lalu meletakkannya bersamanya di dalam bekas makanan, sambil bersabda, \"Makanlah dengan penuh keyakinan kepada Allah dan berserah diri kepada-Nya.\"",
        "malay_translation": "Daripada Jabir, bahawa Rasulullah SAW memegang tangan seorang yang kusta, lalu meletakkannya bersama beliau di dalam bekas makanan, dan baginda bersabda: \"Makanlah dengan penuh keyakinan kepada Allah dan bertawakal kepada-Nya.\"  Riwayat Imam Ibn Majah",
        "arabic_text": "وَعَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَ بِيَدِ مَجْذُومٍ فَوَضَعَهَا مَعَهُ فِي الْقَصْعَةِ وَقَالَ: «كُلْ ثِقَةً بِاللَّهِ وَتَوَكُّلًا عَلَيْهِ» . رَوَاهُ ابْن مَاجَه"
      },
      {
        "id": 33280,
        "hadith_number": "4586",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Sesuatu yang Tidak Berdasar dan Takhayul",
        "perawi_melayu": "Sa'ad bin Malik",
        "english_text": "Daripada Sa'ad bin Malik, bahawa Rasulullah SAW bersabda: \"Tidak ada penyakit yang menular, dan tidak ada penyakit yang menular secara gaib. Dan tidak ada pun pertimbangan terhadap nasib. Dan sekiranya ada pertimbangan, ia hanya mengenai rumah, kuda, dan wanita.\"",
        "malay_translation": "Daripada Sa'ad bin Malik, bahawa Rasulullah SAW bersabda: \"Tidak ada penyakit yang menular, dan tidak ada penyakit yang menular secara gaib. Dan tidak ada pertimbangan terhadap nasib. Dan sekiranya terdapat pertimbangan terhadap nasib, ia hanya mengenai rumah, kuda, dan wanita.\"  Hadis ini diriwayatkan oleh Imam Abu Daud.",
        "arabic_text": "وَعَن سعدِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا هَامَةَ وَلَا عَدْوَى وَلَا طِيَرَةَ وَإِنْ تَكُنِ الطِّيَرَةُ فِي شَيْءٍ فَفِي الدَّارِ وَالْفرس وَالْمَرْأَة» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33281,
        "hadith_number": "4587",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kegemaran Nabi SAW Mendengar Seruan 'Ya Rashid' dan 'Ya Najih' Ketika Berjalan",
        "perawi_melayu": null,
        "english_text": "Dari Anas bahawa Nabi SAW gemar mendengar ucapan, 'Ya Rashid' dan 'Ya Najih' apabila keluar untuk keperluan.",
        "malay_translation": "Daripada Anas bahawa Nabi SAW gemar mendengar panggilan, 'Ya Rashid' dan 'Ya Najih' apabila keluar untuk sesuatu keperluan.",
        "arabic_text": "وَعَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُعْجِبُهُ إِذَا خَرَجَ لِحَاجَةٍ أَنْ يَسْمَعَ: يَا رَاشِدُ يَا نَجِيحُ. رَوَاهُ التِّرْمِذِيُّ"
      },
      {
        "id": 33282,
        "hadith_number": "4588",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kegembiraan dan Ketidaksukaan Nabi SAW terhadap Nama-Nama dan Tempat",
        "perawi_melayu": "Buraydah",
        "english_text": "And it was narrated from Buraydah: that the Prophet SAW did not believe in omens.  When he sent an official, he would inquire about his name. If he liked the name, he would be pleased and joy would be seen on his face. If he disliked the name, dislike would be seen on his face. And when he entered a village, he would inquire about its name. If he liked the name, he would be pleased, and happiness would be apparent on his face. If he disliked the name, dislike would be apparent on his face.",
        "malay_translation": "Dan diriwayatkan daripada Buraydah bahawa Nabi SAW tidak mempercayai pertanda buruk. Apabila baginda menghantar seorang pegawai, baginda akan bertanya tentang namanya. Jika baginda menyukai namanya, baginda akan gembira dan kegembiraan akan kelihatan di wajah baginda. Jika baginda tidak menyukai namanya, ketidaksukaan akan kelihatan di wajah baginda. Dan apabila baginda memasuki sebuah kampung, baginda akan bertanya tentang namanya. Jika baginda menyukai namanya, baginda akan gembira, dan kegembiraan akan kelihatan di wajah baginda. Jika baginda tidak menyukai namanya, ketidaksukaan akan kelihatan di wajah baginda.",
        "arabic_text": "وَعَنْ بُرَيْدَةَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَتَطَيَّرُ مِنْ شَيْءٍ فَإِذَا بَعَثَ عَامِلًا سَأَلَ عَنِ اسْمِهِ فَإِذَا أَعْجَبَهُ اسْمه فَرح بِهِ ورئي بشر ذَلِك على وَجْهِهِ وَإِنْ كَرِهَ اسْمَهُ رُئِيَ كَرَاهِيَةُ ذَلِكَ على وَجْهِهِ وَإِذَا دَخَلَ قَرْيَةً سَأَلَ عَنِ اسْمِهَا فَإِنْ أَعْجَبَهُ اسْمُهَا فَرِحَ بِهِ وَرُئِيَ بِشْرُ ذَلِكَ فِي وَجْهِهِ وَإِنْ كَرِهَ اسْمَهَا رُئِيَ كَرَاهِيَة ذَلِك فِي وَجهه. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33283,
        "hadith_number": "4589",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kehidupan dan Peralihan dari Satu Tempat ke Tempat Lain dalam Kehidupan",
        "perawi_melayu": null,
        "english_text": "And from Anas, he said: A man said, \"O Messenger of Allah, indeed we were in a land where our numbers and wealth increased, then we moved to a land where our numbers and wealth decreased. The Messenger of Allah, peace and blessings be upon him, said:  'Leave them alone, they are a curse.'  Narrated by Abu Dawud",
        "malay_translation": "Dan daripada Anas, dia berkata: Seorang lelaki berkata, \"Wahai Rasulullah, sesungguhnya kami pernah tinggal di satu negeri di mana jumlah dan harta benda kami bertambah banyak, kemudian kami berpindah ke satu negeri di mana jumlah dan harta benda kami berkurang. Rasulullah SAW bersabda: 'Biarkanlah mereka, mereka adalah bala'. Diriwayatkan oleh Abu Dawud.",
        "arabic_text": "وَعَن أنس قَالَ: قَالَ رَجُلٌ: يَا رَسُولَ اللَّهِ إِنَّا كُنَّا فِي دَارٍ كَثُرَ فِيهَا عَدَدُنَا وَأَمْوَالُنَا فَتَحَوَّلْنَا إِلَى دَارٍ قَلَّ فِيهَا عَدَدُنَا وَأَمْوَالُنَا. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «ذروها ذميمة» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33284,
        "hadith_number": "4590",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mengabaikan Penyakit Berjangkit di Sebuah Kawasan",
        "perawi_melayu": "Yahya bin Abdullah bin Bahir",
        "english_text": "Dari Yahya bin Abdullah bin Bahir, katanya: Seseorang yang mendengar Furoh bin Musa berkata: \"Aku berkata: Wahai Rasulullah, kami mempunyai sebuah kawasan yang dikenali sebagai Abiyan, yang merupakan kawasan kampung dan pemerintahan kami. Penyakit berjangkitnya sangat teruk. Baginda bersabda: \"Biarkan sahaja, kerana antara tanda-tanda kebinasaan adalah penyakit berjangkit.\"",
        "malay_translation": "Dari Yahya bin Abdullah bin Bahir, beliau berkata: Seseorang yang mendengar perkataan Furoh bin Musa, berkata, \"Aku bertanya kepada Rasulullah, 'Wahai Rasulullah, di antara kami terdapat suatu kawasan yang dinamakan Abiyan, ia adalah wilayah desa dan wilayah pentadbiran kami. Dan wabak penyakit di situ amat teruk.' Baginda SAW bersabda, 'Biarkanlah ia (kawasan itu). Kerana di antara tanda-tanda kemusnahan adalah wabak penyakit.'  (Hadis ini diriwayatkan oleh Imam Abu Dawud).",
        "arabic_text": "وَعَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ بَحِيرٍ قَالَ: أَخْبَرَنِي مَنْ سَمِعَ فَرْوَةَ بْنَ مُسَيْكٍ يَقُولُ: قُلْتُ: يَا رَسُولَ اللَّهِ عِنْدَنَا أَرْضٌ يُقَالُ لَهَا أَبْيَنُ وَهِيَ أَرْضُ رِيفِنَا وَمِيرَتِنَا وَإِنَّ وَبَاءَهَا شَدِيدٌ. فَقَالَ: «دَعْهَا عَنْكَ فَإِنَّ من القَرَف التّلف» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33285,
        "hadith_number": "4591",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keistimewaan Pendapat Baik dan Perlindungan Daripada Nasib Buruk",
        "perawi_melayu": "Urwah bin 'Amir",
        "english_text": "Daripada Urwah bin 'Amir, beliau berkata: Perkara tiyarah (nasib buruk) dibincangkan di hadapan Rasulullah SAW. Baginda bersabda: Yang terbaik darinya ialah pendapat yang baik dan janganlah menghalang seorang Muslim. Oleh itu, jika salah seorang daripada kamu melihat sesuatu yang tidak disenangi, maka hendaklah dia mengucapkan: Ya Allah, tiada yang membawa kebaikan melainkan Engkau dan tiada yang menolak keburukan melainkan Engkau, dan tiada daya dan upaya melainkan dengan Allah. Diriwayatkan oleh Imam Abu Daud.",
        "malay_translation": "Daripada Urwah bin 'Amir, beliau berkata, “Perkara tiyarah (tanda-tanda nasib buruk) dibincangkan di hadapan Rasulullah SAW. Baginda bersabda, “Yang terbaik di antaranya ialah firasat yang baik. Dan janganlah menghalang orang Islam. Jika salah seorang daripada kamu melihat sesuatu yang tidak disukai, hendaklah dia berdoa: Ya Allah, tiada yang mendatangkan kebaikan kecuali Engkau, dan tiada yang menghalau keburukan kecuali Engkau. Tiada daya dan upaya melainkan dengan pertolongan Allah.” Diriwayatkan oleh Imam Abu Daud.",
        "arabic_text": "عَن عُرْوَة بن عَامر قَالَ: ذُكِرَتِ الطِّيَرَةُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: أَحْسَنُهَا الْفَأْلُ وَلَا تَرُدُّ مُسْلِمًا فَإِذَا رَأَى أَحَدُكُمْ مَا يَكْرَهُ فَلْيَقُلْ: اللَّهُمَّ لَا يَأْتِي بِالْحَسَنَاتِ إِلَّا أَنْتَ وَلَا يَدْفَعُ السَّيِّئَاتِ إِلَّا أَنْتَ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ . رَوَاهُ أَبُو دَاوُدَ"
      },
      {
        "id": 33286,
        "hadith_number": "4592",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mengikuti Kepercayaan Jahiliah dan Tatacara yang Bertentangan dengan Islam",
        "perawi_melayu": "Mu'awiyah bin al-Hakam",
        "english_text": "From Mu'awiyah bin al-Hakam, he said: I said, \"O Messenger of Allah, we used to do certain things in the Jahiliyyah (pre-Islamic period), such as consulting soothsayers.\"  He said, \"Do not consult soothsayers.\" I said, \"We also used to practice divination.\" He said, \"That is something that one of you might feel within themselves, so do not let it hinder you.\" I said, \"And among us are men who practice handwriting.\" He said, \"There was a prophet among the prophets who practiced handwriting. Whoever agrees with his handwriting, that is it.\"  Narrated by Muslim",
        "malay_translation": "Daripada Mu'awiyah bin al-Hakam, dia berkata: Aku berkata, \"Wahai Rasulullah, kami pernah melakukan perkara-perkara tertentu pada zaman Jahiliyyah, seperti meramal nasib dengan peramal.\" Baginda bersabda, \"Janganlah kamu beramal dengan peramal.\" Aku berkata, \"Kami juga pernah melakukan ramalan dengan tanda-tanda tertentu.\" Baginda bersabda, \"Itu adalah sesuatu yang mungkin dirasakan oleh seseorang di dalam dirinya, oleh itu jangan biarkan ia menghalang kamu.\" Aku berkata, \"Dan di antara kita ada lelaki yang menulis nasib.\" Baginda bersabda, \"Ada seorang nabi di antara para nabi yang menulis nasib. Siapa yang bersetuju dengan tulisan nasibnya, itulah nasibnya.\" Diriwayatkan oleh Muslim",
        "arabic_text": "عَن مُعَاوِيَة بن الحكم قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ أُمُورًا كُنَّا نَصْنَعُهَا فِي الْجَاهِلِيَّةِ كُنَّا نَأْتِي الْكُهَّانَ قَالَ: «فَلَا تَأْتُوا الْكُهَّانَ» قَالَ: قُلْتُ: كُنَّا نَتَطَيَّرُ قَالَ: «ذَلِكَ شَيْءٌ يَجِدُهُ أَحَدُكُمْ فِي نَفْسِهِ فَلَا يصدَّنَّكم» . قَالَ: قُلْتُ: وَمِنَّا رِجَالٌ يَخُطُّونَ قَالَ: «كَانَ نَبِيٌّ مِنَ الْأَنْبِيَاءِ يَخُطُّ فَمَنْ وَافَقَ خَطَّهُ فَذَاك» . رَوَاهُ مُسلم"
      },
      {
        "id": 33287,
        "hadith_number": "4593",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mendengar Perkataan Ahli Sihir",
        "perawi_melayu": "Aisyah رضي الله عنها",
        "english_text": "Not Available",
        "malay_translation": "Daripada Aisyah رضي الله عنها, beliau berkata: \"Ada beberapa orang bertanya kepada Rasulullah صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ tentang ahli sihir. Rasulullah صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ menjawab mereka: \"Sesungguhnya mereka itu tidak ada apa-apanya.\" Mereka berkata: \"Wahai Rasulullah, kadang-kadang mereka menceritakan sesuatu yang benar.\" Rasulullah صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ bersabda: \"Sesungguhnya perkataan benar itu diambil oleh jin, lalu disampaikan kepada pemiliknya seperti ayam mendengar suara induknya. Kemudian mereka campur adukkan dengan lebih dari seratus dusta di dalamnya.\"",
        "arabic_text": "وَعَن عَائِشَة قَالَتْ: سَأَلَ أُنَاسٌ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْكُهَّانِ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّهُمْ لَيْسُوا بِشَيْءٍ» قَالُوا: يَا رَسُولَ اللَّهِ فَإِنَّهُمْ يُحَدِّثُونَ أَحْيَانًا بِالشَّيْءِ يَكُونُ حَقًّا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تِلْكَ الْكَلِمَةُ مِنَ الْحَقِّ يَخْطَفُهَا الْجِنِّيُّ فَيَقُرُّهَا فِي أُذُنِ وَلَيِّهِ قَرَّ الدَّجَاجَةِ فَيَخْلِطُونَ فِيهَا أَكْثَرَ مِنْ مِائَةِ كذبة»"
      },
      {
        "id": 33288,
        "hadith_number": "4594",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Malaikat Turun dari Awan dan Penipuan Syaitan",
        "perawi_melayu": null,
        "english_text": null,
        "malay_translation": "Dan daripada beliau, dia berkata: Aku mendengar Rasulullah SAW bersabda, \"Sesungguhnya para malaikat turun di awan, iaitu awan yang berarak di angkasa, dan mereka menyebut perkara yang telah diputuskan di langit. Maka syaitan-syaitan menceroboh mendengarnya dan lalu diwahyukan kepada tukang tenung. Mereka (tukang tenung) berdusta dengannya dengan seratus dusta dari diri mereka sendiri.\"  Riwayat Bukhari.",
        "arabic_text": "وَعَنْهَا قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: إِنَّ الْمَلَائِكَةَ تَنْزِلُ فِي الْعَنَانِ وَهُوَ السَّحَابُ فَتَذْكُرُ الْأَمْرَ قُضِيَ فِي السَّماءِ فتسترق الشياطينُ السمعَ فَتُوحِيهِ إِلَى الْكُهَّانِ فَيَكْذِبُونَ مَعَهَا مِائَةَ كَذْبَةٍ من عِنْد أنفسهم. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 33289,
        "hadith_number": "4595",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Bertanya kepada Peramal dan Kesannya Terhadap Solat",
        "perawi_melayu": "Hafsah",
        "english_text": "And from Hafsah, she said: The Messenger of Allah, peace and blessings be upon him, said, \"Whoever goes to a fortune-teller and asks him about something, his prayer will not be accepted for forty nights.\". It was narrated by Muslim.",
        "malay_translation": "Dan daripada Hafsah, dia berkata: Rasulullah SAW bersabda, \"Barangsiapa yang pergi kepada peramal dan bertanya sesuatu kepadanya, solatnya tidak akan diterima selama empat puluh malam.\"  Hadis ini diriwayatkan oleh Imam Muslim.",
        "arabic_text": "وَعَنْ حَفْصَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَتَى عَرَّافًا فَسَأَلَهُ عَنْ شَيْءٍ لم تقبل صَلَاة أَرْبَعِينَ لَيْلَة» . رَوَاهُ مُسلم"
      },
      {
        "id": 33290,
        "hadith_number": "4596",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Berkata Hujan Turun Kerana Allah atau Kerana Bintang",
        "perawi_melayu": "Zaid bin Khalid al-Juhani",
        "english_text": "Not Available",
        "malay_translation": "Daripada Zaid bin Khalid al-Juhani RA, beliau berkata: Rasulullah SAW solat Subuh bersama kami di Hudaibiyah selepas hujan yang turun pada malamnya. Apabila selesai solat, baginda menghadap orang ramai dan bersabda: “Tahukah kamu apa yang telah difirmankan oleh Tuhan kamu?” Mereka menjawab: “Allah dan Rasul-Nya lebih mengetahui.” Baginda bersabda: “Pada pagi ini, ada di antara hamba-Ku yang beriman kepada-Ku dan ada yang kafir. Adapun orang yang berkata: ‘Kita diberi hujan kerana kurniaan dan rahmat Allah,’ maka dia beriman kepada-Ku dan kafir kepada bintang. Dan adapun orang yang berkata: ‘Kita diberi hujan kerana bintang ini dan itu,’ maka dia kafir kepada-Ku dan beriman kepada bintang.”",
        "arabic_text": "وَعَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ قَالَ: صَلَّى لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الصُّبْحِ بِالْحُدَيْبِيَةِ عَلَى أَثَرِ سَمَاءٍ كَانَتْ مِنَ اللَّيْلِ فَلَمَّا انْصَرَفَ أَقْبَلَ عَلَى النَّاسِ فَقَالَ: «هَلْ تَدْرُونَ مَاذَا قَالَ ربُّكم؟» قَالُوا: الله وَرَسُوله أعلم قَالَ: أَصْبَحَ مِنْ عِبَادِي مُؤْمِنٌ بِي وَكَافِرٌ فَأَمَّا مَنْ قَالَ: مُطِرْنَا بِفَضْلِ اللَّهِ وَرَحْمَتِهِ فَذَلِكَ مُؤْمِنٌ بِي كَافِرٌ بِالْكَوْكَبِ وَأَمَّا مَنْ قَالَ: مُطِرْنَا بِنَوْءِ كَذَا وَكَذَا فَذَلِكَ كَافِرٌ بِي وَمُؤمن بالكوكب"
      },
      {
        "id": 33291,
        "hadith_number": "4597",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Turunnya Berkah dari Langit dan Kekafiran Sesetengah Orang",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "From Abu Hurairah, from the Messenger of Allah (peace be upon him), he said: \"No blessing is sent down from the heavens, except that a group of people become disbelievers because of it. Allah sends rain, and they say: 'By such and such a star.' Narrated by Muslim\"",
        "malay_translation": "Daripada Abu Hurairah, daripada Rasulullah SAW, baginda bersabda: \"Tidaklah suatu keberkatan diturunkan dari langit melainkan segolongan manusia menjadi kafir disebabkan olehnya. Allah menurunkan hujan, lalu mereka berkata: 'Demi bintang sebegini dan sebegitu.' Diriwayatkan oleh Imam Muslim.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: مَا أَنْزَلَ اللَّهُ مِنَ السَّمَاءِ مِنْ بَرَكَةٍ إِلَّا أَصْبَحَ فَرِيقٌ مِنَ النَّاسِ بِهَا كَافِرِينَ يُنْزِلُ اللَّهُ الْغَيْثَ فَيَقُولُونَ: بِكَوْكَبِ كَذَا وَكَذَا . رَوَاهُ مُسلم"
      },
      {
        "id": 33292,
        "hadith_number": "4598",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mengambil Ilmu dari Bintang Sama Dengan Sihir",
        "perawi_melayu": "Ibnu Abbas",
        "english_text": "Daripada Ibnu Abbas, beliau berkata: Rasulullah SAW bersabda: \"Barangsiapa yang mengambil ilmu dari bintang, maka ia telah mengambil sebahagian dari sihir, dan ia semakin bertambah (dosanya) jika ia semakin menambah ilmu itu.\"",
        "malay_translation": "Daripada Ibnu Abbas, beliau berkata: Rasulullah SAW bersabda, \"Barangsiapa yang mengambil ilmu daripada bintang, maka sesungguhnya ia telah mengambil satu cabang daripada sihir. Dan dosanya akan bertambah jika ia terus menambah ilmu itu.\"  Riwayat Imam Ahmad, Abu Daud dan Ibn Majah.",
        "arabic_text": "عَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اقْتَبَسَ عِلْمًا مِنَ النُّجُومِ اقْتَبَسَ شُعْبَةً مِنَ السِّحْرِ زَادَ مَا زَادَ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَابْنُ مَاجَه"
      },
      {
        "id": 33293,
        "hadith_number": "4599",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mengikuti Peramal dan Melakukan Perbuatan Tercela",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "And from Abu Hurairah, he said: The Messenger of Allah, may Allah bless him and grant him peace, said: \"Whoever goes to a fortune-teller and believes what he says, or goes to his wife while she is menstruating, or goes to his wife from behind, then he has distanced himself from what was revealed upon Muhammad.\" Ahmad and Abu Dawud narrated it.",
        "malay_translation": "Dan daripada Abu Hurairah, beliau berkata: Rasulullah SAW bersabda, \"Barangsiapa yang pergi kepada peramal dan mempercayai apa yang dikatakannya, atau pergi kepada isterinya ketika dia sedang haid, atau melakukan persetubuhan dengan isterinya dari belakang, maka sesungguhnya dia telah berlepas diri daripada apa yang diturunkan kepada Muhammad.\"  Hadis ini diriwayatkan oleh Imam Ahmad dan Imam Abu Dawud.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَتَى كَاهِنًا فَصَدَّقَهُ بِمَا يَقُولُ أَوْ أَتَى امْرَأَتَهُ حَائِضًا أَو أَتَى امْرَأَته من دُبُرِهَا فَقَدْ بَرِئَ مِمَّا أُنْزِلَ عَلَى مُحَمَّدٍ» . رَوَاهُ أَحْمد وَأَبُو دَاوُد"
      },
      {
        "id": 33294,
        "hadith_number": "4600",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tindakan Malaikat dan Penghantaran Firman Allah dari Langit",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah, bahawa Rasulullah SAW bersabda: \"Apabila Allah SWT menetapkan sesuatu perkara di langit, malaikat-malaikat akan menjentikkan sayap mereka sebagai tanda tunduk kepada firman-Nya, seolah-olah seperti rantai pada seutas tali. Apabila rasa takut itu hilang dari hati mereka, mereka bertanya, \"Apakah yang telah difirmankan oleh Tuhan kamu?\" Mereka menjawab, \"Kepada Yang Maha Benar dan Maha Tinggi.\" Kemudian, ia didengar oleh mereka yang ingin mendengar. (Dan cara pendengaran itu) sebahagiannya di atas sebahagiannya. \"Dan Sufiyan menggambarkannya dengan tangannya, lalu menukar posisinya dan membentangkan jari-jarinya,\"  seolah-olah seperti perantaraan satu sama lain, sehingga satu ucapan diteruskan sehingga ia sampai di bibir seorang ahli sihir atau peramal. Mungkin kilat mencapainya sebelum ia disampaikan, atau mungkin ia disampaikan sebelum kilat mencapainya. Lalu, ia dicampur dengan 100 dusta, sehingga seseorang akan berkata, 'Bukankah Dia (sihir) berkata kepada kami pada hari itu begini dan begitu?' maka ia akan bercakap tentang ucapan yang didengar dari langit tersebut. Riwayat Bukhari.",
        "arabic_text": "عَن أبي هُرَيْرَة أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِذَا قَضَى اللَّهُ الْأَمْرَ فِي السَّمَاءِ ضَرَبَتِ الْمَلَائِكَةُ بِأَجْنِحَتِهَا خُضْعَانًا لِقَوْلِهِ كَأَنَّهُ سِلْسِلَةٌ عَلَى صَفْوَانٍ فَإِذَا فُزِّعَ عَنْ قُلُوبِهِمْ قَالُوا: مَاذَا قَالَ رَبُّكُمْ؟ قَالُوا: لِلَّذِي قَالَ الْحَقَّ وهوَ العليُّ الكبيرُ فَسَمعَهَا مُسترِقوا السَّمعِ ومُسترقوا السَّمْعِ هَكَذَا بَعْضُهُ فَوْقَ بَعْضٍ «وَوَصَفَ سُفْيَانُ بِكَفِّهِ فَحَرَّفَهَا وَبَدَّدَ بَيْنَ أَصَابِعِهِ» فَيَسْمَعُ الْكَلِمَةَ فَيُلْقِيهَا إِلَى مَنْ تَحْتَهُ ثُمَّ يُلْقِيهَا الْآخَرُ إِلَى مَنْ تَحْتَهُ حَتَّى يُلْقِيَهَا عَلَى لِسَانِ السَّاحِرِ أَوِ الْكَاهِنِ. فَرُبَّمَا أَدْرَكَ الشِّهَابُ قَبْلَ أَنْ يُلْقِيَهَا وَرُبَّمَا أَلْقَاهَا قَبْلَ أَنْ يُدْرِكَهُ فكذب مَعَهَا مِائَةَ كَذْبَةٍ فَيُقَالُ: أَلَيْسَ قَدْ قَالَ لَنَا يَوْمَ كَذَا وَكَذَا: كَذَا وَكَذَا؟ فَيَصْدُقُ بِتِلْكَ الْكَلِمَةِ الَّتِي سُمِعَتْ مِنَ السَّمَاءِ . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 33295,
        "hadith_number": "4601",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penjelasan Tentang Penciptaan dan Peristiwa yang Terjadi di Langit",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibn Abbas r.a., beliau berkata:  Seseorang dari kalangan sahabat Nabi SAW daripada golongan Ansar memberitahuku bahawa mereka sedang duduk bersama Rasulullah SAW suatu malam. Tiba-tiba, satu bintang jatuh dan menerangi langit.  Rasulullah SAW bertanya kepada mereka, \"Apakah yang kamu katakan pada zaman Jahiliyyah apabila terjadi peristiwa seperti ini?\" Mereka menjawab, \"Allah dan Rasul-Nya lebih mengetahui. Kami pada masa itu berkata, 'Pada malam ini seorang lelaki agung dilahirkan atau seorang lelaki agung telah meninggal dunia.'\"  Rasulullah SAW bersabda, \"Sesungguhnya kejadian seperti itu bukanlah kerana kematian atau kelahiran seseorang. Tetapi apabila Allah SWT telah menetapkan sesuatu perkara, malaikat-malaikat yang menjaga Arasy akan bertasbih, kemudian malaikat-malaikat di langit yang lebih rendah akan turut bertasbih, sehingga bertasbih sampai kepada penghuni langit dunia ini.  Kemudian, mereka yang berada di bawah Arasy bertanya kepada malaikat yang menjaga Arasy, 'Apa yang dikatakan oleh Tuhan kamu?' Mereka akan memberitahu perkara yang dikatakan oleh Allah SWT.  Kemudian, malaikat di langit yang lain akan bertanya-tanya antara satu sama lain sehingga berita itu sampai ke langit dunia ini.  Maka jin-jin akan mendengar dengan baik dan menghembuskan berita itu kepada para pemimpin mereka. Dan ia dibawa dengan cara yang sempurna, akan tetapi mereka akan menambahkan dan mengurangkannya.\"  Riwayat Imam Muslim.",
        "arabic_text": "وَعَن ابنِ عبَّاسٍ قَالَ: أَخْبَرَنِي رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنَ الْأَنْصَارِ: أَنَّهُمْ بَيْنَا جُلُوسٌ لَيْلَةً مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رُمِيَ بِنَجْمٍ وَاسْتَنَارَ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا كُنْتُمْ تَقُولُونَ فِي الْجَاهِلِيَّةِ إِذَا رُمِيَ بِمِثْلِ هَذَا؟» قَالُوا: اللَّهُ وَرَسُولُهُ أَعْلَمُ كُنَّا نَقُولُ: وُلِدَ اللَّيْلَةَ رَجُلٌ عَظِيمٌ وَمَاتَ رَجُلٌ عَظِيمٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: فَإِنَّهَا لَا يُرْمَى بِهَا لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ وَلَكِنَّ رَبَّنَا تَبَارَكَ اسْمُهُ إِذَا قَضَى أَمر سَبَّحَ حَمَلَةُ الْعَرْشِ ثُمَّ سَبَّحَ أَهْلُ السَّمَاءِ الَّذِينَ يَلُونَهُمْ حَتَّى يَبْلُغَ التَّسْبِيحُ أَهْلَ هَذِهِ السَّمَاء الدُّنْيَا ثمَّ قَالَ الَّذِي يَلُونَ حَمَلَةَ الْعَرْشِ لِحَمَلَةِ الْعَرْشِ: مَاذَا قَالَ رَبُّكُمْ؟ فَيُخْبِرُونَهُمْ مَا قَالَ: فَيَسْتَخْبِرُ بَعْضُ أَهْلِ السَّمَاوَاتِ بَعْضًا حَتَّى يَبْلُغَ هَذِهِ السَّمَاءَ الدُّنْيَا فَيَخْطَفُ الْجِنُّ السَّمْعَ فَيَقْذِفُونَ إِلَى أَوْلِيَائِهِمْ وَيُرْمَوْنَ فَمَا جاؤوا بِهِ عَلَى وَجْهِهِ فَهُوَ حَقٌّ وَلَكِنَّهُمْ يَقْرِفُونَ فِيهِ وَيزِيدُونَ . رَوَاهُ مُسلم"
      },
      {
        "id": 33296,
        "hadith_number": "4602",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hikmah Penciptaan Bintang-Bintang dan Penjelasannya",
        "perawi_melayu": null,
        "english_text": "And from Qatadah, he said: Allah, exalted is He, created these stars for three purposes: to adorn the sky, to drive away the shaitans, and as signs to be guided by. Whoever interprets them other than that has erred and lost his share and burdened himself with what he does not know. It is narrated by al-Bukhari in a commentary, and in the narration of Razin: \"He burdens himself with what does not concern him, and what he has no knowledge of. The prophets and angels did not know that.\"",
        "malay_translation": "Dan daripada Qatadah, beliau berkata: Allah Taala menciptakan bintang-bintang ini untuk tiga tujuan: untuk menghiasi langit, untuk menghalau syaitan, dan sebagai petunjuk.  Barangsiapa mentafsirkannya selain daripada itu, maka sesungguhnya dia telah tersesat dan kehilangan bahagiannya serta membebani dirinya dengan perkara yang tidak diketahuinya. Diriwayatkan oleh al-Bukhari sebagai ulasan, dan dalam riwayat Razin: \"Dia membebani dirinya dengan perkara yang tidak berkaitan dengannya, dan perkara yang tiada ilmunya. Para nabi dan malaikat pun tidak mengetahui perkara itu.\"",
        "arabic_text": "وَعَن قتادةَ قَالَ: خلقَ اللَّهُ تَعَالَى هَذِه النجومَ لثلاثٍ جَعَلَهَا زِينَةً لِلسَّمَاءِ وَرُجُومًا لِلشَّيَاطِينِ وَعَلَامَاتٍ يُهْتَدَى بهَا فَمن تأوَّلَ فِيهَا بِغَيْرِ ذَلِكَ أَخَطَأَ وَأَضَاعَ نَصِيبَهُ وَتَكَلَّفَ مَالا يَعْلَمُ. رَوَاهُ الْبُخَارِيُّ تَعْلِيقًا وَفِي رِوَايَةِ رَزِينٍ: «تكلّف مَالا يعنيه ومالا عِلْمَ لَهُ بِهِ وَمَا عَجَزَ عَنْ عِلْمِهِ الْأَنْبِيَاء وَالْمَلَائِكَة»"
      },
      {
        "id": 33297,
        "hadith_number": "4603",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penjelasan tentang Tidak Berkaitannya Bintang dengan Kehidupan Manusia",
        "perawi_melayu": "Rabi' (atau nama lengkapnya, jika ada)",
        "english_text": "And from Rabi' is similar (hadith), and he added: By Allah, Allah has not placed in a star the life of anyone, nor their sustenance, nor their death.  Indeed, they fabricate lies upon Allah and seek refuge in the stars.",
        "malay_translation": "Dan daripada Rabi' terdapat hadis yang serupa, dan beliau menambah: Demi Allah, Allah tidak meletakkan dalam satu bintang pun kehidupan seseorang, rezekinya, mahupun kematiannya. Sesungguhnya mereka mengada-adakan dusta terhadap Allah dan bergantung kepada bintang-bintang.",
        "arabic_text": "وَعَن الربيعِ مِثْلُهُ وَزَادَ: وَاللَّهِ مَا جَعَلَ اللَّهُ فِي نَجْمٍ حَيَاةَ أَحَدٍ وَلَا رِزْقَهُ وَلَا مَوْتَهُ وَإِنَّمَا يَفْتَرُونَ عَلَى اللَّهِ الْكَذِبَ وَيَتَعَلَّلُونَ بِالنُّجُومِ"
      },
      {
        "id": 33298,
        "hadith_number": "4604",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mengkaji Ilmu Perbintangan Selain dari Yang Ditetapkan Allah",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "Daripada Ibnu Abbas RA, beliau berkata: Rasulullah SAW bersabda: \"Barangsiapa yang mempelajari sebahagian ilmu perbintangan melainkan apa yang telah disebutkan Allah, maka sesungguhnya dia telah mengambil satu bahagian sihir. Ahli nujum itu adalah seorang tukang sihir, dan tukang sihir itu adalah orang kafir.\"",
        "malay_translation": "Daripada Ibnu Abbas R.A., beliau berkata: Rasulullah SAW bersabda, “Barangsiapa yang mempelajari ilmu perbintangan melainkan apa yang telah disebut Allah, maka sesungguhnya dia telah mengambil satu cabang sihir. Ahli nujum adalah tukang sihir, dan tukang sihir adalah kafir.”",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اقْتَبَسَ بَابًا مِنْ عِلْمِ النُّجُومِ لِغَيْرِ مَا ذَكَرَ اللَّهُ فَقَدِ اقْتَبَسَ شُعْبَةً مِنَ السِّحْرِ الْمُنَجِّمُ كَاهِنٌ والكاهنُ ساحرٌ والساحرُ كافرٌ» . رَوَاهُ رزين"
      },
      {
        "id": 33299,
        "hadith_number": "4605",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Jika Allah menahan hujan dari hamba-Nya selama lima tahun, kemudian diutus, nescaya segolongan manusia akan menjadi kafir dan berkata: Kami telah disiram dengan air hujan kerana daya tarikan.",
        "perawi_melayu": "Abu Said al-Khudri",
        "english_text": "And from Abu Sa'id al-Khudri he said: The Messenger of Allah, peace and blessings be upon him, said: If Allah withheld rain from His servants for five years, then sent it, a group of people would become disbelievers, saying, 'We were watered by the attraction of the well.' Narrated by al-Nasa'i",
        "malay_translation": "Daripada Abu Sa'id al-Khudri, beliau berkata: Rasulullah SAW bersabda: Sekiranya Allah menahan hujan daripada hamba-Nya selama lima tahun, kemudian menghantarnya, nescaya segolongan manusia akan menjadi kafir dan berkata: Kami telah disiram dengan hujan kerana daya tarikan telaga.  Riwayat al-Nasa'i",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَوْ أَمْسَكَ اللَّهُ الْقَطْرَ عَنْ عِبَادِهِ خَمْسَ سِنِينَ ثُمَّ أَرْسَلَهُ لَأَصْبَحَتْ طَائِفَةٌ مِنَ النَّاسِ كَافِرِينَ يَقُولُونَ: سُقِينَا بِنَوْءِ الْمِجْدَحِ . رَوَاهُ النَّسَائِيّ"
      }
    ]
  }
}