{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 38,
    "data": [
      {
        "id": 31735,
        "hadith_number": "3041",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tanggungjawab Nabi terhadap Ummat",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "From Abu Hurairah from the Prophet (peace and blessings of Allaah be upon him), who said: “I am closer to the believers than they are to themselves. So whoever dies and leaves a debt and does not leave enough to pay it off, then I will pay it off. And whoever leaves wealth, then it is for his heirs.” In one narration: “Whoever leaves a debt or a loss, let him come to me, for I am his patron.” In another narration: “Whoever leaves wealth, then it is for his heirs, and whoever leaves nothing, then it is to us.”",
        "malay_translation": "Dari Abu Hurairah daripada Nabi SAW, baginda bersabda:  “Aku lebih dekat kepada orang-orang mukmin daripada diri mereka sendiri.  Oleh itu, sesiapa yang mati dan meninggalkan hutang tanpa meninggalkan harta yang cukup untuk membayarnya, maka Aku akan membayarnya. Dan sesiapa yang meninggalkan harta, maka ia adalah untuk warisnya.” Dalam satu riwayat: “Sesiapa yang meninggalkan hutang atau kerugian, maka hendaklah dia datang kepada-Ku, kerana Aku adalah pelindungnya.” Dalam satu lagi riwayat: “Sesiapa yang meninggalkan harta, maka ia adalah untuk warisnya, dan sesiapa yang tidak meninggalkan apa-apa, maka ia adalah untuk Kami.”",
        "arabic_text": "عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَنَا أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ فَمَنْ مَاتَ وَعَلَيْهِ دَيْنٌ وَلَمْ يَتْرُكْ وَفَاءً فَعَلَيَّ قَضَاؤُهُ. وَمَنْ تَرَكَ مَالًا فَلِوَرَثَتِهِ» . وَفِي رِوَايَة: «من ترك دينا أَو ضيَاعًا فَلْيَأْتِنِي فَأَنَا مَوْلَاهُ» . وَفِي رِوَايَةٍ: «مَنْ تَرَكَ مَالًا فَلِوَرَثَتِهِ وَمَنْ تَرَكَ كَلًّا فَإِلَيْنَا»"
      },
      {
        "id": 31736,
        "hadith_number": "3042",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mengenai Pemberian Faraid",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "And from Ibn Abbas, he said: The Messenger of Allah (ﷺ) said: \"Give the obligatory shares (faraid) to those entitled to them, and whatever remains is for the nearest male relative.\"",
        "malay_translation": "Daripada Ibnu Abbas, beliau berkata: Rasulullah SAW bersabda:  “Berikan bahagian faraid kepada mereka yang berhak menerimanya, dan apa yang tinggal adalah untuk waris lelaki terdekat.”",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا فَمَا بَقِيَ فَهُوَ لِأَوْلَى رَجُلٍ ذكر»"
      },
      {
        "id": 31737,
        "hadith_number": "3043",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pewarisan Antara Muslim dan Kafir",
        "perawi_melayu": "Usamah bin Zaid",
        "english_text": "From Usamah bin Zaid, he said: The Messenger of Allah (ﷺ) said: \"A Muslim does not inherit from a disbeliever, nor does a disbeliever inherit from a Muslim.\"",
        "malay_translation": "Daripada Usamah bin Zaid, beliau berkata: Rasulullah SAW bersabda:  \"Tidaklah seorang Muslim mewarisi seorang kafir, dan tidaklah seorang kafir mewarisi seorang Muslim.\"",
        "arabic_text": "وَعَنْ أُسَامَةَ بْنِ زَيْدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَرِثُ الْمُسْلِمُ الْكَافِرَ وَلَا الْكَافِرُ الْمُسْلِمَ»"
      },
      {
        "id": 31738,
        "hadith_number": "3044",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hamba yang Dimerdekakan Sebahagian daripada Kaum",
        "perawi_melayu": "Anas RA",
        "english_text": "And from Anas (may Allah be pleased with him), from the Prophet (peace and blessings of Allah be upon him) who said: 'The freed slave of a people is from themselves.' Reported by Bukhari.",
        "malay_translation": "Daripada Anas RA, daripada Nabi SAW bersabda: 'Hamba yang dimerdekakan oleh suatu kaum adalah daripada golongan mereka sendiri.' Riwayat Bukhari.",
        "arabic_text": "وَعَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَوْلَى الْقَوْمِ مِنْ أَنْفُسِهِمْ» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 31739,
        "hadith_number": "3045",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Anak saudara perempuan adalah sebahagian daripada keluarga",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Not Available",
        "malay_translation": "Daripada hadis yang diriwayatkan, Rasulullah SAW bersabda:  \"Anak saudara perempuan daripada kalangan keluarga.\"  Dan disebut juga hadis Aisyah:  \"Sesungguhnya wala' (ikatan kekeluargaan) itu…\"  (dalam bab sebelum Bab Persaudaraan).",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «ابْنُ أُخْتِ الْقَوْمِ مِنْهُم» وَذُكِرَ حَدِيثُ عَائِشَةَ: «إِنَّمَا الْوَلَاءُ» فِي بَابٍ قبل «بَاب السّلم»"
      },
      {
        "id": 31740,
        "hadith_number": "3046",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pewarisan Antara Dua Agama yang Berbeza",
        "perawi_melayu": "Abdullah bin Amr",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abdullah bin Amr, katanya: Rasulullah SAW bersabda:  \"Tidak akan saling mewarisi antara penganut dua agama yang berbeza.\" Riwayat Abu Daud dan Ibnu Majah.",
        "arabic_text": "عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَتَوَارَثُ أَهْلُ مِلَّتَيْنِ شَتَّى» . رَوَاهُ أَبُو دَاوُدَ وَابْن مَاجَه"
      },
      {
        "id": 31741,
        "hadith_number": "3047",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Riwayat Jabir",
        "perawi_melayu": "Jabir (dari riwayat Imam Tirmizi)",
        "english_text": "Not Available",
        "malay_translation": "Hadis ini diriwayatkan oleh Imam Tirmizi daripada Jabir.",
        "arabic_text": "وَرَوَاهُ التِّرْمِذِيّ عَن جَابر"
      },
      {
        "id": 31742,
        "hadith_number": "3048",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pembunuh Tidak Akan Menerima Warisan",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "And from Abu Hurairah, he said: The Messenger of Allah (ﷺ) said: “The killer does not inherit.”",
        "malay_translation": "Dari Abu Hurairah, beliau berkata: Rasulullah SAW bersabda:  “Pembunuh tidak akan mewarisi.”",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْقَاتِلُ لَا يَرِثُ» . رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه"
      },
      {
        "id": 31743,
        "hadith_number": "3049",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Bahagian Harta Pusaka Untuk Nenek",
        "perawi_melayu": "Daripada Burāidah",
        "english_text": "From Buraydah: that the Prophet (ﷺ) decreed one-sixth for the paternal grandmother if there is no mother.",
        "malay_translation": "Daripada Burāidah: bahawa Nabi ﷺ telah menetapkan bahagian harta pusaka untuk nenek sebelah bapa sebanyak satu perenam jika tiada ibu.",
        "arabic_text": "وَعَنْ بُرَيْدَةَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَعَلَ لِلْجَدَّةِ السُّدُسَ إِذَا لَمْ تَكُنْ دونهَا أم. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 31744,
        "hadith_number": "3050",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Solat Jenazah untuk Bayi dan Pewarisannya",
        "perawi_melayu": "Jabir",
        "english_text": "Not Available",
        "malay_translation": "Dari Jabir, katanya: Rasulullah SAW bersabda:  “Apabila bayi telah mengeluarkan suara (mengeluarkan bunyi), solatkanlah jenazahnya dan ia mewarisi.” Riwayat Ibnu Majah dan Ad-Darimi.",
        "arabic_text": "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا اسْتَهَلَّ الصَّبِيُّ صُلِّيَ عَلَيْهِ وَورث» . رَوَاهُ ابْن مَاجَه والدارمي"
      },
      {
        "id": 31745,
        "hadith_number": "3051",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hubungan Kekeluargaan dan Perlindungan",
        "perawi_melayu": "Khathir bin Abdullah daripada bapanya, daripada datuknya",
        "english_text": "Not Available",
        "malay_translation": "Daripada Khathir bin Abdullah daripada bapanya, daripada datuknya, bahawa Rasulullah SAW bersabda:  \"Orang yang menjadi pemimpin sesuatu kaum adalah daripada kaum itu, dan orang yang menjadi sekutu sesuatu kaum adalah daripada kaum itu, dan anak saudara perempuan sesuatu kaum adalah daripada kaum itu.\"  (Riwayat ad-Darimi)",
        "arabic_text": "وَعَنْ كَثِيرِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَوْلَى الْقَوْمِ مِنْهُمْ وَحَلِيفُ الْقَوْمِ مِنْهُمْ وَابْنُ أُخْتِ الْقَوْمِ مِنْهُمْ» . رَوَاهُ الدَّارمِيّ"
      },
      {
        "id": 31746,
        "hadith_number": "3052",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pewarisan Harta Orang yang Tiada Waris",
        "perawi_melayu": "Al-Miqdam",
        "english_text": "Not Available",
        "malay_translation": "Daripada Al-Miqdam, beliau berkata: Rasulullah SAW bersabda: \"Aku lebih berhak kepada setiap orang mukmin daripada dirinya sendiri.  Oleh itu, barang siapa yang meninggalkan hutang atau harta yang hilang, maka ia adalah kepunyaan kami (Islam). Dan barang siapa yang meninggalkan harta, maka ia adalah untuk warisnya. Dan aku menjadi wali kepada orang yang tiada wali, aku mewarisi hartanya dan aku membebaskan bebannya.  Dan bapa saudara sebelah ibu mewarisi orang yang tiada waris, dia mewarisi hartanya dan membebaskan bebannya.\"  Dalam satu riwayat lain: \"Dan aku mewarisi orang yang tiada waris, aku menguruskan urusannya dan aku mewarisinya. Dan bapa saudara sebelah ibu mewarisi orang yang tiada waris, dia menguruskan urusannya dan mewarisinya.\" Riwayat Abu Daud.",
        "arabic_text": "وَعَن الْمِقْدَام قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَنَا أَوْلَى بِكُلِّ مُؤْمِنٍ مِنْ نَفْسِهِ فَمَنْ تَرَكَ دَيْنًا أَوْ ضَيْعَةً فَإِلَيْنَا وَمَنْ تَرَكَ مَالًا فَلِوَرَثَتِهِ وَأَنَا مَوْلَى مَنْ لَا مَوْلَى لَهُ أَرِثُ مَالَهُ وَأَفُكُّ عَانَهُ وَالْخَالُ وَارِثُ مَنْ لَا وَارِثَ لَهُ يَرِثُ مَالَهُ وَيَفُكُّ عَانَهُ» . وَفِي رِوَايَةٍ: «وَأَنَا وَارِثُ مَنْ لَا وَارِثَ لَهُ أَعْقِلُ عَنْهُ وَأَرِثُهُ وَالْخَالُ وَارِثُ مَنْ لَا وَارِثَ لَهُ يَعْقِلُ عَنْهُ ويرثه» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 31747,
        "hadith_number": "3053",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Warisan Wanita",
        "perawi_melayu": "Wa'ila bin al-Asqa'",
        "english_text": "From Wa'ila ibn al-Asqa', he said: The Messenger of Allah (ﷺ) said: \"A woman inherits three things: her freed slave, her foster child, and her child whom she has weaned.\"",
        "malay_translation": "Daripada Wa'ila bin al-Asqa', katanya: Rasulullah SAW bersabda:  \"Seorang wanita mewarisi tiga perkara: hamba sahayanya yang dimerdekakan, anak angkatnya, dan anaknya yang telah disapihnya.\"",
        "arabic_text": "وَعَن وائلة بْنِ الْأَسْقَعِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَحُوزُ الْمَرْأَةُ ثَلَاثَ مَوَارِيثَ عَتِيقَهَا وَلَقِيطَهَا وَوَلَدَهَا الَّذِي لَاعَنَتْ عَنْهُ» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد وَابْن مَاجَه"
      },
      {
        "id": 31748,
        "hadith_number": "3054",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Status Anak Zina dalam Pewarisan",
        "perawi_melayu": "'Amr bin Shu'aib, Ayahnya, Datuknya",
        "english_text": "English text is missing. Please refer to the Malay translation of the Arabic text.",
        "malay_translation": "Daripada 'Amr bin Shu'aib, daripada ayahnya, daripada datuknya: Sesungguhnya Nabi SAW bersabda: \"Sesiapa sahaja lelaki yang melakukan zina dengan wanita merdeka atau hamba perempuan, maka anak itu adalah anak zina, tidak mewarisi dan tidak berhak diwarisi.\" (Riwayat Tirmizi)",
        "arabic_text": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَيُّمَا رَجُلٍ عَاهَرَ بِحُرَّةٍ أَوْ أَمَةٍ فَالْوَلَد ولد زنى لَا يَرث وَلَا يُورث» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 31749,
        "hadith_number": "3055",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pewarisan Harta Milik Seorang Maula yang Meninggal Tanpa Waris",
        "perawi_melayu": "Aisyah r.a.",
        "english_text": "From Aishah (RA): That a freedman of the Messenger of Allah (ﷺ) died and left some property but did not leave behind a close relative or children. So the Messenger of Allah (ﷺ) said: \"Give his inheritance to a man from his village.\"",
        "malay_translation": "Daripada Aisyah r.a.: bahawa seorang hamba sahaya Rasulullah SAW telah meninggal dunia dan meninggalkan harta, tetapi tidak meninggalkan saudara mara terdekat atau anak-anak. Maka Rasulullah SAW bersabda:  \"Berikan harta pusakanya kepada seorang lelaki dari kampungnya.\" ",
        "arabic_text": "وَعَنْ عَائِشَةَ: أَنَّ مَوْلًى لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَاتَ وَتَرَكَ شَيْئًا وَلَمْ يَدَعْ حَمِيمًا وَلَا وَلَدًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَعْطُوا مِيرَاثَهُ رَجُلًا مِنْ أَهْلِ قَرْيَتِهِ» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ"
      },
      {
        "id": 31750,
        "hadith_number": "3056",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pewarisan Harta Pusaka Orang yang Tiada Waris",
        "perawi_melayu": "Buraydah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Buraydah, beliau berkata: “Seorang lelaki daripada kabilah Khuzaah meninggal dunia. Maka, harta pusakanya dibawa kepada Nabi SAW. Baginda bersabda: “Carilah untuknya waris atau keluarga terdekat.”  Mereka tidak menjumpai waris mahupun keluarga terdekat baginya. Maka, Rasulullah SAW bersabda: “Berikan harta itu kepada ketua daripada kabilah Khuzaah.” Riwayat Abu Daud.  Dalam satu riwayat lain daripada Abu Daud, Baginda bersabda: “Carilah lelaki yang paling tua daripada kabilah Khuzaah.”",
        "arabic_text": "وَعَنْ بُرَيْدَةَ قَالَ: مَاتَ رَجُلٌ مِنْ خُزَاعَةَ فَأُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِيرَاثِهِ فَقَالَ: «الْتَمِسُوا لَهُ وَارِثًا أَوْ ذَا رَحِمٍ» فَلَمْ يَجِدُوا لَهُ وَارِثًا وَلَا ذَا رَحِمٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أعْطوا الْكُبْرَ مِنْ خُزَاعَةَ» . رَوَاهُ أَبُو دَاوُدَ وَفِي رِوَايَةٍ لَهُ: قَالَ: «انْظُرُوا أَكْبَرَ رَجُلٍ مِنْ خُزَاعَة»"
      },
      {
        "id": 31751,
        "hadith_number": "3057",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hutang Didahulukan Daripada Wasiat dan Hukum Waris Saudara Seibu Sebapa",
        "perawi_melayu": "Ali RA",
        "english_text": "No english text available",
        "malay_translation": "Daripada Ali RA berkata: Sesungguhnya kamu membaca ayat ini: (selepas wasiat yang kamu wasiatkan atau hutang). Dan sesungguhnya Rasulullah SAW memutuskan (membayar) hutang sebelum wasiat. Dan sesungguhnya saudara-saudara seibu mewarisi (antara satu sama lain) tanpa (saudara-saudara) sebapa. Seseorang lelaki mewarisi saudaranya yang seibu sebapa tanpa (mewarisi) saudaranya yang sebapa. Riwayat Tirmizi dan Ibnu Majah. Dan dalam riwayat Darimi, beliau berkata: «Saudara-saudara seibu mewarisi (antara satu sama lain) tanpa (saudara-saudara) sebapa...» hingga akhir hadith.",
        "arabic_text": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: إِنَّكُمْ تقرؤون هَذِهِ الْآيَةَ: (مِنْ بَعْدِ وَصِيَّةٍ تُوصُونَ بِهَا أَو دين) وَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِالدّينِ قبل الْوَصِيَّةِ وَأَنَّ أَعْيَانَ بَنِي الْأُمِّ يَتَوَارَثُونَ دُونَ بَنِي الْعَلَّاتِ الرَّجُلُ يَرِثُ أَخَاهُ لِأَبِيهِ وَأُمِّهِ دُونَ أَخِيهِ لِأَبِيهِ . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَفِي رِوَايَةِ الدَّارِمِيِّ: قَالَ: «الْإِخْوَةُ مِنَ الْأُمِّ يَتَوَارَثُونَ دُونَ بَنِي الْعَلَّاتِ. . .» إِلَى آخِره"
      },
      {
        "id": 31752,
        "hadith_number": "3058",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hak Warisan Anak Yatim",
        "perawi_melayu": "Jabir",
        "english_text": "Not Available",
        "malay_translation": "Dari Jabir, katanya:  Datanglah seorang wanita, iaitu isteri Saad bin Rabiah, kepada Rasulullah SAW dengan membawa dua orang anak perempuannya daripada Saad bin Rabiah. Wanita itu berkata: \"Wahai Rasulullah, ini adalah dua anak perempuan Saad bin Rabiah. Bapa mereka telah terkorban sebagai syahid bersama tuan di Perang Uhud.  Pakcik mereka telah mengambil harta mereka dan tidak meninggalkan apa-apa harta untuk mereka. Mereka tidak boleh dikahwinkan selagi mereka tidak mempunyai harta.\"  Rasulullah SAW bersabda:  \"Allah SWT akan menentukan hukum dalam hal ini.\" Kemudian turunlah ayat-ayat mengenai hukum faraid (pembahagian harta pusaka). Lalu Rasulullah SAW menghantar utusan kepada pakcik mereka dan bersabda:  \"Berikan kepada dua anak perempuan Saad ini dua pertiga (harta pusaka) dan berikan kepada ibu mereka satu lapan (daripada harta pusaka), dan selebihnya adalah untukmu.\"  (Riwayat Ahmad, Tirmizi, Abu Daud dan Ibnu Majah. Tirmizi berkata:  Hadis ini adalah hadis hasan gharib.)",
        "arabic_text": "وَعَنْ جَابِرٍ قَالَ: جَاءَتِ امْرَأَةُ سَعْدِ بْنِ الرَّبِيعِ بِابْنَتَيْهَا مِنْ سَعْدِ بْنِ الرَّبِيعِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ: يَا رَسُولَ اللَّهِ هَاتَانِ ابْنَتَا سَعْدِ بْنِ الرَّبِيعِ قُتِلَ أَبُوهُمَا مَعَكَ يَوْمَ أُحُدٍ شَهِيدًا وَإِنَّ عَمَّهُمَا أَخَذَ مَالَهُمَا وَلَمْ يَدَعْ لَهُمَا مَالًا وَلَا تُنْكَحَانِ إِلَّا وَلَهُمَا مَالٌ قَالَ: «يَقْضِي اللَّهُ فِي ذَلِكَ» فَنَزَلَتْ آيَةُ الْمِيرَاثِ فَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى عَمِّهِمَا فَقَالَ: «أَعْطِ لِابْنَتَيْ سَعْدٍ الثُّلُثَيْنِ وَأَعْطِ أُمَّهُمَا الثُّمُنَ وَمَا بَقِيَ فَهُوَ لَكَ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ غريبٌ"
      },
      {
        "id": 31753,
        "hadith_number": "3059",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pembahagian Harta Pusaka Menurut Ibn Mas'ud",
        "perawi_melayu": "Huzayl bin Syurahbil",
        "english_text": "And from Huzail ibn Shurahbil, he said: Abu Musa was asked about a daughter, a granddaughter, and a sister.  He said: \"The daughter gets half, and the sister gets half.\" Then go to Ibn Mas'ud, for he will support me. So Ibn Mas'ud was asked and informed of Abu Musa's statement. He said: \"I have indeed erred, and I am not of the guided ones. I judge in it according to what the Prophet (peace and blessings of Allaah be upon him) judged: 'For the daughter, half, and for the granddaughter, a sixth to complete two-thirds, and what remains is for the sister.'\" Then we came to Abu Musa and informed him of Ibn Mas'ud's statement, so he said: \"Do not ask me as long as this scholar is among you.\"",
        "malay_translation": "Daripada Huzail bin Syurahbil, katanya: Abu Musa ditanya tentang seorang anak perempuan, seorang cucu perempuan, dan seorang kakak perempuan.  Beliau berkata: \"Anak perempuan mendapat separuh, dan kakak perempuan mendapat separuh.\" Kemudian pergilah kepada Ibn Mas'ud, kerana dia akan menyokongku. Maka Ibn Mas'ud ditanya dan dimaklumkan tentang kenyataan Abu Musa. Beliau berkata: \"Sesungguhnya aku telah sesat, dan aku bukanlah daripada orang-orang yang mendapat petunjuk. Aku memberi keputusan di dalamnya mengikut apa yang telah diputuskan oleh Nabi SAW:  'Untuk anak perempuan, separuh, dan untuk cucu perempuan, sepetis untuk melengkapi dua pertiga, dan baki yang tinggal adalah untuk kakak perempuan.'\" Kemudian kami datang kepada Abu Musa dan memaklumkan kepadanya tentang kenyataan Ibn Mas'ud, lalu beliau berkata:  \"Janganlah kamu bertanya kepadaku selagi ulama ini berada di kalangan kamu.\"",
        "arabic_text": "وَعَنْ هُزَيْلِ بْنِ شُرَحْبِيلَ قَالَ: سُئِلَ أَبُو مُوسَى عَنِ ابْنَةٍ وَبِنْتِ ابْنٍ وَأُخْتٍ فَقَالَ: للْبِنْت النّصْف وَللْأُخْت النّصْف وائت ابْنَ مَسْعُودٍ فَسَيُتَابِعُنِي فَسُئِلَ ابْنُ مَسْعُودٍ وَأُخْبِرَ بقول أبي مُوسَى فَقَالَ: لقد ضللت إِذن وَمَا أَنَا مِنَ الْمُهْتَدِينَ أَقْضِي فِيهَا بِمَا قَضَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لِلْبِنْتِ النِّصْفُ وَلِابْنَةِ الِابْنِ السُّدُسُ تَكْمِلَةَ الثُّلُثَيْنِ وَمَا بَقِيَ فَلِلْأُخْتِ» فَأَتَيْنَا أَبَا مُوسَى فَأَخْبَرْنَاهُ بِقَوْلِ ابْنِ مَسْعُودٍ فَقَالَ: لَا تَسْأَلُونِي مَا دَامَ هَذَا الحبر فِيكُم. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 31754,
        "hadith_number": "3060",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pewarisan Harta Pusaka Anak",
        "perawi_melayu": "Imran bin Husain",
        "english_text": "From Imran bin Husain, he said: A man came to the Messenger of Allah (ﷺ) and said: \"My son has died, so what is my share of his inheritance?\" He said: \"You have one-sixth.\" When he turned away, he called him back and said: \"You have another one-sixth.\" When he turned away, he called him back and said: \"The other one-sixth is a gift.\"",
        "malay_translation": "Daripada Imran bin Husain, beliau berkata: Seorang lelaki datang kepada Rasulullah SAW lalu berkata: \"Anak lelakiku telah meninggal dunia, maka apakah bahagianku daripada pusakanya?\" Baginda SAW menjawab: \"Engkau berhak mendapat satu perenam.\" Setelah lelaki itu berpaling, Baginda memanggilnya semula dan berkata: \"Engkau berhak mendapat satu perenam lagi.\" Setelah lelaki itu berpaling, Baginda memanggilnya semula dan berkata: \"Sesungguhnya satu perenam yang lain itu adalah hadiah.\" ",
        "arabic_text": "وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ: جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: إِن ابْنِي مَاتَ فَمَا لِي مِنْ مِيرَاثِهِ؟ قَالَ: «لَكَ السُّدُسُ» فَلَمَّا وَلَّى دَعَاهُ قَالَ: «لَكَ سُدُسٌ آخَرُ» فَلَمَّا وَلَّى دَعَاهُ قَالَ: «إِنَّ السُّدُسَ الْآخَرَ طُعْمَةٌ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ"
      },
      {
        "id": 31755,
        "hadith_number": "3061",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pembahagian Harta Pusaka Nenek",
        "perawi_melayu": "Qabishah bin Dzu'aib",
        "english_text": "Not Available",
        "malay_translation": "Daripada Qabishah bin Dzu'aib, katanya:  Seorang nenek datang kepada Abu Bakar r.a. meminta bahagian pusakanya. Abu Bakar berkata kepadanya, \"Engkau tidak mempunyai apa-apa hak dalam kitab Allah dan sunnah Rasulullah SAW. Kembalilah, supaya aku bertanya kepada orang ramai.\"  Lalu dia bertanya, dan al-Mughirah bin Syu'bah berkata, \"Aku hadir ketika Rasulullah SAW memberikan kepada nenek tersebut 1/6 (seperenam) daripada harta pusaka.\"  Abu Bakar r.a. bertanya, \"Adakah ada saksi lain?\"  Muhammad bin Maslamah berkata seperti yang dikatakan al-Mughirah. Maka Abu Bakar r.a. memberikan bahagian tersebut kepada nenek itu. Kemudian, seorang nenek yang lain datang kepada Umar r.a. meminta bahagian pusakanya. Umar berkata, \"Bahagiannya ialah 1/6 (seperenam). Jika mereka berdua, maka ia dibahagikan di antara mereka. Dan jika salah seorang telah meninggal dunia, maka bahagiannya menjadi milik nenek yang masih hidup.\"  Riwayat Malik, Ahmad, Tirmizi, Abu Daud, Darimi dan Ibnu Majah.",
        "arabic_text": "وَعَنْ قَبِيصَةَ بْنِ ذُؤَيْبٍ قَالَ: جَاءَتِ الْجَدَّةُ إِلَى أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ تَسْأَلُهُ مِيرَاثَهَا فَقَالَ لَهَا: مَا لَكِ فِي كِتَابِ اللَّهِ شَيْءٌ وَمَا لَكِ فِي سُنَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْءٌ فَارْجِعِي حَتَّى أَسْأَلَ النَّاسَ فَسَأَلَ فَقَالَ الْمُغِيرَةُ بْنُ شُعْبَةَ: حَضَرْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطَاهَا السُّدُسَ فَقَالَ أَبُو بَكْرٍ رَضِيَ الله عَنهُ هَل مَعَك غَيره؟ فَقَالَ مُحَمَّدُ بْنُ مَسْلَمَةَ مِثْلَ مَا قَالَ الْمُغيرَة فأنفذه لَهَا أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ ثُمَّ جَاءَتِ الْجدّة الْأُخْرَى إِلَى عُمَرَ رَضِيَ اللَّهُ عَنْهُ تَسْأَلُهُ مِيرَاثَهَا فَقَالَ: هُوَ ذَلِك السُّدس فَإِن اجْتمعَا فَهُوَ بَيْنَكُمَا وَأَيَّتُكُمَا خَلَتْ بِهِ فَهُوَ لَهَا. رَوَاهُ مَالِكٌ وَأَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالدَّارِمِيُّ وَابْن مَاجَه"
      },
      {
        "id": 31756,
        "hadith_number": "3062",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Bahagian Pusaka Nenek Bersama Anak Lelakinya",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Teks Bahasa Inggeris tidak tersedia",
        "malay_translation": "Daripada Ibn Mas'ud RA berkata mengenai nenek bersama anaknya: Sesungguhnya, beliau adalah nenek pertama yang diberikan oleh Rasulullah SAW bahagian satu perenam (daripada harta pusaka) bersama anaknya, dan anaknya masih hidup. Diriwayatkan oleh Tirmidzi dan Darimi, dan Tirmidzi menilainya sebagai dhaif.",
        "arabic_text": "وَعَنِ ابْنِ مَسْعُودٍ قَالَ فِي الْجَدَّةِ مَعَ ابْنِهَا: أَنَّهَا أَوَّلُ جَدَّةٍ أَطْعَمَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُدُسًا مَعَ ابْنِهَا وَابْنُهَا حَيٌّ. رَوَاهُ التِّرْمِذِيُّ وَالدَّارِمِيُّ وَالتِّرْمِذِيُّ ضَعَّفَهُ"
      },
      {
        "id": 31757,
        "hadith_number": "3063",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Warisan Wanita Ashyam Ad-Dababi",
        "perawi_melayu": "Ad-Dahhak bin Sufiyan",
        "english_text": "From Ad-Dahhak bin Sufiyan: That the Messenger of Allah ﷺ wrote to him: \"That a woman, Ashyam ad-Dababi, inherits from her husband's blood money.\"",
        "malay_translation": "Daripada Ad-Dahhak bin Sufiyan: bahawa Rasulullah SAW telah menulis kepadanya: \"Seorang wanita, Ashyam ad-Dababi, mewarisi daripada diat suaminya.\" Riwayat Imam Tirmizi dan Abu Daud. Imam Tirmizi berkata: Hadis ini adalah hadis hasan sahih.",
        "arabic_text": "وَعَنِ الضَّحَّاكِ بْنِ سُفْيَانَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَيْهِ: «أَنْ ورث امْرَأَة أَشْيَم الضبابِي مِنْ دِيَةِ زَوْجِهَا» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ صَحِيح"
      },
      {
        "id": 31758,
        "hadith_number": "3064",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hak Orang Islam Ke Atas Mualaf",
        "perawi_melayu": "Tamim al-Dari",
        "english_text": "Not Available",
        "malay_translation": "Daripada Tamim al-Dari, katanya:  Dia bertanya kepada Rasulullah SAW: Apakah sunnah bagi seorang lelaki daripada ahli syirik yang memeluk Islam di tangan seorang daripada orang Islam?  Baginda menjawab:  \"Dia lebih berhak ke atas kehidupan dan kematiannya.\"  Riwayat al-Tirmizi, Ibnu Majah dan al-Darimi.",
        "arabic_text": "وَعَنْ تَمِيمٍ الدَّارِيِّ قَالَ: سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَا السُّنَةُ فِي الرَّجُلِ مِنْ أَهْلِ الشِّرْكِ يُسْلِمُ عَلَى يَدَيْ رَجُلٍ مِنَ الْمُسْلِمِينَ؟ فَقَالَ: «هُوَ أَوْلَى النَّاسِ بِمَحْيَاهُ وَمَمَاتِهِ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ"
      },
      {
        "id": 31759,
        "hadith_number": "3065",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pewarisan Harta Kepada Anak Angkat",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "From Ibn Abbas: That a man died and did not leave behind any heir except a boy whom he had freed.  The Prophet (peace and blessings of Allaah be upon him) said: “Has he anyone (else)?” They said: “No, only a boy whom he freed.” So the Prophet (peace and blessings of Allaah be upon him) gave his inheritance to him.",
        "malay_translation": "Daripada Ibnu Abbas: bahawa seorang lelaki meninggal dunia dan tidak meninggalkan waris kecuali seorang budak lelaki yang telah dibebaskannya. Nabi SAW bersabda: “Adakah dia mempunyai sesiapa lagi?” Mereka menjawab: “Tidak, hanya seorang budak lelaki yang telah dibebaskannya.” Maka Nabi SAW memberikan hartanya kepadanya.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ رَجُلًا مَاتَ وَلَمْ يَدَعْ وَارِثًا إِلَّا غُلَامًا كَانَ أَعْتَقَهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَلْ لَهُ أَحَدٌ؟» قَالُوا: لَا إِلَّا غُلَامٌ لَهُ كَانَ أَعْتَقَهُ فَجَعَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِيرَاثَهُ لَهُ. رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَابْنُ مَاجَه"
      },
      {
        "id": 31760,
        "hadith_number": "3066",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perwalian Diwarisi Seperti Harta",
        "perawi_melayu": "Tidak dinyatakan dalam data asal, perawi disebut dalam teks hadis: 'Amr bin Syu'aib",
        "english_text": "Teks Bahasa Inggeris tidak disediakan",
        "malay_translation": "Daripada 'Amr bin Syu'aib, daripada bapanya, daripada datuknya, bahawa Nabi صلى الله عليه وسلم bersabda: \"Al-Wala' (hak perwalian) diwarisi oleh orang yang mewarisi harta.\" Diriwayatkan oleh al-Tirmizi dan beliau berkata: \"Hadis ini sanadnya tidak kuat.\"",
        "arabic_text": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَرِثُ الْوَلَاءَ مَنْ يَرِثُ الْمَالَ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ إِسْنَادُهُ لَيْسَ بِالْقَوِيِّ"
      },
      {
        "id": 31761,
        "hadith_number": "3067",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pembahagian Harta Pusaka Zaman Jahiliyyah dan Islam",
        "perawi_melayu": "Abdullah bin Umar",
        "english_text": "From Abdullah bin Umar: That the Messenger of Allah (peace and blessings of Allah be upon him) said: “Whatever inheritance was distributed in the time of Jahiliyyah (pre-Islamic period) remains on the basis of Jahiliyyah distribution, and whatever inheritance Islam encountered, then it is on the basis of Islamic distribution.”",
        "malay_translation": "Daripada Abdullah bin Umar: bahawa Rasulullah SAW bersabda:  “Apa jua harta pusaka yang telah diagihkan pada zaman Jahiliyyah (pra-Islam) kekal mengikut cara pengagihan Jahiliyyah, dan apa jua harta pusaka yang diwarisi oleh Islam, maka ia mengikut cara pengagihan Islam.”",
        "arabic_text": "عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا كَانَ مِنْ مِيرَاثٍ قُسِّمَ فِي الْجَاهِلِيَّةِ فَهُوَ عَلَى قِسْمَةِ الْجَاهِلِيَّةِ وَمَا كَانَ مِنْ مِيرَاثٍ أَدْرَكَهُ الْإِسْلَامُ فَهُوَ عَلَى قِسْمَةِ الْإِسْلَامِ» . رَوَاهُ ابْن مَاجَه"
      },
      {
        "id": 31762,
        "hadith_number": "3068",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Umar bin al-Khattab tentang Wanita yang Menjadi Makmur Tetapi Tidak Berhak Menerima Harta Pusaka",
        "perawi_melayu": "Muhammad bin Abi Bakar bin Hazm",
        "english_text": "Not Available",
        "malay_translation": "Daripada Muhammad bin Abi Bakar bin Hazm, bahawa beliau mendengar bapanya sering berkata: Umar bin al-Khattab berkata: “Anehnya, perempuan itu dimuliakan tetapi tidak mewarisi harta pusaka.” Riwayat Malik.",
        "arabic_text": "وَعَنْ مُحَمَّدِ بْنِ أَبِي بَكْرِ بْنِ حَزْمٍ أَنَّهُ سَمِعَ أَبَاهُ كَثِيرًا يَقُولُ: كَانَ عُمَرُ بْنُ الْخَطَّابِ يَقُولُ: عَجَبًا لِلْعَمَّةِ تُورَثُ وَلَا تَرث. رَوَاهُ مَالك"
      },
      {
        "id": 31763,
        "hadith_number": "3069",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Belajar Fardhu dan Hukum-hukum Lain",
        "perawi_melayu": "Umar r.a.",
        "english_text": "Not Available",
        "malay_translation": "Daripada Umar r.a., beliau berkata: \"Pelajarilah hukum-hukum fardhu.\"  Ibn Mas'ud menambah: \"Dan juga hukum talak dan haji.\" Mereka berdua berkata: \"Kerana ia adalah sebahagian daripada agama kamu.\"  (Riwayat ad-Darimi)",
        "arabic_text": "وَعَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُ قَالَ: تَعَلَّمُوا الْفَرَائِضَ وَزَادَ ابْنُ مَسْعُودٍ: وَالطَّلَاقَ وَالْحَجَّ قَالَا: فَإِنَّهُ من دينكُمْ. رَوَاهُ الدَّارمِيّ"
      },
      {
        "id": 31764,
        "hadith_number": "3070",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Wasiat Bertulis",
        "perawi_melayu": "Ibn Umar",
        "english_text": "From Ibn Umar (may Allah be pleased with him), he said: The Messenger of Allah (peace and blessings of Allah be upon him) said: “It is not the right of a Muslim who has something to bequeath to spend two nights without having his will written.”",
        "malay_translation": "Daripada Ibnu Umar رضي الله عنه, beliau berkata: Rasulullah ﷺ bersabda:  “Tidaklah hak bagi seorang Muslim yang mempunyai sesuatu untuk diwasiatkan menghabiskan dua malam melainkan dengan wasiat yang telah ditulis.”",
        "arabic_text": "عَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا حَقُّ امْرِئٍ مُسْلِمٍ لَهُ شَيْءٌ يُوصَى فِيهِ يَبِيتُ لَيْلَتَيْنِ إِلَّا وَوَصِيَّة مَكْتُوبَة عِنْده»"
      },
      {
        "id": 31765,
        "hadith_number": "3071",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Wasiat Harta Kepada Anak Perempuan",
        "perawi_melayu": "Sa'd bin Abi Waqqas",
        "english_text": "Not Available",
        "malay_translation": "Daripada Sa'd bin Abi Waqqas r.a., katanya: Aku sakit ketika tahun pembukaan (Mekah) dengan penyakit yang hampir membawa maut. Maka datanglah Rasulullah SAW melawatku. Aku berkata: Wahai Rasulullah, sesungguhnya aku mempunyai harta yang banyak dan tiada yang mewarisi aku melainkan anak perempuanku sahaja. Bolehkah aku wasiatkan seluruh harta kekayaanku kepadanya? Baginda menjawab: \"Tidak.\" Aku bertanya lagi: Bagaimana dengan dua pertiga daripada harta kekayaanku? Baginda menjawab: \"Tidak.\" Aku bertanya lagi: Bagaimana dengan separuh daripada harta kekayaanku? Baginda menjawab: \"Tidak.\" Aku bertanya lagi: Bagaimana dengan sepertiga daripada harta kekayaanku? Baginda menjawab: \"Sepertiga itu sudah banyak. Sesungguhnya jika engkau meninggalkan warismu dalam keadaan kaya, adalah lebih baik daripada engkau meninggalkan mereka dalam keadaan miskin sehingga mereka meminta-minta daripada orang lain. Dan sesungguhnya engkau tidak akan membelanjakan sesuatu belanja yang diniatkan kerana mencari keredaan Allah melainkan engkau akan mendapat pahala baginya, sehingga sesuap makanan yang engkau hulurkan kepada isterimu.\"",
        "arabic_text": "وَعَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَ: مَرِضْتُ عَامَ الْفَتْحِ مَرَضًا أَشْفَيْتُ عَلَى الْمَوْتِ فَأَتَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعُودُنِي فَقُلْتُ: يَا رَسُولَ اللَّهِ: إِنَّ لِي مَالًا كَثِيرًا وَلَيْسَ يَرِثُنِي إِلَّا ابْنَتِي أَفَأُوصِي بِمَالِي كُلِّهِ؟ قَالَ: «لَا» قُلْتُ: فَثُلُثَيْ مَالِي؟ قَالَ: «لَا» قُلْتُ: فَالشَّطْرِ؟ قَالَ: «لَا» قُلْتُ: فَالثُّلُثِ؟ قَالَ: «الثُّلُثُ وَالثُّلُثُ كَثِيرٌ إِنَّكَ إِنْ تَذَرْ وَرَثَتَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَذَرَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ وَإِنَّكَ لَنْ تُنْفِقَ نَفَقَةً تَبْتَغِي بِهَا وَجْهَ اللَّهِ إِلَّا أُجِرْتَ بِهَا حَتَّى اللُّقْمَةَ تَرْفَعُهَا إِلَى فِي امْرَأَتِكَ»"
      },
      {
        "id": 31766,
        "hadith_number": "3072",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nasihat tentang Wasiat Ketika Sakit",
        "perawi_melayu": "Sa'ad bin Abi Waqqas RA",
        "english_text": "[Teks Bahasa Inggeris Kosong]",
        "malay_translation": "Daripada Sa'ad bin Abi Waqqas RA berkata: Rasulullah SAW telah menziarahi aku ketika aku sakit, lalu Baginda bersabda: «Adakah kamu telah berwasiat?» Aku menjawab: Ya. Baginda bersabda: «Dengan berapa?» Aku menjawab: Dengan seluruh hartaku di jalan Allah. Baginda bersabda: «Lalu apa yang kamu tinggalkan untuk anak-anakmu?» Aku menjawab: Mereka kaya dengan kebaikan. Baginda bersabda: «Berwasiatlah dengan sepersepuluh» Maka aku terus meminta dikurangkan sehingga Baginda bersabda: «Berwasiatlah dengan sepertiga dan sepertiga itu banyak». Riwayat at-Tirmizi",
        "arabic_text": "عَن سَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَ: عَادَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا مَرِيضٌ فَقَالَ: «أَوْصَيْتَ؟» قُلْتُ: نَعَمْ قَالَ: «بِكَمْ؟» قُلْتُ: بِمَالِي كُلِّهِ فِي سَبِيلِ اللَّهِ. قَالَ: «فَمَا تَرَكْتَ لِوَلَدِكَ؟» قُلْتُ: هُمْ أَغْنِيَاءُ بِخَيْرٍ. فَقَالَ: «أوص بالعشر» فَمَا زَالَت أُنَاقِصُهُ حَتَّى قَالَ: «أَوْصِ بِالثُّلُثِ وَالثُّلُثُ كَثِيرٌ» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 31767,
        "hadith_number": "3073",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hak Setiap Individu dan Larangan Wasiat kepada Waris",
        "perawi_melayu": "Abu Umamah",
        "english_text": "Teks Bahasa Inggeris tiada",
        "malay_translation": "Daripada Abu Umamah RA berkata: Saya mendengar Rasulullah SAW bersabda dalam khutbahnya pada tahun Haji Wada': \"Sesungguhnya Allah telah memberikan setiap orang yang berhak akan haknya, maka tidak ada wasiat untuk ahli waris.\" Riwayat Abu Daud dan Ibnu Majah, dan Imam Tirmizi menambahkan: \"Anak itu milik pemilik tempat tidur (suami), dan bagi penzina adalah batu (rejam), dan perhitungan mereka adalah pada Allah.\"",
        "arabic_text": "وَعَنْ أَبِي أُمَامَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي خُطْبَتِهِ عَامَ حَجَّةِ الْوَدَاعِ: «إِنِ اللَّهَ قَدْ أَعْطَى كُلَّ ذِي حَقٍّ حَقَّهُ فَلَا وَصِيَّةَ لِوَارِثٍ» . رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ وَزَادَ التِّرْمِذِيُّ: «الْوَلَدُ لِلْفَرَاشِ وَلِلْعَاهِرِ الْحَجَرُ وَحِسَابُهُمْ عَلَى اللَّهِ»"
      },
      {
        "id": 31768,
        "hadith_number": "3074",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Wasiat Kepada Pewaris",
        "perawi_melayu": "Ibn Abbas r.a.",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Abbas r.a., daripada Nabi SAW, Baginda bersabda:  \"Tiada wasiat kepada pewaris melainkan jika pewaris-pewaris itu sendiri membenarkannya.\"  (Riwayat ini terputus. Ini adalah lafaz yang terdapat dalam Mishkat Al-Masabih).  Dalam riwayat Daruquthni pula menyebut: Baginda bersabda: \"Tidak sah wasiat kepada pewaris melainkan jika pewaris-pewaris itu sendiri membenarkannya.\"",
        "arabic_text": "وَيُرْوَى عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا وَصِيَّةَ لِوَارِثٍ إِلَّا أَنْ يَشَاءَ الْوَرَثَةُ» مُنْقَطِعٌ هَذَا لَفْظُ الْمَصَابِيحِ. وَفِي رِوَايَةِ الدَّارَقُطْنِيِّ: قَالَ: «لَا تَجُوزُ وَصِيَّةٌ لِوَارِثٍ إِلَّا أَنْ يَشَاء الْوَرَثَة»"
      },
      {
        "id": 31769,
        "hadith_number": "3075",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Azab Neraka Kerana Perselisihan Wasiah",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah, daripada Rasulullah SAW, baginda bersabda:  “Sesungguhnya seseorang lelaki dan perempuan itu boleh beramal taat kepada Allah selama enam puluh tahun, kemudian maut menjelang mereka lalu mereka berselisih faham tentang wasiat, maka wajiblah ke atas mereka (kedua-duanya) azab neraka.” Kemudian Abu Hurairah membaca (daripada ayat yang bermaksud):  “...selepas wasiat yang diwasiatkan atau hutang yang tidak memudaratkan...” sehingga ke ayat “...dan itulah kejayaan yang besar.”  (Riwayat Ahmad, Tirmizi, Abu Daud dan Ibnu Majah)",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الرَّجُلَ لَيَعْمَلُ وَالْمَرْأَةَ بِطَاعَةِ اللَّهِ سِتِّينَ سَنَةً ثُمَّ يَحْضُرُهُمَا الْمَوْتُ فَيُضَارَّانِ فِي الْوَصِيَّةِ فَتَجِبُ لَهُمَا النَّارُ» ثُمَّ قَرَأَ أَبُو هُرَيْرَةَ (مِنْ بَعْدِ وَصِيَّةٍ يُوصَى بِهَا أَوْ دَيْنٍ غير مضار) إِلَى قَوْله (وَذَلِكَ الْفَوْز الْعَظِيم) رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ"
      },
      {
        "id": 31770,
        "hadith_number": "3076",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kematian dengan Wasiat",
        "perawi_melayu": "Jabir",
        "english_text": "From Jabir, he said: The Messenger of Allah (ﷺ) said: “Whoever dies with a will, dies on the path (of righteousness) and Sunnah, and dies with piety and testimony, and dies forgiven.”",
        "malay_translation": "Dari Jabir, katanya: Rasulullah SAW bersabda: “Sesiapa yang mati dengan wasiat, mati di jalan (kebenaran) dan Sunnah, dan mati dengan takwa dan kesaksian, dan mati dalam keadaan diampunkan.”",
        "arabic_text": "عَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ مَاتَ عَلَى وَصِيَّةٍ مَاتَ عَلَى سَبِيلٍ وَسُنَّةٍ وَمَاتَ عَلَى تُقًى وَشَهَادَةٍ وَمَاتَ مَغْفُورًا لَهُ» . رَوَاهُ ابْنُ مَاجَهْ"
      },
      {
        "id": 31771,
        "hadith_number": "3077",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Membebaskan Hamba Sebagai Wasilah Menggapai Ganjaran",
        "perawi_melayu": "Amru bin Syu'aib daripada bapanya daripada datuknya",
        "english_text": "Not Available",
        "malay_translation": "Daripada Amru bin Syu'aib daripada bapanya daripada datuknya bahawa al-'Ash bin Wa'il mewasiatkan agar seratus hamba dibebaskan untuknya.  Maka anaknya, Hisyam, telah membebaskan lima puluh hamba.  Anaknya pula, Amru, ingin membebaskan baki lima puluh hamba lagi.  Lalu dia berkata, \"Hendaklah aku bertanyakan kepada Rasulullah SAW.\"  Maka dia datang kepada Nabi SAW dan berkata, \"Wahai Rasulullah, bapa saya telah mewasiatkan agar seratus hamba dibebaskan untuknya.  Hisyam telah membebaskan lima puluh hamba, dan tinggal lagi lima puluh hamba.  Adakah saya patut membebaskannya?\"  Rasulullah SAW bersabda:  \"Sesungguhnya sekiranya dia seorang Muslim, dan kamu membebaskan hamba untuknya, atau bersedekah untuknya, atau menunaikan haji untuknya, maka pahala amalan itu akan sampai kepadanya.\"  (Riwayat Abu Daud)",
        "arabic_text": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ الْعَاصَ بْنَ وَائِلٍ أَوْصَى أَنْ يُعْتَقَ عَنْهُ مِائَةُ رَقَبَةٍ فَأَعْتَقَ ابْنُهُ هِشَامٌ خَمْسِينَ رَقَبَةً فَأَرَادَ ابْنُهُ عَمْرٌو أَنْ يُعْتِقَ عَنهُ الْخمسين الْبَاقِيَة فَقَالَ: حَتَّى أَسْأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا رَسُولَ اللَّهِ إِنَّ أَبِي أَوْصَى أَنْ يُعْتَقَ عَنْهُ مِائَةُ رَقَبَةٍ وَإِنَّ هِشَامًا أَعْتَقَ عَنْهُ خَمْسِينَ وَبَقِيَتْ عَلَيْهِ خَمْسُونَ رَقَبَةً أَفَأَعْتِقُ عَنْهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّه لَو كَانَ مُسلما فأعتقتم عَنْهُ أَوْ تَصَدَّقْتَمْ عَنْهُ أَوْ حَجَجْتَمْ عَنْهُ بلغه ذَلِك» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 31772,
        "hadith_number": "3078",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mencegah Pewaris daripada Hak Warisannya",
        "perawi_melayu": "Anas",
        "english_text": "Not Available",
        "malay_translation": "Daripada Anas, katanya: Rasulullah SAW bersabda: \"Barang siapa yang memutuskan warisan pewarisnya, nescaya Allah SWT akan memutuskan warisannya daripada syurga pada hari kiamat.\" Riwayat Ibnu Majah.",
        "arabic_text": "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَطَعَ مِيرَاثَ وَارِثِهِ قَطَعَ اللَّهُ مِيرَاثَهُ مِنَ الْجَنَّةِ يَوْمَ الْقِيَامَةِ» . رَوَاهُ ابْنُ مَاجَهْ"
      }
    ]
  }
}