{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 83,
    "data": [
      {
        "id": 28892,
        "hadith_number": "198",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penyampaian Hadis dan Peringatan tentang Berdusta",
        "perawi_melayu": "Abdullah bin 'Amr",
        "english_text": "Daripada Abdullah bin 'Amr, dia berkata: Rasulullah SAW bersabda, \"Sampaikanlah hadis daripada aku, walaupun hanya satu ayat. Ceritakanlah kisah Bani Israel, dan tidak mengapa. Barangsiapa yang berdusta terhadapku dengan sengaja, maka hendaklah dia menyediakan tempat duduknya di neraka.\"  Riwayat Bukhari.",
        "malay_translation": "Daripada Abdullah bin 'Amr, beliau berkata: Rasulullah SAW bersabda, \"Sampaikanlah hadis daripada aku, walau hanya satu ayat. Ceritakanlah kisah Bani Israil, dan tidak mengapa. Barangsiapa yang sengaja berdusta tentangku, maka hendaklah dia menyediakan tempat duduknya di neraka.\"  Riwayat Imam al-Bukhari.",
        "arabic_text": "عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «بَلِّغُوا عَنِّي وَلَوْ آيَةً وَحَدِّثُوا عَنْ بَنِي إِسْرَائِيلَ وَلَا حَرَجَ وَمَنْ كَذَبَ عَلَيَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 28893,
        "hadith_number": "199",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis Mengenai Perbuatan Mengada-ngada Hadis Palsu",
        "perawi_melayu": "Samurah bin Jundub dan Mughirah bin Syu'bah",
        "english_text": "From Samurah bin Jundub and Mughirah bin Syu'bah, they said: The Messenger of Allah, peace and blessings be upon him, said, \"Whoever narrates a Hadith from me that he considers to be false, then he is one of the liars.\"",
        "malay_translation": "Daripada Samurah bin Jundub dan Mughirah bin Syu'bah, mereka berdua berkata: Rasulullah SAW bersabda, \"Barangsiapa yang meriwayatkan hadis dariku yang dia anggap dusta, maka sesungguhnya dia termasuk dalam golongan pendusta.\"",
        "arabic_text": "وَعَن سَمُرَة بن جُنْدُب وَالْمُغِيرَةِ بْنِ شُعْبَةَ قَالَا: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ حَدَّثَ عَنِّي بِحَدِيثٍ يَرَى أَنَّهُ كَذِبٌ فَهُوَ أَحَدُ الْكَاذِبِينَ» . رَوَاهُ مُسلم"
      },
      {
        "id": 28894,
        "hadith_number": "200",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keikhlasan Allah dalam Memberi Ilmu Agama",
        "perawi_melayu": "Mu'awiyah",
        "english_text": "And from Mu'awiyah, he said: The Messenger of Allah, peace and blessings be upon him, said, \"Whoever Allah desires good for, He will grant him understanding in the religion. And indeed, I am only a distributor, and Allah gives.\" ",
        "malay_translation": "Dan daripada Mu'awiyah, beliau berkata: Rasulullah SAW bersabda, \"Sesiapa yang Allah kehendaki kebaikan baginya, nescaya Dia akan memberi kefahaman dalam agama. Dan sesungguhnya aku hanyalah pembahagi, dan Allah yang memberi.\"",
        "arabic_text": "وَعَنْ مُعَاوِيَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُفَقِّهْهُ فِي الدِّينِ وَإِنَّمَا أَنَا قَاسِمٌ وَاللَّهِ يُعْطِي»"
      },
      {
        "id": 28895,
        "hadith_number": "201",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kualiti Manusia Sama Seperti Logam Mulia",
        "perawi_melayu": "Abu Hurairah r.a.",
        "english_text": "Daripada Abu Hurairah r.a., Baginda Rasulullah SAW bersabda: \"Manusia itu seperti bijih-bijih logam mulia, seperti emas dan perak. Yang terbaik di kalangan mereka dalam zaman Jahiliah adalah yang terbaik di kalangan mereka dalam Islam apabila mereka memahami (Islam).\" Diriwayatkan oleh Imam Muslim.",
        "malay_translation": "Daripada Abu Hurairah r.a., Baginda Rasulullah SAW bersabda: \"Manusia itu seperti bijih-bijih logam mulia, seperti emas dan perak. Orang-orang terbaik di kalangan mereka dalam zaman Jahiliah adalah yang terbaik di kalangan mereka dalam Islam apabila mereka memahami (Islam).\" Diriwayatkan oleh Imam Muslim.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «النَّاسُ مَعَادِنُ كَمَعَادِنِ الذَّهَبِ وَالْفِضَّةِ خِيَارُهُمْ فِي الْجَاهِلِيَّةِ خِيَارُهُمْ فِي الْإِسْلَامِ إِذَا فَقِهُوا» . رَوَاهُ مُسلم"
      },
      {
        "id": 28896,
        "hadith_number": "202",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Berdengki Kecuali Dua Keadaan",
        "perawi_melayu": "Ibn Mas'ud",
        "english_text": "Daripada Ibnu Mas'ud, dia berkata: Rasulullah SAW bersabda: \"Tidak ada dengki melainkan dalam dua perkara: lelaki yang Allah berikan harta lalu dia membelanjakannya untuk kebaikan dengan cara yang benar dan lelaki yang Allah berikan hikmah lalu dia menggunakannya untuk menyampaikan ilmu dan keadilan.\"",
        "malay_translation": "Daripada Ibnu Mas'ud, dia berkata: Rasulullah SAW bersabda: \"Tidak ada dengki melainkan dalam dua perkara: lelaki yang Allah berikan harta lalu dia membelanjakannya untuk kebaikan dengan cara yang benar dan lelaki yang Allah berikan hikmah lalu dia menggunakannya untuk menyampaikan ilmu dan keadilan.\"",
        "arabic_text": "وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا حَسَدَ إِلَّا فِي اثْنَتَيْنِ رَجُلٍ آتَاهُ اللَّهُ مَالًا فَسَلَّطَهُ عَلَى هَلَكَتِهِ فِي الْحَقِّ وَرَجُلٍ آتَاهُ اللَّهُ لْحِكْمَة فَهُوَ يقْضِي بهَا وَيعلمهَا)"
      },
      {
        "id": 28897,
        "hadith_number": "203",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keberhentian Amal Setelah Kematian",
        "perawi_melayu": "Abu Hurairah r.a.",
        "english_text": "And from Abu Hurairah, may Allah be pleased with him, he said: The Messenger of Allah, peace and blessings be upon him, said: When a person dies, his actions cease except for three things: ongoing charity, beneficial knowledge, or a righteous child who prays for him.",
        "malay_translation": "Dan daripada Abu Hurairah r.a., dia berkata: Rasulullah SAW bersabda: Apabila seseorang meninggal dunia, amalnya terhenti melainkan tiga perkara: sedekah جاری (yang berterusan), ilmu yang bermanfaat, atau anak yang soleh yang mendoakannya.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا مَاتَ الْإِنْسَانُ انْقَطَعَ عَمَلُهُ إِلَّا مِنْ ثَلَاثَةِ أَشْيَاءَ: صَدَقَةٍ جَارِيَةٍ أوعلم ينْتَفع بِهِ أوولد صَالح يَدْعُو لَهُ) رَوَاهُ مُسلم"
      },
      {
        "id": 28898,
        "hadith_number": "204",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Membantu dan Menolong Sesama Muslim",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada beliau (Abu Hurairah R.A), রাসূলুল্লাহ ﷺ bersabda: “Sesiapa yang melepaskan seorang mukmin daripada kesusahan di dunia, Allah akan melepaskannya daripada kesusahan pada hari Kiamat. Sesiapa yang memudahkan urusan orang yang berada dalam kesulitan, Allah akan memudahkan urusannya di dunia dan akhirat. Sesiapa yang menutupi aib seorang Muslim, Allah akan menutup aibnya di dunia dan akhirat. Allah sentiasa menolong seorang hamba selagi mana hamba itu menolong saudaranya. Sesiapa yang menempuh jalan untuk mencari ilmu, Allah akan memudahkan baginya jalan menuju syurga. Tidaklah berkumpul suatu kaum di salah satu rumah Allah (masjid) untuk membaca Kitab Allah dan saling mempelajarinya, melainkan akan turun kepada mereka ketenangan, diliputi oleh rahmat, dikelilingi oleh para malaikat, dan Allah menyebut-nyebut mereka di kalangan (malaikat) yang berada di sisi-Nya. Sesiapa yang lambat amalnya, maka nasabnya tidak akan mempercepatkannya.” Riwayat Muslim.",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ نَفَّسَ عَنْ مُؤْمِنٍ كُرْبَةً مِنْ كُرَبِ الدُّنْيَا نَفَّسَ اللَّهُ عَنْهُ كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ وَمِنْ يَسَّرَ عَلَى مُعْسِرٍ يَسَّرَ اللَّهُ عَلَيْهِ فِي الدُّنْيَا وَالْآخِرَةِ. وَمَنْ سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ فِي الدُّنْيَا وَالْآخِرَةِ وَاللَّهُ فِي عَوْنِ الْعَبْدِ مَا كَانَ الْعَبْدُ فِي عَوْنِ أَخِيهِ وَمَنْ سَلَكَ طَرِيقًا يَلْتَمِسُ فِيهِ عِلْمًا سَهَّلَ اللَّهُ لَهُ بِهِ طَرِيقًا إِلَى الْجَنَّةِ وَمَا اجْتَمَعَ قَوْمٌ فِي بَيْتٍ مِنْ بُيُوتِ اللَّهِ يَتْلُونَ كِتَابَ اللَّهِ وَيَتَدَارَسُونَهُ بَيْنَهُمْ إِلَّا نَزَلَتْ عَلَيْهِمُ السَّكِينَةُ وَغَشِيَتْهُمُ الرَّحْمَةُ وَحَفَّتْهُمُ الْمَلَائِكَةُ وَذَكَرَهُمُ اللَّهُ فِيمَنْ عِنْدَهُ وَمَنْ بَطَّأَ بِهِ عَمَلُهُ لَمْ يُسْرِعْ بِهِ نسبه» . رَوَاهُ مُسلم"
      },
      {
        "id": 28899,
        "hadith_number": "205",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum dan Akibat Amalan yang Bermotifkan Dunia",
        "perawi_melayu": "N/A",
        "english_text": null,
        "malay_translation": "Daripadanya, beliau berkata: Rasulullah SAW bersabda, \"Sesungguhnya orang pertama yang akan diadili pada Hari Kiamat ialah seorang lelaki yang syahid. Dia akan dihadapkan, dan Allah akan mempamerkan nikmat-nikmat-Nya kepadanya. Dia mengenalinya. Lalu Allah bertanya: \"Apakah yang engkau lakukan dengan nikmat-nikmat tersebut?\" Dia menjawab: \"Aku berjuang untukmu hingga aku syahid.\" Allah berfirman: \"Engkau berdusta! Hakikatnya, engkau berjuang agar dikatakan berani, dan itu telahpun terjadi!\" Kemudian dia diperintahkan agar dihempaskan ke muka hingga dilemparkan ke dalam neraka.  Dan seorang lelaki yang mengkaji ilmu dan mengajarkannya serta membaca Al-Quran. Dia akan dihadapkan, dan Allah akan mempamerkan nikmat-nikmat-Nya kepadanya. Dia mengenalinya. Lalu Allah bertanya: \"Apakah yang engkau lakukan dengan nikmat-nikmat tersebut?\" Dia menjawab: \"Aku mengkaji ilmu, mengajarkannya, dan membacakan Al-Quran untukmu.\" Allah berfirman: \"Engkau berdusta! Hakikatnya, engkau mengkaji ilmu untuk dikatakan sebagai seorang yang berilmu, dan membaca Al-Quran untuk dikatakan sebagai seorang yang pandai membaca. Dan itu telahpun terjadi!\" Kemudian dia diperintahkan agar dihempaskan ke muka hingga dilemparkan ke dalam neraka.  Dan seorang lelaki yang dimudahkan rezekinya oleh Allah dan dikurniakan harta sepenuh dunia. Dia akan dihadapkan, dan Allah akan mempamerkan nikmat-nikmat-Nya kepadanya. Dia mengenalinya. Lalu Allah bertanya: \"Apakah yang engkau lakukan dengan nikmat-nikmat tersebut?\" Dia menjawab: \"Aku tidak meninggalkan satu jalan pun yang engkau kehendaki untuk dibelanjakan, melainkan aku belanjakan untuk-Mu.\" Allah berfirman: \"Engkau berdusta! Hakikatnya, engkau melakukan sedemikian demi untuk dikatakan dermawan, dan itu telahpun terjadi!\" Kemudian dia diperintahkan agar dihempaskan ke muka hingga dilemparkan ke dalam neraka.\"  Hadis ini diriwayatkan oleh Muslim.",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِن أول النَّاس يقْضى عَلَيْهِ يَوْمَ الْقِيَامَةِ رَجُلٌ اسْتُشْهِدَ فَأُتِيَ بِهِ فَعَرَّفَهُ نِعَمَهُ فَعَرَفَهَا قَالَ فَمَا عَمِلْتَ فِيهَا؟ قَالَ قَاتَلْتُ فِيكَ حَتَّى اسْتُشْهِدْتُ قَالَ كَذَبْتَ وَلَكِنَّكَ قَاتَلْتَ لِأَنْ يُقَالَ جَرِيءٌ فَقَدْ قِيلَ ثُمَّ أَمر بِهِ فسحب على وَجهه حَتَّى ألقِي فِي النَّارِ وَرَجُلٌ تَعَلَّمَ الْعِلْمَ وَعَلَّمَهُ وَقَرَأَ الْقُرْآنَ فَأُتِيَ بِهِ فَعَرَّفَهُ نِعَمَهُ فَعَرَفَهَا قَالَ فَمَا عَمِلْتَ فِيهَا قَالَ تَعَلَّمْتُ الْعِلْمَ وَعَلَّمْتُهُ وَقَرَأْتُ فِيكَ الْقُرْآنَ قَالَ كَذَبْتَ وَلَكِنَّكَ تَعَلَّمْتَ الْعلم ليقال عَالِمٌ وَقَرَأْتَ الْقُرْآنَ لِيُقَالَ هُوَ قَارِئٌ فَقَدْ قِيلَ ثُمَّ أُمِرَ بِهِ فَسُحِبَ عَلَى وَجْهِهِ حَتَّى أُلْقِيَ فِي النَّارِ وَرَجُلٌ وَسَّعَ اللَّهُ عَلَيْهِ وَأَعْطَاهُ مِنْ أَصْنَافِ الْمَالِ كُلِّهِ فَأُتِيَ بِهِ فَعَرَّفَهُ نِعَمَهُ فَعَرَفَهَا قَالَ فَمَا عَمِلْتَ فِيهَا؟ قَالَ مَا تَرَكْتُ مِنْ سَبِيلٍ تُحِبُّ أَنْ يُنْفَقَ فِيهَا إِلَّا أَنْفَقْتُ فِيهَا لَكَ قَالَ كَذَبْتَ وَلَكِنَّكَ فَعَلْتَ لِيُقَالَ هُوَ جَوَادٌ فَقَدْ قِيلَ ثُمَّ أُمِرَ بِهِ فَسُحِبَ عَلَى وَجْهِهِ ثُمَّ أُلْقِيَ فِي النَّارِ» . رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 28900,
        "hadith_number": "206",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kehilangan Ilmu dan Kemunculan Orang Bodoh Sebagai Pemimpin",
        "perawi_melayu": "Abdullah bin Amr",
        "english_text": "And from ‘Abdullah bin ‘Amr, he said: The Messenger of Allah, peace and blessings be upon him, said: \"Indeed, Allah does not take away knowledge by snatching it from the slaves (of Allah). But He takes away knowledge by taking away the scholars. Until when there are no more scholars left, people take ignorant leaders, and they are asked for rulings and give fatwa without knowledge. Thus they stray and lead others astray.\"",
        "malay_translation": "Dan daripada ‘Abdullah bin ‘Amr, beliau berkata: Rasulullah SAW bersabda: \"Sesungguhnya Allah tidak mengambil ilmu dengan cara mencabutnya daripada hamba-hamba-Nya. Tetapi Dia mengambil ilmu dengan mengambil alih para ulama. Sehingga apabila tiada lagi ulama yang tinggal, manusia mengambil pemimpin yang jahil, dan mereka ditanya fatwa lalu mereka memberi fatwa tanpa ilmu. Maka mereka sesat dan menyesatkan orang lain.\"",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ لَا يَقْبِضُ الْعِلْمَ انْتِزَاعًا يَنْتَزِعُهُ مِنَ الْعِبَادِ وَلَكِنْ يَقْبِضُ الْعِلْمَ بِقَبْضِ الْعُلَمَاءِ حَتَّى إِذَا لَمْ يُبْقِ عَالِمًا اتَّخَذَ النَّاسُ رُءُوسًا جُهَّالًا فَسُئِلُوا فَأَفْتَوْا بِغَيْرِ عِلْمٍ فضلوا وأضلوا»"
      },
      {
        "id": 28901,
        "hadith_number": "207",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mengambil Berat dalam Memberi Nasihat Agar Tidak Membosankan",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Not Available",
        "malay_translation": "Daripada Shaqiq: Abdullah memberi peringatan kepada orang ramai pada setiap hari Khamis. Kemudian seorang lelaki berkata kepadanya, 'Wahai Abu Abd al-Rahman, saya ingin sekiranya anda memberi peringatan kepada kami setiap hari.' Dia berkata, 'Sesungguhnya, apa yang menghalang saya daripada berbuat demikian adalah kerana saya tidak suka membuat kamu bosan. Sesungguhnya, saya memilih waktu-waktu yang sesuai untuk memberi nasihat kepada kamu sebagaimana Rasulullah SAW memilih waktu-waktu yang sesuai untuk memberi nasihat kepada kami kerana takut kami bosan.'",
        "arabic_text": "وَعَن شَقِيق: كَانَ عبد الله يُذَكِّرُ النَّاسَ فِي كُلِّ خَمِيسٍ فَقَالَ لَهُ رَجُلٌ يَا أَبَا عَبْدِ الرَّحْمَنِ لَوَدِدْتُ أَنَّكَ ذكرتنا كُلِّ يَوْمٍ قَالَ أَمَا إِنَّهُ يَمْنَعُنِي مِنْ ذَلِكَ أَنِّي أَكْرَهُ أَنْ أُمِلَّكُمْ وَإِنِّي أَتَخَوَّلُكُمْ بِالْمَوْعِظَةِ كَمَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَخَوَّلُنَا بِهَا مَخَافَةَ السَّآمَةِ عَلَيْنَا"
      },
      {
        "id": 28902,
        "hadith_number": "208",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi Mengulangi Percakapan dan Salam Sebanyak Tiga Kali",
        "perawi_melayu": "Diriwayatkan daripada Anas RA",
        "english_text": "وعن أنس قال: كان النبي صلى الله عليه وسلم إذا تكلم بكلمة أعادها ثلاثا حتى تفهم عنه وإذا أتى على قوم فسلم عليهم سلم عليهم ثلاثا . رواه البخاري",
        "malay_translation": "Daripada Anas RA, beliau berkata: Adalah Nabi SAW apabila berbicara dengan sesuatu perkataan, baginda akan mengulanginya sebanyak tiga kali sehingga difahami. Dan apabila baginda mendatangi sesuatu kaum, baginda memberi salam kepada mereka sebanyak tiga kali. (Riwayat al-Bukhari)",
        "arabic_text": "وَعَنْ أَنَسٍ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا تَكَلَّمَ بِكَلِمَةٍ أَعَادَهَا ثَلَاثًا حَتَّى تُفْهَمَ عَنْهُ وَإِذَا أَتَى عَلَى قَوْمٍ فَسَلَّمَ عَلَيْهِمْ سَلَّمَ عَلَيْهِمْ ثَلَاثًا . رَوَاهُ الْبُخَارِيُّ"
      },
      {
        "id": 28903,
        "hadith_number": "209",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ganjaran Bagi Mereka Yang Menunjukkan Kebaikan",
        "perawi_melayu": "Abu Mas'ud al-Ansari",
        "english_text": "From Abu Mas'ud al-Ansari, he said: A man came to the Prophet (peace and blessings of Allah be upon him) and said, 'I am in need of help. Carry me.' The Prophet (peace and blessings of Allah be upon him) replied, 'I do not have the means.' Then a man said, 'O Messenger of Allah, I will guide him to someone who can carry him.' The Prophet (peace and blessings of Allah be upon him) said: 'Whoever guides to something good, he will receive a reward equal to the doer.' Narrated by Muslim",
        "malay_translation": "Daripada Abu Mas'ud al-Ansari, beliau berkata: Seorang lelaki datang kepada Nabi (sallallahu alaihi wasallam) dan berkata, 'Aku memerlukan pertolongan. Angkatlah aku.' Nabi (sallallahu alaihi wasallam) menjawab, 'Aku tidak mempunyai kemampuan.' Kemudian seorang lelaki berkata, 'Wahai Rasulullah, aku akan menunjukkan kepadanya orang yang boleh mengangkatnya.' Nabi (sallallahu alaihi wasallam) bersabda: 'Barangsiapa yang menunjukkan kebaikan, maka baginya pahala yang sama seperti pahala pelakunya.' Diriwayatkan oleh Muslim",
        "arabic_text": "عَن أبي مَسْعُود الْأَنْصَارِيِّ قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنِّي أُبْدِعَ بِي فَاحْمِلْنِي فَقَالَ مَا عِنْدِي فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَنَا أَدُلُّهُ عَلَى مَنْ يَحْمِلُهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ دَلَّ عَلَى خَيْرٍ فَلَهُ مثل أجر فَاعله» . رَوَاهُ مُسلم"
      },
      {
        "id": 28904,
        "hadith_number": "210",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Bersedekah dan Menyeru Kepada Kebaikan",
        "perawi_melayu": "Jarir",
        "english_text": "And from Jarir he said: (We were in the early part of the day with the Messenger of Allah, peace and blessings be upon him, when a group of people came, naked, wearing only shawls or cloaks, and girding swords, mostly from the tribe of Mudar, in fact, all of them were from Mudar. The face of the Messenger of Allah, peace and blessings be upon him, became troubled at what he saw in their poverty. Then he went inside, then came out, commanded Bilal to call the adhan and iqamah, prayed, then gave a sermon and said: (O people, fear your Lord who created you from a single soul,) until the end of the verse (Indeed, Allah was watchful over you). And the verse in the gathering (Fear Allah, and let every soul see what it has sent forward for the next day). A man donated from his dinar, from his dirham, from his garment, from his sa' of barley, from his sa' of dates, until he said, and even if it's a piece of a date. Then a man from the Ansar came with a bag, which almost his hands could not lift, or indeed it was too heavy. Then people followed one another, until I saw two mountains of food and clothing. Until I saw the face of the Messenger of Allah, peace and blessings be upon him, shining brightly, as if it were radiant. Then the Messenger of Allah, peace and blessings be upon him, said: \"Whoever innovates in Islam a good innovation, then he will have its reward and the reward of those who acted upon it after him, without diminishing their rewards in any way. And whoever innovates in Islam a bad innovation, then he will bear its burden and the burden of those who acted upon it after him, without diminishing their sins in any way.\". Narrated by Muslim",
        "malay_translation": "Daripada Jarir, dia berkata: (Kami berada pada awal hari bersama Rasulullah SAW, lalu datang sekumpulan orang, telanjang, hanya memakai selendang atau jubah, dan memakai pedang, kebanyakan dari kaum Mudar, bahkan semuanya dari kaum Mudar. Wajah Rasulullah SAW menjadi resah melihat kemiskinan mereka. Kemudian baginda masuk, kemudian keluar, memerintahkan Bilal untuk mengumandangkan azan dan iqamah, menunaikan solat, kemudian menyampaikan khutbah dan bersabda: (Wahai umat manusia, takutlah kepada Tuhanmu yang telah menciptakan kamu daripada satu jiwa), sehingga akhir ayat (Sesungguhnya Allah sentiasa mengawasi kamu). Dan ayat dalam perhimpunan (Takutlah kepada Allah dan setiap jiwa hendaklah melihat apa yang telah dipersiapkannya untuk hari esok). Seseorang mendermakan daripada dinarnya, dirhamnya, pakaiannya, satu sa' barlinya, satu sa' kurmanya, sehingga ia berkata, dan walaupun hanya seketul kurma. Kemudian seorang lelaki dari kalangan Ansar datang membawa beg yang hampir tidak mampu diangkat tangannya, atau bahkan terlalu berat. Kemudian orang ramai mengikut satu sama lain, sehingga aku melihat dua gunung makanan dan pakaian. Sehingga aku melihat wajah Rasulullah SAW bersinar terang, seakan-akan bercahaya. Kemudian Rasulullah SAW bersabda: \"Barangsiapa yang memperkenalkan sunnah yang baik dalam Islam, maka dia akan mendapat pahalanya dan pahala orang yang mengikutinya selepasnya tanpa mengurangkan sedikit pun pahala mereka. Dan barangsiapa yang memperkenalkan sunnah yang buruk dalam Islam, maka dia akan memikul bebannya dan beban orang yang mengikutinya selepasnya tanpa mengurangkan dosa mereka sedikit pun.\". Diriwayatkan oleh Muslim",
        "arabic_text": "وَعَن جرير قَالَ: (كُنَّا فِي صدر النهارعند رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَاءَهُ قَوْمٌ عُرَاةٌ مُجْتَابِي النِّمَارِ أَوِ الْعَبَاءِ مُتَقَلِّدِي السُّيُوفِ عَامَّتُهُمْ مِنْ مُضَرَ بَلْ كُلُّهُمْ مِنْ مُضَرَ فَتَمَعَّرَ وَجْهُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِمَا رَأَى بِهِمْ مِنَ الْفَاقَةِ فَدَخَلَ ثُمَّ خَرَجَ فَأَمَرَ بِلَالًا فَأَذَّنَ وَأَقَامَ فَصَلَّى ثُمَّ خَطَبَ فَقَالَ: (يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ مِنْ نَفْسٍ وَاحِدَةٍ) إِلَى آخَرِ الْآيَةِ (إِنَّ اللَّهَ كَانَ عَلَيْكُمْ رقيبا) وَالْآيَةُ الَّتِي فِي الْحَشْرِ (اتَّقُوا اللَّهَ وَلْتَنْظُرْ نَفْسٌ مَا قَدَّمَتْ لِغَدٍ) تَصَدَّقَ رَجُلٌ مِنْ دِينَارِهِ مِنْ دِرْهَمِهِ مِنْ ثَوْبِهِ مِنْ صَاعِ بُرِّهِ مِنْ صَاعِ تَمْرِهِ حَتَّى قَالَ وَلَوْ بِشِقِّ تَمْرَةٍ قَالَ فَجَاءَ رَجُلٌ مِنَ الْأَنْصَارِ بِصُرَّةٍ كَادَتْ كَفُّهُ تَعْجَزُ عَنْهَا بل قد عجزت قَالَ ثُمَّ تَتَابَعَ النَّاسُ حَتَّى رَأَيْتُ كَوْمَيْنِ مِنْ طَعَامٍ وَثِيَابٍ حَتَّى رَأَيْتُ وَجْهُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَهَلَّلُ كَأَنَّهُ مُذْهَبَةٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ سَنَّ فِي الْإِسْلَامِ سُنَّةً حَسَنَةً فَلَهُ أَجْرُهَا وَأَجْرُ مَنْ عَمِلَ بِهَا مِنْ بَعْدِهِ مِنْ غَيْرِ أَنْ يَنْقُصَ مِنْ أُجُورِهِمْ شَيْءٌ وَمَنْ سَنَّ فِي الْإِسْلَامِ سُنَّةً سَيِّئَةً كَانَ عَلَيْهِ وِزْرُهَا وَوِزْرُ مَنْ عَمِلَ بِهَا مِنْ بَعْدِهِ مِنْ غَيْرِ أَنْ يَنْقُصَ مِنْ أَوْزَارِهِمْ شَيْء» . رَوَاهُ مُسلم"
      },
      {
        "id": 28905,
        "hadith_number": "211",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Dosa Pembunuhan: Tanggungjawab Anak Adam Pertama",
        "perawi_melayu": "Ibnu Mas'ud",
        "english_text": "Narrated Ibn Mas'ud: The Prophet (ﷺ) said: \"No soul is unjustly killed, but there is a share of its blood on the first son of Adam, because he was the first to establish killing.\"",
        "malay_translation": "Daripada Ibnu Mas'ud berkata: Rasulullah ﷺ bersabda: \"Tiada satu jiwa pun dibunuh secara zalim, melainkan ada ke atas anak Adam yang pertama (Qabil) suatu bahagian daripada darahnya, kerana dialah orang pertama yang memulakan pembunuhan.\"",
        "arabic_text": "وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تُقْتَلُ نَفْسٌ ظُلْمًا إِلَّا كَانَ عَلَى ابْنِ آدَمَ الْأَوَّلِ كِفْلٌ مِنْ دَمِهَا لِأَنَّهُ أَوَّلُ مَنْ سَنَّ الْقَتْلَ» . وَسَنَذْكُرُ حَدِيثَ مُعَاوِيَةَ: «لَا يَزَالُ مِنْ أُمَّتِي» فِي بَابِ ثَوَابِ هَذِهِ الْأُمَّةِ إِنْ شَاءَ الله تَعَالَى"
      },
      {
        "id": 28906,
        "hadith_number": "212",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Menuntut Ilmu: Jalan ke Syurga dan Warisan Para Nabi",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Diriwayatkan dari Kathir bin Qais, beliau berkata: “Saya sedang duduk bersama Abu Darda’ di masjid Damsyik, lalu datang seorang lelaki kepadanya dan berkata: “Wahai Abu Darda’, sesungguhnya aku datang kepadamu dari kota Rasulullah SAW, aku datang bukan kerana sesuatu keperluan.” Abu Darda’ berkata: “Sesungguhnya aku mendengar Rasulullah SAW bersabda: “Sesiapa yang menempuh jalan untuk mencari ilmu, maka Allah akan memudahkan baginya jalan menuju syurga. Sesungguhnya para malaikat merendahkan sayap mereka sebagai tanda redha kepada penuntut ilmu. Sesungguhnya orang yang berilmu akan dimohonkan ampun oleh semua yang ada di langit dan di bumi, bahkan ikan-ikan di dalam air. Sesungguhnya keutamaan orang yang berilmu atas ahli ibadah adalah seperti keutamaan bulan purnama atas seluruh bintang. Sesungguhnya para ulama adalah pewaris para nabi, dan sesungguhnya para nabi tidak mewariskan dinar dan dirham, tetapi mereka mewariskan ilmu. Maka sesiapa yang mengambilnya, maka dia telah mengambil bahagian yang banyak.” Riwayat Ahmad, Tirmizi, Abu Daud, Ibnu Majah dan Darimi. Tirmizi menamakannya Qais bin Kathir.",
        "arabic_text": "عَن كثير بن قيس قَالَ كُنْتُ جَالِسًا مَعَ أَبِي الدَّرْدَاءِ فِي مَسْجِد دمشق فَجَاءَهُ رَجُلٌ فَقَالَ يَا أَبَا الدَّرْدَاءِ إِنِّي جِئْتُكَ مِنْ مَدِينَةِ الرَّسُولِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا جِئْتُ لِحَاجَةٍ قَالَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ سَلَكَ طَرِيقًا يَطْلُبُ فِيهِ عِلْمًا سَلَكَ اللَّهُ بِهِ طَرِيقًا مِنْ طُرُقِ الْجَنَّةِ وَإِنَّ الْمَلَائِكَةَ لَتَضَعُ أَجْنِحَتَهَا رِضًا لِطَالِبِ الْعِلْمِ وَإِنَّ الْعَالِمَ يسْتَغْفر لَهُ من فِي السَّمَوَات وَمَنْ فِي الْأَرْضِ وَالْحِيتَانُ فِي جَوْفِ الْمَاءِ وَإِنَّ فَضْلَ الْعَالِمِ عَلَى الْعَابِدِ كَفَضْلِ الْقَمَرِ لَيْلَةَ الْبَدْرِ عَلَى سَائِرِ الْكَوَاكِبِ وَإِنَّ الْعُلَمَاءَ وَرَثَةُ الْأَنْبِيَاءِ وَإِنَّ الْأَنْبِيَاءَ لَمْ يُوَرِّثُوا دِينَارًا وَلَا دِرْهَمًا وَإِنَّمَا وَرَّثُوا الْعِلْمَ فَمَنْ أَخَذَهُ أَخَذَ بِحَظٍّ وَافِرٍ . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ وَسَمَّاهُ التِّرْمِذِيُّ قَيْسَ بن كثير"
      },
      {
        "id": 28907,
        "hadith_number": "213",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Orang Berilmu ke atas Ahli Ibadah",
        "perawi_melayu": "Diriwayatkan daripada Abi Umamah al-Bahili",
        "english_text": "Concerning Abi Umamah al-Bahili, he said: Two men were mentioned to the Messenger of Allah (peace and blessings of Allah be upon him), one of them a worshipper and the other a scholar. The Messenger of Allah (peace and blessings of Allah be upon him) said: “The superiority of the scholar over the worshipper is like my superiority over the least of you.” Then the Messenger of Allah (peace and blessings of Allah be upon him) said: “Indeed, Allah, His angels, the inhabitants of the heavens and the earth, even the ant in its hole and even the fish, send blessings upon the one who teaches people good.” Related by al-Tirmidhi, who said it is hasan gharib.",
        "malay_translation": "Daripada Abi Umamah al-Bahili berkata: Dua orang lelaki disebut di hadapan Rasulullah SAW, seorang daripadanya ahli ibadah dan seorang lagi seorang yang berilmu. Rasulullah SAW bersabda: \"Keutamaan seorang yang berilmu ke atas seorang ahli ibadah adalah seperti keutamaanku ke atas orang yang paling rendah di antara kamu.\" Kemudian Rasulullah SAW bersabda: \"Sesungguhnya Allah, para Malaikat-Nya, penduduk langit dan bumi, sehingga semut di dalam lubangnya dan juga ikan, benar-benar berselawat ke atas orang yang mengajarkan kebaikan kepada manusia.\" Riwayat Tirmizi dan beliau mengatakan ia adalah hasan gharib.",
        "arabic_text": "وَعَن أبي أُمَامَة الْبَاهِلِيّ قَالَ: ذُكِرَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلَانِ أَحَدُهُمَا عَابِدٌ وَالْآخَرُ عَالِمٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «فَضْلُ الْعَالِمِ عَلَى الْعَابِدِ كَفَضْلِي عَلَى أَدْنَاكُمْ» ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ وَمَلَائِكَتَهُ وَأَهْلَ السَّمَاوَاتِ وَالْأَرْضِ حَتَّى النَّمْلَةَ فِي جُحْرِهَا وَحَتَّى الْحُوتَ لَيُصَلُّونَ عَلَى معلم النَّاس الْخَيْر» . رَوَاهُ التِّرْمِذِيّ وَقَالَ حسن غَرِيب"
      },
      {
        "id": 28908,
        "hadith_number": "214",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Orang Berilmu Berbanding Orang Beribadah",
        "perawi_melayu": null,
        "english_text": null,
        "malay_translation": "Dan ia diriwayatkan oleh al-Daraimi daripada Makhul sebagai mursal, dan tidak menyebut: dua orang lelaki. Dan beliau berkata: Keutamaan seorang alim atas seorang ahli ibadah adalah seperti keutamaan saya atas kamu yang paling rendah. Kemudian beliau membacakan ayat ini: (Sesungguhnya yang takut kepada Allah daripada hamba-hamba-Nya hanyalah orang-orang yang berilmu). Dan dikisahkan hadis ini sehingga akhirnya.",
        "arabic_text": "وَرَوَاهُ الدَّارِمِيُّ عَنْ مَكْحُولٍ مُرْسَلًا وَلَمْ يَذْكُرْ: رَجُلَانِ وَقَالَ: فَضْلُ الْعَالِمِ عَلَى الْعَابِدِ كَفَضْلِي عَلَى أَدْنَاكُمْ ثُمَّ تَلَا هَذِهِ الْآيَةَ: (إِنَّمَا يخْشَى الله من عباده الْعلمَاء) وسرد الحَدِيث إِلَى آخِره"
      },
      {
        "id": 28909,
        "hadith_number": "215",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Orang-orang adalah pengikut kamu, dan akan datang orang-orang dari berbagai penjuru bumi untuk mempelajari agama, maka berilah kebaikan kepada mereka",
        "perawi_melayu": "Abu Said al-Khudri",
        "english_text": "From Abu Sa'id al-Khudri, he said: The Messenger of Allah, peace be upon him, said: \"Indeed, people are followers of you, and indeed, men will come to you from the farthest corners of the earth seeking knowledge of the religion.  When they come to you, treat them with kindness.",
        "malay_translation": "Dari Abu Said al-Khudri, dia berkata: Rasulullah SAW bersabda: \"Sesungguhnya manusia adalah pengikut kamu, dan sesungguhnya akan datang beberapa orang dari berbagai penjuru bumi untuk mempelajari agama. Apabila mereka datang kepadamu, maka berilah kebaikan kepada mereka.\"",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ النَّاسَ لَكُمْ تَبَعٌ وَإِنَّ رِجَالًا يَأْتُونَكُمْ مِنْ أَقْطَارِ الْأَرْضِ يَتَفَقَّهُونَ فِي الدِّينِ فَإِذَا أَتَوْكُمْ فَاسْتَوْصُوا بهم خيرا» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 28910,
        "hadith_number": "216",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Mengamalkan Perkataan Hikmah",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "And from Abu Hurairah رضي الله عنه, he said: The Messenger of Allah صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ said: \"The word of wisdom is the lost property of the wise. Whoever finds it, has the greatest right to it.\"",
        "malay_translation": "Dan daripada Abu Hurairah رضي الله عنه, beliau berkata: Rasulullah صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ bersabda: \"Perkataan hikmah adalah harta yang hilang bagi orang yang bijaksana. Barangsiapa yang menjumpainya, maka dialah yang paling berhak kepadanya.\"",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْكَلِمَةُ الْحِكْمَةُ ضَالَّةُ الْحَكِيمِ فَحَيْثُ وَجَدَهَا فَهُوَ أَحَقُّ بِهَا» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ هَذَا حَدِيثٌ غَرِيبٌ وَإِبْرَاهِيمُ بْنُ الْفَضْلِ الرَّاوِي يضعف فِي الحَدِيث"
      },
      {
        "id": 28911,
        "hadith_number": "217",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Ahli Fiqh",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "And from Ibn Abbas, he said: The Messenger of Allah, peace and blessings be upon him, said: \"One faqih (ahli fiqh) is more difficult on the Shaytan than a thousand worshippers.\"",
        "malay_translation": "Dan daripada Ibn Abbas, beliau berkata: Rasulullah SAW bersabda, \"Seorang faqih (ahli fiqh) adalah lebih sukar untuk syaitan daripada seribu orang yang beribadah.\"  ",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «فَقِيهٌ وَاحِدٌ أَشَدُّ عَلَى الشَّيْطَانِ مِنْ أَلْفِ عَابِدٍ» . رَوَاهُ التِّرْمِذِيُّ وَابْن مَاجَه)"
      },
      {
        "id": 28912,
        "hadith_number": "218",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kewajipan Menuntut Ilmu bagi Setiap Muslim",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "From Anas bin Malik, who said that the Messenger of Allah (peace and blessings be upon him) said: \"Seeking knowledge is an obligation upon every Muslim. And the one who imparts knowledge to those who are not worthy of it is like someone who decorates pigs with jewels, pearls and gold.\"",
        "malay_translation": "Daripada Anas bin Malik, dia berkata bahawa Rasulullah SAW bersabda: \"Menuntut ilmu adalah suatu kewajipan ke atas setiap Muslim. Dan sesiapa yang menyampaikan ilmu kepada mereka yang tidak layak menerimanya adalah seperti orang yang menghiasi babi dengan permata, mutiara dan emas.\"",
        "arabic_text": "وَعَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «طَلَبُ الْعِلْمِ فَرِيضَةٌ عَلَى كُلِّ مُسْلِمٍ وَوَاضِعُ الْعِلْمِ عِنْدَ غير أَهله كمقلد الْخَنَازِير الْجَوْهَر واللؤلؤ وَالذَّهَبَ» . رَوَاهُ ابْنُ مَاجَهْ وَرَوَى الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ إِلَى قَوْلِهِ مُسْلِمٍ. وَقَالَ: هَذَا حَدِيثٌ مَتْنُهُ مَشْهُورٌ وَإِسْنَادُهُ ضَعِيفٌ وَقَدْ رُوِيَ من أوجه كلهَا ضَعِيف"
      },
      {
        "id": 28913,
        "hadith_number": "219",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Dua Sifat yang Tidak Dapat Bertemu dalam Diri Seorang Munafik",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Daripada Abu Hurairah, dia berkata: Rasulullah SAW bersabda: Dua sifat tidak dapat ditemui bersama dalam diri seorang munafik: Ketampanan dan pemahaman agama.",
        "malay_translation": "Daripada Abu Hurairah, beliau berkata: Rasulullah SAW bersabda, “Dua sifat tidak dapat wujud bersama-sama dalam diri seorang munafik: Keelokan rupa dan kefahaman agama.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: خَصْلَتَانِ لَا تَجْتَمِعَانِ فِي مُنَافِقٍ: حُسْنُ سَمْتٍ وَلَا فِقْهٌ فِي الدّين . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 28914,
        "hadith_number": "220",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mencari Ilmu di Jalan Allah",
        "perawi_melayu": null,
        "english_text": null,
        "malay_translation": "Dan daripada Anas, dia berkata: Rasulullah SAW bersabda, \"Sesiapa yang keluar untuk mencari ilmu, maka sesungguhnya dia berada di jalan Allah sehingga dia kembali.\"  Riwayat Imam Tirmizi dan al-Darimi.",
        "arabic_text": "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ خَرَجَ فِي طَلَبِ الْعِلْمِ فَهُوَ فِي سَبِيلِ اللَّهِ حَتَّى يرجع» . رَوَاهُ التِّرْمِذِيّ والدارمي"
      },
      {
        "id": 28915,
        "hadith_number": "221",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mencari Ilmu Sebagai Penebus Dosa Masa Lalu",
        "perawi_melayu": "Sakhrah al-Azdi",
        "english_text": "From Sakhrah al-Azdi, he said: The Messenger of Allah (peace and blessings be upon him) said, \"Seeking knowledge is expiation for past sins.\"",
        "malay_translation": "Daripada Sakhrah al-Azdi, dia berkata: Rasulullah SAW bersabda, \"Mencari ilmu adalah penebus dosa-dosa yang lalu.\"",
        "arabic_text": "وَعَن سَخْبَرَة الْأَزْدِيّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مِنْ طَلَبَ الْعِلْمَ كَانَ كَفَّارَةً لِمَا مَضَى» . رَوَاهُ التِّرْمِذِيُّ وَالدَّارِمِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ ضَعِيفُ الْإِسْنَادِ وَأَبُو دَاوُدَ الرَّاوِي يُضَعَّفُ"
      },
      {
        "id": 28916,
        "hadith_number": "222",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ketidakpuasan Seorang Mukmin Terhadap Kebaikan",
        "perawi_melayu": "Abi Said al-Khudri",
        "english_text": "Daripada Abi Said al-Khudri, dia berkata: Rasulullah SAW bersabda, \"Seorang mukmin tidak akan merasa kenyang daripada kebaikan yang didengarnya sehingga akhirnya ia sampai ke Syurga.\"",
        "malay_translation": "Daripada Abu Said al-Khudri, beliau berkata: Rasulullah SAW bersabda, \"Seorang mukmin tidak akan merasa kenyang daripada kebaikan yang didengarnya sehingga ia sampai ke Syurga.\"",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَنْ يَشْبَعَ الْمُؤْمِنُ مِنْ خَيْرٍ يَسْمَعُهُ حَتَّى يَكُونَ مُنْتَهَاهُ الْجنَّة» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 28917,
        "hadith_number": "223",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menyembunyikan Ilmu",
        "perawi_melayu": "Abu Hurairah r.a.",
        "english_text": "Daripada Abu Hurairah r.a. yang meriwayatkan bahawa Rasulullah SAW bersabda: \"Sesiapa yang ditanya tentang suatu ilmu yang diketahuinya, kemudian menyembunyikannya, maka dia akan diikat pada hari kiamat dengan tali temali daripada api neraka.\"",
        "malay_translation": "Daripada Abu Hurairah r.a., beliau meriwayatkan bahawa Rasulullah SAW bersabda, \"Sesiapa yang ditanya tentang ilmu yang diketahuinya, kemudian menyembunyikannya, maka dia akan diikat pada hari kiamat dengan tali temali daripada api neraka.\" Diriwayatkan oleh Ahmad, Abu Daud, dan Al-Tirmizi.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «من سُئِلَ عَنْ عِلْمٍ عَلِمَهُ ثُمَّ كَتَمَهُ أُلْجِمَ يَوْمَ الْقِيَامَةِ بِلِجَامٍ مِنْ نَارٍ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُد وَالتِّرْمِذِيّ"
      },
      {
        "id": 28918,
        "hadith_number": "224",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis yang diriwayatkan oleh Anas tentang...",
        "perawi_melayu": "Ibn Majah",
        "english_text": "This Hadith is reported by Ibn Majah from Anas.",
        "malay_translation": "Hadis ini diriwayatkan oleh Ibn Majah daripada Anas.",
        "arabic_text": "وَرَوَاهُ ابْن مَاجَه عَن أنس"
      },
      {
        "id": 28919,
        "hadith_number": "225",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menuntut Ilmu untuk Berlawan dengan Ulama atau Mengejek Orang Bodoh",
        "perawi_melayu": "Ka'ab bin Malik",
        "english_text": "Dari Ka'ab bin Malik, dia berkata: Rasulullah SAW bersabda, \"Barangsiapa yang menuntut ilmu untuk menyaingi para ulama, atau untuk berbantah dengan orang bodoh, atau untuk menarik perhatian orang ramai kepadanya, maka Allah akan memasukkannya ke dalam neraka.\"",
        "malay_translation": "Daripada Ka'ab bin Malik, beliau berkata: Rasulullah SAW bersabda, \"Barangsiapa yang menuntut ilmu untuk menyaingi para ulama, atau untuk berbantah dengan orang-orang yang bodoh, atau untuk menarik perhatian orang ramai kepadanya, maka Allah akan memasukkannya ke dalam neraka.\"  Hadis riwayat Imam Tirmizi.",
        "arabic_text": "وَعَنْ كَعْبِ بْنِ مَالِكٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ طَلَبَ الْعِلْمَ لِيُجَارِيَ بِهِ الْعُلَمَاءَ أَوْ لِيُمَارِيَ بِهِ السُّفَهَاءَ أَوْ يصرف بِهِ وُجُوه النَّاس إِلَيْهِ أَدخل الله النَّار» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 28920,
        "hadith_number": "226",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis Mengenai Perihal...",
        "perawi_melayu": "Ibnu Umar",
        "english_text": "Ini adalah teks yang telah diterjemahkan.  Silakan berikan teks dalam bahasa Inggeris untuk terjemahan.",
        "malay_translation": "Dan ia diriwayatkan oleh Ibnu Majah daripada Ibnu Umar.",
        "arabic_text": "وَرَوَاهُ ابْن مَاجَه عَن ابْن عمر"
      },
      {
        "id": 28921,
        "hadith_number": "227",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Ilmu yang Dicari Keredhaan Allah",
        "perawi_melayu": "Abu Hurairah radhiyallahu 'anhu",
        "english_text": "Daripada Abu Hurairah radhiyallahu 'anhu, dia berkata: Rasulullah SAW bersabda, \"Sesiapa yang mengkaji ilmu yang dicari untuk keredhaan Allah, dan tidak mempelajarinya melainkan untuk meraih sesuatu yang bersifat duniawi, dia tidak akan mencium bau syurga pada hari kiamat.\" (Maksudnya, dia tidak akan merasa baunya.) Diriwayatkan oleh Ahmad dan Abu Dawud dan Ibn Majah.",
        "malay_translation": "Daripada Abu Hurairah radhiyallahu 'anhu, beliau berkata: Rasulullah SAW bersabda, \"Sesiapa yang mempelajari ilmu dengan tujuan mencari keredhaan Allah, dan tidak mempelajarinya melainkan untuk mendapatkan keuntungan duniawi, dia tidak akan mencium bau syurga pada hari kiamat.\"  (Maksudnya, dia tidak akan merasakan wanginya.)  Hadis ini diriwayatkan oleh Imam Ahmad, Imam Abu Dawud, dan Imam Ibn Majah.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ تَعَلَّمَ عِلْمًا مِمَّا يُبْتَغَى بِهِ وَجْهُ اللَّهِ لَا يَتَعَلَّمُهُ إِلَّا لِيُصِيبَ بِهِ عَرَضًا مِنَ الدُّنْيَا لَمْ يَجِدْ عَرْفَ الْجَنَّةِ يَوْمَ الْقِيَامَةِ» يَعْنِي رِيحَهَا. رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَابْن مَاجَه"
      },
      {
        "id": 28922,
        "hadith_number": "228",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kebaikan Mendengar, Menghafal, dan Menyampaikan Hadith",
        "perawi_melayu": "Ibnu Mas'ud",
        "english_text": "Narrated by Ibn Mas'ud: The Prophet (peace and blessings of Allah be upon him) said: \"May Allah make fresh the face of a man who hears a saying from us, so he understands it, memorizes it, and conveys it. Perhaps the one who conveys knowledge is not a man of understanding, and perhaps the one who conveys knowledge conveys it to someone who understands it better than he does. There are three things that do not allow the heart of a Muslim to be treacherous: sincerity in deeds for Allah, giving advice to Muslims, and sticking to their community, for their call encompasses those who are behind them.\" (Reported by ash-Shafi'i and al-Baihaqi in al-Madkhal).",
        "malay_translation": "Diriwayatkan daripada Ibnu Mas'ud, beliau berkata: Rasulullah SAW bersabda: \"Semoga Allah memuliakan (mencerahkan) wajah seseorang yang mendengar ucapan daripada kami, lalu dia memahaminya, menghafalnya, dan menyampaikannya. Mungkin orang yang menyampaikan ilmu tidak memahami (sepenuhnya), dan mungkin orang yang menyampaikan ilmu menyampaikannya kepada orang yang lebih memahaminya daripada dirinya. Tiga perkara yang tidak membolehkan hati seorang Muslim melakukan pengkhianatan: keikhlasan dalam amal kepada Allah, memberi nasihat kepada kaum Muslimin, dan berpegang teguh dengan jamaah mereka, kerana doa mereka meliputi mereka yang berada di belakang.\" (Diriwayatkan oleh ash-Shafi'i dan al-Baihaqi dalam al-Madkhal).",
        "arabic_text": "وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نَضَّرَ اللَّهُ عَبْدًا سَمِعَ مَقَالَتِي فَحَفِظَهَا وَوَعَاهَا وَأَدَّاهَا فَرُبَّ حَامِلِ فِقْهٍ غَيْرِ فَقِيهٍ وَرُبَّ حَامِلِ فِقْهٍ إِلَى مَنْ هُوَ أَفْقَهُ مِنْهُ. ثَلَاثٌ لَا يَغِلُّ عَلَيْهِنَّ قَلْبُ مُسْلِمٍ إِخْلَاصُ الْعَمَلِ لِلَّهِ وَالنَّصِيحَةُ لِلْمُسْلِمِينَ وَلُزُومُ جَمَاعَتِهِمْ فَإِنَّ دَعْوَتَهُمْ تُحِيطُ مِنْ ورائهم» . رَوَاهُ الشَّافِعِي وَالْبَيْهَقِيّ فِي الْمدْخل"
      },
      {
        "id": 28923,
        "hadith_number": "229",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis tentang Tiga Perkara yang Tidak Akan Ditimpa Kerugian",
        "perawi_melayu": "Zayd bin Tsabit",
        "english_text": "Hadith ini diriwayatkan oleh Ahmad, Tirmizi, Abu Dawud, Ibn Majah, dan Darimi dari Zayd bin Tsabit. Hanya Tirmizi dan Abu Dawud tidak menyebut tentang \"tiga perkara yang tidak akan ditimpa kerugian\" (dan seterusnya).",
        "malay_translation": "Hadis ini diriwayatkan oleh Imam Ahmad, Imam Tirmizi, Imam Abu Dawud, Imam Ibn Majah, dan Imam Darimi daripada Zayd bin Tsabit. Hanya Imam Tirmizi dan Imam Abu Dawud tidak menyebut tentang tiga perkara yang tidak akan ditimpa kerugian (dan seterusnya).",
        "arabic_text": "وَرَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ عَنْ زَيْدِ بْنِ ثَابِتٍ. إِلَّا أَنَّ التِّرْمِذِيّ وَأَبا دواد لَمْ يَذْكُرَا: «ثَلَاثٌ لَا يَغِلُّ عَلَيْهِنَّ» . إِلَى آخِره"
      },
      {
        "id": 28924,
        "hadith_number": "230",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Mengingati dan Menyampaikan Hadis",
        "perawi_melayu": "Ibnu Mas'ud",
        "english_text": "From Ibn Mas'ud, he said: I heard the Messenger of Allah (peace and blessings be upon him) say, \"May Allah bless the person who hears something from us and conveys it as he heard it. For often, the one who conveys it understands it more than the one who heard it.\"  Narrated by at-Tirmidhi and Ibn Majah",
        "malay_translation": "Daripada Ibnu Mas'ud, beliau berkata: Aku mendengar Rasulullah SAW bersabda, \"Semoga Allah merahmati seseorang yang mendengar sesuatu daripada kita dan menyampaikannya sebagaimana dia mendengarnya. Kerana kadangkala, orang yang menyampaikannya lebih faham daripada orang yang mendengarnya.\"  Riwayat Imam at-Tirmidhi dan Ibn Majah",
        "arabic_text": "وَعَن ابْن مَسْعُودٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «نَضَّرَ اللَّهُ امْرَأً سَمِعَ مِنَّا شَيْئًا فَبَلَّغَهُ كَمَا سَمِعَهُ فَرُبَّ مُبَلَّغٍ أَوْعَى لَهُ مِنْ سَامِعٍ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ"
      },
      {
        "id": 28925,
        "hadith_number": "231",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis daripada Abu Darda' - Keutamaan Mengutamakan Kebenaran",
        "perawi_melayu": "Abu Darda'",
        "english_text": "Dari Abu Darda',",
        "malay_translation": "Daripada Abu Darda',.",
        "arabic_text": "وَرَوَاهُ الدَّارمِيّ عَن أبي الدَّرْدَاء"
      },
      {
        "id": 28926,
        "hadith_number": "232",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menghindari Hadis Palsu Dari Rasulullah SAW",
        "perawi_melayu": "Ibn Abbas RA",
        "english_text": "And from Ibn Abbas, may Allah be pleased with him, he said: The Messenger of Allah, peace and blessings be upon him, said, \"Be cautious of narrating hadiths about me unless you know them. Whoever deliberately lies about me, let him take his place in the Fire.\"",
        "malay_translation": "Dan daripada Ibn Abbas, semoga Allah meridainya, beliau berkata: Rasulullah SAW bersabda, \"Berhati-hatilah dalam menceritakan hadis tentangku kecuali jika kamu mengetahuinya. Barangsiapa yang sengaja berdusta tentangku, maka hendaklah dia menempati tempatnya di neraka.\" ",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اتَّقُوا الْحَدِيثَ عَنِّي إِلَّا مَا عَلِمْتُمْ فَمَنْ كَذَبَ عَلَيَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 28927,
        "hadith_number": "233",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mengingati Hadis dengan Ilmunya",
        "perawi_melayu": "Ibnu Mas'ud dan Jabir",
        "english_text": "dan dia meriwayatkannya Ibnu Majah daripada Ibnu Mas'ud dan Jabir, dan dia tidak menyebut: \"Bertaqwalah terhadap hadis daripadaku melainkan apa yang kamu ketahui.\"",
        "malay_translation": "Dan ia diriwayatkan oleh Ibnu Majah daripada Ibnu Mas'ud dan Jabir, dan tidak disebut: \"Jagalah diri kamu daripada hadis daripadaKu melainkan yang kamu ketahui.\"",
        "arabic_text": "وَرَوَاهُ ابْنُ مَاجَهْ عَنِ ابْنِ مَسْعُودٍ وَجَابِرٍ وَلَمْ يَذْكُرِ: «اتَّقُوا الْحَدِيثَ عَنِّي إِلَّا مَا علمْتُم»"
      },
      {
        "id": 28928,
        "hadith_number": "234",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menghukum Al-Quran dengan Pendapat Sendiri",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "Daripada Ibnu Abbas r.a. berkata, Rasulullah SAW bersabda: \"Barangsiapa yang menghukumkan Al-Quran dengan pendapatnya sendiri, maka hendaklah dia menyediakan tempatnya di dalam neraka.\" Dan dalam satu riwayat, \"Barangsiapa yang bercakap mengenai Al-Quran tanpa ilmu, maka hendaklah dia menyediakan tempatnya di dalam neraka.\" Diriwayatkan oleh Imam Tirmidzi.",
        "malay_translation": "Daripada Ibnu Abbas r.a. berkata, Rasulullah SAW bersabda:  “Barangsiapa yang menghukumkan Al-Quran dengan pendapatnya sendiri, maka hendaklah dia menyediakan tempatnya di dalam neraka.” Dan dalam satu riwayat, “Barangsiapa yang bercakap mengenai Al-Quran tanpa ilmu, maka hendaklah dia menyediakan tempatnya di dalam neraka.”  Hadis ini diriwayatkan oleh Imam Tirmidzi.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَالَ فِي الْقُرْآنِ بِرَأْيِهِ فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ» . وَفِي رِوَايَةٍ: «مَنْ قَالَ فِي الْقُرْآنِ بِغَيْرِ عِلْمٍ فَليَتَبَوَّأ مَقْعَده من النَّار» رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 28929,
        "hadith_number": "235",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menafsirkan Al-Quran dengan Pendapat Sendiri",
        "perawi_melayu": "Diriwayatkan daripada Jundub RA, bahawa Rasulullah SAW bersabda:",
        "english_text": "Not Available",
        "malay_translation": "\"Sesiapa yang berkata tentang Al-Quran dengan pendapatnya sendiri, lalu ia benar, maka sesungguhnya dia telah melakukan kesalahan.\" (Riwayat Tirmidzi dan Abu Daud)",
        "arabic_text": "وَعَنْ جُنْدُبٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَالَ فِي الْقُرْآنِ بِرَأْيِهِ فَأَصَابَ فقد أَخطَأ» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد"
      },
      {
        "id": 28930,
        "hadith_number": "236",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pertikaian dalam Al-Quran Merupakan Kufur",
        "perawi_melayu": "Abi Hurairah radhiyallahu 'anhu",
        "english_text": "Dari Abi Hurairah RA, Rasulullah SAW bersabda: \"Perselisihan (perdebatan) tentang Al-Quran adalah kufur.\"",
        "malay_translation": "Daripada Abi Hurairah radhiyallahu 'anhu, Rasulullah SAW bersabda: \"Perdebatan tentang Al-Quran adalah kufur.\"",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْمِرَاءُ فِي الْقُرْآنِ كُفْرٌ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُد"
      },
      {
        "id": 28931,
        "hadith_number": "237",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Membantah Al-Quran Sesama Sendiri",
        "perawi_melayu": "Diriwayatkan daripada 'Amr bin Syu'aib, daripada bapanya, daripada datuknya, bahawa Nabi SAW mendengar kaum yang berdebat tentang Al-Quran, lalu baginda bersabda:",
        "english_text": "Not Available",
        "malay_translation": "\"Sesungguhnya binasalah orang-orang sebelum kamu disebabkan perkara ini: mereka membenturkan sebahagian Kitab Allah dengan sebahagian yang lain. Sesungguhnya Kitab Allah diturunkan untuk membenarkan sebahagiannya (ayat) akan sebahagian yang lain. Oleh itu, janganlah kamu mendustakan sebahagiannya dengan sebahagian yang lain. Apa yang kamu ketahui daripadanya, maka katakanlah, dan apa yang kamu tidak ketahui, maka serahkanlah kepada orang yang mengetahuinya (ulama).\". Riwayat Ahmad dan Ibnu Majah.",
        "arabic_text": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: سَمِعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قوما يتدارؤون فِي الْقُرْآنِ فَقَالَ: إِنَّمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ بِهَذَا: ضَرَبُوا كِتَابَ اللَّهِ بَعْضَهُ بِبَعْضٍ وَإِنَّمَا نَزَلَ كِتَابُ اللَّهِ يُصَدِّقُ بَعْضُهُ بَعْضًا فَلَا تُكَذِّبُوا بَعْضَهُ بِبَعْضٍ فَمَا عَلِمْتُمْ مِنْهُ فَقُولُوا وَمَا جَهِلْتُمْ فَكِلُوهُ إِلَى عَالِمِهِ . رَوَاهُ أَحْمد وَابْن مَاجَه"
      },
      {
        "id": 28932,
        "hadith_number": "238",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penjelasan Turunnya Al-Quran dengan Tujuh Huruf",
        "perawi_melayu": "Ibnu Mas'ud",
        "english_text": "Daripada Ibnu Mas'ud, dia berkata: Rasulullah SAW bersabda: \"Al-Quran diturunkan dalam tujuh huruf, untuk setiap ayat darinya ada zahir dan batin, dan untuk setiap had terdapat jalan masuk.\" Diriwayatkan dalam Syarah as-Sunnah.",
        "malay_translation": "Daripada Ibnu Mas'ud, beliau berkata: Rasulullah SAW bersabda: \"Al-Quran diturunkan dalam tujuh huruf, setiap ayat di dalamnya mempunyai zahir dan batin, dan setiap hadis mempunyai jalan masuk.\".  Perkara ini diriwayatkan dalam Syarah as-Sunnah.",
        "arabic_text": "وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أُنْزِلَ الْقُرْآنُ عَلَى سَبْعَةِ أَحْرُفٍ لِكُلِّ آيَةٍ مِنْهَا ظَهْرٌ وَبَطْنٌ وَلِكُلِّ حَدٍّ مَطْلَعٌ» رَوَاهُ فِي شَرْحِ السُّنَّةِ"
      },
      {
        "id": 28933,
        "hadith_number": "239",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Ilmu dalam Islam",
        "perawi_melayu": "Abdullah bin Amru",
        "english_text": "Dari Abdullah bin Amru, dia berkata: Rasulullah SAW bersabda: Ilmu itu ada tiga: ayat Al-Quran yang muhkam, atau sunnah yang teguh, atau hukum yang adil. Apa yang selain dari itu, maka ia adalah fadhil (keutamaan). Diriwayatkan oleh Imam Abu Daud dan Imam Ibn Majah.",
        "malay_translation": "Dari Abdullah bin Amru, beliau meriwayatkan bahawa Rasulullah SAW bersabda: Ilmu itu ada tiga: ayat al-Quran yang muhkam, atau sunnah yang teguh, atau hukum yang adil. Segala yang selainnya adalah fadhil (keutamaan).  Hadis ini diriwayatkan oleh Imam Abu Daud dan Imam Ibn Majah.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الْعِلْمُ ثَلَاثَةٌ: آيَةٌ مُحْكَمَةٌ أَوْ سُنَّةٌ قَائِمَةٌ أَوْ فَرِيضَةٌ عَادِلَةٌ وَمَا كَانَ سِوَى ذَلِكَ فَهُوَ فضل . رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه"
      },
      {
        "id": 28934,
        "hadith_number": "240",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Bercerita Kecuali Pemimpin atau yang Diperintah",
        "perawi_melayu": "Awf bin Malik al-Asyja'i",
        "english_text": "Daripada Awf bin Malik al-Asyja'i, dia berkata: Rasulullah SAW bersabda: \"Tidak boleh menceritakan kecuali seorang pemimpin atau yang diperintah atau yang terhormat.\"",
        "malay_translation": "Daripada Awf bin Malik al-Asyja'i, beliau berkata: Rasulullah SAW bersabda, \"Tidak boleh menceritakan kecuali seorang pemimpin atau yang diberi amanah atau orang yang dihormati.\" Diriwayatkan oleh Imam Abu Dawud",
        "arabic_text": "وَعَن عَوْف بن مَالك الْأَشْجَعِيّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَقُصُّ إِلَّا أَمِيرٌ أَوْ مَأْمُورٌ أَو مختال» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 28935,
        "hadith_number": "241",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Riwayat Tambahan Hadith",
        "perawi_melayu": "Tiada maklumat",
        "english_text": "Tiada terjemahan Inggeris",
        "malay_translation": "Diriwayatkan oleh Ad-Darimi daripada 'Amr bin Syu'aib daripada bapanya daripada datuknya, dan dalam riwayatnya menggantikan perkataan «atau sombong».",
        "arabic_text": "وَرَوَاهُ الدَّارِمِيُّ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ وَفِي رِوَايَته بدل «أَو مختال»"
      },
      {
        "id": 28936,
        "hadith_number": "242",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tanggungjawab Orang Yang Memberi Fatwa Tanpa Ilmu",
        "perawi_melayu": "Abu Hurairah RA",
        "english_text": "Daripada Abu Hurairah RA, Rasulullah SAW bersabda: \"Sesiapa yang berfatwa tanpa ilmu, maka dosanya terletak di atas orang yang meminta fatwanya, dan sesiapa yang menasihati saudaranya dengan sesuatu yang dia tahu kebenarannya berada di tempat lain, maka dia telah mengkhianatinya.\"",
        "malay_translation": "Daripada Abu Hurairah Radhiallahu 'anhu, Rasulullah SAW bersabda: \"Sesiapa yang memberi fatwa tanpa ilmu, maka dosa itu terletak di atas orang yang meminta fatwanya, dan sesiapa yang menasihati saudaranya dengan sesuatu perkara yang dia tahu kebenarannya berbeza daripada nasihatnya, maka dia telah mengkhianatinya.\" Diriwayatkan oleh Imam Abu Daud.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَفْتَى بِغَيْرِ عِلْمٍ كَانَ إِثْمُهُ عَلَى مَنْ أَفْتَاهُ وَمَنْ أَشَارَ عَلَى أَخِيهِ بِأَمْرٍ يَعْلَمُ أَنَّ الرُّشْدَ فِي غَيْرِهِ فَقَدْ خانه» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 28937,
        "hadith_number": "243",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mengeluarkan Kata-Kata yang Tidak Berguna",
        "perawi_melayu": "Muawiyah",
        "english_text": "The Prophet (peace and blessings of Allah be upon him) forbade frivolous talk.",
        "malay_translation": "Nabi (s.a.w) melarang daripada mengeluarkan kata-kata yang tidak berguna.",
        "arabic_text": "وَعَنْ مُعَاوِيَةَ قَالَ: إِنَّ النَّبِيَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الْأُغْلُوطَاتِ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 28938,
        "hadith_number": "244",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Mempelajari Hukum-Hukum Syariat dan Al-Quran",
        "perawi_melayu": "Abu Hurairah r.a.",
        "english_text": "Daripada Abu Hurairah r.a. dia berkata, Rasulullah SAW bersabda: \"Pelajarilah hukum-hukum syariat dan Al-Quran, dan ajarkanlah kepada manusia, sesungguhnya aku akan dicabut (meninggal dunia).\"  Diriwayatkan oleh Al-Tirmizi.",
        "malay_translation": "Daripada Abu Hurairah radhiyallahu 'anhu, beliau berkata, Rasulullah SAW bersabda, \"Pelajarilah hukum-hukum syariat dan Al-Quran, dan ajarkanlah kepada manusia. Sesungguhnya aku akan dicabut (meninggal dunia).\"  Riwayat Al-Tirmizi.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَعَلَّمُوا الْفَرَائِضَ وَالْقُرْآنَ وَعَلِّمُوا النَّاسَ فَإِنِّي مَقْبُوضٌ» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 28939,
        "hadith_number": "245",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Masa Hilangnya Ilmu Pengetahuan",
        "perawi_melayu": "Abi Darda',",
        "english_text": "And from Abi Darda', he said: We were with the Messenger of Allah, may Allah bless him and grant him peace, and he gazed intently at the sky, then said: \"This is a time when knowledge will be stealthily taken away from the people until they are unable to grasp anything from it.\"",
        "malay_translation": "Dan daripada Abi Darda', beliau berkata: Kami bersama Rasulullah SAW, semoga Allah memberkati dan memberi kesejahteraan kepadanya, dan baginda merenung langit dengan teliti, kemudian bersabda: \"Inilah masa di mana ilmu pengetahuan akan dicuri secara senyap dari manusia sehingga mereka tidak mampu memahami apa-apa darinya.\"",
        "arabic_text": "وَعَنْ أَبِي الدَّرْدَاءِ قَالَ: كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَشَخَصَ بِبَصَرِهِ إِلَى السَّمَاءِ ثُمَّ قَالَ: «هَذَا أَوَانٌ يُخْتَلَسُ فِيهِ الْعِلْمُ مِنَ النَّاسِ حَتَّى لَا يَقْدِرُوا مِنْهُ على شَيْء» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 28940,
        "hadith_number": "246",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Usaha Mendapatkan Ilmu Akan Meningkat, Namun Orang Yang Mengetahui Lebih Banyak Akan Berkurang",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "According to a narration by Abu Hurairah: \"Segera manusia akan mencari ilmu di mana-mana, namun mereka tidak akan mendapati orang yang lebih alim daripada penduduk Madinah.\"",
        "malay_translation": "Menurut riwayat daripada Abu Hurairah: \"Akan datang masanya manusia akan bersungguh-sungguh mencari ilmu, tetapi mereka tidak akan menemui sesiapa yang lebih alim daripada penduduk Madinah.\"",
        "arabic_text": "وَعَن أبي هُرَيْرَة رِوَايَةً: «يُوشِكُ أَنْ يَضْرِبَ النَّاسُ أَكْبَادَ الْإِبِلِ يَطْلُبُونَ الْعِلْمَ فَلَا يَجِدُونَ أَحَدًا أَعْلَمَ مِنْ عَالم الْمَدِينَة» . رَوَاهُ التِّرْمِذِيّ فِي جَامِعِهِ. قَالَ ابْنُ عُيَيْنَةَ: إِنَّهُ مَالِكُ بْنُ أنس وَمثله عَن عبد الرَّزَّاق قَالَ اسحق بْنُ مُوسَى: وَسَمِعْتُ ابْنَ عُيَيْنَةَ أَنَّهُ قَالَ: هُوَ الْعُمَرِيُّ الزَّاهِدُ وَاسْمُهُ عَبْدُ الْعَزِيزِ بْنُ عبد الله"
      },
      {
        "id": 28941,
        "hadith_number": "247",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pengurniaan Orang Yang Menguatkan Agama pada Setiap Seratus Tahun",
        "perawi_melayu": null,
        "english_text": null,
        "malay_translation": "Dan daripada beliau, selaras dengan pengetahuan kami, daripada Rasulullah SAW: \"Sesungguhnya Allah SWT akan mengutuskan bagi umat ini pada setiap seratus tahun seseorang yang akan memperbaharui agama mereka.\" Diriwayatkan oleh Imam Abu Daud.",
        "arabic_text": "وَعَنْهُ فِيمَا أَعْلَمُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ عَزَّ وَجَلَّ يَبْعَثُ لِهَذِهِ الْأُمَّةِ عَلَى رَأْسِ كُلِّ مِائَةٍ سَنَةٍ مَنْ يُجَدِّدُ لَهَا دِينَهَا» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 28942,
        "hadith_number": "248",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pewarisan Ilmu dan Penjagaannya dari Kekeliruan",
        "perawi_melayu": "Ibrahim bin Abdul Rahman Al-Uzdri",
        "english_text": "And from Ibrahim bin Abdul Rahman Al-Uzdri, he said: The Messenger of Allah (peace and blessings be upon him) said, \"This knowledge will be carried by the trustworthy successors of each generation. They will repel the distortion of the extremists, the fabrication of the wrongdoers, and the misinterpretations of the ignorant.\"",
        "malay_translation": "Dan daripada Ibrahim bin Abdul Rahman Al-Uzdri, beliau berkata: Rasulullah SAW bersabda, \"Ilmu ini akan dipikul oleh para pewaris yang amanah di setiap generasi. Mereka akan menolak penyelewengan golongan yang melampaui batas, penipuan orang-orang yang sesat, dan tafsiran yang salah oleh orang-orang jahil.\"",
        "arabic_text": "وَعَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ الْعُذْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «يَحْمِلُ هَذَا الْعِلْمَ مِنْ كُلِّ خَلَفٍ عُدُولُهُ يَنْفُونَ عَنْهُ تَحْرِيفَ الْغَالِينَ وَانْتِحَالَ الْمُبْطِلِينَ وَتَأْوِيلَ الْجَاهِلين» . رَوَاهُ الْبَيْهَقِيّ"
      },
      {
        "id": 28943,
        "hadith_number": "249",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Mencari Ilmu untuk Menghidupkan Islam",
        "perawi_melayu": "Hasan (secara mursal)",
        "english_text": "If no english text available, please refer to the malay translation.",
        "malay_translation": "Daripada Hasan (secara mursal) berkata: Rasulullah ﷺ bersabda: \"Sesiapa yang didatangi kematian sedangkan dia sedang menuntut ilmu untuk menghidupkan Islam dengannya, maka antara dia dan para Nabi hanya satu darjat di dalam syurga.\" (Riwayat Ad-Darimi)",
        "arabic_text": "عَنِ الْحَسَنِ مُرْسَلًا قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ جَاءَهُ الْمَوْتُ وَهُوَ يَطْلُبُ الْعِلْمَ لِيُحْيِيَ بِهِ الْإِسْلَامَ فَبَيْنَهُ وَبَيْنَ النَّبِيِّينَ دَرَجَةٌ وَاحِدَةٌ فِي الْجَنَّةِ» . رَوَاهُ الدَّارمِيّ"
      },
      {
        "id": 28944,
        "hadith_number": "250",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Orang Berilmu yang Mengajarkan Kebaikan",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Not Available",
        "malay_translation": "Daripada beliau (diriwayatkan secara mursal), beliau berkata: Rasulullah SAW ditanya tentang dua orang lelaki dari kalangan Bani Israel, salah seorang daripada mereka adalah seorang alim yang menunaikan solat fardhu kemudian duduk dan mengajarkan kebaikan kepada orang ramai, dan seorang lagi berpuasa di siang hari dan mendirikan solat di malam hari, manakah antara mereka yang lebih utama? Rasulullah SAW bersabda: \"Keutamaan orang alim ini yang menunaikan solat fardhu kemudian duduk dan mengajarkan kebaikan kepada orang ramai adalah seperti keutamaan aku berbanding orang yang paling rendah di antara kamu berbanding ahli ibadah yang berpuasa di siang hari dan mendirikan solat di malam hari.\" Riwayat ad-Darimi",
        "arabic_text": "وَعَنْهُ مُرْسَلًا قَالَ: سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ رَجُلَيْنِ كَانَا فِي بَنِي إِسْرَائِيلَ أَحَدُهُمَا كَانَ عَالِمًا يُصَلِّي الْمَكْتُوبَةَ ثُمَّ يَجْلِسُ فَيُعَلِّمُ النَّاسَ الْخَيْرَ وَالْآخِرُ يَصُومُ النَّهَارَ وَيَقُومُ اللَّيْلَ أَيُّهُمَا أَفْضَلُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «فَضْلُ هَذَا الْعَالِمِ الَّذِي يُصَلِّي الْمَكْتُوبَةَ ثُمَّ يَجْلِسُ فَيُعَلِّمُ النَّاسَ الْخَيْرَ عَلَى الْعَابِدِ الَّذِي يَصُومُ النَّهَارَ وَيَقُومُ اللَّيْلَ كَفَضْلِي عَلَى أَدْنَاكُمْ» . رَوَاهُ الدَّارِمِيُّ"
      },
      {
        "id": 28945,
        "hadith_number": "251",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keunggulan Orang Berilmu dalam Agama",
        "perawi_melayu": "Ali bin Abi Talib رضي الله عنه",
        "english_text": "And from Ali رضي الله عنه, he said: The Messenger of Allah صلى الله عليه وسلم said: \"Excellent is the person of knowledge in religion. If he is needed, he benefits; if he is not needed, he benefits himself.\"",
        "malay_translation": "Dan daripada Ali bin Abi Talib رضي الله عنه, beliau berkata: Rasulullah SAW bersabda: \"Sangat baik orang yang berilmu dalam agama. Jika dia diperlukan, dia memberi manfaat; jika dia tidak diperlukan, dia bermanfaat untuk dirinya sendiri.\"",
        "arabic_text": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نِعْمَ الرَّجُلُ الْفَقِيهُ فِي الدِّينِ إِنِ احْتِيجَ إِلَيْهِ نَفَعَ وَإِنِ اسْتُغْنِيَ عَنْهُ أَغْنَى نَفْسَهُ» . رَوَاهُ رزين"
      },
      {
        "id": 28946,
        "hadith_number": "252",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pentingnya Mengedarkan Dakwah dan Menjaga Adab Bercerita",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "From Ibn `Umar, that Ibn `Abbas said: Advise the people every Friday once. If you refuse, twice. If you exceed, thrice. Do not tire the people with this Quran. Do not come to the people while they are engaged in their discourse and then interrupt them, tiring them. Instead, be silent, and if they ask you, then advise them as they desire.  Avoid exaggerated, repetitive supplications, for I have pledged that the Messenger of Allah (peace be upon him) and his Companions did not do that. Reported by Al-Bukhari.",
        "malay_translation": "Dari Ibn `Abbas, beliau berkata: Nasihatkanlah orang ramai setiap hari Jumaat sekali. Jika engkau enggan, dua kali. Jika melebihi, tiga kali. Jangan letihkan mereka dengan al-Quran ini. Jangan datang kepada mereka ketika mereka sedang berbincang dan kemudian mengganggu mereka, meletihkan mereka. Sebaliknya, diamlah, dan jika mereka bertanya kepadamu, maka nasihatkanlah mereka sebagaimana mereka inginkan. Elakkanlah permohonan yang berlebih-lebihan dan berulang-ulang dalam doa, kerana aku telah bersumpah bahawa Rasulullah SAW dan sahabat-sahabatnya tidak melakukan perkara itu. Diriwayatkan oleh Al-Bukhari.",
        "arabic_text": "وَعَن عِكْرِمَة أَنَّ ابْنَ عَبَّاسٍ قَالَ: حَدِّثِ النَّاسَ كُلَّ جُمُعَةٍ مَرَّةً فَإِنْ أَبَيْتَ فَمَرَّتَيْنِ فَإِنْ أَكْثَرْتَ فَثَلَاثَ مَرَّاتٍ وَلَا تُمِلَّ النَّاسَ هَذَا الْقُرْآنَ وَلَا أُلْفِيَنَّكَ تَأْتِي الْقَوْمَ وَهُمْ فِي حَدِيثٍ مِنْ حَدِيثِهِمْ فَتَقُصُّ عَلَيْهِمْ فَتَقْطَعُ عَلَيْهِمْ حَدِيثَهُمْ فَتُمِلَّهُمْ وَلَكِنْ أَنْصِتْ فَإِذَا أَمَرُوكَ فَحَدِّثْهُمْ وَهُمْ يَشْتَهُونَهُ وَانْظُرِ السَّجْعَ مِنَ الدُّعَاءِ فَاجْتَنِبْهُ فَإِنِّي عَهِدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابُهُ لَا يَفْعَلُونَ ذَلِك رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 28947,
        "hadith_number": "253",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Menuntut Ilmu",
        "perawi_melayu": "Wathilah bin al-Asqa'",
        "english_text": "And from Wاثلة bin al-Asqa', he said: The Messenger of Allah, peace and blessings be upon him, said: \"Whoever seeks knowledge and attains it, will have two rewards; and if he does not attain it, he will still have one reward.\" Reported by al-Dirami.",
        "malay_translation": "Dan daripada Wاثلة bin al-Asqa', beliau berkata: Rasulullah SAW bersabda, \"Sesiapa yang mencari ilmu dan memperolehnya, maka baginya dua pahala; dan jika ia tidak memperolehnya, maka baginya satu pahala.\" Diriwayatkan oleh al-Dirami.",
        "arabic_text": "وَعَنْ وَاثِلَةَ بْنِ الْأَسْقَعِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ طَلَبَ الْعِلْمَ فَأَدْرَكَهُ كَانَ لَهُ كِفْلَانِ مِنَ الْأَجْرِ فَإِنْ لَمْ يُدْرِكْهُ كَانَ لَهُ كفل من الْأجر» . رَوَاهُ الدِّرَامِي"
      },
      {
        "id": 28948,
        "hadith_number": "254",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Amalan Baik yang Memberi Pahala Selepas Kematian",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Dari Abu Hurairah, dia berkata: Rasulullah SAW bersabda, \"Sesungguhnya di antara amalan dan kebaikan yang akan sampai kepada orang mukmin setelah kematiannya ialah ilmu yang diajarkan dan disebarkan, anak yang soleh yang ditinggalkannya, Al-Quran yang diwariskannya, masjid yang dibina olehnya, rumah untuk tetamu yang tidak bertempat tinggal dibina olehnya, sungai yang dialirkannya, atau sedekah yang dikeluarkannya dari hartanya ketika dia masih hidup. Semua ini akan sampai kepadanya setelah kematiannya.\"",
        "malay_translation": "Dari Abu Hurairah, dia berkata: Rasulullah SAW bersabda, \"Sesungguhnya di antara amalan dan kebaikan yang akan sampai kepada orang mukmin setelah kematiannya ialah ilmu yang diajarkan dan disebarkan, anak yang soleh yang ditinggalkannya, Al-Quran yang diwariskannya, masjid yang dibina olehnya, rumah untuk tetamu yang tidak bertempat tinggal dibina olehnya, sungai yang dialirkannya, atau sedekah yang dikeluarkannya dari hartanya ketika dia masih hidup. Semua ini akan sampai kepadanya setelah kematiannya.\"",
        "arabic_text": "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ مِمَّا يَلْحَقُ الْمُؤْمِنَ مِنْ عَمَلِهِ وَحَسَنَاتِهِ بَعْدَ مَوْتِهِ عِلْمًا علمه ونشره وَولدا صَالحا تَركه ومصحفا وَرَّثَهُ أَوْ مَسْجِدًا بَنَاهُ أَوْ بَيْتًا لِابْنِ السَّبِيلِ بَنَاهُ أَوْ نَهْرًا أَجْرَاهُ أَوْ صَدَقَةً أخرجهَا من مَاله فِي صِحَّته وحياته يلْحقهُ من بعد مَوته» . رَوَاهُ بن مَاجَه وَالْبَيْهَقِيّ فِي شعب الْإِيمَان"
      },
      {
        "id": 28949,
        "hadith_number": "255",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Ilmu dan Jalan Menuju Syurga",
        "perawi_melayu": "Aisyah رضي الله عنها",
        "english_text": "Daripada Aisyah RA, beliau berkata: Aku mendengar Rasulullah SAW bersabda: Sesungguhnya Allah SWT telah mewahyukan kepadaku bahawa sesiapa yang menempuh jalan untuk mencari ilmu, nescaya Aku akan memudahkan baginya jalan ke syurga. Dan sesiapa yang menunaikan amanah dua orang wanita, nescaya Aku akan tetapkan baginya syurga. Dan kelebihan ilmu itu lebih baik daripada kelebihan ibadah, dan memelihara agama ialah bertakwa.",
        "malay_translation": "Daripada Aisyah رضي الله عنها, beliau berkata: Aku mendengar Rasulullah SAW bersabda: Sesungguhnya Allah SWT telah mewahyukan kepadaku bahawa sesiapa yang menempuh jalan untuk mencari ilmu, nescaya Aku akan memudahkan baginya jalan ke syurga. Dan sesiapa yang menunaikan amanah dua orang wanita, nescaya Aku akan tetapkan baginya syurga. Dan kelebihan ilmu itu lebih baik daripada kelebihan ibadah, dan memelihara agama ialah bertakwa.",
        "arabic_text": "وَعَنْ عَائِشَةَ أَنَّهَا قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ اللَّهَ عَزَّ وَجَلَّ أَوْحَى إِلَيَّ أَنَّهُ مَنْ سَلَكَ مَسْلَكًا فِي طَلَبِ الْعِلْمِ سَهَّلْتُ لَهُ طَرِيقَ الْجَنَّةِ وَمَنْ سَلَبْتُ كَرِيمَتَيْهِ أَثَبْتُهُ عَلَيْهِمَا الْجَنَّةَ. وَفَضْلٌ فِي عِلْمٍ خَيْرٌ مِنْ فَضْلٍ فِي عِبَادَةٍ وَمِلَاكُ الدِّينِ الْوَرَعُ» . رَوَاهُ الْبَيْهَقِيُّ فِي شعب الْإِيمَان"
      },
      {
        "id": 28950,
        "hadith_number": "256",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Mengkaji Ilmu Pada Malam Hari",
        "perawi_melayu": null,
        "english_text": "Daripada Ibn Abbas r.a, katanya: Mengkaji ilmu pada satu waktu malam adalah lebih baik daripada menghidupkan malam itu dengan amalan-amalan lain. Diriwayatkan oleh al-Daraimi.",
        "malay_translation": "Daripada Ibn Abbas r.a, baginda berkata: Mengkaji ilmu pada satu ketika pada waktu malam lebih baik daripada menghidupkannya (dengan ibadah) yang lain. Ia diriwayatkan oleh al-Daraimi.",
        "arabic_text": "وَعَن ابْن عَبَّاس قَالَ: تَدَارُسُ الْعِلْمِ سَاعَةً مِنَ اللَّيْلِ خَيْرٌ من إحيائها. رَوَاهُ الدَّارمِيّ"
      },
      {
        "id": 28951,
        "hadith_number": "257",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Berilmu dan Beribadah",
        "perawi_melayu": "Abdullah bin Amru",
        "english_text": "And it was narrated from Abdullah bin Amr that the Messenger of Allah, peace and blessings be upon him, passed by two gatherings in his mosque and said, \"Both are on the right path, and one is better than the other. As for these, they invoke Allah and desire from Him; if He wills, He will give them, and if He wills, He will withhold from them. And as for these, they learn fiqh or knowledge and teach the ignorant, so they are better. And indeed I was sent as a teacher.\" Then he sat amongst them.",
        "malay_translation": "Dan diriwayatkan daripada Abdullah bin Amru bahawa Rasulullah SAW telah melewati dua kumpulan dalam masjidnya dan bersabda, \"Kedua-duanya berada di jalan yang benar, dan salah satunya lebih utama daripada yang lain. Adapun golongan ini, mereka berdoa kepada Allah dan menginginkan sesuatu daripada-Nya; jika Allah menghendaki, Dia akan memberikannya, dan jika Dia menghendaki, Dia akan menahannya dari mereka. Dan adapun golongan ini, mereka mempelajari fiqh atau ilmu pengetahuan dan mengajar orang yang jahil, maka mereka lebih utama. Dan sesungguhnya aku diutus sebagai seorang pengajar.\" Kemudian baginda duduk di kalangan mereka.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِمَجْلِسَيْنِ فِي مَسْجِدِهِ فَقَالَ: «كِلَاهُمَا عَلَى خَيْرٍ وَأَحَدُهُمَا أَفْضَلُ مِنْ صَاحِبِهِ أَمَّا هَؤُلَاءِ فَيَدْعُونَ اللَّهَ وَيَرْغَبُونَ إِلَيْهِ فَإِنْ شَاءَ أَعْطَاهُمْ وَإِنْ شَاءَ مَنَعَهُمْ. وَأَمَّا هَؤُلَاءِ فَيَتَعَلَّمُونَ الْفِقْهَ أَوِ الْعِلْمَ وَيُعَلِّمُونَ الْجَاهِلَ فَهُمْ أَفْضَلُ وَإِنَّمَا بُعِثْتُ مُعَلِّمًا» ثمَّ جلس فيهم. رَوَاهُ الدَّارمِيّ"
      },
      {
        "id": 28952,
        "hadith_number": "258",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis Mengenai Ciri-Ciri Seorang yang Berpengetahuan",
        "perawi_melayu": "Abu al-Darda'",
        "english_text": "Abu al-Darda' reported: The Messenger of Allah (peace and blessings of Allah be upon him) was asked: What is the limit of knowledge by which a man becomes a jurist? The Messenger of Allah (peace and blessings of Allah be upon him) said: \"He who preserves for my community forty Hadith concerning their religious affairs, Allah will raise him as a jurist, and I will be an intercessor and witness for him on the Day of Resurrection.\"",
        "malay_translation": "Daripada Abu al-Darda' رضي الله عنه berkata: Rasulullah ﷺ ditanya: Apakah had (batas) ilmu yang mana jika seseorang telah mencapainya, maka dia menjadi seorang yang faqih (ahli fiqh)? Maka Rasulullah ﷺ bersabda: \"Sesiapa yang menghafal untuk umatku empat puluh hadis berkaitan urusan agama mereka, Allah akan membangkitkannya sebagai seorang yang faqih, dan aku akan menjadi pemberi syafaat dan saksi baginya pada hari kiamat.\"",
        "arabic_text": "وَعَنْ أَبِي الدَّرْدَاءِ قَالَ: سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَا حَدُّ الْعِلْمِ الَّذِي إِذَا بَلَغَهُ الرَّجُلُ كَانَ فَقِيهًا؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «من حَفِظَ عَلَى أُمَّتِي أَرْبَعِينَ حَدِيثًا فِي أَمْرِ دِينِهَا بَعَثَهُ اللَّهُ فَقِيهًا وَكُنْتُ لَهُ يَوْمَ الْقِيَامَة شافعا وشهيدا»"
      },
      {
        "id": 28953,
        "hadith_number": "259",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Pemurah dan Kepentingan Ilmu",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "And from Anas bin Malik, he said: The Messenger of Allah, peace and blessings be upon him, said, \"Do you know who is the most generous?\" They said, \"Allah and His Messenger know best.\" He said, \"Allah, Exalted is He, is the most generous, then I am the most generous of the children of Adam, and the most generous of them after me is a man who learned knowledge and then disseminated it; he will come on the Day of Resurrection as a leader, alone, or he said, a nation alone.\"",
        "malay_translation": "Dan daripada Anas bin Malik, beliau berkata: Rasulullah SAW bersabda, \"Tahukah kamu siapakah yang paling murah hati?\" Mereka menjawab, \"Allah dan Rasul-Nya lebih mengetahui.\" Baginda bersabda, \"Allah SWT adalah yang paling murah hati, kemudian aku adalah yang paling murah hati di antara anak-anak Adam, dan yang paling murah hati di antara mereka selepasku ialah seorang lelaki yang mempelajari ilmu dan kemudian menyebarkannya; dia akan datang pada Hari Kiamat sebagai seorang pemimpin, sendirian, atau baginda bersabda, satu umat sendirian.\"",
        "arabic_text": "وَعَنْ أَنَسِ بْنِ مَالِكٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَلْ تَدْرُونَ مَنْ أَجْوَدُ جُودًا؟» قَالُوا: اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: «اللَّهُ تَعَالَى أَجْوَدُ جُودًا ثُمَّ أَنَا أَجْوَدُ بَنِي آدَمَ وَأَجْوَدُهُمْ مِنْ بَعْدِي رَجُلٌ عَلِمَ عِلْمًا فَنَشَرَهُ يَأْتِي يَوْمَ الْقِيَامَةِ أَمِيرًا وَحده أَو قَالَ أمة وَحده»"
      },
      {
        "id": 28954,
        "hadith_number": "260",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Dua Golongan yang Tidak Pernah Kenyang",
        "perawi_melayu": "Tidak diketahui (disebutkan)",
        "english_text": "Not Available",
        "malay_translation": "Daripada (riwayat)nya bahawa Nabi ﷺ bersabda: \"Dua orang yang tamak (tidak pernah puas): Seorang yang tamak dalam ilmu, dia tidak merasa kenyang daripadanya, dan seorang yang tamak terhadap dunia, dia tidak merasa kenyang daripadanya\". Diriwayatkan oleh al-Baihaqi tiga hadis dalam Syu'ab al-Iman dan berkata: Imam Ahmad berkata dalam hadis Abu Darda: Ini adalah matan yang terkenal di kalangan orang ramai dan tidak mempunyai sanad yang sahih.",
        "arabic_text": "وَعَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: مَنْهُومَانِ لَا يَشْبَعَانِ: مَنْهُومٌ فِي الْعِلْمِ لَا يَشْبَعُ مِنْهُ وَمَنْهُومٌ فِي الدُّنْيَا لَا يَشْبَعُ مِنْهَا «. رَوَى الْبَيْهَقِيُّ الْأَحَادِيثَ الثَّلَاثَةَ فِي» شُعَبِ الْإِيمَانِ وَقَالَ: قَالَ الْإِمَامُ أَحْمَدُ فِي حَدِيثِ أَبِي الدَّرْدَاءِ: هَذَا مَتْنٌ مَشْهُورٌ فِيمَا بَين النَّاس وَلَيْسَ لَهُ إِسْنَاد صَحِيح"
      },
      {
        "id": 28955,
        "hadith_number": "261",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Ilmu dan Bahayanya Dunia",
        "perawi_melayu": "Awf",
        "english_text": "From Awn, who said: Abdullah ibn Mas'ud said, \"There are two things that never get full: the seeker of knowledge and the seeker of worldly wealth. They are not equal. As for the seeker of knowledge, he will increase in satisfaction with Allah, and as for the seeker of worldly wealth, he will increasingly become arrogant. Then Abdullah recited, \"By no means! Indeed, man acts unjustly when he sees that he is self-sufficient.\"  And the other person said, \"Indeed, only those of My servants who are knowledgeable fear Me.\"",
        "malay_translation": "Daripada Awn, yang berkata: Abdullah bin Mas'ud berkata, \"Ada dua perkara yang tidak pernah kenyang: orang yang mencari ilmu dan orang yang mencari harta dunia. Keduanya tidak sama. Bagi pencari ilmu, ia akan bertambah redha kepada Allah, dan bagi pencari harta dunia, ia akan semakin sombong. Kemudian Abdullah membaca, \"Sekali-kali tidak! Sesungguhnya manusia itu zalim apabila melihat dirinya cukup.\" Dan orang lain berkata, \"Sesungguhnya yang takut kepada Allah di kalangan hamba-hamba-Ku hanyalah orang-orang yang berilmu.\".",
        "arabic_text": "عَن عَوْنٍ قَالَ: قَالَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ: مَنْهُومَانِ لَا يَشْبَعَانِ صَاحِبُ الْعِلْمِ وَصَاحِبُ الدُّنْيَا وَلَا يَسْتَوِيَانِ أَمَّا صَاحِبُ الْعِلْمِ فَيَزْدَادُ رِضًى لِلرَّحْمَنِ وَأَمَّا صَاحِبُ الدُّنْيَا فَيَتَمَادَى فِي الطُّغْيَانِ. ثُمَّ قَرَأَ عَبْدُ اللَّهِ (كَلَّا إِنَّ الْإِنْسَانَ لَيَطْغَى أَنْ رَآهُ اسْتَغْنَى) قَالَ وَقَالَ الْآخَرُ (إِنَّمَا يَخْشَى اللَّهَ مِنْ عباده الْعلمَاء. رَوَاهُ الدَّارمِيّ"
      },
      {
        "id": 28956,
        "hadith_number": "262",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Segelintir Umat Akan Mengutamakan Dunia dan Mengabaikan Agama",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "Dari Ibn Abbas, dia berkata: Rasulullah SAW bersabda: Sesungguhnya segelintir umatku akan mendalami ilmu agama dan membaca Al-Quran, kemudian mereka akan mendatangi para pemimpin untuk mendapatkan keuntungan duniawi, lalu mereka akan memisahkan diri daripada para pemimpin itu dengan agama mereka. Namun, demikian itu tidak seperti memetik buah qatad (sejenis pokok) yang hanya menghasilkan duri. Begitu juga, mereka tidak akan mendapat apa-apa melainkan kesalahan dari para pemimpin.",
        "malay_translation": "Daripada Ibn Abbas, beliau berkata: Rasulullah SAW bersabda: Sesungguhnya segelintir umatku akan mendalami ilmu agama dan membaca Al-Quran, kemudian mereka akan mendatangi para pemimpin untuk mendapatkan keuntungan duniawi, lalu mereka akan memisahkan diri daripada para pemimpin itu dengan agama mereka. Namun, demikian itu tidak seperti memetik buah qatad (sejenis pokok) yang hanya menghasilkan duri. Begitu juga, mereka tidak akan mendapat apa-apa melainkan kesalahan dan kekeliruan dari para pemimpin.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم قَالَ: إِنَّ أُنَاسًا مِنْ أُمَّتِي سَيَتَفَقَّهُونَ فِي الدِّينِ ويقرءون الْقُرْآن يَقُولُونَ نَأْتِي الْأُمَرَاءَ فَنُصِيبُ مِنْ دُنْيَاهُمْ وَنَعْتَزِلُهُمْ بِدِينِنَا وَلَا يَكُونُ ذَلِكَ كَمَا لَا يُجْتَنَى مِنَ الْقَتَادِ إِلَّا الشَّوْكُ كَذَلِكَ لَا يُجْتَنَى مِنْ قُرْبِهِمْ إِلَّا - قَالَ مُحَمَّدُ بْنُ الصَّبَّاحِ: كَأَنَّهُ يَعْنِي - الْخَطَايَا . رَوَاهُ ابْن مَاجَه"
      },
      {
        "id": 28957,
        "hadith_number": "263",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Ilmu dan Akibat Mengabaikannya",
        "perawi_melayu": "Diriwayatkan daripada Abdullah bin Mas'ud",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abdullah bin Mas'ud RA, beliau berkata: \"Sekiranya ahli ilmu memelihara ilmu dan meletakkannya pada ahlinya, nescaya mereka akan memimpin ahli zaman mereka dengannya. Akan tetapi, mereka mencurahkannya kepada ahli dunia untuk mendapatkan (keuntungan) dunia mereka, maka mereka menjadi hina di sisi mereka. Aku mendengar Nabi kamu SAW bersabda: 'Barangsiapa menjadikan kebimbangan-kebimbangan (hidup)nya satu kebimbangan sahaja, iaitu kebimbangan akhiratnya, maka Allah akan mencukupkan baginya kebimbangan dunianya. Dan barangsiapa yang kebimbangan-kebimbangannya bercabang-cabang dalam hal ehwal dunia, maka Allah tidak peduli di lembah mana dia binasa.'\" (Riwayat Ibnu Majah)",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: لَوْ أَنَّ أَهْلَ الْعِلْمِ صَانُوا الْعِلْمَ وَوَضَعُوهُ عِنْدَ أَهْلِهِ لَسَادُوا بِهِ أَهْلَ زَمَانِهِمْ وَلَكِنَّهُمْ بَذَلُوهُ لِأَهْلِ الدُّنْيَا لِيَنَالُوا بِهِ مِنْ دُنْيَاهُمْ فَهَانُوا عَلَيْهِمْ سَمِعْتُ نَبِيَّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ جَعَلَ الْهُمُومَ هَمًّا وَاحِدًا هَمَّ آخِرَتِهِ كَفَاهُ اللَّهُ هَمَّ دُنْيَاهُ وَمَنْ تَشَعَّبَتْ بِهِ الْهُمُومُ فِي أَحْوَالِ الدُّنْيَا لَمْ يُبَالِ اللَّهُ فِي أَيِّ أَوْدِيَتِهَا هَلَكَ» . رَوَاهُ ابْنُ مَاجَه"
      },
      {
        "id": 28958,
        "hadith_number": "264",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Mengatasi Kesusahan dan Kebimbangan",
        "perawi_melayu": "Tidak diketahui",
        "english_text": "Not Available",
        "malay_translation": "Al-Baihaqi meriwayatkannya dalam Syu'ab al-Iman daripada Ibn Umar daripada perkataannya: \"Sesiapa yang menjadikan kebimbangan...\" hingga akhir.",
        "arabic_text": "وَرَوَاهُ الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ عَنِ ابْنِ عُمَرَ مِنْ قَوْلِهِ: «مَنْ جَعَلَ الْهُمُومَ» إِلَى آخِره"
      },
      {
        "id": 28959,
        "hadith_number": "265",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Bahaya Ilmu: Lupa dan Menyampaikan kepada yang Tidak Layak",
        "perawi_melayu": "Al-A'mash",
        "english_text": " وعن الأعمش قال: قال رسول الله صلى الله عليه وسلم: «آفة العلم النسيان وإضاعته أن تحدث به غير أهله» . رواه الدارمي مرسلا",
        "malay_translation": "Daripada Al-A'mash, beliau berkata: Rasulullah SAW bersabda: \"Bencana ilmu adalah lupa, dan mensia-siakannya adalah dengan menyampaikan ilmu kepada orang yang bukan ahlinya.\" (Riwayat Ad-Darimi secara mursal).",
        "arabic_text": "وَعَنِ الْأَعْمَشِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «آفَةُ الْعِلْمِ النِّسْيَانُ وَإِضَاعَتُهُ أَنْ تُحَدِّثَ بِهِ غَيْرَ أَهْلِهِ» . رَوَاهُ الدَّارِمِيُّ مُرْسلا"
      },
      {
        "id": 28960,
        "hadith_number": "266",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Orang yang Mengamalkan Ilmu",
        "perawi_melayu": "Sufyan",
        "english_text": "Daripada Sufyan, bahawa Umar bin Al-Khattab r.a. berkata kepada Ka'ab: Siapakah pemilik ilmu? Jawab Ka'ab: Orang yang mengamalkan apa yang mereka ketahui. Umar bertanya lagi: Apakah yang mengeluarkan ilmu daripada hati ulama? Jawab Ka'ab: Kerakusan.",
        "malay_translation": "Daripada Sufyan, bahawa Umar bin Al-Khattab radhiallahu 'anhu berkata kepada Ka'ab: Siapakah pemilik ilmu? Jawab Ka'ab: Orang yang mengamalkan apa yang mereka ketahui. Umar bertanya lagi: Apakah yang menyebabkan ilmu keluar daripada hati para ulama? Jawab Ka'ab: Kerakusan.",
        "arabic_text": "وَعَنْ سُفْيَانَ أَنَّ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ لِكَعْبٍ: مَنْ أَرْبَابُ الْعِلْمِ؟ قَالَ: الَّذِي يَعْمَلُونَ بِمَا يَعْلَمُونَ. قَالَ: فَمَا أَخْرَجَ الْعِلْمَ مِنْ قُلُوبِ الْعُلَمَاءِ؟ قَالَ الطَّمَعُ. رَوَاهُ الدَّارِمِيُّ"
      },
      {
        "id": 28961,
        "hadith_number": "267",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Bertanya Tentang Kerosakan dan Keutamaan Ahli Ilmu yang Baik",
        "perawi_melayu": null,
        "english_text": null,
        "malay_translation": "Dan daripada Al-Ahwas bin Hakim daripada bapanya, katanya: Seorang lelaki bertanya kepada Nabi SAW tentang kejahatan, lalu Baginda bersabda: \"Janganlah kamu bertanya kepadaku tentang kejahatan, tetapi tanyakanlah kepadaku tentang kebaikan.\" Baginda mengulanginya sebanyak tiga kali, kemudian bersabda: \"Ketahuilah, sesungguhnya kejahatan yang paling buruk daripada kejahatan adalah keburukan para ulama, dan sesungguhnya kebaikan yang paling baik daripada kebaikan adalah kebaikan para ulama yang terbaik.\" Telah meriwayatkannya ad-Daraimi.",
        "arabic_text": "وَعَن الْأَحْوَص بن حَكِيم عَنْ أَبِيهِ قَالَ: سَأَلَ رَجُلٌ النَّبِيَّ صَلَّى الله عَلَيْهِ سلم عَنِ الشَّرِّ فَقَالَ: «لَا تَسْأَلُونِي عَنِ الشَّرِّ وَسَلُونِي عَنِ الْخَيْرِ» يَقُولُهَا ثَلَاثًا ثُمَّ قَالَ: «أَلَا إِنَّ شَرَّ الشَّرِّ شِرَارُ الْعُلَمَاءِ وَإِنَّ خير الْخَيْر خِيَار الْعلمَاء» . رَوَاهُ الدَّارمِيّ"
      },
      {
        "id": 28962,
        "hadith_number": "268",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Orang Yang Paling Tercela di Sisi Allah pada Hari Kiamat",
        "perawi_melayu": "Abu Darda",
        "english_text": "Daripada Abu Darda, baginda berkata: Sesungguhnya daripada manusia yang paling tercela di sisi Allah pada hari kiamat ialah orang yang berilmu tetapi tidak mengambil manfaat dari ilmunya.  Riwayat Imam Dārimī.",
        "malay_translation": "Daripada Abu Darda, baginda berkata: Sesungguhnya daripada manusia yang paling tercela di sisi Allah pada hari kiamat ialah orang yang berilmu tetapi tidak memanfaatkan ilmunya.  Riwayat Imam Dārimī.",
        "arabic_text": "وَعَنْ أَبِي الدَّرْدَاءِ قَالَ: إِنَّ مِنْ أَشَرِّ النَّاسِ عِنْدَ اللَّهِ مَنْزِلَةً يَوْمَ الْقِيَامَةِ: عَالِمٌ لَا ينْتَفع بِعِلْمِهِ . رَوَاهُ الدَّارمِيّ"
      },
      {
        "id": 28963,
        "hadith_number": "269",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kejatuhan Islam Disebabkan Kesilapan Ulama dan Perbahasan Orang Munafik",
        "perawi_melayu": "Ziyad bin Hadhir",
        "english_text": "And from Ziyad bin Hadhir, he said: Umar said to me, \"Do you know what destroys Islam?\" I said, \"No.\" He said, \"It is the slip of the scholar, the argument of the hypocrite with the Book, and the rulings of the misguided imams.\"",
        "malay_translation": "Dan daripada Ziyad bin Hadhir, beliau berkata: Umar berkata kepadaku, \"Adakah engkau mengetahui apa yang meruntuhkan Islam?\" Aku berkata, \"Tidak.\" Beliau berkata, \"Ia adalah kesilapan ulama, perdebatan orang munafik dengan al-Kitab, dan keputusan imam-imam yang sesat.\"",
        "arabic_text": "وَعَن زِيَاد بن حدير قَالَ: قَالَ لِي عُمَرُ: هَلْ تَعْرِفُ مَا يَهْدِمُ الْإِسْلَامَ؟ قَالَ: قُلْتُ: لَا. قَالَ: يَهْدِمُهُ زَلَّةُ الْعَالِمِ وَجِدَالُ الْمُنَافِقِ بِالْكِتَابِ وَحُكْمُ الْأَئِمَّةِ المضلين . رَوَاهُ الدِّرَامِي"
      },
      {
        "id": 28964,
        "hadith_number": "270",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ilmu yang Bermanfaat dan Kewajipan Menyebarkannya",
        "perawi_melayu": null,
        "english_text": "And from al-Hasan, he said: \"Knowledge is of two types.  A knowledge in the heart, that is the beneficial knowledge; and knowledge on the tongue, that is Allah's argument against Adam's son.\"",
        "malay_translation": "Dan daripada al-Hasan, beliau berkata: \"Ilmu itu ada dua jenis. Ilmu yang ada dalam hati, itulah ilmu yang bermanfaat; dan ilmu yang berada di atas lidah, itulah hujah Allah SWT terhadap anak Adam.\"",
        "arabic_text": "وَعَن الْحسن قَالَ: «الْعِلْمُ عِلْمَانِ فَعِلْمٌ فِي الْقَلْبِ فَذَاكَ الْعلم النافع وَعلم على اللِّسَان فَذَاك حُجَّةُ اللَّهِ عَزَّ وَجَلَّ عَلَى ابْنِ آدَمَ» . رَوَاهُ الدَّارمِيّ"
      },
      {
        "id": 28965,
        "hadith_number": "271",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menyampaikan dan Memegang Sabda Nabi SAW",
        "perawi_melayu": "Abu Hurairah RA",
        "english_text": "Daripada Abu Hurairah R.A.  beliau berkata: \"Aku telah menghafaz dua bekas daripada Rasulullah SAW.  Adapun salah satunya, aku telah sebarkan di antara kamu. Adapun yang satu lagi, sekiranya aku sebarkan, nescaya terputuslah kerongkong ini (iaitu saluran makanan).\"  Riwayat Bukhari",
        "malay_translation": "Daripada Abu Hurairah R.A., beliau berkata: \"Aku telah menghafaz dua bekas daripada Rasulullah SAW. Adapun salah satunya, aku telah sebarkan kepada kamu. Adapun yang satu lagi, sekiranya aku sebarkan, nescaya terputuslah saluran makanan ini.\"  Riwayat Imam al-Bukhari.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: «حَفِظْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وِعَاءَيْنِ فَأَمَّا أَحَدُهُمَا فَبَثَثْتُهُ فِيكُمْ وَأَمَّا الْآخَرُ فَلَوْ بَثَثْتُهُ قُطِعَ هَذَا الْبُلْعُومُ يَعْنِي مجْرى الطَّعَام» رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 28966,
        "hadith_number": "272",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kewajipan Mengaku Ketidaktahuan dan Menyerahkan Kepada Allah SWT",
        "perawi_melayu": "Abdullah bin Mas'ud",
        "english_text": "And from Abdullah bin Mas'ud, he said: O people, whoever knows something, let him say it, and whoever does not know, let him say Allah knows best. For part of knowledge is to say regarding that which you do not know, \"Allah knows best.\" Allah, Exalted is He, said to His Prophet (peace be upon him), \"Say, 'I ask of you no reward for it, and I am not of those who are burdened.'\"",
        "malay_translation": "Dan daripada Abdullah bin Mas'ud, beliau berkata: Wahai sekalian manusia, sesiapa yang mengetahui sesuatu, hendaklah dia menyebutkannya, dan sesiapa yang tidak mengetahuinya, hendaklah dia berkata \"Allah lebih mengetahui\". Kerana sebahagian daripada ilmu ialah menyatakan mengenai perkara yang tidak diketahui, \"Allah lebih mengetahui\". Allah SWT berfirman kepada Nabi-Nya (sallallahu alaihi wasallam), \"Katakanlah (wahai Muhammad): Aku tidak meminta upah daripadamu terhadapnya, dan aku bukanlah dari kalangan orang-orang yang membebankan diri mereka sendiri.\"",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: يَا أَيُّهَا النَّاسُ مَنْ عَلِمَ شَيْئًا فَلْيَقُلْ بِهِ وَمَنْ لَمْ يَعْلَمْ فَلْيَقُلِ اللَّهُ أعلم فَإِن من الْعلم أَن يَقُول لِمَا لَا تَعْلَمُ اللَّهُ أَعْلَمُ. قَالَ اللَّهُ تَعَالَى لِنَبِيِّهِ (قُلْ مَا أَسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ وَمَا أَنا من المتكلفين)"
      },
      {
        "id": 28967,
        "hadith_number": "273",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ilmu Adalah Agama: Pilihlah Sumber Pengajaran dengan Teliti",
        "perawi_melayu": "Ibn Sirin",
        "english_text": "And from Ibn Sirin, he said: Indeed, this knowledge is religion. So, consider from whom you take your religion.  Narrated by Muslim.",
        "malay_translation": "Dan daripada Ibn Sirin, beliau berkata: Sesungguhnya ilmu ini adalah agama. Oleh itu, perhatikanlah daripada siapa kamu mengambil agama kamu. Diriwayatkan oleh Muslim.",
        "arabic_text": "وَعَنِ ابْنِ سِيرِينَ قَالَ: إِنَّ هَذَا الْعِلْمَ دِينٌ فَانْظُرُوا عَمَّنْ تَأْخُذُونَ دِينَكُمْ. رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 28968,
        "hadith_number": "274",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pentingnya Keteguhan Bagi Para Qari' dan Bahaya Penyimpangan",
        "perawi_melayu": "Hudzaifah",
        "english_text": "And from Hudzaifah, he said: O assembly of readers, be steadfast, for you have already gained a great achievement, and if you are taken on the right and left, then indeed you have strayed far astray.  Narrated by al-Bukhari",
        "malay_translation": "Dan daripada Hudzaifah, beliau berkata: Wahai kaum para pembaca, tetaplah teguh, kerana sesungguhnya kalian telah mencapai kejayaan yang besar, dan jika kalian diseret ke kiri dan kanan, maka sesungguhnya kalian telah sesat dengan sesat yang jauh. Dikeluarkan oleh al-Bukhari.",
        "arabic_text": "وَعَن حُذَيْفَة قَالَ: يَا مَعْشَرَ الْقُرَّاءِ اسْتَقِيمُوا فَقَدْ سَبَقْتُمْ سَبْقًا بَعِيدًا وَإِنْ أُخِذْتُمْ يَمِينًا وَشِمَالًا لَقَدْ ضللتم ضلالا بَعيدا. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 28969,
        "hadith_number": "275",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perlindungan dari Lembah Kesedihan di Neraka",
        "perawi_melayu": null,
        "english_text": "And from Abu Hurairah, he said: The Messenger of Allah, peace and blessings be upon him, said, \"Seek refuge with Allah from the chasm of sorrow.\" They said, \"O Messenger of Allah, what is the chasm of sorrow?\" He said, \"A valley in Hell, from which Hell seeks refuge every day four hundred times.\" We said, \"O Messenger of Allah, who will enter it?\" He said, \"The hypocritical readers who are pretentious in their deeds.\" Narrated by al-Tirmidhi, and also by Ibn Majah, and he added in it: \"Indeed, among the most hated readers by Allah, the Most High, are those who visit the rulers.\" Al-Muharrabi said: Meaning the hypocrisy.",
        "malay_translation": "Dan daripada Abu Hurairah, dia berkata: Rasulullah SAW bersabda, \"Carilah perlindungan dengan Allah dari lembah kesedihan.\" Mereka bertanya, \"Wahai Rasulullah, apakah lembah kesedihan itu?\" Baginda menjawab, \"Sebuah lembah di dalam neraka, yang setiap hari neraka memohon perlindungan daripada lembah itu sebanyak empat ratus kali.\" Kami bertanya, \"Wahai Rasulullah, siapakah yang akan memasuki lembah itu?\" Baginda menjawab, \"Para pembaca yang munafik yang berpura-pura dalam amalan mereka.\" Diriwayatkan oleh al-Tirmidhi, dan juga oleh Ibn Majah, dan beliau menambah di dalamnya: \"Sesungguhnya di antara pembaca yang paling dibenci Allah SWT ialah mereka yang melawat para pemerintah.\" Al-Muharrabi berkata: Maksudnya kemunafikan.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَعَوَّذُوا بِاللَّهِ مِنْ جُبِّ الْحَزَنِ» قَالُوا: يَا رَسُولَ اللَّهِ وَمَا جُبُّ الْحَزَنِ؟ قَالَ: «وَادٍ فِي جَهَنَّمَ تَتَعَوَّذُ مِنْهُ جَهَنَّم كل يَوْم أَرْبَعمِائَة مرّة» . قُلْنَا: يَا رَسُولَ اللَّهِ وَمَنْ يَدْخُلُهَا قَالَ: «الْقُرَّاءُ الْمُرَاءُونَ بِأَعْمَالِهِمْ» . رَوَاهُ التِّرْمِذِيُّ وَكَذَا ابْنُ مَاجَهْ وَزَادَ فِيهِ: «وَإِنَّ مِنْ أَبْغَضِ الْقُرَّاءِ إِلَى اللَّهِ تَعَالَى الَّذِينَ يَزُورُونَ الْأُمَرَاءَ» . قَالَ الْمُحَارِبِيُّ: يَعْنِي الجورة"
      },
      {
        "id": 28970,
        "hadith_number": "276",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keadaan Zaman dan Keadaan Islam yang Merosot",
        "perawi_melayu": "Ali r.a.",
        "english_text": "And from Ali, he said: The Messenger of Allah, peace and blessings be upon him, said: \"Soon a time will come upon the people, in which there will remain nothing of Islam except its name, and nothing of the Quran except its script. Their mosques will be filled, but they will be desolate in terms of guidance. Their scholars will be the worst among those under the sky. From them will emerge fitnah (temptation), and in them will return fitnah.\"",
        "malay_translation": "Dan daripada Ali r.a., beliau berkata: Rasulullah SAW bersabda: \"Tidak lama lagi akan datang suatu zaman ke atas manusia, di mana tiada lagi yang tinggal daripada Islam melainkan namanya, dan tiada lagi yang tinggal daripada al-Quran melainkan tulisannya. Masjid-masjid mereka akan penuh sesak, tetapi mereka kosong dari petunjuk. Ulama mereka akan menjadi manusia yang terburuk di bawah langit. Dari kalangan mereka akan timbul fitnah, dan di dalam kalangan mereka pula fitnah akan kembali berulang.\"",
        "arabic_text": "وَعَنْ عَلِيٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يُوشِكُ أَنْ يَأْتِيَ عَلَى النَّاسِ زَمَانٌ لَا يَبْقَى مِنَ الْإِسْلَامِ إِلَّا اسْمُهُ وَلَا يَبْقَى مِنَ الْقُرْآنِ إِلَّا رَسْمُهُ مَسَاجِدُهُمْ عَامِرَةٌ وَهِيَ خَرَابٌ مِنَ الْهُدَى عُلَمَاؤُهُمْ شَرُّ مَنْ تَحْتَ أَدِيمِ السَّمَاءِ مِنْ عِنْدِهِمْ تَخْرُجُ الْفِتْنَةُ وَفِيهِمْ تَعُودُ» . رَوَاهُ الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَان"
      },
      {
        "id": 28971,
        "hadith_number": "277",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hilangnya Ilmu dan Amalan",
        "perawi_melayu": "Ziad bin Labid",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ziad bin Labid RA, beliau berkata: Nabi SAW menyebutkan sesuatu lalu bersabda: “Itu berlaku ketika hilangnya ilmu.” Aku bertanya: Wahai Rasulullah, bagaimana ilmu boleh hilang sedangkan kami membaca Al-Quran, mengajarkannya kepada anak-anak kami, dan anak-anak kami mengajarkannya kepada anak-anak mereka hingga hari kiamat? Baginda bersabda: “Semoga ibumu kehilanganmu wahai Ziad! Sesungguhnya aku menyangka engkau adalah orang yang paling faham di Madinah. Bukankah orang-orang Yahudi dan Nasrani membaca Taurat dan Injil, tetapi mereka tidak mengamalkan sedikit pun daripada apa yang terkandung di dalamnya?” (Riwayat Ahmad dan Ibnu Majah. At-Tirmizi meriwayatkan yang serupa daripadanya).",
        "arabic_text": "وَعَن زِيَاد بن لبيد قَالَ ذَكَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا فَقَالَ: «ذَاكَ عِنْدَ أَوَانِ ذَهَابِ الْعِلْمِ» . قُلْتُ: يَا رَسُولَ اللَّهِ وَكَيْفَ يَذْهَبُ الْعِلْمُ وَنحن نَقْرَأ الْقُرْآن ونقرئه أبناءنا ويقرؤه ابناؤنا أَبْنَاءَهُم إِلَى يَوْم الْقِيَامَة قَالَ: «ثَكِلَتْكَ أُمُّكَ زِيَادُ إِنْ كُنْتُ لَأُرَاكَ مِنْ أَفْقَهِ رَجُلٍ بِالْمَدِينَةِ أَوَلَيْسَ هَذِهِ الْيَهُودُ وَالنَّصَارَى يَقْرَءُونَ التَّوْرَاةَ وَالْإِنْجِيلَ لَا يَعْمَلُونَ بِشَيْءٍ مِمَّا فِيهِمَا» . رَوَاهُ أَحْمَدُ وَابْنُ مَاجَهْ وَرَوَى التِّرْمِذِيُّ عَنهُ نَحوه"
      },
      {
        "id": 28972,
        "hadith_number": "278",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis Mengenai Darimi dan Abu Umamah",
        "perawi_melayu": "Darimi dan Abu Umamah",
        "english_text": "And likewise, Darimi from Abu Umamah",
        "malay_translation": "Dan begitu juga, Darimi daripada Abu Umamah.",
        "arabic_text": "وَكَذَا الدَّارمِيّ عَن أبي أُمَامَة"
      },
      {
        "id": 28973,
        "hadith_number": "279",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menuntut dan Mengajarkan Ilmu",
        "perawi_melayu": "Ibnu Mas'ud",
        "english_text": "And from Ibn Mas'ud, he said: The Messenger of Allah (ﷺ) said to me: \"Learn knowledge and teach it to the people, learn the obligatory duties (Fara'id) and teach them to the people, learn the Quran and teach it to the people. For I am a man who will be taken (die), and knowledge will be taken (depart). And trials will appear until two people disagree over an obligatory duty and they do not find anyone to judge between them.\"",
        "malay_translation": "Daripada Ibnu Mas'ud, beliau berkata: Rasulullah ﷺ bersabda kepadaku: \"Pelajarilah ilmu dan ajarkannya kepada manusia, pelajarilah kewajipan-kewajipan (Fara'id) dan ajarkannya kepada manusia, pelajarilah Al-Quran dan ajarkannya kepada manusia. Sesungguhnya aku adalah seorang yang akan diwafatkan (meninggal dunia), dan ilmu akan diangkat (hilang). Dan fitnah akan muncul sehingga dua orang berselisih pendapat mengenai suatu kewajipan, dan mereka tidak menemui seorang pun untuk memutuskan antara mereka.\"",
        "arabic_text": "وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَعَلَّمُوا الْعِلْمَ وَعَلِّمُوهُ النَّاسَ تَعَلَّمُوا الْفَرَائِضَ وَعَلِّمُوهَا النَّاسَ تَعَلَّمُوا الْقُرْآنَ وَعَلِّمُوهُ النَّاسَ فَإِنِّي امْرُؤٌ مَقْبُوضٌ وَالْعِلْمُ سَيُقْبَضُ وَتَظْهَرُ الْفِتَنُ حَتَّى يَخْتَلِفَ اثْنَانِ فِي فَرِيضَةٍ لَا يَجِدَانِ أَحَدًا يَفْصِلُ بَيْنَهُمَا» . رَوَاهُ الدَّارِمِيُّ وَالدَّارَقُطْنِيّ"
      },
      {
        "id": 28974,
        "hadith_number": "280",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perumpamaan Ilmu yang Tidak Dimanfaatkan",
        "perawi_melayu": "Abi Hurairah",
        "english_text": "And from Abi Hurairah, he said: The Messenger of Allah, peace be upon him, said, \"The example of knowledge that is not used is like a treasure that is not spent in the way of Allah.\"",
        "malay_translation": "Daripada Abi Hurairah, katanya: Rasulullah SAW bersabda, \"Perumpamaan ilmu yang tidak dimanfaatkan sama seperti harta simpanan yang tidak dikeluarkan di jalan Allah.\" (Hadis riwayat al-Darimi)",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَثَلُ عِلْمٍ لَا يُنْتَفَعُ بِهِ كَمَثَلِ كَنْزٍ لَا يُنْفَقُ مِنْهُ فِي سَبِيل الله» . رَوَاهُ الدَّارمِيّ"
      }
    ]
  }
}