{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 64,
    "data": [
      {
        "id": 32076,
        "hadith_number": "3382",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kebebasan Seorang Hamba Muslim",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "From Abu Hurairah, he said: The Messenger of Allah (ﷺ) said, \"Whoever frees a Muslim slave, Allah will free a limb of his from the Fire for every limb of the slave until his private part for his private part.\"",
        "malay_translation": "Dari Abu Hurairah, beliau berkata: Rasulullah SAW bersabda: \"Barangsiapa yang memerdekakan seorang hamba sahaya Muslim, Allah SWT akan memerdekakan satu anggota badannya dari neraka bagi setiap anggota badan hamba sahaya itu sehingga kemaluannya bagi kemaluannya.\"",
        "arabic_text": "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَعْتَقَ رَقَبَةً مُسْلِمَةً أَعْتَقَ اللَّهُ بِكُلِّ عُضْوٍ مِنْهُ عُضْوًا مِنَ النَّارِ حَتَّى فَرْجَهُ بِفَرْجِهِ»"
      },
      {
        "id": 32077,
        "hadith_number": "3383",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Amalan Terbaik dan Membantu Orang Lain",
        "perawi_melayu": "Abu Dzar",
        "english_text": "It was narrated from Abu Dzar that he said: \"I asked the Prophet (ﷺ): 'Which deed is the best?' He said: 'Faith in Allah and striving in His path.' I said: 'Then which freeing of slaves is the best?' He said: 'The most expensive and the dearest to their people.' I said: 'If I do not do that?' He said: 'You help a craftsman or you craft for someone needy.' I said: 'If I do not do that?' He said: 'You restrain people from evil, for that is a charity that you give to yourself.'\"",
        "malay_translation": "Daripada Abu Dzar, beliau berkata: Aku bertanya kepada Nabi SAW: \"Amalan apakah yang paling afdal?\" Baginda menjawab: \"Iman kepada Allah dan jihad di jalan-Nya.\" Aku bertanya lagi: \"Kemudian, manakah yang lebih utama di antara membebaskan hamba sahaya?\" Baginda menjawab: \"Yang paling mahal harganya dan yang paling disayangi oleh keluarganya.\" Aku bertanya lagi: \"Jika aku tidak melakukannya?\" Baginda menjawab: \"Engkau bantu seorang tukang atau engkau bekerja untuk orang yang memerlukan.\" Aku bertanya lagi: \"Jika aku tidak melakukannya?\" Baginda menjawab: \"Engkau cegah manusia daripada kejahatan, kerana itu adalah sedekah yang engkau berikan kepada dirimu sendiri.\"",
        "arabic_text": "وَعَنْ أَبِي ذَرٍّ قَالَ: سَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَيُّ الْعَمَلِ أَفْضَلُ؟ قَالَ: «إِيمَانٌ بِاللَّهِ وَجِهَادٌ فِي سَبِيلِهِ» قَالَ: قُلْتُ: فَأَيُّ الرِّقَابِ أَفْضَلُ؟ قَالَ: «أَغْلَاهَا ثَمَنًا وَأَنْفَسُهَا عِنْدَ أَهْلِهَا» . قُلْتُ: فَإِنْ لَمْ أَفْعَلْ؟ قَالَ: «تُعِينُ صَانِعًا أَوْ تَصْنَعُ لِأَخْرَقَ» . قُلْتُ: فَإِنْ لَمْ أَفْعَلْ؟ قَالَ: «تَدَعُ النَّاسَ مِنَ الشَّرِّ فَإِنَّهَا صَدَقَةٌ تَصَدَّقُ بهَا على نَفسك»"
      },
      {
        "id": 32078,
        "hadith_number": "3384",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Panduan Amalan untuk Ke Syurga",
        "perawi_melayu": "Bara' bin Azib RA",
        "english_text": "A Bedouin asked the Prophet (PBUH) about a deed that would admit him to Paradise. The Prophet (PBUH) mentioned freeing a slave, helping to free a slave, giving charity, feeding the hungry, giving drink to the thirsty, enjoining good, forbidding evil, and controlling one's tongue.",
        "malay_translation": "Daripada al-Bara' bin Azib RA berkata: Seorang Badwi datang kepada Nabi SAW dan berkata: 'Ajarkan saya amalan yang dapat memasukkan saya ke syurga.' Baginda bersabda: 'Sesungguhnya jika ucapanmu ringkas, sesungguhnya permintaanmu luas. Bebaskanlah jiwa dan lepaskanlah hamba.' Dia bertanya: 'Bukankah keduanya sama?' Baginda bersabda: 'Tidak, membebaskan jiwa adalah engkau bersendirian membebaskannya, dan melepaskan hamba adalah engkau membantu dalam harganya. Dan pemberian yang bermanfaat adalah pemberian yang berterusan dan memberi perlindungan kepada kerabat yang zalim. Jika engkau tidak mampu melakukan itu, maka berilah makan orang yang lapar, berilah minum orang yang dahaga, suruhlah kepada yang ma'ruf dan cegahlah dari yang mungkar. Jika engkau tidak mampu, maka tahanlah lidahmu kecuali dari kebaikan.' Riwayat al-Baihaqi dalam Syu'ab al-Iman.",
        "arabic_text": "عَن الْبَراء بن عَازِب قَالَ: جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: عَلِّمْنِي عَمَلًا يُدْخِلُنِي الْجَنَّةَ قَالَ: «لَئِنْ كُنْتَ أَقْصَرْتَ الْخُطْبَةَ لَقَدْ أَعْرَضْتَ الْمَسْأَلَةَ أَعْتِقِ النَّسَمَةَ وَفك الرَّقَبَة» . قَالَ: أَو ليسَا وَاحِدًا؟ قَالَ: لَا عِتْقُ النَّسَمَةِ: أَنْ تَفَرَّدَ بِعِتْقِهَا وَفَكُّ الرَّقَبَةِ: أَنْ تُعِينَ فِي ثَمَنِهَا وَالْمِنْحَةَ: الْوَكُوفَ وَالْفَيْءَ عَلَى ذِي الرَّحِمِ الظَّالِمِ فَإِنْ لَمْ تُطِقْ ذَلِكَ فَأَطْعِمِ الْجَائِعَ وَاسْقِ الظَّمْآنَ وَأْمُرْ بِالْمَعْرُوفِ وَانْهَ عَنِ الْمُنْكَرِ فَإِنْ لم تطق فَكُفَّ لِسَانَكَ إِلَّا مِنْ خَيْرٍ . رَوَاهُ الْبَيْهَقِيُّ فِي شعب الْإِيمَان"
      },
      {
        "id": 32079,
        "hadith_number": "3385",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pahala Membina Masjid, Memerdekakan Hamba, dan Beruban di Jalan Allah",
        "perawi_melayu": "Amru bin Ubbasah",
        "english_text": "From Amr ibn Ubbasah that the Prophet (peace and blessings of Allah be upon him) said: \"Whoever builds a mosque for Allah to be remembered in it, a house will be built for him in Paradise. And whoever frees a Muslim slave, it will be his ransom from Hellfire. And whoever turns grey while striving in the way of Allah, it will be a light for him on the Day of Resurrection.\"",
        "malay_translation": "Daripada Amru bin Ubbasah bahawa Nabi SAW bersabda:  \"Sesiapa yang membina masjid untuk Allah SWT dikenang di dalamnya, nescaya akan dibina sebuah rumah baginya di syurga. Dan sesiapa yang memerdekakan seorang hamba Muslim, ia akan menjadi tebusannya daripada neraka Jahannam. Dan sesiapa yang beruban dalam perjuangan di jalan Allah, nescaya ia akan menjadi cahaya baginya pada hari kiamat.\" ",
        "arabic_text": "وَعَن عَمْرو بن عبسة أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ بَنَى مَسْجِدًا لِيُذْكَرَ اللَّهُ فِيهِ بُنِيَ لَهُ بَيْتٌ فِي الْجَنَّةِ وَمَنْ أَعْتَقَ نَفْسًا مُسْلِمَةً كَانَتْ فِدْيَتَهُ مِنْ جَهَنَّمَ. وَمَنْ شَابَ شَيْبَةً فِي سَبِيلِ اللَّهِ كَانَتْ لَهُ نُورًا يَوْم الْقِيَامَة» . رَوَاهُ فِي شرح السّنة"
      },
      {
        "id": 32080,
        "hadith_number": "3386",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Membebaskan Hamba daripada Api Neraka",
        "perawi_melayu": "Al-Gharib bin Ayyasy al-Daylami",
        "english_text": "From al-Gharib ibn Ayyash al-Daylami, who said: We came to Wathilah ibn al-Asqa' and said: Tell us a Hadith that contains neither addition nor subtraction. He became angry and said: Indeed, one of you may read while his Mushaf is hanging in his house, and he adds and subtracts. So we said: We only wanted a Hadith that you heard from the Prophet (peace and blessings of Allah be upon him). He said: We came to the Messenger of Allah (peace and blessings of Allah be upon him) concerning a companion of ours who deserved the fire (Hellfire) because of murder.  So he said: \"Emancipate him; for every limb of his, a limb will be saved from the Fire.\"",
        "malay_translation": "Daripada al-Gharib bin Ayyasy al-Daylami, berkata: Kami datang kepada Wathilah bin al-Asqa' lalu berkata: Ceritakan kepada kami sebuah Hadis yang tiada ditambah mahupun dikurangkan.  Maka dia marah dan berkata: Sesungguhnya salah seorang di antara kamu membaca al-Quran sedangkan mushafnya tergantung di rumahnya, lalu dia menambah dan mengurangkan.  Maka kami berkata: Kami hanya menginginkan Hadis yang engkau telah dengar daripada Nabi SAW.  Dia berkata: Kami datang kepada Rasulullah SAW mengenai seorang sahabat kami yang telah layak mendapat azab api neraka disebabkan membunuh.  Maka Baginda bersabda:  “Bebaskanlah dia; bagi setiap anggota badannya, satu anggota badannya akan diselamatkan daripada api neraka.”",
        "arabic_text": "عَن الغريف بن عَيَّاش الديلمي قَالَ: أَتَيْنَا وَاثِلَة بن الْأَسْقَع فَقُلْنَا: حَدِّثْنَا حَدِيثًا لَيْسَ فِيهِ زِيَادَةٌ وَلَا نُقْصَانٌ فَغَضِبَ وَقَالَ: إِنَّ أَحَدَكُمْ لَيَقْرَأُ وَمُصْحَفُهُ مُعَلَّقٌ فِي بَيْتِهِ فَيَزِيدُ وَيَنْقُصُ فَقُلْنَا: إِنَّمَا أَرَدْنَا حَدِيثًا سَمِعْتَهُ مِنَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسلم فَقَالَ: أَتَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَاحِبٍ لَنَا أَوْجَبَ يَعْنِي النَّارَ بِالْقَتْلِ فَقَالَ: «أعتقوا عَنهُ بِعِتْق الله بِكُل عُضْو مِنْهُ عُضْو أَمنه من النَّار» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ"
      },
      {
        "id": 32081,
        "hadith_number": "3387",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Sedekah Paling Utama: Membebaskan Hamba",
        "perawi_melayu": "Samurah bin Jundub",
        "english_text": "From Samurah ibn Jundub, he said: The Messenger of Allah (ﷺ) said: “The best charity is the intercession by which a slave is freed.” Reported by al-Bayhaqi in \"Sha'ab al-Iman\"",
        "malay_translation": "Daripada Samurah bin Jundub, beliau berkata: Rasulullah SAW bersabda:  “Sedekah yang paling utama ialah syafaat yang dengannya dapat membebaskan hamba.” Riwayat al-Bayhaqi dalam “Syu’ab al-Iman”.",
        "arabic_text": "وَعَن سَمُرَةَ بْنِ جُنْدُبٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَفْضَلُ الصَّدَقَةِ الشَّفَاعَةُ بِهَا تُفَكُّ الرَّقَبَة» . رَوَاهُ الْبَيْهَقِيّ فِي «شعب الْإِيمَان»"
      },
      {
        "id": 32082,
        "hadith_number": "3388",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Memerdekakan Hamba yang Dikongsi",
        "perawi_melayu": "[Nama Perawi Tidak Diketahui]",
        "english_text": "[English text not available]",
        "malay_translation": "Daripada Ibn Umar RA, beliau berkata: Rasulullah SAW bersabda: “Sesiapa yang memerdekakan bahagiannya dalam seorang hamba, dan dia mempunyai harta yang mencukupi harga hamba tersebut, maka hamba itu dinilai dengan nilai yang adil, kemudian rakan-rakannya (kongsi hamba tersebut) diberi bahagian mereka, dan hamba itu merdeka sepenuhnya. Jika tidak, maka hanya bahagian yang dia merdekakan sahaja yang merdeka.”",
        "arabic_text": "عَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَعْتَقَ شِرْكًا لَهُ فِي عَبْدٍ وَكَانَ لَهُ مَالٌ يَبْلُغُ ثَمَنَ الْعَبْدِ قُوِّمَ الْعَبْدُ قِيمَةَ عَدْلٍ فَأُعْطِيَ شُرَكَاؤُهُ حِصَصَهُمْ وَعَتَقَ عَلَيْهِ الْعَبْدُ وَإِلَّا فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ»"
      },
      {
        "id": 32083,
        "hadith_number": "3389",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Membebaskan Sebahagian daripada Seorang Hamba",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah, bahawa Rasulullah SAW bersabda:  \"Barangsiapa yang membebaskan sebahagian daripada seorang hamba, maka dia telah membebaskan seluruhnya. Jika hamba itu mempunyai harta, maka harta itu akan digunakan untuk membayar baki hutang pembebasannya. Jika hamba itu tidak mempunyai harta, maka pembebasan itu akan digantikan dengan sesuatu yang lain.\" ",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَعْتَقَ شِقْصًا فِي عَبْدٍ أُعْتِقَ كُلُّهُ إِنْ كَانَ لَهُ مَالٌ فَإِنْ لَمْ يَكُنْ لَهُ مَالٌ اسْتَسْعَى الْبعد غير مشقوق عَلَيْهِ»"
      },
      {
        "id": 32084,
        "hadith_number": "3390",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Memerdekakan Hamba Pada Waktu Kematian",
        "perawi_melayu": "Imran bin Husain",
        "english_text": "From Imran bin Husayn: That a man freed six of his slaves at the time of his death; he had no property except them. So the Messenger of Allah (ﷺ) called them and divided them into three parts, then he drew lots among them and freed two and manumitted four, and said to him a severe word. Muslim and Nasai narrated it from him and mentioned: \"I almost did not offer prayer for him,\" instead of: and said to him a severe word. And in the narration of Abu Dawud: He said: \"If I had witnessed him before he was buried, he would not have been buried in the Muslim graveyard.\"",
        "malay_translation": "Dari Imran bin Husain: bahawa seorang lelaki memerdekakan enam orang hambanya ketika hendak mati; dia tidak mempunyai harta selain daripada mereka. Maka Rasulullah ﷺ memanggil mereka dan membahagikan mereka kepada tiga bahagian, kemudian baginda membuat undian di antara mereka dan memerdekakan dua orang dan membebaskan empat orang lagi, dan berkata kepadanya kata-kata yang keras. Muslim dan Nasai meriwayatkannya darinya dan menyebut: \"Aku hampir tidak menunaikan solat jenazah ke atasnya,\" sebagai ganti: dan berkata kepadanya kata-kata yang keras. Dan di dalam riwayat Abu Daud: Baginda berkata: \"Sekiranya aku menyaksikannya sebelum dia dikebumikan, dia tidak akan dikebumikan di tanah perkuburan orang Islam.\"",
        "arabic_text": "وَعَن عمرَان بن حُصَيْن: أَنَّ رَجُلًا أَعْتَقَ سِتَّةَ مَمْلُوكِينَ لَهُ عِنْدَ مَوْتِهِ لَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُمْ فَدَعَا بهم رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَزَّأَهُمْ أَثْلَاثًا ثُمَّ أَقْرَعَ بَيْنَهُمْ فَأَعْتَقَ اثْنَيْنِ وَأَرَقَّ أَرْبَعَةً وَقَالَ لَهُ قَوْلًا شَدِيدًا. رَوَاهُ مُسْلِمٌ وَرَوَاهُ النَّسَائِيُّ عَنْهُ وَذَكَرَ: «لَقَدْ هَمَمْتُ أَنْ لَا أُصَلِّيَ عَلَيْهِ» بَدَلَ: وَقَالَ لَهُ قَوْلًا شَدِيدًا وَفِي رِوَايَةِ أَبِي دَاوُدَ: قَالَ: «لَوْ شَهِدْتُهُ قَبْلَ أَنْ يُدْفَنَ لَمْ يُدْفَنْ فِي مَقَابِر الْمُسلمين»"
      },
      {
        "id": 32085,
        "hadith_number": "3391",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Balasan Seorang Anak Terhadap Ayahnya",
        "perawi_melayu": "Abu Hurairah RA",
        "english_text": "Teks Bahasa Inggeris asal tiada.",
        "malay_translation": "Daripada Abu Hurairah RA berkata: Rasulullah SAW bersabda: 'Tidak ada seorang anak pun yang dapat membalas budi ayahnya kecuali jika dia mendapati ayahnya sebagai seorang hamba sahaya, lalu dia membelinya dan memerdekakannya.'",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَجْزِي وَلَدٌ وَالِده إِلَّا أَن يجده مَمْلُوكا فيشتر بِهِ فيعتقه» . رَوَاهُ مُسلم"
      },
      {
        "id": 32086,
        "hadith_number": "3392",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pembebasan Hamba dan Sedekah",
        "perawi_melayu": "Jabir",
        "english_text": "And from Jabir: that a man from the Ansar had enslaved a person, and he had no wealth other than him. So it reached the Prophet (ﷺ), so he said: “Who will buy him from me?” So Nu'aim bin al-Nahham bought him for eight hundred dirhams. Agreed upon. And in a narration of Muslim: So Nu'aim bin 'Abdullah al-'Adawi bought him for eight hundred dirhams, then he brought them to the Prophet (ﷺ), so he gave them to him, then he said: “Begin with yourself, then give in charity from it. Then if there is something left, then for your family. Then if there is something left from your family, then for your relatives. Then if there is something left from your relatives, then like this and like this,” he says: “before you and to your right and to your left.”",
        "malay_translation": "Dari Jabir: bahawa seorang lelaki daripada kalangan Ansar telah memperhambakan seseorang, dan dia tidak mempunyai harta lain selain daripada hamba itu. Maka sampai perkara itu kepada Nabi SAW, lalu baginda bersabda:  “Siapakah yang mahu membelinya daripada aku?” Maka Nu'aim bin al-Nahham membelinya dengan harga lapan ratus dirham.  (Hadis ini) disepakati.  Dan di dalam satu riwayat Muslim:  maka Nu'aim bin Abdullah al-'Adawi membelinya dengan harga lapan ratus dirham, kemudian dia membawanya kepada Nabi SAW, lalu baginda menerimanya, kemudian baginda bersabda: “Bermulailah dengan dirimu sendiri, kemudian sedekahkanlah sebahagian daripadanya. Jika ada lebihan, maka untuk keluargamu. Jika ada lebihan daripada bahagian untuk keluargamu, maka untuk kaum kerabatmu. Jika ada lebihan daripada bahagian untuk kaum kerabatmu, maka begitulah seterusnya.” Baginda SAW juga bersabda: “Di hadapanmu, di sebelah kananmu dan di sebelah kirimu.”",
        "arabic_text": "وَعَنْ جَابِرٍ: أَنَّ رَجُلًا مِنَ الْأَنْصَارِ دَبَّرَ مَمْلُوكًا وَلَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُ فَبَلَغَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «مَنْ يَشْتَرِيهِ مني؟» فَاشْتَرَاهُ نعيم بن النَّحَّامِ بِثَمَانِمِائَةِ دِرْهَمٍ. مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ لِمُسْلِمٍ: فَاشْتَرَاهُ نُعَيْمُ بْنُ عَبْدِ اللَّهِ الْعَدَوِيُّ بثمانمائة دِرْهَم فجَاء بِهَا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَفَعَهَا إِلَيْهِ ثُمَّ قَالَ: «ابْدَأْ بِنَفْسِكَ فَتَصَدَّقْ عَلَيْهَا فَإِنْ فَضَلَ شَيْءٌ فَلِأَهْلِكَ فَإِنْ فَضَلَ عَنْ أَهْلِكَ شَيْءٌ فَلِذِي قَرَابَتِكَ فَإِنْ فَضَلَ عَنْ ذِي قَرَابَتِكَ شَيْءٌ فَهَكَذَا وَهَكَذَا» يَقُولُ: فَبين يَديك وَعَن يَمِينك وَعَن شمالك"
      },
      {
        "id": 32087,
        "hadith_number": "3393",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kebebasan Orang yang Memiliki Hamba Mahram",
        "perawi_melayu": "Al-Hasan daripada Samurah daripada Rasulullah SAW",
        "english_text": "From Al-Hasan from Samurah from the Messenger of Allah (peace and blessings be upon him) who said: “Whoever owns a Mahram slave, then he is free.” Narrated by at-Tirmidhi, Abu Dawud and Ibn Majah.",
        "malay_translation": "Daripada Al-Hasan daripada Samurah daripada Rasulullah SAW, Baginda bersabda:  “Barang siapa yang memiliki hamba yang menjadi mahramnya, maka hamba itu adalah merdeka.”  Riwayat at-Tirmizi, Abu Daud dan Ibnu Majah.",
        "arabic_text": "عَن الْحسن عَن سَمُرَة عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «من ملك ذَا رحم محرم فَهُوَ حُرٌّ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَه"
      },
      {
        "id": 32088,
        "hadith_number": "3394",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pemanbebasan Hamba Perempuan yang Melahirkan Anak",
        "perawi_melayu": "Ibn Abbas daripada Nabi SAW",
        "english_text": "From Ibn Abbas from the Prophet (peace and blessings of Allaah be upon him), who said: “If a man’s slave-woman gives birth to a child for him, then she is freed from behind (from the remaining debt) of him or after that.”",
        "malay_translation": "Daripada Ibnu Abbas daripada Nabi Muhammad SAW, bahawa baginda bersabda:  “Jika hamba perempuan seorang lelaki melahirkan anak darinya, maka dia dibebaskan daripada hutang yang tinggal padanya atau selepas itu.”",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا وَلَدَتْ أَمَةُ الرَّجُلِ مِنْهُ فَهِيَ مُعْتَقَةٌ عَنْ دُبُرٍ مِنْهُ أَوْ بَعْدَهُ» . رَوَاهُ الدَّارِمِيُّ"
      },
      {
        "id": 32089,
        "hadith_number": "3395",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menjual Ibu-ibu Anak Yatim",
        "perawi_melayu": "Jabir",
        "english_text": "And from Jabir, he said: We used to sell the mothers of orphans during the time of the Messenger of Allah (peace and blessings of Allah be upon him) and Abu Bakr. Then when Umar became caliph, he forbade us from doing so, so we stopped.",
        "malay_translation": "Daripada Jabir, katanya: Kami biasa menjual ibu-ibu anak yatim pada zaman Rasulullah SAW dan Abu Bakar. Kemudian, apabila Umar menjadi khalifah, baginda melarang kami daripada berbuat demikian, maka kami pun berhenti.",
        "arabic_text": "وَعَنْ جَابِرٍ قَالَ: بِعْنَا أُمَّهَاتِ الْأَوْلَادِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ فَلَمَّا كَانَ عُمَرُ نَهَانَا عَنْهُ فَانْتَهَيْنَا. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32090,
        "hadith_number": "3396",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kepemilikan Harta Hamba yang Dimedekakan",
        "perawi_melayu": "Ibn Umar RA",
        "english_text": "Narrated Ibn Umar: The Messenger of Allah (peace and blessings of Allah be upon him) said: “Whoever frees a slave who has property, then the slave’s property is for him (the one who freed him), unless the master stipulates (otherwise).” Reported by Abu Dawood and Ibn Majah.",
        "malay_translation": "Daripada Ibn Umar RA berkata: Rasulullah SAW bersabda: \"Sesiapa yang memerdekakan seorang hamba yang mempunyai harta, maka harta hamba itu adalah untuknya (orang yang memerdekakannya), kecuali jika tuan (hamba) mensyaratkan (sebaliknya).\" Riwayat Abu Daud dan Ibn Majah.",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَعْتَقَ عَبْدًا وَلَهُ مَالٌ فَمَالُ الْعَبْدِ لَهُ إِلَّا أَنْ يَشْتَرِطَ السَّيِّدُ» . رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ"
      },
      {
        "id": 32091,
        "hadith_number": "3397",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pengbebasan Hamba dan Tauhid",
        "perawi_melayu": "Dari al-Malih daripada bapanya",
        "english_text": "And from al-Malih from his father: that a man freed a part of a slave boy, and he mentioned this to the Prophet (peace and blessings of Allaah be upon him), so he said: \"There is no partner for Allaah.\" So he permitted his manumission. Abu Dawood narrated it.",
        "malay_translation": "Dari al-Malih daripada bapanya; bahawa seorang lelaki telah membebaskan sebahagian daripada seorang budak lelaki, lalu baginda memberitahu Nabi SAW, maka baginda bersabda:  \"Tiada sekutu bagi Allah.\"  Maka baginda membenarkan pembebasannya.  Riwayat Abu Daud.",
        "arabic_text": "وَعَن الْمَلِيحِ عَنْ أَبِيهِ: أَنَّ رَجُلًا أَعْتَقَ شِقْصًا مِنْ غُلَامٍ فَذَكَرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «لَيْسَ لِلَّهِ شَرِيكٌ» فَأَجَازَ عتقه. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32092,
        "hadith_number": "3398",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penghambaan dan Perkhidmatan kepada Rasulullah SAW",
        "perawi_melayu": "Sufyan",
        "english_text": "Not Available",
        "malay_translation": "Daripada Sufyan, katanya: Aku pernah menjadi hamba kepada Umm Salamah.  Beliau berkata: Aku bebaskan engkau dengan syarat engkau berkhidmat kepada Rasulullah SAW selama engkau hidup. Aku berkata: Sekiranya engkau tidak mensyaratkannya, aku tetap tidak akan meninggalkan Rasulullah SAW selama aku hidup. Maka beliau membebaskanku dengan syarat itu.",
        "arabic_text": "وَعَن سفينة قَالَ: كُنْتُ مَمْلُوكًا لِأُمِّ سَلَمَةَ فَقَالَتْ: أُعْتِقُكَ وَأَشْتَرِطُ عَلَيْكَ أَنْ تَخْدُمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا عِشْتَ فَقُلْتُ: إِنْ لَمْ تَشْتَرِطِي عَلَيَّ مَا فَارَقْتُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا عِشْتُ فَأَعْتَقَتْنِي وَاشْتَرَطَتْ عَلَيَّ. رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ"
      },
      {
        "id": 32093,
        "hadith_number": "3399",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Status Mukatib (Hamba yang sedang menebus dirinya)",
        "perawi_melayu": "Amr bin Shu'aib daripada bapanya daripada datuknya daripada Nabi SAW",
        "english_text": "Not Available",
        "malay_translation": "Daripada Amr bin Shu'aib daripada bapanya daripada datuknya daripada Nabi Muhammad SAW, baginda bersabda:  \"Mukatib (hamba yang sedang menebus dirinya) tetap dianggap sebagai hamba selagi masih ada baki harga tebusan yang perlu dibayar.\"",
        "arabic_text": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْمُكَاتَبُ عَبْدٌ مَا بَقِيَ عَلَيْهِ مِنْ مُكَاتبَته دِرْهَم» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32094,
        "hadith_number": "3400",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perintah Berhijab daripada Mukatab Setelah Menunaikan Kontrak",
        "perawi_melayu": "Ummu Salamah",
        "english_text": "Umm Salamah reported that the Messenger of Allah (peace and blessings of Allah be upon him) said: 'If a *mukātab* (slave under contract of manumission) belonging to one of you has fulfilled his contract, then she should observe hijab from him.'",
        "malay_translation": "Daripada Ummu Salamah RA, beliau berkata: Rasulullah SAW bersabda: 'Jika seorang *mukātab* (hamba yang membuat perjanjian penebusan diri) milik salah seorang daripada kamu telah menunaikan perjanjiannya, maka hendaklah dia berhijab daripadanya.'",
        "arabic_text": "وَعَنْ أُمِّ سَلَمَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا كَانَ عِنْدَ مكَاتب إحداكن وَفَاء فلنحتجب مِنْهُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ"
      },
      {
        "id": 32095,
        "hadith_number": "3401",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hutang dan Kebebasan Seorang Hamba",
        "perawi_melayu": "Amru bin Syu'aib daripada bapanya daripada datuknya",
        "english_text": "Not Available",
        "malay_translation": "Daripada Amru bin Syu'aib daripada bapanya daripada datuknya bahawa Rasulullah SAW bersabda:  \"Sesiapa yang menulis surat hutang kepada hambanya sebanyak seratus uqiyyah, kemudian hambanya itu membayarnya kecuali sepuluh uqiyyah atau sepuluh dinar, kemudian dia (hamba) tidak mampu membayar lagi, maka dia masih lagi dianggap sebagai hamba.\"  (Riwayat al-Tirmizi, Abu Daud dan Ibnu Majah)",
        "arabic_text": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: مَنْ كَاتَبَ عَبْدَهُ عَلَى مِائَةِ أُوقِيَّةٍ فَأَدَّاهَا إِلَّا عَشْرَ أَوَاقٍ أَوْ قَالَ: عَشْرَةَ دَنَانِيرَ ثُمَّ عَجَزَ فَهُوَ رَقِيقٌ . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد وَابْن مَاجَه"
      },
      {
        "id": 32096,
        "hadith_number": "3402",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hak Warisan Seorang Mukatib",
        "perawi_melayu": "Ibn Abbas daripada Nabi SAW",
        "english_text": "From Ibn Abbas from the Prophet (peace and blessings of Allaah be upon him), who said: “If the mukatib (manumitted slave) obtains something by way of blood-money or inheritance, he inherits according to what he has ransomed himself for.” Abu Dawood and at-Tirmidhi narrated it. In one narration, he said: “The mukatib is given a share according to what he has paid of the blood-money of a free man, and what remains is the blood-money of a slave.”",
        "malay_translation": "Daripada Ibnu Abbas daripada Nabi SAW, Baginda bersabda:  “Jika seorang mukatib (hamba yang sedang menebus dirinya) mendapat sesuatu melalui diyat (tebusan darah) atau pusaka, maka dia mewarisi mengikut kadar apa yang telah ditebusnya.”  Riwayat Abu Daud dan Tirmizi. Dalam satu riwayat lain, Baginda bersabda: “Mukatib diberikan bahagian mengikut apa yang telah dibayarnya daripada diyat orang merdeka, dan baki yang tinggal adalah diyat hamba.”",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا أَصَابَ الْمُكَاتَبُ حَدًّا أَوْ مِيرَاثًا وَرِثَ بِحِسَابِ مَا عَتَقَ مِنْهُ» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَفِي رِوَايَةٍ لَهُ قَالَ: «يُودَى الْمُكَاتَبُ بِحِصَّةِ مَا أَدَّى دِيَةَ حر وَمَا بَقِي دِيَة عبد» . وَضَعفه الفص الثَّالِث"
      },
      {
        "id": 32097,
        "hadith_number": "3403",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Membebaskan Hamba Sebagai Sedekah Setelah Kematian Ibu",
        "perawi_melayu": "Abd al-Rahman bin Abi Amrah al-Ansari",
        "english_text": "From Abd al-Rahman bin Abi Amrah al-Ansari: That his mother intended to free (a slave), but delayed it until morning, then she died. Abd al-Rahman said: So I asked al-Qasim bin Muhammad: Will it benefit her if I free (a slave) on her behalf? Al-Qasim said: Sa'd bin `Ubadah came to the Messenger of Allah, peace and blessings of Allah be upon him, and said: My mother has died, will it benefit her if I free (a slave) on her behalf? The Messenger of Allah, peace and blessings of Allah be upon him, said: \"Yes.\"",
        "malay_translation": "Daripada Abd al-Rahman bin Abi 'Amrah al-Ansari: bahawa ibunya berniat untuk membebaskan (seorang hamba), tetapi menangguhkannya sehingga pagi, kemudian dia meninggal dunia. Abd al-Rahman berkata: Maka aku bertanya kepada al-Qasim bin Muhammad: Adakah ia memberi manfaat kepadanya jika aku membebaskan (seorang hamba) bagi pihak ibunya? Al-Qasim berkata: Sa'd bin 'Ubadah datang kepada Rasulullah SAW dan berkata: Ibuku telah meninggal dunia, adakah ia memberi manfaat kepadanya jika aku membebaskan (seorang hamba) bagi pihaknya? Rasulullah SAW bersabda: \"Ya.\" Riwayat Malik.",
        "arabic_text": "عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمْرَةَ الْأَنْصَارِيِّ: أَنَّ أُمَّهُ أَرَادَتْ أَنْ تَعْتِقَ فَأَخَّرَتْ ذَلِكَ إِلَى أَنْ تُصْبِحَ فَمَاتَتْ قَالَ عَبْدُ الرَّحْمَنِ: فَقُلْتُ لِلْقَاسِمِ بْنِ مُحَمَّدٍ: أَيَنْفَعُهَا أَنْ أَعْتِقَ عَنْهَا؟ فَقَالَ الْقَاسِمُ: أَتَى سَعْدُ بْنُ عُبَادَةَ رَسُول الله صلى الله عَلَيْهِ وَسلم فَقَالَ: إِنَّ أُمِّي هَلَكَتْ فَهَلْ يَنْفَعُهَا أَنْ أَعْتِقَ عَنْهَا؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نعم» . رَوَاهُ مَالك"
      },
      {
        "id": 32098,
        "hadith_number": "3404",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kematian Abdur Rahman bin Abi Bakar dan Pembebasan Hamba oleh Aisyah",
        "perawi_melayu": "Yahya bin Said",
        "english_text": "From Yahya bin Sa'id, he said: Abdur Rahman bin Abi Bakr died in his sleep, and his sister A'ishah freed many slaves on his behalf.",
        "malay_translation": "Dari Yahya bin Said, beliau berkata: Abdur Rahman bin Abi Bakar meninggal dunia ketika tidur, dan saudari perempuannya, Aisyah, telah membebaskan ramai hamba bagi pihak beliau.",
        "arabic_text": "وَعَنْ يَحْيَى بْنِ سَعِيدٍ قَالَ: تُوُفِّيَ عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرٍ فِي نَوْمٍ نَامَهُ فَأَعْتَقَتْ عَنْهُ عَائِشَةُ أُخْتُهُ رِقَابًا كَثِيرَةً. رَوَاهُ مَالك"
      },
      {
        "id": 32099,
        "hadith_number": "3405",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hak Milik Hamba",
        "perawi_melayu": "Abdullah bin Umar",
        "english_text": "From Abdullah ibn Umar (may Allah be pleased with them both), he said: The Messenger of Allah (peace and blessings of Allah be upon him) said: \"Whoever buys a slave and does not stipulate his wealth, then he has nothing.\"",
        "malay_translation": "Daripada Abdullah bin Umar رضي الله عنهما, beliau berkata: Rasulullah ﷺ bersabda:  \"Barangsiapa membeli seorang hamba dan tidak mensyaratkan hartanya, maka dia tidak mempunyai apa-apa.\" Riwayat Ad-Darimi.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اشْتَرَى عَبْدًا فَلَمْ يَشْتَرِطْ مَاله فَلَا شَيْء لَهُ» . رَوَاهُ الدَّارمِيّ"
      },
      {
        "id": 32100,
        "hadith_number": "3406",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Sumpah Nabi SAW: 'Tidak' dan 'Yang Membolak-balikkan Hati'",
        "perawi_melayu": "Ibn Umar",
        "english_text": "From Ibn Umar (may Allah be pleased with them both): The most frequent oath of the Prophet (peace and blessings of Allah be upon him) was: \"No, and the Turner of hearts.\"",
        "malay_translation": "Daripada Ibnu Umar (radiallahu 'anhuma):  Sumpah yang paling kerap digunakan oleh Nabi SAW ialah:  'Tidak, dan Yang Membolak-balikkan hati.'",
        "arabic_text": "عَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا أَكْثَرُ مَا كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يحلف: «لَا ومقلب الْقُلُوب» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32101,
        "hadith_number": "3407",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Bersumpah dengan Nama Bapa dan Anjuran Bersumpah dengan Nama Allah atau Diam",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "And from him (Abu Hurairah) that the Messenger of Allah (ﷺ) said: \"Indeed, Allah forbids you from swearing by your forefathers. Whoever is to swear, let him swear by Allah or remain silent.\"",
        "malay_translation": "Dan daripada beliau (Abu Hurairah) bahawa Rasulullah ﷺ bersabda: \"Sesungguhnya Allah melarang kamu daripada bersumpah dengan nama bapa-bapa kamu. Sesiapa yang hendak bersumpah, maka hendaklah dia bersumpah dengan nama Allah atau diam.\"",
        "arabic_text": "وَعَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ مَنْ كَانَ حَالِفًا فَلْيَحْلِفْ بِاللَّهِ أَوْ ليصمت»"
      },
      {
        "id": 32102,
        "hadith_number": "3408",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Bersumpah dengan Selain Allah",
        "perawi_melayu": "Abd al-Rahman bin Samurah",
        "english_text": "From Abd al-Rahman ibn Samurah, he said: The Messenger of Allah (peace and blessings be upon him) said: \"Do not swear by false deities or by your fathers.\"",
        "malay_translation": "Daripada Abd al-Rahman bin Samurah, beliau berkata: Rasulullah SAW bersabda:  \"Janganlah kamu bersumpah dengan berhala-berhala atau dengan bapa-bapa kamu.\"",
        "arabic_text": "وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَحْلِفُوا بِالطَّوَاغِي وَلَا بِآبَائِكُمْ» . رَوَاهُ مُسلم"
      },
      {
        "id": 32103,
        "hadith_number": "3409",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menghapus Sumpah Palsu dan Keutamaan Sedekah",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "From Abu Hurairah from the Prophet (peace and blessings of Allah be upon him) who said: Whoever swears an oath and says in his oath: By Al-Lat and Al-Uzza, then let him say: La ilaha illa Allah. And whoever says to his companion: Come, I will gamble with you, then let him give charity.",
        "malay_translation": "Dari Abu Hurairah daripada Nabi Muhammad SAW, baginda bersabda:  Barang siapa yang bersumpah dan berkata dalam sumpahnya: Demi Al-Lat dan Al-Uzza, maka hendaklah dia berkata: Tiada Tuhan melainkan Allah. Dan barang siapa yang berkata kepada sahabatnya: Mari, aku akan berjudi denganmu, maka hendaklah dia bersedekah.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: مَنْ حَلَفَ فَقَالَ فِي حَلِفِهِ: بِاللَّاتِ وَالْعُزَّى فَلْيَقُلْ: لَا إِلَهَ إِلَّا اللَّهُ. وَمَنْ قَالَ لِصَاحِبِهِ: تَعَالَ أقامرك فليتصدق"
      },
      {
        "id": 32104,
        "hadith_number": "3410",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Sumpah Palsu, Bunuh Diri, Mencela & Menuduh Kafir",
        "perawi_melayu": "Thabit bin Dzuhakk",
        "english_text": "And from Thabit ibn Ad-Dhahak, he said: The Messenger of Allah (ﷺ) said: “Whoever swears allegiance to a religion other than Islam falsely, he is as he has said. And there is no accountability for the son of Adam in what he does not control. And whoever kills himself with something in the world, he will be punished with it on the Day of Resurrection. And whoever curses a believer, it is like killing him. And whoever accuses a believer of disbelief, it is like killing him. And whoever makes a false claim to increase thereby, Allah will only decrease it for him.”",
        "malay_translation": "Daripada Thabit bin Dzuhakk, katanya: Rasulullah SAW bersabda:  “Sesiapa yang memberi bai’ah (sumpah setia) kepada agama selain Islam dengan palsu, maka dia adalah sepertimana yang telah diucapkannya. Dan anak Adam tidak akan dipertanggungjawabkan atas apa yang tidak mampu dikendalikannya. Dan sesiapa yang membunuh dirinya sendiri dengan sesuatu di dunia, nescaya dia akan diseksa dengannya pada hari kiamat. Dan sesiapa yang melaknat seorang mukmin, maka ia adalah seperti membunuhnya. Dan sesiapa yang menuduh seorang mukmin dengan kekufuran, maka ia adalah seperti membunuhnya. Dan sesiapa yang mendakwa sesuatu dakwaan palsu untuk menambahkan sesuatu kepadanya, nescaya Allah SWT tidak akan menambahkan melainkan hanya akan mengurangkannya.”",
        "arabic_text": "وَعَنْ ثَابِتِ بْنِ الضَّحَّاكِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ حَلَفَ عَلَى مِلَّةٍ غَيْرِ الْإِسْلَامِ كَاذِبًا فَهُوَ كَمَا قَالَ وَلَيْسَ عَلَى ابْنِ آدَمَ فِيمَا لَا يَمْلِكُ وَمَنْ قَتَلَ نَفْسَهُ بِشَيْءٍ فِي الدُّنْيَا عُذِّبَ بِهِ يَوْمَ الْقِيَامَةِ وَمَنْ لَعَنَ مُؤْمِنًا فَهُوَ كَقَتْلِهِ وَمَنْ قَذَفَ مُؤْمِنًا بِكُفْرٍ فَهُوَ كَقَتْلِهِ وَمَنِ ادَّعَى دَعْوَى كَاذِبَةً لِيَتَكَثَّرَ بِهَا لَمْ يَزِدْهُ اللَّهُ إِلَّا قِلَّةً»"
      },
      {
        "id": 32105,
        "hadith_number": "3411",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Tidak Akan Berpegang Teguh Pada Sumpah Jika Terdapat Pilihan Yang Lebih Baik",
        "perawi_melayu": "Abu Musa al-Asy'ari",
        "english_text": "From Abu Musa, who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: \"I swear by Allah, if Allah wills, I will not swear an oath and then see something better than it, except that I will atone for my oath and choose what is better.\"",
        "malay_translation": "Daripada Abu Musa, katanya: Rasulullah SAW bersabda:  \"Demi Allah, jika Allah menghendaki, aku tidak akan bersumpah kemudian mendapati sesuatu yang lebih baik daripadanya, melainkan aku akan bertaubat daripada sumpahku dan memilih yang lebih baik.\"",
        "arabic_text": "وَعَنْ أَبِي مُوسَى قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَنِّي وَاللَّهِ إِنْ شَاءَ اللَّهُ لَا أَحْلِفُ عَلَى يَمِينٍ فَأَرَى غَيْرَهَا خَيْرًا مِنْهَا إِلَّا كَفَّرْتُ عَنْ يَمِينِي وَأَتَيْتُ الَّذِي هُوَ خَيْرٌ»"
      },
      {
        "id": 32106,
        "hadith_number": "3412",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mencari Jawatan Kepimpinan dan Mengingkari Sumpah",
        "perawi_melayu": "Abd al-Rahman bin Samurah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abd al-Rahman bin Samurah, katanya: Rasulullah SAW bersabda: \"Wahai Abd al-Rahman bin Samurah, janganlah engkau meminta jawatan kepimpinan.  Sesungguhnya jika engkau diberi jawatan itu kerana permintaanmu, engkau akan dibebankan tanggungjawabnya, dan jika engkau diberi jawatan itu tanpa meminta, engkau akan dibantu dalam menjalaninya.  Dan jika engkau telah bersumpah atas sesuatu, kemudian engkau mendapati sesuatu yang lain lebih baik daripadanya, maka batalkanlah sumpahmu dan lakukanlah apa yang lebih baik.\"  Dalam riwayat lain:  \"Maka lakukanlah apa yang lebih baik dan batalkan sumpahmu.\"",
        "arabic_text": "وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا عَبْدَ الرَّحْمَنِ بْنَ سَمُرَةَ لَا تَسْأَلِ الْإِمَارَةَ فَإِنَّكَ إِنْ أُوتِيتَهَا عَنْ مَسْأَلَةٍ وُكِلْتَ إِلَيْهَا وَإِنْ أُوتِيتَهَا عَنْ غَيْرِ مَسْأَلَةٍ أُعِنْتَ عَلَيْهَا وَإِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا فَكَفِّرْ عَنْ يَمِينِكَ وَأْتِ الَّذِي هُوَ خَيْرٌ» . وَفِي رِوَايَةٍ: «فَأْتِ الَّذِي هُوَ خير وَكفر عَن يَمِينك»"
      },
      {
        "id": 32107,
        "hadith_number": "3413",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mengganti Sumpah Dengan Amalan Yang Lebih Baik",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "From Abu Hurairah that the Messenger of Allah (peace and blessings be upon him) said: “Whoever swears an oath and then sees something better than it, let him expiate for his oath and do it.”",
        "malay_translation": "Dari Abu Hurairah, bahawa Rasulullah SAW bersabda:  “Barang siapa yang bersumpah kemudian dia melihat sesuatu yang lebih baik daripada sumpahnya itu, maka hendaklah dia bertaubat daripada sumpahnya dan lakukannya.”",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى خَيْرًا مِنْهَا فَلْيُكَفِّرْ عَنْ يَمِينِهِ وليفعل» . رَوَاهُ مُسلم"
      },
      {
        "id": 32108,
        "hadith_number": "3414",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Dosa Zina Lebih Besar Daripada Kafarah",
        "perawi_melayu": "Riwayat daripada Baginda SAW",
        "english_text": "Not Available",
        "malay_translation": "Daripada Baginda SAW, Baginda bersabda: Demi Allah, sesungguhnya bagi seseorang di antara kamu untuk melakukan zina dengan isterinya adalah lebih berdosa di sisi Allah daripada membayar kafarah yang telah Allah wajibkan ke atasnya.",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَاللَّهِ لَأَنْ يَلَجَّ أَحَدُكُمْ بِيَمِينِهِ فِي أَهْلِهِ آثَمُ لَهُ عِنْدَ الله نم أَنْ يُعْطِيَ كَفَّارَتَهُ الَّتِي افْتَرَضَ اللَّهُ عَلَيْهِ»"
      },
      {
        "id": 32109,
        "hadith_number": "3415",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Sumpah Mengikut Kesaksian Sahabat",
        "perawi_melayu": "Daripada riwayat Muslim",
        "english_text": "Not Available",
        "malay_translation": "Daripada sebuah riwayat, Rasulullah SAW bersabda: “Sumpahmu hendaklah berdasarkan apa yang disahkan oleh sahabatmu.”",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَمِينُكَ عَلَى مَا يُصَدِّقُكَ عَلَيْهِ صَاحبك» . رَوَاهُ مُسلم"
      },
      {
        "id": 32110,
        "hadith_number": "3416",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Sumpah Berdasarkan Niat Orang yang Bersumpah",
        "perawi_melayu": "Daripada sumber yang sahih",
        "english_text": "Not Available",
        "malay_translation": "Daripada sumber yang sahih, bahawa Rasulullah SAW bersabda:  \"Sumpah itu berdasarkan niat orang yang bersumpah.\"  Riwayat Muslim.",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْيَمِينُ عَلَى نِيَّةِ الْمُسْتَحْلِفِ» . رَوَاهُ مُسلم"
      },
      {
        "id": 32111,
        "hadith_number": "3417",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ayat tentang Sumpah yang Tidak Bermaksud",
        "perawi_melayu": "Aisyah r.a.",
        "english_text": "From Ayesha (may Allah be pleased with her), she said: This verse was revealed: (Allah will not call you to account for what is unintentional in your oaths), concerning a man saying: No, by Allah, yes, by Allah.",
        "malay_translation": "Daripada Aisyah r.a., beliau berkata: Ayat ini diturunkan: (Allah tidak akan meminta pertanggungjawaban kamu terhadap sumpah-sumpah kamu yang tidak disengajakan), berkenaan dengan seorang lelaki yang berkata: Tidak, demi Allah, ya, demi Allah.",
        "arabic_text": "عَن عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: أُنْزِلَتْ هَذِهِ الْآيَةُ: (لَا يُؤَاخِذُكُمُ اللَّهُ بِاللَّغْوِ فِي أَيْمَانِكُمْ) فِي قَوْلِ الرَّجُلِ: لَا وَاللَّهِ وَبَلَى وَاللَّهِ. رَوَاهُ الْبُخَارِيُّ وَفِي شَرْحِ السُّنَّةِ لَفْظُ الْمَصَابِيحِ وَقَالَ: رَفَعَهُ بَعْضُهُمْ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنهُ"
      },
      {
        "id": 32112,
        "hadith_number": "3418",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Bersumpah Dengan Selain Allah",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "From Abu Hurairah, he said: The Messenger of Allah (peace and blessings be upon him) said: \"Do not swear by your fathers, nor by your mothers, nor by the idols, and do not swear by Allah except when you are truthful.\"",
        "malay_translation": "Dari Abu Hurairah, beliau berkata: Rasulullah SAW bersabda:  \"Janganlah kamu bersumpah dengan nama bapa kamu, mahupun ibu kamu, mahupun dengan berhala-berhala, dan janganlah kamu bersumpah dengan nama Allah melainkan jika kamu benar.\"",
        "arabic_text": "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَحْلِفُوا بِآبَائِكُمْ وَلَا بِأُمَّهَاتِكُمْ وَلَا بِالْأَنْدَادِ وَلَا تَحْلِفُوا بِاللَّهِ إِلَّا وَأَنْتُمْ صَادِقُونَ» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ"
      },
      {
        "id": 32113,
        "hadith_number": "3419",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Bersumpah Dengan Selain Allah",
        "perawi_melayu": "Ibn Umar",
        "english_text": "From Ibn Umar (may Allah be pleased with them both), he said: I heard the Messenger of Allah (peace and blessings of Allah be upon him) say: “Whoever swears by other than Allah has committed shirk.” Reported by Tirmidhi.",
        "malay_translation": "Daripada Ibnu Umar r.a., beliau berkata: Saya mendengar Rasulullah s.a.w. bersabda:  “Barang siapa bersumpah dengan selain Allah, maka sesungguhnya dia telah melakukan syirik.” Riwayat Tirmizi.",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ حَلَفَ بِغَيْرِ اللَّهِ فَقَدْ أَشْرَكَ» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 32114,
        "hadith_number": "3420",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Sumpah Palsu: Bukan Daripada Golongan Kita",
        "perawi_melayu": "Buridah",
        "english_text": "From Buraydah, he said: The Messenger of Allah (ﷺ) said, \"Whoever swears by something which is not true, then he is not from amongst us.\"",
        "malay_translation": "Daripada Buridah, katanya: Rasulullah SAW bersabda:  \"Barangsiapa yang bersumpah dengan sesuatu yang palsu, maka dia bukanlah daripada kalangan kita.\"",
        "arabic_text": "وَعَنْ بُرَيْدَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ حَلَفَ بِالْأَمَانَةِ فَلَيْسَ منا» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32115,
        "hadith_number": "3421",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penafian Islam",
        "perawi_melayu": "Daripada beberapa perawi",
        "english_text": "Not Available",
        "malay_translation": "Daripada baginda SAW, Baginda bersabda: Sesiapa yang berkata: “Aku berlepas diri daripada Islam”, maka jika dia berdusta, maka dia seperti apa yang dikatakannya, dan jika dia benar, maka dia tidak akan kembali kepada Islam dengan selamat.  (Riwayat Abu Daud, Nasai dan Ibnu Majah)",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ قَالَ: إِنِّي بَرِيءٌ مِنَ الْإِسْلَامِ فَإِنْ كَانَ كَاذِبًا فَهُوَ كَمَا قَالَ وَإِنْ كَانَ صَادِقًا فَلَنْ يَرْجِعَ إِلَى الْإِسْلَامِ سَالِمًا . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ"
      },
      {
        "id": 32116,
        "hadith_number": "3422",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Sumpah Nabi SAW Ketika Bersungguh-sungguh",
        "perawi_melayu": "Abu Sa'id al-Khudri",
        "english_text": "Abu Sa'id al-Khudri reported: When the Messenger of Allah (ﷺ) exerted himself in taking an oath, he would say: 'No, by Him in Whose Hand is the soul of Abu al-Qasim (ﷺ).'",
        "malay_translation": "Daripada Abu Sa'id al-Khudri meriwayatkan: Apabila Rasulullah (ﷺ) bersungguh-sungguh dalam bersumpah, baginda bersabda: 'Tidak, demi Zat yang jiwaku berada di tangan-Nya, iaitu Abu al-Qasim (ﷺ).'",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اجْتَهَدَ فِي الْيَمِينِ قَالَ: «لَا وَالَّذِي نفس أَبُو الْقَاسِم بِيَدِهِ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32117,
        "hadith_number": "3423",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Sumpah Rasulullah SAW",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "From Abu Hurairah (RA) who said: The oath of the Messenger of Allah (peace and blessings be upon him) when he swore an oath was: \"Laa wa astaghfirullah\" (No, and I seek forgiveness from Allah).",
        "malay_translation": "Daripada Abu Hurairah r.a. berkata:  Sumpah Rasulullah SAW apabila baginda bersumpah ialah:  \"Laa wa astaghfirullah\" (Tidak, dan aku memohon ampun daripada Allah). Riwayat Abu Daud dan Ibnu Majah.",
        "arabic_text": "وَعَن أبي هُرَيْرَة قَالَ: كَانَتْ يَمِينُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا حَلَفَ: «لَا وَأَسْتَغْفِرُ اللَّهَ» . رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه"
      },
      {
        "id": 32118,
        "hadith_number": "3424",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kebebasan Dari Sumpah Dengan Syarat 'InsyaAllah'",
        "perawi_melayu": "Ibn Umar",
        "english_text": "From Ibn Umar that the Messenger of Allah (ﷺ) said: Whoever swears an oath and says, \"If Allah wills,\" then there is no blame on him.",
        "malay_translation": "Daripada Ibnu Umar bahawa Rasulullah SAW bersabda: Barang siapa bersumpah dan berkata, \"Insya-Allah\", maka tidak ada kesalahan baginya.",
        "arabic_text": "مَرْفُوع وَعَنِ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى الله ليه وَسَلَّمَ قَالَ: مَنْ حَلَفَ عَلَى يَمِينٍ فَقَالَ: إِنْ شَاءَ اللَّهُ فَلَا حِنْثَ عَلَيْهِ . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ وَذَكَرَ التِّرْمِذِيُّ جَمَاعَةً وَقَفُوهُ عَلَى ابْنِ عُمَرَ"
      },
      {
        "id": 32119,
        "hadith_number": "3425",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mengenai Sumpah Tidak Memberi Bantuan kepada Keluarga",
        "perawi_melayu": "Abu al-Ahwas ‘Auf bin Malik daripada bapanya",
        "english_text": "From Abu al-Ahwas ‘Auf bin Malik from his father, who said: I said, \"O Messenger of Allah, what about a cousin of mine who comes to me, but he does not give to me nor does he keep ties with me? Then he needs me, so he comes to me and asks me, and I have sworn that I will not give to him nor keep ties with him.\" So he commanded me to do what is best and to expiate my oath.",
        "malay_translation": "Daripada Abu al-Ahwas ‘Auf bin Malik daripada bapanya, yang berkata: Aku berkata, \"Wahai Rasulullah, bagaimana dengan seorang sepupu saya yang datang kepada saya, tetapi dia tidak memberi kepada saya dan tidak juga menyambung silaturahim dengan saya? Kemudian dia memerlukan saya, lalu dia datang kepada saya dan meminta kepada saya, dan saya telah bersumpah bahawa saya tidak akan memberi kepadanya dan tidak akan menyambung silaturahim dengannya.\" Maka baginda memerintahkan aku untuk melakukan apa yang terbaik dan menebus sumpahku.",
        "arabic_text": "عَن أَبِي الْأَحْوَصِ عَوْفِ بْنِ مَالِكٍ عَنْ أَبِيهِ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ أَرَأَيْتَ ابْنَ عَم لي آتيه فَلَا يُعْطِينِي وَلَا يَصِلُنِي ثُمَّ يَحْتَاجُ إِلَيَّ فَيَأْتِينِي فَيَسْأَلُنِي وَقَدْ حَلَفْتُ أَنْ لَا أُعْطِيَهُ وَلَا أَصِلَهُ فَأَمَرَنِي أَنْ آتِيَ الَّذِي هُوَ خَيْرٌ وَأُكَفِّرَ عَنْ يَمِينِي. رَوَاهُ النَّسَائِيُّ وَابْنُ مَاجَهْ وَفِي رِوَايَةٍ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ يَأْتِينِي ابْنُ عَمِّي فَأَحْلِفُ أَنْ لَا أُعْطِيَهُ وَلَا أَصِلَهُ قَالَ: «كَفِّرْ عَنْ يَمِينِكَ»"
      },
      {
        "id": 32120,
        "hadith_number": "3426",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menazar",
        "perawi_melayu": "Abu Hurairah dan Ibn Umar رضي الله عنهما",
        "english_text": "From Abu Hurairah and Ibn Umar (may Allah be pleased with them) it is narrated that the Messenger of Allah (peace and blessings of Allah be upon him) said: “Do not make vows, for vows do not avert destiny; rather, they only extract from the miser.”",
        "malay_translation": "Dari Abu Hurairah dan Ibnu Umar رضي الله عنهما, mereka berkata: Rasulullah ﷺ bersabda:  “Janganlah kamu bernazar, kerana nazar tidak dapat menolak takdir; bahkan ia hanya akan mengeluarkan sesuatu daripada orang yang bakhil.”",
        "arabic_text": "عَنْ أَبِي هُرَيْرَةَ وَابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمْ قَالَا: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَنْذُرُوا فَإِنَّ النَّذْرَ لَا يُغْنِي مِنَ الْقَدَرِ شَيْئًا وَإِنَّمَا يُسْتَخْرَجُ بِهِ من الْبَخِيل»"
      },
      {
        "id": 32121,
        "hadith_number": "3427",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menepati Nazar Kepada Allah",
        "perawi_melayu": "Aisyah",
        "english_text": "From Aisha, that the Messenger of Allah (peace and blessings of Allah be upon him) said: “Whoever makes a vow to obey Allah, let him obey Him, and whoever makes a vow to disobey Him, let him not disobey Him.”",
        "malay_translation": "Daripada Aisyah, bahawa Rasulullah SAW bersabda:  “Sesiapa yang bernazar untuk mentaati Allah, maka hendaklah dia mentaati-Nya, dan sesiapa yang bernazar untuk menderhakai-Nya, maka janganlah dia menderhakai-Nya.”",
        "arabic_text": "وَعَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ نَذَرَ أَنْ يُطِيعَ اللَّهَ فَلْيُطِعْهُ وَمَنْ نَذَرَ أَنْ يَعْصِيَهُ فَلَا يَعْصِهِ» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32122,
        "hadith_number": "3428",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tiada Nazar dalam Maksiat dan Perkara yang Tidak Dimiliki Hamba",
        "perawi_melayu": "Imran bin Husain",
        "english_text": "Translation from Arabic Text",
        "malay_translation": "Daripada Imran bin Husain berkata: Rasulullah SAW bersabda: \"Tiada (kewajiban) menunaikan nazar dalam maksiat, dan tidak (pula) dalam perkara yang tidak dimiliki oleh seorang hamba.\" Riwayat Muslim, dan dalam riwayat lain: \"Tiada nazar dalam maksiat kepada Allah.\"",
        "arabic_text": "وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا وَفَاءَ لِنَذْرٍ فِي مَعْصِيَةٍ وَلَا فِيمَا لَا يَمْلِكُ الْعَبْدُ» . رَوَاهُ مُسْلِمٌ وَفِي رِوَايَةٍ: «لَا نَذْرَ فِي مَعْصِيّة الله»"
      },
      {
        "id": 32123,
        "hadith_number": "3429",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kafaarah Nadzar dan Kafaarah Sumpah",
        "perawi_melayu": "Ukbah bin Amir",
        "english_text": "From `Uqbah ibn `Amir from the Messenger of Allah (peace and blessings be upon him) who said: \"The expiation for a vow is the expiation for an oath.\"",
        "malay_translation": "Daripada Ukbah bin Amir daripada Rasulullah SAW, baginda bersabda:  \"Kafaarah (tebusan) bagi nazar adalah sama dengan kafaarah (tebusan) bagi sumpah.\"",
        "arabic_text": "وَعَن عقبَة بن عَامر عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كَفَّارَةُ النَّذْرِ كَفَّارَةُ الْيَمِينِ» . رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 32124,
        "hadith_number": "3430",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Arahan Nabi SAW tentang Nazar Abu Israil",
        "perawi_melayu": "Ibnu Abbas R.A.",
        "english_text": "Narrated by Ibn Abbas RA: While the Prophet PBUH was delivering a sermon, he noticed a man standing. He inquired about him, and they said: 'This is Abu Israil, he has vowed to stand and not sit, not seek shade, not speak, and to fast.' So the Prophet PBUH said: 'Order him to speak, seek shade, sit, and complete his fast.' Related by Bukhari.",
        "malay_translation": "Daripada Ibnu Abbas RA berkata: Ketika Nabi SAW sedang berkhutbah, tiba-tiba baginda melihat seorang lelaki berdiri. Baginda bertanya tentangnya, maka mereka berkata: 'Ini Abu Israil, dia telah bernazar untuk berdiri dan tidak duduk, tidak berteduh, tidak bercakap, dan berpuasa.' Maka Nabi SAW bersabda: 'Suruh dia bercakap, berteduh, duduk, dan menyempurnakan puasanya.' Riwayat Bukhari.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: بَيْنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ إِذا هُوَ بِرَجُل قَائِم فَسَأَلَهُ عَنْهُ فَقَالُوا: أَبُو إِسْرَائِيلَ نَذَرَ أَنْ يَقُومَ وَلَا يَقْعُدَ وَلَا يَسْتَظِلَّ وَلَا يَتَكَلَّمَ وَيَصُومَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مُرُوهُ فَلْيَتَكَلَّمْ وَلْيَسْتَظِلَّ وَلْيَقْعُدْ وَلْيُتِمَّ صَوْمَهُ» . رَوَاهُ الْبُخَارِيُّ"
      },
      {
        "id": 32125,
        "hadith_number": "3431",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menyiksa Diri dalam Nazar untuk Berjalan ke Baitullah",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "On the authority of Anas, that the Prophet (peace and blessings of Allah be upon him) saw an old man being supported by his two sons and said, 'What is the matter with this man?' They said, 'He vowed to walk to the House of Allah.' He said, 'Verily, Allah is independent of this man's punishing himself,' and he ordered him to ride.",
        "malay_translation": "Daripada Anas, bahawa Nabi ﷺ melihat seorang lelaki tua dipapah oleh dua orang anaknya, lalu Baginda bersabda, \"Apa halnya dengan orang ini?\" Mereka berkata, \"Dia telah bernazar untuk berjalan kaki ke Baitullah.\" Baginda bersabda, \"Sesungguhnya Allah Ta'ala tidak memerlukan orang ini menyeksa dirinya,\" dan Baginda memerintahkannya untuk menunggang (kenderaan).",
        "arabic_text": "وَعَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى شَيْخًا يُهَادَى بَيْنَ ابْنَيْهِ فَقَالَ: «مَا بَالُ هَذَا؟» قَالُوا: نَذَرَ أَنْ يَمْشِيَ إِلَى بَيت الله قَالَ: «إِنَّ اللَّهَ تَعَالَى عَنْ تَعْذِيبِ هَذَا نَفسه لَغَنِيّ» . وَأمره أَن يركب"
      },
      {
        "id": 32126,
        "hadith_number": "3432",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kekayaan Allah dan Nazar",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "And in a narration by Muslim from Abu Hurairah, he said: \"Ride, O old man, for indeed Allah is Self-Sufficient and does not need you or your vow.\"",
        "malay_translation": "Dan di dalam riwayat Muslim daripada Abu Hurairah, beliau berkata:  «Naiklah wahai orang tua, sesungguhnya Allah Maha Kaya dan tidak memerlukan engkau mahupun nazarmu.»",
        "arabic_text": "وَفِي رِوَايَةٍ لِمُسْلِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَ: «ارْكَبْ أَيُّهَا الشَّيْخُ فَإِنَّ اللَّهَ غَنِيٌّ عَنْكَ وَعَن نذرك»"
      },
      {
        "id": 32127,
        "hadith_number": "3433",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menunaikan Nazar Ibu yang Telah Meninggal Dunia",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "From Ibn Abbas (RA): Sa'd bin Ubadah (RA) sought a fatwa from the Prophet (peace and blessings of Allah be upon him) regarding a vow that was incumbent upon his mother, and she died before fulfilling it. So the Prophet (peace and blessings of Allah be upon him) issued a fatwa to him to fulfill it on her behalf.",
        "malay_translation": "Daripada Ibnu Abbas RA: Bahawa Sa'ad bin Ubadah RA meminta fatwa kepada Nabi SAW tentang nazar yang diwajibkan atas ibunya, kemudian ibunya meninggal dunia sebelum menunaikannya. Maka Nabi SAW memberi fatwa kepadanya untuk menunaikannya bagi pihak ibunya.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ سَعْدَ بن عبَادَة رَضِي الله عَنْهُم اسْتَفْتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَذْرٍ كَانَ عَلَى أُمِّهِ فَتُوُفِّيَتْ قَبْلَ أَنْ تَقْضِيَهُ فَأَفْتَاهُ أَنْ يَقْضِيَهُ عَنْهَا"
      },
      {
        "id": 32128,
        "hadith_number": "3434",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Memegang Sebahagian Harta",
        "perawi_melayu": "Ka'ab bin Malik",
        "english_text": "From Ka'b bin Malik, he said: I said, \"O Messenger of Allah, is it part of my repentance that I give away some of my wealth as charity to Allah and to His Messenger?\"  The Messenger of Allah (peace and blessings of Allah be upon him) said: \"Keep some of your wealth, for it is better for you.\" I said, \"Then I will keep my share from Khaybar.\" This is a portion of a longer hadith.",
        "malay_translation": "Dari Ka'ab bin Malik, beliau berkata: Aku berkata, \"Wahai Rasulullah, adakah sebahagian daripada taubatku ialah aku menyedekahkan sebahagian hartaku kepada Allah dan Rasul-Nya?\"  Rasulullah SAW bersabda: \"Gunakan sebahagian daripada hartamu, kerana ia lebih baik untukmu.\" Aku berkata, \"Maka aku akan menyimpan bahagianku dari Khaibar.\" Ini adalah sebahagian daripada hadis yang panjang.",
        "arabic_text": "وَعَنْ كَعْبِ بْنِ مَالِكٍ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ إِنَّ مِنْ تَوْبَتِي أَنْ أَنْخَلِعَ مِنْ مَالِي صَدَقَةً إِلَى اللَّهِ وَإِلَى رَسُولِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَمْسِكْ بَعْضَ مَالِكَ فَهُوَ خَيْرٌ لَكَ» . قُلْتُ: فَإِنِّي أُمْسِكُ سَهْمِي الَّذِي بِخَيْبَر. وَهَذَا طرف من حَدِيث مطول"
      },
      {
        "id": 32129,
        "hadith_number": "3435",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tiada Nazar Dalam Kemaksiatan",
        "perawi_melayu": "Aisyah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Aisyah r.a., katanya: Rasulullah s.a.w. bersabda:  \"Tiada nazar dalam kemaksiatan, dan kafaratnya adalah kafarat sumpah.\"  (Riwayat Abu Daud, Tirmizi dan Nasai)",
        "arabic_text": "عَنْ عَائِشَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهُ كَفَّارَةُ الْيَمِينِ» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَالنَّسَائِيّ"
      },
      {
        "id": 32130,
        "hadith_number": "3436",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kafaarah Nazar",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "From Ibn Abbas that the Messenger of Allah (peace and blessings of Allah be upon him) said: \"Whoever makes a vow but does not specify it, then its expiation is the expiation of an oath. And whoever makes a vow which he cannot fulfill, then its expiation is the expiation of an oath. And whoever makes a vow and is able to fulfill it, then let him fulfill it.\"",
        "malay_translation": "Daripada Ibnu Abbas bahawa Rasulullah SAW bersabda:  \"Barangsiapa yang bernazar tetapi tidak menyebutnya, maka kafaratnya adalah kafarat sumpah. Dan barangsiapa yang bernazar sesuatu yang tidak mampu ditunaikannya, maka kafaratnya adalah kafarat sumpah. Dan barangsiapa yang bernazar dan mampu menunaikannya, maka hendaklah dia menunaikannya.\"",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ نَذَرَ نَذْرًا لم يسمه فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ. وَمَنْ نَذَرَ نَذْرًا لَا يُطِيقُهُ فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ. وَمَنْ نَذَرَ نَذْرًا أَطَاقَهُ فَلْيَفِ بِهِ» . رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَه وَوَقفه بَعضهم على ابْن عَبَّاس"
      },
      {
        "id": 32131,
        "hadith_number": "3437",
        "status": "sahih",
        "nama_buku": "Mishkat al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menunaikan Nazar yang Tidak Melibatkan Maksiat dan Bukan pada Tempat Maksiat",
        "perawi_melayu": "Thabit bin Dhahhak RA",
        "english_text": "Thabit bin Dhahhak (RA) narrated that a man during the time of the Messenger of Allah (peace and blessings of Allah be upon him) vowed to slaughter camels at Buwanah. He came to the Messenger of Allah (peace and blessings of Allah be upon him) and informed him. The Messenger of Allah (peace and blessings of Allah be upon him) said: \"Was there any idol from the idols of the Jahiliyyah worshipped there?\" They said: \"No.\" He said: \"Was there any festival from their festivals held there?\" They said: \"No.\" The Messenger of Allah (peace and blessings of Allah be upon him) said: \"Fulfill your vow, for there is no fulfillment of a vow in disobedience to Allah, and not in what the son of Adam does not possess.\"",
        "malay_translation": "Daripada Thabit bin Dhahhak RA berkata: Seorang lelaki pada zaman Rasulullah SAW telah bernazar untuk menyembelih unta di Buwanah. Dia kemudian datang kepada Rasulullah SAW dan memberitahunya. Rasulullah SAW bersabda: \"Adakah di tempat itu terdapat berhala daripada berhala-berhala Jahiliyyah yang disembah?\" Mereka berkata: \"Tidak.\" Baginda bertanya: \"Adakah di tempat itu diadakan perayaan daripada perayaan mereka?\" Mereka berkata: \"Tidak.\" Rasulullah SAW bersabda: \"Tunaikanlah nazarmu, kerana tidak ada (kepatuhan) dalam nazar untuk melakukan maksiat kepada Allah, dan tidak pula dalam perkara yang tidak dimiliki oleh anak Adam.\" (Riwayat Abu Daud)",
        "arabic_text": "وَعَن ثَابت بن الضَّحَّاك قَالَ: نَذَرَ رَجُلٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَنْحَرَ إِبِلًا بِبُوَانَةَ فَأَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَلْ كَانَ فِيهَا وَثَنٌ مِنْ أَوْثَانِ الْجَاهِلِيَّةِ يُعْبَدُ؟» قَالُوا: لَا قَالَ: «فَهَلْ كَانَ فِيهِ عِيدٌ مِنْ أَعْيَادِهِمْ؟» قَالُوا: لَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أوف بِنَذْرِك فَإِنَّهُ لَا وَفَاءَ لِنَذْرٍ فِي مَعْصِيَةِ اللَّهِ وَلَا فِيمَا لَا يَمْلِكُ ابْنُ آدَمَ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32132,
        "hadith_number": "3438",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menunaikan Nazar",
        "perawi_melayu": "Amr bin Syu'aib daripada bapanya daripada datuknya",
        "english_text": "It is narrated from Amr bin Shu'aib from his father from his grandfather (رضي الله عنه) that a woman said: \"O Messenger of Allah, I have vowed to beat a drum on your head.\" He said: \"Fulfill your vow.\"",
        "malay_translation": "Daripada Amr bin Syu'aib daripada bapanya daripada datuknya (رضي الله عنه), bahawa seorang wanita berkata: \"Wahai Rasulullah, sesungguhnya aku telah bernazar untuk memukul kepala tuan dengan rebana.\" Baginda bersabda: \"Tunaikanlah nazarmu.\"",
        "arabic_text": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جده رَضِي الله عَنهُ أَنَّ امْرَأَةً قَالَتْ: يَا رَسُولَ اللَّهِ إِنِّي نَذَرْتُ أَنْ أَضْرِبَ عَلَى رَأْسِكَ بِالدُّفِّ قَالَ: «أَوْفِي بِنَذْرِكِ» . رَوَاهُ أَبُو دَاوُدَ وَزَادَ رَزِينٌ: قَالَتْ: وَنَذَرْتُ أَنْ أَذْبَحَ بِمَكَانِ كَذَا وَكَذَا مَكَانٌ يَذْبَحُ فِيهِ أَهْلُ الْجَاهِلِيَّةِ فَقَالَ: «هَلْ كَانَ بِذَلِكِ الْمَكَانِ وَثَنٌ مِنْ أَوْثَانِ الْجَاهِلِيَّةِ يُعْبَدُ؟» قَالَتْ: لَا قَالَ: «هَلْ كَانَ فِيهِ عِيدٌ مِنْ أَعْيَادِهِمْ؟» قَالَتْ: لَا قَالَ: «أَوْفِي بِنَذْرِك»"
      },
      {
        "id": 32133,
        "hadith_number": "3439",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Taubat dengan Meninggalkan Tempat Dosa dan Menderma Harta",
        "perawi_melayu": "Abu Lababah",
        "english_text": "Abu Lababah said that he said to the Prophet (ﷺ): \"I intend to repent by leaving the home of my people where I committed sins and give all my wealth in charity.\" The Prophet (ﷺ) said: \"One-third will suffice for you.\"",
        "malay_translation": "Abu Lababah berkata bahawa beliau berkata kepada Nabi SAW: \"Saya berniat bertaubat dengan meninggalkan rumah kaumku di mana aku melakukan dosa dan menderma semua harta kekayaanku sebagai sedekah.\" Nabi SAW bersabda: \"Sepertiga sudah memadai untukmu.\"",
        "arabic_text": "وَعَن أبي لبَابَة: أَنَّهُ قَالَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ مِنْ تَوْبَتِي أَنْ أَهْجُرَ دَارَ قَوْمِي الَّتِي أَصَبْتُ فِيهَا الذَّنْبَ وَأَنْ أَنْخَلِعَ مِنْ مَالِي كُلِّهِ صَدَقَةً قَالَ: «يُجْزِئُ عَنْكَ الثُّلُثُ» . رَوَاهُ رزين"
      },
      {
        "id": 32134,
        "hadith_number": "3440",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Solat di Mekah",
        "perawi_melayu": "Jabir bin Abdullah RA",
        "english_text": "Narrated Jabir bin Abdullah RA: A man stood up on the day of the conquest of Mecca and said, 'O Messenger of Allah, for Allah Azza wa Jalla, if Allah conquers Mecca for you, I vow to pray two rak'ahs in Bayt al-Maqdis.' The Prophet (peace and blessings of Allah be upon him) said, 'Pray here.' Then he repeated (the same), and the Prophet (peace and blessings of Allah be upon him) said, 'Pray here.' Then he repeated it again, and the Prophet (peace and blessings of Allah be upon him) said, 'Then it is up to you.'",
        "malay_translation": "Daripada Jabir bin Abdullah RA, bahawa seorang lelaki berdiri pada hari pembukaan Kota Mekah dan berkata: \"Wahai Rasulullah, demi Allah Azza wa Jalla, jika Allah SWT membuka Kota Mekah untukmu, aku bernazar untuk menunaikan solat dua rakaat di Baitulmaqdis.\" Baginda SAW bersabda: \"Solatlah di sini sahaja.\" Kemudian lelaki itu mengulangi permintaannya, dan Baginda SAW bersabda: \"Solatlah di sini sahaja.\" Kemudian lelaki itu mengulangi permintaannya lagi, dan Baginda SAW bersabda: \"Jika begitu, terpulanglah kepada kamu.\" (Riwayat Abu Daud dan Darimi)",
        "arabic_text": "وَعَن جَابر بن عبد الله: أَنَّ رَجُلًا قَامَ يَوْمَ الْفَتْحِ فَقَالَ: يَا رَسُول الله لِلَّهِ عَزَّ وَجَلَّ إِنْ فَتَحَ اللَّهُ عَلَيْكَ مَكَّةَ أَنْ أُصَلِّيَ فِي بَيْتِ الْمَقْدِسِ رَكْعَتَيْنِ قَالَ: «صلى الله عَلَيْهِ وَسلم هَهُنَا» ثمَّ عَاد فَقَالَ: «صل هَهُنَا» ثُمَّ أَعَادَ عَلَيْهِ فَقَالَ: «شَأْنَكَ إِذًا» . رَوَاهُ أَبُو دَاوُد والدارمي"
      },
      {
        "id": 32135,
        "hadith_number": "3441",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ibadah Haji:  Menunggang Haiwan Ketika Tidak Mampu Berjalan",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "From Ibn Abbas: That the sister of Uqbah ibn Amir, may Allah be pleased with them, vowed to perform Hajj on foot, and that she could not do so.  The Prophet, peace and blessings of Allah be upon him, said: \"Indeed, Allah is self-sufficient from your sister's walking, so let her ride and let her offer a sacrifice.\"",
        "malay_translation": "Daripada Ibnu Abbas: bahawa saudari Uqbah bin Amir, semoga Allah merahmati mereka, telah bernazar untuk menunaikan haji dengan berjalan kaki, dan bahawa dia tidak mampu berbuat demikian.  Rasulullah SAW bersabda:  \"Sesungguhnya Allah Maha Kaya dan tidak memerlukan perjalanan kakimu saudariku, maka hendaklah dia menunggang dan hendaklah dia menyembelih seekor haiwan korban.\"  (Terdapat beberapa riwayat lain daripada Abu Daud yang menyebut Nabi Muhammad SAW memerintahkan wanita tersebut untuk menunggang dan menyembelih korban, dan satu lagi riwayat menyebut:  \"Sesungguhnya Allah tidak akan menjadikan saudari kamu susah, maka hendaklah dia menunggang, menunaikan haji dan menebus nadzarnya\")",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ أُخْتَ عُقْبَةَ بْنِ عَامِرٍ رَضِيَ اللَّهُ عَنْهُمْ نَذَرَتْ أَنْ تَحُجَّ مَاشِيَة وَأَنَّهَا لَا تطِيق ذَلِكَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ لَغَنِيٌّ عَنْ مَشْيِ أُخْتِكَ فَلْتَرْكَبْ وَلْتُهْدِ بَدَنَةً» . رَوَاهُ أَبُو دَاوُدَ وَالدَّارِمِيُّ وَفِي رِوَايَةٍ لِأَبِي دَاوُدَ: فَأَمَرَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تَرْكَبَ وَتُهْدِيَ هَدْيًا وَفِي رِوَايَةٍ لَهُ: فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ لَا يَصْنَعُ بِشَقَاءِ أُخْتِكَ شَيْئًا فَلْتَرْكَبْ ولتحج وتكفر يَمِينهَا»"
      },
      {
        "id": 32136,
        "hadith_number": "3442",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nazar Haji Tanpa Niqab dan Kasut",
        "perawi_melayu": "Abdullah bin Malik",
        "english_text": "From Abdullah ibn Malik, that Uqbah ibn Amir asked the Prophet (peace and blessings of Allaah be upon him) about his sister who vowed to perform Hajj barefoot and without a khimar (head covering).  He said: “Tell her to wear a khimar, to ride (a mount), and to fast for three days.”",
        "malay_translation": "Daripada Abdullah bin Malik, bahawa Uqbah bin Amir bertanya kepada Nabi SAW tentang saudari perempuannya yang telah bernazar untuk menunaikan haji tanpa alas kaki dan tanpa khimar (tudung kepala). Baginda SAW bersabda: “Suruhlah dia memakai khimar, naik kenderaan, dan berpuasa selama tiga hari.”",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ مَالِكٍ أَنَّ عُقْبَةَ بن عَامر سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أُخْتٍ لَهُ نَذَرَتْ أَنْ تَحُجَّ حَافِيَةً غَيْرَ مُخْتَمِرَةٍ فَقَالَ: «مُرُوهَا فَلْتَخْتَمِرْ وَلْتَرْكَبْ وَلْتَصُمْ ثَلَاثَةَ أَيَّامٍ» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ والدارمي"
      },
      {
        "id": 32137,
        "hadith_number": "3443",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Sumpah dan Nazar yang Tidak Sah",
        "perawi_melayu": "Said bin al-Musayyab",
        "english_text": "From Sa’id bin al-Musayyab: That two brothers from the Ansar had an inheritance between them. One of them asked the other for his share, and the other said: “If you keep asking me for a share, all my property is in the trade of the Kaaba.”  Umar said to him: “Indeed, the Kaaba is rich enough without your property. Expatiate on your oath and speak to your brother, for I heard the Messenger of Allah ﷺ saying: “There should be no oath upon you, nor a vow in the disobedience of the Lord, nor in cutting off kinship, nor in what you do not possess.” Abu Dawud narrated it.",
        "malay_translation": "Dari Said bin al-Musayyab: bahawa dua orang adik-beradik daripada kalangan Ansar mempunyai harta pusaka di antara mereka. Salah seorang daripada mereka meminta bahagiannya daripada yang lain, dan yang lain berkata: “Jika engkau terus meminta bahagianku, semua harta bendaku berada dalam perniagaan di Kaabah.” Umar berkata kepadanya: “Sesungguhnya Kaabah itu kaya tanpa hartamu.  Batalkan sumpahmu dan berbincanglah dengan saudaramu, kerana aku mendengar Rasulullah SAW bersabda:  “Tidak sepatutnya ada sumpah ke atas dirimu, dan tidak juga nazar dalam perkara yang menderhakai Allah, atau memutuskan silaturahim, atau dalam apa yang tidak kau miliki.”  Riwayat Abu Daud.",
        "arabic_text": "وَعَن سعيد بن الْمسيب: أَنَّ أَخَوَيْنِ مِنَ الْأَنْصَارِ كَانَ بَيْنَهُمَا مِيرَاثٌ فَسَأَلَ أَحَدُهُمَا صَاحِبَهُ الْقِسْمَةَ فَقَالَ: إِنْ عُدْتَ تَسْأَلُنِي الْقِسْمَةَ فَكُلُّ مَالِي فِي رِتَاجِ الْكَعْبَةِ فَقَالَ لَهُ عُمَرُ: إِنَّ الْكَعْبَةَ غَنِيَّةٌ عَنْ مَالِكَ كَفِّرْ عَنْ يَمِينِكَ وَكَلِّمْ أَخَاكَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا يَمِينَ عَلَيْكَ وَلَا نَذْرَ فِي مَعْصِيَةِ الرَّبِّ وَلَا فِي قَطِيعَةِ الرَّحِمِ وَلَا فِيمَا لَا يملك» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32138,
        "hadith_number": "3444",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Dua Jenis Nazar",
        "perawi_melayu": "Imran bin Husain",
        "english_text": "From Imran ibn Husayn, he said: I heard the Messenger of Allah (ﷺ) say: \"A vow is of two kinds: Whoever makes a vow in obedience, then that is for Allah, and fulfilling it is obligatory. And whoever makes a vow in disobedience, then that is for the devil, and there is no fulfillment in it, and it is expiated by what expiates an oath.\"",
        "malay_translation": "Dari Imran bin Husain, beliau berkata: Saya mendengar Rasulullah SAW bersabda: \"Nazar itu ada dua jenis: Barangsiapa bernazar dalam ketaatan, maka nazar itu adalah untuk Allah, dan menunaikannya adalah wajib. Dan barangsiapa bernazar dalam kemaksiatan, maka nazar itu adalah untuk syaitan, dan tidak ada menunaikannya, dan ia dikafarahkan oleh apa yang memakruhkan sumpah.\"",
        "arabic_text": "عَن عِمْرَانَ بْنِ حُصَيْنٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: النَّذْرُ نَذْرَانِ: فَمَنْ كَانَ نَذَرَ فِي طَاعَةٍ فَذَلِكَ لِلَّهِ فِيهِ الْوَفَاءُ وَمَنْ كَانَ نَذَرَ فِي مَعْصِيَةٍ فَذَلِكَ لِلشَّيْطَانِ وَلَا وَفَاء فِيهِ وَيُكَفِّرُهُ مَا يُكَفِّرُ الْيَمِينَ . رَوَاهُ النَّسَائِيُّ"
      },
      {
        "id": 32139,
        "hadith_number": "3445",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nazar Menyembelih Diri Sendiri",
        "perawi_melayu": "Muhammad bin al-Muntashir",
        "english_text": "Not Available",
        "malay_translation": "Daripada Muhammad bin al-Muntashir, katanya: “Sesungguhnya seorang lelaki telah bernazar akan menyembelih dirinya sendiri jika Allah menyelamatkannya daripada musuh. Maka dia bertanya kepada Ibnu Abbas, lalu Ibnu Abbas berkata kepadanya: “Tanya Masruq.”  Maka dia bertanya kepada Masruq, lalu Masruq berkata kepadanya: “Janganlah engkau menyembelih dirimu sendiri. Sesungguhnya jika engkau seorang mukmin, maka engkau telah membunuh jiwa yang beriman, dan jika engkau seorang kafir, engkau telah tergesa-gesa ke neraka. Belilah seekor kambing jantan, kemudian sembelihlah ia untuk orang-orang miskin. Sesungguhnya Ismail lebih baik daripada engkau dan dia telah ditebus dengan seekor kambing jantan.” Maka dia memberitahu Ibnu Abbas, lalu Ibnu Abbas berkata: “Demikianlah aku ingin memberi fatwa kepadamu.” Riwayat Razin.",
        "arabic_text": "وَعَنْ مُحَمَّدِ بْنِ الْمُنْتَشِرِ قَالَ: إِنَّ رَجُلًا نَذَرَ أَنْ يَنْحَرَ نَفْسَهُ إِنْ نَجَّاهُ اللَّهُ مِنْ عَدُوِّهِ فَسَأَلَ ابْنَ عَبَّاسٍ فَقَالَ لَهُ: سَلْ مَسْرُوقًا فَسَأَلَهُ فَقَالَ لَهُ: لَا تَنْحَرْ نَفْسَكَ فَإِنَّكَ إِنْ كُنْتَ مُؤْمِنًا قَتَلْتَ نَفْسًا مُؤْمِنَةً وَإِنْ كُنْتَ كَافِرًا تَعَجَّلْتَ إِلَى النَّارِ وَاشْتَرِ كَبْشًا فَاذْبَحْهُ لِلْمَسَاكِينِ فَإِنَّ إِسْحَاقَ خَيْرٌ مِنْكَ وَفُدِيَ بِكَبْشٍ فَأَخْبَرَ ابْنَ عَبَّاسٍ فَقَالَ: هَكَذَا كُنْتُ أَرَدْتُ أَنْ أُفْتِيَكَ. رَوَاهُ رَزِينٌ"
      }
    ]
  }
}