{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 210,
    "data": [
      {
        "id": 32998,
        "hadith_number": "4304",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pakaian Yang Paling Disukai Nabi SAW",
        "perawi_melayu": "Diriwayatkan dari Anas RA",
        "english_text": "Not Available",
        "malay_translation": "Diriwayatkan daripada Anas RA, beliau berkata: Pakaian yang paling disukai oleh Nabi SAW untuk dipakai adalah hibarah (sejenis kain dari Yaman).",
        "arabic_text": "عَن أنسٍ قَالَ: كَانَ أَحَبُّ الثِّيَابِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَلْبَسَهَا الْحِبَرَةُ"
      },
      {
        "id": 32999,
        "hadith_number": "4305",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi Memakai Jubah Rom dengan Lengan Sempit",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "From al-Mughira ibn Shu'ba: that the Prophet (peace and blessings of Allah be upon him) wore a Roman robe with tight sleeves.",
        "malay_translation": "Daripada al-Mughira ibn Shu'ba: bahawa Nabi (selawat dan salam Allah ke atasnya) memakai jubah Rom dengan lengan yang sempit.",
        "arabic_text": "وَعَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَبِسَ جُبَّةً رُومِيَّةً ضَيِّقَةَ الْكُمَّيْنِ"
      },
      {
        "id": 33000,
        "hadith_number": "4306",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pakaian Rasulullah SAW Ketika Wafat",
        "perawi_melayu": "Diriwayatkan daripada Abu Burdah",
        "english_text": "Not Available",
        "malay_translation": "Diriwayatkan daripada Abu Burdah, beliau berkata: Aisyah mengeluarkan kepada kami kiswah yang bertampal dan kain sarung yang kasar. Kemudian Aisyah berkata: Ruh Rasulullah SAW diambil (wafat) dalam kedua-dua (pakaian) ini.",
        "arabic_text": "وَعَنْ أَبِي بُرْدَةَ قَالَ: أَخْرَجَتْ إِلَيْنَا عَائِشَةُ كِسَاءً مُلَبَّدًا وَإِزَارًا غَلِيظًا فَقَالَتْ: قُبِضَ رُوحُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هذَيْن"
      },
      {
        "id": 33001,
        "hadith_number": "4307",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perihal Tempat Tidur Rasulullah SAW",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Aisyah RA berkata: “Tempat tidur Rasulullah SAW yang baginda tidur di atasnya adalah daripada kulit yang diisi dengan sabut.”",
        "arabic_text": "وَعَن عَائِشَة قَالَتْ: كَانَ فِرَاشُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّذِي يَنَامُ عَلَيْهِ أَدَمًا حَشْوُهُ لِيف"
      },
      {
        "id": 33002,
        "hadith_number": "4308",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Bantal Rasulullah SAW Diperbuat daripada Kulit dan Sabut",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada 'Aisyah RA, beliau berkata: Bantal Rasulullah SAW yang Baginda bertelekan padanya adalah daripada kulit yang diisi dengan sabut. (Riwayat Muslim)",
        "arabic_text": "وَعَنْهَا قَالَتْ: كَانَ وِسَادُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّذِي يَتَّكِئُ عَلَيْهِ مَنْ أَدَمٍ حشْوُهُ ليفٌ. رَوَاهُ مُسلم"
      },
      {
        "id": 33003,
        "hadith_number": "4309",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Datang pada Waktu Tengah Hari",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada 'Aisyah R.A., beliau berkata: Ketika kami sedang duduk di rumah kami pada panas terik tengah hari, seseorang berkata kepada Abu Bakar: \"Itulah Rasulullah SAW datang menghadap dengan bertutup kepala.\" [Riwayat al-Bukhari]",
        "arabic_text": "وعنها قَالَت: بَينا نَحْنُ جُلُوسٌ فِي بَيْتِنَا فِي حَرِّ الظَّهِيرَةِ قَالَ قَائِلٌ لِأَبِي بَكْرٍ: هَذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُقْبِلًا مُتَقَنِّعًا. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 33004,
        "hadith_number": "4310",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tilam untuk Lelaki, Isteri, Tetamu, dan Syaitan",
        "perawi_melayu": "Diriwayatkan dari Jabir bahawa Rasulullah SAW bersabda kepadanya:",
        "english_text": "Not Available",
        "malay_translation": "\"Tilam untuk seorang lelaki, tilam untuk isterinya, yang ketiga untuk tetamu, dan yang keempat untuk syaitan.\" (Riwayat Muslim)",
        "arabic_text": "وَعَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ: «فِرَاشٌ لِلرَّجُلِ وَفِرَاشٌ لِامْرَأَتِهِ وَالثَّالِثُ للضيف وَالرَّابِع للشَّيْطَان» . رَوَاهُ مُسلم"
      },
      {
        "id": 33005,
        "hadith_number": "4311",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mengheret Pakaian Kerana Sombong",
        "perawi_melayu": "Abu Hurairah RA",
        "english_text": "Abu Hurairah reported that the Messenger of Allah (peace and blessings be upon him) said: 'Allah will not look on the Day of Resurrection at the one who drags his garment out of pride.'",
        "malay_translation": "Daripada Abu Hurairah RA, bahawa Rasulullah SAW bersabda: \"Allah tidak akan melihat pada hari kiamat kepada sesiapa yang mengheret pakaiannya kerana sombong.\"",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَنْظُرُ اللَّهُ يَوْمَ الْقِيَامَةِ إِلَى مَنْ جَرَّ إزَاره بطرا»"
      },
      {
        "id": 33006,
        "hadith_number": "4312",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mengheret Pakaian dengan Sombong",
        "perawi_melayu": "Diriwayatkan dari Ibnu Umar RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Umar RA, bahawa Nabi SAW bersabda: \"Sesiapa yang mengheret pakaiannya dengan sombong, Allah tidak akan memandangnya pada hari kiamat.\"",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ جَرَّ ثَوْبَهُ خُيَلَاءَ لَمْ يَنْظُرِ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ»"
      },
      {
        "id": 33007,
        "hadith_number": "4313",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mengheret Pakaian Kerana Kesombongan",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada [perawi], beliau berkata: Rasulullah SAW bersabda: \"Ketika seorang lelaki mengheret pakaiannya kerana sombong, dia dibenamkan ke dalam bumi dan dia terus meronta-ronta di dalam bumi hingga hari kiamat.\" Riwayat Bukhari.",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «بَيْنَمَا رَجُلٌ يَجُرُّ إِزَارَهُ مِنَ الْخُيَلَاءِ خُسِفَ بِهِ فَهُوَ يَتَجَلْجَلُ فِي الْأَرْضِ إِلى يومِ الْقِيَامَة» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 33008,
        "hadith_number": "4314",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Kain Labuh Melebihi Buku Lali",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "No english text provided",
        "malay_translation": "Daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: “Bahagian kain yang berada di bawah buku lali akan berada di dalam neraka.” Riwayat Bukhari.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا أَسْفَلَ مِنَ الْكَعْبَيْنِ مِنَ الْإِزَارِ فِي النَّارِ» . رَوَاهُ الْبُخَارِيُّ"
      },
      {
        "id": 33009,
        "hadith_number": "4315",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Makan dengan Tangan Kiri dan Berjalan dengan Satu Kasut",
        "perawi_melayu": "Diriwayatkan dari Jabir RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Jabir RA, beliau berkata: Rasulullah SAW melarang seseorang makan dengan tangan kirinya, atau berjalan dengan hanya memakai sebelah kasut, atau berselimut dengan kain yang menutupi seluruh badan (al-simaa’), atau mengumpulkan buah-buahan dalam satu kain sambil menampakkan auratnya. (Riwayat Muslim)",
        "arabic_text": "وَعَنْ جَابِرٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَأْكُلَ الرَّجُلُ بِشِمَالِهِ أَو يمشي فِي نعل وَاحِد وَأَن يشْتَمل الصماء أَو يجتني فِي ثَوْبٍ وَاحِدٍ كَاشِفًا عَنْ فَرْجِهِ. رَوَاهُ مُسلم"
      },
      {
        "id": 33010,
        "hadith_number": "4316",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Memakai Sutera Bagi Lelaki di Dunia",
        "perawi_melayu": "Diriwayatkan daripada Umar, Anas, Ibn Al-Zubair, dan Abu Umamah RA, daripada Nabi SAW",
        "english_text": "Not Available",
        "malay_translation": "Daripada Umar, Anas, Ibn Al-Zubair, dan Abu Umamah RA, semoga Allah meredhai mereka semua, daripada Nabi SAW, baginda bersabda: \"Sesiapa yang memakai sutera di dunia, dia tidak akan memakainya di akhirat.\"",
        "arabic_text": "وَعَنْ عُمَرَ وَأَنَسٍ وَابْنِ الزُّبَيْرِ وَأَبِي أُمَامَةَ رَضِيَ اللَّهُ عَنْهُمْ أَجْمَعِينَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ لَبِسَ الْحَرِيرَ فِي الدُّنْيَا لَمْ يَلْبَسْهُ فِي الْآخِرَة»"
      },
      {
        "id": 33011,
        "hadith_number": "4317",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Memakai Sutera Bagi Lelaki di Dunia",
        "perawi_melayu": "Diriwayatkan daripada Umar, Anas, Ibnu Zubair, dan Abu Umamah RA, daripada Nabi SAW.",
        "english_text": "Not Available",
        "malay_translation": "Daripada Umar, Anas, Ibnu Zubair, dan Abu Umamah RA, mereka semua meriwayatkan daripada Nabi SAW, baginda bersabda: “Sesiapa yang memakai sutera di dunia, dia tidak akan memakainya di akhirat.”",
        "arabic_text": "وَعَنْ عُمَرَ وَأَنَسٍ وَابْنِ الزُّبَيْرِ وَأَبِي أُمَامَةَ رَضِيَ اللَّهُ عَنْهُمْ أَجْمَعِينَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ لَبِسَ الْحَرِيرَ فِي الدُّنْيَا لَمْ يَلْبَسْهُ فِي الْآخِرَة»"
      },
      {
        "id": 33012,
        "hadith_number": "4318",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Memakai Sutera Bagi Lelaki di Dunia",
        "perawi_melayu": "Diriwayatkan daripada Umar, Anas, Ibn Al-Zubair, dan Abu Umamah RA, daripada Nabi SAW",
        "english_text": "Not Available",
        "malay_translation": "Daripada Umar, Anas, Ibn Al-Zubair, dan Abu Umamah RA, mereka meriwayatkan bahawa Nabi SAW bersabda: “Sesiapa yang memakai sutera di dunia, dia tidak akan memakainya di akhirat.”",
        "arabic_text": "وَعَنْ عُمَرَ وَأَنَسٍ وَابْنِ الزُّبَيْرِ وَأَبِي أُمَامَةَ رَضِيَ اللَّهُ عَنْهُمْ أَجْمَعِينَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ لَبِسَ الْحَرِيرَ فِي الدُّنْيَا لَمْ يَلْبَسْهُ فِي الْآخِرَة»"
      },
      {
        "id": 33013,
        "hadith_number": "4319",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Memakai Sutera bagi Lelaki di Dunia",
        "perawi_melayu": "Diriwayatkan dari Umar, Anas, Ibnu Zubair, dan Abu Umamah RA, daripada Nabi SAW",
        "english_text": "Not Available",
        "malay_translation": "Daripada Umar, Anas, Ibnu Zubair, dan Abu Umamah RA, daripada Nabi SAW bersabda: \"Sesiapa yang memakai sutera di dunia, dia tidak akan memakainya di akhirat.\"",
        "arabic_text": "وَعَنْ عُمَرَ وَأَنَسٍ وَابْنِ الزُّبَيْرِ وَأَبِي أُمَامَةَ رَضِيَ اللَّهُ عَنْهُمْ أَجْمَعِينَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ لَبِسَ الْحَرِيرَ فِي الدُّنْيَا لَمْ يَلْبَسْهُ فِي الْآخِرَة»"
      },
      {
        "id": 33014,
        "hadith_number": "4320",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Memakai Sutera di Dunia",
        "perawi_melayu": "Tiada Perawi",
        "english_text": "Tiada teks Bahasa Inggeris",
        "malay_translation": "Daripada Ibn Umar RA, beliau berkata: Rasulullah SAW bersabda: “Sesungguhnya orang yang memakai sutera di dunia tidak akan mendapat bahagian di akhirat.”",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّمَا يَلْبَسُ الْحَرِيرَ فِي الدُّنْيَا مَنْ لَا خَلَاقَ لَهُ فِي الْآخِرَة»"
      },
      {
        "id": 33015,
        "hadith_number": "4321",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menggunakan Bekas Perak dan Emas untuk Makan dan Minum, serta Memakai Sutera",
        "perawi_melayu": "Huzaifah RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Huzaifah RA, beliau berkata: Rasulullah SAW melarang kami daripada minum menggunakan bekas perak dan emas, makan di dalamnya, memakai sutera, dan duduk di atasnya.",
        "arabic_text": "وَعَنْ حُذَيْفَةَ قَالَ: نَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَشْرَبَ فِي آنِيَةِ الْفِضَّةِ وَالذَّهَبِ وَأَنْ نَأْكُلَ فِيهَا وَعَنْ لُبْسِ الْحَرِيرِ وَالدِّيبَاجِ وَأَنْ نَجْلِسَ عَلَيْهِ"
      },
      {
        "id": 33016,
        "hadith_number": "4322",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadiah Pakaian Sutera kepada Ali dan Tujuannya",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ali RA, beliau berkata: Dihadiahkan kepada Rasulullah SAW sehelai pakaian sutera siyar'a. Baginda SAW lalu mengirimkannya kepadaku. Aku pun memakainya. Aku melihat kemarahan pada wajah Baginda SAW. Baginda bersabda: \"Sesungguhnya aku tidak mengirimkannya kepadamu untuk engkau memakainya, akan tetapi aku mengirimkannya kepadamu agar engkau memotong-motongnya menjadi kerudung untuk wanita.\"",
        "arabic_text": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: أُهْدِيَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم حُلّة سِيَرَاءَ فَبَعَثَ بِهَا إِلَيَّ فَلَبِسْتُهَا فَعَرَفْتُ الْغَضَبَ فِي وَجْهِهِ فَقَالَ: «إِنِّي لَمْ أَبْعَثْ بِهَا إِلَيْكَ لِتَلْبَسَهَا إِنَّمَا بَعَثْتُ بِهَا إِلَيْكَ لِتُشَقِّقَهَا خُمُراً بَين النساءِ»"
      },
      {
        "id": 33017,
        "hadith_number": "4323",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Memakai Sutera Kecuali Dengan Cara Tertentu",
        "perawi_melayu": "Umar RA",
        "english_text": "On the authority of Umar (may Allah be pleased with him) that the Prophet (peace and blessings of Allah be upon him) forbade wearing silk except like this, and the Messenger of Allah (peace and blessings of Allah be upon him) raised his fingers: the middle and index fingers and joined them.",
        "malay_translation": "Daripada Umar RA, bahawa Nabi SAW melarang memakai sutera kecuali seperti ini, dan Rasulullah SAW mengangkat jari-jarinya: jari tengah dan jari telunjuk dan menggabungkannya.",
        "arabic_text": "وَعَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ لُبْسِ الْحَرِيرِ إِلَّا هَكَذَا وَرَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إصبعيه: الْوُسْطَى والسبابة وضمهما"
      },
      {
        "id": 33018,
        "hadith_number": "4324",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Memakai Sutera Kecuali Sedikit",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Dalam riwayat Muslim: Sesungguhnya baginda berkhutbah di Al-Jabiyah, lalu bersabda: Rasulullah SAW melarang memakai sutera kecuali sekadar dua jari, atau tiga, atau empat jari.",
        "arabic_text": "وَفِي رِوَايَةٍ لِمُسْلِمٍ: أَنَّهُ خَطَبَ بِالْجَابِيَةِ فَقَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لُبْسِ الْحَرِيرِ إِلَّا مَوْضِعَ إِصْبَعَيْنِ أَوْ ثَلَاث أَو أَربع"
      },
      {
        "id": 33019,
        "hadith_number": "4325",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Jubah Rasulullah SAW untuk Kesembuhan",
        "perawi_melayu": "Asma' binti Abu Bakar",
        "english_text": "From Asma' bint Abi Bakr: She brought out a *tayalisah Kisrawaniyyah* robe which had silk patches, and its two sides were sewn with silk. She said: 'This is the robe of the Messenger of Allah SAW which was with Aisha. When she (Aisha) passed away, I took it. The Prophet SAW used to wear it, so we wash it for the sick, seeking healing with it.' Narrated by Muslim.",
        "malay_translation": "Daripada Asma' binti Abu Bakar: Sesungguhnya beliau mengeluarkan jubah *tayalisah Kisrawaniyyah* yang mempunyai tampalan *dibaj* dan kedua-dua belah sisinya berjahit dengan *dibaj*. Beliau berkata: 'Ini adalah jubah Rasulullah SAW yang berada di sisi Aisyah. Ketika beliau (Aisyah) wafat, aku mengambilnya. Nabi SAW memakainya, maka kami mencucinya untuk orang sakit, kami mencari kesembuhan dengannya.' Riwayat Muslim.",
        "arabic_text": "وَعَن أسماءَ بنت أبي بكر: أَنَّهَا أَخْرَجَتْ جُبَّةَ طَيَالِسَةٍ كِسْرَوَانِيَّةٍ لَهَا لِبْنَةُ ديباجٍ وفُرجَيْها مكفوفَين بالديباجِ وَقَالَت: هَذِه جبَّةُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَتْ عِنْدَ عَائِشَةَ فَلَمَّا قُبِضَتْ قَبَضْتُهَا وَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَلْبَسُهَا فَنَحْنُ نَغْسِلُهَا للمَرضى نستشفي بهَا. رَوَاهُ مُسلم"
      },
      {
        "id": 33020,
        "hadith_number": "4326",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keringanan Memakai Sutera bagi Zubair dan Abdur Rahman Kerana Kegatalan",
        "perawi_melayu": "Anas",
        "english_text": "On the authority of Anas who said: The Messenger of Allah (peace and blessings of Allah be upon him) permitted Zubair and Abdur Rahman ibn Auf to wear silk because of itching they had. And in a narration by Muslim, he said: 'Indeed, they complained of lice, so he permitted them to wear silk shirts.'",
        "malay_translation": "Daripada Anas RA berkata: Rasulullah SAW memberi keringanan kepada Zubair dan Abdur Rahman bin Auf untuk memakai sutera kerana kegatalan yang mereka alami. Dalam riwayat Muslim, baginda bersabda: 'Sesungguhnya mereka mengadu tentang kutu, maka baginda memberi keringanan kepada mereka untuk memakai baju sutera.'",
        "arabic_text": "وَعَن أنسٍ قَالَ: رَخَّصَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلزُّبَيْرِ وَعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ فِي لبس الْحَرِير لحكة بهما وَفِي رِوَايَة لمُسلم قَالَ: إنَّهُمَا شكوا من الْقمل فَرخص لَهما فِي قمص الْحَرِير"
      },
      {
        "id": 33021,
        "hadith_number": "4327",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Memakai Pakaian yang Dicelup dengan Za'faran (Kuma-kuma)",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abdullah bin 'Amr bin al-'As RA berkata: Rasulullah SAW melihatku memakai dua helai pakaian yang dicelup dengan za'faran (kuma-kuma), lalu Baginda bersabda: \"Sesungguhnya ini adalah pakaian orang-orang kafir, maka janganlah kamu memakainya.\" Dalam riwayat lain: Aku bertanya: Bolehkah aku mencucinya? Baginda bersabda: \"Bahkan bakarlah keduanya.\" (Riwayat Muslim). Dan kami akan menyebutkan hadith Aisyah: Nabi SAW keluar pada suatu pagi di dalam \"Bab Kelebihan Ahli Bait Nabi SAW\".",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَ: رَأَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى ثَوْبَيْنِ مُعَصْفَرَيْنِ فَقَالَ: «إِنَّ هَذِهِ من ثِيَاب الْكفَّار فَلَا تلبسها» وَفِي رِوَايَة: قلت: أغسلهما؟ قَالَ: «بل احرقها» . رَوَاهُ مُسْلِمٌ وَسَنَذْكُرُ حَدِيثَ عَائِشَةَ: خَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ غَدَاةٍ فِي «بَابِ مَنَاقِبِ أَهْلِ بَيْتِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسلم»"
      },
      {
        "id": 33022,
        "hadith_number": "4328",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pakaian yang Paling Disukai Rasulullah SAW",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ummu Salamah RA, beliau berkata: Pakaian yang paling disukai oleh Rasulullah SAW adalah gamis (baju kurung/jubah). (Riwayat Tirmidzi dan Abu Daud).",
        "arabic_text": "عَن أم سَلمَة قَالَتْ: كَانَ أَحَبُّ الثِّيَابِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْقَمِيصَ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد"
      },
      {
        "id": 33023,
        "hadith_number": "4329",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Panjang Lengan Baju Rasulullah ﷺ",
        "perawi_melayu": "Asma' binti Yazid",
        "english_text": "Asma bint Yazid reported: The sleeve of the shirt of the Messenger of Allah (peace and blessings be upon him) reached the wrist.",
        "malay_translation": "Daripada Asma' binti Yazid RA berkata: “Adalah lengan baju kemeja Rasulullah ﷺ sampai ke pergelangan tangan.” Riwayat Tirmidhi dan beliau berkata: “Hadis ini adalah Hasan Gharib.”",
        "arabic_text": "وَعَن أسماءَ بنت يزِيد قَالَتْ: كَانَ كُمُّ قَمِيصِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الرُّصْغِ. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ"
      },
      {
        "id": 33024,
        "hadith_number": "4330",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Memulakan Memakai Baju dengan Sebelah Kanan",
        "perawi_melayu": "Abu Hurairah RA",
        "english_text": "Narrated Abu Hurairah: The Messenger of Allah (peace and blessings of Allah be upon him) when he wore a shirt, he started with his right side. Related by At-Tirmidhi.",
        "malay_translation": "Daripada Abu Hurairah RA berkata: Adalah Rasulullah SAW apabila memakai baju (qamis), baginda memulakan dengan bahagian kanan. Riwayat at-Tirmizi.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا لَبِسَ قَمِيصًا بَدَأَ بميامنه. رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 33025,
        "hadith_number": "4331",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mengheret Pakaian Kerana Kesombongan dan Batas Pakaian Bagi Seorang Mukmin",
        "perawi_melayu": "Diriwayatkan daripada Abu Sa'id al-Khudri RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Sa'id al-Khudri RA, beliau berkata: Aku mendengar Rasulullah SAW bersabda: \"Pakaian seorang mukmin adalah hingga pertengahan betisnya dan tidak mengapa jika antara itu hingga mata kaki. Apa yang lebih rendah daripada itu (melepasi mata kaki) maka di neraka.\" Baginda bersabda demikian tiga kali. \"Dan Allah tidak akan melihat pada hari kiamat kepada orang yang mengheret pakaiannya kerana kesombongan.\" (Riwayat Abu Daud dan Ibn Majah)",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِزْرَةُ الْمُؤْمِنِ إِلَى أَنْصَافِ سَاقَيْهِ لَا جُنَاحَ عَلَيْهِ فِيمَا بَيْنَهُ وَبَيْنَ الْكَعْبَيْنِ مَا أَسْفَلَ مِنْ ذَلِكَ فَفِي النَّارِ» قَالَ ذَلِكَ ثَلَاثَ مَرَّاتٍ «وَلَا يَنْظُرُ اللَّهُ يَوْمَ الْقِيَامَةِ إِلَى مَنْ جَرَّ إِزَارَهُ بَطَرًا» . رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه"
      },
      {
        "id": 33026,
        "hadith_number": "4332",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Isbal (Melebihi Mata Kaki) dengan Sombong",
        "perawi_melayu": "Diriwayatkan daripada Salim daripada ayahnya daripada Nabi SAW, baginda bersabda: \"Isbal pada kain, baju, dan serban, sesiapa yang menjulurkannya kerana sombong, Allah tidak akan melihatnya pada hari kiamat.\"",
        "english_text": "Not Available",
        "malay_translation": "Daripada Salim, daripada ayahnya, daripada Nabi SAW, baginda bersabda: \"Isbal (melebihi mata kaki) pada kain, baju, dan serban, sesiapa yang menjulurkan sebahagian daripadanya kerana sombong, Allah tidak akan melihatnya pada hari kiamat.\" [Riwayat Abu Daud, Nasa'i dan Ibnu Majah]",
        "arabic_text": "وَعَن سَالم عَنْ أَبِيهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْإِسْبَالُ فِي الْإِزَارِ وَالْقَمِيصِ وَالْعِمَامَةِ مِنْ جَرَّ مِنْهَا شَيْئًا خُيَلَاءَ لَمْ يَنْظُرِ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيّ وَابْن مَاجَه"
      },
      {
        "id": 33027,
        "hadith_number": "4333",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ciri-ciri Pakaian Sahabat Rasulullah SAW",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Kabshah RA, beliau berkata: \"Serban sahabat Rasulullah SAW adalah rendah (tidak tinggi).\"  Riwayat Tirmidzi dan beliau berkata: \"Hadith ini adalah hadith munkar.\"",
        "arabic_text": "وَعَن أبي كبشةَ قَالَ: كَانَ كِمَامُ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بُطْحًا. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حديثٌ مُنكر"
      },
      {
        "id": 33028,
        "hadith_number": "4334",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ukuran Labuh Pakaian Wanita",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ummu Salamah RA, beliau berkata kepada Rasulullah SAW ketika baginda menyebut tentang kain sarung (izar): “Bagaimana pula dengan wanita, wahai Rasulullah?” Baginda bersabda: “Hendaklah dia melabuhkan (kainnya) sejengkal.” Ummu Salamah berkata: “Jika begitu, akan tersingkap (kaki) daripadanya.” Baginda bersabda: “Maka sehasta, jangan lebih daripada itu.”  (Riwayat Malik, Abu Daud, an-Nasa'i, dan Ibnu Majah).",
        "arabic_text": "وَعَن أم سَلمَة قَالَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ ذَكَرَ الْإِزَارَ: فَالْمَرْأَةُ يَا رَسُولَ اللَّهِ؟ قَالَ: «تُرْخِي شِبْرًا» فَقَالَتْ: إِذًا تَنْكَشِفُ عَنْهَا قَالَ: «فَذِرَاعًا لَا تَزِيدُ عَلَيْهِ» . رَوَاهُ مَالِكٌ وَأَبُو دَاوُد وَالنَّسَائِيّ وَابْن مَاجَه"
      },
      {
        "id": 33029,
        "hadith_number": "4335",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Arahan Melabuhkan Pakaian untuk Menutupi Kaki Wanita",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Teks Hadis dalam Bahasa Inggeris tidak tersedia.",
        "malay_translation": "Dan dalam riwayat Tirmizi dan Nasai dari Ibn Umar, dia berkata: 'Jika kaki mereka terdedah.' Dia (Nabi) bersabda: 'Maka hendaklah mereka melabuhkan sehasta, tidak lebih dari itu.'",
        "arabic_text": "وَفِي رِوَايَةِ التِّرْمِذِيِّ وَالنَّسَائِيِّ عَنِ ابْنِ عُمَرَ فَقَالَتْ: إِذًا تَنْكَشِفُ أَقْدَامُهُنَّ قَالَ: «فَيُرْخِينَ ذِرَاعًا لَا يزدن عَلَيْهِ»"
      },
      {
        "id": 33030,
        "hadith_number": "4336",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pemberian Bai'ah kepada Nabi Muhammad SAW dan Menyentuh Cincin Kenabian",
        "perawi_melayu": "Mu'awiyah bin Qurrah meriwayatkan daripada ayahnya, beliau berkata: Aku datang kepada Nabi SAW bersama sekumpulan orang daripada Muzainah, lalu mereka memberi bai'ah kepada baginda. Baginda ketika itu membuka butang bajunya. Aku memasukkan tanganku ke dalam kocek baju baginda dan menyentuh cincin (kenabian).",
        "english_text": "Not Available",
        "malay_translation": "Daripada Mu'awiyah bin Qurrah daripada ayahnya, beliau berkata: Aku telah datang kepada Nabi SAW bersama sekumpulan (rahth) daripada Muzainah, lalu mereka berbai'ah kepada baginda dan sesungguhnya baginda membuka butang (al-azrar). Maka aku memasukkan tanganku ke dalam kocek baju (qamis) baginda, lalu aku menyentuh cincin (kenabian). [Riwayat Abu Daud]",
        "arabic_text": "وَعَنْ مُعَاوِيَةَ بْنِ قُرَّةَ عَنْ أَبِيهِ قَالَ: أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَهْطٍ مِنْ مُزَيْنَةَ فَبَايَعُوهُ وَإِنَّهُ لَمُطْلَقُ الْأَزْرَارِ فَأَدْخَلْتُ يَدِي فِي جَيْبِ قَمِيصِهِ فَمَسِسْتُ الْخَاتم. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33031,
        "hadith_number": "4337",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Anjuran Memakai Pakaian Putih dan Mengkafan Mayat Dengannya",
        "perawi_melayu": "Samurah RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Samurah RA, bahawa Nabi SAW bersabda: “Pakailah pakaian putih kerana sesungguhnya ia lebih bersih dan lebih baik, dan kafankanlah dengannya mayat-mayat kamu.” Riwayat Ahmad, Tirmizi, Nasai dan Ibnu Majah.",
        "arabic_text": "وَعَن سَمُرَة أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْبَسُوا الثِّيَابَ الْبِيضَ فَإِنَّهَا أَطْهَرُ وَأَطْيَبُ وَكَفِّنُوا فِيهَا مَوْتَاكُمْ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَه"
      },
      {
        "id": 33032,
        "hadith_number": "4338",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Cara Rasulullah SAW Memakai Serban",
        "perawi_melayu": "Ibnu Umar",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Umar RA berkata: Kebiasaannya Rasulullah SAW apabila memakai serban, Baginda melabuhkan (menjuntaikan) hujung serbannya di antara kedua bahunya. (Riwayat Tirmizi). Beliau berkata: Ini adalah Hadith Hasan Gharib.",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اعْتَمَّ سَدَلَ عِمَامَتَهُ بَيْنَ كَتِفَيْهِ. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ"
      },
      {
        "id": 33033,
        "hadith_number": "4339",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Cara Rasulullah SAW Memakaikan Serban",
        "perawi_melayu": "Diriwayatkan daripada Abdurrahman bin Auf RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abdurrahman bin Auf RA berkata: Rasulullah SAW memakaikan aku serban, lalu Baginda SAW menjulurkannya di hadapanku dan di belakangku. (Riwayat Abu Daud)",
        "arabic_text": "وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَ: عَمَّمَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَدَلَهَا بَيْنَ يَدَيَّ وَمِنْ خَلْفِي. رَوَاهُ أَبُو دَاوُدَ"
      },
      {
        "id": 33034,
        "hadith_number": "4340",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perbezaan Antara Kita dan Orang Musyrik: Memakai Serban di Atas Kopiah",
        "perawi_melayu": "Diriwayatkan daripada Rukanah daripada Nabi SAW, baginda bersabda:",
        "english_text": "Not Available",
        "malay_translation": "\"Perbezaan antara kita dan orang musyrik adalah memakai serban di atas kopiah.\".  Riwayat Tirmidzi dan beliau berkata: Hadis ini hasan gharib dan sanadnya tidak begitu kuat.",
        "arabic_text": "وَعَن ركَانَة عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «فَرْقُ مَا بَيْنَنَا وَبَيْنَ الْمُشْرِكِينَ الْعَمَائِمُ عَلَى الْقَلَانِسِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَإِسْنَاده لَيْسَ بالقائم"
      },
      {
        "id": 33035,
        "hadith_number": "4341",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keharusan Emas dan Sutera bagi Wanita dan Larangan bagi Lelaki",
        "perawi_melayu": "Diriwayatkan daripada Abu Musa al-Asy'ari",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Musa al-Asy'ari RA, bahawa Nabi SAW bersabda: “Emas dan sutera dihalalkan bagi wanita daripada umatku, dan diharamkan ke atas lelaki mereka.”  Riwayat at-Tirmizi dan an-Nasai. At-Tirmizi berkata: Hadith ini sahih.",
        "arabic_text": "وَعَنْ أَبِي مُوسَى الْأَشْعَرِيِّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أُحِلَّ الذَّهَبُ وَالْحَرِيرُ لِلْإِنَاثِ مِنْ أُمَّتِي وَحُرِّمَ عَلَى ذُكُورِهَا» . رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ وَقَالَ التِّرْمِذِيّ: هَذَا صَحِيح"
      },
      {
        "id": 33036,
        "hadith_number": "4342",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Doa Rasulullah SAW Ketika Memakai Pakaian Baru",
        "perawi_melayu": "Abu Sa'id al-Khudri",
        "english_text": "Narrated from Abu Sa'id al-Khudri RA, he said: When the Messenger of Allah (peace and blessings be upon him) wore a new garment, he would name it, whether it was a turban, a shirt, or a cloak, then he would say: 'Allahumma laka al-hamdu kama kasawtanihi, as'aluka khairahu wa khaira ma suni'a lahu, wa a'udhu bika min sharrihi wa sharri ma suni'a lahu.' (O Allah, to You is praise as You have clothed me with it. I ask You for its good and the good of what it was made for, and I seek refuge with You from its evil and the evil of what it was made for.) Reported by Tirmidhi and Abu Dawood.",
        "malay_translation": "Diriwayatkan daripada Abu Sa'id al-Khudri RA, beliau berkata: Adalah Rasulullah SAW apabila memakai pakaian baru, baginda menyebut namanya, sama ada serban, atau baju, atau selendang, kemudian baginda membaca: 'Ya Allah, bagi-Mu segala pujian sebagaimana Engkau telah memakaikannya kepadaku, aku memohon kepada-Mu kebaikannya dan kebaikan tujuan ia dibuat, dan aku berlindung dengan-Mu daripada keburukannya dan keburukan tujuan ia dibuat.' Riwayat Tirmizi dan Abu Daud.",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَجَدَّ ثَوْبًا سَمَّاهُ بِاسْمِهِ عِمَامَةً أَوْ قَمِيصًا أَوْ رِدَاءً ثُمَّ يَقُولُ «اللَّهُمَّ لَكَ الْحَمْدُ كَمَا كسوتَنيه أَسأَلك خَيره وخيرَ مَا صُنِعَ لَهُ وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنِعَ لَهُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ"
      },
      {
        "id": 33037,
        "hadith_number": "4343",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Mengucapkan Alhamdulillah Setelah Makan dan Memakai Pakaian",
        "perawi_melayu": "Diriwayatkan daripada Mu'adh bin Anas RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Mu'adh bin Anas RA, bahawa Rasulullah SAW bersabda: “Sesiapa yang makan makanan kemudian mengucapkan: ‘Alhamdulillahilladzi ath'amani haadzath tha'ama wa razaqaniihi min ghairi haulin minni wa laa quwwatin (Segala puji bagi Allah yang telah memberikan aku makan makanan ini dan merezekikan kepadaku tanpa daya dan kekuatan dariku)’, maka diampuni baginya dosa-dosanya yang telah lalu.” Diriwayatkan oleh Tirmidzi, dan Abu Daud menambahkan: “Dan sesiapa yang memakai pakaian kemudian mengucapkan: ‘Alhamdulillahilladzi kasaanii haadzaa wa razaqaniihi min ghairi haulin minni wa laa quwwatin (Segala puji bagi Allah yang telah memberikan aku pakaian ini dan merezekikan kepadaku tanpa daya dan kekuatan dariku)’, maka diampuni baginya dosa-dosanya yang telah lalu dan yang akan datang.”",
        "arabic_text": "وَعَن معاذِ بن أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: مَنْ أَكَلَ طَعَامًا ثُمَّ قَالَ: الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هَذَا الطَّعَامَ وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ . رَوَاهُ التِّرْمِذِيُّ وَزَادَ أَبُو دَاوُدَ: وَمَنْ لَبِسَ ثَوْبًا فَقَالَ: الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي هَذَا وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَا تَأَخَّرَ"
      },
      {
        "id": 33038,
        "hadith_number": "4344",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Petunjuk Rasulullah SAW tentang Mengurus Dunia dan Menjauhi Kemewahan",
        "perawi_melayu": "Aishah r.a.",
        "english_text": "Narrated by Aishah that the Messenger of Allah, peace and blessings be upon him, said to her, \"O Aishah, when you desire to join me, let the worldly things suffice you like the provision of a traveler. Avoid the company of the wealthy. Do not sew a garment until you have mended it.\"",
        "malay_translation": "Daripada Aishah r.a., bahawa Rasulullah SAW bersabda kepadanya, \"Wahai Aishah, apabila engkau ingin menyusulku, cukuplah bagimu dunia seperti bekalan pengembara. Jauhilah pergaulan orang kaya. Jangan menjahit pakaian sehingga engkau menampal atau membetulkannya.\"",
        "arabic_text": "وَعَنْ عَائِشَةَ قَالَتْ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا عَائِشَةُ إِذَا أَرَدْتِ اللُّحُوقَ بِي فَلْيَكْفِكِ مِنَ الدُّنْيَا كَزَادِ الرَّاكِبِ وَإِيَّاكِ وَمُجَالَسَةَ الْأَغْنِيَاءِ وَلَا تَسْتَخْلِقِي ثَوْبًا حَتَّى تُرَقِّعِيهِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ صَالِحِ بْنِ حَسَّانَ قَالَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ: صَالِحُ بْنُ حَسَّانَ مُنكر الحَدِيث"
      },
      {
        "id": 33039,
        "hadith_number": "4345",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kebaziran Adalah Sebahagian Daripada Iman",
        "perawi_melayu": "Abu Umaiyyah Iyas bin Tsa'labah",
        "english_text": "Daripada Abu Umaiyyah Iyas bin Tsa'labah. Beliau berkata: Rasulullah SAW bersabda: \"Tidakkah kamu dengar? Tidakkah kamu dengar bahawa kebaziran merupakan sebahagian daripada iman?\"",
        "malay_translation": "Daripada Abu Umaiyyah Iyas bin Tsa’labah. Beliau berkata: Rasulullah SAW bersabda, \"Tidakkah kamu dengar? Tidakkah kamu dengar bahawa kebaziran (atau sikap membazir) adalah sebahagian daripada kekurangan iman?\"  (Disebutkan oleh Imam Abu Daud)",
        "arabic_text": "عَن أبي أُمَامَة إِياس بن ثعلبةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَلَا تَسْمَعُونَ؟ أَلَا تَسْمَعُونَ أَنَّ الْبَذَاذَةَ مِنَ الْإِيمَانِ أَنَّ الْبَذَاذَةَ مِنَ الْإِيمَانِ؟» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33040,
        "hadith_number": "4346",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ancaman Terhadap Pakaian Kemegahan di Dunia",
        "perawi_melayu": "Not Available",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Umar RA, beliau berkata: Rasulullah SAW bersabda: \"Barangsiapa memakai pakaian kemegahan di dunia, Allah akan memakaikannya pakaian kehinaan pada hari kiamat.\" Riwayat Ahmad, Abu Daud dan Ibnu Majah.",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ لَبِسَ ثَوْبَ شهرةٍ منَ الدُّنْيَا أَلْبَسَهُ اللَّهُ ثَوْبَ مَذَلَّةٍ يَوْمَ الْقِيَامَةِ» . رَوَاهُ أَحْمد وَأَبُو دَاوُد وَابْن مَاجَه"
      },
      {
        "id": 33041,
        "hadith_number": "4347",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menyerupai suatu kaum, Maka Ia Termasuk Daripada Mereka",
        "perawi_melayu": null,
        "english_text": null,
        "malay_translation": "Dan daripada beliau, beliau berkata: Rasulullah SAW bersabda: \"Barangsiapa yang menyerupai suatu kaum, maka dia termasuk daripada mereka.\"\nDiriwayatkan oleh Imam Ahmad dan Imam Abu Dawud.",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ تَشَبَّهَ بِقَوْمٍ فَهُوَ مِنْهُمْ» . رَوَاهُ أَحْمد وَأَبُو دَاوُد"
      },
      {
        "id": 33042,
        "hadith_number": "4348",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadiah Keramat dan Kezaliman Kerajaan Allah bagi Mereka yang Mengamalkan Kerendahan Hati dan Mencari Jodoh demi Allah",
        "perawi_melayu": "Suwaid bin Wahb daripada seorang lelaki daripada kalangan anak-anak sahabat Rasulullah SAW melalui bapanya.",
        "english_text": "From Suwaid bin Wahb, from a man from among the children of the Companions of the Messenger of Allah (peace and blessings of Allah be upon him) from his father, who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: \"Whoever leaves the adornment of a camel's garment, while able to afford it, and out of humility, Allah will clothe him with the adornment of honour. And whoever marries for the sake of Allah, Allah will bestow upon him the crown of kingship.\"",
        "malay_translation": "Daripada Suwaid bin Wahb, daripada seorang lelaki daripada kalangan anak-anak sahabat Rasulullah SAW melalui bapanya, yang berkata: Rasulullah SAW bersabda: \"Sesiapa yang meninggalkan perhiasan pakaian unta, sedang dia mampu menanggungnya, dan kerana kerendahan hati, Allah akan menganugerahkannya dengan perhiasan kebesaran. Dan sesiapa yang berkahwin kerana Allah, Allah akan menganugerahkannya dengan mahkota pemerintahan.\"",
        "arabic_text": "وَعَنْ سُوَيْدِ بْنِ وَهْبٍ عَنْ رَجُلٍ مِنْ أَبْنَاءِ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَبِيهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ تَرَكَ لُبْسَ ثوبِ جمالٍ وَهُوَ يقدرُ عَلَيْهِ وَفِي رَاوِيه: تَوَاضُعًا كَسَاهُ اللَّهُ حُلَّةَ الْكَرَامَةِ وَمَنْ تَزَوَّجَ لِلَّهِ تَوَجَّهُ اللَّهُ تَاجَ الْمُلْكِ . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33043,
        "hadith_number": "4349",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis Mengenai Pakaian",
        "perawi_melayu": null,
        "english_text": "Al-Tirmizi meriwayatkan dari Mu'adz bin Anas tentang hadis berkaitan pakaian",
        "malay_translation": "Imam Tirmidzi meriwayatkan hadis daripada Mu'adz bin Anas berkenaan dengan pakaian.",
        "arabic_text": "وَرَوَى التِّرْمِذِيُّ مِنْهُ عَنْ مُعَاذِ بْنِ أَنَسٍ حَدِيث اللبَاس"
      },
      {
        "id": 33044,
        "hadith_number": "4350",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Allah Menyukai Kelihatan Nikmat-Nya di atas Hamba-Nya",
        "perawi_melayu": "Amru bin Syu'aib daripada bapanya daripada datuknya, katanya:",
        "english_text": "Daripada 'Amru bin Syu'aib daripada bapanya daripada datuknya, katanya: Rasulullah SAW bersabda, \"Sesungguhnya Allah suka melihat bekas nikmat-Nya di atas hamba-Nya.\"",
        "malay_translation": "Daripada 'Amru bin Syu'aib daripada bapanya daripada datuknya, katanya: Rasulullah SAW bersabda, \"Sesungguhnya Allah menyukai agar kelihatan bekas nikmat-Nya atas hamba-Nya.\"",
        "arabic_text": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ يُحِبُّ أَنْ يُرَى أَثَرَ نِعْمَتِهِ على عَبده» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 33045,
        "hadith_number": "4351",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menjaga Kebersihan Diri dan Keelokan Rupa",
        "perawi_melayu": null,
        "english_text": "And from Jabir, he said: The Messenger of Allah, peace and blessings be upon him, visited us and saw a man whose hair was dishevelled. He said: ‘Did he not find something with which to settle his head?’ And he saw a man with stained clothes. He said: ‘Did he not find something with which to wash his clothes?’ Ahmad and an-Nasa'i narrated this.",
        "malay_translation": "Dan daripada Jabir, dia berkata: Rasulullah SAW melawat kami dan melihat seorang lelaki yang rambutnya berterabur. Baginda bersabda: ‘Tidakkah dia mendapati sesuatu untuk menata rambutnya?’ Dan Baginda melihat seorang lelaki yang pakaiannya kotor. Baginda bersabda: ‘Tidakkah dia mendapati sesuatu untuk mencuci pakaiannya?’ Ahmad dan al-Nasai meriwayatkan hadis ini.",
        "arabic_text": "وَعَنْ جَابِرٍ قَالَ: أَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَائِرًا فَرَأَى رَجُلًا شَعِثًا قد تفرق شعرُه فَقَالَ: «مَا كَانَ يَجِدُ هَذَا مَا يُسَكِّنُ بِهِ رَأْسَهُ؟» وَرَأى رجلا عَلَيْهِ ثيابٌ وسِخةٌ فَقَالَ: «مَا كَانَ يَجِدُ هَذَا مَا يَغْسِلُ بِهِ ثَوْبَهُ؟» . رَوَاهُ أَحْمد وَالنَّسَائِيّ"
      },
      {
        "id": 33046,
        "hadith_number": "4352",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Mensyukuri Nikmat Harta",
        "perawi_melayu": "Abu Al-Hawwush daripada bapanya",
        "english_text": "Daripada Abu Al-Hawwush daripada bapanya, berkata: Saya datang kepada Rasulullah SAW, sedang sehelai kain yang sederhana menutup tubuhku. Baginda bertanya kepadaku, \"Adakah engkau mempunyai harta?\" Aku menjawab, \"Ya.\" Baginda bertanya lagi, \"Dari mana harta itu?\" Aku menjawab, \"Dari pelbagai sumber. Allah telah mengurniakan kepadaku unta, lembu, kuda dan hamba sahaya.\" Baginda bersabda, \"Apabila Allah memberi harta kepadamu, sepatutnya kelihatan bekas nikmat dan kemuliaan Allah kepadamu.\"",
        "malay_translation": "Daripada Abu Al-Hawwush daripada bapanya, beliau berkata, \"Aku mendatangi Rasulullah SAW, ketika aku mengenakan pakaian yang sederhana. Baginda bertanya kepadaku, 'Adakah engkau memiliki harta?' Aku menjawab, 'Ya.' Baginda bertanya lagi, 'Dari mana harta itu?' Aku menjawab, 'Dari pelbagai sumber. Allah telah memberikan kepadaku unta, lembu, kuda, dan hamba sahaya.' Baginda bersabda, 'Apabila Allah memberikan harta kepadamu, hendaklah bekas nikmat dan kemuliaan Allah itu nyata padamu.'",
        "arabic_text": "وَعَن أبي الأحوصِ عَن أبيهِ قَالَ: أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَى ثَوْبٌ دُونٌ فَقَالَ لِي: «أَلَكَ مَالٌ؟» قُلْتُ: نَعَمْ. قَالَ: «مِنْ أَيِّ الْمَالِ؟» قُلْتُ: مِنْ كُلِّ الْمَالِ قَدْ أَعْطَانِي اللَّهُ منَ الإِبلِ وَالْبَقر وَالْخَيْلِ وَالرَّقِيقِ. قَالَ: «فَإِذَا آتَاكَ اللَّهُ مَالًا فَلْيُرَ أَثَرُ نِعْمَةِ اللَّهِ عَلَيْكَ وَكَرَامَتِهِ» . رَوَاهُ أَحْمَدُ وَالنَّسَائِيُّ وَفِي شَرْحِ السُّنَّةِ بِلَفْظِ الْمَصَابِيحِ"
      },
      {
        "id": 33047,
        "hadith_number": "4353",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis Mengenai Nabi SAW Tidak Membalas Salam Orang Yang Memakai Baju Merah",
        "perawi_melayu": "Abdul Rahman bin 'Amru",
        "english_text": "And it was narrated from Abdullah bin 'Amr, he said: A man passed by wearing two red garments, and he greeted the Prophet ﷺ, but the Prophet ﷺ did not reply. Narrated by al-Tirmidhi and Abu Dawud.",
        "malay_translation": "Dan diriwayatkan daripada Abdullah bin 'Amru, beliau berkata: Seorang lelaki lalu sambil memakai dua helai pakaian berwarna merah, dan dia memberi salam kepada Nabi SAW, namun Nabi SAW tidak membalas salamnya. Diriwayatkan oleh al-Tirmidhi dan Abu Dawud.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: مَرَّ رَجُلٌ وَعَلَيْهِ ثَوْبَانِ أَحْمَرَانِ فَسَلَّمَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَرُدَّ عَلَيْهِ. رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد"
      },
      {
        "id": 33048,
        "hadith_number": "4354",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menggunakan Sutera, Pakaian Berwarna Merah, dan Minyak Wangi Tertentu",
        "perawi_melayu": "Diriwayatkan daripada Imran bin Husain RA bahawa Nabi Allah SAW bersabda:",
        "english_text": "Not Available",
        "malay_translation": "\"Aku tidak menunggang pelana berwarna ungu, tidak memakai pakaian yang dicelup dengan za'faran (merah), dan tidak memakai baju yang berjahit sutera.\" Baginda bersabda lagi: \"Ketahuilah, minyak wangi lelaki adalah yang berbau tanpa warna, dan minyak wangi wanita adalah yang berwarna tanpa bau.\" (Riwayat Abu Daud)",
        "arabic_text": "وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا أَرْكَبُ الْأُرْجُوَانَ وَلَا أَلْبَسُ الْمُعَصْفَرَ وَلَا أَلْبَسُ الْقَمِيصَ الْمُكَفَّفَ بِالْحَرِيرِ» وَقَالَ: «أَلَا وَطِيبُ الرِّجَالِ رِيحٌ لَا لَوْنَ لَهُ وَطِيبُ النِّسَاءِ لَوْنٌ لَا ريح لَهُ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33049,
        "hadith_number": "4355",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Sepuluh Perkara dan Perkara yang Dilarang Rasulullah SAW",
        "perawi_melayu": null,
        "english_text": null,
        "malay_translation": "Daripada Abi Raihanah, katanya: Rasulullah SAW telah melarang sepuluh perkara: 1.  Memperelok diri dengan melukis (menggunakan pewarna) di tubuh (wushur) dan mewarnakan tubuh (wushm). 2.  Mencabut bulu halus (nattf). 3.  Bertengkar antara lelaki dengan lelaki tanpa sebab yang sah (mukameah). 4.  Bertengkar antara perempuan dengan perempuan tanpa sebab yang sah (mukameah). 5.  Memakai kain sutera (kandungan sutera yang halus) sebagai pakaian bawah (di dalam pakaian).  6.  Memakai sutera seperti yang dilakukan oleh orang bukan Islam (a'ajam).  7.  Memakai sutera di atas bahu seperti yang dilakukan oleh orang bukan Islam (a'ajam). 8.  Mencuri (nuhby). 9.  Menunggang harimau. 10. Memakai cincin kecuali bagi orang yang berkuasa (berkedudukan istimewa) (diluaskan/disertakan). Diriwayatkan oleh Imam Abu Daud dan Imam An-Nasa'i.",
        "arabic_text": "وَعَن أبي ريحانةَ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ عَشْرٍ: عَنِ الْوَشْرِ وَالْوَشْمِ وَالنَّتْفِ وَعَنْ مُكَامَعَةِ الرَّجُلِ الرَّجُلَ بِغَيْرِ شِعَارٍ وَمُكَامَعَةِ الْمَرْأَةِ الْمَرْأَةَ بِغَيْرِ شِعَارٍ وَأَنْ يَجْعَلَ الرَّجُلُ فِي أَسْفَلِ ثِيَابِهِ حَرِيرًا مِثْلَ الْأَعَاجِمِ أَوْ يجعلَ على مَنْكِبَيْه حَرِير مِثْلَ الْأَعَاجِمِ وَعَنِ النُّهْبَى وَعَنْ رُكُوبِ النُّمُورِ وَلُبُوسِ الْخَاتَمِ إِلَّا لِذِي سُلْطَانٍ . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ"
      },
      {
        "id": 33050,
        "hadith_number": "4356",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menggunakan Perhiasan Emas dan Baju Khas",
        "perawi_melayu": "Ali",
        "english_text": "From Ali, it is narrated that the Messenger of Allah (peace and blessings be upon him) forbade the use of gold rings, wearing of fine silks, and robes of certain colors.",
        "malay_translation": "Daripada Ali, ia diriwayatkan bahawa Rasulullah SAW melarang penggunaan cincin emas, memakai sutera halus, dan pakaian berwarna-warni tertentu.",
        "arabic_text": "وَعَن عَليّ قَالَ: نَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ خَاتَمِ الذَّهَبِ وَعَنْ لُبْسِ الْقَسِّيِّ وَالْمَيَاثِرِ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ وَفِي رِوَايَة لأبي دَاوُد قَالَ: نهى عَن مياثر الأرجوان"
      },
      {
        "id": 33051,
        "hadith_number": "4357",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menunggang Khazz dan Nimar",
        "perawi_melayu": "Mu'awiyah",
        "english_text": "Daripada Mu'awiyah r.a., dia berkata: Rasulullah SAW bersabda: \"Janganlah kalian menunggang Khazz dan Nimar.\"",
        "malay_translation": "Daripada Mu'awiyah radhiyallahu 'anhu, beliau berkata: Rasulullah SAW bersabda, \"Janganlah kalian menunggang khazz dan nimar.\"  Riwayat Abu Daud dan an-Nasa'i.",
        "arabic_text": "وَعَنْ مُعَاوِيَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَرْكَبُوا الْخَزَّ وَلَا النِّمَارَ» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ"
      },
      {
        "id": 33052,
        "hadith_number": "4358",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Penggunaan Pelana Merah",
        "perawi_melayu": "Diriwayatkan daripada Al-Bara' bin 'Azib",
        "english_text": "Not Available",
        "malay_translation": "Daripada Al-Bara' bin 'Azib: Sesungguhnya Nabi SAW melarang penggunaan pelana merah.  Riwayat ini terdapat dalam Syarah as-Sunnah.",
        "arabic_text": "وَعَنِ الْبَرَاءِ بْنِ عَازِبٍ: أَنَّ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمِيثَرَةِ الْحَمْرَاءِ. رَوَاهُ فِي شرح السّنة"
      },
      {
        "id": 33053,
        "hadith_number": "4359",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penerangan Mengenai Nabi SAW yang Berpakaian Hijau dan Berambut Uban Merah",
        "perawi_melayu": "Abu Rimtsah al-Timi",
        "english_text": "And from Abu Rimtsah al-Timi, he said: I visited the Prophet SAW, and he was wearing two green garments, and he had hair that was mostly grey, and his greying hair was red. It was narrated by at-Tirmidhi, and in a narration by Abu Dawud: and he had abundant hair, and there was a henna dye on it.",
        "malay_translation": "Dan daripada Abu Rimtsah al-Timi, beliau berkata: Aku menemui Nabi SAW, dan baginda memakai dua helai pakaian berwarna hijau, dan baginda mempunyai rambut yang kebanyakannya sudah beruban, dan uban baginda berwarna merah. Ia diriwayatkan oleh at-Tirmidhi, dan dalam satu riwayat daripada Abu Dawud: dan baginda mempunyai rambut yang lebat, dan ada pewarna henna padanya.",
        "arabic_text": "وَعَن أبي رِمْثةَ التيميِّ قَالَ: أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ ثَوْبَانِ أَخْضَرَانِ وَلَهُ شَعَرٌ قَدْ عَلَاهُ الشَّيْبُ وَشَيْبُهُ أَحْمَرُ. رَوَاهُ التِّرْمِذِيُّ وَفِي رِوَايَةٍ لِأَبِي دَاوُدَ: وَهُوَ ذُو وَفْرَةٍ وَبِهَا رَدْعٌ من حناء"
      },
      {
        "id": 33054,
        "hadith_number": "4360",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi SAW Yang Sedang Sakit dan Solat Bersama Para Sahabat",
        "perawi_melayu": "Anas bin Malik رضي الله عنه",
        "english_text": "And from Anas (may Allah be pleased with him): that the Prophet (peace and blessings be upon him) was feeling unwell, so he went out, leaning on Usamah, and wearing a garment made of coarse cloth which he had put on. Then he prayed with them. It was narrated in Syarh al-Sunnah",
        "malay_translation": "Dari Anas رضي الله عنه, bahawa Nabi SAW pernah merasa tidak sihat. Baginda keluar, bersandar pada Usamah, dan memakai pakaian kasar yang dipakainya. Kemudian baginda solat bersama mereka. Ia diriwayatkan dalam Syarh al-Sunnah.",
        "arabic_text": "وَعَنْ أَنَسٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ شَاكِيًا فَخَرَجَ يَتَوَكَّأُ عَلَى أُسَامَةَ وَعَلَيْهِ ثَوْبُ قِطْرٍ قَدْ تَوَشَّحَ بِهِ فَصَلَّى بهم. رَوَاهُ فِي شرح السّنة"
      },
      {
        "id": 33055,
        "hadith_number": "4361",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kisah Nabi SAW Menggunakan Baju Kotor dan Pembeli Yahudi",
        "perawi_melayu": "Aisyah رضي الله عنها",
        "english_text": "Narrated Aisha رضي الله عنها.  The Prophet ﷺ had two thick, coarse garments. When he sat down, they were heavy on him. A merchant from Sham came for a certain Jew. I said, \"If you send for him and buy two garments for the journey, it would be good.\" He sent for him, and the merchant said, \"I know what you want. You only want to take my money.\" The Messenger of Allah ﷺ said, \"He lies. He knows that I am amongst the most pious and trustworthy of people.\"  Narrated by At-Tirmidhi and An-Nasa'i.",
        "malay_translation": "Daripada Aisyah رضي الله عنها, Rasulullah SAW memakai dua helai pakaian yang tebal dan kasar. Apabila baginda duduk, ia terasa berat. Seorang pedagang dari Syam datang untuk seorang Yahudi tertentu. Saya berkata, \"Jika baginda menghantar utusan untuk membelinya dua helai pakaian untuk perjalanan, ia akan bermanfaat.\" Baginda menghantar utusan, dan pedagang itu berkata, \"Saya tahu apa yang anda mahu. Anda hanya ingin mengambil wang saya.\" Rasulullah SAW bersabda, \"Dia berdusta. Dia tahu bahawa aku termasuk dalam kalangan orang yang paling bertaqwa dan amanah.\"  Riwayat Imam At-Tirmidzi dan An-Nasai.",
        "arabic_text": "وَعَنْ عَائِشَةَ قَالَتْ: كَانَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَوْبَانِ قِطْرِيَّانِ غَلِيظَانِ وَكَانَ إِذا قعد فرق ثَقُلَا عَلَيْهِ فَقَدِمَ بَزٌّ مِنَ الشَّامِ لِفُلَانٍ الْيَهُودِيِّ. فَقُلْتُ: لَوْ بَعَثْتَ إِلَيْهِ فَاشْتَرَيْتَ مِنْهُ ثَوْبَيْنِ إِلَى الْمَيْسَرَةِ فَأَرْسَلَ إِلَيْهِ فَقَالَ: قَدْ عَلِمْتُ مَا تُرِيدُ إِنَّمَا تُرِيدُ أَنْ تَذْهَبَ بِمَالِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كَذَبَ قَدْ عَلِمَ أَنِّي مِنْ أَتْقَاهُمْ وآداهُم للأمانة» . رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ"
      },
      {
        "id": 33056,
        "hadith_number": "4362",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Memakai Baju Berwarna Kuning dan Kepentingan Mendistribusikan Baju Tersebut",
        "perawi_melayu": "Abdullah bin Amr bin al-As",
        "english_text": "From Abdullah bin Amr bin al-As, who said: Rasulullah SAW saw me wearing a garment dyed yellow. He asked, “What is this?” I understood what he disliked and I went and burned it. Then the Prophet SAW said, “What have you done to your garment?” I said, “I burned it.” He said, “Why didn't you give it to some of your family?  It is permissible for women.” Reported by Abu Daud.",
        "malay_translation": "Daripada Abdullah bin Amr bin al-As, yang berkata: Rasulullah SAW melihat aku memakai pakaian yang berwarna kuning. Baginda bertanya, “Apakah ini?” Aku faham apa yang Baginda tidak suka dan aku pergi membakarnya. Kemudian Nabi SAW bertanya, “Apa yang telah engkau lakukan pada pakaianmu?” Aku menjawab, “Aku membakarnya.” Baginda bersabda, “Mengapa engkau tidak memberikannya kepada sebahagian ahli keluargamu? Kerana ia dibolehkan untuk kaum wanita.” Diriwayatkan oleh Imam Abu Daud.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَ: رَآنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَى ثَوْبٌ مَصْبُوغٌ بِعُصْفُرٍ مُوَرَّدًا فَقَالَ: «مَا هَذَا؟» فَعَرَفْتُ مَا كَرِهَ فَانْطَلَقْتُ فَأَحْرَقْتُهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا صَنَعْتَ بِثَوْبِكَ؟» قُلْتُ: أَحْرَقْتُهُ قَالَ: «أَفَلَا كَسَوْتَهُ بَعْضَ أَهْلِكَ؟ فَإِنَّهُ لَا بَأْسَ بِهِ لِلنِّسَاءِ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33057,
        "hadith_number": "4363",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penglihatan Nabi SAW di Mina Menunggang Unta Betina dan Berpakaian Burdah Merah",
        "perawi_melayu": "Hala bin 'Amir dari bapanya",
        "english_text": "And it was narrated from Hala bin 'Amir from his father, he said, \"I saw the Prophet, peace and blessings be upon him, in Mina giving a sermon on a she-camel, and he wore a red burdah (cloak), and Ali (رضي الله عنه) was in front of him, explaining (the sermon). Abu Dawud narrated it.\"",
        "malay_translation": "Dan diriwayatkan daripada Hala bin 'Amir daripada bapanya, katanya, \"Saya melihat Nabi SAW di Mina menyampaikan khutbah di atas seekor unta betina, dan baginda memakai burdah berwarna merah, serta Ali (رضي الله عنه) berada di hadapan baginda, menjelaskan khutbah tersebut. Abu Dawud meriwayatkannya.",
        "arabic_text": "وَعَن هلالِ بن عَامر عَن أَبِيه قَالَ: رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى يَخْطُبُ عَلَى بَغْلَةٍ وَعَلَيْهِ بُرْدٌ أَحْمَرُ وَعَلِيٌّ أَمَامَهُ يُعَبِّرُ عَنْهُ. رَوَاهُ أَبُو دَاوُدَ"
      },
      {
        "id": 33058,
        "hadith_number": "4364",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kejadian Jubah Hitam Nabi SAW dan Bau Sutera",
        "perawi_melayu": "Aisyah رضي الله عنها",
        "english_text": "And from A'ishah she said: A dark cloak was made for the Prophet ﷺ, and he wore it. When he perspired in it, he sensed the fragrance of wool and threw it off.  Narrated by Abu Dawud.",
        "malay_translation": "Dan daripada Aisyah رضي الله عنها, beliau berkata: Sebuah jubah berwarna hitam telah dibuat untuk Nabi SAW, dan baginda memakainya. Apabila baginda berpeluh di dalamnya, baginda merasakan bau sutera dan membuangnya. Diriwayatkan oleh Abu Dawud.",
        "arabic_text": "وَعَن عَائِشَة قَالَتْ: صُنِعَتْ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بُرْدَةٌ سَوْدَاءُ فَلَبِسَهَا فَلَمَّا عَرِقَ فِيهَا وَجَدَ ريح الصُّوف فقذفها. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33059,
        "hadith_number": "4365",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis tentang Nabi SAW yang memakai selimut menutupi kakinya",
        "perawi_melayu": null,
        "english_text": "And from Jabir, he said: I came to the Prophet ﷺ while he was wearing a garment that had fallen to his feet.",
        "malay_translation": "Dan daripada Jabir, beliau berkata: Aku mendatangi Nabi SAW ketika baginda mengenakan sehelai pakaian yang telah menutupi kedua kaki baginda.",
        "arabic_text": "وَعَنْ جَابِرٍ قَالَ: أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُحْتَبٍ بِشَمْلَةٍ قَدْ وَقَعَ هُدْبها على قَدَمَيْهِ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33060,
        "hadith_number": "4366",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Petunjuk Nabi SAW Mengenai Penggunaan Kain Qabati",
        "perawi_melayu": "Dihiyyah bin Khalifah",
        "english_text": "Narrated by Dihyah ibn Khalifah: I went to the Prophet ﷺ with a Qabati cloth. He gave me a portion of it and said, “Spread it out in two parts, cut one piece into a shirt and give the other to your wife to wear as a head covering”. When I turned away, he said, “Instruct your wife to place an inner garment underneath it, that does not reveal her.” Reported by Imam Abu Dawud.",
        "malay_translation": "Diceritakan oleh Dihyah bin Khalifah: Saya menemui Nabi SAW dengan sehelai kain Qabati. Baginda memberikan sebahagian daripada kain tersebut dan bersabda, “Bentangkan kain ini kepada dua bahagian, potong salah satu bahagiannya untuk dijadikan baju dan berikan bahagian yang lain kepada isteri anda untuk dipakai sebagai penutup kepala.” Ketika saya berpaling, Baginda bersabda, “Suruhlah isteri anda meletakkan pakaian dalam di bawah kain tersebut, supaya tidak mendedahkan auratnya.” Diriwayatkan oleh Imam Abu Dawud.",
        "arabic_text": "وَعَن دِحيةَ بن خليفةَ قَالَ: أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَبَاطِيَّ فَأَعْطَانِي مِنْهَا قُبْطِيَّةً فَقَالَ: «اصْدَعْهَا صَدْعَيْنِ فَاقْطَعْ أَحَدَهُمَا قَمِيصًا وَأَعْطِ الْآخَرَ امْرَأَتَكَ تَخْتَمِرُ بِهِ» . فَلَمَّا أَدْبَرَ قَالَ: «وَأْمُرِ امْرَأَتَكَ أَنْ تَجْعَلَ تَحْتَهُ ثَوْبًا لَا يَصِفُهَا» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33061,
        "hadith_number": "4367",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi ﷺ Menegur Cara Berhijab",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ummu Salamah RA, bahawa Nabi ﷺ masuk menemuinya ketika dia sedang berhijab, lalu Baginda bersabda: “Satu lilitan, bukan dua lilitan.” (Riwayat Abu Daud)",
        "arabic_text": "وَعَنْ أُمِّ سَلَمَةَ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا وَهِيَ تَخْتَمِرُ فَقَالَ: «ليَّةً لَا ليَّتينِ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33062,
        "hadith_number": "4368",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ketetapan Panjang Izar dan Adab Memakai Pakaian",
        "perawi_melayu": "Ibn Umar",
        "english_text": "Dari Ibn Umar, dia berkata: Aku pernah melewati Rasulullah SAW, dan kain sarungku agak longgar. Baginda bersabda: \"Wahai Abdullah, naikkan kain sarungmu.\" Lalu aku naikkannya. Kemudian Baginda bersabda: \"Lebihkan lagi.\" Lalu aku menambahkan lagi. Sejak itu, aku sentiasa berusaha untuk memastikan panjang kain itu tepat. Ada yang bertanya: Sampai sejauh mana? Jawab Baginda: \"Sampai separuh betis.\"",
        "malay_translation": "Daripada Ibn Umar, dia berkata: Aku pernah melewati Rasulullah SAW, dan kain sarungku agak longgar. Baginda bersabda, \"Wahai Abdullah, naikkan kain sarungmu.\" Lalu aku naikkannya. Kemudian Baginda bersabda, \"Lebihkan lagi.\" Lalu aku menambahkan lagi. Sejak itu, aku sentiasa berusaha untuk memastikan panjang kain itu tepat. Ada yang bertanya: Sampai sejauh mana? Jawab Baginda: \"Sampai separuh betis.\"",
        "arabic_text": "عَن ابنِ عمَرِ قَالَ: مَرَرْتُ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي إِزَارِي اسْتِرْخَاءٌ فَقَالَ: «يَا عَبْدَ اللَّهِ ارْفَعْ إِزَارَكَ» فَرَفَعْتُهُ ثُمَّ قَالَ: «زِدْ» فَزِدْتُ فَمَا زِلْتُ أَتَحَرَّاهَا بَعْدُ فَقَالَ: بَعْضُ الْقَوْمِ: إِلَى أَيْنَ؟ قَالَ: «إِلَى أَنْصَافِ السَّاقَيْنِ» . رَوَاهُ مُسلم"
      },
      {
        "id": 33063,
        "hadith_number": "4369",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mengheret Pakaian Kerana Sombong",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada beliau (Abu Bakar RA), Nabi SAW bersabda: “Sesiapa yang mengheret pakaiannya kerana sombong, Allah tidak akan memandangnya pada hari kiamat.” Abu Bakar berkata: “Wahai Rasulullah, izarku (kain bawah) cenderung melorot kecuali jika aku menjaganya.” Rasulullah SAW bersabda kepadanya: “Sesungguhnya engkau bukanlah daripada kalangan orang yang melakukannya kerana sombong.” Riwayat al-Bukhari.",
        "arabic_text": "وَعَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ جَرَّ ثَوْبَهُ خُيَلَاءَ لَمْ يَنْظُرِ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ» . فَقَالَ أَبُو بَكْرٍ: يَا رَسُولَ اللَّهِ إِزَارِي يَسْتَرْخِي إِلَّا أَنْ أَتَعَاهَدَهُ. فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّكَ لَسْتَ مِمَّنْ يَفْعَلُهُ خُيَلَاءَ» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 33064,
        "hadith_number": "4370",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Cara Penggunaan Izar Nabi SAW",
        "perawi_melayu": "Ikrima",
        "english_text": "From 'Ikrima, he said: I saw Ibn 'Abbas wearing an izar and placing the edge of his izar from the front on his foot, raising it from behind. I said, \"Why do you wear this izar in this manner?\" He said, \"I saw the Messenger of Allah (peace and blessings be upon him) wearing it like this.\"  Narrated by Abu Dawud",
        "malay_translation": "Daripada 'Ikrima, beliau berkata: Aku melihat Ibn 'Abbas memakai izar dan meletakkan tepi izarnya dari bahagian hadapan di atas kakinya, dan mengangkatnya dari belakang. Aku bertanya, \"Mengapa engkau memakai izar sebegini?\" Beliau menjawab, \"Aku melihat Rasulullah SAW memakai izar sedemikian.\" Diriwayatkan oleh Abu Dawud",
        "arabic_text": "وَعَن عِكْرِمَة قَالَ: رأيتُ ابنَ عَبَّاس يَأْتَزِرُ فَيَضَعُ حَاشِيَةَ إِزَارِهِ مِنْ مُقَدَّمِهِ عَلَى ظَهْرِ قَدَمِهِ وَيَرْفَعُ مِنْ مُؤَخَّرِهِ قُلْتُ لِمَ تَأْتَزِرُ هَذِهِ الْإِزْرَةَ؟ قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يأتزرها. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33065,
        "hadith_number": "4371",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Memakai Serban sebagai Ciri Malaikat",
        "perawi_melayu": "Ubadah bin As-Samit",
        "english_text": "From Ubadah ibn As-Samit, may Allah be pleased with him, he said: The Messenger of Allah, peace be upon him, said: \"Be adorned with serban, for indeed they are the mark of the angels, and their brothers are behind you.\"",
        "malay_translation": "Daripada Ubadah bin As-Samit, semoga Allah meridainya, beliau berkata: Rasulullah SAW bersabda: \"Hendaklah kamu memakai serban, kerana sesungguhnya ia adalah tanda pengenalan malaikat, dan saudara-mara mereka ada di belakang kamu.\"",
        "arabic_text": "وَعَنْ عُبَادَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «عَلَيْكُمْ بالعمائم فَإِنَّهَا سيماء الْمَلَائِكَة وأخوها خلف ظهوركم» . رَوَاهُ الْبَيْهَقِيّ"
      },
      {
        "id": 33066,
        "hadith_number": "4372",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mendedahkan Tubuh Wanita Setelah Baligh",
        "perawi_melayu": "Aishah",
        "english_text": "Daripada Aisyah, bahawa Asma' binti Abi Bakar masuk menemui Rasulullah SAW, sedang memakai pakaian yang nipis. Baginda berpaling daripadanya dan bersabda: \"Wahai Asma', sesungguhnya apabila seorang wanita mencapai baligh, tidak sepatutnya terlihat daripada dirinya melainkan ini dan ini.\"  Baginda menunjuk wajah dan kedua telapak tangannya.",
        "malay_translation": "Daripada Aisyah رضي الله عنها, bahawa Asma' binti Abi Bakar masuk menemui Rasulullah SAW sedang memakai pakaian yang nipis. Baginda berpaling daripadanya dan bersabda, \"Wahai Asma', sesungguhnya apabila seorang wanita mencapai baligh, tidaklah elok jika dilihat melainkan bahagian ini dan ini.\" Baginda menunjuk wajah dan kedua telapak tangannya.  Hadis ini diriwayatkan oleh Imam Abu Daud.",
        "arabic_text": "وَعَنْ عَائِشَةَ أَنَّ أَسْمَاءَ بِنْتَ أَبِي بَكْرٍ دَخَلْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهَا ثِيَاب رقاق فَأَعْرض عَنهُ وَقَالَ: «يَا أَسْمَاءُ إِنَّ الْمَرْأَةَ إِذَا بَلَغَتِ الْمَحِيضَ لَنْ يَصْلُحَ أَنْ يُرَى مِنْهَا إِلَّا هَذَا وَهَذَا» . وَأَشَارَ إِلَى وَجْهِهِ وَكَفَّيْهِ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33067,
        "hadith_number": "4373",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Membeli Baju dan Mensyukuri Rezeki Allah",
        "perawi_melayu": "Abi Mathar",
        "english_text": "And from Abi Mathar, he said: Ali purchased a garment for three dirhams.  When he wore it, he said, \"Praise be to Allah, who provided me from among the finest garments with which I adorn myself amongst the people and cover my private parts.\" Then he said, \"Thus, I heard the Messenger of Allah, peace and blessings be upon him, say.\" Ahmad reported it.",
        "malay_translation": "Dan daripada Abi Mathar, beliau berkata: Ali membeli sehelai pakaian dengan tiga dirham.  Apabila beliau memakainya, beliau berkata, \"Segala puji bagi Allah yang telah memberiku pakaian yang terbaik untuk aku berhias di hadapan manusia dan menutup auratku.\" Kemudian beliau berkata, \"Begitulah yang aku dengar Rasulullah SAW bersabda.\" Ahmad meriwayatkannya.",
        "arabic_text": "وَعَنْ أَبِي مَطَرٍ قَالَ: إِنْ عَلِيًّا اشْتَرَى ثَوْبًا بِثَلَاثَةِ دَرَاهِمَ فَلَمَّا لَبِسَهُ قَالَ: «الْحَمْدُ لِلَّهِ الَّذِي رَزَقَنِي مِنَ الرِّيَاشِ مَا أَتَجَمَّلُ بِهِ فِي الناسِ وأُواري بِهِ عورتي» ثُمَّ قَالَ: هَكَذَا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُول. رَوَاهُ أَحْمد"
      },
      {
        "id": 33068,
        "hadith_number": "4374",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Memakai Pakaian Baru dan Bersedekah dengan Pakaian Lama",
        "perawi_melayu": "Diriwayatkan dari Abu Umamah RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Umamah RA, beliau berkata: Umar bin al-Khattab RA memakai pakaian baru, lalu beliau berkata: 'Segala puji bagi Allah yang telah memakaikan aku dengan pakaian yang dengannya aku menutup auratku dan aku berhias dengannya dalam kehidupanku.' Kemudian beliau berkata: 'Aku mendengar Rasulullah SAW bersabda: 'Barangsiapa yang memakai pakaian baru lalu berkata: 'Segala puji bagi Allah yang telah memakaikan aku dengan pakaian yang dengannya aku menutup auratku dan aku berhias dengannya dalam kehidupanku,' kemudian dia menuju kepada pakaian yang telah usang lalu bersedekah dengannya, maka dia berada dalam perlindungan Allah, dalam penjagaan Allah, dan dalam lindungan Allah, hidup dan mati.' Riwayat Ahmad, Tirmizi, dan Ibnu Majah. Tirmizi berkata: 'Hadith ini adalah hadith gharib (asing).'",
        "arabic_text": "وَعَن أبي أُمامةَ قَالَ: لَبِسَ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ ثَوْبًا جَدِيدًا فَقَالَ: الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي مَا أُوَارِي بِهِ عَوْرَتِي وَأَتَجَمَّلُ بِهِ فِي حَيَاتِي ثُمَّ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: مَنْ لَبِسَ ثَوْبًا جَدِيدًا فَقَالَ: الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي مَا أُوَارِي بِهِ عَوْرَتِي وَأَتَجَمَّلُ بِهِ فِي حَيَاتِي ثُمَّ عَمَدَ إِلَى الثَّوْبِ الَّذِي أَخْلَقَ فَتَصَدَّقَ بِهِ كَانَ فِي كَنَفِ اللَّهِ وَفِي حِفْظِ اللَّهِ وَفِي سِتْرِ اللَّهِ حَيًّا وَمَيِّتًا . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيبٌ"
      },
      {
        "id": 33069,
        "hadith_number": "4375",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hati-hati dalam Memakai Pakaian Wanita",
        "perawi_melayu": "Dari 'Alqamah bin Abi 'Alqamah daripada ibunya, dia berkata:",
        "english_text": "From 'Alqamah ibn Abi 'Alqamah from his mother, she said: Hafsah binti Abdurrahman entered 'Aishah's house, and she was wearing a thin headscarf. 'Aishah tore it off and gave her a thick one. Malik reported it.",
        "malay_translation": "Daripada 'Alqamah bin Abi 'Alqamah daripada ibunya, dia berkata: Hafsah binti Abdurrahman masuk ke rumah 'Aisyah, dan dia memakai tudung yang nipis. 'Aisyah mencabutnya dan memberikannya tudung yang tebal. Malik meriwayatkannya.",
        "arabic_text": "وَعَنْ عَلْقَمَةَ بْنِ أَبِي عَلْقَمَةَ عَنْ أُمِّهِ قَالَتْ: دَخَلَتْ حَفْصَةُ بِنْتُ عَبْدِ الرَّحْمَنِ عَلَى عَائِشَةَ وَعَلَيْهَا خِمَارٌ رَقِيقٌ فَشَقَّتْهُ عَائِشَةُ وَكَسَتْهَا خمارا كثيفا. رَوَاهُ مَالك"
      },
      {
        "id": 33070,
        "hadith_number": "4376",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Wanita Yang Berpakaian Dengan Baik Dan Mengutamakan Kebersihan",
        "perawi_melayu": "Abdul Wahid bin Ayman daripada bapanya",
        "english_text": "And from Abdul Wahid bin Ayman from his father, he said: Aishah entered wearing a Qitri armor with a price of five dirhams. She said: Raise your gaze to my maidservant and look at her, for indeed she wishes to wear it in the house. And I had an armor from her during the time of Rasulullah SAW.  So no woman in Madinah would be properly attired unless she sent to me to borrow it.  Narrated by Al-Bukhari.",
        "malay_translation": "Daripada Abdul Wahid bin Ayman daripada bapanya, beliau berkata: 'Aishah masuk ke dalam rumah dengan memakai baju besi Qitri yang berharga lima dirham.  Beliau berkata: \"Tinggikan pandangan anda kepada hamba perempuan saya dan perhatikan dia, kerana sesungguhnya dia ingin memakainya di dalam rumah. Dan aku telah memiliki baju besi daripada dirinya semasa zaman Rasulullah SAW. Maka tiada seorang wanita pun di Madinah yang ingin berpakaian dengan sempurna melainkan dia menghantar mesej kepadaku untuk meminjamnya.\" Diriwayatkan oleh Al-Bukhari.",
        "arabic_text": "وَعَنْ عَبْدِ الْوَاحِدِ بْنِ أَيْمَنَ عَنْ أَبِيهِ قَالَ: دَخَلَتْ عَلَى عَائِشَةَ وَعَلَيْهَا دِرْعٌ قِطْرِيٌّ ثَمَنُ خَمْسَةِ دَرَاهِمَ فَقَالَتْ: ارْفَعْ بَصَرَكَ إِلَى جَارِيَتِي انْظُرْ إِلَيْهَا فَإِنَّهَا تُزْهَى أَنْ تَلْبَسَهُ فِي البيتِ وَقد كَانَ لِي مِنْهَا دِرْعٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَا كَانَتِ امْرَأَةٌ تُقَيَّنُ بِالْمَدِينَةِ إِلَّا أَرْسَلَتْ إِلَيَّ تَسْتَعِيرُهُ. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 33071,
        "hadith_number": "4377",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Memberi Jubah Sutera kepada Umar RA untuk Dijual",
        "perawi_melayu": "Tidak tersedia",
        "english_text": "Not Available",
        "malay_translation": "Daripada Jabir RA, beliau berkata: Rasulullah SAW memakai pada suatu hari jubah sutera yang dihadiahkan kepada baginda. Kemudian baginda segera menanggalkannya dan menghantarnya kepada Umar RA. Lalu dikatakan: Engkau begitu cepat menanggalkannya, wahai Rasulullah SAW! Baginda bersabda: \"Jibril telah melarangku daripadanya.\" Kemudian Umar RA datang sambil menangis dan berkata: Wahai Rasulullah, engkau tidak menyukai sesuatu perkara tetapi engkau memberikannya kepadaku, maka apakah bagiku? Baginda bersabda: \"Sesungguhnya aku tidak memberikannya kepadamu untuk engkau memakainya, aku memberikannya kepadamu untuk engkau menjualnya.\" Lalu Umar RA menjualnya dengan harga dua ribu dirham. (Riwayat Muslim)",
        "arabic_text": "وَعَنْ جَابِرٍ قَالَ: لَبِسَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا قَبَاءَ دِيبَاجٍ أُهْدِيَ لَهُ ثُمَّ أَوْشَكَ أَنْ نَزَعَهُ فَأَرْسَلَ بِهِ إِلَى عُمَرَ فَقِيلَ: قَدْ أَوْشَكَ مَا انْتَزَعْتَهُ يَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «نهاني عَنهُ جبريلُ» فَجَاءَ عُمَرُ يَبْكِي فَقَالَ: يَا رَسُولَ اللَّهِ كرهتَ أَمْرًا وَأَعْطَيْتَنِيهِ فَمَا لِي؟ فَقَالَ: «إِنِّي لَمْ أُعْطِكَهُ تَلْبَسُهُ إِنَّمَا أَعْطَيْتُكَهُ تَبِيعُهُ» . فَبَاعَهُ بِأَلْفَيْ دِرْهَم. رَوَاهُ مُسلم"
      },
      {
        "id": 33072,
        "hadith_number": "4378",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Rasulullah SAW Mengenai Baju Sutera yang Tebal",
        "perawi_melayu": "Ibnu Abbas R.A.",
        "english_text": "Dari Ibnu Abbas RA, beliau berkata: Sesungguhnya Rasulullah SAW melarang memakai pakaian sutera yang tebal. Tetapi, bendera dan bahagian tepi pakaian yang lain, tidak mengapa.",
        "malay_translation": "Daripada Ibnu Abbas RA, beliau berkata: Sesungguhnya Rasulullah SAW telah melarang memakai pakaian sutera yang tebal.  Tetapi, penggunaan bendera dan bahagian tepi pakaian yang lain adalah dibolehkan.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: إِنَّمَا نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ثَوْبِ الْمُصْمَتِ مِنَ الْحَرِيرِ فَأَمَّا الْعَلَمُ وَسَدَى الثَّوْبِ فَلَا بَأْسَ بِهِ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33073,
        "hadith_number": "4379",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menampakkan Nikmat Allah ke atas Hamba-Nya",
        "perawi_melayu": "Diriwayatkan daripada Abu Raja':",
        "english_text": "Not Available",
        "malay_translation": "Diriwayatkan daripada Abu Raja', beliau berkata: Imran bin Husain keluar menemui kami dengan memakai mantel daripada sutera. Beliau berkata: Sesungguhnya Rasulullah SAW bersabda: 'Sesiapa yang Allah berikan nikmat kepadanya, maka sesungguhnya Allah suka untuk melihat kesan nikmat-Nya itu pada hamba-Nya.' (Riwayat Ahmad)",
        "arabic_text": "وَعَنْ أَبِي رَجَاءٍ قَالَ: خَرَجَ عَلَيْنَا عِمْرَانُ بْنُ حُصَيْنٍ وَعَلَيْهِ مِطْرَفٌ مِنْ خَزٍّ وَقَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَنْعَمَ اللَّهُ عَلَيْهِ نِعْمَةً فَإِنَّ اللَّهَ يُحِبُّ أَنْ يَرَى أَثَرَ نِعْمَتِهِ عَلَى عَبده» . رَوَاهُ أَحْمد"
      },
      {
        "id": 33074,
        "hadith_number": "4380",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kebebasan dalam Kehidupan Harian: Hadis  mengenai Perbelanjaan dan Pakaian",
        "perawi_melayu": "Ibn Abbas رضي الله عنهما",
        "english_text": "And from Ibn 'Abbas رضي الله عنهما, he said: Consume whatever you desire and wear whatever you desire; only two things will not be forgiven to you: extravagance and vanity.  Narrated by al-Bukhari in the chapter on...",
        "malay_translation": "Dan daripada Ibn 'Abbas رضي الله عنهما, baginda berkata: Makanlah apa yang kamu mahu dan pakailah apa yang kamu mahu; hanya dua perkara yang tidak akan diampunkan kepadamu: pembaziran dan riya'. Diriwayatkan oleh al-Bukhari dalam bab...",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: كُلْ مَا شِئْتَ وَالْبَسْ مَا شِئْتَ مَا أَخْطَأَتْكَ اثْنَتَانِ: سَرَفٌ وَمَخِيلَةٌ. رَوَاهُ الْبُخَارِيُّ فِي تَرْجَمَة بَاب"
      },
      {
        "id": 33075,
        "hadith_number": "4381",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Makan, Minum, Bersedekah, dan Memakai Dengan Tidak Berlebih-lebihan",
        "perawi_melayu": "Amru bin Syu'aib daripada bapanya daripada datuknya, berkata:",
        "english_text": "Daripada Amru bin Syu'aib daripada bapanya daripada datuknya, beliau berkata: Rasulullah SAW bersabda, \"Makanlah dan minumlah, dan bersedekahlah, dan pakailah apa sahaja yang tidak mengandungi pembaziran dan kemewahan yang melampau.\"",
        "malay_translation": "Daripada Amru bin Syu’aib daripada bapanya daripada datuknya, beliau berkata: Rasulullah SAW bersabda, \"Makan dan minumlah, dan bersedekahlah, dan pakailah apa sahaja yang tidak disertai dengan pembaziran dan kemewahan yang melampau.\" Diriwayatkan oleh Imam Ahmad dan al-Nasa'i dan Ibn Majah.",
        "arabic_text": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كُلُوا وَاشْرَبُوا وَتَصَدَّقُوا وَالْبَسُوا مَا لم يُخالطْ إِسْرَافٌ وَلَا مَخِيلَةٌ» . رَوَاهُ أَحْمَدُ وَالنَّسَائِيُّ وَابْنُ مَاجَه"
      },
      {
        "id": 33076,
        "hadith_number": "4382",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Mengunjungi Kubur dan Masjid",
        "perawi_melayu": "Abu Darda",
        "english_text": "From Abu Darda, he said: The Messenger of Allah (peace and blessings be upon him) said: \"Indeed, the best of what you visit Allah in is your graves and your mosques [that are] white.\"  Narrated by Ibn Majah",
        "malay_translation": "Daripada Abu Darda, beliau berkata: Rasulullah SAW bersabda: \"Sesungguhnya sebaik-baik kunjungan kamu kepada Allah di dalam kubur dan masjid kamu ialah yang berwarna putih.\"  Riwayat Ibn Majah",
        "arabic_text": "وَعَنْ أَبِي الدَّرْدَاءِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَحْسَنَ مَا زُرْتُمُ اللَّهَ فِي قُبُورِكُمْ وَمَسَاجِدِكُمُ الْبَيَاضُ» . رَوَاهُ ابْن مَاجَه"
      },
      {
        "id": 33077,
        "hadith_number": "4383",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penggunaan Khātam oleh Nabi SAW dan Larangan Meniru",
        "perawi_melayu": "Ibnu Umar RA",
        "english_text": "Daripada Ibnu Umar RA, baginda berkata: Nabi SAW memakai khātam daripada emas. Dalam satu riwayat, baginda meletakkannya di tangan kanan, kemudian membuangnya. Kemudian baginda memakai khātam daripada kayu/bahan lain, dengan tulisan bertulis: Muhammad Rasulullah. Baginda bersabda: \"Janganlah sesiapa meniru tulisan pada khātamku ini\". Dan apabila baginda memakainya, baginda akan meletakkan bahagian ukirannya pada bahagian dalam telapak tangan.",
        "malay_translation": "Daripada Ibnu Umar RA, baginda berkata: Nabi SAW memakai khātam daripada emas. Dalam satu riwayat, baginda meletakkannya di tangan kanan, kemudian membuangnya. Kemudian baginda memakai khātam daripada bahan lain, dengan tulisan bertulis: Muhammad Rasulullah. Baginda bersabda: \"Janganlah sesiapa meniru tulisan pada khātamku ini\". Dan apabila baginda memakainya, baginda akan meletakkan bahagian ukirannya pada bahagian dalam telapak tangan.",
        "arabic_text": "عَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: اتَّخَذَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَاتَمًا مِنْ ذَهَبٍ وَفِي رِوَايَةٍ: وَجَعَلَهُ فِي يَدِهِ الْيُمْنَى ثُمَّ أَلْقَاهُ ثُمَّ اتَّخَذَ خَاتَمًا مِنْ الْوَرق نُقِشَ فِيهِ: مُحَمَّدٌ رَسُولُ اللَّهِ وَقَالَ: «لَا يَنْقُشَنَّ أَحَدٌ عَلَى نَقْشِ خَاتَمِي هَذَا» . وَكَانَ إِذَا لَبِسَهُ جَعَلَ فَصَّهُ مِمَّا يَلِي بَطْنَ كَفه"
      },
      {
        "id": 33078,
        "hadith_number": "4384",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Memakai Kain Khas dan Perhiasan Emas, Serta Membaca Al-Quran dalam Ruku' ",
        "perawi_melayu": "Ali",
        "english_text": "From Ali, it is reported that the Messenger of Allah (peace and blessings be upon him) forbade wearing coarse cloth, yellow garment, using gold rings, and reciting the Qur'an during the rukū' posture. Narrated by Muslim.",
        "malay_translation": "Daripada Ali, diriwayatkan bahawa Rasulullah SAW melarang memakai kain kasar, pakaian kuning, menggunakan cincin emas, dan membaca Al-Quran ketika dalam ruku'.  Riwayat Muslim.",
        "arabic_text": "وَعَنْ عَلِيٍّ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لُبْسِ الْقَسِّيِّ وَالْمُعَصْفَرِ وَعَنْ تَخْتُّمِ الذَّهَبِ وَعَنْ قِرَاءَةِ الْقُرْآنِ فِي الرُّكُوعِ. رَوَاهُ مُسلم"
      },
      {
        "id": 33079,
        "hadith_number": "4385",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Memakai Cincin Emas Bagi Lelaki",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abdullah bin Abbas RA bahawa Rasulullah SAW melihat cincin emas di tangan seorang lelaki. Baginda SAW menariknya lalu membuangnya dan bersabda: \"Adakah seseorang kamu sengaja mengambil bara api neraka lalu meletakkannya di tangannya?\" Kemudian dikatakan kepada lelaki itu setelah Rasulullah SAW pergi: \"Ambillah cincinmu, manfaatkanlah ia.\" Lelaki itu berkata: \"Tidak, demi Allah, aku tidak akan mengambilnya selama-lamanya kerana Rasulullah SAW telah membuangnya.\" (Riwayat Muslim)",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى خَاتَمًا مِنْ ذَهَبٍ فِي يَدِ رَجُلٍ فَنَزَعَهُ فَطَرَحَهُ فَقَالَ: «يَعْمِدُ أَحَدُكُمْ إِلَى جَمْرَةٍ مِنْ نَارٍ فَيَجْعَلُهَا فِي يَدِهِ؟» فَقِيلَ لِلرَّجُلِ بَعْدَمَا ذَهَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: خُذْ خَاتَمَكَ انْتَفِعْ بِهِ. قَالَ: لَا وَاللَّهِ لَا آخُذُهُ أَبَدًا وَقَدْ طَرَحَهُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. رَوَاهُ مُسلم"
      },
      {
        "id": 33080,
        "hadith_number": "4386",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi Muhammad SAW Membuat Cincin Mohor untuk Surat kepada Para Raja",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Anas RA, bahawa Nabi SAW ingin menulis surat kepada Kisra, Kaisar, dan Najasyi, maka dikatakan kepada baginda: Sesungguhnya mereka tidak menerima surat kecuali dengan mohor. Lalu Rasulullah SAW membuat cincin, lingkaran perak, terukir padanya: Muhammad Rasulullah. (Riwayat Muslim). Dalam riwayat al-Bukhari: Ukiran pada cincin itu tiga baris: Muhammad satu baris, Rasul Allah satu baris, dan Allah satu baris.",
        "arabic_text": "وَعَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرَادَ أَنْ يَكْتُبَ إِلَى كِسْرَى وَقَيْصَرَ وَالنَّجَاشِيِّ فَقِيلَ: إِنَّهُمْ لَا يَقْبَلُونَ كِتَابًا إِلَّا بِخَاتَمٍ فَصَاغَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَاتَمًا حَلْقَةَ فِضَّةٍ نُقِشَ فِيهِ: مُحَمَّدٌ رَسُولُ اللَّهِ. رَوَاهُ مُسْلِمٌ. وَفِي رِوَايَةٍ لِلْبُخَارِيِّ: كَانَ نَقْشُ الْخَاتَمِ ثَلَاثَةَ أَسْطُرٍ: مُحَمَّدٌ سَطْرٌ ورسولُ الله سطر وَالله سطر"
      },
      {
        "id": 33081,
        "hadith_number": "4387",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keistimewaan Khātam Nabi SAW yang diperbuat dari Perak",
        "perawi_melayu": null,
        "english_text": "Daripada baginda, bahawa Nabi Allah SAW mempunyai khātam daripada perak, dan batu permata padanya. Diriwayatkan oleh al-Bukhari.",
        "malay_translation": "Daripadanya, bahawa Nabi Allah SAW mempunyai khātam daripada perak, dan batu permata padanya. Diriwayatkan oleh al-Bukhari.",
        "arabic_text": "وَعَنْهُ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ خَاتَمُهُ مِنْ فِضَّةٍ وَكَانَ فَصُّهُ مِنْهُ. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 33082,
        "hadith_number": "4388",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kegunaan Cincin Perak Rasulullah SAW",
        "perawi_melayu": null,
        "english_text": "Daripadanya, bahawa Rasulullah SAW memakai cincin perak di tangan kanannya, yang mempunyai batu permata Habsyi yang diletakkan mengikut kedudukan yang dekat dengan telapak tangan.",
        "malay_translation": "Daripadanya, bahawa Rasulullah SAW memakai cincin perak di tangan kanannya, yang mempunyai batu permata Habsyi diletakkan berdekatan dengan telapak tangan. ",
        "arabic_text": "وَعَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَبِسَ خَاتَمَ فِضَّةٍ فِي يَمِينِهِ فِيهِ فَصٌّ حَبَشِيٌّ كَانَ يَجْعَلُ فَصَّهُ مِمَّا يَلِي كَفه"
      },
      {
        "id": 33083,
        "hadith_number": "4389",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan dan Ciri-ciri Cincin Nabi SAW",
        "perawi_melayu": null,
        "english_text": "And from him he said: The ring of the Prophet SAW was on this, and he pointed to the ring finger of his left hand. Muslim narrated it.",
        "malay_translation": "Dan daripada beliau, beliau berkata: Cincin Nabi SAW berada pada yang ini, dan beliau menunjuk pada jari manis tangan kirinya. Muslim meriwayatkannya.",
        "arabic_text": "وَعَنْهُ قَالَ: كَانَ خَاتَمُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذِهِ وَأَشَارَ إِلَى الْخِنْصِرِ منْ يَده الْيُسْرَى. رَوَاهُ مُسلم"
      },
      {
        "id": 33084,
        "hadith_number": "4390",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menggunakan Cincin di Jari Tertentu",
        "perawi_melayu": "Ali r.a.",
        "english_text": "And from Ali r.a., he said: The Messenger of Allah (peace and blessings be upon him) forbade me from wearing a ring on this finger or that finger. He gestured towards the middle finger and the one next to it. Muslim narrated it.",
        "malay_translation": "Dan daripada Ali r.a., beliau berkata: Rasulullah SAW melarangku daripada memakai cincin di jari ini atau jari itu. Baginda memberi isyarat kepada jari tengah dan jari yang bersebelahan dengannya. Muslim meriwayatkannya.",
        "arabic_text": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: نَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم إِن أَتَخَتَّمَ فِي إِصْبَعِي هَذِهِ أَوْ هَذِهِ قَالَ: فَأَوْمَأَ إِلَى الْوُسْطَى وَالَّتِي تَلِيهَا. رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 33085,
        "hadith_number": "4391",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi SAW Menggunakan Cincin di Tangan Kanan",
        "perawi_melayu": "Abdul Rahman bin Ja'far",
        "english_text": "Daripada Abdullah bin Ja'far, dia berkata: Nabi SAW gemar memakai cincin di tangan kanan. Diriwayatkan oleh Ibnu Majah.",
        "malay_translation": "Daripada Abdullah bin Ja'far, dia berkata: Nabi SAW gemar memakai cincin di tangan kanannya.  Hadis ini diriwayatkan oleh Ibnu Majah.",
        "arabic_text": "عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَخَتَّمُ فِي يَمِينه. رَوَاهُ ابْن مَاجَه"
      },
      {
        "id": 33086,
        "hadith_number": "4392",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis Sahih:  Perawi Berkata tentang Ali",
        "perawi_melayu": "Abu Daud dan an-Nasa'i",
        "english_text": "Hadis tersebut diriwayatkan oleh Abu Daud dan an-Nasa'i dari Ali.",
        "malay_translation": "Hadis ini diriwayatkan oleh Imam Abu Daud dan Imam an-Nasa'i daripada Ali.",
        "arabic_text": "وَرَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ عَن عَليّ"
      },
      {
        "id": 33087,
        "hadith_number": "4393",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi SAW Menggunakan Khitan di Tangan Kiri",
        "perawi_melayu": "Ibn Umar",
        "english_text": "Daripada Ibn Umar, dia berkata: Nabi SAW menggunakan khitan di tangan kirinya. Diriwayatkan oleh Abu Daud.",
        "malay_translation": "Daripada Ibn Umar, beliau berkata, \"Nabi SAW gemar menggunakan khitan di tangan kirinya.\"  Hadis ini diriwayatkan oleh Imam Abu Daud.",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يتختم فِي يسَاره. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33088,
        "hadith_number": "4394",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menggunakan Sutera dan Emas Bagi Lelaki dalam Ummah",
        "perawi_melayu": "Ali bin Abi Talib R.A.",
        "english_text": "Daripada Ali R.A., bahawa Nabi SAW mengambil sutera dan meletakkannya di sebelah kananNya, dan mengambil emas dan meletakkannya di sebelah kiriNya, kemudian baginda bersabda: \"Sesungguhnya kedua-duanya (sutera dan emas) adalah haram bagi lelaki dalam umatku.\"",
        "malay_translation": "Daripada Ali bin Abi Talib r.a., bahawa Rasulullah SAW mengambil sutera dan meletakkannya di sebelah kanan baginda, dan mengambil emas dan meletakkannya di sebelah kiri baginda. Kemudian baginda bersabda, \"Sesungguhnya kedua-duanya, sutera dan emas, adalah haram bagi lelaki dalam umatku.\".  Riwayat Ahmad, Abu Dawud dan al-Nasa'i.",
        "arabic_text": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَ حَرِيرًا فَجَعَلَهُ فِي يَمِينِهِ وَأَخَذَ ذَهَبًا فَجَعَلَهُ فِي شِمَالِهِ ثُمَّ قَالَ: «إِنَّ هَذَيْنِ حَرَامٌ عَلَى ذُكُورِ أُمتي» . رَوَاهُ أَحْمد وَأَبُو دَاوُد وَالنَّسَائِيّ"
      },
      {
        "id": 33089,
        "hadith_number": "4395",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menunggang Harimau dan Memakai Emas",
        "perawi_melayu": "Mu'awiyah",
        "english_text": "Daripada Mu'awiyah, bahawa Rasulullah SAW telah melarang menunggang harimau dan memakai emas kecuali yang dipotong-potong.",
        "malay_translation": "Daripada Mu'awiyah, bahawa Rasulullah SAW telah melarang menunggang harimau dan memakai emas melainkan yang dipotong-potong.  Riwayat ini terdapat dalam kitab Imam Abu Daud dan Imam An-Nasa'i.",
        "arabic_text": "وَعَن مُعَاوِيَةُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ رُكُوبِ النُّمُورِ وَعَنْ لُبْسِ الذَّهَبِ إِلَّا مُقَطَّعًا. رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ"
      },
      {
        "id": 33090,
        "hadith_number": "4396",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Memakai Perhiasan Sesuatu Yang Merugikan",
        "perawi_melayu": null,
        "english_text": "And it was narrated by Buraidah that the Prophet, sallallahu alaihi wa sallam, said to a man who was wearing a ring made of something similar to idols: \"Why do I find the scent of idols from you?\" Then he removed it.  Then the man came wearing a ring made of iron, so he said: \"Why do I see the adornment of the people of the Fire on you?\"  Then he removed it. Then the man said: O Messenger of Allah, from what should I take it? He said: \"From paper, and do not complete (its weight) even a mithqal.\"  Narrated by at-Tirmidhi, Abu Dawud, and an-Nasa'i.",
        "malay_translation": "Dan diriwayatkan oleh Buraidah bahawa Nabi saw bersabda kepada seorang lelaki yang memakai cincin yang menyerupai perhiasan berhala, \"Mengapa aku dapati bau berhala daripada engkau?\" Maka baginda menanggalkannya. Kemudian lelaki itu datang memakai cincin yang diperbuat daripada besi, lalu baginda bersabda: \"Mengapa aku lihat perhiasan ahli neraka pada engkau?\" Kemudian baginda menanggalkannya. Lalu lelaki itu berkata: Wahai Rasulullah, daripada apa saya harus mengambilnya? Baginda bersabda: \"Dari kertas, dan jangan sampai sama beratnya sekalipun satu mithqal.\" Diriwayatkan oleh at-Tirmidhi, Abu Dawud, dan an-Nasa'i.",
        "arabic_text": "وَعَنْ بُرَيْدَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِرَجُلٍ عَلَيْهِ خَاتَمٌ مِنْ شَبَهٍ: «مَا لِي أَجِدُ مِنْكَ رِيحَ الْأَصْنَامِ؟» فَطَرَحَهُ ثُمَّ جَاءَ وَعَلَيْهِ خَاتَمٌ مِنْ حَدِيدٍ فَقَالَ: «مَا لِي أَرَى عَلَيْكَ حِلْيَةَ أَهْلِ النَّارِ؟» فَطَرَحَهُ فَقَالَ: يَا رَسُولَ اللَّهِ مِنْ أَيِّ شَيْءٍ أَتَّخِذُهُ؟ قَالَ: «مِنْ وَرِقٍ وَلَا تُتِمَّهُ مِثْقَالا» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد وَالنَّسَائِيّ"
      },
      {
        "id": 33091,
        "hadith_number": "4397",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Nabi SAW Terhadap Sepuluh Perbuatan",
        "perawi_melayu": "Ibn Mas'ud",
        "english_text": "Daripada Ibn Mas'ud, beliau berkata: Nabi SAW membenci sepuluh perkara: warna kuning (maksudnya, buruk budi pekerti), mengubah uban, menarik butang baju, memakai cincin emas, berhias dengan perhiasan di tempat yang tidak sepatutnya, memukul dengan kayu, menggunakan jampi-jampi kecuali dengan ayat-ayat perlindungan, mengikat azimat, mengasingkan air untuk tujuan yang tidak dibenarkan, dan memusnahkan anak kecil tanpa sebab yang dibenarkan.",
        "malay_translation": "Daripada Ibn Mas'ūd, beliau berkata: Rasulullah SAW tidak menyukai sepuluh perkara: sifat buruk (maksudnya, buruk budi pekerti), mengubah warna rambut uban, menarik butang baju, memakai cincin emas, berhias dengan perhiasan pada tempat yang tidak sepatutnya, memukul dengan kayu, menggunakan jampi-jampi kecuali dengan ayat-ayat perlindungan, mengikat azimat, mengasingkan air tanpa sebab yang dibenarkan dan memusnahkan anak tanpa sebab yang dibenarkan.  Riwayat ini diriwayatkan oleh Imam Abu Daud dan Imam al-Nasa'i.",
        "arabic_text": "وَعَنِ ابْنِ مَسْعُودٍ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَكْرَهُ عَشْرَ خِلَالٍ: الصُّفْرَةَ يَعْنِي الخلوق وتغييرَ الشيب وجر الأزرار وَالتَّخَتُّمَ بِالذَّهَبِ وَالتَّبَرُّجَ بِالزِّينَةِ لِغَيْرِ مَحِلِّهَا وَالضَّرْبَ بِالْكِعَابِ وَالرُّقَى إِلَّا بِالْمُعَوِّذَاتِ وَعَقْدَ التَّمَائِمِ وَعَزْلَ الْمَاءِ لِغَيْرِ مَحِلِّهِ وَفَسَادَ الصَّبِيِّ غَيْرَ مُحَرِّمِهِ. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ"
      },
      {
        "id": 33092,
        "hadith_number": "4398",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menggunakan Lonceng pada Wanita",
        "perawi_melayu": "Ibn Zubair",
        "english_text": "Narrated by Ibn Zubair: A woman belonging to them took the daughter of Zubair to Umar ibn al-Khattab, and there were bells on her feet. Umar cut them off and said, \"I heard the Messenger of Allah (peace and blessings be upon him) say, 'With every bell is a devil.'\" Narrated by Abu Dawud.",
        "malay_translation": "Daripada Ibn Zubair: Seorang wanita yang berkhidmat kepada mereka membawa anak perempuan Zubair kepada Umar bin al-Khattab, dan terdapat loceng pada kakinya. Umar memotongnya dan berkata, \"Saya mendengar Rasulullah SAW bersabda, 'Bersama setiap loceng terdapat syaitan.'\" Diriwayatkan oleh Abu Dawud.",
        "arabic_text": "وَعَن ابنِ الزبيرِ: أَنَّ مَوْلَاةً لَهُمْ ذَهَبَتْ بِابْنَةِ الزُّبَيْرِ إِلَى عُمَرَ بْنِ الْخَطَّابِ وَفِي رِجْلِهَا أَجْرَاسٌ فَقَطَعَهَا عمر وَقَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَعَ كُلِّ جَرَسٍ شَيْطَانٌ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33093,
        "hadith_number": "4399",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Masuk Malaikat ke Rumah yang Mempunyai Lonceng",
        "perawi_melayu": "Bunanah, hamba perempuan kepada Abdurrahman bin Hayyan al-Ansari",
        "english_text": "And from Bunanah, a freedwoman of Abdurrahman bin Hayyan al-Ansari, who was with Aisyah (RA) when a slave girl was brought in, and she had anklets that made a sound. She said, \"Do not bring her to me unless you cut off her anklets.\" I heard the Messenger of Allah (peace and blessings be upon him) say, \"The angels do not enter a house that has bells.\"",
        "malay_translation": "Daripada Bunanah, bekas hamba perempuan kepada Abdurrahman bin Hayyan al-Ansari, yang berada di sisi Aisyah r.a. ketika seorang hamba perempuan dibawa masuk, dan dia memakai gelang kaki yang mengeluarkan bunyi.  Beliau berkata, \"Jangan bawa dia kepadaku melainkan jika kamu potong gelang kakinya.\" Aku mendengar Rasulullah SAW bersabda, \"Malaikat tidak masuk ke rumah yang ada loceng.\" ",
        "arabic_text": "وَعَنْ بُنَانَةَ مَوْلَاةِ عَبْدِ الرَّحْمَنِ بْنِ حَيَّانَ الْأنْصَارِيّ كانتْ عندَ عائشةَ إِذْ دُخِلَتْ عَلَيْهَا بِجَارِيَةٍ وَعَلَيْهَا جَلَاجِلُ يُصَوِّتْنَ فَقَالَتْ: لَا تُدْخِلُنَّهَا عَلَيَّ إِلَّا أَنْ تُقَطِّعُنَّ جَلَاجِلَهَا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا تَدْخُلُ الْمَلَائِكَةُ بَيْتًا فِيهِ أَجْرَاس» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33094,
        "hadith_number": "4400",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis Mengenai Penggantian Hidung dari Daun Menjadi Emas",
        "perawi_melayu": "Abd al-Rahman bin Tarfah",
        "english_text": "Daripada Abd al-Rahman bin Tarfah, bahawa datuknya, 'Arifja bin Asad, hidungnya dipotong pada hari Perang Kucing, lalu dia membuat hidung daripada kertas, namun ia reput. Maka, Rasulullah SAW memerintahkannya untuk membuat hidung daripada emas.",
        "malay_translation": "Daripada Abd al-Rahman bin Tarfah, bahawa datuknya, 'Arifja bin Asad, hidungnya telah dipotong pada hari Perang Kucing. Kemudian, dia membuat hidung daripada kertas, namun ia menjadi busuk. Maka, Nabi Muhammad SAW memerintahkannya untuk membuat hidung daripada emas.",
        "arabic_text": "وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ طَرَفَةَ أَنَّ جَدَّهُ عَرفجةَ بن أسعد قُطِعَ أَنْفُهُ يَوْمَ الْكُلَابِ فَاتَّخَذَ أَنْفًا مِنْ وَرِقٍ فَأَنْتَنَ عَلَيْهِ فَأَمَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَتَّخِذَ أَنْفًا مِنْ ذَهَبٍ. رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد وَالنَّسَائِيّ"
      },
      {
        "id": 33095,
        "hadith_number": "4401",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menunjukkan Keharusan Memberi Perhiasan Emas dan Perak sebagai Sebaliknya Perhiasan Neraka",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "And from Abu Hurairah that the Messenger of Allah, may Allah bless him and grant him peace, said: \"Whoever desires to shave his beloved with a ring of fire, let him shave him with a ring of gold. And whoever desires to encircle his beloved with a ring of fire, let him encircle him with a ring of gold. And whoever desires to adorn his beloved with a bracelet of fire, let him adorn him with a bracelet of gold. But rather, you should use silver. Decorate with it.\"",
        "malay_translation": "Daripada Abu Hurairah, bahawa Rasulullah SAW bersabda: “Sesiapa yang ingin mencukur kekasihnya dengan cincin api, maka hendaklah dia mencukur kekasihnya dengan cincin emas. Dan sesiapa yang ingin melingkari kekasihnya dengan gelang api, maka hendaklah dia melingkari kekasihnya dengan gelang emas. Dan sesiapa yang ingin menghiasi kekasihnya dengan gelang tangan api, maka hendaklah dia menghiasi kekasihnya dengan gelang tangan emas. Tetapi, gunakanlah perak. Hiasi dengannya.”",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَحَبَّ أَنْ يُحَلِّقَ حَبِيبَهُ حَلَقَةً مِنْ نَارٍ فَلْيُحَلِّقْهُ حَلَقَةً مِنْ ذَهَبٍ وَمَنْ أَحَبَّ أَنْ يُطَوِّقَ حَبِيبَهُ طَوْقًا مِنْ نَارٍ فَلْيُطَوِّقْهُ طَوْقًا مِنْ ذَهَبٍ وَمَنْ أَحَبَّ أَنْ يُسَوِّرَ حَبِيبَهُ سِوَارًا مِنْ نَار فليسوره مِنْ ذَهَبٍ وَلَكِنْ عَلَيْكُمْ بِالْفِضَّةِ فَالْعَبُوا بِهَا» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33096,
        "hadith_number": "4402",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Memakai Perhiasan Emas bagi Wanita yang Berlebihan",
        "perawi_melayu": "Tidak Dinyatakan",
        "english_text": "Not Available",
        "malay_translation": "Daripada Asma' binti Yazid RA, bahawa Rasulullah SAW bersabda: \"Mana-mana wanita yang memakai kalung emas, maka pada hari kiamat akan dikalungkan di lehernya kalung yang serupa dari api neraka. Dan mana-mana wanita yang memakai subang emas di telinganya, maka Allah akan meletakkan di telinganya subang yang serupa dari api neraka pada hari kiamat.\" (Riwayat Abu Daud dan An-Nasai).",
        "arabic_text": "وَعَن أَسْمَاءَ بِنْتِ يَزِيدَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَيُّمَا امْرَأَةٍ تَقَلَّدَتْ قِلَادَةً مِنْ ذَهَبٍ قُلِّدَتْ فِي عُنُقِهَا مِثْلُهَا مِنَ النَّارِ يَوْمَ الْقِيَامَةِ وَأَيُّمَا امْرَأَةٍ جَعَلَتْ فِي أُذُنِهَا خُرْصًا مِنْ ذَهَبٍ جَعَلَ اللَّهُ فِي أُذُنِهَا مِثْلَهُ مِنَ النَّارِ يَوْمَ الْقِيَامَةِ» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيّ"
      },
      {
        "id": 33097,
        "hadith_number": "4403",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Wanita Memakai Perhiasan Emas Yang Menampakkan",
        "perawi_melayu": "Daripada saudara perempuan Hudzaifah",
        "english_text": "And from a sister of Hudzaifah, that the Messenger of Allah, peace and blessings be upon him, said: \"O women, is there not silver amongst you that you adorn yourselves with? Indeed, none of you who adorns herself with gold that she shows will not be punished for it.\"",
        "malay_translation": "Dan daripada seorang saudara perempuan Hudzaifah, bahawa Rasulullah SAW bersabda: \"Wahai para wanita, bukankah ada perak di antara kamu yang kamu pakai untuk berhias? Sesungguhnya, tidak seorang pun dari kamu yang memakai emas untuk berhias yang ia tunjukkan selain akan dihukum disebabkan olehnya.\"",
        "arabic_text": "وَعَن أُخْت لِحُذَيْفَة أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَا مَعْشَرَ النِّسَاءِ أَمَا لَكُنَّ فِي الْفِضَّةِ مَا تُحَلَّيْنَ بِهِ؟ أَمَا إِنَّهُ لَيْسَ مِنْكُنَّ امْرَأَةٌ تُحَلَّى ذَهَبًا تُظْهِرُهُ إِلَّا عُذِّبَتْ بِهِ» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ"
      },
      {
        "id": 33098,
        "hadith_number": "4404",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Memakai Perhiasan dan Sutra Dunia sebagai Penyerupaan Perhiasan Syurga",
        "perawi_melayu": "Uqbah bin Amir",
        "english_text": "Daripada Uqbah bin Amir, bahawa Rasulullah SAW pernah melarang orang yang memakai perhiasan dan sutera. Baginda bersabda, \"Sekiranya kamu ingin mendapatkan perhiasan dan sutera Syurga, maka janganlah kamu memakainya di dunia ini.\"",
        "malay_translation": "Daripada Uqbah bin Amir, bahawa Rasulullah SAW pernah melarang orang yang memakai perhiasan dan sutera. Baginda bersabda, \"Sekiranya kamu ingin mendapatkan perhiasan dan sutera Syurga, maka janganlah kamu memakainya di dunia ini.\" Hadis ini diriwayatkan oleh al-Nasa'i.",
        "arabic_text": "عَنْ عُقْبَةَ بْنِ عَامِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كانَ يمنعُ أهلَ الْحِلْيَةَ وَالْحَرِيرَ وَيَقُولُ: «إِنْ كُنْتُمْ تُحِبُّونَ حِلْيَةَ الْجَنَّةِ وَحَرِيرَهَا فَلَا تَلْبَسُوهَا فِي الدُّنْيَا» . رَوَاهُ النَّسَائِيّ"
      },
      {
        "id": 33099,
        "hadith_number": "4405",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Menggunakan dan Melepas Sijil/Meterai",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "Narrated by Ibn Abbas that the Messenger of Allah (peace and blessings be upon him) adopted a ring, and wore it. He said, \"This has occupied me from you since today; a glance at it and a glance at you.\" Then he threw it away. Narrated by al-Nasa'i.",
        "malay_translation": "Daripada Ibnu Abbas RA, bahawa Rasulullah SAW telah memakai cincin. Baginda bersabda, \"Barangkali perkara ini telah menyebabkan aku tidak dapat memberi perhatian sepenuhnya kepada kamu sejak hari ini, iaitu antara melihat kepadanya dan melihat kepada kamu.\" Kemudian Baginda meletakkannya.  Riwayat al-Nasa'i.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اتَّخَذَ خَاتَمًا فَلَبِسَهُ قَالَ: «شَغَلَنِي هَذَا عَنْكُمْ مُنْذُ الْيَوْمَ إِلَيْهِ نَظْرَةٌ وإِليكم نظرة» ثمَّ أَلْقَاهُ. رَوَاهُ النَّسَائِيّ"
      },
      {
        "id": 33100,
        "hadith_number": "4406",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Memakai Perhiasan Emas untuk Lelaki",
        "perawi_melayu": null,
        "english_text": "And from Malik he said: I dislike the boys being adorned with gold, because it has reached me that the Messenger of Allah (peace and blessings be upon him) forbade the use of gold rings. So I dislike it for both the older and younger men. It was narrated in Al-Muwatta.",
        "malay_translation": "Dan daripada Malik, beliau berkata: Saya tidak suka kanak-kanak lelaki dihiasi dengan emas, kerana telah sampai kepada saya bahawa Rasulullah SAW melarang penggunaan cincin emas. Oleh itu, saya tidak suka ia dipakai oleh lelaki, sama ada tua atau muda. Ia diriwayatkan dalam Al-Muwatta.",
        "arabic_text": "وَعَن مَالك قَالَ: أَنا أكره ن يُلْبَسَ الْغِلْمَانُ شَيْئًا مِنَ الذَّهَبِ لِأَنَّهُ بَلَغَنِي أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نهى عَن التختمِ بالذهبِ فَأَنا أكره لِلرِّجَالِ الْكَبِيرِ مِنْهُمْ وَالصَّغِيرِ. رَوَاهُ فِي الْمُوَطَّأِ"
      },
      {
        "id": 33101,
        "hadith_number": "4407",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Memakai Kasut Tanpa Bulu",
        "perawi_melayu": "Ibn Umar",
        "english_text": "Daripada Ibn Umar, katanya: Aku melihat Rasulullah SAW memakai kasut yang tiada berbulu. Diriwayatkan oleh al-Bukhari.",
        "malay_translation": "Daripada Ibn Umar, katanya, \"Aku telah melihat Rasulullah SAW memakai kasut yang tidak berbulu.\" Diriwayatkan oleh al-Bukhari.",
        "arabic_text": "عَنِ ابْنِ عُمَرَ قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَلْبَسُ النِّعَالَ الَّتِي ليسَ فِيهَا شعرٌ. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 33102,
        "hadith_number": "4408",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Sandal Nabi Muhammad SAW Mempunyai Dua Tali",
        "perawi_melayu": "Diriwayatkan dari Anas RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Anas RA, beliau berkata: Sesungguhnya sandal Nabi SAW mempunyai dua tali.",
        "arabic_text": "وَعَنْ أَنَسٍ قَالَ: إِنَّ نَعْلَ النَّبِيِّ صَلَّى الله عَلَيْهِ وَسلم كَانَ لَهَا قبالان"
      },
      {
        "id": 33103,
        "hadith_number": "4409",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pentingnya Menggunakan Banyak Sepatu",
        "perawi_melayu": "Jabir",
        "english_text": "Daripada Jabir, dia berkata: Aku mendengar Rasulullah SAW dalam satu peperangan yang baginda sertai berkata, \"Banyakkanlah penggunaan kasut, kerana seseorang itu sentiasa menunggang (atau dalam perjalanan) selagi dia memakai kasut.\".  Riwayat Muslim.",
        "malay_translation": "Daripada Jabir, dia berkata: Aku mendengar Rasulullah SAW dalam satu peperangan yang baginda sertai bersabda, \"Banyakkanlah menggunakan kasut, kerana seseorang itu sentiasa dalam perjalanan (atau menunggang) selagi dia memakai kasut.\"  Riwayat Muslim.",
        "arabic_text": "وَعَنْ جَابِرٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةٍ غَزَاهَا يَقُولُ: «اسْتَكْثِرُوا مِنَ النِّعَالِ فَإِنَّ الرَّجُلَ لَا يَزَالُ رَاكِبًا مَا انتعَلَ» . رَوَاهُ مُسلم"
      },
      {
        "id": 33104,
        "hadith_number": "4410",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Petunjuk Mengenai Mengalas dan Menanggalkan Kasut",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Daripada Abu Hurairah, dia berkata: Rasulullah SAW bersabda: \"Apabila salah seorang daripada kamu hendak mengalas kasut, hendaklah dia mulakan dengan yang kanan, dan apabila menanggalkannya, hendaklah dia mulakan dengan yang kiri agar yang kanan menjadi yang pertama dialas dan yang terakhir ditanggalkan.\"",
        "malay_translation": "Daripada Abu Hurairah رضي الله عنه, dia berkata: Rasulullah SAW bersabda: \"Apabila salah seorang daripada kamu hendak memakai kasut, hendaklah dia mulakan dengan kaki kanan, dan apabila hendak menanggalkan kasut, hendaklah dia mulakan dengan kaki kiri agar kaki kanan itu menjadi yang pertama dipakaikan dan yang terakhir ditanggalkan.\" ",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا انْتَعَلَ أَحَدُكُمْ فَلْيَبْدَأْ بِالْيُمْنَى وَإِذَا نَزَعَ فَلْيَبْدَأْ بِالشِّمَالِ لِتَكُنِ الْيُمْنَى أَوَّلَهُمَا تُنْعَلُ وَآخِرَهُمَا تُنْزَعُ»"
      },
      {
        "id": 33105,
        "hadith_number": "4411",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Berjalan dengan Satu Kasut",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada beliau (Abu Hurairah R.A.), beliau berkata: Rasulullah SAW bersabda: “Janganlah salah seorang daripada kamu berjalan dengan hanya satu kasut, sama ada tanggalkan kedua-duanya atau pakailah kedua-duanya sekali.”",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَمْشِي أَحَدُكُمْ فِي نعلٍ واحدةٍ ليُحفيهُما جَمِيعًا أَو لينعلهما جَمِيعًا»"
      },
      {
        "id": 33106,
        "hadith_number": "4412",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menjaga Ketepatan dan Kesempurnaan dalam Perbuatan",
        "perawi_melayu": "Jabir",
        "english_text": "And from Jabir, he said: The Messenger of Allah, sallallahu 'alayhi wasallam, said: \"If the sole of his shoe is torn, he should not walk in one shoe until he repairs it. Nor should he walk in one slipper. Nor should he eat with his left hand. Nor should he wear one piece of cloth. Nor should he cover himself with a single piece of cloth,\" ",
        "malay_translation": "Dan daripada Jabir, dia berkata: Rasulullah SAW bersabda, \"Jika tapak kasutnya koyak, dia tidak boleh berjalan dengan satu kasut sehingga dia membetulkannya. Begitu juga, dia tidak boleh berjalan dengan hanya satu selipar. Dia juga tidak sepatutnya makan dengan tangan kirinya. Tidak boleh memakai sehelai kain sahaja. Dan juga tidak boleh berselimut dengan sehelai kain sahaja.\"",
        "arabic_text": "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا انْقَطَعَ شِسْعُ نَعْلِهِ فَلَا يَمْشِ فِي نَعْلٍ وَاحِدَةٍ حَتَّى يُصْلِحَ شِسْعَهُ وَلَا يَمْشِ فِي خُفٍّ وَاحِدٍ وَلَا يأكلْ بِشمَالِهِ وَلَا يجتبي بِالثَّوْبِ الْوَاحِدِ وَلَا يَلْتَحِفِ الصَّمَّاءَ» . رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 33107,
        "hadith_number": "4413",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kasut Rasulullah SAW yang Dua Belah Membahagi Dua",
        "perawi_melayu": "Ibnu Abbas",
        "english_text": "Daripada Ibnu Abbas r.a., katanya:  Kasut Rasulullah SAW mempunyai dua bahagian yang berbeza.",
        "malay_translation": "Daripada Ibnu Abbas r.a., baginda berkata:  Kasut Rasulullah SAW mempunyai dua bahagian yang berasingan.",
        "arabic_text": "عَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ لِنَعْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قِبَالَانِ مُثَنًّى شراكهما. رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 33108,
        "hadith_number": "4414",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Memakai Kasut Sambil Berdiri",
        "perawi_melayu": "Diriwayatkan daripada Jabir RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Jabir RA, beliau berkata: Rasulullah SAW melarang seseorang lelaki memakai kasut sambil berdiri. (Riwayat Abu Daud)",
        "arabic_text": "وَعَنْ جَابِرٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَنْتَعِلَ الرَّجُلُ قَائِمًا. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33109,
        "hadith_number": "4415",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis berkaitan kebaikan dan keutamaan",
        "perawi_melayu": "Abu Hurairah",
        "english_text": " ",
        "malay_translation": "Dan ia diriwayatkan oleh Imam Tirmizi dan Ibnu Majah daripada Abu Hurairah.",
        "arabic_text": "وَرَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ عَنْ أَبِي هُرَيْرَةَ"
      },
      {
        "id": 33110,
        "hadith_number": "4416",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keteladanan Rasulullah SAW dalam Penggunaan Satu Kasut",
        "perawi_melayu": "Qasim bin Muhammad daripada 'Aisyah",
        "english_text": "Dari Qasim bin Muhammad daripada 'Aisyah, dia berkata: Kadang-kadang Nabi SAW berjalan dengan satu kasut sahaja. Dalam satu riwayat, dikatakan bahawa beliau berjalan dengan satu kasut sahaja. Diriwayatkan oleh Imam Tirmizi dan beliau berkata: Ini adalah lebih sahih.",
        "malay_translation": "Daripada Qasim bin Muhammad daripada 'Aisyah, beliau berkata: Kadangkala Nabi SAW berjalan dengan hanya satu kasut. Dalam satu riwayat lain, dikatakan bahawa beliau berjalan dengan hanya satu kasut. Diriwayatkan oleh Imam Tirmizi dan beliau berkata: Ini adalah riwayat yang lebih sahih.",
        "arabic_text": "وَعَن القاسمِ بن محمَّدٍ عَنْ عَائِشَةَ قَالَتْ: رُبَّمَا مَشَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَعْلٍ وَاحِدَةٍ وَفِي رِوَايَةٍ: أَنَّهَا مَشَتْ بِنَعْلٍ وَاحِدَةٍ. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا أصحُّ"
      },
      {
        "id": 33111,
        "hadith_number": "4417",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Sunah Mengeluarkan Kasut dan Meletakkannya di Sisi",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "And from Ibn Abbas, he said: Among the sunnah, when a man sits, he should remove his shoes and place them beside him. Narrated by Abu Dawud.",
        "malay_translation": "Daripada Ibn Abbas, beliau berkata: Termasuk sunnah, apabila seorang lelaki duduk, hendaklah dia menanggalkan kasutnya dan meletakkannya di sisinya. Diriwayatkan oleh Abu Dawud.",
        "arabic_text": "وَعَن ابنِ عبَّاسٍ قَالَ: مِنَ السُّنَّةِ إِذَا جَلَسَ الرَّجُلُ أَنْ يَخْلَعَ نَعْلَيْهِ فَيَضَعَهُمَا بِجَنْبِهِ. رَوَاهُ أَبُو دَاوُدَ"
      },
      {
        "id": 33112,
        "hadith_number": "4418",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Khadiyah Raja Najasyi Hadiahkan Kasut Hitam kepada Rasulullah SAW",
        "perawi_melayu": "Ibnu Buraidah daripada bapanya",
        "english_text": "And from Ibn Buraidah from his father that the Najashi gave to the Prophet صلى الله عليه وسلم two black, simple sandals. Then he wore them. It was narrated by Ibn Majah. And at-Tirmidhi added from Ibn Buraidah from his father: Then he performed ablution and wiped over them. This chapter is free from the third section.",
        "malay_translation": "Dan daripada Ibn Buraidah daripada bapanya bahawa Raja Najasyi telah menghadiahkan dua pasang kasut hitam yang sederhana kepada Nabi صلى الله عليه وسلم. Kemudian baginda memakainya. Ia diriwayatkan oleh Ibn Majah. Dan tambahan daripada at-Tirmidhi daripada Ibn Buraidah daripada bapanya: Kemudian baginda berwuduk dan mengusap kedua-dua kasut tersebut. Bab ini bebas daripada bahagian ketiga.",
        "arabic_text": "وَعَنِ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ أَنَّ النَّجَاشِيَّ أَهْدَى إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُفَّيْنِ أَسْوَدَيْنِ سَاذَجَيْنِ فَلَبِسَهُمَا. رَوَاهُ ابْنُ مَاجَهْ. وَزَادَ التِّرْمِذِيُّ عَنِ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ: ثمَّ تَوَضَّأ وَمسح عَلَيْهِمَا هَذَا الْبَاب خَال من الْفَصْل الثَّالِث"
      },
      {
        "id": 33113,
        "hadith_number": "4419",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis tentang Wanita Haid Menyapu Kepala Rasulullah SAW",
        "perawi_melayu": "Aisyah رضي الله عنها",
        "english_text": "Daripada Aisyah رضي الله عنها, beliau berkata: Aku pernah menyapu kepala Rasulullah SAW ketika sedang haid.",
        "malay_translation": "Daripada Aisyah رضي الله عنها, beliau berkata, \"Aku pernah menyapu kepala Rasulullah SAW ketika sedang haid.\"",
        "arabic_text": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كُنْتُ أُرَجِّلُ رَأْسَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا حَائِض"
      },
      {
        "id": 33114,
        "hadith_number": "4420",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penjelasan Lima Hukum Fitrah dalam Islam",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Dari Abu Hurairah, dia berkata: Rasulullah SAW bersabda: Fitrah itu ada lima perkara: Sunat berkhatan, menyucikan diri selepas haid, memendekkan misai, memotong kuku, dan mencabut bulu ketiak.",
        "malay_translation": "Daripada Abu Hurairah, beliau berkata: Rasulullah SAW bersabda: Fitrah itu ada lima perkara: Sunat berkhatan, membersihkan diri selepas haid, memendekkan misai, memotong kuku, dan mencabut bulu ketiak.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الْفِطْرَةُ خَمْسٌ: الْخِتَانُ وَالِاسْتِحْدَادُ وَقَصُّ الشَّارِبِ وَتَقْلِيمُ الْأَظْفَارِ ونتفُ الإِبطِ"
      },
      {
        "id": 33115,
        "hadith_number": "4421",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perbezaan Daripada Orang Musyrik: Memelihara Janggut dan Mencukur Misai",
        "perawi_melayu": null,
        "english_text": null,
        "malay_translation": "Dan daripada Ibnu Umar, dia berkata: Rasulullah SAW bersabda: \"Berbeza daripada orang-orang musyrik: peliharalah janggut dan cukur misai.\"\" Dan dalam satu riwayat: \"Kurangkanlah (panjang) misai dan peliharalah janggut.\"",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: خَالِفُوا الْمُشْرِكِينَ: أَوْفِرُوا اللِّحَى وَأَحْفُوا الشَّوَارِبَ . وَفِي رِوَايَةٍ: «أنهكوا الشَّوَارِب وأعفوا اللحى»"
      },
      {
        "id": 33116,
        "hadith_number": "4422",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis Mengenai Waktu Memotong Janggut, Menggunting Kuku, Mencukur Ketiak dan Kemaluan",
        "perawi_melayu": null,
        "english_text": "Daripada Anas r.a., Baginda berkata: Telah ditetapkan tempoh bagi kami dalam hal memotong janggut, menggunting kuku, mencabut bulu ketiak dan mencukur kemaluan bahawa ia tidak boleh ditinggalkan melebihi 40 malam.",
        "malay_translation": "Daripada Anas r.a., Baginda bersabda: Telah ditetapkan tempoh bagi kita dalam perkara memotong janggut, menggunting kuku, mencabut bulu ketiak dan mencukur kemaluan bahawa ia tidak boleh ditinggalkan lebih daripada empat puluh malam. Riwayat Muslim.",
        "arabic_text": "وَعَن أَنس قَالَ: وُقِّتَ لَنَا فِي قَصِّ الشَّارِبِ وَتَقْلِيمِ الْأَظْفَارِ وَنَتْفِ الْإِبِطِ وَحَلْقِ الْعَانَةِ أَنْ لَا تُتْرَكَ أَكثر من أَرْبَعِينَ لَيْلَة. رَوَاهُ مُسلم"
      },
      {
        "id": 33117,
        "hadith_number": "4423",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menyerupai Yahudi dan Nasrani dalam Hal Pewarnaan",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Daripada Abu Hurairah bahawa Nabi SAW bersabda: Sesungguhnya orang Yahudi dan Nasrani tidak mewarnakan rambut. Oleh itu, janganlah kamu menyerupai mereka.",
        "malay_translation": "Daripada Abu Hurairah RA bahawa Nabi SAW bersabda: Sesungguhnya orang Yahudi dan Nasrani tidak mewarnakan rambut. Oleh itu, janganlah kamu menyerupai mereka dalam perkara tersebut.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الْيَهُودَ وَالنَّصَارَى لَا يَصبِغون فخالفوهم»"
      },
      {
        "id": 33118,
        "hadith_number": "4424",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mengubah Warna Rambut Putih dan Menjauhi Warna Hitam",
        "perawi_melayu": "Diriwayatkan daripada Jabir RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Jabir RA berkata: Abu Quhafah dibawa pada hari pembukaan Kota Mekah dalam keadaan kepala dan janggutnya putih seperti kapas. Maka Nabi SAW bersabda: \"Ubahlah ini dengan sesuatu dan jauhilah warna hitam.\"",
        "arabic_text": "وَعَن جَابر قَالَ: أُتِيَ بِأَبِي قُحَافَةَ يَوْمَ فَتْحِ مَكَّةَ وَرَأْسُهُ وَلِحْيَتُهُ كَالثُّغَامَةِ بَيَاضًا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «غَيِّرُوا هَذَا بِشَيْءٍ وَاجْتَنِبُوا السَّواد» . رَوَاهُ مُسلم"
      },
      {
        "id": 33119,
        "hadith_number": "4425",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Mengikut Cara Baik Orang Kitab Dalam Hal Yang Tidak Dilarang",
        "perawi_melayu": "Ibnu Abbas",
        "english_text": "And from Ibn Abbas, he said: The Prophet ﷺ used to love to follow the people of the Book in matters where he was not commanded otherwise. And the people of the Book used to let down their hair, and the polytheists used to spread their hair. So the Prophet ﷺ let down his forehead, then he spread his hair.",
        "malay_translation": "Dan daripada Ibnu Abbas, beliau berkata: Nabi saw suka mengikuti cara orang-orang Ahli Kitab dalam perkara yang tidak diperintahkan sebaliknya. Dan orang-orang Ahli Kitab biasanya melepaskan rambut mereka, sedangkan orang-orang musyrik biasanya memecah rambut mereka. Maka Nabi saw melepaskan rambut bahagian dahinya, kemudian beliau memecah rambutnya.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحِبُّ مُوَافَقَةَ أَهْلِ الْكِتَابِ فِيمَا لَمْ يُؤْمَرْ فِيهِ وَكَانَ أَهْلُ الْكِتَابِ يَسْدُلُونَ أَشْعَارَهُمْ وَكَانَ الْمُشْرِكُونَ يَفْرِقُونَ رؤوسهم فَسَدَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَاصِيَتَهُ ثمَّ فرق بعدُ"
      },
      {
        "id": 33120,
        "hadith_number": "4426",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Qaza' (Mencukur Sebahagian Rambut Kepala)",
        "perawi_melayu": "Nafi' daripada Ibnu Umar",
        "english_text": "Not Available",
        "malay_translation": "Daripada Nafi', daripada Ibnu Umar, beliau berkata: Aku mendengar Nabi ﷺ melarang daripada Qaza'. Ditanya kepada Nafi': Apakah itu Qaza'? Beliau berkata: Dicukur sebahagian kepala kanak-kanak dan ditinggalkan sebahagian yang lain. Sebahagian mereka menambahkan tafsiran pada Hadith ini.",
        "arabic_text": "وَعَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنِ الْقَزَعِ. قِيلَ لِنَافِعٍ: مَا الْقَزَعُ؟ قَالَ: يُحْلَقُ بعضُ رَأس الصبيِّ وَيتْرك البعضُ وَألْحق بَعضهم التَّفْسِير بِالْحَدِيثِ"
      },
      {
        "id": 33121,
        "hadith_number": "4427",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mencukur Sebahagian Rambut Kepala",
        "perawi_melayu": "Diriwayatkan daripada Ibn Umar",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibn Umar: Bahawa Nabi SAW melihat seorang budak yang dicukur sebahagian rambutnya dan ditinggalkan sebahagian yang lain. Baginda melarang mereka daripada perbuatan tersebut dan bersabda: \"Cukurlah kesemuanya atau tinggalkan kesemuanya.\" (Riwayat Muslim)",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى صَبِيًّا قَدْ حُلِقَ بَعْضُ رَأْسِهِ وَتُرِكَ بَعْضُهُ فَنَهَاهُمْ عَنْ ذَلِكَ وَقَالَ: «احْلِقُوا كُلَّهُ أَوِ اتْرُكُوا كُلَّهُ» . رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 33122,
        "hadith_number": "4428",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keaiban Lelaki dan Wanita yang Berpakaian dan Bertindak Meniru Jantina Lain",
        "perawi_melayu": "Ibnu Abbas",
        "english_text": "And from Ibn Abbas, he said: May Allah curse the men who are effeminate and the women who act like men. And he said, \"Drive them out of your houses.\". Reported by al-Bukhari",
        "malay_translation": "Dan daripada Ibnu Abbas, beliau berkata: Semoga Allah melaknati lelaki yang bersifat lemah lembut seperti perempuan dan wanita yang bertindak seperti lelaki. Dan beliau berkata, \"Keluarkan mereka daripada rumah kamu.\" Diriwayatkan oleh al-Bukhari.",
        "arabic_text": "وَعَن ابْن عَبَّاس قَالَ: لعن الله الْمُخَنَّثِينَ مِنَ الرِّجَالِ وَالْمُتَرَجِّلَاتِ مِنَ النِّسَاءِ وَقَالَ: «أخرجوهم من بُيُوتكُمْ» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 33123,
        "hadith_number": "4429",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Laknat Allah ke atas Lelaki yang Menyerupai Wanita dan Wanita yang Menyerupai Lelaki",
        "perawi_melayu": null,
        "english_text": "And from him (he said): The Prophet صلى الله عليه وسلم said, \"Allah has cursed those men who imitate women and those women who imitate men.\"",
        "malay_translation": "Dan daripada baginda (iaitu baginda bersabda): Rasulullah SAW bersabda, \"Allah melaknat lelaki yang menyerupai wanita dan wanita yang menyerupai lelaki.\"",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَعَنَ اللَّهُ الْمُتَشَبِّهِينَ مِنَ الرِّجَالِ بِالنِّسَاءِ والمتشبِّهات من النِّسَاء بِالرِّجَالِ» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 33124,
        "hadith_number": "4430",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kutukan Allah Kepada Mereka Yang Melakukan Perbuatan Sesat dan Memperoleh Kecacatan",
        "perawi_melayu": "Ibn Umar",
        "english_text": "And from Ibn Umar that the Prophet, peace be upon him, said: \"Allah curses the wasilah (those who seek to be related to others) and mustawşil (those who seek to be related to others), the waşimah (those who permanently scar themselves) and mustawşimah (those who permanently scar themselves).\"",
        "malay_translation": "Dan daripada Ibn Umar bahawa Nabi SAW bersabda: \"Allah melaknat orang yang wasilah (mencari hubungan) dan mustawşil (mencari hubungan), waşimah (melakukan pencacatan kekal) dan mustawşimah (melakukan pencacatan kekal).\".",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَعَنَ اللَّهُ الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ والواشمة والمستوشمة»"
      },
      {
        "id": 33125,
        "hadith_number": "4431",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mengubah Ciptaan Allah dan Penguatkuasaan Hukum Nabi SAW",
        "perawi_melayu": null,
        "english_text": "And from Abdullah bin Mas'ud, he said: Allah curses the women who make tattoos and those who get them, and those who whiten their skin and those who carve their faces to change Allah's creation. Then a woman came and said: I have heard that you have cursed so and so. He said: What stops me from cursing those whom the Messenger of Allah, peace and blessings be upon him, cursed, and those who are in the Book of Allah? She said: I have indeed read between the two tablets (Al-Lawh al-Mahfuz), and I did not find what you say. He said: If you had read it, you would have found it. Didn't you read: \"What the Messenger has brought you - accept it, and what he has forbidden you - abstain from it\"? She said: Yes. He said: Indeed, he forbade it.",
        "malay_translation": "Dan daripada Abdullah bin Mas'ud, beliau berkata: Allah melaknat wanita-wanita yang membuat tatu dan mereka yang menatunya, mereka yang memutihkan kulit dan mereka yang mencantas wajah mereka untuk mengubah ciptaan Allah. Kemudian datang seorang wanita lalu berkata: Aku telah mendengar bahawa engkau telah melaknat si fulan dan si fulanah. Beliau berkata: Apakah yang menghalangku daripada melaknat mereka yang telah dilaknat oleh Rasulullah SAW dan mereka yang disebut dalam kitab Allah? Wanita itu berkata: Aku telah membaca antara dua papan (Lauh al-Mahfuz), dan aku tidak menemui apa yang engkau katakan. Beliau berkata: Jika engkau telah membacanya, engkau akan mendapati (jawapan). Bukankah engkau telah membaca: \"Apa yang dibawa oleh Rasul kepada kamu, maka terimalah, dan apa yang dilarangnya, maka tinggalkanlah\"? Wanita itu berkata: Ya. Beliau berkata: Sesungguhnya, ia telah dilarang.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: لَعَنَ اللَّهُ الْوَاشِمَاتِ وَالْمُسْتَوْشِمَاتِ وَالْمُتَنَمِّصَاتِ وَالْمُتَفَلِّجَاتِ لِلْحُسْنِ الْمُغَيِّرَاتِ خَلْقَ اللَّهِ فَجَاءَتْهُ امْرَأَةٌ فَقَالَتْ: إِنَّهُ بَلَغَنِي أَنَّكَ لَعَنْتَ كَيْتَ وَكَيْتَ فَقَالَ: مَا لِي لَا أَلْعَنُ مَنْ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَنْ هُوَ فِي كِتَابِ اللَّهِ فَقَالَتْ: لَقَدْ قَرَأْتُ مَا بَيْنَ اللَّوْحَيْنِ فَمَا وجدت فِيهِ مَا نقُول قَالَ: لَئِنْ كُنْتِ قَرَأْتِيهِ لَقَدْ وَجَدْتِيهِ أَمَا قَرَأت: (مَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانْتَهُوا) ؟ قَالَت: بلَى قَالَ: فإِنه قد نهى عَنهُ"
      },
      {
        "id": 33126,
        "hadith_number": "4432",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mata Yang Benar dan Larangan Memakai Tatu",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Daripada Abu Hurairah, katanya: Rasulullah SAW bersabda: \"Mata adalah hak.\" Dan beliau melarang tatto. Diriwayatkan oleh al-Bukhari.",
        "malay_translation": "Daripada Abu Hurairah, beliau berkata: Rasulullah SAW bersabda, \"Mata adalah hak.\" Dan Baginda melarang tatto.  Hadis ini diriwayatkan oleh al-Bukhari.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْعَيْنُ حَقٌّ» وَنَهَى عَن الوشم. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 33127,
        "hadith_number": "4433",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penglihatan Rasulullah SAW Dalam Keadaan Melabid",
        "perawi_melayu": "Ibn Umar",
        "english_text": "And from Ibn Umar he said: I have seen the Messenger of Allah, peace and blessings be upon him, in a state of melabid.  Narrated by al-Bukhari.",
        "malay_translation": "Dan daripada Ibn Umar, beliau berkata: Sesungguhnya aku telah melihat Rasulullah SAW dalam keadaan melabid. Diriwayatkan oleh al-Bukhari.",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ قَالَ: لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُلَبِّدًا. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 33128,
        "hadith_number": "4434",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Memakai Za'faran (Saffron) bagi Lelaki",
        "perawi_melayu": "Diriwayatkan daripada Anas RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Anas RA, beliau berkata: Rasulullah SAW melarang seorang lelaki daripada memakai za'faran (saffron).",
        "arabic_text": "وَعَنْ أَنَسٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَتَزَعْفَرَ الرَّجُلُ"
      },
      {
        "id": 33129,
        "hadith_number": "4435",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menyemburkan Wangi-wangian Kepada Nabi SAW",
        "perawi_melayu": "Aisyah RA",
        "english_text": "And from Aisyah (RA), she said: I used to perfume the Prophet SAW with the best perfume that I could find, until I found white musk on his head and beard.",
        "malay_translation": "Dan daripada Aisyah RA, beliau berkata: Aku pernah menyemburkan wangi-wangian kepada Nabi SAW dengan wangian terbaik yang aku dapati, sehingga aku dapati minyak wangi putih (misk) di kepalanya dan janggutnya.",
        "arabic_text": "وَعَنْ عَائِشَةَ قَالَتْ: كُنْتُ أُطَيِّبُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَطْيَبِ مَا نَجِدُ حَتَّى أَجِدَ وَبِيصَ الطِّيبِ فِي رَأْسِهِ ولحيته"
      },
      {
        "id": 33130,
        "hadith_number": "4436",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Cara Rasulullah SAW Mencuci Diri (Istijmār)",
        "perawi_melayu": "Nafi' bin Umar",
        "english_text": "And from Nafi' he said:  Ibn 'Umar used to perform istijmar with aloeswood that was not wet and with camphor, scattering it with the aloeswood. Then he said: This is how the Messenger of Allah, peace and blessings be upon him, used to perform istijmar.",
        "malay_translation": "Dan daripada Nafi', dia berkata:  Ibnu Umar dahulu menggunakan kayu gaharu yang tidak basah dan kapur barus, menaburkannya bersama kayu gaharu itu. Kemudian dia berkata: Begitulah cara Rasulullah SAW melakukan istijmar.",
        "arabic_text": "وَعَنْ نَافِعٍ قَالَ: كَانَ ابْنُ عُمَرَ إِذَا اسْتَجْمَرَ اسْتَجْمَرَ بِأَلُوَّةٍ غَيْرِ مُطَرَّاةٍ وَبِكَافُورٍ يَطْرَحُهُ مَعَ الْأَلُوَّةِ ثُمَّ قَالَ: هَكَذَا كَانَ يَسْتَجْمِرُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. رَوَاهُ مُسلم"
      },
      {
        "id": 33131,
        "hadith_number": "4437",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Sunnah Nabi SAW Mengenai Menggunting Janggut dan Amalan Para Nabi Sebelumnya",
        "perawi_melayu": "Ibn Abbas RA",
        "english_text": "Daripada Ibn Abbas RA, katanya: Nabi SAW sering mencukur atau memotong janggutnya, dan Ibrahim Khalilullah juga melakukan amalan yang sama.  Riwayat ini diriwayatkan oleh Imam Tirmizi.",
        "malay_translation": "Daripada Ibn Abbas R.A., baginda berkata: Nabi SAW  biasa mencukur atau memotong janggutnya, dan Ibrahim Khalilullah juga melakukan perkara yang sama.  Hadis ini diriwayatkan oleh Imam Tirmizi.",
        "arabic_text": "عَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُصُّ أَوْ يَأْخُذُ مِنْ شَارِبِهِ وَكَانَ إِبْرَاهِيمُ خَلِيلُ الرَّحْمَنِ صَلَوَاتُ الرَّحْمَنِ عَلَيْهِ يَفْعَله. رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 33132,
        "hadith_number": "4438",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Tidak Menjaga Janggut",
        "perawi_melayu": "Zayd bin Arqam",
        "english_text": "Daripada Said bin Arqam, bahawa Rasulullah SAW bersabda: \"Barangsiapa yang tidak menjaga janggutnya, maka bukanlah dari kalangan kami.\"",
        "malay_translation": "Daripada Said bin Arqam, bahawa Rasulullah SAW bersabda: \"Barangsiapa yang tidak menjaga janggutnya, maka bukanlah daripada kalangan kita.\"",
        "arabic_text": "وَعَنْ زَيْدِ بْنِ أَرْقَمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ لَمْ يَأْخُذ شَارِبِهِ فَلَيْسَ مِنَّا» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ"
      },
      {
        "id": 33133,
        "hadith_number": "4439",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi SAW Mengambil Sejumlah Janggut Baginda",
        "perawi_melayu": "Amru bin Syu'aib daripada bapanya daripada datuknya",
        "english_text": "Daripada Amru bin Syu'aib daripada bapanya daripada datuknya: Bahawa Nabi SAW sering mengambil sebahagian daripada janggut baginda, dari sisi dan panjangnya.  Riwayat Imam Tirmizi. Beliau berkata: Hadis ini gharib.",
        "malay_translation": "Daripada Amru bin Syu'aib daripada bapanya daripada datuknya: Bahawa Nabi SAW biasa mengambil sebahagian daripada janggut baginda, dari bahagian kiri dan kanannya, serta dari panjangnya.  Imam Tirmizi meriwayatkannya. Beliau berkata: Hadis ini adalah hadis gharib.",
        "arabic_text": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْخُذُ مِنْ لِحْيَتِهِ مِنْ عَرْضِهَا وَطُولِهَا. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ"
      },
      {
        "id": 33134,
        "hadith_number": "4440",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Memakai Khaluq (Sejenis Wangian) Bagi Lelaki yang Tidak Beristeri",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ya'la bin Murrah RA, bahawasanya Nabi SAW melihatnya memakai Khaluq (sejenis wangian). Baginda bertanya: \"Adakah engkau mempunyai isteri?\" Dia menjawab: \"Tidak\". Baginda bersabda: \"Maka basuhlah ia, kemudian basuhlah ia, kemudian basuhlah ia, kemudian jangan ulangi.\". Riwayat Tirmizi dan Nasai.",
        "arabic_text": "وَعَن يعلى بن مرّة أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى عَلَيْهِ خَلُوقًا فَقَالَ: «أَلَكَ امْرَأَةٌ؟» قَالَ: لَا قَالَ: «فَاغْسِلْهُ ثُمَّ اغْسِلْهُ ثُمَّ اغْسِلْهُ ثُمَّ لَا تعد» . رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ"
      },
      {
        "id": 33135,
        "hadith_number": "4441",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Solat Orang yang Mengandungi Kotoran",
        "perawi_melayu": "Abi Musa",
        "english_text": "And from Abi Musa he said: The Messenger of Allah, peace and blessings be upon him, said: \"Allah will not accept the prayer of a person who has something unclean on his body.\"",
        "malay_translation": "Dan daripada Abi Musa, dia berkata: Rasulullah SAW bersabda: \"Allah tidak akan menerima solat seseorang yang mempunyai sesuatu yang najis pada tubuhnya.\"",
        "arabic_text": "وَعَنْ أَبِي مُوسَى قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَقْبَلُ اللَّهُ صَلَاةَ رَجُلٍ فِي جَسَدِهِ شَيْءٌ مِنْ خَلُوقٍ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33136,
        "hadith_number": "4442",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rawatan Luka dengan Kunyit dan Nasihat Nabi SAW",
        "perawi_melayu": "Umar bin Yasir",
        "english_text": "And from 'Ammar bin Yasir, he said: I returned to my family from a journey, and my hands were cracked. So they treated me with saffron. Then I went to the Prophet sallallahu alaihi wasallam and greeted him, but he did not reply to me. He said, \"Go and wash this from you.\"",
        "malay_translation": "Dan daripada 'Ammar bin Yasir, beliau berkata: Aku pulang kepada keluarga dari satu perjalanan, dan tanganku berretak. Maka mereka merawatku dengan kunyit. Kemudian aku pergi kepada Nabi SAW dan memberi salam, tetapi baginda tidak menjawabku. Baginda bersabda, \"Pergi dan basuhlah yang ini daripadamu.\"",
        "arabic_text": "وَعَنْ عَمَّارِ بْنِ يَاسِرٍ قَالَ: قَدِمْتُ عَلَى أَهْلِي مِنْ سَفَرٍ وَقَدْ تَشَقَّقَتْ يَدَايَ فَخَلَّقُونِي بِزَعْفَرَانٍ فَغَدَوْتُ عَلَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَلَّمْتُ عَلَيْهِ فَلَمْ يَرُدَّ عَلَيَّ وَقَالَ: «اذْهَبْ فَاغْسِلْ هَذَا عَنْكَ» . رَوَاهُ أَبُو دَاوُدَ"
      },
      {
        "id": 33137,
        "hadith_number": "4443",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keistimewaan Lelaki dan Wanita yang Baik",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Daripada Abu Hurairah, katanya: Rasulullah SAW bersabda: \"Keistimewaan lelaki yang baik ialah bau wangi yang terpapar dan warnanya yang tersembunyi. Dan keistimewaan wanita yang baik ialah warnanya yang terpapar dan baunya yang tersembunyi.\"",
        "malay_translation": "Daripada Abu Hurairah, katanya: Rasulullah SAW bersabda: \"Keistimewaan lelaki yang baik ialah bau wangi yang terpapar dan warnanya yang tersembunyi.  Dan keistimewaan wanita yang baik ialah warnanya yang terpapar dan baunya yang tersembunyi.\"  Riwayat Imam Tirmizi dan Imam Nasai.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «طِيبُ الرِّجَالِ مَا ظَهَرَ رِيحُهُ وَخَفِيَ لَوْنُهُ وَطِيبُ النِّسَاءِ مَا ظَهَرَ لَوْنُهُ وَخَفِيَ رِيحُهُ» . رَوَاهُ التِّرْمِذِيُّ وَالنَّسَائِيُّ"
      },
      {
        "id": 33138,
        "hadith_number": "4444",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Menggunakan Minyak Wangi",
        "perawi_melayu": "Diriwayatkan daripada Anas RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Anas RA berkata: Rasulullah SAW mempunyai bekas minyak wangi yang baginda gunakan untuk berharuman. (Riwayat Abu Daud)",
        "arabic_text": "وَعَن أنس قَالَ: كَانَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُكَّةٌ يَتَطَيَّبُ مِنْهَا. رَوَاهُ أَبُو دَاوُدَ"
      },
      {
        "id": 33139,
        "hadith_number": "4445",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Menggunakan Minyak Rambut dan Merapikan Janggut",
        "perawi_melayu": "Nabi Muhammad SAW",
        "english_text": "Daripadanya, beliau berkata: Rasulullah SAW sering mengoleskan minyak pada kepalanya dan merapikan janggutnya serta banyak memakai minyak wangi, seakan-akan pakaiannya adalah pakaian tukang minyak wangi. Diriwayatkan dalam Syarah as-Sunnah.",
        "malay_translation": "Daripadanya, beliau berkata: Rasulullah SAW sering mengoleskan minyak pada kepalanya dan merapikan janggutnya serta banyak memakai minyak wangi, seakan-akan pakaiannya adalah pakaian tukang minyak wangi. Diriwayatkan dalam Syarah as-Sunnah.",
        "arabic_text": "وَعَنْهُ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يُكثر دهن رَأسه وتسريحَ لحيته وَيُكْثِرُ الْقِنَاعَ كَأَنَّ ثَوْبَهُ ثَوْبُ زَيَّاتٍ. رَوَاهُ فِي شرح السّنة"
      },
      {
        "id": 33140,
        "hadith_number": "4446",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kedatangan Rasulullah SAW ke Mekah dengan Empat Baju",
        "perawi_melayu": "Ummu Hani",
        "english_text": "Daripada Ummu Hani, dia berkata: Rasulullah SAW telah datang kepada kami di Makkah dengan empat helai baju. Diriwayatkan oleh Imam Ahmad, Imam Abu Daud, Imam al-Tirmizi, dan Imam Ibn Majah.",
        "malay_translation": "Daripada Ummu Hani, beliau berkata: Rasulullah SAW telah datang kepada kami di Makkah dalam keadaan mempunyai empat helai baju.  Hadis ini diriwayatkan oleh Imam Ahmad, Imam Abu Daud, Imam al-Tirmizi, dan Imam Ibn Majah.",
        "arabic_text": "وَعَن أم هَانِئ قَالَتْ: قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْنَا بِمَكَّةَ قَدْمَةً وَلَهُ أَرْبَعُ غَدَائِرَ. رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ"
      },
      {
        "id": 33141,
        "hadith_number": "4447",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penjelasan Mengenai Rawatan Rambut Rasulullah SAW",
        "perawi_melayu": "Aisyah R.A.",
        "english_text": "Dari Aisyah RA, beliau berkata: Apabila aku menyisir kepala Rasulullah SAW, aku akan memisahkan rambutnya dan menggerakkan ubun-ubunnya ke antara kedua-dua alis mata beliau.",
        "malay_translation": "Daripada Aisyah RA, beliau berkata: Apabila aku menyisir rambut Rasulullah SAW, aku akan memisahkan bahagian rambutnya dan menggerakkan ubun-ubun beliau ke antara kedua-dua alis mata beliau.  Hadis ini diriwayatkan oleh Imam Abu Daud.",
        "arabic_text": "وَعَن عَائِشَة قَالَتْ: إِذَا فَرَقْتُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأْسَهُ صَدَّعْتُ فَرْقَهُ عَنْ يَافُوخِهِ وَأَرْسَلْتُ نَاصِيَتَهُ بَيْنَ عَيْنَيْهِ. رَوَاهُ أَبُو دَاوُدَ"
      },
      {
        "id": 33142,
        "hadith_number": "4448",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Berlagak Kecuali Memandang Seseorang dalam Keadaan Tersembunyi",
        "perawi_melayu": "Abdullah bin Mughaffal",
        "english_text": "And from Abdullah bin Mughaffal, he said: The Messenger of Allah, peace and blessings be upon him, forbade showing off, except in secret.",
        "malay_translation": "Dan daripada Abdullah bin Mughaffal, dia berkata: Rasulullah SAW melarang berlagak kecuali dalam keadaan tersembunyi.",
        "arabic_text": "وَعَن عبد الله بن مغفَّل قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ التَّرَجُّلِ إِلَّا غِبًّا. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد وَالنَّسَائِيّ"
      },
      {
        "id": 33143,
        "hadith_number": "4449",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan dan Keutamaan dalam Berpakaian dan Mengurus Diri",
        "perawi_melayu": "Abdullah bin Buraidah",
        "english_text": "And from Abdullah bin Buraidah, he said: A man said to Fadhalah bin Ubaid, \"Why do I see you unkempt?\" He said: Indeed, the Messenger of Allah, peace and blessings be upon him, used to forbid us from many things related to excessive adornment. He said, \"Why do I not see sandals on you?\" He said: The Messenger of Allah, peace and blessings be upon him, used to command us to sometimes wear them [sandals]. Reported by Imam Abu Dawud.",
        "malay_translation": "Dan daripada Abdullah bin Buraidah, beliau berkata: Seorang lelaki berkata kepada Fadhalah bin Ubaid, \"Mengapa aku melihat engkau tidak kemas?\" Beliau menjawab: Sesungguhnya Rasulullah SAW pernah melarang kita daripada banyak perkara yang berkaitan dengan perhiasan yang berlebihan. Baginda bertanya, \"Mengapa aku tidak melihat kasut di kakimu?\" Beliau menjawab: Rasulullah SAW pernah memerintahkan kita untuk memakai kasut pada waktu-waktu tertentu.  Riwayat Imam Abu Dawud.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ قَالَ: قَالَ رَجُلٌ لِفَضَالَةَ بْنِ عُبَيْدٍ: مَا لِي أَرَاكَ شَعِثًا؟ قَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَنْهَانَا عَنْ كَثِيرٍ مِنَ الإِرفاه قَالَ: مَالِي لَا أَرَى عَلَيْكَ حِذَاءً؟ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُنَا أَنْ نحتفي أَحْيَانًا. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33144,
        "hadith_number": "4450",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Memelihara Rambut dengan Adab dan Hormat",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Dari Abu Hurairah bahawa Rasulullah SAW bersabda: \"Barangsiapa yang mempunyai rambut, hendaklah dia menghormatinya.\"",
        "malay_translation": "Daripada Abu Hurairah bahawa Rasulullah SAW bersabda: “Sesiapa yang mempunyai rambut, hendaklah ia menghormatinya.”  Riwayat Abu Daud.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ كَانَ لَهُ شعرٌ فليُكرمه» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33145,
        "hadith_number": "4451",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Penggunaan Henna dan Katam bagi Menutup Uban",
        "perawi_melayu": "Abu Dzar",
        "english_text": "Daripada Abu Dzar, katanya: Rasulullah SAW bersabda: \"Sesungguhnya sebaik-baik (cara) yang mengubah uban adalah dengan menggunakan henna dan katam.\"",
        "malay_translation": "Daripada Abu Dzar, katanya: Rasulullah SAW bersabda: \"Sesungguhnya sebaik-baik (cara) yang mengubah uban adalah dengan menggunakan henna dan katam.\" (Riwayat Imam Tirmidzi, Abu Daud, dan Al-Nasa'i)",
        "arabic_text": "وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَحْسَنَ مَا غُيِّرَ بِهِ الشَّيْبُ الْحِنَّاءُ وَالْكَتَمُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد وَالنَّسَائِيّ"
      },
      {
        "id": 33146,
        "hadith_number": "4452",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kumpulan Orang-orang di Akhir Zaman yang Menyerupai Burung Merpati dan Tidak Mencium Aroma Syurga",
        "perawi_melayu": "Ibnu Abbas",
        "english_text": "Daripada Ibnu Abbas daripada Nabi SAW, baginda bersabda: \"Akan datang suatu kaum di akhir zaman yang mencerminkan kegelapan seperti hasil tangkapan burung merpati; mereka tidak akan mencium bau syurga.\"",
        "malay_translation": "Daripada Ibnu Abbas daripada Nabi SAW, baginda bersabda: \"Akan datang suatu kaum di akhir zaman yang penampilannya gelap seperti hasil tangkapan burung merpati; mereka tidak akan mencium bau syurga.\"",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَكُونُ قَوْمٌ فِي آخِرِ الزَّمَانِ يَخْضِبُونَ بِهَذَا السَّوَادِ كَحَوَاصِلِ الْحَمَامِ لَا يَجِدُونَ رَائِحَةَ الْجَنَّةِ» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ"
      },
      {
        "id": 33147,
        "hadith_number": "4453",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Mengamalkan Adat Nabi SAW dalam Memakai Kasut dan Memwarnai Janggut",
        "perawi_melayu": "Ibnu Umar",
        "english_text": "Daripada Ibn Umar bahawa Nabi SAW biasa memakai kasut sabti dan mewarnakan janggutnya dengan pewarna kuning (seperti kunyit dan safron). Ibn Umar turut mengamalkannya.  Riwayat ini diriwayatkan oleh al-Nasa'i.",
        "malay_translation": "Daripada Ibnu Umar RA bahawa Rasulullah SAW biasa memakai kasut Sabti dan mewarnakan janggutnya dengan pewarna kunyit dan safron. Ibnu Umar juga turut melakukannya.  Hadis ini diriwayatkan oleh al-Nasa'i.",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَلْبَسُ النِّعَالَ السِّبْتِيَّةَ وَيَصْفِرُّ لِحْيَتَهُ بِالْوَرْسِ وَالزَّعْفَرَانِ وَكَانَ ابْنُ عُمَرَ يَفْعَلُ ذَلِك. رَوَاهُ النَّسَائِيّ"
      },
      {
        "id": 33148,
        "hadith_number": "4454",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Anjuran Mewarnai Rambut dengan Inai dan Sebagainya",
        "perawi_melayu": "Ibnu Abbas RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Abbas RA berkata: Seorang lelaki yang mewarnakan rambutnya dengan inai telah melalui Nabi SAW, lalu Baginda bersabda: \"Alangkah baiknya ini.\" Kemudian, seorang lelaki lain yang mewarnakan rambutnya dengan inai dan katam (sejenis tumbuhan) lalu, lalu Baginda bersabda: \"Ini lebih baik daripada yang ini.\" Kemudian, seorang lelaki lain yang mewarnakan rambutnya dengan warna kuning lalu, lalu Baginda bersabda: \"Ini lebih baik daripada semua ini.\"  (Riwayat Abu Daud)",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: مَرَّ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ قَدْ خَضَبَ بِالْحِنَّاءِ فَقَالَ: «مَا أَحْسَنَ هَذَا» . قَالَ: فَمَرَّ آخَرُ قَدْ خَضَبَ بِالْحِنَّاءِ وَالْكَتَمِ فَقَالَ: «هَذَا أَحْسَنُ مِنْ هَذَا» ثُمَّ مَرَّ آخَرُ قَدْ خَضَبَ بِالصُّفْرَةِ فَقَالَ: «هَذَا أَحْسَنُ مِنْ هَذَا كُله» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33149,
        "hadith_number": "4455",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menjaga Kebersihan dan Menjauhi Penyerupaan dengan Yahudi",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Dari Abu Hurairah RA, Rasulullah SAW bersabda: \"Hilangkanlah uban dan janganlah menyerupai orang Yahudi.\"",
        "malay_translation": "Daripada Abu Hurairah radhiallahu 'anhu, Rasulullah SAW bersabda: \"Hilangkanlah uban dan janganlah menyerupai orang Yahudi.\"",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «غَيِّرُوا الشَّيْبَ وَلَا تشبَّهوا باليهودِ» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 33150,
        "hadith_number": "4456",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis Tentang Perawi Imam Nasai, Ibnu Umar dan Zubair",
        "perawi_melayu": "Imam Nasai, Ibnu Umar dan Zubair",
        "english_text": "Narrated by al-Nasa'i from Ibn Umar and al-Zubair",
        "malay_translation": "Diriwayatkan oleh al-Nasa'i daripada Ibn Umar dan al-Zubair",
        "arabic_text": "وَرَوَاهُ النَّسَائِيّ عَن ابْن عمر وَالزُّبَيْر"
      },
      {
        "id": 33151,
        "hadith_number": "4457",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis Mengenai Perawi Ibn Umar dan Zubair",
        "perawi_melayu": "Ibn Umar dan Zubair",
        "english_text": "This Hadith is narrated by al-Nasa'i from Ibn Umar and al-Zubair.",
        "malay_translation": "Hadis ini diriwayatkan oleh al-Nasa'i daripada Ibn Umar dan al-Zubair.",
        "arabic_text": "وَرَوَاهُ النَّسَائِيّ عَن ابْن عمر وَالزُّبَيْر"
      },
      {
        "id": 33152,
        "hadith_number": "4458",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mencabut Uban dan Keutamaannya dalam Islam",
        "perawi_melayu": "Diriwayatkan daripada 'Amr bin Syu'aib, daripada ayahnya, daripada datuknya, beliau berkata: Rasulullah SAW bersabda:",
        "english_text": "Not Available",
        "malay_translation": "Daripada 'Amr bin Syu'aib, daripada ayahnya, daripada datuknya, beliau berkata: Rasulullah SAW bersabda: \"Janganlah kamu mencabut uban, kerana sesungguhnya ia adalah cahaya bagi seorang Muslim. Sesiapa yang beruban sehelai rambut dalam Islam, Allah akan menuliskan baginya satu kebaikan, menghapuskan daripadanya satu kesalahan, dan mengangkatnya satu darjat.\" (Riwayat Abu Daud)",
        "arabic_text": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَنْتِفُوا الشَّيْبَ فَإِنَّهُ نُورُ الْمُسْلِمِ مَنْ شَابَ شَيْبَةً فِي الْإِسْلَامِ كَتَبَ اللَّهُ لَهُ بِهَا حَسَنَةً وَكَفَّرَ عَنْهُ بِهَا خَطِيئَةً وَرَفَعَهُ بِهَا دَرَجَةً» . رَوَاهُ أَبُو دَاوُدَ"
      },
      {
        "id": 33153,
        "hadith_number": "4459",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Siapa yang Uban di Islam, Ia Cahaya di Hari Kiamat",
        "perawi_melayu": "Ka'ab bin Murrah",
        "english_text": "From Ka'ab bin Murrah, from the Messenger of Allah (ﷺ): \"Whoever acquires white hair in Islam, it will be a light for him on the Day of Resurrection.\"",
        "malay_translation": "Daripada Ka'ab bin Murrah, daripada Rasulullah SAW, Baginda bersabda: \"Sesiapa yang mendapatkan uban dalam Islam, ia akan menjadi cahaya baginya pada Hari Kiamat.\"",
        "arabic_text": "وَعَنْ كَعْبِ بْنِ مُرَّةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ شَابَ شَيْبَةً فِي الْإِسْلَامِ كَانَتْ لَهُ نُورًا يَوْمَ القيامةِ» . رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ"
      },
      {
        "id": 33154,
        "hadith_number": "4460",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Bersuci Bersama Nabi SAW dan Panjang Rambutnya",
        "perawi_melayu": "Aisyah رضي الله عنها",
        "english_text": "And from `Aishah (radiallahu anha), she said: I used to bathe with the Messenger of Allah (peace and blessings be upon him) from one vessel. And he had hair above the head's peak and below the top of the head.  Narrated by al-Tirmidhi and an-Nasa'i",
        "malay_translation": "Daripada Aisyah رضي الله عنها, beliau berkata: Saya pernah mandi bersama Rasulullah SAW menggunakan satu bekas air yang sama.  Baginda mempunyai rambut di atas puncak kepala dan di bawah bahagian atas kepala.  Riwayat al-Tirmidhi dan an-Nasa'i.",
        "arabic_text": "وَعَنْ عَائِشَةَ قَالَتْ: كُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ إِنَاءٍ وَاحِدٍ وَكَانَ لَهُ شَعْرٌ فَوْقَ الْجُمَّةِ وَدُونَ الوفرة. رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ"
      },
      {
        "id": 33155,
        "hadith_number": "4461",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kebaikan Seorang Lelaki, Khuraim Al-Asadi, dan Perbaikkan Penampilannya",
        "perawi_melayu": "Ibnul Hanzhaliyyah, seorang sahabat Nabi SAW",
        "english_text": "And from Ibnul Hanzhaliyyah, a man from among the companions of the Prophet SAW, he said: The Prophet SAW said: \"Excellent is the man, Khuraim Al-Asadi, were it not for the length of his beard and the exposing of his trousers.\" This reached Khuraim, so he took a razor and cut his beard to his ears and raised his trousers to the middle of his legs. Narrated by Abu Dawud.",
        "malay_translation": "Dan daripada Ibnul Hanzhaliyyah, seorang lelaki daripada kalangan sahabat Nabi SAW, beliau berkata: Nabi SAW bersabda: \"Bagus sungguh lelaki itu, Khuraim Al-Asadi, sekiranya bukan kerana panjang janggutnya dan kelewatan seluarnya.\" Berita ini sampai kepada Khuraim, lalu dia mengambil pisau cukur dan menggunting janggutnya hingga ke telinga dan mengangkat seluarnya hingga ke pertengahan kakinya. Diriwayatkan oleh Abu Dawud.",
        "arabic_text": "وَعَن ابنِ الحنظليَّةِ رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نِعْمَ الرَّجُلُ خُرَيْمٌ الْأَسْدِيُّ لَوْلَا طُولُ جُمَّتِه وإسبال إزراه» فَبَلَغَ ذَلِكَ خُرَيْمًا فَأَخَذَ شَفْرَةً فَقَطَعَ بِهَا جمته إِلَى أُذُنَيْهِ وَرفع إزراه إِلَى أَنْصَاف سَاقيه. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33156,
        "hadith_number": "4462",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis tentang Menguruskan Haiwan Peliharaan",
        "perawi_melayu": null,
        "english_text": "Daripada Anas r.a., katanya:  Saya ada seekor anak anjing betina.  Maka ibu saya berkata: \"Janganlah aku cukur (potong rambutnya).\" Rasulullah SAW dahulu biasa mengelus dan memegangnya.",
        "malay_translation": "Daripada Anas radhiyallahu 'anhu, beliau berkata: Aku mempunyai seekor anjing betina kecil. Maka ibuku berkata kepadaku: Janganlah kau potong bulu (rambut)nya.  Rasulullah sallallahu 'alaihi wasallam dahulu suka mengelus dan memegangnya.",
        "arabic_text": "وَعَن أنسٍ قَالَ: كَانَتْ لِي ذُؤَابَةٌ فَقَالَتْ لِي أُمِّي: لَا أَجُزُّهَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمُدُّهَا وَيَأْخُذُهَا. رَوَاهُ أَبُو دَاوُدَ"
      },
      {
        "id": 33157,
        "hadith_number": "4463",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Sabar dan Doa bagi Keluarga Ja'far",
        "perawi_melayu": "Abdullah bin Ja'far",
        "english_text": "And from Abdullah bin Ja'far: that the Prophet, peace be upon him, granted respite to the family of Ja'far for three days, then came to them and said, \"Do not weep for my brother after this day.\" Then he said, \"Invoke blessings upon the children of my brother.\" Then they brought us as if we were chicks, and he said, \"Call the barber for me.\" Then he commanded him and he shaved our heads. Narrated by Abu Dawud and An-Nasa'i",
        "malay_translation": "Dan daripada Abdullah bin Ja'far: bahawa Nabi SAW memberi tempoh tiga hari kepada keluarga Ja'far, kemudian datang kepada mereka dan bersabda, \"Janganlah kamu menangis atas saudaraku selepas hari ini.\" Kemudian baginda bersabda lagi, \"Mintalah keberkatan bagi anak-anak saudaraku.\" Kemudian mereka membawa kami seakan-akan kami anak ayam, lalu baginda bersabda, \"Panggil tukang gunting rambut untukku.\" Kemudian baginda memerintahkan dan tukang gunting rambut itu menggunting rambut kepala kami.  Riwayat Abu Dawud dan An-Nasa'i.",
        "arabic_text": "وَعَن عبدِ الله بن جَعْفَرٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمْهَلَ آلَ جَعْفَرٍ ثَلَاثًا ثُمَّ أَتَاهُمْ فَقَالَ: «لَا تَبْكُوا عَلَى أَخِي بَعْدِ الْيَوْمِ» . ثُمَّ قَالَ: «ادْعُوا لِي بَنِي أَخِي» . فَجِيءَ بِنَا كَأَنَّا أَفْرُخٌ فَقَالَ: «ادْعُوا لِي الْحَلَّاقَ» فَأَمَرَهُ فَحَلَقَ رؤوسنا. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ"
      },
      {
        "id": 33158,
        "hadith_number": "4464",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Melakukan Khitan Berlebihan dan Hikmahnya",
        "perawi_melayu": "Diriwayatkan daripada Ummu Atiyyah Al-Ansariyah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ummu Atiyyah Al-Ansariyah: Sesungguhnya seorang wanita melakukan khitan di Madinah. Maka Nabi ﷺ bersabda kepadanya: “Janganlah kamu berlebihan dalam memotong, kerana sesungguhnya yang demikian itu lebih baik bagi wanita dan lebih disukai oleh suami.” Riwayat Abu Daud dan beliau berkata: Hadith ini dhaif dan perawinya majhul (tidak dikenali).",
        "arabic_text": "وَعَن أُمِّ عطيَّةَ الأنصاريَّةِ: أنَّ امْرَأَة كَانَت تختن بِالْمَدِينَةِ. فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تُنْهِكِي فَإِنَّ ذَلِكَ أَحْظَى لِلْمَرْأَةِ وَأَحَبُّ إِلَى الْبَعْلِ» . رَوَاهُ أَبُو دَاوُدَ وَقَالَ: هَذَا الْحَدِيثُ ضَعِيفٌ وَرَاوِيه مَجْهُول"
      },
      {
        "id": 33159,
        "hadith_number": "4465",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keharaman Pewarnaan Henna dan Pendapat 'Aisyah",
        "perawi_melayu": "Daripada Karimah binti Hammam",
        "english_text": "Daripada Karimah binti Hammam, bahawa seorang wanita bertanya kepada 'Aisyah tentang pewarna henna. 'Aisyah berkata: Tidak mengapa, tetapi aku benci baunya. Kekasihku juga membencinya.",
        "malay_translation": "Daripada Karimah binti Hammam, bahawa seorang wanita bertanya kepada 'Aisyah tentang pewarnaan henna. 'Aisyah menjawab, \"Tidak mengapa, tetapi aku membenci baunya. Kekasihku juga membencinya.\" (Riwayat Imam Abu Daud dan Imam Nasai)",
        "arabic_text": "وَعَنْ كَرِيمَةَ بِنْتِ هَمَّامٍ: أَنَّ امْرَأَةً سَأَلَتْ عائشةَ عَنْ خِضَابِ الْحِنَّاءِ فَقَالَتْ: لَا بَأْسَ وَلَكِنِّي أَكْرَهُهُ كَانَ حَبِيبِي يَكْرَهُ رِيحَهُ. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ"
      },
      {
        "id": 33160,
        "hadith_number": "4466",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perjanjian dan Tindakan Hindun binti Utbah",
        "perawi_melayu": "Aisyah",
        "english_text": "Daripada Aisyah r.a. bahawa Hindun binti Utbah berkata, \"Wahai Rasulullah, berikanlah aku perjanjian.\" Baginda SAW menjawab, \"Aku tidak akan memberikanmu perjanjian sehinggalah engkau mengubah kedua-dua telapak tanganmu. (Perbuatan itu) seakan-akan telapak tangan seekor binatang buas.\" Diriwayatkan oleh Imam Abu Dawud.",
        "malay_translation": "Daripada Aisyah r.a. bahawa Hindun binti Utbah berkata, \"Wahai Rasulullah, berikanlah aku perjanjian.\" Baginda SAW menjawab, \"Aku tidak akan memberikanmu perjanjian sehinggalah engkau mengubah kedua-dua telapak tanganmu. (Perbuatan itu) seakan-akan telapak tangan seekor binatang buas.\" Diriwayatkan oleh Imam Abu Dawud.",
        "arabic_text": "وَعَن عائشةَ أَنَّ هِنْدًا بِنْتَ عُتْبَةَ قَالَتْ: يَا نَبِيَّ اللَّهِ بَايِعْنِي فَقَالَ: «لَا أُبَايِعُكِ حَتَّى تُغَيِّرِي كَفَّيْكِ فَكَأَنَّهُمَا كَفَّا سَبُعٍ» . رَوَاهُ أَبُو دَاوُدَ"
      },
      {
        "id": 33161,
        "hadith_number": "4467",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perbuatan Nabi SAW Apabila Wanita Menyampaikan Surat",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "From her [the narrator]: A woman came from behind a screen, holding a book to the Messenger of Allah (peace and blessings be upon him). The Prophet (peace and blessings be upon him) grasped her hand and said, \"I don't know whether it is the hand of a man or a woman?\" She said, \"It is the hand of a woman.\" He said, \"If you were a woman, you would have painted your nails.\" (meaning henna). Reported by Abu Dawud and an-Nasa'i.",
        "malay_translation": "Daripada beliau [perawi]:  Seorang wanita datang dari sebalik tabir, membawa sebuah kitab kepada Rasulullah SAW. Baginda SAW memegang tangannya dan bersabda, \"Aku tidak tahu, adakah ini tangan lelaki atau perempuan?\" Wanita itu menjawab, \"Ini tangan perempuan.\" Baginda SAW bersabda, \"Jika engkau seorang perempuan, nescaya engkau akan mewarnakan kuku-kuku jari engkau.\" (bermaksud menggunakan inai).  Riwayat Imam Abu Dawud dan Imam an-Nasa'i.",
        "arabic_text": "وَعَنْهَا قَالَتْ: أَوَمَتِ امْرَأَةٌ مِنْ وَرَاءِ سِتْرٍ بِيَدِهَا كِتَابٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَبَضَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ فَقَالَ: «مَا أَدْرِي أَيَدُ رَجُلٍ أَمْ يَدُ امْرَأَةٍ؟» قَالَتْ: بَلْ يَدُ امْرَأَةٍ قَالَ: «لَوْ كُنْتِ امْرَأَةً لَغَيَّرْتِ أَظْفَارَكِ» يَعْنِي الْحِنَّاء. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ"
      },
      {
        "id": 33162,
        "hadith_number": "4468",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Terhadap Amalan yang Tidak Sehat",
        "perawi_melayu": "Ibnu Abbas",
        "english_text": "And from Ibn Abbas, he said: \"Cursed are the women who join (in marriage) with their relatives, and those who seek to join with their relatives, and those who have tattoos or body-piercings without a medical reason.\n",
        "malay_translation": "Dan daripada Ibnu Abbas, beliau berkata: \"Dilaknatlah wanita-wanita yang melakukan perhubungan dengan kaum kerabatnya, dan mereka yang berusaha untuk berhubung dengan kaum kerabatnya, dan mereka yang menindik badan atau memasang tatu tanpa sebab perubatan.\"",
        "arabic_text": "وَعَن ابنِ عبَّاسٍ قَالَ: لُعِنَتِ الْوَاصِلَةُ وَالْمُسْتَوْصِلَةُ وَالنَّامِصَةُ وَالْمُتَنَمِّصَةُ وَالْوَاشِمَةُ والمشتوشمة من غير دَاء. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33163,
        "hadith_number": "4469",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Memakai Pakaian Lawan Jantina",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Daripada Abu Hurairah, dia berkata: Rasulullah SAW melaknat lelaki yang memakai pakaian wanita dan wanita yang memakai pakaian lelaki. Diriwayatkan oleh Imam Abu Daud.",
        "malay_translation": "Daripada Abu Hurairah, beliau berkata: Rasulullah SAW melaknat lelaki yang memakai pakaian wanita dan wanita yang memakai pakaian lelaki.  Hadis ini diriwayatkan oleh Imam Abu Daud.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرَّجُلَ يَلْبَسُ لِبْسَةَ الْمَرْأَةِ وَالْمَرْأَةَ تَلْبَسُ لِبْسَةَ الرَّجُلِ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33164,
        "hadith_number": "4470",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Wanita Memakai Kasut (Tidak Sesuai)",
        "perawi_melayu": "Ibn Abi Mulaykah",
        "english_text": "And from Ibn Abi Mulaykah, he said: It was said to `Aishah: A woman wears footwear. She said: Rasulullah shallallahu 'alayhi wasallam has cursed the woman among women who wears footwear. It was narrated by Abu Dawud",
        "malay_translation": "Daripada Ibn Abi Mulaykah, beliau berkata: Ada yang bertanya kepada `Aisyah, \"Seorang wanita memakai kasut.\" Dia menjawab, \"Rasulullah shallallahu 'alayhi wasallam telah mengutuk wanita-wanita yang memakai kasut. Diriwayatkan oleh Abu Dawud.",
        "arabic_text": "وَعَنِ ابْنِ أَبِي مُلَيْكَةَ قَالَ: قِيلَ لِعَائِشَةَ: إِنَّ امْرَأَةً تَلْبَسُ النَّعْلَ قَالَتْ: لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرَّجُلَةَ مِنَ النِّسَاء. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33165,
        "hadith_number": "4471",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penjagaan dan Kasih Sayang Rasulullah SAW terhadap Keluarga",
        "perawi_melayu": "Thawban",
        "english_text": "And it was narrated by Thawban, who said: When Rasulullah SAW travelled, his last meeting with a member of his family was with Fatimah.  Fatimah was the first person he would visit upon his return. He returned from a campaign, and she had hung a curtain or cover over her door. Hasan and Husain, whose hearts were made of silver, had arrived.  He did not enter. She assumed his reluctance was due to what he saw.  She then removed the curtain and unlocked the silver ornaments from the children.  She took them away.  They then went to Rasulullah SAW, crying. He took them from them, and said: \"Thawban, take these to so-and-so.  Verily, my family dislike eating the best of their provisions during their lives in this world.  Thawban, buy Fatimah a necklace made of rope and two bracelets made of ivory.\"",
        "malay_translation": "Dan telah diriwayatkan daripada Thawban, yang berkata: Apabila Rasulullah SAW melakukan perjalanan, pertemuan terakhir baginda dengan ahli keluarganya adalah dengan Fatimah. Fatimah merupakan orang pertama yang akan baginda kunjungi sewaktu kembali. Baginda pulang daripada suatu peperangan, dan Fatimah telah menutup pintu rumahnya dengan langsir atau penutup. Hasan dan Husain, yang mempunyai hati seperti perak, telah berada di sana. Baginda tidak masuk. Fatimah menyangka keraguan baginda disebabkan apa yang baginda lihat. Lalu, Fatimah membuka langsir itu dan membuka ornamen perak dari kanak-kanak itu. Fatimah mengambilnya. Mereka kemudian pergi kepada Rasulullah SAW sambil menangis. Baginda mengambil mereka dan bersabda: \"Thawban, bawalah ini kepada si fulan. Sesungguhnya, ahli keluarga saya tidak menyukai untuk makan makanan terbaik mereka semasa hidup di dunia ini. Thawban, belikan Fatimah satu rantai leher daripada tali dan dua gelang daripada gading.\" ",
        "arabic_text": "وَعَنْ ثَوْبَانَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَافَرَ كَانَ آخِرُ عَهْدِهِ بِإِنْسَانٍ مِنْ أَهْلِهِ فَاطِمَةَ وَأَوَّلُ مَنْ يَدْخُلُ عَلَيْهَا فَاطِمَةَ فَقَدِمَ مِنْ غَزَاةٍ وَقَدْ عَلَّقَتْ مَسْحًا أَوْ سِتْرًا عَلَى بَابِهَا وَحَلَّتِ الْحَسَنَ وَالْحُسَيْنَ قُلْبَيْنِ مِنْ فِضَّةٍ فَقَدِمَ فَلَمْ يَدْخُلْ فَظَنَّتْ أَنَّ مَا مَنَعَهُ أَنْ يَدْخُلَ مَا رَأَى فَهَتَكَتِ السِّتْرَ وَفَكَّتِ الْقُلْبَيْنِ عَنِ الصَّبِيَّيْنِ وَقَطَعَتْهُ مِنْهُمَا فَانْطَلَقَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَبْكِيَانِ فَأَخَذَهُ مِنْهُمَا فَقَالَ: «يَا ثَوْبَانُ اذْهَبْ بِهَذَا إِلَى فُلَانٍ إِنَّ هَؤُلَاءِ أَهْلِي أَكْرَهُ أَنْ يَأْكُلُوا طَيِّبَاتِهِمْ فِي حَيَاتِهِمُ الدُّنْيَا. يَا ثَوْبَانُ اشْتَرِ لِفَاطِمَةَ قِلَادَةً مِنْ عَصْبٍ وَسُوَارَيْنِ مِنْ عَاجٍ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُد"
      },
      {
        "id": 33166,
        "hadith_number": "4472",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kegunaan Penggunaan Kohl (Itimād) Untuk Mempercantik Mata dan Pertumbuhan Rambut",
        "perawi_melayu": "Ibnu Abbas",
        "english_text": "From Ibn 'Abbas that the Prophet, peace and blessings be upon him, said: \"Use kohl (Itimād)  because it brightens the eyesight and promotes hair growth.\"  It was claimed that the Prophet, peace and blessings be upon him, had a kohl container and used it three times each night in this eye and three times in that eye.",
        "malay_translation": "Daripada Ibnu Abbas RA, bahawa Nabi SAW bersabda: \"Gunakan kohl (itimad) kerana ia mencerahkan penglihatan dan merangsang pertumbuhan rambut.\" Dikatakan bahawa Nabi SAW mempunyai bekas kohl dan menggunakannya tiga kali setiap malam pada mata ini dan tiga kali pada mata ini.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «اكْتَحِلُوا بِالْإِثْمِدِ فَإِنَّهُ يَجْلُو الْبَصَرَ وَيُنْبِتُ الشَّعْرَ» . وَزَعَمَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَتْ لَهُ مُكْحُلَةٌ يَكْتَحِلُ بِهَا كُلَّ لَيْلَةٍ ثَلَاثَةً فِي هَذِهِ وَثَلَاثَةً فِي هَذِه. رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 33167,
        "hadith_number": "4473",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Menggunakan Ithmid untuk Kecantikan dan Rawatan Kesihatan",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "From him, he said: The Prophet ﷺ used to apply kohl (ithmid) three times on each eye before sleeping. He said: Indeed, the best remedies for you are bekam, sapu, bloodletting and walking. And the best kohl to use is ithmid, as it brightens the eyesight and grows hair. The best days for bloodletting are the 17th, 19th, and 21st of the month. Whenever the Messenger of Allah ﷺ was taken on his ascension (miraj), he would pass by a gathering of angels, and they would all say, \"Do bloodletting.\"",
        "malay_translation": "Daripadanya, beliau berkata: Rasulullah ﷺ  biasa menggunakan kohl (ithmid) sebanyak tiga kali pada setiap mata sebelum tidur. Baginda bersabda: Sesungguhnya rawatan terbaik untuk kamu ialah bekam, sapu, hirisan darah (hijama) dan berjalan.  Dan kohl terbaik yang hendak digunakan ialah ithmid, kerana ia mencerahkan penglihatan dan menumbuhkan rambut. Hari terbaik untuk melakukan hirisan darah (hijama) ialah hari ke-17, ke-19, dan ke-21 setiap bulan.  Setiap kali Rasulullah ﷺ diangkat (mi'raj),  beliau akan melewati sekumpulan malaikat, dan mereka semua akan berkata, \"Lakukanlah hirisan darah (hijama).\"",
        "arabic_text": "وَعَنْهُ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَكْتَحِلُ قَبْلَ أَنْ يَنَامَ بِالْإِثْمِدِ ثَلَاثًا فِي كُلِّ عَيْنٍ قَالَ: وَقَالَ: «إِنَّ خَيْرَ مَا تَدَاوَيْتُمْ بِهِ اللَّدُودُ وَالسَّعُوطُ وَالْحِجَامَةُ وَالْمَشِيُّ وَخَيْرَ مَا اكْتَحَلْتُمْ بِهِ الْإِثْمِدُ فَإِنَّهُ يَجْلُو الْبَصَرَ وَيُنْبِتُ الشَّعْرَ وَإِنَّ خَيْرَ مَا تَحْتَجِمُونَ فِيهِ يَوْمُ سَبْعَ عَشْرَةَ وَيَوْمُ تِسْعَ عَشْرَةَ وَيَوْمُ إِحْدَى وَعِشْرِينَ» وَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَيْثُ عُرِجَ بِهِ مَا مَرَّ عَلَى مَلَأٍ مِنَ الْمَلَائِكَةِ إِلَّا قَالُوا: عَلَيْكَ بِالْحِجَامَةِ. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ"
      },
      {
        "id": 33168,
        "hadith_number": "4474",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan dan Keizinan Mandi di Tempat Awam (Bilik Mandi)",
        "perawi_melayu": "Aisyah",
        "english_text": "Daripada Aisyah, bahawa Nabi SAW melarang lelaki dan perempuan daripada memasuki bilik mandi, kemudian memberi keringanan kepada lelaki untuk masuk ke bilik mandi dengan memakai kain sarung.",
        "malay_translation": "Daripada Aisyah RA, bahawa Nabi SAW melarang lelaki dan wanita daripada memasuki bilik mandi. Kemudian, Baginda memberikan keringanan kepada lelaki untuk memasuki bilik mandi dengan memakai kain sarung.  Riwayat ini diriwayatkan oleh al-Tirmizi dan Abu Daud.",
        "arabic_text": "وَعَنْ عَائِشَةَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى الرِّجَالَ وَالنِّسَاءَ عَنْ دُخُولِ الْحَمَّامَاتِ ثُمَّ رَخَّصَ لِلرِّجَالِ أَنْ يَدْخُلُوا بِالْمَيَازِرِ. رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد"
      },
      {
        "id": 33169,
        "hadith_number": "4475",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Wanita Menggalkan Pakaian di Luar Rumah Suami",
        "perawi_melayu": null,
        "english_text": "From Abu al-Malih, he said: Women from Hims came to Aisyah. Aisyah asked them, \"From where are you?\" They replied, \"From Syria.\" Aisyah then said, \"Perhaps you are from a land where women go to the bathhouses?\" They replied, \"Yes.\" Aisyah said, \"Then I heard the Messenger of Allah (peace be upon him) say, \"A woman does not remove her clothes outside her husband's house except that she has violated the privacy between her and her Lord.\" And in another narration, \"Outside her home, except that she has violated her privacy between her and Allah, the Exalted and Majestic.\" Narrated by At-Tirmidhi and Abu Dawud",
        "malay_translation": "Daripada Abu al-Malih, beliau berkata: Beberapa wanita dari Hims datang menemui Aisyah. Aisyah bertanya kepada mereka, \"Dari mana kamu datang?\" Mereka menjawab, \"Dari Syria.\" Aisyah kemudian berkata, \"Mungkin kamu dari negeri di mana wanita-wanita pergi ke rumah mandi?\" Mereka menjawab, \"Ya.\" Aisyah berkata, \"Maka aku telah mendengar Rasulullah SAW bersabda, \"Seorang wanita tidak menanggalkan pakaiannya di luar rumah suaminya melainkan dia telah melanggar privasi antara dirinya dengan Tuhannya.\" Dan dalam riwayat lain, \"Di luar rumahnya, melainkan dia telah melanggar privasi antara dirinya dan Allah, Yang Maha Tinggi lagi Maha Mulia.\" Diriwayatkan oleh Imam At-Tirmidhi dan Abu Dawud",
        "arabic_text": "وَعَنْ أَبِي الْمَلِيحِ قَالَ: قَدِمَ عَلَى عَائِشَةَ نِسْوَةٌ مِنْ أَهْلِ حِمْصٍ فَقَالَتْ: مَنْ أَيْنَ أنتنَّ؟ قلنَ: من الشَّامِ فَلَعَلَّكُنَّ مِنَ الْكُورَةِ الَّتِي تَدْخُلُ نِسَاؤُهَا الْحَمَّامَاتِ؟ قُلْنَ: بَلَى قَالَتْ: فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا تَخْلَعُ امْرَأَةٌ ثِيَابَهَا فِي غَيْرِ بَيْتِ زَوْجِهَا إِلَّا هَتَكَتِ السِّتْرَ بَيْنَهَا وَبَيْنَ رَبِّهَا» . وَفِي رِوَايَةٍ: «فِي غيرِ بيتِها إِلا هتكت سترهَا بَيْنَهَا وَبَيْنَ اللَّهِ عَزَّ وَجَلَّ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد"
      },
      {
        "id": 33170,
        "hadith_number": "4476",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kepada Pembukaan Tanah-Tanah Para Bukan Arab & Larangan Penggunaan Bilik Mandi oleh Lelaki & Wanita",
        "perawi_melayu": "Abdullah bin 'Amr",
        "english_text": "Daripada Abdullah bin 'Amr bahawa Rasulullah SAW bersabda: \"Akan dibuka kepadamu tanah kaum bukan Arab, dan engkau akan menemui di dalamnya rumah-rumah yang dipanggil 'hammam', maka janganlah lelaki masuk ke dalamnya melainkan dengan memakai kain penutup, dan lindungilah wanita dari masuk kecuali wanita yang sakit atau nifas.\"",
        "malay_translation": "Daripada Abdullah bin 'Amr bahawa Rasulullah SAW bersabda: \"Akan dibuka kepadamu tanah kaum bukan Arab, dan engkau akan menemui di dalamnya rumah-rumah yang dipanggil 'hammam', maka janganlah lelaki masuk ke dalamnya melainkan dengan memakai kain penutup, dan lindungilah wanita dari masuk ke dalamnya kecuali wanita yang sakit atau dalam keadaan nifas.\"",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: سَتُفْتَحُ لَكُمْ أَرْضُ الْعَجَمِ وَسَتَجِدُونَ فِيهَا بُيُوتًا يُقَالُ لَهَا: الْحَمَّامَاتُ فَلَا يَدْخُلَنَّهَا الرِّجَالُ إِلَّا بِالْأُزُرِ وَامْنَعُوهَا النِّسَاءَ إِلَّا مَرِيضَةً أَوْ نُفَسَاءَ . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33171,
        "hadith_number": "4477",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Masuk Bilik Mandi Tanpa Tuala dan Makan di Meja yang Ada Arak",
        "perawi_melayu": null,
        "english_text": "Narrated Jabir that the Prophet (peace be upon him) said: \"Whoever believes in Allah and the Last Day should not enter the bathhouse without a garment. And whoever believes in Allah and the Last Day should not allow their wives to enter the bathhouse. And whoever believes in Allah and the Last Day should not sit at a table served with wine.\"",
        "malay_translation": "Daripada Jabir, bahawa Nabi SAW bersabda: \"Sesiapa yang beriman kepada Allah dan Hari Akhirat, maka janganlah dia masuk bilik mandi tanpa memakai kain penutup aurat. Dan sesiapa yang beriman kepada Allah dan Hari Akhirat, maka janganlah dia membenarkan isterinya masuk bilik mandi. Dan sesiapa yang beriman kepada Allah dan Hari Akhirat, maka janganlah dia duduk di atas meja makan yang dihidangkan dengan arak.\"",
        "arabic_text": "وَعَنْ جَابِرٌ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا يَدخلِ الحمّامَ بِغَيْر إِزارٍ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا يدْخل حَلِيلَتَهُ الْحَمَّامَ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا يَجْلِسُ عَلَى مَائِدَةٍ تُدَارُ عَلَيْهَا الْخمر» . رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ"
      },
      {
        "id": 33172,
        "hadith_number": "4478",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi Muhammad SAW Tidak Mewarnai Rambutnya",
        "perawi_melayu": "Anas bin Malik RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Thabit, beliau berkata: Anas ditanya tentang celak Nabi SAW, lalu beliau menjawab: Jika aku mahu menghitung uban yang ada di kepala baginda, aku boleh melakukannya. Beliau berkata: Dan baginda tidak mencelak. Dalam riwayat lain ditambahkan: Abu Bakar telah mencelak dengan inai dan katam, dan Umar telah mencelak dengan inai sahaja.",
        "arabic_text": "عَن ثابتٍ قَالَ: سُئِلَ أَنَسٌ عَنْ خِضَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: لَوْ شِئْتَ أَنْ أَعُدَّ شَمَطَاتٍ كُنَّ فِي رَأْسِهِ فَعَلْتُ قَالَ: وَلَمْ يَخْتَضِبْ زَادَ فِي رِوَايَةٍ: وَقَدِ اخْتَضَبَ أَبُو بَكْرٍ بِالْحِنَّاءِ وَالْكَتَمِ وَاخْتَضَبَ عُمَرُ بِالْحِنَّاءِ بحتا"
      },
      {
        "id": 33173,
        "hadith_number": "4479",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Anjuran Mewarnai Janggut dengan Warna Kuning",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Umar RA bahawa beliau mewarnakan janggutnya dengan warna kuning sehingga pakaiannya dipenuhi dengan warna kuning. Lalu ditanya kepadanya: Mengapa kamu mewarnakan dengan warna kuning? Beliau menjawab: Sesungguhnya aku melihat Rasulullah SAW mewarnakan dengannya dan tidak ada sesuatu yang lebih disukai oleh baginda daripada warna tersebut. Baginda juga mewarnakan seluruh pakaiannya sehingga serbannya. (Riwayat Abu Daud dan an-Nasa'i).",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ أَنَّهُ كَانَ يَصْفِّرُ لِحْيَتَهُ بِالصُّفْرَةِ حَتَّى تَمْتَلِئَ ثِيَابُهُ مِنَ الصُّفْرَةِ فَقِيلَ لَهُ: لِمَ تُصْبِغُ بِالصُّفْرَةِ؟ قَالَ: أَنِّي رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْبُغُ بِهَا وَلَمْ يَكُنْ شَيْءٌ أَحَبَّ إِلَيْهِ مِنْهَا وَقد كَانَ يصْبغ ثِيَابَهُ كُلَّهَا حَتَّى عِمَامَتَهُ. رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيّ"
      },
      {
        "id": 33174,
        "hadith_number": "4480",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis tentang Rambut Nabi SAW yang Diwarnakan",
        "perawi_melayu": "Uthman bin Abdullah bin Mawhab",
        "english_text": "Daripada Uthman bin Abdullah bin Mawhab, dia berkata: Aku memasuki rumah Umm Salamah, lalu beliau mengeluarkan seutas rambut Nabi SAW yang berwarna.",
        "malay_translation": "Daripada Uthman bin Abdullah bin Mawhab, dia berkata, \"Aku masuk ke rumah Umm Salamah, lalu beliau mengeluarkan seutas rambut Nabi SAW yang berwarna. Dikatakan bahawa rambut tersebut berwarna.",
        "arabic_text": "وَعَن عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ قَالَ: دَخَلْتُ عَلَى أُمِّ سَلَمَةَ فَأَخْرَجَتْ إِلَيْنَا شَعْرًا مِنْ شَعْرِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مخضوبا. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 33175,
        "hadith_number": "4481",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Membunuh Orang yang Solat dan Pengusiran Lelaki yang Menyerupai Wanita",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah RA, beliau berkata: Seorang lelaki yang menyerupai wanita datang kepada Rasulullah SAW dalam keadaan kedua-dua tangan dan kakinya diwarnai dengan inai. Rasulullah SAW bertanya: “Kenapa dengan orang ini?” Mereka menjawab: “Dia menyerupai wanita.” Maka baginda memerintahkan agar dia diusir ke Naqi'. Lalu dikatakan: “Wahai Rasulullah, tidakkah engkau membunuhnya?” Baginda bersabda: “Sesungguhnya aku dilarang daripada membunuh orang yang solat.” (Riwayat Abu Daud)",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمُخَنَّثٍ قَدْ خَضَبَ يَدَيْهِ وَرِجْلَيْهِ بِالْحِنَّاءِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا بَالُ هَذَا؟» قَالُوا: يَتَشَبَّهُ بِالنِّسَاءِ فَأَمَرَ بِهِ فَنُفِيَ إِلَى النَّقِيعِ. فَقيل: يَا رَسُولَ اللَّهِ أَلَا تَقْتُلُهُ؟ فَقَالَ: «إِنِّي نُهِيتُ عَنْ قَتْلِ الْمُصَلِّينَ» . رَوَاهُ أَبُو دَاوُدَ"
      },
      {
        "id": 33176,
        "hadith_number": "4482",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Memberkati Anak-Anak Kota Mekah",
        "perawi_melayu": "Walid bin 'Aqabah",
        "english_text": "Daripada Walid bin 'Aqabah, dia berkata: Apabila Rasulullah SAW telah membuka Kota Mekah, penduduk Mekah datang kepadanya membawa anak-anak mereka. Baginda mendoakan keberkatan untuk mereka dan menyentuh kepala mereka. Aku juga dibawa kepada Baginda, ketika itu aku masih bayi, dan Baginda tidak menyentuh kepalaku kerana kekhusyukan.",
        "malay_translation": "Daripada Walid bin 'Aqabah, beliau berkata: Apabila Rasulullah SAW telah membuka Kota Mekah, penduduk Mekah datang kepada Baginda membawa anak-anak mereka. Baginda mendoakan keberkatan untuk mereka dan menyentuh kepala mereka. Aku juga dibawa kepada Baginda, ketika itu aku masih dalam keadaan bayi. Baginda tidak menyentuh kepalaku kerana kekhusyukan Baginda pada waktu itu. (Riwayat Imam Abu Daud).",
        "arabic_text": "وَعَن الوليدِ بن عقبةَ قَالَ: لَمَّا فَتَحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ جَعَلَ أَهْلُ مَكَّةَ يَأْتُونَهُ بصبيانهم فيدعو لَهُم بِالْبركَةِ وَيمْسَح رؤوسهم فَجِيءَ بِي إِلَيْهِ وَأَنَا مُخَلَّقٌ فَلَمْ يَمَسَّنِي من أجل الخَلوق. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33177,
        "hadith_number": "4483",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Menghiasi Hari Jumaat",
        "perawi_melayu": "Abu Qatadah",
        "english_text": "And from Abu Qatadah that he said to the Messenger of Allah, peace be upon him: \"I have a gathering on Friday, so should I adorn it?\" The Messenger of Allah, peace be upon him, said: \"Yes, and honour it.\" He said: \"Then Abu Qatadah sometimes adorned it twice a day due to the saying of the Messenger of Allah, peace be upon him, \"Yes, and honour it.\" Narrated by Malik",
        "malay_translation": "Daripada Abu Qatadah, bahawa beliau berkata kepada Rasulullah SAW, \"Saya mempunyai majlis pada hari Jumaat, adakah patut saya menghiasinya?\" Rasulullah SAW menjawab, \"Ya, dan muliakanlah ia.\" Beliau berkata lagi, \"Maka Abu Qatadah kadangkala menghiasinya dua kali sehari kerana sabda Rasulullah SAW, \"Ya, dan muliakanlah ia.\" Diriwayatkan oleh Malik.",
        "arabic_text": "وَعَنْ أَبِي قَتَادَةَ أَنَّهُ قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ لِي جُمَّةً أَفَأُرَجِّلُهَا؟ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نَعَمْ وَأَكْرِمْهَا» قَالَ: فَكَانَ أَبُو قَتَادَةَ رُبَّمَا دَهَنَهَا فِي الْيَوْمِ مَرَّتَيْنِ مِنْ أَجْلِ قَوْلُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نِعْمَ وَأَكْرمهَا» . رَوَاهُ مَالك"
      },
      {
        "id": 33178,
        "hadith_number": "4484",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menyerupai Gaya Rambut Yahudi",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada al-Hajjaj bin Hassan, beliau berkata: Kami masuk menemui Anas bin Malik, lalu saudara perempuanku al-Mughirah menceritakan kepadaku, katanya: Kamu pada hari itu seorang budak dan kamu mempunyai dua tanduk atau dua tocang. Lalu beliau (Anas) mengusap kepalamu dan memberkatimu serta berkata: \"Cukur atau pendekkanlah kedua-duanya, kerana ini adalah gaya orang Yahudi.\" (Riwayat Abu Daud)",
        "arabic_text": "وَعَن الحجاح بْنِ حَسَّانَ قَالَ دَخَلْنَا عَلَى أَنَسِ بْنِ مَالك فَحَدَّثَتْنِي أُخْتِي الْمُغِيرَةُ قَالَتْ: وَأَنْتَ يَوْمَئِذٍ غُلَامٌ وَلَكَ قَرْنَانِ أَوْ قُصَّتَانِ فَمَسَحَ رَأْسَكَ وَبَرَّكَ عَلَيْكَ وَقَالَ: «احْلِقُوا هَذَيْنِ أَوْ قُصُّوهُمَا فَإِنَّ هَذَا زِيُّ الْيَهُود» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33179,
        "hadith_number": "4485",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Wanita Menggunting Rambut Kepala",
        "perawi_melayu": "Ali bin Abi Talib r.a.",
        "english_text": "Dari Ali bin Abi Talib r.a., baginda bersabda: Rasulullah SAW melarang wanita menggunting rambut kepala mereka.",
        "malay_translation": "Daripada Ali bin Abi Talib r.a., baginda berkata: Rasulullah SAW melarang wanita daripada menggunting rambut kepala mereka.  Hadis ini diriwayatkan oleh Imam Nasai.",
        "arabic_text": "وَعَنْ عَلِيٍّ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تَحْلِقَ الْمَرْأَةُ رَأْسَهَا. رَوَاهُ النَّسَائِيُّ"
      },
      {
        "id": 33180,
        "hadith_number": "4486",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penampilan Diri yang Baik di Masjid",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada 'Ata' bin Yasar berkata: Rasulullah SAW berada di dalam masjid, lalu masuk seorang lelaki dengan rambut dan janggut yang kusut. Rasulullah SAW memberi isyarat kepadanya dengan tangannya seolah-olah menyuruhnya membetulkan rambut dan janggutnya. Lelaki itu pun melakukannya, kemudian kembali. Rasulullah SAW bersabda: 'Bukankah ini lebih baik daripada seseorang datang dengan rambut yang kusut seolah-olah dia syaitan?' (Riwayat Malik)",
        "arabic_text": "وَعَن عطاءِ بن يسارٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ فَدَخَلَ رَجُلٌ ثَائِرُ الرَّأْسِ وَاللِّحْيَةِ فَأَشَارَ إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ كَأَنَّهُ يَأْمُرُهُ بِإِصْلَاحِ شَعْرِهِ وَلِحْيَتِهِ فَفَعَلَ ثُمَّ رَجَعَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَلَيْسَ هَذَا خَيْرًا مِنْ أَنْ يَأْتِيَ أَحَدُكُمْ وَهُوَ ثَائِرُ الرَّأْسِ كَأَنَّهُ شَيْطَان» . رَوَاهُ مَالك"
      },
      {
        "id": 33181,
        "hadith_number": "4487",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kebersihan dan Keindahan dalam Rumah",
        "perawi_melayu": "Ibnul Musayyib",
        "english_text": "And it was narrated from Ibnul Musayyib that he was heard saying: \"Indeed, Allah is suci dan mulia, dan Dia menyukai hal-hal yang suci. Allah juga adalah bersih, dan Dia menyukai kebersihan. Allah adalah pemurah, dan Dia menyukai kemurahan hati. Allah adalah pemurah, dan Dia menyukai pemberian. Oleh itu, peliharalah kebersihan halaman rumah kamu. Dan janganlah kamu menyerupai orang Yahudi. Kemudian, saya menyampaikan hal ini kepada para Muhajirin Mismar, lalu dia berkata: \"Amir bin Saad telah meriwayatkan dari ayahnya dari Nabi SAW sebanding dengannya, kecuali beliau telah bersabda: \"Bersihkanlah halaman rumah kamu.\",",
        "malay_translation": "Dan daripada Ibnul Musayyib, didengar beliau berkata: Sesungguhnya Allah Maha Suci dan Mulia, dan Dia menyukai perkara-perkara yang suci. Allah juga Maha Bersih dan menyukai kebersihan. Allah Maha Pemurah dan menyukai kemurahan hati. Allah Maha Pemurah dan menyukai pemberian. Oleh itu, peliharalah kebersihan halaman rumah kamu dan jauhilah menyerupai amalan orang Yahudi. Kemudian, saya telah menyampaikan hal ini kepada para Muhajirin Mismar, lalu beliau berkata: \"Amir bin Saad telah meriwayatkan dari bapanya daripada Nabi SAW dengan hadis yang serupa, kecuali Nabi SAW bersabda: \"Bersihkanlah halaman rumah kamu.\"",
        "arabic_text": "وَعَن ابنِ الْمسيب سُمِعَ يَقُولُ: إِنَّ اللَّهَ طَيِّبٌ يُحِبُّ الطِّيبَ نَظِيفٌ يُحِبُّ النَّظَافَةَ كَرِيمٌ يُحِبُّ الْكَرَمَ جَوَادٌ يُحِبُّ الْجُودَ فَنَظِّفُوا أُرَاهُ قَالَ: أَفْنِيَتَكُمْ وَلَا تشبَّهوا باليهود قَالَ: فذكرتُ ذَلِك لمهاجرين مِسْمَارٍ فَقَالَ: حَدَّثَنِيهِ عَامِرُ بْنُ سَعْدٍ عَنْ أَبِيهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ إِلَّا أَنَّهُ قَالَ: «نَظِّفُوا أَفْنِيتَكُمْ» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 33182,
        "hadith_number": "4488",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Nabi Ibrahim a.s. dalam Keramahan, Sunnah dan Ketabahan",
        "perawi_melayu": null,
        "english_text": "Dari Yahya bin Said, bahawa dia mendengar Said bin al-Musayib berkata: Ibrahim, Khalilullah, adalah orang pertama yang menjamu tetamu, orang pertama yang melakukan sunat, orang pertama yang mencukur janggut, dan orang pertama yang melihat uban. Lalu dia berkata, \"Ya Tuhanku, apakah ini?\" Tuhan Yang Maha Suci dan Maha Tinggi berfirman, \"Keteguhan, wahai Ibrahim.\" Dia berkata, \"Ya Tuhanku, tambahkanlah kepadaku keteguhan.\" Dikeluarkan oleh Malik.",
        "malay_translation": "Dari Yahya bin Said, bahawa beliau mendengar Said bin al-Musayib berkata: Ibrahim, Khalilullah, adalah orang pertama di antara manusia yang menjamu tetamu, orang pertama yang bersunat, orang pertama yang mencukur janggut, dan orang pertama yang melihat uban. Lalu beliau berkata, “Ya Tuhanku, apakah ini?” Tuhan Yang Maha Suci dan Maha Tinggi berfirman, “Keteguhan, wahai Ibrahim.” Beliau berkata, “Ya Tuhanku, tambahkanlah kepadaku keteguhan.” Diriwayatkan oleh Malik.",
        "arabic_text": "وَعَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ يَقُولُ: كَانَ إِبْرَاهِيمُ خَلِيلُ الرَّحْمَنِ أوَّلَ النَّاس ضيَّف الضَّيْف وَأَوَّلَ النَّاسِ اخْتَتَنَ وَأَوَّلَ النَّاسِ قَصَّ شَارِبَهُ وَأَوَّلَ النَّاسِ رَأَى الشَّيْبَ فَقَالَ: يَا رَبِّ: مَا هَذَا؟ قَالَ الرَّبُّ تَبَارَكَ وَتَعَالَى: وَقَارٌ يَا إِبْرَاهِيمُ قَالَ: رَبِّ زِدْنِي وَقَارًا. رَوَاهُ مَالك"
      },
      {
        "id": 33183,
        "hadith_number": "4489",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Malaikat Masuk Rumah yang Ada Anjing dan Patung",
        "perawi_melayu": null,
        "english_text": "Daripada Abu Talhah, dia berkata: Nabi SAW bersabda: \"Malaikat tidak masuk ke rumah yang ada anjing dan patung.\"",
        "malay_translation": "Daripada Abu Talhah, beliau berkata: Rasulullah SAW bersabda, \"Malaikat tidak akan masuk ke rumah yang terdapat anjing dan patung.\" ",
        "arabic_text": "عَن أبي طَلْحَة قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَدْخُلُ الْمَلَائِكَةُ بَيْتًا فِيهِ كَلْبٌ وَلَا تصاوير»"
      },
      {
        "id": 33184,
        "hadith_number": "4490",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Malaikat Jibril Tidak Masuk Rumah yang Ada Anjing atau Gambar",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Abbas, daripada Maimunah: Sesungguhnya Rasulullah SAW pada suatu pagi berasa sugul dan bersabda: “Sesungguhnya Jibril telah berjanji untuk bertemu denganku malam ini, tetapi dia tidak menemuiku. Demi Allah, dia tidak pernah memungkiri janjiku.” Kemudian terlintas di fikiran baginda tentang anak anjing di bawah khemahnya. Baginda memerintahkan supaya ia dikeluarkan. Kemudian baginda mengambil air dengan tangannya dan menyiram tempat itu. Apabila petang, Jibril menemuinya dan berkata: “Kamu telah berjanji untuk bertemu denganku malam tadi.” Baginda bersabda: “Benar, tetapi kami tidak memasuki rumah yang ada anjing atau gambar.” Maka pada pagi itu Rasulullah SAW memerintahkan supaya anjing-anjing dibunuh, sehingga baginda memerintahkan supaya dibunuh anjing kebun yang kecil dan meninggalkan anjing kebun yang besar. (Riwayat Muslim)",
        "arabic_text": "وَعَن ابنِ عبَّاسٍ عَنْ مَيْمُونَةَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أصبحَ يَوْمًا واجماً وَقَالَ: «إِنَّ جِبْرِيلَ كَانَ وَعَدَنِي أَنْ يَلْقَانِيَ اللَّيْلَةَ فَلَمْ يَلْقَنِي أَمَ وَاللَّهِ مَا أَخْلَفَنِي» . ثُمَّ وَقَعَ فِي نَفْسِهِ جِرْوُ كَلْبٍ تَحْتَ فُسْطَاطٍ لَهُ فَأَمَرَ بِهِ فَأُخْرِجَ ثُمَّ أَخَذَ بيدِه مَاء فنضحَ مَكَانَهُ فَلَمَّا أَمْسَى لقِيه جِبْرِيلَ فَقَالَ: «لَقَدْ كُنْتَ وَعَدْتَنِي أَنْ تَلْقَانِي الْبَارِحَةَ» . قَالَ: أَجَلْ وَلَكِنَّا لَا نَدْخُلُ بَيْتًا فِيهِ كَلْبٌ وَلَا صُورَةٌ فَأَصْبَحَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَئِذٍ فَأَمَرَ بِقَتْلِ الْكلاب حَتَّى إِنه يَأْمر بقتل الْكَلْب الْحَائِطِ الصَّغِيرِ وَيَتْرُكُ كَلْبَ الْحَائِطِ الْكَبِيرِ. رَوَاهُ مُسلم"
      },
      {
        "id": 33185,
        "hadith_number": "4491",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menyimpan Barang yang Mengandung Gambar Patung di Rumah Nabi SAW",
        "perawi_melayu": "Aisyah RA",
        "english_text": "Dari Aisyah RA, bahawa Nabi SAW tidak pernah membiarkan sebarang barang yang mempunyai ukiran patung di rumahnya melainkan ia akan dimusnahkannya. Diriwayatkan oleh al-Bukhari.",
        "malay_translation": "Daripada Aisyah رضي الله عنها, bahawa Nabi SAW tidak pernah meninggalkan apa-apa benda yang mempunyai ukiran patung di rumahnya melainkan akan dihancurkannya. Ia diriwayatkan oleh al-Bukhari.",
        "arabic_text": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَكُنْ يَتْرُكُ فِي بَيْتِهِ شَيْئًا فِيهِ تَصَالِيبُ إِلَّا نَقَضَهُ. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 33186,
        "hadith_number": "4492",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menggambar dan Menghias dengan Gambaran pada Perabot",
        "perawi_melayu": null,
        "english_text": null,
        "malay_translation": "Daripadanya (perawi), bahawa dia membeli sebuah nampuq (sejenis tikar atau alas duduk) yang bergambar.  Apabila Rasulullah SAW melihatnya, baginda berdiri di pintu, tidak masuk ke dalam.  Maka, aku (perawi) dapat melihat keengganan di wajah baginda. Lalu, aku berkata, \"Wahai Rasulullah, aku bertaubat kepada Allah dan Rasul-Nya. Apakah dosaku?\" Baginda SAW bertanya, \"Apa masalah nampuq ini?\" Aku menjawab, \"Aku membelinya untukmu, agar engkau duduk dan bersandar di atasnya.\" Rasulullah SAW menjawab, \"Sesungguhnya ahli-ahli gambar ini akan diadzab pada hari kiamat dan mereka akan disuruh, \"Hidupkan apa yang kamu ciptakan.\"  Baginda SAW juga berkata, \"Sesungguhnya rumah yang mengandungi gambar tidak dimasuki malaikat.\" ",
        "arabic_text": "وَعَنْهَا أَنَّهَا اشْتَرَتْ نُمْرُقَةً فِيهَا تَصَاوِيرُ فَلَمَّا رَآهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ عَلَى الْبَابِ فَلَمْ يَدْخُلْ فَعَرَفْتُ فِي وَجْهِهِ الْكَرَاهِيَةَ قَالَتْ: فَقُلْتُ: يَا رَسُولَ اللَّهِ أتوبُ إِلى الله وإِلى رَسُوله مَا أذنبتُ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا بَالُ هَذِهِ النُّمْرُقَةِ؟» قُلْتُ: اشْتَرَيْتُهَا لَكَ لِتَقْعُدَ عَلَيْهَا وَتَوَسَّدَهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ أَصْحَابَ هَذِهِ الصُّوَرِ يُعَذَّبُونَ يَوْمَ الْقِيَامَةِ وَيُقَالُ لَهُمْ: أَحْيُوا مَا خَلَقْتُمْ . وَقَالَ: «إِنَّ الْبَيْتَ الَّذِي فِيهِ الصُّورَةُ لَا تدخله الْمَلَائِكَة»"
      },
      {
        "id": 33187,
        "hadith_number": "4493",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perbuatan Nabi SAW Menghapuskan Patung-patung dalam Sebuah Tempat Perlindungan Wanita",
        "perawi_melayu": null,
        "english_text": "Daripada beliau (maksudnya wanita tersebut), dia berkata: \"Aku mempunyai sebuah tempat perlindungan yang mempunyai hiasan patung-patung.  Nabi SAW telah merobohkannya, lalu mengambil dua keping patung tersebut, dan meletakkannya di rumah, yang akan diduduki (oleh orang-orang).\"",
        "malay_translation": "Daripadanya (maksudnya wanita tersebut), dia berkata: \"Aku mempunyai sebuah tempat perlindungan yang mempunyai hiasan patung-patung.  Nabi SAW telah merobohkannya, lalu mengambil dua keping patung tersebut, dan meletakkannya di dalam rumah, yang akan diduduki (oleh orang-orang).\"",
        "arabic_text": "وعنها أَنَّهَا كَانَت عَلَى سَهْوَةٍ لَهَا سِتْرًا فِيهِ تَمَاثِيلُ فَهَتَكَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاتَّخَذَتْ مِنْهُ نُمرُقتين فكانتا فِي الْبَيْت يجلسُ عَلَيْهِم"
      },
      {
        "id": 33188,
        "hadith_number": "4494",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Membalut Batu dan Tanah Liat",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "From her (it is narrated that the Prophet صلى الله عليه وسلم went on a military expedition. He took a piece of cloth and hung it on the door. When he returned, he saw the cloth and pulled it until it tore. Then he said: \"Indeed, Allah has not commanded us to clothe stones and clay.\"",
        "malay_translation": "Daripada beliau (diceritakan bahawa Nabi صلى الله عليه وسلم keluar dalam satu ekspedisi ketenteraan. Baginda mengambil sehelai kain dan menggantungnya di pintu. Apabila baginda kembali, baginda melihat kain itu dan menariknya sehingga koyak. Kemudian baginda bersabda: \"Sesungguhnya Allah tidak memerintahkan kita untuk menutupi batu dan tanah liat.\"",
        "arabic_text": "وَعَنْهَا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ فِي غَزَاةٍ فَأَخَذَتْ نَمَطًا فَسَتَرَتْهُ عَلَى الْبَابِ فَلَمَّا قَدِمَ فَرَأَى النَّمَطَ فَجَذَبَهُ حَتَّى هَتَكَهُ ثُمَّ قَالَ: «إِنَّ اللَّهَ لَمْ يَأْمُرْنَا أَنْ نَكْسُوَ الْحِجَارَةَ وَالطِّينَ»"
      },
      {
        "id": 33189,
        "hadith_number": "4495",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keperitan Azab Golongan Yang Menyerupai Ciptaan Allah pada Hari Kiamat",
        "perawi_melayu": null,
        "english_text": "Daripadanya (iaitu dari sahabat wanita tersebut) daripada Nabi SAW, baginda bersabda: \"Orang yang paling berat azabnya pada hari kiamat ialah orang-orang yang meniru-niru ciptaan Allah.\"",
        "malay_translation": "Daripadanya (daripada sahabat wanita tersebut) daripada Nabi SAW, baginda bersabda: \"Sesungguhnya orang yang paling berat azabnya pada hari kiamat ialah orang-orang yang meniru-niru ciptaan Allah.\"",
        "arabic_text": "وَعَنْهَا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَشَدُّ النَّاسِ عَذَابًا يَوْمَ الْقِيَامَةِ الَّذِينَ يُضَاهُونَ بِخلق الله»"
      },
      {
        "id": 33190,
        "hadith_number": "4496",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kezaliman Penciptaan Manusia yang Menyerupai Allah SWT",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "And from Abu Hurairah, he said: I heard the Messenger of Allah, peace and blessings be upon him, say: Allah, the Exalted, said: \"And who is more unjust than one who claims to create something like My creation? Let them create an atom, or a grain, or a barleycorn.\"",
        "malay_translation": "Dan daripada Abu Hurairah, dia berkata: Aku mendengar Rasulullah SAW bersabda: Allah SWT berfirman: “Dan siapakah yang lebih zalim daripada orang yang mendakwa mencipta sesuatu yang serupa dengan ciptaan-Ku? Biar mereka mencipta zarah, atau biji-bijian, atau sebutir gandum.”",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: قَالَ اللَّهُ تَعَالَى: وَمَنْ أَظْلَمُ مِمَّنْ ذَهَبَ بِخلق كخلقي فلْيخلقوا ذَرَّةً أَوْ لِيَخْلُقُوا حَبَّةً أَوْ شَعِيرَةً"
      },
      {
        "id": 33191,
        "hadith_number": "4497",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Orang yang paling berat azabnya di sisi Allah ialah para pelukis",
        "perawi_melayu": "Abdullah bin Mas'ud",
        "english_text": "And from Abdullah bin Mas'ud, he said: I heard the Messenger of Allah, peace and blessings be upon him, say, \"The most severe punishment among people with Allah is for the painters/illustrators.\"",
        "malay_translation": "Daripada Abdullah bin Mas'ud, beliau berkata: Aku mendengar Rasulullah SAW bersabda, \"Orang yang paling berat azabnya di sisi Allah ialah para pelukis/pereka grafik.\"",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «أَشَدُّ النَّاسِ عَذَابًا عِنْدَ اللَّهِ المصوِّرون»"
      },
      {
        "id": 33192,
        "hadith_number": "4498",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mewujudkan Gambar dan Hukumannya",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "Daripada Ibn Abbas, katanya: \"Aku mendengar Rasulullah SAW bersabda: 'Setiap orang yang melukis gambar di dalam neraka, akan diciptakan satu jiwa untuk setiap gambar yang dilukisnya, dan jiwa itu akan menyeksa pelaku di dalam neraka.'  Ibn Abbas berkata: 'Jika engkau terpaksa melakukannya, lukislah pokok dan sesuatu yang tidak mempunyai roh.'\"",
        "malay_translation": "Daripada Ibn Abbas, katanya: \"Aku mendengar Rasulullah SAW bersabda: 'Setiap orang yang melukis gambar di dalam neraka, akan diciptakan satu jiwa untuk setiap gambar yang dilukisnya, dan jiwa itu akan menyeksa pelaku di dalam neraka.'  Ibn Abbas berkata: 'Jika engkau terpaksa melakukannya, lukislah pokok dan sesuatu yang tidak mempunyai roh.'\" ",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يَقُول: «كُلُّ مُصَوِّرٍ فِي النَّارِ يُجْعَلُ لَهُ بِكُلِّ صُورَةٍ صَوَّرَهَا نَفْسًا فَيُعَذِّبُهُ فِي جَهَنَّمَ» . قَالَ ابْن عَبَّاس: فَإِن كنت لابد فَاعِلًا فَاصْنَعِ الشَّجَرَ وَمَا لَا رُوحَ فِيهِ"
      },
      {
        "id": 33193,
        "hadith_number": "4499",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Berpura-pura Bermimpi, Mengintip Perbualan Orang Lain, dan Membuat Gambar Bernyawa",
        "perawi_melayu": "Tidak Tersedia",
        "english_text": "Not Available",
        "malay_translation": "Daripada beliau (Abu Hurairah R.A.), beliau berkata: Aku mendengar Rasulullah SAW bersabda: \"Sesiapa yang berpura-pura bermimpi (melihat sesuatu dalam mimpi padahal tidak melihatnya), dia akan dibebankan untuk mengikat antara dua biji gandum dan dia tidak akan mampu melakukannya. Sesiapa yang mendengar perbualan suatu kaum sedangkan mereka tidak suka dia mendengar atau mereka menjauhinya, maka akan dituang timah cair ke dalam telinganya pada hari kiamat. Dan sesiapa yang membuat gambar (bernyawa), dia akan diazab dan dibebankan untuk meniupkan ruh ke dalamnya, dan dia tidak akan mampu meniupkannya.\" (Riwayat Bukhari)",
        "arabic_text": "وَعَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ تَحَلَّمَ بِحُلْمٍ لَمْ يَرَهُ كُلِّفَ أَنْ يَعْقِدَ بَيْنَ شَعِيرَتَيْنِ وَلَنْ يَفْعَلَ وَمَنِ اسْتَمَعَ إِلَى حَدِيثِ قَوْمٍ وَهُمْ لَهُ كَارِهُونَ أَوْ يَفِرُّونَ مِنْهُ صُبَّ فِي أُذُنَيْهِ الْآنُكُ يَوْمَ الْقِيَامَةِ وَمَنْ صَوَّرَ صُورَةً عُذِّبَ وَكُلِّفَ أَنْ يَنْفُخَ فِيهَا وَلَيْسَ بِنَافِخٍ» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 33194,
        "hadith_number": "4500",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Bermain Permainan Nardasyir",
        "perawi_melayu": null,
        "english_text": "And from Buraidah that the Prophet, peace and blessings be upon him, said: \"Whoever plays nardasyir, it is as if he has stained his hand in the flesh of a pig and its blood.\"  Muslim narrated it.",
        "malay_translation": "Daripada Buraidah, bahawa Nabi SAW bersabda: \"Sesiapa yang bermain nardasyir, seolah-olah dia telah mencelupkan tangannya ke dalam daging babi dan darahnya.\"  Riwayat Muslim.",
        "arabic_text": "وَعَنْ بُرَيْدَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ لَعِبَ بِالنَّرْدَشِيرِ فَكَأَنَّمَا صَبَغَ يَدَهُ فِي لَحْمِ خِنْزِيرٍ وَدَمِهِ» . رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 33195,
        "hadith_number": "4501",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Malaikat Jibril Tidak Masuk Rumah Kerana Patung, Tirai Bergambar, dan Anjing",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: \"Jibril AS datang kepadaku dan berkata: 'Aku datang kepadamu semalam, dan tidak ada yang menghalangku daripada masuk kecuali kerana di pintu terdapat patung-patung, di dalam rumah terdapat tirai penutup yang padanya terdapat patung-patung, dan di dalam rumah terdapat anjing. Maka perintahkanlah agar kepala patung yang di pintu rumah dipotong sehingga menjadi seperti bentuk pokok, dan perintahkanlah agar tirai itu dipotong dan dijadikan dua bantal yang diletakkan dan dipijak, dan perintahkanlah agar anjing itu dikeluarkan.'\" Maka Rasulullah SAW pun melakukannya. (Riwayat Tirmizi dan Abu Daud)",
        "arabic_text": "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَتَانِي جِبْرِيلُ عَلَيْهِ السَّلَامُ قَالَ: أَتَيْتُكَ الْبَارِحَةَ فَلَمْ يَمْنَعْنِي أَنْ أَكُونَ دَخَلْتُ إِلَّا أَنَّهُ كَانَ عَلَى الْبَابِ تَمَاثِيلُ وَكَانَ فِي الْبَيْتِ قِرَامُ سِتْرٍ فِيهِ تَمَاثِيلُ وَكَانَ فِي الْبَيْتِ كَلْبٌ فَمُرْ بِرَأْسِ التِّمْثَالِ الَّذِي عَلَى بَابِ الْبَيْتِ فَيُقْطَعْ فَيَصِيرُ كَهَيْئَةِ الشَّجَرَةِ وَمُرْ بِالسِّتْرِ فَلْيُقْطَعْ فَلْيُجْعَلْ وِسَادَتَيْنِ مَنْبُوذَتَيْنِ تُوطَآنِ وَمُرْ بِالْكَلْبِ فَلْيُخْرَجْ . فَفَعَلَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد"
      },
      {
        "id": 33196,
        "hadith_number": "4502",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Azab Neraka Bagi Orang yang Sombong, Mensyirikkan Allah, dan Pembuat Patung",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada perawi yang sama (Abu Hurairah R.A.), beliau berkata: Rasulullah SAW bersabda: 'Pada hari kiamat, akan keluar sebatang leher dari neraka yang mempunyai dua mata untuk melihat, dua telinga untuk mendengar, dan lidah untuk berbicara. Ia akan berkata: 'Sesungguhnya aku diwakilkan (untuk menyiksa) tiga golongan: setiap orang yang sombong dan keras kepala, setiap orang yang menyeru tuhan lain selain Allah, dan para pembuat patung.' Riwayat Tirmizi.",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: يَخْرُجُ عُنُقٌ مِنَ النَّارِ يَوْمَ الْقِيَامَةِ لَهَا عَيْنَانِ تُبْصِرَانِ وَأُذُنَانِ تَسْمَعَانِ وَلِسَانٌ يَنْطِقُ يَقُولُ: إِنِّي وُكِّلْتُ بِثَلَاثَةٍ: بِكُلِّ جَبَّارٍ عَنِيدٍ وَكُلِّ مَنْ دَعَا مَعَ اللَّهِ إِلَهًا آخر وبالمصوِّرين . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 33197,
        "hadith_number": "4503",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Minuman Keras, Perjudian, dan Alat Muzik Tertentu",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "From Ibn Abbas, from the Messenger of Allah (peace be upon him), he said: \"Indeed, Allah has forbidden wine, gambling, and (a type of) musical instrument. He said: 'Every intoxicant is haram.' It was said: 'The kubbah is a drum.' Al-Bayhaqi narrated it in Sha'b al-Iman.",
        "malay_translation": "Daripada Ibnu Abbas, daripada Rasulullah SAW, baginda bersabda: \"Sesungguhnya Allah telah mengharamkan minuman keras, perjudian, dan (sejenis) alat muzik. Baginda juga bersabda: 'Setiap minuman keras adalah haram.' Dikatakan, 'Kubbah ialah rebana.' Al-Bayhaqi meriwayatkannya dalam kitab Sha'b al-Iman.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِنَّ اللَّهَ تَعَالَى حَرَّمَ الْخَمْرَ وَالْمَيْسِرَ وَالْكُوبَةَ وَقَالَ: كُلُّ مُسْكِرٍ حَرَامٌ . قِيلَ: الْكُوبَةُ الطَّبْلُ. رَوَاهُ الْبَيْهَقِيُّ فِي شعب الْإِيمَان"
      },
      {
        "id": 33198,
        "hadith_number": "4504",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Minuman Keras dan Perjudian",
        "perawi_melayu": "Ibnu Umar",
        "english_text": "Daripada Ibnu Umar, Rasulullah SAW melarang minuman keras, perjudian, dan minuman keras jenis Ghabīrah. Ghabīrah merupakan minuman yang dibuat oleh orang Habsyah daripada biji-bijian, ia dikenali sebagai sakaraka. Diriwayatkan oleh Imam Abu Dawud.",
        "malay_translation": "Daripada Ibnu Umar, Rasulullah SAW telah melarang minuman keras, perjudian, dan minuman keras jenis *ghabīrah*. *Ghabīrah* merupakan minuman yang dibuat oleh orang Habsyah daripada biji-bijian, ia dikenali sebagai *sakaraka*. Dikisahkan oleh Imam Abu Dawud.",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الْخَمْرِ وَالْمَيْسِرِ وَالْكُوبَةِ والغبيراء. الغبيراء: شَرَابٌ يَعْمَلُهُ الْحَبَشَةُ مِنَ الذُّرَةِ يُقَالُ لَهُ: السكركة. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 33199,
        "hadith_number": "4505",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Bermain Permainan Nard",
        "perawi_melayu": "Abi Musa al-Ash'ari",
        "english_text": "Daripada Abi Musa al-Ash'ari bahawa Rasulullah SAW bersabda: \"Sesiapa yang bermain nard, maka sesungguhnya dia telah menderhaka kepada Allah dan Rasul-Nya.\"",
        "malay_translation": "Daripada Abi Musa al-Ash'ari bahawa Rasulullah SAW bersabda: \"Sesiapa yang bermain nard, maka sesungguhnya dia telah menderhaka kepada Allah dan Rasul-Nya.\"  Riwayat Ahmad dan Abu Daud.",
        "arabic_text": "وَعَنْ أَبِي مُوسَى الْأَشْعَرِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ لَعِبَ بِالنَّرْدِ فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُد"
      },
      {
        "id": 33200,
        "hadith_number": "4506",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perihal Lelaki Mengikuti Burung Merpati",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Dari Abu Hurairah, bahawa Rasulullah SAW melihat seorang lelaki mengejar seekor burung merpati. Baginda bersabda, \"Syaitan mengejar syaitan betina.\"",
        "malay_translation": "Daripada Abu Hurairah RA, bahawa Rasulullah SAW melihat seorang lelaki mengejar seekor burung merpati. Baginda SAW bersabda, \"Syaitan mengejar syaitan betina.\"  Hadis ini diriwayatkan oleh Ahmad, Abu Daud, Ibn Majah dan al-Baihaqi dalam kitab Syu'ab al-Iman.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا يَتْبَعُ حَمَامَةً فَقَالَ: «شَيْطَانٌ يَتْبَعُ شَيْطَانَةً» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَالْبِيهَقِيُّ فِي شُعَبِ الْإِيمَانِ"
      },
      {
        "id": 33201,
        "hadith_number": "4507",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mewujudkan Gambar dan Hukumannya",
        "perawi_melayu": "Said bin Abi al-Hasan",
        "english_text": "Sa’id bin Abi al-Hasan berkata, \"Aku pernah berada di sisi Ibnu Abbas ketika seorang lelaki mendatanginya dan berkata, 'Wahai Ibnu Abbas, sesungguhnya nafkahku hanya dari hasil kerjaku sendiri, dan aku membuat gambar-gambar ini.' Maka Ibnu Abbas berkata, 'Aku tidak akan bercerita kepadamu melainkan apa yang aku dengar dari Rasulullah SAW. Aku mendengarnya bersabda, 'Barangsiapa yang melukis gambar, maka Allah akan mengazabnya sehingga dia meniupkan roh ke dalamnya. Dan dia tidak akan pernah meniupkannya selamanya.' Lelaki itu kemudian sangat menyesal dan wajahnya menjadi pucat. Ia berkata, 'Celakalah kamu! Jika engkau enggan untuk berhenti, maka buatlah gambar pada pokok dan semua benda yang tidak bernyawa.'\" Diriwayatkan oleh al-Bukhari.",
        "malay_translation": "Sa’id bin Abi al-Hasan meriwayatkan, \"Aku pernah bersama Ibnu Abbas.  Ketika itu datang seorang lelaki dan berkata, 'Wahai Ibnu Abbas, rezekiku hanya dari hasil kerjaku sendiri, dan aku membuat lukisan ini.'  Ibnu Abbas menjawab, 'Aku hanya akan menyampaikan kepadamu apa yang aku dengar dari Rasulullah SAW. Aku mendengar baginda bersabda, 'Barang siapa yang melukis gambar, Allah SWT akan mengazabnya sehingga dia meniupkan roh ke dalamnya.  Dan dia tidak akan pernah sanggup meniup roh ke dalamnya selamanya.'  Lelaki itu kemudian merasa sangat menyesal dan wajahnya menjadi pucat. Dia berkata, 'Celakalah engkau! Jika engkau enggan untuk berhenti, maka lukislah gambar pada pokok dan semua benda yang tidak bernyawa.'\"  Diriwayatkan oleh al-Bukhari.",
        "arabic_text": "عَنْ سَعِيدِ بْنِ أَبِي الْحَسَنِ قَالَ: كُنْتُ عِنْدَ ابْنِ عَبَّاسٍ إِذْ جَاءَهُ رَجُلٌ فَقَالَ: يَا ابْنَ عَبَّاسٍ إِنِّي رَجُلٌ إِنَّمَا مَعِيشَتِي مِنْ صَنْعَةِ يَدِي وَإِنِّي أَصْنَعُ هَذِهِ التَّصَاوِيرَ فَقَالَ ابْنُ عَبَّاسٍ: لَا أُحَدِّثُكَ إِلَّا مَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعْتُهُ يَقُولُ: «مَنْ صَوَّرَ صُورَةً فَإِنَّ اللَّهَ مُعَذِّبُهُ حَتَّى يَنْفُخَ فِيهِ الرُّوحَ وَلَيْسَ بِنَافِخٍ فِيهَا أَبَدًا» . فَرَبَا الرَّجُلُ رَبْوَةً شَدِيدَةً وَاصْفَرَّ وَجْهُهُ فَقَالَ: وَيْحَكَ إِنْ أَبَيْتَ إِلَّا أَنْ تَصْنَعَ فَعَلَيْكَ بِهَذَا الشَّجَرِ وَكُلِّ شَيْءٍ لَيْسَ فِيهِ روح. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 33202,
        "hadith_number": "4508",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menggambar di Masjid dan Kemurkaan atas Amalan Orang Kristian",
        "perawi_melayu": "Aisyah",
        "english_text": "And from A'ishah (RA), she said: When the Prophet (SAW) fell ill, some of his wives mentioned a church called Maryam. Umm Salamah and Umm Habibah had gone to Abyssinia. They spoke of its beauty and images. He raised his head and said: \"Those people, when a righteous man dies among them, they build a mosque over his grave and then depict pictures in it. Those are the worst of Allah's creation.\"",
        "malay_translation": "Daripada Aisyah r.a., baginda berkata: Apabila Nabi SAW jatuh sakit, beberapa isterinya menyebut sebuah gereja yang dikenali sebagai Maryam. Umm Salamah dan Umm Habibah telah pergi ke Habsyah. Mereka menceritakan keindahan dan gambar-gambar di dalamnya. Baginda mengangkat kepala dan bersabda: “Mereka itu, apabila seorang lelaki yang soleh meninggal dunia di kalangan mereka, mereka membina sebuah masjid di atas kuburnya dan kemudian melukis gambar-gambar di dalamnya. Mereka itulah golongan manusia yang terburuk ciptaan Allah.”",
        "arabic_text": "وَعَنْ عَائِشَةَ قَالَتْ: لَمَّا اشْتَكَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرَ بَعْضُ نِسَائِهِ كَنِيسَةً يُقَالُ لَهَا: مَارِيَّةُ وَكَانَتْ أُمُّ سَلمَة وَأم حَبِيبَة أتتا أرضَ الْحَبَشَة فَذَكرنَا مِنْ حُسْنِهَا وَتَصَاوِيرَ فِيهَا فَرَفَعَ رَأْسَهُ فَقَالَ: «أُولَئِكَ إِذَا مَاتَ فِيهِمُ الرَّجُلُ الصَّالِحُ بَنَوْا عَلَى قَبْرِهِ مَسْجِدًا ثُمَّ صَوَّرُوا فِيهِ تِلْكَ الصُّور أُولَئِكَ شرار خلق الله»"
      },
      {
        "id": 33203,
        "hadith_number": "4509",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kezaliman Terburuk di Hari Kiamat",
        "perawi_melayu": "Ibnu Abbas",
        "english_text": "Daripada Ibnu Abbas r.a. berkata: Rasulullah SAW bersabda: \"Sesungguhnya, di antara manusia yang paling berat azabnya pada hari kiamat ialah orang yang membunuh seorang nabi atau dibunuh oleh seorang nabi, atau membunuh salah seorang ibu bapanya, dan orang-orang yang melukis gambar-gambar (berhala). Dan juga orang yang berilmu tetapi tidak mengambil manfaat dari ilmunya.\"",
        "malay_translation": "Daripada Ibnu Abbas r.a. berkata, Rasulullah SAW bersabda: \"Sesungguhnya, di antara manusia yang paling berat azabnya pada hari kiamat ialah orang yang membunuh seorang nabi atau dibunuh oleh seorang nabi, atau membunuh salah seorang ibu bapanya, dan orang-orang yang melukis gambar-gambar (berhala). Dan juga orang yang berilmu tetapi tidak mengambil manfaat dari ilmunya.\" ",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَشَدَّ النَّاسِ عَذَابًا يَوْمَ الْقِيَامَةِ مَنْ قَتَلَ نَبِيًّا أَوْ قَتَلَهُ نَبِيٌّ أَوْ قَتَلَ أَحَدَ وَالِدَيْهِ وَالْمُصَوِّرُونَ وعالم لم ينْتَفع بِعِلْمِهِ»"
      },
      {
        "id": 33204,
        "hadith_number": "4510",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Bermain Catur Menurut Ali R.A.",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ali R.A., beliau berkata: \"Catur adalah judi orang bukan Arab (Ajam).\"",
        "arabic_text": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ كَانَ يَقُول: الشطرنج هُوَ ميسر الْأَعَاجِم"
      },
      {
        "id": 33205,
        "hadith_number": "4511",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Bermain Catur",
        "perawi_melayu": null,
        "english_text": "Daripada Ibnu Syihab, bahawa Abu Musa al-Asy'ari berkata: Jangan bermain catur melainkan orang yang sesat.",
        "malay_translation": "Daripada Ibnu Syihab, bahawa Abu Musa al-Asy'ari telah berkata: Jangan bermain catur melainkan orang yang tersalah (berkelakuan sesat/keliru).  Tidak dibenarkan bermain catur melainkan bagi mereka yang tersesat.",
        "arabic_text": "وَعَنِ ابْنِ شِهَابٍ أَنَّ أَبَا مُوسَى الْأَشْعَرِيَّ قَالَ: لَا يلْعَب بالشطرنج إِلَّا خاطئ"
      },
      {
        "id": 33206,
        "hadith_number": "4512",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Bermain Catur",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada beliau (Abu Hurairah RA), bahawa beliau ditanya tentang bermain catur, lalu beliau berkata: “Ia adalah daripada perkara batil dan Allah tidak menyukai perkara batil.” Al-Baihaqi meriwayatkan empat hadis ini dalam Syu'ab al-Iman.",
        "arabic_text": "وَعنهُ أَن سُئِلَ عَنْ لَعِبِ الشَّطْرَنْجِ فَقَالَ: هِيَ مِنَ الْبَاطِلِ وَلَا يُحِبُّ اللَّهُ الْبَاطِلَ. رَوَى الْبَيْهَقِيُّ الْأَحَادِيثَ الْأَرْبَعَةَ فِي شُعَبِ الْإِيمَانِ"
      },
      {
        "id": 33207,
        "hadith_number": "4513",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi Ziarah Rumah dan Kelebihan Kucing",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah RA berkata: Rasulullah SAW pernah mengunjungi rumah suatu kaum Ansar, sedangkan di antara mereka terdapat rumah lain. Hal ini membuat mereka merasa tidak senang, lalu mereka berkata: Wahai Rasulullah, engkau mengunjungi rumah si fulan tetapi tidak mengunjungi rumah kami. Nabi SAW bersabda: \"Kerana di rumah kamu ada anjing.\" Mereka berkata: Sesungguhnya di rumah mereka ada kucing. Nabi SAW bersabda: \"Kucing itu suci (tidak najis).\" (Riwayat ad-Daraqutni)",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْتِي دَارَ قَوْمٍ مِنَ الْأَنْصَارِ وَدُونَهُمْ دَارٌ فَشَقَّ ذَلِكَ عَلَيْهِمْ فَقَالُوا: يَا رَسُولَ اللَّهِ تَأْتِي دَارَ فُلَانٍ وَلَا تَأْتِي دَارَنَا. فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لِأَنَّ فِي دَارِكُمْ كَلْبًا» . قَالُوا: إِنَّ فِي دَارِهِمْ سِنَّوْرًا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «السِّنَّوْرُ سَبْعٌ» . رَوَاهُ الدَّارَقُطْنِيُّ"
      }
    ]
  }
}