{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 142,
    "data": [
      {
        "id": 34073,
        "hadith_number": "5379",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Berdiri di Atas Sebuah Mimbar dan Menyampaikan Ilmu",
        "perawi_melayu": "Hadis ini diriwayatkan oleh Hudzaifah.",
        "english_text": "Narrated Hudzaifah: The Messenger of Allah (ﷺ) stood before us in a station where he left nothing for the time of the Hour to be recounted, but he delivered it, its preservation is for those who remember it, and its loss is for those who forget. My companions know this. And it may indeed be that something of it I forgot. Then I see it and recall it just as a man remembers the face of a man if he was absent from it, then once he sees him, he recognizes him. Agreed upon (by Bukhari and Muslim).",
        "malay_translation": "Daripada Hudzaifah, dia berkata: Rasulullah SAW berdiri di hadapan kami dalam satu keadaan di mana tiada satu pun perkara yang akan berlaku sehingga Hari Kiamat yang tidak disampaikan-Nya, dan ia akan disimpan oleh mereka yang mengingatnya, dan ia akan hilang daripada mereka yang melupakannya. Para sahabatku mengetahui hal ini. Dan mungkin ada perkara yang telah kulupakan. Kemudian aku melihatnya dan mengingatnya sebagaimana seorang lelaki mengenali wajah lelaki itu jika dia tidak kelihatan sebelumnya, maka setelah melihatnya, dia mengenalinya. Disepakati (oleh Bukhari dan Muslim).",
        "arabic_text": "عَن حُذَيْفَة قَالَ: قَامَ فِينَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَقَامًا مَا تَرَكَ شَيْئًا يَكُونُ فِي مقَامه إِلَى قِيَامِ السَّاعَةِ إِلَّا حَدَّثَ بِهِ حَفِظَهُ مَنْ حَفِظَهُ وَنَسِيَهُ مَنْ نَسِيَهُ قَدْ عَلِمَهُ أَصْحَابِي هَؤُلَاءِ وَإِنَّهُ لَيَكُونُ مِنْهُ الشَّيْءُ قَدْ نَسِيتُهُ فَأَرَاهُ فَأَذْكُرُهُ كَمَا يَذْكُرُ الرَّجُلُ وَجْهَ الرَّجُلِ إِذَا غَابَ عَنْهُ ثُمَّ إِذَا رَآهُ عرفه. مُتَّفق عَلَيْهِ"
      },
      {
        "id": 34074,
        "hadith_number": "5380",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Fitnah Menguji Hati Manusia dan Kepentingan Menolaknya",
        "perawi_melayu": null,
        "english_text": "Not Available",
        "malay_translation": "Daripadanya, beliau berkata: Saya mendengar Rasulullah SAW bersabda: Fitnah akan dibentangkan ke atas hati manusia seperti anyaman tikar, sebilah demi sebilah. Maka, sesiapa hati yang meminumnya (menyerapnya), ia akan ditikam dengan cela hitam. Dan sesiapa hati yang menolaknya, ia akan ditikam dengan cela putih. Sehingga ada dua jenis hati, iaitu hati yang putih bersih seperti batu putih, maka ia tidak akan terjejas oleh fitnah selagi langit dan bumi wujud, dan hati yang hitam gelap seperti tembikar yang pecah, tidak mengenali kebaikan dan tidak menolak keburukan melainkan apa yang menyerap dari hawa nafsunya. Riwayat Muslim.",
        "arabic_text": "وَعَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: تُعْرَضُ الْفِتَنُ عَلَى الْقُلُوبِ كَالْحَصِيرِ عُودًا عُودًا فَأَيُّ قَلْبٍ أُشْرِبَهَا نَكَتَتْ فِيهِ نُكْتَةً سَوْدَاءَ وَأَيُّ قَلْبٍ أَنْكَرَهَا نُكِتَتْ فيهِ نُكْتَةٌ بَيْضَاءُ حَتَّى يَصِيرَ عَلَى قَلْبَيْنِ: أَبْيَضُ بِمثل الصَّفَا فَلَا تَضُرُّهُ فِتْنَةٌ مَا دَامَتِ السَّمَاوَاتُ وَالْأَرْضُ وَالْآخَرُ أَسْوَدُ مِرْبَادًّا كَالْكُوزِ مُجْخِيًّا لَا يَعْرِفُ مَعْرُوفًا وَلَا يُنْكِرُ مُنْكَرًا إِلَّا مَا أشْرب من هَوَاهُ رَوَاهُ مُسلم"
      },
      {
        "id": 34075,
        "hadith_number": "5381",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kepercayaan Amanah Yang Hilang Dari Hati",
        "perawi_melayu": " ",
        "english_text": "Not Available",
        "malay_translation": "Dan daripadanya, beliau berkata: Rasulullah SAW telah menceritakan dua hadis kepadaku, dan aku telah melihat salah satunya, dan aku sedang menantikan hadis yang kedua: \"Sesungguhnya amanah itu diturunkan ke dalam akar hati lelaki, kemudian mereka mempelajarinya daripada Al-Quran, kemudian mereka mempelajarinya daripada sunnah.\" Dan beliau memberitahu kami tentang kehilangannya, katanya: \"Lelaki itu tidur sebentar, maka amanah diambil daripada hatinya, bekasnya seperti bekas waktu, kemudian dia tidur sebentar lagi, dan amanah diambil, dan bekasnya seperti bekas waktu. seperti bara yang kamu gelonggorkan di kakimu, lalu terpadam, dan kamu melihatnya telah padam dan tiada apa-apa di dalamnya. Dan orang-orang pada pagi harinya berjual beli, dan hampir tiada seorangpun yang menunaikan amanah. Maka dikatakan, sesungguhnya di kalangan Bani si fulan ada seorang lelaki yang amanah, dan dikatakan kepada lelaki itu, alangkah bijaknya dia, dan alangkah cerdiknya dia, dan alangkah gagahnya dia, tetapi tiada sedikit pun iman di dalam hatinya sebesar biji sawi.\".  Hadis ini telah disepakati (muttafaqun 'alaih) oleh Imam Bukhari dan Muslim.",
        "arabic_text": "وَعَنْهُ قَالَ: حَدَّثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثَيْنِ رَأَيْتُ أَحَدَهُمَا وَأَنَا أَنْتَظِرُ الْآخَرَ: حَدَّثَنَا: «إِنَّ الْأَمَانَةَ نَزَلَتْ فِي جَذْرِ قُلُوبِ الرِّجَالِ ثُمَّ عَلِمُوا مِنَ الْقُرْآنِ ثُمَّ عَلِمُوا مِنَ السُّنَّةِ» . وَحَدَّثَنَا عَنْ رَفْعِهَا قَالَ: يَنَامُ الرَّجُلُ النَّوْمَةَ فَتُقْبَضُ الْأَمَانَةُ مِنْ قَلْبِهِ أَثَرُهَا مِثْلُ أَثَرِ الْوَكْتِ ثُمَّ يَنَامُ النَّوْمَةَ قتقبض فَيَبْقَى أَثَرُهَا مِثْلَ أَثَرِ الْمَجْلِ كَجَمْرٍ دَحْرَجْتَهُ عَلَى رِجْلِكَ فَنَفِطَ فَتَرَاهُ مُنْتَبِرًا وَلَيْسَ فِيهِ شَيْءٌ وَيُصْبِحُ النَّاسُ يَتَبَايَعُونَ وَلَا يَكَادُ أَحَدٌ يُؤَدِّي الْأَمَانَةَ فَيُقَالُ: إِنَّ فِي بَنِي فُلَانٍ رَجُلًا أَمِينًا وَيُقَالُ لِلرَّجُلِ: مَا أَعْقَلَهُ وَمَا أَظْرَفَهُ وَمَا أَجْلَدُهُ وَمَا فِي قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنْ خَرْدَلٍ مِنْ إِيمَانٍ . مُتَّفَقٌ عَلَيْهِ"
      },
      {
        "id": 34076,
        "hadith_number": "5382",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Peringatan Tentang Fitnah dan Kepentingan Berpegang Teguh kepada Ajaran Nabi",
        "perawi_melayu": "Tidak Ada Data",
        "english_text": "And from him, he said: People used to ask the Messenger of Allah صلى الله عليه وسلم about good things, and I asked him about evil, fearing that it would befall me. He said: I said, 'O Messenger of Allah, we were in a state of ignorance and evil, then Allah brought us this good. Is there any evil after this good?' He said, 'Yes.' I said, 'And is there any good after that evil?' He said, 'Yes, and there is smoke within it.' I said, 'And what is its smoke?' He said, 'People who follow other than my Sunnah and are guided by other than my guidance. You will recognize them and disapprove of them.' I said, 'So, is there any evil after that good?' He said, 'Yes, callers to the gates of Hell. Whoever obeys them will be thrown into it.' I said, 'O Messenger of Allah, describe them to us.' He said, 'They are from our skin and speak with our tongues.' I said, 'So, what do you command me if that befalls me?' He said, 'Adhere to the congregation of Muslims and their leader.' I said, 'But if they do not have a congregation or a leader?' He said, 'Withdraw from all those sects, even if it means biting the root of a tree, until death overtakes you while you are in that state.' Agreed upon. And in a narration by Muslim, he said: 'After me, there will be leaders who do not follow my guidance and do not follow my Sunnah. And men whose hearts are the hearts of devils in human bodies will arise amongst them.' Hudhaifah said: I said, 'How should I act, O Messenger of Allah, if I encounter that?' He said, 'Listen to and obey the Amir, even if he strikes your back and takes your wealth, then listen and obey.'",
        "malay_translation": "Dan daripadanya, beliau berkata: Masyarakat pada masa dahulu sering bertanya kepada Rasulullah صلى الله عليه وسلم tentang kebaikan, dan aku bertanya kepadanya tentang kejahatan, kerana takut ia akan menimpaku. Baginda bersabda: Aku bertanya, 'Wahai Rasulullah, kami berada dalam keadaan jahiliah dan kejahatan, kemudian Allah membawa kami kepada kebaikan ini. Adakah terdapat kejahatan selepas kebaikan ini?' Baginda menjawab, 'Ya.' Aku bertanya, 'Dan adakah kebaikan selepas kejahatan itu?' Baginda menjawab, 'Ya, dan terdapat asap di dalamnya.' Aku bertanya, 'Apakah asap itu?' Baginda menjawab, 'Mereka yang mengikuti selain sunnahku dan dipandu selain panduan-Ku. Engkau akan mengenali mereka dan membantahnya.' Aku bertanya, 'Adakah terdapat kejahatan selepas kebaikan itu?' Baginda menjawab, 'Ya, para da'i (penyeru) ke pintu neraka. Sesiapa yang menurut mereka akan dilemparkan ke dalamnya.' Aku bertanya, 'Wahai Rasulullah, gambarkan mereka kepada kami.' Baginda menjawab, 'Mereka adalah daripada golongan kita dan mereka bertutur dengan bahasa kita.' Aku bertanya, 'Maka apakah arahan Engkau jika aku menjumpainya?' Baginda menjawab, 'Berpegang teguhlah dengan jemaah umat Islam dan pemimpin mereka.' Aku bertanya, 'Tetapi jika mereka tidak mempunyai jemaah atau pemimpin?' Baginda menjawab, 'Menjauhkan diri dari semua puak-puak itu, walau sampai menggigit akar pokok, sehingga kematian menjemputmu dalam keadaan itu.' Disepakati. Dan dalam satu riwayat Muslim, beliau berkata: 'Selepasku, akan datang pemimpin-pemimpin yang tidak mengikut panduan-Ku dan tidak mengikut sunnah-Ku. Dan akan muncul lelaki-lelaki yang hatinya adalah hati-hati syaitan dalam tubuh manusia.' Hudhaifah berkata: Aku bertanya, 'Bagaimana aku harus bertindak, wahai Rasulullah, jika aku menjumpainya?' Baginda menjawab, 'Mendengar dan taatlah kepada Amir, walaupun dia memukul punggungmu dan mengambil hartamu, maka dengar dan taati.' ",
        "arabic_text": "وَعَنْهُ قَالَ: كَانَ النَّاسُ يَسْأَلُونَ رَسُول الله صلى الله عَلَيْهِ وَسلم عَن الْخَيْرِ وَكُنْتُ أَسْأَلُهُ عَنِ الشَّرِّ مَخَافَةَ أَنْ يُدْرِكَنِي قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ إِنَّا كُنَّا فِي جَاهِلِيَّةٍ وَشَرٍّ فَجَاءَنَا اللَّهُ بِهَذَا الْخَيْرِ فَهَلْ بَعْدَ هَذَا الْخَيْرِ مِنْ شَرٍّ؟ قَالَ: «نَعَمْ» قُلْتُ: وَهَلْ بَعْدَ ذَلِكَ الشَّرِّ مِنْ خَيْرٍ؟ قَالَ: «نَعَمْ وَفِيهِ دَخَنٌ» . قُلْتُ: وَمَا دَخَنُهُ؟ قَالَ: «قَوْمٌ يَسْتَنُّونَ بِغَيْرِ سُنَّتِي وَيَهْدُونَ بِغَيْرِ هَدْيِي تَعْرِفُ مِنْهُمْ وَتُنْكِرُ» . قُلْتُ: فَهَلْ بَعْدَ ذَلِكَ الْخَيْرِ مِنْ شَرٍّ؟ قَالَ: «نَعَمْ دُعَاةٌ عَلَى أَبْوَابِ جَهَنَّمَ مَنْ أَجَابَهُمْ إِلَيْهَا قَذَفُوهُ فِيهَا» . قُلْتُ: يَا رَسُولَ اللَّهِ صِفْهُمْ لَنَا. قَالَ: «هُمْ مِنْ جِلْدَتِنَا وَيَتَكَلَّمُونَ بِأَلْسِنَتِنَا» . قُلْتُ: فَمَا تَأْمُرُنِي إِنْ أَدْرَكَنِي ذَلِكَ؟ قَالَ: «تَلْزَمُ جَمَاعَةَ الْمُسْلِمِينَ وَإِمَامَهُمْ» . قُلْتُ: فَإِنْ لَمْ يَكُنْ لَهُمْ جَمَاعَةٌ وَلَا إِمَامٌ؟ قَالَ: «فَاعْتَزِلْ تِلْكَ الْفِرَقَ كُلَّهَا وَلَوْ أَنْ تَعَضَّ بِأَصْلِ شَجَرَةٍ حَتَّى يُدْرِكَكَ الْمَوْتُ وَأَنْتَ عَلَى ذَلِكَ» . مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ لِمُسْلِمٍ: قَالَ: «يَكُونُ بَعْدِي أَئِمَّةٌ لَا يَهْتَدُونَ بِهُدَايَ وَلَا يَسْتَنُّونَ بِسُنَتِي وَسَيَقُومُ فِيهِمْ رِجَالٌ قُلُوبُهُمْ قُلُوبُ الشَّيَاطِينِ فِي جُثْمَانِ إِنْسٍ» . قَالَ حُذَيْفَةُ: قُلْتُ: كَيْفَ أَصْنَعُ يَا رَسُولَ اللَّهِ إِنْ أَدْرَكْتُ ذَلِكَ؟ قَالَ: تَسْمَعُ وَتُطِيعُ الْأَمِيرَ وَإِنْ ضَرَبَ ظهرك وَأخذ مَالك فاسمع وأطع"
      },
      {
        "id": 34077,
        "hadith_number": "5383",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Segera Lakukan Amalan Sebelum Datangnya Fitnah",
        "perawi_melayu": "Abi Hurairah",
        "english_text": "And from Abi Hurairah, he said: The Messenger of Allah, peace and blessings be upon him, said, \"Segera lakukan amal, karena fitnah datang seperti potongan malam yang gelap.  Seseorang di pagi hari beriman, tetapi di malam hari menjadi kafir;  di malam hari beriman, tetapi di pagi hari menjadi kafir. Dia menjual agamanya dengan sedikit harta dunia.\"  Muslim meriwayatkannya.",
        "malay_translation": "Dan daripada Abu Hurairah, beliau berkata: Rasulullah SAW bersabda, \"Segera lakukan amal-amal soleh kerana fitnah datang seperti potongan malam yang gelap gulita. Seseorang pada waktu pagi beriman, tetapi pada waktu petang menjadi kafir; pada waktu petang beriman, tetapi pada waktu pagi menjadi kafir. Dia menjual agamanya dengan sedikit harta dunia.\"  Muslim meriwayatkannya.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم: «بَادرُوا بِالْأَعْمَالِ فِتناً كَقِطَعِ اللَّيْلِ الْمُظْلِمِ يُصْبِحُ الرَّجُلُ مُؤْمِنًا وَيُمْسِي كَافِرًا وَيُمْسِي مُؤْمِنًا وَيُصْبِحُ كَافِرًا يَبِيعُ دِينَهُ بِعرْض من الدُّنْيَا» . رَوَاهُ مُسلم"
      },
      {
        "id": 34078,
        "hadith_number": "5384",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Peringatan Tentang Fitnah dan Mencari Tempat Selamat",
        "perawi_melayu": null,
        "english_text": null,
        "malay_translation": "Daripadanya, baginda bersabda, \"Sesungguhnya akan datang fitnah. Orang yang duduk di dalamnya lebih baik daripada orang yang berdiri, dan orang yang berdiri lebih baik daripada orang yang berjalan, dan orang yang berjalan lebih baik daripada orang yang berlari. Barangsiapa yang berkesempatan untuk menangkisnya, hendaklah dia menangkisnya. Dan barangsiapa yang mendapati tempat perlindungan atau perlindungan, hendaklah dia berlindung kepadanya.\"  Disepakati. Dan dalam satu riwayat Muslim, baginda bersabda, \"Akan datang fitnah. Orang yang tidur di dalamnya lebih baik daripada orang yang terjaga, dan orang yang terjaga lebih baik daripada orang yang berdiri, dan orang yang berdiri lebih baik daripada orang yang berlari. Barangsiapa yang mendapati tempat perlindungan atau perlindungan, hendaklah dia berlindung kepadanya.\"",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «سَتَكُونُ فِتَنٌ الْقَاعِدُ فِيهَا خَيْرٌ مِنَ الْقَائِمِ وَالْقَائِمُ فِيهَا خَيْرٌ من الْمَاشِي والماشي فِيهِ خَيْرٌ مِنَ السَّاعِي مَنْ تَشَرَّفَ لَهَا تَسْتَشْرِفْهُ فَمن وجد ملْجأ أَو معَاذًا فليَعُذْ بِهِ» . مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ لِمُسْلِمٍ: قَالَ: «تَكُونُ فِتْنَةٌ النَّائِمُ فِيهَا خَيْرٌ مِنَ الْيَقْظَانِ واليقظانُ خَيْرٌ مِنَ الْقَائِمِ وَالْقَائِمُ فِيهَا خَيْرٌ مِنَ السَّاعِي فَمن وجد ملْجأ أومعاذا فليستعذ بِهِ»"
      },
      {
        "id": 34079,
        "hadith_number": "5385",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Fitnah Akan Datang dan Cara Menghindarinya",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Bakrah RA, beliau berkata: Rasulullah SAW bersabda: “Sesungguhnya akan terjadi fitnah. Ketahuilah, kemudian akan terjadi fitnah. Ketahuilah, kemudian akan terjadi fitnah. Orang yang duduk lebih baik daripada orang yang berjalan di dalamnya, dan orang yang berjalan di dalamnya lebih baik daripada orang yang berusaha kepadanya. Ketahuilah, apabila ia terjadi, maka sesiapa yang mempunyai unta hendaklah dia pergi kepada untanya, sesiapa yang mempunyai kambing hendaklah dia pergi kepada kambingnya, dan sesiapa yang mempunyai tanah hendaklah dia pergi kepada tanahnya.” Seorang lelaki bertanya: Wahai Rasulullah, bagaimana pendapatmu tentang orang yang tidak mempunyai unta, tidak mempunyai kambing, dan tidak mempunyai tanah? Baginda bersabda: “Hendaklah dia menuju kepada pedangnya lalu mematahkannya pada matanya dengan batu, kemudian hendaklah dia menyelamatkan diri jika dia mampu menyelamatkan diri. Ya Allah, adakah aku telah menyampaikan?” Baginda mengulanginya sebanyak tiga kali. Kemudian seorang lelaki bertanya: Wahai Rasulullah, bagaimana pendapatmu jika aku dipaksa sehingga aku dibawa ke salah satu saf lalu seorang lelaki memukulku dengan pedangnya atau datang panah lalu membunuhku? Baginda bersabda: “Dia akan menanggung dosanya dan dosamu, dan dia akan menjadi ahli neraka.” (Riwayat Muslim)",
        "arabic_text": "وَعَنْ أَبِي بَكْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّهَا سَتَكُونُ فِتَنٌ أَلَا ثُمَّ تَكُونُ فِتنٌ أَلا ثمَّ تكونُ فتنةٌ القاعدُ خَيْرٌ مِنَ الْمَاشِي فِيهَا وَالْمَاشِي فِيهَا خَيْرٌ مِنَ السَّاعِي إِلَيْهَا أَلَا فَإِذَا وَقَعَتْ فَمَنْ كَانَ لَهُ إِبل فَلْيَلْحَقْ بِإِبِلِهِ وَمَنْ كَانَ لَهُ غَنَمٌ فَلْيَلْحَقْ بغنمه وَمن كَانَت لَهُ أرضٌ فَلْيَلْحَقْ بِأَرْضِهِ» فَقَالَ رَجُلٌ: يَا رَسُولَ اللَّهِ أَرَأَيْتَ مَنْ لَمْ يَكُنْ لَهُ إِبِلٌ وَلَا غَنَمٌ وَلَا أَرْضٌ؟ قَالَ: «يَعْمِدُ إِلَى سَيْفِهِ فَيَدُقُّ عَلَى حَدِّهِ بِحَجَرٍ ثُمَّ لِيَنْجُ إِنِ اسْتَطَاعَ النَّجَاءَ اللَّهُمَّ هَلْ بَلَّغْتُ؟» ثَلَاثًا فَقَالَ: رَجُلٌ: يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ أُكْرِهْتُ حَتَّى ينْطَلق بِي إِلَى أحدالصفين فَضَرَبَنِي رَجُلٌ بِسَيْفِهِ أَوْ يَجِيءُ سَهْمٌ فَيَقْتُلُنِي؟ قَالَ: «يَبُوءُ بِإِثْمِهِ وَإِثْمِكَ وَيَكُونُ مِنْ أَصْحَابِ النَّار» رَوَاهُ مُسلم"
      },
      {
        "id": 34080,
        "hadith_number": "5386",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Ternak Kambing dan Menjauhi Fitnah",
        "perawi_melayu": null,
        "english_text": "Daripada Abu Sa'id, dia berkata: Rasulullah SAW bersabda: \"Tidak lama lagi, harta terbaik seorang Muslim adalah kambing yang dia gembala, mengikuti lereng gunung dan tempat turunnya hujan. Ia melarikan diri daripada fitnah dengan agamanya.\"",
        "malay_translation": "Daripada Abu Sa'id, beliau meriwayatkan bahawa Rasulullah SAW bersabda: \"Tidak lama lagi, harta yang terbaik bagi seorang Muslim adalah kambing yang dia gembala, mengikut cerun gunung dan tempat turun hujan. Ia akan melarikan diri dari fitnah dengan agamanya.\"",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يُوشِكُ أَنْ يَكُونَ خيرَ مالِ المسلمِ غنمٌ يتبع بهَا شغف الْجِبَالِ وَمَوَاقِعَ الْقَطْرِ يَفِرُّ بِدِينِهِ مِنَ الْفِتَنِ» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 34081,
        "hadith_number": "5387",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penglihatan Nabi SAW Tentang Fitnah di Madinah",
        "perawi_melayu": "Usamah bin Zaid",
        "english_text": "And from Usamah ibn Zayd, he said: The Prophet, peace be upon him, looked towards one of the highlands of Madinah, and said: Do you see what I see? They said: No. He said: \"Indeed, I see the trials (fitnah) within your houses like the falling of rain.\"",
        "malay_translation": "Dan daripada Usamah bin Zaid, beliau berkata: Nabi SAW memandang ke arah salah satu bukit di Madinah, lalu bersabda: Adakah kamu melihat apa yang aku lihat? Mereka menjawab: Tidak. Baginda bersabda: \"Sesungguhnya aku melihat fitnah di dalam rumah-rumah kamu seperti turunnya hujan.\" ",
        "arabic_text": "وَعَنْ أُسَامَةَ بْنِ زَيْدٍ قَالَ: أَشْرَفَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أُطُمٍ مِنْ آطَامِ الْمَدِينَةِ فَقَالَ: هَلْ تَرَوْنَ مَا أَرَى؟ قَالُوا: لَا. قَالَ: «فَإِنِّي لأرى الْفِتَن خلال بُيُوتكُمْ كوقع الْمَطَر» . مُتَّفق عَلَيْهِ"
      },
      {
        "id": 34082,
        "hadith_number": "5388",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kemusnahan Umatku Akan Terjadi di Tangan Golongan Quraisy",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "From Abu Hurairah, he said: The Messenger of Allah (peace and blessings be upon him) said: \"The destruction of my Ummah will be at the hands of a group from Quraisy.\"",
        "malay_translation": "Daripada Abu Hurairah, beliau berkata: Rasulullah SAW bersabda: \"Kemusnahan umatku akan terjadi di tangan sekelompok orang Quraisy.\"",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَلَكَةُ أُمَّتِي عَلَى يَدَي غِلْمةٍ مِنْ قُرْيشٍ» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 34083,
        "hadith_number": "5389",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kehampiran Waktu, Hilangnya Ilmu, dan Berlakunya Fitnah",
        "perawi_melayu": "Tidak Ada Data",
        "english_text": "Dari beliau (riwayat-nya), baginda Rasulullah SAW bersabda: \"Masa akan semakin dekat, ilmu akan berkurang, fitnah akan merebak, sifat kedekut akan timbul, dan huru-hara akan banyak terjadi.\" Para sahabat bertanya: \"Apakah huru-hara itu?\" Baginda menjawab: \"Pembunuhan.\"",
        "malay_translation": "Daripadanya (riwayat beliau), baginda Rasulullah SAW bersabda: \"Masa akan semakin hampir, ilmu akan berkurang, fitnah akan merebak, sifat kedekut akan timbul, dan huru-hara akan banyak berlaku.\" Para sahabat bertanya: \"Apakah huru-hara itu?\" Baginda menjawab: \"Pembunuhan.\"",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَتَقَارَبُ الزَّمَانُ وَيُقْبَضُ الْعِلَمُ وَتَظْهَرُ الْفِتَنُ وَيُلْقَى الشُّحُّ وَيَكْثُرُ الْهَرْجُ» قَالُوا: وَمَا الْهَرْجُ؟ قَالَ: «الْقَتْلُ» . مُتَّفَقٌ عَلَيْهِ"
      },
      {
        "id": 34084,
        "hadith_number": "5390",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hari Kiamat dan Keadaan Orang yang Membunuh dan Dibunuh",
        "perawi_melayu": "Tidak ada perawi dinyatakan",
        "english_text": "And from him (it is narrated) he said: The Messenger of Allah (peace and blessings of Allah be upon him) said: By the One in Whose hand my soul is, the world will not disappear until a day comes when the killer does not know for what he killed, and the killed does not know for what he was killed. So it was said: How would that be? He said: \"The chaos; the killer and the killed will be in the Fire\". Narrated by Muslim.",
        "malay_translation": "Daripadanya (ia diriwayatkan), baginda bersabda: “Demi Yang jiwaku berada dalam genggaman-Nya, dunia tidak akan lenyap sehingga tiba suatu hari di mana pembunuh tidak mengetahui untuk apa dia membunuh, dan yang dibunuh tidak mengetahui untuk apa dia dibunuh. Maka dikatakan: Bagaimanakah keadaan itu akan berlaku? Baginda bersabda: “Kegoncangan; pembunuh dan yang dibunuh akan berada di dalam Neraka.” Diriwayatkan oleh Imam Muslim.",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: وَالَّذِي نَفْسِي بِيَدِهِ لَا تَذْهَبُ الدُّنْيَا حَتَّى يَأْتِي يَوْمٌ لَا يَدْرِي الْقَاتِلُ فِيمَ قَتَلَ؟ وَلَا الْمَقْتُولُ فِيمَ قُتِلَ؟ فَقِيلَ: كَيْفَ يَكُونُ ذَلِكَ؟ قَالَ: «الْهَرْجُ الْقَاتِلُ وَالْمَقْتُولُ فِي النَّارِ» . رَوَاهُ مُسلم"
      },
      {
        "id": 34085,
        "hadith_number": "5391",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ibadah di Masa Kerusuhan Sebanding Hijrah Kepada-Ku",
        "perawi_melayu": "Ma'qil bin Yasar",
        "english_text": "From Ma'qil bin Yasar, he said: The Messenger of Allah (peace and blessings be upon him) said, \"Worship during times of turmoil is like migrating to me.\" Narrated by Muslim.",
        "malay_translation": "Daripada Ma'qil bin Yasar, beliau berkata: Rasulullah SAW bersabda, \"Ibadah di masa kerusuhan adalah seperti berhijrah kepada-Ku.\" Diriwayatkan oleh Imam Muslim.",
        "arabic_text": "وَعَنْ مَعْقِلِ بْنِ يَسَارٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ «الْعِبَادَةُ فِي الْهَرْجِ كَهِجْرَةٍ إِلَيَّ» . رَوَاهُ مُسلم"
      },
      {
        "id": 34086,
        "hadith_number": "5392",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kesabaran dalam Menghadapi Cabaran",
        "perawi_melayu": "Zubair bin 'Adi",
        "english_text": "And from Zubair bin 'Adi, he said: We came to Anas bin Malik and complained to him about what we were experiencing from Al-Hajjaj. He said, \"Be patient, for no time will come upon you except that which is worse than it until you meet your Lord.\" I heard this from your Prophet, peace be upon him.",
        "malay_translation": "Dan daripada Zubair bin 'Adi, beliau berkata: Kami mendatangi Anas bin Malik dan mengadu kepadanya tentang apa yang kami alami daripada Al-Hajjaj. Beliau berkata, \"Bersabarlah, kerana tiada zaman yang akan menimpa kamu melainkan zaman yang lebih buruk daripada zaman sebelumnya sehingga kamu bertemu dengan Tuhan kamu.\" Saya mendengar ini daripada Nabi kamu, semoga Allah memberi kesejahteraan kepadanya.",
        "arabic_text": "وَعَنِ الزُّبَيْرِ بْنِ عَدِيٍّ قَالَ: أَتَيْنَا أَنَسَ بْنَ مَالِكٍ فَشَكَوْنَا إِلَيْهِ مَا نَلْقَى مِنَ الْحَجَّاجِ. فَقَالَ: «اصْبِرُوا فَإِنَّهُ لَا يَأْتِي عَلَيْكُمْ زمَان إِلَّا الَّذِي بعده أشرمنه حَتَّى تَلْقَوْا رَبَّكُمْ» . سَمِعْتُهُ مِنْ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. رَوَاهُ الْبُخَارِيُّ"
      },
      {
        "id": 34087,
        "hadith_number": "5393",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penjelasan Rasulullah SAW Tentang Pemimpin Fitnah",
        "perawi_melayu": "Hudzaifah",
        "english_text": "From Hudzaifah, he said, By Allah, I do not know whether my companions forgot or they forgot? By Allah, the Messenger of Allah, peace and blessings be upon him, did not leave any leader of fitnah until the end of the world, whose companions numbered three hundred or more, except that he named him for us by his name, his father's name, and his tribe's name.",
        "malay_translation": "Daripada Hudzaifah, beliau berkata, Demi Allah, aku tidak tahu sama ada para sahabatku lupa atau mereka melupakan? Demi Allah, Rasulullah SAW, semoga Allah memberi kesejahteraan dan keberkatan kepada baginda, tidak meninggalkan mana-mana pemimpin fitnah sehingga ke akhir zaman, yang mempunyai sekumpulan tiga ratus orang atau lebih, melainkan baginda telah menyebut nama mereka kepada kita, beserta nama bapa dan nama kabilah mereka.",
        "arabic_text": "عَنْ حُذَيْفَةَ قَالَ: وَاللَّهِ مَا أَدْرِي أَنَسِيَ أَصْحَابِي أَمْ تَنَاسَوْا؟ وَاللَّهِ مَا تَرَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ قَائِدِ فِتْنَةٍ إِلَى أَنْ تَنْقَضِيَ الدُّنْيَا يَبْلُغُ مَنْ مَعَهُ ثَلَاثَمِائَةٍ فَصَاعِدًا إِلَّا قَدْ سَمَّاهُ لَنَا بِاسْمِهِ وَاسْمِ أَبِيهِ واسمِ قبيلتِه. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 34088,
        "hadith_number": "5394",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ketakutan Nabi SAW terhadap Pemimpin yang Sesat dan Kekalunyaman Pedang di Kalangan Umatnya",
        "perawi_melayu": null,
        "english_text": "And from Thawban, he said: The Messenger of Allah, may Allah bless him and grant him peace, said, \"Indeed, I fear for my ummah the misguided leaders. And when the sword is placed upon my ummah, it will not be lifted from them until the Day of Resurrection.\"  Narrated by Abu Dawud and at-Tirmidhi.",
        "malay_translation": "Dan daripada Thawban, dia berkata: Rasulullah SAW bersabda, \"Sesungguhnya aku bimbang terhadap umatku pemimpin-pemimpin yang sesat. Dan apabila pedang diletakkan ke atas umatku, ia tidak akan ditarik balik dari mereka hingga Hari Kiamat.\" Diriwayatkan oleh Abu Dawud dan at-Tirmidhi.",
        "arabic_text": "وَعَنْ ثَوْبَانَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّمَا أَخَافُ عَلَى أُمَّتِي الْأَئِمَّةَ الْمُضِلِّينَ وَإِذَا وُضِعَ السَّيْفُ فِي أُمَّتِي لَمْ يُرْفَعْ عَنْهُمْ إِلَى يَوْمِ الْقِيَامَةِ» . رَوَاهُ أَبُو دَاوُد والترمذيُّ"
      },
      {
        "id": 34089,
        "hadith_number": "5395",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tempoh Kekhalifahan dan Peralihan kepada Pemerintahan",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Safinah RA, beliau berkata: Saya mendengar Nabi SAW bersabda: \"Khilafah (kekhalifahan) adalah tiga puluh tahun, kemudian ia akan menjadi kerajaan.\" Kemudian Safinah berkata: \"Hitunglah: Kekhalifahan Abu Bakar RA dua tahun, kekhalifahan Umar RA sepuluh tahun, Uthman RA dua belas tahun, dan Ali RA enam tahun.\" Riwayat Ahmad, Tirmizi dan Abu Daud.",
        "arabic_text": "وَعَن سفينة قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «الْخِلَافَةُ ثَلَاثُونَ سَنَةً ثُمَّ تَكُونُ مُلْكًا» . ثُمَّ يَقُولُ سَفِينَةُ: أَمْسِكْ: خِلَافَةَ أَبِي بَكْرٍ سَنَتَيْنِ وَخِلَافَةَ عُمَرَ عَشْرَةً وَعُثْمَانَ اثْنَتَيْ عَشْرَةَ وَعَلِيٍّ سِتَّةً. رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ"
      },
      {
        "id": 34090,
        "hadith_number": "5396",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penjelasan Peringatan Nabi SAW Tentang Fitnah dan Kejadian Akhir Zaman",
        "perawi_melayu": "Hudzaifah bin Al-Yaman",
        "english_text": "Not Available",
        "malay_translation": "Daripada Hudzaifah, beliau berkata: \"Wahai Rasulullah, adakah selepas kebaikan ini akan datang kejahatan seperti yang telah berlaku sebelum ini?\" Baginda menjawab: \"Ya.\" Aku bertanya lagi: \"Apakah perlindungan (dari kejahatan itu)?\" Baginda menjawab: \"Pedang.\" Aku bertanya lagi: \"Adakah selepas pedang terdapat lagi sesuatu?\" Baginda menjawab: \"Ya, akan datang pemerintahan yang lemah dan perjanjian damai di tengah-tengah kebingungan.\" Aku bertanya lagi: \"Kemudian apakah yang berlaku seterusnya?\" Baginda menjawab: \"Kemudian akan muncul para da’i (penyeru) kesesatan. Jika Allah memiliki seorang khalifah di muka bumi yang akan menyeksa (orang-orang yang sesat) dan mengambil harta benda mereka, maka taatlah kepadanya. Jika tidak, maka matilah engkau sambil menggigit dahan kayu.\" Aku bertanya lagi: \"Kemudian apakah yang berlaku seterusnya?\" Baginda menjawab: \"Kemudian akan muncul Dajjal bersama-sama dengan sungai dan api. Sesiapa yang terjatuh ke dalam apinya, pahalanya akan diterima dan dosanya dihapuskan. Sesiapa yang terjatuh ke dalam sungainya, dosanya akan dibebankan padanya dan pahalanya akan diambil.\" Aku bertanya lagi: \"Kemudian apakah yang berlaku seterusnya?\" Baginda menjawab: \"Kemudian akan dijumpai kuda yang unggul tetapi tidak akan dapat dinaiki hingga hari kiamat.\" Dan dalam satu riwayat disebutkan: \"Perjanjian damai di atas asap dan sekumpulan orang atas kekosongan.\" Aku bertanya lagi: \"Wahai Rasulullah, apakah perjanjian damai di atas asap itu?\" Baginda menjawab: \"Tidak akan kembali kepada (keyakinan) sebelumnya.\" Aku bertanya lagi: \"Selepas kebaikan ini adakah kejahatan?\" Baginda menjawab: \"Fitnah yang buta dan tuli, ada para da'i di setiap pintu neraka. Maka jika engkau, wahai Hudzaifah, mati sambil menggigit dahan kayu, itu lebih baik bagimu daripada mengikut mana-mana golongan mereka.\" Diriwayatkan oleh Imam Abu Daud.",
        "arabic_text": "وَعَنْ حُذَيْفَةَ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ أَيَكُونُ بَعْدَ هَذَا الْخَيْرِ شَرٌّ كَمَا كَانَ قَبْلَهُ شَرٌّ؟ قَالَ: «نَعَمْ» قُلْتُ: فَمَا الْعِصْمَةُ؟ قَالَ: «السَّيْفُ» قُلْتُ: وَهَلْ بَعْدَ السَّيْفِ بَقِيَّةٌ؟ قَالَ: «نعمْ تكونُ إِمارةٌ على أَقْذَاءٍ وَهُدْنَةٌ عَلَى دَخَنٍ» . قُلْتُ: ثُمَّ مَاذَا؟ قَالَ: «ثُمَّ يَنْشَأُ دُعَاةُ الضَّلَالِ فَإِنْ كَانَ لِلَّهِ فِي الْأَرْضِ خَلِيفَةٌ جَلَدَ ظَهْرَكَ وَأَخَذَ مَالَكَ فَأَطِعْهُ وَإِلَّا فَمُتْ وَأَنْتَ عَاضٌّ عَلَى جَذْلِ شَجَرَةٍ» . قُلْتُ: ثُمَّ مَاذَا؟ قَالَ: «ثُمَّ يَخْرُجُ الدَّجَّالُ بَعْدَ ذَلِكَ مَعَهُ نَهْرٌ وَنَارٌ فَمَنْ وَقَعَ فِي نَارِهِ وَجَبَ أَجْرُهُ وَحُطَّ وِزْرُهُ وَمَنْ وَقَعَ فِي نَهْرِهِ وَجَبَ وِزْرُهُ وحظ أَجْرُهُ» . قَالَ: قُلْتُ: ثُمَّ مَاذَا؟ قَالَ: «ثُمَّ يُنْتَجُ الْمُهْرُ فَلَا يُرْكَبُ حَتَّى تَقُومَ السَّاعَةُ» وَفِي رِوَايَة: «هُدْنَةٌ عَلَى دَخَنٍ وَجَمَاعَةٌ عَلَى أَقْذَاءٍ» . قُلْتُ: يَا رَسُولَ اللَّهِ الْهُدْنَةُ عَلَى الدَّخَنِ مَا هِيَ؟ قَالَ: «لَا ترجع قُلُوب أَقوام كَمَا كَانَتْ عَلَيْهِ» . قُلْتُ: بَعْدَ هَذَا الْخَيْرِ شَرٌّ؟ قَالَ: «فِتْنَةٌ عَمْيَاءُ صَمَّاءُ عَلَيْهَا دُعَاةٌ عَلَى أَبْوَابِ النَّارِ فَإِنْ مُتَّ يَا حُذَيْفَةُ وَأَنْتَ عَاضٌّ عَلَى جَذْلٍ خَيْرٌ لَكَ مِنْ أَنْ تتبع أحدا مِنْهُم» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 34091,
        "hadith_number": "5397",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menangani Cabaran dalam Masyarakat: Nasihat Rasulullah SAW kepada Abu Dzar",
        "perawi_melayu": "Abu Dzar al-Ghifari",
        "english_text": "Not Available",
        "malay_translation": "Dan daripada Abu Dzar, dia berkata: \"Aku pernah menjadi penunggang belakang Rasulullah SAW suatu hari di atas seekor unta. Ketika kami melewati rumah-rumah Madinah, Baginda bertanya, 'Bagaimana keadaanmu, wahai Abu Dzar, jika berlaku kelaparan di Madinah, engkau bangun dari katilmu dan engkau tidak sampai ke masjidmu sehingga kelaparan itu mengujimu?\" Aku menjawab, 'Allah dan Rasul-Nya lebih mengetahui.' Baginda bersabda, \"Bersabarlah, wahai Abu Dzar.\" Baginda kemudian bertanya, 'Bagaimana keadaanmu, wahai Abu Dzar, jika ada kematian di Madinah, seorang hamba sampai ke rumah sehingga kubur itu dibeli dengan hamba itu?\" Aku menjawab, 'Allah dan Rasul-Nya lebih mengetahui.' Baginda bersabda, \"Bersabarlah, wahai Abu Dzar.\" Baginda kemudian bertanya, 'Bagaimana keadaanmu, wahai Abu Dzar, jika berlaku pembunuhan di Madinah, darah merembes ke batu-batu zaitun?\" Aku menjawab, 'Allah dan Rasul-Nya lebih mengetahui.' Baginda bersabda, \"Pergilah dan terlibatlah.\" Aku bertanya, \"Dan aku perlu memakai senjata?\" Baginda menjawab, \"Engkau telah turut serta dengan orang ramai ketika itu.\" Aku bertanya, \"Maka bagaimana aku harus bertindak, wahai Rasulullah?\" Baginda bersabda, \"Jika engkau takut terkena sinaran pedang, maka letakkan sehelai baju di atas mukamu untuk menutup diri daripada dosa sendiri dan dosa mereka.\"",
        "arabic_text": "وَعَن أبي ذَر قَالَ: كُنْتُ رَدِيفًا خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا علىحمار فَلَمَّا جَاوَزْنَا بُيُوتَ الْمَدِينَةِ قَالَ: «كَيْفَ بِكَ يَا أَبَا ذَرٍّ إِذَا كَانَ بِالْمَدِينَةِ جُوعٌ تَقُومُ عَنْ فِرَاشِكَ وَلَا تَبْلُغُ مَسْجِدَكَ حَتَّى يُجْهِدَكَ الْجُوعُ؟» قَالَ: قُلْتُ: اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: «تَعَفَّفْ يَا أَبَا ذَرٍّ» . قَالَ: «كَيْفَ بِكَ يَا أَبَا ذَرٍّ إِذَا كَانَ بِالْمَدِينَةِ مَوْتٌ يَبْلُغُ الْبَيْتَ الْعَبْدُ حَتَّى إِنَّهُ يُبَاعُ الْقَبْرُ بِالْعَبْدِ؟» . قَالَ: قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: «تَصْبِرُ يَا أَبَا ذَرٍّ» . قَالَ: «كَيْفَ بِكَ يَا أَبَا ذَرٍّ إِذَا كَانَ بِالْمَدِينَةِ قَتْلٌ تَغْمُرُ الدِّمَاءُ أَحْجَارَ الزَّيْتِ؟» قَالَ: قُلْتُ: اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: «تَأْتِي مَنْ أَنْتَ مِنْهُ» . قَالَ: قُلْتُ: وَأَلْبَسُ السِّلَاحَ؟ قَالَ: «شَارَكْتَ الْقَوْمَ إِذًا» . قُلْتُ: فَكَيْفَ أَصْنَعُ يَا رَسُولَ اللَّهِ؟ قَالَ: «إِنْ خَشِيتَ أَنْ يَبْهَرَكَ شُعَاعُ السَّيْفِ فَأَلْقِ نَاحِيَةَ ثَوْبِكَ عَلَى وَجْهِكَ لِيَبُوءَ بإِثمك وإِثمه» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 34092,
        "hadith_number": "5398",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Petunjuk Ketika Terseliuh Di Kalangan Manusia Yang Rusak Perjanjian dan Amanah",
        "perawi_melayu": null,
        "english_text": null,
        "malay_translation": "Daripada Abdullah bin Amru bin al-As, bahawa Nabi SAW bersabda, \"Bagaimana keadaanmu jika engkau berada di kalangan orang-orang yang telah rosakkan perjanjian dan amanah mereka? Mereka berpecah belah sedemikian rupa?\" Baginda bersilang-silangkan jari-jari baginda. Lalu, bertanya, \"Apakah yang Engkau suruh saya lakukan?\" Baginda bersabda, \"Ikutilah apa yang kamu ketahui dan tinggalkan apa yang kamu tidak ketahui. Perhatikan dirimu sendiri dan jauhi urusan mereka yang ramai.\"\n\nDalam riwayat yang lain, \"Tinggallah di rumahmu, kawal lidahmu, ambil apa yang kamu ketahui dan tinggalkan apa yang kamu tidak ketahui. Berpegang teguhlah pada urusan dirimu sendiri dan tinggalkan urusan orang ramai.\"\n\nDiriwayatkan oleh al-Tirmidzi dan disahihkan olehnya.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كَيْفَ بِكَ إِذَا أُبْقِيتَ فِي حُثَالَةٍ مِنَ النَّاسِ مَرَجَتْ عُهُودُهُمْ وَأَمَانَاتُهُمْ؟ وَاخْتَلَفُوا فَكَانُوا هَكَذَا؟» وَشَبَّكَ بَيْنَ أَصَابِعِهِ. قَالَ: فَبِمَ تَأْمُرُنِي؟ قَالَ: «عَلَيْكَ بِمَا تَعْرِفُ وَدَعْ مَا تُنْكِرُ وَعَلَيْكَ بِخَاصَّةِ نَفْسِكَ وَإِيَّاكَ وَعَوَامِّهِمْ» . وَفِي رِوَايَةٍ: «الْزَمْ بَيْتَكَ وَأَمْلِكْ عَلَيْكَ لِسَانَكَ وَخُذْ مَا تَعْرِفُ وَدَعْ مَا تُنْكِرُ وَعَلَيْكَ بِأَمْرِ خَاصَّةِ نَفْسِكَ ودع أَمر الْعَامَّة» . رَوَاهُ التِّرْمِذِيّ وَصَححهُ"
      },
      {
        "id": 34093,
        "hadith_number": "5399",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Peringatan Tentang Fitnah dan Nasihat Ketika Menghadapi Fitnah",
        "perawi_melayu": "Abu Musa al-Asy'ari",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Musa al-Asy'ari daripada Nabi SAW, baginda bersabda: \"Sesungguhnya di hadapan hari kiamat terdapat fitnah-fitnah seperti potongan malam yang gelap.  Seseorang itu mungkin beriman pada pagi hari, tetapi menjadi kafir pada petang harinya, dan sebaliknya. Orang yang duduk lebih baik daripada orang yang berdiri, dan orang yang berjalan lebih baik daripada orang yang berlari.  Oleh itu, pecahkanlah busur-busur kamu di dalamnya, potonglah tali-tali kamu di dalamnya, dan hancurkan pedang-pedang kamu dengan batu. Jika seseorang daripada kamu ditimpa fitnah, maka jadilah seperti sebaik-baik anak Adam.\"  Riwayat Imam Abu Daud.  Dalam riwayat lain (yang lemah): \"Setelah sampai pada ayat '...orang yang berjalan lebih baik daripada orang yang berlari,'  mereka bertanya, 'Apakah yang anda perintahkan kepada kami?' Baginda menjawab, 'Tinggallah di dalam rumah-rumah kamu.' Dalam riwayat Imam Tirmizi: Rasulullah SAW bersabda ketika menceritakan tentang fitnah, 'Pecahkanlah busur-busur kamu di dalamnya, potonglah tali-tali kamu di dalamnya, dan cari perlindungan di dalam rumah-rumah kamu, dan jadilah seperti anak Adam.' Baginda juga bersabda, 'Hadis ini adalah sahih dan gharib.'.",
        "arabic_text": "وَعَنْ أَبِي مُوسَى عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «إِنَّ بَيْنَ يَدَيِ السَّاعَةِ فِتَنًا كَقِطَعِ اللَّيْلِ الْمُظْلِمِ يُصْبِحُ الرَّجُلُ مُؤْمِنًا وَيُمْسِي كَافِرًا وَيُمْسِي مُؤْمِنًا وَيُصْبِحُ كَافِرًا الْقَاعِد خير من الْقَائِم والماشي خَيْرٌ مِنَ السَّاعِي فَكَسِّرُوا فِيهَا قِسِيَّكُمْ وَقَطِّعُوا فِيهَا أَوْتَارَكُمْ وَاضْرِبُوا سُيُوفَكُمْ بِالْحِجَارَةِ فَإِنْ دُخِلَ عَلَى أَحَدٍ مِنْكُمْ فَلْيَكُنْ كَخَيْرِ ابْنَيْ آدَمَ» . رَوَاهُ أَبُو دَاوُد. وَفِي رِوَايَة لَهُ (ضَعِيف) : «ذَكَرَ إِلَى قَوْلِهِ» خَيْرٌ مِنَ السَّاعِي ثُمَّ قَالُوا: فَمَا تَأْمُرُنَا؟ قَالَ: كُونُوا أَحْلَاسَ بُيُوتِكُمْ . وَفِي رِوَايَةِ التِّرْمِذِيِّ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْفِتْنَةِ: «كَسِّرُوا فِيهَا قِسِيَّكُمْ وَقَطِّعُوا فِيهَا أَوْتَارَكُمْ وَالْزَمُوا فِيهَا أَجْوَافَ بُيُوتِكُمْ وَكُونُوا كَابْنِ آدَمَ» . وَقَالَ: هَذَا حديثٌ صحيحٌ غريبٌ"
      },
      {
        "id": 34094,
        "hadith_number": "5400",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Orang Terbaik Ketika Fitnah Berlaku",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ummu Malik al-Bahziyyah RA, beliau berkata: Rasulullah SAW menyebut tentang fitnah, lalu Baginda menghampirinya (menjelaskannya). Aku bertanya: Wahai Rasulullah, siapakah orang yang terbaik ketika itu? Baginda bersabda: 'Seorang lelaki yang berada di tengah-tengah haiwan ternakannya, menunaikan haknya, dan beribadah kepada Tuhannya, dan seorang lelaki yang memegang kepala kudanya, kepalanya menakutkan musuh dan mereka menakutkannya.' Riwayat Tirmizi.",
        "arabic_text": "وَعَن أم مَالك البهزية قَالَتْ: ذَكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِتْنَةً فَقَرَّبَهَا. قُلْتُ: يَا رَسُولَ اللَّهِ مَنْ خَيْرُ النَّاسِ فِيهَا؟ قَالَ: «رَجُلٌ فِي مَاشِيَتِهِ يُؤَدِّي حَقَّهَا وَيَعْبُدُ رَبَّهُ وَرَجُلٌ أَخَذَ برأسٍ فرأسه يخيف الْعَدو ويخوفونه» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 34095,
        "hadith_number": "5401",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Fitnah yang Menyerang Orang Arab dan Kesannya",
        "perawi_melayu": "Abdullah bin 'Amr",
        "english_text": "From Abdullah bin 'Amr, he said: The Messenger of Allah (peace and blessings be upon him) said, \"There will be a fitnah (percobaan) that will overwhelm the Arabs, their deaths in the Fire. The tongue will be more severe in it than the impact of the sword.\"",
        "malay_translation": "Daripada Abdullah bin 'Amr, beliau berkata: Rasulullah SAW bersabda, \"Akan datang suatu fitnah yang akan melanda orang-orang Arab, kematiannya di dalam neraka. Lidah akan lebih dahsyat daripada pedang dalam fitnah tersebut.\"",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «سَتَكُونُ فِتْنَةٌ تَسْتَنْظِفُ الْعَرَبَ قَتْلَاهَا فِي النَّارِ اللِّسَانُ فِيهَا أَشَدُّ مِنْ وَقْعِ السَّيْفِ» . رَوَاهُ التِّرْمِذِيُّ وَابْن مَاجَه"
      },
      {
        "id": 34096,
        "hadith_number": "5402",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Fitnah yang Membutakan dan Menggemparkan",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Dari Abu Hurairah, bahawa Rasulullah SAW bersabda: \"Akan datang suatu fitnah yang pekak, bisu, dan buta. Barangsiapa yang berusaha mencari jalan keluar untuk dirinya daripadanya, maka fitnah itu akan berusaha mencari jalan keluar kepadanya. Dan kebebasan berbicara di dalamnya seperti jatuhnya pedang.\"",
        "malay_translation": "Daripada Abu Hurairah, bahawa Rasulullah SAW bersabda: \"Akan datang suatu fitnah yang pekak, bisu, dan buta. Barangsiapa yang berusaha mendapatkan jalan keluar untuk dirinya daripadanya, maka fitnah itu akan berusaha mendapatkan jalan keluar kepadanya. Dan kebebasan berbicara pada masa itu bagaikan jatuhnya pedang.\" (Riwayat Imam Abu Daud)",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «سَتَكُونُ فِتْنَةٌ صَمَّاءُ بكماء عمياءُ مَنْ أَشْرَفَ لَهَا اسْتَشْرَفَتْ لَهُ وَإِشْرَافُ اللِّسَانِ فِيهَا كوقوع السَّيْف» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 34097,
        "hadith_number": "5403",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penerangan tentang Fitnah dan Kedatangan Dajjal",
        "perawi_melayu": "Abdullah bin Umar",
        "english_text": "And from Abdullah bin Umar, he said: We were sitting with the Prophet, peace and blessings be upon him, and he mentioned the fitnah (pergolakan). He spoke a lot about it until he mentioned the fitnah of Ahlul-Ahklas.  A person asked: \"What is the fitnah of Ahlul-Ahklas?\" He said: It is a flight and war. Then there is the fitnah of prosperity, the smoke of it from under the feet of a man from my household, who claims to be from me, but he is not. Indeed, my loyal ones are the muttaqun (orang-orang yang bertakwa).  Then the people will agree on a man like a rib, then the fitnah of the Dahma, which does not leave anyone from this ummah except it hits them with a blow. And if it is said that it is over, it will spread. A man will be a believer in the morning and a disbeliever in the evening, until the people are in two camps: a camp of faith where there is no hypocrisy, and a camp of hypocrisy where there is no faith.  When that happens, wait for the Dajjal, on his day or the next. It was narrated by Abu Dawud",
        "malay_translation": "Dan daripada Abdullah bin Umar, beliau berkata: Kami duduk bersama Nabi SAW, dan baginda menyebut tentang fitnah (pergolakan). Baginda banyak bercerita tentangnya sehingga menyebut fitnah Ahlul-Ahklas. Seseorang bertanya: \"Apakah fitnah Ahlul-Ahklas itu?\" Baginda menjawab: Ia adalah kepencilan dan peperangan. Kemudian ada fitnah kesenangan, yang asapnya muncul dari bawah kaki seorang lelaki daripada keluarga saya, yang mengaku dari kalangan saya, tetapi bukanlah. Sesungguhnya, orang-orang yang setia kepada saya ialah orang-orang yang bertakwa (muttaqun). Kemudian, manusia akan bersetuju atas seorang lelaki seperti tulang rusuk, kemudian fitnah al-Dahma yang tidak akan meninggalkan sesiapa pun daripada umat ini melainkan ia menghantamnya dengan pukulan. Dan jika dikatakan bahawa ia telah berakhir, ia akan tersebar. Seorang lelaki akan menjadi mukmin pada waktu pagi dan menjadi kafir pada waktu petang, sehingga manusia berpecah kepada dua kumpulan: satu kumpulan yang beriman di mana tiada kemunafikan, dan satu kumpulan kemunafikan di mana tiada keimanan. Apabila itu berlaku, tunggulah kedatangan Dajjal, pada hari atau esoknya. Dikisahkan oleh Abu Dawud.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ: كُنَّا قُعُودًا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ الْفِتَنَ فَأَكْثَرَ فِي ذِكْرِهَا حَتَّى ذَكَرَ فِتْنَةَ الْأَحْلَاسِ فَقَالَ قَائِلٌ: وَمَا فِتْنَةُ الْأَحْلَاسِ. قَالَ: هِيَ هَرَبٌ وَحَرَبٌ ثُمَّ فِتْنَةُ السَّرَّاءِ دَخَنُهَا مِنْ تَحْتِ قَدَمَيْ رَجُلٍ مِنْ أَهْلِ بَيْتِي يَزْعُمُ أَنَّهُ مِنِّي وَلَيْسَ مِنِّي إِنَّمَا أَوْلِيَائِي الْمُتَّقُونَ ثُمَّ يَصْطَلِحُ النَّاسُ عَلَى رَجُلٍ كورك على ضلع ثمَّ فتْنَة الدهماء لَا تَدَعُ أَحَدًا مِنْ هَذِهِ الْأُمَّةِ إِلَّا لَطْمَتْهُ لَطْمَةً فَإِذَا قِيلَ: انْقَضَتْ تَمَادَتْ يُصْبِحُ الرَّجُلُ فِيهَا مُؤْمِنًا وَيُمْسِي كَافِرًا حَتَّى يَصِيرَ النَّاسُ إِلَى فُسْطَاطَيْنِ: فُسْطَاطِ إِيمَانٍ لَا نِفَاقَ فِيهِ وَفُسْطَاطِ نِفَاقٍ لَا إِيمَانَ فِيهِ. فَإِذَا كَانَ ذَلِكَ فَانْتَظِرُوا الدَّجَّالَ مِنْ يَوْمِهِ أَوْ من غده . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 34098,
        "hadith_number": "5404",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Waspada terhadap Keburukan yang Mendekati dan Menjaga Tangan",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "And from Abu Hurairah that the Prophet ﷺ said: \"Woe to the Arabs from an evil that has drawn near. He who holds back his hand is successful.\". Narrated by Abu Dawud",
        "malay_translation": "Dan daripada Abu Hurairah, bahawa Nabi SAW bersabda: \"Celaka orang Arab kerana keburukan yang sudah hampir. Sesiapa yang menahan tangannya (daripada kejahatan) dialah orang yang berjaya.\". Diriwayatkan oleh Abu Dawud",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «وَيْلٌ لِلْعَرَبِ مِنْ شَرٍّ قَدِ اقْتَرَبَ أَفْلَحَ مَنْ كَفَّ يَدَهُ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 34099,
        "hadith_number": "5405",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kebahagiaan Diterima daripada Fitnah dan Kesabaran dalam Ujian",
        "perawi_melayu": "Miqdad bin al-Aswad",
        "english_text": "And from Miqdad ibn al-Aswad, he said: I heard the Messenger of Allah, peace and blessings be upon him, say: \"Indeed, the fortunate one is the one who is spared from trials. Indeed, the fortunate one is the one who is spared from trials. Indeed, the fortunate one is the one who is spared from trials, and the one who is tested and perseveres is blessed.\"",
        "malay_translation": "Dan daripada Miqdad bin al-Aswad, dia berkata: Aku mendengar Rasulullah SAW bersabda: \"Sesungguhnya orang yang beruntung ialah orang yang terhindar daripada fitnah. Sesungguhnya orang yang beruntung ialah orang yang terhindar daripada fitnah. Sesungguhnya orang yang beruntung ialah orang yang terhindar daripada fitnah, dan orang yang diuji lalu bersabar sungguh beroleh keberkatan.\"",
        "arabic_text": "وَعَن الْمِقْدَاد بن الْأسود قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ السَّعِيدَ لَمَنْ جُنِّبَ الْفِتَنَ إِنَّ السَّعِيدَ لَمَنْ جُنِّبَ الْفِتَنَ إِنَّ السَّعِيدَ لَمَنْ جُنِّبَ الْفِتَنَ وَلَمَنِ ابْتُلِيَ فَصَبَرَ فَوَاهًا» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 34100,
        "hadith_number": "5406",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keberadaan Pedang dan Kemerosotan Umat",
        "perawi_melayu": "Thawban",
        "english_text": "Not Available",
        "malay_translation": "Dan daripada Thawban, dia berkata: Telah bersabda Rasulullah SAW, \"Apabila pedang diletakkan di kalangan umatku, ia tidak akan ditarik hingga Hari Kiamat. Dan tidak akan terjadi Hari Kiamat sehingga sebahagian kaum di antara umatku menyertai orang-orang musyrik dan sehingga sebahagian kaum di antara umatku menyembah berhala. Sesungguhnya akan ada 30 pendusta di antara umatku, masing-masing mendakwa dirinya sebagai nabi Allah, dan aku adalah penutup para nabi, tiada nabi sesudahku. Dan akan sentiasa ada sekumpulan dari umatku yang tetap istiqamah di atas kebenaran, dan mereka tidak akan dirugikan oleh orang yang menentang mereka sehingga berlaku perintah Allah.\". Riwayat Abu Daud.",
        "arabic_text": "وَعَنْ ثَوْبَانَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا وُضِعَ السَّيْفُ فِي أُمَّتِي لَمْ يُرْفَعْ عَنْهَا إِلَى يَوْمِ الْقِيَامَةِ وَلَا تَقُومُ السَّاعَةُ حَتَّى تَلْحَقَ قَبَائِلُ مِنْ أُمَّتِي بِالْمُشْرِكِينَ وَحَتَّى تَعْبُدَ قَبَائِلُ مِنْ أُمَّتِي الْأَوْثَانَ وَإِنَّهُ سَيَكُونُ فِي أُمَّتِي كَذَّابُونَ ثَلَاثُونَ كُلُّهُمْ يَزْعُمُ أَنَّهُ نَبِيُّ اللَّهِ وَأَنَا خَاتَمُ النَّبِيين لَا نَبِيَّ بِعْدِي وَلَا تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي عَلَى الْحَقِّ ظَاهِرِينَ لَا يَضُرُّهُمْ مَنْ خَالَفَهُمْ حَتَّى يَأْتِيَ أَمْرُ اللَّهِ» . رَوَاهُ أَبُو دَاوُدَ"
      },
      {
        "id": 34101,
        "hadith_number": "5407",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tunjang Islam Bertahan selama 35, 36, atau 37 Tahun",
        "perawi_melayu": "Abdul Rahman bin Mas'ud",
        "english_text": "And from Abdullah bin Mas'ud, from the Prophet sallallahu alaihi wasallam, he said: \"The mill of Islam will turn for thirty-five, or thirty-six, or thirty-seven years. If they perish, then the way of those who perished. If they establish their religion, they will establish it for seventy years.\" I said, \"From what remains, or from what has passed?\" He said, \"From what has passed.\" Abu Dawud narrated it.",
        "malay_translation": "Dan daripada Abdullah bin Mas'ud, daripada Nabi sallallahu alaihi wasallam, baginda bersabda: \"Penggerak Islam akan berputar selama tiga puluh lima, atau tiga puluh enam, atau tiga puluh tujuh tahun. Jika mereka binasa, maka jalan mereka yang binasa. Jika mereka menegakkan agama mereka, mereka akan menegakkannya selama tujuh puluh tahun.\" Aku bertanya, \"Daripada yang tinggal atau daripada yang telah lalu?\" Baginda menjawab, \"Daripada yang telah lalu.\"  Riwayat Abu Dawud.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «تَدُورُ رَحَى الْإِسْلَامِ لِخَمْسٍ وَثَلَاثِينَ أَوْ سِتٍّ وَثَلَاثِينَ أَوْ سَبْعٍ وَثَلَاثِينَ فَإِنْ يَهْلِكُوا فَسَبِيلُ مَنْ هَلَكَ وَإِنْ يَقُمْ لَهُمْ دِينُهُمْ يَقُمْ لَهُمْ سَبْعِينَ عَامًا» . قُلْتُ: أَمِمَّا بَقِيَ أَوْ مِمَّا مَضَى؟ قَالَ: «مِمَّا مضى» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 34102,
        "hadith_number": "5408",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Meniru Amalan Jahiliyah: Kisah Pohon Dhat Anwat",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Waqid al-Laithi: Sesungguhnya Rasulullah SAW, ketika keluar menuju peperangan Hunain, melewati sebuah pohon milik orang-orang musyrik. Mereka menggantungkan senjata mereka di pohon itu, dan pohon itu disebut Dhat Anwat. Mereka berkata, 'Wahai Rasulullah, buatlah untuk kami Dhat Anwat sebagaimana mereka memiliki Dhat Anwat.' Maka Rasulullah SAW bersabda, 'Subhanallah! Ini seperti perkataan kaum Musa, '(Buatlah untuk kami tuhan sebagaimana mereka mempunyai tuhan-tuhan)'. Demi Zat yang jiwaku berada di tangan-Nya, sungguh kamu akan mengikuti jalan orang-orang sebelum kamu.'",
        "arabic_text": "عَن أبي واقدٍ اللَّيْثِيّ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا خَرَجَ إِلَى غَزْوَةِ حُنَيْنٍ مَرَّ بِشَجَرَةٍ لِلْمُشْرِكِينَ كَانُوا يُعَلِّقُونَ عَلَيْهَا أَسْلِحَتَهُمْ يُقَالُ لَهَا: ذَاتُ أَنْوَاطٍ. فَقَالُوا: يَا رَسُولَ اللَّهِ اجْعَلْ لَنَا ذَاتَ أَنْوَاطٍ كَمَا لَهُمْ ذَاتُ أَنْوَاطٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «سُبْحَانَ اللَّهِ هَذَا كَمَا قَالَ قَوْمُ مُوسَى (اجْعَل لنا إِلَهًا كَمَا لَهُم آلهةٌ) وَالَّذِي نَفْسِي بِيَدِهِ لَتَرْكَبُنَّ سُنَنَ مَنْ كَانَ قبلكُمْ» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 34103,
        "hadith_number": "5409",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Fitnah Pertama dan Kesannya terhadap Sahabat Badar dan Hudaibiyah",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibn al-Musayyib RA berkata: “Berlakunya fitnah pertama – iaitu pembunuhan Uthman RA – maka tidak ada seorang pun yang tersisa daripada kalangan sahabat Badar. Kemudian berlakunya fitnah kedua – iaitu al-Harrah – maka tidak ada seorang pun yang tersisa daripada kalangan sahabat Hudaibiyah. Kemudian berlakunya fitnah ketiga, dan ia tidak berakhir sementara manusia berada dalam keadaan huru-hara.” Riwayat al-Bukhari.",
        "arabic_text": "وَعَن ابْن الْمسيب قَالَ: وَقَعَتِ الْفِتْنَةُ الْأُولَى - يَعْنِي مَقْتَلَ عُثْمَانَ - فَلَمْ يَبْقَ مِنْ أَصْحَابٍ بَدْرٍ أَحَدٌ ثُمَّ وَقَعَتِ الْفِتْنَةُ الثَّانِيَةُ - يَعْنِي الْحَرَّةَ - فَلَمْ يَبْقَ مِنْ أَصْحَابِ الْحُدَيْبِيَةِ أَحَدٌ ثُمَّ وَقَعَتِ الْفِتْنَةُ الثَّالِثَةُ فَلَمْ تَرْتَفِعْ وَبِالنَّاسِ طَبَاخٌ. رَوَاهُ الْبُخَارِيُّ"
      },
      {
        "id": 34104,
        "hadith_number": "5410",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tanda-Tanda Kiamat dan Keadaan Manusia Pada Masa Itu",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah RA, bahawa Rasulullah SAW bersabda: \"Tidak akan berlaku hari kiamat sehingga berlaku peperangan antara dua puak besar yang hebat, di antara mereka berlaku pembunuhan besar-besaran, dan niat mereka sama.  Dan sehingga diutuskan beberapa pendusta yang mengaku sebagai utusan Allah, kira-kira tiga puluh orang. Dan sehingga ilmu pengetahuan dihilangkan, dan gempa bumi menjadi banyak, dan masa semakin dekat, dan fitnah-fitnah muncul, dan huru-hara melanda iaitu pembunuhan menjadi berleluasa. Dan sehingga harta benda menjadi banyak dikalangan kamu, sehinggakan ia mencurah-curah, sehingga pemilik harta itu bimbang siapa akan menerima sedekahnya.  Dan sehingga sesuatu itu ditawarkan, lalu orang yang menerima menawarkan tersebut berkata: Aku tidak memerlukannya.  Dan sehingga manusia berlumba-lumba dalam pembinaan bangunan. Dan sehingga seseorang itu melewati kubur seseorang, dan dia berkata: Alangkah baiknya aku berada di tempatnya. Dan sehingga matahari terbit dari barat.  Apabila matahari terbit dari arah barat, dan melihatnya manusia, semua mereka akan beriman.  Maka itulah ketika (iman seseorang tidak memberi manfaat jika sebelum itu tidak beriman atau tidak melakukan kebaikan dalam iman). Dan pasti kiamat akan berlaku, sedang dua orang lelaki telah mengenakan pakaian mereka dan mereka tidak akan berjual beli dan tidak akan melipatnya. Dan pastilah kiamat akan berlaku, ketika seorang lelaki sedang mengambil susu dari kambingnya, dan dia tidak akan memakannya. Dan pasti kiamat akan berlaku, ketika dia sedang mengisi kolamnya, dan dia tidak akan menyiraminya. Dan pasti kiamat akan berlaku, ketika dia telah mengangkat makanan ke mulutnya, dan dia tidak akan memakannya.\nDiriwayatkan oleh al-Bukhari dan Muslim.",
        "arabic_text": "عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم قا ل: لَا تَقُومُ السَّاعَةُ حَتَّى تَقْتَتِلَ فِئَتَانِ عَظِيمَتَانِ تَكُونُ بَيْنَهُمَا مَقْتَلَةٌ عَظِيمَةٌ دَعَوَاهُمَا وَاحِدَةٌ وَحَتَّى يبْعَث دجالون كذابون قريب مِنْ ثَلَاثِينَ كُلُّهُمْ يَزْعُمُ أَنَّهُ رَسُولُ اللَّهِ وَحَتَّى يُقْبَضَ الْعِلْمُ وَتَكْثُرَ الزَّلَازِلُ وَيَتَقَارَبَ الزَّمَانُ وَيظْهر الْفِتَنُ وَيَكْثُرَ الْهَرْجُ وَهُوَ الْقَتْلُ وَحَتَّى يَكْثُرَ فِيكُمُ الْمَالُ فَيَفِيضَ حَتَّى يُهِمَّ رَبَّ الْمَالِ مَنْ يَقْبَلُ صَدَقَتَهُ وَحَتَّى يَعْرِضَهُ فَيَقُولُ الَّذِي يعرضه عَلَيْهِ: لَا أَرَبَ لِي بِهِ وَحَتَّى يَتَطَاوَلَ النَّاسُ فِي الْبُنْيَانِ وَحَتَّى يَمُرَّ الرَّجُلُ بِقَبْرِ الرَّجُلِ فَيَقُولُ: يَا لَيْتَنِي مَكَانَهُ وَحَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا فَإِذَا طَلَعَتْ وَرَآهَا النَّاسُ آمَنُوا أَجْمَعُونَ فَذَلِكَ حِينَ (لَا يَنْفَعُ نَفْسًا إِيمَانُهَا لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ أَوْ كَسَبَتْ فِي إِيمَانِهَا خَيْرًا) وَلَتَقُومَنَّ السَّاعَةُ وَقَدْ نَشَرَ الرَّجُلَانِ ثَوْبَهُمَا بَيْنَهُمَا فَلَا يَتَبَايَعَانِهِ وَلَا يَطْوِيَانِهِ وَلَتَقُومَنَّ السَّاعَةُ وَقَدِ انْصَرَفَ الرَّجُلُ بِلَبَنِ لِقْحَتِهِ فَلَا يَطْعَمُهُ وَلَتَقُومَنَّ السَّاعَةُ وَهُوَ يُلِيطُ حَوْضَهُ فَلَا يَسْقِي فِيهِ وَلَتَقُومَنَّ السَّاعَةُ وَقَدْ رَفَعَ أُكْلَتَهُ إِلَى فِيهِ فَلَا يطْعمهَا . مُتَّفق عَلَيْهِ"
      },
      {
        "id": 34105,
        "hadith_number": "5411",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ketibaan Hari Kiamat dan Perang Melawan Bangsa Yang Memakai Kasut Bulu dan Orang Turki",
        "perawi_melayu": null,
        "english_text": "And from him, he said: The Messenger of Allah, peace and blessings be upon him, said, \"The Hour will not come until you fight a people whose footwear is of hair, and until you fight the Turks, small-eyed, red-faced, with noses like the noses of madmen, as if their faces resemble those struck by a hammer.\" Agreed upon (by Bukhari and Muslim).",
        "malay_translation": "Daripadanya, dia berkata: Rasulullah SAW bersabda, \"Hari Kiamat tidak akan datang sehingga kamu memerangi kaum yang kasut mereka berbulu, dan sehingga kamu memerangi orang-orang Turki, bermata kecil, berwajah merah, hidung mereka seperti hidung orang gila, seolah-olah wajah mereka seperti dipukul dengan tukul.\"  Disepakati (oleh Bukhari dan Muslim).",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَقُومُ السَّاعَةُ حَتَّى تُقَاتِلُوا قَوْمًا نِعَالُهُمُ الشَّعْرُ وَحَتَّى تُقَاتِلُوا التُّرْكَ صِغَارَ الْأَعْيُنِ حُمْرَ الْوُجُوهِ ذُلْفَ الْأُنُوفِ كأنَّ وجوهَهُم المجَانُّ المُطْرَقة» . مُتَّفق عَلَيْهِ"
      },
      {
        "id": 34106,
        "hadith_number": "5412",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kiamat Tidak Akan Datang Sehingga Menyerang Orang Khurasan dan Kirman",
        "perawi_melayu": null,
        "english_text": null,
        "malay_translation": "Dan daripadanya (Rasulullah SAW) bersabda: \"Kiamat tidak akan berlaku sehingga kamu berperang dengan kaum Khuza' dan Kirman daripada kalangan orang bukan Islam, yang berwajah merah, hidung pesek, mata kecil dan wajah mereka seperti orang gila, kasut mereka berbulu.\"  Dikeluarkan oleh al-Bukhari.",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَقُومُ السَّاعَةُ حَتَّى تُقَاتِلُوا خُوزًا وَكِرْمَانَ مِنَ الْأَعَاجِمِ حُمْرَ الْوُجُوهِ فُطْسَ الْأُنُوفِ صِغَارَ الْأَعْيُنِ وُجُوهُهُمُ الْمَجَانُّ الْمُطْرَقَةُ نِعَالُهُمُ الشّعْر» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 34107,
        "hadith_number": "5413",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Meminta-minta dengan Menghinakan Diri",
        "perawi_melayu": "Tidak Dinyatakan",
        "english_text": "Not Available",
        "malay_translation": "Dalam riwayat lain, daripada 'Amr bin Taghlib: \"Menghinakan wajah (meminta-minta dengan cara yang merendahkan diri).\"",
        "arabic_text": "وَفِي راوية لَهُ وَعَن عَمْرو بن تغلب: «عراض الْوُجُوه»"
      },
      {
        "id": 34108,
        "hadith_number": "5414",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perang Melawan Yahudi sebelum Kiamat",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "And it was narrated from Abu Hurairah (may Allah be pleased with him), he said: The Messenger of Allah (peace and blessings be upon him) said: \"The Hour will not come until the Muslims fight the Jews, and the Muslims kill them until a Jew hides behind a stone or a tree, and the stone or the tree says, 'O Muslim, O servant of Allah, there is a Jew behind me, come and kill him.' Except for the gharqad tree, for it is a tree of the Jews.\"",
        "malay_translation": "Daripada Abu Hurairah, katanya: Rasulullah SAW bersabda: \"Hari Kiamat tidak akan datang melainkan setelah umat Islam berperang dengan orang Yahudi, dan orang Islam membunuh mereka sehingga seorang Yahudi bersembunyi di sebalik batu atau pokok, lalu batu atau pokok itu berkata, 'Wahai orang Islam, wahai hamba Allah, ada seorang Yahudi di belakangku, datang dan bunuhlah dia.' Kecuali pokok gharqad, kerana ia adalah pokok orang Yahudi.\"",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا تَقُومُ السَّاعَةُ حَتَّى يُقَاتِلَ الْمُسْلِمُونَ الْيَهُودَ فَيَقْتُلُهُمُ الْمُسْلِمُونَ حَتَّى يختبئ الْيَهُودِيُّ مِنْ وَرَاءِ الْحَجَرِ وَالشَّجَرِ فَيَقُولُ الْحَجَرُ وَالشَّجَرُ: يَا مُسْلِمُ يَا عَبْدَ اللَّهِ هَذَا يَهُودِيٌّ خَلْفِي فَتَعَالَ فَاقْتُلْهُ إِلَّا الْغَرْقَدَ فَإِنَّهُ من شجر الْيَهُود . رَوَاهُ مُسلم"
      },
      {
        "id": 34109,
        "hadith_number": "5415",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kedatangan Hari Kiamat dan Seorang Lelaki dari Qahṭan",
        "perawi_melayu": null,
        "english_text": "And from him he said: The Messenger of Allah, peace and blessings be upon him, said, \"The Hour will not come until a man from Qahṭan emerges and heralds the people with his staff.\" Agreed upon.",
        "malay_translation": "Dan daripada baginda, beliau berkata: Rasulullah SAW bersabda, \"Hari Kiamat tidak akan datang sehingga muncul seorang lelaki dari Qahṭan yang menghimpunkan manusia dengan tongkatnya.\" Telah disepakati.",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَقُومُ السَّاعَةُ حَتَّى يَخْرُجَ رَجُلٌ مِنْ قَحْطَانَ يَسُوقُ النَّاسَ بعصاه» . مُتَّفق عَلَيْهِ"
      },
      {
        "id": 34110,
        "hadith_number": "5416",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pemerintahan Al-Jahjah",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada beliau (Abu Hurairah R.A), beliau berkata: Rasulullah SAW bersabda: 'Tidak akan berlalu siang dan malam sehingga seorang lelaki memerintah yang dipanggil: Al-Jahjah.' Dalam riwayat lain: 'Sehingga seorang lelaki daripada kalangan *Mawali* memerintah yang dipanggil: Al-Jahjah.' (Riwayat Muslim)",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا تَذْهَبُ الْأَيَّامُ وَاللَّيَالِي حَتَّى يَمْلِكَ رَجُلٌ يُقَالُ لَهُ: الْجَهْجَاهُ . وَفِي رِوَايَةٍ: حَتَّى يَمْلِكَ رَجُلٌ مِنَ الْمَوَالِي يُقَالُ لَهُ: الجَهجاه . رَوَاهُ مُسلم"
      },
      {
        "id": 34111,
        "hadith_number": "5417",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kemenangan Muslim dan Penemuan Khazanah Kisra",
        "perawi_melayu": "Jabir bin Samurah",
        "english_text": "Daripada Jabir bin Samurah, dia berkata: \"Aku mendengar Rasulullah SAW bersabda: Sesungguhnya segolongan daripada umat Islam akan membuka khazanah Kisra yang terdapat di negeri putih.\"",
        "malay_translation": "Dari Jabir bin Samurah, dia berkata, \"Aku mendengar Rasulullah SAW bersabda, 'Pasti segolongan daripada umat Islam akan membuka khazanah Kisra yang terletak di negeri yang berwarna putih.'\" Diriwayatkan oleh Muslim.",
        "arabic_text": "وَعَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَتَفْتَحَنَّ عِصَابَةٌ مِنَ الْمُسْلِمِينَ كَنْزَ آلِ كِسْرَى الَّذِي فِي الْأَبْيَض» . رَوَاهُ مُسلم"
      },
      {
        "id": 34112,
        "hadith_number": "5418",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kehancuran Kerajaan Khosrow dan Kaisar serta Khazanah Mereka di Jalan Allah",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "And from Abu Hurairah he said: The Messenger of Allah (peace be upon him) said: \"Kisra has perished, and there will be no Kisra after him. Caesar will perish, and there will be no Caesar after him. And their treasures will be distributed in the way of Allah.\" And he named \"war as deceit\". Agreed upon (by Bukhari and Muslim).",
        "malay_translation": "Dan daripada Abu Hurairah, beliau berkata: Rasulullah SAW bersabda: \"Khosrow telah binasa, dan tidak akan ada lagi Khosrow selepasnya. Kaisar akan binasa, dan tidak akan ada lagi Kaisar selepasnya. Dan khazanah mereka akan diagihkan di jalan Allah.\" Dan baginda menyebut \"peperangan sebagai tipu daya\". Disepakati (oleh Bukhari dan Muslim).",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَلَكَ كِسْرَى فَلَا يَكُونُ كِسْرَى بَعْدَهُ وَقَيْصَرُ لِيَهْلِكَنَّ ثُمَّ لَا يَكُونُ قَيْصَرُ بَعْدَهُ وَلَتُقْسَمَنَّ كُنُوزُهُمَا فِي سَبِيلِ اللَّهِ» وَسَمَّى «الْحَرْبُ خُدْعَةٌ» . مُتَّفَقٌ عَلَيْهِ"
      },
      {
        "id": 34113,
        "hadith_number": "5419",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penaklukan Semenanjung Arab dan Wilayah Lain dalam Hadis Nabi",
        "perawi_melayu": "Nafis bin 'Utba",
        "english_text": "Daripada Nafis bin 'Utba, katanya: Rasulullah SAW bersabda: \"Kamu akan menyerang Jazirah Arab, lalu Allah akan menaklukkannya. Kemudian, kamu akan menyerang Parsi, lalu Allah akan menaklukkannya. Kemudian, kamu akan menyerang Rom, lalu Allah akan menaklukkannya. Kemudian, kamu akan menyerang Dajjal, lalu Allah akan menaklukkannya.\"",
        "malay_translation": "Daripada Nafis bin 'Utba, beliau berkata: Rasulullah SAW bersabda: \"Kamu akan menyerang Semenanjung Arab, maka Allah akan menaklukkannya. Kemudian, kamu akan menyerang Parsi, dan Allah akan menaklukkannya. Kemudian, kamu akan menyerang Rom, dan Allah akan menaklukkannya. Kemudian, kamu akan menyerang Dajjal, dan Allah akan menaklukkannya.\"",
        "arabic_text": "وَعَنْ نَافِعِ بْنِ عُتْبَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَغْزُونَ جَزِيرَةَ الْعَرَبِ فَيَفْتَحُهَا اللَّهُ ثُمَّ فَارِسَ فَيَفْتَحُهَا اللَّهُ ثُمَّ تَغْزُونَ الرُّومَ فَيَفْتَحُهَا اللَّهُ ثُمَّ تَغْزُونَ الدَّجَّال فيفتحه الله» . رَوَاهُ مُسلم"
      },
      {
        "id": 34114,
        "hadith_number": "5420",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Enam Perkara Sebelum Kiamat: Kematian Nabi, Pembukaan Baitul Maqdis, Wabak, Kelimpahan Harta, Fitnah, dan Perjanjian Dengan Bani Ashfar",
        "perawi_melayu": "Awf bin Malik",
        "english_text": "Not Available",
        "malay_translation": "Daripada Awf bin Malik, katanya: \"Aku menemui Rasulullah SAW di dalam ekspedisi Tabuk. Baginda berada di dalam khemah yang dibina dari tanah liat. Baginda bersabda: 'Hitunglah enam perkara yang akan berlaku sebelum hari kiamat: 1. KematianKu, 2. Pembukaan Baitul Maqdis, 3. Wabak yang akan melanda kalian seperti penyakit yang menyerang kambing, 4. Kelimpahan harta sehingga seorang lelaki diberikan seratus dinar tetapi tetap tidak puas hati, 5. Fitnah yang akan meliputi setiap rumah di Arab, dan 6. Perjanjian damai yang akan diadakan antara kamu dengan Bani Ashfar. Mereka akan melakukan pengkhianatan dan menyerang kamu dalam jumlah besar, iaitu lapan puluh kumpulan tentera besar. Setiap kumpulan tentera besar itu mengandungi dua belas ribu askar.\". Diriwayatkan oleh Imam Bukhari",
        "arabic_text": "وَعَن عَوْف بن مَالك قَالَ: أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةٍ تَبُوكَ وَهُوَ فِي قُبَّةٍ مِنْ أَدَمٍ فَقَالَ: اعْدُدْ سِتًّا بَيْنَ يَدَيِ السَّاعَةِ: مَوْتِي ثُمَّ فَتْحُ بَيْتِ الْمَقْدِسِ ثُمَّ مُوتَانٌ يَأْخُذُ فِيكُمْ كَقُعَاصِ الْغَنَمِ ثُمَّ اسْتِفَاضَةُ الْمَالِ حَتَّى يُعْطَى الرَّجُلُ مِائَةَ دِينَارٍ فَيَظَلُّ سَاخِطًا ثُمَّ فِتْنَةٌ لَا يَبْقَى بَيْتٌ مِنَ الْعَرَبِ إِلَّا دَخَلَتْهُ ثُمَّ هُدْنَةٌ تَكُونُ بَيْنَكُمْ وَبَيْنَ بَنِي الْأَصْفَرِ فَيَغْدِرُونَ فَيَأْتُونَكُمْ تَحْتَ ثَمَانِينَ غَايَةً تَحْتَ كُلِّ غَايَةٍ اثْنَا عَشَرَ أَلْفًا . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 34115,
        "hadith_number": "5421",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kemenangan Islam atas Rom dan Kejatuhan Konstantinopel",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah r.a., Rasulullah SAW bersabda: \"Hari kiamat tidak akan berlaku sehingga tentera Rom menyerang daerah dalam atau Dabiq, lalu keluarlah tentera terbaik dari penduduk Madinah menghadapi mereka pada hari itu. Apabila kedua-dua pihak berhadapan, Rom berkata: \"Biarkanlah kami dengan orang-orang yang telah mereka rampas untuk kami perangi.\" Para Muslimin menjawab: \"Demi Allah, tidak! Kami tidak akan membiarkan kamu dan saudara-saudara kami berpisah.\" Lalu mereka bertempur, dan satu pertiga dari tentera Rom tidak bertaubat selamanya. Satu pertiga dari mereka dibunuh sebagai syuhada yang paling mulia di sisi Allah, dan satu pertiga lain berjaya menakluk.  Mereka berjaya menakluk Konstantinopel, dan semasa mereka sedang membahagikan rampasan perang, mereka menggantung pedang mereka di atas pokok zaitun.  Tiba-tiba, syaitan berseru kepada mereka: \"Sesungguhnya Al-Masih telah berada di antara keluarga kamu.\" Mereka keluar, dan ini adalah palsu. Apabila mereka sampai ke Syam, beliau keluar, dan semasa mereka sedang membuat persiapan untuk peperangan, menyusun barisan, tiba-tiba solat dikumandangkan.  Kemudian Isa bin Maryam turun dan memimpin solat kepada mereka. Apabila musuh Allah melihatnya, dia hancur seperti garam yang larut dalam air. Sekiranya dia dibiarkan, dia pasti akan hancur sehingga binasa, tetapi Allah akan membunuhnya dengan tangannya sendiri. Dia akan menunjukkan darahnya pada pedangnya.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا تَقُومُ السَّاعَةُ حَتَّى يَنْزِلَ الرُّومُ بِالْأَعْمَاقِ أَوْ بِدَابِقَ فَيَخْرُجُ إِلَيْهِمْ جَيْشٌ مِنَ الْمَدِينَةِ مِنْ خِيَارِ أَهْلِ الْأَرْضِ يَوْمَئِذٍ فَإِذَا تَصَافُّوا قَالَتِ الرُّومُ: خَلُّوا بَيْنَنَا وَبَيْنَ الَّذِينَ سَبَوْا مِنَّا نُقَاتِلْهُمْ فَيَقُولُ الْمُسْلِمُونَ: لَا وَاللَّهِ لَا نُخَلِّي بَيْنَكُمْ وَبَيْنَ إِخْوَانِنَا فَيُقَاتِلُونَهُمْ فَيَنْهَزِمُ ثُلُثٌ لَا يَتُوبُ اللَّهُ عَلَيْهِمْ أَبَدًا وَيُقْتَلُ ثُلُثُهُمْ أَفْضَلُ الشُّهَدَاءِ عِنْدَ اللَّهِ وَيَفْتَتِحُ الثُّلُثُ لَا يُفْتَنُونَ أَبَدًا فَيَفْتَتِحُونَ قسطنطينية فَبينا هُمْ يَقْتَسِمُونَ الْغَنَائِمَ قَدْ عَلَّقُوا سُيُوفَهُمْ بِالزَّيْتُونِ إِذْ صَاحَ فِيهِمُ الشَّيْطَانُ: إِنَّ الْمَسِيحَ قَدْ خَلَفَكُمْ فِي أَهْلِيكُمْ فَيَخْرُجُونَ وَذَلِكَ بَاطِلٌ فَإِذَا جاؤوا الشامَ خرجَ فَبينا هُمْ يُعِدُّونَ لِلْقِتَالِ يُسَوُّونَ الصُّفُوفَ إِذْ أُقِيمَتِ الصَّلَاة فَينزل عِيسَى بن مَرْيَمَ فَأَمَّهُمْ فَإِذَا رَآهُ عَدُوُّ اللَّهِ ذَابَ كَمَا يَذُوبُ الْمِلْحُ فِي الْمَاءِ فَلَوْ تَرَكَهُ لَانْذَابَ حَتَّى يَهْلِكَ وَلَكِنْ يَقْتُلُهُ اللَّهُ بِيَدِهِ فيريهم دَمه فِي حربته . رَوَاهُ مُسلم"
      },
      {
        "id": 34116,
        "hadith_number": "5422",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kiamat Tidak Akan Datang Hingga Tidak Ada Lagi Pembahagian Warisan Dan Kegembiraan Atas Ghaibah",
        "perawi_melayu": "Abdullah bin Mas'ud",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abdullah bin Mas'ud, beliau berkata: Sesungguhnya Hari Kiamat tidak akan berlaku sehingga tidak ada lagi pembahagian harta warisan dan tidak ada lagi kegembiraan atas rampasan. Kemudian beliau berkata: Musuh akan berkumpul menyerang penduduk Syam, dan penduduk Islam (maksudnya Rom) akan berkumpul membantu mereka. Para Muslim akan bersumpah mati dalam peperangan tidak akan berundur melainkan menang. Mereka akan berperang sehingga malam memisahkan mereka, lalu mereka berundur dan kumpulan ini dan kumpulan itu, masing-masing bukan yang menang. Kemudian perjanjian perang ini berakhir. Kemudian para Muslim sekali lagi bersumpah mati dalam peperangan, tidak akan berundur melainkan menang. Mereka akan berperang sehingga malam memisahkan mereka, lalu mereka berundur dan kumpulan ini dan kumpulan itu, masing-masing bukan yang menang. Perjanjian perang ini berakhir. Kemudian para Muslim sekali lagi bersumpah mati dalam peperangan, tidak akan berundur melainkan menang. Mereka akan berperang sehingga malam memisahkan mereka, lalu mereka berundur dan kumpulan ini dan kumpulan itu, masing-masing bukan yang menang. Perjanjian perang ini berakhir. Kemudian pada hari yang keempat, baki orang Islam akan menyerbu mereka, dan Allah akan menjadikan kekalahan itu atas mereka. Mereka akan dibantai dalam peperangan yang tidak pernah dilihat seperti itu, sehingga burung pun akan terjatuh di atas mereka tanpa meninggalkan satu pun. Bahkan keturunan kaum lelaki, yang berjumlah seratus orang, tidak akan menemui satu pun yang tinggal melainkan seorang lelaki. Maka, bagaimana kita akan gembira atas rampasan atau membahagi warisan? Ketika mereka dalam keadaan seperti itu, mereka mendengar tentang malapetaka yang lebih besar daripada itu. Lalu tibanya panggilan, bahawa Dajjal telah mengejar mereka di tengah-tengah tenteranya. Mereka akan membuang apa yang ada di tangan mereka dan kembali, mereka menghantar sepuluh orang berkuda sebagai peninjau. Rasulullah SAW bersabda: \"Sesungguhnya aku mengetahui nama mereka dan nama bapa mereka, serta warna kuda mereka. Mereka adalah para berkuda yang terbaik di atas muka bumi pada hari itu.\"",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: إِنَّ الساعةَ لَا تقومُ حَتَّى لَا يُقْسَمَ ميراثٌ وَلَا يُفْرَحَ بِغَنِيمَةٍ. ثُمَّ قَالَ: عَدُوٌّ يَجْمَعُونَ لِأَهْلِ الشَّامِ وَيَجْمَعُ لَهُمْ أَهْلُ الْإِسْلَامِ (يَعْنِي الرّوم) فيتشرَّطُ الْمُسْلِمُونَ شُرْطَةً لِلْمَوْتِ لَا تَرْجِعُ إِلَّا غَالِبَةً فَيَقْتَتِلُونَ حَتَّى يَحْجِزَ بَيْنَهُمُ اللَّيْلُ فَيَفِيءُ هَؤُلَاءِ وَهَؤُلَاء كل غير غَالب وتفنى الشرطة ثمَّ يَتَشَرَّطُ الْمُسْلِمُونَ شُرْطَةً لِلْمَوْتِ لَا تَرْجِعُ إِلَّا غالبة فيقتتلون حت يَحْجِزَ بَيْنَهُمُ اللَّيْلُ فَيَفِيءُ هَؤُلَاءِ وَهَؤُلَاءِ كُلٌّ غير غَالب وتفنى الشرطة ثمَّ يشْتَرط الْمُسْلِمُونَ شُرْطَةً لِلْمَوْتِ لَا تَرْجِعُ إِلَّا غَالِبَةً فيقتتلون حَتَّى يُمْسُوا فَيَفِيءُ هَؤُلَاءِ وَهَؤُلَاءِ كُلٌّ غَيْرُ غَالِبٍ وَتَفْنَى الشُّرْطَةُ فَإِذَا كَانَ يَوْمُ الرَّابِعِ نَهَد إِليهم بقيةُ أهلِ الإِسلام فيجعلُ الله الدَبَرةَ عَلَيْهِم فيقتلون مَقْتَلَةً لَمْ يُرَ مِثْلُهَا حَتَّى إِنَّ الطَّائِرَ ليمر يجنابتهم فَلَا يُخَلِّفُهُمْ حَتَّى يَخِرَّ مَيِّتًا فَيَتَعَادَّ بَنُو الْأَبِ كَانُوا مِائَةً فَلَا يَجِدُونَهُ بَقِيَ مِنْهُمْ إِلَّا الرَّجُلُ الْوَاحِدُ فَبِأَيِّ غَنِيمَةٍ يُفْرَحُ أَوْ أيّ مِيرَاث يقسم؟ فَبينا هُمْ كَذَلِكَ إِذْ سَمِعُوا بِبَأْسٍ هُوَ أَكْبَرُ مِنْ ذَلِكَ فَجَاءَهُمُ الصَّرِيخُ: أَنَّ الدَّجَّالَ قَدْ خَلَفَهُمْ فِي ذَرَارِيِّهِمْ فَيَرْفُضُونَ مَا فِي أَيْدِيهِمْ وَيُقْبِلُونَ فَيَبْعَثُونَ عَشْرَ فَوَارِسَ طَلِيعَةً . قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنِّي لَأَعْرِفُ أَسْمَاءَهُمْ وَأَسْمَاءَ آبَائِهِمْ وَأَلْوَانَ خُيُولِهِمْ هُمْ خَيْرُ فَوَارِسَ أَوْ مِنْ خَيْرِ فَوَارِسَ عَلَى ظَهْرِ الأَرْض يَوْمئِذٍ» . رَوَاهُ مُسلم"
      },
      {
        "id": 34117,
        "hadith_number": "5423",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kisah Kota Yang Menghadap Darat dan Laut, dan Kedatangan Dajjal",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah, bahawa Nabi SAW bersabda, \"Adakah kamu pernah mendengar tentang sebuah kota yang mempunyai satu bahagian di darat dan satu bahagian di laut?\" Mereka menjawab, \"Ya, wahai Rasulullah.\" Baginda bersabda, \"Hari Kiamat tidak akan berlaku sehingga 70,000 orang daripada Bani Israil menyerang kota tersebut. Apabila mereka sampai di situ, mereka tidak berperang dengan senjata dan tidak memanah dengan anak panah. Sebaliknya, mereka berkata, \"La ilaha illallah, Allahuakbar.\" Lalu, satu bahagian kota itu runtuh.  Kemudian, kata Thura bin Yazid, perawi ini berkata: \"Mereka (yang di laut) akan berkata buat kali kedua: La ilaha illallah, Allahuakbar\", maka runtuhlah bahagian kota yang lain. Kemudian mereka berkata buat kali ketiga: La ilaha illallah, Allahuakbar\", lalu terbukalah jalan bagi mereka untuk masuk ke dalam kota itu.  Mereka mengambil rampasan perang, sedang mereka berkongsi rampasan perang itu, tiba-tiba terdengar seruan. Mereka mendengar, \"Sesungguhnya Dajjal telah keluar.\" Maka, mereka meninggalkan semua barang dan kembali (dari medan pertempuran).\" Diriwayatkan oleh Muslim.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «هَلْ سَمِعْتُمْ بِمَدِينَةٍ جَانِبٌ مِنْهَا فِي الْبَرِّ وَجَانِبٌ مِنْهَا فِي الْبَحْرِ؟» قَالُوا: نَعَمْ يَا رَسُولَ اللَّهِ قَالَ: لَا تَقُومُ السَّاعَةُ حَتَّى يَغْزُوَهَا سَبْعُونَ أَلْفًا مِنْ بني إِسحاق فَإِذا جاؤوها نَزَلُوا فَلَمْ يُقَاتِلُوا بِسِلَاحٍ وَلَمْ يَرْمُوا بِسَهْمٍ قَالَ: لَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ فَيَسْقُطُ أحدُ جانبيها. - قالَ ثورُ بنُ يزِيد الرَّاوِي: لَا أَعْلَمُهُ إِلَّا قَالَ -: الَّذِي فِي الْبَحْر يَقُولُونَ الثَّانِيَةَ: لَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ فَيَسْقُطُ جَانِبُهَا الْآخَرُ ثُمَّ يَقُولُونَ الثَّالِثَةَ: لَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ فَيُفَرَّجُ لَهُم فيدخلونها فيغنمون فَبينا هُمْ يَقْتَسِمُونَ الْمَغَانِمَ إِذْ جَاءَهُمُ الصَّرِيخُ فَقَالَ: إِنَّ الدَّجَّالَ قَدْ خَرَجَ فَيَتْرُكُونَ كُلَّ شَيْءٍ ويرجعون . رَوَاهُ مُسلم"
      },
      {
        "id": 34118,
        "hadith_number": "5424",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kehancuran Baitul Maqdis dan Kejatuhan Konstantinopel Sebagai Petanda Kedatangan Dajjal",
        "perawi_melayu": "Mu'adz bin Jabal",
        "english_text": "From Mu'adz bin Jabal, he said: The Messenger of Allah (peace and blessings be upon him) said, \"The destruction of Baitul Maqdis is the destruction of Yathrib (Madinah), and the destruction of Yathrib is the outbreak of the great war, and the outbreak of the great war is the conquest of Constantinople, and the conquest of Constantinople is the emergence of the Dajjal.\"",
        "malay_translation": "Daripada Mu'adz bin Jabal, beliau berkata: Rasulullah SAW bersabda, \"Kehancuran Baitul Maqdis adalah kehancuran Yathrib (Madinah), dan kehancuran Yathrib adalah permulaan peperangan besar, dan peperangan besar itu membawa kepada penaklukan Constantinople, dan penaklukan Constantinople menandakan kemunculan Dajjal.\"",
        "arabic_text": "عَنْ مُعَاذِ بْنِ جَبَلٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «عُمْرَانُ بَيْتِ الْمَقْدِسِ خَرَابُ يَثْرِبَ وَخَرَابُ يَثْرِبَ خُرُوجُ الْمَلْحَمَةِ وَخُرُوجُ الْمَلْحَمَةِ فَتْحُ قُسْطَنْطِينِيَّةَ وَفَتْحُ قُسْطَنْطِينِيَّةَ خُرُوجُ الدَّجَّال» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 34119,
        "hadith_number": "5425",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perihal Perang Besar, Pembukaan Konstantinopel dan Kemunculan Dajjal dalam Tempoh Tujuh Bulan",
        "perawi_melayu": null,
        "english_text": null,
        "malay_translation": "Daripadanya, beliau berkata: Rasulullah SAW bersabda, \"Perang Besar, Pembukaan Konstantinopel dan kemunculan Dajjal dalam tempoh tujuh bulan.\" Diriwayatkan oleh Imam Tirmizi dan Imam Abu Daud.",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «الملحمة الْعُظْمَى وَفتح القسطنطينة وَخُرُوجُ الدَّجَّالِ فِي سَبْعَةِ أَشْهُرٍ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد"
      },
      {
        "id": 34120,
        "hadith_number": "5426",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tempoh Antara Perang Besar dan Pembukaan Madinah Serta Kemunculan Dajjal",
        "perawi_melayu": "Abdullah bin Busyr",
        "english_text": "Daripada Abdullah bin Busyr bahawa Rasulullah SAW bersabda: \"Antara peperangan besar dan pembukaan Madinah adalah enam tahun, dan Dajjal akan muncul pada tahun ketujuh.\"",
        "malay_translation": "Daripada Abdullah bin Busyr, bahawa Rasulullah SAW bersabda: \"Antara peperangan besar dan pembukaan Madinah adalah enam tahun, dan Dajjal akan muncul pada tahun ketujuh.\" Riwayat ini diriwayatkan oleh Imam Abu Dawud dan beliau menyatakan bahawa ini adalah hadis yang sahih.",
        "arabic_text": "وَعَن عبد الله بن بُسر أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «بَيْنَ الْمَلْحَمَةِ وَفَتْحِ الْمَدِينَةِ سِتُّ سِنِينَ وَيَخْرُجُ الدَّجَّالُ فِي السَّابِعَةِ» . رَوَاهُ أَبُو دَاوُدَ وَقَالَ: هَذَا أصح"
      },
      {
        "id": 34121,
        "hadith_number": "5427",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keadaan Islam di Masa Hadapan (Islam akan Dihimpit Pada Masa Depan)",
        "perawi_melayu": "Ibn Umar",
        "english_text": "And from Ibn Umar he said:  The Muslims will soon be besieged in Madinah until the most distant of their weapons will be a weapon and a weapon will be near Khaybar. It was narrated by Abu Dawud.",
        "malay_translation": "Daripada Ibn Umar, baginda berkata:  Islam akan segera dikepung di Madinah sehingga senjata yang paling jauh akan menjadi senjata, dan senjata yang lain akan dekat dengan Khaybar. Diriwayatkan oleh Abu Dawud.",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ قَالَ: يُوشِكُ الْمُسْلِمُونَ أَنْ يُحَاصَرُوا إِلَى الْمَدِينَةِ حَتَّى يَكُونَ أَبْعَدَ مَسَالِحِهِمْ سَلَاحٌ وَسَلَاحٌ: قَرِيبٌ مِنْ خَيْبَرَ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 34122,
        "hadith_number": "5428",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perjanjian Damai dengan Rom dan Perang Terus",
        "perawi_melayu": "Zi Mikhbar",
        "english_text": "Not Available",
        "malay_translation": "Daripada Zi Mikhbar, katanya: \"Aku mendengar Rasulullah SAW bersabda: \"Kamu akan berdamai dengan orang-orang Rom dengan keamanan, kemudian kamu berperang bersama mereka sebagai musuh di belakang kamu, maka kamu akan dibantu dan memperoleh rampasan perang dan keselamatan. Kemudian kamu akan kembali sehingga kamu turun di sebuah kawasan yang berbukit-bukit. Maka seorang lelaki daripada kaum Nasrani mengangkat salib lalu berkata: \"Salib telah menang.\" Lalu seorang lelaki daripada kalangan umat Islam marah dan memukulnya. Pada ketika itu, orang-orang Rom akan mengkhianati dan berkumpul untuk peperangan. Sesetengah riwayat menambah, \"Kemudian umat Islam bangkit menggunakan senjata mereka dan bertempur. Maka Allah memuliakan pasukan itu dengan syahid.\".  Riwayat ini dikeluarkan oleh Imam Abu Daud.",
        "arabic_text": "وَعَن ذِي مِخبَرٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: سَتُصَالِحُونَ الرُّومَ صُلْحًا آمِنًا فَتَغْزُونَ أَنْتُمْ وَهُمْ عَدُوًّا مِنْ وَرَائِكُمْ فَتُنْصَرُونَ وَتَغْنَمُونَ وَتَسْلَمُونَ ثُمَّ تَرْجِعُونَ حَتَّى تَنْزِلُوا بِمَرْجٍ ذِي تُلُولٍ فَيَرْفَعُ رَجُلٌ مِنْ أَهْلِ النَّصْرَانِيَّةِ الصَّلِيبَ فَيَقُولُ: غَلَبَ الصَّلِيبُ فَيَغْضَبُ رَجُلٌ مِنَ الْمُسْلِمِينَ فَيَدُقُّهُ فَعِنْدَ ذَلِكَ تَغْدِرُ الرُّومُ وَتَجْمَعُ لِلْمَلْحَمَةِ وَزَادَ بَعْضُهُمْ: «فَيَثُورُ الْمُسْلِمُونَ إِلَى أَسْلِحَتِهِمْ فَيَقْتَتِلُونَ فيكرم الله تِلْكَ الْعِصَابَة بِالشَّهَادَةِ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 34123,
        "hadith_number": "5429",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mengganggu Orang Habsyi dan Kewujudan Orang Khas untuk Mencari Khazanah Kaabah",
        "perawi_melayu": "Abdullah bin 'Amr",
        "english_text": "Daripada Abdullah bin 'Amr daripada Nabi SAW, baginda bersabda: \"Tinggalkanlah Habsyi selagi mereka tidak mengganggu kamu. Kerana sesungguhnya, hanya orang Habsyi yang berpakaian dua gelang (suwaqatain) sahaja yang mampu mengeluarkan khazanah Kaabah.\"",
        "malay_translation": "Daripada Abdullah bin 'Amr daripada Nabi SAW, baginda bersabda: \"Tinggalkanlah kaum Habsyi selagi mereka tidak mengganggu kamu. Kerana sesungguhnya, hanya orang Habsyi yang berpakaian dua gelang (suwaqatain) sahaja yang mampu mengeluarkan khazanah Kaabah.\"",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «اتْرُكُوا الْحَبَشَةَ مَا تَرَكُوكُمْ فَإِنَّهُ لَا يَسْتَخْرِجُ كَنْزَ الْكَعْبَةِ إِلَّا ذُو السُّوَيْقَتَيْنِ مِنَ الْحَبَشَةِ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 34124,
        "hadith_number": "5430",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Berlembut dengan Habshah dan Turki Selagi Mereka Berlembut dengan Kamu",
        "perawi_melayu": "Seorang Sahabat Nabi Muhammad SAW",
        "english_text": "Not Available",
        "malay_translation": "Daripada seorang lelaki daripada kalangan sahabat Nabi SAW bersabda: “Biarkan Habsyah selagi mereka membiarkan kamu, dan tinggalkan Turki selagi mereka meninggalkan kamu.”  (Riwayat Abu Daud dan Nasa'i)",
        "arabic_text": "وَعَنْ رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «دَعُوا الْحَبَشَةَ مَا وَدَعُوكُمْ وَاتْرُكُوا التُّرْكَ مَا تَرَكُوكُمْ» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيّ"
      },
      {
        "id": 34125,
        "hadith_number": "5431",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Peperangan Menentang Kaum Bermata Kecil (Turki) dan Akibatnya",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Buraidah, daripada Nabi SAW dalam sebuah hadith: “Kamu akan diperangi oleh kaum bermata kecil,” iaitu orang Turki. Baginda bersabda: “Kamu akan menghalau mereka tiga kali sehingga kamu mengejar mereka ke Jazirah Arab. Adapun halauan pertama, mereka yang melarikan diri akan selamat. Adapun yang kedua, sebahagian akan selamat dan sebahagian akan binasa. Adapun yang ketiga, mereka akan dibinasakan habis.” Atau sebagaimana yang baginda sabdakan. Riwayat Abu Daud.",
        "arabic_text": "وَعَنْ بُرَيْدَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَدِيثٍ: «يُقَاتِلُكُمْ قَوْمٌ صِغَارُ الْأَعْيُنِ» يَعْنِي التّرْك. قَالَ: «تسوقونهم ثَلَاث مَرَّات حَتَّى تلحقوهم بِجَزِيرَة الْعَرَب فَأَما السِّيَاقَةِ الْأُولَى فَيَنْجُو مَنْ هَرَبَ مِنْهُمْ وَأَمَّا الثَّانِيَة فينجو بعض وَيهْلك بعض وَأما الثَّالِثَةِ فَيُصْطَلَمُونَ» أَوْ كَمَا قَالَ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 34126,
        "hadith_number": "5432",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keadaan Sesuatu Negeri di Akhir Zaman",
        "perawi_melayu": "Abu Bakarah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Bakarah, bahawa Rasulullah SAW bersabda: \"Akan datang segolongan umatku ke sebuah kawasan yang dikenali sebagai al-Basrah di tepi sungai yang dinamakan Dajlah (Euphrates). Di situ ada jambatan dan penduduknya ramai, dan ia merupakan salah satu bandar penting umat Islam. Apabila tiba di akhir zaman, akan datang kaum Qanturah. Mereka memiliki wajah-wajah yang cerah dan mata yang kecil. Mereka akan turun ke tebing sungai, kemudian penduduknya akan terpecah kepada tiga kumpulan. Satu kumpulan akan mengikuti ekor lembu dan binatang liar, lalu binasa. Satu kumpulan akan mengambil untuk diri mereka sendiri, lalu binasa. Satu kumpulan pula akan meletakkan anak-anak mereka di belakang mereka dan berjuang bersama mereka, dan mereka inilah yang syahid.\"",
        "arabic_text": "وَعَن أبي بكرَة أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: يَنْزِلُ أُنَاسٌ مِنْ أُمَّتِي بِغَائِطٍ يُسَمُّونَهُ الْبَصْرَةَ عِنْدَ نَهْرٍ يُقَالُ لَهُ: دِجْلَةُ يَكُونُ عَلَيْهِ جِسْرٌ يَكْثُرُ أَهْلُهَا وَيَكُونُ مِنْ أَمْصَارِ الْمُسْلِمِينَ وَإِذَا كَانَ فِي آخِرِ الزَّمَانِ جَاءَ بَنُو قَنْطُورَاءَ عِرَاضُ الْوُجُوهِ صِغَارُ الْأَعْيُنِ حَتَّى يَنْزِلُوا عَلَى شَطِّ النَّهْرِ فَيَتَفَرَّقُ أَهْلُهَا ثَلَاثَ فِرَقٍ فِرْقَةٌ يَأْخُذُونَ فِي أَذْنَابِ الْبَقَرِ وَالْبَرِّيَّةِ وَهَلَكُوا وَفِرْقَةٌ يَأْخُذُونَ لِأَنْفُسِهِمْ وَهَلَكُوا وَفِرْقَةٌ يَجْعَلُونَ ذَرَارِيَّهُمْ خَلْفَ ظُهُورِهِمْ وَيُقَاتِلُونَهُمْ وَهُمُ الشُّهَدَاءُ . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 34127,
        "hadith_number": "5433",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Amaran Tentang Bahaya di Basrah (Al-Basrah)",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Anas RA, bahawa Rasulullah SAW bersabda: \"Wahai Anas, sesungguhnya manusia akan membina bandar-bandar. Jika satu daripada bandar-bandar itu disebut Basrah, jika kamu melaluinya atau memasukinya, maka jauhilah tanah bergaramnya, tumbuh-tumbuhannya, pohon kurmanya, pasarnya, dan pintu-pintu para pemimpinnya. Hendaklah kamu berada di pinggirannya, kerana di sana akan terjadi penurunan (ke bumi), lontaran (batu), dan gempa bumi. Dan suatu kaum yang bermalam dan berpagi hari menjadi kera dan babi.\" (Riwayat Abu Daud)",
        "arabic_text": "وَعَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: يَا أَنَسُ إِنَّ النَّاسَ يمصِّرون أمصاراً فَإِن مِصْرًا مِنْهَا يُقَالُ لَهُ: الْبَصْرَةُ فَإِنْ أَنْتَ مَرَرْتَ بِهَا أَوْ دَخَلْتَهَا فَإِيَّاكَ وَسِبَاخَهَا وَكَلَأَهَا ونخيلها وَسُوقَهَا وَبَابَ أُمَرَائِهَا وَعَلَيْكَ بِضَوَاحِيهَا فَإِنَّهُ يَكُونُ بهَا خَسْفٌ وقذفٌ ورجْفٌ وقومٌ يبيتُونَ ويصبحون قردة وَخَنَازِير رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 34128,
        "hadith_number": "5434",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Masjid Al-Asy'ar dan Peranannya di Hari Kiamat",
        "perawi_melayu": null,
        "english_text": null,
        "malay_translation": "Dan daripada Salleh bin Dirham berkata, \"Kami berangkat mengerjakan haji, lalu kami bertemu dengan seorang lelaki. Lelaki itu bertanya kepada kami, 'Di sebelah kamu terdapat sebuah kampung yang bernama Al-Uballah? 'Kami menjawab, 'Ya.' Lelaki itu berkata, 'Siapakah di antara kamu yang dapat menjamin bagi saya untuk menunaikan dua atau empat rakaat solat untuk saya di Masjid Al-Asy'ar, dan menyebutkannya untuk Abu Hurairah?' Aku mendengar Khalilku, Abu al-Qasim, semoga Allah SWT merahmatinya, berkata, 'Sesungguhnya Allah SWT akan bangkitkan dari Masjid Al-Asy'ar pada Hari Kiamat beberapa orang saksi. Tidak ada orang lain yang akan berdiri bersama para saksi dari Perang Badar melainkan mereka.' Dikeluarkan oleh Imam Abu Daud. Dan beliau berkata, 'Masjid ini berhampiran dengan sungai, dan kita akan sebutkan hadis Abu Ad-Darda': Sesungguhnya, kawasan penempatan orang-orang Islam.' Dalam bab tentang menyebut Yaman dan Syam. InsyaAllah.",
        "arabic_text": "وَعَن صَالح بن دِرْهَم يَقُولُ: انْطَلَقْنَا حَاجِّينَ فَإِذَا رَجُلٌ فَقَالَ لَنَا: إِلَى جَنْبِكُمْ قَرْيَةٌ يُقَالُ لَهَا: الْأُبُلَّةُ؟ قُلْنَا: نَعَمْ. قَالَ: مَنْ يَضْمَنُ لِي مِنْكُمْ أَنْ يُصَلِّيَ لِي فِي مَسْجِدِ الْعَشَّارِ رَكْعَتَيْنِ أَوْ أَرْبَعًا وَيَقُولُ هَذِهِ لِأَبِي هُرَيْرَةَ؟ سَمِعْتُ خَلِيلِي أَبَا الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ اللَّهَ عَزَّ وَجَلَّ يَبْعَثُ مِنْ مَسْجِدِ الْعَشَّارِ يَوْمَ الْقِيَامَةِ شُهَدَاءَ لَا يَقُومُ مَعَ شُهَدَاءِ بَدْرٍ غَيْرُهُمْ» . رَوَاهُ أَبُو دَاوُدَ. وَقَالَ: هَذَا الْمَسْجِدُ مِمَّا يَلِي النَّهْرَ وَسَنَذْكُرُ حَدِيثَ أَبِي الدَّرْدَاءِ: «إِنَّ فُسْطَاطَ الْمُسْلِمِينَ» فِي بَابِ: «ذِكْرِ الْيَمَنِ وَالشَّامِ» . إِنْ شَاءَ اللَّهُ تَعَالَى"
      },
      {
        "id": 34129,
        "hadith_number": "5435",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Peringatan Tentang Fitnah dan Peranan Amal Saleh Dalam Menentang Fitnah",
        "perawi_melayu": "Huzayfah bin Yaman r.a.",
        "english_text": null,
        "malay_translation": "Daripada Syqiq daripada Huzayfah, katanya: Kami berada di sisi Umar, lalu beliau bertanya, \"Siapakah di antara kamu yang hafal hadis Rasulullah SAW tentang fitnah?\" Aku menjawab, \"Saya.\" Beliau berkata, \"Bacalah, sesungguhnya engkau seorang yang berani, dan bagaimana caranya?\" Aku berkata, \"Aku telah mendengar Rasulullah SAW bersabda, 'Fitnah seseorang itu terletak pada isterinya, hartanya, dirinya sendiri, anaknya dan jirannya. Ia dapat diatasi dengan berpuasa, solat, sedekah, menyuruh kepada kebaikan dan mencegah kemungkaran.'\" Umar berkata, \"Ini bukan yang aku maksudkan. Aku maksudkan fitnah yang bergejolak seperti ombak laut.\" Aku berkata, \"Apa urusan anda dengannya wahai Amirul Mukminin? Sesungguhnya di antara engkau dan ia terdapat pintu yang tertutup.\" Beliau bertanya, \"Maka adakah pintu itu dihancurkan atau dibuka?\" Aku menjawab, \"Tidak, tetapi dihancurkan.\" Beliau berkata, \"Itu lebih baik supaya ia tidak tertutup selama-lamanya.\" Kemudian kami bertanya kepada Huzayfah, \"Adakah Umar mengetahui siapa yang berada di balik pintu itu?\" Beliau menjawab, \"Ya, sebagaimana beliau mengetahui bahawa malam menanti selepas siang, sesungguhnya aku telah menyampaikan hadis yang benar kepadanya.\" Maka kami bersetuju untuk bertanya kepada Huzayfah tentang siapa yang berada di balik pintu tersebut. Kemudian kami berkata kepada Masruq, \"Tanya dia.\" Lalu Masruq bertanya, dan beliau menjawab, \"Umar.\" Diriwayatkan oleh Imam al-Bukhari dan Muslim.",
        "arabic_text": "عَن شَقِيق عَن حُذَيْفَة قَالَ: كُنَّا عِنْدَ عُمَرَ فَقَالَ: أَيُّكُمْ يَحْفَظُ حَدِيثِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْفِتْنَةِ؟ فَقُلْتُ: أَنَا أَحْفَظُ كَمَا قَالَ: قَالَ: هَاتِ إِنَّكَ لِجَرِيءٌ وَكَيْفَ؟ قَالَ: قُلْتُ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ «فِتْنَةُ الرَّجُلِ فِي أَهْلِهِ وَمَالِهِ وَنَفْسِهِ وَوَلَدِهِ وَجَارِهِ يُكَفِّرُهَا الصِّيَامُ وَالصَّلَاةُ وَالصَّدَقَةُ وَالْأَمْرُ بِالْمَعْرُوفِ وَالنَّهْيُ عَنِ الْمُنْكَرِ» فَقَالَ عُمَرُ: لَيْسَ هَذَا أُرِيدُ إِنَّمَا أُرِيدُ الَّتِي تَمُوجُ كَمَوْجِ الْبَحْر. قَالَ: مَا لَكَ وَلَهَا يَا أَمِيرَ الْمُؤْمِنِينَ؟ إِنَّ بَيْنَكَ وَبَيْنَهَا بَابًا مُغْلَقًا. قَالَ: فَيُكْسَرُ الْبَابُ أويفتح؟ قَالَ: قُلْتُ: لَا بَلْ يُكْسَرُ. قَالَ: ذَاكَ أَحْرَى أَنْ لَا يُغْلَقَ أَبَدًا. قَالَ: فَقُلْنَا لحذيفةَ: هَل كَانَ عمر يعلم مَنِ البابُ؟ قَالَ: نَعَمْ كَمَا يَعْلَمُ أَنَّ دُونَ غَدٍ لَيْلَةٌ إِنِّي حَدَّثْتُهُ حَدِيثًا لَيْسَ بِالْأَغَالِيطِ قَالَ: فَهِبْنَا أَنْ نَسْأَلَ حُذَيْفَةَ مَنِ الْبَابُ؟ فَقُلْنَا لِمَسْرُوقٍ: سَلْهُ. فَسَأَلَهُ فَقَالَ: عُمَرُ. مُتَّفَقٌ عَلَيْهِ"
      },
      {
        "id": 34130,
        "hadith_number": "5436",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pembinaan Konstantinopel Menandakan Kedatangan Hari Kiamat",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "And from Anas, he said: The conquest of Constantinople will coincide with the coming of the Hour. It was narrated by al-Tirmidhi. And he said: This is a strange hadith.",
        "malay_translation": "Dan daripada Anas, beliau berkata: Pembukaan Konstantinopel akan bersamaan dengan kedatangan Hari Kiamat. Ia diriwayatkan oleh al-Tirmidzi. Dan beliau berkata: Hadis ini adalah hadis yang ganjil.",
        "arabic_text": "وَعَن أنسٍ قَالَ: فَتْحُ القسطنطينة مَعَ قِيَامِ السَّاعَةِ. رَوَاهُ التِّرْمِذِيُّ. وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ"
      },
      {
        "id": 34131,
        "hadith_number": "5437",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tanda-tanda Kiamat: Ilmu Diangkat, Kejahilan Berleluasa, Zina dan Arak Bermaharajalela",
        "perawi_melayu": "Diriwayatkan daripada Anas RA, beliau berkata:",
        "english_text": "Not Available",
        "malay_translation": "\"Saya mendengar Rasulullah SAW bersabda: 'Sesungguhnya di antara tanda-tanda Kiamat adalah ilmu diangkat, kejahilan berleluasa, zina bermaharajalela, arak diminum dengan meluas, lelaki berkurangan dan wanita bertambah banyak sehingga seorang lelaki bertanggungjawab terhadap lima puluh orang wanita.' Dalam riwayat lain: 'Ilmu berkurangan dan kejahilan zahir.' Muttafaq 'alaih (disepakati oleh Bukhari dan Muslim).\"",
        "arabic_text": "عَنْ أَنَسٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ يُرْفَعَ الْعِلْمُ وَيَكْثُرَ الْجَهْلُ وَيَكْثُرَ الزِّنا ويكثُرَ شُربُ الخمرِ ويقِلَّ الرِّجالُ وتكثُرَ النِّسَاءُ حَتَّى يَكُونَ لِخَمْسِينَ امْرَأَةً الْقَيِّمُ الْوَاحِدُ» . وَفِي رِوَايَةٍ: «يَقِلُّ الْعِلْمُ وَيَظْهَرُ الْجَهْلُ» . مُتَّفَقٌ عَلَيْهِ"
      },
      {
        "id": 34132,
        "hadith_number": "5438",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Waspada Terhadap Pendusta di Zaman Akhir",
        "perawi_melayu": "Jabir bin Samurah",
        "english_text": "Dari Jabir bin Samurah, dia berkata: Aku mendengar Rasulullah SAW bersabda: Sesungguhnya di hadapan hari kiamat ada pendusta-pendusta, maka berhati-hatilah terhadap mereka.",
        "malay_translation": "Dari Jabir bin Samurah, beliau berkata: Aku mendengar Rasulullah SAW bersabda: Sesungguhnya di hadapan hari kiamat terdapat orang-orang pendusta, maka berhati-hatilah terhadap mereka.",
        "arabic_text": "وَعَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ: سَمِعْتُ رَسُولَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ بَيْنَ يَدَيِ السَّاعَةِ كَذَّابِينَ فَاحْذَرُوهُمْ» . رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 34133,
        "hadith_number": "5439",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tanda-tanda Kehancuran: Hilangnya Amanah",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Daripada Abu Hurairah, dia berkata: Nabi SAW sedang bercerita, tiba-tiba datang seorang Arab Badwi dan bertanya, \"Bilakah Hari Kiamat?\" Nabi SAW menjawab, \"Apabila amanah diabaikan, maka tunggulah Hari Kiamat.\"  Orang Arab itu bertanya, \"Bagaimana amanah diabaikan?\" Nabi SAW menjawab, \"Apabila urusan diserahkan kepada orang yang bukan ahlinya, maka tunggulah Hari Kiamat.\" Diriwayatkan oleh Imam Bukhari.",
        "malay_translation": "Daripada Abu Hurairah, beliau berkata: Nabi SAW sedang menyampaikan kisah, tiba-tiba datang seorang Arab Badwi lalu bertanya, \"Bilakah Hari Kiamat tiba?\" Nabi SAW menjawab, \"Apabila amanah telah diabaikan, maka tunggulah kedatangan Hari Kiamat.\"  Orang Arab itu bertanya lagi, \"Bagaimanakah amanah diabaikan?\" Nabi SAW menjawab, \"Apabila urusan diserahkan kepada orang yang bukan ahlinya, maka tunggulah Hari Kiamat.\"  Hadis ini diriwayatkan oleh Imam Bukhari.",
        "arabic_text": "وَعَن أبي هريرةَ قَالَ: بَيْنَمَا كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحَدِّثُ إِذْ جَاءَ أَعْرَابِيٌّ فَقَالَ: مَتَى السَّاعَةُ؟ قَالَ: «إِذَا ضُيِّعَتِ الْأَمَانَةُ فَانْتَظِرِ السَّاعَةَ» . قَالَ: كَيْفَ إِضَاعَتُهَا؟ قَالَ: «إِذَا وُسِّدَ الْأَمْرُ إِلَى غَيْرِ أَهْلِهِ فَانْتَظِرِ السَّاعَةَ» . رَوَاهُ الْبُخَارِيُّ"
      },
      {
        "id": 34134,
        "hadith_number": "5440",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tanda-Tanda Kiamat: Harta Melimpah, Tanah Arab Subur",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada beliau (Abu Hurairah R.A), Rasulullah SAW bersabda: \"Tidak akan terjadi Kiamat sehingga harta menjadi banyak dan melimpah ruah, sehingga seseorang mengeluarkan zakat hartanya tetapi tidak menemui seorang pun yang mahu menerimanya, dan sehingga tanah Arab kembali menjadi padang rumput dan sungai.\" (Riwayat Muslim). Dalam riwayat lain: Baginda bersabda: \"Rumah-rumah akan sampai ke Ihāb atau Yuhāb.\"",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «لَا تَقُومُ السَّاعَةُ حَتَّى يَكْثُرَ الْمَالُ وَيَفِيضَ حَتَّى يُخْرِجَ الرَّجُلُ زَكَاةَ مَالِهِ فَلَا يَجِدُ أَحَدًا يَقْبَلُهَا مِنْهُ وَحَتَّى تَعُودَ أَرْضُ الْعَرَبِ مُرُوجًا وَأَنْهَارًا» رَوَاهُ مُسْلِمٌ. وَفِي رِوَايَة: قَالَ: «تبلغ المساكن إهَاب أَو يهاب»"
      },
      {
        "id": 34135,
        "hadith_number": "5441",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Khalifah di Akhir Zaman yang Membahagikan Harta Tanpa Menghitungnya",
        "perawi_melayu": "Diriwayatkan dari Jabir RA, Rasulullah SAW bersabda:",
        "english_text": "Not Available",
        "malay_translation": "Diriwayatkan dari Jabir RA, Rasulullah SAW bersabda: \"Akan ada di akhir zaman seorang khalifah yang membahagikan harta dan tidak menghitungnya.\" Dalam riwayat lain: Baginda bersabda: \"Akan ada di akhir umatku seorang khalifah yang mencurah-curahkan harta dan tidak menghitungnya.\"",
        "arabic_text": "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَكُونُ فِي آخِرِ الزَّمَانِ خَلِيفَةٌ يُقَسِّمُ الْمَالَ وَلَا يَعُدُّهُ» . وَفِي رِوَايَةٍ: قَالَ: «يَكُونُ فِي آخِرِ أُمَّتِي خَلِيفَةٌ يَحْثِي الْمَالَ حَثْيًا وَلَا يَعُدُّهُ عَدًّا» . رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 34136,
        "hadith_number": "5442",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Sungai Furat dan Khazanah Emas",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "From Abu Hurairah, he said: The Messenger of Allah (peace be upon him) said: \"The Euphrates is about to reveal a treasure of gold. Whoever is present, let him not take anything from it.\"",
        "malay_translation": "Daripada Abu Hurairah, beliau berkata: Rasulullah SAW bersabda: \"Sungai Furat hampir-hampir akan menyingkap sebuah khazanah emas. Sesiapa yang berada di situ, janganlah dia mengambil apa-apa darinya.\"",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يُوشِكُ الْفُرَاتُ أَنْ يَحْسِرَ عَنْ كَنْزٍ مِنْ ذَهَبٍ فَمَنْ حَضَرَ فَلَا يَأْخُذْ مِنْهُ شَيْئًا» . مُتَّفَقٌ عَلَيْهِ"
      },
      {
        "id": 34137,
        "hadith_number": "5443",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tanda-Tanda Kiamat: Sungai Furat Mengungkapkan Gunung Emas",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada beliau (Abu Hurairah R.A.), beliau berkata: Rasulullah SAW bersabda: 'Tidak akan berlaku Kiamat sehingga Sungai Furat mengungkap sebuah gunung daripada emas, dan manusia akan berperang ke atasnya. Maka akan terbunuh daripada setiap seratus orang, sembilan puluh sembilan orang. Dan setiap orang daripada mereka akan berkata: 'Semoga akulah orang yang selamat.' (Riwayat Muslim)",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا تَقُومُ السَّاعَةُ حَتَّى يَحْسِرَ الْفُرَاتُ عَنْ جَبَلٍ مِنْ ذَهَبٍ يَقْتَتِلُ النَّاسُ عَلَيْهِ فَيُقْتَلُ مَنْ كُلِّ مِائَةٍ تِسْعَةٌ وَتِسْعُونَ وَيَقُولُ كُلُّ رَجُلٍ مِنْهُمْ: لَعَلِّي أَكُونُ أَنَا الَّذِي أنجُو . رَوَاهُ مُسلم"
      },
      {
        "id": 34138,
        "hadith_number": "5444",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keadaan Bumi Yang Mengeluarkan Harta Karun Dan Perbuatan Jahat Yang Terungkap",
        "perawi_melayu": null,
        "english_text": null,
        "malay_translation": "Dan daripadanya, beliau berkata: Bersabda Rasulullah SAW, \"Bumi akan memuntahkan sebagian hatinya, seperti tiang-tiang emas dan perak. Kemudian datanglah pembunuh, lalu berkata, 'Pada tempat ini aku membunuh'. Dan datang pula pemutus silaturahim, lalu berkata, 'Pada tempat ini aku memutuskan tali silaturahimku'. Dan datang pula pencuri, lalu berkata, 'Pada tempat ini tanganku dipotong'. Kemudian, mereka tidak akan mengambil apa-apa. Diriwayatkan oleh Muslim.",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: تَقِيءُ الْأَرْضُ أَفْلَاذَ كَبِدِهَا أَمْثَالَ الْأُسْطُوَانَةِ مِنَ الذَّهَبِ وَالْفِضَّةِ فَيَجِيءُ الْقَاتِلُ فَيَقُولُ: فِي هَذَا قَتَلْتُ وَيَجِيءُ الْقَاطِعُ فَيَقُولُ: فِي هَذَا قَطَعْتُ رَحِمِي. وَيَجِيءُ السَّارِقُ فَيَقُولُ: فِي هَذَا قُطِعت يَدي ثمَّ يَد عونه فَلَا يَأْخُذُونَ من شَيْئا . رَوَاهُ مُسلم"
      },
      {
        "id": 34139,
        "hadith_number": "5445",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keadaan Manusia di Akhir Zaman: Arus Kehidupan yang Berat",
        "perawi_melayu": "Tidak Dinyatakan",
        "english_text": "Not Available",
        "malay_translation": "Daripada perawi yang sama (tidak dinyatakan), Rasulullah SAW bersabda: Demi Zat yang jiwaku berada di tangan-Nya, dunia ini tidak akan berakhir sehingga seseorang lelaki melewati kubur lalu dia berguling-guling di atasnya dan berkata: Alangkah baiknya jika aku berada di tempat penghuni kubur ini, dan bukan kerana (pada dirinya) agama melainkan kerana bala (kesusahan hidup). (Riwayat Muslim)",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: وَالَّذِي نَفْسِي بِيَدِهِ لَا تَذْهَبُ الدُّنْيَا حَتَّى يَمُرَّ الرَّجُلُ عَلَى الْقَبْرِ فَيَتَمَرَّغُ عَلَيْهِ ويقولُ: يَا لَيْتَني مَكَانَ صَاحِبِ هَذَا الْقَبْرِ وَلَيْسَ بِهِ الدِّينُ إِلَّا الْبلَاء . رَوَاهُ مُسلم"
      },
      {
        "id": 34140,
        "hadith_number": "5446",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kiamat Tidak Datang Sehingga Terbit Api Dari Tanah Hijaz",
        "perawi_melayu": null,
        "english_text": "Daripada baginda, baginda bersabda: \"Kiamat tidak akan berlaku sehingga terbit api dari bumi Hijaz yang menerangi leher unta dengan cahayanya.\"",
        "malay_translation": "Daripadanya, baginda berkata: Bersabda Rasulullah SAW: \"Kiamat tidak akan berlaku sehingga terbit api dari bumi Hijaz yang menerangi leher unta dengan sinarnya.\"  (Hadis riwayat al-Bukhari dan Muslim)",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَقُومُ السَّاعَةُ حَتَّى تَخْرُجَ نَارٌ مِنْ أَرْضِ الْحِجَازِ تُضِيءُ أعناقَ الإِبلِ ببُصْرى» . مُتَّفق عَلَيْهِ"
      },
      {
        "id": 34141,
        "hadith_number": "5447",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tanda-tanda Kiamat: Api yang Menghimpun Manusia dari Timur ke Barat",
        "perawi_melayu": null,
        "english_text": null,
        "malay_translation": "Daripada Anas, bahawa Rasulullah SAW bersabda, \"Di antara tanda-tanda awal kiamat ialah api yang mengumpulkan manusia dari timur hingga ke barat.\" Diriwayatkan oleh Imam al-Bukhari.",
        "arabic_text": "وَعَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَوَّلُ أَشْرَاطِ السَّاعَةِ نَارٌ تَحْشُرُ النَّاسَ مِنَ الْمَشْرِقِ إِلَى الْمَغْرِبِ» . رَوَاهُ الْبُخَارِيُّ"
      },
      {
        "id": 34142,
        "hadith_number": "5448",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kehampiran Hari Kiamat dan Perubahan Waktu",
        "perawi_melayu": "Anas",
        "english_text": "Dari Anas, beliau berkata: Rasulullah SAW bersabda, \"Hari Kiamat tidak akan datang sehingga masa itu berdekatan, sehinggalah setahun seperti sebulan, sebulan seperti sehari Jumaat, dan sehari Jumaat seperti sejam, dan sejam seperti sekelip mata di dalam api neraka.\"",
        "malay_translation": "Dari Anas r.a., beliau berkata: Rasulullah SAW bersabda, \"Hari Kiamat tidak akan datang sehingga masa itu berdekatan, sehinggalah setahun seperti sebulan, sebulan seperti sehari Jumaat, dan sehari Jumaat seperti sejam, dan sejam seperti sekelip mata di dalam api neraka.\"  Riwayat Imam Tirmizi.",
        "arabic_text": "عَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَقُومُ السَّاعَةُ حَتَّى يتقاربَ الزَّمانُ فتكونُ السَّنةُ كالشهرِ والشَّهرُ كالجمعةِ وتكونُ الجمعةُ كاليومِ وَيَكُونُ الْيَوْمُ كَالسَّاعَةِ وَتَكُونُ السَّاعَةُ كَالضَّرْمَةِ بِالنَّارِ» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 34143,
        "hadith_number": "5449",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Doa Rasulullah SAW Bagi Mereka Yang Berusaha",
        "perawi_melayu": "Abdullah bin Hawalah",
        "english_text": "And from Abdullah bin Hawalah, he said: The Messenger of Allah, peace and blessings be upon him, sent us to graze our livestock, and we returned without grazing anything.  He saw the exhaustion in our faces. Then he stood up among us and said: \"O Allah, do not leave them to me, lest I be unable to take care of them; do not leave them to themselves, lest they be incapable of doing so; and do not leave them to the people, lest they take precedence over them.\", and then he placed his hand on my head and said, \"O Ibn Hawalah, when you see the Khilafah descending upon the sacred land, then know that earthquakes, conflicts, and great events are approaching, and the Hour is then closer to people than this hand of mine is to your head.\"  Narrated by Abu Dawud",
        "malay_translation": "Dan daripada Abdullah bin Hawalah, beliau berkata: Rasulullah SAW telah menghantar kami untuk meragut ternakan, dan kami kembali tanpa berjaya meragut apa-apa. Baginda melihat keletihan pada wajah kami. Kemudian Baginda berdiri di kalangan kami dan bersabda: \"Ya Allah, janganlah Engkau serahkan mereka kepada aku, supaya aku tidak mampu menjaga mereka; janganlah Engkau serahkan mereka kepada diri mereka sendiri, supaya mereka tidak mampu melakukannya; dan janganlah Engkau serahkan mereka kepada manusia, supaya mereka mendahului mereka.\" Kemudian Baginda meletakkan tangannya di atas kepalaku dan bersabda: \"Wahai Ibn Hawalah, apabila engkau melihat Khilafah telah turun ke atas bumi yang suci, maka ketahuilah bahawa gempa bumi, pertikaian, dan peristiwa-peristiwa besar semakin hampir, dan saat itu lebih dekat kepada manusia daripada tangan-Ku ini terhadap kepalamu.\" Diriwayatkan oleh Abu Dawud",
        "arabic_text": "وَعَن عبدِ الله بنِ حوالةَ قَالَ: بعثَنا رَسُول الله صلى اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِنَغْنَمَ عَلَى أَقْدَامِنَا فَرَجَعْنَا فَلَمْ نَغْنَمْ شَيْئًا وَعَرَفَ الْجَهْدَ فِي وجوهِنا فقامَ فِينَا فَقَالَ: «اللَّهُمَّ لَا تَكِلْهُمْ إِلَيَّ فَأَضْعُفَ عَنْهُمْ وَلَا تَكِلْهُمْ إِلَى أَنْفُسِهِمْ فَيَعْجِزُوا عَنْهَا وَلَا تَكِلْهُمْ إِلَى النَّاسِ فَيَسْتَأْثِرُوا عَلَيْهِمْ» ثُمَّ وَضَعَ يَدَهُ عَلَى رَأْسِي ثُمَّ قَالَ: «يَا ابْنَ حَوَالَةَ إِذَا رَأَيْتَ الْخِلَافَةَ قَدْ نَزَلَتِ الْأَرْضَ الْمُقَدَّسَةَ فَقَدْ دَنَتِ الزَّلَازِلُ وَالْبَلَابِلُ وَالْأُمُورُ الْعِظَامُ وَالسَّاعَةُ يَوْمَئِذٍ أَقْرَبُ مِنَ النَّاسِ مِنْ يَدِي هَذِه إِلَى رَأسك» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 34144,
        "hadith_number": "5450",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tanda-tanda Kiamat dan Tindakan Manusia yang Membawa Kemusnahan",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah, katanya: Rasulullah SAW bersabda, \"Apabila harta rampasan perang dijadikan harta peribadi, amanah dianggap sebagai rampasan, zakat dianggap sebagai hutang, manusia mempelajari ilmu bukan untuk agama, seseorang lelaki menurut isterinya, menghina ibunya, mengabaikan rakannya, dan memisahkan diri daripada bapanya, suara-suara tidak sopan di dalam masjid, pemimpin masyarakat adalah orang yang fasik, pemimpin kaum itu adalah yang paling rendah, seseorang dihormati kerana ketakutan terhadap kejahatannya, munculnya alat muzik dan minuman keras, dan akhir umat ini mengutuk permulaannya. Maka, waspadalah terhadap angin merah, gempa bumi, gempa bumi, dan perubahan rupa dan kutukan serta tanda-tanda yang berurutan seperti benang putus. \", Hadis riwayat Imam at-Tirmidzi.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا اتُّخِذَ الْفَيْءُ دِوَلًا وَالْأَمَانَةُ مَغْنَمًا وَالزَّكَاةُ مَغْرَمًا وَتُعُلِّمَ لِغَيْرِ الدِّينِ وَأَطَاعَ الرَّجُلُ امْرَأَتَهُ وَعَقَّ أُمَّهُ وَأَدْنَى صَدِيقَهُ وَأَقْصَى أَبَاهُ وَظَهَرَتِ الْأَصْوَاتُ فِي الْمَسَاجِدِ وَسَادَ الْقَبِيلَةَ فَاسِقُهُمْ وَكَانَ زَعِيمُ الْقَوْمِ أَرْذَلَهُمْ وَأُكْرِمَ الرَّجُلُ مَخَافَةَ شَرِّهِ وَظَهَرَتِ الْقَيْنَاتُ وَالْمَعَازِفُ وشُربتِ الخمورُ وَلَعَنَ آخِرُ هَذِهِ الْأُمَّةِ أَوَّلَهَا فَارْتَقِبُوا عِنْدَ ذَلِكَ رِيحًا حَمْرَاءَ وَزَلْزَلَةً وَخَسْفًا وَمَسْخًا وَقَذْفًا وَآيَاتٍ تَتَابَعُ كَنِظَامٍ قُطِعَ سِلْكُهُ فَتَتَابَعَ» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 34145,
        "hadith_number": "5451",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Bila Umatku Melakukan 15 Sifat, Bencana Akan Menimpa",
        "perawi_melayu": "Ali bin Abi Talib رضي الله عنه",
        "english_text": "And from Ali رضي الله عنه, he said: The Messenger of Allah صلى الله عليه وسلم said: \"When my Ummah melakukan lima belas perkara, bencana akan menimpa mereka.\" Dan beliau menyebutkan sifat-sifat tersebut dan tidak menyebutkan \"mengajar yang bukan agama\". Beliau bersabda: \"Dan berbuat baik kepada sahabatnya dan berlaku buruk kepada bapanya\" dan bersabda: \"Dan diminumnya arak dan dipakai sutera\".  Riwayat Imam Tirmidzi.",
        "malay_translation": "Dari Ali bin Abi Talib رضي الله عنه, beliau berkata: Rasulullah صلى الله عليه وسلم bersabda, \"Apabila umatku melakukan lima belas perkara, bala bencana akan menimpa mereka.\"  Baginda menyebut sifat-sifat tersebut tanpa menyebut \"mengajarkan selain agama.\" Baginda juga bersabda, \"Dan berbuat baik kepada sahabatnya dan berlaku buruk kepada bapanya.\" Baginda juga bersabda, \"Dan diminumnya arak dan dipakai sutera.\"  Hadis ini diriwayatkan oleh Imam Tirmidzi.",
        "arabic_text": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا فَعَلَتْ أُمَّتِي خَمْسَ عَشْرَةَ خَصْلَةً حَلَّ بِهَا الْبَلَاءُ» وَعَدَّ هَذِهِ الْخِصَالَ وَلَمْ يَذْكُرْ «تُعُلِّمَ لِغَيْرِ الدِّينِ» قَالَ: «وَبَرَّ صَدِيقَهُ وَجَفَا أَبَاهُ» وَقَالَ: «وَشُرِبَ الْخَمْرُ وَلُبِسَ الْحَرِيرُ» . رَوَاهُ التِّرْمِذِيُّ"
      },
      {
        "id": 34146,
        "hadith_number": "5452",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kepemimpinan dari Ahlul Bait Rasulullah SAW dan Keadilan di Bumi",
        "perawi_melayu": "Abdullah bin Mas'ud",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abdullah bin Mas'ud, katanya: Rasulullah SAW bersabda, \"Dunia tidak akan berakhir sehingga seorang lelaki dari Ahlul Baitku yang namanya sama dengan namaku akan memerintah bangsa Arab.\"  Hadis ini diriwayatkan oleh Imam Tirmizi dan Imam Abu Daud. Dalam riwayat lain, baginda SAW bersabda, \"Sekiranya dunia hanya tinggal sehari, Allah SWT akan memanjangkan hari itu sehingga Allah SWT mengutus seorang lelaki dariku – atau dari Ahlul Baitku – yang namanya sama dengan namaku, dan nama bapanya sama dengan nama bapaku. Dia akan memenuhi bumi dengan keadilan dan kesejahteraan sebagaimana bumi itu pernah dipenuhi dengan kezaliman dan kekejaman.\"",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَذْهَبُ الدُّنْيَا حَتَّى يَمْلِكَ الْعَرَبَ رَجُلٌ مِنْ أهلِ بَيْتِي يُواطِىءُ اسمُه اسْمِي» رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ. وَفِي رِوَايَةٍ لَهُ: «لَوْ لَمْ يَبْقَ مِنَ الدُّنْيَا إِلَّا يَوْمٌ لَطَوَّلَ اللَّهُ ذَلِكَ الْيَوْمَ حَتَّى يَبْعَثَ اللَّهُ فِيهِ رَجُلًا مِنِّي - أَوْ مِنْ أَهْلِ بَيْتِي - يُوَاطِئُ اسْمُهُ اسْمِيَ وَاسْمُ أَبِيهِ اسْمَ أَبِي يَمْلَأُ الْأَرْضَ قِسْطًا وَعَدْلًا كَمَا مُلِئَتْ ظُلْمًا وجورا»"
      },
      {
        "id": 34147,
        "hadith_number": "5453",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Imam Mahdi dari Keturunan Fatimah",
        "perawi_melayu": null,
        "english_text": "Daripada Umm Salamah, dia berkata: Saya mendengar Rasulullah SAW bersabda: \"Imam Mahdi dari keturunanku, dari anak-anak Fatimah.\"  Riwayat Abu Daud.",
        "malay_translation": "Daripada Umm Salamah, dia berkata: \"Saya mendengar Rasulullah SAW bersabda: 'Imam Mahdi daripada keturunanku, dari anak-anak Fatimah.'\"  (Riwayat Abu Daud).",
        "arabic_text": "وَعَنْ أُمِّ سَلَمَةَ قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «الْمَهْدِيُّ مِنْ عِتْرَتِي مِنْ أَوْلَادِ فَاطِمَة» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 34148,
        "hadith_number": "5454",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perihal Imam Mahdi, Ciri-cirinya dan Pemerintahannya",
        "perawi_melayu": "Abu Said al-Khudri",
        "english_text": "From Abu Sa'id al-Khudri, he said: The Messenger of Allah (peace be upon him) said, \"The Mahdi will be from me; he will have a prominent forehead and a broad nose. He will fill the earth with justice and fairness as it was filled with oppression and injustice. He will rule for seven years.\" Narrated by Abu Dawud.",
        "malay_translation": "Daripada Abu Sa'id al-Khudri, dia berkata: Rasulullah SAW bersabda, \"Imam Mahdi itu daripada kalangan kami; dia mempunyai dahi yang menonjol dan hidung yang lebar. Dia akan memenuhi bumi dengan keadilan dan kesaksamaan sebagaimana bumi pernah dipenuhi dengan kezaliman dan ketidakadilan. Dia akan memerintah selama tujuh tahun.\" Riwayat Abu Dawud.",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْمَهْدِيُّ مِنِّي أجلى الْجَبْهَة وأقنى الْأَنْفِ يَمْلَأُ الْأَرْضَ قِسْطًا وَعَدْلًا كَمَا مُلِئَتْ ظُلْمًا وَجَوْرًا يَمْلِكُ سَبْعَ سِنِينَ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 34149,
        "hadith_number": "5455",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kisah Imam Mahdi dan Pemberiannya",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Daripadanya, daripada Nabi SAW dalam kisah Imam Mahdi, baginda bersabda: Maka datanglah seorang lelaki kepadanya dan berkata, \"Wahai Imam Mahdi, berikanlah kepadaku, berikanlah kepadaku.\" Baginda lalu memasukkan ke dalam bajunya sebanyak yang mampu dipakainya.",
        "malay_translation": "Daripadanya, daripada Nabi SAW dalam kisah Imam Mahdi, baginda bersabda: Maka datanglah seorang lelaki kepadanya dan berkata, \"Wahai Imam Mahdi, berikanlah kepadaku, berikanlah kepadaku.\" Baginda lalu memasukkan ke dalam bajunya sebanyak yang mampu dipakainya.",
        "arabic_text": "وَعَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قِصَّةِ الْمَهْدِيِّ قَالَ: فَيَجِيءُ إِلَيْهِ الرَّجُلُ فَيَقُولُ: يَا مَهْدِيُّ أَعْطِنِي أَعْطِنِي. قَالَ: فَيَحْثِي لَهُ فِي ثَوْبِهِ مَا اسْتَطَاعَ أَنْ يَحْمِلَهُ . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 34150,
        "hadith_number": "5456",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perselisihan Selepas Ketiadaan Khalifah dan Kemunculan Pemimpin Baru",
        "perawi_melayu": "Ummu Salamah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ummu Salamah radhiallahuanha, daripada Nabi SAW, baginda bersabda: \"Akan berlaku perselisihan apabila kematian seorang khalifah. Kemudian seorang lelaki daripada penduduk Madinah akan melarikan diri ke Makkah. Orang-orang Makkah akan datang dan membawa serta beliau, meskipun dia enggan. Kemudian mereka akan mengangkat sumpah setia kepadanya di antara Rukun dan Maqam. Kemudian, tentera dari Syam akan diutus kepadanya, lalu mereka akan ditimpa malapetaka di Bayda' antara Makkah dan Madinah. Jika orang ramai melihat perkara itu, maka para pengganti (abdal) daripada Syam dan pasukan daripada penduduk Iraq akan datang dan mengangkat sumpah setia kepadanya. Kemudian seorang lelaki dari kalangan Quraisy yang mempunyai saudara-saudara seperti anjing akan mengutus tenteranya kepada mereka, lalu mereka akan mengalahkan mereka. Inilah pembalasan disebabkan anjing. Orang ramai akan kembali kepada sunnah Nabi mereka dan Islam akan menyebar ke seluruh dunia. Kemudian dia akan hidup selama tujuh tahun, lalu Allah akan memanggilnya kembali, dan umat Islam akan menunaikan solat jenazahnya.\"\n (Hadis ini diriwayatkan oleh Imam Abu Daud)",
        "arabic_text": "وَعَنْ أُمِّ سَلَمَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَكُونُ اخْتِلَافٌ عِنْدَ مَوْتِ خَلِيفَةٍ فَيَخْرُجُ رَجُلٌ مِنْ أَهْلِ الْمَدِينَةِ هَارِبًا إِلى مكةَ فيأتيه الناسُ من أهل مَكَّة فيخرجوه وَهُوَ كَارِه فيبايعونه بَين الرُّكْن وَالْمقَام يبْعَث إِلَيْهِ بَعْثٌ مِنَ الشَّامِ فَيُخْسَفُ بِهِمْ بِالْبَيْدَاءِ بَيْنَ مَكَّةَ وَالْمَدِينَةِ فَإِذَا رَأَى النَّاسُ ذَلِكَ أَتَاهُ أَبْدَالُ الشَّامِ وَعَصَائِبُ أَهْلِ الْعِرَاقِ فَيُبَايِعُونَهُ ثُمَّ يَنْشَأُ رَجُلٌ مِنْ قُرَيْشٍ أَخْوَالُهُ كَلْبٌ فَيَبْعَثُ إِلَيْهِمْ بَعْثًا فَيَظْهَرُونَ عَلَيْهِمْ وَذَلِكَ بَعَثُ كلب وَيعْمل النَّاسِ بِسُنَّةِ نَبِيِّهِمْ وَيُلْقِي الْإِسْلَامُ بِجِرَانِهِ فِي الْأَرْضِ فَيَلْبَثُ سَبْعَ سِنِينَ ثُمَّ يُتَوَفَّى وَيُصَلِّي عَلَيْهِ الْمُسلمُونَ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 34151,
        "hadith_number": "5457",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Percobaan yang Akan Menimpa Umat dan Kemunculan Pemimpin Adil",
        "perawi_melayu": "Abu Sa'id",
        "english_text": "By Abu Sa'id. The Messenger of Allah, peace be upon him, mentioned a trial that would afflict this ummah until a man finds no refuge from oppression. Then Allah will raise a man from amongst my progeny and family, who will fill the earth with justice and fairness, as it was previously filled with oppression and injustice. The dwellers of the heavens and the earth will be pleased with him. The heavens will not withhold any of its rain, but will pour it abundantly. The earth will not withhold any of its vegetation, but will bring it forth. The living will wish for the dead to live during that time. This will last for seven, eight, or nine years.",
        "malay_translation": "Daripada Abu Sa'id. Rasulullah SAW telah menyebut tentang satu cubaan yang akan menimpa umat ini sehingga seorang lelaki tidak menemui tempat perlindungan daripada zalim. Kemudian Allah akan bangkitkan seorang lelaki daripada keturunan dan keluarga-Ku, yang akan memenuhi bumi dengan keadilan dan keseimbangan, sebagaimana bumi sebelum ini dipenuhi dengan zalim dan kezaliman. Penduduk langit dan bumi akan berpuas hati dengannya. Langit tidak akan menahan sebarang hujan, tetapi akan mencurahkannya dengan deras. Bumi tidak akan menahan sebarang tumbuh-tumbuhan, tetapi akan menumbuhkannya. Orang hidup akan menginginkan orang mati untuk hidup pada masa itu. Ini akan berlaku selama tujuh, lapan atau sembilan tahun.",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ قَالَ: ذَكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «بَلَاءً يُصِيبُ هَذِهِ الْأُمَّةَ حَتَّى لَا يَجِدَ الرَّجُلُ مَلْجَأً يَلْجَأُ إِلَيْهِ مِنَ الظُّلْمِ فَيَبْعَثُ اللَّهُ رَجُلًا مِنْ عِتْرَتِي وَأَهْلِ بَيْتِي فَيَمْلَأُ بِهِ الْأَرْضَ قِسْطًا وَعَدْلًا كَمَا مُلِئَتْ ظُلْمًا وَجَوْرًا يَرْضَى عَنْهُ سَاكِنُ السَّمَاءِ وَسَاكِنُ الْأَرْضِ لَا تَدَعُ السَّمَاءُ مِنْ قَطْرِهَا شَيْئًا إِلَّا صَبَّتْهُ مِدْرَارًا وَلَا تَدَعُ الْأَرْضُ مِنْ نَبَاتِهَا شَيْئًا إِلَّا أَخْرَجَتْهُ حَتَّى يَتَمَنَّى الْأَحْيَاءُ الْأَمْوَاتَ يَعِيشُ فِي ذَلِكَ سبعَ سِنِين أَو ثمانَ سِنِين أَو تسع سِنِين» . رَوَاهُ"
      },
      {
        "id": 34152,
        "hadith_number": "5458",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kemunculan Seorang Lelaki dari Seberang Sungai yang Membantu Keluarga Nabi Muhammad SAW",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ali RA, beliau berkata: Rasulullah SAW bersabda: Akan muncul seorang lelaki dari seberang sungai, dikatakan kepadanya: Al-Harith Harath, di barisan hadapannya ada seorang lelaki dikatakan kepadanya: Mansur, dia akan menyediakan atau memberi kemampuan kepada keluarga Muhammad SAW sebagaimana Quraisy memberi kemampuan kepada Rasulullah SAW. Wajib bagi setiap mukmin untuk menolongnya - atau bersabda: untuk menyahutnya. (Riwayat Abu Daud)",
        "arabic_text": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: يَخْرُجُ رَجُلٌ مِنْ وَرَاءِ النَّهْرِ يُقَالُ لَهُ: الْحَارِثُ حَرَّاثٌ عَلَى مُقَدِّمَتِهِ رَجُلٌ يُقَالُ لَهُ: مَنْصُورٌ يُوَطِّنُ أَوْ يُمَكِّنُ لِآلِ مُحَمَّدٍ كَمَا مَكَّنَتْ قُرَيْشٌ لِرَسُولِ اللَّهِ وَجَبَ عَلَى كُلِّ مُؤْمِنٍ نَصْرُهُ - أَوْ قَالَ: إِجَابَتُهُ - . رَوَاهُ أَبُو دَاوُدَ"
      },
      {
        "id": 34153,
        "hadith_number": "5459",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kiamat dan Percakapan Haiwan dan Benda",
        "perawi_melayu": "Abu Sa'id al-Khudri",
        "english_text": "Daripada Abu Sa'id al-Khudri, katanya: Rasulullah SAW bersabda: \"Demi Yang Jiwa-Nya di dalam tangan-Nya, tidak akan berlaku Hari Kiamat sehingga haiwan-haiwan liar bercakap dengan manusia, dan sehingga seorang lelaki bercakap dengan cambuknya dan tali kasutnya, dan memberitahunya tentang apa yang dilakukan oleh ahli keluarganya selepasnya.\"",
        "malay_translation": "Daripada Abu Sa'id al-Khudri, katanya: Rasulullah SAW bersabda: \"Demi Allah yang jiwa-Nya di dalam tangan-Nya, tidak akan berlaku Hari Kiamat sehingga haiwan-haiwan liar akan bercakap dengan manusia, dan sehingga seorang lelaki bercakap dengan cambuknya dan tali kasutnya, serta memberitahunya tentang apa yang dilakukan oleh keluarganya selepasnya.\"  (Riwayat al-Tirmizi).",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَالَّذِي نَفْسِي بِيَدِهِ لَا تَقُومُ السَّاعَةُ حَتَّى تُكَلِّمَ السِّبَاعُ الْإِنْسَ وَحَتَّى تُكَلِّمَ الرَّجُلَ عَذَبَةُ سَوْطِهِ وَشِرَاكُ نَعْلِهِ وَيُخْبِرَهُ فَخِذُهُ بِمَا أَحْدَثَ أَهْلُهُ بَعْدَهُ» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 34154,
        "hadith_number": "5460",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tanda-tanda Kiamat Selepas Dua Ratus Tahun",
        "perawi_melayu": "Diriwayatkan daripada Abu Qatadah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Qatadah, beliau berkata: Rasulullah SAW bersabda: 'Tanda-tanda (kiamat) selepas dua ratus tahun.' (Riwayat Ibnu Majah)",
        "arabic_text": "عَنْ أَبِي قَتَادَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الْآيَاتُ بَعْدَ الْمِائَتَيْنِ . رَوَاهُ ابْن مَاجَه"
      },
      {
        "id": 34155,
        "hadith_number": "5461",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ketibaan Bendera Hitam dari Khurasan dan Khulafa al-Mahdi",
        "perawi_melayu": "Thawban",
        "english_text": "And from Thawban, he said: The Messenger of Allah, peace be upon him, said: \"When you see the black banners coming from Khurasan, then go to them, for in them is the Khalifah of Allah, the Mahdi.\"",
        "malay_translation": "Dan daripada Thawban, dia berkata: Rasulullah SAW bersabda: \"Apabila kamu melihat bendera hitam datang dari Khurasan, maka pergilah kepada mereka, kerana di dalam kalangan mereka terdapat Khalifah Allah, al-Mahdi.\"",
        "arabic_text": "وَعَنْ ثَوْبَانَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا رَأَيْتُمُ الرَّايَاتِ السُّودَ قَدْ جَاءَتْ مِنْ قِبَلِ خُرَاسَانَ فَأْتُوهَا فَإِنَّ فِيهَا خَلِيفَةَ اللَّهِ الْمَهْدِيَّ» . رَوَاهُ أَحْمَدُ وَالْبَيْهَقِيُّ فِي «دَلَائِل النبوَّة»"
      },
      {
        "id": 34156,
        "hadith_number": "5462",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan dan Kemiripan Putera Imam Ali dengan Nabi saw",
        "perawi_melayu": "Abi Ishaq",
        "english_text": "And from Abi Ishaq he said: Ali said, and he looked at his son Hasan, he said: Indeed, my son this is a leader, just as the Messenger of Allah صلى الله عليه وسلم called him, and a man will emerge from his loins who will be named with the name of your Prophet, resembling him in creation - then he mentioned a story - filling the earth with justice. It was narrated by Abu Dawud and he did not mention the story.",
        "malay_translation": "Dan daripada Abi Ishaq, dia berkata: Ali berkata, dan dia memandang puteranya Hasan, dia berkata: Sesungguhnya anakku ini adalah seorang pemimpin, sebagaimana Rasulullah صلى الله عليه وسلم telah menamakannya demikian, dan seorang lelaki akan keluar dari keturunannya yang akan dinamakan dengan nama Nabi kamu, menyerupai beliau dalam rupa paras - kemudian beliau menceritakan kisah tersebut - memenuhi bumi dengan keadilan. Ia diriwayatkan oleh Abu Dawud, dan beliau tidak menyebut kisah tersebut.",
        "arabic_text": "وَعَن أبي إِسحاق قَالَ: قَالَ عَلِيٌّ وَنَظَرَ إِلَى ابْنِهِ الْحَسَنِ قَالَ: إِنَّ ابْنِي هَذَا سَيِّدٌ كَمَا سَمَّاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَيَخْرُجُ مِنْ صُلْبِهِ رَجُلٌ يُسَمَّى بِاسْمِ نَبِيِّكُمْ يُشْبِهُهُ فِي الْخَلْقِ - ثُمَّ ذَكَرَ قِصَّةَ - يَمْلَأُ الْأَرْضَ عَدْلًا. رَوَاهُ أَبُو دَاوُدَ وَلَمْ يَذْكُرِ الْقِصَّةَ"
      },
      {
        "id": 34157,
        "hadith_number": "5463",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Belalang Sebagai Tanda Kiamat",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Jabir bin Abdullah RA, beliau berkata: Belalang hilang pada salah satu tahun pemerintahan Umar RA yang mana beliau wafat pada tahun tersebut. Beliau sangat khuatir tentang perkara tersebut. Lalu beliau menghantar seorang penunggang ke Yaman, seorang penunggang ke Iraq, dan seorang penunggang ke Syam untuk bertanya tentang belalang, adakah ada kelihatan sesuatu daripadanya. Kemudian datanglah seorang penunggang dari arah Yaman dengan segenggam belalang, lalu dia menaburkannya di hadapan Umar RA. Apabila Umar RA melihatnya, beliau bertakbir dan berkata: Aku mendengar Rasulullah SAW bersabda: Sesungguhnya Allah 'Azza wa Jalla menciptakan seribu umat, enam ratus daripadanya di laut dan empat ratus di darat. Sesungguhnya kebinasaan pertama umat ini adalah belalang. Apabila belalang binasa, maka umat-umat lain akan mengikuti seperti tali yang putus. (Riwayat al-Baihaqi dalam Syu'ab al-Iman).",
        "arabic_text": "وَعَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ: فُقِدَ الْجَرَادُ فِي سَنَةٍ مِنْ سِنِي عُمَرَ الَّتِي تُوُفِّيَ فِيهَا فَاهْتَمَّ بِذَلِكَ هَمًّا شَدِيدًا فَبَعَثَ إِلَى الْيمن رَاكِبًا وراكبا إِلَى الْعرق وَرَاكِبًا إِلَى الشَّامِ يَسْأَلُ عَنِ الْجَرَادِ هَلْ أُرِيَ مِنْهُ شَيْئًا فَأَتَاهُ الرَّاكِبُ الَّذِي مِنْ قبل الْيمن بقبضة فنثرهابين يَدَيْهِ فَلَمَّا رَآهَا عُمَرُ كَبَّرَ وَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: إِنَّ اللَّهَ عَزَّ وَجَلَّ خَلَقَ أَلْفَ أُمَّةٍ سِتُّمِائَةٍ مِنْهَا فِي الْبَحْرِ وَأَرْبَعُمِائَةٍ فِي الْبَرِّ فَإِنَّ أَوَّلَ هَلَاكِ هَذِهِ الْأُمَّةِ الْجَرَادُ فَإِذَا هَلَكَ الْجَرَادُ تَتَابَعَتِ الْأُمَمُ كَنِظَامِ السِّلْكِ «. رَوَاهُ الْبَيْهَقِيُّ فِي» شُعَبِ الْإِيمَانِ"
      },
      {
        "id": 34158,
        "hadith_number": "5464",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tanda-Tanda Kiamat dan Peristiwa-Peristiwa Sebelumnya",
        "perawi_melayu": "Hadis ini diriwayatkan oleh Hadhīfah bin 'Āsīd al-Ghifārī.",
        "english_text": "Daripada Hudzaifah bin Asid al-Ghifari, dia berkata:  Rasulullah SAW melihat kepada kami sedang berbincang-bincang. Baginda bertanya, \"Apa yang kamu bincangkan?\" Mereka menjawab, \"Kami sedang membincangkan tentang hari kiamat.\" Baginda bersabda, \"Ia tidak akan berlaku sehingga kamu melihat sepuluh tanda sebelumnya. Di antaranya asap (dukhan), Dajjal, binatang melata, matahari terbit dari barat, kedatangan Isa bin Maryam, Ya'juj dan Ma'juj, dan tiga kali gerhana matahari: satu di timur, satu di barat dan satu lagi di Semenanjung Tanah Arab. Kemudian yang terakhir, api akan keluar dari Yaman, mengusir manusia ke tempat berkumpul mereka.  Dalam satu riwayat, api itu keluar dari dasar Aden, mengumpul manusia ke hari kiamat.  Dalam satu lagi riwayat yang kesepuluh, angin yang mencampakkan manusia ke laut.\" Diriwayatkan oleh Muslim.",
        "malay_translation": "Daripada Hudzaifah bin Asid al-Ghifari, beliau berkata: Rasulullah SAW melihat kepada kami semasa kami sedang berbincang-bincang. Baginda bertanya, \"Apakah yang sedang kamu bincangkan?\"  Mereka menjawab, \"Kami sedang membincangkan mengenai hari kiamat.\" Baginda bersabda, \"Ia tidak akan berlaku sehingga kalian melihat sepuluh tanda sebelumnya. Di antaranya asap, Dajjal, binatang yang akan keluar, matahari terbit dari barat, kedatangan Isa bin Maryam, Ya'juj dan Ma'juj, dan tiga kali gerhana matahari; satu di timur, satu di barat dan satu di Semenanjung Tanah Arab. Selepas itu, api akan keluar dari Yaman dan mengusir manusia ke tempat berkumpul mereka.  Dalam satu riwayat lain, api keluar dari dasar Aden, mengumpulkan manusia menuju hari kiamat.  Dalam satu riwayat yang lain, angin akan mencampakkan manusia ke laut.\"  Hadis ini diriwayatkan oleh Imam Muslim.",
        "arabic_text": "عَن حذيفةَ بن أسيد الْغِفَارِيّ قَالَ: اطَّلَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْنَا وَنَحْنُ نَتَذَاكَرُ. فَقَالَ: «مَا تَذْكُرُونَ؟» . قَالُوا: نَذْكُرُ السَّاعَةَ. قَالَ: إِنَّهَا لَنْ تَقُومَ حَتَّى تَرَوْا قَبْلَهَا عَشْرَ آيَاتٍ فَذَكَرَ الدُّخَانَ وَالدَّجَّالَ وَالدَّابَّةَ وَطُلُوعَ الشَّمْسِ مِنْ مَغْرِبِهَا وَنُزُولَ عِيسَى بْنِ مَرْيَمَ وَيَأْجُوجَ وَمَأْجُوجَ وَثَلَاثَةَ خُسُوفٍ: خَسْفٌ بِالْمَشْرِقِ وَخَسْفٌ بِالْمَغْرِبِ وَخَسْفٌ بِجَزِيرَةِ الْعَرَبِ وَآخِرُ ذَلِكَ نَارٌ تَخْرُجُ مِنَ الْيَمَنِ تَطْرُدُ النَّاسَ إِلَى مَحْشَرِهِمْ . وَفِي رِوَايَةٍ: «نَارٌ تَخْرُجُ مِنْ قَعْرِ عَدَنَ تَسُوقُ النَّاسَ إِلَى الْمَحْشَرِ» . وَفِي رِوَايَةٍ فِي الْعَاشِرَةِ «وَرِيحٌ تُلْقِي النَّاسَ فِي الْبَحْر» . رَوَاهُ مُسلم"
      },
      {
        "id": 34159,
        "hadith_number": "5465",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Bersegera dalam enam perkara penting",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "And from Abu Hurairah, he said: The Messenger of Allah, peace and blessings be upon him, said, \"Hurry in doing six things: (the appearance of) smoke, the Dajjal, the beast of the earth, the rising of the sun from its west, the matter of the general public, and (the matter of) the private affair of one of you.\"",
        "malay_translation": "Dan daripada Abu Hurairah, beliau berkata: Rasulullah SAW bersabda, \"Segerakanlah dalam enam perkara: (kemunculan) asap, Dajjal, binatang bumi, matahari terbit dari baratnya, urusan orang ramai, dan urusan peribadi salah seorang daripada kamu.\"",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «بَادِرُوا بِالْأَعْمَالِ سِتًّا. الدُّخَانَ وَالدَّجَّالَ وَدَابَّةَ الْأَرْضِ وَطُلُوعَ الشَّمْسِ مِنْ مَغْرِبِهَا وَأَمْرَ الْعَامَّةِ وَخُوَيْصَّةَ أَحَدِكُمْ» . رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 34160,
        "hadith_number": "5466",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kejadian Awal dan Pengakhiran: Terbit Matahari dari Barat dan Kemunculan Binatang",
        "perawi_melayu": "Abdullah bin 'Amr",
        "english_text": "Dari Abdullah bin 'Amr, dia berkata: \"Aku mendengar Rasulullah SAW bersabda: 'Sesungguhnya tanda-tanda awal yang keluar adalah terbitnya matahari dari barat dan keluarnya binatang di siang hari. Mana yang datang lebih dahulu dari yang lainnya, maka yang lain akan mengikutinya tidak lama lagi.'",
        "malay_translation": "Daripada Abdullah bin 'Amr, beliau berkata: \"Aku mendengar Rasulullah SAW bersabda: 'Sesungguhnya tanda-tanda awal yang akan muncul ialah terbitnya matahari dari arah barat dan keluarnya binatang pada siang hari. Mana yang datang lebih awal daripada yang lain, maka yang lain akan menyusulinya tidak lama lagi.' (Riwayat Muslim)",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٌو قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ أَوَّلَ الْآيَاتِ خُرُوجًا طُلُوعُ الشَّمْسِ مِنْ مَغْرِبِهَا وَخُرُوجُ الدَّابَّةِ عَلَى النَّاسِ ضُحًى وَأَيُّهُمَا مَا كَانَتْ قَبْلَ صَاحِبَتِهَا فَالْأُخْرَى على أَثَرهَا قَرِيبا» رَوَاهُ مُسلم"
      },
      {
        "id": 34161,
        "hadith_number": "5467",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tiga Perkara yang Tidak Bermanfaat Jika Iman Tidak Ada Sebelumnya",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "And from Abu Hurairah, he said: The Messenger of Allah, peace and blessings be upon him, said: \"Three things, when they emerge, do not benefit a soul whose faith was not established before or who had not earned good in their faith, namely, the rising of the sun from its west, the Dajjal, and the beast of the earth.\"",
        "malay_translation": "Daripada Abu Hurairah, beliau berkata: Rasulullah SAW bersabda: “Tiga perkara, apabila ia muncul, tidak akan memberi manfaat kepada seseorang yang imannya tidak mantap sebelumnya atau yang tidak memperolehi kebaikan dalam imannya, iaitu terbitnya matahari dari baratnya, Dajjal, dan binatang bumi.”",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «ثَلَاثٌ إِذَا خَرَجْنَ (لَا يَنْفَعُ نَفْسًا إِيمَانُهَا لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ أَوْ كَسَبَتْ فِي إِيمَانِهَا خَيْرًا) طُلُوعُ الشَّمْسِ مِنْ مَغْرِبِهَا وَالدَّجَّالُ وَدَابَّةُ الْأَرْضِ» . رَوَاهُ مُسلم"
      },
      {
        "id": 34162,
        "hadith_number": "5468",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kisah Matahari dan Permohonannya Kepada Allah SWT",
        "perawi_melayu": "Abu Dzar",
        "english_text": "And from Abu Dzar, he said: The Messenger of Allah, peace and blessings be upon him, said when the sun set: \"Where are you going?\" I said: Allah and His Messenger know best. He said: \"It goes until it prostrates beneath the Throne, then it asks permission, and permission is granted to it. And it is almost about to prostrate, but it is not accepted from it, and it asks permission, but permission is not granted to it, and it is said to it: Return from whence you came. Then it rises from its west. And that is the saying of Him, the Exalted (And the sun runs to its place of rest). He said: \"Its place of rest is under the Throne.\"",
        "malay_translation": "Dan daripada Abu Dzar, beliau berkata: Rasulullah SAW bersabda ketika matahari terbenam, \"Ke mana engkau pergi?\" Aku menjawab: Allah dan Rasul-Nya lebih mengetahui. Baginda bersabda: \"Ia akan terus bergerak sehingga sujud di bawah Arasy, lalu meminta izin, dan izin diberikan kepadanya. Dan hampir sahaja ia sujud, tetapi sujudnya tidak diterima, lalu ia meminta izin lagi, tetapi izin tidak diberikan. Lalu dikatakan kepadanya, 'Kembalilah ke mana engkau datang.' Maka ia terbit dari baratnya. Dan itulah firman-Nya yang Maha Tinggi, (Dan matahari berjalan ke tempat kembalinya). Baginda bersabda, 'Tempat kembalinya adalah di bawah Arasy'.",
        "arabic_text": "وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ غربت الشَّمْس: «أَيْن تذْهب؟» . قُلْتُ: اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: فَإِنَّهَا تَذْهَبُ حَتَّى تَسْجُدَ تَحْتَ الْعَرْشِ فَتَسْتَأْذِنُ فَيُؤْذَنُ لَهَا وَيُوشِكُ أَنْ تَسْجُدَ وَلَا يُقْبَلُ مِنْهَا وَتَسْتَأْذِنُ فَلَا يُؤْذَنُ لَهَا وَيُقَالُ لَهَا: ارْجِعِي مِنْ حَيْثُ جِئْتِ فَتَطْلُعُ مِنْ مَغْرِبِهَا فَذَلِكَ قَوْلُهُ تَعَالَى (والشمسُ تجْرِي لمستقرّ لَهَا) قَالَ: «مستقرها تَحت الْعَرْش» . مُتَّفق عَلَيْهِ"
      },
      {
        "id": 34163,
        "hadith_number": "5469",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perkara Yang Lebih Besar Daripada Dajjal",
        "perawi_melayu": "Imran bin Husain",
        "english_text": "Daripada Imran bin Husain, katanya: \"Aku mendengar Rasulullah SAW bersabda: 'Tidak ada perkara yang lebih besar daripada Dajjal dari sejak kejadian Adam hingga Hari Kiamat.'\" Diriwayatkan oleh Muslim.",
        "malay_translation": "Daripada Imran bin Husain, beliau berkata, \"Aku mendengar Rasulullah SAW bersabda: 'Tidak ada perkara yang lebih besar daripada Dajjal sejak penciptaan Adam hingga tibanya Hari Kiamat.'\" Diriwayatkan oleh Imam Muslim.",
        "arabic_text": "وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَا بَيْنَ خَلْقِ آدَمَ إِلَى قِيَامِ السَّاعَةِ أَمْرٌ أكبر من الدَّجَّال» . رَوَاهُ مُسلم"
      },
      {
        "id": 34164,
        "hadith_number": "5470",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Allah Tidaklah Bersendirian dan Al-Masih Ad-Dajjal Memilikki Mata Satu",
        "perawi_melayu": "Abdullah",
        "english_text": "And from Abdullah, he said: The Messenger of Allah, peace and blessings be upon him, said: \"Indeed, Allah is not hidden from you. Indeed, Allah, Exalted is He, is not one-eyed. And the Messiah Dajjal is one-eyed, the right eye is like a floating grape.\"",
        "malay_translation": "Dan daripada Abdullah, dia berkata: Rasulullah SAW bersabda: \"Sesungguhnya Allah tidak tersembunyi daripada kamu. Sesungguhnya Allah Yang Maha Tinggi bukanlah buta sebelah mata. Dan al-Masih al-Dajjal buta sebelah mata kanannya, seakan-akan matanya seperti buah anggur yang terapung.\"",
        "arabic_text": "وَعَن عَبْدُ اللَّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ لَا يَخْفَى عَلَيْكُمْ إِنَّ اللَّهَ تَعَالَى لَيْسَ بِأَعْوَرَ وَإِنَّ الْمَسِيحَ الدَّجَّالَ أَعْوَرُ عَيْنِ الْيُمْنَى كَأَنَّ عَيْنَهُ عنبة طافية» . مُتَّفق عَلَيْهِ"
      },
      {
        "id": 34165,
        "hadith_number": "5471",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Peringatan Tentang Dajjal yang Buta Sebelah",
        "perawi_melayu": "Diriwayatkan daripada Anas RA, Rasulullah SAW bersabda:",
        "english_text": "Not Available",
        "malay_translation": "Daripada Anas RA, beliau berkata: Rasulullah SAW bersabda: \"Tidak ada seorang Nabi pun melainkan telah memberi peringatan kepada umatnya tentang al-A'war (yang buta sebelah mata) lagi pendusta. Ketahuilah, sesungguhnya dia (Dajjal) itu buta sebelah mata, dan sesungguhnya Tuhan kamu tidak buta. Tertulis di antara kedua matanya: K. F. R. (Kafir).\" Muttafaqun Alaih.",
        "arabic_text": "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَا مِنْ نَبِيٍّ إِلَّا أَنْذَرَ أُمَّتَهُ الْأَعْوَرَ الْكَذَّابَ أَلَا إِنَّهُ أَعْوَرُ وَإِنَّ رَبَّكُمْ لَيْسَ بِأَعْوَرَ مَكْتُوبٌ بَيْنَ عَيْنَيْهِ: ك ف ر . مُتَّفَقٌ عَلَيْهِ"
      },
      {
        "id": 34166,
        "hadith_number": "5472",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Peringatan tentang Dajjal: Dia A'war (Buta Sebelah) dan Fitnahnya",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: 'Mahukah aku khabarkan kepada kamu sebuah hadis tentang Dajjal yang tidak pernah dikhabarkan oleh seorang nabi pun kepada kaumnya? Sesungguhnya dia itu A'war (buta sebelah) dan sesungguhnya dia datang bersama-samanya seperti syurga dan neraka. Maka apa yang dia katakan: 'Sesungguhnya ini adalah syurga' adalah neraka, dan sesungguhnya aku memberi amaran kepada kamu sebagaimana Nuh memberi amaran kepada kaumnya.' Muttafaq 'alaih.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِلَّا أحدثكُم حَدِيثا عَن الدَّجَّال ماحدث بِهِ نبيٌّ قومَه؟ : إِنَّه أعوَرُ وإِنَّه يَجِيءُ مَعَهُ بِمِثْلِ الْجَنَّةِ وَالنَّارِ فَالَّتِي يَقُولُ: إِنَّهَا الْجَنَّةُ هِيَ النَّارُ وَإِنِّي أُنْذِرُكُمْ كَمَا أنذر بِهِ نوح قومه . مُتَّفق عَلَيْهِ"
      },
      {
        "id": 34167,
        "hadith_number": "5473",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Dajjal Akan Muncul dengan Air dan Api",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Huzaifah, daripada Nabi SAW bersabda: “Sesungguhnya Dajjal akan keluar dan bersamanya air dan api. Apa yang dilihat oleh manusia sebagai air, sebenarnya adalah api yang membakar. Dan apa yang dilihat oleh manusia sebagai api, sebenarnya adalah air sejuk yang tawar. Barangsiapa di antara kamu yang mendapati zaman itu, maka hendaklah dia jatuh ke dalam apa yang dilihatnya sebagai api, kerana sesungguhnya ia adalah air yang tawar lagi baik.” Muttafaq Alaih. Muslim menambahkan: “Sesungguhnya Dajjal itu buta sebelah matanya, di atas matanya ada selaput yang tebal, tertulis di antara kedua matanya perkataan 'kafir' yang dapat dibaca oleh setiap mukmin yang pandai menulis mahupun yang tidak pandai.”",
        "arabic_text": "وَعَنْ حُذَيْفَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الدَّجَّالَ يَخْرُجُ وَإِنَّ مَعَهُ مَاءً وَنَارًا فَأَمَّا الَّذِي يَرَاهُ النَّاسُ مَاءً فَنَارٌ تَحْرِقُ وَأَمَّا الَّذِي يَرَاهُ النَّاسُ نَارًا فَمَاءٌ بَارِدٌ عَذْبٌ فَمَنْ أَدْرَكَ ذَلِكَ مِنْكُمْ فَلْيَقَعْ فِي الَّذِي يَرَاهُ نَارًا فَإِنَّهُ مَاءٌ عَذْبٌ طَيِّبٌ» . مُتَّفق عَلَيْهِ. وَزَاد مُسلم: «إِن الدجالَ ممسوحُ العينِ عَلَيْهَا ظفرةٌ غليظةٌ مَكْتُوب بَين عَيْنَيْهِ كَافِر يَقْرَؤُهُ كل مُؤمن كاتبٌ وَغير كَاتب»"
      },
      {
        "id": 34168,
        "hadith_number": "5474",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perihal Dajjal yang Bersendirian Mata dan Ciri-Cirinya",
        "perawi_melayu": null,
        "english_text": "and from him he said, said the messenger of Allah, peace and blessings be upon him: \"The Dajjal is one-eyed, his left eye is defective, his hair is thick, and he has a paradise and a fire with him. So his fire is a paradise, and his paradise is a fire.\"",
        "malay_translation": "Dan daripadanya, beliau berkata: Rasulullah SAW bersabda, \"Dajjal itu buta sebelah matanya, sebelah kiri, berambut tebal, dan bersamanya terdapat syurga dan neraka. Nerakanya adalah seperti syurga, dan syurganya adalah seperti neraka.\"",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الدَّجَّالُ أَعْوَرُ الْعَيْنِ الْيُسْرَى جُفَالُ الشَّعَرِ مَعَهُ جَنَّتُهُ وَنَارُهُ فَنَارُهُ جِنَّةٌ وَجَنَّتُهُ نارٌ» . رَوَاهُ مُسلم"
      },
      {
        "id": 34169,
        "hadith_number": "5475",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kisah Dajjal, Nabi Isa, Yakjuj dan Makjuj, dan Keadaan Akhir Zaman",
        "perawi_melayu": "Not Available",
        "english_text": "Not Available",
        "malay_translation": "Daripada Nawwas bin Sam'an RA, beliau berkata: Rasulullah SAW menyebut tentang Dajjal, lalu baginda bersabda: \"Jika dia (Dajjal) muncul ketika aku masih berada di kalangan kamu, maka akulah yang akan menghadapinya untuk membela kamu. Jika dia muncul setelah aku tiada, maka setiap orang bertanggungjawab membela dirinya sendiri, dan Allah adalah penggantiku (penjaga) bagi setiap Muslim. Sesungguhnya dia (Dajjal) seorang pemuda berambut kerinting, matanya timbul (buta sebelah), seolah-olah aku menyerupakannya dengan Abdul Uzza bin Qatan. Barangsiapa di antara kamu yang menemuinya, maka hendaklah dia membaca permulaan surah al-Kahfi ke atasnya.\" Dalam riwayat lain: \"Hendaklah dia membaca permulaan surah al-Kahfi ke atasnya, kerana ia adalah perlindungan kamu daripada fitnahnya. Sesungguhnya dia akan muncul di suatu tempat antara Syam dan Iraq, lalu dia merosakkan ke kanan dan ke kiri. Wahai hamba-hamba Allah, teguhlah kamu!\" Kami bertanya: \"Wahai Rasulullah, berapa lamakah dia akan tinggal di bumi?\" Baginda bersabda: \"Empat puluh hari, sehari seperti setahun, sehari seperti sebulan, sehari seperti seminggu, dan hari-hari selebihnya seperti hari-hari kamu.\" Kami bertanya: \"Wahai Rasulullah, adakah solat sehari (sahaja) mencukupi bagi kami pada hari yang seperti setahun itu?\" Baginda bersabda: \"Tidak, tentukanlah kadar baginya (solat seperti biasa).\" Kami bertanya: \"Wahai Rasulullah, bagaimana kelajuannya di bumi?\" Baginda bersabda: \"Seperti awan yang ditiup angin kencang. Dia mendatangi suatu kaum lalu mengajak mereka (beriman kepadanya), lalu mereka beriman kepadanya. Dia memerintahkan langit lalu hujan turun, dan bumi lalu tumbuh (tanaman). Lalu ternakan mereka kembali kepada mereka dengan punuk yang paling tinggi, ambing yang paling penuh dengan susu, dan rusuk yang paling gemuk. Kemudian dia mendatangi suatu kaum lalu mengajak mereka (beriman kepadanya), lalu mereka menolak perkataannya. Maka dia berpaling daripada mereka, lalu mereka menjadi papa kedana dan tidak ada sesuatu pun daripada harta mereka yang tinggal. Dia melewati tanah yang tandus lalu berkata kepadanya: 'Keluarkanlah perbendaharaanmu!' Lalu perbendaharaannya mengikutinya seperti lebah jantan. Kemudian dia memanggil seorang lelaki yang penuh dengan kekuatan pemuda, lalu dia memukulnya dengan pedang dan memotongnya menjadi dua bahagian sejauh lemparan anak panah. Kemudian dia memanggilnya, lalu dia datang menghadap dengan wajah berseri-seri sambil tertawa. Ketika dia sedang berkeadaan demikian, tiba-tiba Allah mengutuskan al-Masih bin Maryam (Nabi Isa AS), lalu dia turun di menara putih di timur Damsyik, di antara dua helai pakaian yang dicelup dengan waras dan za'faran, sambil meletakkan kedua telapak tangannya di atas sayap dua malaikat. Apabila dia menundukkan kepalanya, (peluh) menitis, dan apabila dia mengangkatnya, (peluh) mengalir seperti mutiara. Tidak halal bagi seorang kafir pun yang mendapati bau nafasnya melainkan dia mati, dan nafasnya berakhir sejauh pandangan matanya. Lalu dia (Nabi Isa AS) mencarinya (Dajjal) sehingga dia menemuinya di pintu Ludd, lalu dia membunuhnya. Kemudian Isa mendatangi suatu kaum yang telah dilindungi Allah daripadanya, lalu dia menyapu wajah mereka dan menceritakan kepada mereka tentang kedudukan mereka di syurga. Ketika dia sedang berkeadaan demikian, tiba-tiba Allah mewahyukan kepada Isa: 'Sesungguhnya Aku telah mengeluarkan hamba-hamba-Ku yang tidak ada seorang pun yang mampu memerangi mereka, maka kumpulkanlah hamba-hamba-Ku ke Gunung (al-Tur).' Lalu Allah mengutuskan Ya'juj dan Ma'juj (dan mereka turun dengan cepat dari seluruh tempat yang tinggi). Lalu barisan hadapan mereka melewati Tasik Tiberias lalu meminum habis air yang ada di dalamnya, dan barisan belakang mereka melewati lalu berkata: 'Sesungguhnya di sini pernah ada air.' Kemudian mereka berjalan sehingga sampai ke Gunung al-Khamar, iaitu Gunung Baitulmaqdis, lalu mereka berkata: 'Sesungguhnya kami telah membunuh semua yang ada di bumi, marilah kita membunuh semua yang ada di langit.' Lalu mereka melontarkan anak panah mereka ke langit, lalu Allah mengembalikan anak panah mereka dalam keadaan berlumuran darah. Nabi Allah dan para sahabatnya dikepung sehingga kepala lembu bagi salah seorang daripada mereka lebih baik daripada seratus dinar bagi salah seorang daripada kamu pada hari ini. Lalu Nabi Allah Isa dan para sahabatnya berdoa (kepada Allah), lalu Allah mengirimkan ulat (di leher) mereka (Ya'juj dan Ma'juj), lalu mereka mati serentak seperti matinya seorang sahaja. Kemudian Nabi Allah Isa dan para sahabatnya turun ke bumi, lalu mereka tidak mendapati di bumi walau sejengkal pun melainkan dipenuhi oleh bau busuk dan bangkai mereka. Lalu Nabi Allah Isa dan para sahabatnya berdoa kepada Allah, lalu Allah mengirimkan burung sebesar leher unta, lalu burung itu membawa mereka dan mencampakkan mereka ke tempat yang Allah kehendaki.\" Dalam riwayat lain: \"Burung itu mencampakkan mereka di al-Nahbal. Dan orang-orang Muslim membakar busur, anak panah, dan bekas anak panah mereka selama tujuh tahun. Kemudian Allah menurunkan hujan yang tidak dapat ditahan oleh rumah daripada tanah liat mahupun daripada bulu, lalu hujan itu membersihkan bumi sehingga meninggalkannya seperti tanah yang licin. Kemudian dikatakan kepada bumi: 'Tumbuhkanlah buahmu dan kembalikanlah keberkatanmu.' Maka pada hari itu, sekumpulan orang dapat makan daripada sebiji buah delima dan mereka berteduh di bawah kulitnya. Diberkati susu (haiwan ternakan) sehingga seekor unta yang baru melahirkan mencukupi untuk sekumpulan besar manusia, seekor lembu yang baru melahirkan mencukupi untuk sebuah kabilah manusia, dan seekor kambing yang baru melahirkan mencukupi untuk sebuah keluarga manusia. Ketika mereka sedang berkeadaan demikian, tiba-tiba Allah mengutuskan angin yang baik lalu mengambil mereka dari bawah ketiak mereka, lalu Dia mencabut nyawa setiap orang mukmin dan setiap orang Muslim. Dan yang tinggal hanyalah orang-orang yang jahat yang melakukan persetubuhan secara terbuka seperti himar, maka kepada merekalah datangnya hari kiamat.\" Riwayat Muslim, kecuali riwayat kedua iaitu perkataannya: \"Burung itu mencampakkan mereka di al-Nahbal sehingga perkataannya: tujuh tahun.\" Riwayat Tirmizi.",
        "arabic_text": "وَعَن النوَّاس بن سمْعَان قَالَ: ذَكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الدَّجَّالَ فَقَالَ: «إِنْ يَخْرُجْ وَأَنَا فِيكُمْ فَأَنَا حَجِيجُهُ دُونَكُمْ وَإِنْ يَخْرُجْ وَلَسْتُ فِيكُمْ فَامْرُؤٌ حَجِيجُ نَفْسِهِ وَاللَّهُ خَلِيفَتِي عَلَى كُلِّ مُسْلِمٍ إِنَّهُ شَابٌّ قَطَطٌ عَيْنُهُ طَافِيَةٌ كَأَنِّي أُشَبِّهُهُ بِعَبْدِ الْعُزَّى بْنِ قَطَنٍ فَمَنْ أَدْرَكَهُ مِنْكُمْ فَلْيَقْرَأْ عَلَيْهِ فَوَاتِحَ سُورَةِ الْكَهْفِ» . وَفِي رِوَايَةٍ «فَلْيَقْرَأْ عَلَيْهِ بِفَوَاتِحِ سُورَةِ الْكَهْفِ فَإِنَّهَا جوارُكم من فتنته إِنَّه خَارج خلة بِي الشَّامِ وَالْعِرَاقِ فَعَاثَ يَمِينًا وَعَاثَ شِمَالًا يَا عِبَادَ اللَّهِ فَاثْبُتُوا» . قُلْنَا: يَا رَسُولَ اللَّهِ وَمَا لَبْثُهُ فِي الْأَرْضِ؟ قَالَ: «أَرْبَعُونَ يَوْمًا يَوْمٌ كَسَنَةٍ وَيَوْمٌ كَشَهْرٍ وَيَوْمٌ كَجُمُعَةٍ وَسَائِرُ أَيَّامِهِ كَأَيَّامِكُمْ» . قُلْنَا: يَا رَسُولَ اللَّهِ فَذَلِكَ الْيَوْمُ الَّذِي كَسَنَةٍ أَتَكْفِينَا فِيهِ صَلَاةُ يَوْمٍ. قَالَ: «لَا اقْدُرُوا لَهُ قَدَرَه» . قُلْنَا: يَا رسولَ اللَّهِ وَمَا إِسْرَاعُهُ فِي الْأَرْضِ؟ قَالَ: كَالْغَيْثِ اسْتَدْبَرَتْهُ الرِّيحُ فَيَأْتِي عَلَى الْقَوْمِ فَيَدْعُوهُمْ فَيُؤْمِنُونَ بِهِ فَيَأْمُرُ السَّمَاءَ فَتُمْطِرُ وَالْأَرْضَ فَتُنْبِتُ فَتَرُوحُ عَلَيْهِمْ سَارِحَتُهُمْ أَطْوَلَ مَا كَانَتْ ذُرًى وَأَسْبَغَهُ ضُرُوعًا وَأَمَدَّهُ خَوَاصِرَ ثُمَّ يَأْتِي الْقَوْمَ فَيَدْعُوهُمْ فَيَرُدُّونَ عَلَيْهِ قَوْله فَيَنْصَرِف عَنْهُم فيصبحون مملحين لَيْسَ بِأَيْدِيهِمْ شَيْءٌ مِنْ أَمْوَالِهِمْ وَيَمُرُّ بِالْخَرِبَةِ فَيَقُولُ لَهَا: أَخْرِجِي كُنُوزَكِ فَتَتْبَعُهُ كُنُوزُهَا كَيَعَاسِيبِ النَّحْلِ ثُمَّ يَدْعُو رَجُلًا مُمْتَلِئًا شَبَابًا فَيَضْرِبُهُ بِالسَّيْفِ فَيَقْطَعُهُ جَزْلَتَيْنِ رَمْيَةَ الْغَرَضِ ثُمَّ يَدْعُوهُ فَيُقْبِلُ وَيَتَهَلَّلُ وَجْهُهُ يَضْحَكُ فَبَيْنَمَا هُوَ كَذَلِكَ إِذْ بَعَثَ اللَّهُ الْمَسِيحَ بْنَ مَرْيَمَ فَيَنْزِلُ عِنْد المنارة الْبَيْضَاء شرقيّ دمشق بَين مهروذتين وَاضِعًا كَفَّيْهِ عَلَى أَجْنِحَةِ مَلَكَيْنِ إِذَا طَأْطَأَ رَأسه قطر وَإِذا رَفعه تحدرمنه مثل جُمان كَاللُّؤْلُؤِ فَلَا يحل لكافرٍ يَجِدَ مِنْ رِيحِ نَفَسِهِ إِلَّا مَاتَ وَنَفَسُهُ يَنْتَهِي حَيْثُ يَنْتَهِي طَرْفُهُ فَيَطْلُبُهُ حَتَّى يُدْرِكَهُ بِبَاب لُدٍّ فيقتُلُه ثمَّ يَأْتِي عِيسَى إِلى قَوْمٌ قَدْ عَصَمَهُمُ اللَّهُ مِنْهُ فَيَمْسَحُ عَنْ وُجُوهِهِمْ وَيُحَدِّثُهُمْ بِدَرَجَاتِهِمْ فِي الْجَنَّةِ فَبَيْنَمَا هُوَ كَذَلِكَ إِذْ أَوْحَى اللَّهُ إِلَى عِيسَى: أَنِّي قَدْ أَخْرَجْتُ عِبَادًا لِي لَا يَدَانِ لِأَحَدٍ بِقِتَالِهِمْ فَحَرِّزْ عِبَادِيَ إِلَى الطُّورِ وَيَبْعَثُ اللَّهُ يَأْجُوجَ وَمَأْجُوجَ (وَهُمْ مِنْ كُلِّ حَدَبٍ يَنْسِلُونَ) فَيَمُرُّ أَوَائِلُهُمْ عَلَى بُحَيْرَةِ طَبَرِيَّةَ فَيَشْرَبُونَ مَا فِيهَا ويمر آخِرهم وَيَقُول: لَقَدْ كَانَ بِهَذِهِ مَرَّةً مَاءٌ ثُمَّ يَسِيرُونَ حَتَّى يَنْتَهُوا إِلَى جَبَلِ الْخَمَرِ وَهُوَ جَبَلُ بَيْتِ الْمَقْدِسِ فَيَقُولُونَ لَقَدْ قَتَلْنَا مَنْ فِي الْأَرْضِ هَلُمَّ فَلْنَقْتُلْ مَنْ فِي السَّمَاءِ فَيَرْمُونَ بِنُشَّابِهِمْ إِلَى السَّمَاءِ فَيَرُدُّ اللَّهُ عَلَيْهِمْ نُشَّابَهُمْ مَخْضُوبَةً دَمًا وَيُحْصَرُ نَبِيُّ اللَّهِ وَأَصْحَابُهُ حَتَّى يَكُونَ رَأْسُ الثَّوْرِ لِأَحَدِهِمْ خَيْرًا مِنْ مِائَةِ دِينَارٍ لِأَحَدِكُمُ الْيَوْمَ فَيَرْغَبُ نَبِيُّ اللَّهِ عِيسَى وَأَصْحَابُهُ فَيُرْسِلُ اللَّهُ عَلَيْهِمُ النَّغَفَ فِي رِقَابِهِمْ فَيُصْبِحُونَ فَرْسَى كَمَوْتِ نَفْسٍ وَاحِدَةٍ ثُمَّ يَهْبِطُ نَبِيُّ اللَّهِ عِيسَى وَأَصْحَابُهُ إِلَى الْأَرْضِ فَلَا يَجِدُونَ فِي الْأَرْضِ مَوْضِعَ شِبْرٍ إِلَّا مَلَأَهُ زَهَمُهُمْ وَنَتْنُهُمْ فَيَرْغَبُ نَبِيُّ اللَّهِ عِيسَى وَأَصْحَابُهُ إِلَى اللَّهِ فَيُرْسِلُ اللَّهُ طَيْرًا كَأَعْنَاقِ الْبُخْتِ فَتَحْمِلُهُمْ فَتَطْرَحُهُمْ حَيْثُ شَاءَ اللَّهُ «. وَفِي رِوَايَةٍ» تَطْرَحُهُمْ بِالنَّهْبَلِ وَيَسْتَوْقِدُ الْمُسْلِمُونَ مِنْ قِسِيِّهِمْ وَنُشَّابِهِمْ وَجِعَابِهِمْ سَبْعَ سِنِينَ ثُمَّ يُرْسِلُ اللَّهُ مَطَرًا لَا يَكُنُّ مِنْهُ بَيْتُ مَدَرٍ وَلَا وَبَرٍ فَيَغْسِلُ الْأَرْضَ حَتَّى يَتْرُكَهَا كَالزَّلَفَةِ ثُمَّ يُقَالُ لِلْأَرْضِ: أَنْبِتِي ثَمَرَتَكِ وَرُدِّي بَرَكَتَكِ فَيَوْمَئِذٍ تَأْكُلُ الْعِصَابَةُ مِنَ الرُّمَّانَةِ وَيَسْتَظِلُّونَ بِقِحْفِهَا وَيُبَارَكُ فِي الرِّسْلِ حَتَّى إِنَّ اللِّقْحَةَ مِنَ الْإِبِلِ لَتَكْفِي الْفِئَامَ مِنَ النَّاسِ وَاللِّقْحَةَ مِنَ الْبَقَرِ لَتَكْفِي الْقَبِيلَةَ مِنَ النَّاسِ وَاللِّقْحَةَ مِنَ الْغَنَمِ لَتَكْفِي الْفَخْذَ مِنَ النَّاسِ فَبَيْنَا هُمْ كَذَلِكَ إِذْ بَعَثَ اللَّهُ رِيحًا طَيِّبَةً فَتَأْخُذُهُمْ تَحْتَ آبَاطِهِمْ فَتَقْبِضُ رُوحَ كُلِّ مؤمنٍ وكلِّ مسلمٍ وَيَبْقَى شِرَارُ النَّاسِ يَتَهَارَجُونَ فِيهَا تَهَارُجَ الْحُمُرِ فَعَلَيْهِمْ تَقُومُ السَّاعَةُ رَوَاهُ مُسْلِمٌ إِلَّا الرِّوَايَةَ الثَّانِيَةَ وَهِيَ قَوْلُهُ: تَطْرَحُهُمْ بِالنَّهْبَلِ إِلَى قَوْلِهِ: سبع سِنِين . رَوَاهَا التِّرْمِذِيّ"
      },
      {
        "id": 34170,
        "hadith_number": "5476",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kisah Pembunuhan Dajjal dan Peristiwa Pemeriksaan Iman",
        "perawi_melayu": "Abu Sa'id al-Khudri",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Sa'id al-Khudri, dia berkata: Rasulullah SAW bersabda: \"Dajjal akan keluar, lalu seorang lelaki mukmin akan menghadapnya.  Para tentera Dajjal akan menyerang lelaki tersebut.  Mereka bertanya kepadanya, \"Ke manakah engkau hendak pergi?\" Dia menjawab, \"Aku hendak menuju kepada orang yang telah keluar ini (Dajjal).\" Kemudian mereka bertanya, \"Apakah engkau tidak takut kepada Tuhan kita dan beriman kepada-Nya?\" Dia menjawab, \"Tidak ada yang tersembunyi daripada Tuhan kita.\"  Kemudian mereka berkata, \"Bunuh dia!\"  Sebahagian dari mereka berkata kepada sebahagian yang lain, \"Bukankah Tuhanmu telah melarangmu untuk membunuh sesiapa selainnya?\" Lalu mereka membawa lelaki tersebut kepada Dajjal.  Apabila orang mukmin itu melihat Dajjal, dia berkata, \"Wahai manusia, ini adalah Dajjal yang telah disebut oleh Rasulullah SAW.\" Kemudian, Dajjal memerintah supaya lelaki tersebut dianiaya. Dia berkata, \"Tangkap dan pukulnya, dan pukuli punggung dan perutnya dengan pukulan yang hebat.\"'  Dia berkata, \"Apakah engkau tidak beriman kepadaku?\"  Dia berkata, \"Engkau adalah al-Masih yang pendusta.\" Dia diperintahkan supaya dipancung dengan gergaji dari ubun-ubun hingga terbelah dua. Kemudian Dajjal berjalan di antara kedua bahagiannya dan bertanya kepadanya, \"Apakah engkau beriman kepadaku?\" Dia berkata, \"Aku hanya semakin bertambah ilmunya.\" Kemudian Dajjal berkata, \"Wahai manusia, sesungguhnya dia tidak akan melakukan sesuatu terhadap sesiapa pun sesudahku.\" Lalu Dajjal ingin membunuhnya. Dajjal meletakkan tembaga di antara lehernya sehingga ke bahunya.  Dia tidak dapat menangkapnya.  Kemudian, Dajjal menangkap kedua tangan dan kaki orang tersebut, dan melemparkannya.  Orang ramai menyangkakan bahawa dia melemparkannya ke dalam neraka, sedangkan dia sebenarnya dilemparkan ke dalam syurga. Lalu Rasulullah SAW bersabda, \"Ini adalah orang yang paling kuat syahadatnya di sisi Tuhan Semesta Alam.\" Diriwayatkan oleh Muslim.",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: يَخْرُجُ الدَّجَّالُ فَيَتَوَّجُهُ قِبَلَهُ رَجُلٌ مِنَ الْمُؤْمِنِينَ فَيَلْقَاهُ الْمَسَالِحُ مَسَالِحُ الدَّجَّالِ. فَيَقُولُونَ لَهُ: أَيْنَ تَعْمِدُ؟ فَيَقُولُ: أَعْمِدُ إِلَى هَذَا الَّذِي خَرَجَ. قَالَ: فَيَقُولُونَ لَهُ: أَو مَا تبَارك وَتَعَالَى ؤمن بِرَبِّنَا؟ فَيَقُولُ: مَا بِرَبِّنَا خَفَاءٌ. فَيَقُولُونَ: اقْتُلُوهُ. فَيَقُولُ بَعْضُهُمْ لِبَعْضٍ: أَلَيْسَ قَدْ نَهَاكُمْ رَبُّكُمْ أَنْ تَقْتُلُوا أَحَدًا دُونَهُ . قَالَ: فَيَنْطَلِقُونَ بِهِ إِلَى الدَّجَّالِ فَإِذَا رَآهُ الْمُؤْمِنُ قَالَ: يَا أَيُّهَا النَّاسُ هَذَا الدَّجَّالُ الَّذِي ذَكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ . قَالَ: فَيَأْمُرُ الدَّجَّال بِهِ فَيُشَبَّحُ. فَيَقُولُ: خُذُوهُ وَشُجُّوهُ فَيُوسَعُ ظَهْرُهُ وَبَطْنُهُ ضَرْبًا . قَالَ: فَيَقُول: أَوَ مَا تُؤْمِنُ بِي؟ قَالَ: فَيَقُولُ: أَنْتَ الْمَسِيحُ الْكَذَّابُ . قَالَ: «فيؤْمر بِهِ فَيْؤشَرُ بالمنشارِ مِنْ مَفْرِقِهِ حَتَى يُفَرَّقَ بَيْنَ رِجْلَيْهِ» . قَالَ: ثُمَّ يَمْشِي الدَّجَّالُ بَيْنَ الْقِطْعَتَيْنِ ثُمَّ يَقُولُ لَهُ: أتؤمنُ بِي؟ فَيَقُول: مَا ازْدَدْتُ إِلَّا بَصِيرَةً . قَالَ: ثُمَّ يَقُولُ: يَا أَيُّهَا النَّاسُ إِنَّهُ لَا يَفْعَلُ بَعْدِي بِأَحَدٍ مِنَ النَّاسِ . قَالَ: «فَيَأْخُذُهُ الدَّجَّالُ لِيَذْبَحَهُ فَيُجْعَلُ مَا بَيْنَ رَقَبَتِهِ إِلَى تَرْقُوَتِهِ نُحَاسًا فَلَا يَسْتَطِيع إِليه سَبِيلا» قَالَ: «فَيَأْخذهُ بِيَدَيْهِ وَرِجْلَيْهِ فَيَقْذِفُ بِهِ فَيَحْسِبُ النَّاسُ أَنَّمَا قَذَفَهُ إِلَى النَّارِ وَإِنَّمَا أُلْقِيَ فِي الْجَنَّةُ» فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَذَا أَعْظَمُ النَّاسِ شَهَادَةً عِنْدَ رَبِّ الْعَالَمِينَ» . رَوَاهُ مُسلم"
      },
      {
        "id": 34171,
        "hadith_number": "5477",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Orang-orang Akan Melarikan Diri Daripada Dajjal Hingga ke Gunung",
        "perawi_melayu": "Ummu Syarik",
        "english_text": "And from Umm Syarik, she said: The Messenger of Allah, peace and blessings be upon him, said, \"People will flee from the Dajjal until they reach the mountains.\" Umm Syarik said, \"I said, O Messenger of Allah, then where are the Arabs on that day?\" He said, \"They are few.\"",
        "malay_translation": "Dan daripada Umm Syarik, beliau berkata: Rasulullah SAW bersabda, \"Sesungguhnya manusia akan melarikan diri daripada Dajjal sehingga mereka sampai ke gunung-ganang.\" Umm Syarik berkata, \"Lalu aku bertanya, Wahai Rasulullah, di manakah orang Arab pada hari itu?\" Baginda menjawab, \"Mereka sedikit.\" ",
        "arabic_text": "وَعَن أمّ شريكٍ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيَفِرَّنَّ النَّاسُ مِنَ الدَّجَّالِ حَتَّى يَلْحَقُوا بِالْجِبَالِ» قَالَتْ أُمُّ شَرِيكٍ: قُلْتُ: يَا رَسُولَ اللَّهِ فَأَيْنَ الْعَرَبُ يَوْمَئِذٍ؟ قَالَ: «هُمْ قَلِيلٌ» . رَوَاهُ مُسلم"
      },
      {
        "id": 34172,
        "hadith_number": "5478",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pengikut Dajjal daripada Yahudi Isfahan",
        "perawi_melayu": "Anas",
        "english_text": "Dari Anas daripada Rasulullah SAW baginda bersabda: \"Akan mengikut Dajjal sejumlah tujuh puluh ribu Yahudi daripada Isfahan, dan mereka memakai pakaian berwarna putih/tipis.\"",
        "malay_translation": "Dari Anas bin Malik رضي الله عنه daripada Rasulullah SAW, baginda bersabda: \"Akan menyusuli Dajjal sejumlah tujuh puluh ribu orang Yahudi dari Isfahan, dan mereka memakai pakaian tipis berwarna putih/tipis.\"",
        "arabic_text": "وَعَنْ أَنَسٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَتْبَعُ الدَّجَّالَ مِنْ يَهُودِ أصفَهانَ سبعونَ ألفا عَلَيْهِم طيالسة» . رَوَاهُ مُسلم"
      },
      {
        "id": 34173,
        "hadith_number": "5479",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kedatangan Dajjal dan Peristiwa Penting sebelum Kemunculannya",
        "perawi_melayu": "Abu Said al-Khudri",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Said al-Khudri, katanya: Rasulullah SAW bersabda: \"Dajjal akan datang dan ia dilarang memasuki kota Madinah. Ia akan turun di kawasan luar kota Madinah. Seorang lelaki yang terbaik atau dari kalangan orang terbaik di antara manusia akan keluar menemui Dajjal. Kemudian lelaki itu berkata: \"Aku bersaksi bahawa engkaulah Dajjal yang telah dijelaskan oleh Rasulullah SAW. Kemudian Dajjal bertanya: \"Bagaimana pendapat kamu jika aku membunuh orang ini dan kemudian menghidupkannya semula? Apakah kamu ragu-ragu terhadap perkara ini?\" Mereka menjawab: \"Tidak.\" Lalu Dajjal membunuhnya dan menghidupkannya semula. Kemudian Dajjal berkata: \"Demi Allah, aku tidak pernah lebih yakin dalam penglihatan terhadapmu hari ini daripada hari ini.\"\" Dajjal ingin membunuhnya tetapi ia tidak dibenarkan membunuh orang tersebut.",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: يَأْتِي الدَّجَّالُ وَهُوَ مُحَرَّمٌ عَلَيْهِ أَنْ يَدْخُلَ نِقَابَ الْمَدِينَةِ فَيَنْزِلُ بَعْضَ السِّبَاخِ الَّتِي تَلِي الْمَدِينَةَ فَيَخْرُجُ إِلَيْهِ رَجُلٌ وَهُوَ خَيْرُ النَّاسِ أَوْ مِنْ خِيَارِ النَّاسِ فَيَقُولُ: أَشْهَدُ أَنَّكَ الدَّجَّالُ الَّذِي حَدَّثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثَهُ فَيَقُولُ الدَّجَّالُ: أَرَأَيْتُمْ إِنْ قَتَلْتُ هَذَا ثُمَّ أَحْيَيْتُهُ هَلْ تَشُكُّونَ فِي الْأَمْرِ؟ فَيَقُولُونَ: لَا فَيَقْتُلُهُ ثُمَّ يُحْيِيهِ فَيَقُولُ: وَاللَّهِ مَا كُنْتُ فِيكَ أَشَدَّ بَصِيرَةً مِنِّي الْيَوْمَ فَيُرِيدُ الدَّجَّالُ أَنْ يَقْتُلَهُ فَلَا يُسَلَّطُ عَلَيْهِ . مُتَّفق عَلَيْهِ"
      },
      {
        "id": 34174,
        "hadith_number": "5480",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kedatangan Al-Masih dari Timur dan Kemusnahannya di Damaskus",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Dari Abu Hurairah daripada Rasulullah SAW bersabda: \"Al-Masih akan datang dari arah timur, niatnya ke Madinah sehingga dia turun di belakang Uhud. Kemudian malaikat akan memalingkan wajahnya ke arah Syam. Dan di situlah dia akan binasa.\"",
        "malay_translation": "Daripada Abu Hurairah daripada Rasulullah SAW bersabda: \"Al-Masih akan datang dari arah timur, niatnya menuju Madinah sehingga dia turun di belakang Uhud. Kemudian malaikat akan memalingkan wajahnya ke arah Syam. Dan di situlah dia akan binasa.\"  (Riwayat yang disepakati).",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَأْتِي الْمَسِيحُ مِنْ قِبَلِ الْمَشْرِقِ هِمَّتُهُ الْمَدِينَةُ حَتَّى يَنْزِلَ دُبُرَ أُحُدٍ ثُمَّ تَصْرِفُ الْمَلَائِكَةُ وَجْهَهُ قِبَلَ الشامِ وهنالك يهلِكُ» . مُتَّفق عَلَيْهِ"
      },
      {
        "id": 34175,
        "hadith_number": "5481",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Dajjal Tidak Dapat Memasuki Madinah",
        "perawi_melayu": "Diriwayatkan dari Abu Bakrah, dari Nabi Muhammad SAW",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Bakrah, daripada Nabi SAW bersabda: \"Tidak akan masuk ke Madinah rasa gerun Al-Masih Dajjal. Pada hari itu, Madinah mempunyai tujuh pintu, dan pada setiap pintu ada dua malaikat.\"",
        "arabic_text": "وَعَنْ أَبِي بَكْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَدْخُلُ الْمَدِينَةَ رُعْبُ الْمَسِيحِ الدَّجَّالِ لَهَا يَوْمَئِذٍ سَبْعَةُ أَبْوَابٍ عَلَى كُلِّ بَابٍ مَلَكَانِ» رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 34176,
        "hadith_number": "5482",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kisah Tamim ad-Dari dan Dajjal",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Fatimah binti Qais RA, beliau berkata: Aku mendengar penyeru Rasulullah SAW. Apabila selesai solat, baginda duduk di atas mimbar sambil tersenyum lalu bersabda: “Hendaklah setiap orang tetap di tempat solatnya.” Kemudian baginda bersabda: “Adakah kamu tahu mengapa aku mengumpulkan kamu?” Mereka menjawab: Allah dan Rasul-Nya lebih mengetahui. Baginda bersabda: “Sesungguhnya, demi Allah, aku tidak mengumpulkan kamu kerana mengharap atau takut, tetapi aku mengumpulkan kamu kerana Tamim ad-Dari seorang lelaki Nasrani telah datang lalu berbai'ah dan memeluk Islam, dan dia menceritakan kepadaku sebuah hadith yang bertepatan dengan apa yang aku ceritakan kepada kamu tentang al-Masih ad-Dajjal. Dia menceritakan kepadaku bahawa dia menaiki sebuah kapal laut bersama tiga puluh orang lelaki dari Lakhm dan Juzam. Mereka diombang-ambingkan ombak selama sebulan di laut lalu mereka terdampar di sebuah pulau ketika matahari terbenam. Mereka duduk di dalam kapal yang paling dekat lalu masuk ke pulau itu. Tiba-tiba mereka bertemu dengan seekor binatang yang berbulu lebat dan mereka tidak tahu mana bahagian depan dan belakangnya kerana terlalu banyak bulu. Mereka bertanya: Celakalah engkau, siapakah engkau? Ia menjawab: Aku adalah al-Jassasah. Mereka bertanya: Apakah al-Jassasah itu? Ia menjawab: Wahai kaum, pergilah kamu kepada lelaki ini di biara, kerana dia sangat ingin mengetahui berita tentang kamu. Dia berkata: Ketika dia menyebut nama seorang lelaki kepada kami, kami takut kepadanya kerana dia mungkin syaitan. Dia berkata: Maka kami pun bergegas sehingga kami masuk ke biara, tiba-tiba di dalamnya ada manusia yang paling besar yang pernah kami lihat, dan yang paling terikat, tangannya terikat ke lehernya antara lututnya dan buku lalinya dengan besi. Kami bertanya: Celakalah engkau, siapakah engkau? Dia menjawab: Kamu telah mengetahui tentang diriku, maka beritahulah aku siapakah kamu? Mereka menjawab: Kami adalah orang-orang Arab yang menaiki kapal laut lalu kami diombang-ambingkan laut selama sebulan lalu kami masuk ke pulau ini, lalu kami bertemu dengan binatang yang berbulu lebat lalu ia berkata: Aku adalah al-Jassasah, pergilah kepada lelaki ini di biara. Maka kami pun bergegas kepadanya dan kami takut kepadanya dan kami tidak aman daripada dia menjadi syaitan. Dia bertanya: Beritahulah aku tentang kurma Baisan. Kami bertanya: Tentang apa yang engkau ingin tahu? Dia bertanya: Aku bertanya tentang kurmanya, adakah ia berbuah? Kami menjawab: Ya. Dia berkata: Ketahuilah, ia hampir tidak berbuah lagi. Dia berkata: Beritahulah aku tentang tasik Tabariyyah. Kami bertanya: Tentang apa yang engkau ingin tahu? Dia bertanya: Adakah air di dalamnya? Kami menjawab: Ia banyak airnya. Dia berkata: Ketahuilah, airnya hampir habis. Dia berkata: Beritahulah aku tentang mata air Zughar. Mereka bertanya: Tentang apa yang engkau ingin tahu? Dia bertanya: Adakah air di mata air itu? Dan adakah penduduknya bercucuk tanam dengan air mata air itu? Kami menjawab kepadanya: Ya, ia banyak airnya dan penduduknya bercucuk tanam dengan airnya. Dia berkata: Beritahulah aku tentang nabi yang ummi itu, apa yang telah dia lakukan? Kami menjawab: Dia telah keluar dari Makkah dan tinggal di Yathrib. Dia bertanya: Adakah orang-orang Arab memeranginya? Kami menjawab: Ya. Dia bertanya: Bagaimana dia berurusan dengan mereka? Lalu kami memberitahunya bahawa dia telah mengalahkan orang-orang Arab yang berdekatan dengannya dan mereka mentaatinya. Dia berkata kepada mereka: Adakah itu telah berlaku? Kami menjawab: Ya. Dia berkata: Ketahuilah, itu lebih baik bagi mereka untuk mentaatinya dan aku akan memberitahu kamu tentang diriku: Sesungguhnya aku adalah al-Masih ad-Dajjal dan sesungguhnya aku hampir diizinkan untuk keluar, maka aku akan keluar lalu aku berjalan di bumi dan aku tidak akan meninggalkan satu pun kampung kecuali aku akan memasukinya dalam empat puluh malam, selain Makkah dan Taybah, keduanya diharamkan atasku, setiap kali aku ingin memasuki salah satu atau salah satu daripadanya, malaikat akan menyambutku dengan pedang terhunus menghalangku daripadanya, dan sesungguhnya di setiap lorong daripadanya ada malaikat yang menjaganya. Rasulullah SAW bersabda - sambil menusuk mimbar dengan tongkatnya -: “Inilah Taybah, inilah Taybah, inilah Taybah” iaitu Madinah. “Ketahuilah, adakah aku pernah menceritakan kepada kamu?” Maka orang ramai menjawab: Ya. Maka sesungguhnya aku kagum dengan hadith Tamim kerana ia bertepatan dengan apa yang aku ceritakan kepada kamu tentangnya dan tentang Madinah dan Makkah. Ketahuilah, sesungguhnya dia berada di laut Syam atau laut Yaman, tidak, bahkan dari arah timur, dia dari arah timur, dia dari arah timur, dan baginda memberi isyarat dengan tangannya ke arah timur. Riwayat Muslim.",
        "arabic_text": "وَعَن فَاطِمَة بنت قيس قَالَتْ: سَمِعْتُ مُنَادِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا قَضَى صَلَاتَهُ جَلَسَ عَلَى الْمِنْبَرِ وَهُوَ يَضْحَكُ فَقَالَ: «لِيَلْزَمْ كُلُّ إِنْسَانٍ مُصَلَّاهُ» . ثُمَّ قَالَ: «هَلْ تَدْرُونَ لِمَ جَمَعْتُكُمْ؟» . قَالُوا: اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: إِنِّي وَاللَّهِ مَا جَمَعْتُكُمْ لِرَغْبَةٍ وَلَا لِرَهْبَةٍ وَلَكِنْ جَمَعْتُكُمْ لِأَنَّ تَمِيمًا الدَّارِيَّ كَانَ رَجُلًا نَصْرَانِيًّا فَجَاءَ فَبَايَعَ وَأَسْلَمَ وَحَدَّثَنِي حَدِيثًا وَافَقَ الَّذِي كُنْتُ أُحَدِّثُكُمْ بِهِ عَنِ الْمَسِيحِ الدَّجَّالِ حَدَّثَنِي أَنَّهُ رَكِبَ فِي سَفِينَةٍ بَحْرِيَّةٍ مَعَ ثَلَاثِينَ رَجُلًا مِنْ لَخْمٍ وَجُذَامَ فَلَعِبَ بِهِمُ الْمَوْجُ شَهْرًا فِي الْبَحْر فأرفؤُوا إِلَى جَزِيرَةٍ حِينَ تَغْرُبُ الشَّمْسُ فَجَلَسُوا فِي أقرب سفينة فَدَخَلُوا الْجَزِيرَةَ فَلَقِيَتْهُمْ دَابَّةٌ أَهْلَبُ كَثِيرُ الشَّعَرِ لَا يَدْرُونَ مَا قُبُلُهُ مِنْ دُبُرِهِ مِنْ كَثْرَةِ الشَّعَرِ قَالُوا: وَيْلَكِ مَا أَنْتِ؟ قَالَتْ: أَنَا الْجَسَّاسَةُ قَالُوا: وَمَا الْجَسَّاسَةُ؟ قَالَتْ: أَيُّهَا الْقَوْمُ انْطَلِقُوا إِلَى هَذَا الرَّجُلِ فِي الدَّيْرِ فَإِنَّهُ إِلَى خَبَرِكُمْ بِالْأَشْوَاقِ قَالَ: لَمَّا سَمَّتْ لَنَا رَجُلًا فَرِقْنَا مِنْهَا أَنْ تَكُونَ شَيْطَانَةً قَالَ: فَانْطَلَقْنَا سِرَاعًا حَتَّى دَخَلْنَا الدَّيْرَ فَإِذَا فِيهِ أعظمُ إِنسان مَا رَأَيْنَاهُ قطُّ خَلْقاً وأشَدُّهُ وَثَاقاً مجموعةٌ يَده إِلَى عُنُقِهِ مَا بَيْنَ رُكْبَتَيْهِ إِلَى كَعْبَيْهِ بِالْحَدِيدِ. قُلْنَا: وَيْلَكَ مَا أَنْتَ؟ قَالَ: قَدْ قَدَرْتُمْ عَلَى خَبَرِي فَأَخْبِرُونِي مَا أَنْتُمْ؟ قَالُوا: نَحن أُناس من العربِ ركبنَا فِي سفينةٍ بحريّة فلعِبَ بِنَا الْبَحْر شهرا فَدَخَلْنَا الجزيرة فَلَقِيَتْنَا دَابَّةٌ أَهْلَبُ فَقَالَتْ: أَنَا الْجَسَّاسَةُ اعْمِدُوا إِلَى هَذَا فِي الدَّيْرِ فَأَقْبَلْنَا إِلَيْكَ سِرَاعًا وَفَزِعْنَا مِنْهَا وَلَمْ نَأْمَنْ أَنْ تَكُونَ شَيْطَانَةً فَقَالَ: أَخْبِرُونِي عَنْ نَخْلِ بَيْسَانَ قُلْنَا: عَنْ أَيِّ شَأْنِهَا تَسْتَخْبِرُ؟ قَالَ: أَسْأَلُكُمْ عَنْ نَخْلِهَا هَلْ تُثْمِرُ؟ قُلْنَا: نَعَمْ. قَالَ: أَمَا إِنَّهَا تُوشِكُ أَنْ لَا تُثْمِرَ. قَالَ: أَخْبِرُونِي عَنْ بُحَيْرَةِ الطَّبَرِيَّةِ قُلْنَا: عَنْ أَيِّ شَأْنِهَا تَسْتَخْبِرُ؟ قَالَ: هَلْ فِيهَا مَاءٌ؟ قُلْنَا هِيَ كَثِيرَةُ الْمَاءِ. قَالَ: أَمَا إِنَّ مَاءَهَا يُوشِكُ أَنْ يَذْهَبَ. قَالَ: أَخْبِرُونِي عَنْ عَيْنِ زُغَرَ. قَالُوا: وَعَنْ أَيِّ شَأْنِهَا تَسْتَخْبِرُ؟ قَالَ: هَلْ فِي الْعَيْنِ مَاءٌ؟ وَهَلْ يَزْرَعُ أَهْلُهَا بِمَاءِ الْعَيْنِ؟ قُلْنَا لَهُ: نعم هِيَ كَثِيرَة المَاء وَأَهله يَزْرَعُونَ مِنْ مَائِهَا. قَالَ: أَخْبِرُونِي عَنْ نَبِيِّ الْأُمِّيِّينَ مَا فَعَلَ؟ قُلْنَا: قَدْ خَرَجَ مِنْ مَكَّةَ وَنَزَلَ يَثْرِبَ. قَالَ: أَقَاتَلَهُ الْعَرَبُ؟ قُلْنَا: نَعَمْ. قَالَ: كَيْفَ صَنَعَ بِهِمْ؟ فَأَخْبَرْنَاهُ أَنَّهُ قَدْ ظَهَرَ عَلَى مَنْ يَلِيهِ مِنَ الْعَرَبِ وأطاعوهُ. قَالَ لَهُم: قد كانَ ذلكَ؟ قُلْنَا: نعم. قَالَ: أَمَا إِنَّ ذَلِكَ خَيْرٌ لَهُمْ أَنْ يُطِيعُوهُ وَإِنِّي مُخْبِرُكُمْ عَنِّي: إِنِّي أَنَا الْمَسِيحُ الدَّجَّالُ وَإِنِّي يُوشِكُ أَنْ يُؤْذَنَ لِي فِي الْخُرُوجِ فَأَخْرُجَ فَأَسِيرَ فِي الْأَرْضِ فَلَا أَدَعُ قَرْيَةً إِلَّا هَبَطْتُهَا فِي أَرْبَعِينَ لَيْلَةً غَيْرَ مَكَّةَ وَطَيْبَةَ هُمَا مُحَرَّمَتَانِ عَلَيَّ كِلْتَاهُمَا كُلَّمَا أَرَدْتُ أَنْ أَدْخُلَ وَاحِدَةً أَوْ وَاحِدًا مِنْهُمَا استقبلَني ملَكٌ بيدهِ السيفُ صَلْتًا يَصُدُّنِي عَنْهَا وَإِنَّ عَلَى كُلِّ نَقْبٍ مِنْهَا مَلَائِكَةً يَحْرُسُونَهَا. قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - وَطَعَنَ بِمِخْصَرَتِهِ فِي الْمِنْبَرِ -: «هَذِه طَيْبَةُ هَذِهِ طَيْبَةُ هَذِهِ طَيْبَةُ» يَعْنِي الْمَدِينَةَ «أَلَا هَلْ كُنْتُ حَدَّثْتُكُمْ؟» فَقَالَ النَّاسُ: نَعَمْ فَإِنَّهُ أَعْجَبَنِي حَدِيثُ تَمِيمٍ أَنَّهُ وَافَقَ الَّذِي كُنْتُ أُحَدِّثُكُمْ عَنْهُ وَعَنِ الْمَدِينَةِ وَمَكَّةَ. أَلَا إِنه فِي بَحر الشَّأمِ أَو بحرِ اليمنِ لَا بل من قبل الْمشرق ماهو من قبل الْمشرق ماهو من قبل الْمشرق ماهو وَأَوْمَأَ بِيَدِهِ إِلَى الْمشرق. رَوَاهُ مُسلم"
      },
      {
        "id": 34177,
        "hadith_number": "5483",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penglihatan Rasulullah SAW Tentang Al-Masih dan Al-Dajjal di Baitullah",
        "perawi_melayu": "Abdullah bin Umar",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abdullah bin Umar RA, bahawa Rasulullah SAW bersabda: \"Pada malam itu, aku melihat di sisi Kaabah, seorang lelaki berkulit cerah, sebaik-baik paras rupa seorang lelaki, dengan lidah yang sangat elok bentuknya, yang basah menitik air, bersandar di antara dua orang. Dia sedang tawaf di Baitullah. Aku bertanya, 'Siapakah lelaki ini?' Mereka menjawab, 'Inilah Al-Masih bin Maryam.' Kemudian, aku melihat seorang lelaki berambut kerinting, bertubuh tegap, buta sebelah mata kanannya, seperti buah anggur yang tergantung, menyerupai Ibn Qatn. Dia sedang bersandar di antara dua orang, sedang tawaf di Baitullah. Aku bertanya, 'Siapakah lelaki ini?' Mereka menjawab, 'Inilah Al-Dajjal.' (Hadis riwayat Bukhari dan Muslim). Dalam satu riwayat, disebutkan tentang Al-Dajjal: 'Seorang lelaki yang berambut merah, tegap, berambut kerinting, buta sebelah mata kanannya, menyerupai Ibn Qatn.'  Perkara ini juga disebut dalam hadith Abu Hurairah tentang 'tidak akan berlaku kiamat sehingga matahari terbit dari arah barat.' (Di dalam bab tentang tanda-tanda kiamat) dan juga dalam hadith Ibnu Umar.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: رَأَيْتُنِي اللَّيْلَةَ عِنْدَ الْكَعْبَةِ فَرَأَيْتُ رَجُلًا آدَمَ كَأَحْسَنِ مَا أَنْتَ رَاءٍ مِنْ أُدْمِ الرِّجَالِ لَهُ لِمَّةٌ كَأَحْسَنِ مَا أَنْتَ رَاءٍ مِنَ اللِّمَمِ قد رجَّلَها فَهِيَ تقطر مَاء متكأ عَلَى عَوَاتِقِ رَجُلَيْنِ يَطُوفُ بِالْبَيْتِ فَسَأَلْتُ: مَنْ هَذَا؟ فَقَالُوا: هَذَا الْمَسِيح بن مَرْيَمَ قَالَ: ثُمَّ إِذَا أَنَا بَرْجُلٍ جَعْدٍ قَطَطٍ أَعْوَرِ الْعَيْنِ الْيُمْنَى كَأَنَّ عَيْنَهُ عِنَبَةٌ طَافِيَةٌ كَأَشْبَهِ مَنْ رَأَيْتُ مِنَ النَّاسِ بِابْنِ قَطَنٍ وَاضِعًا يَدَيْهِ عَلَى مَنْكِبَيْ رَجُلَيْنِ يَطُوفُ بِالْبَيْتِ فَسَأَلْتُ مَنْ هَذَا؟ فَقَالُوا: هَذَا الْمَسِيحُ الدَّجَّالُ . مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ: قَالَ فِي الدَّجَّالِ: «رَجُلٌ أَحْمَرُ جَسِيمٌ جَعْدُ الرَّأْسِ أَعْوَرُ عَيْنِ الْيُمْنَى أَقْرَبُ النَّاسِ بِهِ شَبَهًا ابْنُ قَطَنٍ» وَذَكَرَ حَدِيثَ أَبِي هُرَيْرَةَ: «لَا تَقُومُ السَّاعَةُ حَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا» فِي «بَابِ الْمَلَاحِمِ» وَسَنَذْكُرُ حَدِيثَ ابْنِ عُمَرَ: قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي النَّاس فِي «بَاب قصَّة ابْن الصياد» إِن شَاءَ الله تَعَالَى"
      },
      {
        "id": 34178,
        "hadith_number": "5484",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kisah Tamim ad-Dari dan Pertemuan dengan Dajjal",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Fatimah binti Qais dalam Hadis Tamim ad-Dari: Dia berkata: Dia berkata: Tiba-tiba aku melihat seorang wanita menyeret rambutnya. Dia berkata: Siapa kamu? Dia berkata: Aku adalah al-Jassasah, pergi ke istana itu. Lalu aku mendatanginya, dan tiba-tiba ada seorang lelaki menyeret rambutnya, dirantai dengan belenggu, melompat-lompat di antara langit dan bumi. Aku bertanya: Siapa kamu? Dia menjawab: Aku adalah Dajjal. Riwayat Abu Daud.",
        "arabic_text": "عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ فِي حَدِيثِ تَمِيمٍ الدَّارِيِّ: قَالَتْ: قَالَ: فَإِذَا أَنَا بِامْرَأَةٍ تَجُرُّ شَعَرَهَا قَالَ: مَا أَنْتِ؟ قَالَتْ: أَنَا الْجَسَّاسَةُ اذْهَبْ إِلَى ذَلِكَ الْقَصْرِ فَأَتَيْتُهُ فَإِذَا رَجُلٌ يَجُرُّ شَعَرَهُ مُسَلْسَلٌ فِي الْأَغْلَالِ يَنْزُو فِيمَا بَيْنُ السَّمَاءِ وَالْأَرْضِ. فَقُلْتُ: مَنْ أَنْتَ؟ قَالَ: أَنا الدَّجَّال . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 34179,
        "hadith_number": "5485",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penerangan Ciri-ciri Dajjal dan Amaran Kepada Umat",
        "perawi_melayu": "Ubadah bin as-Samit",
        "english_text": "Daripada Ubadah bin as-Samit daripada Rasulullah SAW. Baginda bersabda, \"Sesungguhnya aku telah menceritakan kepada kamu tentang Dajjal sehingga aku khuatir kamu tidak dapat memahaminya. Sesungguhnya Al-Masih Ad-Dajjal itu pendek, berkaki besar, berambut kerinting, buta sebelah mata, matanya berlorek, tidak menonjol dan tidak juga menunduk. Jika dia menyesatkan kamu, maka ketahuilah bahawa Tuhan kamu bukanlah buta sebelah mata.\" Diriwayatkan oleh Imam Abu Daud.",
        "malay_translation": "Daripada Ubadah bin as-Samit daripada Rasulullah SAW. Baginda bersabda, \"Sesungguhnya aku telah menceritakan kepada kamu tentang Dajjal sehingga aku bimbang kamu tidak dapat memahaminya. Sesungguhnya Al-Masih Ad-Dajjal itu bertubuh pendek, berkaki besar, berambut kerinting, buta sebelah mata, dan matanya berlorek, tidak menonjol dan tidak pula menunduk. Jika dia menyesatkan kamu, maka ketahuilah bahawa Tuhan kamu bukanlah buta sebelah mata.\" Diriwayatkan oleh Imam Abu Daud.",
        "arabic_text": "وَعَنْ عُبَادَةَ بْنِ الصَّامِتِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنِّي حَدَّثْتُكُمْ عَنِ الدَّجَّالِ حَتَّى خَشِيتُ أَنْ لَا تَعْقِلُوا. إِنَّ الْمَسِيحَ الدَّجَّالَ قَصِيرٌ أَفْحَجُ جَعْدٌ أَعْوَرُ مَطْمُوسُ الْعَيْنِ لَيْسَتْ بِنَاتِئَةٍ وَلَا حَجْرَاءَ فَإِنْ أُلْبِسَ عَلَيْكُمْ فَاعْلَمُوا أَنَّ رَبَّكُمْ لَيْسَ بِأَعْوَرَ» رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 34180,
        "hadith_number": "5486",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Peringatan tentang Dajjal dan Keadaan Hati Orang Beriman",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Ubaidah bin al-Jarrah RA, beliau berkata: Aku mendengar Rasulullah SAW bersabda: “Sesungguhnya tidak ada seorang nabi pun selepas Nuh AS melainkan telah memperingatkan kaumnya tentang Dajjal, dan sesungguhnya aku memperingatkan kamu tentangnya.” Baginda SAW menyifatkannya kepada kami. Baginda SAW bersabda: “Barangkali sebahagian orang yang melihatku atau mendengar perkataanku akan menemuinya (Dajjal).” Mereka bertanya: “Wahai Rasulullah, bagaimana keadaan hati kami pada hari itu?” Baginda SAW menjawab: “Seperti hari ini – yakni, atau lebih baik.” Riwayat at-Tirmizi dan Abu Daud.",
        "arabic_text": "وَعَن أَي عُبَيْدَةَ بْنِ الْجَرَّاحِ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّهُ لَمْ يَكُنْ نَبِيٌّ بَعْدَ نُوحٍ إِلَّا قَدْ أَنْذَرَ الدجالَ قومَه وإِني أُنذركموه» فرصفه لَنَا قَالَ: «لَعَلَّهُ سَيُدْرِكُهُ بَعْضُ مَنْ رَآنِي أَوْ سَمِعَ كَلَامِي» . قَالُوا: يَا رَسُولَ اللَّهِ فَكَيْفَ قُلُوبُنَا يَوْمَئِذٍ؟ قَالَ: «مِثْلُهَا» يَعْنِي الْيَوْمَ «أوخير» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد"
      },
      {
        "id": 34181,
        "hadith_number": "5487",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kiamat dan Kedatangan Dajjal dari Wilayah Khurasan",
        "perawi_melayu": "Amru bin Huraith dari Abu Bakar al-Siddiq",
        "english_text": "Daripada Amru bin Huraith dari Abu Bakar al-Siddiq, beliau berkata: Rasulullah SAW bersabda: Dajjal keluar dari sebuah negeri di Timur, yang dikenali sebagai Khurasan. Dia akan diikuti oleh sekumpulan orang yang wajah mereka seperti batu-batu yang dipukul hingga hancur.",
        "malay_translation": "Daripada Amru bin Huraith daripada Abu Bakar al-Siddiq, beliau berkata: Rasulullah SAW bersabda, “Dajjal akan keluar dari sebuah negeri di Timur, yang dikenali sebagai Khurasan. Dia akan diikuti oleh sekumpulan orang yang wajah mereka seperti batu-batu yang dipukul hingga hancur.”  Hadis ini diriwayatkan oleh Imam Tirmidzi.",
        "arabic_text": "وَعَنْ عَمْرِو بْنِ حُرَيْثٍ عَنْ أَبِي بَكْرٍ الصّديق قَالَ: حَدَّثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: الدَّجَّالُ يَخْرُجُ مِنْ أَرْضٍ بِالْمَشْرِقِ يُقَالُ لَهَا: خُرَاسَانُ يَتْبَعُهُ أَقْوَامٌ كَأَنَّ وُجُوهَهُمُ المجانّ المطرقة . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 34182,
        "hadith_number": "5488",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menjauhi Dajal dan Fitnahnya",
        "perawi_melayu": "Imran bin Husain",
        "english_text": "Not Available",
        "malay_translation": "Daripada Imran bin Husain RA, beliau berkata: Rasulullah SAW bersabda: “Sesiapa yang mendengar tentang Dajal, maka hendaklah dia menjauhinya. Demi Allah, sesungguhnya seseorang akan mendatanginya dan dia menyangka dirinya beriman, kemudian dia mengikutinya disebabkan syubhat yang dibawanya.” (Riwayat Abu Daud)",
        "arabic_text": "وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ سَمِعَ بالدجال فلينأ مِنْهُ فو الله إِنَّ الرَّجُلَ لَيَأْتِيهِ وَهُوَ يَحْسِبُ أَنَّهُ مُؤْمِنٌ فَيَتَّبِعُهُ مِمَّا يَبْعَثُ بِهِ مِنَ الشُّبُهَاتِ» رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 34183,
        "hadith_number": "5489",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tempoh Dajjal di Bumi dan Kelajuan Masa",
        "perawi_melayu": "Asma' binti Yazid bin as-Sakan meriwayatkan",
        "english_text": "Not Available",
        "malay_translation": "Daripada Asma' binti Yazid bin as-Sakan RA, beliau berkata: Nabi SAW bersabda: “Dajjal akan tinggal di bumi selama empat puluh tahun, satu tahun seperti satu bulan, satu bulan seperti satu minggu, satu minggu seperti satu hari, dan satu hari seperti nyalaan pelepah tamar di dalam api.” (Riwayat dalam Syarh as-Sunnah)",
        "arabic_text": "وَعَن أَسمَاء بنت يزِيد بن السَّكن قَالَتْ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَمْكُثُ الدَّجَّالُ فِي الْأَرْضِ أَرْبَعِينَ سَنَةً السَّنَةُ كَالشَّهْرِ وَالشَّهْرُ كَالْجُمُعَةِ وَالْجُمُعَةُ كَالْيَوْمِ وَالْيَوْمُ كَاضْطِرَامِ السَّعَفَةِ فِي النَّارِ» . رَوَاهُ فِي «شَرْحِ السُّنَّةِ»"
      },
      {
        "id": 34184,
        "hadith_number": "5490",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pengikut Dajjal Daripada Umat Nabi",
        "perawi_melayu": "Abu Said al-Khudri",
        "english_text": "Daripada Abu Sa'id al-Khudri, dia berkata: Rasulullah SAW bersabda: \"Akan mengikut Dajjal dari umatku sebanyak tujuh puluh ribu orang, dan mereka akan mempunyai tanda sijil.\"",
        "malay_translation": "Daripada Abu Sa'id al-Khudri, beliau berkata: Rasulullah SAW bersabda: \"Akan mengikut Dajjal dari umatku sebanyak tujuh puluh ribu orang, dan mereka akan dibezakan dengan tanda tertentu.\" (Riwayat dalam Syarah Sunnah)",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَتْبَعُ الدَّجَّالَ مِنْ أُمَّتِي سَبْعُونَ أَلْفًا عَلَيْهِمُ السِّيجَانُ» . رَوَاهُ فِي شرح السّنة"
      },
      {
        "id": 34185,
        "hadith_number": "5491",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Gambaran Tentang Dajjal dan Kesannya Kepada Manusia",
        "perawi_melayu": "Ummu Asma binti Yazid",
        "english_text": "Not Available",
        "malay_translation": "Ummu Asma binti Yazid meriwayatkan, Rasulullah SAW pernah berada di rumahku dan membicarakan tentang Dajjal. Baginda bersabda: \"Sebelum kedatangannya, terdapat tiga tahun. Pada tahun pertama, langit akan menahan sepertiga daripada cahayanya dan bumi sepertiga daripada tumbuhannya. Pada tahun kedua, langit menahan dua pertiga cahayanya dan bumi dua pertiga daripada tumbuhannya. Pada tahun ketiga, langit akan menahan seluruh cahayanya dan bumi seluruh tumbuhannya. Tiada binatang yang berbulu atau bergigit yang akan terselamat kecuali binasa.  Di antara fitnah yang paling hebat daripadanya ialah dia akan datang kepada orang Badwi dan berkata: 'Apakah engkau mahu aku hidupkan unta-untamu? Bukankah aku Tuhanmu?' Orang itu akan menjawab: 'Ya'. Lalu syaitan akan mencipta unta yang hampir sama seperti unta-untamu, dengan bentuk terbaik dan paling besar. Beliau juga akan datang kepada orang yang kehilangan ayahnya dan saudaranya dan bertanya: 'Apakah engkau mahu aku hidupkan ayah dan saudaramu? Bukankah aku Tuhanmu?' Orang itu akan menjawab: 'Ya'. Lalu syaitan akan mencipta bentuk ayah dan saudara yang hampir sama seperti mereka. Kemudian, Rasulullah SAW keluar untuk urusan tertentu dan kembali. Orang ramai dalam keadaan bimbang dan berduka dengan apa yang Rasulullah SAW ceritakan. Lalu Baginda memegang kedua-dua daun pintu dan bertanya: 'Adakah Ummu Asma?'. Aku berkata: 'Ya Rasulullah, sungguh baginda telah mencabut jiwa kami dengan membicarakan Dajjal'. Baginda menjawab: 'Jika dia muncul ketika aku masih hidup, aku akan menjadi penentanginya dan jika aku meninggal, Allah SWT akan menjadi penolong bagi setiap orang yang beriman'. Aku berkata: 'Ya Rasulullah, sesungguhnya kami masih belum menguli tepung dan belum membakar roti sehingga kami lapar. Apakah pula yang akan dialami oleh orang beriman pada hari itu?'. Baginda menjawab: 'Cukuplah bagi mereka seperti mana yang cukup bagi ahli langit iaitu dengan memperbanyakkan zikir dan tasbih'.",
        "arabic_text": "وَعَن أسماءَ بنتِ يزيدَ قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِي فَذَكَرَ الدَّجَّالَ فَقَالَ: إِنَّ بَيْنَ يَدَيْهِ ثَلَاث سِنِين سنة تمسلك السَّمَاءُ فِيهَا ثُلُثَ قَطْرِهَا وَالْأَرْضُ ثُلُثَ نَبَاتِهَا. وَالثَّانِيَةُ تُمْسِكُ السَّمَاءُ ثُلُثَيْ قَطْرِهَا وَالْأَرْضُ ثُلُثَيْ نَبَاتِهَا. وَالثَّالِثَةُ تُمْسِكُ السَّمَاءُ قَطْرَهَا كُلَّهُ وَالْأَرْضُ نَبَاتَهَا كُلَّهُ. فَلَا يَبْقَى ذَاتُ ظِلْفٍ وَلَا ذَاتُ ضِرْسٍ مِنَ الْبَهَائِمِ إِلَّا هَلَكَ وَإِنَّ مِنْ أَشَدِّ فِتْنَتِهِ أَنَّهُ يَأْتِي الْأَعْرَابِيَّ فَيَقُولُ: أَرَأَيْتَ إِنْ أَحْيَيْتُ لَكَ إِبِلَكَ أَلَسْتَ تَعْلَمُ أَنِّي رَبُّكَ؟ فَيَقُولُ بَلَى فَيُمَثِّلُ لَهُ الشَّيْطَانَ نَحْوَ إِبِلِهِ كَأَحْسَنِ مَا يَكُونُ ضُرُوعًا وَأَعْظَمِهِ أَسْنِمَةً . قَالَ: وَيَأْتِي الرَّجُلَ قَدْ مَاتَ أَخُوهُ وَمَاتَ أَبُوهُ فَيَقُولُ: أَرَأَيْتَ إِنْ أَحْيَيْتُ لَكَ أَبَاكَ وَأَخَاكَ أَلَسْتَ تَعْلَمُ أَنِّي رَبُّكَ؟ فَيَقُولُ: بَلَى فَيُمَثِّلُ لَهُ الشَّيَاطِينَ نَحْوَ أَبِيهِ وَنَحْوَ أَخِيهِ . قَالَتْ: ثُمَّ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِحَاجَتِهِ ثُمَّ رَجَعَ وَالْقَوْمُ فِي اهْتِمَامٍ وَغَمٍّ مِمَّا حَدَّثَهُمْ. قَالَتْ: فَأَخَذَ بِلَحْمَتَيِ الْبَابِ فَقَالَ: «مَهْيَمْ أَسْمَاءُ؟» قُلْتُ: يَا رَسُولَ اللَّهِ لَقَدْ خَلَعْتَ أَفْئِدَتَنَا بِذِكْرِ الدَّجَّالِ. قَالَ: «إِنْ يَخْرُجْ وَأَنَا حَيٌّ فَأَنَا حَجِيجُهُ وَإِلَّا فإِنَّ رَبِّي خليفتي علىكل مُؤْمِنٍ» فَقُلْتُ: يَا رَسُولَ اللَّهِ وَاللَّهِ إِنَّا لَنَعْجِنُ عَجِينَنَا فَمَا نَخْبِزُهُ حَتَّى نَجُوعَ فَكَيْفَ بِالْمُؤْمِنِينَ يَوْمَئِذٍ؟ قَالَ: «يُجْزِئُهُمْ مَا يُجْزِئُ أَهْلَ السماءِ من التسبيحِ والتقديسِ» . رَوَاهُ أَحْمد"
      },
      {
        "id": 34186,
        "hadith_number": "5492",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penjelasan Rasulullah SAW Tentang Dajjal Dan Kejadiannya",
        "perawi_melayu": "Mughirah bin Syu'bah",
        "english_text": "Daripada Mughirah bin Syu'bah, dia berkata: Tidak ada seorang pun yang bertanya kepada Rasulullah SAW tentang Dajjal lebih banyak daripada yang saya tanyakan kepadanya. Dan beliau berkata kepadaku: \"Apa yang menyusahkanmu?\" Aku berkata: \"Mereka berkata: Sesungguhnya dia (Dajjal) membawa gunung roti dan sungai air.\"  Beliau bersabda: \"Lebih mudah bagi Allah daripada itu.\"",
        "malay_translation": "Dari Mughirah bin Syu'bah, beliau berkata, \"Tidak ada seorang pun yang bertanya kepada Rasulullah SAW tentang Dajjal lebih banyak daripada apa yang saya tanyakan. Beliau bertanya kepadaku, 'Apakah yang mengganggu engkau?' Aku menjawab, 'Mereka mengatakan, dia membawa gunung roti dan sungai air.'  Baginda SAW menjawab, 'Hal itu lebih mudah bagi Allah daripada itu.'",
        "arabic_text": "عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ: مَا سَأَلَ أَحَدٌ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَن الدجالِ أكثرَ مِمَّا سَأَلْتُهُ وَإِنَّهُ قَالَ لِي: «مَا يَضُرُّكَ؟» قُلْتُ: إِنَّهُمْ يَقُولُونَ: إِنَّ مَعَهُ جَبَلَ خُبْزٍ وَنَهَرَ مَاءٍ. قَالَ: هُوَ أَهْوَنُ عَلَى اللَّهِ من ذَلِك . مُتَّفق عَلَيْهِ"
      },
      {
        "id": 34187,
        "hadith_number": "5493",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kemunculan Dajjal dengan Keldai yang Luas Antara Dua Telinganya",
        "perawi_melayu": "Diriwayatkan dari Abu Hurairah RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah RA, daripada Nabi SAW bersabda: “Dajjal akan keluar menunggang seekor keldai kelabu, jarak antara dua telinganya adalah tujuh puluh hasta.” Riwayat al-Baihaqi dalam Kitab al-Ba'th wa al-Nusyur.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَخْرُجُ الدَّجَّالُ عَلَى حِمَارٍ أَقْمَرَ مَا بَيْنَ أُذُنَيْهِ سَبْعُونَ بَاعًا» . رَوَاهُ الْبَيْهَقِيُّ فِي «كِتَابِ الْبَعْثِ وَالنُّشُورِ»"
      },
      {
        "id": 34188,
        "hadith_number": "5494",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Peristiwa Ibn al-Sayyad dan Nasihat Rasulullah SAW",
        "perawi_melayu": "Abdullah bin Umar",
        "english_text": "Not Available",
        "malay_translation": "Dikisahkan oleh Abdullah bin Umar bahawa Umar bin al-Khattab berangkat bersama Rasulullah SAW dan beberapa sahabatnya menuju ke Ibn al-Sayyad. Mereka mendapati Ibn al-Sayyad sedang bermain dengan kanak-kanak di kawasan Bani Magala. Ibn al-Sayyad sudah hampir dewasa pada masa itu.  Rasulullah SAW memukul punggungnya dengan tangan baginda. Kemudian bertanya, \"Engkau mengakui bahawa aku adalah utusan Allah?\" Jawab Ibn al-Sayyad, \"Aku mengakui bahawa engkau adalah utusan Allah kepada umat ummi.\" Kemudian Ibn al-Sayyad bertanya, \"Engkau mengakui bahawa aku adalah utusan Allah?\" Rasulullah SAW menolaknya.  Lalu baginda bersabda, \"Aku beriman kepada Allah dan Rasul-rasul-Nya.\"  Kemudian Rasulullah SAW bertanya kepadanya, \"Apakah pendapatmu?\" Jawab Ibn al-Sayyad, \"Yang benar dan yang palsu datang kepadaku.\"  Rasulullah SAW bersabda, \"Perkara itu telah membingungkanmu.\"  Rasulullah SAW berkata, \"Aku mempunyai sesuatu rahsia untukmu.\" Lalu baginda membisikkannya, \"Suatu hari langit akan datang dengan asap yang jelas.\" Ibn al-Sayyad bertanya, \"Apakah ia asap?\" Rasulullah SAW menjawab, \"Ketahuilah, engkau tidak akan melampaui batasmu.\"  Umar bin al-Khattab berkata, \"Wahai Rasulullah, bolehkah saya membunuhnya?\" Jawab Rasulullah SAW, \"Jika ia adalah kebenaran, jangan lakukan itu. Jika ia adalah kepalsuan, membunuh dia juga tidak baik bagimu.\" Kemudian Abdullah bin Umar berkata,  Rasulullah SAW dan Abu bin Ka'ab berangkat menuju pohon-pohon kurma tempat Ibn al-Sayyad berada. Rasulullah SAW bersembunyi di balik batang pokok-pokok kurma. Ibu Ibn al-Sayyad melihat Rasulullah SAW bersembunyi dan berkata, \"Wahai Saaf (nama samarannya), itu Muhammad.\" Ibn al-Sayyad  kelihatan terganggu. Rasulullah SAW bersabda, \"Sekiranya kamu biarkan dia tenang.\" Abdullah bin Umar berkata, Rasulullah SAW berdiri di hadapan orang ramai dan memuji Allah SWT. Kemudian Baginda menyebutkan tentang al-Dajjal dan memberi amaran kepada mereka. Rasulullah SAW bersabda, \"Sesungguhnya aku memberi amaran kepadamu tentangnya. Tidak ada nabi yang tidak memberi amaran kepada kaumnya. Nuh memberi amaran kepada kaumnya. Tetapi aku akan menyampaikan sesuatu yang belum pernah dikatakan oleh nabi kepada kaumnya. Ketahuilah bahawa dia buta sebelah mata, dan Allah tidak buta sebelah mata.\"  Hadis ini diriwayatkan oleh Imam Bukhari dan Muslim.",
        "arabic_text": "عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ عُمَرَ بن الْخطاب انْطَلَقَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَهْطٍ مِنْ أَصْحَابِهِ قِبَلَ ابْنِ الصياد حَتَّى وجدوهُ يلعبُ مَعَ الصّبيانِ فِي أُطُمِ بَنِي مَغَالَةَ وَقَدْ قَارَبَ ابْنُ صَيَّادٍ يَوْمَئِذٍ الْحُلُمَ فَلَمْ يَشْعُرْ حَتَّى ضَرَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ظَهْرَهُ بِيَدِهِ ثمَّ قَالَ: «أتشهدُ أَنِّي رسولُ الله؟» فَقَالَ: أَشْهَدُ أَنَّكَ رَسُولُ الْأُمِّيِّينَ. ثُمَّ قَالَ ابْنُ صَيَّادٍ: أَتَشْهَدُ أَنِّي رَسُولُ اللَّهِ؟ فَرَصَّهُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ: «آمَنت بِاللَّه وبرسلِه» ثمَّ قَالَ لِابْنِ صيَّاد: «مَاذَا تَرَى؟» قَالَ: يَأْتِينِي صَادِقٌ وَكَاذِبٌ. قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «خُلِّطَ عَلَيْكَ الْأَمْرُ» . قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنِّي خَبَّأْتُ لَكَ خَبِيئًا» وَخَبَّأَ لَه: (يومَ تَأتي السَّماءُ بدُخانٍ مُبينٍ) فَقَالَ: هُوَ الدُّخُّ. فَقَالَ: «اخْسَأْ فَلَنْ تَعْدُوَ قَدْرَكَ» . قَالَ عُمَرُ: يَا رَسُولَ اللَّهِ أَتَأْذَنُ لي فِي أَنْ أَضْرِبَ عُنُقَهُ؟ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنْ يَكُنْ هُوَ لَا تُسَلَّطْ عَلَيْهِ وَإِنْ لَمْ يَكُنْ هُوَ فَلَا خير لَك فِي قَتْلِهِ» . قَالَ ابْنُ عُمَرَ: انْطَلَقَ بَعْدَ ذَلِكَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بْنُ كَعْبٍ الْأَنْصَارِيُّ يَؤُمَّانِ النَّخْلَ الَّتِي فِيهَا ابْنُ صَيَّادٍ فَطَفِقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَّقِي بِجُذُوعِ النَّخْلِ وَهُوَ يَخْتِلُ أنْ يسمعَ مِنِ ابْنِ صَيَّادٍ شَيْئًا قَبْلَ أَنْ يَرَاهُ وَابْنُ صَيَّادٍ مُضْطَجِعٌ عَلَى فِرَاشِهِ فِي قَطِيفَةٍ لَهُ فِيهَا زَمْزَمَةٌ فَرَأَتْ أُمُّ ابْنِ صَيَّادٍ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَتَّقِي بِجُذُوعِ النَّخْلِ. فَقَالَتْ: أَيْ صَافُ - وَهُوَ اسْمُهُ - هَذَا مُحَمَّدٌ. فَتَنَاهَى ابْنُ صَيَّادٍ. قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَوْ تَرَكَتْهُ بَيَّنَ» . قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ: قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي النَّاسَ فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ ذَكَرَ الدَّجَّالَ فَقَالَ: «إِنِّي أُنْذِرُكُمُوهُ وَمَا مِنْ نَبِيٍّ إِلَّا وَقَدْ أَنْذَرَ قَوْمَهُ لَقَدْ أَنْذَرَ نُوحٌ قَوْمَهُ وَلَكِنِّي سَأَقُولُ لَكُمْ فِيهِ قَوْلًا لَمْ يَقُلْهُ نَبِيٌّ لِقَوْمِهِ تَعْلَمُونَ أَنَّهُ أَعْوَرُ وَأَنَّ اللَّهَ لَيْسَ بِأَعْوَرَ» . مُتَّفَقٌ عَلَيْهِ"
      },
      {
        "id": 34189,
        "hadith_number": "5495",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Peristiwa Rasulullah SAW dengan Seorang yang Meragukan Kenabiannya",
        "perawi_melayu": "Abu Said al-Khudri",
        "english_text": "Hadis ini tidak ada dalam input.",
        "malay_translation": "Daripada Abu Sa'id al-Khudri RA, beliau berkata: Rasulullah SAW bertemu dengan Abu Bakar dan Umar - iaitu Ibnu Saiyad - di salah satu jalan Madinah. Lalu Rasulullah SAW bertanya kepadanya, \"Apakah engkau bersaksi bahawa aku adalah Utusan Allah?\" Dia menjawab, \"Apakah engkau bersaksi bahawa aku adalah Utusan Allah?\" Rasulullah SAW berkata, \"Aku beriman kepada Allah, malaikat-Nya, kitab-kitab-Nya, dan rasul-rasul-Nya. Apa yang engkau lihat?\" Dia menjawab, \"Aku melihat takhta di atas air.\" Rasulullah SAW berkata, \"Apakah engkau melihat takhta Iblis di laut dan apa yang engkau lihat lagi?\" Dia menjawab, \"Aku melihat dua orang yang jujur dan seorang atau dua orang pendusta.\" Rasulullah SAW bersabda, \"Dia telah ditipu, maka biarkanlah dia.\" Diriwayatkan oleh Muslim.",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: لَقِيَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرٍ وَعُمَرُ - يَعْنِي ابْنَ صَيَّادٍ - فِي بَعْضِ طُرُقِ الْمَدِينَةِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَتَشْهَدُ أَنِّي رَسُولُ اللَّهِ؟» فَقَالَ هُوَ: أَتَشْهَدُ أَنِّي رَسُولَ اللَّهِ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «آمَنْتُ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ مَاذَا تَرَى؟» قَالَ: أَرَى عَرْشًا عَلَى الْمَاءُ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَرَى عَرْشَ إِبْلِيسَ عَلَى الْبَحْرِ وَمَا تَرَى؟» قَالَ: أَرَى صَادِقَيْنِ وَكَاذِبًا أَوْ كَاذِبَيْنِ وَصَادِقًا. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لُبِسَ عَلَيْهِ فَدَعُوهُ» . رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 34190,
        "hadith_number": "5496",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perihal Tanah Syurga di Mekah",
        "perawi_melayu": null,
        "english_text": "Daripadanya, bahawa Ibnu Sayyad bertanya kepada Nabi SAW tentang tanah Syurga. Baginda bersabda, \"Di Mekah, ia berwarna putih dan berbau wangi murni musk.\"",
        "malay_translation": "Daripadanya, bahawa Ibnu Sayyad bertanya kepada Nabi SAW tentang tanah Syurga. Baginda menjawab, \"Di Mekah, ia berwarna putih dan berbau wangi murni musk.\"  (Riwayat Muslim)",
        "arabic_text": "وَعَنْهُ أَنَّ ابْنَ صَيَّادٍ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ تُرْبَةِ الْجَنَّةِ. فَقَالَ: «در مَكَّة يبضاء ومسك خَالص» . رَوَاهُ مُسلم"
      },
      {
        "id": 34191,
        "hadith_number": "5497",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penjelasan tentang Kemarahan dan Kesabaran",
        "perawi_melayu": "Naf'i",
        "english_text": "Narrated by Nafi' who said that Ibn Umar met Ibn Sayyad in one of the Medina roads, and spoke to him in a way that angered him, causing him to swell up, filling the road.  Ibn Umar entered Hafsah's house, and when the news reached her, she said to him: 'May Allah have mercy on you. What did you want from Ibn Sayyad? Did you not know that the Messenger of Allah (peace and blessings be upon him) said: \"Indeed, only anger is expelled by an anger it provokes\"?  Narrated by Muslim",
        "malay_translation": "Daripada Naf'i, yang menceritakan bahawa Ibn Umar bertemu dengan Ibn Sayyad di salah satu jalan di Madinah, dan berkata kepadanya dengan cara yang membuatnya marah, menyebabkan dia membengkak hingga memenuhi jalan tersebut. Ibn Umar masuk ke rumah Hafsah, dan ketika berita itu sampai kepadanya, dia berkata kepadanya: 'Semoga Allah merahmati engkau. Apa yang engkau inginkan daripada Ibn Sayyad? Tidakkah engkau tahu bahawa Rasulullah SAW bersabda: \"Sesungguhnya kemarahan hanya dapat dihilangkan dengan kemarahan yang menyertainya\"?. Diriwayatkan oleh Muslim",
        "arabic_text": "وَعَنْ نَافِعٍ قَالَ: لَقِيَ ابْنُ عُمَرَ ابْنَ صَيَّادٍ فِي بَعْضِ طُرُقِ الْمَدِينَةِ فَقَالَ لَهُ قَوْلًا أَغْضَبَهُ فَانْتَفَخَ حَتَّى مَلَأَ السِّكَّةَ. فَدَخَلَ ابْنُ عُمَرَ عَلَى حَفْصَةَ وَقَدْ بَلَغَهَا فَقَالَتْ لَهُ: رَحِمَكَ اللَّهُ مَا أَرَدْتَ مِنِ ابْنِ صياد؟ أما علمت أَن رَسُول اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّمَا يَخْرُجُ مِنْ غضبةٍ يغضبها» . رَوَاهُ مُسلم"
      },
      {
        "id": 34192,
        "hadith_number": "5498",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penjelasan Mengenai Dakwaan Dajjal dan Kemunculannya",
        "perawi_melayu": "Abu Said al-Khudri",
        "english_text": "From Abu Sa'id al-Khudri, he said, I accompanied Ibn Sa'id to Makkah. Ibn Sa'id said, 'What have I found among the people? They claim that I am the Dajjal. Didn't you hear the Messenger of Allah, peace and blessings be upon him, say, \"He will not be born\". And I was born, isn't it said, \"He is a disbeliever\"? And I am a Muslim, or didn't it say, \"He will not enter Madinah and Makkah\"? And I have come from Madinah, and I am seeking Makkah. Then he said to me at the end of his speech, \"By Allah, I know his birth, his place and where he is, and I know his father and mother.\" He became confused. I said to him, \"Shame on you today.\" He was asked, \"Do you wish that you are that person?\" He said, \"If it was offered to me, I would not refuse it.\" Muslim narrated it.",
        "malay_translation": "Daripada Abu Sa'id al-Khudri, beliau berkata, Saya menemani Ibn Sa'id ke Makkah. Ibn Sa'id berkata, 'Apakah yang saya dapati di kalangan manusia? Mereka mendakwa bahawa saya adalah Dajjal. Bukankah engkau mendengar Rasulullah SAW bersabda, \"Dia tidak akan dilahirkan\"? Dan aku dilahirkan, bukannya dikatakan, \"Dia adalah orang kafir\"? Dan aku adalah seorang Muslim, atau bukannya dikatakan, \"Dia tidak akan memasuki Madinah dan Makkah\"? Dan aku datang dari Madinah, dan aku mencari Makkah. Kemudian dia berkata kepadaku di akhir ucapannya, \"Demi Allah, aku mengetahui kelahirannya, tempatnya dan di mana dia berada, dan aku mengetahui bapanya dan ibunya.\" Dia menjadi keliru. Aku berkata kepadanya, \"Aib padamu hari ini.\" Dia ditanya, \"Adakah engkau menginginkan dirimu menjadi orang itu?\" Dia berkata, \"Sekiranya ditawarkan kepadaku, aku tidak akan menolaknya.\" Muslim meriwayatkannya.",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: صَحِبْتُ ابْنَ صياد إِلَى مَكَّة فَقَالَ: مَا لَقِيتُ مِنَ النَّاسِ؟ يَزْعُمُونَ أَنِّي الدَّجَّالُ أَلَسْتَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّهُ لَا يُولَدُ لَهُ» . وَقَدْ وُلِدَ لِي أَلَيْسَ قَدْ قَالَ: «هُوَ كَافِرٌ» . وَأَنا مُسلم أَو لَيْسَ قَدْ قَالَ: «لَا يَدْخُلُ الْمَدِينَةَ وَلَا مَكَّةَ» ؟ وَقَدْ أَقْبَلْتُ مِنَ الْمَدِينَةِ وَأَنَا أُرِيدُ مَكَّةَ. ثُمَّ قَالَ لِي فِي آخِرِ قَوْلِهِ: أَمَا وَاللَّهِ إِنِّي لَأَعْلَمُ مَوْلِدَهُ وَمَكَانَهُ وَأَيْنَ هُوَ وَأَعْرِفُ أَبَاهُ وَأُمَّهُ قَالَ: فَلَبَسَنِي قَالَ: قُلْتُ لَهُ: تَبًّا لَكَ سَائِرَ الْيَوْمِ. قَالَ: وَقِيلَ لَهُ: أَيَسُرُّكَ أَنَّكَ ذَاكَ الرَّجُلُ؟ قَالَ: فَقَالَ: لَوْ عُرِضَ عَلَيَّ مَا كَرِهْتُ. رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 34193,
        "hadith_number": "5499",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Teguran Terhadap Orang yang Tidak Mengetahui Asal Usul Sesuatu",
        "perawi_melayu": "Diriwayatkan daripada Ibnu Umar RA, beliau berkata: Aku bertemu dengannya dalam keadaan matanya terkejut, lalu aku bertanya: Bilakah matamu jadi seperti yang aku lihat ini? Dia menjawab: Aku tidak tahu. Aku berkata: Kamu tidak tahu sedangkan ia berada di kepalamu? Dia berkata: Jika Allah menghendaki, Dia menciptakannya di tongkatmu. Kemudian dia mendengus dengan dengusan yang paling kuat yang pernah aku dengar seperti dengusan keldai. (Riwayat Muslim)",
        "english_text": "Not Available",
        "malay_translation": "Diriwayatkan daripada Ibnu Umar RA, beliau berkata: Aku bertemu dengannya dalam keadaan matanya terkejut, lalu aku bertanya: Bilakah matamu jadi seperti yang aku lihat ini? Dia menjawab: Aku tidak tahu. Aku berkata: Kamu tidak tahu sedangkan ia berada di kepalamu? Dia berkata: Jika Allah menghendaki, Dia menciptakannya di tongkatmu. Kemudian dia mendengus dengan dengusan yang paling kuat yang pernah aku dengar seperti dengusan keldai. (Riwayat Muslim)",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: لَقِيتُهُ وَقَدْ نَفَرَتْ عَيْنُهُ فَقُلْتُ: مَتَى فَعَلَتْ عَيْنُكَ مَا أَرَى؟ قَالَ: لَا أَدْرِي. قُلْتُ: لَا تَدْرِي وَهِيَ فِي رَأْسِكَ؟ قَالَ: إِنْ شَاءَ اللَّهُ خَلَقَهَا فِي عَصَاكَ. قَالَ: فَنَخَرَ كأشد نخير حمَار سَمِعت. رَوَاهُ مُسلم"
      },
      {
        "id": 34194,
        "hadith_number": "5500",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Jabir bin Abdillah Mengisytiharkan Ibnu Al-Sa'yad sebagai Dajjal - Kepastian Nabi SAW",
        "perawi_melayu": "Muhammad bin Al-Munkadir",
        "english_text": "Daripada Muhammad bin Al-Munkadir, katanya: \"Aku melihat Jabir bin Abdullah bersumpah dengan Allah bahawa Ibnu Al-Sa'yad adalah Dajjal. Aku bertanya: \"Engkau bersumpah dengan Allah?\" Katanya: \"Sesungguhnya aku mendengar Umar bersumpah demikian di sisi Nabi SAW. Nabi SAW tidak menafikannya.\"",
        "malay_translation": "Daripada Muhammad bin Al-Munkadir, katanya, \"Saya melihat Jabir bin Abdullah bersumpah dengan Allah bahawa Ibnu Al-Sa'yad adalah seorang Dajjal. Saya bertanya, 'Engkau bersumpah dengan Allah?'. Dia menjawab, 'Sesungguhnya saya mendengar Umar bersumpah demikian di sisi Rasulullah SAW. Baginda tidak menafikannya.'  Ini merupakan sebuah hadis yang disepakati oleh Imam Bukhari dan Muslim.",
        "arabic_text": "وَعَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ قَالَ: رَأَيْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَحْلِفُ بِاللَّهِ أَنَّ ابْنَ الصَّيَّادِ الدَّجَّالُ. قُلْتُ: تَحْلِفُ بِاللَّهِ؟ قَالَ: إِنِّي سَمِعْتُ عُمَرَ يَحْلِفُ عَلَى ذَلِكَ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يُنْكِرْهُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. مُتَّفَقٌ عَلَيْهِ"
      },
      {
        "id": 34195,
        "hadith_number": "5501",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perihal Kehadiran Al-Masih Ad-Dajjal yang Disebutkan oleh Ibnu Umar",
        "perawi_melayu": "Nafie",
        "english_text": "Daripada Nafie, dia berkata: Sesungguhnya Ibnu Umar berkata: Demi Allah, aku tidak ragu bahawa Al-Masih Ad-Dajjal adalah anak si penjual.",
        "malay_translation": "Daripada Nafie, beliau berkata: Sesungguhnya Ibnu Umar berkata: Demi Allah, aku tidak ragu bahawa Al-Masih Ad-Dajjal adalah anak si penjual. Hadis ini diriwayatkan oleh Imam Abu Daud dan al-Baihaqi dalam kitabnya, \"Kitab al-Ba'ts wal-Nasyur.\"",
        "arabic_text": "عَنْ نَافِعٍ قَالَ: كَانَ ابْنُ عُمَرَ يَقُولُ: وَاللَّهِ مَا أَشُكُّ أَنَّ الْمَسِيحَ الدَّجَّالَ ابْنُ صيَّادٍ. رَوَاهُ أَبُو دَاوُدَ وَالْبَيْهَقِيُّ فِي «كِتَابِ الْبَعْثِ والنشور»"
      },
      {
        "id": 34196,
        "hadith_number": "5502",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kehilangan Ibn Sayyad di Hari Harrah",
        "perawi_melayu": "Jabir bin Abdillah radhiallahu 'anhu",
        "english_text": "Daripada Jabir radhiallahu 'anhu, beliau berkata, \"Sesungguhnya kami telah kehilangan Ibn Sayyad pada hari Harrah.\"",
        "malay_translation": "Daripada Jabir radhiallahu 'anhu, baginda berkata, \"Sesungguhnya kami telah kehilangan Ibn Sayyad pada hari Harrah.\" Diriwayatkan oleh Abu Daud.",
        "arabic_text": "وَعَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَدْ فَقَدْنَا ابْنَ صَيَّادٍ يَوْمَ الْحَرَّةِ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 34197,
        "hadith_number": "5503",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perihal  Datangnya Dajjal dan Ciri-cirinya",
        "perawi_melayu": "Abu Bakrah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Bakrah, katanya: Rasulullah SAW bersabda: \"Abu Dajjal akan tinggal selama tiga puluh tahun tanpa lahirnya anak, kemudian lahirlah seorang anak lelaki yang buta sebelah mata, bergigit, dan paling sedikit manfaatnya. Matanya tidur, tetapi hatinya tidak tidur.\". Kemudian Rasulullah SAW menerangkan rupa ibu bapanya. Baginda bersabda: \"Ayahnya tinggi lampai, seperti tubuh daging, seakan-akan hidungnya seperti paruh burung. Ibunya seorang wanita berwajah kasar dan berlengan panjang.\". Abu Bakrah berkata: \"Kami mendengar tentang kelahiran seorang anak lelaki di kalangan kaum Yahudi. Maka aku dan Zubair bin al-Awwam pergi menemui ibu bapanya. Rupanya, ciri-ciri anak itu seperti yang diterangkan Rasulullah SAW. Kami bertanya, \"Adakah kamu mempunyai anak?\" Mereka menjawab, \"Kami tinggal selama tiga puluh tahun tanpa anak, kemudian lahirlah seorang anak lelaki yang buta sebelah mata, bergigit, dan paling sedikit manfaatnya. Matanya tidur, tetapi hatinya tidak tidur.\". Kami keluar dari rumah mereka, dan kami melihatnya sedang terlentang di bawah matahari di dalam kain, dan ada suara yang menggema darinya.  Kemudian dia membuka kepalanya, dan berkata, \"Apa yang kamu katakan? Dan adakah kamu mendengar apa yang aku katakan?\"  Katanya: \"Ya, mataku tidur, tetapi hatiku tidak tidur.\". Riwayat Imam Tirmizi.",
        "arabic_text": "وَعَنْ أَبِي بَكْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «يمْكث أَبُو الدَّجَّالِ ثَلَاثِينَ عَامًا لَا يُولَدُ لَهُمَا وَلَدٌ ثُمَّ يُولَدُ لَهُمَا غُلَامٌ أَعْوَرُ أَضْرَسُ وَأَقَلُّهُ مَنْفَعَةً تَنَامُ عَيْنَاهُ وَلَا يَنَامُ قَلْبُهُ» . ثُمَّ نَعَتَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبَوَيْهِ فَقَالَ: «أَبُوهُ طُوَالٌ ضَرْبُ اللَّحْمِ كَأَنَّ أَنْفَهُ مِنْقَارٌ وَأُمُّهُ امْرَأَةٌ فِرْضَاخِيَّةٌ طَوِيلَةُ الْيَدَيْنِ» . فَقَالَ أَبُو بَكْرَةَ: فَسَمِعْنَا بِمَوْلُودٍ فِي الْيَهُود. فَذَهَبْتُ أَنَا وَالزُّبَيْرُ بْنُ الْعَوَّامِ حَتَّى دَخَلْنَا عَلَى أَبَوَيْهِ فَإِذَا نَعْتُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهِمَا فَقُلْنَا هَلْ لَكُمَا وَلَدٌ؟ فَقَالَا: مَكَثْنَا ثَلَاثِينَ عَامًا لَا يُولَدُ لَنَا وَلَدٌ ثُمَّ وُلِدَ لَنَا غُلَامٌ أَعْوَرُ أَضْرَسُ وَأَقَلُّهُ مَنْفَعَةً تَنَامُ عَيْنَاهُ وَلَا يَنَامُ قَلْبُهُ قَالَ فَخَرَجْنَا مِنْ عِنْدِهِمَا فَإِذَا هُوَ مجندل فِي الشَّمْسِ فِي قَطِيفَةٍ وَلَهُ هَمْهَمَةٌ فَكَشَفَ عَن رَأسه فَقَالَ: مَا قلتما: وَهَلْ سَمِعْتَ مَا قُلْنَا؟ قَالَ: نَعَمْ تَنَامُ عَيْنَايَ وَلَا ينَام قلبِي رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 34198,
        "hadith_number": "5504",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kecemasan terhadap Kemunculan Dajjal dan Pertimbangan Rasulullah SAW terhadap Bayi yang Mengisyaratkan Dajjal",
        "perawi_melayu": "Jabir",
        "english_text": "From Jabir, that a woman from the Jews in Madinah gave birth to a boy with a blemish on his eye, a prominent tooth, and a fearful appearance. Rasulullah SAW felt concerned that the boy might be the Dajjal. He found the baby under a cloth, murmuring.  The mother called out, \"O Abdullah, this is Abu al-Qasim.\" The boy came out from under the cloth. Rasulullah SAW said, \"What ails her? May Allah punish her! If she had left him alone, it would have been clear. Then [Rasulullah SAW] mentioned something similar to the Hadith of Ibn Umar. Umar ibn al-Khattab said, \"Grant me permission, O Messenger of Allah, to kill him.\" Rasulullah SAW said, \"If he is [the Dajjal], then his companion is not with him. His companion is Isa bin Maryam. If he is not [the Dajjal], you should not kill a person from those with whom you have a pact.\" Rasulullah SAW continued to express concern that the boy might be the Dajjal. It was narrated in Sharh al-Sunnah, and this chapter is absent from the third section.",
        "malay_translation": "Daripada Jabir, bahawa seorang wanita Yahudi di Madinah melahirkan seorang anak lelaki yang mempunyai cacat pada matanya, gigi yang menonjol, dan penampilan yang menakutkan. Rasulullah SAW merasa bimbang bahawa kanak-kanak itu mungkin adalah Dajjal. Baginda mendapati bayi itu di bawah kain, sedang berbisik. Ibunya berseru, \"Wahai Abdullah, ini adalah Abu al-Qasim.\" Kanak-kanak itu keluar dari bawah kain. Rasulullah SAW bersabda, \"Apa yang salah dengannya? Semoga Allah menyeksa dia! Sekiranya dia membiarkannya, ia akan menjadi jelas. Kemudian [Rasulullah SAW] menyebut sesuatu yang serupa dengan hadis Ibn Umar. Umar al-Khattab berkata, \"Berilah kebenaran kepadaku, wahai Rasulullah, untuk membunuhnya.\" Rasulullah SAW bersabda, \"Jika dia [Dajjal], maka pendampingnya bukanlah bersamanya. Pendampingnya adalah Isa bin Maryam. Jika dia bukan [Dajjal], engkau tidak sepatutnya membunuh seseorang daripada kalangan mereka yang mempunyai perjanjian denganmu.\" Rasulullah SAW terus menyatakan kebimbangan bahawa kanak-kanak itu mungkin adalah Dajjal. Ia diriwayatkan dalam Sharh al-Sunnah, dan bab ini tidak terdapat dalam bahagian ketiga.",
        "arabic_text": "وَعَنْ جَابِرٍ أَنَّ امْرَأَةً مِنَ الْيَهُودِ بِالْمَدِينَةِ وَلَدَتْ غُلَامًا مَمْسُوحَةٌ عَيْنُهُ طَالِعَةٌ نَابُهُ فَأَشْفَقَ رَسُول الله صلى الله عَلَيْهِ وَسلم إِن يَكُونَ الدَّجَّالَ فَوَجَدَهُ تَحْتَ قَطِيفَةٍ يُهَمْهِمُ. فَآذَنَتْهُ أُمُّهُ فَقَالَتْ: يَا عَبْدَ اللَّهِ هَذَا أَبُو الْقَاسِمِ فَخَرَجَ مِنَ الْقَطِيفَةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَا لَهَا قَاتَلَهَا اللَّهُ؟ لَوْ تَرَكَتْهُ لَبَيَّنَ فَذَكَرَ مِثْلَ مَعْنَى حَدِيثِ ابْنِ عُمَرَ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ ائْذَنْ لِي يَا رَسُولَ اللَّهِ فَأَقْتُلَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِن يكن هُوَ فَلَيْسَتْ صَاحِبَهُ إِنَّمَا صَاحِبُهُ عِيسَى بْنُ مَرْيَمَ وَإِلَّا يكن هُوَ فَلَيْسَ لَك أتقتل رَجُلًا مِنْ أَهْلِ الْعَهْدِ» . فَلَمْ يَزَلْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُشْفِقًا أَنَّهُ هُوَ الدَّجَّال. رَوَاهُ فِي شرح السّنة وَهَذَا الْبَابُ خَالٍ عَنِ الْفَصْلِ الثَّالِثِ"
      },
      {
        "id": 34199,
        "hadith_number": "5505",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ketibaan Isa bin Maryam sebagai Hakim yang Adil dan Pembasmian Sesuatu Amalan",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Narrated by Abu Hurairah. The Messenger of Allah (ﷺ) said: \"By the One in Whose Hand is my soul, soon Isa bin Maryam will descend among you as a just judge. He will break the cross, kill the pig, and abolish the jizyah. Wealth will be abundant until no one will accept it.  The single prostration will be better than the world and all that is in it.\" Then Abu Hurairah would say: \"If you wish, read the verse (and there is none of the People of the Book but will believe in him before his death).\" Agreed upon by the scholars.",
        "malay_translation": "Dikisahkan oleh Abu Hurairah. Rasulullah SAW bersabda: \"Demi Yang jiwaku berada di tangan-Nya, tidak lama lagi Isa bin Maryam akan turun di tengah kamu sebagai seorang hakim yang adil. Baginda akan memecahkan salib, membunuh babi, dan menghapuskan jizyah. Harta kekayaan akan melimpah ruah sehingga tiada seorang pun akan menerimanya. Satu sujud (sembahyang) akan lebih baik daripada dunia dan segala isinya.\" Kemudian Abu Hurairah berkata, \"Jika kamu mahu, bacalah ayat ini (dan tiada seorang pun dari Ahli Kitab melainkan akan beriman kepadanya sebelum kematiannya).\" Disepakati oleh para ulama.",
        "arabic_text": "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَالَّذِي نَفْسِي بِيَدِهِ ليوشكَنَّ أَن ينزلَ فِيكُم ابنُ مَرْيَم حكَمَاً عَدْلًا فَيَكْسِرُ الصَّلِيبَ وَيَقْتُلُ الْخِنْزِيرَ وَيَضَعُ الْجِزْيَةَ وَيَفِيضُ الْمَالُ حَتَّى لَا يَقْبَلَهُ أَحَدٌ حَتَّى تكون السَّجْدَة الْوَاحِدَة خيرامن الدُّنْيَا وَمَا فِيهَا» . ثُمَّ يَقُولُ أَبُو هُرَيْرَةَ: فاقرؤا إِن شئْتم [وإِنْ من أهل الْكتاب إِلاّ ليُؤْمِنن بِهِ قبل مَوته] الْآيَة. مُتَّفق عَلَيْهِ"
      },
      {
        "id": 34200,
        "hadith_number": "5506",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kedatangan Nabi Isa AS sebagai Hakim Adil dan Perubahan yang Akan Dialaminya",
        "perawi_melayu": null,
        "english_text": "Not Available",
        "malay_translation": "Dan daripada beliau (perawi), beliau berkata: Rasulullah SAW bersabda, \"Demi Allah, sesungguhnya anak Maryam akan turun sebagai hakim yang adil. Dia akan memecahkan salib, membunuh babi, menghapuskan jizyah, dan menghapuskan amalan qilas (siksa), dan tiada lagi (perbuatan) yang akan dilakukan terhadapnya. Permusuhan dan hasad dengki akan dihapuskan. Mereka akan menyeru kepada harta, tetapi tiada seorang pun akan menerimanya.\". Diriwayatkan oleh Muslim. Dalam riwayat lain dari mereka berdua, beliau berkata: \"Bagaimana keadaan kamu sekalian jika anak Maryam turun di tengah-tengah kamu dan imam kamu dari kalangan kamu?\".",
        "arabic_text": "وَعنهُ قا ل: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَاللَّهِ لَيَنْزِلَنَّ ابْنُ مَرْيَمَ حَكَمًا عَادِلًا فَلَيَكْسِرَنَّ الصَّلِيبَ وَلَيَقْتُلَنَّ الْخِنْزِيرَ وَلَيَضَعَنَّ الْجِزْيَةَ وَلَيَتْرُكَنَّ الْقِلَاصَ فَلَا يسْعَى عَلَيْهَا ولتذهبن الشحناء وَالتَّحَاسُدُ وَلَيَدْعُوَنَّ إِلَى الْمَالِ فَلَا يَقْبَلُهُ أَحَدٌ» . رَوَاهُ مُسْلِمٌ. وَفِي رِوَايَةٍ لَهُمَا قَالَ: «كَيْفَ أَنْتُمْ إِذَا نَزَلَ ابْنُ مَرْيَمَ فِيكُمْ وَإِمَامُكُمْ مِنْكُم»"
      },
      {
        "id": 34201,
        "hadith_number": "5507",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Sentiasa Terdapat Golongan Daripada Umatku Yang Berjuang Di Jalan Kebenaran Hingga Hari Kiamat",
        "perawi_melayu": "Jabir",
        "english_text": "And from Jabir, he said: The Messenger of Allah (peace and blessings be upon him) said: \"A group from my Ummah will continue to fight for the truth, manifest, until the Day of Resurrection.\" He said: Then Isa bin Maryam will descend, and their leader will say: \"Come, pray for us.\" He will say: \"No, indeed, some of you are leaders over others, by Allah's grace, for this Ummah.\"",
        "malay_translation": "Dan daripada Jabir, dia berkata: Rasulullah SAW bersabda: \"Sentiasa akan ada sekelompok daripada umatku yang berjuang di jalan kebenaran, yang nyata, hingga Hari Kiamat.\"  Katanya lagi: Kemudian Isa bin Maryam akan turun, dan pemimpin mereka akan berkata: \"Mari, selenggarakan solat untuk kami.\" Dia akan berkata: \"Tidak, sesungguhnya sebahagian daripada kamu menjadi pemimpin bagi sebahagian yang lain, dengan kurnia Allah, bagi umat ini.\"",
        "arabic_text": "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي يُقَاتِلُونَ عَلَى الْحَقِّ ظَاهِرِينَ إِلَى يَوْمِ الْقِيَامَة» . قا ل: فَينزل عِيسَى بن مَرْيَمَ فَيَقُولُ أَمِيرُهُمْ: تَعَالَ صَلِّ لَنَا فَيَقُولُ: لَا إِنَّ بَعْضَكُمْ عَلَى بَعْضٍ أُمَرَاءُ تَكْرِمَةَ الله هَذِه الْأمة . رَوَاهُ مُسْلِمٌ وَهَذَا الْبَابُ خَالٍ عَنِ الْفَصْلِ الثَّانِي"
      },
      {
        "id": 34202,
        "hadith_number": "5508",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kedatangan Nabi Isa bin Maryam ke Bumi dan Peristiwa Kematiannya",
        "perawi_melayu": "Abdullah bin 'Amru",
        "english_text": "Dari Abdullah bin 'Amru, dia berkata: Rasulullah SAW bersabda: \"Nabi Isa bin Maryam akan turun ke bumi, dia akan berkahwin dan mempunyai anak, dan dia akan hidup selama empat puluh tahun, kemudian dia akan mati dan dikebumikan bersamaku di kuburku. Oleh itu, aku dan Nabi Isa bin Maryam akan dikumpulkan dalam satu kubur di antara Abu Bakar dan Umar.\"",
        "malay_translation": "Daripada Abdullah bin 'Amru, beliau berkata: Rasulullah SAW bersabda, \"Nabi Isa bin Maryam akan turun ke bumi, berkahwin dan mempunyai anak, dan tinggal selama empat puluh tahun. Kemudian, dia akan mati dan dikebumikan bersamaku di kuburku. Aku dan Nabi Isa bin Maryam akan dikumpulkan dalam satu kubur di antara Abu Bakar dan Umar.\"",
        "arabic_text": "عَن عبد الله بن عَمْرو قا ل: قا ل رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَنْزِلُ عِيسَى بن مَرْيَمَ إِلَى الْأَرْضِ فَيَتَزَوَّجُ وَيُولَدُ لَهُ وَيَمْكُثُ خَمْسًا وَأَرْبَعِينَ سَنَةً ثُمَّ يَمُوتُ فَيُدْفَنُ مَعِي فِي قَبْرِي فأقوم أَنا وَعِيسَى بن مَرْيَمَ فِي قَبْرٍ وَاحِدٍ بَيْنَ أَبَى بَكْرٍ وَعُمَرَ» . رَوَاهُ ابْنُ الْجَوْزِيِّ فِي كِتَابِ الْوَفَاءِ"
      },
      {
        "id": 34203,
        "hadith_number": "5509",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pengutusan Nabi SAW dan Kiamat Seakan Dua Benda yang Berdampingan",
        "perawi_melayu": "Riwayat dari Syu'bah dari Qatadah dari Anas r.a.",
        "english_text": "Dari Syu'bah, dari Qatadah, dari Anas, dia berkata: Rasulullah SAW bersabda, \"Aku diutus dan Kiamat itu seperti dua benda ini.\" Syu'bah berkata: Dan aku mendengar Qatadah berkata dalam kisahnya, \"seperti dipisah satu sama lain, jadi aku tidak tahu, apakah dia (Qatadah) menukilkan dari Anas atau dia berkata sendiri?\"  Disepakati oleh Bukhari dan Muslim",
        "malay_translation": "Dari Syu'bah, dari Qatadah, dari Anas, beliau berkata: Rasulullah SAW bersabda, \"Sesungguhnya aku diutus dan hari kiamat itu seperti dua benda yang berdekatan.\" Syu'bah berkata, dan aku mendengar Qatadah berkata dalam kisahnya: \"seperti dua benda yang berdampingan, jadi aku tidak pasti sama ada dia (Qatadah) meriwayatkannya daripada Anas atau dia sendiri yang berkata demikian.\"\nDisepakati oleh Bukhari dan Muslim.",
        "arabic_text": "عَن شعبةَ عَن قَتَادَة عَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «بُعِثْتُ أَنَا وَالسَّاعَةُ كَهَاتَيْنِ» . قَالَ شُعْبَةُ: وَسَمِعْتُ قَتَادَةَ يَقُولُ فِي قَصَصِهِ كفصل إِحْدَاهُمَا عَلَى الْأُخْرَى فَلَا أَدْرِي أَذَكَرَهُ عَنْ أنس أَو قَالَه قَتَادَة؟ مُتَّفق عَلَيْهِ"
      },
      {
        "id": 34204,
        "hadith_number": "5510",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pengetahuan tentang Kiamat dan Jangka Hayat Manusia",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Jabir RA, beliau berkata: Aku mendengar Nabi SAW bersabda sebulan sebelum wafatnya: \"Kamu bertanya kepadaku tentang Kiamat? Sesungguhnya ilmunya hanya di sisi Allah. Dan aku bersumpah dengan nama Allah, tidak ada satu jiwa pun di muka bumi ini yang bernafas, yang akan mencapai seratus tahun dalam keadaan hidup pada hari itu.\" Riwayat Muslim.",
        "arabic_text": "وَعَن جَابر قا ل: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ قَبْلَ أَنْ يَمُوتَ بِشَهْرٍ: «تَسْأَلُونِي عَنِ السَّاعَةِ؟ وَإِنَّمَا عِلْمُهَا عِنْدَ اللَّهِ وَأُقْسِمُ بِاللَّهِ مَا عَلَى الْأَرْضِ مِنْ نَفْسٍ مَنْفُوسَةٍ يَأْتِي عَلَيْهَا مِائَةُ سَنَةٍ وَهِيَ حَيَّةٌ يَوْمَئِذٍ» . رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 34205,
        "hadith_number": "5511",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tidak Akan Datang Seratus Tahun Lagi di atas Bumi Ini yang  Jiwa-Jiwa Belum Dipertemukan",
        "perawi_melayu": "Abu Said Al-Khudri",
        "english_text": "And from Abu Sa'id, from the Prophet, sallallahu 'alayhi wa sallam, he said, \"One hundred years will not come and pass on the earth, and there is a soul that is not yet met.\"",
        "malay_translation": "Daripada Abu Sa'id al-Khudri, daripada Nabi SAW, baginda bersabda, \"Seratus tahun tidak akan berlalu di bumi ini, dan ada jiwa yang belum bertemu.\" ",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَأْتِي مِائَةُ سَنَةٍ وَعَلَى الْأَرْضِ نَفْسٌ مَنْفُوسَةٌ الْيَوْمَ» . رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 34206,
        "hadith_number": "5512",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penjelasan Mengenai Kedatangan Hari Kiamat",
        "perawi_melayu": "Aisyah رضي الله عنها",
        "english_text": "And from `Aishah she said: There were men from the Bedouins who would come to the Prophet صلى الله عليه وسلم and ask him about the Hour. He would look at the youngest among them and say: \"If this one lives, he will not reach old age until your Hour comes upon you.\". Agreed upon (by Bukhari and Muslim).",
        "malay_translation": "Dan daripada Aisyah رضي الله عنها, beliau berkata: Ada beberapa orang lelaki daripada kaum Badwi yang datang menemui Rasulullah صلى الله عليه وسلم dan bertanya tentang hari kiamat. Baginda akan memandang kepada yang paling muda di antara mereka dan bersabda: \"Jika orang ini hidup, dia tidak akan sampai tua sehingga hari kiamat menimpa kamu semua.\". Disepakati (oleh Imam Bukhari dan Imam Muslim).",
        "arabic_text": "وَعَنْ عَائِشَةَ قَالَتْ: كَانَ رِجَالٌ مِنَ الْأَعْرَابِ يَأْتُونَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَسْأَلُونَهُ عَنِ السَّاعَةِ فَكَانَ يَنْظُرُ إِلَى أصغرِهم فَيَقُول: «إِنْ يَعِشْ هَذَا لَا يُدْرِكْهُ الْهَرَمُ حَتَّى تَقُومَ عَلَيْكُمْ سَاعَتُكُمْ» . مُتَّفَقٌ عَلَيْهِ"
      },
      {
        "id": 34207,
        "hadith_number": "5513",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Diutus pada Nafas Akhir Zaman",
        "perawi_melayu": "Mustawrid bin Syaddad",
        "english_text": "Daripada Mustawrid bin Syaddad daripada Nabi SAW, baginda bersabda: \"Aku diutus pada nafas akhir zaman lalu aku mendahului/mencapai masa itu seperti yang ditunjukkan oleh jari telunjuk dan jari tengahku ini.\"",
        "malay_translation": "Daripada Mustawrid bin Syaddad daripada Rasulullah SAW, baginda bersabda: \"Aku diutuskan pada nafas akhir zaman dan aku mendahului (mencapai)nya sepertimana jari telunjuk dan jari tengahku ini. (menunjuk).",
        "arabic_text": "عَن الْمُسْتَوْرد بن شَدَّاد عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «بُعِثْتُ فِي نَفَسِ السَّاعَةِ فَسَبَقْتُهَا كَمَا سَبَقَتْ هذِه هذِه» وأشارَ بأصبعيهِ السبَّابةِ وَالْوُسْطَى. رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 34208,
        "hadith_number": "5514",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Semoga Umatku Tidak Akan Kalah di Hadapan Tuhan, Jika Ditangguhkan Sebahagian Hari",
        "perawi_melayu": "Said bin Abi Waqqas",
        "english_text": "And from Sa'd bin Abi Waqqas from the Prophet sallallahu alaihi wa sallam, he said, \"Truly, I hope that my ummah will not be unable before their Lord if their time is delayed by half a day.\" It was said to Sa'd: \"And how much is half a day?\" He said: \"Five hundred years.\" Narrated by Abu Dawud.",
        "malay_translation": "Dan daripada Said bin Abi Waqqas daripada Nabi SAW, baginda bersabda, \"Sesungguhnya aku berharap umatku tidak akan lemah di hadapan Tuhan mereka sekiranya waktu mereka ditangguhkan selama setengah hari.\" Dikatakan kepada Said, \"Berapa lamakah setengah hari itu?\" Jawabnya, \"Lima ratus tahun.\" Diriwayatkan oleh Abu Dawud.",
        "arabic_text": "وَعَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنِّي لَأَرْجُو أَنْ لَا تَعْجِزَ أُمَّتِي عِنْدَ رَبِّهَا أَنْ يُؤَخِّرَهُمْ نِصْفَ يَوْمٍ» . قِيلَ لِسَعْدٍ: وَكَمْ نِصْفُ يَوْمٍ؟ قَالَ: خَمْسُمِائَةِ سَنَةٍ. رَوَاهُ أَبُو دَاوُدَ"
      },
      {
        "id": 34209,
        "hadith_number": "5515",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perumpamaan Dunia yang Fana",
        "perawi_melayu": "Diriwayatkan daripada Anas RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Anas RA, beliau berkata: Rasulullah SAW bersabda: \"Perumpamaan dunia ini adalah seperti sehelai kain yang terkoyak dari awal hingga akhir, lalu tinggal tergantung pada seutas benang di hujungnya. Maka hampir-hampir benang itu akan putus.\"  Riwayat al-Baihaqi dalam Syu'ab al-Iman.",
        "arabic_text": "عَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَثَلُ هَذِهِ الدُّنْيَا مَثَلُ ثَوْبٍ شُقَّ مِنْ أَوَّلِهِ إِلَى آخِرِهِ فَبَقِيَ مُتَعَلِّقًا بِخَيْطٍ فِي آخِرِهِ فَيُوشِكُ ذَلِكَ الْخَيْطُ أَنْ يَنْقَطِعَ» . رَوَاهُ الْبَيْهَقِيُّ فِي «شُعَبِ الْإِيمَانِ»"
      },
      {
        "id": 34210,
        "hadith_number": "5516",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kiamat Tidak Akan Terjadi Sehingga Tidak Disebut Nama Allah di Bumi",
        "perawi_melayu": "Diriwayatkan daripada Anas RA bahawa Rasulullah SAW bersabda:",
        "english_text": "Not Available",
        "malay_translation": "\"Tidak akan terjadi Kiamat sehingga tidak diucapkan lagi di bumi: 'Allah, Allah.' Dalam riwayat lain: 'Tidak akan terjadi Kiamat kepada sesiapa yang menyebut: 'Allah, Allah.'\" (Riwayat Muslim)",
        "arabic_text": "عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَا تَقُومُ السَّاعَةُ حَتَّى لَا يُقَالَ فِي الْأَرْضِ: اللَّهُ اللَّهُ . وَفِي رِوَايَةٍ: لَا تَقُومُ السَّاعَةُ عَلَى أَحَدٍ يَقُولُ: اللَّهُ الله . رَوَاهُ مُسلم"
      },
      {
        "id": 34211,
        "hadith_number": "5517",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tidak Akan Datangnya Hari Kiamat Kecuali atas Orang-orang Jahat",
        "perawi_melayu": "Abdullah bin Mas'ud",
        "english_text": "And from Abdullah bin Mas'ud, he said: The Messenger of Allah, peace and blessings be upon him, said: \"The Hour will not come except upon the worst of creation.\"",
        "malay_translation": "Dan daripada Abdullah bin Mas'ud, beliau berkata: Rasulullah SAW bersabda: \"Hari Kiamat tidak akan datang melainkan atas seburuk-buruk makhluk.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَقُومُ السَّاعَةُ إِلَّا عَلَى شِرَارِ الْخَلْقِ» . رَوَاهُ مُسلم"
      },
      {
        "id": 34212,
        "hadith_number": "5518",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kegoncangan Wanita-Wanita Dzus dan Tanda-Tanda Kiamat",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "And from Abu Hurairah, he said: The Messenger of Allah, peace and blessings be upon him, said: \"The Hour will not come until the women of Daws are disturbed around Dhu'l-Khalasa.\"",
        "malay_translation": "Dan daripada Abu Hurairah, beliau berkata: Rasulullah SAW bersabda: \"Hari Kiamat tidak akan datang melainkan apabila wanita-wanita Daws terganggu di sekitar Dhu'l-Khalasa.\" Dan Dhu'l-Khalasa itu ialah tokoh zalim kaum Daws yang mereka sembah pada zaman Jahiliah. Riwayat sahih.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَقُومُ السَّاعَةُ حَتَّى تَضْطَرِبَ أَلَيَاتُ نِسَاءِ دَوْسٍ حَوْلَ ذِي الْخَلَصَةِ» . وَذُو الْخَلَصَةِ: طَاغِيَةُ دَوْسٍ الَّتِي كَانُوا يَعْبُدُونَ فِي الْجَاهِلِيَّةِ. مُتَّفَقٌ عَلَيْهِ"
      },
      {
        "id": 34213,
        "hadith_number": "5519",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kepercayaan Kepada Berhala dan Kembalinya Kepada Agama Asal",
        "perawi_melayu": "Aisyah",
        "english_text": "Not Available",
        "malay_translation": "Dan daripada Aisyah RA, dia berkata: \"Aku mendengar Rasulullah SAW bersabda: \"Tidaklah berlalunya malam dan siang sehingga disembah Lat dan Uzza.\" Aku berkata: \"Wahai Rasulullah, sesungguhnya aku menyangka, ketika Allah menurunkan ayat (Dia yang mengutus RasulNya dengan petunjuk dan agama yang benar supaya ia mengalahkan agama yang lain sekalipun orang-orang musyrik tidak suka), bahawa itu adalah sempurna. Baginda bersabda: \"Sesungguhnya akan berlaku daripada itu apa yang dikehendaki Allah, kemudian Allah mengutus angin yang harum, lalu ia akan menghembuskan setiap orang yang ada di dalam hatinya seberat biji sawi iman, dan akan tinggal orang yang tidak baik di dalamnya, dan mereka akan kembali kepada agama nenek moyang mereka.\"",
        "arabic_text": "وَعَنْ عَائِشَةَ قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا يَذْهَبُ اللَّيْلُ وَالنَّهَارُ حَتَّى يُعْبَدَ اللَّاتُ وَالْعُزَّى» . فَقُلْتُ: يَا رَسُولَ اللَّهِ إِنْ كُنْتُ لَأَظُنُّ حِينَ أَنْزَلَ اللَّهُ: (هُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدَى وَدِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَلَوْ كَرِهَ الْمُشْرِكُونَ) أَنَّ ذَلِكَ تَامًّا. قَالَ: «إِنَّهُ سَيَكُونُ مِنْ ذَلِكَ مَا شَاءَ اللَّهُ ثُمَّ يَبْعَثُ اللَّهُ رِيحًا طَيِّبَةً فَتُوُفِّيَ كُلُّ مَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنْ خَرْدَلٍ مِنْ إِيمَانٍ فَيَبْقَى مَنْ لَا خَيْرَ فِيهِ فَيَرْجِعُونَ إِلَى دِين آبَائِهِم» . رَوَاهُ مُسلم"
      },
      {
        "id": 34214,
        "hadith_number": "5520",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kiamat dan Kedatangan Dajjal: Penggambaran Kejadian Hari Kiamat",
        "perawi_melayu": "Abdullah bin Amr",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abdullah bin Amr, dia berkata: Rasulullah SAW bersabda, \"Dajjal akan muncul dan tinggal selama empat puluh (40). Aku tidak pasti sama ada empat puluh hari, atau bulan atau tahun. Kemudian Allah SWT akan mengutus Isa bin Maryam seakan-akan Urwah bin Mas'ud, lalu mengejar dan memusnahkannya. Kemudian, beliau berada di kalangan manusia selama tujuh tahun, dan tidak ada permusuhan di antara dua orang. Kemudian Allah SWT akan mengirimkan angin sejuk dari arah Syam (Syria). Maka tiada seorang pun di muka bumi ini yang memiliki kebaikan atau iman seberat zarah melainkan Allah SWT mengambilnya. Walaupun seseorang berada di dalam perut gunung, ia (kebaikan/iman) akan mencapainya sehingga Allah SWT mengambilnya.\n Beliau berkata, \"Kemudian akan tinggal orang-orang jahat seperti seekor burung yang ringan dan liar, tidak mengenali kebaikan dan tidak menentang kejahatan. Syaitan akan menjelma kepada mereka dan berkata, \"Tidakkah kamu mahu menurut?\" Mereka menjawab, \"Apa yang kau suruh kami lakukan?\" Syaitan kemudian menyuruh mereka menyembah berhala, dan rezeki mereka baik dan kehidupan mereka mewah.\n Kemudian, sangkakala ditiup, dan tidak ada seorang pun yang mendengarnya melainkan tunduk dan mengangkatnya. Beliau berkata, \"Orang pertama yang mendengarnya ialah seorang lelaki yang sedang meratakan air minuman untanya. Maka dia akan terduduk dan manusia akan jatuh pengsan.\n Kemudian, Allah SWT menurunkan hujan seperti hujan lebat, dan daripada hujan itu akan tumbuh tubuh manusia. Kemudian, sangkakala ditiup lagi, dan mereka berdiri tegak dan memerhatikan. Kemudian, dikatakan, \"Wahai manusia, marilah kepada Tuhan kamu, mereka akan dihadapkan, sesungguhnya mereka akan bertanggungjawab\". Kemudian dikatakan, \"Keluarkan askar neraka.\" Ditanya, \"Dari mana? Dari mana?\" Dijawab, \"Daripada setiap seribu orang, sembilan ratus sembilan puluh sembilan orang\". Beliau berkata, \"Inilah hari di mana anak-anak menjadi tua dan hari di mana kaki-kaki akan disingkap\". \n Diriwayatkan oleh Muslim, dan disebutkan hadis Mu'awiyah, \"Hijrah tidak akan berhenti.\" dalam Bab Taubat",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَخْرُجُ الدَّجَّالُ فَيَمْكُثُ أَرْبَعِينَ» لَا أَدْرِي أَرْبَعِينَ يَوْمًا أَوْ شَهْرًا أَوْ عَامًا «فَيَبْعَثُ اللَّهُ عِيسَى ابْنَ مَرْيَمَ كَأَنَّهُ عُرْوَةُ بْنُ مَسْعُودٍ فَيَطْلُبُهُ فَيُهْلِكُهُ ثُمَّ يَمْكُثُ فِي النَّاسِ سَبْعَ سِنِينَ لَيْسَ بَيْنَ اثْنَيْنِ عَدَاوَةٌ ثُمَّ يُرْسِلُ اللَّهُ رِيحًا بَارِدَةً مِنْ قِبَلِ الشَّامِ فَلَا يَبْقَى عَلَى وَجْهِ الْأَرْضِ أَحَدٌ فِي قَلْبِهِ مِثْقَالُ ذَرَّةٍ مِنْ خَيْرٍ أَوْ إِيمَانٍ إِلَّا قَبَضَتْهُ حَتَّى لَوْ أَنَّ أَحَدَكُمْ دَخَلَ فِي كَبِدِ جَبَلٍ لَدَخَلَتْهُ عَلَيْهِ حَتَّى تَقْبِضَهُ» قَالَ: فَيَبْقَى شِرَارُ النَّاسِ فِي خِفَّةِ الطَّيْرِ وَأَحْلَامِ السِّبَاعِ لَا يَعْرِفُونَ مَعْرُوفًا وَلَا يُنْكِرُونَ مُنْكَرًا فَيَتَمَثَّلُ لَهُمُ الشَّيْطَانُ فَيَقُولُ أَلَا تَسْتَجِيبُونَ؟ فَيَقُولُونَ: فَمَا تَأْمُرُنَا؟ فَيَأْمُرُهُمْ بِعِبَادَةِ الْأَوْثَانِ وَهُمْ فِي ذَلِكَ دَارٌّ رِزْقُهُمْ حَسَنٌ عَيْشُهُمْ ثُمَّ يُنْفَخُ فِي الصُّورِ فَلَا يَسْمَعُهُ أَحَدٌ إِلَّا أَصْغَى لِيتًا وَرَفَعَ لِيتًا قَالَ: وَأَوَّلُ مَنْ يَسْمَعُهُ رَجُلٌ يَلُوطُ حَوْضَ إِبِلِهِ فَيَصْعَقُ وَيَصْعَقُ النَّاسُ ثُمَّ يُرْسِلُ اللَّهُ مَطَرًا كَأَنَّهُ الطَّلُّ فَيَنْبُتُ مِنْهُ أَجْسَادُ النَّاسِ ثُمَّ يُنْفَخُ فِيهِ أُخْرَى فَإِذَا هُمْ قِيَامٌ يَنْظُرُونَ ثُمَّ يُقَالُ: يَا أَيُّهَا الناسُ هَلُمَّ إِلى ربِّكم وقفوهُم إِنَّهم مسؤولونَ. فَيُقَالُ: أَخْرِجُوا بَعْثَ النَّارِ. فَيُقَالُ: مِنْ كَمْ؟ كَمْ؟ فَيُقَالُ: مِنْ كُلِّ أَلْفٍ تِسْعَمِائَةٍ وَتِسْعَةً وَتِسْعِينَ قَالَ: «فَذَلِكَ يَوْمَ يَجْعَلُ الْوِلْدَانَ شِيبًا وَذَلِكَ يَوْمَ يُكْشَفُ عَنْ سَاقٍ» . رَوَاهُ مُسْلِمٌ وَذُكِرَ حَدِيثُ مُعَاوِيَةَ: «لَا تَنْقَطِعُ الْهِجْرَةُ» فِي «بَاب التَّوْبَة»"
      }
    ]
  }
}