{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 126,
    "data": [
      {
        "id": 32355,
        "hadith_number": "3661",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ketaatan Kepada Rasulullah dan Pemimpin",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "From Abu Hurairah, who said: The Messenger of Allah (peace and blessings be upon him) said: “Whoever obeys me has obeyed Allah, and whoever disobeys me has disobeyed Allah. And whoever obeys the Amir has obeyed me, and whoever disobeys the Amir has disobeyed me. Verily, the Imam is a shield behind whom one fights and is protected by him. If he commands with piety and justice, then he has a reward for that, and if he commands otherwise, then it is upon him.”",
        "malay_translation": "Dari Abu Hurairah, katanya: Rasulullah SAW bersabda: “Barangsiapa mentaatiku, maka sesungguhnya dia telah mentaati Allah, dan barangsiapa yang menderhaka kepadaku, maka sesungguhnya dia telah menderhaka kepada Allah. Dan barangsiapa mentaati pemerintah, maka sesungguhnya dia telah mentaatiku, dan barangsiapa menderhaka kepada pemerintah, maka sesungguhnya dia telah menderhaka kepadaku. Sesungguhnya Imam itu adalah seperti perisai yang di belakangnya seseorang berperang dan berlindung di belakangnya. Jika dia memerintah dengan takwa dan adil, maka baginya pahala di atasnya, dan jika dia memerintah selain dari itu, maka tanggungjawabnya di atasnya.”",
        "arabic_text": "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَطَاعَنِي فَقَدْ أَطَاعَ اللَّهَ وَمَنْ عَصَانِي فَقَدْ عَصَى اللَّهَ وَمَنْ يُطِعِ الْأَمِيرَ فَقَدْ أَطَاعَنِي وَمَنْ يَعْصِ الْأَمِيرَ فَقَدْ عَصَانِي وَإِنَّمَا الْإِمَامُ جُنَّةٌ يُقَاتَلُ مِنْ وَرَائِهِ وَيُتَّقَى بِهِ فَإِنْ أَمَرَ بِتَقْوَى اللَّهِ وَعَدَلَ فَإِنَّ لَهُ بِذَلِكَ أَجْرًا وَإِنْ قالَ بغَيرِه فَإِن عَلَيْهِ مِنْهُ»"
      },
      {
        "id": 32356,
        "hadith_number": "3662",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ketaatan kepada Pemimpin yang Memimpin dengan Kitab Allah",
        "perawi_melayu": "Umm al-Husain",
        "english_text": "And from Umm al-Husayn who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: \"If a mutilated slave is appointed over you and he leads you with the Book of Allah, then listen to him and obey.\" Narrated by Muslim.",
        "malay_translation": "Dan daripada Umm al-Husain RA berkata: Rasulullah SAW bersabda: \"Sekiranya dilantik ke atas kamu seorang hamba yang kudung anggota badannya, dan dia memimpin kamu dengan Kitab Allah, maka dengarlah dan taatilah dia.\" Riwayat Muslim.",
        "arabic_text": "وَعَنْ أُمِّ الْحُصَيْنِ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنْ أُمِّرَ عَلَيْكُمْ عَبْدٌ مُجَدَّعٌ يَقُودُكُمْ بِكِتَابِ اللَّهِ فَاسْمَعُوا لَهُ وَأَطيعُوا» . رَوَاهُ مُسلم"
      },
      {
        "id": 32357,
        "hadith_number": "3663",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mendengar dan Mentaati Pemimpin",
        "perawi_melayu": "Anas",
        "english_text": "From Anas, that the Messenger of Allah (peace and blessings of Allah be upon him) said: “Listen and obey, even if a Habashi slave whose head is like a raisin is appointed over you.”",
        "malay_translation": "Dari Anas, bahawa Rasulullah SAW bersabda:  “Dengar dan taatilah, walaupun seorang hamba Habsyi yang kepalanya seperti kismis dilantik menjadi pemimpin kamu.”",
        "arabic_text": "وَعَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «اسْمَعُوا وَأَطِيعُوا وَإِنِ اسْتُعْمِلَ عَلَيْكُمْ عَبْدٌ حَبَشِيٌّ كَأَنَّ رَأْسَهُ زَبِيبَةٌ» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32358,
        "hadith_number": "3664",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ketaatan dalam Ketaatan dan Keengganan",
        "perawi_melayu": "Ibn Umar",
        "english_text": "And from Ibn Umar (رضي الله عنهما) it was narrated that the Messenger of Allah (ﷺ) said:  \"Hearing and obedience are obligatory upon a Muslim in what he likes and dislikes as long as he is not ordered to commit a sin; but if he is ordered to commit a sin, then there is no hearing and no obedience.\"",
        "malay_translation": "Daripada Ibnu Umar رضي الله عنهما, diriwayatkan bahawa Rasulullah ﷺ bersabda:  \"Mendengar dan mentaati adalah wajib ke atas seorang Muslim dalam apa yang disukainya dan tidak disukainya selagi dia tidak disuruh melakukan dosa; tetapi jika dia disuruh melakukan dosa, maka tiada mendengar dan tiada mentaati.\"",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «السَّمعُ والطاعةُ على المرءِ المسلمِ فِيمَا أحب وأكره مَا لَمْ يُؤْمَرْ بِمَعْصِيَةٍ فَإِذَا أُمِرَ بِمَعْصِيَةٍ فَلَا سَمْعَ وَلَا طَاعَةَ»"
      },
      {
        "id": 32359,
        "hadith_number": "3665",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ketaatan Hanya dalam Perkara yang Baik",
        "perawi_melayu": "Sayidina Ali RA",
        "english_text": "On the authority of Ali (RA) who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: «There is no obedience in disobedience; obedience is only in what is good (ma'ruf).»",
        "malay_translation": "Daripada Ali RA berkata: Rasulullah SAW bersabda: «Tidak ada ketaatan dalam perkara maksiat, sesungguhnya ketaatan itu hanya dalam perkara yang baik (ma'ruf).»",
        "arabic_text": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا طَاعَةَ فِي مَعْصِيَةٍ إِنَّمَا الطَّاعَةُ فِي الْمَعْرُوف»"
      },
      {
        "id": 32360,
        "hadith_number": "3666",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Bai'ah Kepada Rasulullah SAW",
        "perawi_melayu": "Ubadah bin al-Samit",
        "english_text": "From Ubadah ibn as-Samit, he said: We pledged allegiance to the Messenger of Allah (peace and blessings be upon him) to obey him in times of ease and hardship, in activity and lethargy, and to prioritize him over ourselves, and not to dispute the matter with its people, and to speak the truth wherever we may be, not fearing in Allah the blame of any blamer. And in a narration: And not to dispute the matter with its people except if you see clear kufr among you from Allah there is proof in it.",
        "malay_translation": "Daripada Ubadah bin al-Samit, beliau berkata: Kami telah memberi bai’ah kepada Rasulullah SAW untuk mendengar dan mentaati baginda dalam keadaan susah dan senang, ketika bertenaga dan lemah, dan untuk mengutamakan baginda atas diri kami, dan tidak mencabar urusan kepada ahlinya, dan untuk berkata benar di mana sahaja kami berada, tanpa takut kepada Allah akan celaan orang yang mencela. Dan dalam satu riwayat: Dan tidak mencabar urusan kepada ahlinya kecuali jika kamu melihat kekufuran yang nyata di kalangan kamu, yang dari Allah ada bukti mengenainya.",
        "arabic_text": "وَعَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ: بَايَعْنَا رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى السَّمْعِ وَالطَّاعَةِ فِي الْعُسْرِ وَالْيُسْرِ وَالْمَنْشَطِ وَالْمَكْرَهِ وَعَلَى أَثَرَةٍ عَلَيْنَا وَعَلَى أَنْ لَا نُنَازِعَ الْأَمْرَ أَهْلَهُ وَعَلَى أَنْ نَقُولَ بِالْحَقِّ أَيْنَمَا كُنَّا لَا نَخَافُ فِي اللَّهِ لَوْمَةَ لَائِمٍ. وَفِي رِوَايَةٍ: وَعَلَى أَنْ لَا نُنَازِعَ الْأَمْرَ أَهْلَهُ إِلَّا أَنْ تَرَوْا كُفْرًا بَوَاحًا عِنْدَكُمْ مِنَ اللَّهِ فِيهِ بُرْهَانٌ"
      },
      {
        "id": 32361,
        "hadith_number": "3667",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Bai'ah untuk Mendengar dan Taat dalam Kemampuan",
        "perawi_melayu": "Ibnu Umar RA",
        "english_text": "Narrated Ibn Umar RA: We used to pledge allegiance to the Messenger of Allah SAW to listen and obey, and he would say to us: '(Do so) within your capability.'",
        "malay_translation": "Diriwayatkan daripada Ibnu Umar RA berkata: Kami pernah berbai'ah kepada Rasulullah SAW untuk mendengar dan taat, dan baginda bersabda kepada kami: '(Lakukanlah) dalam kemampuan kamu.'",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: كُنَّا إِذَا بَايَعْنَا رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى السَّمْعِ وَالطَّاعَةِ يَقُولُ لَنَا: «فِيمَا اسْتَطَعْتُمْ»"
      },
      {
        "id": 32362,
        "hadith_number": "3668",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kesabaran Terhadap Pemimpin",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "And from Ibn Abbas, he said: The Messenger of Allah (ﷺ) said: \"Whoever sees his Amir (ruler) whom he dislikes, let him be patient, for whoever leaves the Jama'ah (community) even by the width of a finger and dies, he dies the death of Jahiliyyah (pre-Islamic ignorance).\"",
        "malay_translation": "Daripada Ibnu Abbas, katanya: Rasulullah SAW bersabda:  \"Barang siapa melihat Amirnya (penguasa) yang dibencinya, hendaklah dia bersabar, kerana sesiapa yang meninggalkan Jamaah (masyarakat) walau sedikit sahaja dan mati, maka dia mati sebagai mati jahiliyyah (kejahilan pra-Islam).\"",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «من رأى أميره يَكْرَهُهُ فَلْيَصْبِرْ فَإِنَّهُ لَيْسَ أَحَدٌ يُفَارِقُ الْجَمَاعَةَ شبْرًا فَيَمُوت إِلَّا مَاتَ ميتَة جَاهِلِيَّة»"
      },
      {
        "id": 32363,
        "hadith_number": "3669",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kematian di Luar Ketaatan dan Perpecahan Umat",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah r.a., katanya: Saya mendengar Rasulullah s.a.w. bersabda:  \"Barang siapa keluar daripada ketaatan dan meninggalkan jamaah, kemudian mati, maka dia mati dengan kematian jahiliyyah. Dan barang siapa yang berperang di bawah panji-panji yang jahil,  dengan marah kerana  kepentingan puak atau menyeru  kepada kepentingan puak atau menolong kepentingan puak, kemudian terbunuh, maka dia terbunuh dengan pembunuhan jahiliyyah. Dan barang siapa yang keluar menyerang umatku dengan pedangnya,  mencederakan orang baik dan orang jahat, tidak mengendahkan orang mukmin dan tidak menepati janji kepada orang yang berjanji, maka dia bukan daripada golonganku dan aku bukan daripada golongannya.\" Riwayat Muslim.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ خَرَجَ مِنَ الطَّاعَةِ وَفَارَقَ الْجَمَاعَةَ فَمَاتَ مَاتَ مِيتَةً جَاهِلِيَّةً وَمَنْ قَاتَلَ تَحْتَ رَايَةٍ عِمِّيَّةٍ يَغْضَبُ لِعَصَبِيَّةٍ أَوْ يَدْعُو لِعَصَبِيَّةٍ أَوْ يَنْصُرُ عَصَبِيَّةً فَقُتِلَ فَقِتْلَةٌ جَاهِلِيَّةٌ وَمَنْ خَرَجَ عَلَى أُمَّتِي بِسَيْفِهِ يَضْرِبُ بَرَّهَا وَفَاجِرَهَا وَلَا يَتَحَاشَى مِنْ مُؤْمِنِهَا وَلَا يَفِي لِذِي عَهْدٍ عَهْدَهُ فَلَيْسَ مِنِّي وَلَسْتُ مِنْهُ» . رَوَاهُ مُسلم"
      },
      {
        "id": 32364,
        "hadith_number": "3670",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ciri-ciri Imam yang Baik dan Buruk",
        "perawi_melayu": "Auf bin Malik al-Asyja'i",
        "english_text": "From Auf bin Malik al-Asy'ari from the Messenger of Allah (peace and blessings be upon him) he said: “The best of your leaders are those whom you love and they love you, you pray for them and they pray for you. And the worst of your leaders are those whom you hate and they hate you, you curse them and they curse you.” We said: O Messenger of Allah! Shall we not oppose them in that case? He said: “No, as long as they establish the prayer among you. Whoever is placed in charge of a leader and sees him doing something of the disobedience of Allah, let him hate what he does of the disobedience of Allah, but let him not withdraw his hand from obedience.”",
        "malay_translation": "Daripada Auf bin Malik al-Asyja'i daripada Rasulullah SAW, baginda bersabda:  “Pemimpin kamu yang terbaik ialah mereka yang kamu cintai dan mereka mencintai kamu, kamu mendoakan mereka dan mereka mendoakan kamu. Dan pemimpin kamu yang paling buruk ialah mereka yang kamu benci dan mereka membenci kamu, kamu melaknati mereka dan mereka melaknati kamu.” Kami berkata: Wahai Rasulullah! Patutkah kami menentang mereka dalam hal itu? Baginda bersabda: “Tidak, selagi mereka mendirikan solat di kalangan kamu. Sesiapa yang dilantik sebagai pemimpin dan melihat pemimpinnya melakukan sesuatu kemaksiatan kepada Allah, hendaklah dia membenci apa yang dilakukannya daripada kemaksiatan kepada Allah, tetapi janganlah dia menarik tangannya daripada ketaatan.”",
        "arabic_text": "وَعَنْ عَوْفِ بْنِ مَالِكٍ الْأَشْجَعِيِّ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «خِيَارُ أئمتكم الَّذين يحبونهم وَيُحِبُّونَكُمْ وَتُصَلُّونَ عَلَيْهِمْ وَيُصَلُّونَ عَلَيْكُمْ وَشِرَارُ أَئِمَّتِكُمُ الَّذِي تبغضونهم ويبغضونكم وتلعنوهم ويلعنوكم» قَالَ: قُلْنَا: يَا رَسُولَ اللَّهِ أَفَلَا نُنَابِذُهُمْ عِنْدَ ذَلِكَ؟ قَالَ: «لَا مَا أَقَامُوا فِيكُمُ الصَّلَاةَ لَا مَا أَقَامُوا فِيكُمُ الصَّلَاةَ أَلَا مَنْ وُلِّيَ عَلَيْهِ وَالٍ فَرَآهُ يَأْتِي شَيْئًا مِنْ مَعْصِيَةِ اللَّهِ فَلْيَكْرَهْ مَا يَأْتِي مِنْ مَعْصِيَةِ اللَّهِ وَلَا يَنْزِعَنَّ يَدًا مِنْ طَاعَةٍ» . رَوَاهُ مُسلم"
      },
      {
        "id": 32365,
        "hadith_number": "3671",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tanggungjawab Umat Terhadap Pemimpin Yang Zalim",
        "perawi_melayu": "Ummu Salamah",
        "english_text": "From Umm Salamah, she said: The Messenger of Allah (ﷺ) said: \"There will be rulers over you whom you will recognize and disapprove of. Whoever disapproves has cleared himself, and whoever dislikes has been saved; but whoever is pleased and follows them...\" They said: \"Should we not fight them?\" He said: \"No, as long as they pray, as long as they pray.\" That is, whoever dislikes in his heart and disapproves in his heart.",
        "malay_translation": "Daripada Ummu Salamah, beliau berkata: Rasulullah SAW bersabda:  \"Akan ada pemerintah-pemerintah atas kamu yang kamu kenal dan kamu tidak redha. Barangsiapa yang tidak redha maka dia telah membersihkan dirinya, dan barangsiapa yang membenci maka dia telah selamat; tetapi barangsiapa yang redha dan mengikutinya…\" Mereka bertanya: \"Patutkah kita memerangi mereka?\" Baginda menjawab: \"Tidak, selagi mereka menunaikan solat, selagi mereka menunaikan solat.\" Maksudnya, barangsiapa yang membenci dalam hatinya dan tidak redha dalam hatinya.",
        "arabic_text": "وَعَنْ أُمِّ سَلَمَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَكُونُ عَلَيْكُمْ أُمَرَاءُ تَعْرِفُونَ وَتُنْكِرُونَ فَمَنْ أَنْكَرَ فَقْدَ بَرِئَ وَمَنْ كَرِهَ فَقَدْ سَلِمَ وَلَكِنْ مَنْ رَضِيَ وَتَابَعَ» قَالُوا: أَفَلَا نُقَاتِلُهُمْ؟ قَالَ: «لَا مَا صَلَّوْا لَا مَا صَلَّوْا» أَيْ: مَنْ كَرِهَ بِقَلْبِهِ وَأنكر بِقَلْبِه. رَوَاهُ مُسلم"
      },
      {
        "id": 32366,
        "hadith_number": "3672",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menunaikan Hak dan Meminta Hak Kepada Allah",
        "perawi_melayu": "Abdullah bin Mas'ud",
        "english_text": "And from Abdullah bin Mas'ud, he said: The Messenger of Allah (peace and blessings of Allah be upon him) said to us: \"Indeed, you will see after me things that you will dislike and matters that you will find objectionable.\"",
        "malay_translation": "Daripada Abdullah bin Mas'ud, katanya: Rasulullah SAW telah bersabda kepada kami:  \"Sesungguhnya kamu akan melihat selepas aku perkara-perkara yang kamu tidak suka dan kejadian-kejadian yang akan kamu dapati menjijikkan.\"",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّكُمْ سَتَرَوْنَ بَعْدِي أَثَرَةً وَأُمُورًا تُنْكِرُونَهَا» قَالُوا: فَمَا تَأْمُرُنَا يَا رَسُولَ اللَّهِ؟ قَالَ: «أَدُّوا إِلَيْهِم حَقهم وسلوا الله حقكم»"
      },
      {
        "id": 32367,
        "hadith_number": "3673",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ketaatan Kepada Pemimpin",
        "perawi_melayu": "Wa'il bin Hujr",
        "english_text": "It is narrated from Wa'il bin Hujr, he said: Salama bin Yazid al-Ju'fi asked the Messenger of Allah (ﷺ): \"O Prophet of Allah, what if rulers rise up against us demanding their rights and preventing us from ours, what do you command us to do?\" He (ﷺ) said: \"Listen and obey, for they are only responsible for what they are entrusted with, and you are only responsible for what you are entrusted with.\"",
        "malay_translation": "Daripada Wa'il bin Hujr, katanya: Salama bin Yazid al-Ju'fi bertanya kepada Rasulullah SAW: “Wahai Nabi Allah, bagaimana jika pemimpin-pemimpin bangkit menentang kami, menuntut hak mereka dan menghalang hak kami, apakah yang tuan perintahkan kami untuk berbuat?” Baginda SAW bersabda: “Dengar dan taatlah, kerana mereka hanya bertanggungjawab terhadap apa yang telah diamanahkan kepada mereka, dan kamu hanya bertanggungjawab terhadap apa yang telah diamanahkan kepada kamu.”",
        "arabic_text": "وَعَنْ وَائِلِ بْنِ حُجْرٍ قَالَ: سَأَلَ سَلَمَةُ بْنُ يَزِيدَ الْجُعْفِيُّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا نَبِيَّ اللَّهِ أَرَأَيْتَ إِنْ قَامَتْ عَلَيْنَا أُمَرَاءُ يَسْأَلُونَا حَقَّهُمْ وَيَمْنَعُونَا حَقَّنَا فَمَا تَأْمُرُنَا؟ قَالَ: «اسْمَعُوا وَأَطِيعُوا فَإِنَّمَا عَلَيْهِمْ مَا حُمِّلُوا وَعَلَيْكُمْ مَا حُمِّلْتُمْ» . رَوَاهُ مُسلم"
      },
      {
        "id": 32368,
        "hadith_number": "3674",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Meninggal Tanpa Bai'ah dan Menolak Ketaatan",
        "perawi_melayu": "Abdullah bin Umar",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abdullah bin Umar, katanya: Aku mendengar Rasulullah SAW bersabda:  \"Sesiapa yang melepaskan tangannya daripada ketaatan (kepada pemimpin yang adil), maka dia akan menemui Allah SWT pada hari kiamat tanpa sebarang hujah. Dan sesiapa yang mati tanpa berada di dalam ikatan bai'ah (taat setia kepada pemimpin yang adil), maka dia mati dengan kematian jahiliyyah.\" Riwayat Muslim.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يَقُول: «مَنْ خَلَعَ يَدًا مِنْ طَاعَةٍ لَقِيَ اللَّهَ يَوْمَ الْقِيَامَةِ وَلَا حُجَّةَ لَهُ. وَمَنْ مَاتَ وَلَيْسَ فِي عُنُقِهِ بَيْعَةٌ مَاتَ مِيتَةً جَاهِلِيَّةً» . رَوَاهُ مُسلم"
      },
      {
        "id": 32369,
        "hadith_number": "3675",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kepemimpinan Selepas Rasulullah SAW",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah daripada Nabi SAW, baginda bersabda:  “Bani Israel dipimpin oleh para nabi. Setiap kali seorang nabi meninggal dunia, akan digantikan oleh nabi yang lain.  Sesungguhnya, tidak akan ada nabi selepasku. Akan ada sekutu-sekutu (pemimpin) dan mereka akan ramai.” Mereka bertanya, “Apakah yang tuan perintahkan kepada kami?” Baginda menjawab: “Tunaikan bai’ah (janji setia) yang pertama kepada yang pertama. Berikanlah hak mereka, kerana sesungguhnya Allah akan meminta pertanggungjawaban daripada mereka tentang apa yang telah diamanahkan kepada mereka.”",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كَانَتْ بَنُو إِسْرَائِيلَ تَسُوسُهُمُ الْأَنْبِيَاءُ كُلَّمَا هَلَكَ نَبِيُّ خَلَفَهُ نبيٌّ وإِنَّه لَا نبيَّ بعدِي وسيكون حلفاء فَيَكْثُرُونَ» قَالُوا: فَمَا تَأْمُرُنَا؟ قَالَ: «فُوا بَيْعَةَ الْأَوَّلِ فَالْأَوَّلِ أَعْطُوهُمْ حَقَّهُمْ فَإِنَّ اللَّهَ سَائِلُهُمْ عَمَّا استرعاهم»"
      },
      {
        "id": 32370,
        "hadith_number": "3676",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Membunuh Khalifah Kedua",
        "perawi_melayu": "Abu Said al-Khudri",
        "english_text": "From Abu Said, he said: The Messenger of Allah (peace and blessings of Allah be upon him) said: “If two caliphs are appointed, kill the latter of them.”  Reported by Muslim.",
        "malay_translation": "Daripada Abu Said, beliau berkata: Rasulullah SAW bersabda:  “Jika dua orang khalifah dilantik, bunuhlah yang kedua.” Riwayat Muslim.",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا بُويِعَ لِخَلِيفَتَيْنِ فاقتُلوا الآخِرَ منهُما» . رَوَاهُ مُسلم"
      },
      {
        "id": 32371,
        "hadith_number": "3677",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman Bagi Mereka Yang Memecah Perpaduan Umat",
        "perawi_melayu": "Arfajhah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Arfajhah, katanya: Aku mendengar Rasulullah SAW bersabda: \"Sesungguhnya akan berlaku perkara-perkara kecil dan perkara-perkara kecil. Maka sesiapa yang ingin memecah belahkan umat ini sedang mereka bersatu, maka bunuhlah dia dengan pedang, sesiapa pun dia.\"  Riwayat Muslim.",
        "arabic_text": "وَعَنْ عَرْفَجَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّهُ سَيَكُونُ هَنَاتٌ وَهَنَاتٌ فَمَنْ أَرَادَ أَنْ يُفَرِّقَ أَمْرَ هَذِهِ الْأُمَّةِ وَهِيَ جَمِيعٌ فَاضْرِبُوهُ بِالسَّيْفِ كَائِنًا مَنْ كانَ» . رَوَاهُ مُسلم"
      },
      {
        "id": 32372,
        "hadith_number": "3678",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman Bagi Mereka yang Cuba Memecahbelahkan Perpaduan Umat Islam",
        "perawi_melayu": "Abu Sa'id al-Khudri",
        "english_text": "And from him (Abu Sa'id Al-Khudri) who said: I heard the Messenger of Allah (peace and blessings of Allah be upon him) say: \"Whoever comes to you while your affair is united under one man, intending to break your unity or divide your community, then kill him.\" Narrated by Muslim.",
        "malay_translation": "Daripada beliau (Abu Sa'id al-Khudri) yang berkata: Aku mendengar Rasulullah SAW bersabda: \"Sesiapa yang datang kepada kamu ketika urusan kamu bersatu di bawah seorang lelaki, yang ingin memecahbelahkan perpaduan kamu atau memecah-belahkan jemaah kamu, maka bunuhlah dia.\" Riwayat Muslim.",
        "arabic_text": "وَعَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ أَتَاكُمْ وَأَمْرُكُمْ جَمِيعٌ عَلَى رَجُلٍ وَاحِدٍ يُرِيدُ أَنْ يَشُقَّ عَصَاكُمْ أوْ يُفرِّقَ جماعتكم فَاقْتُلُوهُ» . رَوَاهُ مُسلم"
      },
      {
        "id": 32373,
        "hadith_number": "3679",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ketaatan kepada Imam",
        "perawi_melayu": "Abdullah bin Amr",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abdullah bin Amr, katanya: Rasulullah SAW bersabda:  “Barang siapa yang telah memberi bai’ah kepada seorang imam, lalu memberikan taat setia sepenuhnya dan ikhlas dalam hatinya, maka hendaklah dia mentaati imam tersebut selagi mampu. Jika datang orang lain yang mencabarnya, bunuhlah orang itu.” Riwayat Muslim.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «من بَايَعَ إِمَامًا فَأَعْطَاهُ صَفْقَةَ يَدِهِ وَثَمَرَةَ قَلْبِهِ فَلْيُطِعْهُ إِنِ اسْتَطَاعَ فَإِنْ جَاءَ آخَرُ يُنَازِعُهُ فاضربوا عنق الآخر» . رَوَاهُ مُسلم"
      },
      {
        "id": 32374,
        "hadith_number": "3680",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Jangan Meminta Jawatan Kepimpinan",
        "perawi_melayu": "Abd al-Rahman bin Samurah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abd al-Rahman bin Samurah, katanya: Rasulullah SAW telah bersabda kepadaku:  \"Janganlah engkau meminta jawatan kepimpinan.  Sesungguhnya jika engkau diberi jawatan itu kerana permintaanmu, maka engkau akan dipertanggungjawabkan ke atasnya, dan jika engkau diberi jawatan itu tanpa meminta, maka engkau akan dibantu (dalam melaksanakannya).\"",
        "arabic_text": "وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ قَالَ: قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَسْأَلِ الْإِمَارَةَ فَإِنَّكَ إِنْ أُعْطِيتَهَا عَنْ مَسْأَلَةٍ وُكِلْتَ إِلَيْهَا وَإِنْ أُعْطِيتَهَا عنْ غيرِ مَسْأَلَة أعنت عَلَيْهَا»"
      },
      {
        "id": 32375,
        "hadith_number": "3681",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pentingnya Menjauhi Keinginan Menjadi Pemimpin",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "And from Abu Hurairah from the Prophet (peace and blessings of Allaah be upon him) who said: “Verily, you will strive for leadership and it will be a cause of regret on the Day of Resurrection. So a good wet-nurse is indeed good but a bad wet-nurse is evil.”",
        "malay_translation": "Dari Abu Hurairah daripada Nabi SAW, baginda bersabda:  “Sesungguhnya kamu akan berlumba-lumba untuk mendapatkan jawatan kepimpinan dan ia akan menjadi suatu penyesalan pada hari kiamat.  Maka, pengasuh yang baik adalah baik, dan pengasuh yang jahat adalah buruk.”",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّكُمْ سَتَحْرِصُونَ عَلَى الْإِمَارَةِ وَسَتَكُونُ نَدَامَةً يَوْمَ الْقِيَامَةِ فَنِعْمَ الْمُرْضِعَةُ وَبِئْسَتِ الفاطمةُ» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32376,
        "hadith_number": "3682",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Amanah Jawatan dan Kelemahan",
        "perawi_melayu": "Abu Dzar",
        "english_text": "Abu Dharr reported: I said, 'O Messenger of Allah, will you not appoint me to a position of authority?' He said, striking my shoulder with his hand, 'O Abu Dharr, you are weak, and authority is a trust, and it is a cause of disgrace and regret on the Day of Resurrection, except for one who takes it rightfully and fulfills his obligations in it.' And in another version: He said to him, 'O Abu Dharr, I see that you are weak, and I like for you what I like for myself. Do not be in charge of even two people, and do not be in charge of the property of an orphan.'",
        "malay_translation": "Daripada Abu Dzar RA berkata: Aku bertanya, 'Wahai Rasulullah, tidakkah engkau melantikku untuk suatu jawatan?' Baginda bersabda sambil menepuk bahuku dengan tangannya, 'Wahai Abu Dzar, sesungguhnya engkau lemah, dan jawatan itu adalah amanah, dan sesungguhnya ia pada hari kiamat adalah kehinaan dan penyesalan, kecuali bagi sesiapa yang mengambilnya dengan hak dan menunaikan kewajipan yang ada padanya.' Dalam riwayat lain: Baginda bersabda kepadanya, 'Wahai Abu Dzar, sesungguhnya aku melihat engkau lemah, dan aku suka untukmu apa yang aku suka untuk diriku sendiri. Janganlah engkau menjadi ketua walaupun ke atas dua orang, dan janganlah engkau mengurus harta anak yatim.'",
        "arabic_text": "وَعَنْ أَبِي ذَرٍّ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ أَلَا تَسْتَعْمِلُنِي؟ قَالَ: فَضَرَبَ بِيَدِهِ عَلَى مَنْكِبِي ثُمَّ قَالَ: «يَا أَبَا ذَرٍّ إِنَّكَ ضَعِيفٌ وَإِنَّهَا أَمَانَةٌ وَإِنَّهَا يَوْمَ الْقِيَامَةِ خِزْيٌ وَنَدَامَةٌ إِلَّا مَنْ أَخَذَهَا بِحَقِّهَا وَأَدَّى الَّذِي عَلَيْهِ فِيهَا» . وَفِي رِوَايَةٍ: قَالَ لَهُ: «يَا أَبَا ذَرٍّ إِنِّي أَرَاكَ ضَعِيفًا وَإِنِّي أُحِبُّ لَكَ مَا أُحِبُّ لِنَفْسِي لَا تَأَمَّرَنَّ عَلَى اثْنَيْنِ وَلَا تَوَلَّيَنَّ مَالَ يَتِيمٍ» . رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 32377,
        "hadith_number": "3683",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Tidak Memilih Pemimpin yang Meminta Jawatan",
        "perawi_melayu": "Abu Musa al-Ash'ari",
        "english_text": "From Abu Musa, he said: I entered upon the Prophet, peace and blessings of Allah be upon him, along with two men from my tribe. One of them said: O Messenger of Allah, appoint us to some of what Allah has entrusted to you. And the other said similarly. He said: \"Indeed, by Allah, we do not appoint to this work anyone who asks for it or anyone who is eager for it.\"",
        "malay_translation": "Daripada Abu Musa, beliau berkata: Aku masuk mengadap Nabi SAW bersama dua orang lelaki daripada kaumku.  Salah seorang daripada mereka berkata: Wahai Rasulullah, lantiklah kami kepada sebahagian daripada apa yang Allah SWT telah amanahkan kepadamu. Dan yang seorang lagi berkata demikian juga. Baginda SAW bersabda:  “Sesungguhnya demi Allah, kami tidak akan melantik kepada kerja ini sesiapa yang meminta atau sesiapa yang menginginkannya.”",
        "arabic_text": "وَعَنْ أَبِي مُوسَى قَالَ: دَخَلْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا وَرَجُلَانِ مِنْ بَنِي عَمِّي فَقَالَ أَحَدُهُمَا: يَا رَسُولَ اللَّهِ أَمِّرْنَا عَلَى بَعْضِ مَا وَلَّاكَ اللَّهُ وَقَالَ الْآخَرُ مِثْلَ ذَلِكَ فَقَالَ: «إِنَّا وَاللَّهِ لَا نُوَلِّي عَلَى هَذَا الْعَمَلِ أَحَدًا سَأَلَهُ وَلَا أَحَدًا حَرَصَ عَلَيْهِ» . وَفِي رِوَايَةٍ قَالَ: «لَا نَسْتَعْمِلُ عَلَى عَمَلِنَا مَنْ أَرَادَهُ»"
      },
      {
        "id": 32378,
        "hadith_number": "3684",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keengganan Orang Terbaik terhadap Urusan Dunia",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "On the authority of Abu Hurairah, who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: \"You will find among the best of people those who are most averse to this matter until they fall into it.\"",
        "malay_translation": "Daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: \"Kamu akan dapati di antara manusia yang terbaik adalah mereka yang paling tidak suka dengan perkara ini sehingga mereka terjatuh ke dalamnya.\"",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَجِدُونَ مِنْ خَيْرِ النَّاسِ أَشَدَّهُمْ كَرَاهِيَةً لِهَذَا الْأَمْرِ حَتَّى يقَعَ فِيهِ»"
      },
      {
        "id": 32379,
        "hadith_number": "3685",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tanggungjawab Kepimpinan dan Pemerintahan",
        "perawi_melayu": "Abdullah bin Umar",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abdullah bin Umar, katanya: Rasulullah SAW bersabda: \"Ketahuilah, sesungguhnya kamu semua adalah pemimpin dan setiap kamu bertanggungjawab terhadap yang di bawah kepimpinannya. Imam yang memimpin manusia adalah pemimpin dan dia bertanggungjawab terhadap yang di bawah kepimpinannya. Seorang lelaki adalah pemimpin terhadap ahli keluarganya dan dia bertanggungjawab terhadap yang di bawah kepimpinannya. Seorang wanita adalah pemimpin terhadap rumah suaminya dan anak-anaknya dan dia bertanggungjawab terhadap mereka. Seorang hamba adalah pemimpin terhadap harta tuannya dan dia bertanggungjawab terhadapnya. Ketahuilah, sesungguhnya kamu semua adalah pemimpin dan setiap kamu bertanggungjawab terhadap yang di bawah kepimpinannya.\"",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «أَلا كلُّكُمْ راعٍ وكلُّكُمْ مسؤولٌ عَنْ رَعِيَّتِهِ فَالْإِمَامُ الَّذِي عَلَى النَّاسِ رَاعٍ وَهُوَ مسؤولٌ عَنْ رَعِيَّتِهِ وَالرَّجُلُ رَاعٍ عَلَى أَهْلِ بَيْتِهِ وَهُوَ مسؤولٌ عَنْ رَعِيَّتِهِ وَالْمَرْأَةُ رَاعِيَةٌ عَلَى بَيْتِ زَوْجِهَا وولدِهِ وَهِي مسؤولةٌ عَنْهُمْ وَعَبْدُ الرَّجُلِ رَاعٍ عَلَى مَالِ سَيِّدِهِ وَهُوَ مسؤولٌ عَنهُ أَلا فكلُّكُمْ راعٍ وكلكُمْ مسؤولٌ عَن رعيتِه»"
      },
      {
        "id": 32380,
        "hadith_number": "3686",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Gabenor Yang Zalim",
        "perawi_melayu": "Ma'qil bin Yasar",
        "english_text": "From Ma'qil ibn Yasar, who said: I heard the Messenger of Allah (peace and blessings be upon him) say: “There is no governor who governs over a group of Muslims, then dies while being unjust to them, except that Allah will forbid him Paradise.”",
        "malay_translation": "Dari Ma'qil bin Yasar, katanya: Aku mendengar Rasulullah SAW bersabda:  “Tiada seorang gabenor pun yang memerintah sekumpulan umat Islam, kemudian mati dalam keadaan berlaku zalim kepada mereka, melainkan Allah akan mengharamkan syurga ke atasnya.”",
        "arabic_text": "وَعَنْ مَعْقِلِ بْنِ يَسَارٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يقولُ: «مَا مِنْ والٍ بلي رَعِيَّةً مِنَ الْمُسْلِمِينَ فَيَمُوتُ وَهُوَ غَاشٌّ لَهُمْ إِلَّا حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ»"
      },
      {
        "id": 32381,
        "hadith_number": "3687",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kehilangan Bau Syurga Kerana Tidak Nasihat",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Not Available",
        "malay_translation": "Daripada hadis yang diriwayatkan, baginda Rasulullah SAW bersabda:  \"Sesiapa yang Allah SWT amanahkan kepadanya sesuatu kaum/rakyat, kemudian dia tidak menasihati mereka dengan penuh kejujuran, maka dia tidak akan mencium bau syurga.\"",
        "arabic_text": "وَعَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَا مِنْ عَبْدٍ يَسْتَرْعِيهِ اللَّهُ رَعِيَّةً فَلَمْ يَحُطْهَا بِنَصِيحَةٍ إِلَّا لَمْ يجد رَائِحَة الْجنَّة»"
      },
      {
        "id": 32382,
        "hadith_number": "3688",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keburukan Gembala Yang Buruk",
        "perawi_melayu": "A'idh bin Amr",
        "english_text": "From A'idh ibn Amr, who said: I heard the Messenger of Allah (ﷺ) say: \"Indeed, the worst of shepherds is the one who destroys.\"",
        "malay_translation": "Daripada A'idh bin Amr, yang berkata: Aku mendengar Rasulullah SAW bersabda:  \"Sesungguhnya, gembala yang paling buruk ialah yang memusnahkan (ternaknya).\"",
        "arabic_text": "وَعَنْ عَائِذِ بْنِ عَمْرٌو قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ شرَّ الرعاءِ الحُطَمَة» . رَوَاهُ مُسلم"
      },
      {
        "id": 32383,
        "hadith_number": "3689",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Doa untuk Pemimpin yang Lembut dan Keras",
        "perawi_melayu": "Aisyah R.A",
        "english_text": "Narrated from Aisha R.A, who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: \"O Allah, whoever is in charge of any affair of my Ummah and is harsh with them, be harsh with him, and whoever is in charge of any affair of my Ummah and is kind to them, be kind to him.\" Related by Muslim.",
        "malay_translation": "Daripada Aisyah R.A berkata: Rasulullah SAW bersabda: \"Ya Allah, sesiapa yang menguruskan urusan umatku ini dengan kekerasan, maka berkeraslah kepadanya, dan sesiapa yang menguruskan urusan umatku ini dengan kelembutan, maka berlemah lembutlah kepadanya.\" Riwayat Muslim.",
        "arabic_text": "وَعَنْ عَائِشَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اللَّهُمَّ مَنْ وَلِيَ مِنْ أَمْرِ أُمَّتِي شَيْئًا فَشَقَّ عَلَيْهِمْ فَاشْقُقْ عَلَيْهِ وَمَنْ وَلِيَ مِنْ أَمْرِ أُمَّتِي شَيْئًا فَرَفَقَ بهم فارفُقْ بِهِ» . رَوَاهُ مُسلم"
      },
      {
        "id": 32384,
        "hadith_number": "3690",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Orang-orang yang Adil di Tempat yang Mulia",
        "perawi_melayu": "Abdullah bin Amr bin al-'Ash",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abdullah bin Amr bin al-'Ash, katanya: Rasulullah SAW bersabda:  \"Sesungguhnya orang-orang yang adil berada di sisi Allah di atas mimbar-mimbar daripada cahaya, di sebelah kanan Ar-Rahman. Kedua-dua belah tanganNya adalah kanan, iaitu mereka yang berlaku adil dalam pemerintahan, keluarga dan apa jua yang mereka uruskan.\" Riwayat Muslim.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الْمُقْسِطِينَ عِنْدَ اللَّهِ عَلَى مَنَابِرَ مِنْ نُورٍ عَنْ يَمِينِ الرَّحْمَنِ وَكِلْتَا يَدَيْهِ يمينٌ الذينَ يعدِلُونَ فِي حُكمِهم وأهليهم وَمَا ولُوا» . رَوَاهُ مُسلم"
      },
      {
        "id": 32385,
        "hadith_number": "3691",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi dan Pemimpin Memiliki Dua Golongan Penasihat",
        "perawi_melayu": "Abu Said al-Khudri",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Said al-Khudri, katanya: Rasulullah SAW bersabda: \"Tidaklah Allah SWT mengutus seorang nabi atau melantik seorang khalifah melainkan dia mempunyai dua golongan penasihat: satu golongan yang menyuruhnya berbuat kebaikan dan mendorongnya ke arah kebaikan, dan satu golongan lagi yang menyuruhnya berbuat kejahatan dan mendorongnya ke arah kejahatan. Dan yang maksum ialah orang yang dipelihara oleh Allah SWT.\" Riwayat Bukhari.",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَا بَعَثَ اللَّهُ مِنْ نَبِيٍّ وَلَا اسْتَخْلَفَ مِنْ خَلِيفَةٍ إِلَّا كَانَتْ لَهُ بِطَانَتَانِ: بِطَانَةٌ تَأْمُرُهُ بِالْمَعْرُوفِ وَتَحُضُّهُ عَلَيْهِ وَبِطَانَةٌ تَأْمُرُهُ بِالشَّرِّ وَتَحُضُّهُ عَلَيْهِ وَالْمَعْصُومُ مَنْ عصمَه اللَّهُ . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32386,
        "hadith_number": "3692",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Peranan Qais bin Saad",
        "perawi_melayu": "Anas",
        "english_text": "From Anas, he said: Qais bin Saad was to the Prophet (ﷺ) like the chief of police to the governor.",
        "malay_translation": "Dari Anas, beliau berkata: Qais bin Saad kepada Nabi ﷺ seperti ketua polis kepada gabenor.",
        "arabic_text": "وَعَنْ أَنَسٍ قَالَ: كَانَ قَيْسُ بْنُ سَعْدٍ مِنَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَنْزِلَةِ صاحبِ الشُّرَطِ منَ الأميرِ. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32387,
        "hadith_number": "3693",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kegagalan Umat yang Memimpin Wanita",
        "perawi_melayu": "Abu Bakrah",
        "english_text": "From Abu Bakrah, he said: When the Messenger of Allah ﷺ was informed that the people of Persia had appointed a woman, the daughter of Kisra, as their ruler, he said: “A people will never succeed who make a woman their leader.” Narrated by Bukhari.",
        "malay_translation": "Daripada Abu Bakrah, beliau berkata:  Apabila Rasulullah ﷺ dimaklumkan bahawa penduduk Parsi telah melantik seorang wanita, iaitu anak perempuan Kisra, sebagai pemerintah mereka, baginda bersabda:  “Sesuatu kaum itu tidak akan berjaya sekiranya mereka menjadikan seorang wanita sebagai pemimpin mereka.”  Riwayat Bukhari.",
        "arabic_text": "وَعَنْ أَبِي بَكْرَةَ قَالَ: لَمَّا بَلَغَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ أَهْلَ فَارِسَ قَدْ مَلَّكُوا عَلَيْهِمْ بِنْتَ كِسْرَى قَالَ: «لَنْ يُفْلِحَ قَوْمٌ وَلَّوْا أَمْرَهُمُ امْرَأَةً» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32388,
        "hadith_number": "3694",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Lima Perkara Penting dalam Islam",
        "perawi_melayu": "Al-Harith Al-Asy'ari",
        "english_text": "From Al-Harith Al-Asy'ari, he said: The Messenger of Allah (peace and blessings be upon him) said: \"I command you with five things: Jama'ah (community), listening and obeying, Hijrah (migration), Jihad in the way of Allah. And verily, whoever leaves the Jama'ah even the width of a span, he has removed the collar of Islam from his neck unless he returns. And whoever calls to the call of Jahiliyyah (pre-Islamic ignorance), then he is from the fuel of Hellfire even if he fasts, prays, and claims that he is a Muslim.\"",
        "malay_translation": "Daripada Al-Harith Al-Asy'ari, beliau berkata: Rasulullah SAW bersabda:  \"Aku perintahkan kamu dengan lima perkara: Jamaah (jemaah), mendengar dan mentaati, Hijrah (hijrah), Jihad di jalan Allah. Dan sesungguhnya sesiapa yang meninggalkan Jamaah walau sesiku jari pun, nescaya dia telah melepaskan ikatan Islam dari lehernya kecuali jika dia kembali. Dan sesiapa yang menyeru kepada seruan Jahiliyyah (kejahilan pra-Islam), maka dia adalah daripada bahan api neraka Jahannam, walaupun dia berpuasa, sembahyang, dan mendakwa dirinya seorang Muslim.\"",
        "arabic_text": "عَن الحارِثِ الْأَشْعَرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: آمُرُكُمْ بِخَمْسٍ: بِالْجَمَاعَةِ وَالسَّمْعِ وَالطَّاعَةِ وَالْهِجْرَةِ وَالْجِهَادِ فِي سَبِيلِ اللَّهِ وَإِنَّهُ مَنْ خَرَجَ مِنَ الْجَمَاعَةِ قِيدَ شِبْرٍ فَقَدْ خَلَعَ رِبْقَةَ الْإِسْلَامِ مِنْ عُنُقِهِ إِلَّا أَنْ يُرَاجِعَ وَمَنْ دَعَا بِدَعْوَى الْجَاهِلِيَّةِ فَهُوَ مِنْ جُثَى جَهَنَّمَ وَإِنْ صَامَ وَصَلَّى وَزَعَمَ أَنَّهُ مُسْلِمٌ . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ"
      },
      {
        "id": 32389,
        "hadith_number": "3695",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menghina Pemerintah Adalah Menghina Allah",
        "perawi_melayu": "Ziyad bin Kusaib al-'Adawi",
        "english_text": "And from Ziyaad bin Kusaib al-Adawi, he said: I was with Abu Bakrah under the mimbar of Ibn 'Amir while he was giving a sermon, and he was wearing thin clothes.  Then Abu Bilal said: \"Look at our Amir, he is wearing the clothes of the fasiq (rebellious).\" Then Abu Bakrah said: \"Be quiet! I heard the Messenger of Allah (peace and blessings be upon him) say: \"Whoever humiliates a sultan of Allah on earth, Allah will humiliate him.\"",
        "malay_translation": "Daripada Ziyad bin Kusaib al-'Adawi, beliau berkata: Aku berada bersama Abu Bakrah di bawah mimbar Ibn 'Amir ketika beliau sedang menyampaikan khutbah, dan beliau memakai pakaian yang nipis.  Kemudian Abu Bilal berkata: \"Lihatlah Amir kita, beliau memakai pakaian orang yang fasik.\"  Lalu Abu Bakrah berkata: \"Diam! Aku mendengar Rasulullah SAW bersabda:  \"Barangsiapa menghina pemerintah yang dilantik Allah di bumi, nescaya Allah akan menghinanya.\"",
        "arabic_text": "وَعَن زِيادِ بنِ كُسَيبٍ العَدَوِيِّ قَالَ: كُنْتُ مَعَ أَبِي بَكْرَةَ تَحْتَ مِنْبَرِ ابْنِ عَامِرٍ وَهُوَ يَخْطُبُ وَعَلَيْهِ ثِيَابٌ رِقَاقٌ فَقَالَ أَبُو بِلَال: انْظُرُوا إِلَى أَمِير نايلبس ثِيَابَ الْفُسَّاقِ. فَقَالَ أَبُو بَكْرَةَ: اسْكُتْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُول: «مَنْ أَهَانَ سُلْطَانَ اللَّهِ فِي الْأَرْضِ أَهَانَهُ اللَّهُ» رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ"
      },
      {
        "id": 32390,
        "hadith_number": "3696",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ketaatan Tidak Diperbolehkan Jika Melanggar Perintah Allah",
        "perawi_melayu": "Nuwas bin Sim'an",
        "english_text": "From Nuwas bin Sim'an, who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: “There is no obedience to any created being in disobedience to the Creator.”",
        "malay_translation": "Dari Nuwas bin Sim'an, katanya: Rasulullah SAW bersabda:  “Tiada ketaatan kepada makhluk dalam keadaan menderhaka kepada Pencipta.”",
        "arabic_text": "وَعَنِ النَّوَّاسِ بْنِ سِمْعَانَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا طَاعَةَ لِمَخْلُوقٍ فِي مَعْصِيَةِ الْخَالِقِ» . رَوَاهُ فِي شَرْحِ السّنة"
      },
      {
        "id": 32391,
        "hadith_number": "3697",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pemimpin dan Keadilan di Hari Kiamat",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Narrated Abu Hurairah: The Messenger of Allah (peace and blessings of Allah be upon him) said: \"There is no leader of ten but he will be brought on the Day of Resurrection with his hand tied to his neck until justice releases him or injustice destroys him.\" Narrated by al-Darimi.",
        "malay_translation": "Daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: \"Tidak ada seorang pemimpin pun yang memimpin sepuluh orang melainkan dia akan dibawa pada Hari Kiamat dalam keadaan terbelenggu lehernya sehingga keadilannya melepaskannya atau kezalimannya membinasakannya.\" Riwayat ad-Darimi.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ أَمِيرِ عَشرَةٍ إِلا يُؤتى بِهِ يَوْمَ الْقِيَامَةِ مَغْلُولًا حَتَّى يُفَكَّ عَنْهُ الْعَدْلُ أَو يوبقه الْجور» . رَوَاهُ الدَّارمِيّ"
      },
      {
        "id": 32392,
        "hadith_number": "3698",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Azab Bagi Pemimpin Yang Zalim",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Not Available",
        "malay_translation": "Daripada hadis yang diriwayatkan, Rasulullah SAW bersabda: “Celakalah para pemimpin, celakalah para penguasa, dan celakalah para pemegang amanah! Sesungguhnya pada hari kiamat, ada segolongan manusia yang amat menyesal, sehingga mereka mengharapkan agar kepala mereka digantungkan di gugusan bintang Thuraiya, lalu mereka berayun-ayun antara langit dan bumi kerana tidak melakukan amal kebaikan.”  (Riwayat Imam Ahmad dan dalam kitab Syarh As-Sunnah).  Dalam riwayat lain: “…sehingga mereka mengharapkan agar rambut mereka digantungkan di gugusan bintang Thuraiya, lalu mereka berayun-ayun antara langit dan bumi kerana tidak melakukan apa-apa amal kebaikan.”",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَيْلٌ لِلْأُمَرَاءِ وَيْلٌ لِلْعُرَفَاءِ وَيْلٌ لِلْأُمَنَاءِ لَيَتَمَنَّيَنَّ أَقْوَامٌ يَوْمَ الْقِيَامَةِ أَنَّ نَوَاصِيَهُمْ مُعَلَّقَةٌ بِالثُّرَيَّا يَتَجَلْجَلُونَ بَيْنَ السَّمَاءِ وَالْأَرْضِ وَأَنَّهُمْ لَمْ يَلُوا عَمَلًا» . رَوَاهُ فِي «شَرْحِ السُّنَّةِ» وَرَوَاهُ أَحْمد وَفِي رِوَايَته: «أنَّ ذوائِبَهُم كَانَتْ مُعَلَّقَةً بِالثُّرَيَّا يَتَذَبْذَبُونَ بَيْنَ السَّمَاءِ وَالْأَرْضِ ولَمْ يَكُونُوا عُمِّلوا على شَيْء»"
      },
      {
        "id": 32393,
        "hadith_number": "3699",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ramalan Itu Benar, Namun Paranormal Akan Masuk Neraka",
        "perawi_melayu": "Ghalib al-Qattan melalui seorang lelaki daripada bapanya daripada datuknya",
        "english_text": "It was narrated from Ghalib al-Qattan from a man from his father from his grandfather who said: The Messenger of Allah (ﷺ) said: \"Indeed, divination is true, and people certainly have diviners, but the diviners are in the Fire.\"",
        "malay_translation": "Daripada Ghalib al-Qattan, melalui seorang lelaki daripada bapanya daripada datuknya, bahawa Baginda Rasulullah SAW bersabda:  \"Sesungguhnya ramalan itu benar, dan manusia pasti mempunyai peramal, tetapi peramal-peramal itu berada di dalam neraka.\"",
        "arabic_text": "وَعَنْ غَالِبٍ الْقَطَّانِ عَنْ رَجُلٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِن العرافة حق ولابد لِلنَّاسِ مِنْ عُرَفَاءَ وَلَكِنَّ الْعُرْفَاءَ فِي النَّارِ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32394,
        "hadith_number": "3700",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menjauhi Pemimpin Yang Jahat",
        "perawi_melayu": "Ka'b bin 'Ujrah",
        "english_text": "Not Available",
        "malay_translation": "Dari Ka'b bin 'Ujrah, katanya: Rasulullah SAW bersabda:  “Aku berlindung kepada Allah daripada pemerintahan orang-orang bodoh.”  Lalu dia bertanya: “Apakah maksudnya itu, wahai Rasulullah?” Baginda menjawab: “Para pemimpin yang akan datang selepasku; sesiapa yang datang kepada mereka dan mempercayai kepalsuan mereka serta membantu kezaliman mereka, maka mereka bukanlah daripada golonganku dan aku bukan daripada golongan mereka, dan mereka tidak akan sampai ke telaga (haudh)ku. Dan sesiapa yang tidak datang kepada mereka, dan tidak mempercayai kepalsuan mereka, dan tidak membantu kezaliman mereka, maka mereka adalah daripada golonganku dan aku adalah daripada golongan mereka, dan mereka akan sampai ke telaga (haudh)ku.” Riwayat Tirmizi dan Nasai.",
        "arabic_text": "وَعَنْ كَعْبِ بْنِ عُجْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أُعِيذُكَ بِاللَّهِ مِنْ إِمَارَةِ السُّفَهَاءِ» . قَالَ: وَمَا ذَاكَ يَا رَسُولَ اللَّهِ؟ قَالَ: «أُمَرَاءُ سَيَكُونُونَ مِنْ بَعْدِي مَنْ دَخَلَ عَلَيْهِمْ فَصَدَّقَهُمْ بِكَذِبِهِمْ وَأَعَانَهُمْ عَلَى ظُلْمِهِمْ فَلَيْسُوا مِنِّي وَلَسْتُ مِنْهُمْ وَلَنْ يَرِدُوا عليَّ الحوضَ وَمَنْ لَمْ يَدْخُلْ عَلَيْهِمْ وَلَمْ يُصَدِّقْهُمْ بِكَذِبِهِمْ وَلَمْ يُعِنْهُمْ عَلَى ظُلْمِهِمْ فَأُولَئِكَ مِنِّي وَأَنَا مِنْهُمْ وَأُولَئِكَ يَرِدُونَ عَلَيَّ الْحَوْضَ» . رَوَاهُ التِّرْمِذِيُّ وَالنَّسَائِيّ"
      },
      {
        "id": 32395,
        "hadith_number": "3701",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kesan Hidup di Padang Pasir, Mengejar Buruan, dan Mendekati Pemerintah",
        "perawi_melayu": "Ibnu Abbas daripada Nabi SAW",
        "english_text": "From Ibn Abbas from the Prophet (peace and blessings of Allah be upon him), he said: \"Whoever settles in the desert becomes hardened, and whoever follows hunting becomes negligent, and whoever approaches the sultan is tempted.\"",
        "malay_translation": "Daripada Ibnu Abbas daripada Nabi SAW, baginda bersabda:  \"Barang siapa yang menetap di padang pasir, dia akan menjadi keras hati; dan barang siapa yang mengejar buruan, dia akan menjadi lalai; dan barang siapa yang mendekati pemerintah, dia akan diuji (tergoda).\"  Dalam riwayat Abu Daud:  \"Barang siapa yang sentiasa bersama pemerintah, dia akan diuji; dan seorang hamba itu tidak akan semakin hampir dengan pemerintah melainkan dia akan semakin jauh daripada Allah.\" ",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ سَكَنَ الْبَادِيَةَ جَفَا وَمَنِ اتَّبَعَ الصَّيْدَ غَفَلَ وَمَنْ أَتَى السُّلْطَانَ افْتُتِنَ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَفِي رِوَايَةِ أَبِي دَاوُدَ: «مَنْ لَزِمَ السُّلْطَانَ افْتُتِنَ وَمَا ازْدَادَ عَبْدٌ مِنَ السُّلْطَانِ دُنُوًّا إِلَّا ازْدَادَ من اللَّهِ بُعداً»"
      },
      {
        "id": 32396,
        "hadith_number": "3702",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kejayaan Mukadam bin Ma'di Karib",
        "perawi_melayu": "Al-Muqaddam bin Ma'di Karib",
        "english_text": "Not Available",
        "malay_translation": "Daripada al-Muqaddam bin Ma'di Karib, bahawa Rasulullah SAW telah meletakkan tangan baginda di bahunya, kemudian bersabda:  “Engkau berjaya wahai Qudaim, jika engkau mati tanpa menjadi pemerintah, penulis, mahupun orang yang dikenali.”  Riwayat Abu Daud.",
        "arabic_text": "وَعَن المقدامِ بن معْدي كِربَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَرَبَ عَلَى مَنْكِبَيْهِ ثُمَّ قَالَ: «أَفْلَحْتَ يَا قُدَيْمُ إِنْ مُتَّ وَلَمْ تَكُنْ أَمِيرًا وَلَا كَاتبا وَلَا عريفا» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32397,
        "hadith_number": "3703",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Terhadap Pengutip Cukai Haram",
        "perawi_melayu": "Uqbah bin Amir",
        "english_text": "On the authority of Uqbah bin Amir, who said: The Messenger of Allah (peace and blessings of Allah be upon him) said, \"The collector of maks (illegal tax) will not enter Paradise,\" meaning the one who takes one-tenth (tax) from the people. Narrated by Ahmad, Abu Dawood, and Darimi.",
        "malay_translation": "Daripada Uqbah bin Amir RA, beliau berkata: Rasulullah ﷺ bersabda, \"Tidak akan masuk syurga pemilik maks (cukai haram),\" iaitu orang yang mengambil sepersepuluh (cukai) daripada orang ramai. Riwayat Ahmad, Abu Daud, dan Darimi.",
        "arabic_text": "وَعَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَدْخُلُ الْجَنَّةَ صَاحِبُ مَكْسٍ» : يَعْنِي الَّذِي يَعْشُرُ النَّاسَ. رَوَاهُ أَحْمد وَأَبُو دَاوُد والدارمي"
      },
      {
        "id": 32398,
        "hadith_number": "3704",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Imam yang Adil dan Zalim di Hari Kiamat",
        "perawi_melayu": "Abu Said al-Khudri",
        "english_text": "From Abu Said, it is narrated that the Messenger of Allah (ﷺ) said: \"Verily, the most beloved of people to Allah on the Day of Resurrection and the closest of them to Him in assembly is a just Imam. And verily, the most hated of people to Allah on the Day of Resurrection and the most severely punished of them is...",
        "malay_translation": "Dari Abu Said, diriwayatkan bahawa Rasulullah SAW bersabda:  \"Sesungguhnya manusia yang paling dicintai Allah pada hari kiamat dan yang paling dekat tempat duduknya dengan Allah ialah imam yang adil. Dan sesungguhnya manusia yang paling dibenci Allah pada hari kiamat dan yang paling berat azabnya ialah...\"  (Dalam satu riwayat lain disebutkan): “...dan yang paling jauh tempat duduknya dari Allah ialah imam yang zalim.\" Riwayat Tirmizi. Beliau berkata: Hadis ini adalah hadis hasan gharib.",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَحَبَّ النَّاسِ إِلَى اللَّهِ يَوْمَ الْقِيَامَةِ وَأَقْرَبَهُمْ مِنْهُ مَجْلِسًا إِمَامٌ عَادِلٌ وَإِنَّ أَبْغَضَ النَّاسِ إِلَى اللَّهِ يَوْمَ الْقِيَامَةِ وَأَشَدَّهُمْ عَذَابًا» وَفِي رِوَايَةٍ: «وَأَبْعَدَهُمْ مِنْهُ مَجْلِسًا إِمَامٌ جَائِرٌ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ"
      },
      {
        "id": 32399,
        "hadith_number": "3705",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Jihad Tertinggi: Berkata Benar di Hadapan Pemimpin Zalim",
        "perawi_melayu": "Daripada sumber-sumber yang sahih seperti Imam Tirmizi, Abu Daud dan Ibnu Majah.",
        "english_text": "And from him (it was narrated) that he said: The Messenger of Allah (ﷺ) said: “The best Jihad is to speak a word of truth in front of a tyrannical ruler.”",
        "malay_translation": "Daripada baginda (diriwayatkan bahawa) baginda berkata: Rasulullah SAW bersabda: “Jihad yang paling utama ialah berkata benar di hadapan pemerintah yang zalim.”",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَفْضَلُ الْجِهَادِ مَنْ قَالَ كَلِمَةَ حَقٍّ عِنْدَ سُلْطَانٍ جَائِرٍ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد وَابْن مَاجَه"
      },
      {
        "id": 32400,
        "hadith_number": "3706",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis Diriwayatkan oleh Ahmad dan An-Nasa'i daripada Tariq bin Shihab",
        "perawi_melayu": "Tariq bin Shihab",
        "english_text": "Narrated by Ahmad and An-Nasa'i from Tariq bin Shihab",
        "malay_translation": "Diriwayatkan oleh Ahmad dan An-Nasa'i daripada Tariq bin Shihab",
        "arabic_text": "وَرَوَاهُ أَحْمَدُ وَالنَّسَائِيُّ عَنْ طَارِقِ بْنِ شِهَابٍ"
      },
      {
        "id": 32401,
        "hadith_number": "3707",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menteri Yang Baik dan Menteri Yang Jahat",
        "perawi_melayu": "Aisyah r.a.",
        "english_text": "And from Aishah (RA) it is narrated that the Messenger of Allah (ﷺ) said: \"When Allah intends good for a ruler, He appoints for him a sincere minister; if he forgets, he reminds him, and if he remembers, he assists him. But if He intends otherwise, He appoints for him an evil minister; if he forgets, he does not remind him, and if he remembers, he does not assist him.\"",
        "malay_translation": "Daripada Aisyah r.a., katanya: Rasulullah SAW bersabda:  “Apabila Allah SWT berkehendak kebaikan kepada seorang pemerintah, maka Allah SWT akan melantik baginya seorang menteri yang ikhlas; jika dia lupa, menteri itu akan mengingatkannya, dan jika dia ingat, menteri itu akan membantunya.  Tetapi jika Allah SWT berkehendak sebaliknya, maka Allah SWT akan melantik baginya seorang menteri yang jahat; jika dia lupa, menteri itu tidak akan mengingatkannya, dan jika dia ingat, menteri itu tidak akan membantunya.”",
        "arabic_text": "وَعَنْ عَائِشَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَرَادَ اللَّهُ بِالْأَمِيرِ خَيْرًا جَعَلَ لَهُ وَزِيرَ صِدْقٍ إِنْ نَسِيَ ذَكَّرَهُ وَإِنْ ذَكَرَ أَعَانَهُ. وَإِذَا أَرَادَ بِهِ غَيْرَ ذَلِكَ جَعَلَ لَهُ وَزِيرَ سُوءٍ إِنْ نَسِيَ لَمْ يُذَكِّرْهُ وَإِنْ ذَكَرَ لَمْ يُعِنْهُ» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ"
      },
      {
        "id": 32402,
        "hadith_number": "3708",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pemimpin yang Mencari Kecurigaan dalam Kalangan Rakyat Akan Merosakkan Mereka",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Tiada teks Bahasa Inggeris",
        "malay_translation": "Daripada Abu Umamah RA, daripada Nabi SAW, baginda bersabda: “Sesungguhnya seorang pemimpin apabila mencari-cari keraguan (kesalahan) pada manusia, dia akan merosakkan mereka.” Riwayat Abu Daud.",
        "arabic_text": "وَعَنْ أَبِي أُمَامَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الْأَمِيرَ إِذَا ابْتَغَى الرِّيبَةَ فِي النَّاسِ أَفْسَدَهُمْ» . رَوَاهُ أَبُو دَاوُدَ"
      },
      {
        "id": 32403,
        "hadith_number": "3709",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mencari Kesalahan Orang Lain Akan Membinasakan Mereka",
        "perawi_melayu": "Muawiyah",
        "english_text": "And from Muawiyah, he said: I heard the Messenger of Allah (ﷺ) say: \"Indeed, when you follow the private faults of the people, you corrupt them.\"",
        "malay_translation": "Daripada Muawiyah, beliau berkata: Saya mendengar Rasulullah SAW bersabda:  \"Sesungguhnya jika kamu mencari aib orang lain, nescaya kamu akan merosakkan mereka.\"",
        "arabic_text": "وَعَنْ مُعَاوِيَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّكَ إِذَا اتَّبَعْتَ عَوْرَاتِ النَّاسِ أَفْسَدْتَهُمْ» . رَوَاهُ الْبَيْهَقِيُّ فِي «شُعَبِ الْإِيمَان»"
      },
      {
        "id": 32404,
        "hadith_number": "3710",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Anjuran Bersabar dengan Pemimpin Zalim",
        "perawi_melayu": "Abu Dharr",
        "english_text": "On the authority of Abu Dharr who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: 'How will you be when leaders after me monopolize this spoils of war (fay')?' I said: 'By Him Who sent you with the truth, I will put my sword on my shoulder and then strike with it until I meet you.' He said: 'Shall I not guide you to something better than that? Be patient until you meet me.' Reported by Abu Dawud.",
        "malay_translation": "Daripada Abu Dharr RA berkata: Rasulullah SAW bersabda: 'Bagaimana keadaan kamu apabila pemimpin-pemimpin selepas aku memonopoli harta rampasan perang (fay') ini?' Aku berkata: 'Demi Zat yang mengutusmu dengan kebenaran, aku akan meletakkan pedangku di bahuku kemudian aku akan memukul dengannya sehingga aku bertemu denganmu.' Baginda bersabda: 'Tidakkah aku tunjukkan kepadamu sesuatu yang lebih baik daripada itu? Bersabarlah sehingga kamu bertemu denganku.' Riwayat Abu Daud.",
        "arabic_text": "وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كَيْفَ أَنْتُمْ وَأَئِمَّةً مِنْ بَعْدِي يَسْتَأْثِرُونَ بِهَذَا الْفَيْءِ؟» . قُلْتُ: أَمَا وَالَّذِي بَعَثَكَ بِالْحَقِّ أَضَعُ سَيْفِي عَلَى عَاتِقِي ثُمَّ أَضْرِبُ بِهِ حَتَّى أَلْقَاكَ قَالَ: «أَوَلَا أَدُلُّكَ عَلَى خَيْرٍ مِنْ ذَلِكَ؟ تَصْبِرُ حَتَّى تَلقانِي» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32405,
        "hadith_number": "3711",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Orang-orang yang Mendapat Naungan Allah pada Hari Kiamat",
        "perawi_melayu": "Aisyah r.a daripada Rasulullah SAW",
        "english_text": "From Aisha (RA) from the Messenger of Allah (PBUH) who said: \"Do you know who are the foremost to the shade of Allah SWT on the Day of Judgment?\" They said: \"Allah and His Messenger know best.\" He said: \"Those who, when given the truth, accept it, and when asked for it, give it, and judge for the people as they would judge for themselves.\"",
        "malay_translation": "Daripada Aisyah r.a daripada Rasulullah SAW, baginda bersabda:  \"Adakah kamu tahu siapakah orang yang paling awal mendapat naungan Allah SWT pada hari kiamat?\" Mereka menjawab: \"Allah dan Rasul-Nya lebih mengetahui.\" Baginda bersabda: \"Mereka yang apabila diberikan kebenaran, mereka menerimanya, dan apabila diminta (kebenaran), mereka memberikannya, dan mereka menghakimi manusia sebagaimana mereka menghakimi diri mereka sendiri.\"",
        "arabic_text": "عَنْ عَائِشَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَتَدْرُونَ مَنِ السَّابِقُونَ إِلَى ظِلِّ اللَّهِ عَزَّ وَجَلَّ يَوْمَ الْقِيَامَةِ؟» قَالُوا: اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ: «الَّذِينَ إِذَا أُعْطُوا الْحَقَّ قَبِلُوهُ وَإِذَا سُئِلُوهُ بَذَلُوهُ وَحَكَمُوا لِلنَّاسِ كحكمِهم لأنفُسِهم»"
      },
      {
        "id": 32406,
        "hadith_number": "3712",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tiga Perkara yang Ditakuti Rasulullah SAW atas Umatnya",
        "perawi_melayu": "Jabir bin Samurah",
        "english_text": "And from Jabir ibn Samurah who said: I heard the Messenger of Allah, peace and blessings of Allah be upon him, say: 'There are three things I fear for my Ummah: seeking rain through the stars, the injustice of the ruler, and denying the divine decree.'",
        "malay_translation": "Daripada Jabir bin Samurah berkata: Aku mendengar Rasulullah SAW bersabda: 'Tiga perkara yang aku takutkan atas umatku: meminta hujan melalui bintang-bintang, ketidakadilan pemerintah, dan mendustakan takdir.'",
        "arabic_text": "وَعَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يَقُول: ثلاثةٌ أَخَافُ عَلَى أُمَّتِي: الِاسْتِسْقَاءُ بِالْأَنْوَاءِ وَحَيْفُ السُّلْطَانِ وَتَكْذيب الْقدر"
      },
      {
        "id": 32407,
        "hadith_number": "3713",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Petunjuk Nabi SAW kepada Abu Dzar",
        "perawi_melayu": "Abu Dzar al-Ghifari",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Dzar, katanya: Rasulullah SAW bersabda: “Enam hari lagi, wahai Abu Dzar, perhatikan apa yang akan Aku katakan kepadamu.”  Kemudian apabila tiba hari ketujuh, baginda bersabda: “Aku wasiatkan kepadamu agar bertaqwa kepada Allah SWT dalam perkara rahsia dan yang nyata. Dan jika engkau melakukan kesalahan, perbaikilah. Janganlah engkau meminta sesuatu daripada sesiapa pun, walaupun hanya sebatang rotan yang jatuh. Janganlah engkau memegang amanah dan janganlah engkau menjadi pengadil di antara dua orang.”",
        "arabic_text": "وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «سِتَّةَ أَيَّامٍ اعْقِلْ يَا أَبَا ذَرٍّ مَا يُقَالُ لَكَ بَعْدُ» فَلَمَّا كَانَ الْيَوْمُ السَّابِعُ قَالَ: «أُوصِيكَ بِتَقْوَى اللَّهِ فِي سِرِّ أَمْرِكَ وَعَلَانِيَتِهِ وَإِذَا أَسَأْتَ فَأَحْسِنْ وَلَا تَسْأَلَنَّ أَحَدًا شَيْئًا وَإِنْ سَقَطَ سَوْطُكَ وَلَا تَقْبِضْ أَمَانَةً وَلَا تَقْضِ بَيْنَ اثْنَيْنِ»"
      },
      {
        "id": 32408,
        "hadith_number": "3714",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tanggungjawab Pemimpin di Akhirat",
        "perawi_melayu": "Abu Umamah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Umamah daripada Nabi SAW bahawa baginda bersabda:  \"Tidak seorang pun yang mentadbir sepuluh orang atau lebih melainkan Allah SWT akan membawanya pada hari kiamat dengan tangannya terikat di lehernya.  Kebebasan baginya adalah dengan kebaikannya, atau dia akan dibebani dengan dosanya.  Permulaannya adalah celaan, pertengahannya adalah penyesalan, dan akhirnya adalah kehinaan pada hari kiamat.\"",
        "arabic_text": "وَعَنْ أَبِي أُمَامَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «مَا مِنْ رَجُلٍ يَلِي أَمْرَ عَشَرَةٍ فَمَا فَوْقَ ذَلِكَ إِلَّا أتاهُ اللَّهُ عزَّ وجلَّ مغلولاً يومَ القيامةِ يَدُهُ إِلَى عُنُقِهِ فَكَّهُ بِرُّهُ أَوْ أَوْبَقَهُ إِثْمُهُ أَوَّلُهَا مَلَامَةٌ وَأَوْسَطُهَا نَدَامَةٌ وَآخِرُهَا خِزْيٌ يومَ القيامةِ»"
      },
      {
        "id": 32409,
        "hadith_number": "3715",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Amanah dan Keadilan dalam Kepimpinan",
        "perawi_melayu": "Muawiyah",
        "english_text": "From Muawiyah, he said: The Messenger of Allah (peace and blessings be upon him) said: \"O Muawiyah, if you are appointed to a position of authority, then fear Allah and be just.\"",
        "malay_translation": "Daripada Muawiyah, beliau berkata: Rasulullah SAW bersabda:  “Wahai Muawiyah, jika engkau dilantik memegang suatu jawatan, maka bertakwalah kepada Allah dan berlaku adil.”",
        "arabic_text": "وَعَنْ مُعَاوِيَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا مُعَاوِيَةُ إِنْ وُلِّيتَ أَمْرًا فَاتَّقِ اللَّهَ وَاعْدِلْ» . قَالَ: فَمَا زِلْتُ أَظُنُّ أَنِّي مُبْتَلًى بِعَمَلٍ لِقَوْلِ النَّبِيِّ صَلَّى الله عَلَيْهِ وَسلم حَتَّى ابْتليت"
      },
      {
        "id": 32410,
        "hadith_number": "3716",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Berlindung Dari Awal Tujuh Puluh Tahun dan Pemerintahan Kanak-Kanak",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah (may Allah be pleased with him) reported: The Messenger of Allah (peace and blessings be upon him) said, 'Seek refuge in Allah from the beginning of the seventy years and the rule of young boys.' Ahmad narrated the six ahadith, and Al-Bayhaqi narrated the hadith of Mu'awiyah in 'Dala'il al-Nubuwwah'.",
        "malay_translation": "Daripada Abu Hurairah RA berkata: Rasulullah SAW bersabda, 'Berlindunglah kamu kepada Allah daripada awal tujuh puluh tahun dan pemerintahan kanak-kanak.' Ahmad meriwayatkan enam hadis ini, dan Al-Baihaqi meriwayatkan hadis Mu'awiyah dalam 'Dala'il al-Nubuwwah'.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَعَوَّذُوا بِاللَّهِ مِنْ رَأْسِ السَّبْعِينَ وَإِمَارَةِ الصِّبْيَانِ» . رَوَى الْأَحَادِيثَ السِّتَّةَ أَحْمَدُ وَرَوَى الْبَيْهَقِيُّ حَدِيثَ مُعَاوِيَةَ فِي «دَلَائِلِ النُّبُوَّة»"
      },
      {
        "id": 32411,
        "hadith_number": "3717",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pemerintahan Berdasarkan Kelakuan Rakyat",
        "perawi_melayu": "Yahya bin Hashim melalui Yunus bin Abi Ishaq daripada bapanya",
        "english_text": "And from Yahya ibn Hashim from Yunus ibn Abi Ishaq from his father, who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: \"As you are, so will you be ruled.\"",
        "malay_translation": "Daripada Yahya bin Hashim, daripada Yunus bin Abi Ishaq daripada bapanya, katanya: Rasulullah SAW bersabda:  \"Seperti keadaan kamu, demikianlah kamu akan diperintah.\"",
        "arabic_text": "وَعَنْ يَحْيَى بْنِ هَاشِمٍ عَنْ يُونُسَ بْنِ أَبِي إِسْحَاقَ عَنْ أَبِيهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كَمَا تَكُونُونَ كَذَلِك يُؤمر عَلَيْكُم»"
      },
      {
        "id": 32412,
        "hadith_number": "3718",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pemerintah Sebagai Naungan Allah di Bumi",
        "perawi_melayu": "Perawi tiada dinyatakan",
        "english_text": "Teks Bahasa Inggeris tiada",
        "malay_translation": "Daripada Ibn Umar RA bahawa Nabi SAW bersabda: \"Sesungguhnya pemerintah adalah naungan Allah di bumi, tempat berlindung bagi setiap orang yang dizalimi dari hamba-hamba-Nya. Jika dia berlaku adil, dia akan mendapat pahala dan rakyat wajib bersyukur. Jika dia zalim, dia akan menanggung dosa dan rakyat wajib bersabar.\"",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ السُّلْطَانَ ظِلُّ اللَّهِ فِي الْأَرْضِ يَأْوِي إِلَيْهِ كُلُّ مَظْلُومٍ مِنْ عِبَادِهِ فَإِذَا عَدَلَ كَانَ لَهُ الْأَجْرُ وَعَلَى الرَّعِيَّةِ الشُّكْرُ وَإِذَا جَارَ كَانَ عَلَيْهِ الْإِصْرُ وعَلى الرّعية الصَّبْر»"
      },
      {
        "id": 32413,
        "hadith_number": "3719",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Imam yang Adil dan Zalim di Hari Kiamat",
        "perawi_melayu": "Umar bin al-Khattab r.a.",
        "english_text": "Not Available",
        "malay_translation": "Daripada Umar bin al-Khattab r.a., katanya: Rasulullah SAW bersabda: \"Sesungguhnya sebaik-baik hamba Allah di sisi Allah kedudukannya pada hari kiamat ialah imam yang adil dan penyayang.  Dan sesungguhnya seburuk-buruk manusia di sisi Allah kedudukannya pada hari kiamat ialah imam yang zalim dan sewenang-wenang.\"",
        "arabic_text": "وَعَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَفْضَلَ عِبَادِ اللَّهِ عِنْدَ اللَّهِ مَنْزِلَةً يَوْمَ الْقِيَامَةِ إِمَامٌ عَادِلٌ رَفِيقٌ وَإِنَّ شَرَّ النَّاسِ عِنْدَ اللَّهِ مَنْزِلَةً يَوْمِ الْقِيَامَةِ إِمامٌ جَائِر خرق»"
      },
      {
        "id": 32414,
        "hadith_number": "3720",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Melihat Dengan Pandangan Menakutkan",
        "perawi_melayu": "Abdullah bin Amr",
        "english_text": "From Abdullah ibn Amr, he said: The Messenger of Allah (peace and blessings of Allah be upon him) said: \"Whoever looks at his brother with a look that frightens him, Allah will frighten him on the Day of Resurrection.\"",
        "malay_translation": "Daripada Abdullah bin Amr, beliau berkata: Rasulullah SAW bersabda:  \"Barangsiapa yang memandang saudaranya dengan pandangan yang menakutkannya, Allah akan menakutkannya pada hari kiamat.\" ",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «من نَظَرَ إِلَى أَخِيهِ نَظْرَةً يُخِيفُهُ أَخَافَهُ اللَّهُ يَوْمَ الْقِيَامَةِ» . رَوَى الْأَحَادِيثَ الْأَرْبَعَةَ الْبَيْهَقِيُّ فِي «شُعَبِ الْإِيمَانِ» وَقَالَ فِي حَدِيثِ يَحْيَى هَذَا: مُنْقَطع وَرِوَايَته ضَعِيف"
      },
      {
        "id": 32415,
        "hadith_number": "3721",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Allah SWT Mengawal Hati Raja-Raja",
        "perawi_melayu": "Abu Darda'",
        "english_text": "Abu Darda’ reported Allah’s Messenger (may peace be upon him) as having said: Allah, the Exalted, says: I am Allah, there is no god but I, the King of kings and the Lord of kings; the hearts of kings are in My hand. If My servants obey Me, I turn the hearts of their kings towards them with mercy and compassion, but if My servants disobey Me, I turn their hearts with wrath and vengeance, so that they inflict upon them the worst kind of torment. Therefore, do not engage yourselves in invoking curses upon kings, but engage yourselves in remembrance (of Allah) and supplication so that I may suffice you against your kings.",
        "malay_translation": "Abu Darda' meriwayatkan bahawa Rasulullah SAW bersabda:  Allah SWT berfirman:  \"Aku adalah Allah, tiada Tuhan melainkan Aku, Raja segala raja dan Tuhan segala raja; hati raja-raja berada di dalam kekuasaan-Ku. Jika hamba-hamba-Ku mentaati-Ku, Aku akan memalingkan hati raja-raja mereka kepada mereka dengan rahmat dan belas kasihan. Tetapi jika hamba-hamba-Ku menderhakai-Ku, Aku akan memalingkan hati mereka dengan kemurkaan dan hukuman, supaya mereka menimpakan azab yang paling buruk ke atas mereka. Oleh itu, janganlah kamu sibuk dengan mendoakan laknat ke atas raja-raja, tetapi sibukkanlah diri kamu dengan zikir dan permohonan supaya Aku mencukupi kamu daripada raja-raja kamu.\"",
        "arabic_text": "وَعَنْ أَبِي الدَّرْدَاءِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ اللَّهَ تَعَالَى يَقُولُ: أَنَا اللَّهُ لَا إِلَهَ إِلَّا أَنَا مَالِكُ الْمُلُوكِ وَمَلِكُ الْمُلُوكِ قُلُوبُ الْمُلُوكِ فِي يَدِي وَإِنَّ الْعِبَادَ إِذَا أَطَاعُونِي حَوَّلْتُ قُلُوبَ مُلُوكِهِمْ عَلَيْهِمْ بِالرَّحْمَةِ وَالرَّأْفَةِ وَإِنَّ الْعِبَادَ إِذَا عَصَوْنِي حَوَّلْتُ قُلُوبَهُمْ بِالسُّخْطَةِ وَالنِّقْمَةِ فَسَامُوهُمْ سُوءَ الْعَذَابِ فَلَا تَشْغَلُوا أَنْفُسَكُمْ بِالدُّعَاءِ عَلَى الْمُلُوكِ وَلَكِنِ اشْغَلُوا أَنْفُسَكُمْ بِالذِّكْرِ وَالتَّضَرُّعِ كَيْ أَكْفِيَكُمْ ملوكَكم «. رَوَاهُ أَبُو نُعَيْمٍ فِي» الْحِلْيَةِ"
      },
      {
        "id": 32416,
        "hadith_number": "3722",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Memberi Khabar Gembira dan Kemudahan dalam Misi",
        "perawi_melayu": "Abu Musa al-Ash'ari",
        "english_text": "From Abu Musa, he said: The Messenger of Allah (peace and blessings of Allah be upon him) when he sent one of his companions on an errand, said: \"Give glad tidings and do not repel, and make easy and do not make difficult.\"",
        "malay_translation": "Daripada Abu Musa, beliau berkata: Rasulullah SAW apabila mengutus salah seorang sahabatnya untuk suatu urusan, baginda bersabda:  \"Sampaikanlah berita gembira dan janganlah menolak (orang yang datang), dan mudahkanlah dan janganlah mempersulitkan.\"",
        "arabic_text": "عَنْ أَبِي مُوسَى قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا بَعَثَ أَحَدًا مِنْ أَصْحَابِهِ فِي بَعْضِ أَمْرِهِ قَالَ: «بَشِّرُوا وَلَا تُنَفِّرُوا وَيَسِّرُوا وَلَا تُعَسِّرُوا»"
      },
      {
        "id": 32417,
        "hadith_number": "3723",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kemudahan dan Kelembutan dalam Agama",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "And from Anas, he said: The Messenger of Allah (ﷺ) said: \"Make things easy and do not make them difficult, give glad tidings and do not repel [people]\".",
        "malay_translation": "Dari Anas, katanya: Rasulullah SAW bersabda:  “Mudahkanlah, dan janganlah kamu mempersulitkan; sampaikanlah berita gembira, dan janganlah kamu menolak (orang).”",
        "arabic_text": "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى الله عَلَيْهِ وَسلم: «يسوا وَلَا تُعَسِّرُوا وَسَكِّنُوا وَلَا تُنَفِّرُوا»"
      },
      {
        "id": 32418,
        "hadith_number": "3724",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kemudahan dan Kerjasama dalam Dakwah",
        "perawi_melayu": "Ibn Abi Burdah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Abi Burdah, katanya: Nabi SAW telah mengutus datuknya, Abu Musa dan Mu'az ke Yaman. Baginda bersabda: “Mudahkanlah kamu, dan janganlah kamu mempersulitkan; sampaikanlah berita gembira, dan janganlah kamu menolak; bekerjasamalah kamu, dan janganlah kamu berselisih.”",
        "arabic_text": "وَعَن ابنِ أَبِي بُرْدَةَ قَالَ: بَعَثَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَدَّهُ أَبَا مُوسَى وَمُعَاذًا إِلَى الْيَمَنِ فَقَالَ: «يَسِّرَا وَلَا تُعَسِّرَا وَبَشِّرَا وَلَا تُنَفِّرَا وَتَطَاوَعَا وَلَا تَخْتَلِفَا»"
      },
      {
        "id": 32419,
        "hadith_number": "3725",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Bendera Pengkhianat di Hari Kiamat",
        "perawi_melayu": "Ibn Umar",
        "english_text": "From Ibn Umar, that the Messenger of Allah (peace and blessings be upon him) said: “Indeed, for the betrayer, a banner will be erected on the Day of Resurrection, and it will be said: ‘This is the betrayal of so-and-so, son of so-and-so.’",
        "malay_translation": "Daripada Ibnu Umar, bahawa Rasulullah SAW bersabda:  “Sesungguhnya bagi pengkhianat, akan didirikan satu panji pada hari kiamat, dan akan dikatakan: ‘Inilah pengkhianatan si fulan bin si fulan.’”",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِنَّ الْغَادِرَ يُنْصَبُ لَهُ لِوَاءٌ يَوْمَ الْقِيَامَةِ فَيُقَالُ: هَذِهِ غَدْرَةُ فُلَانِ بْنِ فُلَانٍ"
      },
      {
        "id": 32420,
        "hadith_number": "3726",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tanda Pengkhianat di Hari Kiamat",
        "perawi_melayu": "Anas bin Malik daripada Nabi SAW",
        "english_text": "Not Available",
        "malay_translation": "Daripada Anas daripada Nabi Muhammad SAW, Baginda bersabda:  “Setiap pengkhianat akan mempunyai panji pada hari kiamat yang akan dikenali dengannya.”",
        "arabic_text": "وَعَنْ أَنَسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لِكُلِّ غَادِرٍ لِوَاءٌ يومَ القيامةِ يُعرَفُ بِهِ»"
      },
      {
        "id": 32421,
        "hadith_number": "3727",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_Hadith": "Bendera Pengkhianat di Hari Kiamat",
        "perawi_melayu": "Abu Said al-Khudri daripada Nabi SAW",
        "english_text": "From Abu Said from the Prophet (peace and blessings of Allaah be upon him), who said: “For every betrayer there is a banner on the Day of Resurrection.” In another narration: “For every betrayer there is a banner on the Day of Resurrection, raised for him according to the extent of his betrayal. Indeed, there is no betrayer greater than a ruler of the people.” Narrated by Muslim.",
        "malay_translation": "Daripada Abu Said daripada Nabi Muhammad SAW, baginda bersabda:  “Setiap pengkhianat akan mempunyai panji pada hari kiamat.”  Dalam riwayat lain: “Setiap pengkhianat akan mempunyai panji pada hari kiamat, yang dinaikkan setinggi-tinggi pengkhianatannya.  Sesungguhnya, tidak ada pengkhianat yang lebih besar daripada pemerintah umum.”  Riwayat Muslim.",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لِكُلِّ غَادِرٍ لِوَاءٌ عِنْدَ اسْتِهِ يَوْمَ الْقِيَامَةِ» . وَفِي رِوَايَةٍ: «لِكُلِّ غَادِرٍ لِوَاءٌ يَوْمَ الْقِيَامَةِ يُرْفَعُ لَهُ بِقَدْرِ غَدْرِهِ أَلا وَلَا غادر أعظم مِن أميرِ عامِّةٍ» . رَوَاهُ مُسلم"
      },
      {
        "id": 32422,
        "hadith_number": "3728",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ancaman bagi Pemimpin yang Mengabaikan Keperluan Rakyat",
        "perawi_melayu": "Amr bin Murrah",
        "english_text": "English text is not available.",
        "malay_translation": "Daripada 'Amr bin Murrah, bahawa beliau berkata kepada Mu'awiyah: Saya mendengar Rasulullah ﷺ bersabda: \"Sesiapa yang dilantik oleh Allah untuk menguruskan urusan kaum Muslimin, lalu dia menyembunyikan diri daripada keperluan, kemiskinan, dan kefakiran mereka, maka Allah akan menyembunyikan diri daripada keperluan, kemiskinan, dan kefakiran dirinya.\" Maka Mu'awiyah melantik seorang lelaki untuk menguruskan keperluan orang ramai. Riwayat Abu Daud dan at-Tirmidzi, dan dalam riwayat lain bagi beliau dan Ahmad: \"Allah akan menutup pintu-pintu langit baginya daripada kemiskinan, keperluan, dan kemelaratan dirinya.\"",
        "arabic_text": "عَنْ عَمْرِو بْنِ مُرَّةَ أَنَّهُ قَالَ لِمُعَاوِيَةَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: « (مَنْ وَلَّاهُ اللَّهُ شَيْئًا مِنْ أَمْرِ الْمُسْلِمِينَ فَاحْتَجَبَ دُونَ حَاجَتِهِمْ وَخَلَّتِهِمْ وَفَقْرِهِمُ احْتَجَبَ اللَّهُ دُونَ حَاجَتِهِ وَخَلَّتِهِ وَفَقْرِهِ» . فَجَعَلَ مُعَاوِيَةُ رَجُلًا عَلَى حَوَائِجِ النَّاسِ. رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَفِي رِوَايَةٍ لَهُ وَلِأَحْمَدَ: «أَغْلَقَ اللَّهُ لَهُ أَبْوَابَ السَّمَاءِ دُونَ خَلَّتِهِ وَحَاجَّتِهِ وَمَسْكَنَتِهِ»"
      },
      {
        "id": 32423,
        "hadith_number": "3729",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pintu Rahmat Allah Tertutup Bagi Pemimpin yang Menolak Rakyat",
        "perawi_melayu": "Abu Syammakh Azdi daripada saudara sepupunya yang merupakan sahabat Nabi SAW",
        "english_text": "From Abu Shammakh Al-Azdi from his cousin, one of the companions of the Prophet (peace and blessings of Allaah be upon him), that he came to Mu'awiyah and entered upon him, and he said: I heard the Messenger of Allaah (peace and blessings of Allaah be upon him) say: \"Whoever takes charge of some of the affairs of the people, then closes his door against the Muslims or the wronged or those in need, Allaah will close the doors of His mercy to him when he is in need and poverty, and he will be the most impoverished.\"",
        "malay_translation": "Daripada Abu Syammakh Azdi daripada saudara sepupunya, seorang daripada sahabat Nabi SAW, bahawa beliau telah datang kepada Muawiyah dan masuk menghadapnya, lalu berkata: Aku mendengar Rasulullah SAW bersabda:  \"Barangsiapa yang mentadbir sebahagian daripada urusan manusia, kemudian menutup pintu baginya terhadap orang Islam atau orang yang dizalimi atau orang yang memerlukan, nescaya Allah SWT akan menutup pintu rahmat-Nya ke atasnya apabila dia dalam kesusahan dan kemiskinan, dan dia akan menjadi orang yang paling fakir.\" ",
        "arabic_text": "عَنْ أَبِي الشَّمَّاخِ الْأَزْدِيِّ عَنِ ابْنِ عَمٍّ لَهُ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ أَتَى مُعَاوِيَةَ فَدَخَلَ عَلَيْهِ فَقَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ وَلِيَ مِنْ أَمْرِ النَّاسِ شَيْئًا ثُمَّ أَغْلَقَ بَابَهُ دُونَ الْمُسْلِمِينَ أَوِ الْمَظْلُومِ أَوْ ذِي الْحَاجَةِ أَغْلَقَ اللَّهُ دُونَهُ أَبْوَابَ رَحْمَتِهِ عِنْدَ حَاجَتِهِ وَفَقْرِهِ أَفْقَرَ مَا يَكُونُ إليهِ»"
      },
      {
        "id": 32424,
        "hadith_number": "3730",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Syarat Umar bin al-Khattab kepada Pegawainya",
        "perawi_melayu": "Umar bin al-Khattab",
        "english_text": "From 'Umar ibn al-Khattab (May Allah be pleased with him), that whenever he sent his officials, he stipulated upon them: \"Do not ride fine horses, do not eat choice foods, do not wear fine clothes, and do not close your doors to the needs of people. If you do any of these things, then punishment has become lawful against you.\" Then he would see them off.",
        "malay_translation": "Daripada Umar bin al-Khattab r.a., bahawa baginda apabila menghantar para pegawainya, baginda mensyaratkan kepada mereka: \"Janganlah kamu menunggang kuda yang halus, janganlah kamu memakan makanan yang pilihan, janganlah kamu memakai pakaian yang lembut, dan janganlah kamu menutup pintu kamu terhadap keperluan orang ramai. Jika kamu melakukan sesuatu daripada perkara ini, maka telah halal ke atas kamu seksa.\" Kemudian baginda akan mengiringi mereka. ",
        "arabic_text": "وَعَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ كَانَ إِذَا بَعَثَ عُمَّالَهُ شَرَطَ عَلَيْهِمْ: أَنْ لَا تَرْكَبُوا بِرْذَوْنًا وَلَا تَأْكُلُوا نَقِيًّا وَلَا تَلْبَسُوا رَقِيقًا وَلَا تُغْلِقُوا أَبْوَابَكُمْ دُونَ حَوَائِجِ النَّاسِ فَإِنْ فَعَلْتُمْ شَيْئًا مِنْ ذَلِكَ فَقَدْ حَلَّتْ بِكُمُ الْعُقُوبَةُ ثُمَّ يُشَيِّعُهُمْ. رَوَاهُمَا الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ"
      },
      {
        "id": 32425,
        "hadith_number": "3731",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hakim Tidak Boleh Menghakimi Ketika Marah",
        "perawi_melayu": "Abu Bakrah",
        "english_text": "From Abu Bakrah, he said: I heard the Messenger of Allah (peace and blessings be upon him) say: \"Let no judge judge between two people while he is angry.\"",
        "malay_translation": "Daripada Abu Bakrah, beliau berkata: Saya mendengar Rasulullah SAW bersabda:  \"Janganlah seorang hakim membuat keputusan di antara dua orang sedang dia dalam keadaan marah.\"",
        "arabic_text": "عَنْ أَبِي بَكْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا يَقْضِيَنَّ حَكَمٌ بَيْنَ اثْنَيْنِ وَهُوَ غَضْبَانُ»"
      },
      {
        "id": 32426,
        "hadith_number": "3732",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ganjaran Hakim yang Berijtihad",
        "perawi_melayu": "Abdullah bin Amr dan Abu Hurairah",
        "english_text": "From Abdullah ibn Amr and Abu Hurairah, they said: The Messenger of Allah (peace and blessings of Allah be upon him) said: “If a judge judges and strives his best and makes the right decision, he will have two rewards. And if he judges and strives his best but makes a mistake, he will have one reward.”",
        "malay_translation": "Daripada Abdullah bin Amr dan Abu Hurairah, mereka berkata: Rasulullah SAW bersabda:  “Apabila seorang hakim membuat keputusan dan berusaha sedaya upaya lalu tepat, maka baginya dua pahala. Dan apabila dia membuat keputusan dan berusaha sedaya upaya tetapi silap, maka baginya satu pahala.”",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو وَأَبِي هُرَيْرَةَ قَالَا: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا حَكَمَ الْحَاكِمُ فَاجْتَهَدَ فَأَصَابَ فَلَهُ أَجْرَانِ وَإِذَا حَكَمَ فَاجْتَهَدَ فَأَخْطَأَ فلهُ أجرٌ واحدٌ»"
      },
      {
        "id": 32427,
        "hadith_number": "3733",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kepayahan Menjadi Hakim",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "From Abu Hurairah, he said: The Messenger of Allah (peace and blessings of Allah be upon him) said: “Whoever is appointed as a judge among the people, he is sacrificed without a knife.”",
        "malay_translation": "Dari Abu Hurairah, beliau berkata: Rasulullah SAW bersabda:  “Barangsiapa yang dilantik menjadi hakim di kalangan manusia, maka sesungguhnya dia telah disembelih tanpa pisau.”",
        "arabic_text": "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مِنْ جُعِلَ قَاضِيًا بَيْنَ النَّاسِ فَقَدْ ذُبِحَ بِغَيْرِ سِكِّينٍ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ"
      },
      {
        "id": 32428,
        "hadith_number": "3734",
        "status": "Sahih",
        "nama_buku": "Mishkat al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Meminta Jawatan Hakim dan Kelebihan bagi yang Dipaksa",
        "perawi_melayu": "Anas",
        "english_text": "On the authority of Anas who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: 'Whoever seeks the position of judge and asks for it, he will be left to himself (i.e., without Allah's help). And whoever is compelled to it, Allah will send down an angel to guide him.' Reported by al-Tirmidhi, Abu Dawood, and Ibn Majah.",
        "malay_translation": "Daripada Anas RA berkata: Rasulullah SAW bersabda: 'Barangsiapa yang mencari jawatan kehakiman dan memintanya, dia akan diserahkan kepada dirinya sendiri (iaitu, tanpa pertolongan Allah). Dan barangsiapa yang dipaksa untuk menerimanya, Allah akan menurunkan malaikat kepadanya untuk membimbingnya.' Riwayat Tirmizi, Abu Daud, dan Ibn Majah.",
        "arabic_text": "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ ابْتَغَى الْقَضَاءَ وَسَأَلَ وُكِلَ إِلَى نَفْسِهِ وَمَنْ أُكْرِهَ عَلَيْهِ أَنْزَلَ اللَّهُ عَلَيْهِ مَلَكًا يُسَدِّدُهُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد وَابْن مَاجَه"
      },
      {
        "id": 32429,
        "hadith_number": "3735",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tiga Jenis Hakim: Syurga dan Neraka",
        "perawi_melayu": "Buraydah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Buraydah, beliau berkata: Rasulullah SAW bersabda: “Hakim itu ada tiga jenis: seorang di syurga dan dua di neraka. Adapun yang di syurga ialah orang yang mengetahui kebenaran lalu menghakiminya berdasarkan kebenaran itu. Dan orang yang mengetahui kebenaran tetapi berlaku zalim dalam penghakimannya, maka dia di neraka. Dan orang yang menghakimi manusia tanpa pengetahuan, maka dia juga di neraka.” Riwayat Abu Daud dan Ibnu Majah.",
        "arabic_text": "وَعَنْ بُرَيْدَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الْقُضَاةُ ثَلَاثَةٌ: وَاحِدٌ فِي الْجَنَّةِ وَاثْنَانِ فِي النَّارِ فَأَمَّا الَّذِي فِي الْجَنَّةِ فَرَجُلٌ عَرَفَ الْحَقَّ فَقَضَى بِهِ وَرَجُلٌ عَرَفَ الْحَقَّ فَجَارَ فِي الْحُكْمِ فَهُوَ فِي النَّارِ وَرَجُلٌ قَضَى لِلنَّاسِ عَلَى جَهْلٍ فَهُوَ فِي النَّارِ . رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ"
      },
      {
        "id": 32430,
        "hadith_number": "3736",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ganjaran Mencari Keadilan untuk Umat Islam",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah r.a., katanya: Rasulullah SAW bersabda:  “Barang siapa yang berusaha mencari keadilan bagi umat Islam sehingga dia berjaya, dan keadilannya mengatasi kezalimannya, maka baginya syurga. Dan barang siapa yang kezalimannya mengatasi keadilannya, maka baginya neraka.” Riwayat Abu Daud.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ طَلَبَ قَضَاءَ الْمُسْلِمِينَ حَتَّى يَنَالَهُ ثُمَّ غَلَبَ عَدْلُهُ جَوْرَهُ فَلَهُ الْجَنَّةُ وَمَنْ غَلَبَ جَوْرُهُ عَدْلَهُ فَلَهُ النَّار» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32431,
        "hadith_number": "3737",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Panduan Menghakimi: Mengikut Al-Quran, Sunnah, dan Ijtihad",
        "perawi_melayu": "Mu'adz bin Jabal",
        "english_text": "Not Available",
        "malay_translation": "Daripada Mu'adz bin Jabal, bahawa Rasulullah SAW ketika mengutusnya ke Yaman bertanya: \"Bagaimanakah engkau akan menghakimi sekiranya engkau dihadapkan dengan sesuatu permasalahan?\"  Jawab Mu'adz: \"Aku akan menghakimi dengan Kitabullah.\" Rasulullah SAW bertanya lagi: \"Sekiranya engkau tidak menjumpai sesuatu dalam Kitabullah?\" Jawabnya: \"Maka dengan Sunnah Rasulullah SAW.\" Rasulullah bertanya lagi: \"Sekiranya engkau tidak menjumpai sesuatu dalam Sunnah Rasulullah?\" Jawab Mu'adz: \"Aku akan berijtihad (berusaha sedaya upaya) dengan pendapatku dan aku tidak akan berputus asa.\"  Lalu Rasulullah SAW meletakkan tangannya di atas dada Mu'adz dan bersabda: \"Segala puji bagi Allah yang telah memberi taufik kepada utusan Rasulullah SAW kepada perkara yang diredai oleh Rasulullah SAW.\" Riwayat Tirmizi, Abu Daud dan Darimi.",
        "arabic_text": "وَعَنْ مُعَاذِ بْنِ جَبَلٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا بَعَثَهُ إِلَى الْيَمين قَالَ: «كَيْفَ تَقْضِي إِذَا عَرَضَ لَكَ قَضَاءٌ؟» قَالَ: أَقْضِي بِكِتَابِ اللَّهِ قَالَ: «فَإِنْ لَمْ تَجِدْ فِي كِتَابِ اللَّهِ؟» قَالَ: فَبِسُنَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «فَإِنْ لَمْ تَجِدْ فِي سُنَّةِ رَسُولِ اللَّهِ؟» قَالَ: أَجْتَهِدُ رَأْيِي وَلَا آلُو قَالَ: فَضَرَبَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى صَدْرِهِ وَقَالَ: «الْحَمْدُ لِلَّهِ الَّذِي وَفَّقَ رَسُولَ رَسُولِ اللَّهِ لِمَا يَرْضَى بِهِ رَسُولُ اللَّهِ» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد والدارمي"
      },
      {
        "id": 32432,
        "hadith_number": "3738",
        "status": "Sahih",
        "nama_buku": "Misykat al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Panduan Menjadi Hakim yang Adil",
        "perawi_melayu": "Ali RA",
        "english_text": "On the authority of Ali (may Allah be pleased with him) who said: The Messenger of Allah (peace and blessings of Allah be upon him) sent me to Yemen as a judge. I said, 'O Messenger of Allah, you are sending me when I am young and have no knowledge of judging?' He said, 'Allah will guide your heart and make your tongue steadfast. When two litigants come to you, do not judge in favor of the first until you hear the statement of the second, for it is more likely that the judgment will become clear to you.' He said, 'After that, I never doubted any judgment.' Related by al-Tirmidhi, Abu Dawud, and Ibn Majah. And we will mention the hadith of Umm Salamah: 'I only judge between you based on my opinion' in the chapter 'Judgments and Testimonies,' if Allah wills.",
        "malay_translation": "Daripada Ali RA berkata: Rasulullah SAW telah mengutus aku ke Yaman sebagai hakim (kadi). Maka aku berkata: 'Wahai Rasulullah, Engkau mengutusku sedangkan aku masih muda dan tidak memiliki ilmu tentang kehakiman?' Baginda bersabda: 'Sesungguhnya Allah akan memberi hidayah kepada hatimu dan meneguhkan lidahmu. Apabila dua orang mengadu kepadamu, janganlah kamu memutuskan hukuman untuk yang pertama sebelum kamu mendengar perkataan yang lain. Kerana yang demikian itu lebih layak untuk menjelaskan kepadamu keputusan (hukum) yang sebenar.' Ali berkata: 'Maka sejak itu, aku tidak pernah ragu dalam memutuskan suatu perkara (hukum).' [Diriwayatkan oleh Tirmidzi, Abu Daud, dan Ibnu Majah. Dan kami akan menyebutkan hadis Ummu Salamah: 'Sesungguhnya aku memutuskan di antara kamu dengan pendapatku,' dalam bab 'Keputusan dan Persaksian,' insya Allah Ta'ala.]",
        "arabic_text": "عَن عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَمَنِ قَاضِيًا فَقُلْتُ: يَا رَسُولَ اللَّهِ تُرْسِلُنِي وَأَنَا حَدِيثُ السِّنِّ وَلَا عِلْمَ لِي بِالْقَضَاءِ؟ فَقَالَ: «إِنَّ اللَّهَ سَيَهْدِي قَلْبَكَ وَيُثَبِّتُ لِسَانَكَ إِذَا تَقَاضَى إِلَيْكَ رَجُلَانِ فَلَا تَقْضِ لِلْأَوَّلِ حَتَّى تَسْمَعَ كَلَامَ الْآخَرِ فَإِنَّهُ أَحْرَى أَنْ يَتَبَيَّنَ لَكَ الْقَضَاءُ» . قَالَ: فَمَا شَكَكْتُ فِي قَضَاءٍ بَعْدُ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَسَنَذْكُرُ حَدِيثَ أُمِّ سَلَمَةَ: «إِنَّمَا أَقْضِي بَيْنَكُمْ برأيي» فِي بَابِ «الْأَقْضِيَةِ وَالشَّهَادَاتِ» إِنْ شَاءَ اللَّهُ تَعَالَى"
      },
      {
        "id": 32433,
        "hadith_number": "3739",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Akibat Hakim yang Zalim pada Hari Kiamat",
        "perawi_melayu": "Abdullah bin Mas'ud",
        "english_text": "From Abdullah ibn Mas'ud, who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: \"There is no ruler who judges among the people except that he will come on the Day of Resurrection, and an angel will take him by the back of his neck, then raise his head to the sky. If he says, 'Throw him,' he will be thrown into a pit for forty autumns.\"",
        "malay_translation": "Daripada Abdullah bin Mas'ud, yang berkata: Rasulullah SAW bersabda:  \"Tiada seorang pemerintah pun yang menghakimi di antara manusia melainkan dia akan datang pada hari kiamat, dan seorang malaikat akan memegang tengkuknya, kemudian mengangkat kepalanya ke langit. Jika (malaikat) berkata, 'Campakkanlah dia,' maka dia akan dicampakkan ke dalam neraka selama empat puluh musim luruh.\"",
        "arabic_text": "عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَا مِنْ حَاكِمٍ يَحْكُمُ بَيْنَ النَّاسِ إِلَّا جَاءَ يَوْمَ الْقِيَامَةِ وَمَلَكٌ آخِذٌ بِقَفَاهُ ثُمَّ يَرْفَعُ رَأْسَهُ إِلَى السَّمَاءِ فَإِنْ قَالَ: أَلْقِهْ أَلْقَاهُ فِي مَهْوَاةٍ أَرْبَعِينَ خَرِيفًا . رَوَاهُ أَحْمَدُ وَابْنُ مَاجَهْ والْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَان"
      },
      {
        "id": 32434,
        "hadith_number": "3740",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kepayahan Hakim yang Adil di Hari Kiamat",
        "perawi_melayu": "Aisyah r.a. daripada Rasulullah SAW",
        "english_text": "From Aisha (RA) from the Messenger of Allah (PBUH), he said: \"The just judge will come on the Day of Judgement wishing that he had never judged between two people over a single date.\"",
        "malay_translation": "Daripada Aisyah r.a., daripada Rasulullah SAW, baginda bersabda:  \"Hakim yang adil akan datang pada hari kiamat, dia akan berharap dia tidak pernah menghakimi di antara dua orang mengenai sebiji tamar pun.\"",
        "arabic_text": "وَعَنْ عَائِشَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَيَأْتِيَنَّ عَلَى الْقَاضِي الْعَدْلِ يومُ القيامةِ يَتَمَنَّى أَنَّهُ لَمْ يَقْضِ بَيْنَ اثْنَيْنِ فِي تَمْرَة قطّ» . رَوَاهُ أَحْمد"
      },
      {
        "id": 32435,
        "hadith_number": "3741",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Allah Bersama Hakim Selagi Tidak Zalim",
        "perawi_melayu": "Abdullah ibn Abi Aufa",
        "english_text": "On the authority of Abdullah ibn Abi Awfa, who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: 'Indeed, Allah is with the judge as long as he does not act unjustly. If he acts unjustly, He abandons him and the devil stays with him.' It was narrated by at-Tirmidhi and Ibn Majah. And in a narration: 'If he acts unjustly, He entrusts him to himself.'",
        "malay_translation": "Daripada Abdullah ibn Abi Aufa, beliau berkata: Rasulullah ﷺ bersabda: 'Sesungguhnya Allah bersama hakim selagi dia tidak berlaku zalim. Sekiranya dia berlaku zalim, Allah akan meninggalkannya dan syaitan akan menemaninya.' Riwayat at-Tirmidhi dan Ibn Majah. Dan dalam riwayat lain: 'Sekiranya dia berlaku zalim, Allah menyerahkan urusannya kepada dirinya sendiri.'",
        "arabic_text": "وَعَنْ عَبْدُ اللَّهِ بْنِ أَبِي أَوْفَى قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ مَعَ الْقَاضِي مَا لَمْ يَجُرْ فَإِذَا جَارَ تَخَلَّى عَنْهُ وَلَزِمَهُ الشَّيْطَانُ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَفِي رِوَايَةٍ: «فَإِذَا جارَ وَكله إِلَى نَفسه»"
      },
      {
        "id": 32436,
        "hadith_number": "3742",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keadilan Umar dan Pengakuan Seorang Yahudi Berdasarkan Taurat",
        "perawi_melayu": "Said ibn al-Musayyab",
        "english_text": "And from Sa'id ibn al-Musayyab: that a Muslim and a Jew argued before Umar, and Umar saw that the right was with the Jew, so Umar judged in his favour. The Jew said to him, 'By Allah, you have judged justly.' So Umar struck him with his whip and said, 'What makes you know?' The Jew said, 'By Allah, we find in the Torah that there is no judge who judges justly except that there is an angel on his right and an angel on his left who guide him and lead him to the truth as long as he is with the truth, but if he leaves the truth, they ascend and leave him.' Narrated by Malik.",
        "malay_translation": "Daripada Sa'id ibn al-Musayyab: bahawa seorang Muslim dan seorang Yahudi bertikai di hadapan Umar, dan Umar melihat kebenaran itu berpihak kepada Yahudi, lalu Umar memutuskan hukuman memihak kepadanya. Yahudi itu berkata kepadanya, 'Demi Allah, engkau telah menghukum dengan adil.' Lalu Umar memukulnya dengan cemeti dan berkata, 'Apa yang membuatmu tahu?' Yahudi itu berkata, 'Demi Allah, sesungguhnya kami dapati dalam Taurat bahawa tidak ada hakim yang menghukum dengan adil kecuali ada malaikat di sebelah kanannya dan malaikat di sebelah kirinya yang membimbing dan menuntunnya kepada kebenaran selama dia bersama kebenaran, tetapi jika dia meninggalkan kebenaran, mereka akan naik dan meninggalkannya.' Diriwayatkan oleh Malik.",
        "arabic_text": "وَعَنْ سَعِيدِ بْنِ الْمُسَيَّبِ: أَنَّ مُسْلِمًا وَيَهُودِيًّا اخْتَصَمَا إِلَى عُمَرَ فَرَأَى الْحَقَّ لِلْيَهُودِيِّ فَقَضَى لَهُ عُمَرُ بِهِ فَقَالَ لَهُ الْيَهُودِيُّ: وَاللَّهِ لَقَدْ قَضَيْتَ بِالْحَقِّ فَضَرَبَهُ عُمَرُ بِالدِّرَّةِ وَقَالَ: وَمَا يُدْريكَ؟ فَقَالَ الْيَهُودِيُّ: وَاللَّهِ إِنَّا نَجِدُ فِي التَّوْرَاةِ أَنَّهُ لَيْسَ قَاضٍ يَقْضِي بِالْحَقِّ إِلَّا كَانَ عَنْ يَمِينِهِ مَلَكٌ وَعَنْ شِمَالِهِ مَلَكٌ يُسَدِّدَانِهِ وَيُوَفِّقَانِهِ لِلْحَقِّ مَا دَامَ مَعَ الْحَقِّ فَإِذَا تركَ الحقَّ عرَجا وترَكاهُ. رَوَاهُ مَالك"
      },
      {
        "id": 32437,
        "hadith_number": "3743",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keengganan Ibn Umar Menjadi Hakim",
        "perawi_melayu": "Ibn Mūhab",
        "english_text": "From Ibn Mūhab: That ‘Uthman ibn ‘Affan (may Allah be pleased with him) said to Ibn ‘Umar: ‘Judge between people.’ He said: ‘Or will you punish me, O Amir al-Mu’minin?’ He said: ‘And what do you dislike about that, and your father was a judge?’ He said: ‘Because I heard the Messenger of Allah (ﷺ) say: “Whoever judges and judges justly, then verily he will return from it with a full reward.”’ So he did not press him further after that.  Narrated by Tirmidhi.",
        "malay_translation": "Daripada Ibnu Mūhab: bahawa Uthman bin Affan r.a. berkata kepada Ibnu Umar: “Hakimi di antara manusia.”  Beliau berkata: “Atau adakah engkau akan menghukumku wahai Amirul Mukminin?”  Baginda berkata: “Apakah yang engkau tidak sukai tentang perkara itu, sedangkan ayahmu seorang hakim?”  Beliau berkata: “Kerana aku mendengar Rasulullah SAW bersabda:  “Barangsiapa yang menjadi hakim dan memberi keputusan dengan adil, maka sesungguhnya dia akan kembali dengan ganjaran yang penuh.”  Maka baginda tidak mendesaknya lagi selepas itu. Riwayat Tirmizi.",
        "arabic_text": "وَعَنِ ابْنِ مَوْهَبٍ: أَنَّ عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ قَالَ لِابْنِ عُمَرَ: اقْضِ بَين النَّاس قَالَ: أَو تعاقبني يَا أَمِيرَ الْمُؤْمِنِينَ؟ قَالَ: وَمَا تَكْرَهُ مِنْ ذَلِك وَقد كَانَ أَبوك قَاضِيا؟ قَالَ: لِأَنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ كَانَ قَاضِيًا فَقَضَى بِالْعَدْلِ فَبِالْحَرِيِّ أَنْ يَنْقَلِبَ مِنْهُ كَفَافًا» . فَمَا راجعَه بعدَ ذَلِك. رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 32438,
        "hadith_number": "3744",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mencari Panduan daripada Allah SWT dalam Menghadapi Kesukaran",
        "perawi_melayu": "Riwayat Razin daripada Nafi'",
        "english_text": "Not Available",
        "malay_translation": "Dalam riwayat Razin daripada Nafi’, bahawa Ibnu Umar berkata kepada Uthman: Wahai Amirul Mukminin, aku tidak akan menghakimi di antara dua orang lelaki.  Uthman berkata:  Bapa kamu pernah menghakimi. Ibnu Umar menjawab:  Jika ayahku menghadapi kesukaran dalam sesuatu perkara, dia akan bertanya kepada Rasulullah SAW.  Jika Rasulullah SAW menghadapi kesukaran, baginda akan bertanya kepada Jibril AS.  Dan aku tidak menemui sesiapa yang boleh kutanya. Aku pernah mendengar Rasulullah SAW bersabda:  “Barangsiapa yang berlindung kepada Allah, maka sesungguhnya dia telah berlindung kepada sesuatu yang Maha Agung.”  Dan aku juga pernah mendengar baginda bersabda:  “Barangsiapa yang berlindung kepada Allah, maka lindungilah dia.”  Aku berlindung kepada Allah daripada diangkat menjadi hakim, lalu dibebaskannya.  Kemudian dia berkata: Jangan beritahu sesiapa.",
        "arabic_text": "وَفِي رِوَايَةِ رَزِينٍ عَنْ نَافِعٍ أَنَّ ابْنَ عُمَرَ قَالَ لِعُثْمَانَ: يَا أَمِيرَ الْمُؤْمِنِينَ لَا أَقْضِي بَيْنَ رَجُلَيْنِ: قَالَ: فَإِنَّ أَبَاكَ كَانَ يَقْضِي فَقَالَ: إِنَّ أَبِي لَوْ أُشْكِلَ عَلَيْهِ شَيْءٌ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَوْ أُشْكِلَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْءٌ سَأَلَ جِبْرِيلَ عَلَيْهِ السَّلَامُ وَإِنِّي لَا أَجِدُ مَنْ أَسْأَلُهُ وَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ عَاذَ بِاللَّهِ فَقَدْ عَاذَ بِعَظِيمٍ» . وَسَمِعْتُهُ يَقُولُ: «مَنْ عَاذَ بِاللَّهِ فَأَعِيذُوهُ» . وَإِنِّي أَعُوذُ باللَّهِ أنْ تجعلَني قاضِياً فأعْفاهُ وَقَالَ: لَا تُخبرْ أحدا"
      },
      {
        "id": 32439,
        "hadith_number": "3745",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah: Pembahagi yang Diperintahkan",
        "perawi_melayu": "Tiada dinyatakan",
        "english_text": "Teks Bahasa Inggeris tiada",
        "malay_translation": "Daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: \"Aku tidak memberi kepada kamu dan tidak menahan daripada kamu, aku hanyalah seorang pembahagi yang meletakkan sesuatu di tempat yang aku diperintahkan.\" Riwayat Bukhari.",
        "arabic_text": "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا أُعْطِيكُمْ وَلَا أَمْنَعُكُمْ أَنَا قَاسِمٌ أَضَعُ حَيْثُ أُمِرْتُ» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32440,
        "hadith_number": "3746",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Azab Neraka bagi Mereka yang Menyalahgunakan Harta Allah",
        "perawi_melayu": "Khawlah al-Ansariyyah",
        "english_text": "And from Khawlah al-Ansariyyah, she said: The Messenger of Allah (ﷺ) said: \"Indeed, there are men who squander the wealth of Allah without right, so for them is the Fire on the Day of Resurrection.\"",
        "malay_translation": "Daripada Khawlah al-Ansariyyah, baginda berkata: Rasulullah SAW bersabda:  \"Sesungguhnya, ada lelaki yang membazirkan harta Allah tanpa hak, maka bagi mereka neraka pada hari kiamat.\" ",
        "arabic_text": "وَعَن خَوْلةَ الْأَنْصَارِيَّةِ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ رِجَالًا يَتَخَوَّضُونَ فِي مَالِ اللَّهِ بِغَيْرِ حَقٍّ فَلَهُمُ النَّارُ يَوْمَ الْقِيَامَةِ» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32441,
        "hadith_number": "3747",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kehidupan Abu Bakar Setelah Menjadi Khalifah",
        "perawi_melayu": "Aisyah r.a.",
        "english_text": "And from Aisha, she said: When Abu Bakr became Caliph, he said: My people know that my profession never failed to support my family, and I am now occupied with the affairs of the Muslims, so the family of Abu Bakr will eat from this wealth and will work for the Muslims.",
        "malay_translation": "Daripada Aisyah r.a., beliau berkata:  Apabila Abu Bakar r.a. menjadi Khalifah, baginda berkata: “Sesungguhnya kaumku mengetahui bahawa kerjaku tidak pernah gagal untuk menampung keperluan keluargaku, dan kini aku sibuk dengan urusan orang Islam, maka keluarga Abu Bakar akan makan daripada harta ini dan akan bekerja untuk orang Islam.” Riwayat Bukhari.",
        "arabic_text": "وَعَن عائشةَ قَالَتْ: لِمَّا اسْتُخْلِفَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: لَقَدْ عَلِمَ قَوْمِي أَنَّ حِرْفَتِي لم تكنْ تعجِزُ عَن مَؤونةِ أَهْلِي وَشُغِلْتُ بِأَمْرِ الْمُسْلِمِينَ فَسَيَأْكُلُ آلُ أَبِي بَكْرٍ مِنْ هَذَا الْمَالِ وَيَحْتَرِفُ لِلْمُسْلِمِينَ فِيهِ. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32442,
        "hadith_number": "3748",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ghaful Daripada Harta Baitulmal",
        "perawi_melayu": "Daripada Buraidah daripada Nabi SAW",
        "english_text": "From Buraida from the Prophet (peace and blessings of Allaah be upon him), who said:  “Whoever we appoint to a post and give him a salary, then whatever he takes after that is misappropriation.” Reported by Abu Dawud",
        "malay_translation": "Daripada Buraidah daripada Nabi SAW, baginda bersabda:  “Barangsiapa yang kami lantik kepada sesuatu jawatan dan kami berikan kepadanya gaji, maka apa sahaja yang diambilnya selepas itu adalah merupakan penyelewengan.” Riwayat Abu Daud.",
        "arabic_text": "عَن بُرَيْدَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنِ اسْتَعْمَلْنَاهُ عَلَى عَمَلٍ فَرَزَقْنَاهُ رِزْقًا فَمَا أَخَذَ بَعْدَ ذَلِكَ فَهُوَ غُلُولٌ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32443,
        "hadith_number": "3749",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Amalan Umar di Zaman Rasulullah",
        "perawi_melayu": "Umar bin al-Khattab r.a.",
        "english_text": "From Umar (may Allah be pleased with him), who said: \"I worked during the time of the Messenger of Allah (peace and blessings of Allah be upon him).\"",
        "malay_translation": "Daripada Umar r.a., katanya:  \"Aku telah bekerja pada zaman Rasulullah SAW.\"",
        "arabic_text": "وَعَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُ قَالَ: عَمِلْتُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فعملني. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32444,
        "hadith_number": "3750",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mengambil Sesuatu Tanpa Izin Rasulullah",
        "perawi_melayu": "Mu'az bin Jabal",
        "english_text": "And from Mu'adh, he said: The Messenger of Allah ﷺ sent me to Yemen. When I had set out, he sent after me and I was recalled. He said: \"Do you know why I sent you? Do not take anything without my permission, for that is misappropriation. And whoever misappropriates will come on the Day of Resurrection carrying what he has misappropriated.\" ",
        "malay_translation": "Daripada Mu'az, beliau berkata: Rasulullah SAW telah mengutusku ke Yaman. Setelah aku berangkat, baginda menghantar orang untuk memanggilku kembali. Baginda bersabda: \"Adakah engkau tahu mengapa aku mengutusmu? Janganlah engkau mengambil sesuatu tanpa izinKu, kerana itu adalah perbuatan merampas. Dan sesiapa yang merampas akan datang pada hari kiamat membawa apa yang telah di rampasnya.\" Riwayat Tirmizi.",
        "arabic_text": "وَعَن مُعَاذٍ قَالَ: بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَمَنِ فَلَمَّا سِرْتُ أَرْسَلَ فِي أَثَرِي فَرُدِدْتُ فَقَالَ: «أَتَدْرِي لِمَ بَعَثْتُ إِلَيْكَ؟ لَا تُصِيبَنَّ شَيْئًا بِغَيْرِ إِذْنِي فَإِنَّهُ غُلُولٌ وَمَنْ يَغْلُلْ يَأْتِ بِمَا غَلَّ يَوْمَ الْقِيَامَةِ لهَذَا دعوتك فَامْضِ لعملك» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 32445,
        "hadith_number": "3751",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mencari Rezeki: Isteri, Hamba dan Tempat Tinggal",
        "perawi_melayu": "Al-Mustawrid bin Syaddad",
        "english_text": "From Al-Mustawrid bin Syaddad, who said: I heard the Prophet (peace and blessings of Allah be upon him) say: “Whoever works for us, let him acquire a wife; and if he has no servant, let him acquire a servant; and if he has no dwelling place, let him acquire a dwelling place.” In another narration: “Whoever takes other than that, then he is wasteful.” Reported by Abu Dawud.",
        "malay_translation": "Daripada Al-Mustawrid bin Syaddad, katanya: Aku mendengar Nabi SAW bersabda:  “Barang siapa yang bekerja untuk kita, hendaklah dia mendapatkan isteri; dan jika dia tidak mempunyai hamba, hendaklah dia mendapatkan hamba; dan jika dia tidak mempunyai tempat tinggal, hendaklah dia mendapatkan tempat tinggal.”  Dalam riwayat lain: “Barang siapa mengambil selain daripada itu, maka dia adalah seorang yang pembazir.” Riwayat Abu Daud.",
        "arabic_text": "وَعَن المستَوْرِدِ بنِ شدَّادٍ قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ كَانَ لَنَا عَامِلًا فَلْيَكْتَسِبْ زَوْجَةً فَإِنْ لَمْ يَكُنْ لَهُ خَادِمٌ فَلْيَكْتَسِبْ خَادِمًا فَإِنْ لَمْ يَكُنْ لَهُ مَسْكَنٌ فَلْيَكْتَسِبْ مَسْكَنًا» . وَفِي رِوَايَةٍ: «مَنِ اتَّخَذَ غَيْرَ ذَلِكَ فَهُوَ غالٌّ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32446,
        "hadith_number": "3752",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Amanah dalam Jawatan dan Larangan Khianat",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "On the authority of 'Adi bin 'Amirah, that the Messenger of Allah (peace and blessings of Allah be upon him) said: \"O people, whoever among you is appointed by us to a position and he conceals from us even a needle or more than that, he is a betrayer who will bring it on the Day of Resurrection.\" Then a man from the Ansar stood up and said: \"O Messenger of Allah, accept your position back from me.\" He said: \"What is that?\" He said: \"I heard you say such and such.\" He said: \"And I say that now; whoever we appoint to a position, let him bring all of it, little and much, and whatever he is given from it, let him take, and whatever he is forbidden from, let him abstain.\" Narrated by Muslim and Abu Dawud, and the wording is his (Abu Dawud's).",
        "malay_translation": "Daripada 'Adi bin 'Amirah, bahawa Rasulullah صلى الله عليه وسلم bersabda: \"Wahai manusia, sesiapa antara kamu yang kami lantik untuk sesuatu pekerjaan, lalu dia menyembunyikan daripada kami walaupun sebatang jarum atau lebih daripada itu, maka dia adalah pengkhianat yang akan membawa (khianat) itu pada Hari Kiamat.\" Kemudian seorang lelaki dari Ansar berdiri dan berkata: \"Wahai Rasulullah, terimalah kembali jawatanmu daripadaku.\" Baginda bersabda: \"Apa itu?\" Dia berkata: \"Saya mendengar engkau bersabda begini dan begini.\" Baginda bersabda: \"Dan aku berkata demikian sekarang; sesiapa yang kami lantik untuk sesuatu pekerjaan, hendaklah dia membawa semua (harta) itu, sedikit atau banyak, dan apa sahaja yang diberikan kepadanya daripadanya, hendaklah dia ambil, dan apa sahaja yang dilarang daripadanya, hendaklah dia berhenti.\" Riwayat Muslim dan Abu Daud, dan lafaznya adalah lafaz Abu Daud.",
        "arabic_text": "وَعَن عَدِيِّ بنِ عَمِيرةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَا أَيُّهَا النَّاسُ مَنْ عُمِّلَ مِنْكُمْ لَنَا عَلَى عَمَلٍ فَكَتَمَنَا مِنْهُ مِخْيَطًا فَمَا فَوْقَهُ فَهُوَ غَالٌّ يَأْتِي بِهِ يَوْمَ الْقِيَامَةِ» . فَقَامَ رَجُلٌ مِنَ الْأَنْصَارِ فَقَالَ: يَا رَسُولَ اللَّهِ اقْبَلْ عَنِّي عَمَلَكَ. قَالَ: «وَمَا ذَاكَ؟» قَالَ: سَمِعْتُكَ تَقُولُ: كَذَا وَكَذَا قَالَ: «وَأَنَا أَقُولُ ذَلِكَ مَنِ اسْتَعْمَلْنَاهُ عَلَى عَمَلٍ فَلْيَأْتِ بِقَلِيلِهِ وَكَثِيرِهِ فَمَا أُوتِيَ مِنْهُ أَخَذَهُ وَمَا نُهِيَ عَنْهُ انْتَهَى» . رَوَاهُ مُسْلِمٌ وَأَبُو دَاوُد وَاللَّفْظ لَهُ"
      },
      {
        "id": 32447,
        "hadith_number": "3753",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Rasuah",
        "perawi_melayu": "Abdullah bin Amr",
        "english_text": "Narrated Abdullah bin Amr: The Messenger of Allah (peace and blessings of Allah be upon him) cursed the giver of bribe and the taker of bribe.",
        "malay_translation": "Daripada Abdullah bin Amr berkata: Rasulullah SAW melaknat pemberi rasuah dan penerima rasuah. Riwayat Abu Daud dan Ibn Majah.",
        "arabic_text": "وَعَن عبد الله بن عَمْرو قَالَ: لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم الرَّاشِيَ وَالْمُرْتَشِيَ. رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ"
      },
      {
        "id": 32448,
        "hadith_number": "3754",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadirith": "Hadis Riwayat Imam Tirmizi",
        "perawi_melayu": "Imam Tirmizi dan Abu Hurairah",
        "english_text": "Narrated by Imam Tirmidhi and Abu Hurairah",
        "malay_translation": "Riwayat Imam Tirmizi dan Abu Hurairah.",
        "arabic_text": "وَرَوَاهُ التِّرْمِذِيّ عَنهُ وَعَن أبي هُرَيْرَة"
      },
      {
        "id": 32449,
        "hadith_number": "3755",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perihal Orang yang Berjalan di Antara Dua Orang",
        "perawi_melayu": "Ahmad dan al-Baihaqi dalam kitab Syu'ab al-Iman meriwayatkan daripada Thawban",
        "english_text": "Not Available",
        "malay_translation": "Ahmad dan al-Baihaqi meriwayatkan dalam kitab “Syu’ab al-Iman” daripada Thawban, dan menambah: “dan orang yang berjalan di antara mereka.” Maksudnya ialah orang yang berjalan di antara dua orang.",
        "arabic_text": "وَرَوَاهُ أَحْمَدُ وَالْبَيْهَقِيُّ فِي «شُعَبِ الْإِيمَانِ» عَنِ ثَوْبَانَ وَزَادَ: «وَالرَّائِشَ» يَعْنِي الَّذِي يَمْشِي بَيْنَهُمَا"
      },
      {
        "id": 32450,
        "hadith_number": "3756",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Harta Bagi Orang Soleh",
        "perawi_melayu": "Amru bin al-'Ash",
        "english_text": "Not Available",
        "malay_translation": "Daripada Amru bin al-'Ash r.a., katanya: Rasulullah SAW telah mengutus seseorang kepadaku sambil menyampaikan pesanan, “Kumpulkan senjata dan pakaianmu, kemudian datanglah kepadaku.”  Aku pun datang menghadap baginda ketika baginda sedang berwuduk.  Baginda bersabda, “Wahai Amru, sesungguhnya aku mengutus seseorang kepadamu untuk mengangkatmu ke medan perang di mana Allah akan menyelamatkanmu, memberikan kepadamu kemenangan dan memperolehkan harta yang banyak untukmu.” Aku berkata, “Wahai Rasulullah, hijrahku bukanlah untuk mencari harta, tetapi semata-mata kerana Allah dan Rasul-Nya.” Baginda bersabda,  “Alangkah baiknya harta yang baik itu untuk orang yang soleh.” Riwayat Imam Khatib at-Tabrizi dalam kitab “Syarh as-Sunnah”, dan Ahmad meriwayatkannya dengan maksud yang hampir sama. Dalam riwayat Ahmad: Baginda bersabda, “Sesungguhnya harta yang baik itu amat baik untuk orang yang soleh.”",
        "arabic_text": "وَعَن عَمْرِو بن العاصِ قَالَ: أَرْسَلَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَنِ اجْمَعْ عَلَيْكَ سِلَاحَكَ وَثِيَابَكَ ثُمَّ ائْتِنِي» قَالَ: فَأَتَيْتُهُ وَهُوَ يَتَوَضَّأُ فَقَالَ: «يَا عَمْرُو إِنِّي أَرْسَلْتُ إِلَيْكَ لِأَبْعَثَكَ فِي وُجْةٍ يُسَلِّمُكَ اللَّهُ وَيُغَنِّمُكَ وَأَزْعَبَ لَكَ زَعْبَةً مِنَ الْمَالِ» . فَقُلْتُ: يَا رَسُولَ اللَّهِ مَا كَانَتْ هِجْرَتِي لِلْمَالِ وَمَا كَانَتْ إِلَّا لِلَّهِ ولرسولِه قَالَ: «نِعِمَّا بِالْمَالِ الصَّالِحِ لِلرَّجُلِ الصَّالِحِ» . رَوَاهُ فِي «شَرْحِ السُّنَّةِ» وَرَوَى أَحْمَدُ نَحْوَهُ وَفِي روايتِه: قَالَ: «نِعْمَ المالُ الصَّالحُ للرَّجُلِ الصالحِ»"
      },
      {
        "id": 32451,
        "hadith_number": "3757",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Syafaat dan Hadiah: Satu Bentuk Riba",
        "perawi_melayu": "Abu Umamah",
        "english_text": "From Abu Umamah that the Messenger of Allah (ﷺ) said: \"Whoever intercedes for someone and gives him a gift for his intercession, and he accepts it, then he has approached a great door of Riba (usury).\"",
        "malay_translation": "Dari Abu Umamah, bahawa Rasulullah SAW bersabda:  \"Barang siapa yang memberi syafaat kepada seseorang dan memberi hadiah kepadanya atas syafaat itu, lalu penerima menerimanya, maka sesungguhnya dia telah menghampiri pintu riba yang besar.\"",
        "arabic_text": "عَنْ أَبِي أُمَامَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ شَفَعَ لِأَحَدٍ شَفَاعَةً فَأَهْدَى لَهُ هَدِيَّةً عَلَيْهَا فَقَبِلَهَا فَقَدْ أَتَى بَابًا عَظِيمًا مِنْ أَبْوَابِ الرِّبَا» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32452,
        "hadith_number": "3758",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Bukti dan Sumpah dalam Dakwaan",
        "perawi_melayu": "Ibn Abbas r.a.",
        "english_text": "From Ibn Abbas (may Allah be pleased with them both) from the Prophet (peace and blessings of Allah be upon him), who said: \"If people were given what they claimed, people would claim the blood and property of others. But the oath is on the one who is accused.\"",
        "malay_translation": "Daripada Ibnu Abbas r.a. daripada Nabi SAW, baginda bersabda:  \"Sekiranya manusia diberikan apa yang mereka tuntut, nescaya manusia akan menuntut darah dan harta benda orang lain.  Tetapi sumpah adalah ke atas orang yang dituduh.\" Riwayat Muslim.  Dalam syarah Nawawi, terdapat riwayat Baihaqi dengan sanad yang hasan atau sahih, tambahan daripada Ibnu Abbas (marfu'): \"Tetapi bukti adalah ke atas yang mendakwa dan sumpah ke atas yang menafikan.\"",
        "arabic_text": "عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَوْ يُعْطَى النَّاسُ بِدَعْوَاهُمْ لَادَّعَى نَاسٌ دِمَاءَ رِجَالٍ وَأَمْوَالَهُمْ وَلَكِنَّ الْيَمِينَ عَلَى الْمُدَّعَى عَلَيْهِ» . رَوَاهُ مُسْلِمٌ وَفِي «شَرْحِهِ لِلنَّوَوِيِّ» أَنَّهُ قَالَ: وَجَاءَ فِي رِوَايَةِ «الْبَيْهَقِيِّ» بِإِسْنَادٍ حَسَنٍ أَوْ صَحِيحٍ زِيَادَةٌ عَنِ ابْنِ عَبَّاسٍ مَرْفُوعًا: «لَكِنَّ الْبَيِّنَةَ على المدَّعي واليمينَ على مَنْ أنكر»"
      },
      {
        "id": 32453,
        "hadith_number": "3759",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kemurkaan Allah SWT terhadap Orang yang Memutuskan Sumpah",
        "perawi_melayu": "Ibn Mas'ud",
        "english_text": "From Ibn Mas'ud, he said: The Messenger of Allah (peace and blessings of Allah be upon him) said: \"Whoever swears an oath of patience and he is unjust in it, cutting off the wealth of a Muslim, will meet Allah on the Day of Resurrection while He is angry with him.\"",
        "malay_translation": "Daripada Ibnu Mas'ud, beliau berkata: Rasulullah SAW bersabda:  \"Sesiapa yang bersumpah dengan sumpah kesabaran, dan dia melakukan kezaliman di dalamnya dengan memutuskan harta seorang Muslim, maka dia akan menemui Allah SWT pada hari kiamat dalam keadaan Allah SWT murka kepadanya.\"  Allah SWT menurunkan ayat yang membenarkan perkara ini:  (Sesungguhnya orang-orang yang membeli janji Allah dan sumpah mereka dengan harga yang sedikit...) hingga akhir ayat.",
        "arabic_text": "وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ حَلَفَ عَلَى يَمِينِ صَبْرٍ وَهُوَ فِيهَا فَاجِرٌ يَقْتَطِعُ بِهَا مَالَ امْرِئٍ مُسْلِمٍ لَقِيَ اللَّهَ يَوْمَ الْقِيَامَةِ وَهُوَ عَلَيْهِ غَضْبَانُ» فَأَنْزَلَ اللَّهُ تَصْدِيقَ ذَلِكَ: (إِنَّ الَّذِينَ يشترونَ بعهدِ اللَّهِ وأيمانِهمْ ثمنا قَلِيلا) إِلَى آخر الْآيَة"
      },
      {
        "id": 32454,
        "hadith_number": "3760",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Azab Bagi yang Menzalimi Hak Muslim",
        "perawi_melayu": "Abu Umamah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Umamah, katanya: Rasulullah SAW bersabda: \"Barangsiapa yang mengambil hak seorang muslim dengan tangannya sendiri, maka Allah telah mewajibkan neraka ke atasnya dan Allah telah mengharamkan syurga ke atasnya.\"  Lalu seorang lelaki bertanya: \"Walaupun sedikit sahaja ya Rasulullah?\" Baginda menjawab: \"Walaupun hanya sebatang ranting kayu.\"  Riwayat Muslim.",
        "arabic_text": "وَعَنْ أَبِي أُمَامَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اقْتَطَعَ حَقَّ امْرِئٍ مُسْلِمٍ بِيَمِينِهِ فَقَدْ أَوْجَبَ اللَّهُ لَهُ النَّارَ وَحَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ» فَقَالَ لَهُ رَجُلٌ: وَإِنْ كَانَ شَيْئا يسير يَا رَسُولَ اللَّهِ؟ قَالَ: «وَإِنْ كَانَ قَضِيبًا من أَرَاك» . رَوَاهُ مُسلم"
      },
      {
        "id": 32455,
        "hadith_number": "3761",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW: Manusia Biasa dan Keputusan Hukum",
        "perawi_melayu": "Ummu Salamah",
        "english_text": "From Umm Salamah that the Messenger of Allah (ﷺ) said: \"Verily, I am but a human being, and you come to me with your disputes.  And perhaps one of you may be more persuasive in his argument than another, so I judge for him according to what I hear from him.  So whoever I judge for, a portion of his brother's right, let him not take it, for I only cut off for him a piece of fire.\"",
        "malay_translation": "Daripada Ummu Salamah bahawa Rasulullah SAW bersabda:  \"Sesungguhnya aku hanyalah seorang manusia biasa, dan kamu semua datang kepadaku dengan perselisihan kamu. Dan mungkin di antara kamu ada yang lebih fasih hujahnya daripada yang lain, maka aku akan membuat keputusan untuknya berdasarkan apa yang aku dengar darinya.  Maka sesiapa yang aku putuskan untuknya sesuatu hak saudaranya, maka janganlah dia mengambilnya, kerana aku hanya memotong baginya sekeping api.\"",
        "arabic_text": "وَعَنْ أُمِّ سَلَمَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّمَا أَنَا بَشَرٌ وَإِنَّكُمْ تَخْتَصِمُونَ إِلَيَّ وَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَلْحَنَ بِحُجَّتِهِ مِنْ بَعْضٍ فَأَقْضِي لَهُ عَلَى نَحْوِ مَا أَسْمَعُ مِنْهُ فَمَنْ قَضَيْتُ لَهُ بِشَيْءٍ مِنْ حَقِّ أَخِيهِ فَلَا يَأْخُذَنَّهُ فَإِنَّمَا أَقْطَعُ لَهُ قِطْعَةً مِنَ النَّار»"
      },
      {
        "id": 32456,
        "hadith_number": "3762",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Orang yang Paling Dibenci Allah",
        "perawi_melayu": "Aisyah r.a.",
        "english_text": "It is narrated on the authority of 'Aishah (Allah be pleased with her) that the Messenger of Allah (may peace be upon him) said: \"Verily, the most hateful of men to Allah is the contentious litigant.\"",
        "malay_translation": "Daripada Aisyah r.a., katanya: Rasulullah s.a.w. bersabda:  \"Sesungguhnya, orang yang paling dibenci Allah SWT ialah orang yang suka bertengkar dan berbalah.\"",
        "arabic_text": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَبْغَضَ الرِّجَالِ إِلَى اللَّهِ الْأَلَدُّ الخَصِمُ»"
      },
      {
        "id": 32457,
        "hadith_number": "3763",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Rasulullah SAW Mengenai Sumpah dan Saksi",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "From Ibn Abbas: That the Messenger of Allah (peace and blessings of Allah be upon him) judged with an oath and a witness.",
        "malay_translation": "Daripada Ibnu Abbas: bahawa Rasulullah SAW telah membuat keputusan berdasarkan sumpah dan saksi.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى الله عَلَيْهِ وَسلم قضى بِيَمِين وَشَاهد. رَوَاهُ مُسلم"
      },
      {
        "id": 32458,
        "hadith_number": "3764",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pertikaian Tanah dan Sumpah",
        "perawi_melayu": "Al-Qamah bin Wa'il daripada bapanya",
        "english_text": "Not Available",
        "malay_translation": "Daripada Al-Qamah bin Wa'il daripada bapanya, katanya: Seorang lelaki dari Hadhramaut dan seorang lelaki dari Kinda datang kepada Nabi SAW. Lelaki dari Hadhramaut berkata: \"Wahai Rasulullah, lelaki ini telah menguasai tanah saya.\" Lelaki dari Kinda berkata: \"Tanah ini adalah milik saya dan dia tidak mempunyai hak di atasnya.\" Nabi SAW bersabda kepada lelaki dari Hadhramaut: \"Adakah kamu mempunyai bukti?\" Jawabnya: \"Tidak.\" Baginda bersabda: \"Maka engkau boleh bersumpah.\" Lelaki itu berkata: \"Wahai Rasulullah, lelaki ini adalah seorang yang fasik, dia tidak kisah dengan sumpahnya dan dia tidak segan dengan apa-apa.\" Baginda bersabda: \"Engkau hanya mendapat apa yang telah disumpahkan sahaja.\"  Lalu lelaki itu pergi untuk bersumpah. Setelah lelaki itu berpaling, Rasulullah SAW bersabda: \"Sekiranya dia bersumpah atas harta itu untuk memakannya secara zalim, nescaya dia akan menemui Allah SWT sedang Allah SWT  tidak redha kepadanya.\"  Riwayat Muslim.",
        "arabic_text": "وَعَنْ عَلْقَمَةَ بْنِ وَائِلٍ عَنْ أَبِيهِ قَالَ: جَاءَ رَجُلٌ مِنْ حَضْرَمَوْتَ وَرَجُلٌ مِنْ كِنْدَةَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ الْحَضْرَمِيُّ: يَا رَسُولَ اللَّهِ إِنَّ هَذَا غَلَبَنِي عَلَى أَرْضٍ لِي فَقَالَ الْكِنْدِيُّ: هِيَ أَرْضِي وَفِي يَدِي لَيْسَ لَهُ فِيهَا حَقٌّ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْحَضْرَمِيِّ: «أَلَكَ بَيِّنَةٌ؟» قَالَ: لَا قَالَ: «فَلَكَ يَمِينُهُ» قَالَ: يَا رَسُولَ اللَّهِ إِنَّ الرَّجُلَ فَاجِرٌ لَا يُبَالِي عَلَى مَا حَلَفَ عَلَيْهِ وَلَيْسَ يَتَوَرَّعُ منْ شيءٍ قَالَ: «ليسَ لكَ مِنْهُ إِلَّا ذَلِكَ» . فَانْطَلَقَ لِيَحْلِفَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا أَدْبَرَ: «لَئِنْ حَلَفَ عَلَى مَالِهِ لِيَأْكُلَهُ ظُلْمًا لَيَلْقَيَنَّ اللَّهَ وَهُوَ عَنهُ معرض» . رَوَاهُ مُسلم"
      },
      {
        "id": 32459,
        "hadith_number": "3765",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ancaman Neraka Bagi Mereka Yang Berdusta",
        "perawi_melayu": "Abu Dzar al-Ghifari",
        "english_text": "And from Abu Dharr (رضي الله عنه), that he heard the Messenger of Allah (ﷺ) say: “Whoever claims something which is not his, is not from amongst us and let him occupy his seat in the Fire.”",
        "malay_translation": "Daripada Abu Dzar (رضي الله عنه), bahawa beliau mendengar Rasulullah ﷺ bersabda:  “Barangsiapa mendakwa sesuatu yang bukan haknya, maka dia bukanlah daripada kalangan kita dan hendaklah dia menyediakan tempat duduknya di dalam Neraka.”",
        "arabic_text": "وَعَنْ أَبِي ذَرٍّ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنِ ادَّعَى مَا لَيْسَ لَهُ فَلَيْسَ مِنَّا وَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ» . رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 32460,
        "hadith_number": "3766",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Sebaik-baik Saksi",
        "perawi_melayu": "Zaid bin Khalid",
        "english_text": "Narrated Zaid bin Khalid: The Messenger of Allah (peace and blessings of Allah be upon him) said: 'Shall I not inform you of the best of witnesses? The one who brings his testimony before he is asked for it.'",
        "malay_translation": "Daripada Zaid bin Khalid berkata: Rasulullah SAW bersabda: 'Mahukah aku memberitahu kamu tentang sebaik-baik saksi? Iaitu orang yang memberikan kesaksiannya sebelum dia diminta untuknya.'",
        "arabic_text": "وَعَنْ زَيْدِ بْنِ خَالِدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَلَا أُخْبِرُكُمْ بِخَيْرِ الشُّهَدَاءِ؟ الَّذِي يَأْتِي بشهادتِه قبلَ أنْ يسْأَلهَا» . رَوَاهُ مُسلم"
      },
      {
        "id": 32461,
        "hadith_number": "3767",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Generasi Terbaik dan Kemerosotan Akidah",
        "perawi_melayu": "Ibn Mas'ud",
        "english_text": "From Ibn Mas'ud, he said: The Messenger of Allah (peace and blessings be upon him) said: \"The best of people is my generation, then those who come after them, then those who come after them. Then will come a people whose witness will precede their oath and their oath will precede their witness.\"",
        "malay_translation": "Daripada Ibnu Mas'ud, beliau berkata: Rasulullah SAW bersabda:  \"Sebaik-baik manusia ialah generasiku, kemudian generasi selepas mereka, kemudian generasi selepas mereka. Kemudian akan datang suatu kaum yang kesaksian mereka mendahului sumpah mereka, dan sumpah mereka mendahului kesaksian mereka.\"",
        "arabic_text": "وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «خَيْرُ النَّاسِ قَرْنِي ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ يَجِيءُ قَوْمٌ تَسبِقُ شَهَادَة أحدِهمْ يَمِينه وَيَمِينه شَهَادَته»"
      },
      {
        "id": 32462,
        "hadith_number": "3768",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penentuan Sumpah Melalui Undian",
        "perawi_melayu": "Tiada perawi dinyatakan",
        "english_text": "Tiada teks Bahasa Inggeris",
        "malay_translation": "Daripada Abu Hurairah R.A., bahawa Nabi S.A.W. menawarkan sumpah kepada suatu kaum, lalu mereka bersegera (untuk bersumpah). Baginda kemudian memerintahkan agar diadakan undian di antara mereka untuk menentukan siapa yang patut bersumpah. Riwayat Bukhari.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَرَضَ عَلَى قَوْمٍ الْيَمِينَ فَأَسْرَعُوا فَأَمْرَ أَنْ يُسْهَمَ بَيْنَهُمْ فِي اليَمينِ أيُّهُمْ يحْلِفُ. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32463,
        "hadith_number": "3769",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Bukti Berada Pada Pihak Yang Mendakwa",
        "perawi_melayu": "Amru bin Syu'aib daripada bapanya daripada datuknya",
        "english_text": "From Amr ibn Shu'aib from his father from his grandfather that the Prophet (peace and blessings of Allaah be upon him) said: \"The proof is on the one who claims, and the oath is on the one who is claimed against.\"",
        "malay_translation": "Daripada Amru bin Syu'aib daripada bapanya daripada datuknya bahawa Nabi SAW bersabda:  “Bukti adalah pada pihak yang mendakwa, dan sumpah adalah pada pihak yang dituduh.”",
        "arabic_text": "عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْبَيِّنَةُ عَلَى الْمُدَّعِي وَالْيَمِينُ عَلَى الْمُدَّعَى عَلَيْهِ» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 32464,
        "hadith_number": "3770",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perselisihan Pusaka dan Nasihat Rasulullah",
        "perawi_melayu": "Ummu Salamah RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ummu Salamah R.A., daripada Nabi SAW, tentang dua orang lelaki yang berselisih faham mengenai harta pusaka tanpa bukti yang jelas melainkan hanya dakwaan mereka. Baginda bersabda:  “Barangsiapa yang Aku putuskan haknya daripada harta saudaranya, maka sesungguhnya Aku telah memotong sekeping api neraka untuknya.”  Kedua-dua lelaki itu berkata: “Wahai Rasulullah, hak ini adalah hak sahabatku.” Baginda bersabda: “Tidak, tetapi pergilah kamu berdua, bahagikanlah dan utamakanlah kebenaran, kemudian undi, dan hendaklah setiap seorang daripada kamu berdua membebaskan sahabatnya.”  Dalam satu riwayat lain, Baginda bersabda: “Sesungguhnya Aku hanya menghakimi di antara kamu berdua berdasarkan pendapatku dalam perkara yang tidak diturunkan wahyu kepadaku.” Riwayat Abu Daud.",
        "arabic_text": "وَعَنْ أُمِّ سَلَمَةَ رَضِيَ اللَّهُ عَنْهَا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: فِي رَجُلَيْنِ اخْتَصَمَا إِلَيْهِ فِي مَوَارِيثَ لَمْ تَكُنْ لَهُمَا بَيِّنَةٌ إِلَّا دَعْوَاهُمَا فَقَالَ: «مَنْ قَضَيْتُ لَهُ بِشَيْءٍ مِنْ حَقِّ أَخِيهِ فَإِنَّمَا أَقْطَعُ لَهُ قِطْعَةً مِنَ النَّارِ» . فَقَالَ الرَّجُلَانِ: كُلُّ وَاحِدٍ مِنْهُمَا: يَا رَسُولَ اللَّهِ حَقِّي هَذَا لِصَاحِبِي فَقَالَ: «لَا وَلَكِنِ اذْهَبَا فَاقْتَسِمَا وَتَوَخَّيَا الْحَقَّ ثُمَّ اسْتَهِمَا ثُمَّ لْيُحَلِّلْ كُلُّ وَاحِدٍ مِنْكُمَا صَاحِبَهُ» . وَفِي رِوَايَةٍ قَالَ: «إِنَّمَا أَقْضِي بَيْنَكُمَا برأيي فِيمَا لم يُنزَلْ عليَّ فِيهِ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32465,
        "hadith_number": "3771",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keputusan Pertikaian Haiwan Ternakan",
        "perawi_melayu": "Jabir bin Abdullah",
        "english_text": "From Jabir bin Abdullah: That two men disputed over a beast of burden, and each of them presented proof that it was his. The Prophet (peace and blessings of Allah be upon him) judged in favor of the one who had it in his possession.  Reported in Sharh as-Sunnah.",
        "malay_translation": "Dari Jabir bin Abdullah: bahawa dua orang lelaki bertelagah mengenai seekor haiwan tunggangan, dan setiap seorang daripada mereka telah mengemukakan bukti bahawa ia adalah miliknya. Rasulullah SAW telah memutuskan kepada pihak yang memegang haiwan tersebut.  Diriwayatkan dalam  Sharh as-Sunnah.",
        "arabic_text": "وَعَن جابرِ بن عبدِ الله: أَنَّ رَجُلَيْنِ تَدَاعَيَا دَابَّةً فَأَقَامَ كُلُّ وَاحِدٍ مِنْهُمَا الْبَيِّنَةَ أَنَّهَا دَابَّتُهُ نَتَجَهَا فَقَضَى بِهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلَّذِي فِي يدِهِ. رَوَاهُ فِي «شرح السّنة»"
      },
      {
        "id": 32466,
        "hadith_number": "3772",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pembahagian Unta Antara Dua Pendakwa",
        "perawi_melayu": "Abu Musa Al-Asy'ari",
        "english_text": "It was narrated from Abu Musa Al-Ash'ari that two men claimed ownership of a camel during the time of the Messenger of Allah (peace and blessings be upon him). Each of them presented two witnesses. The Prophet (peace and blessings be upon him) divided the camel equally between them. It was narrated by Abu Dawood, and in a narration by him, An-Nasa'i, and Ibn Majah: two men claimed a camel, and neither of them had proof. So the Prophet (peace and blessings be upon him) made it common property between them.",
        "malay_translation": "Diriwayatkan daripada Abu Musa Al-Asy'ari bahawa dua orang lelaki mendakwa memiliki seekor unta pada zaman Rasulullah ﷺ. Setiap seorang daripada mereka mengemukakan dua orang saksi. Nabi ﷺ membahagikan unta itu sama rata di antara mereka berdua. Diriwayatkan oleh Abu Daud, dan dalam riwayat daripadanya, An-Nasa'i, dan Ibn Majah: dua orang lelaki mendakwa seekor unta, dan tiada seorang pun daripada mereka mempunyai bukti. Maka Nabi ﷺ menjadikan unta itu sebagai milik bersama di antara mereka.",
        "arabic_text": "وَعَن أبي مُوسَى الأشعريِّ: أَنَّ رَجُلَيْنِ ادَّعَيَا بَعِيرًا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَعَثَ كُلُّ وَاحِدٍ مِنْهُمَا شَاهِدَيْنَ فَقَسَّمَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَهُمَا نِصْفَيْنِ. رَوَاهُ أَبُو دَاوُدَ وَفِي رِوَايَةٍ لَهُ وَلِلنَّسَائِيِّ وَابْنِ مَاجَهْ: أَنَّ رَجُلَيْنِ ادَّعَيَا بَعِيرًا لَيْسَتْ لِوَاحِدٍ مِنْهُمَا بَيِّنَةٌ فَجَعَلَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَهُمَا"
      },
      {
        "id": 32467,
        "hadith_number": "3773",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penyelesaian Perselisihan Mengenai Haiwan Melalui Sumpah",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "From Abu Hurairah, that two men disputed over an animal and they had no witness, so the Prophet (peace and blessings of Allah be upon him) said: \"Let them both swear an oath.\"",
        "malay_translation": "Daripada Abu Hurairah, bahawa dua orang lelaki berselisih faham mengenai seekor haiwan dan mereka tiada saksi, maka Nabi SAW bersabda:  “ Biarlah mereka berdua bersumpah.”",
        "arabic_text": "وَعَن أبي هريرةَ أنَّ رجُلينِ اختَصما فِي دَابَّة وَلَيْسَ لَهما بَيِّنَةٌ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «استهِما على اليَمينِ» . رَوَاهُ أَبُو دَاوُد وابنُ مَاجَه"
      },
      {
        "id": 32468,
        "hadith_number": "3774",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Bersumpah dengan Nama Allah dalam Tuntutan",
        "perawi_melayu": "Perawi Tidak Diketahui",
        "english_text": "Teks Bahasa Inggeris Asal Tiada",
        "malay_translation": "Dan daripada Ibn Abbas: Bahawa Nabi ﷺ bersabda kepada seorang lelaki yang baginda suruh bersumpah: 'Bersumpahlah dengan nama Allah yang tiada Tuhan selain Dia, kamu tidak mempunyai apa-apa dengannya' Maksudnya bagi pihak pendakwa. Diriwayatkan oleh Abu Daud.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِرَجُلٍ حَلَّفَهُ: «احْلِفْ بِاللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ مَاله عِنْدَكَ شَيْءٌ» يُعْنَى لِلْمُدَّعِي. رَوَاهُ أَبُو دَاوُدَ"
      },
      {
        "id": 32469,
        "hadith_number": "3775",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keperluan Bukti dalam Pertikaian Tanah",
        "perawi_melayu": "Al-Asy'ats bin Qais",
        "english_text": "It is narrated from al-Asy'ats bin Qays that he said: There was a land dispute between me and a Jew. He denied my claim. I brought him to the Prophet (peace and blessings of Allah be upon him), who asked, \"Do you have proof?\" I said, \"No.\"  He then told the Jew, \"Take an oath.\" I said, \"O Messenger of Allah, then he will take an oath and take my property!\" Then Allah Almighty revealed the verse, \"Indeed, those who buy the covenant of Allah and their oaths for a small price...\" (The verse continues). Related by Abu Dawud and Ibn Majah.",
        "malay_translation": "Daripada Al-Asy'ats bin Qais, beliau berkata: Terdapat pertikaian tanah di antara aku dan seorang Yahudi. Dia menafikan tuntutan aku. Aku membawanya kepada Nabi SAW, lalu baginda bertanya, \"Adakah kamu mempunyai bukti?\" Aku menjawab, \"Tidak.\" Baginda kemudiannya memberitahu orang Yahudi itu, \"Bersumpahlah.\" Aku berkata, \"Wahai Rasulullah, jika begitu dia akan bersumpah dan mengambil harta benda saya!\" Kemudian Allah SWT menurunkan ayat, \"Sesungguhnya orang-orang yang membeli perjanjian Allah dan sumpah mereka dengan harga yang sedikit...\" (Ayat seterusnya).  Riwayat Abu Daud dan Ibn Majah.",
        "arabic_text": "وَعَن الأشعثِ بنِ قيسٍ قَالَ: كَانَ بَيْنِي وَبَيْنَ رَجُلٍ مِنَ الْيَهُودِ أرضٌ فحَجَدني فَقَدَّمْتُهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «أَلَكَ بَيِّنَةٌ؟» قُلْتُ: لَا قَالَ لِلْيَهُودِيِّ: «احْلِفْ» قُلْتُ: يَا رَسُولَ اللَّهِ إِذَنْ يَحْلِفَ وَيَذْهَبَ بِمَالِي فَأَنْزَلَ اللَّهُ تَعَالَى: (إِنَّ الَّذِينَ يشترونَ بعهدِ اللَّهِ وأَيمانِهِم ثمنا قَلِيلا) الْآيَة. رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه"
      },
      {
        "id": 32470,
        "hadith_number": "3776",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Memutuskan Hak Milik Melalui Sumpah",
        "perawi_melayu": "Riwayat Abu Daud",
        "english_text": "Not Available",
        "malay_translation": "Daripada baginda ﷺ, bahawa seorang lelaki dari Kinda dan seorang lelaki dari Hadhramaut berselisih faham di hadapan Rasulullah ﷺ di sebuah kawasan di Yaman. Lelaki Hadhramaut berkata: \"Wahai Rasulullah, tanah saya telah dirampas oleh bapa lelaki ini.\" Lelaki Kinda berkata: \"Ya.\" Rasulullah ﷺ bertanya: \"Adakah kamu mempunyai bukti?\" Jawabnya: \"Tidak, tetapi saya akan bersumpah dengan nama Allah bahawa dia tahu bahawa tanah ini adalah kepunyaan saya dan telah dirampas oleh bapanya.\"  Lelaki Kinda bersiap untuk bersumpah. Rasulullah ﷺ bersabda:  \"Tidaklah seseorang memutuskan hak milik orang lain dengan bersumpah melainkan dia akan menemui Allah dalam keadaan buta.\" Maka lelaki Kinda berkata: \"Tanah itu kepunyaan dia.\" ",
        "arabic_text": "وَعَنْهُ أَنْ رَجُلًا مَنْ كِنْدَةَ وَرَجُلًا مِنْ حَضْرَمَوْتَ اخْتَصَمَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَرْضٍ مِنَ الْيَمَنِ فَقَالَ الْحَضْرَمِيُّ: يَا رَسُولَ اللَّهِ إِنَّ أَرْضِي اغْتَصَبَنِيهَا أَبُو هَذَا وَهَى فِي يَدِهِ قَالَ: «هَلْ لَكَ بَيِّنَةٌ؟» قَالَ: لَا وَلَكِنْ أُحَلِّفُهُ وَاللَّهِ مَا يَعْلَمُ أَنَّهَا أَرْضِي اغْتَصَبَنِيهَا أَبُوهُ؟ فَتَهَيَّأَ الْكِنْدِيُّ لِلْيَمِينِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَقْطَعُ أَحَدٌ مَالًا بِيَمِينٍ إِلَّا لَقِيَ اللَّهَ وَهُوَ أَجْذَمُ» فَقَالَ الْكِنْدِيُّ: هِيَ أرضُهُ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32471,
        "hadith_number": "3777",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Dosa-dosa Besar: Syirik, Derhaka Kepada Ibu Bapa, dan Sumpah Palsu",
        "perawi_melayu": "Abdullah bin Unais",
        "english_text": "And from Abdullah ibn Unais, he said: The Messenger of Allah (peace and blessings be upon him) said: \"Indeed, among the greatest of the great sins are associating partners with Allah, disobedience to parents, and a false oath. And whoever swore an oath by Allah, an oath of patience, then added something to it like the wing of a mosquito, except that it will be made a point in his heart until the Day of Resurrection.\"",
        "malay_translation": "Daripada Abdullah bin Unais, beliau berkata: Rasulullah SAW bersabda:  \"Sesungguhnya di antara dosa-dosa besar ialah syirik kepada Allah, derhaka kepada ibu bapa, dan sumpah palsu. Dan sesiapa yang bersumpah dengan nama Allah, sumpah sabar, kemudian menambah sedikit kepadanya seperti sayap nyamuk, nescaya ia akan menjadi titik hitam di dalam hatinya sehingga hari kiamat.\" Riwayat Tirmizi. Beliau berkata: Hadis ini adalah hadis gharib.",
        "arabic_text": "وَعَن عبدِ اللَّهِ بنِ أُنَيْسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ مِنْ أَكْبَرِ الْكَبَائِرِ الشِّرْكَ بِاللَّهِ وَعُقُوقَ الْوَالِدَيْنِ وَالْيَمِينَ الْغَمُوسَ وَمَا حَلَفَ حَالِفٌ بِاللَّهِ يَمِينَ صَبْرٍ فَأَدْخَلَ فِيهَا مِثْلَ جَنَاحِ بَعُوضَةٍ إِلَّا جُعِلَتْ نُكْتَةً فِي قَلْبِهِ إِلَى يَوْمِ الْقِيَامَةِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيب"
      },
      {
        "id": 32472,
        "hadith_number": "3778",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Bersumpah Palsu di Mimbar",
        "perawi_melayu": "Jabir",
        "english_text": "Narrated Jabir: Allah's Messenger (ﷺ) said, \"Let nobody swear by a false oath near this pulpit of mine, even if it is about a green siwak, but he will occupy a seat in the Fire or the Fire will be incumbent upon him.\"",
        "malay_translation": "Daripada Jabir, katanya: Rasulullah SAW bersabda:  \"Tiada sesiapa pun yang harus bersumpah palsu berhampiran mimbarku ini, walaupun ia berkaitan dengan siwak yang hijau, melainkan dia akan menempati tempat duduk di dalam Neraka atau Neraka menjadi wajib ke atasnya.\" Riwayat Malik, Abu Daud dan Ibnu Majah.",
        "arabic_text": "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَحْلِفُ أَحَدٌ عِنْدَ مِنْبَرِي هَذَا عَلَى يَمِينٍ آثِمَةٍ وَلَوْ عَلَى سِوَاكٍ أَخْضَرَ إِلَّا تَبَوَّأَ مَقْعَدَهُ مِنَ النَّارِ أَوْ وَجَبَتْ لَهُ النَّارُ» . رَوَاهُ مَالِكٌ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ"
      },
      {
        "id": 32473,
        "hadith_number": "3779",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kesamaan Kesaksian Palsu dengan Syirik",
        "perawi_melayu": "Khuraim bin Fatik",
        "english_text": "Not Available",
        "malay_translation": "Daripada Khuraim bin Fatik, beliau berkata: Rasulullah SAW telah menunaikan solat Subuh. Setelah selesai, baginda berdiri dan bersabda: \"Kesaksian palsu telah disamakan dengan syirik kepada Allah.\" (Baginda) mengulanginya sebanyak tiga kali. Kemudian baginda membaca:  (Maka jauhilah oleh kamu segala yang najis daripada berhala-berhala dan jauhilah oleh kamu perkataan-perkataan dusta dengan ikhlas kepada Allah, tanpa mempersekutukan-Nya dengan sesuatu pun).  (Riwayat Abu Daud dan Ibnu Majah)",
        "arabic_text": "وَعَن خُريمِ بن فاتكٍ قَالَ: صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الصُّبْحِ فَلَمَّا انْصَرَفَ قَامَ قَائِمًا فَقَالَ: «عُدِلَتْ شَهَادَةُ الزُّورِ بِالْإِشْرَاكِ بِاللَّهِ» ثَلَاثَ مَرَّاتٍ. ثُمَّ قَرَأَ: (فَاجْتَنِبُوا الرِّجْسَ مِنَ الْأَوْثَانِ وَاجْتَنِبُوا قَوْلَ الزُّورِ حُنَفَاءَ لِلَّهِ غَيْرَ مُشْرِكِينَ بهِ) رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه"
      },
      {
        "id": 32474,
        "hadith_number": "3780",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Riwayat Hadis oleh Ahmad dan Tirmizi",
        "perawi_melayu": "Ahmad dan Tirmizi melalui riwayat Ayman bin Khuraim.  Namun, Ibn Majah tidak menyebut tentang pembacaan.",
        "english_text": "Not Available",
        "malay_translation": "Ia diriwayatkan oleh Ahmad dan Tirmizi daripada Ayman bin Khuraim, kecuali Ibn Majah tidak menyebut tentang bacaan tersebut.",
        "arabic_text": "وَرَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ عَنْ أَيْمَنَ بْنِ خُرَيْمٍ إِلَّا أَنَّ ابْنَ مَاجَهْ لَمْ يَذْكُرِ الْقِرَاءَةَ"
      },
      {
        "id": 32475,
        "hadith_number": "3781",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kesaksian Orang Yang Tidak Dipercayai",
        "perawi_melayu": "Aisyah r.a.",
        "english_text": "It is narrated from 'Aishah (RA) that the Prophet (ﷺ) said: \"The testimony of a traitor, male or female, of one who has been flogged for a hadd punishment, or one who has a vested interest, is not acceptable against his brother, nor is that of one who is suspicious in his loyalty or kinship, or one who is content with the people of the house.\"",
        "malay_translation": "Daripada Aisyah r.a., bahawa Rasulullah SAW bersabda:  \"Tidak diterima keterangan daripada pengkhianat lelaki mahupun perempuan, orang yang telah disebat kerana hukuman had, atau orang yang mempunyai kepentingan, terhadap saudaranya, begitu juga keterangan daripada orang yang syak wasangka dalam kesetiaan atau hubungan kekeluargaan, atau orang yang redha dengan ahli rumah.\"",
        "arabic_text": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَجُوزُ شَهَادَةُ خَائِنٍ وَلَا خَائِنَةٍ وَلَا مَجْلُودٍ حَدًّا وَلَا ذِي غِمْرٍ عَلَى أَخِيهِ وَلَا ظَنِينٍ فِي وَلَاءٍ وَلَا قَرَابَةٍ وَلَا الْقَانِعِ مَعَ أَهْلِ الْبَيْتِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حديثٌ غريبٌ ويزيدُ بن زيادٍ الدِّمَشْقِي الرَّاوِي مُنكر الحَدِيث"
      },
      {
        "id": 32476,
        "hadith_number": "3782",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kesahan Saksi",
        "perawi_melayu": "Amru bin Syu'aib daripada bapanya daripada datuknya daripada Nabi SAW",
        "english_text": "From Amr ibn Shu'aib from his father from his grandfather from the Prophet (ﷺ) who said: \"The testimony of a traitor, a treacherous woman, an adulterer, an adulteress, and one who has committed sodomy against his brother is not acceptable.\"",
        "malay_translation": "Daripada Amru bin Syu'aib daripada bapanya daripada datuknya daripada Nabi SAW, baginda bersabda:  \"Tidak diterima keterangan saksi daripada seorang pengkhianat, wanita pengkhianat, pezina lelaki, pezina perempuan, dan mereka yang melakukan liwat terhadap saudaranya.\"  Riwayat Abu Daud.  (Hujjah yang dikemukakan oleh ahli keluarga, akan ditinjau semula)",
        "arabic_text": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَجُوزُ شَهَادَةُ خَائِنٍ وَلَا خَائِنَةٍ وَلَا زَانٍ وَلَا زَانِيَةٍ وَلَا ذِي غِمْرٍ عَلَى أَخِيهِ» . وَرَدَّ شَهَادَةَ الْقَانِعِ لِأَهْلِ الْبَيَتْ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32477,
        "hadith_number": "3783",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kesaksian Badwi Terhadap Penduduk Kampung Tidak Diterima",
        "perawi_melayu": "Perawi tidak dinyatakan",
        "english_text": "Teks Bahasa Inggeris kosong",
        "malay_translation": "Daripada Abu Hurairah RA, daripada Rasulullah SAW bersabda: “Tidak boleh diterima kesaksian seorang Badwi terhadap penduduk kampung.” Riwayat Abu Daud dan Ibnu Majah.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَجُوزُ شَهَادَةُ بَدَوِيٍّ عَلَى صَاحِبِ قَرْيَةٍ» . رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَه"
      },
      {
        "id": 32478,
        "hadith_number": "3784",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Bijaksana dan Bergantung kepada Allah dalam Kesulitan",
        "perawi_melayu": "Auf bin Malik",
        "english_text": "From Awf bin Malik: The Prophet (peace and blessings of Allah be upon him) adjudicated between two men. When the one against whom the judgment was made turned away, he said, 'Allah is sufficient for me, and He is the best trustee.' The Prophet (peace and blessings of Allah be upon him) said, 'Verily, Allah Almighty disapproves of helplessness, but you must be astute. If a matter overwhelms you, then say: \"Allah is sufficient for me, and He is the best trustee.\" Narrated by Abu Dawood.'",
        "malay_translation": "Daripada Auf bin Malik: Bahawa Nabi (sallallahu 'alaihi wa sallam) telah menghukum antara dua orang lelaki. Apabila orang yang dihukum itu berpaling, dia berkata, 'Cukuplah Allah bagi saya, dan Dia sebaik-baik pengurus urusan.' Maka Nabi (sallallahu 'alaihi wa sallam) bersabda, 'Sesungguhnya Allah Ta'ala mencela kelemahan, tetapi hendaklah kamu bijaksana. Jika suatu perkara menguasai kamu, maka katakanlah: \"Cukuplah Allah bagi saya, dan Dia sebaik-baik pengurus urusan.\" Riwayat Abu Daud.'",
        "arabic_text": "وَعَنْ عَوْفِ بْنِ مَالِكٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بَيْنَ رَجُلَيْنِ فَقَالَ الْمَقْضِيُّ عَلَيْهِ لَمَّا أَدْبَرَ: حَسْبِيَ اللَّهُ وَنِعْمَ الْوَكِيلُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ اللَّهَ تَعَالَى يَلُومُ عَلَى الْعَجْزِ وَلَكِنْ عَلَيْكَ بِالْكَيْسِ فَإِذَا غَلَبَكَ أَمْرٌ فَقُلْ: حَسْبِيَ اللَّهُ ونِعْمَ الوكيلُ . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32479,
        "hadith_number": "3785",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menahan Individu Atas Tuduhan dan Kemudian Melepaskannya",
        "perawi_melayu": "Bahz bin Hakim",
        "english_text": "Narrated from Bahz bin Hakim, from his father, from his grandfather, that the Prophet (peace and blessings of Allah be upon him) detained a man on suspicion.  Reported by Abu Dawood, and At-Tirmidhi and An-Nasa'i added: Then he released him.",
        "malay_translation": "Daripada Bahz bin Hakim, daripada bapanya, daripada datuknya, bahawa Nabi ﷺ menahan seorang lelaki kerana tuduhan. Riwayat Abu Dawood, dan At-Tirmidhi dan An-Nasa'i menambahkan: Kemudian baginda melepaskannya.",
        "arabic_text": "وَعَنْ بَهْزِ بْنِ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَبَسَ رَجُلًا فِي تُهْمَةٍ. رَوَاهُ أَبُو دَاوُدَ وزادَ التِّرْمِذِيّ وَالنَّسَائِيّ: ثمَّ خَلّى عَنهُ"
      },
      {
        "id": 32480,
        "hadith_number": "3786",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Cara Rasulullah SAW Menyelesaikan Perselisihan",
        "perawi_melayu": "Abdullah bin Zubair",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abdullah bin Zubair r.a., katanya: Rasulullah SAW memutuskan bahawa kedua-dua pihak yang berselisih hendaklah duduk di hadapan hakim.  (Riwayat Ahmad dan Abu Daud)",
        "arabic_text": "عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ الْخَصْمَيْنِ يَقْعُدَانِ بَيْنَ يَدَيِ الْحَاكِمِ. رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ"
      }
    ]
  }
}