{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 106,
    "data": [
      {
        "id": 32249,
        "hadith_number": "3555",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman Zina:  Pengadilan Rasulullah SAW",
        "perawi_melayu": "Abu Hurairah dan Zaid bin Khalid",
        "english_text": "From Abu Hurairah and Zaid bin Khalid: That two men disputed before the Messenger of Allah (peace and blessings be upon him). One of them said: Judge between us by the Book of Allah. The other said: Yes, O Messenger of Allah, judge between us by the Book of Allah, and allow me to speak. He said: \"Speak.\" He said: My son committed adultery with this man's wife. They informed me that my son should be stoned to death, so I took from him a hundred sheep and a maidservant as compensation. Then I asked the scholars, and they informed me that my son should be flogged one hundred lashes and exiled for a year, and that stoning is only for his wife. So the Messenger of Allah (peace and blessings be upon him) said: \"By the One in Whose hand is my soul, I will certainly judge between you by the Book of Allah. As for your sheep and maidservant, they will be returned to you. As for your son, he should be flogged one hundred lashes and exiled for a year. As for you, O Unais, go to this man's wife, and if she confesses, stone her.\" So she confessed and was stoned.",
        "malay_translation": "Dari Abu Hurairah dan Zaid bin Khalid: bahawa dua orang lelaki bertelagah di hadapan Rasulullah SAW.  Salah seorang daripada mereka berkata:  “Putuskanlah di antara kami dengan Kitabullah.”  Yang lain berkata: “Ya, wahai Rasulullah, putuskanlah di antara kami dengan Kitabullah dan izinkan saya untuk berbicara.” Baginda SAW bersabda: “Berbicaralah.”  Dia berkata: “Anak saya telah berzina dengan isteri lelaki ini. Mereka memberitahu saya bahawa anak saya patut direjam sehingga mati, maka saya mengambil daripada lelaki ini seratus ekor kambing dan seorang hamba perempuan sebagai pampasan. Kemudian saya bertanya kepada ahli-ahli ilmu, dan mereka memberitahu saya bahawa anak saya patut disebat seratus kali dan dibuang negeri selama setahun, dan bahawa hukuman rejam hanya untuk isterinya.” Maka Rasulullah SAW bersabda: “Demi Allah yang jiwa ku berada di tangan-Nya, sesungguhnya Aku akan memutuskan di antara kamu dengan Kitabullah. Adapun kambing dan hamba perempuanmu, ia dikembalikan kepadamu. Adapun anakmu, dia hendaklah disebat seratus kali dan dibuang negeri selama setahun. Adapun engkau, wahai Unais, pergilah kepada isteri lelaki ini, dan jika dia mengaku, maka rejamlah dia.” Maka dia mengaku dan direjam.",
        "arabic_text": "عَنْ أَبِي هُرَيْرَةَ وَزَيْدِ بْنِ خَالِدٍ: أَنَّ رَجُلَيْنِ اخْتَصَمَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَحَدُهُمَا: اقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ وَقَالَ الْآخَرُ: أَجَلْ يَا رَسُولَ اللَّهِ فاقْضِ بَيْننَا بكتابِ الله وائذَنْ لِي أَنْ أَتَكَلَّمَ قَالَ: «تَكَلَّمْ» قَالَ: إِنَّ ابْنِي كَانَ عَسِيفًا عَلَى هَذَا فَزَنَى بِامْرَأَتِهِ فَأَخْبرُونِي أنَّ على ابْني الرَّجْم فاقتديت مِنْهُ بِمِائَةِ شَاةٍ وَبِجَارِيَةٍ لِي ثُمَّ إِنِّي سَأَلْتُ أَهْلَ الْعِلْمِ فَأَخْبَرُونِي أَنَّ عَلَى ابْنِي جَلْدَ مِائَةٍ وَتَغْرِيبَ عَامٍ وَإِنَّمَا الرَّجْمُ عَلَى امْرَأَتِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَمَا وَالَّذِي نَفْسِي بِيَدِهِ لَأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ أَمَّا غَنَمُكَ وَجَارِيَتُكَ فَرَدٌّ عَلَيْكَ وَأَمَّا ابْنُكَ فَعَلَيْهِ جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ وَأَمَّا أَنْتَ يَا أُنَيْسُ فَاغْدُ إِلَى امْرَأَةِ هَذَا فَإِن اعْترفت فارجمها» فَاعْترفت فرجمها"
      },
      {
        "id": 32250,
        "hadith_number": "3556",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman bagi Zina Tanpa Perkahwinan",
        "perawi_melayu": "Zayd bin Khalid",
        "english_text": "And from Zayd ibn Khalid, he said: I heard the Prophet (peace and blessings of Allah be upon him) ordering for one who commits zina (unmarried fornication) one hundred lashes and exile for a year.",
        "malay_translation": "Daripada Zayd bin Khalid, beliau berkata: Saya mendengar Nabi Muhammad SAW memerintahkan hukuman seratus sebatan dan pengasingan selama setahun bagi seseorang yang melakukan zina (zina tanpa perkahwinan).",
        "arabic_text": "وَعَنْ زَيْدِ بْنِ خَالِدٍ قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُ فِيمَنْ زَنَى وَلَمْ يُحْصَنْ جَلْدَ مِائَةٍ وَتَغْرِيبَ عَامٍ. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32251,
        "hadith_number": "3557",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Rajam dalam Islam",
        "perawi_melayu": "Umar r.a.",
        "english_text": "From Umar (may Allah be pleased with him), he said: Indeed, Allah sent Muhammad and revealed the Book upon him. Among what Allah the Almighty revealed was the verse of stoning. The Messenger of Allah (peace and blessings be upon him) stoned, and we stoned after him. Stoning is a right in Allah's Book upon whoever commits adultery, if they are proven to be chaste men and women, if the evidence is established or there is pregnancy or confession.",
        "malay_translation": "Daripada Umar r.a., beliau berkata:  Sesungguhnya Allah telah mengutus Muhammad s.a.w. dan menurunkan Kitab kepadanya.  Antaranya apa yang Allah SWT turunkan ialah ayat berkenaan hukum rajam. Rasulullah s.a.w. telah melakukan rajam, dan kami pun melakukannya selepas baginda. Rajam adalah satu hak dalam Kitab Allah ke atas sesiapa yang melakukan zina, jika mereka terbukti sebagai lelaki dan perempuan yang sudah bernikah, jika bukti telah kukuh atau terdapat kehamilan atau pengakuan.",
        "arabic_text": "وَعَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُ قَالَ: إِن الله بعث مُحَمَّدًا وَأَنْزَلَ عَلَيْهِ الْكِتَابَ فَكَانَ مِمَّا أَنْزَلَ اللَّهُ تَعَالَى آيَةُ الرَّجْمِ رَجَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَجَمْنَا بَعْدَهُ وَالرَّجْمُ فِي كِتَابِ اللَّهِ حَقٌّ عَلَى مَنْ زَنَى إِذَا أُحْصِنَ مِنَ الرِّجَالِ وَالنِّسَاءِ إِذَا قَامَتِ الْبَيِّنَةُ أَوْ كانَ الحَبَلُ أَو الِاعْتِرَاف"
      },
      {
        "id": 32252,
        "hadith_number": "3558",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Zina bagi yang Belum dan Sudah Berkahwin",
        "perawi_melayu": "Ubadah bin as-Samit RA",
        "english_text": "Narrated Ubadah bin as-Samit: The Prophet (peace and blessings be upon him) said, 'Take from me, take from me. Allah has made a way for them. For the unmarried with the unmarried (fornication), (the punishment is) one hundred lashes and exile for a year. And for the married with the married (adultery), (the punishment is) one hundred lashes and stoning.'",
        "malay_translation": "Daripada Ubadah bin as-Samit RA, bahawa Nabi SAW bersabda: 'Ambillah dariku, ambillah dariku. Sesungguhnya Allah telah menetapkan jalan (hukum) bagi mereka: Bagi yang belum berkahwin dengan yang belum berkahwin (zina), (hukumannya) seratus kali sebatan dan pengasingan selama setahun. Dan bagi yang sudah berkahwin dengan yang sudah berkahwin (zina), (hukumannya) seratus kali sebatan dan rejam.'",
        "arabic_text": "وَعَنْ عُبَادَةَ بْنِ الصَّامِتِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: خُذُوا عَنِّي خُذُوا عَنِّي قَدْ جَعَلَ اللَّهُ لَهُنَّ سَبِيلًا: الْبِكْرُ بالبكر جلد مائَة ووتغريب عَام وَالثَّيِّب بِالثَّيِّبِ جلد مائَة وَالرَّجم"
      },
      {
        "id": 32253,
        "hadith_number": "3559",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman Rejam dalam Taurat",
        "perawi_melayu": "Abdullah bin Umar",
        "english_text": "From Abdullah bin Umar: The Jews came to the Messenger of Allah (peace be upon him) and mentioned that a man and a woman among them had committed adultery. The Messenger of Allah (peace be upon him) asked them, \"What do you find in the Torah regarding the punishment of stoning?\" They said, \"We disgrace them and flog them.\" Abdullah bin Salam said, \"You are lying. Indeed, stoning is in it. Bring the Torah.\" They brought the Torah and opened it. One of them placed his hand on the verse of stoning and read what was before and after it. Abdullah bin Salam said, \"Lift your hand.\" He lifted his hand, and there was the verse of stoning. They said, \"You are right, O Muhammad, the verse of stoning is in it.\" So the Prophet (peace be upon him) ordered them to be stoned. In another narration: He said, \"Lift your hand.\" He lifted his hand, and there was the verse of stoning shining. He said, \"O Muhammad, indeed the verse of stoning is in it, but we conceal it among ourselves.\" So he ordered them to be stoned.",
        "malay_translation": "Daripada Abdullah bin Umar: Sesungguhnya orang-orang Yahudi datang kepada Rasulullah ﷺ dan menyebutkan kepada baginda bahawa seorang lelaki dan seorang wanita dalam kalangan mereka telah berzina. Rasulullah ﷺ bertanya kepada mereka, \"Apakah yang kamu dapati dalam Taurat mengenai hukuman rejam?\" Mereka berkata, \"Kami memalukan mereka dan mencambuk mereka.\" Abdullah bin Salam berkata, \"Kamu berdusta. Sesungguhnya rejam ada di dalamnya. Bawalah Taurat.\" Mereka membawa Taurat dan membukanya. Salah seorang daripada mereka meletakkan tangannya di atas ayat rejam dan membaca apa yang sebelumnya dan apa yang sesudahnya. Abdullah bin Salam berkata, \"Angkat tanganmu.\" Dia mengangkat tangannya, dan ternyata di situ ada ayat rejam. Mereka berkata, \"Benar kamu, wahai Muhammad, ayat rejam ada di dalamnya.\" Maka Nabi ﷺ memerintahkan agar kedua-duanya direjam. Dalam riwayat lain: Baginda bersabda, \"Angkat tanganmu.\" Dia mengangkat tangannya, dan ternyata di situ ada ayat rejam yang bersinar. Dia berkata, \"Wahai Muhammad, sesungguhnya ayat rejam ada di dalamnya, tetapi kami menyembunyikannya di antara kami.\" Maka baginda memerintahkan agar kedua-duanya direjam.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ: أَن الْيَهُود جاؤوا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرُوا لَهُ أَنَّ رَجُلًا مِنْهُمْ وَامْرَأَةً زَنَيَا فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا تَجِدُونَ فِي التَّوْرَاةِ فِي شَأْنِ الرَّجْمِ؟» قَالُوا: نَفْضَحُهُمْ وَيُجْلَدُونَ قَالَ عَبْدُ اللَّهِ بْنُ سَلَامٍ: كَذَبْتُمْ إِنَّ فِيهَا الرَّجْمَ فَأْتُوا بِالتَّوْرَاةِ فَنَشَرُوهَا فَوَضَعَ أَحَدُهُمْ يَدَهُ عَلَى آيَةِ الرَّجْمِ فَقَرَأَ مَا قَبْلَهَا وَمَا بَعْدَهَا فَقَالَ عَبْدُ اللَّهِ بْنُ سَلَامٍ: ارْفَعْ يَدَكَ فَرَفَعَ فإِذا فِيهَا آيةُ الرَّجم. فَقَالُوا: صدقَ يَا محمَّدُ فِيهَا آيَة الرَّجْم. فَأمر بهما النَّبِي صلى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرُجِمَا. وَفِي رِوَايَةٍ: قَالَ: ارْفَعْ يَدَكَ فَرَفَعَ فَإِذَا فِيهَا آيَةُ الرَّجْمِ تَلُوحُ فَقَالَ: يَا مُحَمَّدُ إِنَّ فِيهَا آيَةَ الرَّجْمِ وَلِكِنَّا نَتَكَاتَمُهُ بَيْنَنَا فَأَمَرَ بِهِمَا فَرُجِمَا"
      },
      {
        "id": 32254,
        "hadith_number": "3560",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman Zina",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah r.a., katanya: Seorang lelaki datang kepada Nabi SAW ketika baginda berada di masjid lalu berkata, \"Wahai Rasulullah, sesungguhnya aku telah berzina.\" Nabi SAW berpaling darinya. Lelaki itu berpindah ke arah lain lalu berkata lagi, \"Sesungguhnya aku telah berzina.\" Nabi SAW masih berpaling darinya. Setelah lelaki itu mengulang pengakuannya sebanyak empat kali, barulah Nabi SAW memanggilnya dan bertanya, \"Adakah engkau gila?\" Lelaki itu menjawab, \"Tidak.\" Nabi SAW bertanya lagi, \"Adakah engkau sudah berkahwin?\" Lelaki itu menjawab, \"Ya, wahai Rasulullah.\" Baginda bersabda, \"Bawalah dia dan rajamlah dia.\" Ibn Shihab berkata:  Seorang yang mendengar Jabir ibn Abdullah berkata: Kami telah merajamnya di Madinah. Setelah batu-batu mengenai tubuhnya, dia melarikan diri sehingga kami mengejarnya ke Harrah lalu kami terus merajamnya sehingga dia mati.  Dalam riwayat Bukhari pula menyebut:  daripada Jabir, selepas berkata: \"Ya\", baginda memerintahkan agar dia dirajam di masjid. Setelah batu-batu mengenai tubuhnya, dia melarikan diri, lalu dia ditangkap dan dirajam sehingga mati.  Nabi SAW kemudian mendoakan kebaikan untuknya dan mendoakan kesejahteraan ke atasnya.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ وَهُوَ فِي الْمَسْجِدِ فَنَادَاهُ: يَا رَسُولَ اللَّهِ إِنِّي زَنَيْتُ فَأَعْرَضَ عَنْهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَنَحَّى لِشِقِّ وَجْهِهِ الَّذِي أَعْرَضَ قِبَلَهُ فَقَالَ: إِنِّي زَنَيْتُ فَأَعْرَضَ عَنْهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا شَهِدَ أَرْبَعَ شَهَادَاتٍ دَعَاهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «أَبِكَ جُنُونٌ؟» قَالَ: لَا فَقَالَ: «أُحْصِنْتَ؟» قَالَ: نَعَمْ يَا رَسُولَ اللَّهِ قَالَ: «اذْهَبُوا بِهِ فَارْجُمُوهُ» قَالَ ابْنُ شِهَابٍ: فَأَخْبَرَنِي مَنْ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ: فَرَجَمْنَاهُ بِالْمَدِينَةِ فَلَمَّا أَذْلَقَتْهُ الْحِجَارَةُ هَرَبَ حَتَّى أَدْرَكْنَاهُ بِالْحَرَّةِ فرجمناه حَتَّى مَاتَ وَفِي رِوَايَةٍ لِلْبُخَارِيِّ: عَنْ جَابِرٍ بَعْدَ قَوْلِهِ: قَالَ: نَعَمْ فَأَمَرَ بِهِ فَرُجِمَ بِالْمُصَلَّى فَلَمَّا أَذْلَقَتْهُ الْحِجَارَةُ فَرَّ فَأُدْرِكَ فَرُجِمَ حَتَّى مَاتَ. فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خيرا وَصلى عَلَيْهِ"
      },
      {
        "id": 32255,
        "hadith_number": "3561",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pengakuan Zina Ma'iz dan Hukuman Rejam",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Teks Hadis dalam Bahasa Inggeris",
        "malay_translation": "Daripada Ibn Abbas RA berkata: Ketika Ma'iz bin Malik datang kepada Nabi SAW, lalu baginda bersabda kepadanya: 'Mungkin engkau telah mencium, atau mengenyitkan mata, atau melihat?' Dia berkata: 'Tidak wahai Rasulullah.' Baginda bersabda: 'Adakah engkau telah menyetubuhinya?' Baginda tidak menggunakan kiasan. Dia berkata: 'Ya.' Maka pada ketika itu baginda memerintahkan supaya dia direjam. Riwayat Bukhari.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: لَمَّا أَتَى مَاعِزُ بن مَالك النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُ: «لَعَلَّكَ قَبَّلْتَ أَوْ غَمَزْتَ أَوْ نَظَرْتَ؟» قَالَ: لَا يَا رَسُولَ اللَّهِ قَالَ: «أَنِكْتَهَا؟» لَا يُكَنِّي قَالَ: نَعَمْ فَعِنْدَ ذَلِكَ أَمر رجمه. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32256,
        "hadith_number": "3562",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kisah Ma'iz bin Malik dan Wanita Ghamidiyyah: Pengakuan Zina dan Pelaksanaan Hukuman",
        "perawi_melayu": "Buraidah",
        "english_text": "No English Text",
        "malay_translation": "Daripada Buraidah RA, beliau berkata: Ma'iz bin Malik datang kepada Nabi SAW dan berkata: “Wahai Rasulullah, sucikanlah aku.” Baginda SAW bersabda: “Celakalah engkau, pulanglah dan beristighfarlah kepada Allah dan bertaubatlah kepada-Nya.” Dia berkata: Maka dia kembali tidak jauh kemudian datang lagi dan berkata: “Wahai Rasulullah, sucikanlah aku.” Nabi SAW bersabda seperti itu sehingga ketika kali keempat, Rasulullah SAW berkata kepadanya: “Dari apa aku hendak menyucikanmu?” Dia berkata: “Dari zina.” Rasulullah SAW bersabda: “Adakah dia gila?” Maka diberitahu bahawa dia tidak gila. Baginda bersabda: “Adakah dia minum arak?” Maka seorang lelaki bangun dan menghidu mulutnya dan tidak mendapati bau arak daripadanya. Baginda bersabda: “Adakah kamu berzina?” Dia berkata: “Ya.” Maka baginda memerintahkan supaya dia direjam. Maka mereka berdiam diri selama dua atau tiga hari. Kemudian Rasulullah SAW datang dan bersabda: “Beristighfarlah kamu untuk Ma'iz bin Malik, sesungguhnya dia telah bertaubat dengan taubat yang jika dibahagikan kepada suatu umat, nescaya mencukupi bagi mereka.” Kemudian datanglah seorang wanita dari Ghamid dari Azd dan berkata: “Wahai Rasulullah, sucikanlah aku.” Baginda SAW bersabda: “Celakalah engkau, pulanglah dan beristighfarlah kepada Allah dan bertaubatlah kepada-Nya.” Dia berkata: “Adakah engkau ingin menolak aku sebagaimana engkau menolak Ma'iz bin Malik? Sesungguhnya aku hamil kerana zina.” Baginda bersabda: “Engkau?” Dia berkata: “Ya.” Baginda bersabda kepadanya: “Sehingga kamu melahirkan apa yang ada dalam perutmu.” Dia berkata: Maka seorang lelaki dari Ansar menjaminnya sehingga dia melahirkan. Kemudian lelaki itu datang kepada Nabi SAW dan berkata: “Ghamidiyyah telah melahirkan.” Baginda bersabda: “Jika demikian, kita tidak merejamnya dan meninggalkan anaknya yang masih kecil yang tidak mempunyai orang untuk menyusukannya.” Maka seorang lelaki dari Ansar bangun dan berkata: “Aku yang akan menyusukannya wahai Nabi Allah.” Dia berkata: Maka baginda merejamnya. Dalam riwayat lain: Bahawa baginda bersabda kepadanya: “Pergilah sehingga kamu melahirkan.” Ketika dia melahirkan, baginda bersabda: “Pergilah dan susukanlah dia sehingga kamu menceraikannya susu.” Ketika dia menceraikannya susu, dia datang kepadanya dengan membawa anak kecil itu di tangannya sekeping roti. Dia berkata: “Ini wahai Nabi Allah, aku telah menceraikannya susu dan dia telah makan makanan.” Maka baginda menyerahkan anak kecil itu kepada seorang lelaki dari kalangan Muslimin kemudian memerintahkan tentangnya maka digalikan lubang untuknya sehingga dadanya dan memerintahkan orang ramai maka mereka merejamnya. Maka Khalid bin al-Walid datang dengan membawa batu lalu melempar kepalanya maka memancutlah darah ke wajah Khalid lalu dia mencacinya. Maka Nabi SAW bersabda: “Perlahan-lahan wahai Khalid, demi Zat yang jiwaku berada di tangan-Nya, sesungguhnya dia telah bertaubat dengan taubat yang jika bertaubat dengannya seorang pemungut cukai nescaya diampuni baginya.” Kemudian baginda memerintahkan tentangnya maka baginda menyolatkannya dan dikebumikannya. Riwayat Muslim",
        "arabic_text": "وَعَنْ بُرَيْدَةَ قَالَ: جَاءَ مَاعِزُ بْنُ مَالِكٍ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا رَسُولَ اللَّهِ طَهِّرْنِي فَقَالَ: «وَيْحَكَ ارْجِعْ فَاسْتَغْفر الله وَتب إِلَيْهِ» . فَقَالَ: فَرَجَعَ غَيْرَ بَعِيدٍ ثُمَّ جَاءَ فَقَالَ: يَا رَسُولَ اللَّهِ طَهِّرْنِي. فَقَالَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَ ذَلِكَ حَتَّى إِذَا كَانَتِ الرَّابِعَة قَالَه لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «فِيمَ أُطَهِّرُكَ؟» قَالَ: مِنَ الزِّنَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَبِهِ جُنُونٌ؟» فَأُخْبِرَ أَنَّهُ لَيْسَ بِمَجْنُونٍ فَقَالَ: «أَشَرِبَ خَمْرًا؟» فَقَامَ رَجُلٌ فَاسْتَنْكَهَهُ فَلَمْ يَجِدْ مِنْهُ رِيحَ خَمْرٍ فَقَالَ: «أَزَنَيْتَ؟» قَالَ: نَعَمْ فَأَمَرَ بِهِ فَرُجِمَ فَلَبِثُوا يَوْمَيْنِ أَوْ ثَلَاثَةً ثُمَّ جَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «اسْتَغْفِرُوا لِمَاعِزِ بْنِ مَالِكٍ لَقَدْ تَابَ تَوْبَةً لَوْ قُسِّمَتْ بَيْنَ أُمَّةٍ لَوَسِعَتْهُمْ» ثُمَّ جَاءَتْهُ امْرَأَةٌ مِنْ غَامِدٍ مِنَ الْأَزْدِ فَقَالَتْ: يَا رَسُولَ اللَّهِ طَهِّرْنِي فَقَالَ: «وَيَحَكِ ارْجِعِي فَاسْتَغْفِرِي اللَّهَ وَتُوبِي إِلَيْهِ» فَقَالَتْ: تُرِيدُ أَنْ تَرْدُدَنِي كَمَا رَدَدْتَ مَاعِزَ بْنَ مَالِكٍ: إِنَّهَا حُبْلَى مِنَ الزِّنَا فَقَالَ: «أَنْتِ؟» قَالَتْ: نَعَمْ قَالَ لَهَا: «حَتَّى تَضَعِي مَا فِي بَطْنِكِ» قَالَ: فكَفَلَها رَجُلٌ مِنَ الْأَنْصَارِ حَتَّى وَضَعَتْ فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: قَدْ وَضَعَتِ الغامديَّةُ فَقَالَ: «إِذاً لَا نرجُمها وندعُ وَلَدَهَا صَغِيرًا لَيْسَ لَهُ مَنْ يُرْضِعُهُ» فَقَامَ رَجُلٌ مِنَ الْأَنْصَارِ فَقَالَ: إِلَيَّ رَضَاعُهُ يَا نَبِيَّ اللَّهِ قَالَ: فَرَجَمَهَا. وَفِي رِوَايَةٍ: أَنَّهُ قَالَ لَهَا: «اذْهَبِي حَتَّى تَلِدِي» فَلَمَّا وَلَدَتْ قَالَ: «اذْهَبِي فَأَرْضِعِيهِ حَتَّى تَفْطِمِيهِ» فَلَمَّا فَطَمَتْهُ أَتَتْهُ بِالصَّبِيِّ فِي يَدِهِ كِسْرَةُ خُبْزٍ فَقَالَتْ: هَذَا يَا نَبِيَّ اللَّهِ قَدْ فَطَمْتُهُ وَقَدْ أَكَلَ الطَّعَامَ فَدَفَعَ الصَّبِيَّ إِلَى رَجُلٍ مِنَ الْمُسْلِمِينَ ثُمَّ أَمَرَ بِهَا فَحُفِرَ لَهَا إِلَى صَدْرِهَا وَأَمَرَ النَّاسَ فَرَجَمُوهَا فَيُقْبِلُ خَالِدُ بْنُ الْوَلِيدِ بِحَجْرٍ فَرَمَى رَأْسَهَا فَتَنَضَّحَ الدَّمُ عَلَى وَجْهِ خَالِدٍ فَسَبَّهَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «مهلا يَا خَالِد فو الَّذِي نَفْسِي بِيَدِهِ لَقَدْ تَابَتْ تَوْبَةً لَوْ تَابَهَا صَاحِبُ مَكْسٍ لَغُفِرَ لَهُ» ثُمَّ أَمَرَ بِهَا فصلى عَلَيْهَا ودفنت. رَوَاهُ مُسلم"
      },
      {
        "id": 32257,
        "hadith_number": "3563",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": " Hukuman Wanita Yang Berzina",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "From Abu Hurairah (RA): I heard the Prophet (ﷺ) saying, “If a female slave of one of you commits adultery and it is proven, then let him flog her with the prescribed punishment and not dismiss her. Then, if she commits adultery again, let him flog her with the prescribed punishment and not dismiss her. Then, if she commits adultery for the third time and it is proven, let him sell her, even for a rope of hair.”",
        "malay_translation": "Daripada Abu Hurairah r.a., katanya: Aku mendengar Nabi SAW bersabda: “Jika hamba perempuan salah seorang daripada kamu berzina dan ia terbukti, maka hendaklah dia disebat dengan hukuman yang telah ditetapkan dan jangan dilepaskan. Kemudian, jika dia berzina lagi, hendaklah dia disebat dengan hukuman yang telah ditetapkan dan jangan dilepaskan. Kemudian, jika dia berzina untuk kali ketiga dan ia terbukti, maka hendaklah dia dijual, walaupun hanya dengan seutas tali rambut.”",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِذَا زَنَتْ أَمَةُ أَحَدِكُمْ فَتَبَيَّنَ زِنَاهَا فَلْيَجْلِدْهَا الحدَّ وَلَا يُثَرِّبْ عَلَيْهَا ثمَّ إِنْ زنَتْ فلْيجلدْها الحدَّ وَلَا يُثَرِّبْ ثُمَّ إِنْ زَنَتِ الثَّالِثَةَ فَتَبَيَّنَ زِنَاهَا فَلْيَبِعْهَا ولوْ بحبْلٍ منْ شعرٍ»"
      },
      {
        "id": 32258,
        "hadith_number": "3564",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Hudud Terhadap Wanita Yang Berzina Selepas Bersalin",
        "perawi_melayu": "Ali r.a.",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ali r.a., katanya: Wahai manusia, tegakkanlah hudud ke atas hamba-hamba perempuan kamu, sama ada yang suci mahupun yang tidak suci. Sesungguhnya, seorang hamba perempuan Rasulullah SAW telah berzina, lalu baginda menyuruhku untuk mencambuknya. Tetapi, rupa-rupanya dia baru sahaja habis nifas. Aku bimbang jika aku mencambuknya, dia akan mati. Lalu aku ceritakan hal itu kepada Nabi SAW, maka baginda bersabda: \"Engkau telah berbuat baik.\"  (Riwayat Muslim). Dalam riwayat Abu Daud pula, baginda bersabda: \"Biarkan dia sehingga darah nifasnya berhenti, kemudian tegakkanlah hudud ke atasnya. Dan tegakkanlah hudud ke atas semua orang yang menjadi milik kamu.\" ",
        "arabic_text": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: يَا أَيُّهَا النَّاسُ أَقِيمُوا عَلَى أَرِقَّائِكُمُ الْحَدَّ مَنْ أُحْصِنَ مِنْهُمْ وَمَنْ لَمْ يُحْصَنْ فَإِنَّ أَمَةً لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَنَتْ فَأَمَرَنِي أَنْ أَجْلِدَهَا فَإِذَا هِيَ حَدِيثُ عَهْدٍ بِنِفَاسٍ فَخَشِيتُ إِنْ أَنَا جَلَدْتُهَا أَنْ أَقْتُلَهَا فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «أَحْسَنْتَ» . رَوَاهُ مُسْلِمٌ. وَفِي رِوَايَةِ أَبِي دَاوُدَ: قَالَ: «دَعْهَا حَتَّى يَنْقَطِعَ دَمُهَا ثُمَّ أَقِمْ عَلَيْهَا الْحَدَّ وَأَقِيمُوا الْحُدُودَ عَلَى مَا مَلَكَتْ أَيْمَانكُم»"
      },
      {
        "id": 32259,
        "hadith_number": "3565",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kisah Ma'az al-Aslami dan Hukuman Zina",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah r.a., beliau berkata: Ma'az al-Aslami datang kepada Rasulullah SAW lalu berkata, \"Sesungguhnya aku telah berzina.\"  Rasulullah SAW berpaling darinya. Kemudian dia datang lagi dari arah lain dan berkata, \"Sesungguhnya aku telah berzina.\" Rasulullah SAW berpaling darinya lagi. Kemudian dia datang lagi dari arah lain dan berkata, \"Wahai Rasulullah, sesungguhnya aku telah berzina.\" Maka Rasulullah SAW memerintahkan agar dia dihukum pada kali keempat.  Dia dibawa ke tempat hukuman di al-Harrah dan direjam dengan batu.  Apabila dia merasakan terkena batu, dia melarikan diri sekuat daya sehingga dia berselisih dengan seorang lelaki yang membawa tulang rahang unta. Dia memukul lelaki itu dengan tulang rahang unta tersebut. Kemudian orang ramai memukulnya sehingga mati.  Kisah ini disampaikan kepada Rasulullah SAW. Mereka berkata bahawa mereka gembira kerana Ma'az telah merasai terkena batu dan merasai maut.  Maka Rasulullah SAW bersabda:  \"Mengapa kamu tidak meninggalkannya?\"  (Riwayat al-Tirmizi dan Ibnu Majah.  Dalam riwayat lain: \"Mengapa kamu tidak meninggalkannya?  Mungkin Allah akan mengampuninya.\")",
        "arabic_text": "عَنْ أَبِي هُرَيْرَةَ قَالَ: جَاءَ مَاعِزٌ الْأَسْلَمِيُّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: إِنَّه قدْ زَنى فأعرضَ عَنهُ ثمَّ جَاءَ مِنْ شِقِّهِ الْآخَرِ فَقَالَ: إِنَّهُ قَدْ زنى فَأَعْرض عَنهُ ثمَّ جَاءَ من شقَّه الْآخَرِ فَقَالَ: يَا رَسُولَ اللَّهِ إِنَّهُ قَدْ زَنى فَأَمَرَ بِهِ فِي الرَّابِعَةِ فَأُخْرِجَ إِلَى الْحَرَّةِ فَرُجِمَ بِالْحِجَارَةِ فَلَمَّا وَجَدَ مَسَّ الْحِجَارَةِ فَرَّ يَشْتَدُّ حَتَّى مَرَّ بِرَجُلٍ مَعَهُ لَحْيُ جَمَلٍ فَضَرَبَهُ بِهِ وَضَرَبَهُ النَّاسُ حَتَّى مَاتَ. فَذَكَرُوا ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنه فرحين وَجَدَ مَسَّ الْحِجَارَةِ وَمَسَّ الْمَوْتِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَلَّا تَرَكْتُمُوهُ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَفِي رِوَايَةٍ: «هَلَّا تَرَكْتُمُوهُ لَعَلَّه أَن يَتُوب الله عَلَيْهِ»"
      },
      {
        "id": 32260,
        "hadith_number": "3566",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tuduhan Zina dan Hukumannya",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "From Ibn Abbas that the Prophet (peace and blessings of Allah be upon him) said to Ma'az ibn Malik: “Is what has reached me about you true?” He said: “And what has reached you about me?” He said: “It has reached me that you have committed zina with the female slave of so and so.” He said: “Yes.” So he bore witness four times, and he was ordered to be stoned.",
        "malay_translation": "Daripada Ibnu Abbas bahawa Nabi SAW telah bertanya kepada Ma'az bin Malik: “Adakah benar apa yang sampai kepadaku tentangmu?” Dia menjawab: “Dan apakah yang sampai kepadamu tentangku?” Baginda bersabda: “Telah sampai kepadaku bahawa engkau telah melakukan zina dengan hamba perempuan keluarga si fulan.” Dia menjawab: “Ya.” Maka dia bersaksi empat kali, lalu Baginda memerintahkan supaya dia direjam.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِمَاعِزِ بْنِ مَالِكٍ: «أَحَقٌّ مَا بَلَغَنِي عَنْكَ؟» قَالَ: وَمَا بَلَغَكَ عَنِّي؟ قَالَ: «بَلَغَنِي أَنَّكَ قَدْ وَقَعْتَ عَلَى جَارِيَةِ آلِ فُلَانٍ» قَالَ: نَعَمْ فَشَهِدَ أَرْبَعَ شَهَادَاتٍ فَأمر بهِ فرجم. رَوَاهُ مُسلم"
      },
      {
        "id": 32261,
        "hadith_number": "3567",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pengakuan Ma'iz dan Hukuman Rejam",
        "perawi_melayu": "Tidak diketahui",
        "english_text": "Tiada teks Bahasa Inggeris disediakan.",
        "malay_translation": "Daripada Yazid bin Nu'aim daripada bapanya, bahawa Ma'iz telah datang kepada Nabi ﷺ dan mengaku di hadapannya sebanyak empat kali. Lalu Nabi ﷺ memerintahkan supaya dia direjam. Baginda bersabda kepada Hazzal: 'Sekiranya kamu menutupinya dengan pakaianmu, itu adalah lebih baik bagimu.' Ibn al-Munkadir berkata: Sesungguhnya Hazzal telah menyuruh Ma'iz untuk datang kepada Nabi ﷺ dan memberitahu baginda tentang hal ini. Riwayat Abu Daud.",
        "arabic_text": "وَعَنْ يَزِيدَ بْنِ نُعَيْمٍ عَنْ أَبِيهِ أَنَّ مَاعِزًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَقَرَّ عِنْدَهُ أَرْبَعَ مَرَّاتٍ فَأَمَرَ بِرَجْمِهِ وَقَالَ لِهَزَّالٍ: «لَوْ سَتَرْتَهُ بِثَوْبِكَ كَانَ خَيْرًا لَكَ» قَالَ ابْنُ الْمُنْكَدِرِ: إِنَّ هَزَّالًا أَمَرَ مَاعِزًا أَنْ يَأْتِيَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فيخبره. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32262,
        "hadith_number": "3568",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Bertolak ansur dalam perhubungan sesama manusia",
        "perawi_melayu": "Amru bin Shu'aib daripada bapanya daripada datuknya, Abdullah bin Amru bin al-'Ash R.A.",
        "english_text": "Not Available",
        "malay_translation": "Daripada Amru bin Shu'aib daripada bapanya daripada datuknya, Abdullah bin Amru bin al-'Ash R.A., bahawa Rasulullah S.A.W. bersabda:  “Bertolak ansurlah sesama kamu dalam hal-hal perhubungan.  Apa sahaja had yang telah sampai kepadaku, maka ia telah wajib.” Riwayat Abu Daud dan an-Nasaie.",
        "arabic_text": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَبْدِ اللَّهِ بْنِ عَمْرٍو بْنِ الْعَاصِ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «تَعَافَوُا الْحُدُودَ فِيمَا بَيْنَكُمْ فَمَا بَلَغَنِي مِنْ حَدٍّ فَقَدْ وَجَبَ» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ"
      },
      {
        "id": 32263,
        "hadith_number": "3569",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Maafkan Kesilapan Orang Beriman Kecuali Bagi Jenayah Yang Berkaitan Hukuman",
        "perawi_melayu": "Aisyah r.a.",
        "english_text": "From Aisha (RA) that the Prophet (ﷺ) said: \"Excuse the mistakes of those who have faith, except for the limits (Hudud)\".",
        "malay_translation": "Daripada Aisyah r.a. bahawa Nabi SAW bersabda: “Maafkan kesilapan orang-orang yang beriman, kecuali bagi jenayah yang berkaitan hukuman (Hudud).”",
        "arabic_text": "وَعَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أقيلوا ذَوي الهيآت عثراتهم إِلَّا الْحُدُود» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32264,
        "hadith_number": "3570",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Memaafkan dalam Hukuman",
        "perawi_melayu": "Riwayat daripada  (nama perawi tidak dinyatakan dalam data asal)",
        "english_text": "Not Available",
        "malay_translation": "Daripada (nama perawi wanita tidak dinyatakan dalam data asal), beliau berkata: Rasulullah SAW bersabda:  “Cegahlah hukuman daripada umat Islam seberapa yang kamu mampu. Jika terdapat jalan keluar baginya, maka bebaskanlah jalannya. Sesungguhnya, bagi seorang imam, lebih baik dia melakukan kesilapan dalam memaafkan daripada melakukan kesilapan dalam menghukum.”  Riwayat Tirmizi dan beliau berkata: Ia telah diriwayatkan daripada (nama perawi wanita) tetapi tidak disandarkan kepada Rasulullah SAW. Dan ia adalah lebih sahih.",
        "arabic_text": "وَعَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «ادرؤا الْحُدُودَ عَنِ الْمُسْلِمِينَ مَا اسْتَطَعْتُمْ فَإِنْ كَانَ لَهُ مَخْرَجٌ فَخَلُّوا سَبِيلَهُ فَإِنَّ الْإِمَامَ أَنْ يُخْطِئَ فِي الْعَفْوِ خَيْرٌ مِنْ أَنْ يُخْطِئَ فِي الْعُقُوبَةِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: قَدْ رُوِيَ عَنْهَا وَلم يرفع وَهُوَ أصح"
      },
      {
        "id": 32265,
        "hadith_number": "3571",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Wanita Dipaksa dan Hukuman Dikenakan kepada Pelaku, Bukan Pemberian Mahar",
        "perawi_melayu": "Wa'il bin Hujr",
        "english_text": "And from Wa'il bin Hujr who said: A woman was forced during the time of the Prophet (peace and blessings of Allah be upon him), so he averted the punishment from her and imposed it on the one who assaulted her, and it was not mentioned that he made a dowry for her. Narrated by al-Tirmidhi.",
        "malay_translation": "Daripada Wa'il bin Hujr RA berkata: Seorang wanita dipaksa (berzina) pada zaman Nabi SAW, maka baginda menghindarkan hukuman had daripadanya dan mengenakan hukuman tersebut kepada lelaki yang menzinainya. Tidak pula disebut bahawa Nabi SAW menetapkan mahar (mas kahwin) untuk wanita itu. Riwayat at-Tirmizi.",
        "arabic_text": "وَعَنْ وَائِلِ بْنِ حُجْرٍ قَالَ: اسْتُكْرِهَتِ امْرَأَةٌ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَرَأَ عَنْهَا الْحَدَّ وَأَقَامَهُ عَلَى الَّذِي أَصَابَهَا وَلَمْ يُذْكَرْ أَنَّهُ جَعَلَ لَهَا مَهْرًا. رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 32266,
        "hadith_number": "3572",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman Rejam dan Taubat Pelaku Zina",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Narrated from Abu Hurairah: A woman went out during the time of the Prophet (peace and blessings of Allah be upon him) intending to pray. A man met her, overpowered her, and satisfied his desire with her. She shouted, and he left. A group of Muhajirin passed by, and she said, \"That man did such and such to me.\" They seized the man and brought him to the Messenger of Allah (peace and blessings of Allah be upon him). He said to her, \"Go, for Allah has forgiven you.\" And he said about the man who had intercourse with her, \"Stone him.\" And he said, \"He has repented with a repentance that if the people of Medina were to repent with it, it would be accepted from them.\"",
        "malay_translation": "Daripada Abu Hurairah RA: Sesungguhnya seorang wanita keluar pada zaman Nabi SAW dengan tujuan untuk solat. Kemudian seorang lelaki menemuinya, lalu memaksanya dan memenuhi hajatnya terhadap wanita tersebut. Wanita itu menjerit, dan lelaki itu pergi. Kemudian serombongan Muhajirin lalu, dan wanita itu berkata, \"Sesungguhnya lelaki itu telah melakukan demikian dan demikian kepadaku.\" Lalu mereka menangkap lelaki itu dan membawanya kepada Rasulullah SAW. Baginda bersabda kepada wanita itu, \"Pergilah, sesungguhnya Allah telah mengampunkanmu.\" Dan Baginda bersabda mengenai lelaki yang telah melakukan zina dengannya, \"Rejamlah dia.\" Dan Baginda bersabda, \"Sesungguhnya dia telah bertaubat dengan taubat yang jika penduduk Madinah bertaubat dengannya, nescaya taubat itu akan diterima daripada mereka.\"",
        "arabic_text": "وَعَنْهُ: أَنَّ امْرَأَةً خَرَجَتْ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُرِيدُ الصَّلَاةَ فَتَلَقَّاهَا رَجُلٌ فَتَجَلَّلَهَا فَقَضَى حَاجَتَهُ مِنْهَا فَصَاحَتْ وَانْطَلَقَ وَمَرَّتْ عِصَابَةٌ مِنَ الْمُهَاجِرِينَ فَقَالَتْ: إِنَّ ذَلِكَ الرَّجُلَ فَعَلَ بِي كَذَا وَكَذَا فَأَخَذُوا الرَّجُلَ فَأَتَوْا بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهَا: «اذْهَبِي فَقَدْ غَفَرَ اللَّهُ لَكِ» وَقَالَ لِلرَّجُلِ الَّذِي وَقَعَ عَلَيْهَا: «ارْجُمُوهُ» وَقَالَ: «لَقَدْ تَابَ تَوْبَةً لَوْ تَابَهَا أَهْلُ الْمَدِينَةِ لَقُبِلَ مِنْهُمْ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ"
      },
      {
        "id": 32267,
        "hadith_number": "3573",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman Zina: Sebatan dan Rajam",
        "perawi_melayu": "Jabir",
        "english_text": "From Jabir: That a man committed adultery with a woman, so the Prophet (ﷺ) ordered him to be flogged the prescribed punishment. Then it was reported that he was a married man, so he ordered him to be stoned.",
        "malay_translation": "Dari Jabir: bahawa seorang lelaki melakukan zina dengan seorang perempuan, maka Nabi ﷺ memerintahkan supaya dia disebat dengan hukuman yang telah ditetapkan. Kemudian, dimaklumkan bahawa dia adalah seorang yang sudah berkahwin, maka Baginda memerintahkan supaya dia dirajam.",
        "arabic_text": "وَعَنْ جَابِرٍ: أَنَّ رَجُلًا زَنَى بِامْرَأَةٍ فَأَمَرَ بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجُلِدَ الْحَدَّ ثُمَّ أُخْبِرَ أَنَّهُ مُحْصَنٌ فَأَمَرَ بِهِ فرجم. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32268,
        "hadith_number": "3574",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rawatan untuk Orang Sakit",
        "perawi_melayu": "Sa'id bin Sa'd bin Ubadah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Sa'id bin Sa'd bin Ubadah, bahawa Saad bin Ubadah datang kepada Nabi SAW membawa seorang lelaki dari kaumnya yang sakit dan cacat.  Nabi SAW mendapati ada kudis pada salah seorang hamba perempuannya. Maka Nabi SAW bersabda:  «Ambillah baginya 'uthkal (ubat) yang mengandungi seratus syimrak, kemudian pukul (kudis) itu dengannya.» Riwayat ini terdapat dalam Syarah Sunnah, dan dalam riwayat Ibnu Majah adalah hampir sama.",
        "arabic_text": "وَعَنْ سَعِيدِ بْنِ سَعْدِ بْنِ عُبَادَةَ أَنَّ سَعْدَ بْنَ عُبَادَةَ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِرَجُلٍ كَانَ فِي الْحَيِّ مُخْدَجٍ سقيم فَوجدَ على أمة من إمَائِهِمْ بخبث بِهَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «خُذُوا لَهُ عِثْكَالًا فِيهِ مِائَةُ شِمْرَاخٍ فَاضْرِبُوهُ ضَرْبَة» . رَوَاهُ فِي شَرْحِ السُّنَّةِ وَفِي رِوَايَةِ ابْنِ مَاجَه نَحوه"
      },
      {
        "id": 32269,
        "hadith_number": "3575",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman bagi Perbuatan Kaum Lut",
        "perawi_melayu": "Ikrimah daripada Ibn Abbas",
        "english_text": "On the authority of Ikrimah from Ibn Abbas (RA) who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: 'Whoever you find doing the action of the people of Lot, then kill the doer and the one to whom it is done (homosexual).' Narrated by Tirmizi and Ibn Majah.",
        "malay_translation": "Daripada Ikrimah daripada Ibn Abbas RA, beliau berkata: Rasulullah SAW bersabda: 'Sesiapa yang kamu dapati melakukan perbuatan kaum Lut, maka bunuhlah pelaku dan orang yang diperlakukan (homoseksual).' Diriwayatkan oleh Tirmizi dan Ibn Majah.",
        "arabic_text": "وَعَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «من وَجَدْتُمُوهُ يَعْمَلُ عَمَلَ قَوْمِ لُوطٍ فَاقْتُلُوا الْفَاعِلَ وَالْمَفْعُول بِهِ» . رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه"
      },
      {
        "id": 32270,
        "hadith_number": "3576",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Membunuh Haiwan Yang Dijadikan Alat Seks",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "From Ibn Abbas, who said: The Messenger of Allah (ﷺ) said: “Whoever commits sodomy with an animal, kill him and kill the animal with him.” It was said to Ibn Abbas: What is the case with the animal? He said: I did not hear anything from the Messenger of Allah (ﷺ) in that regard, but I think he disliked that its meat be eaten or benefit be taken from it after such an act has been committed with it.  Narrated by Tirmidhi, Abu Dawud and Ibn Majah.",
        "malay_translation": "Daripada Ibnu Abbas, beliau berkata: Rasulullah SAW bersabda:  “Sesiapa yang melakukan liwat dengan haiwan, bunuhlah dia dan bunuhlah haiwan itu bersamanya.”  Ditanya kepada Ibnu Abbas: Apakah hukum haiwan tersebut?  Beliau menjawab: Saya tidak mendengar apa-apa daripada Rasulullah SAW mengenai perkara ini, tetapi saya beranggapan baginda tidak menyukai dagingnya dimakan atau manfaat diambil daripadanya selepas perbuatan tersebut dilakukan ke atasnya. Riwayat Tirmizi, Abu Daud dan Ibnu Majah.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَتَى بَهِيمَةً فَاقْتُلُوهُ وَاقْتُلُوهَا مَعَهُ» . قِيلَ لِابْنِ عَبَّاسٍ: مَا شَأْنُ الْبَهِيمَةِ؟ قَالَ: مَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ذَلِكَ شَيْئا وَلَكِن أره كَرِهَ أَنْ يُؤْكَلَ لَحْمُهَا أَوْ يُنْتَفَعَ بِهَا وَقَدْ فُعِلَ بِهَا ذَلِكَ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد وَابْن مَاجَه"
      },
      {
        "id": 32271,
        "hadith_number": "3577",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ketakutan Rasulullah SAW terhadap Ummatnya",
        "perawi_melayu": "Jabir",
        "english_text": "From Jabir, he said: The Messenger of Allah (ﷺ) said: \"Indeed, what I fear most for my Ummah is the actions of the people of Lut.\"",
        "malay_translation": "Dari Jabir, katanya: Rasulullah SAW bersabda:  \"Sesungguhnya, apa yang paling aku khuatirkan terhadap umatku ialah perbuatan kaum Lut.\"",
        "arabic_text": "عَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَخْوَفَ مَا أَخَافُ عَلَى أُمَّتِي عَمَلُ قَوْمِ لُوطٍ» . رَوَاهُ التِّرْمِذِيُّ وَابْن مَاجَه"
      },
      {
        "id": 32272,
        "hadith_number": "3578",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman Zina dan Fitnah",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "From Ibn Abbas: A man from Bani Bakr ibn Laith came to the Prophet ﷺ and confessed that he committed zina with a woman four times.  He was flogged one hundred lashes. He was a virgin. Then, the Prophet ﷺ asked for evidence from the woman. She said, \"He is lying by Allah, O Messenger of Allah.\" So he was flogged the hadd of false accusation.",
        "malay_translation": "Daripada Ibnu Abbas: Seorang lelaki daripada Bani Bakr bin Laith datang kepada Nabi SAW dan mengaku bahawa dia telah melakukan zina dengan seorang wanita sebanyak empat kali.  Lalu dia disebat seratus kali. Dia masih dara. Kemudian, Nabi SAW meminta keterangan daripada wanita itu. Wanita itu berkata, \"Dia berdusta demi Allah, wahai Rasulullah.\" Maka dia disebat dengan hukuman qadha' fitnah (tuduhan palsu).",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ رَجُلًا مِنْ بَنِي بَكْرِ بْنِ لَيْثٍ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَقَرَّ أَنَّهُ زَنَى بِامْرَأَةٍ أَرْبَعَ مَرَّاتٍ فَجَلَدَهُ مِائَةً وَكَانَ بِكْرًا ثُمَّ سَأَلَهُ الْبَيِّنَةَ عَلَى الْمَرْأَةِ فَقَالَتْ: كَذَبَ وَاللَّهِ يَا رَسُولَ اللَّهِ فَجُلِدَ حَدَّ الْفِرْيَةِ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32273,
        "hadith_number": "3579",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman Selepas Pengisytiharan Kebenaran Aisyah RA",
        "perawi_melayu": "Aisyah RA",
        "english_text": "Aisha (RA) narrated: When my innocence was revealed, the Prophet (peace and blessings of Allah be upon him) stood on the pulpit and mentioned it. After descending, he ordered the punishment for two men and a woman involved in the incident.",
        "malay_translation": "Daripada Aisyah RA berkata: Ketika kebenaran saya (dari fitnah) diturunkan, Nabi SAW berdiri di atas mimbar lalu menyebutkan hal tersebut. Setelah turun dari mimbar, baginda memerintahkan hukuman bagi dua lelaki dan seorang wanita yang terlibat dalam kejadian tersebut. Diriwayatkan oleh Abu Daud.",
        "arabic_text": "وَعَنْ عَائِشَةَ قَالَتْ: لَمَّا نَزَلَ عُذْرِي قَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ فَذَكَرَ ذَلِكَ فَلَمَّا نَزَلَ مِنَ الْمِنْبَرِ أَمَرَ بِالرَّجُلَيْنِ وَالْمَرْأَةِ فَضُرِبُوا حَدَّهُمْ. رَوَاهُ أَبُو دَاوُدَ"
      },
      {
        "id": 32274,
        "hadith_number": "3580",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman Terhadap Seorang Hamba Lelaki yang Merogol",
        "perawi_melayu": "Nafi'",
        "english_text": "From Nafi': That Safiyyah bint Abi Ubayd informed him that a slave from among the slaves of the governorship had intercourse with a female captive of the fifth (part of the spoils of war), and he forced her until he violated her.  Umar flogged him, but he did not flog her because he forced her.",
        "malay_translation": "Daripada Nafi': bahawa Safiyyah binti Abi Ubayd memberitahunya bahawa seorang hamba daripada kalangan hamba-hamba kerajaan telah melakukan hubungan seks dengan seorang perempuan tawanan daripada sebahagian daripada rampasan perang (khums), dan dia memaksanya sehingga dia mencabulnya. Umar telah menyeksa (memukul)nya, tetapi dia tidak menyeksa perempuan itu kerana dia telah dipaksa.",
        "arabic_text": "عَنْ نَافِعٍ: أَنَّ صَفِيَّةَ بِنْتَ أَبِي عُبَيْدٍ أَخْبَرَتْهُ أَنَّ عَبْدًا مِنْ رَقِيقِ الْإِمَارَةِ وَقَعَ على وليدةٍ من الخُمسِ فاستَكرهَها حَتَّى افتضَّها فَجَلَدَهُ عُمَرُ وَلَمْ يَجْلِدْهَا مِنْ أَجْلِ أَنَّهُ استكرهها. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32275,
        "hadith_number": "3581",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kisah Ma'iz bin Malik dan Hukuman Rajam",
        "perawi_melayu": "Yazid bin Nu'aim bin Hazzal daripada bapanya",
        "english_text": "Not Available",
        "malay_translation": "Dari Yazid bin Nu'aim bin Hazzal daripada bapanya, katanya:  Ma'iz bin Malik adalah seorang yatim di bawah jagaan ayahku. Dia telah melakukan zina dengan seorang wanita daripada kaum kami.  Maka ayahku berkata kepadanya: “Pergilah kepada Rasulullah SAW, beritakan kepadanya apa yang telah engkau lakukan, mudah-mudahan baginda mendoakan ampun bagimu.”  Ayahku hanya berharap dengan itu akan ada jalan keluar baginya. Maka pergilah dia kepada Rasulullah SAW lalu berkata: “Wahai Rasulullah, sesungguhnya aku telah melakukan zina. Tegakkanlah ke atasku hukum Allah.” Dia mengulanginya sebanyak empat kali.  Rasulullah SAW bersabda: “Sesungguhnya engkau telah mengulanginya sebanyak empat kali. Dengan siapakah?”  Jawabnya: “Dengan si fulanah.” Rasulullah SAW bertanya: “Adakah engkau bersetubuh dengannya?” Jawabnya: “Ya.”  Rasulullah SAW bertanya lagi: “Adakah engkau menyentuhnya?” Jawabnya: “Ya.” Rasulullah SAW bertanya lagi: “Adakah engkau menggauli dia?” Jawabnya: “Ya.”  Maka Rasulullah SAW memerintahkan agar dia dirajam. Dia dibawa ke al-Harrah.  Apabila dirajam, dia merasakan kesakitan terkena batu, lalu dia cuba melarikan diri. Abdullah bin Unais menemuinya ketika sahabat-sahabatnya telah keletihan.  Dia mengambil sebatang kayu daripada pengikat unta, lalu merajamnya sehingga mati.  Kemudian dia datang kepada Nabi SAW dan menceritakan hal itu. Nabi SAW bersabda: “Mengapa kamu tidak membiarkannya sahaja, mungkin dia akan bertaubat, lalu Allah akan mengampuninya.” Riwayat Abu Daud.",
        "arabic_text": "وَعَنْ يَزِيدَ بْنِ نُعَيْمِ بْنِ هَزَّالٍ عَنْ أَبِيهِ قَالَ: كَانَ مَاعِزُ بْنُ مَالِكٍ يَتِيمًا فِي حِجْرِ أَبِي فَأَصَابَ جَارِيَةً مِنَ الْحَيِّ فَقَالَ لَهُ أَبِي: ائْتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ بِمَا صَنَعْتَ لَعَلَّهُ يَسْتَغْفِرُ لَكَ وَإِنَّمَا يُرِيدُ بِذَلِكَ رَجَاءَ أَنْ يَكُونَ لَهُ مَخْرَجًا فَآتَاهُ فَقَالَ: يَا رَسُولَ اللَّهِ إِني زنيتُ فأقِمْ عليَّ كتابَ اللَّهِ حَتَّى قَالَهَا أَرْبَعَ مَرَّاتٍ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّكَ قَدْ قُلْتَهَا أَرْبَعَ مَرَّاتٍ فَبِمَنْ؟ قَالَ: بِفُلَانَةَ. قَالَ: «هَلْ ضَاجَعْتَهَا؟» قَالَ: نَعَمْ قَالَ: «هَلْ بَاشَرْتَهَا؟» قَالَ: نَعَمْ قَالَ: «هَلْ جَامَعْتَهَا؟» قَالَ: نَعَمْ قَالَ: فَأَمَرَ بِهِ أَنْ يُرْجَمَ فَأُخْرِجُ بِهِ إِلَى الْحَرَّةِ فَلَمَّا رُجِمَ فَوَجَدَ مَسَّ الْحِجَارَةِ فَجَزِعَ فَخَرَجَ يَشْتَدُّ فَلَقِيَهُ عَبْدُ اللَّهِ بْنُ أُنَيْسٍ وَقَدْ عَجَزَ أَصْحَابُهُ فَنَزَعَ لَهُ بِوَظِيفِ بَعِيرٍ فَرَمَاهُ بِهِ فَقَتَلَهُ ثُمَّ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ: «هَلَّا تَرَكْتُمُوهُ لَعَلَّهُ أَنْ يَتُوبَ. فَيَتُوبَ اللَّهُ عَلَيْهِ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32276,
        "hadith_number": "3582",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Azab Zina dan Rasuah",
        "perawi_melayu": "Amr bin al-'As",
        "english_text": "Not Available",
        "malay_translation": "Daripada Amr bin al-'As, katanya: Aku mendengar Rasulullah SAW bersabda:  \"Tidak ada satu kaum pun yang zina berleluasa di kalangan mereka melainkan mereka akan ditimpa dengan wabak penyakit, dan tidak ada satu kaum pun yang berleluasa dengan amalan rasuah di kalangan mereka melainkan mereka akan ditimpa dengan ketakutan.\"",
        "arabic_text": "وَعَنْ عَمْرِو بْنِ الْعَاصِ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَا مِنْ قَوْمٍ يَظْهَرُ فِيهِمُ الزِّنَا إِلَّا أُخِذُوا بِالسَّنَةِ وَمَا مِنْ قَوْمٍ يَظْهَرُ فِيهِمُ الرِّشَا إِلَّا أخذُوا بِالرُّعْبِ» . رَوَاهُ أَحْمد"
      },
      {
        "id": 32277,
        "hadith_number": "3583",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Laknat ke atas mereka yang melakukan perbuatan kaum Lut",
        "perawi_melayu": "Ibn Abbas dan Abu Hurairah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Abbas dan Abu Hurairah, bahawa Rasulullah SAW bersabda:  “Dilaknati sesiapa yang melakukan perbuatan kaum Lut.” Riwayat Razin.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ وَأَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَلْعُونٌ مَنْ عَمِلَ عَمَلَ قَوْمِ لُوطٍ» . رَوَاهُ رَزِينٌ"
      },
      {
        "id": 32278,
        "hadith_number": "3584",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ali dan Abu Bakar Mengenai Dua Patung",
        "perawi_melayu": "Daripada Ibnu Abbas",
        "english_text": "And in a narration from him from Ibn Abbas: That Ali (May Allah be pleased with him) burned them and Abu Bakr demolished a wall upon them.",
        "malay_translation": "Dan dalam satu riwayat daripada Ibnu Abbas: bahawa Ali r.a. membakar kedua-dua patung itu, manakala Abu Bakar r.a. meruntuhkan dinding ke atasnya.",
        "arabic_text": "وَفِي رِوَايَةٍ لَهُ عَنِ ابْنِ عَبَّاسٍ: أَنَّ عليَّاً رَضِي الله عَنهُ أحرَقَهما وَأَبا بكرٍ هدم عَلَيْهِمَا حَائِطا"
      },
      {
        "id": 32279,
        "hadith_number": "3585",
        "status": "Sahih Hasan Gharib",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mendatangi Lelaki atau Wanita pada Dubur Mereka",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Narrated from Abu Hurairah RA that the Messenger of Allah ﷺ said: 'Allah, the Mighty and Majestic, will not look at a man who approaches a man or a woman in her anus.' Related by al-Tirmidhi, who said: This is a hasan gharib hadith.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah RA bahawa Rasulullah ﷺ bersabda: 'Allah, Yang Maha Perkasa dan Maha Agung, tidak akan melihat kepada seorang lelaki yang mendatangi seorang lelaki atau seorang wanita pada duburnya.' Diriwayatkan oleh al-Tirmidhi, dan beliau berkata: Hadis ini adalah hasan gharib.",
        "arabic_text": "وَعَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَنْظُرُ اللَّهُ عَزَّ وَجَلَّ إِلَى رَجُلٍ أَتَى رَجُلًا أَوِ امْرَأَةً فِي دُبُرِهَا» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ"
      },
      {
        "id": 32280,
        "hadith_number": "3586",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Melakukan Hubungan Seks Dengan Haiwan",
        "perawi_melayu": "Tidak dinyatakan secara spesifik dalam teks Bahasa Inggeris, tetapi diriwayatkan oleh Imam Tirmizi dan Abu Daud.  Imam Tirmizi meriwayatkan daripada Sufyan al-Thawri.",
        "english_text": "Not Available",
        "malay_translation": "Daripada baginda SAW, bahawa baginda bersabda:  “Barang siapa yang melakukan hubungan seks dengan haiwan, maka tiada hukuman baginya.”  Riwayat Tirmizi dan Abu Daud. Tirmizi berkata: Daripada Sufyan al-Thawri bahawa beliau berkata: “Dan ini adalah lebih sahih daripada hadis yang pertama, iaitu: ‘Barang siapa yang melakukan hubungan seks dengan haiwan, maka bunuhlah dia.’ Dan amalan adalah berdasarkan hadis ini di kalangan ahli ilmu.”",
        "arabic_text": "وَعَنْهُ أَنَّهُ قَالَ: «مَنْ أَتَى بَهِيمَةً فَلَا حَدَّ عَلَيْهِ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَقَالَ التِّرْمِذِيُّ: عَنْ سُفْيَانَ الثَّوْرِيِّ أَنَّهُ قَالَ: وَهَذَا أَصَحُّ مِنَ الْحَدِيثِ الْأَوَّلِ وَهُوَ: «مَنْ أَتَى بَهِيمَةً فَاقْتُلُوهُ» وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعلم"
      },
      {
        "id": 32281,
        "hadith_number": "3587",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menegakkan Hukum Allah Tanpa Gentar Celaan",
        "perawi_melayu": "Ubadah bin as-Samit",
        "english_text": "On the authority of 'Ubadah bin as-Samit, who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: \"Establish the Hudud of Allah among relatives and strangers, and do not let the criticism of a critic deter you in (the cause of) Allah.\" Narrated by Ibn Majah.",
        "malay_translation": "Daripada Ubadah bin as-Samit berkata: Rasulullah SAW bersabda: \"Tegakkanlah hudud Allah (hukum-hukum Allah) kepada orang yang dekat dan orang yang jauh, dan janganlah kamu terpengaruh dalam (urusan) Allah oleh celaan orang yang mencela.\" Riwayat Ibnu Majah.",
        "arabic_text": "وَعَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَقِيمُوا حُدُودَ اللَّهِ فِي الْقَرِيبِ وَالْبَعِيدِ وَلَا تَأْخُذْكُمْ فِي اللَّهِ لوْمةُ لائمٍ» . رَوَاهُ ابنُ مَاجَه"
      },
      {
        "id": 32282,
        "hadith_number": "3588",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Menegakkan Hukum Allah",
        "perawi_melayu": "Ibn Umar",
        "english_text": "From Ibn Umar, that the Messenger of Allah (peace and blessings of Allah be upon him) said: \"The establishment of one of the limits of Allah is better than rain for forty nights in the lands of Allah.\"",
        "malay_translation": "Daripada Ibnu Umar, bahawa Rasulullah SAW bersabda:  \"Menegakkan satu hukum Allah lebih baik daripada hujan selama empat puluh malam di bumi Allah.\" ",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِقَامَةُ حَدٍّ مِنْ حُدُودِ اللَّهِ خَيْرٌ مِنْ مَطَرِ أَرْبَعِينَ لَيْلَةً فِي بلادِ الله» . رَوَاهُ ابْن مَاجَه"
      },
      {
        "id": 32283,
        "hadith_number": "3589",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Riwayat daripada Abu Hurairah dalam Mishkat Al-Masabih",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Tiada teks Bahasa Inggeris",
        "malay_translation": "Tiada terjemahan kerana tiada teks asal Bahasa Inggeris",
        "arabic_text": "وَرَوَاهُ النَّسَائِيُّ عَنْ أَبِي هُرَيْرَةَ"
      },
      {
        "id": 32284,
        "hadith_number": "3590",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tangan Pencuri Tidak Dipotong Kecuali Jika Nilai Curian Seberat Seperempat Dinar Ke Atas",
        "perawi_melayu": "Aisyah r.a daripada Nabi SAW",
        "english_text": "From Aishah (RA) from the Prophet (PBUH) who said: \"The hand of a thief is not cut off unless for the value of a quarter of a dinar or more.\"",
        "malay_translation": "Daripada Aisyah r.a daripada Nabi Muhammad SAW, baginda bersabda:  \"Tangan pencuri tidak dipotong melainkan jika nilai barang yang dicuri itu sekurang-kurangnya suku dinar atau lebih.\"",
        "arabic_text": "عَنْ عَائِشَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تُقطعُ يدُ السَّارِقِ إِلاَّ بربُعِ دِينَار فَصَاعِدا»"
      },
      {
        "id": 32285,
        "hadith_number": "3591",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman Potong Tangan Pencuri: Nilai Minimum Barang yang Dicuri",
        "perawi_melayu": "Ibn Umar RA",
        "english_text": "Narrated Ibn Umar RA: The Prophet SAW cut off the hand of a thief for stealing a shield worth three dirhams.",
        "malay_translation": "Daripada Ibn Umar RA berkata: Nabi SAW memotong tangan pencuri dalam perisai yang harganya tiga dirham.",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ قَالَ: قَطَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَ سَارِقٍ فِي مِجَنٍّ ثَمَنُهُ ثَلَاثَةُ دَرَاهِمَ"
      },
      {
        "id": 32286,
        "hadith_number": "3592",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Laknat ke atas Pencuri",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "And from Abi Hurairah from the Prophet (peace and blessings of Allaah be upon him) who said: “Allaah cursed the thief who steals an egg, and his hand will be cut off; and the thief who steals a rope, and his hand will be cut off.”",
        "malay_translation": "Daripada Abu Hurairah daripada Nabi SAW, baginda bersabda:  “Allah melaknat pencuri yang mencuri sebiji telur, dan tangannya akan dipotong; dan pencuri yang mencuri tali, dan tangannya akan dipotong.”",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَعَنَ اللَّهُ السارِقَ يسرقُ البيضةَ فتُقطعُ يَده وَيسْرق الْحَبل فتقطع يَده»"
      },
      {
        "id": 32287,
        "hadith_number": "3593",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Memutuskan Buah dan Dahan",
        "perawi_melayu": "Daripada Rafi' bin Khadij daripada Nabi SAW",
        "english_text": "Not Available",
        "malay_translation": "Daripada Rafi' bin Khadij daripada Nabi Muhammad SAW, Baginda bersabda:  “Tidak dibenarkan memutuskan buah-buahan dan dahan.”  Riwayat Malik, Tirmizi, Abu Daud, Nasai, Darimi dan Ibnu Majah.",
        "arabic_text": "عَنْ رَافِعِ بْنِ خَدِيجٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ» رَوَاهُ مَالِكٌ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَالدَّارِمِيُّ وَابْنُ مَاجَهْ"
      },
      {
        "id": 32288,
        "hadith_number": "3594",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman Mencuri Buah-buahan yang Telah Dipetik",
        "perawi_melayu": "Amru bin Syu'aib daripada bapanya daripada datuknya, Abdullah bin Amru bin al-'Ash daripada Rasulullah SAW",
        "english_text": "It was asked of the Messenger of Allah (ﷺ) about the hanging fruits, he said: \"Whoever steals from it anything after it has been gathered and its value reaches the price of a full grown sheep, his hand must be cut off.\"",
        "malay_translation": "Daripada Amru bin Syu'aib daripada bapanya daripada datuknya, Abdullah bin Amru bin al-'Ash daripada Rasulullah SAW, bahawa Baginda SAW ditanya tentang buah-buahan yang digantung. Baginda SAW bersabda:  \"Barang siapa mencuri sesuatu daripadanya selepas ia telah dikutip dan harganya mencapai harga seekor kambing yang telah cukup besar, maka hendaklah tangannya dipotong.\"",
        "arabic_text": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَبْدِ اللَّهِ بْنِ عَمْرٍو بْنِ الْعَاصِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَنَّهُ سُئِلَ عَنِ الثَّمَرِ الْمُعَلَّقِ قَالَ: «مَنْ سَرَقَ مِنْهُ شَيْئًا بَعْدَ أَنْ يُؤْوِيَهُ الْجَرِينَ فَبَلَغَ ثَمَنَ الْمِجَنِّ فَعَلَيْهِ الْقَطْعُ» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ"
      },
      {
        "id": 32289,
        "hadith_number": "3595",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Memotong Buah dan Hasil Tumbuhan yang Belum Dipetik",
        "perawi_melayu": "Abdullah bin Abdurrahman bin Abi Husain Al-Makki",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abdullah bin Abdurrahman bin Abi Husain Al-Makki, bahawa Rasulullah SAW bersabda:  “Tidak dibenarkan memotong buah yang masih tergantung di pokok atau hasil tanaman di gunung.  Tetapi apabila ia telah dihimpun dan dikumpulkan oleh burung dan binatang, maka dibolehkan memotongnya dengan syarat  menanggung nilai kerugian yang sama seperti harga buah-buahan tersebut.” Riwayat Malik.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي حُسَيْنٍ الْمَكِّيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا قَطْعَ فِي ثَمَرٍ معلَّقٍ وَلَا فِي حَرِيسَةِ جَبَلٍ فَإِذَا آوَاهُ الْمُرَاحُ وَالْجَرِينُ فَالْقَطْعُ قيمًا بلغ ثمن الْمِجَن» . رَوَاهُ مَالك"
      },
      {
        "id": 32290,
        "hadith_number": "3596",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tiada Hukuman Potong Tangan Bagi Pencuri Barang yang Tidak Diketahui",
        "perawi_melayu": "Jabir",
        "english_text": "Not Available",
        "malay_translation": "Dari Jabir, katanya: Rasulullah SAW bersabda: “Tiada hukuman potong tangan bagi pencuri barang yang tidak diketahui pemiliknya.  Dan sesiapa yang mencuri barang yang diketahui pemiliknya, maka dia bukan daripada kalangan kita.” Riwayat Abu Daud.",
        "arabic_text": "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ عَلَى الْمُنْتَهِبِ قَطْعٌ وَمَنِ انْتَهَبَ نُهْبَةً مَشْهُورَةً فَلَيْسَ مِنَّا» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32291,
        "hadith_number": "3597",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tiada Hukuman Potong Tangan Bagi Pengkhianat, Perampas, dan Pencuri Rahsia",
        "perawi_melayu": "Riwayat Imam Tirmizi, Nasai, Ibn Majah dan ad-Darimi",
        "english_text": "From the Prophet (peace and blessings of Allaah be upon him): “There is no hadd punishment for a betrayer, a robber or one who steals secretly.”",
        "malay_translation": "Daripada Nabi SAW, Baginda bersabda:  “Tiada hukuman hudud bagi pengkhianat, perampas harta, dan pencuri secara sembunyi.”",
        "arabic_text": "وَعَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَيْسَ عَلَى خَائِنٍ وَلَا مُنْتَهِبٍ وَلَا مُخْتَلِسٍ قَطْعٌ» . رَوَاهُ التِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ والدارمي"
      },
      {
        "id": 32292,
        "hadith_number": "3598",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Mencuri: Kisah Safwan bin Umayyah",
        "perawi_melayu": "Riwayat daripada kitab Syarh As-Sunnah",
        "english_text": "It was narrated in Sharh As-Sunnah that Safwan bin Umayyah came to Madinah and slept in the mosque, using his cloak as a pillow. A thief came and took his cloak. Safwan caught him and brought him to the Messenger of Allah (peace and blessings of Allah be upon him), who ordered that his hand be cut off. Safwan said, \"I did not intend this; it was charity on his part.\" The Messenger of Allah (peace and blessings of Allah be upon him) said, \"Then why didn't you accept it before bringing him to me?\"",
        "malay_translation": "Telah diriwayatkan dalam kitab Syarh As-Sunnah bahawa Safwan bin Umayyah datang ke Madinah dan tidur di masjid, menggunakan jubahnya sebagai bantal.  Seorang pencuri datang dan mengambil jubahnya. Safwan menangkapnya dan membawanya kepada Rasulullah SAW, lalu baginda memerintahkan supaya tangannya dipotong. Safwan berkata, \"Saya tidak berniat demikian; ia adalah sedekah daripadanya.\" Rasulullah SAW bersabda:  \"Maka mengapakah engkau tidak menerimanya sebelum membawanya kepadaku?\"",
        "arabic_text": "وَرُوِيَ فِي «شَرْحِ السُّنَّةِ» : أَنَّ صَفْوَانَ بْنَ أُمَيَّةَ قَدِمَ الْمَدِينَةَ فَنَامَ فِي الْمَسْجِدِ وَتَوَسَّدَ رِدَاءَهُ فَجَاءَ سَارِقٌ وَأَخَذَ رِدَاءَهُ فَأَخَذَهُ صَفْوَانُ فَجَاءَ بِهِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ أَنْ تُقْطَعَ يَدُهُ فَقَالَ صَفْوَانُ: إِنِّي لَمْ أُرِدْ هَذَا هُوَ عَلَيْهِ صَدَقَةٌ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «فَهَلا قبل أَن تَأتِينِي بِهِ»"
      },
      {
        "id": 32293,
        "hadith_number": "3599",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Riwayat Tentang Hadis (Tidak Disertakan Teks Hadis)",
        "perawi_melayu": "Ibn Majah meriwayatkan hadis yang hampir sama daripada Abdullah bin Safwan daripada bapanya.",
        "english_text": "Not Available",
        "malay_translation": "Ibn Majah meriwayatkan hadis yang hampir sama daripada Abdullah bin Safwan daripada bapanya.",
        "arabic_text": "وَرَوَى نَحْوَهُ ابْنُ مَاجَهْ عَنْ عَبْدِ اللَّهِ بن صَفْوَان عَن أَبِيه"
      },
      {
        "id": 32294,
        "hadith_number": "3600",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Riwayat daripada Ibnu Abbas",
        "perawi_melayu": "Ibnu Abbas",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Abbas.",
        "arabic_text": "والدارمي عَن ابْن عَبَّاس"
      },
      {
        "id": 32295,
        "hadith_number": "3601",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Memotong Tangan dalam Peperangan",
        "perawi_melayu": "Busr bin Artat",
        "english_text": "Dari Busr bin Artat berkata: Aku mendengar Rasulullah SAW bersabda: \"Tidak dipotong tangan dalam peperangan.\" Diriwayatkan oleh Tirmidzi, Darimi, Abu Daud dan Nasa'i, kecuali mereka berdua (Darimi dan Nasa'i) berkata: \"Dalam perjalanan\" menggantikan \"peperangan\".",
        "malay_translation": "Daripada Busr bin Artat berkata: Aku mendengar Rasulullah SAW bersabda: \"Tidak dipotong tangan dalam peperangan.\" Diriwayatkan oleh Tirmidzi, Darimi, Abu Daud dan Nasa'i, kecuali mereka berdua (Darimi dan Nasa'i) berkata: \"Dalam perjalanan\" menggantikan \"peperangan\".",
        "arabic_text": "وَعَنْ بُسْرِ بْنِ أَرْطَاةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا تُقْطَعُ الْأَيْدِي فِي الْغَزْوِ» . رَوَاهُ التِّرْمِذِيُّ وَالدَّارِمِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ إِلَّا أَنَّهُمَا قَالَا: «فِي السّفر» بدل «الْغَزْو»"
      },
      {
        "id": 32296,
        "hadith_number": "3602",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman Mencuri Menurut Rasulullah",
        "perawi_melayu": "Abu Salamah daripada Abu Hurairah",
        "english_text": "From Abu Salamah from Abu Hurairah that the Messenger of Allah (peace and blessings be upon him) said concerning the thief: “If he steals, cut off his hand, then if he steals again, cut off his foot, then if he steals again, cut off his hand, then if he steals again, cut off his foot.”",
        "malay_translation": "Daripada Abu Salamah daripada Abu Hurairah bahawa Rasulullah SAW bersabda mengenai pencuri: “Jika dia mencuri, potonglah tangannya, kemudian jika dia mencuri lagi, potonglah kakinya, kemudian jika dia mencuri lagi, potonglah tangannya, kemudian jika dia mencuri lagi, potonglah kakinya.”",
        "arabic_text": "وَعَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم قَالَ فِي السَّارِقِ: «إِنْ سَرَقَ فَاقْطَعُوا يَدَهُ ثُمَّ إِنْ سَرَقَ فَاقْطَعُوا رِجْلَهُ ثُمَّ إِنْ سَرَقَ فَاقْطَعُوا يَدَهُ ثُمَّ إِنْ سَرَقَ فَاقْطَعُوا رِجْلَهُ» . رَوَاهُ فِي شرح السّنة"
      },
      {
        "id": 32297,
        "hadith_number": "3603",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Mencuri dalam Islam",
        "perawi_melayu": "Jabir r.a.",
        "english_text": "And from Jabir, he said: A thief was brought to the Prophet (ﷺ), he said: \"Cut off his hand.\" So it was cut off. Then he was brought a second time, he said: \"Cut off his hand.\" So it was cut off. Then he was brought a third time, he said: \"Cut off his hand.\" So it was cut off. Then he was brought a fourth time, he said: \"Cut off his hand.\" So it was cut off. Then he was brought a fifth time, he said: \"Kill him.\" So we went with him and killed him, then dragged him and threw him in a well and threw stones on him.",
        "malay_translation": "Dari Jabir r.a., beliau berkata: Seorang pencuri dibawa kepada Nabi SAW. Baginda bersabda: \"Potonglah tangannya!\" Maka dipotonglah tangannya. Kemudian dia dibawa lagi untuk kali kedua, Baginda bersabda: \"Potonglah tangannya!\" Maka dipotonglah tangannya. Kemudian dia dibawa lagi untuk kali ketiga, Baginda bersabda: \"Potonglah tangannya!\" Maka dipotonglah tangannya. Kemudian dia dibawa lagi untuk kali keempat, Baginda bersabda: \"Potonglah tangannya!\" Maka dipotonglah tangannya. Kemudian dia dibawa lagi untuk kali kelima, Baginda bersabda: \"Bunuhlah dia!\" Maka kami pun membawanya dan membunuhnya, kemudian kami seret dan campakkan mayatnya ke dalam perigi dan kami lemparkan batu ke atasnya.",
        "arabic_text": "وَعَنْ جَابِرٍ قَالَ: جِيءَ بِسَارِقٍ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «اقْطَعُوهُ» فَقُطِعَ ثُمَّ جِيءَ بِهِ الثَّانِيَةَ فَقَالَ: «اقْطَعُوهُ» فَقُطِعَ ثُمَّ جِيءَ بِهِ الثَّالِثَةَ فَقَالَ: «اقْطَعُوهُ» فَقُطِعَ ثُمَّ جِيءَ بِهِ الرَّابِعَةَ فَقَالَ: «اقْطَعُوهُ» فَقُطِعَ فَأُتِيَ بِهِ الْخَامِسَةَ فَقَالَ: «اقْتُلُوهُ» فَانْطَلَقْنَا بِهِ فَقَتَلْنَاهُ ثُمَّ اجْتَرَرْنَاهُ فَأَلْقَيْنَاهُ فِي بِئْرٍ وَرَمَيْنَا عَلَيْهِ الحجارةَ. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ"
      },
      {
        "id": 32298,
        "hadith_number": "3604",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman Memotong Tangan Pencuri",
        "perawi_melayu": "Riwayat dalam Syarh As-Sunnah",
        "english_text": "It was narrated in Sharh As-Sunnah concerning the cutting off of the hand of a thief from the Prophet (ﷺ): \"Cut it off, then cauterize it\"",
        "malay_translation": "Telah diriwayatkan dalam Syarh As-Sunnah berkenaan dengan pemotongan tangan pencuri daripada Nabi ﷺ:  \"Potonglah ia, kemudian bakarlah ia (untuk menghentikan pendarahan)\"",
        "arabic_text": "وَرُوِيَ فِي شَرْحِ السُّنَّةِ فِي قَطْعِ السَّارِقِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اقْطَعُوهُ ثمَّ احسموه»"
      },
      {
        "id": 32299,
        "hadith_number": "3605",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman Pencuri: Potong Tangan dan Digantung di Leher",
        "perawi_melayu": " فضالة بن عبيد",
        "english_text": "From Fadalah ibn Ubayd, he said: A thief came to the Messenger of Allah ﷺ, and his hand was cut off, then he was ordered [that the hand] be hung around his neck.",
        "malay_translation": "Daripada Fadalah bin Ubayd, beliau berkata: Seorang pencuri datang kepada Rasulullah SAW, lalu tangannya dipotong, kemudian baginda memerintahkan supaya [tangan itu] digantung di lehernya.",
        "arabic_text": "وَعَنْ فَضَالَةَ بْنِ عُبَيْدٍ قَالَ: أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بسارقٍ فقُطِعَتْ يَدَهُ ثُمَّ أَمَرَ بِهَا فَعُلِّقَتْ فِي عُنُقِهِ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ"
      },
      {
        "id": 32300,
        "hadith_number": "3606",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menjual Hamba yang Mencuri",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "From Abu Hurairah (RA) who said: The Messenger of Allah (ﷺ) said: \"If a slave steals, then sell him, even for a small price.\"",
        "malay_translation": "Dari Abu Hurairah r.a. katanya: Rasulullah SAW bersabda:  “Jika seorang hamba mencuri, maka juallah dia, walaupun dengan harga yang rendah.”",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا سَرَقَ الْمَمْلُوكُ فَبِعْهُ وَلَوْ بِنَشٍّ» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْن مَاجَه"
      },
      {
        "id": 32301,
        "hadith_number": "3607",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keadilan Rasulullah SAW: Hukuman Bagi Pencuri",
        "perawi_melayu": "Aisyah r.a.",
        "english_text": "From Aishah, she said: A thief was brought to the Messenger of Allah (peace and blessings of Allah be upon him), so he had his hand cut off. They said, \"We never saw you go to this extent.\" He said, \"If it were Fatima, I would have cut off her hand.\"",
        "malay_translation": "Daripada Aisyah r.a., beliau berkata: Seorang pencuri dibawa kepada Rasulullah SAW, lalu baginda memotong tangannya. Mereka berkata, \"Kami tidak pernah melihat baginda melakukan sedemikian.\" Baginda bersabda:  \"Sekiranya ia Fatimah, nescaya aku akan memotong tangannya juga.\"",
        "arabic_text": "عَنْ عَائِشَةَ قَالَتْ: أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَارِقٍ فَقَطَعَهُ فَقَالُوا: مَا كُنَّا نَرَاكَ تَبْلُغُ بِهِ هَذَا قَالَ: «لَوْ كانتْ فاطمةُ لقطعتَها» . رَوَاهُ النَّسَائِيّ"
      },
      {
        "id": 32302,
        "hadith_number": "3608",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman Mencuri:  Kisah Seorang Ghulam",
        "perawi_melayu": "Ibn Umar",
        "english_text": "From Ibn Umar, he said: A man came to Umar with his slave boy and said: Cut off his hand, for he stole a mirror from my wife. Umar (may Allah be pleased with him) said: His hand shall not be cut off, for he is your servant; he took from your belongings.",
        "malay_translation": "Daripada Ibnu Umar, beliau berkata: Seorang lelaki datang kepada Umar dengan seorang budaknya lalu berkata: Potonglah tangannya, kerana dia mencuri cermin isteriku. Umar (radiyallahu 'anhu) berkata: Tangannya tidak akan dipotong, kerana dia adalah hambamu; dia mengambil daripada barang-barang kamu.",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ قَالَ: جَاءَ رَجُلٌ إِلَى عُمَرَ بِغُلَامٍ لَهُ فَقَالَ: اقْطَعْ يَدَهُ فَإِنَّهُ سرقَ مرآةَ لأمرأتي فَقَالَ عمَرُ رَضِي اللَّهُ عَنهُ: لَا قَطْعَ عَلَيْهِ وَهُوَ خَادِمُكُمْ أَخَذَ مَتَاعَكُمْ. رَوَاهُ مَالك"
      },
      {
        "id": 32303,
        "hadith_number": "3609",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kesabaran Menghadapi Kematian",
        "perawi_melayu": "Abu Dzar al-Ghifari",
        "english_text": "And from Abu Dzar, he said: The Messenger of Allah (ﷺ) said to me: \"O Abu Dzar!\" I said: \"Labbaik, O Messenger of Allah, and Sa'dayk.\" He said: \"How are you when death befalls people, and the house contains (the deceased) with a garment?\" Meaning the grave. I said: \"Allah and His Messenger know best.\" He said: \"You should be patient.\" Hammad ibn Abi Sulaiman said: The hand of the one who searches (for property among the belongings of the deceased) will be cut off, because he entered the house of the dead.",
        "malay_translation": "Daripada Abu Dzar, beliau berkata: Rasulullah SAW bersabda kepadaku: \"Wahai Abu Dzar!\" Aku berkata: \"Labbaik, wahai Rasulullah, dan aku mendengar serta mentaati perintahmu.\" Baginda bersabda: \"Bagaimana keadaanmu apabila kematian menimpa manusia, dan rumah itu mengandungi (jenazah) yang dikafankan?\" Maksudnya kubur. Aku berkata: \"Allah dan Rasul-Nya lebih mengetahui.\" Baginda bersabda: \"Hendaklah engkau bersabar.\" Hammad bin Abi Sulaiman berkata: Tangan orang yang mencari-cari (harta benda di kalangan milik si mati) akan dipotong, kerana dia telah memasuki rumah si mati.",
        "arabic_text": "وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا أَبَا ذَرٍّ» قُلْتُ: لَبَّيْكَ يَا رَسُولَ اللَّهِ وَسَعْدَيْكَ قَالَ: «كَيْفَ أَنْتَ إِذَا أَصَابَ النَّاسَ مَوْتٌ يَكُونُ الْبَيْتُ فِيهِ بِالْوَصِيفِ» يَعْنِي الْقَبْرَ قُلْتُ: اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: «عَلَيْكَ بِالصَّبْرِ» قَالَ حمَّادُ بنُ أبي سُليمانَ: تُقْطَعُ يَدُ النَّبَّاشِ لِأَنَّهُ دَخَلَ عَلَى الْمَيْتِ بيتَه. رَوَاهُ أَبُو دَاوُدَ"
      },
      {
        "id": 32304,
        "hadith_number": "3610",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Keadilan dalam Hukum Hudud: Kisah Wanita Makhzumiyah yang Mencuri",
        "perawi_melayu": "Aisyah RA",
        "english_text": "Narrated Aisha (RA): The people of Quraish were concerned about the case of a Makhzumi woman who had stolen. They said, \"Who will intercede for her with the Messenger of Allah (ﷺ)?\" Some said, \"Who would dare to do so except Usama bin Zaid, the beloved of the Messenger of Allah (ﷺ)?\" Usama spoke to him about her, and the Messenger of Allah (ﷺ) said, \"Are you interceding concerning one of the prescribed punishments of Allah?\" Then he stood up and addressed the people, saying, \"What destroyed the nations preceding you was that if a noble amongst them stole, they would let him off, but if a weak one amongst them stole, they would apply Allah’s law to him. By Allah, if Fatimah daughter of Muhammad were to steal, I would cut off her hand.\"",
        "malay_translation": "Daripada Aisyah RA, bahawa kaum Quraisy sangat bimbang tentang kes seorang wanita Makhzumiyah yang mencuri. Mereka berkata, \"Siapakah yang akan memberi syafaat kepadanya di sisi Rasulullah SAW?\" Sebahagian mereka berkata, \"Siapakah yang berani melakukannya kecuali Usamah bin Zaid, kekasih Rasulullah SAW?\" Usamah bercakap kepada baginda tentang wanita itu, dan Rasulullah SAW bersabda, \"Adakah kamu memberi syafaat dalam salah satu hukuman had Allah?\" Kemudian baginda berdiri dan berkhutbah kepada orang ramai, dengan bersabda, \"Sesungguhnya yang membinasakan umat-umat sebelum kamu adalah apabila orang yang mulia di antara mereka mencuri, mereka membiarkannya, tetapi jika orang yang lemah di antara mereka mencuri, mereka melaksanakan hukum Allah ke atasnya. Demi Allah, sekiranya Fatimah binti Muhammad mencuri, pasti aku akan memotong tangannya.\"",
        "arabic_text": "عَن عائشةَ رَضِي الله عَنْهَا أَنَّ قُرَيْشًا أَهَمَّهُمْ شَأْنُ الْمَرْأَةِ الْمَخْزُومِيَّةِ الَّتِي سَرَقَتْ فَقَالُوا: مَنْ يُكَلِّمُ فِيهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ فَقَالُوا: وَمَنْ يَجْتَرِئُ عَلَيْهِ إِلَّا أُسَامَةُ بْنُ زَيْدٍ حِبُّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَلَّمَهُ أُسَامَةُ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَتَشْفَعُ فِي حَدٍّ مِنْ حُدُودِ اللَّهِ؟» ثُمَّ قَامَ فَاخْتَطَبَ ثُمَّ قَالَ: «إِنَّمَا أَهْلَكَ الَّذِينَ قَبْلَكُمْ أَنَّهُمْ كَانُوا إِذَا سَرَقَ فِيهِمُ الشَّرِيفُ تَرَكُوهُ وَإِذَا سَرَقَ فِيهِمُ الضَّعِيفُ أَقَامُوا عَلَيْهِ الْحَدَّ وَايْمُ اللَّهِ لَوْ أَنَّ فَاطِمَةَ بِنْتَ مُحَمَّدٍ سَرَقَتْ لَقَطَعْتُ يَدَهَا» . مُتَّفَقٌ عَلَيْهِ. وَفِي روايةٍ لمسلمٍ: قالتْ: كانتِ امرأةٌ مخزوميَّةٌ تَسْتَعِيرُ الْمَتَاعَ وَتَجْحَدُهُ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَطْعِ يَدِهَا فَأَتَى أَهْلُهَا أُسَامَةَ فَكَلَّمُوهُ فَكَلَّمَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَطْعِ يَدِهَا فَأَتَى أَهْلُهَا أُسَامَةَ فَكَلَّمُوهُ فَكَلَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهَا ثمَّ ذكرَ الحديثَ بنحوِ مَا تقدَّمَ"
      },
      {
        "id": 32305,
        "hadith_number": "3611",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kesan Syefaat yang Melampau Batas Allah dan Memfitnah Orang Mukmin",
        "perawi_melayu": "Abdullah bin Umar",
        "english_text": "From Abdullah ibn Umar, he said: I heard the Messenger of Allah (peace and blessings of Allah be upon him) say: \"Whoever's intercession prevents a limit from the limits of Allah, he has opposed Allah. And whoever argues in falsehood while knowing it, he remains in the displeasure of Allah until he retracts. And whoever says about a believer that which is not in him, Allah will make him dwell in the depth of the abyss until he retracts from what he said.\"",
        "malay_translation": "Daripada Abdullah bin Umar, beliau berkata: Saya mendengar Rasulullah SAW bersabda:  \"Barangsiapa syafaatnya menghalang sesuatu had daripada had Allah, maka sesungguhnya dia telah menentang Allah. Dan barangsiapa berbalah dalam kebatilan sedang dia mengetahuinya, maka dia tetap dalam kemurkaan Allah sehingga dia menarik balik (perkataannya). Dan barangsiapa berkata tentang seorang mukmin sesuatu yang bukan padanya, nescaya Allah akan menempatkannya di dalam neraka Jahannam sehingga dia menarik balik apa yang telah dia katakan.\"",
        "arabic_text": "عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يَقُول: «مَنْ حَالَتْ شَفَاعَتُهُ دُونَ حَدٍّ مِنْ حُدُودِ اللَّهِ فَقَدَ ضَادَّ اللَّهَ وَمَنْ خَاصَمَ فِي بَاطِلٍ وَهُوَ يَعْلَمُهُ لَمْ يَزَلْ فِي سُخْطِ اله تَعَالَى حَتَّى يَنْزِعَ وَمَنْ قَالَ فِي مُؤْمِنٍ مَا لَيْسَ فِيهِ أَسْكَنَهُ اللَّهُ رَدْغَةَ الْخَبَالِ حَتَّى يَخْرُجَ مِمَّا قَالَ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُد وَفِي روايةٍ للبيهقيِّ فِي شعبِ الْإِيمَان «مَنْ أَعانَ على خُصُومَةً لَا يَدْرِي أَحَقٌّ أَمْ بَاطِلٌ فَهُوَ فِي سَخطِ اللَّهِ حَتَّى ينْزع»"
      },
      {
        "id": 32306,
        "hadith_number": "3612",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pengampunan Pencuri yang Bertaubat",
        "perawi_melayu": "Abu Umayyah al-Makhzumi",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Umayyah al-Makhzumi, bahawa Nabi SAW telah didatangi oleh seorang pencuri yang telah mengaku dengan pengakuannya, dan tiada harta benda yang dijumpai padanya.  Maka Rasulullah SAW bersabda kepadanya:  “Aku tidak sangka engkau mencuri.”  Dia menjawab: “Ya, saya mencuri.” Rasulullah SAW mengulanginya dua atau tiga kali, setiap kali dia mengaku.  Kemudian Rasulullah SAW memerintahkan agar dia dipotong tangannya.  Setelah itu, baginda SAW bersabda kepadanya:  “Mohonlah ampun kepada Allah dan bertaubatlah kepada-Nya.”  Dia pun berkata:  “Aku memohon ampun kepada Allah dan aku bertaubat kepada-Nya.”  Lalu Rasulullah SAW bersabda:  “Ya Allah, ampunilah dia,” tiga kali.  Riwayat Abu Daud, al-Nasa’i, Ibnu Majah dan ad-Darimi.  Begitulah yang aku temui dalam empat kitab utama (al-Kutub al-Arba’ah),  Jam’ al-usul, Syu’ab al-iman, dan Ma’alim as-Sunan daripada Abu Umayyah.",
        "arabic_text": "وَعَنْ أَبِي أُمَيَّةَ الْمَخْزُومِيِّ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى بِلِصٍّ قَدِ اعْتَرَفَ اعْتِرَافًا وَلَمْ يُوجَدْ مَعَهُ مَتَاعٌ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا أَخَالُكَ سَرَقْتَ» . قَالَ: بَلَى فَأَعَادَ عَلَيْهِ مَرَّتَيْنِ أَوْ ثَلَاثًا كُلَّ ذَلِكَ يَعْتَرِفُ فَأَمَرَ بِهِ فَقُطِعَ وَجِيءَ بِهِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اسْتَغْفِرِ اللَّهَ وَتُبْ إِلَيْهِ» فَقَالَ: أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اللَّهُمَّ تُبْ عليهِ» ثَلَاثًا. رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ هَكَذَا وجدتُ فِي الْأُصُول الْأَرْبَعَة وجامع الْأُصُول وَشُعَبُ الْإِيمَانِ وَمَعَالِمُ السُّنَنِ عَنْ أَبِي أُمَيَّةَ"
      },
      {
        "id": 32307,
        "hadith_number": "3613",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mengenai Naskah-naskah Mishkat dan Abu Rimthah",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "No English text provided",
        "malay_translation": "Dan dalam naskah-naskah Misbah, dari Abu Rimthah dengan huruf ra, dan tha yang bertitik tiga, sebagai ganti hamzah dan ya.",
        "arabic_text": "وَفِي نُسَخِ الْمَصَابِيحِ عَنْ أَبِي رِمْثَةَ بِالرَّاءِ والثاء الْمُثَلَّثَة بدل الْهمزَة وَالْيَاء"
      },
      {
        "id": 32308,
        "hadith_number": "3614",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman bagi Peminum Arak pada Zaman Nabi dan Abu Bakar",
        "perawi_melayu": "Anas",
        "english_text": "Anas reported that the Prophet (PBUH) used palm branches and sandals to punish for alcohol consumption, and Abu Bakr (RA) lashed forty times.",
        "malay_translation": "Daripada Anas RA, bahawa Nabi SAW memukul (sebagai hukuman) bagi (kesalahan) arak dengan pelepah tamar dan selipar, dan Abu Bakar RA menjilid (menghukum sebat) empat puluh kali.",
        "arabic_text": "عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَرَبَ فِي الْخَمْرِ بِالْجَرِيدِ والنِّعالِ وجلَدَ أَبُو بكرٍ رَضِي الله عَنهُ أربعينَ"
      },
      {
        "id": 32309,
        "hadith_number": "3615",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi SAW Memukul Khamar dengan Kasut dan Pelepah Kurma",
        "perawi_melayu": "Riwayat yang sahih daripada sumber yang dipercayai.",
        "english_text": "And in a narration from him: that the Prophet (peace and blessings of Allah be upon him) used to strike the intoxicants with sandals and palm-leaves forty times.",
        "malay_translation": "Dan dalam satu riwayat daripadanya: bahawa Nabi Muhammad SAW pernah memukul arak dengan kasut dan pelepah kurma sebanyak empat puluh kali.",
        "arabic_text": "وَفِي رِوَايَة عَنْهُ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَضْرِبُ فِي الْخَمْرِ بِالنِّعَالِ وَالْجَرِيدِ أَرْبَعِينَ"
      },
      {
        "id": 32310,
        "hadith_number": "3616",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ukiran Pada Zaman Rasulullah SAW dan Khulafa' Ar-Rasyidin",
        "perawi_melayu": "Saib bin Yazid",
        "english_text": "From Saib ibn Yazid, he said:  Drinking vessels were brought in during the time of the Messenger of Allah (peace and blessings be upon him), and the caliphate of Abu Bakr, and the beginning of the caliphate of Umar. We would stand on them with our hands, shoes, and clothes. Then during the later part of Umar's caliphate, he would flog forty (lashes), but when they became unruly and rebellious, he flogged eighty.",
        "malay_translation": "Daripada Saib bin Yazid, katanya:  Bekas minuman dibawa pada zaman Rasulullah SAW, dan pemerintahan Abu Bakar, dan permulaan pemerintahan Umar. Kami akan berdiri di atasnya dengan tangan, kasut, dan pakaian kami. Kemudian pada lewat pemerintahan Umar, baginda akan menyeksa dengan empat puluh sebatan, tetapi apabila mereka menjadi tidak terkawal dan memberontak, baginda akan menyeksa dengan lapan puluh sebatan. Riwayat Bukhari.",
        "arabic_text": "وَعَنِ السَّائِبِ بْنِ يَزِيدَ قَالَ: كَانَ يُؤْتَى بِالشَّارِبِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِمْرَةِ أَبِي بَكْرٍ وَصَدْرًا مِنْ خِلَافَةِ عُمَرَ فَنَقُومُ عَلَيْهِ بِأَيْدِينَا وَنِعَالِنَا وَأَرْدِيَتِنَا حَتَّى كَانَ آخِرُ إِمْرَةِ عُمَرَ فَجَلَدَ أَرْبَعِينَ حَتَّى إِذَا عَتَوْا وَفَسَقُوا جَلَدَ ثَمَانِينَ. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32311,
        "hadith_number": "3617",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman Bagi Peminum Arak",
        "perawi_melayu": "Jabir daripada Nabi SAW",
        "english_text": "From Jabir from the Prophet (peace and blessings of Allah be upon him), who said: “Whoever drinks alcohol, flog him, and if he repeats it for the fourth time, then kill him.” He said: Then the Prophet (peace and blessings of Allah be upon him) came to him after that with a man who had drunk for the fourth time, so he struck him and did not kill him. Reported by Tirmidhi",
        "malay_translation": "Dari Jabir daripada Nabi Muhammad SAW, Baginda bersabda:  “Barang siapa meminum arak, maka dera dia. Dan jika dia mengulanginya buat kali keempat, maka bunuhlah dia.”  Baginda berkata: Kemudian Nabi SAW datang kepada seorang lelaki yang telah minum arak buat kali keempat, lalu Baginda memukulnya tetapi tidak membunuhnya.  Riwayat Tirmizi.",
        "arabic_text": "عَنْ جَابِرٌ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ شَرِبَ الْخَمْرَ فَاجْلِدُوهُ فَإِنْ عَادَ فِي الرَّابِعَةِ فَاقْتُلُوهُ» قَالَ: ثُمَّ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ ذَلِكَ بِرَجُلٍ قَدْ شَرِبَ فِي الرَّابِعَةِ فَضَرَبَهُ وَلَمْ يقْتله. رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 32312,
        "hadith_number": "3618",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Periwayat Hadis",
        "perawi_melayu": "Abu Daud daripada Qabishah bin Dhuayb",
        "english_text": "Narrated by Abu Dawud from Qabishah bin Dhuayb",
        "malay_translation": "Daripada riwayat Abu Daud daripada Qabishah bin Dhuayb.",
        "arabic_text": "وَرَوَاهُ أَبُو دَاوُد عَن قبيصَة بن دؤيب"
      },
      {
        "id": 32313,
        "hadith_number": "3619",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum membunuh pencuri",
        "perawi_melayu": "Daripada beberapa sahabat Rasulullah SAW, antaranya Ibnu Umar, Muawiyah, Abu Hurairah dan Syuraih.",
        "english_text": "And in another narration from them, from An-Nasa’i, Ibn Majah and Ad-Darimi from a number of the Companions of the Messenger of Allah (ﷺ), among them Ibn Umar, Mu’awiyah, Abu Hurairah and ash-Shuraih until his statement: “Then kill him.”",
        "malay_translation": "Dan dalam riwayat lain daripada mereka, daripada An-Nasa’i, Ibnu Majah dan Ad-Darimi daripada beberapa sahabat Rasulullah SAW, antaranya Ibnu Umar, Muawiyah, Abu Hurairah dan Syuraih sehingga kepada sabdanya:  “Kemudian bunuhlah dia.”",
        "arabic_text": "وَفِي أُخْرَى لَهُمَا وَلِلنَّسَائِيِّ وَابْنِ مَاجَهْ وَالدَّارِمِيِّ عَنْ نَفَرٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهُمُ ابْنُ عُمَرَ وَمُعَاوِيَةُ وَأَبُو هُرَيْرَة والشريد إِلَى قَوْله: «فَاقْتُلُوهُ»"
      },
      {
        "id": 32314,
        "hadith_number": "3620",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Mengadili Peminum Arak",
        "perawi_melayu": "Abd al-Rahman bin al-Azhar",
        "english_text": "From 'Abd al-Rahman ibn al-Azhar, who said: \"It is as if I see the Messenger of Allah (peace and blessings be upon him) when a man was brought to him who had drunk wine, and he said to the people: \"Beat him.\" So some of them beat him with sandals, some with a stick, and some with a green date-stalk. Ibn Wahb said: \"He means a fresh date-stalk.\" Then the Messenger of Allah (peace and blessings be upon him) took some dust from the ground and threw it in his face.\"",
        "malay_translation": "Daripada Abd al-Rahman bin al-Azhar, yang berkata: \"Seakan-akan aku melihat Rasulullah SAW ketika seorang lelaki dibawa kepada baginda yang telah meminum arak, lalu baginda bersabda kepada orang ramai: \"Pukul dia.\" Maka sebahagian daripada mereka memukulnya dengan sandal, sebahagian lagi dengan kayu, dan sebahagian lagi dengan lidi pelepah kurma yang muda. Ibn Wahb berkata: \"Maksudnya lidi pelepah kurma yang masih segar.\" Kemudian Rasulullah SAW mengambil sedikit tanah dan melemparkannya ke wajah lelaki itu.\"  ",
        "arabic_text": "وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَزْهَرِ قَالَ: كَأَنِّي أَنْظُرُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ أُتِيَ بِرَجُلٍ قَدْ شَرِبَ الْخَمْرَ فَقَالَ لِلنَّاسِ: «اضْرِبُوهُ» فَمِنْهُمْ مَنْ ضَرَبَهُ بِالنِّعَالِ وَمِنْهُمْ مَنْ ضَرَبَهُ بِالْعَصَا وَمِنْهُمْ مَنْ ضَرَبَهُ بِالْمِيتَخَةِ. قَالَ ابْنُ وَهْبٍ: يَعْنِي الْجَرِيدَةَ الرَّطْبَةَ ثُمَّ أَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُرَابًا مِنَ الْأَرْضِ فَرَمَى بِهِ فِي وجهِه. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32315,
        "hadith_number": "3621",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": " Hukuman dan Nasihat kepada Peminum Arak",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah r.a., katanya:  Rasulullah SAW didatangi oleh seorang lelaki yang telah meminum arak. Baginda SAW bersabda: \"Seksa dia!\" Maka, ada di antara kami yang menukulnya dengan tangan, ada yang dengan kain dan ada yang dengan kasut. Kemudian Baginda SAW bersabda: \"Tegurlah dia!\" Mereka pun menghampirinya sambil berkata: \"Tidakkah engkau bertaqwa kepada Allah? Tidakkah engkau takut kepada Allah? Tidakkah engkau malu kepada Rasulullah SAW?\" Kemudian ada di antara orang ramai berkata: \"Semoga Allah membinasakanmu.\" Baginda SAW bersabda: \"Janganlah kamu berkata demikian. Janganlah kamu membantu syaitan terhadapnya, tetapi doakanlah dia dengan berkata: Ya Allah, ampunilah dia, Ya Allah, rahmatilah dia.\"  Riwayat Abu Daud.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِرَجُلٍ قَدْ شربَ الخمرَ فَقَالَ: «اضْرِبُوهُ» فَمِنَّا الضَّارِبُ بِيَدِهِ وَالضَّارِبُ بِثَوْبِهِ وَالضَّارِبُ بِنَعْلِهِ ثُمَّ قَالَ: «بَكِّتُوهُ» فَأَقْبَلُوا عَلَيْهِ يَقُولُونَ: مَا اتَّقَيْتَ اللَّهَ مَا خَشِيتَ اللَّهَ وَمَا اسْتَحْيَيْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ بَعْضُ الْقَوْمِ: أَخْزَاكَ اللَّهُ. قَالَ: لَا تَقُولُوا هَكَذَا لَا تُعِينُوا عَلَيْهِ الشَّيْطَانَ وَلَكِنْ قُولُوا: اللَّهُمَّ اغْفِرْ لَهُ اللَّهُمَّ ارْحَمْهُ . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32316,
        "hadith_number": "3622",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kemaafan Nabi SAW terhadap Orang Mabuk",
        "perawi_melayu": "Ibnu Abbas",
        "english_text": "From Ibn Abbas, he said: A man drank and became intoxicated. He was found staggering at dawn. So he was taken to the Messenger of Allah (ﷺ). When he reached the house of Abbas, he escaped and entered Abbas's house and clung to him. This was mentioned to the Prophet (ﷺ). He laughed and said: “Did he do that?” And he did not order anything in this regard. Reported by Abu Dawud.",
        "malay_translation": "Daripada Ibnu Abbas, beliau berkata: Seorang lelaki minum arak sehingga mabuk.  Dia ditemui sedang terhuyung-hayang pada waktu fajar. Maka dia dibawa kepada Rasulullah SAW.  Apabila sampai berhampiran rumah Abbas, dia melepaskan diri dan masuk ke rumah Abbas serta berpaut kepadanya.  Perkara ini diberitahu kepada Nabi SAW. Baginda ketawa dan bertanya: “Adakah dia melakukan perkara itu?” Dan Baginda tidak memerintahkan apa-apa dalam hal ini. Riwayat Abu Daud.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: شَرِبَ رَجُلٌ فَسَكِرَ فَلُقِيَ يَمِيلُ فِي الْفَجِّ فَانْطُلِقَ بِهِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا حَاذَى دَارَ الْعَبَّاسِ انْفَلَتَ فَدَخَلَ عَلَى الْعَبَّاسِ فَالْتَزَمَهُ فَذَكَرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فضحكَ وَقَالَ: «أفعَلَها؟» وَلم يأمرْ فيهِ بشيءٍ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32317,
        "hadith_number": "3623",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ali bin Abi Talib dan Hukuman",
        "perawi_melayu": "Umar bin Said al-Nakha’i",
        "english_text": "From Umayr ibn Sa'id al-Nakha'i, who said: I heard Ali ibn Abi Talib say: \"I would not impose a punishment on anyone which would lead to their death and then feel something in my heart about it except in the case of a drinker of alcohol, for if he died, I would regret it. This is because the Messenger of Allah (peace and blessings of Allah be upon him) did not prescribe it.\"",
        "malay_translation": "Daripada Umair bin Said al-Nakha’i, yang berkata: Saya mendengar Ali bin Abi Talib berkata:  “Aku tidak akan mengenakan hukuman ke atas sesiapa yang boleh menyebabkan kematian mereka dan kemudian merasakan sesuatu dalam hatiku mengenainya kecuali dalam kes peminum arak, kerana jika dia mati, aku akan menyesalinya. Ini kerana Rasulullah SAW tidak menetapkannya.”",
        "arabic_text": "عَن عُمَيْر بن سعيد النخفي قَالَ: سَمِعْتُ عَلِيَّ بْنَ أَبِي طَالِبٍ يَقُولُ: مَا كُنْتُ لِأُقِيمَ عَلَى أَحَدٍ حَدًّا فَيَمُوتَ فَأَجِدَ فِي نَفْسِي مِنْهُ شَيْئًا إِلَّا صَاحِبَ الْخَمْرِ فَإِنَّهُ لَوْ مَاتَ وَدَيْتُهُ وَذَلِكَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يسنه"
      },
      {
        "id": 32318,
        "hadith_number": "3624",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pendapat Ali tentang Hukuman Minuman Keras",
        "perawi_melayu": "Thawr bin Zaid al-Daylami",
        "english_text": "From Thawr ibn Zaid al-Daylami, who said: \"Umar consulted regarding the punishment for drinking alcohol, and Ali said to him: 'I think you should flog him eighty lashes, for when he drinks, he becomes intoxicated, and when he is intoxicated, he becomes reckless, and when he is reckless, he commits falsehood.' So Umar (may Allah be pleased with him) flogged for the punishment of alcohol eighty lashes.\"",
        "malay_translation": "Daripada Thawr bin Zaid al-Daylami, katanya: \"Umar telah bermesyuarat tentang hukuman bagi meminum arak, dan Ali berkata kepadanya:  'Aku berpendapat bahawa engkau hendaklah menyeksa dia dengan lapan puluh sebatan, kerana apabila dia minum, dia akan mabuk, dan apabila dia mabuk, dia akan menjadi tidak waras, dan apabila dia tidak waras, dia akan berdusta.'  Maka Umar (radiyallahu 'anhu) telah menjatuhkan hukuman lapan puluh sebatan bagi kesalahan meminum arak.\"",
        "arabic_text": "وَعَنْ ثَوْرِ بْنِ زَيْدٍ الدَّيْلِمِيِّ قَالَ: إِنَّ عُمَرَ اسْتَشَارَ فِي حَدِّ الْخَمْرِ فَقَالَ لَهُ عَلِيٌّ: أَرَى أَنْ تَجْلِدَهُ ثَمَانِينَ جَلْدَةً فَإِنَّهُ إِذَا شَرِبَ سَكِرَ وَإِذَا سَكِرَ هَذَى وَإِذَا هذَى افْتَرى فجلدَ عمرُ رَضِي الله عَنهُ فِي حَدِّ الْخَمْرِ ثَمَانِينَ. رَوَاهُ مَالِكٌ"
      },
      {
        "id": 32319,
        "hadith_number": "3625",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Jangan Mendoakan Laknat ke atas Orang yang Mencintai Allah dan Rasul",
        "perawi_melayu": "Umar bin al-Khattab r.a.",
        "english_text": "From 'Umar ibn al-Khattab (may Allah be pleased with him), that a man named 'Abdullah, nicknamed 'Hammar', used to make the Prophet (peace and blessings of Allah be upon him) laugh, and the Prophet (peace and blessings of Allah be upon him) had flogged him for drinking.  He was brought to him one day, and the Prophet (peace and blessings of Allah be upon him) ordered that he be flogged. A man from among the people said: 'O Allah, curse him! How often he is brought!' The Prophet (peace and blessings of Allah be upon him) said: 'Do not curse him, for by Allah, I do not know that he loves Allah and His Messenger.'",
        "malay_translation": "Daripada Umar bin al-Khattab r.a., bahawa seorang lelaki bernama Abdullah, yang digelar Hammar, selalu membuat Nabi SAW ketawa, dan Nabi SAW pernah mencambuknya kerana minum arak.  Dia dibawa kepada Nabi SAW pada suatu hari, dan Nabi SAW memerintahkan supaya dia dicambuk. Seorang lelaki daripada kalangan manusia berkata: \"Ya Allah, laknatkanlah dia! Betapa kerapnya dia dibawa!\" Nabi SAW bersabda:  \"Janganlah kamu melaknatinya, demi Allah, aku tidak tahu bahawa dia mencintai Allah dan Rasul-Nya.\"",
        "arabic_text": "عَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ أنَّ رجلا اسمُه عبدُ اللَّهِ يُلَقَّبُ حمارا كَانَ يُضْحِكُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ جَلَدَهُ فِي الشَّرَابِ فَأُتِيَ بِهِ يَوْمًا فَأَمَرَ بِهِ فَجُلِدَ فَقَالَ رَجُلٌ مِنَ الْقَوْمِ: اللَّهُمَّ الْعَنْهُ مَا أَكْثَرَ مَا يُؤْتَى بِهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تلعنوه فو الله مَا عَلِمْتُ أَنَّهُ يُحِبُّ اللَّهَ وَرَسُولَهُ» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32320,
        "hadith_number": "3626",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Membantu Syaitan",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah reported: A man who had drunk wine came to the Prophet (peace and blessings of Allaah be upon him), who said, “Beat him!” So some of us beat him with their hands, some with their sandals and some with their clothes. When he had gone away, some of the people said, “May Allaah disgrace you!” He said, “Do not say that; do not help the Shaytaan against him.” Reported by al-Bukhaari",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa: Seorang lelaki yang telah meminum arak datang kepada Nabi SAW, lalu baginda bersabda:  “Seksa dia!” Maka sebahagian daripada kami menyeksanya dengan tangan, sebahagian lagi dengan kasut dan sebahagian lagi dengan pakaian. Setelah lelaki itu pergi, sebahagian daripada orang ramai berkata: “Semoga Allah menghinakan kamu!” Baginda bersabda: “Jangan berkata demikian; janganlah kamu membantu syaitan terhadapnya.” Riwayat al-Bukhari.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِرَجُلٍ قَدْ شَرِبَ الْخَمْرَ فَقَالَ: «اضْرِبُوهُ» فَمِنَّا الضَّارِبُ بِيَدِهِ وَالضَّارِبُ بِنَعْلِهِ وَالضَّارِبُ بِثَوْبِهِ فَلَمَّا انْصَرَفَ قَالَ بَعْضُ الْقَوْمِ: أَخْزَاكَ اللَّهُ قَالَ: «لَا تَقُولُوا هَكَذَا لَا تُعِينُوا عَلَيْهِ الشَّيْطَانَ» . رَوَاهُ الْبُخَارِيُّ"
      },
      {
        "id": 32321,
        "hadith_number": "3627",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Azab Zina dan Pengampunan Allah",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "From Abu Hurairah, who said: The Aslami came to the Prophet, peace and blessings be upon him, and testified against himself that he had committed adultery four times. Each time, he would turn away, and he returned for the fifth time, and the Prophet, peace and blessings be upon him, asked: \"Did you consummate it?\" He said: Yes. The Prophet, peace and blessings be upon him, asked: \"Until it was hidden between you?\" He said: Yes. The Prophet, peace and blessings be upon him, asked: \"Like the disappearance of the kohl stick in the kohl pot and the rope in the well?\" He said: Yes. The Prophet, peace and blessings be upon him, asked: \"Do you know what adultery is?\" He said: Yes, I committed with her something haram that is not permissible between spouses. The Prophet, peace and blessings be upon him, said: \"What do you want by this statement?\" He said: I want you to purify me. So, he ordered that he be stoned, and he was stoned. The Prophet, peace and blessings be upon him, heard two of his companions saying, one to the other: \"Look at this man whom Allah covered, but his self did not leave him alone until he was stoned like a dog.\" The Prophet, peace and blessings be upon him, remained silent. Then he walked for a while until he passed by the carcass of a donkey lying on its side, and he said: \"Where are so-and-so and so-and-so?\" They said: We are here, O Messenger of Allah. He said: \"Get down and eat from the carcass of this donkey.\" They said: O Prophet of Allah, who would eat from this? He said: \"What you obtained from your brother's reputation is worse than eating from it. And by the One in Whose hand is my soul, he is now in the rivers of Paradise bathing in them.\"",
        "malay_translation": "Daripada Abu Hurairah, katanya:  Orang Aslami datang kepada Nabi SAW, lalu memberi keterangan terhadap dirinya sendiri bahawa dia telah melakukan zina empat kali. Setiap kali, dia akan berpaling, dan dia kembali untuk kali kelima, lalu Nabi SAW bertanya: \"Adakah kamu telah menggaulinya?\" Dia menjawab: Ya. Nabi SAW bertanya: \"Sehinggakan ia tersembunyi di antara kamu berdua?\" Dia menjawab: Ya. Nabi SAW bertanya:  \"Seperti kehilangan batang celak dalam bekas celak dan tali dalam perigi?\" Dia menjawab: Ya. Nabi SAW bertanya: \"Adakah kamu tahu apakah zina itu?\" Dia menjawab: Ya, saya telah melakukan dengannya sesuatu yang haram yang tidak dibenarkan antara pasangan suami isteri. Nabi SAW berkata: \"Apakah yang kamu inginkan dengan kata-kata ini?\" Dia menjawab: Saya ingin engkau mensucikan saya. Maka, Baginda memerintahkan supaya dia direjam, dan dia direjam. Nabi SAW mendengar dua orang sahabatnya berkata antara satu sama lain: \"Lihatlah lelaki ini yang Allah telah menutup aibnya, tetapi dirinya sendiri tidak meninggalkannya sehingga dia direjam seperti seekor anjing.\" Nabi SAW membisu. Kemudian Baginda berjalan seketika sehingga Baginda lalu di sisi bangkai seekor keldai yang terbaring, lalu Baginda berkata: \"Di manakah si anu dan si anu?\" Mereka menjawab: Kami di sini, ya Rasulullah. Baginda berkata: \"Turunlah dan makanlah daripada bangkai keldai ini.\" Mereka berkata: Ya Nabi Allah, siapakah yang akan makan daripada ini? Baginda berkata: \"Apa yang kamu perolehi daripada aib saudaramu sebentar tadi adalah lebih buruk daripada memakannya. Dan demi Allah yang jiwa ku berada di tangan-Nya, sesungguhnya dia kini berada di sungai-sungai syurga sedang mandi di dalamnya.",
        "arabic_text": "عَنْ أَبِي هُرَيْرَةَ قَالَ: جَاءَ الْأَسْلَمِيُّ إِلَى نَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَشَهِدَ عَلَى نَفْسِهِ أَنَّهُ أَصَابَ امْرَأَةً حَرَامًا أَرْبَعَ مَرَّاتٍ كُلَّ ذَلِكَ يُعْرِضُ عَنْهُ فَأَقْبَلَ فِي الْخَامِسَةِ فَقَالَ: «أَنِكْتَهَا؟» قَالَ: نَعَمْ قَالَ: «حَتَّى غَابَ ذَلِكَ مِنْكَ فِي ذَلِكَ مِنْهَا» قَالَ: نَعَمْ قَالَ: «كَمَا يَغِيبُ الْمِرْوَدُ فِي الْمُكْحُلَةِ وَالرِّشَاءُ فِي الْبِئْرِ؟» قَالَ: نَعَمْ قَالَ: «هَلْ تَدْرِي مَا الزِّنَا؟» قَالَ: نَعَمْ أَتَيْتُ مِنْهَا حَرَامًا مَا يَأْتِي الرَّجُلُ مِنْ أَهْلِهِ حَلَالًا قَالَ: «فَمَا تُرِيدُ بِهَذَا الْقَوْلِ؟» قَالَ: أُرِيدُ أَنْ تُطَهِّرَنِي فَأَمَرَ بِهِ فَرُجِمَ فَسَمِعَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلَيْنِ مِنْ أَصْحَابِهِ يَقُولُ أَحَدُهُمَا لِصَاحِبِهِ: انْظُرْ إِلَى هَذَا الَّذِي سَتَرَ اللَّهُ عَلَيْهِ فَلَمْ تَدَعْهُ نَفْسُهُ حَتَّى رُجِمَ رَجْمَ الْكَلْبِ فَسَكَتَ عَنْهُمَا ثُمَّ سَارَ سَاعَةً حَتَّى مَرَّ بِجِيفَةِ حِمَارٍ شَائِلٍ برجلِهِ فَقَالَ: «أينَ فلانٌ وفلانٌ؟» فَقَالَا: نَحْنُ ذَانِ يَا رَسُولَ اللَّهِ فَقَالَ: «انْزِلَا فَكُلَا مِنْ جِيفَةِ هَذَا الْحِمَارِ» فَقَالَا: يَا نَبِيَّ اللَّهِ مَنْ يَأْكُلُ مِنْ هَذَا؟ قَالَ: «فَمَا نِلْتُمَا مِنْ عَرْضِ أَخِيكُمَا آنِفًا أَشَدُّ مِنْ أَكْلٍ مِنْهُ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّهُ الْآنَ لَفِي أنهارِ الجنَّةِ ينغمسُ فِيهَا» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32322,
        "hadith_number": "3628",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kafarah Dosa Melalui Hukuman",
        "perawi_melayu": "Khuzaimah bin Thabit",
        "english_text": "From Khuzaimah bin Thabit, he said: The Messenger of Allah (peace and blessings be upon him) said: \"Whoever commits a sin and is given the prescribed punishment for that sin, then that punishment is its expiation.\"",
        "malay_translation": "Daripada Khuzaimah bin Thabit, katanya: Rasulullah SAW bersabda:  \"Barang siapa melakukan dosa dan dikenakan hukuman yang telah ditetapkan bagi dosa tersebut, maka hukuman itu menjadi kafarah (tebusan) baginya.\"",
        "arabic_text": "وَعَنْ خُزَيْمَةَ بْنِ ثَابِتٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَصَابَ ذَنْبًا أُقِيمَ عَلَيْهِ حَدُّ ذَلِكَ الذَّنْبِ فَهُوَ كفارتُه» رَوَاهُ فِي شرح السّنة"
      },
      {
        "id": 32323,
        "hadith_number": "3629",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman di Dunia dan Akhirat",
        "perawi_melayu": "Ali r.a. daripada Nabi SAW",
        "english_text": "From Ali (RA) from the Prophet (peace and blessings be upon him), he said: \"Whoever commits a sin and receives its punishment in this world, then Allah is more just than to punish His servant twice in the Hereafter. And whoever commits a sin and Allah covers it up and forgives him, then Allah is more generous than to return to something that He has forgiven.\"",
        "malay_translation": "Daripada Ali r.a daripada Nabi SAW, Baginda bersabda:  \"Barang siapa yang melakukan dosa dan menerima balasannya di dunia ini, maka Allah SWT lebih adil daripada menjatuhkan hukuman dua kali ke atas hamba-Nya di akhirat. Dan barang siapa yang melakukan dosa dan Allah SWT menutupinya dan mengampuninya, maka Allah SWT lebih mulia daripada kembali kepada sesuatu yang telah diampunkan-Nya.\"",
        "arabic_text": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَصَابَ حَدًّا فَعُجِّلَ عُقُوبَتَهُ فِي الدُّنْيَا فَاللَّهُ أَعْدَلُ مِنْ أَنْ يُثَنِّيَ عَلَى عَبْدِهِ الْعُقُوبَةَ فِي الْآخِرَة وَمن أصَاب حد فستره اللَّهُ عليهِ وَعَفَا عَنْهُ فَاللَّهُ أَكْرَمُ مِنْ أَنْ يَعُودَ فِي شَيْءٍ قَدْ عَفَا عَنْهُ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيبٌ هَذَا الْبَاب خَال عَن الْفَصْل الثَّالِث"
      },
      {
        "id": 32324,
        "hadith_number": "3630",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis Mengenai Had Sempadan Sebatan",
        "perawi_melayu": "Abu Bardah bin Nu'air",
        "english_text": "From Abu Baradah ibn Nu'air from the Prophet (peace and blessings of Allah be upon him), who said: \"No one should be flogged more than ten lashes except in the case of a legal punishment prescribed by Allah.\"",
        "malay_translation": "Daripada Abu Bardah bin Nu'air daripada Nabi SAW, Baginda bersabda:  \"Tiada sesiapa pun yang patut disebat melebihi sepuluh sebatan kecuali bagi hukuman had yang telah ditetapkan oleh Allah.\"",
        "arabic_text": "عَن أبي بردة بن ينار عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يُجْلَدُ فَوْقَ عَشْرِ جَلَدَاتٍ إِلَّا فِي حد من حُدُود الله»"
      },
      {
        "id": 32325,
        "hadith_number": "3631",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menghindari Memukul Muka",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "From Abu Hurairah from the Prophet (peace and blessings of Allah be upon him), who said: “If any one of you strikes, then let him avoid the face.”",
        "malay_translation": "Dari Abu Hurairah daripada Nabi Muhammad SAW, Baginda bersabda:  “Jika seseorang di antara kamu memukul, maka hendaklah dia mengelakkan muka.”",
        "arabic_text": "عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا ضَرَبَ أَحَدُكُمْ فَلْيَتَّقِ الوجهَ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32326,
        "hadith_number": "3632",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman Bagi Menyeru Dengan Gelaran Yahudi dan Mukhannath",
        "perawi_melayu": "Ibn Abbas daripada Nabi SAW",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Abbas daripada Nabi Muhammad SAW, Baginda bersabda:  \"Sekiranya seseorang lelaki memanggil lelaki lain dengan gelaran Yahudi, maka dera dia dengan dua puluh kali sebatan. Dan sekiranya dia memanggilnya dengan gelaran Mukhannath, maka dera dia dengan dua puluh kali sebatan. Dan sesiapa yang melakukan hubungan seks dengan wanita yang diharamkan ke atasnya (mahram), maka bunuhlah dia.\"  (Riwayat Tirmizi, dan beliau menyatakan hadis ini adalah hadis yang gharib.)",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِذَا قَالَ الرَّجُلُ لِلرَّجُلِ: يَا يَهُودِيُّ فَاضْرِبُوهُ عِشْرِينَ وَإِذَا قَالَ: يَا مُخَنَّثُ فَاضْرِبُوهُ عِشْرِينَ وَمَنْ وَقَعَ عَلَى ذَاتِ مَحْرَمٍ فَاقْتُلُوهُ . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيب"
      },
      {
        "id": 32327,
        "hadith_number": "3633",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": " Hukuman Bagi Mereka Yang Menipu Dalam Jalan Allah",
        "perawi_melayu": "Umar r.a.",
        "english_text": "From Umar (may Allah be pleased with him), that the Messenger of Allah (peace and blessings of Allah be upon him) said: “If you find a man who has cheated in the way of Allah, burn his belongings and beat him.”  Reported by Tirmidhi and Abu Dawud. Tirmidhi said: This is a Gharib Hadith. This section is devoid of the third chapter.",
        "malay_translation": "Daripada Umar رضي الله عنه, bahawa Rasulullah ﷺ bersabda:  “Jika kamu mendapati seseorang yang telah menipu dalam jalan Allah, bakarlah barang-barangnya dan pukul dia.”  Riwayat Tirmizi dan Abu Daud. Tirmizi berkata: Hadis ini adalah hadis gharib. Bab ini tidak mempunyai bahagian ketiga.",
        "arabic_text": "وَعَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا وَجَدْتُمُ الرَّجُلَ قَدْ غَلَّ فِي سَبِيلِ اللَّهِ فَاحْرُقُوا مَتَاعَهُ وَاضْرِبُوهُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيث غَرِيب هَذَا الْبَاب خَال من الْفَصْل الثَّالِث"
      },
      {
        "id": 32328,
        "hadith_number": "3634",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Arak Daripada Dua Jenis Pokok",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "From Abu Hurairah, from the Messenger of Allah (peace and blessings be upon him), he said: \"Intoxicants are from these two trees: the date palm and the grape.\"",
        "malay_translation": "Daripada Abu Hurairah, daripada Rasulullah SAW, baginda bersabda: \"Arak adalah daripada dua jenis pokok ini: pokok kurma dan pokok anggur.\"",
        "arabic_text": "عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: الْخَمْرُ مِنْ هَاتَيْنِ الشَّجرتينِ: النخلةِ والعِنَبَةِ . رَوَاهُ مُسلم"
      },
      {
        "id": 32329,
        "hadith_number": "3635",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pengharaman Arak dan Sumbernya",
        "perawi_melayu": "Ibnu Umar",
        "english_text": "On the authority of Ibn Umar (may Allah be pleased with them both) who said: Umar (may Allah be pleased with him) delivered a sermon on the pulpit of the Messenger of Allah (peace and blessings of Allah be upon him) and said: 'Indeed, the prohibition of alcohol has been revealed, and it is from five things: grapes, dates, wheat, barley, and honey. And alcohol is whatever intoxicates the mind.' Narrated by Bukhari.",
        "malay_translation": "Daripada Ibnu Umar RA berkata: Umar RA berkhutbah di atas mimbar Rasulullah SAW dan berkata: 'Sesungguhnya telah turun pengharaman arak, dan ia (arak) adalah daripada lima perkara: anggur, kurma, gandum, barli, dan madu. Dan arak adalah apa sahaja yang memabukkan akal.' Riwayat Bukhari.",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: خطَبَ عمرُ رَضِي الله عَنهُ عَلَى مِنْبَرَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: إِنَّهُ قَدْ نَزَلَ تَحْرِيمُ الْخَمْرِ وَهِيَ مِنْ خَمْسَةِ أَشْيَاءَ: الْعِنَبِ وَالتَّمْرِ وَالْحِنْطَةِ والشعيرِ والعسلِ وَالْخمر مَا خامر الْعقل . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32330,
        "hadith_number": "3636",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Arak",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "And from Anas, he said: \"Indeed, wine was forbidden when it was forbidden, and we do not find grape wine except rarely, and the majority of our wine is from dates and unripe grapes.\"",
        "malay_translation": "Dari Anas, beliau berkata:  \"Sesungguhnya arak telah diharamkan ketika ia diharamkan, dan kami tidak menjumpai arak daripada anggur kecuali sedikit sahaja, dan kebanyakan arak kami adalah daripada buah tamar dan buah anggur yang belum masak.\"",
        "arabic_text": "وَعَنْ أَنَسٍ قَالَ: لَقَدْ حُرِّمَتِ الْخَمْرُ حِينَ حُرِّمَتْ وَمَا نَجِدُ خَمْرَ الْأَعْنَابِ إِلَّا قَلِيلًا وَعَامة خمرنا الْبُسْر وَالتَّمْر. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32331,
        "hadith_number": "3637",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Minuman Yang memabukkan adalah Haram",
        "perawi_melayu": "Aisyah",
        "english_text": "And from Aishah (RA) it is narrated that: The Messenger of Allah (ﷺ) was asked about Bit'ah, which is honey-wine, and he said: \"Every intoxicant is Haram.\"",
        "malay_translation": "Daripada Aisyah r.a., diriwayatkan bahawa Rasulullah s.a.w. ditanya tentang bitah iaitu minuman daripada madu, baginda bersabda: \"Setiap minuman yang memabukkan adalah haram.\"",
        "arabic_text": "وَعَنْ عَائِشَةَ قَالَتْ: سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْبِتْعِ وَهُوَ نَبِيذُ الْعَسَلِ فَقَالَ: «كُلُّ شَرَابٍ أَسْكَرَ فَهُوَ حَرَامٌ»"
      },
      {
        "id": 32332,
        "hadith_number": "3638",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kemusykilan Minuman Keras",
        "perawi_melayu": "Ibnu Umar",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Umar r.a., katanya: Rasulullah s.a.w. bersabda:  “Setiap minuman yang memabukkan adalah arak, dan setiap minuman yang memabukkan adalah haram.  Barangsiapa yang meminum arak di dunia, kemudian mati dalam keadaan masih meminumnya tanpa bertaubat, maka dia tidak akan meminumnya di akhirat.”  (Riwayat Muslim)",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كُلُّ مُسْكِرٍ خَمْرٌ وَكُلُّ مُسْكِرٍ حَرَامٌ وَمَنْ شَرِبَ الْخَمْرَ فِي الدُّنْيَا فَمَاتَ وَهُوَ يُدْمِنُهَا لَمْ يَتُبْ لَمْ يَشْرَبْهَا فِي الْآخِرَةِ» . رَوَاهُ مُسلم"
      },
      {
        "id": 32333,
        "hadith_number": "3639",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Minuman Mengkhamar dan Azab Neraka",
        "perawi_melayu": "Jabir",
        "english_text": "And from Jabir that a man came from Yemen and asked the Prophet (peace and blessings of Allaah be upon him) about a drink that they drink in their land, made from grain, called al-Mizr.  The Prophet (peace and blessings of Allaah be upon him) said: \"Is it intoxicating?\" He said: \"Yes.\" He said: \"Every intoxicant is haraam.  Indeed, Allaah has made a covenant with whoever drinks intoxicants that He will give him to drink from the mud of al-Khabal.\" They said: \"O Messenger of Allaah, what is the mud of al-Khabal?\" He said: \"The sweat of the people of the Fire, or the juice of the people of the Fire.\"",
        "malay_translation": "Dari Jabir, bahawa seorang lelaki datang dari Yaman lalu bertanya kepada Nabi SAW tentang minuman yang mereka minum di negeri mereka, daripada bijirin, yang dinamakan al-Mizr. Nabi SAW bertanya: “Adakah ia memabukkan?” Lelaki itu menjawab: “Ya.” Nabi SAW bersabda: “Setiap minuman yang memabukkan adalah haram. Sesungguhnya Allah SWT telah berjanji kepada sesiapa yang meminum arak, bahawa Allah akan memberi minum kepadanya daripada lumpur khabal.” Mereka bertanya: “Wahai Rasulullah, apakah lumpur khabal itu?” Baginda menjawab: “Peluh penduduk neraka atau jus penduduk neraka.” Riwayat Muslim.",
        "arabic_text": "وَعَنْ جَابِرٍ أَنَّ رَجُلًا قَدِمَ مِنَ الْيَمَنِ فَسَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ شَرَابٍ يَشْرَبُونَهُ بِأَرْضِهِمْ مِنَ الذُّرَةِ يُقَالُ لَهُ الْمِزْرُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أوَ مُسْكِرٌ هُوَ؟» قَالَ: نَعَمْ قَالَ: «كُلُّ مُسْكِرٍ حَرَامٌ إِنَّ عَلَى اللَّهِ عَهْدًا لِمَنْ يَشْرَبُ الْمُسْكِرَ أَنْ يَسْقِيَهُ مِنْ طِينَةِ الْخَبَالِ» . قَالُوا: يَا رَسُولَ اللَّهِ وَمَا طِينَةُ الْخَبَالِ؟ قَالَ: «عَرَقُ أَهْلِ النَّارِ أَوْ عُصَارَةُ أَهْلِ النَّارِ» . رَوَاهُ مُسلم"
      },
      {
        "id": 32334,
        "hadith_number": "3640",
        "status": "sahih",
        "nama_buku": "Misykat al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Mencampur Buah-buahan Tertentu dalam Pembuatan Nabidh dan Arahan untuk Membuatnya Secara Berasingan",
        "perawi_melayu": "Abu Qatadah",
        "english_text": "Abu Qatada reported: The Prophet (peace and blessings of Allah be upon him) forbade Nabidh made from mixed dates and unripe dates, and Nabidh made from mixed raisins and dates, and Nabidh made from mixed dried dates and fresh dates. And he said: \"Prepare each one separately.\" (Reported by Muslim)",
        "malay_translation": "Daripada Abu Qatadah: Bahawa Nabi ﷺ melarang daripada (membuat) Nabidh daripada campuran tamar dan busr, dan daripada campuran zabib dan tamar, dan daripada campuran zahw dan rutab. Dan baginda bersabda: \"Buatlah setiap satu secara berasingan.\" (Riwayat Muslim)",
        "arabic_text": "وَعَنْ أَبِي قَتَادَةَ: أَنَّ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ خَلِيطِ التَّمْرِ وَالْبُسْرِ وَعَنْ خَلِيطِ الزَّبِيبِ وَالتَّمْرِ وَعَنْ خَلِيطِ الزَّهْوِ وَالرُّطَبِ. وَقَالَ: «انْتَبِذُوا كُلَّ وَاحِدٍ عَلَى حِدَةٍ» . رَوَاهُ مُسلم"
      },
      {
        "id": 32335,
        "hadith_number": "3641",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menjadikan Arak Sebagai Cuka",
        "perawi_melayu": "Anas RA",
        "english_text": "On the authority of Anas that the Prophet (peace and blessings of Allah be upon him) was asked about wine being made into vinegar? He said: 'No.' Related by Muslim.",
        "malay_translation": "Daripada Anas RA, bahawa Nabi SAW ditanya mengenai arak yang dijadikan cuka? Baginda bersabda: 'Tidak.' Riwayat Muslim.",
        "arabic_text": "وَعَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنِ الْخَمْرِ يُتَّخَذُ خَلًّا؟ فَقَالَ: «لَا» . رَوَاهُ مُسلم"
      },
      {
        "id": 32336,
        "hadith_number": "3642",
        "status": "Sahih",
        "nama_buku": "Misykat al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Arak Bukanlah Ubat, Tetapi Penyakit",
        "perawi_melayu": "Wa'il al-Hadhrami",
        "english_text": "Diriwayatkan dari Wa'il al-Hadhrami bahawa Tariq bin Suwaid bertanya kepada Nabi ﷺ tentang arak, lalu baginda melarangnya. Dia berkata: 'Saya hanya membuatnya untuk ubat.' Baginda bersabda: 'Sesungguhnya ia bukanlah ubat, tetapi ia adalah penyakit.'",
        "malay_translation": "Daripada Wa'il al-Hadhrami, bahawa Tariq bin Suwaid bertanya kepada Nabi ﷺ tentang arak, lalu baginda melarangnya. Dia berkata: 'Saya hanya membuatnya untuk ubat.' Baginda bersabda: 'Sesungguhnya ia bukanlah ubat, tetapi ia adalah penyakit.' (Riwayat Muslim)",
        "arabic_text": "وَعَنْ وَائِلٍ الْحَضْرَمِيِّ أَنَّ طَارِقَ بْنَ سُوَيْدٍ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْخَمْرِ فَنَهَاهُ. فَقَالَ: إِنَّمَا أَصْنَعُهَا لِلدَّوَاءِ فَقَالَ: «إِنَّهُ لَيْسَ بِدَوَاءٍ وَلَكِنَّهُ دَاءٌ» . رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 32337,
        "hadith_number": "3643",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Solat Tidak Diterima Selepas Minum Arak",
        "perawi_melayu": "Abdullah bin Umar",
        "english_text": "From Abdullah ibn Umar, who said: The Messenger of Allah (peace and blessings be upon him) said, \"Whoever drinks alcohol, Allah will not accept his prayers for forty mornings. If he repents, Allah will accept his repentance. If he returns to it, Allah will not accept his prayers for forty mornings. If he repents, Allah will accept his repentance. If he returns to it, Allah will not accept his prayers for forty mornings. If he repents, Allah will accept his repentance. But if he returns to it a fourth time, Allah will not accept his prayers for forty mornings, and will not accept his repentance, and will give him to drink from the river of Khabal.\"",
        "malay_translation": "Daripada Abdullah bin Umar, katanya: Rasulullah SAW bersabda: \"Barang siapa yang meminum arak, Allah SWT tidak akan menerima solatnya selama empat puluh pagi. Jika dia bertaubat, nescaya Allah SWT akan menerima taubatnya. Jika dia mengulanginya, Allah SWT tidak akan menerima solatnya selama empat puluh pagi. Jika dia bertaubat, nescaya Allah SWT akan menerima taubatnya. Jika dia mengulanginya, Allah SWT tidak akan menerima solatnya selama empat puluh pagi. Jika dia bertaubat, nescaya Allah SWT akan menerima taubatnya. Tetapi jika dia mengulanginya buat kali keempat, Allah SWT tidak akan menerima solatnya selama empat puluh pagi, dan tidak akan menerima taubatnya, serta akan memberi minum kepadanya daripada sungai Khabal.\"",
        "arabic_text": "عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم«مَنْ شَرِبَ الْخَمْرَ لَمْ يَقْبَلِ اللَّهُ لَهُ صَلَاةَ أَرْبَعِينَ صَبَاحًا فَإِنْ تَابَ تَابَ اللَّهُ عَلَيْهِ. فَإِن عَاد لم يقبل الله لَهُ صَلَاة أَرْبَعِينَ صَبَاحًا فَإِنْ تَابَ تَابَ اللَّهُ عَلَيْهِ فَإِن عَاد لم يقبل الله لَهُ صَلَاة أَرْبَعِينَ صَبَاحًا فَإِنْ تَابَ تَابَ اللَّهُ عَلَيْهِ فَإِنْ عَادَ فِي الرَّابِعَةِ لَمْ يَقْبَلِ اللَّهُ لَهُ صَلَاة أَرْبَعِينَ صباحا فَإِن تَابَ لم يَتُبِ اللَّهُ عَلَيْهِ وَسَقَاهُ مِنْ نَهْرِ الْخَبَالِ» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 32338,
        "hadith_number": "3644",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Periwayat Hadis daripada Abdullah bin Amru",
        "perawi_melayu": "Al-Nasai, Ibnu Majah dan Ad-Darimi daripada Abdullah bin Amru",
        "english_text": "Not Available",
        "malay_translation": "Hadis ini diriwayatkan oleh al-Nasai, Ibnu Majah dan ad-Darimi daripada Abdullah bin Amru.",
        "arabic_text": "وَرَوَاهُ النَّسَائِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ عَنْ عَبْدِ الله بن عَمْرو"
      },
      {
        "id": 32339,
        "hadith_number": "3645",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Minuman Mengkhayalkan",
        "perawi_melayu": "Jabir",
        "english_text": "From Jabir that the Messenger of Allah (peace and blessings be upon him) said: \"Whatever intoxicates in large quantities, a small quantity of it is also forbidden.\"",
        "malay_translation": "Dari Jabir bahawa Rasulullah SAW bersabda:  “Apa sahaja yang memabukkan jika banyak, sedikit daripadanya juga haram.”",
        "arabic_text": "وَعَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ"
      },
      {
        "id": 32340,
        "hadith_number": "3646",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Minuman Mengkhamar",
        "perawi_melayu": "Aisyah r.a daripada Rasulullah SAW",
        "english_text": "From Aisha (RA) from the Messenger of Allah (PBUH) who said: \"Whatever intoxicates in a large quantity, a mouthful of it is haram.\"",
        "malay_translation": "Daripada Aisyah r.a daripada Rasulullah SAW, Baginda bersabda:  \"Apa sahaja yang memabukkan jika diminum dengan banyak,  sebanyak satu teguk pun adalah haram.\"",
        "arabic_text": "وَعَنْ عَائِشَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا أسكرَ مِنْهُ الفرْقُ فَمِلْءُ الْكَفِّ مِنْهُ حَرَامٌ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُد"
      },
      {
        "id": 32341,
        "hadith_number": "3647",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Khamr daripada Gandum, Barli, Kurma, Kismis dan Madu",
        "perawi_melayu": "Nu'man bin Basir",
        "english_text": "From Nu'man bin Bashir, he said: The Messenger of Allah (ﷺ) said: \"Indeed, from wheat is khamr, and from barley is khamr, and from dates is khamr, and from raisins is khamr, and from honey is khamr.\"",
        "malay_translation": "Daripada Nu'man bin Basir, beliau berkata: Rasulullah SAW bersabda:  \"Sesungguhnya daripada gandum adalah khamr, dan daripada barli adalah khamr, dan daripada kurma adalah khamr, dan daripada kismis adalah khamr, dan daripada madu adalah khamr.\" ",
        "arabic_text": "وَعَنِ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ مِنْ الْحِنْطَةِ خَمْرًا وَمِنَ الشَّعِيرِ خَمْرًا وَمِنَ التَّمْرِ خَمْرًا وَمِنَ الزَّبِيبِ خَمْرًا وَمِنَ الْعَسَلِ خَمْرًا» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيبٌ"
      },
      {
        "id": 32342,
        "hadith_number": "3648",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Membuang Arak Milik Anak Yatim",
        "perawi_melayu": "Abu Said al-Khudri",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Said al-Khudri, katanya:  Kami mempunyai arak milik anak yatim.  Apabila ayat (surah al-Maidah) diturunkan, kami bertanya kepada Rasulullah SAW mengenainya.  Saya berkata:  “Ia adalah milik anak yatim.”  Baginda bersabda:  “Tuangkan dan buangkanlah ia.” Riwayat Tirmizi.",
        "arabic_text": "وَعَن أبي سعيدٍ الخدريِّ قَالَ: كانَ عندَنا خَمْرٌ لِيَتِيمٍ فَلَمَّا نَزَلَتِ (الْمَائِدَةُ) سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْهُ وَقُلْتُ: إِنَّه ليَتيمٍ فَقَالَ: «أهْريقوهُ» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 32343,
        "hadith_number": "3649",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Minuman Keras Milik Anak Yatim",
        "perawi_melayu": "Anas daripada Abu Talhah",
        "english_text": "And from Anas from Abu Talhah: that he said: O Prophet of Allah, I bought wine for orphans in my care. He said: \"Pour out the wine and break the containers.\" Related by Tirmidhi and he weakened it. And in the narration of Abu Dawud: that he asked the Prophet (peace and blessings of Allah be upon him) about orphans who inherited wine. He said: \"Pour it out.\" He said: Should I not make it vinegar? He said: \"No\"",
        "malay_translation": "Dari Anas daripada Abu Talhah, bahawa beliau berkata: Wahai Nabi Allah, sesungguhnya saya telah membeli arak untuk anak-anak yatim di bawah jagaan saya. Baginda berkata: “Tuangkan arak itu dan pecahkan bekasnya.”  Riwayat Tirmizi dan beliau melemahkannya.  Dan dalam riwayat Abu Daud: bahawa beliau bertanya kepada Nabi SAW tentang anak-anak yatim yang mewarisi arak. Baginda berkata: “Tuangkanlah ia.” Beliau bertanya: Patutkah saya tidak menjadikannya cuka? Baginda menjawab: “Tidak.”",
        "arabic_text": "وَعَنْ أَنَسٍ عَنْ أَبِي طَلْحَةَ: أَنَّهُ قَالَ: يَا نَبِيَّ اللَّهِ إِنِّي اشْتَرَيْتُ خَمْرًا لِأَيْتَامٍ فِي حِجْرِي قَالَ: «أَهْرِقِ الْخَمْرَ وَاكْسِرِ الدِّنَانَ» . رَوَاهُ التِّرْمِذِيُّ وَضَعَّفَهُ. وَفِي رِوَايَةِ أَبِي دَاوُدَ: أَنه سَأَلَهُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَيْتَامٍ وَرِثُوا خَمْرًا قَالَ: «أَهْرِقْهَا» . قَالَ: أَفَلَا أَجْعَلُهَا خلاًّ؟ قَالَ: «لَا»"
      },
      {
        "id": 32344,
        "hadith_number": "3650",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Rasulullah SAW terhadap Minuman Mengkhayalkan dan Yang Menimbulkan Nafsu",
        "perawi_melayu": "Ummu Salamah",
        "english_text": "From Umm Salamah, she said: The Messenger of Allah (ﷺ) forbade all intoxicants and things that incite desires.",
        "malay_translation": "Daripada Ummu Salamah, beliau berkata: Rasulullah SAW melarang segala minuman yang memabukkan dan perkara-perkara yang membangkitkan nafsu.",
        "arabic_text": "عَنْ أُمِّ سَلَمَةَ قَالَتْ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كُلِّ مُسْكِرٍ ومقتر. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32345,
        "hadith_number": "3651",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Minuman Mengkhamar",
        "perawi_melayu": "Dailam al-Himyari",
        "english_text": "From Dailam al-Himyari, he said: I said to the Messenger of Allah (peace and blessings be upon him): 'O Messenger of Allah, we are in a cold land and we perform strenuous work, and we make a drink from this wheat to strengthen ourselves for our work and for the cold of our land.' He said: 'Does it intoxicate?' I said: 'Yes.' He said: 'Then avoid it.' I said: 'The people are not abandoning it.' He said: 'If they do not abandon it, then fight them.'",
        "malay_translation": "Dari Dailam al-Himyari, beliau berkata: Aku berkata kepada Rasulullah SAW: “Wahai Rasulullah, kami berada di tanah yang sejuk dan kami melakukan kerja yang berat, dan kami membuat minuman daripada gandum ini untuk menguatkan diri kami untuk kerja kami dan untuk kesejukan tanah air kami.” Baginda SAW bersabda: “Adakah ia memabukkan?” Aku berkata: “Ya.” Baginda SAW bersabda: “Maka jauhilah ia.” Aku berkata: “Orang ramai tidak meninggalkannya.” Baginda SAW bersabda: “Jika mereka tidak meninggalkannya, maka perangilah mereka.”",
        "arabic_text": "وَعَنْ دَيْلَمٍ الْحِمْيَرِيِّ قَالَ: قُلْتُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: يَا رَسُولَ اللَّهِ إِنَّا بِأَرْضٍ بَارِدَةٍ وَنُعَالِجُ فِيهَا عَمَلًا شَدِيدًا وَإِنَّا نَتَّخِذُ شَرَابًا مِنْ هَذَا الْقَمْحِ نَتَقَوَّى بِهِ عَلَى أَعْمَالِنَا وَعَلَى بَرْدِ بِلَادِنَا قَالَ: «هَلْ يُسْكِرُ؟» قُلْتُ: نَعَمْ قَالَ: «فَاجْتَنِبُوهُ» قُلْتُ: إِنَّ النَّاسَ غَيْرُ تَارِكِيهِ قَالَ: «إِنْ لَمْ يَتْرُكُوهُ فقاتلوهم» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32346,
        "hadith_number": "3652",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Rasulullah SAW terhadap Minuman Keras dan Perjudian",
        "perawi_melayu": "Abdullah bin Amr",
        "english_text": "From Abdullah ibn Amr: The Prophet (peace and blessings of Allaah be upon him) forbade alcohol, gambling, and the kuubah and ghubayrah, and he said: \"Every intoxicant is haraam.\"",
        "malay_translation": "Daripada Abdullah bin Amr: Bahawa Nabi Muhammad SAW telah melarang arak, judi, dan kubbah serta ghubayrah, dan baginda bersabda:  \"Setiap minuman yang memabukkan adalah haram.\" ",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو: أَنَّ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْخَمْرِ وَالْمَيْسِرِ وَالْكُوبَةِ وَالْغُبَيْرَاءِ وَقَالَ: «كُلُّ مُسْكِرٍ حَرَامٌ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32347,
        "hadith_number": "3653",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Golongan yang Tidak Akan Masuk Syurga",
        "perawi_melayu": "Abu Hurairah RA",
        "english_text": "Narrated from him (Abu Hurairah) from the Prophet (peace and blessings of Allah be upon him) who said: «The undutiful (to parents), the gambler, the one who reminds of favors, and the one who is addicted to alcohol will not enter Paradise.» Narrated by ad-Darimi, and in a narration of his: «And not the child of fornication» instead of «gambler».",
        "malay_translation": "Daripada Abu Hurairah RA, daripada Nabi SAW yang bersabda: «Tidak akan masuk syurga orang yang derhaka (kepada ibu bapa), penjudi, orang yang mengungkit pemberian, dan orang yang ketagih arak.» Diriwayatkan oleh ad-Darimi, dan dalam riwayat lain daripadanya: «Dan tidak juga anak zina» sebagai ganti «penjudi».",
        "arabic_text": "وَعَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَدْخُلُ الْجَنَّةَ عَاقٌّ وَلَا قَمَّارٌ وَلَا مَنَّانٌ وَلَا مُدْمِنُ خَمْرٍ» . رَوَاهُ الدَّارِمِيُّ وَفِي رِوَايَةٍ لَهُ: «وَلَا وَلَدَ زِنْيَةٍ» بَدَلَ «قمار»"
      },
      {
        "id": 32348,
        "hadith_number": "3654",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rahmat dan Petunjuk Nabi serta Larangan Allah",
        "perawi_melayu": "Abu Umamah",
        "english_text": "From Abu Umamah, he said: The Prophet (ﷺ) said: \"Indeed, Allah Almighty sent me as a mercy to the worlds and a guide to the worlds, and my Lord, the Almighty, ordered me to abolish musical instruments, musical instruments, idols, and the practices of Jahiliyyah. And my Lord, the Almighty, swore: By My honor, I will not give a slave of Mine a drink of wine unless I will give him a similar amount of boiling water, and whoever leaves it out of fear of Me, I will give him to drink from the pools of Quds.\" Narrated by Ahmad",
        "malay_translation": "Daripada Abu Umamah, beliau berkata: Rasulullah SAW bersabda:  \"Sesungguhnya Allah SWT telah mengutusku sebagai rahmat kepada seluruh alam dan petunjuk kepada seluruh alam, dan Tuhanku Yang Maha Agung telah memerintahkanku untuk menghapuskan alat-alat muzik, gambang, berhala, dan amalan jahiliyyah. Dan Tuhanku Yang Maha Agung telah bersumpah: Demi keagungan-Ku, Aku tidak akan memberi minuman khamar kepada seorang hamba-Ku melainkan Aku akan memberinya minuman yang serupa dengannya, dan sesiapa yang meninggalkannya kerana takut kepada-Ku, nescaya Aku akan memberinya minum dari telaga-telaga Al-Quds.\" Riwayat Ahmad.",
        "arabic_text": "وَعَنْ أَبِي أُمَامَةَ قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ اللَّهَ تَعَالَى بَعَثَنِي رَحْمَة للعالمينَ وهُدىً لِلْعَالِمِينَ وَأَمَرَنِي رَبِّي عَزَّ وَجَلَّ بِمَحْقِ الْمَعَازِفِ وَالْمَزَامِيرِ وَالْأَوْثَانِ وَالصُّلُبِ وَأَمْرِ الْجَاهِلِيَّةِ وَحَلَفَ رَبِّي عزَّ وجلَّ: بعِزَّتي لَا يشربُ عبدٌ منْ عَبِيدِي جرعة خَمْرٍ إِلَّا سَقَيْتُهُ مِنَ الصَّدِيدِ مِثْلَهَا وَلَا يَتْرُكُهَا مِنْ مَخَافَتِي إِلَّا سَقَيْتُهُ مِنْ حِيَاضِ الْقُدس . رَوَاهُ أَحْمد"
      },
      {
        "id": 32349,
        "hadith_number": "3655",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tiga Golongan yang Dilarang Masuk Syurga",
        "perawi_melayu": "Ibn Umar",
        "english_text": "From Ibn Umar, that the Messenger of Allah (peace and blessings be upon him) said: \"Three types of people are forbidden from entering Paradise: the habitual drinker of alcohol, the disobedient child, and the man who permits evil in his family.\"",
        "malay_translation": "Daripada Ibnu Umar, bahawa Rasulullah SAW bersabda: \"Tiga golongan yang Allah haramkan ke atas mereka daripada masuk syurga: Penagih arak, anak yang derhaka, dan lelaki yang membenarkan kemungkaran dalam keluarganya.\"",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: ثَلَاثَةٌ قَدْ حَرَّمَ اللَّهُ عَلَيْهِمُ الْجَنَّةَ: مُدْمِنُ الْخَمْرِ وَالْعَاقُّ وَالدَّيُّوثُ الَّذِي يُقِرُّ فِي أَهْلِهِ الْخَبَثَ . رَوَاهُ أَحْمَدُ وَالنَّسَائِيّ"
      },
      {
        "id": 32350,
        "hadith_number": "3656",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tiga Golongan yang Tidak Masuk Syurga",
        "perawi_melayu": "Abu Musa Al-Ash'ari",
        "english_text": "From Abi Musa Al-Ash'ari, that the Prophet (peace and blessings of Allah be upon him) said: \"Three will not enter Paradise: a habitual drunkard, one who cuts off family ties, and one who believes in sorcery.\"",
        "malay_translation": "Daripada Abi Musa Al-Ash'ari, bahawa Nabi Muhammad SAW bersabda: \"Tiga golongan yang tidak akan masuk syurga: penagih arak, pemutus silaturahim, dan orang yang mempercayai sihir.\"",
        "arabic_text": "وَعَنْ أَبِي مُوسَى الْأَشْعَرِيِّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: ثَلَاثَةٌ لَا تَدْخُلُ الجنَّةَ: مُدْمنُ الخمرِ وقاطِعُ الرَّحِم ومصدق السحر رَوَاهُ أَحْمد"
      },
      {
        "id": 32351,
        "hadith_number": "3657",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Akibat Ketagihan Arak",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "From Ibn Abbas, he said: The Messenger of Allah (peace and blessings be upon him) said: \"The one who is addicted to alcohol, if he dies, will meet Allah like a worshipper of idols.\"",
        "malay_translation": "Daripada Ibnu Abbas, beliau berkata: Rasulullah SAW bersabda:  \"Sesiapa yang ketagih arak, jika dia mati, nescaya dia akan menemui Allah SWT seperti penyembah berhala.\"",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مُدْمِنُ الْخَمْرِ إِنْ مَاتَ لقيَ اللَّهَ كعابِدِ وثن» . رَوَاهُ أَحْمد"
      },
      {
        "id": 32352,
        "hadith_number": "3658",
        "status": "Sahih",
        "nama_buku": "Mishkat al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis Riwayat daripada Abu Hurairah",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Tiada teks Inggeris",
        "malay_translation": "Diriwayatkan oleh Ibn Majah daripada Abu Hurairah.",
        "arabic_text": "وروى ابْن مَاجَه عَن أبي هُرَيْرَة"
      },
      {
        "id": 32353,
        "hadith_number": "3659",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Riwayat  daripada  Muhammad bin Abdullah",
        "perawi_melayu": "Muhammad bin `Ubaydillah daripada bapanya;  Bukhari menyebut dalam Tarikh daripada Muhammad bin Abdullah daripada bapanya.",
        "english_text": "Al-Bayhaqi in \"Shu`ab al-Iman\" from Muhammad bin `Ubaydillah from his father. He said: Bukhari mentioned in at-Tarikh from Muhammad bin `Abdullah from his father.",
        "malay_translation": "Al-Bayhaqi di dalam kitab  \"Syu`ab al-Iman\" meriwayatkan daripada Muhammad bin `Ubaydillah daripada bapanya.  Baginda berkata: Bukhari menyebut di dalam at-Tarikh daripada Muhammad bin `Abdullah daripada bapanya.",
        "arabic_text": "وَالْبَيْهَقِيُّ فِي «شُعَبِ الْإِيمَانِ» عَنْ مُحَمَّدِ بْنِ عبيد الله عَن أَبِيه. قَالَ: ذَكَرَ الْبُخَارِيُّ فِي التَّارِيخِ عَنْ مُحَمَّدِ بْنِ عبد الله عَن أَبِيه"
      },
      {
        "id": 32354,
        "hadith_number": "3660",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kesamaan Dosakah Minum Arak dan Syirik?",
        "perawi_melayu": "Abu Musa Al-Asy'ari",
        "english_text": "From Abu Musa, that he used to say: \"I don’t care whether I drank wine or worshipped this star besides Allah.\"",
        "malay_translation": "Daripada Abu Musa, bahawa baginda biasa berkata: \"Aku tidak kisah sama ada aku meminum arak atau menyembah bintang ini selain Allah.\"",
        "arabic_text": "وَعَنْ أَبِي مُوسَى أَنَّهُ كَانَ يَقُولُ: مَا أُبالي شرِبتُ الخمرَ أَو عبدْتُ هذهِ السَّارِيةَ دونَ اللَّهِ. رَوَاهُ النَّسَائِيّ"
      }
    ]
  }
}