{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 22,
    "data": [
      {
        "id": 33300,
        "hadith_number": "4606",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kehabisan Kenabian Kecuali Berita Gembira",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Daripada Abu Hurairah, katanya: Rasulullah SAW bersabda: \"Tidak tinggal lagi daripada kenabian melainkan berita gembira.\" Mereka bertanya: Apakah berita gembira itu? Baginda menjawab: \"Mimpi yang baik.\"",
        "malay_translation": "Daripada Abu Hurairah, katanya: Rasulullah SAW bersabda: \"Tidak tinggal lagi daripada kenabian melainkan berita gembira.\" Mereka bertanya: Apakah berita gembira itu? Baginda menjawab: \"Mimpi yang baik.\"  Hadis ini diriwayatkan oleh Imam Bukhari.",
        "arabic_text": "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَمْ يَبْقَ مِنَ النُّبُوَّةِ إِلَّا الْمُبَشِّرَاتُ» قَالُوا: وَمَا الْمُبَشِّرَاتُ؟ قَالَ: «الرُّؤْيَا الصالحةُ» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 33301,
        "hadith_number": "4607",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis Mengenai Melihat Atau Disaksikan Keindahan",
        "perawi_melayu": null,
        "english_text": "Dan tambahan Malik dengan riwayat Ata' bin Yasar: \"Melihatnya orang Islam atau dilihat baginya.\"",
        "malay_translation": "Dan tambahan Malik dengan riwayat Ata' bin Yasar: \"Melihat keindahan itu oleh seseorang Muslim atau keindahan itu dilihat kepadanya.\"",
        "arabic_text": "وَزَادَ مَالِكٌ بِرِوَايَةِ عَطَاءِ بْنِ يَسَارٍ: «يَرَاهَا الرجل الْمُسلم أَو ترى لَهُ»"
      },
      {
        "id": 33302,
        "hadith_number": "4608",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mimpi Baik Sebagai Sebahagian daripada Nubuwah",
        "perawi_melayu": null,
        "english_text": "From Anas, he said: The Messenger of Allah, peace and blessings be upon him, said, \"A good dream is part of forty-six parts of prophethood.\"",
        "malay_translation": "Dari Anas, beliau berkata: Rasulullah SAW bersabda, \"Mimpi yang baik adalah sebahagian daripada 46 bahagian daripada kenabian.\"",
        "arabic_text": "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الرُّؤْيَا الصَّالِحَةُ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ»"
      },
      {
        "id": 33303,
        "hadith_number": "4609",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Melihat Rasulullah SAW dalam Mimpi",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Daripada Abu Hurairah, bahawa Rasulullah SAW bersabda: \"Barangsiapa yang melihatku dalam mimpinya, maka sesungguhnya dia telah melihatku. Sesungguhnya syaitan tidak dapat menyerupai rupaku.\"",
        "malay_translation": "Daripada Abu Hurairah, bahawa Rasulullah SAW bersabda, “Barangsiapa yang melihatku dalam mimpinya, maka sesungguhnya dia telah melihatku. Sesungguhnya syaitan tidak dapat menyerupai bentukku.”",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم قَالَ: «من رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي فَإِنَّ الشَّيْطَانَ لَا يَتَمَثَّلُ فِي صُورَتِي»"
      },
      {
        "id": 33304,
        "hadith_number": "4610",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Barangsiapa Melihatku, Sesungguhnya Ia Telah Melihat Kebenaran",
        "perawi_melayu": "Abu Qatadah",
        "english_text": "And from Abu Qatadah, he said: The Messenger of Allah, peace and blessings be upon him, said, \"Whoever has seen me has seen the truth.\"",
        "malay_translation": "Dan daripada Abu Qatadah, beliau berkata: Rasulullah SAW bersabda, \"Barangsiapa yang melihatku, maka sesungguhnya dia telah melihat kebenaran.\"",
        "arabic_text": "وَعَنْ أَبِي قَتَادَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ رَآنِي فَقَدْ رَأَى الْحَقَّ»"
      },
      {
        "id": 33305,
        "hadith_number": "4611",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Melihat Nabi SAW dalam Mimpi dan Kesannya di Dunia Nyata",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "And from Abu Hurairah, he said: The Messenger of Allah صلى الله عليه وسلم said, \"Whoever sees me in a dream, then he will meet me in the waking state and the Shaytan will not impersonate me.\"",
        "malay_translation": "Dan daripada Abu Hurairah, beliau berkata: Rasulullah SAW bersabda, \"Barangsiapa yang melihatku dalam mimpinya, maka dia akan menemuiku di dalam keadaan sedar dan syaitan tidak akan meniru-niru aku.\"",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم: «من رَآنِي فِي الْمَنَام فيسراني فِي الْيَقَظَةِ وَلَا يَتَمَثَّلُ الشَّيْطَانُ بِي»"
      },
      {
        "id": 33306,
        "hadith_number": "4612",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tafsiran Mimpi: Mimpi Baik dari Allah, Mimpi Buruk dari Syaitan",
        "perawi_melayu": "Abu Qatadah",
        "english_text": "And from Abu Qatadah, he said: The Messenger of Allah, peace and blessings be upon him, said, \"A good dream is from Allah, and a bad dream is from the Shaytan.  So if one of you sees something he loves, then let him not narrate it except to someone he loves. And if he sees something he dislikes, then let him seek refuge with Allah from its evil and from the evil of Shaytan, and let him spit three times, and let him not narrate it to anyone, for it will not harm him.\"",
        "malay_translation": "Dan daripada Abu Qatadah, beliau berkata: Rasulullah SAW bersabda, \"Mimpi yang baik adalah daripada Allah, dan mimpi buruk adalah daripada syaitan. Oleh itu, jika salah seorang daripada kamu melihat sesuatu yang disukainya, maka janganlah dia menceritakannya kecuali kepada orang yang disukainya. Dan jika dia melihat sesuatu yang tidak disukainya, maka hendaklah dia berlindung kepada Allah daripada kejahatannya dan daripada kejahatan syaitan, dan hendaklah dia memuntahkan air liur tiga kali, dan janganlah dia menceritakannya kepada sesiapa pun, kerana ia tidak akan membahayakannya.\"",
        "arabic_text": "وَعَنْ أَبِي قَتَادَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الرُّؤْيَا الصَّالِحَةُ مِنَ اللَّهِ وَالْحُلْمُ مِنَ الشَّيْطَانِ فَإِذَا رَأَى أَحَدُكُمْ مَا يُحِبُّ فَلَا يُحَدِّثُ بِهِ إِلَّا مَنْ يُحِبُّ وَإِذَا رَأَى مَا يَكْرَهُ فَلْيَتَعَوَّذْ بِاللَّهِ مِنْ شَرِّهَا وَمِنْ شَرِّ الشَّيْطَانِ وَلْيَتْفُلْ ثَلَاثًا وَلَا يُحَدِّثْ بِهَا أحدا فَإِنَّهَا لن تضره»"
      },
      {
        "id": 33307,
        "hadith_number": "4613",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Panduan Menghadapi Mimpi Buruk",
        "perawi_melayu": "Jabir",
        "english_text": "Daripada Jabir, dia berkata: Rasulullah SAW bersabda: \"Jika salah seorang daripada kamu melihat mimpi yang tidak disukainya, hendaklah dia memuntahkan air liur ke sebelah kirinya sebanyak tiga kali, dan memohon perlindungan kepada Allah daripada syaitan sebanyak tiga kali, dan hendaklah dia berpaling dari sisi tempat tidurnya yang sedang dia berada.\"",
        "malay_translation": "Daripada Jabir, beliau meriwayatkan bahawa Rasulullah SAW bersabda, \"Jika seseorang di antara kamu melihat mimpi yang tidak disukai, maka hendaklah dia memuntahkan air liur ke sebelah kirinya tiga kali, memohon perlindungan daripada Allah daripada syaitan tiga kali, dan mengubah kedudukannya daripada sisi tempat tidur yang sedang didudukinya.\"",
        "arabic_text": "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا رَأَى أَحَدُكُمُ الرُّؤْيَا يَكْرَهُهَا فَلْيَبْصُقْ عَنْ يَسَارِهِ ثَلَاثًا وَلْيَسْتَعِذْ بِاللَّهِ مِنَ الشَّيْطَانِ ثَلَاثًا وَلْيَتَحَوَّلْ عَنْ جَنْبِهِ الَّذِي كانَ عَلَيْهِ» . رَوَاهُ مُسلم"
      },
      {
        "id": 33308,
        "hadith_number": "4614",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kebolehpercayaan Mimpi Seorang Mukmin Menjelang Kedatangan Hari Kiamat",
        "perawi_melayu": null,
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah r.a., Rasulullah SAW bersabda, \"Apabila zaman semakin hampir, mimpi seorang mukmin jarang sekali berbohong. Mimpi mukmin itu merupakan sebahagian daripada 46 bahagian daripada kenabian, dan apa yang termasuk daripada kenabian itu, nescaya ia tidak akan berbohong.\".  Muhammad bin Sirin berkata, \"Dan aku katakan, mimpi itu ada tiga: Bisikan hati, menakutkan syaitan, dan berita gembira dari Allah.  Jika seseorang melihat sesuatu yang tidak disukai, janganlah dia ceritakan kepada sesiapa pun, dan hendaklah dia bangun dan solat. Sabda lagi, \"Pengalaman bermimpi diikat dalam mimpi itu tidak disukai, dan mereka menganggap ikatan itu sebagai kekuatan dalam agama. Ikatan atau pengikat  dalam agama.\" ",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا اقْتَرَبَ الزَّمَانُ لَمْ يَكَدْ يَكْذِبُ رُؤْيَا الْمُؤْمِنِ وَرُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ وَمَا كَانَ مِنَ النُّبُوَّةِ فَإِنَّهُ لَا يَكْذِبُ» . قَالَ مُحَمَّدُ بْنُ سِيرِينَ: وَأَنَا أَقُولُ: الرُّؤْيَا ثَلَاثٌ: حَدِيثُ النَّفْسِ وَتَخْوِيفُ الشَّيْطَانِ وَبُشْرَى مِنَ اللَّهِ فَمَنْ رَأَى شَيْئًا يَكْرَهُهُ فَلَا يَقُصَّهُ عَلَى أَحَدٍ وَلْيَقُمْ فَلْيُصَلِّ قَالَ: وَكَانَ يُكْرَهُ الْغُلُّ فِي النَّوْمِ وَيُعْجِبُهُمُ الْقَيْدُ وَيُقَال: الْقَيْد ثبات فِي الدّين"
      },
      {
        "id": 33309,
        "hadith_number": "4615",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis Tentang Keengganan Mengikat Tangan",
        "perawi_melayu": "Qatadah, Yunus, Hisham, dan Abu Hilal dari Ibnu Sirin dari Abu Hurairah",
        "english_text": "Bukhari meriwayatkan bahawa Qatadah, Yunus, Hisham, dan Abu Hilal meriwayatkan dari Ibnu Sirin dari Abu Hurairah. Yunus berkata, 'Aku rasa ia daripada Nabi SAW semasa dibelenggu. Muslim berkata, 'Aku tidak pasti sama ada ia dalam hadis atau perkataan Ibnu Sirin. Ada riwayat yang sama dan ia memasukkan perkataan 'dan aku membenci belenggu...'. sehingga akhir perkataan",
        "malay_translation": "Imam Bukhari meriwayatkan bahawa Qatadah, Yunus, Hisham, dan Abu Hilal meriwayatkan hadis ini daripada Ibnu Sirin daripada Abu Hurairah. Yunus berkata, \"Aku rasa hadis ini daripada Nabi SAW semasa baginda dibelenggu.\" Muslim pula berkata, \"Saya tidak pasti sama ada ini merupakan sebahagian daripada hadis atau perkataan Ibnu Sirin sendiri.\"  Terdapat riwayat yang serupa, dan ia memasukkan perkataan \"dan aku membenci belenggu...\" hingga akhir perkataan tersebut.",
        "arabic_text": "قَالَ البُخَارِيّ: رَوَاهُ قَتَادَة وَيُونُس وَهِشَام وَأَبُو هِلَالٍ عَنِ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ وَقَالَ يُونُسُ: لَا أَحْسَبُهُ إِلَّا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْقَيْدِ وَقَالَ مُسْلِمٌ: لَا أَدْرِي هُوَ فِي الْحَدِيثِ أَمْ قَالَهُ ابْنُ سِيرِينَ؟ وَفِي رِوَايَةٍ نَحْوُهُ وَأَدْرَجَ فِي الْحَدِيثِ قَوْلَهُ: «وَأَكْرَهُ الْغُلَّ. . .» إِلَى تَمام الْكَلَام"
      },
      {
        "id": 33310,
        "hadith_number": "4616",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mimpi Kepala Terputus dan Nasihat Nabi SAW",
        "perawi_melayu": "Jabir",
        "english_text": "And from Jabir, he said: The Prophet SAW came and said, \"I saw in a dream as if my head was severed.\" He said: Then the Prophet SAW laughed and said, \"If the devil plays with one of you in a dream, let him not tell the people about it.\"",
        "malay_translation": "Dan daripada Jabir, beliau berkata: Rasulullah SAW datang dan bersabda, \"Aku melihat dalam mimpi seakan-akan kepalaku terputus.\"  Beliau (Rasulullah SAW) kemudian tertawa dan bersabda, \"Jika syaitan bermain-main dengan salah seorang daripada kamu dalam mimpinya, janganlah dia menceritakannya kepada orang ramai.\"",
        "arabic_text": "وَعَن جَابر قَالَ: جَاءَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: رَأَيْتُ فِي الْمَنَامِ كَأَنَّ رَأْسِي قُطِعَ قَالَ: فَضَحِكَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ: «إِذَا لَعِبَ الشَّيْطَانُ بِأَحَدِكُمْ فِي مَنَامِهِ فَلَا يُحَدِّثْ بِهِ النَّاس» . رَوَاهُ مُسلم"
      },
      {
        "id": 33311,
        "hadith_number": "4617",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penglihatan Rasulullah SAW di Rumah Uqbah bin Rafi' dan Tafsirnya",
        "perawi_melayu": "Anas",
        "english_text": "And from Anas, he said: The Messenger of Allah, peace and blessings be upon him, said: \"One night, in a dream as seen by the sleeper, I saw that we were in the house of Uqbah bin Rafi'.  We were given dates from the dates of Ibn Tabah.  I interpreted that our elevation would be in this world, and our consequence would be in the Hereafter, and that our religion was in a state of well-being.\"",
        "malay_translation": "Daripada Anas, dia berkata: Rasulullah SAW bersabda, “Pada suatu malam dalam mimpi seperti yang dilihat oleh orang yang tidur, aku melihat kami berada di rumah Uqbah bin Rafi’. Kami diberi kurma dari kurma Ibn Tabah. Aku menafsirkan bahawa kemuliaan kami akan datang di dunia ini, dan akibat kami akan di akhirat, dan bahawa agama kami berada dalam keadaan yang baik.”",
        "arabic_text": "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «رَأَيْتُ ذَاتَ لَيْلَةٍ فِيمَا يَرَى النَّائِمُ كَأَنَّا فِي دَارِ عُقْبَةَ بْنِ رَافِعٍ فَأُوتِينَا بِرُطَبٍ مِنْ رُطَبِ ابْنِ طَابٍ فَأَوَّلْتُ أَنَّ الرِّفْعَةَ لَنَا فِي الدُّنْيَا وَالْعَاقِبَةَ فِي الْآخِرَةِ وَأَنَّ دِينَنَا قَدْ طَابَ» . رَوَاهُ مُسلم"
      },
      {
        "id": 33312,
        "hadith_number": "4618",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mimpi Hijrah dan Perang Uhud",
        "perawi_melayu": "Abi Musa",
        "english_text": null,
        "malay_translation": "Daripada Abi Musa, daripada Nabi SAW, baginda bersabda: \"Aku melihat dalam mimpi bahawa aku berhijrah dari Makkah ke suatu negeri yang banyak pokok kurma.  Kemudian aku berfikir bahawa ia adalah Yamani atau Hijr.  Lalu ternyata ia adalah Madinah, iaitu Yathrib.  Dan dalam mimpiku ini, aku melihat aku mengayunkan pedang, lalu putuslah bahagian dadanya. Maka ternyata ia merupakan apa yang menimpa kaum Muslimin pada hari Perang Uhud. Kemudian aku mengayunkannya sekali lagi, lalu ia kembali seperti keadaan asalnya, lebih baik daripada keadaan asalnya. Maka ternyata ia adalah apa yang Allah berikan dalam kemenangan dan perhimpunan kaum Muslimin.\" ",
        "arabic_text": "وَعَنْ أَبِي مُوسَى عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: رَأَيْتُ فِي الْمَنَامِ أَنِّي أُهَاجِرُ مِنْ مَكَّةَ إِلَى أَرْضٍ بِهَا نَخْلٌ فَذَهَبَ وَهْلِي إِلَى أَنَّهَا الْيَمَامَةُ أَوْ هَجَرُ فَإِذَا هِيَ الْمَدِينَةُ يَثْرِبُ وَرَأَيْتُ فِي رُؤْيَايَ هَذِهِ: أَنِّي هَزَزْتُ سَيْفًا فَانْقَطَعَ صَدْرُهُ فَإِذَا هُوَ مَا أُصِيبَ مِنَ الْمُؤْمِنِينَ يَوْمَ أُحُدٍ ثُمَّ هَزَزْتُهُ أُخْرَى فعادَ أحسنَ مَا كانَ فإِذا هوَ جَاءَ اللَّهُ بِهِ مِنَ الْفَتْحِ وَاجْتِمَاعِ الْمُؤْمِنِينَ"
      },
      {
        "id": 33313,
        "hadith_number": "4619",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mimpi Rasulullah SAW Mengenai Dua Penipu Dari Yaman Dan San'a",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah RA, katanya: Rasulullah SAW bersabda, \"Ketika aku sedang tidur di dalam khazanah bumi, dua gelang emas diletakkan di kedua telapak tanganku. Namun, kedua gelang itu terasa berat. Maka, aku diwahyukan untuk meniupnya, lalu aku meniupnya. Maka, gelang itu hilang. Dan aku mentafsirkan kedua orang tersebut sebagai pendusta yang aku berada di antara mereka, iaitu pemimpin San'a dan pemimpin Yamamah.\"  Disepakati. Dalam satu riwayat: \"Salah seorang dari mereka dikenali sebagai Musailamah, pemimpin Yamamah, dan yang satunya ialah Al-'Ansi, pemimpin San'a.\" Aku tidak menemui riwayat ini dalam (Sahih al-Bukhari dan Sahih Muslim).  Dan ia disebut oleh penulis al-jami' daripada Imam Tirmizi.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «بَيْنَا أَنَا نَائِمٌ بِخَزَائِنِ الْأَرْضِ فَوُضِعَ فِي كَفَّيَّ سِوَارَانِ مِنْ ذَهَبٍ فَكَبُرَا عَلَيَّ فَأُوحِيَ إِلَيَّ أَنِ انْفُخْهُمَا فَنَفَخْتُهُمَا فَذَهَبَا فَأَوَّلْتُهُمَا الْكَذَّابَيْنِ اللَّذَيْنِ أَنَا بَيْنَهُمَا صَاحِبَ صَنْعَاءَ وَصَاحِبَ الْيَمَامَةِ» . مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ: «يُقَالُ لِأَحَدِهِمَا مُسَيْلِمَةُ صَاحِبُ الْيَمَامَةِ وَالْعَنْسِيُّ صَاحِبُ صَنْعَاءَ» لَمْ أَجِدْ هَذِهِ الرِّوَايَةَ فِي (الصَّحِيحَيْنِ) وَذكرهَا صَاحب الْجَامِع عَن التِّرْمِذِيّ"
      },
      {
        "id": 33314,
        "hadith_number": "4620",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Amalan Baginda Rasulullah SAW Dilaksanakan di Akhirat",
        "perawi_melayu": "Ummu Al-Ala Al-Ansariyyah",
        "english_text": "And from Ummu Al-Ala Al-Ansariyyah, she said: I saw a stream flowing for Uthman bin Maz'oon in a dream. I narrated it to Rasulullah SAW, and he said: \"That is his (Uthman's) amal (action) being made to flow for him.\"",
        "malay_translation": "Dan daripada Ummu Al-Ala Al-Ansariyyah, beliau berkata: Aku melihat sebuah aliran air yang mengalir untuk Uthman bin Maz'oon dalam mimpi. Aku menceritakannya kepada Rasulullah SAW, dan baginda bersabda: \"Itulah amalannya yang mengalir untuknya.\"",
        "arabic_text": "وَعَنْ أُمِّ الْعَلَاءِ الْأَنْصَارِيَّةِ قَالَتْ: رَأَيْتُ لِعُثْمَانَ بْنِ مَظْعُونٍ فِي النَّوْمِ عَيْنًا تَجْرِي فَقَصَصْتُهَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «ذَلِكِ عَمَلُهُ يُجْرَى لَهُ» . رَوَاهُ الْبُخَارِيُّ"
      },
      {
        "id": 33315,
        "hadith_number": "4621",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tafsir Mimpi Nabi SAW Mengenai Keadilan dan Balasan Akhirat",
        "perawi_melayu": "Sumrah bin Jundab",
        "english_text": "Narrated Sumrah ibn Jundub. The Prophet (ﷺ) would, after performing prayers, turn to us and say, 'Apakah ada di antara kamu yang melihat mimpi malam ini?'.  If someone had seen a dream, he would describe it and say, 'Apa yang dikehendaki Allah'. One day, he asked us, 'Apakah ada di antara kamu yang melihat mimpi malam ini?'. We replied, 'Tidak'. He said, 'Tetapi aku melihat dua orang lelaki datang kepadaku malam tadi, dan mereka memegang tanganku, membawa aku ke sebuah tanah suci. Di sana ada seorang lelaki duduk dan seorang lelaki berdiri, memegang sebatang besi yang tajam, dan memasukkannya ke dalam pipi lelaki yang duduk itu, dan memisahkannya hingga sampai ke tengkuknya. Kemudian, ia lakukan perkara yang sama pada pipi yang lain. Pipinya bertaut semula dan ia dilakukaan lagi. Aku bertanya, 'Apa makna ini?'. Mereka menjawab, 'Pergi.' Kami pun pergi hingga sampai ke seorang lelaki yang terlentang di belakangnya, dan seorang lelaki berdiri di atas kepalanya dengan sebatang besi atau batu, menghantam kepalanya. Setiap kali dihantam, batu itu bergetar. Dia pun menghampirinya untuk menangkapnya, tetapi dia tidak kembali ke tempat itu sehingga kepalanya bertaut semula, dan kepalanya seperti sedia kala. Dia pergi kepadanya dan memukulnya. Aku bertanya, 'Apa makna ini?'. Mereka berkata, 'Pergi.' Kami pun pergi hingga ke sebuah lubang yang menyerupai dapur, bahagian atasnya sempit dan bahagian bawahnya luas. Api dinyalakan di bawahnya. Apabila api itu membara, mereka berdiri dan hampir keluar daripadanya. Bila api padam, mereka kembali kepadanya. Di sana ada lelaki dan wanita telanjang. Aku bertanya, 'Apa makna ini?'. Mereka berkata, 'Pergi.' Kami pun pergi hingga ke sebuah sungai darah. Di tengah-tengah sungai itu berdiri seorang lelaki, dan di tepi sungai seorang lelaki memegang batu-batu. Lelaki di sungai itu berusaha keluar, tetapi lelaki di tepi sungai itu akan melemparkan batu ke dalam mulutnya dan melemparkannya kembali ke tempatnya. Setiap kali dia keluar, dia dilemparkan semula. Aku bertanya, 'Apa makna ini?'. Mereka berkata, 'Pergi.' Kami pun pergi hingga ke sebuah taman hijau yang indah. Di akar pokok besar itu ada seorang tua dan anak-anak. Ada seorang lelaki di dekat pokok itu, dengan api di depannya yang dinyalakannya. Mereka menaikku ke atas pokok itu dan membawa aku ke sebuah rumah di tengah pokok itu. Aku tidak pernah melihat yang lebih indah daripada itu. Di dalam rumah itu ada orang tua, pemuda, dan wanita serta anak-anak. Kemudian mereka menurunkan aku daripadanya dan membawaku ke rumah yang lebih baik dan lebih mulia daripada sebelumnya. Di sana ada orang tua, pemuda dan wanita dan anak-anak. Lalu aku berkata kepada mereka, 'Kamu telah membawa aku mengelilingi malam ini. Beri aku penjelasan tentang apa yang aku lihat?'. Mereka berkata, 'Ya. Lelaki yang kamu lihat pipinya dibelah adalah seorang pendusta, dan fitnahnya akan tersebar luas hingga ke seluruh pelosok dunia. Dia akan dikenakan hukuman sehingga hari kiamat. Lelaki yang kepalanya dihantam adalah seorang lelaki yang telah mempelajari al-Quran daripada Allah tetapi tidak mengamalkannya pada siang hari. Dia akan dikenakan hukuman sehingga hari kiamat. Lelaki yang kamu lihat di dalam lubang adalah orang yang berzina, dan lelaki yang kamu lihat di sungai adalah orang yang makan riba. Orang tua yang kamu lihat di bawah pohon adalah Nabi Ibrahim dan anak-anak yang ada di sekitarnya adalah anak manusia. Lelaki yang menyulut api adalah Malik, penjaga neraka. Rumah pertama yang engkau masuk adalah rumah orang-orang beriman, dan rumah ini adalah rumah syuhada. Aku adalah Jibril dan ini Mikail. Angkatlah kepalamu.' Aku mengangkat kepalaku dan melihat sesuatu yang seperti awan di atasku, atau dalam riwayat lain, seperti serpihan putih. Mereka berkata, 'Itulah tempatmu'. Aku berkata, 'Biarkan aku masuk ke rumahku'. Mereka berkata, 'Engkau masih punya waktu yang belum engkau lalui. Jika engkau dapat menyempurnakannya, engkau akan sampai ke rumahmu.",
        "malay_translation": "Dikisahkan oleh Sumrah ibn Jundub. Rasulullah SAW akan berpaling kepada kami selepas solat dan bertanya, 'Adakah sesiapa di antara kamu yang bermimpi malam ini?' Jika ada yang melihat mimpi, dia akan menceritakannya dan berkata, 'Apa yang dikehendaki Allah'. Suatu hari, baginda bertanya kepada kami, 'Adakah sesiapa di antara kamu yang bermimpi malam ini?' Kami menjawab, 'Tidak'. Baginda bersabda, 'Tetapi aku melihat dua orang lelaki datang kepadaku malam tadi, dan mereka memegang tanganku, membawa aku ke sebuah tanah suci. Di sana ada seorang lelaki duduk dan seorang lelaki berdiri, memegang sebatang besi yang tajam, dan memasukkannya ke dalam pipi lelaki yang duduk itu, dan memisahkannya hingga sampai ke tengkuknya. Kemudian, ia lakukan perkara yang sama pada pipi yang lain. Pipinya bertaut semula dan ia dilakukaan lagi. Aku bertanya, 'Apakah maksudnya ini?'. Mereka menjawab, 'Pergi.' Kami pun pergi hingga sampai ke seorang lelaki yang terlentang di belakangnya, dan seorang lelaki berdiri di atas kepalanya dengan sebatang besi atau batu, menghantam kepalanya. Setiap kali dihantam, batu itu bergetar. Dia pun menghampirinya untuk menangkapnya, tetapi dia tidak kembali ke tempat itu sehingga kepalanya bertaut semula, dan kepalanya seperti sedia kala. Dia pergi kepadanya dan memukulnya. Aku bertanya, 'Apakah maksudnya ini?'. Mereka berkata, 'Pergi.' Kami pun pergi hingga ke sebuah lubang yang menyerupai dapur, bahagian atasnya sempit dan bahagian bawahnya luas. Api dinyalakan di bawahnya. Apabila api itu membara, mereka berdiri dan hampir keluar daripadanya. Bila api padam, mereka kembali kepadanya. Di sana ada lelaki dan wanita telanjang. Aku bertanya, 'Apakah maksudnya ini?'. Mereka berkata, 'Pergi.' Kami pun pergi hingga ke sebuah sungai darah. Di tengah-tengah sungai itu berdiri seorang lelaki, dan di tepi sungai seorang lelaki memegang batu-batu. Lelaki di sungai itu berusaha keluar, tetapi lelaki di tepi sungai itu akan melemparkan batu ke dalam mulutnya dan melemparkannya kembali ke tempatnya. Setiap kali dia keluar, dia dilemparkan semula. Aku bertanya, 'Apakah maksudnya ini?'. Mereka berkata, 'Pergi.' Kami pun pergi hingga ke sebuah taman hijau yang indah. Di akar pokok besar itu ada seorang tua dan anak-anak. Ada seorang lelaki di dekat pokok itu, dengan api di depannya yang dinyalakannya. Mereka menaikku ke atas pokok itu dan membawa aku ke sebuah rumah di tengah pokok itu. Aku tidak pernah melihat yang lebih indah daripada itu. Di dalam rumah itu ada orang tua, pemuda, dan wanita serta anak-anak. Kemudian mereka menurunkan aku daripadanya dan membawaku ke rumah yang lebih baik dan lebih mulia daripada sebelumnya. Di sana ada orang tua, pemuda dan wanita dan anak-anak. Lalu aku berkata kepada mereka, 'Kamu telah membawa aku mengelilingi malam ini. Beri aku penjelasan tentang apa yang aku lihat?'. Mereka berkata, 'Ya. Lelaki yang kamu lihat pipinya dibelah adalah seorang pendusta, dan fitnahnya akan tersebar luas hingga ke seluruh pelosok dunia. Dia akan dikenakan hukuman sehingga hari kiamat. Lelaki yang kepalanya dihantam adalah seorang lelaki yang telah mempelajari al-Quran daripada Allah tetapi tidak mengamalkannya pada siang hari. Dia akan dikenakan hukuman sehingga hari kiamat. Lelaki yang kamu lihat di dalam lubang adalah orang yang berzina, dan lelaki yang kamu lihat di sungai adalah orang yang makan riba. Orang tua yang kamu lihat di bawah pohon adalah Nabi Ibrahim dan anak-anak yang ada di sekitarnya adalah anak manusia. Lelaki yang menyulut api adalah Malik, penjaga neraka. Rumah pertama yang engkau masuk adalah rumah orang-orang beriman, dan rumah ini adalah rumah syuhada. Aku adalah Jibril dan ini Mikail. Angkatlah kepalamu.' Aku mengangkat kepalaku dan melihat sesuatu yang seperti awan di atasku, atau dalam riwayat lain, seperti serpihan putih. Mereka berkata, 'Itulah tempatmu'. Aku berkata, 'Biarkan aku masuk ke rumahku'. Mereka berkata, 'Engkau masih punya waktu yang belum engkau lalui. Jika engkau dapat menyempurnakannya, engkau akan sampai ke rumahmu.",
        "arabic_text": "وَعَن سُمرةَ بنِ جُندب قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى أَقْبَلَ عَلَيْنَا بِوَجْهِهِ فَقَالَ: «مَنْ رَأَى مِنْكُمُ اللَّيْلَةَ رُؤْيَا؟» قَالَ: فَإِنْ رَأَى أَحَدٌ قَصَّهَا فَيَقُولُ: مَا شَاءَ اللَّهُ فَسَأَلَنَا يَوْمًا فَقَالَ: «هَلْ رَأَى مِنْكُمْ أَحَدٌ رُؤْيَا؟» قُلْنَا: لَا قَالَ: لَكِنِّي رَأَيْتُ اللَّيْلَةَ رَجُلَيْنِ أَتَيَانِي فَأَخَذَا بِيَدَيَّ فَأَخْرَجَانِي إِلَى أَرْضٍ مُقَدَّسَةٍ فَإِذَا رَجُلٌ جَالِسٌ وَرَجُلٌ قَائِمٌ بِيَدِهِ كَلُّوبٌ مِنْ حَدِيدٍ يُدْخِلُهُ فِي شِدْقِهِ فَيَشُقُّهُ حَتَّى يَبْلُغَ قَفَاهُ ثُمَّ يَفْعَلُ بِشِدْقِهِ الْآخَرِ مِثْلَ ذَلِكَ وَيَلْتَئِمُ شِدْقُهُ هَذَا فَيَعُودُ فَيَصْنَعُ مِثْلَهُ. قُلْتُ: مَا هَذَا؟ قَالَا: انْطَلِقْ فَانْطَلَقْنَا حَتَّى أَتَيْنَا عَلَى رَجُلٍ مُضْطَجِعٍ عَلَى قَفَاهُ وَرَجُلٌ قَائِمٌ عَلَى رَأْسِهِ بِفِهْرٍ أَوْ صَخْرَةٍ يَشْدَخُ بِهَا رَأْسَهُ فَإِذَا ضَرَبَهُ تَدَهْدَهَ الْحَجَرُ فَانْطَلَقَ إِلَيْهِ لِيَأْخُذَهُ فَلَا يَرْجِعُ إِلَى هَذَا حَتَّى يَلْتَئِمَ رَأْسُهُ وَعَادَ رَأْسُهُ كَمَا كَانَ فَعَادَ إِلَيْهِ فَضَرَبَهُ فَقُلْتُ: مَا هَذَا؟ قَالَا: انْطَلِقْ فَانْطَلَقْنَا حَتَّى أَتَيْنَا إِلَى ثَقْبٍ مِثْلِ التَّنُّورِ أَعْلَاهُ ضَيِّقٌ وَأَسْفَلَهُ وَاسِعٌ تَتَوَقَّدُ تَحْتَهُ نَارٌ فَإِذَا ارْتَفَعَتِ ارْتَفَعُوا حَتَّى كَادَ أَنْ يَخْرُجُوا مِنْهَا وَإِذَا خَمَدَتْ رَجَعُوا فِيهَا وَفِيهَا رِجَالٌ وَنِسَاءٌ عُرَاةٌ فَقُلْتُ: مَا هَذَا؟ قَالَا: انْطَلِقْ فَانْطَلَقْنَا حَتَّى أَتَيْنَا عَلَى نَهَرٍ مِنْ دَمٍ فِيهِ رَجُلٌ قَائِمٌ عَلَى وَسْطِ النَّهَرِ وَعَلَى شَطِّ النَّهَرِ رَجُلٌ بَيْنَ يَدَيْهِ حِجَارَةٌ فَأَقْبَلَ الرَّجُلُ الَّذِي فِي النَّهَرِ فَإِذَا أَرَادَ أَنْ يَخْرُجَ رَمَى الرَّجُلُ بِحَجَرٍ فِي فِيهِ فَرَدَّهُ حَيْثُ كَانَ فَجَعَلَ كُلَّمَا جَاءَ لِيَخْرُجَ رَمَى فِي فِيهِ بِحَجَرٍ فَيَرْجِعُ كَمَا كَانَ فَقُلْتُ مَا هَذَا؟ قَالَا: انْطَلِقْ فَانْطَلَقْنَا حَتَّى انْتَهَيْنَا إِلَى رَوْضَةٍ خَضْرَاءَ فِيهَا شَجَرَةٌ عَظِيمَةٌ وَفِي أَصْلِهَا شَيْخٌ وَصِبْيَانٌ وَإِذَا رَجُلٌ قَرِيبٌ مِنَ الشجرةِ بَيْنَ يَدَيْهِ نَارٌ يُوقِدُهَا فَصَعِدَا بِيَ الشَّجَرَةَ فأدخلاني دَار أوسطَ الشَّجَرَةِ لَمْ أَرَ قَطُّ أَحْسَنَ مِنْهَا فِيهَا رِجَالٌ شُيُوخٌ وَشَبَابٌ وَنِسَاءٌ وَصِبْيَانٌ ثُمَّ أَخْرَجَانِي مِنْهَا فصعدا بِي الشَّجَرَة فأدخلاني دَار هِيَ أَحْسَنُ وَأَفْضَلُ مِنْهَا فِيهَا شُيُوخٌ وَشَبَابٌ فَقُلْتُ لَهُمَا: إِنَّكُمَا قَدْ طَوَّفْتُمَانِي اللَّيْلَةَ فَأَخْبِرَانِي عَمَّا رَأَيْتُ قَالَا: نَعَمْ أَمَّا الرَّجُلُ الَّذِي رَأَيْتَهُ يُشَقُّ شِدْقُهُ فَكَذَّابٌ يُحَدِّثُ بِالْكَذْبَةِ فَتُحْمَلُ عَنْهُ حَتَّى تَبْلُغَ الْآفَاقَ فَيُصْنَعُ بِهِ مَا تَرَى إِلَى يَوْمِ الْقِيَامَةِ وَالَّذِي رَأَيْتَهُ يُشْدَخُ رَأْسُهُ فَرَجُلٌ عَلَّمَهُ اللَّهُ الْقُرْآنَ فَنَامَ عَنْهُ بِاللَّيْلِ وَلَمْ يَعْمَلْ بِمَا فِيهِ بِالنَّهَارِ يُفْعَلُ بِهِ مَا رَأَيْتَ إِلَى يَوْمِ الْقِيَامَةِ وَالَّذِي رَأَيْتَهُ فِي الثَّقْبِ فَهُمُ الزُّنَاةُ وَالَّذِي رَأَيْتَهُ فِي النَّهَرِ آكِلُ الرِّبَا وَالشَّيْخُ الَّذِي رَأَيْتَهُ فِي أَصْلِ الشَّجَرَةِ إِبْرَاهِيمُ وَالصِّبْيَانُ حَوْلَهُ فَأَوْلَادُ النَّاسِ وَالَّذِي يُوقِدُ النَّارَ مَالِكٌ خَازِنُ النَّارِ وَالدَّارُ الْأُولَى الَّتِي دَخَلْتَ دَارُ عَامَّةِ الْمُؤْمِنِينَ وَأَمَّا هَذِهِ الدَّارُ فَدَارُ الشُّهَدَاءِ وَأَنَا جِبْرِيلُ وَهَذَا مِيكَائِيلُ فَارْفَعْ رَأْسَكَ فَرَفَعْتُ رَأْسِي فَإِذَا فَوْقِي مِثْلُ السَّحَابِ وَفِي رِوَايَةٍ مِثْلُ الرَّبَابَةِ الْبَيْضَاءِ قَالَا: ذَلِكَ مَنْزِلُكَ قُلْتُ: دَعَانِي أَدْخُلْ مَنْزِلِي قَالَا: إِنَّهُ بَقِيَ لَكَ عُمُرٌ لَمْ تَسْتَكْمِلْهُ فَلَوِ اسْتَكْمَلْتَهُ أَتَيْتَ مَنْزِلَكَ «. رَوَاهُ الْبُخَارِيُّ. وَذَكَرَ حَدِيثَ عَبْدِ اللَّهِ بْنِ عُمَرَ فِي رُؤْيَا النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَدِينَةِ فِي» بَاب حرم الْمَدِينَة"
      },
      {
        "id": 33316,
        "hadith_number": "4622",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mimpi Orang Mukmin: Sebahagian Daripada Kenabian dan Adab Berkongsi Mimpi",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Razin al-'Uqaili, beliau berkata: Rasulullah SAW bersabda: \"Mimpi seorang mukmin adalah satu bahagian daripada empat puluh enam bahagian kenabian, dan ia berada di atas kaki burung selagi mana dia tidak menceritakannya. Apabila dia menceritakannya, ia akan terjadi.\" Dan saya rasa baginda bersabda: \"Jangan menceritakannya kecuali kepada orang yang dikasihi atau orang yang berakal.\" Diriwayatkan oleh Tirmizi. Dalam riwayat Abu Daud, baginda bersabda: \"Mimpi berada di atas kaki burung selagi mana ia tidak ditafsirkan. Apabila ia ditafsirkan, ia akan terjadi.\" Dan saya rasa baginda bersabda: \"Jangan kamu ceritakan mimpi itu kecuali kepada orang yang penyayang atau orang yang mempunyai pendapat (yang baik).\"",
        "arabic_text": "عَن أبي رزين العقيليِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ وَهِيَ عَلَى رِجْلِ طَائِرٍ مَا لَمْ يُحَدِّثْ بِهَا فَإِذَا حَدَّثَ بِهَا وَقَعَتْ» . وَأَحْسِبُهُ قَالَ: «لَا تُحَدِّثْ إِلَّا حَبِيبًا أَوْ لَبِيبًا» . رَوَاهُ التِّرْمِذِيُّ وَفِي رِوَايَةِ أَبِي دَاوُدَ قَالَ: «الرُّؤْيَا عَلَى رِجْلِ طَائِرٍ مَا لَمْ تُعْبَرْ فَإِذَا عُبِرَتْ وَقَعَتْ» . وَأَحْسِبُهُ قَالَ: «وَلَا تَقُصَّهَا إِلَّا عَلَى وَادٍّ أَوْ ذِي رأيٍ»"
      },
      {
        "id": 33317,
        "hadith_number": "4623",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keadaan Waroqah dalam Mimpi Rasulullah SAW",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Aisyah RA, beliau berkata: Rasulullah SAW ditanya tentang Waroqah. Lalu Khadijah berkata kepada baginda: Sesungguhnya dia telah membenarkanmu tetapi dia meninggal dunia sebelum engkau menzahirkan (kenabian). Rasulullah SAW bersabda: 'Aku melihatnya dalam mimpi dan dia memakai pakaian putih. Sekiranya dia termasuk ahli neraka, nescaya dia akan memakai pakaian selain itu.' (Riwayat Ahmad dan Tirmizi)",
        "arabic_text": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَن وَرَقَةَ. فَقَالَتْ لَهُ خَدِيجَةُ: إِنَّهُ كَانَ قَدْ صَدَّقَكَ وَلَكِنْ مَاتَ قَبْلَ أَنْ تَظْهَرَ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أُرِيتُهُ فِي الْمَنَامِ وَعَلَيْهِ ثِيَابٌ بِيضٌ وَلَوْ كَانَ مِنْ أَهْلِ النَّارِ لَكَانَ عَلَيْهِ لِبَاسٌ غَيْرُ ذَلِك» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ"
      },
      {
        "id": 33318,
        "hadith_number": "4624",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mimpi Sujud di Dahi Nabi Muhammad SAW",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Khuzaimah bin Thabit, daripada bapa saudaranya, Abu Khuzaimah RA, bahawa dia bermimpi seolah-olah dia sujud di dahi Nabi SAW. Lalu dia memberitahu Nabi SAW tentang mimpinya, maka Nabi SAW berbaring untuknya dan bersabda, \"Benarkanlah mimpimu.\" Maka dia pun sujud di dahi Nabi SAW. Diriwayatkan dalam Syarah as-Sunnah. Akan kami sebutkan hadis Abu Bakrah: Seolah-olah neraca diturunkan dari langit di bab 'Manakib Abu Bakar dan Umar RA'.",
        "arabic_text": "وَعَنِ ابْنِ خُزَيْمَةَ بْنِ ثَابِتٍ عَنْ عَمِّهِ أَبِي خُزَيْمَةَ رَضِيَ اللَّهُ عَنْهُمْ أَنَّهُ رَأَى فِيمَا يَرَى النَّائِمُ أَنَّهُ سَجَدَ عَلَى جَبْهَةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ فَاضْطَجَعَ لَهُ وَقَالَ: «صَدِّقْ رُؤْيَاكَ» فَسَجَدَ عَلَى جَبْهَتِهِ. رَوَاهُ فِي شَرْحِ السُّنَّةِ وَسَنَذْكُرُ حَدِيثَ أَبِي بَكْرَةَ: كَأَنَّ مِيزَانًا نَزَلَ مِنَ السَّمَاءِ فِي بَابِ «مَنَاقِبِ أَبِي بَكْرٍ وَعُمَرَ رَضِيَ اللَّهُ عَنْهُمَا»"
      },
      {
        "id": 33319,
        "hadith_number": "4625",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mimpi Rasulullah SAW dan Penjelasan Mengenai Beberapa Perkara Ghaib",
        "perawi_melayu": "Not Available",
        "english_text": "Not Available",
        "malay_translation": "Daripada Samurah bin Jundub RA, beliau berkata: Rasulullah SAW sering bertanya kepada para sahabatnya: \"Adakah sesiapa di antara kamu yang melihat mimpi?\" Lalu diceritakan kepada baginda oleh sesiapa yang Allah kehendaki untuk bercerita. Dan sesungguhnya pada suatu pagi, baginda bersabda kepada kami: \"Sesungguhnya telah datang kepadaku dua orang lelaki pada malam tadi, dan mereka berdua membangkitkanku, dan mereka berdua berkata kepadaku: 'Pergilah'. Maka aku pun pergi bersama mereka berdua.\" Kemudian baginda menyebutkan hadis yang serupa dengan hadis yang telah disebutkan pada fasal pertama dengan panjang lebar, dan di dalamnya terdapat tambahan yang tidak ada dalam hadis tersebut, iaitu sabdanya: \"Maka kami sampai di sebuah taman yang gelap, di dalamnya terdapat segala macam bunga musim semi, dan tiba-tiba di tengah-tengah taman itu ada seorang lelaki yang tinggi, hampir tidak dapat aku melihat kepalanya kerana terlalu tinggi di langit, dan di sekeliling lelaki itu terdapat anak-anak kecil yang paling banyak yang pernah aku lihat.\" Aku bertanya kepada mereka berdua: \"Siapakah ini? Siapakah mereka ini?\" Mereka berdua berkata kepadaku: \"Pergilah.\" Maka kami pun pergi sehingga sampai di sebuah taman yang besar, aku belum pernah melihat taman yang lebih besar dan lebih indah daripadanya. Baginda bersabda: \"Mereka berdua berkata kepadaku: 'Naiklah ke dalamnya'.\" Baginda bersabda: \"Maka kami pun naik ke dalamnya sehingga sampai di sebuah kota yang dibangun dengan batu bata emas dan batu bata perak, lalu kami mendatangi pintu kota tersebut dan meminta untuk dibukakan, maka dibukakanlah untuk kami, lalu kami memasukinya, maka di dalamnya kami disambut oleh orang-orang yang separuh daripada kejadian mereka adalah seindah yang dapat engkau lihat, dan separuh daripada mereka adalah seburuk yang dapat engkau lihat.\" Baginda bersabda: \"Mereka berdua berkata kepada mereka: 'Pergilah dan terjunlah ke dalam sungai itu'.\" Baginda bersabda: \"Tiba-tiba ada sebuah sungai yang mengalir deras, seolah-olah airnya adalah susu yang murni dalam keadaan putih, lalu mereka pergi dan terjun ke dalamnya, kemudian mereka kembali kepada kami dalam keadaan keburukan itu telah hilang dari mereka, maka mereka menjadi dalam keadaan yang paling baik.\" Dan baginda menyebutkan dalam tafsir tambahan ini: \"Adapun lelaki yang tinggi yang berada di taman itu, maka sesungguhnya dia adalah Ibrahim AS, dan adapun anak-anak kecil yang berada di sekelilingnya, maka mereka adalah setiap anak yang meninggal dunia di atas fitrah.\" Baginda bersabda: \"Maka sebahagian orang Muslim berkata: Wahai Rasulullah, bagaimana dengan anak-anak orang musyrik?\" Maka Rasulullah SAW bersabda: \"Dan juga anak-anak orang musyrik. Adapun kaum yang separuh daripada mereka baik dan separuh daripada mereka buruk, maka sesungguhnya mereka adalah kaum yang telah mencampurkan amalan soleh dan amalan buruk, maka Allah telah memaafkan mereka.\" Riwayat al-Bukhari.",
        "arabic_text": "عَن سَمُرَةَ بْنِ جُنْدَبٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِمَّا يَكْثُرُ أَنْ يَقُولَ لِأَصْحَابِهِ: «هَلْ رَأَى أَحَدٌ مِنْكُمْ مِنْ رُؤْيَا؟» فَيَقُصُّ عَلَيْهِ مَنْ شَاءَ اللَّهُ أَنْ يَقُصَّ وَإِنَّهُ قَالَ لَنَا ذَاتَ غَدَاةٍ: إِنَّهُ أَتَانِي اللَّيْلَةَ آتِيَانِ وَإِنَّهُمَا ابْتَعَثَانِي وَإِنَّهُمَا قَالَا لِي: انْطَلِقْ وَإِنِّي انْطَلَقْتُ مَعَهُمَا . وَذَكَرَ مِثْلَ الْحَدِيثِ الْمَذْكُورِ فِي الْفَصْلِ الْأَوَّلِ بِطُولِهِ وَفِيهِ زِيَادَةٌ لَيْسَتْ فِي الْحَدِيثِ الْمَذْكُورِ وَهِيَ قَوْلُهُ: فَأَتَيْنَا عَلَى رَوْضَةٍ مُعْتِمَةٍ فِيهَا مِنْ كُلِّ نَوْرِ الرَّبِيعِ وَإِذَا بَيْنَ ظَهْرَيِ الرَّوْضَةِ رَجُلٌ طَوِيلٌ لَا أَكَادُ أَرَى رَأْسَهُ طُولًا فِي السَّمَاءِ وَإِذَا حَوْلَ الرَّجُلِ مِنْ أَكْثَرِ وِلْدَانٍ رَأَيْتُهُمْ قَطُّ قُلْتُ لَهُمَا: مَا هَذَا مَا هَؤُلَاءِ؟ قَالَ: قَالَا لِيَ: انْطَلِقْ فَانْطَلَقْنَا فَانْتَهَيْنَا إِلَى رَوْضَةٍ عَظِيمَةٍ لَمْ أَرَ رَوْضَةً قَطُّ أَعْظَمَ مِنْهَا وَلَا أَحْسَنَ . قَالَ: قَالَا لِيَ: ارْقَ فِيهَا . قَالَ: «فَارْتَقَيْنَا فِيهَا فَانْتَهَيْنَا إِلَى مَدِينَةٍ مَبْنِيَّةٍ بِلَبِنِ ذَهَبٍ وَلَبِنِ فِضَّةٍ فَأَتَيْنَا بَابَ الْمَدِينَةِ فَاسْتَفْتَحْنَا فَفُتِحَ لَنَا فَدَخَلْنَاهَا فَتَلَقَّانَا فِيهَا رِجَالٌ شَطْرٌ مِنْ خَلْقِهِمْ كَأَحْسَنِ مَا أَنْتَ رَاءٍ وَشَطْرٌ مِنْهُمْ كَأَقْبَحِ مَا أَنْتَ رَاءٍ» . قَالَ: قَالَا لَهُمُ: اذْهَبُوا فَقَعُوا فِي ذَلِكَ النَّهَرِ قَالَ: «وَإِذَا نَهَرٌ مُعْتَرِضٌ يَجْرِي كَأَنَّ مَاءَهُ الْمَحْضُ فِي الْبَيَاضِ فَذَهَبُوا فَوَقَعُوا فِيهِ ثُمَّ رَجَعُوا إِلَيْنَا قَدْ ذَهَبَ ذَلِكَ السُّوءُ عَنْهُمْ فَصَارُوا فِي أَحْسَنِ صُورَةٍ» وَذَكَرَ فِي تَفْسِير هَذِه الزِّيَادَة: «وَأما الرجلُ الطويلُ الَّذِي فِي الرَّوْضَةِ فَإِنَّهُ إِبْرَاهِيمُ وَأَمَّا الْوِلْدَانُ الَّذِينَ حَوْلَهُ فَكُلُّ مَوْلُودٍ مَاتَ عَلَى الْفِطْرَةِ» قَالَ: فَقَالَ بَعْضُ الْمُسْلِمِينَ: يَا رَسُولَ اللَّهِ وَأَوْلَادُ الْمُشْرِكِينَ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَأَوْلَادُ الْمُشْرِكِينَ وَأَمَّا الْقَوْمُ الَّذِينَ كَانُوا شطرٌ مِنْهُم حسن وَشطر مِنْهُمْ حَسَنٌ وَشَطْرٌ مِنْهُمْ قَبِيحٌ فَإِنَّهُمْ قَوْمٌ قَدْ خَلَطُوا عَمَلًا صَالِحًا وَآخَرَ سَيِّئًا تَجَاوَزَ الله عَنْهُم» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 33320,
        "hadith_number": "4626",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keelokan Perbuatan dan Amalan Baik",
        "perawi_melayu": "Ibnu Umar",
        "english_text": "Daripada Ibnu Umar bahawa Rasulullah SAW bersabda: \"Daripada segala kebaikan, sebaik-baiknya adalah seseorang itu melihat dengan matanya apa yang belum pernah dilihatnya.\"",
        "malay_translation": "Daripada Ibnu Umar bahawa Rasulullah SAW bersabda: \"Antara sebaik-baik amalan ialah seseorang melihat dengan kedua matanya perkara yang belum pernah dilihatnya.\"  Riwayat Bukhari.",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مِنْ أَفْرَى الْفِرَى أَنْ يُرِيَ الرَّجُلُ عَيْنَيْهِ مَا لم تريا» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 33321,
        "hadith_number": "4627",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kepercayaan yang Benar dalam Mimpi di Waktu Subuh",
        "perawi_melayu": "Abu Said al-Khudri",
        "english_text": "Daripada Abu Sa'id al-Khudri, daripada Nabi SAW, baginda bersabda: \"Mimpi yang paling benar ialah mimpi di waktu Subuh.\"",
        "malay_translation": "Daripada Abu Sa'id al-Khudri, daripada Nabi SAW, baginda bersabda: \"Mimpi yang paling benar ialah mimpi di waktu subuh.\"  (Riwayat Imam Tirmidzi dan Imam Darimi, akhir jilid kedua)",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَصْدَقُ الرُّؤْيَا بِالْأَسْحَارِ» . رَوَاهُ التِّرْمِذِيّ والدارمي نِهَايَة الْجُزْء الثَّانِي"
      }
    ]
  }
}