{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 114,
    "data": [
      {
        "id": 30803,
        "hadith_number": "2109",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kebaikan Mempelajari dan Mengajar Al-Quran",
        "perawi_melayu": "Uthman (r.a.)",
        "english_text": "Not Available",
        "malay_translation": "Daripada Uthman (r.a.) berkata: Rasulullah (s.a.w.) bersabda: \"Sebaik-baik kamu adalah orang yang mempelajari Al-Quran dan mengajarkannya.\" (Riwayat Al-Bukhari)",
        "arabic_text": "عَنْ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «خَيْرُكُمْ من تعلم الْقُرْآن وَعلمه» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 30804,
        "hadith_number": "2110",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Mempelajari atau Membaca Dua Ayat al-Quran",
        "perawi_melayu": "Uqbah bin Amir",
        "english_text": "Not Available",
        "malay_translation": "Daripada Uqbah bin Amir berkata: Rasulullah SAW keluar menemui kami yang berada di Suffah lalu bersabda: \"Siapakah di antara kamu yang suka pergi setiap hari ke Buthan atau Al-Aqiq, lalu kembali dengan dua ekor unta yang gemuk, tanpa melakukan dosa dan memutuskan silaturahim?\" Kami menjawab: \"Ya Rasulullah, kami suka demikian.\" Baginda bersabda: \"Tidakkah salah seorang di antara kamu pergi ke masjid, lalu mempelajari atau membaca dua ayat daripada Kitabullah, ia lebih baik baginya daripada dua ekor unta, tiga ayat lebih baik daripada tiga ekor unta, empat ayat lebih baik daripada empat ekor unta dan daripada bilangan unta yang lain.\"\n\n(Riwayat Muslim)",
        "arabic_text": "وَعَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ: خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ فِي الصُّفَّةِ فَقَالَ: «أَيُّكُمْ يُحِبُّ أَنْ يَغْدُوَ كُلَّ يَوْم إِلَى بطحان أَو إِلَى العقيق فَيَأْتِي مِنْهُ بِنَاقَتَيْنِ كَوْمَاوَيْنِ فِي غَيْرِ إِثْمٍ وَلَا قَطْعِ رحم» فَقُلْنَا يَا رَسُول الله نُحِبُّ ذَلِكَ قَالَ: «أَفَلَا يَغْدُو أَحَدُكُمْ إِلَى الْمَسْجِدِ فَيَعْلَمُ أَوْ يَقْرَأُ آيَتَيْنِ مِنْ كِتَابِ الله عز وَجل خير لَهُ من نَاقَة أَو نَاقَتَيْنِ وَثَلَاثٍ خَيْرٌ لَهُ مِنْ ثَلَاثٍ وَأَرْبَعٍ خَيْرٌ لَهُ مِنْ أَرْبَعٍ وَمِنْ أَعْدَادِهِنَّ مِنَ الْإِبِل» . رَوَاهُ مُسلم"
      },
      {
        "id": 30805,
        "hadith_number": "2111",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Membaca Tiga Ayat Al-Quran Berbanding Unta Gemuk",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA, katanya: Rasulullah SAW bersabda:",
        "english_text": "Narrated by Abu Hurairah RA, he said: The Messenger of Allah SAW said:",
        "malay_translation": "\"Adakah seseorang kamu suka apabila dia kembali kepada keluarganya, dia mendapati di dalamnya tiga ekor unta betina yang besar dan gemuk?\" Kami berkata: \"Ya.\" Baginda bersabda: \"Maka tiga ayat yang dibaca oleh seseorang kamu dalam solatnya adalah lebih baik baginya daripada tiga ekor unta betina yang besar dan gemuk.\" Riwayat Muslim.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَيُحِبُّ أَحَدُكُمْ إِذَا رَجَعَ إِلَى أَهْلِهِ أَنْ يَجِدَ فِيهِ ثَلَاثَ خَلِفَاتٍ عِظَامٍ سِمَانٍ» . قُلْنَا: نَعَمْ. قَالَ «فَثَلَاثُ آيَاتٍ يَقْرَأُ بِهِنَّ أَحَدُكُمْ فِي صلَاته خَيْرٌ لَهُ مِنْ ثَلَاثِ خَلِفَاتٍ عِظَامٍ سِمَانٍ» . رَوَاهُ مُسلم"
      },
      {
        "id": 30806,
        "hadith_number": "2112",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keistimewaan Penghafaz dan Pembaca Al-Quran",
        "perawi_melayu": "Aisyah رضي الله عنها",
        "english_text": "Not Available",
        "malay_translation": "Daripada Aisyah رضي الله عنها, beliau berkata: Rasulullah صلى الله عليه وسلم bersabda: \"Orang yang mahir dalam Al-Quran (penghafaz) akan bersama para malaikat yang mulia dan taat. Manakala orang yang membaca Al-Quran dengan gagap dan kesukaran, baginya dua pahala.\"",
        "arabic_text": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْمَاهِرُ بِالْقُرْآنِ مَعَ السَّفَرَةِ الْكِرَامِ الْبَرَرَةِ وَالَّذِي يَقْرَأُ الْقُرْآنَ وَيَتَتَعْتَعُ فِيهِ وَهُوَ عَلَيْهِ شاق لَهُ أَجْرَانِ»"
      },
      {
        "id": 30807,
        "hadith_number": "2113",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Dua Orang yang Layak Dihasadi",
        "perawi_melayu": "Ibnu Umar",
        "english_text": "No English translation available for this Hadith.",
        "malay_translation": "Daripada Ibnu Umar, beliau berkata: Rasulullah ﷺ bersabda: \"Tidak ada hasad (iri hati) melainkan pada dua perkara: (Pertama) seorang lelaki yang dikurniakan Allah Al-Quran, lalu dia membacanya pada waktu malam dan siang; (Kedua) seorang lelaki yang dikurniakan Allah harta, lalu dia membelanjakannya pada waktu malam dan siang.",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَا حَسَدَ إِلَّا على اثْنَيْنِ: رَجُلٌ آتَاهُ اللَّهُ الْقُرْآنَ فَهُوَ يَقُومُ بِهِ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ وَرَجُلٌ آتَاهُ اللَّهُ مَالًا فَهُوَ يُنْفِقُ مِنْهُ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَار"
      },
      {
        "id": 30808,
        "hadith_number": "2114",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perumpamaan Orang Mukmin yang Membaca dan Tidak Membaca Al-Quran",
        "perawi_melayu": "Abu Musa Al-Ash'ari",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Musa Al-Ash'ari berkata: Rasulullah SAW bersabda: \"Perumpamaan orang mukmin yang membaca Al-Quran adalah seperti buah utrujjah (limau kasturi), baunya harum dan rasanya lazat. Dan perumpamaan orang mukmin yang tidak membaca Al-Quran adalah seperti buah tamar, tiada bau baginya dan rasanya manis. Dan perumpamaan orang munafik yang tidak membaca Al-Quran adalah seperti buah hanzhalah (labu pahit), tiada bau baginya dan rasanya pahit. Dan perumpamaan orang munafik yang membaca Al-Quran adalah seperti buah raihanah (sejenis tumbuhan yang harum), baunya harum tetapi rasanya pahit.\" (Muttafaqun 'alaih). Dalam riwayat lain: \"Orang mukmin yang membaca Al-Quran dan mengamalkannya adalah seperti buah utrujjah, dan orang mukmin yang tidak membaca Al-Quran tetapi mengamalkannya adalah seperti buah tamar.\"",
        "arabic_text": "وَعَنْ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مثل الْمُؤمن الَّذِي يقْرَأ الْقُرْآن كَمثل الْأُتْرُجَّةِ رِيحُهَا طِيبٌ وَطَعْمُهَا طَيِّبٌ وَمَثَلُ الْمُؤْمِنِ الَّذِي لَا يقْرَأ الْقُرْآن كَمثل التمرة لَا ريح لَهَا وطعمها حلوومثل الْمُنَافِقِ الَّذِي لَا يَقْرَأُ الْقُرْآنَ كَمَثَلِ الْحَنْظَلَةِ لَيْسَ لَهَا رِيحٌ وَطَعْمُهَا مُرٌّ وَمَثَلُ الْمُنَافِقِ الَّذِي يقْرَأ الْقُرْآن مثل الريحانة رِيحهَا طيب وَطَعْمُهَا مَرٌّ» . مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ: «الْمُؤْمِنُ الَّذِي يَقْرَأُ الْقُرْآنَ وَيَعْمَلُ بِهِ كَالْأُتْرُجَّةِ وَالْمُؤْمِنُ الَّذِي لَا يَقْرَأُ الْقُرْآنَ وَيَعْمَلُ بِهِ كَالتَّمْرَةِ»"
      },
      {
        "id": 30809,
        "hadith_number": "2115",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Al-Quran: Meninggikan dan Merendahkan Darjat",
        "perawi_melayu": "Diriwayatkan daripada Umar bin Al-Khattab RA",
        "english_text": "Narrated Umar bin Al-Khattab: The Messenger of Allah (peace and blessings of Allah be upon him) said: \"Indeed, Allah elevates some people with this Book (the Quran) and degrades others with it.\"",
        "malay_translation": "Diriwayatkan daripada Umar bin Al-Khattab RA, Rasulullah SAW bersabda: \"Sesungguhnya Allah meninggikan darjat sebahagian kaum dengan kitab ini (Al-Quran) dan merendahkan darjat kaum yang lain dengannya.\"",
        "arabic_text": "وَعَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِن الله يَرْفَعُ بِهَذَا الْكِتَابِ أَقْوَامًا وَيَضَعُ بِهِ آخَرِينَ» . رَوَاهُ مُسلم"
      },
      {
        "id": 30810,
        "hadith_number": "2116",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Malaikat Mendekat Kerana Bacaan Surah Al-Baqarah",
        "perawi_melayu": "Abu Sa'id al-Khudri",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Sa'id al-Khudri, sesungguhnya Usaid bin Hudhair berkata: Semasa dia membaca Surah al-Baqarah pada waktu malam, dan kudanya diikat berhampirannya, tiba-tiba kuda itu gelisah. Maka dia diam, dan kuda itu pun diam. Dia membaca lagi, kuda itu gelisah lagi. Dia diam, dan kuda itu pun diam. Kemudian dia membaca lagi, kuda itu gelisah, lalu dia berpaling. Dan anaknya Yahya berada berhampiran dengan kuda itu, dan dia khuatir jika kuda itu memijaknya. Apabila dia menjauhkannya, dia mengangkat kepalanya ke langit, maka kelihatan seperti ada awan yang di dalamnya terdapat lampu-lampu. Apabila pagi, dia menceritakan hal itu kepada Nabi SAW, baginda bersabda: \"Bacalah wahai Ibnu Hudhair, bacalah wahai Ibnu Hudhair.\" Dia berkata: \"Aku khuatir wahai Rasulullah jika Yahya terpijak oleh kuda itu kerana dia berhampiran dengannya. Aku mengangkat kepalaku, dan aku berpaling kepadanya, dan aku mengangkat kepalaku ke langit, maka kelihatan seperti ada awan yang di dalamnya terdapat lampu-lampu, lalu ia keluar sehingga aku tidak lagi melihatnya.\" Baginda bersabda: \"Tahukah kamu apakah itu?\" Dia berkata: \"Tidak.\" Baginda bersabda: \"Itu adalah malaikat yang mendekat kerana suaramu, dan sekiranya kamu terus membaca, nescaya manusia akan melihatnya, dan ia tidak akan tersembunyi daripada mereka.\" Muttafaqun 'Alaihi. Lafaz ini adalah dari al-Bukhari. Dalam Muslim: \"naik ke udara\" menggantikan \"keluar dengan sighah mutakallim\".",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ أُسَيْدَ بنَ حُضَيْرٍ قَالَ: بَيْنَمَا هُوَ يَقْرَأُ مِنَ اللَّيْلِ سُورَةَ الْبَقَرَةِ وَفَرَسُهُ مَرْبُوطَةٌ عِنْدَهُ إِذْ جَالَتِ الْفرس فَسكت فَسَكَتَتْ فَقَرَأَ فجالت الْفرس فَسكت فَسَكَتَتْ الْفرس ثُمَّ قَرَأَ فَجَالَتِ الْفَرَسُ فَانْصَرَفَ وَكَانَ ابْنُهُ يحيى قَرِيبا مِنْهَا فأشفق أَن تصيبه فَلَمَّا أَخَّرَهُ رَفْعَ رَأْسَهُ إِلَى السَّمَاءِ فَإِذَا مِثْلُ الظُّلَّةِ فِيهَا أَمْثَالُ الْمَصَابِيحِ فَلَمَّا أَصْبَحَ حَدَّثَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «اقْرَأْ يَا ابْنَ حُضَيْرٍ اقْرَأْ يَا ابْنَ حُضَيْرٍ» . قَالَ فَأَشْفَقْتُ يَا رَسُولَ اللَّهِ أَنْ تَطَأَ يحيى وَكَانَ مِنْهَا قَرِيبا فَرفعت رَأْسِي فَانْصَرَفْتُ إِلَيْهِ وَرَفَعْتُ رَأْسِي إِلَى السَّمَاءِ فَإِذَا مِثْلُ الظُّلَّةِ فِيهَا أَمْثَالُ الْمَصَابِيحِ فَخَرَجَتْ حَتَّى لَا أَرَاهَا قَالَ: «وَتَدْرِي مَا ذَاكَ؟» قَالَ لَا قَالَ: «تِلْكَ الْمَلَائِكَةُ دَنَتْ لِصَوْتِكَ وَلَوْ قَرَأْتَ لَأَصْبَحَتْ يَنْظُرُ النَّاسُ إِلَيْهَا لَا تَتَوَارَى مِنْهُمْ» . مُتَّفَقٌ عَلَيْهِ. وَاللَّفْظُ لِلْبُخَارِيِّ وَفِي مُسْلِمٍ: «عرجت فِي الجو» بدل: «خرجت على صِيغَة الْمُتَكَلّم»"
      },
      {
        "id": 30811,
        "hadith_number": "2117",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Membaca Surah Al-Kahfi",
        "perawi_melayu": "Al-Bara' bin 'Azib",
        "english_text": "The translated English text is not available in this dataset.",
        "malay_translation": "Daripada Al-Bara' bin 'Azib رضي الله عنه, berkata: Seorang lelaki sedang membaca Surah Al-Kahfi, dan di sebelahnya ada seekor kuda yang diikat dengan dua tali. Tiba-tiba dia diliputi awan, ia semakin dekat dan dekat. Lalu kudanya menjadi gelisah. Apabila pagi, lelaki itu menemui Nabi ﷺ dan menceritakan hal itu kepada Baginda. Lalu Baginda bersabda: \"Itulah ketenangan yang turun kerana Al-Quran.\"",
        "arabic_text": "وَعَنِ الْبَرَاءِ بْنِ عَازِبٍ قَالَ: كَانَ رَجُلٌ يَقْرَأُ سُورَةَ الْكَهْفِ وَإِلَى جَانِبِهِ حِصَانٌ مَرْبُوطٌ بِشَطَنَيْنِ فَتَغَشَّتْهُ سَحَابَةٌ فَجَعَلَتْ تَدْنُو وَتَدْنُو وَجَعَلَ فَرَسُهُ يَنْفِرُ فَلَمَّا أَصْبَحَ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ: «تِلْكَ السكينَة تنزلت بِالْقُرْآنِ»"
      },
      {
        "id": 30812,
        "hadith_number": "2118",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Surah Al-Fatihah",
        "perawi_melayu": "Abu Sa'id bin Al-Mu'alla",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Sa'id bin Al-Mu'alla berkata: \"Aku sedang solat di masjid, lalu Nabi SAW memanggilku, tetapi aku tidak menyahut sehingga aku selesai solat. Kemudian aku datang kepada Baginda. Aku berkata, 'Wahai Rasulullah, sesungguhnya aku sedang solat.' Baginda bersabda, 'Bukankah Allah telah berfirman (yang bermaksud): 'Sahutlah seruan Allah dan Rasul-Nya apabila Dia menyeru kamu'? Kemudian Baginda bersabda kepadaku: 'Mahukah aku ajarkan kepadamu surah yang paling agung dalam Al-Quran sebelum engkau keluar dari masjid?' Baginda memegang tanganku, dan ketika Baginda hendak keluar, aku berkata kepada Baginda, 'Bukankah engkau telah berkata bahawa engkau akan mengajarku surah yang paling agung dalam Al-Quran?' Baginda bersabda: '(Alhamdulillahirabbil'alamin) ialah tujuh ayat yang diulang-ulang dan Al-Quran yang agung yang telah diberikan kepadaku.\"  (Riwayat Bukhari)",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ بْنِ الْمُعَلَّى قَالَ: كُنْتُ أُصَلِّي فِي الْمَسْجِدِ فَدَعَانِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسلم فَلم أجبه حَتَّى صليت ثُمَّ أَتَيْتُهُ. فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي كنت أُصَلِّي فَقَالَ أَلَمْ يَقُلِ اللَّهُ (اسْتَجِيبُوا لِلَّهِ وَلِلرَّسُولِ إِذَا دعَاكُمْ) ثمَّ قَالَ لي: «أَلَا أُعَلِّمُكَ أَعْظَمَ سُورَةٍ فِي الْقُرْآنِ قَبْلَ أَنْ تَخْرُجَ مِنَ الْمَسْجِدِ» . فَأَخَذَ بِيَدِي فَلَمَّا أَرَادَ أَن يخرج قلت لَهُ ألم تقل لأعلمنك سُورَة هِيَ أعظم سُورَةً مِنَ الْقُرْآنِ قَالَ: (الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ) هِيَ السَّبْعُ الْمَثَانِي وَالْقُرْآنُ الْعَظِيمُ الَّذِي أُوتِيتهُ . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 30813,
        "hadith_number": "2119",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Jangan Jadikan Rumah Anda Seperti Kubur",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah رضي الله عنه berkata: Rasulullah صلى الله عليه وسلم bersabda: \"Janganlah kamu jadikan rumahmu seperti kubur. Sesungguhnya syaitan lari dari rumah yang dibacakan di dalamnya surah Al-Baqarah.\" (Riwayat Muslim)",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَجْعَلُوا بِيُوتَكُمْ مَقَابِرَ إِنَّ الشَّيْطَانَ يَنْفِرُ من الْبَيْت الَّذِي يقْرَأ فِيهِ سُورَة الْبَقَرَة» . رَوَاهُ مُسلم"
      },
      {
        "id": 30814,
        "hadith_number": "2120",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Membaca Al-Quran, Surah Al-Baqarah dan Ali Imran",
        "perawi_melayu": "Diriwayatkan daripada Abu Umamah R.A., beliau berkata: Aku mendengar Rasulullah SAW bersabda:",
        "english_text": "Narrated Abu Umamah: I heard the Messenger of Allah (ﷺ) say: Recite the Quran, for on the Day of Resurrection it will come as an intercessor for those who recite It. Recite the two bright ones, al-Baqarah and Surah Al 'Imran, for on the Day of Resurrection they will come as if they were two clouds or two shades, or two flocks of birds in ranks, pleading for those who recite them. Recite Surat al-Baqarah, for to take recourse to it is a blessing and to abandon it is a cause of grief, and the magicians cannot confront it.",
        "malay_translation": "\"Bacalah Al-Quran, kerana sesungguhnya ia akan datang pada Hari Kiamat sebagai pemberi syafaat kepada para pembacanya. Bacalah dua surah yang bercahaya, iaitu Surah Al-Baqarah dan Surah Ali Imran, kerana sesungguhnya kedua-duanya akan datang pada Hari Kiamat seolah-olah dua awan atau dua naungan, atau dua kelompok burung yang berbaris, membela orang-orang yang membacanya. Bacalah Surah Al-Baqarah, kerana mengambilnya (membacanya dan mengamalkannya) adalah keberkatan dan meninggalkannya adalah penyesalan, dan ahli sihir tidak mampu menghadapinya.\" (Riwayat Muslim)",
        "arabic_text": "عَنْ أَبِي أُمَامَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يَقُول: «اقْرَءُوا الْقُرْآنَ فَإِنَّهُ يَأْتِي يَوْمَ الْقِيَامَةِ شَفِيعًا لِأَصْحَابِهِ اقْرَءُوا الزَّهْرَاوَيْنِ الْبَقَرَةَ وَسُورَةَ آلِ عِمْرَانَ فَإِنَّهُمَا تَأْتِيَانِ يَوْمَ الْقِيَامَةِ كَأَنَّهُمَا غَمَامَتَانِ أَوْ كَأَنَّهُمَا غَيَايَتَانِ أَو فِرْقَانِ مِنْ طَيْرٍ صَوَافَّ تُحَاجَّانِ عَنْ أَصْحَابِهِمَا اقْرَءُوا سُورَةَ الْبَقَرَةِ فَإِنَّ أَخْذَهَا بَرَكَةٌ وَتَرْكَهَا حَسْرَةٌ وَلَا تستطيعها البطلة» . رَوَاهُ مُسلم"
      },
      {
        "id": 30815,
        "hadith_number": "2121",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Surah Al-Baqarah dan Ali Imran di Hari Kiamat",
        "perawi_melayu": "Diriwayatkan dari Nawas bin Sam'an RA, beliau berkata: Aku mendengar Nabi SAW bersabda:",
        "english_text": "Narrated by Nawas bin Sam'an: I heard the Prophet (peace and blessings of Allah be upon him) say: 'The Quran will be brought on the Day of Resurrection, along with its people who used to act according to it. Surah Al-Baqarah and Ali Imran will come in front of it like two clouds or two black shadows with light between them, or like two flocks of birds in ranks, pleading for their companions.' Related by Muslim.",
        "malay_translation": "Diriwayatkan dari Nawas bin Sam'an RA, beliau berkata: Aku mendengar Nabi SAW bersabda: 'Al-Quran akan dibawa pada hari kiamat, bersama dengan ahlinya yang mengamalkannya. Surah Al-Baqarah dan Ali Imran akan datang di hadapannya seperti dua awan atau dua naungan hitam dengan cahaya di antara keduanya, atau seperti dua kelompok burung yang berbaris, memohon syafaat untuk sahabat mereka.' Riwayat Muslim.",
        "arabic_text": "وَعَن النواس بن سمْعَان قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «يُؤْتَى بِالْقُرْآنِ يَوْمَ الْقِيَامَةِ وَأَهْلِهِ الَّذِينَ كَانُوا يَعْمَلُونَ بِهِ تَقْدُمُهُ سُورَةُ الْبَقَرَةِ وَآلُ عِمْرَانَ كَأَنَّهُمَا غَمَامَتَانِ أَوْ ظُلَّتَانِ سَوْدَاوَانِ بَيْنَهُمَا شَرْقٌ أَوْ كَأَنَّهُمَا فِرْقَانِ مِنْ طَيْرٍ صَوَافَّ تحاجان عَن صَاحبهمَا» . رَوَاهُ مُسلم"
      },
      {
        "id": 30816,
        "hadith_number": "2122",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Ayat Kursi",
        "perawi_melayu": "Ubayy bin Ka'b",
        "english_text": "Narrated by Ubayy bin Ka'b: The Prophet (peace be upon him) said: 'O Abu al-Mundhir, do you know which verse of Allah's Book is the greatest?' I replied, 'Allah and His Messenger know best.' The Prophet (peace be upon him) repeated, 'O Abu al-Mundhir, do you know which verse of Allah's Book is the greatest?' I replied, 'Allah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence.' Thereupon he struck me in the chest and said, 'May knowledge be a source of happiness to you, O Abu al-Mundhir!' (Muslim)",
        "malay_translation": "Diriwayatkan daripada Ubayy bin Ka'b berkata: Rasulullah SAW bersabda: “Wahai Abu al-Mundhir, adakah kamu tahu ayat manakah dalam Kitab Allah yang paling agung?” Saya menjawab, “Allah dan Rasul-Nya lebih mengetahui.” Baginda SAW mengulangi, “Wahai Abu al-Mundhir, adakah kamu tahu ayat manakah dalam Kitab Allah yang paling agung?” Saya menjawab, “Allah, tidak ada tuhan melainkan Dia, Yang Maha Hidup, Yang Maha Berdiri Sendiri.” Lalu baginda menepuk dada saya dan bersabda, “Semoga ilmu itu membahagiakanmu, wahai Abu al-Mundhir!” (Muslim)",
        "arabic_text": "وَعَنْ أُبَيِّ بْنِ كَعْبٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا أَبَا الْمُنْذِرِ أَتَدْرِي أَيُّ آيَةٍ مِنْ كِتَابِ اللَّهِ مَعَك أعظم؟» . قَالَ: قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ: «يَا أَبَا الْمُنْذِرِ أَتَدْرِي أَيُّ آيَةٍ مِنْ كِتَابِ اللَّهِ مَعَك أعظم؟» . قَالَ: قُلْتُ (اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ القيوم) قَالَ فَضرب فِي صَدْرِي وَقَالَ: «وَالله لِيَهنك الْعلم أَبَا الْمُنْذر» . رَوَاهُ مُسلم"
      },
      {
        "id": 30817,
        "hadith_number": "2123",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kisah Abu Hurairah dan Pencuri Zakat",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah رضي الله عنه berkata: Rasulullah ﷺ telah mewakilkan aku untuk menjaga zakat Ramadan. Lalu datanglah seseorang (pada waktu malam) dan dia mula mencuri (mengambil) makanan. Lalu aku menangkapnya dan berkata: “Demi Allah, aku akan melaporkanmu kepada Rasulullah ﷺ.” Lelaki itu berkata: “Sesungguhnya aku sangat memerlukan (makanan) dan aku mempunyai keluarga (yang perlu diberi makan) dan aku sangat memerlukan (bantuan). Aku melepaskannya. Pada keesokan harinya, Nabi ﷺ bersabda: “Wahai Abu Hurairah, apakah yang dilakukan oleh tawananmu semalam?” Aku menjawab: “Wahai Rasulullah, dia mengadu tentang kesusahan dan keluarganya, lalu aku mengasihaninya dan membiarkannya pergi.” Baginda bersabda: “Ketahuilah, dia telah berdusta kepadamu dan dia akan kembali lagi.” Maka aku yakin dia akan kembali kerana sabda Rasulullah ﷺ bahawa dia akan kembali lagi. Aku memerhatikannya, tiba-tiba dia datang mencuri makanan. Aku menangkapnya dan berkata: “Aku akan melaporkanmu kepada Rasulullah ﷺ.” Lelaki itu berkata: “Biarkan aku (pergi) kerana aku memerlukan (makanan) dan aku mempunyai keluarga (yang perlu diberi makan), aku tidak akan kembali lagi.” Aku mengasihaninya lalu melepaskannya. Pada keesokan harinya, Rasulullah ﷺ bersabda kepadaku: “Wahai Abu Hurairah, apakah yang dilakukan oleh tawananmu?” Aku menjawab: “Wahai Rasulullah, dia mengadu tentang kesusahan dan keluarganya, lalu aku mengasihaninya dan membiarkannya pergi.” Baginda bersabda: “Ketahuilah, dia telah berdusta kepadamu dan dia akan kembali lagi.” Aku memerhatikannya untuk kali ketiga. Dia datang mencuri makanan. Lalu aku menangkapnya dan berkata: “Aku akan melaporkanmu kepada Rasulullah ﷺ. Ini adalah kali terakhir, kamu mendakwa tidak akan kembali lagi tetapi kamu kembali juga.” Lelaki itu berkata: “Biarkan aku, aku akan mengajarimu beberapa kalimah yang Allah akan memberi manfaat kepadamu dengannya.” Aku bertanya: “Apakah itu?” Dia berkata: “Apabila kamu hendak tidur di tempat tidurmu, bacalah Ayat Kursi (Allah, tidak ada Tuhan (yang berhak disembah) melainkan Dia, Yang Hidup kekal lagi terus-menerus mengurus (makhluk-Nya); tidak mengantuk dan tidak tidur. Kepunyaan-Nya apa yang di langit dan di bumi. Tidak ada yang dapat memberi syafaat di sisi-Nya melainkan dengan izin-Nya. Dia mengetahui apa-apa yang ada di hadapan mereka dan apa-apa yang ada di belakang mereka, dan mereka tidak mengetahui apa-apa dari ilmu-Nya melainkan apa yang dikehendaki-Nya. Kursi Allah meliputi langit dan bumi. Dan Allah tidak merasa berat memelihara keduanya, dan Dia Maha Tinggi lagi Maha Besar) sehingga kamu menyelesaikannya. Sesungguhnya kamu akan sentiasa ada penjaga daripada Allah dan syaitan tidak akan mendekatimu sehingga pagi.” Aku melepaskannya. Pada keesokan harinya, Rasulullah ﷺ bersabda kepadaku: “Apakah yang dilakukan oleh tawananmu?” Aku menjawab: “Dia mendakwa bahawa dia akan mengajariku beberapa kalimah yang Allah akan memberi manfaat kepadaku dengannya, lalu aku melepaskannya.” Nabi ﷺ bersabda: “Sesungguhnya dia telah berkata benar kepadamu padahal dia adalah seorang pendusta. Tahukah kamu dengan siapa kamu bercakap selama tiga malam itu? Wahai Abu Hurairah?” Aku menjawab: “Tidak.” Baginda bersabda: “Dia adalah syaitan.” (Riwayat al-Bukhari)",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: وَكَّلَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِحِفْظِ زَكَاةِ رَمَضَانَ فَأَتَانِي آتٍ فَجَعَلَ يَحْثُو من الطَّعَام فَأَخَذته وَقلت وَالله لَأَرْفَعَنَّكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنِّي مُحْتَاجٌ وَعَلَيَّ عِيَالٌ وَلِي حَاجَةٌ شَدِيدَةٌ قَالَ فَخَلَّيْتُ عَنْهُ فَأَصْبَحْتُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا أَبَا هُرَيْرَة مَا فعل أسيرك البارحة» . قَالَ قُلْتُ يَا رَسُولَ اللَّهِ شَكَا حَاجَةً شَدِيدَةً وَعِيَالًا فَرَحِمْتُهُ فَخَلَّيْتُ سَبِيلَهُ قَالَ: «أَمَا إِنَّهُ قَدْ كَذَبَكَ وَسَيَعُودُ» . فَعَرَفْتُ أَنَّهُ سَيَعُودُ لِقَوْلِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَنَّهُ سيعود» . فَرَصَدْتُهُ فَجَاءَ يَحْثُو مِنَ الطَّعَامِ فَأَخَذْتُهُ فَقُلْتُ: لَأَرْفَعَنَّكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ دَعْنِي فَإِنِّي مُحْتَاجٌ وَعَلَيَّ عِيَالٌ لَا أَعُودُ فَرَحِمْتُهُ فَخَلَّيْتُ سَبِيلَهُ فَأَصْبَحْتُ فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا أَبَا هُرَيْرَةَ مَا فَعَلَ أَسِيرُكَ؟» قُلْتُ يَا رَسُولَ اللَّهِ شَكَا حَاجَةً شَدِيدَةً وَعِيَالًا فَرَحِمْتُهُ فَخَلَّيْتُ سَبِيلَهُ قَالَ: «أَمَا إِنَّهُ قَدْ كَذبك وَسَيَعُودُ» . فرصدته الثَّالِثَة فَجَاءَ يَحْثُو مِنَ الطَّعَامِ فَأَخَذْتُهُ فَقُلْتُ لَأَرْفَعَنَّكَ إِلَى رَسُول الله وَهَذَا آخِرُ ثَلَاثِ مَرَّاتٍ إِنَّكَ تَزْعُمُ لَا تَعُودُ ثُمَّ تَعُودُ قَالَ دَعْنِي أُعَلِّمُكَ كَلِمَاتٍ ينفعك الله بهَا قلت مَا هُوَ قَالَ إِذَا أَوَيْتَ إِلَى فِرَاشِكَ فَاقْرَأْ آيَةَ الْكُرْسِيِّ (اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ) حَتَّى تَخْتِمَ الْآيَةَ فَإِنَّكَ لَنْ يَزَالَ عَلَيْكَ من الله حَافظ وَلَا يقربنك شَيْطَانٌ حَتَّى تُصْبِحَ فَخَلَّيْتُ سَبِيلَهُ فَأَصْبَحْتُ فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا فَعَلَ أَسِيرُكَ؟» قُلْتُ: زَعَمَ أَنَّهُ يُعَلِّمُنِي كَلِمَات يَنْفَعنِي الله بهَا فخليت سبيلهقال النَّبِي صلى الله عَلَيْهِ وَسلم: «أما إِنَّه قد صدقك وَهُوَ كذوب تعلم من تخاطب مُنْذُ ثَلَاث لَيَال» . يَا أَبَا هُرَيْرَة قَالَ لَا قَالَ: «ذَاك شَيْطَان» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 30818,
        "hadith_number": "2124",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Malaikat Turun Membawa Dua Cahaya",
        "perawi_melayu": "Ibnu Abbas",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Abbas, katanya: Ketika Jibril duduk di sisi Nabi ﷺ, beliau mendengar bunyi dari atas. Beliau mengangkat kepala dan berkata: “Ini adalah pintu dari langit yang dibuka hari ini, belum pernah dibuka sama sekali kecuali hari ini.” Kemudian turunlah seorang malaikat darinya. Beliau berkata: “Ini adalah malaikat yang turun ke bumi, belum pernah turun sama sekali kecuali hari ini.” Malaikat itu memberi salam dan berkata: “Bergembiralah dengan dua cahaya yang telah diberikan kepadamu, yang belum pernah diberikan kepada seorang nabi sebelummu: Surah Al-Fatihah dan penutup Surah Al-Baqarah. Tidaklah engkau membaca satu huruf pun daripada keduanya melainkan akan diberi.” (Riwayat Muslim)",
        "arabic_text": "وَعَن ابْن عَبَّاس قَالَ: بَيْنَمَا جِبْرِيلُ قَاعِدٌ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعَ نَقِيضًا مِنْ فَوْقِهِ فَرَفَعَ رَأْسَهُ فَقَالَ: «هَذَا بَابٌ مِنَ السَّمَاءِ فُتِحَ الْيَوْمَ لَمْ يُفْتَحْ قَطُّ إِلَّا الْيَوْمَ فَنَزَلَ مِنْهُ مَلَكٌ فَقَالَ هَذَا مَلَكٌ نَزَلَ إِلَى الْأَرْضِ لَمْ يَنْزِلْ قَطُّ إِلَّا الْيَوْمَ فَسَلَّمَ وَقَالَ أَبْشِرْ بِنُورَيْنِ أُوتِيتَهُمَا لَمْ يُؤْتَهُمَا نَبِيٌّ قَبْلَكَ فَاتِحَةُ الْكِتَابِ وَخَوَاتِيمُ سُورَةِ الْبَقَرَةِ لَنْ تَقْرَأَ بِحَرْفٍ مِنْهُمَا إِلَّا أَعْطيته» . رَوَاهُ مُسلم"
      },
      {
        "id": 30819,
        "hadith_number": "2125",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Dua Ayat Terakhir Surah Al-Baqarah",
        "perawi_melayu": "Diriwayatkan dari Abu Mas'ud",
        "english_text": "Narrated Abu Mas'ud: The Messenger of Allah (peace and blessings of Allah be upon him) said: 'The two verses from the end of Surah al-Baqarah, whoever recites them in a night, they will suffice him.'",
        "malay_translation": "Diriwayatkan daripada Abu Mas'ud, Rasulullah SAW bersabda: 'Dua ayat dari akhir Surah al-Baqarah, sesiapa yang membacanya pada waktu malam, kedua-duanya akan mencukupinya.'",
        "arabic_text": "وَعَنْ أَبِي مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْآيَتَانِ مِنْ آخَرِ سُورَة الْبَقَرَة من قَرَأَ بهما فِي لَيْلَة كفتاه»"
      },
      {
        "id": 30820,
        "hadith_number": "2126",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Menghafal Sepuluh Ayat Awal Surah Al-Kahfi",
        "perawi_melayu": "Abu Darda'",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Darda' رضي الله عنه, beliau berkata: Rasulullah ﷺ bersabda: \"Sesiapa yang menghafal sepuluh ayat daripada awal Surah Al-Kahfi, dia akan terlindung daripada fitnah Dajjal.\" (Riwayat Muslim)",
        "arabic_text": "وَعَنْ أَبِي الدَّرْدَاءِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ حَفِظَ عشر آيَات من أول سُورَة الْكَهْف عصم من فتْنَة الدَّجَّال» . رَوَاهُ مُسلم"
      },
      {
        "id": 30821,
        "hadith_number": "2127",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keistimewaan Membaca Surah Al-Ikhlas",
        "perawi_melayu": "Abu Darda' (رَضِيَ ٱللَّٰهُ عَنْهُ)",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Darda' (رَضِيَ ٱللَّٰهُ عَنْهُ) berkata: Rasulullah ﷺ bersabda: \"Adakah salah seorang daripada kamu tidak mampu membaca sepertiga al-Quran dalam satu malam?\" Mereka bertanya: \"Bagaimanakah caranya membaca sepertiga al-Quran?\" Baginda bersabda: \"Qul Huwa Allahu Ahad (Surah al-Ikhlas) menyamai sepertiga al-Quran.\" (Riwayat Muslim)",
        "arabic_text": "وَعَنْ أَبِي الدَّرْدَاءِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَيَعْجَزُ أَحَدُكُمْ أَنْ يَقْرَأَ فِي لَيْلَةٍ ثُلُثَ الْقُرْآنِ؟» قَالُوا: وَكَيْفَ يَقْرَأُ ثُلُثَ الْقُرْآنِ؟ قَالَ: «قُلْ هُوَ الله أحد» يعدل ثلث الْقُرْآن . رَوَاهُ مُسلم"
      },
      {
        "id": 30822,
        "hadith_number": "2128",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Riwayat oleh Al-Bukhari daripada Abu Sa'id",
        "perawi_melayu": "Tidak dinyatakan dalam sumber ini",
        "english_text": "Not Available",
        "malay_translation": "Diriwayatkan oleh Al-Bukhari daripada Abu Sa'id. (وََرَوَاهُ البُخَارِيّ عَن أبي سعيد)",
        "arabic_text": "وَرَوَاهُ البُخَارِيّ عَن أبي سعيد"
      },
      {
        "id": 30823,
        "hadith_number": "2129",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kelebihan Membaca Surah Al-Ikhlas dalam Solat",
        "perawi_melayu": "Diriwayatkan daripada Aisyah R.A.",
        "english_text": "Aisyah reported: The Prophet (peace and blessings of Allah be upon him) sent a man on an expedition, and he would recite for his companions in their prayer, concluding with (Say: He is Allah, the One). When they returned, they mentioned that to the Prophet (peace and blessings of Allah be upon him). He said: Ask him why he does that. So they asked him, and he said: Because it is a description of Ar-Rahman, and I love to recite it. The Prophet (peace and blessings of Allah be upon him) said: Inform him that Allah loves him.",
        "malay_translation": "Daripada Aisyah R.A.: Bahawa Nabi SAW telah menghantar seorang lelaki dalam satu ekspedisi (peperangan), dan dia membaca (Surah Al-Ikhlas) untuk para sahabatnya dalam solat mereka, lalu mengakhirinya dengan (Katakanlah: Dialah Allah, Yang Maha Esa). Apabila mereka kembali, mereka menyebut perkara itu kepada Nabi SAW. Baginda bersabda: Tanyalah dia mengapa dia berbuat demikian. Lalu mereka bertanya kepadanya, dan dia berkata: Kerana ia adalah sifat Ar-Rahman (Yang Maha Pemurah), dan saya suka membacanya. Nabi SAW bersabda: Beritahulah dia bahawa Allah mencintainya.",
        "arabic_text": "وَعَنْ عَائِشَةَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ رَجُلًا عَلَى سَرِيَّةٍ وَكَانَ يَقْرَأُ لأَصْحَابه فِي صلَاتهم فيختم ب (قل هُوَ اللَّهُ أَحَدٌ) فَلَمَّا رَجَعُوا ذَكَرُوا ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «سَلُوهُ لِأَيِّ شَيْءٍ يَصْنَعُ ذَلِكَ» فَسَأَلُوهُ فَقَالَ لِأَنَّهَا صفة الرَّحْمَن وَأَنا أحب أَن أَقرَأ بِهَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَخْبِرُوهُ أَن الله يُحِبهُ»"
      },
      {
        "id": 30824,
        "hadith_number": "2130",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kecintaan terhadap Surah Al-Ikhlas Membawa ke Syurga",
        "perawi_melayu": "Anas (RA)",
        "english_text": "Not Available",
        "malay_translation": "Daripada Anas (RA), beliau berkata: Seorang lelaki berkata, \"Wahai Rasulullah! Sesungguhnya aku mencintai surah ini: (Qul Huwa Allahu Ahad).\"  Baginda bersabda, \"Sesungguhnya kecintaanmu terhadapnya akan memasukkanmu ke dalam syurga.\" Diriwayatkan oleh At-Tirmizi. Al-Bukhari meriwayatkan maknanya.",
        "arabic_text": "وَعَنْ أَنَسٍ قَالَ: إِنَّ رَجُلًا قَالَ: يَا رَسُولَ اللَّهِ إِنِّي أُحِبُّ هَذِهِ السُّورَةَ: (قُلْ هُوَ الله أحد) قَالَ: إِنَّ حُبَّكَ إِيَّاهَا أَدْخَلَكَ الْجَنَّةَ . رَوَاهُ التِّرْمِذِيّ وروى البُخَارِيّ مَعْنَاهُ"
      },
      {
        "id": 30825,
        "hadith_number": "2131",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Surah Al-Falaq dan An-Nas",
        "perawi_melayu": "Uqbah bin Amir",
        "english_text": "Not Available",
        "malay_translation": "Daripada Uqbah bin Amir, beliau berkata: Rasulullah SAW bersabda: \"Tidakkah kamu melihat ayat-ayat yang diturunkan pada malam ini yang tidak pernah dilihat seumpamanya sebelum ini? (Qul a'uzu birabbil-falaq) dan (Qul a'uzu birabbin-nas).\" (Riwayat Muslim)",
        "arabic_text": "وَعَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَلَمْ تَرَ آيَاتٍ أُنْزِلَتِ اللَّيْلَةَ لَمْ يُرَ مِثْلُهُنَّ قَطُّ (قل أعوذ بِرَبّ الفلق) و (قل أعوذ بِرَبّ النَّاس) رَوَاهُ مُسلم"
      },
      {
        "id": 30826,
        "hadith_number": "2132",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Amalan Nabi SAW Sebelum Tidur: Membaca Surah Al-Ikhlas, Al-Falaq, dan An-Nas",
        "perawi_melayu": "Aisyah RA (dinyatakan dalam teks)",
        "english_text": "Not Available",
        "malay_translation": "Daripada Aisyah RA: Sesungguhnya Nabi SAW apabila berbaring di tempat tidurnya setiap malam, baginda mengumpulkan kedua telapak tangannya kemudian meniupnya, lalu membaca pada keduanya (Surah Al-Ikhlas), (Surah Al-Falaq), dan (Surah An-Nas). Kemudian baginda mengusap dengan keduanya apa yang baginda mampu dari tubuhnya, baginda memulakan pada kepalanya, wajahnya, dan apa yang menghadap dari tubuhnya. Baginda melakukan demikian tiga kali. Dan kami akan menyebutkan hadis Ibnu Mas'ud: Ketika Rasulullah SAW diisra'kan pada malam Mi'raj, insyaAllah Ta'ala.",
        "arabic_text": "وَعَنْ عَائِشَةَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَوَى إِلَى فِرَاشِهِ كُلَّ لَيْلَةٍ جَمَعَ كَفَّيْهِ ثُمَّ نَفَثَ فِيهِمَا فَقَرَأَ فيهمَا (قل هُوَ الله أحد) و (قل أعوذ بِرَبّ الفلق) و (قل أَعُوذُ بِرَبِّ النَّاسِ) ثُمَّ يَمْسَحُ بِهِمَا مَا اسْتَطَاعَ مِنْ جَسَدِهِ يَبْدَأُ بِهِمَا عَلَى رَأْسِهِ وَوَجْهِهِ وَمَا أَقْبَلَ مِنْ جَسَدِهِ يَفْعَلُ ذَلِكَ ثَلَاث مَرَّات وَسَنَذْكُرُ حَدِيثَ ابْنِ مَسْعُودٍ: لَمَّا أُسْرِيَ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَابِ الْمِعْرَاج إِن شَاءَ الله تَعَالَى"
      },
      {
        "id": 30827,
        "hadith_number": "2133",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tiga Perkara di Bawah Arasy pada Hari Kiamat",
        "perawi_melayu": "Abdur Rahman bin Auf (RA)",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abdur Rahman bin Auf (RA) daripada Nabi SAW bersabda: “Tiga perkara akan berada di bawah Arasy pada hari Kiamat: Al-Quran akan membela hamba-hamba Allah, ia mempunyai zahir dan batin; amanah; dan silaturahim. Silaturahim akan menyeru: “Ketahuilah sesiapa yang menghubungiku, Allah akan menghubunginya, dan sesiapa yang memutuskanku, Allah akan memutuskannya.” (Diriwayatkan dalam Syarh as-Sunnah).",
        "arabic_text": "عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: ثَلَاثَةٌ تَحْتَ الْعَرْشِ يَوْمَ الْقِيَامَةِ الْقُرْآنُ يُحَاجُّ الْعِبَادَ لَهُ ظَهْرٌ وَبَطْنٌ وَالْأَمَانَةُ وَالرَّحِمُ تُنَادِي: أَلَا مَنْ وَصَلَنِي وَصَلَهُ اللَّهُ وَمَنْ قَطَعَنِي قَطَعَهُ اللَّهُ . رَوَاهُ فِي شرح السّنة"
      },
      {
        "id": 30828,
        "hadith_number": "2134",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ganjaran Pembaca Al-Quran di Akhirat",
        "perawi_melayu": "Abdullah bin Amr",
        "english_text": "It is narrated on the authority of 'Abdullah b. 'Amr that the Messenger of Allah (ﷺ) said: It will be said to the companion of the Qur'an: Recite, and ascend, and recite (the Qur'an) in the same manner as you used to recite in the world, for your abode will be (determined) by the last verse you recite.",
        "malay_translation": "Diriwayatkan daripada Abdullah bin Amr, bahawa Rasulullah SAW bersabda: “Akan dikatakan kepada sahabat Al-Quran: Bacalah, naiklah, dan bacalah dengan tartil (dengan bacaan yang betul dan perlahan) sebagaimana kamu membacanya di dunia, kerana sesungguhnya tempat tinggalmu adalah (terletak) pada ayat terakhir yang kamu baca.”",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: يُقَالُ لِصَاحِبِ الْقُرْآنِ: اقْرَأْ وَارَتْقِ وَرَتِّلْ كَمَا كُنْتَ تُرَتِّلُ فِي الدُّنْيَا فَإِنَّ مَنْزِلَكَ عِنْدَ آخِرِ آيَة تقرؤها . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ أَبُو دَاوُد وَالنَّسَائِيّ"
      },
      {
        "id": 30829,
        "hadith_number": "2135",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rumah Hati Tanpa Al-Quran",
        "perawi_melayu": "Ibnu Abbas",
        "english_text": "The Prophet (ﷺ) said: \"The one who has no (memorized) Quran in his chest is like a ruined house.\"",
        "malay_translation": "Rasulullah ﷺ bersabda: \"Sesiapa yang tiada (menghafal) Al-Quran dalam dadanya, maka ia seperti rumah yang roboh.\"",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الَّذِي لَيْسَ فِي جَوْفِهِ شَيْءٌ مِنَ الْقُرْآنِ كَالْبَيْتِ الْخَرِبِ» . رَوَاهُ التِّرْمِذِيُّ وَالدَّارِمِيُّ. وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ صَحِيح"
      },
      {
        "id": 30830,
        "hadith_number": "2136",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Mereka yang Disibukkan dengan Al-Quran",
        "perawi_melayu": "Abu Sa'id (RA)",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Sa'id (RA) berkata: Rasulullah SAW bersabda: Allah SWT berfirman: 'Sesiapa yang disibukkan oleh Al-Quran daripada mengingati-Ku dan memohon kepada-Ku, Aku akan memberikan kepadanya yang lebih baik daripada apa yang Aku berikan kepada mereka yang memohon. Kelebihan kalam Allah ke atas kalam yang lain adalah seperti kelebihan Allah ke atas makhluk-Nya.' Diriwayatkan oleh At-Tirmizi, Ad-Darimi, dan Al-Baihaqi dalam Syu'ab Al-Iman. Imam At-Tirmizi berkata: Ini adalah hadis hasan gharib.",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: يَقُولُ الرَّبُّ تَبَارَكَ وَتَعَالَى: مَنْ شَغَلَهُ الْقُرْآنُ عَنْ ذِكْرِي وَمَسْأَلَتِي أَعْطَيْتُهُ أَفْضَلَ مَا أُعْطِي السَّائِلِينَ. وَفَضْلُ كَلَامِ اللَّهِ عَلَى سَائِرِ الْكَلَامِ كَفَضْلِ اللَّهِ عَلَى خَلْقِهِ . رَوَاهُ التِّرْمِذِيُّ وَالدَّارِمِيُّ وَالْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ وَقَالَ التِّرْمِذِيُّ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ"
      },
      {
        "id": 30831,
        "hadith_number": "2137",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ganjaran Membaca Satu Huruf Al-Quran",
        "perawi_melayu": "Ibnu Mas'ud (R.A.)",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Mas'ud (R.A.) berkata: Rasulullah SAW bersabda: \"Sesiapa yang membaca satu huruf daripada Kitabullah (Al-Quran), maka baginya satu kebaikan, dan satu kebaikan itu dibalas dengan sepuluh kali ganda. Aku tidak mengatakan: \"Alif Lam Mim\" itu satu huruf. Akan tetapi, alif itu satu huruf, lam itu satu huruf, dan mim itu satu huruf.\" (Riwayat At-Tirmizi dan Ad-Darimi). Imam At-Tirmizi berkata: Hadith ini hasan sahih gharib sanad.",
        "arabic_text": "وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ قَرَأَ حَرْفًا مِنْ كِتَابِ اللَّهِ فَلَهُ بِهِ حَسَنَةٌ وَالْحَسَنَةُ بِعَشْرِ أَمْثَالِهَا لَا أَقُولُ: آلم حَرْفٌ. أَلْفٌ حَرْفٌ وَلَامٌ حَرْفٌ وَمِيمٌ حَرْفٌ . رَوَاهُ التِّرْمِذِيُّ وَالدَّارِمِيُّ وَقَالَ التِّرْمِذِيُّ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيب إِسْنَادًا"
      },
      {
        "id": 30832,
        "hadith_number": "2138",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Al-Quran: Sumber Petunjuk dan Penyelamat dari Fitnah",
        "perawi_melayu": "Al-Harith al-A'war",
        "english_text": "Not Available",
        "malay_translation": "Daripada Al-Harith al-A'war, dia berkata: \"Aku melalui masjid dan mendapati orang ramai sedang berbincang tentang perkara-perkara. Aku kemudiannya menemui Ali radhiyallahu 'anhu dan memberitahunya. Dia bertanya, 'Adakah mereka melakukannya?' Aku menjawab, 'Ya.' Dia berkata: 'Sesungguhnya aku mendengar Rasulullah ﷺ bersabda: 'Ketahuilah, akan berlaku fitnah.' Aku bertanya: 'Apakah jalan keluar daripadanya, wahai Rasulullah?' Baginda bersabda: 'Kitabullah (al-Quran). Di dalamnya terdapat berita mengenai apa yang telah berlaku sebelum kamu, berita mengenai apa yang akan berlaku selepas kamu, dan hukum di antara kamu. Ia adalah pemisah (antara yang hak dan yang batil), bukan sesuatu yang main-main. Sesiapa yang meninggalkannya daripada orang yang sombong, Allah akan membinasakannya. Sesiapa yang mencari petunjuk selain daripadanya, Allah akan menyesatkannya. Ia adalah tali Allah yang kukuh, ia adalah peringatan yang bijaksana, dan ia adalah jalan yang lurus. Itulah yang tidak akan menyelewengkan hawa nafsu, tidak akan mengelirukan lidah, tidak akan merasa kenyang para ulama daripadanya, tidak akan usang kerana banyak pengulangan, dan tidak akan habis keajaibannya. Ia adalah (kitab) yang apabila jin mendengarnya, mereka berkata (sesungguhnya kami telah mendengar Al-Quran yang menakjubkan, yang memberi petunjuk kepada jalan yang benar, lalu kami beriman kepadanya). Sesiapa yang berkata dengannya, dia benar. Sesiapa yang beramal dengannya, dia diberi ganjaran. Sesiapa yang menghukum dengannya, dia berlaku adil. Sesiapa yang menyeru kepadanya, dia diberi petunjuk ke jalan yang lurus.'\" Diriwayatkan oleh At-Tirmizi dan Ad-Darimi. At-Tirmizi berkata: \"Hadith ini, sanadnya majhul (tidak dikenali) dan pada Al-Harith terdapat perbincangan.\"",
        "arabic_text": "وَعَنِ الْحَارِثِ الْأَعْوَرِ قَالَ: مَرَرْتُ فِي الْمَسْجِدِ فَإِذَا النَّاسُ يَخُوضُونَ فِي الْأَحَادِيثِ فَدَخَلْتُ عَلَى عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ فَأَخْبَرْتُهُ قَالَ: أَوَقَدْ فَعَلُوهَا؟ قلت نعم قَالَ: أما إِنِّي قَدْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُول: «أَلا إِنَّهَا سَتَكُون فتْنَة» . فَقلت مَا الْمَخْرَجُ مِنْهَا يَا رَسُولَ اللَّهِ قَالَ: «كتاب الله فِيهِ نبأ مَا كَانَ قبلكُمْ وَخبر مَا بعدكم وَحكم مَا بَيْنكُم وَهُوَ الْفَصْلُ لَيْسَ بِالْهَزْلِ مَنْ تَرَكَهُ مِنْ جَبَّارٍ قَصَمَهُ اللَّهُ وَمَنِ ابْتَغَى الْهُدَى فِي غَيْرِهِ أَضَلَّهُ اللَّهُ وَهُوَ حَبْلُ اللَّهِ الْمَتِينُ وَهُوَ الذِّكْرُ الْحَكِيمُ وَهُوَ الصِّرَاطُ الْمُسْتَقِيمُ هُوَ الَّذِي لَا تَزِيغُ بِهِ الْأَهْوَاءُ وَلَا تَلْتَبِسُ بِهِ الْأَلْسِنَةُ وَلَا يَشْبَعُ مِنْهُ الْعُلَمَاءُ وَلَا يَخْلِقُ على كَثْرَةِ الرَّدِّ وَلَا يَنْقَضِي عَجَائِبُهُ هُوَ الَّذِي لَمْ تَنْتَهِ الْجِنُّ إِذْ سَمِعَتْهُ حَتَّى قَالُوا (إِنَّا سَمِعْنَا قُرْآنًا عَجَبًا يَهْدِي إِلَى الرُّشْدِ فَآمَنا بِهِ) مَنْ قَالَ بِهِ صَدَقَ وَمَنْ عَمِلَ بِهِ أُجِرَ وَمَنْ حَكَمَ بِهِ عَدَلَ وَمَنْ دَعَا إِلَيْهِ هُدِيَ إِلَى صِرَاطٍ مُسْتَقِيمٍ» . رَوَاهُ التِّرْمِذِيُّ وَالدَّارِمِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ إِسْنَادُهُ مَجْهُولٌ وَفِي الْحَارِث مقَال"
      },
      {
        "id": 30833,
        "hadith_number": "2139",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Membaca dan Mengamalkan Al-Quran untuk Ibu Bapa",
        "perawi_melayu": "Mu'az al-Juhani",
        "english_text": "Mu'adh al-Juhani reported that the Messenger of Allah (peace and blessings of Allah be upon him) said: 'Whoever recites the Quran and acts according to what it contains, his parents will be adorned with a crown on the Day of Resurrection, the light of which is better than the light of the sun in the houses of this world, if it were among you. So what do you think of one who acts upon this?' Related by Ahmad and Abu Dawood.",
        "malay_translation": "Daripada Mu'az al-Juhani, bahawa Rasulullah SAW bersabda: 'Sesiapa yang membaca Al-Quran dan mengamalkan apa yang terkandung di dalamnya, kedua ibu bapanya akan dipakaikan mahkota pada Hari Kiamat, yang cahayanya lebih baik daripada cahaya matahari di rumah-rumah dunia ini, sekiranya ia berada di kalangan kamu. Maka apakah sangkaan kamu terhadap orang yang mengamalkan ini?' Riwayat Ahmad dan Abu Daud.",
        "arabic_text": "وَعَن معَاذ الْجُهَنِيّ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قَرَأَ الْقُرْآنَ وَعَمِلَ بِمَا فِيهِ أُلْبِسَ وَالِدَاهُ تَاجًا يَوْمَ الْقِيَامَةِ ضَوْءُهُ أَحْسَنُ مِنْ ضَوْءِ الشَّمْسِ فِي بُيُوتِ الدُّنْيَا لَوْ كَانَتْ فِيكُمْ فَمَا ظَنُّكُمْ بِالَّذِي عَمِلَ بِهَذَا؟» . رَوَاهُ أَحْمد وَأَبُو دَاوُد"
      },
      {
        "id": 30834,
        "hadith_number": "2140",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keistimewaan Al-Quran (Sekiranya Diletakkan Dalam Api)",
        "perawi_melayu": "Uqbah bin Amir",
        "english_text": "Not Available",
        "malay_translation": "Daripada Uqbah bin Amir berkata: Saya mendengar Rasulullah SAW bersabda: \"Sekiranya Al-Quran diletakkan di dalam kulit (yang terawat) kemudian dicampakkan ke dalam api, nescaya ia tidak akan terbakar.\" (Riwayat Ad-Darimi)",
        "arabic_text": "وَعَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَوْ جُعِلَ الْقُرْآنُ فِي إِهَابٍ ثُمَّ أُلْقِيَ فِي النَّار مَا احْتَرَقَ» . رَوَاهُ الدَّارمِيّ"
      },
      {
        "id": 30835,
        "hadith_number": "2141",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Membaca dan Menghafal Al-Quran",
        "perawi_melayu": "Ali bin Abi Talib r.a.",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ali bin Abi Talib r.a., berkata: Rasulullah SAW bersabda: \"Sesiapa yang membaca Al-Quran dan menghafalnya, kemudian menghalalkan yang halal daripadanya dan mengharamkan yang haram daripadanya, nescaya Allah akan memasukkannya ke dalam syurga dan memberikan syafaat kepadanya bagi sepuluh orang dari kalangan ahli keluarganya, yang mana mereka telah pasti akan masuk neraka.\"  Diriwayatkan oleh Ahmad, Tirmizi, Ibnu Majah, dan Darimi.  Tirmizi berkata: Ini adalah Hadith gharib (asing). Hafs bin Sulaiman, perawi, dia tidak kuat dan dianggap lemah dalam Hadith.",
        "arabic_text": "وَعَنْ عَلِيَّ بْنَ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ قَرَأَ الْقُرْآنَ فَاسْتَظْهَرَهُ فَأَحَلَّ حَلَالَهُ وَحَرَّمَ حَرَامَهُ أَدْخَلَهُ اللَّهُ بِهِ الْجَنَّةَ وَشَفَّعَهُ فِي عَشَرَةٍ مِنْ أَهْلِ بَيْتِهِ كُلِّهِمْ قَدْ وَجَبَتْ لَهُ النَّارُ. رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيب وَحَفْص بن سُلَيْمَان الرَّاوِي لَيْسَ هُوَ بِالْقَوِيِّ يَضْعُفُ فِي الْحَدِيثِ"
      },
      {
        "id": 30836,
        "hadith_number": "2142",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Surah Al-Fatihah",
        "perawi_melayu": "Abu Hurairah r.a.",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah r.a., bahawa Rasulullah SAW bersabda kepada Ubay bin Ka'ab: \"Bagaimana kamu membaca dalam solat?\" Lalu beliau membaca Ummul Qur'an (Surah Al-Fatihah). Kemudian Rasulullah SAW bersabda: \"Demi (Allah) yang jiwaku di tangan-Nya, tidaklah diturunkan dalam Taurat, Injil, Zabur, mahupun Furqan (Al-Quran) sepertinya. Sesungguhnya ia adalah tujuh ayat yang dibaca berulang-ulang dan Al-Quran yang agung yang telah aku terima\". Riwayat At-Tirmidzi. Dan riwayat Ad-Darimi daripada sabdanya: \"Tidaklah diturunkan\" dan tidak menyebut Ubay bin Ka'ab. Imam At-Tirmidzi berkata: Hadith ini hasan sahih.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم قَالَ لِأُبَيِّ بْنِ كَعْبٍ: «كَيْفَ تَقْرَأُ فِي الصَّلَاةِ؟» فَقَرَأَ أُمَّ الْقُرْآنِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَالَّذِي نَفْسِي بِيَدِهِ مَا أنزلت فِي التَّوْرَاة وَلَا فِي الْإِنْجِيل وَلَا فِي الزبُور وَلَا فِي الْفرْقَان مِثْلُهَا وَإِنَّهَا سَبْعٌ مِنَ الْمَثَانِي وَالْقُرْآنُ الْعَظِيمُ الَّذِي أُعْطِيتُهُ» . رَوَاهُ التِّرْمِذِيُّ وَرَوَى الدَّارِمِيُّ مِنْ قَوْلِهِ: «مَا أُنْزِلَتْ» وَلَمْ يَذْكُرْ أُبَيُّ بْنُ كَعْبٍ. وَقَالَ التِّرْمِذِيُّ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ"
      },
      {
        "id": 30837,
        "hadith_number": "2143",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Mempelajari dan Mengamalkan Al-Quran",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Narrated Abu Hurairah: The Messenger of Allah (peace be upon him) said: Learn the Qur'an and recite it. For the example of the one who learns the Qur'an and acts upon it is like a pouch filled with musk, whose fragrance spreads everywhere, and the example of the one who learns it and then sleeps while it is within him, is like a pouch tied over musk. (Tirmidhi, Nasa'i and Ibn Majah)",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah, beliau berkata: Rasulullah SAW bersabda: \"Pelajarilah Al-Quran dan bacalah ia. Sesungguhnya perumpamaan orang yang mempelajari Al-Quran dan mengamalkannya adalah seperti kantung yang dipenuhi dengan kasturi, yang harumnya merebak ke merata tempat, dan perumpamaan orang yang mempelajarinya kemudian tidur sedangkan ia berada di dalam dirinya, adalah seperti kantung yang diikat di atas kasturi.\" (Riwayat At-Tirmidzi, An-Nasa'i dan Ibnu Majah)",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَعَلَّمُوا الْقُرْآنَ فَاقْرَءُوهُ فَإِن مثل الْقُرْآن لمن تعلم وَقَامَ بِهِ كَمثل جراب محشو مسكا يفوح رِيحُهُ كُلَّ مَكَانٍ وَمَثَلُ مَنْ تَعَلَّمَهُ فَرَقَدَ وَهُوَ فِي جَوْفِهِ كَمَثَلِ جِرَابٍ أُوكِئَ عَلَى مسك» . رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ وَابْن مَاجَه"
      },
      {
        "id": 30838,
        "hadith_number": "2144",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Membaca Surah Ghafir dan Ayat Kursi",
        "perawi_melayu": "Abu Hurairah (رَضِيَ اللَّهُ عَنْهُ)",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah (رَضِيَ اللَّهُ عَنْهُ) berkata: Rasulullah (ﷺ) bersabda: \"Sesiapa yang membaca (حم) Al-Mu'min (Surah Ghafir) hingga (إِلَيْهِ الْمَصِيرُ) dan Ayat Kursi ketika waktu pagi, dia akan dipelihara oleh keduanya sehingga waktu petang. Dan sesiapa yang membacanya ketika waktu petang, dia akan dipelihara oleh keduanya sehingga waktu pagi.\" (Riwayat At-Tirmizi dan Ad-Darimi, dan At-Tirmizi berkata: Hadith ini gharib (asing).",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ قَرَأَ (حم) الْمُؤْمِنَ إِلَى (إِلَيْهِ الْمَصِيرُ) وَآيَةَ الْكُرْسِيِّ حِينَ يُصْبِحُ حُفِظَ بِهِمَا حَتَّى يُمْسِيَ. وَمَنْ قَرَأَ بِهِمَا حِينَ يُمْسِي حُفِظَ بهما حَتَّى يصبح . رَوَاهُ التِّرْمِذِيّ والدرامي وَقَالَ التِّرْمِذِيّ هَذَا حَدِيث غَرِيب"
      },
      {
        "id": 30839,
        "hadith_number": "2145",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Allah Menulis Sebuah Kitab Sebelum Penciptaan Langit dan Bumi",
        "perawi_melayu": "An-Nu'man bin Bashir",
        "english_text": "Narrated An-Nu'man bin Bashir: Allah's Messenger (ﷺ) said: \"Allah wrote a Book two thousand years before He created the heavens and the earth. He sent down two verses from it with which He sealed Surah Al-Baqarah. If they are recited in a house for three nights, Satan will not approach it.\"",
        "malay_translation": "Diriwayatkan daripada An-Nu'man bin Bashir, beliau berkata: Rasulullah ﷺ bersabda: “Sesungguhnya Allah telah menulis sebuah kitab sebelum Dia menciptakan langit dan bumi dalam tempoh dua ribu tahun. Dia menurunkan daripada kitab itu dua ayat yang dengannya Dia menutup Surah Al-Baqarah. Sekiranya kedua-dua ayat itu dibaca di dalam rumah selama tiga malam, maka syaitan tidak akan mendekatinya.”",
        "arabic_text": "وَعَنِ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ كتب كتابا قبل أَن يخلق السَّمَوَات وَالْأَرْضَ بِأَلْفَيْ عَامٍ أَنْزَلَ مِنْهُ آيَتَيْنِ خَتَمَ بِهِمَا سُورَةَ الْبَقَرَةِ وَلَا تُقْرَآنِ فِي دَارٍ ثَلَاثَ لَيَالٍ فَيَقْرَبَهَا الشَّيْطَانُ» . رَوَاهُ التِّرْمِذِيُّ وَالدَّارِمِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيب"
      },
      {
        "id": 30840,
        "hadith_number": "2146",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kelebihan Membaca Tiga Ayat Awal Surah Al-Kahf",
        "perawi_melayu": "Abu Darda'",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Darda' RA, beliau berkata: Rasulullah SAW bersabda: \"Sesiapa yang membaca tiga ayat pertama daripada surah Al-Kahf, dia akan terpelihara daripada fitnah Dajjal.\" Diriwayatkan oleh At-Tirmizi dan beliau berkata: Ini adalah hadis hasan sahih.",
        "arabic_text": "وَعَن أبي الدَّرْدَاء قَالَ ك قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَرَأَ ثَلَاثَ آيَاتٍ مِنْ أَوَّلِ الْكَهْفِ عُصِمَ مِنْ فِتْنَةِ الدَّجَّالِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ"
      },
      {
        "id": 30841,
        "hadith_number": "2147",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Surah Ya Sin sebagai Jantung Al-Quran",
        "perawi_melayu": "Anas (ra)",
        "english_text": "Not Available",
        "malay_translation": "Daripada Anas (RA) berkata: Rasulullah SAW bersabda: \"Sesungguhnya bagi setiap sesuatu itu ada jantung, dan jantung Al-Quran ialah Surah Ya Sin. Sesiapa yang membaca Surah Ya Sin, Allah akan mencatatkan baginya pahala membaca Al-Quran sebanyak sepuluh kali.\" Diriwayatkan oleh At-Tirmizi dan Ad-Darimi. Imam At-Tirmizi berkata: Hadith ini adalah gharib.",
        "arabic_text": "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ لِكُلِّ شَيْءٍ قَلْبًا وَقَلْبُ الْقُرْآنِ (يس) وَمَنْ قَرَأَ (يس) كَتَبَ اللَّهُ لَهُ بِقِرَاءَتِهَا قِرَاءَةَ الْقُرْآنِ عَشْرَ مَرَّاتٍ» . رَوَاهُ التِّرْمِذِيُّ وَالدَّارِمِيُّ وَقَالَ التِّرْمِذِيُّ هَذَا حَدِيثٌ غَرِيب"
      },
      {
        "id": 30842,
        "hadith_number": "2148",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Surah Taha dan Yasin",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah رضي الله عنه berkata: Rasulullah ﷺ bersabda: \"Sesungguhnya Allah Tabaraka wa Ta'ala telah membaca (surah) Taha dan Yasin sebelum menciptakan langit dan bumi seribu tahun. Ketika malaikat mendengar Al-Quran (yang dibacakan), mereka berkata: 'Kesejahteraan bagi umat yang diturunkan Al-Quran ini ke atasnya, kesejahteraan bagi perut yang mengandungi (menghafal) Al-Quran ini dan kesejahteraan bagi lidah yang berbicara (membaca) Al-Quran ini.'\" (Riwayat Ad-Darimi)",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَرَأَ (طه) و (يس) قبل أَن يخلق السَّمَوَات وَالْأَرْضَ بِأَلْفِ عَامٍ فَلَمَّا سَمِعَتِ الْمَلَائِكَةُ الْقُرْآنَ قَالَتْ طُوبَى لِأُمَّةٍ يَنْزِلُ هَذَا عَلَيْهَا وَطُوبَى لِأَجْوَافٍ تَحْمِلُ هَذَا وَطُوبَى لِأَلْسِنَةٍ تَتَكَلَّمُ بِهَذَا» . رَوَاهُ الدَّارمِيّ"
      },
      {
        "id": 30843,
        "hadith_number": "2149",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Membaca Surah Ad-Dukhan pada Waktu Malam",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA, bahawa Rasulullah SAW bersabda:",
        "english_text": " وعن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: «من قرأ (حم) الدخان في ليلة أصبح يستغفر له سبعون ألف ملك» . رواه الترمذي وقال: هذا حديث غريب وعمر بن أبي خثعم الراوي يضعف وقال محمد يعني البخاري هو منكر الحديث",
        "malay_translation": "\"Sesiapa yang membaca (Ha Mim) Ad-Dukhan pada waktu malam, maka pada waktu paginya tujuh puluh ribu malaikat akan memohon ampun untuknya.\"  Diriwayatkan oleh At-Tirmidzi dan beliau berkata: Hadis ini gharib dan Umar bin Abi Khath'am sebagai perawi adalah dhaif. Muhammad, iaitu Al-Bukhari berkata: Hadis ini munkar.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَرَأَ (حم) الدُّخَانِ فِي لَيْلَةٍ أَصْبَحَ يَسْتَغْفِرُ لَهُ سَبْعُونَ أَلْفَ مَلَكٍ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيث غَرِيب وَعمر بن أبي خَثْعَمٍ الرَّاوِي يُضَعَّفُ وَقَالَ مُحَمَّدٌ يَعْنِي الْبُخَارِيَّ هُوَ مُنكر الحَدِيث"
      },
      {
        "id": 30844,
        "hadith_number": "2150",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Membaca Surah Ad-Dukhan pada Malam Jumaat",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah رضي الله عنه berkata: Rasulullah ﷺ bersabda: “Sesiapa yang membaca (Surah) Ad-Dukhan pada malam Jumaat, akan diampunkan baginya.” (Riwayat at-Tirmidzi dan beliau berkata: Ini adalah Hadith Gharib dan Hisyam Abu al-Miqdam, perawinya dhaif (lemah).",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَرَأَ (حم) الدُّخَانِ فِي لَيْلَةِ الْجُمْعَةِ غُفِرَ لَهُ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ وَهِشَام أَبُو الْمِقْدَام الرَّاوِي يضعف"
      },
      {
        "id": 30845,
        "hadith_number": "2151",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Membaca Surah Al-Musabbihat Sebelum Tidur",
        "perawi_melayu": "Al-'Irbad bin Sariyah",
        "english_text": "It is narrated from Al-'Irbad bin Sariyah that the Prophet (ﷺ) used to recite Al-Musabbihat (Surahs starting with words which mean 'glorify Allah') before sleeping, saying: \"In them, there is a verse better than a thousand verses.\" (Related by At-Tirmidhi and Abu Dawud)",
        "malay_translation": "Diriwayatkan daripada Al-'Irbad bin Sariyah bahawa Nabi ﷺ selalu membaca surah-surah Al-Musabbihat (surah-surah yang bermula dengan perkataan yang bermaksud 'sucikan Allah') sebelum tidur, baginda bersabda: \"Sesungguhnya di dalamnya terdapat ayat yang lebih baik daripada seribu ayat.\" (Diriwayatkan oleh At-Tirmidzi dan Abu Daud)",
        "arabic_text": "وَعَنِ الْعِرْبَاضِ بْنِ سَارِيَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ الْمُسَبِّحَاتِ قَبْلَ أَنْ يَرْقُدَ يَقُولُ: «إِنَّ فِيهِنَّ آيَةٌ خَيْرٌ مِنْ أَلْفِ آيَةٍ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ"
      },
      {
        "id": 30846,
        "hadith_number": "2152",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Status Hadith Riwayat Al-Darimi dan Penilaian At-Tirmidhi",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "No English translation available.",
        "malay_translation": "Diriwayatkan oleh Ad-Darimi daripada Khalid bin Ma'dan secara mursal. Imam At-Tirmidhi berkata: Hadith ini Hasan Gharib.",
        "arabic_text": "وَرَوَاهُ الدَّارِمِيُّ عَنْ خَالِدِ بْنِ مَعْدَانَ مُرْسَلًا وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ"
      },
      {
        "id": 30847,
        "hadith_number": "2153",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Surah Al-Mulk Memberi Syafaat",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah رضي الله عنه berkata: Rasulullah صلى الله عليه وسلم bersabda: \"Sesungguhnya satu surah dalam Al-Quran yang mengandungi tiga puluh ayat telah memberi syafaat kepada seseorang sehingga dia diampunkan, iaitu (Tabarakallazi bi yadihil mulk)\". (Riwayat Ahmad, At-Tirmizi, Abu Daud, An-Nasai dan Ibnu Majah)",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ سُورَةً فِي الْقُرْآنِ ثَلَاثُونَ آيَةً شَفَعَتْ لِرَجُلٍ حَتَّى غُفِرَ لَهُ وَهِيَ: (تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ) رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَه"
      },
      {
        "id": 30848,
        "hadith_number": "2154",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Surah Al-Mulk dan Kesannya dari Azab Kubur",
        "perawi_melayu": "Ibnu Abbas (RA)",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Abbas RA, berkata: \"Sebahagian sahabat Nabi SAW pernah mendirikan khemah di atas sebuah kubur tanpa menyedari bahawa itu adalah kubur. Tiba-tiba, terdapat seseorang di dalamnya sedang membaca Surah Al-Mulk sehingga selesai. Lalu, beliau datang kepada Nabi SAW dan memberitahunya. Rasulullah SAW bersabda: 'Sesungguhnya surah tersebut (Al-Mulk) adalah penghalang, ia menyelamatkan. Ia menyelamatkannya daripada azab kubur.'\" Hadith riwayat At-Tirmidzi, dan beliau berkata: Ini adalah hadith gharib.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: ضَرَبَ بَعْضِ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خِبَاءَهُ عَلَى قَبْرٍ وَهُوَ لَا يَحْسَبُ أَنَّهُ قَبْرٌ فَإِذَا فِيهِ إِنْسَان يَقْرَأُ سُورَةَ (تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ) حَتَّى خَتَمَهَا فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هِيَ الْمَانِعَةُ هِيَ الْمُنْجِيَةُ تُنْجِيهِ مِنْ عَذَابِ الْقَبْر» . رَوَاهُ التِّرْمِذِيّ وَقَالَ: هَذَا حَدِيث غَرِيب"
      },
      {
        "id": 30849,
        "hadith_number": "2155",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Amalan Nabi SAW Sebelum Tidur",
        "perawi_melayu": "Jabir (RA)",
        "english_text": "Not Available",
        "malay_translation": "Daripada Jabir RA, sesungguhnya Nabi SAW tidak tidur sehingga Baginda membaca: (Alif Laam Miim Tanzil) dan (Tabaraka allazi biyadihil mulk). Diriwayatkan oleh Ahmad, At-Tirmidzi, dan Ad-Darimi. Imam At-Tirmidzi berkata: Ini adalah hadith Sahih. Begitu juga dalam Syarh As-Sunnah. Dan dalam Al-Masabih.",
        "arabic_text": "وَعَنْ جَابِرٌ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَنَامُ حَتَّى يَقْرَأَ: (آلم تَنْزِيل) و (تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ) رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَالدَّارِمِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ صَحِيحٌ. وَكَذَا فِي شرح السّنة. وَفِي المصابيح"
      },
      {
        "id": 30850,
        "hadith_number": "2156",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ganjaran Membaca Surah-Surah Tertentu",
        "perawi_melayu": "Ibnu Abbas dan Anas bin Malik (semoga Allah meredhai mereka)",
        "english_text": "Narrated by Ibn 'Abbas and Anas bin Malik (RA): The Messenger of Allah (peace and blessings of Allah be upon him) said: \"When (Surah) Al-Zilzal is recited, it equals half of the Quran, (Surah) Al-Ikhlas equals a third of the Quran, and (Surah) Al-Kafirun equals a quarter of the Quran.\"",
        "malay_translation": "Diriwayatkan daripada Ibnu Abbas dan Anas bin Malik (semoga Allah meredhai mereka), bahawa Rasulullah SAW bersabda: \"Apabila (Surah) Al-Zilzal dibaca, ia menyamai separuh daripada Al-Quran, (Surah) Al-Ikhlas menyamai sepertiga daripada Al-Quran, dan (Surah) Al-Kafirun menyamai suku daripada Al-Quran.\"",
        "arabic_text": "وَعَن ابْن عَبَّاس وَأنس بن مَالك رَضِيَ اللَّهُ عَنْهُمْ قَالَا: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: (إِذا زلزلت) تعدل نصف الْقُرْآن (قل هُوَ الله أحد) تعدل ثلث الْقُرْآن و (قل يَا أَيُّهَا الْكَافِرُونَ) تَعْدِلُ رُبْعَ الْقُرْآنِ . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 30851,
        "hadith_number": "2157",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Membaca Ayat-ayat Terakhir Surah Al-Hasyr pada Waktu Pagi dan Petang",
        "perawi_melayu": "Ma'qil bin Yasar",
        "english_text": "Narrated Ma'qil bin Yasar that the Prophet (ﷺ) said: \"Whoever says three times in the morning: 'I seek refuge in Allah, the All-Hearing, the All-Knowing, from the accursed Satan,' and then reads three verses from the end of Surah Al-Hashr, Allah appoints seventy thousand angels to send blessings upon him until evening. If he dies on that day, he dies as a martyr. And whoever says it in the evening has the same status.\" (At-Tirmidhi and Ad-Darimi)",
        "malay_translation": "Diriwayatkan daripada Ma'qil bin Yasar bahawa Nabi ﷺ bersabda: \"Barangsiapa yang membaca tiga kali pada waktu pagi: 'Aku berlindung kepada Allah Yang Maha Mendengar lagi Maha Mengetahui daripada syaitan yang terkutuk,' kemudian membaca tiga ayat daripada akhir Surah Al-Hasyr, Allah akan menugaskan tujuh puluh ribu malaikat untuk berselawat ke atasnya sehingga petang. Jika dia meninggal pada hari itu, dia meninggal sebagai seorang syahid. Dan barangsiapa yang membacanya pada waktu petang, maka baginya kedudukan yang sama.\" (Riwayat At-Tirmizi dan Ad-Darimi)",
        "arabic_text": "وَعَنْ مَعْقِلِ بْنِ يَسَارٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: مَنْ قَالَ حِينَ يُصْبِحُ ثَلَاثَ مَرَّاتٍ: أَعُوذُ بِاللَّهِ السَّمِيعِ الْعَلِيمِ مِنَ الشَّيْطَانِ الرَّجِيمِ فَقَرَأَ ثَلَاثَ آيَاتٍ مِنْ آخِرِ سُورَةِ (الْحَشْرِ) وَكَّلَ اللَّهُ بِهِ سَبْعِينَ أَلْفَ مَلَكٍ يُصَلُّونَ عَلَيْهِ حَتَّى يُمْسِيَ وَإِنْ مَاتَ فِي ذَلِكَ الْيَوْمِ مَاتَ شَهِيدًا. وَمَنْ قَالَهَا حِينَ يُمْسِي كَانَ بِتِلْكَ الْمَنْزِلَةِ . رَوَاهُ التِّرْمِذِيُّ وَالدَّارِمِيُّ. وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيبٌ"
      },
      {
        "id": 30852,
        "hadith_number": "2158",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Membaca Surah Al-Ikhlas 200 Kali Sehari",
        "perawi_melayu": "Dari Anas",
        "english_text": "Narrated by Anas that the Prophet (ﷺ) said: 'Whoever recites (Qul Huwa Allahu Ahad) one hundred times every day, all his sins of fifty years will be wiped out except if he owes a debt.'",
        "malay_translation": "Diriwayatkan dari Anas r.a., bahawa Nabi SAW bersabda: 'Sesiapa yang membaca (Qul Huwa Allahu Ahad) sebanyak dua ratus kali setiap hari, akan dihapuskan dosa-dosanya selama lima puluh tahun, kecuali jika dia mempunyai hutang.'",
        "arabic_text": "وَعَنْ أَنَسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قَرَأَ كُلَّ يَوْمٍ مِائَتَيْ مَرَّةٍ (قُلْ هُوَ اللَّهُ أَحَدٌ) مُحِيَ عَنْهُ ذُنُوبُ خَمْسِينَ سَنَةً إِلَّا أَنْ يَكُونَ عَلَيْهِ دَيْنٌ» . رَوَاهُ التِّرْمِذِيُّ وَالدَّارِمِيُّ وَفِي رِوَايَتِهِ «خَمْسِينَ مَرَّةٍ» وَلَمْ يَذْكُرْ «إِلَّا أَنْ يَكُونَ عَلَيْهِ دين»"
      },
      {
        "id": 30853,
        "hadith_number": "2159",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Membaca Surah Al-Ikhlas Sebelum Tidur",
        "perawi_melayu": "Anas (RA)",
        "english_text": "From Anas, the Prophet (peace and blessings of Allah be upon him) said: 'Whoever intends to sleep on his bed and then sleeps on his right side, and then recites Qul Huwa Allahu Ahad (Surah Al-Ikhlas) a hundred times, on the Day of Resurrection, the Lord will say to him: \"O My slave, enter Paradise on your right.\" ' Narrated by At-Tirmidhi, who said: This Hadith is Hasan (good) and Gharib (uncommon).",
        "malay_translation": "Daripada Anas RA, Nabi SAW bersabda: 'Sesiapa yang ingin tidur di atas katilnya, kemudian tidur mengiring di sebelah kanan, lalu membaca Qul Huwa Allahu Ahad (Surah Al-Ikhlas) seratus kali, pada Hari Kiamat, Tuhan akan berfirman kepadanya: \"Wahai hamba-Ku, masuklah ke Syurga melalui sebelah kananmu.\" ' Riwayat At-Tirmizi, beliau berkata: Hadis ini Hasan (baik) dan Gharib (jarang).",
        "arabic_text": "وَعَنْ أَنَسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مِنْ أَرَادَ أَنْ يَنَامَ عَلَى فِرَاشِهِ فَنَامَ عَلَى يَمِينِهِ ثُمَّ قَرَأَ مِائَةَ مَرَّةٍ (قل هُوَ الله أحد) إِذا كَانَ يَوْم الْقِيَامَةِ يَقُولُ لَهُ الرَّبُّ: يَا عَبْدِي ادْخُلْ عَلَى يَمِينِكَ الْجَنَّةَ . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ"
      },
      {
        "id": 30854,
        "hadith_number": "2160",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ganjaran Membaca Surah Al-Ikhlas",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "The Prophet (peace be upon him) heard a man reciting 'Say: He is Allah, the One'. He said, 'It is confirmed.' I said, 'What is confirmed?' He replied, 'Paradise.'",
        "malay_translation": "Rasulullah ﷺ mendengar seorang lelaki membaca (Qul Huwa Allahu Ahad). Baginda bersabda, \"Telah wajib.\" Aku bertanya, \"Apa yang telah wajib?\" Baginda menjawab, \"Syurga.\"",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعَ رَجُلًا يَقْرَأُ (قُلْ هُوَ اللَّهُ أَحَدٌ) فَقَالَ: «وَجَبَتْ» قُلْتُ: وَمَا وَجَبَتْ؟ قَالَ: «الْجنَّة» . رَوَاهُ مَالك وَالتِّرْمِذِيّ وَالنَّسَائِيّ"
      },
      {
        "id": 30855,
        "hadith_number": "2161",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Anjuran Membaca Surah Al-Kafirun Sebelum Tidur",
        "perawi_melayu": "Diriwayatkan daripada Farwah bin Naufal daripada ayahnya, bahawa dia berkata: \"Wahai Rasulullah, ajarkan aku sesuatu yang boleh aku ucapkan apabila aku hendak tidur.\" Baginda bersabda: \"Bacalah (Qul ya ayyuhal kafirun) kerana sesungguhnya ia adalah pembebasan daripada syirik.\"",
        "english_text": "Narrated from Farwah bin Naufal from his father: that he said: O Messenger of Allah, teach me something to say when I go to my bed. He said: Read (Qul ya ayyuhal kafirun) for it is a disavowal of shirk.",
        "malay_translation": "Diriwayatkan daripada Farwah bin Naufal daripada ayahnya: bahawa dia berkata: Wahai Rasulullah, ajarkan aku sesuatu untuk aku ucapkan apabila aku pergi ke tempat tidurku. Baginda bersabda: Bacalah (Qul ya ayyuhal kafirun) kerana sesungguhnya ia adalah pembebasan daripada syirik.",
        "arabic_text": "وَعَنْ فَرْوَةَ بْنِ نَوْفَلٍ عَنْ أَبِيهِ: أَنَّهُ قَالَ: يَا رَسُولَ اللَّهِ عَلِّمْنِي شَيْئًا أَقُولُهُ إِذَا أَوَيْتُ إِلَى فِرَاشِي. فَقَالَ: «اقْرَأْ (قُلْ يَا أَيُّهَا الْكَافِرُونَ) فَإِنَّهَا بَرَاءَةٌ مِنَ الشِّرْكِ» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد والدارمي"
      },
      {
        "id": 30856,
        "hadith_number": "2162",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kelebihan Membaca Surah Al-Falaq dan An-Nas",
        "perawi_melayu": "Uqbah bin Amir",
        "english_text": "Not Available",
        "malay_translation": "Daripada Uqbah bin Amir berkata: Ketika aku berjalan bersama Rasulullah SAW antara Juhfah dan Al-Abwa, tiba-tiba kami diliputi angin dan kegelapan yang sangat kuat. Lalu Rasulullah SAW membaca (A'uzu bi Rabbil-falaq) dan (A'uzu bi Rabbin-Nas) sambil bersabda: \"Wahai Uqbah, bacalah kedua surah ini, kerana tidak ada seorang pun yang memohon perlindungan dengan sesuatu yang seumpama keduanya\". (Riwayat Abu Daud)",
        "arabic_text": "وَعَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ: بَيْنَا أَنَا سير مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ الْجُحْفَةِ وَالْأَبْوَاءِ إِذْ غَشِيَتْنَا رِيحٌ وَظُلْمَةٌ شَدِيدَةٌ فَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَوِّذُ ب (أعوذ بِرَبّ الفلق) و (أعوذ بِرَبِّ النَّاسِ) وَيَقُولُ: «يَا عُقْبَةُ تَعَوَّذْ بِهِمَا فَمَا تَعَوَّذَ مُتَعَوِّذٌ بِمِثْلِهِمَا» . رَوَاهُ أَبُو دَاوُدَ"
      },
      {
        "id": 30857,
        "hadith_number": "2163",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kelebihan Membaca Surah Al-Ikhlas dan Al-Mu'awwidzatain (Al-Falaq dan An-Nas) pada Waktu Pagi dan Petang",
        "perawi_melayu": "Diriwayatkan daripada Abdullah bin Khubaib RA, beliau berkata:",
        "english_text": "Narrated Abdullah bin Khubaib: We went out on a rainy night and in intense darkness to look for the Messenger of Allah (peace and blessings of Allah be upon him). We caught up with him and he said, “Say.” I said, “What shall I say?” He said, “Say: ‘Qul Huwa Allahu Ahad’ (Surah Al-Ikhlas) and Al-Mu'awwidzatain (Surah Al-Falaq and Surah An-Nas) when you enter upon evening and when you enter upon morning three times, and they will suffice you for everything.” Related by Tirmidhi, Abu Dawud and Nasa'i.",
        "malay_translation": "\"Kami keluar pada malam yang hujan dan gelap gelita untuk mencari Rasulullah SAW. Kami bertemu dengan baginda, lalu baginda bersabda, 'Bacalah.' Aku bertanya, 'Apa yang perlu aku baca?' Baginda bersabda, 'Bacalah: 'Qul Huwa Allahu Ahad' (Surah Al-Ikhlas) dan Al-Mu'awwidzatain (Surah Al-Falaq dan Surah An-Nas) ketika kamu berada di waktu petang dan ketika kamu berada di waktu pagi sebanyak tiga kali, nescaya ia mencukupkanmu daripada segala sesuatu.' (Riwayat Tirmizi, Abu Daud dan Nasa'i).\"",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ خَبِيبٍ قَالَ: خَرَجْنَا فِي لَيْلَةِ مَطَرٍ وَظُلْمَةٍ شَدِيدَةٍ نَطْلُبُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَدْرَكْنَاهُ فَقَالَ: «قُلْ» . قُلْتُ مَا أَقُولُ؟ قَالَ: « (قُلْ هُوَ اللَّهُ أَحَدٌ) وَالْمُعَوِّذَتَيْنِ حِينَ تُصْبِحُ وَحِينَ تُمْسِي ثَلَاثَ مَرَّاتٍ تَكْفِيكَ مِنْ كُلِّ شَيْءٍ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ"
      },
      {
        "id": 30858,
        "hadith_number": "2164",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Surah Al-Falaq",
        "perawi_melayu": "Uqbah bin Amir",
        "english_text": "Not Available",
        "malay_translation": "Daripada Uqbah bin Amir berkata: \"Saya berkata, 'Wahai Rasulullah! Bolehkah saya membaca Surah Hud atau Surah Yusuf?' Baginda menjawab: 'Kamu tidak akan membaca sesuatu yang lebih berkesan di sisi Allah daripada (Surah) Qul A'uzu birabbil-falaq.'\" (Riwayat Ahmad, An-Nasai dan Ad-Darimi)",
        "arabic_text": "وَعَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ: قُلْتُ يَا رَسُولَ اللَّهِ أَقْرَأُ سُورَةَ (هُودٍ) أَوْ سُورَةَ (يُوسُفَ) ؟ قَالَ: لَنْ تَقْرَأَ شَيْئًا أَبْلَغَ عِنْدَ اللَّهِ مِنْ (قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ) رَوَاهُ أَحْمد وَالنَّسَائِيّ والدارمي"
      },
      {
        "id": 30859,
        "hadith_number": "2165",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Mempelajari dan Mengamalkan Al-Quran",
        "perawi_melayu": "Abu Hurairah RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah RA, beliau berkata: Rasulullah SAW bersabda: \"Pelajarilah Al-Quran dengan fasih (bermakna), ikutilah keajaibannya, dan keajaibannya itu adalah kewajipan-kewajipannya, dan batasan-batasannya.\" (Riwayat al-Baihaqi dalam Syu'ab al-Iman)",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَعْرِبُوا الْقُرْآنَ وَاتَّبِعُوا غَرَائِبَهُ وَغَرَائِبُهُ فَرَائِضُهُ وَحُدُودُهُ» . رَوَاهُ الْبَيْهَقِيّ فِي شعب الْإِيمَان"
      },
      {
        "id": 30860,
        "hadith_number": "2166",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Membaca Al-Quran dan Amalan Lain",
        "perawi_melayu": "Aisyah رضي الله عنها",
        "english_text": "Not Available",
        "malay_translation": "Daripada Aisyah رضي الله عنها, bahawa Nabi صلى الله عليه وسلم bersabda: \"Membaca Al-Quran dalam solat adalah lebih utama daripada membaca Al-Quran di luar solat, dan membaca Al-Quran di luar solat adalah lebih utama daripada tasbih dan takbir, dan tasbih lebih utama daripada sedekah, dan sedekah lebih utama daripada puasa, dan puasa adalah perisai daripada api neraka.\" Diriwayatkan oleh Al-Baihaqi dalam Syu'ab al-Iman.",
        "arabic_text": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «قِرَاءَةُ الْقُرْآنِ فِي الصَّلَاةِ أَفْضَلُ مِنْ قِرَاءَةِ الْقُرْآنِ فِي غَيْرِ الصَّلَاةِ وَقِرَاءَةُ الْقُرْآنِ فِي غَيْرِ الصَّلَاةِ أَفْضَلُ مِنَ التَّسْبِيحِ وَالتَّكْبِيرِ وَالتَّسْبِيحُ أَفْضَلُ مِنَ الصَّدَقَةِ وَالصَّدَقَةُ أَفْضَلُ مِنَ الصَّوْمِ وَالصَّوْمُ جُنَّةٌ مِنَ النَّارِ» . رَوَاهُ الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ"
      },
      {
        "id": 30861,
        "hadith_number": "2167",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Membaca Al-Quran di Luar dan di Dalam Mushaf",
        "perawi_melayu": "Uthman bin Abdullah bin Aus Ath-Thaqafi dari datuknya",
        "english_text": "Narrated Uthman bin Abdullah bin Aus Ath-Thaqafi from his grandfather: The Messenger of Allah (ﷺ) said: \"The reading of the Qur'an by a man outside of the Mus-haf (copy of the Qur'an) is a thousand degrees, and reading it in the Mus-haf is multiplied to two thousand degrees.\" (Narrated by Al-Bayhaqi in Shu'ab al-Iman).",
        "malay_translation": "Diriwayatkan daripada Uthman bin Abdullah bin Aus Ath-Thaqafi daripada datuknya, bahawa Rasulullah (ﷺ) bersabda: \"Membaca Al-Quran oleh seseorang lelaki di luar Mushaf (salinan Al-Quran) adalah seribu darjat, dan membacanya di dalam Mushaf dilipatgandakan menjadi dua ribu darjat.\" (Diriwayatkan oleh Al-Bayhaqi dalam Shu'ab al-Iman).",
        "arabic_text": "وَعَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ أَوْسٍ الثَّقَفِيِّ عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «قِرَاءَةُ الرَّجُلِ الْقُرْآنَ فِي غَيْرِ الْمُصْحَفِ أَلْفُ دَرَجَةٍ وَقِرَاءَتُهُ فِي الْمُصحف تضعف عل ذَلِك إِلَى ألفي دَرَجَة» . رَوَاهُ الْبَيْهَقِيّ فِي شعب الْإِيمَان"
      },
      {
        "id": 30862,
        "hadith_number": "2168",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hati Berkarat dan Penawarnya",
        "perawi_melayu": "Ibnu Umar RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Umar RA, beliau berkata: Rasulullah SAW bersabda: \"Sesungguhnya hati-hati ini berkarat sebagaimana berkaratnya besi apabila terkena air.\" Baginda ditanya: \"Wahai Rasulullah, apakah penawarnya?\" Baginda menjawab: \"Memperbanyakkan mengingati mati dan membaca Al-Quran.\" Diriwayatkan oleh al-Baihaqi dalam Syu'ab al-Iman.",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ هَذِهِ الْقُلُوبَ تَصْدَأُ كَمَا يَصْدَأُ الْحَدِيدُ إِذَا أَصَابَهُ الْمَاءُ» . قِيلَ يَا رَسُولَ اللَّهِ وَمَا جِلَاؤُهَا؟ قَالَ: «كَثْرَةُ ذِكْرِ الْمَوْتِ وَتِلَاوَةِ الْقُرْآنِ» . رَوَى الْبَيْهَقِيُّ الْأَحَادِيثَ الْأَرْبَعَةَ فِي شُعَبِ الْإِيمَانِ"
      },
      {
        "id": 30863,
        "hadith_number": "2169",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Surah Al-Ikhlas, Ayat Al-Kursi, dan Penutup Surah Al-Baqarah",
        "perawi_melayu": "Tidak dinyatakan (Namun, Hadith diriwayatkan daripada Aify bin Abd Al-Kalai)",
        "english_text": "Not Available",
        "malay_translation": "Daripada Aify bin Abd Al-Kalai, seorang lelaki bertanya, \"Wahai Rasulullah, surah Al-Quran manakah yang paling agung?\" Baginda menjawab, \"(Qul Huwa Allahu Ahad).\" Lelaki itu bertanya lagi, \"Ayat manakah dalam Al-Quran yang paling agung?\" Baginda menjawab, \"Ayat Al-Kursi (Allah, tiada Tuhan melainkan Dia, Yang Hidup, Yang Kekal lagi terus-menerus mengurus (makhluk-Nya)).\" Lelaki itu bertanya lagi, \"Wahai Nabi Allah, ayat manakah yang engkau suka menimpa diri engkau dan umatmu?\" Baginda menjawab, \"Penutup Surah Al-Baqarah kerana sesungguhnya ia adalah daripada khazanah rahmat Allah Taala di bawah Arasy-Nya. Allah telah memberikannya kepada umat ini, dan ia merangkumi semua kebaikan di dunia dan di akhirat.\"\n\n(Diriwayatkan oleh Ad-Darimi)",
        "arabic_text": "وَعَنْ أَيْفَعَ بْنِ عَبْدٍ الْكَلَاعِيِّ قَالَ: قَالَ رَجُلٌ: يَا رَسُولَ اللَّهِ أَيُّ سُورَةِ الْقُرْآنِ أَعْظَمُ؟ قَالَ: (قُلْ هُوَ اللَّهُ أَحَدٌ) قَالَ: فَأَيُّ آيَةٍ فِي الْقُرْآنِ أَعْظَمُ؟ قَالَ: آيَةُ الْكُرْسِيِّ (اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ) قَالَ: فَأَيُّ آيَةٍ يَا نَبِيَّ اللَّهِ تُحِبُّ أَنْ تُصِيبَكَ وَأُمَّتَكَ؟ قَالَ: «خَاتِمَةُ سُورَةِ الْبَقَرَةِ فَإِنَّهَا مِنْ خَزَائِنِ رَحْمَةِ اللَّهِ تَعَالَى مِنْ تَحْتِ عَرْشِهِ أَعْطَاهَا هَذِهِ الْأُمَّةَ لَمْ تتْرك خيرا من يخر الدُّنْيَا وَالْآخِرَةِ إِلَّا اشْتَمَلَتْ عَلَيْهِ» . رَوَاهُ الدَّارِمِيُّ"
      },
      {
        "id": 30864,
        "hadith_number": "2170",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Al-Fatihah Sebagai Penyembuh",
        "perawi_melayu": "Tiada maklumat",
        "english_text": "No English text available.",
        "malay_translation": "Daripada Abdul Malik bin Umair secara mursal, beliau berkata: Rasulullah ﷺ bersabda: “Di dalam Surah Al-Fatihah terdapat penyembuh daripada setiap penyakit.” Diriwayatkan oleh Ad-Darimi dan Al-Baihaqi dalam Syu'abul Iman.",
        "arabic_text": "وَعَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ مُرْسَلًا قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «فِي فَاتِحَةِ الْكِتَابِ شِفَاءٌ مِنْ كُلِّ دَاءٍ» . رَوَاهُ الدَّارمِيّ وَالْبَيْهَقِيّ فِي شعب الْإِيمَان"
      },
      {
        "id": 30865,
        "hadith_number": "2171",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Membaca Ayat Terakhir Surah Ali Imran pada Waktu Malam",
        "perawi_melayu": "Uthman bin Affan RA",
        "english_text": "Narrated by Uthman bin Affan (RA): Whoever recites the last part of Surah Al-Imran in the night, it will be recorded for him as if he has spent the whole night in prayer.  Reported by Ad-Darimi.",
        "malay_translation": "Diriwayatkan daripada Uthman bin Affan RA, beliau berkata: Sesiapa yang membaca bahagian terakhir Surah Ali Imran pada waktu malam, akan dicatat baginya seolah-olah dia telah menghabiskan seluruh malam dengan beribadah (solat).  Riwayat Ad-Darimi.",
        "arabic_text": "وَعَنْ عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ قَالَ: مَنْ قَرَأَ آخِرَ آلِ عِمْرَانَ فِي لَيْلَة كتب لَهُ قيام لَيْلَة. رَوَاهُ الدَّارمِيّ"
      },
      {
        "id": 30866,
        "hadith_number": "2172",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Membaca Surah Ali Imran pada Hari Jumaat",
        "perawi_melayu": "Diriwayatkan daripada Makhul, beliau berkata:",
        "english_text": "Narrated by Makhul: Whoever recites Surah Ali Imran on Friday, the angels will invoke blessings upon him until night. Narrated by Darimi.",
        "malay_translation": "Diriwayatkan daripada Makhul: Sesiapa yang membaca Surah Ali Imran pada hari Jumaat, para malaikat akan berselawat ke atasnya sehingga malam. Riwayat ad-Darimi.",
        "arabic_text": "وَعَنْ مَكْحُولٍ قَالَ: مَنْ قَرَأَ سُورَةَ آلِ عِمْرَانَ يَوْمَ الْجُمُعَةِ صَلَّتْ عَلَيْهِ الْمَلَائِكَةُ إِلَى اللَّيْل. رَوَاهُ الدَّارمِيّ"
      },
      {
        "id": 30867,
        "hadith_number": "2173",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Dua Ayat Terakhir Surah Al-Baqarah",
        "perawi_melayu": "Jabir bin Nufair",
        "english_text": "Narrated by Jubair bin Nufair, that the Messenger of Allah (ﷺ) said: “Allah sealed Surat Al-Baqarah with two verses that I have been given from the treasures under the Throne, so learn them and teach them to your women, for they are Salat (prayer), Qurban (sacrifice), and Dua’ (supplication).” [Reported by Ad-Darimi as Mursal]",
        "malay_translation": "Diriwayatkan daripada Jubair bin Nufair, bahawa Rasulullah SAW bersabda: “Sesungguhnya Allah menutup Surah Al-Baqarah dengan dua ayat yang telah diberikan kepadaku dari perbendaharaan di bawah Arasy, maka pelajarilah kedua ayat itu dan ajarkanlah ia kepada isteri-isterimu, kerana sesungguhnya ia adalah solat (sembahyang), qurban (korban), dan doa.” [Diriwayatkan oleh Ad-Darimi secara mursal]",
        "arabic_text": "وَعَن جُبَير بن نفير رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ اللَّهَ خَتَمَ سُورَةَ الْبَقَرَةِ بِآيَتَيْنِ أُعْطِيتُهُمَا مِنْ كَنْزِهِ الَّذِي تَحْتَ الْعَرْشِ فَتَعَلَّمُوهُنَّ وَعَلِّمُوهُنَّ نِسَاءَكُمْ فَإِنَّهَا صَلَاةٌ وقربان وَدُعَاء» . رَوَاهُ الدِّرَامِي مُرْسلا"
      },
      {
        "id": 30868,
        "hadith_number": "2174",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Anjuran Membaca Surah Hud pada Hari Jumaat",
        "perawi_melayu": "Ka'b RA",
        "english_text": "Narrated by Ka'b (may Allah be pleased with him) that the Messenger of Allah (peace and blessings of Allah be upon him) said: 'Read Surah Hud on Friday.' Related by al-Darimi mursal.",
        "malay_translation": "Diriwayatkan daripada Ka'b RA bahawa Rasulullah SAW bersabda: 'Bacalah Surah Hud pada hari Jumaat.'  Diriwayatkan oleh al-Darimi secara mursal.",
        "arabic_text": "وَعَن كَعْب رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى الله عَلَيْهِ وَسلم قَالَ: «اقرؤوا سُورَة هود يَوْم الْجُمُعَة» . رَوَاهُ الدِّرَامِي مُرْسلا"
      },
      {
        "id": 30869,
        "hadith_number": "2175",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Membaca Surah Al-Kahf pada Hari Jumaat",
        "perawi_melayu": "Abu Sa'id (Semoga Allah meredhainya)",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Sa'id (semoga Allah meredhainya), sesungguhnya Nabi ﷺ bersabda: \"Sesiapa yang membaca Surah Al-Kahf pada hari Jumaat, akan diterangi cahaya baginya di antara dua Jumaat\". Diriwayatkan oleh Al-Baihaqi dalam Ad-Da'awat Al-Kabir.",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «من قَرَأَ سُورَة الْكَهْف فِي يَوْم الْجُمُعَة أَضَاء لَهُ النُّور مَا بَيْنَ الْجُمْعَتَيْنِ» . رَوَاهُ الْبَيْهَقِيُّ فِي الدَّعَوَاتِ الْكَبِير"
      },
      {
        "id": 30870,
        "hadith_number": "2176",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Membaca Surah 'Alif Lam Mim Tanzil' (As-Sajdah)",
        "perawi_melayu": "Khalid bin Ma'dan (رحمه الله)",
        "english_text": "Not Available",
        "malay_translation": "Daripada Khalid bin Ma'dan (rahimahullah) berkata: \"Bacalah surah yang menyelamatkan iaitu (Alif Lam Mim Tanzil/As-Sajdah). Sesungguhnya telah sampai kepadaku, bahawa seorang lelaki membacanya, dan tidak membaca selainnya, dan dia banyak melakukan kesalahan. Lalu surah itu mengembangkan sayapnya ke atasnya dan berkata: 'Ya Rabb, ampunilah dia, kerana sesungguhnya dia selalu membacaku.' Maka Allah Taala memberikan syafaatnya kepadanya dan berfirman: 'Tuliskan baginya setiap kesalahan satu kebaikan, dan angkatlah darjatnya.' Dan dia (Khalid) juga berkata: 'Sesungguhnya ia akan membela pembacanya di dalam kubur, ia berkata: 'Ya Allah, jika aku daripada kitab-Mu, maka berilah syafaat kepadanya, dan jika aku bukan daripada kitab-Mu, maka hapuskanlah aku daripadanya.' Dan sesungguhnya ia akan seperti burung yang membentangkan sayapnya ke atasnya, lalu memberi syafaat kepadanya, dan menghalangnya daripada azab kubur.' Dan dia berkata tentang (Surah) Tabarak (Al-Mulk) yang serupa. Khalid tidak tidur sehingga membaca kedua surah tersebut. Tawus berkata: 'Kedua-duanya lebih utama daripada semua surah di dalam Al-Quran dengan enam puluh kebaikan.' Diriwayatkan oleh Ad-Darimi.",
        "arabic_text": "وَعَن خَالِد بن معدان قَالَ: اقرؤوا المنجية وَهِي (آلم تَنْزِيل) فَإِن بَلَغَنِي أَنَّ رَجُلًا كَانَ يَقْرَؤُهَا مَا يَقْرَأُ شَيْئًا غَيْرَهَا وَكَانَ كَثِيرَ الْخَطَايَا فَنَشَرَتْ جَنَاحَهَا عَلَيْهِ قَالَتْ: رَبِّ اغْفِرْ لَهُ فَإِنَّهُ كَانَ يُكْثِرُ قِرَاءَتِي فَشَفَّعَهَا الرَّبُّ تَعَالَى فِيهِ وَقَالَ: اكْتُبُوا لَهُ بِكُلِّ خَطِيئَةٍ حَسَنَةٍ وَارْفَعُوا لَهُ دَرَجَةً . وَقَالَ أَيْضًا: إِنَّهَا تُجَادِلُ عَنْ صَاحِبِهَا فِي الْقَبْرِ تَقُولُ: اللَّهُمَّ إِنْ كُنْتُ مِنْ كِتَابِكَ فَشَفِّعْنِي فِيهِ وَإِنْ لَمْ أَكُنْ مِنْ كِتَابِكَ فَامْحُنِي عَنْهُ وَإِنَّهَا تَكُونُ كَالطَّيْرِ تَجْعَلُ جَنَاحَهَا عَلَيْهِ فَتَشْفَعُ لَهُ فَتَمْنَعُهُ مِنْ عَذَابِ الْقَبْر وَقَالَ فِي (تبَارك) مثله. وَكَانَ خَالِد لَا يَبِيتُ حَتَّى يَقْرَأَهُمَا. وَقَالَ طَاوُوسُ: فُضِّلَتَا عَلَى كُلِّ سُورَةٍ فِي الْقُرْآنِ بِسِتِّينَ حَسَنَةً. رَوَاهُ الدَّارمِيّ"
      },
      {
        "id": 30871,
        "hadith_number": "2177",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Membaca Surah Yasin di Pagi Hari",
        "perawi_melayu": "Ata' bin Abi Rabah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ata' bin Abi Rabah, katanya: Telah sampai berita kepada saya bahawa Rasulullah ﷺ bersabda: \"Sesiapa yang membaca Surah Yasin pada awal pagi, akan ditunaikan hajatnya.\" Diriwayatkan oleh Ad-Darimi secara mursal.",
        "arabic_text": "وَعَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ قَالَ: بَلَغَنِي أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قَرَأَ (يس) فِي صَدْرِ النَّهَارِ قضيت حَوَائِجه» رَوَاهُ الدَّارمِيّ مُرْسلا"
      },
      {
        "id": 30872,
        "hadith_number": "2178",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Membaca Surah Yasin",
        "perawi_melayu": "Ma'qil bin Yasar Al-Muzani رضي الله عنه",
        "english_text": "The Prophet (ﷺ) said: \"Whoever recites Surah Yasin seeking the pleasure of Allah, will have his past sins forgiven, so recite it over your dead.\"",
        "malay_translation": "Rasulullah ﷺ bersabda: \"Sesiapa yang membaca Surah Yasin dengan mengharapkan keredhaan Allah Ta'ala, akan diampunkan dosa-dosanya yang lalu, maka bacalah ia (Surah Yasin) kepada orang-orang yang hampir mati di kalangan kamu.\"",
        "arabic_text": "وَعَن معقل بن يسَار الْمُزنِيّ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قَرَأَ (يس) ابْتِغَاءَ وَجْهِ اللَّهِ تَعَالَى غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنبه فاقرؤوها عِنْدَ مَوْتَاكُمْ» . رَوَاهُ الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ"
      },
      {
        "id": 30873,
        "hadith_number": "2179",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Surah Al-Baqarah dan Al-Mufassal dalam Al-Quran",
        "perawi_melayu": "Abdullah bin Mas'ud",
        "english_text": "Narrated by Abdullah bin Mas'ud: Verily, everything has a hump, and the hump of the Quran is Surah Al-Baqarah. And verily, everything has a core, and the core of the Quran is Al-Mufassal.",
        "malay_translation": "Diriwayatkan oleh Abdullah bin Mas'ud: Sesungguhnya, segala sesuatu memiliki bonggol, dan bonggol Al-Quran adalah Surah Al-Baqarah. Dan sesungguhnya, segala sesuatu memiliki inti, dan inti Al-Quran adalah Al-Mufassal.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ أَنَّهُ قَالَ: إِنَّ لِكُلِّ شَيْءٍ سَنَامًا وَإِنَّ سَنَامَ الْقُرْآنِ سُورَةُ الْبَقَرَةِ وَإِنَّ لِكُلِّ شَيْءٍ لُبَابًا وَإِنَّ لباب الْقُرْآن الْمفصل. رَوَاهُ الدَّارمِيّ"
      },
      {
        "id": 30874,
        "hadith_number": "2180",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Al-Quran adalah 'Arus (Pengantin) bagi segala sesuatu",
        "perawi_melayu": "Ali Radhiyallahu Anhu",
        "english_text": "Narrated Ali (R.A): I heard the Messenger of Allah (ﷺ) saying: \"Everything has a bride, and the bride of the Quran is Ar-Rahman (i.e., the Surah Ar-Rahman).\" - [Narrated by Al-Baihaqi in Shu'ab al-Iman]",
        "malay_translation": "Diriwayatkan daripada Ali Radhiyallahu Anhu, beliau berkata: Aku mendengar Rasulullah Shallallahu 'alaihi wa sallam bersabda: \"Segala sesuatu mempunyai 'arus (pengantin), dan 'arus (pengantin) Al-Quran ialah Ar-Rahman (iaitu Surah Ar-Rahman).\" - [Diriwayatkan oleh Al-Baihaqi dalam Shu'ab al-Iman]",
        "arabic_text": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يَقُول: «لكل شَيْء عروس وعروس الْقُرْآن الرَّحْمَن» . رَوَاهُ الْبَيْهَقِيّ فِي شعب الْإِيمَان"
      },
      {
        "id": 30875,
        "hadith_number": "2181",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Membaca Surah Al-Waqi'ah Setiap Malam",
        "perawi_melayu": "Daripada Ibnu Mas'ud",
        "english_text": "Narrated Ibn Mas'ud: The Messenger of Allah (ﷺ) said: 'Whoever recites Surat al-Waqi'ah every night will never be afflicted by poverty.' Ibn Mas'ud used to command his daughters to recite it every night.",
        "malay_translation": "Daripada Ibnu Mas'ud رضي الله عنه berkata: Rasulullah ﷺ bersabda: 'Sesiapa yang membaca Surah Al-Waqi'ah pada setiap malam, maka dia tidak akan ditimpa kemiskinan selamanya.' Ibnu Mas'ud memerintahkan anak-anak perempuannya untuk membacanya pada setiap malam.",
        "arabic_text": "وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَرَأَ سُورَةَ الْوَاقِعَةِ فِي كُلِّ لَيْلَةٍ لَمْ تُصِبْهُ فَاقَةٌ أَبَدًا» . وَكَانَ ابْنُ مَسْعُودٍ يَأْمُرُ بَنَاتَهُ يَقْرَأْنَ بهَا فِي كل لَيْلَة. رَوَاهُ الْبَيْهَقِيّ فِي شعب الْإِيمَان"
      },
      {
        "id": 30876,
        "hadith_number": "2182",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kecintaan Rasulullah SAW kepada Surah Al-A'la",
        "perawi_melayu": "Diriwayatkan daripada Ali RA",
        "english_text": "Narrated Ali (RA): The Messenger of Allah (peace and blessings of Allah be upon him) loved this Surah: 'Glorify the Name of your Lord, the Most High.' Related by Ahmad.",
        "malay_translation": "Diriwayatkan daripada Ali RA: Rasulullah SAW menyukai surah ini: 'Sucikanlah nama Tuhanmu Yang Maha Tinggi'. (Surah Al-A'la). Diriwayatkan oleh Ahmad.",
        "arabic_text": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: كَانَ رَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم يجب هَذِهِ السُّورَةَ (سَبِّحِ اسْمِ رَبِّكَ الْأَعْلَى) رَوَاهُ أَحْمد"
      },
      {
        "id": 30877,
        "hadith_number": "2183",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Seorang Lelaki Memohon untuk Diajar Surah Pendek",
        "perawi_melayu": "Abdullah bin Amr",
        "english_text": "Not Available",
        "malay_translation": "Seorang lelaki datang kepada Nabi ﷺ dan berkata, 'Ajarkanlah aku (Al-Quran), wahai Rasulullah!' Baginda bersabda, 'Bacalah tiga surah daripada (alif, lam, ra)'. Lelaki itu berkata, 'Umurku sudah lanjut, hatiku sudah keras, dan lidahku sudah kasar.' Baginda bersabda, 'Bacalah tiga surah daripada (Ha Mim)'. Lelaki itu berkata seperti kata-katanya yang terdahulu. Lelaki itu berkata, 'Wahai Rasulullah, ajarkanlah aku surah yang komprehensif.' Kemudian Rasulullah ﷺ membacakan surah (Apabila bumi digoncangkan) sehingga selesai. Lelaki itu berkata, 'Demi Dia yang mengutusmu dengan kebenaran, aku tidak akan menambahnya (surah) lagi.' Kemudian lelaki itu berpaling. Rasulullah ﷺ bersabda, 'Berjaya lelaki kecil itu,' (diulang) dua kali. Diriwayatkan oleh Ahmad dan Abu Dawud.",
        "arabic_text": "وَعَن عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: أَتَى رَجُلٌ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَقْرِئْنِي يَا رَسُولَ اللَّهِ فَقَالَ: اقْرَأْ ثَلَاثًا مِنْ ذَوَاتِ (ألر) فَقَالَ: كَبُرَتْ سِنِّي وَاشْتَدَّ قَلْبِي وَغَلُظَ لِسَانِي قَالَ: فَاقْرَأْ ثَلَاثًا مِنْ ذَوَاتِ (حم) فَقَالَ مِثْلَ مَقَالَتِهِ. قَالَ الرَّجُلُ: يَا رَسُولَ اللَّهِ أَقْرِئْنِي سُورَةً جَامِعَةً فَأَقْرَأَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ (إِذَا زُلْزِلَتْ الأَرْض) حَتَّى فَرَغَ مِنْهَا فَقَالَ الرَّجُلُ: وَالَّذِي بَعَثَكَ بِالْحَقِّ لَا أَزِيد عَلَيْهَا أبدا ثمَّ أدبر الرَّجُلُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْلَحَ الرُّوَيْجِلُ مَرَّتَيْنِ. رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ"
      },
      {
        "id": 30878,
        "hadith_number": "2184",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Membaca Surah Al-Takathur",
        "perawi_melayu": "Ibnu Umar",
        "english_text": "The Prophet (peace and blessings of Allah be upon him) said: 'Can any of you recite a thousand verses every day?' They said: 'Who can recite a thousand verses every day?' He said: 'Can't one of you recite: 'Alhakum at-Takathur'?",
        "malay_translation": "Rasulullah ﷺ bersabda: 'Tidakkah salah seorang daripada kamu mampu membaca seribu ayat setiap hari?' Mereka berkata: 'Siapakah yang mampu membaca seribu ayat setiap hari?' Baginda bersabda: 'Tidakkah salah seorang daripada kamu mampu membaca: (Alhakum at-Takathur)?'",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَلَا يَسْتَطِيعُ أَحَدُكُمْ أَنْ يَقْرَأَ أَلْفَ آيَةٍ فِي كُلِّ يَوْمٍ؟» قَالُوا: وَمَنْ يَسْتَطِيعُ أَنْ يَقْرَأَ أَلْفَ آيَةٍ فِي كل يَوْم؟ قَالَ: أَمَا يَسْتَطِيعُ أَحَدُكُمْ أَنْ يَقْرَأَ: (أَلْهَاكُمُ التكاثر) ؟) رَوَاهُ الْبَيْهَقِيّ فِي شعب الْإِيمَان"
      },
      {
        "id": 30879,
        "hadith_number": "2185",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ganjaran Membaca Surah Al-Ikhlas",
        "perawi_melayu": "Sa'id bin al-Musayyab (secara mursal)",
        "english_text": "Not Available",
        "malay_translation": "Daripada Sa'id bin al-Musayyab secara mursal, daripada Nabi SAW, Baginda bersabda: \"Sesiapa yang membaca (Qul Huwa Allahu Ahad) sepuluh kali, akan dibina untuknya sebuah istana di syurga. Sesiapa yang membacanya dua puluh kali, akan dibina untuknya dua istana di syurga. Dan sesiapa yang membacanya tiga puluh kali, akan dibina untuknya tiga istana di syurga.\" Lalu Umar bin al-Khattab RA berkata: \"Demi Allah, wahai Rasulullah, jika demikian, sungguh kami akan memperbanyakkan istana-istana kami.\" Maka Rasulullah SAW bersabda: \"Allah Maha Luas (anugerah-Nya daripada itu).\" Diriwayatkan oleh ad-Darimi.",
        "arabic_text": "وَعَنْ سَعِيدِ بْنِ الْمُسَيَّبِ مُرْسَلًا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قَرَأَ (قل هُوَ الله أحد) عشر مَرَّات بني لَهُ بِهَا قَصْرٌ فِي الْجَنَّةِ وَمَنْ قَرَأَ عِشْرِينَ مَرَّةً بُنِي لَهُ بِهَا قَصْرَانِ فِي الْجَنَّةِ وَمَنْ قَرَأَهَا ثَلَاثِينَ مَرَّةً بُنِيَ لَهُ بِهَا ثَلَاثَةُ قُصُورٍ فِي الْجَنَّةِ» . فَقَالَ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ: وَاللَّهِ يَا رَسُولَ اللَّهِ إِذَا لَنُكَثِّرَنَّ قُصُورَنَا. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اللَّهُ أَوْسَعُ من ذَلِك» . رَوَاهُ الدَّارمِيّ"
      },
      {
        "id": 30880,
        "hadith_number": "2186",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ganjaran Membaca Ayat Al-Quran di Malam Hari",
        "perawi_melayu": "Al-Hasan (secara mursal)",
        "english_text": "Reported from Al-Hasan (Mursal): \"Whoever recites one hundred verses in a night, the Quran will not argue with him that night. Whoever recites two hundred verses in a night, the record of the performance of one night's prayer will be written for him. And whoever recites from five hundred to a thousand verses in a night, he will wake up having a Qintar of reward.\" They asked, \"What is a Qintar?\" He said, \"Twelve thousand.\" (Recorded by Ad-Darimi)",
        "malay_translation": "Diriwayatkan daripada Al-Hasan (secara mursal): \"Barangsiapa yang membaca seratus ayat dalam satu malam, maka Al-Quran tidak akan membantahnya pada malam itu. Barangsiapa yang membaca dua ratus ayat dalam satu malam, maka akan dicatatkan baginya pahala solat satu malam. Dan barangsiapa yang membaca daripada lima ratus hingga seribu ayat dalam satu malam, dia akan bangun dalam keadaan mendapat ganjaran satu qintar.\" Mereka bertanya, \"Apakah qintar itu?\" Baginda menjawab, \"Dua belas ribu.\" (Diriwayatkan oleh Ad-Darimi)",
        "arabic_text": "وَعَنِ الْحَسَنِ مُرْسَلًا: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قَرَأَ فِي لَيْلَةٍ مِائَةَ آيَةٍ لَمْ يُحَاجِّهِ الْقُرْآنُ تِلْكَ اللَّيْلَةَ وَمَنْ قَرَأَ فِي لَيْلَةٍ مِائَتَيْ آيَةٍ كُتِبَ لَهُ قُنُوتُ لَيْلَةٍ وَمَنْ قَرَأَ فِي لَيْلَةٍ خَمْسَمِائَةً إِلَى الْأَلْفِ أَصْبَحَ وَلَهُ قِنْطَارٌ مِنَ الْأَجْرِ» . قَالُوا: وَمَا الْقِنْطَارُ؟ قَالَ: «اثْنَا عَشَرَ ألفا» . رَوَاهُ الدِّرَامِي"
      },
      {
        "id": 30881,
        "hadith_number": "2187",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Sentiasa Mengingat dan Memelihara Al-Quran",
        "perawi_melayu": "Diriwayatkan daripada Abu Musa Al-Asy'ari RA, beliau berkata: Rasulullah SAW bersabda:",
        "english_text": "Narrated Abu Musa Al-Ash'ari (RA): The Messenger of Allah (peace and blessings of Allah be upon him) said: \"Keep reciting the Qur'an constantly, for, by Him in Whose Hand my life is, it is more liable to escape than camels which are hobbled.\"",
        "malay_translation": "Diriwayatkan daripada Abu Musa Al-Asy'ari RA, beliau berkata: Rasulullah SAW bersabda: \"Sentiasalah kamu mengingati (membaca dan mempelajari) Al-Quran, kerana demi Zat yang jiwaku berada di tangan-Nya, sesungguhnya ia lebih mudah terlepas (hilang dari ingatan) daripada unta yang terlepas dari ikatannya.\"",
        "arabic_text": "عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَعَاهَدُوا الْقُرْآنَ فَوَالَّذِي نَفْسِي بِيَدِهِ لَهْوَ أَشَدُّ تَفَصِّيًا مِنَ الْإِبِلِ فِي عُقُلِهَا»"
      },
      {
        "id": 30882,
        "hadith_number": "2188",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kejahatan Melupakan Ayat Al-Quran",
        "perawi_melayu": "Ibnu Mas'ud",
        "english_text": "Narrated Ibn Mas'ud: The Messenger of Allah (ﷺ) said: 'How bad it is for one of them to say, 'I have forgotten such and such a verse,' but rather he has been made to forget. So, keep on reciting the Qur'an, for it escapes from the hearts of men more quickly than a camel does.' (Agreed upon). Muslim added: 'After it has been tied up.'",
        "malay_translation": "Daripada Ibnu Mas'ud berkata: Rasulullah ﷺ bersabda: 'Alangkah buruknya seseorang daripada mereka berkata: 'Aku telah lupa ayat sekian-sekian', bahkan dia telah dilupakan. Maka, bacalah Al-Quran selalu, kerana ia lebih cepat terlepas dari dada manusia daripada unta.' (Muttafaqun 'Alaihi). Muslim menambah: 'Setelah ia diikat.'",
        "arabic_text": "وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: بئس مالأحدهم أَنْ يَقُولَ: نَسِيتُ آيَةَ كَيْتَ وَكَيْتَ بَلْ نُسِّيَ وَاسْتَذْكِرُوا الْقُرْآنَ فَإِنَّهُ أَشَدُّ تَفَصِّيًا مِنْ صُدُورِ الرِّجَالِ مِنَ النَّعَمِ . مُتَّفَقٌ عَلَيْهِ. وَزَادَ مُسلم: «بعقلها»"
      },
      {
        "id": 30883,
        "hadith_number": "2189",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perumpamaan Pemilik Al-Quran",
        "perawi_melayu": "Ibnu Umar (RA)",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Umar (RA), bahawa Nabi SAW bersabda: \"Sesungguhnya perumpamaan bagi pemilik Al-Quran itu seperti pemilik unta yang diikat, jika dia menjaganya, dia akan memegangnya; dan jika dia melepaskannya, ia akan pergi.\"",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّمَا مَثَلُ صَاحِبِ الْقُرْآنِ كَمَثَلِ صَاحِبِ الْإِبِلِ الْمُعَقَّلَةِ إِنْ عَاهَدَ عَلَيْهَا أَمْسَكَهَا وَإِنْ أَطْلَقَهَا ذَهَبَتْ»"
      },
      {
        "id": 30884,
        "hadith_number": "2190",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Galakan Membaca Al-Quran dan Meninggalkannya Ketika Berselisih",
        "perawi_melayu": "Jundub bin Abdullah",
        "english_text": "Dari Jundub bin Abdullah, beliau berkata: Rasulullah SAW bersabda: 'Bacalah Al-Quran selagi hati kamu bersatu padu terhadapnya. Apabila kamu berselisih, maka berhentilah daripadanya.'",
        "malay_translation": "Daripada Jundub bin Abdullah RA, beliau berkata: Rasulullah SAW bersabda: 'Bacalah Al-Quran selagi mana hati kamu bersepakat padanya. Apabila kamu berselisih pendapat tentangnya, maka berhentilah daripada membacanya.'",
        "arabic_text": "وَعَنْ جُنْدُبِ بْنِ عَبْدُ اللَّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «اقرؤوا الْقُرْآنَ مَا ائْتَلَفَتْ عَلَيْهِ قُلُوبُكُمْ فَإِذَا اخْتَلَفْتُمْ فَقومُوا عَنهُ»"
      },
      {
        "id": 30885,
        "hadith_number": "2191",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Bacaan Nabi Muhammad SAW: Mad dan Panjang dalam Bacaan",
        "perawi_melayu": "Diriwayatkan daripada Qatadah: Anas ditanya, 'Bagaimanakah bacaan Nabi SAW?' Beliau menjawab, 'Bacaannya adalah mad (panjang). Kemudian beliau membaca: 'Bismillahirrahmanirrahim,' memanjangkan 'Bismillah,' memanjangkan 'Ar-Rahman,' dan memanjangkan 'Ar-Rahim.'",
        "english_text": "Narrated from Qatadah: Anas was asked, 'How was the Prophet's (PBUH) recitation?' He replied, 'It was with madd (elongation). Then he recited: 'Bismillahirrahmanirrahim,' elongating 'Bismillah,' elongating 'Ar-Rahman,' and elongating 'Ar-Rahim.' Related by Bukhari.",
        "malay_translation": "Diriwayatkan daripada Qatadah: Anas ditanya, 'Bagaimanakah bacaan Nabi SAW?' Beliau menjawab, 'Bacaannya adalah dengan mad (panjang). Kemudian beliau membaca: 'Bismillahirrahmanirrahim,' memanjangkan 'Bismillah,' memanjangkan 'Ar-Rahman,' dan memanjangkan 'Ar-Rahim.' (Riwayat Bukhari)",
        "arabic_text": "وَعَنْ قَتَادَةَ قَالَ: سُئِلَ أَنَسٌ: كَيْفَ كَانَتْ قِرَاءَةُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: كَانَت مدا مَدًّا ثُمَّ قَرَأَ: بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ يَمُدُّ بِبَسْمِ اللَّهِ وَيَمُدُّ بِالرَّحْمَنِ وَيَمُدُّ بِالرَّحِيمِ. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 30886,
        "hadith_number": "2192",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Membaguskan Suara dalam Membaca Al-Quran",
        "perawi_melayu": "Diriwayatkan dari Abu Hurairah RA",
        "english_text": "Narrated Abu Hurairah (RA): The Messenger of Allah (peace and blessings of Allah be upon him) said: 'Allah has not listened to anything as He listens to a Prophet reciting the Qur'an in a melodious voice.'",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah RA, Rasulullah SAW bersabda: 'Allah tidak mendengar sesuatu pun seperti Dia mendengar seorang Nabi membaca Al-Quran dengan suara yang merdu.'",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا أَذِنَ اللَّهُ لِشَيْءٍ مَا أَذِنَ لِنَبِيٍّ يَتَغَنَّى بِالْقُرْآنِ»"
      },
      {
        "id": 30887,
        "hadith_number": "2193",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Nabi yang Membacakan Al-Quran dengan Suara Merdu",
        "perawi_melayu": "Abu Hurairah رضي الله عنه",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah رضي الله عنه berkata: Rasulullah صلى الله عليه وسلم bersabda: \"Allah tidak mengizinkan kepada sesuatu pun sebagaimana Dia mengizinkan kepada seorang nabi yang baik suaranya ketika membaca Al-Quran dengan suara yang lantang.\"",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا أَذِنَ اللَّهُ لِشَيْءٍ مَا أَذِنَ لِنَبِيٍّ حَسِنِ الصَّوْتِ بِالْقُرْآنِ يَجْهَرُ بِهِ»"
      },
      {
        "id": 30888,
        "hadith_number": "2194",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kewajipan Membaca Al-Quran dengan Tartil",
        "perawi_melayu": "Abu Hurairah RA",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah RA, berkata: Rasulullah SAW bersabda: \"Bukanlah dari kalangan kami orang yang tidak melagukan bacaan Al-Quran.\" (Riwayat al-Bukhari)",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ مِنَّا مَنْ لَمْ يَتَغَنَّ بِالْقُرْآنِ» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 30889,
        "hadith_number": "2195",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah S.A.W. Meminta Abdullah bin Mas'ud Membacakan Al-Quran",
        "perawi_melayu": "Abdullah bin Mas'ud",
        "english_text": "Narrated by Abdullah ibn Mas'ud: The Messenger of Allah (peace and blessings of Allah be upon him) said to me while he was on the pulpit, \"Recite to me.\" I said, \"Should I recite to you while it was revealed to you?\" He said, \"I like to hear it from someone else.\" So I recited Surat An-Nisa' until I came to this verse (So how will it be when We bring from every nation a witness and We bring you, [O Muhammad], against these [people] as a witness?). He said, \"Enough for now.\" I turned to him and his eyes were shedding tears.",
        "malay_translation": "Diriwayatkan oleh Abdullah bin Mas'ud: Rasulullah S.A.W. bersabda kepadaku ketika baginda berada di atas mimbar, \"Bacakanlah (Al-Quran) kepadaku.\" Aku berkata, \"Patutkah aku membacakannya kepadamu sedangkan ia diturunkan kepadamu?\" Baginda bersabda, \"Sesungguhnya aku suka mendengarnya daripada orang lain.\" Maka aku pun membacakan Surah An-Nisa' sehingga aku sampai kepada ayat ini (Maka bagaimanakah (keadaan orang kafir nanti), apabila Kami datangkan dari tiap-tiap umat seorang saksi (rasul) dan Kami datangkan engkau (Muhammad) sebagai saksi ke atas mereka ini (umatmu)?). Baginda bersabda, \"Cukuplah sekarang.\" Aku menoleh kepadanya dan ternyata kedua matanya mengalirkan air mata.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى الْمِنْبَرِ: «اقْرَأْ عَلَيَّ» . قُلْتُ: أَقْرَأُ عَلَيْكَ وَعَلَيْكَ أُنْزِلَ؟ قَالَ: «إِنِّي أُحِبُّ أَنْ أَسْمَعَهُ مِنْ غَيْرِي» . فَقَرَأْتُ سُورَةَ النِّسَاءِ حَتَّى أَتَيْتُ إِلَى هَذِهِ الْآيَةِ (فَكَيْفَ إِذَا جِئْنَا مِنْ كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَى هَؤُلَاءِ شَهِيدا) قَالَ: «حَسْبُكَ الْآنَ» . فَالْتَفَتُّ إِلَيْهِ فَإِذَا عَيْنَاهُ تَذْرِفَانِ"
      },
      {
        "id": 30890,
        "hadith_number": "2196",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perintah Allah SWT kepada Rasulullah SAW untuk Membacakan Al-Quran kepada Ubay bin Ka'ab RA",
        "perawi_melayu": "Anas RA meriwayatkan bahawa Rasulullah SAW bersabda kepada Ubay bin Ka'ab RA: \"Sesungguhnya Allah memerintahkan aku untuk membacakan Al-Quran kepadamu.\" Ubay bertanya: \"Adakah Allah menyebut namaku kepadamu?\" Baginda bersabda: \"Ya.\" Ubay bertanya lagi: \"Adakah aku disebut di sisi Rabb al-'Alamin?\" Baginda bersabda: \"Ya.\" Maka berlinanglah air matanya. Dalam riwayat lain: \"Sesungguhnya Allah memerintahkan aku untuk membacakan kepadamu (surah Lam Yakunillazina Kafaru).\" Ubay bertanya: \"Adakah Dia menyebut namaku?\" Baginda bersabda: \"Ya.\" Lalu Ubay menangis.",
        "english_text": "Narrated Anas: The Messenger of Allah (ﷺ) said to Ubayy bin Ka'b: 'Allah has commanded me to recite the Qur'an to you.' He said: 'Did Allah mention me by name to you?' He said: 'Yes.' He said: 'And have I been mentioned in the presence of the Lord of the Worlds?' He said: 'Yes.' So his eyes filled with tears. And in another narration: 'Allah commanded me to recite to you (Lam Yakunillazina Kafaru).' He said: 'And did He mention my name?' He said: 'Yes.' So he wept.",
        "malay_translation": "Diriwayatkan daripada Anas RA: Rasulullah SAW bersabda kepada Ubay bin Ka'ab RA: \"Sesungguhnya Allah SWT memerintahkan aku untuk membacakan Al-Quran kepadamu.\" Ubay bertanya: \"Adakah Allah SWT menyebut nama saya kepada engkau?\" Baginda SAW bersabda: \"Ya.\" Ubay berkata: \"Adakah saya disebut di sisi Rabb al-'Alamin (Tuhan Semesta Alam)?\" Baginda SAW bersabda: \"Ya.\" Maka berlinanglah air mata Ubay. Dalam riwayat lain: \"Sesungguhnya Allah SWT memerintahkan aku untuk membacakan kepadamu (surah Lam Yakunillazina Kafaru).\" Ubay bertanya: \"Adakah Dia menyebut nama saya?\" Baginda SAW bersabda: \"Ya.\" Lalu Ubay menangis.",
        "arabic_text": "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأُبَيِّ بْنِ كَعْبٍ: «إِنَّ اللَّهَ أَمَرَنِي أَنْ أَقْرَأَ عَلَيْكَ الْقُرْآنَ» قَالَ: آللَّهُ سَمَّانِي لَكَ؟ قَالَ: «نَعَمْ» . قَالَ: وَقَدْ ذُكِرْتُ عِنْدَ رَبِّ الْعَالَمِينَ؟ قَالَ: «نَعَمْ» . فَذَرَفَتْ عَيْنَاهُ. وَفِي رِوَايَةٍ: إِنَّ اللَّهَ أَمَرَنِي أَنْ أَقْرَأَ عَلَيْكَ (لَمْ يَكُنِ الَّذِينَ كَفَرُوا) قَالَ: وَسَمَّانِي؟ قَالَ: «نَعَمْ» . فَبَكَى"
      },
      {
        "id": 30891,
        "hadith_number": "2197",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Membawa Al-Quran ke Tanah Musuh",
        "perawi_melayu": "Daripada Ibnu Umar",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Umar berkata: Rasulullah SAW melarang daripada membawa Al-Quran ke tanah musuh. (Muttafaq 'Alaih). Dan dalam riwayat Muslim: \"Janganlah kamu membawa Al-Quran kerana sesungguhnya aku tidak merasa aman ia akan sampai ke tangan musuh.\"",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِن يُسَافَرَ بِالْقُرْآنِ إِلَى أَرْضِ الْعَدُوِّ. مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ لِمُسْلِمٍ: «لَا تُسَافِرُوا بِالْقُرْآنِ فَإِنِّي لَا آمن أَن يَنَالهُ الْعَدو»"
      },
      {
        "id": 30892,
        "hadith_number": "2198",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kelebihan Orang Miskin dalam Kalangan Muhajirin",
        "perawi_melayu": "Abu Sa'id al-Khudri",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Sa'id al-Khudri, katanya: \"Aku duduk dalam satu kumpulan daripada golongan Muhajirin yang lemah. Sebahagian daripada mereka menutup diri kerana telanjang, dan seorang pembaca sedang membacakan kepada kami. Tiba-tiba Rasulullah SAW datang. Baginda berdiri di hadapan kami. Apabila Rasulullah SAW berdiri, pembaca itu berhenti, lalu baginda memberi salam, kemudian baginda bertanya: 'Apakah yang kamu lakukan?' Kami menjawab: 'Kami sedang mendengar Kitab Allah.' Baginda bersabda: 'Segala puji bagi Allah yang menjadikan daripada umatku orang-orang yang aku diperintahkan untuk bersabar bersama mereka.'  Kata perawi: Kemudian baginda duduk di tengah-tengah kami untuk menyamaratakan diri baginda bersama kami, kemudian baginda memberi isyarat dengan tangannya seperti ini, lalu mereka membentuk bulatan dan wajah mereka menghadap baginda. Baginda bersabda: 'Bergembiralah wahai golongan fakir Muhajirin dengan cahaya yang sempurna pada Hari Kiamat. Kamu akan masuk syurga sebelum orang kaya dengan perbezaan setengah hari, iaitu lima ratus tahun.'\" Diriwayatkan oleh Abu Daud.",
        "arabic_text": "عَن أبي سعيد الْخُدْرِيّ قَالَ: جَلَست فِي عِصَابَةٍ مِنْ ضُعَفَاءِ الْمُهَاجِرِينَ وَإِنَّ بَعْضَهُمْ لِيَسْتَتِرُ بِبَعْضٍ مِنَ الْعُرْيِ وَقَارِئٌ يَقْرَأُ عَلَيْنَا إِذْ جَاءَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَامَ عَلَيْنَا فَلَمَّا قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَكَتَ الْقَارِئُ فَسَلَّمَ ثُمَّ قَالَ: «مَا كُنْتُمْ تَصْنَعُونَ؟» قُلْنَا: كُنَّا نَسْتَمِعُ إِلَى كتاب الله قَالَ فَقَالَ: «الْحَمْدُ لِلَّهِ الَّذِي جَعَلَ مِنْ أُمَّتِي مَنْ أُمِرْتُ أَنْ أَصْبِرَ نَفْسِي مَعَهُمْ» . قَالَ فَجَلَسَ وَسَطَنَا لِيَعْدِلَ بِنَفْسِهِ فِينَا ثُمَّ قَالَ بِيَدِهِ هَكَذَا فَتَحَلَّقُوا وَبَرَزَتْ وُجُوهُهُمْ لَهُ فَقَالَ: «أَبْشِرُوا يَا مَعْشَرَ صَعَالِيكِ الْمُهَاجِرِينَ بِالنُّورِ التَّامِّ يَوْمَ الْقِيَامَةِ تَدْخُلُونَ الْجَنَّةَ قَبْلَ أَغْنِيَاءِ النَّاسِ بِنصْف يَوْم وَذَاكَ خَمْسمِائَة سنة» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 30893,
        "hadith_number": "2199",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mengindahkan Al-Quran dengan Suara yang Merdu",
        "perawi_melayu": "Diriwayatkan daripada Al-Bara' bin 'Azib RA, bahawa Rasulullah SAW bersabda:",
        "english_text": "Narrated by Al-Bara' bin 'Azib: The Messenger of Allah (peace and blessings of Allah be upon him) said: 'Adorn the Qur'an with your voices.'",
        "malay_translation": "Diriwayatkan daripada Al-Bara' bin 'Azib RA, bahawa Rasulullah SAW bersabda: 'Hiasilah Al-Quran dengan suara-suara kamu yang merdu.'",
        "arabic_text": "وَعَنِ الْبَرَاءِ بْنِ عَازِبٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «زَيِّنُوا الْقُرْآنَ بِأَصْوَاتِكُمْ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ"
      },
      {
        "id": 30894,
        "hadith_number": "2200",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Balasan Melupakan Al-Quran",
        "perawi_melayu": "Sahabat Saad bin Ubadah (RA)",
        "english_text": "The Prophet (ﷺ) said: \"There is no man who recites the Qur'an, then forgets it, except that he will meet Allah on the Day of Resurrection as an ajzam (a person afflicted with leprosy or having a defective mind).\" (Reported by Abu Dawud and al-Darimi).",
        "malay_translation": "Rasulullah (ﷺ) bersabda: \"Tiada seorang pun yang membaca Al-Quran kemudian melupakannya, melainkan dia akan bertemu Allah pada Hari Kiamat sebagai seorang ajzam (seseorang yang terkena penyakit kusta atau mempunyai fikiran yang cacat).\" (Diriwayatkan oleh Abu Daud dan al-Darimi).",
        "arabic_text": "وَعَنْ سَعْدِ بْنِ عُبَادَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «مَا من امْرِئٍ يَقْرَأُ الْقُرْآنَ ثُمَّ يَنْسَاهُ إِلَّا لَقِيَ اللَّهَ يَوْمَ الْقِيَامَةِ أَجْذَمَ» . رَوَاهُ أَبُو دَاوُدَ والدارمي"
      },
      {
        "id": 30895,
        "hadith_number": "2201",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Membaca Al-Quran Kurang Daripada Tiga Hari",
        "perawi_melayu": "Abdullah bin Amr",
        "english_text": "The Prophet (ﷺ) said: \"He who reads the Qur'an in less than three days does not understand it.\"",
        "malay_translation": "Rasulullah (ﷺ) bersabda: \"Sesiapa yang membaca Al-Quran dalam masa kurang daripada tiga hari, maka dia tidak memahaminya.\"",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَمْ يَفْقَهْ مَنْ قَرَأَ الْقُرْآنَ فِي أَقَلَّ مِنْ ثَلَاث» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد والدارمي"
      },
      {
        "id": 30896,
        "hadith_number": "2202",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Membaca Al-Quran Secara Terang-terangan dan Secara Rahsia",
        "perawi_melayu": "Uqbah bin Amir",
        "english_text": "Dari 'Uqbah bin Amir, beliau berkata: Rasulullah SAW bersabda: \"Orang yang membaca Al-Quran dengan terang-terangan adalah seperti orang yang bersedekah secara terang-terangan, dan orang yang membaca Al-Quran secara rahsia adalah seperti orang yang bersedekah secara rahsia.\" Riwayat Tirmizi, Abu Daud dan Nasai. Tirmizi berkata: Hadis ini hasan gharib.",
        "malay_translation": "Daripada Uqbah bin Amir RA, beliau berkata: Rasulullah SAW bersabda: \"Orang yang membaca Al-Quran dengan jelas (terang-terangan) adalah seperti orang yang bersedekah dengan jelas, dan orang yang membaca Al-Quran secara perlahan (rahsia) adalah seperti orang yang bersedekah secara rahsia.\"  Riwayat at-Tirmizi, Abu Daud dan an-Nasa'i. At-Tirmizi berkata: Hadis ini adalah Hasan Gharib.",
        "arabic_text": "وَعَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْجَاهِرُ بِالْقُرْآنِ كالجاهر بِالصَّدَقَةِ ولامسر بِالْقُرْآنِ كَالْمُسِرِّ بِالصَّدَقَةِ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ"
      },
      {
        "id": 30897,
        "hadith_number": "2203",
        "status": "Sahih (menurut Al-Tirmidzi, namun sanadnya tidak kuat)",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keimanan dan Penghalalan Perkara Haram",
        "perawi_melayu": "Suhayb (RA)",
        "english_text": "Not Available",
        "malay_translation": "Daripada Suhayb (RA) berkata: Rasulullah SAW bersabda: \"Tidak beriman dengan Al-Quran orang yang menghalalkan perkara-perkara yang diharamkan.\" (Riwayat At-Tirmidzi, beliau berkata: Hadith ini sanadnya tidak kuat).",
        "arabic_text": "وَعَنْ صُهَيْبٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا آمَنَ بِالْقُرْآنِ مَنِ اسْتَحَلَّ مَحَارِمَهُ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ لَيْسَ إِسْنَادُهُ بِالْقَوِيّ"
      },
      {
        "id": 30898,
        "hadith_number": "2204",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Penerangan Bacaan Nabi Muhammad SAW yang Jelas dan Terperinci",
        "perawi_melayu": "Diriwayatkan daripada Al-Laith bin Saad daripada Ibnu Abi Mulaikah daripada Ya'la bin Mumallak bahawa dia bertanya kepada Ummu Salamah tentang bacaan Nabi SAW. Maka, beliau menerangkan bacaan yang jelas, huruf demi huruf.",
        "english_text": "Narrated by Al-Laith bin Sa'd from Ibn Abi Mulaikah from Ya'la bin Mumallak that he asked Umm Salamah about the recitation of the Prophet (PBUH). So she was describing a clear recitation, letter by letter. Related by Tirmidhi, Abu Dawood and Nasai.",
        "malay_translation": "Diriwayatkan oleh Al-Laith bin Sa'd daripada Ibnu Abi Mulaikah daripada Ya'la bin Mumallak bahawa dia bertanya kepada Ummu Salamah tentang bacaan Nabi SAW. Maka, beliau menerangkan bacaan yang jelas, huruf demi huruf.  Diriwayatkan oleh Tirmidzi, Abu Daud dan Nasai.",
        "arabic_text": "وَعَنِ اللَّيْثِ بْنِ سَعْدٍ عَنِ ابْنِ أَبِي مليكَة عَنْ يَعْلَى بْنِ مُمَلَّكٍ أَنَّهُ سَأَلَ أُمَّ سَلَمَةَ عَنْ قِرَاءَةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا هِيَ تَنْعَتُ قِرَاءَةً مُفَسَّرَةً حَرْفًا حَرْفًا. رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد وَالنَّسَائِيّ"
      },
      {
        "id": 30899,
        "hadith_number": "2205",
        "status": "Sahih (Menurut al-Tirmizi, sanadnya tidak bersambung, tetapi hadis riwayat al-Laith adalah sahih)",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Cara Bacaan Rasulullah ﷺ (Memutuskan Bacaan)",
        "perawi_melayu": "Ummu Salamah (رَضِيَ اللَّهُ عَنْهَا)",
        "english_text": "The English text is not available for this Hadith.",
        "malay_translation": "Daripada Ibnu Juraij, daripada Ibnu Abi Mulaikah, daripada Ummu Salamah رَضِيَ اللَّهُ عَنْهَا, berkata: \"Adalah Rasulullah ﷺ memutus-mutuskan bacaannya. Baginda membaca: 'Alhamdulillahi Rabbil 'Alamin' kemudian berhenti, kemudian membaca: 'Ar-Rahmanir-Rahim' kemudian berhenti.\" Riwayat al-Tirmizi dan berkata: \"Sanadnya tidak bersambung kerana al-Laith meriwayatkan hadis ini daripada Ibnu Abi Mulaikah, daripada Ya'la bin Mamlak, daripada Ummu Salamah. Dan hadis al-Laith adalah lebih sahih.\" (Hadis ini menjelaskan cara bacaan Rasulullah ﷺ yang memutus-mutuskan bacaan untuk memberi penekanan dan penghayatan.)",
        "arabic_text": "وَعَنِ ابْنِ جُرَيْجٍ عَنِ ابْنِ أَبِي مُلَيْكَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَطِّعُ قِرَاءَتَهُ يَقُولُ: الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ ثُمَّ يَقِفُ ثُمَّ يَقُولُ: الرَّحْمَنِ الرَّحِيمِ ثُمَّ يَقِفُ. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: لَيْسَ إِسْنَادُهُ بِمُتَّصِلٍ لِأَنَّ اللَّيْثَ رَوَى هَذَا الْحَدِيثَ عَنِ ابْنِ أَبِي مُلَيْكَةَ عَنْ يَعْلَى بْنِ مَمْلَكٍ عَنْ أُمِّ سَلَمَةَ وَحَدِيثُ اللَّيْث أصح"
      },
      {
        "id": 30900,
        "hadith_number": "2206",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Membaca Al-Quran dan Ancaman Terhadap Mereka yang Tergesa-gesa dalam Membacanya",
        "perawi_melayu": "Diriwayatkan daripada Jabir RA, katanya: Rasulullah SAW keluar menemui kami ketika kami sedang membaca Al-Quran, dan di antara kami ada orang Arab dan bukan Arab. Baginda bersabda: 'Bacalah, kerana setiap (bacaan) itu baik. Dan akan datang kaum yang mendirikan (membaca) Al-Quran sebagaimana didirikannya anak panah, mereka tergesa-gesa dengannya dan tidak menangguhkannya.'",
        "english_text": "Narrated Jabir: The Messenger of Allah (peace and blessings of Allah be upon him) came out to us while we were reading the Qur'an, and among us were Arabs and non-Arabs. He said: Read, for each is good. And there will come people who will establish it as the arrow is established, they hasten it and do not postpone it.",
        "malay_translation": "Diriwayatkan daripada Jabir RA: Rasulullah SAW keluar menemui kami ketika kami sedang membaca Al-Quran, dan di antara kami ada orang Arab dan bukan Arab. Baginda bersabda: 'Bacalah, kerana setiap (bacaan) itu baik. Dan akan datang kaum yang mendirikan (membaca) Al-Quran sebagaimana didirikannya anak panah, mereka tergesa-gesa dengannya dan tidak menangguhkannya.'",
        "arabic_text": "عَنْ جَابِرٍ قَالَ: خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ نَقْرَأُ الْقُرْآنَ وَفينَا الْأَعرَابِي والأعجمي قَالَ: «اقرؤوا فَكُلٌّ حَسَنٌ وَسَيَجِيءُ أَقْوَامٌ يُقِيمُونَهُ كَمَا يُقَامُ الْقِدْحُ يَتَعَجَّلُونَهُ وَلَا يَتَأَجَّلُونَهُ» . رَوَاهُ أَبُو دَاوُدَ وَالْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ"
      },
      {
        "id": 30901,
        "hadith_number": "2207",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Membaca Al-Quran dengan Lagu dan Suara Arab yang Betul",
        "perawi_melayu": "Diriwayatkan dari Huzaifah RA, Rasulullah SAW bersabda:",
        "english_text": "وعن حذيفة قال: قال رسول الله صلى الله عليه وسلم: «اقرؤوا القرآن بلحون العرب وأصواتها وإياكم ولحون أهل العشق ولحون أهل الكتابين وسيجي بعدي قوم يرجعون بالقرآن ترجع الغناء والنوح لا يجاوز حناجرهم مفتونة قلوبهم وقلوب الذين يعجبهم شأنهم» . رواه البيهقي في شعب الإيمان",
        "malay_translation": "Diriwayatkan dari Huzaifah RA, Rasulullah SAW bersabda: “Bacalah Al-Quran dengan lagu dan suara orang Arab, dan jauhilah lagu orang yang asyik (cinta dunia) dan lagu ahli kitab. Akan datang setelahku kaum yang membaca Al-Quran seperti nyanyian dan ratapan, tidak melewati kerongkongan mereka. Hati mereka dan hati orang-orang yang menyukai keadaan mereka itu telah terfitnah.” (Riwayat Al-Baihaqi dalam Syu'ab Al-Iman).",
        "arabic_text": "وَعَنْ حُذَيْفَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «اقرؤوا الْقُرْآنَ بِلُحُونِ الْعَرَبِ وَأَصْوَاتِهَا وَإِيَّاكُمْ وَلُحُونَ أَهْلِ الْعِشْق وَلُحُون أهل الْكِتَابَيْنِ وسيجي بعدِي قوم يرجعُونَ بِالْقُرْآنِ ترجع الْغِنَاءِ وَالنَّوْحِ لَا يُجَاوِزُ حَنَاجِرَهُمْ مَفْتُونَهٌ قُلُوبُهُمْ وَقُلُوبُ الَّذِينَ يُعْجِبُهُمْ شَأْنُهُمْ» . رَوَاهُ الْبَيْهَقِيُّ فِي شعب الْإِيمَان"
      },
      {
        "id": 30902,
        "hadith_number": "2208",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Memperelok Bacaan Al-Quran dengan Suara yang Merdu",
        "perawi_melayu": "Al-Bara' bin Azib RA",
        "english_text": "وعن البراء بن عازب رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: «حسنوا القرآن بأصواتكم فإن الصوت الحسن يزيد القرآن حسنا» . رواه الدارمي",
        "malay_translation": "Daripada Al-Bara' bin Azib RA, beliau berkata: Saya mendengar Rasulullah SAW bersabda: “Perelokkanlah bacaan Al-Quran dengan suara kamu, kerana sesungguhnya suara yang merdu itu menambah keindahan Al-Quran.” (Riwayat ad-Darimi)",
        "arabic_text": "وَعَنِ الْبَرَاءِ بْنِ عَازِبٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «حَسِّنُوا الْقُرْآنَ بِأَصْوَاتِكُمْ فَإِنَّ الصَّوْتَ الْحَسَنَ يُزِيدُ الْقُرْآنَ حُسْنًا» . رَوَاهُ الدَّارمِيّ"
      },
      {
        "id": 30903,
        "hadith_number": "2209",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Orang yang Membaca al-Quran dengan Suara yang Paling Baik",
        "perawi_melayu": "Ta'us (secara mursal)",
        "english_text": "The Prophet (ﷺ) was asked: \"Who among the people has the most beautiful voice for reciting the Qur'an and the best recitation?\" He said: \"One who, when you hear him reciting, you think he fears Allah.\" Ta'us said: \"Talaq was like that.\"",
        "malay_translation": "Nabi (ﷺ) ditanya: \"Siapakah di antara manusia yang mempunyai suara yang paling merdu untuk membaca al-Quran dan bacaan yang terbaik?\" Baginda bersabda: \"Orang yang, apabila kamu mendengarnya membaca, kamu berpendapat bahawa dia takut kepada Allah.\" Ta'us berkata: \"Talaq adalah seperti itu.\"",
        "arabic_text": "وَعَنْ طَاوُوسٍ مُرْسَلًا قَالَ: سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَيُّ النَّاسِ أَحْسَنُ صَوْتًا لِلْقُرْآنِ؟ وَأَحْسَنُ قِرَاءَةً؟ قَالَ: «مَنْ إِذَا سَمِعْتَهُ يقْرَأ أَرَأَيْت أَنَّهُ يَخْشَى اللَّهَ» . قَالَ طَاوُوسٌ: وَكَانَ طَلْقٌ كَذَلِك. رَوَاهُ الدَّارمِيّ"
      },
      {
        "id": 30904,
        "hadith_number": "2210",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nasihat Rasulullah ﷺ kepada Ahli al-Quran",
        "perawi_melayu": "Ubaidah al-Mulaiki (Semoga Allah meredhainya)",
        "english_text": "Ubaidah al-Mulaiki (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, 'O people of the Quran, do not take the Quran as a pillow, and recite it as it should be recited, during the hours of the night and the day. Spread it and sing with it, and reflect upon what is in it, so that you may be successful. And do not hasten in receiving its reward, for there is a reward for it.'",
        "malay_translation": "Daripada Ubaidah al-Mulaiki (Semoga Allah meredhainya) berkata: Rasulullah ﷺ bersabda: “Wahai ahli al-Quran, janganlah menjadikan al-Quran sebagai bantal, dan bacalah ia dengan bacaan yang sebenar, pada waktu malam dan siang. Sebarkanlah dan nyanyikannya, dan renungkanlah apa yang ada di dalamnya, supaya kamu berjaya. Dan janganlah terburu-buru untuk menerima ganjarannya, kerana sesungguhnya ada ganjaran baginya.”",
        "arabic_text": "وَعَنْ عُبَيْدَةَ الْمُلَيْكِيِّ وَكَانَتْ لَهُ صُحْبَةٌ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا أَهْلَ الْقُرْآنِ لَا تَتَوَسَّدُوا الْقُرْآنَ وَاتْلُوهُ حَقَّ تِلَاوَتِهِ مِنْ آنَاءِ اللَّيْلِ وَالنَّهَارِ وَأَفْشُوهُ وَتَغَنُّوهُ وَتَدَبَّرُوا مَا فِيهِ لَعَلَّكُمْ تُفْلِحُونَ وَلَا تَعْجَلُوا ثَوَابَهُ فَإِنَّ لَهُ ثَوَابًا» . رَوَاهُ الْبَيْهَقِيُّ فِي شعب الْإِيمَان"
      },
      {
        "id": 30905,
        "hadith_number": "2211",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Al-Quran Diturunkan dalam Tujuh Dialek",
        "perawi_melayu": "Umar bin Al-Khattab رضي الله عنه",
        "english_text": "Not Available",
        "malay_translation": "Daripada Umar bin Al-Khattab رضي الله عنه, beliau berkata: \"Aku mendengar Hisyam bin Hakim bin Hizam membaca Surah Al-Furqan dengan cara yang berbeza daripada cara aku membacanya. Padahal Rasulullah صلى الله عليه وسلم telah mengajarku (surah) itu. Hampir sahaja aku (hendak) menghukumnya, kemudian aku menunggunya sehingga dia selesai (solat). Kemudian aku menariknya dengan selendangnya dan membawanya kepada Rasulullah صلى الله عليه وسلم. Aku berkata: 'Wahai Rasulullah, sesungguhnya aku mendengar orang ini membaca Surah Al-Furqan dengan cara yang berbeza daripada cara engkau mengajarku.' Rasulullah صلى الله عليه وسلم bersabda: 'Lepaskan dia, bacalah!' Lalu aku membaca sebagaimana cara aku mendengarnya membaca. Maka Rasulullah صلى الله عليه وسلم bersabda: 'Begitulah ia diturunkan.' Kemudian baginda berkata kepadaku: 'Bacalah!' Lalu aku membaca. Maka Rasulullah صلى الله عليه وسلم bersabda: 'Begitulah ia diturunkan. Sesungguhnya Al-Quran diturunkan dalam tujuh dialek, maka bacalah apa yang mudah daripadanya.'\" Muttafaqun 'Alaihi. Lafazh ini adalah daripada Muslim.",
        "arabic_text": "وَعَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ هِشَامَ بْنَ حَكِيمِ بْنِ حِزَامٍ يقْرَأ سُورَة الْفرْقَان على غير مَا أقرؤوها. وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْرَأَنِيهَا فَكِدْتُ أَنْ أَعْجَلَ عَلَيْهِ ثُمَّ أَمْهَلْتُهُ حَتَّى انْصَرَفَ ثُمَّ لَبَّبْتُهُ بِرِدَائِهِ فَجِئْتُ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. فَقلت يَا رَسُولَ اللَّهِ إِنِّي سَمِعْتُ هَذَا يَقْرَأُ سُورَةَ الْفُرْقَانِ عَلَى غَيْرِ مَا أَقْرَأْتَنِيهَا. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَرْسِلْهُ اقْرَأ فَقَرَأت الْقِرَاءَةَ الَّتِي سَمِعْتُهُ يَقْرَأُ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَكَذَا أُنْزِلَتْ» . ثُمَّ قَالَ لي: «اقْرَأ» . فَقَرَأت. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَكَذَا أنزلت إِن الْقُرْآنَ أُنْزِلَ عَلَى سَبْعَةِ أَحْرُفٍ فَاقْرَءُوا مَا تيَسّر مِنْهُ» . مُتَّفق عَلَيْهِ. وَاللَّفْظ لمُسلم"
      },
      {
        "id": 30906,
        "hadith_number": "2212",
        "status": "Sahih (Sahih)",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kebaikan Kedua Pembaca dan Larangan Perbezaan Pendapat",
        "perawi_melayu": "Daripada Ibnu Mas'ud (Semoga Allah meredhainya)",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Mas'ud (Semoga Allah meredhainya) berkata: \"Aku mendengar seorang lelaki membaca (Al-Quran), dan aku juga mendengar Nabi SAW membaca (ayat yang sama) tetapi berbeza (lafaznya). Aku kemudian membawa lelaki itu kepada Nabi SAW dan memberitahu baginda. Aku melihat riak ketidakselesaan pada wajah baginda. Lalu baginda bersabda: 'Kamu berdua adalah baik (dalam bacaan kamu), maka janganlah kamu berselisih. Sesungguhnya orang-orang sebelum kamu berselisih pendapat, lalu mereka binasa.'\" (Riwayat al-Bukhari)",
        "arabic_text": "وَعَنِ ابْنِ مَسْعُودٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَجُلًا قَرَأَ وَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ خِلَافَهَا فَجِئْتُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرْتُهُ فَعَرَفْتُ فِي وَجهه الْكَرَاهِيَة فَقَالَ: «كِلَاكُمَا مُحْسِنٌ فَلَا تَخْتَلِفُوا فَإِنَّ مَنْ كَانَ قبلكُمْ اخْتلفُوا فهلكوا» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 30907,
        "hadith_number": "2213",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kebenaran Pelbagai Bacaan Al-Quran dan Permintaan Syafaat Nabi ﷺ",
        "perawi_melayu": "Ubay bin Ka'ab",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ubay bin Ka'ab berkata: \"Aku berada di dalam masjid, lalu masuklah seorang lelaki yang sedang menunaikan solat, kemudian dia membaca dengan bacaan yang aku ingkari. Kemudian masuk pula seorang lelaki lain, lalu membaca dengan bacaan selain bacaan kawannya. Setelah kami selesai menunaikan solat, kami semua menemui Rasulullah ﷺ. Aku berkata, 'Sesungguhnya lelaki ini membaca dengan bacaan yang aku ingkari,' dan seorang lagi membaca selain bacaan kawannya. Kemudian Nabi ﷺ menyuruh mereka berdua membaca, lalu Baginda memuji bacaan mereka. Maka terdetik di dalam hatiku keraguan yang aku tidak pernah rasakan sebelum zaman jahiliyyah. Apabila Rasulullah ﷺ melihat apa yang menimpaku, Baginda menepuk dadaku, lalu aku berpeluh sehingga seolah-olah aku melihat Allah ﷻ. Baginda ﷺ berkata kepadaku, 'Wahai Ubay, aku telah diwahyukan untuk membaca Al-Quran dalam satu cara bacaan. Aku memohon kepada-Nya agar diringankan kepada umatku. Kemudian Dia mewahyukan kepadaku yang kedua kalinya, 'Bacalah ia dalam dua cara bacaan.' Aku memohon kepada-Nya agar diringankan kepada umatku. Kemudian Dia mewahyukan kepadaku yang ketiga kalinya, 'Bacalah ia dalam tujuh cara bacaan.' Dan bagimu dengan setiap kali permintaanmu itu, ada satu permintaan yang boleh kamu pinta daripada-Ku.' Aku berkata, 'Ya Allah, ampunilah umatku. Ya Allah, ampunilah umatku.' Aku menangguhkan yang ketiga untuk hari di mana semua makhluk akan mengharapkannya, termasuk Ibrahim عليه السلام.\" (Riwayat Muslim)",
        "arabic_text": "وَعَنْ أُبَيِّ بْنِ كَعْبٍ قَالَ: كُنْتُ فِي الْمَسْجِدِ فَدَخَلَ رَجُلٌ يُصَلِّي فَقَرَأَ قِرَاءَةً أَنْكَرْتُهَا عَلَيْهِ ثُمَّ دَخَلَ آخَرُ فَقَرَأَ قِرَاءَةً سِوَى قِرَاءَةِ صَاحِبِهِ فَلَمَّا قَضَيْنَا الصَّلَاةَ دَخَلْنَا جَمِيعًا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ إِنَّ هَذَا قَرَأَ قِرَاءَةً أَنْكَرْتُهَا عَلَيْهِ وَدخل آخر فَقَرَأَ سوى قِرَاءَة صَاحبه فَأَمَرَهُمَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَرَآ فَحَسَّنَ شَأْنَهُمَا فَسَقَطَ فِي نَفْسِي مِنَ التَّكْذِيبِ وَلَا إِذْ كُنْتُ فِي الْجَاهِلِيَّةِ فَلَمَّا رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا قَدْ غَشِيَنِي ضَرَبَ فِي صَدْرِي فَفِضْت عَرَقًا وكأنما أنظر إِلَى الله عز وَجل فَرَقَا فَقَالَ لِي: «يَا أُبَيُّ أُرْسِلَ إِلَيَّ أَن اقْرَأِ الْقُرْآنَ عَلَى حَرْفٍ فَرَدَدْتُ إِلَيْهِ أَنْ هَوِّنْ عَلَى أُمَّتِي فَرَدَّ إِلَيَّ الثَّانِيَةَ اقْرَأْهُ عَلَى حَرْفَيْنِ فَرَدَّدَتْ إِلَيْهِ أَنْ هَوِّنْ عَلَى أُمَّتِي فَرَدَّ إِلَيَّ الثَّالِثَةِ اقْرَأْهُ عَلَى سَبْعَةِ أَحْرُفٍ وَلَكَ بِكُلِّ رَدَّةٍ رَدَدْتُكَهَا مَسْأَلَةٌ تَسْأَلُنِيهَا فَقُلْتُ اللَّهُمَّ اغْفِرْ لِأُمَّتِي اللَّهُمَّ اغْفِرْ لِأُمَّتِي وَأَخَّرْتُ الثَّالِثَةَ لِيَوْمٍ يَرْغَبُ إِلَيَّ الْخَلْقُ كُلُّهُمْ حَتَّى إِبْرَاهِيم صلى الله عَلَيْهِ وَسلم» . رَوَاهُ مُسلم"
      },
      {
        "id": 30908,
        "hadith_number": "2214",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Al-Quran Diturunkan dalam Tujuh Dialek (Ahruf)",
        "perawi_melayu": "Ibnu Abbas RA",
        "english_text": " وعن ابن عباس رضي الله عنهما قال: إن رسول الله صلى الله عليه وسلم قال: «أقرأني جبريل على حرف فراجعه فلم أزل استزيده ويزيدني حتى انتهى إلى سبعة أحرف» . قال ابن شهاب: بلغني أن تلك السبعة الأحرف إنما هي في الأمر تكون واحدا لا تختلف في حلال ولا حرام",
        "malay_translation": "Daripada Ibnu Abbas RA berkata: Sesungguhnya Rasulullah SAW bersabda: \"Jibril membacakan kepadaku dengan satu huruf, maka aku terus memintanya untuk menambah, dan dia terus menambahkanku sehingga berakhir kepada tujuh huruf.\" Ibnu Syihab berkata: Telah sampai kepadaku bahawa tujuh huruf tersebut hanyalah dalam perkara (perintah) yang menjadi satu, tidak berbeza dalam halal dan haram.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَقْرَأَنِي جِبْرِيل على حرف فَرَاجعه فَلم أزل استزيده ويزيدني حَتَّى انْتهى إِلَى سَبْعَةِ أَحْرُفٍ» . قَالَ ابْنُ شِهَابٍ: بَلَغَنِي أَنَّ تِلْكَ السَّبْعَةَ الْأَحْرُفَ إِنَّمَا هِيَ فِي الْأَمْرِ تَكُونُ وَاحِدًا لَا تَخْتَلِفُ فِي حَلَالٍ وَلَا حرَام"
      },
      {
        "id": 30909,
        "hadith_number": "2215",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Al-Quran Diturunkan dalam Tujuh Dialek",
        "perawi_melayu": "Ubayy bin Ka'b رضي الله عنه",
        "english_text": "The Prophet (peace and blessings of Allah be upon him) met Gabriel and said: 'O Gabriel! I have been sent to an unlettered people, among whom are the old woman, the old man, the boy, the girl, and the man who never read a book.' Gabriel said: 'O Muhammad! The Quran has been revealed in seven dialects.' (Narrated by At-Tirmidhi). In a narration by Ahmad and Abu Dawud, it states: 'All of them are sufficient and healing.' In a narration by An-Nasa'i, he said: 'Gabriel and Michael came to me, and Gabriel sat on my right and Michael on my left. Gabriel said: Recite the Quran in one dialect. Michael said: Ask for more, until it reached seven dialects, and every dialect is sufficient and healing.'",
        "malay_translation": "Daripada Ubayy bin Ka'b رضي الله عنه berkata: Rasulullah ﷺ bertemu Jibril, lalu berkata: “Wahai Jibril! Sesungguhnya aku diutus kepada umat yang ummiyyin (buta huruf) di kalangan mereka ada wanita tua, lelaki tua, kanak-kanak lelaki, kanak-kanak perempuan dan lelaki yang tidak pernah membaca kitab.” Jibril berkata: “Wahai Muhammad! Sesungguhnya Al-Quran diturunkan dalam tujuh huruf (dialek).” (Riwayat At-Tirmidzi). Dalam riwayat Ahmad dan Abu Dawud: “Semuanya mencukupi dan menyembuhkan.” Dalam riwayat An-Nasa’i, baginda ﷺ bersabda: “Jibril dan Mikail mendatangiku. Jibril duduk di sebelah kananku dan Mikail di sebelah kiriku. Jibril berkata: Bacalah Al-Quran dalam satu huruf. Mikail berkata: Mohonlah lebih, sehingga mencapai tujuh huruf. Setiap huruf mencukupi dan menyembuhkan.”",
        "arabic_text": "عَنْ أُبَيِّ بْنِ كَعْبٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: لَقِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جِبْرِيلَ فَقَالَ: يَا جِبْرِيلُ إِنِّي بُعِثْتُ إِلَى أُمَّةٍ أُمِّيِّينَ مِنْهُمُ الْعَجُوزُ وَالشَّيْخُ الْكَبِيرُ وَالْغُلَامُ وَالْجَارِيَةُ وَالرَّجُلُ الَّذِي لَمْ يَقْرَأْ كِتَابًا قَطُّ قَالَ: يَا مُحَمَّد إِن الْقُرْآن أونزل عَلَى سَبْعَةِ أَحْرُفٍ . رَوَاهُ التِّرْمِذِيُّ وَفِي رِوَايَةٍ لِأَحْمَدَ وَأَبِي دَاوُدَ: قَالَ: «لَيْسَ مِنْهَا إِلَّا شَافٍ كَافٍ» . وَفِي رِوَايَةٍ لِلنَّسَائِيِّ قَالَ: إِنَّ جِبْرِيلَ وَمِيكَائِيلَ أَتَيَانِي فَقَعَدَ جِبْرِيلُ عَنْ يَمِينِي وَمِيكَائِيلُ عَنْ يَسَارِي فَقَالَ جِبْرِيلُ: اقْرَأِ الْقُرْآنَ عَلَى حَرْفٍ قَالَ مِيكَائِيلُ: اسْتَزِدْهُ حَتَّى بَلَغَ سَبْعَة أحرف فَكل حرف شاف كَاف"
      },
      {
        "id": 30910,
        "hadith_number": "2216",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Membaca Al-Quran untuk Meminta-Minta kepada Manusia",
        "perawi_melayu": "Imran bin Husain RA",
        "english_text": "وعن عمران بن حصين رضي الله عنهما أنه مر على قاص يقرأ ثم يسأل. فاسترجع ثم قال: سمعت رسول الله صلى الله عليه وسلم يقول: «من قرأ القرآن فليسأل الله به فإنه سيجيء أقوام يقرؤون القرآن يسألون به الناس» . رواه أحمد والترمذي",
        "malay_translation": "Daripada Imran bin Husain RA, bahawa beliau melewati seorang pencerita yang membaca (Al-Quran) kemudian meminta-minta. Maka beliau beristighfar (mengucapkan 'Inna lillahi wa inna ilaihi raji'un') kemudian berkata: Aku mendengar Rasulullah SAW bersabda: 'Sesiapa yang membaca Al-Quran, maka hendaklah dia meminta kepada Allah dengannya. Sesungguhnya akan datang kaum yang membaca Al-Quran dan meminta-minta kepada manusia dengannya.' Riwayat Ahmad dan Tirmizi.",
        "arabic_text": "وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ رَضِيَ اللَّهُ عَنْهُمَا أَنَّهُ مَرَّ عَلَى قَاصٍّ يَقْرَأُ ثُمَّ يَسْأَلُ. فَاسْتَرْجَعَ ثُمَّ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ قَرَأَ الْقُرْآنَ فليسأل الله بِهِ فَإِنَّهُ سَيَجِيءُ أَقوام يقرؤون الْقُرْآنَ يَسْأَلُونَ بِهِ النَّاسَ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ"
      },
      {
        "id": 30911,
        "hadith_number": "2217",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ancaman Terhadap Mereka yang Membaca Al-Quran untuk Mengambil Keuntungan Duniawi",
        "perawi_melayu": "Buraidah (semoga Allah meredhainya)",
        "english_text": "Not Available",
        "malay_translation": "Daripada Buraidah (semoga Allah meredhainya), beliau berkata: Rasulullah SAW bersabda: \"Barangsiapa yang membaca Al-Quran untuk meraih keuntungan daripada manusia, dia akan datang pada Hari Kiamat dengan wajah yang berupa tulang tanpa daging\". Diriwayatkan oleh Al-Baihaqi dalam Syu'ab al-Iman.",
        "arabic_text": "عَن بُرَيْدَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَرَأَ الْقُرْآنَ يَتَأَكَّلُ بِهِ النَّاسَ جَاءَ يَوْمَ الْقِيَامَةِ وَوَجْهُهُ عظم لَيْسَ عَلَيْهِ لحم» . رَوَاهُ الْبَيْهَقِيّ فِي شعب الْإِيمَان"
      },
      {
        "id": 30912,
        "hadith_number": "2218",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Membezakan Surah Melalui Basmalah",
        "perawi_melayu": "Ibnu Abbas",
        "english_text": "Narrated Ibn 'Abbas: The Messenger of Allah (ﷺ) did not know the separation of the Surah until 'Bismillahi ar-Rahmani ar-Rahim' was sent down to him. (Abu Dawud)",
        "malay_translation": "Diriwayatkan daripada Ibnu Abbas: Rasulullah SAW tidak mengetahui pemisah surah sehingga turun kepadanya 'Bismillahi ar-Rahmani ar-Rahim'. (Riwayat Abu Dawud)",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَعْرِفُ فَصْلَ السُّورَةِ حَتَّى يَنْزِلَ عَلَيْهِ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 30913,
        "hadith_number": "2219",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukuman bagi Peminum Arak dan Pendusta Kitab Allah",
        "perawi_melayu": "Alqamah",
        "english_text": " وعن علقمة قال: كنا بحمص فقرأ ابن مسعود سورة يوسف فقال رجل: ما هكذا أنزلت. فقال عبد الله: والله لقرأتها على عهد رسول الله صلى الله عليه وسلم فقال: «أحسنت» فبينا هو يكلمه إذ وجد منه ريح الخمر فقال: أتشرب الخمر وتكذب بالكتاب؟ فضربه الحد",
        "malay_translation": "Daripada Alqamah berkata: Kami berada di Himsa, lalu Ibnu Mas'ud membaca Surah Yusuf, maka seorang lelaki berkata: Bukan begini ia diturunkan. Maka Abdullah berkata: Demi Allah, aku telah membacanya pada zaman Rasulullah SAW, lalu Baginda bersabda: 'Kamu bagus.' Ketika dia sedang berbicara dengannya, dia mendapati bau arak daripadanya, lalu dia berkata: Adakah kamu minum arak dan mendustakan Kitab? Lalu dia memukulnya dengan hukuman had.",
        "arabic_text": "وَعَنْ عَلْقَمَةَ قَالَ: كُنَّا بِحِمْصَ فَقَرَأَ ابْنُ مَسْعُودٍ سُورَةَ يُوسُفَ فَقَالَ رَجُلٌ: مَا هَكَذَا أُنْزِلَتْ. فَقَالَ عَبْدُ اللَّهِ: وَاللَّهِ لَقَرَأْتُهَا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «أَحْسَنْتَ» فَبَيْنَا هُوَ يُكَلِّمُهُ إِذْ وَجَدَ مِنْهُ رِيحَ الْخَمْرِ فَقَالَ: أَتَشْرَبُ الْخَمْرَ وَتُكَذِّبُ بِالْكِتَابِ؟ فَضَرَبَهُ الْحَد"
      },
      {
        "id": 30914,
        "hadith_number": "2220",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pengumpulan Al-Quran Semasa Khalifah Abu Bakar",
        "perawi_melayu": "Zaid bin Thabit (Semoga Allah merahmatinya)",
        "english_text": "Not Available",
        "malay_translation": "Daripada Zaid bin Thabit (semoga Allah merahmatinya), beliau berkata: Abu Bakar (semoga Allah merahmatinya) telah mengutus kepadaku selepas berlakunya pembunuhan di kalangan penduduk Yamamah. Tiba-tiba Umar bin al-Khattab (semoga Allah merahmatinya) berada di sisinya. Abu Bakar (semoga Allah merahmatinya) berkata: Sesungguhnya Umar telah datang kepadaku dan berkata: Sesungguhnya ramai para penghafaz Al-Quran telah terkorban dalam peperangan di Yamamah, dan aku khuatir jika pembunuhan berterusan di kalangan para penghafaz Al-Quran di medan-medan perang lain, maka akan hilanglah sebahagian besar daripada Al-Quran. Aku berpandangan agar engkau memerintahkan supaya Al-Quran dikumpulkan. Aku berkata kepada Umar: Bagaimana engkau melakukan sesuatu yang tidak pernah dilakukan oleh Rasulullah SAW? Umar berkata: Demi Allah, ini adalah lebih baik. Umar terus-menerus meyakinkanku tentang perkara ini sehingga Allah melapangkan dadaku untuk menerimanya dan aku melihat apa yang dilihat oleh Umar. Zaid berkata: Abu Bakar berkata: Sesungguhnya engkau adalah seorang pemuda yang bijak, kami tidak meragui kamu, dan engkau pernah menulis wahyu untuk Rasulullah SAW, maka carilah Al-Quran dan kumpulkannya. Demi Allah, sekiranya mereka membebankanku untuk memindahkan sebuah gunung daripada gunung-ganang, nescaya tidaklah lebih berat bagiku daripada apa yang diperintahkannya kepadaku iaitu mengumpulkan Al-Quran. Aku berkata: Bagaimana kamu melakukan sesuatu yang tidak pernah dilakukan oleh Nabi SAW. Beliau berkata: Demi Allah, ia adalah lebih baik. Aku terus-menerus berbincang dengannya sehingga Allah melapangkan dadaku untuk menerima apa yang telah dilapangkan oleh Allah untuk Abu Bakar dan Umar. Maka aku pun bangkit dan mencari Al-Quran, mengumpulkannya daripada tulang-tulang daun tamar, batu-batu nipis, dan daripada dada-dada lelaki sehinggalah aku menemui dua ayat daripada Surah At-Taubah bersama Abu Khuzaimah Al-Ansari yang tidak kutemui bersama orang lain: (Sesungguhnya telah datang kepada kamu seorang Rasul dari kalangan kamu) sehingga akhir Surah Bara'ah. Maka lembaran-lembaran itu ada pada Abu Bakar sehingga Allah mewafatkannya, kemudian ada pada Umar sepanjang hayatnya, kemudian ada pada Hafsah.",
        "arabic_text": "وَعَنْ زَيْدِ بْنِ ثَابِتٍ قَالَ: أَرْسَلَ إِلَيَّ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ مَقْتَلَ أَهْلِ الْيَمَامَةِ. فَإِذَا عُمَرُ بْنُ الْخَطَّابِ عِنْدَهُ. قَالَ أَبُو بَكْرٍ إِنَّ عُمَرَ أَتَانِي فَقَالَ إِنَّ الْقَتْلَ قَدِ اسْتَحَرَّ يَوْمَ الْيَمَامَةِ بِقُرَّاءِ الْقُرْآنِ وَإِنِّي أَخْشَى أَنِ اسْتَحَرَّ الْقَتْلُ بِالْقُرَّاءِ بِالْمَوَاطِنِ فَيَذْهَبُ كَثِيرٌ مِنَ الْقُرْآنِ وَإِنِّي أَرَى أَنْ تَأْمُرَ بِجَمْعِ الْقُرْآنِ قُلْتُ لِعُمَرَ كَيْفَ تَفْعَلُ شَيْئًا لَمْ يَفْعَلْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ فَقَالَ عُمَرُ هَذَا وَاللَّهِ خَيْرٌ فَلم يزل عمر يراجعني فِيهِ حَتَّى شرح الله صَدْرِي لذَلِك وَرَأَيْت الَّذِي رَأَى عُمَرُ قَالَ زَيْدٌ قَالَ أَبُو بَكْرٍ إِنَّكَ رَجُلٌ شَابٌّ عَاقِلٌ لَا نَتَّهِمُكَ وَقَدْ كُنْتَ تَكْتُبُ الْوَحْيَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَتَبَّعِ الْقُرْآنَ فَاجْمَعْهُ فَوَاللَّهِ لَوْ كَلَّفُونِي نَقْلَ جَبَلٍ مِنَ الْجِبَالِ مَا كَانَ أَثْقَلَ عَلَيَّ مِمَّا أَمَرَنِي بِهِ مِنْ جمع الْقُرْآن قَالَ: قلت كَيفَ تَفْعَلُونَ شَيْئا لم يَفْعَله النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. قَالَ هُوَ وَاللَّهِ خير فَلم أزل أراجعه حَتَّى شرح الله صَدْرِي للَّذي شرح الله لَهُ صدر أبي بكر وَعمر. فَقُمْت فَتَتَبَّعْتُ الْقُرْآنَ أَجْمَعُهُ مِنَ الْعُسُبِ وَاللِّخَافِ وَصُدُورِ الرِّجَال حَتَّى وجدت من سُورَة التَّوْبَة آيَتَيْنِ مَعَ أَبِي خُزَيْمَةَ الْأَنْصَارِيِّ لَمْ أَجِدْهَا مَعَ أَحَدٍ غَيْرِهِ (لَقَدْ جَاءَكُمْ رَسُولٌ مِنْ أَنْفُسِكُمْ) حَتَّى خَاتِمَةِ بَرَاءَةَ. فَكَانَتِ الصُّحُفُ عِنْدَ أَبِي بَكْرٍ حَتَّى تَوَفَّاهُ اللَّهُ ثُمَّ عِنْدَ عُمَرَ حَيَاته ثمَّ عِنْد حَفْصَة. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 30915,
        "hadith_number": "2221",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pengumpulan Al-Quran pada Zaman Uthman bin Affan",
        "perawi_melayu": "Tiada maklumat perawi dalam sumber",
        "english_text": "Not Available",
        "malay_translation": "Diriwayatkan daripada Anas bin Malik: Sesungguhnya Huzaifah bin al-Yaman telah datang kepada Uthman. Beliau pernah berperang bersama penduduk Syam dalam pembukaan Armenia dan Azerbaijan bersama penduduk Iraq. Huzaifah terkejut dengan perbezaan mereka dalam bacaan al-Quran. Lalu Huzaifah berkata kepada Uthman, \"Wahai Amirul Mukminin, lindungi umat ini sebelum mereka berselisih dalam Kitab (al-Quran) sebagaimana perselisihan kaum Yahudi dan Nasrani.\" Kemudian Uthman menghantar surat kepada Hafsah, \"Hantarkan kepada kami lembaran-lembaran (al-Quran) itu untuk kami salin menjadi mushaf-mushaf, kemudian kami kembalikan kepada kamu.\" Hafsah pun menghantarnya kepada Uthman. Uthman memerintahkan Zaid bin Thabit, Abdullah bin Zubair, Sa'id bin al-'As, dan Abdurrahman bin al-Harith bin Hisyam untuk menyalinnya menjadi mushaf-mushaf. Uthman berkata kepada tiga orang Quraisy itu, \"Jika kamu berselisih tentang sesuatu daripada al-Quran, maka tulislah ia dengan dialek Quraisy, kerana al-Quran itu diturunkan dengan dialek mereka.\" Mereka pun melakukannya sehingga setelah mereka menyalin lembaran-lembaran itu menjadi mushaf-mushaf, Uthman mengembalikan lembaran-lembaran itu kepada Hafsah, dan mengutus ke setiap wilayah sebuah mushaf daripada apa yang telah mereka salin, serta memerintahkan agar selain daripada mushaf-mushaf itu yang terdapat dalam setiap lembaran atau mushaf dibakar. Ibn Syihab berkata, telah mengkhabarkan kepadaku Kharijah bin Zaid bin Thabit, beliau mendengar Zaid bin Thabit berkata, \"Aku kehilangan satu ayat daripada surah al-Ahzab ketika kami menyalin mushaf. Aku pernah mendengar Rasulullah SAW membacanya. Kami mencarinya dan mendapatinya bersama Khuzaimah bin Thabit al-Ansari (Maksudnya: “Di antara orang-orang yang beriman itu ada orang-orang yang menepati apa yang telah mereka janjikan kepada Allah.”) lalu kami memasukkannya ke dalam surahnya dalam mushaf.\" (Riwayat al-Bukhari)",
        "arabic_text": "وَعَنْ أَنَسِ بْنِ مَالِكٍ: أَنَّ حُذَيْفَةَ بْنَ الْيَمَانِ قَدِمَ عَلَى عُثْمَانَ وَكَانَ يُغَازِي أَهْلَ الشَّامِ فِي فَتْحِ أَرْمِينِيَّةَ وَأَذْرَبِيجَانَ مَعَ أَهْلِ الْعِرَاقِ فَأَفْزَعَ حُذَيْفَةَ اخْتِلَافُهُمْ فِي الْقِرَاءَةِ فَقَالَ حُذَيْفَةُ لِعُثْمَانَ يَا أَمِيرَ الْمُؤْمِنِينَ أَدْرِكْ هَذِهِ الْأُمَّةَ قَبْلَ أَنْ يَخْتَلِفُوا فِي الْكِتَابِ اخْتِلَافَ الْيَهُودِ وَالنَّصَارَى فَأَرْسَلَ عُثْمَانُ إِلَى حَفْصَةَ أَنْ أَرْسِلِي إِلَيْنَا بِالصُّحُفِ نَنْسَخُهَا فِي الْمَصَاحِفِ ثُمَّ نَرُدُّهَا إِلَيْكِ فَأَرْسَلَتْ بِهَا حَفْصَةُ إِلَى عُثْمَانَ فَأَمَرَ زَيْدَ بْنَ ثَابِتٍ وَعَبْدَ اللَّهِ بْنَ الزبير وَسَعِيد بن الْعَاصِ وَعبد الرَّحْمَن بْنَ الْحَارِثِ بْنِ هِشَامٍ فَنَسَخُوهَا فِي الْمَصَاحِفِ وَقَالَ عُثْمَانُ لِلرَّهْطِ الْقُرَشِيِّينَ الثَّلَاثِ إِذَا اخْتَلَفْتُمْ فِي شَيْءٍ مِنَ الْقُرْآنِ فَاكْتُبُوهُ بِلِسَانِ قُرَيْشٍ فَإِنَّمَا نَزَلَ بِلِسَانِهِمْ فَفَعَلُوا حَتَّى إِذَا نَسَخُوا الصُّحُفَ فِي الْمَصَاحِفِ رَدَّ عُثْمَانُ الصُّحُفَ إِلَى حَفْصَةَ وَأَرْسَلَ إِلَى كُلِّ أُفُقٍ بِمُصْحَفٍ مِمَّا نَسَخُوا وَأَمَرَ بِمَا سِوَاهُ مِنَ الْقُرْآنِ فِي كُلِّ صَحِيفَةٍ أَوْ مُصْحَفٍ أَنْ يُحْرَقَ قَالَ ابْن شهَاب وَأَخْبرنِي خَارِجَة بن زيد بن ثَابت سَمِعَ زَيْدَ بْنَ ثَابِتٍ قَالَ فَقَدْتُ آيَةً مِنَ الْأَحْزَابِ حِينَ نَسَخْنَا الْمُصْحَفَ قَدْ كُنْتُ أَسْمَعُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ بِهَا فَالْتَمَسْنَاهَا فَوَجَدْنَاهَا مَعَ خُزَيْمَةَ بْنِ ثَابِتٍ الْأَنْصَارِيِّ (مِنَ الْمُؤْمِنِينَ رِجَالٌ صَدَقُوا مَا عَاهَدُوا الله عَلَيْهِ) فَأَلْحَقْنَاهَا فِي سُورَتِهَا فِي الْمُصْحَفِ. رَوَاهُ الْبُخَارِيُّ"
      },
      {
        "id": 30916,
        "hadith_number": "2222",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pengumpulan Surah Al-Anfal dan At-Taubah: Penjelasan Uthman bin Affan",
        "perawi_melayu": "Ibnu Abbas",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Abbas, dia berkata: Aku bertanya kepada Uthman bin Affan: \"Apakah yang mendorongmu untuk menggabungkan surah Al-Anfal, yang merupakan daripada Al-Mathani, dan surah At-Taubah, yang merupakan daripada Al-Mi'in, tanpa menulis 'Bismillahi Ar-Rahmani Ar-Rahim' di antaranya, dan meletakkannya dalam As-Sab'u At-Tiwal?\" Uthman menjawab: \"Rasulullah SAW, apabila turun kepadanya beberapa surah yang banyak ayatnya, Baginda memanggil beberapa orang yang menulis wahyu dan bersabda: 'Letakkan ayat-ayat ini dalam surah yang disebut tentang perkara ini dan itu.' Apabila turun sesuatu ayat, Baginda bersabda: 'Letakkan ayat ini dalam surah yang disebut tentang perkara ini dan itu.' Surah Al-Anfal adalah antara yang mula-mula turun di Madinah, manakala surah At-Taubah adalah antara yang terakhir daripada Al-Quran. Kisah mereka serupa, maka aku menyangka ia adalah daripada surah yang sama. Rasulullah SAW wafat, tetapi Baginda tidak menjelaskan kepada kami bahawa ia adalah daripada surah yang sama. Oleh sebab itu, aku menggabungkannya, dan aku tidak menulis di antaranya 'Bismillahi Ar-Rahmani Ar-Rahim', dan aku meletakkannya dalam As-Sab'u At-Tiwal.\" Riwayat Ahmad, At-Tirmidzi, dan Abu Daud.",
        "arabic_text": "وَعَن ابْن عَبَّاس قَالَ: قلت لعُثْمَان بن عَفَّان مَا حملكم أَنْ عَمَدْتُمْ إِلَى الْأَنْفَالِ وَهِيَ مِنَ الْمَثَانِي وَإِلَى بَرَاءَةٍ وَهِيَ مِنَ الْمَئِينِ فَقَرَنْتُمْ بَيْنَهُمَا وَلم تكْتبُوا بَينهمَا سَطْرَ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ وَوَضَعْتُمُوهَا فِي السَّبع الطول مَا حملكم على ذَلِك فَقَالَ عُثْمَانُ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِمَّا يَأْتِي عَلَيْهِ الزَّمَان وَهُوَ تنزل عَلَيْهِ السُّور ذَوَات الْعدَد فَكَانَ إِذا نزل عَلَيْهِ الشَّيْء دَعَا بعض من كَانَ يَكْتُبُ فَيَقُولُ: «ضَعُوا هَؤُلَاءِ الْآيَاتِ فِي السُّورَةِ الَّتِي يُذْكَرُ فِيهَا كَذَا وَكَذَا» فَإِذَا نَزَلَتْ عَلَيْهِ الْآيَةُ فَيَقُولُ: «ضَعُوا هَذِهِ الْآيَةَ فِي السُّورَةِ الَّتِي يُذْكَرُ فِيهَا كَذَا وَكَذَا» . وَكَانَتِ الْأَنْفَالُ مِنْ أَوَائِلِ مَا نَزَلَتْ بِالْمَدِينَةِ وَكَانَتْ بَرَاءَة من آخر الْقُرْآن وَكَانَت قصَّتهَا شَبيهَة بِقِصَّتِهَا فَظَنَنْت أَنَّهَا مِنْهَا فَقُبِضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يبين لنا أَنَّهَا مِنْهَا فَمِنْ أَجْلِ ذَلِكَ قَرَنْتُ بَيْنَهُمَا وَلِمَ أكتب بَينهمَا سَطْرَ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ وَوَضَعْتُهَا فِي السَّبْعِ الطُّوَلِ. رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ"
      }
    ]
  }
}