{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 145,
    "data": [
      {
        "id": 32853,
        "hadith_number": "4159",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Adab Makan Ketika Makan",
        "perawi_melayu": "Umar bin Abi Salamah",
        "english_text": "From Umar bin Abi Salamah, he said: I was a young boy in the care of the Messenger of Allah (ﷺ), and my hand would stray over the food. So the Messenger of Allah (ﷺ) said to me: “Mention the name of Allah and eat with your right hand and eat from what is near you.”",
        "malay_translation": "Daripada Umar bin Abi Salamah, beliau berkata:  Aku adalah seorang kanak-kanak lelaki di bawah jagaan Rasulullah SAW, dan tanganku akan tergapai-gapai ke makanan. Maka Rasulullah SAW bersabda kepadaku:  “Sebut nama Allah dan makanlah dengan tangan kananmu dan makanlah dari apa yang dekat denganmu.”",
        "arabic_text": "عَن عمر بن أبي سَلمَة قَالَ: كُنْتُ غُلَامًا فِي حِجْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَتْ يَدِي تَطِيشُ فِي الصفحة. فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ «سم الله وكل يَمِينك وكل مِمَّا يليك»"
      },
      {
        "id": 32854,
        "hadith_number": "4160",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Syaitan Menghalalkan Makanan yang Tidak Disebut Nama Allah",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Tiada teks Inggeris",
        "malay_translation": "Daripada Huzaifah RA berkata, Rasulullah SAW bersabda: “Sesungguhnya syaitan menghalalkan makanan yang tidak disebut nama Allah atasnya.” Riwayat Muslim.",
        "arabic_text": "وَعَن حُذَيْفَة قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الشَّيْطَانَ يَسْتَحِلُّ الطَّعَامَ أَنْ لَا يُذْكَرَ اسْم الله عَلَيْهِ» . رَوَاهُ مُسلم"
      },
      {
        "id": 32855,
        "hadith_number": "4161",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mengucap Zikir Ketika Masuk Rumah dan Makan",
        "perawi_melayu": "Jabir",
        "english_text": "From Jabir, he said: The Messenger of Allah (ﷺ) said: “When a man enters his house and mentions Allah upon entering and mentions Allah during his meal, the Shaytan says: ‘You have no lodging here tonight nor supper.’ And if he enters and does not mention Allah upon entering, the Shaytan says: ‘You have found lodging.’ And if he does not mention Allah during his meal, he says: ‘You have found lodging and supper.’",
        "malay_translation": "Dari Jabir, katanya: Rasulullah SAW bersabda: “Apabila seseorang lelaki memasuki rumahnya dan menyebut nama Allah ketika masuk dan menyebut nama Allah ketika makan, syaitan berkata: ‘Kamu tidak akan mendapat tempat bermalam di sini malam ini dan makan malam.’ Dan jika dia masuk dan tidak menyebut nama Allah ketika masuk, syaitan berkata: ‘Kamu telah mendapat tempat bermalam.’ Dan jika dia tidak menyebut nama Allah ketika makan, syaitan berkata: ‘Kamu telah mendapat tempat bermalam dan makan malam.’",
        "arabic_text": "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا دَخَلَ الرَّجُلُ بَيْتَهُ فَذَكَرَ اللَّهَ عِنْدَ دُخُولِهِ وَعِنْدَ طَعَامِهِ قَالَ الشَّيْطَانُ: لَا مَبِيتَ لَكُمْ وَلَا عَشَاءَ وَإِذَا دَخَلَ فَلَمْ يَذْكُرِ اللَّهَ عِنْدَ دُخُولِهِ قَالَ الشَّيْطَانُ: أَدْرَكْتُمُ الْمَبِيتَ وَإِذَا لَمْ يَذْكُرِ اللَّهَ عِنْدَ طَعَامِهِ قَالَ: أَدْرَكْتُمُ الْمَبِيتَ وَالْعَشَاءَ . رَوَاهُ مُسلم"
      },
      {
        "id": 32856,
        "hadith_number": "4162",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Adab Makan dan Minum dengan Tangan Kanan",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "No English text provided",
        "malay_translation": "Daripada Ibn Umar RA berkata: Rasulullah SAW bersabda: \"Apabila salah seorang daripada kamu makan, maka hendaklah dia makan dengan tangan kanannya, dan apabila dia minum, maka hendaklah dia minum dengan tangan kanannya.\" Riwayat Muslim.",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَكَلَ أَحَدُكُمْ فَلْيَأْكُلْ بِيَمِينِهِ وَإِذَا شَرِبَ فَلْيَشْرَبْ بِيَمِينِهِ» . رَوَاهُ مُسلم"
      },
      {
        "id": 32857,
        "hadith_number": "4163",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Makan dan Minum dengan Tangan Kiri",
        "perawi_melayu": "Daripada riwayat Muslim",
        "english_text": "It was narrated that the Messenger of Allah (ﷺ) said: “None of you should eat with his left hand or drink with it, for the Shaytan eats with his left hand and drinks with it.”",
        "malay_translation": "Daripada sebuah riwayat, Rasulullah SAW bersabda:  “Tiada seorang pun di antara kamu harus makan dengan tangan kirinya atau minum dengannya, kerana syaitan makan dengan tangan kirinya dan minum dengannya.”",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَأْكُلَنَّ أَحَدُكُمْ بِشِمَالِهِ وَلَا يَشْرَبَنَّ بِهَا فَإِنَّ الشَّيْطَانَ يَأْكُلُ بِشِمَالِهِ وَيَشْرَبُ بهَا» . رَوَاهُ مُسلم"
      },
      {
        "id": 32858,
        "hadith_number": "4164",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Makan Dengan Tiga Jari dan Menjilat Jari",
        "perawi_melayu": "Ka'b bin Malik",
        "english_text": "From Ka'b bin Malik, who said: The Messenger of Allah (peace and blessings be upon him) used to eat with three fingers and lick his hand before wiping it.",
        "malay_translation": "Dari Ka'b bin Malik, yang berkata: Rasulullah SAW makan dengan tiga jari dan menjilat tangannya sebelum menyapu bersih.",
        "arabic_text": "وَعَنْ كَعْبِ بْنِ مَالِكٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ بِثَلَاثَةِ أَصَابِعَ وَيَلْعَقُ يَدَهُ قَبْلَ أَن يمسحها. رَوَاهُ مُسلم"
      },
      {
        "id": 32859,
        "hadith_number": "4165",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menjilat Jari dan Pinggan Selepas Makan",
        "perawi_melayu": "Jabir r.a.",
        "english_text": "From Jabir: The Prophet (peace and blessings of Allah be upon him) ordered us to lick our fingers and the plate, and said: \"You do not know in which (part of the food) the blessing is.\"",
        "malay_translation": "Dari Jabir r.a.: Nabi Muhammad s.a.w. memerintahkan untuk menjilat jari dan pinggan, dan bersabda: \"Sesungguhnya kamu tidak tahu di bahagian mana keberkatan itu.\" ",
        "arabic_text": "وَعَنْ جَابِرٌ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِلَعْقِ الْأَصَابِعِ وَالصَّفْحَةِ وَقَالَ: إِنَّكُمْ لَا تَدْرُونَ: فِي أَيَّهِ الْبَرَكَةُ؟ . رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 32860,
        "hadith_number": "4166",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Galakan Menjilat Jari Selepas Makan",
        "perawi_melayu": "Ibnu Abbas",
        "english_text": "وعن ابن عباس أن النبي صلى الله عليه وسلم قال: «إذا أكل أحدكم فلا يمسح يده حتى يلعقها أو يلعقها»",
        "malay_translation": "Daripada Ibnu Abbas RA, bahawa Nabi SAW bersabda: \"Apabila salah seorang daripada kamu makan, maka janganlah dia mengesat tangannya sehingga dia menjilatnya atau (meminta orang lain) menjilatnya.\"",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا أَكَلَ أَحَدُكُمْ فَلَا يمسحْ يدَه حَتَّى يلعقها أَو يلعقها»"
      },
      {
        "id": 32861,
        "hadith_number": "4167",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Syaitan dan Makanan",
        "perawi_melayu": "Jabir",
        "english_text": "From Jabir, he said: The Prophet (peace and blessings of Allah be upon him) said: \"Indeed, Satan attends to one of you in everything he does, even to the point of attending him during his meal. So, if a morsel falls from one of you, let him remove any dirt from it, then let him eat it and not leave it for Satan. If it is a piece of meat then he may lick it. For he does not know in which of his food is the blessing.\"",
        "malay_translation": "Dari Jabir, katanya: Nabi SAW bersabda: \"Sesungguhnya syaitan sentiasa berada di sisi seseorang daripada kamu dalam setiap urusannya, sehingga dia berada di sisinya ketika makan.  Oleh itu, jika sekeping makanan jatuh daripada seseorang di antara kamu, hendaklah dia menyingkirkan apa-apa yang kotor padanya, kemudian makanlah ia dan jangan biarkan ia untuk syaitan. Jika ia seketul daging, maka hendaklah dia menjilatnya. Kerana dia tidak mengetahui di mana keberkatan terletak dalam makanannya.\" ",
        "arabic_text": "وَعَن جَابر قَالَ: النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: إِنَّ الشَّيْطَانَ يَحْضُرُ أَحَدَكُمْ عِنْدَ كُلِّ شَيْءٍ مِنْ شَأْنِهِ حَتَّى يَحْضُرَهُ عِنْدَ طَعَامِهِ فَإِذَا سَقَطَتْ من أحدكُم لقْمَة فَلْيُمِطْ مَا كَانَ بِهَا مِنْ أَذًى ثُمَّ ليأكلها وَلَا يَدعهَا للشَّيْطَان فَإِذا فرع فليلعق أصَاب فَإِنَّهُ لَا يَدْرِي: فِي أَيِّ طَعَامِهِ يَكُونُ الْبركَة؟ . رَوَاهُ مُسلم"
      },
      {
        "id": 32862,
        "hadith_number": "4168",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tidak Makan Sambil Bersandar",
        "perawi_melayu": "Abu Juhaifah RA",
        "english_text": "Teks asal Bahasa Inggeris tidak tersedia.",
        "malay_translation": "Daripada Abu Juhaifah RA berkata: Rasulullah SAW bersabda: \"Aku tidak makan sambil bersandar.\" Riwayat al-Bukhari.",
        "arabic_text": "وَعَن أبي جُحَيْفَة قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «لَا آكل مُتكئا» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32863,
        "hadith_number": "4169",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Makanan Nabi SAW",
        "perawi_melayu": "Daripada Qatadah daripada Anas",
        "english_text": "And from Qatadah from Anas, he said: The Prophet (ﷺ) did not eat on trays, nor in a goblet, nor was bread made thin for him. It was said to Qatadah: What did they eat on? He said: On leaves during travel.",
        "malay_translation": "Daripada Qatadah daripada Anas, beliau berkata: Nabi SAW tidak makan di atas dulang, mahupun di dalam cawan, dan roti tidak ditipiskan untuk baginda.  Ditanya kepada Qatadah: Di atas apakah mereka makan?  Beliau menjawab: Di atas daun ketika dalam perjalanan.",
        "arabic_text": "وَعَن قَتَادَة عَنْ أَنَسٍ قَالَ: مَا أَكَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى خِوَانٍ وَلَا فِي سُكُرَّجَةٍ وَلَا خُبِزَ لَهُ مُرَقَّقٌ قِيلَ لِقَتَادَةَ: على مَ يَأْكُلُون؟ قَالَ: على السّفر. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32864,
        "hadith_number": "4170",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi SAW Tidak Pernah Melihat Roti Nipis dan Kambing Kurus",
        "perawi_melayu": "Anas",
        "english_text": "From Anas, he said: I do not know the Prophet (peace and blessings of Allah be upon him) ever saw a thin loaf of bread, nor did he ever see a lean sheep with his own eyes.",
        "malay_translation": "Dari Anas, beliau berkata: Aku tidak pernah mengetahui Nabi Muhammad SAW pernah melihat roti yang nipis, dan tidak pernah melihat kambing yang kurus dengan matanya sendiri.",
        "arabic_text": "وَعَن أنس قَالَ: مَا أَعْلَمُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَغِيفًا مُرَقَّقًا حَتَّى لَحِقَ بِاللَّهِ وَلَا رَأَى شَاةً سَمِيطًا بِعَيْنِهِ قَطُّ. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32865,
        "hadith_number": "4171",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Sentiasa Bersih",
        "perawi_melayu": "Sahl bin Saad",
        "english_text": "It was narrated from Sahl bin Saad that he said: \"I did not see the Messenger of Allah (ﷺ) do anything impure from the time Allah sent him until Allah took him.\"",
        "malay_translation": "Daripada Sahl bin Saad, katanya: Aku tidak pernah melihat Rasulullah SAW melakukan sesuatu yang najis sejak Allah SWT mengutus baginda sehingga Allah SWT mengambil baginda.  Mereka bertanya: “Bagaimana kamu memakan barli yang tidak ditapis?”  Baginda menjawab: “Kami menumbuknya, kemudian kami meniupnya lalu apa yang terbang itu, kami biarkan, dan yang tinggal kami makan.” Riwayat Bukhari.",
        "arabic_text": "وَعَن سهل بن سعد قَالَ: مَا رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّقِيَّ مِنْ حِينِ ابْتَعَثَهُ اللَّهُ حَتَّى قَبَضَهُ اللَّهُ وَقَالَ: مَا رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُنْخُلًا مِنْ حِين ابتعثهُ الله حَتَّى قبضَهُ قِيلَ: كَيْفَ كُنْتُمْ تَأْكُلُونَ الشَّعِيرَ غَيْرَ مَنْخُولٍ؟ قَالَ: كُنَّا نَطْحَنُهُ وَنَنْفُخُهُ فَيَطِيرُ مَا طَارَ وَمَا بَقِي ثريناه فأكلناه. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32866,
        "hadith_number": "4172",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi SAW Tidak Pernah Mencela Makanan",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "From Abu Hurairah RA said: The Prophet PBUH never criticised food at all. If he desired it, he would eat it, and if he disliked it, he would leave it.",
        "malay_translation": "Daripada Abu Hurairah RA berkata: Nabi SAW tidak pernah mencela makanan sama sekali. Jika Baginda berselera, Baginda akan memakannya dan jika tidak suka, Baginda meninggalkannya.",
        "arabic_text": "وَعَن أبي هُرَيْرَة قَالَ: مَا عَابَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَعَامًا قَطُّ إِنِ اشْتَهَاهُ أَكَلَهُ وَإِنْ كرهه تَركه"
      },
      {
        "id": 32867,
        "hadith_number": "4173",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perbezaan Makan Orang Mukmin dan Kafir",
        "perawi_melayu": "Riwayat Bukhari",
        "english_text": "It is narrated that a man used to eat a lot before he embraced Islam.  After becoming a Muslim, he reduced his food intake. He mentioned this to the Prophet (peace and blessings of Allah be upon him), who said: \"The believer eats in one gut, while the disbeliever eats in seven guts.\"",
        "malay_translation": "Daripada riwayat bahawa seorang lelaki sebelum memeluk Islam makan dengan banyak. Selepas memeluk Islam, dia mengurangkan pengambilan makanannya. Dia menceritakan perkara ini kepada Nabi SAW, lalu baginda bersabda:  \"Sesungguhnya orang beriman makan dalam satu usus, manakala orang kafir makan dalam tujuh usus.\"",
        "arabic_text": "وَعَنْهُ أَنَّ رَجُلًا كَانَ يَأْكُلُ أَكْلًا كَثِيرًا فَأَسْلَمَ فَكَانَ يَأْكُلُ قَلِيلًا فَذَكَرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «إِنَّ الْمُؤْمِنَ يَأْكُلُ فِي مِعًى وَاحِدٍ وَالْكَافِرُ يَأْكُلُ فِي سبعةِ أمعاء» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32868,
        "hadith_number": "4174",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hadis Riwayat Muslim dari Abu Musa dan Ibn Umar",
        "perawi_melayu": "Muslim",
        "english_text": "[Teks Bahasa Inggeris Tidak Tersedia]",
        "malay_translation": "Diriwayatkan oleh Muslim daripada Abu Musa dan Ibn Umar, (iaitu) Musnad daripadanya sahaja.",
        "arabic_text": "وَرَوَى مُسْلِمٌ عَنْ أَبِي مُوسَى وَابْنِ عُمَرَ الْمسند مِنْهُ فَقَط"
      },
      {
        "id": 32869,
        "hadith_number": "4175",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Riwayat Muslim daripada Abi Musa dan Ibn Umar",
        "perawi_melayu": "Abu Musa dan Ibn Umar",
        "english_text": "Not Available",
        "malay_translation": "Muslim meriwayatkan daripada Abi Musa dan Ibn Umar.  (Hanya sebahagian daripada riwayat yang terdapat dalam kitab Al-Musnad).",
        "arabic_text": "وَرَوَى مُسْلِمٌ عَنْ أَبِي مُوسَى وَابْنِ عُمَرَ الْمسند مِنْهُ فَقَط"
      },
      {
        "id": 32870,
        "hadith_number": "4176",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perbezaan Minuman Orang Mukmin dan Kafir",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah, bahawa Rasulullah SAW menerima seorang tetamu yang ketika itu masih kafir.  Rasulullah SAW menyuruh menyediakan seekor kambing, diperah susunya lalu diminum tetamu itu. Kemudian seekor lagi, diperah susunya dan diminumnya, begitu juga dengan seekor lagi sehingga dia minum susu daripada tujuh ekor kambing.  Kemudian, tetamu itu masuk Islam pada keesokan harinya.  Rasulullah SAW menyuruh menyediakan seekor kambing untuknya, diperah susunya lalu diminumnya. Kemudian Rasulullah SAW menyuruh menyediakan seekor lagi, tetapi dia tidak menghabiskan susunya.  Rasulullah SAW bersabda:  “Orang mukmin minum dalam satu usus, dan orang kafir minum dalam tujuh usus.”",
        "arabic_text": "عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَافَهُ ضَيْفٌ وَهُوَ كَافِرٌ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَاةٍ فَحُلِبَتْ فَشَرِبَ حِلَابَهَا ثُمَّ أُخْرَى فَشَرِبَهُ ثُمَّ أُخْرَى فَشَرِبَهُ حَتَّى شَرِبَ حِلَابَ سَبْعِ شِيَاهٍ ثُمَّ إِنَّهُ أَصْبَحَ فَأَسْلَمَ فَأَمَرَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَاةٍ فَحُلِبَتْ فَشَرِبَ حِلَابَهَا ثُمَّ أَمَرَ بِأُخْرَى فَلَمْ يَسْتَتِمَّهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْمُؤْمِنُ يَشْرَبُ فِي مِعًى وَاحِدٍ وَالْكَافِرُ يشربُ فِي سَبْعَة أمعاء»"
      },
      {
        "id": 32871,
        "hadith_number": "4177",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Makanan Dua Orang Cukup untuk Tiga Orang",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Not Available",
        "malay_translation": "Daripada hadis yang diriwayatkan, Rasulullah SAW bersabda:  \"Makanan untuk dua orang cukup untuk tiga orang, dan makanan untuk tiga orang cukup untuk empat orang.\"",
        "arabic_text": "وَعَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «طَعَامُ الِاثْنَيْنِ كَافِي الثلاثةِ وطعامِ الثلاثةِ كَافِي الْأَرْبَعَة»"
      },
      {
        "id": 32872,
        "hadith_number": "4178",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Berkat Makanan: Cukup untuk Lebih Ramai",
        "perawi_melayu": "Jabir",
        "english_text": "Not Available",
        "malay_translation": "Dari Jabir r.a., katanya: Aku mendengar Rasulullah SAW bersabda: \"Makanan seorang cukup untuk dua orang, makanan dua orang cukup untuk empat orang, dan makanan empat orang cukup untuk lapan orang.\" Riwayat Muslim.",
        "arabic_text": "وَعَنْ جَابِرٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «طَعَامُ الْوَاحِدِ يَكْفِي الِاثْنَيْنِ وَطَعَامُ الِاثْنَيْنِ يَكْفِي الْأَرْبَعَةَ وَطَعَامُ الْأَرْبَعَةِ يَكْفِي الثمانيَة» . رَوَاهُ مُسلم"
      },
      {
        "id": 32873,
        "hadith_number": "4179",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kebaikan Telbīnah untuk Meredakan Kesedihan",
        "perawi_melayu": "Aisyah r.a.",
        "english_text": "From 'Aishah (RA) it is narrated that she said: I heard the Messenger of Allah (PBUH) saying: \"The Talbina is comforting for the heart of the patient. It removes some of the sadness.\"",
        "malay_translation": "Daripada Aisyah r.a., beliau berkata: Saya mendengar Rasulullah s.a.w. bersabda:  \"Telbīnah melegakan hati orang sakit dan menghilangkan sebahagian daripada kesedihan.\"",
        "arabic_text": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «التَّلْبِينَةُ مُجِمَّةٌ لِفُؤَادِ الْمَرِيضِ تَذْهَبُ بِبَعْض الْحزن»"
      },
      {
        "id": 32874,
        "hadith_number": "4180",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keperibadian Nabi SAW: Mencari Dubbah dalam Makanan",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "From Anas: A tailor invited the Prophet (peace and blessings of Allaah be upon him) to a meal that he had prepared. I went with the Prophet (peace and blessings of Allaah be upon him). He brought barley bread and a broth in which there was dubbah (a kind of insect) and qadid (dried meat). I saw the Prophet (peace and blessings of Allaah be upon him) searching for the dubbah around the bowl.  I have never disliked dubbah since that day.",
        "malay_translation": "Dari Anas: Seorang tukang jahit telah menjemput Nabi SAW  ke satu hidangan yang telah disediakannya. Aku pergi bersama Nabi SAW. Baginda dihidangkan roti barli dan sup yang di dalamnya terdapat dubbah (sejenis serangga) dan qadid (daging kering). Aku melihat Nabi SAW mencari dubbah di sekeliling mangkuk. Aku tidak pernah membenci dubbah sejak hari itu.",
        "arabic_text": "وَعَنْ أَنَسٍ أَنَّ خَيَّاطًا دَعَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِطَعَامٍ صَنَعَهُ فَذَهَبْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَرَّبَ خُبْزَ شَعِيرٍ وَمَرَقًا فِيهِ دُبَّاءُ وَقَدِيدٌ فَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَتَبَّعُ الدُّبَّاءَ مِنْ حَوَالَيِ الْقَصْعَةِ فَلَمْ أَزَلْ أُحِبُّ الدباءَ بعد يومِئذٍ"
      },
      {
        "id": 32875,
        "hadith_number": "4181",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Solat Tanpa Wudhu Selepas Memotong Daging",
        "perawi_melayu": "Amru bin Umiyyah",
        "english_text": "From Amr ibn Umayya, that he saw the Prophet (peace and blessings of Allah be upon him) holding the shoulder of a sheep in his hand, then he was called to prayer, so he threw it down, and the knife with which he was cutting, then he stood up and prayed without performing ablution.",
        "malay_translation": "Daripada Amru bin Umiyyah, bahawa beliau melihat Nabi SAW memegang bahu seekor kambing di tangannya, kemudian baginda diseru untuk solat, maka baginda meletakkannya dan pisau yang digunakan untuk memotong, kemudian baginda bangun dan solat tanpa berwudu.",
        "arabic_text": "وَعَن عَمْرو بنِ أُميَّةَ أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يحتزمن كتف الشَّاة فِي يَدِهِ فَدُعِيَ إِلَى الصَّلَاةِ فَأَلْقَاهَا وَالسِّكِّينَ الَّتِي يَحْتَزُّ بِهَا ثُمَّ قَامَ فَصَلَّى وَلَمْ يتَوَضَّأ"
      },
      {
        "id": 32876,
        "hadith_number": "4182",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kegemaran Rasulullah SAW Terhadap Manisan dan Madu",
        "perawi_melayu": "Aisyah R.A.",
        "english_text": "Narrated Aisha (RA): The Messenger of Allah (peace and blessings of Allah be upon him) loved sweet things and honey.",
        "malay_translation": "Diriwayatkan daripada Aisyah R.A.: Rasulullah SAW sangat menyukai manisan dan madu.",
        "arabic_text": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحِبُّ الْحَلْوَاء وَالْعَسَل. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32877,
        "hadith_number": "4183",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Cuka sebagai Hidangan",
        "perawi_melayu": "Jabir",
        "english_text": "And from Jabir that the Prophet (peace and blessings of Allaah be upon him) asked his family for some sauce. They said: We have nothing but vinegar. So he called for it and ate with it, saying: \"Excellent sauce is vinegar, excellent sauce is vinegar.\"",
        "malay_translation": "Daripada Jabir, bahawa Nabi Muhammad SAW meminta makanan tambahan daripada keluarganya. Mereka menjawab: “Kami hanya ada cuka.” Maka Baginda meminta cuka dan memakannya sambil bersabda:  “Alangkah baiknya cuka sebagai makanan tambahan, alangkah baiknya cuka sebagai makanan tambahan.”",
        "arabic_text": "وَعَنْ جَابِرٌ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَأَلَ أَهْلَهُ الْأُدْمَ. فَقَالُوا: مَا عِنْدَنَا إِلَّا خَلٌّ فَدَعَا بِهِ فَجَعَلَ يَأْكُلُ بِهِ وَيَقُولُ: «نِعْمَ الْإِدَامُ الْخَلُّ نِعْمَ الْإِدَامُ الْخَلُّ» . رَوَاهُ مُسلم"
      },
      {
        "id": 32878,
        "hadith_number": "4184",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Khasiat Kam'ah (Kulat Manna)",
        "perawi_melayu": "Said bin Zaid",
        "english_text": "From Said bin Zaid, he said: The Prophet (peace and blessings of Allah be upon him) said: “The Kam'ah is from the Manna, and its water is a cure for the eye.” Agreed upon. In a narration by Muslim: “from the Manna which Allah Almighty sent down upon Moses (peace be upon him).",
        "malay_translation": "Dari Said bin Zaid, beliau berkata: Rasulullah SAW bersabda:  “Kam’ah adalah daripada Manna, dan airnya adalah penawar bagi mata.”  (Hadis Riwayat Bukhari dan Muslim).  Dalam satu riwayat Muslim: “Daripada Manna yang Allah SWT turunkan ke atas Musa a.s.”",
        "arabic_text": "وَعَن سعيد بنِ زيدٍ قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْكَمْأَةُ مِنَ الْمَنِّ وَمَاؤُهَا شِفَاءٌ لِلْعَيْنِ» . مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ لِمُسْلِمٍ: «مِنَ الْمَنِّ الَّذِي أنزلَ اللَّهُ تَعَالَى على مُوسَى عَلَيْهِ السَّلَام»"
      },
      {
        "id": 32879,
        "hadith_number": "4185",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Makan Kurma dengan Senduk",
        "perawi_melayu": "Abdullah bin Ja'far",
        "english_text": "From Abdullah ibn Ja'far, who said: I saw the Messenger of Allah (ﷺ) eating dates with a spoon.",
        "malay_translation": "Daripada Abdullah bin Ja'far, yang berkata: Aku melihat Rasulullah SAW makan kurma dengan senduk.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ الرُّطَبَ بِالْقِثَّاءِ"
      },
      {
        "id": 32880,
        "hadith_number": "4186",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Kambing Hitam",
        "perawi_melayu": "Jabir",
        "english_text": "And from Jabir, he said: We were with the Messenger of Allah (ﷺ) at Mar al-Zuhran, plucking Kabath, then he said: “Upon you is the black one of it, for indeed it is the best.” Then it was said: “Were you tending sheep?” He said: “Yes, and is there any prophet except that he tended them?”",
        "malay_translation": "Dari Jabir, katanya: Kami berada bersama Rasulullah SAW di Mar az-Zuhran, memetik Kabath, lalu baginda bersabda: “Hendaklah kamu mengambil yang hitam di antaranya, kerana ia yang terbaik.” Kemudian ditanya: “Adakah engkau pernah menjaga kambing?” Baginda menjawab: “Ya, dan adakah ada nabi melainkan mereka pernah menjaga kambing?”",
        "arabic_text": "وَعَنْ جَابِرٍ قَالَ: كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَرِّ الظَّهْرَانِ نَجْنِي الْكَبَاثَ فَقَالَ: «عَلَيْكُم بالأسْوَدِ مِنْهُ فإِنَّه أَطْيَبُ» فَقِيلَ: أَكُنْتَ تَرْعَى الْغَنَمَ؟ قَالَ: «نَعَمْ وهلْ منْ نبيٍّ إِلاَّ رعاها؟»"
      },
      {
        "id": 32881,
        "hadith_number": "4187",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi SAW Makan Kurma",
        "perawi_melayu": "Anas r.a.",
        "english_text": "And Anas said: I saw the Prophet (peace and blessings of Allaah be upon him) eating dates while reclining.",
        "malay_translation": "Anas r.a. berkata: Aku melihat Nabi SAW makan kurma dalam keadaan berbaring.  Dalam satu riwayat: Baginda makan kurma dengan banyak.",
        "arabic_text": "وَعَن أنس قَالَ: رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُقْعِيًا يَأْكُلُ تَمْرًا وَفِي رِوَايَةٍ: يَأْكُلُ مِنْهُ أكلا ذريعا. رَوَاهُ مُسلم"
      },
      {
        "id": 32882,
        "hadith_number": "4188",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menggabungkan Dua Kurma Tanpa Keizinan",
        "perawi_melayu": "Ibn Umar",
        "english_text": "From Ibn Umar, he said: The Messenger of Allah (peace and blessings of Allah be upon him) forbade a man from joining two dates together until he asks permission from his companions.",
        "malay_translation": "Daripada Ibnu Umar, beliau berkata: Rasulullah SAW melarang seseorang lelaki daripada menggabungkan dua biji tamar (kurma) sehingga dia meminta izin daripada sahabat-sahabatnya.",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَقْرِنَ الرَّجُلُ بَيْنَ التَّمْرَتَيْنِ حَتَّى يستأذِنَ أَصْحَابه"
      },
      {
        "id": 32883,
        "hadith_number": "4189",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rumah Yang Ada Kurma Tidak Akan Kelaparan",
        "perawi_melayu": "Aisyah r.a.",
        "english_text": "Not Available",
        "malay_translation": "Daripada Aisyah r.a., bahawa Nabi SAW bersabda:  \"Tidak akan kelaparan ahli keluarga yang mempunyai kurma.\"  Dalam satu riwayat lain, Baginda SAW bersabda: \"Wahai Aisyah, rumah yang ada kurma di dalamnya, ahli keluarganya tidak akan kelaparan.\" Baginda SAW menyebutnya dua atau tiga kali.  (Riwayat Muslim)",
        "arabic_text": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَجُوعُ أَهْلُ بَيْتٍ عِنْدَهُمُ التَّمْرُ» . وَفِي رِوَايَةٍ: قَالَ: «يَا عَائِشَةُ بَيْتٌ لَا تَمْرَ فِيهِ جِيَاعٌ أَهْلُهُ» قَالَهَا مَرَّتَيْنِ أَوْ ثَلَاثًا. رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 32884,
        "hadith_number": "4190",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keistimewaan Makan Tujuh Buah Kurma Ajwa di Pagi Hari",
        "perawi_melayu": "Saad r.a.",
        "english_text": "Sa'd reported: I heard the Messenger of Allah, may Allah bless him and grant him peace, say: \"Whoever eats seven 'Ajwa dates in the morning, will not be harmed that day by poison or magic.\"",
        "malay_translation": "Saad r.a. meriwayatkan bahawa baginda Rasulullah SAW bersabda:  \"Barang siapa memakan tujuh biji tamar Ajwa pada waktu pagi, maka dia tidak akan tercedera pada hari itu oleh racun mahupun sihir.\"",
        "arabic_text": "وَعَن سعدٍ قَالَ: سمعتُ رسولَ الله يَقُولُ: «مَنْ تَصَبَّحَ بِسَبْعِ تَمَرَاتٍ عَجْوَةٍ لَمْ يضرَّه ذَلِك الْيَوْم سم وَلَا سحر»"
      },
      {
        "id": 32885,
        "hadith_number": "4191",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Khasiat Kurma Ajwa 'Aliyah Sebagai Penawar",
        "perawi_melayu": "Aisyah R.A.",
        "english_text": "Narrated from Aisha R.A. that the Messenger of Allah (peace and blessings of Allah be upon him) said: \"Indeed, in 'Ajwa of Al-'Aliyah there is healing, and it is an antidote in the early morning.\"",
        "malay_translation": "Daripada Aisyah R.A., bahawa Rasulullah SAW bersabda: \"Sesungguhnya pada kurma Ajwa dari 'Aliyah terdapat penawar, dan ia adalah penawar racun apabila dimakan pada awal pagi.\"",
        "arabic_text": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ فِي عَجْوَةِ الْعَالِيَةِ شِفَاءً وَإِنَّهَا تِرْيَاقٌ أَوَّلَ البكرة» . رَوَاهُ مُسلم"
      },
      {
        "id": 32886,
        "hadith_number": "4192",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kehidupan Ringkas Rasulullah SAW",
        "perawi_melayu": "Tidak dinyatakan dalam data asal.",
        "english_text": "Not Available",
        "malay_translation": "Daripada baginda (isteri Rasulullah SAW), baginda berkata:  Setahun penuh kami akan melalui tanpa menyalakan api, makanan kami hanya tamar dan air, kecuali jika ada daging yang dihidangkan.",
        "arabic_text": "وَعَنْهَا قَالَتْ: كَانَ يَأْتِي عَلَيْنَا الشَّهْرُ مَا نُوقِدُ فِيهِ نَارًا إِنَّمَا هُوَ التَّمْرُ وَالْمَاءُ إِلَّا أَنْ يُؤْتَى بِاللُّحَيْمِ"
      },
      {
        "id": 32887,
        "hadith_number": "4193",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keluarga Muhammad SAW Jarang Kenyang Dengan Roti Gandum",
        "perawi_melayu": "Tidak dinyatakan dalam data asal",
        "english_text": "Not Available",
        "malay_translation": "Daripada baginda (Ummu Salamah), baginda berkata: \"Keluarga Muhammad SAW jarang sekali kenyang selama dua hari dengan roti gandum, melainkan salah satu harinya mereka makan kurma.\"",
        "arabic_text": "وَعَنْهَا قَالَتْ: مَا شَبِعَ آلُ مُحَمَّدٍ يَوْمَيْنِ مِنْ خُبْزِ بُرٍّ إِلَّا وَأَحَدُهُمَا تمر"
      },
      {
        "id": 32888,
        "hadith_number": "4194",
        "status": "Sahih",
        "nama_buku": "Mishkat al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kewafatan Rasulullah SAW dan Keadaan Keluarga Baginda yang Serba Kekurangan",
        "perawi_melayu": "Tiada",
        "english_text": "Tiada",
        "malay_translation": "Daripada Aisyah R.A., beliau berkata: Rasulullah SAW wafat dan kami masih belum kenyang dengan al-Aswadain (dua benda hitam, iaitu kurma dan air atau kurma dan barli).",
        "arabic_text": "وَعَنْهَا قَالَتْ: تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا شَبِعْنَا مِنَ الأسودين"
      },
      {
        "id": 32889,
        "hadith_number": "4195",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kesederhanaan Rasulullah SAW dalam Makan dan Minum",
        "perawi_melayu": "Nu'man bin Bashir",
        "english_text": "And from Nu'man ibn Bashir, he said: \"Are you not in food and drink what you want? I have seen your Prophet (peace and blessings of Allaah be upon him), and he did not find from the food enough to fill his stomach.\"",
        "malay_translation": "Daripada Nu'man bin Bashir, beliau berkata: \"Bukankah kamu semua mempunyai makanan dan minuman mengikut kehendak kamu?  Aku pernah melihat Nabi kamu (ﷺ), dan baginda tidak pernah mendapat makanan yang cukup untuk mengisi perut baginda.\" ",
        "arabic_text": "وَعَن النّعمانِ بن بشيرٍ قَالَ: أَلَسْتُمْ فِي طَعَامٍ وَشَرَابٍ مَا شِئْتُمْ؟ لَقَدْ رَأَيْتُ نَبِيَّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا يَجِدُ مِنَ الدَّقَلِ مَا يَمْلَأُ بَطْنَهُ. رَوَاهُ مُسلم"
      },
      {
        "id": 32890,
        "hadith_number": "4196",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kebencian Nabi terhadap bawang putih kerana baunya",
        "perawi_melayu": "Ayyub",
        "english_text": "And from Ayyub, who said: \"When food was brought to the Messenger of Allah (peace and blessings of Allah be upon him), he would eat from it and send the leftovers to me. And one day he sent to me a bowl from which he had not eaten because it contained garlic. So I asked him: 'Is it forbidden?' He said: 'No, but I dislike it because of its smell.' He said: 'Then I also dislike what you dislike.'\" Narrated by Muslim.",
        "malay_translation": "Daripada Ayyub, beliau berkata: \"Apabila makanan dibawa kepada Rasulullah SAW, baginda akan makan daripadanya dan menghantar lebihannya kepada saya. Dan sesungguhnya pada suatu hari baginda menghantar kepada saya semangkuk yang baginda tidak makan daripadanya kerana di dalamnya ada bawang putih. Maka saya bertanya kepada baginda: 'Adakah ia haram?' Baginda bersabda: 'Tidak, tetapi aku tidak menyukainya kerana baunya.' Beliau berkata: 'Maka sesungguhnya saya juga tidak menyukai apa yang kamu tidak sukai.'\" Riwayat Muslim.",
        "arabic_text": "وَعَن أَيُّوب قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أُتِيَ بِطَعَامٍ أَكَلَ مِنْهُ وَبَعَثَ بِفَضْلِهِ إِلَيَّ وَإِنَّهُ بَعَثَ إِلَيَّ يَوْمًا بِقَصْعَةٍ لمْ يأكُلْ مِنْهَا لأنَّ فِيهَا ثُومًا فَسَأَلْتُهُ: أَحْرَامٌ هُوَ؟ قَالَ: «لَا وَلَكِنْ أَكْرَهُهُ مِنْ أَجْلِ رِيحِهِ» . قَالَ: فَإِنِّي أَكْرَهُ مَا كرهْت. رَوَاهُ مُسلم"
      },
      {
        "id": 32891,
        "hadith_number": "4197",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menjauhi Masjid Selepas Makan Bawang Putih atau Bawang",
        "perawi_melayu": "Jabir",
        "english_text": "And from Jabir that the Prophet (ﷺ) said: \"Whoever eats garlic or onion, let him keep away from us.\" Or he said: \"Let him keep away from our mosque, or let him sit in his house.\" And the Prophet (ﷺ) was brought a pot containing greens of leek, and he found it to have a smell, so he said: \"Bring it near,\" to some of his Companions, and said: \"Eat, for I am addressing One Whom you do not address.\"",
        "malay_translation": "Dari Jabir, bahawa Nabi SAW bersabda:  “Barangsiapa makan bawang putih atau bawang, maka hendaklah dia menjauhi kami.” Atau baginda bersabda: “Hendaklah dia menjauhi masjid kami, atau hendaklah dia duduk di rumahnya.”  Dan Nabi SAW didatangi dengan periuk yang berisi sayur-sayuran daripada pucuk bawang, lalu baginda mendapati baunya, maka baginda bersabda: “Dekatkanlah ia,” kepada sebahagian sahabat baginda, dan bersabda: “Makanlah, kerana sesungguhnya aku sedang berbicara dengan Allah SWT yang kamu tidak dapat bercakap denganNya.”",
        "arabic_text": "وَعَنْ جَابِرٌ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَكَلَ ثُومًا أَوْ بَصَلًا فَلْيَعْتَزِلْنَا» أَوْ قَالَ: «فَلْيَعْتَزِلْ مَسْجِدَنَا أَوْ لِيَقْعُدْ فِي بَيْتِهِ» . وَإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِقِدْرٍ فِيهِ خَضِرَاتٌ مِنْ بُقُولٍ فَوَجَدَ لَهَا رِيحًا فَقَالَ: «قَرِّبُوهَا» إِلَى بَعْضِ أَصْحَابِهِ وَقَالَ: «كُلْ فَإِنِّي أُنَاجِي مَنْ لَا تُناجي»"
      },
      {
        "id": 32892,
        "hadith_number": "4198",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keberkatan dalam Sukatan Makanan",
        "perawi_melayu": "Al-Miqdam bin Ma'di Karib daripada Nabi SAW",
        "english_text": "And from Al-Miqdam ibn Ma'di Karib from the Prophet (ﷺ) who said: \"Measure your food, then it will be blessed for you.\"",
        "malay_translation": "Daripada Al-Miqdam bin Ma'di Karib daripada Nabi Muhammad SAW, baginda bersabda:  “Sukatlah makanan kamu, nescaya ia akan diberkati untuk kamu.”",
        "arabic_text": "وَعَن المِقدامِ بن معدي كرب عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كيلوا طَعَامك يُبَارك لكم فِيهِ» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32893,
        "hadith_number": "4199",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Doa Selepas Makan",
        "perawi_melayu": "Abu Umamah",
        "english_text": "And from Abi Umamah, that the Prophet (peace and blessings of Allah be upon him) used to say when he lifted his table: \"All praise is due to Allah, much praise, good and blessed, which is not sufficient, nor farewell, nor independent of Him, our Lord.\"",
        "malay_translation": "Daripada Abu Umamah, bahawa Nabi SAW apabila mengangkat dulangnya, baginda berdoa:  \"Segala puji bagi Allah, pujian yang banyak, yang baik dan diberkati, yang tidak mencukupi, tidak juga perpisahan, dan tidak juga Tuhan kami bebas daripadaNya.\" ",
        "arabic_text": "وَعَنْ أَبِي أُمَامَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا رَفَعَ مَائِدَتَهُ قَالَ: «الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ غَيْرَ مَكْفِيٍّ وَلَا مُوَدَّعٍ وَلَا مُسْتَغْنًى عَنْهُ رَبُّنَا» . رَوَاهُ الْبُخَارِيُّ"
      },
      {
        "id": 32894,
        "hadith_number": "4200",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kesyukuran atas Nikmat Makanan dan Minuman",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "Not Available",
        "malay_translation": "Dari Anas, katanya: Rasulullah SAW bersabda: “Sesungguhnya Allah SWT amat redha kepada hambaNya yang memakan makanan lalu memujiNya atasnya, atau meminum minuman lalu memujiNya atasnya.” Riwayat Muslim. Dan akan kami sebutkan hadis Aisyah dan Abu Hurairah: Keluarga Muhammad tidak pernah kenyang, dan Nabi SAW meninggalkan dunia ini dalam keadaan miskin. (Bab Keutamaan Orang Miskin) InsyaAllah.",
        "arabic_text": "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ تَعَالَى لَيَرْضَى عنِ العبدِ أنْ يأكلَ الأكلَةَ فيحمدُه عَلَيْهِ أَوْ يَشْرَبَ الشَّرْبَةَ فَيَحْمَدَهُ عَلَيْهَا» . رَوَاهُ مُسْلِمٌ وسنذكرُ حَدِيثي عائشةَ وَأبي هريرةَ: مَا شَبِعَ آلُ مُحَمَّدٍ وَخَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنَ الدُّنْيَا فِي «بَابِ فَضْلِ الْفُقَرَاءِ» إِنْ شَاءَ اللَّهُ تَعَالَى"
      },
      {
        "id": 32895,
        "hadith_number": "4201",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keberkatan Makanan dengan Menyebut Nama Allah",
        "perawi_melayu": "Abu Ayyub",
        "english_text": "Narrated Abu Ayyub: We were with the Prophet (peace and blessings of Allah be upon him) and food was brought near. I have never seen food that was more blessed at the beginning when we ate, nor less blessed at the end. We said: O Messenger of Allah, how is this? He said: 'Indeed, we mentioned the name of Allah upon it when we ate, then those who ate later sat down and did not mention the name of Allah, so Satan ate with them.'",
        "malay_translation": "Daripada Abu Ayyub berkata: Kami bersama Nabi SAW, lalu dihidangkan makanan. Saya tidak pernah melihat makanan yang lebih berkat pada awalnya ketika kami makan, dan tidak juga kurang berkat pada akhirnya. Kami bertanya: Wahai Rasulullah, bagaimana ini boleh terjadi? Baginda bersabda: 'Sesungguhnya kami menyebut nama Allah ketika kami makan, kemudian orang lain datang dan makan tanpa menyebut nama Allah, maka syaitan makan bersama mereka.'",
        "arabic_text": "عَن أبي أَيُّوب قَالَ: كُنَّا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُرِّبَ طَعَامٌ فَلَمْ أَرَ طَعَامًا كَانَ أَعْظَمَ بَرَكَةً مِنْهُ أَوَّلَ مَا أَكَلْنَا وَلَا أَقَلَّ بَرَكَةً فِي آخِرِهِ قُلْنَا: يَا رَسُولَ اللَّهِ كَيْفَ هَذَا؟ قَالَ: «إِنَّا ذَكَرْنَا اسْمَ اللَّهِ عَلَيْهِ حِينَ أَكَلْنَا ثُمَّ قَعَدَ مَنْ أَكَلَ وَلَمْ يُسَمِّ اللَّهَ فَأَكَلَ مَعَهُ الشَّيْطَانُ» . رَوَاهُ فِي شرح السّنة"
      },
      {
        "id": 32896,
        "hadith_number": "4202",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Doa Selepas Lupa Membaca Bismillah Ketika Makan",
        "perawi_melayu": "Aisyah r.a.",
        "english_text": "From Aishah (RA) who said: The Messenger of Allah (ﷺ) said: “If one of you eats and forgets to mention the name of Allah at the beginning of his meal, then let him say: 'Bismillah awwalahu wa akhirahu (In the name of Allah at the beginning and at the end).'”  Reported by Tirmidhi and Abu Dawud.",
        "malay_translation": "Daripada Aisyah r.a., katanya: Rasulullah SAW bersabda:  “Jika seseorang di antara kamu makan dan lupa menyebut nama Allah di awal makanannya, maka hendaklah dia berkata: ‘Bismillah awwalahu wa akhirahu (Dengan nama Allah di awal dan di akhir).’” Riwayat Tirmizi dan Abu Daud.",
        "arabic_text": "وَعَنْ عَائِشَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا أَكَلَ أَحَدُكُمْ فَنَسِيَ أَنْ يَذْكُرَ اللَّهَ عَلَى طَعَامِهِ فَلْيَقُلْ: بِسْمِ اللَّهِ أوَّلَه وآخرَه . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد"
      },
      {
        "id": 32897,
        "hadith_number": "4203",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keberkatan Menyebut Nama Allah Ketika Makan",
        "perawi_melayu": "Umayyah bin Makhshi RA",
        "english_text": "Tiada teks Bahasa Inggeris",
        "malay_translation": "Daripada Umayyah bin Makhshi RA berkata: Seorang lelaki sedang makan dan tidak menyebut nama Allah (Basmalah) sehingga tidak tinggal dari makanannya kecuali sesuap.  Apabila dia mengangkat suapan itu ke mulutnya, dia berkata: \"Dengan nama Allah, di awal dan akhirnya (Bismillah awwalahu wa akhirahu).\" Nabi SAW tertawa kemudian bersabda: \"Syaitan terus makan bersamanya, dan apabila dia menyebut nama Allah, syaitan itu memuntahkan apa yang ada di perutnya.\" (Riwayat Abu Daud).",
        "arabic_text": "وَعَن أُميَّةَ بن مَخْشِيٍّ قَالَ: كَانَ رَجُلٌ يَأْكُلُ فَلَمْ يُسَمِّ حَتَّى لَمْ يَبْقَ مِنْ طَعَامِهِ إِلَّا لُقْمَةٌ فَلَمَّا رَفَعَهَا إِلَى فِيهِ قَالَ: بِسْمِ اللَّهِ أَوَّلَهُ وَآخِرَهُ فَضَحِكَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ: «مَا زَالَ الشَّيْطَانُ يَأْكُلُ مَعَهُ فَلَمَّا ذَكَرَ اسْمَ اللَّهِ اسْتَقَاءَ مَا فِي بَطْنه» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32898,
        "hadith_number": "4204",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Doa Selepas Makan",
        "perawi_melayu": "Abu Sa'id al-Khudri",
        "english_text": "Abu Sa'id al-Khudri reported: When the Messenger of Allah (peace and blessings of Allah be upon him) finished his meal, he would say: 'All praise is due to Allah who has fed us and given us drink, and made us Muslims.' It was narrated by al-Tirmidhi, Abu Dawood, and Ibn Majah.",
        "malay_translation": "Daripada Abu Sa'id al-Khudri meriwayatkan: Apabila Rasulullah SAW selesai makan, baginda akan mengucapkan: 'Segala puji bagi Allah yang telah memberi kami makan dan minum, serta menjadikan kami Muslim.' Hadis ini diriwayatkan oleh al-Tirmidhi, Abu Dawood, dan Ibn Majah.",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا فَرَغَ مِنْ طَعَامِهِ قَالَ: «الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مُسْلِمِينَ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْن مَاجَه"
      },
      {
        "id": 32899,
        "hadith_number": "4205",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Pahala Memberi Makan dengan Syukur",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "And from Abu Hurairah, he said: The Messenger of Allah (peace and blessings of Allah be upon him) said: \"He who feeds and gives thanks is like the fasting person who is patient.\"",
        "malay_translation": "Dari Abu Hurairah, beliau berkata: Rasulullah SAW bersabda:  \"Orang yang memberi makan dan bersyukur adalah seperti orang yang berpuasa dan bersabar.\"",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الطَّاعِمُ الشَّاكِرُ كَالصَّائِمِ الصابر» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 32900,
        "hadith_number": "4206",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Sanad Hadith daripada Sinan bin Sana'",
        "perawi_melayu": "Sinan bin Sana' melalui bapanya",
        "english_text": "Not Available",
        "malay_translation": "Dan Ibn Majah dan Ad-Darimi meriwayatkan daripada Sinan bin Sana' daripada bapanya.",
        "arabic_text": "وَابْن مَاجَهْ وَالدَّارِمِيُّ عَنْ سِنَانِ بْنِ سَنَّةَ عَنْ أَبِيه"
      },
      {
        "id": 32901,
        "hadith_number": "4207",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Doa Selepas Makan dan Minum",
        "perawi_melayu": "Abu Ayyub al-Ansari",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Ayyub, beliau berkata: Rasulullah SAW apabila makan atau minum, baginda selalu berdoa:  \"Alhamdulillahilladzi ath'ama wa saqaa wa sawwaqahu wa ja'ala lahu mukhrja.\" (Segala puji bagi Allah yang memberi makan dan minum, dan yang menjadikan ia sedap dan mengeluarkannya.) Riwayat Abu Daud.",
        "arabic_text": "وَعَن أبي أيوبٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَكَلَ أَوْ شَرِبَ قَالَ: «الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَ وَسَقَى وَسَوَّغَهُ وَجَعَلَ لَهُ مخرجا» رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32902,
        "hadith_number": "4208",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Berkat Makanan: Wuduk Sebelum dan Selepas Makan",
        "perawi_melayu": "Salman al-Farsi",
        "english_text": "Not Available",
        "malay_translation": "Daripada Salman r.a., katanya: Aku telah membaca dalam Taurat bahawa keberkatan makanan ialah berwuduk selepas makan. Maka aku ceritakan hal itu kepada Nabi SAW, lalu Baginda SAW bersabda: “Keberkatan makanan ialah berwuduk sebelum dan selepas makan.” Riwayat Tirmizi dan Abu Daud.",
        "arabic_text": "وَعَن سلمانَ قَالَ: قَرَأْتُ فِي التَّوْرَاةِ أَنَّ بَرَكَةَ الطَّعَامِ الْوُضُوءُ بَعْدَهُ فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «بَرَكَةُ الطَّعَامِ الْوُضُوءُ قَبْلَهُ وَالْوُضُوءُ بعدَه» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد"
      },
      {
        "id": 32903,
        "hadith_number": "4209",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Wudhu Sebelum Solat",
        "perawi_melayu": "Ibnu Abbas",
        "english_text": "And from Ibn Abbas that the Prophet (ﷺ) came out from the toilet and food was presented to him. They said: Shall we bring you water for ablution? He said: “I have been commanded to perform ablution only when I intend to pray.”",
        "malay_translation": "Daripada Ibnu Abbas, bahawa Nabi SAW keluar dari tandas dan makanan dihidangkan kepadanya. Mereka berkata: Patutkah kami bawakan air wuduk untuk tuan? Baginda SAW bersabda: “Aku hanya diperintahkan untuk berwuduk apabila aku hendak mendirikan solat.”",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنَ الْخَلَاءِ فَقُدِّمَ إِلَيْهِ طَعَامٌ فَقَالُوا: أَلَا نَأْتِيكَ بِوَضُوءٍ؟ قَالَ: «إِنَّمَا أُمِرْتُ بِالْوُضُوءِ إِذَا قُمْتُ إِلَى الصَّلَاةِ» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد وَالنَّسَائِيّ"
      },
      {
        "id": 32904,
        "hadith_number": "4210",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Riwayat Hadis daripada Abu Hurairah",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Not Available",
        "malay_translation": "Hadis ini diriwayatkan oleh Ibn Majah daripada Abu Hurairah.",
        "arabic_text": "وَرَوَاهُ ابْن مَاجَه عَن أبي هُرَيْرَة"
      },
      {
        "id": 32905,
        "hadith_number": "4211",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Berkat dalam Makanan",
        "perawi_melayu": "Ibnu Abbas daripada Nabi SAW",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Abbas daripada Nabi Muhammad SAW, bahawa baginda telah dihidangkan dengan sebuah pinggan berisi makanan (thariid). Baginda bersabda: \"Makanlah dari tepi pinggan dan jangan makan dari tengahnya, kerana keberkatan itu turun di tengahnya.\"  (Riwayat Tirmizi, Ibnu Majah dan Darimi. Tirmizi berkata: Hadis ini adalah hadis Hasan Sahih.)",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَنَّهُ أُتِيَ بِقَصْعَةٍ مِنْ ثَرِيدٍ فَقَالَ: «كُلُوا مِنْ جَوَانِبِهَا وَلَا تَأْكُلُوا مِنْ وَسَطِهَا فَإِنَّ الْبَرَكَةَ تَنْزِلُ فِي وَسَطِهَا» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حسن صَحِيح"
      },
      {
        "id": 32906,
        "hadith_number": "4212",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Tidak Makan Sambil Bersandar dan Tidak Menjejak Tumit",
        "perawi_melayu": "Abdullah bin Amr",
        "english_text": "From Abdullah bin Amr, he said: \"The Messenger of Allah (peace and blessings of Allah be upon him) was never seen eating while reclining, nor did he ever put his heels on two men's feet.\"",
        "malay_translation": "Daripada Abdullah bin Amr, beliau berkata:  \"Rasulullah SAW tidak pernah dilihat makan sambil bersandar, dan tidak pernah menjejakkan tumitnya di atas kaki dua orang lelaki.\"",
        "arabic_text": "وَعَن عبد الله بن عَمْرو قَالَ: مَا رُئِيَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ مُتَّكِئًا قَطُّ وَلَا يَطَأُ عقبه رجلَانِ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32907,
        "hadith_number": "4213",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah s.a.w. Makan dan Solat Bersama Sahabat",
        "perawi_melayu": "Abdullah bin al-Harith bin Juz'",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abdullah bin al-Harith bin Juz', katanya:  Kami datang kepada Rasulullah s.a.w. membawa roti dan daging ketika Baginda berada di masjid. Baginda makan dan kami makan bersama Baginda. Kemudian Baginda berdiri dan solat, dan kami solat bersama Baginda.  Kami hanya menyapu tangan kami dengan batu-batu kecil.  Riwayat Ibnu Majah.",
        "arabic_text": "وَعَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ جَزْءٍ قَالَ: أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِخُبْزٍ وَلَحْمٍ وَهُوَ فِي الْمَسْجِدِ فَأَكَلَ وَأَكَلْنَا مَعَهُ ثُمَّ قَامَ فَصَلَّى وَصَلَّيْنَا مَعَهُ وَلَمْ نَزِدْ عَلَى أَنْ مَسَحْنَا أَيْدِيَنَا بِالْحَصْبَاءِ. رَوَاهُ ابْن مَاجَه"
      },
      {
        "id": 32908,
        "hadith_number": "4214",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW dan Daging Kambing",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Narrated Abu Hurairah:  The Messenger of Allah (ﷺ) was brought some meat, and a part of it was presented to him on a plate. He liked it, so he ate from it.",
        "malay_translation": "Dari Abu Hurairah r.a., katanya:  Rasulullah SAW dihidangkan daging, dan sebahagian daripadanya dihulurkan kepadanya di atas pinggan. Baginda menyukainya, lalu Baginda memakannya.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِلَحْمٍ فَرُفِعَ إِلَيْهِ الذِّرَاعُ وَكَانَتْ تُعْجِبُهُ فَنَهَسَ مِنْهَا. رَوَاهُ التِّرْمِذِيُّ وَابْن مَاجَه"
      },
      {
        "id": 32909,
        "hadith_number": "4215",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menghindari Memotong Daging dengan Pisau",
        "perawi_melayu": "Aisyah",
        "english_text": "From Aishah (RA) who said: The Messenger of Allah (peace be upon him) said: “Do not cut the meat with a knife, for it is the way of the foreigners (ajam); rather, tear it apart, for that is more palatable and blessed.” Abu Dawud and Al-Bayhaqi in Shu'ab Al-Iman narrated it and they said: “It is not strong (hadith)”.",
        "malay_translation": "Daripada Aisyah r.a. katanya: Rasulullah s.a.w. bersabda: “Janganlah kamu potong daging dengan pisau, kerana ia adalah cara orang-orang asing (ajam); sebaliknya, koyakkanlah ia, kerana ia lebih sedap dan berkat.” Abu Daud dan Al-Baihaqi di dalam Syu’ab Al-Iman meriwayatkannya dan mereka berkata: “Ia bukanlah hadis yang kuat.”",
        "arabic_text": "وَعَنْ عَائِشَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَقْطَعُوا اللَّحْمَ بِالسِّكِّينِ فَإِنَّهُ مِنْ صُنْعِ الْأَعَاجِمِ وَانْهَسُوهُ فَإِنَّهُ أَهْنَأُ وَأَمْرَأُ» . رَوَاهُ أَبُو دَاوُدَ وَالْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ وَقَالا: ليسَ هُوَ بِالْقَوِيّ"
      },
      {
        "id": 32910,
        "hadith_number": "4216",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nasihat Rasulullah SAW kepada Ali RA tentang Pemakanan Semasa Pemulihan",
        "perawi_melayu": "Ummu al-Mundhir RA",
        "english_text": "On the authority of Ummu al-Mundhir RA who said: The Messenger of Allah (peace and blessings be upon him) entered upon me, and with him was Ali (RA), and we had dates hanging. The Messenger of Allah (peace and blessings be upon him) started eating, and Ali (RA) ate with him. The Messenger of Allah (peace and blessings be upon him) said to Ali (RA): \"Stop, O Ali, for indeed you are in a recovery period (from illness).\" Ummu al-Mundhir said: So I made for them beetroot and barley. The Prophet (peace and blessings be upon him) said: \"O Ali, eat from this, for indeed it is more suitable for you.\" Narrated by Ahmad, Tirmidhi, and Ibn Majah.",
        "malay_translation": "Daripada Ummu al-Mundhir RA berkata: Rasulullah SAW masuk menemuiku dan bersamanya Ali RA, dan kami mempunyai tandan kurma yang tergantung. Rasulullah SAW mula makan dan Ali RA makan bersamanya. Lalu Rasulullah SAW bersabda kepada Ali RA: \"Berhenti wahai Ali, sesungguhnya kamu sedang dalam masa pemulihan (dari sakit).\" Ummu al-Mundhir berkata: Lalu aku buatkan untuk mereka berdua sayur bit dan barli. Nabi SAW bersabda: \"Wahai Ali, makanlah dari ini, kerana sesungguhnya ia lebih sesuai untukmu.\" Riwayat Ahmad, Tirmidzi dan Ibnu Majah.",
        "arabic_text": "وَعَن أُمِّ المنذِر قَالَتْ: دَخَلَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَهُ عَلِيٌّ وَلَنَا دَوَالٍ مُعَلَّقَةٌ فَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ وَعَلِيٌّ مَعَهُ يَأْكُلُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَلِيٍّ: «مَهْ يَا عَلِيُّ فَإِنَّكَ نَاقِهٌ» قَالَتْ: فَجَعَلْتُ لَهُمْ سِلْقًا وَشَعِيرًا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا عَلِيُّ مِنْ هَذَا فَأَصِبْ فَإِنَّهُ أَوْفَقُ لَكَ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ"
      },
      {
        "id": 32911,
        "hadith_number": "4217",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Menggemari Anak-Anak Kecil",
        "perawi_melayu": "Anas r.a.",
        "english_text": "From Anas, he said: The Messenger of Allah (peace and blessings be upon him) liked children.",
        "malay_translation": "Dari Anas, beliau berkata: Rasulullah SAW (shallallahu ‘alaihi wasallam) menyukai kanak-kanak.",
        "arabic_text": "وَعَنْ أَنَسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعْجِبُهُ الثُّفْلُ. رَوَاهُ التِّرْمِذِيُّ وَالْبَيْهَقِيُّ فِي شعب الْإِيمَان"
      },
      {
        "id": 32912,
        "hadith_number": "4218",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kebersihan Pinggan",
        "perawi_melayu": "Nubaishah daripada Rasulullah SAW",
        "english_text": "From Nubaishah from the Messenger of Allah (peace and blessings be upon him) who said: “Whoever eats from a bowl and then licks it clean, the bowl will seek forgiveness for him.”",
        "malay_translation": "Daripada Nubaishah daripada Rasulullah SAW, baginda bersabda:  “Barangsiapa yang makan daripada sebuah mangkuk, kemudian menjilatnya sehingga bersih, nescaya mangkuk itu akan memohon keampunan untuknya.”",
        "arabic_text": "وَعَن نُبَيْشَة عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَكَلَ فِي قَصْعَةٍ فَلَحَسَهَا اسْتَغْفَرَتْ لَهُ الْقَصْعَةُ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيب"
      },
      {
        "id": 32913,
        "hadith_number": "4219",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tanggungjawab Kebersihan Diri",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "From Abu Hurairah, he said: The Messenger of Allah (peace and blessings of Allah be upon him) said: “Whoever sleeps at night with something in his hand that he has not washed, and something happens to him, then let him not blame anyone except himself.”",
        "malay_translation": "Dari Abu Hurairah, beliau berkata: Rasulullah SAW bersabda:  “Sesiapa yang tidur pada waktu malam dengan sesuatu di tangannya yang belum dibasuhnya, dan sesuatu berlaku kepadanya, maka janganlah dia menyalahkan sesiapa melainkan dirinya sendiri.”",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ بَاتَ وَفِي يَدِهِ غَمَرٌ لَمْ يَغْسِلْهُ فَأَصَابَهُ شَيْءٌ فَلَا يَلُومَنَّ إِلَّا نَفْسَهُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْن مَاجَه"
      },
      {
        "id": 32914,
        "hadith_number": "4220",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Makanan Kesukaan Rasulullah",
        "perawi_melayu": "Ibnu Abbas",
        "english_text": "And from Ibn Abbas, he said: The most beloved food to the Messenger of Allah (peace and blessings be upon him) was Tharid made from bread and Tharid made from  wheat. Abu Dawud narrated it.",
        "malay_translation": "Daripada Ibnu Abbas, beliau berkata:  Makanan yang paling disukai oleh Rasulullah SAW ialah Tharid yang diperbuat daripada roti dan Tharid yang diperbuat daripada gandum.  Riwayat Abu Daud.",
        "arabic_text": "وَعَن ابنِ عبَّاسٍ قَالَ: كَانَ أَحَبَّ الطَّعَامَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الثَّرِيدُ مِنَ الْخُبْزِ والثريدُ منَ الحَيسِ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32915,
        "hadith_number": "4221",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kegunaan Minyak Zaitun",
        "perawi_melayu": "Abu Usayd al-Ansari",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Usayd al-Ansari, katanya: Rasulullah SAW bersabda:  “Makanlah minyak zaitun dan sapukanlah dengannya kerana ia daripada pokok yang diberkati.”  Riwayat Tirmizi, Ibnu Majah dan Darimi.",
        "arabic_text": "وَعَن أبي أُسَيدٍ الْأَنْصَارِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كَلُوا الزَّيْتَ وَادَّهِنُوا بِهِ فَإِنَّهُ مِنْ شَجَرَةٍ مُبَارَكَةٍ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ"
      },
      {
        "id": 32916,
        "hadith_number": "4222",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keberkatan Cuka di Dalam Rumah",
        "perawi_melayu": "Ummu Hani'",
        "english_text": "On the authority of Umm Hani, who said: The Prophet (peace and blessings of Allah be upon him) entered upon me and said, 'Do you have anything (to eat)?' I said, 'No, except for dry bread and vinegar.' He said, 'Bring it. A house is not devoid of food if there is vinegar in it.' Reported by At-Tirmidhi, who said: This is a Hasan Gharib Hadith.",
        "malay_translation": "Daripada Ummu Hani' berkata: Nabi ﷺ masuk menemuiku lalu bersabda, 'Adakah kamu mempunyai sesuatu (untuk dimakan)?' Aku berkata, 'Tidak, kecuali roti kering dan cuka.' Baginda bersabda, 'Bawakanlah. Tidaklah sunyi sesebuah rumah dari makanan jika ada cuka di dalamnya.' Riwayat at-Tirmizi dan beliau berkata: Hadith ini Hasan Gharib.",
        "arabic_text": "وَعَن أم هَانِئ قَالَتْ: دَخَلَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «أَعِنْدَكِ شَيْءٌ» قُلْتُ: لَا إِلَّا خُبْزٌ يَابِسٌ وَخَلٌّ فَقَالَ: «هَاتِي مَا أَقْفَرَ بَيْتٌ مِنْ أَدَمٍ فِيهِ خَلٌّ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ"
      },
      {
        "id": 32917,
        "hadith_number": "4223",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah Makan Roti Jelai dengan Kurma",
        "perawi_melayu": "Yusuf bin Abdillah bin Salam",
        "english_text": "And from Yusuf ibn Abdillah ibn Salam, he said: I saw the Prophet (ﷺ) take a piece of barley bread and put a date on it, and he said: “This is the relish of this,” and he ate it. Reported by Abu Dawud.",
        "malay_translation": "Daripada Yusuf bin Abdillah bin Salam, beliau berkata: Aku melihat Nabi SAW mengambil sekeping roti jelai dan meletakkan sebiji tamar di atasnya, lalu baginda bersabda: “Inilah penambah selera bagi ini,” kemudian baginda memakannya. Riwayat Abu Daud.",
        "arabic_text": "وَعَنْ يُوسُفَ بْنِ عَبْدِ اللَّهِ بْنِ سَلَامٍ قَالَ: رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَ كِسْرَةً مِنْ خُبْزِ الشَّعِيرِ فَوَضَعَ عَلَيْهَا تَمْرَةً فَقَالَ: «هَذِهِ إِدَامُ هَذِهِ» وَأَكَلَ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32918,
        "hadith_number": "4224",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Lawatan Nabi SAW Kepada Orang Sakit dan Rawatan Dengan Kurma Ajwa",
        "perawi_melayu": "Sa'ad",
        "english_text": "It is narrated from Sa'ad that he said: I fell ill with an illness, and the Prophet (ﷺ) came to visit me. He placed his hand between my breasts until I felt its coolness on my heart, and he said: “You are a man whose heart is sound. Go to Al-Harith ibn Khalid, the brother of Thaqif, for he is a physician; let him take seven dates from the Ajwa of Madinah, let him remove their stones, and then let him chew them and give them to you.” Abu Dawud narrated it.",
        "malay_translation": "Daripada Sa'ad, beliau berkata: Aku telah sakit, lalu Nabi SAW datang melawatku. Baginda meletakkan tangannya di antara dadaku sehingga aku merasakan kesejukannya di hatiku, dan Baginda bersabda: “Sesungguhnya engkau adalah seorang lelaki yang hatinya sihat. Pergilah kepada Al-Harith bin Khalid, saudara Thaqif, kerana dia adalah seorang doktor; suruh dia mengambil tujuh biji tamar daripada tamar Ajwa Madinah, buangkan bijinya, kemudian dia mengunyahnya dan berikan kepadamu.”  Riwayat Abu Dawud.",
        "arabic_text": "وَعَن سعدٍ قَالَ: مَرِضْتُ مَرَضًا أَتَانِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعُودُنِي فَوَضَعَ يَدَهُ بَيْنَ ثَدْيِيَّ حَتَّى وَجَدْتُ بَرْدَهَا عَلَى فُؤَادِي وَقَالَ: «إِنَّكَ رجلٌ مفْؤودٌ ائْتِ الْحَارِثَ بْنَ كَلَدَةَ أَخَا ثَقِيفٍ فَإِنَّهُ رجل يتطبب فليأخذ سبع تمرات منم عَجْوَةِ الْمَدِينَةِ فَلْيَجَأْهُنَّ بِنَوَاهُنَّ ثُمَّ لِيَلُدَّكَ بِهِنَّ» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32919,
        "hadith_number": "4225",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi SAW Makan Tembikai dengan Kurma",
        "perawi_melayu": "Aisyah",
        "english_text": "From 'Aishah that the Prophet (peace and blessings of Allaah be upon him) used to eat watermelon with dates.",
        "malay_translation": "Daripada Aisyah bahawa Nabi Muhammad SAW memakan tembikai dengan kurma.  Imam Tirmizi meriwayatkan, dan Abu Daud menambah:  Baginda bersabda, “Ia (kurma) mematahkan kepanasan ini (tembikai) dan ia (tembikai) mematahkan kesejukan ini (kurma).”  Imam Tirmizi berkata:  Hadis ini adalah hadis Hasan Gharib.",
        "arabic_text": "وَعَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْكُلُ الْبِطِّيخَ بِالرُّطَبِ. رَوَاهُ التِّرْمِذِيُّ وَزَادَ أَبُو دَاوُدَ: وَيَقُولُ: «يَكْسِرُ حَرَّ هَذَا بِبَرْدِ هَذَا وَبَرْدَ هَذَا بِحَرِّ هَذَا» . وَقَالَ التِّرْمِذِيّ: هَذَا حَدِيث حسن غَرِيب"
      },
      {
        "id": 32920,
        "hadith_number": "4226",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi SAW Memeriksa Kurma Lama",
        "perawi_melayu": "Anas RA",
        "english_text": "Narrated Anas: The Prophet (peace and blessings of Allah be upon him) was brought old dates, so he started to inspect them and take out the weevils from them. Related by Abu Dawood.",
        "malay_translation": "Daripada Anas RA berkata: Nabi SAW telah didatangkan dengan kurma yang lama, lalu baginda mula memeriksa kurma tersebut dan mengeluarkan ulat daripadanya. Riwayat Abu Daud.",
        "arabic_text": "وَعَن أَنَسٍ قَالَ: أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِتَمْرٍ عَتِيقٍ فَجَعَلَ يُفَتِّشُهُ وَيُخْرِجُ السُّوسَ مِنْهُ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32921,
        "hadith_number": "4227",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi SAW Memotong Keju dengan Menyebut Nama Allah",
        "perawi_melayu": "Diriwayatkan daripada Ibn Umar RA",
        "english_text": "From Ibn Umar, he said: The Prophet (peace and blessings be upon him) was brought cheese in Tabuk. He asked for a knife, mentioned Allah's name, and cut it.",
        "malay_translation": "Daripada Ibn Umar RA, beliau berkata: Nabi SAW telah dihidangkan keju di Tabuk. Baginda meminta pisau, menyebut nama Allah, dan memotongnya.",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ قَالَ: أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِجُبُنَّةٍ فِي تَبُوكَ فَدَعَا بالسكين فسمَّى وقطَعَ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32922,
        "hadith_number": "4228",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hukum Minyak Sapi, Keju, dan Keldai Liar",
        "perawi_melayu": "Salman",
        "english_text": "And from Salman who said: The Messenger of Allah, peace and blessings be upon him, was asked about clarified butter, cheese, and wild donkey. He said: 'What Allah has made lawful in His Book is lawful, and what Allah has forbidden in His Book is forbidden, and what He is silent about is among that which He has pardoned.' Reported by Ibn Majah and al-Tirmidhi, and he said: This is a gharib hadith and mawquf according to the more correct view.",
        "malay_translation": "Daripada Salman berkata: Rasulullah SAW ditanya tentang minyak sapi, keju, dan keldai liar. Baginda bersabda: 'Apa yang Allah halalkan dalam Kitab-Nya adalah halal, dan apa yang Allah haramkan dalam Kitab-Nya adalah haram, dan apa yang Dia diamkan adalah termasuk apa yang dimaafkan-Nya.' Riwayat Ibn Majah dan al-Tirmidhi, dan beliau berkata: Hadis ini gharib dan mawquf menurut pandangan yang lebih sahih.",
        "arabic_text": "وَعَنْ سَلْمَانَ قَالَ: سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ السَّمْنِ وَالْجُبْنِ وَالْفِرَاءِ فَقَالَ: «الْحَلَالُ مَا أَحَلَّ اللَّهُ فِي كِتَابِهِ وَالْحَرَامُ مَا حَرَّمَ اللَّهُ فِي كِتَابِهِ وَمَا سَكَتَ عَنْهُ فَهُوَ مِمَّا عَفَا عَنْهُ» . رَوَاهُ ابْنُ مَاجَهْ وَالتِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ وموقوفٌ على الأصحِّ"
      },
      {
        "id": 32923,
        "hadith_number": "4229",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kerinduan Rasulullah SAW akan Roti",
        "perawi_melayu": "Ibnu Umar",
        "english_text": "From Ibn Umar, he said: The Messenger of Allah (ﷺ) said: \"I wish I had with me a white loaf of bread made from brown flour, smeared with butter and milk.\"",
        "malay_translation": "Daripada Ibnu Umar, beliau berkata: Rasulullah SAW bersabda:  “Aku menginginkan sekiranya aku mempunyai sebuku roti putih daripada tepung gandum perang, disapu dengan mentega dan susu.”",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَدِدْتُ أَنَّ عِنْدِي خُبزةً بيضاءَ منْ بُرَّةٍ سَمْرَاءَ مُلَبَّقَةً بِسَمْنٍ وَلَبَنٍ» فَقَامَ رَجُلٌ مِنَ الْقَوْمِ فَاتَّخَذَهُ فَجَاءَ بِهِ فَقَالَ: «فِي أَيِّ شَيْءٍ كَانَ هَذَا؟» قَالَ فِي عُكَّةِ ضَبٍّ قَالَ: «ارْفَعْهُ» . رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ وَقَالَ أَبُو دَاوُد: هَذَا حَدِيث مُنكر"
      },
      {
        "id": 32924,
        "hadith_number": "4230",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Makan Bawang Putih Mentah",
        "perawi_melayu": "Ali r.a.",
        "english_text": "Narrated Ali (RA): Allah's Messenger (ﷺ) forbade eating raw garlic.",
        "malay_translation": "Daripada Ali r.a., katanya: Rasulullah SAW melarang memakan bawang putih mentah. Riwayat Tirmizi dan Abu Daud.",
        "arabic_text": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَن أَكْلِ الثُّومِ إِلَّا مَطْبُوخًا. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد"
      },
      {
        "id": 32925,
        "hadith_number": "4231",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Makan Makanan Berbawang",
        "perawi_melayu": "Abu Ziyad",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Ziyad, katanya: Aisyah ditanya tentang bawang, maka beliau berkata: Sesungguhnya makanan terakhir yang dimakan oleh Rasulullah SAW ialah makanan yang mengandungi bawang.  (Riwayat Abu Daud)",
        "arabic_text": "وَعَن أبي زيادٍ قَالَ: سُئلتْ عائشةُ عَنِ الْبَصَلِ فَقَالَتْ: إِنَّ آخِرَ طَعَامٍ أَكَلَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَعَامُ فِيهِ بصل. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32926,
        "hadith_number": "4232",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Memakan Mentega dan Kurma",
        "perawi_melayu": "Ibn Busr As-Sulami",
        "english_text": "From Ibn Busr As-Sulami, they said: The Messenger of Allah (peace and blessings of Allah be upon him) came to us, and we presented him with butter and dates, and he loved butter and dates.",
        "malay_translation": "Daripada Ibn Busr As-Sulami, mereka berkata: Rasulullah SAW datang kepada kami, dan kami menghidangkan baginda mentega dan kurma, dan baginda menyukai mentega dan kurma.",
        "arabic_text": "وَعَن ابْنيْ بُسرٍ السُّلَمِيَّين قَالَا: دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَدَّمْنَا زُبْدًا وَتَمْرًا وَكَانَ يُحِبُّ الزبدَ والتمرِ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32927,
        "hadith_number": "4233",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Adab Makan dan Wuduk",
        "perawi_melayu": "Ukras bin Dzuaib",
        "english_text": "Not Available",
        "malay_translation": "Dari Ukras bin Dzuaib, katanya: “Kami dihidangkan dengan sebuah bekas yang banyak berisi makanan berupa  thariid dan wadzir. Aku menyendok dengan tanganku ke beberapa bahagiannya, dan Rasulullah ﷺ memakan dari bahagian hadapannya. Kemudian baginda memegang tanganku kanan dengan tangan baginda yang kiri, lalu bersabda: “Wahai Ukras, makanlah dari satu tempat sahaja, kerana ia adalah makanan yang sama jenisnya.” Kemudian kami dihidangkan dengan sebuah pinggan berisi pelbagai jenis tamar. Aku mula memakan dari bahagian hadapanku, dan tangan Rasulullah ﷺ  bergerak-gerak di atas pinggan itu. Baginda bersabda: “Wahai Ukras, makanlah dari mana-mana sahaja yang engkau suka, kerana ia adalah pelbagai jenis.” Kemudian kami dihidangkan dengan air. Rasulullah ﷺ membasuh tangan baginda, dan mengusap kelembapan pada kedua tapak tangannya ke muka, lengan, dan kepala baginda. Baginda bersabda: “Wahai Ukras, inilah cara berwuduk daripada apa yang telah diubah oleh api.” Riwayat Tirmizi.",
        "arabic_text": "وَعَنْ عِكْرَاشِ بْنِ ذُؤَيْبٍ قَالَ: أُتِينَا بِجَفْنَةٍ كَثِيرَة من الثَّرِيدِ وَالْوَذْرِ فَخَبَطْتُ بِيَدِي فِي نَوَاحِيهَا وَأَكَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ بَيْنِ يَدَيْهِ فَقَبَضَ بِيَدِهِ الْيُسْرَى عَلَى يَدِيَ الْيُمْنَى ثُمَّ قَالَ: «يَا عِكْرَاشُ كُلْ مِنْ مَوْضِعٍ وَاحِدٍ فَإِنَّهُ طَعَامٌ وَاحِدٌ» . ثُمَّ أَتَيْنَا بِطَبَقٍ فِيهِ أَلْوَانُ التَّمْرِ فَجَعَلْتُ آكُلُ مِنْ بَيْنِ يَدَيَّ وَجَالَتْ يَدُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الطبقِ فَقَالَ: «يَا عِكْرَاشُ كُلْ مِنْ حَيْثُ شِئْتَ فَإِنَّهُ غَيْرُ لَوْنٍ وَاحِدٍ» ثُمَّ أَتَيْنَا بِمَاءٍ فَغَسَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَيْهِ وَمسح بَلل كَفَّيْهِ وَجْهَهُ وَذِرَاعَيْهِ وَرَأْسَهُ وَقَالَ: «يَا عِكْرَاشُ هَذَا الْوُضُوءُ مِمَّا غَيَّرَتِ النَّارُ» . رَوَاهُ التِّرْمِذِيُّ"
      },
      {
        "id": 32928,
        "hadith_number": "4234",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keutamaan Hisap (Minuman Hangat) Untuk Pesakit",
        "perawi_melayu": "Aisyah r.a.",
        "english_text": "And from ‘Aishah, she said: The Messenger of Allah (ﷺ) when his family were afflicted with illness, he ordered that a drink (of something warm) be prepared, and then he ordered them to drink from it.  And he used to say: “Verily, it softens the heart of the grieved, and relieves the heart of the sick, just as one of you removes dirt from her face with water.”",
        "malay_translation": "Daripada Aisyah r.a., katanya: Rasulullah SAW apabila ahli keluarganya ditimpa penyakit, baginda memerintahkan supaya disediakan minuman (hangat), kemudian baginda memerintahkan mereka untuk meminumnya. Dan baginda selalu berkata:  \"Sesungguhnya ia sungguh melembutkan hati orang yang berduka dan melegakan hati orang yang sakit, sebagaimana salah seorang daripada kamu menghilangkan kotoran dari mukanya dengan air.\" ",
        "arabic_text": "وَعَنْ عَائِشَةَ قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَخَذَ أَهْلَهُ الْوَعْكُ أَمَرَ بِالْحَسَاءِ فصُنعَ ثمَّ أَمر فَحَسَوْا مِنْهُ وَكَانَ يَقُولُ: «إِنَّهُ لَيَرْتُو فُؤَادُ الحزين ويسرو عَن فؤاد السقيم كَمَا تسروا إِحْدَاكُنَّ الْوَسَخَ بِالْمَاءِ عَنْ وَجْهِهَا» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ"
      },
      {
        "id": 32929,
        "hadith_number": "4235",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kehebatan Kurma Ajwa dan Kecambah",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah, katanya: Rasulullah SAW bersabda:  “Kurma Ajwa adalah daripada syurga, dan di dalamnya terdapat penawar racun. Manakala  kecambah pula adalah daripada manna, dan airnya adalah penawar bagi penyakit mata.” Riwayat Tirmizi.",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْعَجْوَةُ مِنَ الْجَنَّةِ وَفِيهَا شِفَاءٌ مِنَ السُّمِّ وَالْكَمْأَةُ مِنَ الْمَنِّ وماؤُها شفاءٌ للعينِ» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 32930,
        "hadith_number": "4236",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah s.a.w. Memotong Daging dan Menjawab Soal Bilal",
        "perawi_melayu": "Al-Mughirah bin Syu'bah",
        "english_text": "From Al-Mughirah ibn Shu'bah, who said: I spent a night with the Messenger of Allah (peace and blessings be upon him). He ordered a piece of meat to be roasted. Then he took the knife and began to cut it for me. Then Bilal came to call the adhan for prayer, so he threw down the knife and said, \"What is wrong with him that his hands are dusty?\" He added, \"His mustache was long\", and said to me, \"Should I cut it with a siwak? Or shall I have it cut with a siwak?\"",
        "malay_translation": "Daripada Al-Mughirah bin Syu'bah, katanya: Aku telah bermalam bersama Rasulullah SAW. Baginda menyuruh supaya seketul daging dibakar. Kemudian baginda mengambil pisau dan mula memotongnya untukku. Kemudian datanglah Bilal untuk memberi azan solat, maka baginda meletakkan pisau itu dan berkata, “Apakah salahnya dia sehingga tangannya berdebu?” Baginda menambah, “Misainya panjang”, dan berkata kepadaku, “Patutkah aku mengguntingnya dengan siwak? Atau patutkah aku suruh ia digunting dengan siwak?”",
        "arabic_text": "عَن المغيرةِ بن شعبةَ قَالَ: ضِفْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ فَأَمَرَ بِجَنْبٍ فَشُوِيَ ثُمَّ أَخَذَ الشَّفْرَةَ فَجَعَلَ يَحُزُّ لِي بِهَا مِنْهُ فَجَاءَ بِلَالٌ يُؤْذِنُهُ بِالصَّلَاةِ فَأَلْقَى الشَّفْرَةَ فَقَالَ: «مَا لَهُ تَرِبَتْ يَدَاهُ؟» قَالَ: وَكَانَ شارِبُه وَفَاء فَقَالَ لي: «أُقْصُّه عَلَى سِوَاكٍ؟ أَوْ قُصَّهُ عَلَى سِوَاكٍ» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 32931,
        "hadith_number": "4237",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Adab Makan Bersama Rasulullah",
        "perawi_melayu": "Hudzaifah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Hudzaifah r.a., katanya: \"Kami, apabila hadir bersama Nabi SAW semasa makan, kami tidak meletakkan tangan kami sehingga Rasulullah SAW mula meletakkan tangan baginda.  Pada suatu ketika, kami hadir bersama baginda untuk makan, maka datanglah seorang hamba perempuan seolah-olah ditolak, lalu dia hendak meletakkan tangannya ke dalam makanan.  Maka Rasulullah SAW memegang tangannya. Kemudian datang seorang Badwi seolah-olah ditolak, lalu baginda memegang tangannya. Maka Rasulullah SAW bersabda:  'Sesungguhnya syaitan menghalalkan makanan yang tidak disebut nama Allah ke atasnya.  Sesungguhnya dia datang dengan hamba perempuan ini untuk menghalalkannya melalui dirinya, maka Aku memegang tangannya.  Kemudian dia datang dengan Badwi ini untuk menghalalkannya melalui dirinya, maka Aku memegang tangannya.  Demi jiwa yang di tangan-Nya, sesungguhnya tangannya di dalam tanganku bersama tangannya.'  (Dalam riwayat lain ditambah): Kemudian baginda menyebut nama Allah dan makan.\"  (Riwayat Muslim)",
        "arabic_text": "وَعَن حُذيفةَ قَالَ: كُنَّا إِذَا حَضَرْنَا مَعَ النَّبِيِّ صَلَّى الله عَلَيْهِ وَسلم لَمْ نَضَعْ أَيْدِيَنَا حَتَّى يَبْدَأُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَضَعُ يَدَهُ وَإِنَّا حَضَرْنَا مَعَهُ مَرَّةً طَعَامًا فَجَاءَتْ جَارِيَةٌ كَأَنَّهَا تُدْفَعُ فَذَهَبَتْ لِتَضَعَ يَدَهَا فِي الطَّعَامِ فَأَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهَا ثُمَّ جَاءَ أَعْرَابِيٌّ كَأَنَّمَا يُدْفَعُ فَأَخَذَهُ بِيَدِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الشَّيْطَانَ يَسْتَحِلُّ الطَّعَامَ أَنْ لَا يُذْكَرَ اسمُ اللَّهِ عليهِ وإِنَّه جَاءَ بِهَذِهِ الْجَارِيَةِ لِيَسْتَحِلَّ بِهَا فَأَخَذْتُ بِيَدِهَا فَجَاءَ بِهَذَا الْأَعْرَابِيِّ لِيَسْتَحِلَّ بِهِ فَأَخَذْتُ بِيَدِهِ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّ يَدَهُ فِي يَدِي مَعَ يَدِهَا» . زَادَ فِي رِوَايَةٍ: ثُمَّ ذَكَرَ اسمَ اللَّهِ وأكَلَ. رَوَاهُ مُسلم"
      },
      {
        "id": 32932,
        "hadith_number": "4238",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Makan Berlebih-lebihan: Petanda Buruk",
        "perawi_melayu": "Aisyah r.a.",
        "english_text": "From Aishah (RA) that the Messenger of Allah (ﷺ) intended to buy a slave boy. He placed some dates in front of him, and the boy ate a lot. The Messenger of Allah (ﷺ) said: \"Indeed, excessive eating is an ill omen.\" And he ordered that he be returned.",
        "malay_translation": "Daripada Aisyah r.a., bahawa Rasulullah SAW hendak membeli seorang budak lelaki. Baginda meletakkan beberapa biji tamar di hadapannya, dan budak itu makan dengan banyak. Rasulullah SAW bersabda:  \"Sesungguhnya, makan berlebihan adalah petanda buruk.\"  Dan baginda memerintahkan supaya budak itu dikembalikan.",
        "arabic_text": "عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرَادَ أَنْ يَشْتَرِيَ غُلَامًا فَأَلْقَى بَيْنَ يَدَيْهِ تَمْرًا فَأَكَلَ الْغُلَامُ فَأَكْثَرَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ كَثْرَةَ الْأَكْلِ شُؤْمٌ» . وَأَمَرَ بِرَدِّهِ. رَوَاهُ الْبَيْهَقِيُّ فِي شعب الْإِيمَان"
      },
      {
        "id": 32933,
        "hadith_number": "4239",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kebaikan Garam dalam Makanan",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "It was narrated from Anas bin Malik that the Messenger of Allah (ﷺ) said: “The best of your condiments is salt.”",
        "malay_translation": "Dari Anas bin Malik, dia berkata: Rasulullah SAW bersabda:  “Yang terbaik daripada perasa makanan kamu ialah garam.”",
        "arabic_text": "وَعَنْ أَنَسِ بْنِ مَالِكٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «سَيِّدُ إِدَامِكُمُ الْمِلْحُ» . رَوَاهُ ابْنُ مَاجَهْ"
      },
      {
        "id": 32934,
        "hadith_number": "4240",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menanggalkan Kasut Semasa Makan",
        "perawi_melayu": "Riwayat daripada Baginda SAW",
        "english_text": "Not Available",
        "malay_translation": "Daripada Baginda SAW, Baginda bersabda:  “Apabila makanan dihidangkan, tanggalkan kasut kamu kerana ia lebih menyegarkan untuk kaki kamu.”",
        "arabic_text": "وَعَنْهُ قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا وُضِعَ الطَّعَامُ فَاخْلَعُوا نِعَالَكُمْ فإِنَّه أرْوَحُ لأقدامكم»"
      },
      {
        "id": 32935,
        "hadith_number": "4241",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menutup Periuk Makanan untuk Mengekalkan Berkat",
        "perawi_melayu": "Asma' binti Abu Bakar",
        "english_text": "From Asma' bint Abi Bakr: She used to say that when I brought tharid, she would order it to be covered until the smoke disappeared and she would say: I heard the Messenger of Allah (peace and blessings be upon him) saying: “It is greater for blessing.”",
        "malay_translation": "Daripada Asma' binti Abu Bakar: Baginda berkata bahawa apabila aku membawa tharid, baginda akan menyuruh supaya ia ditutup sehingga asapnya hilang dan baginda berkata: Aku mendengar Rasulullah SAW bersabda: “Ia lebih besar berkatnya.”",
        "arabic_text": "وَعَن أسماءَ بنتِ أبي بكرٍ: أَنَّهَا كَانَتْ إِذَا أَتَيْتُ بِثَرِيدٍ أَمَرَتْ بِهِ فَغُطِّيَ حَتَّى تَذْهَبَ فَوْرَةُ دُخَانِهِ وَتَقُولُ: أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُول: «هُوَ أعظم للبركة» . رَوَاهُمَا الدَّارمِيّ"
      },
      {
        "id": 32936,
        "hadith_number": "4242",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keberkatan Menjilat Pinggan",
        "perawi_melayu": "Nubaishah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Nubaishah, katanya: Rasulullah SAW bersabda: “Barangsiapa makan daripada sebuah pinggan kemudian menjilatnya, nescaya pinggan itu akan berkata kepadanya: ‘Semoga Allah membebaskanmu daripada api neraka sebagaimana engkau telah membebaskanku daripada syaitan.’",
        "arabic_text": "وَعَن نُبَيْشَة قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ أَكَلَ فِي قَصْعَةٍ ثُمَّ لَحِسَهَا تَقُولُ لَهُ الْقَصْعَةُ: أَعْتَقَكَ اللَّهُ مِنَ النَّارِ كَمَا أعتقتَني منَ الشيطانِ . رَوَاهُ رزين"
      },
      {
        "id": 32937,
        "hadith_number": "4243",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Memelihara Tetamu, Jiran dan Menjaga Lisan",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "From Abu Hurairah, who said: The Messenger of Allah (ﷺ) said: \"Whoever believes in Allah and the Last Day should honor his guest, and whoever believes in Allah and the Last Day should not harm his neighbor, and whoever believes in Allah and the Last Day should speak good or remain silent.\"",
        "malay_translation": "Dari Abu Hurairah, katanya: Rasulullah SAW bersabda:  “Barang siapa yang beriman kepada Allah dan hari akhirat hendaklah memuliakan tetamunya, dan barang siapa yang beriman kepada Allah dan hari akhirat hendaklah jangan menyakiti jirannya, dan barang siapa yang beriman kepada Allah dan hari akhirat hendaklah berkata baik atau diam.”  Dalam satu riwayat:  Sebaliknya “jiran” ialah barang siapa yang beriman kepada Allah dan hari akhirat hendaklah menyambung silaturahim.",
        "arabic_text": "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا يُؤْذِ جَارَهُ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ» . وَفِي رِوَايَةٍ: بَدَلَ «الْجَارِ» وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيَصِلْ رحِمَه"
      },
      {
        "id": 32938,
        "hadith_number": "4244",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Adab Menerima Tetamu",
        "perawi_melayu": "Abu Syuraih al-Ka'bi",
        "english_text": "Abu Shuraih al-Ka'bi reported that the Messenger of Allah (peace and blessings be upon him) said: 'Whoever believes in Allah and the Last Day, let him honor his guest with his due reward for a day and a night, and hospitality is for three days. What is beyond that is charity, and it is not lawful for him to stay with him until he causes him hardship.'",
        "malay_translation": "Daripada Abu Syuraih al-Ka'bi bahawa Rasulullah SAW bersabda: 'Sesiapa yang beriman kepada Allah dan hari akhirat, maka hendaklah dia memuliakan tetamunya dengan jamuannya sehari semalam, dan layanan sebagai tetamu adalah tiga hari. Selepas itu, ia adalah sedekah, dan tidak halal baginya untuk tinggal bersamanya sehingga dia menyusahkannya.'",
        "arabic_text": "وَعَنْ أَبِي شُرَيْحٍ الْكَعْبِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ جَائِزَتُهُ يَوْمٌ وَلَيْلَةٌ وَالضِّيَافَةُ ثَلَاثَةُ أَيَّامٍ فَمَا بَعْدَ ذَلِكَ فَهُوَ صَدَقَةٌ وَلَا يَحِلُّ لَهُ أَنْ يَثْوِيَ عِنْدَهُ حَتَّى يُحَرِّجَهُ»"
      },
      {
        "id": 32939,
        "hadith_number": "4245",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Hak Tetamu",
        "perawi_melayu": "Ukbah bin Amir",
        "english_text": "It is narrated from Uqbah bin Amir who said: I said to the Prophet (peace and blessings be upon him): We are sent to people who do not recognize us, what do you advise? He said to us: If you come to a people and they provide you with what is due to a guest, then accept it. But if they do not, then take from them the right of the guest which is due to you.",
        "malay_translation": "Daripada Ukbah bin Amir, katanya: Aku bertanya kepada Nabi SAW:  “Kami diutus kepada kaum yang tidak mengenali kami. Apakah pandangan tuan?” Baginda menjawab: “Jika kamu sampai ke suatu kaum, dan mereka memberi kamu apa yang sepatutnya diberikan kepada tetamu, maka terimalah.  Jika mereka tidak memberi, maka ambillah daripada mereka hak tetamu yang sepatutnya diberikan kepada kamu.”",
        "arabic_text": "وَعَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ: قَلْتُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّك تبعثنا فتنزل بِقَوْمٍ لَا يُقْرُونَنَا فَمَا تَرَى؟ فَقَالَ لَنَا: «إِنْ نَزَلْتُمْ بِقَوْمٍ فَأَمَرُوا لَكُمْ بِمَا يَنْبَغِي لِلضَّيْفِ فَاقْبَلُوا فَانْ لَمْ يَفْعَلُوا فَخُذُوا مِنْهُمْ حق الضَّيْف الَّذِي يَنْبَغِي لَهُم»"
      },
      {
        "id": 32940,
        "hadith_number": "4246",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keperibadian Rasulullah SAW: Memahami Rasa Lapar dan Mensyukuri Nikmat",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu Hurairah r.a., katanya: Rasulullah SAW keluar pada suatu malam.  Baginda mendapati Abu Bakar dan Umar. Baginda bertanya, \"Apakah yang membawa kamu berdua keluar dari rumah pada waktu ini?\" Mereka menjawab, \"Kelaparan.\" Baginda bersabda, \"Demi zat yang jiwaku berada di tangan-Nya, aku juga keluar kerana perkara yang sama seperti kamu berdua. Marilah kita bangun!\" Maka mereka bangun bersama Baginda.  Mereka sampai di rumah seorang lelaki dari kalangan Ansar.  Lelaki itu tiada di rumah.  Apabila isterinya melihat mereka, dia berkata, \"Selamat datang!\" Rasulullah SAW bertanya, \"Di manakah fulan (suami)?\" Jawabnya, \"Dia pergi mengambil air untuk kami.\"  Kemudian, lelaki Ansar itu datang, lalu melihat Rasulullah SAW dan kedua sahabatnya. Dia berkata, \"Segala puji bagi Allah, tiada seorang pun yang lebih mulia tetamunya daripada aku pada hari ini!\" Dia segera pergi dan membawa seikat kurma yang mengandungi kurma muda, kurma masak, dan kurma yang hampir masak. Dia berkata, \"Makanlah dari ini!\"  Dia kemudian mengambil seekor kambing untuk disembelih. Rasulullah SAW bersabda, \"Jauhilah yang sedang menyusui!\"  Lalu dia menyembelih kambing itu untuk mereka. Mereka makan daging kambing dan kurma itu serta minum air. Apabila mereka telah kenyang dan puas, Rasulullah SAW berkata kepada Abu Bakar dan Umar, \"Demi zat yang jiwaku berada di tangan-Nya, kamu berdua pasti akan ditanya tentang nikmat ini pada hari kiamat.  Kelaparan membawa kamu keluar dari rumah, kemudian kamu tidak pulang sehingga mendapat nikmat ini.\"  Riwayat Muslim.  Hadis ini juga disebut dalam bab Walimah (Jamuan Perkahwinan)  daripada hadis Abu Mas'ud.",
        "arabic_text": "وَعَن أبي هريرةَ قَالَ: خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْم وَلَيْلَة فَإِذَا هُوَ بِأَبِي بَكْرٍ وَعُمَرَ فَقَالَ: «مَا أَخْرَجَكُمَا مِنْ بُيُوتِكُمَا هَذِهِ السَّاعَةَ؟» قَالَا: الْجُوعُ قَالَ: «وَأَنَا وَالَّذِي نَفْسِي بِيَدِهِ لَأَخْرَجَنِي الَّذِي أَخْرَجَكُمَا قُومُوا» فَقَامُوا مَعَهُ فَأَتَى رَجُلًا مِنَ الْأَنْصَارِ فَإِذَا هُوَ لَيْسَ فِي بَيْتِهِ فَلَمَّا رَأَتْهُ المرأةُ قَالَت: مرْحَبًا وَأهلا فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَيْنَ فُلَانٌ؟» قَالَتْ: ذَهَبَ يَسْتَعْذِبُ لَنَا مِنَ الْمَاءِ إِذْ جَاءَ الْأَنْصَارِيُّ فَنَظَرَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَصَاحِبَيْهِ ثُمَّ قَالَ: الْحَمْدُ لِلَّهِ مَا أَحَدٌ الْيَوْمَ أكرمَ أضيافاً مني قَالَ: فانطَلَق فَجَاءَهُمْ بِعِذْقٍ فِيهِ بُسْرٌ وَتَمْرٌ وَرُطَبٌ فَقَالَ: كُلُوا مِنْ هَذِهِ وَأَخَذَ الْمُدْيَةَ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِيَّاكَ وَالْحَلُوبَ» فَذَبَحَ لَهُمْ فَأَكَلُوا مِنَ الشَّاةِ وَمِنْ ذَلِكَ الْعِذْقِ وَشَرِبُوا فَلَمَّا أَنْ شَبِعُوا وَرَوُوا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَبِي بَكْرٍ وَعُمَرَ: «وَالَّذِي نَفْسِي بِيَدِهِ لَتُسْأَلُنَّ عَنْ هَذَا النَّعِيمِ يَوْمَ الْقِيَامَةِ أَخْرَجَكُمْ مِنْ بُيُوتِكُمُ الْجُوعُ ثُمَّ لَمْ تَرْجِعُوا حَتَّى أَصَابَكُمْ هَذَا النعيمُ» . رَوَاهُ مُسلم. وَذَكَرَ حَدِيثَ أَبِي مَسْعُودٍ: كَانَ رَجُلٌ مِنَ الْأَنْصَار فِي «بَاب الْوَلِيمَة»"
      },
      {
        "id": 32941,
        "hadith_number": "4247",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menolong Tetamu yang Teraniaya",
        "perawi_melayu": "Al-Miqdam bin Ma'di Karib",
        "english_text": "From Miqdam ibn Ma'di Karib, that he heard the Prophet (ﷺ) say: \"If a Muslim guest is wronged, it is incumbent upon every Muslim to assist him until he receives his due from the wrongdoer's property and produce.\"",
        "malay_translation": "Daripada Al-Miqdam bin Ma'di Karib, bahawa baginda mendengar Nabi SAW bersabda:  \"Sekiranya seorang tetamu Muslim dianiaya, maka wajib ke atas setiap Muslim untuk membantunya sehingga dia mendapat haknya daripada harta dan hasil tanaman orang yang menganiayanya.\"",
        "arabic_text": "عَن المقدامِ بن معدي كرب سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «أَيُّمَا مُسْلِمٍ ضَافَ قَوْمًا فَأَصْبَحَ الضَّيْفُ مَحْرُومًا كَانَ حَقًّا عَلَى كُلِّ مُسْلِمٍ نَصْرُهُ حَتَّى يَأْخُذَ لَهُ بِقِرَاهُ مِنْ مَالِهِ وَزَرْعِهِ» . رَوَاهُ الدَّارمِيّ وَأَبُو دَاوُد وَفِي رِوَايَة: «وَأَيُّمَا رَجُلٍ ضَافَ قَوْمًا فَلَمْ يُقْرُوهُ كَانَ لَهُ أَن يعقبهم بِمثل قراه»"
      },
      {
        "id": 32942,
        "hadith_number": "4248",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Galakan Bersikap Ramah Walaupun Pernah Ditolak",
        "perawi_melayu": "Perawi Tidak Disebutkan",
        "english_text": "Teks Bahasa Inggeris tidak tersedia",
        "malay_translation": "Daripada Abu al-Ahwas al-Jushami, daripada bapanya, dia berkata: Saya berkata: Wahai Rasulullah, bagaimana pendapatmu jika saya melewati seorang lelaki dan dia tidak menjamu saya dan tidak menghormati saya, kemudian dia melewati saya selepas itu, adakah saya harus menjamunya atau membalas perbuatannya? Baginda bersabda: \"Bahkan, jamulah dia.\" Riwayat Tirmizi.",
        "arabic_text": "وَعَنْ أَبِي الْأَحْوَصِ الْجُشَمِيِّ عَنْ أَبِيهِ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ مَرَرْتُ بِرَجُلٍ فَلَمْ يُقِرْنِي وَلَمْ يُضِفْنِي ثُمَّ مَرَّ بِي بَعْدَ ذَلِكَ أَأَقْرِيهِ أَمْ أَجْزِيهِ؟ قَالَ: «بل اقره» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 32943,
        "hadith_number": "4249",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kesempurnaan Salam dan Berkat Memakan Bersama",
        "perawi_melayu": "Anas atau selainnya",
        "english_text": "Not Available",
        "malay_translation": "Dari Anas atau selainnya, bahawa Rasulullah SAW meminta izin untuk masuk kepada Saad bin Ubadah. Baginda bersabda:  \"Assalamualaikum warahmatullah.\" Saad menjawab: \"Waalaikumussalam warahmatullah.\"  Namun Nabi SAW tidak mendengar salam Saad sehingga Baginda bersalam tiga kali dan Saad membalas tiga kali tetapi Baginda masih tidak mendengarnya. Lalu Nabi SAW berpatah balik, dan Saad mengikutinya. Saad berkata: \"Wahai Rasulullah, demi ayah dan ibuku, setiap salammu tidak sampai ke pendengaranku. Aku telah membalas salammu tetapi engkau tidak mendengarnya. Aku ingin memperbanyak salammu dan keberkatannya.\" Kemudian mereka masuk ke rumah. Saad menghidangkan kismis kepada Baginda dan Rasulullah SAW memakannya. Setelah selesai makan, Baginda bersabda:  \"Orang-orang soleh telah makan makanan kamu, para malaikat telah mendoakan kamu, dan orang-orang yang berpuasa telah berbuka puasa di sisimu.\"  (Riwayat dalam Syarah Sunnah)",
        "arabic_text": "وَعَنْ أَنَسٍ أَوْ غَيْرِهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَأْذَنَ عَلَى سَعْدِ بْنِ عُبَادَةَ فَقَالَ: «السَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ» فَقَالَ سَعْدٌ: وَعَلَيْكُمُ السَّلَامُ وَرَحْمَةُ اللَّهِ وَلَمْ يُسْمِعِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى سَلَّمَ ثَلَاثًا وَرَدَّ عَلَيْهِ سَعْدٌ ثَلَاثًا وَلَمْ يُسْمِعْهُ فَرَجَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاتَّبَعَهُ سَعْدٌ فَقَالَ: يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي مَا سَلَّمْتَ تَسْلِيمَةً إِلَّا هِيَ بِأُذُنِي: وَلَقَدْ رَدَدْتُ عَلَيْكَ وَلَمْ أُسْمِعْكَ أَحْبَبْتُ أَنْ أَسْتَكْثِرَ مِنْ سَلَامِكَ وَمِنَ الْبَرَكَةِ ثُمَّ دَخَلُوا الْبَيْتَ فَقَرَّبَ لَهُ زَبِيبًا فَأَكَلَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا فَرَغَ قَالَ: «أَكَلَ طَعَامَكُمُ الْأَبْرَارُ وَصَلَّتْ عَلَيْكُمُ الْمَلَائِكَةُ وَأَفْطَرَ عِنْدَكُمُ الصَّائِمُونَ» . رَوَاهُ فِي «شَرْحِ السُّنَّةِ»"
      },
      {
        "id": 32944,
        "hadith_number": "4250",
        "status": "Sahih",
        "nama_buku": "Misykat al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Perumpamaan Orang Mukmin dan Keimanan",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Teks Bahasa Inggeris Kosong",
        "malay_translation": "Daripada Abu Sa'id RA, daripada Nabi SAW, baginda bersabda: “Perumpamaan seorang mukmin dan perumpamaan iman adalah seperti seekor kuda yang ditambat di tempatnya, ia berpusing-pusing kemudian kembali ke tempat tambatannya. Sesungguhnya seorang mukmin itu lalai kemudian kembali kepada iman. Maka berilah makanan kamu kepada orang-orang yang bertaqwa, dan berikanlah kebaikan kamu kepada orang-orang mukmin.”  Riwayat al-Baihaqi dalam Syu'ab al-Iman dan Abu Nu'aim dalam al-Hilyah.",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَثَلُ الْمُؤْمِنِ وَمَثَلُ الْإِيمَانِ كَمَثَلِ الْفَرَسِ فِي آخِيَّتِهِ يَجُولُ ثُمَّ يَرْجِعُ إِلَى آخِيَّتِهِ وَإِنَّ الْمُؤْمِنَ يَسْهُو ثُمَّ يَرْجِعُ إِلَى الْإِيمَانِ فَأَطْعِمُوا طَعَامَكُمُ الْأَتْقِيَاءَ وَأَوْلُوا مَعْرُوفَكُمُ الْمُؤْمِنِينَ» . رَوَاهُ الْبَيْهَقِيُّ فِي «شُعَبِ الْإِيمَانِ» وَأَبُو نُعَيْمٍ فِي «الْحِلْية»"
      },
      {
        "id": 32945,
        "hadith_number": "4251",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keikhlasan Rasulullah SAW dan Cara Makan Bersama",
        "perawi_melayu": "Abdullah bin Busr",
        "english_text": "From Abdullah bin Busr, he said: The Prophet (ﷺ) had a large bowl which four men could carry; it was called Al-Gharra'. When they performed the forenoon prayer and prostrated themselves in the forenoon prayer, that bowl was brought, and it was full of food. They gathered around it. When they increased in number, the Messenger of Allah (ﷺ) sat down. An Arab said: 'What is this sitting?' The Prophet (ﷺ) said: 'Verily, Allah has made me a generous servant and has not made me a tyrant or stubborn.' Then he said: 'Eat from its sides and leave its top so that it may be blessed.'",
        "malay_translation": "Daripada Abdullah bin Busr, beliau berkata: Nabi ﷺ mempunyai sebuah bekas besar yang boleh diangkat oleh empat orang lelaki; ia dikenali sebagai Al-Gharra'.  Apabila mereka menunaikan solat Duha dan sujud dalam solat Duha, bekas itu dibawa, dan ia penuh dengan makanan. Mereka berkumpul di sekelilingnya. Apabila bilangan mereka bertambah, Rasulullah ﷺ duduk. Seorang Arab bertanya: 'Apakah duduk seperti ini?'  Rasulullah ﷺ bersabda:  'Sesungguhnya Allah menjadikan aku hamba yang mulia dan tidak menjadikan aku seorang yang zalim dan degil.' Kemudian Baginda bersabda: 'Makanlah dari tepi-tepinya dan tinggalkan bahagian atasnya supaya ia diberkati.'",
        "arabic_text": "عَن عبد الله بنِ بُسر قَالَ: كَانَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَصْعَةٌ يَحْمِلُهَا أَرْبَعَةُ رِجَالٍ يُقَالُ لَهَا: الْغَرَّاءُ فَلَمَّا أَضْحَوْا وَسَجَدُوا الضُّحَى أُتِيَ بِتِلْكَ الْقَصْعَةِ وَقَدْ ثُرِدَ فِيهَا فَالْتَفُّوا عَلَيْهَا فَلَمَّا كَثُرُوا جَثَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَعْرَابِيٌّ: مَا هَذِهِ الْجِلْسَةُ؟ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ جَعَلَنِي عَبْدًا كَرِيمًا وَلَمْ يَجْعَلْنِي جَبَّارًا عَنِيدًا» ثُمَّ قَالَ: «كُلُوا مِنْ جَوَانِبِهَا وَدَعُوا ذِرْوَتَهَا يُبَارَكْ فِيهَا» . رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32946,
        "hadith_number": "4252",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keberkatan Makan Bersama dan Menyebut Nama Allah",
        "perawi_melayu": "Wahshi bin Harb, daripada bapanya, daripada datuknya",
        "english_text": "Daripada Wahshi bin Harb daripada bapanya daripada datuknya: Sesungguhnya sahabat-sahabat Rasulullah SAW berkata: \"Wahai Rasulullah, sesungguhnya kami makan tetapi tidak kenyang.\" Baginda bersabda: \"Adakah kamu makan berasingan?\" Mereka menjawab: \"Ya.\" Baginda bersabda: \"Maka berkumpullah kamu ketika makan dan sebutlah nama Allah, nescaya Allah akan memberkati kamu padanya.\" (Riwayat Tirmizi)",
        "malay_translation": "Daripada Wahshi bin Harb, daripada bapanya, daripada datuknya: Sesungguhnya sahabat-sahabat Rasulullah SAW berkata: \"Wahai Rasulullah, sesungguhnya kami makan tetapi tidak kenyang.\" Baginda bersabda: \"Adakah kamu makan berasingan?\" Mereka menjawab: \"Ya.\" Baginda bersabda: \"Maka berkumpullah kamu ketika makan dan sebutlah nama Allah, nescaya Allah akan memberkati kamu padanya.\" (Riwayat Tirmizi)",
        "arabic_text": "وَعَنْ وَحْشِيِّ بْنِ حَرْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ: إِنَّ أَصْحَابَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالُوا: يَا رَسُولَ اللَّهِ إِنَّا نَأْكُلُ وَلَا نَشْبَعُ قَالَ: «فَلَعَلَّكُمْ تَفْتَرِقُونَ؟» قَالُوا: نَعَمْ قَالَ: «فَاجْتَمِعُوا عَلَى طَعَامِكُمْ وَاذْكُرُوا اسْمَ اللَّهِ يُباركْ لكم فِيهِ» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 32947,
        "hadith_number": "4253",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tanggungjawab  terhadap Nikmat",
        "perawi_melayu": "Abu 'Asibi",
        "english_text": "Not Available",
        "malay_translation": "Daripada Abu ‘Asibi, katanya: Rasulullah SAW keluar pada waktu malam. Baginda lalu di sisiku lalu memanggilku, maka aku keluar menemui baginda. Kemudian baginda lalu di sisi Abu Bakar lalu memanggilnya, maka dia keluar menemui baginda. Kemudian baginda lalu di sisi Umar lalu memanggilnya, maka dia keluar menemui baginda. Maka mereka pun berjalan sehingga masuk ke dalam sebuah kebun milik seorang daripada Ansar. Baginda bersabda kepada tuan kebun itu: \"Berikanlah kepada kami buah tamar muda.\" Maka dia membawa seikat buah tamar muda lalu meletakkannya. Maka Rasulullah SAW dan sahabat-sahabat baginda makan. Kemudian baginda meminta air sejuk lalu meminumnya. Baginda bersabda: \"Kamu semua akan ditanya tentang nikmat ini pada hari kiamat.\"  Umar mengambil seikat tamar muda itu lalu memukulkannya ke tanah sehingga buah tamar muda itu berselerak sebelum Rasulullah SAW. Kemudian Umar berkata: \"Wahai Rasulullah, sesungguhnya kami akan ditanya tentang nikmat ini pada hari kiamat?\" Baginda menjawab: \"Ya, kecuali daripada tiga perkara: sehelai kain yang digunakan untuk menutup aurat, seketul roti yang digunakan untuk menghilangkan rasa lapar atau sebuah rumah yang digunakan untuk berlindung daripada panas dan hujan.\" Riwayat Ahmad dan al-Baihaqi dalam Syu’ab al-Iman. (Riwayat mursal).",
        "arabic_text": "عَنْ أَبِي عَسِيبٍ قَالَ: خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلًا فَمَرَّ بِي فَدَعَانِي فَخَرَجْتُ إِلَيْهِ ثُمَّ مَرَّ بِأَبِي بَكْرٍ فَدَعَاهُ فَخَرَجَ إِلَيْهِ ثُمَّ مَرَّ بِعُمَرَ فَدَعَاهُ فَخَرَجَ إِلَيْهِ فَانْطَلَقَ حَتَّى دَخَلَ حَائِطًا لِبَعْضِ الْأَنْصَارِ فَقَالَ لِصَاحِبِ الْحَائِطِ: «أَطْعِمْنَا بُسْرًا» فَجَاءَ بِعِذْقٍ فَوَضَعَهُ فَأَكَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابُهُ ثُمَّ دَعَا بِمَاءٍ بَارِدٍ فَشَرِبَ فَقَالَ: «لَتُسْأَلُنَّ عَنْ هَذَا النَّعِيمِ يَوْمَ القيامةِ» قَالَ: فَأخذ عمر العذق فَضرب فِيهِ الْأَرْضَ حَتَّى تَنَاثَرَ الْبُسْرُ قَبْلَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ: يَا رَسُول الله إِنَّا لمسؤولونَ عَنْ هَذَا يَوْمَ الْقِيَامَةِ؟ قَالَ: «نَعَمْ إِلَّا مِنْ ثَلَاثٍ خِرْقَةٍ لَفَّ بِهَا الرَّجُلُ عَوْرَتَهُ أَوْ كِسْرَةٍ سَدَّ بِهَا جَوْعَتَهُ أَوْ حُجْرٍ يتدخَّلُ فِيهِ مَنِ الْحَرِّ وَالْقُرِّ» . رَوَاهُ أَحْمَدُ وَالْبَيْهَقِيُّ فِي «شعب الْإِيمَان» . مُرْسلا"
      },
      {
        "id": 32948,
        "hadith_number": "4254",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Adab Makan Bersama",
        "perawi_melayu": "Ibn Umar",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Umar, katanya: Rasulullah SAW bersabda:  “Apabila makanan telah dihidangkan, maka janganlah seseorang itu bangun sehingga makanan itu disingkirkan. Dan janganlah dia menarik tangannya walaupun dia sudah kenyang sehingga orang lain selesai makan.  Hendaklah dia memberi alasan (jika perlu) kerana perbuatan itu akan memalukan temannya lalu dia akan menarik tangannya. Dan mungkin juga temannya itu memerlukan makanan tersebut.” Riwayat Ibnu Majah dan al-Baihaqi dalam Syu’ab al-Iman.",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا وُضِعَتِ الْمَائِدَةُ فَلَا يَقُومُ رَجُلٌ حَتَّى تُرْفَعَ الْمَائِدَةُ وَلَا يَرْفَعْ يَدَهُ وَإِنْ شَبِعَ حَتَّى يَفْرُغَ الْقَوْمُ وَلْيُعْذِرْ فَإِنَّ ذَلِكَ يُخْجِلُ جَلِيسَهُ فَيَقْبِضُ يَدَهُ وَعَسَى أَنْ يَكُونَ لَهُ فِي الطَّعَامِ حَاجَةٌ» رَوَاهُ ابْنُ مَاجَهْ وَالْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ"
      },
      {
        "id": 32949,
        "hadith_number": "4255",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Makan Terakhir",
        "perawi_melayu": "Jaafar bin Muhammad daripada bapanya",
        "english_text": "Not Available",
        "malay_translation": "Daripada Jaafar bin Muhammad daripada bapanya, beliau berkata: Rasulullah SAW apabila makan bersama-sama orang ramai, baginda adalah orang yang terakhir sekali menghabiskan makanannya.  Riwayat al-Baihaqi dalam kitab Syu’ab al-Iman secara mursal.",
        "arabic_text": "وَعَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَكَلَ مَعَ قَوْمٍ كَانَ آخِرَهُمْ أَكْلًا. رَوَاهُ الْبَيْهَقِيّ فِي «شعب الْإِيمَان» مُرْسلا"
      },
      {
        "id": 32950,
        "hadith_number": "4256",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menghimpunkan Kelaparan dan Kedustaan",
        "perawi_melayu": "Asma' binti Yazid",
        "english_text": "Hadith text is originally in Arabic and not provided in English.",
        "malay_translation": "Daripada Asma' binti Yazid RA berkata: \"Makanan telah dibawa kepada Nabi SAW, lalu Baginda menawarkannya kepada kami. Kami berkata: 'Kami tidak berselera dengannya.' Baginda bersabda: 'Janganlah kamu menghimpunkan kelaparan dan kedustaan.'\" Riwayat Ibnu Majah.",
        "arabic_text": "وَعَن أَسمَاء بنتِ يزِيد قَالَتْ: أُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِطَعَامٍ فَعَرَضَ عَلَيْنَا فَقُلْنَا: لَا نَشْتَهِيهِ. قَالَ: «لَا تَجْتَمِعْنَ جُوعًا وَكَذِبًا» . رَوَاهُ ابْنُ مَاجَهْ"
      },
      {
        "id": 32951,
        "hadith_number": "4257",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keberkatan dalam Berkumpul",
        "perawi_melayu": "Umar bin al-Khattab",
        "english_text": "From Umar ibn al-Khattab, who said: The Messenger of Allah (peace and blessings be upon him) said: \"Eat together and do not separate, for blessing is with the community.\"",
        "malay_translation": "Daripada Umar bin al-Khattab, yang berkata: Rasulullah SAW bersabda:  “Makanlah bersama-sama dan janganlah berpecah kerana keberkatan itu bersama jemaah.”",
        "arabic_text": "وَعَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كُلُوا جَمِيعًا وَلَا تَفَرَّقُوا فَإِنَّ الْبَرَكَةَ معَ الجماعةِ» . رَوَاهُ ابْنُ مَاجَهْ"
      },
      {
        "id": 32952,
        "hadith_number": "4258",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menguantar Tetamu Hingga ke Pintu",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "From Abu Hurairah, he said: The Messenger of Allah (ﷺ) said: \"It is part of good manners to accompany one's guest to the door.\"",
        "malay_translation": "Dari Abu Hurairah, beliau berkata: Rasulullah SAW bersabda:  \"Antara adab yang baik ialah mengiringi tetamu sehingga ke pintu rumah.\"",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مِنَ السَّنَةِ أَنْ يَخْرُجَ الرَّجُلُ مَعَ ضَيْفِهِ إِلَى بَابِ الدَّارِ» . رَوَاهُ ابْن مَاجَه"
      },
      {
        "id": 32953,
        "hadith_number": "4259",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kelemahan Sanad Hadith Riwayat al-Baihaqi",
        "perawi_melayu": "Al-Baihaqi",
        "english_text": "Narrated by Al-Bayhaqi in Shu'ab al-Iman from him and from Ibn Abbas, and he said: In its chain is weak.",
        "malay_translation": "Diriwayatkan oleh al-Baihaqi dalam Syu'ab al-Iman daripada beliau dan daripada Ibn Abbas, dan beliau berkata: Pada sanadnya terdapat kelemahan.",
        "arabic_text": "وَرَوَاهُ الْبَيْهَقِيُّ فِي «شُعَبِ الْإِيمَانِ» عَنْهُ وَعَنِ ابْن عَبَّاس وَقَالَ: فِي إِسْنَاده ضَعِيف"
      },
      {
        "id": 32954,
        "hadith_number": "4260",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Kebaikan Cepat Mencapai Rumah yang Ada Makanan",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "From Ibn Abbas, he said: The Messenger of Allah (peace and blessings be upon him) said: \"Goodness is quicker to the house in which food is eaten from the knife to the hump of the camel.\"",
        "malay_translation": "Daripada Ibnu Abbas, beliau berkata: Rasulullah SAW bersabda:  \"Kebaikan itu lebih cepat sampai ke rumah yang di dalamnya makanan dimakan daripada pisau hingga ke bonggol unta.\" ",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْخَيْرُ أَسْرَعُ إِلَى الْبَيْتِ الَّذِي يُؤْكَلُ فِيهِ مِنَ الشَّفْرَةِ إِلَى سنامِ الْبَعِير» . رَوَاهُ ابْن مَاجَه"
      },
      {
        "id": 32955,
        "hadith_number": "4261",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keharusan Memakan Bangkai Ketika Darurat",
        "perawi_melayu": "Al-Fuji' al-'Amiri",
        "english_text": "From Al-Fuji' al-'Amiri, that he came to the Prophet (peace and blessings of Allah be upon him) and said: \"What is lawful for us of carrion?\" He said, \"What is your food?\" We said, \"We eat in the morning and in the evening.\" Abu Nu'aim said: 'Uqbah explained it to me: \"A cup in the morning and a cup in the evening.\" He said, \"That, by my father, is hunger.\" So he made carrion lawful for them in this state. Reported by Abu Dawood.",
        "malay_translation": "Daripada al-Fuji' al-'Amiri, bahawa dia telah datang kepada Nabi ﷺ dan berkata: \"Apakah yang halal bagi kami daripada bangkai?\" Baginda bersabda: \"Apakah makanan kamu?\" Kami berkata: \"Kami makan pada waktu pagi dan petang.\" Abu Nu'aim berkata: 'Uqbah menjelaskan kepada saya: \"Secawan pada waktu pagi dan secawan pada waktu petang.\" Baginda bersabda: \"Itu, demi ayahku, adalah kelaparan.\" Maka Baginda menghalalkan bangkai bagi mereka dalam keadaan ini. Riwayat Abu Daud.",
        "arabic_text": "عَن الفجيع العامري أَنَّهُ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: مَا يَحِلُّ لَنَا مِنَ الْمِيتَةِ؟ قَالَ: «مَا طعامُكم؟» قُلنا: نَغْتَبِقُ وَنَصْطَبِحُ قَالَ أَبُو نُعَيْمٍ: فَسَّرَهُ لِي عُقْبَةُ: قَدَحٌ غُدْوَةً وَقَدَحٌ عَشِيَّةً قَالَ: «ذَاكَ وَأَبِي الْجُوعُ» فَأَحَلَّ لَهُمُ الْمَيْتَةَ عَلَى هَذِهِ الحالِ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32956,
        "hadith_number": "4262",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keperluan Mengmakan Bangkai dalam Keadaan Darurat",
        "perawi_melayu": "Abu Waqid al-Laythi",
        "english_text": "Abu Waqid al-Laythi reported that a man said, \"O Messenger of Allah, we are in a land where famine strikes us. When is it permissible for us to eat carrion?\" He said, \"When you do not find other food or vegetable then it is permissible for you to eat the carrion.\"",
        "malay_translation": "Abu Waqid al-Laythi meriwayatkan bahawa seorang lelaki berkata, \"Wahai Rasulullah, kami berada di sebuah tanah yang dilanda kemarau. Bilakah halal bagi kami memakan bangkai?\" Baginda SAW bersabda,  \"Apabila kamu tidak menemui makanan lain atau sayuran, maka halal bagimu memakan bangkai.\" ",
        "arabic_text": "وَعَنْ أَبِي وَاقِدٍ اللَّيْثِيِّ أَنْ رَجُلًا قَالَ: يَا رَسُولَ اللَّهِ إِنَّا نَكُونُ بِأَرْضٍ فَتُصِيبُنَا بهَا المخصمة فَمَتَى يحلُّ لنا الميتةُ؟ قَالَ: «مَا لم تصطبحوا وتغتبقوا أَوْ تَحْتَفِئُوا بِهَا بَقْلًا فَشَأْنَكُمْ بِهَا» . مَعْنَاهُ: إِذَا لَمْ تَجِدُوا صَبُوحًا أَوْ غَبُوقًا وَلَمْ تَجِدُوا بَقْلَةً تَأْكُلُونَهَا حَلَّتْ لَكُمُ الْمَيْتَةُ. رَوَاهُ الدَّارمِيّ"
      },
      {
        "id": 32957,
        "hadith_number": "4263",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Menarik Nafas Tiga Kali di Dalam Minuman",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "From Anas, he said: The Messenger of Allah (peace and blessings be upon him) used to breathe into the drink three times. Agreed upon. Muslim added in a narration: And he says, \"Verily, it quenches thirst, purifies, and is a blessing.\"",
        "malay_translation": "Dari Anas, beliau berkata: Rasulullah SAW bernafas tiga kali ke dalam minuman.  Mutafaq Alaih. Muslim menambah dalam satu riwayat: Dan baginda bersabda, \"Sesungguhnya ia menghilangkan dahaga, membersihkan, dan merupakan keberkatan.\"",
        "arabic_text": "عَنْ أَنَسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَنَفَّسُ فِي الشَّرَابِ ثَلَاثًا. مُتَّفق عَلَيْهِ. وزادَ مسلمُ فِي روايةٍ ويقولُ: «إِنَّه أرْوَى وأبرَأُ وأمرأ»"
      },
      {
        "id": 32958,
        "hadith_number": "4264",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Rasulullah SAW Minum Dari Mulut Sقاء",
        "perawi_melayu": "Ibnu Abbas",
        "english_text": "From Ibn Abbas, he said: The Messenger of Allah (ﷺ) forbade drinking from the mouth of the waterskin.",
        "malay_translation": "Daripada Ibnu Abbas, beliau berkata: Rasulullah SAW melarang minum daripada mulut (tempat air dituang)  sقاء.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَن الشّرْب من قي السقاء"
      },
      {
        "id": 32959,
        "hadith_number": "4265",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menghisap Air Secara Langsung Dari Bekas Air",
        "perawi_melayu": "Abu Said al-Khudri",
        "english_text": "It is narrated from Abu Said al-Khudri (RA) that the Messenger of Allah (ﷺ) forbade drinking water directly from the mouth of the water skin.",
        "malay_translation": "Daripada Abu Said al-Khudri r.a., bahawa Rasulullah SAW melarang meminum air secara terus daripada mulut  bekas air.  Dalam satu riwayat lain,  dijelaskan bahawa  maksud  ‘meng hisap air’  ialah membalikkan bekas air itu kemudian minum daripadanya.",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ اخْتِنَاثِ الْأَسْقِيَةِ. زَادَ فِي رِوَايَةٍ: وَاخْتِنَاثُهَا: أَنْ يُقْلَبَ رَأْسُهَا ثُمَّ يُشْرَبَ مِنْهُ"
      },
      {
        "id": 32960,
        "hadith_number": "4266",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Minum Sambil Berdiri",
        "perawi_melayu": "Anas",
        "english_text": "And from Anas, from the Prophet ﷺ that he forbade a man to drink while standing. Narrated by Muslim.",
        "malay_translation": "Dan daripada Anas, daripada Nabi ﷺ bahawa baginda melarang seseorang lelaki minum sambil berdiri. Riwayat Muslim.",
        "arabic_text": "وَعَنْ أَنَسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى أَنْ يَشْرَبَ الرَّجُلُ قَائِمًا. رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 32961,
        "hadith_number": "4267",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Minum Sambil Berdiri",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "From Abu Hurairah, he said: The Messenger of Allah (ﷺ) said: \"None of you should drink while standing. And whoever among you forgets, let him vomit it out.\"",
        "malay_translation": "Daripada Abu Hurairah, katanya: Rasulullah SAW bersabda:  “Tiada seorang pun di antara kamu hendaklah minum sambil berdiri. Dan sesiapa di antara kamu yang lupa, hendaklah dia memuntahkannya.”",
        "arabic_text": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَشْرَبَنَّ أَحَدٌ مِنْكُمْ قَائِمًا فَمَنْ نَسِيَ مِنْكُمْ فَلْيَسْتَقِئْ» . رَوَاهُ مُسلم"
      },
      {
        "id": 32962,
        "hadith_number": "4268",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah ﷺ Meminum Air Zamzam Ketika Berdiri",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "And from Ibn Abbas, he said: I came to the Prophet ﷺ with a bucket of Zamzam water, and he drank while standing.",
        "malay_translation": "Daripada Ibnu Abbas, beliau berkata: Aku datang kepada Nabi ﷺ dengan sebaldi air Zamzam, lalu baginda meminumnya ketika berdiri.",
        "arabic_text": "وَعَن ابْن عَبَّاس قَالَ: أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِدَلْوٍ مِنْ مَاءِ زَمْزَمَ فَشَرِبَ وَهُوَ قَائِمٌ"
      },
      {
        "id": 32963,
        "hadith_number": "4269",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Ali r.a. dan Amalan Minum Ketika Berdiri Selepas Solat Zuhur",
        "perawi_melayu": "Ali r.a.",
        "english_text": "From Ali (may Allah be pleased with him): That he offered the Zuhr prayer, then sat attending to the needs of the people in the open space of Kufa until the time for the Asr prayer approached. Then water was brought to him, and he drank, washed his face and hands, and mentioned (wetted) his head and feet. Then he stood up and drank some more while standing, then said: \"Indeed, some people dislike drinking while standing, and indeed the Prophet (peace and blessings of Allah be upon him) did as I did.\"",
        "malay_translation": "Daripada Ali r.a.: bahawa baginda menunaikan solat Zuhur, kemudian duduk melayan keperluan masyarakat di ruang terbuka Kufah sehingga hampir waktu solat Asar. Kemudian air dibawa kepadanya, lalu baginda minum, membasuh muka dan tangan, dan membasahkan kepala serta kakinya. Kemudian baginda berdiri dan minum lagi sambil berdiri, lalu bersabda:  \"Sesungguhnya, ada sebilangan orang yang tidak suka minum sambil berdiri, dan sesungguhnya Nabi SAW telah melakukan seperti apa yang aku lakukan.\" ",
        "arabic_text": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ: أَنَّهُ صَلَّى الظُّهْرَ ثُمَّ قَعَدَ فِي حَوَائِجِ النَّاسِ فِي رَحَبَةِ الْكُوفَةِ حَتَّى حَضَرَتْ صَلَاةُ الْعَصْرِ ثُمَّ أُتِيَ بِمَاءٍ فَشَرِبَ وَغَسَلَ وَجْهَهُ وَيَدَيْهِ وَذَكَرَ رَأسه وَرجلَيْهِ ثمَّ قَامَ فَشرب فَصله وَهُوَ قَائِمٌ ثُمَّ قَالَ: إِنَّ أُنَاسًا يَكْرَهُونَ الشُّرْبَ قَائِمًا وَإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَنَعَ مِثْلَ مَا صَنَعْتُ. رَوَاهُ الْبُخَارِيُّ"
      },
      {
        "id": 32964,
        "hadith_number": "4270",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah s.a.w. meminum air daripada tempayan",
        "perawi_melayu": "Jabir",
        "english_text": "Not Available",
        "malay_translation": "Daripada Jabir, bahawa Nabi SAW masuk ke rumah seorang lelaki daripada kalangan Ansar, bersama-sama sahabatnya. Baginda memberi salam, lalu lelaki itu membalas salam sambil menyiram air di tembok.  Nabi SAW bertanya: “Adakah kamu ada air yang telah disimpan di dalam tempayan semalaman? Jika ada, mari kita minum.” Lelaki itu menjawab: “Ya, saya ada air yang telah disimpan di dalam tempayan semalaman.” Lalu Baginda pergi ke pondok, menuang air ke dalam cawan, kemudian memerah susu kambing ke dalamnya. Nabi SAW meminumnya, kemudian memberi cawan itu kepada sahabat lelaki itu untuk diminum.",
        "arabic_text": "وَعَنْ جَابِرٌ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَى رَجُلٍ مِنَ الْأَنْصَارِ وَمَعَهُ صَاحِبٌ لَهُ فَسَلَّمَ فَرَدَّ الرَّجُلُ وَهُوَ يُحَوِّلُ الْمَاءَ فِي حَائِطٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ كَانَ عِنْدَكَ مَاءٌ بَاتَ فِي شَنَّةٍ وَإِلَّا كَرَعْنَا؟» فَقَالَ: عِنْدِي مَاءٌ بَاتَ فِي شَنٍّ فَانْطَلَقَ إِلَى الْعَرِيشِ فَسَكَبَ فِي قَدَحٍ مَاءً ثُمَّ حَلَبَ عَلَيْهِ مِنْ دَاجِنٍ فَشَرِبَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ أَعَادَ فَشَرِبَ الرَّجُلُ الَّذِي جَاءَ مَعَهُ. رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32965,
        "hadith_number": "4271",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menggunakan Pinggan Mangkuk Perak",
        "perawi_melayu": "Ummu Salamah",
        "english_text": "It was narrated from Umm Salamah that the Messenger of Allah (ﷺ) said: \"Whoever drinks from a silver vessel is, in fact, drawing the fire of Hell into his stomach.\"",
        "malay_translation": "Daripada Ummu Salamah, bahawa Rasulullah SAW bersabda:  \"Sesiapa yang minum daripada bekas perak, maka sesungguhnya dia telah memasukkan api neraka ke dalam perutnya.\"  (Hadis Riwayat Muslim)",
        "arabic_text": "وَعَنْ أُمِّ سَلَمَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الَّذِي يَشْرَبُ فِي آنِيَةِ الْفِضَّةِ إِنَّمَا يُجَرْجِرُ فِي بَطْنِهِ نَارَ جَهَنَّمَ» . مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ لِمُسْلِمٍ: «إِنَّ الَّذِي يَأْكُلُ وَيَشْرَبُ فِي آنِية الْفضة وَالذَّهَب»"
      },
      {
        "id": 32966,
        "hadith_number": "4272",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Memakai Sutera, Dipa, dan Menggunakan Peralatan Emas dan Perak",
        "perawi_melayu": "Hudzaifah",
        "english_text": "And from Hudhayfah, he said: I heard the Messenger of Allah (ﷺ) say: \"Do not wear silk or brocade, and do not drink in golden or silver vessels, and do not eat from their plates; for they are for them in this world, and they are for you in the Hereafter.\"",
        "malay_translation": "Daripada Hudzaifah, beliau berkata: Saya mendengar Rasulullah SAW bersabda:  “Janganlah kamu memakai sutera atau dibabaj, dan janganlah kamu minum dalam bekas emas dan perak, dan janganlah kamu makan di atas pinggannya; kerana ia adalah untuk mereka di dunia, dan ia adalah untuk kamu di akhirat.”",
        "arabic_text": "وَعَنْ حُذَيْفَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا تَلْبَسُوا الْحَرِيرَ وَلَا الدِّيبَاجَ وَلَا تَشْرَبُوا فِي آنِيَةِ الذَّهَبِ وَالْفِضَّةِ وَلَا تَأْكُلُوا فِي صِحَافِهَا فَإِنَّهَا لَهُمْ فِي الدُّنْيَا وَهِيَ لَكُمْ فِي الْآخِرَةِ»"
      },
      {
        "id": 32967,
        "hadith_number": "4273",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Meminum Susu Kambing",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "It is narrated by Anas that a black sheep, whose milk was diluted with water from the well in Anas's house, was milked for the Messenger of Allah (peace and blessings be upon him). The Messenger of Allah (peace and blessings be upon him) was given the cup and he drank. Abu Bakr was on his left and an Arab on his right. Umar said: Give it to Abu Bakr, O Messenger of Allah.  Then he gave it to the Arab who was on his right, then he said: \"The one on the right, the one on the right. In another narration: \"Those on the right, those on the right. Let them be given preference.\" ",
        "malay_translation": "Dari Anas r.a., katanya: Seekor kambing hitam yang susunya dicairkan dengan air dari perigi di rumah Anas telah diperah untuk Rasulullah SAW.  Rasulullah SAW diberi cawan lalu baginda minum. Abu Bakar berada di sebelah kiri baginda dan seorang Arab berada di sebelah kanan baginda. Umar berkata: “Berikan kepada Abu Bakar wahai Rasulullah.”  Kemudian baginda memberikannya kepada orang Arab yang berada di sebelah kanan baginda, lalu baginda bersabda: “Yang di kanan, yang di kanan.” Dalam satu riwayat lain: “Orang-orang yang di kanan, orang-orang yang di kanan.  Berikan keutamaan kepada mereka.”",
        "arabic_text": "وَعَن أنسٍ قَالَ: حُلِبَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَاةٌ دَاجِنٌ وَشِيبَ لَبَنُهَا بِمَاءٍ مِنَ الْبِئْرِ الَّتِي فِي دَارِ أَنَسٍ فَأُعْطِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْقَدَحَ فَشَرِبَ وَعَلَى يَسَارِهِ أَبُو بَكْرٍ وَعَنْ يَمِينِهِ أَعْرَابِيٌّ فَقَالَ عُمَرُ: أَعْطِ أَبَا بَكْرٍ يَا رَسُولَ اللَّهِ فَأَعْطَى الْأَعْرَابِيَّ الَّذِي عَنْ يَمِينِهِ ثُمَّ قَالَ: الْأَيْمَنُ فَالْأَيْمَنُ وَفِي رِوَايَةٍ: «الْأَيْمَنُونَ الْأَيْمَنُونَ أَلاَ فيَمِّنوا»"
      },
      {
        "id": 32968,
        "hadith_number": "4274",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Keadilan Rasulullah SAW dalam Pemberian Minuman",
        "perawi_melayu": "Sahl bin Sa'd",
        "english_text": "From Sahl ibn Sa’d, he said: The Prophet (ﷺ) came with a cup, and he drank from it, and a young boy was on his right, and the elders were on his left. Then he said: \"O boy, do you allow me to give it to the elders?\" He said: \"I would not allow anyone to be preferred over me in your generosity, O Messenger of Allah.\" So he gave it to them.  The Hadith of Abu Qatada will be mentioned in \"The Chapter of Miracles\", God willing.",
        "malay_translation": "Dari Sahl bin Sa’d, katanya: Nabi SAW datang dengan sebuah cawan, lalu baginda minum daripadanya. Seorang pemuda berada di sebelah kanan baginda, dan orang-orang tua berada di sebelah kiri baginda.  Lalu baginda bertanya: \"Wahai pemuda, adakah engkau membenarkan aku memberikannya kepada orang-orang tua?\"  Pemuda itu menjawab: \"Aku tidak akan membenarkan sesiapa diutamakan daripada aku dalam kemurahanmu, wahai Rasulullah.\" Maka baginda memberikannya kepada mereka. Hadis daripada Abu Qatadah akan disebut dalam \"Bab Mu'jizat\", InsyaAllah.",
        "arabic_text": "وَعَنْ سَهْلِ بْنِ سَعْدٍ قَالَ: أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَدَحٍ فَشَرِبَ مِنْهُ وَعَنْ يَمِينِهِ غُلَامٌ أَصْغَرُ الْقَوْمِ وَالْأَشْيَاخُ عَنْ يَسَارِهِ فَقَالَ: «يَا غُلَامُ أَتَأْذَنُ أَنْ أُعْطِيَهُ الْأَشْيَاخَ؟» فَقَالَ: مَا كُنْتُ لِأُوثِرَ بِفَضْلٍ مِنْكَ أَحَدًا يَا رَسُولَ اللَّهِ فَأعْطَاهُ إِيَّاه وَحَدِيث أبي قتادةَ سنذكر فِي «بَابِ الْمُعْجِزَاتِ» إِنْ شَاءَ اللَّهُ تَعَالَى"
      },
      {
        "id": 32969,
        "hadith_number": "4275",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Makan dan Minum Sambil Berjalan dan Berdiri",
        "perawi_melayu": "Ibn Umar RA",
        "english_text": "Tiada teks Bahasa Inggeris disediakan",
        "malay_translation": "Daripada Ibn Umar RA berkata: \"Kami pernah makan pada zaman Rasulullah SAW sambil berjalan, dan kami minum sambil berdiri.\" Diriwayatkan oleh Tirmizi, Ibn Majah, dan Darimi. Imam Tirmizi berkata: \"Hadis ini adalah hasan sahih gharib.\"",
        "arabic_text": "عَن ابنِ عمَرَ قَالَ: كُنَّا نَأْكُلُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ نَمْشِي وَنَشْرَبُ وَنَحْنُ قِيَامٌ. رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ"
      },
      {
        "id": 32970,
        "hadith_number": "4276",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah SAW Minum Dalam Keadaan Berdiri dan Duduk",
        "perawi_melayu": "Amru bin Syu'aib daripada bapanya daripada datuknya",
        "english_text": "From Amr ibn Shu'aib from his father from his grandfather, he said: I saw the Messenger of Allah (peace and blessings of Allah be upon him) drinking while standing and sitting.",
        "malay_translation": "Daripada Amru bin Syu'aib daripada bapanya daripada datuknya, beliau berkata: Aku melihat Rasulullah SAW minum dalam keadaan berdiri dan duduk.",
        "arabic_text": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جده قَالَ: رَأَيْت رَسُول لله صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَشْرَبُ قَائِمًا وَقَاعِدًا. رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 32971,
        "hadith_number": "4277",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Bernafas atau Meniup ke Dalam Bekas",
        "perawi_melayu": "Ibnu Abbas RA",
        "english_text": "And from Ibn Abbas, may Allah be pleased with them both, who said: The Messenger of Allah (peace and blessings of Allah be upon him) forbade breathing into a vessel or blowing into it. Narrated by Abu Dawood and Ibn Majah.",
        "malay_translation": "Daripada Ibnu Abbas RA berkata: Rasulullah SAW melarang bernafas di dalam bekas atau meniup ke dalamnya. Riwayat Abu Daud dan Ibnu Majah.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُتَنَفَّسَ فِي الْإِنَاءِ أَوْ يُنْفَخَ فِيهِ. رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه"
      },
      {
        "id": 32972,
        "hadith_number": "4278",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Cara Minum yang Dianjurkan",
        "perawi_melayu": "Tidak dinyatakan dalam data asal.",
        "english_text": "Not Available",
        "malay_translation": "Daripada hadis yang diriwayatkan, Rasulullah SAW bersabda:  “Janganlah kamu minum sekali teguk seperti unta minum, tetapi minumlah dua atau tiga teguk.  Sebutkan nama Allah ketika kamu hendak minum dan ucapkan syukur ketika kamu selesai minum.” Riwayat Imam Tirmizi.",
        "arabic_text": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَشْرَبُوا وَاحِدًا كَشُرْبِ الْبَعِيرِ وَلَكِنِ اشْرَبُوا مَثنى وثُلاثَ وَسَمُّوا إِذَا أَنْتُمْ شَرِبْتُمْ وَاحْمَدُوا إِذَا أَنْتُمْ رفعتُم» . رَوَاهُ التِّرْمِذِيّ"
      },
      {
        "id": 32973,
        "hadith_number": "4279",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menghembus Minuman",
        "perawi_melayu": "Abu Said al-Khudri",
        "english_text": "From Abu Said al-Khudri that the Prophet (peace and blessings of Allaah be upon him) forbade blowing into a drink. A man said, “What about if I see a pebble in the vessel?” He said, “Pour it out.” He said, “But I will not quench my thirst with one breath.” He said, “Then move the cup away from your mouth, then breathe.”",
        "malay_translation": "Daripada Abu Said al-Khudri bahawa Nabi SAW melarang daripada menghembus minuman.  Seorang lelaki berkata, “Bagaimana jika saya nampak kerikil di dalam bekas?” Baginda berkata, “Tuangkan ia.” Lelaki itu berkata, “Tetapi saya tidak akan dapat melegakan dahaga saya dengan satu nafas.” Baginda berkata, “Maka jauhkan cawan dari mulutmu, kemudian hembuslah.”",
        "arabic_text": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ النَّفْخِ فِي الشَّرَابِ فَقَالَ رَجُلٌ: الْقَذَاةَ أَرَاهَا فِي الْإِنَاءِ قَالَ: «أَهْرِقْهَا» قَالَ: فَإِنِّي لَا أُرْوَى مِنْ نَفَسٍ وَاحِدٍ قَالَ: «فَأَبِنِ الْقَدَحَ عَنْ فِيكَ ثُمَّ تَنَفَّسْ» . رَوَاهُ التِّرْمِذِيُّ والدارمي"
      },
      {
        "id": 32974,
        "hadith_number": "4280",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Rasulullah SAW Minum Dari Retak Cangkir dan Menghembus Minuman",
        "perawi_melayu": "Tidak dinyatakan dalam data asal.",
        "english_text": "Not Available",
        "malay_translation": "Daripada baginda SAW, diriwayatkan bahawa Rasulullah SAW melarang minum daripada retak-retak cangkir dan daripada meniup minuman.",
        "arabic_text": "وَعَنْهُ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الشُّرْبِ مِنْ ثُلْمَةِ الْقَدَحِ وَأَنْ يُنْفَخَ فِي الشَّرَابِ. رَوَاهُ أَبُو دَاوُدَ"
      },
      {
        "id": 32975,
        "hadith_number": "4281",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Rasulullah s.a.w. Minum Daripada Kulit Air",
        "perawi_melayu": "Kabsyah",
        "english_text": "And from Kabshah, she said: The Messenger of Allah (peace and blessings of Allah be upon him) entered upon us and drank from a hanging waterskin while standing. Then I went to it and cut it off.",
        "malay_translation": "Daripada Kabsyah, dia berkata: Rasulullah SAW masuk kepada kami dan meminum air daripada sebuah kulit air yang tergantung sambil berdiri. Kemudian saya menghampirinya dan memotongnya.",
        "arabic_text": "وَعَن كبْشَةَ قَالَتْ: دَخَلَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَشَرِبَ مِنْ فِي قِرْبَةٍ مُعَلَّقَةٍ قَائِمًا فَقُمْتُ إِلَى فِيهَا فَقَطَعْتُهُ. رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ غريبٌ صَحِيح"
      },
      {
        "id": 32976,
        "hadith_number": "4282",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Minuman Kegemaran Rasulullah",
        "perawi_melayu": "Daripada Zuhri, daripada Urwah, daripada Aisyah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Zuhri, daripada Urwah, daripada Aisyah r.a. berkata:  Minuman yang paling Rasulullah SAW sukai ialah minuman manis yang sejuk.  (Riwayat Tirmizi. Beliau berkata:  Yang sahih ialah apa yang diriwayatkan daripada Zuhri daripada Nabi SAW secara mursal.)",
        "arabic_text": "وَعَنِ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ: كَانَ أَحَبُّ الشَّرَابِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْحُلْوَ الْبَارِدَ. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: وَالصَّحِيحُ مَا رُوِيَ عَنِ الزُّهْرِيِّ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا"
      },
      {
        "id": 32977,
        "hadith_number": "4283",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Doa Selepas Makan dan Minum Susu",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "Not Available",
        "malay_translation": "Daripada Ibnu Abbas r.a., katanya: Rasulullah SAW bersabda: “Apabila salah seorang daripada kamu makan, maka hendaklah dia berdoa: ‘Ya Allah, berkatilah kami dengan makanan ini dan berikanlah kami makanan yang lebih baik daripadanya.’ Dan apabila kamu minum susu, maka hendaklah kamu berdoa: ‘Ya Allah, berkatilah kami dengannya dan tambahkanlah kepadanya.’ Kerana sesungguhnya tiada sesuatu pun yang dapat menggantikan makanan dan minuman kecuali susu.”  (Riwayat Tirmizi dan Abu Daud)",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِذَا أَكَلَ أَحَدُكُمْ طَعَامًا فَلْيَقُلِ: اللَّهُمَّ بَارِكْ لَنَا فِيهِ وَأَطْعِمْنَا خَيْرًا مِنْهُ. وَإِذَا سُقِيَ لَبَنًا فَلْيَقُلِ: اللَّهُمَّ بَارِكْ لَنَا فِيهِ وَزِدْنَا مِنْهُ فَإِنَّهُ لَيْسَ شَيْء يجزى مِنَ الطَّعَامِ وَالشَّرَابِ إِلَّا اللَّبَنُ . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد"
      },
      {
        "id": 32978,
        "hadith_number": "4284",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Nabi Muhammad SAW Menggunakan Air Manis dari As-Suqya",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Tidak ada teks Bahasa Inggeris",
        "malay_translation": "Daripada Aisyah R.A berkata: Adalah Nabi SAW meminta air yang manis untuk baginda dari As-Suqya. Dikatakan: Ia adalah mata air yang jaraknya antara ia dan Madinah adalah dua hari perjalanan. Riwayat Abu Daud.",
        "arabic_text": "وَعَنْ عَائِشَةَ قَالَتْ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسْتَعْذَبُ لَهُ الْمَاءُ مِنَ السُّقْيَا. قِيلَ: هِيَ عَيْنٌ بَيْنَهَا وَبَيْنَ الْمَدِينَةِ يَوْمَانِ. رَوَاهُ أَبُو دَاوُد"
      },
      {
        "id": 32979,
        "hadith_number": "4285",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Menggunakan Pinggan Mangkuk Emas dan Perak",
        "perawi_melayu": "Ibn Umar",
        "english_text": "From Ibn Umar, that the Prophet (peace and blessings of Allah be upon him) said: “Whoever drinks from a vessel of gold or silver, or a vessel containing some of it, then he is only dragging the fire of Hell into his belly.”",
        "malay_translation": "Daripada Ibnu Umar, bahawa Nabi Muhammad SAW bersabda:  “Sesiapa yang minum daripada bekas emas atau perak, atau bekas yang mengandungi sebahagian daripadanya, maka sesungguhnya dia hanya memasukkan api neraka ke dalam perutnya.”",
        "arabic_text": "عَنِ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ شَرِبَ فِي إِنَاءِ ذَهَبٍ أَوْ فِضَّةٍ أَوْ إِنَاءٍ فِيهِ شَيْءٌ مِنْ ذَلِكَ فَإِنَّمَا يُجَرْجِرُ فِي بَطْنِهِ نَارَ جهنمَ» . رَوَاهُ الدَّارَقُطْنِيّ"
      },
      {
        "id": 32980,
        "hadith_number": "4286",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Anas RA Memberi Rasulullah SAW Minuman Madu, Nabidz, Air dan Susu",
        "perawi_melayu": "Anas bin Malik RA",
        "english_text": "From Anas, he said: I have given the Messenger of Allah (peace and blessings be upon him) a drink of all these in this cup: Honey, Nabidh, water, and milk.",
        "malay_translation": "Dari Anas, beliau berkata:  Sesungguhnya aku telah memberi Rasulullah SAW minuman daripada semua ini di dalam cawan ini: Madu, Nabidz, air, dan susu.",
        "arabic_text": "عَن أنسٍ قَالَ: لَقَدْ سَقَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَدَحِي هَذَا الشَّرَابَ كُلَّهُ: الْعَسَلَ والنَّبيذَ والماءَ وَاللَّبن. رَوَاهُ مُسلم"
      },
      {
        "id": 32981,
        "hadith_number": "4287",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Air Minuman Rasulullah SAW",
        "perawi_melayu": "Aisyah r.a.",
        "english_text": "And from Aishah (may Allah be pleased with her), she said: \"We used to keep water for the Messenger of Allah (peace and blessings of Allah be upon him) in a skin, the top of which was tied up. We would put it there in the morning, and he would drink it in the evening, and we would put it there in the evening, and he would drink it in the morning.\"",
        "malay_translation": "Daripada Aisyah r.a., beliau berkata: \"Kami biasa menyimpan air untuk Rasulullah SAW dalam sebuah kulit yang bahagian atasnya diikat. Kami akan meletakkannya di pagi hari, dan baginda akan meminumnya pada waktu petang, dan kami akan meletakkannya pada waktu petang, dan baginda akan meminumnya pada waktu pagi.\"",
        "arabic_text": "وَعَن عائشةَ قَالَتْ: كُنَّا نَنْبِذُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سِقَاءٍ يُوكَأُ أَعْلَاهُ وَلَهُ عَزْلَاءُ نَنْبِذُهُ غُدْوَةً فَيَشْرَبُهُ عِشَاءً وَنَنْبِذُهُ عِشَاءً فيشربُه غُدوةً. رَوَاهُ مُسلم"
      },
      {
        "id": 32982,
        "hadith_number": "4288",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Tempoh Pengambilan Nabidh Rasulullah SAW",
        "perawi_melayu": "Ibnu Abbas RA",
        "english_text": "No English text available",
        "malay_translation": "Daripada Ibnu Abbas RA berkata: Rasulullah SAW biasanya disediakan *nabidh* untuk baginda pada awal malam, kemudian baginda meminumnya apabila tiba waktu pagi pada hari tersebut, malam berikutnya, hari esoknya, malam seterusnya, dan hari esoknya sehingga waktu Asar. Jika ada lebihan, baginda akan memberikannya kepada pembantu rumah atau memerintahkan supaya ia ditumpahkan. Riwayat Muslim.",
        "arabic_text": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُنْبَذُ لَهُ أَوَّلَ اللَّيْلِ فَيَشْرَبُهُ إِذَا أَصْبَحَ يَوْمَهُ ذَلِكَ وَاللَّيْلَةَ الَّتِي تَجِيءُ وَالْغَدَ وَاللَّيْلَةَ الْأُخْرَى وَالْغَدَ إِلَى الْعَصْرِ فَإِنْ بَقِيَ شَيْءٌ سَقَاهُ الْخَادِمَ أَوْ أَمَرَ بهِ فصُبَّ. رَوَاهُ مُسلم"
      },
      {
        "id": 32983,
        "hadith_number": "4289",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Membuat Nabidh untuk Rasulullah SAW dalam Bekas Air atau Bekas Batu",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Tiada teks Bahasa Inggeris disediakan.",
        "malay_translation": "Daripada Jabir RA berkata: \"Nabidh (air rendaman kurma atau kismis) dibuat untuk Rasulullah SAW di dalam bekas airnya. Jika mereka tidak menjumpai bekas air, nabidh dibuat untuk baginda di dalam bekas batu.\" Riwayat Muslim.",
        "arabic_text": "وَعَن جابرٍ قَالَ: كَانَ يُنْبَذُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سِقَائِهِ فَإِذَا لَمْ يَجِدُوا سِقَاءً يُنْبَذُ لَهُ فِي تَوْرٍ مِنْ حِجَارَةٍ. رَوَاهُ مُسلم"
      },
      {
        "id": 32984,
        "hadith_number": "4290",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Rasulullah SAW terhadap Beberapa Jenis Burung",
        "perawi_melayu": "Ibn Umar",
        "english_text": "From Ibn Umar: that the Messenger of Allah (peace and blessings of Allah be upon him) forbade the killing of the Dubba', Hantam, Marfut and Naqir birds, and ordered that they be driven away from the water troughs.",
        "malay_translation": "Daripada Ibnu Umar: bahawa Rasulullah SAW melarang membunuh burung Dubba', Hantam, Marfut dan Naqir, dan memerintahkan supaya burung-burung tersebut dihalau dari tempat-tempat minuman.",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نهى عَن الدُّبَّاء والحنتم والمرفت وَالنَّقِيرِ وَأَمَرَ أَنْ يُنْبَذَ فِي أَسْقِيَةِ الْأَدَمِ. رَوَاهُ مُسلم"
      },
      {
        "id": 32985,
        "hadith_number": "4291",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Minuman dalam Bekas yang Tidak Jelas",
        "perawi_melayu": "Buraydah",
        "english_text": "Not Available",
        "malay_translation": "Daripada Buraydah, bahawa Rasulullah SAW bersabda:  \"Aku melarang kamu daripada meminum sesuatu dalam bekas yang tidak jelas jenisnya, kerana bekas seumpama itu tidak menghalalkan atau mengharamkan sesuatu. Dan setiap minuman yang memabukkan adalah haram.\"  Dalam satu riwayat lain disebutkan: Baginda bersabda: \"Aku melarang kamu daripada meminum minuman kecuali dalam bekas yang jelas, oleh itu minumlah dalam apa jua bekas selain daripada minuman yang memabukkan.\"",
        "arabic_text": "وَعَن بُرَيْدَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «نَهَيْتُكُمْ عَنِ الظُّرُوفِ فَإِنَّ ظَرْفًا لَا يُحِلُّ شَيْئًا وَلَا يُحَرِّمُهُ وَكُلُّ مُسْكِرٍ حَرَامٌ» . وَفِي رِوَايَةٍ: قَالَ: «نَهَيْتُكُمْ عَنِ الْأَشْرِبَةِ إِلَّا فِي ظُرُوفِ الْأَدَمِ فَاشْرَبُوا فِي كُلِّ وِعَاءٍ غَيْرَ أَنْ لَا تَشْرَبُوا مُسْكِرًا» . رَوَاهُ مُسْلِمٌ"
      },
      {
        "id": 32986,
        "hadith_number": "4292",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Arak Diharamkan Walaupun Dinamakan Dengan Nama Lain",
        "perawi_melayu": "Abu Malik Al-Asy'ari",
        "english_text": "Dari Abu Malik Al-Asy'ari RA, bahawa beliau mendengar Rasulullah SAW bersabda: \"Sesungguhnya akan ada orang dari umatku yang meminum arak, mereka menamakannya dengan nama yang lain (bukan arak)\". Riwayat Abu Daud dan Ibnu Majah.",
        "malay_translation": "Daripada Abu Malik Al-Asy'ari RA, bahawa beliau mendengar Rasulullah SAW bersabda: \"Sesungguhnya akan ada orang dari umatku yang meminum arak, mereka menamakannya dengan nama yang lain (bukan arak)\". Riwayat Abu Daud dan Ibnu Majah.",
        "arabic_text": "عَن أبي مَالك الْأَشْعَرِيّ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَيَشْرَبَنَّ نَاسٌ مِنْ أُمَّتِي الْخَمْرَ يُسَمُّونَهَا بِغَيْرِ اسْمِهَا» . رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ"
      },
      {
        "id": 32987,
        "hadith_number": "4293",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Nabīذ Dari Buah Kurma Hijau",
        "perawi_melayu": "Abdullah bin Abi Aufa",
        "english_text": "From Abdullah bin Abi Aufa, he said: The Messenger of Allah (ﷺ) forbade the drinking of fresh green date juice. I said: Shall I drink the white one? He said: “No.” Reported by Bukhari.",
        "malay_translation": "Daripada Abdullah bin Abi Aufa, beliau berkata: Rasulullah SAW melarang minuman nabiذ daripada buah tamar hijau. Saya bertanya: Bolehkah saya minum yang berwarna putih? Baginda menjawab: “Tidak.”  Riwayat Bukhari.",
        "arabic_text": "عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نَبِيذِ الْجَرِّ الْأَخْضَرِ قُلْتُ: أَنَشْرَبُ فِي الأبيضِ؟ قَالَ: «لَا» . رَوَاهُ البُخَارِيّ"
      },
      {
        "id": 32988,
        "hadith_number": "4294",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menjaga Anak-Anak Pada Waktu Malam dan Pencegahan Syaitan",
        "perawi_melayu": "Jabir",
        "english_text": "From Jabir, he said: The Messenger of Allah (ﷺ) said: “When the night approaches or you spend the evening, keep your children inside, for Satan spreads at that time. When an hour of the night has passed, let them out and close the doors, and mention the name of Allah, for Satan does not open a closed door. Secure your containers and mention the name of Allah, and cover your utensils and mention the name of Allah, even if you were to expose something to it, and extinguish your lamps.”",
        "malay_translation": "Dari Jabir, beliau berkata: Rasulullah SAW bersabda:  “Apabila malam menjelang atau kamu telah bermalam, jagalah anak-anak kamu kerana syaitan akan merebak pada ketika itu.  Apabila satu jam waktu malam telah berlalu, lepaskanlah mereka dan tutuplah pintu-pintu, serta sebutlah nama Allah, kerana syaitan tidak akan membuka pintu yang tertutup.  Selamatkan bekas-bekas kamu dan sebutlah nama Allah, dan tutuplah bekas-bekas kamu dan sebutlah nama Allah, walaupun kamu hendak menayangkan sesuatu kepadanya, dan padamkanlah lampu kamu.”",
        "arabic_text": "عَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا كَانَ جِنْحُ اللَّيْلِ أَوْ أَمْسَيْتُمْ فَكُفُّوا صِبْيَانَكُمْ فَإِنَّ الشَّيْطَانَ يَنْتَشِرُ حِينَئِذٍ فَإِذَا ذَهَبَ سَاعَةً مِنَ اللَّيْلِ فَخَلَّوهُمْ وَأَغْلِقُوا الْأَبْوَابَ وَاذْكُرُوا اسْمَ اللَّهِ فَإِنَّ الشَّيْطَانَ لَا يَفْتَحُ بَابًا مُغْلَقًا وَأَوْكُوا قِرَبَكُمْ وَاذْكُرُوا اسْمَ اللَّهِ وَخَمِّرُوا آنِيَتَكُمْ وَاذْكُرُوا اسْمَ اللَّهِ وَلَوْ أنْ تعرِضوا عَلَيْهِ شَيْئا وأطفئوا مصابيحكم»"
      },
      {
        "id": 32989,
        "hadith_number": "4295",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menutup Bekas, Menutup Pintu, dan Mencegah Kanak-Kanak Keluar Malam",
        "perawi_melayu": "Tidak dinyatakan dalam data asal",
        "english_text": "Not Available",
        "malay_translation": "Dalam satu riwayat Bukhari, Baginda SAW bersabda: “Tutuplah bekas-bekas minuman kamu, tutuplah tempayan-tempayan air kamu, tutuplah pintu-pintu rumah kamu, dan halangilah anak-anak kamu daripada keluar pada waktu malam.  Kerana syaitan itu boleh merebak atau merampas sesuatu pada waktu itu. Padamkan juga lampu-lampu apabila hendak tidur, kerana api yang menyala kadangkala boleh terjatuh lalu membakar penghuni rumah.”",
        "arabic_text": "وَفِي رِوَايَةٍ لِلْبُخَارِيِّ: قَالَ: «خَمِّرُوا الْآنِيَةَ وَأَوْكُوا الْأَسْقِيَةَ وَأَجِيفُوا الْأَبْوَابَ وَاكْفِتُوا صِبْيَانَكُمْ عِنْدَ الْمَسَاءِ فَإِن للجن انتشارا أَو خطْفَة وَأَطْفِئُوا الْمَصَابِيحَ عِنْدَ الرُّقَادِ فَإِنَّ الْفُوَيْسِقَةَ رُبَّمَا اجْتَرَّتْ الفتيلة فأحرقت أهل الْبَيْت»"
      },
      {
        "id": 32990,
        "hadith_number": "4296",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Arahan Menutup Bekas, Pintu, dan Memadamkan Lampu pada Waktu Malam",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Tiada teks Bahasa Inggeris disediakan",
        "malay_translation": "Dan dalam riwayat Muslim, Rasulullah ﷺ bersabda: 'Tutuplah bekas-bekas (makanan dan minuman), ikatlah kirbat air, tutuplah pintu-pintu, dan padamkanlah lampu. Sesungguhnya syaitan tidak dapat membuka ikatan kirbat air, tidak dapat membuka pintu, dan tidak dapat membuka bekas. Jika salah seorang di antara kamu tidak mendapati sesuatu untuk menutup bekasnya kecuali dengan meletakkan sebatang kayu di atasnya dan menyebut nama Allah, maka hendaklah dia melakukannya. Sesungguhnya tikus kecil (fūaisiqah) boleh menyebabkan kebakaran ke atas penghuni rumah.'",
        "arabic_text": "وَفِي رِوَايَةٍ لِمُسْلِمٍ قَالَ: «غَطُّوا الْإِنَاءَ وَأَوْكُوا السِّقَاءَ وَأَغْلِقُوا الْأَبْوَابَ وَأَطْفِئُوا السِّرَاجَ فَإِنَّ الشَّيْطَانَ لَا يَحُلُّ سِقَاءً وَلَا يَفْتَحُ بَابًا وَلَا يَكْشِفُ إِنَاءً فَإِنْ لَمْ يَجِدْ أَحَدُكُمْ إِلَّا أنْ يعرضَ على إِنائِه عوداً ويذكرَ اسمَ اللَّهَ فَلْيَفْعَلْ فَإِنَّ الْفُوَيْسِقَةَ تُضْرِمُ عَلَى أَهْلِ الْبَيْت بَيتهمْ»"
      },
      {
        "id": 32991,
        "hadith_number": "4297",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Membiarkan Haiwan dan Anak-anak Keluar Ketika Matahari Terbenam",
        "perawi_melayu": "Tidak diketahui",
        "english_text": "In a narration of the Prophet (peace and blessings be upon him): 'Do not send out your animals and your children when the sun sets until the darkness of Isha' (night prayer) departs, for Satan is unleashed when the sun sets until the darkness of Isha' departs.'",
        "malay_translation": "Dalam riwayat lain daripadanya (Nabi Muhammad SAW): 'Janganlah kamu melepaskan haiwan ternakan kamu dan anak-anak kamu apabila matahari terbenam sehingga hilang kegelapan Isyak, kerana sesungguhnya syaitan dilepaskan apabila matahari terbenam sehingga hilang kegelapan Isyak.'",
        "arabic_text": "وَفِي رِوَايَةٍ لَهُ: قَالَ: «لَا تُرْسِلُوا فَوَاشِيكُمْ وَصِبْيَانَكُمْ إِذَا غَابَتِ الشَّمْسُ حَتَّى تَذْهَبَ فَحْمَةُ الْعِشَاءِ فَإِنَّ الشَّيْطَانَ يَبْعَثُ إِذَا غَابَتِ الشَّمْسُ حَتَّى تذْهب فَحْمَة الْعشَاء»"
      },
      {
        "id": 32992,
        "hadith_number": "4298",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menutup Bekas dan Periuk bagi Mencegah Wabak",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Not Available",
        "malay_translation": "Dan dalam satu riwayat daripada hadis ini, Baginda SAW bersabda:  «Tutuplah bekas-bekas makanan kamu dan tutuplah periuk-periuk air kamu. Sesungguhnya pada setiap tahun terdapat satu malam di mana wabak akan turun. Wabak itu tidak akan melepasi sebarang bekas yang tidak ditutup atau periuk yang tidak ditutup kecuali ia akan turun ke dalamnya.»",
        "arabic_text": "وَفِي رِوَايَةٍ لَهُ: قَالَ: «غَطُّوا الْإِنَاءَ وَأَوْكُوا السِّقَاءَ فَإِنَّ فِي السَّنَةِ لَيْلَةً يَنْزِلُ فِيهَا وَبَاءٌ لَا يَمُرُّ بِإِنَاءٍ لَيْسَ عَلَيْهِ غِطَاءٌ أَوْ سِقَاءٌ لَيْسَ عَلَيْهِ وِكَاءٌ إِلَّا نَزَلَ فِيهِ من ذَلِك الوباء»"
      },
      {
        "id": 32993,
        "hadith_number": "4299",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Menutup Bekas Susu",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "And from him (Abu Hurairah) it is narrated that he said: Abu Humaid, a man from the Ansar of An-Naqi, came to the Prophet (ﷺ) with a vessel of milk. The Prophet (ﷺ) said: “Didn’t you cover it? Even if you were to just place a stick across it.”",
        "malay_translation": "Daripada Abu Hurairah, dia berkata: Abu Humaid, seorang lelaki daripada Ansar dari An-Naqi’ datang kepada Nabi SAW dengan membawa bekas susu. Nabi SAW bersabda: “Tidakkah engkau menutupnya? Walaupun hanya dengan meletakkan sebatang kayu di atasnya.”",
        "arabic_text": "وَعَنْهُ قَالَ: جَاءَ أَبُو حُمَيْدٍ رَجُلٌ مِنَ الْأَنْصَارِ مِنَ النَّقِيعِ بِإِنَاءٍ مِنْ لَبَنٍ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَلَّا خَمَّرْتَهُ وَلَوْ أنْ تعرِضَ عليهِ عوداً»"
      },
      {
        "id": 32994,
        "hadith_number": "4300",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Meninggalkan Api di Rumah Ketika Tidur",
        "perawi_melayu": "Ibnu Umar",
        "english_text": "It is narrated from Ibn Umar that the Prophet (peace and blessings be upon him) said: 'Do not leave fire in your houses when you sleep.'",
        "malay_translation": "Diriwayatkan daripada Ibnu Umar RA, daripada Nabi SAW bersabda: 'Jangan kamu biarkan api (menyala) di rumah kamu ketika kamu tidur.'",
        "arabic_text": "وَعَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَتْرُكُوا النَّارَ فِي بُيُوتِكُمْ حِينَ تنامون»"
      },
      {
        "id": 32995,
        "hadith_number": "4301",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Mengawal Api Pada Malam Hari",
        "perawi_melayu": "Abu Musa",
        "english_text": "Daripada Abu Musa, beliau berkata: Sebuah rumah di Madinah terbakar pada malam hari, menimpa penduduknya. Berita itu disampaikan kepada Nabi SAW. Baginda bersabda: \"Sesungguhnya api ini adalah musuh kepada kamu semua. Maka, apabila kamu tidur, padamkanlah api daripada kamu.\" ",
        "malay_translation": "Daripada Abu Musa, beliau berkata: Sebuah rumah di Madinah terbakar pada waktu malam, menimpa penghuninya.  Berita itu disampaikan kepada Nabi SAW. Baginda bersabda: \"Sesungguhnya api ini adalah musuh kepada kamu semua. Oleh itu, apabila kamu tidur, padamkanlah api dari sekeliling kamu.\" ",
        "arabic_text": "وَعَنْ أَبِي مُوسَى قَالَ: احْتَرَقَ بَيْتٌ بِالْمَدِينَةِ عَلَى أَهْلِهِ مِنَ اللَّيْلِ فَحُدِّثَ بِشَأْنِهِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ هَذِهِ النَّارُ إِنَّمَا هِيَ عَدُوٌّ لَكُمْ فَإِذَا نِمْتُمْ فأطفئوها عَنْكُم»"
      },
      {
        "id": 32996,
        "hadith_number": "4302",
        "status": "sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Petua Menjaga Diri daripada Syaitan pada Waktu Malam",
        "perawi_melayu": null,
        "english_text": null,
        "malay_translation": "Daripada Jabir, katanya: \"Aku mendengar Nabi SAW bersabda: \"Apabila kamu mendengar anjing menyalak dan keledai menghentak pada waktu malam, maka berlindunglah kepada Allah daripada syaitan yang terkutuk. Kerana sesungguhnya mereka melihat apa yang kamu tidak lihat. Dan kurangkanlah keluar masuk (dari rumah) apabila kaki sudah reda (beristirahat). Kerana sesungguhnya Allah SWT menyebarkan makhluk-Nya pada malam itu sekehendak-Nya. Tutuplah pintu dan sebutlah nama Allah pada pintu tersebut. Sesungguhnya syaitan tidak dapat membuka pintu apabila ia ditutup dan nama Allah disebut di atasnya. Dan tutuplah bekas-bekas air dan tutuplah perkakas. Dan ikatlah/tutuplah tempat menyimpan air.\"  Riwayat  dari  Syarah al-Sunnah.",
        "arabic_text": "عَنْ جَابِرٍ قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِذَا سَمِعْتُمْ نُبَاحَ الْكِلَابِ وَنَهِيقَ الْحَمِيرِ مِنَ اللَّيْلِ فَتَعَوَّذُوا بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ فَإِنَّهُنَّ يَرَيْنَ مَا لَا تَرَوْنَ. وَأَقِلُّوا الْخُرُوجَ إِذَا هَدَأَتِ الْأَرْجُلُ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ يَبُثُّ مِنْ خَلْقِهِ فِي لَيْلَتِهِ مَا يَشَاءُ وَأَجِيفُوا الْأَبْوَابَ وَاذْكُرُوا اسْمَ اللَّهِ عَلَيْهِ فَإِنَّ الشَّيْطَانَ لَا يَفْتَحُ بَابًا إِذَا أُجِيفَ وَذُكِرَ اسْمُ اللَّهِ عَلَيْهِ وَغَطُّوا الْجِرَارَ وَأَكْفِئُوا الْآنِيَةَ وأوكوا الْقرب» . رَوَاهُ فِي شرح السّنة"
      },
      {
        "id": 32997,
        "hadith_number": "4303",
        "status": "Sahih",
        "nama_buku": "Mishkat Al-Masabih",
        "penulis_buku": "Imam Khatib at-Tabrizi",
        "tajuk_hadith": "Larangan Meninggalkan Lampu Ketika Tidur",
        "perawi_melayu": "Ibn Abbas",
        "english_text": "Narrated by Ibn Abbas: A rat came and dragged a lampwick and threw it between the hands of the Messenger of Allah (peace be upon him) on the mat on which he was sitting. It burnt a spot the size of a dirham. He said, \"When you sleep, extinguish your lamps. Indeed, the devil directs something like this towards that, and it will burn you.\"",
        "malay_translation": "Diceritakan oleh Ibn Abbas: Seekor tikus datang dan menarik sumbu pelita lalu melemparkannya di antara tangan Rasulullah SAW di atas tikar tempat baginda duduk. Ia membakar sebahagian kecil sebesar dirham. Baginda bersabda, \"Apabila kamu tidur, padamkan pelita-pelita kamu. Sesungguhnya syaitan akan mengarahkan sesuatu seperti ini untuk membakar kamu.\"",
        "arabic_text": "وَعَن ابنِ عبَّاسٍ قَالَ: جَاءَتْ فَأْرَةٌ تَجُرُّ الْفَتِيلَةَ فَأَلْقَتْهَا بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْخَمْرَةِ الَّتِي كَانَ قَاعِدًا عَلَيْهَا فَأَحْرَقَتْ مِنْهَا مِثْلَ مَوْضِعِ الدِّرْهَمِ فَقَالَ: «إِذَا نِمْتُمْ فَأَطْفِئُوا سُرُجَكُمْ فَإِنَّ الشَّيْطَانَ يَدُلُّ مِثْلَ هَذِهِ عَلَى هَذَا فَيَحْرِقُكُمْ» . رَوَاهُ أَبُو دَاوُدَ وَهَذَا الْبَاب خَال من الْفَصْل الثَّالِث"
      }
    ]
  }
}