{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 54,
    "data": [
      {
        "id": 17160,
        "hadith_number": "2036",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Cinta Allah: Menjauhkan dari Dunia",
        "perawi_melayu": "Qatadah bin An-Nu'man",
        "english_text": "Qatadah bin An-Nu'man narrated that the Messenger of Allah (s.a.w) said: When Allah loves a slave, He prevents him from the world, just as one of you prevents his sick from water.",
        "malay_translation": "Qatadah bin An-Nu'man meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Apabila Allah mencintai seorang hamba, Dia menghalanginya daripada dunia, seperti mana salah seorang daripada kamu menghalang orang sakitnya daripada air.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا إِسْحَاق بْنُ مُحَمَّدٍ الْفَرْوِيُّ، حَدَّثَنَا إِسْمَاعِيل بْنُ جَعْفَرٍ، عَنْ عُمَارَةَ بْنِ غَزِيَّةَ، عَنْ عَاصِمِ بْنِ عُمَرَ بْنِ قَتَادَةَ، عَنْ مَحْمُودِ بْنِ لَبِيدٍ، عَنْ قَتَادَةَ بْنِ النُّعْمَانِ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِذَا أَحَبَّ اللَّهُ عَبْدًا حَمَاهُ الدُّنْيَا كَمَا يَظَلُّ أَحَدُكُمْ يَحْمِي سَقِيمَهُ الْمَاءَ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَابِ عَنْ صُهَيْبٍ، ‏‏‏‏‏‏وَأُمِّ الْمُنْذِرِ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ مَحْمُودِ بْنِ لَبِيدٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا"
      },
      {
        "id": 17161,
        "hadith_number": "2037",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Nasihat Nabi Kepada Ali Tentang Makanan Ketika Pemulihan",
        "perawi_melayu": "Ummu al-Mundhir",
        "english_text": "Umm Al-Mundhir said: The Messenger of Allah (ﷺ) entered upon me, while `Ali was with him, and we had a cluster of unripe dates hanging. She said: The Messenger of Allah (ﷺ) began eating, and `Ali ate with him. The Messenger of Allah (ﷺ) said to `Ali: 'Stop, stop, for you are still recovering.' So `Ali sat and the Prophet (ﷺ) ate. She said: I made some chard and barley for them, so the Prophet (ﷺ) said: 'O `Ali eat from this, for indeed it will be more suitable for you.",
        "malay_translation": "Ummu al-Mundhir meriwayatkan: Rasulullah ﷺ masuk menemuiku ketika Ali bersama baginda, dan kami mempunyai setangkai kurma muda yang tergantung. Beliau berkata: Rasulullah ﷺ mula makan, dan Ali makan bersama baginda. Rasulullah ﷺ bersabda kepada Ali: 'Berhenti, berhenti, kerana kamu masih belum pulih sepenuhnya.' Lalu Ali duduk dan Nabi ﷺ makan. Beliau berkata lagi: Saya menyediakan sedikit sayur sawi dan barli untuk mereka, kemudian Nabi ﷺ bersabda: 'Wahai Ali, makanlah ini, kerana sesungguhnya ia lebih sesuai untukmu.'",
        "arabic_text": "حَدَّثَنَا عَبَّاسُ بْنُ مُحَمَّدٍ الدُّورِيُّ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، عَنْ عُثْمَانَ بْنِ عَبْدِ الرَّحْمَنِ التَّيْمِيِّ، عَنْ يَعْقُوبَ بْنِ أَبِي يَعْقُوبَ، عَنْ أُمِّ الْمُنْذِرِ، قَالَتْ:‏‏‏‏ دَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَهُ عَلِيٌّ وَلَنَا دَوَالٍ مُعَلَّقَةٌ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ فَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ، ‏‏‏‏‏‏وَعَلِيٌّ مَعَهُ يَأْكُلُ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِعَلِيٍّ:‏‏‏‏ مَهْ مَهْ يَا عَلِيُّ، ‏‏‏‏‏‏فَإِنَّكَ نَاقِهٌ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَجَلَسَ عَلِيٌّ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ فَجَعَلْتُ لَهُمْ سِلْقًا وَشَعِيرًا، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَا عَلِيُّ، ‏‏‏‏‏‏ مِنْ هَذَا فَأَصِبْ فَإِنَّهُ أَوْفَقُ لَكَ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ فُلَيْحٍ، ‏‏‏‏‏‏وَيُرْوَى عَنْ فُلَيْحٍ، ‏‏‏‏‏‏عَنْ أَيُّوبَ بْنِ عَبْدِ الرَّحْمَنِ"
      },
      {
        "id": 17162,
        "hadith_number": "2038",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Galakan Berubat dan Setiap Penyakit Ada Ubat Kecuali Usia Tua",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Usamah bin Sharik said: Some Bedouins asked: 'O Messenger of Allah (s.a.w) shall we treat (our ill)?' He said: 'Yes, O worshipers of Allah! Use remedies. For indeed Allah did not make a disease but He made a cure for it' - or - 'a remedy. Except for one disease.' They said: 'O Messenger of Allah (s.a.w)! What is it?' He said: 'Old age.'",
        "malay_translation": "Usamah bin Sharik berkata: Beberapa orang Badwi bertanya: 'Wahai Rasulullah (s.a.w), adakah patut kami berubat (untuk penyakit kami)?' Baginda bersabda: 'Ya, wahai hamba-hamba Allah! Berubatlah kamu. Sesungguhnya Allah tidak menciptakan penyakit melainkan Dia menciptakan penawarnya' - atau - 'ubatnya. Kecuali satu penyakit.' Mereka bertanya: 'Wahai Rasulullah (s.a.w)! Apakah itu?' Baginda bersabda: 'Usia tua.'",
        "arabic_text": "حَدَّثَنَا بِشْرُ بْنُ مُعَاذٍ الْعَقَدِيُّ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ زِيَادِ بْنِ عِلَاقَةَ، عَنْ أُسَامَةَ بْنِ شَرِيكٍ، قَالَ:‏‏‏‏ قَالَتْ الْأَعْرَابُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏أَلَا نَتَدَاوَى ؟ قَالَ:‏‏‏‏ نَعَمْ يَا عِبَادَ اللَّهِ، ‏‏‏‏‏‏تَدَاوَوْا، ‏‏‏‏‏‏فَإِنَّ اللَّهَ لَمْ يَضَعْ دَاءً إِلَّا وَضَعَ لَهُ شِفَاءً، ‏‏‏‏‏‏أَوْ قَالَ:‏‏‏‏ دَوَاءً، ‏‏‏‏‏‏إِلَّا دَاءً وَاحِدًا، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏وَمَا هُوَ ؟ قَالَ:‏‏‏‏ الْهَرَمُ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَابِ عَنِ ابْنِ مَسْعُودٍ، ‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَأَبِي خُزَامَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17163,
        "hadith_number": "2039",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Khasiat Bubur untuk Orang Sakit dan Berduka",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Aishah narrated: Whenever one of the wives of the Messenger of Allah (s.a.w) became (feverishly) ill, he would order that some broth be prepared. Then he would tell them to take some of the broth. And he would say: 'It firms the heart of the grieved, and it rids the worries from the heart of the ill just as one of you removes dirt from her face with water.",
        "malay_translation": "Aisyah meriwayatkan: Setiap kali salah seorang isteri Rasulullah (s.a.w) jatuh sakit (demam), baginda akan memerintahkan agar disediakan bubur. Kemudian baginda akan menyuruh mereka mengambil sedikit bubur tersebut. Dan baginda bersabda: 'Ia menguatkan hati orang yang berduka, dan ia menghilangkan kegelisahan dari hati orang yang sakit sebagaimana salah seorang dari kamu menghilangkan kotoran dari wajahnya dengan air.'",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، أَخْبَرَنَا إِسْمَاعِيل بْنُ إِبْرَاهِيمَ، حَدَّثَنَا مُحَمَّدُ بْنُ السَّائِبِ بْنِ بَرَكَةَ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ، قَالَتْ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَخَذَ أَهْلَهُ الْوَعَكُ أَمَرَ بِالْحِسَاءِ فَصُنِعَ، ‏‏‏‏‏‏ثُمَّ أَمَرَهُمْ فَحَسَوْا مِنْهُ، ‏‏‏‏‏‏وَكَانَ يَقُولُ:‏‏‏‏ إِنَّهُ لَيَرْتُو فُؤَادَ الْحَزِينِ، ‏‏‏‏‏‏وَيَسْرُو عَنْ فُؤَادِ السَّقِيمِ كَمَا تَسْرُو إِحْدَاكُنَّ الْوَسَخَ بِالْمَاءِ عَنْ وَجْهِهَا ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17164,
        "hadith_number": "2040",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Larangan Memaksa Orang Sakit Makan",
        "perawi_melayu": "Uqbah bin Amir Al-Juhani",
        "english_text": "Uqbah bin Amir Al-Juhani narrated that the Messenger of Allah (s.a.w) said: Do not force your sick to eat, for indeed Allah, Blessed and Most High, provides them food and drink. (Dai'f)",
        "malay_translation": "Uqbah bin Amir Al-Juhani meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Janganlah kamu memaksa orang sakit kamu untuk makan, kerana sesungguhnya Allah, Yang Maha Berkat dan Maha Tinggi, memberikan mereka makanan dan minuman. (Dhaif)",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا بَكْرُ بْنُ يُونُسَ بْنِ بُكَيْرٍ، عَنْ مُوسَى بْنِ عَلِيٍّ، عَنْ أَبِيهِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تُكْرِهُوا مَرْضَاكُمْ عَلَى الطَّعَامِ فَإِنَّ اللَّهَ يُطْعِمُهُمْ وَيَسْقِيهِمْ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ."
      },
      {
        "id": 17165,
        "hadith_number": "2041",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Habbatus Sauda: Penawar Segala Penyakit Kecuali Kematian",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said: Use this black seed. For indeed it contains a cure for every disease except As-Sam And As-Sam is death.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Gunakanlah biji hitam ini. Sesungguhnya ia mengandungi penawar bagi setiap penyakit kecuali As-Sam, dan As-Sam itu adalah kematian.",
        "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، وَسَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ، قَالَا:‏‏‏‏ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ عَلَيْكُمْ بِهَذِهِ الْحَبَّةِ السَّوْدَاءِ، ‏‏‏‏‏‏فَإِنَّ فِيهَا شِفَاءً مِنْ كُلِّ دَاءٍ إِلَّا السَّامَ، ‏‏‏‏‏‏وَالسَّامُ:‏‏‏‏ الْمَوْتُ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَابِ عَنْ بُرَيْدَةَ، ‏‏‏‏‏‏وَابْنِ عُمَرَ، ‏‏‏‏‏‏وَعَائِشَةَ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَالْحَبَّةُ السَّوْدَاءُ:‏‏‏‏ هِيَ الشُّونِيزُ."
      },
      {
        "id": 17166,
        "hadith_number": "2042",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Arahan Minum Susu dan Air Kencing Unta untuk Orang Sakit",
        "perawi_melayu": "Anas",
        "english_text": "Anas narrated Some people from Urainah arrived in Al-Madinah, and they were uncomfortable (with the climate). So the Messenger of Allah (s.a.w) sent them some camels from charity. He told them: Drink from their milk and Urine .",
        "malay_translation": "Anas meriwayatkan Beberapa orang dari Urainah tiba di Madinah, dan mereka merasa tidak selesa (dengan iklim).  Rasulullah (s.a.w) lalu menghantar beberapa ekor unta zakat kepada mereka. Baginda bersabda kepada mereka: Minumlah dari susu dan air kencingnya.",
        "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، أَخْبَرَنَا حُمَيْدٌ، وَثَابِتٌ، وَقَتَادَةُ، عَنْ أَنَسٍ، أَنَّ نَاسًا مِنْ عُرَيْنَةَ قَدِمُوا الْمَدِينَةَ فَاجْتَوَوْهَا، ‏‏‏‏‏‏فَبَعَثَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي إِبِلِ الصَّدَقَةِ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ اشْرَبُوا مِنْ أَلْبَانِهَا وَأَبْوَالِهَا، ‏‏‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17167,
        "hadith_number": "2043",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Larangan Membunuh Diri dan Azabnya",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Abu Hurairah narrated (from the Messenger of Allah (s.a.w)): Whoever kills himself with (an instrument of)iron, he will come on the Day Of Judgment with his iron in his hand, to continually stab himself in his stomach with it, in the fire of Jahannam, dwelling in that state eternally. And whoever kills himself with poison, then his poison will be in his hand, to continually take it in the Fire of Jahannam, dwelling in that state eternally.",
        "malay_translation": "Abu Hurairah meriwayatkan (daripada Rasulullah (s.a.w)): Sesiapa yang membunuh diri dengan (alat) besi, dia akan datang pada Hari Kiamat dengan besinya di tangannya, untuk terus menerus menikam perutnya dengannya, di dalam api Jahannam, kekal dalam keadaan itu selama-lamanya. Dan sesiapa yang membunuh diri dengan racun, maka racunnya akan berada di tangannya, untuk terus menerus mengambilnya di dalam Api Jahannam, kekal dalam keadaan itu selama-lamanya.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ، عَنِ الْأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَرَاهُ رَفَعَهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَنْ قَتَلَ نَفْسَهُ بِحَدِيدَةٍ جَاءَ يَوْمَ الْقِيَامَةِ وَحَدِيدَتُهُ فِي يَدِهِ يَتَوَجَّأُ بِهَا فِي بَطْنِهِ فِي نَارِ جَهَنَّمَ، ‏‏‏‏‏‏خَالِدًا مُخَلَّدًا أَبَدًا، ‏‏‏‏‏‏وَمَنْ قَتَلَ نَفْسَهُ بِسُمٍّ، ‏‏‏‏‏‏فَسُمُّهُ فِي يَدِهِ يَتَحَسَّاهُ فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا أَبَدًا ."
      },
      {
        "id": 17168,
        "hadith_number": "2044",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Larangan Membunuh Diri dan Akibatnya di Neraka",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Abu Hurairah narrated (that the the Messenger of Allah (s.a.w)) said: Whoever kills himself with (an instrument of)iron, his iron will be in his hand, to continually stab himself in his stomach with it, in the fire of Jahannam, dwelling in that state eternally. And whoever kills himself with poison, then his poison will be in his hand, to continually take it in the Fire of Jahannam, dwelling in that state eternally. And whoever throws himself from a mountain to kill himself, then he will be continually throwing himself in the Fire of Jahannam, dwelling in that state eternally",
        "malay_translation": "Abu Hurairah meriwayatkan (bahawa Rasulullah (s.a.w)) bersabda: Sesiapa yang membunuh diri dengan (alat) besi, besinya akan berada di tangannya, untuk terus menikam perutnya dengannya, di dalam neraka Jahannam, kekal di dalam keadaan itu selama-lamanya. Dan sesiapa yang membunuh diri dengan racun, maka racunnya akan berada di tangannya, untuk terus meminumnya di dalam Neraka Jahannam, kekal di dalam keadaan itu selama-lamanya. Dan sesiapa yang mencampakkan dirinya dari gunung untuk membunuh diri, maka dia akan terus mencampakkan dirinya di dalam Neraka Jahannam, kekal di dalam keadaan itu selama-lamanya.",
        "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو دَاوُدَ، عَنِ شُعْبَةَ، عَنْ الْأَعْمَشِ، قَال:‏‏‏‏ سَمِعْتُ أَبَا صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ قَتَلَ نَفْسَهُ بِحَدِيدَةٍ فَحَدِيدَتُهُ فِي يَدِهِ يَتَوَجَّأُ بِهَا فِي بَطْنِهِ فِي نَارِ جَهَنَّمَ، ‏‏‏‏‏‏خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا، ‏‏‏‏‏‏وَمَنْ قَتَلَ نَفْسَهُ بِسُمٍّ، ‏‏‏‏‏‏فَسُمُّهُ فِي يَدِهِ يَتَحَسَّاهُ فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا، ‏‏‏‏‏‏وَمَنْ تَرَدَّى مِنْ جَبَلٍ فَقَتَلَ نَفْسَهُ فَهُوَ يَتَرَدَّى فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا"
      },
      {
        "id": 17169,
        "hadith_number": "2045",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Larangan Perubatan Khabith (Racun)",
        "perawi_melayu": "Diriwayatkan daripada",
        "english_text": "Abu Hurairah narrated: The Messenger of Allah (s.a.w) forbade from cures that are Khabith. [Abu 'Elsa said:] Meaning poison",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah R.A.: Rasulullah SAW melarang daripada perubatan yang Khabith. [Abu 'Elsa berkata:] Maknanya racun.",
        "arabic_text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ يُونُسَ بْنِ أَبِي إِسْحَاق، عَنْ مُجَاهِدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الدَّوَاءِ الْخَبِيثِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ يَعْنِي السُّمَّ."
      },
      {
        "id": 17170,
        "hadith_number": "2046",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Khamr Bukanlah Penawar, Tetapi Penyakit",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Simak narrated that he heard 'Alqamah bin Wa'il narrate from his father, that he witnessed the Prophet (s.a.w) being asked by Suwaid bin Tariq -or Tariq bin Suwaid- about Khamr, and he forbade it. So he said: We use it as a treatment. So the Messenger of Allah (S.A.W) said: It is certainly not a treatment, rather, it is a disease.",
        "malay_translation": "Simak meriwayatkan bahawa dia mendengar 'Alqamah bin Wa'il meriwayatkan daripada ayahnya, bahawa dia menyaksikan Nabi (s.a.w) ditanya oleh Suwaid bin Tariq -atau Tariq bin Suwaid- tentang Khamr, dan baginda melarangnya. Lalu dia berkata: Kami menggunakannya sebagai rawatan. Maka Rasulullah (S.A.W) bersabda: Sesungguhnya ia bukanlah rawatan, bahkan, ia adalah penyakit.",
        "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو دَاوُدَ، عَنْ شُعْبَةَ، عَنْ سِمَاكٍ، أَنَّهُ سَمِعَ عَلْقَمَةَ بْنَ وَائِلٍ، عَنْ أَبِيهِ، أَنَّهُ شَهِدَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَسَأَلَهُ سُوَيْدُ بْنُ طَارِقٍ أَوْ طَارِقُ بْنُ سُوَيْدٍ عَنِ الْخَمْرِ، ‏‏‏‏‏‏فَنَهَاهُ عَنْهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنَّا نَتَدَاوَى بِهَا، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّهَا لَيْسَتْ بِدَوَاءٍ وَلَكِنَّهَا دَاءٌ ."
      },
      {
        "id": 17171,
        "hadith_number": "2047",
        "status": "Daif",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Rawatan Terbaik: As-Sa'ut, Al-Ladud, Bekam dan Julap",
        "perawi_melayu": "Ibn 'Abbas RA",
        "english_text": "Ibn 'Abbas narrated that the Messenger of Allah (s.a.w) said: Indeed the best of what you treat is As-Sa'ut, Al-Ladud, cupping and laxatives.' So when the Messenger of Allah (S.A.W) was suffering his companions treated him with Al-Ladud, and when they were finished he said: 'Treat them with Al-Ladud.' So all of them except Al-Abbas were treated with Al-Ladud. (Daif)",
        "malay_translation": "Daripada Ibn 'Abbas RA meriwayatkan bahawa Rasulullah SAW bersabda: Sesungguhnya sebaik-baik rawatan yang kamu lakukan adalah As-Sa'ut, Al-Ladud, bekam dan julap.' Maka ketika Rasulullah SAW sedang menderita sakit, para sahabatnya merawat baginda dengan Al-Ladud, dan ketika mereka selesai, baginda bersabda: 'Rawat mereka dengan Al-Ladud.' Maka semua mereka kecuali Al-Abbas dirawat dengan Al-Ladud. (Daif)",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مَدُّوَيْهِ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ حَمَّادٍ الشُّعَيْثِيُّ، حَدَّثَنَا عَبَّادُ بْنُ مَنْصُورٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ خَيْرَ مَا تَدَاوَيْتُمْ بِهِ:‏‏‏‏ السَّعُوطُ، ‏‏‏‏‏‏وَاللَّدُودُ، ‏‏‏‏‏‏وَالْحِجَامَةُ، ‏‏‏‏‏‏وَالْمَشِيُّ ، ‏‏‏‏‏‏فَلَمَّا اشْتَكَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَدَّهُ أَصْحَابُهُ، ‏‏‏‏‏‏فَلَمَّا فَرَغُوا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لُدُّوهُمْ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَلُدُّوا كُلُّهُمْ غَيْرَ الْعَبَّاسِ ."
      },
      {
        "id": 17172,
        "hadith_number": "2048",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Sebaik-baik Rawatan: As-Sa'ut, Al-Ladud, Bekam, Julap dan Kelebihan Bercelak Ithmid",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Ibn 'Abbas narrated that the Messenger of Allah (s.a.w) said: Indeed the best of what you treat is As-Sa'ut, Al-Ladud, cupping and laxatives.' And the best of what you use for Kuhl is Ithmid, for it clears the vision and grows the hair (eye-lashes). And he said: The Messenger of Allah (s.a.w) had a Kuhl holder with which he would apply Kuhl before sleeping three in each eye.",
        "malay_translation": "Daripada Ibn 'Abbas meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Sesungguhnya sebaik-baik apa yang kamu gunakan untuk berubat adalah As-Sa'ut, Al-Ladud, bekam dan julap.' Dan sebaik-baik apa yang kamu gunakan untuk bercelak adalah Ithmid, kerana ia membersihkan penglihatan dan menumbuhkan rambut (bulu mata). Dan baginda bersabda: Rasulullah (s.a.w) mempunyai bekas celak yang dengannya baginda akan bercelak sebelum tidur, tiga kali pada setiap mata.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، حَدَّثَنَا عَبَّادُ بْنُ مَنْصُورٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ خَيْرَ مَا تَدَاوَيْتُمْ بِهِ:‏‏‏‏ اللَّدُودُ، ‏‏‏‏‏‏وَالسَّعُوطُ، ‏‏‏‏‏‏وَالْحِجَامَةُ، ‏‏‏‏‏‏وَالْمَشِيُّ، ‏‏‏‏‏‏وَخَيْرُ مَا اكْتَحَلْتُمْ بِهِ:‏‏‏‏ الْإِثْمِدُ، ‏‏‏‏‏‏فَإِنَّهُ يَجْلُو الْبَصَرَ وَيُنْبِتُ الشَّعْرَ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَكَانَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُكْحُلَةٌ يَكْتَحِلُ بِهَا عِنْدَ النَّوْمِ ثَلَاثًا فِي كُلِّ عَيْنٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ 75، ‏‏‏‏‏‏وَهُوَ حَدِيثُ عَبَّادِ بْنِ مَنْصُورٍ."
      },
      {
        "id": 17173,
        "hadith_number": "2049",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Larangan Berubat dengan Besi Panas",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Imran bin Husain narrated that the Messenger of Allah (s.a.w) prohibited cauterization. He said: We were tested (with severe medical condition) so we were cauterized, but we did not have good results, nor was it successful for us.",
        "malay_translation": "Imran bin Husain meriwayatkan bahawa Rasulullah (s.a.w) melarang rawatan dengan besi panas. Baginda bersabda: Kami telah diuji (dengan keadaan perubatan yang teruk) lalu kami dirawat dengan besi panas, tetapi kami tidak mendapat hasil yang baik, dan ia tidak berjaya untuk kami.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الْكَيِّ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَابْتُلِينَا فَاكْتَوَيْنَا فَمَا أَفْلَحْنَا وَلَا أَنْجَحْنَا، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17174,
        "hadith_number": "2050",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Nabi (SAW) Melakukan Kay kepada As'ad bin Zurarah kerana Shawkah",
        "perawi_melayu": "Tidak Dinyatakan",
        "english_text": "Anas narrated: The Prophet (S.A.W) cauterized As'ad bin Zurarah for Shawkah",
        "malay_translation": "Anas meriwayatkan: Nabi (SAW) telah melakukan cauterization (kay) kepada As'ad bin Zurarah kerana Shawkah.",
        "arabic_text": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسٍ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَوَى أَسْعَدَ بْنَ زُرَارَةَ مِنَ الشَّوْكَةِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَابِ عَنْ أُبَيٍّ، ‏‏‏‏‏‏وَجَابِرٍ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ."
      },
      {
        "id": 17175,
        "hadith_number": "2051",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Waktu Berbekam Nabi (S.A.W)",
        "perawi_melayu": "Anas",
        "english_text": "Anas narrated: The Prophet (S.A.W) would get cupped in his jugular veins and his upper back. And he would get cupped on the seventeenth (of the month), (or) the nineteenth, and (or) the twenty first.",
        "malay_translation": "Anas meriwayatkan: Nabi (S.A.W) berbekam di urat jugular dan bahagian atas belakangnya. Dan baginda berbekam pada hari ketujuh belas (bulan), (atau) kesembilan belas, dan (atau) kedua puluh satu.",
        "arabic_text": "حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ، حَدَّثَنَا هَمَّامٌ، وَجَرِيرُ بْنُ حَازِمٍ، قَالَا:‏‏‏‏ حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ، قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحْتَجِمُ فِي الْأَخْدَعَيْنِ وَالْكَاهِلِ، ‏‏‏‏‏‏وَكَانَ يَحْتَجِمُ لِسَبْعَ عَشْرَةَ وَتِسْعَ عَشْرَةَ وَإِحْدَى وَعِشْرِينَ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَمَعْقِلِ بْنِ يَسَارٍ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ."
      },
      {
        "id": 17176,
        "hadith_number": "2052",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Anjuran Berbekam Semasa Isra'",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Ibn Mas'ud said: The Messenger of Allah (S.A.W) narrated about the Night of Isra', saying that he did not pass an assembly of angels except that they ordered him: 'Order cupping among your Ummah.",
        "malay_translation": "Ibn Mas'ud berkata: Rasulullah (S.A.W) menceritakan tentang Malam Isra', dengan mengatakan bahawa baginda tidak melewati sekumpulan malaikat melainkan mereka memerintahkannya: 'Perintahkanlah bekam (cupping) di kalangan Umatmu.'",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ بُدَيْلِ بْنِ قُرَيْشٍ الْيَامِّيُّ الْكُوفِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَاق، عَنِ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ هُوَ ابْنُ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، عَنْ أَبِيهِ، عَنِ ابْنِ مَسْعُودٍ، قَالَ:‏‏‏‏ حَدَّثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لَيْلَةِ أُسْرِيَ بِهِ:‏‏‏‏ أَنَّهُ لَمْ يَمُرَّ عَلَى مَلَإٍ مِنَ الْمَلَائِكَةِ إِلَّا أَمَرُوهُ:‏‏‏‏ أَنْ مُرْ أُمَّتَكَ بِالْحِجَامَةِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏مِنْ حَدِيثِ ابْنِ مَسْعُودٍ."
      },
      {
        "id": 17177,
        "hadith_number": "2053",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keutamaan Bekam dan Waktu Terbaik untuk Berbekam",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Abbad bin Mansur narrated from 'Ikrimah who said: Ibn 'Abbas had three boys who were cuppers. He would use the proceeds from two of them for himself and his family, and one of them would cup him and his family. He said: Ibn 'Abbas said: 'The Prophet (S.A.W) said: 'How excellent is the slave who cups, letting the blood, relieving the back, and clearing the vision. And he said: Indeed the best for you to cup on are the seventeenth, the nineteenth, and the twenty-first. And he said: Indeed the best of what you treat is As-Sa'ut, Al-Ladud, cupping and laxatives. And indeed, The Messenger of Allah (S.A.W) was given medicine by Al-Abbas and his companions. So the The Messenger of Allah (S.A.W) said: Who gave me this medicine? All of them were silent, so he said that there shall not remain anyone in the house but he should be treated with Ladud except for his uncle Al-Abbas.' An-Nadr said: Al-Ladud is Al-Wajur.",
        "malay_translation": "Abbad bin Mansur meriwayatkan daripada 'Ikrimah yang berkata: Ibn 'Abbas mempunyai tiga orang anak lelaki yang merupakan tukang bekam. Beliau menggunakan hasil daripada dua orang daripada mereka untuk dirinya dan keluarganya, dan seorang daripada mereka akan membekam beliau dan keluarganya. Beliau berkata: Ibn 'Abbas berkata: 'Nabi (S.A.W) bersabda: 'Sebaik-baik hamba adalah tukang bekam, mengeluarkan darah, melegakan belakang, dan menjernihkan penglihatan.' Dan beliau bersabda: Sesungguhnya sebaik-baik hari untuk kamu berbekam adalah pada hari ketujuh belas, kesembilan belas, dan kedua puluh satu. Dan beliau bersabda: Sesungguhnya sebaik-baik ubat yang kamu gunakan adalah As-Sa'ut, Al-Ladud, bekam dan julap. Dan sesungguhnya, Rasulullah (S.A.W) telah diberi ubat oleh Al-Abbas dan sahabat-sahabatnya. Maka Rasulullah (S.A.W) bersabda: Siapa yang memberi aku ubat ini? Kesemua mereka diam, maka beliau bersabda bahawa tidak akan tinggal seorang pun di rumah itu melainkan dia harus dirawat dengan Ladud kecuali bapa saudaranya Al-Abbas.' An-Nadr berkata: Al-Ladud adalah Al-Wajur.",
        "arabic_text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ، حَدَّثَنَا عَبَّادُ بْنُ مَنْصُورٍ، قَال:‏‏‏‏ سَمِعْتُ عِكْرِمَةَ، يَقُولُ:‏‏‏‏ كَانَ لِابْنِ عَبَّاسٍ غِلْمَةٌ ثَلَاثَةٌ حَجَّامُونَ، ‏‏‏‏‏‏فَكَانَ اثْنَانِ مِنْهُمْ يُغِلَّانِ عَلَيْهِ وَعَلَى أَهْلِهِ، ‏‏‏‏‏‏وَوَاحِدٌ يَحْجُمُهُ وَيَحْجُمُ أَهْلَهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَقَالَ ابْنُ عَبَّاسٍ:‏‏‏‏ قَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ نِعْمَ الْعَبْدُ الْحَجَّامُ، ‏‏‏‏‏‏يُذْهِبُ الدَّمَ وَيُخِفُّ الصُّلْبَ، ‏‏‏‏‏‏وَيَجْلُو عَنِ الْبَصَرِ . (حديث مرفوع) (حديث موقوف) وَقَالَ:‏‏‏‏ وَقَالَ:‏‏‏‏ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ عُرِجَ بِهِ مَا مَرَّ عَلَى مَلَإٍ مِنَ الْمَلَائِكَةِ إِلَّا قَالُوا:‏‏‏‏ عَلَيْكَ بِالْحِجَامَةِ . (حديث مرفوع) (حديث موقوف) وَقَالَ:‏‏‏‏ إِنَّ خَيْرَ مَا تَحْتَجِمُونَ فِيهِ:‏‏‏‏ يَوْمَ سَبْعَ عَشْرَةَ، ‏‏‏‏‏‏وَيَوْمَ تِسْعَ عَشْرَةَ، ‏‏‏‏‏‏وَيَوْمَ إِحْدَى وَعِشْرِينَ . (حديث مرفوع) (حديث موقوف) وَقَالَ:‏‏‏‏ إِنَّ خَيْرَ مَا تَدَاوَيْتُمْ بِهِ:‏‏‏‏ السَّعُوطُ، ‏‏‏‏‏‏وَاللَّدُودُ، ‏‏‏‏‏‏وَالْحِجَامَةُ، ‏‏‏‏‏‏وَالْمَشِيُّ . (حديث مرفوع) (حديث موقوف) وَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَدَّهُ الْعَبَّاسُ وَأَصْحَابُهُ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ لَدَّنِي ؟ فَكُلُّهُمْ أَمْسَكُوا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ لَا يَبْقَى أَحَدٌ مِمَّنْ فِي الْبَيْتِ إِلَّا لُدَّ غَيْرَ عَمِّهِ الْعَبَّاسِ، ‏‏‏‏‏‏قَالَ عَبْدٌ:‏‏‏‏ قَالَ:‏‏‏‏ النَّضْرُ اللَّدُودُ الْوَجُورُ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ عَبَّادِ بْنِ مَنْصُورٍ، ‏‏‏‏‏‏وَفِي الْبَابِ عَنْ عَائِشَةَ."
      },
      {
        "id": 17178,
        "hadith_number": "2054",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Penggunaan Inai untuk Luka Nabi (S.A.W)",
        "perawi_melayu": "Ali bin 'Ubaidullah dan Salma",
        "english_text": "Ali bin 'Ubaidullah narrated that his grandmother [Salma] - who used to serve the The Prophet (S.A.W) said: There was no wound nor cut on the Messenger of Allah (S.A.W) but he would order me to put Hinna on it.",
        "malay_translation": "Ali bin 'Ubaidullah meriwayatkan bahawa neneknya [Salma] - yang dahulunya berkhidmat kepada Nabi (S.A.W) bersabda: Tidak ada luka atau hirisan pada Rasulullah (S.A.W) melainkan baginda akan memerintahkan saya untuk meletakkan Hinna (inai) padanya.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ الْخَيَّاطُ، حَدَّثَنَا فَائِدٌ مَوْلًى لِآلِ أَبِي رَافِعٍ، ‏‏‏‏‏‏عَنْ عَلِيِّ بْنِ عُبَيْدِ اللَّهِ، عَنْ جَدَّتِهِ سَلْمَى، وَكَانَتْ تَخْدُمُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ مَا كَانَ يَكُونُ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرْحَةٌ وَلَا نَكْبَةٌ إِلَّا أَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَضَعَ عَلَيْهَا الْحِنَّاءَ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏إِنَّمَا نَعْرِفُهُ مِنْ حَدِيثِ فَائِدٍ، ‏‏‏‏‏‏وَرَوَى بَعْضُهُمْ هَذَا الْحَدِيثَ عَنْ فَائِدٍ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ عَنْ عُبَيْدِ اللَّهِ بْنِ عَلِيٍّ، ‏‏‏‏‏‏عَنْ جَدَّتِهِ سَلْمَى، ‏‏‏‏‏‏وَعُبَيْدُ اللَّهِ بْنُ عَلِيٍّ أَصَحُّ، ‏‏‏‏‏‏وَيُقَالُ:‏‏‏‏ سُلْمَى."
      },
      {
        "id": 17179,
        "hadith_number": "2055",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Larangan Rawatan dengan Kay (Pembakaran) dan Ruqyah yang Bercanggah dengan Tawakkal",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Aqar bin Al-Mughirah hin Shubah narrated from is father who said that the Messenger of Allah (s.a.w) said: Whoever seeks treatment by cauterization,or with Ruqyah, then he has absolved himself of At-Tawakkal (reliance upon Allah).",
        "malay_translation": "Aqar bin Al-Mughirah hin Shubah meriwayatkan daripada bapanya yang berkata bahawa Rasulullah (s.a.w) bersabda: Sesiapa yang mencari rawatan dengan kay (pembakaran), atau dengan Ruqyah, maka sesungguhnya dia telah melepaskan dirinya daripada At-Tawakkal (berserah diri kepada Allah).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنْ عَقَّارِ بْنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، عَنْ أَبِيهِ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنِ اكْتَوَى أَوِ اسْتَرْقَى فَقَدْ بَرِئَ مِنَ التَّوَكُّلِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَابِ عَنِ ابْنِ مَسْعُودٍ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَعِمْرَانَ بْنِ حُصَيْنٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17180,
        "hadith_number": "2056",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Ruqyah untuk Sengatan Kala Jengking, 'Ain dan An-Namlah",
        "perawi_melayu": "Anas",
        "english_text": "Anas narrated that : the Messenger of Allah (s.a.w) permitted Ruqyah for the scorpion sting, the(evil) eye, and An-Namlah.",
        "malay_translation": "Anas meriwayatkan bahawa: Rasulullah (s.a.w) membenarkan Ruqyah untuk sengatan kala jengking, 'ain (mata jahat), dan An-Namlah.",
        "arabic_text": "حَدَّثَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ الْخُزَاعِيُّ، حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، عَنْ سُفْيَانَ، عَنْ عَاصِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، عَنْ أَنَسٍ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ فِي الرُّقْيَةِ مِنَ الْحُمَةِ وَالْعَيْنِ وَالنَّمْلَةِ ."
      },
      {
        "id": 17181,
        "hadith_number": "2057",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Ruqyah yang Dibenarkan: Ain dan Sengatan Kala Jengking",
        "perawi_melayu": "Imran bin Husain",
        "english_text": "Imran bin Husain narrated that the Messenger of Allah (S.A.W) said: No Ruqyah except for the (evil) eye and the scorpion sting.",
        "malay_translation": "Imran bin Husain meriwayatkan bahawa Rasulullah (S.A.W) bersabda: Tidak ada Ruqyah kecuali untuk penyakit ain (mata jahat) dan sengatan kala jengking.",
        "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ حُصَيْنٍ، عَنِ الشَّعْبِيِّ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا رُقْيَةَ إِلَّا مِنْ عَيْنٍ أَوْ حُمَةٍ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَرَوَى شُعْبَةُ هَذَا الْحَدِيثَ عَنْ حُصَيْنٍ، عَنِ الشَّعْبِيِّ، عَنْ بُرَيْدَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏بِمِثْلِهِ."
      },
      {
        "id": 17182,
        "hadith_number": "2058",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Perlindungan Rasulullah ﷺ daripada Jin dan 'Ain",
        "perawi_melayu": "Abu Sa'eed",
        "english_text": "Abu Sa'eed narrated: The Messenger of Allah(S.A.W) would seek refuge from the jinn and the (evil) eye of humans, until Al-Mu'awwidhatain were revealed. So they were revealed he used them and left other than them.",
        "malay_translation": "Abu Sa'eed meriwayatkan: Rasulullah ﷺ selalu berlindung daripada jin dan 'ain (pandangan jahat) manusia, sehingga Al-Mu'awwidhatain diturunkan. Maka apabila ia diturunkan, baginda ﷺ menggunakannya dan meninggalkan yang lain.",
        "arabic_text": "حَدَّثَنَا هِشَامُ بْنُ يُونُسَ الْكُوفِيُّ، حَدَّثَنَا الْقَاسِمُ بْنُ مَالِكٍ الْمُزَنِيُّ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَعَوَّذُ مِنَ الْجَانِّ وَعَيْنِ الْإِنْسَانِ حَتَّى نَزَلَتِ الْمُعَوِّذَتَانِ، ‏‏‏‏‏‏فَلَمَّا نَزَلَتَا أَخَذَ بِهِمَا وَتَرَكَ مَا سِوَاهُمَا ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَابِ عَنْ أَنَسٍ وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ."
      },
      {
        "id": 17183,
        "hadith_number": "2059",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Ruqyah untuk Penyakit Mata dan Ain",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Asma' bint 'Umaish said: I said: 'O Messenger of Allah (S.A.W)! Some of Ja'far's children have suffered from an accelerated case of the inflammation of the eye, so should I have them treated with Ruqyah?' He said: 'Yes,for indeed if there was anything that could overcome the Decree, then the evil eye would overcome it.",
        "malay_translation": "Asma' bint 'Umaish berkata: Saya berkata: 'Wahai Rasulullah (S.A.W)! Beberapa orang anak Ja'far telah menderita penyakit radang mata yang cepat merebak, jadi bolehkah saya merawat mereka dengan Ruqyah?' Baginda bersabda: 'Ya, sesungguhnya jika ada sesuatu yang dapat mengatasi Takdir, maka penyakit 'ain (mata jahat) akan dapat mengatasinya.'",
        "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عُرْوَةَ وَهُوَ أَبُو حَاتِمْ بْنُ عَامِرٍ، عَنْ عُبَيْدِ بْنِ رِفَاعَةَ الزُّرَقِيِّ، أَنَّ أَسْمَاءَ بِنْتَ عُمَيْسٍ، قَالَتْ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏إِنَّ وَلَدَ جَعْفَرٍ تُسْرِعُ إِلَيْهِمُ الْعَيْنُ، ‏‏‏‏‏‏أَفَأَسْتَرْقِي لَهُمْ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏فَإِنَّهُ لَوْ كَانَ شَيْءٌ سَابَقَ الْقَدَرَ لَسَبَقَتْهُ الْعَيْنُ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَابِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، ‏‏‏‏‏‏وَبُرَيْدَةَ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدْ رُوِيَ هَذَا عَنْ أَيُّوبَ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ دِينَارٍ، ‏‏‏‏‏‏عَنْ عُرْوَةَ بْنِ عَامِرٍ، ‏‏‏‏‏‏عَنْ عُبَيْدِ بْنِ رِفَاعَةَ، ‏‏‏‏‏‏عَنْ أَسْمَاءَ بِنْتِ عُمَيْسٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 17184,
        "hadith_number": "2060",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Doa Perlindungan Rasulullah SAW untuk Al-Hasan dan Al-Husain",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Ibn 'Abbas narrated that the Messenger of Allah (S.A.W) used to seek refuge for Al-Hasan and Al-Husain saying: U'idhukuma bikalimatillahi-tammati,min kulli shaitanin wa hammatin, wa minkulli'ainin lammah (I seek refuge for the two of you in the Perfect Words of Allah, from every devil and every poisonous pest, and from every harmful eye). And he would say: It is with this that Ibrahim would seek refuge for Ishahaq and Ismail [peace be upon them].",
        "malay_translation": "Ibnu Abbas meriwayatkan bahawa Rasulullah SAW biasa memohon perlindungan untuk Al-Hasan dan Al-Husain dengan berkata: U'idhukuma bikalimatillahi-tammati,min kulli shaitanin wa hammatin, wa minkulli'ainin lammah (Aku memohon perlindungan untuk kamu berdua dengan Kalimah Allah yang sempurna, daripada setiap syaitan dan setiap makhluk beracun, dan daripada setiap mata yang berbahaya). Dan baginda bersabda: Dengan inilah Ibrahim memohon perlindungan untuk Ishak dan Ismail [alaihimussalam].",
        "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، وَيَعْلَى، عَنْ سُفْيَانَ، عَنْ مَنْصُورٍ، عَنْ الْمِنْهَالِ بْنِ عَمْرٍو، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَوِّذُ الْحَسَنَ وَالْحُسَيْنَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ أُعِيذُكُمَا بِكَلِمَاتِ اللَّهِ التَّامَّةِ، ‏‏‏‏‏‏مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ، ‏‏‏‏‏‏وَمِنْ كُلِّ عَيْنٍ لَامَّةٍ، ‏‏‏‏‏‏وَيَقُولُ:‏‏‏‏ هَكَذَا كَانَ إِبْرَاهِيمُ يُعَوِّذُ إِسْحَاق وَإِسْمَاعِيل عَلَيْهِمُ السَّلَام ."
      },
      {
        "id": 17185,
        "hadith_number": "2061",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Penafian Al-Ham dan Kebenaran 'Ain",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Hayyah bin Habis At-Tamimi narrated: My father narrated that he heard the Messenger of Allah (s.a.w) saying: There is nothing to Al-Ham, and the eye is real.",
        "malay_translation": "Hayyah bin Habis At-Tamimi meriwayatkan: Bapa saya meriwayatkan bahawa beliau mendengar Rasulullah SAW bersabda: Tidak ada (kepercayaan yang berasas) pada Al-Ham, dan 'ain itu benar (wujud).",
        "arabic_text": "حَدَّثَنَا أَبُو حَفْصٍ عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى بْنُ كَثِيرٍ أَبُو غَسَّانَ الْعَنْبَرِيُّ، حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، حَدَّثَنِي حَيَّةُ بْنُ حَابِسٍ التَّمِيمِيُّ، حَدَّثَنِي أَبِي، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ لَا شَيْءَ فِي الْهَامِ وَالْعَيْنُ حَقٌّ ."
      },
      {
        "id": 17186,
        "hadith_number": "2062",
        "status": "Sahih",
        "nama_buku": "Jami' At-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Pengaruh 'Ain dan Anjuran Berwuduk Kerananya",
        "perawi_melayu": "Tidak disebutkan",
        "english_text": "Ibn 'Abbas narrated that the Messenger of Allah (s.a.w) said: If there was anything that could overcome the Decree then the (evil) eye would overcome it, and when you are requested to wash (due to it) then wash.",
        "malay_translation": "Daripada Ibn 'Abbas meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Sekiranya ada sesuatu yang dapat mengatasi Takdir, nescaya 'ain (mata jahat) akan mengatasinya, dan apabila kamu diminta untuk berwuduk (kerananya), maka berwuduklah.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ الْحَسَنِ بْنِ خِرَاشٍ الْبَغْدَادِيُّ، حَدَّثَنَا أَحْمَدُ بْنُ إِسْحَاق الْحَضْرَمِيُّ، حَدَّثَنَا وُهَيْبٌ، عَنْ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَوْ كَانَ شَيْءٌ سَابَقَ الْقَدَرَ لَسَبَقَتْهُ الْعَيْنُ، ‏‏‏‏‏‏وَإِذَا اسْتُغْسِلْتُمْ فَاغْسِلُوا ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ، ‏‏‏‏‏‏وَحَدِيثُ حَيَّةَ بْنِ حَابِسٍ حَدِيثٌ غَرِيبٌ، ‏‏‏‏‏‏وَرَوَى شَيْبَانُ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، ‏‏‏‏‏‏عَنْ حَيَّةَ بْنِ حَابِسٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَعَلِيُّ بْنُ الْمُبَارَكِ، ‏‏‏‏‏‏وَحَرْبُ بْنُ شَدَّادٍ، ‏‏‏‏‏‏لَا يَذْكُرَانِ فِيهِ عَنْ أَبِي هُرَيْرَةَ."
      },
      {
        "id": 17187,
        "hadith_number": "2063",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Ruqyah untuk Sengatan Kala Jengking dan Kebenarannya",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Abu Sa'eed narrated: The Messenger of Allah (s.a.w) dispatched us on a military expedition. We camped with some people and asked them to entertain us but they did not entertain us. Their leader was stung so they came to us saying: 'Is there anyone among you who can treat a scorpion sting with Ruqyah?' I said: 'Yes I can. But I will not do any Ruqyah until you give us some sheep.' They said: 'Then we shall give you thirty sheep.' We accepted that,and I recited Al-Hamda [Lillah] seven times. He became better and we took the sheep. He said: We became concerned about that being permissible and said: 'Do not be hasty until we reach the Messenger of Allah (S.A.W). He said: When we arrived with him I mentioned what I did to him. He(S.A.W)said: 'How did you know that it was a Ruqyah? Take the sheep, and assign me a share among you.'",
        "malay_translation": "Abu Sa'eed meriwayatkan: Rasulullah (s.a.w) mengutuskan kami dalam ekspedisi ketenteraan. Kami berkhemah dengan beberapa orang dan meminta mereka untuk menjamu kami tetapi mereka tidak menjamu kami. Ketua mereka disengat [kala jengking] lalu mereka datang kepada kami berkata: 'Adakah sesiapa di antara kamu yang boleh merawat sengatan kala jengking dengan Ruqyah?' Saya berkata: 'Ya, saya boleh. Tetapi saya tidak akan melakukan Ruqyah sehingga kamu memberi kami beberapa ekor kambing.' Mereka berkata: 'Kalau begitu kami akan memberi kamu tiga puluh ekor kambing.' Kami menerimanya, dan saya membaca Al-Hamda [Lillah] sebanyak tujuh kali. Dia menjadi lebih baik dan kami mengambil kambing-kambing itu. Dia berkata: Kami menjadi bimbang tentang kebenaran perkara itu dan berkata: 'Jangan tergesa-gesa sehingga kita sampai kepada Rasulullah (S.A.W). Dia berkata: Apabila kami tiba bersama baginda, saya menyebutkan apa yang saya lakukan kepadanya. Baginda (S.A.W) bersabda: 'Bagaimana kamu tahu bahawa itu adalah Ruqyah? Ambil kambing-kambing itu, dan tetapkan bahagian untukku bersama kamu.'",
        "arabic_text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ الْأَعْمَشِ، عَنْ جَعْفَرِ بْنِ إِيَاسٍ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ:‏‏‏‏ بَعَثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَرِيَّةٍ فَنَزَلْنَا بِقَوْمٍ، ‏‏‏‏‏‏فَسَأَلْنَاهُمُ الْقِرَى فَلَمْ يَقْرُونَا، ‏‏‏‏‏‏فَلُدِغَ سَيِّدُهُمْ فَأَتَوْنَا، ‏‏‏‏‏‏فَقَالُوا:‏‏‏‏ هَلْ فِيكُمْ مَنْ يَرْقِي مِنَ الْعَقْرَبِ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ نَعَمْ أَنَا، ‏‏‏‏‏‏وَلَكِنْ لَا أَرْقِيهِ حَتَّى تُعْطُونَا غَنَمًا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَإِنَّا نُعْطِيكُمْ ثَلَاثِينَ شَاةً، ‏‏‏‏‏‏فَقَبِلْنَا، ‏‏‏‏‏‏فَقَرَأْتُ عَلَيْهِ الْحَمْدُ لِلَّهِ سَبْعَ مَرَّاتٍ فَبَرَأَ، ‏‏‏‏‏‏وَقَبَضْنَا الْغَنَمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَعَرَضَ فِي أَنْفُسِنَا مِنْهَا شَيْءٌ، ‏‏‏‏‏‏فَقُلْنَا:‏‏‏‏ لَا تَعْجَلُوا حَتَّى تَأْتُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَلَمَّا قَدِمْنَا عَلَيْهِ ذَكَرْتُ لَهُ الَّذِي صَنَعْتُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَمَا عَلِمْتَ أَنَّهَا رُقْيَةٌ، ‏‏‏‏‏‏اقْبِضُوا الْغَنَمَ وَاضْرِبُوا لِي مَعَكُمْ بِسَهْمٍ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ، ‏‏‏‏‏‏وَأَبُو نَضْرَةَ اسْمُهُ الْمُنْذِرُ بْنُ مَالِكِ بْنِ قُطَعَةَ، ‏‏‏‏‏‏وَرَخَّصَ الشَّافِعِيُّ لِلْمُعَلِّمِ أَنْ يَأْخُذَ عَلَى تَعْلِيمِ الْقُرْآنِ أَجْرًا، ‏‏‏‏‏‏وَيَرَى لَهُ أَنْ يَشْتَرِطَ عَلَى ذَلِكَ، ‏‏‏‏‏‏وَاحْتَجَّ بِهَذَا الْحَدِيثِ، ‏‏‏‏‏‏وَجَعْفَرُ بْنُ إِيَاسٍ هُوَ جَعْفَرُ بْنُ أَبِي وَحْشِيَّةَ، ‏‏‏‏‏‏وَهُوَ أَبُو بِشْرٍ، ‏‏‏‏‏‏وَرَوَى شُعْبَةُ، ‏‏‏‏‏‏وَأَبُو عَوَانَةَ، ‏‏‏‏‏‏وَغَيْرُ وَاحِدٍ، ‏‏‏‏‏‏عَنْ أَبِي بِشْرٍ هَذَا الْحَدِيثَ، ‏‏‏‏‏‏عَنْ أَبِي الْمُتَوَكِّلِ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 17188,
        "hadith_number": "2064",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Ruqyah dengan Surah Al-Fatihah dan Kebenaran Mengambil Upah",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Abu Sa'eed Al Khudri narrated: Some of the Companions of the Messenger of Allah (S.A.W) came across a tribe of Bedouins that did not entertain them,nor behave hospitality with them. Their leader became ill, and they came to us saying: 'Do you have any medicine?'We said: ' Yes. But you did not entertain us nor have us as guests so we will not do anything until you give us something.' Then they gave sheep for that. He said: 'So a man from us began reciting the Opening of the Book (Surat Al-Fatihah) and he was cured. So when we came to the Messenger of Allah (S.A.W) we mentioned to him, He said: 'How did you know it was Ruqyah?' And he did not mention any prohibition against it,and he said: 'Eat , and assign me a share among you from them (Sheep).'",
        "malay_translation": "Abu Sa'eed Al Khudri meriwayatkan: Beberapa orang Sahabat Rasulullah (S.A.W) bertemu dengan sebuah suku Badwi yang tidak menjamu mereka, dan tidak bersikap ramah kepada mereka. Ketua suku mereka jatuh sakit, dan mereka datang kepada kami berkata: 'Adakah kamu mempunyai ubat?' Kami berkata: 'Ya. Tetapi kamu tidak menjamu kami dan tidak menerima kami sebagai tetamu jadi kami tidak akan melakukan apa-apa sehingga kamu memberi kami sesuatu.' Kemudian mereka memberi kambing untuk itu. Baginda bersabda: 'Maka seorang lelaki dari kalangan kami mula membaca Pembukaan Kitab (Surah Al-Fatihah) dan dia sembuh. Maka apabila kami datang kepada Rasulullah (S.A.W) kami menyebutkan kepadanya, Baginda bersabda: 'Bagaimana kamu tahu itu adalah Ruqyah?' Dan Baginda tidak menyebutkan sebarang larangan terhadapnya, dan Baginda bersabda: 'Makanlah, dan tetapkan untukku bahagian di antara kamu daripada mereka (Kambing).'",
        "arabic_text": "حَدَّثَنَا أَبُو مُوسَى مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا أَبُو بِشْرٍ، قَال:‏‏‏‏ سَمِعْتُ أَبَا الْمُتَوَكِّلِ يُحَدِّثُ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ، أَنَّ نَاسًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرُّوا بِحَيٍّ مِنَ الْعَرَبِ، ‏‏‏‏‏‏فَلَمْ يَقْرُوهُمْ وَلَمْ يُضَيِّفُوهُمْ، ‏‏‏‏‏‏فَاشْتَكَى سَيِّدُهُمْ فَأَتَوْنَا، ‏‏‏‏‏‏فَقَالُوا:‏‏‏‏ هَلْ عِنْدَكُمْ دَوَاءٌ:‏‏‏‏ قُلْنَا:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏وَلَكِنْ لَمْ تَقْرُونَا وَلَمْ تُضَيِّفُونَا، ‏‏‏‏‏‏فَلَا نَفْعَلُ حَتَّى تَجْعَلُوا لَنَا جُعْلًا، ‏‏‏‏‏‏فَجَعَلُوا عَلَى ذَلِكَ قَطِيعًا مِنَ الْغَنَمِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَجَعَلَ رَجُلٌ مِنَّا يَقْرَأُ عَلَيْهِ بِفَاتِحَةِ الْكِتَابِ فَبَرَأَ، ‏‏‏‏‏‏فَلَمَّا أَتَيْنَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرْنَا ذَلِكَ لَهُ قَالَ:‏‏‏‏ وَمَا يُدْرِيكَ أَنَّهَا رُقْيَةٌ ، ‏‏‏‏‏‏وَلَمْ يَذْكُرْ نَهْيًا مِنْهُ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ كُلُوا وَاضْرِبُوا لِي مَعَكُمْ بِسَهْمٍ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ صَحِيحٌ، ‏‏‏‏‏‏وَهَذَا أَصَحُّ مِنْ حَدِيثِ الْأَعْمَشِ، ‏‏‏‏‏‏عَنْ جَعْفَرِ بْنِ إِيَاسٍ، ‏‏‏‏‏‏وَهَكَذَا رَوَى غَيْرُ وَاحِدٍ هَذَا الْحَدِيثَ، ‏‏‏‏‏‏عَنْ أَبِي بِشْرٍ جَعْفَرِ بْنِ أَبِي وَحْشِيَّةَ، ‏‏‏‏‏‏عَنْ أَبِي الْمُتَوَكِّلِ، ‏‏‏‏‏‏عَنْ أَبِي سَعِيدٍ، ‏‏‏‏‏‏وَجَعْفَرُ بْنُ إِيَاسٍ هُوَ جَعْفَرُ بْنُ أَبِي وَحْشِيَّةَ."
      },
      {
        "id": 17189,
        "hadith_number": "2065",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Ruqyah dan Rawatan adalah dari Takdir Allah",
        "perawi_melayu": "Abu Khizamah dari bapanya",
        "english_text": "Abu Khizamah narrated from his father who said: I asked the Messenger of Allah (S.A.W): 'O Messenger of Allah(S.A.W)! Do you think that the Ruqyah we use, the treatments we use, and what we seek to protect ourselves will contradict anything from Allah's Decree?' He said: 'They are from Allah's Decree.'",
        "malay_translation": "Abu Khizamah meriwayatkan daripada bapanya yang berkata: Aku bertanya kepada Rasulullah (S.A.W): 'Wahai Rasulullah (S.A.W)! Adakah engkau berpendapat bahawa Ruqyah yang kami gunakan, rawatan yang kami gunakan, dan apa yang kami cari untuk melindungi diri kami akan bercanggah dengan apa-apa dari Takdir Allah?' Baginda bersabda: 'Ia adalah dari Takdir Allah.'",
        "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي خُزَامَةَ، عَنْ أَبِيهِ، قَالَ:‏‏‏‏ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏أَرَأَيْتَ رُقًى نَسْتَرْقِيهَا وَدَوَاءً نَتَدَاوَى بِهِ وَتُقَاةً نَتَّقِيهَا:‏‏‏‏ هَلْ تَرُدُّ مِنْ قَدَرِ اللَّهِ شَيْئًا ؟ قَالَ:‏‏‏‏ هِيَ مِنْ قَدَرِ اللَّهِ ! ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏"
      },
      {
        "id": 17190,
        "hadith_number": "2066",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keutamaan Kurma 'Ajwah dan Cendawan Kemeja",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Abu Hurairah narrated that the Messenger of Allah (S.A.W) said: Al-'Ajwah is from Paradise and it contains a cure for poison. Truffles are a form of manna, and its liquid is a cure for the eye.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah (S.A.W) bersabda: Al-'Ajwah adalah dari Syurga dan ia mengandungi penawar bagi racun. Cendawan kemeja adalah sejenis manna, dan cecairnya adalah penawar bagi mata.",
        "arabic_text": "حَدَّثَنَا أَبُو عُبَيْدَةَ بْنُ أَبِي السَّفَرِ أَحْمَدُ بْنُ عَبْدِ اللَّهِ الْهَمْدَانِيُّ وَهُوَ ابْنُ أَبِي السَّفَرِ، وَمَحْمُودُ بْنُ غَيْلَانَ، قَالَا:‏‏‏‏ حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ، عَنْ مُحَمَّدِ بْنِ أَبِي عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْعَجْوَةُ مِنَ الْجَنَّةِ، ‏‏‏‏‏‏وَفِيهَا شِفَاءٌ مِنَ السُّمِّ، ‏‏‏‏‏‏وَالْكَمْأَةُ مِنَ الْمَنِّ، ‏‏‏‏‏‏وَمَاؤُهَا شِفَاءٌ لِلْعَيْنِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَابِ عَنْ سَعِيدِ بْنِ زَيْدٍ، ‏‏‏‏‏‏وَأَبِي سَعِيدٍ، ‏‏‏‏‏‏وَجَابِرٍ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَهُوَ مِنْ حَدِيثِ مُحَمَّدِ بْنِ عَمْرٍو، ‏‏‏‏‏‏وَلَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ سَعِيدِ بْنِ عَامِرٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ عَمْرٍو."
      },
      {
        "id": 17191,
        "hadith_number": "2067",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Cendawan Truffle: Manna dan Penawar Mata",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Sa'eed bin Zaid narrated that the Prophet (S.A.W) said: Truffles are a form of manna, and its liquid is a cure for the eye.",
        "malay_translation": "Sa'eed bin Zaid meriwayatkan bahawa Nabi (S.A.W) bersabda: Cendawan truffle adalah sejenis manna, dan cecairnya adalah penawar bagi mata.",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا عُمَرُ بْنُ عُبَيْدٍ الطَّنَافِسِيُّ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ. ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ عَمْرِو بْنِ حُرَيْثٍ، عَنْ سَعِيدِ بْنِ زَيْدٍ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ الْكَمْأَةُ مِنَ الْمَنِّ وَمَاؤُهَا شِفَاءٌ لِلْعَيْنِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17192,
        "hadith_number": "2068",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Khasiat Cendawan Truffle dan Kurma Al-'Ajwah",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Abu Hurairah narrated that people among the Companions of the Prophet (S.A.W) would say: Truffles are the earth's smallpox. So the Messenger of Allah (S.A.W) said: Truffles are a form of manna, and its liquid is a cure for the eye. Al-'Ajwah is from Paradise, and it contains a cure for poison.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa orang dalam kalangan Sahabat Nabi (S.A.W) pernah berkata: Cendawan truffle adalah penyakit cacar bumi. Maka Rasulullah (S.A.W) bersabda: Cendawan truffle adalah sejenis manna, dan cecairnya adalah penawar untuk mata. Al-'Ajwah adalah dari Syurga, dan ia mengandungi penawar racun.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنَا أَبِي، عَنْ قَتَادَةَ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ نَاسًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالُوا:‏‏‏‏ الْكَمْأَةُ جُدَرِيُّ الْأَرْضِ، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْكَمْأَةُ مِنَ الْمَنِّ، ‏‏‏‏‏‏وَمَاؤُهَا شِفَاءٌ لِلْعَيْنِ، ‏‏‏‏‏‏وَالْعَجْوَةُ مِنَ الْجَنَّةِ، ‏‏‏‏‏‏وَهِيَ شِفَاءٌ مِنَ السُّمِّ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ."
      },
      {
        "id": 17193,
        "hadith_number": "2069",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Kisah Abu Hurairah Menggunakan Cecair Truffle untuk Mengubati Mata Seorang Hamba Perempuan",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Qatadah said: It was narrated to me that Abu Hurairah said: 'I took three truffles, or five, or seven, and pressed them. Then I put their liquid in a bottle, and I liquid the eyes of a slave girl of mine with it and she was cured.'",
        "malay_translation": "Qatadah berkata: Telah diriwayatkan kepada saya bahawa Abu Hurairah berkata: 'Saya mengambil tiga truffle, atau lima, atau tujuh, dan memerahnya. Kemudian saya meletakkan cecairnya di dalam botol, dan saya menuangkan cecair itu ke mata seorang hamba perempuan saya dengannya dan dia sembuh.'",
        "arabic_text": "حَدَّثَنَا حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُعَاذ، حَدَّثَنَا أَبِي، عَنْ قَتَادَةَ، قَالَ:‏‏‏‏ حُدِّثْتُ، ‏‏‏‏‏‏أَنَّ أَبَا هُرَيْرَةَ، قَالَ:‏‏‏‏ أَخَذْتُ ثَلَاثَةَ أَكْمُؤٍ، ‏‏‏‏‏‏أَوْ خَمْسًا أَوْ سَبْعًا فَعَصَرْتُهُنَّ فَجَعَلْتُ مَاءَهُنَّ فِي قَارُورَةٍ فَكَحَلْتُ بِهِ جَارِيَةً لِي فَبَرَأَتْ ."
      },
      {
        "id": 17194,
        "hadith_number": "2070",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Khasiat Ash-Shuniz (Habbatussauda)",
        "perawi_melayu": "Qatadah meriwayatkan bahawa Abu Hurairah berkata",
        "english_text": "Qatadah said: It was narrated to me that Abu Hurairah said:'Ash-Shuniz is a cure for every disease except As-Sam.' Qatadah said: One takes twenty-one seeds daily, and puts them in a cloth, then infuses (water) and sniffs two drops in his right nostril, and one drop in the left. The second (day) two drops are sniffed in the left, and one drop in the right. The third (day) two drops in the right and one drop in the left.",
        "malay_translation": "Qatadah berkata: Telah diriwayatkan kepada saya bahawa Abu Hurairah berkata: 'Ash-Shuniz (Habbatussauda) adalah ubat bagi setiap penyakit kecuali As-Sam.' Qatadah berkata: Seseorang mengambil dua puluh satu biji setiap hari, dan meletakkannya di dalam kain, kemudian merendamnya (dalam air) dan menghidu dua titis di lubang hidung kanannya, dan satu titis di sebelah kiri. Pada hari kedua, dua titis dihirup di sebelah kiri, dan satu titis di sebelah kanan. Pada hari ketiga, dua titis di sebelah kanan dan satu titis di sebelah kiri.",
        "arabic_text": "حَدَّثَنَا حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُعَاذٌ بْنِ هِشَامٍ، حَدَّثَنَا أَبِي، عَنْ قَتَادَةَ، قَالَ:‏‏‏‏ حُدِّثْتُ، ‏‏‏‏‏‏أَنَّ أَبَا هُرَيْرَةَ، قَالَ:‏‏‏‏ الشُّونِيزُ دَوَاءٌ مِنْ كُلِّ دَاءٍ إِلَّا السَّامَ ، ‏‏‏‏‏‏قَالَ قَتَادَةُ:‏‏‏‏ يَأْخُذُ كُلَّ يَوْمٍ إِحْدَى وَعِشْرِينَ حَبَّةً فَيَجْعَلُهُنَّ فِي خِرْقَةٍ فَلْيَنْقَعْهُ فَيَتَسَعَّطُ بِهِ كُلَّ يَوْمٍ فِي مَنْخَرِهِ الْأَيْمَنِ قَطْرَتَيْنِ، ‏‏‏‏‏‏وَفِي الْأَيْسَرِ قَطْرَةً، ‏‏‏‏‏‏وَالثَّانِي:‏‏‏‏ فِي الْأَيْسَرِ قَطْرَتَيْنِ، ‏‏‏‏‏‏وَفِي الْأَيْمَنِ قَطْرَةً، ‏‏‏‏‏‏وَالثَّالِثُ:‏‏‏‏ فِي الْأَيْمَنِ قَطْرَتَيْنِ، ‏‏‏‏‏‏وَفِي الْأَيْسَرِ قَطْرَةً."
      },
      {
        "id": 17195,
        "hadith_number": "2071",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Larangan Harga Anjing, Pendapatan Zina, dan Bayaran Tukang Tilik",
        "perawi_melayu": "Abu Mas'ud Al-Ansari",
        "english_text": "Abu Masud Al-Ansari narrated: The Messenger of Allah (S.A.W) prohibited the price of a dog,the earnings of a fornicator (from fornication), and the payment made to the fortune-teller.",
        "malay_translation": "Daripada Abu Mas'ud Al-Ansari meriwayatkan: Rasulullah (S.A.W) melarang harga seekor anjing, pendapatan seorang penzina (dari perbuatan zina), dan bayaran yang diberikan kepada tukang tilik.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ، قَالَ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ثَمَنِ الْكَلْبِ، ‏‏‏‏‏‏وَمَهْرِ الْبَغِيِّ، ‏‏‏‏‏‏وَحُلْوَانِ الْكَاهِنِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17196,
        "hadith_number": "2072",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Larangan Menggantung Tangkal",
        "perawi_melayu": "Eisa Ibn 'Abdur-Raman bin Abi Laila",
        "english_text": "'Eisa Ibn 'Abdur-Raman bin Abi Laila said: I entered upon 'Abdullah bin 'Ukaim Abu Mabad Al-Juhani to visit him, while he had Humrah. I said:'Why don't you hang something?' He said: 'Death is better than that. The Prophet (S.A.W) said: Whoever hangs something, he is entrusted to it.",
        "malay_translation": "'Eisa Ibn 'Abdur-Raman bin Abi Laila berkata: Aku masuk menemui 'Abdullah bin 'Ukaim Abu Mabad Al-Juhani untuk menziarahinya, ketika dia menghidap penyakit Humrah. Aku berkata: 'Mengapa kamu tidak menggantungkan sesuatu?' Dia berkata: 'Kematian lebih baik daripada itu. Nabi (SAW) bersabda: Sesiapa yang menggantungkan sesuatu, dia akan dipertanggungjawabkan kepadanya.'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مَدُّوَيْهِ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ عِيسَى أَخِيهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ دَخَلْتُ عَلَى عَبْدِ اللَّهِ بْنِ عُكَيْمٍ أَبِي مَعْبَدِ الْجُهَنِيِّ أَعُودُهُ وَبِهِ حُمْرَةٌ، ‏‏‏‏‏‏فَقُلْنَا:‏‏‏‏ أَلَا تُعَلِّقُ شَيْئًا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ الْمَوْتُ أَقْرَبُ مِنْ ذَلِكَ، ‏‏‏‏‏‏قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ تَعَلَّقَ شَيْئًا وُكِلَ إِلَيْهِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَحَدِيثُ عَبْدِ اللَّهِ بْنِ عُكَيْمٍ إِنَّمَا نَعْرِفُهُ مِنْ حَدِيثِ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، ‏‏‏‏‏‏وَعَبْدُ اللَّهِ بْنُ عُكَيْمٍ لَمْ يَسْمَعْ مِنَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَكَانَ فِي زَمَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ كَتَبَ إِلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏"
      },
      {
        "id": 17197,
        "hadith_number": "2073",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Demam Berasal dari Kepanasan Api Neraka dan Cara Menyejukkannya",
        "perawi_melayu": "Rafi' bin Khadij",
        "english_text": "Rafi' bin Khadij narrated that the Prophet (S.A.W) said: Fever is from the agitation of the Fire, so cool it with water.",
        "malay_translation": "Rafi' bin Khadij meriwayatkan bahawa Nabi (S.A.W) bersabda: Demam adalah dari kepanasan Api Neraka, maka sejukkan ia dengan air.",
        "arabic_text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو الْأَحْوَصِ، عَنْ سَعِيدِ بْنِ مَسْرُوقٍ، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ، عَنْ جَدِّهِ رَافِعِ بْنِ خَدِيجٍ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ الْحُمَّى فَوْرٌ مِنَ النَّارِ فَأَبْرِدُوهَا بِالْمَاءِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَابِ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، ‏‏‏‏‏‏وَابْنِ عُمَرَ، ‏‏‏‏‏‏وَامْرَأَةِ الزُّبَيْرِ، ‏‏‏‏‏‏وَعَائِشَةَ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ."
      },
      {
        "id": 17198,
        "hadith_number": "2074",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Demam Adalah dari Kepanasan Neraka dan Penawarannya",
        "perawi_melayu": "Aisyah",
        "english_text": "Aishah narrated that the Messenger of Allah (S.A.W) said: Fever is from the heat of the Hell, so cool it with water.",
        "malay_translation": "Aisyah meriwayatkan bahawa Rasulullah (S.A.W) bersabda: Demam adalah dari kepanasan Neraka, maka sejukkan ia dengan air.",
        "arabic_text": "حَدَّثَنَا هَارُونُ بْنُ إِسْحَاق الْهَمْدَانِيُّ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِنَّ الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ فَأَبْرِدُوهَا بِالْمَاءِ ."
      },
      {
        "id": 17199,
        "hadith_number": "2075",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Doa untuk Demam dan Kesakitan",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Ibn 'Abbas narrated: For fever, and all pains, the Prophet (S.A.W) would teach them to say: Bismillahil-Kabir; a'udhu billahil-'Azimi min sharri kulli 'irqin na'arin, wa min sharri harrin-nar. (In the name of Allah the great, I seek refuge with Allah he magnificent of the evil of every gushing vein, and from the evil of the heat of the Fire)",
        "malay_translation": "Daripada Ibn 'Abbas meriwayatkan: Untuk demam, dan semua kesakitan, Nabi (S.A.W) akan mengajar mereka untuk berkata: Bismillahil-Kabir; a'udhu billahil-'Azimi min sharri kulli 'irqin na'arin, wa min sharri harrin-nar. (Dengan nama Allah Yang Maha Besar; aku berlindung dengan Allah Yang Maha Agung daripada kejahatan setiap urat yang memancar, dan daripada kejahatan panasnya api neraka).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ إِسْمَاعِيل بْنِ أَبِي حَبِيبَةَ، عَنْ دَاوُدَ بْنِ حُصَيْنٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُعَلِّمُهُمْ مِنَ الْحُمَّى وَمِنَ الْأَوْجَاعِ كُلِّهَا أَنْ يَقُولَ:‏‏‏‏ بِسْمِ اللَّهِ الْكَبِيرِ، ‏‏‏‏‏‏أَعُوذُ بِاللَّهِ الْعَظِيمِ مِنْ شَرِّ كُلِّ عِرْقٍ نَعَّارٍ، ‏‏‏‏‏‏وَمِنْ شَرِّ حَرِّ النَّارِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ إِبْرَاهِيمَ بْنِ إِسْمَاعِيل بْنِ أَبِي حَبِيبَةَ، ‏‏‏‏‏‏وَإِبْرَاهِيمُ يُضَعَّفُ فِي الْحَدِيثِ، ‏‏‏‏‏‏وَيُرْوَى:‏‏‏‏ عِرْقٌ يَعَّارٌ."
      },
      {
        "id": 17200,
        "hadith_number": "2076",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Nabi SAW Hampir Melarang Al-Ghilah Tetapi Tidak Jadi Kerana Amalan Orang Parsi dan Rom",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Aishah narrated from Wahb's daughter - and she is Judamah - who said: I heard the Messenger of Allah (S.A.W) saying: 'I wanted to prohibit Al-Ghilah, but the Persians and Romans did it, and they did not kill their children.'",
        "malay_translation": "Aisyah meriwayatkan daripada anak perempuan Wahb - dan beliau adalah Judamah - yang berkata: Aku mendengar Rasulullah (SAW) bersabda: 'Aku ingin melarang Al-Ghilah, tetapi orang-orang Parsi dan Rom melakukannya, dan mereka tidak membunuh anak-anak mereka.'",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا يَحْيَى بْنُ إِسْحَاق، حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، عَنِ ابْنَةِ وَهْبٍ وَهِيَ جُدَامَةُ، قَالَتْ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ أَرَدْتُ أَنْ أَنْهَى عَنِ الْغِيَالِ، ‏‏‏‏‏‏فَإِذَا فَارِسُ وَالرُّومُ يَفْعَلُونَ وَلَا يَقْتُلُونَ أَوْلَادَهُمْ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَابِ عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدْ رَوَاهُ مَالِكٌ، ‏‏‏‏‏‏عَنْ أَبِي الْأَسْوَدِ، ‏‏‏‏‏‏عَنْ عُرْوَةَ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏عَنْ جُدَامَةَ بِنْتِ وَهْبٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ مَالِكٌ:‏‏‏‏ وَالْغِيَالُ أَنْ يَطَأَ الرَّجُلُ امْرَأَتَهُ وَهِيَ تُرْضِعُ."
      },
      {
        "id": 17201,
        "hadith_number": "2077",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Niat Rasulullah Melarang Al-Ghilah dan Sebab Pembatalannya",
        "perawi_melayu": "Aisyah dan Judamah binti Wahb Al-Asadiyyah",
        "english_text": "Aishah narrated from Judamah bint Wahb Al-Asadiyyah that she heard the Messenger of Allah (S.A.W) saying: I intended to prohibit Al-Ghilah until I remembered that the Persians and Romans do that, without any harm to their children.",
        "malay_translation": "Aisyah meriwayatkan daripada Judamah binti Wahb Al-Asadiyyah bahawa beliau mendengar Rasulullah (S.A.W) bersabda: 'Aku pada asalnya berniat untuk melarang Al-Ghilah sehingga aku teringat bahawa orang Parsi dan Rom melakukan perkara itu, tanpa sebarang mudarat kepada anak-anak mereka.'",
        "arabic_text": "حَدَّثَنَا عِيسَى بْنُ أَحْمَدَ، حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الْأَسْوَدِ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، عَنْ جُدَامَةَ بِنْتِ وَهْبٍ الْأَسَدِيَّةِ، أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ لَقَدْ هَمَمْتُ أَنْ أَنْهَى عَنِ الْغِيلَةِ حَتَّى ذَكَرْتُ أَنَّ الرُّومَ وَفَارِسَ يَصْنَعُونَ ذَلِكَ فَلَا يَضُرُّ أَوْلَادَهُمْ ، ‏‏‏‏‏‏قَالَ مَالِكٌ:‏‏‏‏ وَالْغِيلَةُ، ‏‏‏‏‏‏أَنْ يَمَسَّ الرَّجُلُ امْرَأَتَهُ وَهِيَ تُرْضِعُ، ‏‏‏‏‏‏قَالَ عِيسَى بْنُ أَحْمَدَ:‏‏‏‏ وَحَدَّثَنَا إِسْحَاق بْنُ عِيسَى، حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الْأَسْوَدِ، نَحْوَهُ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ."
      },
      {
        "id": 17202,
        "hadith_number": "2078",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Khasiat Minyak dan Wars untuk Pleurisy",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Qatadah narrated from Abu 'Abdullah that Zaid bin Arqam said: The Prophet (S.A.W) would acclaim oil and Wars for (the treatment of) pleurisy. Qatadah said: And it is put in the mouth on the side which he is suffering.",
        "malay_translation": "Qatadah meriwayatkan daripada Abu 'Abdullah bahawa Zaid bin Arqam berkata: Nabi (SAW) menggalakkan penggunaan minyak dan Wars untuk (rawatan) penyakit pleurisy. Qatadah berkata: Dan ia diletakkan di dalam mulut pada bahagian yang sakit.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ أَبِي عَبْدِ اللَّهِ، عَنْ زَيْدِ بْنِ أَرْقَمَ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَنْعَتُ الزَّيْتَ وَالْوَرْسَ مِنْ ذَاتِ الْجَنْبِ ، ‏‏‏‏‏‏قَالَ قَتَادَةُ:‏‏‏‏ وَيَلُدُّهُ مِنَ الْجَانِبِ الَّذِي يَشْتَكِيهِ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَأَبُو عَبْدِ اللَّهِ اسْمُهُ مَيْمُونٌ هُوَ شَيْخٌ بَصْرِيٌّ."
      },
      {
        "id": 17203,
        "hadith_number": "2079",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Perintah Menggunakan Qust Al-Bahri dan Minyak untuk Merawat Pleurisy",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Maimun Abu' Abdullah said: I heard Zaid bin Arqam say: 'The Messenger of Allah (S.A.W) ordered us to use Qust Al-Bahri and oil to treat Pleurisy.'",
        "malay_translation": "Maimun Abu' Abdullah berkata: Saya mendengar Zaid bin Arqam berkata: 'Rasulullah (S.A.W) memerintahkan kami untuk menggunakan Qust Al-Bahri dan minyak untuk merawat penyakit Pleurisy.'",
        "arabic_text": "حَدَّثَنَا رَجَاءُ بْنُ مُحَمَّدٍ الْعُذْرِيُّ الْبَصْرِيُّ، حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدِ بْنِ أَبِي رَزِينٍ، حَدَّثَنَا شُعْبَةُ، عَنْ خَالِدٍ الْحَذَّاءِ، حَدَّثَنَا مَيْمُونٌ أَبُو عَبْدِ اللَّهِ، قَال:‏‏‏‏ سَمِعْتُ زَيْدَ بْنَ أَرْقَمَ، قَالَ:‏‏‏‏ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَتَدَاوَى مِنْ ذَاتِ الْجَنْبِ بِالْقُسْطِ الْبَحْرِيِّ وَالزَّيْتِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ مَيْمُونٍ، ‏‏‏‏‏‏عَنْ زَيْدِ بْنِ أَرْقَمَ، ‏‏‏‏‏‏وَقَدْ رَوَى عَنْ مَيْمُونٍ غَيْرُ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ هَذَا الْحَدِيثَ، ‏‏‏‏‏‏وَذَاتُ الْجَنْبِ يَعْنِي السِّلَّ."
      },
      {
        "id": 17204,
        "hadith_number": "2080",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Berlindung kepada Allah dari Kesakitan",
        "perawi_melayu": "Tidak Dinyatakan",
        "english_text": "Uthman bin Abi Al-'As narrated: The Messenger of Allah (S.A.W) came to me while I had a pain that almost ruined me. So,the Messenger of Allah (S.A.W) said: 'Rub it with your right hand seven times and say A`udhu bi `Izzatillah Wa Qudratihi wa Sultanihi min sharri ma ajid. ( I seek refuge in Allah's might, power, an authority, from the evil of what I suffer.) He said: So I did it, and Allah removed what I had, and I never ceased telling my family and others to do it.",
        "malay_translation": "Uthman bin Abi Al-'As meriwayatkan: Rasulullah (S.A.W) datang kepada saya ketika saya mengalami kesakitan yang hampir membinasakan saya. Maka, Rasulullah (S.A.W) bersabda: 'Sapulah dengan tangan kananmu sebanyak tujuh kali dan katakanlah A`udhu bi `Izzatillah Wa Qudratihi wa Sultanihi min sharri ma ajid. (Aku berlindung dengan keagungan Allah, kekuasaan-Nya, dan kerajaan-Nya dari kejahatan apa yang aku derita.)' Beliau berkata: Maka saya melakukannya, dan Allah menghilangkan apa yang saya alami, dan saya tidak pernah berhenti memberitahu keluarga saya dan orang lain untuk melakukannya.",
        "arabic_text": "حَدَّثَنَا إِسْحَاق بْنُ مُوسَى الْأَنْصَارِيُّ، حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكٌ، عَنْ يَزِيدَ بْنِ خُصَيْفَةَ، عَنْ عَمْرِو بْنِ عَبْدِ اللَّهِ بْنِ كَعْبٍ السُّلَمِيِّ، أَنَّ نَافِعَ بْنَ جُبَيْرِ بْنِ مُطْعِمٍ أَخْبَرَهُ، ‏‏‏‏‏‏عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ، أَنَّهُ قَالَ:‏‏‏‏ أَتَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبِي وَجَعٌ قَدْ كَانَ يُهْلِكُنِي، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ امْسَحْ بِيَمِينِكَ سَبْعَ مَرَّاتٍ، ‏‏‏‏‏‏وَقُلْ:‏‏‏‏ أَعُوذُ بِعِزَّةِ اللَّهِ وَقُوَّتِهِ وَسُلْطَانِهِ مِنْ شَرِّ مَا أَجِدُ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَفَعَلْتُ، ‏‏‏‏‏‏فَأَذْهَبَ اللَّهُ مَا كَانَ بِي، ‏‏‏‏‏‏فَلَمْ أَزَلْ آمُرُ بِهِ أَهْلِي، ‏‏‏‏‏‏وَغَيْرَهُمْ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17205,
        "hadith_number": "2081",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Khasiat Senna Sebagai Julap",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Asma' bint 'Umais narrated that the Messenger of Allah (S.A.W) asked her what they used as a laxative. She said: Shubrum He said: It is hot and too strong. She said: Then I used Senna as a laxative. So the Prophet (S.A.W): If there was anything that would have a cure for death in it, then it would have been Senna.",
        "malay_translation": "Asma' bint 'Umais meriwayatkan bahawa Rasulullah (S.A.W) bertanya kepadanya apa yang mereka gunakan sebagai julap. Beliau berkata: Shubrum. Baginda bersabda: Ia panas dan terlalu kuat. Beliau berkata: Kemudian saya menggunakan Senna sebagai julap. Maka Nabi (S.A.W) bersabda: Sekiranya ada sesuatu yang dapat menjadi penawar untuk kematian, maka ia adalah Senna.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، حَدَّثَنِي عُتْبَةُ بْنُ عَبْدِ اللَّهِ، عَنْ أَسْمَاءَ بِنْتِ عُمَيْسٍ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَأَلَهَا:‏‏‏‏ بِمَ تَسْتَمْشِينَ ؟ قَالَتْ:‏‏‏‏ بِالشُّبْرُمِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَارٌّ جَارٌّ قَالَتْ:‏‏‏‏ ثُمَّ اسْتَمْشَيْتُ بِالسَّنَا، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَوْ أَنَّ شَيْئًا كَانَ فِيهِ شِفَاءٌ مِنَ الْمَوْتِ لَكَانَ فِي السَّنَا ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏يَعْنِي:‏‏‏‏ دَوَاءَ الْمَشِيِّ."
      },
      {
        "id": 17206,
        "hadith_number": "2082",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Madu Sebagai Penawar Sakit Perut",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Abu Sa'eed said: A man came to the Prophet (S.A.W) and said: 'My brother is suffering from loose bowels.' He said: 'Let him drink Honey.' So he drank it. Then he came and said: O Messenger of Allah (S.A.W)! He has drunk honey, but it has only made him more worse.' So the Messenger of Allah (S.A.W) said: ' Let him drink honey.' He said: So he drank it. Then he came and said: 'O Messenger of Allah (S.A.W)! I gave him some more to drink, but it has only made him more worse.' He said: The Messenger of Allah (S.A.W) said: 'Allah has told the truth,and your brother's stomach has lied. Give him honey to drink'. So he gave him some more honey to drink and he was cured.'",
        "malay_translation": "Abu Sa'eed berkata: Seorang lelaki datang kepada Nabi (S.A.W) dan berkata: 'Saudara saya sedang menderita sakit perut.' Baginda bersabda: 'Biarkan dia minum Madu.' Maka dia pun meminumnya. Kemudian dia datang dan berkata: Wahai Rasulullah (S.A.W)! Dia telah minum madu, tetapi ia hanya membuatnya semakin teruk.' Maka Rasulullah (S.A.W) bersabda: 'Biarkan dia minum madu.' Dia berkata: Maka dia pun meminumnya. Kemudian dia datang dan berkata: 'Wahai Rasulullah (S.A.W)! Saya telah memberinya minum lagi, tetapi ia hanya membuatnya semakin teruk.' Baginda bersabda: Rasulullah (S.A.W) bersabda: 'Allah telah berfirman benar, dan perut saudaramu telah berdusta. Berikan dia madu untuk diminum'. Maka dia pun memberinya minum madu lagi dan dia pun sembuh.'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَبِي الْمُتَوَكِّلِ، عَنْ أَبِي سَعِيدٍ، قَالَ:‏‏‏‏ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنَّ أَخِي اسْتَطْلَقَ بَطْنُهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ اسْقِهِ عَسَلًا، ‏‏‏‏‏‏فَسَقَاهُ، ‏‏‏‏‏‏ثُمَّ جَاءَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏قَدْ سَقَيْتُهُ عَسَلًا فَلَمْ يَزِدْهُ إِلَّا اسْتِطْلَاقًا، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اسْقِهِ عَسَلًا ، ‏‏‏‏‏‏فَسَقَاهُ ثُمَّ جَاءَهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏قَدْ سَقَيْتُهُ عَسَلًا فَلَمْ يَزِدْهُ إِلَّا اسْتِطْلَاقًا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ صَدَقَ اللَّهُ وَكَذَبَ بَطْنُ أَخِيكَ، ‏‏‏‏‏‏اسْقِهِ عَسَلًا، ‏‏‏‏‏‏فَسَقَاهُ عَسَلًا فَبَرَأَ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17207,
        "hadith_number": "2083",
        "status": "sahih",
        "nama_buku": "Jami' At-Tirmidhi",
        "penulis_buku": "Abu Isa Muhammad At-Tirmidhi",
        "tajuk_hadith": "Keutamaan Menziarahi Orang Sakit dan Doa untuk Kesembuhan",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Ibn 'Abbas narrated that the Prophet (S.A.W) said: There is no Muslim worshiper who visits one who is ill - other than at the time of death - and he says seven times: As'alullah Al-'Azeem Rabbal 'Arshil 'Azeem an yashfik ('I ask Allah the Magnificent, Lord of the Magnificent Throne to cure you') except when he will be cured.",
        "malay_translation": "Daripada Ibn 'Abbas meriwayatkan bahawa Nabi (SAW) bersabda: Tidak ada seorang Muslim pun yang menziarahi orang sakit - selain waktu kematian - dan dia mengucapkan sebanyak tujuh kali: As'alullah Al-'Azeem Rabbal 'Arshil 'Azeem an yashfik (Aku memohon kepada Allah Yang Maha Agung, Tuhan Arasy yang Agung untuk menyembuhkanmu) kecuali dia akan disembuhkan.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ يَزِيدَ بْنِ خَالِدٍ، قَال:‏‏‏‏ سَمِعْتُ الْمِنْهَالَ بْنَ عَمْرٍو يُحَدِّثُ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ:‏‏‏‏ مَا مِنْ عَبْدٍ مُسْلِمٍ يَعُودُ مَرِيضًا لَمْ يَحْضُرْ أَجَلُهُ فَيَقُولُ سَبْعَ مَرَّاتٍ:‏‏‏‏ أَسْأَلُ اللَّهَ الْعَظِيمَ، ‏‏‏‏‏‏رَبَّ الْعَرْشِ الْعَظِيمِ أَنْ يَشْفِيَكَ، ‏‏‏‏‏‏إِلَّا عُوفِيَ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ الْمِنْهَالِ بْنِ عَمْرٍو."
      },
      {
        "id": 17208,
        "hadith_number": "2084",
        "status": "sahih",
        "nama_buku": "Jami' at-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Cara Mengubati Demam Menurut Nabi Muhammad SAW",
        "perawi_melayu": "Thawban",
        "english_text": "Thawban narrated that the Prophet (S.A.W) said: When one of you suffers from fever - and indeed fever is a piece of the Fire - let him extinguish it with water. Let him stand in a flowing river facing the direction of it and say: Allahummasahfi 'abdaka wa saddik Rasulak ('In the name off Allah. O Allah! Cure your slave and testify to Your Messenger.)' Doing so after Salat As-Subh(Fajr) and before the rising of the sun. Let him submerse himself in it three times, for three days. If he is not cured in three, then five. If he is not cured in five, then seven. If he is not cured in seven, then nine. For indeed it will not remain after nine, with the permission of Allah.",
        "malay_translation": "Thawban meriwayatkan bahawa Nabi (SAW) bersabda: Apabila salah seorang daripada kamu mengalami demam - dan sesungguhnya demam itu adalah sebahagian daripada api - maka hendaklah dia memadamkannya dengan air. Biarkan dia berdiri di sungai yang mengalir menghadap arah alirannya dan berkata: 'Allahummasyfi 'abdaka wa saddiq Rasulak' (Ya Allah! Sembuhkanlah hamba-Mu dan benarkanlah Rasul-Mu.)' Lakukanlah ini selepas solat Subuh dan sebelum terbit matahari. Biarkan dia merendamkan dirinya di dalamnya tiga kali, selama tiga hari. Jika dia tidak sembuh dalam tiga hari, maka lima hari. Jika dia tidak sembuh dalam lima hari, maka tujuh hari. Jika dia tidak sembuh dalam tujuh hari, maka sembilan hari. Sesungguhnya ia tidak akan kekal selepas sembilan hari, dengan izin Allah.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الْأَشْقَرُ الرِّبَاطِيُّ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا مَرْزُوقٌ أَبُو عَبْدِ اللَّهِ الشَّامِيُّ، حَدَّثَنَا سَعِيدٌ رَجُلٌ مِنْ أَهْلِ الشَّامِ، ‏‏‏‏‏‏أَخْبَرَنَا ثَوْبَانُ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِذَا أَصَابَ أَحَدَكُمُ الْحُمَّى فَإِنَّ الْحُمَّى قِطْعَةٌ مِنَ النَّارِ فَلْيُطْفِئْهَا عَنْهُ بِالْمَاءِ فَلْيَسْتَنْقِعْ نَهْرًا جَارِيًا لِيَسْتَقْبِلَ جَرْيَةَ الْمَاءِ، ‏‏‏‏‏‏فَيَقُولُ:‏‏‏‏ بِسْمِ اللَّهِ اللَّهُمَّ اشْفِ عَبْدَكَ وَصَدِّقْ رَسُولَكَ، ‏‏‏‏‏‏بَعْدَ صَلَاةِ الصُّبْحِ قَبْلَ طُلُوعِ الشَّمْسِ فَلْيَغْتَمِسْ فِيهِ ثَلَاثَ غَمَسَاتٍ ثَلَاثَةَ أَيَّامٍ، ‏‏‏‏‏‏فَإِنْ لَمْ يَبْرَأْ فِي ثَلَاثٍ فَخَمْسٌ، ‏‏‏‏‏‏وَإِنْ لَمْ يَبْرَأْ فِي خَمْسٍ فَسَبْعٌ، ‏‏‏‏‏‏فَإِنْ لَمْ يَبْرَأْ فِي سَبْعٍ، ‏‏‏‏‏‏فَتِسْعٌ فَإِنَّهَا لَا تَكَادُ تُجَاوِزُ تِسْعًا بِإِذْنِ اللَّهِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ."
      },
      {
        "id": 17209,
        "hadith_number": "2085",
        "status": "sahih",
        "nama_buku": "Jami' al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Rawatan Luka Rasulullah SAW",
        "perawi_melayu": "Sahl bin Sa'd",
        "english_text": "Abu Hazim said: While I was listening, Sahl bin Sa'd was asked: 'What were the wounds of the Messenger of Allah (S.A.W) treated with?' He said: 'None is alive who is more knowledgeable of it than I. 'Ali would come with water in his shield, and Fatimah would use it to wash his blood off,and a mat was burnt for him and his wounds were filled with it(its ashes).",
        "malay_translation": "Abu Hazim berkata: Ketika saya sedang mendengar, Sahl bin Sa'd ditanya: 'Dengan apa luka Rasulullah SAW dirawat?' Beliau berkata: 'Tidak ada seorang pun yang hidup yang lebih berpengetahuan tentangnya daripada saya sendiri. 'Ali akan datang membawa air di dalam perisainya, dan Fatimah akan menggunakannya untuk mencuci darah dari baginda, dan tikar dibakar untuk baginda dan luka-lukanya diisi dengan abunya.'",
        "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي حَازِمٍ، قَالَ:‏‏‏‏ سُئِلَ سَهْلُ بْنُ سَعْدٍ، وَأَنَا أَسْمَعُ، ‏‏‏‏‏‏بِأَيِّ شَيْءٍ دُووِيَ جُرْحُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ؟ فَقَالَ:‏‏‏‏ مَا بَقِيَ أَحَدٌ أَعْلَمُ بِهِ مِنِّي، ‏‏‏‏‏‏كَانَ عَلِيٌّ يَأْتِي بِالْمَاءِ فِي تُرْسِهِ، ‏‏‏‏‏‏وَفَاطِمَةُ تَغْسِلُ عَنْهُ الدَّمَ، ‏‏‏‏‏‏وَأُحْرِقَ لَهُ حَصِيرٌ، ‏‏‏‏‏‏فَحَشَا بِهِ جُرْحُهُ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17210,
        "hadith_number": "2086",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Perumpamaan Orang yang Sembuh",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Anas bin Malik narrated that the Messenger of Allah (S.A.W) said: The parable of the ill when he is cured and becomes healthy is that of hail that falls from the heavens in its purity and its color.",
        "malay_translation": "Anas bin Malik meriwayatkan bahawa Rasulullah (S.A.W) bersabda: Perumpamaan orang sakit ketika dia sembuh dan menjadi sihat adalah seperti hujan batu yang jatuh dari langit dalam keadaan suci dan warnanya.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ:‏‏‏‏ أَخْبَرَنَا الْوَلِيدُ بْنُ مُحَمَّدٍ الْمُوَقَّرِيُّ، عَنِ الزُّهْرِيِّ، عَنِ أَنَسِ بْنِ مَالِكٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّمَا مَثَلُ الْمَرِيضِ إِذَا بَرَأَ وَصَحَّ كَالْبَرْدَةِ تَقَعُ مِنَ السَّمَاءِ فِي صَفَائِهَا وَلَوْنِهَا ."
      },
      {
        "id": 17211,
        "hadith_number": "2087",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Mengunjungi Orang Sakit dan Memberi Semangat",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Abu Sa'eed Al-Khudri narrated that the Messenger of Allah (S.A.W) said: When one of you visits the ill, then reassure him regarding his lifespan. Indeed that will not repel anything, but it will comfort his soul.",
        "malay_translation": "Abu Sa'eed Al-Khudri meriwayatkan bahawa Rasulullah (S.A.W) bersabda: Apabila salah seorang daripada kamu melawat orang sakit, maka hendaklah dia menenangkannya mengenai jangka hayatnya. Sesungguhnya itu tidak akan menolak apa pun, tetapi ia akan menenangkan jiwanya.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ الْأَشَجُّ، حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ السَّكُّونِيُّ، عَنْ مُوسَى بْنِ مُحَمَّدِ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا دَخَلْتُمْ عَلَى الْمَرِيضِ فَنَفِّسُوا لَهُ فِي أَجَلِهِ فَإِنَّ ذَلِكَ لَا يَرُدُّ شَيْئًا وَيُطَيِّبُ نَفْسَهُ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ."
      },
      {
        "id": 17212,
        "hadith_number": "2088",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Kunjungan Nabi kepada Orang Sakit dan Janji Allah tentang Api Neraka",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Abu Hurairah narrated that the Prophet(S.A.W) visited a man who was ill, so he said: Cheer up, for indeed Allah said: 'It is My Fire which I impose upon My sinning slave as his portion of the Fire. (Hasan) Al-Hasan said: They would hope that the fever that occurred at night would atone for any deficiency caused by sins.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Nabi (S.A.W) mengunjungi seorang lelaki yang sakit, lalu baginda bersabda: 'Bergembiralah, kerana sesungguhnya Allah berfirman: 'Itulah Api-Ku yang Aku timpakan kepada hamba-Ku yang berdosa sebagai bahagiannya dari Api.' (Hasan) Al-Hasan berkata: Mereka berharap agar demam yang terjadi pada malam hari dapat menebus kekurangan yang disebabkan oleh dosa-dosa.",
        "arabic_text": "حَدَّثَنَا حَدَّثَنَا هَنَّادٌ، وَمَحْمُودُ بْنُ غَيْلَانَ، قَالَا:‏‏‏‏ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ جَابِرٍ، عَنْ إِسْمَاعِيل بْنِ عُبَيْدِ اللَّهِ، عَنْ أَبِي صَالِحٍ الْأَشْعَرِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَادَ رَجُلًا مِنْ وَعَكٍ كَانَ بِهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَبْشِرْ، ‏‏‏‏‏‏فَإِنَّ اللَّهَ يَقُولُ:‏‏‏‏ هِيَ نَارِي أُسَلِّطُهَا عَلَى عَبْدِي الْمُذْنِبِ لِتَكُونَ حَظَّهُ مِنَ النَّارِ ."
      },
      {
        "id": 17213,
        "hadith_number": "2089",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Hadith daripada Jami' Al-Tirmidhi",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Teks hadith dalam Bahasa Inggeris tidak disediakan.",
        "malay_translation": "Terjemahan hadith dalam Bahasa Melayu tidak disediakan kerana teks asal Bahasa Inggeris tidak ada.",
        "arabic_text": "حَدَّثَنَا حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ:‏‏‏‏ أَخْبَرَنَا عَبْدُ الرَّحْمَنُ بْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ الثَّوْرِيِّ، عَنْ هِشَامِ بْنِ حَسَّانِ، عَنِ الْحَسَنِ، قَالَ:‏‏‏‏ كَانُوا يَرْتَجُونَ الْحُمَّى لَيْلَةً كَفَّارَةً لِمَا نَقَصَ مِنَ الذُّنُوبِ ."
      }
    ]
  }
}