{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 111,
    "data": [
      {
        "id": 17428,
        "hadith_number": "2304",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Dua Nikmat yang Sering Disia-siakan",
        "perawi_melayu": "Ibn 'Abbas",
        "english_text": "Ibn 'Abbas narrated that the Messenger of Allah (s.a.w) said: Two favors that many of the people squander are health and free time.",
        "malay_translation": "Ibn 'Abbas meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Dua nikmat yang sering disia-siakan oleh kebanyakan manusia ialah kesihatan dan masa lapang.",
        "arabic_text": "حَدَّثَنَا صَالِحُ بْنُ عَبْدِ اللَّهِ، وَسُوَيْدُ بْنُ نَصْرٍ، قَالَ صَالِحٌ:‏‏‏‏ حَدَّثَنَا، ‏‏‏‏‏‏وَقَالَ سُوَيْدٌ:‏‏‏‏ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ أَبِي هِنْدٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ نِعْمَتَانِ مَغْبُونٌ فِيهِمَا كَثِيرٌ مِنَ النَّاسِ الصِّحَّةُ وَالْفَرَاغُ ."
      },
      {
        "id": 17429,
        "hadith_number": "2305",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Nasihat Rasulullah SAW tentang Ibadah, Kepuasan, Jiran, dan Mengawal Ketawa",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Al-Hasan narrated from Abu Hurairah that the Messenger of Allah (s.a.w) said: Who will take these statements from me, so that he may act upon them, or teach one who will act upon them? So Abu Hurairah said: I said: 'I shall O Messenger of Allah!' So he (s.a.w) took my hand and enumerated five (things), he said: Be on guard against the unlawful and you shall be the most worshiping among the people, be satisfied with what Allah has alloted for you and you shall be the richest of the people, be kind to your neighbor and you shall be a believer, love for the people what you love for yourself and you shall be a Muslim. And do not laugh too much, for indeed increased laughter kills the heart.",
        "malay_translation": "Al-Hasan meriwayatkan daripada Abu Hurairah bahawa Rasulullah (s.a.w) bersabda: “Siapakah yang akan mengambil kata-kata ini dariku, supaya dia dapat mengamalkannya, atau mengajarkannya kepada orang yang akan mengamalkannya?” Maka Abu Hurairah berkata: Aku berkata: “Saya, wahai Rasulullah!” Maka baginda (s.a.w) memegang tanganku dan menyebut lima (perkara), baginda bersabda: “Berhati-hatilah terhadap perkara yang haram, nescaya engkau akan menjadi orang yang paling banyak beribadah di kalangan manusia, berpuas hatilah dengan apa yang Allah telah kurniakan kepadamu, nescaya engkau akan menjadi orang yang paling kaya di kalangan manusia, berbuat baiklah kepada jiranmu, nescaya engkau akan menjadi seorang mukmin, cintailah untuk manusia apa yang engkau cintai untuk dirimu sendiri, nescaya engkau akan menjadi seorang Muslim. Dan janganlah terlalu banyak ketawa, kerana sesungguhnya banyak ketawa itu mematikan hati.”",
        "arabic_text": "حَدَّثَنَا بِشْرُ بْنُ هِلَالٍ الصَّوَّافُ الْبَصْرِيُّ، حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، عَنْ أَبِي طَارِقٍ، عَنِ الْحَسَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ يَأْخُذُ عَنِّي هَؤُلَاءِ الْكَلِمَاتِ فَيَعْمَلُ بِهِنَّ أَوْ يُعَلِّمُ مَنْ يَعْمَلُ بِهِنَّ ؟ فَقَالَ أَبُو هُرَيْرَةَ:‏‏‏‏ فَقُلْتُ:‏‏‏‏ أَنَا يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏فَأَخَذَ بِيَدِي فَعَدَّ خَمْسًا، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ اتَّقِ الْمَحَارِمَ تَكُنْ أَعْبَدَ النَّاسِ، ‏‏‏‏‏‏وَارْضَ بِمَا قَسَمَ اللَّهُ لَكَ تَكُنْ أَغْنَى النَّاسِ، ‏‏‏‏‏‏وَأَحْسِنْ إِلَى جَارِكَ تَكُنْ مُؤْمِنًا، ‏‏‏‏‏‏وَأَحِبَّ لِلنَّاسِ مَا تُحِبُّ لِنَفْسِكَ تَكُنْ مُسْلِمًا، ‏‏‏‏‏‏وَلَا تُكْثِرِ الضَّحِكَ فَإِنَّ كَثْرَةَ الضَّحِكِ تُمِيتُ الْقَلْبَ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ جَعْفَرِ بْنِ سُلَيْمَانَ، ‏‏‏‏‏‏وَالْحَسَنُ لَمْ يَسْمَعْ مِنْ أَبِي هُرَيْرَةَ شَيْئًا هَكَذَا، ‏‏‏‏‏‏رُوِيَ عَنْ أَيُّوبَ، ‏‏‏‏‏‏وَيُونُسَ بْنِ عُبَيْدٍ، ‏‏‏‏‏‏وَعَلِيِّ بْنِ زَيْدٍ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ لَمْ يَسْمَعْ الْحَسَنُ مِنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَرَوَى أَبُو عُبَيْدَةَ النَّاجِيُّ، ‏‏‏‏‏‏عَنِ الْحَسَنِ هَذَا الْحَدِيثَ قَوْلَهُ، ‏‏‏‏‏‏وَلَمْ يَذْكُرْ فِيهِ عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 17430,
        "hadith_number": "2306",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Bersegera Melakukan Amalan Sebelum Tujuh Perkara",
        "perawi_melayu": "Abu Hurairah RA",
        "english_text": "Abu Hurairah, may Allah be pleased with him, narrated that the Messenger of Allah (s.a.w) said: Race to do works against seven. Are you waiting but for overwhelming poverty, or distracting richness, or debilitating illness, or babbling senility, or sudden death, or the Dajjal, so that hidden evil is what is awaited, or the Hour? The Hour is more calamitous and more bitter. (Daif)",
        "malay_translation": "Abu Hurairah RA meriwayatkan bahawa Rasulullah SAW bersabda: Bersegeralah melakukan amalan sebelum datangnya tujuh perkara. Adakah yang kamu tunggu melainkan kemiskinan yang melupakan, atau kekayaan yang melalaikan, atau penyakit yang merosakkan, atau ketuaan yang nyanyuk, atau kematian yang mengejut, atau Dajjal, seburuk-buruk perkara ghaib yang ditunggu, atau Kiamat? Kiamat itu lebih dahsyat dan lebih pahit. (Daif)",
        "arabic_text": "حَدَّثَنَا أَبُو مُصْعَبٍ الْمَدَنِيُّ، عَنْ مُحْرَّرِ بْنِ هَارُونَ، عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ بَادِرُوا بِالْأَعْمَالِ سَبْعًا هَلْ تَنْتَظِرُونَ إِلَّا فَقْرًا مُنْسِيًا، ‏‏‏‏‏‏أَوْ غِنًى مُطْغِيًا، ‏‏‏‏‏‏أَوْ مَرَضًا مُفْسِدًا، ‏‏‏‏‏‏أَوْ هَرَمًا مُفَنِّدًا، ‏‏‏‏‏‏أَوْ مَوْتًا مُجْهِزًا، ‏‏‏‏‏‏أَوِ الدَّجَّالَ فَشَرُّ غَائِبٍ يُنْتَظَرُ، ‏‏‏‏‏‏أَوِ السَّاعَةَ فَالسَّاعَةُ أَدْهَى وَأَمَرُّ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ مِنْ حَدِيثِ الْأَعْرَجِ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏إِلَّا مِنْ حَدِيثِ مُحَرَّرِ بْنِ هَارُونَ، ‏‏‏‏‏‏وَقَدْ رَوَى بِشْرُ بْنُ عُمَرَ وَغَيْرُهُ، ‏‏‏‏‏‏عَنْ مُحَرَّرِ بْنِ هَارُونَ هَذَا، ‏‏‏‏‏‏وَقَدْ رَوَى مَعْمَرٌ هَذَا الْحَدِيثَ، ‏‏‏‏‏‏عَمَّنْ سَمِعَ سَعِيدًا الْمَقْبُرِيَّ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ تَنْتَظِرُونَ."
      },
      {
        "id": 17431,
        "hadith_number": "2307",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Galakan Memperbanyakkan Ingatan Kepada Kematian",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said: Increase in remembrance of the severer of pleasures. Meaning death.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Perbanyakkan mengingati pemutus segala kelazatan, iaitu kematian.",
        "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَكْثِرُوا ذِكْرَ هَاذِمِ اللَّذَّاتِ ، ‏‏‏‏‏‏يَعْنِي الْمَوْتَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَابِ عَنْ أَبِي سَعِيدٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ."
      },
      {
        "id": 17432,
        "hadith_number": "2308",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Kubur: Peringkat Pertama dan Paling Dahsyat di Akhirat",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Hani' the freed slave of 'Uthman said: When 'Uthman would stop at a grave he would cry until his beard was soaked (in tears). It was said to him: 'The Paradise and the Fire were mentioned and you did not cry, yet you cry because of this?' So he said: 'Indeed the Messenger of Allah said: Indeed the grave is the first stage among the stages of the Hereafter. So if one is saved from it, then what comes after it is easier than it. And if one is not saved from it, then what comes after it is worse than it. And the Messenger of Allah said: I have not seen any sight except that the grave is more horrible than it.",
        "malay_translation": "Hani' bekas hamba 'Uthman berkata: Apabila 'Uthman berhenti di kubur, beliau akan menangis sehingga janggutnya basah (dengan air mata). Dikatakan kepadanya: 'Syurga dan Neraka disebut dan kamu tidak menangis, namun kamu menangis kerana ini?' Maka beliau berkata: 'Sesungguhnya Rasulullah SAW bersabda: Sesungguhnya kubur adalah tahap pertama di antara tahap-tahap Akhirat. Jika seseorang selamat daripadanya, maka apa yang datang selepasnya adalah lebih mudah daripadanya. Dan jika seseorang tidak selamat daripadanya, maka apa yang datang selepasnya adalah lebih buruk daripadanya. Dan Rasulullah SAW bersabda: Aku tidak pernah melihat pemandangan kecuali kubur adalah lebih dahsyat daripadanya.'",
        "arabic_text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ، حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بَحِيرٍ، أَنَّهُ سَمِعَ هَانِئًا مَوْلَى عُثْمَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ عُثْمَانُ إِذَا وَقَفَ عَلَى قَبْرٍ بَكَى حَتَّى يَبُلَّ لِحْيَتَهُ، ‏‏‏‏‏‏فَقِيلَ لَهُ:‏‏‏‏ تُذْكَرُ الْجَنَّةُ وَالنَّارُ فَلَا تَبْكِي وَتَبْكِي مِنْ هَذَا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِنَّ الْقَبْرَ أَوَّلُ مَنْزِلٍ مِنْ مَنَازِلِ الْآخِرَةِ، ‏‏‏‏‏‏فَإِنْ نَجَا مِنْهُ فَمَا بَعْدَهُ أَيْسَرُ مِنْهُ، ‏‏‏‏‏‏وَإِنْ لَمْ يَنْجُ مِنْهُ فَمَا بَعْدَهُ أَشَدُّ مِنْهُ . (حديث مرفوع) (حديث موقوف) قَالَ:‏‏‏‏ قَالَ:‏‏‏‏ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَا رَأَيْتُ مَنْظَرًا قَطُّ إِلَّا وَالْقَبْرُ أَفْظَعُ مِنْهُ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ هِشَامِ بْنِ يُوسُفَ."
      },
      {
        "id": 17433,
        "hadith_number": "2309",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Cinta Pertemuan dengan Allah",
        "perawi_melayu": "Ubadah bin As-Samit",
        "english_text": "Ubadah bin As-Samit narrated that the Messenger of Allah (s.a.w) said: Whoever loves to meet Allah, Allah loves to meet him. Whoever is averse to meeting Allah, Allah is averse to meeting him.",
        "malay_translation": "Ubadah bin As-Samit meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Sesiapa yang suka bertemu dengan Allah, Allah suka bertemu dengannya. Sesiapa yang tidak suka bertemu dengan Allah, Allah juga tidak suka bertemu dengannya.",
        "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو دَاوُدَ، أَخْبَرَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَال:‏‏‏‏ سَمِعْتُ أَنَسًا يُحَدِّثُ، ‏‏‏‏‏‏عَنْ عُبَادَةَ بْنِ الصَّامِتِ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ، ‏‏‏‏‏‏وَمَنْ كَرِهَ لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَعَائِشَةَ، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏وَأَبِي مُوسَى، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدِيثُ عُبَادَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17434,
        "hadith_number": "2310",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Peringatan kepada Kerabat dan Tawaran Harta",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Aishah narrated: When this Ayah was revealed: And warn your near kindred....(26:214), the Messenger of Allah (s.a.w) said: O Safiyyah bint 'Abdul-Muttalib! O Fatimah bint Muhammed! O Banu 'Abdul-Muttalib! I have no authority on your behalf over Allah for anything. Ask me for whatever you want of my wealth.",
        "malay_translation": "Aisyah meriwayatkan: Ketika ayat ini diturunkan: Dan berilah peringatan kepada kerabat-kerabatmu yang terdekat....(26:214), Rasulullah (s.a.w) bersabda: Wahai Safiyyah binti 'Abdul-Muttalib! Wahai Fatimah binti Muhammed! Wahai Banu 'Abdul-Muttalib! Aku tidak memiliki kuasa sedikit pun untuk menolong kamu di hadapan Allah. Mintalah kepadaku apa sahaja yang kamu inginkan dari hartaku.",
        "arabic_text": "حَدَّثَنَا أَبُو الْأَشْعَثِ أَحْمَدُ بْنُ الْمِقْدَامِ الْعِجْلِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الطُّفَاوِيُّ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ:‏‏‏‏ لَمَّا نَزَلَتْ هَذِهِ الْآيَةُ:‏‏‏‏ وَأَنْذِرْ عَشِيرَتَكَ الأَقْرَبِينَ سورة الشعراء آية 214 قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَا صَفِيَّةُ بِنْتَ عَبْدِ الْمُطَّلِبِ، ‏‏‏‏‏‏يَا فَاطِمَةُ بِنْتَ مُحَمَّدٍ، ‏‏‏‏‏‏يَا بَنِي عَبْدِ الْمُطَّلِبِ، ‏‏‏‏‏‏ إِنِّي لَا أَمْلِكُ لَكُمْ مِنَ اللَّهِ شَيْئًا، ‏‏‏‏‏‏سَلُونِي مِنْ مَالِي مَا شِئْتُمْ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَأَبِي مُوسَى، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدِيثُ عَائِشَةَ حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏هَكَذَا رَوَى بَعْضُهُمْ، ‏‏‏‏‏‏عَنْ هِشَامِ بْنِ عُرْوَةَ نَحْوَ هَذَا، ‏‏‏‏‏‏وَرَوَى بَعْضُهُمْ عَنْ هِشَامٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا، ‏‏‏‏‏‏لَمْ يَذْكُرْ فِيهِ عَنْ عَائِشَةَ."
      },
      {
        "id": 17435,
        "hadith_number": "2311",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keutamaan Menangis Kerana Takut kepada Allah dan Debu di Jalan Allah serta Asap Jahannam Tidak Berkumpul",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said : A man who cries out of fearing Allah, will not be put into the Fire until milk returns to the udder; and dust raised in the cause of Allah and the smoke of Jahannam will not be gathered together. [He said:] There are narrations on this topic from Abu Raihanah and Ibn 'Abbas. [He said:] This Hadith is [Hasan] Sahih. Muhammad bin 'Abdur-Rahman is the Mawla of the family of Talbah, and he is from Al-Madinah, and trustworthy. Shu'bah and Sufyan Ath-Thawri reported from him.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Seorang lelaki yang menangis kerana takut kepada Allah, tidak akan dimasukkan ke dalam Neraka sehingga susu kembali ke dalam kantung susu; dan debu yang berterbangan di jalan Allah dan asap Jahannam tidak akan berkumpul bersama. [Beliau berkata:] Terdapat riwayat mengenai topik ini daripada Abu Raihanah dan Ibn 'Abbas. [Beliau berkata:] Hadis ini adalah [Hasan] Sahih. Muhammad bin 'Abdur-Rahman adalah Mawla keluarga Talbah, dan beliau berasal dari Al-Madinah, dan dipercayai. Shu'bah dan Sufyan Ath-Thawri meriwayatkan daripada beliau.",
        "arabic_text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ الْمَسْعُودِيِّ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عِيسَى بْنِ طَلْحَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا يَلِجُ النَّارَ رَجُلٌ بَكَى مِنْ خَشْيَةِ اللَّهِ حَتَّى يَعُودَ اللَّبَنُ فِي الضَّرْعِ، ‏‏‏‏‏‏وَلَا يَجْتَمِعُ غُبَارٌ فِي سَبِيلِ اللَّهِ وَدُخَانُ جَهَنَّمَ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَابِ عَنْ أَبِي رَيْحَانَةَ وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَمُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ هُوَ مَوْلَى آلِ طَلْحَةَ، ‏‏‏‏‏‏وَهُوَ مَدَنِيٌّ ثِقَةٌ، ‏‏‏‏‏‏رَوَى عَنْهُ شُعْبَةُ، ‏‏‏‏‏‏وَسُفْيَانُ الثَّوْرِيُّ."
      },
      {
        "id": 17436,
        "hadith_number": "2312",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keadaan Langit dan Nasihat Rasulullah SAW tentang Dunia",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Abu Dharr narrated that the Messenger of Allah (s.a.w) said: Indeed I see what you do not see, and I hear what you do not hear. The Heavens moan, and they have the right to moan. There is no spot, the size of four fingers in them, except that there is an angel placing his forehead in it, prostrating to Allah. By Allah! If you knew what I know, then you would laugh little and you would cry much. And you would not taste the pleasures of your women in the beds, and you would go out beseeching Allah. And I wish that I was but a felled tree. [Abu 'Eisa said:] There are narrations on this topic from 'Aishah, Abu Hurairah, Ibn 'Abbas, and Anas. [He said:] This Hadith is Hasan Gharib. It has been related through routes other than this, that Abu Dharr said: I wish that I was a felled tree. And it has been related from Abu Dharr in Mawquf form.",
        "malay_translation": "Abu Dharr meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Sesungguhnya aku melihat apa yang kamu tidak lihat, dan aku mendengar apa yang kamu tidak dengar. Langit berteriak (merintih), dan mereka berhak untuk berteriak (merintih). Tidak ada tempat, sebesar empat jari di dalamnya, kecuali di sana ada malaikat yang meletakkan dahinya di tempat itu, sujud kepada Allah. Demi Allah! Jika kamu mengetahui apa yang aku ketahui, maka kamu akan sedikit tertawa dan banyak menangis. Dan kamu tidak akan merasakan kenikmatan bersama isteri-isteri kamu di ranjang, dan kamu akan keluar merayu (memohon) kepada Allah. Dan aku berharap bahawa aku hanyalah sebatang pohon yang tumbang. [Abu 'Eisa berkata:] Ada riwayat mengenai topik ini dari 'Aishah, Abu Hurairah, Ibn 'Abbas, dan Anas. [Beliau berkata:] Hadith ini adalah Hasan Gharib. Telah diriwayatkan melalui jalur lain selain ini, bahawa Abu Dharr berkata: Aku berharap bahawa aku adalah sebatang pohon yang tumbang. Dan telah diriwayatkan dari Abu Dharr dalam bentuk Mawquf.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ إِبْرَاهِيمَ بْنِ الْمُهَاجِرِ، عَنْ مُجَاهِدٍ، عَنْ مُوَرِّقٍ، عَنْ أَبِي ذَرٍّ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنِّي أَرَى مَا لَا تَرَوْنَ، ‏‏‏‏‏‏وَأَسْمَعُ مَا لَا تَسْمَعُونَ، ‏‏‏‏‏‏أَطَتِ السَّمَاءُ وَحُقَّ لَهَا أَنْ تَئِطَّ مَا فِيهَا مَوْضِعُ أَرْبَعِ أَصَابِعَ إِلَّا وَمَلَكٌ وَاضِعٌ جَبْهَتَهُ سَاجِدًا لِلَّهِ، ‏‏‏‏‏‏وَاللَّهِ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَضَحِكْتُمْ قَلِيلًا، ‏‏‏‏‏‏وَلَبَكَيْتُمْ كَثِيرًا، ‏‏‏‏‏‏وَمَا تَلَذَّذْتُمْ بِالنِّسَاءِ عَلَى الْفُرُشِ، ‏‏‏‏‏‏وَلَخَرَجْتُمْ إِلَى الصُّعُدَاتِ تَجْأَرُونَ إِلَى اللَّهِ لَوَدِدْتُ أَنِّي كُنْتُ شَجَرَةً تُعْضَدُ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَعَائِشَةَ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏وَيُرْوَى مِنْ غَيْرِ هَذَا الْوَجْهِ، ‏‏‏‏‏‏أَنَّ أَبَا ذَرٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَوَدِدْتُ أَنِّي كُنْتُ شَجَرَةً تُعْضَدُ."
      },
      {
        "id": 17437,
        "hadith_number": "2313",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Jika Kamu Tahu Apa Yang Aku Tahu",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said: If you knew what I know, then you would laugh little and you would cry much.",
        "malay_translation": "Daripada Abu Hurairah RA meriwayatkan bahawa Rasulullah SAW bersabda: Sekiranya kamu tahu apa yang aku tahu, nescaya kamu akan sedikit ketawa dan banyak menangis.",
        "arabic_text": "حَدَّثَنَا أَبُو حَفْصٍ عَمْرُو بْنُ عَلِيٍّ الْفَلَّاسُ، حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَضَحِكْتُمْ قَلِيلًا، ‏‏‏‏‏‏وَلَبَكَيْتُمْ كَثِيرًا ، ‏‏‏‏‏‏هَذَا حَدِيثٌ صَحِيحٌ."
      },
      {
        "id": 17438,
        "hadith_number": "2314",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Amaran Terhadap Ucapan yang Meremehkan",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said: Indeed a man may utter a statement that he does not see any harm in, but for which he will fall seventy autumns in the Fire.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Sesungguhnya seorang lelaki boleh mengucapkan suatu perkataan yang dia tidak melihat ada bahaya padanya, tetapi kerananya dia akan jatuh tujuh puluh musim gugur ke dalam Neraka.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ مُحَمَّدِ بْنِ إِسْحَاق، حَدَّثَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ، عَنْ عِيسَى بْنِ طَلْحَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ الرَّجُلَ لَيَتَكَلَّمُ بِالْكَلِمَةِ لَا يَرَى بِهَا بَأْسًا يَهْوِي بِهَا سَبْعِينَ خَرِيفًا فِي النَّارِ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ."
      },
      {
        "id": 17439,
        "hadith_number": "2315",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Larangan Berdusta Demi Membuat Orang Tertawa",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Bahz bin Hakim narrated from his father, from his grandfather that Prophet (s.a.w) said: Woe to the one who talks about something to make the people laugh, in which he lies. Woe to him! Woe to him!",
        "malay_translation": "Bahz bin Hakim meriwayatkan daripada ayahnya, daripada datuknya bahawa Nabi (s.a.w) bersabda: Celakalah bagi orang yang bercakap tentang sesuatu untuk membuat orang ramai ketawa, yang mana dia berdusta. Celakalah dia! Celakalah dia!",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا بَهْزُ بْنُ حَكِيمٍ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، قَالَ:‏‏‏‏ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ وَيْلٌ لِلَّذِي يُحَدِّثُ بِالْحَدِيثِ لِيُضْحِكَ بِهِ الْقَوْمَ فَيَكْذِبُ، ‏‏‏‏‏‏وَيْلٌ لَهُ وَيْلٌ لَهُ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ."
      },
      {
        "id": 17440,
        "hadith_number": "2316",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Larangan Memastikan Syurga Seseorang",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Anas bin Malik narrated that a man among his companions was dying so he said- meaning a man said to him: Glad tidings of Paradise. To which the Messenger of Allah (s.a.w) said: You do not know. Perhaps he spoke of what did not concern him or he was greedy with that which would not decrease him.",
        "malay_translation": "Anas bin Malik meriwayatkan bahawa seorang lelaki dalam kalangan sahabatnya sedang nazak, lalu dia berkata - yakni seorang lelaki berkata kepadanya: 'Berita gembira tentang Syurga.' Maka Rasulullah (s.a.w) bersabda: 'Kamu tidak tahu. Mungkin dia bercakap tentang perkara yang tidak berkenaan dengannya atau dia tamak dengan apa yang tidak akan mengurangkannya.'",
        "arabic_text": "حَدَّثَنَا سُلَيْمَانُ بْنُ عَبْدِ الْجَبَّارِ الْبَغْدَادِيُّ، حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، عَنْ الْأَعْمَشِ، عَنْ أَنَسٍ بْنِ مَالِكٍ، قَالَ:‏‏‏‏ تُوُفِّيَ رَجُلٌ مِنْ أَصْحَابِهِ، ‏‏‏‏‏‏فَقَالَ يَعْنِي رَجُلًا:‏‏‏‏ أَبْشِرْ بِالْجَنَّةِ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَوَلَا تَدْرِي فَلَعَلَّهُ تَكَلَّمَ فِيمَا لَا يَعْنِيهِ، ‏‏‏‏‏‏أَوْ بَخِلَ بِمَا لَا يَنْقُصُهُ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ."
      },
      {
        "id": 17441,
        "hadith_number": "2317",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Kebaikan Islam Seseorang: Meninggalkan Perkara yang Tidak Berkaitan",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said: Indeed among the excellence of a person's Islam is that he leaves what does not concern him.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Sesungguhnya di antara kebaikan Islam seseorang adalah dia meninggalkan apa yang tidak berkaitan dengannya.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ نَصْرٍ النَّيْسَابُورِيُّ، وَغَيْرُ وَاحِدٍ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ حَدَّثَنَا أَبُو مُسْهِرٍ، عَنْ إِسْمَاعِيل بْنِ عَبْدِ اللَّهِ بْنِ سَمَاعَةَ، عَنْ الْأَوْزَاعِيِّ، عَنْ قُرَّةَ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مِنْ حُسْنِ إِسْلَامِ الْمَرْءِ تَرْكُهُ مَا لَا يَعْنِيهِ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ مِنْ حَدِيثِ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا مِنْ هَذَا الْوَجْهِ."
      },
      {
        "id": 17442,
        "hadith_number": "2318",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Kebaikan Islam Seseorang: Meninggalkan Perkara yang Tidak Berkaitan",
        "perawi_melayu": "Ali bin Al-Husain",
        "english_text": "Ali bin Al-Husain narrated that the Messenger of Allah (s.a.w) said: Surely, of the excellence of a person's Islam is that he leaves what does not concern him.",
        "malay_translation": "Ali bin Al-Husain meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Sesungguhnya, termasuk kebaikan Islam seseorang adalah dia meninggalkan perkara yang tidak berkaitan dengannya.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنِ الزُّهْرِيِّ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ مِنْ حُسْنِ إِسْلَامِ الْمَرْءِ تَرْكَهُ مَا لَا يَعْنِيهِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَهَكَذَا رَوَى غَيْرُ وَاحِدٍ مِنْ أَصْحَابِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ عَلِيِّ بْنِ حُسَيْنٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ حَدِيثِ مَالِكٍ مُرْسَلًا، ‏‏‏‏‏‏وَهَذَا عِنْدَنَا أَصَحُّ مِنْ حَدِيثِ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَعَلِيُّ بْنُ حُسَيْنٍ لَمْ يُدْرِكْ عَلِيَّ بْنَ أَبِي طَالِبٍ."
      },
      {
        "id": 17443,
        "hadith_number": "2319",
        "status": "Sahih",
        "nama_buku": "Jami' al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Kesan Ucapan yang Diredhai atau Dimurkai Allah",
        "perawi_melayu": "Muhammad bin 'Amr meriwayatkan daripada bapanya, daripada datuknya yang berkata: Aku mendengar Bilal bin Al-Harith Al Muzani, Sahabat Rasulullah (s.a.w)",
        "english_text": "Muhammed bin 'Amr narrated from his father, from his grandfather who said: I heard Bilal bin Al-Harith Al Muzani, the Companion of the Messenger of Allah (s.a.w) saying: 'I heard the Messenger of Allah (s.a.w) saying: Indeed one of you says a statement pleasing to Allah, not realizing that you have achieved what you have achieved. Then for it, Allah writes for him His pleasure until the Day of Meeting Him. And one of you says a statement angering Allah, not realizing that you have achieved what you have achieved. Then for it, Allah writes for him His anger until the Day of Meeting with Him.",
        "malay_translation": "Muhammad bin 'Amr meriwayatkan daripada bapanya, daripada datuknya yang berkata: Aku mendengar Bilal bin Al-Harith Al Muzani, Sahabat Rasulullah (s.a.w) berkata: 'Aku mendengar Rasulullah (s.a.w) bersabda: Sesungguhnya salah seorang daripada kamu mengucapkan perkataan yang diredhai Allah, tanpa menyedari apa yang telah dicapainya. Maka disebabkan perkataan itu, Allah menuliskan keredhaan-Nya baginya sehingga hari pertemuan dengan-Nya. Dan salah seorang daripada kamu mengucapkan perkataan yang memurkai Allah, tanpa menyedari apa yang telah dicapainya. Maka disebabkan perkataan itu, Allah menuliskan kemurkaan-Nya baginya sehingga hari pertemuan dengan-Nya.'",
        "arabic_text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا عَبْدَةُ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، حَدَّثَنِي أَبِي، عَنْ جَدِّي، قَال:‏‏‏‏ سَمِعْتُ بِلَالَ بْنَ الْحَارِثِ الْمُزَنِيَّ صَاحِبَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ إِنَّ أَحَدَكُمْ لَيَتَكَلَّمُ بِالْكَلِمَةِ مِنْ رِضْوَانِ اللَّهِ مَا يَظُنُّ أَنْ تَبْلُغَ مَا بَلَغَتْ فَيَكْتُبُ اللَّهُ لَهُ بِهَا رِضْوَانَهُ إِلَى يَوْمِ يَلْقَاهُ، ‏‏‏‏‏‏وَإِنَّ أَحَدَكُمْ لَيَتَكَلَّمُ بِالْكَلِمَةِ مِنْ سَخَطِ اللَّهِ مَا يَظُنُّ أَنْ تَبْلُغَ مَا بَلَغَتْ فَيَكْتُبُ اللَّهُ عَلَيْهِ بِهَا سَخَطَهُ إِلَى يَوْمِ يَلْقَاهُ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَابِ عَنْ أُمِّ حَبِيبَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَهَكَذَا رَوَاهُ غَيْرُ وَاحِدٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ عَمْرٍو نَحْوَ هَذَا، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ عَنْ مُحَمَّدِ بْنِ عَمْرٍو، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ جَدِّهِ، ‏‏‏‏‏‏عَنْ بِلَالِ بْنِ الْحَارِثِ، ‏‏‏‏‏‏وَرَوَى هَذَا الْحَدِيثَ مَالِكٌ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِيهِ، عَنْ بِلَالِ بْنِ الْحَارِثِ، وَلَمْ يَذْكُرْ فِيهِ عَنْ جَدِّهِ."
      },
      {
        "id": 17444,
        "hadith_number": "2320",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Dunia Tidak Bernilai di Sisi Allah Walaupun Sebelah Sayap Nyamuk",
        "perawi_melayu": "Sahl bin Sa'd",
        "english_text": "Sahl bin Sa'd narrated that the Messenger of Allah (s.a.w) said: If the world to Allah was equal to a mosquito's wing, then He would not allow the disbeliever to have a sip of water from it.",
        "malay_translation": "Sahl bin Sa'd meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Seandainya dunia ini di sisi Allah menyamai nilai sebelah sayap nyamuk, maka Dia tidak akan membiarkan orang kafir menghirup seteguk air daripadanya.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ سُلَيْمَانَ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَوْ كَانَتِ الدُّنْيَا تَعْدِلُ عِنْدَ اللَّهِ جَنَاحَ بَعُوضَةٍ مَا سَقَى كَافِرًا مِنْهَا شَرْبَةَ مَاءٍ ، ‏‏‏‏‏‏وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ."
      },
      {
        "id": 17445,
        "hadith_number": "2321",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Kehinaan Dunia di Sisi Allah",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Al-Mustawrid bin Shaddad said: I was with the caravan of those who stopped with the Messenger of Allah (s.a.w) at a dead lamb. The Messenger of Allah (s.a.w) said: 'Do you think that this was insignificant to its owners when they threw it away?' They said:'Yes! It is because of its insignificance that they threw it away O Messenger of Allah!' He said: 'The world is more insignificant to Allah than this to its owners.'",
        "malay_translation": "Al-Mustawrid bin Shaddad berkata: Saya bersama rombongan orang-orang yang berhenti bersama Rasulullah (s.a.w) di bangkai anak domba. Rasulullah (s.a.w) bersabda: 'Adakah kamu fikir bahawa ini tidak berharga bagi pemiliknya ketika mereka membuangnya?' Mereka berkata: 'Ya! Ia adalah kerana ketidakberhargaannya yang menyebabkan mereka membuangnya wahai Rasulullah!' Baginda bersabda: 'Dunia ini lebih tidak berharga bagi Allah daripada ini bagi pemiliknya.'",
        "arabic_text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ مُجَالِدٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، عَنْ الْمُسْتَوْرِدِ بْنِ شَدَّادٍ، قَالَ:‏‏‏‏ كُنْتُ مَعَ الرَّكْبِ الَّذِينَ وَقَفُوا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى السَّخْلَةِ الْمَيِّتَةِ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَتَرَوْنَ هَذِهِ هَانَتْ عَلَى أَهْلِهَا حِينَ أَلْقَوْهَا ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ مِنْ هَوَانِهَا أَلْقَوْهَا يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَالدُّنْيَا أَهْوَنُ عَلَى اللَّهِ مِنْ هَذِهِ عَلَى أَهْلِهَا ، ‏‏‏‏‏‏وَفِي الْبَابِ عَنْ جَابِرٍ وَابْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ الْمُسْتَوْرِدِ حَدِيثٌ حَسَنٌ."
      },
      {
        "id": 17446,
        "hadith_number": "2322",
        "status": "sahih",
        "nama_buku": "Jami' At-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Dunia yang Dilaknat dan Pengecualiannya",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said: Lo! Indeed the world is cursed. What is in it is cursed, except for remembrance of Allah, what is conducive to that, the knowledgeable person and the learning person.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Ketahuilah! Sesungguhnya dunia ini dilaknat. Apa yang ada di dalamnya juga dilaknat, kecuali zikrullah, apa yang membawa kepadanya, orang yang berilmu dan penuntut ilmu.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ الْمُكْتِبُ، حَدَّثَنَا عَلِيُّ بْنُ ثَابِتٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ ثَابِتِ بْنِ ثَوْبَانَ، قَال:‏‏‏‏ سَمِعْتُ عَطَاءَ بْنَ قُرَّةَ، قَال، ‏‏‏‏‏‏سَمِعْتُ عَبْدَ اللَّهِ بْنَ ضَمْرَةَ، قَال:‏‏‏‏ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ أَلَا إِنَّ الدُّنْيَا مَلْعُونَةٌ، ‏‏‏‏‏‏مَلْعُونٌ مَا فِيهَا إِلَّا ذِكْرُ اللَّهِ وَمَا وَالَاهُ وَعَالِمٌ أَوْ مُتَعَلِّمٌ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ."
      },
      {
        "id": 17447,
        "hadith_number": "2323",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Perbandingan Dunia dan Akhirat",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Qa'is bin Abi Hazim said: I heard Mustawrid, a member of Banu Fihr, saying: The Messenger of Allah (s.a.w) said: The world compared to the Hereafter is but like what one of you gets when placing his finger into the sea, so look at what you draw from it.",
        "malay_translation": "Qais bin Abi Hazim berkata: Aku mendengar Mustawrid, seorang daripada Banu Fihr, berkata: Rasulullah (s.a.w) bersabda: Dunia dibandingkan dengan Akhirat hanyalah seperti apa yang diperoleh salah seorang daripada kamu apabila meletakkan jarinya ke dalam laut, maka lihatlah apa yang kamu tarik daripadanya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا إِسْمَاعِيل بْنُ أَبِي خَالِدٍ، حَدَّثَنَا قَيْسُ بْنُ أَبِي حَازِمٍ، قَال:‏‏‏‏ سَمِعْتُ مُسْتَوْرِدًا أَخَا بَنِي فِهْرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَا الدُّنْيَا فِي الْآخِرَةِ إِلَّا مِثْلُ مَا يَجْعَلُ أَحَدُكُمْ إِصْبَعَهُ فِي الْيَمِّ فَلْيَنْظُرْ بِمَاذَا يَرْجِعُ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَإِسْمَاعِيل بْنُ أَبِي خَالِدٍ يُكْنَى أَبَا عَبْدِ اللَّهِ، ‏‏‏‏‏‏وَوَالِدُ قَيْسٍ أَبُو حَازِمٍ اسْمُهُ عَبْدُ بْنُ عَوْفٍ، ‏‏‏‏‏‏وَهُوَ مِنَ الصَّحَابَةِ."
      },
      {
        "id": 17448,
        "hadith_number": "2324",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Dunia Penjara Mukmin, Syurga Kafir",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said: The world is a prison for the believer and Paradise for the disbeliever.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Dunia ini adalah penjara bagi orang mukmin dan syurga bagi orang kafir.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الدُّنْيَا سِجْنُ الْمُؤْمِنِ وَجَنَّةُ الْكَافِرِ ، ‏‏‏‏‏‏وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17449,
        "hadith_number": "2325",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Sumpah Rasulullah SAW Tentang Harta, Kehormatan, Kemiskinan dan Darjat Manusia",
        "perawi_melayu": "Abu Kabshah Al-Anmari",
        "english_text": "Abu Kabshah Al-Anmari narrated that the Messenger of Allah (s.a.w) said: There are three things for which I swear and narrate to you about, so remember it. He said: The wealth of a slave (of Allah) shall not be decreased by charity, no slave (of Allah) suffers injustice and is patient with it except that Allah adds to his honor; no slave (of Allah) opens up a door to begging except that Allah opens a door for him to poverty - or a statement similar- And I shall narrate to you a narration, so remember it. He said: The world is only for four persons: A slave whom Allah provides with wealth and knowledge, so he has Taqwa of his Lord with it, nurtures the ties of kinship with it, and he knows that Allah has a right in it. So this is the most virtuous rank. And a slave whom Allah provides with knowledge, but He does not provide with wealth. So he has a truthful intent, saying: 'If I had wealth, then I would do the deeds of so-and-so with it.' He has his intention, so their rewards are the same. And a slave whom Allah provides with wealth, but He does not provide him with knowledge. [So he] spends his wealth rashly without knowledge, nor having Taqwa of his Lord, nor nurturing the ties of kinship, and he does not know that Allah has a right in it. So this is the most despicable rank. And a slave whom Allah does not provide with wealth nor knowledge, so he says: 'If I had wealth, then I would do the deeds of so-and-so with it.' He has his intention, so their sin is the same.",
        "malay_translation": "Abu Kabshah Al-Anmari meriwayatkan bahawa Rasulullah SAW bersabda: “Terdapat tiga perkara yang aku bersumpah dan menceritakannya kepada kamu, maka ingatlah ia. Baginda bersabda: Harta seorang hamba (Allah) tidak akan berkurang disebabkan sedekah, tidaklah seorang hamba (Allah) dizalimi lalu dia bersabar dengannya melainkan Allah menambahkan kemuliaan kepadanya; tidaklah seorang hamba (Allah) membuka pintu meminta-minta melainkan Allah membukakan pintu kemiskinan baginya - atau ungkapan yang serupa - Dan aku akan menceritakan kepada kamu sebuah riwayat, maka ingatlah ia. Baginda bersabda: Dunia ini hanyalah untuk empat golongan orang: Seorang hamba yang Allah kurniakan harta dan ilmu, maka dia bertaqwa kepada Tuhannya dengannya, menyambung tali persaudaraan dengannya, dan dia tahu bahawa Allah mempunyai hak di dalamnya. Maka ini adalah kedudukan yang paling mulia. Dan seorang hamba yang Allah kurniakan ilmu, tetapi Dia tidak kurniakan harta. Maka dia mempunyai niat yang benar, dengan berkata: ‘Jika aku mempunyai harta, maka aku akan melakukan amalan si fulan dengannya.’ Dia mempunyai niatnya, maka pahala mereka adalah sama. Dan seorang hamba yang Allah kurniakan harta, tetapi Dia tidak kurniakan ilmu kepadanya. [Maka dia] membelanjakan hartanya dengan boros tanpa ilmu, tidak bertaqwa kepada Tuhannya, tidak menyambung tali persaudaraan, dan dia tidak tahu bahawa Allah mempunyai hak di dalamnya. Maka ini adalah kedudukan yang paling hina. Dan seorang hamba yang Allah tidak kurniakan harta mahupun ilmu, maka dia berkata: ‘Jika aku mempunyai harta, maka aku akan melakukan amalan si fulan dengannya.’ Dia mempunyai niatnya, maka dosa mereka adalah sama.”",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيل، حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عُبَادَةُ بْنُ مُسْلِمٍ، حَدَّثَنَا يُونُسُ بْنُ خَبَّابٍ، عَنْ سَعِيدٍ الطَّائِيِّ أَبِي الْبَخْتَرِيّ، أَنَّهُ قَالَ:‏‏‏‏ حَدَّثَنِي أَبُو كَبْشَةَ الْأَنَّمَارِيُّ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ ثَلَاثَةٌ أُقْسِمُ عَلَيْهِنَّ وَأُحَدِّثُكُمْ حَدِيثًا فَاحْفَظُوهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَا نَقَصَ مَالُ عَبْدٍ مِنْ صَدَقَةٍ، ‏‏‏‏‏‏وَلَا ظُلِمَ عَبْدٌ مَظْلَمَةً فَصَبَرَ عَلَيْهَا إِلَّا زَادَهُ اللَّهُ عِزًّا، ‏‏‏‏‏‏وَلَا فَتَحَ عَبْدٌ بَابَ مَسْأَلَةٍ إِلَّا فَتَحَ اللَّهُ عَلَيْهِ بَابَ فَقْرٍ أَوْ كَلِمَةً نَحْوَهَا . (حديث مرفوع) (حديث موقوف) وَأُحَدِّثُكُمْ حَدِيثًا فَاحْفَظُوهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنَّمَا الدُّنْيَا لِأَرْبَعَةِ نَفَرٍ:‏‏‏‏ عَبْدٍ رَزَقَهُ اللَّهُ مَالًا وَعِلْمًا فَهُوَ يَتَّقِي فِيهِ رَبَّهُ وَيَصِلُ فِيهِ رَحِمَهُ وَيَعْلَمُ لِلَّهِ فِيهِ حَقًّا فَهَذَا بِأَفْضَلِ الْمَنَازِلِ، ‏‏‏‏‏‏وَعَبْدٍ رَزَقَهُ اللَّهُ عِلْمًا وَلَمْ يَرْزُقْهُ مَالًا فَهُوَ صَادِقُ النِّيَّةِ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ لَوْ أَنَّ لِي مَالًا لَعَمِلْتُ بِعَمَلِ فُلَانٍ فَهُوَ بِنِيَّتِهِ فَأَجْرُهُمَا سَوَاءٌ، ‏‏‏‏‏‏وَعَبْدٍ رَزَقَهُ اللَّهُ مَالًا وَلَمْ يَرْزُقْهُ عِلْمًا فَهُوَ يَخْبِطُ فِي مَالِهِ بِغَيْرِ عِلْمٍ لَا يَتَّقِي فِيهِ رَبَّهُ وَلَا يَصِلُ فِيهِ رَحِمَهُ وَلَا يَعْلَمُ لِلَّهِ فِيهِ حَقًّا فَهَذَا بِأَخْبَثِ الْمَنَازِلِ، ‏‏‏‏‏‏وَعَبْدٍ لَمْ يَرْزُقْهُ اللَّهُ مَالًا وَلَا عِلْمًا، ‏‏‏‏‏‏فَهُوَ يَقُولُ:‏‏‏‏ لَوْ أَنَّ لِي مَالًا لَعَمِلْتُ فِيهِ بِعَمَلِ فُلَانٍ فَهُوَ بِنِيَّتِهِ فَوِزْرُهُمَا سَوَاءٌ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17450,
        "hadith_number": "2326",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Larangan Meminta-minta kepada Manusia dan Keutamaan Meminta kepada Allah",
        "perawi_melayu": "Tidak diketahui",
        "english_text": "Abdullah bin Mas'ud narrated that the Messenger of Allah (s.a.w) said: Whoever suffers from destitution and he beseeches the people for it, his destitution shall not end. And whoever suffers from destitution and he beseeches Allah for it, Allah will send provisions to him, sooner or later.",
        "malay_translation": "Abdullah bin Mas'ud meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Sesiapa yang menderita kemiskinan dan dia meminta-minta kepada manusia untuk itu, kemiskinannya tidak akan berakhir. Dan sesiapa yang menderita kemiskinan dan dia meminta kepada Allah untuk itu, Allah akan menghantar rezeki kepadanya, cepat atau lambat.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ بَشِيرٍ أَبِي إِسْمَاعِيل، عَنْ سَيَّارٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ نَزَلَتْ بِهِ فَاقَةٌ فَأَنْزَلَهَا بِالنَّاسِ لَمْ تُسَدَّ فَاقَتُهُ، ‏‏‏‏‏‏وَمَنْ نَزَلَتْ بِهِ فَاقَةٌ فَأَنْزَلَهَا بِاللَّهِ فَيُوشِكُ اللَّهُ لَهُ بِرِزْقٍ عَاجِلٍ أَوْ آجِلٍ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ."
      },
      {
        "id": 17451,
        "hadith_number": "2327",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Kekhawatiran Abu Hashim tentang Harta yang Berlebihan",
        "perawi_melayu": "Abu Wail",
        "english_text": "Abu Wail narrated: Mu'awiyah came to Abu Hashim bin 'Uthbah to visit him when he was ill (and dying). He said: 'O Uncle! Why do you cry? Is it from the pangs of death or desire for this world?' He said: 'Neither of these. But the Messenger of Allah (s.a.w) had commissioned me with an obligation that I did not abide by. He (s.a.w) said: It suffices you to gather the wealth of a servant or a rider in the cause of Allah. And (it is only) today I find that I have gathered it.'",
        "malay_translation": "Abu Wail meriwayatkan: Mu'awiyah datang kepada Abu Hashim bin 'Uthbah untuk melawatnya ketika beliau sakit (dan hampir meninggal dunia). Mu'awiyah berkata: 'Wahai Bapa Saudara! Mengapa kamu menangis? Adakah kerana sakitnya kematian atau keinginan terhadap dunia ini?' Abu Hashim menjawab: 'Bukan kedua-duanya. Tetapi Rasulullah (s.a.w) telah mengamanahkan kepadaku suatu kewajipan yang tidak aku patuhi. Baginda (s.a.w) bersabda: Cukuplah bagimu mengumpulkan harta seorang pelayan atau seorang penunggang kenderaan di jalan Allah. Dan (baru) hari ini aku dapati bahawa aku telah mengumpulkannya.'",
        "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، وَالْأَعْمَشِ، عَنْ أَبِي وَائِلٍ، قَالَ:‏‏‏‏ جَاءَ مُعَاوِيَةُ إِلَى أَبِي هَاشِمِ بْنِ عُتْبَةَ وَهُوَ مَرِيضٌ يَعُودُهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا خَالُ، ‏‏‏‏‏‏مَا يُبْكِيكَ أَوَجَعٌ يُشْئِزُكَ أَمْ حِرْصٌ عَلَى الدُّنْيَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُلٌّ لَا، ‏‏‏‏‏‏وَلَكِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَهِدَ إِلَيَّ عَهْدًا لَمْ آخُذْ بِهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنَّمَا يَكْفِيكَ مِنْ جَمْعِ الْمَالِ خَادِمٌ وَمَرْكَبٌ فِي سَبِيلِ اللَّهِ ، ‏‏‏‏‏‏وَأَجِدُنِي الْيَوْمَ قَدْ جَمَعْتُ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَقَدْ رَوَى زَائِدَةُ، وَعَبِيدَةُ بْنُ حُمَيْدٍ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ سَمُرَةَ بْنِ سَهْمٍ، قَالَ:‏‏‏‏ دَخَلَ مُعَاوِيَةُ عَلَى أَبِي هَاشِمٍ، فَذَكَرَ نَحْوَهُ، ‏‏‏‏‏‏وَفِي الْبَابِ عَنْ بُرَيْدَةَ الْأَسْلَمِيِّ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 17452,
        "hadith_number": "2328",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Larangan Terlalu Cenderung kepada Harta Dunia",
        "perawi_melayu": "Abdullah bin Mas'ud",
        "english_text": "Abdullah [bin Mas'ud] narrated that the Messenger of Allah (s.a.w) said: Do not take to the estate, such that you become desirous of the world.",
        "malay_translation": "Abdullah [bin Mas'ud] meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Janganlah kamu cenderung kepada harta benda, sehingga kamu menjadi tamak kepada dunia.",
        "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنِ الْأَعْمَشِ، عَنْ شِمْرِ بْنِ عَطِيَّةَ، عَنْ الْمُغِيرَةِ بْنِ سَعْدِ بْنِ الْأَخْرَمِ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تَتَّخِذُوا الضَّيْعَةَ فَتَرْغَبُوا فِي الدُّنْيَا ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ."
      },
      {
        "id": 17453,
        "hadith_number": "2329",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Sebaik-baik Manusia",
        "perawi_melayu": "Abdullah bin Busr",
        "english_text": "Abdullah bin Busr narrated that a Bedouin said: O Messenger of Allah! Who is the best of the people? He said: He whose life is long and his deeds are good. There are narrations on this topic from Abu Hurairah and Jabir.",
        "malay_translation": "Abdullah bin Busr meriwayatkan bahawa seorang Badwi berkata: Wahai Rasulullah! Siapakah orang yang terbaik? Baginda bersabda: Orang yang panjang umurnya dan baik amalannya. Terdapat riwayat mengenai topik ini daripada Abu Hurairah dan Jabir.",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، عَنْ عَمْرِو بْنِ قَيْسٍ، عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ، أَنَّ أَعْرَابِيًّا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏مَنْ خَيْرُ النَّاسِ ؟ قَالَ:‏‏‏‏ مَنْ طَالَ عُمُرُهُ وَحَسُنَ عَمَلُهُ ، ‏‏‏‏‏‏وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَجَابِرٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ."
      },
      {
        "id": 17454,
        "hadith_number": "2330",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Sebaik-baik dan Seburuk-buruk Manusia",
        "perawi_melayu": "Abdur-Rahman bin Abi-Bakrah meriwayatkan daripada bapanya",
        "english_text": "Abdur-Rahman bin Abi-Bakrah narrated from his father that a man said: O Messenger of Allah! Which of the people is the best? He said: He whose life is long and his deeds are good. He said: Then which of the people is the worst? He said: He whose life is long and his deeds are bad.",
        "malay_translation": "Abdur-Rahman bin Abi-Bakrah meriwayatkan daripada bapanya bahawa seorang lelaki berkata: Wahai Rasulullah! Siapakah orang yang paling baik? Baginda bersabda: Orang yang panjang umurnya dan baik amalannya. Lelaki itu berkata: Kemudian siapakah orang yang paling buruk? Baginda bersabda: Orang yang panjang umurnya dan buruk amalannya.",
        "arabic_text": "حَدَّثَنَا أَبُو حَفْصٍ عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا شُعْبَةُ، عَنْ عَلِيِّ بْنِ زَيْدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، أَنَّ رَجُلًا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏أَيُّ النَّاسِ خَيْرٌ ؟ قَالَ:‏‏‏‏ مَنْ طَالَ عُمُرُهُ وَحَسُنَ عَمَلُهُ قَالَ:‏‏‏‏ فَأَيُّ النَّاسِ شَرٌّ ؟ قَالَ:‏‏‏‏ مَنْ طَالَ عُمُرُهُ وَسَاءَ عَمَلُهُ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17455,
        "hadith_number": "2331",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Jangka Hayat Umat Muhammad",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said: The lifespan for my Ummah is from sixty years to seventy [years].",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Jangka hayat bagi umatku adalah antara enam puluh tahun hingga tujuh puluh tahun.",
        "arabic_text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ رَبِيعَةَ، عَنْ كَامِلٍ أَبِي الْعَلَاءِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ عُمْرُ أُمَّتِي مِنْ سِتِّينَ سَنَةً إِلَى سَبْعِينَ سَنَةً ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ حَدِيثِ أَبِي صَالِحٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ أَبِي هُرَيْرَةَ."
      },
      {
        "id": 17456,
        "hadith_number": "2332",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Tanda-tanda Kiamat: Masa Menjadi Singkat",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "Anas bin Malik narrated that the Allah's Messenger (s.a.w) said: The hour shall not be established until time is constricted, and the year is like a month, a month is like the week, and the week is like the day, and the day is like the hour, and the hour is like the flare of the fire.",
        "malay_translation": "Anas bin Malik meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Kiamat tidak akan terjadi sehingga masa menjadi singkat, dan setahun terasa seperti sebulan, sebulan terasa seperti seminggu, seminggu terasa seperti sehari, sehari terasa seperti sejam, dan sejam terasa seperti nyalaan api.",
        "arabic_text": "حَدَّثَنَا عَبَّاسُ بْنُ مُحَمَّدٍ الدُّورِيُّ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ الْعُمَرِيُّ، عَنْ سَعْدِ بْنِ سَعِيدٍ الْأَنْصَارِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تَقُومُ السَّاعَةُ حَتَّى يَتَقَارَبَ الزَّمَانُ فَتَكُونُ السَّنَةُ كَالشَّهْرِ، ‏‏‏‏‏‏وَالشَّهْرُ كَالْجُمُعَةِ، ‏‏‏‏‏‏وَتَكُونُ الْجُمُعَةُ كَالْيَوْمِ، ‏‏‏‏‏‏وَيَكُونُ الْيَوْمُ كَالسَّاعَةِ، ‏‏‏‏‏‏وَتَكُونُ السَّاعَةُ كَالضَّرَمَةِ بِالنَّارِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَسَعْدُ بْنُ سَعِيدٍ هُوَ أَخُو يَحْيَى بْنِ سَعِيدٍ الأَنْصَارِيِّ."
      },
      {
        "id": 17457,
        "hadith_number": "2333",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Jadilah Orang Asing di Dunia",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Mujahid narrated that Ibn 'Umar said: The Messenger of Allah (s.a.w) grabbed me on part of my body and said: 'Be in the world like a stranger or a passerby, and count yourself among the inhabitants of the grave.' Ibn 'Umar said to me: When you wake up in the morning, then do not concern yourself with the evening. And when you reach the evening, then do not concern yourself with the morning. Take from your health before your illness, and from your life before your death, for indeed O slave of Allah! You do not know what your description shall be tomorrow. (sahih)",
        "malay_translation": "Mujahid meriwayatkan bahawa Ibn 'Umar berkata: Rasulullah (s.a.w) memegang bahagian tubuhku dan bersabda: 'Jadilah engkau di dunia ini seperti orang asing atau musafir, dan hitunglah dirimu termasuk dalam kalangan penghuni kubur.' Ibn 'Umar berkata kepadaku: Apabila engkau bangun pagi, janganlah engkau memikirkan tentang petang. Dan apabila engkau sampai waktu petang, janganlah engkau memikirkan tentang pagi. Ambillah daripada kesihatanmu sebelum sakitmu, dan daripada hidupmu sebelum matimu, kerana sesungguhnya wahai hamba Allah! Engkau tidak tahu bagaimana keadaanmu esok hari. (sahih)",
        "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو أَحْمَدَ، حَدَّثَنَا سُفْيَانُ، عَنْ لَيْثٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عُمَرَ، قَالَ:‏‏‏‏ أَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِبَعْضِ جَسَدِي بِمِنْكَبِي، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ كُنْ فِي الدُّنْيَا كَأَنَّكَ غَرِيبٌ أَوْ عَابِرُ سَبِيلٍ، ‏‏‏‏‏‏وَعُدَّ نَفْسَكَ فِي أَهْلِ الْقُبُورِ ، ‏‏‏‏‏‏فَقَالَ لِي ابْنُ عُمَرَ:‏‏‏‏ إِذَا أَصْبَحْتَ فَلَا تُحَدِّثْ نَفْسَكَ بِالْمَسَاءِ، ‏‏‏‏‏‏وَإِذَا أَمْسَيْتَ فَلَا تُحَدِّثْ نَفْسَكَ بِالصَّبَاحِ، ‏‏‏‏‏‏وَخُذْ مِنْ صِحَّتِكَ قَبْلَ سَقَمِكَ، ‏‏‏‏‏‏وَمِنْ حَيَاتِكَ قَبْلَ مَوْتِكَ، ‏‏‏‏‏‏فَإِنَّكَ لَا تَدْرِي يَا عَبْدَ اللَّهِ مَا اسْمُكَ غَدًا، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَقَدْ رَوَى هَذَا الْحَدِيثَ الْأَعْمَشُ، عَنْ مُجَاهِدٍ، عَنْ ابْنِ عُمَرَ، نَحْوَهُ."
      },
      {
        "id": 17458,
        "hadith_number": "2334",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Kehidupan dan Batasan Usia Manusia",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "The Prophet (ﷺ) said: \"This is the son of Adam, and this is his life-span.\" He placed his hand on his nape, then he stretched it out and said: \"Then his hope, then his hope, then his hope.\" ",
        "malay_translation": "Rasulullah ﷺ bersabda: \"Inilah anak Adam, dan inilah jangka hayatnya.\" Baginda meletakkan tangan di tengkuknya, kemudian baginda menghulurkannya dan bersabda: \"Kemudian harapannya, kemudian harapannya, kemudian harapannya.\"",
        "arabic_text": "حدثنا سويد بن نصر اخبرنا عبد الله بن المبارك عن حماد بن سلمة عن عبيد الله بن ابي بكر بن انس عن انس بن مالك قال:‏‏‏‏ قال رسول الله صلى الله عليه وسلم:‏‏‏‏ هذا ابن آدم وهذا اجله ووضع يده عند قفاه ثم بسطها فقال:‏‏‏‏ وثم امله وثم امله وثم امله قال ابو عيسى:‏‏‏‏ هذا حديث حسن صحيح وفي الباب عن ابي سعيد."
      },
      {
        "id": 17459,
        "hadith_number": "2335",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Kehidupan Dunia Lebih Singkat Daripada Yang Disangka",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Abu As-Safr narrated that 'Abdullah bin 'Amr said: The Messenger of Allah (s.a.w) passed by us while we were repairing a hut of ours, so he said: 'What is this?' We said: It has become weak, so we are repairing it.' He said: 'I do not think but that the matter (of life) is more in fleeting than that.",
        "malay_translation": "Abu As-Safr meriwayatkan bahawa 'Abdullah bin 'Amr berkata: Rasulullah (s.a.w) lalu di hadapan kami ketika kami sedang membaiki pondok kami, lalu baginda bersabda: 'Apa ini?' Kami berkata: 'Ia telah menjadi lemah, jadi kami sedang membaikinya.' Baginda bersabda: 'Aku tidak fikir melainkan bahawa urusan (kehidupan) ini lebih cepat berlalu daripada itu.'",
        "arabic_text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ أَبِي السَّفَرِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ:‏‏‏‏ مَرَّ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ نُعَالِجُ خُصًّا لَنَا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا هَذَا ؟ فَقُلْنَا:‏‏‏‏ قَدْ وَهَى فَنَحْنُ نُصْلِحُهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَا أَرَى الْأَمْرَ إِلَّا أَعْجَلَ مِنْ ذَلِكَ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَأَبُو السَّفَرِ اسْمُهُ سَعِيدُ بْنُ يُحْمِدَ، ‏‏‏‏‏‏وَيُقَالُ:‏‏‏‏ ابْنُ أَحْمَدَ الثَّوْرِيُّ."
      },
      {
        "id": 17460,
        "hadith_number": "2336",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Fitnah Umat: Harta",
        "perawi_melayu": "Kabb bin 'Ayyad (RA)",
        "english_text": "The Prophet (peace and blessings of Allah be upon him) said: 'Every nation has a trial, and the trial of my nation is wealth.'",
        "malay_translation": "Nabi (sallallahu 'alaihi wa sallam) bersabda: \"Setiap umat mempunyai fitnah, dan fitnah umatku adalah harta.\" (Kabb bin 'Ayyad (RA) berkata: Aku mendengar daripada Nabi s.a.w.)",
        "arabic_text": "حدثنا احمد بن منيع حدثنا الحسن بن سوار حدثنا ليث بن سعد عن معاوية بن صالح ان عبد الرحمن بن جبير بن نفير حدثه عن ابيه عن كعب بن عياض قال:‏‏‏‏ سمعت النبي صلى الله عليه وسلم يقول:‏‏‏‏ إن لكل امة فتنة وفتنة امتي المال قال ابو عيسى:‏‏‏‏ هذا حديث حسن صحيح غريب إنما نعرفه من حديث معاوية بن صالح."
      },
      {
        "id": 17461,
        "hadith_number": "2337",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Ketamakan Manusia Terhadap Harta dan Keutamaan Taubat",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "Anas bin Malik narrated that the Messenger of Allah said: If the Son of Adam had a valley of gold, then he would still like to have a second . And nothing fills his mouth but dust, Allah turns to whoever repents.",
        "malay_translation": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda: \"Jika anak Adam memiliki lembah emas, dia pasti masih ingin memiliki yang kedua. Dan tidak ada yang dapat memenuhi mulutnya melainkan tanah (kubur), namun Allah menerima taubat sesiapa yang bertaubat.\"",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي زِيَادٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنْ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَوْ كَانَ لِابْنِ آدَمَ وَادِيًا مِنْ ذَهَبٍ لَأَحَبَّ أَنْ يَكُونَ لَهُ ثَانِيًا، ‏‏‏‏‏‏وَلَا يَمْلَأُ فَاهُ إِلَّا التُّرَابُ، ‏‏‏‏‏‏وَيَتُوبُ اللَّهُ عَلَى مَنْ تَابَ ، ‏‏‏‏‏‏وَفِي الْبَابِ عَنْ أُبَيِّ بْنِ كَعْبٍ، ‏‏‏‏‏‏وَأَبِي سَعِيدٍ، ‏‏‏‏‏‏وَعَائِشَةَ، ‏‏‏‏‏‏وَابْنِ الزُّبَيْرِ، ‏‏‏‏‏‏وَأَبِي وَاقِدٍ، ‏‏‏‏‏‏وَجَابِرٍ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ."
      },
      {
        "id": 17462,
        "hadith_number": "2338",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Cinta Orang Tua Kepada Umur Panjang dan Harta",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah narrated that the Prophet (s.a.w) said: The heart of an old man remains young because of love for two things: Long life , and much wealth.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Nabi (s.a.w) bersabda: Hati seorang lelaki tua tetap muda kerana cinta kepada dua perkara: Umur yang panjang, dan harta yang banyak.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ عَجْلَانَ، عَنِ الْقَعْقَاعِ بْنِ حَكِيمٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ قَلْبُ الشَّيْخِ شَابٌّ عَلَى حُبِّ اثْنَتَيْنِ:‏‏‏‏ طُولُ الْحَيَاةِ وَكَثْرَةُ الْمَالِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17463,
        "hadith_number": "2339",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Dua Perkara yang Mengekalkan Kemudaan Walaupun Anak Adam Menjadi Tua",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Anas bin Malik narrated that the Prophet (s.a.w) said: The Son Of Adan grows old, but two things keep him young: Desire for life and desire for wealth.",
        "malay_translation": "Anas bin Malik meriwayatkan bahawa Nabi (s.a.w) bersabda: Anak Adam menjadi tua, tetapi dua perkara mengekalkannya muda: Keinginan untuk hidup dan keinginan untuk kekayaan.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ يَهْرَمُ ابْنُ آدَمَ وَيَشِبُّ مِنْهُ اثْنَتَانِ:‏‏‏‏ الْحِرْصُ عَلَى الْعُمُرِ، ‏‏‏‏‏‏وَالْحِرْصُ عَلَى الْمَالِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ"
      },
      {
        "id": 17464,
        "hadith_number": "2340",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Hakikat Zuhud di Dunia",
        "perawi_melayu": "Abu Dharr",
        "english_text": "Abu Dharr narrated that the Prophet (s.a.w) said: Abstinence in the world is not by prohibiting (oneself) the lawful nor by neglecting wealth , but abstinence in the world is that you not hold more firmly to what is in your hand than to what is in the hand of Allah, and that you be more hopeful of the rewards that come with an affliction that you may suffer if it remain with you.",
        "malay_translation": "Daripada Abu Dharr RA meriwayatkan bahawa Nabi SAW bersabda: Zuhud di dunia bukanlah dengan mengharamkan (diri sendiri) dari yang halal atau dengan mengabaikan harta, tetapi zuhud di dunia adalah engkau tidak lebih yakin terhadap apa yang ada di tanganmu daripada apa yang ada di tangan Allah, dan engkau lebih mengharapkan pahala yang datang bersama musibah yang mungkin menimpamu jika ia tetap bersamamu.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ، حَدَّثَنَا عَمْرُو بْنُ وَاقِدٍ، حَدَّثَنَا يُونُسُ بْنُ حَلْبَسٍ، عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ، عَنْ أَبِي ذَرٍّ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ الزَّهَادَةُ فِي الدُّنْيَا لَيْسَتْ بِتَحْرِيمِ الْحَلَالِ وَلَا إِضَاعَةِ الْمَالِ، ‏‏‏‏‏‏وَلَكِنَّ الزَّهَادَةَ فِي الدُّنْيَا أَنْ لَا تَكُونَ بِمَا فِي يَدَيْكَ أَوْثَقَ مِمَّا فِي يَدَيِ اللَّهِ، ‏‏‏‏‏‏وَأَنْ تَكُونَ فِي ثَوَابِ الْمُصِيبَةِ إِذَا أَنْتَ أُصِبْتَ بِهَا أَرْغَبَ فِيهَا لَوْ أَنَّهَا أُبْقِيَتْ لَكَ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَأَبُو إِدْرِيسَ الْخَوْلَانِيُّ اسْمُهُ عَائِذُ اللَّهِ بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏وَعَمْرُو بْنُ وَاقِدٍ مُنْكَرُ الْحَدِيثِ."
      },
      {
        "id": 17465,
        "hadith_number": "2341",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keperluan Asas Anak Adam",
        "perawi_melayu": "Uthman bin 'Affan",
        "english_text": "Uthman bin 'Affan narrated that the Prophet (s.a.w) said: There is no right for the son of Adam in other than these things: A house which he lives in, a garment which covers his nakedness, and Jilf (a piece of bread) and water.",
        "malay_translation": "Uthman bin 'Affan meriwayatkan bahawa Nabi (s.a.w) bersabda: Tidak ada hak bagi anak Adam selain daripada perkara-perkara ini: Sebuah rumah yang dia tinggal di dalamnya, pakaian yang menutup auratnya, dan Jilf (sekeping roti kering) dan air.",
        "arabic_text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنَا حُرَيْثُ بْنُ السَّائِبِ، قَال:‏‏‏‏ سَمِعْتُ الْحَسَنَ،‏‏‏‏ يَقُولُ:‏‏‏‏ حَدَّثَنِي حُمْرَانُ بْنُ أَبَانَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَيْسَ لِابْنِ آدَمَ حَقٌّ فِي سِوَى هَذِهِ الْخِصَالِ بَيْتٌ يَسْكُنُهُ، ‏‏‏‏‏‏وَثَوْبٌ يُوَارِي عَوْرَتَهُ، ‏‏‏‏‏‏وَجِلْفُ الْخُبْزِ وَالْمَاءِ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَهُوَ حَدِيثُ الْحُرَيْثِ بْنِ السَّائِبِ، ‏‏‏‏‏‏وَسَمِعْتُ أَبَا دَاوُدَ سُلَيْمَانَ بْنَ سَلْمٍ الْبَلْخِيَّ يَقُولُ:‏‏‏‏ قَالَ النَّضْرُ بْنُ شُمَيْلٍ:‏‏‏‏ جِلْفُ الْخُبْزِ يَعْنِي:‏‏‏‏ لَيْسَ مَعَهُ إِدَامٌ."
      },
      {
        "id": 17466,
        "hadith_number": "2342",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Hakikat Harta Manusia",
        "perawi_melayu": "Tiada Perawi Disebutkan",
        "english_text": "Mutarrif narrated from his father, that he met up with the Prophet (s.a.w) while he was saying: The mutual increase diverts you . He (s.a.w) said: The son of Adam says:'My wealth, my wealth, but is there something for you from your wealth besides what you give in charity that remains, or you eat which perishes, or what you wear that grows worn?",
        "malay_translation": "Mutarrif meriwayatkan daripada ayahnya, bahawa dia bertemu dengan Nabi (s.a.w) ketika baginda bersabda: 'Berlumba-lumba untuk menambahkan harta benda telah melalaikan kamu.' Baginda (s.a.w) bersabda: 'Anak Adam berkata: 'Hartaku, hartaku,' tetapi adakah sesuatu untukmu dari hartamu selain apa yang kamu berikan sebagai sedekah yang kekal, atau apa yang kamu makan yang binasa, atau apa yang kamu pakai yang menjadi usang?'",
        "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ مُطَرِّفٍ، عَنْ أَبِيهِ، أَنَّهُ انْتَهَى إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَقُولُ:‏‏‏‏ أَلْهَاكُمُ التَّكَاثُرُ سورة التكاثر آية 1،‏‏‏‏ قَالَ:‏‏‏‏ يَقُولُ ابْنُ آدَمَ:‏‏‏‏ مَالِي مَالِي، ‏‏‏‏‏‏وَهَلْ لَكَ مِنْ مَالِكَ إِلَّا مَا تَصَدَّقْتَ فَأَمْضَيْتَ أَوْ أَكَلْتَ فَأَفْنَيْتَ، ‏‏‏‏‏‏أَوْ لَبِسْتَ فَأَبْلَيْتَ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17467,
        "hadith_number": "2343",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keutamaan Memberi Lebih Harta dan Memulai dengan Tanggungan",
        "perawi_melayu": "Abu Umamah",
        "english_text": "Abu Umamah narrated that the Prophet (s.a.w) said: O son of Adam! If you give your surplus it is better for you, and if you keep it, it is worse for you, but there is no harm with what is sufficient. And begin(the giving) with your dependents, and the upper hand (giving) is better than the lower hand (receiving).",
        "malay_translation": "Abu Umamah meriwayatkan bahawa Nabi (s.a.w) bersabda: Wahai anak Adam! Jika kamu memberikan lebihan hartamu, itu adalah lebih baik bagimu, dan jika kamu menahannya, itu adalah lebih buruk bagimu, tetapi tidak mengapa dengan apa yang mencukupi. Dan mulailah (memberi) dengan orang-orang yang menjadi tanggunganmu, dan tangan yang di atas (memberi) adalah lebih baik daripada tangan yang di bawah (menerima).",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عُمَرُ بْنُ يُونُسَ هُوَ الْيَمَامِيُّ، حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، حَدَّثَنَا شَدَّادُ بْنُ عَبْدِ اللَّهِ، قَال:‏‏‏‏ سَمِعْتُ أَبَا أُمَامَةَ،‏‏‏‏ يَقُولُ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَا ابْنَ آدَمَ،‏‏‏‏ إِنَّكَ إِنْ تَبْذُلِ الْفَضْلَ خَيْرٌ لَكَ، ‏‏‏‏‏‏وَإِنْ تُمْسِكْهُ شَرٌّ لَكَ، ‏‏‏‏‏‏وَلَا تُلَامُ عَلَى كَفَافٍ، ‏‏‏‏‏‏وَابْدَأْ بِمَنْ تَعُولُ، ‏‏‏‏‏‏وَالْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَشَدَّادُ بْنُ عَبْدِ اللَّهِ يُكْنَى:‏‏‏‏ أَبَا عَمَّارٍ."
      },
      {
        "id": 17468,
        "hadith_number": "2344",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keutamaan Tawakal yang Sebenar kepada Allah dan Rezeki Seperti Burung",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Umar bin Al-Khattab narrated that the Messenger of Allah (s.a.w) said: If you were to rely upon Allah with the required reliance, then He would provide for you just as a bird is provided for, it goes out in the morning empty, and returns full.",
        "malay_translation": "Umar bin Al-Khattab meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Sekiranya kamu bertawakal kepada Allah dengan tawakal yang sebenar-benarnya, nescaya Allah akan memberikan rezeki kepadamu sebagaimana burung diberi rezeki; ia keluar pagi dalam keadaan lapar dan kembali petang dalam keadaan kenyang.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ سَعِيدٍ الْكِنْدِيُّ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، عَنْ حَيْوَةَ بْنِ شُرَيْحٍ، عَنْ بَكْرِ بْنِ عَمْرٍو، عَنْ عَبْدِ اللَّهِ بْنِ هُبَيْرَةَ، عَنْ أَبِي تَمِيمٍ الْجَيْشَانِيِّ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَوْ أَنَّكُمْ كُنْتُمْ تَوَكَّلُونَ عَلَى اللَّهِ حَقَّ تَوَكُّلِهِ، ‏‏‏‏‏‏لَرُزِقْتُمْ كَمَا تُرْزَقُ الطَّيْرُ تَغْدُو خِمَاصًا وَتَرُوحُ بِطَانًا ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَأَبُو تَمِيمٍ الْجَيْشَانِيُّ اسْمُهُ:‏‏‏‏ عَبْدُ اللَّهِ بْنُ مَالِكٍ."
      },
      {
        "id": 17469,
        "hadith_number": "2345",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Rezeki Mungkin Diperoleh Kerana Orang Lain",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Anas bin Malik narrated: There were two brothers during the time of the Messenger of Allah (s.a.w). One of them used to come to the prophet (s.a.w), and the other had some business. The businessman among them complained to the Prophet (s.a.w) about his brother, so he said:'Perhaps you are provided for because of him.'",
        "malay_translation": "Anas bin Malik meriwayatkan: Ada dua orang saudara lelaki pada zaman Rasulullah (s.a.w). Salah seorang daripada mereka selalu datang kepada Nabi (s.a.w), dan yang seorang lagi mempunyai urusan perniagaan. Pengusaha di antara mereka mengadu kepada Nabi (s.a.w) tentang saudaranya, lalu baginda bersabda: 'Barangkali kamu diberikan rezeki kerana dia.'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ:‏‏‏‏ كَانَ أَخَوَانِ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَكَانَ أَحَدُهُمَا يَأْتِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَالْآخَرُ يَحْتَرِفُ، ‏‏‏‏‏‏فَشَكَا الْمُحْتَرِفُ أَخَاهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ لَعَلَّكَ تُرْزَقُ بِهِ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17470,
        "hadith_number": "2346",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Nikmat Bangun Pagi dengan Keamanan, Kesihatan dan Rezeki",
        "perawi_melayu": "Salamah bin 'Ubaidullah bin Mihsan Al-Khatmi",
        "english_text": "Salamah bin 'Ubaidullah bin Mihsan Al-Khatmi narrated from his father -and he was a Companion- who said: The Messenger of Allah (s.a.w) said: Whoever among you wakes up in the morning secured in his dwelling, healthy in his body, having his food for the day,then it is as if the world has been gathered for him.'",
        "malay_translation": "Salamah bin 'Ubaidullah bin Mihsan Al-Khatmi meriwayatkan daripada bapanya - dan beliau adalah seorang Sahabat - yang berkata: Rasulullah (s.a.w) bersabda: Sesiapa di antara kamu yang bangun pada waktu pagi dalam keadaan aman di tempat tinggalnya, sihat tubuh badannya, mempunyai makanan untuk hari itu, maka seolah-olah dunia telah dikumpulkan untuknya.'",
        "arabic_text": "حَدَّثَنَا عَمْرُو بْنُ مَالِكٍ، وَمَحْمُودُ بْنُ خِدَاشٍ الْبَغْدَادِيُّ،‏‏‏‏ قَالَا:‏‏‏‏ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي شُمَيْلَةَ الْأَنْصَارِيُّ، عَنْ سَلَمَةَ بْنِ عُبَيْدِ اللَّهِ بْنِ مِحْصَنٍ الْخَطْمِيِّ، عَنْ أَبِيهِ، وَكَانَتْ لَهُ صُحْبَةٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ أَصْبَحَ مِنْكُمْ آمِنًا فِي سِرْبِهِ، ‏‏‏‏‏‏مُعَافًى فِي جَسَدِهِ، ‏‏‏‏‏‏عِنْدَهُ قُوتُ يَوْمِهِ، ‏‏‏‏‏‏فَكَأَنَّمَا حِيزَتْ لَهُ الدُّنْيَا ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ مَرْوَانَ بْنِ مُعَاوِيَةَ، ‏‏‏‏‏‏وَحِيزَتْ:‏‏‏‏ جُمِعَتْ."
      },
      {
        "id": 17471,
        "hadith_number": "2347",
        "status": "sahih",
        "nama_buku": "Jami' al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keutamaan Kehidupan Sederhana dan Ibadah yang Khusyuk",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Abu Umamah narrated that the Prophet (s.a.w) said: Indeed the best of my friends to me is the one of meager conditions, whose share is in Salat, worshipping his Lord well and obeying him (even) in private. He is obscure among the people such that the fingers are not pointed towards him. His provisions are only what is sufficient and he is patient with that. Then he tapped with his fingers and said: His death comes quickly, his mourners are few, and his inheritance is little. With this (the above), chain it is narrated that the Prophet (s.a.w) said: My Lord presented to me, that He would make the valley of Makkah into gold for me, I said: 'No O Lord! But being filled for a day and hungry for a day -or he said: three days or something like that- So when I am hungry, I would beseech You and remember You, and when I am full I would be grateful to You and praise You.",
        "malay_translation": "Abu Umamah meriwayatkan bahawa Nabi (s.a.w) bersabda: Sesungguhnya sebaik-baik sahabatku di sisiKu adalah orang yang keadaannya sederhana, yang bahagiannya adalah dalam solat, beribadah kepada Tuhannya dengan baik dan mentaati-Nya (bahkan) secara tersembunyi. Dia tidak dikenali di kalangan manusia sehingga jari-jari tidak menunjuk ke arahnya. Rezekinya hanya sekadar mencukupi dan dia bersabar dengan itu. Kemudian baginda mengetuk dengan jari-jarinya dan bersabda: Kematiannya datang dengan cepat, orang yang berkabung untuknya sedikit, dan warisannya kecil. Dengan (sanad) ini diriwayatkan bahawa Nabi (s.a.w) bersabda: Tuhanku mempersembahkan kepadaku, bahawa Dia akan menjadikan lembah Makkah menjadi emas untukku, aku berkata: 'Tidak ya Tuhanku! Tetapi kenyang sehari dan lapar sehari -atau baginda bersabda: tiga hari atau seperti itu- Maka apabila aku lapar, aku akan memohon kepada-Mu dan mengingati-Mu, dan apabila aku kenyang aku akan bersyukur kepada-Mu dan memuji-Mu.'",
        "arabic_text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى بْنِ أَيُّوبَ، عَنْ عُبَيْدِ اللَّهِ بْنِ زَحْرٍ، عَنْ عَلِيِّ بْنِ يَزِيدَ، عَنْ الْقَاسِمِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ أَبِي أُمَامَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِنَّ أَغْبَطَ أَوْلِيَائِي عِنْدِي لَمُؤْمِنٌ خَفِيفُ الْحَاذِ ذُو حَظٍّ مِنَ الصَّلَاةِ أَحْسَنَ عِبَادَةَ رَبِّهِ وَأَطَاعَهُ فِي السِّرِّ وَكَانَ غَامِضًا فِي النَّاسِ لَا يُشَارُ إِلَيْهِ بِالْأَصَابِعِ وَكَانَ رِزْقُهُ كَفَافًا فَصَبَرَ عَلَى ذَلِكَ ثُمَّ نَفَضَ بِيَدِهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ عُجِّلَتْ مَنِيَّتُهُ قَلَّتْ بَوَاكِيهِ قَلَّ تُرَاثُهُ ."
      },
      {
        "id": 17472,
        "hadith_number": "2348",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Kejayaan dalam Islam, Kecukupan, dan Keredhaan Allah",
        "perawi_melayu": "Diriwayatkan oleh Abdullah bin 'Amr",
        "english_text": "Abdullah bin 'Amr narrated that the Messenger of Allah (s.a.w) said: He has succeeded who accepts Islam, and is provided with what is sufficient and is made content by Allah.",
        "malay_translation": "Abdullah bin 'Amr meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Berjayalah orang yang menerima Islam, dan dikurniakan rezeki yang mencukupi dan dijadikan redha oleh Allah.",
        "arabic_text": "حَدَّثَنَا الْعَبَّاسُ الدُّورِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ، عَنْ شُرَحْبِيلَ بْنِ شَرِيكٍ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ قَدْ أَفْلَحَ مَنْ أَسْلَمَ وَكَانَ رِزْقُهُ كَفَافًا وَقَنَّعَهُ اللَّهُ ،‏‏‏‏ قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17473,
        "hadith_number": "2349",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Berita Gembira bagi Muslim yang Mendapat Hidayah, Rezeki yang Mencukupi dan Kepuasan",
        "perawi_melayu": "Fadalah bin 'Ubaid",
        "english_text": "Fadalah bin 'Ubaid narrated that he heard the Messenger of Allah (s.a.w) saying: Glad tidings to whoever is guided to Islam, his livelihood was sufficient and he was satisfied.",
        "malay_translation": "Fadalah bin 'Ubaid meriwayatkan bahawa beliau mendengar Rasulullah (s.a.w) bersabda: Berita gembira bagi sesiapa yang diberi hidayah kepada Islam, rezekinya mencukupi dan dia berasa puas.",
        "arabic_text": "حَدَّثَنَا الْعَبَّاسُ الدُّورِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ، أَخْبَرَنَا حَيْوَةُ بْنُ شُرَيْحٍ، أَخْبَرَنِي أَبُو هَانِئٍ الْخَوْلَانِيُّ، أَنَّ أَبَا عَلِيٍّ عَمْرَو بْنَ مَالِكٍ الْجَنْبِيَّ أَخْبَرَهُ، ‏‏‏‏‏‏عَنْ فَضَالَةَ بْنِ عُبَيْدٍ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ طُوبَى لِمَنْ هُدِيَ إِلَى الْإِسْلَامِ وَكَانَ عَيْشُهُ كَفَافًا وَقَنَعَ ،‏‏‏‏ قَالَ:‏‏‏‏ وَأَبُو هَانِئٍ اسْمُهُ:‏‏‏‏ حُمَيْدُ بْنُ هَانِئٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17474,
        "hadith_number": "2350",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Anjuran Bersedia Menghadapi Kefakiran Bagi Pencinta Nabi",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Abdullah bin Maghaffal said: A man said to the Prophet (s.a.w): 'O Messenger of Allah! By Allah! Indeed I love you!' So he said: 'Consider what you say.' He said: 'By Allah! I indeed love you!' Three times. He said: 'If you do love me, then prepare and arm yourself against poverty. For indeed poverty comes faster upon whoever loves me than the flood to its destination.'",
        "malay_translation": "Abdullah bin Maghaffal berkata: Seorang lelaki berkata kepada Nabi (SAW): 'Wahai Rasulullah! Demi Allah! Sesungguhnya aku mencintaimu!' Maka baginda bersabda: 'Pertimbangkan apa yang kamu katakan.' Dia berkata: 'Demi Allah! Sesungguhnya aku mencintaimu!' Sebanyak tiga kali. Baginda bersabda: 'Jika kamu benar-benar mencintaiku, maka bersiap sedialah dan persenjatai dirimu untuk menghadapi kemiskinan. Sesungguhnya kemiskinan datang lebih cepat kepada siapa pun yang mencintaiku daripada banjir ke tempat tujuannya.'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ نَبْهَانَ بْنِ صَفْوَانَ الثَّقَفِيُّ الْبَصْرِيُّ، حَدَّثَنَا رَوْحُ بْنُ أَسْلَمَ، حَدَّثَنَا شَدَّادٌ أَبُو طَلْحَةَ الرَّاسِبِيُّ، عَنْ أَبِي الْوَازِعِ، عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ، قَالَ:‏‏‏‏ قَالَ رَجُلٌ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَا رَسُولَ اللَّهِ وَاللَّهِ إِنِّي لَأُحِبُّكَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ انْظُرْ مَاذَا تَقُولُ ؟ قَالَ:‏‏‏‏ وَاللَّهِ إِنِّي لَأُحِبُّكَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ انْظُرْ مَاذَا تَقُولُ ؟ قَالَ:‏‏‏‏ وَاللَّهِ إِنِّي لَأُحِبُّكَ،‏‏‏‏ ثَلَاثَ مَرَّاتٍ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنْ كُنْتَ تُحِبُّنِي فَأَعِدَّ لِلْفَقْرِ تِجْفَافًا،‏‏‏‏ فَإِنَّ الْفَقْرَ أَسْرَعُ إِلَى مَنْ يُحِبُّنِي مِنَ السَّيْلِ إِلَى مُنْتَهَاهُ ."
      },
      {
        "id": 17475,
        "hadith_number": "2351",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keutamaan Golongan Muhajirin Miskin Memasuki Syurga Lebih Awal",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Abu Sa'eed narrated that the Messenger of Allah (s.a.w) said: The poor Muhajirin will enter Paradise before the rich among them by five hundred years.",
        "malay_translation": "Abu Sa'eed meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Golongan Muhajirin yang miskin akan memasuki Syurga sebelum golongan kaya di antara mereka dengan lima ratus tahun.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى الْبَصْرِيُّ، حَدَّثَنَا زِيَادُ بْنُ عَبْدِ اللَّهِ، عَنِ الْأَعْمَشِ، عَنْ عَطِيَّةَ، عَنْ أَبِي سَعِيدٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ فُقَرَاءُ الْمُهَاجِرِينَ يَدْخُلُونَ الْجَنَّةَ قَبْلَ أَغْنِيَائِهِمْ بِخَمْسِ مِائَةِ سَنَةٍ ،‏‏‏‏ وفي الباب عن أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَعَبْدِ اللَّهِ بْنِ عَمْرٍو، ‏‏‏‏‏‏وَجَابِرٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ."
      },
      {
        "id": 17476,
        "hadith_number": "2352",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keutamaan Hidup Bersama Golongan Miskin",
        "perawi_melayu": "Anas",
        "english_text": "Anas narrated that the Messenger of Allah (s.a.w) said: O Allah! Cause me to live needy, and cause me to die needy and gather me in the group of the needy on the Day of Resurrection. 'Aishah said: Why O Messenger of Allah? He said: Indeed they enter Paradise before their rich by forty autumns. O 'Aishah! Do not turn away the needy even if with a piece of date. O 'Aishah! Love the needy and be near them, for indeed Allah will make you near on the Day of Judgement.",
        "malay_translation": "Anas meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Ya Allah! Hidupkanlah aku dalam keadaan miskin, matikanlah aku dalam keadaan miskin, dan kumpulkanlah aku dalam golongan orang-orang miskin pada Hari Kiamat. Aisyah bertanya: Mengapa wahai Rasulullah? Baginda bersabda: Sesungguhnya mereka masuk Syurga sebelum orang-orang kaya dengan empat puluh musim luruh. Wahai Aisyah! Janganlah menolak orang miskin walaupun dengan sebiji kurma. Wahai Aisyah! Cintailah orang miskin dan dekatilah mereka, kerana sesungguhnya Allah akan mendekatkanmu pada Hari Kiamat.",
        "arabic_text": "حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ وَاصِلٍ الْكُوفِيُّ، حَدَّثَنَا ثَابِتُ بْنُ مُحَمَّدٍ الْعَابِدُ الْكُوفِيُّ، حَدَّثَنَا الْحَارِثُ بْنُ النُّعْمَانِ اللَّيْثِيُّ، عَنْ أَنَسٍ:‏‏‏‏ أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ اللَّهُمَّ أَحْيِنِي مِسْكِينًا وَأَمِتْنِي مِسْكِينًا وَاحْشُرْنِي فِي زُمْرَةِ الْمَسَاكِينِ يَوْمَ الْقِيَامَةِ ،‏‏‏‏ فَقَالَتْ عَائِشَةُ:‏‏‏‏ لِمَ يَا رَسُولَ اللَّهِ ؟ قَالَ:‏‏‏‏ إِنَّهُمْ يَدْخُلُونَ الْجَنَّةَ قَبْلَ أَغْنِيَائِهِمْ بِأَرْبَعِينَ خَرِيفًا، ‏‏‏‏‏‏يَا عَائِشَةُ لَا تَرُدِّي الْمِسْكِينَ وَلَوْ بِشِقِّ تَمْرَةٍ، ‏‏‏‏‏‏يَا عَائِشَةُ أَحِبِّي الْمَسَاكِينَ وَقَرِّبِيهِمْ فَإِنَّ اللَّهَ يُقَرِّبُكِ يَوْمَ الْقِيَامَةِ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ."
      },
      {
        "id": 17477,
        "hadith_number": "2353",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keutamaan Orang Miskin Masuk Syurga Lebih Awal",
        "perawi_melayu": "Tidak diketahui",
        "english_text": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said: The poor are admitted into Paradise before the rich, by five hundres years, (i.e.) half a day.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Orang miskin akan masuk Syurga sebelum orang kaya, dengan (beza) lima ratus tahun, (iaitu) setengah hari.",
        "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَدْخُلُ الْفُقَرَاءُ الْجَنَّةَ قَبْلَ الْأَغْنِيَاءِ بِخَمْسِ مِائَةِ عَامٍ نِصْفِ يَوْمٍ ،‏‏‏‏ قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17478,
        "hadith_number": "2354",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keutamaan Orang Miskin Masuk Syurga Lebih Awal",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said: The poor Muslims are admitted into Paradise before their rich by half a day. And that is five hundred years.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Orang Muslim yang miskin akan masuk ke dalam Syurga sebelum orang kaya dengan setengah hari. Dan itu adalah lima ratus tahun.",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا الْمُحَارِبِيُّ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَدْخُلُ فُقَرَاءُ الْمُسْلِمِينَ الْجَنَّةَ قَبْلَ أَغْنِيَائِهِمْ بِنِصْفِ يَوْمٍ وَهُوَ خَمْسُ مِائَةِ عَامٍ ،‏‏‏‏ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17479,
        "hadith_number": "2355",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keutamaan Orang Miskin di Syurga",
        "perawi_melayu": "Jabir bin 'Abdullah",
        "english_text": "Jabir bin 'Abdullah narrated that the Messenger of Allah (s.a.w) said: The poor Muslims are admitted into Paradise before their rich by forty autumns.",
        "malay_translation": "Jabir bin 'Abdullah meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Orang-orang Muslim yang miskin akan masuk syurga sebelum orang-orang kaya mereka selama empat puluh musim luruh.",
        "arabic_text": "حَدَّثَنَا الْعَبَّاسُ الدُّورِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ، عَنْ عَمْرِو بْنِ جَابِرٍ الْحَضْرَمِيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ يَدْخُلُ فُقَرَاءُ الْمُسْلِمِينَ الْجَنَّةَ قَبْلَ أَغْنِيَائِهِمْ بِأَرْبَعِينَ خَرِيفًا ،‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ."
      },
      {
        "id": 17480,
        "hadith_number": "2356",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keadaan Aisyah Apabila Kenyang Makan",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Masruq said: I entered upon 'Aishah and she invited me to eat. She said: 'Whenever I eat my fill of food I want to cry and begin crying.' He said: I said : 'Why?' She said: 'I remember the circumstances under which the Messenger of Allah (s.a.w) parted from the world. By Allah! He would not eat his fill of bread and meat twice in a day.'",
        "malay_translation": "Masruq berkata: Saya masuk menemui Aisyah dan beliau menjemput saya makan. Beliau berkata: 'Setiap kali saya makan hingga kenyang, saya ingin menangis dan mula menangis.' Dia berkata: Saya berkata: 'Mengapa?' Beliau berkata: 'Saya teringat keadaan di mana Rasulullah (s.a.w) meninggalkan dunia ini. Demi Allah! Baginda tidak akan makan roti dan daging hingga kenyang dua kali dalam sehari.'",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ الْمُهَلَّبِي، عَنْ مُجَالِدٍ، عَنِ الشَّعْبِيِّ، عَنْ مَسْرُوقٍ، قَالَ:‏‏‏‏ دَخَلْتُ عَلَى عَائِشَةَ فَدَعَتْ لِي بِطَعَامٍ، ‏‏‏‏‏‏وَقَالَتْ:‏‏‏‏ مَا أَشْبَعُ مِنْ طَعَامٍ فَأَشَاءُ أَنْ أَبْكِيَ إِلَّا بَكَيْتُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ لِمَ ؟ قَالَتْ:‏‏‏‏ أَذْكُرُ الْحَالَ الَّتِي فَارَقَ عَلَيْهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الدُّنْيَا وَاللَّهِ مَا شَبِعَ مِنْ خُبْزٍ وَلَحْمٍ مَرَّتَيْنِ فِي يَوْمٍ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17481,
        "hadith_number": "2357",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Rasulullah Tidak Pernah Kenyang Dua Hari Berturut-turut",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Aishah narrated: The Messenger of Allah (s.a.w) did not eat his fill of barley bread on two consecutive days until he was taken (died).",
        "malay_translation": "Aisyah meriwayatkan: Rasulullah (s.a.w) tidak pernah makan roti barli hingga kenyang selama dua hari berturut-turut sehingga baginda wafat.",
        "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو دَاوُدَ، أَنْبَأَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاق، قَال:‏‏‏‏ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ يَزِيدَ يُحَدِّثُ، ‏‏‏‏‏‏عَنْ الْأَسْوَدِ بْنِ يَزِيدَ، عَنْ عَائِشَةَ، قَالَتْ:‏‏‏‏ مَا شَبِعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ خُبْزِ شَعِيرٍ يَوْمَيْنِ مُتَتَابِعَيْنِ حَتَّى قُبِضَ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وفي الباب عن أَبِي هُرَيْرَةَ."
      },
      {
        "id": 17482,
        "hadith_number": "2358",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Kehidupan Sederhana Rasulullah dan Keluarga",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah narrated: Neither the Messenger of Allah (s.a.w) nor his family, ate their fill of wheat bread for three consecutive days until he parted the world.",
        "malay_translation": "Abu Hurairah meriwayatkan: Rasulullah (s.a.w) dan keluarganya tidak pernah makan roti gandum hingga kenyang selama tiga hari berturut-turut sehingga baginda wafat.",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ العَلاءِ، حَدَّثَنَا الْمُحَارِبِيُّ، حَدَّثَنَا يَزِيدُ بْنُ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ مَا شَبِعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَهْلُهُ ثَلَاثًا تِبَاعًا مِنْ خُبْزِ الْبُرِّ حَتَّى فَارَقَ الدُّنْيَا ،‏‏‏‏ هَذَا حَدِيثٌ صَحِيحٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ."
      },
      {
        "id": 17483,
        "hadith_number": "2359",
        "status": "Sahih",
        "nama_buku": "Jami' At-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Ketiadaan Kelebihan Roti Barli di Rumah Nabi (s.a.w)",
        "perawi_melayu": "Abu Umamah (Semoga Allah merahmatinya)",
        "english_text": "Abu Umamah narrated: There was never a surplus of barley bread for the inhabitants of the house of the Messenger of Allah (s.a.w).",
        "malay_translation": "Abu Umamah meriwayatkan: Tidak pernah ada lebihan roti barli untuk penghuni rumah Rasulullah (s.a.w).",
        "arabic_text": "حَدَّثَنَا عَبَّاسُ بْنُ مُحَمَّدٍ الدُّورِيُّ، حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ، حَدَّثَنَا حَرِيزُ بْنُ عُثْمَانَ، عَنْ سُلَيْمِ بْنِ عَامِرٍ، قَال:‏‏‏‏ سَمِعْتُ أَبَا أُمَامَةَ يَقُولُ:‏‏‏‏ مَا كَانَ يَفْضُلُ عَنْ أَهْلِ بَيْتِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُبْزُ الشَّعِيرِ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَيَحْيَى بْنُ أَبِي بُكَيْرٍ هَذَا كُوفِيٌّ، ‏‏‏‏‏‏وَأَبُو بُكَيْرٍ وَالِدُ يَحْيَى رَوَى لَهُ سُفْيَانُ الثَّوْرِيُّ، ‏‏‏‏‏‏وَيَحْيَى بْنُ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ مِصْرِيٌّ صَاحِبُ اللَّيْثِ."
      },
      {
        "id": 17484,
        "hadith_number": "2360",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Kehidupan Sederhana Rasulullah SAW dan Makanan Keluarga Baginda",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Ibn 'Abbas said: The Messenger of Allah (s.a.w) would spend many consecutive nights and his family did not have supper, and most of the time their bread was barley bread.",
        "malay_translation": "Ibnu Abbas berkata: Rasulullah SAW pernah menghabiskan banyak malam berturut-turut dan keluarganya tidak makan malam, dan kebanyakan waktu roti mereka adalah roti barli.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُعَاوِيَةَ الْجُمَحِيُّ، حَدَّثَنَا ثَابِتُ بْنُ يَزِيدَ، عَنْ هِلَالِ بْنِ خَبَّابٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَبِيتُ اللَّيَالِي الْمُتَتَابِعَةَ طَاوِيًا وَأَهْلُهُ لَا يَجِدُونَ عَشَاءً وَكَانَ أَكْثَرُ خُبْزِهِمْ خُبْزَ الشَّعِيرِ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17485,
        "hadith_number": "2361",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Doa Rasulullah untuk Rezeki Keluarga Muhammad",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah narrated the the Messenger of Allah (s.a.w) said: O Allah! Make the sustenance of Muhammad's family nourishing.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Ya Allah! Jadikanlah rezeki keluarga Muhammad mencukupi.",
        "arabic_text": "حَدَّثَنَا أَبُو عَمَّارٍ، حَدَّثَنَا وَكِيعٌ، عَنِ الْأَعْمَشِ، عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اللَّهُمَّ اجْعَلْ رِزْقَ آلِ مُحَمَّدٍ قُوتًا ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17486,
        "hadith_number": "2362",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Nabi Tidak Menyimpan Bekalan untuk Hari Esok",
        "perawi_melayu": "Anas",
        "english_text": "Anas narrated: The Prophet (s.a.w) would not store anything for the morrow.",
        "malay_translation": "Anas meriwayatkan: Nabi (SAW) tidak akan menyimpan sesuatu untuk keesokan harinya.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَدَّخِرُ شَيْئًا لِغَدٍ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ، ‏‏‏‏‏‏وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ جَعْفَرِ بْنِ سُلَيْمَانَ، ‏‏‏‏‏‏عَنْ ثَابِتٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا."
      },
      {
        "id": 17487,
        "hadith_number": "2363",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Rasulullah SAW Tidak Makan di Atas Meja dan Roti Nipis",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Anas said: The Messenger of Allah (s.a.w) never ate on a table, nor did he eat thin bread until he died.",
        "malay_translation": "Anas berkata: Rasulullah (s.a.w) tidak pernah makan di atas meja, dan tidak juga makan roti nipis sehingga baginda wafat.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، أَخْبَرَنَا أَبُو مَعْمَرٍ عَبْدُ اللَّهِ بْنُ عَمْرٍو، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ:‏‏‏‏ مَا أَكَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى خِوَانٍ، ‏‏‏‏‏‏وَلَا أَكَلَ خُبْزًا مُرَقَّقًا حَتَّى مَاتَ ،‏‏‏‏ قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ حَدِيثِ سَعِيدِ بْنِ أَبِي عَرُوبَةَ."
      },
      {
        "id": 17488,
        "hadith_number": "2364",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Rasulullah SAW Tidak Makan Tepung Halus dan Cara Penyediaan Barli Pada Zaman Dahulu",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Abu Hazin narrated that Sahl bin Sa'd asked: Did the Messenger of Allah (s.a.w) eat Naqi – meaning refined (flour)?” So Sahl said: “The Messenger of Allah (s.a.w) did not see Naqi until he met Allah.” It was said to him: “Did you have sifters during the time of the Messenger of Allah (s.a.w)?” He said: “There were no sifters for us.” They said: “How did you prepare the barley?”He said: “We would blow it so (the husk) would fly off of it, then we would add water so we could knead it.” (Hasan)",
        "malay_translation": "Abu Hazin meriwayatkan bahawa Sahl bin Sa'd bertanya: “Adakah Rasulullah (s.a.w) makan Naqi – bermaksud tepung halus?” Maka Sahl berkata: “Rasulullah (s.a.w) tidak pernah melihat Naqi sehingga baginda bertemu Allah.” Dikatakan kepadanya: “Adakah kamu mempunyai penapis pada zaman Rasulullah (s.a.w)?” Beliau berkata: “Tiada penapis bagi kami.” Mereka berkata: “Bagaimana kamu menyediakan barli?” Beliau berkata: “Kami akan meniupnya supaya (kulitnya) akan terbang daripadanya, kemudian kami akan menambah air supaya kami dapat menguli tepung itu.” (Hasan)",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ الْحَنَفِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ دِينَارٍ، أَخْبَرَنَا أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ،‏‏‏‏ أَنَّهُ قِيلَ لَهُ:‏‏‏‏ أَكَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّقِيَّ يَعْنِي الْحُوَّارَى، ‏‏‏‏‏‏فَقَالَ سَهْلٌ:‏‏‏‏ مَا رَأَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّقِيَّ حَتَّى لَقِيَ اللَّهَ، ‏‏‏‏‏‏فَقِيلَ لَهُ:‏‏‏‏ هَلْ كَانَتْ لَكُمْ مَنَاخِلُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَا كَانَتْ لَنَا مَنَاخِلُ، ‏‏‏‏‏‏قِيلَ:‏‏‏‏ فَكَيْفَ كُنْتُمْ تَصْنَعُونَ بِالشَّعِيرِ ؟ قَالَ:‏‏‏‏ كُنَّا نَنْفُخُهُ فَيَطِيرُ مِنْهُ مَا طَارَ ثُمَّ نُثَرِّيهِ فَنَعْجِنُهُ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدْ رَوَاهُ مَالِكُ بْنُ أَنَسٍ، ‏‏‏‏‏‏عَنْ أَبِي حَازِمٍ."
      },
      {
        "id": 17489,
        "hadith_number": "2365",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Pengorbanan dan Ketabahan Sahabat dalam Perjuangan",
        "perawi_melayu": "Sa'd Bin Abi Waqqas",
        "english_text": "Sa'd Bin Abi Waqqas said: I was among the first men who spilled blood in Allah's cause, and I was among the first men to shoot an arrow in Allah's cause. I saw battles with troops of the Companions of Muhammad (s.a.w). We had nothing to eat except leaves of trees and Al-Hublah, such that one of us would leave droppings like the droppings of sheep and camels. Now Banu Asad have appeared wanting to instruct me in religion, ( then) I would be a loser and have wasted my efforts.",
        "malay_translation": "Sa'd Bin Abi Waqqas berkata: Aku adalah antara lelaki pertama yang menumpahkan darah di jalan Allah, dan aku adalah antara lelaki pertama yang melepaskan anak panah di jalan Allah. Aku menyaksikan peperangan bersama tentera Sahabat Muhammad (s.a.w). Kami tidak mempunyai apa-apa untuk dimakan kecuali daun-daun pokok dan Al-Hublah, sehingga ada di antara kami yang mengeluarkan najis seperti najis kambing dan unta. Sekarang, Banu Asad telah muncul ingin mengajar aku tentang agama, (jika begitu) aku akan menjadi orang yang rugi dan telah mensia-siakan usaha ku.",
        "arabic_text": "حَدَّثَنَا عُمَرُ بْنُ إِسْمَاعِيل بْنِ مُجَالِدِ بْنِ سَعِيدٍ، حَدَّثَنَا أَبِي، عَنْ بَيَانٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، قَال:‏‏‏‏ سَمِعْتُ سَعْدَ بْنَ أَبِي وَقَّاصٍ يَقُولُ:‏‏‏‏ إِنِّي لَأَوَّلُ رَجُلٍ أَهْرَاقَ دَمًا فِي سَبِيلِ اللَّهِ، ‏‏‏‏‏‏وَإِنِّي لَأَوَّلُ رَجُلٍ رَمَى بِسَهْمٍ فِي سَبِيلِ اللَّهِ وَلَقَدْ رَأَيْتُنِي أَغْزُو فِي الْعِصَابَةِ مِنْ أَصْحَابِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا نَأْكُلُ إِلَّا وَرَقَ الشَّجَرِ وَالْحُبُلَةِ حَتَّى إِنَّ أَحَدَنَا لَيَضَعُ كَمَا تَضَعُ الشَّاةُ أَوِ الْبَعِيرُ وَأَصْبَحَتْ بَنُو أَسَدٍ يُعَزِّرُونِي فِي الدِّينِ لَقَدْ خِبْتُ إِذًا وَضَلَّ عَمَلِي ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ حَدِيثِ بَيَانٍ."
      },
      {
        "id": 17490,
        "hadith_number": "2366",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Pengalaman Sa'd Bin Malik dalam Perang dan Keteguhannya dalam Agama",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Sa'd Bin Malik said: I was the first man among the Arabs to shoot an arrow in Allah's cause. I saw that we battled along with the Messenger of Allah(s.a.w) and there was no food for us but Al-Hubla and this Samur, such that one of us would leave droppings like the droppings of a sheep. Then Banu Asad appeared wanting to instruct me in religion. I would be a loser and have wasted my efforts.",
        "malay_translation": "Sa'd Bin Malik berkata: Saya adalah orang Arab pertama yang melepaskan anak panah dalam perjuangan di jalan Allah. Saya melihat bahawa kami berperang bersama Rasulullah (s.a.w) dan tidak ada makanan bagi kami kecuali Al-Hubla dan Samur ini, sehingga salah seorang daripada kami membuang air besar seperti najis kambing. Kemudian Bani Asad muncul ingin mengajar saya tentang agama. Saya akan menjadi orang yang rugi dan sia-sia usaha saya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا إِسْمَاعِيل بْنُ أَبِي خَالِدٍ، حَدَّثَنَا قَيْسٌ، قَال:‏‏‏‏ سَمِعْتُ سَعْدَ بْنَ مَالِكٍ يَقُولُ:‏‏‏‏ إِنِّي أَوَّلُ رَجُلٍ مِنَ الْعَرَبِ رَمَى بِسَهْمٍ فِي سَبِيلِ اللَّهِ،‏‏‏‏ وَلَقَدْ رَأَيْتُنَا نَغْزُو مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا لَنَا طَعَامٌ إِلَّا الْحُبُلَةَ وَهَذَا السَّمُرَ حَتَّى إِنَّ أَحَدَنَا لَيَضَعُ كَمَا تَضَعُ الشَّاةُ ثُمَّ أَصْبَحَتْ بَنُو أَسَدٍ يُعَزِّرُونِي فِي الدِّينِ لَقَدْ خِبْتُ إِذًا وَضَلَّ عَمَلِي ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وفي الباب عن عُتْبَةَ بْنِ غَزْوَانَ."
      },
      {
        "id": 17491,
        "hadith_number": "2367",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Kisah Kelaparan Abu Hurairah",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Muhammad bin Sirin said: We were with Abu Hurarirah and he was wearing two linen garments dyed with red ochre. He blew his nose in one of them and said: 'Excellent! Abu hurairah blows his nose in linens! I saw a time when I would pass out between the mimbar of the Messenger of Allah (s.a.w) and the dwelling of 'Aishah from overwhelming hunger. Someone came and placed his foot on my neck thinking that I was a mad man, but I was not crazy, It was nothing but hunger. (sahih)",
        "malay_translation": "Muhammad bin Sirin berkata: Kami bersama Abu Hurairah dan beliau memakai dua pakaian linen yang dicelup dengan oker merah. Beliau menghembus hidungnya di salah satu daripadanya dan berkata: 'Bagus! Abu Hurairah menghembus hidungnya di linen! Saya melihat suatu masa ketika saya akan pengsan antara mimbar Rasulullah (s.a.w) dan kediaman 'Aishah kerana kelaparan yang amat sangat. Seseorang datang dan meletakkan kakinya di leher saya menyangka saya orang gila, tetapi saya tidak gila, Ia tidak lain hanyalah kelaparan. (Sahih)",
        "arabic_text": "حَدَّثَنَا حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، قَالَ:‏‏‏‏ كُنَّا عِنْدَ أَبِي هُرَيْرَةَ، وَعَلَيْهِ ثَوْبَانِ مُمَشَّقَانِ مِنْ كَتَّانٍ فَتَمَخَّطَ فِي أَحَدِهِمَا، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ بَخٍ بَخٍ يَتَمَخَّطُ أَبُو هُرَيْرَةَ فِي الْكَتَّانِ لَقَدْ رَأَيْتُنِي وَإِنِّي لَأَخِرُّ فِيمَا بَيْنَ مِنْبَرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَحُجْرَةِ عَائِشَةَ مِنَ الْجُوعِ مَغْشِيًّا عَلَيَّ فَيَجِيءُ الْجَائِي فَيَضَعُ رِجْلَهُ عَلَى عُنُقِي يَرَى أَنَّ بِيَ الْجُنُونَ وَمَا بِي جُنُونٌ وَمَا هُوَ إِلَّا الْجُوعُ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ."
      },
      {
        "id": 17492,
        "hadith_number": "2368",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keutamaan Kemiskinan dan Keperluan di Sisi Allah",
        "perawi_melayu": "Fadalah bin 'Ubaid",
        "english_text": "Fadalah bin 'Ubaid narrated that when the Messenger of Allah (s.a.w) would lead the people in Salat some men would collapse among them during the Salat due to hunger – they were among them Ashab As-suffah – such that a Bedouin would say : 'These people are mad' or possessed. So when the Messenger of Allah (s.a.w) finished the Salah, he turned to them and said: 'If you knew what was in store for you with Allah then you would love to be increased in poverty and need.’ Fadalah said: “And on that day, I was with the Messenger of Allah(s.a.w).” (Hasan)",
        "malay_translation": "Fadalah bin 'Ubaid meriwayatkan bahawa apabila Rasulullah (s.a.w) mengimami orang ramai dalam Solat, beberapa orang lelaki akan jatuh pengsan di kalangan mereka semasa Solat kerana kelaparan – mereka adalah dari kalangan Ashab As-Suffah – sehingga seorang Badwi akan berkata: 'Orang-orang ini gila' atau dirasuk. Maka apabila Rasulullah (s.a.w) selesai Solat, baginda berpaling kepada mereka dan bersabda: 'Jika kamu tahu apa yang tersedia untuk kamu di sisi Allah, maka kamu pasti akan suka untuk ditambah dalam kemiskinan dan keperluan.’ Fadalah berkata: “Dan pada hari itu, saya bersama Rasulullah (s.a.w).” (Hasan)",
        "arabic_text": "حَدَّثَنَا الْعَبَّاسُ الدُّورِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ، حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ، أَخْبَرَنِي أَبُو هَانِئٍ الْخَوْلَانِيُّ، أَنَّ أَبَا عَلِيٍّ عَمْرَو بْنَ مَالِكٍ الْجَنْبِيَّ أَخْبَرَهُ، ‏‏‏‏‏‏عَنْ فَضَالَةَ بْنِ عُبَيْدٍ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ كَانَ إِذَا صَلَّى بِالنَّاسِ يَخِرُّ رِجَالٌ مِنْ قَامَتِهِمْ فِي الصَّلَاةِ مِنَ الْخَصَاصَةِ وَهُمْ أَصْحَابُ الصُّفَّةِ، ‏‏‏‏‏‏حَتَّى يَقُولَ الْأَعْرَابُ:‏‏‏‏ هَؤُلَاءِ مَجَانِينُ أَوْ مَجَانُونَ، ‏‏‏‏‏‏فَإِذَا صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْصَرَفَ إِلَيْهِمْ فَقَالَ:‏‏‏‏ لَوْ تَعْلَمُونَ مَا لَكُمْ عِنْدَ اللَّهِ لَأَحْبَبْتُمْ أَنْ تَزْدَادُوا فَاقَةً وَحَاجَةً، ‏‏‏‏‏‏قَالَ فَضَالَةُ:‏‏‏‏ وَأَنَا يَوْمَئِذٍ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17493,
        "hadith_number": "2369",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Kisah Kelaparan Nabi dan Layanan Abu Al-Haitham",
        "perawi_melayu": "Tidak disebutkan",
        "english_text": "Abu Hurairah narrated : The Prophet (s.a.w) went out during an hour in which he would normally not go out, nor meet with anyone. Then Abu Bakr came to him. So he said: What brought you O Abu Bakr? He said: I came to meet the Messenger of Allah (s.a.w) and to look at his face, and to make sure he was safe. It was not long before 'Umar came. He said: What has brought you O 'Umar ? He said: Hunger O Messenger of Allah! He said: I also experienced some of that So they went to the home of Abu Al-Haitham At-Taiyyihan Al-Ansari. He was a man with many date-palms and sheep, but he had no servants so they did not find him there. They said to his wife: Where is your companion? She said: He has gone to fetch us some good water. It was not long before Abu Al-Haitham came along hauling to a large water-skin which he put down. Then he came to hug the Prophet (s.a.w) and uttered that his father and mother should be ransomed for him. Then he went to grove of his and he spread out a mat for them. Then he went to a date-palm and returned with a cluster of dates which he put down. The prophet (s.a.w) said: Why don't you select some ripe dates for us? He said: O Messenger of Allah(s.a.w)! I wanted you to select from the ripe dates and the unripe dates. So they ate and they drank from that water. The Messenger of Allah(s.a.w) said: By the One in Whose Hand is my soul! This is among the favors which you shall be asked about on the Day of Judgement. Cool shade, tasty ripe dates, and cool water. Abu Al-Haitham left to prepare some food for them. The Prophet (s.a.w) said: Do not slaughter one with milk. So he Slaughtered a small female or male goat and brought it to them so they could eat it. The Prophet (s.a.w) said: Do you have any servants? He said: No. So he said: Then if we get some captives we shall bring them for you. So (later) the Prophet (s.a.w) came with 2 males, there was no third among them and he brought them to Abu Al-Haitham. The Prophet (s.a.w) said: Choose from them. He said: O Prophet of Allah! Choose for me. So the Prophet (s.a.w) said: Indeed the one consulted is entrusted. Take this one for I have seen him praying, and encourage him to do well. So Abu Al-Haitham went to his wife and informed her of what the Messenger of Allah (s.a.w) said. So his wife said: You will not fulfill what the Prophet (s.a.w) said until you have freed him. So he said: He is free. So the Prophet (s.a.w) said: Indeed Allah has not send a Prophet nor made a Khalifah except that he has two groups of supporters, group ordering him to do good, and prohibiting him from evil and a group that never ceases spoiling his affairs. So whoever protected.",
        "malay_translation": "Abu Hurairah meriwayatkan: Nabi (s.a.w) keluar pada waktu yang biasanya Baginda tidak keluar, dan tidak bertemu dengan sesiapa pun. Kemudian Abu Bakr datang kepada Baginda. Baginda bertanya: Apa yang membawa kamu wahai Abu Bakr? Beliau menjawab: Saya datang untuk menemui Rasulullah (s.a.w) dan melihat wajah Baginda, dan untuk memastikan Baginda selamat. Tidak lama kemudian Umar datang. Baginda bertanya: Apa yang membawa kamu wahai Umar? Beliau menjawab: Kelaparan wahai Rasulullah! Baginda bersabda: Saya juga mengalami sedikit daripadanya. Maka mereka pergi ke rumah Abu Al-Haitham At-Taiyyihan Al-Ansari. Beliau adalah seorang lelaki yang mempunyai banyak pohon kurma dan kambing, tetapi beliau tidak mempunyai pembantu jadi mereka tidak menemuinya di sana. Mereka bertanya kepada isterinya: Di mana temanmu? Dia menjawab: Dia telah pergi untuk mengambil air yang baik untuk kami. Tidak lama kemudian Abu Al-Haitham datang sambil menarik bekas air yang besar yang diletakkannya. Kemudian dia datang untuk memeluk Nabi (s.a.w) dan mengucapkan agar bapa dan ibunya menjadi tebusan untuk Baginda. Kemudian dia pergi ke kebunnya dan membentangkan tikar untuk mereka. Kemudian dia pergi ke pohon kurma dan kembali dengan setangkai kurma yang diletakkannya. Nabi (s.a.w) bersabda: Mengapa kamu tidak memilihkan beberapa kurma masak untuk kami? Beliau menjawab: Wahai Rasulullah (s.a.w)! Saya ingin kamu memilih dari kurma masak dan kurma mentah. Maka mereka makan dan minum dari air itu. Rasulullah (s.a.w) bersabda: Demi Zat yang jiwaku berada di tangan-Nya! Ini adalah antara nikmat yang akan kamu ditanya tentangnya pada Hari Kiamat. Naungan yang sejuk, kurma masak yang lazat, dan air yang sejuk. Abu Al-Haitham pergi untuk menyediakan makanan untuk mereka. Nabi (s.a.w) bersabda: Jangan sembelih yang ada susu. Maka dia menyembelih seekor kambing betina atau jantan yang kecil dan membawanya kepada mereka supaya mereka dapat memakannya. Nabi (s.a.w) bertanya: Adakah kamu mempunyai pembantu? Dia menjawab: Tidak. Maka Baginda bersabda: Kemudian jika kita mendapat beberapa tawanan, kita akan membawanya untukmu. Maka (kemudian) Nabi (s.a.w) datang dengan 2 orang lelaki, tidak ada yang ketiga di antara mereka dan Baginda membawa mereka kepada Abu Al-Haitham. Nabi (s.a.w) bersabda: Pilihlah daripada mereka. Beliau menjawab: Wahai Nabi Allah! Pilihlah untukku. Maka Nabi (s.a.w) bersabda: Sesungguhnya orang yang dirujuk itu diamanahkan. Ambillah yang ini kerana aku telah melihatnya solat, dan galakkan dia untuk berbuat baik. Maka Abu Al-Haitham pergi kepada isterinya dan memberitahunya tentang apa yang Rasulullah (s.a.w) sabdakan. Maka isterinya berkata: Kamu tidak akan menunaikan apa yang Nabi (s.a.w) sabdakan sehingga kamu membebaskannya. Maka dia berkata: Dia bebas. Maka Nabi (s.a.w) bersabda: Sesungguhnya Allah tidak mengutus seorang Nabi mahupun menjadikan seorang Khalifah kecuali dia mempunyai dua golongan penyokong, golongan yang menyuruhnya melakukan kebaikan, dan melarangnya dari kejahatan dan golongan yang tidak pernah berhenti merosakkan urusannya. Maka siapa pun yang melindungi.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيل، حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شَيْبَانُ أَبُو مُعَاوِيَةَ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ خَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَاعَةٍ لَا يَخْرُجُ فِيهَا وَلَا يَلْقَاهُ فِيهَا أَحَدٌ، ‏‏‏‏‏‏فَأَتَاهُ أَبُو بَكْرٍ،‏‏‏‏ فَقَالَ:‏‏‏‏ مَا جَاءَ بِكَ يَا أَبَا بَكْرٍ ؟ فَقَالَ:‏‏‏‏ خَرَجْتُ أَلْقَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنْظُرُ فِي وَجْهِهِ وَالتَّسْلِيمَ عَلَيْهِ، ‏‏‏‏‏‏فَلَمْ يَلْبَثْ أَنْ جَاءَ عُمَرُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا جَاءَ بِكَ يَا عُمَرُ ؟ قَالَ:‏‏‏‏ الْجُوعُ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ وَأَنَا قَدْ وَجَدْتُ بَعْضَ ذَلِكَ فَانْطَلَقُوا إِلَى مَنْزِلِ أَبِي الْهَيْثَمِ بْنِ التَّيْهَانِ الْأَنْصَارِيِّ ، ‏‏‏‏‏‏وَكَانَ رَجُلًا كَثِيرَ النَّخْلِ وَالشَّاءِ وَلَمْ يَكُنْ لَهُ خَدَمٌ فَلَمْ يَجِدُوهُ، ‏‏‏‏‏‏فَقَالُوا لِامْرَأَتِهِ:‏‏‏‏ أَيْنَ صَاحِبُكِ ؟ فَقَالَتْ:‏‏‏‏ انْطَلَقَ يَسْتَعْذِبُ لَنَا الْمَاءَ، ‏‏‏‏‏‏فَلَمْ يَلْبَثُوا أَنْ جَاءَ أَبُو الْهَيْثَمِ بِقِرْبَةٍ يَزْعَبُهَا، ‏‏‏‏‏‏فَوَضَعَهَا ثُمَّ جَاءَ يَلْتَزِمُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَيُفَدِّيهِ بِأَبِيهِ وَأُمِّهِ، ‏‏‏‏‏‏ثُمَّ انْطَلَقَ بِهِمْ إِلَى حَدِيقَتِهِ فَبَسَطَ لَهُمْ بِسَاطًا، ‏‏‏‏‏‏ثُمَّ انْطَلَقَ إِلَى نَخْلَةٍ، ‏‏‏‏‏‏فَجَاءَ بِقِنْوٍ فَوَضَعَهُ، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَفَلَا تَنَقَّيْتَ لَنَا مِنْ رُطَبِهِ ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ إِنِّي أَرَدْتُ أَنْ تَخْتَارُوا، ‏‏‏‏‏‏أَوْ قَالَ:‏‏‏‏ تَخَيَّرُوا مِنْ رُطَبِهِ وَبُسْرِهِ فَأَكَلُوا وَشَرِبُوا مِنْ ذَلِكَ الْمَاءِ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ هَذَا وَالَّذِي نَفْسِي بِيَدِهِ مِنَ النَّعِيمِ الَّذِي تُسْأَلُونَ عَنْهُ يَوْمَ الْقِيَامَةِ، ‏‏‏‏‏‏ظِلٌّ بَارِدٌ، ‏‏‏‏‏‏وَرُطَبٌ طَيِّبٌ، ‏‏‏‏‏‏وَمَاءٌ بَارِدٌ &qquot;، ‏‏‏‏‏‏فَانْطَلَقَ أَبُو الْهَيْثَمِ لِيَصْنَعَ لَهُمْ طَعَامًا، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تَذْبَحَنَّ ذَاتَ دَرٍّ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَذَبَحَ لَهُمْ عَنَاقًا أَوْ جَدْيًا فَأَتَاهُمْ بِهَا، ‏‏‏‏‏‏فَأَكَلُوا، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ هَلْ لَكَ خَادِمٌ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَإِذَا أَتَانَا سَبْيٌ فَأْتِنَا ، ‏‏‏‏‏‏فَأُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِرَأْسَيْنِ لَيْسَ مَعَهُمَا ثَالِثٌ، ‏‏‏‏‏‏فَأَتَاهُ أَبُو الْهَيْثَمِ، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ اخْتَرْ مِنْهُمَا ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا نَبِيَّ اللَّهِ اخْتَرْ لِي، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ الْمُسْتَشَارَ مُؤْتَمَنٌ خُذْ هَذَا فَإِنِّي رَأَيْتُهُ يُصَلِّي وَاسْتَوْصِ بِهِ مَعْرُوفًا ، ‏‏‏‏‏‏فَانْطَلَقَ أَبُو الْهَيْثَمِ إِلَى امْرَأَتِهِ فَأَخْبَرَهَا بِقَوْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَتِ امْرَأَتُهُ:‏‏‏‏ مَا أَنْتَ بِبَالِغٍ مَا قَالَ فِيهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا أَنْ تَعْتِقَهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَهُوَ عَتِيقٌ، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ اللَّهَ لَمْ يَبْعَثْ نَبِيًّا وَلَا خَلِيفَةً إِلَّا وَلَهُ بِطَانَتَانِ، ‏‏‏‏‏‏بِطَانَةٌ تَأْمُرُهُ بِالْمَعْرُوفِ وَتَنْهَاهُ عَنِ الْمُنْكَرِ، ‏‏‏‏‏‏وَبِطَانَةٌ لَا تَأْلُوهُ خَبَالًا، ‏‏‏‏‏‏وَمَنْ يُوقَ بِطَانَةَ السُّوءِ فَقَدْ وُقِيَ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ."
      },
      {
        "id": 17494,
        "hadith_number": "2370",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Rasulullah SAW Keluar Bersama Abu Bakr dan Umar (Riwayat Serupa Hadis Lain)",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Abu Salamah bin 'Abdur-Rahman narrated that: the Messenger of Allah(s.a.w) went out one day accompained by Abu Bakr and 'Umar. And he mentioned similar to Hadith( no 2369) in meaning, but he did not mention from Abu Hurairah in it.",
        "malay_translation": "Abu Salamah bin 'Abdur-Rahman meriwayatkan bahawa: Rasulullah SAW keluar pada suatu hari diiringi oleh Abu Bakr dan Umar. Dan baginda menyebutkan makna yang serupa dengan Hadis (nombor 2369), tetapi baginda tidak menyebutkan daripada Abu Hurairah dalam riwayat ini.",
        "arabic_text": "حَدَّثَنَا صَالِحُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ يَوْمًا وَأَبُو بَكْرٍ،‏‏‏‏ وَعُمَرُ فَذَكَرَ نَحْوَ هَذَا الْحَدِيثِ، ‏‏‏‏‏‏وَلَمْ يَذْكُرْ فِيهِ عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَحَدِيثُ شَيْبَانَ أَتَمُّ مِنْ حَدِيثِ أَبِي عَوَانَةَ،‏‏‏‏ وَأَطْوَلُ، ‏‏‏‏‏‏وَشَيْبَانُ ثِقَةٌ عِنْدَهُمْ صَاحِبُ كِتَابٍ، ‏‏‏‏‏‏وَقَدْ رُوِيَ عَنْ أَبِي هُرَيْرَةَ هَذَا الْحَدِيثُ مِنْ غَيْرِ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَرُوِيَ عَنِ ابْنِ عَبَّاسٍ أَيْضًا."
      },
      {
        "id": 17495,
        "hadith_number": "2371",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Laparnya Para Sahabat dan Rasulullah SAW",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Anas bin Malik narrated from Abu Talhah who said: We complained to the Messenger of Allah(s.a.w) of hunger and we raised(our garments ) from our stomachs (exposing) a stone (on each of us). So the Messenger of Allah(s.a.w) raised (his garment exposing) two stones.",
        "malay_translation": "Anas bin Malik meriwayatkan daripada Abu Talhah yang berkata: Kami mengadu kepada Rasulullah (s.a.w) tentang kelaparan dan kami mengangkat (pakaian kami) dari perut kami (mendedahkan) sebiji batu (pada setiap seorang daripada kami). Maka Rasulullah (s.a.w) mengangkat (pakaian baginda mendedahkan) dua biji batu.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي زِيَادٍ، حَدَّثَنَا سَيَّارُ بْنُ حَاتِمٍ، عَنْ سَهْلِ بْنِ أَسْلَمَ، عَنْ يَزِيدَ بْنِ أَبِي مَنْصُورٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ أَبِي طَلْحَةَ، قَالَ:‏‏‏‏ شَكَوْنَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجُوعَ وَرَفَعْنَا عَنْ بُطُونِنَا عَنْ حَجَرٍ حَجَرٍ فَرَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ حَجَرَيْنِ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ."
      },
      {
        "id": 17496,
        "hadith_number": "2372",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Kesederhanaan Kehidupan Nabi Muhammad SAW",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Simak bin Harb said: I heard An-Nu'man bin Bashir saying: 'Do you (people) not have what you wish of food and drink?' I have seen your Prophet and he did not have even enough daqal (dry dates) to fill his stomach.'",
        "malay_translation": "Simak bin Harb berkata: Saya mendengar An-Nu'man bin Bashir berkata: 'Tidakkah kamu (orang ramai) mempunyai apa yang kamu inginkan dari makanan dan minuman?' Saya telah melihat Nabi kamu dan baginda tidak mempunyai walaupun cukup daqal (kurma kering) untuk mengisi perut baginda.'",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو الْأَحْوَصِ، عَنْ سِمَاكِ بْنِ حَرْبٍ، قَال:‏‏‏‏ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ،‏‏‏‏ يَقُولُ:‏‏‏‏ أَلَسْتُمْ فِي طَعَامٍ وَشَرَابٍ مَا شِئْتُمْ ؟ لَقَدْ رَأَيْتُ نَبِيَّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا يَجِدُ مِنَ الدَّقَلِ مَا يَمْلَأُ بِهِ بَطْنَهُ،‏‏‏‏ قَالَ:‏‏‏‏ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17497,
        "hadith_number": "2373",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Kekayaan Sejati adalah Rasa Cukup",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said: Richness is not having many possessions, but richness is being content with oneself.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Kekayaan bukanlah dengan banyaknya harta, tetapi kekayaan adalah rasa cukup dalam diri.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ بُدَيْلِ بْنِ قُرَيْشٍ الْيَامِيُّ الْكُوفِيُّ، حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَيْسَ الْغِنَى عَنْ كَثْرَةِ الْعَرَضِ، ‏‏‏‏‏‏وَلَكِنَّ الْغِنَى غِنَى النَّفْسِ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَأَبُو حَصِينٍ اسْمُهُ:‏‏‏‏ عُثْمَانُ بْنُ عَاصِمٍ الْأَسَدِيُّ."
      },
      {
        "id": 17498,
        "hadith_number": "2374",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Harta: Ujian dan Berkat",
        "perawi_melayu": "Khawlah binti Qais, isteri Hamzah bin 'Abdul-Muttalib",
        "english_text": "Khawlah bint Qais, who was the wife of Hamzah bin 'Abdul-Muttalib narrated that the Messenger of Allah (s.a.w) said: Indeed this wealth is green and sweet. Whoever gets what he deserves of it then he shall be blessed in it. And many a person who deals with what he wants for himself, from the wealth of Allah and His Messenger, gets nothing on the Day of Judgment but the Fire.",
        "malay_translation": "Khawlah binti Qais, yang merupakan isteri Hamzah bin 'Abdul-Muttalib meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Sesungguhnya harta ini hijau dan manis. Sesiapa yang memperolehi haknya daripada harta itu, maka dia akan diberkati dengannya. Dan ramai orang yang mengambil apa yang dia mahu untuk dirinya sendiri, daripada harta Allah dan Rasul-Nya, tidak akan mendapat apa-apa pada Hari Kiamat melainkan Neraka.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي الْوَلِيدِ، قَال:‏‏‏‏ سَمِعْتُ خَوْلَةَ بِنْتَ قَيْسٍ،‏‏‏‏ وَكَانَتْ تَحْتَ حَمْزَةَ بْنِ عَبْدِ الْمُطَّلِبِ، ‏‏‏‏‏‏تَقُولُ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ إِنَّ هَذَا الْمَالَ خَضِرَةٌ حُلْوَةٌ مَنْ أَصَابَهُ بِحَقِّهِ بُورِكَ لَهُ فِيهِ، ‏‏‏‏‏‏وَرُبَّ مُتَخَوِّضٍ فِيمَا شَاءَتْ بِهِ نَفْسُهُ مِنْ مَالِ اللَّهِ وَرَسُولِهِ لَيْسَ لَهُ يَوْمَ الْقِيَامَةِ إِلَّا النَّارُ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَأَبُو الْوَلِيدِ اسْمُهُ:‏‏‏‏ عُبَيْدُ سَنُوطَا."
      },
      {
        "id": 17499,
        "hadith_number": "2375",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Celaan Terhadap Hamba Dinar dan Dirham",
        "perawi_melayu": "Abu Hurairah R.A.",
        "english_text": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said: Cursed be the slave of the Dinar, cursed be the slave of the Dirham.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Celakalah hamba Dinar, celakalah hamba Dirham.",
        "arabic_text": "حَدَّثَنَا بِشْرُ بْنُ هِلَالٍ الصَّوَّافُ، حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، عَنْ يُونُسَ، عَنِ الْحَسَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لُعِنَ عَبْدُ الدِّينَارِ لُعِنَ عَبْدُ الدِّرْهَمِ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَقَدْ رُوِيَ هَذَا الْحَدِيث مِنْ غَيْرِ هَذَا الْوَجْهِ عَنْ أَبِي صَالِحٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيْضًا أَتَمَّ مِنْ هَذَا وَأَطْوَلَ."
      },
      {
        "id": 17500,
        "hadith_number": "2376",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Bahaya Ketamakan Harta dan Kemuliaan Terhadap Agama",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Ibn Ka'b bin Malik Al-Ansari narrated from his father, that the Messenger of Allah (s.a.w) said: Two wolves free among sheep are no more destructive to them than a man's desire for wealth and honor is to his religion.",
        "malay_translation": "Ibnu Ka'b bin Malik Al-Ansari meriwayatkan daripada bapanya, bahawa Rasulullah (s.a.w) bersabda: Dua ekor serigala yang dilepaskan di tengah-tengah kawanan kambing tidak lebih merosakkan daripada keinginan seseorang terhadap harta dan kemuliaan bagi agamanya.",
        "arabic_text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَعْدِ بْنِ زُرَارَةَ، عَنِ ابْنِ كَعْبِ بْنِ مَالِكٍ الْأَنْصَارِيِّ، عَنْ أَبِيهِ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَا ذِئْبَانِ جَائِعَانِ أُرْسِلَا فِي غَنَمٍ بِأَفْسَدَ لَهَا مِنْ حِرْصِ الْمَرْءِ عَلَى الْمَالِ وَالشَّرَفِ لِدِينِهِ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَيُرْوَى فِي هَذَا الْبَابِ عَنِ ابْنِ عُمَرَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا يَصِحُّ إِسْنَادُهُ."
      },
      {
        "id": 17501,
        "hadith_number": "2377",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Kehidupan Zuhud Rasulullah SAW di Dunia",
        "perawi_melayu": "Abdullah",
        "english_text": "Abdullah narrated : The Messenger of Allah (s.a.w) was sleeping upon a mat, then he stood, and the mat had left marks on his side. We said: 'O Messenger of Allah! We said: 'O Messenger of Allah! We could get a bed for you.' He said: 'What do I have to do with the world! I am not in the world but as a rider seeking shade under a tree, then he catches his breath and leaves it.'",
        "malay_translation": "Abdullah meriwayatkan: Rasulullah (s.a.w) sedang tidur di atas tikar, kemudian baginda bangun, dan tikar itu telah meninggalkan kesan di sisi baginda. Kami berkata: 'Wahai Rasulullah! Kami berkata: 'Wahai Rasulullah! Kami boleh mendapatkan katil untukmu.' Baginda bersabda: 'Apa urusanku dengan dunia! Aku di dunia ini tidak lain hanyalah seperti seorang penunggang yang mencari teduhan di bawah pohon, kemudian dia berehat sebentar dan meninggalkannya.'",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ عَبْدِ الرَّحْمَنِ الْكِنْدِيُّ، حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ، أَخْبَرَنِي الْمَسْعُودِيُّ، حَدَّثَنَا عَمْرُو بْنُ مُرَّةَ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ:‏‏‏‏ نَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى حَصِيرٍ،‏‏‏‏ فَقَامَ وَقَدْ أَثَّرَ فِي جَنْبِهِ، ‏‏‏‏‏‏فَقُلْنَا:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏ لَوِ اتَّخَذْنَا لَكَ وِطَاءً، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا لِي وَمَا لِلدُّنْيَا مَا أَنَا فِي الدُّنْيَا إِلَّا كَرَاكِبٍ اسْتَظَلَّ تَحْتَ شَجَرَةٍ ثُمَّ رَاحَ وَتَرَكَهَا ،‏‏‏‏ قَالَ:‏‏‏‏ وفي الباب عن ابْنِ عُمَرَ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17502,
        "hadith_number": "2378",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Agama Seseorang Itu Mengikut Agama Temannya",
        "perawi_melayu": "Tidak diketahui",
        "english_text": "Abu Hurairah narrated that the Messenger of Allah(s.a.w) said: A man is upon the religion of his friend, so let one of you look at whom he befriends.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Seseorang itu mengikut agama temannya, maka hendaklah salah seorang daripada kamu melihat siapa yang dia jadikan teman.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَامِرٍ، وَأَبُو دَاوُدَ،‏‏‏‏ قَالَا:‏‏‏‏ حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ، حَدَّثَنِي مُوسَى بْنُ وَرْدَانَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الرَّجُلُ عَلَى دِينِ خَلِيلِهِ، ‏‏‏‏‏‏فَلْيَنْظُرْ أَحَدُكُمْ مَنْ يُخَالِلُ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ."
      },
      {
        "id": 17503,
        "hadith_number": "2379",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Tiga Perkara Mengiringi Jenazah",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Anas bin Malik narrated that the Messenger of Allah (S.a.w) said: Three follow the deceased, two of them return, and one remains. He is followed by his family, his wealth, and his deeds. So his family and his wealth returns, and his deeds remain.",
        "malay_translation": "Anas bin Malik meriwayatkan bahawa Rasulullah (S.a.w) bersabda: Tiga perkara mengikuti jenazah, dua daripadanya akan kembali, dan satu akan kekal. Jenazah itu diikuti oleh keluarganya, hartanya, dan amalannya. Maka keluarganya dan hartanya akan kembali, dan amalannya akan kekal.",
        "arabic_text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ هُوَ ابْنُ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ الْأَنْصَارِيُّ، قَال:‏‏‏‏ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ،‏‏‏‏ يَقُولُ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَتْبَعُ الْمَيِّتَ ثَلَاثٌ فَيَرْجِعُ اثْنَانِ وَيَبْقَى وَاحِدٌ، ‏‏‏‏‏‏يَتْبَعُهُ أَهْلُهُ وَمَالُهُ وَعَمَلُهُ، ‏‏‏‏‏‏فَيَرْجِعُ أَهْلُهُ وَمَالُهُ، ‏‏‏‏‏‏وَيَبْقَى عَمَلُهُ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17504,
        "hadith_number": "2380",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Larangan Memenuhi Perut dan Anjuran Makan Secukupnya",
        "perawi_melayu": "Miqdam bin Ma'dikarib",
        "english_text": "Miqdam bin Ma'dikarib said: I heard the Messenger of Allah (S.a.w) saying: 'The human does not fill any container that is worse than his stomach. It is sufficient for the son of Adam to eat what will support his back. If this is not possible, then a third for food, a third for drink, and third for his breath.",
        "malay_translation": "Miqdam bin Ma'dikarib berkata: Aku mendengar Rasulullah (S.a.w) bersabda: 'Tidaklah anak Adam memenuhi bekas yang lebih buruk daripada perutnya. Cukuplah bagi anak Adam itu beberapa suap makanan yang dapat menegakkan tulang belakangnya. Jika tidak mungkin, maka (hendaklah) sepertiga untuk makanan, sepertiga untuk minuman, dan sepertiga untuk nafasnya.'",
        "arabic_text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَخْبَرَنَا إِسْمَاعِيل بْنُ عَيَّاشٍ، حَدَّثَنِي أَبُو سَلَمَةَ الْحِمْصِيُّ، وَحَبِيبُ بْنُ صَالِحٍ،‏‏‏‏ عَنْ يَحْيَى بْنِ جَابِرٍ الطَّائِيِّ، عَنْ مِقْدَامِ بْنِ مَعْدِ يكَرِبَ، قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ مَا مَلَأَ آدَمِيٌّ وِعَاءً شَرًّا مِنْ بَطْنٍ بِحَسْبِ ابْنِ آدَمَ أُكُلَاتٌ يُقِمْنَ صُلْبَهُ، ‏‏‏‏‏‏فَإِنْ كَانَ لَا مَحَالَةَ، ‏‏‏‏‏‏فَثُلُثٌ لِطَعَامِهِ وَثُلُثٌ لِشَرَابِهِ وَثُلُثٌ لِنَفَسِهِ ."
      },
      {
        "id": 17505,
        "hadith_number": "2381",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Riak dan Keutamaan Rahmat",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Abu Sa'eed narrated that the Messenger of Allah (S.a.w) said: Whoever wants to be seen, Allah will show him, And whoever wants to be heard of, Allah will make him heard off. And he narrated that the Messenger of Allah (s.a.w) said: He who shows no mercy to the people, Allah shows him no mercy.",
        "malay_translation": "Abu Sa'eed meriwayatkan bahawa Rasulullah (S.a.w) bersabda: Sesiapa yang ingin dilihat (riak), Allah akan menunjuk-nunjukkannya (balasan riaknya), dan sesiapa yang ingin didengari (sum'ah), Allah akan memperdengarkannya (balasan sum'ahnya). Dan beliau meriwayatkan bahawa Rasulullah (S.a.w) bersabda: Sesiapa yang tidak menunjukkan rahmat kepada manusia, Allah tidak akan menunjukkan rahmat kepadanya.",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، عَنْ شَيْبَانَ، عَنْ فِرَاسٍ، عَنْ عَطِيَّةَ، عَنْ أَبِي سَعِيدٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ يُرَاءِ يُرَاءِ اللَّهُ بِهِ، ‏‏‏‏‏‏وَمَنْ يُسَمِّعْ يُسَمِّعِ اللَّهُ بِهِ . (حديث مرفوع) (حديث موقوف) قَالَ:‏‏‏‏ قَالَ:‏‏‏‏ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ لَا يَرْحَمُ النَّاسَ لَا يَرْحَمْهُ اللَّهُ ،‏‏‏‏ وفي الباب عن جُنْدَبٍ، ‏‏‏‏‏‏وَعَبْدِ اللَّهِ بْنِ عَمْرٍو، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ."
      },
      {
        "id": 17506,
        "hadith_number": "2382",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Tiga Orang Pertama yang Dihisab pada Hari Kiamat dan Ancaman Neraka bagi Mereka yang Tidak Ikhlas",
        "perawi_melayu": "Al-Walid bin Abi Al-Wald abu 'Utthman Al-Mada'ini meriwayatkan bahawa 'Uqbah bin Muslim meriwayatkan kepadanya, bahawa Shufaiy Al-Asbahi meriwayatkan bahawa dia memasuki Al-Madinah dan melihat seorang lelaki yang orang ramai berkerumun di sekelilingnya. Dia bertanya: Siapa ini? Mereka berkata: Abu Hurairah. (Dia berkata): Lalu saya mendekatinya sehingga saya duduk di hadapannya ketika dia sedang meriwayatkan kepada orang ramai. Ketika dia diam dan bersendirian, saya berkata kepadanya: Saya meminta anda kebenaran mutlak jika anda akan meriwayatkan kepada saya sebuah Hadith yang anda dengar daripada Rasulullah SAW, Yang anda fahami dan tahu. Maka Abu Hurairah berkata: Kamu mahu saya meriwayatkan sebuah Hadith kepadamu yang Rasulullah SAW riwayatkan kepada saya yang saya fahami dan tahu. Kemudian Abu Hurairah mula menangis teresak-esak. Kami duduk seketika, kemudian dia pulih dan berkata: Saya akan meriwayatkan kepada kamu sebuah Hadith yang Rasulullah SAW riwayatkan di Rumah ini, ketika tidak ada seorang pun bersama kami selain dia dan saya. Kemudian, sekali lagi, Abu Hurairah mula menangis dengan teruk. Kemudian dia pulih, dan menyeka wajahnya, dan berkata: kamu mahu saya meriwayatkan kepada kamu sebuah Hadith yang Rasulullah SAW riwayatkan ketika dia dan saya sedang duduk di Rumah ini, dan tidak ada seorang pun bersama kami kecuali dia dan saya. Kemudian Abu Hurairah mula menangis dengan teruk. Kemudian dia membungkuk, jatuh di atas mukanya, maka saya menyokongnya untuk masa yang lama. Kemudian dia pulih dan berkata: Rasulullah SAW meriwayatkan kepada saya bahawa pada Hari Kiamat, Allah, Maha Tinggi, akan turun kepada hamba-hamba-Nya untuk menghakimi di antara mereka. Setiap umat akan berlutut. Orang pertama dari mereka yang akan dipanggil di hadapan-Nya adalah seorang lelaki yang menghafal Al-Quran, dan seorang lelaki yang terbunuh di jalan Allah, dan seorang lelaki kaya. Allah akan berfirman kepada pembaca Al-Quran: 'Bukankah Aku telah mengajarkan kepadamu apa yang Aku wahyukan kepada Rasul-Ku? Dia berkata: 'Sudah tentu ya Tuhan!' Dia berfirman: 'Kemudian apa yang kamu lakukan dengan apa yang kamu pelajari?' Dia berkata: 'Saya akan berdiri (dalam solat membaca) dengannya sepanjang waktu malam dan sepanjang waktu siang.' Kemudian Allah akan berfirman kepadanya: 'Kamu telah berdusta.' Dan para malaikat akan berkata: 'Kamu telah berdusta.' Allah akan berfirman kepadanya: 'Sebaliknya, kamu mahu dikatakan bahawa si fulan adalah seorang pembaca Al-Quran. Dan itu telah dikatakan.' Orang yang mempunyai kekayaan akan dibawa, dan Allah akan berfirman kepadanya: 'Bukankah Aku begitu pemurah kepadamu, sehingga Aku tidak meninggalkan kamu mempunyai sebarang keperluan daripada sesiapa pun?' Dia akan berkata: 'Sudah tentu ya Tuhan!' Dia berfirman: 'Kemudian apa yang kamu lakukan dengan apa yang Aku berikan kepadamu?' Dia berkata: 'Saya akan memelihara hubungan silaturahim dan memberi sedekah.' Kemudian Allah akan berfirman kepadanya: 'Kamu telah berdusta.' Dan para malaikat akan berkata kepadanya: 'Kamu telah berdusta.' Allah, Maha Tinggi, akan berfirman: 'Sebaliknya, kamu mahu dikatakan bahawa si fulan begitu pemurah, dan itu telah dikatakan.' Kemudian orang yang terbunuh di jalan Allah akan dibawa, dan Allah akan berfirman kepadanya: 'Untuk apa kamu terbunuh?' Maka dia berkata: 'Saya diperintahkan untuk berperang di jalan-Mu, maka saya berperang sehingga saya terbunuh.' Allah [Maha Tinggi] akan berfirman kepadanya: 'Kamu telah berdusta.' Dan para malaikat akan berkata kepadanya: 'Kamu telah berdusta.' Allah [Maha Tinggi] akan berfirman: 'Sebaliknya, kamu mahu dikatakan bahawa si fulan adalah berani, dan itu telah dikatakan.' Kemudian Rasulullah SAW memukul lutut saya dan bersabda: 'Wahai Abu Hurairah! Tiga orang pertama ini adalah makhluk Allah yang api neraka akan dinyalakan pada Hari Kiamat.' Al-Walid Abu 'Uthman Al-Mada'ini berkata: Maka 'Uqbah bin Muslim memberitahu saya bahawa Shaufaiy, adalah orang yang masuk menemui Mu'awiyah untuk memberitahunya tentang ini. Abu Uthman berkata: 'Ini telah dilakukan dengan orang-orang ini, lalu bagaimana dengan mereka yang masih tinggal di antara manusia? Kemudian Mu'awiyah mula menangis dengan begitu kuat, sehingga kami menyangka bahawa dia akan membunuh dirinya dengan tangisan yang berlebihan. Kami berkata: Orang ini datang kepada kami untuk menyebabkan keburukan. Kemudian Mu'awiyah pulih, menyeka wajahnya dan berkata: Allah dan Rasul-Nya telah berkata benar: Barangsiapa yang menginginkan kehidupan dunia dan perhiasannya, maka Kami akan membayar dengan sepenuhnya (upah) amalan mereka di dalamnya, dan mereka tidak akan dikurangi di dalamnya. Mereka itulah orang-orang yang tidak ada bagi mereka di Akhirat kecuali Api Neraka, dan sia-sia amalan yang mereka lakukan di dalamnya. Dan tidak memberi kesan apa yang mereka dahulu lakukan.",
        "english_text": "Al-Walid bin Abi Al-Wald abu 'Utthman Al-Mada'ini narrated that 'Uqbah bin Muslim narrated to him, that shufaiy Al-Asbahi narrated that he entered Al-Madinah and saw a man around whom the people had gathered. He asked: Who is this? They said: Abu Hurairah. (He said):So I got close to him until I was sitting in front of him as he was narrating to the people. When he was silent and alone, I said to him: I ask youabsolute truth if you would narrate to me a Hadith which you heard from the Messenger of Allah (s.a.w), That you understand and know. So Abu Hurairah said: You want me to narrate a Hadith to you which the Messenger of Allah (s.a.w) narrated to me that I understand and know. Then Abu Hurairah began sobbing profusely. We sat for a while, then he recovered and said: I shall narrate to you a Hadith which the Messenger of Allah (s.a.w) narrated in this House, while there was no one with us other than he and I. Then, again, Abu Hurairah began sobbing severely. Then he recovered, and wiped his face, and said: you want me to narrate to you a Hadith which the Messenger of Allah (s.a.w) narrated while he and I were sitting in this House, and no one was with us but he and I. Then Abu Hurairah began sobbing severely. Then he bent, falling on his face, so I supported him for a long time. Then he recovered and said: The Messenger of Allah narrated to me that on the Day of Judgement, Allah, Most High, will descend to His slaves t judge between them. Every nation shall be kneeling. The first of those who will be called before him will be a man who memorized the Qur'an, and a man who was killed in Allah's cause, and a wealthy man. Allah will say to the reciter: 'Did I not teach you what I revealed to My Messenger? He says: 'Of course O Lord!' He says: 'Then what did you do with what you learned?' He said: 'I would stand (in prayer reciting) with it during all hours of the night and all hours of the day.' Then Allah would say to him: 'You have lied.' And the angels will say: 'You have lied.'Allah will say to him: 'Rather, you wanted it to be said that so-and-so is a reciter. And that was said.' The person with the wealth will be brought, and Allah will say to him: 'Was I not so generous with you, such that I did not leave you having any need from anyone?' He will say: 'Of course O Lord!' He says: 'Then what did you do with what I gave to you?' He says: 'I would nurture the ties of kinship and give charity.' Then Allah will say to him: 'You have lied.' And the angels will say to him: 'You have lied.' Allah, Most High, will say: 'Rather, you wanted it to be said that so-and-so is so generous, and that was said.' Then the one who was killed in Allah's cause shall be brought, and Allah will say to him : 'For what were you killed?' So he says: 'I was commanded to fight in Your cause ,so I fought until I was killed.' Allah [Most High] will say to him: 'You have lied.' And the angels will say to him: 'You have lied.' Allah [Most High] will say: 'Rather, you wanted it be said that so-and-so is brave, and that was said.' Then the Messenger of Allah (s.a.w)hit me on my knees and said: 'O Abu Hurairah! These first three are the creatures of Allah with whom the fire will be enflamed on the Day of Judgement.' Al-Walid Abu 'Uthman Al-Mada'ini said: So 'Uqbah bin Muslim informed me that Shaufaiy, is the one who entered upon Mu'awiyah to inform him about this. Abu Uthman said: 'This has been done with these people, then how about with those who remain among the people? Then Mu'awiyah begin weeping so intensely, that we thought that he will kill himself with excessive weeping. We said: This man came to us to cause evil. Then Mu'awiyah recovered, wiped off his face and said: Allah and His Messenger told the truth: Whosoever desires the life of the world and its glitter, then we shall pay in full (the wages of) their deeds therein, and they shall have no diminution therein. They are those for whom there is nothing in the Hereafter Fire, and vain are the deeds they did therein. And of no effect is that which they used to do.",
        "malay_translation": "Al-Walid bin Abi Al-Wald abu 'Utthman Al-Mada'ini meriwayatkan bahawa 'Uqbah bin Muslim meriwayatkan kepadanya, bahawa Shufaiy Al-Asbahi meriwayatkan bahawa dia memasuki Al-Madinah dan melihat seorang lelaki yang orang ramai berkerumun di sekelilingnya. Dia bertanya: Siapa ini? Mereka berkata: Abu Hurairah. (Dia berkata): Lalu saya mendekatinya sehingga saya duduk di hadapannya ketika dia sedang meriwayatkan kepada orang ramai. Ketika dia diam dan bersendirian, saya berkata kepadanya: Saya meminta anda kebenaran mutlak jika anda akan meriwayatkan kepada saya sebuah Hadith yang anda dengar daripada Rasulullah SAW, Yang anda fahami dan tahu. Maka Abu Hurairah berkata: Kamu mahu saya meriwayatkan sebuah Hadith kepadamu yang Rasulullah SAW riwayatkan kepada saya yang saya fahami dan tahu. Kemudian Abu Hurairah mula menangis teresak-esak. Kami duduk seketika, kemudian dia pulih dan berkata: Saya akan meriwayatkan kepada kamu sebuah Hadith yang Rasulullah SAW riwayatkan di Rumah ini, ketika tidak ada seorang pun bersama kami selain dia dan saya. Kemudian, sekali lagi, Abu Hurairah mula menangis dengan teruk. Kemudian dia pulih, dan menyeka wajahnya, dan berkata: kamu mahu saya meriwayatkan kepada kamu sebuah Hadith yang Rasulullah SAW riwayatkan ketika dia dan saya sedang duduk di Rumah ini, dan tidak ada seorang pun bersama kami kecuali dia dan saya. Kemudian Abu Hurairah mula menangis dengan teruk. Kemudian dia membungkuk, jatuh di atas mukanya, maka saya menyokongnya untuk masa yang lama. Kemudian dia pulih dan berkata: Rasulullah SAW meriwayatkan kepada saya bahawa pada Hari Kiamat, Allah, Maha Tinggi, akan turun kepada hamba-hamba-Nya untuk menghakimi di antara mereka. Setiap umat akan berlutut. Orang pertama dari mereka yang akan dipanggil di hadapan-Nya adalah seorang lelaki yang menghafal Al-Quran, dan seorang lelaki yang terbunuh di jalan Allah, dan seorang lelaki kaya. Allah akan berfirman kepada pembaca Al-Quran: 'Bukankah Aku telah mengajarkan kepadamu apa yang Aku wahyukan kepada Rasul-Ku? Dia berkata: 'Sudah tentu ya Tuhan!' Dia berfirman: 'Kemudian apa yang kamu lakukan dengan apa yang kamu pelajari?' Dia berkata: 'Saya akan berdiri (dalam solat membaca) dengannya sepanjang waktu malam dan sepanjang waktu siang.' Kemudian Allah akan berfirman kepadanya: 'Kamu telah berdusta.' Dan para malaikat akan berkata: 'Kamu telah berdusta.' Allah akan berfirman kepadanya: 'Sebaliknya, kamu mahu dikatakan bahawa si fulan adalah seorang pembaca Al-Quran. Dan itu telah dikatakan.' Orang yang mempunyai kekayaan akan dibawa, dan Allah akan berfirman kepadanya: 'Bukankah Aku begitu pemurah kepadamu, sehingga Aku tidak meninggalkan kamu mempunyai sebarang keperluan daripada sesiapa pun?' Dia akan berkata: 'Sudah tentu ya Tuhan!' Dia berfirman: 'Kemudian apa yang kamu lakukan dengan apa yang Aku berikan kepadamu?' Dia berkata: 'Saya akan memelihara hubungan silaturahim dan memberi sedekah.' Kemudian Allah akan berfirman kepadanya: 'Kamu telah berdusta.' Dan para malaikat akan berkata kepadanya: 'Kamu telah berdusta.' Allah, Maha Tinggi, akan berfirman: 'Sebaliknya, kamu mahu dikatakan bahawa si fulan begitu pemurah, dan itu telah dikatakan.' Kemudian orang yang terbunuh di jalan Allah akan dibawa, dan Allah akan berfirman kepadanya: 'Untuk apa kamu terbunuh?' Maka dia berkata: 'Saya diperintahkan untuk berperang di jalan-Mu, maka saya berperang sehingga saya terbunuh.' Allah [Maha Tinggi] akan berfirman kepadanya: 'Kamu telah berdusta.' Dan para malaikat akan berkata kepadanya: 'Kamu telah berdusta.' Allah [Maha Tinggi] akan berfirman: 'Sebaliknya, kamu mahu dikatakan bahawa si fulan adalah berani, dan itu telah dikatakan.' Kemudian Rasulullah SAW memukul lutut saya dan bersabda: 'Wahai Abu Hurairah! Tiga orang pertama ini adalah makhluk Allah yang api neraka akan dinyalakan pada Hari Kiamat.' Al-Walid Abu 'Uthman Al-Mada'ini berkata: Maka 'Uqbah bin Muslim memberitahu saya bahawa Shaufaiy, adalah orang yang masuk menemui Mu'awiyah untuk memberitahunya tentang ini. Abu Uthman berkata: 'Ini telah dilakukan dengan orang-orang ini, lalu bagaimana dengan mereka yang masih tinggal di antara manusia? Kemudian Mu'awiyah mula menangis dengan begitu kuat, sehingga kami menyangka bahawa dia akan membunuh dirinya dengan tangisan yang berlebihan. Kami berkata: Orang ini datang kepada kami untuk menyebabkan keburukan. Kemudian Mu'awiyah pulih, menyeka wajahnya dan berkata: Allah dan Rasul-Nya telah berkata benar: Barangsiapa yang menginginkan kehidupan dunia dan perhiasannya, maka Kami akan membayar dengan sepenuhnya (upah) amalan mereka di dalamnya, dan mereka tidak akan dikurangi di dalamnya. Mereka itulah orang-orang yang tidak ada bagi mereka di Akhirat kecuali Api Neraka, dan sia-sia amalan yang mereka lakukan di dalamnya. Dan tidak memberi kesan apa yang mereka dahulu lakukan.",
        "arabic_text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَخْبَرَنَا حَيْوَةُ بْنُ شُرَيْحٍ، أَخْبَرَنِي الْوَلِيدُ بْنُ أَبِي الْوَلِيدِ أَبُو عُثْمَانَ الْمَدَائِنِيُّ،‏‏‏‏ أَنَّ عُقْبَةَ بْنَ مُسْلِمٍ حَدَّثَهُ، ‏‏‏‏‏‏أَنَّ شُفَيًّا الْأَصْبَحِيَّ حَدَّثَهُ، ‏‏‏‏‏‏أَنَّهُ دَخَلَ الْمَدِينَةَ فَإِذَا هُوَ بِرَجُلٍ قَدِ اجْتَمَعَ عَلَيْهِ النَّاسُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَنْ هَذَا ؟ فَقَالُوا:‏‏‏‏ أَبُو هُرَيْرَةَ، ‏‏‏‏‏‏فَدَنَوْتُ مِنْهُ حَتَّى قَعَدْتُ بَيْنَ يَدَيْهِ وَهُوَ يُحَدِّثُ النَّاسَ، ‏‏‏‏‏‏فَلَمَّا سَكَتَ وَخَلَا قُلْتُ لَهُ:‏‏‏‏ أَنْشُدُكَ بِحَقٍّ وَبِحَقٍّ لَمَا حَدَّثْتَنِي حَدِيثًا سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَقَلْتَهُ وَعَلِمْتَهُ، ‏‏‏‏‏‏فَقَالَ أَبُو هُرَيْرَةَ:‏‏‏‏ أَفْعَلُ لَأُحَدِّثَنَّكَ حَدِيثًا حَدَّثَنِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَقَلْتُهُ وَعَلِمْتُهُ، ‏‏‏‏‏‏ثُمَّ نَشَغَ أَبُو هُرَيْرَةَ نَشْغَةً فَمَكَثَ قَلِيلًا، ‏‏‏‏‏‏ثُمَّ أَفَاقَ،‏‏‏‏ فَقَالَ:‏‏‏‏ لَأُحَدِّثَنَّكَ حَدِيثًا حَدَّثَنِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذَا الْبَيْتِ مَا مَعَنَا أَحَدٌ غَيْرِي وَغَيْرُهُ، ‏‏‏‏‏‏ثُمَّ نَشَغَ أَبُو هُرَيْرَةَ نَشْغَةً أُخْرَى، ‏‏‏‏‏‏ثُمَّ أَفَاقَ فَمَسَحَ وَجْهَهُ،‏‏‏‏ فَقَالَ:‏‏‏‏ لَأُحَدِّثَنَّكَ حَدِيثًا حَدَّثَنِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَأَنَا وَهُوَ فِي هَذَا الْبَيْتِ مَا مَعَنَا أَحَدٌ غَيْرِي وَغَيْرُهُ، ‏‏‏‏‏‏ثُمَّ نَشَغَ أَبُو هُرَيْرَةَ نَشْغَةً أُخْرَى، ‏‏‏‏‏‏ثُمَّ أَفَاقَ وَمَسَحَ وَجْهَهُ،‏‏‏‏ فَقَالَ:‏‏‏‏ أَفْعَلُ لَأُحَدِّثَنَّكَ حَدِيثًا حَدَّثَنِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا مَعَهُ فِي هَذَا الْبَيْتِ مَا مَعَهُ أَحَدٌ غَيْرِي وَغَيْرُهُ، ‏‏‏‏‏‏ثُمَّ نَشَغَ أَبُو هُرَيْرَةَ نَشْغَةً شَدِيدَةً، ‏‏‏‏‏‏ثُمَّ مَالَ خَارًّا عَلَى وَجْهِهِ فَأَسْنَدْتُهُ عَلَيَّ طَوِيلًا، ‏‏‏‏‏‏ثُمَّ أَفَاقَ،‏‏‏‏ فَقَالَ:‏‏‏‏ حَدَّثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏أَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى إِذَا كَانَ يَوْمُ الْقِيَامَةِ يَنْزِلُ إِلَى الْعِبَادِ لِيَقْضِيَ بَيْنَهُمْ وَكُلُّ أُمَّةٍ جَاثِيَةٌ فَأَوَّلُ مَنْ يَدْعُو بِهِ رَجُلٌ جَمَعَ الْقُرْآنَ، ‏‏‏‏‏‏وَرَجُلٌ قُتِلَ فِي سَبِيلِ اللَّهِ، ‏‏‏‏‏‏وَرَجُلٌ كَثِيرُ الْمَالِ، ‏‏‏‏‏‏فَيَقُولُ اللَّهُ لِلْقَارِئِ:‏‏‏‏ أَلَمْ أُعَلِّمْكَ مَا أَنْزَلْتُ عَلَى رَسُولِي ؟ قَالَ:‏‏‏‏ بَلَى يَا رَبِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَمَاذَا عَمِلْتَ فِيمَا عُلِّمْتَ ؟ قَالَ:‏‏‏‏ كُنْتُ أَقُومُ بِهِ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ، ‏‏‏‏‏‏فَيَقُولُ اللَّهُ لَهُ:‏‏‏‏ كَذَبْتَ، ‏‏‏‏‏‏وَتَقُولُ لَهُ الْمَلَائِكَةُ:‏‏‏‏ كَذَبْتَ، ‏‏‏‏‏‏وَيَقُولُ اللَّهُ لَهُ:‏‏‏‏ بَلْ أَرَدْتَ أَنْ يُقَالَ:‏‏‏‏ إِنَّ فُلَانًا قَارِئٌ فَقَدْ قِيلَ ذَاكَ، ‏‏‏‏‏‏وَيُؤْتَى بِصَاحِبِ الْمَالِ فَيَقُولُ اللَّهُ لَهُ:‏‏‏‏ أَلَمْ أُوَسِّعْ عَلَيْكَ حَتَّى لَمْ أَدَعْكَ تَحْتَاجُ إِلَى أَحَدٍ ؟ قَالَ:‏‏‏‏ بَلَى يَا رَبِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَمَاذَا عَمِلْتَ فِيمَا آتَيْتُكَ ؟ قَالَ:‏‏‏‏ كُنْتُ أَصِلُ الرَّحِمَ وَأَتَصَدَّقُ، ‏‏‏‏‏‏فَيَقُولُ اللَّهُ لَهُ:‏‏‏‏ كَذَبْتَ، ‏‏‏‏‏‏وَتَقُولُ لَهُ الْمَلَائِكَةُ:‏‏‏‏ كَذَبْتَ، ‏‏‏‏‏‏وَيَقُولُ اللَّهُ تَعَالَى:‏‏‏‏ بَلْ أَرَدْتَ أَنْ يُقَالَ:‏‏‏‏ فُلَانٌ جَوَادٌ فَقَدْ قِيلَ ذَاكَ، ‏‏‏‏‏‏وَيُؤْتَى بِالَّذِي قُتِلَ فِي سَبِيلِ اللَّهِ، ‏‏‏‏‏‏فَيَقُولُ اللَّهُ لَهُ:‏‏‏‏ فِي مَاذَا قُتِلْتَ ؟ فَيَقُولُ:‏‏‏‏ أُمِرْتُ بِالْجِهَادِ فِي سَبِيلِكَ فَقَاتَلْتُ حَتَّى قُتِلْتُ، ‏‏‏‏‏‏فَيَقُولُ اللَّهُ تَعَالَى لَهُ:‏‏‏‏ كَذَبْتَ، ‏‏‏‏‏‏وَتَقُولُ لَهُ الْمَلَائِكَةُ:‏‏‏‏ كَذَبْتَ، ‏‏‏‏‏‏وَيَقُولُ اللَّهُ:‏‏‏‏ بَلْ أَرَدْتَ أَنْ يُقَالَ:‏‏‏‏ فُلَانٌ جَرِيءٌ، ‏‏‏‏‏‏فَقَدْ قِيلَ ذَاكَ، ‏‏‏‏‏‏ثُمَّ ضَرَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى رُكْبَتِي، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا أَبَا هُرَيْرَةَ أُولَئِكَ الثَّلَاثَةُ أَوَّلُ خَلْقِ اللَّهِ تُسَعَّرُ بِهِمُ النَّارُ يَوْمَ الْقِيَامَةِ ،‏‏‏‏ وَقَالَ الْوَلِيدُ أَبُو عُثْمَانَ:‏‏‏‏ فَأَخْبَرَنِي عُقْبَةُ بْنُ مُسْلِمٍ، ‏‏‏‏‏‏أَنَّ شُفَيًّا هُوَ الَّذِي دَخَلَ عَلَى مُعَاوِيَةَ فَأَخْبَرَهُ بِهَذَا، ‏‏‏‏‏‏قَالَ أَبُو عُثْمَانَ، ‏‏‏‏‏‏وَحَدَّثَنِي الْعَلَاءُ بْنُ أَبِي حَكِيمٍ، ‏‏‏‏‏‏أَنَّهُ كَانَ سَيَّافًا لِمُعَاوِيَةَ، ‏‏‏‏‏‏فَدَخَلَ عَلَيْهِ رَجُلٌ فَأَخْبَرَهُ بِهَذَا، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏فَقَالَ مُعَاوِيَةُ:‏‏‏‏ قَدْ فُعِلَ بِهَؤُلَاءِ هَذَا، ‏‏‏‏‏‏فَكَيْفَ بِمَنْ بَقِيَ مِنَ النَّاسِ ثُمَّ بَكَى مُعَاوِيَةُ بُكَاءً شَدِيدًا حَتَّى ظَنَنَّا أَنَّهُ هَالِكٌ، ‏‏‏‏‏‏وَقُلْنَا:‏‏‏‏ قَدْ جَاءَنَا هَذَا الرَّجُلُ بِشَرٍّ، ‏‏‏‏‏‏ثُمَّ أَفَاقَ مُعَاوِيَةُ وَمَسَحَ عَنْ وَجْهِهِ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ صَدَقَ اللَّهُ وَرَسُولُهُ مَنْ كَانَ يُرِيدُ الْحَيَاةَ الدُّنْيَا وَزِينَتَهَا نُوَفِّ إِلَيْهِمْ أَعْمَالَهُمْ فِيهَا وَهُمْ فِيهَا لا يُبْخَسُونَ ‏‏‏‏ 15 ‏‏‏‏ أُولَئِكَ الَّذِينَ لَيْسَ لَهُمْ فِي الآخِرَةِ إِلا النَّارُ وَحَبِطَ مَا صَنَعُوا فِيهَا وَبَاطِلٌ مَا كَانُوا يَعْمَلُونَ ‏‏‏‏ 16 ‏‏‏‏ سورة هود آية 15-16،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ."
      },
      {
        "id": 17507,
        "hadith_number": "2383",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Ancaman Neraka 'Telaga Kesedihan' Bagi Orang Riya'",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said: Seek refuge in Allah from the Pit of Sorrows. They said: O Messenger of Allah! What is the Pit of Sorrows? He said: gorge in Hell from which Hell seeks Allah's refuge a Hundred times every day. It was said: O Messenger of Allah! Who shall enter it? He said: The reciters who were showing off with their deeds.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Berlindunglah kepada Allah daripada Telaga Kesedihan. Mereka bertanya: Wahai Rasulullah! Apakah Telaga Kesedihan itu? Baginda bersabda: Jurang di Neraka yang mana Neraka sendiri meminta perlindungan Allah daripadanya seratus kali setiap hari. Ditanyakan: Wahai Rasulullah! Siapakah yang akan memasukinya? Baginda bersabda: Para pembaca (Al-Quran) yang riak dengan amalan mereka.",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنِي الْمُحَارِبِيُّ، عَنْ عَمَّارِ بْنِ سَيْفٍ الضَّبِّيِّ، عَنْ أَبِي مُعَانٍ الْبَصْرِيِّ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ تَعَوَّذُوا بِاللَّهِ مِنْ جُبِّ الْحَزَنِ ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏ وَمَا جُبُّ الْحَزَنِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَادٍ فِي جَهَنَّمَ تَتَعَوَّذُ مِنْهُ جَهَنَّمُ كُلَّ يَوْمٍ مِائَةَ مَرَّةٍ ،‏‏‏‏ قُلْنَا:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏ وَمَنْ يَدْخُلُهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ الْقُرَّاءُ الْمُرَاءُونَ بِأَعْمَالِهِمْ ،‏‏‏‏ قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ."
      },
      {
        "id": 17508,
        "hadith_number": "2384",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Ganjaran Tersembunyi dan Terang",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Abu Hurairah narrated that A man said: O Messenger of Allah! A man does a deed and conceals it, but when it is discovered that he did it, he is happy about that. He said: The Messenger of Allah (s.a.w) said: 'He receives two rewards: A reward in its concealment, and a reward in its publicity.'",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa seorang lelaki berkata: Wahai Rasulullah! Seorang lelaki melakukan suatu perbuatan dan menyembunyikannya, tetapi apabila diketahui bahawa dia yang melakukannya, dia gembira tentang hal itu. Baginda bersabda: Rasulullah (s.a.w) bersabda: 'Dia menerima dua ganjaran: Ganjaran dalam penyembunyiannya, dan ganjaran dalam pengumumannya.'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا أَبُو سِنَانٍ الشَّيْبَانِيُّ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَجُلٌ:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏ الرَّجُلُ يَعْمَلُ الْعَمَلَ فَيُسِرُّهُ فَإِذَا اطُّلِعَ عَلَيْهِ أَعْجَبَهُ ذَلِكَ، ‏‏‏‏‏‏قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَهُ أَجْرَانِ أَجْرُ السِّرِّ وَأَجْرُ الْعَلَانِيَةِ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏وَقَدْ رَوَاهُ الْأَعْمَشُ، وَغَيْرُهُ،‏‏‏‏ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ أَبِي صَالِحٍ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا، ‏‏‏‏‏‏وَأَصْحَابُ الْأَعْمَشِ لَمْ يَذْكُرُوا فِيهِ عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَقَدْ فَسَّرَ بَعْضُ أَهْلِ الْعِلْمِ هَذَا الْحَدِيثَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِذَا اطُّلِعَ عَلَيْهِ فَأَعْجَبَهُ فَإِنَّمَا مَعْنَاهُ أَنْ يُعْجِبَهُ ثَنَاءُ النَّاسِ عَلَيْهِ بِالْخَيْرِ، ‏‏‏‏‏‏لِقَوْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَنْتُمْ شُهَدَاءُ اللَّهِ فِي الْأَرْضِ فَيُعْجِبُهُ ثَنَاءُ النَّاسِ عَلَيْهِ، ‏‏‏‏‏‏لِهَذَا لِمَا يَرْجُو بِثَنَاءِ النَّاسِ عَلَيْهِ فَأَمَّا إِذَا أَعْجَبَهُ لِيَعْلَمَ النَّاسُ مِنْهُ الْخَيْرَ، ‏‏‏‏‏‏لِيُكْرَمَ عَلَى ذَلِكَ وَيُعَظَّمَ عَلَيْهِ فَهَذَا رِيَاءٌ ،‏‏‏‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ:‏‏‏‏ إِذَا اطُّلِعَ عَلَيْهِ فَأَعْجَبَهُ رَجَاءَ أَنْ يَعْمَلَ بِعَمَلِهِ فَيَكُونُ لَهُ مِثْلُ أُجُورِهِمْ، ‏‏‏‏‏‏فَهَذَا لَهُ مَذْهَبٌ أَيْضًا."
      },
      {
        "id": 17509,
        "hadith_number": "2385",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Pertanyaan tentang Kiamat dan Balasan bagi Orang yang Mencintai Allah dan Rasul-Nya",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Anas narrated that a man came to the Messenger of Allah (s.a.w) and said: O Messenger of Allah! When will the Hour be established? So the Propher (s.a.w) stood to perform Salat and when he was finished his Salat he said: Where is the one who asked when the hour will be established? The man said: It was I, O Mesenger of Allah! He said: What have you prepared for it? He said: O Messenger of allah! I have not prepared very much of salat nor fasting for it, but I love Allah and His Messenger. So the Messenger of Allah(s.a.w) said: A man shall be with whom ever he loves, and you shall be with whomever you love. So after the advent of Islam, I did not see that anything brought the Muslims more happiness than that.",
        "malay_translation": "Anas meriwayatkan bahawa seorang lelaki datang kepada Rasulullah (s.a.w) dan berkata: Wahai Rasulullah! Bilakah Kiamat akan terjadi? Maka Nabi (s.a.w) berdiri untuk menunaikan solat dan apabila baginda selesai solat, baginda bersabda: Mana orang yang bertanya tentang bilakah Kiamat akan terjadi? Lelaki itu berkata: Saya, wahai Rasulullah! Baginda bersabda: Apa yang telah kamu persiapkan untuknya? Lelaki itu berkata: Wahai Rasulullah! Saya tidak mempersiapkan banyak solat mahupun puasa untuknya, tetapi saya mencintai Allah dan Rasul-Nya. Maka Rasulullah (s.a.w) bersabda: Seseorang akan bersama dengan orang yang dicintainya, dan kamu akan bersama dengan orang yang kamu cintai. Maka selepas kedatangan Islam, saya tidak melihat sesuatu pun yang membawa kegembiraan yang lebih besar kepada umat Islam daripada itu.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا إِسْمَاعِيل بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، أَنَّهُ قَالَ:‏‏‏‏ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏ مَتَى قِيَامُ السَّاعَةِ، ‏‏‏‏‏‏فَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الصَّلَاةِ، ‏‏‏‏‏‏فَلَمَّا قَضَى صَلَاتَهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَيْنَ السَّائِلُ عَنْ قِيَامِ السَّاعَةِ ؟ فَقَالَ الرَّجُلُ:‏‏‏‏ أَنَا يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَا أَعْدَدْتَ لَهَا ؟ قَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ مَا أَعْدَدْتُ لَهَا كَبِيرَ صَلَاةٍ، ‏‏‏‏‏‏وَلَا صَوْمٍ إِلَّا أَنِّي أُحِبُّ اللَّهَ وَرَسُولَهُ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْمَرْءُ مَعَ مَنْ أَحَبَّ وَأَنْتَ مَعَ مَنْ أَحْبَبْتَ ،‏‏‏‏ فَمَا رَأَيْتُ فَرِحَ الْمُسْلِمُونَ بَعْدَ الْإِسْلَامِ فَرَحَهُمْ بِهَذَا،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ صَحِيحٌ."
      },
      {
        "id": 17510,
        "hadith_number": "2386",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Seseorang Bersama Orang yang Dicintainya",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Anas bin Malik narrated that the Messenger of Allah (s.a.w) said: A man shall be with whoever he loves, and for him shall be what he has earned.",
        "malay_translation": "Anas bin Malik meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Seseorang akan bersama dengan orang yang dicintainya, dan baginya adalah apa yang telah diusahakannya.",
        "arabic_text": "حَدَّثَنَا أَبُو هِشَامٍ الرِّفَاعِيُّ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ أَشْعَثَ، عَنِ الْحَسَنِ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْمَرْءُ مَعَ مَنْ أَحَبَّ وَلَهُ مَا اكْتَسَبَ ،‏‏‏‏ وفي الباب عن عَلِيٍّ، ‏‏‏‏‏‏وَعَبْدِ اللَّهِ بْنِ مَسْعُودٍ، ‏‏‏‏‏‏وَصَفْوَانَ بْنِ عَسَّالٍ، ‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَأَبِي مُوسَى، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ حَدِيثِ الْحَسَنِ الْبَصْرِيِّ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ وَجْهٍ،‏‏‏‏ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 17511,
        "hadith_number": "2387",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Seseorang Akan Bersama Dengan Orang Yang Dicintainya",
        "perawi_melayu": "Tidak diketahui",
        "english_text": "Safwan bin Assal narrated that a Bedouin with a loud voice and said: O Muhammad! A man loves the people but does not catch up to them (in deeds). So the Messenger of Allah(s.a.w) said: A man shall be with whomever he loves.",
        "malay_translation": "Safwan bin Assal meriwayatkan bahawa seorang Badwi dengan suara yang lantang berkata: Wahai Muhammad! Seseorang mencintai orang lain tetapi tidak dapat menyamai mereka (dalam amal perbuatan). Maka Rasulullah (s.a.w) bersabda: Seseorang akan bersama dengan orang yang dicintainya.",
        "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَاصِمٍ، عَنْ زِرِّ بْنِ حُبَيْشٍ، عَنْ صَفْوَانَ بْنِ عَسَّالٍ، قَالَ:‏‏‏‏ جَاءَ أَعْرَابِيٌّ جَهْوَرِيُّ الصَّوْتِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا مُحَمَّدُ الرَّجُلُ يُحِبُّ الْقَوْمَ وَلَمَّا يَلْحَقْ بِهِمْ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْمَرْءُ مَعَ مَنْ أَحَبَّ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17512,
        "hadith_number": "2388",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Allah Bersama Hamba-Nya yang Berdoa dan Berprasangka Baik",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said: Indeed Allah Most High says: 'I am as My slave thinks of Me, and I am with him when He calls upon Me.'",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Sesungguhnya Allah SWT berfirman: 'Aku sebagaimana sangkaan hamba-Ku kepada-Ku, dan Aku bersama-Nya ketika dia berdoa kepada-Ku.'",
        "arabic_text": "حَدَّثَنَا حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، عَنْ جَعْفَرِ بْنِ بُرْقَانَ، عَنْ يَزِيدَ بْنِ الْأَصَمِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ اللَّهَ يَقُولُ:‏‏‏‏ أَنَا عِنْدَ ظَنِّ عَبْدِي بِي وَأَنَا مَعَهُ إِذَا دَعَانِي ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17513,
        "hadith_number": "2389",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Maksud Kebaikan dan Dosa",
        "perawi_melayu": "An-Nawas bin Sama'an",
        "english_text": "An-Nawas bin Sama'an narrated that a man came asking the Messenger of Allah (s.a.w) about righteousness and sin. So the Prophet (s.a.w) said: Righteouness is good behaviour, and sin is what fluctuates in your chest, and you would hate that the people discovered it about you.",
        "malay_translation": "An-Nawas bin Sama'an meriwayatkan bahawa seorang lelaki datang bertanya kepada Rasulullah (s.a.w) tentang kebaikan dan dosa. Maka Nabi (s.a.w) bersabda: Kebaikan adalah akhlak yang baik, dan dosa adalah apa yang berbolak-balik di dadamu, dan kamu benci jika orang lain mengetahuinya tentang kamu.",
        "arabic_text": "حَدَّثَنَا مُوسَى بْنُ عَبْدِ الرَّحْمَنِ الْكِنْدِيُّ الْكُوفِيُّ، حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ، حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ جُبَيْرِ بْنِ نُفَيْرٍ الْحَضْرَمِيُّ، عَنْ أَبِيهِ، عَنِ النَّوَّاسِ بْنِ سَمْعَانَ، أَنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْبِرِّ وَالْإِثْمِ، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْبِرُّ حُسْنُ الْخُلُقِ، ‏‏‏‏‏‏وَالْإِثْمُ مَا حَاكَ فِي نَفْسِكَ وَكَرِهْتَ أَنْ يَطَّلِعَ عَلَيْهِ النَّاسُ ."
      },
      {
        "id": 17514,
        "hadith_number": "2390",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keutamaan Saling Mencintai Kerana Allah",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Mu'adh binJabal narrated that the Messenger of Allah (s.a.w) said: Allah, the Mighty and Sublime, said: 'Those who love each other for the sake of My Majesty shall be upon podiums of light, and they will be admired by the Prophets and the martyrs.'",
        "malay_translation": "Mu'adh bin Jabal meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Allah, Yang Maha Perkasa dan Maha Agung, berfirman: 'Orang-orang yang saling mencintai kerana keagungan-Ku akan berada di atas mimbar-mimbar cahaya, dan mereka akan dikagumi oleh para Nabi dan para syuhada.'",
        "arabic_text": "حَدَّثَنَا حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا كَثِيرُ بْنُ هِشَامٍ، حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ، حَدَّثَنَا حَبِيبُ بْنُ أَبِي مَرْزُوقٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ أَبِي مُسْلِمٍ الْخَوْلَانِيِّ، حَدَّثَنِي مُعَاذُ بْنُ جَبَلٍ، قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ قَالَ اللَّهُ عَزَّ وَجَلَّ:‏‏‏‏ الْمُتَحَابُّونَ فِي جَلَالِي لَهُمْ مَنَابِرُ مِنْ نُورٍ يَغْبِطُهُمُ النَّبِيُّونَ وَالشُّهَدَاءُ ،‏‏‏‏ وفي الباب عن أَبِي الدَّرْدَاءِ، ‏‏‏‏‏‏وَابْنِ مَسْعُودٍ، ‏‏‏‏‏‏وَعُبَادَةَ بْنِ الصَّامِتِ، ‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَأَبِي مَالِكٍ الْأَشْعَرِيِّ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَأَبُو مُسْلِمٍ الْخَوْلَانِيُّ اسْمُهُ:‏‏‏‏ عَبْدُ اللَّهِ بْنُ ثُوَبَ."
      },
      {
        "id": 17515,
        "hadith_number": "2391",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Tujuh Golongan yang Mendapat Naungan Allah pada Hari Kiamat",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Hafs bin 'Asim narrated from Abu Hurairah or Abu Sa'eed that the Messenger of Allah (s.a.w) said: Seven shall be shaded by Allah under his shade on a day in which there is no shade except His Shade: A just Imam, a young person raised upon worshiping Allah, a man whose heart is attached to the Masjid when he leaves from it until he returns from it, two men who love each other for Allah's sake, coming together upon that, and parting upon that, a man who remembers Allah in privacy and his eyes swell with tears, a man invited by a woman of status and beauty, but he says: 'I fear Allah, Mighty and Sublime is He,' and a man who conceals the charity he gives such that his left hand does not know what his right hand has spent.",
        "malay_translation": "Hafs bin 'Asim meriwayatkan daripada Abu Hurairah atau Abu Sa'eed bahawa Rasulullah (s.a.w) bersabda: Tujuh golongan yang akan dinaungi oleh Allah di bawah naungan-Nya pada hari yang tidak ada naungan kecuali naungan-Nya: Imam yang adil, seorang pemuda yang dibesarkan dalam beribadah kepada Allah, seorang lelaki yang hatinya terpaut pada masjid ketika dia keluar darinya hingga dia kembali kepadanya, dua orang lelaki yang saling mencintai kerana Allah, berkumpul dan berpisah kerana itu, seorang lelaki yang mengingati Allah secara bersendirian lalu matanya berlinang air mata, seorang lelaki yang diajak oleh seorang wanita yang berstatus dan cantik, tetapi dia berkata: 'Sesungguhnya aku takut kepada Allah, Maha Perkasa dan Maha Agung Dia,' dan seorang lelaki yang menyembunyikan sedekah yang diberikannya sehingga tangan kirinya tidak tahu apa yang telah dibelanjakan oleh tangan kanannya.",
        "arabic_text": "حَدَّثَنَا الْأَنْصَارِيُّ، حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكٌ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ أَوْ عَنْ أَبِي سَعِيدٍ،‏‏‏‏ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ سَبْعَةٌ يُظِلُّهُمُ اللَّهُ فِي ظِلِّهِ يَوْمَ لَا ظِلَّ إِلَّا ظِلُّهُ، ‏‏‏‏‏‏إِمَامٌ عَادِلٌ، ‏‏‏‏‏‏وَشَابٌّ نَشَأَ بِعِبَادَةِ اللَّهِ، ‏‏‏‏‏‏وَرَجُلٌ كَانَ قَلْبُهُ مُعَلَّقًا بِالْمَسْجِدِ إِذَا خَرَجَ مِنْهُ حَتَّى يَعُودَ إِلَيْهِ، ‏‏‏‏‏‏وَرَجُلَانِ تَحَابَّا فِي اللَّهِ فَاجْتَمَعَا عَلَى ذَلِكَ وَتَفَرَّقَا، ‏‏‏‏‏‏وَرَجُلٌ ذَكَرَ اللَّهَ خَالِيًا فَفَاضَتْ عَيْنَاهُ، ‏‏‏‏‏‏وَرَجُلٌ دَعَتْهُ امْرَأَةٌ ذَاتُ حَسَبٍ وَجَمَالٍ،‏‏‏‏ فَقَالَ:‏‏‏‏ إِنِّي أَخَافُ اللَّهَ، ‏‏‏‏‏‏وَرَجُلٌ تَصَدَّقَ بِصَدَقَةٍ فَأَخْفَاهَا حَتَّى لَا تَعْلَمَ شِمَالُهُ مَا تُنْفِقُ يَمِينُهُ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَهَكَذَا رُوِيَ هَذَا الْحَدِيثُ، ‏‏‏‏‏‏عَنْ مَالِكِ بْنِ أَنَسٍ مِنْ غَيْرِ وَجْهٍ مِثْلَ هَذَا وَشَكَّ فِيهِ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَوْ عَنْ أَبِي سَعِيدٍ، ‏‏‏‏‏‏وَعُبَيْدُ اللَّهِ بْنُ عُمَرَ، ‏‏‏‏‏‏رَوَاهُ عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏وَلَمْ يَشُكَّ فِيهِ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ عَنْ أَبِي هُرَيْرَةَ."
      },
      {
        "id": 17516,
        "hadith_number": "2392",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Galakan Memberitahu Saudara Jika Mencintainya",
        "perawi_melayu": "Al-Miqdam bin Ma'dikarib",
        "english_text": "Al-Miqdam bin Ma'dikarib narrated that the Messenger of Allah (s.a.w) said: When one of you loves his brother,then let him inform him of it.",
        "malay_translation": "Al-Miqdam bin Ma'dikarib meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Apabila salah seorang kamu mencintai saudaranya, maka hendaklah dia memberitahunya tentang hal itu.",
        "arabic_text": "حَدَّثَنَا بُنْدَارٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، حَدَّثَنَا ثَوْرُ بْنُ يَزِيدَ، عَنْ حَبِيبِ بْنِ عُبَيْدٍ، عَنْ الْمِقْدَامِ بْنِ مَعْدِ يكَرِبَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا أَحَبَّ أَحَدُكُمْ أَخَاهُ فَلْيُعْلِمْهُ إِيَّاهُ ،‏‏‏‏ وفي الباب عن أَبِي ذَرٍّ، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ الْمِقْدَامِ حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ، ‏‏‏‏‏‏وَالْمِقْدَامُ يُكْنَى:‏‏‏‏ أَبَا كَرِيمَةَ."
      },
      {
        "id": 17517,
        "hadith_number": "2393",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Larangan Memuji Orang Lain Secara Berlebihan",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Abu Ma'mar said: A man stood and praised one of the 'Amirs so Al-Miqdad bin Al-Aswad threw dust in his face and said: 'The Messenger of Allah (s.a.w) ordered us to throw dust in the faces of those who praise others.'",
        "malay_translation": "Abu Ma'mar berkata: Seorang lelaki berdiri dan memuji salah seorang Amir, lalu Al-Miqdad bin Al-Aswad melemparkan debu ke wajahnya dan berkata: 'Rasulullah (s.a.w) memerintahkan kami untuk melemparkan debu ke wajah mereka yang memuji orang lain.'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ مُجَاهِدٍ، عَنْ أَبِي مَعْمَرٍ، قَالَ:‏‏‏‏ قَامَ رَجُلٌ فَأَثْنَى عَلَى أَمِيرٍ مِنَ الْأُمَرَاءِ، ‏‏‏‏‏‏فَجَعَلَ الْمِقْدَادُ يَحْثُو فِي وَجْهِهِ التُّرَابَ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَحْثُوَ فِي وُجُوهِ الْمَدَّاحِينَ التُّرَابَ ،‏‏‏‏ وفي الباب عن أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدْ رَوَى زَائِدَةُ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، وَحَدِيثُ مُجَاهِدٍ، ‏‏‏‏‏‏عَنْ أَبِي مَعْمَرٍ أَصَحُّ، ‏‏‏‏‏‏وَأَبُو مَعْمَرٍ اسْمُهُ:‏‏‏‏ عَبْدُ اللَّهِ بْنُ سَخْبَرَةَ، ‏‏‏‏‏‏وَالْمِقْدَادُ بْنُ الْأَسْوَدِ هُوَ الْمِقْدَادُ بْنُ عَمْرٍو الْكِنْدِيُّ وَيُكْنَى:‏‏‏‏ أَبَا مَعْبَدٍ وَإِنَّمَا نُسِبَ إِلَى الْأَسْوَدِ بْنِ عَبْدِ يَغُوثَ لِأَنَّهُ كَانَ قَدْ تَبَنَّاهُ وَهُوَ صَغِيرٌ."
      },
      {
        "id": 17518,
        "hadith_number": "2394",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Larangan Melempar Debu ke Mulut Pemuji",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Abu Hurairah narrated: The Messenger of Allah(s.a.w) ordered us to throw dut in the mouths of those who praise others.",
        "malay_translation": "Abu Hurairah meriwayatkan: Rasulullah (s.a.w) memerintahkan kami untuk melemparkan debu ke mulut mereka yang memuji orang lain.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ الْكُوفِيُّ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ سَالِمٍ الْخَيَّاطِ، عَنِ الْحَسَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَحْثُوَ فِي أَفْوَاهِ الْمَدَّاحِينَ التُّرَابَ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ مِنْ حَدِيثِ أَبِي هُرَيْرَةَ."
      },
      {
        "id": 17519,
        "hadith_number": "2395",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Larangan Menemani Kecuali Mukmin dan Memberi Makan Kepada Orang Bertaqwa",
        "perawi_melayu": "Abu Sa'eed",
        "english_text": "Abu Sa'eed narrated that the Messenger of Allah(s.a.w) said: Do not accompany except a believer, and do not serve your food except to one with Taqwa.",
        "malay_translation": "Abu Sa'eed meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Janganlah kamu menemani kecuali seorang mukmin, dan janganlah kamu menghidangkan makananmu kecuali kepada orang yang bertaqwa.",
        "arabic_text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا ابْنُ الْمُبَارَكِ، عَنْ حَيْوَةَ بْنِ شُرَيْحٍ، حَدَّثَنِي سَالِمُ بْنُ غَيْلَانَ، أَنَّ الْوَلِيدَ بْنَ قَيْسٍ التُّجِيبِيَّ أَخْبَرَهُ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ، قَالَ سَالِمٌ، أَوْ عَنْ أَبِي الْهَيْثَمِ، عَنْ أَبِي سَعِيدٍ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ لَا تُصَاحِبْ إِلَّا مُؤْمِنًا، ‏‏‏‏‏‏وَلَا يَأْكُلْ طَعَامَكَ إِلَّا تَقِيٌّ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ إِنَّمَا نَعْرِفُهُ مِنْ هَذَا الْوَجْهِ."
      },
      {
        "id": 17520,
        "hadith_number": "2396",
        "status": "Sahih",
        "nama_buku": "Jami' At-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Balasan Ujian dan Tanda Kasih Allah",
        "perawi_melayu": "Anas",
        "english_text": "Anas narrated that the Messenger of Allah (ﷺ) said: When Allah wants good for his slave, He hastens his punishment in the world. And when He wants bad for His slave, He withholds his sins from him until he appears before Him on the Day of Judgement. And with this (same) chain, (it was reported) from the Prophet (ﷺ) who said: Indeed greater reward comes with greater trial. And indeed, when Allah loves a people He subjects them to trials, so whoever is content, then for him is pleasure, and whoever is discontent, then for him is wrath.",
        "malay_translation": "Anas meriwayatkan bahawa Rasulullah (ﷺ) bersabda: \"Apabila Allah menghendaki kebaikan kepada hamba-Nya, Dia menyegerakan hukumannya di dunia. Dan apabila Dia menghendaki keburukan kepada hamba-Nya, Dia menangguhkan dosanya sehingga dia menghadap-Nya pada Hari Kiamat.\" Dan dengan sanad yang sama, (diriwayatkan) daripada Nabi (ﷺ) yang bersabda: \"Sesungguhnya ganjaran yang besar datang bersama dengan ujian yang besar. Dan sesungguhnya, apabila Allah mencintai suatu kaum, Dia menguji mereka, maka sesiapa yang reda, maka baginya adalah keredhaan, dan sesiapa yang tidak reda, maka baginya adalah kemurkaan.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ سَعْدِ بْنِ سِنَانٍ، عَنْ أَنَسٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا أَرَادَ اللَّهُ بِعَبْدِهِ الْخَيْرَ عَجَّلَ لَهُ الْعُقُوبَةَ فِي الدُّنْيَا، ‏‏‏‏‏‏وَإِذَا أَرَادَ اللَّهُ بِعَبْدِهِ الشَّرَّ أَمْسَكَ عَنْهُ بِذَنْبِهِ حَتَّى يُوَافِيَ بِهِ يَوْمَ الْقِيَامَةِ ."
      },
      {
        "id": 17521,
        "hadith_number": "2397",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keperitan Penyakit Rasulullah SAW",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Aishah said: I have not seen ailment effecting anyone worse than upon the Messenger of Allah (s.a.w).",
        "malay_translation": "Aisyah berkata: Saya tidak pernah melihat penyakit yang menimpa seseorang lebih teruk daripada yang menimpa Rasulullah (s.a.w).",
        "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو دَاوُدَ، أَخْبَرَنَا شُعْبَةُ، عَنِ الْأَعْمَشِ، قَال:‏‏‏‏ سَمِعْتُ أَبَا وَائِلٍ يَقُولُ:‏‏‏‏ قَالَتْ عَائِشَةُ:‏‏‏‏ مَا رَأَيْتُ الْوَجَعَ عَلَى أَحَدٍ أَشَدَّ مِنْهُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17522,
        "hadith_number": "2398",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Ujian Paling Berat Menimpa Umat",
        "perawi_melayu": "Mus'ab bin Sa'd daripada bapanya",
        "english_text": "Mus'ab bin Sa'd narrated from his father that a man said: O Messenger of Allah(s.a.w)! Which of the people is tried most severely? He said: The Prophets, then those nearest to them, then those nearest to them. A man is tried according to his religion; if he is firm in his religion, then his trials are more severe, and if he is frail in his religion, then he is tried according to the strength of his religion. The servant shall continue to be tried until he is left walking upon the earth without any sins.",
        "malay_translation": "Mus'ab bin Sa'd meriwayatkan daripada bapanya, bahawa seorang lelaki bertanya: “Wahai Rasulullah (s.a.w)! Siapakah di kalangan manusia yang paling berat ujiannya?” Baginda menjawab: “Para Nabi, kemudian orang yang paling hampir dengan mereka, kemudian orang yang paling hampir dengan mereka. Seseorang itu diuji mengikut agamanya; jika dia teguh dalam agamanya, maka ujiannya lebih berat, dan jika dia lemah dalam agamanya, maka dia diuji mengikut kekuatan agamanya. Seorang hamba akan terus diuji sehingga dia berjalan di atas bumi tanpa sebarang dosa.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَاصِمِ بْنِ بَهْدَلَةَ، عَنْ مُصْعَبِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏ أَيُّ النَّاسِ أَشَدُّ بَلَاءً ؟ قَالَ:‏‏‏‏ الْأَنْبِيَاءُ، ‏‏‏‏‏‏ثُمَّ الْأَمْثَلُ، ‏‏‏‏‏‏فَالْأَمْثَلُ، ‏‏‏‏‏‏فَيُبْتَلَى الرَّجُلُ عَلَى حَسَبِ دِينِهِ، ‏‏‏‏‏‏فَإِنْ كَانَ دِينُهُ صُلْبًا اشْتَدَّ بَلَاؤُهُ، ‏‏‏‏‏‏وَإِنْ كَانَ فِي دِينِهِ رِقَّةٌ ابْتُلِيَ عَلَى حَسَبِ دِينِهِ، ‏‏‏‏‏‏فَمَا يَبْرَحُ الْبَلَاءُ بِالْعَبْدِ حَتَّى يَتْرُكَهُ يَمْشِي عَلَى الْأَرْضِ مَا عَلَيْهِ خَطِيئَةٌ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وفي الباب عن أَبِي هُرَيْرَةَ،‏‏‏‏ وَأُخْتِ حُذَيْفَةَ بْنِ الْيَمَانِ،‏‏‏‏ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ أَيُّ النَّاسِ أَشَدُّ بَلَاءً ؟ قَالَ:‏‏‏‏ الْأَنْبِيَاءُ ثُمَّ الْأَمْثَلُ فَالْأَمْثَلُ."
      },
      {
        "id": 17523,
        "hadith_number": "2399",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Ujian Penghapus Dosa Bagi Mukmin",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah narrated that the Messenger of Allah(s.a.w) said: Trials will not cease afflicting the believing man and the believing woman in their self, children, and wealth, until they meet Allah without having any sin.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Ujian tidak akan berhenti menimpa lelaki dan wanita mukmin pada diri mereka, anak-anak mereka, dan harta benda mereka, sehingga mereka bertemu Allah tanpa memiliki dosa.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَا يَزَالُ الْبَلَاءُ بِالْمُؤْمِنِ وَالْمُؤْمِنَةِ فِي نَفْسِهِ وَوَلَدِهِ وَمَالِهِ حَتَّى يَلْقَى اللَّهَ وَمَا عَلَيْهِ خَطِيئَةٌ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17524,
        "hadith_number": "2400",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Ganjaran Syurga Bagi Hamba Yang Kehilangan Penglihatan",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "Anas bin Malik narrated that the Messenger of Allah(s.a.w) said: Indeed Allah [Most High] said: 'When I take My slave's sight in the world, then there shall be no reward for him with Me except Paradise.'",
        "malay_translation": "Anas bin Malik meriwayatkan bahawa Rasulullah SAW bersabda: Sesungguhnya Allah [Yang Maha Tinggi] berfirman: 'Apabila Aku mengambil penglihatan hamba-Ku di dunia, maka tidak ada pahala baginya di sisi-Ku kecuali syurga.'",
        "arabic_text": "حَدَّثَنَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُعَاوِيَةَ الْجُمَحِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ، حَدَّثَنَا أَبُو ظِلَالٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ اللَّهَ يَقُولُ:‏‏‏‏ إِذَا أَخَذْتُ كَرِيمَتَيْ عَبْدِي فِي الدُّنْيَا لَمْ يَكُنْ لَهُ جَزَاءٌ عِنْدِي إِلَّا الْجَنَّةَ ،‏‏‏‏ وفي الباب عن أَبِي هُرَيْرَةَ،‏‏‏‏ وَزَيْدِ بْنِ أَرْقَمَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَأَبُو ظِلَالٍ اسْمُهُ:‏‏‏‏ هِلَالٌ."
      },
      {
        "id": 17525,
        "hadith_number": "2401",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Ganjaran Syurga bagi Orang yang Sabar Kehilangan Penglihatan",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah (narrated from) the Prophet(s.a.w) who said: Allah, Mighty and Sublime is He, said: 'For whomever I take his sight, and he is patient and seeking a reward, I shall not be satisfied with any reward for him less than Paradise.'",
        "malay_translation": "Abu Hurairah (meriwayatkan daripada) Nabi (s.a.w) bersabda: Allah, Maha Perkasa lagi Maha Agung, berfirman: 'Sesiapa yang Aku ambil penglihatannya, dan dia bersabar dan mengharapkan pahala, Aku tidak akan reda baginya dengan ganjaran yang kurang daripada Syurga.'",
        "arabic_text": "حَدَّثَنَا حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا سُفْيَانُ، عَنِ الْأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، رَفَعَهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ يَقُولُ اللَّهُ عَزَّ وَجَلَّ:‏‏‏‏ مَنْ أَذْهَبْتُ حَبِيبَتَيْهِ فَصَبَرَ وَاحْتَسَبَ لَمْ أَرْضَ لَهُ ثَوَابًا دُونَ الْجَنَّةِ ،‏‏‏‏ وفي الباب عن عِرْبَاضِ بْنِ سَارِيَةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 17526,
        "hadith_number": "2402",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keinginan Orang yang Dimaafkan di Hari Kiamat",
        "perawi_melayu": "Jabir",
        "english_text": "Jabir narrated that the Prophet (s.a.w) said: On the Day of Judgement, when the people who were tried (in this world) are given their rewards, the people who were pardoned (in life), will wish that their skins had been cut off with scissors while they were in the world. This Hadith is Gharib, we do not know of it with this chain except through this route. Some of them have reported something similar to this Hadith from Al-A`mash, from Talhah bin Musarrif from Masruq.",
        "malay_translation": "Jabir meriwayatkan bahawa Nabi (s.a.w) bersabda: Pada Hari Kiamat, apabila orang-orang yang diuji (di dunia ini) diberikan pahala mereka, orang-orang yang dimaafkan (dalam kehidupan), akan berharap kulit mereka dipotong dengan gunting semasa mereka di dunia. Hadis ini Gharib, kami tidak mengetahuinya dengan sanad ini kecuali melalui jalur ini. Beberapa dari mereka telah melaporkan sesuatu yang serupa dengan Hadis ini dari Al-A`mash, dari Talhah bin Musarrif dari Masruq.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ، وَيُوسُفُ بْنُ مُوسَى الْقَطَّانُ الْبَغْدَادِيُّ، قَالَا:‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَغْرَاءَ أَبُو زُهَيْرٍ، عَنِ الْأَعْمَشِ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَوَدُّ أَهْلُ الْعَافِيَةِ يَوْمَ الْقِيَامَةِ حِينَ يُعْطَى أَهْلُ الْبَلَاءِ الثَّوَابَ لَوْ أَنَّ جُلُودَهُمْ كَانَتْ قُرِضَتْ فِي الدُّنْيَا بِالْمَقَارِيضِ ،‏‏‏‏ وَهَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ بِهَذَا الْإِسْنَادِ إِلَّا مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَقَدْ رَوَى بَعْضُهُمْ هَذَا الْحَدِيثَ عَنِ الْأَعْمَشِ، ‏‏‏‏‏‏عَنْ طَلْحَةَ بْنِ مُصَرِّفٍ، ‏‏‏‏‏‏عَنْ مَسْرُوقٍ قَوْلَهُ شَيْئًا مِنْ هَذَا."
      },
      {
        "id": 17527,
        "hadith_number": "2403",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Penyesalan Ketika Kematian",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah narrated that the Prophet(s.a.w) said: There is no one who dies but he shall regret. They said: What shall he regret over O Messenger of Allah? He said: If he was a good doer, he regrets that he did not do more, and if he was an evil doer, he regrets that he did not stop.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Nabi (s.a.w) bersabda: Tidak ada seorang pun yang mati kecuali dia akan menyesal. Mereka bertanya: Apa yang akan dia sesali wahai Rasulullah? Baginda bersabda: Jika dia seorang yang berbuat baik, dia menyesal kerana tidak berbuat lebih banyak, dan jika dia seorang yang berbuat jahat, dia menyesal kerana tidak berhenti.",
        "arabic_text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا ابْنُ الْمُبَارَكِ، أَخْبَرَنَا يَحْيَى بْنُ عُبَيْدِ اللَّهِ، قَال:‏‏‏‏ سَمِعْتُ أَبِي،‏‏‏‏ يَقُولُ:‏‏‏‏ سَمِعْتُ أَبَا هُرَيْرَةَ،‏‏‏‏ يَقُولُ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَا مِنْ أَحَدٍ يَمُوتُ إِلَّا نَدِمَ ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ وَمَا نَدَامَتُهُ يَا رَسُولَ اللَّهِ ؟ قَالَ:‏‏‏‏ إِنْ كَانَ مُحْسِنًا نَدِمَ أَنْ لَا يَكُونَ ازْدَادَ، ‏‏‏‏‏‏وَإِنْ كَانَ مُسِيئًا نَدِمَ أَنْ لَا يَكُونَ نَزَعَ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ إِنَّمَا نَعْرِفُهُ مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَيَحْيَى بْنُ عُبَيْدِ اللَّهِ قَدْ تَكَلَّمَ فِيهِ شُعْبَةُ، ‏‏‏‏‏‏وَهُوَ يَحْيَى بْنُ عُبَيْدِ اللَّهِ بْنِ مَوْهَبٍ مَدَنِيٌّ."
      },
      {
        "id": 17528,
        "hadith_number": "2404",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Penipu Agama di Akhir Zaman",
        "perawi_melayu": "Abu Hurairah R.A.",
        "english_text": "Abu Hurairah narrated that the Messenger of Allah(s.a.w) said: In the end of time there shall come men who will swindle the world with religion, decieving the people in soft skins of sheep, their tongues are sweeter than sugar and their hearts are the hearts of wolves. Allah [Mighty and Sublime is He] says: 'Is it me you try to delude or is it against me whom you conspire? By Me, I swear to send upon these people,among them, a Fitnah that leaves them utterly devoid of reason.",
        "malay_translation": "Daripada Abu Hurairah R.A., bahawa Rasulullah SAW bersabda: Pada akhir zaman akan datang orang-orang yang memperdaya dunia dengan agama, menipu orang ramai dengan berpakaian kulit kambing yang lembut, lidah mereka lebih manis daripada gula tetapi hati mereka adalah hati serigala. Allah [Maha Perkasa dan Maha Agung Dia] berfirman: 'Adakah Aku yang kamu cuba perdayakan atau adakah terhadap Aku kamu berkomplot? Demi Aku, Aku bersumpah akan mengirimkan kepada orang-orang ini, di antara mereka, Fitnah yang menyebabkan mereka kehilangan akal sepenuhnya.'",
        "arabic_text": "حَدَّثَنَا سُوَيْدٌ، أَخْبَرَنَا ابْنُ الْمُبَارَكِ، أَخْبَرَنَا يَحْيَى بْنُ عُبَيْدِ اللَّهِ، قَال:‏‏‏‏ سَمِعْتُ أَبِي،‏‏‏‏ يَقُولُ:‏‏‏‏ سَمِعْتُ أَبَا هُرَيْرَةَ،‏‏‏‏ يَقُولُ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَخْرُجُ فِي آخِرِ الزَّمَانِ رِجَالٌ يَخْتِلُونَ الدُّنْيَا بِالدِّينِ، ‏‏‏‏‏‏يَلْبَسُونَ لِلنَّاسِ جُلُودَ الضَّأْنِ مِنَ اللِّينِ، ‏‏‏‏‏‏أَلْسِنَتُهُمْ أَحْلَى مِنَ السُّكَّرِ، ‏‏‏‏‏‏وَقُلُوبُهُمْ قُلُوبُ الذِّئَابِ، ‏‏‏‏‏‏يَقُولُ اللَّهُ عَزَّ وَجَلَّ:‏‏‏‏ أَبِي يَغْتَرُّونَ أَمْ عَلَيَّ يَجْتَرِئُونَ، ‏‏‏‏‏‏فَبِي حَلَفْتُ لَأَبْعَثَنَّ عَلَى أُولَئِكَ مِنْهُمْ فِتْنَةً تَدَعُ الْحَلِيمَ مِنْهُمْ حَيْرَانًا ،‏‏‏‏ وفي الباب عن ابْنِ عُمَرَ"
      },
      {
        "id": 17529,
        "hadith_number": "2405",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Orang yang Lidahnya Manis Tetapi Hatinya Pahit",
        "perawi_melayu": "Ibn 'Umar",
        "english_text": "Ibn 'Umar narrated that the Prophet(s.a.w) said: Indeed Allah, Most High, said:'I have created creatures whose tongues are sweeter than honey and their hearts are more bitter than aloes. So by Me, I swear to abase them with a Fitnah, leaving them utterly devoid of reason. Is it Me whom they try to delude, or it is against Me whom they conspire?'",
        "malay_translation": "Ibn 'Umar meriwayatkan bahawa Nabi (s.a.w) bersabda: Sesungguhnya Allah, Maha Tinggi, berfirman: 'Aku telah menciptakan makhluk yang lidah mereka lebih manis daripada madu dan hati mereka lebih pahit daripada hempedu. Demi Aku, Aku bersumpah untuk menghinakan mereka dengan fitnah, meninggalkan mereka tanpa akal sama sekali. Adakah Aku yang mereka cuba perdayakan, atau adakah terhadap-Ku mereka berkomplot?'",
        "arabic_text": "حَدَّثَنَا حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، أَخْبَرَنَا حَاتِمُ بْنُ إِسْمَاعِيل، أَخْبَرَنَا حَمْزَةُ بْنُ أَبِي مُحَمَّدٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ إِنَّ اللَّهَ تَعَالَى قَالَ:‏‏‏‏ لَقَدْ خَلَقْتُ خَلْقًا أَلْسِنَتُهُمْ أَحْلَى مِنَ الْعَسَلِ وَقُلُوبُهُمْ أَمَرُّ مِنَ الصَّبْرِ، ‏‏‏‏‏‏فَبِي حَلَفْتُ لَأُتِيحَنَّهُمْ فِتْنَةً تَدَعُ الْحَلِيمَ مِنْهُمْ حَيْرَانًا، ‏‏‏‏‏‏فَبِي يَغْتَرُّونَ أَمْ عَلَيَّ يَجْتَرِئُونَ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ حَدِيثِ ابْنِ عُمَرَ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ."
      },
      {
        "id": 17530,
        "hadith_number": "2406",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Jalan Keselamatan",
        "perawi_melayu": "Uqbah bin 'Amir",
        "english_text": "Uqbah bin 'Amir narrated: I said: 'O Messenger of Allah! What is the means to salvation?' He said: 'That you control your tongue, suffice yourself your house, and cry over your sins.'",
        "malay_translation": "Uqbah bin 'Amir meriwayatkan: Aku berkata: 'Wahai Rasulullah! Apakah jalan keselamatan?' Baginda bersabda: 'Hendaklah kamu mengawal lidahmu, mencukupkan dirimu dengan rumahmu, dan menangisi dosa-dosamu.'",
        "arabic_text": "حَدَّثَنَا صَالِحُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، ح وحَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا ابْنُ الْمُبَارَكِ، عَنْ يَحْيَى بْنِ أَيُّوبَ، عَنْ عُبَيْدِ اللَّهِ بْنِ زَحْرٍ، عَنْ عَلِيِّ بْنِ يَزِيدَ، عَنِ الْقَاسِمِ، عَنْ أَبِي أُمَامَةَ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ،‏‏‏‏ مَا النَّجَاةُ ؟ قَالَ:‏‏‏‏ أَمْسِكْ عَلَيْكَ لِسَانَكَ وَلْيَسَعْكَ بَيْتُكَ وَابْكِ عَلَى خَطِيئَتِكَ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ."
      },
      {
        "id": 17531,
        "hadith_number": "2407",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Peringatan tentang Lidah dan Pengaruhnya terhadap Anggota Badan",
        "perawi_melayu": "Abu Sa'eed Al-Khudri",
        "english_text": "Abu Sa'eed Al-Khudri narrated (that the Prophet s.a.w) said: When the son of Adam wakes up in the morning, all of his body parts bow to the tongue and say: 'Fear Allah regarding us, we are only part of you. If you are straight we are straight and if you are crooked we are crooked.",
        "malay_translation": "Abu Sa'eed Al-Khudri meriwayatkan (bahawa Nabi s.a.w) bersabda: Apabila anak Adam bangun pada waktu pagi, semua anggota badannya tunduk kepada lidah dan berkata: 'Bertakwalah kepada Allah mengenai kami, kami hanyalah sebahagian daripada kamu. Jika kamu lurus, kami juga lurus, dan jika kamu bengkok, kami juga bengkok.'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى الْبَصْرِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَبِي الصَّهْبَاءِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَفَعَهُ،‏‏‏‏ قَالَ:‏‏‏‏ إِذَا أَصْبَحَ ابْنُ آدَمَ،‏‏‏‏ فَإِنَّ الْأَعْضَاءَ كُلَّهَا تُكَفِّرُ اللِّسَانَ، ‏‏‏‏‏‏فَتَقُولُ:‏‏‏‏ اتَّقِ اللَّهَ فِينَا فَإِنَّمَا نَحْنُ بِكَ فَإِنِ اسْتَقَمْتَ اسْتَقَمْنَا وَإِنِ اعْوَجَجْتَ اعْوَجَجْنَا ."
      },
      {
        "id": 17532,
        "hadith_number": "2408",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Jaminan Syurga dengan Menjaga Mulut dan Kemaluan",
        "perawi_melayu": "Sahl bin Sa'd",
        "english_text": "Sahl bin Sa'd narrated that the Messenger of Allah (s.a.w) said: Whoever guarantees for me what is between his jaws and what is between his legs, I shall guarantee Paradise for him.",
        "malay_translation": "Sahl bin Sa'd meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Sesiapa yang menjamin untukku apa yang ada di antara rahangnya dan apa yang ada di antara kedua kakinya, aku akan menjamin Syurga untuknya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ، حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ الْمُقَدَّمِيُّ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ يَتَكَفَّلُ لِي مَا بَيْنَ لَحْيَيْهِ، ‏‏‏‏‏‏وَمَا بَيْنَ رِجْلَيْهِ، ‏‏‏‏‏‏أَتَكَفَّلُ لَهُ بِالْجَنَّةِ ،‏‏‏‏ وفي الباب عن أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ سَهْلٍ حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ حَدِيثِ سَهْلِ بْنِ سَعْدٍ."
      },
      {
        "id": 17533,
        "hadith_number": "2409",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Perlindungan dari Kejahatan Mulut dan Kemaluan Menjamin Syurga",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said: For whomever Allah protects against the evil of what is between his jaws and the evil of what is between his legs, he shall enter Paradise.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Sesiapa yang Allah pelihara daripada kejahatan apa yang ada di antara rahangnya dan kejahatan apa yang ada di antara kedua kakinya, dia akan masuk Syurga.",
        "arabic_text": "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ، حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ، عَنِ ابْنِ عَجْلَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ وَقَاهُ اللَّهُ شَرَّ مَا بَيْنَ لَحْيَيْهِ وَشَرَّ مَا بَيْنَ رِجْلَيْهِ دَخَلَ الْجَنَّةَ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ أَبُو حَازِمٍ الَّذِي رَوَى عَنْ أَبِي هُرَيْرَةَ اسْمُهُ:‏‏‏‏ سَلْمَانُ مَوْلَى عَزَّةَ الْأَشْجَعِيَّةِ وَهُوَ كُوفِيٌّ، ‏‏‏‏‏‏وَأَبُو حَازِمٍ الَّذِي رَوَى عَنْ سَهْلِ بْنِ سَعْدٍ هُوَ أَبُو حَازِمٍ الزَّاهِدُ مَدَنِيٌّ وَاسْمُهُ:‏‏‏‏ سَلَمَةُ بْنُ دِينَارٍ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ."
      },
      {
        "id": 17534,
        "hadith_number": "2410",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Berpegang Teguh kepada Allah dan Menjaga Lidah",
        "perawi_melayu": "Tiada",
        "english_text": "Sufyan bin 'Abdullah Ath-Thaqafi said: I said: O Messenger of Allah! Inform me about a matter that I may hold fast to. He said: 'Say: My Lord is Allah, then be steadfast.' I said: O Messenger of Allah! What do you fear most for me? So he took hold of his tongue and said: 'This.'",
        "malay_translation": "Sufyan bin 'Abdullah Ath-Thaqafi berkata: Aku berkata: Wahai Rasulullah! Beritahu aku tentang suatu perkara yang boleh aku berpegang teguh kepadanya. Baginda bersabda: 'Katakanlah: Tuhanku adalah Allah, kemudian beristiqamahlah (berteguhlah).' Aku berkata: Wahai Rasulullah! Apakah perkara yang paling engkau takuti untukku? Maka Baginda memegang lidahnya dan bersabda: 'Ini.'",
        "arabic_text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللهِ ابْنُ الْمُبَارَكِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَاعِزٍ، عَنْ سُفْيَانَ بْنِ عَبْدِ اللَّهِ الثَّقَفِيِّ، قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ حَدِّثْنِي بِأَمْرٍ أَعْتَصِمُ بِهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْ رَبِّيَ اللَّهُ ثُمَّ اسْتَقِمْ ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ مَا أَخْوَفُ مَا تَخَافُ عَلَيَّ فَأَخَذَ بِلِسَانِ نَفْسِهِ، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ هَذَا،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ، ‏‏‏‏‏‏عَنْ سُفْيَانَ بْنِ عَبْدِ اللَّهِ الثَّقَفِيِّ."
      },
      {
        "id": 17535,
        "hadith_number": "2411",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Larangan Banyak Bercakap Tanpa Zikir dan Kesannya Terhadap Hati",
        "perawi_melayu": "Ibn 'Umar",
        "english_text": "Ibn 'Umar narrated that the Messenger of Allah (s.a.w) said: Do not talk too much without remembrance of Allah. Indeed excessive talking without remembrance of Allah hardens the heart. And indeed the furthest of people from Allah is the harsh-hearted.",
        "malay_translation": "Daripada Ibn 'Umar meriwayatkan bahawa Rasulullah (s.a.w) bersabda: Janganlah banyak bercakap tanpa mengingati Allah. Sesungguhnya banyak bercakap tanpa mengingati Allah mengeraskan hati. Dan sesungguhnya orang yang paling jauh daripada Allah adalah orang yang keras hati.",
        "arabic_text": "حَدَّثَنَا أَبُو عَبْدِ اللَّهِ مُحَمَّدُ بْنُ أَبِي ثَلْجٍ الْبَغْدَادِيُّ صَاحِبُ أَحْمَدَ بْنِ حَنْبَلٍ، ‏‏‏‏‏‏حَدَّثَنَا عَلِيُّ بْنُ حَفْصٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ عَبْدِ اللَّهِ بْنِ حَاطِبٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا تُكْثِرُوا الْكَلَامَ بِغَيْرِ ذِكْرِ اللَّهِ فَإِنَّ كَثْرَةَ الْكَلَامِ بِغَيْرِ ذِكْرِ اللَّهِ قَسْوَةٌ لِلْقَلْبِ، ‏‏‏‏‏‏وَإِنَّ أَبْعَدَ النَّاسِ مِنَ اللَّهِ الْقَلْبُ الْقَاسِي ."
      },
      {
        "id": 17536,
        "hadith_number": "2412",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Ucapan Anak Adam: Antara Kebaikan dan Keburukan",
        "perawi_melayu": "Umm Habibah, isteri Nabi (s.a.w)",
        "english_text": "Umm Habibah, the wife of the Prophet (s.a.w), narrated from the Prophet (s.a.w) who said: The son of Adam's speech is against him not for him, except for commanding good, or forbidding evil, or remembrance of Allah.",
        "malay_translation": "Umm Habibah, isteri Nabi (s.a.w), meriwayatkan daripada Nabi (s.a.w) yang bersabda: Ucapan anak Adam adalah menjadi saksi terhadapnya, bukan untuknya, kecuali memerintahkan kebaikan, atau melarang kemungkaran, atau mengingati Allah.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَغَيْرُ وَاحِدٍ،‏‏‏‏ قَالُوا:‏‏‏‏ حَدَّثَنَا مُحَمَّدُ بْنُ يَزِيدَ بْنِ خُنَيْسٍ الْمَكِّيُّ، قَال:‏‏‏‏ سَمِعْتُ سَعِيدَ بْنَ حَسَّانَ الْمَخْزُومِيَّ،‏‏‏‏ قَالَ:‏‏‏‏ حَدَّثَتْنِي أُمُّ صَالِحٍ، عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ، عَنْ أُمِّ حَبِيبَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ كُلُّ كَلَامِ ابْنِ آدَمَ عَلَيْهِ لَا لَهُ، ‏‏‏‏‏‏إِلَّا أَمْرٌ بِمَعْرُوفٍ، ‏‏‏‏‏‏أَوْ نَهْيٌ عَنْ مُنْكَرٍ، ‏‏‏‏‏‏أَوْ ذِكْرُ اللَّهِ ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ مُحَمَّدِ بْنِ يَزِيدَ بْنِ خُنَيْسٍ."
      },
      {
        "id": 17537,
        "hadith_number": "2413",
        "status": "Sahih",
        "nama_buku": "Jami' At-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Hak Diri, Tuhan, Tetamu, dan Keluarga",
        "perawi_melayu": "Ubu Juhaifah meriwayatkan dari bapanya",
        "english_text": "Ubu Juhaifah narrated from his father who said: The Messenger of Allah (s.a.w) made a bond of brotherhood between Salman and Abu Ad-Darda. Salman went to visit Abu Ad-Darda, and saw Umm Ad-Darda wearing shabby clothes, So he said: 'Why are you wearing such shabby clothes?' She said: 'Your brother Abu Ad-Darda has no interest in the world.' So when Abu Ad-Darda arrived, he prepared some food for him (Salman) and said: 'Eat, for I am fasting.' He said: 'I shall not eat until you eat.' He said: So he ate. When night came Abu Ad-Darda started to leave and stand (in prayer), but Salman said to him: 'Sleep.' So he slept. Then he went to stand (in prayer) but he said to him: 'Sleep'. So he slept. When the morning (Fajr) came,Salman said: 'Get up now.'So he got up to perform Salat. Then he (Salman) said: 'Indeed your self has a right upon you, your Lord has a right upon you, your guest has a right upon you, and your family has a right upon you. So give each the right they are due. The Prophet (s.a.w), and that was mentioned to him, so he said: 'Salman has told the truth.'",
        "malay_translation": "Ubu Juhaifah meriwayatkan dari bapanya yang berkata: Rasulullah (s.a.w) telah menjalinkan ikatan persaudaraan antara Salman dan Abu Ad-Darda. Salman telah melawat Abu Ad-Darda, dan melihat Umm Ad-Darda memakai pakaian yang lusuh, lalu dia berkata: 'Mengapa kamu memakai pakaian yang begitu lusuh?' Dia berkata: 'Saudaramu Abu Ad-Darda tidak mempunyai minat terhadap dunia.' Apabila Abu Ad-Darda tiba, dia menyediakan makanan untuknya (Salman) dan berkata: 'Makanlah, kerana aku sedang berpuasa.' Dia berkata: 'Aku tidak akan makan sehingga kamu makan.' Dia berkata: Lalu dia makan. Apabila malam tiba Abu Ad-Darda mula bangun dan berdiri (dalam solat), tetapi Salman berkata kepadanya: 'Tidurlah.' Lalu dia tidur. Kemudian dia pergi untuk berdiri (dalam solat) tetapi dia berkata kepadanya: 'Tidurlah'. Lalu dia tidur. Apabila tiba waktu pagi (Fajr), Salman berkata: 'Bangunlah sekarang.' Lalu dia bangun untuk menunaikan solat. Kemudian dia (Salman) berkata: 'Sesungguhnya dirimu mempunyai hak ke atasmu, Tuhanmu mempunyai hak ke atasmu, tetamumu mempunyai hak ke atasmu, dan keluargamu mempunyai hak ke atasmu. Oleh itu, berikan setiap orang hak mereka yang sepatutnya. Nabi (s.a.w), dan perkara itu telah disebut kepadanya, lalu dia berkata: 'Salman telah berkata benar.'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ، حَدَّثَنَا أَبُو الْعُمَيْسِ، عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ، عَنْ أَبِيهِ، قَالَ:‏‏‏‏ آخَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ سَلْمَانَ وَبَيْنَ أَبِي الدَّرْدَاءِ فَزَارَ سَلْمَانُ أَبَا الدَّرْدَاءِ فَرَأَى أُمَّ الدَّرْدَاءِ مُتَبَذِّلَةً، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا شَأْنُكِ مُتَبَذِّلَةً ؟ قَالَتْ:‏‏‏‏ إِنَّ أَخَاكَ أَبَا الدَّرْدَاءِ لَيْسَ لَهُ حَاجَةٌ فِي الدُّنْيَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَلَمَّا جَاءَ أَبُو الدَّرْدَاءِ قَرَّبَ إِلَيْهِ طَعَامًا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ كُلْ فَإِنِّي صَائِمٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَا أَنَا بِآكِلٍ حَتَّى تَأْكُلَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَأَكَلَ، ‏‏‏‏‏‏فَلَمَّا كَانَ اللَّيْلُ ذَهَبَ أَبُو الدَّرْدَاءِ لِيَقُومَ، ‏‏‏‏‏‏فَقَالَ لَهُ سَلْمَانُ:‏‏‏‏ نَمْ، ‏‏‏‏‏‏فَنَامَ، ‏‏‏‏‏‏ثُمَّ ذَهَبَ يَقُومُ، ‏‏‏‏‏‏فَقَالَ لَهُ:‏‏‏‏ نَمْ، ‏‏‏‏‏‏فَنَامَ، ‏‏‏‏‏‏فَلَمَّا كَانَ عِنْدَ الصُّبْحِ قَالَ لَهُ سَلْمَانُ:‏‏‏‏ قُمِ الْآنَ فَقَامَا فَصَلَّيَا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنَّ لِنَفْسِكَ عَلَيْكَ حَقًّا، ‏‏‏‏‏‏وَلِرَبِّكَ عَلَيْكَ حَقًّا، ‏‏‏‏‏‏وَلِضَيْفِكَ عَلَيْكَ حَقًّا، ‏‏‏‏‏‏وَإِنَّ لِأَهْلِكَ عَلَيْكَ حَقًّا، ‏‏‏‏‏‏فَأَعْطِ كُلَّ ذِي حَقٍّ حَقَّهُ ،‏‏‏‏ فَأَتَيَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَذَكَرَا ذَلِكَ فَقَالَ لَهُ:‏‏‏‏ صَدَقَ سَلْمَانُ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ صَحِيحٌ، ‏‏‏‏‏‏وَأَبُو الْعُمَيْسِ اسْمُهُ:‏‏‏‏ عُتْبَةُ بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏وَهُوَ أَخُو عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ الْمَسْعُودِيِّ."
      },
      {
        "id": 17538,
        "hadith_number": "2414",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Mencari Keredhaan Allah vs. Keredhaan Manusia",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Abdul-Wahhab bin Al-Ward narrated from a man among the inhabitants of Al-Madinah who said: Mu'awiyah wrote a letter to 'Aishah, that: 'Write a letter to advise me , and do not overburden me.' He said: So 'Aishah [may Allah be pleased with her]wrote to Mu'awiyah: 'Peace be upon you. As for what follows: Indeed I heard the Messenger of Allah (s.a.w) saying: Whoever seeks Allah's pleasure by the people's wrath, Allah will suffice him from the people. And who ever seeks the people's pleasure by Allah's wrath, Allah will entrust him to the people. And Peace be upon you.'",
        "malay_translation": "Abdul-Wahhab bin Al-Ward meriwayatkan daripada seorang lelaki dari penduduk Madinah yang berkata: Mu'awiyah menulis surat kepada Aisyah, bahawa: 'Tulislah surat untuk menasihati saya, dan jangan membebankan saya.' Dia berkata: Maka Aisyah [semoga Allah meredhainya] menulis kepada Mu'awiyah: 'Salam sejahtera ke atas kamu. Adapun selanjutnya: Sesungguhnya aku mendengar Rasulullah (s.a.w) bersabda: Sesiapa yang mencari keredhaan Allah dengan kemurkaan manusia, Allah akan mencukupkannya daripada manusia. Dan sesiapa yang mencari keredhaan manusia dengan kemurkaan Allah, Allah akan menyerahkan dia kepada manusia. Dan Salam sejahtera ke atas kamu.'",
        "arabic_text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ عَبْدِ الْوَهَّابِ بْنِ الْوَرْدِ، عَنْ رَجُلٍ مِنْ أَهْلِ الْمَدِينَةِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَتَبَ مُعَاوِيَةُ إِلَى عَائِشَةَ أُمِّ الْمُؤْمِنِينَ رَضِيَ اللَّهُ عَنْهَا،‏‏‏‏ أَنِ اكْتُبِي إِلَيَّ كِتَابًا تُوصِينِي فِيهِ وَلَا تُكْثِرِي عَلَيَّ، ‏‏‏‏‏‏فَكَتَبَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا إِلَى مُعَاوِيَةَ سَلَامٌ عَلَيْكَ، ‏‏‏‏‏‏أَمَّا بَعْدُ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ مَنِ الْتَمَسَ رِضَاءَ اللَّهِ بِسَخَطِ النَّاسِ كَفَاهُ اللَّهُ مُؤْنَةَ النَّاسِ، ‏‏‏‏‏‏وَمَنِ الْتَمَسَ رِضَاءِ النَّاسِ بِسَخَطِ اللَّهِ وَكَلَهُ اللَّهُ إِلَى النَّاسِ، ‏‏‏‏‏‏وَالسَّلَامُ عَلَيْكَ ،‏‏‏‏"
      }
    ]
  }
}