{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 61,
    "data": [
      {
        "id": 15515,
        "hadith_number": "391",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Nabi Muhammad S.A.W. Melakukan Sujud Sahwi Kerana Terlupa Duduk dalam Solat Zuhur",
        "perawi_melayu": "Abdullah bin Buhainah Al-Asdi, sekutu Banu Abdul-Muttalib",
        "english_text": "Abdullah bin Buhainah Al-Asdi the ally of Banu Abdul-Muttalib narrated: The Prophet (S) stood for the Zuhr prayer, and he had a sitting to perform, so when he completed his Salat, he performed two prostrations, saying the Takbir for each prostration. So he was sitting before saying the Salam, and the people prostrated with him in place of the sitting he forgot.",
        "malay_translation": "Abdullah bin Buhainah Al-Asdi, sekutu Banu Abdul-Muttalib meriwayatkan: Nabi Muhammad S.A.W. berdiri untuk solat Zuhur, dan baginda sepatutnya melakukan duduk (tasyahhud awal), jadi apabila baginda selesai solat, baginda melakukan dua sujud, sambil bertakbir bagi setiap sujud.  Baginda duduk sebelum memberi salam, dan orang ramai sujud bersama baginda sebagai ganti duduk yang baginda terlupa.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ ابْنِ شِهَابٍ، عَنْ الْأَعْرَجِ، عَنْ عَبْدِ اللَّهِ ابْنِ بُحَيْنَةَ الْأَسَدِيِّ حَلِيفِ بَنِي عَبْدِ الْمُطَّلِبِ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ فِي صَلَاةِ الظُّهْرِ وَعَلَيْهِ جُلُوسٌ، ‏‏‏‏‏‏فَلَمَّا أَتَمَّ صَلَاتَهُ سَجَدَ سَجْدَتَيْنِ يُكَبِّرُ فِي كُلِّ سَجْدَةٍ وَهُوَ جَالِسٌ قَبْلَ أَنْ يُسَلِّمَ، ‏‏‏‏‏‏وَسَجَدَهُمَا النَّاسُ مَعَهُ مَكَانَ مَا نَسِيَ مِنَ الْجُلُوسِ قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ."
      },
      {
        "id": 15516,
        "hadith_number": "392",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Solat Zuhur Lima Rakaat dan Sujud Sahwi",
        "perawi_melayu": "Abdullah bin Mas'ud meriwayatkan: Nabi (SAW) solat lima (Rakaat) untuk Zuhur, lalu dikatakan kepada baginda: 'Adakah solat telah ditambahkan, atau adakah kamu terlupa?' Maka baginda (SAW) melakukan dua sujud setelah memberi salam.",
        "english_text": "Abdullah bin Masud narrated: The Prophet (S) prayed five (Rakah) for Zuhr, so it was said to him: 'Has the prayer been added to, or have you merely forgotten?' So he (S) performed two prostrations after he had said the Salam.",
        "malay_translation": "Abdullah bin Mas'ud meriwayatkan: Nabi (SAW) telah solat lima rakaat bagi solat Zuhur, lalu ditanyakan kepada baginda: 'Adakah solat ini telah ditambah atau adakah kamu terlupa?' Maka baginda (SAW) melakukan dua sujud sahwi setelah memberi salam.",
        "arabic_text": "حَدَّثَنَا إِسْحَاق بْنُ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا شُعْبَةُ، عَنْ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الظُّهْرَ خَمْسًا ، ‏‏‏‏‏‏فَقِيلَ لَهُ أَزِيدَ فِي الصَّلَاةِ، ‏‏‏‏‏‏ فَسَجَدَ سَجْدَتَيْنِ بَعْدَ مَا سَلَّمَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 15517,
        "hadith_number": "393",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Sujud Sahwi Setelah Bercakap",
        "perawi_melayu": "Abdullah (bin Mas'ud) meriwayatkan:",
        "english_text": "Abdullah (bin Masud) narrated: The Prophet (S) performed two prostrations for As-Sahw after talking.",
        "malay_translation": "Abdullah (bin Mas'ud) meriwayatkan: Nabi (SAW) melakukan dua sujud sahwi setelah bercakap.",
        "arabic_text": "حَدَّثَنَا هَنَّادٌ، وَمَحْمُودُ بْنُ غَيْلَانَ، قَالَا:‏‏‏‏ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَجَدَ سَجْدَتَيِ السَّهْوِ بَعْدَ الْكَلَامِ قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ مُعَاوِيَةَ،‏‏‏‏ وَعَبْدِ اللَّهِ بْنِ جَعْفَرٍ،‏‏‏‏ وَأَبِي هُرَيْرَةَ."
      },
      {
        "id": 15518,
        "hadith_number": "394",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Sujud Sahwi Selepas Salam",
        "perawi_melayu": "Diriwayatkan daripada Abu Hurairah RA:",
        "english_text": "Abu Hurairah narrated: The Prophet (S) performed two prostrations after the Salam.",
        "malay_translation": "Abu Hurairah meriwayatkan: Nabi SAW melakukan dua sujud setelah memberi salam.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا هُشَيْمٌ، عَنْ هِشَامِ بْنِ حَسَّانَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَجَدَهُمَا بَعْدَ السَّلَامِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رَوَاهُ أَيُّوبُ وَغَيْرُ وَاحِدٍ، ‏‏‏‏‏‏عَنْ ابْنِ سِيرِينَ وَحَدِيثُ ابْنِ مَسْعُودٍ حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ إِذَا صَلَّى الرَّجُلُ الظُّهْرَ خَمْسًا فَصَلَاتُهُ جَائِزَةٌ، ‏‏‏‏‏‏وَسَجَدَ سَجْدَتَيِ السَّهْوِ وَإِنْ لَمْ يَجْلِسْ فِي الرَّابِعَةِ، ‏‏‏‏‏‏وَهُوَ قَوْلُ الشافعي، ‏‏‏‏‏‏وَأَحْمَدَ، ‏‏‏‏‏‏وَإِسْحَاق، ‏‏‏‏‏‏وقَالَ بَعْضُهُمْ:‏‏‏‏ إِذَا صَلَّى الظُّهْرَ خَمْسًا وَلَمْ يَقْعُدْ فِي الرَّابِعَةِ مِقْدَارَ التَّشَهُّدِ فَسَدَتْ صَلَاتُهُ، ‏‏‏‏‏‏وَهُوَ قَوْلُ:‏‏‏‏ سفيان الثوري وَبَعْضِ أَهْلِ الْكُوفَةِ."
      },
      {
        "id": 15519,
        "hadith_number": "395",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Lupa Dalam Solat dan Sujud Sahwi",
        "perawi_melayu": "Abu Al-Muhallab meriwayatkan daripada Imran bin Husain",
        "english_text": "Abu Al-Muhallab narrated from Imran bin Husain that : the Prophet (S) led them in Salat he forgot (something) so he performed two prostrations, then the Tashah-hud, then the Salam.",
        "malay_translation": "Abu Al-Muhallab meriwayatkan daripada Imran bin Husain bahawa: Nabi (SAW) mengimamkan mereka dalam solat, baginda terlupa (sesuatu), lalu baginda melakukan dua sujud, kemudian Tasyahhud, kemudian Salam.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى النَّيْسَابُورِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ، قَالَ:‏‏‏‏ أَخْبَرَنِي أَشْعَثُ، عَنْ ابْنِ سِيرِينَ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلَابَةَ، عَنْ أَبِي الْمُهَلَّبِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِهِمْ فَسَهَا فَسَجَدَ سَجْدَتَيْنِ ثُمَّ تَشَهَّدَ ثُمَّ سَلَّمَ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏وَرَوَى مُحَمَّدُ بْنُ سِيرِينَ، ‏‏‏‏‏‏عَنْ أَبِي الْمُهَلَّبِ وَهُوَ عَمُّ أَبِي قِلَابَةَ غَيْرَ هَذَا الْحَدِيثِ، ‏‏‏‏‏‏وَرَوَى مُحَمَّدٌ هَذَا الْحَدِيثَ، ‏‏‏‏‏‏عَنْ خَالِدٍ الْحَذَّاءِ، ‏‏‏‏‏‏عَنْ أَبِي قِلَابَةَ، ‏‏‏‏‏‏عَنْ أَبِي الْمُهَلَّبِ،‏‏‏‏ وَأَبُو الْمُهَلَّبِ اسْمُهُ:‏‏‏‏ عَبْدُ الرَّحْمَنِ بْنُ عَمْرٍوَ، ‏‏‏‏‏‏وَيُقَالُ أَيْضًا:‏‏‏‏ مُعَاوِيَةُ بْنُ عَمْرٍوَ، ‏‏‏‏‏‏وَقَدْ رَوَى عَبْدُ الْوَهَّابِ الثَّقَفِيُّ،‏‏‏‏ وَهُشَيْمٌ وَغَيْرُ وَاحِدٍ هَذَا الْحَدِيثَ، ‏‏‏‏‏‏عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلَابَةَ بِطُولِهِ، ‏‏‏‏‏‏وَهُوَ حَدِيثُ عِمْرَانَ بْنِ حُصَيْنٍ، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَلَّمَ فِي ثَلَاثِ رَكَعَاتٍ مِنَ الْعَصْرِ، ‏‏‏‏‏‏فَقَامَ رَجُلٌ يُقَالُ لَهُ الْخِرْبَاقُ وَاخْتَلَفَ أَهْلُ الْعِلْمِ فِي التَّشَهُّدِ فِي سَجْدَتَيِ السَّهْوِ، ‏‏‏‏‏‏فَقَالَ بَعْضُهُمْ:‏‏‏‏ يَتَشَهَّدُ فِيهِمَا وَيُسَلِّمُ، ‏‏‏‏‏‏وقَالَ بَعْضُهُمْ:‏‏‏‏ لَيْسَ فِيهِمَا تَشَهُّدٌ وَتَسْلِيمٌ وَإِذَا سَجَدَهُمَا قَبْلَ السَّلَامِ لَمْ يَتَشَهَّدْ، ‏‏‏‏‏‏وَهُوَ قَوْلُ:‏‏‏‏ أَحْمَدَ،‏‏‏‏ وَإِسْحَاق، ‏‏‏‏‏‏قَالَا:‏‏‏‏ إِذَا سَجَدَ سَجْدَتَيِ السَّهْوِ قَبْلَ السَّلَامِ لَمْ يَتَشَهَّدْ."
      },
      {
        "id": 15520,
        "hadith_number": "396",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Sujud Sahwi Ketika Ragu dalam Solat",
        "perawi_melayu": "Iyad bin Hilal berkata: Aku berkata kepada Abu Sa'eed: 'Salah seorang dari kami mengerjakan solat dan kami tidak tahu berapa (rakaat) yang telah kami solatkan.' Maka dia berkata: 'Rasulullah (SAW) bersabda: Apabila salah seorang dari kamu mengerjakan solat dan dia tidak tahu berapa (rakaat) yang telah dia solatkan maka hendaklah dia melakukan dua sujud ketika dia sedang duduk.",
        "english_text": "Iyad bin Hilal said: I said to Abu Sa'eed: 'One of us performs Salat and we do not know how (much) we prayed.' So he said: 'Allah's Messenger (S) said: When one of you performs Salat and he does now know how (much) he prayed then let him perform two prostrations while he is sitting.",
        "malay_translation": "Iyad bin Hilal berkata: Aku berkata kepada Abu Sa'eed: 'Salah seorang daripada kami menunaikan solat dan kami tidak tahu berapa (banyak) yang telah kami solatkan.' Maka dia berkata: 'Rasulullah (SAW) bersabda: Apabila salah seorang daripada kamu menunaikan solat dan dia tidak tahu berapa (banyak) yang telah dia solatkan, maka hendaklah dia melakukan dua sujud sahwi ketika dia sedang duduk.'",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا إِسْمَاعِيل بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامٌ الدَّسْتُوَائِيُّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عِيَاضٍ يَعْنِي ابْنَ هِلَالٍ، قَالَ:‏‏‏‏ قُلْتُ لِأَبِي سَعِيدٍ أَحَدُنَا يُصَلِّي فَلَا يَدْرِي كَيْفَ صَلَّى، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا صَلَّى أَحَدُكُمْ فَلَمْ يَدْرِ كَيْفَ صَلَّى فَلْيَسْجُدْ سَجْدَتَيْنِ وَهُوَ جَالِسٌ قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عُثْمَانَ،‏‏‏‏ وَابْنِ مَسْعُودٍ،‏‏‏‏ وَعَائِشَةَ،‏‏‏‏ وَأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ أَبِي سَعِيدٍ حَدِيثٌ حَسَنٌ، ‏‏‏‏‏‏وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ أَبِي سَعِيدٍ مِنْ غَيْرِ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَقَدْ رُوِيَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ:‏‏‏‏ إِذَا شَكَّ أَحَدُكُمْ فِي الْوَاحِدَةِ وَالثِّنْتَيْنِ فَلْيَجْعَلْهُمَا وَاحِدَةً وَإِذَا شَكَّ فِي الثِّنْتَيْنِ وَالثَّلَاثِ فَلْيَجْعَلْهُمَا ثِنْتَيْنِ وَيَسْجُدْ فِي ذَلِكَ سَجْدَتَيْنِ قَبْلَ أَنْ يُسَلِّمَ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَصْحَابِنَا، ‏‏‏‏‏‏وقَالَ بَعْضُ أَهْلِ الْعِلْمِ:‏‏‏‏ إِذَا شَكَّ فِي صَلَاتِهِ فَلَمْ يَدْرِ كَمْ صَلَّى فَلْيُعِدْ."
      },
      {
        "id": 15521,
        "hadith_number": "397",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Gangguan Syaitan dalam Solat dan Sujud Sahwi",
        "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah (SAW) bersabda:",
        "english_text": "Abu Hurairah narrated that: Allah's Messenger (S) said: Indeed the Shaitan comes to one of you in his Salat confusing him until he does now know how much he has prayed. When one of you experiences that then let him perform two prostrations while sitting.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah (SAW) bersabda: Sesungguhnya syaitan datang kepada salah seorang daripada kamu dalam solatnya, mengganggunya sehingga dia tidak tahu berapa rakaat yang telah dia lakukan. Apabila salah seorang daripada kamu mengalami hal itu, maka hendaklah dia melakukan dua sujud sahwi dalam keadaan duduk.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ الشَّيْطَانَ يَأْتِي أَحَدَكُمْ فِي صَلَاتِهِ فَيَلْبِسُ عَلَيْهِ حَتَّى لَا يَدْرِيَ كَمْ صَلَّى فَإِذَا وَجَدَ ذَلِكَ أَحَدُكُمْ فَلْيَسْجُدْ سَجْدَتَيْنِ وَهُوَ جَالِسٌ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 15522,
        "hadith_number": "398",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Lupa Bilangan Rakaat dalam Solat dan Cara Mengatasinya",
        "perawi_melayu": "Abdur-Rahman bin Awf meriwayatkan bahawa beliau mendengar Nabi (SAW) bersabda",
        "english_text": "Abdur-Rahman bi Awf narrated that he heard the Prophet (S) saying: When one of you becomes forgetful in his Salat so that he does not know if he prayed one or two, then let him consider it one. When he does not know if he prayed three or four, then let him consider it three, and let him perform two prostrations before he says the Taslim.",
        "malay_translation": "Abdur-Rahman bin Awf meriwayatkan bahawa beliau mendengar Nabi (SAW) bersabda: Apabila salah seorang daripada kamu terlupa dalam solatnya sehingga dia tidak tahu sama ada dia telah solat satu atau dua rakaat, maka hendaklah dia menganggapnya satu rakaat. Apabila dia tidak tahu sama ada dia telah solat tiga atau empat rakaat, maka hendaklah dia menganggapnya tiga rakaat, dan hendaklah dia melakukan dua sujud sebelum dia mengucapkan Taslim.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ خَالِدٍ ابْنُ عَثْمَةَ الْبَصْرِيُّ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، قَالَ:‏‏‏‏ حَدَّثَنِي مُحَمَّدُ بْنُ إِسْحَاق، عَنْ مَكْحُولٍ، عَنْ كُرَيْبٍ، عَنْ ابْنِ عَبَّاسٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، قَالَ:‏‏‏‏ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ إِذَا سَهَا أَحَدُكُمْ فِي صَلَاتِهِ فَلَمْ يَدْرِ وَاحِدَةً صَلَّى أَوْ ثِنْتَيْنِ فَلْيَبْنِ عَلَى وَاحِدَةٍ فَإِنْ لَمْ يَدْرِ ثِنْتَيْنِ صَلَّى أَوْ ثَلَاثًا فَلْيَبْنِ عَلَى ثِنْتَيْنِ فَإِنْ لَمْ يَدْرِ ثَلَاثًا صَلَّى أَوْ أَرْبَعًا فَلْيَبْنِ عَلَى ثَلَاثٍ وَلْيَسْجُدْ سَجْدَتَيْنِ قَبْلَ أَنْ يُسَلِّمَ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ مِنْ غَيْرِ هَذَا الْوَجْهِ، ‏‏‏‏‏‏رَوَاهُ الزُّهْرِيُّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ ابْنِ عَبَّاسٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 15523,
        "hadith_number": "399",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Nabi Muhammad SAW Menyempurnakan Solat Setelah Diingatkan oleh Dhul-Yadain",
        "perawi_melayu": "Abu Hurairah meriwayatkan:",
        "english_text": "Abu Hurairah narrated: The Prophet (S) turned (finished the prayer) after two (Rak'ah), so Dhul-Yadain said: 'Has the prayer been shortened or have you forgotten O Messenger of Allah? The Prophet (S) said: 'Is what Dhul-Yadain said the truth?' The people said yes, so Allah's Messenger (S) stood to perform the last two (Rakah) of Salat, then he said the Taslim. Then he said the Takbir and prostrated in a manner the same or longer than his (normal) prostrations.",
        "malay_translation": "Abu Hurairah meriwayatkan: Nabi SAW berpaling (menyelesaikan solat) setelah dua rakaat, lalu Dhul-Yadain berkata: 'Adakah solat telah dipendekkan atau adakah engkau lupa wahai Rasulullah?' Nabi SAW bersabda: 'Adakah benar apa yang dikatakan oleh Dhul-Yadain?' Orang ramai berkata ya, maka Rasulullah SAW berdiri untuk melaksanakan dua rakaat terakhir solat, kemudian baginda mengucapkan Taslim. Kemudian baginda mengucapkan Takbir dan sujud dengan cara yang sama atau lebih lama daripada sujud (biasa) baginda.",
        "arabic_text": "حَدَّثَنَا الْأَنْصَارِيُّ، حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكٌ، عَنْ أَيُّوبَ بْنِ أَبِي تَمِيمَةَ وَهُوَ:‏‏‏‏ أَيُّوبُ السَّخْتِيَانِيُّ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْصَرَفَ مِنَ اثْنَتَيْنِ، ‏‏‏‏‏‏فَقَالَ لَهُ ذُو الْيَدَيْنِ:‏‏‏‏ أَقُصِرَتِ الصَّلَاةُ أَمْ نَسِيتَ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَصَدَقَ ذُو الْيَدَيْنِ، ‏‏‏‏‏‏فَقَالَ النَّاسُ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى اثْنَتَيْنِ أُخْرَيَيْنِ ثُمَّ سَلَّمَ ثُمَّ كَبَّرَ فَسَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ ثُمَّ كَبَّرَ فَرَفَعَ ثُمَّ سَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب عَنْ عِمْرَانَ بْنِ حُصَيْنٍ،‏‏‏‏ وَابْنِ عُمَرَ،‏‏‏‏ وَذِي الْيَدَيْنِ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَحَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَاخْتَلَفَ أَهْلُ الْعِلْمِ فِي هَذَا الْحَدِيثِ، ‏‏‏‏‏‏فَقَالَ بَعْضُ أَهْلِ الْكُوفَةِ:‏‏‏‏ إِذَا تَكَلَّمَ فِي الصَّلَاةِ نَاسِيًا أَوْ جَاهِلًا أَوْ مَا كَانَ فَإِنَّهُ يُعِيدُ الصَّلَاةَ، ‏‏‏‏‏‏وَاعْتَلُّوا بِأَنَّ هَذَا الْحَدِيثَ كَانَ قَبْلَ تَحْرِيمِ الْكَلَامِ فِي الصَّلَاةِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَأَمَّا الشَّافِعِيُّ فَرَأَى هَذَا حَدِيثًا صَحِيحًا، ‏‏‏‏‏‏فَقَالَ بِهِ، ‏‏‏‏‏‏وقَالَ:‏‏‏‏ هَذَا أَصَحُّ مِنَ الْحَدِيثِ الَّذِي رُوِيَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الصَّائِمِ إِذَا أَكَلَ نَاسِيًا فَإِنَّهُ لَا يَقْضِي وَإِنَّمَا هُوَ رِزْقٌ رَزَقَهُ اللَّهُ ، ‏‏‏‏‏‏قَالَ الشافعي:‏‏‏‏ وَفَرَّقَ هَؤُلَاءِ بَيْنَ الْعَمْدِ وَالنِّسْيَانِ فِي أَكْلِ الصَّائِمِ بِحَدِيثِ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وقَالَ أَحْمَدُ فِي حَدِيثِ أَبِي هُرَيْرَةَ:‏‏‏‏ إِنْ تَكَلَّمَ الْإِمَامُ فِي شَيْءٍ مِنْ صَلَاتِهِ وَهُوَ يَرَى أَنَّهُ قَدْ أَكْمَلَهَا ثُمَّ عَلِمَ أَنَّهُ لَمْ يُكْمِلْهَا يُتِمُّ صَلَاتَهُ، ‏‏‏‏‏‏وَمَنْ تَكَلَّمَ خَلْفَ الْإِمَامِ وَهُوَ يَعْلَمُ أَنَّ عَلَيْهِ بَقِيَّةً مِنَ الصَّلَاةِ، ‏‏‏‏‏‏فَعَلَيْهِ أَنْ يَسْتَقْبِلَهَا، ‏‏‏‏‏‏وَاحْتَجَّ بِأَنَّ الْفَرَائِضَ كَانَتْ تُزَادُ وَتُنْقَصُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَإِنَّمَا تَكَلَّمَ ذُو الْيَدَيْنِ وَهُوَ عَلَى يَقِينٍ مِنْ صَلَاتِهِ أَنَّهَا تَمَّتْ، ‏‏‏‏‏‏وَلَيْسَ هَكَذَا الْيَوْمَ لَيْسَ لِأَحَدٍ أَنْ يَتَكَلَّمَ عَلَى مَعْنَى مَا تَكَلَّمَ ذُو الْيَدَيْنِ، ‏‏‏‏‏‏لِأَنَّ الْفَرَائِضَ الْيَوْمَ لَا يُزَادُ فِيهَا وَلَا يُنْقَصُ، ‏‏‏‏‏‏قَالَ أَحْمَدُ نَحْوًا مِنْ هَذَا الْكَلَامِ، ‏‏‏‏‏‏وقَالَ إِسْحَاق نَحْوَ قَوْلِ أَحْمَدَ فِي هَذَا الْبَابِ."
      },
      {
        "id": 15524,
        "hadith_number": "400",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Rasulullah SAW Solat Memakai Sandal",
        "perawi_melayu": "Sa'eed bin Yazid Abu Maslamah berkata: Saya berkata kepada Anas bin Malik: 'Adakah Rasulullah SAW menunaikan solat dengan memakai sandal?' Beliau berkata: 'Ya.'",
        "english_text": "Sa'eed bin Yazid Abu Maslamah said: I said to Anas bin Malik: 'Would Allah's Messenger (S) perform Salat wearing his sandals?' He said: 'Yes.'",
        "malay_translation": "Sa'eed bin Yazid Abu Maslamah berkata: Saya bertanya kepada Anas bin Malik: 'Adakah Rasulullah SAW solat dengan memakai sandal?' Beliau menjawab: 'Ya.'",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا إِسْمَاعِيل بْنُ إِبْرَاهِيمَ، عَنْ سَعِيدِ بْنِ يَزِيدَ أَبِي مَسْلَمَةَ، قَالَ:‏‏‏‏ قُلْتُ لِأَنَسِ بْنِ مَالِكٍ:‏‏‏‏ أَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي نَعْلَيْهِ ؟ قَالَ:‏‏‏‏ نَعَمْ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ،‏‏‏‏ وَعَبْدِ اللَّهِ بْنِ أَبِي حَبِيبَةَ،‏‏‏‏ وَعَبْدِ اللَّهِ بْنِ عَمْرٍ،‏‏‏‏ وَعَمْرِو بْنِ حُرَيْثٍ،‏‏‏‏ وَشَدَّادِ بْنِ أَوْسٍ،‏‏‏‏ وَأَوْسٍ الثَّقَفِيِّ،‏‏‏‏ وَأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَعَطَاءٍ رَجُلٍ مِنْ بَنِي شَيْبَةَ. قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ أَنَسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ."
      },
      {
        "id": 15525,
        "hadith_number": "401",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Qunut dalam Solat Subuh dan Maghrib",
        "perawi_melayu": "Al-Bara bin Azib meriwayatkan:",
        "english_text": "Al-Bara bin Azib narrated: The Prophet (S) would perform the Qunut in the Subh and Maghrib prayers.",
        "malay_translation": "Al-Bara bin Azib meriwayatkan: Nabi (SAW) melakukan Qunut dalam solat Subuh dan Maghrib.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالَا:‏‏‏‏ حَدَّثَنَا غُنْدَرٌ مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ الْبَرَاءِ بْنِ عَازِبٍ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْنُتُ فِي صَلَاةِ الصُّبْحِ وَالْمَغْرِبِ قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عَلِيٍّ،‏‏‏‏ وَأَنَسٍ،‏‏‏‏ وَأَبِي هُرَيْرَةَ،‏‏‏‏ وَابْنِ عَبَّاسٍ،‏‏‏‏ وَخُفَافِ بْنِ أَيْمَاءَ بْنِ رَحْضَةَ الْغِفَارِيِّ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ الْبَرَاءِ حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَاخْتَلَفَ أَهْلُ الْعِلْمِ فِي الْقُنُوتِ فِي صَلَاةِ الْفَجْرِ، ‏‏‏‏‏‏فَرَأَى بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمُ الْقُنُوتَ فِي صَلَاةِ الْفَجْرِ، ‏‏‏‏‏‏وَهُوَ قَوْلُ مَالِكٍ،‏‏‏‏ وَالشَّافِعِيِّ، ‏‏‏‏‏‏وقَالَ أَحْمَدُ،‏‏‏‏ وَإِسْحَاق:‏‏‏‏ لَا يُقْنَتُ فِي الْفَجْرِ إِلَّا عِنْدَ نَازِلَةٍ تَنْزِلُ بِالْمُسْلِمِينَ، ‏‏‏‏‏‏فَإِذَا نَزَلَتْ نَازِلَةٌ فَلِلْإِمَامِ أَنْ يَدْعُوَ لِجُيُوشِ الْمُسْلِمِينَ."
      },
      {
        "id": 15526,
        "hadith_number": "402",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Qunut: Amalan yang Diada-adakan",
        "perawi_melayu": "Abu Malik Al-Ashjai",
        "english_text": "Abu Malik Al-Ashjai narrated: I said to my father: 'O my father! You offered Salat behind Allah's Messenger (S), Abu Bakr, Umar, Uthman, and Ali bin Abi Talib here in Al-Kufah for about five years. Did they say the Qunut?' He said: 'It is a newly invented matter my son.'",
        "malay_translation": "Abu Malik Al-Ashjai meriwayatkan: Aku berkata kepada ayahku: 'Wahai ayahku! Engkau telah menunaikan solat di belakang Rasulullah (SAW), Abu Bakar, Umar, Uthman, dan Ali bin Abi Talib di sini, di Kufah, selama kira-kira lima tahun. Adakah mereka membaca Qunut?' Dia berkata: 'Itu adalah perkara yang baru diada-adakan, wahai anakku.'",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ أَبِي مَالِكٍ الْأَشْجَعِيِّ، قَالَ:‏‏‏‏ قُلْتُ لِأَبِي:‏‏‏‏ يَا أَبَةِ إِنَّكَ قَدْ صَلَّيْتَ خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ،‏‏‏‏ وَعُمَرَ،‏‏‏‏ وَعُثْمَانَ،‏‏‏‏ وَعَلِيِّ بْنِ أَبِي طَالِبٍ هَا هُنَا بِالْكُوفَةِ نَحْوًا مِنْ خَمْسِ سِنِينَ، ‏‏‏‏‏‏أَكَانُوا يَقْنُتُونَ ؟ قَالَ:‏‏‏‏ أَيْ بُنَيَّ مُحْدَثٌ. قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَالْعَمَلُ عَلَيْهِ عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ، ‏‏‏‏‏‏وقَالَ سفيان الثوري:‏‏‏‏ إِنْ قَنَتَ فِي الْفَجْرِ فَحَسَنٌ وَإِنْ لَمْ يَقْنُتْ فَحَسَنٌ، ‏‏‏‏‏‏وَاخْتَارَ أَنْ لَا يَقْنُتَ، ‏‏‏‏‏‏وَلَمْ يَرَ ابْنُ الْمُبَارَكِ الْقُنُوتَ فِي الْفَجْرِ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَأَبُو مَالِكٍ الْأَشْجَعِيُّ اسْمُهُ:‏‏‏‏ سَعْدُ بْنُ طَارِقِ بْنِ أَشْيَمَ،‏‏‏‏"
      },
      {
        "id": 15527,
        "hadith_number": "403",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Riwayat Lain daripada Abu Malik dengan Maksud Serupa",
        "perawi_melayu": "Tiada",
        "english_text": "There is another narration from Abu Malik: There exists another narration from Abu Malik with similar meaning but with different chain.",
        "malay_translation": "Terdapat riwayat lain daripada Abu Malik: Wujud riwayat lain daripada Abu Malik dengan maksud yang serupa tetapi dengan sanad yang berbeza.",
        "arabic_text": "حَدَّثَنَا صَالِحُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي مَالِكٍ الْأَشْجَعِيِّ بِهَذَا الْإِسْنَادِ نَحْوَهُ بِمَعْنَاهُ."
      },
      {
        "id": 15528,
        "hadith_number": "404",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keutamaan Memuji Allah SWT Selepas Bersin Dalam Solat",
        "perawi_melayu": "Muadh bin Rifa'ah meriwayatkan bahawa bapanya berkata: Aku solat di belakang Rasulullah (SAW). Aku bersin dan berkata: Al-Hamdulillah, hamdan kathiran tayyiban mubarakan fih, mubarakan alaihi kama yuhibbu Rabbana Wa Yarda (Segala puji bagi Allah, pujian yang banyak, baik dan diberkati, keberkatan untuk-Nya sebagaimana Tuhan kita cintai dan redhai.)",
        "english_text": "Muadh bin Rifa'ah narrated that his father said: I prayed behind Allah's Messenger (S). I sneezed and said: Al-Hamdulillah, hamdan kathiran tayyiban mubarakan fih, mubarakan alaihi kama yuhibbu Rabbana Wa Yarda (All praise is due to Alah, many good blessed praises, blessings for Him as our Lord loves and is pleased with.) When Allah's Messenger (S) prayed and turned (after finishing) he said: 'Who was the speaker during the Salat?' No one spoke. Then he said it a second time: 'Who was the speaker during the Salat?' But no one spoke. Then he said it a third time: 'Who was the speaker during the Salat?' So Rifa'ah bin Rafi bin Afra said: It was I, O Messenger of Allah (S). He said: What did you say? He said: I said: 'Al-Hamdulillah, hamdan kathiran tayyiban mubarakan fih, mubarakan alaihi kama yuhibbu Rabbana Wa Yarda. The Prophet (S) said: By the One in Whose Hand is my soul! I saw thirty-some angels competing over which of then would ascend with it.",
        "malay_translation": "Muadh bin Rifa'ah meriwayatkan bahawa bapanya berkata: Aku solat di belakang Rasulullah (SAW). Aku bersin dan berkata: Al-Hamdulillah, hamdan kathiran tayyiban mubarakan fih, mubarakan alaihi kama yuhibbu Rabbana Wa Yarda (Segala puji bagi Allah, pujian yang banyak, baik dan diberkati, keberkatan untuk-Nya sebagaimana Tuhan kita cintai dan redhai.) Ketika Rasulullah (SAW) selesai solat dan berpaling, baginda bersabda: 'Siapakah yang bercakap semasa solat tadi?' Tiada siapa pun yang menjawab. Kemudian baginda bertanya kali kedua: 'Siapakah yang bercakap semasa solat tadi?' Namun tiada siapa pun yang menjawab. Kemudian baginda bertanya kali ketiga: 'Siapakah yang bercakap semasa solat tadi?' Maka Rifa'ah bin Rafi bin Afra berkata: Saya, wahai Rasulullah (SAW). Baginda bertanya: Apakah yang engkau katakan? Dia berkata: Saya berkata: 'Al-Hamdulillah, hamdan kathiran tayyiban mubarakan fih, mubarakan alaihi kama yuhibbu Rabbana Wa Yarda.' Nabi (SAW) bersabda: Demi Zat yang jiwaku berada di tangan-Nya! Aku melihat lebih kurang tiga puluh malaikat berlumba-lumba, siapa antara mereka yang akan membawanya naik.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا رِفَاعَةُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ رِفَاعَةَ بْنِ رَافِعٍ الزُّرَقِيُّ، عَنْ عَمِّ أَبِيهِ مُعَاذِ بْنِ رِفَاعَةَ، عَنْ أَبِيهِ، قَالَ:‏‏‏‏ صَلَّيْتُ خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَطَسْتُ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ مُبَارَكًا عَلَيْهِ كَمَا يُحِبُّ رَبُّنَا وَيَرْضَى، ‏‏‏‏‏‏فَلَمَّا صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْصَرَفَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَنِ الْمُتَكَلِّمُ فِي الصَّلَاةِ ؟ فَلَمْ يَتَكَلَّمْ أَحَدٌ ثُمَّ قَالَهَا الثَّانِيَةَ:‏‏‏‏ مَنِ الْمُتَكَلِّمُ فِي الصَّلَاةِ ؟ فَلَمْ يَتَكَلَّمْ أَحَدٌ ثُمَّ قَالَهَا الثَّالِثَةَ:‏‏‏‏ مَنِ الْمُتَكَلِّمُ فِي الصَّلَاةِ فَقَالَ رِفَاعَةُ بْنُ رَافِعٍ ابْنُ عَفْرَاءَ:‏‏‏‏ أَنَا يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَيْفَ قُلْتَ ؟ قَالَ:‏‏‏‏ قُلْتُ الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ مُبَارَكًا عَلَيْهِ كَمَا يُحِبُّ رَبُّنَا وَيَرْضَى، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ وَالَّذِي نَفْسِي بِيَدِهِ لَقَدِ ابْتَدَرَهَا بِضْعَةٌ وَثَلَاثُونَ مَلَكًا أَيُّهُمْ يَصْعَدُ بِهَا . قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ أَنَسٍ،‏‏‏‏ وَائِلِ بْنِ حُجْرٍ،‏‏‏‏ وَعَامِرِ بْنِ رَبِيعَةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ رِفَاعَةَ حَدِيثٌ حَسَنٌ، ‏‏‏‏‏‏وَكَأَنَّ هَذَا الْحَدِيثَ عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ أَنَّهُ فِي التَّطَوُّعِ، ‏‏‏‏‏‏لِأَنَّ غَيْرَ وَاحِدٍ مِنَ التَّابِعِينَ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ إِذَا عَطَسَ الرَّجُلُ فِي الصَّلَاةِ الْمَكْتُوبَةِ إِنَّمَا يَحْمَدُ اللَّهَ فِي نَفْسِهِ وَلَمْ يُوَسِّعُوا فِي أَكْثَرَ مِنْ ذَلِكَ."
      },
      {
        "id": 15529,
        "hadith_number": "405",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Larangan Bercakap-cakap Semasa Solat",
        "perawi_melayu": "Zaid bin Arqam meriwayatkan:",
        "english_text": "Zaid bin Arqam narrated: We used to talk behind Allah's Messenger (S) during the Salat, a man among us would talk to his companions next to him until (the following) was revealed: And stand before Allah with obedience. (2:238) So we were ordered to be silent and prohibited from talking.",
        "malay_translation": "Zaid bin Arqam meriwayatkan: Kami dahulunya bercakap-cakap di belakang Rasulullah SAW semasa solat. Seorang lelaki di antara kami akan bercakap dengan sahabatnya di sebelahnya sehingga (ayat berikut) diturunkan: Dan berdirilah menghadap Allah dengan taat. (2:238) Maka kami diperintahkan untuk diam dan dilarang daripada bercakap.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا إِسْمَاعِيل بْنُ أَبِي خَالِدٍ، عَنْ الْحَارِثِ بْنِ شُبَيْلٍ، عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ، عَنْ زَيْدِ بْنِ أَرْقَمَ، قَالَ:‏‏‏‏ كُنَّا نَتَكَلَّمُ خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الصَّلَاةِ، ‏‏‏‏‏‏يُكَلِّمُ الرَّجُلُ مِنَّا صَاحِبَهُ إِلَى جَنْبِهِ حَتَّى نَزَلَتْوَقُومُوا لِلَّهِ قَانِتِينَ سورة البقرة آية 238 فَأُمِرْنَا بِالسُّكُوتِ وَنُهِينَا عَنِ الْكَلَامِ . قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ ابْنِ مَسْعُودٍ،‏‏‏‏ وَمُعَاوِيَةَ بْنِ الْحَكَمِ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ زَيْدِ بْنِ أَرْقَمَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَيْهِ عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ إِذَا تَكَلَّمَ الرَّجُلُ عَامِدًا فِي الصَّلَاةِ أَوْ نَاسِيًا أَعَادَ الصَّلَاةَ، ‏‏‏‏‏‏وَهُوَ قَوْلُ:‏‏‏‏ سفيان الثوري،‏‏‏‏ وَابْنِ الْمُبَارَكِ وَأَهْلِ الْكُوفَةِ، ‏‏‏‏‏‏وقَالَ بَعْضُهُمْ:‏‏‏‏ إِذَا تَكَلَّمَ عَامِدًا فِي الصَّلَاةِ أَعَادَ الصَّلَاةَ وَإِنْ كَانَ نَاسِيًا أَوْ جَاهِلًا أَجْزَأَهُ، ‏‏‏‏‏‏وَبِهِ يَقُولُ:‏‏‏‏ الشَّافِعِيُّ."
      },
      {
        "id": 15530,
        "hadith_number": "406",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keutamaan Bertaubat Selepas Melakukan Dosa",
        "perawi_melayu": "Asma bin Al-Hakam Al-Fazari",
        "english_text": "Asma bin Al-Hakam Al-Fazari said: I heard Ali saying: 'Indeed I am a man who, when I heard a Hadith from Allah's Messenger (S) then Allah causes me to benefit from it as much as He wills for me to benefit from it. When a man among his Companions narrated to me I ask him to swear an oath to me about it, and when he swears an oath to me I trust him. And Abu Bakr narrated to me - and Abu Bakr told the truth - he said: I heard Allah's Messenger (S) saying: 'There is no man who commits a sin, then makes Wudu, then performs Salat, then seeks forgiveness from Allah, except that Allah forgives him.' Then he recited this Ayah: Those who when they have committed Fahishah or wronged themselves with eveil, remember Allah. (3:135) until the end of the Ayah.",
        "malay_translation": "Asma bin Al-Hakam Al-Fazari berkata: Aku mendengar Ali berkata: 'Sesungguhnya aku adalah seorang lelaki yang, apabila aku mendengar sebuah Hadith daripada Rasulullah (S), maka Allah menyebabkan aku mendapat manfaat daripadanya sebanyak mana yang Dia kehendaki untuk aku mendapat manfaat daripadanya. Apabila seorang lelaki daripada kalangan sahabatnya meriwayatkan kepadaku, aku meminta dia untuk bersumpah kepadaku tentangnya, dan apabila dia bersumpah kepadaku, aku mempercayainya. Dan Abu Bakr meriwayatkan kepadaku - dan Abu Bakr berkata benar - dia berkata: Aku mendengar Rasulullah (S) bersabda: 'Tidak ada seorang lelaki pun yang melakukan dosa, kemudian berwuduk, kemudian mendirikan solat, kemudian memohon ampun daripada Allah, melainkan Allah mengampuninya.' Kemudian dia membaca ayat ini: Orang-orang yang apabila mereka melakukan perbuatan keji (Fahishah) atau menzalimi diri sendiri dengan kejahatan, mereka ingat Allah. (3:135) sehingga akhir ayat.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عُثْمَانَ بْنِ الْمُغِيرَةِ، عَنْ عَلِيِّ بْنِ رَبِيعَةَ، عَنْ أَسْمَاءَ بْنِ الْحَكَمِ الْفَزَارِيِّ، قَال:‏‏‏‏ سَمِعْتُ عَلِيًّا، يَقُولُ:‏‏‏‏ إِنِّي كُنْتُ رَجُلًا إِذَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثًا نَفَعَنِي اللَّهُ مِنْهُ بِمَا شَاءَ أَنْ يَنْفَعَنِي بِهِ، ‏‏‏‏‏‏وَإِذَا حَدَّثَنِي رَجُلٌ مِنْ أَصْحَابِهِ اسْتَحْلَفْتُهُ، ‏‏‏‏‏‏فَإِذَا حَلَفَ لِي صَدَّقْتُهُ، ‏‏‏‏‏‏وَإِنَّهُ حَدَّثَنِي أَبُو بَكْرٍ وَصَدَقَ أَبُو بَكْرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ مَا مِنْ رَجُلٍ يُذْنِبُ ذَنْبًا ثُمَّ يَقُومُ فَيَتَطَهَّرُ ثُمَّ يُصَلِّي ثُمَّ يَسْتَغْفِرُ اللَّهَ إِلَّا غَفَرَ اللَّهُ لَهُ، ‏‏‏‏‏‏ثُمَّ قَرَأَ هَذِهِ الْآيَةَ وَالَّذِينَ إِذَا فَعَلُوا فَاحِشَةً أَوْ ظَلَمُوا أَنْفُسَهُمْ ذَكَرُوا اللَّهَ فَاسْتَغْفَرُوا لِذُنُوبِهِمْ وَمَنْ يَغْفِرُ الذُّنُوبَ إِلا اللَّهُ وَلَمْ يُصِرُّوا عَلَى مَا فَعَلُوا وَهُمْ يَعْلَمُونَ سورة آل عمران آية 135 ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ ابْنِ مَسْعُودٍ،‏‏‏‏ وَأَبِي الدَّرْدَاءِ،‏‏‏‏ وَأَنَسٍ،‏‏‏‏ وَأَبِي أُمَامَةَ،‏‏‏‏ وَمُعَاذٍ،‏‏‏‏ ووَاثِلَةَ،‏‏‏‏ وَأَبِي الْيَسَرِ وَاسْمُهُ:‏‏‏‏ كَعْبُ بْنُ عَمْرٍ وَقَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ عَلِيٍّ حَدِيثٌ حَسَنٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ عُثْمَانَ بْنِ الْمُغِيرَةِ، ‏‏‏‏‏‏وَرَوَى عَنْهُ شُعْبَةُ وَغَيْرُ وَاحِدٍ، ‏‏‏‏‏‏فَرَفَعُوهُ مِثْلَ حَدِيثِ أَبِي عَوَانَةَ، ‏‏‏‏‏‏وَرَوَاهُ سفيان الثوري،‏‏‏‏ وَمِسْعَرٌ فَأَوْقَفَاهُ وَلَمْ يَرْفَعَاهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَقَدْ رُوِيَ عَنْ مِسْعَرٍ هَذَا الْحَدِيثُ مَرْفُوعًا أَيْضًا، ‏‏‏‏‏‏وَلَا نَعْرِفُ لِأَسْمَاءَ بْنِ الْحَكَمِ حَدِيثًا مَرْفُوعًا إِلَّا هَذَا."
      },
      {
        "id": 15531,
        "hadith_number": "407",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Mengajar Solat kepada Anak-Anak",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "(Sabrah bin Ma'bad al-Juhni) narrated that: Allah's Messenger (S) said: Teach the boy Salat when he is seven years old, and beat him (if he does not pray) when he is ten.",
        "malay_translation": "Sabrah bin Ma'bad al-Juhni meriwayatkan bahawa: Rasulullah (SAW) bersabda: Ajarkanlah seorang anak lelaki solat ketika dia berumur tujuh tahun, dan pukullah dia (jika dia tidak solat) ketika dia berumur sepuluh tahun.",
        "arabic_text": "حدیث نمبر: 407 حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا حَرْمَلَةُ بْنُ عَبْدِ الْعَزِيزِ بْنِ الرَّبِيعِ بْنِ سَبْرَةَ الْجُهَنِيُّ، عَنْ عَمِّهِ عَبْدِ الْمَلِكِ بْنِ الرَّبِيعِ بْنِ سَبْرَةَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ عَلِّمُوا الصَّبِيَّ الصَّلَاةَ ابْنَ سَبْعِ سِنِينَ وَاضْرِبُوهُ عَلَيْهَا ابْنَ عَشْرٍ قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ سَبْرَةَ بْنِ مَعْبَدٍ الْجُهَنِيِّ حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَعَلَيْهِ الْعَمَلُ عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ، ‏‏‏‏‏‏وَبِهِ يَقُولُ أَحْمَدُ،‏‏‏‏ وَإِسْحَاق، ‏‏‏‏‏‏وَقَالَا:‏‏‏‏ مَا تَرَكَ الْغُلَامُ بَعْدَ الْعَشْرِ مِنَ الصَّلَاةِ فَإِنَّهُ يُعِيدُ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَسَبْرَةُ هُوَ ابْنُ مَعْبَدٍ الْجُهَنِيُّ، ‏‏‏‏‏‏وَيُقَالُ هُوَ:‏‏‏‏ ابْنُ عَوْسَجَةَ."
      },
      {
        "id": 15532,
        "hadith_number": "408",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Hadath Sebelum Taslim Membatalkan Solat?",
        "perawi_melayu": "Abdullah bin Amr meriwayatkan bahawa Rasulullah (SAW) bersabda: Apabila dia melakukan hadath - maksudnya seorang lelaki - dan dia sedang duduk di akhir solatnya sebelum mengucapkan Taslim, maka solatnya diterima (sah).",
        "english_text": "Abdullah bin Amr narrated that: Allah's Messenger (S) said: When he commits Hadath - meaning a man - and he is sitting in the end of his Salat before saying the Taslim, then his Salat is acceptable.",
        "malay_translation": "Abdullah bin Amr meriwayatkan: Rasulullah SAW bersabda: Apabila seseorang itu berhadath - iaitu seorang lelaki - dan dia sedang duduk di penghujung solatnya sebelum memberi salam (Taslim), maka solatnya adalah sah (diterima).",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ مُوسَى الْمُلَقَّبُ مَرْدُوَيْهِ، قَالَ:‏‏‏‏ أَخْبَرَنَا ابْنُ الْمُبَارَكِ، أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ زِيَادِ بْنِ أَنْعُمٍ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ رَافِعٍ، وَبَكْرَ بْنَ سَوَادَةَ أَخْبَرَاهُ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا أَحْدَثَ يَعْنِي الرَّجُلَ وَقَدْ جَلَسَ فِي آخِرِ صَلَاتِهِ قَبْلَ أَنْ يُسَلِّمَ فَقَدْ جَازَتْ صَلَاتُهُ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ إِسْنَادُهُ لَيْسَ بِذَاكَ الْقَوِيِّ وَقَدِ اضْطَرَبُوا فِي إِسْنَادِهِ، ‏‏‏‏‏‏وَقَدْ ذَهَبَ بَعْضُ أَهْلِ الْعِلْمِ إِلَى هَذَا، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ إِذَا جَلَسَ مِقْدَارَ التَّشَهُّدِ وَأَحْدَثَ قَبْلَ أَنْ يُسَلِّمَ فَقَدْ تَمَّتْ صَلَاتُهُ، ‏‏‏‏‏‏وقَالَ بَعْضُ أَهْلِ الْعِلْمِ:‏‏‏‏ إِذَا أَحْدَثَ قَبْلَ أَنْ يَتَشَهَّدَ وَقَبْلَ أَنْ يُسَلِّمَ أَعَادَ الصَّلَاةَ، ‏‏‏‏‏‏وَهُوَ قَوْلُ الشافعي، ‏‏‏‏‏‏وقَالَ أَحْمَدُ:‏‏‏‏ إِذَا لَمْ يَتَشَهَّدْ وَسَلَّمَ أَجْزَأَهُ، ‏‏‏‏‏‏لِقَوْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَتَحْلِيلُهَا التَّسْلِيمُ وَالتَّشَهُّدُ أَهْوَنُ، ‏‏‏‏‏‏قَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي اثْنَتَيْنِ فَمَضَى فِي صَلَاتِهِ وَلَمْ يَتَشَهَّدْ وقَالَ إِسْحَاق بْنُ إِبْرَاهِيمَ:‏‏‏‏ إِذَا تَشَهَّدَ وَلَمْ يُسَلِّمْ أَجْزَأَهُ، ‏‏‏‏‏‏وَاحْتَجَّ بِحَدِيثِ ابْنِ مَسْعُودٍ حِينَ عَلَّمَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ التَّشَهُّدَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِذَا فَرَغْتَ مِنْ هَذَا فَقَدْ قَضَيْتَ مَا عَلَيْكَ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَعَبْدُ الرَّحْمَنِ بْنُ زِيَادِ بْنِ أَنْعُمٍ هُوَ الْأَفْرِيقِيُّ، ‏‏‏‏‏‏وَقَدْ ضَعَّفَهُ بَعْضُ أَهْلِ الْحَدِيثِ مِنْهُمْ يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ،‏‏‏‏ وَأَحْمَدُ بْنُ حَنْبَلٍ."
      },
      {
        "id": 15533,
        "hadith_number": "409",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keringanan Solat Ketika Hujan dalam Musafir",
        "perawi_melayu": "Jabir meriwayatkan:",
        "english_text": "Jabir narrated: We were with the Prophet (S) on a journey when it started to rain on us, so the Prophet (S) said: 'Whoever wishes, let him perform Salat in his place.'",
        "malay_translation": "Jabir meriwayatkan: Kami bersama Nabi (SAW) dalam suatu perjalanan ketika hujan mulai turun, lalu Nabi (SAW) bersabda: 'Sesiapa yang mahu, biarlah dia menunaikan solat di tempatnya.'",
        "arabic_text": "حَدَّثَنَا أَبُو حَفْصٍ عَمْرُو بْنُ عَلِيٍّ الْبَصْرِيُّ، حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، حَدَّثَنَا زُهَيْرُ بْنُ مُعَاوِيَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ:‏‏‏‏ كُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَأَصَابَنَا مَطَرٌ، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ شَاءَ فَلْيُصَلِّ فِي رَحْلِهِ قَالَ:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ،‏‏‏‏ وَسَمُرَةَ،‏‏‏‏ وَأَبِي الْمَلِيحِ، ‏‏‏‏‏‏عَنْ أَبِيهِ وَعَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ قال أبو عيسى:‏‏‏‏ حَدِيثُ جَابِرٍ حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدْ رَخَّصَ أَهْلُ الْعِلْمِ فِي الْقُعُودِ عَنِ الْجَمَاعَةِ وَالْجُمُعَةِ فِي الْمَطَرِ وَالطِّينِ، ‏‏‏‏‏‏وَبِهِ يَقُولُ:‏‏‏‏ أَحْمَدُ،‏‏‏‏ وَإِسْحَاق، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ سَمِعْت أَبَا زُرْعَةَ يَقُولُ:‏‏‏‏ رَوَى عَفَّانُ بْنُ مُسْلِمٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ عَلِيٍّ حَدِيثًا وقَالَ أَبُو زُرْعَةَ:‏‏‏‏ لَمْ نَرَ بِالْبَصْرَةِ أَحْفَظَ مِنْ هَؤُلَاءِ الثَّلَاثَةِ عَلِيِّ بْنِ الْمَدِينِيِّ،‏‏‏‏ وَابْنِ الشَّاذَكُونِيِّ،‏‏‏‏ وَعَمْرِو بْنِ عَلِيٍّ، ‏‏‏‏‏‏وَأَبُو الْمَلِيحِ اسْمُهُ:‏‏‏‏ عَامِرٌ، ‏‏‏‏‏‏وَيُقَالُ:‏‏‏‏ زَيْدُ بْنُ أُسَامَةَ بْنِ عُمَيْرٍ الْهُذَلِيُّ."
      },
      {
        "id": 15534,
        "hadith_number": "410",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Kelebihan Zikir Setelah Solat Bagi Golongan Kurang Mampu",
        "perawi_melayu": "Diriwayatkan daripada Ibn Abbas: Beberapa orang miskin datang kepada Rasulullah (S) dan berkata: 'Wahai Rasulullah (S)! Orang kaya solat seperti kami solat, mereka berpuasa seperti kami berpuasa, tetapi mereka memiliki kekayaan yang dengannya mereka membebaskan hamba dan yang mereka berikan sebagai sedekah.' Baginda bersabda: 'Apabila kamu mengerjakan solat, maka ucapkanlah: 'Subhan Allah' tiga puluh tiga kali, dan: 'Al-Hamdulillah' tiga puluh tiga kali, dan: 'Allahu Akbar' tiga puluh empat kali, dan 'La ilaha illallah' sepuluh kali. Dengan itu kamu akan mengatasi mereka, dan tidak ada seorang pun yang akan mengatasi kamu selepas itu.'",
        "english_text": "Ibn Abbas narrated: Some of the poor people came to Allah's Messenger (S) and said: 'O Messenger of Allah (S)! The rich pray as we pray, they fast as we fast, but they have wealth with which they free slaves and which they give in charity.' He said: 'When you perform Salat, then say: 'Subhan Allah' thirty-three times, and: 'Al-Hamdulillah' thirty-three times, and: 'Allahu Akbar' thirty-four times, and 'La ilaha illallah' ten times. With that you will have surprassed them, and none would surpass you afterwards.'",
        "malay_translation": "Diriwayatkan daripada Ibn Abbas: Beberapa orang miskin datang kepada Rasulullah (S) dan berkata: 'Wahai Rasulullah (S)! Orang kaya solat seperti kami solat, mereka berpuasa seperti kami berpuasa, tetapi mereka memiliki kekayaan yang dengannya mereka membebaskan hamba dan yang mereka berikan sebagai sedekah.' Baginda bersabda: 'Apabila kamu mengerjakan solat, maka ucapkanlah: 'Subhan Allah' tiga puluh tiga kali, dan: 'Al-Hamdulillah' tiga puluh tiga kali, dan: 'Allahu Akbar' tiga puluh empat kali, dan 'La ilaha illallah' sepuluh kali. Dengan itu kamu akan mengatasi mereka, dan tidak ada seorang pun yang akan mengatasi kamu selepas itu.'",
        "arabic_text": "حَدَّثَنَا وَعَلِيُّ بْنُ حُجْرٍ، إِسْحَاق بْنُ إِبْرَاهِيمَ بْنِ حَبِيبِ بْنِ الشَّهِيدِ الْبَصْرِيُّ، قَالَا:‏‏‏‏ حَدَّثَنَا عَتَّابُ بْنُ بَشِيرٍ، عَنْ خُصَيْفٍ، عَنْ مُجَاهِدٍ، وَعِكْرِمَةَ، عَنْ ابْنِ عَبَّاسٍ، قَالَ:‏‏‏‏ جَاءَ الْفُقَرَاءُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالُوا:‏‏‏‏ يَا رَسُولَ اللَّهِ إِنَّ الْأَغْنِيَاءَ يُصَلُّونَ كَمَا نُصَلِّي وَيَصُومُونَ كَمَا نَصُومُ وَلَهُمْ أَمْوَالٌ يُعْتِقُونَ وَيَتَصَدَّقُونَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَإِذَا صَلَّيْتُمْ فَقُولُوا:‏‏‏‏ سُبْحَانَ اللَّهِ ثَلَاثًا وَثَلَاثِينَ مَرَّةً، ‏‏‏‏‏‏وَالْحَمْدُ لِلَّهِ ثَلَاثًا وَثَلَاثِينَ مَرَّةً، ‏‏‏‏‏‏وَاللَّهُ أَكْبَرُ أَرْبَعًا وَثَلَاثِينَ مَرَّةً، ‏‏‏‏‏‏وَلَا إِلَهَ إِلَّا اللَّهُ عَشْرَ مَرَّاتٍ، ‏‏‏‏‏‏فَإِنَّكُمْ تُدْرِكُونَ بِهِ مَنْ سَبَقَكُمْ وَلَا يَسْبِقُكُمْ مَنْ بَعْدَكُمْ قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ كَعْبِ بْنِ عُجْرَةَ،‏‏‏‏ وَأَنَسٍ،‏‏‏‏ وَعَبْدِ اللَّهِ بْنِ عَمْرٍوَ، ‏‏‏‏‏‏وَزَيْدِ بْنِ ثَابِتٍ،‏‏‏‏ وَأَبِي الدَّرْدَاءِ،‏‏‏‏ وَابْنِ عُمَرَ،‏‏‏‏ وَأَبِي ذَرٍّ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَحَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏وَفِي الْبَاب أَيْضًا عَنْ أَبِي هُرَيْرَةَ،‏‏‏‏ وَالْمُغِيرَةِ، ‏‏‏‏‏‏وَقَدْ رُوِيَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏أَنَّهُ قَالَ:‏‏‏‏ خَصْلَتَانِ لَا يُحْصِيهِمَا رَجُلٌ مُسْلِمٌ إِلَّا دَخَلَ الْجَنَّةَ:‏‏‏‏ يُسَبِّحُ اللَّهَ فِي دُبُرِ كُلِّ صَلَاةٍ عَشْرًا، ‏‏‏‏‏‏وَيَحْمَدُهُ عَشْرًا، ‏‏‏‏‏‏وَيُكَبِّرُهُ عَشْرًا، ‏‏‏‏‏‏وَيُسَبِّحُ اللَّهَ عِنْدَ مَنَامِهِ ثَلَاثًا وَثَلَاثِينَ، ‏‏‏‏‏‏وَيَحْمَدُهُ ثَلَاثًا وَثَلَاثِينَ، ‏‏‏‏‏‏وَيُكَبِّرُهُ أَرْبَعًا وَثَلَاثِينَ ."
      },
      {
        "id": 15535,
        "hadith_number": "411",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Solat dalam Keadaan Hujan dan Sempit",
        "perawi_melayu": "Amr bin Uthman bin Ya'la bin Murrah meriwayatkan daripada ayahnya, daripada datuknya:",
        "english_text": "Amr bin Uthman bin Ya'la bin Murrah narrated from his father, from his grand-father that : They were with the Prophet (S) on a journey. They wound up in a narrow area when Salat became due. Then it began raining from the sky above them, and it was wet beneath them. So Allah's Messenger (S) called the Adhan while he was on his mount, and then the Iqamah, going forward on his mount. He let them in Salat by making gestures, making his prostrations lower than his bowing.",
        "malay_translation": "Amr bin Uthman bin Ya'la bin Murrah meriwayatkan daripada ayahnya, daripada datuknya: Mereka bersama Nabi (SAW) dalam suatu perjalanan. Mereka tiba di kawasan yang sempit ketika waktu Solat telah masuk. Kemudian hujan mulai turun dari langit di atas mereka, dan di bawah mereka basah. Maka Rasulullah (SAW) menyeru Azan ketika baginda berada di atas kenderaannya, dan kemudian Iqamah, bergerak maju di atas kenderaannya. Baginda mengimami mereka dalam Solat dengan memberi isyarat, menjadikan sujudnya lebih rendah daripada rukuknya.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى، حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ، حَدَّثَنَا عُمَرُ بْنُ الرَّمَّاحِ الْبَلْخِيُّ، عَنْ كَثِيرِ بْنِ زِيَادٍ، عَنْ عَمْرِو بْنِ عُثْمَانَ بْنِ يَعْلَى بْنِ مُرَّةَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّهُمْ كَانُوا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَسِيرٍ، ‏‏‏‏‏‏فَانْتَهَوْا إِلَى مَضِيقٍ وَحَضَرَتِ الصَّلَاةُ فَمُطِرُوا السَّمَاءُ مِنْ فَوْقِهِمْ وَالْبِلَّةُ مِنْ أَسْفَلَ مِنْهُمْ فَأَذَّنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى رَاحِلَتِهِ وَأَقَامَ أَوْ أَقَامَ فَتَقَدَّمَ عَلَى رَاحِلَتِهِ فَصَلَّى بِهِمْ يُومِئُ إِيمَاءً يَجْعَلُ السُّجُودَ أَخْفَضَ مِنَ الرُّكُوعِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ، ‏‏‏‏‏‏تَفَرَّدَ بِهِ عُمَرُ بْنُ الرَّمَّاحِ الْبَلْخِيُّ، ‏‏‏‏‏‏لَا يُعْرَفُ إِلَّا مِنْ حَدِيثِهِ، ‏‏‏‏‏‏وَقَدْ رَوَى عَنْهُ غَيْرُ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ، ‏‏‏‏‏‏وَكَذَلِكَ رُوِيَ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ صَلَّى فِي مَاءٍ وَطِينٍ عَلَى دَابَّتِهِ، ‏‏‏‏‏‏وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ، ‏‏‏‏‏‏وَبِهِ يَقُولُ:‏‏‏‏ أَحْمَدُ،‏‏‏‏ وَإِسْحَاق."
      },
      {
        "id": 15536,
        "hadith_number": "412",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Nabi Muhammad SAW Melakukan Solat Sehingga Kakinya Bengkak Kerana Bersyukur",
        "perawi_melayu": "Al-Mughirah bin Shu'bah meriwayatkan:",
        "english_text": "Al-Mughirah bin Shu'bah narrated: Allah's Messenger (S) performed Salat until his feet were swollen, so it was said to him: 'You burden yourself like this, while your past and future sins have been forgiven?' He said: 'Shouldn't I be a grateful worshipper?'",
        "malay_translation": "Al-Mughirah bin Shu'bah meriwayatkan: Rasulullah SAW melakukan solat sehingga kakinya bengkak, lalu dikatakan kepadanya: 'Engkau membebankan diri engkau seperti ini, sedangkan dosa-dosa engkau yang lalu dan yang akan datang telah diampunkan?' Baginda bersabda: 'Tidakkah patut aku menjadi seorang hamba yang bersyukur?'",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، وَبِشْرُ بْنُ مُعَاذٍ الْعَقَدِيُّ، قَالَا:‏‏‏‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ زِيَادِ بْنِ عِلَاقَةَ، عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ:‏‏‏‏ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى انْتَفَخَتْ قَدَمَاهُ، ‏‏‏‏‏‏فَقِيلَ لَهُ:‏‏‏‏ أَتَتَكَلَّفُ هَذَا وَقَدْ غُفِرَ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَفَلَا أَكُونُ عَبْدًا شَكُورًا قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ،‏‏‏‏ وَعَائِشَةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ الْمُغِيرَةِ بْنِ شُعْبَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 15537,
        "hadith_number": "413",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Amalan Pertama yang Dihisab pada Hari Kiamat: Solat",
        "perawi_melayu": "Huraith bin Qabisah",
        "english_text": "Huraith bin Qabisah narrated: I arrived in Al-Madinah and said: 'O Allah! Facilitate me to be in a righteous gathering.' He said: I sat with Abu Hurairah and said: 'Indeed I asked Allah to provide me with a righteous gathering. So narrate a hadith to me which you heard from Allah's Messenger (ﷺ) so that perhaps Allah would cause me to benefit from it.' He said: 'I heard Allah's Messenger (ﷺ) say: Indeed the first deed by which a servant will be called to account on the Day of Resurrection is his Salat. If it is complete, he is successful and saved, but if it is defective, he has failed and lost. So if something is deficient in his obligatory (prayers) then the Lord, Mighty and Sublime says: 'Look! Are there any voluntary (prayers) for my worshipper?' So with them, what was deficient in his obligatory (prayers) will be completed. Then the rest of his deeds will be treated like that.",
        "malay_translation": "Huraith bin Qabisah meriwayatkan: Aku tiba di Madinah dan berkata: 'Ya Allah! Permudahkanlah aku untuk berada dalam perkumpulan yang soleh.' Dia berkata: Aku duduk bersama Abu Hurairah dan berkata: 'Sesungguhnya aku memohon kepada Allah untuk menyediakan bagiku perkumpulan yang soleh. Maka riwayatkanlah kepadaku sebuah hadis yang engkau dengar daripada Rasulullah (ﷺ) agar Allah memberikan manfaat kepadaku dengannya.' Dia berkata: 'Aku mendengar Rasulullah (ﷺ) bersabda: Sesungguhnya amalan pertama yang seorang hamba akan dihisab pada Hari Kiamat adalah solatnya. Jika solatnya sempurna, maka dia berjaya dan selamat, tetapi jika solatnya kurang, maka dia telah gagal dan rugi. Maka jika terdapat kekurangan dalam solat fardunya, maka Tuhan, Yang Maha Perkasa dan Maha Tinggi berfirman: 'Lihatlah! Adakah terdapat solat sunat bagi hamba-Ku?' Maka dengannya, apa yang kurang dalam solat fardunya akan disempurnakan. Kemudian seluruh amalannya yang lain akan diperlakukan seperti itu.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ نَصْرِ بْنِ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا سَهْلُ بْنُ حَمَّادٍ، حَدَّثَنَا هَمَّامٌ، قَالَ:‏‏‏‏ حَدَّثَنِي قَتَادَةُ، عَنْ الْحَسَنِ، عَنْ حُرَيْثِ بْنِ قَبِيصَةَ، قَالَ:‏‏‏‏ قَدِمْتُ الْمَدِينَةَ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ اللَّهُمَّ يَسِّرْ لِي جَلِيسًا صَالِحًا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَجَلَسْتُ إِلَى أَبِي هُرَيْرَةَ، فَقُلْتُ:‏‏‏‏ إِنِّي سَأَلْتُ اللَّهَ أَنْ يَرْزُقَنِي جَلِيسًا صَالِحًا فَحَدِّثْنِي بِحَدِيثٍ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَلَّ اللَّهَ أَنْ يَنْفَعَنِي بِهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ إِنَّ أَوَّلَ مَا يُحَاسَبُ بِهِ الْعَبْدُ يَوْمَ الْقِيَامَةِ مِنْ عَمَلِهِ صَلَاتُهُ فَإِنْ صَلُحَتْ فَقَدْ أَفْلَحَ وَأَنْجَحَ وَإِنْ فَسَدَتْ فَقَدْ خَابَ وَخَسِرَ، ‏‏‏‏‏‏فَإِنِ انْتَقَصَ مِنْ فَرِيضَتِهِ شَيْءٌ قَالَ الرَّبُّ عَزَّ وَجَلَّ:‏‏‏‏ انْظُرُوا هَلْ لِعَبْدِي مِنْ تَطَوُّعٍ فَيُكَمَّلَ بِهَا مَا انْتَقَصَ مِنَ الْفَرِيضَةِ، ‏‏‏‏‏‏ثُمَّ يَكُونُ سَائِرُ عَمَلِهِ عَلَى ذَلِكَ قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ تَمِيمٍ الدَّارِيِّ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ هَذَا الْوَجْهِ عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَقَدْ رَوَى بَعْضُ أَصْحَابِ الْحَسَنِ، ‏‏‏‏‏‏عَنْ الْحَسَنِ، ‏‏‏‏‏‏عَنْ قَبِيصَةَ بْنِ حُرَيْثٍ غَيْرَ هَذَا الْحَدِيثِ، ‏‏‏‏‏‏وَالْمَشْهُورُ هُوَ قَبِيصَةُ بْنُ حُرَيْثٍ، ‏‏‏‏‏‏وَرُوِي عَنْ أَنَسِ بْنِ حَكِيمٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوُ هَذَا."
      },
      {
        "id": 15538,
        "hadith_number": "414",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keutamaan Solat Sunat Rawatib: Pembinaan Rumah di Syurga",
        "perawi_melayu": "Aisyah meriwayatkan bahawa Rasulullah (SAW) bersabda:",
        "english_text": "Aishah narrated that Allah's Messenger (S) said: Whoever is regular with twelve Rak'ah of Sunnah (prayer), Allah will build a house for him in Paradise: Four Rak'ah before Zuhr, two Rak'ah after it, two Rak'ah after Maghrib, two Rak'ah after Isha, and two Rak'ah before Fajr.",
        "malay_translation": "Aisyah meriwayatkan bahawa Rasulullah SAW bersabda: Sesiapa yang tetap (istiqamah) mengerjakan dua belas rakaat solat sunat, Allah akan membina baginya sebuah rumah di syurga: Empat rakaat sebelum Zuhur, dua rakaat selepasnya, dua rakaat selepas Maghrib, dua rakaat selepas Isyak, dan dua rakaat sebelum Subuh.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ النَّيْسَابُورِيُّ، حَدَّثَنَا إِسْحَاق بْنُ سُلَيْمَانَ الرَّازِيُّ، حَدَّثَنَا الْمُغِيرَةُ بْنُ زِيَادٍ، عَنْ عَطَاءٍ، عَنْ عَائِشَةَ، قَالَتْ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ ثَابَرَ عَلَى ثِنْتَيْ عَشْرَةَ رَكْعَةً مِنَ السُّنَّةِ بَنَى اللَّهُ لَهُ بَيْتًا فِي الْجَنَّةِ، ‏‏‏‏‏‏أَرْبَعِ رَكَعَاتٍ قَبْلَ الظُّهْرِ، ‏‏‏‏‏‏وَرَكْعَتَيْنِ بَعْدَهَا وَرَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ، ‏‏‏‏‏‏وَرَكْعَتَيْنِ بَعْدَ الْعِشَاءِ، ‏‏‏‏‏‏وَرَكْعَتَيْنِ قَبْلَ الْفَجْرِ قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ أُمِّ حَبِيبَةَ، ‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ،‏‏‏‏ وَأَبِي مُوسَى،‏‏‏‏ وَابْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى 12:‏‏‏‏ حَدِيثُ عَائِشَةَ حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَمُغِيرَةُ بْنُ زِيَادٍ قَدْ تَكَلَّمَ فِيهِ بَعْضُ أَهْلِ الْعِلْمِ مِنْ قِبَلِ حِفْظِهِ."
      },
      {
        "id": 15539,
        "hadith_number": "415",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keutamaan Solat Sunat Dua Belas Rakaat Sehari Semalam",
        "perawi_melayu": "Umm Habibah meriwayatkan bahawa Rasulullah SAW bersabda: Sesiapa yang solat dua belas rakaat dalam sehari dan semalam, sebuah rumah akan dibina untuknya di Syurga: Empat rakaat sebelum Zuhur, dua rakaat selepasnya, dua rakaat selepas Maghrib, dua rakaat selepas Isyak, dan dua rakaat sebelum Subuh pada solat pagi.",
        "english_text": "Umm Habibah narrated that Allah's Messenger (S) sad: Whoever prays twelve Rak'ah in a day and night, a house will be built from him in Paradise: Four Rak'ah before Zuhr, two Rak'ah after it, two Rak'ah after Maghrib, two Rak'ah after Isha, and two Rak'ah before Fajr in the morning Salat.",
        "malay_translation": "Umm Habibah meriwayatkan bahawa Rasulullah SAW bersabda: “Sesiapa yang menunaikan solat sunat dua belas rakaat dalam sehari semalam, akan dibina untuknya sebuah rumah di syurga: Empat rakaat sebelum Zuhur, dua rakaat sesudahnya, dua rakaat sesudah Maghrib, dua rakaat sesudah Isyak, dan dua rakaat sebelum Subuh (Fajr) pada solat pagi.”",
        "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا مُؤَمَّلٌ هُوَ ابْنُ إِسْمَاعِيل، حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ، عَنْ أَبِي إِسْحَاق، عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ، عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ، عَنْ أُمِّ حَبِيبَةَ، قَالَتْ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ صَلَّى فِي يَوْمٍ وَلَيْلَةٍ ثِنْتَيْ عَشْرَةَ رَكْعَةً بُنِيَ لَهُ بَيْتٌ فِي الْجَنَّةِ، ‏‏‏‏‏‏أَرْبَعًا قَبْلَ الظُّهْرِ وَرَكْعَتَيْنِ بَعْدَهَا، ‏‏‏‏‏‏وَرَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ، ‏‏‏‏‏‏وَرَكْعَتَيْنِ بَعْدَ الْعِشَاءِ، ‏‏‏‏‏‏وَرَكْعَتَيْنِ قَبْلَ صَلَاةِ الْفَجْرِ قَالَ أَبُو عِيسَى:‏‏‏‏ وَحَدِيثُ عَنْبَسَةَ، ‏‏‏‏‏‏عَنْ أُمِّ حَبِيبَةَ فِي هَذَا الْبَابِ حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدْ رُوِيَ عَنْ عَنْبَسَةَ مِنْ غَيْرِ وَجْهٍ."
      },
      {
        "id": 15540,
        "hadith_number": "416",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keutamaan Dua Rakaat Sunat Fajar",
        "perawi_melayu": "Aishah meriwayatkan bahawa Rasulullah SAW bersabda",
        "english_text": "Aishah narrated that : Allah's Messenger (S) said: The two Rak'ah of Fajr are better than the world and what is in it.",
        "malay_translation": "Aishah meriwayatkan bahawa: Rasulullah SAW bersabda: Dua rakaat (sunat) Fajar adalah lebih baik daripada dunia dan segala isinya.",
        "arabic_text": "حَدَّثَنَا صَالِحُ بْنُ عَبْدِ اللَّهِ التِّرْمِذِيُّ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ سَعْدِ بْنِ هِشَامٍ، عَنْ عَائِشَةَ، قَالَتْ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ رَكْعَتَا الْفَجْرِ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عَلِيٍّ،‏‏‏‏ وَابْنِ عُمَرَ،‏‏‏‏ وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ عَائِشَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدْ رَوَى أَحْمَدُ بْنُ حَنْبَلٍ، ‏‏‏‏‏‏عَنْ صَالِحِ بْنِ عَبْدِ اللَّهِ التِّرْمِذِيِّ حَدِيثَ عَائِشَةَ."
      },
      {
        "id": 15541,
        "hadith_number": "417",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Bacaan Rasulullah SAW dalam Dua Rakaat Sebelum Subuh",
        "perawi_melayu": "Ibn Umar meriwayatkan:",
        "english_text": "Ibn Umar narrated: I watched the Prophet (S) for a month. In the two Rak'ah before Fajr he would recite: Say: O you disbelievers! and Say: Allah is One .",
        "malay_translation": "Ibn Umar meriwayatkan: Aku memerhatikan Nabi (SAW) selama sebulan. Dalam dua rakaat sebelum Fajr, baginda membaca: Qul ya ayyuhal kafirun (Katakanlah: Hai orang-orang kafir!) dan Qul Huwa Allahu Ahad (Katakanlah: Allah itu Esa).",
        "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ وَأَبُو عَمَّارٍ، قَالَا:‏‏‏‏ حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاق، عَنْ مُجَاهِدٍ، عَنْ ابْنِ عُمَرَ، قَالَ:‏‏‏‏ رَمَقْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَهْرًا فَكَانَ يَقْرَأُ فِي الرَّكْعَتَيْنِ قَبْلَ الْفَجْرِ بِ:‏‏‏‏ قُلْ يَا أَيُّهَا الْكَافِرُونَ وَ قُلْ هُوَ اللَّهُ أَحَدٌ قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ ابْنِ مَسْعُودٍ،‏‏‏‏ وَأَنَسٍ،‏‏‏‏ وَأَبِي هُرَيْرَةَ،‏‏‏‏ وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَحَفْصَةَ، ‏‏‏‏‏‏وَعَائِشَةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ، ‏‏‏‏‏‏وَلَا نَعْرِفُهُ مِنْ حَدِيثِ الثَّوْرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق إِلَّا مِنْ حَدِيثِ أَبِي أَحْمَدَ، ‏‏‏‏‏‏وَالْمَعْرُوفُ عِنْدَ النَّاسِ حَدِيثُ إِسْرَائِيلَ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏وَقَدْ رَوَى عَنْ أَبِي أَحْمَدَ، عَنْ إِسْرَائِيلَ هَذَا الْحَدِيثُ أَيْضًا، ‏‏‏‏‏‏وَأَبُو أَحْمَدَ الزُّبَيْرِيُّ ثِقَةٌ. حَافِظٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْت بُنْدَارًا، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ مَا رَأَيْتُ أَحَدًا أَحْسَنَ حِفْظًا مِنْ أَبِي أَحْمَدَ الزُّبَيْرِيِّ، ‏‏‏‏‏‏وَأَبُو أَحْمَدَ اسْمُهُ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ الْكُوفِيُّ الْأَسَدِيُّ."
      },
      {
        "id": 15542,
        "hadith_number": "418",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Rasulullah SAW Berbicara Selepas Solat Sunat Fajar",
        "perawi_melayu": "Aishah meriwayatkan:",
        "english_text": "Aishah narrated: When Allah's Messenger (S) prayed the two Rak'ah (before) Fajr if he needed something from me he would talk to me, if not, he would go to Salat.",
        "malay_translation": "Aishah meriwayatkan: Apabila Rasulullah SAW menunaikan solat dua rakaat (sebelum) Subuh, jika baginda memerlukan sesuatu daripadaku, baginda akan berbicara denganku, jika tidak, baginda akan pergi untuk solat.",
        "arabic_text": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى الْمَرْوَزِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، قَال:‏‏‏‏ سَمِعْتُ مَالِكَ بْنَ أَنَسٍ، عَنْ أَبِي النَّضْرِ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، قَالَتْ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى رَكْعَتَيِ الْفَجْرِ، ‏‏‏‏‏‏فَإِنْ كَانَتْ لَهُ إِلَيَّ حَاجَةٌ كَلَّمَنِي وَإِلَّا خَرَجَ إِلَى الصَّلَاةِ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدْ كَرِهَ بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمُ الْكَلَامَ بَعْدَ طُلُوعِ الْفَجْرِ حَتَّى يُصَلِّيَ صَلَاةَ الْفَجْرِ، ‏‏‏‏‏‏إِلَّا مَا كَانَ مِنْ ذِكْرِ اللَّهِ أَوْ مِمَّا لَا بُدَّ مِنْهُ، ‏‏‏‏‏‏وَهُوَ قَوْلُ أَحْمَدَ،‏‏‏‏ وَإِسْحَاق."
      },
      {
        "id": 15543,
        "hadith_number": "419",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Larangan Solat Sunat Selepas Fajr Kecuali Dua Sujud",
        "perawi_melayu": "Diriwayatkan daripada Ibn Umar RA bahawa Rasulullah SAW bersabda: Tidak ada solat sunat selepas (bermulanya) Al-Fajr kecuali dua sujud (iaitu, solat sunat Fajar).",
        "english_text": "Ibn Umar narrated that: Allah's Messenger (S) said: There is no Salat after Al-Fajr (begins) except two prostrations.",
        "malay_translation": "Diriwayatkan daripada Ibn Umar RA bahawa Rasulullah SAW bersabda: Tidak ada solat sunat selepas (bermulanya) Al-Fajr kecuali dua sujud (iaitu, solat sunat Fajar).",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ قُدَامَةَ بْنِ مُوسَى، عَنْ مُحَمَّدِ بْنِ الْحُصَيْنِ، عَنْ أَبِي عَلْقَمَةَ، عَنْ يَسَارٍ مَوْلَى ابْنِ عُمَرَ، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا صَلَاةَ بَعْدَ الْفَجْرِ إِلَّا سَجْدَتَيْنِ وَمَعْنَى هَذَا الْحَدِيثِ إِنَّمَا يَقُولُ:‏‏‏‏ لَا صَلَاةَ بَعْدَ طُلُوعِ الْفَجْرِ إِلَّا رَكْعَتَيِ الْفَجْرِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍ، ‏‏‏‏‏‏وَحَفْصَةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ قُدَامَةَ بْنِ مُوسَى، ‏‏‏‏‏‏وَرَوَى عَنْهُ غَيْرُ وَاحِدٍ، ‏‏‏‏‏‏وَهُوَ مَا اجْتَمَعَ عَلَيْهِ أَهْلُ الْعِلْمِ كَرِهُوا أَنْ يُصَلِّيَ الرَّجُلُ بَعْدَ طُلُوعِ الْفَجْرِ إِلَّا رَكْعَتَيِ الْفَجْرِ."
      },
      {
        "id": 15544,
        "hadith_number": "420",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Berbaring Selepas Solat Sunat Fajar",
        "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah (SAW) bersabda:",
        "english_text": "Abu Hurairah narrated that: Allah's Messenger (S) said: When one of you prays the two Rak'ah of Fajr then let him lay down on his right (side).",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah (SAW) bersabda: Apabila salah seorang daripada kamu telah menunaikan solat dua rakaat Fajar, maka hendaklah dia berbaring di sisi kanannya.",
        "arabic_text": "حَدَّثَنَا بِشْرُ بْنُ مُعَاذٍ الْعَقَدِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا الْأَعْمَشُ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا صَلَّى أَحَدُكُمْ رَكْعَتَيِ الْفَجْرِ فَلْيَضْطَجِعْ عَلَى يَمِينِهِ قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عَائِشَةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَقَدْ رُوِيَ عَنْ عَائِشَةَ، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا صَلَّى رَكْعَتَيِ الْفَجْرِ فِي بَيْتِهِ اضْطَجَعَ عَلَى يَمِينِهِ وَقَدْ رَأَى بَعْضُ أَهْلِ الْعِلْمِ أَنْ يُفْعَلَ هَذَا اسْتِحْبَابًا."
      },
      {
        "id": 15545,
        "hadith_number": "421",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Tiada Solat Selepas Iqamah Kecuali yang Wajib",
        "perawi_melayu": "Abu Hurairah meriwayatkan bahawa: Rasulullah (SAW) bersabda: Apabila Iqamah telah dilaungkan untuk solat, maka tidak ada solat kecuali yang wajib.",
        "english_text": "Abu Hurairah narrated that: Allah's Messenger (S) said: When the Iqamah has been called for the Salat then there is no Salat except the obligatory.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa: Rasulullah (SAW) bersabda: Apabila Iqamah telah dilaungkan untuk solat, maka tidak ada solat kecuali solat fardhu.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا زَكَرِيَّا بْنُ إِسْحَاق، حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، قَال:‏‏‏‏ سَمِعْتُ عَطَاءَ بْنَ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا أُقِيمَتِ الصَّلَاةُ فَلَا صَلَاةَ إِلَّا الْمَكْتُوبَةُ قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ ابْنِ بُحَيْنَةَ،‏‏‏‏ وَعَبْدِ اللَّهِ بْنِ عَمْرٍوَ، ‏‏‏‏‏‏وَعَبْدِ اللَّهِ بْنِ سَرْجِسَ،‏‏‏‏ وَابْنِ عَبَّاسٍ،‏‏‏‏ وَأَنَسٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ، ‏‏‏‏‏‏وَهَكَذَا رَوَى أَيُّوبُ،‏‏‏‏ وَوَرْقَاءُ بْنُ عُمَرَ،‏‏‏‏ وَزِيَادُ بْنُ سَعْدٍ،‏‏‏‏ وَإِسْمَاعِيل بْنُ مُسْلِمٍ،‏‏‏‏ وَمُحَمَّدُ بْنُ جُحَادَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَرَوَى حَمَّادُ بْنُ زَيْدٍ،‏‏‏‏ وَسُفْيَانُ بْنُ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ دِينَارٍ فَلَمْ يَرْفَعَاهُ، ‏‏‏‏‏‏وَالْحَدِيثُ الْمَرْفُوعُ أَصَحُّ عِنْدَنَا، ‏‏‏‏‏‏وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ إِذَا أُقِيمَتِ الصَّلَاةُ أَنْ لَا يُصَلِّيَ الرَّجُلُ إِلَّا الْمَكْتُوبَةَ، ‏‏‏‏‏‏وَبِهِ يَقُولُ:‏‏‏‏ سفيان الثوري،‏‏‏‏ وَابْنُ الْمُبَارَكِ،‏‏‏‏ وَالشَّافِعِيُّ،‏‏‏‏ وَأَحْمَدُ،‏‏‏‏ وَإِسْحَاق، ‏‏‏‏‏‏وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ غَيْرِ هَذَا الْوَجْهِ، ‏‏‏‏‏‏رَوَاهُ عَيَّاشُ بْنُ عَبَّاسٍ الْقِتْبَانِيُّ الْمِصْرِيُّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ هَذَا."
      },
      {
        "id": 15546,
        "hadith_number": "422",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Tidak mengapa mengulangi solat sunat setelah solat fardhu jika terlupa",
        "perawi_melayu": "Qais meriwayatkan:",
        "english_text": "Qais narrated: Allah's Messenger (S) went out and the Iqamah was called for the Salat so I prayed As-Subh with him. Then the Prophet (S) turned and found me performing Salat so he said: 'Easy O Qais! Are there two prayers together?' I said: 'O Messenger of Allah! I did not perform the two Rak'ah (before) Fajr.' He said: 'Then there is no harm.'",
        "malay_translation": "Qais meriwayatkan: Rasulullah (S) keluar dan Iqamah dilaungkan untuk solat, lalu aku solat As-Subh bersamanya. Kemudian Nabi (S) berpaling dan mendapati aku sedang melakukan solat, maka baginda bersabda: 'Perlahan-lahan wahai Qais! Adakah dua solat bersama-sama?' Aku berkata: 'Wahai Rasulullah! Aku tidak melakukan dua Rak'ah (sebelum) Fajr.' Baginda bersabda: 'Jika begitu, tidak mengapa.'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو السَّوَّاقُ الْبَلْخِيُّ، قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ سَعْدِ بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ جَدِّهِ قَيْسٍ، قَالَ:‏‏‏‏ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأُقِيمَتِ الصَّلَاةُ فَصَلَّيْتُ مَعَهُ الصُّبْحَ، ‏‏‏‏‏‏ثُمَّ انْصَرَفَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَجَدَنِي أُصَلِّي، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَهْلًا يَا قَيْسُ أَصَلَاتَانِ مَعًا ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ إِنِّي لَمْ أَكُنْ رَكَعْتُ رَكْعَتَيِ الْفَجْرِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَلَا إِذًا قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ مُحَمَّدِ بْنِ إِبْرَاهِيمَ لَا نَعْرِفُهُ مِثْلَ هَذَا إِلَّا مِنْ حَدِيثِ سَعْدِ بْنِ سَعِيدٍ، ‏‏‏‏‏‏وقَالَ سُفْيَانُ بْنُ عُيَيْنَةَ:‏‏‏‏ سَمِعَ عَطَاءُ بْنُ أَبِي رَبَاحٍ، ‏‏‏‏‏‏مِنْ سَعْدِ بْنِ سَعِيدٍ هَذَا الْحَدِيثَ، ‏‏‏‏‏‏وَإِنَّمَا يُرْوَى هَذَا الْحَدِيثُ مُرْسَلًا، ‏‏‏‏‏‏وَقَدْ قَالَ قَوْمٌ مِنْ أَهْلِ مَكَّةَ بِهَذَا الْحَدِيثِ:‏‏‏‏ لَمْ يَرَوْا بَأْسًا أَنْ يُصَلِّيَ الرَّجُلُ الرَّكْعَتَيْنِ بَعْدَ الْمَكْتُوبَةِ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ. قَالَ أَبُو عِيسَى:‏‏‏‏ وَسَعْدُ بْنُ سَعِيدٍ هُوَ أَخُ وَيَحْيَى بْنِ سَعِيدٍ الْأَنْصَارِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَقَيْسٌ هُوَ جَدُّ يَحْيَى بْنِ سَعِيدٍ الْأَنْصَارِيِّ وَيُقَالُ:‏‏‏‏ هُوَ قَيْسُ بْنُ عَمْرٍ، ‏‏‏‏‏‏وَيُقَالُ:‏‏‏‏ هوَ قَيْسُ بْنُ قَهْدٍ، ‏‏‏‏‏‏وَإِسْنَادُ هَذَا الْحَدِيثِ لَيْسَ بِمُتَّصِلٍ، ‏‏‏‏‏‏مُحَمَّدُ بْنُ إِبْرَاهِيمَ التَّيْمِيُّ لَمْ يَسْمَعْ مِنْ قَيْسٍ، ‏‏‏‏‏‏وَرَوَى بَعْضُهُمْ هَذَا الْحَدِيثَ، ‏‏‏‏‏‏عَنْ سَعْدِ بْنِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ فَرَأَى قَيْسًا، ‏‏‏‏‏‏وَهَذَا أَصَحُّ مِنْ حَدِيثِ عَبْدِ الْعَزِيزِ، ‏‏‏‏‏‏عَنْ سَعْدِ بْنِ سَعِيدٍ."
      },
      {
        "id": 15547,
        "hadith_number": "423",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Menunaikan Solat Sunat Fajar Selepas Matahari Terbit",
        "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah (SAW) bersabda: Sesiapa yang tidak menunaikan dua rakaat (sebelum) Fajr, maka hendaklah dia menunaikannya setelah matahari terbit.",
        "english_text": "Abu Hurairah narrated that: Allah's Messenger (S) said: Whoever did not pray the two Rak'ah (before) Fajr then let him pray them after the sun has risen.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah (SAW) bersabda: Sesiapa yang tidak menunaikan dua rakaat (sebelum) Subuh, maka hendaklah dia menunaikannya setelah matahari terbit.",
        "arabic_text": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ الْبَصْرِيُّ، حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ النَّضْرِ بْنِ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ لَمْ يُصَلِّ رَكْعَتَيِ الْفَجْرِ فَلْيُصَلِّهِمَا بَعْدَ مَا تَطْلُعُ الشَّمْسُ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَقَدْ رُوِيَ عَنْ ابْنِ عُمَرَ أَنَّهُ فَعَلَهُ، ‏‏‏‏‏‏وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ، ‏‏‏‏‏‏وَبِهِ يَقُولُ:‏‏‏‏ سفيان الثوري،‏‏‏‏ وَابْنُ الْمُبَارَكِ،‏‏‏‏ وَالشَّافِعِيُّ،‏‏‏‏ وَأَحْمَدُ،‏‏‏‏ وَإِسْحَاق، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَلَا نَعْلَمُ أَحَدًا رَوَى هَذَا الْحَدِيثَ عَنْ هَمَّامٍ بِهَذَا الْإِسْنَادِ نَحْوَ هَذَا إِلَّا عَمْرَو بْنَ عَاصِمٍ الْكِلَابِيَّ، ‏‏‏‏‏‏وَالْمَعْرُوفُ مِنْ حَدِيثِ قَتَادَةَ، ‏‏‏‏‏‏عَنْ النَّضْرِ بْنِ أَنَسٍ، ‏‏‏‏‏‏عَنْ بَشِيرِ بْنِ نَهِيكٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَنْ أَدْرَكَ رَكْعَةً مِنْ صَلَاةِ الصُّبْحِ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ فَقَدْ أَدْرَكَ الصُّبْحَ."
      },
      {
        "id": 15548,
        "hadith_number": "424",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Solat Sunat Empat Rakaat Sebelum Zohor dan Dua Rakaat Selepasnya",
        "perawi_melayu": "Diriwayatkan daripada Ali RA:",
        "english_text": "Ali narrated: The Prophet (S) would pray four Rak'ah before Az-Zuhr and two Rak'ah after it.",
        "malay_translation": "Diriwayatkan daripada Ali RA: Nabi SAW biasanya solat empat rakaat sebelum Zohor dan dua rakaat selepasnya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاق، عَنْ عَاصِمِ بْنِ ضَمْرَةَ، عَنْ عَلِيٍّ، قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي قَبْلَ الظُّهْرِ أَرْبَعًا وَبَعْدَهَا رَكْعَتَيْنِ قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عَائِشَةَ، ‏‏‏‏‏‏وَأُمِّ حَبِيبَةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ عَلِيٍّ حَدِيثٌ حَسَنٌ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو بَكْرٍ الْعَطَّارُ، ‏‏‏‏‏‏قَالَ عَلِيُّ بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كُنَّا نَعْرِفُ فَضْلَ حَدِيثِ عَاصِمِ بْنِ ضَمْرَةَ عَلَى حَدِيثِ الْحَارِثِ، ‏‏‏‏‏‏وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَنْ بَعْدَهُمْ يَخْتَارُونَ أَنْ يُصَلِّيَ الرَّجُلُ قَبْلَ الظُّهْرِ أَرْبَعَ رَكَعَاتٍ، ‏‏‏‏‏‏وَهُوَ قَوْلُ سفيان الثوري،‏‏‏‏ وَابْنِ الْمُبَارَكِ،‏‏‏‏ وَإِسْحَاق وَأَهْلِ الْكُوفَةِ، ‏‏‏‏‏‏وقَالَ بَعْضُ أَهْلِ الْعِلْمِ:‏‏‏‏ صَلَاةُ اللَّيْلِ وَالنَّهَارِ مَثْنَى مَثْنَى يَرَوْنَ الْفَصْلَ بَيْنَ كُلِّ رَكْعَتَيْنِ، ‏‏‏‏‏‏وَبِهِ يَقُولُ:‏‏‏‏ الشافعي،‏‏‏‏ وَأَحْمَدُ."
      },
      {
        "id": 15549,
        "hadith_number": "425",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Solat Sunat Sebelum dan Selepas Zohor",
        "perawi_melayu": "Ibn Umar meriwayatkan:",
        "english_text": "Ibn Umar narrated: I prayed two Rak'ah with the Prophet (S) before Az-Zuhr and two Rak'ah after it.",
        "malay_translation": "Ibn Umar meriwayatkan: Saya solat dua rakaat bersama Nabi (SAW) sebelum Zohor dan dua rakaat selepasnya.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا إِسْمَاعِيل بْنُ إِبْرَاهِيمَ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنْ ابْنِ عُمَرَ، قَالَ:‏‏‏‏ صَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَيْنِ قَبْلَ الظُّهْرِ وَرَكْعَتَيْنِ بَعْدَهَا قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عَلِيٍّ، ‏‏‏‏‏‏وَعَائِشَةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 15550,
        "hadith_number": "426",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Nabi S.A.W. Menunaikan Solat Sunat Empat Rakaat Selepas Zuhur Jika Tertinggal Sebelumnya",
        "perawi_melayu": "Aisyah meriwayatkan:",
        "english_text": "Aishah narrated: When the Prophet (S) would not perform the four Rak'ah before Az-Zuhr he would pray them after it.",
        "malay_translation": "Aisyah meriwayatkan: Apabila Nabi (S) tidak menunaikan empat rakaat (sunat) sebelum Zuhur, baginda akan menunaikannya selepas (solat) Zuhur.",
        "arabic_text": "حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عُبَيْدِ اللَّهِ الْعَتَكِيُّ الْمَرْوَزِيُّ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ، عَنْ عَائِشَةَ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا لَمْ يُصَلِّ أَرْبَعًا قَبْلَ الظُّهْرِ صَلَّاهُنَّ بَعْدَهُ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏إِنَّمَا نَعْرِفُهُ مِنْ حَدِيثِ ابْنِ الْمُبَارَكِ مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَقَدْ رَوَاهُ قَيْسُ بْنُ الرَّبِيعِ، عَنْ شُعْبَةَ، عَنْ خَالِدٍ الْحَذَّاءِ نَحْوَ هَذَا وَلَا نَعْلَمُ أَحَدًا رَوَاهُ، ‏‏‏‏‏‏عَنْ شُعْبَةَ غَيْرَ قَيْسِ بْنِ الرَّبِيعِ، ‏‏‏‏‏‏وَقَدْ رُوِيَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوُ هَذَا."
      },
      {
        "id": 15551,
        "hadith_number": "427",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keutamaan Solat Empat Rakaat Sebelum dan Selepas Zuhur",
        "perawi_melayu": "Umm Habibah meriwayatkan bahawa Rasulullah SAW bersabda: Sesiapa yang solat empat rakaat sebelum Zuhur dan empat rakaat selepasnya, Allah mengharamkannya daripada api neraka.",
        "english_text": "Umm Habibah narrated that: Allah's Messenger (S) said: Whoever prays four before Az-Zuhr and four after, Allah makes him prohibited for the Fire.",
        "malay_translation": "Umm Habibah meriwayatkan: Rasulullah SAW bersabda: Sesiapa yang mengerjakan solat empat rakaat sebelum Zuhur dan empat rakaat sesudahnya, Allah akan mengharamkannya daripada neraka.",
        "arabic_text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ الشُّعَيْثِيِّ، عَنْ أَبِيهِ، عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ، عَنْ أُمِّ حَبِيبَةَ، قَالَتْ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ صَلَّى قَبْلَ الظُّهْرِ أَرْبَعًا وَبَعْدَهَا أَرْبَعًا، ‏‏‏‏‏‏حَرَّمَهُ اللَّهُ عَلَى النَّارِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏وَقَدْ رُوِيَ مِنْ غَيْرِ هَذَا الْوَجْهِ."
      },
      {
        "id": 15552,
        "hadith_number": "428",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keutamaan Empat Rakaat Sebelum dan Selepas Zuhur",
        "perawi_melayu": "Umm Habibah, isteri Nabi (S)",
        "english_text": "Umm Habibah the wife of the Prophet (S) narrated that: She heard Allah's Messenger (S) saying: Whoever maintains four Rak'ah before Az-Zuhr and four after it, Allah makes him prohibited for the Fire.",
        "malay_translation": "Umm Habibah, isteri Nabi (S), meriwayatkan bahawa: Beliau mendengar Rasulullah (S) bersabda: Sesiapa yang memelihara (menunaikan) empat rakaat sebelum Zuhur dan empat rakaat selepasnya, Allah akan mengharamkannya daripada api neraka.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرٍ مُحَمَّدُ بْنُ إِسْحَاق الْبَغْدَادِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ التِّنِّيسِيُّ الشَّأْمِيُّ، حَدَّثَنَا الْهَيْثَمُ بْنُ حُمَيْدٍ، أَخْبَرَنِي الْعَلَاءُ هُوَ:‏‏‏‏ ابْنُ الْحَارِثِ، عَنْ الْقَاسِمِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ، قَال:‏‏‏‏ سَمِعْتُ أُخْتِي أُمَّ حَبِيبَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏تَقُولُ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ مَنْ حَافَظَ عَلَى أَرْبَعِ رَكَعَاتٍ قَبْلَ الظُّهْرِ وَأَرْبَعٍ بَعْدَهَا حَرَّمَهُ اللَّهُ عَلَى النَّارِ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَالْقَاسِمُ هُوَ:‏‏‏‏ ابْنُ عَبْدِ الرَّحْمَنِ يُكْنَى أَبَا عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏وَهُوَ مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ خَالِدِ بْنِ يَزِيدَ بْنِ مُعَاوِيَةَ، ‏‏‏‏‏‏وَهُوَ ثِقَةٌ شَأْمِيٌّ، ‏‏‏‏‏‏وَهُوَ صَاحِبُ أَبِي أُمَامَةَ"
      },
      {
        "id": 15553,
        "hadith_number": "429",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Solat Empat Rakaat Sebelum Asar dan Taslim",
        "perawi_melayu": "Ali meriwayatkan:",
        "english_text": "Ali narrated: Allah's Messenger (S) would pray four Rak'ah before Al-Asr separating between them with At-Taslim upon the angels that are close (to Allah) and those who follow them among the Muslims and the believers.",
        "malay_translation": "Ali meriwayatkan: Rasulullah SAW solat empat rakaat sebelum Asar, memisahkan antara mereka dengan At-Taslim kepada para malaikat yang dekat (kepada Allah) dan mereka yang mengikuti mereka di kalangan umat Islam dan orang-orang mukmin.",
        "arabic_text": "حَدَّثَنَا بُنْدَارٌ مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَامِرٍ هُوَ:‏‏‏‏ الْعَقَدِيُّ عَبْدُ الْمَلِكِ بْنُ عَمْرٍو، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاق، عَنْ عَاصِمِ بْنِ ضَمْرَةَ، عَنْ عَلِيٍّ، قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي قَبْلَ الْعَصْرِ أَرْبَعَ رَكَعَاتٍ يَفْصِلُ بَيْنَهُنَّ بِالتَّسْلِيمِ عَلَى الْمَلَائِكَةِ الْمُقَرَّبِينَ وَمَنْ تَبِعَهُمْ مِنَ الْمُسْلِمِينَ وَالْمُؤْمِنِينَ . قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب عَنْ ابْنِ عُمَرَ،‏‏‏‏ وَعَبْدِ اللَّهِ بْنِ عَمْرٍوَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ عَلِيٍّ حَدِيثٌ حَسَنٌ، ‏‏‏‏‏‏وَاخْتَارَ إِسْحَاق بْنُ إِبْرَاهِيمَ أَنْ لَا يُفْصَلَ فِي الْأَرْبَعِ قَبْلَ الْعَصْرِ وَاحْتَجَّ بِهَذَا الْحَدِيثِ، ‏‏‏‏‏‏وقَالَ إِسْحَاق:‏‏‏‏ وَمَعْنَى قَوْلِهِ أَنَّهُ يَفْصِلُ بَيْنَهُنَّ بِالتَّسْلِيمِ يَعْنِي التَّشَهُّدَ، ‏‏‏‏‏‏وَرَأَى الشافعي،‏‏‏‏ وَأَحْمَدُ صَلَاةَ اللَّيْلِ وَالنَّهَارِ مَثْنَى مَثْنَى يَخْتَارَانِ الْفَصْلَ فِي الْأَرْبَعِ قَبْلَ الْعَصْرِ."
      },
      {
        "id": 15554,
        "hadith_number": "430",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keutamaan Solat Sunat Empat Rakaat Sebelum Asar",
        "perawi_melayu": "Diriwayatkan daripada Ibn Umar",
        "english_text": "Ibn Umar narrated that : The Prophet (S) said: May Allah have mercy upon a man who prays four before Al-Asr.",
        "malay_translation": "Daripada Ibn Umar RA, bahawa Nabi SAW bersabda: Semoga Allah merahmati seseorang yang solat empat rakaat sebelum Asar.",
        "arabic_text": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى، وَمَحْمُودُ بْنُ غَيْلَانَ، وَغَيْرُ وَاحِدٍ، ‏‏‏‏‏‏وَأَحْمَدُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، قَالُوا:‏‏‏‏ حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ مُسْلِمِ بْنِ مِهْرَانَ، سَمِعَ جَدَّهُ، عَنْ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ رَحِمَ اللَّهُ امْرَأً صَلَّى قَبْلَ الْعَصْرِ أَرْبَعًا . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ حَسَنٌ."
      },
      {
        "id": 15555,
        "hadith_number": "431",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Bacaan dalam Dua Rakaat Selepas Maghrib dan Sebelum Subuh",
        "perawi_melayu": "Abdullah bin Mas'ud meriwayatkan:",
        "english_text": "Abdullah bin Mas'ud narrated: I can not enumerate (how many times) I heard Allah's Messenger (S) reciting - in the two Rak'ah after Al-Maghrib and the two Rak'ah before Salatul-Fajr with: Say: O you disbelievers! and Say: He is Allah the One.",
        "malay_translation": "Abdullah bin Mas'ud meriwayatkan: Saya tidak dapat menghitung (berapa kali) saya mendengar Rasulullah SAW membaca - dalam dua rakaat selepas Maghrib dan dua rakaat sebelum Solat Subuh dengan: Katakanlah: Wahai orang-orang kafir! dan Katakanlah: Dialah Allah Yang Maha Esa.",
        "arabic_text": "حَدَّثَنَا أَبُو مُوسَى مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا بَدَلُ بْنُ الْمُحَبَّرِ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ مَعْدَانَ، عَنْ عَاصِمِ بْنِ بَهْدَلَةَ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، أَنَّهُ قَالَ:‏‏‏‏ مَا أُحْصِي مَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الرَّكْعَتَيْنِ بَعْدَ الْمَغْرِبِ وَفِي الرَّكْعَتَيْنِ قَبْلَ صَلَاةِ الْفَجْرِ بِ:‏‏‏‏ قُلْ يَا أَيُّهَا الْكَافِرُونَ وَ قُلْ هُوَ اللَّهُ أَحَدٌ قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ ابْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ ابْنِ مَسْعُودٍ حَدِيثٌ غَرِيبٌ، ‏‏‏‏‏‏مِنْ حَدِيثِ ابْنِ مَسْعُودٍ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ عَبْدِ الْمَلِكِ بْنِ مَعْدَانَ، ‏‏‏‏‏‏عَنْ عَاصِمٍ."
      },
      {
        "id": 15556,
        "hadith_number": "432",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Solat Dua Rakaat Selepas Maghrib Bersama Nabi SAW di Rumah Baginda",
        "perawi_melayu": "Ibn Umar meriwayatkan:",
        "english_text": "Ibn Umar narrated: I prayed two Rak'ah after Al-Maghrib with the Prophet (S) in his house.",
        "malay_translation": "Ibn Umar meriwayatkan: Saya solat dua rakaat selepas Maghrib bersama Nabi SAW di rumah baginda.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا إِسْمَاعِيل بْنُ إِبْرَاهِيمَ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنْ ابْنِ عُمَرَ، قَالَ:‏‏‏‏ صَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ فِي بَيْتِهِ . قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ رَافِعِ بْنِ خَدِيجٍ،‏‏‏‏ وَكَعْبِ بْنِ عُجْرَةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 15557,
        "hadith_number": "433",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Sepuluh Rakaat Sunnah yang Dihafal dari Rasulullah SAW",
        "perawi_melayu": "Ibn Umar meriwayatkan:",
        "english_text": "Ibn Umar narrated: I memorized ten Rak'ah from Allah's Messenger (S) which he would pray in a night and a day: Two Rak'ah before Az-Zuhr, two after it; two Rak'ah after Al-Maghrib and two Rak'ah after the latter Isha. He said: And Hafsah narrated to me that he (S) would pray two Rak'ah before Al-Fajr.",
        "malay_translation": "Ibn Umar meriwayatkan: Aku menghafal sepuluh rakaat daripada Rasulullah SAW yang baginda akan solat dalam satu malam dan satu hari: Dua rakaat sebelum Az-Zuhr, dua rakaat selepasnya; dua rakaat selepas Al-Maghrib dan dua rakaat selepas Isyak. Dia berkata: Dan Hafsah meriwayatkan kepadaku bahawa baginda SAW akan solat dua rakaat sebelum Al-Fajr.",
        "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ الْخَلَّالُ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنْ ابْنِ عُمَرَ، قَالَ:‏‏‏‏ حَفِظْتُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَشْرَ رَكَعَاتٍ كَانَ يُصَلِّيهَا بِاللَّيْلِ وَالنَّهَارِ رَكْعَتَيْنِ قَبْلَ الظُّهْرِ وَرَكْعَتَيْنِ بَعْدَهَا وَرَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ وَرَكْعَتَيْنِ بَعْدَ الْعِشَاءِ الْآخِرَةِ . قَالَ:‏‏‏‏ وَحَدَّثَتْنِي حَفْصَةُ أَنَّهُ كَانَ يُصَلِّي قَبْلَ الْفَجْرِ رَكْعَتَيْنِ. هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 15558,
        "hadith_number": "434",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Riwayat yang Serupa daripada Ibn Umar",
        "perawi_melayu": "Tiada perawi dinyatakan",
        "english_text": "Ibn Umar : has a similar narration",
        "malay_translation": "Ibn Umar: mempunyai riwayat yang serupa.",
        "arabic_text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ. قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 15559,
        "hadith_number": "435",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keutamaan Solat Enam Rakaat Selepas Maghrib",
        "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda: Sesiapa yang solat enam rakaat selepas Maghrib, dan dia tidak bercakap tentang apa-apa di antara mereka, maka ia akan dikira baginya sebagai ibadah selama dua belas tahun.",
        "english_text": "Abu Hurairah narrated that: Allah's Messenger (S) said: Whoever prays six Rak'ah after Al-Maghrib, and he does not speak about anything between them, then they will be counted for him as twelve years of worship.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah SAW bersabda: Sesiapa yang solat enam rakaat selepas Maghrib, dan dia tidak bercakap tentang apa-apa di antara mereka, maka ia akan dikira baginya sebagai ibadah selama dua belas tahun.",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ يَعْنِي مُحَمَّدَ بْنَ الْعَلَاءِ الْهَمْدَانِيَّ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، حَدَّثَنَا عُمَرُ بْنُ أَبِي خَثْعَمٍ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ صَلَّى بَعْدَ الْمَغْرِبِ سِتَّ رَكَعَاتٍ لَمْ يَتَكَلَّمْ فِيمَا بَيْنَهُنَّ بِسُوءٍ عُدِلْنَ لَهُ بِعِبَادَةِ ثِنْتَيْ عَشْرَةَ سَنَةً . قَالَ أَبُو عِيسَى:‏‏‏‏ وَقَدْ رُوِيَ عَنْ عَائِشَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَنْ صَلَّى بَعْدَ الْمَغْرِبِ عِشْرِينَ رَكْعَةً بَنَى اللَّهُ لَهُ بَيْتًا فِي الْجَنَّةِ قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ زَيْدِ بْنِ الْحُبَابِ، ‏‏‏‏‏‏عَنْ عُمَرَ بْنِ أَبِي خَثْعَمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وسَمِعْت مُحَمَّدَ بْنَ إِسْمَاعِيل، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ عُمَرُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي خَثْعَمٍ مُنْكَرُ الْحَدِيثِ وَضَعَّفَهُ جِدًّا."
      },
      {
        "id": 15560,
        "hadith_number": "436",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Solat Sunat Rasulullah SAW: Sebelum dan Selepas Solat Fardhu",
        "perawi_melayu": "Abdullah bin Shaqiq",
        "english_text": "Abdullah bin Shaqiq said: I asked Aishah about the Salat of Allah's Messenger (S). She said: 'He would pray four Rak'ah before Az-Zuhr and two Rak'ah after it, and two after Al-Maghrib, and two Rak'ah after Al-Isha, and two before Al-Fajr.",
        "malay_translation": "Abdullah bin Shaqiq berkata: Aku bertanya kepada Aishah tentang solat Rasulullah SAW. Beliau berkata: 'Baginda solat empat rakaat sebelum Zohor dan dua rakaat selepasnya, dan dua rakaat selepas Maghrib, dan dua rakaat selepas Isyak, dan dua rakaat sebelum Fajr.'",
        "arabic_text": "حَدَّثَنَا أَبُو سَلَمَةَ يَحْيَى بْنُ خَلَفٍ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ، قَالَ:‏‏‏‏ سَأَلْتُ عَائِشَةَ، عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَتْ:‏‏‏‏ كَانَ يُصَلِّي قَبْلَ الظُّهْرِ رَكْعَتَيْنِ وَبَعْدَهَا رَكْعَتَيْنِ وَبَعْدَ الْمَغْرِبِ ثِنْتَيْنِ وَبَعْدَ الْعِشَاءِ رَكْعَتَيْنِ وَقَبْلَ الْفَجْرِ ثِنْتَيْنِ قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عَلِيٍّ،‏‏‏‏ وَابْنِ عُمَرَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ عَبْدِ اللَّهِ بْنِ شَقِيقٍ، ‏‏‏‏‏‏عَنْ عَائِشَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 15561,
        "hadith_number": "437",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Solat Malam Dua Rakaat Dua Rakaat dan Witir di Akhir Solat",
        "perawi_melayu": "Diriwayatkan daripada Ibn Umar RA bahawa:",
        "english_text": "Ibn Umar narrated that: The Prophet (S) said: Salat in the night is two by two. So when you fear the dawn (is near) then make it odd by one, and make that the last of your Salat odd.",
        "malay_translation": "Rasulullah SAW bersabda: Solat malam (dilakukan) dua rakaat dua rakaat. Apabila kamu khuatir akanSubuh (hampir tiba), maka jadikanlah ia ganjil dengan satu rakaat, dan jadikanlah witir itu sebagai penutup solatmu.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنْ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏أَنَّهُ قَالَ:‏‏‏‏ صَلَاةُ اللَّيْلِ مَثْنَى مَثْنَى فَإِذَا خِفْتَ الصُّبْحَ فَأَوْتِرْ بِوَاحِدَةٍ وَاجْعَلْ آخِرَ صَلَاتِكَ وِتْرًا . قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب عَنْ عَمْرِو بْنِ عَبَسَةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ أَنَّ صَلَاةَ اللَّيْلِ مَثْنَى مَثْنَى، ‏‏‏‏‏‏وَهُوَ قَوْلُ:‏‏‏‏ سفيان الثوري،‏‏‏‏ وَابْنِ الْمُبَارَكِ،‏‏‏‏ وَالشَّافِعِيِّ،‏‏‏‏ وَأَحْمَدَ،‏‏‏‏ وَإِسْحَاقَ."
      },
      {
        "id": 15562,
        "hadith_number": "438",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keutamaan Puasa Muharram dan Solat Malam",
        "perawi_melayu": "Abu Hurairah meriwayatkan bahawa: Rasulullah (SAW) bersabda: Puasa yang paling utama setelah bulan Ramadan adalah puasa di bulan Allah, Al-Muharram. Dan solat yang paling utama setelah solat fardhu adalah solat malam.",
        "english_text": "Abu Hurairah narrated that: Allah's Messenger (S) said: The most virtuous fasting after the month of Ramadan is that of Allah's month of Al-Muharram. And the most virtuous Salat after the obligatory is the night prayer.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa: Rasulullah (SAW) bersabda: Puasa yang paling utama setelah bulan Ramadan adalah puasa di bulan Allah, Al-Muharram. Dan solat yang paling utama setelah solat fardhu adalah solat malam.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ الْحِمْيَرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَفْضَلُ الصِّيَامِ بَعْدَ شَهْرِ رَمَضَانَ شَهْرُ اللَّهِ الْمُحَرَّمُ وَأَفْضَلُ الصَّلَاةِ بَعْدَ الْفَرِيضَةِ صَلَاةُ اللَّيْلِ قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ جَابِرٍ،‏‏‏‏ وَبِلَالٍ،‏‏‏‏ وَأَبِي أُمَامَةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ. قَالَ أَبُو عِيسَى:‏‏‏‏ وَأَبُو بِشْرٍ اسْمُهُ:‏‏‏‏ جَعْفَرُ بْنُ أَبِي وَحْشِيَّةَ وَاسْمُ أَبِي وَحْشِيَّةَ:‏‏‏‏ إِيَاسٌ."
      },
      {
        "id": 15563,
        "hadith_number": "439",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Solat Malam Rasulullah SAW di Bulan Ramadan dan Luar Ramadan",
        "perawi_melayu": "Sa'eed bin Abi Sa'eed Al-Maqburi meriwayatkan bahawa Abu Salamah memaklumkan kepadanya bahawa dia telah bertanya kepada Aishah: Bagaimanakah solat Rasulullah SAW [pada waktu malam] semasa Ramadan? Dia berkata: Rasulullah SAW solat - tidak di bulan Ramadan mahupun di bulan lain - lebih daripada sebelas rakaat. Baginda solat empat rakaat, dan jangan tanya tentang kehebatan atau panjangnya, kemudian baginda solat empat rakaat, dan jangan tanya tentang kehebatan atau panjangnya, kemudian baginda solat tiga rakaat. Aishah berkata: Saya bertanya: 'Wahai Rasulullah! Adakah anda tidur sebelum melakukan Witr?' Baginda menjawab: 'Wahai Aishah! Sesungguhnya mataku tidur tetapi hatiku tidak tidur.'",
        "english_text": "Sa'eed bin Abi Sa'eed Al-Maqburi narrated that: Sa'eed bin Abi Sa'eed Al-Maqburi narrated that Abu Salamah informed him that he had asked Aishah: How was the Salat of Allah's Messenger (A) [at night] during Ramadan? She said: Allah's Messenger (S) would pray - neither in Ramadan nor in any other month - more than eleven Rak'ah. He would pray four, and do not ask about their excellence or length, then he would pray four, and do not ask about their excellence or length, then he would pray three. Aishah said: I asked: 'O Messenger of Allah! Do you sleep before having performed Witr? He said: 'O Aishah! Indeed my eyes sleep but my heart does not sleep.'",
        "malay_translation": "Sa'eed bin Abi Sa'eed Al-Maqburi meriwayatkan: Sa'eed bin Abi Sa'eed Al-Maqburi meriwayatkan bahawa Abu Salamah memaklumkan kepadanya bahawa dia telah bertanya kepada Aishah: Bagaimanakah solat Rasulullah SAW [pada waktu malam] semasa Ramadan? Dia berkata: Rasulullah SAW akan solat - tidak di bulan Ramadan mahupun di bulan lain - lebih daripada sebelas rakaat. Baginda akan solat empat rakaat, dan jangan tanya tentang kehebatan atau panjangnya, kemudian baginda akan solat empat rakaat, dan jangan tanya tentang kehebatan atau panjangnya, kemudian baginda akan solat tiga rakaat. Aishah berkata: Saya bertanya: 'Wahai Rasulullah! Adakah anda tidur sebelum melakukan Witr?' Baginda menjawab: 'Wahai Aishah! Sesungguhnya mataku tidur tetapi hatiku tidak tidur.'",
        "arabic_text": "حَدَّثَنَا إِسْحَاق بْنُ مُوسَى الْأَنْصَارِيُّ، حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكٌ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي سَلَمَةَ أَنَّهُ أَخْبَرَهُ، ‏‏‏‏‏‏أَنَّهُ سَأَلَ عَائِشَةَ:‏‏‏‏ كَيْفَ كَانَتْ صَلَاةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِاللَّيْلِ فِي رَمَضَانَ ؟ فَقَالَتْ:‏‏‏‏ مَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَزِيدُ فِي رَمَضَانَ وَلَا فِي غَيْرِهِ عَلَى إِحْدَى عَشْرَةَ رَكْعَةً، ‏‏‏‏‏‏يُصَلِّي أَرْبَعًا فَلَا تَسْأَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ، ‏‏‏‏‏‏ثُمَّ يُصَلِّي أَرْبَعًا فَلَا تَسْأَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ، ‏‏‏‏‏‏ثُمَّ يُصَلِّي ثَلَاثًا فَقَالَتْ عَائِشَةُ:‏‏‏‏ فَقُلْتُ:‏‏‏‏ يَا رَسُولَ اللَّهِ أَتَنَامُ قَبْلَ أَنْ تُوتِرَ ؟ فَقَالَ:‏‏‏‏ يَا عَائِشَةُ إِنَّ عَيْنَيَّ تَنَامَانِ وَلَا يَنَامُ قَلْبِي . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 15564,
        "hadith_number": "440",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Rasulullah SAW Solat Malam Sebelas Rakaat",
        "perawi_melayu": "Aishah meriwayatkan:",
        "english_text": "Aishah narrated: Allah's Messenger (S) would pray eleven Rak'ah at night, making them off with one. When he finished them he would lay down on his right side.",
        "malay_translation": "Aishah meriwayatkan: Rasulullah SAW solat sebelas rakaat pada waktu malam, mengakhirinya dengan satu rakaat (Witir). Apabila baginda selesai, baginda akan berbaring di sisi kanan baginda.",
        "arabic_text": "حَدَّثَنَا إِسْحَاق بْنُ مُوسَى الْأَنْصَارِيُّ، حَدَّثَنَا مَعْنُ بْنُ عِيسَى، حَدَّثَنَا مَالِكٌ، عَنْ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي مِنَ اللَّيْلِ إِحْدَى عَشْرَةَ رَكْعَةً، ‏‏‏‏‏‏يُوتِرُ مِنْهَا بِوَاحِدَةٍ، ‏‏‏‏‏‏فَإِذَا فَرَغَ مِنْهَا اضْطَجَعَ عَلَى شِقِّهِ الْأَيْمَنِ"
      },
      {
        "id": 15565,
        "hadith_number": "441",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Sanad Lain dengan Riwayat Serupa",
        "perawi_melayu": "Tidak dinyatakan perawi: Sanad lain dengan riwayat yang serupa.",
        "english_text": "Narrator mot mentioned: Another chain with similar narration",
        "malay_translation": "Tidak dinyatakan perawi: Rantaian lain dengan riwayat yang serupa.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ ابْنِ شِهَابٍ نَحْوَهُ. قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 15566,
        "hadith_number": "442",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Bilangan Rakaat Solat Malam Nabi Muhammad SAW",
        "perawi_melayu": "Diriwayatkan oleh Ibn Abbas",
        "english_text": "Ibn Abbas narrated: The Prophet (S) would pray thirteen Rak'ah at night.",
        "malay_translation": "Ibn Abbas meriwayatkan: Nabi SAW biasanya solat tiga belas rakaat pada waktu malam.",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، قَالَ:‏‏‏‏ حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنْ أَبِي جَمْرَةَ الضُّبَعِيُّ، عَنْ ابْنِ عَبَّاسٍ، قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مِنَ اللَّيْلِ ثَلَاثَ عَشْرَةَ رَكْعَةً قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَأَبُو جَمْرَةَ الضُّبَعِيُّ اسْمُهُ:‏‏‏‏ نَصْرُ بْنُ عِمْرَانَ الضُّبَعِيُّ."
      },
      {
        "id": 15567,
        "hadith_number": "443",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Rasulullah S.A.W. Solat Sembilan Rakaat pada Waktu Malam",
        "perawi_melayu": "Aishah meriwayatkan:",
        "english_text": "Aishah narrated: The Prophet (S) would pray nine Rak'ah in the night.",
        "malay_translation": "Aishah meriwayatkan: Nabi Muhammad S.A.W. solat sembilan Rakaat pada waktu malam.",
        "arabic_text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو الْأَحْوَصِ، عَنْ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ الْأَسْوَدِ بْنِ يَزِيدَ، عَنْ عَائِشَةَ، قَالَتْ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مِنَ اللَّيْلِ تِسْعَ رَكَعَاتٍ قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ،‏‏‏‏ وَزَيْدِ بْنِ خَالِدٍ،‏‏‏‏ وَالْفَضْلِ بْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ عَائِشَةَ حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ،‏‏‏‏"
      },
      {
        "id": 15568,
        "hadith_number": "444",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Rantaian Sanad yang Serupa",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Narrator not mentioned: (Another chain with similar narration)",
        "malay_translation": "Perawi tidak dinyatakan: (Rantaian sanad lain dengan riwayat yang serupa)",
        "arabic_text": "وَرَوَاهُ سفيان الثوري، ‏‏‏‏‏‏عَنْ الْأَعْمَشِ نَحْوَ هَذَا، ‏‏‏‏‏‏حَدَّثَنَا بِذَلِكَ مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ سُفْيَانَ، عَنْ الْأَعْمَشِ، قَالَ أَبُو عِيسَى:‏‏‏‏ وَأَكْثَرُ مَا رُوِي عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَلَاةِ اللَّيْلِ ثَلَاثَ عَشْرَةَ رَكْعَةً مَعَ الْوِتْرِ، ‏‏‏‏‏‏وَأَقَلُّ مَا وُصِفَ مِنْ صَلَاتِهِ بِاللَّيْلِ تِسْعُ رَكَعَاتٍ ."
      },
      {
        "id": 15569,
        "hadith_number": "445",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Mengqadha' Solat Malam dengan Dua Belas Rakaat pada Siang Hari",
        "perawi_melayu": "Aisyah meriwayatkan:",
        "english_text": "Aishah narrated: When the Prophet (S) did not pray at night because he was prevented from it by sleep or being sleepy then he would pray twelve Rak'ah during the daytime.",
        "malay_translation": "Aisyah meriwayatkan: Apabila Nabi (SAW) tidak solat malam kerana terhalang oleh tidur atau mengantuk, maka Baginda akan solat dua belas rakaat pada siang hari.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ سَعْدِ بْنِ هِشَامٍ، عَنْ عَائِشَةَ، قَالَتْ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا لَمْ يُصَلِّ مِنَ اللَّيْلِ مَنَعَهُ مِنْ ذَلِكَ النَّوْمُ أَوْ غَلَبَتْهُ عَيْنَاهُ صَلَّى مِنَ النَّهَارِ ثِنْتَيْ عَشْرَةَ رَكْعَةً قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ. قَالَ أَبُو عِيسَى:‏‏‏‏ وسَعْدُ بْنُ هِشَامٍ هُوَ:‏‏‏‏ ابْنُ عَامِرٍ الْأَنْصَارِيُّ، ‏‏‏‏‏‏وَهِشَامُ بْنُ عَامِرٍ هُوَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏حَدَّثَنَا عَبَّاسٌ هُوَ ابْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عَتَّابُ بْنُ الْمُثَنَّى، ‏‏‏‏‏‏عَنْ بَهْزِ بْنِ حَكِيمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ زُرَارَةُ بْنُ أَوْفَى قَاضِيَ الْبَصْرَةِ، ‏‏‏‏‏‏وَكَانَ يَؤُمُّ فِي بَنِي قُشَيْرٍ، ‏‏‏‏‏‏فَقَرَأَ يَوْمًا فِي صَلَاةِ الصُّبْحِ، ‏‏‏‏‏‏ فَإِذَا نُقِرَ فِي النَّاقُورِ فَذَلِكَ يَوْمَئِذٍ يَوْمٌ عَسِيرٌ خَرَّ مَيِّتًا، ‏‏‏‏‏‏فَكُنْتُ فِيمَنِ احْتَمَلَهُ إِلَى دَارِهِ ."
      },
      {
        "id": 15570,
        "hadith_number": "446",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Allah Turun ke Langit Dunia pada Sepertiga Malam Terakhir",
        "perawi_melayu": "Abu Hurairah meriwayatkan bahawa Rasulullah (SAW) bersabda",
        "english_text": "Abu Hurairah narrated that: Allah's Messenger (S) said: Allah, Blessed and Exalted is He, descends to the earth's heaven every night when the first third of the night has passed. He says: I am the Sovereign. Is there any who calls upon Me so that I may respond to him? Is there any who asks of Me that I may give him? Is there any who seeks forgiveness from Me so that I may forgive him?' He continues in that until the illumination of Al-Fajr.",
        "malay_translation": "Abu Hurairah meriwayatkan bahawa Rasulullah (SAW) bersabda: Allah, Maha Berkat dan Maha Tinggi, turun ke langit dunia setiap malam apabila sepertiga malam pertama telah berlalu. Dia berfirman: 'Akulah Penguasa. Adakah sesiapa yang menyeru-Ku agar Aku dapat memperkenankan permintaannya? Adakah sesiapa yang meminta daripada-Ku agar Aku dapat memberikannya? Adakah sesiapa yang memohon ampun daripada-Ku agar Aku dapat mengampuninya?' Dia berterusan demikian sehingga terangnya Al-Fajr.",
        "arabic_text": "حَدَّثَنَا حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ الْإِسْكَنْدَرَانِيُّ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ يَنْزِلُ اللَّهُ إِلَى السَّمَاءِ الدُّنْيَا كُلَّ لَيْلَةٍ حِينَ يَمْضِي ثُلُثُ اللَّيْلِ الْأَوَّلُ فَيَقُولُ:‏‏‏‏ أَنَا الْمَلِكُ مَنْ ذَا الَّذِي يَدْعُونِي فَأَسْتَجِيبَ لَهُ مَنْ ذَا الَّذِي يَسْأَلُنِي فَأُعْطِيَهُ مَنْ ذَا الَّذِي يَسْتَغْفِرُنِي فَأَغْفِرَ لَهُ فَلَا يَزَالُ كَذَلِكَ حَتَّى يُضِيءَ الْفَجْرُ قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ،‏‏‏‏ وَأَبِي سَعِيدٍ،‏‏‏‏ وَرِفَاعَةَ الْجُهَنِيِّ،‏‏‏‏ وَجُبَيْرِ بْنِ مُطْعِمٍ،‏‏‏‏ وَابْنِ مَسْعُودٍ،‏‏‏‏ وَأَبِي الدَّرْدَاءِ،‏‏‏‏ وَعُثْمَانَ بْنِ أَبِي الْعَاصِ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ أَوْجُهٍ كَثِيرَةٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَرُوِيَ عَنْهُ، ‏‏‏‏‏‏أَنَّهُ قَالَ:‏‏‏‏ يَنْزِلُ اللَّهُ عَزَّ وَجَلَّ حِينَ يَبْقَى ثُلُثُ اللَّيْلِ الْآخِرُ وَهُوَ أَصَحُّ الرِّوَايَاتِ."
      },
      {
        "id": 15571,
        "hadith_number": "447",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Arahan Nabi SAW Mengenai Bacaan Al-Quran dengan Suara Perlahan dan Kuat",
        "perawi_melayu": "Abu Qatadah meriwayatkan bahawa:",
        "english_text": "Abu Qatadah narrated that : The Prophet (S) said to Abu Bakr: I passed by you while you were reciting and your voice was low. He said: I let He who, I was consulting hear. He said: Raise your voice. Then he said to Umar: I passed by while you were reciting and your voice was loud. So he said: I repel drowsiness and keep Ash-Shaitan away. So he said: Lower your voice.",
        "malay_translation": "Abu Qatadah meriwayatkan bahawa: Nabi SAW bersabda kepada Abu Bakr: Aku lalu di hadapanmu ketika kamu sedang membaca (Al-Quran) dan suaramu rendah. Beliau berkata: Aku membiarkan Dia yang aku bermunajat kepada-Nya mendengar. Baginda bersabda: Tinggikan suaramu. Kemudian baginda bersabda kepada Umar: Aku lalu di hadapanmu ketika kamu sedang membaca (Al-Quran) dan suaramu kuat. Maka beliau berkata: Aku mengusir rasa mengantuk dan menjauhkan Ash-Shaitan. Maka baginda bersabda: Rendahkan suaramu.",
        "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا يَحْيَى بْنُ إِسْحَاق هُوَ السَّالَحِينِيُّ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ الْأَنْصَارِيِّ، عَنْ أَبِي قَتَادَةَ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأَبِي بَكْرٍ:‏‏‏‏ مَرَرْتُ بِكَ وَأَنْتَ تَقْرَأُ وَأَنْتَ تَخْفِضُ مِنْ صَوْتِكَ فَقَالَ:‏‏‏‏ إِنِّي أَسْمَعْتُ مَنْ نَاجَيْتُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ ارْفَعْ قَلِيلًا ، ‏‏‏‏‏‏وَقَالَ لِعُمَرَ:‏‏‏‏ مَرَرْتُ بِكَ وَأَنْتَ تَقْرَأُ وَأَنْتَ تَرْفَعُ صَوْتَكَ قَالَ:‏‏‏‏ إِنِّي أُوقِظُ الْوَسْنَانَ وَأَطْرُدُ الشَّيْطَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ اخْفِضْ قَلِيلًا قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عَائِشَةَ، ‏‏‏‏‏‏وَأُمِّ هَانِئٍ، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏وأُمِّ سَلَمَةَ، ‏‏‏‏‏‏وابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ، ‏‏‏‏‏‏وَإِنَّمَا أَسْنَدَهُ يَحْيَى بْنُ إِسْحَاق، ‏‏‏‏‏‏عَنْ حَمَّادِ بْنِ سَلَمَةَ، ‏‏‏‏‏‏وَأَكْثَرُ النَّاسِ إِنَّمَا رَوَوْا هَذَا الْحَدِيثَ، ‏‏‏‏‏‏عَنْ ثَابِتٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ مُرْسَلًا."
      },
      {
        "id": 15572,
        "hadith_number": "448",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Nabi ﷺ Berdiri (dalam solat) dengan Satu Ayat dari Al-Qur'an pada Waktu Malam",
        "perawi_melayu": "Aishah meriwayatkan:",
        "english_text": "Aishah narrated: The Prophet (S) stood (in prayer) with an Ayah from the Qur'an at night",
        "malay_translation": "Aishah meriwayatkan: Nabi ﷺ berdiri (dalam solat) dengan membaca satu Ayat dari Al-Qur'an pada waktu malam.",
        "arabic_text": "حَدَّثَنَا أَبُو بَكْرٍ مُحَمَّدُ بْنُ نَافِعٍ الْبَصْرِيُّ، حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، عَنْ إِسْمَاعِيل بْنِ مُسْلِمٍ الْعَبْدِيِّ، عَنْ أَبِي الْمُتَوَكِّلِ النَّاجِيِّ، عَنْ عَائِشَةَ، قَالَتْ:‏‏‏‏ قَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِآيَةٍ مِنَ الْقُرْآنِ لَيْلَةً . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ."
      },
      {
        "id": 15573,
        "hadith_number": "449",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Cara Rasulullah SAW Membaca Al-Quran di Malam Hari",
        "perawi_melayu": "Abdullah bin Abi Qais",
        "english_text": "Abdullah bin Abi Qais narrated: I asked Aishah how the recitation of the Prophet (S) was at night. [Would he recite silently o audibly?] So she said: 'He would do both of those. Sometimes he was silent with his recitation and sometimes it was audible.' So I said: 'All praise is due to Allah, the One who made the matter broad.'",
        "malay_translation": "Abdullah bin Abi Qais meriwayatkan: Aku bertanya kepada Aisyah bagaimana bacaan Al-Quran Nabi SAW pada waktu malam. [Adakah baginda membaca secara perlahan atau kuat?] Maka Aisyah menjawab: 'Baginda melakukan kedua-duanya. Kadang-kadang baginda membaca secara perlahan dan kadang-kadang bacaannya kedengaran.' Maka aku berkata: 'Segala puji bagi Allah, yang menjadikan perkara ini luas (tidak sempit).'",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَيْسٍ، قَالَ:‏‏‏‏ سَأَلْتُ عَائِشَةَ كَيْفَ كَانَتْ قِرَاءَةُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِاللَّيْلِ، ‏‏‏‏‏‏أَكَانَ يُسِرُّ بِالْقِرَاءَةِ أَمْ يَجْهَرُ ؟ فَقَالَتْ:‏‏‏‏ كُلُّ ذَلِكَ قَدْ كَانَ يَفْعَلُ رُبَّمَا أَسَرَّ بِالْقِرَاءَةِ وَرُبَّمَا جَهَرَ فَقُلْتُ:‏‏‏‏ الْحَمْدُ لِلَّهِ الَّذِي جَعَلَ فِي الْأَمْرِ سَعَةً. قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ."
      },
      {
        "id": 15574,
        "hadith_number": "450",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Solat Sunat Terbaik di Rumah Kecuali yang Wajib",
        "perawi_melayu": "Zaid bin Thabit meriwayatkan bahawa:",
        "english_text": "Zaid bin Thabit narrated that: The Prophet (S) said: The most virtuous prayer of yours is in your homes, except for the obligatory.",
        "malay_translation": "Zaid bin Thabit meriwayatkan bahawa: Nabi (SAW) bersabda: Solat kamu yang paling utama adalah di rumah kamu, kecuali yang wajib.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدِ بْنِ أَبِي هِنْدٍ، عَنْ سَالِمٍ أَبِي النَّضْرِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ زَيْدِ بْنِ ثَابِتٍ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَفْضَلُ صَلَاتِكُمْ فِي بُيُوتِكُمْ إِلَّا الْمَكْتُوبَةَ قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عُمَرَ بْنِ الْخَطَّابِ،‏‏‏‏ وَجَابِرِ بْنِ عَبْدِ اللَّهِ،‏‏‏‏ وَأَبِي سَعِيدٍ،‏‏‏‏ وَأَبِي هُرَيْرَةَ،‏‏‏‏ وَابْنِ عُمَرَ،‏‏‏‏ وَعَائِشَةَ،‏‏‏‏ وَعَبْدِ اللَّهِ بْنِ سَعْدٍ،‏‏‏‏ وَزَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ زَيْدِ بْنِ ثَابِتٍ حَدِيثٌ حَسَنٌ، ‏‏‏‏‏‏وَقَدِ اخْتَلَفَ النَّاسُ فِي رِوَايَةِ هَذَا الْحَدِيثِ، ‏‏‏‏‏‏فَرَوَى مُوسَى بْنُ عُقْبَةَ،‏‏‏‏ وَإِبْرَاهِيمُ بْنُ أَبِي النَّضْرِ، عَنْ أَبِي النَّضْرِ مَرْفُوعًا وَرَوَاهُ مَالِكُ بْنُ أَنَسٍ، ‏‏‏‏‏‏عَنْ أَبِي النَّضْرِ وَلَمْ يَرْفَعْهُ وَأَوْقَفَهُ بَعْضُهُمْ وَالْحَدِيثُ الْمَرْفُوعُ أَصَحُّ."
      },
      {
        "id": 15575,
        "hadith_number": "451",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Solat Sunat di Rumah dan Larangan Menjadikannya Seperti Kubur",
        "perawi_melayu": "Diriwayatkan daripada Ibn Umar bahawa:",
        "english_text": "Ibn Umar narrated that : The Prophet (S) said: Offer Salat in your homes and do not turn them into graves.",
        "malay_translation": "Ibn Umar meriwayatkan bahawa: Nabi (SAW) bersabda: Lakukanlah solat (sunat) di rumah-rumah kamu dan janganlah menjadikannya seperti kubur.",
        "arabic_text": "حَدَّثَنَا إِسْحَاق بْنُ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنْ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ صَلُّوا فِي بُيُوتِكُمْ وَلَا تَتَّخِذُوهَا قُبُورًا . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      }
    ]
  }
}