{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "total": 50,
    "data": [
      {
        "id": 16794,
        "hadith_number": "1670",
        "status": "sahih",
        "nama_buku": "Jami' al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Pengecualian bagi Mukmin yang Berkeuzuran daripada Berjihad",
        "perawi_melayu": "Al-Bara' bin 'Azib",
        "english_text": "Narrated Al-Bara' bin 'Azib: That the Messenger of Allah (ﷺ) said: Bring me a shoulder blade or tablet. Then he wrote: Not equal are those of believers who sit. 'Amr bin Umm Maktum who was behind him said: Is there an exemption for me? So the following was revealed: Except those who are disabled. There are narrations on this topic from Ibn 'Abbas, Jabir and Zaid bin Thabit. This Hadith is Hasan Sahih and it is a Hadith that is Gharib from the narration of Sulaiman At-Taimi from Abu Ishaq. And Shu'bah and Ath-Thawri reported this Hadith from Abu Ishaq.",
        "malay_translation": "Diriwayatkan daripada Al-Bara' bin 'Azib: Bahawa Rasulullah (ﷺ) bersabda: “Bawakan kepadaku tulang belikat atau loh.” Kemudian baginda menulis: “Tidak sama orang-orang mukmin yang duduk (tidak berjihad).” ‘Amr bin Umm Maktum yang berada di belakang baginda berkata: “Adakah pengecualian untukku?” Maka wahyu berikut diturunkan: “Kecuali mereka yang berkeuzuran (cacat).” Terdapat riwayat mengenai topik ini daripada Ibn 'Abbas, Jabir dan Zaid bin Thabit. Hadis ini Hasan Sahih dan ia adalah Hadis Gharib daripada riwayat Sulaiman At-Taimi daripada Abu Ishaq. Dan Shu'bah dan Ath-Thawri meriwayatkan Hadis ini daripada Abu Ishaq.",
        "arabic_text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، عَنْ أَبِيهِ، عَنْ أَبِي إِسْحَاق، عَنْ الْبَرَاءِ بْنِ عَازِبٍ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ ائْتُونِي بِالْكَتِفِ أَوِ اللَّوْحِ، ‏‏‏‏‏‏فَكَتَبَ:‏‏‏‏ لا يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ سورة النساء آية 95 ، ‏‏‏‏‏‏وَعَمْرُو بْنُ أُمِّ مَكْتُومٍ خَلْفَ ظَهْرِهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ هَلْ لِي مِنْ رُخْصَةٍ ؟ فَنَزَلَتْ:‏‏‏‏ غَيْرُ أُولِي الضَّرَرِ سورة النساء آية 95، ‏‏‏‏‏‏وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَجَابِرٍ، ‏‏‏‏‏‏وَزَيْدِ بْنِ ثَابِتٍ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَهُوَ حَدِيثٌ غَرِيبٌ مِنْ حَدِيثِ سُلَيْمَانَ التَّيْمِيِّ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏وَقَدْ رَوَى شُعْبَةُ، وَالثَّوْرِيُّ، عَنْ أَبِي إِسْحَاق، هَذَا الْحَدِيثَ."
      },
      {
        "id": 16795,
        "hadith_number": "1671",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keutamaan Berjihad untuk Ibu Bapa",
        "perawi_melayu": "Tidak Diriwayatkan",
        "english_text": "Narrated 'Abdullah bin 'Umar: A man came to Prophet (ﷺ) seeking permission to go for Jihad. So he said: 'Do you have parents (living)? ' He said: 'Yes.' He said: 'Then it is for them that you should perform Jihad.' [Abu 'Eisa said:] There is something on this topic from Ibn 'Abbas. This Hadith is Hasan Sahih. (One of the narrators) Abul-Abbas is the blind (Al-A'ma) poet (Ash-Sha'ir), from Makkah, and his name is As-Sa'ab bin Farrukh.",
        "malay_translation": "Diriwayatkan daripada 'Abdullah bin 'Umar: Seorang lelaki datang kepada Nabi (ﷺ) meminta izin untuk pergi berjihad. Baginda bersabda: 'Adakah kamu mempunyai ibu bapa (yang masih hidup)?' Lelaki itu menjawab: 'Ya.' Baginda bersabda: 'Maka kepada mereka berdua lah kamu berjihad.' [Abu 'Eisa berkata:] Terdapat riwayat lain mengenai topik ini daripada Ibn 'Abbas. Hadis ini Hasan Sahih. (Salah seorang perawi) Abul-Abbas adalah penyair yang buta (Al-A'ma) (Ash-Sha'ir), dari Makkah, dan namanya ialah As-Sa'ab bin Farrukh.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، وَشُعْبَةَ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ أَبِي الْعَبَّاسِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ:‏‏‏‏ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَأْذِنُهُ فِي الْجِهَادِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَلَكَ وَالِدَانِ ؟ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَفِيهِمَا فَجَاهِدْ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَأَبُو الْعَبَّاسِ هُوَ الشَّاعِرُ الْأَعْمَى الْمَكِّيُّ وَاسْمُهُ:‏‏‏‏ السَّائِبُ بْنُ فَرُّوخَ."
      },
      {
        "id": 16796,
        "hadith_number": "1672",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Ketaatan kepada Allah, Rasul dan Pemimpin",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Narrated Al-Hajjaj bin Muhammad: That Ibn Juraij commented on Allah's saying: Obey Allah and obey the Messenger, and those in authority among you. He said: Abdullah bin Hudhafah bin Qais bin 'Adi As-Sahmi was sent by the Messenger of Allah (ﷺ) over a military expedition. I was informed of that by Ya'la bin Muslim, from Sa'eed bin Jubair, from Ibn 'Abbas. [Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. We do not know if it except as a narration of Ibn Juraij.",
        "malay_translation": "Diriwayatkan oleh Al-Hajjaj bin Muhammad: Bahawa Ibn Juraij mengulas mengenai firman Allah: Taatilah Allah dan taatilah Rasul, dan mereka yang berkuasa di antara kamu. Beliau berkata: Abdullah bin Hudhafah bin Qais bin 'Adi As-Sahmi telah dihantar oleh Rasulullah (ﷺ) dalam ekspedisi ketenteraan. Saya dimaklumkan tentang itu oleh Ya'la bin Muslim, daripada Sa'eed bin Jubair, daripada Ibn 'Abbas. [Abu 'Eisa berkata:] Hadith ini adalah Hasan Sahih Gharib. Kami tidak mengetahui tentangnya kecuali sebagai riwayat daripada Ibn Juraij.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى النَّيْسَابُورِيُّ، حَدَّثَنَا الْحَجَّاجُ بْنُ مُحَمَّدٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ فِي قَوْلِهِ:‏‏‏‏ أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الأَمْرِ مِنْكُمْ سورة النساء آية 59، ‏‏‏‏‏‏قَالَ:‏‏‏‏ عَبْدُ اللَّهِ بْنُ حُذَافَةَ بْنِ قَيْسِ بْنِ عَدِيٍّ السَّهْمِيُّ:‏‏‏‏ بَعَثَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى سَرِيَّةٍ، ‏‏‏‏‏‏أَخْبَرَنِيهِ يَعْلَى بْنُ مُسْلِمٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ ابْنِ عَبَّاسٍ، قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ ابْنِ جُرَيْجٍ."
      },
      {
        "id": 16797,
        "hadith_number": "1673",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Larangan Mengembara Sendirian pada Waktu Malam Kerana Bahaya yang Tidak Diketahui",
        "perawi_melayu": "Ibn 'Umar",
        "english_text": "Narrated Ibn 'Umar: That the Messenger of Allah (ﷺ) said: If the people knew what I know about being alone, then a rider would not journey at night. - meaning alone.",
        "malay_translation": "Diriwayatkan daripada Ibn 'Umar: Bahawa Rasulullah (ﷺ) bersabda: Jika orang ramai tahu apa yang aku tahu tentang bersendirian, maka seorang penunggang tidak akan bermusafir pada waktu malam - bermaksud bersendirian.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ الْبَصْرِيُّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَاصِمِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ ابْنِ عُمَرَ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَوْ أَنَّ النَّاسَ يَعْلَمُونَ مَا أَعْلَمُ مِنَ الْوِحْدَةِ، ‏‏‏‏‏‏مَا سَرَى رَاكِبٌ بِلَيْلٍ ، ‏‏‏‏‏‏يَعْنِي:‏‏‏‏ وَحْدَهُ."
      },
      {
        "id": 16798,
        "hadith_number": "1674",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Musafir Bersendirian dan Rombongan",
        "perawi_melayu": "'Amr bin Shu'aib, daripada bapanya, daripada datuknya",
        "english_text": "Narrated 'Amr bin Shu'aib: From his father, from his grandfather that the Messenger of Allah (ﷺ) said: The (lone) rider is a Shaitan, and two raiders are two Shaitan. Three is a travelling party. [Abu 'Eisa said:] The Hadith of Ibn 'Umar (no, 1673) is Hasan Sahih. We do not know of it except from this route ; as a narration of 'Asim. And he is Ibn Muhammad bin Zaid bin 'Abdullah bin 'Umar. Muhammad said: He is trustworthy, truthful. And 'Asim bin 'Umar Al-'Umari is weak in Hadith, I do not report anything from him. The Hadith of 'Abdullah bin 'Amr (no. 1674) is better.",
        "malay_translation": "Diriwayatkan daripada 'Amr bin Shu'aib, daripada bapanya, daripada datuknya bahawa Rasulullah (ﷺ) bersabda: \"Penunggang (bersendirian) adalah syaitan, dan dua orang penunggang adalah dua syaitan. Tiga orang adalah rombongan bermusafir.\" [Abu 'Eisa berkata:] Hadith Ibn 'Umar (no. 1673) adalah Hasan Sahih. Kami tidak mengetahuinya melainkan daripada jalan ini; sebagai riwayat daripada 'Asim. Dan dia ialah Ibn Muhammad bin Zaid bin 'Abdullah bin 'Umar. Muhammad berkata: Dia dipercayai, benar. Dan 'Asim bin 'Umar Al-'Umari adalah lemah dalam Hadith, saya tidak meriwayatkan apa-apa daripadanya. Hadith 'Abdullah bin 'Amr (no. 1674) adalah lebih baik.",
        "arabic_text": "حَدَّثَنَا إِسْحَاق بْنُ مُوسَى الْأَنْصَارِيُّ، حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَرْمَلَةَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ الرَّاكِبُ شَيْطَانٌ، ‏‏‏‏‏‏وَالرَّاكِبَانِ شَيْطَانَانِ، ‏‏‏‏‏‏وَالثَّلَاثَةُ رَكْبٌ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ عَاصِمٍ وَهُوَ ابْنُ مُحَمَّدِ بْنِ زَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، ‏‏‏‏‏‏وَحَدِيثُ عَبْدِ اللَّهِ بْنِ عَمْرٍو حَدِيثٌ حَسَنٌ، ‏‏‏‏‏‏قَالَ مُحَمَّدٌ:‏‏‏‏ هُوَ ثِقَةٌ صَدُوقٌ، ‏‏‏‏‏‏وَعَاصِمُ بْنُ عُمَرَ الْعُمَرِيُّ ضَعِيفٌ فِي الْحَدِيثِ لَا أَرْوِي عَنْهُ شَيْئًا."
      },
      {
        "id": 16799,
        "hadith_number": "1675",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Peperangan adalah Tipu Daya",
        "perawi_melayu": "Jabir bin ‘Abdullah",
        "english_text": "Narrated Jabir bin ‘Abdullah : That the Messenger of Allah (ﷺ) said: War is deceit. [Abu 'Eisa said:] There are narrations on this topic from 'Ali, Zaid bin Thabit, 'Aishah, Ibn 'Abbas, Abu Hurairah, Asma' bint Yazid bin As-Sakan, Ka'b bin Malik and Anas bin Malik. This Hadith is Hasan Sahih.",
        "malay_translation": "Diriwayatkan dari Jabir bin ‘Abdullah : Bahawa Rasulullah (ﷺ) bersabda: Peperangan adalah tipu daya. [Abu 'Eisa berkata:] Terdapat riwayat mengenai topik ini dari 'Ali, Zaid bin Thabit, 'Aishah, Ibn 'Abbas, Abu Hurairah, Asma' bint Yazid bin As-Sakan, Ka'b bin Malik dan Anas bin Malik. Hadith ini adalah Hasan Sahih.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، وَنَصْرُ بْنُ عَلِيٍّ، قَالَا:‏‏‏‏ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْحَرْبُ خُدْعَةٌ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ عَلِيٍّ، ‏‏‏‏‏‏وَزَيْدِ بْنِ ثَابِتٍ، ‏‏‏‏‏‏وَعَائِشَةَ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَأَسْمَاءَ بِنْتِ يَزِيدَ بْنِ السَّكَنِ، ‏‏‏‏‏‏وَكَعْبِ بْنِ مَالِكٍ، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 16800,
        "hadith_number": "1676",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Bilangan Peperangan Nabi (ﷺ) dan Penyertaan Zaid bin Arqam",
        "perawi_melayu": "Diriwayatkan oleh Abu Ishaq",
        "english_text": "Narrated Abu Ishaq: I was next to Zaid bin Arqam when he was asked: 'How many battles did the Prophet (ﷺ) fight ?' He said: 'Nineteen.' So I said: 'How many battles did you take part in with him ?' he said: 'Seventeen.' I said: 'Which of them was the first?' He said: 'Dhat Al-Ushaira' or Al-'Usaira'. ' [Abu 'Eisa said:] This Hadith is Hasan Sahih.",
        "malay_translation": "Diriwayatkan daripada Abu Ishaq: Saya berada di samping Zaid bin Arqam ketika beliau ditanya: 'Berapa banyak peperangan yang Nabi (ﷺ) sertai?' Beliau berkata: 'Sembilan belas.' Lalu saya berkata: 'Berapa banyak peperangan yang kamu sertai bersama baginda?' beliau berkata: 'Tujuh belas.' Saya berkata: 'Manakah yang pertama?' Beliau berkata: 'Dhat Al-Ushaira' atau Al-'Usaira'. [Abu 'Eisa berkata:] Hadis ini adalah Hasan Sahih.",
        "arabic_text": "حَدَّثَنَا حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، وَأَبُو دَاوُدَ الطَّيَالِسِيُّ، قَالَا:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاق، قَالَ:‏‏‏‏ كُنْتُ إِلَى جَنْبِ زَيْدِ بْنِ أَرْقَمَ، فَقِيلَ لَهُ:‏‏‏‏ كَمْ غَزَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ غَزْوَةٍ ؟ قَالَ:‏‏‏‏ تِسْعَ عَشْرَةَ ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ كَمْ غَزَوْتَ أَنْتَ مَعَهُ ؟ قَالَ:‏‏‏‏ سَبْعَ عَشْرَةَ ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ أَيَّتُهُنَّ كَانَ أَوَّلَ ؟ قَالَ:‏‏‏‏ ذَاتُ الْعُشَيْرِ، ‏‏‏‏‏‏أَوْ الْعُشَيْرَةِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 16801,
        "hadith_number": "1677",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Rasulullah (ﷺ) Mengatur Barisan Sahabat di Badr pada Waktu Malam",
        "perawi_melayu": "'Abdur-Rahman bin 'Awf",
        "english_text": "Narrated 'Abdur-Rahman bin 'Awf: The Messenger of Allah (ﷺ) positioned us during the night at Badr. [Abu 'Eisa said:] There is something on this topic from Abu Ayyub. This Hadith is Gharib, we do not know of it except from this route. I asked Muhammad bin Isma'il about this Hadith, but he did not know it, and he said: Muhammad bin Ishaq heard from 'Ikrimah. And when I saw him, he had a good opinion about Muhammad bin Humaid Ar-Razi, then he considered him weak later.",
        "malay_translation": "Diriwayatkan daripada 'Abdur-Rahman bin 'Awf: Rasulullah (ﷺ) mengatur barisan kami pada waktu malam di Badr. [Abu 'Eisa berkata:] Ada sesuatu mengenai topik ini daripada Abu Ayyub. Hadis ini Gharib, kami tidak mengetahuinya kecuali daripada jalur ini. Saya bertanya kepada Muhammad bin Isma'il mengenai hadis ini, tetapi beliau tidak mengetahuinya, dan beliau berkata: Muhammad bin Ishaq mendengar daripada 'Ikrimah. Dan ketika saya melihatnya, beliau mempunyai pendapat yang baik tentang Muhammad bin Humaid Ar-Razi, kemudian beliau menganggapnya lemah kemudian.",
        "arabic_text": "حَدَّثَنَا حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ، حَدَّثَنَا سَلَمَةُ بْنُ الْفَضْلِ، عَنْ مُحَمَّدِ بْنِ إِسْحَاق، عَنْ عِكْرِمَةَ، عَنْ ابْنِ عَبَّاسٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، قَالَ:‏‏‏‏ عَبَّأَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِبَدْرٍ لَيْلًا ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ أَبِي أَيُّوبَ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَسَأَلْتُ مُحَمَّدَ بْنَ إِسْمَاعِيل، ‏‏‏‏‏‏عَنْ هَذَا الْحَدِيثِ فَلَمْ يَعْرِفْهُ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ مُحَمَّدُ بْنُ إِسْحَاق، ‏‏‏‏‏‏سَمِعَ مِنْ عِكْرِمَةَ، ‏‏‏‏‏‏وَحِينَ رَأَيْتُهُ كَانَ حَسَنَ الرَّأْيِ فِي مُحَمَّدِ بْنِ حُمَيْدٍ الرَّازِيِّ، ‏‏‏‏‏‏ثُمَّ ضَعَّفَهُ بَعْدُ."
      },
      {
        "id": 16802,
        "hadith_number": "1678",
        "status": "Sahih",
        "nama_buku": "Jami' al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Doa Nabi Menentang Ahzab",
        "perawi_melayu": "Ibn Abi Awfa",
        "english_text": "Narrated Ibn Abi Awfa: I heard him saying - meaning the Prophet (ﷺ) - while supplicating against the Ahzab: 'O Allah, Revealer of Book! Severe is reckoning! Rout the Ahzab and shake them.' [Abu 'Eisa said:] There is something on this topic from Ibn Masu'd This Hadith is Hasan Sahih.",
        "malay_translation": "Diriwayatkan daripada Ibn Abi Awfa: Aku mendengar beliau bersabda - yang dimaksudkan Nabi ﷺ - ketika berdoa menentang golongan Ahzab: 'Ya Allah, Wahai yang menurunkan Kitab! Hisab-Mu sangat keras! Tumpaskan golongan Ahzab dan gemparkan mereka.' [Abu 'Eisa berkata:] Ada riwayat lain mengenai topik ini daripada Ibn Masu'd. Hadis ini Hasan Sahih.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا إِسْمَاعِيل بْنُ أَبِي خَالِدٍ، عَنْ ابْنِ أَبِي أَوْفَى، قَالَ:‏‏‏‏ سَمِعْتُهُ يَقُولُ:‏‏‏‏ يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو عَلَى الْأَحْزَابِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ اللَّهُمَّ مُنْزِلَ الْكِتَابِ، ‏‏‏‏‏‏سَرِيعَ الْحِسَابِ، ‏‏‏‏‏‏اهْزِمْ الْأَحْزَابَ، ‏‏‏‏‏‏اللَّهُمَّ اهْزِمْهُمْ وَزَلْزِلْهُمْ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ فِي الْبَاب، ‏‏‏‏‏‏عَنْ ابْنِ مَسْعُودٍ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 16803,
        "hadith_number": "1679",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Panji Rasulullah SAW Ketika Memasuki Makkah",
        "perawi_melayu": "Jabir",
        "english_text": "Narrated Jabir: The Messenger of Allah (ﷺ) entered Makkah, and his standard was white. [Abu 'Eisa said:] This Hadith is Gharib, we do know of it except as a narration of Yayha bin Adam from Sharik. He said: I asked Muhammad about this Hadith, but he did not know it except as a narration of Yahya bin Adam from Sharik, he said: More than one narrator has narrated to us from Sharik from 'Ammar bin Abu Az-Zubair from Jabir: 'The Prophet (ﷺ) entered Makkah and he was wearing a black 'Imamah.' Muhammad said: This is the Hadith. [Abu 'Eisa said:] Duhn is a branch of Bajilah (the tribe), and 'Ammar ad-Duhni (one of the narrators) is 'Ammar bin Mu'awiyah Ad-Duhni, and his kunyah is Abu Mu'awiyah, he is from Al-Kufah, and he is trustworthy according to the people of Hadith.",
        "malay_translation": "Diriwayatkan dari Jabir: Rasulullah (ﷺ) memasuki Makkah, dan panji baginda berwarna putih. [Abu 'Eisa berkata:] Hadis ini Gharib, kami tidak mengetahui mengenainya kecuali sebagai riwayat daripada Yayha bin Adam daripada Sharik. Beliau berkata: Saya bertanya kepada Muhammad mengenai hadis ini, tetapi beliau tidak mengetahuinya kecuali sebagai riwayat daripada Yahya bin Adam daripada Sharik, beliau berkata: Lebih daripada seorang perawi telah meriwayatkan kepada kami daripada Sharik daripada 'Ammar bin Abu Az-Zubair daripada Jabir: 'Nabi (ﷺ) memasuki Makkah dan baginda memakai 'Imamah hitam.' Muhammad berkata: Ini adalah Hadisnya. [Abu 'Eisa berkata:] Duhn adalah cabang dari Bajilah (suku), dan 'Ammar ad-Duhni (salah seorang perawi) adalah 'Ammar bin Mu'awiyah Ad-Duhni, dan kunyah beliau adalah Abu Mu'awiyah, beliau berasal dari Al-Kufah, dan beliau dipercayai menurut ahli Hadis.",
        "arabic_text": "حَدَّثَنَا حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ الْوَلِيدِ الْكِنْدِيُّ الْكُوفِيُّ، وَأَبُو كُرَيْبٍ، وَمُحَمَّدُ بْنُ رَافِعٍ، قَالُوا:‏‏‏‏ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ شَرِيكٍ، عَنْ عَمَّارٍ يَعْنِي:‏‏‏‏ الدُّهْنِيَّ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ دَخَلَ مَكَّةَ وَلِوَاؤُهُ أَبْيَضُ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ يَحْيَى بْنِ آدَمَ، ‏‏‏‏‏‏عَنْ شَرِيكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَسَأَلْتُ مُحَمَّدًا عَنْ هَذَا الْحَدِيثِ فَلَمْ يَعْرِفْهُ، ‏‏‏‏‏‏إِلَّا مِنْ حَدِيثِ يَحْيَى بْنِ آدَمَ، ‏‏‏‏‏‏عَنْ شَرِيكٍ. وقَالَ:‏‏‏‏ حَدَّثَنَا غَيْرُ وَاحِدٍ، ‏‏‏‏‏‏عَنْ شَرِيكٍ، ‏‏‏‏‏‏عَنْ عَمَّارٍ، ‏‏‏‏‏‏عَنْ أَبِي الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ جَابِرٍ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ دَخَلَ مَكَّةَ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ ، ‏‏‏‏‏‏قَالَ مُحَمَّدٌ:‏‏‏‏ وَالْحَدِيثُ هُوَ هَذَا، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَالدُّهْنُ بَطْنٌ مِنْ بَجِيلَةَ، ‏‏‏‏‏‏وَعَمَّارٌ الدُّهْنِيُّ هُوَ عَمَّارُ بْنُ مُعَاوِيَةَ الدُّهْنِيُّ وَيُكْنَى أَبَا مُعَاوِيَةَ وَهُوَ كُوفِيٌّ وَهُوَ ثِقَةٌ عِنْدَ أَهْلِ الْحَدِيثِ."
      },
      {
        "id": 16804,
        "hadith_number": "1680",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Penerangan tentang Bendera Rasulullah ﷺ",
        "perawi_melayu": "Yunus bin 'Ubaid dan Bekas Hamba Muhammad bin Al-Qasim",
        "english_text": "Narrated Yunus bin 'Ubaid: the freed salve of Muhammad bin Al-Qasim said: Muhammad bin Al-Qasim sent me to Al-Bara' bin 'Azib to ask him about the flag of the Messenger of Allah (ﷺ). He said: 'It was a black square of Namirah.' [Abu 'Eisa said:] There are narrations on this topic from 'Ali, Al-Harith bin Hassan, and Ibn 'Abbas. [Abu 'Eisa said:] This Hadith is Hasan Gharib, we don know know of it except from the report of Ibn Abi Za'idah. And Abu Ya'qub Ath-Thaqafi's name is Ishaq bin Ibrahim. 'Ubaidullah bin Musa also reports from him.",
        "malay_translation": "Diriwayatkan daripada Yunus bin 'Ubaid: bekas hamba yang dibebaskan milik Muhammad bin Al-Qasim berkata: Muhammad bin Al-Qasim mengutusku kepada Al-Bara' bin 'Azib untuk bertanya kepadanya tentang bendera Rasulullah (ﷺ). Beliau berkata: 'Ia adalah segi empat hitam dari Namirah.' [Abu 'Eisa berkata:] Terdapat riwayat mengenai topik ini daripada 'Ali, Al-Harith bin Hassan, dan Ibn 'Abbas. [Abu 'Eisa berkata:] Hadith ini adalah Hasan Gharib, kami tidak mengetahuinya kecuali daripada laporan Ibn Abi Za'idah. Dan nama Abu Ya'qub Ath-Thaqafi adalah Ishaq bin Ibrahim. 'Ubaidullah bin Musa juga meriwayatkan daripadanya.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ، حَدَّثَنَا أَبُو يَعْقُوبَ الثَّقَفِيُّ، حَدَّثَنَا يُونُسُ بْنُ عُبَيْدٍ مَوْلَى مُحَمَّدِ بْنِ الْقَاسِمِ، قَالَ:‏‏‏‏ بَعَثَنِي مُحَمَّدُ بْنُ الْقَاسِمِ إِلَى الْبَرَاءِ بْنِ عَازِبٍ أَسْأَلُهُ عَنْ رَايَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ كَانَتْ سَوْدَاءَ مُرَبَّعَةً مِنْ نَمِرَةٍ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ عَلِيٍّ، ‏‏‏‏‏‏وَالْحَارِثِ بْنِ حَسَّانَ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ ابْنِ أَبِي زَائِدَةَ، ‏‏‏‏‏‏وَأَبُو يَعْقُوبَ الثَّقَفِيُّ اسْمُهُ:‏‏‏‏ إِسْحَاق بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏وَرَوَى عَنْهُ أَيْضًا عُبَيْدُ اللَّهِ بْنُ مُوسَى."
      },
      {
        "id": 16805,
        "hadith_number": "1681",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Bendera dan Panji Rasulullah ﷺ",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Narrated Ibn 'Abbas: The flag of the Messenger of Allah (ﷺ) was black, and his standard was white. [Abu 'Eisa said:] This Hadith is Hasan Gharib from this route, as a narration of Ibn 'Abbas.",
        "malay_translation": "Diriwayatkan daripada Ibn 'Abbas: Bendera Rasulullah (ﷺ) berwarna hitam, dan panji-panjinya berwarna putih. [Abu 'Eisa berkata:] Hadis ini Hasan Gharib dari jalur ini, sebagai riwayat daripada Ibn 'Abbas.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا يَحْيَى بْنُ إِسْحَاق وَهُوَ السَّالِحَانِيُّ، حَدَّثَنَا يَزِيدُ بْنُ حَيَّانَ، قَال:‏‏‏‏ سَمِعْتُ أَبَا مِجْلَزٍ لَاحِقَ بْنَ حُمَيْدٍ يُحَدِّثُ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، قَالَ:‏‏‏‏ كَانَتْ رَايَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَوْدَاءَ، ‏‏‏‏‏‏وَلِوَاؤُهُ أَبْيَضَ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏مِنْ حَدِيثِ ابْنِ عَبَّاسٍ."
      },
      {
        "id": 16806,
        "hadith_number": "1682",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Doa Apabila Diserang Musuh Secara Mengejut",
        "perawi_melayu": "Al-Muhallab bin Abi Sufrah",
        "english_text": "Narrated Al-Muhallab bin Abi Sufrah: From one who heard the Prophet (ﷺ) saying: If you suffer a surprise attack from the enemy then say: 'Ha Min, they will not be victorious.' [Abu 'Eisa said:] There is something on this topic from Salamah bin Al-Akwa'. This is how some of them reported it from Abu Ishaq, the same as the narration of Ath-Thawri. And it has been reported from him, from Al-Muhallab bin Abi Sufrah from the Prophet (ﷺ) in Mursal form.",
        "malay_translation": "Diriwayatkan daripada Al-Muhallab bin Abi Sufrah: Daripada seorang yang mendengar Nabi (ﷺ) bersabda: \"Jika kamu diserang secara mengejut daripada musuh, maka katakanlah: 'Ha Min, mereka tidak akan menang.' [Abu 'Eisa berkata:] Terdapat juga hadis berkaitan topik ini daripada Salamah bin Al-Akwa'. Beginilah sebahagian daripada mereka meriwayatkannya daripada Abu Ishaq, sama seperti riwayat Ath-Thawri. Dan telah diriwayatkan daripada beliau, daripada Al-Muhallab bin Abi Sufrah daripada Nabi (ﷺ) dalam bentuk Mursal.",
        "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاق، عَنْ الْمُهَلَّبِ بْنِ أَبِي صُفْرَةَ، عَمَّنْ سَمِعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ إِنْ بَيَّتَكُمُ الْعَدُوُّ فَقُولُوا:‏‏‏‏ حم لَا يُنْصَرُونَ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ سَلَمَةَ بْنِ الْأَكْوَعِ، ‏‏‏‏‏‏وَهَكَذَا رَوَى بَعْضُهُمْ عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏مِثْلَ رِوَايَةِ الثَّوْرِيِّ، ‏‏‏‏‏‏وَرُوِيَ عَنْهُ، ‏‏‏‏‏‏عَنْ الْمُهَلَّبِ بْنِ أَبِي صُفْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا"
      },
      {
        "id": 16807,
        "hadith_number": "1683",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Pedang yang Menyerupai Pedang Rasulullah (ﷺ)",
        "perawi_melayu": "'Uthman bin Sa'd",
        "english_text": "Narrated 'Uthman bin Sa'd: That Ibn Sirin said: I made my sword like the sword of Samurah bin Jundab. Samurah claimed that he made his sword like the sword of the Messenger of Allah (ﷺ), and it was a Hanafiyah. [Abu 'Eisa said:] This Hadith is Gharib, we do not know of it except through this route. Yahya bin Sa'eed Al-Qattan has criticized 'Uthman bin Sa'd the scribe, and he graded him weak due to his memory.",
        "malay_translation": "Diriwayatkan daripada 'Uthman bin Sa'd: Bahawa Ibn Sirin berkata: Aku telah membuat pedangku seperti pedang Samurah bin Jundab. Samurah mendakwa bahawa dia membuat pedangnya seperti pedang Rasulullah (ﷺ), dan ia adalah Hanafiyah. [Abu 'Eisa berkata:] Hadith ini Gharib, kami tidak mengetahuinya kecuali melalui jalur ini. Yahya bin Sa'eed Al-Qattan telah mengkritik 'Uthman bin Sa'd penulis, dan beliau menilainya dhaif (lemah) kerana ingatannya.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ شُجَاعٍ الْبَغْدَادِيُّ، حَدَّثَنَا أَبُو عُبَيْدَةَ الْحَدَّادُ، عَنْ عُثْمَانَ بْنِ سَعْدٍ، عَنْ ابْنِ سِيرِينَ، قَالَ:‏‏‏‏ صَنَعْتُ سَيْفِي عَلَى سَيْفِ سَمُرَةَ بْنِ جُنْدَبٍ، ‏‏‏‏‏‏وَزَعَمَ سَمُرَةُ أَنَّهُ صَنَعَ سَيْفَهُ عَلَى سَيْفِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَكَانَ حَنَفِيًّا قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَقَدْ تَكَلَّمَ يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، ‏‏‏‏‏‏فِي عُثْمَانَ بْنِ سَعْدٍ الْكَاتِبِ، ‏‏‏‏‏‏وَضَعَّفَهُ مِنْ قِبَلِ حِفْظِهِ."
      },
      {
        "id": 16808,
        "hadith_number": "1684",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Perintah Berbuka Puasa Ketika Tahun Pembukaan Makkah",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Narrated Abu Sa’id Al Khudri : During the year of the conquest, when the Prophet (ﷺ) reached Marr Zahran, he told us that we would meet the enemy. So he ordered us to break the fast, and we [all] broke our fast. [Abu 'Eisa said:] This Hadith is Hasan Sahih, and there is something on this topic from Ibn 'Umar.",
        "malay_translation": "Diriwayatkan daripada Abu Sa’id Al Khudri : Pada tahun pembukaan (Makkah), ketika Nabi (ﷺ) tiba di Marr Zahran, baginda memberitahu kami bahawa kami akan bertemu musuh. Maka baginda memerintahkan kami untuk berbuka puasa, dan kami semua berbuka puasa. [Abu 'Eisa berkata:] Hadis ini Hasan Sahih, dan terdapat riwayat lain mengenai topik ini daripada Ibn 'Umar.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ مُوسَى، أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَنْبَأَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ، عَنْ عَطِيَّةَ بْنِ قَيْسٍ، عَنْ قَزَعَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ:‏‏‏‏ لَمَّا بَلَغَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْفَتْحِ، ‏‏‏‏‏‏مَرَّ الظَّهْرَانِ، ‏‏‏‏‏‏فَآذَنَنَا بِلِقَاءِ الْعَدُوِّ، ‏‏‏‏‏‏فَأَمَرَنَا بِالْفِطْرِ، ‏‏‏‏‏‏فَأَفْطَرْنَا أَجْمَعُونَ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ عُمَرَ."
      },
      {
        "id": 16809,
        "hadith_number": "1685",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Nabi Menunggang Kuda Mandub dan Pujian Kecepatannya",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "Narrated Anas bin Malik: The Prophet (ﷺ) rode a horse belonging to Abu Talhah called Mandub. He said: 'There is nothing to be frightened of, and we found him to be (quick) like the sea.' [Abu 'Eisa said:] There is something on this topic from Ibn 'Amr Al-'As.",
        "malay_translation": "Diriwayatkan dari Anas bin Malik: Nabi (ﷺ) menunggang seekor kuda milik Abu Talhah yang bernama Mandub. Baginda bersabda: 'Tidak ada apa yang perlu ditakutkan, dan kami mendapati dia (pantas) seperti laut.' [Abu 'Eisa berkata:] Ada sesuatu mengenai topik ini daripada Ibn 'Amr Al-'As.",
        "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، قَالَ:‏‏‏‏ أَنْبَأَنَا شُعْبَةُ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، قَالَ:‏‏‏‏ رَكِبَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَسًا لِأَبِي طَلْحَةَ يُقَالُ لَهُ:‏‏‏‏ مَنْدُوبٌ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا كَانَ مِنْ فَزَعٍ وَإِنْ وَجَدْنَاهُ لَبَحْرًا ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ ابْنِ عَمْرِو بْنِ الْعَاصِ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 16810,
        "hadith_number": "1686",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keberanian Rasulullah dan Kepantasan Kuda Mandub",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Narrated Anas bin Malik: There was a cause of fright in Al-Madinah. So the Messenger of Allah (ﷺ) borrowed a horse of ours called Mandub. He said: 'I have not seen anything to be frightened of, and we found him to be (quick) like the sea.' [Abu 'Eisa said:] This Hadith is Hasan Sahih.",
        "malay_translation": "Diriwayatkan dari Anas bin Malik: Pernah terjadi suatu kejadian yang menakutkan di Madinah. Maka Rasulullah (ﷺ) meminjam seekor kuda kami yang bernama Mandub. Baginda bersabda: 'Aku tidak melihat sesuatu pun yang menakutkan, dan kami mendapati kuda ini (pantas) seperti laut.' [Abu 'Eisa berkata:] Hadis ini Hasan Sahih.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، وَابْنُ أَبِي عَدِيٍّ، وأبو داود، قَالُوا:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ:‏‏‏‏ كَانَ فَزَعٌ بِالْمَدِينَةِ، ‏‏‏‏‏‏فَاسْتَعَارَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَسًا لَنَا يُقَالُ لَهُ:‏‏‏‏ مَنْدُوبٌ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا رَأَيْنَا مِنْ فَزَعٍ وَإِنْ وَجَدْنَاهُ لَبَحْرًا ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 16811,
        "hadith_number": "1687",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Sifat-Sifat Nabi (ﷺ): Paling Baik, Pemurah, dan Berani",
        "perawi_melayu": "Anas",
        "english_text": "Narrated Anas: The Prophet (ﷺ) was the nicest person among the people, the most generous of the people, and the bravest among the people. He said: The inhabitants of Al-Madinah became freightened one night upon hearing a loud noise. He said: So the Prophet (ﷺ) met them upon an unsaddled horse belonging to Abu Talhah, with a sword hanging around his neck. He said: 'I found him to be (quick) like the sea.' - meaning the horse. [Abu 'Eisa said:] This Hadith is Hasan Sahih.",
        "malay_translation": "Diriwayatkan dari Anas: Nabi (ﷺ) adalah orang yang paling baik di antara manusia, paling pemurah di antara manusia, dan paling berani di antara manusia. Beliau bersabda: Penduduk Madinah menjadi ketakutan pada suatu malam apabila mendengar bunyi yang kuat. Beliau bersabda: Maka Nabi (ﷺ) menemui mereka dengan menunggang kuda Abu Talhah yang tidak berpelana, dengan pedang tergantung di lehernya. Beliau bersabda: 'Aku mendapati baginda (pantas) seperti laut' - maksudnya kuda itu. [Abu 'Eisa berkata:] Hadis ini Hasan Sahih.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ أَحْسَنِ النَّاسِ، ‏‏‏‏‏‏وَأَجْوَدِ النَّاسِ، ‏‏‏‏‏‏وَأَشْجَعِ النَّاسِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَقَدْ فَزِعَ أَهْلُ الْمَدِينَةِ لَيْلَةً سَمِعُوا صَوْتًا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَتَلَقَّاهُمُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى فَرَسٍ لِأَبِي طَلْحَةَ عُرْيٍ وَهُوَ مُتَقَلِّدٌ سَيْفَهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ لَمْ تُرَاعُوا، ‏‏‏‏‏‏لَمْ تُرَاعُوا ، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ وَجَدْتُهُ بَحْرًا ، ‏‏‏‏‏‏يَعْنِي:‏‏‏‏ الْفَرَسَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ صَحِيحٌ"
      },
      {
        "id": 16812,
        "hadith_number": "1688",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Penjelasan tentang Perang Hunain dan Pengakuan Nabi ﷺ",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Narrated Abu Ishaq: From Al-Bara' bin 'Azib who said: A man said to us: 'Did you flee from the Messenger of Allah (ﷺ) O Abu 'Umarah ?' He said: No, By Allah! I did not flee from the Messenger of Allah (ﷺ), but som hasty people fled and (the tribe of) Hawazin assaulted them with arrows. The Messenger of Allah (Saws) was on his white muls, and Abu Sufyan bin Al-Harith bin 'Abdul Muttalib was holding its reigns. The Messenger of Allah (ﷺ) was saying: 'I am the Prophet without lie, I am the son of 'Abdul-Muttalib.' [Abu 'Eisa said:] There are narrations on this topic from 'Ali, and Ibn 'Umar.",
        "malay_translation": "Diriwayatkan daripada Abu Ishaq: Daripada Al-Bara' bin 'Azib yang berkata: Seorang lelaki berkata kepada kami: 'Adakah kamu melarikan diri daripada Rasulullah (ﷺ) wahai Abu 'Umarah?' Dia berkata: Tidak, demi Allah! Aku tidak melarikan diri daripada Rasulullah (ﷺ), tetapi beberapa orang yang tergesa-gesa melarikan diri dan (puak) Hawazin menyerang mereka dengan anak panah. Rasulullah (Saws) berada di atas baghal putihnya, dan Abu Sufyan bin Al-Harith bin 'Abdul Muttalib memegang tali kekangnya. Rasulullah (ﷺ) sedang bersabda: 'Aku adalah Nabi, tidak berdusta, aku adalah anak 'Abdul-Muttalib.' [Abu 'Eisa berkata:] Terdapat riwayat mengenai topik ini daripada 'Ali, dan Ibn 'Umar.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ، حَدَّثَنَا أَبُو إِسْحَاق، عَنْ الْبَرَاءِ بِنِ عَازِبٍ، قَالَ:‏‏‏‏ قَالَ لَنَا رَجُلٌ:‏‏‏‏ أَفَرَرْتُمْ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَبَا عُمَارَةَ ؟ قَالَ:‏‏‏‏ لَا وَاللَّهِ، ‏‏‏‏‏‏مَا وَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَلَكِنْ وَلَّى سَرَعَانُ النَّاسِ تَلَقَّتْهُمْ هَوَازِنُ بِالنَّبْلِ، ‏‏‏‏‏‏وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى بَغْلَتِهِ، ‏‏‏‏‏‏وَأَبُو سُفْيَانَ بْنُ الْحَارِثِ بْنِ عَبْدِ الْمُطَّلِبِ آخِذٌ بِلِجَامِهَا، ‏‏‏‏‏‏وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ أَنَا النَّبِيُّ لَا كَذِبْ، ‏‏‏‏‏‏أَنَا ابْنُ عَبْدِ الْمُطَّلِبْ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ عَلِيٍّ، ‏‏‏‏‏‏وَابْنِ عُمَرَ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 16813,
        "hadith_number": "1689",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Kisah Perang Hunain dan Ketabahan Rasulullah (ﷺ)",
        "perawi_melayu": "Ibn 'Umar",
        "english_text": "Narrated Ibn 'Umar: Indeed we saw the day of Hunain, and indeed the two armies fled from the Messenger of Allah (ﷺ), and there did not remain one hundred men with the Messenger of Allah (ﷺ). [Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of 'Ubaidullah. We do not know of it except from this route.",
        "malay_translation": "Diriwayatkan daripada Ibn 'Umar: Sesungguhnya kami melihat pada hari Hunain, dan sesungguhnya kedua-dua tentera melarikan diri daripada Rasulullah (ﷺ), dan tidak tinggal bersama Rasulullah (ﷺ) seramai seratus orang. [Abu 'Eisa berkata:] Hadith ini adalah Hasan Gharib sebagai riwayat daripada 'Ubaidullah. Kami tidak mengetahuinya melainkan daripada jalan ini.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ عَلِيٍّ الْمُقَدَّمِيُّ الْبَصْرِيُّ، حَدَّثَنِي أَبِي، عَنْ سُفْيَانَ بْنِ حُسَيْنٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنْ ابْنِ عُمَرَ، قَالَ:‏‏‏‏ لَقَدْ رَأَيْتُنَا يَوْمَ حُنَيْنٍ وَإِنَّ الْفِئَتَيْنِ لَمُوَلِّيَتَانِ، ‏‏‏‏‏‏وَمَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِائَةُ رَجُلٍ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ مِنْ حَدِيثِ عُبَيْدِ اللَّهِ إِلَّا مِنْ هَذَا الْوَجْهِ."
      },
      {
        "id": 16814,
        "hadith_number": "1690",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Pedang Rasulullah (ﷺ) Pada Hari Pembukaan Kota Mekah",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Narrated Talib bin Hujair: From Hud bin 'Abdullah bin Sa'd, from his grandfather Mazidah, who said: The Messenger of Allah (ﷺ) on the Day of the Conquest and there was gold and silver on his sword. Talib said: So I asked him about the silver and he said: 'The hand-guard of his sword was of silver.' [Abu 'Eisa said:] There is something on this topic form Anas. This Hadith is Hasan Gharib. Hud's (great) grandfather's name is Mazidah Al-'Asari.",
        "malay_translation": "Diriwayatkan daripada Talib bin Hujair: Daripada Hud bin 'Abdullah bin Sa'd, daripada datuknya Mazidah, yang berkata: Rasulullah (ﷺ) pada Hari Pembukaan Kota Mekah dan terdapat emas dan perak pada pedangnya. Talib berkata: Lalu saya bertanya kepadanya tentang perak itu dan dia berkata: 'Hulu pedangnya diperbuat daripada perak.' [Abu 'Eisa berkata:] Ada sesuatu mengenai topik ini daripada Anas. Hadith ini adalah Hasan Gharib. Nama datuk (buyut) Hud ialah Mazidah Al-'Asari.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ صُدْرَانَ أَبُو جَعْفَرٍ الْبَصْرِيُّ، حَدَّثَنَا طَالِبُ بْنُ حُجَيْرٍ، عَنْ هُودِ بْنِ عَبْدِ اللَّهِ بْنِ سَعْدٍ، عَنْ جَدِّهِ مَزِيدَةَ، قَالَ:‏‏‏‏ دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْفَتْحِ وَعَلَى سَيْفِهِ ذَهَبٌ وَفِضَّةٌ، ‏‏‏‏‏‏قَالَ طَالِبٌ:‏‏‏‏ فَسَأَلْتُهُ عَنِ الْفِضَّةِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ كَانَتْ قَبِيعَةُ السَّيْفِ فِضَّةً ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏وَجَدُّ هُودٍ اسْمُهُ:‏‏‏‏ مَزِيدَةُ الْعَصَرِيُّ."
      },
      {
        "id": 16815,
        "hadith_number": "1691",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Sarung Tangan pada Pedang Rasulullah ﷺ Diperbuat daripada Perak",
        "perawi_melayu": "Anas",
        "english_text": "Narrated Anas: The hand-guard on the sword of the Messenger of Allah (ﷺ) was made from silver. [Abu 'Eisa said:] This Hadith is Hasan Gharib. This is how it has been reported from Hamam from Qatadah from Anas. While some of them reported it from Qatadah, from Sa'eed bin Abu Al-Hasan who said: The hand-guard on the sword of Messenger of Allah (ﷺ) was made from silver.",
        "malay_translation": "Diriwayatkan daripada Anas: Sarung tangan pada pedang Rasulullah ﷺ diperbuat daripada perak. [Abu 'Eisa berkata:] Hadis ini adalah Hasan Gharib. Ia diriwayatkan sebegini daripada Hamam daripada Qatadah daripada Anas. Sementara sebahagian daripada mereka meriwayatkannya daripada Qatadah, daripada Sa'eed bin Abu Al-Hasan, yang berkata: Sarung tangan pada pedang Rasulullah ﷺ diperbuat daripada perak.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرِ بْنِ حَازِمٍ، حَدَّثَنَا أَبِي، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ:‏‏‏‏ كَانَتْ قَبِيعَةُ سَيْفِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ فِضَّةٍ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏وَهَكَذَا رُوِيَ عَنْ هَمَّامٍ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏وَقَدْ رَوَى بَعْضُهُمْ عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ أَبِي الْحَسَنِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَتْ قَبِيعَةُ سَيْفِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ فِضَّةٍ ."
      },
      {
        "id": 16816,
        "hadith_number": "1692",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Talhah Dijamin Syurga Kerana Memudahkan Nabi SAW di Uhud",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Narrated Az-Zubair bin Al-'Awwam: On the Day of Uhud, the Prophet (ﷺ) wore two coats of mail. He tried to get up on a boulder but was not able to, so Talhah squatted under him, lifting the Prophet (ﷺ) upon it such that he could sit on the boulder. So he said: (Paradise) It is obligated from Talhah.' [Abu 'Eisa said:] There are narrations on this topic from Safwan bin Umayyah and As-Sa'ib bin Yazid. This Hadith is Hasan Gharib, we do not know of it except through the narration of Muhammad bin Ishaq.",
        "malay_translation": "Diriwayatkan daripada Az-Zubair bin Al-'Awwam: Pada Hari Uhud, Nabi (ﷺ) memakai dua lapis baju besi. Baginda cuba untuk naik ke atas batu besar tetapi tidak dapat, jadi Talhah mencangkung di bawah baginda, mengangkat Nabi (ﷺ) ke atasnya sehingga baginda dapat duduk di atas batu itu. Lalu baginda bersabda: '(Syurga) Diwajibkan bagi Talhah.' [Abu 'Eisa berkata:] Terdapat riwayat mengenai topik ini daripada Safwan bin Umayyah dan As-Sa'ib bin Yazid. Hadis ini adalah Hasan Gharib, kami tidak mengetahuinya kecuali melalui riwayat Muhammad bin Ishaq.",
        "arabic_text": "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ، حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ، عَنْ مُحَمَّدِ بْنِ إِسْحَاق، عَنْ يَحْيَى بْنِ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ أَبِيهِ، عَنْ جَدِّهِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ الزُّبَيْرِ بْنِ الْعَوَّامِ، قَالَ:‏‏‏‏ كَانَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دِرْعَانِ يَوْمَ أُحُدٍ، ‏‏‏‏‏‏فَنَهَضَ إِلَى الصَّخْرَةِ فَلَمْ يَسْتَطِعْ، ‏‏‏‏‏‏فَأَقْعَدَ طَلْحَةَ تَحْتَهُ، ‏‏‏‏‏‏فَصَعِدَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْهِ حَتَّى اسْتَوَى عَلَى الصَّخْرَةِ ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ أَوْجَبَ طَلْحَةُ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ صَفْوَانَ بْنِ أُمَيَّةَ، ‏‏‏‏‏‏وَالسَّائِبِ بْنِ يَزِيدَ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ مُحَمَّدِ بْنِ إِسْحَاق."
      },
      {
        "id": 16817,
        "hadith_number": "1693",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Perintah Membunuh Ibn Khatal yang Berpegangan pada Kaabah",
        "perawi_melayu": "Anas bin Malik",
        "english_text": "Narrated Anas bin Malik: The Prophet (ﷺ) entered (Makkah) during they year of the Conquest, and upon his head was a helmet (Mighfar). It was said to him: 'Ibn Khatal is clinging to the covering of the Ka'bah.' So he said: 'Kill him.' [Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. We do knot know of anyone important who reported it other than Malik from Az-Zuhri.",
        "malay_translation": "Diriwayatkan dari Anas bin Malik: Nabi (ﷺ) memasuki (Makkah) pada tahun Pembukaan (Makkah), dan di atas kepala baginda terdapat topi besi (Mighfar). Dikatakan kepada baginda: 'Ibn Khatal sedang berpegangan pada kain Kaabah.' Maka baginda bersabda: 'Bunuh dia.' [Abu 'Eisa berkata:] Hadis ini Hasan Sahih Gharib. Kami tidak mengetahui sesiapa pun yang penting yang meriwayatkannya selain Malik dari Az-Zuhri.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ:‏‏‏‏ دَخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْفَتْحِ وَعَلَى رَأْسِهِ الْمِغْفَرُ، ‏‏‏‏‏‏فَقِيلَ لَهُ:‏‏‏‏ ابْنُ خَطَلٍ مُتَعَلِّقٌ بِأَسْتَارِ الْكَعْبَةِ ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ اقْتُلُوهُ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُ كَبِيرَ أَحَدٍ رَوَاهُ غَيْرَ مَالِكٍ، ‏‏‏‏‏‏عَنْ الزُّهْرِيِّ."
      },
      {
        "id": 16818,
        "hadith_number": "1694",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keberkatan Kuda Hingga Hari Kiamat",
        "perawi_melayu": "'Urwah Al-Bariqi",
        "english_text": "Narrated 'Urwah Al-Bariqi: That the Messenger of Allah (ﷺ) said: Goodness will remain in the forelocks of horses until the Day of Judgement: (They bring about) Rewards and spoils of war. [Abu 'Eisa said:] There are narrations on this topic from Ibn 'Umar, Abu Sa'eed, Jarir, Abu Hurairah, Asma' bin Yazid, Al-Mughira bin Shu'bah, and Jabir. [Abu 'Eisa said:] This Hadith is Hasan Sahih. 'Urwah is Ibn Al-Ja'd Al-Bariqi, and they say he is 'Urwah bin Al-Ja'd. Ahmad bin Hanbal said: The Fiqh of this Hadith is that Jihad is with every Imam until the Day of Judgement.",
        "malay_translation": "Diriwayatkan daripada 'Urwah Al-Bariqi: Bahawa Rasulullah (ﷺ) bersabda: Kebaikan akan kekal pada ubun-ubun kuda hingga Hari Kiamat: (Kuda-kuda itu membawa) Ganjaran dan harta rampasan perang. [Abu 'Eisa berkata:] Terdapat riwayat mengenai topik ini daripada Ibn 'Umar, Abu Sa'eed, Jarir, Abu Hurairah, Asma' bin Yazid, Al-Mughira bin Shu'bah, dan Jabir. [Abu 'Eisa berkata:] Hadith ini Hasan Sahih. 'Urwah adalah Ibn Al-Ja'd Al-Bariqi, dan dikatakan bahawa beliau adalah 'Urwah bin Al-Ja'd. Ahmad bin Hanbal berkata: Fiqh Hadith ini adalah bahawa Jihad bersama setiap Imam hingga Hari Kiamat.",
        "arabic_text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا عَبْثَرُ بْنُ الْقَاسِمِ، عَنْ حُصَيْنٍ، عَنْ الشَّعْبِيِّ، عَنْ عُرْوَةَ الْبَارِقِيِّ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ الْخَيْرُ مَعْقُودٌ فِي نَوَاصِي الْخَيْلِ إِلَى يَوْمِ الْقِيَامَةِ، ‏‏‏‏‏‏الْأَجْرُ وَالْمَغْنَمُ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ، ‏‏‏‏‏‏وَأَبِي سَعِيدٍ، ‏‏‏‏‏‏وَجَرِيرٍ، ‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَأَسْمَاءَ بِنْتِ يَزِيدَ، ‏‏‏‏‏‏وَالْمُغِيرَةِ بْنِ شُعْبَةَ، ‏‏‏‏‏‏وَجَابِرٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَعُرْوَةُ هُوَ ابْنُ أَبِي الْجَعْدِ الْبَارِقِيُّ وَيُقَالُ:‏‏‏‏ هُوَ عُرْوَةُ بْنُ الْجَعْدِ، ‏‏‏‏‏‏قَالَ أَحْمَدُ بْنُ حَنْبَلٍ:‏‏‏‏ وَفِقْهُ هَذَا الْحَدِيثِ:‏‏‏‏ أَنَّ الْجِهَادَ مَعَ كُلِّ إِمَامٍ إِلَى يَوْمِ الْقِيَامَةِ."
      },
      {
        "id": 16819,
        "hadith_number": "1695",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keberkatan Kuda Merah",
        "perawi_melayu": "Ibn 'Abbas",
        "english_text": "Narrated Ibn 'Abbas: That the Messenger of Allah (ﷺ) said: The blessing of the horse is in its redness. [Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from this route, from the narration of Shaiban.",
        "malay_translation": "Diriwayatkan dari Ibn 'Abbas: Bahawa Rasulullah (ﷺ) bersabda: Keberkatan kuda terletak pada warna merahnya. [Abu 'Eisa berkata:] Hadis ini Hasan Gharib, kami tidak mengetahuinya kecuali dari jalan ini, dari riwayat Shaiban.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الصَّبَّاحِ الْهَاشِمِيُّ الْبَصْرِيُّ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا شَيْبَانُ يعْنِي ابْنَ عَبْدِ الرَّحْمَنِ، حَدَّثَنَا عِيسَى بْنُ عَلِيِّ بْنِ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، عَنْ أَبِيهِ، عَنْ ابْنِ عَبَّاسٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يُمْنُ الْخَيْلِ فِي الشُّقْرِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ شَيْبَانَ."
      },
      {
        "id": 16820,
        "hadith_number": "1696",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Ciri-ciri Kuda Terbaik",
        "perawi_melayu": "Tidak diriwayatkan",
        "english_text": "Narrated Abu Qatadah: That the Prophet (ﷺ) said: The best horse is the black one with a spot on the face, and white on the upper lip. Then the one with some white on his lower legs, except for the right. So if it is no black, then the Kumait (red one with black on its ears and its mane) with these markings.",
        "malay_translation": "Diriwayatkan daripada Abu Qatadah: Bahawa Nabi (ﷺ) bersabda: Kuda yang terbaik adalah kuda hitam dengan tanda putih di muka, dan putih di bibir atas. Kemudian yang mempunyai sedikit putih di kaki bawahnya, kecuali kaki kanan. Sekiranya ia bukan hitam, maka Kumait (merah dengan hitam di telinga dan surainya) dengan tanda-tanda ini.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَخْبَرَنَا ابْنُ لَهِيعَةَ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عَلِيِّ بْنِ رَبَاحٍ، عَنْ أَبِي قَتَادَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ خَيْرُ الْخَيْلِ:‏‏‏‏ الْأَدْهَمُ الْأَقْرَحُ الْأَرْثَمُ، ‏‏‏‏‏‏ثُمَّ الْأَقْرَحُ الْمُحَجَّلُ طَلْقُ الْيَمِينِ، ‏‏‏‏‏‏فَإِنْ لَمْ يَكُنْ أَدْهَمَ، ‏‏‏‏‏‏فَكُمَيْتٌ عَلَى هَذِهِ الشِّيَةِ ."
      },
      {
        "id": 16821,
        "hadith_number": "1697",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Hadith Hasan Gharib Sahih yang Seumpama",
        "perawi_melayu": "Perawi tidak dinyatakan (Mengikut sanad Yazid bin Abi Habib)",
        "english_text": "Another chain with similar meaning. [Abu 'Eisa said: ] This Hadith is Hasan Gharib Sahih.",
        "malay_translation": "Satu lagi sanad dengan makna yang serupa. [Abu 'Eisa berkata:] Hadith ini adalah Hasan Gharib Sahih.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي، عَنْ يَحْيَى بْنِ أَيُّوبَ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ بِهَذَا الْإِسْنَادِ نَحْوَهُ بِمَعْنَاهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ."
      },
      {
        "id": 16822,
        "hadith_number": "1698",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Nabi (ﷺ) Tidak Menyukai Shikal pada Kuda",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Narrated Abu Hurairah: That the Prophet (ﷺ) disliked Shikal in horses. [Abu 'Eisa said:] This Hadith is Hasan Sahih. Shu'bah reported similarly from 'Abdullah bin Yazid Al-Khath'ami, from Abu Zur'ah (one of the narrators in the chain of this Hadith), from Abu Hurairah, from the Prophet (ﷺ). Abu Zur'ah bin 'Amr bin Jarir's name is Harim. Muhammed bin Hammad Ar-Razi narrated to us (he said): Jarir narrated to us from 'Umarah bin Al-Qa'qa' who said: 'Ibrahim An-Nakha'i said to me: When you narrate from me, then narrate from me from Abu Zur'ah, for one time he narrated a Hadith to me, then I asked him about it two years later, and he did not leave a letter out of it.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah: Bahawa Nabi (ﷺ) tidak menyukai Shikal pada kuda. [Abu 'Eisa berkata:] Hadith ini Hasan Sahih. Shu'bah meriwayatkan serupa daripada 'Abdullah bin Yazid Al-Khath'ami, daripada Abu Zur'ah (salah seorang perawi dalam rangkaian Hadith ini), daripada Abu Hurairah, daripada Nabi (ﷺ). Nama Abu Zur'ah bin 'Amr bin Jarir adalah Harim. Muhammad bin Hammad Ar-Razi meriwayatkan kepada kami (beliau berkata): Jarir meriwayatkan kepada kami daripada 'Umarah bin Al-Qa'qa' yang berkata: 'Ibrahim An-Nakha'i berkata kepada saya: Apabila kamu meriwayatkan daripada saya, maka riwayatkan daripada saya daripada Abu Zur'ah, kerana suatu ketika beliau meriwayatkan sebuah Hadith kepada saya, kemudian saya bertanya kepadanya tentangnya dua tahun kemudian, dan beliau tidak meninggalkan satu huruf pun daripadanya.'",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، قَالَ:‏‏‏‏ حَدَّثَنِي سَلْمُ بْنُ عَبْدِ الرَّحْمَنِ النَّخَعِيُّ، عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَنَّهُ كَرِهَ الشِّكَالَ مِنَ الْخَيْلِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدْ رَوَاهُ شُعْبَةُ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْخَثْعَمِيِّ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏نَحْوَهُ، ‏‏‏‏‏‏وَأَبُو زُرْعَةَ بْنُ عَمْرِو بْنِ جَرِيرٍ اسْمُهُ:‏‏‏‏ هَرِمٌ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ، ‏‏‏‏‏‏حَدَّثَنَا جَرِيرٌ، ‏‏‏‏‏‏عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ لِي إِبْرَاهِيمُ النَّخَعِيُّ، ‏‏‏‏‏‏إِذَا حَدَّثْتَنِي فَحَدِّثْنِي عَنْ أَبِي زُرْعَةَ، ‏‏‏‏‏‏فَإِنَّهُ حَدَّثَنِي مَرَّةً بِحَدِيثٍ ثُمَّ سَأَلْتُهُ بَعْدَ ذَلِكَ بِسِنِينَ، ‏‏‏‏‏‏فَمَا أَخْرَمَ مِنْهُ حَرْفًا."
      },
      {
        "id": 16823,
        "hadith_number": "1699",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Perlombaan Kuda di Zaman Rasulullah",
        "perawi_melayu": "Ibn 'Umar",
        "english_text": "Narrated Ibn 'Umar: The Messenger of Allah (ﷺ) arranged for the Mudammar among horses to race from Al-Hafiya' to Thaniyyah Al-Wada', between which was a distance of six miles. And for whatever horse was not among the Mudammar, they raced from Thaniya Al-Wada' to the Masjid of Banu Zuraiq, between which was a distance of a mile. I was among those who raced, and my horse jumped along with me over a wall. [Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah, Jabir, Anas, and 'Aishah. This Hadith is Hasan Sahih Gharib as a narration of Ath-Thawri.",
        "malay_translation": "Diriwayatkan dari Ibn 'Umar: Rasulullah (ﷺ) mengatur perlombaan untuk kuda-kuda Mudammar dari Al-Hafiya' ke Thaniyyah Al-Wada', yang jarak antaranya adalah enam batu. Dan untuk kuda-kuda yang bukan dari Mudammar, mereka berlomba dari Thaniya Al-Wada' ke Masjid Banu Zuraiq, yang jarak antaranya adalah satu batu. Saya adalah antara mereka yang berlomba, dan kuda saya melompat bersama saya melewati dinding. [Abu 'Eisa berkata:] Terdapat riwayat mengenai topik ini dari Abu Hurairah, Jabir, Anas, dan 'Aishah. Hadis ini adalah Hasan Sahih Gharib sebagai riwayat dari Ath-Thawri.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ وَزِيرٍ الْوَاسِطِيُّ، حَدَّثَنَا إِسْحَاق بْنُ يُوسُفَ الْأَزْرَقُ، عَنْ سُفْيَانَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنْ ابْنِ عُمَرَ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَجْرَى الْمُضَمَّرَ مِنَ الْخَيْلِ مِنْ الْحَفْيَاءِ إِلَى ثَنِيَّةِ الْوَدَاعِ وَبَيْنَهُمَا سِتَّةُ أَمْيَالٍ، ‏‏‏‏‏‏وَمَا لَمْ يُضَمَّرْ مِنَ الْخَيْلِ مِنْ ثَنِيَّةِ الْوَدَاعِ إِلَى مَسْجِدِ بَنِي زُرَيْقٍ وَبَيْنَهُمَا مِيلٌ، ‏‏‏‏‏‏وَكُنْتُ فِيمَنْ أَجْرَى، ‏‏‏‏‏‏فَوَثَبَ بِي فَرَسِي جِدَارًا ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَجَابِرٍ، ‏‏‏‏‏‏وَعَائِشَةَ، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ صَحِيحٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏مِنْ حَدِيثِ الثَّوْرِيِّ."
      },
      {
        "id": 16824,
        "hadith_number": "1700",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Larangan Pertaruhan Kecuali dalam Memanah, Lumba Unta dan Kuda",
        "perawi_melayu": "Abu Hurairah",
        "english_text": "Narrated Abu Hurairah: That the Prophet (ﷺ) said: No stake is acceptable except in archery, racing a camel, and racing a horse.",
        "malay_translation": "Diriwayatkan dari Abu Hurairah: Bahawa Nabi (ﷺ) bersabda: Tidak boleh ada pertaruhan kecuali dalam memanah, perlumbaan unta, dan perlumbaan kuda.",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، عَنْ ابْنِ أَبِي ذِئْبٍ، عَنْ نَافِعِ بْنِ أَبِي نَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا سَبَقَ إِلَّا فِي نَصْلٍ، ‏‏‏‏‏‏أَوْ خُفٍّ، ‏‏‏‏‏‏أَوْ حَافِرٍ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ."
      },
      {
        "id": 16825,
        "hadith_number": "1701",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Rasulullah ﷺ Adalah Hamba Allah dan Perintah Baginda Mengenai Tiga Perkara",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Narrated Ibn 'Abbas: The Messenger of Allah (ﷺ) was a slave (of Allah), who would order as he has ben ordered to. He did not give an order to us instead of the people regarding anything except for three: He ordered us that we make our Wudu' well (Isbagh), that we not eat from charity, and the we not mate a donkey with a horse. [Abu 'Eisa said:] There is something on this topic from 'Ali. This Hadith is Hasan Sahih. Sufyan Ath-Thawri reported this from Abu Jahdam, who said: From 'Ubaidullah bin 'Abdullah bin 'Abbas, from Ibn 'Abbas. He said I heard Muhammad saying: The narration of Ath-Thawri is not preserved. Ath-Thawri made a mistake in it. What is correct is what Ismail bin 'Ulaiyyah and 'Abul-Warith bin Sa'eed reported from Abu Jahdam, from 'Abdullah bin 'Ubaidullah bin 'Abbas from Ibn 'Abbas.",
        "malay_translation": "Diriwayatkan dari Ibn 'Abbas: Rasulullah (ﷺ) adalah seorang hamba (Allah), yang akan memerintahkan sebagaimana yang telah diperintahkan kepadanya. Baginda tidak memberikan perintah kepada kami sebagai ganti orang ramai mengenai apa pun kecuali tiga perkara: Baginda memerintahkan kami untuk menyempurnakan wuduk kami (Isbagh), agar kami tidak makan dari sedekah, dan agar kami tidak mengawinkan keldai dengan kuda. [Abu 'Eisa berkata:] Ada sesuatu mengenai topik ini dari 'Ali. Hadis ini Hasan Sahih. Sufyan Ath-Thawri meriwayatkan ini dari Abu Jahdam, yang berkata: Dari 'Ubaidullah bin 'Abdullah bin 'Abbas, dari Ibn 'Abbas. Dia berkata saya mendengar Muhammad berkata: Riwayat Ath-Thawri tidak terpelihara. Ath-Thawri telah melakukan kesalahan di dalamnya. Yang benar adalah apa yang diriwayatkan oleh Ismail bin 'Ulaiyyah dan 'Abul-Warith bin Sa'eed dari Abu Jahdam, dari 'Abdullah bin 'Ubaidullah bin 'Abbas dari Ibn 'Abbas.",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا إِسْمَاعِيل بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبُو جَهْضَمٍ مُوسَى بْنُ سَالِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ اللَّهِ بْنِ عَبَّاسٍ، عَنْ ابْنِ عَبَّاسٍ، قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَبْدًا مَأْمُورًا، ‏‏‏‏‏‏مَا اخْتَصَّنَا دُونَ النَّاسِ بِشَيْءٍ إِلَّا بِثَلَاثٍ:‏‏‏‏ أَمَرَنَا أَنْ نُسْبِغَ الْوُضُوءَ، ‏‏‏‏‏‏وَأَنْ لَا نَأْكُلَ الصَّدَقَةَ، ‏‏‏‏‏‏وَأَنْ لَا نُنْزِيَ حِمَارًا عَلَى فَرَسٍ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ عَلِيٍّ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَرَوَى سُفْيَانُ الثَّوْرِيُّ هَذَا، ‏‏‏‏‏‏عَنْ أَبِي جَهْضَمٍ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وسَمِعْت مُحَمَّدًا، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ حَدِيثُ الثَّوْرِيِّ غَيْرُ مَحْفُوظٍ وَوَهِمَ فِيهِ الثَّوْرِيُّ، ‏‏‏‏‏‏وَالصَّحِيحُ مَا رَوَى إِسْمَاعِيل ابْنُ عُلَيَّةَ، ‏‏‏‏‏‏وَعَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، ‏‏‏‏‏‏عَنْ أَبِي جَهْضَمٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ اللَّهِ بْنِ عَبَّاسٍ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ."
      },
      {
        "id": 16826,
        "hadith_number": "1702",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Berkat Orang Lemah",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Narrated Abu Ad-Darda': That he heard the Prophet (ﷺ) saying: Seek your weak for me. For indeed you sustenance and aid is only by your weak. [Abu 'Eisa said:] This Hadith is Hasan Sahih.",
        "malay_translation": "Diriwayatkan dari Abu Ad-Darda': Bahawa beliau mendengar Nabi (ﷺ) bersabda: Carilah orang-orang lemah kamu untukku. Sesungguhnya kamu diberi rezeki dan pertolongan hanya kerana orang-orang lemah kamu. [Abu 'Eisa berkata:] Hadis ini Hasan Sahih.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ مُوسَى، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، قَالَ:‏‏‏‏ أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ بْنِ جَابِرٍ، حَدَّثَنَا زَيْدُ بْنُ أَرْطَاةَ، عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِي الدَّرْدَاءِ، قَالَ:‏‏‏‏ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ ابْغُونِي ضُعَفَاءَكُمْ، ‏‏‏‏‏‏فَإِنَّمَا تُرْزَقُونَ وَتُنْصَرُونَ بِضُعَفَائِكُمْ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 16827,
        "hadith_number": "1703",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Malaikat Tidak Menemani Kumpulan yang Ada Anjing atau Loceng",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Narrated Abu Hurairah: That the Messenger of Allah (ﷺ) said: The angels do no accompany a group among whom there is a dog or a bell. [Abu 'Eisa said:] There are narrations on this topic from Ibn 'Umar, Umm Habibah, and Umm Salamah. This Hadith is Hasan Sahih.",
        "malay_translation": "Diriwayatkan daripada Abu Hurairah: Sesungguhnya Rasulullah (ﷺ) bersabda: Malaikat tidak akan menemani sesuatu kaum yang di kalangan mereka terdapat anjing atau loceng. [Abu 'Eisa berkata:] Terdapat riwayat lain mengenai topik ini daripada Ibn 'Umar, Umm Habibah, dan Umm Salamah. Hadis ini Hasan Sahih.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ لَا تَصْحَبُ الْمَلَائِكَةُ رُفْقَةً فِيهَا كَلْبٌ، ‏‏‏‏‏‏وَلَا جَرَسٌ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ عُمَرَ، ‏‏‏‏‏‏وَعَائِشَةَ، ‏‏‏‏‏‏وَأُمِّ حَبِيبَةَ، ‏‏‏‏‏‏وَأُمِّ سَلَمَةَ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 16828,
        "hadith_number": "1704",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keutamaan Ali bin Abi Talib RA",
        "perawi_melayu": "Al-Bara'",
        "english_text": "Narrated Al-Bara' : The Prophet (ﷺ) sent two armies, place 'Ali bin Abi Talib as the commanded of one of them, and Khalid bin Al-Walid over the other. He said: 'Where there is fighting, then 'Ali (is in command).' He said: So 'Ali conquered a fortress and took a slave girl. Khalid [bin Al-Walid] wrote a letter and sent me with it to the Prophet (ﷺ), to speak against him for it. So I arrived to the Prophet (ﷺ) to read the letter. The color of his face changed, the he said: 'What do you think about a man who loves Allah and His Messenger, and Allah and His Messenger love him?' He said: I said: 'I seek refuge from angering Allah and angering His Messenger, I am only the Messenger.' So he was silent. [Abu 'Eisa said:] There is something about this from Ibn 'Umar. This Hadith is Hasan Gharib, we do not know of it except from the narration of Al-Ahwas bin Jawwab. And his saying: To speak against him for that. refers to An-Namimah.",
        "malay_translation": "Daripada Al-Bara': Nabi ﷺ menghantar dua pasukan tentera, melantik Ali bin Abi Talib sebagai ketua salah satu pasukan, dan Khalid bin Al-Walid sebagai ketua pasukan yang lain. Baginda bersabda: 'Di mana ada pertempuran, maka Ali (yang menjadi ketua).' Beliau berkata: Maka Ali menakluki sebuah benteng dan mengambil seorang hamba perempuan. Khalid [bin Al-Walid] menulis surat dan menghantar saya bersama surat itu kepada Nabi ﷺ, untuk bercakap menentangnya tentang perkara itu. Maka saya tiba kepada Nabi ﷺ untuk membaca surat itu. Warna wajah baginda berubah, kemudian baginda bersabda: 'Apa pendapat kamu tentang seorang lelaki yang mencintai Allah dan Rasul-Nya, dan Allah dan Rasul-Nya mencintainya?' Beliau berkata: Saya berkata: 'Saya berlindung daripada memarahi Allah dan memarahi Rasul-Nya, saya hanyalah seorang utusan.' Maka baginda diam. [Abu 'Eisa berkata:] Ada sesuatu mengenai ini daripada Ibn 'Umar. Hadith ini Hasan Gharib, kami tidak mengetahuinya kecuali daripada riwayat Al-Ahwas bin Jawwab. Dan perkataannya: Untuk bercakap menentangnya tentang perkara itu. merujuk kepada An-Namimah.",
        "arabic_text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي زِيَادٍ، حَدَّثَنَا الْأَحْوَصُ بْنُ الْجَوَّابِ أَبُو الْجَوَّابِ، عَنْ يُونُسَ بْنِ أَبِي إِسْحَاق، عَنْ أَبِي إِسْحَاق، عَنْ الْبَرَاءِ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ بَعَثَ جَيْشَيْنِ وَأَمَّرَ عَلَى أَحَدِهِمَا عَلِيَّ بْنَ أَبِي طَالِبٍ، ‏‏‏‏‏‏وَعَلَى الْآخَرِ خَالِدَ بْنَ الْوَلِيدِ ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِذَا كَانَ الْقِتَالُ، ‏‏‏‏‏‏فَعَلِيٌّ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَافْتَتَحَ عَلِيٌّ حِصْنًا فَأَخَذَ مِنْهُ جَارِيَةً، ‏‏‏‏‏‏فَكَتَبَ مَعِي خَالِدُ بْنُ الْوَلِيدِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَشِي بِهِ، ‏‏‏‏‏‏فَقَدِمْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَرَأَ الْكِتَابَ، ‏‏‏‏‏‏فَتَغَيَّرَ لَوْنُهُ ثُمَّ قَالَ:‏‏‏‏ مَا تَرَى فِي رَجُلٍ يُحِبُّ اللَّهَ وَرَسُولَهُ، ‏‏‏‏‏‏وَيُحِبُّهُ اللَّهُ وَرَسُولُهُ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ أَعُوذُ بِاللَّهِ مِنْ غَضَبِ اللَّهِ وَغَضَبِ رَسُولِهِ، ‏‏‏‏‏‏وَإِنَّمَا أَنَا رَسُولٌ، ‏‏‏‏‏‏فَسَكَتَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ الْأَحْوَصِ بْنِ جَوَّابٍ، ‏‏‏‏‏‏قَوْلُهُ يَشِي بِهِ، ‏‏‏‏‏‏يَعْنِي:‏‏‏‏ النَّمِيمَةَ."
      },
      {
        "id": 16829,
        "hadith_number": "1705",
        "status": "Sahih",
        "nama_buku": "Jami' At-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Setiap Orang Adalah Pemimpin dan Akan Ditanya Tanggungjawabnya",
        "perawi_melayu": "Ibrahim bin Bash-shar Ar-Ramadi",
        "english_text": "Ibrahim bin Bash-shar Ar-Ramadi reported it from Sufyan bin 'Uyainah, from Buraid bin 'Abdullah bin Abu Burdah, from Abu Burdah, from Abu Musa, from the Prophet (ﷺ). Muhammad informed me of that, from Ibrahim bin Bash-Shar [Ar-Ramadi]. Muhammad said: More than one has reported it from Sufyan, from Buraid bin Abu Burdah [from Abu Burdah] from the Prophet (ﷺ) in Mursal form. This is more correct. Muhammad said: Ishaq bin Ibrahim reported from Mu'adh bin Hisham, from his father, from Qatadah, from Anas, from the Prophet (ﷺ) who said: 'Indeed Allah will question everyone who is responsible about his charge.' I heard Muhammad saying: This is not preserved. It is only correct from Mu'adh bin Hisham from his father, from Qatadah, from Al-Hasan, from the Prophet (ﷺ), in Mursal form.",
        "malay_translation": "Ibrahim bin Bash-shar Ar-Ramadi meriwayatkan daripada Sufyan bin 'Uyainah, daripada Buraid bin 'Abdullah bin Abu Burdah, daripada Abu Burdah, daripada Abu Musa, daripada Nabi (ﷺ). Muhammad memaklumkan kepada saya tentang hal itu, daripada Ibrahim bin Bash-Shar [Ar-Ramadi]. Muhammad berkata: Lebih daripada seorang telah meriwayatkannya daripada Sufyan, daripada Buraid bin Abu Burdah [daripada Abu Burdah] daripada Nabi (ﷺ) dalam bentuk Mursal. Ini adalah lebih tepat. Muhammad berkata: Ishaq bin Ibrahim meriwayatkan daripada Mu'adh bin Hisham, daripada bapanya, daripada Qatadah, daripada Anas, daripada Nabi (ﷺ) yang bersabda: 'Sesungguhnya Allah akan menyoal setiap orang yang bertanggungjawab tentang apa yang diamanahkan kepadanya.' Saya mendengar Muhammad berkata: Ini tidak sahih. Ia hanya sahih daripada Mu'adh bin Hisham daripada bapanya, daripada Qatadah, daripada Al-Hasan, daripada Nabi (ﷺ), dalam bentuk Mursal.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنْ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏ أَلَا كُلُّكُمْ رَاعٍ، ‏‏‏‏‏‏وَكُلُّكُمْ مَسْئُولٌ عَنْ رَعِيَّتِهِ، ‏‏‏‏‏‏فَالْأَمِيرُ الَّذِي عَلَى النَّاسِ رَاعٍ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ، ‏‏‏‏‏‏وَالرَّجُلُ رَاعٍ عَلَى أَهْلِ بَيْتِهِ وَهُوَ مَسْئُولٌ عَنْهُمْ، ‏‏‏‏‏‏وَالْمَرْأَةُ رَاعِيَةٌ عَلَى بَيْتِ بَعْلِهَا وَهِيَ مَسْئُولَةٌ عَنْهُ، ‏‏‏‏‏‏وَالْعَبْدُ رَاعٍ عَلَى مَالِ سَيِّدِهِ وَهُوَ مَسْئُولٌ عَنْهُ، ‏‏‏‏‏‏أَلَا فَكُلُّكُمْ رَاعٍ، ‏‏‏‏‏‏وَكُلُّكُمْ مَسْئُولٌ عَنْ رَعِيَّتِهِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏وَأَبِي مُوسَى، ‏‏‏‏‏‏وَحَدِيثُ أَبِي مُوسَى غَيْرُ مَحْفُوظٍ، ‏‏‏‏‏‏وَحَدِيثُ أَنَسٍ غَيْرُ مَحْفُوظٍ، ‏‏‏‏‏‏وَحَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَكَاهُ إِبْرَاهِيمُ بْنُ بَشَّارٍ الرَّمَادِيُّ، ‏‏‏‏‏‏عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ، ‏‏‏‏‏‏عَنْ أَبِي بُرْدَةَ، ‏‏‏‏‏‏عَنْ أَبِي مُوسَى، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏أَخْبَرَنِي بِذَلِكَ مُحَمَّدٌ بِنِ إِبْرَاهِيمَ بْنِ بَشَّارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَرَوَى غَيْرُ وَاحِدٍ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏عَنْ بُرَيْدٍ، ‏‏‏‏‏‏عَنْ أَبِي بُرْدَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا وَهَذَا أَصَحُّ، ‏‏‏‏‏‏قَالَ مُحَمَّدٌ:‏‏‏‏ وَرَوَى إِسْحَاق بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ مُعَاذِ بْنِ هِشَامٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِنَّ اللَّهَ سَائِلٌ كُلَّ رَاعٍ عَمَّا اسْتَرْعَاهُ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْت مُحَمَّدًا، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ هَذَا غَيْرُ مَحْفُوظٍ، ‏‏‏‏‏‏وَإِنَّمَا الصَّحِيحُ عَنْ مُعَاذِ بْنِ هِشَامٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ الْحَسَنِ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا."
      },
      {
        "id": 16830,
        "hadith_number": "1706",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Ketaatan kepada Pemimpin yang Dilantik Walaupun Hamba Habsyi",
        "perawi_melayu": "Umm Al-Husain Al-Ahmasiyyah",
        "english_text": "Narrated Umm Al-Husain Al-Ahmasiyyah: I heard the Messenger of Allah (ﷺ) delivering Khutbah during the farewell Hajj, and he was wearing a Burd which he had wrapped from under his armpit. She said: I was look at muscle of his upper arm quivering and I heard him saying: O you people! Have Taqwa of Allah. If a mutilated Ethiopian slave is put in command over you, then listen to him and obey him, as long as he upholds the Book of Allah among you.' [Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah and 'Irbad bin Sariyah. This Hadith is Hasan Sahih, it has been reported through other routes from Umm Husain.",
        "malay_translation": "Diriwayatkan daripada Umm Al-Husain Al-Ahmasiyyah: Aku mendengar Rasulullah (ﷺ) menyampaikan Khutbah semasa Haji Wada', dan baginda memakai Burd yang dililit dari bawah ketiaknya. Beliau berkata: Aku melihat otot lengan atas baginda bergetar dan aku mendengar baginda bersabda: Wahai manusia! Bertaqwalah kepada Allah. Jika seorang hamba Habsyi yang kudung dilantik menjadi pemimpin kamu, maka dengar dan taatilah dia, selagi mana dia menegakkan Kitab Allah di antara kamu.' [Abu 'Eisa berkata:] Terdapat riwayat mengenai topik ini daripada Abu Hurairah dan 'Irbad bin Sariyah. Hadith ini Hasan Sahih, ia diriwayatkan melalui jalur lain daripada Umm Husain.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى النَّيْسَابُورِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَاق، عَنْ الْعَيْزَارِ بْنِ حُرَيْثٍ، عَنْ أُمِّ الْحُصَيْنِ الْأَحْمَسِيَّةِ، قَالَتْ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ فِي حَجَّةِ الْوَدَاعِ، ‏‏‏‏‏‏وَعَلَيْهِ بُرْدٌ قَدِ الْتَفَعَ بِهِ مِنْ تَحْتِ إِبْطِهِ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ فَأَنَا أَنْظُرُ إِلَى عَضَلَةِ عَضُدِهِ تَرْتَجُّ، ‏‏‏‏‏‏سَمِعْتُهُ يَقُولُ:‏‏‏‏ يَا أَيُّهَا النَّاسُ، ‏‏‏‏‏‏اتَّقُوا اللَّهَ، ‏‏‏‏‏‏وَإِنْ أُمِّرَ عَلَيْكُمْ عَبْدٌ حَبَشِيٌّ مُجَدَّعٌ، ‏‏‏‏‏‏فَاسْمَعُوا لَهُ، ‏‏‏‏‏‏وَأَطِيعُوا مَا أَقَامَ لَكُمْ كِتَابَ اللَّهِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَعِرْبَاضِ بْنِ سَارِيَةَ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ أُمِّ حُصَيْنٍ."
      },
      {
        "id": 16831,
        "hadith_number": "1707",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Kewajipan Mendengar dan Mentaati Kecuali dalam Kemungkaran",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Narrated Ibn 'Umar: That the Messenger of Allah (ﷺ) said: Hearing and obeying is required from every Muslim man - in what he like and what he dislikes - as long as he is not ordered with disobedience. If he is ordered with disobedience, then no hearing or obeying is required of him. [Abu 'Eisa said:] There are narrations on this topic from 'Ali, 'Imran bin Husain, and Al-Hakam bin 'Amr Al-Ghifari. This Hadith is Hasan Sahih.",
        "malay_translation": "Diriwayatkan daripada Ibn 'Umar: Bahawa Rasulullah (ﷺ) bersabda: Mendengar dan mentaati adalah wajib bagi setiap lelaki Muslim – dalam perkara yang dia suka dan perkara yang dia tidak suka – selagi mana dia tidak diperintahkan dengan kemungkaran. Jika dia diperintahkan dengan kemungkaran, maka tidak ada kewajipan mendengar atau mentaati baginya. [Abu 'Eisa berkata:] Terdapat riwayat mengenai topik ini daripada 'Ali, 'Imran bin Husain, dan Al-Hakam bin 'Amr Al-Ghifari. Hadith ini Hasan Sahih.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنْ ابْنِ عُمَرَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ السَّمْعُ وَالطَّاعَةُ عَلَى الْمَرْءِ الْمُسْلِمِ فِيمَا أَحَبَّ وَكَرِهَ، ‏‏‏‏‏‏مَا لَمْ يُؤْمَرْ بِمَعْصِيَةٍ، ‏‏‏‏‏‏فَإِنْ أُمِرَ بِمَعْصِيَةٍ، ‏‏‏‏‏‏فَلَا سَمْعَ عَلَيْهِ وَلَا طَاعَةَ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ عَلِيٍّ، ‏‏‏‏‏‏وَعِمْرَانَ بْنِ حُصَيْنٍ، ‏‏‏‏‏‏وَالْحَكَمِ بْنِ عَمْرٍو الْغِفَارِيِّ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 16832,
        "hadith_number": "1708",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Larangan Menghasut Pergaduhan Antara Binatang",
        "perawi_melayu": "Abu Yahya, Mujahid, Ibn 'Abbas",
        "english_text": "Narrated Abu Yahya: From Mujahid from Ibn 'Abbas who said: The Messenger of Allah (ﷺ) prohibited instigating fights between beasts.",
        "malay_translation": "Diriwayatkan daripada Abu Yahya: Daripada Mujahid daripada Ibn 'Abbas yang berkata: Rasulullah (ﷺ) melarang menghasut pergaduhan antara binatang-binatang.",
        "arabic_text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ قُطْبَةَ بْنِ عَبْدِ الْعَزِيزِ، عَنْ الْأَعْمَشِ، عَنْ أَبِي يَحْيَى، عَنْ مُجَاهِدٍ، عَنْ ابْنِ عَبَّاسٍ، قَالَ:‏‏‏‏ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ التَّحْرِيشِ بَيْنَ الْبَهَائِمِ ."
      },
      {
        "id": 16833,
        "hadith_number": "1709",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Larangan Menghasut Perkelahian Antara Binatang Buas",
        "perawi_melayu": "Tidak dinyatakan",
        "english_text": "Abu Yahya reported from Mujahid: The Prophet (ﷺ) prohibited instigating fights between beasts. And he did not mention from Ibn 'Abbas in it. It is said that this is more correct that the (previous) narration of Qutbah.",
        "malay_translation": "Abu Yahya meriwayatkan daripada Mujahid: Nabi (ﷺ) melarang menghasut perkelahian antara binatang buas. Dan beliau tidak menyebut daripada Ibn 'Abbas di dalamnya. Dikatakan bahawa ini lebih sahih daripada riwayat (sebelumnya) daripada Qutbah.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ الْأَعْمَشِ، عَنْ أَبِي يَحْيَى، عَنْ مُجَاهِدٍ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ نَهَى عَنِ التَّحْرِيشِ بَيْنَ الْبَهَائِمِ ، ‏‏‏‏‏‏وَلَمْ يَذْكُرْ فِيهِ عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَيُقَالُ:‏‏‏‏ هَذَا أَصَحُّ مِنْ حَدِيثِ قُطْبَةَ، ‏‏‏‏‏‏وَرَوَى شَرِيكٌ هَذَا الْحَدِيثَ، ‏‏‏‏‏‏عَنْ الْأَعْمَشِ، عَنْ مُجَاهِدٍ، عَنْ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏نَحْوَهُ، ‏‏‏‏‏‏وَلَمْ يَذْكُرْ فِيهِ عَنْ أَبِي يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا بِذَلِكَ أَبُو كُرَيْبٍ، عَنْ يَحْيَى بْنِ آدَمَ، عَنْ شَرِيكٍ، ‏‏‏‏‏‏وَرَوَى أَبُو مُعَاوِيَةَ، عَنْ الْأَعْمَشِ، عَنْ مُجَاهِدٍ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏نَحْوَهُ، ‏‏‏‏‏‏وَأَبُو يَحْيَى هُوَ الْقَتَّاتُ الْكُوفِيُّ وَيُقَالُ اسْمُهُ:‏‏‏‏ زَاذَانُ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ طَلْحَةَ، ‏‏‏‏‏‏وَجَابِرٍ، ‏‏‏‏‏‏وَأَبِي سَعِيدٍ، ‏‏‏‏‏‏وَعِكْرَاشِ بْنِ ذُؤَيْبٍ."
      },
      {
        "id": 16834,
        "hadith_number": "1710",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Larangan Menanda Pada Muka dan Memukulnya",
        "perawi_melayu": "Jabir",
        "english_text": "Narrated Jabir: The Prophet (ﷺ) prohibited branding on the face and striking (it). [Abu 'Eisa said:] This Hadith is Hasan Sahih.",
        "malay_translation": "Diriwayatkan daripada Jabir: Nabi ﷺ melarang daripada menanda pada muka dan memukul (nya). [Abu 'Eisa berkata:] Hadis ini adalah Hasan Sahih.",
        "arabic_text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، عَنْ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ نَهَى عَنِ الْوَسْمِ فِي الْوَجْهِ وَالضَّرْبِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 16835,
        "hadith_number": "1711",
        "status": "sahih",
        "nama_buku": "Jami' al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Had Umur Menyertai Tentera dan Kedewasaan",
        "perawi_melayu": "Tidak Diriwayatkan",
        "english_text": "Narrated Nafi: That Ibn 'Umar said: I was reviewed before army, and I was fourteen years old, but he did not accept me. Then I was reviewed before him later in army while I was fifteen years old, and he accepted me. Nafi said: I narrated this Hadith to 'Umar bin 'Abdul-'Aziz and he said: 'This is the limit that distinguishes between youth and manhood.' The he wrote to give salaries to whoever reached fifteen years of age.",
        "malay_translation": "Diriwayatkan daripada Nafi': Bahawa Ibn 'Umar berkata: 'Saya diperiksa sebelum (diterima masuk) tentera, dan saya berumur empat belas tahun, tetapi beliau tidak menerima saya. Kemudian saya diperiksa di hadapannya kemudian dalam tentera ketika saya berumur lima belas tahun, dan beliau menerima saya.' Nafi' berkata: 'Saya meriwayatkan Hadis ini kepada 'Umar bin 'Abdul-'Aziz dan beliau berkata: 'Inilah batasan yang membezakan antara usia muda dan kedewasaan.' Kemudian beliau menulis untuk memberikan gaji kepada sesiapa yang mencapai usia lima belas tahun.",
        "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْوَزِيرِ الْوَاسِطِيُّ، حَدَّثَنَا إِسْحَاق بْنُ يُوسُفَ الْأَزْرَقُ، عَنْ سُفْيَانَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنْ ابْنِ عُمَرَ، قَالَ:‏‏‏‏ عُرِضْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَيْشٍ وَأَنَا ابْنُ أَرْبَعَ عَشْرَةَ فَلَمْ يَقْبَلْنِي، ‏‏‏‏‏‏ثُمَّ عُرِضْتُ عَلَيْهِ مِنْ قَابِلٍ فِي جَيْشٍ وَأَنَا ابْنُ خَمْسَ عَشْرَةَ فَقَبِلَنِي ، ‏‏‏‏‏‏قَالَ نَافِعٌ:‏‏‏‏ فَحَدَّثْتُ بِهَذَا الْحَدِيثِ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ هَذَا حَدُّ مَا بَيْنَ الصَّغِيرِ وَالْكَبِيرِ، ‏‏‏‏‏‏ثُمَّ كَتَبَ أَنْ يُفْرَضَ لِمَنْ بَلَغَ الْخَمْسَ عَشْرَةَ ."
      },
      {
        "id": 16836,
        "hadith_number": "1712",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Keutamaan Jihad dan Pengampunan Dosa",
        "perawi_melayu": "'Abdullah bin Abi Qatadah (meriwayatkan dari ayahnya)",
        "english_text": "Narrated 'Abdullah bin Abi Qatadah: That he heard is father, narating a Hadith, which he heard from the Messenger of Allah (ﷺ) in which he stood among them, mentioning to them that Jihad in the cause of Allah and faith in Allah were the most virtuous of deeds. Then a man stood and said: O Messenger of Allah! If I were killed in the cause of Allah, would my sins forgiven ? So the Messenger of Allah (ﷺ) said: Yes, If you are killed in Allah's cause, and you are patient, seeking the reward, advancing, not fleeing. Then the Messenger of Allah (ﷺ) said: What was it that you said? So he replied: If I were killed in the cause of Allah, would my sins be removed (forgiven)? So the Messenger of Allah (ﷺ) said: Yes, If you are patient, seeking the reward, advancing, not fleeing - except debt. For Jibril said that to me. [Abu 'Eisa said:] There are narrations on this topic from Anas, Muhammad bin Jahsh, And Abu Hurairah. This Hadith is Hasan Sahih. Some of them reported this Hadith from Sa'eed Al-Maqburi, from Abu Hurairah, from the Prophet (ﷺ) similar to this. Yahya bin Sa'eed Al-Ansari and more than one narrator reported this from Sa'eed Al-Maqburi from 'Abdullah bin Abi Qatadah, from his fahter, from the Prophet (ﷺ). This is more correct than the narration of Sa'eed Al-Maqburi from Abu Hurairah.",
        "malay_translation": "Diriwayatkan daripada 'Abdullah bin Abi Qatadah: Bahawa dia mendengar ayahnya meriwayatkan sebuah Hadith, yang dia dengar daripada Rasulullah (ﷺ), di mana Baginda berdiri di kalangan mereka, menyebutkan kepada mereka bahawa Jihad di jalan Allah dan keimanan kepada Allah adalah amalan yang paling utama. Kemudian seorang lelaki berdiri dan berkata: Wahai Rasulullah! Sekiranya aku terbunuh di jalan Allah, adakah dosa-dosaku akan diampunkan? Maka Rasulullah (ﷺ) bersabda: Ya, jika kamu terbunuh di jalan Allah, dan kamu bersabar, mengharapkan pahala, mara ke hadapan, tidak melarikan diri. Kemudian Rasulullah (ﷺ) bersabda: Apa yang kamu katakan tadi? Maka dia menjawab: Sekiranya aku terbunuh di jalan Allah, adakah dosa-dosaku akan dihapuskan (diampunkan)? Maka Rasulullah (ﷺ) bersabda: Ya, jika kamu bersabar, mengharapkan pahala, mara ke hadapan, tidak melarikan diri - kecuali hutang. Kerana Jibril telah berkata demikian kepadaku. [Abu 'Eisa berkata:] Terdapat riwayat mengenai topik ini daripada Anas, Muhammad bin Jahsh, dan Abu Hurairah. Hadith ini adalah Hasan Sahih. Sebahagian daripada mereka meriwayatkan Hadith ini daripada Sa'eed Al-Maqburi, daripada Abu Hurairah, daripada Nabi (ﷺ) yang serupa dengannya. Yahya bin Sa'eed Al-Ansari dan lebih daripada seorang perawi meriwayatkan ini daripada Sa'eed Al-Maqburi daripada 'Abdullah bin Abi Qatadah, daripada ayahnya, daripada Nabi (ﷺ). Ini adalah lebih sahih daripada riwayat Sa'eed Al-Maqburi daripada Abu Hurairah.",
        "arabic_text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَهُ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏أَنَّهُ قَامَ فِيهِمْ فَذَكَرَ لَهُمْ:‏‏‏‏ أَنَّ الْجِهَادَ فِي سَبِيلِ اللَّهِ، ‏‏‏‏‏‏وَالْإِيمَانَ بِاللَّهِ، ‏‏‏‏‏‏أَفْضَلُ الْأَعْمَالِ، ‏‏‏‏‏‏فَقَامَ رَجُلٌ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏أَرَأَيْتَ إِنْ قُتِلْتُ فِي سَبِيلِ اللَّهِ، ‏‏‏‏‏‏يُكَفِّرُ عَنِّي خَطَايَايَ ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏إِنْ قُتِلْتَ فِي سَبِيلِ اللَّهِ وَأَنْتَ صَابِرٌ مُحْتَسِبٌ مُقْبِلٌ غَيْرُ مُدْبِرٍ ، ‏‏‏‏‏‏ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ كَيْفَ قُلْتَ ؟ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَرَأَيْتَ إِنْ قُتِلْتُ فِي سَبِيلِ اللَّهِ، ‏‏‏‏‏‏أَيُكَفِّرُ عَنِّي خَطَايَايَ ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏وَأَنْتَ صَابِرٌ مُحْتَسِبٌ مُقْبِلٌ غَيْرُ مُدْبِرٍ، ‏‏‏‏‏‏إِلَّا الدَّيْنَ، ‏‏‏‏‏‏فَإِنَّ جِبْرِيلَ قَالَ لِي ذَلِكَ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏وَمُحَمَّدِ بْنِ جَحْشٍ، ‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَرَوَى بَعْضُهُمْ هَذَا الْحَدِيثَ عَنْ سَعِيدٍ الْمَقْبُرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ هَذَا، ‏‏‏‏‏‏وَرَوَى يَحْيَى بْنُ سَعِيدٍ الْأَنْصَارِيُّ، ‏‏‏‏‏‏وَغَيْرُ وَاحِدٍ هَذَا، ‏‏‏‏‏‏عَنْ سَعِيدٍ الْمَقْبُرِيِّ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَهَذَا أَصَحُّ مِنْ حَدِيثِ سَعِيدٍ الْمَقْبُرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ."
      },
      {
        "id": 16837,
        "hadith_number": "1713",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Cara Pengebumian Syuhada Uhud dan Keutamaan Ahli Al-Quran",
        "perawi_melayu": "Hisham bin 'Amr",
        "english_text": "Narrated Hisham bin 'Amr: On the day of Uhud, the wounded complained to the Messenger of Allah, so he said: 'Dig, and make it wide, and appropriate, and bury two and three in one grave. And advance the one who knew the most Qu'ran.' My father had died so he placed before two men. [Abu 'Eisa said:] There are narrations on this topic from Khabbab, Jabir, and Anas. This Hadith is Hasan Sahih Sufyan Ath-Thawri and others reported this Hadith from Ayyub, from Humaid bin Hilal, from Hisham bin 'Amir. And Abu Ad-Dahma's (a narrator in the chain) name is Qirfah bin Buhais or Baihas",
        "malay_translation": "Diriwayatkan daripada Hisham bin 'Amr: Pada hari Uhud, orang-orang yang cedera mengadu kepada Rasulullah SAW, lalu baginda bersabda: 'Galilah, dan luaskan, dan sesuaikan, dan kuburkan dua atau tiga orang dalam satu kubur. Dan dahulukan orang yang paling mengetahui Al-Quran.' Ayahku telah meninggal dunia lalu dia diletakkan di hadapan dua orang lelaki. [Abu 'Eisa berkata:] Terdapat riwayat mengenai topik ini daripada Khabbab, Jabir, dan Anas. Hadith ini adalah Hasan Sahih. Sufyan Ath-Thawri dan yang lain meriwayatkan Hadith ini daripada Ayyub, daripada Humaid bin Hilal, daripada Hisham bin 'Amir. Dan nama Abu Ad-Dahma' (seorang perawi dalam sanad) adalah Qirfah bin Buhais atau Baihas.",
        "arabic_text": "حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ الْبَصْرِيُّ، حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، عَنْ أَيُّوبَ، عَنْ حُمَيْدِ بْنِ هِلَالٍ، عَنْ أَبِي الدَّهْمَاءِ، عَنْ هِشَامِ بْنِ عَامِرٍ، قَالَ:‏‏‏‏ شُكِيَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجِرَاحَاتُ يَوْمَ أُحُدٍ فَقَالَ:‏‏‏‏ احْفِرُوا، ‏‏‏‏‏‏وَأَوْسِعُوا، ‏‏‏‏‏‏وَأَحْسِنُوا، ‏‏‏‏‏‏وَادْفِنُوا الِاثْنَيْنِ وَالثَّلَاثَةَ فِي قَبْرٍ وَاحِدٍ، ‏‏‏‏‏‏وَقَدِّمُوا أَكْثَرَهُمْ قُرْآنًا ، ‏‏‏‏‏‏فَمَاتَ أَبِي، ‏‏‏‏‏‏فَقُدِّمَ بَيْنَ يَدَيْ رَجُلَيْنِ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ خَبَّابٍ، ‏‏‏‏‏‏وَجَابِرٍ، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَرَوَى سُفْيَانُ الثَّوْرِيُّ، وَغَيْرُهُ هَذَا الْحَدِيثَ، ‏‏‏‏‏‏عَنْ أَيُّوبَ، عَنْ حُمَيْدِ بْنِ هِلَالٍ، عَنْ هِشَامِ بْنِ عَامِرٍ، وَأَبُو الدَّهْمَاءِ اسْمُهُ:‏‏‏‏ قِرْفَةُ بْنُ بُهَيْسٍ أَوْ بَيْهَسٍ."
      },
      {
        "id": 16838,
        "hadith_number": "1714",
        "status": "sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Musyawarah Rasulullah ﷺ Mengenai Tawanan Perang Badr",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Narrated Abu 'Ubaidah: That 'Abdullah said: On the Day of Badr when the captives were gathered, the Messenger of Allah (ﷺ) said: 'What do you (people) say about these captives?' Then he mentioned the story in the lengthy Hadith. [Abu 'Eisa said:] There are narrations of this topic from 'Umar, Abu Ayyub, Anas, and Abu Hurairah This Hadith is Hasan, and Abu 'Ubaidah did not hear from his father. It has been reported that Abu Hurairah said: None was more apt to seek council of his Companions than the Messenger of Allah (ﷺ)",
        "malay_translation": "Diriwayatkan dari Abu 'Ubaidah: Bahawa 'Abdullah berkata: Pada Hari Badr ketika tawanan perang dikumpulkan, Rasulullah (ﷺ) bersabda: 'Apa pendapat kamu (sekalian) tentang tawanan-tawanan ini?' Kemudian baginda menyebutkan kisah tersebut dalam Hadis yang panjang. [Abu 'Eisa berkata:] Terdapat riwayat mengenai topik ini daripada 'Umar, Abu Ayyub, Anas, dan Abu Hurairah. Hadis ini adalah Hasan, dan Abu 'Ubaidah tidak mendengar daripada bapanya. Telah diriwayatkan bahawa Abu Hurairah berkata: Tidak ada seorang pun yang lebih cenderung untuk meminta nasihat daripada para Sahabatnya selain Rasulullah (ﷺ)",
        "arabic_text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ الْأَعْمَشِ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ أَبِي عُبَيْدَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ:‏‏‏‏ لَمَّا كَانَ يَوْمُ بَدْرٍ، ‏‏‏‏‏‏وَجِيءَ بِالْأُسَارَى، ‏‏‏‏‏‏قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَا تَقُولُونَ فِي هَؤُلَاءِ الْأُسَارَى ؟ ، ‏‏‏‏‏‏فَذَكَرَ قِصَّةً فِي هَذَا الْحَدِيثِ طَوِيلَةً، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ عُمَرَ، ‏‏‏‏‏‏وَأَبِي أَيُّوبَ، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ، ‏‏‏‏‏‏وَأَبُو عُبَيْدَةَ لَمْ يَسْمَعْ مِنْ أَبِيهِ، ‏‏‏‏‏‏وَيُرْوَى عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَا رَأَيْتُ أَحَدًا أَكْثَرَ مَشُورَةً لِأَصْحَابِهِ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
      },
      {
        "id": 16839,
        "hadith_number": "1715",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Nabi ﷺ Enggan Berdagang dengan Jasad Orang Musyrik",
        "perawi_melayu": "Ibn 'Abbas",
        "english_text": "Narrated Ibn 'Abbas: The idolaters wanted to purchase the body of a man who was from the idolaters. But the Prophet (ﷺ) refused to trade with them [for him]. [Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from a narration of Al-Hakam. Al-Hajjaj bin Artah also reported it from Al-Ahkam. Ahmad bin Al-Hasan said: I heard Ahmad bin Hanbal saying: 'Ibn Abi Laila's narrations are not used as proof. Muhammad bin Isma'il said: Ibn Abi Laila is truthful, but his correct Ahadith are not recognizable from his weak ones. And I do not report anything from him. Ibn Abi Laila is truthful, and Faqih, the problem is only in the chain. Nasr bin 'Ali narrated to us, [he said:] Abdullah bin Dawud narrated us, from Sufyan Ath-Thawri who said: 'Our Fuqaha' are Ibn Abi Laila and 'Abdullah bin Shubrumah.'",
        "malay_translation": "Diriwayatkan daripada Ibn 'Abbas: Kaum musyrikin ingin membeli jasad seorang lelaki yang berasal dari kalangan kaum musyrikin. Tetapi Nabi (ﷺ) enggan berdagang dengan mereka [untuknya]. [Abu 'Eisa berkata:] Hadis ini adalah Hasan Gharib, kami tidak mengetahuinya kecuali daripada riwayat Al-Hakam. Al-Hajjaj bin Artah juga meriwayatkannya daripada Al-Ahkam. Ahmad bin Al-Hasan berkata: Saya mendengar Ahmad bin Hanbal berkata: 'Riwayat Ibn Abi Laila tidak digunakan sebagai bukti.' Muhammad bin Isma'il berkata: Ibn Abi Laila adalah seorang yang benar, tetapi hadis-hadisnya yang sahih tidak dapat dibezakan daripada hadis-hadisnya yang lemah. Dan saya tidak meriwayatkan apa-apa daripadanya. Ibn Abi Laila adalah seorang yang benar, dan Faqih, masalahnya hanya pada rantai periwayatan. Nasr bin 'Ali meriwayatkan kepada kami, [beliau berkata:] Abdullah bin Dawud meriwayatkan kepada kami, daripada Sufyan Ath-Thawri yang berkata: 'Fuqaha' kami adalah Ibn Abi Laila dan 'Abdullah bin Shubrumah.'",
        "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو أَحْمَدَ، حَدَّثَنَا سُفْيَانُ، عَنْ ابْنِ أَبِي لَيْلَى، عَنْ الْحَكَمِ، عَنْ مِقْسَمٍ، عَنْ ابْنِ عَبَّاسٍ أَنَّ الْمُشْرِكِينَ أَرَادُوا أَنْ يَشْتَرُوا جَسَدَ رَجُلٍ مِنَ الْمُشْرِكِينَ، ‏‏‏‏‏‏فَأَبَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَبِيعَهُمْ إِيَّاهُ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ الْحَكَمِ، ‏‏‏‏‏‏وَرَوَاهُ الْحَجَّاجُ بْنُ أَرْطَاةَ أَيْضًا عَنْ الْحَكَمِ، ‏‏‏‏‏‏وقَالَ أَحْمَدُ بْنُ الْحَسَنِ:‏‏‏‏ سَمِعْتُ أَحْمَدُ بْنُ حَنْبَلٍ، ‏‏‏‏‏‏يَقولُ:‏‏‏‏ ابْنُ أَبِي لَيْلَى لَا يُحْتَجُّ بِحَدِيثِهِ، ‏‏‏‏‏‏وقَالَ مُحَمَّدُ بْنُ إِسْمَاعِيل:‏‏‏‏ ابْنُ أَبِي لَيْلَى صَدُوقٌ وَلَكِنْ لَا نَعْرِفُ صَحِيحَ حَدِيثِهِ مِنْ سَقِيمِهِ وَلَا أَرْوِي عَنْهُ شَيْئًا، ‏‏‏‏‏‏وَابْنُ أَبِي لَيْلَى صَدُوقٌ فَقِيهٌ، ‏‏‏‏‏‏وَرُبَّمَا يَهِمُ فِي الْإِسْنَادِ، ‏‏‏‏‏‏حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ، ‏‏‏‏‏‏عَنْ سُفْيَانَ الثَّوْرِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فُقَهَاؤُنَا ابْنُ أَبِي لَيْلَى عَبْدُ اللَّهِ بْنُ شُبْرُمَةَ."
      },
      {
        "id": 16840,
        "hadith_number": "1716",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Tentera yang Melarikan Diri dan Gelaran Al-'Akkarun",
        "perawi_melayu": "Ibnu Umar",
        "english_text": "Narrated Ibn 'Umar: The Messenger of Allah sent us on a military expedition, and the people turned to escape. So we arrived in Al-Madinah and concealed ourselves in it and we said: 'We are ruined.' Then we went to the Messenger of Allah (ﷺ) and we said: 'O Messenger of Allah! We are those who fled.' He said: 'Rather you are Al-'Akkarun (those who are regrouping) and I am your reinforcement. [Abu 'Eisa said:] This Hadith is Hasan Gharib. We do not know of it except as a narration of Yazid bin Abi Ziyad. And the meaning of his saying: The people turned to escape is that they fled from the fighting. As for the meaning of his saying: Rather you are Al-'Akkarun, the 'Akkar is the one who flees to his Imam in order that he may help him, it does not mean fleeing from the advancing army.",
        "malay_translation": "Diriwayatkan oleh Ibnu Umar: Rasulullah ﷺ telah menghantar kami dalam ekspedisi ketenteraan, dan orang ramai berpaling untuk melarikan diri. Maka kami tiba di Madinah dan menyembunyikan diri kami di dalamnya dan kami berkata: 'Kami telah binasa.' Kemudian kami pergi kepada Rasulullah ﷺ dan kami berkata: 'Wahai Rasulullah! Kami adalah orang-orang yang melarikan diri.' Baginda bersabda: 'Bahkan kamu adalah Al-'Akkarun (mereka yang berkumpul semula) dan aku adalah sokongan kamu.' [Abu 'Eisa berkata:] Hadith ini Hasan Gharib. Kami tidak mengetahui tentangnya kecuali sebagai riwayat daripada Yazid bin Abi Ziyad. Dan maksud perkataan baginda: Orang ramai berpaling untuk melarikan diri adalah bahawa mereka melarikan diri daripada pertempuran. Adapun maksud perkataan baginda: Bahkan kamu adalah Al-'Akkarun, 'Akkar adalah orang yang melarikan diri kepada Imamnya agar dia dapat membantunya, ia tidak bermakna melarikan diri daripada tentera yang mara.",
        "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ ابْنِ عُمَرَ، قَالَ:‏‏‏‏ بَعَثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَرِيَّةٍ، ‏‏‏‏‏‏فَحَاصَ النَّاسُ حَيْصَةً، ‏‏‏‏‏‏فَقَدِمْنَا الْمَدِينَةَ، ‏‏‏‏‏‏فَاخْتَبَيْنَا بِهَا وَقُلْنَا:‏‏‏‏ هَلَكْنَا، ‏‏‏‏‏‏ثُمَّ أَتَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْنَا:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏نَحْنُ الْفَرَّارُونَ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ بَلْ أَنْتُمُ الْعَكَّارُونَ وَأَنَا فِئَتُكُمْ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ يَزِيدَ بْنِ أَبِي زِيَادٍ، ‏‏‏‏‏‏وَمَعْنَى قَوْلِهِ:‏‏‏‏ فَحَاصَ النَّاسُ حَيْصَةً، ‏‏‏‏‏‏يَعْنِي:‏‏‏‏ أَنَّهُمْ فَرُّوا مِنَ الْقِتَالِ، ‏‏‏‏‏‏وَمَعْنَى قَوْلِهِ:‏‏‏‏ بَلْ أَنْتُمُ الْعَكَّارُونَ ، ‏‏‏‏‏‏وَالْعَكَّارُ:‏‏‏‏ الَّذِي يَفِرُّ إِلَى إِمَامِهِ لِيَنْصُرَهُ، ‏‏‏‏‏‏لَيْسَ يُرِيدُ الْفِرَارَ مِنَ الزَّحْفِ."
      },
      {
        "id": 16841,
        "hadith_number": "1717",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Arahan Mengembalikan Jenazah Syuhada Uhud ke Tempat Asal",
        "perawi_melayu": "Jabir bin ‘Abdullah",
        "english_text": "Narrated Jabir bin ‘Abdullah : On the day of Uhud, my father's sister came with my father to bury him in a cemetery of ours. So one of the callers of the Messenger of Allah (ﷺ) called out: 'Return those killed to where they were lying. [Abu 'Eisa said:] This Hadith is Hasan Sahih. And (one of the narrators) Nubaih is trustworthy.",
        "malay_translation": "Diriwayatkan dari Jabir bin ‘Abdullah: Pada hari Uhud, saudara perempuan ayahku datang bersama ayahku untuk mengebumikannya di perkuburan kami. Maka salah seorang penyeru Rasulullah (ﷺ) menyeru: 'Kembalikan orang-orang yang terbunuh ke tempat mereka terbaring.' [Abu 'Eisa berkata:] Hadith ini Hasan Sahih. Dan (salah seorang perawi) Nubaih adalah seorang yang dipercayai.",
        "arabic_text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو دَاوُدَ، أَخْبَرَنَا شُعْبَةُ، عَنْ الْأَسْوَدِ بْنِ قَيْسٍ، قَال:‏‏‏‏ سَمِعْتُ نُبَيْحًا الْعَنَزِيَّ يُحَدِّثُ، ‏‏‏‏‏‏عَنْ جَابِرٍ، قَالَ:‏‏‏‏ لَمَّا كَانَ يَوْمُ أُحُدٍ، ‏‏‏‏‏‏جَاءَتْ عَمَّتِي بِأَبِي لِتَدْفِنَهُ فِي مَقَابِرِنَا، ‏‏‏‏‏‏فَنَادَى مُنَادِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ رُدُّوا الْقَتْلَى إِلَى مَضَاجِعِهِمْ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَنُبَيْحٌ ثِقَةٌ."
      },
      {
        "id": 16842,
        "hadith_number": "1718",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Sambutan Orang Ramai Terhadap Rasulullah SAW di Thaniyyah Al-Wada' Selepas Tabuk",
        "perawi_melayu": "Tidak Diketahui",
        "english_text": "Narrated As-Sa'ib bin Yazid: When the Messenger of Allah (ﷺ) arrived from Tabuk, the people went out to Thaniyyah Al-Wada' to meet him. As-Sa'ib said: I went out with the people, and I was a boy. [Abu 'Eisa said:] This Hadith is Hasan Sahih.",
        "malay_translation": "Diriwayatkan daripada As-Sa'ib bin Yazid: Ketika Rasulullah (ﷺ) tiba dari Tabuk, orang ramai keluar ke Thaniyyah Al-Wada' untuk menemuinya. As-Sa'ib berkata: Saya keluar bersama orang ramai, dan saya masih seorang budak lelaki. [Abu 'Eisa berkata:] Hadis ini Hasan Sahih.",
        "arabic_text": "حَدَّثَنَا حَدَّثَنَا ابْنُ أَبِي عُمَرَ، وَسَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ، قَالَا:‏‏‏‏ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ الزُّهْرِيِّ، عَنْ السَّائِبِ بْنِ يَزِيدَ، قَالَ:‏‏‏‏ لَمَّا قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ تَبُوكَ، ‏‏‏‏‏‏خَرَجَ النَّاسُ يَتَلَقَّوْنَهُ إِلَى ثَنِيَّةِ الْوَدَاعِ ، ‏‏‏‏‏‏قَالَ السَّائِبُ:‏‏‏‏ فَخَرَجْتُ مَعَ النَّاسِ وَأَنَا غُلَامٌ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
      },
      {
        "id": 16843,
        "hadith_number": "1719",
        "status": "Sahih",
        "nama_buku": "Jami' Al-Tirmidhi",
        "penulis_buku": "Abu `Isa Muhammad at-Tirmidhi",
        "tajuk_hadith": "Harta Bani An-Nadir dan Penggunaannya oleh Rasulullah ﷺ",
        "perawi_melayu": "'Umar bin Al-Khattab",
        "english_text": "Narrated 'Umar bin Al-Khattab: The wealth of Banu An-Nadir was among the spoils of war which Allah granted upon His Messenger (ﷺ) which the Muslims did not gain with the rush of their horses nor camel. So it was purely for the Messenger of Allah (ﷺ), and the Messenger of Allah (ﷺ) would set aside a year's worth of expenditure for his family, then he would use what remained of it for horses and weapons to be used in Allah's cause. [Abu 'Eisa said:] This Hadith is Hasan Sahih. Sufyan bin 'Uyainah reported this Hadith from Ma'mar, from Ibn Shihab.",
        "malay_translation": "Diriwayatkan daripada 'Umar bin Al-Khattab: Harta Bani An-Nadir adalah antara harta rampasan perang yang Allah kurniakan kepada Rasul-Nya (ﷺ) yang mana umat Islam tidak memperolehi dengan kekuatan kuda dan unta mereka. Maka ia adalah khusus untuk Rasulullah (ﷺ), dan Rasulullah (ﷺ) akan menyimpan perbelanjaan untuk keluarganya selama setahun, kemudian baginda akan menggunakan apa yang lebih daripadanya untuk kuda dan senjata yang akan digunakan untuk perjuangan di jalan Allah. [Abu 'Eisa berkata:] Hadith ini Hasan Sahih. Sufyan bin 'Uyainah meriwayatkan Hadith ini daripada Ma'mar, daripada Ibn Shihab.",
        "arabic_text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ ابْنِ شِهَابٍ، عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ، قَالَ:‏‏‏‏ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ، يَقُولُ:‏‏‏‏ كَانَتْ أَمْوَالُ بَنِي النَّضِيرِ مِمَّا أَفَاءَ اللهُ عَلَى رَسُولِهِ مِمَّا لَمْ يُوجِفْ الْمُسْلِمُونَ عَلَيْهِ بِخَيْلٍ وَلَا رِكَابٍ، ‏‏‏‏‏‏وَكَانَتْ لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ خَالِصًا، ‏‏‏‏‏‏وَكَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَعْزِلُ نَفَقَةَ أَهْلِهِ سَنَةً، ‏‏‏‏‏‏ثُمَّ يَجْعَلُ مَا بَقِيَ فِي الْكُرَاعِ وَالسَّلَاحِ عُدَّةً فِي سَبِيلِ اللهِ ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَرَوَى سُفْيَانُ بْنُ عُيَيْنَةَ هَذَا الْحَدِيثَ، ‏‏‏‏‏‏عَنْ مَعْمَرٍ، ‏‏‏‏‏‏عَنِ ابْنِ شِهابٍ."
      }
    ]
  }
}